#Область СлужебныйПрограммныйИнтерфейс

#Область ОткрытиеФорм

// Открыть форму журнала документов "Аттестации сотрудников".
// 
// Параметры:
//  ФормаВладелец - ФормаКлиентскогоПриложения
//  ФизическоеЛицо - ДанныеФормыСтруктура 
//  Подразделение - СправочникСсылка.ПодразделенияОрганизаций,Неопределено
//	ИзФормыСотрудника - Булево
Процедура ОткрытьФормуАттестацииСотрудников(ФормаВладелец, ФизическоеЛицо, Подразделение = Неопределено, ИзФормыСотрудника = Ложь) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФизическоеЛицо", ФизическоеЛицо.Ссылка);
	ПараметрыФормы.Вставить("Заголовок", ФизическоеЛицо.Наименование);
	
	Если ИзФормыСотрудника Тогда 
		ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыФормы.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	ОткрытьФорму("ЖурналДокументов.АттестацииСотрудников.ФормаСписка", ПараметрыФормы, ФормаВладелец);

КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// См. ОтчетыКлиентПереопределяемый.ОбработчикКоманды.
//
Процедура ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	Если ФормаОтчета.ИмяФормы = "Отчет.СотрудникиПодлежащиеАттестации.Форма" Тогда
		
		Если Команда.Имя = "НаправитьНаАттестацию" Тогда
			
			ЗаполнитьДокументИзОтчета(ФормаОтчета);
			
		КонецЕсли;
		
		Результат = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОтчетыКлиентПереопределяемый.ОбработкаДополнительнойРасшифровки.
//
Процедура ОбработкаДополнительнойРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет.СотрудникиПодлежащиеАттестации" Тогда

		СтандартнаяОбработка = Ложь;
		
		КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
		
		ИменаПолейРасшифровки = Новый Массив;
		ИменаПолейРасшифровки.Добавить("Сотрудник");
		ИменаПолейРасшифровки.Добавить("Подразделение");
		ИменаПолейРасшифровки.Добавить("Организация");
		ИменаПолейРасшифровки.Добавить("ВидАттестации");
		
		ПараметрыРасшифровки = ЗарплатаКадрыРасширенныйКлиент.НовыеПараметрыДополнительнойРасшифровкиОтчета();
		ПараметрыРасшифровки.ИменаПолейРасшифровки = ИменаПолейРасшифровки;
		ПараметрыРасшифровки.ИменаДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПриказОбАттестацииСотрудников");
		ПараметрыРасшифровки.ВариантОтчетаДляЗаполнения = (ФормаОтчета.КлючТекущегоВарианта = "Основной");
		ПараметрыРасшифровки.РегистраторРасшифровки = Неопределено;
		
		ЗарплатаКадрыРасширенныйКлиент.ОбработкаДополнительнойРасшифровкиТематическогоОтчета(ФормаОтчета, Расшифровка, ПараметрыРасшифровки, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументИзОтчета(ФормаОтчета, КомандаЗаполнения = Неопределено) Экспорт
	
	Если ФормаОтчета.ОтчетДанныеРасшифровки = "" Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("Организация");
	МассивПолей.Добавить("Подразделение");
	МассивПолей.Добавить("ВидАттестации");
	МассивПолей.Добавить("Сотрудник");
	
	Если ФормаОтчета.ХранилищеРезультатаОтчета = "" Тогда
		
		ФормаОтчета.ХранилищеРезультатаОтчета = ЗарплатаКадрыРасширенныйВызовСервера.ХранилищеТаблицыРезультатаОтчета(
			ФормаОтчета.Отчет.КомпоновщикНастроек,
			"СотрудникиПодлежащиеАттестации",
			"ОсновнаяСхемаКомпоновкиДанных",
			МассивПолей);
			
	КонецЕсли;
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Организация");
	МассивГруппировок.Добавить("ВидАттестации");
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Сотрудник");

	МассивДанных = ЗарплатаКадрыРасширенныйКлиент.ДанныеРасшифровкиИзОтчета(
		ФормаОтчета.ОтчетДанныеРасшифровки,
		ФормаОтчета.ХранилищеРезультатаОтчета,
		ФормаОтчета.ОтчетТабличныйДокумент,
		МассивПолей,
		МассивГруппировок,
		МассивКолонок);
		
	Для Каждого СтруктураЗаполнения Из МассивДанных Цикл
		Если АттестацииСотрудниковВызовСервера.ЭтоВнешняяАттестация(СтруктураЗаполнения.ВидАттестации) Тогда
			ОткрытьФорму("Документ.НаправлениеНаВнешнююАттестацию.Форма.ФормаДокумента", Новый Структура("Основание", СтруктураЗаполнения),,Истина);
		Иначе
			ОткрытьФорму("Документ.ПриказОбАттестацииСотрудников.Форма.ФормаДокумента", Новый Структура("Основание", СтруктураЗаполнения),,Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти