#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет запись в регистр.
//
// Параметры:
//  ОбъектДанных - СправочникСсылка, ДокументСсылка - объект события.
//  ТипСобытия - ПеречислениеСсылка.СобытияОбменаС1САрхивом - тип события.
//  ОписаниеСобытия - Строка - текстовое описание события.
//  СтатусОбмена - ПеречислениеСсылка.СтатусыОбменаС1САрхивом - новый статус для события ИзменениеСтатусаОбмена.
//  ДатаСобытияУниверсальная - Дата, Неопределено - дата события в формате UTC.
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - пользователь, инициировавший событие.
//  ДополнительныеСведения - Строка - поясняющие сведения.
//
Процедура Добавить(
			ОбъектДанных,
			ТипСобытия,
			ОписаниеСобытия = "",
			СтатусОбмена = Неопределено,
			Знач ДатаСобытияУниверсальная = Неопределено,
			Знач Пользователь = Неопределено,
			ДополнительныеСведения = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ОбъектДанных) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при записи в историю обмена: ОбъектДанных не заполнен'");
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(ТипСобытия) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при записи в историю обмена: ТипСобытия не заполнен'");
	КонецЕсли;		

	Если Не ЗначениеЗаполнено(ДатаСобытияУниверсальная) Тогда
		ДатаСобытияУниверсальная = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ОбъектДанных = ОбъектДанных;
	Запись.ДатаСобытия = ДатаСобытияУниверсальная;
	Запись.Пользователь = Пользователь;
	Запись.ТипСобытия = ТипСобытия;
	Запись.СтатусОбмена = СтатусОбмена;
	Запись.ОписаниеСобытия = ОписаниеСобытия;
	Запись.ДополнительныеСведения = ДополнительныеСведения;
	Запись.Записать();
	
КонецПроцедуры

// Проверяет наличие записей в регистре.
//
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - ссылка на объект.
//
// Возвращаемое значение:
//  Булево - Истина, если есть хотя бы одна запись по объекту.
// 
Функция ЕстьЗаписиПоОбъекту(СсылкаНаОбъект) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ИсторияОбменаС1САрхивом КАК ИсторияОбменаС1САрхивом
		|ГДЕ
		|	ИсторияОбменаС1САрхивом.ОбъектДанных = &СсылкаНаОбъект");
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
