#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Интеграция рекрутинговых сайтов";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Настройки интеграции рекрутинговых сайтов", СтатистикаРекрутинговыхСайтов());
	Статистика.Вставить("Данные публикации вакансий", СтатистикаПубликацийВакансий());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Данные публикации резюме", СтатистикаПубликацийРезюме(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаРекрутинговыхСайтов()
	
	Таблица = Метаданные.РегистрыСведений.НастройкиИнтеграцииРекрутинговыхСайтов;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.РекрутинговыйСайт;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Настроек интеграций";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.Пользователь;
	ДанныеГруппировки.ПредставлениеГруппировки = "Пользователей";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДополнительныеОтборы = Новый Массив;
	
	ДополнительныйОтбор = СборСтатистики.ДополнительныйОтбор();
	ДополнительныйОтбор.ИмяОтбора = "Использовать";
	ДополнительныйОтбор.ЗначениеОтбора = Истина;
	ДополнительныйОтбор.ВидСравнения = "=";
	ДополнительныеОтборы.Добавить(ДополнительныйОтбор);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ДополнительныеОтборы = ДополнительныеОтборы;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПубликацийВакансий()
	
	Таблица = Метаданные.РегистрыСведений.ДанныеПубликацииВакансий;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.Вакансия;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Вакансий";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.МестоПубликации;
	ДанныеГруппировки.ПредставлениеГруппировки = "Мест публикаций";
	ДанныеГруппировки.Предопределенные = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПубликацийРезюме(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПубликацииРезюме.МестоПубликации КАК МестоПубликации,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеПубликацииРезюме.Кандидат) КАК Кандидатов
		|ИЗ
		|	РегистрСведений.ДанныеПубликацииРезюме КАК ДанныеПубликацииРезюме
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО ДанныеПубликацииРезюме.Кандидат = Кандидаты.Ссылка
		|ГДЕ
		|	Кандидаты.ДатаРегистрации > &НачалоПериода
		|	И Кандидаты.ДатаРегистрации <= &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПубликацииРезюме.МестоПубликации
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МестоПубликации),
		|	СУММА(Кандидатов)
		|ПО
		|	ОБЩИЕ";
		
	ПоказателиСтатистики = Новый Соответствие;
	ВыборкаВсего = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВсего.Следующий() Цикл
		
		ПоказателиСтатистики.Вставить("Кандидатов", ВыборкаВсего.Кандидатов);
		ПоказателиСтатистики.Вставить("Мест публикаций", ВыборкаВсего.МестоПубликации);
		
		ВСреднемНаМестоПубликации = СборСтатистики.ОбъектовВСреднем(ВыборкаВсего.Кандидатов, ВыборкаВсего.МестоПубликации);
		Если ВСреднемНаМестоПубликации <> Неопределено Тогда
			ПоказателиСтатистики.Вставить("Кандидатов в среднем(Место публикации)", ВСреднемНаМестоПубликации);
		КонецЕсли;
		
		КандидатовМестаПубликации = Новый Массив;
		ВыборкаМестаПубликации = ВыборкаВсего.Выбрать();
		Пока ВыборкаМестаПубликации.Следующий() Цикл
			Если ВыборкаМестаПубликации.МестоПубликации.Предопределенный Тогда
				ПоказателиСтатистики.Вставить(Строка(ВыборкаМестаПубликации.МестоПубликации), ВыборкаМестаПубликации.Кандидатов);
			КонецЕсли;
			КандидатовМестаПубликации.Добавить(ВыборкаМестаПубликации.Кандидатов);
		КонецЦикла;
		
		Дисперсия = СборСтатистики.Дисперсия(ВыборкаВсего.МестоПубликации, КандидатовМестаПубликации, ВСреднемНаМестоПубликации);
		Если Дисперсия <> Неопределено Тогда
			ПоказателиСтатистики.Вставить("Дисперсия кандидатов(Место публикации)", Дисперсия);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти