#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Организация", Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОрганизации = Новый Структура;
	ПроцессыОбработкиДокументовПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации);
	
	ДанныеОрганизации.Свойство("Наименование", НаименованиеОрганизации);
	ДанныеОрганизации.Свойство("Регион", МестоИзданияПриказа);
	ДанныеОрганизации.Свойство("Должность", ДолжностьРуководителя);
	
	ДатаПриказа = ТекущаяДатаСеанса();
	ДатаВступленияВСилу = ДатаПриказа;
	
	ЧастиИмени = Новый Структура;
	ЧастиИмени.Вставить("Фамилия",  ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Фамилия", ""));
	ЧастиИмени.Вставить("Имя",      ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Имя", ""));
	ЧастиИмени.Вставить("Отчество", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Отчество", ""));
	
	ФИОРуководителя = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если ПараметрыЗаполнены() Тогда
		СформироватьПоложение();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеПринятияРешенияОФормировании", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Заполнены не все поля. Продолжить?'"), 
						РежимДиалогаВопрос.ОКОтмена,,,
						НСтр("ru='Проверка заполнения'")); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеПринятияРешенияОФормировании(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.ОК Тогда 
		СформироватьПоложение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПоложение()
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("НаименованиеОрганизации", НаименованиеОрганизации);
	ПараметрыЗаполнения.Вставить("НомерПриказа", НомерПриказа);
	ПараметрыЗаполнения.Вставить("ДатаПриказа", Формат(ДатаПриказа, "ДЛФ=D"));
	ПараметрыЗаполнения.Вставить("МестоИзданияПриказа", МестоИзданияПриказа);
	ПараметрыЗаполнения.Вставить("ДанныеАдминистратора", ДанныеАдминистратора);
	ПараметрыЗаполнения.Вставить("ДатаВступленияВСилу", Формат(ДатаВступленияВСилу, "ДЛФ=D"));
	ПараметрыЗаполнения.Вставить("ДанныеУполномоченногоЛица", ДанныеУполномоченногоЛица);
	ПараметрыЗаполнения.Вставить("ДолжностьРуководителя", ДолжностьРуководителя);
	ПараметрыЗаполнения.Вставить("ФИОРуководителя", ФИОРуководителя);
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	
	ПоложениеОбИспользованииПЭП = ШаблонПоложенияОбИспользованииПЭП(ПараметрыЗаполнения);
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Приказ,ПриложениеКПриказу,Приложение1,Приложение2");
	
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Приказ"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = ПоложениеОбИспользованииПЭП.Получить("Приказ");
	ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Приказ'");
	
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "ПриложениеКПриказу"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = ПоложениеОбИспользованииПЭП.Получить("ПриложениеКПриказу");
	ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Приложение к приказу'");
	
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Приложение1"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = ПоложениеОбИспользованииПЭП.Получить("Приложение1");
	ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Приложение 1'");
	
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "Приложение2"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = ПоложениеОбИспользованииПЭП.Получить("Приложение2");
	ОписаниеПечатнойФормы.СинонимМакета = НСтр("ru = 'Приложение 2'");
	
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗаполнены()
	
	ПроверяемыеРеквизиты = Новый Массив;
	
	ПроверяемыеРеквизиты.Добавить("НаименованиеОрганизации");
	ПроверяемыеРеквизиты.Добавить("НомерПриказа");
	ПроверяемыеРеквизиты.Добавить("ДатаПриказа");
	ПроверяемыеРеквизиты.Добавить("МестоИзданияПриказа");
	ПроверяемыеРеквизиты.Добавить("ДанныеАдминистратора");
	ПроверяемыеРеквизиты.Добавить("ДатаВступленияВСилу");
	ПроверяемыеРеквизиты.Добавить("ДанныеУполномоченногоЛица");
	ПроверяемыеРеквизиты.Добавить("ДолжностьРуководителя");
	ПроверяемыеРеквизиты.Добавить("ФИОРуководителя");
	ПроверяемыеРеквизиты.Добавить("Организация");
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ПроверяемыйРеквизит]) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ШаблонПоложенияОбИспользованииПЭП(ПараметрыЗаполнения)
	
	ПечатныеФормы = Новый Соответствие;
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	Макет = МодульУправлениеПечатью.МакетПечатнойФормы(
		СтрШаблон("Обработка.ПодготовкаДокументовПОД.ПФ_MXL_ШаблонПоложенияОбИспользованииПЭП_%1", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
	
	МакетУведомления = МодульУправлениеПечатью.МакетПечатнойФормы(
		СтрШаблон("Обработка.ПодготовкаДокументовПОД.ПФ_MXL_ШаблонУведомленияОбИспользованииПЭП_%1", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Попытка
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("Приказ");
		ЗаполнитьЗначенияСвойств(Область.Параметры, ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(Область);	
		ПечатныеФормы.Вставить("Приказ", ТабличныйДокумент);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("ПриложениеКПриказу");
		ЗаполнитьЗначенияСвойств(Область.Параметры, ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(Область);	
		ПечатныеФормы.Вставить("ПриложениеКПриказу", ТабличныйДокумент);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("Приложение1");
		ЗаполнитьЗначенияСвойств(Область.Параметры, ПараметрыЗаполнения);
		ТабличныйДокумент.Вывести(Область);
		ПечатныеФормы.Вставить("Приложение1", ТабличныйДокумент);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		Область = МакетУведомления.ПолучитьОбласть("Уведомление");
		
		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("ФИОСотрудника", НСтр("ru = 'Ф.И.О. сотрудника'"));
		ЗначенияПараметров.Вставить("НаименованиеОрганизации", ПараметрыЗаполнения.НаименованиеОрганизации);
		ЗначенияПараметров.Вставить("ДатаВступленияВСилу", ПараметрыЗаполнения.ДатаВступленияВСилу);
		
		ЗаполнитьЗначенияСвойств(Область.Параметры, ЗначенияПараметров); 
		ТабличныйДокумент.Вывести(Область);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ПечатныеФормы.Вставить("Приложение2", ТабличныйДокумент);
		
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось заполнить значения параметров шаблона положения об использовании простой ЭП причине:'")
			+ Символы.ПС
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ПечатныеФормы;
	
КонецФункции

#КонецОбласти
