#Область ПрограммныйИнтерфейс

// Регистрирует тарифицируемые услуги конфигурации из Структуры.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПоставщикиУслуг - Массив из Структура - описывает поставщика услуги:
// 	 * Идентификатор - Строка - идентификатор поставщика услуги (тип Строка - Строка(50)),
// 	 * Наименование - Строка - наименование поставщика услуги (тип Строка - Строка(150)),
// 	 * Услуги - Массив из Структура - услуги поставщика с обязательными ключами:
// 	   ** Идентификатор - Строка - идентификатор услуги  (тип Строка - Строка(50))
// 	   ** Наименование - Строка - наименование услуги  (тип Строка - Строка(150))
// 	   ** ТипУслуги - ПеречислениеСсылка.ТипыУслуг - тип услуги.
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	// Конец ЭлектронноеВзаимодействие
	
КонецПроцедуры

// Событие, которое вызывается при изменении активации лицензии.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ДанныеОЛицензии - Структура - данные о лицензии:
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ИмяЛицензии - Строка - имя лицензии.
//   * КонтекстЛицензии - Строка - контекст лицензии.
//  ЛицензияАктивирована - Булево - активирована лицензия или деактивирована.
//
Процедура ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована) Экспорт
КонецПроцедуры

// Событие, которое вызывается при обновлении доступных лицензий.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПараметрыЛицензии - Структура:
//   * ИдентификаторПодписки - УникальныйИдентификатор - внутренний идентификатор подписки.
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ДатаНачалаДействия - Дата - дата начала действия подписки.
//   * ДатаОкончанияДействия - Дата - дата окончания действия подписки.
//   * КоличествоЛицензий - Число - количество лицензий.
//   * НомерПодписки - Строка - номер подписки.
//   * ДатаИзменения - Дата - дата изменения.
//
Процедура ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
КонецПроцедуры

// Событие, которое вызывается при удалении доступных лицензий.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ПараметрыЛицензии - Структура:
//   * ИдентификаторПодписки - УникальныйИдентификатор - внутренний идентификатор подписки.
//   * ИдентификаторУслуги - Строка - идентификатор услуги.
//   * ИдентификаторПоставщика - Строка - идентификатор поставщика.
//   * ДатаНачалаДействия - Дата - дата начала действия подписки.
//   * ДатаОкончанияДействия - Дата - дата окончания действия подписки.
//   * КоличествоЛицензий - Число - количество лицензий.
//   * НомерПодписки - Строка - номер подписки.
//   * ДатаИзменения - Дата - дата изменения.
//   * ДоступнаПослеУдаления - Булево - Истина, если лицензия доступна в рамках другой подписки
//
Процедура ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
КонецПроцедуры

#КонецОбласти
