
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СообщенияДля1САрхива.ТелоСообщения КАК ТелоСообщения
		|ИЗ
		|	РегистрСведений.СообщенияДля1САрхива КАК СообщенияДля1САрхива
		|ГДЕ
		|	СообщенияДля1САрхива.ИдентификаторСообщения = &ИдентификаторСообщения");
	Запрос.УстановитьПараметр("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТелоСтрокой = Выборка.ТелоСообщения.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
