#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоГруппа ИЛИ
	|	ЗначениеРазрешено(Ссылка)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ЭлементКоличествоСтавок = НайтиПоРеквизиту("Категория", Перечисления.КатегорииРасходовНаПерсонал.КоличествоСтавок);
	Если ЗначениеЗаполнено(ЭлементКоличествоСтавок) Тогда
		Если ЭлементКоличествоСтавок.ПометкаУдаления Тогда
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, "Справочник.ПоказателиКадровогоПланирования", "Ссылка", ЭлементКоличествоСтавок) Тогда
				Возврат;
			КонецЕсли;
			КоличествоСтавокОбъект = ЭлементКоличествоСтавок.ПолучитьОбъект();
			КоличествоСтавокОбъект.УстановитьПометкуУдаления(Ложь);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(КоличествоСтавокОбъект);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ЭлементБезКатегории = НайтиПоРеквизиту("Категория", Перечисления.КатегорииРасходовНаПерсонал.ПустаяСсылка());
	Если ЗначениеЗаполнено(ЭлементБезКатегории) Тогда
		ЭлементОбъект = ЭлементБезКатегории.ПолучитьОбъект();
	Иначе
		ЭлементОбъект = Справочники.ПоказателиКадровогоПланирования.СоздатьЭлемент();
	КонецЕсли;
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
		ПараметрыОбновления, "Справочник.ПоказателиКадровогоПланирования", "Ссылка", ЭлементОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОбъект.Наименование = НСтр("ru = 'Количество ставок'");
	ЭлементОбъект.Категория = Перечисления.КатегорииРасходовНаПерсонал.КоличествоСтавок;
	ЭлементОбъект.КраткоеНаименование = НСтр("ru = 'Ставки'");
	
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЭлементОбъект);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
