#Область СлужебныйПрограммныйИнтерфейс

// Определяет менеджеры логических хранилищ.
//
// Параметры:
//   ВсеМенеджерыЛогическихХранилищ - Соответствие из Строка - менеджеры логических хранилищ:
//    * Ключ - Строка - идентификатор логического хранилища;
//    * Значение - ОбщийМодуль - менеджер логического хранилища.
//
//@skip-check module-empty-method
Процедура МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ) Экспорт
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		ВсеМенеджерыЛогическихХранилищ.Вставить("migration", МодульМиграцияПриложений);
	КонецЕсли;
	
КонецПроцедуры

// Определяет менеджеры физических хранилищ.
//
// Параметры:
//   ВсеМенеджерыФизическихХранилищ - Соответствие из Строка - менеджеры физических хранилищ:
//    * Ключ - Строка - идентификатор физического хранилища;
//    * Значение - ОбщийМодуль - менеджер физического хранилища.
//
//@skip-check module-empty-method
Процедура МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ) Экспорт
	
КонецПроцедуры

// Определяет период действия временного идентификатора.
//
// Параметры:
//   ПериодДействияВременногоИдентификатора - Число - период действия временного идентификатора.
//
//@skip-check module-empty-method
Процедура ПериодДействияВременногоИдентификатора(ПериодДействияВременногоИдентификатора) Экспорт
	
КонецПроцедуры

// Определяет размер блока получения данных.
//
// Параметры:
//   РазмерБлокаПолученияДанных - Число - размер блока получения данных в байтах.
//
//@skip-check module-empty-method
Процедура РазмерБлокаПолученияДанных(РазмерБлокаПолученияДанных) Экспорт
	
КонецПроцедуры

// Определяет размер блока отправки данных.
//
// Параметры:
//   РазмерБлокаОтправкиДанных - Число - размер блока отправки данных в байтах.
//
//@skip-check module-empty-method
Процедура РазмерБлокаОтправкиДанных(РазмерБлокаОтправкиДанных) Экспорт
	
КонецПроцедуры

// Вызывается при ошибке получения данных.
//
// Параметры:
//  ДанныеОшибки - Структура - данные по ошибке:
//   * Соединение - HTTPСоединение - соединение с сервисом при получении данных.
//   * Метод - Строка - выполняемый метод.
//   * Запрос - HTTPСервисЗапрос - запрос к сервису при получении данных.
//   * Ответ - HTTPСервисОтвет - ответ сервиса при получении данных.
//   * ИнформацияОбОшибке - Строка - описание ошибки.
//   * ОтправленыДвоичныеДанные - Булево - Истина, если в запросе отправлены двоичные данные.
//
//@skip-check module-empty-method
Процедура ОшибкаПриПолученииДанных(ДанныеОшибки) Экспорт
	
	ПередачаДанныхБТССлужебный.ОшибкаПриПолученииДанных(ДанныеОшибки);
	
КонецПроцедуры

// Вызывается при ошибке отправки данных.
//
// Параметры:
//  ДанныеОшибки - Структура - данные по ошибке:
//   * Соединение - HTTPСоединение - соединение с сервисом при отправке данных.
//   * Метод - Строка - выполняемый метод.
//   * Запрос - HTTPСервисЗапрос - запрос к сервису при отправке данных.
//   * Ответ - HTTPСервисОтвет - ответ сервиса при отправке данных.
//   * ИнформацияОбОшибке - Строка - описание ошибки.
//   * ОтправленыДвоичныеДанные - Булево - Истина, если в запросе отправлены двоичные данные.
//
//@skip-check module-empty-method
Процедура ОшибкаПриОтправкеДанных(ДанныеОшибки) Экспорт
	
	ПередачаДанныхБТССлужебный.ОшибкаПриОтправкеДанных(ДанныеОшибки);
	
КонецПроцедуры

// Вызывается при ошибке выполнения запроса данных.
//
// Параметры:
//  ДанныеОшибки - Структура - данные по ошибке:
//   * Соединение - HTTPСоединение - соединение с сервисом при получении данных.
//   * Метод - Строка - выполняемый метод.
//   * Запрос - HTTPСервисЗапрос - запрос к сервису при получении данных.
//   * Ответ - Неопределено, HTTPСервисОтвет - ответ сервиса при получении данных (не обязательно).
//   * ИнформацияОбОшибке - Строка - описание ошибки.
//   * ОтправленыДвоичныеДанные - Булево - Истина, если в запросе отправлены двоичные данные.
//
//@skip-check module-empty-method
Процедура ОшибкаПриВыполненииЗапросаДанных(ДанныеОшибки) Экспорт
	
	ПередачаДанныхБТССлужебный.ОшибкаПриВыполненииЗапросаДанных(ДанныеОшибки);
	
КонецПроцедуры

// Вызывается при получении имени временного файла.
//
// Параметры:
//   ИмяВременногоФайла - Строка - имя временного файла.
//   Расширение - Строка - желаемое расширение имени временного файла.
//   ДополнительныеПараметры - Структура - дополнительные параметры временного файла.
//
//@skip-check module-empty-method
Процедура ПриПолученииИмениВременногоФайла(ИмяВременногоФайла, Расширение) Экспорт
	
КонецПроцедуры

// Вызывается при продлении действия временного идентификатора.
//
// Параметры:
//   Идентификатор - Строка - идентификатор запроса.
//   Дата - Дата - дата регистрации запроса.
//   Запрос - Структура - исходный HTTP-запрос:
//    * HTTPМетод - Строка - HTTP-метод;
//    * БазовыйURL - Строка - базовая часть URL-запроса, включающая имя сервиса;
//    * Заголовки - ФиксированноеСоответствие из Строка - заголовки HTTP-запроса;
//    * ОтносительныйURL - Строка - относительную часть URL-адреса (относительно сервиса);
//    * ПараметрыURL - ФиксированноеСоответствие из Строка - части URL-адреса, которые были параметризованы в шаблоне;
//    * ПараметрыЗапроса - ФиксированноеСоответствие из Строка - параметры запроса (в строке URL-адреса параметры следуют после знака запроса);
//    * ИдентификаторЗапроса - Строка - уникальный идентификатор запроса;
//    * ТипЗапроса - Строка - тип запроса;
//    * ИмяВременногоФайла - Строка - имя используемого временного файла.
//
//@skip-check module-empty-method
Процедура ПриПродленииДействияВременногоИдентификатора(Идентификатор, Дата, Запрос) Экспорт

КонецПроцедуры

// Вызывается при получении Прокси, используемого для соединения с сервером.
// 
// Параметры:
//  Прокси - Неопределено, ИнтернетПрокси - Прокси, используемый для соединения с сервером.
//  СтруктураURI - Структура - поля:
//    * Схема - Строка - схема из URI
//    * Логин - Строка - логин из URI
//    * Пароль - Строка - пароль из URI
//    * Хост - Строка - хост из URI
//    * Порт - Число - порт из URI
//    * ПутьНаСервере - Строка - часть <путь>?<параметры>#<якорь> из URI
//
//@skip-check module-empty-method
Процедура ПриПолученииПрокси(Прокси, СтруктураURI) Экспорт

	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);

КонецПроцедуры

#КонецОбласти