
#Область ПрограммныйИнтерфейс

#Область РаботаСФормами

// Вызывается при создании формы интегрируемого объекта, после ОбменСАрхивом.ПриСозданииНаСервере.
// Позволяет переопределить поведение процедуры.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма объекта или списка.
//   ПараметрыРазмещения - Структура, Неопределено - см. ОбменСАрхивом.ПараметрыРазмещенияЭлементов.
//   ЭтоФормаОбъекта - Булево - Истина для формы объекта, Ложь для формы списка.
//
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта) Экспорт

	ЗарплатаКадры.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта);
	
КонецПроцедуры

// Определяет, является ли переданная форма формой объекта (а не списка).
// Предназначена для случаев, когда стандартный алгоритм из ОбменСАрхивом.ЭтоФормаОбъекта не подходит.
//  Например, если форма не содержит параметра "Ключ", но является формой объекта.
//  Если процедура меняет параметр ЭтоФормаОбъекта на значение типа Булево, стандартный способ вычисления не выполняется.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта или списка.
//  ЭтоФормаОбъекта - Неопределено, Булево - параметр, в который следует поместить результат вычисления.
//
Процедура ПриОпределенииТипаФормы(Форма, ЭтоФормаОбъекта) Экспорт
	
	ЗарплатаКадры.ЭтоФормаОбъекта(Форма, ЭтоФормаОбъекта);
	
КонецПроцедуры

// Определяет имя реквизита формы, который содержит интегрируемый объект.
// 	Вызывается только для формы объекта (не списка).
//  Необходимо прописать здесь имена, которые отличаются от стандартного "Объект".
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта.
//  ИмяРеквизита - Неопределено, Строка - параметр, в который следует поместить результат вычисления. 
//   Если не заполнено, будет использоваться имя "Объект".
//
Процедура ПриОпределенииИмениРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма, ИмяРеквизита) Экспорт
	
	ЗарплатаКадры.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма, ИмяРеквизита);
	
КонецПроцедуры

// Определяет имена команд, которые не следует добавлять на форму
//  в стандартном обработчике ПриСозданииНаСервере ни при каких условиях.
//  Например, если команда добавляется другим, нестандартным способом.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного объекта или списка.
//  ИменаИсключаемыхКоманд - Массив из Строка - массив имен команд.
//
Процедура ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд) Экспорт
	
	ЗарплатаКадры.ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд);
	
КонецПроцедуры

// Вызывается перед выполнением стандартной процедуры ОбменСАрхивом.УстановитьВидимостьИДоступностьКоманд.
//  Предназначена для случаев, когда нужно дополнить стандартный алгоритм, либо заменить его на свой.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма прикладного элемента.
//  СтандартнаяОбработка - Булево - если установить Ложь, стандартный обработчик выполняться не будет.
//
Процедура УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадры.УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

// Вызывается перед выполнением команды "Отправить в 1С:Архив".
// Здесь можно разместить прикладные проверки и отказаться от отправки.	
//  Например, если по документу есть задолженность.
//
// Параметры:
//  Ссылка - ДокументСсылка, СправочникСсылка - объект, отправляемый в 1С:Архив.
//  Отказ - Булево - если установить Истина, отправка в 1С:Архив будет прервана.
//
Процедура ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ) Экспорт

	ЗарплатаКадры.ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ);
	
КонецПроцедуры

// Вызывается при проверке заполнения документа БИА.
// Здесь можно добавить прикладные проверки и отказаться от записи.
//  Например, если в коллекции ПрочиеСвойства нет свойства, обязательного для данного вида документов.
//
// Параметры:
//  ДокументБИА - СправочникОбъект.ДокументыБИА - документ БИА.
//  Отказ - Булево.
//  ПроверяемыеРеквизиты - Массив из Строка - массив путей к реквизитам.
//
Процедура ОбработкаПроверкиЗаполненияДокументаБИА(ДокументБИА, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

// Ищет документы, отмеченные к отправке в 1С:Архив и формирует их в пакеты для отправки.
//
// Параметры:
//  СтандартнаяОбработка - Булево - если установить Ложь,
//   стандартный алгоритм формирования пакетов выполняться не будет.
//
Процедура СформироватьПакетыДокументов(СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается после того как из 1С:Архива получена информация о том,
//  что все документы, созданные на основании указанных объектов, приняты.
//
// Параметры:
//  Документы - Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА -
//   ссылки на интегрируемые объекты, переданные в 1С:Архив.
//  СтандартнаяОбработка - Булево - если установить Ложь, стандартный алгоритм удаления выполняться не будет.
//
Процедура УдалитьДанныеДокументовПринятыхВАрхив(Документы, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается после того как из 1С:Архива получена информация о том,
//  что все документы, созданные на основании указанных объектов, уничтожены.
//
// Параметры:
//  Документы - Массив из ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА -
//   ссылки на интегрируемые объекты, переданные в 1С:Архив и уничтоженные там после окончания срока хранения.
//
Процедура УдалитьДанныеДокументовУничтоженныхВАрхиве(Документы) Экспорт
	
	
	
КонецПроцедуры

// Предназначена для заполнения данных по объектам НСИ для отправки в Архив.
//  Необходимо сформировать таблицу с именами колонок, соответствующими именам реквизитов объекта XDTO.
//
// Параметры:
//  СсылкиНаОбъектыНСИ - Массив из СправочникСсылка - порция измененных элементов НСИ одного типа.
//  СвойстваОбъектаXDTO - КоллекцияСвойствXDTO - коллекция всех свойств объекта XDTO. 
//     В новом формате состав коллекции может содержать новые или измененные свойства, поэтому наличие этих свойств
//     в объекте XDTO нужно проверить при выгрузке.
//  ТаблицаНСИ - Неопределено, ТаблицаЗначений - таблица, в которую нужно поместить результат вычисления,
//       либо Неопределено, если для указанного типа не предусмотрен алгоритм формирования данных. 
//       Во втором случае при обмене будет зафиксирована ошибка в журнале регистрации. Колонки таблицы:
//   * Ссылка - СправочникСсылка - ссылка на объект НСИ.
//   * <ИмяРеквизитаXDTO> - Произвольный - значение, соответствующее реквизиту объекта XDTO.
//   * ...
//
//  Пример использования параметра СвойстваОбъектаXDTO:
//  в старом формате объект XDTO "Individual" не содержал свойство "AccessGroupID",
//  а в новом формате оно есть. Поэтому при выгрузке объекта XDTO нужно проверить наличие свойства "AccessGroupID".
//  Если свойство найдено в коллекции свойств XDTO, то его значение нужно выгрузить в объект XDTO. 
//  В противном случае, свойство нужно пропустить.
//  Код:
//     Если СвойстваОбъектаXDTO.Получить("AccessGroupID") <> Неопределено Тогда
//         Если ЗначениеЗаполнено(СтрНСИ.ГруппаДоступа) Тогда
//             СтрНСИ.AccessGroupID = ОбменСАрхивом.ИдентификаторСсылки(СтрНСИ.ГруппаДоступа);
//         КонецЕсли;
//     КонецЕсли;
//	
Процедура ПриЗаполненииТаблицыДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, СвойстваОбъектаXDTO, ТаблицаНСИ) Экспорт
	
	ЗарплатаКадры.ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, СвойстваОбъектаXDTO, ТаблицаНСИ);
	
КонецПроцедуры

// Возвращает данные указанной МЧД, необходимые для выгрузки в 1С:Архив.
//
// Параметры:
//  МЧДСсылка - СправочникСсылка - ссылка на МЧД.
//  ОписаниеМЧД - Структура, Неопределено - параметр, в который необходимо поместить
//    результат вычисления - свойства доверенности, см. ОбменСАрхивом.НовоеОписаниеМЧД.
//    Неопределено, если выгрузка этого элемента не требуется.
// 
Процедура ПриЗаполненииДанныхМЧДДляВыгрузки(МЧДСсылка, ОписаниеМЧД) Экспорт
	
	
	
КонецПроцедуры

// Выполняет обновление элементов справочника ВидыДокументовБИА,
//   обусловленное изменением конфигурации.
// 
// Параметры:
//  ПараметрОбработчика - Структура - параметры обязательного обработчика обновления.
//    Если в ходе выполнения обработчика возникает необходимость внесения изменений в ИБ,
//    обработчик должен установить значение свойства ПараметрОбработчика.МонопольныйРежим в Истина
//    и прекратить свое выполнение. После этого обработчик будет вызван повторно
//    после установки монопольного режима, значение ПараметрОбработчика.МонопольныйРежим будет равно Истина.
//    В этом втором вызове следует выполнять необходимые изменения данных. 
//
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ЗарплатаКадры.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);

КонецПроцедуры

// Обработчик подписки ОбновлениеВидовДокументовБИАПередЗаписью.
//  Совместно с ОбновлениеВидовДокументовБИАПриЗаписи предназначен
//   для создания видов документов БИА при записи прикладных объектов, включенных в подписку.
//
// Параметры:
//  Источник - СправочникОбъект - источник подписки ОбновлениеВидовДокументовБИАПередЗаписью
//  Отказ - Булево - отказ
// 
Процедура ОбновлениеВидовДокументовБИАПередЗаписью(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Обработчик подписки ОбновлениеВидовДокументовБИАПриЗаписи.
//  Предназначен для создания видов документов БИА при записи прикладных объектов, включенных в подписку.
//  Например, можно при записи элемента справочника "Виды договоров" создавать соответствующий ему вид документа БИА.
//
// Параметры:
//  Источник - СправочникОбъект - источник подписки ОбновлениеВидовДокументовБИАПриЗаписи
//  Отказ - Булево - отказ
// 
Процедура ОбновлениеВидовДокументовБИАПриЗаписи(Источник, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// Предназначена для случаев, когда процедура создания документов БИА
//  расположена нестандартно (т.е. не в модуле менеджера прикладного объекта).
//  Если функция возвращает значение, отличное от Неопределено,
//  стандартный вызов в модуль менеджера не выполняется.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//  ДокументыБИА - Массив из СправочникОбъект.ДокументыБИА, Неопределено - созданные документы БИА.
//   Если Неопределено, то выполняется стандартное обращение к модулю менеджера объекта.
//
Процедура ПриСозданииДокументовБИА(СсылкаНаОбъектИсточник, ДокументыБИА) Экспорт
	
	ЗарплатаКадры.СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА);
	
КонецПроцедуры

// Формирует строку, которая будет передана в 1С:Архив в качестве идентификатора ссылки.
//  Предназначена для случаев, когда нужно в качестве идентификатора передать не УникальныйИдентификатор ссылки,
//  а что-то другое. Например, ИНН/КПП для справочника Организаций.
//
// Параметры:
//  Ссылка - СправочникСсылка - ссылка на элемент (НСИ, ДокументБИА).
//  Идентификатор - Строка, Неопределено - параметр, в который следует поместить значение идентификатора.
//    Если не заполнен, значение будет вычислено по стандартному алгоритму.
//
Процедура ПриОпределенииИдентификатораСсылки(Ссылка, Идентификатор) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при записи константы ИнтеграцияС1САрхивом.
// Здесь можно разместить код по изменению связанных с интеграцией настроек и служебных данных.
//
// Параметры:
//  Объект - КонстантаМенеджерЗначения.ИнтеграцияС1САрхивом - менеджер значения константы.
//  Отказ - Булево - если установить Истина, запись константы будет отменена. 
// 
Процедура ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ) Экспорт
	
	ЗарплатаКадры.ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ);
	
КонецПроцедуры

// Регистрирует к обмену группы доступна физических лиц, возможность обмена которыми была добавлена
// в версии формата 1.0.12.
// 
Процедура ЗарегистрироватьГруппыДоступаФизическихЛицВОбмене() Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти
