////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт

	Параметры.Вставить(
		"ВыгрузкаЗагрузкаДанныхЗагрузкаПрервана",
		ВыгрузкаЗагрузкаДанныхВызовСервера.ЗагрузкаПрервана());
	
КонецПроцедуры

Функция НачатьЗагрузкуДанныхТекущейОбластиИзАрхива(
	Знач ДанныеФайла,
	Знач ПараметрыЗагрузки,
	Знач АдресРезультата = Неопределено) Экспорт 
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыЗагрузки.Вставить(
		"ЗагружаемыеТипы",
		ЗагружаемыеТипы(ТипРезервнойКопии(ПараметрыЗагрузки)));
		
	Обработчики = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковЗагрузкиДанных.Создать();
	Обработчики.Инициализировать();
	
	Контейнер = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.Создать();
	Контейнер.ИнициализироватьЗагрузку(ДанныеФайла, ПараметрыЗагрузки);	
	
	Если ПараметрыЗагрузки.ВозможноПродолжениеПроцедурыЗагрузки Тогда
		СоответствиеСсылок = ПродолжитьПроцедуруЗагрузки(ПараметрыЗагрузки, Контейнер, Обработчики);
	Иначе
		СоответствиеСсылок = НачатьПроцедуруЗагрузки(ПараметрыЗагрузки, Контейнер, Обработчики);
	КонецЕсли;
	
	РезультатЗагрузки = Новый Структура(
		"Предупреждения, СоответствиеСсылок",
		Контейнер.Предупреждения(),
		СоответствиеСсылок);
	
	Если АдресРезультата <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресРезультата);
	КонецЕсли;
	
	Возврат РезультатЗагрузки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Выгрузка/загрузка данных

// Выгружает данные приложения в zip-архив, из которого они в дальнейшем могут быть загружены
//  в другую информационную базу или область данных с помощью функции
//  ВыгрузкаЗагрузкаОбластейДанных.ЗагрузитьОбластьИзАрхива().
//
// Параметры:
//	АдресДанных - Строка - адрес во временном хранилище, в который нужно поместить результат если данный параметр заполнен
//	РежимВыгрузкиДляТехническойПоддержки - Булево - признак выгрузки в режиме для технической поддержки
//	ДанныеСхемыКонфигурации - ДвоичныеДанные, Неопределено - двоичные данные схемы конфигурации сформированные методом
//	   СхемаКонфигурации.ДвоичныеДанныеСхемы(Истина, Ложь)
//	ИмяФайлаВыгрузки - Строка, Неопределено - требуемое имя файла выгрузки (zip). Если не указано, для выгрузки будет
//	  использовано имя нового временного файла
//	ВыгружатьДанныеРасширений - Булево - признак выгрузки исходных данных пользовательских расширений 
//  ПараметрыВыгрузки - Структура, Неопределено - параметры, используемые при выгрузке:
//    * ВыгружатьЗарегистрированныеИзмененияДляУзловПланаОбмена - Булево - включение в выгрузку зарегистрированных изменений для узлов плана обмена (по умолчанию: Ложь). 
//    * ИдентификаторСостояния - УникальныйИдентификатор, Неопределено - если передан, в процессе выполнения будет фиксироваться состояние выполнения и рассчитываться прогресс. Идентификатор будет использоваться как ключ записи в регистре СостоянияВыгрузкиЗагрузкиОбластейДанных.    
// 
// Возвращаемое значение:		
//  Структура - с полями:
//  * ИмяФайла - Строка - имя файла архива
//  * Предупреждения - Массив Из Строка - предупреждения пользователю по результатам выгрузки.
Функция ВыгрузитьТекущуюОбластьВАрхив(
	АдресДанных,
	РежимВыгрузкиДляТехническойПоддержки,
	ДанныеСхемыКонфигурации,
	ИмяФайлаВыгрузки,
	ВыгружатьДанныеРасширений,
	ПараметрыВыгрузки) Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);

	ТипыМоделиДанных = ПолучитьТипыМоделиДанныхОбласти();
	ТипыОбщихДанных
		= ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке();
	 
	Если Не ЗначениеЗаполнено(ПараметрыВыгрузки) Тогда
		ПараметрыВыгрузки = Новый Структура();
	КонецЕсли;
	
	ПараметрыВыгрузки.Вставить("ВыгружаемыеТипы", ТипыМоделиДанных);
	ПараметрыВыгрузки.Вставить("ВыгружаемыеТипыОбщихДанных", ТипыОбщихДанных);
	ПараметрыВыгрузки.Вставить("ВыгружатьПользователей", Истина);
	ПараметрыВыгрузки.Вставить("ВыгружатьНастройкиПользователей", Истина);
	ПараметрыВыгрузки.Вставить("РежимВыгрузкиДляТехническойПоддержки", РежимВыгрузкиДляТехническойПоддержки);
	
	Если ЗначениеЗаполнено(ДанныеСхемыКонфигурации) Тогда
		ПараметрыВыгрузки.Вставить("ДанныеСхемыКонфигурации", ДанныеСхемыКонфигурации);
	КонецЕсли;

	Если ЗначениеЗаполнено(ИмяФайлаВыгрузки) Тогда
		ПараметрыВыгрузки.Вставить("ИмяФайлаВыгрузки", ИмяФайлаВыгрузки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВыгружатьДанныеРасширений) Тогда
		ПараметрыВыгрузки.Вставить("ВыгружатьДанныеРасширений", ВыгружатьДанныеРасширений);
	КонецЕсли;

	Результат = ВыгрузитьДанныеТекущейОбластиВАрхив(ПараметрыВыгрузки);

	Если АдресДанных <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресДанных);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

// Выгружает данные в каталог.
//
// Параметры:
//	ПараметрыВыгрузки - Структура - содержащая параметры выгрузки данных.
//		Ключи:
//			ВыгружаемыеТипы - Массив Из ОбъектМетаданных - массив объектов метаданных, данные
//				которых требуется выгрузить в архив,
//			ВыгружатьПользователей - Булево - выгружать информацию о пользователях информационной базы,
//			ВыгружатьНастройкиПользователей - Булево - игнорируется если ВыгружатьПользователей = Ложь.
//			Также структура может содержать дополнительные ключи, которые могут быть обработаны внутри
//				произвольных обработчиков выгрузки данных.
//
// Возвращаемое значение:		
//  Структура - с полями:
//  * ИмяФайла - Строка - имя файла архива
//  * Предупреждения - Массив Из Строка - предупреждения пользователю по результатам выгрузки.
//
Функция ВыгрузитьДанныеТекущейОбластиВАрхив(Знач ПараметрыВыгрузки) Экспорт
	
	ПроверитьПараметрыВыгрузкиДанных(ПараметрыВыгрузки);
	
	Контейнер = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.Создать();
	Контейнер.ИнициализироватьВыгрузку(ПараметрыВыгрузки);
	
	Сериализатор = СериализаторXDTOСАннотациейТипов();
	
	Обработчики = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных.Создать();
	Обработчики.Инициализировать(Контейнер);
	
	Обработчики.ПередВыгрузкойДанных(Контейнер);
	
	СохранитьОписаниеВыгрузки(Контейнер);
	
	Обработки.ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы.ВыгрузитьДанныеИнформационнойБазы(
		Контейнер, Обработчики, Сериализатор);
	
	Если ПараметрыВыгрузки.ВыгружатьПользователей Тогда
		
		ВыгрузкаЗагрузкаПользователейИнформационнойБазыСлужебный.ВыгрузитьПользователейИнформационнойБазы(Контейнер);
		
		Если ПараметрыВыгрузки.ВыгружатьНастройкиПользователей Тогда
			
			Обработки.ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиНастроекПользователей.ВыгрузитьНастройкиПользователейИнформационнойБазы(
				Контейнер, Обработчики, Сериализатор);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ВыгрузитьСхемуКонфигурации(Контейнер, ПараметрыВыгрузки);
	
	Обработчики.ПослеВыгрузкиДанных(Контейнер);
	
	Возврат Новый Структура("ИмяФайла, Предупреждения",
		Контейнер.ФинализироватьВыгрузку(),
		Контейнер.Предупреждения());
	
КонецФункции

// Загружает данные приложения из zip архива с XML файлами.
//
// Параметры:
//  Архив - Строка, УникальныйИдентификатор - полное имя файла архива с данными или идентификатор файла в МС.
//  ПараметрыЗагрузки - Структура, Неопределено - см. ВыгрузкаЗагрузкаОбластейДанных.ПараметрыЗагрузки
//
// Возвращаемое значение:
//  Структура - с полями:
//  * Предупреждения - Массив Из Строка - предупреждения пользователю по результатам загрузки.
Функция ЗагрузитьОбластьИзАрхива(Архив, ПараметрыЗагрузки) Экспорт
	
	Если ПараметрыЗагрузки = Неопределено Тогда
		ПараметрыЗагрузки = ВыгрузкаЗагрузкаОбластейДанных.ПараметрыЗагрузки();
	КонецЕсли;
	
	ИмяПолногоАрхива = ИмяФайлаПолногоАрхива();
	ПолныйАрхив = Неопределено;
	
	Если ТипЗнч(Архив) = Тип("Строка") Тогда
		
		ЧтениеАрхива = Новый ЧтениеФайлаАрхива(Архив);
		ЭлементПолныйАрхив = ЧтениеАрхива.Элементы.Найти(ИмяПолногоАрхива);
		
		Если ЭлементПолныйАрхив <> Неопределено Тогда
			
			ВремКаталог = ПолучитьИмяВременногоФайла("zip") + ПолучитьРазделительПути();
			СоздатьКаталог(ВремКаталог);
			
			ЧтениеАрхива.Извлечь(ЭлементПолныйАрхив, ВремКаталог);
			
			ПолныйАрхив = ВремКаталог + ИмяПолногоАрхива;
			
		КонецЕсли;
		
	Иначе
		
		АрхивКопии = ZipАрхивыСлужебный.ПрочитатьАрхив(Архив);
		ЗаписьПолногоАрхива = ZipАрхивыСлужебный.НайтиЗапись(АрхивКопии, ИмяПолногоАрхива);
		
		Если ЗаписьПолногоАрхива <> Неопределено Тогда
			
			ВремКаталог = ПолучитьИмяВременногоФайла("zip") + ПолучитьРазделительПути();
			СоздатьКаталог(ВремКаталог);
			
			Если ЗаписьПолногоАрхива.МетодСжатия = 0 
				И ЗаписьПолногоАрхива.НесжатыйРазмер > 1024 * 1024 * 1024 Тогда
				
				// Большой файл, нужно читать из МС, чтение происходит в процессе загрузки данных
				ПолныйАрхив = Новый Структура();
				ПолныйАрхив.Вставить("ИдентификаторФайлаИсточника", Архив);
				
			Иначе
				
				// Файл небольшой, лучше скачать полностью
				ZipАрхивыСлужебный.ИзвлечьФайл(АрхивКопии, ИмяПолногоАрхива, ВремКаталог);
				
				ПолныйАрхив = ВремКаталог + ИмяПолногоАрхива;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПолныйАрхив = Неопределено Тогда
		
		РезультатЗагрузки = ЗагрузитьТекущуюОбласть(
			Архив,
			"Обычная",
			Неопределено,
			ПараметрыЗагрузки);
		
		РезультатЗагрузки.Удалить("СоответствиеСсылок");
		
	Иначе
		
		РезультатЗагрузки = ВыгрузкаЗагрузкаОбластейДанных.ЗагрузитьДифференциальнуюКопиюВОбласть(
			ПолныйАрхив, Архив, ПараметрыЗагрузки);
		
		УдалитьФайлы(ВремКаталог);
		
	КонецЕсли;
	
	ПоместитьРезультатЗагрузкиВоВременноеХранилище(ПараметрыЗагрузки, РезультатЗагрузки);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

// Загружает данные приложения из дифференциальной копии.
//
// Параметры:
//  ПолныйАрхив - Строка, УникальныйИдентификатор, Структура - имя файла, идентификатор файла или данные файла полученные с помощью ZipАрхивыСлужебный.ПрочитатьАрхив().
//  ДифференциальныйАрхив - Строка, УникальныйИдентификатор, Структура - имя файла, идентификатор файла или данные файла полученные с помощью ZipАрхивыСлужебный.ПрочитатьАрхив().
//  ПараметрыЗагрузки - см. ПараметрыЗагрузки
//
// Возвращаемое значение:
//  Структура - с полями:
//  * Предупреждения - Массив Из Строка - предупреждения пользователю по результатам загрузки.
Функция ЗагрузитьДифференциальнуюКопиюВОбласть(ПолныйАрхив, ДифференциальныйАрхив, ПараметрыЗагрузки) Экспорт
	
	Если НеобходимоФиксироватьСостояниеВыгрузкиЗагрузкиОбластиДанных(ПараметрыЗагрузки) Тогда
		
		КоличествоЗагружаемыхОбъектовПолнойКопии = КоличествоЗагружаемыхОбъектовРезервнойКопии(
			ПолныйАрхив,
			ТипРезервнойКопииПолная(),
			Ложь);

		КоличествоЗагружаемыхОбъектовДифференциальнойКопии = КоличествоЗагружаемыхОбъектовРезервнойКопии(
			ДифференциальныйАрхив,
			ТипРезервнойКопииДифференциальная(),
			Ложь);
		
		ПараметрыЗагрузки.ВсегоОбъектов = 
			КоличествоЗагружаемыхОбъектовПолнойКопии + КоличествоЗагружаемыхОбъектовДифференциальнойКопии;
			
	КонецЕсли;
	
	РезультатЗагрузкиПолногоАрхива = ЗагрузитьТекущуюОбласть(
		ПолныйАрхив, 
		ТипРезервнойКопииПолная(), 
		Неопределено, 
		ПараметрыЗагрузки);
	
	РезультатЗагрузкиДифференциальногоАрхива = ЗагрузитьТекущуюОбласть(
		ДифференциальныйАрхив, 
		ТипРезервнойКопииДифференциальная(), 
		РезультатЗагрузкиПолногоАрхива.СоответствиеСсылок,
		ПараметрыЗагрузки);
		
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		РезультатЗагрузкиДифференциальногоАрхива.Предупреждения,
		РезультатЗагрузкиПолногоАрхива.Предупреждения);
	
	РезультатЗагрузкиДифференциальногоАрхива.Удалить("СоответствиеСсылок");
	
	ПоместитьРезультатЗагрузкиВоВременноеХранилище(ПараметрыЗагрузки, РезультатЗагрузкиДифференциальногоАрхива);
	
	Возврат РезультатЗагрузкиДифференциальногоАрхива;
	
КонецФункции

// Возвращаемое значение:
//  см. ВыгрузкаЗагрузкаОбластейДанных.ПараметрыЗагрузки
Функция ПараметрыЗагрузки() Экспорт
	
	ВидЗадания = ВидЗаданияВыгрузкиЗагрузкиДанныхПоИмени("ЗагрузкаДанныхВСервис");
	
	ПараметрыЗагрузки = Новый Структура();
	ПараметрыЗагрузки.Вставить("ВидЗадания", ВидЗадания);
	ПараметрыЗагрузки.Вставить("ИдентификаторСостояния", Неопределено);
	ПараметрыЗагрузки.Вставить("ЗагружатьПользователей", Ложь);
	ПараметрыЗагрузки.Вставить("СвернутьЭлементыСправочникаПользователи", Ложь);
	ПараметрыЗагрузки.Вставить("СопоставлениеПользователей", Неопределено);
	ПараметрыЗагрузки.Вставить("ДанныеРасширений", Неопределено);
	ПараметрыЗагрузки.Вставить("ВидПриложения", Неопределено);
	ПараметрыЗагрузки.Вставить("ВсегоОбъектов", 0);
	ПараметрыЗагрузки.Вставить("ПропуститьВосстановлениеРасширений", Неопределено);
	ПараметрыЗагрузки.Вставить("АдресХранилищаРезультата", Неопределено);
	ПараметрыЗагрузки.Вставить("КоличествоПотоков", 0);
	ПараметрыЗагрузки.Вставить("НомерКлиентскогоСеанса", 0);
	
	Возврат ПараметрыЗагрузки;
	
КонецФункции

// Получает модель данных для дальнейшей загрузки/выгрузки данных
//
// Возвращаемое значение: 
//	Массив Из ОбъектМетаданных - типы.
Функция ПолучитьТипыМоделиДанныхОбласти() Экспорт
	
	Результат = Новый Массив();
	МодельДанных = РаботаВМоделиСервиса.ПолучитьМодельДанныхОбласти();

	Для Каждого ЭлементМоделиДанных Из МодельДанных Цикл

		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ЭлементМоделиДанных.Ключ);

		Если Не ОбщегоНазначенияБТС.ЭтоРегламентноеЗадание(ОбъектМетаданных)
				И Не ОбщегоНазначенияБТС.ЭтоЖурналДокументов(ОбъектМетаданных)
				И Не ОбщегоНазначенияБТС.ЭтоВнешнийИсточникДанных(ОбъектМетаданных)
				И Не ОбщегоНазначенияБТС.ЭтоСервисИнтеграции(ОбъектМетаданных) Тогда

			Результат.Добавить(ОбъектМетаданных);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ВосстановитьРасширенияПередЗагрузкойДанных(ДанныеРасширений) Экспорт
			
	РасширенияДляВосстановления = Неопределено;	
	
	Если ДанныеРасширений.Свойство("РасширенияДляВосстановления", РасширенияДляВосстановления) Тогда
		ВосстановитьРасширения(РасширенияДляВосстановления);
	КонецЕсли;
	
	КаркасыРасширенийДляВосстановления = Неопределено;
	
	Если ДанныеРасширений.Свойство("КаркасыРасширенийДляВосстановления", КаркасыРасширенийДляВосстановления)  Тогда
		ВосстановитьКаркасыРасширений(КаркасыРасширенийДляВосстановления);
	КонецЕсли;
		
КонецПроцедуры

// Сравнивает совместима ли выгрузка с текущей конфигурацией.
//
// Параметры:
//	ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
//
// Возвращаемое значение:
//	Булево - Истина, если совпадает.
//
Функция ВыгрузкаДанныхСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке) Экспорт
	
	ИмяКонфигурации = ИнформацияОВыгрузке.Configuration.Name;
	Возврат ВидыПриложенийСервер.СвойстваВидаПриложенияПоИмени(ИмяКонфигурации, Ложь) <> Неопределено;
	
КонецФункции

// Сравнивает совместима ли версия конфигурации с выгруженной.
//
// Параметры:
//	ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
//
// Возвращаемое значение:
//	Булево - Истина, если совпадает.
//
Функция ВыгрузкаДанныхСовместимаСТекущейВерсиейКонфигурации(ИнформацияОВыгрузке) Экспорт
	
	Возврат ИнформацияОВыгрузке.Configuration.Version = Метаданные.Версия;
	
КонецФункции

// Текст ошибки выгрузка не совместима с текущей конфигурацией.
// 
// Параметры:
//  ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
// 
// Возвращаемое значение:
//  Строка - Текст ошибки
Функция ТекстОшибкиВыгрузкаНеСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке) Экспорт
	
	Возврат СтрШаблон(НСтр("ru = 'Невозможно загрузить данные из файла, т.к. файл был выгружен из другой конфигурации (файл выгружен из конфигурации %1 и не может быть загружен в конфигурацию %2).'"),
		ИнформацияОВыгрузке.Configuration.Name,
		Метаданные.Имя);
	
КонецФункции

// Текст ошибки выгрузка не совместима с текущей версией конфигурации.
// 
// Параметры:
//  ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
// 
// Возвращаемое значение:
//  Строка - Текст ошибки
Функция ТекстОшибкиВыгрузкаНеСовместимаСТекущейВерсиейКонфигурации(ИнформацияОВыгрузке) Экспорт
	
	Возврат СтрШаблон(НСтр("ru = 'Невозможно загрузить данные из файла, т.к. файл был выгружен из другой версии конфигурации (файл выгружен из конфигурации версии %1 и не может быть загружен в конфигурацию версии %2).'"),
		ИнформацияОВыгрузке.Configuration.Version,
		Метаданные.Версия);
	
КонецФункции

// Тип данных файла, в котором хранится имя колонки с исходной ссылкой.
//
// Возвращаемое значение:
//	Строка - имя типа.
//
Функция ТипДанныхДляИмениКолонкиТаблицыЗначений() Экспорт
	
	Возврат "1cfresh\ReferenceMapping\ValueTableColumnName";
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Типы файлов и структура каталогов выгрузки/загрузки

// Возвращает наименование типа файла с информацией о выгрузке.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция DumpInfo() Экспорт
	Возврат "DumpInfo";
КонецФункции

// Возвращает наименование типа файла с информацией о составе выгрузке.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция PackageContents() Экспорт
	Возврат "PackageContents";
КонецФункции

// Возвращает наименование типа файла с информацией о сопоставлении ссылок.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция ReferenceMapping() Экспорт
	Возврат "ReferenceMapping";
КонецФункции

// Возвращает наименование типа файла с информацией о пересоздании ссылок.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция ReferenceRebuilding() Экспорт
	Возврат "ReferenceRebuilding";
КонецФункции

// Возвращает наименование типа файла, хранящий сериализованные данные информационной базы.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция InfobaseData() Экспорт
	Возврат "InfobaseData";
КонецФункции

// Возвращает наименование типа файла, хранящий сериализованные изменения данных информационной базы.
// Возвращаемое значение:
//  Строка - наименование типа.
Функция InfobaseDataChanges() Экспорт
	Возврат "InfobaseDataChanges";
КонецФункции

// Возвращает наименование типа файла, хранящий сериализованные данные границ последовательности.
// Возвращаемое значение:
//	Строка - наименование типа.
Функция SequenceBoundary() Экспорт
	Возврат "SequenceBoundary";
КонецФункции

// Возвращает наименование типа файла, хранящий сериализованные данные настроек пользователей.
// Возвращаемое значение:
//	Строка - наименование типа.
Функция UserSettings() Экспорт
	Возврат "UserSettings";
КонецФункции

// Возвращает наименование типа файла, хранящий сериализованные данные пользователей.
// Возвращаемое значение:
//	Строка - наименование типа.
Функция Users() Экспорт
	Возврат "Users";
КонецФункции

// Возвращает наименование типа файла, хранящий произвольные данные.
// Возвращаемое значение:
//	Строка - наименование типа.
Функция CustomData() Экспорт
	Возврат "CustomData";
КонецФункции

// Функция формирует правила структуры каталогов в выгрузке.
//
// Возвращаемое значение:
//	ФиксированнаяСтруктура - структура каталогов:
//	 * DumpInfo - Строка
//	 * Digest - Строка
//	 * Extensions - Строка
//	 * CustomExtensions - Строка
//	 * DumpWarnings - Строка
//	 * PackageContents - Строка
//	 * ReferenceMapping - Строка
//	 * ReferenceRebuilding - Строка
//	 * InfobaseData - Строка
//	 * SequenceBoundary - Строка
//	 * Users - Строка
//	 * UserSettings - Строка
//	 * CustomData - Строка
Функция ПравилаФормированияСтруктурыКаталогов() Экспорт
	
	КорневойКаталог = "";
	КаталогДанных = "Data";
	
	Результат = Новый Структура();
	Результат.Вставить(DumpInfo(), КорневойКаталог);
	Результат.Вставить(Digest(), КорневойКаталог);
	Результат.Вставить(Extensions(), КорневойКаталог);
	Результат.Вставить(CustomExtensions(), КорневойКаталог);
	Результат.Вставить(DumpWarnings(), КорневойКаталог);
	Результат.Вставить(ApplicationTypes(), КорневойКаталог);
	Результат.Вставить(PackageContents(), КорневойКаталог);
	Результат.Вставить(ReferenceMapping(), ReferenceMapping());
	Результат.Вставить(ReferenceRebuilding(), ReferenceRebuilding());
	Результат.Вставить(InfobaseData(), КаталогДанных);
	Результат.Вставить(SequenceBoundary(), КаталогДанных);
	Результат.Вставить(Users(), КорневойКаталог);
	Результат.Вставить(UserSettings(), UserSettings());
	Результат.Вставить(CustomData(), CustomData());
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

// Возвращает типы файлов, которые поддерживают замену ссылок.
//
// Возвращаемое значение:
//	Массив из Строка - массив типов файлов.
//
Функция ТипыФайловПоддерживающиеЗаменуСсылок() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить(InfobaseData());
	Результат.Добавить(SequenceBoundary());
	Результат.Добавить(UserSettings());
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя типа, который будет использован в xml файле для указанного объекта метаданных
// Используется при поиске и замене ссылок при загрузке, при модификации схемы current-config при записи.
// 
// Параметры:
//  Значение - СправочникСсылка, ДокументСсылка, ОбъектМетаданных - объект метаданных или ссылка.
//
// Возвращаемое значение:
//  Строка - Строка вида AccountingRegisterRecordSet.Хозрасчетный, описывающая объект метаданных.
//
Функция XMLТипСсылки(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = Значение;
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		Ссылка = МенеджерОбъекта.ПолучитьСсылку();
	Иначе
		ОбъектМетаданных = Значение.Метаданные();
		Ссылка = Значение;
	КонецЕсли;
	
	Если ОбщегоНазначенияБТС.ЭтоСсылочныеДанные(ОбъектМетаданных) Тогда
		
		Возврат СериализаторXDTO.XMLТипЗнч(Ссылка).ИмяТипа;
		
	Иначе
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при определении XML типа ссылки для объекта %1: объект не является ссылочным'"),
			ОбъектМетаданных.ПолноеИмя());
		
	КонецЕсли;
	
КонецФункции

// Возвращает объект метаданных по типу поля.
//
// Параметры:
//	ТипПоля - Тип - тип поля
//
// Возвращаемое значение:
//	ОбъектМетаданных - объект метаданных.
//
Функция ОбъектМетаданныхПоТипуСсылки(Знач ТипПоля) Экспорт
	
	СсылкиТочекМаршрутаБизнесПроцессов = СсылкиТочекМаршрутаБизнесПроцессов();
	
	БизнесПроцесс = СсылкиТочекМаршрутаБизнесПроцессов.Получить(ТипПоля);
	Если БизнесПроцесс = Неопределено Тогда
		Ссылка = Новый(ТипПоля);
		МетаданныеСсылки = Ссылка.Метаданные();
	Иначе
		МетаданныеСсылки = БизнесПроцесс;
	КонецЕсли;
	
	Возврат МетаданныеСсылки;
	
КонецФункции

// Возвращает полный список констант конфигурации
//
// Возвращаемое значение:
//  Массив из ОбъектМетаданных - объекты метаданных.
//
Функция ВсеКонстанты() Экспорт
	
	МетаданныеОбъектов = Новый Массив;
	ЗаполнитьКоллекцииКонстант(МетаданныеОбъектов);
	Возврат ВсеМетаданныеКоллекций(МетаданныеОбъектов);
	
КонецФункции

// Возвращает полный список ссылочных типов конфигурации
//
// Возвращаемое значение:
//  Массив из ОбъектМетаданных
//
Функция ВсеСсылочныеДанные() Экспорт
	
	МетаданныеОбъектов = Новый Массив;
	ЗаполнитьКоллекцииСсылочныхОбъектов(МетаданныеОбъектов);
	Возврат ВсеМетаданныеКоллекций(МетаданныеОбъектов);
	
КонецФункции

// Возвращает полный список наборов записей конфигурации
//
// Возвращаемое значение:
//  Массив из ОбъектМетаданных
//
Функция ВсеНаборыЗаписей() Экспорт
	
	МетаданныеОбъектов = Новый Массив;
	ЗаполнитьКоллекцииНаборовЗаписей(МетаданныеОбъектов);
	Возврат ВсеМетаданныеКоллекций(МетаданныеОбъектов);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Чтение/запись данных

// Читает ОбъектXDTO из файла.
//
// Параметры:
//	ИмяФайла - Строка - полный путь к файлу.
//	ТипXDTO - ТипОбъектаXDTO - тип объекта XDTO.
//
// Возвращаемое значение:
//	ОбъектXDTO - прочитанный объект.
//
Функция ПрочитатьОбъектXDTOИзФайла(ИмяФайла, ТипXDTO) Экспорт
	
	ПотокЧтения = Новый ЧтениеXML();
	ПотокЧтения.ОткрытьФайл(ИмяФайла);
	ПотокЧтения.ПерейтиКСодержимому();
	
	Если ПотокЧтения.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			Или ПотокЧтения.Имя <> ИмяЭлементаСодержащегоXDTOОбъект() Тогда
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка чтения XML. Неверный формат файла. Ожидается начало элемента %1.'"),
			ИмяЭлементаСодержащегоXDTOОбъект());
		
	КонецЕсли;
	
	Если НЕ ПотокЧтения.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка чтения XML. Обнаружено завершение файла.'");
	КонецЕсли;
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ПотокЧтения, ТипXDTO);
	
	ПотокЧтения.Закрыть();
	
	Возврат ОбъектXDTO;
	
КонецФункции

// Возвращает префиксы для часто используемых пространств имен.
//
// Возвращаемое значение:
//	Соответствие из КлючИЗначение:
//	* Ключ - Строка - пространство имени.
//	* Значение - Строка - префикс.
//
Функция ПрефиксыПространствИмен() Экспорт
	
	Результат = Новый Соответствие();
	
	Результат.Вставить("http://www.w3.org/2001/XMLSchema", "xs");
	Результат.Вставить("http://www.w3.org/2001/XMLSchema-instance", "xsi");
	Результат.Вставить("http://v8.1c.ru/8.1/data/core", "v8");
	Результат.Вставить("http://v8.1c.ru/8.1/data/enterprise", "ns");
	Результат.Вставить("http://v8.1c.ru/8.1/data/enterprise/current-config", "cc");
	Результат.Вставить("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "dmp");
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Параметры:
//	Объект - Произвольный - записываемый объект.
//	ИмяФайла - Строка - путь к файлу.
//	Сериализатор - СериализаторXDTO - сериализатор.
Процедура ЗаписатьОбъектВФайл(Объект, ИмяФайла, Сериализатор) Экспорт
	
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяФайла);
	
	ЗаписатьОбъектВПоток(Объект, ПотокЗаписи, Сериализатор);
	
	ПотокЗаписи.Закрыть();
	
КонецПроцедуры

// Параметры:
//	ИмяФайла - Строка - путь к файлу.
//
// Возвращаемое значение:
//	Произвольный - объект содержащий прочитанные данные
Функция ПрочитатьОбъектИзФайла(ИмяФайла) Экспорт
	
	ПотокЧтения = Новый ЧтениеXML();
	ПотокЧтения.ОткрытьФайл(ИмяФайла);
	ПотокЧтения.ПерейтиКСодержимому();
	
	Объект = ПрочитатьОбъектИзПотока(ПотокЧтения);
	
	ПотокЧтения.Закрыть();
	
	Возврат Объект;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочее

// Возвращает шаблон записи настроек.
// 
// Возвращаемое значение:
// 	Структура:
// * Настройки - ХранилищеЗначения
// * СериализацияЧерезХранилищеЗначения - Булево
// * Представление - Строка
// * Пользователь - Строка
// * КлючОбъекта - Строка
// * КлючНастроек - Строка
Функция НоваяЗаписьНастроек() Экспорт

	ЗаписьНастроек = Новый Структура();
	ЗаписьНастроек.Вставить("КлючНастроек", "");
	ЗаписьНастроек.Вставить("КлючОбъекта", "");
	ЗаписьНастроек.Вставить("Пользователь", "");
	ЗаписьНастроек.Вставить("Представление", "");
	ЗаписьНастроек.Вставить("СериализацияЧерезХранилищеЗначения", Ложь);
	ЗаписьНастроек.Вставить("Настройки", Новый ХранилищеЗначения(Неопределено));

	Возврат ЗаписьНастроек;
	
КонецФункции

// Типы стандартных хранилищ настроек
// 
// Возвращаемое значение: 
//  ФиксированныйМассив из Строка
Функция ТипыСтандартныхХранилищНастроек() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("ХранилищеОбщихНастроек");
	Результат.Добавить("ХранилищеСистемныхНастроек");
	Результат.Добавить("ХранилищеПользовательскихНастроекОтчетов");
	Результат.Добавить("ХранилищеВариантовОтчетов");
	Результат.Добавить("ХранилищеНастроекДанныхФорм");
	Результат.Добавить("ХранилищеПользовательскихНастроекДинамическихСписков");
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

// Загрузка прервана
// 
// Возвращаемое значение:
//  Булево
Функция ЗагрузкаПрервана() Экспорт
	
	Возврат ИнформацияОПроцедуреЗагрузки() <> Неопределено;
	
КонецФункции

Процедура ЗафиксироватьСоответствиеСсылок(СоответствиеСсылок) Экспорт
	ИнформацияОПроцедуреЗагрузки =  ИнформацияОПроцедуреЗагрузки();
	ИнформацияОПроцедуреЗагрузки.СоответствиеСсылок = СоответствиеСсылок; 
	ЗаписатьИнформациюОПроцедуреЗагрузки(ИнформацияОПроцедуреЗагрузки);
КонецПроцедуры

// Параметры:
//	ОбъектыМетаданных - Массив из ОбъектМетаданных
//	
// Возвращаемое значение: 
//	см. ВыгрузкаЗагрузкаДанныхСлужебный.СсылкиНаТипы
//
Функция СсылкиНаОбъектыМетаданных(ОбъектыМетаданных) Экспорт
		
	ВсеСсылочныеДанные = ВсеСсылочныеДанные();
	
	Типы = Новый Массив;
	
	Для Каждого ОбъектМетаданных Из ОбъектыМетаданных Цикл
		Если ВсеСсылочныеДанные.Найти(ОбъектМетаданных) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
			ОбъектМетаданных.ПолноеИмя());
		Тип = ТипЗнч(МенеджерОбъекта.ПустаяСсылка());
		
		Типы.Добавить(Тип);
			
	КонецЦикла;
	
	Возврат СсылкиНаТипы(Типы);
	
КонецФункции

// Параметры:
//	Типы - Массив из Тип
//	
// Возвращаемое значение: 
//	ФиксированноеСоответствие из КлючИЗначение:
//	 * Ключ - Строка - имя объекта метаданных
//	 * Значение - Массив Из Структура см. ВыгрузкаЗагрузкаДанныхСлужебный.СтруктураРеквизитов
//
Функция СсылкиНаТипы(Типы) Экспорт
				
	СписокМетаданных = Новый Соответствие;
	Для Каждого МетаданныеОбъекта Из ВсеКонстанты() Цикл
		ДобавитьКонстантуВСписокМетаданных(МетаданныеОбъекта, СписокМетаданных, Типы);
	КонецЦикла;
	
	Для Каждого МетаданныеОбъекта Из ВсеСсылочныеДанные() Цикл
		ДобавитьСсылочныйТипВСписокМетаданных(МетаданныеОбъекта, СписокМетаданных, Типы);
	КонецЦикла;
	
	Для Каждого МетаданныеОбъекта Из ВсеНаборыЗаписей() Цикл
		ДобавитьРегистрВТаблицуМетаданных(МетаданныеОбъекта, СписокМетаданных, Типы);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СписокМетаданных);
	
КонецФункции

Функция ПрочитатьАрхив(ДанныеАрхива) Экспорт
	
	ТипДанныхАрхива = ТипЗнч(ДанныеАрхива);
	
	Если ТипДанныхАрхива = Тип("Структура") Тогда
		
		Если ДанныеАрхива.Свойство("ИдентификаторФайлаИсточника") Тогда
			ИмяПолногоАрхива = ИмяФайлаПолногоАрхива();
			АрхивКопии = ZipАрхивыСлужебный.ПрочитатьАрхив(ДанныеАрхива.ИдентификаторФайлаИсточника);
			Архив = ZipАрхивыСлужебный.ПрочитатьВложенныйНесжатыйАрхив(АрхивКопии, ИмяПолногоАрхива);
		Иначе
			Архив = ДанныеАрхива;
		КонецЕсли;
		
	ИначеЕсли ТипДанныхАрхива = Тип("УникальныйИдентификатор") Тогда
		Архив = ZipАрхивыСлужебный.ПрочитатьАрхив(ДанныеАрхива);
	Иначе
		Архив = ZipАрхивыСлужебный.ПрочитатьАрхив(ФайловыеПотоки.ОткрытьДляЧтения(ДанныеАрхива));
	КонецЕсли;
	
	Возврат Архив;
	
КонецФункции

Процедура РаспаковатьФайлАрхива(Знач Архив, Знач ЦелевойКаталог, Знач Имя, Знач Путь = "") Экспорт
	
	Если Не ПустаяСтрока(Путь) Тогда
		Путь = Путь + "/";
	КонецЕсли;
	
	ИмяФайлаВАрхиве = ?(ПустаяСтрока(Путь), Имя, Путь + Имя);
		
	Если Не ZipАрхивыСлужебный.ИзвлечьФайл(Архив, ИмяФайлаВАрхиве, ЦелевойКаталог) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Файл %1 не найден'"), ИмяФайлаВАрхиве);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИмяФайла(Знач ВидФайла, Знач Расширение = "xml") Экспорт
	
	Если ВидФайла = DumpInfo() Тогда
		ИмяФайла = DumpInfo();
	ИначеЕсли ВидФайла = Digest() Тогда
		ИмяФайла = Digest();
	ИначеЕсли ВидФайла = Extensions() Тогда
		ИмяФайла = Extensions();	
	ИначеЕсли ВидФайла = CustomExtensions() Тогда
		ИмяФайла = CustomExtensions();
	ИначеЕсли ВидФайла = DumpWarnings() Тогда
		ИмяФайла = DumpWarnings();
	ИначеЕсли ВидФайла = ApplicationTypes() Тогда
		ИмяФайла = ApplicationTypes();
	ИначеЕсли ВидФайла = PackageContents() Тогда
		ИмяФайла = PackageContents();
	ИначеЕсли ВидФайла = Users() Тогда
		ИмяФайла = Users();
	ИначеЕсли ВидФайла = PredefinedDataDuplicates() Тогда
		ИмяФайла = PredefinedDataDuplicates();
	Иначе
		ИмяФайла = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Для НомерСимвола = 1 По СтрДлина(Расширение) Цикл
		Символ = КодСимвола(Расширение, НомерСимвола);
		// Только цифры и латинские буквы, см. стандарт 542, п. 3.1
		Если Не (Символ >= 48 И Символ <= 57)
			И Не (Символ >= 65 И Символ <= 90)
			И Не (Символ >= 97 И Символ <= 122) Тогда
			Расширение = "bin";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Расширение <> "" Тогда
		
		ИмяФайла = ИмяФайла + "." + Расширение;
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция КоличествоЗагружаемыхОбъектовПоОбъектамМетаданных(Состав, ЗагружаемыеТипы, ДляТехническойПоддержки) Экспорт
	
	ТаблицаКоличестваЗагружаемыхОбъектов = НоваяТаблицаКоличестваОбрабатываемыхОбъектов();
	
	ПолныеИменаЗагружаемыхТипов = ПолныеИменаТипов(ЗагружаемыеТипы);
	
	ПолныеИменаИсключаемыхТипов = ПолныеИменаТипов(
		ИсключаемыеТипы(ДляТехническойПоддержки));
	
	ВидФайлаДанныеИБ = InfobaseData();		
	Для Каждого СтрокаСостава Из Состав Цикл 
		
		ТипДанных = СтрокаСостава.ТипДанных;
		
		Если СтрокаСостава.ВидФайла <> ВидФайлаДанныеИБ
			Или ПолныеИменаЗагружаемыхТипов.Получить(ТипДанных) = Неопределено
			Или ПолныеИменаИсключаемыхТипов.Получить(ТипДанных) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЗагружаемогоОбъекта = ТаблицаКоличестваЗагружаемыхОбъектов.Добавить();
		СтрокаЗагружаемогоОбъекта.ПолноеИмя = ТипДанных;
		СтрокаЗагружаемогоОбъекта.ЧислоОбъектов = СтрокаСостава.ЧислоОбъектов;
	
	КонецЦикла;
		
	ТаблицаКоличестваЗагружаемыхОбъектов.Свернуть("ПолноеИмя", "ЧислоОбъектов");
	
	Возврат ТаблицаКоличестваЗагружаемыхОбъектов;
	
КонецФункции

Функция КоличествоВыгружаемыхОбъектовПоОбъектамМетаданных(
	ВыгружаемыеТипы, ВыгружаемыеТипыОбщихДанных, ДляТехническойПоддержки) Экспорт
	
	ТаблицаКоличестваВыгружаемыхОбъектов = НоваяТаблицаКоличестваОбрабатываемыхОбъектов();
				
	ШаблонПодзапроса = "ВЫБРАТЬ
		|	 ""%1"" КАК ПолноеИмя,
		|	 %2 КАК ЧислоОбъектов
		|ИЗ
		|	%3";
				
	Подзапросы = Новый Массив; 
	
	УникальныеВыгружаемыеТипы = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УникальныеВыгружаемыеТипы, ВыгружаемыеТипы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УникальныеВыгружаемыеТипы, ВыгружаемыеТипыОбщихДанных);
	УникальныеВыгружаемыеТипы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УникальныеВыгружаемыеТипы);
		
	ПолныеИменаИсключаемыхТипов = ПолныеИменаТипов(
		ИсключаемыеТипы(ДляТехническойПоддержки));

	Для Каждого ВыгружаемыйТип Из УникальныеВыгружаемыеТипы Цикл   
			
		ПолноеИмяВыгружаемогоТипа = ВыгружаемыйТип.ПолноеИмя();
				
		Если ПолныеИменаИсключаемыхТипов.Получить(ПолноеИмяВыгружаемогоТипа) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияБТС.ЭтоКонстанта(ВыгружаемыйТип) Тогда
			СтрокаКонстанты = ТаблицаКоличестваВыгружаемыхОбъектов.Добавить();
			СтрокаКонстанты.ПолноеИмя = ПолноеИмяВыгружаемогоТипа;
			СтрокаКонстанты.ЧислоОбъектов = 1;
			Продолжить; 
		КонецЕсли;
		
		Если ОбщегоНазначенияБТС.ЭтоСсылочныеДанные(ВыгружаемыйТип) 
			Или ОбщегоНазначенияБТС.ЭтоНезависимыйНаборЗаписей(ВыгружаемыйТип) Тогда		
			
			ВыражениеРасчетаКоличества = "Количество(*)";
			ИмяТаблицы = ВыгружаемыйТип.ПолноеИмя();
		
		ИначеЕсли ОбщегоНазначенияБТС.ЭтоНаборЗаписей(ВыгружаемыйТип) Тогда 
			
			Если ОбщегоНазначенияБТС.ЭтоНаборЗаписейПерерасчета(ВыгружаемыйТип) Тогда
				
				ВыражениеРасчетаКоличества = "Количество(Различные ОбъектПерерасчета)";
				
				Подстроки = СтрРазделить(ВыгружаемыйТип.ПолноеИмя(), ".");
				ИмяТаблицы = Подстроки[0] + "." + Подстроки[1] + "." + Подстроки[3];
				
			Иначе
				
				ВыражениеРасчетаКоличества = "Количество(Различные Регистратор)";
				ИмяТаблицы = ВыгружаемыйТип.ПолноеИмя();
				
			КонецЕсли;
						
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Объект метаданных не поддерживается: %1'"),
				ВыгружаемыйТип.ПолноеИмя());		
		КонецЕсли;     
		
		Подзапросы.Добавить(
				СтрШаблон(ШаблонПодзапроса, ПолноеИмяВыгружаемогоТипа, ВыражениеРасчетаКоличества, ИмяТаблицы));
	
		Если Подзапросы.Количество() >= 100 Тогда
			ДополнитьТаблицуКоличестваОбрабатываемыхОбъектов(
				ТаблицаКоличестваВыгружаемыхОбъектов,
				ТаблицаКоличестваВыгружаемыхОбъектовПоПодзапросам(Подзапросы)); //@skip-check query-in-loop
			Подзапросы.Очистить();
		КонецЕсли;
		
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(Подзапросы) Тогда
		ДополнитьТаблицуКоличестваОбрабатываемыхОбъектов(
			ТаблицаКоличестваВыгружаемыхОбъектов,
			ТаблицаКоличестваВыгружаемыхОбъектовПоПодзапросам(Подзапросы));
	КонецЕсли;
		
	Возврат ТаблицаКоличестваВыгружаемыхОбъектов;
		
КонецФункции

Функция ЭтоПолнаяРезервнаяКопия(ПараметрыЗагрузки) Экспорт
	
	Возврат ТипРезервнойКопии(ПараметрыЗагрузки) = ТипРезервнойКопииПолная();
	
КонецФункции

// Получить данные файла из состава архива.
// 
// Параметры:
//  Состав - см. СоставАрхива
//  ПараметрыПоиска - см. НовыеПараметрыПоискаФайлаИзСоставаАрхива
// 
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - параметры файла:
// * Имя - Строка
// * Каталог - Строка
// * Размер - Число
// * ВидФайла - Строка
// * ЧислоОбъектов - Число
// * ТипДанных - Строка
Функция ПолучитьПараметрыФайлаИзСоставаАрхива(Состав, ПараметрыПоиска) Экспорт
	
	ПараметрыОтбора = Новый Структура();
	
	Для Каждого ПараметрПоиска Из ПараметрыПоиска Цикл
		
		Если ЗначениеЗаполнено(ПараметрПоиска.Значение) Тогда
			ПараметрыОтбора.Вставить(ПараметрПоиска.Ключ, ПараметрПоиска.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПараметрыОтбора) Тогда
		ВызватьИсключение НСтр("ru = 'Неверные параметры поиска файла состава архива'");
	КонецЕсли;
	
	НайденныеСтроки = Состав.НайтиСтроки(ПараметрыОтбора);
	КоличествоФайлов = НайденныеСтроки.Количество();
	
	Если КоличествоФайлов = 0 Тогда
		ВызватьИсключение НСтр("ru = 'В составе архива не найден искомый файл'");
	ИначеЕсли КоличествоФайлов > 1 Тогда
		 ВызватьИсключение НСтр("ru = 'В составе архива найдено несколько искомых файлов'");
	КонецЕсли;
	
	ПараметрыФайла = НайденныеСтроки[0]; // СтрокаТаблицыЗначений
	
	Возврат ПараметрыФайла;
	
КонецФункции

// Состав архива.
// 
// Параметры:
//  ПутьКФайлуСостава - Строка - Путь к файлу состава
// 
// Возвращаемое значение:
//  см. НовыйСостав
Функция СоставАрхива(ПутьКФайлуСостава) Экспорт
	
	ПотокЧтения = Новый ЧтениеXML();
	ПотокЧтения.ОткрытьФайл(ПутьКФайлуСостава);
	ПотокЧтения.ПерейтиКСодержимому();
	
	Если ПотокЧтения.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			Или ПотокЧтения.Имя <> "Data" Тогда
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка чтения XML. Неверный формат файла. Ожидается начало элемента %1.'"),
			"Data");
		
	КонецЕсли;
	
	Если НЕ ПотокЧтения.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка чтения XML. Обнаружено завершение файла.'");
	КонецЕсли;
	
	СоставАрхива = НовыйСостав();
	
	Пока ПотокЧтения.ТипУзла = ТипУзлаXML.НачалоЭлемента Цикл
		
		ЭлементКонтейнера = ФабрикаXDTO.ПрочитатьXML(
			ПотокЧтения,
			ФабрикаXDTO.Тип("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "File"));
			
		Файл = СоставАрхива.Добавить();
		Файл.Имя = ЭлементКонтейнера.Name;
		Файл.Каталог = ЭлементКонтейнера.Directory;
		Файл.Размер = ЭлементКонтейнера.Size;
		Файл.ВидФайла = ЭлементКонтейнера.Type;
		Файл.ЧислоОбъектов = ЭлементКонтейнера.Count;
		Файл.ТипДанных = ЭлементКонтейнера.DataType;
		
	КонецЦикла;
	
	ПотокЧтения.Закрыть();	
			
	Возврат СоставАрхива;
	
КонецФункции

// Новый состав.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый состав:
// * Имя - Строка
// * Каталог - Строка
// * Размер - Число
// * ВидФайла - Строка
// * ЧислоОбъектов - Число
// * ТипДанных - Строка
Функция НовыйСостав() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	
	НовыйСостав = Новый ТаблицаЗначений;
	НовыйСостав.Колонки.Добавить("Имя", ОписаниеТиповСтрока);
	НовыйСостав.Колонки.Добавить("Каталог", ОписаниеТиповСтрока);
	НовыйСостав.Колонки.Добавить("Размер", ОписаниеТиповЧисло);
	НовыйСостав.Колонки.Добавить("ВидФайла", ОписаниеТиповСтрока);
	НовыйСостав.Колонки.Добавить("ЧислоОбъектов", ОписаниеТиповЧисло);
	НовыйСостав.Колонки.Добавить("ТипДанных", ОписаниеТиповСтрока);
	
	Возврат НовыйСостав;
	
КонецФункции

// Новые параметры поиска файла из состава архива.
// 
// Возвращаемое значение:
//  Структура - Новые параметры поиска файла из состава архива:
// * Имя - Строка
// * Каталог - Строка
// * ВидФайла - Строка
// * ТипДанных - Строка
Функция НовыеПараметрыПоискаФайлаИзСоставаАрхива() Экспорт
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("Имя", "");
	ПараметрыПоиска.Вставить("Каталог", "");
	ПараметрыПоиска.Вставить("ВидФайла", "");
	ПараметрыПоиска.Вставить("ТипДанных", "");
	
	Возврат ПараметрыПоиска;
	
КонецФункции

Функция ВыгрузкаВРежимеДляТехническойПоддержки(ПутьКФайлуДайджеста) Экспорт
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлуДайджеста);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДайджестВыгрузки = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
	
	Если ДайджестВыгрузки <> Неопределено Тогда
		СписокЭлементов = ДайджестВыгрузки.ПолучитьЭлементыПоИмени("DataDumpType");
		ВыгрузкаДляТехническойПоддержки = ЗначениеЗаполнено(СписокЭлементов) И СписокЭлементов[0].ТекстовоеСодержимое = "TechnicalSupport";	
	Иначе
		ВыгрузкаДляТехническойПоддержки = Ложь;
	КонецЕсли;
	
	Возврат ВыгрузкаДляТехническойПоддержки;

КонецФункции  

// Возвращает СериализаторXDTO с аннотацией типов.
//
// Возвращаемое значение:
//	СериализаторXDTO - сериализатор.
//
Функция СериализаторXDTOСАннотациейТипов() Экспорт
	
	ДвоичныеДанныеСхемы = СхемаКонфигурации.ДвоичныеДанныеСхемы(Истина, Истина);
	СхемаXML = СхемаXML(ДвоичныеДанныеСхемы);	
	Фабрика = ФабрикаПоСхеме(СхемаXML);	
	Возврат Новый СериализаторXDTO(Фабрика);
	
КонецФункции

// Наличие обработчиков по объектам метаданных.
// 
// Параметры:
//  ТекущиеОбработчики - ТаблицаЗначений - Текущие обработчики
//  ИменаКолонокОбработчиков - Массив из Строка -  Имена колонок обработчиков
// 
// Возвращаемое значение:
//  Соответствие из ОбъектМетаданных: Структура - Наличие обработчиков по объектам метаданных
Функция НаличиеОбработчиковПоОбъектамМетаданных(ТекущиеОбработчики, ИменаКолонокОбработчиков) Экспорт
	
	НаличиеОбработчиков = Новый Соответствие();
	
	Для Каждого СтрокаТаблицы Из ТекущиеОбработчики Цикл
		
		НаличиеОбработчиковОбъекта = НаличиеОбработчиков.Получить(СтрокаТаблицы.ОбъектМетаданных);
		
		Если НаличиеОбработчиковОбъекта = Неопределено Тогда
			НаличиеОбработчиковОбъекта = НовыеДанныеНаличияОбработчиковПоОбъектуМетаданных(ИменаКолонокОбработчиков);
			НаличиеОбработчиков.Вставить(СтрокаТаблицы.ОбъектМетаданных, НаличиеОбработчиковОбъекта);
		КонецЕсли;
		
		Для Каждого ИмяОбработчика Из ИменаКолонокОбработчиков Цикл
			НаличиеОбработчиковОбъекта[ИмяОбработчика] = Макс(
				НаличиеОбработчиковОбъекта[ИмяОбработчика], СтрокаТаблицы[ИмяОбработчика]);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НаличиеОбработчиков;
	
КонецФункции

// Новые данные наличия обработчиков по объекту метаданных.
// 
// Параметры:
//  ИменаКолонокОбработчиков - Массив из Строка - Имена колонок обработчиков
// 
// Возвращаемое значение:
//  Структура - Новые данные наличия обработчиков по объекту метаданных
Функция НовыеДанныеНаличияОбработчиковПоОбъектуМетаданных(ИменаКолонокОбработчиков) Экспорт
	
	НаличиеОбработчиков = Новый Структура();
	
	Для Каждого ИмяКолонки Из ИменаКолонокОбработчиков Цикл
		НаличиеОбработчиков.Вставить(ИмяКолонки, Ложь);
	КонецЦикла;
	
	Возврат НаличиеОбработчиков;
	
КонецФункции

// Параметры:
//  ПараметрыВыгрузкиЗагрузки - Структура
// 
// Возвращаемое значение:
//  Число
Функция НомерКлиентскогоСеансаИзПараметров(ПараметрыВыгрузкиЗагрузки) Экспорт
	
	НомерКлиентскогоСеанса = 0;
	
	Если ПараметрыВыгрузкиЗагрузки.Свойство("НомерКлиентскогоСеанса")
		И ТипЗнч(ПараметрыВыгрузкиЗагрузки.НомерКлиентскогоСеанса) = Тип("Число")
		И ЗначениеЗаполнено(ПараметрыВыгрузкиЗагрузки.НомерКлиентскогоСеанса) Тогда
		
		НомерКлиентскогоСеанса = ПараметрыВыгрузкиЗагрузки.НомерКлиентскогоСеанса;
		
	КонецЕсли;
	
	Возврат НомерКлиентскогоСеанса;
	
КонецФункции

Функция РазмерПриложенияБольшеДопустимого() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Процедура ПоместитьОшибкиВыгружаемыхДанныхВоВременноеХранилище(АдресХранилища) Экспорт
	 
	ТипыМоделиДанных = ПолучитьТипыМоделиДанныхОбласти();
	ТипыОбщихДанных
		= ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке();
	
	ОшибкиВыгружаемыхДанных = ОшибкиВыгружаемыхДанных(ТипыМоделиДанных, ТипыОбщихДанных);
	
	ПоместитьВоВременноеХранилище(ОшибкиВыгружаемыхДанных, АдресХранилища);
	
КонецПроцедуры

// Проверяет, что переданные метаданные включены в план обмена Миграция приложений
// 
// Параметры:
//  ТипыМоделиДанных - Массив из ОбъектМетаданных - Типы модели данных:
// * Имя - Строка -
// * Измерения - Массив из ОбъектМетаданных -
// УчитыватьДобавленныеВРасширении - Булево - Включает\отключает проверку для объектов метаданных расширений
// 
// Возвращаемое значение:
//  Массив из Строка - Текстовые представления ошибок
Функция ОшибкиМетаданныеНеВключеныВПланОбмена(ТипыМоделиДанных, УчитыватьДобавленныеВРасширении = Истина) Экспорт
	
	Ошибки = Новый Массив();
	ИсключаемыеТипы = ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки();
		
	Для Каждого ТипОбщихДанных Из ТипыМоделиДанных Цикл
	
		Если Метаданные.ПланыОбмена.МиграцияПриложений.Состав.Содержит(ТипОбщихДанных)
			Или Метаданные.РегламентныеЗадания.Содержит(ТипОбщихДанных)
			Или Метаданные.ВнешниеИсточникиДанных.Содержит(ТипОбщихДанных)
			Или Метаданные.СервисыИнтеграции.Содержит(ТипОбщихДанных)
			Или Метаданные.ПланыОбмена.Содержит(ТипОбщихДанных) 
			Или (Не УчитыватьДобавленныеВРасширении И ТипОбщихДанных.РасширениеКонфигурации() <> Неопределено)
			Или ИсключаемыеТипы.Найти(ТипОбщихДанных) <> Неопределено Тогда
			
			Продолжить;
			
		КонецЕсли;
			
		ИмяМодуля = "ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки";
		ШаблонТекстаОшибки = НСтр("ru = 'Объект метаданных %1 не включен в план обмена Миграция приложений. 
			|Его необходимо включить в состав плана обмена Миграция приложений с запрещенной авторегистрацией. 
			|В случае, если объект не должен выгружаться, необходимо дополнительно добавить его в исключаемые из выгрузки. См. %2'");
		
		Ошибки.Добавить(СтрШаблон(ШаблонТекстаОшибки, ТипОбщихДанных.ПолноеИмя(), ИмяМодуля));
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

Функция КоличествоОбъектовРасширенийНеВМиграцииДляБлокировки() Экспорт
	
	Возврат 0;
	
КонецФункции

Процедура ОповеститьПользователейОЗавершенииВыгрузки() Экспорт
	
	Возврат;
	
КонецПроцедуры

// Возвращает признак, что начат процесс завершения резервного копирования области данных.
//
// Возвращаемое значение:
//  Булево
//
Функция ВыполняетсяЗавершениеВыгрузкиВТранзакции() Экспорт
	
	Ключ = КлючЗавершенияВыгрузкиВТранзакции();
	МаксПопытокПроверкиЗавершенияРК = 100;
	Для НомерПопытки = 1 По МаксПопытокПроверкиЗавершенияРК Цикл
		
		// Проверка выполняется в цикле, т.к. при параллельном выполнении в разных транзакциях, может возникнуть ситуация,
		// что два проверяющих сеанса пересекутся на блокировке ключа, первый проверяющий заблокирует и второй проверяющий
		// тоже попытается заблокировать, до того момента, пока первый разблокировал ключ. Такое может происходить
		// из-за того, что метод "ЗаблокироватьДанныеДляРедактирования" не имеет ожидания.
		//
		// Использование управляемой блокировки невозможно, т.к. при ошибке ее установки родительская транзакция
		// будет считаться "сломанной".
		
		ВыполняетсяЗавершениеРК = Ложь;
		Попытка
			ЗаблокироватьДанныеДляРедактирования(Ключ);
			РазблокироватьДанныеДляРедактирования(Ключ);
		Исключение
			ВыполняетсяЗавершениеРК = Истина;
		КонецПопытки;
		
		Если Не ВыполняетсяЗавершениеРК Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВыполняетсяЗавершениеРК;
	
КонецФункции

// Устанавливает признак, что начат процесс завершения резервного копирования области данных.
//
Процедура НачатьЗавершениеВыгрузкиВТранзакции() Экспорт
	
	ЗаблокироватьДанныеДляРедактирования(КлючЗавершенияВыгрузкиВТранзакции());
	
КонецПроцедуры

Функция ВыгрузитьАрхивДанныхВТом(ИмяФайлаАрхива, СоставнаяЗагрузка) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	
КонецФункции

Процедура ДобавитьФайлВАрхивНаТоме(Архив, СоставнаяЗагрузка) Экспорт
	
	Возврат;
	
КонецПроцедуры

#Область Функциональность1СПлюс

Функция ПолучитьМодуль1СПлюс() Экспорт
	
	ИмяПодсистемы = "ПлюсСервис";
	
	Если ОбщегоНазначения.ПодсистемаСуществует(ИмяПодсистемы) Тогда
		 
		МодульПлюсСервис = ОбщегоНазначения.ОбщийМодуль(ИмяПодсистемы);
		
		Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(МодульПлюсСервис.ВерсияБиблиотеки(), "1.0.0.4") >= 0 Тогда
			Возврат МодульПлюсСервис;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ВосстановитьРасширения1СПлюс(Расширения1СПлюс) Экспорт
	
	МодульПлюсСервис = ПолучитьМодуль1СПлюс();
	
	Если Не МодульПлюсСервис = Неопределено Тогда
		МодульПлюсСервис.ВосстановитьРасширения(Расширения1СПлюс);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУстановленныеРасширения1СПлюс(Расширения1СПлюс) Экспорт
	
	МодульПлюсСервис = ПолучитьМодуль1СПлюс();
	
	Если Не МодульПлюсСервис = Неопределено Тогда
		МодульПлюсСервис.ЗаполнитьУстановленныеРасширения(Расширения1СПлюс);
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьРасширения1СПлюс() Экспорт
	
	Модуль1СПлюс = ПолучитьМодуль1СПлюс();
	
	Если Модуль1СПлюс <> Неопределено Тогда
		Возврат Модуль1СПлюс.СписокИзмененныхРасширений();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПараллельнаяВыгрузкаЗагрузка

// Параметры параллельной загрузки данных.
// 
// Возвращаемое значение:
//  Структура - Параметры параллельной загрузки данных:
// * ДоступноИспользование - Булево -
// * КоличествоПотоков - Число -
Функция ПараметрыПараллельнойВыгрузкиЗагрузкиДанных() Экспорт
	
	ДоступноИспользование = Не ОбщегоНазначения.РазделениеВключено()
		И Не ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Параметры = Новый Структура();
	Параметры.Вставить("ДоступноИспользование", ДоступноИспользование);
	Параметры.Вставить("КоличествоПотоков", 4);
	
	Возврат Параметры;
	
КонецФункции

// Параметры:
//  ПараметрыВыгрузкиЗагрузки - Структура
// 
// Возвращаемое значение:
//  Булево
Функция ИспользоватьМногопоточность(ПараметрыВыгрузкиЗагрузки) Экспорт
	
	КоличествоПотоков = 0;
	
	Если ПараметрыВыгрузкиЗагрузки.Свойство("КоличествоПотоков") Тогда
		КоличествоПотоков = ПараметрыВыгрузкиЗагрузки.КоличествоПотоков;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(КоличествоПотоков) И КоличествоПотоков > 1;
	
КонецФункции

// Запускает потоки выгрузки загрузки данных.
// 
// Параметры:
//  ПараметрыПотоков - см. НовыеПараметрыПотоковВыгрузкиЗагрузкиДанных
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  Массив из ФоновоеЗадание - Запущенные фоновые задания
Функция ЗапуститьПотокиВыгрузкиЗагрузкиДанных(ПараметрыПотоков, Контейнер) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыПотоков.КоличествоПотоков) Тогда
		ВызватьИсключение НСтр("ru = 'Некорректные параметры потоков, не указано количество потоков.'");
	КонецЕсли;
	
	Если ПараметрыПотоков.ЭтоВыгрузка Тогда
		НаименованиеЗадания = НСтр("ru = 'Выгрузка данных информационной базы'");
	ИначеЕсли ПараметрыПотоков.ЭтоЗагрузка Тогда
		НаименованиеЗадания = НСтр("ru = 'Загрузка данных информационной базы'");
	Иначе
		ВызватьИсключение НСтр("ru = 'Некорректные параметры потоков, не указан признак выгрузки или загрузки.'");
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ПараметрыПотоков);
	
	Задания = Новый Массив();
	
	Для НомерПотока = 1 По ПараметрыПотоков.КоличествоПотоков Цикл
		
		Задание = ФоновыеЗадания.Выполнить(
			"ВыгрузкаЗагрузкаДанныхСлужебный.ВыгрузкаЗагрузкаДанныхИнформационнойБазыВПотоке",
			ПараметрыЗадания,
			КлючЗаданияВыгрузкиЗагрузкиДанных(Контейнер),
			НаименованиеЗадания);
		
		Задания.Добавить(Задание);
		
		ПослеЗапускаПотокаВыгрузкиЗагрузкиДанных(Задание, Контейнер, ПараметрыПотоков.ВидПотоков);
		
		Если НомерПотока < ПараметрыПотоков.КоличествоПотоков Тогда
			// Разносим старт заданий по времени
			ВызватьПаузу(1000);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Задания;
	
КонецФункции

Функция ИмяМетодаВыгрузкиЗагрузкиДанныхВПотоке() Экспорт
	
	Возврат "ВыгрузкаЗагрузкаДанныхСлужебный.ВыгрузкаЗагрузкаДанныхИнформационнойБазыВПотоке";
	
КонецФункции

// Имя метода сообщения потока завершение выгрузки.
// 
// Возвращаемое значение:
//  Строка - Имя метода сообщения потока завершение выгрузки
Функция ИмяМетодаСообщенияПотока_ЗавершениеВыгрузки() Экспорт
	
	Возврат "ЗавершениеВыгрузки";
	
КонецФункции

// Ожидает выгрузку загрузку данных в потоках.
// 
// Параметры:
//  Задания - Массив из ФоновоеЗадание - Запущенные задания
//  ПараметрыПроцесса - Структура - Для загрузки данных см. обработку ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы.НовыеПараметрыПроцессаЗагрузкиДанныхИнформационнойБазы
//									Для выгрузки данных см. обработку ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы.НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
Процедура ОжидатьВыгрузкуЗагрузкуДанныхВПотоках(Задания, ПараметрыПроцесса) Экспорт
	
	УправляющееЗадание = ПолучитьЗаданиеПараллельнойВыгрузкиЗагрузкиДанных();
	ИдентификаторЗадания = УправляющееЗадание.УникальныйИдентификатор;
	
	ТаймаутОжиданияЗаданий = 1; // сек.
	ПериодичностьЗапускаДополнительныхПотоков = 10000; // 10 сек.
	
	ТаблицаСообщений = Неопределено;
	ДатаПоследнегоЗапускаДополнительныхПотоков = ТекущаяУниверсальнаяДатаВМиллисекундах() - ПериодичностьЗапускаДополнительныхПотоков;
	
	Контейнер = ПараметрыПроцесса.Контейнер; // ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
	ИдентификаторПроцесса = Контейнер.ИдентификаторПроцесса();
	
	Пока Истина Цикл
		
		Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ДатаПоследнегоЗапускаДополнительныхПотоков >= ПериодичностьЗапускаДополнительныхПотоков Тогда
			ДатаПоследнегоЗапускаДополнительныхПотоков = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗапуститьДополнительныеПотокиВыгрузкиЗагрузкиДанных(Задания, ПараметрыПроцесса);
		КонецЕсли;
		
		// Если задания еще ничего не отправило, то засыпаем на время таймаута, чтобы в холостую не выполнять обработку данных от заданий
		Если Не ЗначениеЗаполнено(ТаблицаСообщений) Тогда
			Задания = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(Задания, ТаймаутОжиданияЗаданий);
		КонецЕсли;
		
		НомерЗадания = Задания.Количество();
		
		Ошибки = Новый Массив();
		ЗавершенныеЗадания = Новый Массив();
		ТаблицаСообщений = НоваяТаблицаСообщенийПотоков();
		
		Пока НомерЗадания > 0 Цикл
			
			НомерЗадания = НомерЗадания - 1;
			Задание = Задания[НомерЗадания];
			
			Если Задание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
				Задания.Удалить(НомерЗадания);
			КонецЕсли;
			
			ПолучитьСообщенияПотока(ТаблицаСообщений, Задание, ИдентификаторПроцесса);
			
			ТекстОшибки = Неопределено;
			
			Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				
				ИнформацияОбОшибке = ?(Задание.ИнформацияОбОшибке = Неопределено,
					НСтр("ru = 'Отсутствует информация об ошибке.'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке));
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Поток %1, фоновое задание завершилось аварийно.
						 |%2'"),
					НомерПотокаИзКлючаЗадания(Задание.Ключ),
					ИнформацияОбОшибке);
				
			ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
				
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Поток %1, фоновое задание отменено.'"),
					НомерПотокаИзКлючаЗадания(Задание.Ключ));
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				
				Ошибки.Добавить(ТекстОшибки);
				
				ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(Задание.УникальныйИдентификатор);
				
			ИначеЕсли ЗаданиеПотокаЗавершено(Задание, ТаблицаСообщений) Тогда
				
				 ЗавершенныеЗадания.Добавить(НомерЗадания);
				 
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Ошибки) Тогда
			
			ЗавершенныеЗадания.Очистить();
			
			Для Каждого Задание Из Задания Цикл
				
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Поток %1, фоновое задание прервано из-за ошибки в другом потоке.'"),
					НомерПотокаИзКлючаЗадания(Задание.Ключ));
				
				Задание.Отменить();
				Ошибки.Добавить(ТекстОшибки);
				
				ПолучитьСообщенияПотока(ТаблицаСообщений, Задание, ИдентификаторПроцесса);
				
				ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(Задание.УникальныйИдентификатор);
				
			КонецЦикла;
			
			ОбработатьСообщенияПотоков(ТаблицаСообщений, Контейнер);
			
			ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(ИдентификаторЗадания);
			
			РазделительОшибок = Символы.ПС + Символы.ПС;
			ТекстОшибки = СтрСоединить(Ошибки, РазделительОшибок);
			
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		ОбработатьСообщенияПотоков(ТаблицаСообщений, Контейнер);
		
		Для Каждого НомерЗадания Из ЗавершенныеЗадания Цикл
			Задание = Задания[НомерЗадания];
			Задания.Удалить(НомерЗадания);
			Задание.Отменить();
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(Задания) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(ИдентификаторЗадания);
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
// * ЭтоВыгрузка - Булево
// * ЭтоЗагрузка - Булево
// * КоличествоПотоков - Число
// * ВидПотоков - см. ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени
// * Параметры - Структура
Функция НовыеПараметрыПотоковВыгрузкиЗагрузкиДанных() Экспорт
	
	ПараметрыПотока = Новый Структура();
	ПараметрыПотока.Вставить("ЭтоВыгрузка", Ложь);
	ПараметрыПотока.Вставить("ЭтоЗагрузка", Ложь);
	ПараметрыПотока.Вставить("КоличествоПотоков", 0);
	ПараметрыПотока.Вставить("ВидПотоков", ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени("Дополнительный"));
	ПараметрыПотока.Вставить("Параметры", Новый Структура());
	
	Возврат ПараметрыПотока;
	
КонецФункции

// Выгрузка загрузка данных информационной базы в потоке.
// 
// Параметры:
//  ПараметрыПотока - см. ВыгрузкаЗагрузкаДанныхСлужебный.ВыгрузкаЗагрузкаДанныхИнформационнойБазыВПотоке
Процедура ВыгрузкаЗагрузкаДанныхИнформационнойБазыВПотоке(ПараметрыПотока) Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПараметрыПотока.ЭтоВыгрузка Тогда
		
		Обработки.ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы.ВыгрузитьДанныеИнформационнойБазыВПотоке(
			ПараметрыПотока.Параметры);
		
	ИначеЕсли ПараметрыПотока.ЭтоЗагрузка Тогда
		
		МодульУправлениеДоступом = Неопределено;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
			МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
			МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Истина, Ложь);
		КонецЕсли;
		
		Попытка
			
			Обработки.ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы.ЗагрузитьДанныеИнформационнойБазыВПотоке(
				ПараметрыПотока.Параметры);
			
			Если МодульУправлениеДоступом <> Неопределено Тогда
				МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
			КонецЕсли;
			
		Исключение
			
			Если МодульУправлениеДоступом <> Неопределено Тогда
				МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
			КонецЕсли;
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Некорректные параметры потока.'");
		
	КонецЕсли;
	
КонецПроцедуры

// Отправить сообщение в родительский поток.
// 
// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - Текущий контейнер
//  ИмяМетода - Строка - Имя метода
//  ДанныеСообщения - Структура - Данные сообщения
Процедура ОтправитьСообщениеВРодительскийПоток(Контейнер, ИмяМетода, ДанныеСообщения) Экспорт
	
	Если Не Контейнер.КлиентскийСеансСуществует() Тогда
		Контейнер.ПрерватьПроцессПриОтсутствииКлиентскогоСеанса();
	КонецЕсли;
	
	СообщениеПотока = Новый Структура();
	СообщениеПотока.Вставить("ДатаОтправки", ТекущаяУниверсальнаяДатаВМиллисекундах());
	СообщениеПотока.Вставить("НомерСообщения", Контейнер.СледующийНомерСообщенияВПотоке());
	СообщениеПотока.Вставить("ИмяМетода", ИмяМетода);
	СообщениеПотока.Вставить("ДанныеСообщения", ДанныеСообщения);
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON();
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьДанныхСообщения, СообщениеПотока);
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.ИдентификаторНазначения = Контейнер.ИдентификаторПроцесса();
	Сообщение.Текст = ЗаписьДанныхСообщения.Закрыть();
	Сообщение.Сообщить();
	
КонецПроцедуры

// Получить задание параллельной выгрузки загрузки данных.
// 
// Возвращаемое значение:
//  ФоновоеЗадание, Неопределено -
Функция ПолучитьЗаданиеПараллельнойВыгрузкиЗагрузкиДанных() Экспорт
	
	Задание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
	
	Если Задание = Неопределено Тогда
		ВызватьИсключение НСтр(
			"ru = 'Параллельная выгрузка\загрузка данных может выполняться только в фоновом задании.'");
	КонецЕсли;
	
	Возврат Задание;
	
КонецФункции

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  см. ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени
Функция ВидПотокаПараллельнойВыгрузкиЗагрузкиДанных(Контейнер) Экспорт
	
	ИмяВидаПотока = ?(Контейнер.КоличествоПотоков() = 1, "Основной", "Дополнительный");
	
	Возврат ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени(ИмяВидаПотока);
	
КонецФункции

// Параметры:
//  Задание - ФоновоеЗадание
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
//  ВидПотока - см. ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени
Процедура ПослеЗапускаПотокаВыгрузкиЗагрузкиДанных(Задание, Контейнер, ВидПотока) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор
Процедура ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(ИдентификаторЗадания) Экспорт
	
	Возврат;
	
КонецПроцедуры

// Параметры:
//  ИдентификаторЗадания - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  Булево
Функция НужноЗавершитьПотокВыгрузкиЗагрузкиДанных(ИдентификаторЗадания) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Параметры:
//  ИмяВидаЗадания - Строка
// 
// Возвращаемое значение:
//  Неопределено
Функция ВидЗаданияВыгрузкиЗагрузкиДанныхПоИмени(ИмяВидаЗадания) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Параметры:
//  ИмяВидаПотока - Строка
// 
// Возвращаемое значение:
//  Неопределено
Функция ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени(ИмяВидаПотока) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СостояниеВыгрузкиЗагрузки

Функция НеобходимоПодсчитыватьКоличествоОбъектов(ПараметрыВыгрузкиЗагрузки) Экспорт
	
	Возврат НеобходимоФиксироватьСостояниеВыгрузкиЗагрузкиОбластиДанных(ПараметрыВыгрузкиЗагрузки)
		Или ИспользоватьМногопоточность(ПараметрыВыгрузкиЗагрузки);
	
КонецФункции

Функция НеобходимоФиксироватьСостояниеВыгрузкиЗагрузкиОбластиДанных(ПараметрыВыгрузкиЗагрузки) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыВыгрузкиЗагрузки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторСостояния = Неопределено;
	ПараметрыВыгрузкиЗагрузки.Свойство("ИдентификаторСостояния", ИдентификаторСостояния);
	
	Возврат ЗначениеЗаполнено(ИдентификаторСостояния);
	
КонецФункции

Функция СостояниеВыгрузкиЗагрузкиОбластиДанных(ИдентификаторСостояния) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСостояния);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанных,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ЗагрузкаОбластиДанных КАК ЗагрузкаОбластиДанных,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ПроцентЗавершения КАК ПроцентЗавершения,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.РасчетнаяДатаЗавершения КАК РасчетнаяДатаЗавершения,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ИмяОбрабатываемогоОбъектаМетаданных КАК ИмяОбрабатываемогоОбъектаМетаданных,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ОбработаноОбъектов КАК ОбработаноОбъектов,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ОбработаноОбъектовДоТекущегоОбъектаМетаданных КАК
	|		ОбработаноОбъектовДоТекущегоОбъектаМетаданных,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ДатаНачала КАК ДатаНачала,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ДатаНачалаОбработкиОбъектов <> ДАТАВРЕМЯ(1, 1, 1) КАК
	|		ОбработкаОбъектовЗапущена,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ДатаЗавершенияОбработкиОбъектов <> ДАТАВРЕМЯ(1, 1, 1) КАК
	|		ОбработкаОбъектовЗавершена,
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.ФактическаяДатаЗавершения КАК ФактическаяДатаЗавершения
	|ИЗ
	|	РегистрСведений.СостоянияВыгрузкиЗагрузкиОбластейДанных КАК СостоянияВыгрузкиЗагрузкиОбластейДанных
	|ГДЕ
	|	СостоянияВыгрузкиЗагрузкиОбластейДанных.Идентификатор = &Идентификатор";
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Если Не ЗначениеЗаполнено(ТаблицаРезультата) Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаРезультата)[0];
	
КонецФункции

Функция ПредставлениеСостоянияВыгрузкиЗагрузкиОбластиДанных(СостояниеВыгрузкиЗагрузки, ЧасовойПояс = Неопределено) Экспорт
		
	Если Не СостояниеВыгрузкиЗагрузки.ОбработкаОбъектовЗапущена Тогда
		
		Возврат ВыгрузкаЗагрузкаДанныхКлиентСервер.ПредставлениеСостоянияПодготовкиВыгрузкиЗагрузкиОбластиДанных(
			СостояниеВыгрузкиЗагрузки.ЗагрузкаОбластиДанных);
				
	ИначеЕсли СостояниеВыгрузкиЗагрузки.ОбработкаОбъектовЗавершена Тогда
		
		Если СостояниеВыгрузкиЗагрузки.ЗагрузкаОбластиДанных Тогда
			ПредставлениеСостояния = НСтр("ru = 'Выполняется завершение загрузки данных.'");
		Иначе
			ПредставлениеСостояния = НСтр("ru = 'Выполняется завершение выгрузки данных.'");
		КонецЕсли;	
		
	Иначе
		
		ЧастиПредставленияСостояния = Новый Массив();
		
		Если СостояниеВыгрузкиЗагрузки.ЗагрузкаОбластиДанных Тогда
			ПерваяЧастьПредставленияСостояния = НСтр("ru = 'Выполняется загрузка данных.'");
		Иначе
			ПерваяЧастьПредставленияСостояния = НСтр("ru = 'Выполняется выгрузка данных.'");
		КонецЕсли;
		
		ЧастиПредставленияСостояния.Добавить(ПерваяЧастьПредставленияСостояния);		
		
		РасчетнаяДатаЗавершения = СостояниеВыгрузкиЗагрузки.РасчетнаяДатаЗавершения;
		Если ЗначениеЗаполнено(РасчетнаяДатаЗавершения) Тогда
			
			Если ЧасовойПояс = Неопределено Тогда 
				ЧасовойПояс = ЧасовойПоясСеанса();
			КонецЕсли;
			
			РасчетнаяДатаЗавершенияВМестномВремени = МестноеВремя(РасчетнаяДатаЗавершения, ЧасовойПояс);
			ТекущаяДатаВМестномВремени = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПояс);
			
			Если НачалоДня(ТекущаяДатаВМестномВремени) = НачалоДня(РасчетнаяДатаЗавершенияВМестномВремени) Тогда
				ШаблонПредставленияДатыЗавершения = НСтр("ru = 'Расчетное время завершения %1.'");
				ФорматнаяСтрока = "ДФ='HH:mm';";
			Иначе
				ШаблонПредставленияДатыЗавершения = НСтр("ru = 'Расчетная дата завершения %1.'");
				ФорматнаяСтрока = "ДФ='dd MMMM HH:mm';";
			КонецЕсли;

			ВтораяЧастьПредставленияСостояния = СтрШаблон(
				ШаблонПредставленияДатыЗавершения,
				Формат(РасчетнаяДатаЗавершенияВМестномВремени, ФорматнаяСтрока));
			
			ЧастиПредставленияСостояния.Добавить(ВтораяЧастьПредставленияСостояния);			
		
		КонецЕсли;

		ПредставлениеСостояния = СтрСоединить(ЧастиПредставленияСостояния, " ");
		
	КонецЕсли;
		
	Возврат ПредставлениеСостояния;
	
КонецФункции

Функция ПроцентЗавершенияВыгрузкиЗагрузкиОбластиДанных(СостояниеВыгрузкиЗагрузкиОбластиДанных) Экспорт
		
	Если СостояниеВыгрузкиЗагрузкиОбластиДанных = Неопределено 
		Или Не СостояниеВыгрузкиЗагрузкиОбластиДанных.ОбработкаОбъектовЗапущена
		Или СостояниеВыгрузкиЗагрузкиОбластиДанных.ОбработкаОбъектовЗавершена Тогда	
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СостояниеВыгрузкиЗагрузкиОбластиДанных.ПроцентЗавершения;
			
КонецФункции

#КонецОбласти

#Область ОбработкаСсылокНаТипыИсключаемыеИзВыгрузки

// Дополняет массив типов исключаемых из выгрузки-загрузки
// Предназначен для использования в обработчиках ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
//
// Параметры:
// 	Типы - Массив из ФиксированнаяСтруктура
//	Тип - ОбъектМетаданных - объект метаданных исключаемый из выгрузки-загрузки
//	ДействиеСоСсылками - Строка -  вариант действия при обнаружении ссылки на объект исключаемый из выгрузки
//		Поддерживаются следующие действия:
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять() - не будет произведено никаких действий  
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиОчищать() - будет выполнено очищение ссылки на невыгружаемый объект  
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеВыгружатьОбъект() - объект содержащий ссылку не будет выгружен
//		  
// Пример использования:
//  Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
//		ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
//			Типы,
//			Метаданные.Справочники.СценарииПроверок,
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеВыгружатьОбъект());
//	КонецПроцедуры 
//
Процедура ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(Типы, Тип, ДействиеСоСсылками) Экспорт

	Если Не (ДействиеСоСсылками = ДействиеСоСсылкамиНеИзменять() 
		Или ДействиеСоСсылками = ДействиеСоСсылкамиОчищать() 
		Или ДействиеСоСсылками = ДействиеСоСсылкамиНеВыгружатьОбъект()) Тогда	
		
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Обнаружено неподдерживаемое действие ''%1'' при обнаружении ссылки на тип ''%2'' исключаемый из выгрузки'"),
			ДействиеСоСсылками,
			Тип);	
					
	КонецЕсли;
	
	ОписаниеТипа = Новый Структура("Тип, Действие", Тип, ДействиеСоСсылками);
	
	Типы.Добавить(
		Новый ФиксированнаяСтруктура(ОписаниеТипа));
	
КонецПроцедуры
	
// Действие со ссылками - Не изменять.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиНеИзменять() Экспорт
	Возврат "НеИзменять";	
КонецФункции

// Действие со ссылками - Очищать.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиОчищать() Экспорт
	Возврат "Очищать";	
КонецФункции

// Действие со ссылками - Не выгружать объект.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиНеВыгружатьОбъект() Экспорт
	Возврат "НеВыгружатьОбъект";	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗагрузитьДанныеТекущейОбластиИзАрхиваВФоне(Знач ДанныеФайла, Знач ПараметрыЗагрузки)
		
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() 
		И ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения = "BackgroundJob" Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно выполнить загрузку в фоновом режиме: файловая информационная база поддерживает одновременное выполнение только одного фонового задания.'");
	КонецЕсли;			
			
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ПараметрыЗадания = Новый Массив();
	ПараметрыЗадания.Добавить(ДанныеФайла);
	ПараметрыЗадания.Добавить(ПараметрыЗагрузки);
	ПараметрыЗадания.Добавить(АдресРезультата);
	
	Задание = РасширенияКонфигурации.ВыполнитьФоновоеЗаданиеСРасширениямиБазыДанных(
		"ВыгрузкаЗагрузкаДанныхСлужебный.НачатьЗагрузкуДанныхТекущейОбластиИзАрхива",
		ПараметрыЗадания,
		Новый УникальныйИдентификатор,
		НСтр("ru = 'Восстановление области данных из архива'"))
		.ОжидатьЗавершенияВыполнения();
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		ВызватьИсключение НСтр("ru = 'Задание отменено'");
	ИначеЕсли Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(Задание.ИнформацияОбОшибке);
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);	
	
КонецФункции

Функция ВозможноПродолжениеПроцедурыЗагрузки(ХешСуммаИсточника, ХешСуммаПараметров)
	
	ИнформацияОПроцедуреЗагрузки =  ИнформацияОПроцедуреЗагрузки();
	РезультатПроверки = РезультатПроверкиВозможностиПродолженияЗагрузкиДанныхОбласти(
		ИнформацияОПроцедуреЗагрузки,
		ХешСуммаИсточника,
		ХешСуммаПараметров);
	
	СобытиеЖурналаРегистрации = НСтр(
		"ru = 'Выгрузка загрузка данных. Продолжение процедуры загрузки невозможно'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
	Если Не РезультатПроверки.ЭтоПродолжениеЗагрузки Тогда 
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Предупреждение,,,
			НСтр("ru = 'Отсутствует информация о прошлой процедуре загрузки'"));
		Возврат Ложь;
	КонецЕсли;
	
	Если РезультатПроверки.РазличаетсяВерсияКонфигурации Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Изменилось имя или версия конфигурации 
			|Прошлые значения: %1 %2
			|Текущие значения: %3 %4'"),
			ИнформацияОПроцедуреЗагрузки.Конфигурация,
			ИнформацияОПроцедуреЗагрузки.ВерсияКонфигурации,
			Метаданные.Имя,
			Метаданные.Версия);
			
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстПредупреждения);
		Возврат Ложь;
	КонецЕсли;
	
	Если РезультатПроверки.РазличаетсяХешСуммаИсточника Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Изменился источник загрузки 
				 |Прошлое значение хеш суммы: %1 
				 |Текущее значение хеш суммы: %2'"),
			ИнформацияОПроцедуреЗагрузки.ХешСуммаИсточника,
			ХешСуммаИсточника);
			
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстПредупреждения);
			
		Возврат Ложь;
	КонецЕсли;

	Если РезультатПроверки.РазличаетсяХешСуммаПараметров Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Изменились параметры загрузки
				 |Прошлое значение хеш суммы: %1 
				 |Текущее значение хеш суммы: %2'"),
			ИнформацияОПроцедуреЗагрузки.ХешСуммаПараметров,
			ХешСуммаПараметров);
			
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстПредупреждения);
			
		Возврат Ложь;
	КонецЕсли;
	
	Если Не РезультатПроверки.ОпределенПоследнийЗагружаемыйОбъектМетаданных Тогда
	
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Предупреждение,,,
			НСтр("ru = 'Процесс загрузки был прерван не на загрузке метаданных'"));
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РезультатПроверкиВозможностиПродолженияЗагрузкиДанныхОбласти(
	ИнформацияОПроцедуреЗагрузки, ХешСуммаИсточника, ХешСуммаПараметров)
	
	Результат = Новый Структура();
	Результат.Вставить("ЭтоПродолжениеЗагрузки", Ложь);
	Результат.Вставить("ОпределенПоследнийЗагружаемыйОбъектМетаданных", Ложь);
	Результат.Вставить("РазличаетсяВерсияКонфигурации", Ложь);
	Результат.Вставить("РазличаетсяХешСуммаИсточника", Ложь);
	Результат.Вставить("РазличаетсяХешСуммаПараметров", Ложь);
	
	Результат.ЭтоПродолжениеЗагрузки = ИнформацияОПроцедуреЗагрузки <> Неопределено;
	
	Если Результат.ЭтоПродолжениеЗагрузки Тогда
		
		Результат.ОпределенПоследнийЗагружаемыйОбъектМетаданных
			= РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ЕстьОбрабатываемыеОбъектыМетаданных();
		Результат.РазличаетсяВерсияКонфигурации = ИнформацияОПроцедуреЗагрузки.Конфигурация <> Метаданные.Имя 
			Или ИнформацияОПроцедуреЗагрузки.ВерсияКонфигурации <> Метаданные.Версия;
		Результат.РазличаетсяХешСуммаИсточника
			= ИнформацияОПроцедуреЗагрузки.ХешСуммаИсточника <> ХешСуммаИсточника;
		Результат.РазличаетсяХешСуммаПараметров
			= ИнформацияОПроцедуреЗагрузки.ХешСуммаПараметров <> ХешСуммаПараметров;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗафиксироватьНачалоПроцедурыЗагрузки(ХешСуммаИсточника, ХешСуммаПараметров, ИдентификаторСостояния)
		
	ИнформацияОПроцедуреЗагрузки = Новый Структура();
	ИнформацияОПроцедуреЗагрузки.Вставить("ДатаНачала", ТекущаяДатаСеанса());
	ИнформацияОПроцедуреЗагрузки.Вставить("Конфигурация", Метаданные.Имя);
	ИнформацияОПроцедуреЗагрузки.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	ИнформацияОПроцедуреЗагрузки.Вставить("ХешСуммаИсточника", ХешСуммаИсточника);
	ИнформацияОПроцедуреЗагрузки.Вставить("ХешСуммаПараметров", ХешСуммаПараметров);
	ИнформацияОПроцедуреЗагрузки.Вставить("СоответствиеСсылок", Неопределено);
	ИнформацияОПроцедуреЗагрузки.Вставить("ИдентификаторСостояния", ИдентификаторСостояния);
		
	ЗаписатьИнформациюОПроцедуреЗагрузки(ИнформацияОПроцедуреЗагрузки);
	
КонецПроцедуры

Функция ИнформацияОПроцедуреЗагрузки() 
	Возврат Константы.ИнформацияОПроцедуреЗагрузки.Получить().Получить();
КонецФункции

Процедура ЗаписатьИнформациюОПроцедуреЗагрузки(Значение)
	Константы.ИнформацияОПроцедуреЗагрузки.Установить(
		Новый ХранилищеЗначения(Значение));
КонецПроцедуры

Процедура ЗафиксироватьЗавершениеПроцедурыЗагрузки()
	ЗаписатьИнформациюОПроцедуреЗагрузки(Неопределено);
КонецПроцедуры

Функция НачатьПроцедуруЗагрузки(ПараметрыЗагрузки, Контейнер, Обработчики)
	
	Если Контейнер.ФиксироватьСостояние() И ЭтоДифференциальнаяРезервнаяКопия(ПараметрыЗагрузки) Тогда
		
		ИдентификаторСостояния = ИдентификаторСостояния(ПараметрыЗагрузки);
		
		СостояниеЗагрузки = СостояниеВыгрузкиЗагрузкиОбластиДанных(ИдентификаторСостояния);
	
		Если ЗначениеЗаполнено(СостояниеЗагрузки) Тогда
			Контейнер.УстановитьДатуНачала(
				СостояниеЗагрузки.ДатаНачала);	
			Контейнер.УстановитьКоличествоОбработанныхОбъектов(
				СостояниеЗагрузки.ОбработаноОбъектов);	
		Иначе
			ЗаписатьСобытиеОтсутствияЗаписиПредыдущегоСостояния(
				ИдентификаторСостояния);
		КонецЕсли;
		
	КонецЕсли;
			
	ИнформацияОВыгрузке = ПрочитатьИнформациюОВыгрузке(Контейнер);
	СтрогаяПроверка = ТипРезервнойКопии(ПараметрыЗагрузки) <> ТипРезервнойКопииПолная();
	
	ПроверитьВыгрузкаВАрхивеСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке);
	ПроверитьВыгрузкаВАрхивеСовместимаСТекущейВерсиейКонфигурации(ИнформацияОВыгрузке, СтрогаяПроверка);
	
	ЗафиксироватьНачалоПроцедурыЗагрузки(
		ПараметрыЗагрузки.ХешСуммаИсточника,
		ПараметрыЗагрузки.ХешСуммаПараметров,
		ИдентификаторСостояния(ПараметрыЗагрузки));
					
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Истина, Ложь);
	КонецЕсли;
	
	Обработчики.ПередЗагрузкойДанных(Контейнер);
				
	СоответствиеСсылок = Неопределено;
	ПараметрыЗагрузки.Свойство("СоответствиеСсылок", СоответствиеСсылок);
				
	Возврат ЗагрузитьДанныеИнформационнойБазы(
		ПараметрыЗагрузки,
		Контейнер,
		Обработчики,
		СоответствиеСсылок);

КонецФункции
	
Функция ПродолжитьПроцедуруЗагрузки(ПараметрыЗагрузки, Контейнер, Обработчики)
	
	ИнформацияОПроцедуреЗагрузки = ИнформацияОПроцедуреЗагрузки();
	ВыборкаОбъектов = РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ВыборкаОбъектовКОбработке(Истина);
	ЗагружаемыеОбъектыМетаданных = Новый Массив();
	
	Пока ВыборкаОбъектов.Следующий() Цикл
		ЗагружаемыеОбъектыМетаданных.Добавить(ВыборкаОбъектов.ОбъектМетаданных);
	КонецЦикла;
	
	СобытиеЖурналаРегистрации = НСтр(
		"ru = 'Выгрузка загрузка данных. Продолжение процедуры загрузки'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Процедура загрузки продолжена с объектов метаданных: %1'"),
			СтрСоединить(ЗагружаемыеОбъектыМетаданных, ", "));
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации,
		УровеньЖурналаРегистрации.Предупреждение,,, 
		ТекстПредупреждения);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Истина, Ложь);
	КонецЕсли;
	
	ВыборкаОбъектов.Сбросить();

	Пока ВыборкаОбъектов.Следующий() Цикл
		
		РаботаВМоделиСервиса.ОчиститьДанныеОбъектаМетаданных(
			ВыборкаОбъектов.ОбъектМетаданных,
			Метаданные.НайтиПоПолномуИмени(ВыборкаОбъектов.ОбъектМетаданных));
		
		РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ЗафиксироватьОкончаниеОбработкиОбъекта(
			ВыборкаОбъектов);
		
	КонецЦикла;
		
	Если Контейнер.ФиксироватьСостояние() Тогда
		
		ИдентификаторСостоянияПроцедурыЗагрузки = ИнформацияОПроцедуреЗагрузки.ИдентификаторСостояния;
		
		Если ЗначениеЗаполнено(ИдентификаторСостоянияПроцедурыЗагрузки) Тогда
			
			СостояниеЗагрузки = СостояниеВыгрузкиЗагрузкиОбластиДанных(ИдентификаторСостоянияПроцедурыЗагрузки);
			
			Если ЗначениеЗаполнено(СостояниеЗагрузки) Тогда
				Контейнер.УстановитьДатуНачала(
					СостояниеЗагрузки.ДатаНачала);	
				Контейнер.УстановитьКоличествоОбработанныхОбъектов(
					СостояниеЗагрузки.ОбработаноОбъектовДоТекущегоОбъектаМетаданных);	
			Иначе
				ЗаписатьСобытиеОтсутствияЗаписиПредыдущегоСостояния(
					ИдентификаторСостоянияПроцедурыЗагрузки);
			КонецЕсли;
			
			ИдентификаторСостоянияПараметровЗагрузки = ИдентификаторСостояния(ПараметрыЗагрузки);
			Если ИдентификаторСостоянияПроцедурыЗагрузки <> ИдентификаторСостоянияПараметровЗагрузки Тогда
				ИнформацияОПроцедуреЗагрузки.ИдентификаторСостояния = ИдентификаторСостоянияПараметровЗагрузки;
				ЗаписатьИнформациюОПроцедуреЗагрузки(ИнформацияОПроцедуреЗагрузки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗагрузитьДанныеИнформационнойБазы(
		ПараметрыЗагрузки,
		Контейнер,
		Обработчики,
		ИнформацияОПроцедуреЗагрузки.СоответствиеСсылок);
	
КонецФункции

Функция ЗагрузитьДанныеИнформационнойБазы(
	ПараметрыЗагрузки,
	Контейнер,
	Обработчики,
	СоответствиеСсылок = Неопределено)
		
	ПотокЗаменыСсылок = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы.ЗагрузитьДанныеИнформационнойБазы(
		Контейнер,
		Обработчики,
		СоответствиеСсылок);
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		РаботаВМоделиСервиса.УдалитьПользователейОбласти(Истина);
	КонецЕсли;
		
	ПослеЗагрузкиДанныхИнформационнойБазы(
		ПараметрыЗагрузки,
		Контейнер,
		Обработчики,
		ПотокЗаменыСсылок);
	
	Возврат ПотокЗаменыСсылок.СоответствиеСсылок();
	
КонецФункции

Процедура ПослеЗагрузкиДанныхИнформационнойБазы(ПараметрыЗагрузки, Контейнер, Обработчики, ПотокЗаменыСсылок)
	
	СопоставлениеПользователей = Неопределено;
	Если ПараметрыЗагрузки.ЗагружатьПользователей Тогда
		
		ВыгрузкаЗагрузкаПользователейИнформационнойБазы.ЗагрузитьПользователейИнформационнойБазы(Контейнер);
		
		Если ПараметрыЗагрузки.ЗагружатьНастройкиПользователей Тогда
			
			Обработки.ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей.ЗагрузитьНастройкиПользователейИнформационнойБазы(
				Контейнер, Обработчики, ПотокЗаменыСсылок);
			
		КонецЕсли;
		
	ИначеЕсли ПараметрыЗагрузки.Свойство("СопоставлениеПользователей", СопоставлениеПользователей)
		И ПараметрыЗагрузки.ТребуетсяСопоставлениеПользователей	 Тогда
		
		// Очистить идентификаторы, если они используются.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Пользователи", СопоставлениеПользователей.ВыгрузитьКолонку("Пользователь"));
		Запрос.УстановитьПараметр("Идентификаторы", СопоставлениеПользователей.ВыгрузитьКолонку("ИдентификаторПользователяСервиса"));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Ссылка В (&Пользователи)
		|	И Пользователи.ИдентификаторПользователяСервиса В(&Идентификаторы)";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ПользовательОбъект = Выборка.Пользователь.ПолучитьОбъект(); // СправочникОбъект.Пользователи
			ПользовательОбъект.ИдентификаторПользователяСервиса = Неопределено;
			ПользовательОбъект.ОбменДанными.Загрузка = Истина;
			ПользовательОбъект.Записать();
		КонецЦикла;
		
		// Обновить идентификаторы для используемых пользователей.
		Для Каждого СопоставлениеПользователя Из СопоставлениеПользователей Цикл
			Если Не ЗначениеЗаполнено(СопоставлениеПользователя.Пользователь) Тогда
				Продолжить;
			КонецЕсли;
			ПользовательОбъект = СопоставлениеПользователя.Пользователь.ПолучитьОбъект(); // СправочникОбъект.Пользователи
			Если ПользовательОбъект.ИдентификаторПользователяСервиса <> СопоставлениеПользователя.ИдентификаторПользователяСервиса Тогда
				ПользовательОбъект.ИдентификаторПользователяСервиса = СопоставлениеПользователя.ИдентификаторПользователяСервиса;
				ПользовательОбъект.ОбменДанными.Загрузка = Истина;
				ПользовательОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		
		// Загрузить настройки с заменой имени пользователя ИБ.
		ЗаменитьПользователяВНастройках = Новый Соответствие;
		Для Каждого СопоставлениеПользователя Из СопоставлениеПользователей Цикл
			Если ЗначениеЗаполнено(СопоставлениеПользователя.СтароеИмяПользователяИБ) 
				И ЗначениеЗаполнено(СопоставлениеПользователя.НовоеИмяПользователяИБ) Тогда
				ЗаменитьПользователяВНастройках.Вставить(СопоставлениеПользователя.СтароеИмяПользователяИБ, СопоставлениеПользователя.НовоеИмяПользователяИБ);
			КонецЕсли;
		КонецЦикла;
		Обработки.ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиНастроекПользователей.ЗагрузитьНастройкиПользователейИнформационнойБазы(
			Контейнер, Обработчики, ПотокЗаменыСсылок, ЗаменитьПользователяВНастройках);
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Истина);
	КонецЕсли;
	
	Если ПараметрыЗагрузки.ВидПриложения <> Неопределено Тогда
		ВидыПриложенийСлужебный.УстановитьВидПриложенияПоСообщению(ПараметрыЗагрузки.ВидПриложения);
	КонецЕсли;
	
	ПараметрыБлокировки = ПослеЗагрузкиДанныхВСервисеДоОбработчиковПослеЗагрузкиДанных(Контейнер);
	
	Обработчики.ПослеЗагрузкиДанных(Контейнер);
	
	ПослеЗагрузкиДанныхВСервисеПослеОбработчиковПослеЗагрузкиДанных(ПараметрыБлокировки);

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ОтключитьОбновлениеКлючейДоступа(Ложь);
	КонецЕсли;
	
	Контейнер.ФинализироватьЗагрузку();	
	
	ЗафиксироватьЗавершениеПроцедурыЗагрузки();
	
КонецПроцедуры

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  см. СоединенияИБ.НовыеПараметрыБлокировкиСоединений
Функция ПослеЗагрузкиДанныхВСервисеДоОбработчиковПослеЗагрузкиДанных(Контейнер)
	
	Возврат СоединенияИБ.НовыеПараметрыБлокировкиСоединений();
	
КонецФункции

// Параметры:
//  ПараметрыБлокировки - см. СоединенияИБ.НовыеПараметрыБлокировкиСоединений
Процедура ПослеЗагрузкиДанныхВСервисеПослеОбработчиковПослеЗагрузкиДанных(ПараметрыБлокировки)
	
	Возврат;
	
КонецПроцедуры

// Записывает описание конфигурации
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//
Процедура СохранитьОписаниеВыгрузки(Знач Контейнер)
	
	ТипDumpInfo = ФабрикаXDTO.Тип("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "DumpInfo");
	ТипConfigurationInfo = ФабрикаXDTO.Тип("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "ConfigurationInfo");
	
	ИнформацияОВыгрузке = ФабрикаXDTO.Создать(ТипDumpInfo);
	ИнформацияОВыгрузке.Created = ТекущаяУниверсальнаяДата();
	
	ИнформацияОКонфигурации = ФабрикаXDTO.Создать(ТипConfigurationInfo);
	ИнформацияОКонфигурации.Name = ВидыПриложенийСервер.ИмяТекущегоВидаПриложения();
	ИнформацияОКонфигурации.Version = Метаданные.Версия;
	ИнформацияОКонфигурации.Vendor = Метаданные.Поставщик;
	ИнформацияОКонфигурации.Presentation = ВидыПриложенийСервер.ПредставлениеТекущегоВидаПриложения();
	
	ИнформацияОВыгрузке.Configuration = ИнформацияОКонфигурации;
	
	ИмяФайла = Контейнер.СоздатьФайл(DumpInfo(), CustomData());
	ЗаписатьОбъектXDTOВФайл(ИнформацияОВыгрузке, ИмяФайла);
	Контейнер.ФайлЗаписан(ИмяФайла);
	
КонецПроцедуры

// Читает описание конфигурации
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//
Функция ПрочитатьИнформациюОВыгрузке(Контейнер)
	
	Файл = Контейнер.ПолучитьФайлИзКаталога(DumpInfo());
	
	Если Файл = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'В информации о составе файлов выгрузки отсутствует описание файла с информацией о выгрузке'");
	КонецЕсли;
	
	Контейнер.РаспаковатьФайл(Файл);
	
	Результат =  ПрочитатьОбъектXDTOИзФайла(
		Файл.ПолноеИмя, ФабрикаXDTO.Тип("http://www.1c.ru/1cFresh/Data/Dump/1.0.2.1", "DumpInfo"));
	
	УдалитьФайлы(Файл.ПолноеИмя);
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя элемента в потоке записи/чтения, в котором хранится XDTOОбъект.
//
// Возвращаемое значение:
//	Строка - имя элемента.
//
Функция ИмяЭлементаСодержащегоXDTOОбъект()
	
	Возврат "XDTODataObject";
	
КонецФункции

// Возвращает имя элемента в потоке записи/чтения, в котором хранится объект.
//
// Возвращаемое значение:
//	Строка - имя элемента.
//
Функция ИмяЭлементаСодержащегоОбъект()
	
	Возврат "Data";
	
КонецФункции

// Возвращает массив пространства имен для записи пакетов.
//
// Параметры:
//	URIПространстваИмен - Строка - пространство имен.
//
// Возвращаемое значение:
//	Массив из Строка - массив пространств имен.
//
Функция ПолучитьПространстваИменДляЗаписиПакета(Знач URIПространстваИмен)
	
	Результат = Новый Массив();
	Результат.Добавить(URIПространстваИмен);
	
	Зависимости = ФабрикаXDTO.Пакеты.Получить(URIПространстваИмен).Зависимости;
	Для Каждого Зависимость Из Зависимости Цикл
		ЗависимыеПространстваИмен = ПолучитьПространстваИменДляЗаписиПакета(Зависимость.URIПространстваИмен);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ЗависимыеПространстваИмен, Истина);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Заполняет массив коллекцией метаданных ссылочных объектов.
//
// Параметры:
//	МассивКоллекцийМетаданных - Массив из ОбъектМетаданных - объекты метаданных.
//
Процедура ЗаполнитьКоллекцииСсылочныхОбъектов(МассивКоллекцийМетаданных)

	МассивКоллекцийМетаданных.Добавить(Метаданные.Справочники);
	МассивКоллекцийМетаданных.Добавить(Метаданные.Документы);
	МассивКоллекцийМетаданных.Добавить(Метаданные.БизнесПроцессы);
	МассивКоллекцийМетаданных.Добавить(Метаданные.Задачи);
	МассивКоллекцийМетаданных.Добавить(Метаданные.ПланыСчетов);
	МассивКоллекцийМетаданных.Добавить(Метаданные.ПланыОбмена);
	МассивКоллекцийМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	МассивКоллекцийМетаданных.Добавить(Метаданные.ПланыВидовРасчета);
	
КонецПроцедуры

// Заполняет массив коллекцией метаданных наборов записей.
//
// Параметры:
//	МассивКоллекцийМетаданных - Массив из КоллекцияОбъектовМетаданных - массив.
//
Процедура ЗаполнитьКоллекцииНаборовЗаписей(МассивКоллекцийМетаданных)
	
	МассивКоллекцийМетаданных.Добавить(Метаданные.РегистрыСведений);
	МассивКоллекцийМетаданных.Добавить(Метаданные.РегистрыНакопления);
	МассивКоллекцийМетаданных.Добавить(Метаданные.РегистрыБухгалтерии);
	МассивКоллекцийМетаданных.Добавить(Метаданные.Последовательности);
	МассивКоллекцийМетаданных.Добавить(Метаданные.РегистрыРасчета);
	Для Каждого РегистрРасчета Из Метаданные.РегистрыРасчета Цикл
		МассивКоллекцийМетаданных.Добавить(РегистрРасчета.Перерасчеты);
	КонецЦикла;
	
КонецПроцедуры

// Заполняет массив коллекцией метаданных констант.
//
// Параметры:
//	МассивКоллекцийМетаданных - Массив из КоллекцияОбъектовМетаданных - массив.
//
Процедура ЗаполнитьКоллекцииКонстант(МассивКоллекцийМетаданных)
	
	МассивКоллекцийМетаданных.Добавить(Метаданные.Константы);
	
КонецПроцедуры

// Возвращает полный список объектов из указанных коллекций
//
// Параметры:
//  Коллекции - Массив из КоллекцияОбъектовМетаданных - Коллекции.
//
// Возвращаемое значение:
//  Массив из ОбъектМетаданных - Объекты метаданных.
//
Функция ВсеМетаданныеКоллекций(Знач Коллекции)
	
	Результат = Новый Массив;
	Для Каждого Коллекция Из Коллекции Цикл
		
		Для Каждого Объект Из Коллекция Цикл
			Результат.Добавить(Объект);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылки точек бизнес процесса
//
// Возвращаемое значение:
//	Соответствие из КлючИЗначение:
//	  *Ключ - Тип - тип ссылки точки бизнес процесса.
//	  *Значение - ОбъектМетаданных - бизнес процесс.
//
Функция СсылкиТочекМаршрутаБизнесПроцессов()
	
	Результат = Новый Соответствие();
	
	Для Каждого БизнесПроцесс Из Метаданные.БизнесПроцессы Цикл
		
		Результат.Вставить(Тип("ТочкаМаршрутаБизнесПроцессаСсылка." + БизнесПроцесс.Имя), БизнесПроцесс);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает наименование файла с дайджестом выгрузки.
//
// Возвращаемое значение:
//	Строка - наименование
Функция Digest() Экспорт
	Возврат "Digest";
КонецФункции

// Возвращает наименование файла с предупреждениями выгрузки.
//
// Возвращаемое значение:
//	Строка - наименование
Функция DumpWarnings() Экспорт
	Возврат "DumpWarnings";
КонецФункции

// Extensions
// 
// Возвращаемое значение:
//  Строка
Функция Extensions() Экспорт
	Возврат "Extensions";
КонецФункции

// Custom extensions
// 
// Возвращаемое значение:
//  Строка
Функция CustomExtensions() Экспорт 
	Возврат "CustomExtensions";	
КонецФункции

// Возвращает наименование файла с видами приложения.
// 
// Возвращаемое значение:
//  Строка
Функция ApplicationTypes() Экспорт 
	Возврат "ApplicationTypes";
КонецФункции

// Возвращает наименование файла с дублями предопределенных.
//
// Возвращаемое значение:
//	Строка - наименование
Функция PredefinedDataDuplicates() Экспорт
	Возврат "PredefinedDataDuplicates";
КонецФункции

// Записывает ОбъектXDTO в файл.
//
// Параметры:
//	ОбъектXDTO - ОбъектXDTO - записываемый ОбъектXDTO.
//	ИмяФайла - Строка - полный путь к файлу.
//	ПрефиксПространстваИменПоУмолчанию - Строка - префикс.
//
Процедура ЗаписатьОбъектXDTOВФайл(Знач ОбъектXDTO, Знач ИмяФайла, Знач ПрефиксПространстваИменПоУмолчанию = "")
	
	ПотокЗаписи = Новый ЗаписьXML();
	ПотокЗаписи.ОткрытьФайл(ИмяФайла);
	
	ПрефиксыПространствИмен = ПрефиксыПространствИмен();
	ПространствоИменОбъекта = ОбъектXDTO.Тип().URIПространстваИмен;
	Если ПустаяСтрока(ПрефиксПространстваИменПоУмолчанию) Тогда
		ПрефиксПространстваИменПоУмолчанию = ПрефиксыПространствИмен.Получить(ПространствоИменОбъекта);
	КонецЕсли;
	ИспользуемыеПространстваИмен = ПолучитьПространстваИменДляЗаписиПакета(ПространствоИменОбъекта);
	
	ПотокЗаписи.ЗаписатьНачалоЭлемента(ИмяЭлементаСодержащегоXDTOОбъект());
	
	Для Каждого ИспользуемоеПространствоИмен Из ИспользуемыеПространстваИмен Цикл
		ПрефиксПространстваИмен = ПрефиксыПространствИмен.Получить(ИспользуемоеПространствоИмен);
		Если ПрефиксПространстваИмен = ПрефиксПространстваИменПоУмолчанию Тогда
			ПотокЗаписи.ЗаписатьСоответствиеПространстваИмен("", ИспользуемоеПространствоИмен);
		Иначе
			ПотокЗаписи.ЗаписатьСоответствиеПространстваИмен(ПрефиксПространстваИмен, ИспользуемоеПространствоИмен);
		КонецЕсли;
	КонецЦикла;
	
	ФабрикаXDTO.ЗаписатьXML(ПотокЗаписи, ОбъектXDTO);
	
	ПотокЗаписи.ЗаписатьКонецЭлемента();
	
	ПотокЗаписи.Закрыть();
	
КонецПроцедуры

Функция СхемаXML(ДвоичныеДанныеСхемы)
	
	ПотокДляЧтения = ДвоичныеДанныеСхемы.ОткрытьПотокДляЧтения();
	
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьПоток(ПотокДляЧтения);
	
	Построитель = Новый ПостроительDOM;
	Документ = Построитель.Прочитать(Чтение); // ЭлементDOM
	
	ПотокДляЧтения.Закрыть();
	
	ПостроительСхем = Новый ПостроительСхемXML;	
	
	Возврат ПостроительСхем.СоздатьСхемуXML(Документ);

КонецФункции

Функция ФабрикаПоСхеме(Схема)
	
	НаборСхем = Новый НаборСхемXML;
	НаборСхем.Добавить(Схема);
	
	Возврат Новый ФабрикаXDTO(НаборСхем);

КонецФункции

Процедура ВыгрузитьСхемуКонфигурации(Контейнер, ПараметрыВыгрузки)
	
	ДанныеСхемыКонфигурации = Неопределено;
	Если Не ПараметрыВыгрузки.Свойство("ДанныеСхемыКонфигурации", ДанныеСхемыКонфигурации) Тогда
		ДанныеСхемыКонфигурации = СхемаКонфигурации.ДвоичныеДанныеСхемы(Ложь, Ложь);	
	КонецЕсли;
	
	ПолноеИмяФайла = Контейнер.СоздатьПроизвольныйФайл("xsd", "ConfigScheme");
	ДанныеСхемыКонфигурации.Записать(ПолноеИмяФайла);
	
	Контейнер.УстановитьКоличествоОбъектов(ПолноеИмяФайла, 1);
	
КонецПроцедуры

Процедура ВосстановитьРасширения(РасширенияДляВосстановления)

	СтруктураОтбора = Новый Структура("Имя");

	Для Каждого РасширениеДляВосстановления Из РасширенияДляВосстановления Цикл

		СтруктураОтбора.Имя = РасширениеДляВосстановления.Имя;

		ДанныеВосстанавливаемогоРасширения = РасширениеДляВосстановления.Данные;

		УстановленныеРасширения = РасширенияКонфигурации.Получить(СтруктураОтбора,
			ИсточникРасширенийКонфигурации.БазаДанных);

		Если ЗначениеЗаполнено(УстановленныеРасширения) Тогда

			УстановленноеРасширение = УстановленныеРасширения[0];

			Если УстановленноеРасширение.Активно = РасширениеДляВосстановления.Активно
				И УстановленноеРасширение.БезопасныйРежим = РасширениеДляВосстановления.БезопасныйРежим
				И УстановленноеРасширение.ИспользоватьОсновныеРолиДляВсехПользователей = РасширениеДляВосстановления.ИспользоватьОсновныеРолиДляВсехПользователей
				И УстановленноеРасширение.ИспользуетсяВРаспределеннойИнформационнойБазе = РасширениеДляВосстановления.ИспользуетсяВРаспределеннойИнформационнойБазе
				И УстановленноеРасширение.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = РасширениеДляВосстановления.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях Тогда			
					
				Если УстановленноеРасширение.УникальныйИдентификатор = РасширениеДляВосстановления.УникальныйИдентификатор Тогда
					Продолжить;
				КонецЕсли;
												
				МетаданныеУстановленногоРасширения = Новый ОбъектМетаданныхКонфигурация(УстановленноеРасширение.ПолучитьДанные());
				МетаданныеВосстанавливаемогоРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеВосстанавливаемогоРасширения);

				Если МетаданныеУстановленногоРасширения.Версия = МетаданныеВосстанавливаемогоРасширения.Версия Тогда									
					Продолжить;
				КонецЕсли;

			КонецЕсли;
			
			УстановленноеРасширение.Удалить();

		КонецЕсли;

		ВосстанавливаемоеРасширение = РасширенияКонфигурации.Создать();
		ЗаполнитьЗначенияСвойств(ВосстанавливаемоеРасширение, РасширениеДляВосстановления);
		ВосстанавливаемоеРасширение.Записать(ДанныеВосстанавливаемогоРасширения);
			
	КонецЦикла;

КонецПроцедуры

Процедура ВосстановитьКаркасыРасширений(РасширенияДляВосстановления)

	СтруктураОтбора = Новый Структура("Имя");

	Для Каждого РасширениеДляВосстановления Из РасширенияДляВосстановления Цикл

		ДанныеВосстанавливаемогоРасширения = РасширениеДляВосстановления.Данные;
		МетаданныеВосстанавливаемогоРасширения = Новый ОбъектМетаданныхКонфигурация(ДанныеВосстанавливаемогоРасширения);
		
		СтруктураОтбора.Имя = МетаданныеВосстанавливаемогоРасширения.Имя;	

		УстановленныеРасширения = РасширенияКонфигурации.Получить(СтруктураОтбора,
			ИсточникРасширенийКонфигурации.БазаДанных);	
		
		Если ЗначениеЗаполнено(УстановленныеРасширения) Тогда

			УстановленноеРасширение = УстановленныеРасширения[0];

			МетаданныеУстановленногоРасширения = Новый ОбъектМетаданныхКонфигурация(УстановленноеРасширение.ПолучитьДанные());

			Если МетаданныеУстановленногоРасширения.Версия = МетаданныеВосстанавливаемогоРасширения.Версия Тогда
				Продолжить;
			КонецЕсли;
			
			УстановленноеРасширение.Удалить();

		КонецЕсли;

		ВосстанавливаемоеРасширение = РасширенияКонфигурации.Создать();
		ВосстанавливаемоеРасширение.БезопасныйРежим = Ложь;
		
		ЗащитаОтОпасныхДействий = Новый ОписаниеЗащитыОтОпасныхДействий;
		ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
		ВосстанавливаемоеРасширение.ЗащитаОтОпасныхДействий = ЗащитаОтОпасныхДействий;
		
		ВосстанавливаемоеРасширение.Записать(ДанныеВосстанавливаемогоРасширения);
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКонстантуВСписокМетаданных(МетаданныеОбъекта, СписокМетаданных, Типы)
	
	Для Каждого Тип Из Типы Цикл
		
		Если МетаданныеОбъекта.Тип.СодержитТип(Тип) Тогда 
			СписокМетаданных.Вставить(МетаданныеОбъекта.ПолноеИмя(), Новый Массив);		
			Возврат;
		КонецЕсли;

	КонецЦикла;
		
КонецПроцедуры

Процедура ДобавитьСсылочныйТипВСписокМетаданных(МетаданныеОбъекта, СписокМетаданных, Типы)
	
	МассивСтруктур = Новый Массив;
	
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл 
		
		ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Реквизит);
		
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл 
		
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			
			ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Реквизит, ТабличнаяЧасть);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВставитьОбъектМетаданныхВСоответствие(МетаданныеОбъекта.ПолноеИмя(), СписокМетаданных, МассивСтруктур);
	
КонецПроцедуры

Процедура ДобавитьРегистрВТаблицуМетаданных(МетаданныеОбъекта, Знач СписокМетаданных, Типы)
	
	МассивСтруктур = Новый Массив;
	ЭтоПерерасчет = Метаданные.РегистрыРасчета.Содержит(МетаданныеОбъекта.Родитель());
	
	Для Каждого Измерение Из МетаданныеОбъекта.Измерения Цикл 
		
		Если ЭтоПерерасчет Тогда
			Измерение = Измерение.ИзмерениеРегистра;
		КонецЕсли;
		
		ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Измерение);
		
	КонецЦикла;
		
	Если Метаданные.Последовательности.Содержит(МетаданныеОбъекта) Тогда 
		
		Для Каждого ДокументМетаданные Из МетаданныеОбъекта.Документы Цикл
			
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
				ДокументМетаданные.ПолноеИмя());
			ТипДокумента = ТипЗнч(МенеджерДокумента.ПустаяСсылка());
			
			Если Типы.Найти(ТипДокумента) <> Неопределено Тогда 
				
				Структура = СтруктураРеквизитов();
				Структура.ИмяРеквизита = "Регистратор";
				
				МассивСтруктур.Добавить(Структура);
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Не ЭтоПерерасчет Тогда
		
		Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл 
			ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Реквизит);
		КонецЦикла;
		
		Для Каждого Ресурс Из МетаданныеОбъекта.Ресурсы Цикл 
			ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Ресурс);
		КонецЦикла;
		
		Если Не ОбщегоНазначенияБТС.ЭтоНезависимыйНаборЗаписей(МетаданныеОбъекта) Тогда
			ДобавитьРеквизитВМассив(МассивСтруктур, Типы, МетаданныеОбъекта.СтандартныеРеквизиты.Регистратор);
		КонецЕсли;
		
		Если ОбщегоНазначенияБТС.ЭтоРегистрБухгалтерии(МетаданныеОбъекта)
			И МетаданныеОбъекта.ПланСчетов <> Неопределено Тогда
			
			МенеджерПланаСчетов = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
				МетаданныеОбъекта.ПланСчетов.ПолноеИмя());
			ТипПланаСчетов = ТипЗнч(МенеджерПланаСчетов.ПустаяСсылка());
			
			Если Типы.Найти(ТипПланаСчетов) <> Неопределено Тогда 
				
				Если МетаданныеОбъекта.Корреспонденция Тогда 
					Структура = СтруктураРеквизитов();
					Структура.ИмяРеквизита = "СчетДт";		
					МассивСтруктур.Добавить(Структура);
					
					Структура = СтруктураРеквизитов();
					Структура.ИмяРеквизита = "СчетКт";		
					МассивСтруктур.Добавить(Структура);
				Иначе		
					Структура = СтруктураРеквизитов();
					Структура.ИмяРеквизита = "Счет";		
					МассивСтруктур.Добавить(Структура);
				КонецЕсли;
				
			КонецЕсли;
	
		КонецЕсли;
				
	КонецЕсли;
	
	ВставитьОбъектМетаданныхВСоответствие(МетаданныеОбъекта.ПолноеИмя(), СписокМетаданных, МассивСтруктур);
	
КонецПроцедуры

Процедура ДобавитьРеквизитВМассив(МассивСтруктур, Типы, Реквизит, ТабличнаяЧасть = Неопределено)
	
	Для Каждого Тип Из Типы Цикл
		
		Если Реквизит.Тип.СодержитТип(Тип) Тогда
			 
			ИмяРеквизита = Реквизит.Имя;
			ИмяТабличнойЧасти = ?(ТабличнаяЧасть = Неопределено, Неопределено, ТабличнаяЧасть.Имя);
			
			Структура = СтруктураРеквизитов();
			Структура.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
			Структура.ИмяРеквизита = ИмяРеквизита;
			
			МассивСтруктур.Добавить(Структура);
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВставитьОбъектМетаданныхВСоответствие(ПолноеИмяМетаданных, СписокМетаданных, МассивСтруктур)
	
	Если МассивСтруктур.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СписокМетаданных.Вставить(ПолноеИмяМетаданных, МассивСтруктур);
	
КонецПроцедуры

// Возвращаемое значение:
// 	Структура:
// * ИмяРеквизита - Строка
// * ИмяТабличнойЧасти - Строка
// 
Функция СтруктураРеквизитов()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяТабличнойЧасти");
	Результат.Вставить("ИмяРеквизита");
	
	Возврат Результат;
	
КонецФункции

// Возвращает тип резервной копии в зависимости от параметров загрузки.
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры
//
// Возвращаемое значение:
//  Строка - одно из значений: Обычная, Полная, Дифференциальная
Функция ТипРезервнойКопии(ПараметрыЗагрузки) 

	Если ПараметрыЗагрузки.Свойство("ТипРезервнойКопии") Тогда
		Возврат ПараметрыЗагрузки.ТипРезервнойКопии;
	КонецЕсли;
		
	Возврат ТипРезервнойКопииОбычная();
  
КонецФункции

Функция ИдентификаторСостояния(ПараметрыЗагрузки)
	
	Если Не ЗначениеЗаполнено(ПараметрыЗагрузки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдентификаторСостояния = Неопределено;
	ПараметрыЗагрузки.Свойство("ИдентификаторСостояния", ИдентификаторСостояния);
	
	Возврат ИдентификаторСостояния;
	
КонецФункции

Процедура ЗаписатьСобытиеОтсутствияЗаписиПредыдущегоСостояния(ИдентификаторСостояния)
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Выгрузка загрузка данных. Не найдена запись предыдущего состояния'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Предупреждение,,
		ИдентификаторСостояния,
		НСтр("ru = 'Восстановление состояния пропущено'"));
		
КонецПроцедуры

Функция ХешСуммаИсточника(Архив)
	
	ИмяФайлаСодержимого = ПолучитьИмяФайла(PackageContents());
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ВременныйКаталог);
	
	РаспаковатьФайлАрхива(Архив, ВременныйКаталог, ИмяФайлаСодержимого);

	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.ДобавитьФайл(
		ВременныйКаталог + ПолучитьРазделительПути() + ИмяФайлаСодержимого);
	
	УдалитьФайлы(ВременныйКаталог);
	
	Возврат ХешированиеДанных.ХешСумма;

КонецФункции

Функция ХешСуммаПараметров(ПараметрыЗагрузки)
	
	КонтролируемыеПараметрыЗагрузки = Новый Структура(
		"ЗагружатьНастройкиПользователей, ЗагружатьПользователей, СвернутьРазделенныхПользователей");
	ЗаполнитьЗначенияСвойств(КонтролируемыеПараметрыЗагрузки, ПараметрыЗагрузки);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.CRC32);
	ХешированиеДанных.Добавить(
		ОбщегоНазначения.ЗначениеВСтрокуXML(КонтролируемыеПараметрыЗагрузки));
	
	Возврат ХешированиеДанных.ХешСумма;
	
КонецФункции

Функция НоваяТаблицаКоличестваОбрабатываемыхОбъектов()
	ТаблицаКоличестваОбрабатываемыхОбъектов = Новый ТаблицаЗначений;
	ТаблицаКоличестваОбрабатываемыхОбъектов.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	ТаблицаКоличестваОбрабатываемыхОбъектов.Колонки.Добавить("ЧислоОбъектов", Новый ОписаниеТипов("Число"));
	Возврат ТаблицаКоличестваОбрабатываемыхОбъектов;
КонецФункции

Функция ТаблицаКоличестваВыгружаемыхОбъектовПоПодзапросам(Подзапросы)
	РазделительПодзапросов = Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС;		
	Запрос = Новый Запрос(СтрСоединить(Подзапросы, РазделительПодзапросов));
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ДополнитьТаблицуКоличестваОбрабатываемыхОбъектов(ТаблицаКоличестваОбрабатываемыхОбъектов, ТаблицаДополнения)
	Для Каждого СтрокаТаблицыДополнения Из ТаблицаДополнения Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКоличестваОбрабатываемыхОбъектов.Добавить(), СтрокаТаблицыДополнения);
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПараметрыВыгрузкиДанных(ПараметрыВыгрузки)
	
	Если Не ПроверитьНаличиеПрав() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав доступа для выгрузки данных'");
	КонецЕсли;
	
	Если Не ПараметрыВыгрузки.Свойство("ВыгружаемыеТипы") Тогда
		ПараметрыВыгрузки.Вставить("ВыгружаемыеТипы", Новый Массив());
	КонецЕсли;
	
	Если Не ПараметрыВыгрузки.Свойство("ВыгружаемыеТипыОбщихДанных") Тогда
		ПараметрыВыгрузки.Вставить("ВыгружаемыеТипыОбщихДанных", Новый Массив());
	КонецЕсли;
	
	Если Не ПараметрыВыгрузки.Свойство("ВыгружатьПользователей") Тогда
		ПараметрыВыгрузки.Вставить("ВыгружатьПользователей", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыВыгрузки.Свойство("ВыгружатьНастройкиПользователей") Тогда
		ПараметрыВыгрузки.Вставить("ВыгружатьНастройкиПользователей", Ложь);
	КонецЕсли;
	
	Если Не ПараметрыВыгрузки.Свойство("ВыгружатьЗарегистрированныеИзмененияДляУзловПланаОбмена") Тогда
		ПараметрыВыгрузки.Вставить("ВыгружатьЗарегистрированныеИзмененияДляУзловПланаОбмена", Ложь);
	КонецЕсли;
	
	ПроверитьПараметрыПараллельнойВыгрузкиЗагрузкиДанных(ПараметрыВыгрузки, Ложь);
	
	Если Не ПараметрыВыгрузки.Свойство("ПропуститьПроверкуВыгружаемыхДанных") Тогда
		
		ОшибкиВыгружаемыхДанных = ОшибкиВыгружаемыхДанных(
 			ПараметрыВыгрузки.ВыгружаемыеТипы,
 			ПараметрыВыгрузки.ВыгружаемыеТипыОбщихДанных);

		Если ЗначениеЗаполнено(ОшибкиВыгружаемыхДанных) Тогда

			ЧастиТекстаОшибки = Новый Массив;
			ЧастиТекстаОшибки.Добавить(НСтр("ru = 'Обнаруженные ошибки:'"));
			ЧастиТекстаОшибки.Добавить(Символы.ПС);

			Для Каждого ОшибкаВыгружаемыхДанных Из ОшибкиВыгружаемыхДанных Цикл
				ЧастиТекстаОшибки.Добавить("● ");
				ЧастиТекстаОшибки.Добавить(ОшибкаВыгружаемыхДанных);
				ЧастиТекстаОшибки.Добавить(Символы.ПС);
			КонецЦикла;

			ТекстОшибки = СтрСоединить(ЧастиТекстаОшибки);

			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выгрузка данных. Обнаружены ошибки в выгружаемых данных'",
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);

			Если Не ОбщегоНазначения.РазделениеВключено() Тогда
				ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Перед исправлением рекомендуется создать резервную копию информационной базы средствами СУБД.
					 |
					 |%1'"), ТекстОшибки);
			КонецЕсли;
			
			ВызватьИсключение ТекстОшибки;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	ДанныеФайла - Строка, УникальныйИдентификатор, Структура - 
//	ПараметрыЗагрузки - Структура
//
// Возвращаемое значение:
//  Структура:
//  * Предупреждения - Массив Из Строка - предупреждения пользователю по результатам загрузки.
Функция ЗагрузитьДанныеТекущейОбластиИзАрхива(ДанныеФайла, ПараметрыЗагрузки)
	
	ПропуститьВосстановлениеРасширений = ПараметрыЗагрузки.Свойство("ПропуститьВосстановлениеРасширений") 
		И ПараметрыЗагрузки.ПропуститьВосстановлениеРасширений;

	ХешСуммаИсточника = ХешСуммаИсточника(ПрочитатьАрхив(ДанныеФайла));
	ПараметрыЗагрузки.Вставить("ХешСуммаИсточника", ХешСуммаИсточника);
	
	ХешСуммаПараметров = ХешСуммаПараметров(ПараметрыЗагрузки);
	ПараметрыЗагрузки.Вставить("ХешСуммаПараметров", ХешСуммаПараметров);
	
	ВозможноПродолжениеПроцедурыЗагрузки = ВозможноПродолжениеПроцедурыЗагрузки(
		ХешСуммаИсточника,
		ХешСуммаПараметров);	
	ПараметрыЗагрузки.Вставить("ВозможноПродолжениеПроцедурыЗагрузки", ВозможноПродолжениеПроцедурыЗагрузки);
		
	Если Не (ВозможноПродолжениеПроцедурыЗагрузки Или ЭтоДифференциальнаяРезервнаяКопия(ПараметрыЗагрузки)) Тогда
		
		РаботаВМоделиСервисаСлужебный.ОчиститьДанныеОбласти(Не ПропуститьВосстановлениеРасширений, Ложь);
			
		Если Не ПропуститьВосстановлениеРасширений Тогда
			
			ДанныеРасширений = Неопределено;
			ПараметрыЗагрузки.Свойство("ДанныеРасширений", ДанныеРасширений);
			
			Если ЗначениеЗаполнено(ДанныеРасширений) Тогда
				ВосстановитьРасширенияПередЗагрузкойДанных(ДанныеРасширений);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ИспользоватьМногопоточность(ПараметрыЗагрузки) Тогда
		РаботаВМоделиСервиса.УстановитьМонопольнуюБлокировку(Истина);
	КонецЕсли;
		
	Если Не ПропуститьВосстановлениеРасширений 
		И РасширенияВМоделиСервисаСлужебный.ЕстьУстановленныеРасширенияИзменяющиеСтруктуруДанных() Тогда
		РезультатЗагрузки = ЗагрузитьДанныеТекущейОбластиИзАрхиваВФоне(ДанныеФайла, ПараметрыЗагрузки);	
	Иначе
		РезультатЗагрузки = НачатьЗагрузкуДанныхТекущейОбластиИзАрхива(ДанныеФайла, ПараметрыЗагрузки);
	КонецЕсли;
	
	Возврат РезультатЗагрузки;

КонецФункции

// Проверяет наличие права "АдминистрированиеДанных"
//
// Возвращаемое значение:
//	Булево - Истина, если имеется, Ложь - иначе.
Функция ПроверитьНаличиеПрав()
	
	Возврат ПравоДоступа("АдминистрированиеДанных", Метаданные);
	
КонецФункции

// Параметры:
// 	ТипыМоделиДанных - Массив из ОбъектМетаданных:
// 	ТипыОбщихДанных - ФиксированныйМассив из ОбъектМетаданных:
// 	
// Возвращаемое значение:
// 	Массив из Строка
Функция ОшибкиВыгружаемыхДанных(ТипыМоделиДанных, ТипыОбщихДанных)
	
	ОшибкиВыгружаемыхДанных = Новый Массив;
	
	Запрос = Новый Запрос;
	ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();

	ШаблонТекстаЗапросаПроверкаДублированияИзмерений = 
	"ВЫБРАТЬ
	|	Истина
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		&ПоляТаблицы
	|	ИЗ
	|		&ТаблицаРегистра КАК ТаблицаРегистра
	|	
	|	СГРУППИРОВАТЬ ПО
	|	&ПоляТаблицы
	|	
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(*) > 1) КАК ВложенныйЗапрос";
	
	Для Каждого ТипМоделиДанных Из ТипыМоделиДанных Цикл
		
		ПолноеИмя = ТипМоделиДанных.ПолноеИмя();

		Если ОбщегоНазначенияБТС.ЭтоРегистрСведений(ТипМоделиДанных) Тогда
			
			ПроверятьДублированиеЗаписей = ИнформационнаяБазаФайловая;
			Если Не ИнформационнаяБазаФайловая Тогда
				ПроверятьДублированиеЗаписей = ТипМоделиДанных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору
				И ТипМоделиДанных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора;  
			КонецЕсли;
			
			Если Не ПроверятьДублированиеЗаписей Тогда
				Продолжить;
			КонецЕсли;
						
			Измерения = Новый Массив;
			
			Если ТипМоделиДанных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
				
				Измерения.Добавить("ТаблицаРегистра.Период");
				
				Если ТипМоделиДанных.ПериодичностьРегистраСведений = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора Тогда
					Измерения.Добавить("ТаблицаРегистра.Регистратор");				
				КонецЕсли;
				
			КонецЕсли;
			
			Для Каждого МетаданныеИзмерения Из ТипМоделиДанных.Измерения Цикл
				Измерения.Добавить("ТаблицаРегистра" + "." + МетаданныеИзмерения.Имя);
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(Измерения) Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(ШаблонТекстаЗапросаПроверкаДублированияИзмерений, "&ТаблицаРегистра", ПолноеИмя);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПоляТаблицы", СтрСоединить(Измерения, ", "));
			
			Если Не Запрос.Выполнить().Пустой() Тогда //@skip-check query-in-loop
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Обнаружено дублирование данных в таблице %1.
					|Рекомендуется выполнить удаление дублирующихся записей.'"),
					ПолноеИмя) + " ";
				ОшибкиВыгружаемыхДанных.Добавить(ТекстОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 

	Для Каждого ТипОбщихДанных Из ТипыОбщихДанных Цикл

		Попытка
			ВыгрузкаЗагрузкаНеразделенныхДанныхСлужебный.ПередВыгрузкойТипа(
				Неопределено, 
				Неопределено, 
				ТипОбщихДанных, 
				Ложь);
		Исключение
			ОшибкиВыгружаемыхДанных.Добавить(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;

	КонецЦикла;
	
	Для Каждого ОшибкаМетаданноеНеВключеноВПланОбмена Из ОшибкиМетаданныеНеВключеныВПланОбмена(ТипыМоделиДанных, Ложь) Цикл
		ОшибкиВыгружаемыхДанных.Добавить(ОшибкаМетаданноеНеВключеноВПланОбмена);
	КонецЦикла;
			
	Возврат ОшибкиВыгружаемыхДанных;

КонецФункции

// Возвращает имя файла полного архива
//
// Возвращаемое значение:
//	Строка - наименование файла полного архива.
//
Функция ИмяФайлаПолногоАрхива()
	
	Возврат "full_data_dump.zip";
	
КонецФункции

Функция ТипРезервнойКопииПолная()
	
	Возврат "Полная";
	
КонецФункции

Функция ТипРезервнойКопииДифференциальная()
	
	Возврат "Дифференциальная";
	
КонецФункции

Функция КоличествоЗагружаемыхОбъектовРезервнойКопии(Архив, ТипРезервнойКопии, ДляТехническойПоддержки)
	
	ВременныйКаталог = ПолучитьИмяВременногоФайла();
	
	ИмяФайлаСодержимого = ПолучитьИмяФайла(PackageContents()); 
	
	РаспаковатьФайлАрхива(
		ПрочитатьАрхив(Архив),
		ВременныйКаталог,
		ИмяФайлаСодержимого);
	
	СоставАрхива = СоставАрхива(
		ВременныйКаталог + ПолучитьРазделительПути() + ИмяФайлаСодержимого);
	
	УдалитьФайлы(ВременныйКаталог);
	
	ЗагружаемыеТипы = ЗагружаемыеТипы(ТипРезервнойКопии);
	
	КоличествоЗагружаемыхОбъектовПоОбъектамМетаданных = КоличествоЗагружаемыхОбъектовПоОбъектамМетаданных(
		СоставАрхива,
		ЗагружаемыеТипы,
		ДляТехническойПоддержки);
		
	Возврат КоличествоЗагружаемыхОбъектовПоОбъектамМетаданных.Итог("ЧислоОбъектов"); 
	
КонецФункции

Функция ЗагрузитьТекущуюОбласть(Архив, ТипРезервнойКопии, СоответствиеСсылок, ПараметрыЗагрузки)
	
	ЗагружатьПользователей = ПараметрыЗагрузки.ЗагружатьПользователей;
	СопоставлениеПользователей = ПараметрыЗагрузки.СопоставлениеПользователей;
	ДанныеРасширений = ПараметрыЗагрузки.ДанныеРасширений;
	ПропуститьВосстановлениеРасширений = ПараметрыЗагрузки.ПропуститьВосстановлениеРасширений;
	АдресХранилищаРезультата = ПараметрыЗагрузки.АдресХранилищаРезультата;
	КоличествоПотоков = ПараметрыЗагрузки.КоличествоПотоков;
	ВсегоОбъектов = ПараметрыЗагрузки.ВсегоОбъектов;
	
	ПараметрыЗагрузкиВнутр = Новый Структура();
	Если ПараметрыЗагрузки.ИдентификаторСостояния <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("ВидЗадания", ПараметрыЗагрузки.ВидЗадания);
		ПараметрыЗагрузкиВнутр.Вставить("ИдентификаторСостояния", ПараметрыЗагрузки.ИдентификаторСостояния);
	КонецЕсли;
	
	Если ПропуститьВосстановлениеРасширений <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("ПропуститьВосстановлениеРасширений", ПропуститьВосстановлениеРасширений);
	КонецЕсли;
	
	Если АдресХранилищаРезультата <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("АдресХранилищаРезультата", АдресХранилищаРезультата);
	КонецЕсли;
	
	Если КоличествоПотоков > 0 Тогда
		ПараметрыЗагрузкиВнутр.Вставить("КоличествоПотоков", КоличествоПотоков);
	КонецЕсли;
	
	Если ВсегоОбъектов > 0 Тогда
		ПараметрыЗагрузкиВнутр.Вставить("ВсегоОбъектов", ВсегоОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ЗагружатьПользователей = Ложь;
		ЗагружатьНастройкиПользователей = Ложь;
	Иначе
		ЗагружатьПользователей = ЗагружатьПользователей;
		ЗагружатьНастройкиПользователей = ЗагружатьПользователей;
	КонецЕсли;
	
	ПараметрыЗагрузкиВнутр.Вставить("ВидПриложения", ПараметрыЗагрузки.ВидПриложения);
	ПараметрыЗагрузкиВнутр.Вставить("ЗагружатьПользователей", ЗагружатьПользователей);
	ПараметрыЗагрузкиВнутр.Вставить("ЗагружатьНастройкиПользователей", ЗагружатьНастройкиПользователей);
	ПараметрыЗагрузкиВнутр.Вставить("СвернутьРазделенныхПользователей", ПараметрыЗагрузки.СвернутьЭлементыСправочникаПользователи);

	Если СопоставлениеПользователей <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("СопоставлениеПользователей", СопоставлениеПользователей);
	КонецЕсли;

	Если ДанныеРасширений <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("ДанныеРасширений", ДанныеРасширений);
	КонецЕсли;
	
	ПараметрыЗагрузкиВнутр.Вставить("ТипРезервнойКопии", ТипРезервнойКопии);
	
	Если СоответствиеСсылок <> Неопределено Тогда
		ПараметрыЗагрузкиВнутр.Вставить("СоответствиеСсылок", СоответствиеСсылок);
	КонецЕсли;
	
	ПараметрыЗагрузкиВнутр.Вставить(
		"ТребуетсяСопоставлениеПользователей", 
		Не ТипРезервнойКопии = ТипРезервнойКопииПолная());
	
	ПараметрыЗагрузкиВнутр.Вставить(
		"НомерКлиентскогоСеанса",
		НомерКлиентскогоСеансаИзПараметров(ПараметрыЗагрузки));
	
	ПроверитьПараметрыПараллельнойВыгрузкиЗагрузкиДанных(ПараметрыЗагрузкиВнутр, Истина);
	
	Возврат ЗагрузитьДанныеИзАрхива(Архив, ПараметрыЗагрузкиВнутр);
	
КонецФункции

// Загружает данные из zip архива с XML файлами.
//
// Параметры:
//  ИмяАрхива - Строка, УникальныйИдентификатор, Структура - имя файла, идентификатор файла или данные файла полученные с помощью ZipАрхивыСлужебный.ПрочитатьАрхив().
//  ПараметрыЗагрузки - Структура - содержащая параметры загрузки данных:
//		* ЗагружаемыеТипы - Массив Из ОбъектМетаданных - массив объектов метаданных, данные
//        	которых требуется загрузить из архива. Если значение параметра задано - все прочие
//        	данные, содержащиеся в файле выгрузки, загружены не будут. Если значение параметра
//        	не задано - будут загружены все данные, содержащиеся в файле выгрузки.
//      * ЗагружатьПользователей - Булево - загружать информацию о пользователях информационной базы,
//      * ЗагружатьНастройкиПользователей - Булево - игнорируется, если ЗагружатьПользователей = Ложь.
//      * СопоставлениеПользователей - ТаблицаЗначений - таблица с колонками:
//        ** Пользователь - СправочникСсылка.Пользователи - идентификатора пользователя из архива.
//        ** ИдентификаторПользователяСервиса - УникальныйИдентификатор - идентификатор пользователя сервиса.
//        ** СтароеИмяПользователяИБ - Строка - старое имя пользователя базы.
//        ** НовоеИмяПользователяИБ - Строка - новое имя пользователя базы.
//    Также структура может содержать дополнительные ключи, которые могут быть обработаны внутри
//      произвольных обработчиков загрузки данных.
//
// Возвращаемое значение:		
//  см. ЗагрузитьДанныеТекущейОбластиИзАрхива
Функция ЗагрузитьДанныеИзАрхива(ИмяАрхива, ПараметрыЗагрузки)
	
	Если Не ПроверитьНаличиеПрав() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав доступа для загрузки данных'");
	КонецЕсли;
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	ВнешнийМонопольныйРежим = РаботаВМоделиСервисаСлужебный.УстановленМонопольныйРежим();
	ИспользоватьМногопоточность = ИспользоватьМногопоточность(ПараметрыЗагрузки);
	
	Попытка
		
		Если Не ВнешнийМонопольныйРежим Тогда
			РаботаВМоделиСервиса.УстановитьМонопольнуюБлокировку();
		КонецЕсли;
		
		РезультатЗагрузки = ЗагрузитьДанныеТекущейОбластиИзАрхива(ИмяАрхива, ПараметрыЗагрузки);
		
		Если Не ВнешнийМонопольныйРежим Тогда
			РаботаВМоделиСервиса.СнятьМонопольнуюБлокировку(ИспользоватьМногопоточность);
		КонецЕсли;
		
		Возврат РезультатЗагрузки;
		
	Исключение
		
		ТекстИсключения = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Загрузка данных из архива'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , ТекстИсключения);
		
		Если Не ВнешнийМонопольныйРежим Тогда
			
			РаботаВМоделиСервиса.СнятьМонопольнуюБлокировку(ИспользоватьМногопоточность);
			
			Если ИспользоватьМногопоточность Тогда
				РаботаВМоделиСервиса.СнятьМонопольнуюБлокировку();
			КонецЕсли;
			
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецФункции

Процедура ПоместитьРезультатЗагрузкиВоВременноеХранилище(ПараметрыЗагрузки, РезультатЗагрузки)
	
	АдресХранилищаРезультата = Неопределено;
	
	Если ПараметрыЗагрузки = Неопределено 
		Или Не ПараметрыЗагрузки.Свойство("АдресХранилищаРезультата", АдресХранилищаРезультата) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(РезультатЗагрузки, АдресХранилищаРезультата);
	
КонецПроцедуры

// Сравнивает совместима ли выгрузка с текущей конфигурацией.
//
// Параметры:
//	ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
//
Процедура ПроверитьВыгрузкаВАрхивеСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке)
	
	Если Не ВыгрузкаДанныхСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке) Тогда
		ВызватьИсключение ТекстОшибкиВыгрузкаНеСовместимаСТекущейКонфигурацией(ИнформацияОВыгрузке);
	КонецЕсли;
	
КонецПроцедуры

// Сравнивает совместима ли версия конфигурации с выгруженной.
//
// Параметры:
//	ИнформацияОВыгрузке - ОбъектXDTO - см. процедуру "СохранитьОписаниеВыгрузки".
//  СтрогаяПроверка - Булево - если Истина, то проверяет на равенство, если Ложь, то версия в выгрузке должна быть меньше либо равна текущей
//
Процедура ПроверитьВыгрузкаВАрхивеСовместимаСТекущейВерсиейКонфигурации(ИнформацияОВыгрузке, СтрогаяПроверка = Ложь)
	
	ВыгрузкаСовместима = Ложь;
	
	Если СтрогаяПроверка Тогда
		ВыгрузкаСовместима = ИнформацияОВыгрузке.Configuration.Version = Метаданные.Версия
	Иначе
		ВыгрузкаСовместима = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ИнформацияОВыгрузке.Configuration.Version, Метаданные.Версия) <= 0;
	КонецЕсли;
	
	Если Не ВыгрузкаСовместима Тогда
		ВызватьИсключение ТекстОшибкиВыгрузкаНеСовместимаСТекущейВерсиейКонфигурации(ИнформацияОВыгрузке);
	КонецЕсли;
	
КонецПроцедуры

// Записывает объект в поток записи.
//
// Параметры:
//	Объект - Произвольный - записываемый объект.
//	ПотокЗаписи - ЗаписьXML - поток записи.
//	Сериализатор - СериализаторXDTO - сериализатор.
//
Процедура ЗаписатьОбъектВПоток(Знач Объект, ПотокЗаписи, Сериализатор = Неопределено)
	
	Если Сериализатор = Неопределено Тогда
		Сериализатор = СериализаторXDTO;
	КонецЕсли;
	
	ПотокЗаписи.ЗаписатьНачалоЭлемента(ИмяЭлементаСодержащегоОбъект());
	
	ПрефиксыПространствИмен = ПрефиксыПространствИмен();
	Для Каждого ПрефиксПространстваИмен Из ПрефиксыПространствИмен Цикл
		ПотокЗаписи.ЗаписатьСоответствиеПространстваИмен(ПрефиксПространстваИмен.Значение, ПрефиксПространстваИмен.Ключ);
	КонецЦикла;
	
	Сериализатор.ЗаписатьXML(ПотокЗаписи, Объект, НазначениеТипаXML.Явное);
	
	ПотокЗаписи.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Возвращает объект из файла.
//
// Параметры:
//	ПотокЧтения - ЧтениеXML - поток чтения.
//
// Возвращаемое значение:
//	Произвольный - прочитанных объект.
//
Функция ПрочитатьОбъектИзПотока(ПотокЧтения)
	
	Если ПотокЧтения.ТипУзла <> ТипУзлаXML.НачалоЭлемента
			Или ПотокЧтения.Имя <> ИмяЭлементаСодержащегоОбъект() Тогда
		
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка чтения XML. Неверный формат файла. Ожидается начало элемента %1.'"),
			ИмяЭлементаСодержащегоОбъект());
		
	КонецЕсли;
	
	Если НЕ ПотокЧтения.Прочитать() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка чтения XML. Обнаружено завершение файла.'");
	КонецЕсли;
	
	Объект = СериализаторXDTO.ПрочитатьXML(ПотокЧтения);
	
	Возврат Объект;
	
КонецФункции

Функция ЭтоДифференциальнаяРезервнаяКопия(ПараметрыЗагрузки)
	
	Возврат ТипРезервнойКопии(ПараметрыЗагрузки) = ТипРезервнойКопииДифференциальная();
	
КонецФункции

Функция ТипРезервнойКопииОбычная()
	
	Возврат "Обычная";
	
КонецФункции

Функция ЗагружаемыеТипы(ТипРезервнойКопии)
	
	ЗагружаемыеТипы = Новый Массив();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ЗагружаемыеТипы,
		ПолучитьТипыМоделиДанныхОбласти());
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			ЗагружаемыеТипы, 
			ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке(),
			Истина);
		
	КонецЕсли;
		
	Если ТипРезервнойКопии = ТипРезервнойКопииПолная() Тогда
		
		Для ОбратныйИндекс = 1 - ЗагружаемыеТипы.Количество() По 0 Цикл
			
			ОбъектМетаданных = ЗагружаемыеТипы[-ОбратныйИндекс];
			
			Если Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных)
				Или ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено
				И Не Метаданные.ПланыОбмена.МиграцияПриложений.Состав.Содержит(ОбъектМетаданных) Тогда
				
				ЗагружаемыеТипы.Удалить(-ОбратныйИндекс);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ЗагружаемыеТипы;
	
КонецФункции

Функция ИсключаемыеТипы(ДляТехническойПоддержки)
	
	ИсключаемыеТипы = Новый Массив();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
 		ИсключаемыеТипы,
 		ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки());
 	
 	Если ДляТехническойПоддержки Тогда
 		
 		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
 			ИсключаемыеТипы,
 			ВыгрузкаОбластейДанныхДляТехническойПоддержкиПовтИсп.МетаданныеИсключаемыеИзВыгрузкиВРежимеДляТехническойПоддержки(),
 			Истина);
 		
 	КонецЕсли;
 	
 	Возврат ИсключаемыеТипы;
 	
КонецФункции

Функция ПолныеИменаТипов(Типы)
	
	ПолныеИменаТипов = Новый Соответствие();
	
	Для Каждого Тип Из Типы Цикл
		ПолныеИменаТипов.Вставить(Тип.ПолноеИмя(), Истина);
	КонецЦикла;
	
	Возврат ПолныеИменаТипов;
	
КонецФункции

Функция КлючЗавершенияВыгрузкиВТранзакции()
	
	Ключ = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор("a0a0b2aa-c9a2-4aaf-afa2-3d31c0a1dc49"));
	
	Возврат Ключ;
	
КонецФункции

#Область ПараллельнаяВыгрузкаЗагрузка

// Обработать сообщения потоков.
// 
// Параметры:
//  ТаблицаСообщений - см. НоваяТаблицаСообщенийПотоков
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - Текущий контейнер
Процедура ОбработатьСообщенияПотоков(ТаблицаСообщений, Контейнер)
	
	Если Не ЗначениеЗаполнено(ТаблицаСообщений) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСообщений.Сортировать("ДатаОтправки, НомерСообщения");
	
	Для Каждого СтрокаТаблицы Из ТаблицаСообщений Цикл
		Контейнер.ОбработатьСообщениеПотока(СтрокаТаблицы.ИмяМетода, СтрокаТаблицы.ДанныеСообщения);
	КонецЦикла;
	
КонецПроцедуры

// Получить сообщения потока.
// 
// Параметры:
//  ТаблицаСообщений - см. НоваяТаблицаСообщенийПотоков
//  Задание - ФоновоеЗадание - Задание выполняющее выгрузку \ загрузку
//  ИдентификаторПроцесса - УникальныйИдентификатор - Идентификатор процесса выгрузки \ загрузки
Процедура ПолучитьСообщенияПотока(ТаблицаСообщений, Задание, ИдентификаторПроцесса)
	
	СообщенияПотока = Задание.ПолучитьСообщенияПользователю(Истина);
	
	Если Не ЗначениеЗаполнено(СообщенияПотока) Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеСообщенияПотока = Новый ЧтениеJSON();
	
	Для Каждого Сообщение Из СообщенияПотока Цикл
		
		Если Сообщение.ИдентификаторНазначения <> ИдентификаторПроцесса Тогда
			Продолжить;
		КонецЕсли;
		
		ЧтениеСообщенияПотока.УстановитьСтроку(Сообщение.Текст);
		СообщениеПотока = ПрочитатьJSON(ЧтениеСообщенияПотока);
		
		СтрокаТаблицы = ТаблицаСообщений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СообщениеПотока);
		
		СтрокаТаблицы.КлючЗадания = Задание.Ключ;
		
	КонецЦикла;
	
	ЧтениеСообщенияПотока.Закрыть();
	
КонецПроцедуры

// Задание потока завершено.
// 
// Параметры:
//  Задание - ФоновоеЗадание - Задание выполняющее выгрузку \ загрузку
//  ТаблицаСообщений - см. НоваяТаблицаСообщенийПотоков
// 
// Возвращаемое значение:
//  Булево
Функция ЗаданиеПотокаЗавершено(Задание, ТаблицаСообщений)
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("ИмяМетода", ИмяМетодаСообщенияПотока_ЗавершениеВыгрузки());
	ПараметрыОтбора.Вставить("КлючЗадания", Задание.Ключ);
	
	НайденныеСтроки = ТаблицаСообщений.НайтиСтроки(ПараметрыОтбора);
	
	Возврат ЗначениеЗаполнено(НайденныеСтроки);
	
КонецФункции

// Новая таблица сообщений потоков.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица сообщений потоков:
// * ДатаОтправки - Число - Универсальная дата в миллисекундах
// * ИмяМетода - Строка - Имя метода
// * ДанныеСообщения - Структура - Данные сообщения
// * КлючЗадания - Строка - Ключ фонового задания отправителя
Функция НоваяТаблицаСообщенийПотоков()
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(32, 0, ДопустимыйЗнак.Неотрицательный));
	ТипСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(256, ДопустимаяДлина.Переменная));
	
	ТаблицаСообщений = Новый ТаблицаЗначений();
	ТаблицаСообщений.Колонки.Добавить("ДатаОтправки", ТипЧисло);
	ТаблицаСообщений.Колонки.Добавить("НомерСообщения", ТипЧисло);
	ТаблицаСообщений.Колонки.Добавить("ИмяМетода", ТипСтрока);
	ТаблицаСообщений.Колонки.Добавить("ДанныеСообщения");
	ТаблицаСообщений.Колонки.Добавить("КлючЗадания", ТипСтрока);
	
	Возврат ТаблицаСообщений;
	
КонецФункции

// Ключ задания выгрузки загрузки данных.
// 
// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  Строка - Ключ задания выгрузки загрузки данных
Функция КлючЗаданияВыгрузкиЗагрузкиДанных(Контейнер)
	
	Возврат СтрШаблон(
		"%1_Поток_%2",
		Контейнер.ИдентификаторПроцесса(),
		Контейнер.СледующийНомерПотока());
	
КонецФункции

// Номер потока из ключа задания.
// 
// Параметры:
//  КлючЗадания - Строка - Ключ задания
// 
// Возвращаемое значение:
//  Строка - Номер потока из ключа задания
Функция НомерПотокаИзКлючаЗадания(КлючЗадания)
	
	НомерПотока = "";
	ЧастиКлюча = СтрРазделить(КлючЗадания, "_", Ложь);
	
	Если ЧастиКлюча.Количество() = 3 Тогда
		НомерПотока = ЧастиКлюча[2];
	КонецЕсли;
	
	Возврат НомерПотока;
	
КонецФункции

// Параметры:
//  Задания - Массив из ФоновоеЗадание - Запущенные задания
//  ПараметрыПроцесса - Структура - Для загрузки данных см. обработку ВыгрузкаЗагрузкаДанныхМенеджерЗагрузкиДанныхИнформационнойБазы.НовыеПараметрыПроцессаЗагрузкиДанныхИнформационнойБазы
//									Для выгрузки данных см. обработку ВыгрузкаЗагрузкаДанныхМенеджерВыгрузкиДанныхИнформационнойБазы.НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
Процедура ЗапуститьДополнительныеПотокиВыгрузкиЗагрузкиДанных(Задания, ПараметрыПроцесса)
	
	Возврат;
	
КонецПроцедуры

// Проверить параметры параллельной выгрузки загрузки данных.
// 
// Параметры:
//  ПараметрыВыгрузкиЗагрузки - Структура
//  ЭтоЗагрузка - Булево
Процедура ПроверитьПараметрыПараллельнойВыгрузкиЗагрузкиДанных(ПараметрыВыгрузкиЗагрузки, ЭтоЗагрузка)
	
	Если Не ПараметрыВыгрузкиЗагрузки.Свойство("КоличествоПотоков") Тогда
		ПараметрыВыгрузкиЗагрузки.Вставить("КоличествоПотоков", 0);
	КонецЕсли;
	
	Если ПараметрыВыгрузкиЗагрузки.КоличествоПотоков < 1 Тогда
		ПараметрыВыгрузкиЗагрузки.КоличествоПотоков = 1;
	КонецЕсли;
	
	Если Не (ПараметрыВыгрузкиЗагрузки.Свойство("ВидЗадания")
		И ЗначениеЗаполнено(ПараметрыВыгрузкиЗагрузки.ВидЗадания)) Тогда
		
		ИмяВидаЗадания = ?(ЭтоЗагрузка, "ПрочаяЗагрузкаДанных", "ПрочаяВыгрузкаДанных");
		
		ПараметрыВыгрузкиЗагрузки.Вставить("ВидЗадания", ВидЗаданияВыгрузкиЗагрузкиДанныхПоИмени(ИмяВидаЗадания));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
