
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменДанными

// Пересчитывает зависимые данные после загрузки сообщения обмена
//
// Параметры:
//		ЗависимыеДанные - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные ведущих данных
//			* ЗависимыеМетаданные - ОбъектМетаданных - Метаданные текущего объекта
//			* ВедущиеДанные - Массив объектов, заполненный при загрузке сообщения обмена
//				по этим объектам требуется обновить зависимые данные
//
Процедура ОбновитьЗависимыеДанныеПослеЗагрузкиОбменаДанными(ЗависимыеДанные) Экспорт
	
	ТаблицаОбновления = ОстаткиОтпусковАналитикаДанных.НоваяТаблицаОбновлениеАналитикиОстатковОтпусков();
	
	Для Каждого СтрокаТаблицы Из ЗависимыеДанные Цикл
		ЗаполнитьТаблицуОбновленияПоЗаработаннымПравамНаОтпуска(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоФактическимОтпускам(ТаблицаОбновления, СтрокаТаблицы);
	КонецЦикла;
	
	ОстаткиОтпусковАналитикаДанных.ЗарегистрироватьОбновлениеАналитикиОстатковОтпусков(ТаблицаОбновления);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуОбновленияПоЗаработаннымПравамНаОтпуска(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.ЗаработанныеПраваНаОтпуска Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновленияЗаработанныхПравНаОтпуска, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоФактическимОтпускам(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыНакопления.ФактическиеОтпуска Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновленияФактическихОтпусков, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
