#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьДублиПоказателей() Экспорт
	
	Уникальные = Новый Соответствие;
	
	Индекс = 0;
	Пока Индекс < ПоказателиКадровогоПланирования.Количество() Цикл
		СтрокаТаблицы = ПоказателиКадровогоПланирования[Индекс];
		Если Уникальные[СтрокаТаблицы.Показатель] = Неопределено Тогда
			Уникальные.Вставить(СтрокаТаблицы.Показатель, Истина);
			Индекс = Индекс + 1;
		Иначе
			ПоказателиКадровогоПланирования.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли