#Область ПрограммныйИнтерфейс

// Подробнее
// См. Обработки.КалендарьОтчетности.Форма.Подключаемый_ОтборыПоЗадачамПриИзменении
//
Процедура СобратьСтатистикуИспользованияОтборов(Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. Обработки.КалендарьОтчетности.Форма.ВыборПериода
//
Процедура ЗаписатьСтатистикуВыбораПериода(Форма, ПредставлениеПериода) Экспорт
КонецПроцедуры

Процедура ЗаписатьСобытиеСтатистикиПоПоказателям(ИмяСобытия) Экспорт
КонецПроцедуры

// Подробнее
// См. Обработки.КалендарьОтчетности.Форма.ОрганизацияОбработкаВыбора
//
Процедура ОрганизацияОбработкаВыбора(ВыбранноеЗначение, ПереформироватьКалендарь, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Подробнее
// См. Обработки.КалендарьОтчетности.Форма.ОткрытьФормуНалогиИОтчетыНаТекущейЗакладке
//
Процедура ОткрытьНастройкуНалоговОтчетов(Организация, ИсточникПерехода, ТекущаяЗакладка = Неопределено) Экспорт
	
	ЗарплатаКадрыКлиент.ОткрытьНастройкуНалоговОтчетов(Организация, ИсточникПерехода, ТекущаяЗакладка);
	
КонецПроцедуры

// Подробнее
// См. Обработки.КалендарьОтчетности.Форма.ОткрытьМоиПриложения
//
Процедура ОткрытьФормуМоиПриложения(Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. Обработка.КалендарьОтчетности.Форма.ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели
//
Процедура ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели(Форма, ПараметрыОтчета) Экспорт
	
	ЗарплатаКадрыКлиент.ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели(Форма, ПараметрыОтчета);

КонецПроцедуры

// Подробнее
// См. Обработка.КалендарьОтчетности.Форма.ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели
//
Процедура ПриВыполненииПереходаПоНавигационнойСсылке(ПараметрыСсылки, ПереходВыполнен) Экспорт
КонецПроцедуры

// Подробнее
// См. Обработка.КалендарьОтчетности.Форма.СформироватьЗаголовокОтборыПоЗадачам
//
Процедура ПриОпределенииМаксимальногоКоличестваВидовОтбора(КоличествоВидовОтбора) Экспорт
КонецПроцедуры

#КонецОбласти