#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьПараметры(Параметры);
	ИзменитьОформлениеФормы(ЭтотОбъект);
	
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Телефоны
	Элемент = Элементы.ПредставительТелефон;
	Элемент.ОбновитьТекстРедактирования();
	ПриИзмененииТекстаРедактированияТелефона(Элемент.ТекстРедактирования, Элемент, Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставительАдресМестаЖительстваПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидАдреса = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица");
	РедактироватьАдрес(Элемент, ВидАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительАдресМестаПребыванияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидАдреса = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица");
	РедактироватьАдрес(Элемент, ВидАдреса);

КонецПроцедуры

&НаКлиенте
Процедура ПредставительАдресФактическийПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидАдреса = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица");
	РедактироватьАдрес(Элемент, ВидАдреса);

КонецПроцедуры

&НаКлиенте
Процедура ПредставительАдресОрганизацииПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВидАдреса = ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации");
	РедактироватьАдрес(Элемент, ВидАдреса);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПриИзмененииТекстаРедактированияТелефона(Элемент.ТекстРедактирования, Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	ПриИзмененииТекстаРедактированияТелефона(Текст, Элемент, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПредставителяПриИзменении(Элемент)
	
	ИзменитьОформлениеФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда = Неопределено)
	
	ДанныеКорректны = Истина;
	
	ПредставительУказанКорректно(ЭтотОбъект, ДанныеКорректны);
	
	Если ДанныеКорректны Тогда

		ДополнительныеПараметры = Новый Структура(ПараметрыФормы);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ЭтотОбъект, ПараметрыФормы); 
		ДополнительныеПараметры.Вставить("ПараметрыФормы",     ПараметрыФормы);
		ДополнительныеПараметры.Вставить("Модифицированность", Модифицированность);
		
		Модифицированность = Ложь;
		
		Закрыть(ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииТекстаРедактированияТелефона(Текст, Элемент, ИзмененоВручную = Ложь)
	
	Если ИзмененоВручную Тогда
		Пауза = 1.5;
	Иначе
		Пауза = 0.1;
	КонецЕсли;
	
	Представление = ЭлектроннаяПодписьВМоделиСервисаКлиентСервер.ПолучитьПредставлениеТелефона(Текст);
	
	// Обновляем фактичекое значение
	Если ЗначениеЗаполнено(Представление) Тогда
		// Устанавливаем телефон в виде +7 ХХХ ХХХ-ХХ-ХХ
		ПредставительТелефон = Представление;
	Иначе
		// В противном случае, устанавливаем то, что ввел пользователь
		ПредставительТелефон = Текст;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_ОбновитьТелефон");
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьТелефон", Пауза, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьТелефон()
	
	Представление = ЭлектроннаяПодписьВМоделиСервисаКлиентСервер.ПолучитьПредставлениеТелефона(ПредставительТелефон);
	
	// Меняем отображение на форме
	Если ЗначениеЗаполнено(Представление) Тогда
		Элементы.ПредставительТелефон.ОбновитьТекстРедактирования();
	КонецЕсли;
	Элементы.ПредставительТелефон.ОтметкаНезаполненного = НЕ ЗначениеЗаполнено(Представление);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставительУказанКорректно(Форма, МастерДалее = Истина)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПредставительУказанКорректно(Форма, МастерДалее, Истина);
	
КонецФункции

&НаСервере
Процедура ОбработатьПараметры(Параметры)
	
	ПараметрыФормы = Параметры.ПараметрыФормы;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ПараметрыФормы);
	ЗапретитьИзменение = Параметры.ЗапретитьИзменение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОформлениеФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ЗапретитьИзменение Тогда
		Элементы.ГруппаВидПредставителя.ТолькоПросмотр = Истина;
		Элементы.ГруппаДокументУдостоверящийЛичность.ТолькоПросмотр = Истина;
		Элементы.ГруппаДокументПодтверждающийПолномочия.ТолькоПросмотр = Истина;
		// Обход ошибки платформы 10196698 Элемент длиннее на пол кнопки
		Элементы.ВидПредставителя.Ширина = 40;
		Элементы.ПредставительВидДокумента.Ширина = 39;
	КонецЕсли;
	
	ЭтоДоверенноеЛицо = Форма.ВидПредставителя = ПредопределенноеЗначение("Перечисление.ВидПредставителяПолучателяПенсии.ДоверенноеЛицо");
	ЭтоОрганизация    = Форма.ВидПредставителя = ПредопределенноеЗначение("Перечисление.ВидПредставителяПолучателяПенсии.Организация");
	
	Элементы.ПредставительНаименованиеОрганизации.Видимость = НЕ ЭтоДоверенноеЛицо;
	Элементы.ПредставительНаименованиеОрганизации.АвтоОтметкаНезаполненного = ЭтоОрганизация;
	
	ДокументооборотСКОКлиентСервер.ПроставитьОтметкуОбязательногоЗаполнения_85(Элементы.ПредставительНаименованиеОрганизации);
	
	ИзменитьОформлениеАдресов(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАдрес(Элемент, ВидАдреса)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"АдресМестаЖительстваНажатие_Завершение", 
		ЭтотОбъект, 
		Элемент);
		
	ИмяДанных = СтрЗаменить(Элемент.Имя, "Представление", "");
		
	ПараметрыОткрытия = УправлениеКонтактнойИнформациейКлиент.ПараметрыФормыКонтактнойИнформации(ВидАдреса, ЭтотОбъект[ИмяДанных]);
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ЗапретитьИзменение);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыОткрытия, , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресМестаЖительстваНажатие_Завершение(Результат, Элемент) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Адрес         = Результат.КонтактнаяИнформация;
	Представление = Результат.Представление;
	
	ИмяДанных = СтрЗаменить(Элемент.Имя, "Представление", "");
	
	Если Представление <> Элемент Тогда
		Модифицированность      = Истина;
		Элемент                 = Представление;
		ЭтотОбъект[ИмяДанных]   = Результат.КонтактнаяИнформация;
		ИзменитьОформлениеАдресов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОформлениеАдреса(Форма, Имя, Видимость = Истина)

	Элементы = Форма.Элементы;
	
	Элементы[Имя].Видимость = Видимость;
	
	ИмяДанных = СтрЗаменить(Имя, "Представление", "");
	Данные = Форма[ИмяДанных];
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Форма[Имя] = ПредставлениеКонтактнойИнформации(Данные);
	ИначеЕсли Форма.ЗапретитьИзменение Тогда
		Элементы[Имя].Гиперссылка = Ложь;
		Форма[Имя] = НСтр("ru = 'Не указано'");
	Иначе
		Форма[Имя] = НСтр("ru = 'Заполнить'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВыделитьКрасным(УсловиеОшибки, Элемент)
	
	Если УсловиеОшибки Тогда
		Элемент.ЦветТекста = Новый Цвет(178, 34, 34);
	Иначе
		Элемент.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОформлениеАдресов(Форма)
	
	Элементы = Форма.Элементы;
	
	ДоставлятьПредставителю = Форма.КомуДоставлятьПенсию = ПредопределенноеЗначение("Перечисление.ВидыПолучателейПенсии.Представитель");
	ДоставлятьПредставителюДоЗаключенияДоговора = Форма.КомуДоставлятьПенсиюДоЗаключенияДоговора = ПредопределенноеЗначение("Перечисление.ВидыПолучателейПенсии.Представитель");

	ЭтоДоверенноеЛицо = Форма.ВидПредставителя = ПредопределенноеЗначение("Перечисление.ВидПредставителяПолучателяПенсии.ДоверенноеЛицо");
	
	// Текст гиперссылки
	ИзменитьОформлениеАдреса(Форма, "ПредставительАдресМестаЖительстваПредставление");
	ИзменитьОформлениеАдреса(Форма, "ПредставительАдресМестаПребыванияПредставление");
	ИзменитьОформлениеАдреса(Форма, "ПредставительАдресФактическийПредставление");
	ИзменитьОформлениеАдреса(Форма, "ПредставительАдресОрганизацииПредставление", НЕ ЭтоДоверенноеЛицо);
	
	// Цвет гиперссылки
	
	// Место жительства
	ЕстьОшибка = Форма.ЭтоЗаявлениеОДоставкеПенсии И НЕ ЗначениеЗаполнено(Форма.ПредставительАдресМестаЖительства)
		И (Форма.СпособПолученияПенсии = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуЖительства") 
		И ДоставлятьПредставителю
		ИЛИ Форма.СпособПолученияПенсииДоЗаключенияДоговора = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуЖительства")
		И ДоставлятьПредставителюДоЗаключенияДоговора); 
		
	ВыделитьКрасным(ЕстьОшибка, Элементы.ПредставительАдресМестаЖительстваПредставление);
	
	// Место пребывания
	ЕстьОшибка = Форма.ЭтоЗаявлениеОДоставкеПенсии И НЕ ЗначениеЗаполнено(Форма.ПредставительАдресМестаПребывания)
		И (Форма.СпособПолученияПенсии = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуПребывания") 
		И ДоставлятьПредставителю
		ИЛИ Форма.СпособПолученияПенсииДоЗаключенияДоговора = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуПребывания")
		И ДоставлятьПредставителюДоЗаключенияДоговора); 
		
	ВыделитьКрасным(ЕстьОшибка, Элементы.ПредставительАдресМестаПребыванияПредставление);
	
	// Место факт. проживания
	ЕстьОшибка = Форма.ЭтоЗаявлениеОДоставкеПенсии И НЕ ЗначениеЗаполнено(Форма.ПредставительАдресФактический)
		И (Форма.СпособПолученияПенсии = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуФактическому") 
		И ДоставлятьПредставителю
		ИЛИ Форма.СпособПолученияПенсииДоЗаключенияДоговора = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестуФактическому")
		И ДоставлятьПредставителюДоЗаключенияДоговора); 
		
	ВыделитьКрасным(ЕстьОшибка, Элементы.ПредставительАдресФактическийПредставление);
	
	// Место нахождения орг-ции
	ЕстьОшибка = Форма.ЭтоЗаявлениеОДоставкеПенсии И НЕ ЗначениеЗаполнено(Форма.ПредставительАдресОрганизации)
		И (Форма.СпособПолученияПенсии = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестонахождениюОрганизации") 
		И ДоставлятьПредставителю
		ИЛИ Форма.СпособПолученияПенсииДоЗаключенияДоговора = ПредопределенноеЗначение("Перечисление.СпособыПолученияПенсии.ПоМестонахождениюОрганизации")
		И ДоставлятьПредставителюДоЗаключенияДоговора); 
		
	ВыделитьКрасным(ЕстьОшибка, Элементы.ПредставительАдресОрганизацииПредставление);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеКонтактнойИнформации(ЗначениеАдреса)
	
	Возврат УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформации(ЗначениеАдреса);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере_85()
	
	Если ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85() Тогда
		ДокументооборотСКО.УбратьДвоеточияЗаголовков_85(ЭтотОбъект);
		ДокументооборотСКОКлиентСервер.ПроставитьОтметкуОбязательногоЗаполнения_85(ЭтотОбъект);
	Иначе
		ДокументооборотСКОКлиентСервер.ГруппировкаВертикальная(Элементы.ГруппаКолонки1);
		ДокументооборотСКОКлиентСервер.ГруппировкаВертикальная(Элементы.ГруппаКолонки2);
		
		Элементы.ГруппаВидПредставителя.Объединенная = Ложь;
		Элементы.ГруппаДокументУдостоверящийЛичность.Объединенная = Ложь;
		Элементы.ГруппаДокументПодтверждающийПолномочия.Объединенная = Ложь;
		Элементы.ГруппаАдреса.Объединенная = Ложь;
		
		ЭтотОбъект.Ширина = 50;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти