
#Область ПрограммныйИнтерфейс

// Позволяет отключить ввод данных о выполненных работах документом ввода данных для расчета зарплаты.
// Предназначен для случаев, когда регистрация выполненных сдельно работ осуществляется специализированными документами,
// и универсальный инструмент ввода не требуется.
//
// Параметры:
//  ДоступностьРегистрации - булево, по умолчанию Истина.
//
Процедура ОпределитьДоступностьРегистрацииВыполненныхРаботДокументомВводаДанныхДляРасчетаЗарплаты(ДоступностьРегистрации) Экспорт
	
КонецПроцедуры

// Предназначена для управления доступностью единого флажка включения/отключения библиотеки «Зарплата и кадры» в целом.
//
// Параметры: 
//	ДоступностьУстановки - булево, по умолчанию Ложь.
//
Процедура ОпределитьДоступностьУстановкиИспользованияЗарплатаКадры(ДоступностьУстановки) Экспорт
	
КонецПроцедуры

// Предназначена для определения необходимости использования штатного расписания по умолчанию.
//
// Параметры: 
//	ШтатноеРасписаниеВсегдаИспользуется - тип булево.
//
Процедура ОпределитьОбязательностьИспользованияШтатногоРасписания(ШтатноеРасписаниеВсегдаИспользуется) Экспорт
	
КонецПроцедуры

// Обработчик события, возникающего при включении/отключении библиотеки «Зарплата и кадры» в целом.
//
// Параметры:
//	Использование - булево, устанавливаемое значение использования.
//
Процедура ПриУстановкеИспользованияЗарплатаКадры(Использование) Экспорт
	
КонецПроцедуры

// Заполняет сведения об ответственных лицах
// Параметры:
//		СписокФизическихЛиц		- Массив, содержит ссылки на физические лица сведения по которым необходимо получить
//		СведенияОбОтветственных	- ТаблицаЗначений
//									* ФизическоеЛицо			- СправочникСсылка.ФизическиеЛица
//									* ПредставлениеДолжности	- Строка
//									* СтруктурнаяЕдиница		- Неопределено
//		СтандартнаяОбработка	- Булево
//
Процедура ЗаполнитьСведенияОбОтветственныхЛицах(СписокФизическихЛиц, СведенияОбОтветственных, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Устанавливает начальное значение константы СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц
// Параметры:
//		Соответствует - Булево, соответствие структуры предприятия и юридической структуры (если Истина, константа устанавливается в Ложь).
//
Процедура ПриУстановкеСоответствияСтруктурыПредприятияСтруктуреЮридическихЛиц(Соответствует) Экспорт 
	
КонецПроцедуры

// Предназначена для определения необходимости использования структуры предприятия для отражения в учете.
//
// Параметры: 
//	Использование - тип булево.
//
Процедура ОпределитьИспользованиеСтруктурыПредприятияДляОтраженияВРегламентированномУчете(Использование) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации в Google
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляGoogle
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляGoogle
Процедура ПриОпределенииИдентификацииПриложенияДляGoogle(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте hh.ru
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляHeadHunter
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляHeadHunter
Процедура ПриОпределенииИдентификацииПриложенияДляHeadHunter(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте zarplata.ru
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляЗарплатаРу
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляЗарплатаРу
Процедура ПриОпределенииИдентификацииПриложенияДляЗарплатаРу(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте zarplata.ru
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляРаботаРу
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляРаботаРу
Процедура ПриОпределенииИдентификацииПриложенияДляРаботаРу(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте Avito
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляАвитоРабота
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляАвитоРабота
Процедура ПриОпределенииИдентификацииПриложенияДляАвитоРабота(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте career.habr.com
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляХабрКарьера
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляХабрКарьера
Процедура ПриОпределенииИдентификацииПриложенияДляХабрКарьера(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

// Переопределяет данные клиентского приложения, используемые для авторизации на сайте zoom.us
// Подробнее
// См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляZoom
// 
// Параметры:
//  ИдентификаторПриложения - См. ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляZoom
Процедура ПриОпределенииИдентификацииПриложенияДляZoom(ИдентификаторПриложения) Экспорт
	
КонецПроцедуры

#КонецОбласти