// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект, РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.Данные());
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура TelegramЗаполнитьПоУмолчанию(Команда)
	Telegram = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Telegram"));
КонецПроцедуры

&НаКлиенте
Процедура WhatsappЗаполнитьПоУмолчанию(Команда)
	Whatsapp = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Whatsapp"));
КонецПроцедуры

&НаКлиенте
Процедура MaxЗаполнитьПоУмолчанию(Команда)
	Max = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Max"));
КонецПроцедуры

&НаКлиенте
Процедура ПрочееЗаполнитьПоУмолчанию(Команда)
	Прочее = ВидКонтактнойИнформацииПоУмолчанию(
		ПредопределенноеЗначение("Перечисление.КонтактыРекрутинговыхСайтов.Прочее"));
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНаСервере()
	Данные = РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.НовыеДанные();
	ЗаполнитьЗначенияСвойств(Данные, ЭтотОбъект);
	РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.Сохранить(Данные);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидКонтактнойИнформацииПоУмолчанию(Контакт)
	Возврат Перечисления.КонтактыРекрутинговыхСайтов.ВидКонтактнойИнформацииПоУмолчанию(Контакт);
КонецФункции

#КонецОбласти

