#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ФорматПоКодуВидаСведений = ПроцессыОбработкиДокументов.РасширениеФайлаФормуляра(Объект.КодВидаСведений);
	
	Если Объект.Ссылка.Пустая() Тогда

		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПросмотр = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьЗаголовокФормы();

	ЗаполнитьФайлMXLФормуляра();
	
	ВывестиПредставлениеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормы()

	Если ЗначениеЗаполнено(Объект.НаименованиеВидаРегистраУчета) Тогда
		Заголовок = Объект.ОписаниеРегистраУчета;
	Иначе	
		СвойстваПредставления = Новый Структура;
		СвойстваПредставления.Вставить("НаименованиеДокумента", Объект.НаименованиеДокумента);
		СвойстваПредставления.Вставить("НомерДокумента", Объект.НомерДокумента);
		СвойстваПредставления.Вставить("ДатаДокумента", Объект.ДатаДокумента);
		
		ТекстЗаголовка = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеФормуляраПоСвойствам(
			СвойстваПредставления, Объект.Ссылка.Пустая());
			
		ДополнениеЗаголовка = ПроцессыОбработкиДокументовКлиентСервер.ДополнениеНаименованияФормуляра(Объект.КодВидаСведений);	
		Заголовок = СтрШаблон("%1%2", ТекстЗаголовка, ДополнениеЗаголовка);		
	КонецЕсли;
КонецПроцедуры
	
&НаСервере
Процедура ВывестиПредставлениеДокумента()
	
	Если Объект.Ссылка.Пустая()
		И НЕ ЗначениеЗаполнено(АдресОсновногоФайла) Тогда
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанные = ДвоичныеДанныеЭлектронногоДокумента();
	
	Если ДвоичныеДанные = Неопределено Тогда
		
		ТабличныйДокументОсновной.Очистить();
		АдресОсновногоФайла = "";
		АдресТабличногоДокумента = "";
		
		ТекстСообщения = НСтр("ru = 'Не удалось получить данные формуляра.
			|Для продолжения работы с формуляром необходимо снять пометку удаления.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
 	ТабличныйДокументОсновной = ПроцессыОбработкиДокументовВызовСервера.ТабличныйДокументПоДвоичнымДанным(ДвоичныеДанные);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеЭлектронногоДокумента()
	Если Объект.КодВидаСведений = 1 Тогда
		Возврат РаботаСФайлами.ДвоичныеДанныеФайла(Объект.ОсновнойФайл, Ложь);
	ИначеЕсли Объект.КодВидаСведений = 2 Тогда
		Если ЗначениеЗаполнено(ФайлMXLФормуляра) Тогда
			Возврат РаботаСФайлами.ДвоичныеДанныеФайла(ФайлMXLФормуляра, Ложь);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаполнитьФайлMXLФормуляра()
	Если Объект.КодВидаСведений = 2 Тогда
		ПрисоединенныеФайлыФормуляраПервичногоДокумента = ПроцессыОбработкиДокументов.ПрисоединенныеФайлыФормуляраПервичногоДокумента(Объект.Предмет, Объект.ИдентификаторФормуляра);
		ФайлMXLФормуляра = ПрисоединенныеФайлыФормуляраПервичногоДокумента.ФайлMXL;
		ФайлPDFФормуляра = ПрисоединенныеФайлыФормуляраПервичногоДокумента.ФайлPDF;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
