
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтапРаботы") Тогда
		Параметры.Свойство("ЭтапРаботы", ЭтапРаботы);
	КонецЕсли;
	
	УстановитьЦветЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьУсловноеОформление" Тогда
		УстановитьЦветЭтапа();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтапРаботыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	УстановитьЦветЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветТекстаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветТекста);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветФонаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветФона);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЦветТекста = WebЦвета.Черный;
	Элементы.ЭтапРаботы.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЦветФона = WebЦвета.Белый;
	Элементы.ЭтапРаботы.ЦветФона = ЦветФона;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьЦветаЭтапа();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЦвет(Команда)
	
	Модифицированность = Истина;
	СброситьЦветТекста();
	СброситьЦветФона();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЦветЭтапа()
	
	Если Не ЗначениеЗаполнено(ЭтапРаботы) Тогда
		ТекущийЭтап = ПредопределенноеЗначение("Справочник.ЭтапыРаботыСКандидатами.ПустаяСсылка");
	Иначе
		ТекущийЭтап = ЭтапРаботы;
	КонецЕсли;
	
	ЦветаЭтапа = РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.
		ЦветаЭтаповРаботыСКандидатами(ТекущийЭтап);
	
	Элементы.ЭтапРаботы.ЦветТекста = ЦветаЭтапа.ЦветТекста;
	Элементы.ЭтапРаботы.ЦветФона = ЦветаЭтапа.ЦветФона;
	
	ЦветТекста = ЦветаЭтапа.ЦветТекста;
	ЦветФона = ЦветаЭтапа.ЦветФона;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветТекста()
	
	ЦветТекста = WebЦвета.Черный;
	Элементы.ЭтапРаботы.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветФона()
	
	ЦветФона = WebЦвета.Белый;
	Элементы.ЭтапРаботы.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветТекстаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ЦветТекста = ПолученныйЦвет;
	Элементы.ЭтапРаботы.ЦветТекста = ПолученныйЦвет;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветФонаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ЦветФона = ПолученныйЦвет;
	Элементы.ЭтапРаботы.ЦветФона = ПолученныйЦвет;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветаЭтапа()
	
	Если Не ЗначениеЗаполнено(ЭтапРаботы) Тогда
		ТекущийЭтап = ПредопределенноеЗначение("Справочник.ЭтапыРаботыСКандидатами.ПустаяСсылка");
	Иначе
		ТекущийЭтап = ЭтапРаботы;
	КонецЕсли;
	
	РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.ЗаписатьЦвета(ТекущийЭтап,
		ЦветТекста, ЦветФона);
	
КонецПроцедуры

#КонецОбласти
