////////////////////////////////////////////////////////////////////////////////
// Подсистема "Адаптация и увольнение".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриНачальномЗаполненииДанныхПодсистемыУведомлений");
	Методы.Вставить("ЗаполнитьЗаданияАдаптацииУвольнения");
	Методы.Вставить("ЗаполнитьВидыСдвигаСроков");
	Методы.Вставить("ОбновлениеЗаданийАдаптацииУвольнения", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.МероприятияАдаптацииУвольнения.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "АдаптацияУвольнение.ПриНачальномЗаполненииДанныхПодсистемыУведомлений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b87fdf54-42e5-4b64-8ded-87a10063ba8e");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных системы уведомлений: адаптация, увольнение.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "АдаптацияУвольнение.ЗаполнитьВидыСдвигаСроков";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a8215866-2085-11ec-8386-da3766edb0ef");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение видов сдвига срока в мероприятиях адаптации и увольнения'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "АдаптацияУвольнение.ЗаполнитьЗаданияАдаптацииУвольнения";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a216de8e-2aa5-11ec-8393-b0edefb80173");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение новый заданий адаптации и увольнения'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийОбъектаОснования

Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	УникальныеЗначения = Новый Соответствие;
	
	Мероприятия = ДокументОбъект.МероприятияАдаптацииУвольнения.ВыгрузитьКолонку("Мероприятие");
	ЛичныеМероприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Мероприятия, "ИсполняетсяСотрудником");
	
	Для Каждого ДанныеМероприятия Из ДокументОбъект.МероприятияАдаптацииУвольнения Цикл
		ИндексСтроки = ДокументОбъект.МероприятияАдаптацииУвольнения.Индекс(ДанныеМероприятия);
		
		// Проверка мероприятия.
		Если Не ЗначениеЗаполнено(ДанныеМероприятия.Мероприятие) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Не указано мероприятие.'"),
				ДокументОбъект, 
				СтрШаблон("МероприятияАдаптацииУвольнения[%1].Мероприятие", Формат(ИндексСтроки, "ЧН=0; ЧГ=0")),, Отказ);
		ИначеЕсли УникальныеЗначения.Получить(ДанныеМероприятия.Мероприятие) = Истина Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Информация о мероприятии ""%1"" была введена в документе ранее.'"), ДанныеМероприятия.Мероприятие),
				ДокументОбъект, 
				СтрШаблон("МероприятияАдаптацииУвольнения[%1].Мероприятие", Формат(ИндексСтроки, "ЧН=0; ЧГ=0")),, Отказ);
		Иначе
			УникальныеЗначения.Вставить(ДанныеМероприятия.Мероприятие, Истина);
		КонецЕсли;
		
		// Проверка исполнителя.
		Если Не ЗначениеЗаполнено(ДанныеМероприятия.Исполнитель) Тогда
			Отказ = Истина;
			СообщитьОбОшибкеИсполнителяВСтроке(ДокументОбъект, ДанныеМероприятия, ИндексСтроки, ЛичныеМероприятия);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеМероприятийАдаптацииВРешенииОПриеме(ДокументОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Документы.РешениеОПриемеНаРаботу.ТабличныеЧасти.МероприятияАдаптацииУвольнения) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(ДокументОбъект, Отказ) Экспорт
	
	Если ДокументОбъект.ПометкаУдаления
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаЗаданийПоДокументу(ДокументОбъект.Ссылка);
	
	Пока Выборка.Следующий() Цикл
		
		БизнесПроцессОбъект = Выборка.Задание.ПолучитьОбъект();
		БизнесПроцессОбъект.Заблокировать();
		
		Если БизнесПроцессОбъект.Стартован Тогда 
			Если Не БизнесПроцессОбъект.Завершен Тогда
				БизнесПроцессОбъект.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Остановлен");
				БизнесПроцессОбъект.Записать();
			КонецЕсли;
		Иначе
			БизнесПроцессыИЗадачиСервер.ОтключитьОтложенныйСтартПроцесса(БизнесПроцессОбъект.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(ДокументОбъект, Отказ) Экспорт
	
	Если Не ДокументОбъект.ПометкаУдаления 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ВыборкаЗаданийПоДокументу(ДокументОбъект.Ссылка);
	
	Пока Выборка.Следующий() Цикл
		ПометитьНаУдалениеЗаданиеАдаптацииУвольнения(Выборка.Задание);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Заполняет наборы записей регистра МероприятияАдаптацииУвольненияПоДокументу.
// Параметры:
//	Движения - коллекция движений регистратора.
//	ДанныеМероприятийАдаптацииУвольнения - ТаблицаЗначений - таблица с колонками:
//		* ДокументОснование
//		* Мероприятие
//		* Сотрудник
//		* ДатаНачала
//		* ДатаОкончания
//		* ДатаОкончания
//
Процедура СформироватьДвиженияМероприятияАдаптацииУвольненияПоДокументу(Движения, ДанныеМероприятийАдаптацииУвольнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеМероприятийАдаптацииУвольнения)Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из ДанныеМероприятийАдаптацииУвольнения Цикл
		ЗаполнитьЗначенияСвойств(Движения.МероприятияАдаптацииУвольненияПоДокументу.Добавить(), СтрокаДанных);
	КонецЦикла;
	
	Движения.МероприятияАдаптацииУвольненияПоДокументу.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗарегистрироватьДокументДляОбновленияЗаданийАдаптацииУвольнения(Движения) Экспорт
	
	СтрокаДвижений = Движения.ОбновлениеЗаданийАдаптацииУвольнения.Добавить();
	СтрокаДвижений.ДокументОснование = Движения.ОбновлениеЗаданийАдаптацииУвольнения.Отбор.Регистратор.Значение;
	СтрокаДвижений.ЗаданияОбновлены = Ложь;
	
	Движения.ОбновлениеЗаданийАдаптацииУвольнения.Записывать = Истина;
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать КадровыеРешенияРасширенный.ОбработкаЗаполненияКадровогоПриказа.
Процедура ОбработкаЗаполненияКадровогоПриказа(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыеРешения") Тогда
		МодульКадровыеРешенияРасширенный = ОбщегоНазначения.ОбщийМодуль("КадровыеРешенияРасширенный");
		МодульКадровыеРешенияРасширенный.ОбработкаЗаполненияКадровогоПриказа(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать КадровыеРешения.СвязанныйСРешениемПриказ.
// 
// Параметры:
//  Решение - см. КадровыеРешения.СвязанныйСРешениемПриказ
// 
// Возвращаемое значение:
//  Неопределено, Произвольный - Связанный с решением приказ
Функция СвязанныйСРешениемПриказ(Решение) Экспорт
	
	Возврат КадровыеРешения.СвязанныйСРешениемПриказ(Решение);;
	
КонецФункции

#КонецОбласти

#Область ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ОбновлениеЗаданийАдаптацииУвольнения.Имя);
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеЗаданийАдаптацииУвольнения.ИмяМетода);
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, 
		"d42dbef6-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.МероприятияАдаптацииУвольнения);
КонецПроцедуры

#КонецОбласти

#Область Уведомления

// Процедура выполняет начальное заполнение данных подсистемы уведомлений
//
Процедура ПриНачальномЗаполненииДанныхПодсистемыУведомлений(ПараметрыОбновления = Неопределено) Экспорт
	
	ПриНачальномЗаполненииЗадачаИсполнителя();
	ПриНачальномЗаполненииОкончаниеИспытательногоСрока();
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура позволяет дополнить структуру видов уведомлений своими видами уведомлений. 
//
// Параметры:
//  СтруктураДоступныхВидовУведомлений - структура - перечень уведомлений, подключенных в подсистеме
//     * Ключ - Строка - Имя вида уведомления
//     * Значение - Структура - Описание вида уведомления (Структура)
//        * ВидУведомления - Строка, строковый идентификатор вида уведомления.
//        * Описание - Строка, Текстовое описание получаемых данных. Доступно пользователю в справочнике Видов уведомлений.
//        * Инициализация - Строка, <ИмяМодуля>.<ИмяПроцедуры> описывающей данные вида уведомления без выполнения
//                          запросов к базе данных.
//        * ПолучениеДанных - Строка, <ИмяМодуля>.<ИмяПроцедуры> выполняемой для получения данных уведомления.
//
Процедура ПриЗаполненииСпискаВидовУведомлений(СтруктураДоступныхВидовУведомлений) Экспорт
	
	// Создание новой задачи
	СтруктураЗадачиИсполнителя = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	СтруктураЗадачиИсполнителя.ВидУведомления = НСтр("ru = 'Формирование нового задания адаптации увольнения'");
	СтруктураЗадачиИсполнителя.GUID = "203f4740-034a-44ec-946a-5077a240d0b3";
	СтруктураЗадачиИсполнителя.Описание = НСтр("ru = 'Срабатывает при создании нового задания адаптации увольнения.'");
	СтруктураЗадачиИсполнителя.Инициализация = "АдаптацияУвольнение.ИнициализацияЗадачаИсполнителя";
	СтруктураЗадачиИсполнителя.КатегорияСобытия = Перечисления.КатегорииВидовУведомлений.ИзменениеОбъекта;
	
	СтруктураДоступныхВидовУведомлений.Вставить("ЗадачаИсполнителя", СтруктураЗадачиИсполнителя);
	
	// Окончание испытательного срока
	СтруктураОкончаниеИспытательногоСрока = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	СтруктураОкончаниеИспытательногоСрока.ВидУведомления = НСтр("ru = 'Окончание испытательного срока'");
	СтруктураОкончаниеИспытательногоСрока.GUID = "921166e9-7a14-11ec-83fa-bd5234e4af55";
	СтруктураОкончаниеИспытательногоСрока.Описание = НСтр("ru = 'Привязано к дате окончания испытательного срока сотрудником.'");
	СтруктураОкончаниеИспытательногоСрока.Инициализация = "АдаптацияУвольнение.ИнициализацияОкончаниеИспытательногоСрока";
	СтруктураОкончаниеИспытательногоСрока.ПолучениеДанных = "АдаптацияУвольнение.ПолучениеДанныхОкончаниеИспытательногоСрока";
	
	СтруктураДоступныхВидовУведомлений.Вставить("ОкончаниеИспытательногоСрока", СтруктураОкончаниеИспытательногоСрока);
	
КонецПроцедуры

// Позволяет переопределить имя типа шаблона сообщений по виду уведомления
//
// Параметры:
//   ИмяТипаШаблонаСообщений - Строка - имя типа предмета шаблона, которое необходимо переопределить
//   ВидУведомления - СправочникСсылка.ВидУведомления - связанный вид уведомления
Процедура ПриОпределенииИмениТипаШаблонаСообщений(ИмяТипаШаблонаСообщений, ВидУведомления) Экспорт
	
	Если ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ЗадачаИсполнителя") Тогда
		ИмяТипаШаблонаСообщений = "Справочник.ФизическиеЛица";
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при подготовке шаблонов сообщений и позволяет заполнить поля, доступные для шаблона
//  соответствующего вида уведомлений.
//
// Параметры:
//  ВидУведомления           - СправочникСсылка.ВидУведомления - вид уведомления - владелец шаблона
//  Реквизиты                - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//                                      и др.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  НазначениеШаблона        - Строка  - Имя назначения шаблон сообщения.
//  ДополнительныеПараметры  - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщенияПоУведомлению(ВидУведомления, Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	
	Если ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ЗадачаИсполнителя") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Дата", НСтр("ru='Дата задачи'"), Новый ОписаниеТипов("Дата"), "ДФ=dd.MM.yyyy");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Наименование", НСтр("ru='Наименование'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Описание", НСтр("ru='Описание задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Исполнитель", НСтр("ru='Исполнитель задачи'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Автор", НСтр("ru='Автор задачи'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СрокИсполнения", НСтр("ru='Срок исполнения'"), Новый ОписаниеТипов("Дата"), "ДФ=dd.MM.yyyy HH:mm");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ПредметСтрокой", НСтр("ru='Предмет'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Сотрудник", НСтр("ru='Сотрудник'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Подразделение", НСтр("ru='Подразделение'"), Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Должность", НСтр("ru='Должность'"), Новый ОписаниеТипов("СправочникСсылка.Должности"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Руководитель", НСтр("ru='Руководитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ИначеЕсли ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ОкончаниеИспытательногоСрока") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаЗавершенияПредставление",
			НСтр("ru = 'Дата завершения испытательного срока'"), Новый ОписаниеТипов("Дата"), "ДЛФ=D");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Организация",
			НСтр("ru = 'Организация'"), Новый ОписаниеТипов("СправочникСсылка.Организации"));
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при подготовке шаблона сообщения и позволяет установить предмет 
// сообщения, отличный от предмета уведомления.
//
// Параметры:
//  СтрокаСообщения	 - СтрокаТЗ - строка данных уведомления, источник данных для переопределения предмета.
//  Предмет			 - ДокументСсылка, СправочникСсылка - предмет сообщения, который можно переопределить.
//
Процедура ПриОпределенииПредметаШаблонаСообщения(СтрокаСообщения, Предмет) Экспорт
	
	Если СтрокаСообщения.ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ЗадачаИсполнителя") Тогда
		Предмет = СтрокаСообщения.ПараметрыСобытия.Получить().Исполнитель;
	КонецЕсли;
	
КонецПроцедуры

// Процедура позволяет переопределить стандартную обработку заполнения прошлого состояния объекта
// и установить свою.
//
// Параметры:
//   Объект                - ДокументОбъект, СправочникОбъект  - источник события - изменившийся объект.
//   СтандартнаяОбработка  - Булево                            - признак стандартной обработки.
//
Процедура ПередЗаписьюПредметаУведомленияОбИзменениях(Объект, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
		Объект.ДополнительныеСвойства.Вставить("ЭтоНоваяЗадача", Объект.Ссылка.Пустая());
	КонецЕсли;
	
КонецПроцедуры

// Процедура позволяет переопределить стандартную обработку события При записи объекта
// и установить свою.
//
// Параметры:
//   Объект                 - ДокументОбъект, СправочникОбъект  - источник события - изменившийся объект.
//   ЕстьРассылки           - Булево                            - признак наличия активных рассылок\
//   ДополнительныеСвойства - Структура                         - перечень параметров, сохраненных перед записью объекта.
//   СтандартнаяОбработка   - Булево                            - признак стандартной обработки.
//
Процедура ПриЗаписиПредметаУведомленияОбИзменениях(Объект, ЕстьРассылки, ДополнительныеСвойства, СтандартнаяОбработка, ВыполнятьПерезаписьПриНаличииВРегистре = Ложь) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
		Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.РешениеОбУвольнении")
			ИЛИ ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.РешениеОКадровомПереводе")
			ИЛИ ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
			Исполнитель = Объект.Исполнитель;
			Если ЗначениеЗаполнено(Исполнитель) Тогда
				Исполнитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Исполнитель, "ФизическоеЛицо");
			КонецЕсли;
			ДополнительныеСвойства.Вставить("Исполнитель", Исполнитель);
			ДополнительныеСвойства.Вставить("Дата", Объект.Дата);
			ДополнительныеСвойства.Вставить("Наименование", Объект.Наименование);
			ДополнительныеСвойства.Вставить("Описание", Объект.Описание);
			ДополнительныеСвойства.Вставить("Автор", Объект.Автор);
			ДополнительныеСвойства.Вставить("СрокИсполнения", Объект.СрокИсполнения);
			ДополнительныеСвойства.Вставить("ПредметСтрокой", Объект.ПредметСтрокой);
			ТекущаяДатаСеанса = ТекущаяДатаСеанса();
			Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.РешениеОПриемеНаРаботу") Тогда
				РеквизитыПредмета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					Объект.Предмет, "Кандидат,Подразделение,Должность,ДолжностьПоШтатномуРасписанию", Истина);
				ФизическоеЛицо = Документы.РешениеОПриемеНаРаботу.НайтиФизическоеЛицо(
					Объект.Предмет, РеквизитыПредмета.Кандидат);
				ДополнительныеСвойства.Вставить("Сотрудник", ФизическоеЛицо);
				ДополнительныеСвойства.Вставить("ДолжностьПоШтатномуРасписанию", РеквизитыПредмета.ДолжностьПоШтатномуРасписанию);
				ДополнительныеСвойства.Вставить("Подразделение", РеквизитыПредмета.Подразделение);
				ДополнительныеСвойства.Вставить("Должность", РеквизитыПредмета.Должность);
				ДополнительныеСвойства.Вставить("Руководитель", ФизическоеЛицоРуководитель(
					РеквизитыПредмета.Подразделение, РеквизитыПредмета.ДолжностьПоШтатномуРасписанию, ТекущаяДатаСеанса));
			Иначе
				РеквизитыПредмета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Предмет, "ФизическоеЛицо,Сотрудник", Истина);
				ДополнительныеСвойства.Вставить("Сотрудник", РеквизитыПредмета.ФизическоеЛицо);
				КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Истина, РеквизитыПредмета.Сотрудник,
					"Подразделение,Должность,ДолжностьПоШтатномуРасписанию", ТекущаяДатаСеанса);
				ДополнительныеСвойства.Вставить("ДолжностьПоШтатномуРасписанию", КадровыеДанные.ДолжностьПоШтатномуРасписанию);
				ДополнительныеСвойства.Вставить("Подразделение", КадровыеДанные.Подразделение);
				ДополнительныеСвойства.Вставить("Руководитель", ФизическоеЛицоРуководитель(
					КадровыеДанные.Подразделение, КадровыеДанные.ДолжностьПоШтатномуРасписанию, ТекущаяДатаСеанса));
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при формировании таблицы уведомлений по рассылкам типа "Изменение объекта"
//
// Параметры:
//    РассылкаУведомлений - СправочникСсылка.РассылкаУведомлений - обрабатываемая рассылка уведомлений.
//    ВидУведомления - СправочникСсылка.ВидыУведомлений - обрабатываемый вид уведомления
//    Предмет - СправочникСсылка, ДокументСсылка - ссылка на изменившийся объекта
//    ДатаИзменения - Дата - дата регистрации события изменения объекта.
//    ДополнительныеСвойства - Структура - Дополнительные свойства, которые были заполнены при регистрации изменения объекта
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПриСозданииУведомленийПоИзменениямОбъектов(РассылкаУведомлений, ВидУведомления, Предмет, ДатаИзменения, ДополнительныеСвойства, ТаблицаРезультата) Экспорт
	
	ИмяВидаУведомления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидУведомления, "Имя");
	ТаблицаРезультата.Очистить();
	
	Если ИмяВидаУведомления = "ЗадачаИсполнителя" Тогда
		ЭтоНоваяЗадача = Неопределено;
		Отборы = РассылкаУведомлений.Отбор.Получить();
		ОтборПройден = ОтборПоЗадачеПройден(Предмет, Отборы);
		Если ДополнительныеСвойства.Свойство("ЭтоНоваяЗадача", ЭтоНоваяЗадача)
			И ЭтоНоваяЗадача
			И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предмет, "ПометкаУдаления")
			И ОтборПройден Тогда
			СтрокаРезультата = ТаблицаРезультата.Добавить();
			СтрокаРезультата.Предмет = Предмет;
			СтрокаРезультата.ДатаСобытия = ДатаИзменения;
			СтрокаРезультата.ПараметрыСобытия = Новый ХранилищеЗначения(ДополнительныеСвойства);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Назначено собеседование"
// 
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияЗадачаИсполнителя(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("ЗадачаСсылка.ЗадачаИсполнителя");
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Исполнитель", НСтр("ru='Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Руководитель", НСтр("ru = 'Руководитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Сотрудник", НСтр("ru='Сотрудник'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Мероприятие", НСтр("ru = 'Мероприятие'"), Новый ОписаниеТипов("СправочникСсылка.МероприятияАдаптацииУвольнения"));
	
КонецПроцедуры

Процедура ИнициализацияОкончаниеИспытательногоСрока(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru = 'Сотрудник'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Руководитель", НСтр("ru = 'Руководитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Ответственный", НСтр("ru = 'Ответственный за кандидата'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Заявитель", НСтр("ru = 'Заявитель вакансии'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Организация", НСтр("ru = 'Организация'"), Новый ОписаниеТипов("СправочникСсылка.Организации"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ФизическоеЛицо", НСтр("ru = 'Сотрудник'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
КонецПроцедуры

Процедура ПолучениеДанныхОкончаниеИспытательногоСрока(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.НачалоПериода = СтруктураПериода.НачалоПериода;
	ПараметрыПолучения.ОкончаниеПериода = СтруктураПериода.ОкончаниеПериода;
	ПараметрыПолучения.КадровыеДанные =
		"ФизическоеЛицо, Сотрудник, Организация, Подразделение, Должность, ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия";
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Ложь, ПараметрыПолучения);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИспытательныйСрок.Сотрудник КАК Сотрудник,
		|	ИспытательныйСрок.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИспытательныйСрок.ДатаЗавершения КАК ДатаЗавершения,
		|	ИспытательныйСрок.Организация КАК Организация,
		|	ЕСТЬNULL(КадровыеДанные.ДолжностьПоШтатномуРасписанию, ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)) КАК Позиция,
		|	ЕСТЬNULL(КадровыеДанные.МестоВСтруктуреПредприятия, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоВСтруктуреПредприятия
		|ИЗ
		|	РегистрСведений.ИспытательныйСрокСотрудников КАК ИспытательныйСрок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК КадровыеДанные
		|		ПО ИспытательныйСрок.ФизическоеЛицо = КадровыеДанные.ФизическоеЛицо
		|			И ИспытательныйСрок.Организация = КадровыеДанные.Организация
		|			И ИспытательныйСрок.Сотрудник = КадровыеДанные.Сотрудник
		|ГДЕ
		|	ИспытательныйСрок.ДатаЗавершения МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(ТаблицаДанных.ВыгрузитьКолонку("Сотрудник"));
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		ПараметрыСобытия = Новый Структура("ДатаЗавершенияПредставление", Формат(Строка.ДатаЗавершения, "ДЛФ=D"));
		ПараметрыСобытия.Вставить("Ответственный", Справочники.ФизическиеЛица.ПустаяСсылка());
		ПараметрыСобытия.Вставить("Заявитель", Справочники.ФизическиеЛица.ПустаяСсылка());
		ПараметрыСобытия.Вставить("Руководитель", ФизическоеЛицоРуководитель(Строка.МестоВСтруктуреПредприятия, 
			Строка.Позиция, СтруктураПериода.ОкончаниеПериода));
		
		КандидатСотрудника = КандидатыПоСотрудникам.Найти(Строка.Сотрудник, "Сотрудник");
		Если КандидатСотрудника <> Неопределено Тогда
			ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(КандидатСотрудника.Кандидат);
			Если ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
				ПараметрыСобытия.Вставить("Ответственный", ДанныеКандидата.Вакансия.Ответственный);
				ПараметрыСобытия.Вставить("Заявитель", ДанныеКандидата.Вакансия.Заявитель);
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаРезультата.Добавить();
		СтрокаТаблицы.Предмет = Строка.ФизическоеЛицо;
		СтрокаТаблицы.ДатаСобытия = Строка.ДатаЗавершения;
		СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РазделыДанных

// Добавляет разделы в таблицу разделов данных.
// 
// Параметры:
//  РазделыДанных - ТаблицаЗначений - см. СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ТаблицаВсехРазделовДанных
Процедура ПриДобавленииРазделовДанных(РазделыДанных) Экспорт
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "АдаптацияУвольнение",
		"Адаптация, увольнение", "ПодборПерсонала", , "АдаптацияУвольнение.ПриДобавленииРазделовДанных");
	
КонецПроцедуры

// Возвращает разделы данных объектов подсистемы.
// 
// Возвращаемое значение:
//  Массив из Строка - Разделы данных объектов подсистемы
Функция РазделыДанныхОбъектовПодсистемы() Экспорт
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ПодборПерсонала);
КонецФункции

#КонецОбласти

Процедура ЗаполнитьВидыСдвигаСроков(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МероприятияАдаптацииУвольнения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения
	|ГДЕ
	|	(МероприятияАдаптацииУвольнения.ВидСдвигаСрокаНачалаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыСдвигаСрока.ПустаяСсылка)
	|			ИЛИ МероприятияАдаптацииУвольнения.ВидСдвигаСрокаОкончанияИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыСдвигаСрока.ПустаяСсылка))");
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МероприятиеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		МероприятиеОбъект.ВидСдвигаСрокаНачалаИсполнения = ПредопределенноеЗначение("Перечисление.ВидыСдвигаСрока.День");
		МероприятиеОбъект.ВидСдвигаСрокаОкончанияИсполнения = ПредопределенноеЗначение("Перечисление.ВидыСдвигаСрока.День");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(МероприятиеОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗаданияАдаптацииУвольнения(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеЗавершено = Истина;
	
	НачатьТранзакцию();
	Попытка
		ВыполнитьОбработкуЗаданийАдаптацииУвольнения(ОбновлениеЗавершено);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление заданий адаптации и увольнения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбновлениеЗавершено = Ложь;
	КонецПопытки;
		
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = ОбновлениеЗавершено;
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользуетсяАдаптацияУвольнение() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьАдаптациюУвольнение");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СотрудникиНаАдаптацииУвольняемые);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СотрудникиНаАдаптацииУвольняемые, "АдаптацияУвольнение");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьАдаптациюУвольнение");
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбновлениеЗаданийАдаптацииУвольнения;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьАдаптациюУвольнение;
	
КонецПроцедуры

Процедура ОбновлениеЗаданийАдаптацииУвольнения(ПараметрыОбновления = Неопределено, АдресВоВременномХранилище = Неопределено) Экспорт
	
	ДокументОснование = Неопределено;
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.Свойство("ДокументОснование", ДокументОснование);
	Иначе
		ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеЗаданийАдаптацииУвольнения);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование КАК ДокументОснование,
		|	ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование.Организация КАК Организация,
		|	ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ОбновлениеЗаданийАдаптацииУвольнения КАК ОбновлениеЗаданийАдаптацииУвольнения
		|ГДЕ
		|	НЕ ОбновлениеЗаданийАдаптацииУвольнения.ЗаданияОбновлены
		|	И ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование = &ДокументОснование";
	
	Если ДокументОснование = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование = &ДокументОснование", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ДокументОснование", Выборка.ДокументОснование);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование КАК ДокументОснование
			|ПОМЕСТИТЬ ВТОснованияЗаданий
			|ИЗ
			|	РегистрСведений.ОбновлениеЗаданийАдаптацииУвольнения КАК ОбновлениеЗаданийАдаптацииУвольнения
			|ГДЕ
			|	НЕ ОбновлениеЗаданийАдаптацииУвольнения.ЗаданияОбновлены
			|	И ОбновлениеЗаданийАдаптацииУвольнения.ДокументОснование = &ДокументОснование
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОснованияЗаданий.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	ВТОснованияЗаданий КАК ВТОснованияЗаданий";
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеЗаданийАдаптацииУвольнения.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.ДокументОснование);
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.МероприятияАдаптацииУвольненияПоДокументу.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.ДокументОснование);
			Блокировка.Заблокировать();
			ОбновитьЗаданияАдаптацииУвольненияПоДокументу(Выборка, Запрос, ПараметрыОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Обновление заданий адаптации и увольнения'", ОбщегоНазначения.КодОсновногоЯзыка()), 
				УровеньЖурналаРегистрации.Ошибка, , , 
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗаданияАдаптацииУвольненияПоДокументу(Знач Выборка, Знач Запрос, ПараметрыОбновления)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МероприятияПоДокументу.ДокументОснование КАК ДокументОснование,
		|	МероприятияПоДокументу.Мероприятие КАК Мероприятие,
		|	МероприятияПоДокументу.Сотрудник КАК Сотрудник,
		|	МероприятияПоДокументу.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МероприятияПоДокументу.ДатаНачала КАК ДатаНачала,
		|	МероприятияПоДокументу.ДатаОкончания КАК ДатаОкончания,
		|	МероприятияПоДокументу.Исполнитель КАК Исполнитель
		|ПОМЕСТИТЬ ВТАктуальныеМероприятия
		|ИЗ
		|	РегистрСведений.МероприятияАдаптацииУвольненияПоДокументу КАК МероприятияПоДокументу
		|ГДЕ
		|	МероприятияПоДокументу.ДокументОснование В
		|			(ВЫБРАТЬ
		|				ОснованияЗаданий.ДокументОснование
		|			ИЗ
		|				ВТОснованияЗаданий КАК ОснованияЗаданий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задания.Предмет КАК ДокументОснование,
		|	Задания.Мероприятие КАК Мероприятие,
		|	Задания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Задания.Ссылка КАК Задание,
		|	Задания.Дата КАК ДатаНачала,
		|	Задания.СрокИсполнения КАК ДатаОкончания,
		|	Задания.Исполнитель КАК Исполнитель,
		|	Задания.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТТекущиеМероприятия
		|ИЗ
		|	БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК Задания
		|ГДЕ
		|	Задания.Предмет В
		|			(ВЫБРАТЬ
		|				ОснованияЗаданий.ДокументОснование
		|			ИЗ
		|				ВТОснованияЗаданий КАК ОснованияЗаданий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМероприятия.Сотрудник КАК Сотрудник,
		|	АктуальныеМероприятия.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АктуальныеМероприятия.ФизическоеЛицо.ФИО КАК ФИО,
		|	АктуальныеМероприятия.ФизическоеЛицо.Код КАК Код,
		|	АктуальныеМероприятия.Мероприятие КАК Мероприятие,
		|	АктуальныеМероприятия.ДатаНачала КАК ДатаНачала,
		|	АктуальныеМероприятия.ДатаОкончания КАК ДатаОкончания,
		|	АктуальныеМероприятия.Исполнитель КАК Исполнитель,
		|	Мероприятия.Наименование КАК Наименование,
		|	Мероприятия.Описание КАК Описание,
		|	ВЫБОР
		|		КОГДА АктуальныеМероприятия.Исполнитель = Мероприятия.Исполнитель
		|			ТОГДА Мероприятия.ОсновнойОбъектАдресации
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ОсновнойОбъектАдресации,
		|	ВЫБОР
		|		КОГДА АктуальныеМероприятия.Исполнитель = Мероприятия.Исполнитель
		|			ТОГДА Мероприятия.ДополнительныйОбъектАдресации
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДополнительныйОбъектАдресации,
		|	ЕСТЬNULL(Сотрудники.Код, """") КАК ТабНомер
		|ИЗ
		|	ВТАктуальныеМероприятия КАК АктуальныеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущиеМероприятия КАК ТекущиеМероприятия
		|		ПО АктуальныеМероприятия.ДокументОснование = ТекущиеМероприятия.ДокументОснование
		|			И АктуальныеМероприятия.Мероприятие = ТекущиеМероприятия.Мероприятие
		|			И АктуальныеМероприятия.ФизическоеЛицо = ТекущиеМероприятия.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МероприятияАдаптацииУвольнения КАК Мероприятия
		|		ПО АктуальныеМероприятия.Мероприятие = Мероприятия.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО АктуальныеМероприятия.Сотрудник = Сотрудники.Ссылка
		|ГДЕ
		|	ТекущиеМероприятия.ФизическоеЛицо ЕСТЬ NULL
		|ИТОГИ
		|	МАКСИМУМ(ФИО),
		|	МАКСИМУМ(Код),
		|	МАКСИМУМ(ТабНомер)
		|ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктуальныеМероприятия.Сотрудник КАК Сотрудник,
		|	АктуальныеМероприятия.ФизическоеЛицо КАК ФизическоеЛицо,
		|	АктуальныеМероприятия.Мероприятие КАК Мероприятие,
		|	АктуальныеМероприятия.ДатаНачала КАК ДатаНачала,
		|	АктуальныеМероприятия.ДатаОкончания КАК ДатаОкончания,
		|	АктуальныеМероприятия.Исполнитель КАК Исполнитель,
		|	ТекущиеМероприятия.Исполнитель КАК ТекущийИсполнитель,
		|	ТекущиеМероприятия.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА АктуальныеМероприятия.ДатаОкончания <> ТекущиеМероприятия.ДатаОкончания
		|				ИЛИ АктуальныеМероприятия.Исполнитель <> ТекущиеМероприятия.Исполнитель
		|				ИЛИ Задания.ПометкаУдаления
		|				ИЛИ Задания.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияБизнесПроцессов.Остановлен)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОбновитьБизнесПроцесс,
		|	Задания.Стартован КАК ПроцессСтартован,
		|	ВЫБОР
		|		КОГДА АктуальныеМероприятия.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				И (АктуальныеМероприятия.ДатаНачала <> ТекущиеМероприятия.ДатаНачала
		|					ИЛИ ПроцессыДляЗапуска.Владелец ЕСТЬ NULL)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НастроитьОтложенныйСтарт,
		|	ВЫБОР
		|		КОГДА АктуальныеМероприятия.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|				И НЕ ПроцессыДляЗапуска.Владелец ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтключитьОтложенныйСтарт
		|ИЗ
		|	ВТАктуальныеМероприятия КАК АктуальныеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущиеМероприятия КАК ТекущиеМероприятия
		|			ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК Задания
		|			ПО ТекущиеМероприятия.Задание = Задания.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПроцессыДляЗапуска КАК ПроцессыДляЗапуска
		|			ПО ТекущиеМероприятия.Задание = ПроцессыДляЗапуска.Владелец
		|		ПО АктуальныеМероприятия.ДокументОснование = ТекущиеМероприятия.ДокументОснование
		|			И АктуальныеМероприятия.ФизическоеЛицо = ТекущиеМероприятия.ФизическоеЛицо
		|			И АктуальныеМероприятия.Мероприятие = ТекущиеМероприятия.Мероприятие
		|ГДЕ
		|	НЕ ТекущиеМероприятия.Сотрудник ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущиеМероприятия.Задание КАК Задание,
		|	ТекущиеМероприятия.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТекущиеМероприятия.Мероприятие КАК Мероприятие
		|ИЗ
		|	ВТТекущиеМероприятия КАК ТекущиеМероприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеМероприятия КАК АктуальныеМероприятия
		|		ПО ТекущиеМероприятия.ДокументОснование = АктуальныеМероприятия.ДокументОснование
		|			И ТекущиеМероприятия.ФизическоеЛицо = АктуальныеМероприятия.ФизическоеЛицо
		|			И ТекущиеМероприятия.Мероприятие = АктуальныеМероприятия.Мероприятие
		|ГДЕ
		|	АктуальныеМероприятия.ФизическоеЛицо ЕСТЬ NULL";
	
	ТекущийДень = НачалоДня(ТекущаяДатаСеанса());
	Результаты = Запрос.ВыполнитьПакет();
	МаксИндекс = Результаты.ВГраница();
	
	Если Результаты[МаксИндекс - 2].Пустой()
		И Результаты[МаксИндекс - 1].Пустой()
		И Результаты[МаксИндекс].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВидСобытия = ВидСобытияАдаптацииУвольненияДокумента(Выборка.ДокументОснование);
	ПроцессыДляЗапуска = Новый Массив;

	ВыборкаДобавляемых = Результаты[МаксИндекс - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИзменяемых = Результаты[МаксИндекс - 1].Выбрать();
	ВыборкаПомечаемых = Результаты[МаксИндекс].Выбрать();
	
	Пока ВыборкаДобавляемых.Следующий() Цикл
		СтрокаСотрудник = НСтр("ru = 'ФИО: %1'", ОбщегоНазначения.КодОсновногоЯзыка());
		СтрокаКод = НСтр("ru = 'Код: %1'", ОбщегоНазначения.КодОсновногоЯзыка());
		СтрокаТабНомер = НСтр("ru = 'Таб. номер: %1'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(СтрШаблон(СтрокаСотрудник, ВыборкаДобавляемых.ФИО));
		МассивСтрок.Добавить(СтрШаблон(СтрокаКод, ВыборкаДобавляемых.Код));
		
		Если ЗначениеЗаполнено(ВыборкаДобавляемых.ТабНомер) Тогда
			МассивСтрок.Добавить(СтрШаблон(СтрокаТабНомер, ВыборкаДобавляемых.ТабНомер));
		КонецЕсли;
		
		ИнформацияПоСотруднику = СтрСоединить(МассивСтрок, Символы.ПС);
		
		ВыборкаЗаданий = ВыборкаДобавляемых.Выбрать();
		Пока ВыборкаЗаданий.Следующий() Цикл 
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(ИнформацияПоСотруднику);
			Если ЗначениеЗаполнено(ВыборкаЗаданий.Описание) Тогда
				МассивСтрок.Добавить("");
				МассивСтрок.Добавить(ВыборкаЗаданий.Описание);
			КонецЕсли;
			ПараметрыСоздания = Новый Структура;
			ПараметрыСоздания.Вставить("Дата", Выборка.Дата);
			ПараметрыСоздания.Вставить("Предмет", Выборка.ДокументОснование);
			ПараметрыСоздания.Вставить("Наименование", ВыборкаЗаданий.Наименование);
			ПараметрыСоздания.Вставить("Содержание", СтрСоединить(МассивСтрок, Символы.ПС));
			ПараметрыСоздания.Вставить("Исполнитель", ВыборкаЗаданий.Исполнитель);
			ПараметрыСоздания.Вставить("СрокИсполнения", ВыборкаЗаданий.ДатаОкончания);
			ПараметрыСоздания.Вставить("ОсновнойОбъектАдресации", ВыборкаЗаданий.ОсновнойОбъектАдресации);
			ПараметрыСоздания.Вставить("ДополнительныйОбъектАдресации", ВыборкаЗаданий.ДополнительныйОбъектАдресации);
			ПараметрыСоздания.Вставить("Мероприятие", ВыборкаЗаданий.Мероприятие);
			ПараметрыСоздания.Вставить("ФизическоеЛицо", ВыборкаЗаданий.ФизическоеЛицо);
			ПараметрыСоздания.Вставить("ВидСобытия", ВидСобытия);
			ПараметрыСоздания.Вставить("Организация", Выборка.Организация);
			ПараметрыСоздания.Вставить("Сотрудник", ВыборкаЗаданий.Сотрудник);
			БизнесПроцесс = СоздатьЗаданиеАдаптацииУвольнения(ПараметрыСоздания);
			Если Не ЗначениеЗаполнено(ВыборкаЗаданий.ДатаНачала)
				Или ТекущийДень >= ВыборкаЗаданий.ДатаНачала Тогда
				ПроцессыДляЗапуска.Добавить(БизнесПроцесс);
			Иначе
				БизнесПроцессыИЗадачиСервер.ДобавитьПроцессДляОтложенногоСтарта(БизнесПроцесс, ВыборкаЗаданий.ДатаНачала);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Пока ВыборкаИзменяемых.Следующий() Цикл
		БизнесПроцесс = ВыборкаИзменяемых.Задание;
		Если ВыборкаИзменяемых.ОбновитьБизнесПроцесс Тогда
			ПараметрыОбновления = Новый Структура;
			ПараметрыОбновления.Вставить("СрокИсполнения", ВыборкаИзменяемых.ДатаОкончания);
			Если ВыборкаИзменяемых.Исполнитель <> ВыборкаИзменяемых.ТекущийИсполнитель Тогда
				ПараметрыОбновления.Вставить("Исполнитель", ВыборкаИзменяемых.Исполнитель);
			КонецЕсли;
			ОбновитьЗаданиеАдаптацииУвольнения(БизнесПроцесс, ПараметрыОбновления);
		КонецЕсли;
		
		Если Не ВыборкаИзменяемых.ПроцессСтартован Тогда
			// Если ранее старт бизнес-процесса был отложен, но сейчас он обязателен, то отключаем отложенность,
			// и стартуем процесс после обновления набора записей регистра ЗаданияАдаптацииУвольнения.
			Если ВыборкаИзменяемых.ОтключитьОтложенныйСтарт Тогда
				БизнесПроцессыИЗадачиСервер.ОтключитьОтложенныйСтартПроцесса(БизнесПроцесс);
				ПроцессыДляЗапуска.Добавить(БизнесПроцесс);
			ИначеЕсли ВыборкаИзменяемых.НастроитьОтложенныйСтарт Тогда
				БизнесПроцессыИЗадачиСервер.ДобавитьПроцессДляОтложенногоСтарта(БизнесПроцесс, ВыборкаИзменяемых.ДатаНачала);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Пока ВыборкаПомечаемых.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаПомечаемых.Задание) Тогда
			ПометитьНаУдалениеЗаданиеАдаптацииУвольнения(ВыборкаПомечаемых.Задание);
		КонецЕсли;
	КонецЦикла;
	
	// Старт бизнес-процессов выполняется после обновления набора записей регистра ЗаданияАдаптацииУвольнения, 
	// чтобы при записи задач, их можно было дописать в уже существующие наборы.
	Для Каждого БизнесПроцесс Из ПроцессыДляЗапуска Цикл
		Если Не БизнесПроцесс.Стартован Тогда
			БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
			БизнесПроцессОбъект.Старт();
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ОбновлениеЗаданийАдаптацииУвольнения.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Выборка.ДокументОснование);
	НаборЗаписей.Прочитать();
	
	НаборЗаписей[0].ЗаданияОбновлены = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаданияАдаптацииУвольнения

Функция СоздатьЗаданиеАдаптацииУвольнения(Параметры)
	
	БизнесПроцессОбъект = БизнесПроцессы.ЗаданиеАдаптацииУвольнения.СоздатьБизнесПроцесс();
	ЗаполнитьЗначенияСвойств(БизнесПроцессОбъект, Параметры);
	БизнесПроцессОбъект.Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	БизнесПроцессОбъект.Автор = Параметры.Предмет.Ответственный;
	БизнесПроцессОбъект.Записать();
	
	Возврат БизнесПроцессОбъект.Ссылка;
	
КонецФункции

Процедура ОбновитьЗаданиеАдаптацииУвольнения(БизнесПроцесс, Параметры)
	
	БизнесПроцессОбъект = БизнесПроцесс.ПолучитьОбъект();
	БизнесПроцессОбъект.Заблокировать();
	
	ЗаполнитьЗначенияСвойств(БизнесПроцессОбъект, Параметры);
	БизнесПроцессОбъект.Состояние = Перечисления.СостоянияБизнесПроцессов.Активен;
	БизнесПроцессОбъект.ПометкаУдаления = Ложь;
	БизнесПроцессОбъект.Записать();
	
	ИзменитьРеквизитыНевыполненныхЗадач(БизнесПроцессОбъект.Ссылка, Параметры);
	
КонецПроцедуры

Процедура ПометитьНаУдалениеЗаданиеАдаптацииУвольнения(Задание)
	
	УстановитьПривилегированныйРежим(Истина);
	
	БизнесПроцессОбъект = Задание.ПолучитьОбъект();
	БизнесПроцессОбъект.Заблокировать();
	БизнесПроцессОбъект.ДополнительныеСвойства.Вставить("ПометкаОснованияЗадачАдаптацииУвольнения", Истина);
	БизнесПроцессОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

Функция ВыборкаЗаданийПоДокументу(ДокументСсылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаданиеАдаптацииУвольнения.Ссылка КАК Задание
	|ИЗ
	|	БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК ЗаданиеАдаптацииУвольнения
	|ГДЕ
	|	ЗаданиеАдаптацииУвольнения.Предмет = &Предмет");
	Запрос.УстановитьПараметр("Предмет", ДокументСсылка);
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать();
	
КонецФункции

Процедура ИзменитьРеквизитыНевыполненныхЗадач(БизнесПроцесс, Параметры)

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Задача.ЗадачаИсполнителя");
		ЭлементБлокировки.УстановитьЗначение("БизнесПроцесс", БизнесПроцесс);
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос( 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК Задачи
		|ГДЕ
		|	Задачи.БизнесПроцесс = &БизнесПроцесс
		|	И НЕ Задачи.ПометкаУдаления
		|	И НЕ Задачи.Выполнена");
		
		Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Задача = Выборка.Ссылка.ПолучитьОбъект();
			Задача.СрокИсполнения = Параметры.СрокИсполнения;
			
			Исполнитель = Неопределено;
			Если Параметры.Свойство("Исполнитель", Исполнитель) Тогда
				
				Если ТипЗнч(Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
					Задача.РольИсполнителя = Исполнитель;
					Задача.Исполнитель = Неопределено;
				Иначе
					Задача.Исполнитель = Исполнитель;
					Задача.РольИсполнителя = Неопределено;
				КонецЕсли;
				
				Задача.ОсновнойОбъектАдресации = Неопределено;
				Задача.ДополнительныйОбъектАдресации = Неопределено;
			
			КонецЕсли;
			
			Задача.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ВыполнитьОбработкуЗаданийАдаптацииУвольнения(ОбновлениеЗавершено)
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("РегистрСведений.УдалитьЗаданияАдаптацииУвольнения");
	Блокировка.Добавить("Задача.ЗадачаИсполнителя");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ЗаданияАдаптацииУвольнения.Задание КАК СтароеЗадание,
	|	ЗаданияАдаптацииУвольнения.ДокументОснование КАК ДокументОснование,
	|	ЗаданияАдаптацииУвольнения.Мероприятие КАК Мероприятие,
	|	ЗаданияАдаптацииУвольнения.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗаданияАдаптацииУвольнения.ДатаНачала КАК ДатаНачала,
	|	ЗаданияАдаптацииУвольнения.ЗадачаИсполнителя КАК ЗадачаИсполнителя,
	|	ЗаданияАдаптацииУвольнения.ВидСобытия КАК ВидСобытия,
	|	ЗаданияАдаптацииУвольнения.Организация КАК Организация,
	|	ЗаданияАдаптацииУвольнения.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТЗадания
	|ИЗ
	|	РегистрСведений.УдалитьЗаданияАдаптацииУвольнения КАК ЗаданияАдаптацииУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК ЗаданиеАдаптацииУвольнения
	|		ПО ЗаданияАдаптацииУвольнения.ДокументОснование = ЗаданиеАдаптацииУвольнения.Предмет
	|			И ЗаданияАдаптацииУвольнения.Мероприятие = ЗаданиеАдаптацииУвольнения.Мероприятие
	|ГДЕ
	|	ЗаданиеАдаптацииУвольнения.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачаИсполнителя.Ссылка КАК Задача,
	|	ЗадачаИсполнителя.БизнесПроцесс КАК СтароеЗадание,
	|	ЗадачаИсполнителя.Дата КАК Дата
	|ПОМЕСТИТЬ ВТЗадачиЗаданий
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.БизнесПроцесс В
	|			(ВЫБРАТЬ
	|				ВТЗадания.СтароеЗадание
	|			ИЗ
	|				ВТЗадания
	|			ГДЕ
	|				ВТЗадания.ЗадачаИсполнителя = ЗНАЧЕНИЕ(Задача.ЗадачаИсполнителя.ПустаяСсылка))
	|	И ЗадачаИсполнителя.ТочкаМаршрута = &ТочкаМаршрутаВыполнить
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадачиЗаданий.СтароеЗадание КАК СтароеЗадание,
	|	МАКСИМУМ(ВТЗадачиЗаданий.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТДатыЗадач
	|ИЗ
	|	ВТЗадачиЗаданий КАК ВТЗадачиЗаданий
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗадачиЗаданий.СтароеЗадание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДатыЗадач.СтароеЗадание КАК СтароеЗадание,
	|	ВТЗадачиЗаданий.Задача КАК Задача
	|ПОМЕСТИТЬ ВТСрезЗадач
	|ИЗ
	|	ВТДатыЗадач КАК ВТДатыЗадач
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадачиЗаданий КАК ВТЗадачиЗаданий
	|		ПО ВТДатыЗадач.СтароеЗадание = ВТЗадачиЗаданий.СтароеЗадание
	|			И ВТДатыЗадач.Дата = ВТЗадачиЗаданий.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадания.СтароеЗадание КАК СтароеЗадание,
	|	ВТЗадания.ДокументОснование КАК ДокументОснование,
	|	ВТЗадания.Мероприятие КАК Мероприятие,
	|	ВТЗадания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТЗадания.ДатаНачала КАК ДатаНачала,
	|	ВТЗадания.ВидСобытия КАК ВидСобытия,
	|	ВТЗадания.Организация КАК Организация,
	|	ВТЗадания.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА НЕ ВТСрезЗадач.Задача ЕСТЬ NULL
	|			ТОГДА ВТСрезЗадач.Задача
	|		ИНАЧЕ ВТЗадания.ЗадачаИсполнителя
	|	КОНЕЦ КАК СтараяЗадача,
	|	Задание.Стартован КАК Стартован,
	|	Задание.Состояние КАК Состояние
	|ИЗ
	|	ВТЗадания КАК ВТЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСрезЗадач КАК ВТСрезЗадач
	|		ПО ВТЗадания.СтароеЗадание = ВТСрезЗадач.СтароеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.Задание КАК Задание
	|		ПО ВТЗадания.СтароеЗадание = Задание.Ссылка");
	Запрос.УстановитьПараметр("ТочкаМаршрутаВыполнить", БизнесПроцессы.Задание.ТочкиМаршрута.Выполнить);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеЗавершено = Истина;
		Возврат;
	КонецЕсли;
	
	ОбновлениеЗавершено = Ложь;
	
	ЭлементБлокировки = Блокировка.Добавить("БизнесПроцесс.Задание");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "СтароеЗадание");
	Блокировка.Заблокировать();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Предметом задания и связанных с ним задач должен быть документ решения
		СтароеЗадание = Выборка.СтароеЗадание.ПолучитьОбъект();
		СтароеЗадание.Предмет = Выборка.ДокументОснование;
		
		// Скопируем все данные в новое задание
		НовоеЗадание = БизнесПроцессы.ЗаданиеАдаптацииУвольнения.СоздатьБизнесПроцесс();
		ЗаполнитьЗначенияСвойств(НовоеЗадание, СтароеЗадание);
		НовоеЗадание.Мероприятие = Выборка.Мероприятие;
		НовоеЗадание.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		НовоеЗадание.Предмет = Выборка.ДокументОснование;
		НовоеЗадание.ВидСобытия = Выборка.ВидСобытия;
		НовоеЗадание.Организация = Выборка.Организация;
		НовоеЗадание.Сотрудник = Выборка.Сотрудник;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовоеЗадание);
		
		Если Выборка.Стартован Тогда
			Если Не ЗначениеЗаполнено(Выборка.СтараяЗадача) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
			ЗаполнитьЗначенияСвойств(НоваяЗадача, Выборка.СтараяЗадача, , "БизнесПроцесс, ТочкаМаршрута");
			НоваяЗадача.БизнесПроцесс = НовоеЗадание.Ссылка;
			НоваяЗадача.ТочкаМаршрута = БизнесПроцессы.ЗаданиеАдаптацииУвольнения.ТочкиМаршрута.Выполнить;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НоваяЗадача);
			
			Если Не Выборка.СтараяЗадача.Выполнена Тогда
				// Выполним старую задачу чтобы она не попала к исполнителям
				Если СтароеЗадание.Состояние =
					ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Остановлен") Тогда
					БизнесПроцессыИЗадачиВызовСервера.СделатьАктивнымБизнесПроцесс(СтароеЗадание.Ссылка);
				КонецЕсли;
				БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(Выборка.СтараяЗадача);
			КонецЕсли;
			
			БизнесПроцессыИЗадачиСервер.УстановитьПометкуУдаленияЗадач(Выборка.СтароеЗадание, Истина);
			
		ИначеЕсли Выборка.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Активен") Тогда
			// Отключим отложенный старт старого задания, включим для нового
			БизнесПроцессыИЗадачиСервер.ОтключитьОтложенныйСтартПроцесса(СтароеЗадание.Ссылка);
			БизнесПроцессыИЗадачиСервер.ДобавитьПроцессДляОтложенногоСтарта(НовоеЗадание.Ссылка, Выборка.ДатаНачала);
			
			// Остановим старый процесс
			СтароеЗадание.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияБизнесПроцессов.Остановлен");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СтароеЗадание);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ВидыСобытийАдаптацииУвольнения

Функция ВидСобытияАдаптацииУвольненияДокумента(ДокументСсылка)
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументСсылка);
	Возврат Менеджер.ВидСобытияАдаптацииУвольнения();
	
КонецФункции

Функция СобытиеВозвратИзОтпускаПоУходуЗаРебенком() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.ВозвратИзОтпускаПоУходуЗаРебенком;
	
КонецФункции

Функция СобытиеВосстановлениеВДолжности() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.ВосстановлениеВДолжности;
	
КонецФункции

Функция СобытиеОтпускПоУходуЗаРебенком() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.ОтпускПоУходуЗаРебенком;
	
КонецФункции

Функция СобытиеПеремещение() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.Перемещение;
	
КонецФункции

Функция СобытиеПрием() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.Прием;
	
КонецФункции

Функция СобытиеУвольнение() Экспорт
	
	Возврат Перечисления.ВидыСобытийАдаптацииУвольнения.Увольнение;
	
КонецФункции

#КонецОбласти

Функция ПараметрыЗаполненияМероприятий() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация");
	ПараметрыЗаполнения.Вставить("Сотрудник", Справочники.Сотрудники.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ФизическоеЛицо", Справочники.ФизическиеЛица.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Позиция");
	ПараметрыЗаполнения.Вставить("Подразделение");
	ПараметрыЗаполнения.Вставить("Должность");
	ПараметрыЗаполнения.Вставить("ВидСобытия");
	ПараметрыЗаполнения.Вставить("ВидМероприятия");
	ПараметрыЗаполнения.Вставить("Ответственный");
	ПараметрыЗаполнения.Вставить("ДатаСобытия", '00010101');
	ПараметрыЗаполнения.Вставить("ДатаОкончанияСобытия", '00010101');
	ПараметрыЗаполнения.Вставить("ПредыдущаяОрганизация");
	ПараметрыЗаполнения.Вставить("ПредыдущаяПозиция");
	ПараметрыЗаполнения.Вставить("ПредыдущееПодразделение");
	ПараметрыЗаполнения.Вставить("ПредыдущаяДолжность");
	ПараметрыЗаполнения.Вставить("ПредыдущийВидКадровогоСобытия");
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Процедура ЗаполнитьКоллекциюНазначаемымиМероприятиями(ДанныеМероприятий, ПараметрыЗаполнения, ОчиститьПередЗаполнением = Ложь) Экспорт
	
	Если ОчиститьПередЗаполнением Тогда
		ДанныеМероприятий.Очистить();
	КонецЕсли;
	
	ВидыСобытийАдаптации = Перечисления.ВидыСобытийАдаптацииУвольнения.СобытияАдаптации();
	ВидыСобытийУвольнения = Перечисления.ВидыСобытийАдаптацииУвольнения.СобытияУвольнения();
	
	ОписаниеПрошлыхМероприятийАдаптации = НоваяТаблицаОписанияМероприятий();
	ОписаниеТекущихМероприятийУвольнения = НоваяТаблицаОписанияМероприятий();
	ОписаниеБудущихМероприятийУвольнения = НоваяТаблицаОписанияМероприятий();
	
	ТекущийВидСобытия = ПараметрыЗаполнения.ВидСобытия;
	ПредыдущийВидСобытия = ВидСобытияАдаптацииУвольнения(ПараметрыЗаполнения.ПредыдущийВидКадровогоСобытия);
	
	Если ПараметрыЗаполнения.Позиция = ПараметрыЗаполнения.ПредыдущаяПозиция 
		И ПараметрыЗаполнения.ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.Перемещение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредыдущийВидСобытия) Тогда
		
		// Получаем мероприятия адаптации для предыдущего кадрового события, чтобы исключить их из текущего состава
		// мероприятий. Мероприятия событий не связанных со сменой позиции учитываем полностью, поэтому для них это не актуально.
		Если ПараметрыЗаполнения.ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.Перемещение Тогда
			
			ПараметрыПрошлогоСобытияАдаптации = ПараметрыЗаполненияМероприятий();
			ЗаполнитьЗначенияСвойств(ПараметрыПрошлогоСобытияАдаптации, ПараметрыЗаполнения, "ФизическоеЛицо, ДатаСобытия");
			ПараметрыПрошлогоСобытияАдаптации.Организация = ПараметрыЗаполнения.ПредыдущаяОрганизация;
			ПараметрыПрошлогоСобытияАдаптации.Ответственный = ПараметрыЗаполнения.Ответственный;
			ПараметрыПрошлогоСобытияАдаптации.Позиция = ПараметрыЗаполнения.ПредыдущаяПозиция;
			ПараметрыПрошлогоСобытияАдаптации.Подразделение = ПараметрыЗаполнения.ПредыдущееПодразделение;
			ПараметрыПрошлогоСобытияАдаптации.Должность = ПараметрыЗаполнения.ПредыдущаяДолжность;
			ПараметрыПрошлогоСобытияАдаптации.ВидСобытия = ПредыдущийВидСобытия;
			ПараметрыПрошлогоСобытияАдаптации.ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Адаптация;
			
			ОписаниеПрошлыхМероприятийАдаптации = ПолучитьОписаниеМероприятийПоСобытию(ПараметрыПрошлогоСобытияАдаптации);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийВидСобытия) Тогда 
		
		// Текущий список мероприятий дополняем мероприятиями вызванными освобождением позиции текущим событием.
		Если ВидыСобытийУвольнения.Найти(ТекущийВидСобытия) <> Неопределено Тогда
			
			ПараметрыТекущегоСобытияУвольнения = ПараметрыЗаполненияМероприятий();
			ЗаполнитьЗначенияСвойств(ПараметрыТекущегоСобытияУвольнения, ПараметрыЗаполнения, "ФизическоеЛицо, ДатаСобытия");
			ПараметрыТекущегоСобытияУвольнения.Организация = ПараметрыЗаполнения.ПредыдущаяОрганизация;
			ПараметрыТекущегоСобытияУвольнения.Ответственный = ПараметрыЗаполнения.Ответственный;
			ПараметрыТекущегоСобытияУвольнения.Позиция = ПараметрыЗаполнения.ПредыдущаяПозиция;
			ПараметрыТекущегоСобытияУвольнения.Подразделение = ПараметрыЗаполнения.ПредыдущееПодразделение;
			ПараметрыТекущегоСобытияУвольнения.Должность = ПараметрыЗаполнения.ПредыдущаяДолжность;
			ПараметрыТекущегоСобытияУвольнения.ВидСобытия = ТекущийВидСобытия;
			ПараметрыТекущегоСобытияУвольнения.ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Увольнение;
			
			ОписаниеТекущихМероприятийУвольнения = ПолучитьОписаниеМероприятийПоСобытию(ПараметрыТекущегоСобытияУвольнения);
			
		КонецЕсли;
		
		Если ВидыСобытийАдаптации.Найти(ТекущийВидСобытия) <> Неопределено Тогда
			
			ПараметрыЗаполнения.ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Адаптация;
			ОписаниеТекущихМероприятийАдаптации = ПолучитьОписаниеМероприятийПоСобытию(ПараметрыЗаполнения);
			
			Для Каждого ОписаниеМероприятия Из ОписаниеТекущихМероприятийАдаптации Цикл
				
				Если Не ЗначениеЗаполнено(ОписаниеПрошлыхМероприятийАдаптации.Найти(ОписаниеМероприятия.Мероприятие, "Мероприятие")) Тогда
					ЗаполнитьЗначенияСвойств(ДанныеМероприятий.Добавить(), ОписаниеМероприятия, "Мероприятие, Исполнитель, ДатаНачала, ДатаОкончания");
				КонецЕсли;
				
			КонецЦикла;
			
			ПараметрыЗаполнения.ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Увольнение;
			ПараметрыЗаполнения.ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.СобытияУвольнения();
			ОписаниеБудущихМероприятийУвольнения = ПолучитьОписаниеМероприятийПоСобытию(ПараметрыЗаполнения);
			
		КонецЕсли;
		
		Для Каждого ОписаниеМероприятия Из ОписаниеТекущихМероприятийУвольнения Цикл
			
			// Исключаем выполнение мероприятий связанных с освобождением должности, если они будут выполнены позже.
			Если Не ЗначениеЗаполнено(ОписаниеБудущихМероприятийУвольнения.Найти(ОписаниеМероприятия.Мероприятие, "Мероприятие")) Тогда
				ЗаполнитьЗначенияСвойств(ДанныеМероприятий.Добавить(), ОписаниеМероприятия, "Мероприятие, Исполнитель, ДатаНачала, ДатаОкончания");
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеМероприятий.Сортировать("ДатаОкончания, Мероприятие");
	
КонецПроцедуры

Функция НоваяТаблицаОписанияМероприятий()
	
	ТаблицаМероприятий = Новый ТаблицаЗначений;
	
	ОписанияТиповИсполнителя = Новый Массив;
	ОписанияТиповИсполнителя.Добавить(Тип("СправочникСсылка.РолиИсполнителей"));
	ОписанияТиповИсполнителя.Добавить(Тип("СправочникСсылка.Пользователи"));
	
	ТаблицаМероприятий.Колонки.Добавить("Мероприятие",	Новый ОписаниеТипов("СправочникСсылка.МероприятияАдаптацииУвольнения"));
	ТаблицаМероприятий.Колонки.Добавить("Исполнитель",	Новый ОписаниеТипов(ОписанияТиповИсполнителя));
	ТаблицаМероприятий.Колонки.Добавить("ДатаНачала",	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаМероприятий.Колонки.Добавить("ДатаОкончания",ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Возврат ТаблицаМероприятий;
	
КонецФункции

Функция ПолучитьОписаниеМероприятийПоСобытию(ПараметрыСобытия)
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТМероприятияКадровогоСобытия(Запрос.МенеджерВременныхТаблиц, ПараметрыСобытия);
	СоздатьВТСвойстваНазначаемыхМероприятий(Запрос.МенеджерВременныхТаблиц, ПараметрыСобытия, "ВТМероприятияКадровогоСобытия");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваМероприятий.Ссылка КАК Мероприятие,
	|	СвойстваМероприятий.Исполнитель,
	|	СвойстваМероприятий.ДатаНачала,
	|	СвойстваМероприятий.ДатаОкончания
	|ИЗ
	|	ВТСвойстваНазначаемыхМероприятий КАК СвойстваМероприятий
	|
	|УПОРЯДОЧИТЬ ПО
	|	СвойстваМероприятий.Наименование";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СоздатьВТМероприятияКадровогоСобытия(МенеджерВременныхТаблиц, ПараметрыОтбора)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Организация = ПараметрыОтбора.Организация;
	Подразделение = ПараметрыОтбора.Подразделение;
	Должность = ПараметрыОтбора.Должность;
	
	Если (Не ЗначениеЗаполнено(Должность) 
		Или Не ЗначениеЗаполнено(Подразделение)
		Или Не ЗначениеЗаполнено(Организация)) 
		И ЗначениеЗаполнено(ПараметрыОтбора.Позиция) Тогда
		
		РеквизитыПозицииШР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОтбора.Позиция, "Владелец,Подразделение,Должность");
		
		Организация = ?(ЗначениеЗаполнено(Организация), Организация, РеквизитыПозицииШР.Владелец);
		Подразделение = ?(ЗначениеЗаполнено(Подразделение), Подразделение, РеквизитыПозицииШР.Подразделение);
		Должность =  ?(ЗначениеЗаполнено(Должность), Должность, РеквизитыПозицииШР.Должность);
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Запрос.УстановитьПараметр("Должность",		Должность);
	Запрос.УстановитьПараметр("Позиция",		ПараметрыОтбора.Позиция);
	Запрос.УстановитьПараметр("ВидСобытия",		ПараметрыОтбора.ВидСобытия);
	Запрос.УстановитьПараметр("ВидМероприятия",	ПараметрыОтбора.ВидМероприятия);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Мероприятия.Ссылка КАК Ссылка,
	|	Мероприятия.Исполнитель КАК Исполнитель,
	|	Мероприятия.СдвигСрокаНачалаИсполнения КАК СдвигСрокаНачалаИсполнения,
	|	Мероприятия.СдвигСрокаОкончанияИсполнения КАК СдвигСрокаОкончанияИсполнения,
	|	Мероприятия.Наименование КАК Наименование,
	|	Мероприятия.ВидСдвигаСрокаНачалаИсполнения КАК ВидСдвигаСрокаНачалаИсполнения,
	|	Мероприятия.ВидСдвигаСрокаОкончанияИсполнения КАК ВидСдвигаСрокаОкончанияИсполнения
	|ПОМЕСТИТЬ ВТМероприятияПоВидуСобытияПредварительная
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК Мероприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МероприятияАдаптацииУвольнения.События КАК СобытияМероприятий
	|		ПО Мероприятия.Ссылка = СобытияМероприятий.Ссылка
	|ГДЕ
	|	НЕ Мероприятия.ВАрхиве
	|	И (Мероприятия.ВидМероприятия В (&ВидМероприятия)
	|			ИЛИ Мероприятия.ВидМероприятия = ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийАдаптацииУвольнения.ПустаяСсылка))
	|	И (СобытияМероприятий.ВидСобытия В (&ВидСобытия)
	|			ИЛИ СобытияМероприятий.ВидСобытия ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МероприятияПоВидуСобытия.Ссылка КАК Ссылка,
	|	МероприятияПоВидуСобытия.Исполнитель КАК Исполнитель,
	|	МероприятияПоВидуСобытия.СдвигСрокаНачалаИсполнения КАК СдвигСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.СдвигСрокаОкончанияИсполнения КАК СдвигСрокаОкончанияИсполнения,
	|	МероприятияПоВидуСобытия.Наименование КАК Наименование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтборПоОрганизации.Мероприятие ЕСТЬ NULL
	|					ИЛИ ОтборПоОрганизации.ОбъектНазначения = &Организация
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ДляТекущейОрганизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтборПоПозиции.Мероприятие ЕСТЬ NULL
	|					ИЛИ ОтборПоПозиции.ОбъектНазначения = &Позиция
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ДляТекущейПозиции,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтборПоПодразделению.Мероприятие ЕСТЬ NULL
	|					ИЛИ ОтборПоПодразделению.ОбъектНазначения = &Подразделение
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ДляТекущегоПодразделения,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ОтборПоДолжности.Мероприятие ЕСТЬ NULL
	|					ИЛИ ОтборПоДолжности.ОбъектНазначения = &Должность
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ДляТекущейДолжности,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаНачалаИсполнения КАК ВидСдвигаСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаОкончанияИсполнения КАК ВидСдвигаСрокаОкончанияИсполнения
	|ПОМЕСТИТЬ ВТМероприятияПоВидуСобытия
	|ИЗ
	|	ВТМероприятияПоВидуСобытияПредварительная КАК МероприятияПоВидуСобытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыНазначенияМероприятийАдаптацииУвольнения КАК ОтборПоОрганизации
	|		ПО МероприятияПоВидуСобытия.Ссылка = ОтборПоОрганизации.Мероприятие
	|			И (ОтборПоОрганизации.ОбъектНазначения ССЫЛКА Справочник.Организации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыНазначенияМероприятийАдаптацииУвольнения КАК ОтборПоПозиции
	|		ПО МероприятияПоВидуСобытия.Ссылка = ОтборПоПозиции.Мероприятие
	|			И (ОтборПоПозиции.ОбъектНазначения ССЫЛКА Справочник.ШтатноеРасписание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыНазначенияМероприятийАдаптацииУвольнения КАК ОтборПоПодразделению
	|		ПО МероприятияПоВидуСобытия.Ссылка = ОтборПоПодразделению.Мероприятие
	|			И (ОтборПоПодразделению.ОбъектНазначения ССЫЛКА Справочник.ПодразделенияОрганизаций)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтборыНазначенияМероприятийАдаптацииУвольнения КАК ОтборПоДолжности
	|		ПО МероприятияПоВидуСобытия.Ссылка = ОтборПоДолжности.Мероприятие
	|			И (ОтборПоДолжности.ОбъектНазначения ССЫЛКА Справочник.Должности)
	|
	|СГРУППИРОВАТЬ ПО
	|	МероприятияПоВидуСобытия.Наименование,
	|	МероприятияПоВидуСобытия.Ссылка,
	|	МероприятияПоВидуСобытия.Исполнитель,
	|	МероприятияПоВидуСобытия.СдвигСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.СдвигСрокаОкончанияИсполнения,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаОкончанияИсполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МероприятияПоВидуСобытия.Ссылка КАК Ссылка,
	|	МероприятияПоВидуСобытия.Исполнитель КАК Исполнитель,
	|	МероприятияПоВидуСобытия.СдвигСрокаНачалаИсполнения КАК СдвигСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.СдвигСрокаОкончанияИсполнения КАК СдвигСрокаОкончанияИсполнения,
	|	МероприятияПоВидуСобытия.Наименование КАК Наименование,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаНачалаИсполнения КАК ВидСдвигаСрокаНачалаИсполнения,
	|	МероприятияПоВидуСобытия.ВидСдвигаСрокаОкончанияИсполнения КАК ВидСдвигаСрокаОкончанияИсполнения
	|ПОМЕСТИТЬ ВТМероприятияКадровогоСобытия
	|ИЗ
	|	ВТМероприятияПоВидуСобытия КАК МероприятияПоВидуСобытия
	|ГДЕ
	|	МероприятияПоВидуСобытия.ДляТекущейОрганизации
	|	И МероприятияПоВидуСобытия.ДляТекущейПозиции
	|	И МероприятияПоВидуСобытия.ДляТекущегоПодразделения
	|	И МероприятияПоВидуСобытия.ДляТекущейДолжности";
	
	Запрос.Выполнить();
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТМероприятияПоВидуСобытияПредварительная");
	УдалитьВТ.Добавить("ВТМероприятияПоВидуСобытия");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Процедура СоздатьВТСвойстваНазначаемыхМероприятий(МенеджерВременныхТаблиц, ПараметрыЗапроса, ИмяВТМероприятия = "ВТНазначаемыеМероприятия")
	
	ФизическоеЛицоРуководитель = ФизическоеЛицоРуководитель(ПараметрыЗапроса.Подразделение, ПараметрыЗапроса.Позиция,
		ПараметрыЗапроса.ДатаСобытия);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ФизическоеЛицо",				ПараметрыЗапроса.ФизическоеЛицо);
	Запрос.УстановитьПараметр("ДатаСобытия",				ПараметрыЗапроса.ДатаСобытия);
	Запрос.УстановитьПараметр("Ответственный",				ПараметрыЗапроса.Ответственный);
	Запрос.УстановитьПараметр("ФизическоеЛицоРуководитель",	ФизическоеЛицоРуководитель);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НазначаемыеМероприятия.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА МероприятияАдаптацииУвольнения.ИсполняетсяСотрудником
	|			ТОГДА &ФизическоеЛицо
	|		ИНАЧЕ &ФизическоеЛицоРуководитель
	|	КОНЕЦ КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА МероприятияАдаптацииУвольнения.ИсполняетсяОтветственным
	|			ТОГДА &Ответственный
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Ответственный
	|ПОМЕСТИТЬ ВТМероприятияИсполняемыеСотрудниками
	|ИЗ
	|	ВТНазначаемыеМероприятия КАК НазначаемыеМероприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения
	|		ПО НазначаемыеМероприятия.Ссылка = МероприятияАдаптацииУвольнения.Ссылка
	|			И (МероприятияАдаптацииУвольнения.ИсполняетсяСотрудником
	|				ИЛИ МероприятияАдаптацииУвольнения.ИсполняетсяРуководителем
	|				ИЛИ МероприятияАдаптацииУвольнения.ИсполняетсяОтветственным)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Мероприятия.Ссылка КАК Мероприятие,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ Мероприятия.Ответственный ЕСТЬ NULL
	|				ТОГДА Мероприятия.Ответственный
	|			КОГДА Пользователи.Ссылка ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ИНАЧЕ Пользователи.Ссылка
	|		КОНЕЦ) КАК Исполнитель
	|ПОМЕСТИТЬ ВТИсполнителиМероприятий
	|ИЗ
	|	ВТМероприятияИсполняемыеСотрудниками КАК Мероприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО Мероприятия.ФизическоеЛицо = Пользователи.ФизическоеЛицо
	|			И (НЕ Пользователи.Недействителен)
	|			И (НЕ Пользователи.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	Мероприятия.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначаемыеМероприятия.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НазначаемыеМероприятия.СдвигСрокаНачалаИсполнения = 0
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА НазначаемыеМероприятия.ВидСдвигаСрокаНачалаИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыСдвигаСрока.Месяц)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&ДатаСобытия, МЕСЯЦ, НазначаемыеМероприятия.СдвигСрокаНачалаИсполнения)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаСобытия, ДЕНЬ, НазначаемыеМероприятия.СдвигСрокаНачалаИсполнения)
	|	КОНЕЦ КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА НазначаемыеМероприятия.ВидСдвигаСрокаОкончанияИсполнения = ЗНАЧЕНИЕ(Перечисление.ВидыСдвигаСрока.Месяц)
	|			ТОГДА ДОБАВИТЬКДАТЕ(&ДатаСобытия, МЕСЯЦ, НазначаемыеМероприятия.СдвигСрокаОкончанияИсполнения)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(&ДатаСобытия, ДЕНЬ, НазначаемыеМероприятия.СдвигСрокаОкончанияИсполнения)
	|	КОНЕЦ КАК ДатаОкончания,
	|	НазначаемыеМероприятия.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА НЕ ИсполнителиМероприятий.Мероприятие ЕСТЬ NULL
	|				И ИсполнителиМероприятий.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ИсполнителиМероприятий.Исполнитель
	|		ИНАЧЕ НазначаемыеМероприятия.Исполнитель
	|	КОНЕЦ КАК Исполнитель
	|ПОМЕСТИТЬ ВТСвойстваНазначаемыхМероприятий
	|ИЗ
	|	ВТНазначаемыеМероприятия КАК НазначаемыеМероприятия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсполнителиМероприятий КАК ИсполнителиМероприятий
	|		ПО НазначаемыеМероприятия.Ссылка = ИсполнителиМероприятий.Мероприятие";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТНазначаемыеМероприятия", ИмяВТМероприятия);
	Запрос.Выполнить();
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТМероприятияИсполняемыеСотрудниками");
	УдалитьВТ.Добавить("ВТИсполнителиМероприятий");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Функция ФизическоеЛицоРуководитель(Подразделение, Позиция, ДатаПолученияДанных = '00010101')
	
	Результат = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	Если Не РуководителиПодразделений.РуководителиПодразделенийИспользуются() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Подразделения = Новый Массив;
	
	Если ЗначениеЗаполнено(Позиция) Тогда
		МестоПозиции = ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(Позиция, ДатаПолученияДанных);
		Если ЗначениеЗаполнено(МестоПозиции) Тогда
			Подразделения.Добавить(МестоПозиции);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
		Подразделения.Добавить(Подразделение);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подразделения) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДанныеРуководителей = РуководителиПодразделений.ДанныеРуководителей(Подразделения);
	Если Не ЗначениеЗаполнено(ДанныеРуководителей) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ДанныеРуководителей[Подразделения[0]].ФизическоеЛицо;
	
	Возврат Результат;
	
КонецФункции

Функция СвойстваНазначаемогоМероприятия(Мероприятие, ПараметрыЗапроса) Экспорт
	
	СвойстваМероприятия = Новый Структура("Исполнитель, ДатаНачала, ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МероприятияАдаптацииУвольнения.Ссылка КАК Ссылка,
	|	МероприятияАдаптацииУвольнения.Исполнитель КАК Исполнитель,
	|	МероприятияАдаптацииУвольнения.СдвигСрокаНачалаИсполнения КАК СдвигСрокаНачалаИсполнения,
	|	МероприятияАдаптацииУвольнения.СдвигСрокаОкончанияИсполнения КАК СдвигСрокаОкончанияИсполнения,
	|	МероприятияАдаптацииУвольнения.Наименование КАК Наименование,
	|	МероприятияАдаптацииУвольнения.ВидСдвигаСрокаНачалаИсполнения КАК ВидСдвигаСрокаНачалаИсполнения,
	|	МероприятияАдаптацииУвольнения.ВидСдвигаСрокаОкончанияИсполнения КАК ВидСдвигаСрокаОкончанияИсполнения
	|ПОМЕСТИТЬ ВТМероприятияАдаптацииУвольнения
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения
	|ГДЕ
	|	МероприятияАдаптацииУвольнения.Ссылка = &Мероприятие";
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	Запрос.Выполнить();
	
	СоздатьВТСвойстваНазначаемыхМероприятий(Запрос.МенеджерВременныхТаблиц, ПараметрыЗапроса, "ВТМероприятияАдаптацииУвольнения");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СвойстваМероприятий.Исполнитель КАК Исполнитель,
	|	СвойстваМероприятий.ДатаНачала КАК ДатаНачала,
	|	СвойстваМероприятий.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТСвойстваНазначаемыхМероприятий КАК СвойстваМероприятий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СвойстваМероприятия, Выборка);
	КонецЦикла;
	
	Возврат СвойстваМероприятия;
	
КонецФункции

Функция ВидСобытияАдаптацииУвольнения(ВидКадровогоСобытия)
	
	Если Не ЗначениеЗаполнено(ВидКадровогоСобытия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.ПустаяСсылка();
	
	Если ВидКадровогоСобытия = Перечисления.ВидыКадровыхСобытий.ВосстановлениеВДолжности Тогда
		ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.ВосстановлениеВДолжности;
	ИначеЕсли ВидКадровогоСобытия = Перечисления.ВидыКадровыхСобытий.Прием Тогда
		ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.Прием;
	ИначеЕсли ВидКадровогоСобытия = Перечисления.ВидыКадровыхСобытий.Перемещение Тогда
		ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.Перемещение;
	ИначеЕсли ВидКадровогоСобытия = Перечисления.ВидыКадровыхСобытий.Увольнение Тогда
		ВидСобытия = Перечисления.ВидыСобытийАдаптацииУвольнения.Увольнение;
	КонецЕсли;
	
	Возврат ВидСобытия;
	
КонецФункции

Процедура СообщитьОбОшибкеИсполнителяВСтроке(ДокументОбъект, СтрокаДанных, ИндексСтроки, ЛичныеМероприятия)
	
	СтрокиСообщения = Новый Массив();
	СтрокиСообщения.Добавить(СтрШаблон(НСтр("ru = 'Не подобран исполнитель мероприятия ""%1"".'"), СтрокаДанных.Мероприятие));
	
	Если ЛичныеМероприятия.Получить(СтрокаДанных.Мероприятие) <> Неопределено Тогда
		Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РешениеОПриемеНаРаботу") Тогда
			СтрокиСообщения.Добавить(СтрШаблон(
				НСтр("ru = 'Убедитесь, что есть пользователь, связанный с кандидатом %1, и перезаполните табличную часть.'"),
				ДокументОбъект.ЛичныеДанныеКандидата));
		Иначе
			СтрокиСообщения.Добавить(СтрШаблон(
				НСтр("ru = 'Убедитесь, что есть пользователь, связанный с сотрудником %1, и перезаполните табличную часть.'"),
				ДокументОбъект.ФизическоеЛицо));
		КонецЕсли;
	Иначе
		СтрокиСообщения.Добавить(НСтр("ru = 'Уточните настройки мероприятия и перезаполните табличную часть.'"));
	КонецЕсли;
	
	ТекстОшибки = СтрСоединить(СтрокиСообщения, Символы.ПС);
	
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, 
		СтрШаблон("МероприятияАдаптацииУвольнения[%1].Исполнитель", Формат(ИндексСтроки, "ЧН=0; ЧГ=0")));
	
КонецПроцедуры

Процедура ЗаполнитьРезультатВыполненияМероприятия(СтрокаМероприятия)
	
	ЗаданиеСсылка = СтрокаМероприятия.ЗаданиеАдаптацииУвольнения;
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(ЗаданиеСсылка) Или Не ЗаданиеСсылка.Стартован Тогда
		СтрокаМероприятия.РезультатВыполненияКод = "НеНазначено";
		СтрокаМероприятия.РезультатВыполнения = НСтр("ru = 'Задание пока не назначено'");
	ИначеЕсли ЗаданиеСсылка.Выполнено Тогда
		СтрокаМероприятия.РезультатВыполненияКод = "Выполнено";
		СтрокаМероприятия.РезультатВыполнения = СтрШаблон(НСтр("ru = 'Выполнено %1'"),
			Формат(ЗаданиеСсылка.ДатаЗавершения, "ДЛФ=D"));
	ИначеЕсли НачалоДня(ЗаданиеСсылка.СрокИсполнения) < НачалоДня(ТекущаяДата) Тогда
		СтрокаМероприятия.РезультатВыполненияКод = "Просрочено";
		РазницаВДнях = (НачалоДня(ТекущаяДата) - НачалоДня(ЗаданиеСсылка.СрокИсполнения)) / (60 * 60 * 24);
		СтрокаМероприятия.РезультатВыполнения = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';Просрочено на %1 день;;Просрочено на %1 дня;Просрочено на %1 дней;Просрочено на %1 дня'"),
			РазницаВДнях);
	Иначе
		СтрокаМероприятия.РезультатВыполненияКод = "ОжидаетВыполнения";
		СтрокаМероприятия.РезультатВыполнения = НСтр("ru = 'Ожидает выполнения'");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЗаданияВДанныхМероприятий(Предмет, ДанныеМероприятий) Экспорт
	
	Если ДанныеМероприятий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеМероприятий[0].Свойство("ЗаданиеАдаптацииУвольнения") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МероприятияАдаптацииУвольнения.Ссылка КАК Мероприятие,
	|	ЕСТЬNULL(ЗаданиеАдаптацииУвольнения.Ссылка, ЗНАЧЕНИЕ(БизнесПроцесс.ЗаданиеАдаптацииУвольнения.ПустаяСсылка)) КАК ЗаданиеАдаптацииУвольнения
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК ЗаданиеАдаптацииУвольнения
	|		ПО (ЗаданиеАдаптацииУвольнения.Предмет = &Предмет)
	|			И МероприятияАдаптацииУвольнения.Ссылка = ЗаданиеАдаптацииУвольнения.Мероприятие
	|ГДЕ
	|	МероприятияАдаптацииУвольнения.Ссылка В(&Мероприятия)");
	Запрос.УстановитьПараметр("Мероприятия", ДанныеМероприятий.Выгрузить(, "Мероприятие"));
	Запрос.УстановитьПараметр("Предмет", Предмет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокиМероприятия = ДанныеМероприятий.НайтиСтроки(Новый Структура("Мероприятие", Выборка.Мероприятие));
		Если Не ЗначениеЗаполнено(СтрокиМероприятия) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМероприятия = СтрокиМероприятия[0];
		СтрокаМероприятия.ЗаданиеАдаптацииУвольнения = Выборка.ЗаданиеАдаптацииУвольнения;
		ЗаполнитьРезультатВыполненияМероприятия(СтрокаМероприятия);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция РезультатыМероприятий(Предмет, Мероприятия) Экспорт
	
	РезультатыМероприятий = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МероприятияАдаптацииУвольнения.Ссылка КАК Мероприятие,
	|	ЕСТЬNULL(ЗаданиеАдаптацииУвольнения.Ссылка, ЗНАЧЕНИЕ(БизнесПроцесс.ЗаданиеАдаптацииУвольнения.ПустаяСсылка)) КАК
	|		ЗаданиеАдаптацииУвольнения,
	|	ВЫБОР
	|		КОГДА ЗаданиеАдаптацииУвольнения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЗаданиеАдаптацииУвольнения.Выполнено
	|	КОНЕЦ КАК Выполнено,
	|	ВЫБОР
	|		КОГДА ЗаданиеАдаптацииУвольнения.Ссылка ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЗаданиеАдаптацииУвольнения.СрокИсполнения
	|	КОНЕЦ КАК СрокИсполнения,
	|	ВЫБОР
	|		КОГДА ЗаданиеАдаптацииУвольнения.Ссылка ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЗаданиеАдаптацииУвольнения.ДатаЗавершения
	|	КОНЕЦ КАК ДатаЗавершения,
	|	ВЫБОР
	|		КОГДА ЗаданиеАдаптацииУвольнения.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ЗаданиеАдаптацииУвольнения.Стартован
	|	КОНЕЦ КАК Стартован,
	|	"""" КАК РезультатВыполненияКод,
	|	"""" КАК РезультатВыполнения
	|ИЗ
	|	Справочник.МероприятияАдаптацииУвольнения КАК МероприятияАдаптацииУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК ЗаданиеАдаптацииУвольнения
	|		ПО МероприятияАдаптацииУвольнения.Ссылка = ЗаданиеАдаптацииУвольнения.Мероприятие
	|		И ЗаданиеАдаптацииУвольнения.Предмет = &Предмет
	|ГДЕ
	|	МероприятияАдаптацииУвольнения.Ссылка В (&Мероприятия)");
	Запрос.УстановитьПараметр("Предмет", Предмет);
	Запрос.УстановитьПараметр("Мероприятия", Мероприятия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Пока Выборка.Следующий() Цикл
		ТекРезультат = НовыйРезультатВыполненияМероприятия();
		РезультатыМероприятий.Вставить(Выборка.Мероприятие, ТекРезультат);
		Если Не ЗначениеЗаполнено(Выборка.ЗаданиеАдаптацииУвольнения) Или Не Выборка.Стартован Тогда
			Продолжить;
		ИначеЕсли Выборка.Выполнено Тогда
			ТекРезультат.РезультатВыполненияКод = "Выполнено";
			ТекРезультат.РезультатВыполнения = СтрШаблон(НСтр("ru = 'Выполнено %1'"),
				Формат(Выборка.ДатаЗавершения, "ДЛФ=D"));
		ИначеЕсли НачалоДня(Выборка.СрокИсполнения) < НачалоДня(ТекущаяДата) Тогда
			ТекРезультат.РезультатВыполненияКод = "Просрочено";
			РазницаВДнях = (НачалоДня(ТекущаяДата) - НачалоДня(Выборка.СрокИсполнения)) / (60 * 60 * 24);
			ТекРезультат.РезультатВыполнения = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru = ';Просрочено на %1 день;;Просрочено на %1 дня;Просрочено на %1 дней;Просрочено на %1 дня'"),
				РазницаВДнях);
		Иначе
			ТекРезультат.РезультатВыполненияКод = "ОжидаетВыполнения";
			ТекРезультат.РезультатВыполнения = НСтр("ru = 'Ожидает выполнения'");
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатыМероприятий;
	
КонецФункции

Функция НовыйРезультатВыполненияМероприятия()
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаданиеАдаптацииУвольнения", БизнесПроцессы.ЗаданиеАдаптацииУвольнения.ПустаяСсылка());
	Результат.Вставить("РезультатВыполненияКод", "НеНазначено");
	Результат.Вставить("РезультатВыполнения", НСтр("ru = 'Задание пока не назначено'"));
	Возврат Результат;
	
КонецФункции

Процедура ПриНачальномЗаполненииЗадачаИсполнителя()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ЗадачаИсполнителя");
	
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Направлена новая задача'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	ПараметрыШаблона.Текст = НСтр("ru='Здравствуйте, [ДанныеУведомления.Исполнитель]!
		|
		|Направлена новая задача: [ДанныеУведомления.Наименование], по предмету [ДанныеУведомления.ПредметСтрокой]
		| [ДанныеУведомления.Описание]
		|Срок исполнения: [ДанныеУведомления.СрокИсполнения].'");
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(НСтр("ru='Уведомление о новой задаче'"), ПараметрыШаблона);
	
	// 	Рассылка уведомления
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование 	= НСтр("ru='Уведомление о новых заданиях адаптации увольнения'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Исполнитель";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ИнтервалУведомления = 0;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииОкончаниеИспытательногоСрока()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ОкончаниеИспытательногоСрока");
	
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Окончание испытательного срока'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
	ПараметрыШаблона.Текст = НСтр("ru = 'Ваш испытательный срок заканчивается [ДанныеУведомления.ДатаЗавершенияПредставление]'");
	// АПК:1223-вкл.
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(ПараметрыШаблона.Тема, ПараметрыШаблона);
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование	= НСтр("ru = 'Окончание испытательного срока'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Функция ОтборПоЗадачеПройден(Предмет, Отборы)
	
	ОтборПройден = Истина;
	БизнесПроцесс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предмет, "БизнесПроцесс");
	Для Каждого Отбор Из Отборы Цикл
		Если Отбор.Использование Тогда
			ОтборПройден = Ложь;
			Если Не ЗначениеЗаполнено(БизнесПроцесс)
				Или Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(БизнесПроцесс, "Мероприятие") Тогда
				Возврат ОтборПройден;
			КонецЕсли;
			Если Отбор.ЛевоеЗначение = "Мероприятие" Тогда
				Если Отбор.ВидСравнения = ВидСравнения.Равно Тогда
					Если Отбор.ПравоеЗначение = БизнесПроцесс.Мероприятие Тогда
						ОтборПройден = Истина;
					КонецЕсли;
				ИначеЕсли Отбор.ВидСравнения = ВидСравнения.ВСписке Тогда
					Если Отбор.ПравоеЗначение.НайтиПоЗначению(БизнесПроцесс.Мероприятие) <> Неопределено Тогда
						ОтборПройден = Истина;
					КонецЕсли;
				ИначеЕсли Отбор.ВидСравнения = ВидСравнения.НеРавно Тогда
					Если Отбор.ПравоеЗначение <> БизнесПроцесс.Мероприятие Тогда
						ОтборПройден = Истина;
					КонецЕсли;
				ИначеЕсли Отбор.ВидСравнения = ВидСравнения.НеВСписке Тогда
					Если Отбор.ПравоеЗначение.НайтиПоЗначению(БизнесПроцесс.Мероприятие) = Неопределено Тогда
						ОтборПройден = Истина;
					КонецЕсли;
				Иначе
					ОтборПройден = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтборПройден;
	
КонецФункции

#КонецОбласти