#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗарплатаКадрыОтчеты.ПередНачаломКомпоновкиРезультата(ЭтотОбъект);
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	
	Если КлючВарианта = "КарточкаУчетаВыдачиДежурныхСИЗ" Тогда
		Данные = Новый ДеревоЗначений;
		Попытка
			СтандартнаяОбработка = Ложь;
			
			Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОбъектыПечати") Тогда
				ОбъектыПечати = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ОбъектыПечати;
			Иначе
				ОбъектыПечати = Новый СписокЗначений;
			КонецЕсли;
			
			// Параметры документа
			ДокументРезультат.ТолькоПросмотр = Истина;
			ДокументРезультат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КарточкаУчетаВыдачиДежурныхСИЗ";
			ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ДокументРезультат.Очистить();
			ДокументРезультат.АвтоМасштаб = Истина;
			ДокументРезультат.НачатьАвтогруппировкуСтрок();
			
			НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
			НастройкиОтчета.Выбор.Элементы.Очистить();
			СоответствиеПользовательскихПолей = ЗарплатаКадрыОтчеты.СоответствиеПользовательскихПолей(НастройкиОтчета);
			ПроверитьЗначенияПараметров(НастройкиОтчета, Истина);
			
			ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
			Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала") Тогда
				ДатаОтчета = ЗначениеПараметра.Значение.Дата;
			Иначе
				ДатаОтчета = ЗначениеПараметра.Значение;
			КонецЕсли;
			
			МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(СхемаКомпоновкиДанных, НастройкиОтчета);
			
			// Создадим и инициализируем процессор компоновки.
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(Данные);
			
			// Обозначим начало вывода
			ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
			СредстваИндивидуальнойЗащиты.ДополнитьДанныеВыданнымиСИЗБезНорм(Данные, Истина);
			Группировки = ЗарплатаКадрыОтчеты.ПолучитьПоляГруппировок(КомпоновщикНастроек);
			ВывестиМакетыСГруппировками(ДокументРезультат, Данные, Группировки, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати);
			ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
		Исключение
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'В настройку отчета внесены критичные изменения. Отчет не будет сформирован. %1'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		ДопСвойства = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("ОтчетПустой", Данные.Строки.Количество() = 0);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ВывестиВОтчетДополнительныеПоляПредставлений(ЭтотОбъект, ДополнительныеПоляПредставлений());
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		КлючСхемы = "СхемаИнициализирована";
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнительныеПоляПредставлений() Экспорт
	
	ДополнительныеПоляКадровыхДанныхСотрудников = КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников();
	
	ДополнительныеПоля = Новый Структура;
	ДополнительныеПоля.Вставить("Представления_КадровыеДанныеСотрудников", ДополнительныеПоляКадровыхДанныхСотрудников);
	
	Возврат ДополнительныеПоля;
	
КонецФункции

Процедура ВывестиМакетыСГруппировками(ДокументРезультат, Данные, Группировки, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати)
	
	Если Группировки.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			ПолеДанных = Группировки[0].Значение;
			ВывестиГруппировку(ДокументРезультат, СтрокаДанных, ПолеДанных, 0, СоответствиеПользовательскихПолей);
			ВывестиВложенныеГруппировкиСМакетами(ДокументРезультат, СтрокаДанных, Группировки, 1, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			ВывестиМакет(ДокументРезультат, СтрокаДанных, 0, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати);
			Если СтрокаДанных <> Данные.Строки.Получить(Данные.Строки.Количество() - 1) Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиВложенныеГруппировкиСМакетами(ДокументРезультат, Данные, Группировки, Уровень, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати)
	
	Если Группировки.Количество() > Уровень Тогда 
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			ПолеДанных = Группировки[Уровень].Значение;
			ВывестиГруппировку(ДокументРезультат, СтрокаДанных, ПолеДанных, Уровень, СоответствиеПользовательскихПолей);
			ВывестиВложенныеГруппировкиСМакетами(ДокументРезультат, СтрокаДанных, Группировки, Уровень + 1, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаДанных Из Данные.Строки Цикл
			ВывестиМакет(ДокументРезультат, СтрокаДанных, Уровень, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиГруппировку(ДокументРезультат, СтрокаДанных, Поле, Уровень, СоответствиеПользовательскихПолей)
	
	МакетГруппировки = УправлениеПечатью.МакетПечатнойФормы("Отчет.КарточкаУчетаВыдачиДежурныхСИЗ.ПФ_MXL_КарточкаУчетаВыдачиДежурныхСИЗ");
	ОбластьГруппировки = МакетГруппировки.ПолучитьОбласть("Группировка");
	
	ДоступноеПоле = КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.НайтиПоле(Новый ПолеКомпоновкиДанных(Поле));
	
	ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(ОбластьГруппировки, СтрокаДанных,
		ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(СоответствиеПользовательскихПолей, СтрокаДанных));
	
	ОбластьГруппировки.Параметры.НазваниеПараметра = ДоступноеПоле.Заголовок;
	ОбластьГруппировки.Параметры.Значение = СтрокаДанных[СтрЗаменить(Поле, ".", "")];
	
	ДокументРезультат.Вывести(ОбластьГруппировки, Уровень);
	
КонецПроцедуры 

Процедура ВывестиМакет(ДокументРезультат, СтрокаДанных, Уровень, ДатаОтчета, СоответствиеПользовательскихПолей, ОбъектыПечати) 
	
	ПерваяСтрокаФормы = ДокументРезультат.ВысотаТаблицы + 1;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.КарточкаУчетаВыдачиДежурныхСИЗ.ПФ_MXL_КарточкаУчетаВыдачиДежурныхСИЗ");
	
	ЛицеваяСторонаЛичнойКарточки = Макет.ПолучитьОбласть("ЛицеваяСторонаЛичнойКарточки");
	ОбластьСтрокаСИЗ = Макет.ПолучитьОбласть("СтрокаСИЗ");
	ОбластьОтветственноеЛицо = Макет.ПолучитьОбласть("ОбластьОтветственноеЛицо");
	ОборотнаяСторонаЛичнойКарточки = Макет.ПолучитьОбласть("ОборотнаяСторонаЛичнойКарточки");
	ОбластьСтрокаВыдачи = Макет.ПолучитьОбласть("СтрокаВыдачи");
	
	ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(ЛицеваяСторонаЛичнойКарточки, СтрокаДанных,
		ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(СоответствиеПользовательскихПолей, СтрокаДанных));
	ДокументРезультат.Вывести(ЛицеваяСторонаЛичнойКарточки, Уровень + 1);
	
	Для Каждого СтрокаСИЗ Из СтрокаДанных.Строки Цикл
		ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(ОбластьСтрокаСИЗ, СтрокаСИЗ,
			ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(СоответствиеПользовательскихПолей, СтрокаСИЗ));
		ДокументРезультат.Вывести(ОбластьСтрокаСИЗ, Уровень + 1);
	КонецЦикла;
	
	ОтветственныеЛица = Новый Структура("Организация, ОтветственныйЗаОхрануТруда", СтрокаДанных.Организация);
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ОтветственныеЛица, ДатаОтчета);
	Если ЗначениеЗаполнено(ОтветственныеЛица.ОтветственныйЗаОхрануТруда) Тогда
		ОбластьОтветственноеЛицо.Параметры.Ответственный = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветственныеЛица.ОтветственныйЗаОхрануТруда, "ФИО"));
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьОтветственноеЛицо, Уровень + 1);
	
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(ОборотнаяСторонаЛичнойКарточки, СтрокаДанных,
		ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(СоответствиеПользовательскихПолей, СтрокаДанных));
	ДокументРезультат.Вывести(ОборотнаяСторонаЛичнойКарточки, Уровень + 1);
	
	Для Каждого СтрокаСИЗ Из СтрокаДанных.Строки Цикл
		Для Каждого СтрокаВыдачи Из СтрокаСИЗ.Строки Цикл
			ЗарплатаКадрыОтчеты.ЗаполнитьПараметрыОбластиМакета(ОбластьСтрокаВыдачи, СтрокаВыдачи,
				ЗарплатаКадрыОтчеты.ЗначенияЗаполненияПользовательскихПолей(СоответствиеПользовательскихПолей, СтрокаВыдачи));
			ДокументРезультат.Вывести(ОбластьСтрокаВыдачи, Уровень + 1);
		КонецЦикла;
	КонецЦикла;
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, ПерваяСтрокаФормы, ОбъектыПечати, СтрокаДанных.Сотрудник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Универсальные процедуры и Функции.

Процедура ПроверитьЗначенияПараметров(НастройкиОтчета, ВыводитьПодписантов = Ложь)
	
	ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	
	Если ЗначениеПараметра <> Неопределено Тогда
		УстановитьДатуОтчета = Ложь;
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Неопределено") Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("Дата")
			И ЗначениеПараметра.Значение = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПараметра.Значение) = Тип("СтандартнаяДатаНачала")
			И Дата(ЗначениеПараметра.Значение) = '00010101' Тогда
			УстановитьДатуОтчета = Истина;
		КонецЕсли;
		
		Если УстановитьДатуОтчета Тогда
			ЗначениеПараметра.Значение = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
	Если ВыводитьПодписантов Тогда
		ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РаботникКадровойСлужбы"));
		Если НЕ ЗначениеПараметра.Использование Тогда
			ЗначениеПараметра.Значение = Неопределено;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
		
		ЗначениеПараметра = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДолжностьРаботникаКадровойСлужбы"));
		Если НЕ ЗначениеПараметра.Использование Тогда
			ЗначениеПараметра.Значение = Неопределено;
		КонецЕсли;
		
		ЗначениеПараметра.Использование = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли