
#Область СлужебныйПрограммныйИнтерфейс

Процедура РасчетРезервовНачисленияВДанныеФормы(ТаблицыНачислений, ТаблицаИсточник, Организация, ВидОперации, ПозицииВставки = Неопределено, ЗаполнятьПоказатели = Истина) Экспорт
	
	МодульКонтракта().РасчетРезервовНачисленияВДанныеФормы(ТаблицыНачислений, ТаблицаИсточник, Организация, ВидОперации, ПозицииВставки, ЗаполнятьПоказатели);
	
КонецПроцедуры

Процедура РасчетРезервовВзносыВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки = Неопределено) Экспорт
	
	МодульКонтракта().РасчетРезервовВзносыВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки);
	
КонецПроцедуры

Процедура РасчетРезервовРасчетВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки = Неопределено) Экспорт
	
	МодульКонтракта().РасчетРезервовРасчетВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки);
	
КонецПроцедуры

Процедура ОценочныеОбязательстваПоСотрудникамВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки = Неопределено) Экспорт
	
	МодульКонтракта().ОценочныеОбязательстваПоСотрудникамВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, ПозицииВставки);
	
КонецПроцедуры

Процедура ОценочныеОбязательстваВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, Очищать = Истина, РаспределятьВыявленныеИзлишки = Ложь) Экспорт
	
	МодульКонтракта().ОценочныеОбязательстваВДанныеФормы(ТаблицаПриемник, ТаблицаИсточник, Очищать, РаспределятьВыявленныеИзлишки);
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТрудаФормыБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТрудаФормыРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
