#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Список.Очистить();

	Получатель = Параметры.Получатель;
	
	// Выборка пользователей с правами подтверждения отправки данных в Отчетность
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
		|	ГруппыДоступаПользователи.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
		|		ПО ГруппыДоступаПользователи.Ссылка.Профиль = ПрофилиГруппДоступаРоли.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Пользователи.Ссылка = ГруппыДоступаПользователи.Пользователь
		|ГДЕ
		|	НЕ Пользователи.ПометкаУдаления
		|	И НЕ Пользователи.Недействителен
		|	И НЕ Пользователи.Служебный
		|	И (ПрофилиГруппДоступаРоли.Роль.Имя = ""ПолныеПрава""
		|	ИЛИ ПрофилиГруппДоступаРоли.Роль.Имя = &РольПодтверждениеОтправкиДанныхВОтчетность)";
	
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("РольПодтверждениеОтправкиДанныхВОтчетность", 
		Метаданные.Роли.ПодтверждениеОтправкиДанныхВОтчетность24.Имя);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РазрешенныеПользователи = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ЗначениеСписка = Список.НайтиПоЗначению(Выборка.Пользователь);
		Если ЗначениеСписка = Неопределено Тогда
			Список.Добавить(Выборка.Пользователь, Строка(Выборка.Пользователь), Истина);
			РазрешенныеПользователи.Добавить(Выборка.ИдентификаторПользователяИБ);
		КонецЕсли;
	КонецЦикла;
	
	// Добавление пользователей БД
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("РазрешенныеПользователи", РазрешенныеПользователи);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пользователи.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Получатель ЕСТЬ NULL
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.РазрешеноПодтверждениеОтправки
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Отчетность24БРОНастройкиПодтверждения КАК
	|			НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность
	|		ПО НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Пользователь = Пользователи.Ссылка
	|		И НастройкиПодтвержденияПередачиДанныхВОблачнуюОтчетность.Получатель = &Получатель
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.Служебный
	|	И Пользователи.ИдентификаторПользователяИБ В (&РазрешенныеПользователи)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пользователи.Наименование";
	
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	ЕстьВыбранные = Список.Количество() > 0;
	Пока Выборка.Следующий() Цикл
		
		Пометка = Ложь;
		Если ТипЗнч(Выборка.Пометка) = Тип("Булево") Тогда
			Пометка = Выборка.Пометка;
		КонецЕсли;
		
		ЗначениеСписка = Список.НайтиПоЗначению(Выборка.Ссылка);
		Если ЗначениеСписка = Неопределено Тогда
			Список.Добавить(Выборка.Ссылка, Строка(Выборка.Ссылка), Пометка);
		Иначе
			Если ТипЗнч(Выборка.Пометка) = Тип("Булево") Тогда
				ЗначениеСписка.Пометка = Выборка.Пометка;
			Иначе
				Пометка = ЗначениеСписка.Пометка;
			КонецЕсли;
		КонецЕсли;

		Если Пометка = Истина Тогда
			ЕстьВыбранные = Истина;
		КонецЕсли;
	КонецЦикла;   
	
	Список.СортироватьПоПредставлению();
	
	Если ЕстьВыбранные = Ложь Тогда
		Список.ЗаполнитьПометки(Истина);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ЗаписатьВыбранные());
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаписатьВыбранные() 

	ИмяИдентификаторПользователяИБ = "ИдентификаторПользователяИБ";
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Пользователи.ТекущийПользователь(), ИмяИдентификаторПользователяИБ);
	Если ИдентификаторПользователяИБ <> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда

		Набор = РегистрыСведений.Отчетность24БРОНастройкиПодтверждения.СоздатьНаборЗаписей();
		Набор.Отбор.Получатель.Установить(Получатель);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл
			ЗаписьПользовательИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Запись.Пользователь, ИмяИдентификаторПользователяИБ);
			Если ЗаписьПользовательИдентификаторПользователяИБ
				= ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
				Набор.Удалить(Запись);
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();

	КонецЕсли;

	ПользователиМассив = Новый Массив;
	Для Каждого ЭлементСписка Из Список Цикл
		Запись = РегистрыСведений.Отчетность24БРОНастройкиПодтверждения.СоздатьМенеджерЗаписи();
		Запись.Получатель = Получатель;
		Запись.Пользователь = ЭлементСписка.Значение;
		Запись.РазрешеноПодтверждениеОтправки = ЭлементСписка.Пометка;
		Запись.Записать();
		Если ЭлементСписка.Пометка Тогда
			ПользователиМассив.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;

	Возврат ИнтеграцияСОтчетность24ВызовСервера.ПредставлениеГиперссылкиПользователиНастроек(Получатель);

КонецФункции

#КонецОбласти