#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.Кандидаты";
	КомандаПечати.Идентификатор = "Резюме";
	КомандаПечати.Представление = НСтр("ru = 'Резюме'");
	КомандаПечати.ЗаголовокФормы = КомандаПечати.Представление;
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.Кандидаты";
	КомандаПечати.Идентификатор = "РезюмеСРейтингом";
	КомандаПечати.Представление = НСтр("ru = 'Резюме (с оценками и комментариями)'");
	КомандаПечати.ЗаголовокФормы = КомандаПечати.Представление;
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Резюме");
	Если ПечатнаяФорма <> Неопределено Тогда
		СинонимМакета = НСтр("ru = 'Резюме'");
		ИменаФайлов = Новый Соответствие;
		ЗаполнитьИменаФайловПечатныхФорм(ИменаФайлов, МассивОбъектов, СинонимМакета);
		ПутьКМакету = "Справочник.Кандидаты.ПФ_MXL_Резюме";
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРезюме(МассивОбъектов, ОбъектыПечати, ПутьКМакету);
		ПечатнаяФорма.СинонимМакета = СинонимМакета;
		ПечатнаяФорма.ПолныйПутьКМакету = ПутьКМакету;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = ИменаФайлов;
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "РезюмеСРейтингом");
	Если ПечатнаяФорма <> Неопределено Тогда
		СинонимМакета = НСтр("ru = 'Резюме (с оценками и комментариями)'");
		ИменаФайлов = Новый Соответствие;
		ЗаполнитьИменаФайловПечатныхФорм(ИменаФайлов, МассивОбъектов, СинонимМакета);
		ПутьКМакету = "Справочник.Кандидаты.ПФ_MXL_Резюме";
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРезюме(МассивОбъектов, ОбъектыПечати, ПутьКМакету, Истина);
		ПечатнаяФорма.СинонимМакета = СинонимМакета;
		ПечатнаяФорма.ПолныйПутьКМакету = ПутьКМакету;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = ИменаФайлов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Взаимодействия

// Возвращает кандидата и контакты физического лица.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.Кандидаты	 - ссылка на предмет взаимодействий.
// 
// Возвращаемое значение:
//  Массив, Неопределено - контакты по предмету.
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоКонтактам();
	Запрос.УстановитьПараметр("Предмет",Ссылка);
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Результат = Неопределено;
		Иначе
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Составляет текст запроса по контактам предмета для подсистем Взаимодействия и Шаблоны сообщений.
//
// Параметры:
//  ТекстВременнаяТаблица	 - Строка	 - текст вложенного запроса.
//  Объединить				 - Булево	 - определяет необходимость объединения запросов.
// 
// Возвращаемое значение:
//  Строка - текст запроса.
//
Функция ТекстЗапросаПоКонтактам(ТекстВременнаяТаблица = "", Объединить = Ложь) Экспорт
	
	ШаблонВыбрать = ?(Объединить, "ВЫБРАТЬ РАЗЛИЧНЫЕ", "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ");
	
	ТекстЗапроса = "
		|%ШаблонВыбрать%
		|	Кандидаты.ЛичныеДанные КАК Контакт " + ТекстВременнаяТаблица + "
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Ссылка = &Предмет";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ШаблонВыбрать%", ШаблонВыбрать);
	
	Если Объединить Тогда
		ТекстЗапроса = "
			| ОБЪЕДИНИТЬ ВСЕ
			|" + ТекстЗапроса;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

// См. ШаблоныСообщенийПереопределяемый.ПриПодготовкеШаблонаСообщения
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	ДополнитьШаблонРеквизитамиОрганизации(Реквизиты, Вложения, ДополнительныеПараметры);
	ДополнитьШаблонРеквизитамиЭтапаРаботыСКандидатами(Реквизиты, Вложения, ДополнительныеПараметры);
	ДополнитьШаблонРеквизитамиПолучателя(Реквизиты, Вложения, ДополнительныеПараметры);
	ДополнитьШаблонРеквизитомСписокКандидатов(Реквизиты, Вложения, ДополнительныеПараметры);
	ДополнитьШаблонРеквизитамиАвторизацииВнешнегоПользователя(Реквизиты, Вложения, ДополнительныеПараметры);
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриФормированииСообщения
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	ЗаполнитьЗначенияДополнительныхРеквизитовШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	ЗаполнитьЗначенияПолучателяВДополнительныхРеквизитахШаблона(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	ЗаполнитьЗначениеДополнительногоРеквизитаСписокКандидатов(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	ВложитьПрисоединенныеФайлы(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	ЗаполнитьЗначенияДополнительныхРеквизитовАвторизацииВнешнегоПользователя(Сообщение, ПредметСообщения, ДополнительныеПараметры);
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииТелефоновПолучателейВСообщении
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииПочтыПолучателейВСообщении
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)
	|	И ЧтениеОбъектаРазрешено(ЛичныеДанные)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ЛичныеДанные)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьРолиКандидатов");
	Методы.Вставить("ЗаполнитьВалютуИПериодичностьОжидаемогоДохода");
	Методы.Вставить("СоздатьФизическиеЛицаДляУтвержденныхКандидатов");
	Методы.Вставить("ОтправитьРезюмеКандидатов", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки, , "ПодборПерсонала");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращаемое значение:
//  Структура - Дополнительные параметры решения по кандидату:
// * КомментарийРешения - Строка -
// * ПричинаОтклонения - СправочникСсылка.ПричиныОтклоненияКандидатов -
// * СоздатьФизическоеЛицо - Неопределено -
// * ГруппаДоступаФизическогоЛица - СправочникСсылка.ГруппыДоступаФизическихЛиц -
Функция ДополнительныеПараметрыРешенияПоКандидату() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("КомментарийРешения", "");
	Параметры.Вставить("ПричинаОтклонения", Справочники.ПричиныОтклоненияКандидатов.ПустаяСсылка());
	Параметры.Вставить("СоздатьФизическоеЛицо", Неопределено);
	Параметры.Вставить("ГруппаДоступаФизическогоЛица", Справочники.ГруппыДоступаФизическихЛиц.ПустаяСсылка());
		
	Возврат Параметры;
	
КонецФункции

// Установить решение по кандидату.
// 
// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
//  Решение - ПеречислениеСсылка.СостоянияСогласования
//  ДатаРешения - Дата,Неопределено - 
//  ДополнительныеПараметры - см. ДополнительныеПараметрыРешенияПоКандидату
Процедура УстановитьРешениеПоКандидату(Кандидат, Решение, ДатаРешения = Неопределено,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = ДополнительныеПараметрыРешенияПоКандидату();
	КонецЕсли;

	КандидатОбъект = Кандидат.ПолучитьОбъект();
	
	Попытка
		КандидатОбъект.Заблокировать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить решение %1 кандидату %2. 
                  |В данный момент изменение невозможно, так как кандидат редактируется другим пользователем или в другой форме программы.'"),
			Решение,
			КандидатОбъект.Наименование);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

	Если Решение = Перечисления.СостоянияСогласования.Согласовано Тогда
		КандидатОбъект.ДополнительныеСвойства.Вставить("ГруппаДоступаФизическогоЛица",
			ДополнительныеПараметры.ГруппаДоступаФизическогоЛица);
	КонецЕсли;
	КандидатОбъект.Состояние = Решение;
	КандидатОбъект.ДатаРешения = ДатаРешения;
	КандидатОбъект.КомментарийРешения = ДополнительныеПараметры.КомментарийРешения;
	КандидатОбъект.ПричинаОтклонения = ДополнительныеПараметры.ПричинаОтклонения;
	КандидатОбъект.Записать();
	
КонецПроцедуры

// Формирует таблицу значений с данными всех кандидатов указанных физических лиц.
//
// Параметры:
//	ФизическиеЛица- Массив из СправочникСсылка.ФизическиеЛица 
//
// Возвращаемое значение:
//  ТаблицаЗначений
Функция КандидатыФизическихЛиц(ФизическиеЛица) Экспорт
	
	ЛичныеДанныеКандидатов = ОбщегоНазначенияБЗККлиентСервер.ЗначенияСоответствия(
		ПодборПерсонала.ЛичныеДанныеКандидатовФизическихЛиц(ФизическиеЛица));
	
	СведенияОКандидатах = КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	СведенияОКандидатах.Сортировать("ФизическоеЛицо, ДатаРегистрации УБЫВ");
	
	Возврат СведенияОКандидатах;
	
КонецФункции

// Предназначен для получения физических лиц кандидатов.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты - массив кандидатов
//  ТолькоНеПомеченныеНаУдаление - Булево -
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение  
// 	* Ключ - СправочникСсылка.Кандидаты - кандидат из исходного массива
// 	* Значение - СправочникСсылка.ФизическиеЛица - физическое лицо кандидата
Функция ФизическиеЛицаКандидатов(Кандидаты, ТолькоНеПомеченныеНаУдаление = Ложь) Экспорт
	
	ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатов(Кандидаты);
	
	ФизическиеЛицаЛичныхДанныхКандидатов = ПодборПерсонала.ФизическиеЛицаЛичныхДанныхКандидатов(
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияСоответствия(ЛичныеДанныеКандидатов), ТолькоНеПомеченныеНаУдаление);
	
	Результат = Новый Соответствие();
	
	Для Каждого ТекущийЭлемент Из ФизическиеЛицаЛичныхДанныхКандидатов Цикл
		ЛичныеДанныеКандидата = ТекущийЭлемент.Ключ;
		ФизическоеЛицо = ТекущийЭлемент.Значение;
		Для Каждого ЭлементЛичныхДанных Из ЛичныеДанныеКандидатов Цикл
			Если ЭлементЛичныхДанных.Значение = ЛичныеДанныеКандидата Тогда
				Результат.Вставить(ЭлементЛичныхДанных.Ключ, ФизическоеЛицо);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Предназначен для получения физического лица кандидата.
// 
// Параметры:
// 	Кандидат - СправочникСсылка.Кандидаты - 
// 	ТолькоНеПомеченныеНаУдаление - Булево
// 	ПривилегированныйРежим - Булево
// 	
// Возвращаемое значение:
// 	СправочникСсылка.ФизическиеЛица -
Функция ФизическоеЛицоКандидата(Кандидат, ТолькоНеПомеченныеНаУдаление = Ложь, ПривилегированныйРежим = Ложь) Экспорт
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	ФизическоеЛицо = ФизическиеЛицаКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат),
		ТолькоНеПомеченныеНаУдаление)[Кандидат];
	Если ФизическоеЛицо = Неопределено Тогда
		ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

#Область ЛичныеДанныеКандидата

// Формирует таблицу значений с ссылками на кандидатов или данными всех кандидатов по указанным личным данным кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  ПолучатьДанныеКандидатов - Булево - если Ложь, то возвращаются только ссылки на кандидатов без сортировки по дате
//   регистрации
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, ПолучатьДанныеКандидатов = Истина) Экспорт
	
	Если ПолучатьДанныеКандидатов Тогда
		СведенияОКандидатах = ДанныеКандидатовПоЛичнымДанным(ЛичныеДанныеКандидатов);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Кандидаты.Ссылка КАК Кандидат,
			|	Кандидаты.ЛичныеДанные КАК ЛичныеДанныеКандидата
			|ИЗ
			|	Справочник.Кандидаты КАК Кандидаты
			|ГДЕ
			|	Кандидаты.ЛичныеДанные В (&ЛичныеДанные)";
		
		Запрос.УстановитьПараметр("ЛичныеДанные", ЛичныеДанныеКандидатов);
		РезультатЗапроса = Запрос.Выполнить();
		СведенияОКандидатах = РезультатЗапроса.Выгрузить();
		СведенияОКандидатах.Индексы.Добавить("ЛичныеДанныеКандидата");
	КонецЕсли;
	
	Возврат СведенияОКандидатах;
	
КонецФункции

// Предназначен для получения личных данных кандидатов.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты - массив кандидатов.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.Кандидаты - кандидат из исходного массива
//   * Значение - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата
Функция ЛичныеДанныеКандидатов(Кандидаты) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты, "ЛичныеДанные", Истина);
КонецФункции

// Возвращает ссылку на кандидата по переданным личным данным кандидата.
// Среди кандидатов выбирается кандидат с максимальной датой регистрации, и желательно, не помеченный на удаление.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  СправочникСсылка.Кандидаты
Функция СсылкаНаКандидатаПоЛичнымДанным(ЛичныеДанныеКандидата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.ЛичныеДанные = &ЛичныеДанные
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидаты.ПометкаУдаления ВОЗР,
		|	Кандидаты.ДатаРегистрации УБЫВ";
	
	Запрос.УстановитьПараметр("ЛичныеДанные", ЛичныеДанныеКандидата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Кандидат = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Кандидат = ПустаяСсылка();
	КонецЕсли;
	
	Возврат Кандидат;
	
КонецФункции

#КонецОбласти

// Массив кандидатов, соответствующих указанному отбору.
//
// Параметры:
//  Отбор	 - Структура Из КлючИЗначение:
//  	* Ключ - Строка - имя реквизита
//  	* Значение - Произвольный - значение реквизита
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Кандидаты - кандидаты, соответствующие отбору.
//
Функция КандидатыПоОтбору(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТКандидатыПоОтбору(Запрос.МенеджерВременныхТаблиц, Отбор);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кандидаты.Кандидат
		|ИЗ
		|	ВТКандидатыПоОтбору КАК Кандидаты";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Кандидаты = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Кандидаты.Добавить(Выборка.Кандидат);
	КонецЦикла;
	
	Возврат Кандидаты;
	
КонецФункции

Функция ДанныеКандидатов(Кандидаты) Экспорт
	Возврат ПодборПерсонала.ОсновныеСведенияОКандидатах(Кандидаты);
КонецФункции

// Данные кандидата.
// 
// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  Неопределено, Структура - Данные кандидата
Функция ДанныеКандидата(Кандидат) Экспорт

	ДанныеКандидатов = ДанныеКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат));
	Если ДанныеКандидатов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеКандидатов[0]);
	
КонецФункции

#Область ДанныеКандидата

#Область ИнициализацияСтруктурХранения

Функция СтруктураДанныхКандидата() Экспорт
	Возврат ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
КонецФункции

#КонецОбласти

#Область ПодготовкаДанных

// Подготавливает таблицу с данными об образовании по неполным переданным сведениям.
//
// Параметры:
//	СведенияОбОбразовании - Массив из Структура:
//	см. Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица.
//
// Возвращаемое значение:
//	ТаблицаЗначений - см. Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании
Функция ПодготовитьДанныеОбОбразовании(СведенияОбОбразовании) Экспорт
	
	ДанныеОбОбразовании = Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании();
	
	Для Каждого Образование Из СведенияОбОбразовании Цикл
		
		СтрокаОбразование = ДанныеОбОбразовании.Добавить();
		
		СтрокаОбразование.ВидОбразования = Образование.ВидОбразования;
		Если ТипЗнч(Образование.ВидОбразования) = Тип("Строка") И ЗначениеЗаполнено(Образование.ВидОбразования) Тогда
			СтрокаОбразование.ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.НайтиПоНаименованию(
				Образование.ВидОбразования, Истина);
		КонецЕсли;
		
		Если ТипЗнч(Образование.УчебноеЗаведение) = Тип("СправочникСсылка.УчебныеЗаведения") Тогда
			СтрокаОбразование.УчебноеЗаведениеСсылка = Образование.УчебноеЗаведение;
			СтрокаОбразование.УчебноеЗаведение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Образование.УчебноеЗаведение,
				"Наименование");
		ИначеЕсли ТипЗнч(Образование.УчебноеЗаведение) = Тип("Строка") Тогда
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц") Тогда
				МодульОбразованияФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ОбразованияФизическихЛиц");
				СтрокаОбразование.УчебноеЗаведениеСсылка = МодульОбразованияФизическихЛиц.НайтиСоздатьУчебноеЗаведение(
					Образование.УчебноеЗаведение);
			КонецЕсли;
			СтрокаОбразование.УчебноеЗаведение = Образование.УчебноеЗаведение;
		ИначеЕсли Образование.УчебноеЗаведение = Неопределено Тогда
			СтрокаОбразование.УчебноеЗаведениеСсылка = Справочники.УчебныеЗаведения.ПустаяСсылка();
			СтрокаОбразование.УчебноеЗаведение = "";
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
				СтрШаблон(НСтр("ru = 'Не известный тип учебного заведения - %1'"), ТипЗнч(Образование.УчебноеЗаведение)),
				"Справочники.Кандидаты.ПодготовитьДанныеОбОбразовании");
		КонецЕсли;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц") Тогда
			МодульОбразованияФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ОбразованияФизическихЛиц");
			СтрокаОбразование.СпециальностьСсылка = МодульОбразованияФизическихЛиц.НайтиСоздатьСпециальность(
				Образование.Специальность);
		КонецЕсли;
		СтрокаОбразование.Специальность = Образование.Специальность;
		СтрокаОбразование.Факультет = Образование.Факультет;
		
		Если Образование.Свойство("Квалификация") И ЗначениеЗаполнено(Образование.Квалификация) Тогда
			СтрокаОбразование.Квалификация = Образование.Квалификация;
		Иначе
			СтрокаОбразование.Квалификация = Образование.Факультет;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Образование.Окончание) И Образование.Окончание > 0 Тогда
			СтрокаОбразование.Окончание = Дата(Образование.Окончание, 1, 1);
		КонецЕсли;
		
		НаименованиеКурса = Неопределено;
		Если Образование.Свойство("НаименованиеКурса", НаименованиеКурса)
			И ЗначениеЗаполнено(НаименованиеКурса) Тогда
			СтрокаОбразование.НаименованиеКурса = НаименованиеКурса;
		КонецЕсли;
		
		ВидПослевузовскогоОбразования = Неопределено;
		Если Образование.Свойство("ВидПослевузовскогоОбразования", ВидПослевузовскогоОбразования)
			И ЗначениеЗаполнено(ВидПослевузовскогоОбразования) Тогда
			СтрокаОбразование.ВидПослевузовскогоОбразования = ВидПослевузовскогоОбразования;
		КонецЕсли;
		
		ВидДополнительногоОбучения = Неопределено;
		Если Образование.Свойство("ВидДополнительногоОбучения", ВидДополнительногоОбучения)
			И ЗначениеЗаполнено(ВидДополнительногоОбучения) Тогда
			СтрокаОбразование.ВидДополнительногоОбучения = ВидДополнительногоОбучения;
		КонецЕсли;
		
		Если СтрокаОбразование.ВидОбразования <>
			Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование 
			И СтрокаОбразование.ВидДополнительногоОбучения <> Перечисления.ВидыПрофессиональнойПодготовки.Переподготовка
			И СтрокаОбразование.ВидДополнительногоОбучения <>
				Перечисления.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации Тогда
			СтрокаОбразование.ОсновноеОбразование = Истина;
		КонецЕсли;
		
		Если Образование.Свойство("СкрыватьТ2", ) Тогда
			СтрокаОбразование.СкрыватьВТ2 = Образование.СкрыватьТ2;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеОбОбразовании;
	
КонецФункции

// Параметры:
//  ФИО - Структура, СправочникОбъект.ЛичныеДанныеКандидатов - 
//  УточнениеНаименованияЛичныхДанныхКандидата - Строка
//  УточнениеНаименованияКандидата - Строка
// 
// Возвращаемое значение:
//  Строка
Функция НаименованиеПоФИО(ФИО, УточнениеНаименованияЛичныхДанныхКандидата = "",
	УточнениеНаименованияКандидата = "") Экспорт
	
	Возврат КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		ФИО.Фамилия, 
		ФИО.Имя, 
		ФИО.Отчество, 
		УточнениеНаименованияЛичныхДанныхКандидата, 
		УточнениеНаименованияКандидата);
	
КонецФункции

#КонецОбласти

#КонецОбласти

Процедура УстановитьУсловноеОформлениеСпискаКандидатов(КандидатыСписок) Экспорт
	
	КандидатыСписок.УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.КандидатОдобренТекст);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, 
		"ЭтапРаботы", Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена);
	
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.КандидатОтклоненТекст);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, 
		"Состояние", Перечисления.СостоянияСогласования.Отклонено);
	
	// Представление даты по умолчанию.
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");

	// Представление даты в этом или будущем году.
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=''д МММ (ддд) ""в"" ЧЧ:мм'''"));
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоГода);
	
	// Представление даты сегодня.
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", НСтр("ru = 'ДФ=''""Сегодня в"" ЧЧ:мм'''"));
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоЭтогоДня);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДатаВремяЭтапа");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый СтандартнаяДатаНачала(ВариантСтандартнойДатыНачала.НачалоСледующегоДня);
	
	ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", "ДЛФ=D");
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДатаРегистрации");
	
	// Цвета этапов работы с кандидатами
	ДанныеРегистра = РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.ЦветаЭтаповРаботыСКандидатами();
	
	Для Каждого Строка Из ДанныеРегистра Цикл
		
		ЦветТекста = Строка.ЦветТекста.Получить();
		ЦветФона = Строка.ЦветФона.Получить();
		
		ЭлементОформления = КандидатыСписок.УсловноеОформление.Элементы.Добавить();
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭтапРаботы");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Строка.Этап;
		ЭлементОтбора.Использование = Истина;
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ЭтапРаботы");
		ПолеОформления.Использование = Истина;
		
		Если Не ЦветТекста = WebЦвета.Черный Тогда
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
		КонецЕсли;
		Если Не ЦветФона = WebЦвета.Белый Тогда
			ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		КонецЕсли;
		ЭлементОформления.Использование = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращае признак использования кандидатов.
// 
// Возвращаемое значение:
//  Булево - Истина, если включена функциональная опция ИспользоватьПодборПерсонала и у пользователя есть право на 
//  чтение справочника Кандидаты, иначе - Ложь 
Функция ИспользоватьКандидатов() Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Кандидаты) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

// Заполняет данные для направления на медицинский осмотр.
// 
// Параметры:
//  ДанныеЗаполнения - см. Документы.НаправлениеНаМедицинскийОсмотр.ОписаниеДляЗаполнения
Процедура ЗаполнитьДанныеДляНаправленияНаМедицинскийОсмотр(ДанныеЗаполнения) Экспорт

	Основание = ДанныеЗаполнения.Основание;
	Если ТипЗнч(Основание) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКандидата = ДанныеКандидата(Основание);
	
	Если ДанныеКандидата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		ВызватьИсключение НСтр("ru = 'Кандидат отклонен. 
			|Направление на медосмотр вводится для кандидатов на рассмотрении или утвержденных (одобренных) кандидатов.'");
	КонецЕсли;
	
	ДанныеЗаполнения.ЛичныеДанныеКандидата = ДанныеКандидата.ЛичныеДанныеКандидата;
	Если Не ЗначениеЗаполнено(ДанныеКандидата.ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	ДанныеЗаполнения.ФизическоеЛицо = ДанныеКандидата.ФизическоеЛицо;
	
	ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыДанных.Согласование = Истина;
	
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(ДанныеКандидата.Вакансия, ПараметрыДанных);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСогласованиеВакансий") Тогда
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Вакансия) Тогда
			ВызватьИсключение НСтр("ru = 'Вакансия не заполнена. 
				|Направление на медосмотр вводится для кандидата на согласованную вакансию.'");
		КонецЕсли;
		Если ДанныеВакансии.Согласование = Неопределено 
			Или ДанныеВакансии.Согласование.СостояниеСогласования <> Перечисления.СостоянияСогласования.Согласовано Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Вакансия %1 не согласована. 
						|Направление на медосмотр вводится для кандидата на согласованную вакансию.'"),
				ДанныеКандидата.Вакансия);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЕсли;
	
	ИсточникСтруктурыПредприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеВакансии.Подразделение, "Источник");
	Если ТипЗнч(ИсточникСтруктурыПредприятия) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Подразделение = ИсточникСтруктурыПредприятия;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ДанныеЗаполнения.Подразделение = Подразделение;
			ДанныеЗаполнения.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Владелец");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ИсточникСтруктурыПредприятия) = Тип("СправочникСсылка.Организации") Тогда
		ДанныеЗаполнения.Организация = ИсточникСтруктурыПредприятия;
	КонецЕсли;
	
	ДанныеЗаполнения.Должность = ДанныеВакансии.Должность;
	
	Если Не ДанныеВакансии.НоваяПозиция Тогда
		ДанныеЗаполнения.Организация = ДанныеВакансии.Организация;
	КонецЕсли;
	ДанныеЗаполнения.РабочееМесто = ДанныеВакансии.РабочееМесто;
	
КонецПроцедуры

#Область ОбработчикиРегистрацииФизическихЛиц

Функция ПринадлежностиОбъекта() Экспорт
	
	Принадлежности = Новый Массив;
	Принадлежности.Добавить("Подразделение");
	Принадлежности.Добавить("Позиция.Владелец");
	
	Возврат Принадлежности;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Процедура ЗаполнитьРолиКандидатов(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Кандидаты.УдалитьФизическоеЛицо КАК ФизическоеЛицо,
		|	Кандидаты.Позиция.Владелец КАК Организация
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РолиФизическихЛиц КАК РолиФизическихЛиц
		|		ПО Кандидаты.УдалитьФизическоеЛицо = РолиФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	Кандидаты.ПометкаУдаления = ЛОЖЬ
		|	И РолиФизическихЛиц.ФизическоеЛицо ЕСТЬ NULL";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.РолиФизическихЛиц.СоздатьНаборЗаписей();
		Набор.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		Набор.Отбор.Организация.Установить(Выборка.Организация);
		Набор.Отбор.Роль.Установить(Перечисления.РолиФизическихЛиц.Кандидат);
		
		Запись = Набор.Добавить();
		Запись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		Запись.Организация = Выборка.Организация;
		Запись.Роль = Перечисления.РолиФизическихЛиц.Кандидат;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.РолиФизическихЛиц", "ФизическоеЛицо", Выборка.ФизическоеЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;
	
	Обработанные.Добавить(Выборка.ФизическоеЛицо);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Процедура ЗаполнитьВалютуИПериодичностьОжидаемогоДохода(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Кандидаты.Ссылка КАК Кандидат
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.ВалютаДохода = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|	И Кандидаты.ПериодичностьДохода = ЗНАЧЕНИЕ(Перечисление.ПериодичностьОжидаемогоДоходаКандидатов.ПустаяСсылка)";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Кандидаты");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Кандидат = Выборка.Кандидат.ПолучитьОбъект();
			Кандидат.ВалютаДохода = ЗарплатаКадрыВызовСервера.ВалютаУчетаЗаработнойПлаты();
			Кандидат.ПериодичностьДохода = Перечисления.ПериодичностьОжидаемогоДоходаКандидатов.Месяц;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Кандидат);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьФизическиеЛицаДляУтвержденныхКандидатов(ПараметрыОбновления) Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	НовыеФизическиеЛица = Новый Массив;
	ПараметрыСозданияФизическогоЛица =
		Новый Структура("ГруппаДоступа", Справочники.ГруппыДоступаФизическихЛиц.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	Кандидаты.ЛичныеДанные КАК ЛичныеДанные
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО Кандидаты.ЛичныеДанные = ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата
		|ГДЕ
		|	Кандидаты.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|	И ФизическиеЛицаКандидатов.ФизическоеЛицо ЕСТЬ NULL";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Кандидаты");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ЛичныеДанныеКандидатов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ЛичныеДанные");

		Для Каждого ЛичныеДанныеКандидата Из ЛичныеДанныеКандидатов Цикл
			ФизическоеЛицоСсылка = Справочники.ЛичныеДанныеКандидатов.СоздатьФизическоеЛицоПоДаннымКандидата(
				ЛичныеДанныеКандидата, ПараметрыСозданияФизическогоЛица);
			НовыеФизическиеЛица.Добавить(ФизическоеЛицоСсылка);
		КонецЦикла;
		
		Если НовыеФизическиеЛица.Количество() > 0 И ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей")
			И ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейФизическиеЛица") Тогда
			Для Каждого НовоеФизическоеЛицо Из НовыеФизическиеЛица Цикл
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Для утвержденного кандидата было автоматически создано физическое
					| лицо %1 с пустой группой доступа. При необходимости следует установить группу доступа вручную.'"),
					НовоеФизическоеЛицо);
				ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
					УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.ФизическиеЛица,
					НовоеФизическоеЛицо, СтрЗаменить(ТекстСообщения, Символы.ПС, ""));
			КонецЦикла;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьИменаФайловПечатныхФорм(ИменаФайлов, Кандидаты, ИмяПечатнойФормы)
	
	УстановитьПривилегированныйРежим(Истина);
	ЛичныеДанныеКандидатов =  ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты, "ЛичныеДанные");
	УстановитьПривилегированныйРежим(Ложь);

	Для Каждого Кандидат Из Кандидаты Цикл
		ИмяФайла = ИмяФайлаВложенияКандидата(Кандидат, ИмяПечатнойФормы, ЛичныеДанныеКандидатов[Кандидат]);
		ИменаФайлов.Вставить(Кандидат, ИмяФайла);
	КонецЦикла;

КонецПроцедуры

Функция ИмяФайлаВложенияКандидата(Кандидат, НаименованиеВложения, Знач ЛичныеДанныеКандидата = Неопределено)

	Если ЛичныеДанныеКандидата = Неопределено Тогда
		ЛичныеДанныеКандидата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ЛичныеДанные");
	КонецЕсли;

	Шаблон = НСтр("ru = '[ФИО] [ДатаРождения] [НаименованиеВложения]'");

	ПараметрыШаблона = Новый Структура("ФИО, ДатаРождения, НаименованиеВложения");
	ПараметрыШаблона.ФИО = ЛичныеДанныеКандидата.ФИО;
	ПараметрыШаблона.ДатаРождения = Формат(ЛичныеДанныеКандидата.ДатаРождения, "ДЛФ=D;");
	ПараметрыШаблона.НаименованиеВложения = НаименованиеВложения;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыШаблона);
	
КонецФункции

Функция СоздатьКандидата(ЗначенияЗаполнения) Экспорт
	
	КандидатОбъект = СоздатьЭлемент();
	КандидатОбъект.Заполнить(ЗначенияЗаполнения);
	КандидатОбъект.Записать();
	Возврат КандидатОбъект;
	
КонецФункции

Процедура УстановитьВакансиюКандидату(Кандидат, Вакансия) Экспорт

	КандидатОбъект = Кандидат.ПолучитьОбъект();
	
	НачатьТранзакцию();
	Попытка
		КандидатОбъект.Заблокировать();
		КандидатОбъект.Заполнить(Вакансия);
		КандидатОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось установить вакансию кандидату %1. 
                  |Скорее всего кандидат редактируется другим пользователем или в другой форме программы.'"),
			КандидатОбъект.Наименование);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

КонецПроцедуры

Процедура ЗаполнитьРейтингПоКандидату(Область, СредниеОценки, Кандидат, ВыводитьРейтинг)
	
	Если ВыводитьРейтинг Тогда
		Область.Параметры.СреднийРейтинг = ПредставлениеСреднегоРейтинга(СредниеОценки, Кандидат);
		ВыводитьРейтинг = Ложь;
	ИначеЕсли ЗначениеЗаполнено(Область.Параметры.СреднийРейтинг) Тогда
		Область.Параметры.СреднийРейтинг = "";
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОтбора(ЛичныеДанныеКандидата)
	Возврат Новый Структура("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);
КонецФункции

Функция ПараметрыОтбораКандидата(Кандидат)
	Возврат Новый Структура("Кандидат", Кандидат);
КонецФункции

Функция СредниеОценкиКандидатов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кандидаты.Ссылка КАК Кандидат,
	|	Кандидаты.СреднийРейтинг КАК СредняяОценка
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|ГДЕ
	|	Кандидаты.Ссылка В
	|			(ВЫБРАТЬ
	|				СведенияОКандидатах.Кандидат КАК Кандидат
	|			ИЗ
	|				ВТСведенияОКандидатах КАК СведенияОКандидатах)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция КомментарииПоКандидатам(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомментарииКандидатов.Период КАК Период,
		|	КомментарииКандидатов.Кандидат КАК Кандидат,
		|	КомментарииКандидатов.Пользователь КАК Пользователь,
		|	КомментарииКандидатов.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.КомментарииКандидатов КАК КомментарииКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСведенияОКандидатах КАК СведенияОКандидатах
		|		ПО (СведенияОКандидатах.Кандидат = КомментарииКандидатов.Кандидат)
		|		И (КомментарииКандидатов.Пользователь = &Пользователь
		|		ИЛИ КомментарииКандидатов.Доступность = ЗНАЧЕНИЕ(Перечисление.ДоступностьКомментарияКандидата.Общедоступный))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидат,
		|	Период";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СведенияОбОпытеРаботыКандидата(ОпытРаботы, ЛичныеДанныеКандидата, ОбщийСтажРаботы)
	
	Сведения = Новый ТаблицаЗначений;
	
	Сведения.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	Сведения.Колонки.Добавить("ПериодРаботы", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Сведения.Колонки.Добавить("ПредставлениеПериода", ОбщегоНазначения.ОписаниеТипаСтрока(25));
	Сведения.Колонки.Добавить("Компания", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Сведения.Колонки.Добавить("Должность", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Сведения.Колонки.Добавить("Обязанности", Новый ОписаниеТипов("Строка"));
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ОкончаниеПериодаСтажа = '00010101';
	ДатаОкончанияПредыдущая = '00010101';
	
	СтрокиДанныхОбОпытеРаботы = ОпытРаботы.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	
	Если СтрокиДанныхОбОпытеРаботы.Количество() > 0 Тогда
		
		НомерСтроки = 1;
		
		Для Каждого СтрокаДанных Из СтрокиДанныхОбОпытеРаботы Цикл
			
			НоваяСтрока = Сведения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных, "Компания, Должность, Обязанности");
			
			ДатаОкончания = ?(СтрокаДанных.ДатаОкончания <> '00010101', КонецМесяца(СтрокаДанных.ДатаОкончания),
				ТекущаяДата);
			
			НоваяСтрока.НомерСтроки = НомерСтроки;
			НоваяСтрока.ПериодРаботы = СтрШаблон("%1 - %2",
				Формат(СтрокаДанных.ДатаНачала, НСтр("ru='ДФ=''ММММ гггг'''")),
				Формат(ДатаОкончания, НСтр("ru='ДФ=''ММММ гггг'''")));
			
			НоваяСтрока.ПредставлениеПериода = ПредставлениеПериодаРаботы(СтрокаДанных.ДатаНачала, ДатаОкончания);
			
			ДатаНачала = ?(ДатаОкончанияПредыдущая > СтрокаДанных.ДатаНачала, ДатаОкончанияПредыдущая + 1,
				СтрокаДанных.ДатаНачала);
			ДатаОкончания = Макс(ДатаОкончания, ДатаНачала);
			
			Если ДатаОкончания > ДатаОкончанияПредыдущая Тогда
				ОкончаниеПериодаСтажа = ОкончаниеПериодаСтажа + (ДатаОкончания - ДатаНачала);
				ДатаОкончанияПредыдущая = ДатаОкончания;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
		КонецЦикла;
		
		Лет = Год(ОкончаниеПериодаСтажа) - 1;
		Месяцев = Месяц(ОкончаниеПериодаСтажа);
		
		Если Лет > 0 И Месяцев > 0 Тогда
			ОбщийСтажРаботы = СтрШаблон(НСтр("ru = '- %1 %2'"), ПредставлениеЛет(Лет), ПредставлениеМесяцев(Месяцев));
		Иначе
			ОбщийСтажРаботы = СтрШаблон(НСтр("ru = '- %1'"), ?(Лет > 0, ПредставлениеЛет(Лет),
				ПредставлениеМесяцев(Месяцев)));
		КонецЕсли;
		
	КонецЕсли;
	
	Сведения.Сортировать("НомерСтроки Убыв");
	
	Возврат Сведения;
	
КонецФункции

Функция СведенияОКомментарияхПоКандидату(Комментарии, Кандидат)
	
	Сведения = Новый ТаблицаЗначений;
	Сведения.Колонки.Добавить("ПользовательПериод", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	Сведения.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	
	Если Комментарии <> Неопределено Тогда
		
		СтрокиДанныхСКомментариями = Комментарии.НайтиСтроки(ПараметрыОтбораКандидата(Кандидат));
		Если СтрокиДанныхСКомментариями.Количество() > 0 Тогда
			
			Для Каждого СтрокаДанных Из СтрокиДанныхСКомментариями Цикл
				
				НоваяСтрока = Сведения.Добавить();
				НоваяСтрока.Комментарий = СтрокаДанных.Комментарий;
				НоваяСтрока.ПользовательПериод = СтрШаблон("%1 (%2)", СтрокаДанных.Пользователь, Формат(СтрокаДанных.Период, "ДЛФ=Д"));
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Сведения;
	
КонецФункции

// Параметры:
//  Образование - см. ПодборПерсонала.ОбразованиеКандидатовПоДаннымВТ
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - Личные данные кандидата
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеСведенийОбОбразовании(Образование, ЛичныеДанныеКандидата)
	
	Представление = "";
	СтрокиДанныхОбОбразовании = Образование.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	
	Если СтрокиДанныхОбОбразовании.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из СтрокиДанныхОбОбразовании Цикл
			ПредставлениеЗаписи = "";
			
			Если ЗначениеЗаполнено(СтрокаДанных.Факультет) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2, ", ПредставлениеЗаписи, СокрЛП(СтрокаДанных.Факультет));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.Специальность) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2, ", ПредставлениеЗаписи, СокрЛП(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Специальность, "ПолноеНаименование")));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.УчебноеЗаведение) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2, ", ПредставлениеЗаписи,
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.УчебноеЗаведение, "ПолноеНаименование"));
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(СтрокаДанных.ВидОбразования) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2", ПредставлениеЗаписи, СокрЛП(СтрокаДанных.ВидОбразования));
			Иначе
				СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПредставлениеЗаписи, 2);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ГодОкончания) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1 - %2 г.", ПредставлениеЗаписи,
					Формат(СтрокаДанных.ГодОкончания, "ЧГ=0"));
			КонецЕсли;
			
			Если Не ПустаяСтрока(ПредставлениеЗаписи) Тогда
				Представление = Представление + ПредставлениеЗаписи + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Представление = ПредставлениеОтсутствияСведений();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Параметры:
//  Курсы - см. ПодборПерсонала.КурсыКандидатовПоДаннымВТ
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - Личные данные кандидата
// 
// Возвращаемое значение:
//  Строка
Функция ПредставлениеСведенийОКурсах(Курсы, ЛичныеДанныеКандидата)
	
	Представление = "";
	СтрокиДанныхОбОбразовании = Курсы.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	
	Если СтрокиДанныхОбОбразовании.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из СтрокиДанныхОбОбразовании Цикл
			ПредставлениеЗаписи = "";
			
			Если ЗначениеЗаполнено(СтрокаДанных.НаименованиеКурса) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2, ", ПредставлениеЗаписи, СокрЛП(СтрокаДанных.НаименованиеКурса));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.УчебноеЗаведение) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1%2", ПредставлениеЗаписи,
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.УчебноеЗаведение, "ПолноеНаименование"));
			Иначе
				СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПредставлениеЗаписи, 2);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ГодОкончания) Тогда
				ПредставлениеЗаписи = СтрШаблон("%1 - %2 г.", ПредставлениеЗаписи,
					Формат(СтрокаДанных.ГодОкончания, "ЧГ=0"));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДанных.ДополнительнаяИнформация) Тогда
				ПредставлениеЗаписи = ПредставлениеЗаписи + Символы.ПС;
				ПредставлениеЗаписи = СтрШаблон("%1%2", ПредставлениеЗаписи,
					СокрЛП(СтрокаДанных.ДополнительнаяИнформация));
			КонецЕсли;
			
			Если Не ПустаяСтрока(ПредставлениеЗаписи) Тогда
				Представление = Представление + ПредставлениеЗаписи + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Представление = ПредставлениеОтсутствияСведений();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеСведенийОСпециальностях(Образование, ЛичныеДанныеКандидата)
	
	Представление = "";
	
	СтрокиДанныхОбОбразовании = Образование.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	Если СтрокиДанныхОбОбразовании.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из СтрокиДанныхОбОбразовании Цикл
			ПредставлениеЗаписи = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДанных.Специальность, "ПолноеНаименование")); 
			Если ПустаяСтрока(Представление) Тогда
				Представление = ПредставлениеЗаписи;
			Иначе
				Представление = СтрШаблон("%1%2%3", Представление, Символы.ПС, ПредставлениеЗаписи);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) Тогда
		Представление = ПредставлениеОтсутствияСведений();
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеСведенийОЗнанииЯзыков(ЗнанияЯзыков, ЛичныеДанныеКандидата)
	
	СтрокиКандидата = ЗнанияЯзыков.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	Представление = РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.ПредставлениеВладениеЯзыкамиПоКоллекцииЗаписей(
		СтрокиКандидата, Ложь);
	
	Возврат НСтр("ru = 'Знание языков:'") + Символы.НПП + Представление;
	
КонецФункции

Функция ПредставлениеСведенийОДополнительныхКонтактах(ДополнительныеКонтакты, ЛичныеДанныеКандидата)
	
	Представление = "";
	
	СтрокиДополнительныеКонтакты = ДополнительныеКонтакты.НайтиСтроки(ПараметрыОтбора(ЛичныеДанныеКандидата));
	Если СтрокиДополнительныеКонтакты.Количество() > 0 Тогда
		Для Каждого СтрокаДанных Из СтрокиДополнительныеКонтакты Цикл
			Если ПустаяСтрока(СтрокаДанных.Представление) Тогда
				Продолжить;
			Иначе
				Представление = Представление + СтрШаблон("%1: %2", СтрокаДанных.Вид, СтрокаДанных.Представление) + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеСреднегоРейтинга(СредниеРейтинги, Кандидат)
	
	Представление = "";
	СтрокиКандидата = СредниеРейтинги.НайтиСтроки(ПараметрыОтбораКандидата(Кандидат));
	
	Если СтрокиКандидата.Количество() > 0 Тогда
		Представление = СтрШаблон(НСтр("ru='Рейтинг: %1/5'"), СтрокиКандидата[0].СредняяОценка);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПредставлениеОжидаемогоДохода(ДанныеПечати)
	
	ОжидаемыйДоход = НСтр("ru = 'не указан'");
	Если ДанныеПечати.ОжидаемыйДоход > 0 Тогда
		
		ВалютаПоУмолчанию = ЗарплатаКадрыВызовСервера.ВалютаУчетаЗаработнойПлаты();
		
		Если ДанныеПечати.ПериодичностьДохода <> Перечисления.ПериодичностьОжидаемогоДоходаКандидатов.Месяц Тогда
			ПериодичностьДохода = ДанныеПечати.ПериодичностьДохода;
		Иначе
			ПериодичностьДохода = ""
		КонецЕсли;
		
		ОжидаемыйДоход = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 %3'"),
			ДанныеПечати.ОжидаемыйДоход, ДанныеПечати.ВалютаДохода, ПериодичностьДохода);
			
		Сумма = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(ДанныеПечати.ОжидаемыйДоход,
			ДанныеПечати.ВалютаДохода);
		
		Если ДанныеПечати.ВалютаДохода <> ВалютаПоУмолчанию Тогда
			ОжидаемыйДоход = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 (%2)'"), ОжидаемыйДоход, ПодборПерсоналаКлиентСервер.ПредставлениеОжидаемогоДохода(
				Сумма, ВалютаПоУмолчанию));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОжидаемыйДоход;
	
КонецФункции

Функция ПредставлениеОтсутствияСведений()
	Возврат НСтр("ru = 'Нет сведений.'");
КонецФункции

Функция ПредставлениеПериодаРаботы(ДатаНачала, ДатаОкончания)
	
	Представление = "";
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат "";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) 
		Или ДатаОкончания < ДатаНачала Тогда
		ДатаОкончания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЛетРаботы = Год(ДатаОкончания) - Год(ДатаНачала);
	МесяцевРаботы = Месяц(ДатаОкончания)- Месяц(ДатаНачала) + 1;
	
	Если Месяц(ДатаНачала) > Месяц(ДатаОкончания) Тогда
		ЛетРаботы = ЛетРаботы - 1;
		МесяцевРаботы = 12 + МесяцевРаботы;
	КонецЕсли;
	
	Если День(ДатаНачала) > День(ДатаОкончания) Тогда
		МесяцевРаботы = МесяцевРаботы - 1;
	КонецЕсли;
	
	ЛетРаботы = Макс(ЛетРаботы, 0);
	МесяцевРаботы = Макс(МесяцевРаботы, 0);
	
	ПредставлениеЛет = ?(ЛетРаботы > 0, ПредставлениеЛет(ЛетРаботы), "");
	ПредставлениеМесяцев = ?(МесяцевРаботы > 0, ПредставлениеМесяцев(МесяцевРаботы), "");
	
	Представление = СтрШаблон("%1%2%3", ПредставлениеЛет, ?(Не ПустаяСтрока(ПредставлениеЛет) 
		И Не ПустаяСтрока(ПредставлениеМесяцев), Символы.НПП + НСтр("ru = 'и'") + Символы.НПП, ""), ПредставлениеМесяцев);
	
	Возврат Представление;
	
КонецФункции

Функция ПечатьРезюме(МассивОбъектов, ОбъектыПечати, ПутьКМакету, ВыводитьРейтингИКомментарии = Ложь)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ОсновныеСведенияОКандидатах = ПодборПерсонала.ОсновныеСведенияОКандидатах(МассивОбъектов, МенеджерВременныхТаблиц);
	
	ОпытРаботы = ПодборПерсонала.ОпытРаботыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТЛичныеДанныеКандидатов",
		"ЛичныеДанныеКандидата");
	
	Образование = ПодборПерсонала.ОбразованиеКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТЛичныеДанныеКандидатов",
		"ЛичныеДанныеКандидата");
	Образование.Сортировать("ГодОкончания Убыв");
	
	Курсы = ПодборПерсонала.КурсыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТЛичныеДанныеКандидатов",
		"ЛичныеДанныеКандидата");
	
	ЗнаниеЯзыков = ПодборПерсонала.ЗнаниеЯзыковКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТЛичныеДанныеКандидатов",
		"ЛичныеДанныеКандидата");
	
	ДополнительныеКонтакты = ПодборПерсонала.ДополнительныеКонтактыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц,
		"ВТЛичныеДанныеКандидатов", "ЛичныеДанныеКандидата");
	
	СредниеОценки = СредниеОценкиКандидатов(МенеджерВременныхТаблиц);
	
	Комментарии = Неопределено;
	Если ВыводитьРейтингИКомментарии Тогда
		Комментарии = КомментарииПоКандидатам(МенеджерВременныхТаблиц);
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Резюме";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПутьКМакету);
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтаж = Макет.ПолучитьОбласть("Стаж");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	
	Для Каждого ДанныеПечати Из ОсновныеСведенияОКандидатах Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
		ОбластьШапка.Параметры.ОжидаемыйДоход = ПредставлениеОжидаемогоДохода(ДанныеПечати);
		ОбластьШапка.Параметры.ДатаРождения = Формат(ДанныеПечати.ДатаРождения, "ДЛФ=Д");
		ОбластьШапка.Параметры.ПолныхЛет = ?(ДанныеПечати.Возраст <> 0,
			", " + ПредставлениеЛет(ДанныеПечати.Возраст), "");
		ОбластьШапка.Параметры.Почта = ДанныеПечати.EMail;
		ОбластьШапка.Параметры.Страна = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ДанныеПечати.Гражданство, "Наименование");
		ОбластьШапка.Параметры.ДополнительныеКонтакты = ПредставлениеСведенийОДополнительныхКонтактах(
			ДополнительныеКонтакты, ДанныеПечати.ЛичныеДанныеКандидата);
		
		Если ЗначениеЗаполнено(ДанныеПечати.ФотографияСсылка) Тогда
			Фотография = Новый Картинка(РаботаСФайлами.ДвоичныеДанныеФайла(ДанныеПечати.ФотографияСсылка));
			ОбластьШапка.Рисунки.Фотография.Картинка = Фотография;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбщийСтажРаботы = "";
		СтрокиСведенийОбОпытеРаботы = СведенияОбОпытеРаботыКандидата(ОпытРаботы, ДанныеПечати.ЛичныеДанныеКандидата,
			ОбщийСтажРаботы);
		
		ВыводитьРейтинг = ВыводитьРейтингИКомментарии;
		ВыводитьКомментарии = ВыводитьРейтингИКомментарии;
		
		Если СтрокиСведенийОбОпытеРаботы.Количество() > 0 Тогда 
			ЗаполнитьРейтингПоКандидату(ОбластьСтаж, СредниеОценки, ДанныеПечати.Кандидат, ВыводитьРейтинг);
			ОбластьСтаж.Параметры.ОбщийСтажРаботы = ОбщийСтажРаботы;
			ТабличныйДокумент.Вывести(ОбластьСтаж);
			Для Каждого СтрокаСведений Из СтрокиСведенийОбОпытеРаботы Цикл
				ОбластьСтрока.Параметры.Заполнить(СтрокаСведений);
				ТабличныйДокумент.Вывести(ОбластьСтрока);
			КонецЦикла;
		Иначе
			ЗаполнитьРейтингПоКандидату(ОбластьПустаяСтрока, СредниеОценки, ДанныеПечати.Кандидат, ВыводитьРейтинг);
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		КонецЕсли;
		
		ОбластьПодвал.Параметры.Образование = ПредставлениеСведенийОбОбразовании(Образование,
			ДанныеПечати.ЛичныеДанныеКандидата);
		ОбластьПодвал.Параметры.Специальности = ПредставлениеСведенийОСпециальностях(Образование,
			ДанныеПечати.ЛичныеДанныеКандидата);
		ОбластьПодвал.Параметры.Дополнительно = ПредставлениеСведенийОЗнанииЯзыков(ЗнаниеЯзыков,
			ДанныеПечати.ЛичныеДанныеКандидата);
		ОбластьПодвал.Параметры.ОСебе = ДанныеПечати.ОСебе;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		Если Курсы.Количество() > 0 Тогда
			ОбластьДопОбразование = Макет.ПолучитьОбласть("ДопОбразование");
			ОбластьДопОбразование.Параметры.ДопОбразование = ПредставлениеСведенийОКурсах(Курсы,
				ДанныеПечати.ЛичныеДанныеКандидата);
			ТабличныйДокумент.Вывести(ОбластьДопОбразование);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеПечати.Письмо) Тогда
			ОбластьПисьмо = Макет.ПолучитьОбласть("СопроводительноеПисьмо");
			ОбластьПисьмо.Параметры.Заполнить(ДанныеПечати);
			ТабличныйДокумент.Вывести(ОбластьПисьмо);
		КонецЕсли;
		Если ВыводитьКомментарии Тогда
			ОбластьКомментарииШапка = Макет.ПолучитьОбласть("КомментарииШапка");
			ОбластьКомментарииСтрока = Макет.ПолучитьОбласть("КомментарииСтрока");
			СтрокиСведенийОКомментариях = СведенияОКомментарияхПоКандидату(Комментарии, ДанныеПечати.Кандидат);
			Если СтрокиСведенийОКомментариях.Количество() > 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьКомментарииШапка);
				Для Каждого СтрокаСведений Из СтрокиСведенийОКомментариях Цикл
					ОбластьКомментарииСтрока.Параметры.Заполнить(СтрокаСведений);
					ТабличныйДокумент.Вывести(ОбластьКомментарииСтрока);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеПечати.Кандидат);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ДополнитьШаблонРеквизитамиОрганизации(Реквизиты, Вложения, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры["ПолноеИмяТипаНазначения"] <> Метаданные.Справочники.Кандидаты.ПолноеИмя() Тогда
		Возврат;
	КонецЕсли;
	
	// Организация и ее адрес.
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.Имя = "Кандидаты.Организация.Наименование";
	НоваяСтрока.Представление = НСтр("ru = 'Наименование организации'");
	
	НоваяСтрока = Реквизиты.Добавить();
	НоваяСтрока.Имя = "Кандидаты.Организация.ФактическийАдрес";
	НоваяСтрока.Представление = НСтр("ru = 'Фактический адрес организации'");
	
КонецПроцедуры

Процедура ДополнитьШаблонРеквизитамиЭтапаРаботыСКандидатами(Реквизиты, Вложения, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры["ВладелецШаблона"] <> Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом Тогда
		Возврат;
	КонецЕсли;
	
	// Этап работы.
	ГруппаЭтапРаботы = Реквизиты.Родитель.Владелец().Строки.Добавить();
	ГруппаЭтапРаботы.Имя = "ЭтапРаботы";
	ГруппаЭтапРаботы.Представление = НСтр("ru = 'Этап работы'");
	
	РеквизитыЭтапа = ГруппаЭтапРаботы.Строки;
	
	// Наименование.
	НоваяСтрока = РеквизитыЭтапа.Добавить();
	НоваяСтрока.Имя = "ЭтапРаботы.Наименование";
	НоваяСтрока.Представление = НСтр("ru = 'Наименование'");
	
	// Дата.
	НоваяСтрока = РеквизитыЭтапа.Добавить();
	НоваяСтрока.Имя = "ЭтапРаботы.Дата";
	НоваяСтрока.Представление = НСтр("ru = 'Дата этапа'");
	НоваяСтрока.Тип = Тип("Дата");
	
	// Время.
	НоваяСтрока = РеквизитыЭтапа.Добавить();
	НоваяСтрока.Имя = "ЭтапРаботы.Время";
	НоваяСтрока.Представление = НСтр("ru = 'Время этапа'");
	НоваяСтрока.Тип = Тип("Дата");
	
	Видеособеседования.ДополнитьШаблонСообщения(РеквизитыЭтапа);
	
КонецПроцедуры

Процедура ДополнитьШаблонРеквизитамиПолучателя(Реквизиты, Вложения, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры["ПолноеИмяТипаНазначения"] <> Метаданные.Справочники.Кандидаты.ПолноеИмя() Тогда
		Возврат;
	КонецЕсли;

	ШаблоныСообщенийБЗК.ДополнитьШаблонРеквизитамиПолучателя(Реквизиты, Вложения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДополнитьШаблонРеквизитомСписокКандидатов(Реквизиты, Вложения, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры["ВладелецШаблона"] <> Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСКандидатами Тогда
		Возврат;
	КонецЕсли;

	ГруппаСписки = Реквизиты.Родитель.Владелец().Строки.Добавить();
	ГруппаСписки.Имя = "Списки";
	ГруппаСписки.Представление = НСтр("ru = 'Списки'");
	
	РеквизитыСписка = ГруппаСписки.Строки;
	
	НоваяСтрока = РеквизитыСписка.Добавить();
	НоваяСтрока.Имя = "Списки.СписокКандидатов";
	НоваяСтрока.Представление = НСтр("ru = 'Список кандидатов'");

КонецПроцедуры

Процедура ДополнитьШаблонРеквизитамиАвторизацииВнешнегоПользователя(Реквизиты, Вложения, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры["ВладелецШаблона"] <> Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ПриглашениеНаЭлектронноеТестирование Тогда
		Возврат;
	КонецЕсли;
	
	Группа = Реквизиты.Родитель.Владелец().Строки.Добавить();
	Группа.Имя = "АвторизацияВнешнегоПользователя";
	Группа.Представление = НСтр("ru = 'Авторизация внешнего пользователя'");
	
	РеквизитыАвторизации = Группа.Строки;
	
	НоваяСтрока = РеквизитыАвторизации.Добавить();
	НоваяСтрока.Имя = "АвторизацияВнешнегоПользователя.ВебСсылкаПереходаВСистему";
	НоваяСтрока.Представление = НСтр("ru = 'Веб ссылка перехода в систему'");
	
	НоваяСтрока = РеквизитыАвторизации.Добавить();
	НоваяСтрока.Имя = "АвторизацияВнешнегоПользователя.ИмяПользователяИБ";
	НоваяСтрока.Представление = НСтр("ru = 'Имя пользователя ИБ'");
	
	НоваяСтрока = РеквизитыАвторизации.Добавить();
	НоваяСтрока.Имя = "АвторизацияВнешнегоПользователя.Пароль";
	НоваяСтрока.Представление = НСтр("ru = 'Пароль'");

КонецПроцедуры

Процедура ЗаполнитьЗначенияДополнительныхРеквизитовШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияРеквизитовОрганизацииШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры);	
	ЗаполнитьЗначенияРеквизитовЭтапаРаботыШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПолучателяВДополнительныхРеквизитахШаблона(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	ШаблоныСообщенийБЗК.ЗаполнитьЗначенияПолучателяВДополнительныхРеквизитахШаблона(
		Сообщение, ПредметСообщения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗаполнитьЗначениеДополнительногоРеквизитаСписокКандидатов(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;

	РеквизитыГруппыСписки = Сообщение.ДополнительныеПараметры.ПроизвольныеПараметры["Списки"];
	Если РеквизитыГруппыСписки = Неопределено Или РеквизитыГруппыСписки["СписокКандидатов"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = ДополнительныеПараметры.ПараметрыСообщения;
	Если ПараметрыСообщения = Неопределено 
		Или Не ПараметрыСообщения.Свойство("Кандидаты") 
		Или ПараметрыСообщения.Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML Тогда
		ПредставлениеСписка = СписокКандидатовВФорматеHTML(ПараметрыСообщения["Кандидаты"]);
	Иначе
		ПредставлениеСписка = СписокКандидатовВФорматеОбычныйТекст(ПараметрыСообщения["Кандидаты"]);
	КонецЕсли;
	
	РеквизитыГруппыСписки.Вставить("СписокКандидатов", ПредставлениеСписка);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияДополнительныхРеквизитовАвторизацииВнешнегоПользователя(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыАвторизации = Сообщение.ДополнительныеПараметры.ПроизвольныеПараметры["АвторизацияВнешнегоПользователя"];
		
	Если РеквизитыАвторизации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКандидаты = Новый Массив;
	МассивКандидаты.Добавить(ПредметСообщения);
	ДанныеПользователя = ЭлектронноеТестированиеКандидатов.СоздатьВнешнихПользователейИОтправитьПриглашение(МассивКандидаты, Ложь);
	
	РеквизитыАвторизации.Вставить("ВебСсылкаПереходаВСистему",
		ДанныеПользователя.ВебСсылкаПереходаВСистему);
	РеквизитыАвторизации.Вставить("ИмяПользователяИБ",
		ДанныеПользователя.ИмяПользователя);
	РеквизитыАвторизации.Вставить("Пароль",
		ДанныеПользователя.Пароль);
	
КонецПроцедуры

Функция СписокКандидатовВФорматеHTML(Кандидаты)

	ПредставлениеСписка = "";
	Для Каждого Кандидат Из Кандидаты Цикл
		ПредставлениеСписка = ПредставлениеСписка + "<li>" + Кандидат + "</li>";
	КонецЦикла;
	Возврат "<ul>" + ПредставлениеСписка + "</ul>";
	
КонецФункции

Функция СписокКандидатовВФорматеОбычныйТекст(Кандидаты)

	ПредставлениеСписка = "";
	Для Каждого Кандидат Из Кандидаты Цикл
		Если Не ПустаяСтрока(ПредставлениеСписка) Тогда
			ПредставлениеСписка = ПредставлениеСписка + Символы.ПС;
		КонецЕсли;
		ПредставлениеСписка = ПредставлениеСписка + Кандидат;
	КонецЦикла;
	Возврат ПредставлениеСписка;
		
КонецФункции

Процедура ЗаполнитьЗначенияРеквизитовОрганизацииШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидат", ПредметСообщения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кандидаты.Позиция.Владелец КАК Организация,
		|	Кандидаты.ДатаРегистрации КАК ДатаРегистрации,
		|	Кандидаты.Позиция.Владелец.НаименованиеСокращенное КАК НазваниеОрганизации
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Ссылка = &Кандидат";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ВидФактическийАдрес = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ФактАдресОрганизации");
	ФактическийАдресПредставление = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		Выборка.Организация,
		ВидФактическийАдрес,
		Выборка.ДатаРегистрации);
	
	РеквизитыОрганизации = Новый Соответствие;
	РеквизитыОрганизации.Вставить("Наименование", Выборка.НазваниеОрганизации);
	РеквизитыОрганизации.Вставить("ФактическийАдрес", ФактическийАдресПредставление);
	
	Сообщение.ЗначенияРеквизитов.Вставить("Организация", РеквизитыОрганизации);
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияРеквизитовЭтапаРаботыШаблонаЭтапаРаботыСКандидатами(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЭтапа = Сообщение.ДополнительныеПараметры.ПроизвольныеПараметры["ЭтапРаботы"];
	Если РеквизитыЭтапа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = ДополнительныеПараметры.ПараметрыСообщения;
	
	Если ПараметрыСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыСообщения.Свойство("ЭтапРаботы") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыЭтапа.Вставить("Наименование", Строка(ПараметрыСообщения.ЭтапРаботы));
	РеквизитыЭтапа.Вставить("Дата", Формат(ПараметрыСообщения.ДатаВремя, "ДЛФ=D"));
	РеквизитыЭтапа.Вставить("Время", Формат(ПараметрыСообщения.ДатаВремя, "ДФ=ЧЧ:мм"));
	
	Видеособеседования.ЗаполнитьЗначенияРеквизитовШаблонаСообщения(РеквизитыЭтапа, ПараметрыСообщения);
	
КонецПроцедуры

Функция ОтправитьРезюмеКандидатов(ШаблонСообщения, Кандидаты, Получатели, УчетнаяЗапись, ВложитьПрисоединенныеФайлы) Экспорт

	ДлительныеОперации.СообщитьПрогресс(5);
	
	Результаты = Новый Соответствие;
	
	ПараметрыОтправки = ПодборПерсоналаКлиентСервер.ОписаниеПараметровОтправкиРезюме();
	ПараметрыОтправки.ВложитьПрисоединенныеФайлы = ВложитьПрисоединенныеФайлы;
	ПараметрыОтправки.УчетнаяЗапись = УчетнаяЗапись;
	
	ОбработаноРезюме = 0;
	Для Каждого Кандидат Из Кандидаты Цикл
		РезультатОтправки = ОтправитьРезюмеКандидата(Кандидат, Получатели, ШаблонСообщения, ПараметрыОтправки);
		СохранитьРезультатОтправки(Кандидат, Получатели, РезультатОтправки);
		Результаты.Вставить(Кандидат, РезультатОтправки);
		ДлительныеОперации.СообщитьПрогресс(ПрогрессОтправки(ОбработаноРезюме, Кандидаты.Количество()));
		ОбработаноРезюме = ОбработаноРезюме + 1;
	КонецЦикла;
	
	Возврат Результаты;
	
КонецФункции

Функция ОтправитьРезюмеКандидата(Кандидат, Получатели, Шаблон, ДополнительныеПараметры)

	ПараметрыОтправки = ПодборПерсоналаКлиентСервер.ОписаниеПараметровОтправкиРезюме();
	ПараметрыОтправки.Получатели = Получатели;
	ПараметрыОтправки.ПерезаполнятьПолучателей = Истина;
	ПараметрыОтправки.ВложитьПрисоединенныеФайлы = ДополнительныеПараметры.ВложитьПрисоединенныеФайлы;
	ПараметрыОтправки.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат);
	ПараметрыОтправки.УчетнаяЗапись = ДополнительныеПараметры.УчетнаяЗапись;

	РезультатОтправкиПоШаблону = ШаблоныСообщений.СформироватьСообщениеИОтправить(
		Шаблон, Кандидат, Новый УникальныйИдентификатор, ПараметрыОтправки);

	РезультатОтправки = РегистрыСведений.ОтправкаРезюме.ОписаниеРезультатаОтправки();
	РезультатОтправки.Отправлено = Не ЗначениеЗаполнено(РезультатОтправкиПоШаблону.ОписаниеОшибки);
	РезультатОтправки.ОписаниеОшибки = РезультатОтправкиПоШаблону.ОписаниеОшибки;
	РезультатОтправки.ДатаОтправления = ТекущаяДатаСеанса();
	РезультатОтправки.Письмо = РезультатОтправкиПоШаблону.СсылкаНаПисьмо;

	Возврат РезультатОтправки;
	
КонецФункции

Процедура СохранитьРезультатОтправки(Кандидат, Получатели, РезультатОтправки)

	Для Каждого СтрокаКоллекции Из Получатели Цикл
		Если Не ЗначениеЗаполнено(СтрокаКоллекции.Контакт) Тогда
			СтрокаКоллекции.Контакт = Справочники.СтроковыеКонтактыВзаимодействий.НайтиПоНаименованию(
				СтрокаКоллекции.Адрес, Истина);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаКоллекции.Контакт) Тогда
			Продолжить;
		КонецЕсли;
		РегистрыСведений.ОтправкаРезюме.ЗаписатьРезультатОтправки(Кандидат, СтрокаКоллекции.Контакт, РезультатОтправки);
	КонецЦикла;

КонецПроцедуры

Функция ОписаниеРезультатаОтправки() Экспорт
	
	Результат = Новый Структура(
		"Отправлено,
		|ОписаниеОшибки,
		|ДатаОтправления");
	Возврат Результат;
	
КонецФункции

Функция ПрогрессОтправки(Обработано, Всего)
	Возврат Макс(5, Окр(Обработано / Всего * 100));
КонецФункции

Процедура ВложитьПрисоединенныеФайлы(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ВкладыватьПрисоединенныеФайлы(Сообщение) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Кандидат Из ДополнительныеПараметры.ПараметрыСообщения.Кандидаты Цикл
		ФайлыКандидата = Новый Массив;
		РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Кандидат, ФайлыКандидата);
		Для Каждого ПрисоединенныйФайл Из ФайлыКандидата Цикл
			ОписаниеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл.Ссылка);
			ИмяВложения = ИмяФайлаВложенияКандидата(Кандидат, ОписаниеФайла.Наименование) + "." + ОписаниеФайла.Расширение;
			Сообщение.Вложения.Вставить(ИмяВложения, ОписаниеФайла.СсылкаНаДвоичныеДанныеФайла);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ВкладыватьПрисоединенныеФайлы(Сообщение)
	
	Если Не Сообщение.Свойство("ДополнительныеПараметры") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Не Сообщение["ДополнительныеПараметры"].Свойство("ПараметрыСообщения") 
		Или Сообщение["ДополнительныеПараметры"]["ПараметрыСообщения"] = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Не Сообщение["ДополнительныеПараметры"]["ПараметрыСообщения"].Свойство("ВложитьПрисоединенныеФайлы") Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Не Сообщение["ДополнительныеПараметры"]["ПараметрыСообщения"]["ВложитьПрисоединенныеФайлы"] Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Формирует временную таблицу с кандидатами, соответствующими отбору.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц -
//  Отбор - Структура
//  ТолькоРазрешенные - Булево - если Истина, в таблицу будут включены кандидаты, доступные текущему пользователю
//  ИмяСоздаваемойВТ - Строка
Процедура СоздатьВТКандидатыПоОтбору(МенеджерВременныхТаблиц, Отбор, ТолькоРазрешенные = Истина,
	ИмяСоздаваемойВТ = "ВТКандидатыПоОтбору")
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка КАК Кандидат
		|ПОМЕСТИТЬ ВТКандидатыПоОтбору
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|		ПО ТекущиеЭтапыРаботыСКандидатами.Кандидат = Кандидаты.Ссылка
		|ГДЕ
		|	&УСЛОВИЕ";
	
	Если Не ТолькоРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Условие = "";
	Для Каждого КлючИЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(СтрЗаменить(КлючИЗначение.Ключ, ".", "_"), КлючИЗначение.Значение);
		ФрагментУсловия = "";
		Если Не ПустаяСтрока(Условие) Тогда
			ФрагментУсловия = " И ";
		КонецЕсли;
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
			ШаблонУсловия = "%1 В (&%2)";
		ИначеЕсли ТипЗнч(КлючИЗначение.Значение) = Тип("СтандартныйПериод") Тогда
			ШаблонУсловия = "%1 МЕЖДУ &%1ДатаНачала И &%1ДатаОкончания";
			Запрос.УстановитьПараметр(СтрШаблон("%1ДатаНачала", КлючИЗначение.Ключ), КлючИЗначение.Значение.ДатаНачала);
			Запрос.УстановитьПараметр(СтрШаблон("%1ДатаОкончания", КлючИЗначение.Ключ), КлючИЗначение.Значение.ДатаОкончания);
		Иначе
			ШаблонУсловия = "%1 = &%2";
		КонецЕсли;
		Если СтрРазделить(КлючИЗначение.Ключ, ".").Количество() = 1 Тогда
			ШаблонУсловия = "Кандидаты." + ШаблонУсловия;
		КонецЕсли;
		ФрагментУсловия = ФрагментУсловия + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловия, 
			КлючИЗначение.Ключ, СтрЗаменить(КлючИЗначение.Ключ, ".", "_"));
		Условие = Условие + ФрагментУсловия;
	КонецЦикла;
	
	Если Отбор.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ", "");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УСЛОВИЕ", Условие);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапроса, "ВТКандидатыПоОтбору",
		ИмяСоздаваемойВТ);
		
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ПредставлениеЛет(Лет)
	Возврат СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru=';%1 год;;%1 года;%1 лет;%1 года'"), Лет);
КонецФункции

Функция ПредставлениеМесяцев(Месяцев)
	Возврат СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 месяц;;%1 месяца;%1 месяцев;%1 месяца'"), Месяцев);
КонецФункции

// Формирует таблицу значений с данными всех кандидатов по указанным личным данным кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ДанныеКандидатовПоЛичнымДанным(ЛичныеДанныеКандидатов)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Отбор = Новый Структура("ЛичныеДанные", ЛичныеДанныеКандидатов);
	ИмяТаблицыОтборов = "ВТОтборы";
	СоздатьВТКандидатыПоОтбору(МенеджерВременныхТаблиц, Отбор, Истина, ИмяТаблицыОтборов);
	СведенияОКандидатах = ПодборПерсонала.ОсновныеСведенияОКандидатахПоДаннымВТ(МенеджерВременныхТаблиц,
		ИмяТаблицыОтборов, "Кандидат");
	СведенияОКандидатах.Сортировать("ЛичныеДанныеКандидата, ДатаРегистрации УБЫВ");
	
	Возврат СведенияОКандидатах;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		ФормаЭлементаСтарая = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Кандидаты", "ФормаЭлементаСтарая", Ложь);
		Если ФормаЭлементаСтарая = Истина Тогда
			ВыбраннаяФорма = "Справочник.Кандидаты.Форма.ФормаЭлемента";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
