#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция Настройки() Экспорт
	
	Настройки = РегистрыСведений.НастройкиКонтактнойИнформацииФизическихЛицБронированияКомандировок.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	
	СтруктураНастроек = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
		Настройки, Метаданные.РегистрыСведений.НастройкиКонтактнойИнформацииФизическихЛицБронированияКомандировок);
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКИМобильныйТелефон) Тогда
		СтруктураНастроек.ВидКИМобильныйТелефон = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтруктураНастроек.ВидКИАдресЭлектроннойПочты) Тогда
		СтруктураНастроек.ВидКИАдресЭлектроннойПочты = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
	КонецЕсли;
	
	Возврат СтруктураНастроек;

КонецФункции

Процедура СохранитьНовыеВидыКонтактнойИнформации(ВидКИМобильныйТелефон, ВидКИАдресЭлектроннойПочты) Экспорт

	Настройки = Настройки();
	Настройки.ВидКИМобильныйТелефон = ВидКИМобильныйТелефон;
	Настройки.ВидКИАдресЭлектроннойПочты = ВидКИАдресЭлектроннойПочты;
	
	СохранитьНастройки(Настройки);

КонецПроцедуры

Процедура СохранитьНастройки(Настройки)
	
	НаборЗаписей = РегистрыСведений.НастройкиКонтактнойИнформацииФизическихЛицБронированияКомандировок.СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Настройки);
	НаборЗаписей.Записать(); 
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли