#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;

	Если ЭтоПодразделенияФРМО() Тогда
		НастроитьКакПодразделенияФРМО();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоПодразделенияФРМО()
	
	КодКлассификатора = Неопределено;
	Если Параметры.ЗначенияЗаполнения.Свойство("КодКлассификатора", КодКлассификатора) Тогда
		Описание = Медицина.ОписаниеКлассификатораПодразделений();
		Результат = КодКлассификатора = Описание.Код;
	Иначе
		Результат = Объект.Владелец = Медицина.ПолучитьКлассификаторПодразделений();
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Процедура НастроитьКакПодразделенияФРМО()
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Организация = Неопределено;
		Если Параметры.ЗначенияЗаполнения.Свойство("Организация", Организация) Тогда
			НастройкиОрганизации = МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация);
			НоваяСтрока = Объект.ОписаниеЭлемента.Добавить();
			НоваяСтрока.Поле = "mo_oid";
			НоваяСтрока.Значение = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		КонецЕсли;	
		
		Объект.Владелец = Медицина.ПолучитьКлассификаторПодразделений(Истина);
		
	КонецЕсли;
	
	Элементы.Код.Заголовок = "Код (OID)";
	ТолькоПросмотр = Ложь;
	
КонецПроцедуры

#КонецОбласти
