#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ФормаОтчетаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	НастройкиОтчета = НастройкиОтчета();

	КлючСхемы = "ПодборКандидатов";
	КлючТекущегоВарианта = "ПодборКандидатов";
	УстановитьТекущийВариант(КлючТекущегоВарианта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ОбновитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ОбработчикиСобытийДокументаОтчетТабличныйДокумент

&НаКлиенте
Процедура ОтчетТабличныйДокументОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ПроцессыНагражденияКлиент.ОбработкаДополнительнойРасшифровки(ЭтотОбъект, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	Если Команда.Имя = "ПредставитьКНаграде" Тогда
		ПроцессыНагражденияКлиент.ЗаполнитьДокументИзОтчета(ЭтотОбъект, "ЗаполнитьДокументПредставлениеКНаграде");
	ИначеЕсли Команда.Имя = "Наградить" Тогда
		ПроцессыНагражденияКлиент.ЗаполнитьДокументИзОтчета(ЭтотОбъект, "ЗаполнитьДокументНаграждение");
	ИначеЕсли Команда.Имя = "ИсключатьРанееНагражденных" Тогда
		ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(ЭтотОбъект);
	ИначеЕсли Команда.Имя = "ИсключатьПоСтажу" Тогда
		ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Расшифровка = Неопределено;
	ОтчетТабличныйДокумент.Очистить();
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ПередФормированиемОтчета(ЭтотОбъект, );
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.СкомпоноватьРезультат(ОтчетТабличныйДокумент, Расшифровка);
	
	ОтчетДанныеРасшифровки = ПоместитьВоВременноеХранилище(Расшифровка, УникальныйИдентификатор);
	
	ОтчетыКлиентСервер.ОтобразитьСостояниеОтчета(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция НастройкиОтчета()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(ОтчетОбъект.СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	Настройки = Новый Структура;
	Настройки.Вставить("АдресСхемы", АдресСхемы);
	Настройки.Вставить("ПолноеИмя", "Отчет.ОтчетыПоПроцессамНаграждения");
	Настройки.Вставить("СхемаМодифицирована", Ложь);
	Настройки.Вставить("ВариантСсылка", "ПодборКандидатов");
	
	Возврат Настройки;
	
КонецФункции

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки, ИспользуютсяСтандартныеНастройки)
	
	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.ПередЗагрузкойНастроекВКомпоновщик(ЭтотОбъект, КлючСхемы, КлючТекущегоВарианта, , Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойВариантаНаСервере(Настройки)

	ЭтотОтчет = РеквизитФормыВЗначение("Отчет");
	ЭтотОтчет.ПередЗагрузкойНастроекВКомпоновщик(ЭтотОбъект, КлючСхемы, КлючТекущегоВарианта, Настройки, );

КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ПослеЗаполненияПанелиБыстрыхНастроек(ЭтотОбъект, );

КонецПроцедуры

#КонецОбласти
