///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователей.
//
// Серверные процедуры и функции Интернет-поддержки пользователей:
//  - определения настроек программы и подключения к сервисам;
//  - обработка аутентификации в сервисах Интернет-поддержки пользователей;
//  - настройка аутентификации в сервисах Интернет-поддержки пользователей;
//  - переход на страницы интегрированных сайтов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбщегоНазначения

// Возвращает имя, по которому программа идентифицируется в
// сервисах Интернет-поддержки.
//
// Возвращаемое значение:
//  Строка - имя программы. <Пустая строка>, если имя программы не заполнено.
//
Функция ИмяПрограммы() Экспорт
	
	Результат = СлужебнаяИмяПрограммы();
	Возврат ?(Результат = "Unknown", "", Результат);
	
КонецФункции

// Возвращает настройки соединения с серверами Интернет-поддержки.
//
// Возвращаемое значение:
//  Структура - настройки соединения. Поля структуры:
//    * УстанавливатьПодключениеНаСервере - Булево - Истина, если подключение
//      устанавливается на сервере 1С:Предприятие;
//    * ТаймаутПодключения - Число - таймаут подключения к серверам в секундах;
//    * ДоменРасположенияСерверовИПП - Число - если 0, устанавливать подключение
//      к серверам ИПП в доменной зоне 1c.ru, если 1 - в доменной зоне 1c.eu.
//
Функция НастройкиСоединенияССерверами() Экспорт
	
	Возврат ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП();
	
КонецФункции

#КонецОбласти

#Область ПодключениеИнтернетПоддержки

// Подключает Интернет-поддержку пользователей в информационной базе.
// В вызывающем коде перед записью данных необходимо выполнить:
//   - Проверку доступности подключения Интернет-поддержки, вызвав
//     метод ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки;
//   - Вызвать метод ИнтернетПоддержкаПользователейКлиентСервер.ПроверитьДанныеАутентификации для проверки наличия
//     не корректных символов в данных аутентификации;
//   - Установить привилегированный режим.
//
// В случае реализации собственной формы подключения Интернет-поддержки, необходимо
// после подключения, удалить значения введенные пользователем для того, чтобы минимизировать
// время хранения секретных данных на клиенте.
//
// Параметры:
//  ДанныеАутентификации - Структура - структура, содержащая логин
//    и пароль пользователя и пароль пользователя Интернет-поддержки.
//  Капча - Строка, Неопределено - капча, которую должен ввести пользователь в случае
//    блокировки частого получения мастер токена.
//
// Возвращаемое значение:
//  Структура - результат проверки данных аутентификации:
//   * Подключена - Булево - результат проверки, если Истина, логин и пароль ведены верно.
//   * Логин - Строка - логин пользователя Интернет-поддержки.
//   * КапчаBase64 - Строка, Неопределено - картинка капчи в формате base64.
//       Картинка капчи может быть возвращена в случае получения ошибки
//       "ПревышеноКоличествоПопыток".
//   * КодОшибки - Строка - идентификатор ошибки в случае если логин и пароль ведены верно
//      или в процессе проверки возникли ошибки;
//   * СообщениеОбОшибке - Строка - описание ошибки проверки данных аутентификации.
//
Функция Подключить(ДанныеАутентификации, Капча = Неопределено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ИнтернетПоддержкаПользователей.Подключить",
		"ДанныеАутентификации",
		ДанныеАутентификации,
		Тип("Структура"));
	
	Аутентификация = НовыйДанныеАутентификации(
		ДанныеАутентификации.Логин,
		ДанныеАутентификации.Пароль);
	
	Возврат СлужебнаяПодключить(
		Аутентификация,
		ИдентификаторСценарияСозданияТокена(),
		Капча)
	
КонецФункции

// Отзывает мастер токен и отключает интернет поддержку.
// В вызывающем коде перед записью данных необходимо выполнить:
//   - Проверку доступности подключения Интернет-поддержки, вызвав
//     метод ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки;
//   - Установить привилегированный режим.
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция Отключить() Экспорт
	
	РезультатОтключения = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке",
		"",
		"",
		"");
	
	// Не актуально для работы в модели сервиса.
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат РезультатОтключения;
	КонецЕсли;
	
	// Проверка права записи данных
	Если Не ПравоЗаписиПараметровИПП() Или Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для отключения Интернет-поддержки.'");
	КонецЕсли;
	
	МастерТокен = МастерТокен();
	Если ЗначениеЗаполнено(МастерТокен) Тогда
		РезультатОтключения = ИнтернетПоддержкаПользователейСервис.ОперацияОтозватьМастерТокен(
			МастерТокен,
			"REVOCATION");
	КонецЕсли;
	
	СлужебнаяСохранитьДанныеАутентификации(
		Неопределено,
		Неопределено);
	
	Возврат РезультатОтключения;
	
КонецФункции

// Определяет, доступно ли текущему пользователю выполнение интерактивного
// подключения Интернет-поддержки в соответствии с текущим режимом работы
// и правами пользователя.
//
// Возвращаемое значение:
//  Булево - Истина - интерактивное подключение доступно,
//           Ложь - в противном случае.
//
Функция ДоступноПодключениеИнтернетПоддержки() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Пользователи.РолиДоступны("ПодключениеИнтернетПоддержки", , Ложь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Проверяет заполнение данных аутентификации пользователя
// Интернет-поддержки.
//
// Возвращаемое значение:
//  Булево - признак заполнения данных аутентификации.
//      Истина - данные аутентификации заполнены,
//      Ложь - в противном случае.
//
Функция ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если БезопасныйРежим() <> Ложь Тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат (СлужебнаяДанныеАутентификации() <> Неопределено);
	
КонецФункции

#КонецОбласти

#Область АутентификацияВСервисах

// Возвращает токен аутентификации пользователя на портале поддержки.
// Возвращенный токен может быть проверен вызовом операции validate-token
// сервиса https://login.1c.ru или https://login.1c.eu
//
// Подробнее см. https://login.1c.ru/rest/public/swagger-ui/index.html.
//
// Получение токена выполняется в соответствии с настройками
// библиотеки:
//  - доменная зона серверов (1c.ru или 1c.eu);
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Параметры:
//  ИдентификаторСервиса - Строка - имя сервиса, для которого выполняется
//   формирование токена.
//  Обновить - Булево - признак принудительного обновления токена. Токен будет получен
//   заново, значение сохраненное в базе данных будет проигнорировано.
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//    * Токен - Строка - полученный токен аутентификации. Если при получении
//      токена произошла ошибка (неверный логин или пароль или другая ошибка),
//      значение поля - пустая строка.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим функционалом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ОшибкаАутентификации" - неверный логин или пароль;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//        обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке - Строка - краткое описание ошибки, которое
//      может быть отображено пользователю.
//
Функция ТокенАутентификации(
		ИдентификаторСервиса,
		Обновить = Ложь) Экспорт
	
	Возврат СлужебнаяТокенАутентификации(ИдентификаторСервиса, Обновить);
	
КонецФункции

#КонецОбласти

#Область ПереходПоСсылкам

// Возвращает URL для перехода на страницу сайта, система аутентификации
// которого интегрирована с Порталом 1С:ИТС.
// В зависимости от текущего режима работы информационной базы и наличия у
// текущего пользователя информационной базы соответствующих прав
// переданный URL страницы сайта трансформируется таким образом, что открытие
// страницы происходит с учетными данными пользователя Портала 1С:ИТС.
// При отсутствии прав, несоответствии режима работы или возникновении ошибок
// переданный URL возвращается без изменений.
//
// Важно. Полученный URL необходимо использовать сразу после получения, т.к.
// URL действителен ограниченное время (исчисляется секундами).
//
// Параметры:
//  URLСтраницыСайта - Строка - URL страницы сайта;
//
// Возвращаемое значение:
//  Строка - URL для перехода на страницу сайта.
//
Функция URLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта) Экспорт
	
	РезультатПолученияURL = СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта);
	Возврат РезультатПолученияURL.URL;
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

#Область ОбработкаСобытийСтандартныхПодсистем

// Обработка события перемещения информационной базы.
//
// Параметры:
//  ВидИзменения - Строка - вид изменения расположения:
//   - "Копия" - информационная база была скопирована.
//   - "Перемещена" - информационная база была перемещена.
//
Процедура ПриИзмененииРасположенияБазы(ВидИзменения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если ВидИзменения = "Копия" Тогда
		
		НачатьТранзакцию();
		
		Попытка
			
			// Получить данные логина и пароля из безопасного хранилища.
			ДанныеАутентификации = СлужебнаяДанныеАутентификации();
			
			// Удалить все данные Интернет-поддержки из безопасного хранилища.
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
				ИдентификаторПодсистемы());
			
			// Если ранее была подключена Интернет-поддержка, восстановить
			// логин, пароль и обновить идентификатор клиента.
			Если ДанныеАутентификации <> Неопределено Тогда
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
					ИдентификаторПодсистемы(),
					ДанныеАутентификации.Логин,
					ИдентификаторЛогин());
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
					ИдентификаторПодсистемы(),
					ДанныеАутентификации.Пароль,
					ИдентификаторПароль());
				ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
					ИдентификаторПодсистемы(),
					НовыйИдентификаторКлиента(),
					ИдентификаторИдентификаторКлиента());
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписатьИнформациюВЖурналРегистрации(
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(
					ИнформацияОбОшибке),
					,
					Истина);
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(
				ИнформацияОбОшибке);
		КонецПопытки;
		
	ИначеЕсли ВидИзменения = "Перемещена" Тогда
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
			ИдентификаторПодсистемы(),
			ИдентификаторИдентификаторКлиента());
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ИнтернетПоддержкаПользователей.ТокенАутентификации.
// Возвращает логин и пароль пользователя Интернет-поддержки, сохраненные в информационной базе.
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Возвращаемое значение:
//  Структура - Структура - логин и пароль пользователя Интернет-поддержки:
//    * Логин - Строка - логин пользователя Интернет-поддержки;
//    * Пароль - Строка - пароль пользователя Интернет-поддержки.
//  Неопределено - при отсутствии сохраненных данных аутентификации.
//
Функция ДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт
	
	Возврат СлужебнаяДанныеАутентификации();
	
КонецФункции

// Устарела. Следует использовать ИнтернетПоддержкаПользователей.ТокенАутентификации.
// Возвращает тикет аутентификации пользователя на портале поддержки.
// Возвращенный тикет может быть проверен вызовом операции check
// сервиса https://login.1c.ru или https://login.1c.eu
//
// Подробнее см. https://login.1c.ru/rest/public/swagger-ui.html.
//
// Получение тикета выполняется в соответствии с настройками
// библиотеки:
//  - доменная зона серверов (1c.ru или 1c.eu);
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Параметры:
//  ВладелецТикета - Строка - произвольное имя сервиса, для которого
//      выполняется аутентификация пользователя. Это же имя должно
//      использоваться при вызове операции checkTicket;
//      Не допускается незаполненное значение параметра.
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//        * Тикет - Строка - полученный тикет аутентификации. Если при получении
//          тикета произошла ошибка (неверный логин или пароль или другая ошибка),
//          значение поля - пустая строка.
//        * КодОшибки - Строка - строковый код возникшей ошибки, который
//          может быть обработан вызывающим функционалом:
//              - <Пустая строка> - получение тикета выполнено успешно;
//              - "НеверныйЛогинИлиПароль" - неверный логин или пароль;
//              - "ПревышеноКоличествоПопыток" - превышено количество попыток
//                 получения тикета с некорректным логином и паролем;
//              - "ОшибкаПодключения" - ошибка при подключении к сервису;
//              - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//              - "НеизвестнаяОшибка" - при получении тикета возникла
//                 неизвестная (не обрабатываемая) ошибка;
//              - "ОперацияНеПоддерживается" - сервис не интегрирован с Порталом 1С:ИТС.
//                Ошибка может возникнуть при работе в модели сервиса.
//        * СообщениеОбОшибке - Строка - краткое описание ошибки, которое
//          может быть отображено пользователю;
//        * ИнформацияОбОшибке - Строка - подробное описание ошибки, которое
//          может быть записано в журнал регистрации.
//
Функция ТикетАутентификацииНаПорталеПоддержки(ВладелецТикета) Экспорт

	Возврат СлужебнаяТикетАутентификацииНаПорталеПоддержки(
		ВладелецТикета,
		ТипАутентификацииBasic());
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияСБиблиотекойСтандартныхПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
//
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновлениеИнформационнойБазы_ЗаменитьИдентификаторПодсистемыВБезопасномХранилищеДанных_2_1_8_14");
	Методы.Вставить("ОбновлениеИнформационнойБазы_ПереместитьПараметрыИнтернетПоддержкиВБезопасноеХранилищеДанных_2_1_7_1");
	Методы.Вставить("ПолучитьМастерТокен");
	
КонецПроцедуры

#КонецОбласти

#Область Аутентификация

// Формирует заголовок для способа аутентификации basic authentication.
//
// Параметры:
//  Логин - Строка - логин в сервисе;
//  Пароль - Строка - пароль в сервисе.
//
// Возвращаемое значение:
//  Строка - заголовок аутентификации.
//
Функция ЗаголовокБазовойСхемыАутентификации(Логин, Пароль) Экспорт
	
	Заголовок = "Basic "
		+ ПолучитьBase64СтрокуИзДвоичныхДанных(
			ПолучитьДвоичныеДанныеИзСтроки(
				Логин + ":" + Пароль));
	
	Возврат СтрЗаменить(
		СтрЗаменить(
			Заголовок,
			Символы.ВК,
			""),
		Символы.ПС,
		"");
	
КонецФункции

// Формирует заголовок для способа аутентификации bearer authentication.
//
// Параметры:
//  Токен - Строка - токен в сервисе.
//
// Возвращаемое значение:
//  Строка - заголовок аутентификации.
//
Функция ЗаголовокBearerАутентификации(Токен) Экспорт
	
	Возврат "Bearer " + Токен;
	
КонецФункции

#КонецОбласти

#Область АутентификацияВСервисах

// Возвращает токен аутентификации пользователя на портале поддержки.
// Возвращенный токен может быть проверен вызовом операции validate-token
// сервиса https://login.1c.ru или https://login.1c.eu
//
// Подробнее см. https://login.1c.ru/rest/public/swagger-ui/index.html.
//
// Получение токена выполняется в соответствии с настройками
// библиотеки:
//  - доменная зона серверов (1c.ru или 1c.eu);
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Параметры:
//  ИдентификаторСервиса - Строка - имя сервиса, для которого выполняется
//   формирование токена.
//  Обновить - Булево - признак принудительного обновления токена. Токен будет получен
//   заново, значение сохраненное в базе данных будет проигнорировано.
//  Бессрочный - Булево - признак получения бессрочного токена.
//  ДополнительныеПараметры - Соответствие - описывает дополнительные параметры:
//    * Ключ - Строка - имя дополнительного свойства
//    * Значение - Строка, Число, Неопределено, Массив - значение дополнительного свойства
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//    * Токен - Строка - полученный токен аутентификации. Если при получении
//      токена произошла ошибка (неверный логин или пароль или другая ошибка),
//      значение поля - пустая строка.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим функционалом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ОшибкаАутентификации" - неверный логин или пароль;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//        обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке - Строка - краткое описание ошибки, которое
//      может быть отображено пользователю.
//
Функция СлужебнаяТокенАутентификации(
		ИдентификаторСервиса,
		Обновить = Ложь,
		Бессрочный = Ложь,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Создание токена аутентификации недоступно.'");
	КонецЕсли;
	
	Если ИдентификаторСервиса = ИдентификаторИдентификаторКлиента()
		Или ИдентификаторСервиса = ИдентификаторКлючаМастерТокен()
		Или ИдентификаторСервиса = ИдентификаторЛогин()
		Или ИдентификаторСервиса = ИдентификаторПароль() Тогда
		ВызватьИсключение НСтр("ru = 'Передан не корректный идентификатор сервиса.'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ИнтернетПоддержкаПользователей.ТокенАутентификации",
		"ИдентификаторСервиса",
		ИдентификаторСервиса,
		Тип("Строка"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ИнтернетПоддержкаПользователей.ТокенАутентификации",
		"Обновить",
		Обновить,
		Тип("Булево"));
	
	Результат = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке,
		|Токен",
		"",
		"",
		Неопределено);
	Сценарий = ?(Обновить,
		ИдентификаторСценарияОбновленияТокена(),
		ИдентификаторСценарияСозданияТокена());
	
	Если Не Обновить Тогда
		
		ДанныеТокена = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ИдентификаторПодсистемы(),
			ИдентификаторСервиса);
		
		Если ДанныеТокена <> Неопределено И ЗначениеЗаполнено(ДанныеТокена.Токен) Тогда
			
			Бессрочный = Ложь;
			
			Если ДанныеТокена.Свойство("Бессрочный") Тогда
				Бессрочный = ДанныеТокена.Бессрочный;
			КонецЕсли;
			
			// Увеличиваем текущую дату на минуту (ТекущаяУниверсальнаяДата() + 60) минуту
			// для исключения паразитных запросов.
			Если Бессрочный
				Или ДанныеТокена.ШтампИстечения > (ТекущаяУниверсальнаяДата() + 60) Тогда
				Результат.Токен = ДанныеТокена.Токен;
				Возврат Результат;
			Иначе
				Сценарий = ИдентификаторСценарияОбновленияТокена();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МастерТокен = МастерТокен();
	Если Не ЗначениеЗаполнено(МастерТокен) Тогда
		МастерТокен = СлужебнаяСоздатьМастерТокен(
			ИдентификаторСценарияСозданияТокена());
		Если Не ЗначениеЗаполнено(МастерТокен) Тогда
			Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации();
			Результат.СообщениеОбОшибке = НСтр("ru = 'Ошибка создания мастер токена для подключения к сервисам.'");
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияТокенАутентификации(
		МастерТокен,
		ИдентификаторСервиса,
		Сценарий,
		Бессрочный,
		ДополнительныеПараметры);
	ЗаполнитьЗначенияСвойств(
		Результат,
		РезультатОперации);
	
	// Для случаев, когда по мастер токену не возможно выполнить получение
	// токена аутентификации, выполняется принудительный отзыв существующего
	// мастер токена, создание нового мастер токена и попытка создания нового токена
	// аутентификации.
	Если Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации() Тогда
		МастерТокенНовый = СлужебнаяСоздатьМастерТокен(
			ИдентификаторСценарияОбновленияТокена());
		Если ЗначениеЗаполнено(МастерТокенНовый) Тогда
			ИнтернетПоддержкаПользователейСервис.ОперацияОтозватьМастерТокен(
				МастерТокен,
				ИдентификаторСценарияОбновленияТокена());
			РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияТокенАутентификации(
				МастерТокенНовый,
				ИдентификаторСервиса,
				Сценарий,
				Бессрочный,
				ДополнительныеПараметры);
			ЗаполнитьЗначенияСвойств(
				Результат,
				РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат.КодОшибки) Тогда
		
		ДанныеТокена = Новый Структура;
		ДанныеТокена.Вставить("Токен", РезультатОперации.Токен);
		ДанныеТокена.Вставить("ШтампИстечения", РезультатОперации.ШтампИстечения);
		ДанныеТокена.Вставить("Бессрочный", РезультатОперации.Бессрочный);
		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИдентификаторПодсистемы(),
			ДанныеТокена,
			ИдентификаторСервиса);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПодключениеИнтернетПоддержки

// Получает логин пользователя Интернет-поддержки из безопасного хранилища.
//
// Возвращаемое значение:
//  Строка - логин пользователя Интернет-поддержки.
//
Функция ЛогинИнтернетПоддержки()Экспорт
	
	ДанныеАутентификации = СлужебнаяДанныеАутентификации();
	Если ДанныеАутентификации <> Неопределено Тогда
		Возврат ДанныеАутентификации.Логин;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйОбщегоНазначения

// Выполняет проверку, что переданный объект имеет тип СправочникОбъект.ИдентификаторыОбъектовМетаданных.
//
// Параметры:
//  Объект - Произвольный - объект для проверки.
//
// Возвращаемое значение:
//  Булево - если Истина, тип совпадает с СправочникОбъект.ИдентификаторыОбъектовМетаданных.
//
Функция ЭтоИдентификаторОбъектаМетаданных(Объект) Экспорт
	
	Возврат ТипЗнч(Объект) = Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных");
	
КонецФункции

// Возвращает признак наличия в конфигурации общих реквизитов-разделителей.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенная конфигурация.
//
Функция ЭтоРазделеннаяКонфигурация() Экспорт
	
	Возврат ИнтернетПоддержкаПользователейСлужебныйПовтИсп.ЭтоРазделеннаяКонфигурация();
	
КонецФункции

// Определяет, сеанс запущен с разделителями или без.
//
// Возвращаемое значение:
//   Булево - Истина, если сеанс запущен без разделителей.
//
Функция СеансЗапущенБезРазделителей() Экспорт
	
	Возврат ИнтернетПоддержкаПользователейСлужебныйПовтИсп.СеансЗапущенБезРазделителей();
	
КонецФункции

// Возвращает значение разделителя сеанса.
//
// Возвращаемое значение:
//  Число - значение разделителя.
//
Функция ЗначениеРазделителяСеанса() Экспорт
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат 0;
	КонецЕсли;
	
	МодульРаботаВМоделиСервисаБИП = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервисаБИП");
	Возврат МодульРаботаВМоделиСервисаБИП.ЗначениеРазделителяСеанса();
	
КонецФункции

// Возвращает имя программы в сервисах Интернет-поддержки.
//
// Возвращаемое значение:
//  Строка - имя программы.
//
Функция СлужебнаяИмяПрограммы() Экспорт
	
	Результат = ОбщегоНазначения.ИдентификаторИнтернетПоддержкиКонфигурации();
	Если Результат = Неопределено Или ПустаяСтрока(Результат) Тогда
		Результат = "Unknown";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает синоним конфигурации для использования в других подсистемах.
//
// Возвращаемое значение:
//  Строка - синоним программы.
//
Функция СинонимКонфигурации() Экспорт
	
	Возврат Метаданные.Синоним;
	
КонецФункции

// Проверяет доступность изменения параметров Интернет-поддержки пользователей.
//
// Возвращаемое значение:
//  Булево - Истина, если у текущего пользователя есть право записи параметров ИПП.
//           Ложь - в противном случае.
//
Функция ПравоЗаписиПараметровИПП() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь(, , Ложь)
		Или Пользователи.РолиДоступны("ПодключениеИнтернетПоддержки", , Ложь);
	
КонецФункции

// Реализует инкрементальный расчет хеш-суммы и кодировку в формат base64.
// Способ расчета и тип вычисляемого значения определяются типом хеш-функции.
//
// Параметры:
//  Данные  - Строка, ДвоичныеДанные - данные для расчета хеш-суммы.
//
// Возвращаемое значение:
//  Строка - рассчитанная хеш-сумма закодированная по алгоритму base64.
//
Функция КонтрольнаяСуммаФайла(Данные) Экспорт
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		ХешированиеДанных.Добавить(Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("Строка") Тогда
		ХешированиеДанных.ДобавитьФайл(Данные);
	Иначе
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Некорректное значение параметра Данные (%1)'"),
			Строка(Данные));
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
		
	Возврат Base64Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции

// Возвращает идентификатор подсистемы в в справочнике объектов
// метаданных.
//
// Возвращаемое значение:
//  Строка - идентификатор подсистемы.
//
Функция ИдентификаторПодсистемы() Экспорт
	
	Возврат "ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП";
	
КонецФункции

// Возвращает значение свойства Метаданные.Имя
//
// Возвращаемое значение:
//  Строка - имя конфигурации.
//
Функция ИмяКонфигурации() Экспорт

	Возврат Метаданные.Имя;

КонецФункции

// Возвращает значение свойства Метаданные.Версия
//
// Возвращаемое значение:
//  Строка - версия конфигурации.
//
Функция ВерсияКонфигурации() Экспорт
	
	ВерсияПрограммы = Метаданные.Версия;
	ИнтеграцияПодсистемБИП.ПриОпределенииНомераВерсииПрограммы(
		ВерсияПрограммы);
	ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииНомераВерсииПрограммы(
		ВерсияПрограммы);
	
	Возврат ВерсияПрограммы;
	
КонецФункции

// Проверяет доступность переданного URL по критерию:
//  - Код ответа 200;
//  - Таймаут ответа - 10 секунд.
//
// Параметры:
//  URL - Строка - URL для проверки;
//  НастройкиПроксиСервера - Структура, Неопределено - настройки прокси;
//  Метод - Строка - http метод проверки.
//
// Возвращаемое значение:
//  Булево - Истина если URL доступен.
//
Функция ПроверитьURLДоступен(
		URL,
		НастройкиПроксиСервера = Неопределено,
		Метод = Неопределено) Экспорт
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ИмяОшибки"         , "");
	РезультатПроверки.Вставить("СообщениеОбОшибке" , "");
	РезультатПроверки.Вставить("ИнформацияОбОшибке", "");
	
	// Проверка разрешения работы с сервисом
	Если Не РазрешенаРаботаСХостом(URL) Тогда
		
		ЕстьПравоАдминистрирования          = Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь);
		РезультатПроверки.ИмяОшибки         = "0";
		РезультатПроверки.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обращение к сервисам Интернет-поддержки запрещено. %1'"),
			?(ЕстьПравоАдминистрирования,
				НСтр("ru = 'См. Журнал регистрации'"),
				НСтр("ru = 'Обратитесь к администратору.'")));
		РезультатПроверки.ИнформацияОбОшибке = НСтр("ru = 'Работа с внешними ресурсами заблокирована.
			|Обращение к сервисам Интернет-поддержки запрещено.
			|Для разрешения работы с сервисами откройте раздел Интернет-поддержка и сервисы и нажмите ""Настроить"" или разблокируйте работу с внешними ресурсами.'");
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
		
	Если НастройкиПроксиСервера = Неопределено Тогда
		Попытка
			ИнтернетПоддержкаПользователейСлужебныйПовтИсп.ПроверитьURLДоступен(
				URL,
				Метод,
				РезультатПроверки.ИмяОшибки,
				РезультатПроверки.СообщениеОбОшибке,
				РезультатПроверки.ИнформацияОбОшибке);
		Исключение
			Возврат РезультатПроверки;
		КонецПопытки;
	Иначе
		СлужебнаяПроверитьURLДоступен(
			URL,
			Метод,
			РезультатПроверки.ИмяОшибки,
			РезультатПроверки.СообщениеОбОшибке,
			РезультатПроверки.ИнформацияОбОшибке,
			НастройкиПроксиСервера);
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Возвращает номер версии платформы 1С:Предприятия.
//
// Возвращаемое значение:
//  Строка - версия платформы.
//
Функция ТекущаяВерсияПлатформы1СПредприятие() Экспорт
	
	СистИнфо = Новый СистемнаяИнформация;
	Возврат СистИнфо.ВерсияПриложения;
	
КонецФункции

// Производит проверку хоста для URL полученного из внешних источников.
//
// Параметры:
//  URL - Строка - URL из внешнего источника.
//
Процедура ПроверитьURL(URL) Экспорт
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	ДоменХоста = Прав(НРег(СокрЛП(СтруктураURI.Хост)), 6);
	Если ДоменХоста <> ".1c.ru" И ДоменХоста <> ".1c.eu" Тогда
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неизвестный хост (%1)'"),
			СтруктураURI.Хост);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры

// Дополняет запись JSON дополнительными параметрами.
//
// Параметры:
//  ДопПараметрыЗапроса - Структура - дополнительные параметры запроса;
//  ЗаписьДанныхСообщения - ЗаписьJSON - поток записи запроса к сервису.
//
Процедура ЗаписатьДополнительныеПараметрыЗапроса(ДопПараметрыЗапроса, ЗаписьДанныхСообщения) Экспорт
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("additionalParameters");
	ЗаписьДанныхСообщения.ЗаписатьНачалоМассива();
	Для каждого КлючЗначение Из ДопПараметрыЗапроса Цикл
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("key");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(КлючЗначение.Ключ);
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("value");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Строка(КлючЗначение.Значение));
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	КонецЦикла;
	ЗаписьДанныхСообщения.ЗаписатьКонецМассива();
	
КонецПроцедуры

// Останавливает выполнение кода на заданное время.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИнтернетПоддержкаПользователей.Пауза", Параметры);
	КонецЕсли;
	
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

// Записывает в журнал регистрации сообщение информации
// с именем события "Интернет-поддержка пользователей.Ошибка".
//
// Параметры:
//  Сообщение - Строка - строковое представление ошибки.
//  Данные - Произвольный - данные, к которым относится сообщение об ошибке;
//  Ошибка - Булево - определяет уровень журнала регистрации.
//
Процедура ЗаписатьИнформациюВЖурналРегистрации(
		Сообщение,
		Данные = Неопределено,
		Ошибка = Истина) Экспорт
	
	УровеньЖР = ?(Ошибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖР,
		,
		Данные,
		Сообщение);
	
КонецПроцедуры

// Подставляет в текст домен серверов ИПП в соответствии
// с текущими настройками подключения к серверам.
//
// Параметры:
//  Текст - Строка
//  ДоменнаяЗона - Неопределено, Число - числовой код доменной зоны, Неопределено
//   если передано домен не корректируется.
//
// Возвращаемое значение:
//  Строка - преобразованная строка
//
Функция ПодставитьДомен(Текст, Знач ДоменнаяЗона = Неопределено) Экспорт

	Если ДоменнаяЗона = 1 Тогда
		Результат = СтрЗаменить(Текст, "webits-info@1c.ru", "webits-info@1c.ua");
		Возврат СтрЗаменить(Результат, ".1c.ru", ".1c.eu");
	Иначе
		Возврат Текст;
	КонецЕсли;

КонецФункции

// Текст ошибки при отключенном доступе к сервисам интернета.
// 
// Возвращаемое значение:
//  Строка - текст ошибки
//
Функция ЗапрещенДоступКИнтернетПоддержкеТекст() Экспорт
	
	ЕстьПравоАдминистрирования = Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь);
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обращение к сервисам Интернет-поддержки запрещено. %1'"),
			?(ЕстьПравоАдминистрирования,
				НСтр("ru = 'См. Журнал регистрации'"),
				НСтр("ru = 'Обратитесь к администратору.'")));
	
КонецФункции

// Проверяет, что указанный путь к файлу ссылается на каталог временных файлов.
//
// Параметры:
//  Путь - Строка - путь к файлу или полное имя файла с каталогами.
//
// Возвращаемое значение:
//  Булево - Истина, если файл расположен в каталоге временных файлов.
// 
Функция ЭтоИмяВременногоФайла(Путь) Экспорт
	
	// Ожидается, что Путь получен методом ПолучитьИмяВременногоФайла().
	Файл = Новый Файл(Путь);
	Возврат СтрНачинаетсяС(Файл.ПолноеИмя, КаталогВременныхФайлов());
	
КонецФункции

#КонецОбласти

#Область УстановкаКартинокСостояний

// Устанавливает и настраивает картинку состояния успешного выполнения.
//
// Параметры:
//  Элемент - ДекорацияФормы - картинка, которую необходимо настроить.
//
Процедура УстановитьСостояниеУспешно(Элемент) Экспорт
	
	Элемент.Картинка = БиблиотекаКартинок.ВажноеСообщениеУспешно;
	Элемент.ЦветКартинки = ЦветаПалитры.Зеленый;
	
КонецПроцедуры

// Устанавливает и настраивает картинку состояния предупреждение.
//
// Параметры:
//  Элемент - ДекорацияФормы - картинка, которую необходимо настроить.
//
Процедура УстановитьСостояниеПредупреждение(Элемент) Экспорт
	
	Элемент.Картинка = БиблиотекаКартинок.ВажноеСообщениеПредупреждение;
	Элемент.ЦветКартинки = ЦветаПалитры.Желтый;
	
КонецПроцедуры

// Устанавливает и настраивает картинку состояния ошибки выполнения.
//
// Параметры:
//  Элемент - ДекорацияФормы - картинка, которую необходимо настроить.
//
Процедура УстановитьСостояниеОшибка(Элемент) Экспорт
	
	Элемент.Картинка = БиблиотекаКартинок.ВажноеСообщениеОшибка;
	Элемент.ЦветКартинки = ЦветаПалитры.Красный;
	
КонецПроцедуры

// Устанавливает и настраивает картинку состояния информация.
//
// Параметры:
//  Элемент - ДекорацияФормы - картинка, которую необходимо настроить.
//
Процедура УстановитьСостояниеИнформация(Элемент) Экспорт
	
	Элемент.Картинка = БиблиотекаКартинок.ВажноеСообщениеИнформация;
	Элемент.ЦветКартинки = ЦветаПалитры.Голубой;
	
КонецПроцедуры

#КонецОбласти

#Область Тарификация

// Определяет доступность услуги по переданному идентификатору
//
// Параметры:
//  ИдентификаторУслуги  - Строка - идентификатор услуги в сервисе;
//  ЗначениеРазделителя - Число - идентификатор области данных.
//
// Возвращаемое значение:
//  Булево - если Истина, услуга доступна.
//
Функция УслугаПодключена(ИдентификаторУслуги, ЗначениеРазделителя = Неопределено) Экспорт
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		// В локальном режиме нет функциональности
		// для проверки по данным ИБ.
		Возврат Истина;
	Иначе
		
		ТребуетсяРазделение = Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();
		Если ТребуетсяРазделение Тогда
			Если ЗначениеРазделителя = Неопределено Тогда
				ВызватьИсключение НСтр("ru = 'Не заполнено значение параметра ""ЗначениеРазделителя"".'");
			КонецЕсли;
			МодульРаботаВМоделиСервисаБИП = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервисаБИП");
			МодульРаботаВМоделиСервисаБИП.ВойтиВОбластьДанных(ЗначениеРазделителя);
		КонецЕсли;
		
		МодульТарификация = ОбщегоНазначения.ОбщийМодуль("Тарификация");
		Результат = МодульТарификация.ЗарегистрированаЛицензияБезлимитнойУслуги(
			ИнтернетПоддержкаПользователейКлиентСервер.ИдентификаторПоставщикаУслугПортал1СИТС(),
			ИдентификаторУслуги);
		
		Если ТребуетсяРазделение Тогда
			МодульРаботаВМоделиСервисаБИП.ВыйтиИзОбластиДанных();
		КонецЕсли;
		
		Если Не Результат Тогда
			ЗаписатьИнформациюВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Услуга с идентификатором %1 не подключена.'"),
					ИдентификаторУслуги),
				Неопределено,
				Ложь);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСодержимогоИзИнтернет

// Загружает содержимое из Интернет по протоколу HTTP(S)
// с использованием методов GET, POST или PUT. Поддерживает
// обработку перенаправлений.
//
// Параметры:
//  URL - Строка - URL вызываемой операции.
//  Логин - Неопределено - без аутентификации.
//        - Строка - логин basic authentication.
//  Пароль - Неопределено - без аутентификации.
//         - Строка - пароль basic authentication.
//  ПараметрыЗапроса - Неопределено - параметры запроса по умолчанию.
//                   - Структура - уточняющие параметры запроса:
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле ответа "Содержимое" будут возвращен файл во временном
//          каталоге с именем, указанным в параметре "ИмяФайла").
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//        Значение по умолчанию: 0
//   * Метод - Строка - http метод: "GET", "POST", "PUT" и т.п..
//       Значение по умолчанию: GET
//   * ДанныеДляОбработки - Строка, ДвоичныеДанные, Неопределено - данные для отправки
//       методов передаваемые методом POST, PUT, PATCH.
//       Значение по умолчанию: Неопределено
//   * ФорматДанныхДляОбработки - Число - формат отправки данных:
//       0 - как файл во временном каталоге.
//       1 - как строка.
//       2 - как двоичные данные.
//       Значение по умолчанию: 0
//   * Заголовки - Неопределено
//               - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//       Значение по умолчанию: Неопределено
//   * ИмяФайла - Строка - имя файла с расширением, которое будет использовано при
//       создании нового файла если ФорматОтвета = 0.
//   * Таймаут - Число - время ожидания завершения операции в секундах.
//       Значение по умолчанию: 30
//   * НастройкиПрокси - Неопределено - настройки прокси будут получены из информационной базы.
//                     - Структура - настройки подключения к прокси серверу.
//       Значение по умолчанию: Неопределено
//   * ИспользоватьЗащищенноеСоединение - Булево -признак использования защищенного соединения
//        для запросов https.
//        Значение по умолчанию: Истина
//   * КоличествоПеренаправлений - Число - максимальное количество перенаправлений,
//       которое следует обрабатывать.
//       Значение по умолчанию: 7
//   * ЗащищенноеСоединение - Неопределено - при использовании защищенного соединения будет
//       создан новый объект ЗащищенноеСоединениеOpenSSL.
//                          - ЗащищенноеСоединениеOpenSSL - защищенное соединение, которое
//       следует использовать при создании соединения.
//       Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре ПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция ЗагрузитьСодержимоеИзИнтернет(
		Знач URL,
		Знач Логин = Неопределено,
		Знач Пароль = Неопределено,
		ПараметрыЗапроса = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки"         , "");
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("Содержимое"        , Неопределено);
	Результат.Вставить("КодСостояния"      , 0);
	Результат.Вставить("ФорматОтвета"      , 0);
	Результат.Вставить("Заголовки"         , Новый Соответствие);
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ФорматОтвета", 0);
	ПараметрыПолучения.Вставить("Метод", "GET");
	ПараметрыПолучения.Вставить("ДанныеДляОбработки", Неопределено);
	ПараметрыПолучения.Вставить("ФорматДанныхДляОбработки", 0);
	ПараметрыПолучения.Вставить("Заголовки", Неопределено);
	ПараметрыПолучения.Вставить("ИмяФайла", "");
	ПараметрыПолучения.Вставить("Таймаут", -1);
	ПараметрыПолучения.Вставить("НастройкиПрокси" , Неопределено);
	ПараметрыПолучения.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	ПараметрыПолучения.Вставить("КоличествоПеренаправлений", 7);
	ПараметрыПолучения.Вставить("ЗащищенноеСоединение", Неопределено);
	
	Если ПараметрыЗапроса <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыЗапроса);
	КонецЕсли;
	
	Если ПараметрыПолучения.Таймаут = -1 Тогда
		// Таймаут по умолчанию.
		ПараметрыПолучения.Таймаут = 30;
	КонецЕсли;
	
	Результат.ФорматОтвета = ПараметрыПолучения.ФорматОтвета;
	ИмяФайлаОтвета         = Неопределено;	// Неопределено, Строка
	Если Результат.ФорматОтвета = 0 Тогда
		Если ПустаяСтрока(ПараметрыПолучения.ИмяФайла) Тогда
			// Удаление файла должен выполнить вызывающий метод
			// Имя файла не передано поэтому создается файл по умолчанию
			//@skip-check missing-temporary-file-deletion
			ИмяФайлаОтвета = ПолучитьИмяВременногоФайла();
		Иначе
			ИмяФайлаОтвета = ФайловаяСистема.СоздатьВременныйКаталог()
				+ ПараметрыЗапроса.ИмяФайла;
			Если Не ЭтоИмяВременногоФайла(ИмяФайлаОтвета) Тогда
				ВызватьИсключение НСтр("ru = 'Ошибка в адресе сохранения файла.'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КоличествоПеренаправлений  = 0;
	МаксКолвоПеренаправлений   = ПараметрыПолучения.КоличествоПеренаправлений;
	Перенаправления            = Новый Массив;
	ВыполненныеПеренаправления = Новый Соответствие;
	ПроксиПоСхемам             = Новый Соответствие;
	ЗащищенноеСоединениеКэш    = ?((ПараметрыПолучения.ИспользоватьЗащищенноеСоединение
			И ЗначениеЗаполнено(ПараметрыПолучения.ЗащищенноеСоединение)),
		ПараметрыПолучения.ЗащищенноеСоединение,
		Неопределено);
	
	Если Не ОбщегоНазначения.РазрешенДоступКИнтернетСервисам() Тогда
		Результат.КодСостояния = -1;
		УстановитьОписаниеОшибки(
			Результат,
			"LockError",
			ОбщегоНазначения.ЗапрещенДоступКИнтернетСервисамТекстСообщения(),
			ОбщегоНазначения.ЗапрещенДоступКИнтернетСервисамТекстСообщения(),
			Перенаправления);
		Возврат Результат;
	КонецЕсли;
	
	Если Не РазрешенаРаботаСХостом(URL) Тогда
		
		ИнформацияОбОшибке = НСтр("ru = 'Работа с внешними ресурсами заблокирована.
			|Обращение к сервисам Интернет-поддержки запрещено.
			|Для разрешения работы с сервисами откройте раздел Интернет-поддержка и сервисы и нажмите ""Настроить"" или разблокируйте работу с внешними ресурсами.'");
		Результат.КодСостояния = -2;
		
		УстановитьОписаниеОшибки(
			Результат,
			"LockError",
			ЗапрещенДоступКИнтернетПоддержкеТекст(),
			ИнформацияОбОшибке,
			Перенаправления);
		
		Возврат Результат;
	КонецЕсли;
	
	URLДляПолучения = URL;
	HTTPЗапрос = Новый HTTPЗапрос;
	Если ПараметрыПолучения.Заголовки <> Неопределено Тогда
		HTTPЗапрос.Заголовки = ПараметрыПолучения.Заголовки;
	КонецЕсли;
	ТелоУстановлено = Ложь;
	Ответ = Неопределено;
	Пока КоличествоПеренаправлений < МаксКолвоПеренаправлений Цикл

		СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URLДляПолучения);
		Если СтруктураURI.Схема <> "https" Тогда
			ЗащищенноеСоединение = Неопределено;
		Иначе
			Если ЗащищенноеСоединениеКэш = Неопределено Тогда
				ЗащищенноеСоединениеКэш = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(
					Неопределено,
					Новый СертификатыУдостоверяющихЦентровОС);
			КонецЕсли;
			ЗащищенноеСоединение = ЗащищенноеСоединениеКэш;
		КонецЕсли;

		Если НЕ ПустаяСтрока(СтруктураURI.Логин) Тогда
			ЛогинДляПолучения  = СтруктураURI.Логин;
			ПарольДляПолучения = СтруктураURI.Пароль;
		Иначе
			ЛогинДляПолучения  = Логин;
			ПарольДляПолучения = Пароль;
		КонецЕсли;

		Если СтруктураURI.Порт = Неопределено ИЛИ ПустаяСтрока(СтруктураURI.Порт) Тогда
			Порт = ?(ЗащищенноеСоединение = Неопределено, 80, 443);
		Иначе
			Порт = Число(СтруктураURI.Порт);
		КонецЕсли;

		Прокси = ПроксиПоСхемам.Получить(СтруктураURI.Схема);
		Если Прокси = Неопределено Тогда
			Если ПараметрыПолучения.НастройкиПрокси = Неопределено Тогда
				Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(СтруктураURI.Схема);
			Иначе
				Прокси = СформироватьИнтернетПрокси(ПараметрыПолучения.НастройкиПрокси, СтруктураURI.Схема);
			КонецЕсли;
			ПроксиПоСхемам.Вставить(СтруктураURI.Схема, Прокси);
		КонецЕсли;

		Соединение = Новый HTTPСоединение(
			СтруктураURI.Хост,
			Порт,
			ЛогинДляПолучения,
			ПарольДляПолучения,
			Прокси,
			ПараметрыПолучения.Таймаут,
			ЗащищенноеСоединение);

		Попытка

			HTTPЗапрос.АдресРесурса = СтруктураURI.ПутьНаСервере;

			Если ПараметрыПолучения.Метод = "GET" Тогда
				Ответ = Соединение.Получить(HTTPЗапрос, ИмяФайлаОтвета);
			ИначеЕсли ПараметрыПолучения.Метод = "HEAD" Тогда
				Ответ = Соединение.ПолучитьЗаголовки(HTTPЗапрос);
			Иначе
			
				Если НЕ ТелоУстановлено Тогда

					Если ПараметрыПолучения.ДанныеДляОбработки <> Неопределено Тогда

						Если ПараметрыПолучения.ФорматДанныхДляОбработки = 0 Тогда

							Если Не ЭтоИмяВременногоФайла(ПараметрыПолучения.ДанныеДляОбработки) Тогда
								ВызватьИсключение НСтр("ru = 'Ошибка в адресе файла для http-запроса.'");
							КонецЕсли;
							
							HTTPЗапрос.УстановитьИмяФайлаТела(ПараметрыПолучения.ДанныеДляОбработки);

						ИначеЕсли ПараметрыПолучения.ФорматДанныхДляОбработки = 1 Тогда

							HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыПолучения.ДанныеДляОбработки);

						Иначе

							HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ПараметрыПолучения.ДанныеДляОбработки);

						КонецЕсли;

					КонецЕсли;

					ТелоУстановлено = Истина;

				КонецЕсли;

				Если ПараметрыПолучения.Метод = "PUT" Тогда
					Ответ = Соединение.Записать(HTTPЗапрос);
				Иначе
					// POST
					Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос, ИмяФайлаОтвета);
				КонецЕсли;

			КонецЕсли;

		Исключение
			
			ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(
				ИнформацияОбОшибке());
			ПодробноеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось загрузить содержимое (%1). %2'"),
				URL,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			// Диагностика соединения с ресурсом.
			Попытка
				
				РезультатДиагностики = ПолучениеФайловИзИнтернета.ДиагностикаСоединения(
					URL,
					Истина,
					Ложь);
				ОписаниеРезультатаДиагностики = НСтр("ru = 'Результаты диагностики соединения:'")
					+ Символы.ПС + РезультатДиагностики.ОписаниеОшибки;
				
			Исключение
				
				ОписаниеРезультатаДиагностики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось выполнить диагностику соединения. %1'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			КонецПопытки;
			
			УстановитьОписаниеОшибки(
				Результат,
				"ConnectError",
				ПредставлениеОшибки,
				ПодробноеОписаниеОшибки + Символы.ПС + ОписаниеРезультатаДиагностики,
				Перенаправления);
			Возврат Результат;
			
		КонецПопытки;

		Результат.КодСостояния = Ответ.КодСостояния;

		Если Ответ.КодСостояния = 301 // 301 Moved Permanently
			ИЛИ Ответ.КодСостояния = 302 // 302 Found, 302 Moved Temporarily
			ИЛИ Ответ.КодСостояния = 303 // 303 See Other by GET
			ИЛИ Ответ.КодСостояния = 307 Тогда // 307 Temporary Redirect

			КоличествоПеренаправлений = КоличествоПеренаправлений + 1;

			Если КоличествоПеренаправлений > МаксКолвоПеренаправлений Тогда
				УстановитьОписаниеОшибки(
					Результат,
					"ServerError",
					НСтр("ru = 'Превышено количество перенаправлений.'"),
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка сервера при получении файла (%1). Превышено количество перенаправлений (%2).'"),
						URL,
						МаксКолвоПеренаправлений),
					Перенаправления);
				Возврат Результат;
			Иначе
				Location = Ответ.Заголовки.Получить("Location");
				Если Location = Неопределено Тогда
					УстановитьОписаниеОшибки(
						Результат,
						"ServerError",
						НСтр("ru = 'Некорректное перенаправление.'"),
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Некорректное перенаправление, отсутствует HTTP-заголовок ответа ""Location"".'"),
							Ответ.КодСостояния,
							URL),
						Перенаправления);
					Возврат Результат;
				Иначе
					Location = СокрЛП(Location);
					Если ПустаяСтрока(Location) Тогда
						УстановитьОписаниеОшибки(
							Результат,
							"ServerError",
							НСтр("ru = 'Некорректное перенаправление.'"),
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Некорректное перенаправление, пустой HTTP-заголовок ответа ""Location"".'"),
								Ответ.КодСостояния,
								URL),
							Перенаправления);
						Возврат Результат;
					КонецЕсли;

					Если ВыполненныеПеренаправления.Получить(Location) <> Неопределено Тогда
						УстановитьОписаниеОшибки(
							Результат,
							"ServerError",
							НСтр("ru = 'Циклическое перенаправление.'"),
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Ошибка сервера (%1) при получении файла (%2). Циклическое перенаправление (%3).'"),
								Ответ.КодСостояния,
								URL,
								Location),
							Перенаправления);
						Возврат Результат;
					КонецЕсли;

					ВыполненныеПеренаправления.Вставить(Location, Истина);
					URLДляПолучения = Location;

					Перенаправления.Добавить(Строка(Ответ.КодСостояния) + ": " + Location);

				КонецЕсли;
				
			КонецЕсли;

		Иначе

			Прервать;

		КонецЕсли;

	КонецЦикла;

	ИзвлечьGZip =
		(НРег(ЗначениеЗаголовка(Ответ.Заголовки, "content-encoding")) = "gzip");
	Если ПараметрыПолучения.ФорматОтвета = 0 Тогда
		Результат.Содержимое = Ответ.ПолучитьИмяФайлаТела();
	ИначеЕсли ПараметрыПолучения.ФорматОтвета = 1 Тогда
		Результат.Содержимое = ?(ИзвлечьGZip,
			ПолучитьСтрокуИзДвоичныхДанных(
				ЧтениеСодержимогоGZip(
					Результат,
					Ответ.ПолучитьТелоКакДвоичныеДанные())),
			Ответ.ПолучитьТелоКакСтроку());
	ИначеЕсли ПараметрыПолучения.ФорматОтвета = 2 Тогда
		Результат.Содержимое = ?(ИзвлечьGZip,
			ЧтениеСодержимогоGZip(
				Результат,
				Ответ.ПолучитьТелоКакДвоичныеДанные()),
			Ответ.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		Результат.Содержимое = Ответ;
	КонецЕсли;
	
	Если Ответ <> Неопределено Тогда
		Результат.Заголовки = Ответ.Заголовки;
	КонецЕсли;
	
	// Обработка ответа
	Если Ответ.КодСостояния < 200 Или Ответ.КодСостояния >= 300 Тогда

		// Анализ ошибки
		Если Ответ.КодСостояния = 407 Тогда

			// Ошибка подключения - не пройдена аутентификация на прокси-сервере.
			УстановитьОписаниеОшибки(
				Результат,
				"ConnectError",
				НСтр("ru = 'Ошибка аутентификации на прокси-сервере.'"),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка клиента (%1) при выполнении запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		ИначеЕсли Ответ.КодСостояния < 200
			ИЛИ Ответ.КодСостояния >= 300
			И Ответ.КодСостояния < 400 Тогда

			// Формат ответа сервера не поддерживается.
			УстановитьОписаниеОшибки(
				Результат,
				"ServerError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Некорректный ответ сервера (%1).'"),
					Ответ.КодСостояния),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка сервера при получении файла (%1). Некорректный (неподдерживаемый) ответ (%2).
						|Тело ответа: %3'"),
					URL,
					Ответ.КодСостояния,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		ИначеЕсли Ответ.КодСостояния >= 400 И Ответ.КодСостояния < 500 Тогда

			// Ошибка клиентской части - некорректный запрос.
			УстановитьОписаниеОшибки(
				Результат,
				"ClientError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка (%1) при выполнении запроса к ресурсу.'"),
					Строка(Ответ.КодСостояния)),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка клиента (%1) при выполнении запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		Иначе

			// Ошибка сервера - 5хх
			УстановитьОписаниеОшибки(
				Результат,
				"ServerError",
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Код ошибки: %1.'"),
					Строка(Ответ.КодСостояния)),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка сервера (%1) при обработке запроса к ресурсу (%2).
						|Тело ответа: %3'"),
					Ответ.КодСостояния,
					URL,
					Лев(Ответ.ПолучитьТелоКакСтроку(), 5120)),
				Перенаправления);

		КонецЕсли;

		ДобавитьСписокПеренаправленийКИнформацииОбОшибке(
			Результат.ИнформацияОбОшибке,
			Перенаправления);

	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает WSПрокси после проверки на запрет работы с ресурсом.
//
// Параметры:
//  ПараметрыПодключения - Структура - см. ОбщегоНазначения.ПараметрыПодключенияWSПрокси.
//
// Возвращаемое значение:
//  WSПрокси - см. ОбщегоНазначения.СоздатьWSПрокси.
//
Функция СоздатьWSПрокси(ПараметрыПодключения) Экспорт
	
	Если Не РазрешенаРаботаСХостом(ПараметрыПодключения.АдресWSDL) Тогда
		
		ЕстьПравоАдминистрирования = Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обращение к сервисам Интернет-поддержки запрещено. %1'"),
			?(ЕстьПравоАдминистрирования,
				НСтр("ru = 'См. Журнал регистрации'"),
				НСтр("ru = 'Обратитесь к администратору.'")));
			
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПодключения);
	
КонецФункции

// Возвращает HTTPСоединение после проверки на запрет работы с ресурсом.
//
// Параметры:
//  ПараметрыПодключения - Структура - свойства HTTPСоединения.
//
// Возвращаемое значение:
//  HTTPСоединение - HTTPСоединение, созданное на основании параметров.
//
Функция СоздатьHTTPСоединение(ПараметрыПодключения) Экспорт
	
	Если Не РазрешенаРаботаСХостом(ПараметрыПодключения.Сервер) Тогда
		
		ЕстьПравоАдминистрирования = Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь);
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обращение к сервисам Интернет-поддержки запрещено. %1'"),
			?(ЕстьПравоАдминистрирования,
				НСтр("ru = 'См. Журнал регистрации'"),
				НСтр("ru = 'Обратитесь к администратору.'")));
			
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Результат = Новый HTTPСоединение(
		ПараметрыПодключения.Сервер,
		ПараметрыПодключения.Порт,
		ПараметрыПодключения.Пользователь,
		ПараметрыПодключения.Пароль,
		ПараметрыПодключения.Прокси,
		ПараметрыПодключения.Таймаут,
		ПараметрыПодключения.ЗащищенноеСоединение);
	
	Возврат Результат;
	
КонецФункции

// Формирует стандартные заголовки для вызова операции.
//
// Параметры:
//  Сценарий - Строка, Неопределено - сценарий выполнения запроса. Если Неопределено, заголовок
//   X-Use-Case не будет добавлен.
//  ДобавитьТипКонтента - Булево - если Истина будет добавлен заголовок Content-Type : application/json.
//
// Возвращаемое значение:
//  Соответствие - заголовки операции.
//
Функция НовыйЗаголовкиВызоваОперации(
		Сценарий = Неопределено,
		ДобавитьТипКонтента = Истина) Экспорт
	
	Заголовки = Новый Соответствие;
	Если ЗначениеЗаполнено(Сценарий) Тогда
		Заголовки.Вставить("X-Use-Case", Сценарий);
	КонецЕсли;
	Если ДобавитьТипКонтента Тогда
		Заголовки.Вставить("Content-Type", "application/json");
	КонецЕсли;
	
	Возврат Заголовки;
	
КонецФункции

#КонецОбласти

#Область ВызовОперацийСервисов

// Формирует структуру дополнительных параметров для передачи в сервисы.
//
// Параметры:
//  ФорматЗначенийСтрока - Булево - формат смещения.
//
// Возвращаемое значение:
//  Соответствие - дополнительные параметры.
//
Функция ДополнительныеПараметрыВызоваОперацииСервиса(ФорматЗначенийСтрока = Истина) Экспорт
	
	Результат = Новый Соответствие;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая()
		И Не ОбщегоНазначения.ЭтоВебКлиент() Тогда
		
		Результат.Вставить("ClientPlatformType",
			ОбщегоНазначенияКлиентСервер.ИмяТипаПлатформы(
				СистемнаяИнформация.ТипПлатформы));
		Результат.Вставить("ClientOSVersion", СистемнаяИнформация.ВерсияОС);
		
	Иначе
		
		СистемнаяИнформацияКлиент = ОбщегоНазначения.СистемнаяИнформацияКлиента();
		Если СистемнаяИнформацияКлиент <> Неопределено Тогда
			Результат.Вставить("ClientPlatformType", СистемнаяИнформацияКлиент.ТипПлатформы);
			Результат.Вставить("ClientOSVersion", СистемнаяИнформацияКлиент.ВерсияОС);
		КонецЕсли;
		
		Результат.Вставить("ServerPlatformType",
			ОбщегоНазначенияКлиентСервер.ИмяТипаПлатформы(
				СистемнаяИнформация.ТипПлатформы));
		Результат.Вставить("ServerOSVersion", СистемнаяИнформация.ВерсияОС);
		
	КонецЕсли;
	
	Результат.Вставить("PlatformVersion", СистемнаяИнформация.ВерсияПриложения);
	
	Результат.Вставить("LibraryVersion",
		ИнтернетПоддержкаПользователейКлиентСервер.ВерсияБиблиотеки());
	Результат.Вставить("ConfigName", ИмяКонфигурации());
	Результат.Вставить("ConfigVersion", ВерсияКонфигурации());
	Результат.Вставить("Vendor", Метаданные.Поставщик);
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Результат.Вставить("IBID",
			СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
	КонецЕсли;
	Результат.Вставить("ConfigLanguage", КодЯзыкаИнтерфейсаКонфигурации());
	Результат.Вставить("ConfigMainLanguage", КодОсновногоЯзыкаИнтерфейсаКонфигурации());
	Результат.Вставить("CurLocalizationCode", ТекущийКодЛокализации());
	Результат.Вставить("SystemLanguage", ТекущийЯзыкСистемы());
	Результат.Вставить("ClientTimeOffsetGMT",
		?(ФорматЗначенийСтрока,
		  Формат((ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата()), "ЧГ=0"),
		  (ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата())));
	
	Результат.Вставить("countryId", "");
	
	Результат.Вставить(
		"IBIsSeparated",
		?(ФорматЗначенийСтрока,
		  ?(ОбщегоНазначения.РазделениеВключено(), "true", "false"),
		  ОбщегоНазначения.РазделениеВключено()));
	Результат.Вставить("IBUserName", Строка(ИмяПользователя()));
	
	НастройкиСоединения = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.НастройкиСоединенияССерверамиИПП();
	Если НастройкиСоединения.ДоменРасположенияСерверовИПП = 0 Тогда
		Результат.Вставить("DomainZone", "ru");
	ИначеЕсли НастройкиСоединения.ДоменРасположенияСерверовИПП = 1 Тогда
		Результат.Вставить("DomainZone", "eu");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НастройкиКлиентаЛицензирования

// Возвращает признак возможности работы с настройками клиента лицензирования
// в БИП.
//
// Возвращаемое значение:
//  Булево - Истина если версия платформы 1С:Предприятие 8.3.7 или выше и не работа в модели сервиса.
//
Функция ДоступнаРаботаСНастройкамиКлиентаЛицензирования() Экспорт

	Возврат Не ОбщегоНазначения.РазделениеВключено();

КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

// См. ШаблоныСообщенийПереопределяемый.ПриПодготовкеШаблонаСообщения.
//
Процедура ПриПодготовкеШаблонаСообщения(
		Реквизиты,
		Вложения,
		НазначениеШаблона,
		ДополнительныеПараметры) Экспорт
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнЗаказы") Тогда
		МодульОнлайнЗаказыСлужебный = ОбщегоНазначения.ОбщийМодуль("ОнлайнЗаказыСлужебный");
		МодульОнлайнЗаказыСлужебный.ПриПодготовкеШаблонаСообщения(
			Реквизиты,
			Вложения,
			НазначениеШаблона,
			ДополнительныеПараметры);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнОплаты") Тогда
		МодульОнлайнОплаты = ОбщегоНазначения.ОбщийМодуль("ОнлайнОплаты");
		МодульОнлайнОплаты.ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежейСобытия
			= ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСобытия");
		МодульСистемаБыстрыхПлатежейСобытия.ПриПодготовкеШаблонаСообщения(
			Реквизиты,
			Вложения,
			НазначениеШаблона,
			ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриФормированииСообщения.
//
Процедура ПриФормированииСообщения(
		Сообщение,
		НазначениеШаблона,
		ПредметСообщения,
		ПараметрыШаблона) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнЗаказы") Тогда
		МодульОнлайнЗаказыСлужебный = ОбщегоНазначения.ОбщийМодуль("ОнлайнЗаказыСлужебный");
		МодульОнлайнЗаказыСлужебный.ПриФормированииСообщения(
			Сообщение,
			НазначениеШаблона,
			ПредметСообщения,
			ПараметрыШаблона);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнОплаты") Тогда
		МодульОнлайнОплаты = ОбщегоНазначения.ОбщийМодуль("ОнлайнОплаты");
		МодульОнлайнОплаты.ПриФормированииСообщения(Сообщение, НазначениеШаблона, ПредметСообщения, ПараметрыШаблона);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежейСобытия
			= ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСобытия");
		МодульСистемаБыстрыхПлатежейСобытия.ПриФормированииСообщения(
			Сообщение,
			НазначениеШаблона,
			ПредметСообщения,
			ПараметрыШаблона);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФункциональныеОпцииБСП

// Выполняет включение функциональных опций, необходимых для отправки шаблонов сообщений.
//
// Параметры:
//  ИспользоватьПодсистемуВзаимодействия - Булево - признак использования подсистемы Взаимодействия.
//
Процедура УстановитьИспользованиеОтправкиШаблоновСообщений(ИспользоватьПодсистемуВзаимодействия) Экспорт
	
	Если ИспользоватьПодсистемуВзаимодействия Тогда
		УстановитьИспользованиеSMS();
		УстановитьИспользованиеЭлектроннойПочты();
		УстановитьОтправкуПисемВФорматеHTML();
	КонецЕсли;
	
	УстановитьИспользованиеШаблоновСообщений();
	
КонецПроцедуры

// Возвращает значение функциональной опции "ОтправлятьПисьмаВФорматеHTML"
//
// Возвращаемое значение:
//  Булево - признак использования функциональной опции "ОтправлятьПисьмаВФорматеHTML".
//
Функция ОтправлятьПисьмаВФорматеHTML() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия") Тогда
		МодульВзаимодействия = ОбщегоНазначения.ОбщийМодуль("Взаимодействия");
		Возврат МодульВзаимодействия.ИспользуетсяОтправкаПисемВФорматеHTML();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область БлокировкаРаботыССервисамиИнтернетПоддержки

// Проверяет разрешение на работу с сервисом по переданному URL.
// Работа с хостом разрешена, когда выполняется одно из условий:
//  1) Не установлена блокировка работы с внешними ресурсами.
//  2) Не установлена блокировка работы с сервисами Интернет-поддержки.
//  3) Разрешена работа с сервисом. Сервис определяется по URL.
//
// Параметры:
//  URL - Строка - URL вызываемой операции;
// 
// Возвращаемое значение:
//  Булево - признак разрешения с сервисом.
//
Функция РазрешенаРаботаСХостом(URL) Экспорт
	
	Если Не РегламентныеЗаданияСервер.РаботаСВнешнимиРесурсамиЗаблокирована() Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыБлокировки = ПараметрыБлокировкиССервисамиИнтернетПоддержки();
	Если Не ПараметрыБлокировки.РаботаССервисамиИнтернетПоддержкиЗаблокирована Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	СервисИнтернетПоддержки = ПараметрыБлокировки.ХостыСервисовИнтернетПоддержки.Получить(СтруктураURI.ИмяСервера);
	Если СервисИнтернетПоддержки = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПараметрыСервиса = ПараметрыБлокировки.СервисыИнтернетПоддержки.Получить(СервисИнтернетПоддержки);
	РазрешенаРаботаСХостом = (ПараметрыСервиса = Неопределено
		Или ПараметрыСервиса.РазрешенаРабота);
	
	Если Не РазрешенаРаботаСХостом Тогда
		
		ИнформацияОбОшибке = НСтр("ru = 'Обращение к сервисам Интернет-поддержки запрещено.
			|Для разрешения работы с сервисами откройте раздел Интернет-поддержка и сервисы и нажмите ""Настроить"".'");
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ИнформацияОбОшибке);
		
	КонецЕсли;
	
	Возврат РазрешенаРаботаСХостом;
	
КонецФункции

// Выполняет снятие блокировки на работу с сервисом по переданному URL.
//
// Параметры:
//  URL - Строка - URL вызываемой операции.
//
Процедура РазблокироватьРаботуСХостом(URL) Экспорт
	
	ПараметрыБлокировки = ПараметрыБлокировкиССервисамиИнтернетПоддержки();
	Если Не ПараметрыБлокировки.РаботаССервисамиИнтернетПоддержкиЗаблокирована Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураURI            = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	СервисИнтернетПоддержки = ПараметрыБлокировки.ХостыСервисовИнтернетПоддержки.Получить(СтруктураURI.ИмяСервера);
	
	ПараметрыСервиса = ПараметрыБлокировки.СервисыИнтернетПоддержки.Получить(СервисИнтернетПоддержки);
	Если ПараметрыСервиса <> Неопределено Тогда
		
		ПараметрыСервиса.РазрешенаРабота = Истина;
		
		СохранитьПараметрыБлокировки(ПараметрыБлокировки);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Интерфейс85

// Настраивает командную панель мастера.
//
// Параметры:
//  КнопкаДалее - КнопкаФормы, Неопределено - элемент формы кнопки "Далее".
//  КнопкаНазад - КнопкаФормы, Неопределено - элемент формы кнопки "Назад".
//
Процедура НастроитьКоманднуюПанельМастера(
		КнопкаДалее = Неопределено,
		КнопкаНазад = Неопределено) Экспорт
	
	Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
		Если КнопкаНазад <> Неопределено Тогда
			КнопкаНазад.Заголовок = НСтр("ru = 'Назад'");
			КнопкаНазад.Картинка = БиблиотекаКартинок.ПерейтиНазад;
			КнопкаНазад.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
		Если КнопкаДалее <> Неопределено Тогда
			КнопкаДалее.Заголовок = НСтр("ru = 'Далее'");
			КнопкаДалее.Картинка = БиблиотекаКартинок.ПерейтиВперед;
			КнопкаДалее.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТехническаяИнформация

// Определяет описание настроек Интернет-поддержки.
//
// Параметры:
//  НастройкиТехническойИнформации - см. ИнтернетПоддержкаПользователейКлиентСервер.НастройкиТехническойИнформации.
// 
// Возвращаемое значение:
//  Структура - информация о настройках Интернет-поддержки:
//    * Логин - Строка - логин пользователя интернет-поддержки.
//    * ПарольЗаполнен - Булево - признак того, что пароль заполнен.
//    * ИдентификаторЦентрМониторинга - Строка - идентификатор информационной базы.
//        Заполняется если в конфигурацию включена подсистема СтандартныеПодсистемы.ЦентрМониторинга.
//    * ИмяКлиентаЛицензирования - Строка - имя клиента лицензирования.
//        Заполняется если НастройкиТехническойИнформации.ОтправкаИдентификатораКонфигурации = Истина.
//    * ИДКонфигурации - Строка - идентификатор конфигурации.
//        Заполняется если НастройкиТехническойИнформации.ОтправкаИдентификатораКонфигурации = Истина.
//    * РегистрационныйНомер - Строка - регистрационный номер конфигурации.
//        Заполняется если в конфигурацию включена подсистема
//        ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки.
//    * УстанавливатьРегистрационныйНомер - Булево - служебный параметр.
//        Используется в форме "О программе".
//
Функция НастройкиИнтернетПоддержки(НастройкиТехническойИнформации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Структура(
		"Логин, ПарольЗаполнен",
		"",
		Ложь);
	
	Если ДанныеАутентификации <> Неопределено Тогда
		Результат.Вставить("Логин", ДанныеАутентификации.Логин);
		Результат.Вставить(
			"ПарольЗаполнен",
			Не ПустаяСтрока(ДанныеАутентификации.Пароль));
		ДанныеАутентификации.Очистить();
	КонецЕсли;
	
	ИдентификаторЦентрМониторинга = "";
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЦентрМониторинга") Тогда
		МодульЦентрМониторинга = ОбщегоНазначения.ОбщийМодуль("ЦентрМониторинга");
		ИдентификаторЦентрМониторинга = МодульЦентрМониторинга.ИдентификаторИнформационнойБазы();
	КонецЕсли;
	Результат.Вставить("ИдентификаторЦентрМониторинга", ИдентификаторЦентрМониторинга);
	
	ИмяКлиентаЛицензирования = "";
	ИДКонфигурации = "";
	Если НастройкиТехническойИнформации.ОтправкаИдентификатораКонфигурации
		И ДоступнаРаботаСНастройкамиКлиентаЛицензирования() Тогда
		
		ИДКонфигурации = ИнтернетПоддержкаПользователейСлужебныйПовтИсп.ИДКонфигурации();
		Если Не ПустаяСтрока(ИДКонфигурации) Тогда
			ИмяКлиентаЛицензирования = КлиентЛицензирования.ИмяКлиентаЛицензирования();
		КонецЕсли;
		
	КонецЕсли;
	Результат.Вставить("ИмяКлиентаЛицензирования", ИмяКлиентаЛицензирования);
	Результат.Вставить("ИДКонфигурации", ИДКонфигурации);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки") Тогда
		МодульСообщенияВСлужбуТехническойПоддержки = ОбщегоНазначения.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержки");
		
		РегНомер = МодульСообщенияВСлужбуТехническойПоддержки.РегистрационныйНомер();
		Результат.Вставить("РегистрационныйНомер", РегНомер);
		Результат.Вставить("УстанавливатьРегистрационныйНомер", Истина);
	Иначе
		Результат.Вставить("РегистрационныйНомер", "");
		Результат.Вставить("УстанавливатьРегистрационныйНомер", Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет описание настроек Интернет-соединений.
//
// Возвращаемое значение:
//  Структура - информация о текущих настройках Интернет-соединения:
//   * ДоменнаяЗона - Строка - "1c.eu" или "1c.ru".
//   * НастройкиПрокси - Строка - настройка использования прокси.
// 
Функция ИнтернетНастройки() Экспорт
	
	НастройкиСоединения = НастройкиСоединенияССерверами();
	
	Результат = Новый Структура;
	Результат.Вставить(
		"ДоменнаяЗона",
		?(НастройкиСоединения.ДоменРасположенияСерверовИПП = 1, "1c.eu", "1c.ru"));
	
	НастройкиПрокси = ПолучениеФайловИзИнтернета.НастройкиПроксиНаСервере();
	Если НастройкиПрокси = Неопределено Тогда
		ЗначениеНастройкиПрокси = "DONT_USE";
	Иначе
		Если НастройкиПрокси.Получить("ИспользоватьПрокси") Тогда
			ЗначениеНастройкиПрокси = ?(НастройкиПрокси.Получить("ИспользоватьСистемныеНастройки"),
				"AUTO",
				"USE");
		Иначе
			ЗначениеНастройкиПрокси = "DONT_USE";
		КонецЕсли;
	КонецЕсли;
	Результат.Вставить("НастройкиПрокси", ЗначениеНастройкиПрокси);
	
	Возврат Результат;
	
КонецФункции

// Определяет описание текущей сессии пользователя.
//
// Возвращаемое значение:
//  Структура - информация о сессии:
//   * ИмяПользователя - Строка - имя текущего пользователя.
//   * ИспользуемыйКлиент - Строка - используемый клиент.
//   * РежимРаботы - Строка - режим работы с информационной базой (файловый или серверный).
//   * СтрокаСоединенияИнформационнойБазы - Строка - строка соединения с информационной базой.
//   * ЕстьПравоАдминистрирования - Булево - наличие прав администрирования у текущего пользователя.
//   * ЕстьПолныеПрава - Булево - наличие полных прав у текущего пользователя.
//
Функция ОписаниеТекущейСессии() Экспорт
	
	ЭтоФайловаяИБ = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяПользователя", ИмяПользователя());
	Результат.Вставить("ИспользуемыйКлиент", ОбщегоНазначения.ИспользуемыйКлиент());
	Результат.Вставить(
		"РежимРаботы",
		?(ЭтоФайловаяИБ, "FILE", "SRVR"));
	Результат.Вставить(
		"СтрокаСоединенияИнформационнойБазы",
		СтрокаСоединенияИнформационнойБазы());
	Результат.Вставить(
		"ЕстьПравоАдминистрирования",
		Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь));
	Результат.Вставить(
		"ЕстьПолныеПрава",
		Пользователи.ЭтоПолноправныйПользователь(, Ложь, Ложь));

	Возврат Результат;
	
КонецФункции

// Определяет описание программы.
//
// Возвращаемое значение:
//  Структура - описание программы:
//    * ОписаниеКонфигурации - Строка - синоним конфигурации.
//    * Версия - Строка - версия конфигурации.
//    * Поставщик - Строка - поставщик конфигурации.
//    * ИдентификаторИнтернетПоддержки - Строка - идентификатор конфигурации для интернет-поддержки.
//    * ИмяКонфигурации - см. ИнтернетПоддержкаПользователей.ИмяКонфигурации.
//    * РежимСовместимости - Строка - режим совместимости конфигурации.
//    * РежимСовместимостиИнтерфейса - Строка - режим совместимости конфигурации интерфейса.
//    * ОписаниеКонфигурацииДляВывода - Строка - описание конфигурации для вывода в форме "О программе".
//    * ПроверитьНаличиеОбновленийКонфигурации - Булево - Истина, если необходимо проверить наличие
//       обновлений программы в форме "О программе".
//
Функция ОписаниеПрограммы() Экспорт
	
	ИмяПрограммы = Строка(СлужебнаяИмяПрограммы());
	Если ИмяПрограммы = "Unknown" Тогда
		ИмяПрограммы = НСтр("ru = '<Не заполнено>'");
	КонецЕсли;
	
	Синоним = Метаданные.Синоним;
	ПодробнаяИнформация = Метаданные.ПодробнаяИнформация;
	URLКонфигурации = Метаданные.АдресИнформацииОКонфигурации;
	Копирайт = Метаданные.АвторскиеПрава;
	
	ПредставлениеКонфигурации = ?(ЗначениеЗаполнено(ПодробнаяИнформация), ПодробнаяИнформация, Синоним);
	Если ЗначениеЗаполнено(URLКонфигурации) Тогда
		URLКонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"(<a href=""%1"">%1</a>)",
			URLКонфигурации);
	КонецЕсли;
	
	ПредставлениеКонфигурацииДляВывода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"%1 %2%3",
		ПредставлениеКонфигурации,
		URLКонфигурации,
		?(ЗначениеЗаполнено(Копирайт), Символы.ПС + Копирайт, ""));
	
	Результат = Новый Структура;
	Результат.Вставить("ОписаниеКонфигурации", Синоним);
	Результат.Вставить("Версия", ВерсияКонфигурации());
	Результат.Вставить("Поставщик", Метаданные.Поставщик);
	Результат.Вставить("ИдентификаторИнтернетПоддержки", ИмяПрограммы);
	Результат.Вставить("ИмяКонфигурации", ИмяКонфигурации());
	Результат.Вставить("РежимСовместимости", Строка(Метаданные.РежимСовместимости));
	Результат.Вставить("РежимСовместимостиИнтерфейса", Строка(Метаданные.РежимСовместимостиИнтерфейса));
	Результат.Вставить("ОписаниеКонфигурацииДляВывода", ПредставлениеКонфигурацииДляВывода);
	Результат.Вставить("ПроверитьНаличиеОбновленийКонфигурации", Ложь);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
		Результат.ПроверитьНаличиеОбновленийКонфигурации = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИнформационныйЦентр

// Проверяет, используется ли в конфигурации отправка сообщений в Информационный центр
// 
// Возвращаемое значение:
//  Булево - признак использования информационного центра.
// 
Функция ИспользуетсяИнформационныйЦентр() Экспорт
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МодульИнформационныйЦентрСервер = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСервер"); // АПК:271 Ранее проверка существования подсистемы
	Если Не МодульИнформационныйЦентрСервер.НастроенаИнтеграцияСИнформационнымЦентром() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Конструктор параметров передачи обращения в Информационный центр.
// 
// Возвращаемое значение:
//  Структура - параметры передачи обращения в информационный центр:
//  * Тема - Строка - тема обращения;
//  * Текст - Строка - текст обращения;
//  * Вложения - Массив из Структура - описание вложенных файлов:
//     ** ИмяФайла - Строка - имя файла-вложения с расширением, например "file.txt";
//     ** АдресВоВременномХранилище - Строка - адрес файла-вложения во временном хранилище;
//  * ДополнительныеДанные - Структура - произвольная структура данных, которую можно передать в службу поддержки.
//                           Эта структура должна быть сериализуемой в JSON;
//  * ИспользоватьСтандартныйШаблон - Булево - устарел. Больше не используется;
//  * ОбработчикЗавершения - Неопределено - ОписаниеОповещения, Неопределено - описание оповещения о закрытии формы
//                           нового обращения.
//
Функция НовыйСообщениеВИнформационныйЦентр() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Тема",                          "");
	Результат.Вставить("Текст",                         "");
	Результат.Вставить("Вложения",                      Новый Массив);
	Результат.Вставить("ДополнительныеДанные",          Новый Структура);
	Результат.Вставить("ИспользоватьСтандартныйШаблон", Ложь);
	Результат.Вставить("ОбработчикЗавершения",          Неопределено);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФункциональныеОпцииБСП

// Проверяет наличие подсистемы "Взаимодействия" и производит включение функциональной опции, отвечающей за SMS.
//
Процедура УстановитьИспользованиеSMS()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия")
		Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОтправкаSMS") Тогда
		Возврат;
	КонецЕсли;
	
	МодульВзаимодействия = ОбщегоНазначения.ОбщийМодуль("Взаимодействия");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не МодульВзаимодействия.ИспользуютсяПрочиеВзаимодействия() Тогда
		МодульВзаимодействия.УстановитьИспользованиеПрочегоВзаимодействия(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Проверяет наличие подсистемы "Шаблоны сообщений" и производит включение соответствующей функциональной опции.
//
Процедура УстановитьИспользованиеШаблоновСообщений()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ШаблоныСообщений") Тогда
		Возврат;
	КонецЕсли;
	
	МодульШаблоныСообщений = ОбщегоНазначения.ОбщийМодуль("ШаблоныСообщений");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не МодульШаблоныСообщений.ИспользуютсяШаблоныСообщений() Тогда
		МодульШаблоныСообщений.УстановитьИспользованиеШаблоновСообщений(Истина);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Проверяет наличие подсистемы "Взаимодействия" и производит включение функциональной опции, отвечающей за ЭП.
//
Процедура УстановитьИспользованиеЭлектроннойПочты()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия")
		Или Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		Возврат;
	КонецЕсли;
	
	МодульВзаимодействия = ОбщегоНазначения.ОбщийМодуль("Взаимодействия");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не МодульВзаимодействия.ИспользуетсяПочтовыйКлиент() Тогда
		МодульВзаимодействия.УстановитьИспользованиеПочтовогоКлиента(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Проверяет наличие подсистемы "Взаимодействия" и производит включение функциональной опции,
// отвечающей за отправку писем в формате HTML.
//
Процедура УстановитьОтправкуПисемВФорматеHTML()
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия") Тогда
		Возврат;
	КонецЕсли;
	
	МодульВзаимодействия = ОбщегоНазначения.ОбщийМодуль("Взаимодействия");
	
	УстановитьПривилегированныйРежим(Истина);

	Если Не МодульВзаимодействия.ИспользуетсяОтправкаПисемВФорматеHTML() Тогда
		МодульВзаимодействия.УстановитьИспользованиеОтправкиПисемВФорматеHTML(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеИнтернетПоддержки

// Создает новую структуру параметров аутентификации.
//
// Параметры:
//  Логин  - Строка, Неопределено - логин Интернет-поддержки.
//  Пароль  - Строка, Неопределено - пароль Интернет-поддержки.
//  Тикет  - Строка, Неопределено - тикет аутентификации.
//
// Возвращаемое значение:
//  Структура - описание параметров аутентификации:
//    * Логин  - Строка, Неопределено - логин Интернет-поддержки.
//    * Пароль  - Строка, Неопределено - пароль Интернет-поддержки.
//    * Тикет  - Строка, Неопределено - тикет аутентификации.
//
Функция НовыйДанныеАутентификации(
		Логин = Неопределено,
		Пароль = Неопределено,
		Тикет = Неопределено) Экспорт
	
	Аутентификация = Новый Структура;
	Аутентификация.Вставить("Логин", Логин);
	Аутентификация.Вставить("Пароль", Пароль);
	Аутентификация.Вставить("Тикет", Тикет);
	
	Возврат Аутентификация;
	
КонецФункции

// Создает новую структуру результата получения тикета.
//
// Параметры:
//  Логин  - Строка, Неопределено - логин Интернет-поддержки.
//  Пароль  - Строка, Неопределено - пароль Интернет-поддержки.
//  Тикет  - Строка, Неопределено - тикет аутентификации.
//
// Возвращаемое значение:
//  Структура - описание параметров аутентификации:
//    * КодОшибки  - Строка - код ошибки.
//    * СообщениеОбОшибке  - Строка - сообщение об ошибки для пользователя.
//    * ИнформацияОбОшибке  - Строка - сообщение об ошибки для администратора.
//    * Тикет  - Строка, Неопределено - тикет аутентификации.
//
Функция НовыйРезультатПолученияТикета() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки", "");
	Результат.Вставить("СообщениеОбОшибке" , "");
	Результат.Вставить("ИнформацияОбОшибке", "");
	Результат.Вставить("Тикет", Неопределено);
	
	Возврат Результат;
	
КонецФункции 

// Создает новый идентификатор клиента.
//
// Возвращаемое значение:
//  Строка - идентификатор клиента.
//
Функция НовыйИдентификаторКлиента()
	
	Возврат СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
	
КонецФункции

// Подключает Интернет-поддержку пользователей в информационной базе.
//
// Параметры:
//  ДанныеАутентификации - Структура - структура, содержащая логин,
//    пароль пользователя Интернет-поддержки и тикет аутентификации.
//  Сценарий - Строка - сценарий выполнения запроса.
//  Капча - Строка, Неопределено - капча, которую должен ввести пользователь в случае
//    блокировки частого получения мастер токена.
//
// Возвращаемое значение:
//  Структура - результат проверки данных аутентификации:
//   * Подключена - Булево - результат проверки, если Истина, логин и пароль ведены верно.
//   * КапчаBase64 - Строка - картинка капчи в формате base64.
//       Картинка капчи может быть возвращена в случае получения ошибки
//       "ПревышеноКоличествоПопыток".
//   * КодОшибки - Строка - идентификатор ошибки в случае если логин и пароль ведены верно
//      или в процессе проверки возникли ошибки;
//   * СообщениеОбОшибке - Строка - описание ошибки проверки данных аутентификации.
//
Функция СлужебнаяПодключить(
		ДанныеАутентификации,
		Сценарий,
		Капча = Неопределено)
	
	Если (Не ОбщегоНазначения.РазделениеВключено() И Не ДоступноПодключениеИнтернетПоддержки())
			Или Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Подключение Интернет-поддержки недоступно.'");
	КонецЕсли;
	
	Аутентификация = НовыйДанныеАутентификации(
		ДанныеАутентификации.Логин,
		ДанныеАутентификации.Пароль,
		ДанныеАутентификации.Тикет);
	Аутентификация.Вставить("МастерТокен", Неопределено);
	
	Если (Не ЗначениеЗаполнено(Аутентификация.Логин)
		Или Не ЗначениеЗаполнено(Аутентификация.Пароль))
		И Не ЗначениеЗаполнено(Аутентификация.Тикет) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнены параметры аутентификации.'")
	КонецЕсли;
	
	Результат = ИнтернетПоддержкаПользователейКлиентСервер.НовыйРезультатПодключения();
	Результат.Логин = Аутентификация.Логин;
	
	ИдентификаторКлиента = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы(),
		ИдентификаторИдентификаторКлиента());
	Если Не ЗначениеЗаполнено(ИдентификаторКлиента) Тогда
		ИдентификаторКлиента = НовыйИдентификаторКлиента();
	КонецЕсли;
	
	РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияМастерТокен(
		Аутентификация.Логин,
		Аутентификация.Пароль,
		Аутентификация.Тикет,
		ИдентификаторКлиента,
		Сценарий,
		Капча);
	
	Если РезультатОперации.ОбновитьИдентификатор Тогда
		ИдентификаторКлиента = НовыйИдентификаторКлиента();
		РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияМастерТокен(
			Аутентификация.Логин,
			Аутентификация.Пароль,
			Аутентификация.Тикет,
			ИдентификаторКлиента,
			ИдентификаторСценарияОбновленияТокена(),
			Капча);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Аутентификация.МастерТокен = РезультатОперации.МастерТокен;
		Если Не ЗначениеЗаполнено(Аутентификация.МастерТокен) Тогда
			ВызватьИсключение НСтр("ru = 'Мастер токен не заполнен.'")
		КонецЕсли;
	Иначе
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатОперации);
		Возврат Результат;
	КонецЕсли;
	
	СлужебнаяСохранитьДанныеАутентификации(
		Аутентификация,
		ИдентификаторКлиента);
	Результат.Подключена = Истина;
	
	Возврат Результат;
	
КонецФункции

// Создает мастер токен на основании сохраненного
// логина и пароля Интернет-поддержки пользователей.
//
// Параметры:
//  Сценарий - Строка - сценарий выполнения запроса.
//
// Возвращаемое значение:
//   Строка, Неопределено - созданные мастер токен.
//
Функция СлужебнаяСоздатьМастерТокен(Сценарий)
	
	Если Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Получение мастер токена не в привилегированном режиме запрещено.'");
	КонецЕсли;
	
	Аутентификация = НовыйДанныеАутентификации();
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Результат = СлужебнаяТикетАутентификацииНаПорталеПоддержки(
			ИдентификаторКлючаМастерТокен(),
			ТипАутентификацииBearer());
		Если ЗначениеЗаполнено(Результат.КодОшибки) Тогда
			ЗаписатьИнформациюВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось получить тикет для генерации мастер токен по причине:
					|%1'"),
					Результат.ИнформацияОбОшибке),
				Неопределено,
				Истина);
			Возврат Неопределено;
		КонецЕсли;
		Аутентификация.Тикет = Результат.Тикет;
	Иначе
		ДанныеАутентификации = СлужебнаяДанныеАутентификации();
		Если ДанныеАутентификации = Неопределено Тогда
			ЗаписатьИнформациюВЖурналРегистрации(
				НСтр("ru = 'Не удалось получить тикет для генерации мастер токен по причине:
					|Не подключена Интернет-поддержка пользователей.'"));
			Возврат Неопределено;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(
			Аутентификация,
			ДанныеАутентификации,
			"Логин, Пароль");
	КонецЕсли;
	
	СлужебнаяПодключить(
		Аутентификация,
		Сценарий);
	
	Возврат МастерТокен();
	
КонецФункции

// Получает мастер токен из безопасного хранилища.
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Возвращаемое значение:
//   Строка, Неопределенно - мастер токен из безопасного хранилища.
//
Функция МастерТокен()
	
	Если Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Полученные мастер токена не в привилегированном режиме запрещено.'");
	КонецЕсли;
	
	ДанныеВБезопасномХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы(),
		ИдентификаторКлючаМастерТокен());
	
	Если ДанныеВБезопасномХранилище = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ДанныеВБезопасномХранилище;
	КонецЕсли;
	
КонецФункции

// Сохраняет логин и пароль пользователя в подсистеме Интернет-поддержки
// в безопасном хранилище. В вызывающем коде перед записью данных необходимо
// проверить права и установить привилегированный режим.
//
// Параметры:
// ДанныеАутентификации - Структура, Неопределено - структура, содержащая логин 
//                        и пароль пользователя Интернет-поддержки, тикет и мастер токен.
//                        Если передано значение Неопределено, данные аутентификации удаляются.
//   * Логин - Строка - логин пользователя Интернет-поддержки;
//   * Пароль - Строка - пароль пользователя Интернет-поддержки.
//   * Тикет - Строка
//   * МастерТокен - Строка
// ИдентификаторКлиента - Строка
//
Процедура СлужебнаяСохранитьДанныеАутентификации(
		ДанныеАутентификации,
		ИдентификаторКлиента)
	
	Если ДанныеАутентификации = Неопределено Тогда
		
		// Удалить все данные для логина из безопасного хранилища.
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
			ИдентификаторПодсистемы());
		
		ЗаписатьИнформациюВЖурналРегистрации(
			НСтр("ru = 'Очищены данные аутентификации.'"),
			Неопределено,
			Ложь);
		
		ИнтеграцияПодсистемБИП.ПриИзмененииДанныхАутентификацииИнтернетПоддержки(
			Неопределено);
		ИнтернетПоддержкаПользователейПереопределяемый.ПриИзмененииДанныхАутентификацииИнтернетПоддержки(
			Неопределено);
		
	Иначе
		
		// Запись данных в безопасное хранилище
		ИДПодсистемы = ИдентификаторПодсистемы();
		НачатьТранзакцию();
		Попытка
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ИДПодсистемы);
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИДПодсистемы,
				ДанныеАутентификации.Логин,
				ИдентификаторЛогин());
			
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИДПодсистемы,
				ДанныеАутентификации.Пароль,
				ИдентификаторПароль());
			
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИДПодсистемы,
				ДанныеАутентификации.МастерТокен,
				ИдентификаторКлючаМастерТокен());
			
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИДПодсистемы,
				ИдентификаторКлиента,
				ИдентификаторИдентификаторКлиента());
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписатьИнформациюВЖурналРегистрации(
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
		ЗаписатьИнформациюВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Записаны данные аутентификации, логин ""%1"".'"),
				ДанныеАутентификации.Логин),
			Неопределено,
			Ложь);
			
		Аутентификация = Новый Структура(
			"Логин,
			|Пароль",
			ДанныеАутентификации.Логин,
			ДанныеАутентификации.Пароль);
		ИнтеграцияПодсистемБИП.ПриИзмененииДанныхАутентификацииИнтернетПоддержки(
			Аутентификация);
		ИнтернетПоддержкаПользователейПереопределяемый.ПриИзмененииДанныхАутентификацииИнтернетПоддержки(
			Аутентификация);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает логин и пароль пользователя Интернет-поддержки,
// сохраненные в информационной базе. Перед вызовом вызывающий
// код должен устанавливать привилегированный режим.
//
// Возвращаемое значение:
//  Структура - Структура - логин и пароль пользователя Интернет-поддержки:
//    * Логин - Строка - логин пользователя Интернет-поддержки;
//    * Пароль - Строка - пароль пользователя Интернет-поддержки.
//  Неопределено - при отсутствии сохраненных данных аутентификации.
//
Функция СлужебнаяДанныеАутентификации()
	
	ДанныеВБезопасномХранилище = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ИдентификаторПодсистемы(),
		ИдентификаторЛогин()
			+ ","
			+ ИдентификаторПароль());
	
	Если ДанныеВБезопасномХранилище.login <> Неопределено
		И ДанныеВБезопасномХранилище.password <> Неопределено Тогда
		Возврат Новый Структура(
			"Логин, Пароль",
			ДанныеВБезопасномХранилище.login,
			ДанныеВБезопасномХранилище.password);
	КонецЕсли;
	
КонецФункции

// Возвращает тикет аутентификации пользователя на портале поддержки.
// Возвращенный тикет может быть проверен вызовом операции check
// сервиса https://login.1c.ru или https://login.1c.eu
//
// Подробнее см. https://login.1c.ru/rest/public/swagger-ui.html.
//
// Получение тикета выполняется в соответствии с настройками
// библиотеки:
//  - доменная зона серверов (1c.ru или 1c.eu);
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Параметры:
//  ВладелецТикета - Строка - произвольное имя сервиса, для которого
//      выполняется аутентификация пользователя. Это же имя должно
//      использоваться при вызове операции https://login.1c.ru/rest/private/ticket/check;
//      Не допускается незаполненное значение параметра.
//  ТипАутентификации - Строка - типа аутентификации при получении тикета.
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//        * Тикет - Строка - полученный тикет аутентификации. Если при получении
//          тикета произошла ошибка (неверный логин или пароль или другая ошибка),
//          значение поля - пустая строка.
//        * КодОшибки - Строка - строковый код возникшей ошибки, который
//          может быть обработан вызывающим функционалом:
//              - <Пустая строка> - получение тикета выполнено успешно;
//              - "НеверныйЛогинИлиПароль" - неверный логин или пароль;
//              - "ПревышеноКоличествоПопыток" - превышено количество попыток
//                 получения тикета с некорректным логином и паролем;
//              - "ОшибкаПодключения" - ошибка при подключении к сервису;
//              - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//              - "НеизвестнаяОшибка" - при получении тикета возникла
//                 неизвестная (не обрабатываемая) ошибка;
//              - "ОперацияНеПоддерживается" - сервис не интегрирован с Порталом 1С:ИТС.
//                Ошибка может возникнуть при работе в модели сервиса.
//        * СообщениеОбОшибке - Строка - краткое описание ошибки, которое
//          может быть отображено пользователю;
//        * ИнформацияОбОшибке - Строка - подробное описание ошибки, которое
//          может быть записано в журнал регистрации.
//
Функция СлужебнаяТикетАутентификацииНаПорталеПоддержки(
		ВладелецТикета,
		ТипАутентификации)
	
	Если Не ЗначениеЗаполнено(ВладелецТикета) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено значение параметра ""ВладелецТикета""'");
	КонецЕсли;
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		МодульИнтернетПоддержкаПользователейВМоделиСервиса =
			ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователейВМоделиСервиса");
		Возврат МодульИнтернетПоддержкаПользователейВМоделиСервиса.ТикетАутентификацииНаПорталеПоддержки(
			ВладелецТикета);
	Иначе
		
		Аутентификация = Новый Структура;
		Аутентификация.Вставить("Логин", Неопределено);
		Аутентификация.Вставить("Пароль", Неопределено);
		Аутентификация.Вставить("МастерТокен", Неопределено);
		
		Результат = НовыйРезультатПолученияТикета();
		Если ТипАутентификации = ТипАутентификацииBearer() Тогда
			
			Аутентификация.МастерТокен = МастерТокен();
			Если Не ЗначениеЗаполнено(Аутентификация.МастерТокен) Тогда
				Аутентификация.МастерТокен = СлужебнаяСоздатьМастерТокен(
					ИдентификаторСценарияСозданияТокена());
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Аутентификация.МастерТокен) Тогда
				Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации();
				Результат.СообщениеОбОшибке  = НСтр("ru = 'Не подключена Интернет-поддержка пользователей.'");
				Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
				Возврат Результат;
			КонецЕсли;
			
		ИначеЕсли ТипАутентификации = ТипАутентификацииBasic() Тогда
			
			ДанныеАутентификации = СлужебнаяДанныеАутентификации();
			Если ДанныеАутентификации <> Неопределено Тогда
				Аутентификация.Логин  = ДанныеАутентификации.Логин;
				Аутентификация.Пароль = ДанныеАутентификации.Пароль;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Аутентификация.Логин) Тогда
				Результат.КодОшибки = "НеверныйЛогинИлиПароль";
				Результат.СообщениеОбОшибке  = НСтр("ru = 'Неверный логин или пароль.'");
				Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
				Возврат Результат;
			КонецЕсли;
			
		Иначе
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Неизвестный тип авторизации: %1'"),
				ТипАутентификации);
		КонецЕсли;
		
		Возврат ИнтернетПоддержкаПользователейСервис.ОперацияТикетАутентификации(
			ВладелецТикета,
			Аутентификация);
		
	КонецЕсли;
	
КонецФункции

// Определяет заголовок клиентского приложения.
//
// Возвращаемое значение:
//  Строка - заголовок клиентского приложения.
//
Функция ЗаголовокКлиентскогоПриложения() Экспорт
	
	Заголовок = СтандартныеПодсистемыСервер.ЗаголовокПриложенияПоУмолчанию();
	ИнтеграцияПодсистемБИП.ПриОпределенииЗаголовкаПриложения(
		Заголовок);
	ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииЗаголовкаПриложения(
		Заголовок);
	
	Возврат Лев(Заголовок, 1024);
	
КонецФункции

#КонецОбласти

#Область ПереходПоСсылкам

// См. ИнтернетПоддержкаПользователей.URLДляПереходаНаСтраницуИнтегрированногоСайта
//
Функция СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки", "");
	Результат.Вставить("URL", URLСтраницыСайта);
	
	Если Не ОбщегоНазначения.РазрешенДоступКИнтернетСервисам(Ложь) Тогда
		Результат.КодОшибки = "ЗапрещенДоступКИнтернетСервисам";
		Возврат Результат;
	КонецЕсли;
	
	Если Не (ОбщегоНазначения.РазделениеВключено()
		Или Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь)
		Или ИнтернетПоддержкаПользователейКлиентСервер.ОткрытьСАвторизацией(URLСтраницыСайта)) Тогда
		Результат.URL = URLСтраницыСайта;
		Возврат Результат;
	КонецЕсли;
	
	РезультатПолученияТокена = ТокенИнтегрированногоСайта(URLСтраницыСайта);
	
	Если ПустаяСтрока(РезультатПолученияТокена.КодОшибки) Тогда
		Результат.URL =
			ИнтернетПоддержкаПользователейКлиентСервер.URLСтраницыСервисаLogin(
				"/ticket/auth?token=" + РезультатПолученияТокена.Токен,
				НастройкиСоединенияССерверами());
	Иначе
		Результат.КодОшибки = РезультатПолученияТокена.КодОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает токен аутентификации на интегрированном сайте.
//
// Подробнее см. https://login.1c.ru/rest/public/swagger-ui/index.html.
//
// Получение токена выполняется в соответствии с настройками
// библиотеки:
//  - доменная зона серверов (1c.ru или 1c.eu)
//
// Параметры:
//  URLСтраницыСайта - Строка - URL для перехода после аутентификации.
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//    * Токен - Строка - полученный токен аутентификации. Если при получении
//      токена произошла ошибка (неверный логин или пароль или другая ошибка),
//      значение поля - пустая строка.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим функционалом:
//      - <Пустая строка> - создание нового заказа выполнено успешно;
//      - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//      - "ОшибкаАутентификации" - неверный логин или пароль;
//      - "ПревышеноКоличествоПопыток" - превышено количество попыток
//        обращения к сервису с некорректным логином и паролем;
//      - "ОшибкаПодключения" - ошибка при подключении к сервису;
//      - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//      - "НеизвестнаяОшибка" - при получении информации возникла
//      неизвестная (не обрабатываемая) ошибка;
//      - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - краткое описание ошибки, которое
//      может быть отображено пользователю.
//
Функция ТокенИнтегрированногоСайта(URLСтраницыСайта)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ИнтернетПоддержкаПользователей.ТокенИнтегрированногоСайта",
		"URLСтраницыСайта",
		URLСтраницыСайта,
		Тип("Строка"));
	
	Результат = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке,
		|Токен",
		"",
		"",
		"");
	
	Если Не (ОбщегоНазначения.РазделениеВключено()
		Или Пользователи.ЭтоПолноправныйПользователь(, Истина, Ложь)
		Или ИнтернетПоддержкаПользователейКлиентСервер.ОткрытьСАвторизацией(URLСтраницыСайта)) Тогда
		Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Недостаточно прав для получения токена.'");
		Возврат Результат;
	КонецЕсли;
	
	МастерТокен = Неопределено;
	Тикет = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		МастерТокен = МастерТокен();
		Если Не ЗначениеЗаполнено(МастерТокен) Тогда
			МастерТокен = СлужебнаяСоздатьМастерТокен(
				ИдентификаторСценарияСозданияТокена());
			Если Не ЗначениеЗаполнено(МастерТокен) Тогда
				Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации();
				Результат.СообщениеОбОшибке = НСтр("ru = 'Ошибка создания мастер токена для подключения к сервисам.'");
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		РезультатТикет = СлужебнаяТикетАутентификацииНаПорталеПоддержки(
			URLСтраницыСайта,
			ТипАутентификацииBasic());
		Если ЗначениеЗаполнено(РезультатТикет.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(
				Результат,
				РезультатТикет,
				"КодОшибки, СообщениеОбОшибке");
			Возврат Результат;
		КонецЕсли;
		Тикет = РезультатТикет.Тикет;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияТокенИнтегрированногоСайта(
		МастерТокен,
		Тикет,
		URLСтраницыСайта);
	ЗаполнитьЗначенияСвойств(
		Результат,
		РезультатОперации);
	
	// Для случаев, когда по мастер токену не возможно выполнить получение
	// токена аутентификации, выполняется принудительный отзыв существующего
	// мастер токена, создание нового мастер токена и попытка создания нового токена
	// аутентификации.
	Если Не ОбщегоНазначения.РазделениеВключено()
		И Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации() Тогда
		МастерТокенНовый = СлужебнаяСоздатьМастерТокен(
			ИдентификаторСценарияОбновленияТокена());
		Если ЗначениеЗаполнено(МастерТокенНовый) Тогда
			ИнтернетПоддержкаПользователейСервис.ОперацияОтозватьМастерТокен(
				МастерТокен,
				ИдентификаторСценарияОбновленияТокена());
			РезультатОперации = ИнтернетПоддержкаПользователейСервис.ОперацияТокенИнтегрированногоСайта(
				МастерТокен,
				Тикет,
				URLСтраницыСайта);
			ЗаполнитьЗначенияСвойств(
				Результат,
				РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область ПолучениеСодержимогоИзИнтернет

// Устанавливает описание ошибки в результат выполнения операции.
//
// Параметры:
//  Результат - Структура - результат выполнения операции;
//  КодОшибки - Строка - Идентификатор ошибки
//  СообщениеОбОшибке - Строка - описание ошибки для пользователя;
//  ИнформацияОбОшибке - Строка - описание ошибки для администратора;
//  Перенаправления - Массив - данные перенаправлений.
//
Процедура УстановитьОписаниеОшибки(
		Результат,
		КодОшибки,
		СообщениеОбОшибке,
		ИнформацияОбОшибке,
		Перенаправления)
	
	Результат.КодОшибки          = КодОшибки;
	Результат.СообщениеОбОшибке  = СообщениеОбОшибке;
	Сообщение = "";
	Если КодОшибки = "ConnectError" Тогда
		Сообщение = НСтр("ru = 'Ошибка при подключении к серверу.'");
	ИначеЕсли КодОшибки = "ServerError" Тогда
		Сообщение = НСтр("ru = 'На сервере возникла внутренняя ошибка при обработке запроса.'");
	ИначеЕсли КодОшибки = "ClientError" Тогда
		Сообщение = НСтр("ru = 'Некорректный запрос.'");
	ИначеЕсли КодОшибки = "InternalError" Тогда
		Сообщение = НСтр("ru = 'Внутренняя ошибка.'");
	ИначеЕсли КодОшибки = "LoginError" Тогда
		Сообщение = НСтр("ru = 'Ошибка аутентификации на сервере.'");
	ИначеЕсли КодОшибки = "LockError" Тогда
		Сообщение = "";
	КонецЕсли;
	
	Результат.СообщениеОбОшибке =
		?(ПустаяСтрока(Сообщение), "", Сообщение + " ")
		+ СообщениеОбОшибке;
	
	Результат.ИнформацияОбОшибке = ИнформацияОбОшибке;
	
	Если Перенаправления.Количество() > 0 Тогда
		Результат.ИнформацияОбОшибке = Результат.ИнформацияОбОшибке + Символы.ПС
			+ НСтр("ru = 'Перенаправления:'") + Символы.ПС
			+ СтрСоединить(Перенаправления, ", " + Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает описание перенаправления при выполнения операции.
//
// Параметры:
//  ИнформацияОбОшибке - Строка - описание ошибки для администратора;
//  Перенаправления - Массив - данные перенаправлений.
//
Процедура ДобавитьСписокПеренаправленийКИнформацииОбОшибке(
		ИнформацияОбОшибке,
		Перенаправления)
	
	Если Перенаправления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияОбОшибке = ИнформацияОбОшибке + Символы.ПС
		+ НСтр("ru = 'Перенаправления:'") + Символы.ПС
		+ СтрСоединить(Перенаправления, ", " + Символы.ПС);
	
КонецПроцедуры

// Проверяет доступность переданного URL по критерию:
//  - Код ответа 200;
//  - Таймаут ответа - 10 секунд.
//
// Параметры:
//  URL - Строка - URL для проверки;
//  Метод - Строка - http метод проверки;
//  ИмяОшибки - Строка - идентификатор ошибки;
//  СообщениеОбОшибке - Строка - описание ошибки для пользователя;
//  ИнформацияОбОшибке - Строка - описание ошибки для администратора;
//  НастройкиПроксиСервера - Структура, Неопределено - настройки прокси;
//
Процедура СлужебнаяПроверитьURLДоступен(
		URL,
		Метод,
		ИмяОшибки,
		СообщениеОбОшибке,
		ИнформацияОбОшибке,
		НастройкиПроксиСервера = Неопределено) Экспорт
	
	ДопПараметрыПолученияФайла = Новый Структура("ФорматОтвета, Таймаут", 1, 10);
	ДопПараметрыПолученияФайла.Вставить("НастройкиПрокси", НастройкиПроксиСервера);
	
	Если Метод <> Неопределено Тогда
		ДопПараметрыПолученияФайла.Вставить("Метод", Метод);
	КонецЕсли;
	
	Попытка
		РезультатЗагрузки = ЗагрузитьСодержимоеИзИнтернет(
			URL,
			,
			,
			ДопПараметрыПолученияФайла);
	Исключение
		ИмяОшибки = "Unknown";
		СообщениеОбОшибке = НСтр("ru = 'Неизвестная ошибка. Подробнее см. в журнале регистрации.'");
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неизвестная ошибка при проверке доступности URL.
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Если Не ПустаяСтрока(РезультатЗагрузки.КодОшибки) Тогда
		ИмяОшибки          = РезультатЗагрузки.КодОшибки;
		СообщениеОбОшибке  = РезультатЗагрузки.СообщениеОбОшибке;
		ИнформацияОбОшибке = РезультатЗагрузки.ИнформацияОбОшибке;
	КонецЕсли;
	
КонецПроцедуры

// Формирует ИнтернетПрокси на основании переданных настроек.
//
// Параметры:
//  НастройкаПроксиСервера - Строка, Соответствие - параметры подключения к прокси;
//  Протокол - Строка - протокол подключения к прокси.
//
// Возвращаемое значение:
//  ИнтернетПрокси - подготовленный объект прокси.
//
Функция СформироватьИнтернетПрокси(
		НастройкаПроксиСервера,
		Протокол)
	
	Если НастройкаПроксиСервера = Неопределено
		Или НастройкаПроксиСервера = "<СистемныеУстановки>" Тогда
		// Системные установки прокси-сервера.
		Возврат Неопределено;
	КонецЕсли;	
	
	ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
	Если Не ИспользоватьПрокси Тогда
		// Не использовать прокси-сервер.
		Возврат Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	
	ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
	Если ИспользоватьСистемныеНастройки Тогда
		// Системные настройки прокси-сервера.
		Возврат Новый ИнтернетПрокси(Истина);
	КонецЕсли;
			
	// Настройки прокси-сервера, заданные вручную.
	Прокси = Новый ИнтернетПрокси;
	
	// Определение адреса и порта прокси-сервера.
	ДополнительныеНастройки = НастройкаПроксиСервера.Получить("ДополнительныеНастройкиПрокси");
	ПроксиПоПротоколу = Неопределено;
	Если ТипЗнч(ДополнительныеНастройки) = Тип("Соответствие") Тогда
		ПроксиПоПротоколу = ДополнительныеНастройки.Получить(Протокол);
	КонецЕсли;
	
	ИспользоватьАутентификациюОС = НастройкаПроксиСервера.Получить("ИспользоватьАутентификациюОС");
	ИспользоватьАутентификациюОС = ?(ИспользоватьАутентификациюОС = Истина, Истина, Ложь);
	
	Если ТипЗнч(ПроксиПоПротоколу) = Тип("Структура") Тогда
		Прокси.Установить(Протокол, ПроксиПоПротоколу.Адрес, ПроксиПоПротоколу.Порт,
			НастройкаПроксиСервера["Пользователь"], НастройкаПроксиСервера["Пароль"], ИспользоватьАутентификациюОС);
	Иначе
		Прокси.Установить(Протокол, НастройкаПроксиСервера["Сервер"], НастройкаПроксиСервера["Порт"], 
			НастройкаПроксиСервера["Пользователь"], НастройкаПроксиСервера["Пароль"], ИспользоватьАутентификациюОС);
	КонецЕсли;
	
	Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкаПроксиСервера["НеИспользоватьПроксиДляЛокальныхАдресов"];
	
	АдресаИсключений = НастройкаПроксиСервера.Получить("НеИспользоватьПроксиДляАдресов");
	Если ТипЗнч(АдресаИсключений) = Тип("Массив") Тогда
		Для каждого АдресИсключения Из АдресаИсключений Цикл
			Прокси.НеИспользоватьПроксиДляАдресов.Добавить(АдресИсключения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

// Определяет идентификатор домена на основании
// режима использования внешних ресурсов.
//
// Возвращаемое значение:
//  Число - идентификатор домена.
//
Функция ДоменРасположенияСерверовИПП() Экспорт
	
	РежимИспользования = ПолучитьРежимВнешнихРесурсов();
	Если ВРег(РежимИспользования) = "D" Тогда
		Возврат 0;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

// Выполняет чтение архива gzip.
//
// Параметры:
//  РезультатЗагрузки - Структура - результат выполнения операции.
//  ДвоичныеДанные - ДвоичныеДанные - данные архива.
//
// Возвращаемое значение:
//  ДвоичныеДанные - результат чтения.
//
Функция ЧтениеСодержимогоGZip(РезультатЗагрузки, ДвоичныеДанные)
	
	Каталог = ФайловаяСистема.СоздатьВременныйКаталог("gzip");
	
	Попытка
		
		ДанныеВПотоке = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		ЧтениеФайлаАрхива = Новый ЧтениеФайлаАрхива(ДанныеВПотоке, ,ТипФайлаАрхива.GZIP);
		ИмяФайла = ЧтениеФайлаАрхива.Элементы[0].Имя;
		ЧтениеФайлаАрхива.Извлечь(
			ЧтениеФайлаАрхива.Элементы[0],
			Каталог,
			РежимВосстановленияПутейФайлаАрхива.НеВосстанавливать);
		ЧтениеФайлаАрхива.Закрыть();
		ДанныеВПотоке.Закрыть();
		Результат = Новый ДвоичныеДанные(
				Каталог + ПолучитьРазделительПути() + ИмяФайла);
		
	Исключение
		
		ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(
			ИнформацияОбОшибке());
		ПодробноеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать данные gzip. %1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		УстановитьОписаниеОшибки(
			РезультатЗагрузки,
			"ConnectError",
			ПредставлениеОшибки,
			ПодробноеОписаниеОшибки,
			Новый Массив);
		Результат = ДвоичныеДанные;
		
	КонецПопытки;
	
	ФайловаяСистема.УдалитьВременныйКаталог(Каталог);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение заголовка вне зависимости от регистра.
// При наличии заголовков, отличающихся регистром, будет возвращен первый подходящий.
//
// Параметры:
//  Заголовки - Соответствие - HTTP-заголовки HTTP-ответа или HTTP-запроса в виде соответствия.
//  ИмяЗаголовка - Строка - имя заголовка, значение которого нужно получить.
// 
// Возвращаемое значение:
//  Строка, Неопределено - значение заголовка, если заголовок не найден - возвращается Неопределено.
//
Функция ЗначениеЗаголовка(Заголовки, ИмяЗаголовка)
	
	Ключ = НРег(ИмяЗаголовка);
	
	Для Каждого Заголовок Из Заголовки Цикл
		Если НРег(Заголовок.Ключ) = Ключ Тогда
			Возврат Заголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область Локализация

// Возвращается код текущего языка интерфейса конфигурации
// в формате ISO-639-1.
//
// Возвращаемое значение:
//  Строка - код языка интерфейса конфигурации.
//
Функция КодЯзыкаИнтерфейсаКонфигурации()

	Язык = ТекущийЯзык();
	Если Язык = Неопределено Тогда
		// Для пользователя информационной базы не указан язык.
		Возврат КодОсновногоЯзыкаИнтерфейсаКонфигурации();
	КонецЕсли;

	КодЯзыкаВМетаданных = ?(ТипЗнч(Язык) = Тип("Строка"), Язык, Язык.КодЯзыка);
	КодЯзыкаВФорматеISO639_1 = Неопределено;
	
	ИнтеграцияПодсистемБИП.ПриОпределенииКодаЯзыкаИнтерфейсаКонфигурации(
		КодЯзыкаВМетаданных,
		КодЯзыкаВФорматеISO639_1);
	ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииКодаЯзыкаИнтерфейсаКонфигурации(
		КодЯзыкаВМетаданных,
		КодЯзыкаВФорматеISO639_1);

	Возврат ?(КодЯзыкаВФорматеISO639_1 = Неопределено, КодЯзыкаВМетаданных, КодЯзыкаВФорматеISO639_1);

КонецФункции

// Возвращается код основного языка интерфейса конфигурации
// в формате ISO-639-1.
//
// Возвращаемое значение:
//  Строка - код языка интерфейса конфигурации.
//
Функция КодОсновногоЯзыкаИнтерфейсаКонфигурации()

	КодЯзыкаВМетаданных = ОбщегоНазначения.КодОсновногоЯзыка();
	КодЯзыкаВФорматеISO639_1 = Неопределено;
	
	ИнтеграцияПодсистемБИП.ПриОпределенииКодаЯзыкаИнтерфейсаКонфигурации(
		КодЯзыкаВМетаданных,
		КодЯзыкаВФорматеISO639_1);
	ИнтернетПоддержкаПользователейПереопределяемый.ПриОпределенииКодаЯзыкаИнтерфейсаКонфигурации(
		КодЯзыкаВМетаданных,
		КодЯзыкаВФорматеISO639_1);

	Возврат ?(КодЯзыкаВФорматеISO639_1 = Неопределено, КодЯзыкаВМетаданных, КодЯзыкаВФорматеISO639_1);

КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "2.1.7.1";
	Обработчик.Процедура =
		"ИнтернетПоддержкаПользователей.ОбновлениеИнформационнойБазы_ПереместитьПараметрыИнтернетПоддержкиВБезопасноеХранилищеДанных_2_1_7_1";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.8.14";
	Обработчик.Процедура =
		"ИнтернетПоддержкаПользователей.ОбновлениеИнформационнойБазы_ЗаменитьИдентификаторПодсистемыВБезопасномХранилищеДанных_2_1_8_14";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия    = "2.9.1.45";
	Обработчик.Процедура = "ИнтернетПоддержкаПользователей.ПолучитьМастерТокен";
	Обработчик.ОбщиеДанные = Ложь;
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Получение токена для работы сервисов Интернет-поддержки пользователей.'");
	Обработчик.РежимВыполнения = "Оперативно";
	
КонецПроцедуры

// Выполняет перенос данных из регистра сведений УдалитьПараметрыИнтернетПоддержкиПользователей
// в безопасное хранилище.
//
Процедура ОбновлениеИнформационнойБазы_ПереместитьПараметрыИнтернетПоддержкиВБезопасноеХранилищеДанных_2_1_7_1() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		// Не используется при работе в модели сервиса
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьПараметрыИнтернетПоддержкиПользователей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ЗапросПараметровИПП = Новый Запрос;
		ЗапросПараметровИПП.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя КАК ИмяПараметра,
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Значение КАК ЗначениеПараметра
		|ИЗ
		|	РегистрСведений.УдалитьПараметрыИнтернетПоддержкиПользователей КАК УдалитьПараметрыИнтернетПоддержкиПользователей
		|ГДЕ
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя = ""login""
		|	И УдалитьПараметрыИнтернетПоддержкиПользователей.Пользователь = &ПустойИдентификатор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя,
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.УдалитьПараметрыИнтернетПоддержкиПользователей КАК УдалитьПараметрыИнтернетПоддержкиПользователей
		|ГДЕ
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя = ""password""
		|	И УдалитьПараметрыИнтернетПоддержкиПользователей.Пользователь = &ПустойИдентификатор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя,
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Значение
		|ИЗ
		|	РегистрСведений.УдалитьПараметрыИнтернетПоддержкиПользователей КАК УдалитьПараметрыИнтернетПоддержкиПользователей
		|ГДЕ
		|	УдалитьПараметрыИнтернетПоддержкиПользователей.Имя = ""regnumber""
		|	И УдалитьПараметрыИнтернетПоддержкиПользователей.Пользователь = &ПустойИдентификатор";
		
		ЗапросПараметровИПП.УстановитьПараметр(
			"ПустойИдентификатор",
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		
		УстановитьПривилегированныйРежим(Истина);
		ВыборкаПараметров = ЗапросПараметровИПП.Выполнить().Выбрать();
		
		// Запись данных в безопасное хранилище
		ИдентификаторПодсистемыБИП = ИдентификаторПодсистемы();
		Пока ВыборкаПараметров.Следующий() Цикл
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИдентификаторПодсистемыБИП,
				ВыборкаПараметров.ЗначениеПараметра,
				ВыборкаПараметров.ИмяПараметра);
		КонецЦикла;
		
		// Очистка неиспользуемого регистра параметров ИПП
		НаборЗаписей = РегистрыСведений.УдалитьПараметрыИнтернетПоддержкиПользователей.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьИнформациюВЖурналРегистрации(ИнформацияОбОшибке);
		
		ВызватьИсключение ИнформацияОбОшибке;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет замену идентификатора подсистемы в безопасном хранилище.
//
Процедура ОбновлениеИнформационнойБазы_ЗаменитьИдентификаторПодсистемыВБезопасномХранилищеДанных_2_1_8_14() Экспорт

	Если ОбщегоНазначения.РазделениеВключено() Тогда
		// Не используется при работе в модели сервиса.
		Возврат;
	КонецЕсли;
	
	ИдентификаторПодсистемыБИПУстаревший =
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			"Подсистема.ИнтернетПоддержкаПользователей.Подсистема.БазоваяФункциональностьБИП");
	ДанныеВБезопасномХранилищеУстаревшие =
		ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ИдентификаторПодсистемыБИПУстаревший,
			"login,password,regnumber");
	
	ИдентификаторПодсистемы = ИдентификаторПодсистемы();
	Для Каждого КлючЗначение Из ДанныеВБезопасномХранилищеУстаревшие Цикл
		Если КлючЗначение.Значение <> Неопределено Тогда
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
				ИдентификаторПодсистемы,
				КлючЗначение.Значение,
				КлючЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	// Удалить устаревшие данные после переноса.
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(ИдентификаторПодсистемыБИПУстаревший);
	
КонецПроцедуры

// Получает и сохраняет мастер токен при переходе на новую версию.
//
// Параметры:
//  Параметры - Структура - параметры обновления.
//
Процедура ПолучитьМастерТокен(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СлужебнаяСоздатьМастерТокен(
		ИдентификаторСценарияСозданияТокена());
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область БлокировкаРаботыССервисамиИнтернетПоддержки

// Вызывается при установке блокировки работы с внешними ресурсами.
// Позволяет отключить произвольные механизмы, работа
// которых в копии информационной базы недопустима.
//
Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ПараметрыБлокировки = НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки();
		ПараметрыБлокировки.РаботаССервисамиИнтернетПоддержкиЗаблокирована = Истина;
		СохранитьПараметрыБлокировки(ПараметрыБлокировки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Вызывается при снятии блокировки работы с внешними ресурсами.
// Для включения работы механизмов, отключенных в процедуре ПриЗапретеРаботыСВнешнимиРесурсами.
//
Процедура ПриРазрешенииРаботыСВнешнимиРесурсами() Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьДанныеПараметровБлокировки();
		
		ПараметрыБлокировки = НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки();
		СохранитьПараметрыБлокировки(ПараметрыБлокировки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Разблокирует работу с сервисами Интернет-поддержки, которые были разрешены при работе в копии.
//
// Параметры:
//  Сервисы - Массив из Структура - Список ресурсов, которые должны быть разрешены.
//
Процедура РазблокироватьРаботуССервисамиИнтернетПоддержки(Сервисы) Экспорт
	
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьДанныеПараметровБлокировки();
		
		ПараметрыБлокировки = ПараметрыБлокировкиССервисамиИнтернетПоддержки();
		
		Для Каждого Сервис Из Сервисы Цикл
			
			СервисИнтернетПоддержки = ПараметрыБлокировки.СервисыИнтернетПоддержки.Получить(Сервис.Название);
			Если СервисИнтернетПоддержки <> Неопределено Тогда
				СервисИнтернетПоддержки.РазрешенаРабота = Сервис.РазрешенаРабота;
			КонецЕсли;
		КонецЦикла;
		
		СохранитьПараметрыБлокировки(ПараметрыБлокировки);
		ОбновитьПовторноИспользуемыеЗначения();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает сохраненные параметры блокировки с сервисами Интернет-Поддержки.
// Если нет сохраненных, тогда инициализирует параметры по умолчанию.
// 
// Возвращаемое значение:
//  Структура - см. НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки.
//
Функция ПараметрыБлокировкиССервисамиИнтернетПоддержки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Сохраненные = Константы.ПараметрыБлокировкиРаботыССервисамиИнтернетПоддержки.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки();
	
	Если Сохраненные = Неопределено Тогда
		СохранитьПараметрыБлокировки(Результат);
	КонецЕсли;
	
	Если ТипЗнч(Сохраненные) = Тип("Структура") Тогда
		ВосстановитьПараметрыБлокировки(Результат, Сохраненные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Инициирует параметры блокировки работы с сервисами интернет-поддержки.
// 
// Возвращаемое значение:
//  Структура - параметры блокировки по умолчанию:
//    * РаботаССервисамиИнтернетПоддержкиЗаблокирована - Булево - признак блокировки ресурсов;
//    * ХостыСервисовИнтернетПоддержки - ФиксированноеСоответствие - см. ХостыСервисовИнтернетПоддержки;
//    * СервисыИнтернетПоддержки - Соответствие - см. СервисыИнтернетПоддержки;
//
Функция НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки()
	
	ХостыСервисовИнтернетПоддержки = ХостыСервисовИнтернетПоддержки();
	СервисыИнтернетПоддержки = СервисыИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	
	Результат = Новый Структура;
	Результат.Вставить("РаботаССервисамиИнтернетПоддержкиЗаблокирована", Ложь);
	Результат.Вставить("ХостыСервисовИнтернетПоддержки", ХостыСервисовИнтернетПоддержки);
	Результат.Вставить("СервисыИнтернетПоддержки", СервисыИнтернетПоддержки);
	
	Возврат Результат;
	
КонецФункции

// Инициирует описание используемых ресурсов в библиотеке Интернет-поддержи.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие - описание используемых ресурсов.
//
Функция ХостыСервисовИнтернетПоддержки()
	
	ХостыСервисовИнтернетПоддержки = Новый Соответствие;
	
	Если Не ОбщегоНазначения.РазделениеВключено() Тогда
		
		ХостыСервисовИнтернетПоддержки.Вставить(
			ИнтернетПоддержкаПользователейКлиентСервер.ХостСервисаLogin(0),
			НСтр("ru = 'Сервисы аутентификации'"));
		ХостыСервисовИнтернетПоддержки.Вставить(
			ИнтернетПоддержкаПользователейКлиентСервер.ХостСервисаLogin(1),
			НСтр("ru = 'Сервисы аутентификации'"));
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
			МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
			МодульПолучениеОбновленийПрограммы.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.МониторПортала1СИТС") Тогда
			МодульМониторПортала1СИТС = ОбщегоНазначения.ОбщийМодуль("МониторПортала1СИТС");
			МодульМониторПортала1СИТС.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки") Тогда
			МодульСообщенияВСлужбуТехническойПоддержки = ОбщегоНазначения.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержки");
			МодульСообщенияВСлужбуТехническойПоддержки.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПодключениеСервисовСопровождения") Тогда
		МодульПодключениеСервисовСопровождения = ОбщегоНазначения.ОбщийМодуль("ПодключениеСервисовСопровождения");
		МодульПодключениеСервисовСопровождения.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКонтрагентами") Тогда
		МодульРаботаСКонтрагентами = ОбщегоНазначения.ОбщийМодуль("РаботаСКонтрагентами");
		МодульРаботаСКонтрагентами.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СПАРКРиски") Тогда
		МодульСПАРКРискиСервис = ОбщегоНазначения.ОбщийМодуль("СПАРКРискиСервис");
		МодульСПАРКРискиСервис.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.Новости") Тогда
		МодульОбработкаНовостейСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбработкаНовостейСлужебный");
		МодульОбработкаНовостейСлужебный.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.РаботаСКлассификаторами") Тогда
		МодульРаботаСКлассификаторами = ОбщегоНазначения.ОбщийМодуль("РаботаСКлассификаторами");
		МодульРаботаСКлассификаторами.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент") Тогда
		МодульПолучениеВнешнихКомпонент = ОбщегоНазначения.ОбщийМодуль("ПолучениеВнешнихКомпонент");
		МодульПолучениеВнешнихКомпонент.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнЗаказы") Тогда
		МодульОнлайнЗаказыСлужебный = ОбщегоНазначения.ОбщийМодуль("ОнлайнЗаказыСлужебный");
		МодульОнлайнЗаказыСлужебный.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОнлайнОплаты") Тогда
		МодульОнлайнОплатыСлужебный = ОбщегоНазначения.ОбщийМодуль("ОнлайнОплатыСлужебный");
		МодульОнлайнОплатыСлужебный.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОФД") Тогда
		МодульОФДСлужебный = ОбщегоНазначения.ОбщийМодуль("ОФДСлужебный");
		МодульОФДСлужебный.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтеграцияСЦРПТ") Тогда
		МодульИнтеграцияСЦРПТ = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияСЦРПТ");
		МодульИнтеграцияСЦРПТ.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеРегламентированныхОтчетов") Тогда
		МодульПолучениеРегламентированныхОтчетов = ОбщегоНазначения.ОбщийМодуль("ПолучениеРегламентированныхОтчетов");
		МодульПолучениеРегламентированныхОтчетов.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныйАрхив20") Тогда
		МодульОблачныйАрхив20 = ОбщегоНазначения.ОбщийМодуль("ОблачныйАрхив20");
		МодульОблачныйАрхив20.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы") Тогда
		МодульОблачныеКассыСервис = ОбщегоНазначения.ОбщийМодуль("ОблачныеКассыСервис");
		МодульОблачныеКассыСервис.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПоставляемыеНастройки") Тогда
		МодульПоставляемыеНастройкиСервер = ОбщегоНазначения.ОбщийМодуль("ПоставляемыеНастройкиСервер");
		МодульПоставляемыеНастройкиСервер.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		МодульНастройкиПлатежныхСистемСлужебный = ОбщегоНазначения.ОбщийМодуль("НастройкиПлатежныхСистемСлужебный");
		МодульНастройкиПлатежныхСистемСлужебный.ПриЗаполненииХостовСервисовИнтернетПоддержки(ХостыСервисовИнтернетПоддержки);
	КонецЕсли;
	
	Результат = Новый ФиксированноеСоответствие(ХостыСервисовИнтернетПоддержки);
	
	Возврат Результат;
	
КонецФункции

// Инициирует описание используемых сервисов в библиотеке Интернет-поддержи.
//
// Параметры:
//  ХостыСервисовИнтернетПоддержки - ФиксированноеСоответствие - см. ХостыСервисовИнтернетПоддержки.
// 
// Возвращаемое значение:
//  Соответствие - описание используемых сервисов.
//
Функция СервисыИнтернетПоддержки(ХостыСервисовИнтернетПоддержки)
	
	Результат = Новый Соответствие;
	Для Каждого ХостСервиса Из ХостыСервисовИнтернетПоддержки Цикл
		Результат.Вставить(
			ХостСервиса.Значение,
			Новый Структура(
				"НазваниеСервиса, РазрешенаРабота",
				ХостСервиса.Значение,
				Ложь));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сохраняет переданные параметры блокировки сервисов Интернет-поддержки.
//
// Параметры:
//  ПараметрыБлокировки - Структура - см. НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки.
//
Процедура СохранитьПараметрыБлокировки(ПараметрыБлокировки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ХранилищеЗначения = Новый ХранилищеЗначения(ПараметрыБлокировки);
	Константы.ПараметрыБлокировкиРаботыССервисамиИнтернетПоддержки.Установить(ХранилищеЗначения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Блокировка хранимых параметров работы с сервисами Интернет-поддержки.
//
Процедура ЗаблокироватьДанныеПараметровБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("Константа.ПараметрыБлокировкиРаботыССервисамиИнтернетПоддержки");
	Блокировка.Заблокировать();
	
КонецПроцедуры

// Загружает сохраненные значения настроек доступности сервисов Интернет-поддержки.
// 
// Параметры:
//  Текущие - см. НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки.
//  Сохраненные - см. НовыеПараметрыБлокировкиССервисамиИнтернетПоддержки.
Процедура ВосстановитьПараметрыБлокировки(Текущие, Сохраненные)
	
	Эталон = Новый Структура;
	Эталон.Вставить("РаботаССервисамиИнтернетПоддержкиЗаблокирована", Ложь);
	Эталон.Вставить("СервисыИнтернетПоддержки",       Неопределено);
	
	ЗаполнитьЗначенияСвойств(Эталон, Сохраненные);
	
	ЗаполнитьЗначенияСвойств(
		Текущие,
		Эталон,
		"РаботаССервисамиИнтернетПоддержкиЗаблокирована");
		
	Если Эталон.СервисыИнтернетПоддержки <> Неопределено Тогда
		Для Каждого КлючЗначение Из Эталон.СервисыИнтернетПоддержки Цикл
			Если Текущие.СервисыИнтернетПоддержки.Получить(КлючЗначение.Ключ) <> Неопределено Тогда
				Текущие.СервисыИнтернетПоддержки.Вставить(
					КлючЗначение.Ключ,
					КлючЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КодированиеСтроки

// Преобразует переданную строку в кодировку URL.
//
// Параметры:
//  СтрокаДляКодирования - Строка - строка для кодирования.
// 
// Возвращаемое значение:
//  Строка - перекодированная строка.
//
Функция СтрокаВURLКодировке(СтрокаДляКодирования) Экспорт
	
	Возврат КодироватьСтроку(
		СтрокаДляКодирования,
		СпособКодированияСтроки.КодировкаURL);
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыФункции

// Возвращается имя события журнала регистрации для записи ошибок
// Интернет-поддержки пользователей.
//
// Возвращаемое значение:
//	Строка - имя события ошибки Интернет-поддержки.
//
Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Интернет-поддержка пользователей'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Возвращает минимальную версию БСП,
// с которой возможна работа БИП.
//
// Возвращаемое значение:
//   Строка - номер версии БСП
//
Функция МинимальнаяВерсияБСП() Экспорт
	
	Возврат "3.2.1.395";
	
КонецФункции

// Возвращает тип идентификатора базовой схемы авторизации.
//
// Возвращаемое значение:
//   Строка - идентификатор типа.
//
Функция ТипАутентификацииBasic() Экспорт
	
	Возврат "Basic";
	
КонецФункции

// Возвращает тип идентификатора схемы авторизации по токену.
//
// Возвращаемое значение:
//   Строка - идентификатор типа.
//
Функция ТипАутентификацииBearer() Экспорт
	
	Возврат "Bearer";
	
КонецФункции

// Возвращает идентификатор ключа мастер токена.
//
// Возвращаемое значение:
//   Строка - идентификатор ключа.
//
Функция ИдентификаторКлючаМастерТокен()
	
	Возврат "masterToken";
	
КонецФункции

// Возвращает идентификатор ключа идентификатор клиента.
//
// Возвращаемое значение:
//   Строка - идентификатор ключа.
//
Функция ИдентификаторИдентификаторКлиента()
	
	Возврат "clientId";
	
КонецФункции

// Возвращает идентификатор ключа логин.
//
// Возвращаемое значение:
//   Строка - идентификатор ключа.
//
Функция ИдентификаторЛогин()
	
	Возврат "login";
	
КонецФункции

// Возвращает идентификатор ключа пароля.
//
// Возвращаемое значение:
//   Строка - идентификатор ключа.
//
Функция ИдентификаторПароль()
	
	Возврат "password";
	
КонецФункции

// Возвращает сценария обновления токена.
//
// Возвращаемое значение:
//   Строка - идентификатор сценария.
//
Функция ИдентификаторСценарияОбновленияТокена()
	
	Возврат "TOKEN_UPDATE";
	
КонецФункции

// Возвращает сценария создания токена.
//
// Возвращаемое значение:
//   Строка - идентификатор сценария.
//
Функция ИдентификаторСценарияСозданияТокена()
	
	Возврат "TOKEN_GENERATED";
	
КонецФункции

#КонецОбласти

#КонецОбласти
