
#Область ПрограммныйИнтерфейс

// Возвращает номер версии библиотеки.
//
// Возвращаемое значение:
//  Строка - номер версии библиотеки.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат "1.0.4.4";
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает имя элемента, который отображает информацию о документе БИА в форме прикладного объекта.
// 
// Возвращаемое значение:
//  Строка - имя элемента формы
// 
Функция ИмяЭлементаДокументБИА() Экспорт
	
	Возврат "ИнформацияДокументаБИА";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыОтправитьВ1САрхив() Экспорт
	
	Возврат "ОтправитьВ1САрхив";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыОтменитьОтправкуВ1САрхив() Экспорт
	
	Возврат "ОтменитьОтправкуВ1САрхив";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыОтозватьИз1САрхива() Экспорт
	
	Возврат "ОтозватьИз1САрхива";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыИсторияОбмена() Экспорт
	
	Возврат "ИсторияОбменаС1САрхивом";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыПоказатьВсеДокументыБИА() Экспорт
	
	Возврат "ПоказатьВсеДокументыБИА";
	
КонецФункции

// Возвращаемое значение:
//  Строка - имя команды
// 
Функция ИмяКомандыЗакрытьИнформационныйБаннер() Экспорт
	
	Возврат "ЗакрытьИнформационныйБаннер";
	
КонецФункции


#КонецОбласти
