#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИдентификаторДокумента = Параметры.ИдентификаторДокумента; 
	ИдентификаторТекущегоЭтапа = Параметры.ИдентификаторЭтапа;
	ТекущийШаблон = Параметры.ТекущийШаблон;
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя(); 
	СинонимДокумента = МетаданныеДокумента.Синоним;
	
	Если МетаданныеДокумента.ОсновнаяФормаОбъекта = Неопределено Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось получить основную форму для документа ""%1""'"),	СинонимДокумента);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяОсновнойФормыДокумента = МетаданныеДокумента.ОсновнаяФормаОбъекта.Имя;
	
	СписокНедоступныхЭлементов.ЗагрузитьЗначения(Параметры.НедоступныеЭлементы); 
	СписокНевидимыхЭлементов.ЗагрузитьЗначения(Параметры.НевидимыеЭлементы);
	СписокЭлементовСОтметкойНезаполненного.ЗагрузитьЗначения(Параметры.ЭлементыСОтметкойНезаполненного);
	СписокСтартоваяСтраница.ЗагрузитьЗначения(Параметры.СтартоваяСтраница);
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Настройка свойств элементов формы для документа ""%1"" на этапе ""%2""'"), 
	СинонимДокумента, Параметры.ТекущийЭтапСтрокой);
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЗначениеЗаполнено(ИмяОсновнойФормыДокумента) Тогда
		Попытка
			ФормаДокумента = ПолучитьФорму(ПолноеИмяДокумента + ".Форма." + ИмяОсновнойФормыДокумента);
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить основную форму для документа ""%1""'"),	СинонимДокумента);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		ЗаполнитьДеревоВсемиДоступнымиЭлементамиФормыДокумента(ФормаДокумента, ДеревоЭлементовФормы.ПолучитьЭлементы());
		
		Элементы.ДеревоЭлементовФормыСтраницаПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(
			СписокПодчиненныхСтраниц.ВыгрузитьЗначения());
		
		ЗаполнитьЗначенияНастроекСвойствЭлементовФормы();
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось получить основную форму для документа ""%1""'"),	СинонимДокумента);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КопированиеНастроекСвойствЭлементов" Тогда
		
		ЗаполнитьНастройкиИзВыбранногоЭтапа(Параметр);
		
		ПоказатьОповещениеПользователя(НСтр("ru='Заполнение настроек свойств элементов завершено'"));
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовФормыСтраницаПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ДеревоЭлементовФормы.ТекущиеДанные;
	Если Не ТекущаяСтрока.ГоловнаяСтраница Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СписокНедоступныхЭлементов.Очистить();
	СписокНевидимыхЭлементов.Очистить();
	СписокЭлементовСОтметкойНезаполненного.Очистить();
	СписокСтартоваяСтраница.Очистить();
	
	СохранитьТекущиеНастройкиСвойствЭлементов(ДеревоЭлементовФормы.ПолучитьЭлементы());
	
	НастройкиЭлементовФормы = Новый Структура();
	НастройкиЭлементовФормы.Вставить("НедоступныеЭлементы", СписокНедоступныхЭлементов.ВыгрузитьЗначения());
	НастройкиЭлементовФормы.Вставить("НевидимыеЭлементы", СписокНевидимыхЭлементов.ВыгрузитьЗначения());
	НастройкиЭлементовФормы.Вставить("ЭлементыСОтметкойНезаполненного", СписокЭлементовСОтметкойНезаполненного.ВыгрузитьЗначения());
	НастройкиЭлементовФормы.Вставить("СтартоваяСтраница", СписокСтартоваяСтраница.ВыгрузитьЗначения());
	
	ОповеститьОВыборе(НастройкиЭлементовФормы);
	
КонецПроцедуры  

&НаКлиенте
Процедура СвернутьДерево(Команда)
    
    СвернутьУзлыДерева(ДеревоЭлементовФормы.ПолучитьЭлементы());    
    
КонецПроцедуры

 &НаКлиенте
Процедура РазвернутьДерево(Команда)
		
	РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоЭлементовФормы",, Истина);
	
КонецПроцедуры

 &НаКлиенте
Процедура ОчиститьНастройки(Команда)
	
	СписокНедоступныхЭлементов.Очистить(); 
	СписокНевидимыхЭлементов.Очистить();
	СписокЭлементовСОтметкойНезаполненного.Очистить();
	СписокСтартоваяСтраница.Очистить();
	
	РежимЗаполнения = "Заменять";
	ЗаполнитьЗначенияНастроекСвойствЭлементовФормы(РежимЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиСОбъединением(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторДокумента", ИдентификаторДокумента); 
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", ИдентификаторТекущегоЭтапа);
	ПараметрыФормы.Вставить("ТекущийШаблон", ТекущийШаблон);
	ПараметрыФормы.Вставить("СинонимДокумента", СинонимДокумента);
	ПараметрыФормы.Вставить("РежимЗаполнения", "Объединить"); 
	ПараметрыФормы.Вставить("ВидНастроек", "НастройкаСвойствЭлементовПоЭтапам");  
	
	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.КопированиеНастроекШаблона", ПараметрыФормы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНастройкиСЗаменой(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", ИдентификаторТекущегоЭтапа); 
	ПараметрыФормы.Вставить("ТекущийШаблон", ТекущийШаблон);
	ПараметрыФормы.Вставить("СинонимДокумента", СинонимДокумента);
	ПараметрыФормы.Вставить("РежимЗаполнения", "Заменить");
	ПараметрыФормы.Вставить("ВидНастроек", "НастройкаСвойствЭлементовПоЭтапам");

	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.КопированиеНастроекШаблона", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДеревоВсемиДоступнымиЭлементамиФормыДокумента(ЭлементФормы, СтрокаДерева)
	
	СуществуетВидЭлемента = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементФормы, "Вид");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементФормы, "ПодчиненныеЭлементы")
		И ЭлементФормы.ПодчиненныеЭлементы.Количество() > 0 Тогда
		
		Если ТипЗнч(ЭлементФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
			НоваяСтрока = СтрокаДерева.Добавить();
			НоваяСтрока.ИмяЭлемента = ЭлементФормы.ИмяФормы; 
			НоваяСтрока.Синоним = ЭлементФормы.ИмяФОрмы;
			НоваяСтрока.ВидЭлемента = "ФормаДокумента";
			НоваяСтрока.ЭтоГруппа = Истина;
			
			Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
				ЗаполнитьДеревоВсемиДоступнымиЭлементамиФормыДокумента(Элемент, НоваяСтрока);
			КонецЦикла;
			
			// обойти элементы командной панели
			ЗаполнитьДеревоВсемиДоступнымиЭлементамиФормыДокумента(ЭлементФормы.КоманднаяПанель, НоваяСтрока);
			
		Иначе	 
			НоваяГруппаДерево = СтрокаДерева.ПолучитьЭлементы();
			НоваяСтрока = НоваяГруппаДерево.Добавить();
			НоваяСтрока.ИмяЭлемента = ЭлементФормы.Имя;
			
			Если Не ЗначениеЗаполнено(ЭлементФормы.Заголовок) Тогда
				НоваяСтрока.Синоним = ЭлементФормы.Имя;  
			Иначе
				НоваяСтрока.Синоним = ЭлементФормы.Имя +" [" + ЭлементФормы.Заголовок + "]";
			КонецЕсли;
			
			НоваяСтрока.ВидЭлемента = ?(СуществуетВидЭлемента, ЭлементФормы.Вид, Строка(ТипЗнч(ЭлементФормы)));
			НоваяСтрока.ЭтоГруппа = Истина;
			
			//Заполнить все возможные подчиненные страницы
			Если СуществуетВидЭлемента И (ЭлементФормы.Вид = ВидГруппыФормы.Страница) Тогда
				НоваяСтрока.ПодчиненнаяСтраница = Истина;
				СписокПодчиненныхСтраниц.Добавить(ЭлементФормы.Имя);
			КонецЕсли;
			
			//Заполнить все возможные заглавные страницы
			Если СуществуетВидЭлемента И (ЭлементФормы.Вид = ВидГруппыФормы.Страницы) Тогда
				НоваяСтрока.ГоловнаяСтраница = Истина;
			КонецЕсли;	
			
			Для Каждого Элемент Из ЭлементФормы.ПодчиненныеЭлементы Цикл
				ЗаполнитьДеревоВсемиДоступнымиЭлементамиФормыДокумента(Элемент, НоваяСтрока);
			КонецЦикла;
		КонецЕсли;	
		
	Иначе
		НоваяГруппаДерево = СтрокаДерева.ПолучитьЭлементы();
		НоваяСтрока = НоваяГруппаДерево.Добавить();
		НоваяСтрока.ИмяЭлемента = ЭлементФормы.Имя;
		Если Не ЗначениеЗаполнено(ЭлементФормы.Заголовок) Тогда
				НоваяСтрока.Синоним = ЭлементФормы.Имя;  
			Иначе
				НоваяСтрока.Синоним = ЭлементФормы.Имя +" [" + ЭлементФормы.Заголовок + "]";
		КонецЕсли;
			
		НоваяСтрока.ВидЭлемента = ?(СуществуетВидЭлемента, ЭлементФормы.Вид, Строка(ТипЗнч(ЭлементФормы)));
		НоваяСтрока.ЭтоГруппа = Ложь;
		
	КонецЕсли;		

КонецПроцедуры	

&НаКлиенте
Процедура СохранитьТекущиеНастройкиСвойствЭлементов(СтрокиДерева)      	
	
	Для каждого Элемент Из СтрокиДерева Цикл
		
		Если Элемент.ЗапретДоступности Тогда
			СписокНедоступныхЭлементов.Добавить(Элемент.ИмяЭлемента);
		КонецЕсли;
		
		Если Элемент.ЗапретВидимости Тогда
			СписокНевидимыхЭлементов.Добавить(Элемент.ИмяЭлемента);
		КонецЕсли;
		
		Если Элемент.ОтметкаНезаполненного Тогда
			СписокЭлементовСОтметкойНезаполненного.Добавить(Элемент.ИмяЭлемента);
		КонецЕсли;
		
		Если Элемент.ГоловнаяСтраница
			И ЗначениеЗаполнено(Элемент.СтартоваяСтраница) Тогда
			СписокСтартоваяСтраница.Добавить(Элемент.ИмяЭлемента);
            СписокСтартоваяСтраница.Добавить(Элемент.СтартоваяСтраница);
		КонецЕсли;	
		
		ВложенныеСтроки = Элемент.ПолучитьЭлементы();  
		Если ВложенныеСтроки.Количество() > 0 Тогда                   	
			СохранитьТекущиеНастройкиСвойствЭлементов(ВложенныеСтроки);           	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДерева(Форма, ИмяЭлементаФормы, ИдентификаторСтрокиДерева = "*", РазвернутьСПодчиненными = Ложь) Экспорт
	
	ТаблицаЭлемент = Форма.Элементы[ИмяЭлементаФормы];
	Если ИдентификаторСтрокиДерева = "*" Тогда
		Узлы = Форма[ИмяЭлементаФормы].ПолучитьЭлементы();
		Для Каждого Узел Из Узлы Цикл
			ТаблицаЭлемент.Развернуть(Узел.ПолучитьИдентификатор(), РазвернутьСПодчиненными);
		КонецЦикла;
	Иначе
		ТаблицаЭлемент.Развернуть(ИдентификаторСтрокиДерева, РазвернутьСПодчиненными);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьУзлыДерева(КоллекцияЭлементов) 
    
    Для каждого ЭлементКоллекции Из КоллекцияЭлементов Цикл
        ВложенныеЭлементыКоллекции = ЭлементКоллекции.ПолучитьЭлементы();
        Если (ВложенныеЭлементыКоллекции.Количество() > 0) Тогда
            СвернутьУзлыДерева(ВложенныеЭлементыКоллекции);
        Иначе
            Прервать;
        КонецЕсли;
        
        Элементы.ДеревоЭлементовФормы.Свернуть(ЭлементКоллекции.ПолучитьИдентификатор());
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиИзВыбранногоЭтапа(Параметры)
	
	СписокНедоступныхЭлементов.ЗагрузитьЗначения(Параметры.НедоступныеЭлементы); 
	СписокНевидимыхЭлементов.ЗагрузитьЗначения(Параметры.НевидимыеЭлементы);
	СписокЭлементовСОтметкойНезаполненного.ЗагрузитьЗначения(Параметры.ЭлементыСОтметкойНезаполненного);
	СписокСтартоваяСтраница.ЗагрузитьЗначения(Параметры.СтартоваяСтраница);
	
	ЗаполнитьЗначенияНастроекСвойствЭлементовФормы(Параметры.РежимЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияНастроекСвойствЭлементовФормы(Знач РежимЗаполнения = "Заменять")
      
   ДеревоЭлементов = РеквизитФормыВЗначение("ДеревоЭлементовФормы");
 
   ОбойтиУровеньДереваСвойствЭлементов(ДеревоЭлементов.Строки, РежимЗаполнения);
 
   ЗначениеВРеквизитФормы(ДеревоЭлементов, "ДеревоЭлементовФормы");      

КонецПроцедуры

&НаСервере
Процедура ОбойтиУровеньДереваСвойствЭлементов(СтрокиДерева, Знач РежимЗаполнения)
	
	МассивСтартоваяСтраница = СписокСтартоваяСтраница.ВыгрузитьЗначения();
	РодительСтартовойСтраницы = ?(МассивСтартоваяСтраница.Количество() = 2, МассивСтартоваяСтраница[0], Неопределено);
	СтартоваяСтраница = ?(МассивСтартоваяСтраница.Количество() = 2, МассивСтартоваяСтраница[1] , Неопределено);
	
	Для каждого Строка из СтрокиДерева Цикл
		
		Если СписокНедоступныхЭлементов.НайтиПоЗначению(Строка.ИмяЭлемента) <> Неопределено Тогда
			Строка.ЗапретДоступности = Истина; 
		Иначе
			Если РежимЗаполнения = "Заменять" Тогда 
				Строка.ЗапретДоступности = Ложь;
			КонецЕсли;	
		КонецЕсли;
		
		Если СписокНевидимыхЭлементов.НайтиПоЗначению(Строка.ИмяЭлемента) <> Неопределено Тогда
			Строка.ЗапретВидимости = Истина; 
		Иначе
			Если РежимЗаполнения = "Заменять" Тогда 
				Строка.ЗапретВидимости = Ложь;
			КонецЕсли;	
		КонецЕсли;     
		
		Если СписокЭлементовСОтметкойНезаполненного.НайтиПоЗначению(Строка.ИмяЭлемента) <> Неопределено Тогда
			Строка.ОтметкаНезаполненного = Истина; 
		Иначе
			Если РежимЗаполнения = "Заменять" Тогда 
				Строка.ОтметкаНезаполненного = Ложь;
			КонецЕсли;	
		КонецЕсли;  
		
		Если Строка.ИмяЭлемента = РодительСтартовойСтраницы Тогда
			Строка.СтартоваяСтраница = СтартоваяСтраница; 
		Иначе
			Если РежимЗаполнения = "Заменять" Тогда 
				Строка.СтартоваяСтраница = "";
			КонецЕсли;	
		КонецЕсли;
		
		ОбойтиУровеньДереваСвойствЭлементов(Строка.Строки, РежимЗаполнения);
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

