#Область СлужебныеПроцедурыИФункции

#Область ОбщееДляФорм

// Определяет, можно ли обращаться к данным текущей строки таблицы.
//
Функция ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено
		ИЛИ ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыделеннаяГруппаТаблицы(ТаблицаФормы) Экспорт
	
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные; 
	
	Если ТекущиеДанныеТаблицыДоступны(ТекущиеДанные) И ТекущиеДанные.Свойство("ЭтоГруппа") Тогда
		
		Если ТекущиеДанные.ЭтоГруппа Тогда 
			Группа = ТекущиеДанные.Ссылка;
		Иначе 
			Группа = ТекущиеДанные.Родитель;
		КонецЕсли;
		
	Иначе
		
		Группа = Неопределено
		
	КонецЕсли;
	
	Возврат Группа;
	
КонецФункции

#КонецОбласти

#Область ФормыСПолемHTML

// Исполняет скрипт в браузере.
//
Функция ВыполнитьСкрипт(Документ, ТекстСкрипта, Браузер) Экспорт
	
	
	Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоВстроенныйWeKit(Браузер) Тогда
		
		Скрипт = Документ.createElement("script");
		Скрипт.setAttribute("type", "text/javascript");
		TextNode = Документ.createTextNode(ТекстСкрипта);
		Скрипт.appendChild(TextNode);
			
		head = Документ.getElementsByTagName("head");
		head["0"].appendChild(Скрипт);		
		
	Иначе
		
		Если Браузер = "msie" Тогда
			ИмяОкна = "parentWindow";
		Иначе
			ИмяОкна = "defaultView";
		КонецЕсли;
		
		Возврат Документ[ИмяОкна].eval(ТекстСкрипта);		
		
	КонецЕсли;

	
КонецФункции

Функция ЭтоВстроенныйWeKit(Браузер)
	
	#Если НЕ ВебКлиент Тогда
	Если Браузер = "other" Тогда
		Возврат Истина;
	КонецЕсли;
	#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

Функция ИмяДокумента(Документ, Браузер) Экспорт
	
	Если Документ = NULL ИЛИ Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Браузер) Тогда
		Текст = НСтр("ru = 'Браузер не определен'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецЕсли;
	
	Если Браузер = "msie" Тогда
		ИмяОкна = "parentWindow";
	Иначе
		ИмяОкна = "defaultView";
	КонецЕсли;
	
	ИмяДокумента = Неопределено;
	
	Попытка
		ИмяДокумента = Документ[ИмяОкна].eval("name");
	Исключение
	КонецПопытки;
	
	Если ИмяДокумента = Неопределено Тогда
		ИмяДокумента = Документ[ИмяОкна].name;	
	КонецЕсли;
	
	Если ИмяДокумента = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно определить имя окна HTML страницы'");
	КонецЕсли;
	
	Возврат ИмяДокумента;
	
КонецФункции

#КонецОбласти

#Область РаботаСФайлами

// Копирует содержимое каталога источника в каталог приемник с рекурсивным обходом подкаталогов.
//
// Параметры:
//  ИмяКаталогаИсточника - Строка - путь к каталогу, который нужно скопировать
//  ИмяКаталогаПриемника - Строка - путь к каталогу назначения
//
Процедура СкопироватьКаталог(Знач ИмяКаталогаИсточника, Знач ИмяКаталогаПриемника) Экспорт
	
	КаталогИсточника = Новый Файл(ИмяКаталогаИсточника);
	
	Если НЕ КаталогИсточника.Существует() ИЛИ НЕ КаталогИсточника.ЭтоКаталог() Тогда
		ВызватьИсключение НСтр("ru = 'Каталог источника не найден'")
	КонецЕсли;
	
	КаталогПриемника = Новый Файл(ИмяКаталогаПриемника);

	Если НЕ КаталогПриемника.Существует() Тогда
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ИмяКаталогаПриемника);
	КонецЕсли;
	
	ВсеФайлыИсточника = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ИмяКаталогаИсточника, "*", Ложь);
	
	ИмяКаталогаПриемника 
		= ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяКаталогаПриемника);
	
	Для каждого ФайлИсточника Из ВсеФайлыИсточника Цикл
		
		ИмяФайлаВПриемнике = ИмяКаталогаПриемника + ФайлИсточника.Имя;
		
		Если ФайлИсточника.ЭтоКаталог() Тогда
			СкопироватьКаталог(ФайлИсточника.ПолноеИмя, ИмяФайлаВПриемнике); //Рекурсия
		Иначе
			СкопироватьФайл(ФайлИсточника.ПолноеИмя, ИмяФайлаВПриемнике);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника) Экспорт
	Попытка
		КопироватьФайл(ИмяФайлаИсточника, ИмяФайлаПриемника);
	Исключение
		ЭлектронноеОбучениеСлужебныйВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно скопировать файл
			|%1 по причине: %2'"), ИмяФайлаИсточника, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Невозможно скопировать файл %1'"), ИмяФайлаИсточника);
	КонецПопытки
КонецПроцедуры

Процедура УдалитьВременныйФайл(ПолноеИмяФайла, ЗавершениеРаботы = Ложь) Экспорт
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		УдалитьФайлы(ПолноеИмяФайла);
	Исключение
		Если НЕ ЗавершениеРаботы Тогда
			ЭлектронноеОбучениеСлужебныйВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
				|%1 по причине: %2'"), ПолноеИмяФайла, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Системное

// Записывает в журнал регистрации описание ошибки.
//
// Параметры:
//	СообщениеОбОшибке - Строка - строковое представление ошибки.
//	Данные - Произвольный - данные, к которым относится сообщение об ошибке.
//
Процедура ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные = Неопределено) Экспорт
	
	ЭлектронноеОбучениеСлужебныйВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(СообщениеОбОшибке, Данные);
	
КонецПроцедуры

Функция КомандаLinuxДоступна(ИмяКоманды) Экспорт
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;			
	РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("bash -c ""command -v "+ИмяКоманды+"""", ПараметрыЗапускаПрограммы);
	
	Если РезультатЗапуска.КодВозврата = 0
		И ЗначениеЗаполнено(РезультатЗапуска.ПотокВывода)
		И СтрНайти(РезультатЗапуска.ПотокВывода, ИмяКоманды) > 0 Тогда
		
		Возврат Истина;
		
	КонецЕсли;		
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Вызывает диалог перед добавлением элемента подчиненного справочника,
// если основной элемент не записан.
//
Процедура ПередДобавлениемЭлементаПодчиненногоСправочника(Форма, Отказ, ПроверитьМодифицированность = Ложь) Экспорт
	ВызватьИсключение НСтр("ru = 'Устаревший вызов'");		
КонецПроцедуры

#КонецОбласти

#КонецОбласти



