#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Начальное заполнение
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		СсылкаДляЗаполнения = Параметры.Ключ;
		Если ЗначениеЗаполнено(Объект.ИсправленныйДокумент) Тогда
			СсылкаДляЗаполнения = Объект.ИсправленныйДокумент;
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			СсылкаДляЗаполнения = Параметры.ЗначениеКопирования;
		КонецЕсли;
		ЗарплатаКадрыРасширенный.УстановитьНачальныеЗначенияПериодичности(ЭтотОбъект);
		ПриПолученииДанныхНаСервере(СсылкаДляЗаполнения);
		Если Не ЗначениеЗаполнено(Объект.ПериодЗакрытия) Тогда
			Объект.ПериодЗакрытия = РасчетныйПериодЗакрытия;
		КонецЕсли;	
		ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	КонецЕсли;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ПериодЗакрытия", "ПериодЗакрытияСтрокой");
	УстановитьОтборСпискаПодразделений();
	ЗагрузитьСохраненныеЗначенияПереключателейОтображенияКадровогоПлана();
	УстановитьГлавнуюСтраницу();
	УстановитьСтраницуПанелиКадровогоПлана();
	УстановитьДоступностьКнопок();
	УстановитьВидимостьКнопок();
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПриИзмененииПоказатьСкрытьСтруктуруПредприятия();
	ПриИзмененииПоказатьСкрытьСвойстваПозиций();
	
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры // ПриОткрытии

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект.Ссылка);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "ИзмененыПериодыПоказателей" И Источник = ЭтотОбъект Тогда
		ОбработатьПериодыПоказателей(Параметр);
	КонецЕсли; 
	
	Если ИмяСобытия = "ИсправленДокумент" И Параметр.Документ = Объект.Ссылка Тогда
		УстановитьДоступностьКнопок();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДобавитьДополнительныеСвойстваОЗначенияхПоказателей(ТекущийОбъект);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеОбъектаВДанныеФормы();
	ПрочитатьСтатусыПозиций();
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	ЗначенияПереключателей = НовыеЗначенияПереключателей();
	ЗначенияПереключателей.РасполагатьПериодыВСтроках = РасполагатьПериодыВСтроках;
	ЗначенияПереключателей.РежимПросмотраОтчета = РежимПросмотраОтчета;
	ЗначенияПереключателей.ПоказатьСкрытьСтруктуруПредприятия = Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка;
	ЗначенияПереключателей.ПоказатьСкрытьСвойстваПозиций = Элементы.ПоказатьСкрытьСвойстваПозиций.Пометка;
	
	СохранитьЗначенияПереключателейОтображенияКадровогоПлана(ЗначенияПереключателей);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РежимПросмотраОтчетаПриИзменении(Элемент)
	
	Если Не РежимПросмотраОтчета Тогда
		Элементы.ПанельМесяцыВКолонках.ТекущаяСтраница = Элементы.СтраницаРедактированиеМесяцыВКолонках;
		Элементы.ПанельМесяцыВСтроках.ТекущаяСтраница = Элементы.СтраницаРедактированиеМесяцыВСтроках;
	КонецЕсли;
	
	УстановитьСтраницуПанелиКадровогоПлана();
	УстановитьВидимостьКнопок();
	
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура РасполагатьПериодыВСтрокахПриИзменении(Элемент)
	
	Если РасполагатьПериодыВСтроках Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВСтроках;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВКолонках;
	КонецЕсли;
	
	УстановитьВидимостьКнопок();
	
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	УстановитьОтборСпискаПодразделений();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	УстановитьДоступностьПодбораЗаполнения();
	ЗаполнитьСвойстваПоказателей();
	ПерезаполнитьПоказатели();
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаПланированияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если ШагРегулирования <> Неопределено Тогда 
		Объект.ПериодПланирования = ДобавитьМесяц(Объект.ПериодПланирования, Направление * ШагРегулирования);
		УстановитьПредставлениеПериодаПланирования();
		ПерезаполнитьПоказатели();
		ПроверитьНеобходимостьФормированияОтчета();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	Если ШагРегулирования <> Неопределено Тогда
		Если ШагРегулирования = 12 Тогда
			Объект.ПериодПланирования = НачалоГода(Объект.ПериодПланирования);
		ИначеЕсли ШагРегулирования = 6 Тогда
			ПериодПланирования = НачалоГода(Объект.ПериодПланирования);
			Если Месяц(Объект.ПериодПланирования) > ШагРегулирования Тогда
				ПериодПланирования = ДобавитьМесяц(ПериодПланирования, ШагРегулирования);
			КонецЕсли;
			Объект.ПериодПланирования = ПериодПланирования;
		КонецЕсли;
	КонецЕсли;
	УстановитьПредставлениеПериодаПланирования();
	ПерезаполнитьПоказатели();
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

#Область РедактированиеПериодаЗакрытияСтрокой

&НаКлиенте
Процедура ПериодЗакрытияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Объект.ПериодЗакрытия", "ПериодЗакрытияСтрокой", Модифицированность);
	УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодЗакрытияНачалоВыбораЗавершение", ЭтотОбъект);
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Объект.ПериодЗакрытия", "ПериодЗакрытияСтрокой", , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Объект.ПериодЗакрытия", "ПериодЗакрытияСтрокой", Направление, Модифицированность);
	УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктураПредприятия

&НаКлиенте
Процедура СтруктураПредприятияПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборПоПодразделению(ЭтотОбъект, Элемент.ТекущиеДанные);
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПризнакиСкрытыхСтрок(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииКадровогоПлана

&НаКлиенте
Процедура ПозицииКадровогоПланаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборПозиции(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПозицииКадровогоПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	Если Не Копирование Тогда
		Добавить(Команды.Добавить);
		Возврат;
	КонецЕсли;
	
	СкопироватьПозицииНаСервере("ПозицииКадровогоПлана", "Объект.ПозицииКадровогоПлана");
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииКадровогоПланаПередУдалением(Элемент, Отказ)
	ПередУдалениемПозицииНаСервере("ПозицииКадровогоПлана", "Объект.ПозицииКадровогоПлана");
КонецПроцедуры

&НаКлиенте
Процедура ПозицииКадровогоПланаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ИдентификаторТекущейСтроки = Элементы.ПозицииКадровогоПлана.ТекущаяСтрока;
	ТекущиеДанные = Элементы.ПозицииКадровогоПлана.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураПолей = Новый Структура;
		Для Сч = МесяцНачала По МесяцОкончания Цикл
			СтруктураПолей.Вставить("КоличествоСтавок" + Сч, ТекущиеДанные["КоличествоСтавок" + Сч]);
		КонецЦикла;
		УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
		Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
			Для Сч = МесяцНачала По МесяцОкончания Цикл
				СтруктураПолей.Вставить(ИмяПоказателя + Сч, ТекущиеДанные[ИмяПоказателя + Сч]);
			КонецЦикла;
		КонецЦикла;
		СтарыеЗначенияПоказателей = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(СтруктураПолей, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииКадровогоПланаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПозицииКадровогоПлана") Тогда
		ОбработкаВыбораНаСервере(ВыбранноеЗначение);
		Возврат;
	КонецЕсли;
	
	ПозицииДляПодбора = ОбработатьПозицииБезСвязиСоШтатнымРасписанием(ВыбранноеЗначение);
	
	Если ПозицииДляПодбора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	АдресПодобранных = АдресСпискаПодобранныхПозиций(ПозицииДляПодбора);
	УчитыватьПодборПриЗаполнении = Истина;
	
	НачатьЗаполнениеПоДаннымШтатнойРасстановки(Неопределено, Новый Структура("ЭтоОбработкаВыбора", Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПозицииКадровогоПланаПоказательПриИзменении(Элемент)
	НачатьВопросОЗаполненииПоказателей(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтавки

&НаКлиенте
Процедура СтавкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыборПозиции(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	Если Не Копирование Тогда
		Добавить(Команды.Добавить);
		Возврат;
	КонецЕсли;
	
	НачатьВопросОКопированииСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ТекстВопроса = НСтр("ru = 'Будут удалены все месяцы, связанные с выделенными позициями. Продолжить?'");
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Удаление позиций из кадрового плана'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Удалить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОбУдаленииСтрок", ЭтотОбъект), ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ИдентификаторТекущейСтроки = Элементы.Ставки.ТекущаяСтрока;
	ТекущиеДанные = Элементы.Ставки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураПолей = Новый Структура;
		УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
		ОтборСтрок = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		СтрокиСтавки = Ставки.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаСтавка Из СтрокиСтавки Цикл
			НомерМесяца = Месяц(СтрокаСтавка.Период);
			СтруктураПолей.Вставить(СтрШаблон("КоличествоСтавок%1", НомерМесяца), СтрокаСтавка.КоличествоСтавок);
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				СтруктураПолей.Вставить(СтрШаблон("%1%2", ИмяПоказателя, НомерМесяца), СтрокаСтавка[ИмяПоказателя]);
			КонецЦикла;
		КонецЦикла;
		СтарыеЗначенияПоказателей = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(СтруктураПолей, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтавкиПоказательПриИзменении(Элемент)
	НачатьВопросОЗаполненииПоказателей(Элемент.Имя);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИсправлениеДокументов
&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АвтоРасчетПериодаЗакрытия(Команда)
	
	Объект.ПериодЗакрытия = РасчетныйПериодЗакрытия;
	УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(ЭтотОбъект);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "Объект.ПериодЗакрытия", "ПериодЗакрытияСтрокой");
	
КонецПроцедуры
// Конец ИсправлениеДокументов

&НаКлиенте
Процедура ПоказатьСкрытьСтруктуруПредприятия(Команда)
	
	Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка = Не Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка;
	ПриИзмененииПоказатьСкрытьСтруктуруПредприятия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьСвойстваПозиций(Команда)
	
	Элементы.ПоказатьСкрытьСвойстваПозиций.Пометка = Не Элементы.ПоказатьСкрытьСвойстваПозиций.Пометка;
	ПриИзмененииПоказатьСкрытьСвойстваПозиций();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Подразделение", ПодчиненныеПодразделения(Объект.Подразделение));
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхПозиций());
	
	ОткрытьФорму("Справочник.ПозицииКадровогоПлана.ФормаСписка", ПараметрыФормы, Элементы.ПозицииКадровогоПлана);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Отбор", Новый Структура);
	ПараметрыФормы.Отбор.Вставить("Подразделение", ПодчиненныеПодразделения(Объект.Подразделение));
	
	ОткрытьФорму("Справочник.ПозицииКадровогоПлана.ФормаСписка", ПараметрыФормы, Элементы.ПозицииКадровогоПлана);
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВКолонках Тогда
		СкопироватьПозицииНаСервере("ПозицииКадровогоПлана", "Объект.ПозицииКадровогоПлана");
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВСтроках Тогда
		НачатьВопросОКопированииСтрок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ПараметрыПроверки = ПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.ЭтоЗаполнение = Ложь;
	ПараметрыПроверки.ЗаголовокТабличнойЧасти = НСтр("ru = 'Позиции кадрового плана'");
	ПараметрыПроверки.ПроверяемыеРеквизиты.Вставить("ПериодПланирования", НСтр("ru = 'Период планирования'"));
	ПараметрыПроверки.ПроверяемыеРеквизиты.Вставить("Сценарий", НСтр("ru = 'Сценарий'"));
	Оповещение = Новый ОписаниеОповещения("НачатьВыгрузкуВФайл", ЭтотОбъект);
	ПроверитьВозможностьЗаполнения(Оповещение, ПараметрыПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если Не Объект.ПозицииКадровогоПлана.Количество() = 0 Тогда
		ТекстВопроса = НСтр("ru = 'Кадровый план будет перезаполнен. Продолжить?'");
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПоказатьФормуЗагрузкиИзФайла();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ИсправлениеДокументов

&НаКлиенте
Процедура УстановитьПоляИсправленияНаКлиенте() Экспорт
	
	УстановитьПоляИсправления(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоляИсправления(Форма)

	ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(Форма, "ПериодическиеСведения");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКадровогоПлана

&НаСервере
Процедура ЗаполнитьПоДаннымШтатнойРасстановкиСервер(АдресРезультата, ЭтоОбработкаВыбора)
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПозиций = ДобавитьМесяц(Объект.ПериодПланирования, МесяцОкончания - МесяцНачала);
	Позиции = Новый Массив;
	Для Каждого КлючИЗначение Из Результат Цикл
		Для Каждого СтрокаТаблицы Из КлючИЗначение.Значение Цикл
			Если КлючИЗначение.Ключ = "ПозицииКадровогоПлана" Тогда
				НоваяСтрока = Объект[КлючИЗначение.Ключ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				Позиции.Добавить(СтрокаТаблицы.Позиция);
				Если Не ЭтоОбработкаВыбора Тогда
					Продолжить;
				КонецЕсли;
				ПозицияНайдена = Ложь;
				Для каждого СтрокаСтавка Из СтавкиПозицийШтатногоРасписания Цикл
					Если СтрокаСтавка.ПозицияШтатногоРасписания = НоваяСтрока.ПозицияШтатногоРасписания Тогда
						ИдентификаторыСтрок = Новый Массив(СтрокаСтавка.ИдентификаторыСтрок);
						ИдентификаторыСтрок.Добавить(НоваяСтрока.ИдентификаторСтроки);
						СтрокаСтавка.ИдентификаторыСтрок = ОбщегоНазначения.ФиксированныеДанные(ИдентификаторыСтрок);
						ПозицияНайдена = Истина;
						Прервать;
					КонецЕсли; 
				КонецЦикла;
				Если Не ПозицияНайдена Тогда
					НоваяСтрокаСтавка = СтавкиПозицийШтатногоРасписания.Добавить();
					НоваяСтрокаСтавка.ПозицияШтатногоРасписания = НоваяСтрока.ПозицияШтатногоРасписания;
					ДанныеПозиции = УправлениеШтатнымРасписанием.ДанныеПозицииШтатногоРасписания(
						НоваяСтрока.ПозицияШтатногоРасписания, ДатаПозиций, Ложь, Ложь);
					НоваяСтрокаСтавка.КоличествоСтавок = ДанныеПозиции.КоличествоСтавок;
					ИдентификаторыСтрок = Новый Массив();
					ИдентификаторыСтрок.Добавить(НоваяСтрока.ИдентификаторСтроки);
					НоваяСтрокаСтавка.ИдентификаторыСтрок = ОбщегоНазначения.ФиксированныеДанные(ИдентификаторыСтрок);
				КонецЕсли; 
			Иначе
				ЗаполнитьЗначенияСвойств(ЭтотОбъект[КлючИЗначение.Ключ].Добавить(), СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЭтоОбработкаВыбора Тогда
		УстановитьСтатусыПозиций(, Ложь);
	Иначе	
		ПрочитатьСтатусыПозиций(Ложь);
	КонецЕсли;
	
	ПрочитатьСвойстваПозиций(ОбщегоНазначенияКлиентСервер.СвернутьМассив(Позиции));
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект);
	
	МаксимальныйИдентификаторСтроки = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.ПозицииКадровогоПлана, "ИдентификаторСтроки");
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма, ТекущиеДанные = Неопределено)
	
	Если Не Форма.Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка Или ТекущиеДанные = Неопределено Тогда
		Форма.ПодчиненныеПодразделения.Очистить();
		Форма.Элементы.ПозицииКадровогоПлана.ОтборСтрок = Неопределено;
		Форма.Элементы.Ставки.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ПозицииКадровогоПлана.ОтборСтрок = Новый ФиксированнаяСтруктура("СкрытаяСтрока", Ложь);
	Форма.Элементы.Ставки.ОтборСтрок = Новый ФиксированнаяСтруктура("СкрытаяСтрока", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОтчетВТабличныйДокументНаСервере(АдресРезультата, ДополнительныеПараметры)
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект[ДополнительныеПараметры.ИмяТабличногоПоля] = Результат;
	ЭтотОбъект[СтрШаблон("ТребуетОбновления%1", ДополнительныеПараметры.ИмяВарианта)] = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиСкрытыхСтрок(Подразделение)
	
	ПодчиненныеПодразделения.ЗагрузитьЗначения(ПодчиненныеПодразделения(Подразделение));
	
	Для Каждого СтрокаПозиции Из Объект.ПозицииКадровогоПлана Цикл
		СтрокаПозиции.СкрытаяСтрока = ПодчиненныеПодразделения.НайтиПоЗначению(СтрокаПозиции.Подразделение) = Неопределено;
	КонецЦикла;
	
	Для Каждого СтрокаСтавки Из Ставки Цикл
		СтрокаСтавки.СкрытаяСтрока = ПодчиненныеПодразделения.НайтиПоЗначению(СтрокаСтавки.Подразделение) = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопок()
	
	ДоступностьКнопок = Не ДокументИсправлен;
	УстановитьДоступностьПодбораЗаполнения(ДоступностьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Добавить", "Доступность", ДоступностьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Скопировать", "Доступность", ДоступностьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗагрузитьИзФайла", "Доступность", ДоступностьКнопок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодбораЗаполнения(Знач ДоступностьКнопок = Истина)
	
	ДоступностьКнопок = ДоступностьКнопок И ЗначениеЗаполнено(Объект.Сценарий);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Заполнить", "Доступность", ДоступностьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подбор", "Доступность", ДоступностьКнопок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКнопок()
	
	ВидимостьКнопок = Истина;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВКолонках Тогда
		ВидимостьКнопок = Элементы.ПанельМесяцыВКолонках.ТекущаяСтраница <> Элементы.СтраницаПросмотрМесяцыВКолонках;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВСтроках Тогда
		ВидимостьКнопок = Элементы.ПанельМесяцыВСтроках.ТекущаяСтраница <> Элементы.СтраницаПросмотрМесяцыВСтроках;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подбор", "Видимость", ВидимостьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Добавить", "Видимость", ВидимостьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Скопировать", "Видимость", ВидимостьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПоказатьСкрытьСтруктуруПредприятия", "Видимость", ВидимостьКнопок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПоказатьСкрытьСвойстваПозиций", "Видимость", ВидимостьКнопок И ИспользоватьДопРеквизитыПозиций);
	
	УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "АвтоРасчетПериодаЗакрытия", "Видимость", Форма.Объект.ПериодЗакрытия <> Форма.РасчетныйПериодЗакрытия);

КонецПроцедуры

#Область ПереключениеРежимовОтображения

&НаСервере
Процедура УстановитьГлавнуюСтраницу()
	
	Если РасполагатьПериодыВСтроках Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВСтроках;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМесяцыВКолонках;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтраницуПанелиКадровогоПлана()
	
	Если РежимПросмотраОтчета Тогда
		Элементы.ПанельМесяцыВКолонках.ТекущаяСтраница = Элементы.СтраницаПросмотрМесяцыВКолонках;
		Элементы.ПанельМесяцыВСтроках.ТекущаяСтраница = Элементы.СтраницаПросмотрМесяцыВСтроках;
	Иначе
		Элементы.ПанельМесяцыВКолонках.ТекущаяСтраница = Элементы.СтраницаРедактированиеМесяцыВКолонках;
		Элементы.ПанельМесяцыВСтроках.ТекущаяСтраница = Элементы.СтраницаРедактированиеМесяцыВСтроках;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ОбработатьПозицииБезСвязиСоШтатнымРасписанием(Позиции)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана,
		|	ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания
		|ИЗ
		|	РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписанияПоКадровомуПлану
		|ГДЕ
		|	ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана В (&ПозицииКадровогоПлана)";
	
	Запрос.УстановитьПараметр("ПозицииКадровогоПлана", Позиции);
	
	СвязиПозиций = Запрос.Выполнить().Выгрузить();
	
	ПозицияКадровогоПлана = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
		Позиции, СвязиПозиций.ВыгрузитьКолонку("ПозицияКадровогоПлана"));
	
	ОбработкаВыбораНаСервере(ПозицияКадровогоПлана);
	
	Возврат СвязиПозиций.ВыгрузитьКолонку("ПозицияШтатногоРасписания");
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	ЕстьНовые = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ПодразделенияПозиций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВыбранноеЗначение, "Подразделение");
		Для Каждого Позиция Из ВыбранноеЗначение Цикл
			СтруктураПоиска = Новый Структура("Позиция", Позиция);
			Если Объект.ПозицииКадровогоПлана.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
				ЕстьНовые = Истина;
				НоваяСтрокаПозиция = Объект.ПозицииКадровогоПлана.Добавить();
				НоваяСтрокаПозиция.Позиция = Позиция;
				НоваяСтрокаПозиция.Подразделение = ПодразделенияПозиций.Получить(Позиция);
				ДобавитьСтрокуПозиции(НоваяСтрокаПозиция, УникальныеИменаПоказателей);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЕстьНовые = Истина;
		НоваяСтрокаПозиция = Объект.ПозицииКадровогоПлана.Добавить();
		НоваяСтрокаПозиция.Позиция = ВыбранноеЗначение;
		НоваяСтрокаПозиция.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Подразделение");
		ДобавитьСтрокуПозиции(НоваяСтрокаПозиция, УникальныеИменаПоказателей);
		УстановитьГлавнуюСтраницу();
		ВыбранноеЗначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	Если ЕстьНовые Тогда
		УстановитьСтатусыПозиций(Ложь);
		УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
		ПрочитатьСвойстваПозиций(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуПозиции(НоваяСтрокаПозиция, УникальныеИменаПоказателей)
	
	МаксимальныйИдентификаторСтроки = МаксимальныйИдентификаторСтроки + 1;
	НоваяСтрокаПозиция.ИдентификаторСтроки = МаксимальныйИдентификаторСтроки;
	ПервыйПроход = Истина;
	НаборСтрокПоказателей = Новый Массив;
	Для Сч = МесяцНачала По МесяцОкончания Цикл
		НоваяСтрокаСтавка = Ставки.Добавить();
		НоваяСтрокаСтавка.Период = ДобавитьМесяц(Объект.ПериодПланирования, Сч - МесяцНачала);
		НоваяСтрокаСтавка.ИдентификаторСтроки = НоваяСтрокаПозиция.ИдентификаторСтроки;
		НоваяСтрокаСтавка.КоличествоСтавок = 1;
		НоваяСтрокаСтавка.КоличествоСтавокЗаполнения = 1;
		НоваяСтрокаСтавка.Позиция = НоваяСтрокаПозиция.Позиция;
		НоваяСтрокаСтавка.Подразделение = НоваяСтрокаПозиция.Подразделение;
		НоваяСтрокаПозиция["КоличествоСтавок" + Сч] = 1;
		НоваяСтрокаПозиция["КоличествоСтавокЗаполнения" + Сч] = 1;
		Если ПервыйПроход Тогда
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
				НоваяСтрокаПоказатель = Показатели.Добавить();
				НоваяСтрокаПоказатель.Период = НоваяСтрокаСтавка.Период;
				НоваяСтрокаПоказатель.ИдентификаторСтроки = НоваяСтрокаПозиция.ИдентификаторСтроки;
				НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
				НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
				Для Каждого СтрокаПоказательПозиции Из НоваяСтрокаПозиция.Позиция.ПоказателиКадровогоПланирования Цикл
					Если Не СтрокаПоказательПозиции.Показатель = СвойстваПоказателя.Показатель Тогда
						Продолжить;
					КонецЕсли;
					НоваяСтрокаПоказатель.Значение = СтрокаПоказательПозиции.Значение;
					НоваяСтрокаПоказатель.ЗначениеЗаполнения = СтрокаПоказательПозиции.Значение;
					Прервать;
				КонецЦикла;
				НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя + "Заполнения"] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПозиция[СвойстваПоказателя.УникальноеИмяПоказателя + Сч] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПозиция[СвойстваПоказателя.УникальноеИмяПоказателя + "Заполнения" + Сч] = НоваяСтрокаПоказатель.Значение;
				НаборСтрокПоказателей.Добавить(НоваяСтрокаПоказатель);
			КонецЦикла;
			ПервыйПроход = Ложь;
		Иначе
			Для Каждого СтрокаПоказатель Из НаборСтрокПоказателей Цикл
				НоваяСтрокаПоказатель = Показатели.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказатель, СтрокаПоказатель);
				НоваяСтрокаПоказатель.Период = НоваяСтрокаСтавка.Период;
				НоваяСтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя + "Заполнения"] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПозиция[СтрокаПоказатель.УникальноеИмяПоказателя + Сч] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПозиция[СтрокаПоказатель.УникальноеИмяПоказателя + "Заполнения" + Сч] = НоваяСтрокаПоказатель.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПозиции(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ДокументИсправлен Или ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы[Элемент.Имя].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Поле = Элементы.ПозицииКадровогоПланаПозиция Или Поле = Элементы.СтавкиПозиция Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВводаПоказателей(ТекущиеДанные.Позиция, ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаПоказателей(Позиция, ИдентификаторСтроки)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Позиция", Позиция);
	ПараметрыФормы.Вставить("СвойстваПоказателей", СвойстваПоказателей);
	ПараметрыФормы.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ПараметрыФормы.Вставить("ПериодыПоказателей", ПериодыПоказателей(ЭтотОбъект, ИдентификаторСтроки));
	
	ОткрытьФорму("Документ.КадровыйПлан.Форма.ВводПоказателейПоПериодам", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПоказательПриИзмененииНаСервере(ИмяЭлемента, НомерМесяца, ТолькоВыбранныйМесяц = Истина)
	
	Если СтрНачинаетсяС(ИмяЭлемента, "ПозицииКадровогоПлана") Тогда
		ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "ПозицииКадровогоПлана", "");
		ТекущаяСтрока = Объект.ПозицииКадровогоПлана.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ВводимоеЗначение = ТекущаяСтрока[ИмяЭлемента];
		Период = ДобавитьМесяц(НачалоГода(Объект.ПериодПланирования), НомерМесяца - 1);
		НайденныеСтроки = Ставки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Период", ТекущаяСтрока.ИдентификаторСтроки, Период));
		ТекущаяСтрока = НайденныеСтроки[0];
		ИмяЭлемента = Лев(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрДлина(НомерМесяца));
		ТекущаяСтрока[ИмяЭлемента] = ВводимоеЗначение;
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "Ставки") Тогда
		ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "Ставки", "");
		ТекущаяСтрока = Ставки.НайтиПоИдентификатору(ИдентификаторТекущейСтроки);
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ВводимоеЗначение = ТекущаяСтрока[ИмяЭлемента];
		Период = ТекущаяСтрока.Период;
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект);
	
	СтрокаПозиция = Объект.ПозицииКадровогоПлана.НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки))[0];
	
	Если ТолькоВыбранныйМесяц Тогда
		ОтборСтрок = Новый Структура("ИдентификаторСтроки, Период", ТекущаяСтрока.ИдентификаторСтроки, ТекущаяСтрока.Период);
		Постфикс = Строка(НомерМесяца);
		ДанныеДляПересчета = ДанныеДляПересчета(ЭтотОбъект, ИмяЭлемента, Постфикс, ВводимоеЗначение);
		УстановитьПоказателиВТаблицахФормы(ИмяЭлемента, НомерМесяца, ВводимоеЗначение, ОтборСтрок, СтрокаПозиция, ДанныеДляПересчета);
	Иначе
		Для Сч = НомерМесяца По МесяцОкончания Цикл
			ОтборСтрок = Новый Структура("ИдентификаторСтроки, Период", 
				ТекущаяСтрока.ИдентификаторСтроки, ДобавитьМесяц(Объект.ПериодПланирования, Сч - МесяцНачала));
			Постфикс = Строка(Сч);
			ДанныеДляПересчета = ДанныеДляПересчета(ЭтотОбъект, ИмяЭлемента, Постфикс, ВводимоеЗначение);
			УстановитьПоказателиВТаблицахФормы(ИмяЭлемента, Сч, ВводимоеЗначение, ОтборСтрок, СтрокаПозиция, ДанныеДляПересчета);
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокаПозиция.ЭтоОбнуление = ЕстьСтавкиВСтроке(СтрокаПозиция) Тогда
		СтрокаПозиция.ЭтоОбнуление = Не СтрокаПозиция.ЭтоОбнуление;
		Если СтрокаПозиция.ЭтоОбнуление Тогда
			СтрокаПозиция.Комментарий = НСтр("ru = 'Штатная единица к закрытию'");
			ЗаполнитьСтатусыСтавок(СтрокаПозиция);
		Иначе
			УстановитьСтатусыПозиций();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоказателиВТаблицахФормы(ИмяЭлемента, НомерМесяца, ВводимоеЗначение, ОтборСтрок, СтрокаПозиция, ДанныеДляПересчета)
	
	СтрокаСтавка = Ставки.НайтиСтроки(ОтборСтрок)[0];
	СтрокаСтавка[ИмяЭлемента] = ВводимоеЗначение;
	
	СтрокаПозиция[ИмяЭлемента + НомерМесяца] = ВводимоеЗначение;
	
	Если СтрНачинаетсяС(ИмяЭлемента, "КоличествоСтавок") Тогда
		НайденныеСтроки = Показатели.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаПоказатель Из НайденныеСтроки Цикл
			Если ДанныеДляПересчета.СтароеЗначение = 0 Тогда
				СтрокаПоказатель.Значение = ВводимоеЗначение * СтрокаПоказатель.ЗначениеЗаполнения;
			ИначеЕсли ВводимоеЗначение = 0 Тогда
				СтрокаПоказатель.Значение = 0;
			Иначе
				СтрокаПоказатель.Значение = СтрокаПоказатель.Значение / ДанныеДляПересчета.СтароеЗначение * ВводимоеЗначение;
			КонецЕсли;
			СтрокаПозиция[СтрокаПоказатель.УникальноеИмяПоказателя + НомерМесяца] = СтрокаПоказатель.Значение;
			СтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя] = СтрокаПоказатель.Значение;
		КонецЦикла;
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "Показатель") Тогда
		ОтборСтрок.Вставить("УникальноеИмяПоказателя", ИмяЭлемента);
		НайденныеСтроки = Показатели.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаПоказатель Из НайденныеСтроки Цикл
			СтрокаПоказатель.Значение = ВводимоеЗначение;
		КонецЦикла;
		
		Если Не ДанныеДляПересчета.ТребуетсяПересчетВзносов Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТарифВзносов Из ДанныеДляПересчета.ТарифыВзносов Цикл
			ЗначениеТарифа = ДанныеДляПересчета.ТарифыВзносов[ТарифВзносов.Ключ];
			Если ЗначениеТарифа = 0 Тогда
				Продолжить;
			КонецЕсли;
			ОтборСтрок.УникальноеИмяПоказателя = ТарифВзносов.Ключ;
			НайденныеСтроки = Показатели.НайтиСтроки(ОтборСтрок);
			Для Каждого СтрокаПоказатель Из НайденныеСтроки Цикл
				СтрокаПоказатель.Значение = (СтрокаПоказатель.Значение / ЗначениеТарифа
					- ДанныеДляПересчета.СтароеЗначение + ВводимоеЗначение) * ЗначениеТарифа;
				СтрокаПозиция[СтрокаПоказатель.УникальноеИмяПоказателя + НомерМесяца] = СтрокаПоказатель.Значение;
				СтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя] = СтрокаПоказатель.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеДляПересчета(Форма, ИмяЭлемента, Постфикс, ВводимоеЗначение)
	
	ДанныеДляПересчета = Новый Структура("ТребуетсяПересчетВзносов", Ложь);
	
	ДанныеДляПересчета.Вставить("СтароеЗначение", Форма.СтарыеЗначенияПоказателей[ИмяЭлемента + Постфикс]);
	Если ДанныеДляПересчета.СтароеЗначение = ВводимоеЗначение Тогда
		Возврат ДанныеДляПересчета;
	КонецЕсли;
	
	Если Не СтрНачинаетсяС(ИмяЭлемента, "Показатель") Тогда
		Возврат ДанныеДляПересчета;
	КонецЕсли;
		
	СвойстваПоказателя = Форма.СвойстваПоказателей.Получить(ИмяЭлемента);
	Если Не СвойстваПоказателя.Категория = Перечисления.КатегорииРасходовНаПерсонал.Зарплата Тогда
		Возврат ДанныеДляПересчета;
	КонецЕсли;
	
	ТарифыВзносов = Новый Структура;
	СуммаЗарплата = 0;
	УникальныеИменаПоказателей = Форма.СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		СвойстваПоказателя = Форма.СвойстваПоказателей.Получить(ИмяПоказателя);
		Если СвойстваПоказателя.Категория = Перечисления.КатегорииРасходовНаПерсонал.Зарплата Тогда
			СуммаЗарплата = СуммаЗарплата + Форма.СтарыеЗначенияПоказателей[ИмяПоказателя + Постфикс];
		ИначеЕсли СвойстваПоказателя.Категория = Перечисления.КатегорииРасходовНаПерсонал.СтраховыеВзносы Тогда
			ТарифыВзносов.Вставить(ИмяПоказателя);
		КонецЕсли;
	КонецЦикла;
	
	Если ТарифыВзносов.Количество() = 0 Или СуммаЗарплата = 0 Тогда
		Возврат ДанныеДляПересчета;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ТарифыВзносов Цикл
		ТарифыВзносов[КлючИЗначение.Ключ] = Форма.СтарыеЗначенияПоказателей[КлючИЗначение.Ключ + Постфикс] / СуммаЗарплата;
	КонецЦикла;
	
	ДанныеДляПересчета.Вставить("ТарифыВзносов", ТарифыВзносов);
	ДанныеДляПересчета.ТребуетсяПересчетВзносов = Истина;
	
	Возврат ДанныеДляПересчета;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьТребованиеОбновлениеОтчета(Форма, УстанавливатьМодифицированность = Ложь)
	
	Форма.ТребуетОбновленияМесяцыВКолонках = Истина;
	Форма.ТребуетОбновленияМесяцыВСтроках = Истина;
	
	Если УстанавливатьМодифицированность Тогда
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере(СсылкаНаОбъект)
	
	ЗаполнитьДополнительныеСведенияОПериодичности();
	УстановитьПредставлениеПериодаПланирования();
	ЗаполнитьСвойстваПоказателей(СсылкаНаОбъект);
	ДополнитьФорму();
	ПрочитатьЗначенияПоказателей(СсылкаНаОбъект);
	ДанныеОбъектаВДанныеФормы();
	ПрочитатьСтатусыПозиций();
	
КонецПроцедуры

&НаСервере
Процедура ДанныеОбъектаВДанныеФормы()
	
	ИсправлениеДокументовЗарплатаКадры.ПрочитатьРеквизитыИсправления(ЭтотОбъект, "ПериодическиеСведения");
	УстановитьПоляИсправления(ЭтотОбъект);
	
	РасчетныйПериодЗакрытия = КадровоеПланирование.ПоследнийПериодВыплатОтраженияЗарплаты();
	
	Документы.КадровыйПлан.ЗаполнитьПоказателиВТаблицах(Объект.ПозицииКадровогоПлана, Ставки, Показатели, СвойстваПоказателей, МесяцНачала, МесяцОкончания);
	ПрочитатьСвойстваПозиций();
	
	МаксимальныйИдентификаторСтроки = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.ПозицииКадровогоПлана, "ИдентификаторСтроки");
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСтатусыПозиций(ПерезаполнятьПозицииШтатногоРасписания = Истина)
	
	СтавкиПозицийШтатногоРасписания.Очистить();
	
	Если Объект.ПозицииКадровогоПлана.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтавкиПозицийШтатногоРасписания();
	
	Если ПерезаполнятьПозицииШтатногоРасписания Тогда
		ЗаполнитьПозицииШтатногоРасписания();
	КонецЕсли; 
	
	УстановитьСтатусыПозиций();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПозицииШтатногоРасписания()
	
	ПозицииШтатногоРасписания = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПозицииКадровогоПлана", Объект.ПозицииКадровогоПлана.Выгрузить());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПозицииКадровогоПлана.Позиция КАК Позиция,
		|	ПозицииКадровогоПлана.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ПОМЕСТИТЬ ВТПозицииКадровогоПлана
		|ИЗ
		|	&ПозицииКадровогоПлана КАК ПозицииКадровогоПлана
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТПозицииКадровогоПлана.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	МАКСИМУМ(ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияШтатногоРасписания) КАК ПозицияШтатногоРасписания
		|ИЗ
		|	ВТПозицииКадровогоПлана КАК ВТПозицииКадровогоПлана
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПозицииШтатногоРасписанияПоКадровомуПлану КАК ПозицииШтатногоРасписанияПоКадровомуПлану
		|		ПО ВТПозицииКадровогоПлана.Позиция = ПозицииШтатногоРасписанияПоКадровомуПлану.ПозицияКадровогоПлана
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПозицииКадровогоПлана.Позиция,
		|	ВТПозицииКадровогоПлана.ИдентификаторСтроки";
	
	ВыборкаПозиции = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПозиции.Следующий() Цикл
		ПозицииШтатногоРасписания.Вставить(ВыборкаПозиции.ИдентификаторСтроки, ВыборкаПозиции.ПозицияШтатногоРасписания);
	КонецЦикла;
	
	Для каждого СтрокаПозиции Из Объект.ПозицииКадровогоПлана Цикл
		СтрокаПозиции.ВведенаВШтатноеРасписание = Ложь;
		СтрокаПозиции.ЭтоОбнуление = Ложь;
		СтрокаПозиции.ПозицияШтатногоРасписания = ПозицииШтатногоРасписания.Получить(СтрокаПозиции.ИдентификаторСтроки);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтавкиПозицийШтатногоРасписания()
	
	Организация = Неопределено;
	Подразделение = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Подразделение, "Источник");
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			Подразделение = Организация;
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Владелец");
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(
		ДобавитьМесяц(Объект.ПериодПланирования, МесяцОкончания - МесяцНачала), Организация, Подразделение);
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтатноеРасписание.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ШтатноеРасписание.КоличествоСтавок КАК КоличествоСтавок
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание";
	
	СтавкиПозицийШтатногоРасписания.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусыПозиций(ОбрабатыватьПозицииСоСвязями = Истина, ОбрабатыватьПозицииБезСвязей = Истина)
	
	КомментарийНоваяПозицияШР = НСтр("ru = 'Новая позиция ШР'");
	КомментарийУтвержденнаяПозицияШР = НСтр("ru = 'Утвержденная позиция ШР'");
	КомментарийНоваяСтавка = НСтр("ru = 'Новая ставка'");
	КомментарийШтатнаяЕдиницаКЗакрытию = НСтр("ru = 'Штатная единица к закрытию'");
	
	Если ОбрабатыватьПозицииБезСвязей Тогда
		ПараметрыОтбора = Новый Структура("ПозицияШтатногоРасписания", Справочники.ШтатноеРасписание.ПустаяСсылка());
		НайденныеСтроки = Объект.ПозицииКадровогоПлана.НайтиСтроки(ПараметрыОтбора);
		Для каждого СтрокаПозиции Из НайденныеСтроки Цикл
			СтрокаПозиции.Комментарий = КомментарийНоваяПозицияШР;  
			ЗаполнитьСтатусыСтавок(СтрокаПозиции);
		КонецЦикла;
	КонецЕсли;

	Если ОбрабатыватьПозицииСоСвязями Тогда
		Для Каждого СтрокаСтавкаШР Из СтавкиПозицийШтатногоРасписания Цикл
			ИдентификаторыСтрок = Новый Массив;
			ИдентификаторыОбъединеннойСтроки = Новый Массив;
			Сч = 1;
			ПараметрыОтбора = Новый Структура("ПозицияШтатногоРасписания", СтрокаСтавкаШР.ПозицияШтатногоРасписания);
			НайденныеСтроки = Объект.ПозицииКадровогоПлана.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаПозиции Из НайденныеСтроки Цикл
				ИдентификаторыСтрок.Добавить(СтрокаПозиции.ИдентификаторСтроки);
				ИдентификаторыОбъединеннойСтроки.Добавить(СтрокаПозиции.ИдентификаторСтроки);
				Если ЕстьПревышениеСтавокПоПериодам(ИдентификаторыОбъединеннойСтроки, Ставки, МесяцНачала, МесяцОкончания) Тогда
					ИдентификаторыОбъединеннойСтроки.Очистить();
					ИдентификаторыОбъединеннойСтроки.Добавить(СтрокаПозиции.ИдентификаторСтроки);
					Сч = Сч + 1;
				КонецЕсли;
				СтрокаПозиции.ВведенаВШтатноеРасписание = Сч <= СтрокаСтавкаШР.КоличествоСтавок;
				Если Не ЕстьСтавкиВСтроке(СтрокаПозиции) Тогда
					СтрокаПозиции.Комментарий = КомментарийШтатнаяЕдиницаКЗакрытию;
					СтрокаПозиции.ЭтоОбнуление = Истина;
					ЗаполнитьСтатусыСтавок(СтрокаПозиции);
					Продолжить;
				КонецЕсли;
				Если СтрокаПозиции.ВведенаВШтатноеРасписание Тогда
					СтрокаПозиции.Комментарий = КомментарийУтвержденнаяПозицияШР;  
				Иначе
					СтрокаПозиции.Комментарий = КомментарийНоваяСтавка;
				КонецЕсли;
				ЗаполнитьСтатусыСтавок(СтрокаПозиции);
			КонецЦикла;
			СтрокаСтавкаШР.ИдентификаторыСтрок = ОбщегоНазначения.ФиксированныеДанные(ИдентификаторыСтрок);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПревышениеСтавокПоПериодам(Идентификаторы, Ставки, МесяцНачала, МесяцОкончания)
	
	Если Идентификаторы.Количество() < 2 Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЗанятыеСтавкиПоМесяцам = Новый Соответствие;
	Для НомерМесяца = МесяцНачала По МесяцОкончания Цикл
		ЗанятыеСтавкиПоМесяцам.Вставить(НомерМесяца, 0);
	КонецЦикла;
	
	Для Каждого Идентификатор Из Идентификаторы Цикл
		НайденныеСтроки = Ставки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Идентификатор));
		Для Каждого СтрокаСтавка Из НайденныеСтроки Цикл
			НомерМесяца = Месяц(СтрокаСтавка.Период);
			ЗанятоСтавок = ЗанятыеСтавкиПоМесяцам.Получить(НомерМесяца);
			НовоеКоличествоЗанятыхСтавок = ЗанятоСтавок + СтрокаСтавка.КоличествоСтавок;
			Если НовоеКоличествоЗанятыхСтавок > 1 Тогда
				Возврат Истина;
			КонецЕсли; 
			ЗанятыеСтавкиПоМесяцам.Вставить(НомерМесяца, НовоеКоличествоЗанятыхСтавок);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

&НаСервере
Функция ЕстьСтавкиВСтроке(Знач СтрокаПозиции)
	
	ЕстьСтавкиВСтроке = Ложь;
	Для Сч = МесяцНачала По МесяцОкончания Цикл
		Если ЕстьСтавкиВСтроке Тогда
			Прервать;
		КонецЕсли; 
		ЕстьСтавкиВСтроке = ЕстьСтавкиВСтроке Или СтрокаПозиции["КоличествоСтавок" + Сч] > 0;	
	КонецЦикла;
	
	Возврат ЕстьСтавкиВСтроке;

КонецФункции

&НаСервере
Процедура ЗаполнитьСтатусыСтавок(Знач СтрокаПозиции)
	
	НайденныеСтроки = Ставки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаПозиции.ИдентификаторСтроки));
	Для Каждого СтрокаСтавка Из НайденныеСтроки Цикл
		СтрокаСтавка.ВведенаВШтатноеРасписание = СтрокаПозиции.ВведенаВШтатноеРасписание;
		СтрокаСтавка.ПозицияШтатногоРасписания = СтрокаПозиции.ПозицияШтатногоРасписания;
		СтрокаСтавка.ЭтоОбнуление = СтрокаПозиции.ЭтоОбнуление;
		СтрокаСтавка.Комментарий = СтрокаПозиции.Комментарий;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОбУдаленииСтрок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Не Результат.Значение = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПередУдалениемПозицииНаСервере("Ставки", "Ставки");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВопросОКопированииСтрок()
	
	ТекстВопроса = НСтр("ru = 'Будут скопированы все месяцы, связанные с выделенными позициями. Продолжить?'");
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Копирование позиций кадрового плана'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОКопированииСтрок", ЭтотОбъект), ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОКопированииСтрок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Не Результат.Значение = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СкопироватьПозицииНаСервере("Ставки", "Ставки");
	
КонецПроцедуры

// Возвращает адрес во временном хранилище массива уже подобранных позиций.
//
&НаСервере
Функция АдресСпискаПодобранныхПозиций(МассивПозиций = Неопределено)
	
	Если МассивПозиций = Неопределено Тогда
		МассивПозиций = Объект.ПозицииКадровогоПлана.Выгрузить(, "Позиция").ВыгрузитьКолонку("Позиция");
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(МассивПозиций, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ПодчиненныеПодразделения(Подразделение)
	Возврат КадровоеПланирование.ПодчиненныеПодразделения(Подразделение);
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеСведенияОПериодичности()
	
	ШагиРегулирования = ОбщегоНазначения.ФиксированныеДанные(ЗарплатаКадрыРасширенный.СоответствиеКоличестваМесяцевПериодичности());
	
	СоответствиеФорматныхСтрок = Новый Соответствие;
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Год, "ДФ=гггг");
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Полугодие, "");
	СоответствиеФорматныхСтрок.Вставить(Перечисления.Периодичность.Квартал, НСтр("ru='ДФ=''к ""квартал"" гггг'''"));
	
	ФорматныеСтроки = ОбщегоНазначения.ФиксированныеДанные(СоответствиеФорматныхСтрок);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПериодаПланирования()
	
	ШагРегулирования = ШагиРегулирования.Получить(Объект.Периодичность);
	МесяцНачала = Месяц(Объект.ПериодПланирования);
	МесяцОкончания = МесяцНачала + ШагРегулирования - 1;
	
	// Период планирования
	ФорматнаяСтрока = ФорматныеСтроки.Получить(Объект.Периодичность);
	Если ФорматнаяСтрока <> Неопределено Тогда
		Если ШагРегулирования = 6 Тогда
			ФорматнаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='ДФ=''%1"" полугодие"" гггг'''"), ?(МесяцНачала / 6 > 1, "2", "1"));
		КонецЕсли;
		ПредставлениеПериодаПланирования = Формат(Объект.ПериодПланирования, ФорматнаяСтрока);
	Иначе
		ПредставлениеПериодаПланирования = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередУдалениемПозицииНаСервере(ИмяЭлементаТаблицы, ИмяРеквизита)
	
	ТаблицаФормы = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, ИмяРеквизита);
	ИдентификаторыКУдалению = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из Элементы[ИмяЭлементаТаблицы].ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаФормы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ИдентификаторыКУдалению.Добавить(СтрокаТаблицы.ИдентификаторСтроки);
		ТаблицаФормы.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	ИдентификаторыКУдалению = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИдентификаторыКУдалению);
	
	Для Каждого ИдентификаторСтроки Из ИдентификаторыКУдалению Цикл
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		Если ИмяЭлементаТаблицы <> "ПозицииКадровогоПлана" Тогда
			НайденныеСтроки = Объект.ПозицииКадровогоПлана.НайтиСтроки(СтруктураПоиска);
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект.ПозицииКадровогоПлана.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЕсли;
		НайденныеСтроки = Ставки.НайтиСтроки(СтруктураПоиска);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Ставки.Удалить(НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Показатели.НайтиСтроки(СтруктураПоиска);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Показатели.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	УстановитьСтатусыПозиций();
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьПозицииНаСервере(ИмяЭлементаТаблицы, ИмяРеквизита)
	
	ТаблицаФормы = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, ИмяРеквизита);
	ИдентификаторыСтрок = Новый Массив;
	
	Для каждого ВыделеннаяСтрока Из Элементы[ИмяЭлементаТаблицы].ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТаблицаФормы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ИдентификаторыСтрок.Найти(СтрокаТаблицы.ИдентификаторСтроки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторыСтрок.Добавить(СтрокаТаблицы.ИдентификаторСтроки);
		НоваяСтрокаПозиция = Объект.ПозицииКадровогоПлана.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиция, СтрокаТаблицы, , "Сотрудник,ИдентификаторСтроки,ВведенаВШтатноеРасписание,Комментарий");
		МаксимальныйИдентификаторСтроки = МаксимальныйИдентификаторСтроки + 1;
		НоваяСтрокаПозиция.ИдентификаторСтроки = МаксимальныйИдентификаторСтроки;
		СтавкиНайдены = Ложь;
		Для каждого СтрокаСтавка Из Ставки Цикл
			Если Не СтрокаСтавка.ИдентификаторСтроки = СтрокаТаблицы.ИдентификаторСтроки Тогда
				Если СтавкиНайдены Тогда
					Прервать;
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			СтавкиНайдены = Истина;
			НоваяСтрокаСтавка = Ставки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтавка, СтрокаСтавка, , "Сотрудник,ИдентификаторСтроки,ВведенаВШтатноеРасписание,Комментарий");
			НоваяСтрокаСтавка.ИдентификаторСтроки = НоваяСтрокаПозиция.ИдентификаторСтроки;
			НомерМесяца = Месяц(НоваяСтрокаСтавка.Период);
			НоваяСтрокаПозиция["КоличествоСтавок" + НомерМесяца] = НоваяСтрокаСтавка.КоличествоСтавок;
			ПоказателиНайдены = Ложь;
			Для каждого СтрокаПоказатель Из Показатели Цикл
				Если Не (СтрокаПоказатель.ИдентификаторСтроки = СтрокаСтавка.ИдентификаторСтроки
					И СтрокаПоказатель.Период = СтрокаСтавка.Период) Тогда
						
					Если ПоказателиНайдены Тогда
						Прервать;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ПоказателиНайдены = Истина;
				НоваяСтрокаПоказатель = Показатели.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказатель, СтрокаПоказатель);
				НоваяСтрокаПоказатель.ИдентификаторСтроки = НоваяСтрокаПозиция.ИдентификаторСтроки;
				НоваяСтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПозиция[СтрокаПоказатель.УникальноеИмяПоказателя + НомерМесяца] = НоваяСтрокаПоказатель.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьСтатусыПозиций();
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПериодыПоказателей(Форма, ИдентификаторСтроки)
	
	УникальныеИменаПоказателей = Форма.СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	
	МассивСтрок = Новый Массив;
	СтруктураПоиска = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	Для Каждого Строка Из Форма.Ставки.НайтиСтроки(СтруктураПоиска) Цикл
		ОписаниеСтроки = ОписаниеСтрокиПериодовПоказателя(УникальныеИменаПоказателей);
		ОписаниеСтроки.Начало = Строка.Период;
		ЗаполнитьЗначенияСвойств(ОписаниеСтроки, Строка);
		МассивСтрок.Добавить(ОписаниеСтроки);
	КонецЦикла;
	
	Возврат МассивСтрок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеСтрокиПериодовПоказателя(УникальныеИменаПоказателей)
	
	Описание = Новый Структура;
	Описание.Вставить("Начало");
	Описание.Вставить("КоличествоСтавок");
	
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		Описание.Вставить(ИмяПоказателя);
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

&НаСервере
Процедура ОбработатьПериодыПоказателей(Результат)
	
	Отбор = Новый Структура("ИдентификаторСтроки", Результат.ИдентификаторСтроки);
	НайденныеПозиции = Объект.ПозицииКадровогоПлана.НайтиСтроки(Отбор);
	Если НайденныеПозиции.Количество() > 0 Тогда
		УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
		ТекущаяСтрока = НайденныеПозиции[0];
	Иначе
		Возврат; 
	КонецЕсли;
	
	ПериодыПоказателей = ПолучитьИзВременногоХранилища(Результат.АдресВХранилище);
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	
	ОтборСтавок = Новый Структура("ИдентификаторСтроки, Период", Результат.ИдентификаторСтроки);
	ОтборПоказателей = Новый Структура("ИдентификаторСтроки, Период, УникальноеИмяПоказателя", Результат.ИдентификаторСтроки);
	Для Каждого СтрокаПериод Из ПериодыПоказателей Цикл 
		ОтборСтавок.Период = СтрокаПериод.Начало;
		НайденныеСтавки = Ставки.НайтиСтроки(ОтборСтавок);
		НайденнаяСтавка = НайденныеСтавки[0];
		НайденнаяСтавка.КоличествоСтавок = СтрокаПериод.КоличествоСтавок;
		НомерМесяца = Месяц(НайденнаяСтавка.Период);
		ТекущаяСтрока["КоличествоСтавок" + НомерМесяца] = СтрокаПериод.КоличествоСтавок;
		
		ОтборПоказателей.Период = СтрокаПериод.Начало;
		Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
			СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
			ОтборПоказателей.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
			НайденныеПоказатели = Показатели.НайтиСтроки(ОтборПоказателей);
			Для Каждого НайденнаяСтрока Из НайденныеПоказатели Цикл
				НайденнаяСтрока.Значение = СтрокаПериод[СвойстваПоказателя.УникальноеИмяПоказателя];
				НайденнаяСтавка[СвойстваПоказателя.УникальноеИмяПоказателя] = НайденнаяСтрока.Значение;
				ТекущаяСтрока[СвойстваПоказателя.УникальноеИмяПоказателя + НомерМесяца] = НайденнаяСтрока.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КадровыйПланОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыгрузкуВФайл(Результат, ДополнительныеПараметры) Экспорт 
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВыгрузкуВФайл", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьФормуЗагрузкиИзФайла();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПоказатьФормуЗагрузкиИзФайла()
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "КадровыйПлан.ЗагрузкаИзФайлаПозицииКадровогоПлана";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка кадрового плана из файла'");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтруктурыСоответствуют", СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц());
	ДополнительныеПараметры.Вставить("Сценарий", Объект.Сценарий);
	ДополнительныеПараметры.Вставить("Подразделение", Объект.Подразделение);
	ДополнительныеПараметры.Вставить("СвойстваПоказателей", СвойстваПоказателей);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	// Описание колонок для макета загрузки расходов
	ПараметрыЗагрузки.КолонкиМакета = ОписаниеКолонокМакетаДляЗагрузкиКадровогоПлана(Ложь, ДополнительныеПараметры.СтруктурыСоответствуют);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКадровыйПланИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц()
	Возврат ОрганизационнаяСтруктура.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц()
КонецФункции

&НаСервере
Функция ОписаниеКолонокМакетаДляЗагрузкиКадровогоПлана(ЭтоВыгрузка, СтруктурыСоответствуют)
	
	КолонкиМакета = ЗагрузкаДанныхИзФайла.СформироватьОписаниеКолонок(Объект.ЗагрузкаИзФайлаПозицииКадровогоПлана);
	
	ЗагрузкаДанныхИзФайлаКлиентСервер.УдалитьКолонкуМакета("Подразделение", КолонкиМакета);
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КодПодразделения", КолонкиМакета);
	Колонка.Позиция = 1;
	Колонка.Заголовок = НСтр("ru = 'Код подразделения'");
	Колонка.Подсказка = НСтр("ru = 'Код управленческого подразделения'");
	
	НомерПозиции = 2;
	Если СтруктурыСоответствуют Тогда
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КодПодразделения", КолонкиМакета);
		Колонка.Подсказка = НСтр("ru = 'Код юридического подразделения'");
		
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.ОписаниеКолонкиМакета(
			"Организация", ОбщегоНазначения.ОписаниеТипаСтрока(150), НСтр("ru = 'Организация'"), , НСтр("ru = 'Наименование организации'"));
		Колонка.Позиция = 2;
		КолонкиМакета.Добавить(Колонка);
		НомерПозиции = 3;
	КонецЕсли;
	
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Период", КолонкиМакета);
	Колонка.Позиция = НомерПозиции;
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(20);
	НомерПозиции = НомерПозиции + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Позиция", КолонкиМакета);
	Колонка.Позиция = НомерПозиции;
	Колонка.ОбязательнаДляЗаполнения = Истина;
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	НомерПозиции = НомерПозиции + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КодСотрудника", КолонкиМакета);
	Колонка.Позиция = НомерПозиции;
	Колонка.Заголовок = НСтр("ru = 'Таб. номер'");
	НомерПозиции = НомерПозиции + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Сотрудник", КолонкиМакета);
	Колонка.Позиция = НомерПозиции;
	Колонка.Тип = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	НомерПозиции = НомерПозиции + 1;
	
	Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("КоличествоСтавок", КолонкиМакета);
	Колонка.Позиция = НомерПозиции;
	Колонка.Заголовок = НСтр("ru = 'Колич. ставок'");
	НомерПозиции = НомерПозиции + 1;
	
	НомерПоказателя = 1;
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		Если НомерПоказателя > 30 Тогда
			Возврат КолонкиМакета;
		КонецЕсли;
		СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Показатель" + НомерПоказателя, КолонкиМакета);
		Колонка.Вставить("УникальноеИмяПоказателя", ИмяПоказателя);
		Колонка.Заголовок = СвойстваПоказателя.КраткоеНаименование;
		Колонка.Позиция = НомерПозиции;
		НомерПозиции = НомерПозиции + 1;
		НомерПоказателя = НомерПоказателя + 1;
	КонецЦикла;
	
	Если ЭтоВыгрузка Тогда
		Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Комментарий", КолонкиМакета);
		Колонка.Позиция = НомерПозиции;
		НомерПозиции = НомерПозиции + 1;
		Колонка.Заголовок = НСтр("ru = 'Комментарий'");
		Для Каждого КлючИЗначение Из ЗначенияРеквизитовСвойств Цикл
			Если НомерПоказателя > 30 Тогда
				Возврат КолонкиМакета;
			КонецЕсли;
			РеквизитыСвойства = КлючИЗначение.Значение;
			Колонка = ЗагрузкаДанныхИзФайлаКлиентСервер.КолонкаМакета("Показатель" + НомерПоказателя, КолонкиМакета);
			Колонка.Вставить("УникальноеИмяПоказателя", "Свойство_" + РеквизитыСвойства.Имя);
			Колонка.Заголовок = РеквизитыСвойства.Заголовок;
			Колонка.Позиция = НомерПозиции;
			НомерПозиции = НомерПозиции + 1;
			НомерПоказателя = НомерПоказателя + 1;
		КонецЦикла;
	КонецЕсли;
	
	Для Сч = НомерПоказателя По 30 Цикл
		ЗагрузкаДанныхИзФайлаКлиентСервер.УдалитьКолонкуМакета("Показатель" + Сч, КолонкиМакета);
	КонецЦикла;
	
	Возврат КолонкиМакета;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКадровыйПланИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКадровыйПланИзФайлаНаСервере(АдресЗагруженныхДанных);
	ПроверитьНеобходимостьФормированияОтчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКадровыйПланИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	Документы.КадровыйПлан.ЗаполнитьКадровыйПланПоДаннымИзФайла(ЭтотОбъект, АдресЗагруженныхДанных);
	
	МаксимальныйИдентификаторСтроки = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.ПозицииКадровогоПлана, "ИдентификаторСтроки");
		
	ПрочитатьСтатусыПозиций();
	ПрочитатьСвойстваПозиций();
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыгрузкуВФайл(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайлаДляСохранения", ЭтотОбъект);
		ИмяФайла = НСтр("ru = 'Кадровый план за %1. Сценарий %2'");
		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ИмяФайла, ПредставлениеПериодаПланирования, Строка(Объект.Сценарий));
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Книга Excel 97 (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx|Электронная таблица OpenDocument (*.ods)|*.ods|Табличный документ (*.mxl)|*.mxl'");
		ДиалогВыбораФайла.Расширение = "xls";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		ДиалогВыбораФайла.ИндексФильтра = 0;
		ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайла;
		ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(Оповещение, ДиалогВыбораФайла);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораРасширенияФайла", ЭтотОбъект);
		ОткрытьФорму("Обработка.ЗагрузкаДанныхИзФайла.Форма.РасширениеФайла",, ЭтотОбъект, Истина,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаДляСохранения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПутьКФайлу = Результат[0];
		ВыбранныйФайл = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ВыбранныйФайл.Расширение);
	
		Если ЗначениеЗаполнено(ВыбранныйФайл.Имя) Тогда
			Если РасширениеФайла = "xlsx" Тогда
				ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
			ИначеЕсли РасширениеФайла = "mxl" Тогда
				ТипФайла = ТипФайлаТабличногоДокумента.MXL;
			ИначеЕсли РасширениеФайла = "xls" Тогда
				ТипФайла = ТипФайлаТабличногоДокумента.XLS;
			ИначеЕсли РасширениеФайла = "ods" Тогда
				ТипФайла = ТипФайлаТабличногоДокумента.ODS;
			Иначе
				ПоказатьПредупреждение(, НСтр("ru = 'Шаблон файла не был сохранен.'"));
				Возврат;
			КонецЕсли;
			Оповещение = Новый ОписаниеОповещения("ПослеЗаписиТабличногоДокументаВФайл", ЭтотОбъект);
			ВыгрузкаКадровогоПлана = ВыгрузкаКадровогоПлана();
			ВыгрузкаКадровогоПлана.НачатьЗапись(Оповещение, ПутьКФайлу, ТипФайла);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиТабличногоДокументаВФайл(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Ложь Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Шаблон файла не был сохранен.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораРасширенияФайла(Результат, Параметр) Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда
		АдресВоВременномХранилище = ЭтотОбъект.УникальныйИдентификатор;
		СохранитьКадровыйПланВоВременноеХранилище(Результат, АдресВоВременномХранилище);
		ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
		ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, АдресВоВременномХранилище,
			НСтр("ru = 'Кадровый план'") + "." + Результат, ПараметрыСохраненияФайла);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьКадровыйПланВоВременноеХранилище(РасширениеФайла, АдресВоВременномХранилище)
	
	ВыгрузкаКадровогоПлана = ВыгрузкаКадровогоПлана();
	
	Поток = Новый ПотокВПамяти;
	Если РасширениеФайла = "xlsx" Тогда
		ВыгрузкаКадровогоПлана.Записать(Поток, ТипФайлаТабличногоДокумента.XLSX);
	ИначеЕсли РасширениеФайла = "xls" Тогда
		ВыгрузкаКадровогоПлана.Записать(Поток, ТипФайлаТабличногоДокумента.XLS);
	ИначеЕсли РасширениеФайла = "ods" Тогда
		ВыгрузкаКадровогоПлана.Записать(Поток, ТипФайлаТабличногоДокумента.ODS);
	Иначе 
		ВыгрузкаКадровогоПлана.Записать(Поток, ТипФайлаТабличногоДокумента.MXL);
	КонецЕсли;
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресВоВременномХранилище);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаКадровогоПлана()
	
	ВыгрузкаКадровогоПлана = Новый ТабличныйДокумент;
	СтруктурыСоответствуют = СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц();
	КолонкиМакета = ОписаниеКолонокМакетаДляЗагрузкиКадровогоПлана(ИспользоватьДопРеквизитыПозиций, СтруктурыСоответствуют);
	ТаблицаИнформацияПоКолонкам = РеквизитФормыВЗначение("ИнформацияПоКолонкам");
	Для каждого Колонка Из КолонкиМакета Цикл
		Строка = ТаблицаИнформацияПоКолонкам.Добавить();
		Строка.ИмяКолонки = Колонка.Имя;
		Строка.Ширина = ?(ЗначениеЗаполнено(Колонка.Ширина), Колонка.Ширина, 20);
		Строка.Примечание = Колонка.Подсказка;
		ЗаполнитьЗначенияСвойств(Строка, Колонка);
		Строка.Видимость = Истина;
		Строка.ПредставлениеКолонки = Колонка.Заголовок;
		Строка.ТипКолонки = Колонка.Тип;
	КонецЦикла;
	
	Шапка = Обработки.ЗагрузкаДанныхИзФайла.ШапкаБланкаДляЗаполненияПоИнформацииПоКолонкам(ТаблицаИнформацияПоКолонкам);
	ВыгрузкаКадровогоПлана.Вывести(Шапка);
	
	НомерСтроки = 2;
	Подразделения = ОбщегоНазначения.ВыгрузитьКолонку(Ставки, "Подразделение", Истина);
	Сотрудники = ОбщегоНазначения.ВыгрузитьКолонку(Ставки, "Сотрудник", Истина);
	КодыСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Сотрудники, "Код", Истина);
	
	Если СтруктурыСоответствуют Тогда
		ИсточникиПодразделений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Подразделения, "Источник", Истина);
		ОрганизацииИсточниковПодразделений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
			ОбщегоНазначенияБЗККлиентСервер.ЗначенияСоответствия(ИсточникиПодразделений), "Владелец", Истина);
		КодыПодразделений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Подразделения, "КодИсточника", Истина);
	Иначе
		КодыПодразделений = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Подразделения, "Код", Истина);
	КонецЕсли;
	
	Для Каждого СтрокаСтавка Из Ставки Цикл
		Для Каждого Колонка Из КолонкиМакета Цикл
			Если Колонка.Свойство("УникальноеИмяПоказателя") Тогда
				Значение = СтрокаСтавка[Колонка.УникальноеИмяПоказателя];
			ИначеЕсли Колонка.Имя = "КодПодразделения" Тогда
				Значение = КодыПодразделений.Получить(СтрокаСтавка.Подразделение);
			ИначеЕсли Колонка.Имя = "Организация" Тогда
				ИсточникПодразделения = ИсточникиПодразделений.Получить(СтрокаСтавка.Подразделение);
				Значение = ОрганизацииИсточниковПодразделений.Получить(ИсточникПодразделения);
			ИначеЕсли Колонка.Имя = "КодСотрудника" Тогда
				Значение = КодыСотрудников.Получить(СтрокаСтавка.Сотрудник);
			Иначе
				Значение = СтрокаСтавка[Колонка.Имя];
			КонецЕсли;
			ВыгрузкаКадровогоПлана.Область("R" + Формат(НомерСтроки, "ЧГ=0;") + "C" + Колонка.Позиция).Текст = Строка(Значение);
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	Возврат ВыгрузкаКадровогоПлана;
	
КонецФункции

&НаКлиенте
Процедура НачатьЗаполнениеПоДаннымШтатнойРасстановки(Результат, ДополнительныеПараметры) Экспорт 
	
	ДлительнаяОперация = ДлительнаяОперацияЗаполненияПоДаннымШтатнойРасстановки();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение кадрового плана по данным штатной расстановки'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоДаннымШтатнойРасстановки", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеПоДаннымШтатнойРасстановки(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ЗаполнитьПоДаннымШтатнойРасстановкиСервер(Результат.АдресРезультата, ДополнительныеПараметры.ЭтоОбработкаВыбора);
	
	ПроверитьНеобходимостьФормированияОтчета();
	
	Если Не РежимПросмотраОтчета Тогда
		Если РасполагатьПериодыВСтроках Тогда
			Элемент = Элементы.СтруктураПредприятияМесяцыВСтроках;
		Иначе
			Элемент = Элементы.СтруктураПредприятияМесяцыВКолонках;
		КонецЕсли;
		СтруктураПредприятияПриАктивизацииСтроки(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияЗаполненияПоДаннымШтатнойРасстановки()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Позиции = Новый Массив;
	Если УчитыватьПодборПриЗаполнении Тогда
		Позиции = ПолучитьИзВременногоХранилища(АдресПодобранных);
	КонецЕсли;
	
	МаксимальныйИдентификаторСтроки = ЗарплатаКадрыРасширенный.МаксимальныйИдентификаторСтроки(
		Объект.ПозицииКадровогоПлана, "ИдентификаторСтроки");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Документы.КадровыйПлан.ЗаполнитьКадровыйПланПоДаннымШтатнойРасстановки", СвойстваПоказателей,
		Объект.Подразделение, Объект.ПериодПланирования, Объект.Периодичность, Позиции, МаксимальныйИдентификаторСтроки, Объект.ПериодЗакрытия);
	
КонецФункции

&НаКлиенте
Процедура НачатьВыводОтчетаВТабличныйДокумент(ИмяВарианта, ТекстПараметра)
	
	ДлительнаяОперация = ДлительнаяОперацияВыводаОтчетаВТабличныйДокумент(ИмяВарианта);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Вывод кадрового плана в табличный документ %1'"), ТекстПараметра);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ДополнительныеПараметры = Новый Структура("ИмяВарианта, ИмяТабличногоПоля", ИмяВарианта, СтрШаблон("КадровыйПлан%1", ИмяВарианта));
	
	Обработчик = Новый ОписаниеОповещения("ЗавершитьВыводОтчетаВТабличныйДокумент", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыводОтчетаВТабличныйДокумент(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВывестиОтчетВТабличныйДокументНаСервере(Результат.АдресРезультата, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыводаОтчетаВТабличныйДокумент(ИмяВарианта)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Документы.КадровыйПлан.ВывестиОтчетВТабличныйДокумент",
		ИмяВарианта, Объект.ПозицииКадровогоПлана.Выгрузить(), Ставки.Выгрузить(), СвойстваПоказателей, МесяцНачала, МесяцОкончания);
	
КонецФункции

&НаКлиенте
Функция ПараметрыПроверкиЗаполнения()
	
	ПараметрыПроверкиЗаполнения = Новый Структура;
	ПараметрыПроверкиЗаполнения.Вставить("ПозицииКадровогоПлана", Неопределено);
	ПараметрыПроверкиЗаполнения.Вставить("Ставки", Неопределено);
	ПараметрыПроверкиЗаполнения.Вставить("Показатели", Неопределено);
	ПараметрыПроверкиЗаполнения.Вставить("ЗаголовокТабличнойЧасти", "");
	ПараметрыПроверкиЗаполнения.Вставить("ЭтоЗаполнение", Истина);
	ПараметрыПроверкиЗаполнения.Вставить("ПроверяемыеРеквизиты", Новый Структура);
	
	Возврат ПараметрыПроверкиЗаполнения;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьВозможностьЗаполнения(ОповещениеПослеПроверки, ПараметрыПроверкиЗаполнения) Экспорт
	
	ОчиститьСообщения();
	
	ШаблонОшибки = НСтр("ru = 'Поле ""%1"" не заполнено'");
	Отказ = Ложь;
	Для Каждого Элемент Из ПараметрыПроверкиЗаполнения.ПроверяемыеРеквизиты Цикл
		Если Не ЗначениеЗаполнено(Объект[Элемент.Ключ]) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Элемент.Значение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, Элемент.Ключ, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НужноОчиститьТЧ = ЗначениеЗаполнено(ПараметрыПроверкиЗаполнения.ПозицииКадровогоПлана)
				Или ЗначениеЗаполнено(ПараметрыПроверкиЗаполнения.Ставки)
				Или ЗначениеЗаполнено(ПараметрыПроверкиЗаполнения.Показатели);
	ТекстВопроса = "";
	
	Если ПараметрыПроверкиЗаполнения.ЭтоЗаполнение И НужноОчиститьТЧ Тогда
		ТекстВопроса =
			НСтр("ru = 'Для позиций штатного расписания, у которых нет связей с позициями кадрового плана, будут автоматически созданы позиции кадрового плана и установлены новые связи.
				|Табличная часть ""%1"" будет очищена, продолжить?'");
	ИначеЕсли ПараметрыПроверкиЗаполнения.ЭтоЗаполнение И Не НужноОчиститьТЧ Тогда
		ТекстВопроса =
			НСтр("ru = 'Для позиций штатного расписания, у которых нет связей с позициями кадрового плана, будут автоматически созданы позиции кадрового плана и установлены новые связи.
				|Продолжить?'");
	ИначеЕсли Не ПараметрыПроверкиЗаполнения.ЭтоЗаполнение И НужноОчиститьТЧ Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть ""%1"" будет очищена, продолжить?'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеПослеПроверки", ОповещениеПослеПроверки);
	ДополнительныеПараметры.Вставить("НужноОчиститьТЧ", НужноОчиститьТЧ);
	
	Если НЕ ПустаяСтрока(ТекстВопроса) Тогда
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.Заголовок = НСтр("ru = 'Заполнение данными текущей штатной расстановки'");
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
			
		Если ПустаяСтрока(ПараметрыПроверкиЗаполнения.ЗаголовокТабличнойЧасти) Или Не НужноОчиститьТЧ Тогда
			ТекстВопроса = СтрЗаменить(ТекстВопроса, " ""%1"" ", " ");
		Иначе
			ТекстВопроса = СтрШаблон(ТекстВопроса, ПараметрыПроверкиЗаполнения.ЗаголовокТабличнойЧасти);
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВозможностьЗаполненияПослеВопроса",
			ЭтотОбъект, ДополнительныеПараметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
			ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, ПараметрыВопроса);
	Иначе
		ПроверитьВозможностьЗаполненияПослеВопроса(Новый Структура("Значение", КодВозвратаДиалога.Да), ДополнительныеПараметры);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьЗаполненияПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Или Не РезультатВопроса.Значение = КодВозвратаДиалога.Да  Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.НужноОчиститьТЧ Тогда
		Объект.ПозицииКадровогоПлана.Очистить();
		Ставки.Очистить();
		Показатели.Очистить();
		Модифицированность = Истина;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПослеПроверки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьФормированияОтчета()
	
	Если Не РежимПросмотраОтчета Тогда
		Возврат;
	КонецЕсли;
	
	Если РасполагатьПериодыВСтроках И ТребуетОбновленияМесяцыВСтроках Тогда
		НачатьВыводОтчетаВТабличныйДокумент(КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВСтроках,
			НСтр("ru = 'с месяцами, расположенными вертикально'"));
	ИначеЕсли Не РасполагатьПериодыВСтроках И ТребуетОбновленияМесяцыВКолонках Тогда
		НачатьВыводОтчетаВТабличныйДокумент(КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВКолонках,
			НСтр("ru = 'с месяцами, расположенными горизонтально'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаПодразделений()
	
	ПодразделенияКОтображению = ОрганизационнаяСтруктура.ПодчиненныеПодразделения(Объект.Подразделение);
	ДобавитьРодителя(Объект.Подразделение, ПодразделенияКОтображению);
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			СтруктураПредприятия,
			"Ссылка",
			ПодразделенияКОтображению,
			ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СтруктураПредприятия, "Ссылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРодителя(Подразделение, ПодразделенияКОтображению)
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Родитель");
	
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделенияКОтображению.Добавить(Родитель);
	
	ДобавитьРодителя(Родитель, ПодразделенияКОтображению);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоказатели()
	
	ДополнитьФорму();
	
	Показатели.Очистить();
	Ставки.Очистить();
	
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	
	Для Каждого СтрокаПозиция Из Объект.ПозицииКадровогоПлана Цикл
		НоваяСтрокаСтавка = Ставки.Добавить();
		НоваяСтрокаСтавка.ИдентификаторСтроки = СтрокаПозиция.ИдентификаторСтроки;
		НоваяСтрокаСтавка.Период = МесяцНачала;
		Для Сч = 1 По МесяцОкончания - 1 Цикл
			НоваяСтрокаСтавкаПериод = Показатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтавкаПериод, НоваяСтрокаСтавка);
			НоваяСтрокаСтавкаПериод.Период = ДобавитьМесяц(НоваяСтрокаСтавка.Период, Сч);
		КонецЦикла;
		Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
			СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
			НоваяСтрокаПоказатель = Показатели.Добавить();
			НоваяСтрокаПоказатель.ИдентификаторСтроки = СтрокаПозиция.ИдентификаторСтроки;
			НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
			НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
			НоваяСтрокаПоказатель.Период = МесяцНачала;
			Для Сч = 1 По МесяцОкончания - 1 Цикл
				НоваяСтрокаПоказательПериод = Показатели.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказательПериод, НоваяСтрокаПоказатель);
				НоваяСтрокаПоказательПериод.Период = ДобавитьМесяц(НоваяСтрокаПоказатель.Период, Сч);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьТребованиеОбновлениеОтчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьФорму()
	
	ДобавляемыеРеквизиты = Новый Массив;
	УдаляемыеРеквизиты = Новый Массив;
	
	ИспользоватьДопРеквизитыПозиций = ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения");
	
	Если ИспользоватьДопРеквизитыПозиций Тогда
		НаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_ПозицииКадровогоПлана");
		СвойстваДопРеквизитов = ОбщегоНазначения.ВыгрузитьКолонку(НаборСвойств.ДополнительныеРеквизиты, "Свойство", Истина);
		ЗначенияРеквизитовСвойств = ОбщегоНазначения.ФиксированныеДанные(ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СвойстваДопРеквизитов, "Имя,Заголовок"));
		Для Каждого КлючИЗначение Из ЗначенияРеквизитовСвойств Цикл
			РеквизитыСвойства = КлючИЗначение.Значение;
			ИмяСвойства = "Свойство_" + РеквизитыСвойства.Имя;
			Если Элементы.Найти("Ставки" + ИмяСвойства) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				ИмяСвойства, ОбщегоНазначения.ОписаниеТипаСтрока(20), "Объект.ПозицииКадровогоПлана", РеквизитыСвойства.Заголовок));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				ИмяСвойства, ОбщегоНазначения.ОписаниеТипаСтрока(20), "Ставки", РеквизитыСвойства.Заголовок));
		КонецЦикла;
	КонецЕсли;
	
	СтавкиГруппаПоказателей = Элементы.Найти("СтавкиГруппаПоказателей");
	
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	
	Для Каждого Колонка Из СтавкиГруппаПоказателей.ПодчиненныеЭлементы Цикл
		ИмяПоказателя = СтрЗаменить(Колонка.Имя, "Ставки", "");
		Если СтрНачинаетсяС(ИмяПоказателя, "КоличествоСтавок") Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеРеквизиты.Добавить(СтрШаблон("Ставки.%1", ИмяПоказателя));
		УдаляемыеРеквизиты.Добавить(СтрШаблон("Ставки.%1Заполнения", ИмяПоказателя));
	КонецЦикла;
	
	Для Сч = 1 По 12 Цикл
		Для Каждого Колонка Из Элементы["Группа" + Сч].ПодчиненныеЭлементы Цикл
			ИмяПоказателя = СтрЗаменить(Колонка.Имя, "ПозицииКадровогоПлана", "");
			УдаляемыеРеквизиты.Добавить(СтрШаблон("Объект.ПозицииКадровогоПлана.%1", ИмяПоказателя));
			ИмяПоказателя = Лев(ИмяПоказателя, СтрДлина(ИмяПоказателя) - СтрДлина(Строка(Сч)));
			УдаляемыеРеквизиты.Добавить(СтрШаблон("Объект.ПозицииКадровогоПлана.%1Заполнения%2", ИмяПоказателя, Сч));
		КонецЦикла;
	КонецЦикла;
	
	ОписаниеТиповЧ = ОбщегоНазначения.ОписаниеТипаЧисло(22, 20, ДопустимыйЗнак.Неотрицательный);
	Для Сч = МесяцНачала По МесяцОкончания Цикл
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("КоличествоСтавок" + Сч, ОписаниеТиповЧ, "Объект.ПозицииКадровогоПлана"));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("КоличествоСтавокЗаполнения" + Сч, ОписаниеТиповЧ, "Объект.ПозицииКадровогоПлана"));
	КонецЦикла;
	
	ОписаниеТиповЧ = ОбщегоНазначения.ОписаниеТипаЧисло(12, 2);
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
			ИмяПоказателя, ОписаниеТиповЧ, "Ставки", СвойстваПоказателя.КраткоеНаименование));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
			ИмяПоказателя + "Заполнения", ОписаниеТиповЧ, "Ставки", СвойстваПоказателя.КраткоеНаименование));
		Для Сч = МесяцНачала По МесяцОкончания Цикл
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				ИмяПоказателя + Сч, ОписаниеТиповЧ, "Объект.ПозицииКадровогоПлана", СвойстваПоказателя.КраткоеНаименование));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				ИмяПоказателя + "Заполнения" + Сч, ОписаниеТиповЧ, "Объект.ПозицииКадровогоПлана", СвойстваПоказателя.КраткоеНаименование));
		КонецЦикла;
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	Если ИспользоватьДопРеквизитыПозиций Тогда
		ПозицииКадровогоПланаСвойства = Элементы.Найти("ПозицииКадровогоПланаСвойства");
		СтавкиСвойства = Элементы.Найти("СтавкиСвойства");

		Для Каждого КлючИЗначение Из ЗначенияРеквизитовСвойств Цикл
			РеквизитыСвойства = КлючИЗначение.Значение;
			ИмяСвойства = "Свойство_" + РеквизитыСвойства.Имя;
			Если Элементы.Найти("Ставки" + ИмяСвойства) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Элемент = Элементы.Вставить("ПозицииКадровогоПлана" + ИмяСвойства, Тип("ПолеФормы"), ПозицииКадровогоПланаСвойства);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = "Объект.ПозицииКадровогоПлана." + ИмяСвойства;
			
			Элемент = Элементы.Вставить("Ставки" + ИмяСвойства, Тип("ПолеФормы"), СтавкиСвойства);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = "Ставки." + ИмяСвойства;
		КонецЦикла;
	КонецЕсли;
	
	ФорматКоличестваСтавок = УправлениеШтатнымРасписанием.ФорматКоличестваСтавок();
	
	Элемент = Элементы.Найти("СтавкиКоличествоСтавок");
	Если Элемент = Неопределено Тогда
		Если СтавкиГруппаПоказателей.ПодчиненныеЭлементы.Количество() > 0 Тогда
			Элемент = Элементы.Вставить("СтавкиКоличествоСтавок",
											Тип("ПолеФормы"),
											СтавкиГруппаПоказателей,
											СтавкиГруппаПоказателей.ПодчиненныеЭлементы[0]);
		Иначе
			Элемент = Элементы.Вставить("СтавкиКоличествоСтавок",
				Тип("ПолеФормы"), СтавкиГруппаПоказателей);
		КонецЕсли;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Ставки.КоличествоСтавок";
		Элемент.Ширина = 9;
		Элемент.Формат = "ЧН=0";
		Элемент.ФорматРедактирования = ФорматКоличестваСтавок;
		Элемент.МаксимальноеЗначение = 1;
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_СтавкиПоказательПриИзменении");
	КонецЕсли;
	Для Сч = МесяцНачала По МесяцОкончания Цикл
		Элемент = Элементы.Найти("ПозицииКадровогоПланаКоличествоСтавок" + Сч);
		Если Элемент = Неопределено Тогда
			ГруппаЭлемент = Элементы.Найти("Группа" + Сч);
			Если ГруппаЭлемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
				Элемент = Элементы.Вставить("ПозицииКадровогоПланаКоличествоСтавок" + Сч,
											Тип("ПолеФормы"),
											ГруппаЭлемент,
											ГруппаЭлемент.ПодчиненныеЭлементы[0]);
			Иначе
				Элемент = Элементы.Вставить("ПозицииКадровогоПланаКоличествоСтавок" + Сч, Тип("ПолеФормы"), ГруппаЭлемент);
			КонецЕсли;
			Элемент.Заголовок = НСтр("ru = 'Колич. ставок'");
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = "Объект.ПозицииКадровогоПлана.КоличествоСтавок" + Сч;
			Элемент.Ширина = 9;
			Элемент.Формат = "ЧН=0";
			Элемент.ФорматРедактирования = ФорматКоличестваСтавок;
			Элемент.МаксимальноеЗначение = 1;
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПозицииКадровогоПланаПоказательПриИзменении");
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		Элемент = Элементы.Найти("Ставки" + ИмяПоказателя);
		Если Элемент = Неопределено Тогда
			Элемент = Элементы.Вставить("Ставки" + ИмяПоказателя,
											Тип("ПолеФормы"),
											СтавкиГруппаПоказателей);
			Элемент.Вид = ВидПоляФормы.ПолеВвода;
			Элемент.ПутьКДанным = "Ставки." + ИмяПоказателя;
			Элемент.ФорматРедактирования = "ЧДЦ=0";
			Элемент.Формат = "ЧДЦ=0";
			Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_СтавкиПоказательПриИзменении");
		КонецЕсли;
		Для Сч = МесяцНачала По МесяцОкончания Цикл
			ИмяПоказателяСч = ИмяПоказателя + Сч;
			Элемент = Элементы.Найти("ПозицииКадровогоПлана" + ИмяПоказателяСч);
			Если Элемент = Неопределено Тогда
				Элемент = Элементы.Вставить("ПозицииКадровогоПлана" + ИмяПоказателяСч,
												Тип("ПолеФормы"),
												Элементы.Найти("Группа" + Сч));
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
				Элемент.ПутьКДанным = "Объект.ПозицииКадровогоПлана." + ИмяПоказателяСч;
				Элемент.Ширина = 7;
				Элемент.ФорматРедактирования = "ЧДЦ=0";
				Элемент.Формат = "ЧДЦ=0";
				Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПозицииКадровогоПланаПоказательПриИзменении");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ИсправлениеДокументовЗарплатаКадры.ГруппаИсправлениеДополнитьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваПоказателей(КадровыйПлан = Неопределено)
	
	СвойстваПоказателей = Новый ФиксированноеСоответствие(
		КадровоеПланирование.СвойстваПоказателейСценария(Объект.Сценарий, КадровыйПлан));
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСвойстваПозиций(Позиции = Неопределено)
	
	Если Не ИспользоватьДопРеквизитыПозиций Тогда
		Возврат;
	КонецЕсли;

	НепрочитанныеСвойстваВСтроках = Объект.ПозицииКадровогоПлана.НайтиСтроки(Новый Структура("СвойстваПрочитаны", Ложь));
	Если НепрочитанныеСвойстваВСтроках.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Позиции = Неопределено Тогда
		Позиции = ОбщегоНазначения.ВыгрузитьКолонку(Объект.ПозицииКадровогоПлана, "Позиция", Истина);
	КонецЕсли;

	Если Позиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ЗначенияДополнительныхРеквизитов = ЗначенияДополнительныхРеквизитов(Позиции);
	Если ЗначенияДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Позиция Из Позиции Цикл
		СвойстваПозиции = ЗначенияДополнительныхРеквизитов.Получить(Позиция);
		Если СвойстваПозиции = Неопределено Или СвойстваПозиции.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтруктураОтбора = Новый Структура("Позиция, СвойстваПрочитаны", Позиция, Ложь);
		НайденныеПозицииКадровогоПлана = Объект.ПозицииКадровогоПлана.НайтиСтроки(СтруктураОтбора);
		НайденныеСтавки = Ставки.НайтиСтроки(СтруктураОтбора);
		Для Каждого КлючИЗначение Из СвойстваПозиции Цикл
			ИмяСвойства = "Свойство_" + КлючИЗначение.Ключ;
			Для Каждого СтрокаПозиции Из НайденныеПозицииКадровогоПлана Цикл
				СтрокаПозиции[ИмяСвойства] = КлючИЗначение.Значение;
				СтрокаПозиции.СвойстваПрочитаны = Истина;
			КонецЦикла;
			Для Каждого СтрокаСтавка Из НайденныеСтавки Цикл
				СтрокаСтавка[ИмяСвойства] = КлючИЗначение.Значение;
				СтрокаСтавка.СвойстваПрочитаны = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияДополнительныхРеквизитов(Позиции)
	
	Результат = Новый Соответствие;
	
	Для Каждого ЗначениеСвойства Из УправлениеСвойствами.ЗначенияСвойств(Позиции, , Ложь) Цикл
		Если Результат[ЗначениеСвойства.ВладелецСвойств] = Неопределено Тогда
			Результат.Вставить(ЗначениеСвойства.ВладелецСвойств, Новый Структура);
		КонецЕсли;
		Результат[ЗначениеСвойства.ВладелецСвойств].Вставить(ЗначениеСвойства.ИмяСвойства, ЗначениеСвойства.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПрочитатьЗначенияПоказателей(СсылкаНаОбъект)
	
	Показатели.Очистить();
	Ставки.Очистить();
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат
	КонецЕсли;
	
	СведенияОСтавкахИПоказателях = Документы.КадровыйПлан.ТаблицыДанныхОЗначенияхПоказателей(СсылкаНаОбъект);
	Показатели.Загрузить(СведенияОСтавкахИПоказателях.СведенияОПоказателях);
	Ставки.Загрузить(СведенияОСтавкахИПоказателях.СведенияОСтавках);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеСвойстваОЗначенияхПоказателей(ТекущийОбъект)
	
	Документы.КадровыйПлан.ДобавитьДополнительныеСвойстваОЗначенияхПоказателей(ТекущийОбъект.ДополнительныеСвойства);
	НаборЗаписей = Неопределено;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("СведенияОПоказателях", НаборЗаписей) Тогда
		ПоказательКоличествоСтавок = КадровоеПланирование.ПоказательКоличествоСтавок();
		Для Каждого СтрокаСтавка Из Ставки Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ИдентификаторСтроки = СтрокаСтавка.ИдентификаторСтроки;
			НоваяСтрока.ПериодПоказателя = СтрокаСтавка.Период;
			НоваяСтрока.Показатель = ПоказательКоличествоСтавок;
			НоваяСтрока.Значение = СтрокаСтавка.КоличествоСтавок;
			НоваяСтрока.ЗначениеЗаполнения = СтрокаСтавка.КоличествоСтавокЗаполнения;
		КонецЦикла;
		Для Каждого СтрокаПоказатель Из Показатели Цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ИдентификаторСтроки = СтрокаПоказатель.ИдентификаторСтроки;
			НоваяСтрока.ПериодПоказателя = СтрокаПоказатель.Период;
			НоваяСтрока.Показатель = СтрокаПоказатель.Показатель;
			НоваяСтрока.Значение = СтрокаПоказатель.Значение;
			НоваяСтрока.ЗначениеЗаполнения = СтрокаПоказатель.ЗначениеЗаполнения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСохраненныеЗначенияПереключателейОтображенияКадровогоПлана()
	
	ЗначенияПереключателей =
		ЗагрузитьЗначенияПереключателейОтображения("ЗначенияПереключателейОтображенияКадровогоПлана");
	
	Если ЗначенияПереключателей <> Неопределено Тогда
		Если ЗначенияПереключателей.Свойство("РасполагатьПериодыВСтроках") Тогда
			РасполагатьПериодыВСтроках = ЗначенияПереключателей.РасполагатьПериодыВСтроках;
		КонецЕсли;
		Если ЗначенияПереключателей.Свойство("РежимПросмотраОтчета") Тогда
			РежимПросмотраОтчета = ЗначенияПереключателей.РежимПросмотраОтчета;
		КонецЕсли;
		Если ЗначенияПереключателей.Свойство("ПоказатьСкрытьСтруктуруПредприятия") Тогда
			Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка = ЗначенияПереключателей.ПоказатьСкрытьСтруктуруПредприятия;
		КонецЕсли;
		Если ЗначенияПереключателей.Свойство("ПоказатьСкрытьСвойстваПозиций") Тогда
			Элементы.ПоказатьСкрытьСвойстваПозиций.Пометка = ЗначенияПереключателей.ПоказатьСкрытьСвойстваПозиций;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает значение из системного хранилища настроек ИБ.
//
&НаСервереБезКонтекста
Функция ЗагрузитьЗначенияПереключателейОтображения(КлючНастроек)
	
	Возврат ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("ПараметрыОтображенияКадровогоПлана", КлючНастроек);
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьЗначенияПереключателейОтображенияКадровогоПлана(ЗначенияПереключателей)
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
		"ПараметрыОтображенияКадровогоПлана", "ЗначенияПереключателейОтображенияКадровогоПлана", ЗначенияПереключателей);
	
КонецПроцедуры

&НаКлиенте
Функция НовыеЗначенияПереключателей()
	
	ЗначенияПереключателей = Новый Структура();
	ЗначенияПереключателей.Вставить("РасполагатьПериодыВСтроках", Ложь);
	ЗначенияПереключателей.Вставить("РежимПросмотраОтчета", Ложь);
	ЗначенияПереключателей.Вставить("ПоказатьСкрытьСтруктуруПредприятия", Ложь);
	ЗначенияПереключателей.Вставить("ПоказатьСкрытьСвойстваПозиций", Ложь);
	
	Возврат ЗначенияПереключателей;
	
КонецФункции

&НаКлиенте
Процедура НачатьВопросОЗаполненииПоказателей(ИмяЭлемента)
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Изменение показателя'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	Если СтрНачинаетсяС(ИмяЭлемента, "ПозицииКадровогоПланаПоказатель") Тогда
		ДлинаUID = 32;
		СтрокаМесяца = Прав(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрДлина("ПозицииКадровогоПланаПоказатель") - ДлинаUID);
		НомерМесяца = Число(СтрокаМесяца);
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "ПозицииКадровогоПланаКоличествоСтавок") Тогда
		СтрокаМесяца = Прав(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрДлина("ПозицииКадровогоПланаКоличествоСтавок"));
		НомерМесяца = Число(СтрокаМесяца);
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "Ставки") Тогда
		ТекущиеДанные = Элементы.Ставки.ТекущиеДанные ;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		НомерМесяца = Месяц(ТекущиеДанные.Период);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИмяЭлемента, НомерМесяца", ИмяЭлемента, НомерМесяца);
	
	СклоненияМесяца = СклоненияМесяца(НомерМесяца);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Только в %1'"), СклоненияМесяца.ПредложныйПадеж));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'С %1 до конца'"), СклоненияМесяца.РодительныйПадеж));
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Изменить показатель только в %1 или с %2 и до конца?'"),
		СклоненияМесяца.ПредложныйПадеж, СклоненияМесяца.РодительныйПадеж);
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОЗаполненииПоказателей", ЭтотОбъект, ДополнительныеПараметры), 
		ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОЗаполненииПоказателей(Ответ, ДополнительныеПараметры) Экспорт
	
	ПоказательПриИзмененииНаСервере(
		ДополнительныеПараметры.ИмяЭлемента,
		ДополнительныеПараметры.НомерМесяца,
		Ответ = Неопределено Или Ответ.Значение = КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Функция СклоненияМесяца(НомерМесяца)
	
	МесяцСтрокой = КадровоеПланирование.МесяцСтрокой(НомерМесяца);
	
	СклоненияМесяца = Новый Структура;
	СклоненияМесяца.Вставить("РодительныйПадеж", СклонениеПредставленийОбъектов.ПросклонятьПредставление(МесяцСтрокой, 2));
	СклоненияМесяца.Вставить("ПредложныйПадеж", СклонениеПредставленийОбъектов.ПросклонятьПредставление(МесяцСтрокой, 6));
	
	Возврат СклоненияМесяца;
	
КонецФункции

#Область КлючевыеРеквизитыЗаполненияФормы

&НаСервере
// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.ПозицииКадровогоПлана");
	Массив.Добавить("Ставки");
	Массив.Добавить("Показатели");
	
	Возврат Массив;
	
КонецФункции

&НаСервере
// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Сценарий", НСтр("ru = 'сценария'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Периодичность", НСтр("ru = 'периодичности'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "ПредставлениеПериодаПланирования", НСтр("ru = 'периода планирования'")));
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ПриИзмененииПоказатьСкрытьСтруктуруПредприятия()
	
	КнопкаНажата = Элементы.ПоказатьСкрытьСтруктуруПредприятия.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтруктураПредприятияМесяцыВКолонках", "Видимость", КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтруктураПредприятияМесяцыВСтроках", "Видимость", КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПозицииКадровогоПланаПодразделение", "Видимость", Не КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПозицииКадровогоПланаПодразделениеКодИсточника", "Видимость", Не КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтавкиПодразделение", "Видимость", Не КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтавкиПодразделениеКодИсточника", "Видимость", Не КнопкаНажата);
	
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказатьСкрытьСвойстваПозиций()
	
	КнопкаНажата = Элементы.ПоказатьСкрытьСвойстваПозиций.Пометка;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПозицииКадровогоПланаСвойства", "Видимость", КнопкаНажата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтавкиСвойства", "Видимость", КнопкаНажата);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДобавитьЭлементУсловногоОформленияВакантнойПозиции("Ставки");
	ДобавитьЭлементУсловногоОформленияВакантнойПозиции("ПозицииКадровогоПлана", "Объект.ПозицииКадровогоПлана");
	
	ДобавитьУсловноеОформлениеСтатусовПозиций("Ставки");
	ДобавитьУсловноеОформлениеСтатусовПозиций("ПозицииКадровогоПлана", "Объект.ПозицииКадровогоПлана");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементУсловногоОформленияВакантнойПозиции(ИмяЭлементаТаблицы, ИмяРеквизита = "")
	
	Если ИмяРеквизита = "" Тогда
		ИмяРеквизита = ИмяЭлементаТаблицы;
	КонецЕсли;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='< Вакантная позиция >'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветПустойГиперссылки);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, СтрШаблон("%1.Сотрудник", ИмяРеквизита), , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("%1Сотрудник", ИмяЭлементаТаблицы));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеСтатусовПозиций(ИмяЭлементаТаблицы, ИмяРеквизита = "")
	
	Если ИмяРеквизита = "" Тогда
		ИмяРеквизита = ИмяЭлементаТаблицы;
	КонецЕсли;
	
	// Раскраска строк позиций кадрового плана.
		
	// Зеленый - новые позиции
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НовыеСтроки);
	
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ВведенаВШтатноеРасписание", ИмяРеквизита), Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ЗависимаяВакансия", ИмяРеквизита), Ложь);
		
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлементаТаблицы);
	
	// Синий - изменяемые позиции
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ИзмененныеСтроки);
	
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ВведенаВШтатноеРасписание", ИмяРеквизита), Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ПозицияШтатногоРасписания", ИмяРеквизита), , ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ЭтоОбнуление", ИмяРеквизита), Ложь);
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлементаТаблицы);
	
	// Красный - закрываемые позиции.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.УдаленныеСтроки);
	
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных")); 
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ПозицияШтатногоРасписания", ИмяРеквизита), , ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, СтрШаблон("%1.ЭтоОбнуление", ИмяРеквизита), Истина);
	
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлементаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакрытияНачалоВыбораЗавершение(ЗначениеВыбрано, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеВыбрано Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьАвтоРасчетаПериодаЗакрытия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ПараметрыПроверки = ПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.ПозицииКадровогоПлана = Объект.ПозицииКадровогоПлана;
	ПараметрыПроверки.Ставки = Ставки;
	ПараметрыПроверки.Показатели = Показатели;
	ПараметрыПроверки.ЗаголовокТабличнойЧасти = НСтр("ru = 'Позиции кадрового плана'");
	ПараметрыПроверки.ПроверяемыеРеквизиты.Вставить("ПериодПланирования", НСтр("ru = 'Период планирования'"));
	ПараметрыПроверки.ПроверяемыеРеквизиты.Вставить("Сценарий", НСтр("ru = 'Сценарий'"));
	УчитыватьПодборПриЗаполнении = Ложь;
	Оповещение = Новый ОписаниеОповещения("НачатьЗаполнениеПоДаннымШтатнойРасстановки", ЭтотОбъект, Новый Структура("ЭтоОбработкаВыбора", Ложь));
	ПроверитьВозможностьЗаполнения(Оповещение, ПараметрыПроверки);
	
КонецПроцедуры

#КонецОбласти