#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// АдаптацияИнтерфейса
	АдаптироватьИнтерфейс();
	// Конец АдаптацияИнтерфейса
	
	Наименование = Параметры.Наименование;
	Описание = Параметры.Описание;
	ОписаниеОсобое = Параметры.ОписаниеОсобое;
	Элементы.ОписаниеОсобое.Видимость = ЗначениеЗаполнено(ОписаниеОсобое);
	
	Если ТолькоПросмотр Тогда
		Элементы.Наименование.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.Описание.ТолькоПросмотр = ТолькоПросмотр;
		Элементы.ОписаниеОсобое.ТолькоПросмотр = ТолькоПросмотр;
		
		Элементы.Готово.Видимость = Ложь;
		Элементы.Отмена.Заголовок = НСтр("ru = 'Закрыть'");
		Элементы.Отмена.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоОписание") Тогда
		Элементы.Наименование.Видимость = Ложь;
		Заголовок = НСтр("ru = 'Особое описание задачи'");
	КонецЕсли;
	
	Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("3.0.17.36") Тогда
		Элементы.ОписаниеОсобое.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("Описание", Описание);
	Результат.Вставить("ОписаниеОсобое", ОписаниеОсобое);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АдаптацияИнтерфейса

&НаСервере
Процедура АдаптироватьИнтерфейс()
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Элементы.Отмена.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти