#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ТекущийДокумент", ТекущийДокумент);
	
	ПоказыватьНеПринятыхКандидатов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Документ.РешениеОПриемеНаРаботу", "ПоказыватьНеПринятыхКандидатов", Истина);
	
	НастроитьДинамическийСписок();
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список", , , , , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВсехФизическихЛицПриИзменении(Элемент)
	
	НастроитьДинамическийСписок();
	
	СохранитьНастройкуПоказыватьНеПринятыхКандидатов(ПоказыватьНеПринятыхКандидатов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьДинамическийСписок()
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	Если ПоказыватьНеПринятыхКандидатов Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КандидатыПереопределяемый.Ссылка КАК Ссылка,
		|	КандидатыПереопределяемый.Код КАК Код,
		|	КандидатыПереопределяемый.Наименование КАК Наименование,
		|	КандидатыПереопределяемый.Вакансия КАК Вакансия,
		|	КандидатыПереопределяемый.ДатаРегистрации КАК ДатаРегистрации,
		|	КандидатыПереопределяемый.ДатаРешения КАК ДатаРешения,
		|	ДанныеПоискаФизическихЛицПереопределяемый.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты,
		|	ДанныеПоискаФизическихЛицПереопределяемый.Телефоны КАК Телефоны
		|ИЗ
		|	Справочник.Кандидаты КАК КандидатыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РешениеОПриемеНаРаботу КАК РешениеОПриемеНаРаботу
		|		ПО КандидатыПереопределяемый.Ссылка = РешениеОПриемеНаРаботу.Кандидат
		|		И КандидатыПереопределяемый.Позиция = РешениеОПриемеНаРаботу.ДолжностьПоШтатномуРасписанию
		|		И КандидатыПереопределяемый.ДатаРегистрации < РешениеОПриемеНаРаботу.ДатаПриема
		|		И (НЕ РешениеОПриемеНаРаботу.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛицПереопределяемый
		|		ПО КандидатыПереопределяемый.ЛичныеДанные = ДанныеПоискаФизическихЛицПереопределяемый.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущийЭтап
		|		ПО (ТекущийЭтап.Кандидат = КандидатыПереопределяемый.Ссылка)
		|ГДЕ
		|	КандидатыПереопределяемый.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|	И (КандидатыПереопределяемый.Позиция.Владелец = &Организация
		|	ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
		|	И (РешениеОПриемеНаРаботу.Ссылка ЕСТЬ NULL
		|	ИЛИ РешениеОПриемеНаРаботу.Ссылка = &ТекущийДокумент)
		|	И (ТекущийЭтап.ЭтапРаботы ЕСТЬ NULL
		|		ИЛИ ТекущийЭтап.ЭтапРаботы <> ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика))";
		
		Если Не ПолучитьФункциональнуюОпцию("ОткрытиеВакансииТребуетСогласования") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
				"КандидатыПереопределяемый.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)", "ИСТИНА");
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	КандидатыПереопределяемый.Ссылка КАК Ссылка,
		|	КандидатыПереопределяемый.Код КАК Код,
		|	КандидатыПереопределяемый.Наименование КАК Наименование,
		|	КандидатыПереопределяемый.Вакансия КАК Вакансия,
		|	КандидатыПереопределяемый.ДатаРегистрации КАК ДатаРегистрации,
		|	КандидатыПереопределяемый.ДатаРешения КАК ДатаРешения,
		|	ДанныеПоискаФизическихЛицПереопределяемый.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты,
		|	ДанныеПоискаФизическихЛицПереопределяемый.Телефоны КАК Телефоны
		|ИЗ
		|	Справочник.Кандидаты КАК КандидатыПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛицПереопределяемый
		|		ПО КандидатыПереопределяемый.ЛичныеДанные = ДанныеПоискаФизическихЛицПереопределяемый.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущийЭтап
		|		ПО (ТекущийЭтап.Кандидат = КандидатыПереопределяемый.Ссылка)
		|ГДЕ
		|	(ТекущийЭтап.ЭтапРаботы ЕСТЬ NULL
		|			ИЛИ ТекущийЭтап.ЭтапРаботы <> ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика))";
		
	КонецЕсли;
	
	СвойстваСписка.ОсновнаяТаблица  = "Справочник.Кандидаты";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Если ПоказыватьНеПринятыхКандидатов Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийДокумент", ТекущийДокумент);
		Список.Параметры.УстановитьЗначениеПараметра("Организация", Организация);
		
		Сортировка = Список.Порядок.Элементы;
		Сортировка.Очистить();
		УсловиеСортировки = Сортировка.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		УсловиеСортировки.Поле = Новый ПолеКомпоновкиДанных("ДатаРешения");
		УсловиеСортировки.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуПоказыватьНеПринятыхКандидатов(ПоказыватьНеПринятыхКандидатов)
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Документ.РешениеОПриемеНаРаботу", "ПоказыватьНеПринятыхКандидатов", ПоказыватьНеПринятыхКандидатов);
	
КонецПроцедуры

#КонецОбласти
