#Область СлужебныеПроцедурыИФункции

#Область ВредныеФакторыВидыРабот

Процедура ПроверитьИзменениеПериодичностиФактораВидаРабот(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если Форма.Параметры.Ключ.Пустая() Тогда
		// Новый объект, пока нигде не мог быть задействован.
		Возврат;
	КонецЕсли;
	
	ПроверятьПериодичность = Неопределено;
	ПараметрыЗаписи.Свойство("ПроверятьПериодичность", ПроверятьПериодичность);
	ПроверятьПериодичность = ПроверятьПериодичность = Неопределено Или ПроверятьПериодичность;
	
	Если Не ПроверятьПериодичность Тогда
		Если Отказ Тогда
			Форма.ЗаписатьСКлиента();
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если ПроверятьПериодичность Тогда
		НоваяПериодичность = МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
		МедицинскиеОсмотрыКлиентСервер.ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(НоваяПериодичность, Форма.Объект);
		Если Не МедицинскиеОсмотрыВызовСервера.ПериодичностьВредногоФактораВидаРаботИзменилась(НоваяПериодичность, Форма.ПрежняяПериодичность) Тогда
			// Периодичность не изменилась.
			Если Отказ Тогда
				Форма.ЗаписатьСКлиента();
			КонецЕсли;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗаписатьПослеВопроса", Форма);
	ПоказатьПредупреждениеОбИзмененииПериодичности(ОбработчикОповещения);
	
КонецПроцедуры

Процедура ПоказатьПредупреждениеОбИзмененииПериодичности(ОбработчикОповещения)
	
	ТекстВопроса = 
		НСтр("ru = 'Периодичность медицинских осмотров была изменена. 
              |Данное изменение может привести к необходимости обновления сведений о периодических медицинских осмотрах, 
              |которое займет длительное время и, вероятно, повлияет на дату проведения следующего осмотра.'");
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Продолжить'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

Процедура ПроверитьИзменениеПодтвержденияСоответствия(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если Форма.Параметры.Ключ.Пустая() Тогда
		// Новый объект, пока нигде не мог быть задействован.
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если Форма.Объект.СоответствиеПодтверждено Тогда
		Форма.ЗаписатьСКлиента();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ПроверитьИзменениеПериодичностиФактораВидаРаботПослеВопроса", Форма);
	ПоказатьПредупреждениеОбИзмененииПодтвержденияСоответствия(ОбработчикОповещения, Форма);
	
КонецПроцедуры

Процедура ПоказатьПредупреждениеОбИзмененииПодтвержденияСоответствия(ОбработчикОповещения, Форма)
	
	Если Форма.Объект.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование") Тогда
		ТекстВопроса = НСтр("ru = 'Для того чтобы результаты психиатрических освидетельствований, пройденных до 1 сентября 2022 года, 
			|действовали по приказу №342н, требуется установить соответствие прежних вредных факторов и видов работ с новыми видами деятельности.
			|На основании этого соответствия программа заполнит списки видов деятельности по приказу №342н в рабочих местах, 
			|наборах аттестованных сотрудников, направлениях и заключениях психиатрического освидетельствования.'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Для того чтобы результаты медицинских осмотров, пройденных до 1 апреля 2021 года 
			|по классификатору приказа №302н, действовали и по приказу №29н, требуется установить соответствие вредных факторов.
			|На основании этого соответствия программа заполнит списки вредных факторов по приказу №29н в рабочих местах, 
			|наборах аттестованных сотрудников, направлениях и заключениях медицинского осмотра.'");
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить("КодВозвратаДиалога.ОК", НСтр("ru = 'Продолжить'"));
	СписокКнопок.Добавить("КодВозвратаДиалога.Отмена", НСтр("ru = 'Отмена'"));
	
	ЗаголовокСообщения = НСтр("ru = 'Соответствие классификаторов'");
	ТекстФлажка = НСтр("ru = 'Соответствие классификаторов установлено, больше не напоминать'");
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = ЗаголовокСообщения;
	ПараметрыВопроса.Вставить("ТекстФлажка", ТекстФлажка);
	ПараметрыВопроса.Вставить("ТекстСообщения", ТекстВопроса);
	ПараметрыВопроса.Вставить("Кнопки", СписокКнопок);
	
	ОткрытьФорму("ОбщаяФорма.Вопрос", ПараметрыВопроса, , , , , ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти