#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбъектыИстории = ОбменСАрхивомВызовСервера.ОбъектыИсторииОбменаПоОбъекту(ПараметрКоманды);
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ОбъектыИстории);
	ПараметрыФормыИстории = Новый Структура("ОбъектОбмена", СписокОбъектов);
	ОткрытьФорму("РегистрСведений.ИсторияОбменаС1САрхивом.ФормаСписка", ПараметрыФормыИстории,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти