////////////////////////////////////////////////////////////////////////////////
// Подсистема "Охрана труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЭлементРедактированияНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура;
	ИмяЭлемента = Элемент.Имя;
	Если ТипЗнч(Форма.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ИмяЭлемента = СтрЗаменить(ИмяЭлемента, Форма.ТекущийЭлемент.Имя, "");
		ПараметрыОповещения.Вставить("ТаблицаФормы", Форма.ТекущийЭлемент.Имя);
	КонецЕсли;
	ПараметрыОповещения.Вставить("ИмяЭлемента", ИмяЭлемента);
	ПараметрыОповещения.Вставить("Форма", Форма);
	Оповещение = Новый ОписаниеОповещения("ЭлементРедактированияЗавершениеВвода", ЭтотОбъект, ПараметрыОповещения);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение,
		Элемент.ТекстРедактирования,
		Элемент.Заголовок);
	
КонецПроцедуры

Процедура ЭлементРедактированияЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	Если ДополнительныеПараметры.Свойство("ТаблицаФормы") Тогда
		Форма.Элементы[ДополнительныеПараметры.ТаблицаФормы].ТекущиеДанные[ДополнительныеПараметры.ИмяЭлемента] = ВведенныйТекст;
	Иначе
		Форма.Объект[ДополнительныеПараметры.ИмяЭлемента] = ВведенныйТекст;
	КонецЕсли;
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Функция ПараметрыОповещенияДокументов(РабочиеМеста) Экспорт
	
	ФизическиеЛицаДокумента = Новый Массив;
	Для Каждого СтрокаРабочиеМеста Из РабочиеМеста Цикл
		ФизическиеЛицаДокумента.Добавить(СтрокаРабочиеМеста.ФизическоеЛицо);
	КонецЦикла;
	
	ПараметрыОповещения = Новый Структура("ФизическиеЛица", ФизическиеЛицаДокумента);
	
	Возврат ПараметрыОповещения;
	
КонецФункции

#Область ОрганизацияУчетнаяПолитика

Процедура НачатьИзменениеПримененияРезультатовСпециальнойОценкиУсловийТруда(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпциюИнтерфейса("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Форма.ОрганизацияСсылка));
	Если Форма.ПолучитьФункциональнуюОпциюФормы(ОхранаТрудаКлиентСервер.ИмяФункциональнойОпцииИспользоватьРабочиеМестаОхраныТруда()) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.УчетСтраховыхВзносов.ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда Тогда
		Форма.ВключитьИспользованиеРабочихМестОхраныТруда = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = 
		НСтр("ru = 'Данная настройка включает автоматическое заполнение классов условий труда в отчете ЕФС-1.
			 |Кроме того, если включить использование рабочих мест охраны труда, тогда в отчете ЕФС-1 будут заполняться индивидуальные номера рабочих мест.
			 |
			 |Включить использование рабочих мест охраны труда?'");

	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Использование рабочих мест охраны труда будет включено'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить(Истина, НСтр("ru = 'Включить'"));
	КнопкиОтвета.Добавить(Ложь, НСтр("ru = 'Не включать'"));
	
	ДополнительныеПараметры = Новый Структура("Форма", Форма);
	ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершитьИзменениеПримененияРезультатовСпециальнойОценкиУсловийТруда", ЭтотОбъект, ДополнительныеПараметры);
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОткрытиеФорм

Процедура ОткрытьФормуПоОхранеТруда(ФормаВладелец, ОткрываетсяИзФормыСотрудника) Экспорт
	
	ОписаниеФормы = СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("ОбщаяФорма.СотрудникиОхранаТруда");
	ОписаниеФормы.КлючевыеРеквизиты.Вставить("ФизическоеЛицоСсылка");
	ОписаниеФормы.КлючевыеРеквизиты.Вставить("СотрудникСсылка");
	СотрудникиКлиент.ОткрытьДополнительнуюФорму(ОписаниеФормы, ФормаВладелец, ОткрываетсяИзФормыСотрудника);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗавершитьИзменениеПримененияРезультатовСпециальнойОценкиУсловийТруда(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ВключитьИспользованиеРабочихМестОхраныТруда = Истина;
	
КонецПроцедуры

#КонецОбласти