#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей(Замещение);
	МедицинскиеОсмотры.ЗаполнитьОрганизацию(ЭтотОбъект, Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ОбновитьПериодичностьОсмотровРабочихМестПоНаборуВредныхФакторовВидовРабот(ЭтотОбъект, Замещение);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей(Замещение)
	
	РабочиеМеста = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "РабочееМесто");
	Если РабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПолей = "РабочееМесто,ВидОсмотра,ВидРабот";
	ПрежнийНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение, ИменаПолей);
	ДополнительныеСвойства.Вставить("ПрежнийНабор", ПрежнийНабор);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли