
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьАрхивныхХарактеристик(ЭтаФорма);
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список",,,, "ВАрхиве");
	
	НастроитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьНеИспользуемыеХарактеристикиПриИзменении(Элемент)
	УстановитьВидимостьАрхивныхХарактеристик(ЭтаФорма)
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура ФункцииПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоФункциямНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомпетенцииПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоКомпетенцииНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ГруппыХарактеристикПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоГруппамНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ГруппыХарактеристикПерсонала(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ХарактеристикаПерсонала", Элементы.Список.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.ГруппыХарактеристикПерсонала.Форма.НазначениеГруппХарактеристик", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзБиблиотеки(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.ХарактеристикиПерсонала.Форма.БиблиотекаХарактеристикПерсонала", , ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаВсеХарактеристики(Команда)
	
	ВидВсеХарактеристики = Истина;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	УстановитьВидСпискаХарактеристик();
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоФункциям(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Истина;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоКомпетенциям(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Истина;
	ВидПоГруппам = Ложь;
	
	УстановитьВидСпискаХарактеристик();

	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоГруппам(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Истина;
	
	УстановитьВидСпискаХарактеристик();

	ПодключитьОбработчикОжидания("ПриИзмененииСохраняемойНастройки", 0.2, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьАрхивныхХарактеристик(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "ВАрхиве", Ложь, , , НЕ Форма.ПоказыватьНеИспользуемыеХарактеристики);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидСпискаХарактеристик()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВидСписка", "Видимость", Не ВидВсеХарактеристики);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаВсеХарактеристики", "Пометка", ВидВсеХарактеристики);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоФункциям", "Пометка", ВидПоФункциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоКомпетенциям", "Пометка", ВидПоКомпетенциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоГруппам", "Пометка", ВидПоГруппам);
	Если ВидПоКомпетенциям Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По компетенциям'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаКомпетенции);
	ИначеЕсли ВидПоГруппам Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По группам'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаГруппы);
	ИначеЕсли ВидПоФункциям Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'По функциям'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаФункции);
	КонецЕсли;
	Если ВидВсеХарактеристики Тогда
		Элементы.ВидСписка.Заголовок = НСтр("ru = 'Вид списка'");
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСохраняемойНастройки()
	
	Настройки = СохраняемыеНастройки();
	Настройки.ВидВсеХарактеристики = ВидВсеХарактеристики;
	Настройки.ВидПоФункциям = ВидПоФункциям;
	Настройки.ВидПоКомпетенциям = ВидПоКомпетенциям;
	Настройки.ВидПоГруппам = ВидПоГруппам;
	Настройки.ПоказыватьНеИспользуемыеХарактеристики = ПоказыватьНеИспользуемыеХарактеристики;
	СохранитьНастройкиНаСервере(Настройки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СохраняемыеНастройки()
	
	Настройки = Новый Структура(
		"ВидВсеХарактеристики,
		|ВидПоФункциям,
		|ВидПоКомпетенциям,
		|ВидПоГруппам,
		|ПоказыватьНеИспользуемыеХарактеристики");
	Возврат Настройки;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьНастройкиНаСервере(Настройки)
	
	Для Каждого КлючИЗначение Из Настройки Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ХарактеристикиПерсоналаСписок", КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидСпискаХарактеристик()
	
	НастройкаВидВсеХарактеристики = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ХарактеристикиПерсоналаСписок", "ВидВсеХарактеристики");
	ВидВсеХарактеристики = НастройкаВидВсеХарактеристики;
	Если ВидВсеХарактеристики = Неопределено Тогда
		ВидВсеХарактеристики = Истина;
		ВидПоФункциям = Ложь;
		ВидПоКомпетенциям = Ложь;
		ВидПоГруппам = Ложь;
	Иначе
		ВидПоФункциям = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ХарактеристикиПерсоналаСписок", "ВидПоФункциям");
		ВидПоКомпетенциям = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ХарактеристикиПерсоналаСписок", "ВидПоКомпетенциям");
		ВидПоГруппам = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ХарактеристикиПерсоналаСписок", "ВидПоГруппам");
	КонецЕсли;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоФункциямНаКлиенте()
	УстановитьОтборПоФункциям();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоФункциям()
	
	Если Элементы.Функции.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.Функции.ТекущаяСтрока) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДействияСотрудниковХарактеристикиПерсонала.Характеристика КАК Характеристика
		|ИЗ
		|	Справочник.ДействияСотрудников.ХарактеристикиПерсонала КАК ДействияСотрудниковХарактеристикиПерсонала
		|ГДЕ
		|	ДействияСотрудниковХарактеристикиПерсонала.Ссылка = &Функция";
	Запрос.УстановитьПараметр("Функция", Элементы.Функции.ТекущаяСтрока);
	Характеристики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор, "Ссылка", Характеристики, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКомпетенцииНаКлиенте()
	УстановитьОтборПоКомпетенции();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКомпетенции()
	
	Если Элементы.Компетенции.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.Компетенции.ТекущаяСтрока) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика
		|ИЗ
		|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсоналаХарактеристикиПерсонала
		|ГДЕ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка = &Компетенция";
	Запрос.УстановитьПараметр("Компетенция", Элементы.Компетенции.ТекущаяСтрока);
	Характеристики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор, "Ссылка", Характеристики, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоГруппамНаКлиенте()
	УстановитьОтборПоГруппам();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоГруппам()
	
	Если Элементы.ГруппыХарактеристик.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.ГруппыХарактеристик.ТекущаяСтрока) Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Характеристика
		|ИЗ
		|	Справочник.ГруппыХарактеристикПерсонала.ХарактеристикиПерсонала КАК
		|		ГруппыХарактеристикПерсоналаХарактеристикиПерсонала
		|ГДЕ
		|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Ссылка = &Группа";
	Запрос.УстановитьПараметр("Группа", Элементы.ГруппыХарактеристик.ТекущаяСтрока);
	Характеристики = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Характеристика");

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.Отбор, "Ссылка", Характеристики, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#КонецОбласти 