#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(
		Ссылка, ДатаНачалаОбучения, "Объект.ДатаНачалаОбучения", Отказ, НСтр("ru='Начало обучения'"), , , Ложь);
	
	Если ДатаНачалаОбучения > ДатаОкончанияОбучения Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не верно задан период обучения. Дата начала периода должна быть меньше даты окончания.'"),
			ЭтотОбъект, "ДатаОкончанияОбучения", ,Отказ);
	КонецЕсли;
	Если ДатаНачалаПроверкиЗнания > ДатаОкончанияПроверкиЗнания Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не верно задан период проверки знания. Дата начала периода должна быть меньше даты окончания.'"),
			ЭтотОбъект, "ДатаОкончанияПроверкиЗнания", ,Отказ);
	КонецЕсли;
	
	Если ФормаОбучения = Перечисления.ФормыОбученияПоОхранеТруда.Внутренняя Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УчебноеЗаведение");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоПрограммеОбучения(ДанныеЗаполнения);
	ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьСформированноеОбучение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСотрудниковПоПрограммеОбучения(КадровыеДанныеСотрудников = Неопределено) Экспорт
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РеквизитыПрограммы =
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрограммаОбучения,
			"Ссылка,ИспользоватьДляВсехРабочихМест,КонтролироватьСменуРабочегоМеста,ПроводитсяПовторно,КоличествоРаз,КоличествоПериодов,Периодичность,РабочиеМеста");
	
	Если КадровыеДанныеСотрудников = Неопределено Тогда
		ПроверятьАктуальностьОбучения = Истина;
		Сотрудники.Очистить();
		
		ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолучения.КадровыеДанные = "РабочееМестоОхраныТруда,РабочееМестоОхраныТрудаПериодРегистрации,ФизическоеЛицо";
		
		Если Не РеквизитыПрограммы.ИспользоватьДляВсехРабочихМест Тогда
			ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,
				"РабочееМестоОхраныТруда", "В", РеквизитыПрограммы.РабочиеМеста.Выгрузить().ВыгрузитьКолонку("РабочееМесто"));
		КонецЕсли;
		
		ПараметрыПолучения.Организация = Организация;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			ПараметрыПолучения.Подразделение = Подразделение;
		КонецЕсли;
		ПараметрыПолучения.НачалоПериода = ДатаНачалаПроверкиЗнания;
		ПараметрыПолучения.ОкончаниеПериода = ДатаОкончанияПроверкиЗнания;
		
		УстановитьПривилегированныйРежим(Истина);
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВТ, Истина, ПараметрыПолучения);
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ПроверятьАктуальностьОбучения = Ложь;
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
		Запрос.УстановитьПараметр("СотрудникиОрганизации", КадровыеДанныеСотрудников);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиОрганизации.РабочееМестоОхраныТруда КАК РабочееМестоОхраныТруда,
			|	СотрудникиОрганизации.РабочееМестоОхраныТрудаПериодРегистрации КАК РабочееМестоОхраныТрудаПериодРегистрации
			|ПОМЕСТИТЬ ВТСотрудникиОрганизации
			|ИЗ
			|	&СотрудникиОрганизации КАК СотрудникиОрганизации";
		Запрос.Выполнить();
	КонецЕсли;
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(МенеджерВТ, "ВТСотрудникиОрганизации") Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиТребующиеОбучение = ОбучениеПоОхранеТруда.СотрудникиТребующиеОбучение(
		МенеджерВТ, РеквизитыПрограммы, ДатаНачалаПроверкиЗнания, ДатаОкончанияПроверкиЗнания, ПроверятьАктуальностьОбучения);
	
	Для Каждого СтрокаТаблицы Из СотрудникиТребующиеОбучение Цикл
		ЗаполнитьЗначенияСвойств(Сотрудники.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьСформированноеОбучение()
	
	// Определим предыдущее состояние регистра по этому обучению.
	ДанныеОбучения = РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.ДанныеСформированногоОбучения(Ссылка);
	
	// Удаляем прежние данные.
	Для Каждого СтрокаОбучения Из ДанныеОбучения Цикл
		НаборЗаписей = РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(СтрокаОбучения.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаОбучения.РабочееМесто);
		НаборЗаписей.Отбор.ГоловнаяОрганизация.Установить(СтрокаОбучения.ГоловнаяОрганизация);
		НаборЗаписей.Отбор.ПрограммаОбучения.Установить(СтрокаОбучения.ПрограммаОбучения);
		НаборЗаписей.Отбор.Период.Установить(СтрокаОбучения.Период);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Если ПометкаУдаления Или Не Проведен Тогда
		Возврат;
	КонецЕсли;
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	ПроверкиПоОбучению = ОбучениеПоОхранеТруда.ПроверкиПоОбучению(Ссылка);
	ДатаОбучения = НачалоДня(Дата);
	// Создаем новые записи о сформированном обучении.
	Для Каждого СтрокаТаблицы Из Сотрудники Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) 
			Или Не ЗначениеЗаполнено(СтрокаТаблицы.РабочееМесто) 
			Или Не ЗначениеЗаполнено(Организация) Тогда
			Возврат;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(СтрокаТаблицы.ФизическоеЛицо);
		НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицы.РабочееМесто);
		НаборЗаписей.Отбор.ГоловнаяОрганизация.Установить(ГоловнаяОрганизация);
		НаборЗаписей.Отбор.ПрограммаОбучения.Установить(ПрограммаОбучения);
		НаборЗаписей.Отбор.Период.Установить(ДатаОбучения);
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, ЭтотОбъект);
		СтрокаНабора.ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
		СтрокаНабора.РабочееМесто = СтрокаТаблицы.РабочееМесто;
		СтрокаНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		СтрокаНабора.Период = ДатаОбучения;
		СтрокаНабора.Обучение = Ссылка;
		СтрокаНабора.ДатаНачалаОбучения = ДатаНачалаОбучения;
		СтрокаНабора.ДатаОкончанияОбучения = ДатаОкончанияОбучения;
		СтрокаНабора.Проверка = ПроверкиПоОбучению.Получить(СтрокаТаблицы.ФизическоеЛицо);
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаполнения(ДанныеЗаполнения)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Сотрудники.Очистить();
	
	Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
		ЗаполнитьСотрудниковПоТаблицеЗначений(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста);
	КонецЕсли;

	Если ДанныеЗаполнения.Свойство("ПрограммаОбучения") Тогда
		ЗаполнитьПоПрограммеОбучения(ДанныеЗаполнения.ПрограммаОбучения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудниковПоТаблицеЗначений(ФизическиеЛицаРабочиеМеста, ИмяКолонкиРабочееМесто = "РабочееМесто")
	
	Для Каждого ФизическоеЛицоРабочееМесто Из ФизическиеЛицаРабочиеМеста Цикл
		НоваяСтрока = Сотрудники.Добавить();
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицоРабочееМесто.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ФизическоеЛицоРабочееМесто[ИмяКолонкиРабочееМесто];
		НоваяСтрока.ПлановаяДатаПроверкиЗнания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ФизическоеЛицоРабочееМесто, "ДатаСледующейПроверкиЗнания", '00010101');
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоПрограммеОбучения(ПрограммаОбученияСсылка)
	
	Если ТипЗнч(ПрограммаОбученияСсылка) <> Тип("СправочникСсылка.ПрограммыОбученияСотрудниковПоОхранеТруда") Тогда
		Возврат;
	КонецЕсли;

	КоличествоУчебныхЧасов = Неопределено;
	Контрагент = Неопределено;
	УчебноеЗаведение = Неопределено;
	ФормаОбучения = Неопределено;
	
	ПрограммаОбучения = ПрограммаОбученияСсылка;
	Если ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		ИменаРеквизитов = Новый Массив;
		ИменаРеквизитов.Добавить("КоличествоУчебныхЧасов"); 
		ИменаРеквизитов.Добавить("Контрагент");
		ИменаРеквизитов.Добавить("УчебноеЗаведение");
		ИменаРеквизитов.Добавить("ФормаОбучения");
		ДанныеПрограммы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПрограммаОбученияСсылка, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПрограммы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли