#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = Перечисления.СостоянияСогласования.Отклонено Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Начало периода'"), , , Ложь);
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период заявки'"), ЭтотОбъект, "ДатаНачала",, Отказ);
		МассивНепроверяемыхРеквизитов.Добавить("ДатаНачала");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
	КонецЕсли;
	
	ОбучениеРазвитие.ПроверитьТабличнуюЧастьСотрудниковНаДублиФизическихЛиц(ЭтотОбъект, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПоЗаявкеНаОбучение(ДанныеЗаполнения);
	ЗаполнитьПоМероприятиюОбучения(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоМероприятиюОбучения(МероприятиеСсылка)
	
	Если ТипЗнч(МероприятиеСсылка) <> Тип("СправочникСсылка.МероприятияОбученияРазвития") Тогда
		Возврат;
	КонецЕсли;

	СтоимостьМероприятия = Неопределено;
	СпособОпределенияСтоимости = Неопределено;
	
	Мероприятие = МероприятиеСсылка;
	Если ЗначениеЗаполнено(Мероприятие) Тогда
		ИменаРеквизитов = Новый Массив;
		ИменаРеквизитов.Добавить("Стоимость");
		ИменаРеквизитов.Добавить("СпособОпределенияСтоимости");
		ДанныеМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МероприятиеСсылка, ИменаРеквизитов);
		СтоимостьМероприятия = ДанныеМероприятия.Стоимость;
		СпособОпределенияСтоимости = ДанныеМероприятия.СпособОпределенияСтоимости;
	КонецЕсли;
	
	ЗаполнитьСуммуРасходов();
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявкеНаОбучение(ЗаявкаСсылка)
	
	Если ТипЗнч(ЗаявкаСсылка) <> Тип("ДокументСсылка.ЗаявкаНаОбучениеРазвитие") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаОбъект = ЗаявкаСсылка.ПолучитьОбъект();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаявкаОбъект);
	
	Сотрудники.Загрузить(ЗаявкаОбъект.Сотрудники.Выгрузить());
	Расходы.Загрузить(ЗаявкаОбъект.Расходы.Выгрузить());
	
	ЗаполнитьПоМероприятиюОбучения(ЗаявкаОбъект.Мероприятие);
	
КонецПроцедуры

Процедура ЗаполнитьСуммуРасходов()
	СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СуммаРасходовНаОбучение(
		ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(СтоимостьМероприятия, СпособОпределенияСтоимости, Сотрудники.Количество()), 
		Расходы);
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли