#Область СлужебныеПроцедурыИФункции

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииОбщихПараметровБазовойФункциональности.
Процедура ПриОпределенииОбщихПараметровБазовойФункциональности(ОбщиеПараметры) Экспорт
	
КонецПроцедуры

// См. ПользователиПереопределяемый.ПриУстановкеНачальныхНастроек
Процедура ПриУстановкеНачальныхНастроек(НачальныеНастройки) Экспорт
	
КонецПроцедуры

// Возвращает сведения о конфигурации.
//
// Возвращаемое значение:
//   Структура - Сведения о конфигурации
//       * Хозрасчетная - Булево
//       * Бюджетная - Булево
//       * Базовая - Булево
//       * Корпоративная - Булево
//
Функция СведенияОКонфигурации() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Сведения = Новый Структура("Хозрасчетная, Бюджетная, Базовая, Корпоративная");
	
	Сведения.Хозрасчетная  = Истина;
	Сведения.Бюджетная     = Ложь;
	Сведения.Корпоративная = Ложь;
	Сведения.Базовая       = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
	
	Возврат Сведения;
КонецФункции

Функция ОписаниеТипаСтруктураПредприятия() Экспорт
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		МодульЗарплатаКадрыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыДляНебольшихОрганизаций");
		Возврат МодульЗарплатаКадрыДляНебольшихОрганизаций.ОписаниеТипаСтруктураПредприятия();
	КонецЕсли;
	
КонецФункции

#КонецОбласти