// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   СтруктураПараметров - см. СтруктураПараметровВидимостиЭлементов
Процедура ОбновитьСвойстваЭлементов(Форма, СтруктураПараметров = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = СтруктураПараметровВидимостиЭлементов(Форма);
	КонецЕсли;
	
	УстановитьСвойстваЭлементов(Форма, СтруктураПараметров);
	ОчиститьЗначенияСкрытыхПолей(Форма);
	
КонецПроцедуры

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
//   СтруктураПараметров - см. СтруктураПараметровВидимостиЭлементов
Процедура УстановитьСвойстваЭлементов(Форма, СтруктураПараметров = Неопределено) Экспорт
	
	Если СтруктураПараметров = Неопределено Тогда
		СтруктураПараметров = СтруктураПараметровВидимостиЭлементов(Форма);
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураПараметров, "КонтролироватьПроведение") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСпособПроведения", "Доступность",
			СтруктураПараметров.КонтролироватьПроведение);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроводитсяДляВсехРабочихМест", "Доступность",
			СтруктураПараметров.КонтролироватьПроведение);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КонтролироватьСменуРабочегоМеста", "Доступность",
			СтруктураПараметров.КонтролироватьПроведение);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РабочиеМеста", "Доступность",
			СтруктураПараметров.КонтролироватьПроведение И СтруктураПараметров.ПроводитсяДляВсехРабочихМест = 1);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСрокДействия", "Доступность",
			СтруктураПараметров.КонтролироватьПроведение И СтруктураПараметров.СпособПроведения = 1);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСрокДействияПроизвольно", "Видимость",
			СтруктураПараметров.КонтролироватьПроведение
			И СтруктураПараметров.ПериодПроведения = ОхранаТрудаКлиентСервер.ПроизвольноеЗначениеСпискаВыбораПериодов(Форма));
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтруктураПараметров, "ЭтоВнешняяФормаОбучения") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УчебноеЗаведение", "Видимость", СтруктураПараметров.ЭтоВнешняяФормаОбучения);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Контрагент", "Видимость", СтруктураПараметров.ЭтоВнешняяФормаОбучения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураПараметровВидимостиЭлементов(Форма)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("КонтролироватьПроведение", Форма.Объект.КонтролироватьПроведение);
	СтруктураПараметров.Вставить("ПроводитсяДляВсехРабочихМест", Форма.ПроводитсяДляВсехРабочихМест);
	СтруктураПараметров.Вставить("СпособПроведения", Форма.СпособПроведения);
	СтруктураПараметров.Вставить("ПериодПроведения", Форма.ПериодПроведения);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ФормаОбучения") Тогда
		СтруктураПараметров.Вставить("ЭтоВнешняяФормаОбучения",
			Форма.Объект.ФормаОбучения = ПредопределенноеЗначение("Перечисление.ФормыОбученияПоОхранеТруда.Внешняя"));
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ОчиститьЗначенияСкрытыхПолей(Форма)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ФормаОбучения") Тогда
		Возврат;
	КонецЕсли;
	
	СкрываемыеПоля = Новый Массив; // Массив из Строка
	СкрываемыеПоля.Добавить("УчебноеЗаведение");
	СкрываемыеПоля.Добавить("Контрагент");
	
	Для Каждого ИмяПоля Из СкрываемыеПоля Цикл
		ВидимостьПоля = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, ИмяПоля, "Видимость");
		Если Не ВидимостьПоля Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, "Объект." + ИмяПоля, Неопределено);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
