
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияФормыСпискаВыбораСотрудников(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользоватьУниверсальнуюФормуСпискаСотрудников() Тогда
		
		Если ВидФормы = "ФормаСписка"
			Или ВидФормы = "ФормаВыбора" Тогда
			
			ВыбраннаяФорма = "Обработка.СписокСотрудников.Форма.ФормаСпискаСотрудников";
			СтандартнаяОбработка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьУниверсальнуюФормуСпискаСотрудников() Экспорт
	
	Возврат Константы.ИспользоватьУниверсальнуюФормуСпискаСотрудников.Получить();
	
КонецФункции

Процедура УстановитьИспользоватьУниверсальнуюФормуСпискаСотрудников(Значение) Экспорт
	
	Константы.ИспользоватьУниверсальнуюФормуСпискаСотрудников.Установить(Значение);
	
КонецПроцедуры

Процедура ДополнитьСтруктуруПараметровНастроек(СтруктураПараметров) Экспорт
	
	СтруктураПараметров.Вставить("ИспользоватьУниверсальнуюФормуСпискаСотрудников", ИспользоватьУниверсальнуюФормуСпискаСотрудников());
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьУниверсальнуюФормуСпискаСотрудников", СтруктураПараметров.ИспользоватьУниверсальнуюФормуСпискаСотрудников);
	
КонецПроцедуры

Процедура СотрудникиПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не ИспользоватьУниверсальнуюФормуСпискаСотрудников() Тогда
		
		ЗарплатаКадрыКлиентСервер.УстановитьРасширеннуюПодсказкуЭлементуФормы(
			Форма,
			"ВАрхиве",
			НСтр("ru='Включить отображение таких сотрудников в списке можно будет в меню ""Еще""'"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКолонкиИнтеграцииС1САрхивом(Форма, ИмяСписка) Экспорт

	Если Форма.ИмяФормы = "Обработка.СписокСотрудников.Форма.ФормаСпискаСотрудников" Тогда
		
		Элементы = Форма.Элементы;
		
		ТаблицаФормы = Элементы.Найти(СокрЛП(ИмяСписка));
		Если ТаблицаФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ИмяКолонки = "СтатусОбменаС1САрхивом";
		
		КолонкаСтатусОбмена = Элементы.Найти(ИмяКолонки);
		Если КолонкаСтатусОбмена = Неопределено Тогда
			
			КолонкаСтатусОбмена = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), ТаблицаФормы);
			КолонкаСтатусОбмена.Вид                = ВидПоляФормы.ПолеКартинки;
			КолонкаСтатусОбмена.ПутьКДанным        = СтрШаблон("%1.%2", ИмяСписка, ИмяКолонки);
			КолонкаСтатусОбмена.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			КолонкаСтатусОбмена.КартинкаЗначений   = БиблиотекаКартинок.КоллекцияСостоянияДокументовБИА;
			КолонкаСтатусОбмена.Подсказка = НСтр("ru = 'Статус обмена с 1С:Архивом'");
			
			КолонкиСписка = ТаблицаФормы.ПодчиненныеЭлементы;
			Если КолонкиСписка.Количество() > 0 Тогда
				ЛеваяКолонка = КолонкиСписка.Получить(0);
				Элементы.Переместить(КолонкаСтатусОбмена, ТаблицаФормы, ЛеваяКолонка);
				Если ЛеваяКолонка.ФиксацияВТаблице = ФиксацияВТаблице.Лево Тогда
					КолонкаСтатусОбмена.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

