#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат РаботаСФайлами.РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ВладелецФайла)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ВладелецФайла)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ОбъединениеДублей

// После объединения дублей оставшийся элемент личных данных кандидата может "унаследовать" присоединенные файлы
// фотографий дублей. Процедура возвращает такие файлы бывшим владельцам.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата, оставшиеся после
//  объединения дублей ("оригинал").
Процедура ИзменитьВладельцевФайловФотографий(ЛичныеДанныеКандидата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);
	Запрос.УстановитьПараметр("НаименованиеФотография", "Фотография");
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛичныеДанныеКандидатовПрисоединенныеФайлы.Ссылка КАК Файл,
		|	ЛичныеДанныеКандидатов.Ссылка КАК БывшийВладелец,
		|	ЛичныеДанныеКандидатов.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатовПрисоединенныеФайлы КАК ЛичныеДанныеКандидатовПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЛичныеДанныеКандидатовПрисоединенныеФайлы.Ссылка = ЛичныеДанныеКандидатов.Фотография
		|ГДЕ
		|	ЛичныеДанныеКандидатовПрисоединенныеФайлы.Наименование = &НаименованиеФотография
		|	И ЛичныеДанныеКандидатовПрисоединенныеФайлы.ВладелецФайла = &ЛичныеДанныеКандидата
		|	И ЛичныеДанныеКандидатов.Ссылка <> &ЛичныеДанныеКандидата
		|	И НЕ ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ФайлОбъект = Выборка.Файл.ПолучитьОбъект(); // СправочникОбъект.ЛичныеДанныеКандидатовПрисоединенныеФайлы
		ФайлОбъект.ВладелецФайла = Выборка.БывшийВладелец;
		ФайлОбъект.ПометкаУдаления = Выборка.ПометкаУдаления;
		ФайлОбъект.Записать();
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ПометитьНаУдалениеЛишниеФайлыФотографий(ПараметрыОбновления) Экспорт
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 10000
		|	ЛичныеДанныеКандидатовПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	ЛичныеДанныеКандидатовПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатовПрисоединенныеФайлы КАК ЛичныеДанныеКандидатовПрисоединенныеФайлы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЛичныеДанныеКандидатовПрисоединенныеФайлы.Ссылка = ЛичныеДанныеКандидатов.Фотография
		|ГДЕ
		|	ЛичныеДанныеКандидатовПрисоединенныеФайлы.Наименование = ""Фотография""
		|	И ЛичныеДанныеКандидатов.Ссылка ЕСТЬ NULL
		|	И НЕ ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(
			Метаданные.Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПолноеИмя());
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировкиДанных.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		БлокировкаДанных.Заблокировать();
		
		ФайлыФотографий = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"); // Массив из СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы
		Для Каждого Файл Из ФайлыФотографий Цикл
			ФайлОбъект = Файл.ПолучитьОбъект();
			ФайлОбъект.ПометкаУдаления = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФайлОбъект);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
