#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Самообслуживание сотрудников";
	// АПК:1297-вкл
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Журнал = Метаданные.ЖурналыДокументов.ЗаявкиСотрудников;
	СтатистикаПоДокументам = СборСтатистики.СтандартныеПоказателиПоЖурналу(Журнал, НачалоПериода);
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоДокументам, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

