
#Область СлужебныйПрограммныйИнтерфейс

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.УведомлениеОНачалеОтпускаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОНачалеОтпуска, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.УведомлениеОНачалеОтпускаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОНачалеОтпускаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОНачалеОтпускаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОНачалеОтпускаПрисоединенныеФайлы.Изменение.Организации
	|Документ.УведомлениеОНачалеОтпуска.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОНачалеОтпуска.Чтение.Организации
	|Документ.УведомлениеОНачалеОтпуска.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОНачалеОтпуска.Изменение.Организации";
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.УведомлениеОНачалеОтпуска);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "98e1bc9f-196d-48ec-8396-a1ba84b5c9ab", Метаданные.Документы.УведомлениеОНачалеОтпуска);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти