
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭтапа = Параметры.ИдентификаторТекущегоЭтапа;
	ВладелецЭтапа = Параметры.ВладелецЭтапа;
	ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	ИмяИдентификатораДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента, "ПолноеИмя");
	
	ТекущийЭтапСтрокой = "№" + Параметры.НомерТекущегоЭтапа + " " + Параметры.НаименованиеТекущегоЭтапа;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Влияние этапа ""%1"" на другие процессы'"),
		ТекущийЭтапСтрокой);
	
	ЗаполнитьСписокРезультатовВыполнения();
	
	ЗаполнитьСписокПодключаемыхФункций();
	
	Для Каждого Влияние Из Параметры.ВлияниеНаДругиеПроцессы Цикл
		НоваяСтрока = ВлияниеНаДругиеПроцессы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Влияние.Значение);
		
		ЭлементСпискаРезультатовВыполнения = Элементы.ВлияниеПредставлениеРезультатаВыполнения.СписокВыбора.НайтиПоЗначению(НоваяСтрока.Статус);
		Если ЭлементСпискаРезультатовВыполнения = Неопределено Тогда
			НоваяСтрока.ПредставлениеРезультатаВыполнения = НСтр("ru = 'Отстуствует статус: '") + НоваяСтрока.Статус;
			НоваяСтрока.СтатусНеНайден = Истина;
		Иначе
			НоваяСтрока.ПредставлениеРезультатаВыполнения = ЭлементСпискаРезультатовВыполнения.Представление;
		КонецЕсли;
		
		ПараметрыШаблона = ПараметрыЗависимогоШаблона(НоваяСтрока.ЗависимыйШаблон, ИдентификаторДокумента, ПодключаемыеФункции);
		
		Для Каждого Элемент Из ПараметрыШаблона.СписокВыбораЭтапов Цикл
			НоваяСтрокаСпискаВыбора = НоваяСтрока.СписокЭтаповШаблона.Добавить();
			НоваяСтрокаСпискаВыбора.Номер = Элемент.Номер;
			НоваяСтрокаСпискаВыбора.Этап = Элемент.Этап;
			НоваяСтрокаСпискаВыбора.Наименование = Элемент.Наименование;
			НоваяСтрокаСпискаВыбора.Идентификатор = Элемент.Идентификатор;
		КонецЦикла;
		
		ЗаполнитьЭтапИПредставлениеЭтапаПоИдентификатору(
			НоваяСтрока.Этап,
			НоваяСтрока.ПредставлениеЭтапа,
			НоваяСтрока.ИдентификаторЭтапаЗависимогоШаблона,
			НоваяСтрока.СписокЭтаповШаблона);
		
		ЗаполнитьСпискиРезультатовИВыбораРезультатовЭтапа(НоваяСтрока.Этап, НоваяСтрока.СписокРезультатовВыполнения);
		
		НоваяСтрока.СписокСвязейПоРеквизитам = ПараметрыШаблона.СписокСвязейПоРеквизитам;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ВлияниеНаДругиеПроцессы

&НаКлиенте
Процедура ВлияниеПредставлениеРезультатаВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные.Статус = ВыбранноеЗначение;
	Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные.ПредставлениеРезультатаВыполнения = Строка(ВыбранноеЗначение);
	Для Каждого ЭлементСпискаВыбора Из Элементы.ВлияниеПредставлениеРезультатаВыполнения.СписокВыбора Цикл
		Если ЭлементСпискаВыбора.Значение = ВыбранноеЗначение Тогда
			Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные.ПредставлениеРезультатаВыполнения = 
				ЭлементСпискаВыбора.Представление;
		КонецЕсли;
	КонецЦикла;
	Элементы.ВлияниеНаДругиеПроцессы.ЗакончитьРедактированиеСтроки(Ложь);
	
	Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные.СтатусНеНайден = Ложь;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеЗависимыйШаблонПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные;
	
	ТекущиеДанные.Этап = "";
	ТекущиеДанные.ИдентификаторЭтапаЗависимогоШаблона = "";
	ТекущиеДанные.ПредставлениеЭтапа = "";
	ТекущиеДанные.УстанавливаемыйСтатус = "";
	ТекущиеДанные.СвязьСОбъектом = "";
	
	ПараметрыШаблона = ПараметрыЗависимогоШаблона(ТекущиеДанные.ЗависимыйШаблон, ИдентификаторДокумента, ПодключаемыеФункции);
	
	ТекущиеДанные.СписокЭтаповШаблона.Очистить();
	Для Каждого Элемент Из ПараметрыШаблона.СписокВыбораЭтапов Цикл
		НоваяСтрока = ТекущиеДанные.СписокЭтаповШаблона.Добавить();
		НоваяСтрока.Номер = Элемент.Номер;
		НоваяСтрока.Этап = Элемент.Этап;
		НоваяСтрока.Наименование = Элемент.Наименование;
		НоваяСтрока.Идентификатор = Элемент.Идентификатор;
	КонецЦикла;
	
	Элементы.ВлияниеПредставлениеЭтапа.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаЭтапов Из ТекущиеДанные.СписокЭтаповШаблона Цикл
		Элементы.ВлияниеПредставлениеЭтапа.СписокВыбора.Добавить(ЭлементСпискаЭтапов.Идентификатор,
											Строка(ЭлементСпискаЭтапов.Номер)+". "+ЭлементСпискаЭтапов.Наименование);
	КонецЦикла;
	
	ТекущиеДанные.СписокСвязейПоРеквизитам = ПараметрыШаблона.СписокСвязейПоРеквизитам;
	
	Элементы.ВлияниеСвязьСОбъектом.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаСвязи Из ТекущиеДанные.СписокСвязейПоРеквизитам Цикл
		Элементы.ВлияниеСвязьСОбъектом.СписокВыбора.Добавить(ЭлементСпискаСвязи.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеНаДругиеПроцессыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСпискиВыбора(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеПредставлениеЭтапаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные;
	
	ТекущиеДанные.ИдентификаторЭтапаЗависимогоШаблона = ВыбранноеЗначение;
	ЗаполнитьЭтапИПредставлениеЭтапаПоИдентификатору(ТекущиеДанные.Этап,
													ВыбранноеЗначение,
													ТекущиеДанные.ИдентификаторЭтапаЗависимогоШаблона,
													ТекущиеДанные.СписокЭтаповШаблона)
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеПредставлениеЭтапаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные;
	
	ЗаполнитьСпискиРезультатовИВыбораРезультатовЭтапа(ТекущиеДанные.Этап, ТекущиеДанные.СписокРезультатовВыполнения);
	
	Элементы.ВлияниеУстанавливаемыйСтатус.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаРезультатовВыполнения Из ТекущиеДанные.СписокРезультатовВыполнения Цикл
		Элементы.ВлияниеУстанавливаемыйСтатус.СписокВыбора.Добавить(ЭлементСпискаРезультатовВыполнения.Значение,
															ЭлементСпискаРезультатовВыполнения.Представление);
	КонецЦикла;
	
	Если Элементы.ВлияниеУстанавливаемыйСтатус.СписокВыбора.НайтиПоЗначению(ТекущиеДанные.УстанавливаемыйСтатус) = Неопределено Тогда
		ТекущиеДанные.УстанавливаемыйСтатус = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеНаДругиеПроцессыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Копирование Тогда
		ОбновитьСпискиВыбора(Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеНаДругиеПроцессыПослеУдаления(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
КонецПроцедуры

&НаКлиенте
Процедура ВлияниеПредставлениеРезультатаВыполненияОчистка(Элемент, СтандартнаяОбработка)
	
	Элементы.ВлияниеНаДругиеПроцессы.ТекущиеДанные.Статус = "";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОчиститьСообщения();
	
	ВлияниеНаПроцессы = Новый СписокЗначений;
	
	Для Каждого Влияние Из ВлияниеНаДругиеПроцессы Цикл
		Если НЕ ЗначениеЗаполнено(Влияние.Статус)
			ИЛИ НЕ ЗначениеЗаполнено(Влияние.ЗависимыйШаблон)
			ИЛИ НЕ ЗначениеЗаполнено(Влияние.ИдентификаторЭтапаЗависимогоШаблона)
			ИЛИ НЕ ЗначениеЗаполнено(Влияние.УстанавливаемыйСтатус)
			ИЛИ НЕ ЗначениеЗаполнено(Влияние.СвязьСОбъектом) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'В каждой строке таблицы должны быть заполнены все поля.'"));
			Возврат;
		КонецЕсли;
		
		ДанныеВлияния = Новый Структура;
		ДанныеВлияния.Вставить("Статус", 								Влияние.Статус);
		ДанныеВлияния.Вставить("ЗависимыйШаблон", 						Влияние.ЗависимыйШаблон);
		ДанныеВлияния.Вставить("ИдентификаторЭтапаЗависимогоШаблона", 	Влияние.ИдентификаторЭтапаЗависимогоШаблона);
		ДанныеВлияния.Вставить("УстанавливаемыйСтатус", 				Влияние.УстанавливаемыйСтатус);
		ДанныеВлияния.Вставить("СвязьСОбъектом", 						Влияние.СвязьСОбъектом);
		ВлияниеНаПроцессы.Добавить(ДанныеВлияния);
	КонецЦикла;
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа);
	ДанныеВозврата.Вставить("ВлияниеНаДругиеПроцессы", ВлияниеНаПроцессы);
	ДанныеВозврата.Вставить("УдаленыНесуществующиеСтатусы", НЕ ВНастройкеЕстьОтсутствующиеСтатусы());
	
	ДанныеВозврата.Вставить("ИмяНастройки", "НастройкаВлиянияНаДругиеПроцессы");
	
	ОповеститьОВыборе(ДанныеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокРезультатовВыполнения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.ПредставлениеРезультата КАК ПредставлениеРезультата,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Статус
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Параметры.ТекущийЭтап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ВлияниеПредставлениеРезультатаВыполнения.СписокВыбора.Добавить(Выборка.Статус, Выборка.ПредставлениеРезультата+" ("+Выборка.Статус+")");
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыЗависимогоШаблона(Шаблон, ИдентификаторДокумента, Знач ПодключаемыеФункции)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовЭтапы.НомерСтроки КАК Номер,
	|	ШаблоныПроцессовЭтапы.Этап КАК Этап,
	|	ШаблоныПроцессовЭтапы.Этап.Наименование КАК Наименование,
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК Идентификатор
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.Ссылка = &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	МассивСтруктур = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Номер", Выборка.Номер);
		Структура.Вставить("Этап", Выборка.Этап);
		Структура.Вставить("Наименование", Выборка.Наименование);
		Структура.Вставить("Идентификатор", Выборка.Идентификатор);
		МассивСтруктур.Добавить(Структура);
	КонецЦикла;
	
	СписокСвязейПоРеквизитам = Новый СписокЗначений;
	
	СвойстваИдентификатораЗависимогоДокумента =ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Шаблон, "ИдентификаторДокумента.ПолноеИмя, ИдентификаторДокумента.ЗначениеПустойСсылки");
	
	ИмяИдентификатораЗависимогоДокумента = СвойстваИдентификатораЗависимогоДокумента.ИдентификаторДокументаПолноеИмя;
	
	ТипЗависимогоДокумента = ТипЗнч(СвойстваИдентификатораЗависимогоДокумента.ИдентификаторДокументаЗначениеПустойСсылки);
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		Если Реквизит.Тип.СодержитТип(ТипЗависимогоДокумента) Тогда
			СписокСвязейПоРеквизитам.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипЗависимогоДокумента) Тогда
				СписокСвязейПоРеквизитам.Добавить(ТабличнаяЧасть.Имя+"."+Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ПодключаемаяФункция Из ПодключаемыеФункции Цикл
		Если СтрНайти(ПодключаемаяФункция.ЗависимыеОбъектыМетаданных, ИмяИдентификатораЗависимогоДокумента) > 0 Тогда
			СписокСвязейПоРеквизитам.Добавить(ПодключаемаяФункция.Идентификатор, ПодключаемаяФункция.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("СписокВыбораЭтапов", МассивСтруктур);
	Результат.Вставить("СписокСвязейПоРеквизитам", СписокСвязейПоРеквизитам);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСпискиВыбора(ТекущиеДанные)
	
	Элементы.ВлияниеПредставлениеЭтапа.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаЭтапов Из ТекущиеДанные.СписокЭтаповШаблона Цикл
		Элементы.ВлияниеПредставлениеЭтапа.СписокВыбора.Добавить(ЭлементСпискаЭтапов.Идентификатор,
											Строка(ЭлементСпискаЭтапов.Номер)+". "+ЭлементСпискаЭтапов.Наименование);
	КонецЦикла;
	
	Элементы.ВлияниеУстанавливаемыйСтатус.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаРезультатовВыполнения Из ТекущиеДанные.СписокРезультатовВыполнения Цикл
		Элементы.ВлияниеУстанавливаемыйСтатус.СписокВыбора.Добавить(ЭлементСпискаРезультатовВыполнения.Значение,
															ЭлементСпискаРезультатовВыполнения.Представление);
	КонецЦикла;
	
	Элементы.ВлияниеСвязьСОбъектом.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаСвязи Из ТекущиеДанные.СписокСвязейПоРеквизитам Цикл
		Элементы.ВлияниеСвязьСОбъектом.СписокВыбора.Добавить(ЭлементСпискаСвязи.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьЭтапИПредставлениеЭтапаПоИдентификатору(Этап, ПредставлениеЭтапа, Идентификатор, СписокЭтаповШаблона)
	
	СтрокаШаблона = СписокЭтаповШаблона.НайтиСтроки(Новый Структура("Идентификатор",Идентификатор));
	Если СтрокаШаблона.Количество() > 0 Тогда
		Этап = СтрокаШаблона[0].Этап;
		ПредставлениеЭтапа = Строка(СтрокаШаблона[0].Номер)+". "+СтрокаШаблона[0].Наименование;
	Иначе
		Этап = "";
		ПредставлениеЭтапа = "";
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСпискиРезультатовИВыбораРезультатовЭтапа(Этап, СписокРезультатовВыполнения)
	
	СписокРезультатовВыполнения = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка КАК Ссылка,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК СтатусПослеВыполнения,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения.Наименование КАК СтатусПослеВыполненияНаименование
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Этап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокРезультатовВыполнения.Добавить(Выборка.СтатусПослеВыполнения, Выборка.СтатусПослеВыполненияНаименование);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПодключаемыхФункций()
	
	ПодключаемыеФункции.Очистить();
	
	ОписаниеФункций = ПроцессыОбработкиДокументов.ОписаниеФункцийПоискаЗависимыхОбъектов();
	Для Каждого ОписаниеФункции Из ОписаниеФункций Цикл
		
		ДобавитьВСписокВыбора = Ложь;
		
		ИменаВлияющихОбъектовМетаданных = СтрРазделить(ОписаниеФункции.ВлияющиеОбъектыМетаданных, "," + Символы.ПС, Ложь);
		Если ИменаВлияющихОбъектовМетаданных.Количество() > 0 Тогда
			Для Каждого ИмяОбъектаМетаданных Из ИменаВлияющихОбъектовМетаданных Цикл
				Если ИмяОбъектаМетаданных = ИмяИдентификатораДокумента Тогда
					ДобавитьВСписокВыбора = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ДобавитьВСписокВыбора Тогда
			НоваяСтрока = ПодключаемыеФункции.Добавить();
			НоваяСтрока.Идентификатор = "(функция) "+ОписаниеФункции.Идентификатор;
			НоваяСтрока.Представление = ОписаниеФункции.Представление + НСтр("ru = ' (функция)'");
			НоваяСтрока.ЗависимыеОбъектыМетаданных = ОписаниеФункции.ЗависимыеОбъектыМетаданных;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВНастройкеЕстьОтсутствующиеСтатусы()
	
	Для Каждого Влияние Из ВлияниеНаДругиеПроцессы Цикл
		Если Влияние.СтатусНеНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
