#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	МодульКонтракта().ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ДепонированиеЗарплатыФормыБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ДепонированиеЗарплатыФормыРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
