#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"СпециальнаяОценкаУсловийТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приказ о создании комиссии
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.ДекларацияСоответствияУсловийТруда";
	КомандаПечати.Идентификатор = "ДекларацияСоответствияУсловийТруда";
	КомандаПечати.Представление = НСтр("ru = 'Декларация соответствия условий труда'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ДекларацияСоответствияУсловийТруда") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ДекларацияСоответствияУсловийТруда",
			НСтр("ru = 'Декларация соответствия условий труда'"),
			ПечатьФормаОтчета(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьФормаОтчета(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДекларацияСоответствияУсловийТруда_ФормаОтчета";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ДекларацияСоответствияУсловийТруда." + ДанныеДокумента.ИмяМакета);
		
		ОсновнаяЧасть1 = Макет.ПолучитьОбласть("ОсновнаяЧасть1");
		ОсновнаяЧасть1.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОсновнаяЧасть1);
		
		МногострочнаяЧасть = Макет.ПолучитьОбласть("МногострочнаяЧасть");
		Для Каждого СтрокаРабочегоМеста Из ДанныеДокумента.МассивРабочихМест Цикл
			МногострочнаяЧасть.Параметры.РабочееМесто_Численность = СтрокаРабочегоМеста;
			ТабличныйДокумент.Вывести(МногострочнаяЧасть);
		КонецЦикла;
		
		ОсновнаяЧасть2 = Макет.ПолучитьОбласть("ОсновнаяЧасть2");
		ОсновнаяЧасть2.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОсновнаяЧасть2);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ключ);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ДатаФормы2017", ОхранаТруда.ДатаВступленияВСилуФормыДекларации2017Года());
	Запрос.УстановитьПараметр("ДатаФормы2022", ОхранаТруда.ДатаВступленияВСилуФормыДекларации2022Года());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДекларацияСоответствияУсловийТруда.Ссылка КАК Документ,
	|	ДекларацияСоответствияУсловийТруда.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ДекларацияСоответствияУсловийТруда.ДатаПодачи < &ДатаФормы2017
	|			ТОГДА ""ФормаОтчета2014Кв1_ФормаОтчета""
	|		КОГДА ДекларацияСоответствияУсловийТруда.ДатаПодачи < &ДатаФормы2022
	|			ТОГДА ""ФормаОтчета2017Кв1_ФормаОтчета""
	|		ИНАЧЕ ""ФормаОтчета2022Кв1_ФормаОтчета""
	|	КОНЕЦ КАК ИмяМакета,
	|	ДекларацияСоответствияУсловийТруда.Организация КАК Организация,
	|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ДекларацияСоответствияУсловийТруда.Исполнитель.НаименованиеПолное КАК ОПСОУТ,
	|	ДекларацияСоответствияУсловийТруда.Руководитель КАК Руководитель,
	|	ДекларацияСоответствияУсловийТруда.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ДекларацияСоответствияУсловийТруда.РеквизитыЗаключенияЭксперта КАК РеквизитыЗаключенияЭксперта,
	|	ДекларацияСоответствияУсловийТруда.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ЕСТЬNULL(ДекларацияСоответствияУсловийТрудаРабочиеМеста.РабочееМесто, НЕОПРЕДЕЛЕНО) КАК РабочееМесто,
	|	ЕСТЬNULL(ДекларацияСоответствияУсловийТрудаРабочиеМеста.Численность, 0) КАК Численность
	|ИЗ
	|	Документ.ДекларацияСоответствияУсловийТруда КАК ДекларацияСоответствияУсловийТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДекларацияСоответствияУсловийТруда.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДекларацияСоответствияУсловийТруда.РабочиеМеста КАК ДекларацияСоответствияУсловийТрудаРабочиеМеста
	|		ПО ДекларацияСоответствияУсловийТруда.Ссылка = ДекларацияСоответствияУсловийТрудаРабочиеМеста.Ссылка
	|ГДЕ
	|	ДекларацияСоответствияУсловийТруда.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ,
	|	РабочееМесто";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Документ") Цикл
		
		ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		ДанныеПечати.Вставить("ДатаПодписи", Формат(Выборка.ДатаДокумента, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("ОПСОУТ_РегистрационныйНомер", Выборка.ОПСОУТ + ", №" + Выборка.РегистрационныйНомер);
		
		// ФИОРуководителя
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.Руководитель, "ФамилияИО, Пол, Фамилия", ОбщегоНазначения.ТекущаяДатаПользователя());
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ФИОРуководителя", СтрокаКадровыхДанных.ФамилияИО);
			ДанныеПечати.Вставить("ПолРуководителя", СтрокаКадровыхДанных.Пол);
			ДанныеПечати.Вставить("ФамилияРуководителя", СтрокаКадровыхДанных.Фамилия);
		КонецЦикла;
		
		// Фактический адрес организации
		ДанныеПечати.Вставить("ОрганизацияФактическийАдрес", УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			Выборка.Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, , Выборка.ДатаДокумента));
		
		// Сведения об организации
		СведенияОбОрганизации = ЗарплатаКадры.СведенияОбОрганизации(Выборка.Организация, "ИННЮЛ, ОГРН");
		ДанныеПечати.Вставить("ИНН_ОГРН_Организации", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'ИНН %1, ОГРН %2'"),
				СведенияОбОрганизации.ИННЮЛ, СведенияОбОрганизации.ОГРН));
		
		МассивРабочихМест = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ОкончаниеРаботников = "";
			Если Выборка.Численность > 4 И Выборка.Численность <= 20 Тогда
				ОкончаниеРаботников = НСтр("ru = 'ов'");
			ИначеЕсли Прав(Выборка.Численность, 1) = "1" Тогда
				ОкончаниеРаботников = "";
			ИначеЕсли Число(Прав(Выборка.Численность, 1)) >= 2 И Число(Прав(Выборка.Численность, 1)) <= 4 Тогда
				ОкончаниеРаботников = НСтр("ru = 'а'");
			Иначе
				ОкончаниеРаботников = НСтр("ru = 'ов'");
			КонецЕсли;
			СтрокаРабочегоМеста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, на котором занят%3 %2 работник%4'"),
				Выборка.РабочееМесто, Выборка.Численность, ?(Выборка.Численность = 1, "", НСтр("ru = 'ы'")), ОкончаниеРаботников);
			МассивРабочихМест.Добавить(СтрокаРабочегоМеста);
		КонецЦикла;
		ДанныеПечати.Вставить("МассивРабочихМест", МассивРабочихМест);
		
		// Заполнение соответствия
		ДанныеПечатиОбъектов.Вставить(Выборка.Документ, ДанныеПечати);
		
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

#КонецОбласти

Функция ОписаниеПодписейДокумента() Экспорт 
	
	ОписаниеПодписей = ПодписиДокументов.ОписаниеТаблицыПодписей();
	
	ПодписиДокументов.ДобавитьОписаниеПодписейОрганизации(ОписаниеПодписей, "Руководитель");
	
	Возврат ОписаниеПодписей;
		
КонецФункции

#КонецОбласти

#КонецЕсли