#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК Т1
	|	ПО Т1.Кандидат.ЛичныеДанные = Т.Ссылка
	|;
	|
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	(ГруппаДоступа = ЗНАЧЕНИЕ(Справочник.ГруппыДоступаКандидатов.ПустаяСсылка)
	|	И ДляВсехСтрок(Т1.ЭтапРаботы = ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика) ИЛИ Т1.ЭтапРаботы ЕСТЬ NULL))
	|	ИЛИ ЗначениеРазрешено(Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Заполнить данные для электронного тестирования кандидата.
// 
// Параметры:
//  ДанныеДляЗаполнения - Структура: см. ЭлектронноеТестированиеКандидатов.НовыйДанныеДляФормыЭлектронногоТестированияКандидата
//  Учащийся - СправочникСсылка.ЛичныеДанныеКандидатов
Процедура ЗаполнитьДанныеДляЭлектронногоТестированияКандидата(ДанныеДляЗаполнения, Учащийся) Экспорт
	
	ТаблицаКандидатов = Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Учащийся));

	Если ТаблицаКандидатов.Количество() > 0 Тогда
		ДанныеДляЗаполнения.ИмяОтчество = СтрШаблон("%1 %2", ТаблицаКандидатов[0].Имя, ТаблицаКандидатов[0].Отчество);
		ДанныеДляЗаполнения.Кандидат = ТаблицаКандидатов[0].Кандидат;
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИсторияВзаимоотношений", Истина);
	Методы.Вставить("ЗаполнитьФИОСлужебныеСБуквамиЕЁ");
	Методы.Вставить("ЗаполнитьМессенджерыКандидатов");
КонецПроцедуры

#КонецОбласти

#Область КонструкторыСтруктурХранения

// Возвращает структуру для описания личных данных кандидата
//
// Возвращаемое значение:
//  Структура - Новые данные кандидата:
//   * ФИО - Строка -
//   * Фамилия - Строка -
//   * Имя - Строка -
//   * Отчество - Строка -
//   * УточнениеНаименования - Строка -
//   * ДатаРождения - Дата -
//   * МестоРождения - Строка -
//   * Пол - ПеречислениеСсылка.ПолФизическогоЛица -
//   * СостояниеВБраке - СправочникСсылка.СостояниеВБраке -
//   * Гражданство - СправочникСсылка.СтраныМира -
//   * Фотография - СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы -
//   * ГруппаДоступа - СправочникСсылка.ГруппыДоступаКандидатов -
//   * ЗнаниеЯзыков - Массив из Структура -
//   * Образование - Массив из Структура -
//   * Курсы - Массив из Структура -
//   * УченыеСтепени - Массив из Структура -
//   * ОпытРаботы - Массив из Структура -
Функция НовыеДанныеКандидата() Экспорт
	
	ДанныеКандидата = Новый Структура;
	
	ДанныеКандидата.Вставить("ФИО", "");
	ДанныеКандидата.Вставить("Фамилия", "");
	ДанныеКандидата.Вставить("Имя", "");
	ДанныеКандидата.Вставить("Отчество", "");
	ДанныеКандидата.Вставить("УточнениеНаименования", "");
	ДанныеКандидата.Вставить("ДатаРождения", Дата(1, 1, 1));
	ДанныеКандидата.Вставить("МестоРождения", "");
	ДанныеКандидата.Вставить("Пол", Перечисления.ПолФизическогоЛица.Мужской);
	ДанныеКандидата.Вставить("СостояниеВБраке", Справочники.СостояниеВБраке.ПустаяСсылка());
	ДанныеКандидата.Вставить("Гражданство", Справочники.СтраныМира.Россия);
	ДанныеКандидата.Вставить("Фотография", Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка());
	ДанныеКандидата.Вставить("ГруппаДоступа", Справочники.ГруппыДоступаКандидатов.ПустаяСсылка());
	
	ДанныеКандидата.Вставить("ЗнаниеЯзыков", Новый Массив);
	ДанныеКандидата.Вставить("Образование", Новый Массив);
	ДанныеКандидата.Вставить("Курсы", Новый Массив);
	ДанныеКандидата.Вставить("УченыеСтепени", Новый Массив);
	ДанныеКандидата.Вставить("ОпытРаботы", Новый Массив);
	
	Возврат ДанныеКандидата;
	
КонецФункции

// Возвращает структуру для описания данных об образовании физического лица.
// 
// Возвращаемое значение:
//  Структура:
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Факультет - Строка -
//   * Квалификация - Строка -
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * НаименованиеКурса - Строка -
//   * Окончание - Число
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидПослевузовскогоОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидДополнительногоОбучения - ПеречислениеСсылка.ВидыПрофессиональнойПодготовки
Функция НовоеОбразованиеДляФизическогоЛица() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("Факультет", "");
	Образование.Вставить("Квалификация", "");
	Образование.Вставить("Специальность", Справочники.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка());
	Образование.Вставить("НаименованиеКурса", "");
	Образование.Вставить("Окончание", Год(ТекущаяДатаСеанса()));
	Образование.Вставить("ВидОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("ВидПослевузовскогоОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("ВидДополнительногоОбучения", Перечисления.ВидыПрофессиональнойПодготовки.ПустаяСсылка());
	Образование.Вставить("СкрыватьТ2", Ложь);
	Образование.Вставить("СрокДействия", Дата(1,1,1));
	Образование.Вставить("ЭлектронныйСертификат", "");
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных об образовании.
// 
// Возвращаемое значение:
//  Структура:
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * Факультет - Строка -
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * ГодОкончания - Число
Функция НовоеОбразование() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("ВидОбразования", Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка());
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("Факультет", "");
	Образование.Вставить("Специальность", Справочники.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка());
	Образование.Вставить("ГодОкончания", Год(ТекущаяДатаСеанса()));
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных о пройденных курсах.
// 
// Возвращаемое значение:
//  Структура:
//   * НаименованиеКурса - Строка
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * ГодОкончания - Число
//   * ДополнительнаяИнформация - Строка
Функция НовыйКурсы() Экспорт
	
	Образование = Новый Структура;
	
	Образование.Вставить("НаименованиеКурса", "");
	Образование.Вставить("УчебноеЗаведение", Справочники.УчебныеЗаведения.ПустаяСсылка());
	Образование.Вставить("ГодОкончания", Год(ТекущаяДатаСеанса()));
	Образование.Вставить("ДополнительнаяИнформация", "");
	
	Возврат Образование;
	
КонецФункции

// Возвращает структуру для описания данных об опыте работы.
// 
// Возвращаемое значение:
//  Структура:
//   * Компания - Строка -
//   * Период - Дата -
//   * ДатаНачала - Дата -
//   * ДатаОкончания - Дата -
//   * Должность - Строка -
//   * Обязанности - Строка -
//   * СфераДеятельностиКомпании - Строка -
Функция НовыйОпытРаботы() Экспорт
	
	ОпытРаботы = Новый Структура;
	ОпытРаботы.Вставить("Компания", "");
	ОпытРаботы.Вставить("Период", Дата(1, 1, 1));
	ОпытРаботы.Вставить("ДатаНачала", Дата(1, 1, 1));
	ОпытРаботы.Вставить("ДатаОкончания", Дата(1, 1, 1));
	ОпытРаботы.Вставить("Должность", "");
	ОпытРаботы.Вставить("Обязанности", "");
	ОпытРаботы.Вставить("СфераДеятельностиКомпании", "");
	
	Возврат ОпытРаботы;
	
КонецФункции

// Возвращает структуру для описания знания языка кандидата.
// 
// Возвращаемое значение:
//  Структура:
//   * Язык - СправочникСсылка.ЯзыкиНародовМира -
//   * СтепеньЗнанияЯзыкаКандидата - СправочникСсылка.СтепениЗнанияЯзыкаКандидата -
Функция НовоеЗнаниеЯзыка() Экспорт
	
	ЗнаниеЯзыка = Новый Структура;
	ЗнаниеЯзыка.Вставить("Язык", Справочники.ЯзыкиНародовМира.ПустаяСсылка());
	ЗнаниеЯзыка.Вставить("СтепеньЗнанияЯзыкаКандидата", Справочники.СтепениЗнанияЯзыкаКандидата.ПустаяСсылка());
	
	Возврат ЗнаниеЯзыка;
	
КонецФункции

// Возвращает структуру для описания ученой степени кандидата.
// 
// Возвращаемое значение:
//  Структура:
//   * УченаяСтепень - СправочникСсылка.УченыеСтепени
//   * ДатаПрисужденияУченойСтепени - Дата
Функция НоваяУченаяСтепень() Экспорт
	
	УченаяСтепень = Новый Структура;
	УченаяСтепень.Вставить("УченаяСтепень", Справочники.УченыеСтепени.ПустаяСсылка());
	УченаяСтепень.Вставить("ДатаПрисужденияУченойСтепени", Дата(1, 1, 1));
	
	Возврат УченаяСтепень;
	
КонецФункции

#КонецОбласти

#Область ОбъединениеДублей

// Возвращает дерево значений с информацией о найденных дублях.
// 
// Возвращаемое значение:
//  ДеревоЗначений
Функция ДеревоДублей() Экспорт
	
	ДеревоДублей = Новый ДеревоЗначений();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодборПерсонала.СоздатьВТЗадублированныеКандидаты(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗадублированныеКандидаты.ОбластьПоиска КАК ОбластьПоиска,
		|	ЗадублированныеКандидаты.Значение КАК Значение,
		|	ЗадублированныеКандидаты.ЛичныеДанныеКандидата КАК Дубль,
		|	ЗадублированныеКандидаты.Представление КАК Представление,
		|	ЗадублированныеКандидаты.ФИО КАК ФИО,
		|	ЗадублированныеКандидаты.Телефон КАК Телефон,
		|	ЗадублированныеКандидаты.EMail КАК EMail,
		|	ЗадублированныеКандидаты.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТЗадублированныеКандидаты КАК ЗадублированныеКандидаты
		|ИТОГИ
		|	МАКСИМУМ(ФИО),
		|	МАКСИМУМ(Телефон),
		|	МАКСИМУМ(EMail),
		|	МАКСИМУМ(ФизическоеЛицо)
		|ПО
		|	ОбластьПоиска,
		|	Значение";
		
	ДеревоДублей = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);

	Возврат ДеревоДублей;
		
КонецФункции

// См. Обработки.ОбъединениеДублейПерсональныхДанных.ДополнитьКолонкиТаблицыПоискаДублей
Процедура ДополнитьКолонкиТаблицыПоискаДублей(ОписанияКолонок) Экспорт
	
	ОписанияКолонок.Добавить(Обработки.ОбъединениеДублейПерсональныхДанных.ОписаниеКолонки("Телефон",
		Новый ОписаниеТипов("Строка"), НСтр("ru = 'Телефон'")));
		
	ОписанияКолонок.Добавить(Обработки.ОбъединениеДублейПерсональныхДанных.ОписаниеКолонки("EMail",
		Новый ОписаниеТипов("Строка"), НСтр("ru = 'E-mail'")));
		
	ОписанияКолонок.Добавить(Обработки.ОбъединениеДублейПерсональныхДанных.ОписаниеКолонки("ФизическоеЛицо",
		Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"), НСтр("ru = 'Физическое лицо'")));
		
КонецПроцедуры

// См. Обработки.ОбъединениеДублейПерсональныхДанных.ДанныеДублей
Функция ДанныеДублей(Дубли) Экспорт
	
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(Дубли,
		Тип("СправочникСсылка.ЛичныеДанныеКандидатов"));
	
	ДанныеДублей = ПодборПерсонала.ОсновныеСведенияОЛичныхДанныхКандидатов(Дубли);
	ДанныеДублей.Колонки.Добавить("Дубль", Метаданные.ОпределяемыеТипы.СубъектПерсональныхДанных.Тип);
	
	Для Каждого СтрокаТаблицы Из ДанныеДублей Цикл
		СтрокаТаблицы.Дубль = СтрокаТаблицы.ЛичныеДанныеКандидата;
		СтрокаТаблицы.Телефон = ПоискФизическихЛиц.ТелефонВФорматеПоиска(СтрокаТаблицы.Телефон);
	КонецЦикла;
		
	Возврат ДанныеДублей;
	
КонецФункции

// Возвращает параметры получения данных дублей личных данных кандидатов.
// 
// Параметры:
//  Дубли - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  см. Обработки.ОбъединениеДублейПерсональныхДанных.НовыеПараметрыПолученияДанныхНайденныхДублей
Функция ПараметрыПолученияДанныхДублей(Дубли) Экспорт
	
	Параметры = Обработки.ОбъединениеДублейПерсональныхДанных.НовыеПараметрыПолученияДанныхНайденныхДублей();
	Параметры.МетаданныеОбъекта = Метаданные.Справочники.ЛичныеДанныеКандидатов;
	Параметры.ИмяКолонкиОбъекта = "ЛичныеДанныеКандидата";
	Параметры.ОписанияТабличныхЧастей = ОписанияСравниваемыхТабличныхЧастей();
	Параметры.Дубли = Дубли;
	Параметры.ОсновныеДанные = ОсновныеДанныеДублей(Дубли);
	
	Возврат Параметры;
	
КонецФункции

// Выполняет дополнительные действия при объединении дублей физических лиц.
// 
// Параметры:
//  ОставляемыйДубль - СправочникСсылка.ФизическиеЛица
//  ДанныеДляОбъединения - ДеревоЗначений - данные, которыми будет заполнен оставляемый дубль:
//   * Поле - Строка
//   * Значение - Произвольный
//  ДополнительныеПараметры - Структура, Неопределено - 
Процедура ПриОбъединенииДублей(ОставляемыйДубль, ДанныеДляОбъединения, ДополнительныеПараметры) Экспорт
	
	Обработки.ОбъединениеДублейПерсональныхДанных.ОбработатьРегистрыСведений(ОставляемыйДубль,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ЛичныеДанныеКандидата"), ДанныеДляОбъединения);
		
КонецПроцедуры

// Дополняет массив имен метаданных, исключаемых при замене ссылок на дубли.
// 
// Параметры:
//  ИсключаемыеМетаданные - Массив из Строка
Процедура ДополнитьМетаданныеИсключаемыеПриЗаменеСсылокНаДубли(ИсключаемыеМетаданные) Экспорт
	
	ИсключаемыеМетаданные.Добавить(Метаданные.РегистрыСведений.ФизическиеЛицаКандидатов.ПолноеИмя());
	ИсключаемыеМетаданные.Добавить(Метаданные.РегистрыСведений.ДанныеПоискаФизическихЛиц.ПолноеИмя());
	
КонецПроцедуры

// Выполняет дополнительные действия перед записью оставляемого дубля.
// 
// Параметры:
//  ДубльОбъект - СправочникОбъект.ЛичныеДанныеКандидатов
Процедура ПередЗаписьюОставляемогоДубля(ДубльОбъект) Экспорт
	
	// Если изменилось ФИО, то при заполнении будут актуализированы части имени и наименование.
	ДубльОбъект.Заполнить(Новый Структура("ФИО", ДубльОбъект.ФИО));
	
	// При объединении могла измениться фотография и теперь реквизит Фотография ссылается на присоединенный файл
	// с другим владельцем.
	Если ЗначениеЗаполнено(ДубльОбъект.Фотография) Тогда
		СтараяФотография = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДубльОбъект.Ссылка, "Фотография");
		Если ЗначениеЗаполнено(СтараяФотография) Тогда
			Если ДубльОбъект.Фотография <> СтараяФотография Тогда
				// Возьмем двоичные данные "чужой" фотографии и обновим присоединенный файл с фотографией.
				ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ДубльОбъект.Фотография, Ложь);
				АдресНовойФотографии = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
				РаботаСФайлами.ОбновитьФайл(СтараяФотография,
					Новый Структура("АдресФайлаВоВременномХранилище, АдресВременногоХранилищаТекста",
						АдресНовойФотографии, ""));
				ДубльОбъект.Фотография = СтараяФотография;
			КонецЕсли;
		Иначе
			// Создадим новый файл с фотографией.
			ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ДубльОбъект.Фотография, Ложь);
			АдресНовойФотографии = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
			ДубльОбъект.Фотография = СохраненнаяФотография(ДубльОбъект.Ссылка, АдресНовойФотографии);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет дополнительные действия после объединения дублей.
// 
// Параметры:
//  ОставляемыйДубль - СправочникСсылка.ЛичныеДанныеКандидатов
//  УдаляемыеДубли - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура, Неопределено - 
Процедура ПослеОбъединенияДублей(ОставляемыйДубль, УдаляемыеДубли, ДополнительныеПараметры) Экспорт
	
	ОставляемыйДубль.ПолучитьОбъект().ОбновитьНаименованияКандидатов();
	
	СоответствиеФизическихЛицУдаляемыхДублей = ФизическиеЛицаЛичныхДанныхКандидатов(УдаляемыеДубли);
	
	// Установим связь оставляемого дубля с физическим лицом.
	ФизическоеЛицоОставляемогоДубля = ФизическоеЛицоЛичныхДанныхКандидата(ОставляемыйДубль);
	Если Не ЗначениеЗаполнено(ФизическоеЛицоОставляемогоДубля) Тогда
		ФизическиеЛицаУдаляемыхДублей = ОбщегоНазначения.ВыгрузитьКолонку(СоответствиеФизическихЛицУдаляемыхДублей,
			"Значение", Истина);
		Если ЗначениеЗаполнено(ФизическиеЛицаУдаляемыхДублей) Тогда
			РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(ОставляемыйДубль,
				ФизическиеЛицаУдаляемыхДублей[0]);
		КонецЕсли;
	КонецЕсли;
	
	// Удалим связи удаляемых дублей с физическими лицами.
	Для Каждого КлючЗначение Из СоответствиеФизическихЛицУдаляемыхДублей Цикл
		РегистрыСведений.ФизическиеЛицаКандидатов.УдалитьСвязьКандидатаСФизическимЛицом(КлючЗначение.Ключ);
	КонецЦикла;

	// Пометим на удаление файлы фотографий, пришедшие от дублей.
	Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ИзменитьВладельцевФайловФотографий(ОставляемыйДубль);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтрольВеденияУчета") Тогда
		МодульКонтрольВеденияУчета = ОбщегоНазначения.ОбщийМодуль("КонтрольВеденияУчета");
		Проверка = КонтрольВеденияУчета.ПроверкаПоИдентификатору(
			ПодборПерсоналаПроверки.ИдентификаторГруппыПроверокКонтрольПодбораПерсонала()
				+ ".ПроверкаНаличияДублейЛичныхДанныхКандидатов");
		МодульКонтрольВеденияУчета.ВыполнитьПроверку(Проверка);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает значение, показываемое после объединения дублей.
// 
// Параметры:
//  ОставляемыйДубль - СправочникСсылка.ЛичныеДанныеКандидатов
//
// Возвращаемое значение:
//  СправочникСсылка.Кандидаты, СправочникСсылка.ЛичныеДанныеКандидатов - 
Функция ЗначениеПоказываемоеПослеОбъединенияДублей(ОставляемыйДубль) Экспорт
	
	ТаблицаКандидатов = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОставляемыйДубль));
		
	Если ТаблицаКандидатов.Количество() = 0 Тогда
		ПоказываемоеЗначение = ОставляемыйДубль;
	Иначе
		ПоказываемоеЗначение = ТаблицаКандидатов[0].Кандидат;
	КонецЕсли;
	
	Возврат ПоказываемоеЗначение;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	Кандидат = ПодборПерсонала.СсылкаНаКандидатаПоЛичнымДанным(Параметры.Ключ);
	Если ЗначениеЗаполнено(Кандидат) Тогда
		Параметры.Ключ = Кандидат;
		ВыбраннаяФорма = Метаданные.Справочники.Кандидаты.Формы.ФормаЭлемента;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Заполняет личные данные кандидатов при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьЛичныеДанныеКандидатов(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
		
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.Кандидаты.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ГруппыДоступаКандидатов.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		ТаблицаКандидатов = КандидатыДляОбработки();
		
		Если ТаблицаКандидатов.Количество() = 0 Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ФизическиеЛица = ТаблицаКандидатов.ВыгрузитьКолонку("ФизическоеЛицо");
		
		СоздатьВидыКонтактнойИнформации(ФизическиеЛица);
		
		ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		//@skip-check property-return-type
		ПараметрыСотрудников.СписокФизическихЛиц = ФизическиеЛица;
		ПараметрыСотрудников.РаботникиПоТрудовымДоговорам = Истина;
		ПараметрыСотрудников.РаботникиПоДоговорамГПХ = Истина;
		ПараметрыСотрудников.ВыбрасыватьИсключениеДоступа = Ложь;
		Сотрудники = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыСотрудников);
		ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(Сотрудники, "ФизическоеЛицо");
		
		ФизическиеЛицаИДанныеКандидатов = НовоеСоответствиеФизическихЛицИКандидатов();
			
		Для Каждого СтрокаТаблицы Из ТаблицаКандидатов Цикл
			ФизическоеЛицо = СтрокаТаблицы.ФизическоеЛицо;
			КандидатОбъект = СтрокаТаблицы.Кандидат.ПолучитьОбъект();
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЛичныеДанныеКандидатаСвязанныеСФизлицом) Тогда
				ЛичныеДанныеКандидата = СтрокаТаблицы.ЛичныеДанныеКандидатаСвязанныеСФизлицом;
			ИначеЕсли ЗначениеЗаполнено(ФизическоеЛицо) Тогда
				ЛичныеДанныеКандидата = ФизическиеЛицаИДанныеКандидатов.Получить(ФизическоеЛицо);
				Если ЛичныеДанныеКандидата = Неопределено Тогда
					ЛичныеДанныеКандидата = СоздатьПоФизическомуЛицу(ФизическоеЛицо);
					НайденныеСтроки = Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
					Если НайденныеСтроки.Количество() = 0 И ОбщегоНазначения.СсылкаСуществует(ФизическоеЛицо) Тогда
						ФизическоеЛицоОбъект = ФизическоеЛицо.ПолучитьОбъект();
						ФизическоеЛицоОбъект.УстановитьПометкуУдаления(Истина);
					КонецЕсли;
					ФизическиеЛицаИДанныеКандидатов.Вставить(ФизическоеЛицо, ЛичныеДанныеКандидата);
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
					СтрШаблон(НСтр("ru = 'У кандидата %1 не заполнено физическое лицо'"), СтрокаТаблицы.Кандидат),
					"ЗаполнитьЛичныеДанныеКандидатов");
			КонецЕсли;
			КандидатОбъект.ЛичныеДанные = ЛичныеДанныеКандидата;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(КандидатОбъект, Истина);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Заполнение данных поиска кандидатов при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура:
//    * Обработанные - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//    * ОбработкаЗавершена - Булево
Процедура ЗаполнитьДанныеПоискаКандидатов(ПараметрыОбновления = Неопределено) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	Обработанные = Новый Массив;
		
	Пока Не ПараметрыОбновления.ОбработкаЗавершена Цикл
	
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
			МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		Иначе
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			Продолжить;
		КонецЕсли;
		
		//@skip-check query-in-loop
		Выборка = ДанныеПоискаКандидатовДляОбработки(Обработанные);
		Если Выборка.Количество() = 0 Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			Продолжить;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Ложь);
		
		ЛичныеДанныеКандидатов = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ЛичныеДанныеКандидатов.Добавить(Выборка.ЛичныеДанныеКандидата);
		КонецЦикла;
		МодульПоискФизическихЛиц.ЗаполнитьДанныеПоиска(ЛичныеДанныеКандидатов, ПараметрыОбновления);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, ЛичныеДанныеКандидатов);

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьФИОСлужебныеСБуквамиЕЁ(ПараметрыОбновления) Экспорт 
	
	Запрос = Новый Запрос;
	
	Если ПараметрыОбновления = Неопределено Тогда
		МассивОбновленных = Новый Массив;
	Иначе
		
		Если ПараметрыОбновления.Свойство("МассивОбновленных") Тогда
			МассивОбновленных = ПараметрыОбновления.МассивОбновленных;
		Иначе
			МассивОбновленных = Новый Массив;
			ПараметрыОбновления.Вставить("МассивОбновленных", МассивОбновленных);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивОбновленных", МассивОбновленных);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ТаблицаДанных.Ссылка КАК Ссылка,
		|	ТаблицаДанных.Наименование КАК Наименование,
		|	ТаблицаДанных.НаименованиеСлужебное КАК НаименованиеСлужебное
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ТаблицаДанных
		|ГДЕ
		|	ТаблицаДанных.НаименованиеСлужебное ПОДОБНО ""%ЕЁ%""
		|	И НЕ ТаблицаДанных.Ссылка В (&МассивОбновленных)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Пока Выборка.Следующий() Цикл
		МассивОбновленных.Добавить(Выборка.Ссылка);
		НаименованиеСлужебное = ФизическиеЛицаЗарплатаКадры.НаименованиеСлужебное(Выборка.Наименование);
		Если НаименованиеСлужебное <> Выборка.НаименованиеСлужебное Тогда
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
					ПараметрыОбновления, "Справочник.ЛичныеДанныеКандидатов", "Ссылка", Выборка.Ссылка) Тогда
					
				Продолжить;
			КонецЕсли;
			ОбъектСправочника = Выборка.Ссылка.ПолучитьОбъект();      
			ОбъектСправочника.НаименованиеСлужебное = НаименованиеСлужебное;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура производит попытку заполнения мессенджеров кандидатов по уже созданным доп. контактам
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ЗаполнитьМессенджерыКандидатов(ПараметрыОбновления) Экспорт
	
	// Ищем по идентификатору для формул уже созданные виды контактной ифнформации
	// Проверяем являются ли эти виды контактной информации предопределенными
	// Если нет, добавляем их для переноса данных
	ВидыКонтактнойИнформацииДляСопоставления = Новый Структура;
	ВидыКонтактнойИнформацииДляПереноса = Новый Массив;
	TelegramЛичныеДанныеКандидатов = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "Telegram");
	Если ЗначениеЗаполнено(TelegramЛичныеДанныеКандидатов)
		И TelegramЛичныеДанныеКандидатов <> Справочники.ВидыКонтактнойИнформации.TelegramЛичныеДанныеКандидатов Тогда
		ВидыКонтактнойИнформацииДляСопоставления.Вставить("Telegram", TelegramЛичныеДанныеКандидатов);
		ВидыКонтактнойИнформацииДляПереноса.Добавить(TelegramЛичныеДанныеКандидатов);
	КонецЕсли;
	
	MAXЛичныеДанныеКандидатов = Справочники.ВидыКонтактнойИнформации.НайтиПоРеквизиту("ИдентификаторДляФормул", "Max");
	Если ЗначениеЗаполнено(MAXЛичныеДанныеКандидатов)
		И MAXЛичныеДанныеКандидатов <> Справочники.ВидыКонтактнойИнформации.MAXЛичныеДанныеКандидатов Тогда
		ВидыКонтактнойИнформацииДляСопоставления.Вставить("Max", MAXЛичныеДанныеКандидатов);
		ВидыКонтактнойИнформацииДляПереноса.Добавить(MAXЛичныеДанныеКандидатов);
	КонецЕсли;
	
	Если ВидыКонтактнойИнформацииДляПереноса.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбновления = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Если ПараметрыОбновления.Свойство("Обработанные") Тогда
			Обработанные = ПараметрыОбновления.Обработанные;
		Иначе
			Обработанные = Новый Массив;
			ПараметрыОбновления.Вставить("Обработанные", Обработанные);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформацииДляПереноса", ВидыКонтактнойИнформацииДляПереноса);
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата,
		|	КонтактнаяИнформацияЛДК.Вид КАК ВидКонтактнойИнформацииДляПереноса,
		|	КонтактнаяИнформацияЛДК.Представление КАК ПредставлениеКонтактнойИнформацииДляПереноса
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.КонтактнаяИнформация КАК КонтактнаяИнформацияЛДК
		|		ПО ЛичныеДанныеКандидатов.Ссылка = КонтактнаяИнформацияЛДК.Ссылка
		|		И НЕ ЛичныеДанныеКандидатов.Ссылка В (&Обработанные)
		|		И КонтактнаяИнформацияЛДК.Вид В (&ВидыКонтактнойИнформацииДляПереноса)
		|		И КонтактнаяИнформацияЛДК.Представление <> """"";
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.Кандидаты");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЛичныеДанныеКандидатов");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
				ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Обработанные.Добавить(Выборка.ЛичныеДанныеКандидата);
			Если Выборка.ВидКонтактнойИнформацииДляПереноса = ВидыКонтактнойИнформацииДляСопоставления.Telegram Тогда
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.TelegramЛичныеДанныеКандидатов;
			ИначеЕсли Выборка.ВидКонтактнойИнформацииДляПереноса = ВидыКонтактнойИнформацииДляСопоставления.Max Тогда
				ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.MAXЛичныеДанныеКандидатов;
			Иначе
				Продолжить;
			КонецЕсли;
			ЛичныеДанныеКандидата = Выборка.ЛичныеДанныеКандидата.ПолучитьОбъект();
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(
				ЛичныеДанныеКандидата,
				Выборка.ПредставлениеКонтактнойИнформацииДляПереноса,
				ВидКонтактнойИнформации);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ЛичныеДанныеКандидата);
		КонецЦикла;
		Если ВидыКонтактнойИнформацииДляСопоставления.Свойство("Telegram") Тогда
			TelegramДляУдаления = ВидыКонтактнойИнформацииДляСопоставления.Telegram.ПолучитьОбъект();
			TelegramДляУдаления.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		Если ВидыКонтактнойИнформацииДляСопоставления.Свойство("Max") Тогда
			MaxДляУдаления = ВидыКонтактнойИнформацииДляСопоставления.Max.ПолучитьОбъект();
			MaxДляУдаления.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

#КонецОбласти

// Создает новое физическое лицо на основании личных данных кандидата.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
// 
// Возвращаемое значение:
//  СправочникСсылка.ФизическиеЛица
Функция СоздатьФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидата, ДополнительныеПараметры = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		ФизическоеЛицоОбъект = ОбъектФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидата, ДополнительныеПараметры);
		ФизическоеЛицоОбъект.Записать();
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата,
			ФизическоеЛицоОбъект.Ссылка);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

	Возврат ФизическоеЛицоОбъект.Ссылка;
	
КонецФункции

// Создает объект физическое лицо на основании личных данных кандидата.
// 
// Параметры:
//  ЛичныеДанныеКандидатаСсылка - СправочникСсылка.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
// 
// Возвращаемое значение:
//  СправочникОбъект.ФизическиеЛица
Функция ОбъектФизическоеЛицоПоДаннымКандидата(ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Попытка
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатаСсылка.ПолучитьОбъект();
		
		ФИО = Новый Структура;
		ФИО.Вставить("Фамилия", ЛичныеДанныеКандидата.Фамилия);
		ФИО.Вставить("Имя", ЛичныеДанныеКандидата.Имя);
		ФИО.Вставить("Отчество", ЛичныеДанныеКандидата.Отчество);
		
		ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
		ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица, ЛичныеДанныеКандидата, ДополнительныеПараметры);
		
		ФизическоеЛицоОбъект = КадровыйУчет.НовоеФизическоеЛицо(ФИО, ДанныеФизическогоЛица, , Ложь);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ФизическоеЛицоОбъект;
	
КонецФункции

// АПК:581-выкл.

// Создает личные данные кандидата по физическому лицу при выполнении обработчика обновления.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатов
Функция СоздатьПоФизическомуЛицу(ФизическоеЛицо) Экспорт
	
	НачатьТранзакцию();
	Попытка
		ЛичныеДанныеКандидатаОбъект = СоздатьЭлемент();
		ЛичныеДанныеКандидатаОбъект.Заполнить(ФизическоеЛицо);
		ЛичныеДанныеКандидатаОбъект.ГруппаДоступа = НайтиСоздатьГруппуДоступаКандидатовПоФизЛицу(ФизическоеЛицо);
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛичныеДанныеКандидатаОбъект, Истина, Истина);
		
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатаОбъект.Ссылка;
		
		Фотография = КопияФотографииФизическогоЛица(ЛичныеДанныеКандидата, ФизическоеЛицо);
		Если ЗначениеЗаполнено(Фотография) Тогда
			ЛичныеДанныеКандидатаОбъект.Фотография = Фотография;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЛичныеДанныеКандидатаОбъект, Истина);
		КонецЕсли;
		
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(ЛичныеДанныеКандидата,
			ФизическоеЛицо);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ЛичныеДанныеКандидата;
	
КонецФункции

// АПК:581-вкл.

// Параметры:
//  ДанныеФизическогоЛица - см. КадровыйУчет.НовыеДанныеФизическогоЛица
//  ЛичныеДанныеКандидата - СправочникОбъект.ЛичныеДанныеКандидатов
//  ДополнительныеПараметры - Структура:
//    * ГруппаДоступа - СправочникСсылка.ГруппыДоступаФизическихЛиц
//    * ИдентификаторФормы - УникальныйИдентификатор
//    * АдресФотографии - УникальныйИдентификатор
Процедура ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица, ЛичныеДанныеКандидата,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	ДатаОтсчета = ЗарплатаКадрыКлиентСервер.ДатаОтсчетаПериодическихСведений();
	ЛичныеДанныеКандидатаСсылка = ЛичныеДанныеКандидата.Ссылка;
	
	ДанныеФизическогоЛица.ДатаРождения = ЛичныеДанныеКандидата.ДатаРождения;
	ДанныеФизическогоЛица.Пол = ЛичныеДанныеКандидата.Пол;
	ДанныеФизическогоЛица.МестоРождения = ЛичныеДанныеКандидата.МестоРождения;
	ДанныеФизическогоЛица.Образование = ДанныеОбОбразованииДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.ТрудоваяДеятельность = ДанныеОТрудовойДеятельностиДляФизЛица(
		ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.ЗнаниеЯзыков = ДанныеОЗнанииЯзыковДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	ДанныеФизическогоЛица.УченыеСтепени = ДанныеОбУченыхСтепеняхДляФизЛица(ЛичныеДанныеКандидатаСсылка);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ГруппаДоступа") <> Неопределено Тогда
		ДанныеФизическогоЛица.ГруппаДоступа = ДополнительныеПараметры.ГруппаДоступа;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.СостояниеВБраке) Тогда
		ДанныеОСостоянииВБраке = РегистрыСведений.СостоянияВБракеФизическихЛиц.НовоеСостояниеВБраке();
		ДанныеОСостоянииВБраке.СостояниеВБраке = ЛичныеДанныеКандидата.СостояниеВБраке;
		ДанныеОСостоянииВБраке.Период = ДатаОтсчета;
		ДанныеФизическогоЛица.СостояниеВБраке = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
			ДанныеОСостоянииВБраке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.Гражданство) Тогда
		ДанныеОГражданстве = РегистрыСведений.ГражданствоФизическихЛиц.НовоеГражданство();
		ДанныеОГражданстве.Гражданство = ЛичныеДанныеКандидата.Гражданство;
		ДанныеОГражданстве.Период = ДатаОтсчета;
		ДанныеФизическогоЛица.Гражданство = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОГражданстве);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "АдресФотографии") <> Неопределено Тогда
		ДанныеФизическогоЛица.АдресФотографии = ДополнительныеПараметры.АдресФотографии;
	ИначеЕсли ЗначениеЗаполнено(ЛичныеДанныеКандидата.Фотография) Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(ЛичныеДанныеКандидата.Фотография);
		Фото = Новый Картинка(ДвоичныеДанные);
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры,
			"ИдентификаторФормы") <> Неопределено Тогда
			Идентификатор = ДополнительныеПараметры.ИдентификаторФормы;
		Иначе
			Идентификатор = Новый УникальныйИдентификатор();
		КонецЕсли;
		АдресФотографии = ПоместитьВоВременноеХранилище(Фото, Идентификатор);
		ДанныеФизическогоЛица.АдресФотографии = АдресФотографии;
	КонецЕсли;
	
	КонтактнаяИнформация = Новый Массив();
	
	СоответствиеКИ = ПодборПерсонала.ВидыКИФизическихЛицПоКИКандидатов();
	КонтактнаяИнформацияКандидата = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ЛичныеДанныеКандидата,
		, , Ложь);
	Для Каждого ТекущаяСтрока Из КонтактнаяИнформацияКандидата Цикл
		ВидКонтактнойИнформации = СоответствиеКИ.Получить(ТекущаяСтрока.Вид);
		Если ВидКонтактнойИнформации = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеКИ = КадровыйУчет.НоваяКонтактнаяИнформация();
		ДанныеКИ.ВидИнформации = ВидКонтактнойИнформации;
		ДанныеКИ.ТипИнформации = ТекущаяСтрока.Тип;
		ДанныеКИ.ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
			ТекущаяСтрока.Представление, ВидКонтактнойИнформации);
		//@skip-check typed-value-adding-to-untyped-collection
		КонтактнаяИнформация.Добавить(ДанныеКИ);
	КонецЦикла;
	
	Если КонтактнаяИнформация.Количество() > 0 Тогда
		ДанныеФизическогоЛица.КонтактнаяИнформация = КонтактнаяИнформация;
	КонецЕсли;
		
КонецПроцедуры

// Возвращает наименование кандидата.
// 
// Параметры:
//  ФИО - Структура:
//    * Фамилия - Строка
//    * Имя - Строка
//    * Отчество - Строка
//  УточнениеНаименованияКандидата - Строка
// 
// Возвращаемое значение:
//  Строка
Функция НаименованиеКандидата(ФИО, УточнениеНаименованияКандидата = "") Экспорт
	
	Возврат КадровыйУчетКлиентСервер.ПолноеНаименованиеСотрудника(
		ФИО.Фамилия, 
		ФИО.Имя, 
		ФИО.Отчество, 
		УточнениеНаименованияКандидата);
	
КонецФункции

// Получает физические лица кандидатов.
// 
// Параметры:
// 	ЛичныеДанныеКандидатов - Массив Из СправочникСсылка.ЛичныеДанныеКандидатов - массив кандидатов
// 	ТолькоНеПомеченныеНаУдаление - Булево
// Возвращаемое значение:
// 	Соответствие из КлючИЗначение:
//    * Ключ - СправочникСсылка.ЛичныеДанныеКандидатов - кандидат из исходного массива
//    * Значение - СправочникСсылка.ФизическиеЛица - физическое лицо кандидата
Функция ФизическиеЛицаЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, ТолькоНеПомеченныеНаУдаление = Ложь) Экспорт
	
	Выборка = ВыборкаФизическиеЛицаКандидатов(ЛичныеДанныеКандидатов);
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Если ТолькоНеПомеченныеНаУдаление И Выборка.ФизическоеЛицоПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Выборка.ЛичныеДанныеКандидата, Выборка.ФизическоеЛицо);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает физическое лицо кандидата.
// 
// Параметры:
// 	ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
// Возвращаемое значение:
// 	СправочникСсылка.ФизическиеЛица
Функция ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата) Экспорт
	
	ФизическоеЛицо = ФизическиеЛицаЛичныхДанныхКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата))[ЛичныеДанныеКандидата];
	
	Если ФизическоеЛицо = Неопределено Тогда
		ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ФизическоеЛицо;
	
КонецФункции

// Получает личные данные кандидатов для физических лиц.
// 
// Параметры:
//  ФизическиеЛица - Массив Из СправочникСсылка.ФизическиеЛица - физические лица
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//    * Ключ - СправочникСсылка.ФизическиеЛица - физическое лицо
//    * Значение - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата
Функция ЛичныеДанныеКандидатовФизическихЛиц(ФизическиеЛица) Экспорт
	
	//@skip-check invocation-parameter-type-intersect
	Выборка = ВыборкаФизическиеЛицаКандидатов(, ФизическиеЛица);
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ФизическоеЛицо, Выборка.ЛичныеДанныеКандидата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Личные данные кандидата физического лица.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатов,Неопределено
Функция ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо) Экспорт
	
	Если ТипЗнч(ФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Возврат ЛичныеДанныеКандидатовФизическихЛиц(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо))[ФизическоеЛицо];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Сохраняет фотографию кандидата и возвращает ссылку на нее.
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - владелец фотографии
//  АдресФотографии - Строка,Неопределено - адрес временного хранилища фотографии, в котором хранятся двоичные данные
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛичныеДанныеКандидатовПрисоединенныеФайлы,Неопределено -Сохраненная фотография
Функция СохраненнаяФотография(ЛичныеДанныеКандидата, АдресФотографии) Экспорт
	
	Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	КонецЕсли;
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.ВладелецФайлов = ЛичныеДанныеКандидата;
	ПараметрыФайла.ИмяБезРасширения = "Фотография";
	ПараметрыФайла.Служебный = Истина;
	
	Возврат РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФотографии);
	
КонецФункции

// Возвращает таблицу значений с историей взаимоотношений с кандидатом
// 
// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * Кандидат - СправочникСсылка.Кандидаты
//   * Ссылка - СправочникСсылка
//   * Примечание - Строка -
//   * Роль - Число -
//   * ГруппаРоли - Число -
//   * ДатаАктуальности - Дата -
Функция ИсторияВзаимоотношений(ЛичныеДанныеКандидата) Экспорт
	
	ОбъектыВзаимоотношений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЛичныеДанныеКандидата);
	ФизическоеЛицо = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата);
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		//@skip-check invocation-parameter-type-intersect
		ОбъектыВзаимоотношений.Добавить(ФизическоеЛицо);
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(СотрудникиФормы.ИсторияВзаимоотношенийСКомпанией(
		ОбъектыВзаимоотношений));
	
КонецФункции

Функция КопияФотографииФизическогоЛица(ЛичныеДанныеКандидата, ФизическоеЛицо) Экспорт
	
	АдресФотографии = КадровыйУчетРасширенный.АдресФотографииФизическогоЛица(ФизическоеЛицо);
	Если Не ЭтоАдресВременногоХранилища(АдресФотографии) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	КонецЕсли;
	
	ФотографияФизЛица = ПолучитьИзВременногоХранилища(АдресФотографии);
	Если Не ЗначениеЗаполнено(ФотографияФизЛица) Тогда
		Возврат Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	ИначеЕсли ТипЗнч(ФотографияФизЛица) = Тип("Картинка") Тогда
		ДвоичныеДанные = ФотографияФизЛица.ПолучитьДвоичныеДанные();
		АдресФотографии = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	КонецЕсли;
	
	Возврат СохраненнаяФотография(ЛичныеДанныеКандидата, АдресФотографии);
	
КонецФункции

Функция ЛичныеДанныеСуществуют(ЛичныеДанныеКандидата) Экспорт
	
	ЛичныеДанныеСуществуют = Ложь;
	Если ОбщегоНазначения.СсылкаСуществует(ЛичныеДанныеКандидата) Тогда
		ЛичныеДанныеСуществуют = Истина;
	КонецЕсли;
	
	Возврат ЛичныеДанныеСуществуют;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  СправочникСсылка.ГруппыДоступаКандидатов
Функция НайтиСоздатьГруппуДоступаКандидатовПоФизЛицу(ФизическоеЛицо)
	
	ГруппаДоступаФизЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ГруппаДоступа");
	
	Если Не ЗначениеЗаполнено(ГруппаДоступаФизЛица) Тогда
		Возврат Справочники.ГруппыДоступаКандидатов.ПустаяСсылка();
	КонецЕсли;
	
	НаименованиеГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаДоступаФизЛица, "Наименование");
	ГруппаДоступа = Справочники.ГруппыДоступаКандидатов.НайтиПоНаименованию(НаименованиеГруппы);
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ГруппаДоступаОбъект = Справочники.ГруппыДоступаКандидатов.СоздатьЭлемент();
		ГруппаДоступаОбъект.Наименование = НаименованиеГруппы;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ГруппаДоступаОбъект, Истина);
		ГруппаДоступа = ГруппаДоступаОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ГруппаДоступа;
	
КонецФункции

// Возвращает таблицу кандидатов для обработки.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * Кандидат - СправочникСсылка.Кандидаты
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * ЛичныеДанныеКандидатаСвязанныеСФизлицом - СправочникСсылка.ЛичныеДанныеКандидатов
Функция КандидатыДляОбработки()
	
	Если Метаданные.Справочники.Кандидаты.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Кандидаты.Ссылка КАК Кандидат,
		|	Кандидаты.УдалитьФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидатаСвязанныеСФизлицом
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО Кандидаты.УдалитьФизическоеЛицо = ФизическиеЛицаКандидатов.ФизическоеЛицо
		|			И (ФизическиеЛицаКандидатов.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|ГДЕ
		|	Кандидаты.ЛичныеДанные = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидаты.ДатаРегистрации УБЫВ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции

// Данные поиска кандидатов для обработки.
// 
// Параметры:
//  Обработанные - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
Функция ДанныеПоискаКандидатовДляОбработки(Обработанные)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ЛичныеДанныеКандидатов.Ссылка = ДанныеПоискаФизическихЛиц.ФизическоеЛицо
		|ГДЕ
		|	ДанныеПоискаФизическихЛиц.ФизическоеЛицо ЕСТЬ NULL
		|	И НЕ ЛичныеДанныеКандидатов.Ссылка В (&Обработанные)";
	
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Возвращает выборку личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//    * ФизическоеЛицоПометкаУдаления - Булево
Функция ВыборкаФизическиеЛицаКандидатов(ЛичныеДанныеКандидатов = Неопределено, ФизическиеЛица = Неопределено)
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления КАК ФизическоеЛицоПометкаУдаления
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|ГДЕ
		|	&ЛичныеДанныеКандидатов
		|	И &ФизическиеЛица";
	
	Если ЛичныеДанныеКандидатов = Неопределено Тогда
		Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", Истина);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ЛичныеДанныеКандидатов",
			"ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов)");
		Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	КонецЕсли;
	
	Если ФизическиеЛица = Неопределено Тогда
		Запрос.УстановитьПараметр("ФизическиеЛица", Истина);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ФизическиеЛица",
			"ФизическиеЛицаКандидатов.ФизическоеЛицо В (&ФизическиеЛица)");
		Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

// Возвращаемое значение:
//  Соответствие  из КлючИЗначение:
//   * Ключ - СправочникСсылка.ФизическиеЛица
//   * Значение - СправочникСсылка.ЛичныеДанныеКандидатов
Функция НовоеСоответствиеФизическихЛицИКандидатов()
	
	Возврат Новый Соответствие();
	
КонецФункции

#Область ЗаполнениеДанныхФизЛица

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании
Функция ДанныеОбОбразованииДляФизЛица(ЛичныеДанныеКандидата)
	
	ОбразованиеКандидата = ПодборПерсонала.ОбразованиеКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
	КурсыКандидата = ПодборПерсонала.КурсыКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
	
	Если ОбразованиеКандидата.Количество() = 0 И КурсыКандидата.Количество() = 0 Тогда
		Возврат Справочники.ОбразованиеФизическихЛиц.НовыеДанныеОбОбразовании();
	КонецЕсли;
	
	Образование = Новый Массив;
	
	Для Каждого ТекущаяСтрока Из ОбразованиеКандидата Цикл
		СведенияОбОбразовании = НовоеОбразованиеДляФизическогоЛица();
		ЗаполнитьЗначенияСвойств(СведенияОбОбразовании, ТекущаяСтрока);
		СведенияОбОбразовании.Окончание = ТекущаяСтрока.ГодОкончания;
		Образование.Добавить(СведенияОбОбразовании);
	КонецЦикла;

	Для Каждого ТекущаяСтрока Из КурсыКандидата Цикл
		СведенияОбОбразовании = НовоеОбразованиеДляФизическогоЛица();
		ЗаполнитьЗначенияСвойств(СведенияОбОбразовании, ТекущаяСтрока);
		СведенияОбОбразовании.Окончание = ТекущаяСтрока.ГодОкончания;
		СведенияОбОбразовании.ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование");
		СведенияОбОбразовании.ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.Прочее;
		СведенияОбОбразовании.СкрыватьТ2 = Истина;
		Образование.Добавить(СведенияОбОбразовании);
	КонецЦикла;
	
	Возврат Справочники.Кандидаты.ПодготовитьДанныеОбОбразовании(Образование);
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура - см. РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц.НоваяТрудоваяДеятельность
Функция ДанныеОТрудовойДеятельностиДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОТрудовойДеятельности = Новый Массив;
	
	ОпытРаботы = ПодборПерсонала.ОпытРаботыКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
		
	Для Каждого СтрокаОпытРаботы Из ОпытРаботы Цикл
		ТрудоваяДеятельность = РегистрыСведений.ТрудоваяДеятельностьФизическихЛиц.НоваяТрудоваяДеятельность();
		ЗаполнитьЗначенияСвойств(ТрудоваяДеятельность, СтрокаОпытРаботы);
		ТрудоваяДеятельность.Организация = СтрокаОпытРаботы.Компания;
		ТрудоваяДеятельность.НомерПоПорядку = ОпытРаботы.Индекс(СтрокаОпытРаботы) + 1;
		ДанныеОТрудовойДеятельности.Добавить(ТрудоваяДеятельность);
	КонецЦикла;
		
	Возврат ДанныеОТрудовойДеятельности;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура: см. РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.НовоеЗнаниеЯзыка
Функция ДанныеОЗнанииЯзыковДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОЗнанииЯзыков = Новый Массив;
	
	ЗнаниеЯзыков = ПодборПерсонала.ЗнаниеЯзыковКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
		
	Для Каждого СтрокаЗнаниеЯзыков Из ЗнаниеЯзыков Цикл
		ЗнаниеЯзыка = РегистрыСведений.ЗнаниеЯзыковФизическихЛиц.НовоеЗнаниеЯзыка();
		ЗнаниеЯзыка.Язык = СтрокаЗнаниеЯзыков.Язык;
		ЗнаниеЯзыка.СтепеньЗнанияЯзыка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаЗнаниеЯзыков.СтепеньЗнанияЯзыка, "СтепеньЗнанияЯзыка");
		ДанныеОЗнанииЯзыков.Добавить(ЗнаниеЯзыка);
	КонецЦикла;
		
	Возврат ДанныеОЗнанииЯзыков;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  Массив из Структура - см. РегистрыСведений.УченыеСтепениФизическихЛиц.НоваяУченаяСтепень
Функция ДанныеОбУченыхСтепеняхДляФизЛица(ЛичныеДанныеКандидата)
	
	ДанныеОбУченыхСтепенях = Новый Массив;
	
	УченыеСтепени = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛичныеДанныеКандидата, "УченыеСтепени").Выгрузить();
	
	Для Каждого СтрокаУченаяСтепень Из УченыеСтепени Цикл
		УченаяСтепень = РегистрыСведений.УченыеСтепениФизическихЛиц.НоваяУченаяСтепень();
		ЗаполнитьЗначенияСвойств(УченаяСтепень, СтрокаУченаяСтепень);
		УченаяСтепень.НомерПоПорядку =  УченыеСтепени.Индекс(СтрокаУченаяСтепень) + 1;
		ДанныеОбУченыхСтепенях.Добавить(УченаяСтепень);
	КонецЦикла;
	
	Возврат ДанныеОбУченыхСтепенях;
	
КонецФункции

#КонецОбласти

// Создает новые виды контактной информации кандидатов по видам контактной информации физических лиц и добавляет их в
// настройку соответствия контактной информации.
// Используется при выполнении обработчика обновления.
// 
// Параметры:
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
Процедура СоздатьВидыКонтактнойИнформации(ФизическиеЛица)
	
	СоответствиеКИ = ПодборПерсонала.ВидыКИКандидатовПоКИФизическихЛиц(); // Соответствие
	
	КИФизическихЛиц = УправлениеКонтактнойИнформацией.КонтактнаяИнформация(ФизическиеЛица,
		УправлениеКонтактнойИнформацией.ОтборКонтактнойИнформации());
		
	ВидыКИФизическихЛиц = ОбщегоНазначенияБЗККлиентСервер.ВыгрузитьКолонку(КИФизическихЛиц, "Вид", Истина); // Массив из СправочникСсылка.ВидыКонтактнойИнформации
	
	Для Каждого ВидКИФизическогоЛица Из ВидыКИФизическихЛиц Цикл
		
		Если СоответствиеКИ.Получить(ВидКИФизическогоЛица) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			ВидКИКандидата = НовыйВидКИКандидата(ВидКИФизическогоЛица);
			РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ДобавитьНастройку(ВидКИКандидата,
				ВидКИФизическогоЛица);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
		СоответствиеКИ = ПодборПерсонала.ВидыКИКандидатовПоКИФизическихЛиц(); // Соответствие
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ВидКИФизическогоЛица - СправочникСсылка.ВидыКонтактнойИнформации
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыКонтактнойИнформации
Функция НовыйВидКИКандидата(ВидКИФизическогоЛица)
	
	ВидКИКандидатаОбъект = ВидКИФизическогоЛица.Скопировать();
	//@skip-check statement-type-change
	ВидКИКандидатаОбъект.Родитель = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.СправочникЛичныеДанныеКандидатов");
	ВидКИКандидатаОбъект.ИмяГруппы = "СправочникЛичныеДанныеКандидатов";
	ВидКИКандидатаОбъект.Записать();
	
	Возврат ВидКИКандидатаОбъект.Ссылка;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидата - СправочникОбъект.ЛичныеДанныеКандидатов, ДанныеФормыСтруктура - 
// 
// Возвращаемое значение: см. ПоследнееМестоРаботы
Функция ПоследнееМестоРаботыКандидата(ЛичныеДанныеКандидата) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"Справочник.ЛичныеДанныеКандидатов.ПоследнееМестоРаботыКандидата", 
		"ЛичныеДанныеКандидата", 
		ЛичныеДанныеКандидата, 
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
			Тип("СправочникОбъект.ЛичныеДанныеКандидатов"), Тип("ДанныеФормыСтруктура")));

	ОпытРаботы = ЛичныеДанныеКандидата.ОпытРаботы.Выгрузить();
	
	Возврат ПоследнееМестоРаботы(ОпытРаботы);
	
КонецФункции

// Параметры:
//  ОпытРаботы - ТаблицаЗначений:
//   * Компания - Строка
//   * Должность - Строка
//   * ДатаОкончания - Дата
// 
// Возвращаемое значение:
//  Структура:
//   * Должность - Строка
//   * Компания - Строка
Функция ПоследнееМестоРаботы(ОпытРаботы)
	
	Результат = Новый Структура;
	Результат.Вставить("Компания", "");
	Результат.Вставить("Должность", "");
	
	Если Не ЗначениеЗаполнено(ОпытРаботы) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПоследнееМестоРаботы =  ОпытРаботы[0];
	Для Каждого СтрокаТаблицы Из ОпытРаботы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			ПоследнееМестоРаботы = СтрокаТаблицы;
			Прервать;
		ИначеЕсли СтрокаТаблицы.ДатаОкончания > ПоследнееМестоРаботы.ДатаОкончания Тогда
			ПоследнееМестоРаботы = СтрокаТаблицы;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Результат, ПоследнееМестоРаботы);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ОсновныеДанныеДублей(ЛичныеДанныеКандидатов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛичныеДанныеКандидатов.ФИО,
	|	ЛичныеДанныеКандидатов.ДатаРождения,
	|	ЛичныеДанныеКандидатов.Пол,
	|	ЛичныеДанныеКандидатов.МестоРождения,
	|	ЛичныеДанныеКандидатов.СостояниеВБраке,
	|	ЛичныеДанныеКандидатов.Гражданство,
	|	ЛичныеДанныеКандидатов.Ссылка,
	|	ЛичныеДанныеКандидатов.Фотография КАК Фотография,
	|	ЛичныеДанныеКандидатов.КонтактнаяИнформация.(
	|		Тип,
	|		Вид,
	|		Представление,
	|		ЗначенияПолей,
	|		Страна,
	|		Регион,
	|		Город,
	|		АдресЭП,
	|		ДоменноеИмяСервера,
	|		НомерТелефона,
	|		НомерТелефонаБезКодов),
	|	ЛичныеДанныеКандидатов.ЗнаниеЯзыков.(
	|		Язык,
	|		СтепеньЗнанияЯзыкаКандидата),
	|	ЛичныеДанныеКандидатов.Образование.(
	|		ВидОбразования,
	|		УчебноеЗаведение,
	|		Факультет,
	|		Специальность,
	|		ГодОкончания),
	|	ЛичныеДанныеКандидатов.Курсы.(
	|		НаименованиеКурса,
	|		УчебноеЗаведение,
	|		ГодОкончания,
	|		ДополнительнаяИнформация),
	|	ЛичныеДанныеКандидатов.УченыеСтепени.(
	|		УченаяСтепень,
	|		ДатаПрисужденияУченойСтепени),
	|	ЛичныеДанныеКандидатов.ОпытРаботы.(
	|		Компания,
	|		Должность,
	|		ДатаНачала,
	|		ДатаОкончания,
	|		Обязанности,
	|		СфераДеятельностиКомпании),
	|	ЕСТЬNULL(ФизическиеЛицаКандидатов.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
	|		ПО ЛичныеДанныеКандидатов.Ссылка = ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата
	|ГДЕ
	|	ЛичныеДанныеКандидатов.Ссылка В (&МассивКандидатов)";
	
	Запрос.УстановитьПараметр("МассивКандидатов", ЛичныеДанныеКандидатов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращаемое значение:
//  Массив из Структура:
//   см. Обработки.ОбъединениеДублейПерсональныхДанных.НовоеОписаниеТабличнойЧасти
Функция ОписанияСравниваемыхТабличныхЧастей()
	
	ОписанияТабличныхЧастей = Новый Структура;
	
	МодульОбработки = ОбщегоНазначения.ОбщийМодуль("Обработки.ОбъединениеДублейПерсональныхДанных");
	
	МетаданныеТабличныеЧасти = Метаданные.Справочники.ЛичныеДанныеКандидатов.ТабличныеЧасти;
	
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.ЗнаниеЯзыков.Имя,
		МодульОбработки.НовоеОписаниеТабличнойЧасти(МетаданныеТабличныеЧасти.ЗнаниеЯзыков.Реквизиты.Язык.Имя));
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.Образование.Имя,
		МодульОбработки.НовоеОписаниеТабличнойЧасти(МетаданныеТабличныеЧасти.Образование.Реквизиты.ВидОбразования.Имя));
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.Курсы.Имя,
		МодульОбработки.НовоеОписаниеТабличнойЧасти(МетаданныеТабличныеЧасти.Курсы.Реквизиты.НаименованиеКурса.Имя));
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.УченыеСтепени.Имя,
		МодульОбработки.НовоеОписаниеТабличнойЧасти(МетаданныеТабличныеЧасти.УченыеСтепени.Реквизиты.УченаяСтепень.Имя));
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.ОпытРаботы.Имя,
		МодульОбработки.НовоеОписаниеТабличнойЧасти(МетаданныеТабличныеЧасти.ОпытРаботы.Реквизиты.Компания.Имя));
		
	ОписаниеТабличнойЧасти = МодульОбработки.НовоеОписаниеТабличнойЧасти(
		МетаданныеТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Вид.Имя);
	ОписаниеТабличнойЧасти.ИмяРеквизитаПредставления =
		МетаданныеТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Представление.Имя;
	ОписанияТабличныхЧастей.Вставить(МетаданныеТабличныеЧасти.КонтактнаяИнформация.Имя, ОписаниеТабличнойЧасти);
	
	Возврат ОписанияТабличныхЧастей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
