#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение классификатора.
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторВоинскихЗваний.Ссылка КАК ОбщевойсковоеЗвание,
		|	ПРЕДСТАВЛЕНИЕ(КлассификаторВоинскихЗваний.Ссылка) КАК Наименование
		|ИЗ
		|	Перечисление.КлассификаторВоинскихЗваний КАК КлассификаторВоинскихЗваний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗванияГражданскогоВоинскогоУчета КАК ЗванияГражданскогоВоинскогоУчета
		|		ПО КлассификаторВоинскихЗваний.Ссылка = ЗванияГражданскогоВоинскогоУчета.ОбщевойсковоеЗвание
		|ГДЕ
		|	ЗванияГражданскогоВоинскогоУчета.Ссылка ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлассификаторВоинскихЗваний.Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеЗванийИСоставов = СоответствиеВоинскихЗванийИСоставов();
	ПредельныйВозрастЗваний = ПредельныйВозрастПребыванияВЗапасеВоинскихЗваний();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СправочникОбъект = Справочники.ЗванияГражданскогоВоинскогоУчета.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, Выборка);
			СправочникОбъект.Состав = СоответствиеЗванийИСоставов[Выборка.ОбщевойсковоеЗвание];
			ПредельныйВозраст = ПредельныйВозрастЗваний[Выборка.ОбщевойсковоеЗвание];
			Если ПредельныйВозраст <> Неопределено Тогда 
				СправочникОбъект.ПредельныйВозрастПребыванияВЗапасеМужчин = ПредельныйВозраст.Мужчины;
				СправочникОбъект.ПредельныйВозрастПребыванияВЗапасеЖенщин = ПредельныйВозраст.Женщины;
			КонецЕсли;
			СправочникОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьПредельныйВозрастПребыванияВЗапасе(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗванияГражданскогоВоинскогоУчета.Ссылка КАК Ссылка,
		|	ЗванияГражданскогоВоинскогоУчета.ОбщевойсковоеЗвание КАК ОбщевойсковоеЗвание,
		|	ЕСТЬNULL(ЗванияГражданскогоВоинскогоУчета.Состав.ОфицерскийСостав, ЛОЖЬ) КАК ОфицерскийСостав
		|ИЗ
		|	Справочник.ЗванияГражданскогоВоинскогоУчета КАК ЗванияГражданскогоВоинскогоУчета
		|ГДЕ
		|	ЗванияГражданскогоВоинскогоУчета.ПредельныйВозрастПребыванияВЗапасеМужчин = 0
		|	И ЗванияГражданскогоВоинскогоУчета.ПредельныйВозрастПребыванияВЗапасеЖенщин = 0
		|	И ЗванияГражданскогоВоинскогоУчета.ОбщевойсковоеЗвание <> ЗНАЧЕНИЕ(Перечисление.КлассификаторВоинскихЗваний.ПустаяСсылка)";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	ПредельныйВозрастЗваний = ПредельныйВозрастПребыванияВЗапасеВоинскихЗваний();
	
	Пока Выборка.Следующий() Цикл 
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Справочник.ЗванияГражданскогоВоинскогоУчета", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ВоинскоеЗвание = Выборка.Ссылка.ПолучитьОбъект();
		ПредельныйВозраст = ПредельныйВозрастЗваний[Выборка.ОбщевойсковоеЗвание];
		Если ПредельныйВозраст <> Неопределено Тогда 
			ВоинскоеЗвание.ПредельныйВозрастПребыванияВЗапасеМужчин = ПредельныйВозраст.Мужчины;
			ВоинскоеЗвание.ПредельныйВозрастПребыванияВЗапасеЖенщин = ПредельныйВозраст.Женщины;
		Иначе 
			ВоинскоеЗвание.ПредельныйВозрастПребыванияВЗапасеЖенщин = ?(Выборка.ОфицерскийСостав, 50, 45);
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВоинскоеЗвание);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьПредельныйВозрастПребыванияВЗапасе");
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ВоинскийУчет.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоответствиеВоинскихЗванийИСоставов()
	
	Солдаты 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Солдаты, матросы, сержанты, старшины", Истина);
	Прапорщики 		= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Прапорщики и мичманы", Истина);
	МладшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Младшие офицеры", Истина);
	СтаршиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Старшие офицеры", Истина);
	ВысшиеОфицеры 	= Справочники.СоставыВоеннослужащих.НайтиПоНаименованию("Высшие офицеры", Истина);
	
	СоответствиеЗванийИСоставов = Новый Соответствие;
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Рядовой, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Матрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Ефрейтор, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМатрос, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина2Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Сержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина1Статьи, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийСержант, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйСтаршина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина, Солдаты);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйКорабельныйСтаршина, Солдаты);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Прапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Мичман, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийПрапорщик, Прапорщики);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМичман, Прапорщики);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Лейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийЛейтенант, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан, МладшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.КапитанЛейтенант, МладшиеОфицеры);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Майор, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан3Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Подполковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан2Ранга, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Полковник, СтаршиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан1Ранга, СтаршиеОфицеры);
	
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералМайор, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.КонтрАдмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералЛейтенант, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ВицеАдмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералПолковник, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.Адмирал, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералАрмии, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.АдмиралФлота, ВысшиеОфицеры);
	СоответствиеЗванийИСоставов.Вставить(Перечисления.КлассификаторВоинскихЗваний.МаршалРоссийскойФедерации, ВысшиеОфицеры);
	
	Возврат СоответствиеЗванийИСоставов;
	
КонецФункции	

Функция ПредельныйВозрастПребыванияВЗапасеВоинскихЗваний()
	
	ПредельныйВозраст = Новый Соответствие;
	
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Рядовой, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Матрос, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Ефрейтор, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМатрос, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийСержант, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина2Статьи, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Сержант, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина1Статьи, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийСержант, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйСтаршина, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Старшина, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГлавныйКорабельныйСтаршина, Новый Структура("Мужчины, Женщины", 55, 45));
	
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Прапорщик, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Мичман, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийПрапорщик, Новый Структура("Мужчины, Женщины", 55, 45));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийМичман, Новый Структура("Мужчины, Женщины", 55, 45));
	
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.МладшийЛейтенант, Новый Структура("Мужчины, Женщины", 60, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Лейтенант, Новый Структура("Мужчины, Женщины", 60, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.СтаршийЛейтенант, Новый Структура("Мужчины, Женщины", 60, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан, Новый Структура("Мужчины, Женщины", 60, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.КапитанЛейтенант, Новый Структура("Мужчины, Женщины", 60, 50));
	
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Майор, Новый Структура("Мужчины, Женщины", 65, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан3Ранга, Новый Структура("Мужчины, Женщины", 65, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Подполковник, Новый Структура("Мужчины, Женщины", 65, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан2Ранга, Новый Структура("Мужчины, Женщины", 65, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Полковник, Новый Структура("Мужчины, Женщины", 65, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Капитан1Ранга, Новый Структура("Мужчины, Женщины", 65, 50));
	
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералМайор, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.КонтрАдмирал, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералЛейтенант, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ВицеАдмирал, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералПолковник, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.Адмирал, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.ГенералАрмии, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.АдмиралФлота, Новый Структура("Мужчины, Женщины", 70, 50));
	ПредельныйВозраст.Вставить(Перечисления.КлассификаторВоинскихЗваний.МаршалРоссийскойФедерации, Новый Структура("Мужчины, Женщины", 70, 50));
	
	Возврат ПредельныйВозраст;
	
КонецФункции

#КонецОбласти

#КонецЕсли