#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КадровыйПланПериодыВСтроках");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация об утвержденном кадровом плане. Отображение периодов в строках.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КадровыйПланПериодыВСтолбцах");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация об утвержденном кадровом плане. Отображение периодов в столбцах.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли