
#Область СлужебныеПроцедурыИФункции

// Процедура-обработчик события "ПриЗаписи" константы ИспользоватьУчетОригиналовПервичныхДокументов.
//
// Параметры:
//		Источник	- КонстантаМенеджерЗначения - источник события.
//		Отказ		- Булево - флаг отказа от выполнения обработчика.
//
Процедура УстановитьИспользованиеУчетаОригиналовПервичныхДокументовПриЗаписи(Источник, Отказ) Экспорт
		
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.Значение Тогда
		Возврат;
	КонецЕсли;
	
	// При включении учета оригиналов создается состояние для рассылки документов и устанавливается в константу
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Константы.СостояниеОригиналаПервичногоДокументаПриРассылке.Получить());
	Идентификатор = Новый УникальныйИдентификатор("55c320ad-163e-11ec-80e1-4cedfb43aefc");
	СостояниеОтправкиСсылка = МенеджерОбъекта.ПолучитьСсылку(Идентификатор);
	Если ОбщегоНазначения.СсылкаСуществует(СостояниеОтправкиСсылка) Тогда
		Возврат;
	КонецЕсли;
	СостояниеОтправкиОбъект = МенеджерОбъекта.СоздатьЭлемент();
	СостояниеОтправкиОбъект.Наименование = НСтр("ru = 'Форма отправлена'");
	СостояниеОтправкиОбъект.Описание = НСтр("ru = 'Состояние устанавливается печатной форме, когда она отправляется сотруднику с помощью рассылки документов.'");
	СостояниеОтправкиОбъект.УстановитьСсылкуНового(СостояниеОтправкиСсылка);
	СостояниеОтправкиОбъект.Записать();
	
	Константы.СостояниеОригиналаПервичногоДокументаПриРассылке.Установить(СостояниеОтправкиОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти
