#Область СлужебныйПрограммныйИнтерфейс

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииПочтыПолучателейВСообщении
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, НазначениеШаблона, ПредметСообщения) Экспорт
	ПерезаполнитьПолучателейПисьмаПоШаблону(ПолучателиПисьма, ПредметСообщения);
КонецПроцедуры

Функция НоваяТаблицаПолучателей() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Адрес", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Контакт", Метаданные.ОпределяемыеТипы.КонтактВзаимодействия.Тип);
	Таблица.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ВариантОтправки", Новый ОписаниеТипов("Строка"));
	Возврат Таблица;
	
КонецФункции

Процедура ДополнитьШаблонРеквизитамиПолучателя(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт

	// Получатель.
	ГруппаПолучатель = Реквизиты.Родитель.Владелец().Строки.Добавить();
	ГруппаПолучатель.Имя = "Получатель";
	ГруппаПолучатель.Представление = НСтр("ru = 'Получатель'");
	
	РеквизитыПолучателя = ГруппаПолучатель.Строки;
	
	// ФИО.
	НоваяСтрока = РеквизитыПолучателя.Добавить();
	НоваяСтрока.Имя = "Получатель.ФИО";
	НоваяСтрока.Представление = НСтр("ru = 'ФИО'");

	// Имя
	НоваяСтрока = РеквизитыПолучателя.Добавить();
	НоваяСтрока.Имя = "Получатель.Имя";
	НоваяСтрока.Представление = НСтр("ru = 'Имя'");

	// Отчество
	НоваяСтрока = РеквизитыПолучателя.Добавить();
	НоваяСтрока.Имя = "Получатель.Отчество";
	НоваяСтрока.Представление = НСтр("ru = 'Отчество'");

	// Фамилия
	НоваяСтрока = РеквизитыПолучателя.Добавить();
	НоваяСтрока.Имя = "Получатель.Фамилия";
	НоваяСтрока.Представление = НСтр("ru = 'Фамилия'");
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПолучателяВДополнительныхРеквизитахШаблона(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт

	РеквизитыПолучателя = Сообщение.ДополнительныеПараметры.ПроизвольныеПараметры["Получатель"];
	Если РеквизитыПолучателя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСообщения = ДополнительныеПараметры.ПараметрыСообщения;
	Если ПараметрыСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПараметрыСообщения.Свойство("Получатели") Тогда
		Возврат;
	КонецЕсли;
	
	Получатель = Неопределено;
	Для Каждого СтрокаПолучателя Из ПараметрыСообщения["Получатели"] Цикл
		Если Не ЗначениеЗаполнено(СтрокаПолучателя.Контакт) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаПолучателя.ВариантОтправки) 
			Или СтрокаПолучателя.ВариантОтправки = ШаблоныСообщенийБЗККлиентСервер.ВариантыОтправкиСообщенияРезюме().Кому Тогда
			Получатель = СтрокаПолучателя.Контакт;
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Если Получатель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, Получатель, "ФИО, Фамилия, Имя, Отчество");
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыПолучателя.Вставить("ФИО", КадровыеДанные[0].ФИО);
	РеквизитыПолучателя.Вставить("Фамилия", КадровыеДанные[0].Фамилия);
	РеквизитыПолучателя.Вставить("Имя", КадровыеДанные[0].Имя);
	РеквизитыПолучателя.Вставить("Отчество", КадровыеДанные[0].Отчество);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПерезаполнитьПолучателейПисьмаПоШаблону(ПолучателиПисьма, ПредметСообщения)

	Если Не ПерезаполнятьПолучателей(ПредметСообщения) Тогда
		Возврат;
	КонецЕсли;

	ПолучателиПисьма.Очистить();
	Если ПредметСообщения.ПараметрыСообщения.Свойство("Получатели") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПредметСообщения.ПараметрыСообщения.Получатели, ПолучателиПисьма);
	КонецЕсли;

КонецПроцедуры

Функция ПерезаполнятьПолучателей(ПредметСообщения)
	
	Если ТипЗнч(ПредметСообщения) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПредметСообщения.Свойство("ПараметрыСообщения")
		Или ПредметСообщения.ПараметрыСообщения = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПредметСообщения.ПараметрыСообщения.Свойство("ПерезаполнятьПолучателей") 
		Или ПредметСообщения.ПараметрыСообщения.ПерезаполнятьПолучателей = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти