
&НаКлиенте
Процедура КомандаПолучитьСообщения(Команда)
	
	
	Если ЗапомнитьВыбор Тогда
		СохранитьВыборВарианта();
	КонецЕсли;
	
	СохранитьВыборВариантаПоУмолчанию();
	
	Закрыть(ВариантПолученияСообщений);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВыбора = Неопределено;
	Если Параметры.Свойство("СписокВыбора", СписокВыбора) Тогда
		Если ТипЗнч(СписокВыбора) = Тип("СписокЗначений") Тогда
			Элементы.ВариантПолученияСообщений.СписокВыбора.Очистить();
			Для Каждого Элемент Из СписокВыбора Цикл
				Элементы.ВариантПолученияСообщений.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ВариантПолученияСообщений =ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			НастройкиОбменаПоОрганизациям(),
			НастройкаВариантОбменаПриОтбореПоОрганизацииПоУмолчанию(),
			2);

КонецПроцедуры

&НаСервере
Процедура СохранитьВыборВарианта()
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.СохранитьВариантОбменаПриОтбореПоОрганизации(ВариантПолученияСообщений);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьВыборВариантаПоУмолчанию()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		НастройкиОбменаПоОрганизациям(),
		НастройкаВариантОбменаПриОтбореПоОрганизацииПоУмолчанию(),
		ВариантПолученияСообщений);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаВариантОбменаПриОтбореПоОрганизацииПоУмолчанию()
	Возврат "ВариантОбменаПриОтбореПоОрганизацииПоУмолчанию";
КонецФункции

&НаСервереБезКонтекста
Функция НастройкиОбменаПоОрганизациям()
	Возврат "НастройкиОбменаПоОрганизациям";
КонецФункции