#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не НаименованиеУникально(Наименование, Ссылка) Тогда
		
		Отказ = Истина;
		ТекстОшибки = НСтр("ru = 'Наименование не уникально'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Наименование", "Объект");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НаименованиеУникально(Наименование, СсылкаНаРоль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РолиФайлов.Ссылка), 0) КАК Количество
		|ИЗ
		|	Справочник.РолиФайловБИА КАК РолиФайлов
		|ГДЕ
		|	РолиФайлов.Наименование ПОДОБНО &Наименование
		|	И РолиФайлов.Ссылка <> &СсылкаНаРоль";
	
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Параметры.Вставить("СсылкаНаРоль", СсылкаНаРоль);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Количество = 0;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли