// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФизическоеЛицо") И ЗначениеЗаполнено(Параметры.ФизическоеЛицо) Тогда
		ФизическоеЛицо = Параметры.ФизическоеЛицо;
		ЗаписьПоФизическомуЛицу = РегистрыСведений.АнтропометрияФизическихЛиц.СоздатьМенеджерЗаписи();
		ЗаписьПоФизическомуЛицу.ФизическоеЛицо = ФизическоеЛицо;
		ЗаписьПоФизическомуЛицу.Прочитать();
		
		Если ЗначениеЗаполнено(ЗаписьПоФизическомуЛицу.ФизическоеЛицо) Тогда
			ЗначениеВДанныеФормы(ЗаписьПоФизическомуЛицу, Запись);
		Иначе
			Запись.ФизическоеЛицо = ФизическоеЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ФизическоеЛицо) Тогда 
		ТекстСообщения =
			НСтр("ru = 'Поле Физическое лицо не заполнено. Ввод антропометрии возможен только в контексте физического лица.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура();
	ЗначенияДляЗаполнения.Вставить("Ответственный", "Запись.Ответственный");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
	
	Если Не ЗначениеЗаполнено(Запись.ДатаВводаИзмерений) Тогда
		Запись.ДатаВводаИзмерений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Запись.ФизическоеЛицо, "Наименование, Пол");
	СклонениеФИО = "";
	ФизическиеЛицаЗарплатаКадры.Просклонять(
		ЗначенияРеквизитов.Наименование, 2, СклонениеФИО, ЗначенияРеквизитов.Пол, Запись.ФизическоеЛицо);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеФИО);
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Антропометрия %1'"), ФамилияИнициалы);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность И Не ДатаРедактироваласьВручную Тогда
		ТекущийОбъект.ДатаВводаИзмерений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийОбъект.РостДо) И ТекущийОбъект.РостДо < ТекущийОбъект.Рост Тогда
		ТекстСообщения = НСтр("ru = 'Верхнее значение диапазона роста не может быть меньше нижнего значения'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Запись.РостДо", , Отказ);
		Возврат;
	КонецЕсли;
	
	ПредставлениеРоста = "";
	ПредставлениеРазмеров = "";
	Если ЗначениеЗаполнено(ТекущийОбъект.Рост) И ЗначениеЗаполнено(ТекущийОбъект.РостДо) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: от %1 до %2 см,'"), Строка(ТекущийОбъект.Рост), Строка(ТекущийОбъект.РостДо));
	ИначеЕсли ЗначениеЗаполнено(ТекущийОбъект.Рост) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: от %1 см,'"), Строка(ТекущийОбъект.Рост));
	ИначеЕсли ЗначениеЗаполнено(ТекущийОбъект.РостДо) Тогда
		ПредставлениеРоста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Рост: до %1 см,'"), Строка(ТекущийОбъект.РостДо));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерОдежды) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'одежды %1,'"), Строка(ТекущийОбъект.РазмерОдежды));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерОбуви) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'обуви %1,'"), Строка(ТекущийОбъект.РазмерОбуви));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерГоловногоУбора) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'головного убора %1,'"), Строка(ТекущийОбъект.РазмерГоловногоУбора));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерПротивогаза) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'противогаза %1,'"), Строка(ТекущийОбъект.РазмерПротивогаза));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерРеспиратора) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'респиратора %1,'"), Строка(ТекущийОбъект.РазмерРеспиратора));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерПерчаток) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'перчаток %1,'"), Строка(ТекущийОбъект.РазмерПерчаток));
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущийОбъект.РазмерРукавиц) Тогда
		ПредставлениеРазмеров = ПредставлениеРазмеров + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'рукавиц %1,'"), Строка(ТекущийОбъект.РазмерРукавиц));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставлениеРоста) И ЗначениеЗаполнено(ПредставлениеРазмеров) Тогда
		ПредставлениеРазмеров = Лев(ПредставлениеРазмеров, СтрДлина(ПредставлениеРазмеров) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 Размеры: %2'"), ПредставлениеРоста, ПредставлениеРазмеров);
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеРоста) Тогда
		ПредставлениеРоста = Лев(ПредставлениеРоста, СтрДлина(ПредставлениеРоста) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = ПредставлениеРоста;
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеРазмеров) Тогда
		ПредставлениеРазмеров = Лев(ПредставлениеРазмеров, СтрДлина(ПредставлениеРазмеров) - 1);
		ТекущийОбъект.ПредставлениеРазмеров = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Размеры: %1'"), ПредставлениеРазмеров);
	Иначе
		ТекущийОбъект.ПредставлениеРазмеров =
			РегистрыСведений.АнтропометрияФизическихЛиц.ПредставлениеНезаполненныхРазмеров();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеАнтропометрииФизическогоЛица",, Запись.ФизическоеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗаписьУдалена(Запись.ФизическоеЛицо) Тогда 
		Оповестить("ИзменениеАнтропометрииФизическогоЛица",, Запись.ФизическоеЛицо);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаВводаИзмеренийПриИзменении(Элемент)
	ДатаРедактироваласьВручную = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаписьУдалена(ФизическоеЛицо)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.АнтропометрияФизическихЛиц КАК АнтропометрияФизическихЛиц
		|ГДЕ
		|	АнтропометрияФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	
	Возврат Запрос.Выполнить().Выбрать().Количество() = 0;
	
КонецФункции	

#КонецОбласти
