// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет оформление подписок и подключение веб-сокета к шине уведомлений
Процедура ИнициализацияШиныУведомлений() Экспорт

	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПлатформы, "8.3.27.1") > 0 Тогда

		Если Не ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО() Тогда
			// Режим учетной базы
			
			//@skip-check module-unused-local-variable - используется в ВыполнитьВБезопасномРежиме
			ИмяУведомления = Отчетность24БРОКлиентСервер.ИмяУведомленияСообщениеИзШиныОтчетности();
			//@skip-check module-unused-local-variable - используется в ВыполнитьВБезопасномРежиме
			Обработчик = Новый ОписаниеОповещения("ПриПолученииСообщенияИзШиныОтчетности", ЭтотОбъект);

			// АПК:488-выкл Поддержка новых методов платформы (исполняемый код безопасен)
			// Не нарушает безопасность информации, так как вычисляется фиксированная строка, 
			// содержащая только вызов метода платформы.
			ПлатформаУведомленияКлиента = Вычислить("УведомленияКлиента"); 
			// АПК:488-вкл
			//@skip-check dynamic-access-method-not-found
			ПлатформаУведомленияКлиента.ПодключитьОбработчик(ИмяУведомления, Обработчик);
	
			ИмяМодуляИнтеграции = "ИнтеграцияСОтчетность24ВызовСервера";
			МодульИнтеграции = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяМодуляИнтеграции);
			//@skip-check dynamic-access-method-not-found
			МодульИнтеграции.ПолучитьСообщенияПоHttp();

		КонецЕсли;
		
		Если ИнтеграцияСОтчетность24ВызовСервера.ЕстьНастроенныеИнтеграции() Тогда
			Отчетность24БРОШинаУведомленияВызовСервера.Подключиться();
		КонецЕсли;

	Иначе
		
		Если Не ДокументооборотСКОВызовСервера.ЭтоКонфигурацияОтчетность() 
			И ИнтеграцияСОтчетность24ВызовСервера.ЕстьНастроенныеИнтеграции() Тогда
			ОтключитьОбработчикОжидания("ПоказатьЗапросыИзОтчетность24");
			ПодключитьОбработчикОжидания("ПоказатьЗапросыИзОтчетность24", 60);
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик получения уведомления о получении сообщения из шины отчетности.
// 
// Параметры:
//  ДанныеСообщения - Неопределено
//  ДополнительныеПараметры - Неопределено
Процедура ПриПолученииСообщенияИзШиныОтчетности(ДанныеСообщения, ДополнительныеПараметры = Неопределено) Экспорт

	Попытка
		//@skip-check dynamic-access-method-not-found
		//@skip-check bsl-legacy-check-string-literal
		Если ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО() Тогда
			ИмяМодуля = "СервисИнтеграцииСУчетнымиСистемамиВызовСервера";
			МодульОтчетности = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяМодуля);
			МодульОтчетности.ПолучитьСообщенияПоHttp();
		Иначе
			ИмяМодуля = "ИнтеграцияСОтчетность24Клиент";
			МодульУчетнойБазы = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяМодуля);
			МодульУчетнойБазы.ПолучитьСообщенияПоHttp();
		КонецЕсли;
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры

// При получении команды из шины уведомлений.
// 
// Параметры:
//  ДанныеСообщения - Структура:
//  * Команда - Строка
//  ДополнительныеПараметры - Неопределено - Дополнительные параметры
Процедура ПриПолученииКомандыИзШиныУведомлений(ДанныеСообщения, ДополнительныеПараметры = Неопределено) Экспорт

	 Отчетность24БРОКлиентПереопределяемый.ПриПолученииКомандыИзШиныУведомлений(ДанныеСообщения, ДополнительныеПараметры);

КонецПроцедуры

// Закрывает ранее открытые формы как форма в параметре
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ЗакрытьДубликатыФормы(Форма) Экспорт

#Если ВебКлиент Тогда
	Окна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из Окна Цикл
		Если ОткрытоеОкно.Содержимое.Количество() > 0 Тогда
			ОткрытаяФорма = ОткрытоеОкно.Содержимое[0]; // ФормаКлиентскогоПриложения
			Если ОткрытаяФорма.ИмяФормы = Форма.ИмяФормы И 
				Форма.УникальныйИдентификатор <> ОткрытаяФорма.УникальныйИдентификатор Тогда
				ОткрытаяФорма.Закрыть();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
#КонецЕсли

КонецПроцедуры

#КонецОбласти