#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДанныеДляРассылки = ДанныеДляРассылки(ПараметрКоманды);
	
	ПараметрыРассылки = РассылкаДокументовКлиент.ПараметрыРассылки();
	Если ДанныеДляРассылки.ИспользоватьШаблоныСообщений Тогда
		ПараметрыРассылки.РассылатьПоШаблону = Истина;
		ПараметрыРассылки.ПредметШаблона = "Справочник.Вакансии";
		ПараметрыРассылки.ВладелецШаблона = ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСВакансией");
	Иначе
		ПараметрыРассылки.ТемаПисьма = ?(ДанныеДляРассылки.Вакансии.Количество() = 1, 
			СтрШаблон(НСтр("ru = 'Описание вакансии «%1»'"), ДанныеДляРассылки.Вакансии[0]), 
			НСтр("ru = 'Описание вакансии'"));
		// АПК:374-выкл. Восклицательный знак в тексте письма, а не в сообщении пользователю.
		ПараметрыРассылки.ТекстПисьма = 
			НСтр("ru = 'Добрый день!
				 |
				 |Пожалуйста, рассмотрите нашу вакансию.
				 |
				 |С уважением, Служба персонала.'");
		// АПК:374-вкл
	КонецЕсли;
	ПараметрыРассылки.ЗаголовокФормы = ?(ДанныеДляРассылки.Вакансии.Количество() = 1, 
		СтрШаблон(НСтр("ru = 'Отправка вакансии «%1» кандидатам'"), ДанныеДляРассылки.Вакансии[0]), 
		НСтр("ru = 'Отправка вакансий кандидатам'"));
	
	РассылкаДокументовКлиент.НачатьРассылку(ДанныеДляРассылки.Вакансии, ДанныеДляРассылки.Получатели, ПараметрыРассылки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеДляРассылки(Кандидаты)
	
	ДляРассылки = Новый Структура();
	ДляРассылки.Вставить("Вакансии");
	ДляРассылки.Вставить("Получатели");
	ДляРассылки.Вставить("ИспользоватьШаблоныСообщений", ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений"));
	
	ПолучателиРассылки = Новый Массив;
	
	ВакансииКандидатов = ПодборПерсонала.ВакансииКандидатов(Кандидаты);
	ФизическиеЛицаКандидатов = Справочники.Кандидаты.ФизическиеЛицаКандидатов(Кандидаты);

	Для Каждого Кандидат Из Кандидаты Цикл
		Описание = ОписаниеПолучателя();
		Описание.РассылаемыйДокумент = ВакансииКандидатов[Кандидат];
		Описание.ФизическоеЛицо = ФизическиеЛицаКандидатов[Кандидат];
		ПолучателиРассылки.Добавить(Описание);
	КонецЦикла;

	ДляРассылки.Вакансии = ОбщегоНазначения.ВыгрузитьКолонку(ВакансииКандидатов, "Значение", Истина);
	ДляРассылки.Получатели = ПолучателиРассылки;
	
	Возврат ДляРассылки;
	
КонецФункции

&НаСервере
Функция ОписаниеПолучателя()
	Описание = Новый Структура();
	Описание.Вставить("ФизическоеЛицо");
	Описание.Вставить("РассылаемыйДокумент");
	Возврат Описание;
КонецФункции

#КонецОбласти