#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение Тогда
		
		ВыполняетсяНачальнаяНастройка = Ложь;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.НачальнаяНастройкаПрограммы") Тогда
			МодульНачальнаяНастройкаПрограммы = ОбщегоНазначения.ОбщийМодуль("НачальнаяНастройкаПрограммы");
			ВыполняетсяНачальнаяНастройка = МодульНачальнаяНастройкаПрограммы.ВыполняетсяНачальнаяНастройкаПрограммы();
		КонецЕсли;
		
		ПоказыватьПриглашение = Не(ВыполняетсяНачальнаяНастройка Или ПолучитьФункциональнуюОпцию("ИспользуетсяПриложение1СПерсонал"));
		Если ПоказыватьПриглашение <> Константы.ПоказыватьПриглашение1СПерсонал.Получить() Тогда
			Константы.ПоказыватьПриглашение1СПерсонал.Установить(Истина);
		КонецЕсли;
		
	Иначе
		
		Если Константы.ПоказыватьПриглашение1СПерсонал.Получить() Тогда
			Константы.ПоказыватьПриглашение1СПерсонал.Установить(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли