
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		// Вариант автоматического подключения к сервису недоступен.
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.ЭтоАвтономноеРабочееМесто = ОбщегоНазначения.ЭтоАвтономноеРабочееМесто();
	Объект.РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	
	Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
	
	СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц = Истина;
	БазоваяФункциональность = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц = МодульОрганизационнаяСтруктура.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц();
		БазоваяФункциональность = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"РасчетныеЛистки", "Видимость",
			ИнтеграцияКабинетСотрудника.ДоступнаПубликацияРасчетныхЛистков());
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастроитьПравилаОбработкиЗаявокСотрудников", "Видимость",
			БизнесПроцессыЗаявокСотрудников.ДоступнаНастройкаПравилОбработкиЗаявок());
		
	ПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьДанныеСервиса", "Видимость",
			ПолноправныйПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьПривязкуАбонента", "Видимость",
			ПолноправныйПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ОтключениеСервиса", "Видимость",
			ПолноправныйПользователь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СоставПубликуемыхОбъектов", "Видимость",
			ПолноправныйПользователь);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастройкаОбсуждений", "Видимость",
			ПолноправныйПользователь
			И КабинетСотрудника.ИспользоватьФормат503());
			
	ЕстьПраваНаПросмотрЖурналаРегистрации = ПравоДоступа("ЖурналРегистрации", Метаданные);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ОткрытьЖурналРегистрации", "Видимость",
			ЕстьПраваНаПросмотрЖурналаРегистрации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПодготовкаДанныхДляТехническойПоддержки", "Видимость",
			ЕстьПраваНаПросмотрЖурналаРегистрации);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПубликуемаяСтруктураПриПодключении", "Видимость",
			Не СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьНастройкиПодключения", "Видимость",
			ПолноправныйПользователь И Не Объект.РазделениеВключено);
			
	ЦветСтиляПоясняющийОшибкуТекст 	= ЦветаСтиля.ПоясняющийОшибкуТекст;
	ЦветСтиляТекстаПоля 			= ЦветаСтиля.ЦветТекстаПоля;
	ЦветСтиляПоясняющийТекст 		= ЦветаСтиля.ПоясняющийТекст;
	ЦветСтиляИнформационнойНадписи  = ЦветаСтиля.ТекстИнформационнойНадписи;
	
	ВариантОтключенияОтключить = 1;
	ВариантОтключенияУдалить = 0;
	Если Объект.РазделениеВключено Тогда
		Элементы.ОтключениеСервиса.Заголовок = НСтр("ru = 'Отключение сервиса'");
	Иначе
		Элементы.ОтключениеСервиса.Заголовок = НСтр("ru = 'Отключение сервиса, изменение настроек подключения'");
	КонецЕсли;
	
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТребуетсяОбновитьИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ПодключениеВыполняется Тогда
		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Подключение к сервису не завершено.
				|Если программа будет закрыта, подключение к сервису не будет выполнено.'");
		КонецЕсли;
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ФизическиеЛица" И Источник = Объект.Ответственный Тогда
		ОтветственныйПриИзмененииКлиентСервер(ЭтаФорма, Объект.Ответственный);
	ИначеЕсли ИмяСобытия = "ИзменениеПравилВыгрузкиИнтеграцияУправлениеПерсоналом" Тогда
		ОбновитьЗаголовокЛичныеКабинеты();
	ИначеЕсли ИмяСобытия = "Запись_НаборКонстант" И Источник = "ИспользоватьЭлектронныеПодписи" Тогда
		УстановитьВидимостьВключениеЭП();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяДоменаПриИзменении(Элемент)
	
	Если ИмяДоменаСоответствуетПравилам() И Не ПустаяСтрока(Объект.ИмяДомена) Тогда
		ИмяДоменаЗарезервировано = Ложь;
		Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = НСтр("ru = 'Выполняется проверка уникальности адреса. Пожалуйста подождите ...'");
		НачатьРезервированиеИмениДомена();
		ПриНачалеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяДоменаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ИмяДоменаСоответствуетПравилам(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОтветственныйПриИзмененииКлиентСервер(ЭтаФорма, Объект.Ответственный);
	ОбновитьСообщениеОПубликации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйЛокальноПриИзменении(Элемент)
	
	ОтветственныйПриИзмененииКлиентСервер(ЭтаФорма, Объект.Ответственный);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПродолженияАктивироватьПриИзменении(Элемент)
	ВариантПродолженияОтключить = 0;
	ОбновитьЭУАктивацииСервиса(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВариантПродолженияОтключитьПриИзменении(Элемент)
	ВариантПродолженияАктивировать = 0;
	ОбновитьЭУАктивацииСервиса(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура АдресПриложенияЛокальноПриИзменении(Элемент)
	Объект.АдресПриложения = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Объект.АдресПриложения, "/", "Справа");
КонецПроцедуры

#Область РедактированиеМесяцаСтрокой

&НаКлиенте
Процедура МесяцПубликацииПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой", Направление);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцПубликацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтаФорма, ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой", Ложь);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИспользуетсяЭДОБЗКПриИзменении(Элемент)
	
	Если ИспользуетсяЭДОБЗК Тогда
		ОбработатьИзменениеИспользуетсяЭДОБЗК();
	Иначе
		ЗаголовокВопроса = НСтр("ru = 'Отключение использования ЭДО'");
		ТекстВопроса = НСтр("ru = 'После выполнения обмена в сервисе 1С:Кабинет сотрудника будет удален корневой сертификат и сертификаты пользователей.
		|Действие необратимо.'");
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОтключениеЭДОБЗКПродолжение", ЭтаФорма);
		ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, ИнтеграцияУправлениеПерсоналомКлиента.ОписаниеКнопокВопроса(),,,ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключениеЭДОБЗКПродолжение(КодВозврата, ДополнительныеПараметры) Экспорт

	Если КодВозврата <> КодВозвратаДиалога.Да Тогда
		ИспользуетсяЭДОБЗК = Истина;
		Возврат;
	КонецЕсли;
	
	ОбработатьИзменениеИспользуетсяЭДОБЗК();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеИспользуетсяЭДОБЗК()

	СохранитьНастройкуИспользуетсяЭДОБЗК(ИспользуетсяЭДОБЗК);
	ПрочитатьОбновитьНастройкиИспользуемаяФункциональность();
	Оповестить("ИспользуетсяЭДОБЗКЗаписанаКонстанта", ИспользуетсяЭДОБЗК);
	ОбновитьИнтерфейс();

КонецПроцедуры

&НаКлиенте
Процедура СпособПолученияСогласияНаПрисоединениеКЭДОБЗКПриИзменении(Элемент)
	СохранитьНастройкуСпособПолученияСогласияНаПрисоединениеКЭДОБЗК(СпособПолученияСогласияНаПрисоединениеКЭДОБЗК);
	УстановитьДоступностьФормировнаияСогласийНаПрисоединениеКЭДОБЗК(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура АвтоФормированиеСогласийПриИзменении(Элемент)
	АвтоФормированиеСогласийПриИзмененииНаСервере(АвтоФормированиеСогласий);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАдресСервисаАвторизацииПриИзменении(Элемент)
	ОбновитьЭУВыборАдреса(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАдресРесурсовAPIПриИзменении(Элемент)
	ОбновитьЭУВыборАдресаРесурсовAPI(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСборДанныхДляОформленияНаРаботуПриИзменении(Элемент)
	
	СохранитьНастройкуИспользоватьСборДанныхДляОформленияНаРаботу(ИспользоватьСборДанныхДляОформленияНаРаботу);
	УстановитьДоступностьПоказатьЗапрашиваемыеДанныеДляОформленияНаРаботу(ЭтаФорма);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейСохраненияПубликацииПриИзменении(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_ПриИзмененииДнейСохраненияПубликации", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейСохраненияПубликацииИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СохранитьНастройкуДнейСохраненияПубликации(Число(Текст));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСогласийДекорацияНажатие(Элемент)
	
	ОткрытьФорму("Документ.СогласиеНаПрисоединениеКЭДОБЗК.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУведомленияОНачалеОтпускаПриИзменении(Элемент)
	
	СохранитьНастройкуИспользоватьУведомленияОНачалеОтпускаНаСервере(ИспользоватьУведомленияОНачалеОтпуска);
	ОбновитьЭУУведомлениеОНачалеОтпуска(ЭтаФорма);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателяПриИзменении(Элемент)
	
	СохранитьНастройкуТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателяНаСервере(ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя);
	ОбновитьЭУУведомлениеОНачалеОтпуска(ЭтаФорма);
	ОбновитьИнтерфейс();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодробноОСервисе(Команда)
	
	ИнтеграцияКабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуПодробноОСервисе();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Команда)
	
	ПодключитьИнтернетПоддержкуПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьПриложение(Команда)
	
	Если Объект.ПриложениеВЛокальнойСети Тогда
		Если ЗначениеЗаполнено(Объект.АдресПриложения)
			И ЗначениеЗаполнено(КлючИдентификаторКлиента)
			И ЗначениеЗаполнено(КлючСекретКлиента)
			И (Не ИспользоватьАдресСервисаАвторизации Или ЗначениеЗаполнено(Объект.АдресСервисаАвторизации))
			И (Не ИспользоватьАдресРесурсовAPI Или ЗначениеЗаполнено(Объект.АдресРесурсовAPI)) Тогда
			НачатьПодключениеКСервисуЛокально();
			ПриНачалеЗадания();
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Для подключения заполните данные в форме'");
			ПоказатьПредупреждение( ,ТекстПредупреждения);
		КонецЕсли;
	Иначе
		Если ИмяДоменаЗарезервировано И ДанныеОтветственногоЗаполнены И ЗначениеЗаполнено(Объект.ИмяПриложения) Тогда
			НачатьПодключение();
			ПриНачалеЗадания();
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Для подключения заполните данные в форме'");
			ПоказатьПредупреждение( ,ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПубликации(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьИнформациюПодключения", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение, РежимПодключения", Приложение, Не СервисПодключен);
	Если СервисПодключен Тогда
		ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.НастройкаПравилВыгрузки",
			ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии);
	Иначе
		ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.НастройкаПравилВыгрузки",
			ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОДоступеКДанным(Команда)
	
	ИнтеграцияКабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуОписаниеДоступаКДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробнееОПоддерживаемыхБраузерах(Команда)
	
	ИнтеграцияКабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуПоддерживаемыеБраузеры();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеСервиса(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьДанныеСервисаЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение,ПриложениеВЛокальнойСети", Приложение, Объект.ПриложениеВЛокальнойСети);
	
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьДанныеПриложения",
		ПараметрыОткрытия, ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьРасчетныеЛистки(Команда)
	
	ДлительнаяОперация = ДлительнаяОперацияОпубликоватьРасчетныеЛистки();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Выгрузка прошла успешно.'");
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОпубликоватьРасчетныеЛисткиЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПубликацииРасчетныхЛистков(Команда)
	
	ОткрытьФорму("Обработка.ПубликацияРасчетныхЛистковКабинетСотрудника.Форма.ПубликацияРасчетныхЛистков",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПривязкуАбонента(Команда)
	
	Если Не ИнтернетПоддержкаПодключена() Тогда
		ПодключитьИнтернетПоддержкуПользователей();
	Иначе
		ИзменитьАбонентаИПП()
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьСервис(Команда)
	
	ШаблонТекстаВопроса = НСтр("ru = 'Отключить сервис 1С:Кабинет сотрудника по адресу %1, данные сервиса не будут удалены?'");
	ТекстВопроса = СтрШаблон(ШаблонТекстаВопроса, АдресСервиса(ЭтаФорма));
	
	ДополнительныеПараметры = Новый Структура("РежимОтключенияУдалить", Ложь);
	ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросОтключитьСервис", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСервис(Команда)
	
	ШаблонТекстаВопроса = НСтр("ru = 'Удалить все данные сервиса 1С:Кабинет сотрудника по адресу %1?'");
	ТекстВопроса = СтрШаблон(ШаблонТекстаВопроса, АдресСервиса(ЭтаФорма));
	
	ДополнительныеПараметры = Новый Структура("РежимОтключенияУдалить", Истина);
	ОбработчикРезультата = Новый ОписаниеОповещения("ПриОтветеНаВопросОтключитьСервис", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикРезультата, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЗаполнения(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьИнформациюПодключения", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ОшибкиЗаполненияОбъектов",ПараметрыОткрытия,ЭтаФорма,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеПодключение(Команда)
	
	ПерейтиКНовомуПодключению();
	ПриНачалеЗадания();
	Объект.ИмяДомена = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияОбОплате(Команда)
	
	НачатьОбновлениеСведенийОбОплате();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = НСтр("ru='Выберите файл с настройками подключения к сервису'");
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Файл с настройками (*.json)|*.json'");
	ОбработчикЗавершения = Новый ОписаниеОповещения("ФайлНастроекПослеВыбора", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОбработчикЗавершения, ДиалогВыбораФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОбработкиЗаявокСотрудников(Команда)
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокСотрудников.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравилаОбработкиЗаявок(Команда)
	ОткрытьФорму("Обработка.НастройкаПравилОбработкиЗаявокКабинетСотрудника.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКодАктивации(Команда)
	
	// если повторное получение кода
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"КодАктивации", "Видимость", Ложь);
	
	НачатьПолучениеКодаАктивации();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеПоКодуАктивации(Команда)
	
	Если КодАктивацииКорректный() Тогда
		НачатьПодключениеПоКодуАктивации();
		ПриНачалеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидыКонтактнойИнформации(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьВидыКонтактнойИнформацииЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ВидКИМобильныйТелефон,ВидКИАдресЭлектроннойПочты", Объект.ВидКИМобильныйТелефон, Объект.ВидКИАдресЭлектроннойПочты);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьВидыКонтактнойИнформации",ПараметрыОткрытия,ЭтаФорма,,,,
			ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	ВыполнитьОбменССервисом();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменВыгрузитьЖурнал(Команда)
	
	ЗаголовокВопроса = НСтр("ru = 'Подтверждение'");
	ТекстВопроса = НСтр("ru = 'Подготовка данных для отправки в службу технической поддержки сервиса.
		|Обмен будет выполнен с записью событий в журнал регистрации и выгрузкой журнал в файл для отправки в службу технической поддержки.'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьОбменВыгрузитьЖурналПродолжение", ЭтаФорма);
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, ИнтеграцияУправлениеПерсоналомКлиента.ОписаниеКнопокВопроса(),,,ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПубликуемыхДанных(Команда)
	
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.РегистрацияИзмененийДляОбмена",ПараметрыОткрытия,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(ПредопределенноеЗначение("Перечисление.ВидыСобытийОбменаУправлениеПерсоналом.Обмен"), "");
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборЖурналаРегистрации, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрацииОшибки(Команда)
	
	ОтборЖурналаРегистрации = ОтборЖурналаРегистрации(Неопределено, "Ошибка");
	ЖурналРегистрацииКлиент.ОткрытьЖурналРегистрации(ОтборЖурналаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПубликуемуюСтруктураКомпании(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьПубликуемуюСтруктураКомпанииЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ПубликоватьСтруктуруЮридическихЛиц,СервисПодключен", ПубликоватьСтруктуруЮридическихЛиц, Истина);
	
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьСтруктуруКомпании",ПараметрыОткрытия,ЭтаФорма,,,,
			ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПубликуемуюСтруктураКомпанииПриПодключении(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьПубликуемуюСтруктураКомпанииЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("ПубликоватьСтруктуруЮридическихЛиц,СервисПодключен", ПубликоватьСтруктуруЮридическихЛиц, Ложь);
	
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьСтруктуруКомпании",ПараметрыОткрытия,ЭтаФорма,,,,
			ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КупитьЛицензии(Команда)
	
	ИнтеграцияКабинетСотрудникаКлиент.ОткрытьНавигационнуюСсылкуПокупкаЛицензий();

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьАдреса(Команда)
	
	ДлительнаяОперация = НачатьПроверкуДоступностиАдреса();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ДлительнаяОперация,
			Новый ОписаниеОповещения("ПроверкаДоступностиАдресаПоИмениЗавершение", ЭтотОбъект),
			ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОбсуждений(Команда)
	
	ОткрытьФорму("Обработка.ИнтеграцияКабинетСотрудника.Форма.НастройкаОбсужденийКабинетСотрудника",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиЗаполненияКабинеты(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьИнформациюПодключения", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение,ТолькоОшибкиЗаполнения", Приложение, Истина);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ПубликуемыеФизическиеЛица",ПараметрыОткрытия,
				ЭтаФорма,,,,ОповещениеОЗакрытии);	
		
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСогласия(Команда)
	ОчиститьСообщения();
	ДлительнаяОперация = СформироватьСогласияДлительнаяОперация(УникальныйИдентификатор);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СформироватьСогласияЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьШаблонСогласияБумажный(Команда)
	ПараметрыОткрытия = ПараметрыОткрытияШаблонаСогласия();
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОтложенноеПодключение(Команда)
	ОчиститьСообщения();
	НачатьПроверкуОтложенногоПодключения();
	ПриНачалеЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиПодключения(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьНастройкиПодключенияЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьНастройкиПодключения",
		ПараметрыОткрытия,ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияИзПравилПубликации(Команда)
	
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("РегистрСведений.ИсключенияИзПравилПубликацииУправлениеПерсоналом.ФормаСписка",
		ПараметрыОткрытия,ЭтаФорма,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиваемыеДанныеДляОформленияНаРаботу(Команда)
	
	
	ОткрытьФорму("Справочник.ТипыДанныхДляОформленияНаРаботу.ФормаСписка",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресСервисаАвторизации(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьАдресСервисаАвторизацииИРесурсовAPIЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьАдресСервисаАвторизации",
		ПараметрыОткрытия,ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресРесурсовAPI(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьАдресСервисаАвторизацииИРесурсовAPIЗавершение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьАдресРесурсовAPI",
		ПараметрыОткрытия,ЭтаФорма,,,, ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиФункциональностиСервиса(Команда)
	
	ОткрытьФорму("Обработка.ИнтеграцияКабинетСотрудника.Форма.НастройкиСервиса",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентныеЗадания(Команда)
	
	ВключитьРегламентныеЗаданияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправкаУведомленийОНачалеОтпуска(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.ИнтеграцияУправлениеПерсоналомРасширенная.УведомленияОНачалеОтпусков") Тогда
		МодульУведомленияОНачалеОтпусковКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УведомленияОНачалеОтпусковКлиент");
		МодульУведомленияОНачалеОтпусковКлиент.ОткрытьФормуУведомленияОНачалеОтпуска(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСообщениеРезультатОбмена(Команда)
	ОбновитьРезультатОбменаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСообщениеСостояниеБлокировки(Команда)
	
	НачатьОбновлениеСостоянияБлокировки();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеБлокировки(Команда)
	
	НачатьИзменениеСостоянияБлокировки();
	ПриНачалеЗадания();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаНастроекИзФайла

&НаКлиенте
Процедура ФайлНастроекПослеВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0 Тогда
		
		Объект.АдресПриложения 		= "";
		КлючИдентификаторКлиента 	= "";
		КлючСекретКлиента 			= "";
		
		Обработчик = Новый ОписаниеОповещения("ФайлНастроекПослеВыбораЗавершение", ЭтотОбъект);
		НачатьСозданиеДвоичныхДанныхИзФайла(Обработчик, ВыбранныеФайлы[0]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНастроекПослеВыбораЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	Результат = НастройкиИзФайлаНаСервере(АдресФайла);
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ПоказатьПредупреждение(,Результат.СообщениеОбОшибке);
	Иначе
		Объект.АдресПриложения 		= СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Результат.Настройки["url"], "/", "Справа");
		КлючИдентификаторКлиента 	= Результат.Настройки["clientID"];
		КлючСекретКлиента 			= Результат.Настройки["clientSecret"];
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиИзФайлаНаСервере(АдресФайла)
	
	Результат = Новый Структура("Настройки,СообщениеОбОшибке");
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	ДвоичныеДанныеФайла.Записать(ИмяВременногоФайла);
	УдалитьИзВременногоХранилища(АдресФайла);
	
	НетНастроек = Ложь;
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.ОткрытьФайл(ИмяВременногоФайла);
		Настройки = ПрочитатьJSON(ЧтениеJSON, Истина);
		Если Не ЗначениеЗаполнено(Настройки["url"]) Или Не ЗначениеЗаполнено(Настройки["clientID"]) Или Не ЗначениеЗаполнено(Настройки["clientSecret"]) Тогда
			НетНастроек = Истина;
		Иначе
			Результат.Настройки = Настройки;
		КонецЕсли;
	Исключение
		НетНастроек = Истина;
	КонецПопытки;
	
	Если НетНастроек Тогда
		СообщениеОбОшибке = НСтр("ru='Выбранный файл не содержит настроек подключения к сервису.'");
		Результат.СообщениеОбОшибке = СообщениеОбОшибке;
	КонецЕсли;
	
	ЧтениеJSON.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ДанныеОтветственногоЛица

&НаКлиентеНаСервереБезКонтекста
Процедура ОтветственныйПриИзмененииКлиентСервер(Форма, Ответственный)

	ДанныеОтветственного = ДанныеОтветственного(Ответственный);
	РезультатПроверки = ИнтеграцияУправлениеПерсоналомКлиентСервер.РезультатПроверкиДанныхОтветственного(Ответственный, ДанныеОтветственного);
	ОбновитьЭУОтветственный(Форма, РезультатПроверки);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУОтветственный(Форма, РезультатПроверки)
	
	Элементы = Форма.Элементы;
	Форма.ДанныеОтветственногоЗаполнены = РезультатПроверки.ДанныеЗаполнены;
	
	Если Форма.Объект.ПриложениеВЛокальнойСети Тогда
		ДекорацияТелефонПочтаОтветственного 		= Элементы.ДекорацияТелефонПочтаОтветственногоЛокально;
		ДекорацияРеквизитыОтветственногоПояснение 	= Элементы.ДекорацияРеквизитыОтветственногоПояснениеЛокально;
	Иначе
		ДекорацияТелефонПочтаОтветственного 		= Элементы.ДекорацияТелефонПочтаОтветственного;
		ДекорацияРеквизитыОтветственногоПояснение 	= Элементы.ДекорацияРеквизитыОтветственногоПояснение;
	КонецЕсли;
	
	ДекорацияТелефонПочтаОтветственного.Заголовок = РезультатПроверки.СтрокаТелефонПочта;
	ДекорацияРеквизитыОтветственногоПояснение.Заголовок = РезультатПроверки.СтрокаПояснение;
	
	Если РезультатПроверки.ЕстьОшибки Тогда
		ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляПоясняющийОшибкуТекст;
	Иначе
		ДекорацияРеквизитыОтветственногоПояснение.ЦветТекста = Форма.ЦветСтиляИнформационнойНадписи;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеОтветственного(Ответственный)
	
	ДанныеОтветственного = Новый Структура("МобильныйТелефон,ЭлектроннаяПочта,Пол");
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат ДанныеОтветственного;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеОтветственного.Пол =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный, "Пол");
	КонтактнаяИнформация = ИнтеграцияУправлениеПерсоналом.КонтактнаяИнформацияФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ответственный));
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеОтветственного.МобильныйТелефон = КонтактнаяИнформация.МобильныеТелефоны[Ответственный];
	ДанныеОтветственного.ЭлектроннаяПочта = КонтактнаяИнформация.АдресаПочты[Ответственный];
	
	Возврат ДанныеОтветственного;
	
КонецФункции

#КонецОбласти

#Область ОбслуживаниеФоновыхЗаданий

&НаКлиенте
Процедура ПриНачалеЗадания()
	
	Если ЗначениеЗаполнено(АктивноеЗадание) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = АктивноеЗадание.ВыводитьОкноОжидания;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			АктивноеЗадание.ДлительнаяОперация,
			Новый ОписаниеОповещения("ПриЗавершенииЗадания", ЭтотОбъект, АктивноеЗадание.ОписаниеЗадания),
			ПараметрыОжидания);
		АктивноеЗадание = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФоновогоЗадания()

	Описание = Новый Структура("ИмяМетода,ИмяЗадания,ИмяДекорации,ВыводитьОкноОжидания,ПараметрыМетода");
	Описание.ВыводитьОкноОжидания 	= Ложь;
	Описание.ИмяДекорации 			= "";
	Описание.ПараметрыМетода 		= Новый Структура("Приложение,ИспользоватьКлючиАбонента", Приложение, Ложь);
	
	Возврат Описание;

КонецФункции

&НаСервере
Процедура ЗапуститьФоновоеЗадание(ПараметрыЗадания)
	
	Если ЗначениеЗаполнено(ПараметрыЗадания.ИмяДекорации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ПараметрыЗадания.ИмяДекорации, "Видимость", Истина);
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершения = 0;
	Результат = ДлительныеОперации.ВыполнитьВФоне(ПараметрыЗадания.ИмяМетода, ПараметрыЗадания.ПараметрыМетода, ПараметрыВыполнения);
	
	ОписаниеЗадания = Новый Структура("ИмяЗадания,ИмяДекорации");
	ОписаниеЗадания.ИмяЗадания 		= ПараметрыЗадания.ИмяЗадания;
	ОписаниеЗадания.ИмяДекорации 	= ПараметрыЗадания.ИмяДекорации;
	
	НовоеЗадание = Новый Структура("ОписаниеЗадания,ДлительнаяОперация,ВыводитьОкноОжидания");
	НовоеЗадание.ОписаниеЗадания 		= Новый ФиксированнаяСтруктура(ОписаниеЗадания);
	НовоеЗадание.ДлительнаяОперация 	= Результат;
	НовоеЗадание.ВыводитьОкноОжидания 	= ПараметрыЗадания.ВыводитьОкноОжидания;
	
	АктивноеЗадание = Новый ФиксированнаяСтруктура(НовоеЗадание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииЗадания(Результат, ОписаниеЗадания) Экспорт
	
	ИмяЗадания 		= ОписаниеЗадания.ИмяЗадания;
	ИмяДекорации 	= ОписаниеЗадания.ИмяДекорации;
	
	Если ЗначениеЗаполнено(ИмяДекорации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяДекорации, "Видимость", Ложь);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка фонового задание:'") + ИмяЗадания;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Если Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаСостояниеДлительнаяОперация Тогда
			Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
		
	Если ИмяЗадания = "ПолучениеАбонентаИПП" Тогда
		ПолучениеАбонентаИППЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ЗарезервироватьИмяДомена" Тогда
		РезервированиеИмениДоменаЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ПодключениеКСервису" Тогда
		ПодключениеКСервисуЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПриНачалеЗадания();
			НачатьПубликациюДанных();
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ПроверкаОтложенногоПодключения" Тогда
		ПроверкаОтложенногоПодключенияЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПриНачалеЗадания();
			НачатьПубликациюДанных();
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ЗавершитьСценарийОтложенногоПодключения" Тогда
		НачатьПубликациюДанных();
	ИначеЕсли ИмяЗадания = "ПолучениеИнформацииОСервисе" Тогда
		ПолучениеИнформацииОСервисеЗавершение(Результат.АдресРезультата);
		Если ЗавершитьСценарийОтложенногоПодключения Тогда
			ЗавершитьСценарийОтложенногоПодключения();
			ПриНачалеЗадания();
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ОбновлениеСвойствПриложения" Тогда
		ОбновлениеСвойствПриложенияЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ИзменениеАбонентаИнтернетПоддержки" Тогда
		ИзменениеАбонентаИнтернетПоддержкиЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ОбновлениеСведенийОбОплате" Тогда
		ОбновлениеСведенийОбОплатеЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ПодключениеКСервисуЛокально" Тогда
		ПодключениеКСервисуЛокальноЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПриНачалеЗадания();
			НачатьПубликациюДанных();
			ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ОбновлениеОтветственного" Тогда
		ОбновлениеОтветственногоЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ПолучениеКодаАктивации" Тогда
		ПолучениеКодаАктивацииЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ПодключениеПоКодуАктивации" Тогда
		ПодключениеПоКодуАктивацииЗавершение(Результат.АдресРезультата);
		Если ПодключениеВыполнено Тогда
			ПриНачалеЗадания();
		КонецЕсли;
	ИначеЕсли ИмяЗадания = "ПроверкаДоступностиИнтернетПоддержки" Тогда
		ПроверкаДоступностиИнтернетПоддержкиЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ОтключениеПриложения" Тогда
		ОтключениеПриложенияЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ОбновитьСостояниеБлокировки" Тогда
		ОбновитьСостояниеБлокировкиЗавершение(Результат.АдресРезультата);
	ИначеЕсли ИмяЗадания = "ИзменитьСостояниеБлокировки" Тогда
		ИзменитьСостояниеБлокировкиЗавершение(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеАбонентаИПП

&НаСервере
Процедура НачатьПолучениеАбонентаИПП()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ПолучениеАбонентаИПП";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ПолучитьАбонентаИнтернетПоддержкиФоновоеЗадание";
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеАбонентаИППЗавершение(АдресРезультата)
	
	Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	// Результат проверки доступности сервиса интернет-поддержки.
	Если Результат.ИнтернетПоддержкаДоступна Или Объект.РазделениеВключено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИнтернетПоддержка", "Видимость", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИнтернетПоддержка", "Видимость", Истина);
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		
		Если Объект.РазделениеВключено И Не Результат.ИнтернетПоддержкаДоступна Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось выполнить подключение сервиса в связи с отсутствием прав на использование интернет-поддержки.'")
				+ Символы.ПС
				+ НСтр("ru = 'По вопросу предоставления таких прав обратитесь к специалистам, осуществляющим обслуживание информационной базы в вашей организации.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'При получении данных для подключения к сервису возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;	
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастройкиПодключения", "Доступность", Истина);
	
	Объект.АбонентИПП 					= Результат.Абонент.Наименование;
	Объект.ИдентификаторАбонентаИПП 	= Результат.Абонент.Идентификатор;
	
	Объект.ИмяПриложения = ИнтеграцияУправлениеПерсоналомМенеджер.ПодобратьИмяПриложения();
	Объект.Ответственный = ИнтеграцияУправлениеПерсоналомМенеджер.ПодобратьОтветственногоЗаПриложение();
	
	ОтветственныйПриИзмененииКлиентСервер(ЭтаФорма, Объект.Ответственный);
	
КонецПроцедуры

#КонецОбласти

#Область РезервированиеИмениДомена

&НаСервере
Процедура НачатьРезервированиеИмениДомена()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания 	= "ЗарезервироватьИмяДомена";
	ПараметрыЗадания.ИмяМетода 		= "ИнтеграцияУправлениеПерсоналомМенеджер.ЗарезервироватьИмяДоменаФоновоеЗадание";
	ПараметрыЗадания.ИмяДекорации 	= "ИндикаторДлительнойОперацииРезервированиеИмениДомена";
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("ИмяДомена", 				Объект.ИмяДомена);
	ПараметрыЗадания.ПараметрыМетода.Вставить("ИдентификаторВладельца", Объект.ИдентификаторАбонентаИПП);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура РезервированиеИмениДоменаЗавершение(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При проверке уникальности адреса возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ИмяДоменаЗарезервировано = Результат.Зарезервировано;
	
	Если ИмяДоменаЗарезервировано Тогда
		ЦветТекстаЭУ 		= ЦветСтиляТекстаПоля;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийТекст;
		СообщениеПроверки = СтрШаблон(
				НСтр("ru = 'адрес ""%1"" зарезервирован для вашего сервиса'"),
				СтрокаАдресПриложения());
	Иначе	
		ЦветТекстаЭУ 		= ЦветСтиляПоясняющийОшибкуТекст;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийОшибкуТекст;
		СообщениеПроверки = СтрШаблон(
				НСтр("ru = 'К сожалению, адрес ""%1"" уже занят. Придумайте другой адрес'"),
				СтрокаАдресПриложения());
	КонецЕсли;
	
	Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = СообщениеПроверки;
	Элементы.ДекорацияИмяДоменаПояснение.ЦветТекста = ЦветТекстаСообщения;
	Элементы.ИмяДомена.ЦветТекста = ЦветТекстаЭУ;
	
КонецПроцедуры

#КонецОбласти

#Область Подключение

&НаСервере
Процедура НачатьПодключение()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания 			= "ПодключениеКСервису";
	ПараметрыЗадания.ИмяМетода 				= "ИнтеграцияУправлениеПерсоналомМенеджер.РазвернутьПриложениеФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания 	= Истина;
	
	ПодключениеВыполняется = Истина;
	УстановитьДоступностьЭУПодключенияКСервису(Истина);

	ДанныеДляРазвертывания = Новый Структура;
	ДанныеДляРазвертывания.Вставить("ИмяПриложения", 			СОКРЛП(Объект.ИмяПриложения));
	ДанныеДляРазвертывания.Вставить("ИмяДомена", 				СОКРЛП(Объект.ИмяДомена));
	ДанныеДляРазвертывания.Вставить("ИдентификаторАбонентаИПП", СОКРЛП(Объект.ИдентификаторАбонентаИПП));
	ДанныеДляРазвертывания.Вставить("Администратор", 			Объект.Ответственный);
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("ДанныеДляРазвертывания", ДанныеДляРазвертывания);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ПодключениеКСервисуЗавершение(АдресРезультата)
	
	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	Если Результат.Выполнено Тогда
		
		ПодключениеВыполнено = Истина;
		
		СсылкаДляАдминистратора = Результат.СсылкаДляАдминистратора;
		УстановитьЗаголовокДекорацияПереходДляАдминистратора();
		ИнтеграцияКабинетСотрудника.ВключитьНастройкиПрограммыПослеПодключенияПриложения();
		ВыполнитьНачальноеЗаполнение();
		
	ИначеЕсли Результат.Заказано Тогда
		ВыполнитьНачальноеЗаполнение();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Отключение
&НаКлиенте
Процедура ПриОтветеНаВопросОтключитьСервис(КодВозврата, ДополнительныеПараметры) Экспорт

	Если КодВозврата <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОписаниеСостояния.Доступность 	= Ложь;
	Элементы.СтраницыСостояниеСервиса.Доступность = Ложь;
	
	НачатьОтключениеПриложения(ДополнительныеПараметры.РежимОтключенияУдалить);
	ПриНачалеЗадания();

КонецПроцедуры

&НаСервере
Функция НачатьОтключениеПриложения(УдалитьПриложение)
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания 			= "ОтключениеПриложения";
	ПараметрыЗадания.ИмяМетода 				= "ИнтеграцияУправлениеПерсоналомМенеджер.ОтключитьПриложенияФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания 	= Истина;
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("УдалитьПриложение", УдалитьПриложение);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецФункции

&НаКлиенте
Процедура ОтключениеПриложенияЗавершение(АдресРезультата)
	
	РежимОтключенияПриложенияУдалить = РежимОтключенияПриложенияУдалить(АдресРезультата);
	Если РежимОтключенияПриложенияУдалить = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при отключении. Подробнее см в Журнале регистрации.'");
	ИначеЕсли РежимОтключенияПриложенияУдалить Тогда
		ТекстСообщения = НСтр("ru = 'Приложение 1С:Кабинет сотрудника удалено.'");
	Иначе
		ТекстСообщения = НСтр("ru = 'Сервис отключен.'");
	КонецЕсли;
	
	ПоказатьПредупреждение(,ТекстСообщения);
	ПодключитьОбработчикОжидания("ОтложенноеОбновлениеИнтерфейса", 0.5, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РежимОтключенияПриложенияУдалить(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Результат.УдалитьПриложение;
	
КонецФункции

#КонецОбласти

#Область ПодключениеЛокальнойВерсии

&НаСервере
Процедура НачатьПодключениеКСервисуЛокально()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания 			= "ПодключениеКСервисуЛокально";
	ПараметрыЗадания.ИмяМетода 				= "ИнтеграцияУправлениеПерсоналом.ПодключитьПриложениеЛокальноФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания 	= Истина;
	
	Ключи = Новый Структура("ИдентификаторКлиента,СекретКлиента", КлючИдентификаторКлиента, КлючСекретКлиента);
	
	НастройкиПодключения = Новый Структура("АдресПриложения,АдресСервисаАвторизации,АдресРесурсовAPI,Ответственный,Ключи");
	НастройкиПодключения.АдресПриложения 			= Объект.АдресПриложения;
	НастройкиПодключения.АдресСервисаАвторизации 	= ?(ИспользоватьАдресСервисаАвторизации, Объект.АдресСервисаАвторизации, "");
	НастройкиПодключения.АдресРесурсовAPI			= ?(ИспользоватьАдресРесурсовAPI, Объект.АдресРесурсовAPI, "");
	НастройкиПодключения.Ключи 						= Ключи;
	НастройкиПодключения.Ответственный 				= Объект.Ответственный;
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("НастройкиПодключения", НастройкиПодключения);
	
	ПодключениеВыполняется = Истина;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ПодключениеКСервисуЛокальноЗавершение(АдресРезультата)

	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	СсылкаДляАдминистратора = Результат.СсылкаДляАдминистратора;
	ПодключениеВыполнено = Истина;
	
	УстановитьЗаголовокДекорацияПереходДляАдминистратора();
	ИнтеграцияКабинетСотрудника.ВключитьНастройкиПрограммыПослеПодключенияПриложения();
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеИнформацииОПриложении

&НаСервере
Процедура НачатьПолучениеИнформацииОСервисе()
	
	Если ЕстьКлючиМенеджераСервиса Тогда
		
		Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаСостояниеДлительнаяОперация;
		
		ПараметрыЗадания = ПараметрыФоновогоЗадания();
		ПараметрыЗадания.ИмяЗадания = "ПолучениеИнформацииОСервисе";
		ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ИнформацияОПриложенииФоновоеЗадание";
		
		ЗапуститьФоновоеЗадание(ПараметрыЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеИнформацииОСервисеЗавершение(АдресРезультата)

	Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При получении информации о сервисе возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Объект.ИмяПриложения = Результат.ОписаниеПриложения.Наименование;
	ОбновитьРеквизитыПоОписаниюАдминистратора(Результат.ОписаниеПриложения.Администратор);
	
	Если Результат.Абонент <> Неопределено Тогда
		НаименованиеАбонента = Результат.Абонент.Наименование;
		ИдентификаторПользователяИП = Результат.Абонент.ИдентификаторПользователяИП;
		Если Не ЗначениеЗаполнено(ИдентификаторПользователяИП) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИзменитьПривязкуАбонента", "Видимость", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.ПриложениеЗаблокировано);
	
	Элементы.ИзменитьПривязкуАбонента.Доступность = Истина;
	Элементы.ИзменитьДанныеСервиса.Доступность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыПоОписаниюАдминистратора(ОписаниеАдминистратора)
	
	МобильныйТелефон 	= СОКРЛП(ОписаниеАдминистратора.Телефон);
	ЭлектроннаяПочта 	= СОКРЛП(ОписаниеАдминистратора.АдресЭлектроннойПочты);
	СсылкаСтрока 		= ОписаниеАдминистратора.ФизическоеЛицо;
	
	Идентификатор = ОписаниеАдминистратора.ФизическоеЛицо;
	ТипОбъекта = Перечисления.ТипыОбъектовИнтеграцияУправлениеПерсоналом.ФизическоеЛицо;
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Идентификатор); 
	ПубличныйИдентификаторСсылка = ИнтеграцияУправлениеПерсоналомОбмен.ПубличныйИдентификаторСсылка(Идентификаторы, ТипОбъекта);
	Объект.Ответственный = ПубличныйИдентификаторСсылка[Идентификатор];
	
	ОтветственныйПриИзмененииКлиентСервер(ЭтаФорма, Объект.Ответственный);
	ОбновитьЗаголовокЛичныеКабинеты();
	
	СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта, указанные в приложении: %1, %2'"), МобильныйТелефон, ЭлектроннаяПочта);
	Элементы.ДекорацияТелефонПочтаОтветственногоЗаПриложение.Заголовок = СтрокаТелефонПочта;

КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеСведенийОбОплате()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ОбновлениеСведенийОбОплате";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ОбновлениеСведенийОбОплатеФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСведенийОбОплатеЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При обновлении сведений об оплате возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.ПриложениеЗаблокировано);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеОтветственногоЗаПриложение

 &НаСервере
Процедура НачатьОбновлениеОтветственного(НовыеДанные)
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	ПараметрыЗадания.ИмяЗадания = "ОбновлениеОтветственного";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналом.ОбновлениеОтветственногоФоновоеЗадание";
	ПараметрыЗадания.ПараметрыМетода.Вставить("Ответственный", НовыеДанные.Ответственный);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ОбновлениеОтветственногоЗавершение(АдресРезультата) Экспорт

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Иначе
		Объект.Ответственный = Результат.НовыйОтветственный;
		ОбновитьРеквизитыОтветственныйЗаПриложение();
		ОбновитьЗаголовокЛичныеКабинеты();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыОтветственныйЗаПриложение()
	
	СтрокаТелефонПочта = "";
	ДанныеОтветственного = ДанныеОтветственного(Объект.Ответственный);
	
	СтрокаТелефонПочта = СтрШаблон(НСтр("ru = 'Мобильный телефон и почта, указанные в приложении: %1, %2'"), ДанныеОтветственного.МобильныйТелефон, ДанныеОтветственного.ЭлектроннаяПочта);
	Элементы.ДекорацияТелефонПочтаОтветственногоЗаПриложение.Заголовок = СтрокаТелефонПочта;

КонецПроцедуры

#КонецОбласти

#Область ОбновлениеСвойствПриложения

&НаСервере
Процедура НачатьОбновлениеСвойствПриложения(НовыеДанныеПриложения)
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	ПараметрыЗадания.ИмяЗадания = "ОбновлениеСвойствПриложения";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ОбновитьСвойстваПриложенияФоновоеЗадание";
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("Идентификатор", Объект.ИдентификаторПриложения);
	ПараметрыЗадания.ПараметрыМетода.Вставить("Ответственный");
	ПараметрыЗадания.ПараметрыМетода.Вставить("ИмяПриложения");
	
	Если ЗначениеЗаполнено(НовыеДанныеПриложения.Ответственный) Тогда
		ПараметрыЗадания.ПараметрыМетода.Ответственный = НовыеДанныеПриложения.Ответственный;
	КонецЕсли;
	
	Если Не ПустаяСтрока(НовыеДанныеПриложения.ИмяПриложения) Тогда
		ПараметрыЗадания.ПараметрыМетода.ИмяПриложения = НовыеДанныеПриложения.ИмяПриложения;
	КонецЕсли;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ОбновлениеСвойствПриложенияЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ОписаниеПриложения) Тогда
		Объект.ИмяПриложения = Результат.ОписаниеПриложения.Наименование;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ОписаниеАдминистратора) Тогда
		ОбновитьРеквизитыПоОписаниюАдминистратора(Результат.ОписаниеАдминистратора);
		ОбновитьРеквизитыОтветственныйЗаПриложение();
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеАбонентаИПП

&НаКлиенте
Процедура ИзменитьАбонентаИПП()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ИзменитьАбонентаИПППродолжение", ЭтотОбъект);
	ПараметрыОткрытия = Новый Структура("Приложение,ИдентификаторПользователяИП", Приложение, ИдентификаторПользователяИП);
	
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ИзменитьАбонентаИПП",
		ПараметрыОткрытия, ЭтаФорма,,,,ОповещениеОЗакрытии,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
	
&НаКлиенте
Процедура ИзменитьАбонентаИПППродолжение(Результат, Параметры) Экспорт

	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	НачатьИзменениеАбонентаИПП();
	ПриНачалеЗадания();
	
КонецПроцедуры

&НаСервере
Процедура НачатьИзменениеАбонентаИПП()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ИзменениеАбонентаИнтернетПоддержки";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ИзменитьАбонентаИППФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ИзменениеАбонентаИнтернетПоддержкиЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При изменении данных возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	НаименованиеАбонента = Результат.Абонент.Наименование;
	ИдентификаторПользователяИП = Результат.Абонент.ИдентификаторПользователяИП;
	
	ОбновитьРеквизитыОплаты(Результат.Абонент, Результат.ПриложениеЗаблокировано);
	
КонецПроцедуры

#КонецОбласти

#Область ПолучениеКодаАктивации

&НаСервере
Процедура НачатьПолучениеКодаАктивации()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ПолучениеКодаАктивации";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ПолучениеКодаАктивацииФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаСервере
Процедура ПолучениеКодаАктивацииЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'При получении кода активации возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КодАктивации = Результат.КодАктивации;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"КодАктивации", "Видимость", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеПоКодуАктивации

&НаСервере
Процедура НачатьПроверкуДоступностиИнтернетПоддержки()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ПроверкаДоступностиИнтернетПоддержки";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ПроверкаДоступностиИнтернетПоддержкиФоновоеЗадание";
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура ПроверкаДоступностиИнтернетПоддержкиЗавершение(АдресРезультата)

	Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивация;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ИнтернетПоддержкаДоступна = Результат.ИнтернетПоддержкаДоступна;
	
	Если Объект.РазделениеВключено Тогда
		
		Если Не ИнтернетПоддержкаДоступна Тогда
			ТекстСообщения = НСтр("ru = 'Для активации подключения сервиса требуется доступ к Интернет-поддержке.'")
				+ Символы.ПС
				+ НСтр("ru = 'Отсутствуют права на использование Интернет-поддержки.'")
				+ Символы.ПС
				+ НСтр("ru = 'По вопросу предоставления таких прав обратитесь к специалистам, осуществляющим обслуживание информационной базы в вашей организации.'");
			Элементы.ДекорацияНетПравИнтернетПоддержка.Заголовок = ТекстСообщения;
			Элементы.ДекорацияНетПравИнтернетПоддержка.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		Если Не ИнтернетПоддержкаДоступна Тогда
			ТекстСообщения = НСтр("ru = 'При проверки доступности Интернет-поддержки возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			Элементы.ГруппаИнтернетПоддержка.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ГруппаВводКодаАктивации.Доступность = ИнтернетПоддержкаДоступна;
	Элементы.ГруппаАктивацияОтключение.Доступность = ИнтернетПоддержкаДоступна;

КонецПроцедуры

&НаСервере
Процедура НачатьПодключениеПоКодуАктивации()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ПодключениеПоКодуАктивации";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналомМенеджер.ПодключениеПоКодуАктивацииФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("КодАктивации", КодАктивации);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания)

КонецПроцедуры

&НаСервере
Процедура ПодключениеПоКодуАктивацииЗавершение(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		
		Если Не Результат.ИнтернетПоддержкаДоступна Тогда
			Если Объект.РазделениеВключено Тогда
				ТекстСообщения = НСтр("ru = 'Отсутствуют права на использование Интернет-поддержки.'")
					+ Символы.ПС
					+ НСтр("ru = 'По вопросу предоставления таких прав обратитесь к специалистам, осуществляющим обслуживание информационной базы в вашей организации.'");
			Иначе
				ТекстСообщения = НСтр("ru = 'При проверки доступности Интернет-поддержки возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
			КонецЕсли;
		ИначеЕсли Результат.НеправильныйКодАктивации Тогда
			ТекстСообщения = НСтр("ru = 'Неправильный код активации.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'При подключении сервиса возникла ошибка:'") + Символы.ПС + Результат.СообщениеОбОшибке;
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ПодключениеВыполнено = Истина;
	ВыполнитьНачальноеЗаполнение();
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаОтложенногоПодключения

&НаСервере
Процедура НачатьПроверкуОтложенногоПодключения()
	
	СостояниеПодключения = ИнтеграцияУправлениеПерсоналомМенеджер.СостояниеПодключенияПриложения(Приложение);
	Если СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияПриложения.ОжиданиеПодключения Тогда
		ПараметрыЗадания = ПараметрыФоновогоЗадания();
		ПараметрыЗадания.ИмяЗадания 	= "ПроверкаОтложенногоПодключения";
		ПараметрыЗадания.ИмяМетода 		= "ИнтеграцияУправлениеПерсоналомМенеджер.ПроверитьСостояниеПодключенияФоновоеЗадание";
		ПараметрыЗадания.ВыводитьОкноОжидания = Истина;
		ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	ИначеЕсли СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияПриложения.ОшибкаСоздания Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось подключить сервис. Подробности см. в журнале регистрации.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ОбновитьЭУОтложенноеПодключение(Истина);
	Иначе
		ВыполнитьНачальноеЗаполнение();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверкаОтложенногоПодключенияЗавершение(АдресРезультата)

	ПодключениеВыполняется = Ложь;
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.СообщениеОбОшибке <> Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.СообщениеОбОшибке);
		ОбновитьЭУОтложенноеПодключение(Истина);
		Возврат;
	КонецЕсли;
	
	Если Результат.Выполнено Тогда
		
		ПодключениеВыполняется = Ложь;
		ПодключениеВыполнено = Истина;
		
		Константы.ИспользуетсяСервисКабинетСотрудника.Установить(Истина);
		// удаляем сведения отложенного подключения
		ИнтеграцияУправлениеПерсоналомМенеджер.ОчиститьСостояниеПодключенияПриложения(Приложение);
		
		СсылкаДляАдминистратора = Результат.СсылкаДляАдминистратора;
		УстановитьЗаголовокДекорацияПереходДляАдминистратора();
		ИнтеграцияКабинетСотрудника.ВключитьНастройкиПрограммыПослеПодключенияПриложения();
		ВыполнитьНачальноеЗаполнение();
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Подключение к сервису еще не выполнено, повторите проверку позже.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьЭУОтложенноеПодключение(ОшибкаСоздания)

	Элементы.СоздатьНовоеПодключение.Видимость = ОшибкаСоздания И ПолноправныйПользователь;
	Элементы.ГруппаПроверитьПодключение.Видимость = Не ОшибкаСоздания И ПолноправныйПользователь;
	
	ТекстЗаголовка = НСтр("ru = 'Заявка на подключение к сервису отправлена.
		|Эту форму можно закрыть, подключение будет продолжено.
		|Для подключения потребуется некоторое время (от нескольких минут до нескольких часов). После завершения подключения будет направлено письмо на адрес электронной почты ответственного.'");
	
	Если ОшибкаСоздания Тогда
		ТекстЗаголовка = НСтр("ru = 'При подключении к сервису возникли ошибки. Подробности в журнале регистрации.
			|Обратитесь в отдел технической поддержки сервиса по адресу support@1c-cabinet.ru'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ДекорацияОтложенноеПодключение",
			"Заголовок", ТекстЗаголовка);

КонецПроцедуры

#КонецОбласти

#Область ИнтернетПоддержкаПользователей

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуПользователей()

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект);
		Модуль.ПодключитьИнтернетПоддержкуПользователей(ОповещениеОЗакрытии, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, Параметры) Экспорт

	Если Результат <> Неопределено Тогда
		Если ФормаВРежимеПодключения Тогда
			НачатьПолучениеАбонентаИПП();
			ПриНачалеЗадания();
		ИначеЕсли ФормаВРежимеАктивации Тогда
			Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивацияДлительнаяОперация;
			НачатьПроверкуДоступностиИнтернетПоддержки();
			ПриНачалеЗадания();
		Иначе
			ИзменитьАбонентаИПП();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИнтернетПоддержкаПодключена()

	МодульИПП = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
	Возврат МодульИПП.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();	

КонецФункции

#КонецОбласти

#Область ОбработчикиОповещения

&НаКлиенте
Процедура ОбновитьИнформациюПодключения(Результат, Параметры) Экспорт

	ОбновитьИнформациюПодключенияНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанныеСервисаЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Результат.ИмяПриложения) И Не ЗначениеЗаполнено(Результат.Ответственный) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ПриложениеВЛокальнойСети Тогда
		НачатьОбновлениеОтветственного(Результат);
	Иначе
		НачатьОбновлениеСвойствПриложения(Результат);
	КонецЕсли;
	ПриНачалеЗадания();
		
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьРасчетныеЛисткиЗавершение(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		Возврат;
	ИначеЕсли ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		Если Результат.БылиОшибки Тогда
			СообщениеОбОшибке = НСтр("ru = 'Публикация расчетных листков завершена с ошибками.'");
			ПоказатьПредупреждение(, СообщениеОбОшибке);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидыКонтактнойИнформацииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидКИМобильныйТелефон <> Результат.ВидКИМобильныйТелефон Или Объект.ВидКИАдресЭлектроннойПочты <> Результат.ВидКИАдресЭлектроннойПочты Тогда
		СообщениеОбОшибке = Неопределено;
		СохранитьНовыеВидыКонтактнойИнформации(Результат.ВидКИМобильныйТелефон, Результат.ВидКИАдресЭлектроннойПочты, СообщениеОбОшибке);
		Если СообщениеОбОшибке = Неопределено Тогда
			Оповестить("ОбновитьСписокОшибокЗаполненияИнтеграцияУправлениеПерсоналом");
		Иначе	
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбслуживаниеСервиса

&НаКлиенте
Процедура ВыполнитьОбменССервисом()
	
	Если ОбменССервисомЗаблокирован() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = ДлительнаяОперацияВыполнитьОбмен();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Обмен выполнен.'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьОбменЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнитьОбмен()
	
	ПараметрыПроцедуры = Новый Структура("ПодготовитьДанныеДляТехПоддержки", Ложь);
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		СтрШаблон(НСтр("ru = 'Выполнение обмена с сервисом 1С:Кабинет сотрудника'")));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияКабинетСотрудника.ВыполнитьОбменФоновоеЗадание",
		ПараметрыПроцедуры,
		ПараметрыВыполненияВФоне);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	ОбновитьРезультатОбменаНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультатОбменаНаСервере()
	
	Событие = Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.Обмен;
	РезультатОбмена = РегистрыСведений.СобытияОбменаУправлениеПерсоналом.СобытиеОбмена(Приложение, Событие);
	Если Не ЗначениеЗаполнено(РезультатОбмена.ДатаНачала) Тогда
		Элементы.ДекорацияРезультатОбмена.Заголовок = НСтр("ru = 'Обмен с сервисом еще не выполнялся'");
		Элементы.ОткрытьЖурналРегистрации.Видимость = Ложь;
	Иначе
		Элементы.ОткрытьЖурналРегистрации.Видимость = ЕстьПраваНаПросмотрЖурналаРегистрации;
		СтрокаШаблон = НСтр("ru = 'Обмен выполнен: %1'");
		СтрокаЗаголовок = СтрШаблон(СтрокаШаблон, РезультатОбмена.ДатаОкончания);
		ЦветТекстаСообщения = ЦветСтиляИнформационнойНадписи;
		Если РезультатОбмена.БылиОшибки Тогда
			ЦветТекстаСообщения = ЦветСтиляПоясняющийОшибкуТекст;
			СтрокаБылиОшибки = НСтр("ru = 'При выполнении были ошибки.'");
			СтрокаЗаголовок = СтрШаблон("%1 %2", СтрокаЗаголовок, СтрокаБылиОшибки);
		КонецЕсли;
		Элементы.ДекорацияРезультатОбмена.ЦветТекста = ЦветТекстаСообщения;
		Элементы.ДекорацияРезультатОбмена.Заголовок = СтрокаЗаголовок;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СогласияЭДОБЗК

&НаСервереБезКонтекста
Процедура СохранитьНастройкуСпособПолученияСогласияНаПрисоединениеКЭДОБЗК(СпособПолучения)
	РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеСпособПолученияСогласияНаПрисоединениеКЭДОБЗК(СпособПолучения);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АвтоФормированиеСогласийПриИзмененииНаСервере(АвтоФормированиеСогласий)
	Константы.АвтоматическиФормироватьСогласияНаПрисоединениеКЭДОБЗК.Установить(АвтоФормированиеСогласий);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСогласияДлительнаяОперация(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
			ПараметрыВыполнения,
			"ЭДОБЗК.СформироватьСогласияНаПрисоединениеКЭДОБЗК",
			ИнтеграцияКабинетСотрудника.ДанныеДляФормированияСогласийНаПрисоединениеКЭДОБЗК(),
			Истина);
			
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура СформироватьСогласияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Формирование согласий завершено'"));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОткрытияШаблонаСогласия()
	
	МетаданныеСогласия = Метаданные.Документы.СогласиеНаПрисоединениеКЭДОБЗК;
	МакетСогласия = Неопределено;
	МакетСогласия = МетаданныеСогласия.Макеты.ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК_БумажныйДокумент;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИмяОбъектаМетаданныхМакета", СтрЗаменить(МакетСогласия.ПолноеИмя(), "Макет.", ""));
	ПараметрыОткрытия.Вставить("ТипМакета", "MXL");
	ПараметрыОткрытия.Вставить("Владелец", Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(МетаданныеСогласия, Ложь));
	ПараметрыОткрытия.Вставить("ИмяДокумента", МакетСогласия.Синоним);
	ПараметрыОткрытия.Вставить("Редактирование", Истина);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

#КонецОбласти

#Область Прочие

&НаКлиенте
Функция ИмяДоменаСоответствуетПравилам(Текст = Неопределено)
	
	РезультатПроверки = ИнтеграцияУправлениеПерсоналомКлиента.ПроверитьИмяДомена(Объект.ИмяДомена, Текст, Объект.РазрешенныеСимволыИмениДомена);
	
	ИмяДоменаСоответствуетПравилам 	= РезультатПроверки.ИмяДоменаСоответствуетПравилам;
	СообщениеПроверкиИмениДомена 	= РезультатПроверки.СообщениеОбОшибке;
	
	Если ПустаяСтрока(СообщениеПроверкиИмениДомена) Тогда
		ЦветТекста 			= ЦветСтиляТекстаПоля;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийТекст;
	Иначе
		ЦветТекста 			= ЦветСтиляПоясняющийОшибкуТекст;
		ЦветТекстаСообщения = ЦветСтиляПоясняющийОшибкуТекст;
	КонецЕсли;
	
	Элементы.ИмяДомена.ЦветТекста 					= ЦветТекста;
	Элементы.ДекорацияИмяДоменаПояснение.Заголовок  = СообщениеПроверкиИмениДомена;
	Элементы.ДекорацияИмяДоменаПояснение.ЦветТекста = ЦветТекстаСообщения;
	
	Возврат ИмяДоменаСоответствуетПравилам;
	
КонецФункции

&НаКлиенте
Процедура ОтложенноеОбновлениеИнтерфейса()

	ОбновитьИнтерфейс();

КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюПодключенияНаСервере()
	
	Если СервисПодключен Тогда
		ОбновитьЗаголовокЛичныеКабинеты();
	Иначе
		ОбновитьСообщениеОПубликации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьСценарийОтложенногоПодключения()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ЗавершитьСценарийОтложенногоПодключения";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияКабинетСотрудника.ЗавершитьСценарийОтложенногоПодключенияФоновоеЗадание";
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);

КонецПроцедуры

&НаСервере
Процедура НачатьПубликациюДанных()
	
	ПараметрыМетода = Новый Массив();
	Если Не ЗначениеЗаполнено(ПериодыРасчетныхЛистков) Тогда
		РассчитатьПериодРасчетныхЛистков();
	КонецЕсли;
	ПараметрыМетода.Добавить(ПериодыРасчетныхЛистков);
	ФоновыеЗадания.Выполнить("ИнтеграцияКабинетСотрудника.ВыполнитьОбменПослеПодключенияПриложения", ПараметрыМетода);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыОплаты(АбонентСервиса, СервисЗаблокирован)

	ИспользуетсяПробныйПериод 			= АбонентСервиса.ИспользуетсяПробныйПериод;
	ОплаченоКабинетов 					= АбонентСервиса.ОплаченоКабинетов;
	НаименованиеАбонента 				= АбонентСервиса.Наименование;
	КоличествоАктивированныхКабинетов 	= АбонентСервиса.КоличествоАктивированныхКабинетов;
	
	Если ЗначениеЗаполнено(АбонентСервиса.ДатаОкончанияПробногоПериода) Тогда
		ДатаОкончанияПробногоПериода = АбонентСервиса.ДатаОкончанияПробногоПериода;
	КонецЕсли;
	Если ЗначениеЗаполнено(АбонентСервиса.ДатаОкончанияОплаченногоПериода) Тогда
		ДатаОкончанияОплаченногоПериода = АбонентСервиса.ДатаОкончанияОплаченногоПериода;
	КонецЕсли;
	
	Строка1 = "";
	Если ИспользуетсяПробныйПериод И ЗначениеЗаполнено(ДатаОкончанияПробногоПериода) Тогда
		ШаблонСтроки = НСтр("ru = 'Используется пробный период по: %1'");
		Строка1 = СтрШаблон(ШаблонСтроки, Формат(ДатаОкончанияПробногоПериода, "ДЛФ=D"));
	КонецЕсли;
	Строка2 = "";
	Если ОплаченоКабинетов > 0 Тогда
		ШаблонСтроки = НСтр("ru = 'Оплачено кабинетов: %1 по %2'");
		Строка2 = СтрШаблон(ШаблонСтроки, ОплаченоКабинетов, Формат(ДатаОкончанияОплаченногоПериода, "ДЛФ=D"));
	Иначе
		Строка2 = НСтр("ru = 'Нет оплаченных кабинетов'");
	КонецЕсли;
	Строка3 = "";
	Если КоличествоАктивированныхКабинетов <> Неопределено Тогда
		Если КоличествоАктивированныхКабинетов > 0 Тогда
			ШаблонСтроки = НСтр("ru = 'Создано кабинетов: %1'");
			Строка3 = СтрШаблон(ШаблонСтроки, КоличествоАктивированныхКабинетов);
		Иначе
			Строка3 = НСтр("ru = 'Нет созданных кабинетов'");
		КонецЕсли;
	КонецЕсли;
	ПереводСтроки = Символы.ПС;
	СтрокаСостояниеОплаты = СтрШаблон("%1%2%3%4%5", Строка1, ?(ПустаяСтрока(Строка1),"",ПереводСтроки), Строка2, ?(ПустаяСтрока(Строка2),"",ПереводСтроки), Строка3);
	Элементы.ДекорацияСостояниеОплаты.Заголовок = СтрокаСостояниеОплаты;
	
	ЗаголовокСервисЗаблокирован = "";
	Если СервисЗаблокирован <> Неопределено Тогда
		РегистрыСведений.НастройкиСервисаКабинетСотрудника.УстановитьСостояниеБлокировкиСервиса(СервисЗаблокирован);
		Если СервисЗаблокирован Тогда
			Если ОплаченоКабинетов = 0 Тогда
				ЗаголовокСервисЗаблокирован = НСтр("ru = 'Доступ к сервису ограничен: закончился оплаченный (тестовый) период'");
			Иначе
				ЗаголовокСервисЗаблокирован = НСтр("ru = 'Доступ к сервису ограничен: превышен оплаченный лимит на создание личных кабинетов'");
			КонецЕсли;
		КонецЕсли;
		Элементы.ДекорацияБлокировкаСервиса.Заголовок = ЗаголовокСервисЗаблокирован;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ДекорацияБлокировкаСервиса", "Видимость", Не ПустаяСтрока(ЗаголовокСервисЗаблокирован));
	
КонецПроцедуры

&НаСервере
Функция СтрокаАдресПриложения()
	
	ИмяДоменаВАдрес = ?(ПустаяСтрока(Объект.ИмяДомена),"<"+НСтр("ru = 'ваш сервис'")+">",СОКРЛП(Объект.ИмяДомена));
	Возврат СтрШаблон("%1%2",ИмяДоменаВАдрес,".1c-cabinet.ru");

КонецФункции

&НаСервере
Процедура ОбновитьСообщениеОПубликации()
	
	ТекстЗаголовка = "";
	АдресПриложения = СтрокаАдресПриложения();
	ПредставлениеПериодаРЛ = "";
	Если ПериодыРасчетныхЛистков.Количество() > 0 Тогда
		Дата2 = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ПериодыРасчетныхЛистков[0]);
		Дата1 = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ПериодыРасчетныхЛистков[1]);
		ПредставлениеПериодаРЛ = СтрШаблон("%1 - %2", Дата1, Дата2);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОшибкиЗаполнения.БлокирующаяОшибка КАК ЕстьОшибки
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ВыгружаемыеОбъекты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВыгружаемыеОбъекты.Ссылка = Сотрудники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиЗаполненияОбъектовУправлениеПерсоналом КАК ОшибкиЗаполнения
	|		ПО (Сотрудники.ФизическоеЛицо = ОшибкиЗаполнения.Ссылка)
	|			И (ОшибкиЗаполнения.БлокирующаяОшибка)
	|			И (ОшибкиЗаполнения.Приложение = ЗНАЧЕНИЕ(Перечисление.ПриложенияДляИнтеграции.КабинетСотрудника))";
	УстановитьПривилегированныйРежим(Истина);
	ПубликуемыеКабинеты = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Если ПубликуемыеКабинеты.Количество() = 0 Тогда
		
		СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные ответственного лица.'");
		ТекстЗаголовка = СтрШаблон(СтрокаШаблон, АдресПриложения);
		
	Иначе
		
		КоличествоКабинетов = ПубликуемыеКабинеты.Количество();
		НайденныеСтроки = ПубликуемыеКабинеты.НайтиСтроки(Новый Структура("ЕстьОшибки", Истина));
		КоличествоОшибок = НайденныеСтроки.Количество();
		ПубликуемыхКабинетов = КоличествоКабинетов - КоличествоОшибок;
		
		НайденныеСтроки = ПубликуемыеКабинеты.НайтиСтроки(Новый Структура("ФизическоеЛицо", Объект.Ответственный));
		ОтветственныйПубликуется = (НайденныеСтроки.Количество() > 0);
		
		ТекстДанныеДоступны = НСтр("ru = 'Эти данные будут доступны только сотрудникам и их руководителям'");
		
		ТекстСотрудники = "";
		Если ПубликуемыхКабинетов = 1 Или ПубликуемыхКабинетов > 11 И Прав(Строка(ПубликуемыхКабинетов),2) <> "11" И Прав(Строка(ПубликуемыхКабинетов),1) = "1" Тогда
			ТекстСотрудники = НСтр("ru = 'сотрудника'");
		Иначе
			ТекстСотрудники = НСтр("ru = 'сотрудников'");
		КонецЕсли;
		
		ТекстРасчетныеЛистки = "";
		Если Не ПустаяСтрока(ПредставлениеПериодаРЛ) Тогда
			Если ПубликуемыхКабинетов > 1 Тогда
				СтрСообщение = НСтр("ru = 'и их расчетные листки за'");
			Иначе
				СтрСообщение = НСтр("ru = 'и его расчетные листки за'");
			КонецЕсли;
			ТекстРасчетныеЛистки = СтрШаблон("%1 %2", СтрСообщение, ПредставлениеПериодаРЛ);
		КонецЕсли;
		
		Если Не ОтветственныйПубликуется Тогда
			
			Если ПустаяСтрока(ТекстРасчетныеЛистки) Тогда
				СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные ответственного лица и данные %2 %3.'");
				ТекстЗаголовка = СтрШаблон(СтрокаШаблон, АдресПриложения, ПубликуемыхКабинетов, ТекстСотрудники);
			Иначе
				СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные ответственного лица, данные %2 %3 %4.'");
				ТекстЗаголовка = СтрШаблон(СтрокаШаблон, АдресПриложения, ПубликуемыхКабинетов, ТекстСотрудники, ТекстРасчетныеЛистки);
				ТекстЗаголовка  = СтрШаблон("%1%2%3",ТекстЗаголовка,  Символы.ПС,  ТекстДанныеДоступны);
			КонецЕсли;
			
		Иначе 
			
			Если ПубликуемыхКабинетов = 1 Тогда
				СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные ответственного лица'");
				ТекстЗаголовка = СтрШаблон(СтрокаШаблон, АдресПриложения);
				Если ПустаяСтрока(ТекстРасчетныеЛистки) Тогда
					ТекстЗаголовка = СтрШаблон("%1.", ТекстЗаголовка);
				Иначе
					ТекстЗаголовка = СтрШаблон("%1 %2.", ТекстЗаголовка, ТекстРасчетныеЛистки);
				КонецЕсли;
			Иначе
				СтрокаШаблон = НСтр("ru = 'При нажатии кнопки Подключить по адресу ""%1"" будут опубликованы данные %2 %3'");
				ТекстЗаголовка = СтрШаблон(СтрокаШаблон, АдресПриложения, ПубликуемыхКабинетов, ТекстСотрудники); 
				Если ПустаяСтрока(ТекстРасчетныеЛистки) Тогда
					ТекстЗаголовка = СтрШаблон("%1.", ТекстЗаголовка);
				Иначе
					ТекстЗаголовка = СтрШаблон("%1 %2.%3%4", ТекстЗаголовка, ТекстРасчетныеЛистки, Символы.ПС, ТекстДанныеДоступны);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Элементы.ДекорацияПодключениеОписание.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПериодРасчетныхЛистков()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НачислениеЗарплаты.МесяцНачисления КАК МесяцНачисления
	|ИЗ
	|	Документ.НачислениеЗарплаты КАК НачислениеЗарплаты
	|ГДЕ
	|	НачислениеЗарплаты.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	МесяцНачисления УБЫВ";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Периоды = Новый Массив;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Периоды.Добавить(Выборка.МесяцНачисления);
		Периоды.Добавить(ДобавитьМесяц(Выборка.МесяцНачисления,-1));
	КонецЕсли;
	 
	ПериодыРасчетныхЛистков = Новый ФиксированныйМассив(Периоды);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокДекорацияПереходДляАдминистратора()
	
	ШаблонЗаголовка = НСтр("ru = '<body>Сервис 1С:Кабинет сотрудника подключен.
	|Если вы - %1, тогда <a href=""%2"">%3</a> для авторизации в сервисе.</body>'");
	
	СтрокаЗаголовка = СтрШаблон(ШаблонЗаголовка, Строка(Объект.Ответственный), СсылкаДляАдминистратора, НСтр("ru = 'перейдите сюда'"));
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовка + "</html>", Новый Структура);
	Элементы.ДекорацияПереходДляАдминистратора.Заголовок =ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюОСервисеИзНастроек()
	
	СтруктураНастроек = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	Объект.АдресПриложения 					= СтруктураНастроек.АдресПриложения;
	Объект.АдресПриложенияПоИмени 			= СтруктураНастроек.АдресПриложенияПоИмени;
	Объект.АдресПриложенияПоИмениДоступен 	= СтруктураНастроек.АдресПриложенияПоИмениДоступен;
	Объект.АдресСервисаАвторизации 			= СтруктураНастроек.АдресСервисаАвторизации;
	Объект.ИдентификаторПриложения 			= СтруктураНастроек.ИдентификаторПриложения;
	Объект.ИмяПриложения 					= СтруктураНастроек.НаименованиеПриложения;
	Объект.Ответственный 					= СтруктураНастроек.Ответственный;
	Объект.РегламентныеЗаданияЗаблокированы = СтруктураНастроек.РегламентныеЗаданияЗаблокированы;
	Объект.АдресРесурсовAPI 				= СтруктураНастроек.АдресРесурсовAPI;
	
	ЕстьАдресПриложенияПоИмени = Не ПустаяСтрока(Объект.АдресПриложенияПоИмени);
	ПоказыватьВременныйАдрес = ЕстьАдресПриложенияПоИмени И Не Объект.АдресПриложенияПоИмениДоступен;
	
	Элементы.ДекорацияАдресПриложенияВременный.Видимость = ПоказыватьВременныйАдрес;
	Элементы.ГруппаПроверкаДоступностиАдреса.Видимость = ПоказыватьВременныйАдрес;
	
	ШаблонЗаголовкаАдресПриложения = НСтр("ru = '<body>Адрес сервиса: <a href=""%1"">%2</a></body>'");
	Если ПоказыватьВременныйАдрес Тогда
		
		Элементы.ДекорацияАдресПриложения.Доступность = Ложь;
		УстановитьЗаголовокСостояниеАдресаПоИмени();
		
		СтрокаЗаголовкаДекорацияАдресПриложения = СтрШаблон(ШаблонЗаголовкаАдресПриложения, Объект.АдресПриложенияПоИмени, Объект.АдресПриложенияПоИмени);
		
		ШаблонЗаголовкаАдресВременный = НСтр("ru = '<body>Сервис доступен по адресу: <a href=""%1"">%2</a></body>'");
		СтрокаЗаголовкаАдресВременный = СтрШаблон(ШаблонЗаголовкаАдресВременный, Объект.АдресПриложения, Объект.АдресПриложения);
		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовкаАдресВременный + "</html>", Новый Структура);
		Элементы.ДекорацияАдресПриложенияВременный.Заголовок = ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
		
	ИначеЕсли ЕстьАдресПриложенияПоИмени Тогда
		СтрокаЗаголовкаДекорацияАдресПриложения = СтрШаблон(ШаблонЗаголовкаАдресПриложения, Объект.АдресПриложенияПоИмени, Объект.АдресПриложенияПоИмени);
	Иначе
		СтрокаЗаголовкаДекорацияАдресПриложения = СтрШаблон(ШаблонЗаголовкаАдресПриложения, Объект.АдресПриложения, Объект.АдресПриложения);
	КонецЕсли;
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовкаДекорацияАдресПриложения + "</html>", Новый Структура);
	Элементы.ДекорацияАдресПриложения.Заголовок = ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
	
	Элементы.ДекорацияПереносОплатыИнформация.Видимость = Объект.РазделениеВключено;
	Если Объект.РазделениеВключено Тогда
		ШаблонЗаголовка = НСтр("ru = '<body>Порядок переноса сведений об оплате сервиса 1С:Кабинет сотрудника <a href=""%1"">%2</a></body>'");
		СтрокаЗаголовка = СтрШаблон(ШаблонЗаголовка, "https://its.1c.ru/db/partnerits#content:3763:hdoc", НСтр("ru = 'см тут'"));
		ФорматированныйДокумент = Новый ФорматированныйДокумент;
		ФорматированныйДокумент.УстановитьHTML("<html>" + СтрокаЗаголовка + "</html>", Новый Структура);
		Элементы.ДекорацияПереносОплатыИнформация.Заголовок = ФорматированныйДокумент.ПолучитьФорматированнуюСтроку();
	КонецЕсли;
	
	ШаблонЗаголовка = НСтр("ru = 'При отключении будет удален сервис по адресу %1 и все его данные.
		|Для повторного подключения к сервису необходимо будет заново создать все кабинеты сотрудников и разослать приглашения.'");
	ЗаголовокУдалениеСервиса = СтрШаблон(ШаблонЗаголовка, АдресСервиса(ЭтаФорма));
	Элементы.ДекорацияУдалитьСервисПояснение.Заголовок = ЗаголовокУдалениеСервиса;
	
	ШаблонЗаголовка = НСтр("ru = 'При отключении данные больше не будут публиковаться в сервисе, будут удалены все настройки подключения.
		|Сервис по адресу %1 не будет удален.'");
	ЗаголовокОтключениеСервиса = СтрШаблон(ШаблонЗаголовка, АдресСервиса(ЭтаФорма));
	Элементы.ДекорацияОтключитьСервисПояснение.Заголовок = ЗаголовокОтключениеСервиса;
	Элементы.ДекорацияОтключитьСервисЛокальноПояснение.Заголовок = ЗаголовокОтключениеСервиса;
	
	Если Объект.РазделениеВключено Тогда
		Строка1 =  НСтр("ru = 'Код активации используется для подключения к сервису 1С:Кабинет сотрудника после переноса данных из облачного сервиса.'");
	Иначе
		Строка1 =  НСтр("ru = 'Код активации используется для подключения к сервису 1С:Кабинет сотрудника после переноса данных в облачный сервис.'");
	КонецЕсли;
	Строка2 =  НСтр("ru = 'После подключения другого приложения по коду активации доступ к сервису из этого приложения будет недоступен.'");
	ЗаголовокКодАктивации = СтрШаблон("%1%2%3", Строка1, Символы.ПС, Строка2);
	Элементы.ДекорацияПолучениеКодаАктивацииОписание.Заголовок = ЗаголовокКодАктивации;
	
	ОбновитьРеквизитыОтветственныйЗаПриложение();
	ОбновитьЗаголовокЛичныеКабинеты();
	
	СтрокаШаблон = НСтр("ru = 'Последние опубликованные расчетные листки:'");
	УстановитьПривилегированныйРежим(Истина);
	МесяцПубликацииПоследней = РегистрыСведений.РасчетныеЛисткиКабинетСотрудника.МесяцПубликацииРасчетныхЛистков();
	УстановитьПривилегированныйРежим(Ложь);
	Если ЗначениеЗаполнено(МесяцПубликацииПоследней) Тогда
		МесяцПубликации = ДобавитьМесяц(МесяцПубликацииПоследней, 1);
		МесяцПубликацииРасчетныхЛистков = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(МесяцПубликацииПоследней);
	Иначе
		МесяцПубликации = НачалоМесяца(ТекущаяДатаСеанса());
		МесяцПубликацииРасчетныхЛистков = НСтр("ru = 'Публикация не выполнялась'");
	КонецЕсли;
	Элементы.ДекорацияРасчетныеЛисткиПубликация.Заголовок = СтрШаблон("%1 %2", СтрокаШаблон, МесяцПубликацииРасчетныхЛистков);
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтаФорма, "МесяцПубликации", "МесяцПубликацииСтрокой");
	
	СтрокаСостояниеОплаты = НСтр("ru = 'Информация об оплаченных кабинетах отсутствует'");
	Элементы.ДекорацияСостояниеОплаты.Заголовок = СтрокаСостояниеОплаты;
	
	Элементы.ГруппаАбонентСервиса.Видимость 	= Не Объект.ПриложениеВЛокальнойСети;
	Элементы.ГруппаНазваниеСервиса.Видимость 	= Не Объект.ПриложениеВЛокальнойСети;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьАдресСервисаАвторизации", "Видимость", Объект.ПриложениеВЛокальнойСети);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИзменитьАдресРесурсовAPI", "Видимость", Объект.ПриложениеВЛокальнойСети);
	
	УстановитьДоступностьБлокировкаРегламентныхЗаданий();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокЛичныеКабинеты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ФизическиеЛица.Ссылка) КАК Количество,
	|	КОЛИЧЕСТВО(ОшибкиЗаполнения.БлокирующаяОшибка) КАК КоличествоСОшибками
	|ИЗ
	|	РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОшибкиЗаполненияОбъектовУправлениеПерсоналом КАК ОшибкиЗаполнения
	|		ПО ФизическиеЛица.Ссылка = ОшибкиЗаполнения.Ссылка
	|			И (ОшибкиЗаполнения.БлокирующаяОшибка)
	|			И (ОшибкиЗаполнения.Приложение = ЗНАЧЕНИЕ(Перечисление.ПриложенияДляИнтеграции.КабинетСотрудника))
	|ГДЕ
	|	ФизическиеЛица.Ссылка ССЫЛКА Справочник.ФизическиеЛица
	|	И НЕ ФизическиеЛица.ВыгружаетсяПоСсылке";
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	ПубликуемыхКабинетов = 0;
	КоличествоКабинетовСОшибками = 0;
	Если Выборка.Следующий() Тогда
		ПубликуемыхКабинетов = Выборка.Количество - Выборка.КоличествоСОшибками;
		КоличествоКабинетовСОшибками = Выборка.КоличествоСОшибками;
	КонецЕсли;
	
	СтрокаШаблон =  НСтр("ru = 'Сейчас в сервисе публикуются данные для %1'");
	Если ПубликуемыхКабинетов = 1 Тогда
		СтрокаПодстановки = НСтр("ru = '1 сотрудника'");
	Иначе
		СтрокаПодстановки = СтрШаблон(НСтр("ru = '%1 сотрудников'"), ПубликуемыхКабинетов);
	КонецЕсли;
	ТекстСообщения = СтрШаблон(СтрокаШаблон, СтрокаПодстановки);
	Элементы.ДекорацияЛичныеКабинеты.Заголовок = ТекстСообщения;
	
	ЕстьОшибкиЗаполнения = (КоличествоКабинетовСОшибками > 0);
	Элементы.ОшибкиЗаполненияКабинеты.Видимость = ЕстьОшибкиЗаполнения;
	Если ЕстьОшибкиЗаполнения Тогда
		СтрокаШаблон =  НСтр("ru = 'Не публикуются кабинеты из-за ошибок заполнения для %1'");
		Если КоличествоКабинетовСОшибками = 1 Тогда
			СтрокаПодстановки = НСтр("ru = '1 сотрудника'");
		Иначе
			СтрокаПодстановки = СтрШаблон(НСтр("ru = '%1 сотрудников'"), КоличествоКабинетовСОшибками);
		КонецЕсли;
		ТекстСообщенияНеПубликуется = СтрШаблон(СтрокаШаблон, СтрокаПодстановки);
		Элементы.ОшибкиЗаполненияКабинеты.Заголовок = ТекстСообщенияНеПубликуется;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияОпубликоватьРасчетныеЛистки()
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.Вставить("НаименованиеФоновогоЗадания",
		СтрШаблон(НСтр("ru = 'Выгрузка расчетных листов в 1С:Кабинет сотрудника'")));
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияКабинетСотрудника.ОпубликоватьРасчетныеЛистыЗаМесяцВФоне",
		Новый Структура("Месяц", МесяцПубликации),
		ПараметрыВыполненияВФоне);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаСервере
Процедура ПерейтиКНовомуПодключению()

	ИнтеграцияУправлениеПерсоналомМенеджер.ОчиститьСостояниеПодключенияПриложения(Приложение);
	УстановитьДоступностьЭУПодключенияКСервису(Ложь);
	ВыполнитьНачальноеЗаполнение();

КонецПроцедуры

&НаСервере
Процедура ВыполнитьНачальноеЗаполнение()

	НачатьСценарийПодключения 						= Ложь;
	НачатьПолучениеИнформацииОСервисе 				= Ложь;
	ОтложенноеПодключениеКСервису 					= Ложь;
	ФормаВРежимеАктивации 							= Ложь;
	Элементы.СоздатьНовоеПодключение.Видимость 		= Ложь;
	Элементы.ГруппаБлокировкаДоступа.Видимость 		= Ложь;
	ЗавершитьСценарийОтложенногоПодключения 		= Ложь;
	ИнтернетПоддержкаПодключена 					= Ложь;
	
	СтрокаЗаголовок = НСтр("ru = '1С:Кабинет сотрудника. Подключение'");
	
	ПрочитатьНастройкиИнтеграции();
	ОбновитьЭУВыборАдреса(ЭтотОбъект);
	ОбновитьЭУВыборАдресаРесурсовAPI(ЭтотОбъект);
	УстановитьВидимостьВключениеЭП();
	
	Объект.ПриложениеВЛокальнойСети = Константы.СервисКабинетСотрудникаВЛокальнойСети.Получить();
	СервисПодключен = Константы.ИспользуетсяСервисКабинетСотрудника.Получить();
	СостояниеПодключения = ИнтеграцияУправлениеПерсоналомМенеджер.СостояниеПодключенияПриложения(Приложение);
	Если ЗначениеЗаполнено(СостояниеПодключения.Состояние) Тогда
		// Используется отложенное подключение к сервису.
		Если СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияПриложения.Создано Тогда
			// подключение выполнено
			СсылкаДляАдминистратора = СостояниеПодключения.СсылкаДляАдминистратора;
			УстановитьЗаголовокДекорацияПереходДляАдминистратора();
			Если Не СервисПодключен Тогда
				СервисПодключен = Истина;
				ТребуетсяОбновитьИнтерфейс = Истина;
				ЗавершитьСценарийОтложенногоПодключения = Истина;
				УстановитьПривилегированныйРежим(Истина);
				Константы.ИспользуетсяСервисКабинетСотрудника.Установить(Истина);
				// удаляем сведения отложенного подключения
				ИнтеграцияУправлениеПерсоналомМенеджер.ОчиститьСостояниеПодключенияПриложения(Приложение);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		Иначе
			Если ИнтеграцияУправлениеПерсоналом.ЕстьКлючиМенеджера(Приложение) Тогда
				Объект.ИдентификаторЗаявки = СостояниеПодключения.ИдентификаторЗаявки;
				ОтложенноеПодключениеКСервису = Истина;
			Иначе
				// удаляем сведения отложенного подключения
				УстановитьПривилегированныйРежим(Истина);
				ИнтеграцияУправлениеПерсоналомМенеджер.ОчиститьСостояниеПодключенияПриложения(Приложение);
				УстановитьПривилегированныйРежим(Ложь);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СервисПодключен Тогда
		
		СтрокаЗаголовок = НСтр("ru = '1С:Кабинет сотрудника'");
		// Включаем страницу, т.к. могла быть выключена.
		Элементы.СтраницаСервисПодключен.Видимость = Истина;
		// Выключаем страницы, чтобы не было полосы прокрутки.
		Элементы.СтраницаПодключениеСервиса.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСервисПодключен;
		
		// Выключим декорации длительных операций.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииОбновлениеПриложения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииИзменениеАбонента", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДекорацияОтключениеСервиса", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииОбновлениеОплаты", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПодключениеВыполнено", "Видимость", ФормаВРежимеПодключения);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДекорацияПолучениеКодаАктивации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДекорацияПодключениеПоКодуАктивации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"КодАктивации", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииПроверитьАдрес", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииПроверкаПодключения", "Видимость", Ложь);
		
		// Проверка доступности приложения по наличию ключей.
		ЕстьКлючиПриложения = ИнтеграцияУправлениеПерсоналом.ЕстьКлючиПриложения(Приложение);
		// Проверка доступности менеджера сервиса по наличию ключей при условии работы не в локальном режиме.
		ЕстьКлючиМенеджераСервиса = Не Объект.ПриложениеВЛокальнойСети И ИнтеграцияУправлениеПерсоналом.ЕстьКлючиМенеджера(Приложение);
		
		ЗаполнитьИнформациюОСервисеИзНастроек();
		ОбновитьОписаниеВидаКонтактнойИнформации();
		ОбновитьОписаниеПубликуемойСтруктуры();
		ОбновитьРезультатОбменаНаСервере();
		ПрочитатьОбновитьНастройкиИспользуемаяФункциональность();
		
		Если ЕстьКлючиПриложения Тогда
			
			Если ИнтеграцияУправлениеПерсоналомОбмен.КлючиПриложенияАктуальные(Приложение) Тогда
				
				НачатьПолучениеИнформацииОСервисе = Истина;
				Элементы.СтраницыСостояниеСервиса.ТекущаяСтраница = Элементы.СтраницаРаботаССервисом;
				Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
				Если Объект.ПриложениеВЛокальнойСети Тогда
					Элементы.СтраницыОтключениеСервиса.ТекущаяСтраница = Элементы.СтраницаОтключениеЛокальнаяВерсия;
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"ГруппаБлокировкаДоступа", "Видимость", Истина);
				Иначе
					Элементы.СтраницыОтключениеСервиса.ТекущаяСтраница = Элементы.СтраницаОтключениеПолучениеКодаАктивации;
				КонецЕсли;
				
				ОбновитьЭУОтключенияСервиса(ЭтаФорма);
				
			Иначе
				
				Элементы.СтраницыСостояниеСервиса.ТекущаяСтраница = Элементы.СтраницаПриложениеНедоступно;
				Элементы.ДекорацияСервисНедоступенОписание.Заголовок = ЗаголовокСервисНедоступен();
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"ДекорацияОтключениеНедостаточноПрав", "Видимость", НЕ ПолноправныйПользователь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"ГруппаПриложениеНедоступноОтключить", "Доступность", ПолноправныйПользователь);
				
			КонецЕсли;
			
		Иначе
			
			Элементы.ДекорацияАктивацияСервисаИнформация.Заголовок = ЗаголовокАктивацияСервисаИнформация();
			ФормаВРежимеАктивации = Истина;
			Элементы.СтраницыСостояниеСервиса.ТекущаяСтраница = Элементы.СтраницаАктивацияСервиса;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
					"ДекорацияНетПравИнтернетПоддержка", "Видимость", Ложь);
			
			Если ПолноправныйПользователь Тогда
				
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
					"ДекорацияАктивацияНедостаточноПрав", "Видимость", Ложь);
				
				Если Объект.РазделениеВключено Тогда
					ИнтернетПоддержкаПодключена = Истина;
					Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивация;
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"ГруппаИнтернетПоддержка", "Видимость", Ложь);
				Иначе
					ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
					Если ИнтернетПоддержкаПодключена Тогда
						Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивацияДлительнаяОперация;
					Иначе
						Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивация;
						ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
							"ГруппаВводКодаАктивации", "Доступность", Ложь);
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
						"ГруппаИнтернетПоддержка", "Видимость", Не ИнтернетПоддержкаПодключена);
				КонецЕсли;
				
				ВариантПродолженияАктивировать = 1;
				ВариантПродолженияОтключить = 0;
				ОбновитьЭУАктивацииСервиса(ЭтаФорма);
				
			Иначе
				
				// У пользователя нет права на подключение к сервису,
				// но есть право на настройку сервиса.
				Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивация;
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
					"ГруппаИнтернетПоддержка", "Видимость", Ложь);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
					"ДекорацияАктивацияНедостаточноПрав", "Видимость", Истина);
				Элементы.СтраницыАктивацияСервиса.ТекущаяСтраница = Элементы.СтраницаАктивация;
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
					"ГруппаАктивацияОтключение", "Доступность", Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ОтложенноеПодключениеКСервису Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииПроверкаПодключения", "Видимость", Ложь);
		
		ФормаВРежимеПодключения = Истина;
		Элементы.СтраницаПодключениеСервиса.Видимость = Истина;
		
		// Выключаем страницу, чтобы не было полосы прокрутки.
		Элементы.СтраницаСервисПодключен.Видимость = Ложь;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодключениеСервиса;
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаОтложенноеПодключение;
		ОшибкаСоздания = СостояниеПодключения.Состояние = Перечисления.СостоянияПодключенияПриложения.ОшибкаСоздания;
		ОбновитьЭУОтложенноеПодключение(ОшибкаСоздания);
		
	ИначеЕсли ПолноправныйПользователь Тогда
		
		// сервис не подключен, полноправный пользователь
		
		ФормаВРежимеПодключения = Истина;
		Элементы.СтраницаПодключениеСервиса.Видимость = Истина;
		
		// Выключаем страницу, чтобы не было полосы прокрутки.
		Элементы.СтраницаСервисПодключен.Видимость = Ложь;
		
		ОбновитьОписаниеВидаКонтактнойИнформации();
		УстановитьВидимостьЭУИзмененияВидовКИ();
		ОбновитьОписаниеПубликуемойСтруктурыПриПодключении();
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодключениеСервиса;
		Если Объект.ПриложениеВЛокальнойСети Тогда
			
			Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключениеЛокально;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключениеЛокально", "Видимость", Ложь);
			
		Иначе
			
			Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключение;
			
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИнтернетПоддержка", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ИндикаторДлительнойОперацииРезервированиеИмениДомена", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"ГруппаИндикацияДлительнойОперацииПодключение", "Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"НастройкиПодключения", "Доступность", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
				"Этап5", "Видимость", Ложь);
			
			Элементы.ДекорацияИмяДоменаПояснение.Заголовок = Объект.ПояснениеИмяДомена;
			
			РассчитатьПериодРасчетныхЛистков();
			ОбновитьСообщениеОПубликации();
			
			Если Не Объект.ЭтоАвтономноеРабочееМесто Тогда
				Если Объект.РазделениеВключено Тогда
					НачатьСценарийПодключения = Истина;
				Иначе
					ИнтернетПоддержкаПодключена = ИнтернетПоддержкаПодключена();
					Если ИнтернетПоддержкаПодключена Тогда
						НачатьСценарийПодключения = Истина;
					Иначе
						ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
							"ИнтернетПоддержка", "Видимость", Истина);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Сервис не подключен, у пользователя нет права на подключение к сервису,
		// но есть право на настройку сервиса.
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаПодключениеНедоступно;
		
	КонецЕсли;
	
	Заголовок = СтрокаЗаголовок;
	
	Если НачатьСценарийПодключения Тогда
		Элементы.СтраницыНовоеПодключение.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
		НачатьПолучениеАбонентаИПП();
	ИначеЕсли НачатьПолучениеИнформацииОСервисе Тогда
		Если Объект.ПриложениеВЛокальнойСети Тогда
			НачатьОбновлениеСостоянияБлокировки(Ложь);
		Иначе
			НачатьПолучениеИнформацииОСервисе();
		КонецЕсли;
	ИначеЕсли СервисПодключен И Не ЕстьКлючиПриложения И ИнтернетПоддержкаПодключена Тогда
		НачатьПроверкуДоступностиИнтернетПоддержки();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокАктивацияСервисаИнформация()
	
	Если Объект.РазделениеВключено Тогда
		Текст1 = НСтр("ru = 'Выполнен перенос данных приложения в облачный сервис.'");
	Иначе
		Текст1 = НСтр("ru = 'Выполнен перенос данных приложения из облачного сервиса.'")
	КонецЕсли;
	Текст2 = НСтр("ru = 'Для продолжения работы с сервисом 1С:Кабинет сотрудника из этого приложения необходимо выполнить активацию подключения.'");
	
	Возврат СтрШаблон("%1%2%3", Текст1, Символы.ПС, Текст2);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУАктивацииСервиса(Форма)

	Форма.Элементы.ГруппаАктивироватьГоризонтальная.Доступность = Форма.ВариантПродолженияАктивировать;
	Форма.Элементы.ГруппаОтключитьГоризонтальная.Доступность = Форма.ВариантПродолженияОтключить;
	
КонецПроцедуры

&НаКлиенте
Функция КодАктивацииКорректный()
	
	КодАктивацииКорректный = Истина;
	ТекстСообщения = "";
	КодАктивации = СокрЛП(КодАктивации);
	Если ПустаяСтрока(КодАктивации) Тогда
		ТекстСообщения = НСтр("ru = 'Не указан код активации.'");
	Иначе
		// формат кода активации ххх-ххх.
		Если СтрДлина(КодАктивации) <> 7
			Или Сред(КодАктивации,4,1) <> "-"
			Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(КодАктивации,3))
			Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(КодАктивации,5,3)) Тогда
			ТекстСообщения = НСтр("ru = 'Неправильный код активации.'");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		КодАктивацииКорректный = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
	Возврат КодАктивацииКорректный;

КонецФункции

&НаСервере
Функция ЗаголовокСервисНедоступен()

	Если Объект.РазделениеВключено Тогда
		Строка1 = НСтр("ru = 'Сервис по адресу %1 недоступен для работы из этого приложения.'");
		Строка2 = НСтр("ru = 'Возможно к сервису по этому адресу подключено другое ваше приложение.'");
	Иначе
		Строка1 = НСтр("ru = 'Сервис по адресу %1 недоступен для работы из этой информационной базы.'");
		Строка2 = НСтр("ru = 'Возможно к сервису по этому адресу подключена другая ваша информационная база.'");
	КонецЕсли;
	Строка1 = СтрШаблон(Строка1, АдресСервиса(ЭтаФорма));
	
	Возврат СтрШаблон("%1%2%3", Строка1,Символы.ПС,Строка2);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУОтключенияСервиса(Форма)

	Форма.Элементы.ГруппаОтключитьСервисГоризонтальная.Доступность = Форма.ВариантОтключенияОтключить;
	Форма.Элементы.ГруппаУдалитьСервисГоризонтальная.Доступность = Форма.ВариантОтключенияУдалить;

КонецПроцедуры

&НаКлиенте
Процедура ВариантОтключенияОтключитьПриИзменении(Элемент)
	
	ВариантОтключенияУдалить = 0;
	ОбновитьЭУОтключенияСервиса(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтключенияУдалитьПриИзменении(Элемент)
	
	ВариантОтключенияОтключить = 0;
	ОбновитьЭУОтключенияСервиса(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИнтеграции()
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииУправлениеПерсоналом.Настройки();
	Объект.ВидКИМобильныйТелефон 				= Настройки.ВидКИМобильныйТелефон;
	Объект.ВидКИАдресЭлектроннойПочты 			= Настройки.ВидКИАдресЭлектроннойПочты;
	ПубликоватьСтруктуруЮридическихЛиц 	= Настройки.ПубликоватьСтруктуруЮридическихЛиц;
	
	Настройки = РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.НастройкиИнтеграции();
	ИспользуетсяЭДОБЗК 			= Настройки.ИспользуетсяЭДОБЗК;
	ДнейСохраненияПубликации 	= Настройки.ДнейСохраненияПубликации;
	ИспользоватьСборДанныхДляОформленияНаРаботу = Настройки.ИспользоватьСборДанныхДляОформленияНаРаботу;
	ИспользоватьУведомленияОНачалеОтпуска = Настройки.ИспользоватьУведомленияОНачалеОтпуска;
	ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя = Настройки.ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя;
	
	СпособПолученияСогласияНаПрисоединениеКЭДОБЗК = Настройки.СпособПолученияСогласияНаПрисоединениеКЭДОБЗК;
	СпособПолученияСогласияНаПрисоединениеКЭДОБЗКПриОткрытии = СпособПолученияСогласияНаПрисоединениеКЭДОБЗК;
	
	Объект.РазрешенныеСимволыИмениДомена = ИнтеграцияУправлениеПерсоналомМенеджер.РазрешенныеСимволыИмениДомена();
	
	ИспользоватьОбсуждения = Настройки.ИспользоватьОбсуждения;
	ИспользуютсяОбсуждения = ПолучитьФункциональнуюОпцию("ИспользуютсяОбсужденияКабинетСотрудника");
	
	ОбновитьЭУУведомлениеОНачалеОтпуска(ЭтаФорма);
	УстановитьДоступностьПоказатьЗапрашиваемыеДанныеДляОформленияНаРаботу(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНовыеВидыКонтактнойИнформации(НовыйВидКИМобильныйТелефон, НовыйВидКИАдресЭлектроннойПочты, СообщениеОбОшибке)
	
	УстановитьПривилегированныйРежим(Истина);
	ИнтеграцияУправлениеПерсоналом.СохранитьНовыеВидыКонтактнойИнформации(НовыйВидКИМобильныйТелефон, НовыйВидКИАдресЭлектроннойПочты, СообщениеОбОшибке);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СообщениеОбОшибке = Неопределено Тогда
		Объект.ВидКИМобильныйТелефон 		= НовыйВидКИМобильныйТелефон;
		Объект.ВидКИАдресЭлектроннойПочты 	= НовыйВидКИАдресЭлектроннойПочты;
		ОбновитьОписаниеВидаКонтактнойИнформации();
		Если Не Объект.ПриложениеПодключено Тогда
			ДанныеОтветственного = ДанныеОтветственного(Объект.Ответственный);
			РезультатПроверки = ИнтеграцияУправлениеПерсоналомКлиентСервер.РезультатПроверкиДанныхОтветственного(Объект.Ответственный, ДанныеОтветственного);
			ОбновитьЭУОтветственный(ЭтаФорма, РезультатПроверки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеВидаКонтактнойИнформации()

	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Объект.ВидКИМобильныйТелефон);
	ВидыКИ.Добавить(Объект.ВидКИАдресЭлектроннойПочты);
	НаименованиеВидовКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВидыКИ, "Наименование");
	
	Строка1 = НСтр("ru = 'Виды контактной информации, используемые для работы в сервисе,'");
	Строка2 = НСтр("ru = 'мобильный телефон - ""%1"", адрес электронной почты - ""%2""'");
	Строка2 = СтрШаблон(Строка2,НаименованиеВидовКИ[Объект.ВидКИМобильныйТелефон],НаименованиеВидовКИ[Объект.ВидКИАдресЭлектроннойПочты]);
	
	ТекстЗаголовка = СтрШаблон("%1%2%3",Строка1,Символы.ПС,Строка2);
	Элементы.ДекорацияИзменениеВидаКИПояснение.Заголовок = ТекстЗаголовка;
	Элементы.ДекорацияИзменениеВидаКИЛокальноПояснение.Заголовок = ТекстЗаголовка;
	
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	НаименованиеВидовКИ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВидыКИ, "Наименование");
	
	Строка1 = НСтр("ru = 'В сервисе 1С:Кабинет сотрудника публикуются мобильные телефоны и адреса электронной почты сотрудников.'");
	Строка2 = НСтр("ru = 'По умолчанию используются предопределенные значения видов контактной информации: мобильный телефон - ""%1"" и адрес электронной почты - ""%2"". Вы можете создать собственные виды контактной информации и использовать их для публикации данных в сервисе.'");
	Строка2 = СтрШаблон(Строка2,
		НаименованиеВидовКИ[Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица],
		НаименованиеВидовКИ[Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица]);
	ТекстЗаголовка = СтрШаблон("%1%2%3",Строка1,Символы.ПС,Строка2);
	
	Элементы.ДекорацияВидыКонтактнойИнформации.Заголовок = ТекстЗаголовка;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭУИзмененияВидовКИ()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Тип В (ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты), ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|	И ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникФизическиеЛица)
	|	И НЕ ВидыКонтактнойИнформации.Предопределенный";
	
	ВидимостьЭУ = Не Запрос.Выполнить().Пустой();
	Элементы.ГруппаИзменениеВидаКИГоризонтальная.Видимость = ВидимостьЭУ;
	Элементы.ГруппаИзменениеВидаКИЛокальноГоризонтальная.Видимость = ВидимостьЭУ;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбменВыполняется()

	Возврат ИнтеграцияУправлениеПерсоналом.ОбменВыполняется(Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника);

КонецФункции

&НаСервереБезКонтекста
Функция СервисЗаблокирован()

	Возврат ИнтеграцияКабинетСотрудника.ПриложениеЗаблокировано();

КонецФункции

&НаСервереБезКонтекста
Функция ОтборЖурналаРегистрации(ВидСобытия, Уровень)
	
	Приложение = Перечисления.ПриложенияДляИнтеграции.КабинетСотрудника;
	Отбор = Новый Структура;
	
	ИменаСобытийЖР = ИнтеграцияУправлениеПерсоналом.ИменаСобытийЖР(Приложение);
	ИменаСобытий = Новый Массив;
	Для каждого ЭлементКоллекции Из ИменаСобытийЖР Цикл
		ИменаСобытий.Добавить(ЭлементКоллекции.Значение);
	КонецЦикла;
	Отбор.Вставить("СобытиеЖурналаРегистрации", ИменаСобытий);
	
	Если ЗначениеЗаполнено(ВидСобытия) Тогда
		СобытиеОбмена = РегистрыСведений.СобытияОбменаУправлениеПерсоналом.СобытиеОбмена(Приложение, ВидСобытия);
		Отбор.Вставить("ДатаНачала", 	СобытиеОбмена.ДатаНачала);
		Отбор.Вставить("ДатаОкончания", СобытиеОбмена.ДатаОкончания);
	Иначе
		Отбор.Вставить("ДатаНачала", НачалоДня(ТекущаяДатаСеанса()) - 86400*7);
	КонецЕсли;
	Если ЗначениеЗаполнено(Уровень) Тогда
		Отбор.Вставить("Уровень", Уровень);
	КонецЕсли;
	
	Возврат Отбор;

КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменВыгрузитьЖурналПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ОбменССервисомЗаблокирован() Тогда
			Возврат;
		КонецЕсли;
		ОчиститьСообщения();
		ВыполнитьОбменСохранитьРезультатВЖурнал();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПубликацииРасчетныхЛистковВыгрузкаЖурнала(Команда)
	
	ПараметрыОткрытия = Новый Структура("ПодготовитьДанныеДляТехПоддержки", Истина);
	ОткрытьФорму("Обработка.ПубликацияРасчетныхЛистковКабинетСотрудника.Форма.ПубликацияРасчетныхЛистков", ПараметрыОткрытия, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуИспользуетсяЭДОБЗК(ИспользуетсяЭДОБЗК)

	РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеИспользуетсяЭДОБЗК(ИспользуетсяЭДОБЗК);

КонецПроцедуры

&НаКлиенте
Функция ОбменССервисомЗаблокирован()

	Если СервисЗаблокирован() Тогда
		ТекстСообщения = ИнтеграцияКабинетСотрудникаКлиент.ТекстСообщенияОБлокировкеСервиса();
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	КонецЕсли;
	
	Если ОбменВыполняется() Тогда
		ТекстСообщения = НСтр("ru = 'Обмен уже выполняется, повторите попытку позже.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменСохранитьРезультатВЖурнал()
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыполнитьОбменСохранитьРезультатВЖурналЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = ПараметрыОбменаССохранениемРезультата(Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ВыполнитьОбменСохранитьРезультат", ПараметрыОткрытия, ЭтаФорма,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПараметрыОбменаССохранениемРезультата(Приложение)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("СобытиеОбмена", 			Перечисления.ВидыСобытийОбменаУправлениеПерсоналом.Обмен);
	ПараметрыОткрытия.Вставить("Приложение", 				Приложение);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьОбменСохранитьРезультатВЖурналЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.РезультатВыполненияОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.РезультатВыполненияОбмена.БылиОшибки И Результат.ИмяСобытияОбмена = "ОбновлениеПубликации" Тогда
		СообщениеОбОшибке = НСтр("ru = 'Обновление публикации в сервисе 1С:Кабинет сотрудника завершено с ошибками.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Результат.ПолноеИмяФайла) Тогда
		ТекстСообщения = СтрШаблон("%1: %2", НСтр("ru = 'Данные сохранены в'"), Результат.ПолноеИмяФайла);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеПубликуемойСтруктуры()

	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе 1С:Кабинет сотрудника соответствует Подразделениям организации (структуре юридических лиц).'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе 1С:Кабинет сотрудника соответствует Структуре предприятия.'");
	КонецЕсли;
	Элементы.ДекорацияОписаниеПубликуемойСтруктуры.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОписаниеПубликуемойСтруктурыПриПодключении()

	Если ПубликоватьСтруктуруЮридическихЛиц Тогда
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе 1С:Кабинет сотрудника будет соответствовать Подразделениям организации (структуре юридических лиц).'");
	Иначе
		ТекстЗаголовка = НСтр("ru = 'Структура Компании в сервисе 1С:Кабинет сотрудника будет соответствовать Структуре предприятия.'");
	КонецЕсли;
	Элементы.ДекорацияПубликуемаяСтруктураПриПодключении.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПубликуемуюСтруктураКомпанииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПубликоватьСтруктуруЮридическихЛиц <> Результат.ПубликоватьСтруктуруЮридическихЛиц Тогда
		СообщениеОбОшибке = Неопределено;
		СохранитьИзменениеПубликуемойСтруктуры(Результат.ПубликоватьСтруктуруЮридическихЛиц, СообщениеОбОшибке);
		Если СообщениеОбОшибке = Неопределено Тогда
			Оповестить("ИзмененаПубликуемаяСтруктураПредприятия");
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзменениеПубликуемойСтруктуры(ЗначениеПубликоватьСтруктуруЮридическихЛиц, СообщениеОбОшибке)
	
	УстановитьПривилегированныйРежим(Истина);
	ИнтеграцияУправлениеПерсоналом.СохранитьНастройкуПубликуемойСтруктурыКомпании(ЗначениеПубликоватьСтруктуруЮридическихЛиц, СообщениеОбОшибке);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СообщениеОбОшибке = Неопределено Тогда
		ПубликоватьСтруктуруЮридическихЛиц = ЗначениеПубликоватьСтруктуруЮридическихЛиц;
		Если СервисПодключен Тогда
			ОбновитьОписаниеПубликуемойСтруктуры();
		Иначе
			ОбновитьОписаниеПубликуемойСтруктурыПриПодключении();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НачатьПроверкуДоступностиАдреса()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииПроверитьАдрес",
			"Видимость",
			Истина);
		
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	
	ПараметрыМетода = Новый Структура("Приложение", Приложение);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияУправлениеПерсоналомМенеджер.ПроверкаДоступностиАдресаПоИмениФоновоеЗадание", ПараметрыМетода, ПараметрыВыполненияВФоне);
	
КонецФункции

&НаКлиенте
Процедура ПроверкаДоступностиАдресаПоИмениЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ИндикаторДлительнойОперацииПроверитьАдрес",
			"Видимость",
			Ложь);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ПроверкаДоступностиАдресаПоИмениЗавершениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаДоступностиАдресаПоИмениЗавершениеНаСервере()

	НастройкиСервиса = РегистрыСведений.НастройкиСервисаКабинетСотрудника.НастройкиСервиса();
	Объект.АдресПриложенияПоИмениДоступен = НастройкиСервиса.АдресПриложенияПоИмениДоступен;
	
	УстановитьЗаголовокСостояниеАдресаПоИмени();
	Элементы.ПроверитьДоступностьАдреса.Видимость = Не Объект.АдресПриложенияПоИмениДоступен;
	Элементы.ДекорацияАдресПриложения.Доступность = Объект.АдресПриложенияПоИмениДоступен;
	Элементы.ДекорацияАдресПриложенияВременный.Видимость = Не Объект.АдресПриложенияПоИмениДоступен;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСостояниеАдресаПоИмени()

	Если Объект.АдресПриложенияПоИмениДоступен Тогда
		СтрЗаголовок = НСтр("ru = 'Cервис по этому адресу доступен.'");
	Иначе
		СтрЗаголовок = НСтр("ru = 'Cервис по этому адресу будет доступен через несколько минут.'");
	КонецЕсли;
	Элементы.ДекорацияСостояниеАдресаПоИмени.Заголовок = СтрЗаголовок;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АдресСервиса(Форма)

	АдресСервиса = Форма.Объект.АдресПриложения;
	Если ЗначениеЗаполнено(Форма.Объект.АдресПриложенияПоИмени) Тогда
		АдресСервиса = Форма.Объект.АдресПриложенияПоИмени;
	КонецЕсли;
	
	Возврат АдресСервиса;

КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭУПодключенияКСервису(Выключить)

	Элементы.Ответственный.ТолькоПросмотр 	= Выключить;
	Элементы.ИмяДомена.ТолькоПросмотр 		= Выключить;
	Элементы.ИмяПриложения.ТолькоПросмотр 	= Выключить;
	Элементы.Подключить.Доступность 		= Не Выключить;
	Элементы.НастройкиПубликации.Доступность = Не Выключить;
	Элементы.ИзменитьПубликуемуюСтруктураКомпанииПриПодключении.Доступность = Не Выключить;
	Элементы.ИзменитьВидыКонтактнойИнформацииПриПодключении.Доступность = Не Выключить;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьОбновитьНастройкиИспользуемаяФункциональность()
	
	ПрочитатьНастройкиИнтеграции();
	АвтоФормированиеСогласий = Константы.АвтоматическиФормироватьСогласияНаПрисоединениеКЭДОБЗК.Получить();
	ОбновитьДоступностьЭУИспользуемойФункциональности();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭУИспользуемойФункциональности()

	ДоступнаНастройкаФункциональности = Не БазоваяФункциональность И КабинетСотрудника.ИспользоватьФормат303()
		Или БазоваяФункциональность И КабинетСотрудника.ИспользоватьФормат503();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастройкиФункциональностиСервиса", "Видимость", ДоступнаНастройкаФункциональности);
	
	Если Не ИнтеграцияКабинетСотрудника.ВерсионированиеИспользуется() Тогда
		ОбновитьДоступностьЭУИспользуемойФункциональностиПоВерсииПриложения();
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПубликуемаяСтруктура", "Видимость",
			ПубликоватьСтруктуруЮридическихЛиц Или Не СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаСогласиеНаПрисоединениеКЭДОБЗК",
			"Доступность",
			ИспользуетсяЭДОБЗК);
			
	УстановитьОтображениеЭлементовУправленияСогласиямиНаПодключенияеКЭДОБЗК();
	ОбновитьДоступностьЗависимыхНастроекЭДО();
	
	ИспользуетсяВерсия20 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.0");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастроитьПравилаОбработкиЗаявокСотрудников",
			"Видимость",
			Не ИспользуетсяВерсия20);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"НастроитьПравилаОбработкиЗаявок",
			"Видимость",
			ИспользуетсяВерсия20);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДнейПубликацииУволенных",
			"Видимость",
			Не ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.4"));
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПодключитьСервисПодписания", "Видимость",
			ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.0"));
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПодключитьСервисПодписания",
			"Доступность",
			ИспользуетсяЭДОБЗК);
			
	ИспользуетсяВерсия_3_1 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.1");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаИспользоватьСборДанныхДляОформления",
			"Видимость",
			ИспользуетсяВерсия_3_1);
			
	ИспользуетсяВерсия_3_2 = ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.2");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаУведомленияОНачалеОтпуска",
			"Видимость",
			Не БазоваяФункциональность И ИспользуетсяВерсия_3_2);
			
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЭУИспользуемойФункциональностиПоВерсииПриложения()
	
	ИспользоватьФормат303 	= КабинетСотрудника.ИспользоватьФормат303();
	ИспользоватьФормат401 	= КабинетСотрудника.ИспользоватьФормат401();
	ИспользоватьФормат30396 = КабинетСотрудника.ИспользоватьФормат30396();
	ИспользоватьФормат503 	= КабинетСотрудника.ИспользоватьФормат503();
	ИспользоватьФормат50366 = КабинетСотрудника.ИспользоватьФормат50366();
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаЭДОБЗК", "Видимость",
			ИспользоватьФормат303);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаДнейПубликацииУволенных", "Видимость",
			ИспользоватьФормат30396);
	
	// Показываем настройку при условии,
	// версия сервиса 4.0.1.31 и выше и структура предприятия не соответствует структуре юридических лиц,
	// или настройка ПубликоватьСтруктуруЮридическихЛиц = Истина, что бы ее можно было выключить.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаПубликуемаяСтруктура", "Видимость",
			ПубликоватьСтруктуруЮридическихЛиц Или (ИспользоватьФормат401 И Не СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ПолучениеДокументаСЭПНедоступно", "Видимость",
			ИспользоватьФормат503
			И Не ИспользуетсяЭДОБЗК
			И ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаСогласиеНаПрисоединениеКЭДОБЗК",
			"Видимость",
			ИспользоватьФормат50366);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаСогласиеНаПрисоединениеКЭДОБЗК",
			"Доступность",
			ИспользуетсяЭДОБЗК);
			
	УстановитьОтображениеЭлементовУправленияСогласиямиНаПодключенияеКЭДОБЗК();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаИспользоватьСборДанныхДляОформления",
			"Видимость",
			Ложь);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаУведомленияОНачалеОтпуска",
			"Видимость",
			Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкиПодключенияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ВыполнитьНачальноеЗаполнение();
		ПриНачалеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьСервисПодписания(Команда)
	
	ПараметрыОткрытия = Новый Структура("Приложение", Приложение);
	ОткрытьФорму("Обработка.ИнтеграцияУправлениеПерсоналом.Форма.ПодключениеСервисаПодписания",
		ПараметрыОткрытия, ЭтотОбъект, Истина, , , ,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеЭлементовУправленияСогласиямиНаПодключенияеКЭДОБЗК()
	
	СпособыПолученияСогласияНаПрисоединениеКЭДОБЗКУНЭП =
		СпособПолученияСогласияНаПрисоединениеКЭДОБЗКПриОткрытии = Перечисления.СпособыПолученияСогласияНаПрисоединениеКЭДОБЗК.УНЭП; 
		
	Если СпособыПолученияСогласияНаПрисоединениеКЭДОБЗКУНЭП Тогда
		Элементы.Настройки.Показать();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"УведомлениеОСпопобеСогласованияГруппа",
			"Видимость",
			СпособыПолученияСогласияНаПрисоединениеКЭДОБЗКУНЭП);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СпособПолученияСогласияНаПрисоединениеКЭДОБЗК",
			"Видимость",
			СпособыПолученияСогласияНаПрисоединениеКЭДОБЗКУНЭП);
			
	УстановитьДоступностьФормировнаияСогласийНаПрисоединениеКЭДОБЗК(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьФормировнаияСогласийНаПрисоединениеКЭДОБЗК(УправляемаяФорма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		УправляемаяФорма.Элементы,
		"СформироватьСогласия",
		"Доступность",
		УправляемаяФорма.СпособПолученияСогласияНаПрисоединениеКЭДОБЗК =
			ПредопределенноеЗначение("Перечисление.СпособыПолученияСогласияНаПрисоединениеКЭДОБЗК.БумажныйДокумент"));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПоказатьЗапрашиваемыеДанныеДляОформленияНаРаботу(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ПоказатьЗапрашиваемыеДанныеДляОформленияНаРаботу",
			"Доступность",
			Форма.ИспользоватьСборДанныхДляОформленияНаРаботу);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресСервисаАвторизацииИРесурсовAPIЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Истина Тогда
		ВыполнитьНачальноеЗаполнение();
		ПриНачалеЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУВыборАдреса(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресСервисаАвторизации",
		"Доступность", Форма.ИспользоватьАдресСервисаАвторизации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресСервисаАвторизации",
		"АвтоОтметкаНезаполненного", Форма.ИспользоватьАдресСервисаАвторизации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресСервисаАвторизации",
		"ОтметкаНезаполненного", Форма.ИспользоватьАдресСервисаАвторизации И Не ЗначениеЗаполнено(Форма.Объект.АдресСервисаАвторизации));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУВыборАдресаРесурсовAPI(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресРесурсовAPI",
		"Доступность", Форма.ИспользоватьАдресРесурсовAPI);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресРесурсовAPI",
		"АвтоОтметкаНезаполненного", Форма.ИспользоватьАдресРесурсовAPI);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "АдресРесурсовAPI",
		"ОтметкаНезаполненного", Форма.ИспользоватьАдресРесурсовAPI И Не ЗначениеЗаполнено(Форма.Объект.АдресРесурсовAPI));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДнейСохраненияПубликации()

	СохранитьНастройкуДнейСохраненияПубликации(ДнейСохраненияПубликации);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуДнейСохраненияПубликации(ДнейСохраненияПубликации)

	РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеДнейСохраненияПубликации(ДнейСохраненияПубликации);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуИспользоватьСборДанныхДляОформленияНаРаботу(ИспользоватьСборДанныхДляОформленияНаРаботу)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеИспользоватьСборДанныхДляОформленияНаРаботу(ИспользоватьСборДанныхДляОформленияНаРаботу);
		Параметры = Новый Структура("ИспользоватьСборДанныхДляОформленияНаРаботу", ИспользоватьСборДанныхДляОформленияНаРаботу);
		ИнтеграцияУправлениеПерсоналомВнутренний.УстановитьИспользованиеРешенияОПриемеНаРаботу(Параметры);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщениеОбОшибке = НСтр("ru = 'Не удалось сохранить настройку. Подробности см. в журнале регистрации.'");
		ШаблонОписания = НСтр("ru = 'Не удалось сохранить настройки исподьзования сбора данных для оформления на работу.'");
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Комментарий = СтрШаблон("%1%2%3", ШаблонОписания, Символы.ПС, ПодробноеПредставлениеОшибки);
		ЗаписьЖурналаРегистрации(ИнтеграцияКабинетСотрудника.ИменаСобытийЖР().ПрочиеСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		ВызватьИсключение СообщениеОбОшибке;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВключениеЭП()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДекорацияВключениеЭП",
			"Видимость",
			Не ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи"));

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьБлокировкаРегламентныхЗаданий()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаБлокировкаРегламентныхЗаданий",
			"Видимость",
			Объект.РегламентныеЗаданияЗаблокированы);

КонецПроцедуры

&НаСервере
Процедура ВключитьРегламентныеЗаданияНаСервере()
	
	ИнтеграцияУправлениеПерсоналомОбмен.УстановитьРегламентныеЗаданияЗаблокированы(Приложение, Ложь);
	Объект.РегламентныеЗаданияЗаблокированы = Ложь;
	УстановитьДоступностьБлокировкаРегламентныхЗаданий();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЗависимыхНастроекЭДО()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаИспользоватьСборДанныхДляОформления",
			"Доступность",
			ИспользуетсяЭДОБЗК);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаУведомленияОНачалеОтпуска",
			"Доступность",
			ИспользуетсяЭДОБЗК);
		
	ТекстПодсказки = "";
	Если Не ИспользуетсяЭДОБЗК Тогда
		ТекстПодсказки = НСтр("ru = 'Настройка будет доступна после включения использования ЭДО.'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаИспользоватьСборДанныхДляОформления",
			"Подсказка",
			ТекстПодсказки);
			
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГруппаУведомленияОНачалеОтпуска",
			"Подсказка",
			ТекстПодсказки);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуИспользоватьУведомленияОНачалеОтпускаНаСервере(НоваяНастройка)

	РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеИспользоватьУведомленияОНачалеОтпуска(НоваяНастройка);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьНастройкуТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателяНаСервере(НоваяНастройка)
	
	РегистрыСведений.НастройкиИнтеграцииКабинетСотрудника.СохранитьЗначениеТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя(НоваяНастройка);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЭУУведомлениеОНачалеОтпуска(Форма)
	
	Форма.Элементы.ОтправкаУведомленийОНачалеОтпуска.Доступность = Форма.ИспользоватьУведомленияОНачалеОтпуска;
	Форма.Элементы.ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя.Доступность = Форма.ИспользоватьУведомленияОНачалеОтпуска;

КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеСостоянияБлокировки(ВыводитьОкноОжидания = Истина)
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания = "ОбновитьСостояниеБлокировки";
	ПараметрыЗадания.ИмяМетода 	= "ИнтеграцияУправлениеПерсоналом.ОбновитьСостояниеБлокировкиФоновоеЗадание";
	Если ВыводитьОкноОжидания Тогда
		ПараметрыЗадания.ВыводитьОкноОжидания 	= Истина;
	Иначе
		Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаСостояниеДлительнаяОперация;
	КонецЕсли;
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеБлокировкиЗавершение(АдресРезультата)
	
	Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Или Не Результат.СостояниеБлокировкиПолучено Тогда
		Элементы.ДекорацияСостояниеБлокировки.Заголовок 	= НСтр("ru = 'Информация о состоянии доступа не получена'");
		Элементы.ДекорацияСостояниеБлокировки.ЦветТекста 	= ЦветСтиляТекстаПоля;
		Элементы.ИзменитьСостояниеБлокировки.Доступность 	= Ложь;
		Возврат;
	КонецЕсли;
	
	ДоступПользователейЗаблокирован = Результат.БлокировкаПользователейУстановлена;
	ОтобразитьСостояниеБлокировки();
	
	Если Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаСостояниеДлительнаяОперация Тогда
		Элементы.СтраницыИнформацияОСервисе.ТекущаяСтраница = Элементы.СтраницаИнформацияОСервисе;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьИзменениеСостоянияБлокировки()
	
	ПараметрыЗадания = ПараметрыФоновогоЗадания();
	ПараметрыЗадания.ИмяЗадания 			= "ИзменитьСостояниеБлокировки";
	ПараметрыЗадания.ИмяМетода 				= "ИнтеграцияУправлениеПерсоналом.ИзменитьСостояниеБлокировкиПользователейФоновоеЗадание";
	ПараметрыЗадания.ВыводитьОкноОжидания 	= Истина;
	
	ПараметрыЗадания.ПараметрыМетода.Вставить("БлокировкаДоступаПользователей", Не ДоступПользователейЗаблокирован);
	
	ЗапуститьФоновоеЗадание(ПараметрыЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеБлокировкиЗавершение(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Или Не Результат.СостояниеБлокировкиИзменено Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка изменения блокировки доступа'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ДоступПользователейЗаблокирован = Не ДоступПользователейЗаблокирован;
	ОтобразитьСостояниеБлокировки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСостояниеБлокировки()
	
	Если ДоступПользователейЗаблокирован Тогда
		ТекстСостояниеБлокировки 	= НСтр("ru = 'Доступ всем сотрудникам в свои кабинеты запрещен'");
		ТекстЗаголовокКоманды 		= НСтр("ru = 'Разблокировать'");
		ЦветТекста 					= ЦветСтиляПоясняющийОшибкуТекст;
	Иначе
		ТекстСостояниеБлокировки 	= НСтр("ru = 'Доступ всем сотрудникам в свои кабинеты разрешен'");
		ТекстЗаголовокКоманды 		= НСтр("ru = 'Заблокировать'");
		ЦветТекста 					= ЦветСтиляИнформационнойНадписи;
	КонецЕсли;
	
	Элементы.ДекорацияСостояниеБлокировки.Заголовок 	= ТекстСостояниеБлокировки;
	Элементы.ДекорацияСостояниеБлокировки.ЦветТекста 	= ЦветТекста;
	Элементы.ИзменитьСостояниеБлокировки.Заголовок 		= ТекстЗаголовокКоманды;
	Элементы.ИзменитьСостояниеБлокировки.Доступность 	= Истина;
	
	Если ДоступПользователейЗаблокирован И Элементы.ГруппаБлокировкаДоступа.Скрыта() Тогда
		Элементы.ГруппаБлокировкаДоступа.Показать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти