#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СвойстваТермина(Знач Термин) Экспорт		
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Термин, "Наименование, КраткоеОпределение");	
	
	Реквизиты.Вставить("Термин", Термин);
	Реквизиты.Вставить("Синонимы", Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Представление КАК Представление,
		|	ТерминыЭлектронныхГлоссариевСинонимы.БукваДляПоиска КАК БукваДляПоиска,
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка КАК Термин
		|ИЗ
		|	Справочник.ТерминыЭлектронныхГлоссариев.Синонимы КАК ТерминыЭлектронныхГлоссариевСинонимы
		|ГДЕ
		|	ТерминыЭлектронныхГлоссариевСинонимы.Ссылка = &Термин";
	
	Запрос.УстановитьПараметр("Термин", Термин);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Реквизиты.Синонимы.Добавить(Новый Структура("Представление, БукваДляПоиска", ВыборкаДетальныеЗаписи.Представление, ВыборкаДетальныеЗаписи.БукваДляПоиска));
	КонецЦикла;
	
	Возврат Реквизиты;

КонецФункции

Функция ПредставлениеСодержитЗапрещенныеСимволы(Знач Представление) Экспорт
	
	Представление = СокрЛП(Представление);
	ЗапрещенныеСимволы = ЗапрещенныеСимволыВПредставлении();
	
	Для каждого ЗапрещенныйСимвол Из ЗапрещенныеСимволы Цикл
		Если СтрНайти(Представление, ЗапрещенныйСимвол) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗапрещенныеСимволыВПредставлении()
	
	// Это служебные символы в регулярных выражениях
	
	ЗапрещенныеСимволы = Новый Массив;
	ЗапрещенныеСимволы.Добавить("/");
	ЗапрещенныеСимволы.Добавить("\");
	ЗапрещенныеСимволы.Добавить("+");
	ЗапрещенныеСимволы.Добавить(".");
	ЗапрещенныеСимволы.Добавить("[");
	ЗапрещенныеСимволы.Добавить("]");
	ЗапрещенныеСимволы.Добавить("^");
	ЗапрещенныеСимволы.Добавить("$");
	ЗапрещенныеСимволы.Добавить("(");
	ЗапрещенныеСимволы.Добавить(")");
	ЗапрещенныеСимволы.Добавить("?");
	ЗапрещенныеСимволы.Добавить(":");
	ЗапрещенныеСимволы.Добавить("*");
	ЗапрещенныеСимволы.Добавить("=");
	ЗапрещенныеСимволы.Добавить("|");
	ЗапрещенныеСимволы.Добавить("{");
	ЗапрещенныеСимволы.Добавить("}");
	
	ЗапрещенныеСимволы.Добавить(Символы.ПС);
	ЗапрещенныеСимволы.Добавить(Символы.ВК);
	ЗапрещенныеСимволы.Добавить(Символы.ВТаб);
	ЗапрещенныеСимволы.Добавить(Символы.НПП);
	ЗапрещенныеСимволы.Добавить(Символы.ПФ);
	ЗапрещенныеСимволы.Добавить(Символы.Таб);
	
	Возврат ЗапрещенныеСимволы;
	
КонецФункции

Функция ЗапрещенныеСимволыСтрокой() Экспорт
	
	ЗапрещенныеСимволы = ЗапрещенныеСимволыВПредставлении();
	Результат = "";
	
	Для каждого ЗапрещенныйСимвол Из ЗапрещенныеСимволы Цикл
		
		Если ЗапрещенныйСимвол = Символы.ПС Тогда
			Результат = Результат + """Перевод строки"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ВК Тогда
			Результат = Результат + """Возврат каретки"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ВТаб
			ИЛИ ЗапрещенныйСимвол = Символы.Таб Тогда
			Результат = Результат + """Символ табуляции"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.НПП Тогда
			Результат = Результат + """Неразрывный пробел"", ";
		ИначеЕсли ЗапрещенныйСимвол = Символы.ПФ Тогда
			Результат = Результат + """Перевод формы"", ";
		Иначе
			Результат = Результат + """"+ ЗапрещенныйСимвол +""", ";
		КонецЕсли;
	КонецЦикла;

	Возврат Лев(Результат, СтрДлина(Результат) - 2);
	
КонецФункции

#КонецОбласти


#КонецЕсли
