#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ТипЗнч(Запись.НазначающийИсполнителей) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			// СтандартныеПодсистемы.УправлениеДоступом
			УстановитьПривилегированныйРежим(Истина);
			Запись.ГруппаИсполнителейЗадачНазначающий = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(Запись.НазначающийИсполнителей,
				Запись.ОсновнойОбъектАдресацииНазначающего, Запись.ДополнительныйОбъектАдресацииНазначающего);
			УстановитьПривилегированныйРежим(Ложь);
			// Конец СтандартныеПодсистемы.УправлениеДоступом
		Иначе
			Запись.ГруппаИсполнителейЗадачНазначающий = Справочники.ГруппыИсполнителейЗадач.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли