
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает типы ссылок общих данных, сопоставляемых по полям поиска.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - коллекция типов ссылок:
//    * Ключ - Тип
//    * Значение - Булево
//
Функция ТипыСопоставляемыхОбщихДанныхПоПолямПоиска() Экспорт
	
	Типы = Новый Соответствие();
	ТипыОбщихДанных
		= ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке();
	
	Для Каждого ОбъектМетаданных Из ТипыОбщихДанных Цикл
		Типы.Вставить(ТипСсылочногоОбъектаМетаданных(ОбъектМетаданных), Истина);
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

// Возвращает типы ссылок общих данных, сопоставляемых по предопределенному имени.
// 
// Возвращаемое значение: 
//	Соответствие из КлючИЗначение - коллекция типов ссылок:
//	 * Ключ - Тип
//	 * Значение - Булево
Функция ТипыСопоставляемыхОбщихДанныхПоПредопределенномуИмени() Экспорт
	
	Типы = Новый Соответствие();
	
	РазделенныеОбъектыМетаданных = МиграцияПриложенийПовтИсп.МодельДанныхОбласти();
	РазрешенныеОбщиеДанные
		= ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке();
	
	Для Каждого ВидМетаданных Из ВидыМетаданныхСПредопределенными() Цикл
		
		Для Каждого ОбъектМетаданных Из ВидМетаданных Цикл
			
			Если РазделенныеОбъектыМетаданных.Получить(ОбъектМетаданных) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если РазрешенныеОбщиеДанные.Найти(ОбъектМетаданных) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОбъектМетаданных.ПолучитьИменаПредопределенных().Количество() <> 0 Тогда
				Типы.Вставить(ТипСсылочногоОбъектаМетаданных(ОбъектМетаданных), Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

// Возвращает коллекцию разделенных метаданных, являющихся данными.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - коллекция объектов:
//   * Ключ - ОбъектМетаданных
//   * Значение - Булево
//
Функция МодельДанныхОбласти() Экспорт
	
	МодельДанныхОбласти = Новый Соответствие;
	ИспользованиеОбщегоРеквизита = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита;
	РазделениеВключено = РаботаВМоделиСервиса.РазделениеВключено();
	
	СтандартныеРазделители = Новый Массив; // Массив Из ОбъектМетаданныхОбщийРеквизит
	СтандартныеРазделители.Добавить(Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные);
	СтандартныеРазделители.Добавить(Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные);
	
	Для каждого Разделитель Из СтандартныеРазделители Цикл
		
		Если Разделитель.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.Использовать Тогда
			ИспользованиеПоУмолчанию = ИспользованиеОбщегоРеквизита.Использовать;
		Иначе
			ИспользованиеПоУмолчанию = ИспользованиеОбщегоРеквизита.НеИспользовать;
		КонецЕсли;
		
		Для каждого Состав Из Разделитель.Состав Цикл
			
			ОбъектМетаданных = Состав.Метаданные;
			
			Если Метаданные.РегламентныеЗадания.Содержит(ОбъектМетаданных)
				Или Метаданные.ВнешниеИсточникиДанных.Содержит(ОбъектМетаданных)
				Или Метаданные.СервисыИнтеграции.Содержит(ОбъектМетаданных)
				Или Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Состав.Использование = ИспользованиеОбщегоРеквизита.Авто Тогда
				Использование = ИспользованиеПоУмолчанию;
			Иначе
				Использование = Состав.Использование;
			КонецЕсли;
			
			Если Использование = ИспользованиеОбщегоРеквизита.НеИспользовать Тогда
				
				РасширениеКонфигурации = ОбъектМетаданных.РасширениеКонфигурации();
				Если РасширениеКонфигурации = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				// Если объект добавлен расширением, то считается что он входит в модель области данных.
				// Но только если он не добавлен неразделенным расширением в разделенной базе.
				Если РазделениеВключено Тогда
					Если РасширениеКонфигурации.ОбластьДействия = ОбластьДействияРасширенияКонфигурации.ИнформационнаяБаза Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
			МодельДанныхОбласти.Вставить(ОбъектМетаданных, Истина);
			
			Если Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных) Тогда
				Для Каждого Перерасчет Из ОбъектМетаданных.Перерасчеты Цикл
					МодельДанныхОбласти.Вставить(Перерасчет, Истина);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Последовательность Из Метаданные.Последовательности Цикл
		Для Каждого ОбъектМетаданных Из Последовательность.Документы Цикл
			Если МодельДанныхОбласти.Получить(ОбъектМетаданных) <> Неопределено Тогда
				МодельДанныхОбласти.Вставить(Последовательность, Истина);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(МодельДанныхОбласти);
	
КонецФункции

// Возвращает загружаемые объекты метаданных, которые используются в выгрузке.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - коллекция объектов:
//   * Ключ - ОбъектМетаданных
//   * Значение - Булево
//
Функция ВыгружаемыеОбъекты() Экспорт
	
	ВыгружаемыеОбъекты = Новый Соответствие(МиграцияПриложенийПовтИсп.МодельДанныхОбласти());
	ИсключаемыеТипы = ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки();
	
	Для Каждого ОбъектМетаданных Из ИсключаемыеТипы Цикл
		ВыгружаемыеОбъекты.Удалить(ОбъектМетаданных);
	КонецЦикла;
	
	Возврат ВыгружаемыеОбъекты;
	
КонецФункции

// Возвращает коллекцию запрещенных типов ссылок.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - коллекция типов ссылок:
//   * Ключ - Тип
//   * Значение - Булево
//
Функция ЗапрещенныеТипыОбщихДанных() Экспорт
	
	Типы = Новый Соответствие();
	
	РазделенныеОбъектыМетаданных = МиграцияПриложенийПовтИсп.МодельДанныхОбласти();
	ВидыМетаданныхСПредопределенными = ВидыМетаданныхСПредопределенными();
	РазрешенныеОбщиеДанные
		= ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыОбщихДанныхПоддерживающиеСопоставлениеСсылокПриЗагрузке();
	
	ВидыМетаданных = Новый Массив;
	ВидыМетаданных.Добавить(Метаданные.Справочники);
	ВидыМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	ВидыМетаданных.Добавить(Метаданные.ПланыСчетов);
	ВидыМетаданных.Добавить(Метаданные.ПланыВидовРасчета);
	ВидыМетаданных.Добавить(Метаданные.Документы);
	ВидыМетаданных.Добавить(Метаданные.БизнесПроцессы);
	ВидыМетаданных.Добавить(Метаданные.Задачи);
	
	Для Каждого ВидМетаданных Из ВидыМетаданных Цикл
		ИмеютПредопределенные = ВидыМетаданныхСПредопределенными.Найти(ВидМетаданных) <> Неопределено;
		Для Каждого ОбъектМетаданных Из ВидМетаданных Цикл
			Если РазделенныеОбъектыМетаданных.Получить(ОбъектМетаданных) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если РазрешенныеОбщиеДанные.Найти(ОбъектМетаданных) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ИмеютПредопределенные Или ОбъектМетаданных.ПолучитьИменаПредопределенных().Количество() = 0 Тогда
				Типы.Вставить(ТипСсылочногоОбъектаМетаданных(ОбъектМетаданных), Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

// Возвращает коллекцию типов ссылок объектов, которые разделены независимо и совместно.
//
// Возвращаемое значение:
//	Соответствие из КлючИЗначение - коллекция типов ссылок:
//	 * Ключ - Тип
//	 * Значение - Булево	
Функция ТипыПересоздаваемыхСсылок() Экспорт
	
	Типы = Новый Соответствие;
	
	Для Каждого ЭлементСостава Из Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные.Состав Цикл
		Если ЭлементСостава.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
			
			Если Метаданные.Справочники.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.ПланыВидовХарактеристик.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.ПланыОбмена.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.Документы.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.ПланыСчетов.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.ПланыВидовРасчета.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.БизнесПроцессы.Содержит(ЭлементСостава.Метаданные)
				Или Метаданные.Задачи.Содержит(ЭлементСостава.Метаданные) Тогда
				
				Типы.Вставить(ТипСсылочногоОбъектаМетаданных(ЭлементСостава.Метаданные), Истина);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Типы;
	
КонецФункции

// Возвращает коллекцию совместно разделенных объектов метаданных.
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение - коллекция объектов метаданных:
//   * Ключ - ОбъектМетаданных
//   * Значение - Булево
//
Функция СовместноИспользуемыеОбъектыМетаданных() Экспорт
	
	Объекты = Новый Соответствие;
	
	Для Каждого ЭлементСостава Из Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные.Состав Цикл
		Если ЭлементСостава.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
			Объекты.Вставить(ЭлементСостава.Метаданные, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Объекты;
	
КонецФункции

// Возвращает виды метаданных, которые могут иметь предопределенные элементы.
//
// Возвращаемое значение:
//   Массив из ОбъектМетаданных - массив видов объектов.
//
Функция ВидыМетаданныхСПредопределенными() Экспорт
	
	ВидыМетаданных = Новый Массив;
	ВидыМетаданных.Добавить(Метаданные.Справочники);
	ВидыМетаданных.Добавить(Метаданные.ПланыВидовХарактеристик);
	ВидыМетаданных.Добавить(Метаданные.ПланыСчетов);
	ВидыМетаданных.Добавить(Метаданные.ПланыВидовРасчета);
	
	Возврат ВидыМетаданных;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает тип ссылочного объекта метаданных.
// 
// Параметры:
// 	ОбъектМетаданных - ОбъектМетаданныхСправочник, ОбъектМетаданныхДокумент, ОбъектМетаданныхПланВидовХарактеристик -
// 					 - ОбъектМетаданныхПланСчетов, ОбъектМетаданныхПланВидовРасчета, ОбъектМетаданныхПланОбмена - 
// 					 - ОбъектМетаданныхБизнесПроцесс, ОбъектМетаданныхЗадача - объект метаданных.
// Возвращаемое значение:
// 	ОписаниеТипов - описание ссылочного типа.
Функция ТипСсылочногоОбъектаМетаданных(ОбъектМетаданных) 
	
	Возврат ОбъектМетаданных.СтандартныеРеквизиты.Ссылка.Тип.Типы()[0];
	
КонецФункции

#КонецОбласти
