#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		МетаданныеОбъекта = Метаданные();
		Для Каждого ПараметрЗаполнения Из ДанныеЗаполнения Цикл
			Если МетаданныеОбъекта.Реквизиты.Найти(ПараметрЗаполнения.Ключ)<>Неопределено Тогда
				ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
			Иначе
				Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ПараметрЗаполнения.Ключ) Тогда
					ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.РабочиеМестаОхраныТруда") И ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		РеквизитыРабочегоМеста = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Владелец, Подразделение, Должность");
 		Организация = РеквизитыРабочегоМеста.Владелец;
		Подразделение = РеквизитыРабочегоМеста.Подразделение;
		СтрокаРабочегоМеста = РабочиеМеста.Добавить();
		СтрокаРабочегоМеста.РабочееМесто = ДанныеЗаполнения;
		СтрокаРабочегоМеста.Подразделение = Подразделение;
		СтрокаРабочегоМеста.Должность = РеквизитыРабочегоМеста.Должность;
		СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста = 1;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПодготовкаСпецоценкиУсловийТруда") Тогда
		
		ДокументОснование = ДанныеЗаполнения;
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Организация");
			Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Подразделение");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПодготовкаСпецоценкиУсловийТруда.Исполнитель,
		|	ПодготовкаСпецоценкиУсловийТруда.ДатаНачала,
		|	ПодготовкаСпецоценкиУсловийТруда.ДатаОкончания,
		|	ПодготовкаСпецоценкиУсловийТруда.РабочиеМеста.(
		|		Подразделение,
		|		Должность,
		|		ИдентификаторСтрокиРабочегоМеста,
		|		КлассУсловийТрудаПоРезультатамПредыдущейОценки КАК КлассУсловийТруда,
		|		РабочееМесто
		|	),
		|	ПодготовкаСпецоценкиУсловийТруда.АналогичныеМеста.(
		|		ИдентификаторСтрокиРабочегоМеста,
		|		АналогичноеМесто
		|	),
		|	ПодготовкаСпецоценкиУсловийТруда.Комиссия.(
		|		ЧленКомиссии,
		|		Должность,
		|		РольВКомиссии
		|	)
		|ИЗ
		|	Документ.ПодготовкаСпецоценкиУсловийТруда КАК ПодготовкаСпецоценкиУсловийТруда
		|ГДЕ
		|	ПодготовкаСпецоценкиУсловийТруда.Ссылка = &ДокументОснование";
		
		РабочиеМеста.Очистить();
		АналогичныеМеста.Очистить();
		Комиссия.Очистить();
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Исполнитель = Выборка.Исполнитель;
			ДатаНачала = Выборка.ДатаНачала;
			ДатаРезультатов = Выборка.ДатаОкончания;
			ВыборкаРабочихМест = Выборка.РабочиеМеста.Выбрать();
			Пока ВыборкаРабочихМест.Следующий() Цикл
				СтрокаРабочегоМеста = РабочиеМеста.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРабочегоМеста, ВыборкаРабочихМест);
			КонецЦикла;
			ВыборкаАналогичныхМест = Выборка.АналогичныеМеста.Выбрать();
			Пока ВыборкаАналогичныхМест.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(АналогичныеМеста.Добавить(), ВыборкаАналогичныхМест);
			КонецЦикла;
			ВыборкаКомиссии = Выборка.Комиссия.Выбрать();
			Пока ВыборкаКомиссии.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Комиссия.Добавить(), ВыборкаКомиссии);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаРезультатов, "Объект.ДатаРезультатов", Отказ, НСтр("ru='Дата результатов'"), , , Ложь);
	
	ОхранаТруда.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Если ДатаНачала > ДатаРезультатов Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Дата результатов не может быть меньше даты начала проведения спецоценки условий труда'"), ЭтотОбъект, "ДатаРезультатов", ,Отказ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста.Выгрузить());
	Запрос.УстановитьПараметр("АналогичныеМеста", АналогичныеМеста.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	РабочиеМеста.НомерСтроки КАК НомерСтроки,
	|	РабочиеМеста.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	&РабочиеМеста КАК РабочиеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогичныеМеста.ИдентификаторСтрокиРабочегоМеста КАК ИдентификаторСтрокиРабочегоМеста,
	|	АналогичныеМеста.АналогичноеМесто КАК АналогичноеМесто
	|ПОМЕСТИТЬ ВТАналогичныеМеста
	|ИЗ
	|	&АналогичныеМеста КАК АналогичныеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|	РабочиеМеста.НомерСтроки КАК НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто КАК АналогичноеМесто
	|ИЗ
	|	(ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		РабочиеМеста.НомерСтроки КАК НомерСтроки,
	|		ЛОЖЬ КАК АналогичноеМесто
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМестаДубль
	|			ПО РабочиеМеста.РабочееМесто = РабочиеМестаДубль.РабочееМесто
	|				И РабочиеМеста.НомерСтроки <> РабочиеМестаДубль.НомерСтроки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто,
	|		РабочиеМеста.НомерСтроки,
	|		ИСТИНА
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеМеста КАК АналогичныеМеста
	|			ПО РабочиеМеста.РабочееМесто = АналогичныеМеста.АналогичноеМесто
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто,
	|		РабочиеМеста.НомерСтроки,
	|		ЛОЖЬ
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|	ГДЕ
	|		РабочиеМеста.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)) КАК РабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМеста.РабочееМесто";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
		Если Выборка.АналогичноеМесто Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в строке ""%2""'"),
				Выборка.РабочееМесто,
				Выборка.НомерСтроки);
		ИначеЕсли Не ЗначениеЗаполнено(Выборка.РабочееМесто) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" не заполнено'"), Выборка.РабочееМесто);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в нескольких строках:'") + " ",
				Выборка.РабочееМесто);
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 %2,'"),
					ТекстОшибки,
					Выборка.НомерСтроки);
			КонецЦикла;
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибки, 1);
		КонецЕсли;
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РабочиеМеста", Выборка.НомерСтроки, "РабочееМесто");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Поле, "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	СформироватьДвиженияПоРезультатамСпециальнойОценкиУсловийТруда(Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОхранаТруда.СохранитьПрежниеРабочиеМестаСпецоценки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РезультатыСпецоценкиУсловийТруда.ДатаРезультатов КАК Период,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.ИдентификаторСтрокиРабочегоМеста,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.КлассУсловийТруда,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.ВыявленыВредныеОпасныеФакторы,
	|	ДОБАВИТЬКДАТЕ(РезультатыСпецоценкиУсловийТруда.ДатаРезультатов, ГОД, 5) КАК ДатаБлижайшейОценки,
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка КАК Документ,
	|	РезультатыСпецоценкиУсловийТруда.Организация КАК Организация
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда КАК РезультатыСпецоценкиУсловийТруда
	|		ПО РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка = РезультатыСпецоценкиУсловийТруда.Ссылка
	|ГДЕ
	|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМеста.Период,
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.КлассУсловийТруда,
	|	РабочиеМеста.ВыявленыВредныеОпасныеФакторы,
	|	РабочиеМеста.ДатаБлижайшейОценки,
	|	РабочиеМеста.Организация
	|ИЗ
	|	ВТРабочиеМеста КАК РабочиеМеста
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РабочиеМеста.Период,
	|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто,
	|	РабочиеМеста.КлассУсловийТруда,
	|	РабочиеМеста.ВыявленыВредныеОпасныеФакторы,
	|	РабочиеМеста.ДатаБлижайшейОценки,
	|	РабочиеМеста.Организация
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМеста
	|		ПО РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.ИдентификаторСтрокиРабочегоМеста = РабочиеМеста.ИдентификаторСтрокиРабочегоМеста
	|			И РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка = РабочиеМеста.Документ";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура СформироватьДвиженияПоРезультатамСпециальнойОценкиУсловийТруда(Движения, ДанныеДляПроведения)
	
	Выборка = ДанныеДляПроведения.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.РезультатыСпециальнойОценкиУсловийТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока = Движения.ПлановыеДатыСпециальнойОценкиУсловийТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Движения.РезультатыСпециальнойОценкиУсловийТруда.Записывать = Истина;
	Движения.ПлановыеДатыСпециальнойОценкиУсловийТруда.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыАналогичныхРабочихМест) Экспорт
	
	АналогичныеМеста.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивАналогичныхРабочихМест = ИдентификаторыАналогичныхРабочихМест.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивАналогичныхРабочихМест = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого АналогичноеМесто Из МассивАналогичныхРабочихМест Цикл
			НоваяСтрока = АналогичныеМеста.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.АналогичноеМесто = АналогичноеМесто;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВредныеФакторы(ИдентификаторыВредныхФакторов) Экспорт
	
	ВредныеФакторы.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивВредныхФакторов = ИдентификаторыВредныхФакторов.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивВредныхФакторов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ВредныйФактор Из МассивВредныхФакторов Цикл
			НоваяСтрока = ВредныеФакторы.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.ВредныйФактор = ВредныйФактор;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли