
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Возвращаемое значение:
// Структура, которая используется для передачи параметров в функцию ПредставленияКНаградам:
// 	* НаДату           - Дата, МоментВремени, Граница, на которые формируется СрезПоследних.
// 	* Организация      - Справочник.Организации.
// 	* КатегорияНаграды - Справочник.КатегорииНаград.
// 	* ФизическоеЛицо   - Массив физических лиц или одиночное значение типа СправочникСсылка.ФизическиеЛица.
// 	* Награда          - Массив наград или одиночное значение типа СправочникСсылка.Награды.
//
Функция ОписаниеПараметровСтатусыПредставленийКНаградам() Экспорт

	Параметры = Новый Структура;
	
	Параметры.Вставить("НаДату",           Дата(1,1,1));
	Параметры.Вставить("Организация",      Неопределено);
	Параметры.Вставить("КатегорияНаграды", Неопределено);
	Параметры.Вставить("ФизическоеЛицо",   Неопределено);
	Параметры.Вставить("Награда",          Неопределено);
	
	Возврат Параметры;

КонецФункции

// Возвращает статусы представлений к наградам сотрудников.
// 
// Параметры:
//  Параметры - см. ОписаниеПараметровСтатусыПредставленийКНаградам.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Статусы представлений к наградам сотрудников.
Функция СтатусыПредставленийКНаградам(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", Параметры.НаДату);

	ШаблонУсловияОтбора = НСтр("ru='[ИмяИзмерения] В (&[ИмяПараметра])'");
	УсловияОтбора = Новый Массив;
	
	Для Каждого Параметр Из Параметры Цикл
		
		Если Параметр.Ключ = "НаДату" Тогда
			Продолжить;
		КонецЕсли;
		Если Параметр.Значение = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяПараметра = Параметр.Ключ;
		
		ЗначениеПараметра = Параметр.Значение;
		Если Не ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
			ЗначениеПараметра = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПараметра);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
		
		ПараметрыШаблона = Новый Структура("ИмяИзмерения, ИмяПараметра", ИмяПараметра, ИмяПараметра);
		УсловияОтбора.Добавить(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонУсловияОтбора, ПараметрыШаблона));
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставленияКНаградамСрезПоследних.Организация КАК Организация,
	|	ПредставленияКНаградамСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫРАЗИТЬ(ПредставленияКНаградамСрезПоследних.Награда КАК Справочник.Награды).КатегорияНаграды КАК КатегорияНаграды,
	|	ПредставленияКНаградамСрезПоследних.Награда КАК Награда,
	|	ПредставленияКНаградамСрезПоследних.Статус КАК Статус,
	|	ПредставленияКНаградамСрезПоследних.Период КАК Период,
	|	ПредставленияКНаградамСрезПоследних.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	РегистрСведений.СтатусыПредставленийКНаградам.СрезПоследних(&НаДату, &УсловиеОтбора) КАК ПредставленияКНаградамСрезПоследних";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбора", СтрСоединить(УсловияОтбора, НСтр("ru=' И '")));
	
	ПредставленияКНаградам = Запрос.Выполнить().Выгрузить();
	
	Возврат ПредставленияКНаградам;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли