
#Область СлужебныйПрограммныйИнтерфейс

#Область ГенерацияРеквизитовИЭлементовФорм

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ДобавлятьЭлементыФормы - Булево
//  ДобавлятьРеквизитыФормы - Булево
//  ОтложенноеИзменение - Булево
Процедура ДополнитьФормуДокументаЭлементамиЗамещения(Форма, ДобавлятьЭлементыФормы = Истина,
	ДобавлятьРеквизитыФормы = Истина, ОтложенноеИзменение = Ложь) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавлятьРеквизитыПодчиненного = ЦепочкиДокументов.ЭтоПодчиненныйДокумент(Форма.Объект.Ссылка);
	
	Если ДобавлятьРеквизитыФормы Тогда
		СоздатьРеквизитыФормыДляЗамещения(Форма, ДобавлятьРеквизитыПодчиненного, ОтложенноеИзменение);
	КонецЕсли;
	
	Если ДобавлятьЭлементыФормы Тогда
		СоздатьЭлементыФормыДляЗамещения(Форма);
	КонецЕсли;

	Если Не ОтложенноеИзменение Тогда
		// Значит реквизиты уже созданы - присваиваем им значения.
		ДанныеДокументаОснования = Неопределено;
		УстановитьРеквизитФормыДокументОснование(Форма, ДанныеДокументаОснования);
		Если ДобавлятьРеквизитыПодчиненного Тогда
			УстановитьРеквизитИдентификаторСтрокиОснования(Форма, ДанныеДокументаОснования);
			УстановитьРеквизитЗамещаемыйСотрудник(Форма);
		КонецЕсли;
		УстановитьИнфоНадписьЗамещения(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Устанавливает на форме информационною надпись о документах замещения.
// Создает форматированную строку с инфо-надписью.
// Присваивает получившуюся строку реквизиту формы ЗамещениеИнфоНадпись.
// Настраивает высоту поля ЗамещениеИнфоНадпись в соответствии с размером сформированной строки.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения 
//
Процедура УстановитьИнфоНадписьЗамещения(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЦепочкиДокументов.ЭтоМногосотрудниковыйДокумент(Форма.Объект.Ссылка) Тогда
		УстановитьИнфоНадписьЗамещенияВТабличнойЧасти(Форма);
	Иначе
		УстановитьИнфоНадписьЗамещенияВШапке(Форма);
	КонецЕсли;
	
КонецПроцедуры

Функция ИнфоНавигационнаяСсылка(Режим, ДокументСсылка, ФормироватьПараметрыПоСсылке = Ложь) Экспорт 

	МассивСтрок = Новый Массив;
	
	МассивСтрок.Добавить(Режим);
	МассивСтрок.Добавить(ДокументСсылка.Метаданные().Имя);
	МассивСтрок.Добавить(Строка(ДокументСсылка.УникальныйИдентификатор()));
	МассивСтрок.Добавить(?(ФормироватьПараметрыПоСсылке, "1", "0"));
	
	Возврат СтрСоединить(МассивСтрок, "%");

КонецФункции

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяТаблицыФормы - Строка
//  НоваяСтрока - Булево
Процедура ПриОкончанииРедактированияСтроки(Форма, ИмяТаблицыФормы, НоваяСтрока) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		ЗаполнитьИдентификаторСтроки(Форма, ИмяТаблицыФормы);
		УстановитьИнфоНадписьЗамещения(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ОтобранныеСотрудники - Массив из СправочникСсылка.Сотрудники
Процедура ПриОбработкеВыбораВТабличнойЧасти(Форма, ОтобранныеСотрудники) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтобранныеСотрудники.Количество() > 0 Тогда
		УстановитьИнфоНадписьЗамещения(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Текст инфо надписи замещения.
// 
// Параметры:
//  СтруктураИсходногоДокумента - см. ИсходныйДокументЗамещения
//  ТаблицаДокументовОснования - см. ЦепочкиДокументов.ДокументыОснования
//  ТаблицаПодчиненныхДокументов - см. ЦепочкиДокументов.ПодчиненныеДокументы
// 
// Возвращаемое значение:
//  Структура - Текст инфо надписи замещения:
//   * ТекстНадписи - Массив из Строка, ФорматированнаяСтрока -
//   * Высота - Число -
Функция ТекстИнфоНадписиЗамещения(СтруктураИсходногоДокумента, ТаблицаДокументовОснования, ТаблицаПодчиненныхДокументов) 
	
	ДокументСсылка = СтруктураИсходногоДокумента.ИсходныйДокумент;
	ЭтоСопутствующийДокумент = СтруктураИсходногоДокумента.НайденоИсправление Или СтруктураИсходногоДокумента.НайденоОснование;
	
	ТекстНадписи = Новый Массив;
	
	ЕстьПодчиненные = ТаблицаПодчиненныхДокументов.Количество() > 0;
	ЕстьОснования = ТаблицаДокументовОснования.Количество() > 0;

	ЭтоДокументОснование = ЦепочкиДокументов.ЭтоДокументОснование(ДокументСсылка);
	ЭтоПодчиненныйДокумент = ЦепочкиДокументов.ЭтоПодчиненныйДокумент(ДокументСсылка);
	
	Высота = 0;
	
	Если Не ЭтоДокументОснование И Не ЭтоПодчиненныйДокумент Тогда
		Возврат Новый Структура("ТекстНадписи, Высота", ТекстНадписи, Высота);
	КонецЕсли;
	
	// Формируем информацию про основания этого документа.
	Если ЭтоПодчиненныйДокумент И ЕстьОснования Тогда
		ДобавитьИнфоДокументаОснования(ТекстНадписи, ТаблицаДокументовОснования);
		Высота = Высота + 1;
	КонецЕсли;
	
	// Формируем информацию про документы, введенные на основании данного документа.
	Если ЭтоДокументОснование Тогда
		
		Если Высота = 1 Тогда
			ТекстНадписи.Добавить(Символы.ПС);
		КонецЕсли;
		
		Высота = Высота + 1;
		Если ЕстьПодчиненные Тогда
			ДобавитьИнфоПодчиненныхДокументов(ТекстНадписи, ТаблицаПодчиненныхДокументов, СтруктураИсходногоДокумента);
		Иначе
			ДобавитьКомандуВызоваПомощника(ТекстНадписи, ДокументСсылка, ЭтоСопутствующийДокумент);
		КонецЕсли;
		
	КонецЕсли;

	Возврат Новый Структура("ТекстНадписи, Высота", ТекстНадписи, Высота);
	
КонецФункции

// Параметры:
//  ТекстНадписи - Массив из Строка, ФорматированнаяСтрока -
//  ТаблицаДокументовОснования - см. ЦепочкиДокументов.ДокументыОснования
Процедура ДобавитьИнфоДокументаОснования(ТекстНадписи, ТаблицаДокументовОснования)
	
	ТекстНадписи.Добавить(НСтр("ru = 'Создан на период отсутствия'"));
	ТекстНадписи.Добавить(" ");
	
	Если ТаблицаДокументовОснования.Количество() > 0 Тогда
		СтрокаТаблицыДокументовОснований = ТаблицаДокументовОснования[0];
	КонецЕсли;
	
	СсылкаСотрудника = ИнфоНавигационнаяСсылка("ОткрытьДокумент", СтрокаТаблицыДокументовОснований.Основание);
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СтрокаТаблицыДокументовОснований.СотрудникОснования, "Наименование");
	СклонениеФИО = СклонениеПредставленийОбъектов.ПросклонятьПредставление(ФИО, 2);
	
	ТекстНадписи.Добавить(Новый ФорматированнаяСтрока(
		ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеФИО),,,, СсылкаСотрудника));
	
КонецПроцедуры

// Параметры:
//  ТекстНадписи - Массив из Строка, ФорматированнаяСтрока -
//  ТаблицаПодчиненныхДокументов - см. ЦепочкиДокументов.ПодчиненныеДокументы
//  СтруктураИсходногоДокумента - см. ИсходныйДокументЗамещения
Процедура ДобавитьИнфоПодчиненныхДокументов(ТекстНадписи, ТаблицаПодчиненныхДокументов, СтруктураИсходногоДокумента)

	ДокументСсылка = СтруктураИсходногоДокумента.ИсходныйДокумент;
	ФормироватьПараметрыПоСсылке = СтруктураИсходногоДокумента.НайденоИсправление
		Или СтруктураИсходногоДокумента.НайденоОснование;
	
	МаксимумСотрудниковНаФорме = 2;
	КоличествоОтображаемыхСотрудников =
		МаксимумСотрудниковНаФорме - ?(ТаблицаПодчиненныхДокументов.Количество() > МаксимумСотрудниковНаФорме, 1, 0);
	
	МассивСтрок = Новый Массив;
	
	Если СтруктураИсходногоДокумента.НайденоОснование Тогда
		ОписаниеДокумента = ЦепочкиДокументов.ОписаниеДокументовЗамещения(ДокументСсылка);
		ТекстСтроки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'На время %1'"), ОписаниеДокумента.КраткоеНазваниеРодительныйПадеж);
		МассивСтрок.Добавить(ТекстСтроки);
		МассивСтрок.Добавить(" ");
		Если ТаблицаПодчиненныхДокументов.Количество() > 1 Тогда
			ТекстЗамещает = НСтр("ru = 'замещали:'");
		Иначе
			ТекстЗамещает = НСтр("ru = 'замещал'");
		КонецЕсли;
	Иначе
		Если ТаблицаПодчиненныхДокументов.Количество() > 1 Тогда
			ТекстЗамещает = НСтр("ru = 'Замещают:'");
		Иначе
			ТекстЗамещает = НСтр("ru = 'Замещает'");
		КонецЕсли;
	КонецЕсли;
	МассивСтрок.Добавить(ТекстЗамещает);
	МассивСтрок.Добавить(" ");
	
	Всего = 1;
	Для каждого ПодчиненныйДокумент Из ТаблицаПодчиненныхДокументов Цикл
		Если Всего > 1 Тогда
			МассивСтрок.Добавить(", ");
		КонецЕсли;
		МассивСтрок.Добавить(ПодчиненныйДокумент.СотрудникПодчиненногоФамилияИО);
		Если Всего >= КоличествоОтображаемыхСотрудников Тогда
			Прервать;
		КонецЕсли;
		Всего = Всего + 1;
	КонецЦикла; 
	
	Если ТаблицаПодчиненныхДокументов.Количество() > КоличествоОтображаемыхСотрудников Тогда
		МассивСтрок.Добавить(" ");
		Остаток = ТаблицаПодчиненныхДокументов.Количество() - Всего;
		Если Остаток < 5 Тогда
			МассивСтрок.Добавить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'и еще %1 сотрудника'"), Остаток));
		Иначе
			МассивСтрок.Добавить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'и еще %1 сотрудников'"), Остаток));
		КонецЕсли;
	КонецЕсли;
	
	ТекстНадписи.Добавить(Новый ФорматированнаяСтрока(МассивСтрок,,,,
		ИнфоНавигационнаяСсылка("ВызовФормыЗамещения", ДокументСсылка, ФормироватьПараметрыПоСсылке)));

КонецПроцедуры

Процедура ДобавитьКомандуВызоваПомощника(ТекстНадписи, ДокументСсылка, ЭтоСопутствующийДокумент)
	
	ФормироватьПараметрыПоСсылке = ЭтоСопутствующийДокумент;
	
	Если Не ЭтоСопутствующийДокумент Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Ввести замещение на период %1'"),
			ЦепочкиДокументов.ОписаниеДокументовЗамещения(ДокументСсылка).КраткоеНазваниеРодительныйПадеж);
		ТекстНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстЗаголовка,,,,
			ИнфоНавигационнаяСсылка("ВызовФормыЗамещения", ДокументСсылка, ФормироватьПараметрыПоСсылке)));
	КонецЕсли;

КонецПроцедуры

Функция ИсходныйДокументЗамещения(ТекущийОбъект)
	
	СтруктураИсправления = ИсходныйДокументИсправления(ТекущийОбъект);
	СтруктураОснования = ИсходныйДокументОснования(ТекущийОбъект, СтруктураИсправления);
	
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("ИсходныйДокумент", СтруктураОснования.ИсходныйДокумент);
	ВозвращаемаяСтруктура.Вставить("НайденоИсправление", СтруктураИсправления.НайденоИсправление);
	ВозвращаемаяСтруктура.Вставить("НайденоОснование", СтруктураОснования.НайденоОснование);
	
	Возврат ВозвращаемаяСтруктура;
	
КонецФункции

Функция ИсходныйДокументИсправления(ТекущийОбъект)
	
	ИмяРеквизитОснование = "ИсправленныйДокумент";
	ДругойДокумент = Ложь;
	
	ИсходныйДокументСсылка = ТекущийОбъект.Ссылка;
	ИсправленныйДокументСсылка = ТекущийОбъект[ИмяРеквизитОснование];
	
	ТекущийДокументСсылка = ИсправленныйДокументСсылка;
	
	Пока ЗначениеЗаполнено(ТекущийДокументСсылка) Цикл
		ДругойДокумент = Истина;
		ИсходныйДокументСсылка = ТекущийДокументСсылка;
		ТекущийДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументСсылка, ИмяРеквизитОснование);
	КонецЦикла; 
	
	Возврат Новый Структура("ИсходныйДокумент, НайденоИсправление", ИсходныйДокументСсылка, ДругойДокумент);
	
КонецФункции

Функция ИсходныйДокументОснования(ТекущийОбъект, СтруктураИсправления)
	
	ИсходныйДокументСсылка = СтруктураИсправления.ИсходныйДокумент;
	БратьИзТекущегоОбъекта = Не СтруктураИсправления.НайденоИсправление;
	ДругойДокумент = Ложь;
	
	ИмяРеквизитОснование = ЦепочкиДокументов.ОписаниеДокументовЗамещения(ИсходныйДокументСсылка).ИмяРеквизитаДокументОснование;
	Если Не ЗначениеЗаполнено(ИмяРеквизитОснование) Тогда
		Возврат Новый Структура("ИсходныйДокумент, НайденоОснование", ИсходныйДокументСсылка, ДругойДокумент)
	КонецЕсли;
	
	Если БратьИзТекущегоОбъекта Тогда
		ТекущийДокументСсылка = ТекущийОбъект[ИмяРеквизитОснование];
	Иначе
		ТекущийДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументСсылка, ИмяРеквизитОснование);
	КонецЕсли;
	
	Пока ЗначениеЗаполнено(ТекущийДокументСсылка) Цикл
		ДругойДокумент = Истина;
		ИсходныйДокументСсылка = ТекущийДокументСсылка;
		
		ИмяРеквизитОснование = ЦепочкиДокументов.ОписаниеДокументовЗамещения(ИсходныйДокументСсылка).ИмяРеквизитаДокументОснование;
		Если Не ЗначениеЗаполнено(ИмяРеквизитОснование) Тогда
			Прервать;
		КонецЕсли;
		
		ТекущийДокументСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументСсылка, ИмяРеквизитОснование);
	КонецЦикла; 
	
	Возврат Новый Структура("ИсходныйДокумент, НайденоОснование", ИсходныйДокументСсылка, ДругойДокумент);
	
КонецФункции

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИмяТаблицыФормы - Строка
Процедура ЗаполнитьИдентификаторСтроки(Форма, ИмяТаблицыФормы)
	
	Документ = Форма.Объект.Ссылка;
	
	ОписаниеДокумента = ЦепочкиДокументов.ОписаниеДокументовЗамещения(Документ);
	ИмяТабличнойЧасти = ОписаниеДокумента.ИмяТабличнойЧастиСотрудники;
	ИмяРеквизитаИдентификаторСтроки = ОписаниеДокумента.ИмяРеквизитаИдентификаторСтроки;
	
	ИндексСтроки = Форма.Элементы[ИмяТаблицыФормы].ТекущаяСтрока;
	ТекущиеДанные =  Форма.Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ИндексСтроки);
	Если ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(ТекущиеДанные[ИмяРеквизитаИдентификаторСтроки]) Тогда
		ТекущиеДанные[ИмяРеквизитаИдентификаторСтроки] = Новый УникальныйИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

#Область ГенерацияРеквизитовИЭлементовФорм

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ДобавлятьРеквизитыПодчиненного - Булево
//  ОтложенноеИзменение - Булево
Процедура СоздатьРеквизитыФормыДляЗамещения(Форма, ДобавлятьРеквизитыПодчиненного = Ложь, ОтложенноеИзменение = Ложь)

	// Создание реквизитов формы.
	МассивРеквизитов = Новый Массив;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЭтоМногосотрудниковыйДокумент = ЦепочкиДокументов.ЭтоМногосотрудниковыйДокумент(Форма.Объект.Ссылка);
	
	Если ЭтоМногосотрудниковыйДокумент Тогда
		ОписаниеДокумента = ЦепочкиДокументов.ОписаниеДокументовЗамещения(Форма.Объект.Ссылка);
		ПутьКРеквизиту = "Объект." + ОписаниеДокумента.ИмяТабличнойЧастиСотрудники;
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы, ПутьКРеквизиту);
		
		РеквизитЗамещениеКоличествоПодчиненных = Новый РеквизитФормы("ЗамещениеКоличествоПодчиненных",
			Новый ОписаниеТипов("Число"), ПутьКРеквизиту);
		МассивРеквизитов.Добавить(РеквизитЗамещениеКоличествоПодчиненных);
		
		РеквизитЗамещениеИнфоНадпись = Новый РеквизитФормы("ЗамещениеИнфоНадпись", Новый ОписаниеТипов("Строка"),
			ПутьКРеквизиту);
		МассивРеквизитов.Добавить(РеквизитЗамещениеИнфоНадпись);
	Иначе
		РеквизитЗамещениеИнфоНадпись = Новый РеквизитФормы("ЗамещениеИнфоНадпись",
			Новый ОписаниеТипов("ФорматированнаяСтрока"));
		РеквизитЗамещениеИнфоНадпись.Заголовок = НСтр("ru = 'Инфо-надпись подсистемы Замещение'");
		МассивРеквизитов.Добавить(РеквизитЗамещениеИнфоНадпись);
	КонецЕсли;

	Если ДобавлятьРеквизитыПодчиненного Тогда
		
		РеквизитЗамещениеДокументОснование = Новый РеквизитФормы("ЗамещениеДокументОснование",
			Метаданные.ОпределяемыеТипы.ЦепочкиДокументовОснования.Тип);
		МассивРеквизитов.Добавить(РеквизитЗамещениеДокументОснование);
		
		РеквизитЗамещаемыйСотрудник = Новый РеквизитФормы("ЗамещаемыйСотрудник",
			Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
		МассивРеквизитов.Добавить(РеквизитЗамещаемыйСотрудник);
			
		РеквизитИдентификаторСтрокиОснования = Новый РеквизитФормы("ИдентификаторСтрокиОснования",
			Новый ОписаниеТипов("УникальныйИдентификатор"));
		МассивРеквизитов.Добавить(РеквизитИдентификаторСтрокиОснования);
		
	КонецЕсли;
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, МассивРеквизитов, МассивИменРеквизитовФормы,, ОтложенноеИзменение);

КонецПроцедуры

Процедура СоздатьЭлементыФормыДляЗамещения(Форма)

	Если ЦепочкиДокументов.ЭтоМногосотрудниковыйДокумент(Форма.Объект.Ссылка) Тогда
		ОписаниеДокумента = ЦепочкиДокументов.ОписаниеДокументовЗамещения(Форма.Объект.Ссылка);
		ИмяЭлемента = ОписаниеДокумента.ИмяТабличнойЧастиСотрудники + "ЗамещениеИнфоНадпись";
		Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"),
				Форма.Элементы.Найти(ОписаниеДокумента.ИмяТабличнойЧастиСотрудники));
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = СтрШаблон("Объект.%1.ЗамещениеИнфоНадпись",
				ОписаниеДокумента.ИмяТабличнойЧастиСотрудники);
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.ГиперссылкаЯчейки = Истина;
			Элемент.ЦветТекста = Метаданные.ЭлементыСтиля.ГиперссылкаЦвет.Значение;
		КонецЕсли;
	Иначе
		ПрилуняемаяГруппа = Форма.Элементы.Найти("ГруппаЦепочкиДокументов");
		
		Если ПрилуняемаяГруппа = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		// Декорация
		Если Форма.Элементы.Найти("ЗамещениеКартинка") = Неопределено Тогда
			Элемент = Форма.Элементы.Добавить("ЗамещениеКартинка", Тип("ДекорацияФормы"), ПрилуняемаяГруппа);
			Элемент.Вид = ВидДекорацииФормы.Картинка;
			Элемент.Картинка = БиблиотекаКартинок.Предупреждение;
			Элемент.Ширина = 2;
			Элемент.Высота = 1;
		КонецЕсли;
		
		Если Форма.Элементы.Найти("ЗамещениеИнфоНадпись") = Неопределено Тогда
			Элемент = Форма.Элементы.Вставить("ЗамещениеИнфоНадпись", Тип("ПолеФормы"), ПрилуняемаяГруппа);
			Элемент.Вид = ВидПоляФормы.ПолеНадписи;
			Элемент.ПутьКДанным = "ЗамещениеИнфоНадпись";
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки",
			"Подключаемый_ЗамещениеИнфоНадписьОбработкаНавигационнойСсылки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьРеквизитФормыДокументОснование(Форма, ДанныеДокументаОснования = Неопределено)

	Если Форма.Параметры.Свойство("ДокументОснование") Тогда
		Форма.ЗамещениеДокументОснование = Форма.Параметры.ДокументОснование;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДокументаОснования) Тогда
		ДанныеДокументаОснования = ЦепочкиДокументов.ДанныеДокументаОснования(Форма.Объект.Ссылка);
	КонецЕсли;
	
	Основание = ДанныеДокументаОснования.Основание;
	Если ЗначениеЗаполнено(Основание) Тогда
		Форма.ЗамещениеДокументОснование = Основание;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьРеквизитИдентификаторСтрокиОснования(Форма, ДанныеДокументаОснования = Неопределено)

	Если Форма.Параметры.Свойство("ИдентификаторСтрокиОснования") Тогда
		Форма.ИдентификаторСтрокиОснования = Форма.Параметры.ИдентификаторСтрокиОснования;
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ДанныеДокументаОснования) Тогда
		ДанныеДокументаОснования = ЦепочкиДокументов.ДанныеДокументаОснования(Форма.Объект.Ссылка);
	КонецЕсли;
	
	ИдентификаторСтрокиОснования = ДанныеДокументаОснования.ИдентификаторСтрокиОснования;
	Если ЗначениеЗаполнено(ИдентификаторСтрокиОснования) Тогда
		Форма.ИдентификаторСтрокиОснования = ИдентификаторСтрокиОснования;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьРеквизитЗамещаемыйСотрудник(Форма)
	
	ЗамещаемыйСотрудник = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗамещаемыйСотрудник");
	
	ДокументОснование = Форма.ЗамещениеДокументОснование;
	Если Не ЗначениеЗаполнено(ЗамещаемыйСотрудник) И ЗначениеЗаполнено(ДокументОснование) Тогда
		Если ЦепочкиДокументов.ЭтоМногосотрудниковыйДокумент(ДокументОснование) Тогда
			ЗамещаемыйСотрудник = ЦепочкиДокументов.ДанныеДокументаОснования(Форма.Параметры.Ключ,
				ДокументОснование).СотрудникОснования;
		Иначе
			ИмяРеквизита = ЦепочкиДокументов.ОписаниеДокументовЗамещения(ДокументОснование).ИмяРеквизитаСотрудник;
			ЗамещаемыйСотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, ИмяРеквизита);
		КонецЕсли;
	КонецЕсли;
	
	Форма.ЗамещаемыйСотрудник = ЗамещаемыйСотрудник;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура УстановитьИнфоНадписьЗамещенияВТабличнойЧасти(Форма)
	
	Документ = Форма.Объект.Ссылка;
	
	ОписаниеДокумента = ЦепочкиДокументов.ОписаниеДокументовЗамещения(Документ);
	ИмяТабличнойЧасти = ОписаниеДокумента.ИмяТабличнойЧастиСотрудники;
	
	ТаблицаПодчиненныхДокументов = ЦепочкиДокументов.ПодчиненныеДокументы(Документ);
	
	ТекстВвестиЗамещение = НСтр("ru = 'Ввести замещение'");
	
	Если ТаблицаПодчиненныхДокументов.Количество() = 0 Тогда
		Для каждого СтрокаТабличнойЧасти Из Форма.Объект[ИмяТабличнойЧасти] Цикл
			СтрокаТабличнойЧасти.ЗамещениеИнфоНадпись = ТекстВвестиЗамещение;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТабличнойЧасти Из Форма.Объект[ИмяТабличнойЧасти] Цикл
		
		КлючСтроки = Новый Структура("Основание,ИдентификаторСтрокиОснования", Документ,
			СтрокаТабличнойЧасти[ОписаниеДокумента.ИмяРеквизитаИдентификаторСтроки]);
		ПодчиненныеДокументы = ЦепочкиДокументов.ДокументыПодчиненныеСтроке(Документ, КлючСтроки,
			ТаблицаПодчиненныхДокументов);
			
		КоличествоНайденныхСтрок = ПодчиненныеДокументы.Количество();
		СтрокаТабличнойЧасти.ЗамещениеКоличествоПодчиненных = КоличествоНайденныхСтрок;
		
		Если КоличествоНайденныхСтрок = 0 Тогда
			ТекстЗамещения = ТекстВвестиЗамещение;
		ИначеЕсли КоличествоНайденныхСтрок = 1 Тогда
			ТекстЗамещения = СтрШаблон(НСтр("ru = 'Замещает: %1'"),
				ПодчиненныеДокументы[0].СотрудникПодчиненногоФамилияИО);
		ИначеЕсли КоличествоНайденныхСтрок = 2 Тогда
			ТекстЗамещения = СтрШаблон(НСтр("ru = 'Замещают: %1 и %2'"),
				ПодчиненныеДокументы[0].СотрудникПодчиненногоФамилияИО,
				ПодчиненныеДокументы[1].СотрудникПодчиненногоФамилияИО);
		Иначе
			ТекстЕщеСотрудников = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru=';%1 сотрудник;;%1 сотрудника;%1 сотрудников;%1 сотрудника'"), КоличествоНайденныхСтрок - 2);
			ТекстЗамещения = СтрШаблон(НСтр("ru = 'Замещают: %1, %2 и еще %3'"),
				ПодчиненныеДокументы[0].СотрудникПодчиненногоФамилияИО,
				ПодчиненныеДокументы[1].СотрудникПодчиненногоФамилияИО, ТекстЕщеСотрудников);
		КонецЕсли;
		СтрокаТабличнойЧасти.ЗамещениеИнфоНадпись = ТекстЗамещения;
	КонецЦикла;

КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения 
Процедура УстановитьИнфоНадписьЗамещенияВШапке(Форма)
	
	СтруктураИсходногоДокумента = ИсходныйДокументЗамещения(Форма.Объект);
	ИсходныйДокумент = СтруктураИсходногоДокумента.ИсходныйДокумент;
	
	ЭтоСопутствующийДокумент = СтруктураИсходногоДокумента.НайденоИсправление
		Или СтруктураИсходногоДокумента.НайденоОснование;
	
	Если ЦепочкиДокументов.ЭтоПодчиненныйДокумент(ИсходныйДокумент) Тогда
		Если ЭтоСопутствующийДокумент Тогда
			ДанныеДокументаОснования = ЦепочкиДокументов.ДанныеДокументаОснования(ИсходныйДокумент);
			ДокументОснование = ДанныеДокументаОснования.Основание;
			ЗамещаемыйСотрудник = ДанныеДокументаОснования.СотрудникОснования;
		Иначе
			ДокументОснование = Форма.ЗамещениеДокументОснование;
			ЗамещаемыйСотрудник = Форма.ЗамещаемыйСотрудник;
		КонецЕсли;
	Иначе
		ДокументОснование = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) И ЗначениеЗаполнено(ЗамещаемыйСотрудник) Тогда
		ТаблицаДокументовОснования = ЦепочкиДокументов.ТаблицаСДокументомОснованием(ДокументОснование,
			ЗамещаемыйСотрудник);
	Иначе
		ТаблицаДокументовОснования = ЦепочкиДокументов.ДокументыОснования(ИсходныйДокумент);
	КонецЕсли;
	
	ТаблицаПодчиненныхДокументов = ЦепочкиДокументов.ПодчиненныеДокументы(ИсходныйДокумент);
	
	СтруктураНадписи = ТекстИнфоНадписиЗамещения(СтруктураИсходногоДокумента, ТаблицаДокументовОснования,
		ТаблицаПодчиненныхДокументов);
	
	ТекстНадписи = СтруктураНадписи.ТекстНадписи;
	Форма.Элементы.ЗамещениеИнфоНадпись.Высота = СтруктураНадписи.Высота;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаЦепочкиДокументов", "Видимость",
		ЗначениеЗаполнено(ТекстНадписи));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗамещениеКартинка", "Видимость",
		ЭтоСопутствующийДокумент);
		
	Если Не ЗначениеЗаполнено(ТекстНадписи) Тогда
		Возврат;
	КонецЕсли; 
		
	Форма.ЗамещениеИнфоНадпись = Новый ФорматированнаяСтрока(ТекстНадписи);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти