#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаРассылкиПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт

	ДополнитьФорму(Форма);
	
	Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "РассылатьПоШаблону", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений"), 
		НСтр("ru = 'Шаблоны сообщений отключены и не используются.'"), "РассылкаПоШаблонамФормы");
	
	Форма.РассылатьПоШаблону = Истина;
	Форма.ПредметШаблона = Форма.Параметры.ПредметШаблона;
	Форма.ВладелецШаблона = Форма.Параметры.ВладелецШаблона;
	
	ЗаполнитьСписокДоступныхШаблонов(Форма);
	ЗагрузитьПользовательскиеНастройки(Форма);
	СкрытьПечатныеФормы(Форма);
	УстановитьЗаголовокНижнейПанели(Форма);
	УстановитьВидимостьГруппыШаблоновНет(Форма);
	
КонецПроцедуры

Процедура ФормаРассылкиВызовСервера(Форма, Параметры, ИмяПроцедуры) Экспорт
	
	Если ИмяПроцедуры = "ОбновитьСписокШаблонов" Тогда
		ОбновитьСписокШаблонов(Форма, Параметры);
	ИначеЕсли ИмяПроцедуры = "УстановитьHTMLВФорматированныйДокумент" Тогда
		УстановитьHTMLВФорматированныйДокумент(Форма, Параметры.ТекстШаблонаПисьмаHTML, Параметры.СсылкаНаТекущийОбъект);
	ИначеЕсли ИмяПроцедуры = "СохранитьПользовательскиеНастройки" Тогда
		СохранитьПользовательскиеНастройки(Форма);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Не найдено обработчика процедуры %1'"), ИмяПроцедуры), "РассылкаПоШаблонамФормы");
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормаРассылкиПриЗаполненииПараметровДляОтправки(Форма, ДляОтправки) Экспорт
	
	Если Форма.РассылатьПоШаблону Тогда
		ДляОтправки.Вставить("РассылатьПоШаблону", Истина);
		ДляОтправки.Вставить("ВыбранныйШаблон", Форма.ВыбранныйШаблон);
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормаРассылкиОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Форма.РассылатьПоШаблону И Не ЗначениеЗаполнено(Форма.ВыбранныйШаблон) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран шаблон письма'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Шаблоны", , Отказ);
		Форма.Элементы.ГруппаНижняяПанель.Показать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФорму(Форма)
	
	ДобавитьРеквизитыФормы(Форма);
	ДобавитьКомандыФормы(Форма);
	ДобавитьЭлементыФормы(Форма);
	
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РассылатьПоШаблону", Новый ОписаниеТипов("Булево")));
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "РассылатьПоШаблону", Ложь) Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВыбранныйШаблон", Новый ОписаниеТипов("СправочникСсылка.ШаблоныСообщений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредпросмотрОбычныйТекст", Новый ОписаниеТипов("ТекстовыйДокумент")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредпросмотрФорматированныйДокумент", Новый ОписаниеТипов("ФорматированныйДокумент")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Шаблоны", Новый ОписаниеТипов("ТаблицаЗначений")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Имя", Новый ОписаниеТипов("Строка"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекстШаблона", Новый ОписаниеТипов("Строка"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипТекстаПисьма", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыРедактированияЭлектронныхПисем"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Ссылка", Новый ОписаниеТипов("СправочникСсылка.ШаблоныСообщений"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЕстьПроизвольныеПараметры", Новый ОписаниеТипов("Булево"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ШаблонПоВнешнейОбработке", Новый ОписаниеТипов("Булево"), "Шаблоны"));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПредметШаблона", Новый ОписаниеТипов("Строка")));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВладелецШаблона", Метаданные.ОпределяемыеТипы.ВладелецШаблонаСообщения.Тип));
	КонецЕсли;
	
	СуществующиеРеквизиты = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, СуществующиеРеквизиты);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, СуществующиеРеквизиты);
	
КонецПроцедуры

Процедура ДобавитьКомандыФормы(Форма)
	
	Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "РассылатьПоШаблону", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	КомандаДобавить = Форма.Команды.Добавить("ДобавитьШаблон");
	КомандаДобавить.Заголовок = НСтр("ru = 'Добавить шаблон'");
	КомандаДобавить.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	КомандаДобавить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КомандаДобавить.Действие = "Подключаемый_РассылкаПоШаблонамВыполнитьКоманду";
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма)
	
	Если Не ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "РассылатьПоШаблону", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Элементы.Добавить("ШаблоныГруппа", Тип("ГруппаФормы"), Элементы.ШаблоныСтраница).Вид = ВидГруппыФормы.ОбычнаяГруппа;

	Элементы.Добавить("Шаблоны", Тип("ТаблицаФормы"), Элементы.ШаблоныГруппа);;
	
	Элементы.Добавить("ШаблоныПредставление", Тип("ПолеФормы"), Элементы.Шаблоны);
	Элементы.Добавить("СтраницыПредпросмотра", Тип("ГруппаФормы"), Элементы.ШаблоныСтраница).Вид = ВидГруппыФормы.Страницы;
	Элементы.Добавить("СтраницаОбычныйТекст", Тип("ГруппаФормы"), Элементы.СтраницыПредпросмотра).Вид = ВидГруппыФормы.Страница;
	Элементы.Добавить("ПредпросмотрОбычныйТекст", Тип("ПолеФормы"), Элементы.СтраницаОбычныйТекст);
	Элементы.Добавить("СтраницаФорматированныйДокумент", Тип("ГруппаФормы"), Элементы.СтраницыПредпросмотра).Вид = ВидГруппыФормы.Страница;
	Элементы.Добавить("ПредпросмотрФорматированныйДокумент", Тип("ПолеФормы"), Элементы.СтраницаФорматированныйДокумент);
	Элементы.Добавить("ШаблоновНетГруппа", Тип("ГруппаФормы"), Элементы.ШаблоныСтраница).Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элементы.Добавить("ШаблоновНетГруппаПояснения", Тип("ГруппаФормы"), Элементы.ШаблоновНетГруппа).Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Элементы.Добавить("ШаблоновНетКартинка", Тип("ДекорацияФормы"), Элементы.ШаблоновНетГруппаПояснения);
	Элементы.Добавить("ШаблоновНетНадпись", Тип("ДекорацияФормы"), Элементы.ШаблоновНетГруппаПояснения);
	Элементы.Добавить("ДобавитьШаблонКнопка", Тип("КнопкаФормы"), Элементы.ШаблоновНетГруппа);
	
	НастроитьПолеШаблоны(Форма);
	НастроитьПоляПредпросмотра(Форма);
	НастроитьПолеШаблоновНет(Форма);
	
	Элементы.ПисьмоСтраницы.ТекущаяСтраница = Элементы.ШаблоныСтраница;
	
КонецПроцедуры

Процедура НастроитьПолеШаблоновНет(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблоновНетГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Элементы.ДобавитьШаблонКнопка.ИмяКоманды = "ДобавитьШаблон";
	
	Элементы.ШаблоновНетГруппаПояснения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Элементы.ШаблоновНетКартинка.Вид = ВидДекорацииФормы.Картинка;
	Элементы.ШаблоновНетКартинка.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	Элементы.ШаблоновНетНадпись.Вид = ВидДекорацииФормы.Надпись;
	Элементы.ШаблоновНетНадпись.Заголовок = 
		НСтр("ru = 'Пока нет ни одного шаблона, 
			 |добавьте шаблон письма, чтобы продолжить рассылку'");
	
	Элементы.ШаблоновНетНадпись.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
КонецПроцедуры

Процедура НастроитьПолеШаблоны(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.Шаблоны.ПутьКДанным = "Шаблоны";
	Элементы.Шаблоны.Заголовок = НСтр("ru = 'Выбор шаблона письма'");
	Элементы.Шаблоны.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	Элементы.Шаблоны.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	Элементы.Шаблоны.ВысотаВСтрокахТаблицы = 3;
	Элементы.Шаблоны.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элементы.Шаблоны.Шапка = Ложь;
	Элементы.Шаблоны.ГоризонтальныеЛинии = Ложь;
	
	Элементы.Шаблоны.УстановитьДействие("Выбор", "Подключаемый_РассылкаПоШаблонамВыбор");
	Элементы.Шаблоны.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_РассылкаПоШаблонамПриАктивизацииСтроки");
	Элементы.Шаблоны.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_РассылкаПоШаблонамПередНачаломДобавления");
	Элементы.Шаблоны.УстановитьДействие("ПередНачаломИзменения", "Подключаемый_РассылкаПоШаблонамПередНачаломИзменения");
	Элементы.Шаблоны.УстановитьДействие("ПередУдалением", "Подключаемый_РассылкаПоШаблонамПередУдалением");
	
	Элементы.ШаблоныПредставление.ПутьКДанным = "Шаблоны.Представление";
	
КонецПроцедуры

Процедура НастроитьПоляПредпросмотра(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.СтраницыПредпросмотра.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Элементы.ПредпросмотрОбычныйТекст.ПутьКДанным = "ПредпросмотрОбычныйТекст";
	Элементы.ПредпросмотрОбычныйТекст.ТолькоПросмотр = Истина;
	Элементы.ПредпросмотрОбычныйТекст.Ширина = 50;
	Элементы.ПредпросмотрОбычныйТекст.Высота = 8;
	Элементы.ПредпросмотрОбычныйТекст.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
	Элементы.ПредпросмотрФорматированныйДокумент.ПутьКДанным = "ПредпросмотрФорматированныйДокумент";
	Элементы.ПредпросмотрФорматированныйДокумент.ТолькоПросмотр = Истина;
	Элементы.ПредпросмотрФорматированныйДокумент.Ширина = 50;
	Элементы.ПредпросмотрФорматированныйДокумент.Высота = 8;
	Элементы.ПредпросмотрФорматированныйДокумент.АвтоМаксимальнаяВысота = Ложь;
	Элементы.ПредпросмотрФорматированныйДокумент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	
КонецПроцедуры

Процедура СкрытьПечатныеФормы(Форма)
	Форма.Элементы.ВложенияГруппа.Видимость = Ложь;
	Форма.Элементы.ФормаПечать.Видимость = Ложь;
КонецПроцедуры

Процедура УстановитьЗаголовокНижнейПанели(Форма)
	Форма.Элементы.ГруппаНижняяПанель.Заголовок = НСтр("ru = 'Шаблон письма, учетная запись и др.'");
КонецПроцедуры

Процедура ЗаполнитьСписокДоступныхШаблонов(Форма, Знач ПодходящиеШаблоны = Неопределено)
	
	Форма.ВыбранныйШаблон = Неопределено;
	Параметры = Форма.Параметры;
	
	Если ПодходящиеШаблоны = Неопределено Тогда
		ПодходящиеШаблоны = ПодходящиеШаблоны(Параметры.ПредметШаблона, Параметры.ВладелецШаблона);
	КонецЕсли;
	
	Форма.Шаблоны.Загрузить(ПодходящиеШаблоны);
	Форма.Шаблоны.Сортировать("Представление");

	Если Форма.Шаблоны.Количество() > 0 Тогда
		Форма.ВыбранныйШаблон = Форма.Шаблоны[0].Ссылка;
	КонецЕсли;
	
	УстановитьВидимостьГруппыШаблоновНет(Форма);
	
КонецПроцедуры

Функция ПодходящиеШаблоны(Предмет, Владелец)
	Возврат ШаблоныСообщенийСлужебный.ПодготовитьЗапросДляПолученияСпискаШаблонов(
		"Письмо", Предмет, Владелец).Выполнить().Выгрузить();
КонецФункции

Процедура ОбновитьСписокШаблонов(Форма, ЗаписанныйШаблон)
	
	ПодходящиеШаблоны = ПодходящиеШаблоны(Форма.ПредметШаблона, Форма.ВладелецШаблона);

	ОтборСтрок = Новый Структура("Ссылка", ЗаписанныйШаблон);
	НайденныеСтроки = ПодходящиеШаблоны.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеШаблона = НайденныеСтроки[0];
	
	НайденныеСтроки = Форма.Шаблоны.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		ЗаполнитьСписокДоступныхШаблонов(Форма, ПодходящиеШаблоны);
		НайденныеСтроки = Форма.Шаблоны.НайтиСтроки(ОтборСтрок);
		Форма.Элементы.Шаблоны.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	Иначе
		ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], ДанныеШаблона);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьHTMLВФорматированныйДокумент(Форма, ТекстШаблонаПисьмаHTML, СсылкаНаТекущийОбъект);
	
	ПараметрШаблона = Новый Структура("Шаблон, УникальныйИдентификатор");
	ПараметрШаблона.Шаблон = СсылкаНаТекущийОбъект;
	ПараметрШаблона.УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	Сообщение = ШаблоныСообщенийСлужебный.КонструкторСообщения();
	Сообщение.Текст = ТекстШаблонаПисьмаHTML;
	ШаблоныСообщенийСлужебный.ОбработатьHTMLДляФорматированногоДокумента(ПараметрШаблона, Сообщение, Истина);
	СтруктураВложений = Новый Структура();
	Для Каждого ВложениеВHTML Из Сообщение.Вложения Цикл
		Изображение = Новый Картинка(ПолучитьИзВременногоХранилища(ВложениеВHTML.АдресВоВременномХранилище));
		СтруктураВложений.Вставить(ВложениеВHTML.Представление, Изображение);
	КонецЦикла;
	Форма.ПредпросмотрФорматированныйДокумент.УстановитьHTML(Сообщение.Текст, СтруктураВложений);
	
КонецПроцедуры

Процедура ЗагрузитьПользовательскиеНастройки(Форма)
	ШаблонИзНастроек = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("РассылкаПоШаблонам", "Шаблон"); 
	УстановитьВыбранныйШаблон(Форма, ШаблонИзНастроек);
КонецПроцедуры

Процедура СохранитьПользовательскиеНастройки(Форма)
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить("РассылкаПоШаблонам", "Шаблон", Форма.ВыбранныйШаблон);
КонецПроцедуры

Процедура УстановитьВыбранныйШаблон(Форма, Шаблон)
	
	Если Шаблон = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Форма.Шаблоны.НайтиСтроки(Новый Структура("Ссылка", Шаблон));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.Шаблоны.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	Форма.ВыбранныйШаблон = Шаблон;

КонецПроцедуры

Процедура УстановитьВидимостьГруппыШаблоновНет(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблоныГруппа.Видимость = Форма.Шаблоны.Количество() > 0;
	Элементы.СтраницыПредпросмотра.Видимость = Форма.Шаблоны.Количество() > 0;
	Элементы.ШаблоновНетГруппа.Видимость = Форма.Шаблоны.Количество() = 0;
	
	Если Форма.Шаблоны.Количество() = 0 Тогда
		Форма.Элементы.ГруппаНижняяПанель.Показать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти