#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПодборКандидатов");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроцессыНаграждения");
	НастройкиВарианта.Описание = НСтр("ru = 'Подбор кандидатов к награждению 
		|по различным критериям отбора.'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СтатусыНаграждения");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроцессыНаграждения");
	НастройкиВарианта.Описание = НСтр("ru = 'История статусов награждения
		|по физическим лицам и наградам.'");

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

Процедура ЗаполнитьМенеджерВременныхТаблицПриКомпоновке(МенеджерВременныхТаблиц, КомпоновщикНастроек, МинимальныеСтажиРаботы = Неопределено, ИсключаемыеНаграды = Неопределено) Экспорт
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;
	
	ПараметрПериод = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	ПараметрОрганизация = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация")); 
	ПараметрИнтервалыНаграждения = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИнтервалыНаграждения"));
	ПараметрМинимальныеСтажиРаботы = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МинимальныеСтажиРаботы"));
	
	ПараметрИсключаемыеНаграды = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключаемыеНаграды"));
	Если Не ПараметрИсключаемыеНаграды = Неопределено И ПараметрИсключаемыеНаграды.Использование Тогда
		ИсключаемыеНаграды = ПараметрИсключаемыеНаграды.Значение;
		Если Не СокрЛП(ПараметрИсключаемыеНаграды.ИдентификаторПользовательскойНастройки) = "" Тогда
			ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключаемыеНаграды.ИдентификаторПользовательскойНастройки);
			ИсключаемыеНаграды = ПользовательскаяНастройка.Значение;
		КонецЕсли;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ИнтервалыНаграждения = Новый ТаблицаЗначений;
	КолонкиТаблицыИнтервалыНаграждения = Метаданные.Справочники.Награды.ТабличныеЧасти.ИнтервалыНаграждения.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
		ИнтервалыНаграждения.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним);
	КонецЦикла;
	
	Если Не ПараметрИнтервалыНаграждения = Неопределено И Не СокрЛП(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			ИнтервалыНаграждения = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ИнтервалыНаграждения, "ВТИнтервалыНаграждения", Истина);
	
	МинимальныеСтажиРаботы = Новый ТаблицаЗначений;
	КолонкиТаблицыМинимальныеСтажиРаботы = Метаданные.Справочники.Награды.ТабличныеЧасти.МинимальныеСтажиРаботы.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
		МинимальныеСтажиРаботы.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип, Реквизит.Синоним);
	КонецЦикла;
	
	Если Не ПараметрМинимальныеСтажиРаботы = Неопределено И Не СокрЛП(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			МинимальныеСтажиРаботы = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение);
		КонецЕсли;
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, МинимальныеСтажиРаботы, "ВТМинимальныеСтажиРаботы", Истина);
	
	ПараметрыКадровыхДанных = Новый Структура("Организация,НачалоПериода,ОкончаниеПериода");
	Если ПараметрПериод <> Неопределено Тогда
		Если ТипЗнч(ПараметрПериод.Значение) = Тип("Дата") Тогда
			ПараметрыКадровыхДанных.ОкончаниеПериода = КонецДня(ПараметрПериод.Значение);
		ИначеЕсли ТипЗнч(ПараметрПериод.Значение) = Тип("СтандартнаяДатаНачала") Тогда
			ПараметрыКадровыхДанных.ОкончаниеПериода = КонецДня(ПараметрПериод.Значение.Дата);
		КонецЕсли;
		ПараметрыКадровыхДанных.НачалоПериода = ПараметрыКадровыхДанных.ОкончаниеПериода;
	КонецЕсли;
	Если ПараметрОрганизация <> Неопределено И ПараметрОрганизация.Использование Тогда
		ПараметрыКадровыхДанных.Организация = ПараметрОрганизация.Значение;
	КонецЕсли;
	
	СоздатьВТСотрудникиОрганизации(ПараметрыКадровыхДанных, МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ФормаОтчетаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИнтервалыНаграждения",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru='Интервалы между награждениями'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИсключатьРанееНагражденных",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать ранее награжденных лиц, если не подошел срок повторного награждения'")));
							
	КолонкиТаблицыИнтервалыНаграждения = Метаданные.Справочники.Награды.ТабличныеЧасти.ИнтервалыНаграждения.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "ИнтервалыНаграждения", Реквизит.Синоним));
	КонецЦикла;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ИсключатьПоСтажу",
							Новый ОписаниеТипов("Булево"),,
							НСтр("ru='Исключать лиц, не удовлетворящих ни одному отбору по стажу работы'")));
							
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("МинимальныеСтажиРаботы",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru='Отбор по стажу работы'")));
							
	КолонкиТаблицыМинимальныеСтажиРаботы = Метаданные.Справочники.Награды.ТабличныеЧасти.МинимальныеСтажиРаботы.Реквизиты;
	Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Реквизит.Имя, Реквизит.Тип, "МинимальныеСтажиРаботы", Реквизит.Синоним));
	КонецЦикла;
	
	НовыйРеквизит = Новый РеквизитФормы("ХранилищеРезультатаОтчета", Новый ОписаниеТипов("Строка")); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	ЭлементГруппаСвоиПараметры = Форма.Элементы.Вставить("ГруппаСвоиПараметры", Тип("ГруппаФормы"),,Форма.Элементы.КомандыИПоказатели);
	ЭлементГруппаСвоиПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметры.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметры.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметры.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ЭлементГруппаСвоиПараметрыЛевая = Форма.Элементы.Добавить("ГруппаСвоиПараметрыЛевая", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметры);
	ЭлементГруппаСвоиПараметрыЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметрыЛевая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметрыЛевая.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметрыЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ЭлементГруппаСвоиПараметрыЛевая.Ширина = 80;
	
	ЭлементГруппаСвоиПараметрыПравая = Форма.Элементы.Добавить("ГруппаСвоиПараметрыПравая", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметры);
	ЭлементГруппаСвоиПараметрыПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппаСвоиПараметрыПравая.ОтображатьЗаголовок = Ложь;
	ЭлементГруппаСвоиПараметрыПравая.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппаСвоиПараметрыПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

	ЭлементФлажок = Форма.Элементы.Добавить("ИсключатьРанееНагражденных", Тип("ПолеФормы"),ЭлементГруппаСвоиПараметрыЛевая);
	ЭлементФлажок.ПутьКДанным = "ИсключатьРанееНагражденных";
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФлажок.УстановитьДействие("ПриИзменении","Подключаемый_Команда");

	ЭлементГруппа = Форма.Элементы.Добавить("ГруппаИнтервалыНаграждения", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметрыЛевая);
	ЭлементГруппа.Заголовок = НСтр("ru='Интервалы между награждениями'");
	ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ЭлементГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ЭлементГруппа.РастягиватьПоГоризонтали = Ложь;
	ЭлементГруппа.РастягиватьПоВертикали = Ложь;
	ЭлементГруппа.Скрыть();

	ЭлементТаблица = Форма.Элементы.Добавить("ИнтервалыНаграждения", Тип("ТаблицаФормы"), ЭлементГруппа);
	ЭлементТаблица.ПутьКДанным = "ИнтервалыНаграждения";
	ЭлементТаблица.РастягиватьПоВертикали = Ложь;
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементТаблица.Высота = 4;
	ЭлементТаблица.Ширина = 80;
	ЭлементТаблица.УстановитьДействие("ПриОкончанииРедактирования","Подключаемый_Команда");
	ЭлементТаблица.УстановитьДействие("ПослеУдаления","Подключаемый_Команда");

	Для Каждого Реквизит Из КолонкиТаблицыИнтервалыНаграждения Цикл
		ПолеПолеТаблицы = Форма.Элементы.Добавить(СтрШаблон("ИнтервалыНаграждения%1", Реквизит.Имя), Тип("ПолеФормы"), ЭлементТаблица);
		ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("ИнтервалыНаграждения.%1", Реквизит.Имя);
		ПолеПолеТаблицы.Заголовок = Реквизит.Синоним;
		ПолеПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПолеТаблицы.АвтоОтметкаНезаполненного = Истина;
	КонецЦикла;
	
	ЭлементФлажок = Форма.Элементы.Добавить("ИсключатьПоСтажу", Тип("ПолеФормы"),ЭлементГруппаСвоиПараметрыПравая);
	ЭлементФлажок.ПутьКДанным = "ИсключатьПоСтажу";
	ЭлементФлажок.Вид = ВидПоляФормы.ПолеФлажка;
	ЭлементФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	ЭлементФлажок.УстановитьДействие("ПриИзменении","Подключаемый_Команда");

	ЭлементГруппа = Форма.Элементы.Добавить("ГруппаМинимальныеСтажиРаботы", Тип("ГруппаФормы"),ЭлементГруппаСвоиПараметрыПравая);
	ЭлементГруппа.Заголовок = НСтр("ru='Минимальные стажи работы'");
	ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ЭлементГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	ЭлементГруппа.РастягиватьПоГоризонтали = Ложь;
	ЭлементГруппа.РастягиватьПоВертикали = Ложь;
	ЭлементГруппа.Скрыть();

	ЭлементТаблица = Форма.Элементы.Добавить("МинимальныеСтажиРаботы", Тип("ТаблицаФормы"), ЭлементГруппа);
	ЭлементТаблица.ПутьКДанным = "МинимальныеСтажиРаботы";
	ЭлементТаблица.РастягиватьПоГоризонтали = Ложь;
	ЭлементТаблица.РастягиватьПоВертикали = Ложь;
	ЭлементТаблица.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементТаблица.Высота = 4;
	ЭлементТаблица.Ширина = 80;
	ЭлементТаблица.УстановитьДействие("ПриОкончанииРедактирования","Подключаемый_Команда");
	ЭлементТаблица.УстановитьДействие("ПослеУдаления","Подключаемый_Команда");

	Для Каждого Реквизит Из КолонкиТаблицыМинимальныеСтажиРаботы Цикл
		ПолеПолеТаблицы = Форма.Элементы.Добавить(СтрШаблон("МинимальныеСтажиРаботы%1", Реквизит.Имя), Тип("ПолеФормы"), ЭлементТаблица);
		ПолеПолеТаблицы.ПутьКДанным = СтрШаблон("МинимальныеСтажиРаботы.%1", Реквизит.Имя);
		ПолеПолеТаблицы.Заголовок = Реквизит.Синоним;
		ПолеПолеТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПолеТаблицы.АвтоОтметкаНезаполненного = Истина;
	КонецЦикла;

	ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(Форма);
	
	// Добавление команд на командную панель.
	Если ПравоДоступа("Добавление", Метаданные.Документы.ПредставлениеКНаграде) Тогда
		Команда = Форма.Команды.Добавить("ПредставитьКНаграде");
		Команда.Действие  = "Подключаемый_Команда";
		Команда.Заголовок = НСтр("ru = 'Представить к награде'");
		Команда.Подсказка = НСтр("ru = 'Представить к награде выбранные лица'");
		Команда.Картинка  = БиблиотекаКартинок.Документ;
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Если Форма.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма" Тогда
			ОтчетыСервер.ВывестиКоманду(Форма, Команда, "Настройки");
		Иначе
			Элемент = Форма.Элементы.Вставить("ПредставитьКНаграде", Тип("КнопкаФормы"), Форма.Элементы.ОсновнаяКоманднаяПанель);
			Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Элемент.ИмяКоманды = "ПредставитьКНаграде"; 
		КонецЕсли;
	КонецЕсли;
	Если ПравоДоступа("Добавление", Метаданные.Документы.Награждение) Тогда
		Команда = Форма.Команды.Добавить("Наградить");
		Команда.Действие  = "Подключаемый_Команда";
		Команда.Заголовок = НСтр("ru = 'Наградить'");
		Команда.Подсказка = НСтр("ru = 'Наградить выбранные лица'");
		Команда.Картинка  = БиблиотекаКартинок.Задача;
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		Если Форма.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма" Тогда
			ОтчетыСервер.ВывестиКоманду(Форма, Команда, "Настройки");
		Иначе
			Элемент = Форма.Элементы.Вставить("Наградить", Тип("КнопкаФормы"), Форма.Элементы.ОсновнаяКоманднаяПанель);
			Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			Элемент.ИмяКоманды = "Наградить"; 
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементовФормы(Форма);
	
КонецПроцедуры

Процедура ОбновитьВидимостьДоступностьЭлементовФормы(Форма) Экспорт
	
	Команда = Форма.Элементы.Найти("Наградить");
	Если Команда <> Неопределено Тогда
		Команда.Видимость = (Форма.КлючТекущегоВарианта = "ПодборКандидатов");
	КонецЕсли;
	
	Команда = Форма.Элементы.Найти("ПредставитьКНаграде");
	Если Команда <> Неопределено Тогда
		Команда.Видимость = (Форма.КлючТекущегоВарианта = "ПодборКандидатов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередФормированиемОтчета(Форма, ДополнительныеПараметры) Экспорт
	
	Если Не Форма.КлючТекущегоВарианта = "ПодборКандидатов" Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыНагражденияКлиентСервер.ЗаполнитьПараметрыОтчетаНаградыФизическихЛиц(Форма);
	
	Если Форма.КлючТекущегоВарианта = "ПодборКандидатов" Тогда
		Форма.ХранилищеРезультатаОтчета = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Если Не Форма.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма" 
		И Не Форма.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма.ФормаДляРабочегоСтола" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.КлючТекущегоВарианта = "ПодборКандидатов" Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтчета = Форма.Отчет.КомпоновщикНастроек.Настройки;
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;
	ПараметрИнтервалыНаграждения = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИнтервалыНаграждения"));
	ПараметрИсключатьРанееНагражденных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьРанееНагражденных"));
	ПараметрИсключатьПоСтажу = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсключатьПоСтажу"));
	ПараметрМинимальныеСтажиРаботы = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МинимальныеСтажиРаботы"));

	Если Не ПараметрИнтервалыНаграждения = Неопределено И Не СокрЛП(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИнтервалыНаграждения.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			Форма.ИнтервалыНаграждения.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрМинимальныеСтажиРаботы = Неопределено И Не СокрЛП(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрМинимальныеСтажиРаботы.ИдентификаторПользовательскойНастройки);
		Если Не СокрЛП(ПользовательскаяНастройка.Значение) = "" Тогда
			Форма.МинимальныеСтажиРаботы.Загрузить(ОбщегоНазначения.ЗначениеИзСтрокиXML(ПользовательскаяНастройка.Значение));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПараметрИсключатьРанееНагражденных = Неопределено И Не СокрЛП(ПараметрИсключатьРанееНагражденных.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключатьРанееНагражденных.ИдентификаторПользовательскойНастройки);
		Форма.ИсключатьРанееНагражденных = ПользовательскаяНастройка.Значение;
	КонецЕсли;
	
	Если Не ПараметрИсключатьПоСтажу = Неопределено И Не СокрЛП(ПараметрИсключатьПоСтажу.ИдентификаторПользовательскойНастройки) = "" Тогда
		ПользовательскаяНастройка = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрИсключатьПоСтажу.ИдентификаторПользовательскойНастройки);
		Форма.ИсключатьПоСтажу = ПользовательскаяНастройка.Значение;
	КонецЕсли;
	
	ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДанных

Процедура СоздатьВТСотрудникиОрганизации(ПараметрыКадровыхДанных, МенеджерВременныхТаблиц)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыКадровыхДанных);
	ПараметрыПолучения.КадровыеДанные = "Организация,ВидЗанятости,Должность,Подразделение,Возраст,ДатаРождения,ОбщийСтажЛет,СеверныйСтажЛет,НепрерывныйСтажЛет,СтажНаНадбавкуЗаВыслугуЛетЛет,ОбщийНаучноПедагогическийСтажЛет,ПедагогическийСтажЛет,СтраховойСтажЛет,РасширенныйСтраховойСтажЛет,ПрочийСтажЛет,МедицинскийСтажЛет";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		
		ИспользоватьГосударственнуюМуниципальнуюСлужбу = ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьМуниципальнуюСлужбу");
		Если ИспользоватьГосударственнуюМуниципальнуюСлужбу Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВидДолжностиГосударственнойСлужбы,ВыслугаЛетНаГосударственнойСлужбеЛет";
		КонецЕсли;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВоеннуюСлужбу") Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВыслугаЛетНаВоеннойСлужбеЛет";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьВоеннуюСлужбу") Тогда
			ПараметрыПолучения.КадровыеДанные = ПараметрыПолучения.КадровыеДанные + ",ВоинскоеСпециальноеЗвание";
		КонецЕсли;
		
	КонецЕсли;
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Если СотрудникиОрганизации.Колонки.Найти("ВидДолжностиГосударственнойСлужбы") = Неопределено Тогда
		СотрудникиОрганизации.Колонки.Добавить("ВидДолжностиГосударственнойСлужбы", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	КонецЕсли;
	Если СотрудникиОрганизации.Колонки.Найти("ВоинскоеСпециальноеЗвание") = Неопределено Тогда
		СотрудникиОрганизации.Колонки.Добавить("ВоинскоеСпециальноеЗвание", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, СотрудникиОрганизации, "ВТСотрудникиОрганизации");

	ОписательВременныхТаблиц = КадровыйУчетРасширенный.ОписательВременнойТаблицыОтборовДляВТСтажиФизическихЛиц("ВТСотрудникиОрганизации", "ФизическоеЛицо", "Период");
	КадровыйУчетРасширенный.СоздатьВТСтажиФизическихЛиц(МенеджерВременныхТаблиц, Истина, ОписательВременныхТаблиц, "ВТСтажиФизическихЛиц");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
