#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийКлючВарианта;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ТекущийКлючВарианта) Тогда
		КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ТекущийКлючВарианта", ТекущийКлючВарианта);
	КонецЕсли;
	
	Если ТекущийКлючВарианта = "ПодборКандидатов" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДокументРезультат.Очистить();
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		МенеджерВременныхТаблиц = Неопределено;
		МинимальныеСтажиРаботы = Неопределено;
		ИсключаемыеНаграды = Неопределено;
		
		Отчеты.ОтчетыПоПроцессамНаграждения.ЗаполнитьМенеджерВременныхТаблицПриКомпоновке(МенеджерВременныхТаблиц, КомпоновщикНастроек, МинимальныеСтажиРаботы, ИсключаемыеНаграды);
		
		УстановитьПривилегированныйРежим(Истина);

		КатегорииСтажа = МинимальныеСтажиРаботы.Скопировать();
		КатегорииСтажа.Свернуть("КатегорияСтажа");
		КатегорииСтажа = КатегорииСтажа.ВыгрузитьКолонку("КатегорияСтажа");
		ГруппировкаФизическиеЛица = ПолучитьГруппировкуПоИмени(НастройкиОтчета, "ФизическиеЛица");
		
		Для Каждого КатегорияСтажа Из КатегорииСтажа Цикл
			
			ИмяЗначенияПеречисления = ОбщегоНазначения.ИмяЗначенияПеречисления(КатегорияСтажа);
			
			ИспользоватьГосударственнуюМуниципальнуюСлужбу = Ложь;
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
				ИспользоватьГосударственнуюМуниципальнуюСлужбу = ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьМуниципальнуюСлужбу");
			КонецЕсли;
			
			Если Не ИспользоватьГосударственнуюМуниципальнуюСлужбу
				И Не СтрРазделить("ВыслугаЛетНаГосударственнойСлужбе,ВыслугаЛетНаВоеннойСлужбе",",").Найти(ИмяЗначенияПеречисления) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ВыбранноеПоле Из ГруппировкаФизическиеЛица.Выбор.Элементы Цикл
				Если ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("%1Стаж", ИмяЗначенияПеречисления)) Тогда
					ВыбранноеПоле.Использование = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		
		ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки,,,МенеджерВременныхТаблиц);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		СкрытыеПараметрыОтчета = Новый Массив;
		СкрытыеПараметрыОтчета.Добавить("ИнтервалыНаграждения");
		СкрытыеПараметрыОтчета.Добавить("МинимальныеСтажиРаботы");
		Если Не ЗначениеЗаполнено(ИсключаемыеНаграды) Тогда
			СкрытыеПараметрыОтчета.Добавить("ИсключаемыеНаграды");
		КонецЕсли;
		ЗарплатаКадрыОтчеты.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, СкрытыеПараметрыОтчета);
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередФормированиемОтчета = Истина;
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	
КонецПроцедуры

// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка, Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ТекущийКлючВарианта = КлючВарианта;
	КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ТекущийКлючВарианта", ТекущийКлючВарианта);

	Если КлючСхемы <> КлючВарианта Тогда
		
		Если КлючВарианта = "СтатусыНаграждения" Тогда
			
			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ПолучитьМакет("СтатусыНаграждения"), КлючСхемы);
			НовыеНастройкиКД = СхемаКомпоновкиДанных.ВариантыНастроек.СтатусыНаграждения.Настройки;
			
		Иначе
			
			ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"), КлючСхемы);
			НовыеНастройкиКД = СхемаКомпоновкиДанных.ВариантыНастроек[КлючВарианта].Настройки;
			
		КонецЕсли;
		
		КлючСхемы = КлючВарианта;
		
	КонецЕсли;
	
	Если Не ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыеНастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		НовыеНастройкиКД = КомпоновщикНастроек.Настройки;
	КонецЕсли;
	
	Если ТипЗнч(НовыеПользовательскиеНастройкиКД) <> Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		НовыеПользовательскиеНастройкиКД = КомпоновщикНастроек.ПользовательскиеНастройки;
	КонецЕсли;
	
	ГруппаСвоиПараметры = Контекст.Элементы.Найти("ГруппаСвоиПараметры");
	Если Не ГруппаСвоиПараметры = Неопределено Тогда
		ГруппаСвоиПараметры.Видимость = КлючВарианта = "ПодборКандидатов";
	КонецЕсли;
	
	Если Контекст.Параметры.Свойство("Награда") И ТекущийКлючВарианта = "ПодборКандидатов" И Не Контекст.Параметры.Награда.ЭтоГруппа Тогда
		
		Награда = Контекст.Параметры.Награда;
		
		УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ПериодОтчета", ТекущаяДатаСеанса());
		
		Если Награда.ОтсутствиеДисциплинарныхВзысканий Тогда
			УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "Дисциплинарные взыскания отсутствуют", Награда.ОтсутствиеДисциплинарныхВзысканий);
		КонецЕсли;
		
		УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключатьРанееНагражденных", Не Награда.ИнтервалыНаграждения.Количество() = 0);
		УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИнтервалыНаграждения", ПроцессыНагражденияВызовСервера.СериализоватьКоллекцию(Награда.ИнтервалыНаграждения));

		УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключатьПоСтажу", Не Награда.МинимальныеСтажиРаботы.Количество() = 0);
		УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МинимальныеСтажиРаботы", ПроцессыНагражденияВызовСервера.СериализоватьКоллекцию(Награда.МинимальныеСтажиРаботы));
		
		Если Награда.ПовторноеНаграждениеНеПредусмотрено Тогда
			ИсключаемыеНаграды = Новый СписокЗначений;
			ИсключаемыеНаграды.Добавить(Награда);
			УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ИсключаемыеНаграды", ИсключаемыеНаграды);
		КонецЕсли;
		Если Не Награда.МинимальныйВозраст = 0 Тогда
			УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МинимальныйВозраст", Награда.МинимальныйВозраст);
		КонецЕсли;
		Если Не Награда.МаксимальныйВозраст = 0 Тогда
			УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "МаксимальныйВозраст", Награда.МаксимальныйВозраст);
		КонецЕсли;
		Если Не Награда.ОграничениеДолжностей.Количество() = 0 Тогда
			ОграничениеДолжностей = Новый СписокЗначений;
			ОграничениеДолжностей.ЗагрузитьЗначения(Награда.ОграничениеДолжностей.ВыгрузитьКолонку("ОграничениеДолжности"));
			УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "ОграничениеДолжностей", ОграничениеДолжностей);
		КонецЕсли;
		
		Если Награда.НаличиеНаград.Количество() > 0 ИЛИ Награда.СоблюдатьПоследовательностьНаграждения Тогда
			НаличиеНаград = Новый СписокЗначений;
			НаличиеНаград.ЗагрузитьЗначения(Награда.НаличиеНаград.ВыгрузитьКолонку("Награда"));
			ДобавитьНаградыПредыдущихСтепеней(Награда, НаличиеНаград);
			Если НаличиеНаград.Количество() > 0 Тогда
				УстановитьПользовательскуюНастройку(КомпоновщикНастроек, НовыеПользовательскиеНастройкиКД, "НаличиеНаград", НаличиеНаград);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//   ПараметрыЗаполнения - Структура
//
Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения);
	
КонецПроцедуры

// Параметры:
//   ФормаОтчета - ФормаКлиентскогоПриложения
//   ДополнительныеПараметры - Структура:
//     * ТекстПредупреждения - Строка
//     * ИмяПараметраХраненияОтказаОтПредупреждения - Строка
//
Процедура ПередФормированиемОтчета(Форма, ДополнительныеПараметры) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ПередФормированиемОтчета(Форма, ДополнительныеПараметры);
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ФормаОтчетаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеНастройкиКД) Экспорт
	
	Отчеты.ОтчетыПоПроцессамНаграждения.ОбновитьВидимостьДоступностьЭлементовФормы(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьГруппировкуПоИмени(Настройки, ИмяСтруктуры)
	
	Структура = Настройки.Структура;
	Если Структура.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пока Истина Цикл
		ЭлементСтруктуры = Структура[0];
		Если ЭлементСтруктуры.Имя = ИмяСтруктуры Тогда
			Возврат ЭлементСтруктуры;
		КонецЕсли;
		Структура = ЭлементСтруктуры.Структура;
		
		Если Структура.Количество() = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура УстановитьПользовательскуюНастройку(КомпоновщикНастроекОтчета, НовыеПользовательскиеНастройкиКД, ИмяНастройки, Знач Значение)
	
	НастройкиОтчета = КомпоновщикНастроекОтчета.ПолучитьНастройки();
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;

	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяНастройки));
	Если ПараметрДанных = Неопределено Тогда
		Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ЭлементОтбора.Представление = ИмяНастройки Тогда
				ПользовательскаяНастройка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				ПользовательскаяНастройка.Использование = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Не СокрЛП(ПараметрДанных.ИдентификаторПользовательскойНастройки) = "" Тогда
			ПользовательскаяНастройка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Значение;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьНаградыПредыдущихСтепеней(Награда, СписокНаград)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Награда);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Награды.Родитель КАК Родитель,
	|	Награды.Ссылка КАК Награда,
	|	МАКСИМУМ(НаградыПредшествующие.КодОКИН) КАК КодОКИНПредшествующейНаграды
	|ПОМЕСТИТЬ ВТКодыОКИНПредшествующихНаград
	|ИЗ
	|	Справочник.Награды КАК Награды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК НаградыПредшествующие
	|		ПО Награды.Родитель = НаградыПредшествующие.Родитель
	|			И Награды.КодОКИН > НаградыПредшествующие.КодОКИН
	|			И (НЕ НаградыПредшествующие.ПометкаУдаления)
	|ГДЕ
	|	Награды.Ссылка = &Ссылка
	|	И Награды.СоблюдатьПоследовательностьНаграждения
	|
	|СГРУППИРОВАТЬ ПО
	|	Награды.Ссылка,
	|	Награды.Родитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыОКИНПредшествующихНаград.Награда КАК Награда,
	|	Награды.Ссылка КАК НаличиеНаграды
	|ИЗ
	|	ВТКодыОКИНПредшествующихНаград КАК КодыОКИНПредшествующихНаград
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК Награды
	|		ПО КодыОКИНПредшествующихНаград.Родитель = Награды.Родитель
	|			И КодыОКИНПредшествующихНаград.КодОКИНПредшествующейНаграды = Награды.КодОКИН";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокНаград.Добавить(Выборка.НаличиеНаграды);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли