
#Область ПрограммныйИнтерфейс

// Вызывается при определении сервисов, которые поддерживают миграцию.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Сервисы - СписокЗначений - в качестве значения адрес сервиса, в качестве представления - представление сервиса.
//
Процедура ПриОпределенииСервисов(Сервисы) Экспорт
КонецПроцедуры

// Обработчик при выгрузке данных.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект, ПланСчетовОбъект -
//			- ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей -
//          - РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей -
//			- ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей, БизнесПроцессОбъект, ЗадачаОбъект - выгружаемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет выгружен.
//
Процедура ПриВыгрузкеОбъекта(Объект, Отказ) Экспорт
КонецПроцедуры

// Обработчик при загрузке данных.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект, ПланСчетовОбъект -
//			- ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей -
//          - РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей -
//			- ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей, БизнесПроцессОбъект, ЗадачаОбъект - загружаемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет загружен.
//
Процедура ПриЗагрузкеОбъекта(Объект, Отказ) Экспорт
КонецПроцедуры

#КонецОбласти
	
