//@strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	ВидеоконференцииСлужебный.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПрофилиБезопасности

// См. ОбщегоНазначенияПереопределяемый.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Справочник.УчетныеЗаписиВидеоконференций";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПодключения";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
											|		ИмяПроцедуры, УчетнаяЗапись, Сервис, КодАвторизации)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Справочник.УчетныеЗаписиВидеоконференций";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПроверкиПодключения";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Справочник.УчетныеЗаписиВидеоконференций";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПроверкиПодключения";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры)";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуютсяВидеоконференции() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьВидеоконференции");
	
КонецФункции

Функция ДоступныВнешниеПользователиСистемыВзаимодействия() Экспорт
	
	Возврат ВидеоконференцииСлужебный.ДоступныВнешниеПользователиСистемыВзаимодействия();
	
КонецФункции

// Возвращаемое значение:
//  Массив из СправочникСсылка.УчетныеЗаписиВидеоконференций
Функция НастроенныеУчетныеЗаписи() Экспорт
	
	НастроенныеУчетныеЗаписи = Новый Массив;
	
	АктивныеУчетныеЗаписи = Справочники.УчетныеЗаписиВидеоконференций.АктивныеУчетныеЗаписи();
	
	ДанныеОДоступностиСервисов = ДанныеОДоступностиСервисов(АктивныеУчетныеЗаписи);
	
	Для Каждого КлючИЗначение Из ДанныеОДоступностиСервисов Цикл
		ДанныеОДоступностиСервиса = КлючИЗначение.Значение; // См. ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса
		
		Если ДанныеОДоступностиСервиса.Подключено Тогда
			НастроенныеУчетныеЗаписи.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НастроенныеУчетныеЗаписи;
	
КонецФункции

// Параметры:
//  ТолькоНастраиваемые - Булево
// 
// Возвращаемое значение:
//  ФиксированныйМассив Из Строка
Функция ИспользуемыеСервисы(ТолькоНастраиваемые = Ложь) Экспорт
	
	Возврат ВидеоконференцииПовтИсп.ИспользуемыеСервисы(ТолькоНастраиваемые);
	
КонецФункции

// Возвращаемое значение:
//  ФиксированноеСоответствие Из КлючИЗначение:
// * Ключ - Строка
// * Значение - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеСервиса
Функция ДанныеСервисов() Экспорт
	
	Возврат ВидеоконференцииПовтИсп.ДанныеСервисов();
	
КонецФункции

// Параметры:
//  СервисИлиУчетнаяЗапись - Строка, СправочникСсылка.УчетныеЗаписиВидеоконференций -
// 
// Возвращаемое значение:
//  Структура - См. ВидеоконференцииСлужебный.НовыеДанныеСервиса
Функция ДанныеСервиса(Знач СервисИлиУчетнаяЗапись) Экспорт
	
	Если ТипЗнч(СервисИлиУчетнаяЗапись) = Тип("Строка") Тогда
		Сервис = СервисИлиУчетнаяЗапись;
	Иначе
		Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(СервисИлиУчетнаяЗапись);
	КонецЕсли;
	
	ДанныеСервисов = ДанныеСервисов();
	
	Возврат ДанныеСервисов[Сервис]; //@skip-check constructor-function-return-section
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  КодАвторизации - Строка
// 
// Возвращаемое значение:
//  Структура: См. ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи
Функция ПодключитьУчетнуюЗапись(УчетнаяЗапись, Сервис, КодАвторизации) Экспорт
	
	Если Не ЗначениеЗаполнено(Сервис) Тогда
		Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	КонецЕсли;
	
	Возврат ВидеоконференцииВнутренний.ПодключитьУчетнуюЗапись(УчетнаяЗапись, Сервис, КодАвторизации);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
Процедура ОтключитьУчетнуюЗапись(УчетнаяЗапись) Экспорт
	
	Справочники.УчетныеЗаписиВидеоконференций.ОтключитьУчетнуюЗапись(УчетнаяЗапись);
	
КонецПроцедуры

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция СоздатьВидеоконференцию(УчетнаяЗапись, НастройкиВидеоконференции) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ВидеоконференцииВнутренний.СоздатьВидеоконференцию(УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ОбновитьВидеоконференцию(УчетнаяЗапись, НастройкиВидеоконференции) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ВидеоконференцииВнутренний.ОбновитьВидеоконференцию(УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ДанныеВидеоконференции(УчетнаяЗапись, Идентификатор) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ВидеоконференцииВнутренний.ДанныеВидеоконференции(УчетнаяЗапись, Сервис, Идентификатор);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция УдалитьВидеоконференцию(УчетнаяЗапись, Идентификатор) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ВидеоконференцииВнутренний.УдалитьВидеоконференцию(УчетнаяЗапись, Сервис, Идентификатор);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
//  ДанныеПользователя - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
// 
// Возвращаемое значение:
//  Булево
Функция ПользовательЯвляетсяУчастником(УчетнаяЗапись, Идентификатор, ДанныеПользователя) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	Возврат ВидеоконференцииВнутренний.ПользовательЯвляетсяУчастником(
				УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
//  ДанныеПользователя - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
Процедура ДобавитьПользователяВУчастники(УчетнаяЗапись, Идентификатор, ДанныеПользователя) Экспорт
	
	Сервис = ВидеоконференцииСлужебный.СервисУчетнойЗаписи(УчетнаяЗапись);
	
	ВидеоконференцииВнутренний.ДобавитьПользователяВУчастники(УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  УчетныеЗаписи - Массив Из СправочникСсылка.УчетныеЗаписиВидеоконференций -
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие Из КлючИЗначение:
// * Ключ - СправочникСсылка.УчетныеЗаписиВидеоконференций
// * Значение - См. ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса
Функция ДанныеОДоступностиСервисов(УчетныеЗаписи)
	
	ДанныеОДоступностиСервисов = Новый Соответствие();
	
	ВидеоконференцииВнутренний.ЗаполнитьДанныеОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи);
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(ДанныеОДоступностиСервисов);
	
КонецФункции

#КонецОбласти

