// @strict-types


////////////////////////////////////////////////////////////////////////////////
// 
// Серверные процедуры, обслуживающие правила регистрации объектов
// подсистемы БСП "Учет оригиналов первичных документов".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	Если ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияОригиналовПервичныхДокументов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.СостоянияОригиналовПервичныхДокументов.Измерения.Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти