// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ОбновлениеАналитикиДанных.Имя);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОбновлениеАналитикиДанных.ИмяМетода);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьИсточникиАналитикиДанныхДлительнаяОперация", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДатаНачалаАналитики() Экспорт
	Возврат Дата(2010,01,01);
КонецФункции

// Добавляет роль для профиля, которому доступна работа с аналитикой данных.
// 
// Параметры:
// 	ОписаниеПрофиля - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
Процедура ДобавитьРольБазовыеПраваАналитикаДанных(ОписаниеПрофиля) Экспорт
	ОписаниеПрофиля.Роли.Добавить(Метаданные.Роли.БазовыеПраваАналитикаДанных.Имя);
КонецПроцедуры

// Формирует временную таблицу ВТСотрудники, содержащую поля Сотрудник и ФизическоеЛицо
//
// Параметры:
//	Запрос - Запрос
//
Процедура СоздатьВТСотрудники(Запрос) Экспорт
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыЗапроса.НачалоПериода = ДатаНачалаАналитики();
	ПараметрыЗапроса.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыЗапроса.РаботникиПоДоговорамГПХ = Истина;
	ПараметрыЗапроса.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗапроса);
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации";
	Запрос.УстановитьПараметр("ДатаНачала", ПараметрыЗапроса.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыЗапроса.ОкончаниеПериода);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЕстьНеактуальныеЗаписиАналитикиДанных() Экспорт
	
	НаборРегистров = НаборРегистровОбновленияАналитикиДанных();
	
	Если НаборРегистров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ПервыйПроход = Истина;
	Для Каждого ИмяРегистра Из НаборРегистров Цикл
		ТекстЗапроса = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	#РегистрСведенийИмяТаблицы КАК ИмяТаблицы";
		Если ПервыйПроход Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИСТИНА", "ИСТИНА КАК Поле1");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#РегистрСведенийИмяТаблицы", ИмяРегистра);
		Запрос.Текст = Запрос.Текст + ?(ПервыйПроход, "", " ОБЪЕДИНИТЬ ВСЕ ") + ТекстЗапроса;
		ПервыйПроход = Ложь;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Набор регистров аналитики данных.
// 
// Возвращаемое значение:
//  Массив из Строка
Функция НаборРегистровОбновленияАналитикиДанных() Экспорт
	Возврат АналитикаДанныхВнутренний.НаборРегистровОбновленияАналитикиДанных();
КонецФункции

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	АналитикаДанныхВнутренний.ЗарегистрироватьОбработчикиОбновления(Обработчики);
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	АналитикаДанныхВнутренний.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
КонецПроцедуры

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзлаРИБ.
Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	АналитикаДанныхВнутренний.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
КонецПроцедуры

#КонецОбласти

// Удалить строки аналитики после даты отбора.
// 
// Параметры:
//  НаборЗаписей - РегистрСведенийНаборЗаписейИмяРегистраСведений
//  ДатаОтбора - Дата
//  ИмяДата - Строка - Имя измерения к которому применяется отбор
Процедура УдалитьСтрокиАналитикиПослеДатыОтбора(НаборЗаписей, ДатаОтбора, ИмяДата = "Дата") Экспорт
	
	Сч = НаборЗаписей.Количество() - 1;
	Пока Сч >= 0 Цикл
		СтрокаТаблицы = НаборЗаписей[Сч];
		Если СтрокаТаблицы[ИмяДата] >= ДатаОтбора Тогда
			НаборЗаписей.Удалить(Сч);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РегламентныеЗадания

Процедура ОбновлениеАналитикиДанных() Экспорт
	
	// Регламентные задания блокируются на время служебных операций с информационной базой.
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОбновлениеАналитикиДанных);
	
	АналитикаДанныхВнутренний.ПриОбновленииАналитикиДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеАналитикиДанных

// Длительная операция для обновления источников аналитики данных.
// 
// Параметры:
//  Параметры - Структура
//  АдресРезультата - Строка
Процедура ОбновитьИсточникиАналитикиДанныхДлительнаяОперация(Параметры, АдресРезультата) Экспорт
	
	Попытка
		АналитикаДанныхВнутренний.ПриОбновленииАналитикиДанных();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = НСтр("ru = 'Интеграция с 1С:Аналитикой'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при обновлении источников данных 1С:Аналитики. Обратитесь к администратору.
					|Техническая информация:
					|При выполнении операции «%1» возникает
					|%2'"), 
			НСтр("ru = 'Обновление источников данных 1С:Аналитики'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#КонецОбласти