
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	ЦветВиджета = РеквизитОбъект.Цвет.Получить();
	Если ЦветВиджета = Неопределено Тогда
		ЦветВиджета = ЦветаСтиля.ЦветФонаВиджета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ЦветВиджета.ПолучитьАбсолютный());
	
КонецПроцедуры

#КонецОбласти

