
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.СтраницаОткрытия) Тогда
		Элементы.СтраницыВариантыПроверки.ТекущаяСтраница = Элементы[Параметры.СтраницаОткрытия];
	КонецЕсли;
	
	ЗаполнитьВсеДокументыСНастройкамиУправленияСвойствамиЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыПроверки

&НаКлиенте
Процедура РезультатыПроверкиПриАктивизацииСтроки(Элемент)
	
	ТекстОшибкиПоСтроке = "";
	
	ТекущиеДанные = Элементы.РезультатыПроверкиШаблонов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекстОшибкиПоСтроке = ТекущиеДанные.ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РезультатыПроверкиШаблонов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И НЕ ТекущиеДанные.Шаблон.Пустая() Тогда
		ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Шаблон);
		ОткрытьФорму("Справочник.ШаблоныПроцессов.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НайтиШаблоныСОшибками(Команда)
	НайтиШаблоныСОшибкамиНаСервере();
	НайтиШаблоныСОшибкамиНастроекУправленияСвойствамиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиДокументов(Команда)
	
	Для Каждого СтрокаТаблицы Из РезультатыПроверкиШаблонов Цикл
		СтрокаТаблицы.Пометка = ?(СтрокаТаблицы.НастройкиФормуляров ИЛИ СтрокаТаблицы.НастройкаСвойствЭлементов,
		Ложь, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиДокументов(Команда)
	
	Для Каждого СтрокаТаблицы Из РезультатыПроверкиШаблонов Цикл
		СтрокаТаблицы.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиВыделенным(Команда)
	
	Для Каждого ИндексСтроки Из Элементы.РезультатыПроверкиШаблонов.ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = РезультатыПроверкиШаблонов.НайтиПоИдентификатору(ИндексСтроки);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Пометка = ?(СтрокаТаблицы.НастройкиФормуляров	ИЛИ СтрокаТаблицы.НастройкаСвойствЭлементов,
			Ложь, Истина);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьОтмеченныеШаблоны(Команда)
	
	ТекстСообщения = "";
	
	Если РезультатыПроверкиШаблонов.Количество() > 0 Тогда
		КоличествоИсправлений = ИсправитьОтмеченныеШаблоныНаСервере();
		
		Если КоличествоИсправлений = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Обработка не выполнена. Шаблоны для исправления не были отмечены.'");
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Обработка завершена. Исправлено шаблонов: %1.'"), КоличествоИсправлений);
		КонецЕсли;
	Иначе
		ТекстСообщения= НСтр("ru = 'Не заполнена таблица результатов проверки, исправление не выполнено.'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиОшибкиВСсылочныхДанных(Команда)
	НайтиОшибкиВСсылочныхДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьСсылочныеДанные(Команда)
	
	Если РезультатыПроверкиСсылочныхДанных.ПолучитьЭлементы().Количество() > 0 Тогда
		ИсправитьСсылочныеДанныеНаСервере();
	Иначе
		ТекстСообщения= НСтр("ru = 'Не заполнены ошибочные ссылочные данные, исправление не выполнено.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиШаблоныСОшибкамиНаСервере()
	
	РезультатыПроверкиШаблонов.Очистить();
	ИзмененныеИдентификаторыОбработчиков = Новый Соответствие;
	ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ПриОпределенииОбновляемыхИдентификаторовОбработчиков(ИзмененныеИдентификаторыОбработчиков);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныПроцессов.Ссылка КАК Шаблон,
		|	ШаблоныПроцессов.ПометкаУдаления КАК ПометкаУдаления,
		|	ШаблоныПроцессов.НеИспользуется КАК НеИспользуется
		|ИЗ
		|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ШаблонСсылка = ВыборкаДетальныеЗаписи.Шаблон;
		ШаблонПометкаУдаления = ВыборкаДетальныеЗаписи.ПометкаУдаления;
		ШаблонНеИспользуется = ВыборкаДетальныеЗаписи.НеИспользуется;
		ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
		
		ТекстСообщения = "";
		ОшибкаВШаблоне = Справочники.ШаблоныПроцессов.ПроверитьУдалитьНесуществующиеРеквизиты(ШаблонОбъект, "Проверка", ТекстСообщения);
		Если ОшибкаВШаблоне Тогда
			НоваяСтрока = РезультатыПроверкиШаблонов.Добавить();
			НоваяСтрока.Шаблон = ШаблонСсылка ;
			НоваяСтрока.ПометкаУдаления = ШаблонПометкаУдаления;
			НоваяСтрока.НеИспользуется = ШаблонНеИспользуется;
			НоваяСтрока.ТекстОшибки = ТекстСообщения;
			НоваяСтрока.НесуществующиеРеквизиты = Истина;
			
			НоваяСтрока.Пометка = ?(ШаблонПометкаУдаления ИЛИ ШаблонНеИспользуется, Ложь, Истина);
		КонецЕсли;
		
		ТекстСообщения = "";
		ОшибкаВШаблоне = Справочники.ШаблоныПроцессов.ПроверитьУдалитьНедоступныеПервичныеДокументы(ШаблонОбъект, "Проверка", ТекстСообщения);
		Если ОшибкаВШаблоне Тогда
			НоваяСтрока = РезультатыПроверкиШаблонов.Добавить();
			НоваяСтрока.Шаблон = ШаблонСсылка ;
			НоваяСтрока.ПометкаУдаления = ШаблонПометкаУдаления;
			НоваяСтрока.НеИспользуется = ШаблонНеИспользуется;
			НоваяСтрока.ТекстОшибки = ТекстСообщения;
			НоваяСтрока.НедоступныеПервичныеДокументы = Истина;
			
			НоваяСтрока.Пометка = ?(ШаблонПометкаУдаления ИЛИ ШаблонНеИспользуется, Ложь, Истина);
		КонецЕсли;
		
		// новые идентификаторы обработчиков
		ТекстСообщения = "";
		ОшибкаВШаблоне = Справочники.ШаблоныПроцессов.ПроверитьЗаменитьИзмененныеИдентификаторыОбработчиков(ШаблонОбъект, 
																											ИзмененныеИдентификаторыОбработчиков, 
																											"Проверка", 
																											ТекстСообщения);
		Если ОшибкаВШаблоне Тогда
			НоваяСтрока = РезультатыПроверкиШаблонов.Добавить();
			НоваяСтрока.Шаблон = ШаблонСсылка ;
			НоваяСтрока.ПометкаУдаления = ШаблонПометкаУдаления;
			НоваяСтрока.НеИспользуется = ШаблонНеИспользуется;
			НоваяСтрока.ТекстОшибки = ТекстСообщения; 
			НоваяСтрока.ИзмененныеОбработчики = Истина;

			НоваяСтрока.Пометка = ?(ШаблонПометкаУдаления ИЛИ ШаблонНеИспользуется, Ложь, Истина);
		КонецЕсли;
		
		// настройки формуляров
		ЕстьНастройкиФормуляров = ПроцессыОбработкиДокументов.ЕстьНастройкиФормированияИПодписанияФормуляровУЭтапов(ШаблонОбъект);
		ОшибкиФормуляровШаблона = ПроцессыОбработкиДокументов.ПроверитьНастройкиФормированияИПодписанияФормуляров(ШаблонОбъект,
																													ЕстьНастройкиФормуляров);
		Если ОшибкиФормуляровШаблона.Количество() > 0 Тогда
			НоваяСтрока = РезультатыПроверкиШаблонов.Добавить();
			НоваяСтрока.Шаблон = ШаблонСсылка ;
			НоваяСтрока.ПометкаУдаления = ШаблонПометкаУдаления;
			НоваяСтрока.НеИспользуется = ШаблонНеИспользуется;
			НоваяСтрока.ТекстОшибки = СтрСоединить(ОшибкиФормуляровШаблона, Символы.ПС);
			НоваяСтрока.НастройкиФормуляров = Истина;

			НоваяСтрока.Пометка = Ложь;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ИсправитьОтмеченныеШаблоныНаСервере()
	
	СтрокиДляОчистки = Новый Массив; 
	ИзмененныеИдентификаторыОбработчиков = Новый Соответствие;
	ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ПриОпределенииОбновляемыхИдентификаторовОбработчиков(ИзмененныеИдентификаторыОбработчиков);

	Для Каждого СтрокаШаблона Из РезультатыПроверкиШаблонов Цикл

		Если СтрокаШаблона.Пометка = Истина Тогда
			Если СтрокаШаблона.НесуществующиеРеквизиты Тогда
				ШаблонОбъект = СтрокаШаблона.Шаблон.ПолучитьОбъект();
				Результат = Справочники.ШаблоныПроцессов.ПроверитьУдалитьНесуществующиеРеквизиты(ШаблонОбъект, "Удаление");
				Если Результат = Истина Тогда
					Попытка
						ШаблонОбъект.Записать();
					Исключение
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Ошибка записи для шаблона процесса ""%1"" при массовом исправлении.
												|Описание: ""%2""'"), 
												ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаШаблона.Шаблон, "Наименование"),
												ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ИмяСобытия=НСтр("ru = 'Процессы обработки документов. Исправление ошибок в шаблонах процессов'");
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					КонецПопытки;
				КонецЕсли;
				
				СтрокиДляОчистки.Добавить(СтрокаШаблона);
				
			ИначеЕсли СтрокаШаблона.НедоступныеПервичныеДокументы Тогда
				ШаблонОбъект = СтрокаШаблона.Шаблон.ПолучитьОбъект();
				Результат = Справочники.ШаблоныПроцессов.ПроверитьУдалитьНедоступныеПервичныеДокументы(ШаблонОбъект, "Удаление");
				Если Результат = Истина Тогда
					Попытка
						ШаблонОбъект.Записать();
					Исключение
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Ошибка записи для шаблона процесса ""%1"" при массовом исправлении.
												|Описание: ""%2""'"), 
												ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаШаблона.Шаблон, "Наименование"),
												ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ИмяСобытия = НСтр("ru = 'Процессы обработки документов. Исправление ошибок в шаблонах процессов'");
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					КонецПопытки;
				КонецЕсли;
				
				СтрокиДляОчистки.Добавить(СтрокаШаблона);
				
			// обновление идентификаторов обработчиков
			ИначеЕсли СтрокаШаблона.ИзмененныеОбработчики Тогда	
				ШаблонОбъект = СтрокаШаблона.Шаблон.ПолучитьОбъект();
				Результат = Справочники.ШаблоныПроцессов.ПроверитьЗаменитьИзмененныеИдентификаторыОбработчиков(ШаблонОбъект, ИзмененныеИдентификаторыОбработчиков, "Замена");
				Если Результат Тогда
					Попытка
						ШаблонОбъект.Записать(); 
						СтрокиДляОчистки.Добавить(СтрокаШаблона);
					Исключение
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru = 'Ошибка записи для шаблона процесса ""%1"" при массовом исправлении идентификаторов обработчиков.
												|Описание: ""%2""'"), 
												ШаблонОбъект.Наименование,
												ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ИмяСобытия = НСтр("ru = 'Процессы обработки документов. Исправление ошибок в обработчиках шаблонов процессов'");
						ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
						
					КонецПопытки;
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЦикла;

	КоличествоИсправлений = СтрокиДляОчистки.Количество();
	Для Каждого СтрокаДляОчистки Из СтрокиДляОчистки Цикл
		РезультатыПроверкиШаблонов.Удалить(СтрокаДляОчистки);
	КонецЦикла;

	Возврат КоличествоИсправлений;
	
КонецФункции

&НаСервере
Процедура НайтиОшибкиВСсылочныхДанныхНаСервере()
	
	Дерево = РеквизитФормыВЗначение("РезультатыПроверкиСсылочныхДанных");
	
	Дерево.Строки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкаПодписиСсылочныхДанных.ТипДанных КАК ТипДанных,
	|	НастройкаПодписиСсылочныхДанных.ИмяРеквизита КАК ИмяРеквизита
	|ИЗ
	|	РегистрСведений.НастройкаПодписиСсылочныхДанных КАК НастройкаПодписиСсылочныхДанных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РеквизитНайден = Ложь;
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Выборка.ТипДанных);
	
		Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			Если Реквизит.Имя = Выборка.ИмяРеквизита Тогда
				РеквизитНайден = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
			Если Реквизит.Имя = Выборка.ИмяРеквизита Тогда
				РеквизитНайден = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ РеквизитНайден Тогда
			СтрокаДерева = Дерево.Строки.Найти(Выборка.ТипДанных, "ТипДанных");
			Если СтрокаДерева = Неопределено Тогда
				СтрокаДерева = Дерево.Строки.Добавить();
				СтрокаДерева.ТипДанных = Выборка.ТипДанных;
			КонецЕсли;
			СтрокаРеквизита = СтрокаДерева.Строки.Добавить();
			СтрокаРеквизита.ИмяРеквизита = Выборка.ИмяРеквизита;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РезультатыПроверкиСсылочныхДанных");
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьСсылочныеДанныеНаСервере()
	
	СтрокиТипыДанных = РезультатыПроверкиСсылочныхДанных.ПолучитьЭлементы();
	
	Для Каждого СтрокаТипДанных Из СтрокиТипыДанных Цикл
		
		СтрокиРеквизиты = СтрокаТипДанных.ПолучитьЭлементы();
		ИменаРеквизитовДляУдаления = Новый Массив;
		Для Каждого СтрокаРеквизита Из СтрокиРеквизиты Цикл
			ИменаРеквизитовДляУдаления.Добавить(СтрокаРеквизита.ИмяРеквизита);
		КонецЦикла;
		
		ЗаписиДляУдаления = Новый Массив;
		
		НаборЗаписей = РегистрыСведений.НастройкаПодписиСсылочныхДанных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипДанных.Установить(СтрокаТипДанных.ТипДанных);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ИменаРеквизитовДляУдаления.Найти(Запись.ИмяРеквизита) <> Неопределено Тогда
				ЗаписиДляУдаления.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЗаписьДляУдаления Из ЗаписиДляУдаления Цикл
			НаборЗаписей.Удалить(ЗаписьДляУдаления);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	РезультатыПроверкиСсылочныхДанных.ПолучитьЭлементы().Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыПроверкиШаблоновПометкаПриИзменении(Элемент)
	Если Элементы.РезультатыПроверкиШаблонов.ТекущиеДанные.НастройкиФормуляров 
		ИЛИ Элементы.РезультатыПроверкиШаблонов.ТекущиеДанные.НастройкаСвойствЭлементов Тогда
		Элементы.РезультатыПроверкиШаблонов.ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиШаблоныСОшибкамиНастроекУправленияСвойствамиЭлементовФормы()
	
	ЭлементыФормыУчетногоДокумента = Новый Массив;
	
	Для Каждого ДанныеДокумента Из ДокументыСНастройкамиСвойствЭлементов Цикл
		
		ИмяОсновнойФормыДокумента = ДанныеДокумента.ИмяОсновнойФормыДокумента;
		ПолноеИмяДокумента = ДанныеДокумента.ПолноеИмяДокумента;

		Если ЗначениеЗаполнено(ИмяОсновнойФормыДокумента) Тогда
			ЭлементыФормыУчетногоДокумента.Очистить();
			Попытка
				ФормаДокумента = ПолучитьФорму(ПолноеИмяДокумента + ".Форма." + ИмяОсновнойФормыДокумента); 
				ПолучитьЭлементыФормыДокумента(ФормаДокумента.Элементы, ЭлементыФормыУчетногоДокумента);
			Исключение
				
				ИмяСобытия = "Проверка настроек управления свойствами элементов согласно шаблону";
				ПредставлениеУровня = "Ошибка";
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось получить основную форму документа ""%1""'"), ПолноеИмяДокумента); 
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, 
					ПредставлениеУровня, Комментарий,,Истина);
				
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Если ЭлементыФормыУчетногоДокумента.Количество() > 0 Тогда
			НоваяСтрока = УправлениеСвойствамиЭлементовФормы.Добавить();
			НоваяСтрока.ИдентификаторДокумента = ДанныеДокумента.ИдентификаторДокумента; 
			НоваяСтрока.СписокДоступныхЭлементов = СтрСоединить(ЭлементыФормыУчетногоДокумента, ";"); 
		КонецЕсли;
		
	КонецЦикла;
	
	НайтиШаблоныСОшибкамиНастроекУправленияСвойствамиЭлементовФормыНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура НайтиШаблоныСОшибкамиНастроекУправленияСвойствамиЭлементовФормыНаСервере() 
	
	Если УправлениеСвойствамиЭлементовФормы.Количество() > 0 Тогда
		ТаблицаНастроекСвойствЭлементов = УправлениеСвойствамиЭлементовФормы.Выгрузить();
		ОшибкиНастроекСвойствЭлементов = Справочники.ШаблоныПроцессов.ПроверитьНастройкиУправленияСвойствамиЭлементовФормы(
			ТаблицаНастроекСвойствЭлементов); 
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ОшибкиНастроекСвойствЭлементов, 
			РезультатыПроверкиШаблонов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЭлементыФормыДокумента(ЭлементФормы, МассивЭлементов)
	
	Для каждого Элемент Из ЭлементФормы Цикл  
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "Имя") Тогда
			МассивЭлементов.Добавить(Элемент.Имя);
		Иначе
			Продолжить;
		КонецЕсли;
		
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "ПодчиненныеЭлементы")
			И Элемент.ПодчиненныеЭлементы.Количество() > 0 Тогда
			
			ПолучитьЭлементыФормыДокумента(Элемент.ПодчиненныеЭлементы, МассивЭлементов);
			
		КонецЕсли; 
		
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьВсеДокументыСНастройкамиУправленияСвойствамиЭлементов() 
	ДокументыСНастройкамиСвойствЭлементов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессов.ИдентификаторДокумента КАК ИдентификаторДокумента
	|ИЗ
	|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.УправлениеЭлементамиФормы КАК ШаблоныПроцессовУправлениеЭлементамиФормы
	|		ПО (ШаблоныПроцессовУправлениеЭлементамиФормы.Ссылка = ШаблоныПроцессов.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ШаблоныПроцессов.ИдентификаторДокумента"; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДанныеМетаданныхДокумента = ПолноеНаименованиеФормыИДокумента(Выборка.ИдентификаторДокумента);
		
		НоваяСтрока = ДокументыСНастройкамиСвойствЭлементов.Добавить();
		НоваяСтрока.ИдентификаторДокумента = Выборка.ИдентификаторДокумента;
		ЗаполнитьЗначенияСвойств( НоваяСтрока, ДанныеМетаданныхДокумента);
		
	КонецЦикла;	
	
КонецПроцедуры

  &НаСервереБезКонтекста
Функция ПолноеНаименованиеФормыИДокумента(Знач ИдентификаторДокумента)
	Результат = Новый Структура;
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	ПолноеИмяДокумента = МетаданныеДокумента.ПолноеИмя(); 
	ИмяОсновнойФормыДокумента = МетаданныеДокумента.ОсновнаяФормаОбъекта.Имя; 
	
	Результат.Вставить("ИмяОсновнойФормыДокумента", ИмяОсновнойФормыДокумента);
	Результат.Вставить("ПолноеИмяДокумента", ПолноеИмяДокумента);
	
	Возврат Результат; 
КонецФункции

#КонецОбласти
