#Область СлужебныеПроцедурыИФункции

Процедура ПодразделенияОтбораОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПоСтруктуреПредприятия = Истина) Экспорт

	МодульКонтракта().ПодразделенияОтбораОбработкаВыбора(
		Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПоСтруктуреПредприятия);
	
КонецПроцедуры

#КонецОбласти


#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадрыКлиентПовтИсп.БазовыйРежим() Тогда
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("РегулярнаяОтправкаСотрудниковФормыКлиентБазовый");
	Иначе
		Возврат ОбщегоНазначенияКлиент.ОбщийМодуль("РегулярнаяОтправкаСотрудниковФормыКлиентРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
