
#Область ПрограммныйИнтерфейс

// Возвращает таблицу видов приложений конфигурации.
// 
// Параметры:
//  ВключаяБазовый - Булево - Истина, если нужно включать базовый вид приложения в таблицу. 
//                            По умолчанию = Истина.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ВидыПриложенийСлужебный.НоваяТаблицаВидовПриложений
//
Функция ВидыПриложенийКонфигурации(ВключаяБазовый = Истина) Экспорт
	
	ВидыПриложений = ВидыПриложенийСлужебный.НоваяТаблицаВидовПриложений();
	
	Если ВключаяБазовый Тогда
		БазовыйВидПриложения = БазовыйВидПриложения();
		НовыйВидПриложения = ВидыПриложений.Добавить();
		
		ЗаполнитьЗначенияСвойств(НовыйВидПриложения, БазовыйВидПриложения);
		НовыйВидПриложения.ДополнительныеСвойства = Новый Структура(БазовыйВидПриложения.ДополнительныеСвойства);
	КонецЕсли;
	
	ВидыПриложенийПереопределяемый.ПриОпределенииВидовПриложенийКонфигурации(ВидыПриложений);
	
	Возврат ВидыПриложений;
	
КонецФункции

// Возвращает таблицу обработчиков переходов видов приложений конфигурации
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ВидыПриложенийСлужебный.НоваяТаблицаОбработчиковПерехода
//
Функция ОбработчикиПереходов() Экспорт
	
	ОбработчикиПерехода = ВидыПриложенийСлужебный.НоваяТаблицаОбработчиковПерехода();
	ВидыПриложенийПереопределяемый.ПриДобавленииОбработчиковПереходаВидовПриложений(ОбработчикиПерехода);
	
	Возврат ОбработчикиПерехода;
	
КонецФункции

// Возвращает таблицу обработчиков перехода с вида приложения
// 
// Параметры:
//  ИсходноеИмяВидаПриложения - Строка - имя предыдущего вида приложения
//  ИмяВидаПриложения - Строка, Неопределено - имя нового вида приложения. Неопределено - если новый вид приложения любой. 
//                                             По умолчанию, Неопределено
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ВидыПриложенийСлужебный.НоваяТаблицаОбработчиковПерехода
//
Функция ОбработчикиПереходаВидаПриложения(ИсходноеИмяВидаПриложения, ИмяВидаПриложения = Неопределено) Экспорт
	
	Результат = ВидыПриложенийСлужебный.НоваяТаблицаОбработчиковПерехода();
	
	Отбор = Новый Структура("ИсходноеИмяВидаПриложения", ИсходноеИмяВидаПриложения);
	Если ИмяВидаПриложения <> Неопределено Тогда
		Отбор.Вставить("ИмяВидаПриложения", ИмяВидаПриложения);
	КонецЕсли;
	
	НайденныеСтроки = ОбработчикиПереходов().НайтиСтроки(Отбор); 
	Для Каждого СтрокаПерехода Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаПерехода);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает имя вида приложения конфигурации, автономного рабочего места (АРМ) или области данных, если включено разделение
// 
// Возвращаемое значение:
//  Строка - имя текущего вида приложения
// 
// Примечание:
//  Имя вида приложения для АРМ может отличаться от итогового, если обращение к функции было до завершения загрузки данных в АРМ
//
Функция ИмяТекущегоВидаПриложения() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат ВидыПриложенийСлужебный.ИмяТекущегоВидаПриложения();
	КонецЕсли;
	
	ИмяТекущегоВидаПриложения = БазовыйВидПриложения().Имя;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВАвтономномРежиме") Тогда
		ИмяТекущегоВидаПриложения = Константы.ИмяВидаПриложенияАвтономногоРабочегоМеста.Получить();
	КонецЕсли;
	
	ПараметрыВидаПриложения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ВидыПриложенийСлужебный.ИдентификаторВидаПриложения(), ВидыПриложенийСлужебный.КлючПараметрыВидаПриложения());
	Если ПараметрыВидаПриложения <> Неопределено Тогда
		ВидыПриложенийПереопределяемый.ПриПолученииИмениТекущегоВидаПриложения(
			ПараметрыВидаПриложения.Имя, ИмяТекущегоВидаПриложения);
	КонецЕсли;
	
	Возврат ИмяТекущегоВидаПриложения;
	
КонецФункции

// Возвращает представление вида приложения конфигурации, автономного рабочего места (АРМ) или области данных, если включено разделение
//
// Возвращаемое значение:
//  Строка - представление вида приложения
//
// Примечание:
//  Представление вида приложения для АРМ может отличаться от итогового, если обращение к функции было до завершения загрузки данных в АРМ
//
Функция ПредставлениеТекущегоВидаПриложения() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.РазделениеВключено() 
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат ВидыПриложенийСлужебный.ПредставлениеТекущегоВидаПриложения();
	КонецЕсли;
	
	ПредставлениеТекущегоВидаПриложения = БазовыйВидПриложения().Представление;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВАвтономномРежиме") Тогда
		ПредставлениеТекущегоВидаПриложения = Константы.ПредставлениеВидаПриложенияАвтономногоРабочегоМеста.Получить();
	КонецЕсли;
	
	ПараметрыВидаПриложения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ВидыПриложенийСлужебный.ИдентификаторВидаПриложения(), ВидыПриложенийСлужебный.КлючПараметрыВидаПриложения());
	Если ПараметрыВидаПриложения <> Неопределено Тогда
		ПредставлениеТекущегоВидаПриложения = ПараметрыВидаПриложения.Представление;
	КонецЕсли;
	
	Возврат ПредставлениеТекущегоВидаПриложения;
	
КонецФункции

// Возвращает свойства вида приложения по имени.
// 
// Параметры:
//  Имя - Строка - имя вида приложения, свойства которого нужно получить.
//  ВызыватьИсключение - Булево - если Ложь, то в случае отсутствия свойств вида приложения по имени
//                                исключение не будет вызвано. По умолчанию = Истина.
// 
// Возвращаемое значение:
//  Неопределено, ФиксированнаяСтруктура - Свойства вида приложения.
//                                         Если свойства не найдены и ВызыватьИсключение = Ложь, возвращается Неопределено.
//                                         Состав свойств см. в ВидыПриложенийСлужебный.НовыйВидПриложения.
//
Функция СвойстваВидаПриложенияПоИмени(Имя, ВызыватьИсключение = Истина) Экспорт
	
	ВидыПриложений = ВидыПриложенийКонфигурации();
	НайденныеСтроки = ВидыПриложений.НайтиСтроки(Новый Структура("Имя", Имя));
	
	ТекстСообщения = "";
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не найден вид приложения по имени ""%1""'"), Имя);
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Найдено несколько видов приложений по имени ""%1""'"), Имя);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Виды приложений. Поиск вида приложения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
		
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстСообщения;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(
		ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НайденныеСтроки[0]));
	
КонецФункции

// Возвращает свойства вида приложения по услугам.
// Поиск происходит по полному соответствию услуг в переданном параметре и описании вида приложения
// 
// Параметры:
//  Услуги - ТаблицаЗначений - описание см.НоваяТаблицаУслуг
//  ВызыватьИсключение - Булево - если Ложь, то в случае отсутствия свойств вида приложения по услугам 
//                                исключение не будет вызвано. По умолчанию, Истина.
// 
// Возвращаемое значение:
//  Неопределено, ФиксированнаяСтруктура - Свойства вида приложения.
//                                         Если свойства не найдены и ВызыватьИсключение = Ложь, возвращается Неопределено.
//                                         Состав свойств см. в ВидыПриложенийСлужебный.НовыйВидПриложения.
//
Функция СвойстваВидаПриложенияПоУслугам(Услуги, ВызыватьИсключение = Истина) Экспорт
	
	НайденныеСтроки = Новый Массив;
	
	ВидыПриложений = ВидыПриложенийКонфигурации();
	Для Каждого ВидПриложения Из ВидыПриложений Цикл
		УслугиВидаПриложения = ВидПриложения.Услуги;
		
		Если УслугиВидаПриложения.Количество() <> Услуги.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		ВсеУслугиНайдены = Истина;
		Для Каждого Услуга Из Услуги Цикл
			Если Не ВидыПриложенийСлужебный.УслугаНайденаВВидеПриложения(ВидПриложения, Услуга) Тогда
				ВсеУслугиНайдены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВсеУслугиНайдены Тогда
			НайденныеСтроки.Добавить(ВидПриложения);
		КонецЕсли;
	КонецЦикла;
	
	ТекстСообщения = "";
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не найден вид приложения по списку услуг: %1'"),
			ВидыПриложенийСлужебный.ПредставлениеСпискаУслуг(Услуги, Символы.ПС + "- "));
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Найдено несколько видов приложений по списку услуг:%1'"),
			ВидыПриложенийСлужебный.ПредставлениеСпискаУслуг(Услуги, Символы.ПС + "- "));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Виды приложений. Поиск вида приложения'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, , , ТекстСообщения);
		
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстСообщения;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(
		ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НайденныеСтроки[0]));
	
КонецФункции

// Возвращает вид приложения, соответствующий конфигурации.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. ВидыПриложенийСлужебный.НовыйВидПриложения
//
Функция БазовыйВидПриложения() Экспорт
	
	ВидПриложения = ВидыПриложенийСлужебный.НовыйВидПриложения();
	ВидПриложения.Имя = Метаданные.Имя;
	ВидПриложения.Представление = Метаданные.Представление();
	ВидПриложения.Базовый = Истина;
	ВидПриложения.Процедура = "ВидыПриложенийСлужебный.УстановкаБазовогоВидаПриложения";
	
	ВидыПриложенийПереопределяемый.ПриОпределенииДопСвойствБазовогоВидаПриложения(ВидПриложения.ДополнительныеСвойства);
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(ВидПриложения);
	
КонецФункции

// Возвращает вид приложения, который будет установлен по умолчанию, 
// если, например, не удалось определить вид приложения по имени или услугам.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура - см. ВидыПриложенийСлужебный.НовыйВидПриложения
//
Функция ВидПриложенияПоУмолчанию() Экспорт
	
	ВидПриложения = Неопределено;
	
	ВидыПриложенийПереопределяемый.ПриОпределенииВидаПриложенияПоУмолчанию(ВидПриложения);
	Если ВидПриложения = Неопределено Тогда
		ВидПриложения = БазовыйВидПриложения();
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ФиксированныеДанные(ВидПриложения);
	
КонецФункции

// Сохраняет параметры вида приложения в безопасное хранилище.
//
// Параметры:
//  Параметры - Неопределено, Структура - если Неопределено, то сохраненные параметры вида приложения удаляются:
//   * Имя - Строка - имя вида приложения, длиной не более 255 символов.
//   * ИмяПользовательское - Строка - имя пользовательского вида приложения, длиной не более 255 символов.
//   * Представление - Строка - представление вида приложения, длиной не более 150 символов.
//
// Примечание:
//  Параметры вида приложения не будут сохранены, если ИмяВидаПриложения нет в таблице ВидыПриложенийСервер.ВидыПриложенийКонфигурации.
//
Процедура УстановитьПараметрыВидаПриложения(Параметры) Экспорт
	
	//@skip-check unavailable-in-safemode
	УстановитьПривилегированныйРежим(Истина);
	
	Если Параметры = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Параметры удалены'");
		
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
			ВидыПриложенийСлужебный.ИдентификаторВидаПриложения(), ВидыПриложенийСлужебный.КлючПараметрыВидаПриложения());
		
	ИначеЕсли ВидыПриложенийКонфигурации().Найти(Параметры.Имя, "Имя") = Неопределено Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Имя вида приложения ""%1"" не найдено в таблице видов приложений конфигурации. Параметры удалены'"), Параметры.Имя);
		
		ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(
			ВидыПриложенийСлужебный.ИдентификаторВидаПриложения(), ВидыПриложенийСлужебный.КлючПараметрыВидаПриложения());
		
	Иначе
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Имя вида приложения: %2%1Представление вида приложения: %3%1Имя вида приложения пользовательское:%4'"),
			Символы.ПС, Параметры.Имя, Параметры.Представление, Параметры.ИмяПользовательское);
		
		ДанныеВидаПриложения = Новый Структура();
		ДанныеВидаПриложения.Вставить("Имя", Параметры.Имя);
		ДанныеВидаПриложения.Вставить("Представление", Параметры.Представление);
		ДанныеВидаПриложения.Вставить("ИмяПользовательское", Параметры.ИмяПользовательское);
		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ВидыПриложенийСлужебный.ИдентификаторВидаПриложения(), ДанныеВидаПриложения, ВидыПриложенийСлужебный.КлючПараметрыВидаПриложения());
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Виды приложений. Изменение параметров'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
	
КонецПроцедуры

// Возвращает описание таблицы услуг для видов приложений
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список услуг вида приложения:
//   * ИдентификаторУслуги - Строка - уникальный строковый идентификатор (код) услуги в сервисе.
//   * ИдентификаторПоставщика - Строка - уникальный строковый идентификатор (код) поставщика услуг в сервисе.
//
Функция НоваяТаблицаУслуг() Экспорт
	
	УслугиВидовПриложений = Новый ТаблицаЗначений;
	УслугиВидовПриложений.Колонки.Добавить("ИдентификаторПоставщика", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	УслугиВидовПриложений.Колонки.Добавить("ИдентификаторУслуги", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	Возврат УслугиВидовПриложений;
	
КонецФункции

// Возвращает шаблон описания услуги вида приложения
// 
// Возвращаемое значение:
//  Структура - Новая услуга:
// * ИдентификаторУслуги - Строка - уникальный строковый идентификатор (код) услуги в сервисе.
// * ИдентификаторПоставщика - Строка - уникальный строковый идентификатор (код) поставщика услуг в сервисе.
//
Функция НоваяУслуга() Экспорт
	
	НоваяУслуга = Новый Структура();
	НоваяУслуга.Вставить("ИдентификаторУслуги", "");
	НоваяУслуга.Вставить("ИдентификаторПоставщика", "");
	
	Возврат НоваяУслуга;
	
КонецФункции

#КонецОбласти