#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ОткрытьФайлЗавершение", ЭтотОбъект), АдресВременногоХранилища,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(Результат, Адрес, ИмяВыбранногоФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ИмяВыбранногоФайла;
	АдресВременногоХранилища = Адрес;
	
	ПослеОткрытияФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаПриИзменении(Элемент)
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		АдресВременногоХранилища = "";
		ЗагружаемыеКолонки.Очистить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите имя файла'"),,"ПолноеИмяФайла",,);
		ТекущийЭлемент = Элементы.ПолноеИмяФайла;
		Возврат;
	КонецЕсли;
	
	Если ЗагружаемыеКолонки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Файл не содержит колонок для загрузки'"));
		Возврат;
	КонецЕсли;
	
	ЗагрузитьКолонкиНаСервере();
	
	ТекстСообщения = НСтр("ru = 'Колонки успешно загружены'");
	ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Успешно32);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ДополнительныеКолонкиСписковЗадач"));
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОткрытияФайла()
	
	ЗагружаемыеКолонки.Очистить();
	
	ОбновитьЗагружаемыеКолонкиСервер();
	
	Если ЗагружаемыеКолонки.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Файл не содержит колонок для загрузки'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗагружаемыеКолонкиСервер()
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	ФайлКолонок = Новый ЧтениеXML;
	ФайлКолонок.ОткрытьФайл(ИмяВременногоФайла);
	ФайлКолонок.Прочитать();
	
	ЗагрузитьСписокКолонокИзФайла(ФайлКолонок);
	
	ФайлКолонок.Закрыть();
	
	// ?
	//ПоместитьВоВременноеХранилище(ДанныеФайла, АдресВременногоХранилища);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// Обработка не требуется. Файл будет удален платформой автоматически.
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСписокКолонокИзФайла(ФайлДанных)
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "Колонка" Тогда
				
				ИдентификаторПоддержкиСтрокой = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
					ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
				Иначе
					ВызватьИсключение НСтр("ru = 'В файле обнаружены колонки с незаполненным идентификатором поддержки!'");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПоддержки) Тогда
					КолонкаВБазе = Справочники.ДополнительныеКолонкиСписковЗадач.НайтиПоРеквизиту(
						"ИдентификаторПоддержки", ИдентификаторПоддержки);
				Иначе
					КолонкаВБазе = Справочники.ДополнительныеКолонкиСписковЗадач.ПустаяСсылка();
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				ПараметрыПоиска = Новый Структура("ИдентификаторПоддержки", ИдентификаторПоддержкиСтрокой);
				Если ЗагружаемыеКолонки.НайтиСтроки(ПараметрыПоиска).Количество() > 0
					ИЛИ ПустаяСтрока(Наименование) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекЭлемент = ЗагружаемыеКолонки.Добавить();
				ТекЭлемент.Колонка = Наименование;
				ТекЭлемент.ИдентификаторПоддержки = ИдентификаторПоддержкиСтрокой;
				ТекЭлемент.КолонкаВБазе = КолонкаВБазе;
				ТекЭлемент.НайденОбъектВБазе = НЕ КолонкаВБазе.Пустая();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКолонкиНаСервере()
	
	СоответствиеКолонок = Новый Соответствие;
	Для Каждого СтрокаКолонка Из ЗагружаемыеКолонки Цикл
		СоответствиеКолонок.Вставить(СтрокаКолонка.ИдентификаторПоддержки, СтрокаКолонка.КолонкаВБазе);
	КонецЦикла;
	
	Справочники.ДополнительныеКолонкиСписковЗадач.ЗагрузитьКолонкиИзФайла(АдресВременногоХранилища, СоответствиеКолонок);
	
КонецФункции

#КонецОбласти
