////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицинское страхование"
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает данные о прикрепленных сотрудниках и родственниках
//
// Параметры:
//   МассивДокументов - Массив из ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования
//
// Возвращаемое значение:
//  Структура - структура застрахованных. Значения структуры:
//      Сотрудники - Массив - массив структур с ключами:
//      	ДокументПрикрепления - ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования - ссылка на документ прикрепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаНачала - Дата - Дата начала страхования
//      	ДатаОкончания - Дата - Дата окончания страхования
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сведения - структура сведений о контактной информации застрахованного
//      	Сотрудник - СправочникСсылка.Сотрудники
//      	СтраховаяПремия - Число
//      Родственники - Массив - массив структур с ключами:
//      	ДокументПрикрепления - ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования - ссылка на документ прикрепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаНачала - Дата - Дата начала страхования
//      	ДатаОкончания - Дата - Дата окончания страхования
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сведения - структура сведений о контактной информации застрахованного
//      	Родственник - СправочникСсылка.РодственникиФизическихЛиц
//      	СтраховаяПремия - Число.
//
Функция ДанныеПрикреплений(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПрикреплениеКПрограммамМедицинскогоСтрахования", МассивДокументов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Сотрудник КАК Сотрудник,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ДатаПрикрепления КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.ДатаОкончанияСтрахования КАК ДатаОкончания,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеКИ,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК ВидКИ,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка КАК ДокументПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК МедицинскоеСтрахованиеПрикреплениеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|ГДЕ
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка.Проведен = ИСТИНА
		|	И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка В(&ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Сотрудник,
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.ДатаПрикрепления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка КАК Родственник,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаПрикрепления КАК ДатаНачала,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаОткрепления КАК ДатаОкончания,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК ВидКИ,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеКИ,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка КАК ДокументПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|			И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|ГДЕ
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка.Проведен = ИСТИНА
		|	И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка В(&ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Родственник,
		|	МедицинскоеСтрахованиеПрикреплениеРодственники.ДатаПрикрепления";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеПрикреплений = Новый Структура;
	ДанныеПрикреплений.Вставить("Сотрудники", Новый Массив);
	ДанныеПрикреплений.Вставить("Родственники", Новый Массив);
	ВыборкаСотрудников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();

	Пока ВыборкаСотрудников.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеСотрудника = Новый Структура;
		ДанныеСотрудника.Вставить("ДокументПрикрепления", ВыборкаСотрудников.ДокументПрикрепления);
		ДанныеСотрудника.Вставить("Организация", ВыборкаСотрудников.Организация);
		ДанныеСотрудника.Вставить("СтраховаяКомпания", ВыборкаСотрудников.СтраховаяКомпания);
		ДанныеСотрудника.Вставить("Сотрудник", ВыборкаСотрудников.Сотрудник);
		ДанныеСотрудника.Вставить("ДатаНачала", ВыборкаСотрудников.ДатаНачала);
		ДанныеСотрудника.Вставить("ДатаОкончания", ВыборкаСотрудников.ДатаОкончания);
		ДанныеСотрудника.Вставить("ПрограммыСтрахования", ВыборкаСотрудников.ПрограммыСтрахования);
		ДанныеСотрудника.Вставить("РасширенияПрограммСтрахования", ВыборкаСотрудников.РасширенияПрограммСтрахования);
		ДанныеСотрудника.Вставить("СтраховаяПремия", ВыборкаСотрудников.СтраховаяПремия);
		
		ДанныеСведений = Новый Структура;
		ДанныеСведений.Вставить("ДатаРождения", ВыборкаСотрудников.ДатаРождения);
		ДанныеСведений.Вставить("СтраховойНомерПФР", ВыборкаСотрудников.СтраховойНомерПФР);
		ДанныеСведений.Вставить("Пол", ВыборкаСотрудников.Пол);
		ДанныеСведений.Вставить("Страна", ВыборкаСотрудников.Страна);
		ДанныеСведений.Вставить("ДокументПредставление", ВыборкаСотрудников.ДокументПредставление);
		Пока ВыборкаСотрудников.Следующий() Цикл
			ДанныеСведений.Вставить(ВыборкаСотрудников.ВидКИ.ИдентификаторДляФормул, ВыборкаСотрудников.ПредставлениеКИ);
		КонецЦикла;
		ДанныеСотрудника.Вставить("Сведения", ДанныеСведений);
		
		ДанныеПрикреплений.Сотрудники.Добавить(ДанныеСотрудника);
	КонецЦикла;
	
	ВыборкаРодственников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаРодственников.СледующийПоЗначениюПоля("Родственник") Цикл
		ДанныеРодственника = Новый Структура;
		ДанныеРодственника.Вставить("ДокументПрикрепления", ВыборкаРодственников.ДокументПрикрепления);
		ДанныеРодственника.Вставить("Организация", ВыборкаРодственников.Организация);
		ДанныеРодственника.Вставить("СтраховаяКомпания", ВыборкаРодственников.СтраховаяКомпания);
		ДанныеРодственника.Вставить("Родственник", ВыборкаРодственников.Родственник);
		ДанныеРодственника.Вставить("ДатаНачала", ВыборкаРодственников.ДатаНачала);
		ДанныеРодственника.Вставить("ДатаОкончания", ВыборкаРодственников.ДатаОкончания);
		ДанныеРодственника.Вставить("ПрограммыСтрахования", ВыборкаРодственников.ПрограммыСтрахования);
		ДанныеРодственника.Вставить("РасширенияПрограммСтрахования", ВыборкаРодственников.РасширенияПрограммСтрахования);
		ДанныеРодственника.Вставить("СтраховаяПремия", ВыборкаРодственников.СтраховаяПремия);
		
		ДанныеСведений = Новый Структура;
		ДанныеСведений.Вставить("ДатаРождения", ВыборкаРодственников.ДатаРождения);
		ДанныеСведений.Вставить("СтраховойНомерПФР", ВыборкаРодственников.СтраховойНомерПФР);
		ДанныеСведений.Вставить("Пол", ВыборкаРодственников.Пол);
		ДанныеСведений.Вставить("Страна", ВыборкаРодственников.Страна);
		ДанныеСведений.Вставить("ДокументПредставление", ВыборкаРодственников.ДокументПредставление);
		Пока ВыборкаРодственников.Следующий() Цикл
			ДанныеСведений.Вставить(ВыборкаРодственников.ВидКИ.ИдентификаторДляФормул, ВыборкаРодственников.ПредставлениеКИ);
		КонецЦикла;
		
		ДанныеРодственника.Вставить("Сведения", ДанныеСведений);
		
		ДанныеПрикреплений.Родственники.Добавить(ДанныеРодственника);
	КонецЦикла;
	
	Возврат ДанныеПрикреплений;
	
КонецФункции

// Возвращает данные о открепленных сотрудниках и родственниках
//
// Параметры:
//   МассивДокументов - Массив из ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования
//
// Возвращаемое значение:
//  Структура - структура застрахованных. Значения структуры:
//      Сотрудники - Массив - массив структур с ключами:
//      	ДокументОткрепления - ДокументСсылка.ОткреплениеОтПрограммМедицинскогоСтрахования - ссылка на документ открепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаОткрепления - Дата - Дата открепления сотрудника
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Сотрудник - СправочникСсылка.Сотрудники
//      	СтраховаяПремия - Число
//      Родственники - Массив - массив структур с ключами:
//      	ДокументОткрепления - ДокументСсылка.ОткреплениеОтПрограммМедицинскогоСтрахования - ссылка на документ открепления
//      	Организация - СправочникСсылка.Организации
//      	СтраховаяКомпания - СправочникСсылка.Контрагенты
//      	ДатаОткрепления - Дата - Дата открепления родственника
//      	ПрограммыСтрахования - Строка
//      	РасширенияПрограммСтрахования - Строка
//      	Родственник - СправочникСсылка.РодственникиФизическихЛиц
//      	СтраховаяПремия - Число.
//
Функция ДанныеОткреплений(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ОткреплениеОтПрограммМедицинскогоСтрахования", МассивДокументов);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.Организация КАК Организация,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Сотрудник КАК Сотрудник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ДатаОткрепления КАК ДатаОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка В(&ОткреплениеОтПрограммМедицинскогоСтрахования)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Ссылка.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.Сотрудник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияСотрудники.ДатаОткрепления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка КАК ДокументОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Организация КАК Организация,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка КАК Родственник,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка В(&ОткреплениеОтПрограммМедицинскогоСтрахования)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Проведен = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка,
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.ДатаОткрепления";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеОткреплений = Новый Структура;
	ДанныеОткреплений.Вставить("Сотрудники", Новый Массив);
	ДанныеОткреплений.Вставить("Родственники", Новый Массив);
	
	ВыборкаСотрудников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	Пока ВыборкаСотрудников.СледующийПоЗначениюПоля("Сотрудник") Цикл
		ДанныеСотрудника = Новый Структура;
		ДанныеСотрудника.Вставить("ДокументОткрепления", ВыборкаСотрудников.ДокументОткрепления);
		ДанныеСотрудника.Вставить("Организация", ВыборкаСотрудников.Организация);
		ДанныеСотрудника.Вставить("СтраховаяКомпания", ВыборкаСотрудников.СтраховаяКомпания);
		ДанныеСотрудника.Вставить("ДоговорСтрахования", ВыборкаСотрудников.ДоговорСтрахования);
		ДанныеСотрудника.Вставить("Сотрудник", ВыборкаСотрудников.Сотрудник);
		ДанныеСотрудника.Вставить("ДатаОткрепления", ВыборкаСотрудников.ДатаОткрепления);
		ДанныеСотрудника.Вставить("ПрограммыСтрахования", ВыборкаСотрудников.ПрограммыСтрахования);
		ДанныеСотрудника.Вставить("РасширенияПрограммСтрахования", ВыборкаСотрудников.РасширенияПрограммСтрахования);
		ДанныеСотрудника.Вставить("СтраховаяПремия", ВыборкаСотрудников.СтраховаяПремия);
		ДанныеОткреплений.Сотрудники.Добавить(ДанныеСотрудника);
	КонецЦикла;
	
	ВыборкаРодственников = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	Пока ВыборкаРодственников.СледующийПоЗначениюПоля("Родственник") Цикл
		ДанныеРодственника = Новый Структура;
		ДанныеРодственника.Вставить("ДокументОткрепления", ВыборкаРодственников.ДокументОткрепления);
		ДанныеРодственника.Вставить("Организация", ВыборкаРодственников.Организация);
		ДанныеРодственника.Вставить("СтраховаяКомпания", ВыборкаРодственников.СтраховаяКомпания);
		ДанныеРодственника.Вставить("ДоговорСтрахования", ВыборкаРодственников.ДоговорСтрахования);
		ДанныеРодственника.Вставить("Родственник", ВыборкаРодственников.Родственник);
		ДанныеРодственника.Вставить("ДатаОткрепления", ВыборкаРодственников.ДатаОткрепления);
		ДанныеРодственника.Вставить("ПрограммыСтрахования", ВыборкаРодственников.ПрограммыСтрахования);
		ДанныеРодственника.Вставить("РасширенияПрограммСтрахования", ВыборкаРодственников.РасширенияПрограммСтрахования);
		ДанныеРодственника.Вставить("СтраховаяПремия", ВыборкаРодственников.СтраховаяПремия);
		ДанныеОткреплений.Родственники.Добавить(ДанныеРодственника);
	КонецЦикла;
	
	Возврат ДанныеОткреплений;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолисыДМСКОтправке", Истина);
	Методы.Вставить("ДополнитьУдержанияМедицинскогоСтрахованияДанными");
	Методы.Вставить("ОбновитьСвойстваУдержанияЗаДМС");
	Методы.Вставить("ДобавитьРолиДоговоровСтрахованияВПользовательскиеПрофили");
	Методы.Вставить("СоздатьПоказателиМедицинскогоСтрахования");
	Методы.Вставить("ЗаполнитьРодственниковВДокументахПрикрепления");
	Методы.Вставить("ЗаполнитьРодственниковВДокументахОткрепления");
	Методы.Вставить("ЗаполнитьДанныеИКонтактнуюИнформациюЗастрахованныхВДокументахПрикрепления");
	Методы.Вставить("ЗаполнитьУсловияМедицинскогоСтрахованияИзПрикреплений");
	Методы.Вставить("ЗаполнитьУсловияМедицинскогоСтрахованияИзОткреплений");
	Методы.Вставить("СоздатьАктуальныеДоговорыСтрахования");
	Методы.Вставить("ЗаполнитьДоговорыСтрахованияВРешенияхОбУвольнении");
	Методы.Вставить("ЗаполнитьСотрудниковВРегистреРешенияОбОткрепленииСотрудниковМедицинскогоСтрахования");
	Методы.Вставить("СформироватьШаблоныРассылокМедСтрахования");
	Методы.Вставить("ЗаполнитьДоговорыСтрахованияВДокументахДМС");
	Методы.Вставить("ЗаполнитьСпособыУдержания");
	Методы.Вставить("ЗаполнитьОтправляемуюКонтактнуюИнформациюЗастрахованных");
	Методы.Вставить("ЗаполнитьИзмерениеНомерПолисаВРегистреПолисыДМС");
	Методы.Вставить("ЗаполнитьОснованияДляПерерасчетаУдержаний");
	Методы.Вставить("ЗаполнитьДатыСтрахования");
	Методы.Вставить("ЗаполнитьОтправляемыеДанныеЗастрахованных");
	Методы.Вставить("ЗаполнитьПрикреплениеВДокументахИзмененияУсловийМедицинскогоСтрахования");
	Методы.Вставить("УстановитьИспользованиеУдержаний");
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуетсяМедицинскоеСтрахованиеСотрудников() Экспорт
	
	Возврат Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Получить();
	
КонецФункции

Функция ИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Получить();
КонецФункции

Процедура УстановитьИспользованиеМедицинскогоСтрахования(Использовать) Экспорт
	Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Установить(Использовать);
КонецПроцедуры

Процедура УстановитьИспользованиеУдержанийВМедицинскомСтрахованииСотрудников(Использовать) Экспорт
	Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Установить(Использовать);
КонецПроцедуры

Функция ПараметрыОтправкиПисьма(Форма, ВыбранныеПараметры, Получатели, ТемаПисьма) Экспорт
	
	НастройкиПечатныхФорм = Новый ТаблицаЗначений;
	НастройкиПечатныхФорм.Колонки.Добавить("Представление", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	НастройкиПечатныхФорм.Колонки.Добавить("Печатать", Новый ОписаниеТипов("Булево"));
	НастройкиПечатныхФорм.Колонки.Добавить("ИмяМакета", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("Название", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ПолноеИмяОбъекта", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	НастройкиПечатныхФорм.Колонки.Добавить("ТабличныйДокумент", Неопределено);
	НастройкиПечатныхФорм.Колонки.Добавить("СсылкаДокумента", Неопределено);
	НастройкиПечатныхФорм.Колонки.Добавить("ДополнительныеПараметры", Неопределено);
	
	КомандыПечати = УправлениеПечатью.КомандыПечатиФормы(Форма);
	Для каждого КомандаПечати Из КомандыПечати Цикл
		НоваяСтрока = НастройкиПечатныхФорм.Добавить();
		НоваяСтрока.ИмяМакета = КомандаПечати.Идентификатор;
		НоваяСтрока.ПолноеИмяОбъекта = КомандаПечати.МенеджерПечати;
		НоваяСтрока.СсылкаДокумента = Форма.Объект.Ссылка;
		НоваяСтрока.ИмяФайлаПечатнойФормы = "<Undefined xmlns="""" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xsi:nil=""true""/>";
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Название = КомандаПечати.Представление;
		НоваяСтрока.Печатать = Истина;
		НоваяСтрока.Представление = КомандаПечати.Представление;
		НоваяСтрока.ДополнительныеПараметры = КомандаПечати.ДополнительныеПараметры;
	КонецЦикла;
	
	СписокВложений = ПоместитьТабличныеДокументыВоВременноеХранилище(Форма, ВыбранныеПараметры, НастройкиПечатныхФорм);
	
	// Контроль уникальности имен.
	ШаблонИмениФайла = "%1%2.%3";
	ИспользованныеИменаФайлов = Новый Соответствие;
	Для Каждого Вложение Из СписокВложений Цикл
		ИмяФайла = Вложение.Представление;
		НомерИспользования = ?(ИспользованныеИменаФайлов[ИмяФайла] <> Неопределено,
			ИспользованныеИменаФайлов[ИмяФайла] + 1, 1);
		ИспользованныеИменаФайлов.Вставить(ИмяФайла, НомерИспользования);
		Если НомерИспользования > 1 Тогда
			Файл = Новый Файл(ИмяФайла);
			ИмяФайла = СтрШаблон(ШаблонИмениФайла, Файл.ИмяБезРасширения, " (" + НомерИспользования + ")", Файл.Расширение);
		КонецЕсли;
		Вложение.Представление = ИмяФайла;
	КонецЦикла;
	
	Если ВыбранныеПараметры.Свойство("Получатели") Тогда
		Получатели = ВыбранныеПараметры.Получатели;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Получатель", Получатели);
	Результат.Вставить("Тема", ТемаПисьма);
	Результат.Вставить("Вложения", СписокВложений);
	Результат.Вставить("УдалятьФайлыПослеОтправки", Истина);
	
	ПечатныеФормы = Новый ТаблицаЗначений;
	ПечатныеФормы.Колонки.Добавить("Название");
	ПечатныеФормы.Колонки.Добавить("ТабличныйДокумент");
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ТабличныйДокумент = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ТабличныйДокумент = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		Если ПечатныеФормы.НайтиСтроки(Новый Структура("ТабличныйДокумент", ТабличныйДокумент)).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ТабличныйДокумент) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТабличныйДокумент.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТабличныйДокумент.ВысотаТаблицы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеПечатнойФормы = ПечатныеФормы.Добавить();
		ОписаниеПечатнойФормы.Название = НастройкаПечатнойФормы.Название;
		ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтраховаяПремияСотрудника(ЭлементСтрахования) Экспорт
	
	СтраховаяПремияСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтрахования, "СтраховаяПремияСотрудника");
	Возврат ?(СтраховаяПремияСотрудника = Неопределено, 0, СтраховаяПремияСотрудника);
	
КонецФункции

Функция СтраховаяПремияРодственника(ЭлементСтрахования) Экспорт
	
	СтраховаяПремияРодственника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСтрахования, "СтраховаяПремияРодственника");
	Возврат ?(СтраховаяПремияРодственника = Неопределено, 0, СтраховаяПремияРодственника);
	
КонецФункции

Функция ПараметрыРасчетаСтраховойПремии() Экспорт
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ДатаНачала");
	ПараметрыРасчета.Вставить("ДатаОкончания");
	ПараметрыРасчета.Вставить("ДатаНачалаСтрахования");
	ПараметрыРасчета.Вставить("ДатаОкончанияСтрахования");
	ПараметрыРасчета.Вставить("ДатаРождения");
	ПараметрыРасчета.Вставить("СтраховаяПремияСтрахователя", 0);
	
	ШкалаВозрастов = Новый ТаблицаЗначений;
	ШкалаВозрастов.Колонки.Добавить("ЗначениеОт", ОбщегоНазначения.ОписаниеТипаЧисло(2));
	ШкалаВозрастов.Колонки.Добавить("ЗначениеДо", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ШкалаВозрастов.Колонки.Добавить("ЗначениеПоказателя", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	ПараметрыРасчета.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

Функция СтраховаяПремия(ПараметрыРасчета) Экспорт
	
	КоличествоДнейВМесяце = День(КонецМесяца(Дата(Год(ПараметрыРасчета.ДатаНачала), Месяц(ПараметрыРасчета.ДатаРождения), 1)));
	ДеньРожденияТекущийГод = Дата(Год(ПараметрыРасчета.ДатаНачала), Месяц(ПараметрыРасчета.ДатаРождения), Мин(День(ПараметрыРасчета.ДатаРождения), КоличествоДнейВМесяце));
	КоличествоЛетНаНачалоПериода = Год(ПараметрыРасчета.ДатаНачала) - Год(ПараметрыРасчета.ДатаРождения) + ?(Месяц(ПараметрыРасчета.ДатаРождения) > Месяц(ПараметрыРасчета.ДатаНачала), -1,
		?(Месяц(ПараметрыРасчета.ДатаРождения) = Месяц(ПараметрыРасчета.ДатаНачала) И День(ПараметрыРасчета.ДатаРождения) > День(ПараметрыРасчета.ДатаНачала), -1, 0));
	КоличествоЛетНаТекущуюДатуРождения = Год(ДеньРожденияТекущийГод) - Год(ПараметрыРасчета.ДатаРождения);
	КоэффициентНаНачалоПериода = 1;
	КоэффициентНаТекущуюДатуРождения = 1;
	Для Каждого СтрокаШкалы Из ПараметрыРасчета.ШкалаВозрастов Цикл
		Если СтрокаШкалы.ЗначениеОт <= КоличествоЛетНаНачалоПериода
			И (СтрокаШкалы.ЗначениеДо >= КоличествоЛетНаНачалоПериода Или СтрокаШкалы.ЗначениеДо = 0) Тогда
				
			КоэффициентНаНачалоПериода = СтрокаШкалы.ЗначениеПоказателя;
		КонецЕсли;
		Если СтрокаШкалы.ЗначениеОт <= КоличествоЛетНаТекущуюДатуРождения
			И (СтрокаШкалы.ЗначениеДо >= КоличествоЛетНаТекущуюДатуРождения Или СтрокаШкалы.ЗначениеДо = 0) Тогда
			
			КоэффициентНаТекущуюДатуРождения = СтрокаШкалы.ЗначениеПоказателя;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоДнейПериода = (ПараметрыРасчета.ДатаОкончанияСтрахования - ПараметрыРасчета.ДатаНачалаСтрахования) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
	Если КоэффициентНаНачалоПериода <> КоэффициентНаТекущуюДатуРождения Тогда
		КоличествоДней = (ДеньРожденияТекущийГод - ПараметрыРасчета.ДатаНачала - ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах()) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаНачалоПериода;
		КоличествоДней = (ПараметрыРасчета.ДатаОкончания - ДеньРожденияТекущийГод) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = СтраховаяПремия + ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаТекущуюДатуРождения;
	Иначе
		КоличествоДней = (ПараметрыРасчета.ДатаОкончания - ПараметрыРасчета.ДатаНачала) / ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() + 1;
		СтраховаяПремия = ПараметрыРасчета.СтраховаяПремияСтрахователя / КоличествоДнейПериода * КоличествоДней * КоэффициентНаНачалоПериода;
	КонецЕсли;
	
	Возврат СтраховаяПремия;
	
КонецФункции

// Создает или выключает удержание за ДМС
//
Процедура СоздатьОтключитьУдержаниеЗаДМС(КоллекторУдержаний) Экспорт
	
	ОписаниеУдержания = ПланыВидовРасчета.Удержания.ОписаниеУдержания();
	
	ОписаниеУдержания.КатегорияУдержания	= Перечисления.КатегорииУдержаний.ДМС;
	ОписаниеУдержания.СпособВыполненияУдержания = Перечисления.СпособыВыполненияУдержаний.ЕжемесячноПриОкончательномРасчете;
	ОписаниеУдержания.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ДМС;
	ОписаниеУдержания.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками;
	
	ОписаниеУдержания.Код						= НСтр("ru = 'ДМС'");
	ОписаниеУдержания.Наименование				= НСтр("ru = 'Удержание за ДМС'");
	ОписаниеУдержания.КраткоеНаименование 		= НСтр("ru = 'За ДМС'");
	ОписаниеУдержания.ФормулаРасчета 			= "";
	ОписаниеУдержания.Рассчитывается 			= Ложь;

	Если ИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников() Тогда
		ПланыВидовРасчета.Удержания.СоздатьИзменитьУдержанияПоОписанию(КоллекторУдержаний, ОписаниеУдержания);
	Иначе
		ПланыВидовРасчета.Удержания.ОтключитьИспользованиеУдержания(КоллекторУдержаний, Перечисления.КатегорииУдержаний.ДМС);
	КонецЕсли;
	
	// Расставляем порядок для вновь созданных видов расчета.
	ПланыВидовРасчета.Удержания.ЗаполнитьПорядокУдержаний(КоллекторУдержаний);
	РасчетЗарплатыРасширенный.ЗаписатьПакетВидовРасчета(КоллекторУдержаний);
	
КонецПроцедуры

// Дополняет соответствие СвойстваПоКатегориям описанием категории ДМС.
//
Процедура ДополнитьСвойстваПоКатегориямУдержаниемПоДМС(СвойстваПоКатегориям, Описание) Экспорт

	Описание.Рассчитывается = Ложь;
	Описание.СпособВыполненияУдержания = Перечисления.СпособыВыполненияУдержаний.ЕжемесячноПриОкончательномРасчете;
	Описание.СпособРасчета = Перечисления.СпособыРасчетаУдержаний.ДМС;
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками;
	СвойстваПоКатегориям.Вставить(Перечисления.КатегорииУдержаний.ДМС, Описание);

КонецПроцедуры

Процедура РассчитатьУдержанияПоГрафику(СпособРасчета, СтрокиРасчета, Организация, МесяцНачисления, ДополнительныеСвойства) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособРасчета <> Перечисления.СпособыРасчетаУдержаний.ДМС Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОснованияФизическихЛиц = Новый ТаблицаЗначений;
	ДокументыОснованияФизическихЛиц.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДокументыОснованияФизическихЛиц.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(
		"ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования, ДокументСсылка.ИзменениеУсловийМедицинскогоСтрахования"));
	
	Для Каждого СтрокаРасчета Из СтрокиРасчета Цикл
		НоваяСтрока = ДокументыОснованияФизическихЛиц.Добавить();
		НоваяСтрока.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо;
		НоваяСтрока.ДокументОснование = СтрокаРасчета.ДокументОснование;
	КонецЦикла;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ФизическиеЛицаСУдержаниемПоГрафику = ФизическиеЛицаСУдержаниемПоГрафику(Организация, ДокументыОснованияФизическихЛиц, МенеджерВТ);
	
	Если ФизическиеЛицаСУдержаниемПоГрафику.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ГрафикУдержаний = ГрафикУдержаний(МесяцНачисления, МенеджерВТ, ДополнительныеСвойства);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "ФизическоеЛицо");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "ДокументОснование");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ГрафикУдержаний, "Удержание");
	
	СтрокиКПерерасчету = Новый Массив;
	Для Каждого СтрокаТаблицы Из СтрокиРасчета Цикл
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
		ОтборСтрок.Вставить("ДокументОснование", СтрокаТаблицы.ДокументОснование);
		СтрокиФизическихЛиц = ФизическиеЛицаСУдержаниемПоГрафику.НайтиСтроки(ОтборСтрок);
		Если СтрокиФизическихЛиц.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборСтрок.Вставить("Удержание", СтрокаТаблицы.Удержание);
		СтрокиУдержаний = ГрафикУдержаний.НайтиСтроки(ОтборСтрок);
		Если СтрокиУдержаний.Количество() = 0 Тогда
			СтрокаТаблицы.Результат = 0;
		Иначе
			Для Каждого СтрокаУдержания Из СтрокиУдержаний Цикл
				Если СтрокаТаблицы.ДатаНачала = СтрокаУдержания.Дата И СтрокаУдержания.КПерерасчету Тогда
					СтрокаТаблицы.Результат = СтрокаУдержания.Сумма;
					СтрокаУдержания.Сумма = 0;
					СтрокиКПерерасчету.Добавить(СтрокаТаблицы);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ГрафикУдержанийСводно = ГрафикУдержаний.Скопировать();
	ГрафикУдержанийСводно.Свернуть("ФизическоеЛицо, ДокументОснование, Удержание", "Сумма");
	
	Для Каждого СтрокаГрафика Из ГрафикУдержанийСводно Цикл
		МассивСтрок = Новый Массив;
		МассивКоэффициентов = Новый Массив;
		Для Каждого СтрокаРасчета Из СтрокиРасчета Цикл
			Если Не (СтрокаГрафика.ФизическоеЛицо = СтрокаРасчета.ФизическоеЛицо И СтрокаГрафика.ДокументОснование = СтрокаРасчета.ДокументОснование)
				Или СтрокиКПерерасчету.Найти(СтрокаРасчета) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			МассивСтрок.Добавить(СтрокаРасчета);
			МассивКоэффициентов.Добавить(ЗарплатаКадрыКлиентСервер.ДнейВПериоде(
				СтрокаРасчета.ДатаНачала, СтрокаРасчета.ДатаОкончания));
		КонецЦикла;
		КоличествоСтрок = МассивСтрок.Количество();
		Если КоличествоСтрок = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если КоличествоСтрок = 1 Тогда
			МассивСтрок[0].Результат = СтрокаГрафика.Сумма;
			Продолжить;
		КонецЕсли;
		СуммыСтрок = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаГрафика.Сумма, МассивКоэффициентов);
		Индекс = 0;
		Для Каждого СтрокаРасчета Из МассивСтрок Цикл
			СтрокаРасчета.Результат = ?(СуммыСтрок = Неопределено, 0, СуммыСтрок[Индекс]);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#Область ЗащитаПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ЗаполнитьСведенияОПерсональныхДанных.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ПрограммыСтрахования,Сотрудники.РасширенияПрограммСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховаяПремия,Сотрудники.СуммаУдержания,Сотрудники.СуммаПредела";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияСотрудников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Родственники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Родственники.ПрограммыСтрахования,Родственники.РасширенияПрограммСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Родственники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Родственники.СтраховаяПремия";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияРодственников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияРодственников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "СведенияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "СведенияСотрудников.СведениеЗначение";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "СведенияРодственников.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СведенияРодственников.СведениеЗначение";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДатаРождения,Сотрудники.ПрограммыСтрахования,Сотрудники.РасширенияПрограммСтрахования,Сотрудники.ДатаОткрепления";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховаяПремия";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "ПрограммыСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "ПрограммыСтрахованияСотрудников.ПрограммаСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования";
	НовыеСведения.ПоляРегистрации	= "РасширенияПрограммСтрахованияСотрудников.Сотрудник";
	НовыеСведения.ПоляДоступа		= "РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "МедицинскоеСтрахование";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("20bfa77a-4395-4d2d-a4e6-d32ceab316f0");
	Раздел.Представление = НСтр("ru = 'Медицинское страхование'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОткреплениеОтПрограммМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеУсловийМедицинскогоСтрахования",	"Дата", "МедицинскоеСтрахование", "Организация");

КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализУдержанийМедицинскогоСтрахования);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ИсторияРассылкиПолисовДМС);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование, "МедицинскоеСтрахование");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМедицинскоеСтрахованиеСотрудников");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.МедицинскоеСтрахование, "ПрограммыСтрахования");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМедицинскоеСтрахованиеСотрудников");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализУдержанийМедицинскогоСтрахования, "АнализУдержаний");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ИсторияРассылкиПолисовДМС, "ИсторияРассылкиПолисовДМС");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьМедицинскоеСтрахованиеСотрудников");
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования);
	СписокОбъектов.Добавить(Документы.ОткреплениеОтПрограммМедицинскогоСтрахования);
	СписокОбъектов.Добавить(Документы.ИзменениеУсловийМедицинскогоСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область РассылкаДокументов

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Команда = Команды.Добавить();
	Команда.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования");
	Команда.Представление = НСтр("ru = 'Рассылка заявлений на удержания за ДМС'");
	Команда.Назначение = РассылкаДокументов.ВидыНазначенияКомандыРассылки().ДляСписка;
	Команда.РежимЗаписи = РассылкаДокументов.РежимыЗаписиОбъектаПередВыполнениемКомандыРассылки().Проводить;
	Команда.ПечатныеФормы = РассылкаДокументовКлиентСервер.НоваяПечатнаяФорма();
	Команда.ПечатныеФормы.Идентификатор = "ЗаявлениеНаУдержание";
	Команда.ПечатныеФормы.ОбработчикПолученияДанных = 
		"Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗаявленияНаУдержание";
	Команда.ТемаПисьма = НСтр("ru = 'Заявление на удержание за ДМС'");
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	Команда.ТекстПисьма = 
		НСтр("ru = 'Добрый день!
			 |
			 |Во вложении заявление на удержание за ДМС.
			 |Пожалуйста, распечатайте его, поставьте свою подпись в обозначенных местах и пришлите нам фотографию или скан-копию в ответ на это письмо.
			 |
			 |С уважением, Администрация.'");
	// АПК:374-вкл

КонецПроцедуры

Функция ПолисыДМСКОтправке(ПолисыДМСКОтправке, Шаблон, УчетнаяЗапись) Экспорт
	
	ДлительныеОперации.СообщитьПрогресс(5);
	ОбработаноПолисовДМС = 0;
	КоличествоПолисовДМС = ПолисыДМСКОтправке.Количество();
	
	Для Каждого ДанныеПолисаДМС Из ПолисыДМСКОтправке Цикл
		
		ОбработаноПолисовДМС = ОбработаноПолисовДМС + 1;
		
		ДлительныеОперации.СообщитьПрогресс(ПрогрессОтправки(ОбработаноПолисовДМС, КоличествоПолисовДМС));
		
		Если Не ДанныеПолисаДМС.Отправлять Тогда
			Продолжить;
		КонецЕсли;	
		
		Попытка
			ОтправитьПолисДМС(ДанныеПолисаДМС, Шаблон, УчетнаяЗапись);
			ДанныеПолисаДМС.Отправлено = Истина;
		Исключение
			ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось отправить полис ДМС получателю %1: %2'"),
				 ДанныеПолисаДМС.ФИО, ИнформацияОбОшибке);
				 
			ДанныеПолисаДМС.ТекстОшибки = ТекстСообщения;	 
				 
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Рассылка полисов ДМС'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования, ДанныеПолисаДМС.Прикрепление, ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ПолисыДМСКОтправке;
	
КонецФункции

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.6.51";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("03829d6c-0ce7-4f9f-b7e8-b0297e2dd155");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДатыСтрахования";
	Обработчик.Комментарий = НСтр("ru = 'Обновление дат медицинского страхования работников и их родственников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.11.32";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("501817a4-2608-4aef-b3bd-1b01a9a6ad44");
	Обработчик.Процедура = "МедицинскоеСтрахование.СоздатьПоказателиМедицинскогоСтрахования";
	Обработчик.Комментарий = НСтр("ru = 'Обновление показателей расчета зарплаты.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.21.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c36bc56a-682e-4af1-94d2-650f933f71d8");
	Обработчик.Процедура = "МедицинскоеСтрахование.УстановитьИспользованиеУдержаний";
	Обработчик.Комментарий = НСтр("ru = 'Установка константы Использовать удержания в медицинском страховании сотрудников.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.21.14";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("193a9b24-597f-4e14-b968-d88c5051e934");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьСпособыУдержания";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение способов удержания в документах Прикрепления к программам страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("87761a6c-df4a-470f-adf6-733c8e28d334");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьОтправляемыеДанныеЗастрахованных";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек отправляемых данных застрахованных.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("464c68d8-efc2-4a52-866a-0329c6957596");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьОтправляемуюКонтактнуюИнформациюЗастрахованных";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек отправляемой контактной информации  застрахованных.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9080d1c9-edfb-4f30-9ba8-ba9105238f3d");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьРодственниковВДокументахПрикрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на родственников в документах Прикрепление к программам медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.6";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8d59082c-646d-4bf8-aa41-de538cee5e53");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьРодственниковВДокументахОткрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ссылок на родственников в документах Открепление от программ медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ec62c24a-05f0-49f6-a420-2f71519d86e2");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДанныеИКонтактнуюИнформациюЗастрахованныхВДокументахПрикрепления";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение данных и контактной информации в документах Прикрепление к программам медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9127dd2f-4540-4883-962e-11146f83e0a3");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьУсловияМедицинскогоСтрахованияИзПрикреплений";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистров сведений Программы медицинского страхования сотрудников и Расширения программ медицинского страхования сотрудников по данным документов прикреплений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.7";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("73af19de-267c-481b-b9c2-8cdbe4171745");
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьУсловияМедицинскогоСтрахованияИзОткреплений";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистров сведений Программы медицинского страхования сотрудников и Расширения программ медицинского страхования сотрудников по данным документов откреплений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.74";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьПрикреплениеВДокументахИзмененияУсловийМедицинскогоСтрахования";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("413b1af4-0f80-11ee-85ff-97919be0525b");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение прикреплений в документах изменения условий медицинского страхования.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.75";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьОснованияДляПерерасчетаУдержаний";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("413b1af5-0f80-11ee-85ff-97919be0525b");
	Обработчик.Комментарий = НСтр("ru = 'Добавление оснований для перерасчета удержаний за ДМС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.31";
	Обработчик.Процедура = "МедицинскоеСтрахование.ДобавитьРолиДоговоровСтрахованияВПользовательскиеПрофили";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.31";
	Обработчик.Процедура = "МедицинскоеСтрахование.СоздатьАктуальныеДоговорыСтрахования";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae9d79df-4016-11ee-863c-8241c66c6ffe");
	Обработчик.Комментарий = НСтр("ru = 'Создание актуальных договоров страхования по умолчанию.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.32";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДоговорыСтрахованияВДокументахДМС";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae9d79df-4017-11ee-863c-8241c66c6ffe");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение договоров страхования в документах ДМС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.32";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьДоговорыСтрахованияВРешенияхОбУвольнении";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ae9d79df-4018-11ee-863c-8241c66c6ffe");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение договоров страхования в решениях об увольнении.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.29.35";
	Обработчик.Процедура = "МедицинскоеСтрахование.ОбновитьСвойстваУдержанияЗаДМС";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9a5b9124-e687-11ee-8702-a3bfa9ec3410");
	Обработчик.Комментарий = НСтр("ru = 'Обновление свойств удержания за ДМС.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.34.24";
	Обработчик.Процедура = "МедицинскоеСтрахование.ДополнитьУдержанияМедицинскогоСтрахованияДанными";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0a9539f6-4c7c-4b77-99ae-828d5168526c");
	Обработчик.Комментарий = НСтр("ru = 'Дополнить удержания медицинского страхования данными по Договору страхования, суммами ужержания и частичного удержания.'");
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.35.6";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьСотрудниковВРегистреРешенияОбОткрепленииСотрудниковМедицинскогоСтрахования";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("602193d3-19da-4b0e-8f19-90515eb287db");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение регистра сведений РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования сотрудниками.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.35.6";
	Обработчик.Процедура = "МедицинскоеСтрахование.ЗаполнитьИзмерениеНомерПолисаВРегистреПолисыДМС";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e0fab76b-2b34-40b9-9d91-cb7fc3b229fe");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение измерения регистра сведений ПолисыДМС Номер полиса.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.7";
	Обработчик.Процедура = "МедицинскоеСтрахование.СформироватьШаблоныРассылокМедСтрахования";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("4fe34c1b-de79-45b2-bf3a-e0ed9921fb95");
	Обработчик.Комментарий = НСтр("ru = 'Создание шаблонов рассылок медицинского страхования.'");
		
КонецПроцедуры

Процедура ЗаполнитьДатыСтрахования(ПараметрыОбновления) Экспорт
	
	ОбновляемыеДокументы = ДатыСтрахованияОбновляемыеДокументы(ПараметрыОбновления);
	
	Если ОбновляемыеДокументы.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ВыполнитьЗаполнениеДатСтрахования(ПараметрыОбновления, ОбновляемыеДокументы)
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказателиМедицинскогоСтрахования(ПараметрыОбновления) Экспорт
	
	ПараметрыПланаВидовРасчета = РасчетЗарплатыРасширенный.ОписаниеПараметровПланаВидовРасчета();
	
	ИспользоватьМедицинскоеСтрахованиеСотрудников = Константы.ИспользоватьМедицинскоеСтрахованиеСотрудников.Получить();
	
	Если ИспользоватьМедицинскоеСтрахованиеСотрудников Тогда
		
		// Страховая премия
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "СтраховаяПремия";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Страховая премия'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Страховая премия'");
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя);
		
		// Количество дней периода страхования
		ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
		ОписаниеПоказателя.Идентификатор = "КоличествоДнейПериодаСтрахования";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Количество дней периода страхования'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = 'Дней страхования'");
		ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;
		ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
		ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Истина;
		Справочники.ПоказателиРасчетаЗарплаты.ЗаписатьПоказатель(ОписаниеПоказателя);
		
	Иначе
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("СтраховаяПремия");
		Справочники.ПоказателиРасчетаЗарплаты.ОтключитьИспользованиеПредопределенногоЭлемента("КоличествоДнейПериодаСтрахования");
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура УстановитьИспользованиеУдержаний(ПараметрыОбновления) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбработкаВыполнена = Истина;
	Если Не Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.Получить() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
			|ГДЕ
			|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Удержание <> ЗНАЧЕНИЕ(ПланВидовРасчета.Удержания.ПустаяСсылка)";
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			Возврат;
		КонецЕсли;
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Константа.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников", "", "") Тогда
			ОбработкаВыполнена = Ложь;
		Иначе
			МенеджерКонстанты = Константы.ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников.СоздатьМенеджерЗначения();
			МенеджерКонстанты.Значение = Истина;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерКонстанты);
			СоздатьОтключитьУдержаниеЗаДМС(Новый Соответствие);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаВыполнена);
	
КонецПроцедуры

Процедура ЗаполнитьСпособыУдержания(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Удержание <> ЗНАЧЕНИЕ(ПланВидовРасчета.Удержания.ПустаяСсылка)
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаСотрудник Из ДокументПрикрепление.Сотрудники Цикл
				СтрокаСотрудник.УдерживатьИзЗарплаты = Истина;
				СтрокаСотрудник.Удержание = ДокументПрикрепление.Удержание;
				Если СтрокаСотрудник.СуммаУдержания > 0 Тогда
					СтрокаСотрудник.СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно;
				Иначе
					СтрокаСотрудник.СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно;
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли
	
КонецПроцедуры

Процедура ЗаполнитьОтправляемыеДанныеЗастрахованных(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УсловияМедицинскогоСтрахования.Организация КАК Организация,
		|	УсловияМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.УдалитьУсловияМедицинскогоСтрахования КАК УсловияМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьОтправляемыеДанныеЗастрахованных КАК ОтправляемыеДанныеЗастрахованных
		|		ПО (УсловияМедицинскогоСтрахования.Организация = ОтправляемыеДанныеЗастрахованных.Организация)
		|		И (УсловияМедицинскогоСтрахования.СтраховаяКомпания = ОтправляемыеДанныеЗастрахованных.СтраховаяКомпания)
		|ГДЕ
		|	ОтправляемыеДанныеЗастрахованных.Организация ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.УдалитьОтправляемыеДанныеЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Выборка.СтраховаяКомпания);
		Для Каждого Сведение Из Перечисления.ДанныеЗастрахованных Цикл
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
			ЗаписьНабора.Сведение = Сведение;
			ЗаписьНабора.Отправлять = Истина;
			ЗаписьНабора.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтправляемуюКонтактнуюИнформациюЗастрахованных(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УсловияМедицинскогоСтрахования.Организация КАК Организация,
		|	УсловияМедицинскогоСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.УдалитьУсловияМедицинскогоСтрахования КАК УсловияМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УдалитьОтправляемаяКонтактнаяИнформацияЗастрахованных КАК ОтправляемаяКонтактнаяИнформацияЗастрахованных
		|		ПО УсловияМедицинскогоСтрахования.Организация = ОтправляемаяКонтактнаяИнформацияЗастрахованных.Организация
		|			И УсловияМедицинскогоСтрахования.СтраховаяКомпания = ОтправляемаяКонтактнаяИнформацияЗастрахованных.СтраховаяКомпания
		|ГДЕ
		|	ОтправляемаяКонтактнаяИнформацияЗастрахованных.Организация ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	МассивОтправляемойКИ = Новый Массив;
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	МассивОтправляемойКИ.Добавить(Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.УдалитьОтправляемаяКонтактнаяИнформацияЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Выборка.СтраховаяКомпания);
		Для Каждого КИ Из МассивОтправляемойКИ Цикл
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Выборка);
			ЗаписьНабора.Вид = КИ;
			ЗаписьНабора.Отправлять = Истина;
			ЗаписьНабора.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.НеПроверять;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРодственниковВДокументахПрикрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.СведенияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.РодственникСсылка = ЗНАЧЕНИЕ(Справочник.РодственникиФизическихЛиц.ПустаяСсылка)
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Родственник <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСведенияРодственников.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаРодственник Из ДокументПрикрепление.Родственники Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаРодственник.Родственник)) Тогда
					СтрокаРодственник.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаРодственник.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаПрограммыСтрахования Из ДокументПрикрепление.ПрограммыСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаПрограммыСтрахования.Родственник)) Тогда
					СтрокаПрограммыСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаПрограммыСтрахования.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаРасширениеПрограммСтрахования Из ДокументПрикрепление.РасширенияПрограммСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаРасширениеПрограммСтрахования.Родственник)) Тогда
					СтрокаРасширениеПрограммСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаРасширениеПрограммСтрахования.Родственник));
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаСведениеРодственника Из ДокументПрикрепление.СведенияРодственников Цикл
				Если ЗначениеЗаполнено(СокрЛП(СтрокаСведениеРодственника.Родственник)) Тогда
					СтрокаСведениеРодственника.РодственникСсылка = РодственникМедицинскогоСтрахования(СокрЛП(СтрокаСведениеРодственника.Родственник));
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРодственниковВДокументахОткрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.РодственникСсылка = ЗНАЧЕНИЕ(Справочник.РодственникиФизическихЛиц.ПустаяСсылка)
		|	И ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Родственник <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахованияРодственники.Ссылка.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОткрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СтрокаРодственник Из ДокументОткрепление.Родственники Цикл
				Если ЗначениеЗаполнено(СтрокаРодственник.Родственник) Тогда
					СтрокаРодственник.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаРодственник.Родственник);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаПрограммыСтрахования Из ДокументОткрепление.ПрограммыСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СтрокаПрограммыСтрахования.Родственник) Тогда
					СтрокаПрограммыСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаПрограммыСтрахования.Родственник);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаРасширениеПрограммСтрахования Из ДокументОткрепление.РасширенияПрограммСтрахованияРодственников Цикл
				Если ЗначениеЗаполнено(СтрокаРасширениеПрограммСтрахования.Родственник) Тогда
					СтрокаРасширениеПрограммСтрахования.РодственникСсылка = РодственникМедицинскогоСтрахования(СтрокаРасширениеПрограммСтрахования.Родственник);
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОткрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеИКонтактнуюИнформациюЗастрахованныхВДокументахПрикрепления(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный ЕСТЬ NULL
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахования.КраткийСоставДокумента <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Дата УБЫВ";
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументПрикрепление = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого СведениеСотрудника Из ДокументПрикрепление.СведенияСотрудников Цикл
				ОтборСтрок = Новый Структура("Сотрудник", СведениеСотрудника.Сотрудник);
				НайденнаяСтрока = ДокументПрикрепление.Сотрудники.НайтиСтроки(ОтборСтрок);
				Если НайденнаяСтрока.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				Застрахованный = НайденнаяСтрока[0].ФизическоеЛицо;
				Если ДанныеЗастрахованных()[СведениеСотрудника.СведениеИмя] Тогда
					ЗаполнитьДанныеЗастрахованного(Застрахованный, ДокументПрикрепление, СведениеСотрудника);
				Иначе
					ЗаполнитьКонтактнуюИнформациюЗастрахованного(Застрахованный, ДокументПрикрепление, СведениеСотрудника);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СведениеРодственника Из ДокументПрикрепление.СведенияРодственников Цикл
				Если ДанныеЗастрахованных()[СведениеРодственника.СведениеИмя] Тогда
					ЗаполнитьДанныеЗастрахованного(СведениеРодственника.РодственникСсылка, ДокументПрикрепление, СведениеРодственника);
				Иначе
					ЗаполнитьКонтактнуюИнформациюЗастрахованного(СведениеРодственника.РодственникСсылка, ДокументПрикрепление, СведениеРодственника);
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументПрикрепление);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияМедицинскогоСтрахованияИзПрикреплений(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Проведен = ИСТИНА
		|	И НЕ ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Дата УБЫВ";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Обработанные.Добавить(Выборка.Ссылка);
			ЗаполнитьПрограммыМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Выборка.Ссылка);
			ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Выборка.Ссылка);
		КонецЦикла;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияМедицинскогоСтрахованияИзОткреплений(ПараметрыОбновления) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ОткреплениеОтПрограммМедицинскогоСтрахования
		|ГДЕ
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Проведен = ИСТИНА
		|	И НЕ ОткреплениеОтПрограммМедицинскогоСтрахования.Ссылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОткреплениеОтПрограммМедицинскогоСтрахования.Дата УБЫВ";
	Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
		Обработанные = Новый Массив;
		ПараметрыОбновления.Вставить("Обработанные");
	ИначеЕсли ПараметрыОбновления.Обработанные = Неопределено Тогда
		Обработанные = Новый Массив;
	Иначе
		Обработанные = ПараметрыОбновления.Обработанные;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	Иначе
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Обработанные.Добавить(Выборка.Ссылка);
			ЗаполнитьПрограммыМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Выборка.Ссылка);
			ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Выборка.Ссылка);
		КонецЦикла;
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПрикреплениеВДокументахИзмененияУсловийМедицинскогоСтрахования(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ИзмененияУсловий.Ссылка КАК Ссылка,
		|	ИзмененияУсловий.Организация КАК Организация,
		|	ИзмененияУсловий.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзмененияУсловий.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ИзмененияУсловий.ДатаИзменения КАК ДатаИзменения,
		|	ИзмененияУсловий.Основание КАК Основание
		|ПОМЕСТИТЬ ВТДокументыИзмененияУсловий
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзмененияУсловий
		|ГДЕ
		|	НЕ ИзмененияУсловий.Ссылка В (&Обработанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументыИзмененияУсловий.Ссылка КАК Ссылка
		|ИЗ
		|	ВТДокументыИзмененияУсловий КАК ВТДокументыИзмененияУсловий";
	
	Обработанные = Новый Массив;
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	Иначе
		Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
			ПараметрыОбновления.Вставить("Обработанные");
		Иначе
			Обработанные = ПараметрыОбновления.Обработанные;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Обработанные, РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзмененияУсловий.Ссылка КАК Ссылка,
		|	ИзмененияУсловий.Организация КАК Организация,
		|	ИзмененияУсловий.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзмененияУсловий.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ИзмененияУсловий.ДатаИзменения КАК ДатаИзменения,
		|	ИзмененияУсловий.Основание КАК Основание,
		|	ИзмененияУсловийСотрудники.Сотрудник КАК Сотрудник,
		|	ИзмененияУсловийСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИзмененияУсловийСотрудники.ДатаПрикрепления КАК ДатаПрикрепления
		|ПОМЕСТИТЬ ВТИзмененияУсловий
		|ИЗ
		|	ВТДокументыИзмененияУсловий КАК ИзмененияУсловий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзмененияУсловийСотрудники
		|		ПО ИзмененияУсловий.Ссылка = ИзмененияУсловийСотрудники.Ссылка
		|ГДЕ
		|	ИзмененияУсловийСотрудники.Прикрепление = ЗНАЧЕНИЕ(Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прикрепление.Ссылка КАК Ссылка,
		|	Прикрепление.Организация КАК Организация,
		|	Прикрепление.СтраховаяКомпания КАК СтраховаяКомпания,
		|	Прикрепление.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	Прикрепление.Проведен КАК Проведен,
		|	Прикрепление.ПометкаУдаления КАК ПометкаУдаления,
		|	ПрикреплениеСотрудники.Сотрудник КАК Сотрудник,
		|	ПрикреплениеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеСотрудники.ДатаПрикрепления КАК ДатаПрикрепления
		|ПОМЕСТИТЬ ВТПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК Прикрепление
		|		ПО ПрикреплениеСотрудники.Ссылка = Прикрепление.Ссылка
		|ГДЕ
		|	(Прикрепление.Организация, Прикрепление.СтраховаяКомпания, Прикрепление.ДатаНачалаСтрахования, ПрикреплениеСотрудники.Сотрудник, ПрикреплениеСотрудники.ДатаПрикрепления) В
		|			(ВЫБРАТЬ
		|				ИзмененияУсловий.Организация,
		|				ИзмененияУсловий.СтраховаяКомпания,
		|				ИзмененияУсловий.ДатаНачалаСтрахования,
		|				ИзмененияУсловий.Сотрудник,
		|				ИзмененияУсловий.ДатаПрикрепления
		|			ИЗ
		|				ВТИзмененияУсловий КАК ИзмененияУсловий)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	ИзмененияУсловий.Организация КАК Организация,
		|	ИзмененияУсловий.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ИзмененияУсловий.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ИзмененияУсловий.Сотрудник КАК Сотрудник,
		|	ИзмененияУсловий.Основание КАК Прикрепление
		|ПОМЕСТИТЬ ВТПрикрепленияДляИзмененийУсловийСтрахования
		|ИЗ
		|	ВТИзмененияУсловий КАК ИзмененияУсловий
		|ГДЕ
		|	ИзмененияУсловий.Основание <> ЗНАЧЕНИЕ(Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	Прикрепления.Организация,
		|	Прикрепления.СтраховаяКомпания,
		|	Прикрепления.ДатаНачалаСтрахования,
		|	Прикрепления.Сотрудник,
		|	Прикрепления.Ссылка
		|ИЗ
		|	ВТПрикрепления КАК Прикрепления
		|ГДЕ
		|	Прикрепления.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	Прикрепления.Организация,
		|	Прикрепления.СтраховаяКомпания,
		|	Прикрепления.ДатаНачалаСтрахования,
		|	Прикрепления.Сотрудник,
		|	Прикрепления.Ссылка
		|ИЗ
		|	ВТПрикрепления КАК Прикрепления
		|ГДЕ
		|	НЕ Прикрепления.Проведен
		|	И НЕ Прикрепления.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4,
		|	Прикрепления.Организация,
		|	Прикрепления.СтраховаяКомпания,
		|	Прикрепления.ДатаНачалаСтрахования,
		|	Прикрепления.Сотрудник,
		|	Прикрепления.Ссылка
		|ИЗ
		|	ВТПрикрепления КАК Прикрепления
		|ГДЕ
		|	НЕ Прикрепления.Проведен
		|	И Прикрепления.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрикрепленияДляИзмененийУсловийСтрахования.Организация КАК Организация,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.Сотрудник КАК Сотрудник,
		|	МИНИМУМ(ПрикрепленияДляИзмененийУсловийСтрахования.Приоритет) КАК Приоритет
		|ПОМЕСТИТЬ ВТПрикрепленияДляИзмененийУсловийСтрахованияМинимальныйПриоритет
		|ИЗ
		|	ВТПрикрепленияДляИзмененийУсловийСтрахования КАК ПрикрепленияДляИзмененийУсловийСтрахования
		|
		|СГРУППИРОВАТЬ ПО
		|	ПрикрепленияДляИзмененийУсловийСтрахования.Организация,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.СтраховаяКомпания,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.ДатаНачалаСтрахования,
		|	ПрикрепленияДляИзмененийУсловийСтрахования.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрикрепленияДляИзменений.Организация КАК Организация,
		|	ПрикрепленияДляИзменений.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ПрикрепленияДляИзменений.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ПрикрепленияДляИзменений.Сотрудник КАК Сотрудник,
		|	ПрикрепленияДляИзменений.Прикрепление КАК Прикрепление
		|ПОМЕСТИТЬ ВТПрикрепленияДляИзмененийУсловийСтрахованияПредварительно
		|ИЗ
		|	ВТПрикрепленияДляИзмененийУсловийСтрахования КАК ПрикрепленияДляИзменений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрикрепленияДляИзмененийУсловийСтрахованияМинимальныйПриоритет КАК МинимальныйПриоритет
		|		ПО (МинимальныйПриоритет.Организация = ПрикрепленияДляИзменений.Организация)
		|			И (МинимальныйПриоритет.СтраховаяКомпания = ПрикрепленияДляИзменений.СтраховаяКомпания)
		|			И (МинимальныйПриоритет.ДатаНачалаСтрахования = ПрикрепленияДляИзменений.ДатаНачалаСтрахования)
		|			И (МинимальныйПриоритет.Сотрудник = ПрикрепленияДляИзменений.Сотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзмененияУсловий.Ссылка КАК Ссылка,
		|	ИзмененияУсловий.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ПрикрепленияДляИзменений.Прикрепление) КАК Прикрепление
		|ИЗ
		|	ВТИзмененияУсловий КАК ИзмененияУсловий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрикрепленияДляИзмененийУсловийСтрахованияПредварительно КАК ПрикрепленияДляИзменений
		|		ПО ИзмененияУсловий.Организация = ПрикрепленияДляИзменений.Организация
		|			И ИзмененияУсловий.СтраховаяКомпания = ПрикрепленияДляИзменений.СтраховаяКомпания
		|			И ИзмененияУсловий.Сотрудник = ПрикрепленияДляИзменений.Сотрудник
		|			И ИзмененияУсловий.ДатаИзменения >= ПрикрепленияДляИзменений.ДатаНачалаСтрахования
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзмененияУсловий.Ссылка,
		|	ИзмененияУсловий.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|ИТОГИ ПО
		|	Ссылка";
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		Если Не ОбновлениеИБ.ПодготовитьОбновлениеДанных(
			ПараметрыОбновления, "Документ.ИзменениеУсловийМедицинскогоСтрахования", "Ссылка", ВыборкаСсылка.Ссылка) Тогда
			
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
		Выборка = ВыборкаСсылка.Выбрать();
		Пока Выборка.Следующий() Цикл
			Для Каждого ДанныеСотрудника Из ДокументОбъект.Сотрудники Цикл
				Если Не Выборка.Сотрудник = ДанныеСотрудника.Сотрудник Тогда
					Продолжить;
				КонецЕсли;
				ДанныеСотрудника.Прикрепление = Выборка.Прикрепление;
				Прервать;
			КонецЦикла;
		КонецЦикла;
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеФормироватьПредварительныеПерерасчетыПриЗаписи", Истина);
		
		РежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, Неопределено);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Истина, Истина, РежимЗаписи);
		
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ЗарплатаКадры.ОсвободитьМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ЗаполнитьОснованияДляПерерасчетаУдержаний(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КатегорияУдержания", Перечисления.КатегорииУдержаний.ДМС);
	Запрос.УстановитьПараметр("СпособРасчета", Перечисления.СпособыРасчетаУдержаний.ДМС);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 300
		|	ПерерасчетУдержаний.Организация КАК Организация,
		|	ПерерасчетУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПерерасчетУдержаний.ПериодДействия КАК ПериодДействия,
		|	ПерерасчетУдержаний.Удержание КАК Удержание,
		|	ПерерасчетУдержаний.ДокументНачисления КАК ДокументНачисления
		|ПОМЕСТИТЬ ВТПерерасчетУдержаний
		|ИЗ
		|	РегистрСведений.ПерерасчетУдержаний КАК ПерерасчетУдержаний
		|ГДЕ
		|	ПерерасчетУдержаний.ДокументОснование = НЕОПРЕДЕЛЕНО
		|	И ПерерасчетУдержаний.Удержание.КатегорияУдержания = &КатегорияУдержания
		|	И ПерерасчетУдержаний.Удержание.СпособРасчета = &СпособРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПерерасчетУдержаний.Организация КАК Организация,
		|	ПерерасчетУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПерерасчетУдержаний.ПериодДействия КАК ПериодДействия,
		|	ПерерасчетУдержаний.Удержание КАК Удержание,
		|	ПерерасчетУдержаний.ДокументНачисления КАК ДокументНачисления,
		|	Удержания.ДокументОснование КАК ДокументОснование,
		|	Удержания.ДокументОснование КАК Основание
		|ПОМЕСТИТЬ ВТПерерасчетыСОснованиями
		|ИЗ
		|	ВТПерерасчетУдержаний КАК ПерерасчетУдержаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК Удержания
		|		ПО ПерерасчетУдержаний.Организация = Удержания.Организация
		|		И ПерерасчетУдержаний.ФизическоеЛицо = Удержания.ФизическоеЛицо
		|		И ПерерасчетУдержаний.ПериодДействия = Удержания.ПериодРегистрации
		|		И ПерерасчетУдержаний.ДокументНачисления = Удержания.Регистратор
		|		И ПерерасчетУдержаний.Удержание = Удержания.ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПерерасчетыСОснованиями.Организация,
		|	ПерерасчетыСОснованиями.ФизическоеЛицо,
		|	ПерерасчетыСОснованиями.ПериодДействия,
		|	ПерерасчетыСОснованиями.Удержание,
		|	ПерерасчетыСОснованиями.ДокументНачисления,
		|	ЕСТЬNULL(ИзменениеУсловий.Прикрепление, ПерерасчетыСОснованиями.ДокументОснование) КАК ДокументОснование,
		|	ПерерасчетыСОснованиями.Основание
		|ИЗ
		|	ВТПерерасчетыСОснованиями КАК ПерерасчетыСОснованиями
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловий
		|		ПО ПерерасчетыСОснованиями.ДокументОснование = ИзменениеУсловий.Ссылка
		|		И ПерерасчетыСОснованиями.ФизическоеЛицо = ИзменениеУсловий.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредварительныеПерерасчеты.РегистраторПерерасчета,
		|	ПредварительныеПерерасчеты.Организация,
		|	ПредварительныеПерерасчеты.ПериодПерерасчета,
		|	ПредварительныеПерерасчеты.ВладелецПерерасчета,
		|	ПредварительныеПерерасчеты.ТипИзменения,
		|	ПредварительныеПерерасчеты.ИзмененныеДанные,
		|	ПредварительныеПерерасчеты.ДокументОснование,
		|	ПредварительныеПерерасчеты.НачалоУчета
		|ИЗ
		|	РегистрСведений.ПредварительныеПерерасчеты КАК ПредварительныеПерерасчеты
		|ГДЕ
		|	ПредварительныеПерерасчеты.ДокументОснование = НЕОПРЕДЕЛЕНО
		|	И ПредварительныеПерерасчеты.РегистраторПерерасчета = НЕОПРЕДЕЛЕНО";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.ПредварительныеПерерасчеты));
	ОписаниеДанных.Добавить(ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.ПерерасчетУдержаний));
	ОписаниеДанных.Добавить(ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.РегистрыРасчета.Удержания));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаПерерасчетУдержаний = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1];
	РезультатЗапросаПредварительныеПерерасчеты = РезультатыЗапроса[РезультатыЗапроса.ВГраница()];
	Если РезультатЗапросаПерерасчетУдержаний.Пустой() И РезультатЗапросаПредварительныеПерерасчеты.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = РезультатЗапросаПерерасчетУдержаний.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПерерасчетУдержаний.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Отбор.ПериодДействия.Установить(Выборка.ПериодДействия);
		НаборЗаписей.Отбор.Удержание.Установить(Выборка.Удержание);
		НаборЗаписей.Отбор.ДокументНачисления.Установить(Выборка.ДокументНачисления);
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	Выборка = РезультатЗапросаПредварительныеПерерасчеты.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ПредварительныеПерерасчеты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РегистраторПерерасчета.Установить(Выборка.РегистраторПерерасчета);
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.ПериодПерерасчета.Установить(Выборка.ПериодПерерасчета);
		НаборЗаписей.Отбор.ВладелецПерерасчета.Установить(Выборка.ВладелецПерерасчета);
		НаборЗаписей.Отбор.ТипИзменения.Установить(Выборка.ТипИзменения);
		НаборЗаписей.Отбор.ИзмененныеДанные.Установить(Выборка.ИзмененныеДанные);
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Отбор.НачалоУчета.Установить(Выборка.НачалоУчета);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	КонецЦикла;
	
	ЗарплатаКадры.ОсвободитьМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

// Добавляет роли договоров страхования в непоставляемые (пользовательские) профили групп доступа.
//
// Параметры:
//   ПараметрыОбновления - Структура - Параметры отложенного обновления.
//
Процедура ДобавитьРолиДоговоровСтрахованияВПользовательскиеПрофили() Экспорт
	
	ЗаменяемыеРоли = Новый Соответствие;
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.ДобавлениеИзменениеМедицинскогоСтрахования.Имя);
	НовыеРоли.Добавить(Метаданные.Роли.ДобавлениеИзменениеДоговоровСтрахования.Имя);
	ЗаменяемыеРоли.Вставить("ДобавлениеИзменениеМедицинскогоСтрахования", НовыеРоли);
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.ЧтениеМедицинскогоСтрахования.Имя);
	НовыеРоли.Добавить(Метаданные.Роли.ЧтениеДоговоровСтрахования.Имя);
	ЗаменяемыеРоли.Вставить("ЧтениеМедицинскогоСтрахования", НовыеРоли);
	
	УправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);
	
КонецПроцедуры

Процедура СоздатьАктуальныеДоговорыСтрахования(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдалитьУсловияМедицинскогоСтрахования.Организация,
		|	УдалитьУсловияМедицинскогоСтрахования.СтраховаяКомпания,
		|	УдалитьУсловияМедицинскогоСтрахования.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком,
		|	УдалитьУсловияМедицинскогоСтрахования.СдвигДатыПрикрепления,
		|	УдалитьУсловияМедицинскогоСтрахования.НачалоПериодаСтрахования КАК ДатаНачалаСтрахования,
		|	УдалитьУсловияМедицинскогоСтрахования.ОкончаниеПериодаСтрахования КАК ДатаОкончанияСтрахования,
		|	УдалитьУсловияМедицинскогоСтрахования.ИспользуютсяРасширенияПрограмм
		|ИЗ
		|	РегистрСведений.УдалитьУсловияМедицинскогоСтрахования КАК УдалитьУсловияМедицинскогоСтрахования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыСтрахования КАК ДоговорыСтрахования
		|		ПО УдалитьУсловияМедицинскогоСтрахования.Организация = ДоговорыСтрахования.Организация
		|		И УдалитьУсловияМедицинскогоСтрахования.СтраховаяКомпания = ДоговорыСтрахования.Владелец
		|ГДЕ
		|	ДоговорыСтрахования.Организация ЕСТЬ NULL";
	
	РезультатОбновляемыхДанных = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если РезультатОбновляемыхДанных.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	ВыборкаОбновляемыхДанных = Обработки.ОбходКоллекции.НовыйОбход(РезультатОбновляемыхДанных.Выгрузить());
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		ПараметрыДоговора = ВыборкаОбновляемыхДанных.ТекущиеДанные();
		ДоговорСтрахования = ДоговорСтрахованияПоПараметрам(ПараметрыДоговора, Сегодня, Истина);
		
		ЗаполнитьНовыйРегистрСведенийНаОснованииУдаленного("ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных",
			ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания, ДоговорСтрахования);
		ЗаполнитьНовыйРегистрСведенийНаОснованииУдаленного("ИзменениеОтправленныхДанныхЗастрахованных",
			ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания, ДоговорСтрахования);
		ЗаполнитьНовыйРегистрСведенийНаОснованииУдаленного("ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных",
			ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания, ДоговорСтрахования);
		ЗаполнитьНовыйРегистрСведенийНаОснованииУдаленного("ОтложенноеМедицинскоеСтрахованиеСотрудников",
			ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания, ДоговорСтрахования);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДоговорыСтрахованияВДокументахДМС(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыСтрахования.ПустаяСсылка());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация КАК Организация,
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования) КАК Документ,
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования).СтраховаяКомпания КАК СтраховаяКомпания,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования).ДатаНачалаСтрахования = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования).ДатаНачалаСтрахования < ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|			ТОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|				Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования).ДатаНачалаСтрахования
		|		ИНАЧЕ ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|	КОНЕЦ КАК ДатаНачалаСтрахования,
		|	ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо КАК ДатаОкончанияСтрахования
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор
		|		ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования
		|	И ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования).ДоговорСтрахования = &ПустойДоговор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация,
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ИзменениеУсловийМедицинскогоСтрахования),
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ИзменениеУсловийМедицинскогоСтрахования).СтраховаяКомпания,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ИзменениеУсловийМедицинскогоСтрахования).ДатаНачалаСтрахования = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ИзменениеУсловийМедицинскогоСтрахования).ДатаНачалаСтрахования < ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|			ТОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|				Документ.ИзменениеУсловийМедицинскогоСтрахования).ДатаНачалаСтрахования
		|		ИНАЧЕ ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ИзменениеУсловийМедицинскогоСтрахования).ДатаОкончанияСтрахования > ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо
		|			ТОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|				Документ.ИзменениеУсловийМедицинскогоСтрахования).ДатаОкончанияСтрахования
		|		ИНАЧЕ ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор ССЫЛКА Документ.ИзменениеУсловийМедицинскогоСтрахования
		|	И ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ИзменениеУсловийМедицинскогоСтрахования).ДоговорСтрахования = &ПустойДоговор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация,
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ОткреплениеОтПрограммМедицинскогоСтрахования),
		|	ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).СтраховаяКомпания,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДатаНачалаСтрахования = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДатаНачалаСтрахования < ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|			ТОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|				Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДатаНачалаСтрахования
		|		ИНАЧЕ ПрограммыМедицинскогоСтрахованияСотрудников.Период
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|			Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДатаОкончанияСтрахования > ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо
		|			ТОГДА ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|				Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДатаОкончанияСтрахования
		|		ИНАЧЕ ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования
		|	И ВЫРАЗИТЬ(ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор КАК
		|		Документ.ОткреплениеОтПрограммМедицинскогоСтрахования).ДоговорСтрахования = &ПустойДоговор
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументы.Организация КАК Организация,
		|	ВТДокументы.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МИНИМУМ(ВТДокументы.ДатаНачалаСтрахования) КАК ДатаНачалаСтрахования,
		|	ВТДокументы.ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования
		|ПОМЕСТИТЬ ВТДанныеДляДоговоров
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|СГРУППИРОВАТЬ ПО
		|	ВТДокументы.Организация,
		|	ВТДокументы.ДатаОкончанияСтрахования,
		|	ВТДокументы.СтраховаяКомпания
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДоговорыСтрахования.Организация,
		|	ДоговорыСтрахования.Владелец,
		|	ДоговорыСтрахования.ДатаНачалаСтрахования,
		|	ДоговорыСтрахования.ДатаОкончанияСтрахования
		|ИЗ
		|	Справочник.ДоговорыСтрахования КАК ДоговорыСтрахования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроведенныеДокументы.Документ КАК Документ,
		|	ВЫБОР
		|		КОГДА ПроведенныеДокументы.Документ ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПроведенноеПрикрепление,
		|	ДанныеДляДоговоров.Организация КАК Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования КАК ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования
		|ПОМЕСТИТЬ ВТДокументыДоговорыПредварительно
		|ИЗ
		|	ВТДокументы КАК ПроведенныеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ПроведенныеДокументы.Организация = ДанныеДляДоговоров.Организация
		|		И ПроведенныеДокументы.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И (ПроведенныеДокументы.ДатаНачалаСтрахования >= ДанныеДляДоговоров.ДатаНачалаСтрахования)
		|		И (ПроведенныеДокументы.ДатаОкончанияСтрахования <= ДанныеДляДоговоров.ДатаОкончанияСтрахования)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ДокументПрикрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|			ПрикреплениеПрограммыСтрахованияСотрудников
		|		ПО (ДокументПрикрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументПрикрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|		И ДокументПрикрепление.Ссылка = ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументПрикрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументПрикрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И (ПрикреплениеПрограммыСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования)
		|		И (ПрикреплениеПрограммыСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ДокументПрикрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК
		|			ПрикреплениеРасширенияПрограммСтрахованияСотрудников
		|		ПО (ДокументПрикрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументПрикрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|		И ДокументПрикрепление.Ссылка = ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументПрикрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументПрикрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ПрикреплениеРасширенияПрограммСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ПрикреплениеРасширенияПрограммСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеПрограммыСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ДокументПрикрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|			ПрикреплениеПрограммыСтрахованияРодственников
		|		ПО (ДокументПрикрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументПрикрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|		И ДокументПрикрепление.Ссылка = ПрикреплениеПрограммыСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументПрикрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументПрикрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ПрикреплениеПрограммыСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ПрикреплениеПрограммыСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ДокументПрикрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК
		|			ПрикреплениеРасширенияПрограммСтрахованияРодственников
		|		ПО (ДокументПрикрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументПрикрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования)
		|		И ДокументПрикрепление.Ссылка = ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументПрикрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументПрикрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ПрикреплениеРасширенияПрограммСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И
		|			ПрикреплениеРасширенияПрограммСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеПрограммыСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ДокументИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|			ИзменениеПрограммыСтрахованияСотрудников
		|		ПО (ДокументИзменение.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументИзменение.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ИзменениеУсловийМедицинскогоСтрахования)
		|		И ДокументИзменение.Ссылка = ИзменениеПрограммыСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументИзменение.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументИзменение.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ИзменениеПрограммыСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ИзменениеПрограммыСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеРасширенияПрограммСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ДокументИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК
		|			ИзменениеРасширенияПрограммСтрахованияСотрудников
		|		ПО (ДокументИзменение.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументИзменение.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ИзменениеУсловийМедицинскогоСтрахования)
		|		И ДокументИзменение.Ссылка = ИзменениеРасширенияПрограммСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументИзменение.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументИзменение.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ИзменениеРасширенияПрограммСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ИзменениеРасширенияПрограммСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеПрограммыСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ДокументИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|			ИзменениеПрограммыСтрахованияРодственников
		|		ПО (ДокументИзменение.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументИзменение.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ИзменениеУсловийМедицинскогоСтрахования)
		|		И ДокументИзменение.Ссылка = ИзменениеПрограммыСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументИзменение.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументИзменение.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ИзменениеПрограммыСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ИзменениеПрограммыСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеРасширенияПрограммСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ДокументИзменение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК
		|			ИзменениеРасширенияПрограммСтрахованияРодственников
		|		ПО (ДокументИзменение.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументИзменение.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ИзменениеУсловийМедицинскогоСтрахования)
		|		И ДокументИзменение.Ссылка = ИзменениеРасширенияПрограммСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументИзменение.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументИзменение.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ИзменениеРасширенияПрограммСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ИзменениеРасширенияПрограммСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОткреплениеПрограммыСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ДокументОткрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|			ОткреплениеПрограммыСтрахованияСотрудников
		|		ПО (ДокументОткрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументОткрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
		|		И ДокументОткрепление.Ссылка = ОткреплениеПрограммыСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументОткрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументОткрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ОткреплениеПрограммыСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ОткреплениеПрограммыСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ДокументОткрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК
		|			ОткреплениеРасширенияПрограммСтрахованияСотрудников
		|		ПО (ДокументОткрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументОткрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
		|		И ДокументОткрепление.Ссылка = ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументОткрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументОткрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ОткреплениеРасширенияПрограммСтрахованияСотрудников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ОткреплениеРасширенияПрограммСтрахованияСотрудников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОткреплениеПрограммыСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ДокументОткрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|			ОткреплениеПрограммыСтрахованияРодственников
		|		ПО (ДокументОткрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументОткрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
		|		И ДокументОткрепление.Ссылка = ОткреплениеПрограммыСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументОткрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументОткрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ОткреплениеПрограммыСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ОткреплениеПрограммыСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка,
		|	ЛОЖЬ,
		|	ДанныеДляДоговоров.Организация,
		|	ДанныеДляДоговоров.СтраховаяКомпания,
		|	ДанныеДляДоговоров.ДатаНачалаСтрахования,
		|	ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ДокументОткрепление
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|			Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК
		|			ОткреплениеРасширенияПрограммСтрахованияРодственников
		|		ПО (ДокументОткрепление.ДоговорСтрахования = &ПустойДоговор)
		|		И НЕ ДокументОткрепление.Ссылка В
		|			(ВЫБРАТЬ
		|				ПроведенныеДокументы.Документ
		|			ИЗ
		|				ВТДокументы КАК ПроведенныеДокументы
		|			ГДЕ
		|				ПроведенныеДокументы.Документ ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
		|		И ДокументОткрепление.Ссылка = ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДляДоговоров КАК ДанныеДляДоговоров
		|		ПО ДокументОткрепление.Организация = ДанныеДляДоговоров.Организация
		|		И ДокументОткрепление.СтраховаяКомпания = ДанныеДляДоговоров.СтраховаяКомпания
		|		И ОткреплениеРасширенияПрограммСтрахованияРодственников.ДатаНачала >= ДанныеДляДоговоров.ДатаНачалаСтрахования
		|		И ОткреплениеРасширенияПрограммСтрахованияРодственников.ДатаОкончания <= ДанныеДляДоговоров.ДатаОкончанияСтрахования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыДоговорыПредварительно.Документ КАК Документ,
		|	МИНИМУМ(ДокументыДоговорыПредварительно.ДатаОкончанияСтрахования) КАК ДатаОкончанияСтрахования,
		|	МАКСИМУМ(ДоговорыСтрахования.Ссылка) КАК ДоговорСтрахования
		|ПОМЕСТИТЬ ВТДокументыДоговорыМинимальнаяДатаОкончания
		|ИЗ
		|	ВТДокументыДоговорыПредварительно КАК ДокументыДоговорыПредварительно
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыСтрахования КАК ДоговорыСтрахования
		|		ПО ДокументыДоговорыПредварительно.Организация = ДоговорыСтрахования.Организация
		|		И ДокументыДоговорыПредварительно.СтраховаяКомпания = ДоговорыСтрахования.Владелец
		|		И ДокументыДоговорыПредварительно.ДатаНачалаСтрахования = ДоговорыСтрахования.ДатаНачалаСтрахования
		|		И ДокументыДоговорыПредварительно.ДатаОкончанияСтрахования = ДоговорыСтрахования.ДатаОкончанияСтрахования
		|СГРУППИРОВАТЬ ПО
		|	ДокументыДоговорыПредварительно.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДокументыДоговорыПредварительно.Документ КАК Документ,
		|	ДокументыДоговорыПредварительно.ЭтоПроведенноеПрикрепление КАК ЭтоПроведенноеПрикрепление,
		|	ДокументыДоговорыПредварительно.Организация КАК Организация,
		|	ДокументыДоговорыПредварительно.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МИНИМУМ(ДокументыДоговорыПредварительно.ДатаНачалаСтрахования) КАК ДатаНачалаСтрахования,
		|	ДокументыДоговорыПредварительно.ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования,
		|	ДокументыДоговорыМинимальнаяДатаОкончания.ДоговорСтрахования КАК ДоговорСтрахования
		|ИЗ
		|	ВТДокументыДоговорыПредварительно КАК ДокументыДоговорыПредварительно
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыДоговорыМинимальнаяДатаОкончания КАК ДокументыДоговорыМинимальнаяДатаОкончания
		|		ПО ДокументыДоговорыПредварительно.Документ = ДокументыДоговорыМинимальнаяДатаОкончания.Документ
		|		И
		|			ДокументыДоговорыПредварительно.ДатаОкончанияСтрахования = ДокументыДоговорыМинимальнаяДатаОкончания.ДатаОкончанияСтрахования
		|СГРУППИРОВАТЬ ПО
		|	ДокументыДоговорыПредварительно.Документ,
		|	ДокументыДоговорыПредварительно.ЭтоПроведенноеПрикрепление,
		|	ДокументыДоговорыПредварительно.Организация,
		|	ДокументыДоговорыПредварительно.СтраховаяКомпания,
		|	ДокументыДоговорыПредварительно.ДатаОкончанияСтрахования,
		|	ДокументыДоговорыМинимальнаяДатаОкончания.ДоговорСтрахования
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	СтраховаяКомпания,
		|	ДатаНачалаСтрахования,
		|	ДатаОкончанияСтрахования,
		|	ЭтоПроведенноеПрикрепление УБЫВ";
	
	РезультатОбновляемыхДанных = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если РезультатОбновляемыхДанных.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Сегодня = НачалоДня(ТекущаяДатаСеанса());
	ВыборкаОбновляемыхДанных = Обработки.ОбходКоллекции.НовыйОбход(РезультатОбновляемыхДанных.Выгрузить());
	Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("Организация") Цикл
		Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("СтраховаяКомпания") Цикл
			Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("ДатаНачалаСтрахования") Цикл
				Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("ДатаОкончанияСтрахования") Цикл
					ДоговорСтрахования = Неопределено;
					Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("ЭтоПроведенноеПрикрепление") Цикл
						Если ДоговорСтрахования = Неопределено Тогда
							ДоговорСтрахования = ДоговорСтрахованияПоПараметрам(ВыборкаОбновляемыхДанных.ТекущиеДанные(), Сегодня);
						КонецЕсли;
						Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
							ТекущиеДанные = ВыборкаОбновляемыхДанных.ТекущиеДанные();
							ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(ТекущиеДанные.Документ.Метаданные());
							ОписаниеБлокировки.ПоляБлокировки.Ссылка = ТекущиеДанные.Документ;
							Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
								Продолжить;
							КонецЕсли;
							ДокументОбъект = ТекущиеДанные.Документ.ПолучитьОбъект();
							ДокументОбъект.ДоговорСтрахования = ДоговорСтрахования;
							ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить(
								"НеФормироватьПредварительныеПерерасчетыПриЗаписи", Истина);
							ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДействующиеПрикрепления", Истина);
							
							ПровестиДокумент = ДокументОбъект.Проведен;
							Если ПровестиДокумент И ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПрикреплениеКПрограммамМедицинскогоСтрахования") Тогда
								СведенияОбИсправлении = ИсправлениеДокументовЗарплатаКадры.СведенияОбИсправленииДокумента(ТекущиеДанные.Документ);
								ПровестиДокумент = Не (СведенияОбИсправлении.Исправлен Или СведенияОбИсправлении.Сторнирован);
							КонецЕсли;
							
							РежимЗаписи = ?(ПровестиДокумент, РежимЗаписиДокумента.Проведение, Неопределено);
							ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Истина, Истина, РежимЗаписи);
							ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗарплатаКадры.ОсвободитьМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ЗаполнитьДоговорыСтрахованияВРешенияхОбУвольнении(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойДоговор", Справочники.ДоговорыСтрахования.ПустаяСсылка());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ДокументРешениеОбУвольнении.Ссылка КАК Ссылка,
		|	ДокументРешениеОбУвольнении.Организация КАК Организация,
		|	ДокументРешениеОбУвольнении.ДатаУвольнения КАК ДатаУвольнения,
		|	ДокументРешениеОбУвольнении.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументРешениеОбУвольнении.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТРешенияОбУвольнении
		|ИЗ
		|	Документ.РешениеОбУвольнении.ДанныеМедицинскогоСтрахования КАК РешениеОбУвольненииДанныеМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОбУвольнении КАК ДокументРешениеОбУвольнении
		|		ПО РешениеОбУвольненииДанныеМедицинскогоСтрахования.Ссылка = ДокументРешениеОбУвольнении.Ссылка
		|ГДЕ
		|	РешениеОбУвольненииДанныеМедицинскогоСтрахования.ДоговорСтрахования = &ПустойДоговор
		|	И НЕ ДокументРешениеОбУвольнении.Ссылка В (&Обработанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	ДокументРешениеОбУвольнении.Ссылка КАК Документ,
		|	РешениеОбУвольненииДанныеМедицинскогоСтрахования.УдалитьСтраховаяКомпания КАК СтраховаяКомпания,
		|	СправочникДоговорыСтрахования.Ссылка КАК ДоговорСтрахования
		|ПОМЕСТИТЬ ВТПодобранныеДоговоры
		|ИЗ
		|	Документ.РешениеОбУвольнении.ДанныеМедицинскогоСтрахования КАК РешениеОбУвольненииДанныеМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРешенияОбУвольнении КАК ДокументРешениеОбУвольнении
		|		ПО РешениеОбУвольненииДанныеМедицинскогоСтрахования.Ссылка = ДокументРешениеОбУвольнении.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыСтрахования КАК СправочникДоговорыСтрахования
		|		ПО ДокументРешениеОбУвольнении.Организация = СправочникДоговорыСтрахования.Организация
		|		И РешениеОбУвольненииДанныеМедицинскогоСтрахования.УдалитьСтраховаяКомпания = СправочникДоговорыСтрахования.Владелец
		|		И ДокументРешениеОбУвольнении.ДатаУвольнения
		|			МЕЖДУ СправочникДоговорыСтрахования.ДатаНачалаСтрахования И СправочникДоговорыСтрахования.ДатаОкончанияСтрахования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2,
		|	ДокументРешениеОбУвольнении.Ссылка,
		|	ПрограммыДМС.ПрограммаСтрахования.СтраховаяКомпания,
		|	ПрограммыДМС.ДоговорСтрахования
		|ИЗ
		|	Документ.РешениеОбУвольнении.ДанныеМедицинскогоСтрахования КАК РешениеОбУвольненииДанныеМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРешенияОбУвольнении КАК ДокументРешениеОбУвольнении
		|		ПО РешениеОбУвольненииДанныеМедицинскогоСтрахования.Ссылка = ДокументРешениеОбУвольнении.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыДМС
		|		ПО ПрограммыДМС.Организация = ДокументРешениеОбУвольнении.Организация
		|		И ПрограммыДМС.ФизическоеЛицо = ДокументРешениеОбУвольнении.ФизическоеЛицо
		|		И
		|			ПрограммыДМС.ПрограммаСтрахования.СтраховаяКомпания = РешениеОбУвольненииДанныеМедицинскогоСтрахования.УдалитьСтраховаяКомпания
		|ГДЕ
		|	ВЫБОР
		|		КОГДА ПрограммыДМС.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ПрограммыДМС.ДействуетДо >= ДокументРешениеОбУвольнении.ДатаУвольнения
		|	КОНЕЦ
		|	И ПрограммыДМС.Действует
		|	И ПрограммыДМС.ДоговорСтрахования <> &ПустойДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПодобранныеДоговоры.Приоритет) КАК Приоритет,
		|	ПодобранныеДоговоры.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ПодобранныеДоговоры.Документ КАК Документ
		|ПОМЕСТИТЬ ВТПодобранныеДоговорыМаксимальныйПриоритет
		|ИЗ
		|	ВТПодобранныеДоговоры КАК ПодобранныеДоговоры
		|СГРУППИРОВАТЬ ПО
		|	ПодобранныеДоговоры.СтраховаяКомпания,
		|	ПодобранныеДоговоры.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодобранныеДоговоры.Документ КАК Документ,
		|	ПодобранныеДоговоры.СтраховаяКомпания КАК СтраховаяКомпания,
		|	МАКСИМУМ(ПодобранныеДоговоры.ДоговорСтрахования) КАК ДоговорСтрахования
		|ИЗ
		|	ВТПодобранныеДоговоры КАК ПодобранныеДоговоры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПодобранныеДоговорыМаксимальныйПриоритет КАК ПодобранныеДоговорыМаксимальныйПриоритет
		|		ПО ПодобранныеДоговоры.Документ = ПодобранныеДоговорыМаксимальныйПриоритет.Документ
		|		И ПодобранныеДоговоры.СтраховаяКомпания = ПодобранныеДоговорыМаксимальныйПриоритет.СтраховаяКомпания
		|		И ПодобранныеДоговоры.Приоритет = ПодобранныеДоговорыМаксимальныйПриоритет.Приоритет
		|СГРУППИРОВАТЬ ПО
		|	ПодобранныеДоговоры.Документ,
		|	ПодобранныеДоговоры.СтраховаяКомпания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Документ,
		|	СтраховаяКомпания";
	
	Обработанные = Новый Массив;
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000","");
	Иначе
		Если Не ПараметрыОбновления.Свойство("Обработанные") Тогда
			ПараметрыОбновления.Вставить("Обработанные");
		Иначе
			Обработанные = ПараметрыОбновления.Обработанные;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
	// АПК:1328-выкл используется при начальном заполнении ИБ.
	РезультатОбновляемыхДанных = Запрос.Выполнить();
	// АПК:1328-вкл
	Если РезультатОбновляемыхДанных.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		Обработанные, РезультатОбновляемыхДанных.Выгрузить().ВыгрузитьКолонку("Документ"));
	ОбновлениеИБ.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
	ВыборкаОбновляемыхДанных = Обработки.ОбходКоллекции.НовыйОбход(РезультатОбновляемыхДанных.Выгрузить());
	Пока ВыборкаОбновляемыхДанных.СледующийПоЗначениюПоля("Документ") Цикл
		ТекущиеДанные = ВыборкаОбновляемыхДанных.ТекущиеДанные();
		ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(ТекущиеДанные.Документ.Метаданные());
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ТекущиеДанные.Документ;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Продолжить;
		КонецЕсли;
		ДокументОбъект = ТекущиеДанные.Документ.ПолучитьОбъект();
		Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
			ТекущиеДанные = ВыборкаОбновляемыхДанных.ТекущиеДанные();
			Для Каждого Строка Из ДокументОбъект.ДанныеМедицинскогоСтрахования Цикл
				Если Строка.УдалитьСтраховаяКомпания = ТекущиеДанные.СтраховаяКомпания Тогда
					Строка.ДоговорСтрахования = ТекущиеДанные.ДоговорСтрахования;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить(
			"НеФормироватьПредварительныеПерерасчетыПриЗаписи", Истина);
		
		РежимЗаписи = ?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, Неопределено);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, Истина, Истина, РежимЗаписи);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ЗарплатаКадры.ОсвободитьМенеджерВременныхТаблиц(Запрос.МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ОбновитьСвойстваУдержанияЗаДМС(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	УдержанияПоКатегории = РасчетЗарплаты.УдержанияПоКатегории(Перечисления.КатегорииУдержаний.ДМС, Новый Структура("Рассчитывается", Истина));
	Если УдержанияПоКатегории.Количество() = 0 Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	СоздатьОтключитьУдержаниеЗаДМС(Новый Соответствие);
	
	ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ДополнитьУдержанияМедицинскогоСтрахованияДанными(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдержанияМедицинскогоСтрахования.Период КАК Период,
		|	УдержанияМедицинскогоСтрахования.Регистратор КАК Регистратор,
		|	УдержанияМедицинскогоСтрахования.Организация КАК Организация,
		|	УдержанияМедицинскогоСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
		|	УдержанияМедицинскогоСтрахования.ДокументОснование КАК ДокументОснование,
		|	УдержанияМедицинскогоСтрахования.СпособУдержания КАК СпособУдержания,
		|	УдержанияМедицинскогоСтрахования.Удержание КАК Удержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания
		|ИЗ
		|	РегистрСведений.УдержанияМедицинскогоСтрахования КАК УдержанияМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|		ПО УдержанияМедицинскогоСтрахования.Регистратор = ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка
		|			И УдержанияМедицинскогоСтрахования.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|			И УдержанияМедицинскогоСтрахования.СпособУдержания = ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УдержанияМедицинскогоСтрахования.Период,
		|	УдержанияМедицинскогоСтрахования.Регистратор,
		|	УдержанияМедицинскогоСтрахования.Организация,
		|	УдержанияМедицинскогоСтрахования.ФизическоеЛицо,
		|	УдержанияМедицинскогоСтрахования.ДокументОснование,
		|	УдержанияМедицинскогоСтрахования.СпособУдержания,
		|	УдержанияМедицинскогоСтрахования.Удержание,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СуммаУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания
		|ИЗ
		|	РегистрСведений.УдержанияМедицинскогоСтрахования КАК УдержанияМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО УдержанияМедицинскогоСтрахования.Регистратор = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И УдержанияМедицинскогоСтрахования.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|			И УдержанияМедицинскогоСтрахования.СпособУдержания = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СпособУдержания";

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Регистраторы = РезультатЗапроса.Скопировать();
	Регистраторы.Свернуть("Регистратор");
	
	ОтборСтрок = Новый Структура("Регистратор");
	Для Каждого СтрРегистратора Из Регистраторы Цикл
		ОтборСтрок.Регистратор = СтрРегистратора.Регистратор;
		НаборЗаписей = РегистрыСведений.УдержанияМедицинскогоСтрахования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(СтрРегистратора.Регистратор);
		СтрокиРегистратора = РезультатЗапроса.НайтиСтроки(ОтборСтрок);
		Для Каждого ДанныеРегистратора Из СтрокиРегистратора Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ДанныеРегистратора);
		КонецЦикла;	
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудниковВРегистреРешенияОбОткрепленииСотрудниковМедицинскогоСтрахования(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.Регистратор КАК Регистратор,
		|	РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫРАЗИТЬ(РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.Регистратор КАК Документ.РешениеОбУвольнении).Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования КАК РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования");
			ЭлементБлокировкиДанных.УстановитьЗначение("ФизическоеЛицо", ВыборкаДетальныеЗаписи.ФизическоеЛицо);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для Каждого СтрокаНабора Из НаборЗаписей Цикл
				СтрокаНабора.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;	
			КонецЦикла;	
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось заполнить изменение Сотрудник в регистре сведений РешенияОбОткрепленииСотрудниковМедицинскогоСтрахования при обновлении.'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ЗаполнитьИзмерениеНомерПолисаВРегистреПолисыДМС(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолисыДМС.Регистратор КАК Регистратор,
		|	ПолисыДМС.Застрахованный КАК Застрахованный
		|ИЗ
		|	РегистрСведений.ПолисыДМС КАК ПолисыДМС";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ПолисыДМС");
			ЭлементБлокировкиДанных.УстановитьЗначение("Застрахованный", ВыборкаДетальныеЗаписи.Застрахованный);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ПолисыДМС.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.Регистратор);
			НаборЗаписей.Прочитать();
			
			Для Каждого СтрокаНабора Из НаборЗаписей Цикл
				Если Не ЗначениеЗаполнено(СтрокаНабора.НомерПолиса) Тогда
					СтрокаНабора.НомерПолиса = СтрокаНабора.УдалитьНомерПолиса;
				КонецЕсли;	
			КонецЦикла;	
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось заполнить новое изменение Номер полиса в регистре ПолисыДМС при обновлении.'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолисыДМС.РегистраторИзмерение КАК РегистраторИзмерение
		|ИЗ
		|	РегистрСведений.ПолисыДМСИспр КАК ПолисыДМС";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ПолисыДМСИспр");
			ЭлементБлокировкиДанных.УстановитьЗначение("РегистраторИзмерение", ВыборкаДетальныеЗаписи.РегистраторИзмерение);
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.ПолисыДМСИспр.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РегистраторИзмерение.Установить(ВыборкаДетальныеЗаписи.РегистраторИзмерение);
			НаборЗаписей.Прочитать();
			
			Для Каждого СтрокаНабора Из НаборЗаписей Цикл
				Если Не ЗначениеЗаполнено(СтрокаНабора.НомерПолиса) Тогда
					СтрокаНабора.НомерПолиса = СтрокаНабора.УдалитьНомерПолиса;
				КонецЕсли;	
			КонецЦикла;	
			
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось заполнить новое изменение Номер полиса в регистре сведений ПолисыДМСИспр при обновлении.'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьШаблоныРассылокМедСтрахования(ПараметрыОбновления = Неопределено) Экспорт
	
	СформироватьШаблонОтправкиПолисовДМС(); 
	
КонецПроцедуры

Функция СформироватьШаблонОтправкиПолисовДМС() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Шаблон
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ВладелецШаблона = ЗНАЧЕНИЕ(Перечисление.ИспользованиеШаблоновСообщенийДМС.РассылкаПолисовДМС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Шаблон;
	КонецЕсли;

	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов 

	// Отправка полисов ДМС.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ПолноеИмяТипаНазначения = "Справочник.ФизическиеЛица";
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;	
	ПараметрыШаблона.Тема = НСтр("ru = 'Полис ДМС'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [ФизическиеЛица.Имя] [ФизическиеЛица.Отчество]!
			 |
			 |Во вложении письма ваш полис ДМС.
			 |
			 |Письмо сформировано автоматически.'");
	
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийДМС.РассылкаПолисовДМС;
	
	НачатьТранзакцию();
	
	Попытка
		НовыйШаблон = ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Отправка полисов ДМС'"), ПараметрыШаблона);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать шаблон отправки полисов ДМС.'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.Справочники.ШаблоныСообщений);
       	
		НовыйШаблон = Справочники.ШаблоныСообщений.ПустаяСсылка();
		
	КонецПопытки;
	
	// АПК:1223-вкл.
	
	Возврат НовыйШаблон;
	
КонецФункции	

Функция ШаблонРассылкаПолисовДМССуществует() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Шаблон
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ВладелецШаблона = ЗНАЧЕНИЕ(Перечисление.ИспользованиеШаблоновСообщенийДМС.РассылкаПолисовДМС)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Шаблон;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf27-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОткреплениеОтПрограммМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf41-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "96f9098d-56fa-488b-9b37-98c600b0f941", Метаданные.Справочники.ПрограммыМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "96f9045d-56fa-488b-9b37-98c600b0f941", Метаданные.Справочники.РасширенияПрограммМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "65a84ead-6554-423b-8fef-86ce4ea29edd", Метаданные.Документы.ИзменениеУсловийМедицинскогоСтрахования);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "40cc60ea-2c62-11ee-8623-c0916228797e", Метаданные.Справочники.ДоговорыСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ДоговорыСтрахования, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ОткреплениеОтПрограммМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеУсловийМедицинскогоСтрахования, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.МедицинскоеСтрахование, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсторияРассылкиПолисовДМС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.ДоговорыСтрахования.Чтение.Организации
	|Справочник.ДоговорыСтрахования.Изменение.Организации
	|Справочник.ДоговорыСтрахованияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыСтрахованияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрикреплениеКПрограммамМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийМедицинскогоСтрахованияПрисоединенныеФайлы.Изменение.Организации
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Чтение.Организации
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Изменение.Организации
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Чтение.Организации
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Изменение.Организации
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Чтение.Организации
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийМедицинскогоСтрахования.Изменение.Организации
	|ЖурналДокументов.МедицинскоеСтрахование.Чтение.Организации
	|РегистрСведений.ИсторияРассылкиПолисовДМС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ИсторияРассылкиПолисовДМС.Чтение.Организации
	|РегистрСведений.ИсторияРассылкиПолисовДМС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ИсторияРассылкиПолисовДМС.Изменение.Организации
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.Изменение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Изменение.Организации
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.Чтение.Организации
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Изменение.Организации
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Чтение.Организации";
	
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьИзменениеДокументаУдостоверяющегоЛичность(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.СозданиеНового Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДоговорСтрахования КАК ДоговорСтрахования
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Действует = ИСТИНА
		|	И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДействуетДо >= &ТекущаяДата
		|	И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ФизическоеЛицо", Форма.ФизическоеЛицоСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеСтрахования = РезультатЗапроса.Выгрузить();
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(ТекущееСтрахование.ДоговорСтрахования);
		ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
		Если ОтправляемыеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОтправляемыеДанные.Найти("ДокументВид") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтборСтруктура = Новый Структура("ДоговорСтрахования, Застрахованный",ТекущееСтрахование.ДоговорСтрахования, Форма.ФизическоеЛицоСсылка);
		ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ТаблицаОтправленныеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = ТаблицаОтправленныеДанные[0];
		
		Если Форма.ДокументыФизическихЛиц.ВидДокумента <> ОтправленныеДанные.ДокументВид Тогда
			Продолжить;
		КонецЕсли;
		
		ИзменилисьОтправленныеДанные = Ложь;
		ИзмениласьСерия = Ложь;
		Если Форма.ДокументыФизическихЛиц.Серия <> Форма.ДокументыФизическихЛицПрежняя.Серия И Форма.ДокументыФизическихЛиц.Серия <> ОтправленныеДанные.ДокументСерия Тогда
			ИзмениласьСерия = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяНомер = Ложь;
		Если Форма.ДокументыФизическихЛиц.Номер <> Форма.ДокументыФизическихЛицПрежняя.Номер И Форма.ДокументыФизическихЛиц.Номер <> ОтправленныеДанные.ДокументНомер Тогда
			ИзменилсяНомер = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзмениласьДатаВыдачи = Ложь;
		Если Форма.ДокументыФизическихЛиц.ДатаВыдачи <> Форма.ДокументыФизическихЛицПрежняя.ДатаВыдачи И Форма.ДокументыФизическихЛиц.ДатаВыдачи <> ОтправленныеДанные.ДокументДатаВыдачи Тогда
			ИзмениласьДатаВыдачи = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяСрокДействия = Ложь;
		Если Форма.ДокументыФизическихЛиц.СрокДействия <> Форма.ДокументыФизическихЛицПрежняя.СрокДействия И Форма.ДокументыФизическихЛиц.СрокДействия <> ОтправленныеДанные.ДокументСрокДействия Тогда
			ИзменилсяСрокДействия = Ложь;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКемВыдан = Ложь;
		Если Форма.ДокументыФизическихЛиц.КемВыдан <> Форма.ДокументыФизическихЛицПрежняя.КемВыдан И Форма.ДокументыФизическихЛиц.КемВыдан <> ОтправленныеДанные.ДокументКемВыдан Тогда
			ИзменилсяКемВыдан = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКодПодразделения = Ложь;
		Если Форма.ДокументыФизическихЛиц.КодПодразделения <> Форма.ДокументыФизическихЛицПрежняя.КодПодразделения И Форма.ДокументыФизическихЛиц.КодПодразделения <> ОтправленныеДанные.ДокументКодПодразделения Тогда
			ИзменилсяКодПодразделения = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		Если Не ИзменилисьОтправленныеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Форма.ФизическоеЛицоСсылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
			Запись.Застрахованный = Форма.ФизическоеЛицоСсылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Если ИзмениласьСерия  Тогда
			Запись.ДокументСерия = Форма.ДокументыФизическихЛиц.Серия;
		КонецЕсли;
		Если ИзменилсяНомер  Тогда
			Запись.ДокументНомер = Форма.ДокументыФизическихЛиц.Номер;
		КонецЕсли;
		Если ИзмениласьДатаВыдачи  Тогда
			Запись.ДокументДатаВыдачи = Форма.ДокументыФизическихЛиц.ДатаВыдачи;
		КонецЕсли;
		Если ИзменилсяСрокДействия  Тогда
			Запись.ДокументСрокДействия = Форма.Форма.ДокументыФизическихЛиц.СрокДействия;
		КонецЕсли;
		Если ИзменилсяКемВыдан  Тогда
			Запись.ДокументКемВыдан = Форма.ДокументыФизическихЛиц.КемВыдан;
		КонецЕсли;
		Если ИзменилсяКодПодразделения  Тогда
			Запись.ДокументКодПодразделения = Форма.ДокументыФизическихЛиц.КодПодразделения;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Функция ОтправляемыеДанныеВСтраховуюКомпанию(ДоговорСтрахования) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыСтрахованияОтправляемыеДанные.Сведение КАК Сведение,
		|	ДоговорыСтрахованияОтправляемыеДанные.СпособПроверкиЗаполнения КАК СпособПроверкиЗаполнения
		|ИЗ
		|	Справочник.ДоговорыСтрахования.ОтправляемыеДанные КАК ДоговорыСтрахованияОтправляемыеДанные
		|ГДЕ
		|	ДоговорыСтрахованияОтправляемыеДанные.Ссылка = &ДоговорСтрахования
		|	И ДоговорыСтрахованияОтправляемыеДанные.Отправлять";
	Запрос.УстановитьПараметр("ДоговорСтрахования", ДоговорСтрахования);
	ОтправляемыеДанные = Новый ТаблицаЗначений;
	ОтправляемыеДанные.Колонки.Добавить("Сведение", Новый ОписаниеТипов("Строка"));
	ОтправляемыеДанные.Колонки.Добавить("СпособПроверкиЗаполнения", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сведение = Перечисления.ДанныеЗастрахованных.ДокументУдостоверяющийЛичность Тогда
			СведенияДокументаУдостоверяющегоЛичность = СоставСведенийДокументаУдостоверяющегоЛичность();
			Для Каждого  Сведение Из СведенияДокументаУдостоверяющегоЛичность Цикл
				НоваяСтрока = ОтправляемыеДанные.Добавить();
				НоваяСтрока.Сведение = Сведение;
				НоваяСтрока.СпособПроверкиЗаполнения = Выборка.СпособПроверкиЗаполнения;
			КонецЦикла;
		Иначе
			ИндексЗначения = Перечисления.ДанныеЗастрахованных.Индекс(Выборка.Сведение);
			НоваяСтрока = ОтправляемыеДанные.Добавить();
			НоваяСтрока.Сведение = Метаданные.Перечисления.ДанныеЗастрахованных.ЗначенияПеречисления[ИндексЗначения].Имя;
			НоваяСтрока.СпособПроверкиЗаполнения = Выборка.СпособПроверкиЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтправляемыеДанные;
	
КонецФункции

Функция ТекущиеСтрахованияФизическихЛиц(ФизическиеЛица) Экспорт
	
	Если ТипЗнч(ФизическиеЛица) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		МассивФизическихЛиц = Новый Массив;
		МассивФизическихЛиц.Добавить(ФизическиеЛица);
	Иначе
		МассивФизическихЛиц = ФизическиеЛица;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДоговорСтрахования КАК ДоговорСтрахования
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(, ФизическоеЛицо В (&ФизическиеЛица))
		|							КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних
		|ГДЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Действует";
	Запрос.УстановитьПараметр("ФизическиеЛица", МассивФизическихЛиц);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииОбъектовСКомандамиУчетаОригиналов.
Процедура ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов) Экспорт
	
	// Формы списков журналов документов
	СписокОбъектов.Добавить("ЖурналДокументов.МедицинскоеСтрахование.Форма.ФормаСписка");
	
	// Формы списков документов
	СписокОбъектов.Добавить("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ФормаСписка");
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииМногосотрудниковыхДокументов.
Процедура ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов) Экспорт
	
	СписокОбъектов.Вставить(Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПолноеИмя(), "Сотрудники");
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ЗаполнитьТаблицуУчетаОригиналов.
Процедура ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов) Экспорт
	
	// Прикрепление к программам страхования
	НоваяСтрока = ТаблицаУчетаОригиналов.Добавить();
	НоваяСтрока.ОбъектМетаданных = Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования;
	НоваяСтрока.Идентификатор = "ЗаявлениеНаУдержание";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтправкаПолисовДМС

Функция ПрогрессОтправки(Обработано, Всего)
	Возврат Макс(5, Окр(Обработано / Всего * 100));
КонецФункции

Процедура ОтправитьПолисДМС(ДанныеПолисаДМС, Шаблон, УчетнаяЗапись)
	
	ПараметрыПисьма = ПараметрыПисьма(ДанныеПолисаДМС, Шаблон);
	
	Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	
	РезультатОтправки = РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, Письмо);   
	
	РегистрыСведений.ИсторияРассылкиПолисовДМС.ЗафиксироватьРезультатРассылкиПолисаДМС(ДанныеПолисаДМС, РезультатОтправки, УчетнаяЗапись);
	
КонецПроцедуры

Функция ПараметрыПисьма(ДанныеПолисаДМС, Шаблон)
	
	ИдентификаторПисьма = Новый УникальныйИдентификатор;
	
	Сообщение = ШаблоныСообщений.СформироватьСообщение(Шаблон, ДанныеПолисаДМС.ФизическоеЛицо, ИдентификаторПисьма);
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", ДанныеПолисаДМС.АдресЭП);
	
	Вложения = Новый Массив;
	
	Если ЗначениеЗаполнено(ДанныеПолисаДМС.Полис) Тогда
		РаботаСФайламиСлужебный.СформироватьСписокФайловДляОтправкиПоПочте(Вложения, ДанныеПолисаДМС.Полис,
			ИдентификаторПисьма);
	КонецЕсли;
	
	ПараметрыПисьма.Вставить("Вложения", Вложения);
	ПараметрыПисьма.Вставить("Тема", Сообщение.Тема);
	ПараметрыПисьма.Вставить("Тело", Сообщение.Текст);
	ПараметрыПисьма.Вставить("Кодировка","UTF-8");
	ПараметрыПисьма.Вставить("Важность", ВажностьИнтернетПочтовогоСообщения.Обычная);
	ПараметрыПисьма.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
		
	Возврат ПараметрыПисьма;
	
КонецФункции

#КонецОбласти

#Область ПараметрыОтправкиПисьма

Функция ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы)
	
	МассивОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаПечатнойФормы.СсылкаДокумента);
	
	ПараметрыПечати = НастройкаПечатнойФормы.ДополнительныеПараметры;
	ДанныеПечати = УправлениеПечатью.СформироватьПечатныеФормы(
		НастройкаПечатнойФормы.СсылкаДокумента.Метаданные().ПолноеИмя(),
		НастройкаПечатнойФормы.ИмяМакета, МассивОбъектов, ПараметрыПечати);
	КоллекцияПечатныхФорм = ДанныеПечати.КоллекцияПечатныхФорм;
	ОбъектыПечати = ДанныеПечати.ОбъектыПечати;
	ПараметрыВывода = ДанныеПечати.ПараметрыВывода;
	
	ПечатнаяФорма = Новый ТабличныйДокумент;
	Если НастройкаПечатнойФормы.ПолноеИмяОбъекта = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
		ПараметрыИсточника = Новый Структура;
		ПараметрыИсточника.Вставить("ИдентификаторКоманды", НастройкаПечатнойФормы.ИмяМакета);
		ПараметрыИсточника.Вставить("ОбъектыНазначения", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НастройкаПечатнойФормы.СсылкаДокумента));
		УправлениеПечатью.ПечатьПоВнешнемуИсточнику(
			НастройкаПечатнойФормы.ДополнительныеПараметры.Ссылка, ПараметрыИсточника, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	Иначе
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(НастройкаПечатнойФормы.ПолноеИмяОбъекта);
		МенеджерОбъекта.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	КонецЕсли;
	Для Каждого ЭлементКоллекции Из КоллекцияПечатныхФорм Цикл
		НастройкаПечатнойФормы.ТабличныйДокумент = ЭлементКоллекции.ТабличныйДокумент;
		ПечатнаяФорма = ЭлементКоллекции.ТабличныйДокумент;
	КонецЦикла;
	
	Возврат ПечатнаяФорма;
	
КонецФункции

Функция ПоместитьТабличныеДокументыВоВременноеХранилище(Форма, ПереданныеНастройки, НастройкиПечатныхФорм)
	Перем ЗаписьZipФайла, ИмяАрхива;
	
	НастройкиСохранения = НастройкиСохранения();
	ЗаполнитьЗначенияСвойств(НастройкиСохранения, ПереданныеНастройки);
	
	Результат = Новый Массив;
	
	// подготовка архива
	Если НастройкиСохранения.УпаковатьВАрхив Тогда
		ИмяАрхива = ПолучитьИмяВременногоФайла("zip");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	// подготовка временной папки
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	
	ВыбранныеФорматыСохранения = НастройкиСохранения.ФорматыСохранения;
	ПереводитьИменаФайловВТранслит = НастройкиСохранения.ПереводитьИменаФайловВТранслит;
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	
	// сохранение печатных форм
	ОбработанныеПечатныеФормы = Новый Массив;
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ПечатнаяФорма = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ПечатнаяФорма = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		Если ОбработанныеПечатныеФормы.Найти(ПечатнаяФорма) = Неопределено Тогда
			ОбработанныеПечатныеФормы.Добавить(ПечатнаяФорма);
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.Защита Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПечатнаяФорма.ВысотаТаблицы = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПечатныеФормыПоОбъектам = Новый Соответствие;
		ПечатныеФормыПоОбъектам.Вставить(Форма.Объект.Ссылка, ПечатнаяФорма);
		Для Каждого СоответствиеОбъектаПечатнойФорме Из ПечатныеФормыПоОбъектам Цикл
			ОбъектПечати = СоответствиеОбъектаПечатнойФорме.Ключ;
			ПечатнаяФорма = СоответствиеОбъектаПечатнойФорме.Значение;
			
			Для Каждого ВыбранныйФормат Из ВыбранныеФорматыСохранения Цикл
				ТипФайла = ТипФайлаТабличногоДокумента[ВыбранныйФормат];
				НастройкиФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла))[0];
				ЗаданныеИменаПечатныхФорм = ОбщегоНазначения.ЗначениеИзСтрокиXML(НастройкаПечатнойФормы.ИмяФайлаПечатнойФормы);
				
				ИмяФайла = УправлениеПечатью.ИмяФайлаПечатнойФормыОбъекта(ОбъектПечати, ЗаданныеИменаПечатныхФорм, НастройкаПечатнойФормы.Название);
				ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайла);
				
				Если ПереводитьИменаФайловВТранслит Тогда
					ИмяФайла = СтроковыеФункции.СтрокаЛатиницей(ИмяФайла);
				КонецЕсли;
				
				ИмяФайла = ИмяФайла + "." + НастройкиФормата.Расширение;
				
				ПолноеИмяФайла = УникальноеИмяФайла(ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайла);
				ПечатнаяФорма.Записать(ПолноеИмяФайла, ТипФайла);
				
				Если ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда
					УправлениеПечатью.ВставитьКартинкиВHTML(ПолноеИмяФайла);
				КонецЕсли;
				
				Если ЗаписьZipФайла <> Неопределено Тогда 
					ЗаписьZipФайла.Добавить(ПолноеИмяФайла);
				Иначе
					ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
					ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
					ОписаниеФайла = Новый Структура;
					ОписаниеФайла.Вставить("Представление", ИмяФайла);
					ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
					Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда
						ОписаниеФайла.Вставить("Кодировка", "windows-1251");
					КонецЕсли;
					Результат.Добавить(ОписаниеФайла);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Если архив подготовлен, записываем и помещаем его во временное хранилище.
	Если ЗаписьZipФайла <> Неопределено Тогда 
		ЗаписьZipФайла.Записать();
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяАрхива);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Форма.УникальныйИдентификатор);
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Представление", ПолучитьИмяФайлаДляАрхива(Форма, НастройкиПечатныхФорм, ПереводитьИменаФайловВТранслит));
		ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
		Результат.Добавить(ОписаниеФайла);
	КонецЕсли;
	
	УдалитьФайлы(ИмяВременнойПапки);
	Если ЗначениеЗаполнено(ИмяАрхива) Тогда
		УдалитьФайлы(ИмяАрхива);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиСохранения()
	
	НастройкиСохранения = Новый Структура;
	НастройкиСохранения.Вставить("ФорматыСохранения", Новый Массив);
	НастройкиСохранения.Вставить("УпаковатьВАрхив", Ложь);
	НастройкиСохранения.Вставить("ПереводитьИменаФайловВТранслит", Ложь);
	
	Возврат НастройкиСохранения;
	
КонецФункции

Функция ВычислитьИспользованиеВывода(ТабличныйДокумент)
	Если ТабличныйДокумент.Вывод = ИспользованиеВывода.Авто Тогда
		Возврат ?(ПравоДоступа("Вывод", Метаданные), ИспользованиеВывода.Разрешить, ИспользованиеВывода.Запретить);
	Иначе
		Возврат ТабличныйДокумент.Вывод;
	КонецЕсли;
КонецФункции

Функция УникальноеИмяФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	ИмяБезРасширения = Файл.ИмяБезРасширения;
	Расширение = Файл.Расширение;
	Папка = Файл.Путь;
	
	Счетчик = 1;
	Пока Файл.Существует() Цикл
		Счетчик = Счетчик + 1;
		Файл = Новый Файл(Папка + ИмяБезРасширения + " (" + Счетчик + ")" + Расширение);
	КонецЦикла;
	
	Возврат Файл.ПолноеИмя;

КонецФункции

Функция ПолучитьИмяФайлаДляАрхива(Форма, НастройкиПечатныхФорм, ПереводитьИменаФайловВТранслит)
	
	Результат = "";
	
	Для Каждого НастройкаПечатнойФормы Из НастройкиПечатныхФорм Цикл
		
		Если Не НастройкаПечатнойФормы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если НастройкаПечатнойФормы.ТабличныйДокумент = Неопределено Тогда
			ПечатнаяФорма = ТабличныйДокументПоНастройкеПечатнойФормы(НастройкаПечатнойФормы);
		Иначе
			ПечатнаяФорма = НастройкаПечатнойФормы.ТабличныйДокумент;
		КонецЕсли;
		
		Если ВычислитьИспользованиеВывода(ПечатнаяФорма) = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(Результат) Тогда
			Результат = НастройкаПечатнойФормы.Название;
		Иначе
			Результат = НСтр("ru = 'Документы'");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПереводитьИменаФайловВТранслит Тогда
		Результат = СтроковыеФункции.СтрокаЛатиницей(Результат);
	КонецЕсли;
	
	Возврат Результат + ".zip";
	
КонецФункции

#КонецОбласти

Функция ДатыСтрахованияОбновляемыеДокументы(ПараметрыОбновления)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрограммыСтрахованияСотрудников.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОбновляемыеДокументы
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрограммыСтрахованияСотрудников
	|ГДЕ
	|	ПрограммыСтрахованияСотрудников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И ПрограммыСтрахованияСотрудников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыСтрахованияСотрудников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасширенияПрограммСтрахованияСотрудников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК РасширенияПрограммСтрахованияСотрудников
	|ГДЕ
	|	РасширенияПрограммСтрахованияСотрудников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И РасширенияПрограммСтрахованияСотрудников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммСтрахованияСотрудников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрограммыСтрахованияРодственников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрограммыСтрахованияРодственников
	|ГДЕ
	|	ПрограммыСтрахованияРодственников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И ПрограммыСтрахованияРодственников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыСтрахованияРодственников.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасширенияПрограммСтрахованияРодственников.Ссылка
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК РасширенияПрограммСтрахованияРодственников
	|ГДЕ
	|	РасширенияПрограммСтрахованияРодственников.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|	И РасширенияПрограммСтрахованияРодственников.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммСтрахованияРодственников.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Документы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТОбновляемыеДокументы КАК Документы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Ссылка.Дата УБЫВ";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100", "");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ВыполнитьЗаполнениеДатСтрахования(ПараметрыОбновления, ОбновляемыеДокументы)
	
	Выборка = ОбновляемыеДокументы.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования", "Ссылка", Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для каждого СтрокаДокумента Из ДокументОбъект.Сотрудники Цикл
			ОтборСтрок = Новый Структура("Сотрудник", СтрокаДокумента.Сотрудник);
			НайденныеСтроки = ДокументОбъект.ПрограммыСтрахованияСотрудников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = ДокументОбъект.ДатаОкончанияСтрахования;
			КонецЦикла;
			НайденныеСтроки = ДокументОбъект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = ДокументОбъект.ДатаОкончанияСтрахования;
			КонецЦикла;
		КонецЦикла;
		Для каждого СтрокаДокумента Из ДокументОбъект.Родственники Цикл
			ОтборСтрок = Новый Структура("ФизическоеЛицо, Родственник", СтрокаДокумента.ФизическоеЛицо, СтрокаДокумента.Родственник);
			НайденныеСтроки = ДокументОбъект.ПрограммыСтрахованияРодственников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = СтрокаДокумента.ДатаОткрепления;
			КонецЦикла;
			НайденныеСтроки = ДокументОбъект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(ОтборСтрок);
			Для Каждого ИзменяемаяСтрока Из НайденныеСтроки Цикл
				ИзменяемаяСтрока.ДатаНачала = СтрокаДокумента.ДатаПрикрепления;
				ИзменяемаяСтрока.ДатаОкончания = СтрокаДокумента.ДатаОткрепления;
			КонецЦикла;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		
	КонецЦикла;

КонецПроцедуры

Функция РодственникМедицинскогоСтрахования(ФИОРодственника)
	
	РодственникСсылка = Справочники.РодственникиФизическихЛиц.НайтиПоНаименованию(ФИОРодственника);
	Если ЗначениеЗаполнено(РодственникСсылка) Тогда
		Возврат РодственникСсылка;
	КонецЕсли;
	
	РодственникОбъект = Справочники.РодственникиФизическихЛиц.СоздатьЭлемент();
	РодственникОбъект.Наименование = ФИОРодственника;
	ФИО = СокрЛП(ФИОРодственника);
	Пока СтрНайти(ФИО, "  ") > 0 Цикл
		ФИО = СтрЗаменить(ФИО, "  ", " ");
	КонецЦикла;
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	РодственникОбъект.Фамилия  = СтруктураФИО.Фамилия;
	РодственникОбъект.Имя = СтруктураФИО.Имя;
	РодственникОбъект.Отчество = СтруктураФИО.Отчество;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(РодственникОбъект);
	
	Возврат РодственникОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьДанныеЗастрахованного(Застрахованный, ДокументПрикрепление, СтрокаСведение)
	
	НайденныеДанные = ДокументПрикрепление.ДанныеЗастрахованных.НайтиСтроки(Новый Структура("Застрахованный", Застрахованный));
	Если НайденныеДанные.Количество() = 0 Тогда
		СтрокаДанные = ДокументПрикрепление.ДанныеЗастрахованных.Добавить();
		СтрокаДанные.Застрахованный = Застрахованный;
	Иначе
		СтрокаДанные = НайденныеДанные[0];
	КонецЕсли;
	Если СтрокаСведение.СведениеИмя = "ДатаРождения" Тогда
		СтрокаДанные.ДатаРождения = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДатаРожденияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "СтраховойНомерПФР" Тогда
		СтрокаДанные.СтраховойНомерПФР = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.СтраховойНомерПФРДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "Пол" Тогда
		СтрокаДанные.Пол = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ПолДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "Страна" Тогда
		СтрокаДанные.Страна = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.СтранаДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументПредставление" Тогда
		СтрокаДанные.ДокументПредставление = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументПредставлениеДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументВид" Тогда
		СтрокаДанные.ДокументВид = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументВидДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументСерия" Тогда
		СтрокаДанные.ДокументСерия = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументСерияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументНомер" Тогда
		СтрокаДанные.ДокументНомер = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументНомерДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументДатаВыдачи" Тогда
		СтрокаДанные.ДокументДатаВыдачи = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументДатаВыдачиДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументСрокДействия" Тогда
		СтрокаДанные.ДокументСрокДействия = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументСрокДействияДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументКемВыдан" Тогда
		СтрокаДанные.ДокументКемВыдан = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументКемВыданДоИзменения = СтрокаСведение.СведениеЗначение;
	ИначеЕсли СтрокаСведение.СведениеИмя = "ДокументКодПодразделения" Тогда
		СтрокаДанные.ДокументКодПодразделения = СтрокаСведение.СведениеЗначение;
		СтрокаДанные.ДокументКодПодразделенияДоИзменения = СтрокаСведение.СведениеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКонтактнуюИнформациюЗастрахованного(Застрахованный, ДокументПрикрепление, СтрокаСведение)
	
	ВидКИ = ВидКонтактнойИнформацииПоСведению()[СтрокаСведение.СведениеИмя];
	ОтборСтрок = Новый Структура("Застрахованный, Вид", Застрахованный, ВидКИ);
	НайденнаяКИ = ДокументПрикрепление.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
	Если НайденнаяКИ.Количество() = 0 Тогда
		СтрокаКИ = ДокументПрикрепление.КонтактнаяИнформацияЗастрахованных.Добавить();
		СтрокаКИ.Застрахованный = Застрахованный;
		СтрокаКИ.Вид = ВидКИ;
	Иначе
		СтрокаКИ = НайденнаяКИ[0];
	КонецЕсли;
	Если СтрокаСведение.СведениеИмя = "КонтактнаяИнформация1"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация2"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация3"
		Или СтрокаСведение.СведениеИмя = "КонтактнаяИнформация4" Тогда
		СтрокаКИ.Значение = СтрокаСведение.СведениеЗначение;
	Иначе
		СтрокаКИ.Представление = СтрокаСведение.СведениеЗначение;
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеЗастрахованных()
	
	ДанныеЗастрахованных = Новый Структура;
	ДанныеЗастрахованных.Вставить("ДатаРождения", Истина);
	ДанныеЗастрахованных.Вставить("СтраховойНомерПФР", Истина);
	ДанныеЗастрахованных.Вставить("Пол", Истина);
	ДанныеЗастрахованных.Вставить("Страна", Истина);
	ДанныеЗастрахованных.Вставить("ДокументПредставление", Истина);
	ДанныеЗастрахованных.Вставить("ДокументВид", Истина);
	ДанныеЗастрахованных.Вставить("ДокументСерия",Истина);
	ДанныеЗастрахованных.Вставить("ДокументНомер", Истина);
	ДанныеЗастрахованных.Вставить("ДокументДатаВыдачи", Истина);
	ДанныеЗастрахованных.Вставить("ДокументСрокДействия", Истина);
	ДанныеЗастрахованных.Вставить("ДокументКемВыдан", Истина);
	ДанныеЗастрахованных.Вставить("ДокументКодПодразделения", Истина);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация1", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация2", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация3", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация4", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация1Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация2Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация3Представление", Ложь);
	ДанныеЗастрахованных.Вставить("КонтактнаяИнформация4Представление", Ложь);
	
	Возврат ДанныеЗастрахованных;
	
КонецФункции

Функция ВидКонтактнойИнформацииПоСведению()
	
	СтруктураВидимостьНаФорме = Новый Структура;
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация1", Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация2", Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация3", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация4", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация1Представление", Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация2Представление", Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация3Представление", Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица);
	СтруктураВидимостьНаФорме.Вставить("КонтактнаяИнформация4Представление", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
	
	Возврат СтруктураВидимостьНаФорме;
	
КонецФункции

#Область ПоказателиРасчетаЗарплаты

Процедура ЗаполнитьИсточникДанныхПоказателейИсключений(ПоказательРасчетаЗарплаты) Экспорт
	
	Если ПоказательРасчетаЗарплаты.ИмяПредопределенныхДанных = "СтраховаяПремия"
		Или ПоказательРасчетаЗарплаты.ИмяПредопределенныхДанных = "КоличествоДнейПериодаСтрахования" Тогда
		ПоказательРасчетаЗарплаты.ПериодическийПоказательСотрудника = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТаблицуУдержанийИзвестнымиПоказателями(ДатаУвольнения, МенеджерРасчета) Экспорт
	
	ЗначениеКалендарныеДни = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(НачалоМесяца(ДатаУвольнения), ДатаУвольнения);
	ПоказательКалендарныеДни = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КалендарныеДни");
	Для Каждого СтрокаУдержаний Из МенеджерРасчета.Зарплата.Удержания Цикл
		МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(СтрокаУдержаний, ПоказательКалендарныеДни, ЗначениеКалендарныеДни);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция ФизическиеЛицаСУдержаниемПоГрафику(Организация, ДокументыОснованияФизическихЛиц, МенеджерВТ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыОснованияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументыОснованияФизическихЛиц.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТДокументыОснованияФизическихЛиц
		|ИЗ
		|	&ДокументыОснованияФизическихЛиц КАК ДокументыОснованияФизическихЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(УдержанияМедицинскогоСтрахованияСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ВТУдержанияПоГрафику
		|ИЗ
		|	РегистрСведений.УдержанияМедицинскогоСтрахования.СрезПоследних(
		|			,
		|			Организация = &Организация
		|				И (ФизическоеЛицо, ДокументОснование) В
		|					(ВЫБРАТЬ
		|						ДокументыОснованияФизическихЛиц.ФизическоеЛицо,
		|						ДокументыОснованияФизическихЛиц.ДокументОснование
		|					ИЗ
		|						ВТДокументыОснованияФизическихЛиц КАК ДокументыОснованияФизическихЛиц)) КАК УдержанияМедицинскогоСтрахованияСрезПоследних
		|ГДЕ
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику)
		|
		|СГРУППИРОВАТЬ ПО
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ФизическоеЛицо,
		|	УдержанияМедицинскогоСтрахованияСрезПоследних.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдержанияПоГрафику.ФизическоеЛицо КАК ФизическоеЛицо,
		|	УдержанияПоГрафику.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	ВТУдержанияПоГрафику КАК УдержанияПоГрафику";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДокументыОснованияФизическихЛиц", ДокументыОснованияФизическихЛиц);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ГрафикУдержаний(МесяцНачисления, МенеджерВТ, ДополнительныеСвойства)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("МесяцНачисления", МесяцНачисления);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТУдержанияПоГрафику.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ГрафикУдержанийМедицинскогоСтрахования.Дата КАК Дата,
		|	ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование КАК ДокументОснование,
		|	ГрафикУдержанийМедицинскогоСтрахования.Удержание КАК Удержание,
		|	ГрафикУдержанийМедицинскогоСтрахования.Сумма КАК Сумма
		|ПОМЕСТИТЬ ВТГрафикУдержанийМедицинскогоСтрахования
		|ИЗ
		|	ВТУдержанияПоГрафику КАК ВТУдержанияПоГрафику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикУдержанийМедицинскогоСтрахования КАК ГрафикУдержанийМедицинскогоСтрахования
		|		ПО ВТУдержанияПоГрафику.ФизическоеЛицо = ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо
		|			И ВТУдержанияПоГрафику.ДокументОснование = ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование
		|			И ВТУдержанияПоГрафику.Период = ГрафикУдержанийМедицинскогоСтрахования.Период";
	
	Запрос.Выполнить();
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПерерассчитываемыхУдержаний") Тогда
		Запрос.УстановитьПараметр("ТаблицаПерерассчитываемыхУдержаний", ДополнительныеСвойства.ТаблицаПерерассчитываемыхУдержаний);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПерерассчитываемыеУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ПерерассчитываемыеУдержания.ДокументОснование КАК ДокументОснование,
			|	ПерерассчитываемыеУдержания.Удержание КАК Удержание,
			|	ПерерассчитываемыеУдержания.ДатаНачала КАК ДатаНачала
			|ПОМЕСТИТЬ ВТПерерассчитываемыеУдержания
			|ИЗ
			|	&ТаблицаПерерассчитываемыхУдержаний КАК ПерерассчитываемыеУдержания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ГрафикУдержанийМедицинскогоСтрахования.Дата КАК Дата,
			|	ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование КАК ДокументОснование,
			|	ГрафикУдержанийМедицинскогоСтрахования.Удержание КАК Удержание,
			|	ГрафикУдержанийМедицинскогоСтрахования.Сумма КАК Сумма,
			|	ЛОЖЬ КАК КПерерасчету
			|ИЗ
			|	ВТГрафикУдержанийМедицинскогоСтрахования КАК ГрафикУдержанийМедицинскогоСтрахования
			|ГДЕ
			|	ГрафикУдержанийМедицинскогоСтрахования.Дата = &МесяцНачисления
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ГрафикУдержанийМедицинскогоСтрахования.Дата,
			|	ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо,
			|	ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование,
			|	ГрафикУдержанийМедицинскогоСтрахования.Удержание,
			|	ГрафикУдержанийМедицинскогоСтрахования.Сумма,
			|	ИСТИНА
			|ИЗ
			|	ВТГрафикУдержанийМедицинскогоСтрахования КАК ГрафикУдержанийМедицинскогоСтрахования
			|ГДЕ
			|	(ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо, ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование, ГрафикУдержанийМедицинскогоСтрахования.Удержание, ГрафикУдержанийМедицинскогоСтрахования.Дата) В
			|			(ВЫБРАТЬ
			|				ПерерассчитываемыеУдержания.ФизическоеЛицо,
			|				ПерерассчитываемыеУдержания.ДокументОснование,
			|				ПерерассчитываемыеУдержания.Удержание,
			|				ПерерассчитываемыеУдержания.ДатаНачала
			|			ИЗ
			|				ВТПерерассчитываемыеУдержания КАК ПерерассчитываемыеУдержания)";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГрафикУдержанийМедицинскогоСтрахования.Дата КАК Дата,
			|	ГрафикУдержанийМедицинскогоСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ГрафикУдержанийМедицинскогоСтрахования.ДокументОснование КАК ДокументОснование,
			|	ГрафикУдержанийМедицинскогоСтрахования.Удержание КАК Удержание,
			|	ГрафикУдержанийМедицинскогоСтрахования.Сумма КАК Сумма,
			|	ЛОЖЬ КАК КПерерасчету
			|ИЗ
			|	ВТГрафикУдержанийМедицинскогоСтрахования КАК ГрафикУдержанийМедицинскогоСтрахования
			|ГДЕ
			|	ГрафикУдержанийМедицинскогоСтрахования.Дата = &МесяцНачисления";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗарегистрироватьИзменениеФизическогоЛицаПриЗаписи(Объект) Экспорт
	
	ТекущиеСтрахования = ТекущиеСтрахованияФизическихЛиц(Объект.Ссылка);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтборСтруктура = Новый Структура("ДоговорСтрахования, Застрахованный", ТекущееСтрахование.ДоговорСтрахования, Объект.Ссылка);
			
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(ТекущееСтрахование.ДоговорСтрахования);
		Если ОтправляемыеДанныеТаблица.Количество() > 0 Тогда
			ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ТаблицаОтправленныеДанные.Количество() > 0 Тогда
				ОбработатьИзменениеОтправленныхДанныхФизическогоЛица(
					Объект,
					ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение"),
					ТаблицаОтправленныеДанные[0],
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
		
		ОтправленнаяКонтактнаяИнформация = РегистрыСведений.ОтправленнаяКонтактнаяИнформацияЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ОтправленнаяКонтактнаяИнформация.Количество() > 0 Тогда
			ОбработатьИзменениеКонтактнойИнформацииФизическогоЛица(
				Объект,
				ОтправленнаяКонтактнаяИнформация,
				ТекущееСтрахование);
		КонецЕсли; 
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны() Тогда
			ОтправленныеДополнительныеРеквизитыИСведения = РегистрыСведений.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ОтправленныеДополнительныеРеквизитыИСведения.Количество() > 0 Тогда
				ОбработатьИзменениеДополнительныхРеквизитовИСведенийФизическогоЛица(
					Объект,
					ОтправленныеДополнительныеРеквизитыИСведения,
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеРодственникаПриЗаписи(Объект) Экспорт

	ТекущиеСтрахования = ТекущиеСтрахованияРодственника(Объект.Ссылка);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтборСтруктура = Новый Структура("ДоговорСтрахования, Застрахованный", ТекущееСтрахование.ДоговорСтрахования, Объект.Ссылка);
			
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(ТекущееСтрахование.ДоговорСтрахования);
		Если ОтправляемыеДанныеТаблица.Количество() > 0 Тогда
			ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
			Если ТаблицаОтправленныеДанные.Количество() > 0 Тогда
				ОбработатьИзменениеОтправленныхДанныхРодственника(
					Объект,
					ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение"),
					ТаблицаОтправленныеДанные[0],
					ТекущееСтрахование);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапомнитьПрежниеЗначенияГражданстваФизическихЛицПередЗаписью(Источник, Замещение, ФизическиеЛица) Экспорт
	
	ТекущиеСтрахования = ТекущиеСтрахованияФизическихЛиц(ФизическиеЛица);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеСтрахованияМассив = Новый Массив;
	ЗапоминатьГражданство = Ложь;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтправляемыеДанныеТаблица = ОтправляемыеДанныеВСтраховуюКомпанию(ТекущееСтрахование.ДоговорСтрахования);
		ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
		Если ОтправляемыеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОтправляемыеДанные.Найти("Страна") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗапоминатьГражданство = Истина;
		ТекущиеСтрахованияМассив.Добавить(Новый Структура("ДоговорСтрахования, ФизическоеЛицо", ТекущееСтрахование.ДоговорСтрахования, ТекущееСтрахование.ФизическоеЛицо));
	КонецЦикла;
	
	Если ЗапоминатьГражданство Тогда
		КадровыеДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, "Страна");
		СоответствиеПрежнееЗначениеГражданства = Новый Соответствие;
		Для Каждого СтрокаКадровыхДанных Из КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическиеЛица, "Страна") Цикл
			СоответствиеПрежнееЗначениеГражданства.Вставить(
				СтрокаКадровыхДанных.ФизическоеЛицо, ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаКадровыхДанных));
		КонецЦикла;
		Источник.ДополнительныеСвойства.Вставить("СоответствиеПрежнееЗначениеГражданстваМедицинскогоСтрахования", СоответствиеПрежнееЗначениеГражданства);
		Источник.ДополнительныеСвойства.Вставить("ТекущиеСтрахованияМассив", ТекущиеСтрахованияМассив);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИзменениеГражданстваМедицинскогоСтрахованияПриЗаписи(Источник, Замещение) Экспорт
	
	СоответствиеПрежнееЗначениеГражданства = Источник.ДополнительныеСвойства["СоответствиеПрежнееЗначениеГражданстваМедицинскогоСтрахования"];
	ТекущиеСтрахованияМассив = Источник.ДополнительныеСвойства["ТекущиеСтрахованияМассив"];
	
	Если РегистрыБЗК.ЭтоДобавлениеНабораЗаписей(Замещение) Тогда
		НовыйНабор = Источник.Выгрузить();
	Иначе
		НовыйНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(Источник, Замещение);	
	КонецЕсли;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахованияМассив Цикл
		ОтборСтруктура = Новый Структура("ДоговорСтрахования, Застрахованный",
			ТекущееСтрахование.ДоговорСтрахования, ТекущееСтрахование.ФизическоеЛицо);
		ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ТаблицаОтправленныеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;		
		ОтправленныеДанные = ТаблицаОтправленныеДанные[0];
		
		ПрежниеКадровыеДанные = СоответствиеПрежнееЗначениеГражданства.Получить(ТекущееСтрахование.ФизическоеЛицо);
		ПрежняяСтрана = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПрежниеКадровыеДанные, "Страна");
		
		ОтборСтруктура = Новый Структура("ФизическоеЛицо", ТекущееСтрахование.ФизическоеЛицо);
		НайденныеСтрокиНовогоНабора = НовыйНабор.НайтиСтроки(ОтборСтруктура);
		НоваяСтрана = Неопределено;
		Если НайденныеСтрокиНовогоНабора.Количество() > 0 Тогда
			НоваяСтрана = НайденныеСтрокиНовогоНабора[0].Страна;
		КонецЕсли;
		
		ИзменилосьГражданство = ПрежняяСтрана <> НоваяСтрана И НоваяСтрана <> ОтправленныеДанные.Страна;		
		Если ИзменилосьГражданство = Ложь Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(ТекущееСтрахование.ФизическоеЛицо);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
			Запись.Застрахованный = ТекущееСтрахование.ФизическоеЛицо;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		Запись.Страна = НоваяСтрана;
		НаборЗаписей.Записать();		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменениеОтправленныхДанныхФизическогоЛица(Объект, ОтправляемыеДанные, ОтправленныеДанные, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзменилисьОтправленныеДанные = Ложь;
	
	ИзмениласьФамилия = Ложь;
	Если Объект.Фамилия <> ПрежниеЗначения.Фамилия Тогда
		ИзмениласьФамилия = Истина;
		Если Объект.Фамилия <> ОтправленныеДанные.Фамилия Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьИмя = Ложь;
	Если Объект.Имя <> ПрежниеЗначения.Имя Тогда
		ИзменилосьИмя = Истина;
		Если Объект.Имя <> ОтправленныеДанные.Имя Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьОтчество = Ложь;
	Если Объект.Отчество <> ПрежниеЗначения.Отчество Тогда
		ИзменилосьОтчество = Истина;
		Если Объект.Отчество <> ОтправленныеДанные.Отчество Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзмениласьДатаРождения = Ложь;
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		Если Объект.ДатаРождения <> ПрежниеЗначения.ДатаРождения Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.ДатаРождения <> ОтправленныеДанные.ДатаРождения Тогда
				ИзмениласьДатаРождения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяСНИЛС = Ложь;
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		Если Объект.СтраховойНомерПФР <> ПрежниеЗначения.СтраховойНомерПФР Тогда
			ИзменилисьОтправленныеДанные = Истина;
		 	Если Объект.СтраховойНомерПФР <> ОтправленныеДанные.СтраховойНомерПФР Тогда
				ИзменилсяСНИЛС = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяПол = Ложь;
	Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
		Если Объект.Пол <> ПрежниеЗначения.Пол Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.Пол <> ОтправленныеДанные.Пол Тогда
				ИзменилсяПол = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменилисьОтправленныеДанные Тогда
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
			Запись.Застрахованный = Объект.Ссылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.ИзмениласьФамилия = ИзмениласьФамилия;
		Запись.Фамилия = ?(ИзмениласьФамилия = Истина, Объект.Фамилия, Неопределено);
		
		Запись.ИзменилосьИмя = ИзменилосьИмя;
		Запись.Имя = ?(ИзменилосьИмя = Истина, Объект.Имя, Неопределено);
		
		Запись.ИзменилосьОтчество = ИзменилосьОтчество;
		Запись.Отчество = ?(ИзменилосьОтчество = Истина, Объект.Отчество, Неопределено);
		
		Запись.ИзмениласьДатаРождения = ИзмениласьДатаРождения;
		Запись.ДатаРождения = ?(ИзмениласьДатаРождения = Истина, Объект.ДатаРождения, Неопределено);
		
		Запись.ИзменилсяСтраховойНомерПФР = ИзменилсяСНИЛС;
		Запись.СтраховойНомерПФР = ?(ИзменилсяСНИЛС = Истина, Объект.СтраховойНомерПФР, Неопределено);
		
		Запись.ИзменилсяПол = ИзменилсяПол;
		Запись.Пол = ?(ИзменилсяПол = Истина, Объект.Пол, Неопределено);

		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьИзменениеКонтактнойИнформацииФизическогоЛица(Объект, ТаблицаОтправленнаяКонтактнаяИнформация, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзмененнаяКИ = Новый Массив;
	ВосстановленнаяКИ = Новый Массив;
	
	Для Каждого ОтправленнаяКонтактнаяИнформация Из ТаблицаОтправленнаяКонтактнаяИнформация Цикл
		Если ПрежниеЗначения.Свойство("ТаблицаКИ") Тогда
			ПрежниеЗначенияКонтактнойИнформации = ПрежниеЗначения.ТаблицаКИ;
			БылоПрежнееЗначениеКИ = Ложь;
			Для Каждого ПрежнееЗначениеСтруктура Из ПрежниеЗначенияКонтактнойИнформации Цикл
				Если ПрежнееЗначениеСтруктура.Вид = ОтправленнаяКонтактнаяИнформация.Вид Тогда
					БылоПрежнееЗначениеКИ = Истина;
					НовоеПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
						Объект, ОтправленнаяКонтактнаяИнформация.Вид);
					Если Не ЗначениеЗаполнено(НовоеПредставление) Тогда
						НовоеПредставление = "";
					КонецЕсли;
					Если ПрежнееЗначениеСтруктура.Представление <> НовоеПредставление Тогда
						Если НовоеПредставление = ОтправленнаяКонтактнаяИнформация.Представление Тогда
							ВосстановленнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
						Иначе
							ИзмененнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если Не БылоПрежнееЗначениеКИ Тогда
				ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ);
			КонецЕсли;
		Иначе
			ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КИ Из ИзмененнаяКИ Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Вид.Установить(КИ.Вид);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
		НоваяЗапись.Застрахованный = Объект.Ссылка;
		НоваяЗапись.Вид = КИ.Вид;
		НоваяЗапись.Представление = КИ.Представление;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
	Для Каждого КИ Из ВосстановленнаяКИ Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Вид.Установить(КИ.Вид);
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьИзменениеДополнительныхРеквизитовИСведенийФизическогоЛица(Объект, ТаблицаОтправленныеДополнительныеРеквизитыИСведения, ТекущееСтрахование)

	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзмененныеСвойства = Новый Массив;
	ВосстановленныеСвойства = Новый Массив;
	
	Если ТаблицаОтправленныеДополнительныеРеквизитыИСведения.Количество() > 0 Тогда
		Для Каждого ОтправленноеСвойство Из ТаблицаОтправленныеДополнительныеРеквизитыИСведения Цикл
			Если ПрежниеЗначения.Свойство("ДополнительныеРеквизитыИСведения") Тогда
				ПрежниеЗначенияСвойств = ПрежниеЗначения.ДополнительныеРеквизитыИСведения;
				Для Каждого ПрежнееЗначениеСтруктура Из ПрежниеЗначенияСвойств Цикл
					Если ПрежнееЗначениеСтруктура.Свойство = ОтправленноеСвойство.Свойство Тогда
						НовоеЗначение = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОтправленноеСвойство.Свойство));
						Если НовоеЗначение.Количество() > 0 Тогда
							НовоеЗначениеСвойства = НовоеЗначение[0].Значение;
						Иначе
							НовоеЗначениеСвойства = Неопределено;
						КонецЕсли;
						Если ПрежнееЗначениеСтруктура.Значение <> НовоеЗначениеСвойства Тогда
							Если НовоеЗначениеСвойства = ОтправленноеСвойство.Значение Тогда
								ВосстановленныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
							Иначе
								ИзмененныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			Иначе
				НовоеЗначение = Объект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ОтправленноеСвойство.Свойство));
				Если НовоеЗначение.Количество() > 0 Тогда
					НовоеЗначениеСвойства = НовоеЗначение[0].Значение;
				Иначе
					НовоеЗначениеСвойства = Неопределено;
				КонецЕсли;
				Если НовоеЗначениеСвойства <> Неопределено И НовоеЗначениеСвойства <> ОтправленноеСвойство.Значение Тогда
					ИзмененныеСвойства.Добавить(Новый Структура("Свойство, Значение", ОтправленноеСвойство.Свойство, НовоеЗначениеСвойства));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ИзмененноеСвойство Из ИзмененныеСвойства Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Свойство.Установить(ИзмененноеСвойство.Свойство);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
		НоваяЗапись.Застрахованный = Объект.Ссылка;
		НоваяЗапись.Свойство = ИзмененноеСвойство.Свойство;
		НоваяЗапись.Значение = ИзмененноеСвойство.Значение;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;

	Для Каждого ИзмененноеСвойство Из ВосстановленныеСвойства Цикл
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Отбор.Свойство.Установить(ИзмененноеСвойство.Свойство);
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработатьИзменениеОтправленныхДанныхРодственника(Объект, ОтправляемыеДанные, ОтправленныеДанные, ТекущееСтрахование)
	
	ПрежниеЗначения = Объект.ДополнительныеСвойства["ПрежниеЗначения"];
	ИзменилисьОтправленныеДанные = Ложь;
	
	ИзмениласьФамилия = Ложь;
	Если Объект.Фамилия <> ПрежниеЗначения.Фамилия Тогда
		ИзмениласьФамилия = Истина;
		Если Объект.Фамилия <> ОтправленныеДанные.Фамилия Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьИмя = Ложь;
	Если Объект.Имя <> ПрежниеЗначения.Имя Тогда
		ИзменилосьИмя = Истина;
		Если Объект.Имя <> ОтправленныеДанные.Имя Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилосьОтчество = Ложь;
	Если Объект.Отчество <> ПрежниеЗначения.Отчество Тогда
		ИзменилосьОтчество = Истина;
		Если Объект.Отчество <> ОтправленныеДанные.Отчество Тогда
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ИзмениласьДатаРождения = Ложь;
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		Если Объект.ДатаРождения <> ПрежниеЗначения.ДатаРождения Тогда
			ИзменилисьОтправленныеДанные = Истина;
			Если Объект.ДатаРождения <> ОтправленныеДанные.ДатаРождения Тогда
				ИзмениласьДатаРождения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИзменилсяСНИЛС = Ложь;
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		Если Объект.СНИЛС <> ПрежниеЗначения.СНИЛС Тогда
			ИзменилисьОтправленныеДанные = Истина;
		 	Если Объект.СНИЛС <> ОтправленныеДанные.СтраховойНомерПФР Тогда
				ИзменилсяСНИЛС = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИзменилисьОтправленныеДанные Тогда
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
			Запись.Застрахованный = Объект.Ссылка;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Запись.ИзмениласьФамилия = ИзмениласьФамилия;
		Запись.Фамилия = ?(ИзмениласьФамилия = Истина, Объект.Фамилия, Неопределено);
		
		Запись.ИзменилосьИмя = ИзменилосьИмя;
		Запись.Имя = ?(ИзменилосьИмя = Истина, Объект.Имя, Неопределено);
		
		Запись.ИзменилосьОтчество = ИзменилосьОтчество;
		Запись.Отчество = ?(ИзменилосьОтчество = Истина, Объект.Отчество, Неопределено);
		
		Запись.ИзмениласьДатаРождения = ИзмениласьДатаРождения;
		Запись.ДатаРождения = ?(ИзмениласьДатаРождения = Истина, Объект.ДатаРождения, Неопределено);
		
		Запись.ИзменилсяСтраховойНомерПФР = ИзменилсяСНИЛС;
		Запись.СтраховойНомерПФР = ?(ИзменилсяСНИЛС = Истина, Объект.СНИЛС, Неопределено);

		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущиеСтрахованияРодственника(Родственник)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Организация КАК Организация,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ПрограммаСтрахования.СтраховаяКомпания КАК СтраховаяКомпания
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(, Родственник = &Родственник
		|	И Действует = ИСТИНА) КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Родственник", Родственник);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СоставСведенийДокументаУдостоверяющегоЛичность()
	
	Сведения = Новый Массив;
	
	Сведения.Добавить("ДокументПредставление");
	Сведения.Добавить("ДокументВид");
	Сведения.Добавить("ДокументСерия");
	Сведения.Добавить("ДокументНомер");
	Сведения.Добавить("ДокументДатаВыдачи");
	Сведения.Добавить("ДокументКемВыдан");
	Сведения.Добавить("ДокументСрокДействия");
	Сведения.Добавить("ДокументКодПодразделения");
	
	Возврат Сведения;
	
КонецФункции

Функция ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(ДоговорСтрахования) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации КАК Вид,
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации КАК Наименование,
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.СпособПроверкиЗаполнения КАК СпособПроверкиЗаполнения
		|ИЗ
		|	Справочник.ДоговорыСтрахования.ОтправляемаяКонтактнаяИнформация КАК
		|		ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация
		|ГДЕ
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.Ссылка = &ДоговорСтрахования
		|	И ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.Отправлять";
	Запрос.УстановитьПараметр("ДоговорСтрахования", ДоговорСтрахования);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(ДоговорСтрахования) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Сведение КАК Свойство,
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Сведение.Имя КАК Имя,
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Сведение.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Сведение.Наименование КАК Наименование,
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.СпособПроверкиЗаполнения
		|ИЗ
		|	Справочник.ДоговорыСтрахования.ОтправляемыеДополнительныеРеквизитыИСведения КАК
		|		ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Ссылка = &ДоговорСтрахования
		|	И ДоговорыСтрахованияОтправляемыеДополнительныеРеквизитыИСведения.Отправлять";
	Запрос.УстановитьПараметр("ДоговорСтрахования", ДоговорСтрахования);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьПрограммыМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Прикрепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ИСТИНА КАК Действует,
		|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
		|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
		|	ПрикреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрикреплениеПрограммыСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
		|			И ПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ПрикреплениеРодственники.ФизическоеЛицо,
		|	ПрикреплениеРодственники.РодственникСсылка,
		|	ПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|	ИСТИНА,
		|	ПрикреплениеРодственники.ДатаПрикрепления,
		|	ПрикреплениеРодственники.ДатаОткрепления,
		|	ПрикреплениеПрограммыСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрикреплениеПрограммыСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
		|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
		|			И ПрикреплениеПрограммыСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Прикрепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Прикрепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Прикрепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Прикрепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзПрикрепления(ПараметрыОбновления, Прикрепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
		|	ИСТИНА КАК Действует,
		|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
		|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
		|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ПрикреплениеРасширенияПрограммСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
		|			И ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ПрикреплениеРодственники.ФизическоеЛицо,
		|	ПрикреплениеРодственники.РодственникСсылка,
		|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
		|	ИСТИНА,
		|	ПрикреплениеРодственники.ДатаПрикрепления,
		|	ПрикреплениеРодственники.ДатаОткрепления,
		|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ПрикреплениеРасширенияПрограммСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
		|			И ПрикреплениеРасширенияПрограммСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Прикрепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Прикрепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Прикрепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Прикрепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьПрограммыМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Открепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ОткреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ЛОЖЬ КАК Действует,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
		|	ОткреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ОткреплениеПрограммыСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
		|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
		|			И ОткреплениеПрограммыСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ОткреплениеРодственники.ФизическоеЛицо,
		|	ОткреплениеПрограммыСтрахованияРодственников.РодственникСсылка,
		|	ОткреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|	ЛОЖЬ,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеПрограммыСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ОткреплениеПрограммыСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеРодственники
		|		ПО ОткреплениеПрограммыСтрахованияРодственников.Ссылка = ОткреплениеРодственники.Ссылка
		|			И ОткреплениеПрограммыСтрахованияРодственников.ФизическоеЛицо = ОткреплениеРодственники.ФизическоеЛицо
		|			И ОткреплениеПрограммыСтрахованияРодственников.Родственник = ОткреплениеРодственники.Родственник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеПрограммыСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Открепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Открепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Открепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Открепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьРасширенияПрограммМедицинскогоСтрахованияИзОткрепления(ПараметрыОбновления, Открепление)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Организация КАК Организация,
		|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
		|	ЛОЖЬ КАК Действует,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
		|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
		|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ОткреплениеРасширенияПрограммСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
		|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
		|			И ОткреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаДокумента.Организация,
		|	ОткреплениеРодственники.ФизическоеЛицо,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.РодственникСсылка,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
		|	ЛОЖЬ,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРодственники.ДатаОткрепления,
		|	ОткреплениеРасширенияПрограммСтрахованияРодственников.СтраховаяПремия
		|ИЗ
		|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ОткреплениеРасширенияПрограммСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Родственники КАК ОткреплениеРодственники
		|		ПО ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ОткреплениеРодственники.Ссылка
		|			И ОткреплениеРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо = ОткреплениеРодственники.ФизическоеЛицо
		|			И ОткреплениеРасширенияПрограммСтрахованияРодственников.Родственник = ОткреплениеРодственники.Родственник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
		|		ПО ОткреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
		|ГДЕ
		|	ТаблицаДокумента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Открепление);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.НаборЗаписей", "Регистратор", Открепление) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Открепление);
	Пока Результат.Следующий() Цикл
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат);
		СтрокаНабора.Регистратор = Открепление;
		НаборЗаписей.Записать();
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ДобавитьИзменениеКонтактнойИнформацииВМассив(Объект, ОтправленнаяКонтактнаяИнформация, ИзмененнаяКИ, ВосстановленнаяКИ)
	
	НовоеПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Объект, ОтправленнаяКонтактнаяИнформация.Вид);
	Если Не ЗначениеЗаполнено(НовоеПредставление) Тогда
		НовоеПредставление = "";
	КонецЕсли;
	Если НовоеПредставление = ОтправленнаяКонтактнаяИнформация.Представление Тогда
		ВосстановленнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
	Иначе
		ИзмененнаяКИ.Добавить(Новый Структура("Вид, Представление", ОтправленнаяКонтактнаяИнформация.Вид, НовоеПредставление));
	КонецЕсли;
	
КонецПроцедуры

Функция ДоговорСтрахованияПоПараметрам(ПараметрыДоговора, ДатаСозданияДоговора, ЗаполнитьУсловиямиПоУмолчанию = Ложь)
	
	ДоговорСтрахования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыДоговора, "ДоговорСтрахования");
	Если ЗначениеЗаполнено(ДоговорСтрахования) Тогда
		Возврат ДоговорСтрахования;
	КонецЕсли;
	
	ДоговорСтрахованияОбъект = Справочники.ДоговорыСтрахования.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(ДоговорСтрахованияОбъект, ПараметрыДоговора);
	ДоговорСтрахованияОбъект.Наименование = СтрШаблон(НСтр("ru = '%1 с %2'"),
		ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания);
	ДоговорСтрахованияОбъект.Номер = НСтр("ru = '____'");
	ДоговорСтрахованияОбъект.Владелец = ПараметрыДоговора.СтраховаяКомпания;
	ДоговорСтрахованияОбъект.ДоговорЗакрыт = ДоговорСтрахованияОбъект.ДатаОкончанияСтрахования < ДатаСозданияДоговора;
	ДоговорСтрахованияОбъект.Комментарий = НСтр("ru = 'Создан автоматически при переходе на учет по соглашениям'");
	
	Если ЗаполнитьУсловиямиПоУмолчанию Тогда
		ЗаполнитьУсловияДоговораНаОснованииУсловийПоУмолчанию(
			ДоговорСтрахованияОбъект, ПараметрыДоговора.Организация, ПараметрыДоговора.СтраховаяКомпания);
	Иначе
		ЗаполнитьУсловияДоговораНаОснованииПрикрепления(ДоговорСтрахованияОбъект, ПараметрыДоговора.Документ);
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДоговорСтрахованияОбъект);
	
	Возврат ДоговорСтрахованияОбъект.Ссылка;
	
КонецФункции

Процедура ЗаполнитьУсловияДоговораНаОснованииУсловийПоУмолчанию(ДоговорСтрахованияОбъект, Организация, СтраховаяКомпания)
	
	// Программы страхования
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдалитьПрограммыМедицинскогоСтрахованияПоУмолчанию.ПрограммаСтрахования
		|ИЗ
		|	РегистрСведений.УдалитьПрограммыМедицинскогоСтрахованияПоУмолчанию КАК
		|		УдалитьПрограммыМедицинскогоСтрахованияПоУмолчанию
		|ГДЕ
		|	УдалитьПрограммыМедицинскогоСтрахованияПоУмолчанию.Организация = &Организация
		|	И УдалитьПрограммыМедицинскогоСтрахованияПоУмолчанию.ПрограммаСтрахования.СтраховаяКомпания = &СтраховаяКомпания";
	
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ПрограммыМедицинскогоСтрахования.Добавить();
		НоваяСтрока.Программа = ВыборкаДетальныеЗаписи.ПрограммаСтрахования;
	КонецЦикла;
	
	// Адреса рассылки
	НаборЗаписей = РегистрыСведений.УдалитьАдресаОтправкиУведомленийСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.АдресаРассылки.Добавить();
		НоваяСтрока.Email = ЗаписьНабора.Email;
	КонецЦикла;
	
	// Шкала возраста
	НаборЗаписей = РегистрыСведений.УдалитьВозрастныеКоэффициентыСтраховыхКомпаний.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	ТаблицаШкалы = НаборЗаписей.Выгрузить();
	ТаблицаШкалы.Сортировать("ИндексСтроки");
	
	ЗначениеДоПредыдущее = 0;
	Для Каждого ТекСтрока Из ТаблицаШкалы Цикл 
		НоваяСтрока = ДоговорСтрахованияОбъект.ШкалаВозрастаДляСотрудников.Добавить();
		НоваяСтрока.ЗначениеОт = ЗначениеДоПредыдущее;
		НоваяСтрока.ЗначениеДо = ТекСтрока.ВерхняяГраницаИнтервалаВозраста;
		НоваяСтрока.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		МедицинскоеСтрахованиеКлиентСервер.СформироватьПредставлениеИнтервалаШкалыВозраста(НоваяСтрока);
		
		ЗначениеДоПредыдущее = НоваяСтрока.ЗначениеДо + 1;
	КонецЦикла;
	
	// Шкала возраста для родственников
	НаборЗаписей = РегистрыСведений.УдалитьВозрастныеКоэффициентыСтраховыхКомпанийДляРодственников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	ТаблицаШкалы = НаборЗаписей.Выгрузить();
	ТаблицаШкалы.Сортировать("ИндексСтроки");
	
	ЗначениеДоПредыдущее = 0;
	Для Каждого ТекСтрока Из ТаблицаШкалы Цикл 
		НоваяСтрока = ДоговорСтрахованияОбъект.ШкалаВозрастаДляРодственников.Добавить();
		НоваяСтрока.ЗначениеОт = ЗначениеДоПредыдущее;
		НоваяСтрока.ЗначениеДо = ТекСтрока.ВерхняяГраницаИнтервалаВозраста;
		НоваяСтрока.ЗначениеПоказателя = ТекСтрока.ЗначениеПоказателя;
		МедицинскоеСтрахованиеКлиентСервер.СформироватьПредставлениеИнтервалаШкалыВозраста(НоваяСтрока);
		
		ЗначениеДоПредыдущее = НоваяСтрока.ЗначениеДо + 1;
	КонецЦикла;
	
	// Настройки удержаний
	НаборЗаписей = РегистрыСведений.УдалитьНастройкиУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		ЗаписьНабора = НаборЗаписей[0];
		ДоговорСтрахованияОбъект.Удержание = ЗаписьНабора.Удержание;
		ДоговорСтрахованияОбъект.СпособУдержания = ЗаписьНабора.СпособУдержания;
		ДоговорСтрахованияОбъект.ТребуетсяУдержание = Истина;
		ДоговорСтрахованияОбъект.УдерживатьЗаСотрудника = ЗаписьНабора.УдержаниеЗаСотрудника;
		ДоговорСтрахованияОбъект.УдерживатьЗаРодственников = ЗаписьНабора.УдержаниеЗаРодственников;
		ДоговорСтрахованияОбъект.ПрименяетсяЧастичноеУдержание = ЗаписьНабора.ПрименяетсяЧастичноеУдержание;
		ДоговорСтрахованияОбъект.ПроцентЧастичногоУдержания = ЗаписьНабора.ПроцентЧастичногоУдержания;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УдалитьНастройкиГрафиковУдержанийМедицинскогоСтрахования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ГрафикУдержаний.Добавить();
		НоваяСтрока.МесяцУдержания = ЗаписьНабора.Дата;
		НоваяСтрока.МесяцУдержанияСтрокой = Формат(ЗаписьНабора.Дата, НСтр("ru='ДФ=''ММММ гггг'''"));
	КонецЦикла;
	
	// Отправляемые данные
	НаборЗаписей = РегистрыСведений.УдалитьОтправляемыеДанныеЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ОтправляемыеДанные.Добавить();
		НоваяСтрока.Сведение = ЗаписьНабора.Сведение;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
	// Отправляемая контактная информация
	НаборЗаписей = РегистрыСведений.УдалитьОтправляемаяКонтактнаяИнформацияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ОтправляемаяКонтактнаяИнформация.Добавить();
		НоваяСтрока.ВидКонтактнойИнформации = ЗаписьНабора.Вид;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не УправлениеСвойствами.СвойстваДоступны() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УдалитьОтправляемыеДополнительныеРеквизитыИСведенияЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	НаборЗаписей.Прочитать();
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ОтправляемыеДополнительныеРеквизитыИСведения.Добавить();
		НоваяСтрока.Сведение = ЗаписьНабора.Свойство;
		НоваяСтрока.Отправлять = ЗаписьНабора.Отправлять;
		НоваяСтрока.СпособПроверкиЗаполнения = ЗаписьНабора.СпособПроверкиЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьУсловияДоговораНаОснованииПрикрепления(ДоговорСтрахованияОбъект, Документ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Документ);
	// АПК:96-выкл ОБЪЕДИНИТЬ является необходимым условием запроса
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрикреплениеСотрудники.УдерживатьИзЗарплаты) КАК УдерживатьЗаСотрудника,
		|	МАКСИМУМ(ПрикреплениеРодственники.УдерживатьССотрудника) КАК УдерживатьЗаРодственников,
		|	МАКСИМУМ(ПрикреплениеСотрудники.Удержание) КАК Удержание,
		|	МАКСИМУМ(ПрикреплениеСотрудники.СпособУдержания) КАК СпособУдержания,
		|	МАКСИМУМ(ПрикреплениеСотрудники.ЧастичноеУдержание) КАК ПрименяетсяЧастичноеУдержание,
		|	МАКСИМУМ(ПрикреплениеСотрудники.ПроцентЧастичногоУдержания) КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеДокумент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
		|		ПО ПрикреплениеДокумент.Ссылка = &Ссылка
		|		И ПрикреплениеДокумент.Ссылка = ПрикреплениеСотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
		|		ПО ПрикреплениеСотрудники.Ссылка = ПрикреплениеРодственники.Ссылка
		|		И ПрикреплениеСотрудники.ФизическоеЛицо = ПрикреплениеРодственники.ФизическоеЛицо
		|СГРУППИРОВАТЬ ПО
		|	ПрикреплениеДокумент.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|		ПрикреплениеПрограммыСтрахованияСотрудников
		|ГДЕ
		|	ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|		ПрикреплениеПрограммыСтрахованияРодственников
		|ГДЕ
		|	ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = &Ссылка";
	// АПК:96-вкл
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаУдержаний = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	ВыборкаПрограммСтрахования = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	
	Если ВыборкаУдержаний.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДоговорСтрахованияОбъект, ВыборкаУдержаний);
		ДоговорСтрахованияОбъект.ТребуетсяУдержание =
			ДоговорСтрахованияОбъект.УдерживатьЗаСотрудника Или ДоговорСтрахованияОбъект.УдерживатьЗаРодственников;
	КонецЕсли;
	
	Пока ВыборкаПрограммСтрахования.Следующий() Цикл
		НоваяСтрока = ДоговорСтрахованияОбъект.ПрограммыМедицинскогоСтрахования.Добавить();
		НоваяСтрока.Программа = ВыборкаПрограммСтрахования.ПрограммаСтрахования;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНовыйРегистрСведенийНаОснованииУдаленного(ИмяРегистра, Организация, СтраховаяКомпания, ДоговорСтрахования)
	
	СтарыйНаборЗаписей = РегистрыСведений["Удалить" + ИмяРегистра].СоздатьНаборЗаписей();
	СтарыйНаборЗаписей.Отбор.Организация.Установить(Организация);
	СтарыйНаборЗаписей.Отбор.СтраховаяКомпания.Установить(СтраховаяКомпания);
	СтарыйНаборЗаписей.Прочитать();
	
	Если СтарыйНаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ДоговорСтрахования);
	Для Каждого Запись Из СтарыйНаборЗаписей Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
		НоваяЗапись.ДоговорСтрахования = ДоговорСтрахования;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
КонецПроцедуры

Функция ТаблицаИзМассиваСтруктур(МассивСтруктур) Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Если МассивСтруктур.Количество() = 0 Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли;
	
	Для каждого Свойство Из МассивСтруктур[0] Цикл
		ТипКолонки = ТипЗнч(Свойство.Значение);
		Типы = Новый Массив(1);
		Типы.Добавить(ТипКолонки);
		ТаблицаЗначений.Колонки.Добавить(Свойство.Ключ, Новый ОписаниеТипов(Типы));
	КонецЦикла;
	
	Для каждого Элемент Из МассивСтруктур Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), Элемент);
	КонецЦикла;
	
	Возврат ТаблицаЗначений;
	
КонецФункции
	
#КонецОбласти
