
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Банк) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Банк", Параметры.Банк, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	ОформитьИСкрытьНедействительныеНастройкиОбмена();
	
	ЭтоИнтерфейс85 = ОбменСБанкамиКлиентСервер.ЭтоИнтерфейс85();
	
	ПравоНастройкиОбмена = ОбменСБанкамиСлужебныйВызовСервера.ПравоНастройкиОбмена();
	
	// Управляет доступностью команды Создать
	МожноСоздаватьНовые = ПравоНастройкиОбмена И НЕ ОбщегоНазначения.ЭтоМобильныйКлиент();
	Элементы.Список.ИзменятьСоставСтрок = МожноСоздаватьНовые;
	Элементы.СписокЗагрузитьНастройкиИзФайла.Видимость = МожноСоздаватьНовые И Не ЭтоИнтерфейс85;
	Элементы.ЗагрузитьНастройкиИзФайла85.Видимость = МожноСоздаватьНовые И ЭтоИнтерфейс85;
	
	Элементы.ФормаКоманднаяПанель.Видимость = ЭтоИнтерфейс85;
	
	ПравоВыполненияОбмена = ОбменСБанкамиСлужебныйВызовСервера.ПравоВыполненияОбмена();
	
	Элементы.ОткрытьСообщенияОбменаСБанками.Видимость   = ПравоВыполненияОбмена И Не ЭтоИнтерфейс85;
	Элементы.ОткрытьСообщенияОбменаСБанками85.Видимость = ПравоВыполненияОбмена И ЭтоИнтерфейс85;	
	
	Элементы.ОткрытьПакетыЭДОСБанками.Видимость   = ПравоВыполненияОбмена И Не ЭтоИнтерфейс85;
	Элементы.ОткрытьПакетыЭДОСБанками85.Видимость = ПравоВыполненияОбмена И ЭтоИнтерфейс85;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НастройкиИзменитьФорму85", "Видимость", ЭтоИнтерфейс85);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НастройкиИзменитьФорму", "Видимость", НЕ ЭтоИнтерфейс85);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьНедействительныеНастройкиОбменаПриИзменении(Элемент)
	
	ПереключитьОтображениеНедействительныхНастроекОбмена(ПоказыватьНедействительныеНастройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСпискаФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	СоздатьНастройкуОбменаСБанком();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПакетыЭДОСБанками(Команда)
	
	ОткрытьФорму("Документ.ПакетОбменСБанками.Форма.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиИзФайла(Команда)
	
	ОчиститьСообщения();
	Фильтр = НСтр("ru = 'Файл настроек обмена'") + "(*.xml)|*.xml";
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаНастроекОбмена", ЭтотОбъект);
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.Диалог.Фильтр = Фильтр;
	ПараметрыЗагрузки.Диалог.МножественныйВыбор = Ложь;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл настроек обмена'");
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОписаниеОповещения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСообщенияОбменаСБанками(Команда)
	
	ОткрытьФорму("Документ.СообщениеОбменСБанками.Форма.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереключитьОтображениеНедействительныхНастроекОбмена(ПоказатьНедействительные)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Недействительна", Ложь, , , НЕ ПоказатьНедействительные);
	
КонецПроцедуры

&НаСервере
Процедура ОформитьИСкрытьНедействительныеНастройкиОбмена()
	
	// Оформление.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ШрифтНедействительногоЭлемента = Новый Шрифт(Элементы.Список.Шрифт, , , , , , Истина);

	Если ОбменСБанкамиКлиентСервер.ЭтоИнтерфейс85() Тогда
		ЦветНедействительногоЭлемента  = ЦветаПалитры.Серый; 
	Иначе
		ЦветНедействительногоЭлемента = Метаданные.ЭлементыСтиля.НедоступныеДанныеЭДЦвет.Значение;
	КонецЕсли;
	
	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("TextColor");
	ЭлементЦветаОформления.Значение = ЦветНедействительногоЭлемента;
	ЭлементЦветаОформления.Использование = Истина;

	ЭлементЦветаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Font");
	ЭлементЦветаОформления.Значение = ШрифтНедействительногоЭлемента;
	ЭлементЦветаОформления.Использование = Истина;

	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Список.Недействительна");
	ЭлементОтбораДанных.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	ЭлементОтбораДанных.Использование  = Истина;
	
	ЭлементОформляемогоПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементОформляемогоПоля.Поле = Новый ПолеКомпоновкиДанных("Список");
	ЭлементОформляемогоПоля.Использование = Истина;
	
	// Скрытие.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Недействительна", Ложь, , , Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаНастроекОбмена(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		АдресФайлаНастроек = ВыбранныеФайлы.Хранение;
		ЗапуститьПомощникПодключения(АдресФайлаНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПомощникПодключения(АдресФайлаНастроек)
	
	ПараметрыФормы = Новый Структура("АдресДанныхФайлаНастроек, ЛокальныйФайл", АдресФайлаНастроек, Истина);
	ОткрытьФорму("Справочник.НастройкиОбменСБанками.Форма.ПомощникСозданияНастройкиОбмена", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуОбменаСБанком()
	
	ОчиститьСообщения();
	ПараметрыФормы = Новый Структура;
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Параметры.Организация);
	ЗначенияЗаполнения.Вставить("Банк", Параметры.Банк);
	
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.НастройкиОбменСБанками.Форма.ПомощникСозданияНастройкиОбмена", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти
