#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает значение флага ВыявленыВредныеОпасныеФакторы в зависимости от класса условий труда.
//
// Параметры:
//  СтрокаДанных - Произвольный - строка с полями КлассУсловийТруда и ВыявленыВредныеОпасныеФакторы.
//  ПредыдущийКлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки -
//  ЭлементыФормы - ЭлементыФормы - Необязательный, передается, если требуется обновление доступности поля флага на форме.
//
Процедура УстановитьФлагВредныхФакторовПоКлассу(СтрокаДанных, ПредыдущийКлассУсловийТруда, ЭлементыФормы = Неопределено) Экспорт

	Класс = СтрокаДанных.КлассУсловийТруда;
	ВредныеКлассы = КлассыУсловийТрудаКлиентСервер.ВредныеИОпасныеКлассыУсловийТруда();

	Если ВредныеКлассы.Найти(Класс) <> Неопределено Тогда
		СтрокаДанных.ВыявленыВредныеОпасныеФакторы = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Класс) Или ВредныеКлассы.Найти(ПредыдущийКлассУсловийТруда) <> Неопределено Тогда
		СтрокаДанных.ВыявленыВредныеОпасныеФакторы = Ложь;
	КонецЕсли;

	Если ЭлементыФормы <> Неопределено Тогда
		КлассыУсловийТрудаКлиентСервер.УстановитьДоступностьФлагаВредныхФакторов(ЭлементыФормы, Класс);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
