
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияС1СДокументооборот

Функция СостояниеСогласованияБЗК(ТипРеквизита, СостояниеДО) Экспорт
	
	Результат = Неопределено;
	
	Если ТипРеквизита = Тип("ПеречислениеСсылка.СтатусыЗаявокСотрудников") Тогда
		
		Если СостояниеДО = "Согласован" Тогда
			Результат = Перечисления.СтатусыЗаявокСотрудников.Согласовано;
			
		ИначеЕсли СостояниеДО = "НеСогласован" Тогда
			Результат = Перечисления.СтатусыЗаявокСотрудников.Отклонено;
			
		ИначеЕсли СостояниеДО = "НаСогласовании" Тогда
			Результат = Перечисления.СтатусыЗаявокСотрудников.Рассматривается;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриЗаполненииСтатусаСогласованияПоЗначению(Значение, Свойства, СтандартнаяОбработка) Экспорт
	
	Если Не ТипЗнч(Значение) = Тип("ПеречислениеСсылка.СтатусыЗаявокСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Перечисления.СтатусыЗаявокСотрудников.Согласовано Тогда
		Свойства.СостояниеСогласование = НСтр("ru = 'Согласовано'");
		Свойства.СостояниеСогласованиеID = "Согласовано";
		Свойства.СостояниеСогласованиеТип = "DMDocumentStatus";
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Значение = Перечисления.СтатусыЗаявокСотрудников.Отклонено Тогда
		Свойства.СостояниеСогласование = НСтр("ru = 'Не согласовано'");
		Свойства.СостояниеСогласованиеID = "НеСогласовано";
		Свойства.СостояниеСогласованиеТип = "DMDocumentStatus";
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Значение = Перечисления.СтатусыЗаявокСотрудников.Рассматривается Тогда
		Свойства.СостояниеСогласование = НСтр("ru = 'На согласовании'");
		Свойства.СостояниеСогласованиеID = "НаСогласовании";
		Свойства.СостояниеСогласованиеТип = "DMDocumentStatus";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли