////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицинское страхование"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИнформациюПоСпособуРасчета(Форма) Экспорт

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаУдержаний.ДМС") Тогда
		Элементы.СпособРасчетаСтраницы.ТекущаяСтраница = Элементы.ДМССтраница;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОтображениеСвойстваУчаствуетВРасчетеПервойПоловиныМесяца(Форма) Экспорт

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.КатегорияУдержания = ПредопределенноеЗначение("Перечисление.КатегорииУдержаний.ДМС") Тогда
		Элементы.УдерживаетсяПриРасчетеПервойПоловиныМесяцаСтраницы.ТекущаяСтраница = Элементы.УдерживаетсяПриРасчетеПервойПоловиныМесяцаНеОтображаетсяСтраница;
	КонецЕсли;
	
КонецПроцедуры

Функция НовыйДанныеСтрокиСотрудника() Экспорт
	
	ДанныеСтрокиСотрудника = Новый Структура;
	ДанныеСтрокиСотрудника.Вставить("Сотрудник");
	ДанныеСтрокиСотрудника.Вставить("ФизическоеЛицо");
	ДанныеСтрокиСотрудника.Вставить("Удержание");
	ДанныеСтрокиСотрудника.Вставить("ОбщаяСуммаУдержания");
	ДанныеСтрокиСотрудника.Вставить("ЧастичноеУдержание");
	ДанныеСтрокиСотрудника.Вставить("СуммаЧастичногоУдержания");
	ДанныеСтрокиСотрудника.Вставить("УдерживатьИзЗарплаты");
	ДанныеСтрокиСотрудника.Вставить("ПроцентЧастичногоУдержания");
	
	Возврат ДанныеСтрокиСотрудника;
	
КонецФункции

Процедура СформироватьПредставлениеИнтервалаШкалыВозраста(СтрокаШкалы) Экспорт
	
	Если СтрокаШкалы.ЗначениеОт = 0 И СтрокаШкалы.ЗначениеДо = 0 Тогда 
		ПредставлениеОт = НСтр("ru = 'от'");
		ПредставлениеДо = НСтр("ru = 'до'");
	ИначеЕсли СтрокаШкалы.ЗначениеОт = 0 И СтрокаШкалы.ЗначениеДо <> 0 Тогда
		ПредставлениеОт = "";
		ПредставлениеДо = СтрШаблон(НСтр("ru = 'до %1'"), Строка(СтрокаШкалы.ЗначениеДо));
	ИначеЕсли СтрокаШкалы.ЗначениеОт <> 0 И СтрокаШкалы.ЗначениеДо = 0 Тогда
		ПредставлениеОт = СтрШаблон(НСтр("ru = 'свыше %1'"), Строка(СтрокаШкалы.ЗначениеОт));
		ПредставлениеДо = "";
	Иначе
		ПредставлениеОт = СтрШаблон(НСтр("ru = 'от %1'"), Строка(СтрокаШкалы.ЗначениеОт));
		ПредставлениеДо = СтрШаблон(НСтр("ru = 'до %1'"), Строка(СтрокаШкалы.ЗначениеДо));
	КонецЕсли;
	
	СтрокаШкалы.ПредставлениеОт = ПредставлениеОт;
	СтрокаШкалы.ПредставлениеДо = ПредставлениеДо;
	
КонецПроцедуры

#КонецОбласти