#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Обучение и развитие";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Мероприятия обучение и развитие", СтатистикаМероприятий());
	Статистика.Вставить("Сотрудники(Обучение и развитие сотрудников)", СтатистикаСотрудников());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Индивидуальный план развития", СтатистикаИндивидуальныхПлановРазвития(НачалоПериода));
	Статистика.Вставить("Мероприятия(Индивидуальный план развития)", СтатистикаМероприятийИПР(НачалоПериода));
	Статистика.Вставить("Заявка на обучение и развитие", СтатистикаЗаявокНаОбучениеРазвитие(НачалоПериода));
	Статистика.Вставить("Заявка на включение в план обучения", СтатистикаЗаявокВключениеВПланОбучения(НачалоПериода));
	Статистика.Вставить("Обучение и развитие сотрудников", СтатистикаОбученийРазвитийСотрудников(НачалоПериода));
	Статистика.Вставить("План обучения и развития", СтатистикаПлановОбученияРазвития(НачалоПериода));
	Статистика.Вставить("Мероприятия(План обучения и развития)", СтатистикаМероприятийПОР(НачалоПериода));
	Статистика.Вставить("Ученический договор", СтатистикаУченическихДоговоров(НачалоПериода));
	Статистика.Вставить("Обязательства(Ученический договор)", СтатистикаОбязательств(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаМероприятий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МероприятияОбученияРазвития.Ссылка) КАК Мероприятий,
		|	МероприятияОбученияРазвития.СпособПроведения КАК СпособПроведения
		|ИЗ
		|	Справочник.МероприятияОбученияРазвития КАК МероприятияОбученияРазвития
		|ГДЕ
		|	МероприятияОбученияРазвития.ВАрхиве = ЛОЖЬ
		|	И МероприятияОбученияРазвития.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	МероприятияОбученияРазвития.СпособПроведения";
	
	ВсегоМероприятий = 0;
	ПоказателиСтатистики = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПредставлениеПеречисления = Строка(Выборка.СпособПроведения);
		Если Не ЗначениеЗаполнено(ПредставлениеПеречисления) Тогда
			ПредставлениеПеречисления = "Пустых способов проведения";
		КонецЕсли;
		ПоказателиСтатистики.Вставить(ПредставлениеПеречисления, Выборка.Мероприятий);
		ВсегоМероприятий = ВсегоМероприятий + Выборка.Мероприятий;
	КонецЦикла;
	ПоказателиСтатистики.Вставить("Мероприятий", ВсегоМероприятий);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаСотрудников()
	
	Родитель = Метаданные.Документы.ОбучениеРазвитиеСотрудников;
	Таблица = Родитель.ТабличныеЧасти.Сотрудники;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Сотрудник;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Сотрудников";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Обучение";
	ДанныеГруппировки.ПредставлениеГруппировки = "Обучений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаИндивидуальныхПлановРазвития(НачалоПериода)
	
	Таблица = Метаданные.Справочники.ИндивидуальныйПланРазвития;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Планов развития";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ДатаНачала;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Подразделение;
	ДанныеГруппировки.ПредставлениеГруппировки = "Подразделений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаМероприятийИПР(НачалоПериода)
	
	Родитель = Метаданные.Справочники.ИндивидуальныйПланРазвития;
	Таблица = Родитель.ТабличныеЧасти.Мероприятия;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Мероприятие;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Мероприятий";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ДатаНачала;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаЗаявокНаОбучениеРазвитие(НачалоПериода)
	
	Таблица = Метаданные.Документы.ЗаявкаНаОбучениеРазвитие;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Заявок";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Мероприятие;
	ДанныеГруппировки.ПредставлениеГруппировки = "Мероприятий";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаЗаявокВключениеВПланОбучения(НачалоПериода)
	
	Таблица = Метаданные.Документы.ЗаявкаНаВключениеВПланОбучения;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Заявок";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Мероприятие;
	ДанныеГруппировки.ПредставлениеГруппировки = "Мероприятий";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаОбученийРазвитийСотрудников(НачалоПериода)
	
	Таблица = Метаданные.Документы.ОбучениеРазвитиеСотрудников;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Обучений";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбучениеРазвитиеСотрудников.Ссылка) КАК Документов
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников КАК ОбучениеРазвитиеСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбучениеРазвитиеСотрудников.Расходы КАК ОбучениеРазвитиеСотрудниковРасходы
		|		ПО ОбучениеРазвитиеСотрудников.Ссылка = ОбучениеРазвитиеСотрудниковРасходы.Ссылка
		|ГДЕ
		|	ОбучениеРазвитиеСотрудниковРасходы.НомерСтроки > 1
		|	И ОбучениеРазвитиеСотрудников.Проведен = ИСТИНА
		|	И ОбучениеРазвитиеСотрудников.ПометкаУдаления = ЛОЖЬ
		|	И ОбучениеРазвитиеСотрудников.Дата > &НачалоПериода
		|	И ОбучениеРазвитиеСотрудников.Дата <= &КонецПериода";
	
	ПоказателиСтатистики.Вставить("Обучений c расходами", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Документов")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПлановОбученияРазвития(НачалоПериода)
	
	Таблица = Метаданные.Документы.ПланОбученияРазвития;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Планов";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Подразделение;
	ДанныеГруппировки.ПредставлениеГруппировки = "Подразделений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаМероприятийПОР(НачалоПериода)
	
	Родитель = Метаданные.Документы.ПланОбученияРазвития;
	Таблица = Родитель.ТабличныеЧасти.Мероприятия;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Мероприятие;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Мероприятий";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ДатаНачала;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Подразделение;
	ДанныеГруппировки.ПредставлениеГруппировки = "Подразделений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаУченическихДоговоров(НачалоПериода)
	
	Таблица = Метаданные.Документы.УченическийДоговор;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Договоров";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаОбязательств(НачалоПериода)
	
	Родитель = Метаданные.Документы.УченическийДоговор;
	Таблица = Родитель.ТабличныеЧасти.Обязательства;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.НомерСтроки;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Обязательств";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ПериодРаботы;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Ученический договор";
	ДанныеГруппировки.ПредставлениеГруппировки = "Ученических договоров";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти