// @strict-types

#Область ПрограммныйИнтерфейс

// Выполняет запуск подключения к шине
// 
// Параметры:
//  Параметры - см. НовыеПараметрыПодключения
//  
Процедура Подключиться(Параметры) Экспорт
	
	Если ТребуетсяЗакрытиеВебСокета() Тогда

		// соединение больше не нужно
		Соединения = WebSocketКлиентСоединения.ПолучитьСоединения();
		Для Каждого Соединение Из Соединения Цикл
			//@skip-check query-in-loop
			Отключиться(Соединение);
		КонецЦикла;
		
		Возврат;
	КонецЕсли;
	КлючСоединения = КлючСоединения(Параметры);

	Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения); // WebSocketКлиентСоединение

	ДобавитьПодписку(Параметры, Соединение);
	
	Если Соединение = Неопределено Или СоединениеЗакрыто(Соединение) Тогда
		Если Соединение <> Неопределено Тогда
			Отключиться(Соединение); // Переподключаемся, т.к. соединение закрыто
		КонецЕсли;
		
		ПараметрыСоединения = Новый ПараметрыWebSocketКлиентСоединения(); // ПараметрыWebSocketКлиентСоединения
		ПараметрыСоединения.Пароль = Параметры.Пароль;
		ПараметрыСоединения.Пользователь = Параметры.Пользователь;
		ПараметрыСоединения.Таймаут = Параметры.Таймаут;
		ПараметрыСоединения.ДополнительныеПараметры = ОбщегоНазначения.СкопироватьРекурсивно(Параметры);
	
		ОбработчикиСокета = Новый ОбработчикиWebSocketКлиентСоединения(); // ОбработчикиWebSocketКлиентСоединения
		ОбработчикиСокета.Модуль = Отчетность24БРОШинаСлужебный;
		ОбработчикиСокета.ОбработчикОткрытияСоединения = "ПриОткрытииСоединения";
		ОбработчикиСокета.ОбработчикПолученияСообщения = "ПриПолученииСообщенияСлужебный";
		ОбработчикиСокета.ОбработчикОшибки             = "ПриОшибкеСоединения";
		ОбработчикиСокета.ОбработчикЗакрытияСоединения = "ПриЗакрытииСоединения";

		СтрокаПодключения = СтрокаПодключения(Параметры);

		Соединение = WebSocketКлиентСоединения.ОткрытьСоединение(КлючСоединения, СтрокаПодключения, ОбработчикиСокета, ПараметрыСоединения); // WebSocketКлиентСоединение
	КонецЕсли;
	
	ЗаписатьСохраняемыеПараметрыСокета(Соединение.Ключ);
	
КонецПроцедуры

// Выполняет отмену подписок и отключение от шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура Отключиться(Соединение) Экспорт

	Если СоединениеЗакрыто(Соединение) Тогда
		Возврат; // На клиент-серверных базах есть проблема с закрытием сокета при сохранении конфигурации
	КонецЕсли;
	
	Попытка
		РазрешитьЗакрытиеСокета(Соединение, Истина);
		
		// закрываем подключенные подписки
		ОформленныеПодписки = ОформленныеПодписки(Соединение.Ключ);
		Для Каждого КлючИЗначение Из ОформленныеПодписки Цикл
			ИмяПодписки = КлючИЗначение.Ключ;
			Подписка = Подписка(ИмяПодписки,
				ТипыПриемниковОбработкиСообщений().ПоШаблону, "auto"); // получение сообщений адресованных этой базе
			Соединение.ОтправитьСообщение(КомандаОтменыПодпискиНаПолучениеСообщений(Подписка));
		КонецЦикла;
		
		Соединение.ОтправитьСообщение(КомандаОтключения());
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Соединение.Закрыть();
	
КонецПроцедуры

// Добавляет сообщение в очередь для отправки.
// 
// Параметры:
//  Ключ - Строка
//  Сообщение  - см. НовоеСообщениеДляОтправки
Процедура ПоместитьСообщениеВОчередьДляОтправки(Ключ, Сообщение) Экспорт

	Попытка
		СохраненныеПараметры = СохраняемыеПараметрыСокета(Ключ);
		Если СохраненныеПараметры.Количество() > 0 Тогда
			// В разделяемом режиме всегда одна база
			СохраненныеПараметры[0].СообщенияДляОтправки.Добавить(Сообщение);
		КонецЕсли;
		ЗаписатьСохраняемыеПараметрыСокета(Ключ, СохраненныеПараметры);
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;

	Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(Ключ); // WebSocketКлиентСоединение

	Если Соединение <> Неопределено И Не СоединениеЗакрыто(Соединение) Тогда
		ОтправитьСообщения(Соединение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСоедиения

// Обработчик срабатывающий при открытии соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура ПриОткрытииСоединения(Соединение) Экспорт
	
	Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	КомандаПодключения = КомандаПодключения(Параметры);
	Попытка
		Если Не СоединениеЗакрыто(Соединение) Тогда
			Соединение.ОтправитьСообщение(КомандаПодключения);
		КонецЕсли;
	Исключение
		КлючОбработки = "ПриОткрытииСоединения";
		ЗаписьЖурналаРегистрации(
			СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки),
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Если Параметры.ПереподключениеПриЗакрытииСоединения Тогда
			Подключиться(Параметры);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

// Обработчик срабатывающий при закрытии соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение - 
//  КодЗакрытия - Число
Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт

	Если КодЗакрытия <> 1005 Тогда
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон("%1 - Закрылся сокет с кодом: %2", Соединение.URLСервера, КодЗакрытия));
	КонецЕсли;
	
	РазрешитьЗакрытие = РазрешеноЗакрытиеСоединения(Соединение.Ключ);
	
	ПараметрыСозданияСоединения = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	Если Не РазрешитьЗакрытие И ПараметрыСозданияСоединения.ПереподключениеПриЗакрытииСоединения Тогда
		// Переподключение
		Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
		Подключиться(Параметры);
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при ошибке соединения
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение - 
//  КодОшибки  - Строка
//  Описание   - Строка
Процедура ПриОшибкеСоединения(Соединение, КодОшибки, Описание) Экспорт

	КлючОбработки = "ПриОшибкеСоединения";
	ЗаписьЖурналаРегистрации(
		СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки),
		УровеньЖурналаРегистрации.Ошибка, , ,
		СтрШаблон("%1 - %2 %3", Соединение.URLСервера, КодОшибки, Описание));

	ВызватьПаузу(2000);
	
	Параметры = Соединение.Параметры.ДополнительныеПараметры; // см. НовыеПараметрыПодключения
	Если Параметры.ПереподключениеПриЗакрытииСоединения Тогда
		Подключиться(Параметры);
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении сообщений из шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт

	КлючОбработки = "ПриПолученииСообщения";
	ДополнительныеПараметры = Соединение.Параметры.ДополнительныеПараметры; // Структура
	Обработчик = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, КлючОбработки); // Строка
	Если Обработчик = "Отчетность24БРОШинаУведомления.ПриПолученииСообщения" Тогда
		Попытка
			Отчетность24БРОШинаУведомления.ПриПолученииСообщения(Соединение, Сообщение);
		Исключение
			ЗаписьЖурналаРегистрации(
				СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки), УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении ошибки доставки сообщения в шину
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПолученииОшибки(Соединение, Сообщение) Экспорт

	КлючОбработки = "ПриПолученииОшибки";
	ЗаписьЖурналаРегистрации(
		СтрШаблон("ШинаRabbitMQ.%1", КлючОбработки), УровеньЖурналаРегистрации.Ошибка, , ,
		Сообщение.Тело);

КонецПроцедуры

// Обработчик срабатывающий при получении уведомления об удачной доставке сообщения в шину
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Сообщение  - см. СообщениеSTOMP
Процедура ПриПодтвержденииОтправкиСообщения(Соединение, Сообщение) Экспорт

	ИдентификаторОтправленногоСообщения = Сообщение.Заголовки["receipt-id"];
	
	Если ЗначениеЗаполнено(ИдентификаторОтправленногоСообщения) Тогда
		НашлиСообщение = Ложь;
		// Находим сообщение и удаляем его из очереди на доставку	
		СохраняемыеПараметрыСокета = СохраняемыеПараметрыСокета(Соединение.Ключ);
		Для Каждого ПараметрыБазы Из СохраняемыеПараметрыСокета Цикл
			СообщенияДляОтправки = ПараметрыБазы.СообщенияДляОтправки;
			Для Каждого СообщениеДляОтправки Из СообщенияДляОтправки Цикл
				Если СообщениеДляОтправки.ИдентификаторОтправки = ИдентификаторОтправленногоСообщения Тогда
					Индекс = СообщенияДляОтправки.Найти(СообщениеДляОтправки);
					Если Индекс <> Неопределено Тогда
						НашлиСообщение = Истина;
						СообщенияДляОтправки.Удалить(Индекс);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НашлиСообщение Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НашлиСообщение Тогда
			ЗаписатьСохраняемыеПараметрыСокета(Соединение.Ключ, СохраняемыеПараметрыСокета);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

// Обработчик срабатывающий при получении сообщений из шины
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение
//  Данные     - Строка
Процедура ПриПолученииСообщенияСлужебный(Соединение, Данные) Экспорт
	
	Попытка

		Сообщение = СообщениеSTOMP(Данные);

		Если Не ЗначениеЗаполнено(Сообщение.Команда) Тогда 
			// Поддержка соединения
			ОтправитьСообщение(Соединение, Символы.ПС);

			Если ТребуетсяЗакрытиеВебСокета() Тогда
				Отключиться(Соединение);
			КонецЕсли;

		ИначеЕсли Сообщение.Команда = КомандыСервера().ПодключениеВыполнено Тогда
			
			РазрешитьЗакрытиеСокета(Соединение, Ложь);
			
			// При соединении оформляем подписки.
			ОформленныеПодписки = ОформленныеПодписки(Соединение.Ключ);
			Если РаботаВМоделиСервиса.РазделениеВключено() Тогда

				// Удаление неиспользуемых областей
				ВыборкаИспользуемыеОбластиДанных = РаботаВМоделиСервиса.ИспользуемыеОбластиДанных();
				МассивОбластей = ВыборкаИспользуемыеОбластиДанных.Выгрузить().ВыгрузитьКолонку("ОбластьДанных");

				Для Каждого КлючИЗначение Из ОформленныеПодписки Цикл
					Если МассивОбластей.Найти(КлючИЗначение.Значение.ОбластьДанных) = Неопределено Тогда
						ОформленныеПодписки.Удалить(КлючИЗначение.Ключ);
					КонецЕсли;
				КонецЦикла;

			КонецЕсли;

			Для Каждого КлючИЗначение Из ОформленныеПодписки Цикл
				ИмяПодписки = КлючИЗначение.Ключ;
				Подписка = Подписка(ИмяПодписки, ТипыПриемниковОбработкиСообщений().ПоШаблону, "auto"); // получение сообщений адресованных этой базе
				ОтправитьСообщение(Соединение, КомандаПодпискаНаПолучениеСообщений(Подписка));
			КонецЦикла;

			ОтправитьСообщения(Соединение);

		ИначеЕсли Сообщение.Команда = КомандыСервера().Ошибка Тогда
			ПриПолученииОшибки(Соединение, Сообщение);
		ИначеЕсли Сообщение.Команда = КомандыСервера().ВходящееСообщение Тогда
		
			// получение сообщение из очереди по подписке
			ИмяПодписки = Сообщение.Заголовки["subscription"];
			ОформленныеПодписки = ОформленныеПодписки(Соединение.Ключ);
			ПараметрыПодписки = ОформленныеПодписки.Получить(ИмяПодписки);
			Если ПараметрыПодписки <> Неопределено Тогда
				Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
					РаботаВМоделиСервиса.ВойтиВОбластьДанных(ПараметрыПодписки.ОбластьДанных);
					ПриПолученииСообщения(Соединение, Сообщение);
					РаботаВМоделиСервиса.ВыйтиИзОбластиДанных();
				Иначе
					ПриПолученииСообщения(Соединение, Сообщение);
				КонецЕсли;
			КонецЕсли;

		ИначеЕсли Сообщение.Команда = КомандыСервера().ПодтверждениеОтправки Тогда  // отправленное сообщение на шину успешно доставлено
			ПриПодтвержденииОтправкиСообщения(Соединение, Сообщение);
		Иначе

			ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ", УровеньЖурналаРегистрации.Информация, , , 
				СтрШаблон("Получена неучтенная команда из Шины
					|Команда:'%1'
					|Тело:   '%2'", Сообщение.Команда, Сообщение.Тело));

		КонецЕсли;

	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

// Конструктор параметров подключения к серверу RabbitMQ
// 
// Возвращаемое значение:
//  Структура - Новые параметры подключения:
//	* Сервер               - Строка
//	* Путь                 - Строка - Request-URI
//	* Порт                 - Число  - Порт обслуживающий STOMP
//	* ПереподключениеПриЗакрытииСоединения - Булево 
//	* ПоддерживаемыеВерсии - Строка - поддерживаемые версии протокола (1.0,1.1,1.2)
//	* Пользователь         - Строка - логин
//	* Пароль               - Строка - пароль
//	* ЗащищенноеСоединение - Булево - влияет на URL ws:// или wss://
//	* ВиртуальныйХост      - Строка - виртуальный хост
//	* Заголовки            - Соответствие Из КлючИЗначение:
//	** Ключ                - Строка
//	** Значение            - Строка
//	* Таймаут              - Число  - Таймаут в секундах
//	* ЧастотаПульса        - Число  - частота подтвержения активности в милисекундах
//	* ИдентификаторБазы    - Строка
//	* ИдентификаторНаШине  - Строка
//	* ОбластьДанных        - Число
//	* ПриОткрытииСоединения - Строка - Пример: "ПолучениеУведомленийНовости.ПриОткрытииСоединения" - см. ПриОткрытииСоединения
//	* ПриОшибкеСоединения   - Строка - Пример: "ПолучениеУведомленийНовости.ПриОшибкеСоединения"   - см. ПриОшибкеСоединения
//	* ПриЗакрытииСоединения - Строка - Пример: "ПолучениеУведомленийНовости.ПриЗакрытииСоединения" - см. ПриЗакрытииСоединения
//	* ПриПодтвержденииОтправкиСообщения     - Строка - см. ПриПодтвержденииОтправкиСообщения - Служит для фиксации результата отправки
//	* ПриПолученииОшибки                    - Строка - см. ПриПолученииОшибки - Обработка ошибки полученной с шины, до закрытие соединения  
//	* ПриПолученииСообщения    - Строка - см. ПриПолученииСообщения 
Функция НовыеПараметрыПодключения() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Сервер", "");
	Результат.Вставить("Путь", "/ws");
	Результат.Вставить("Порт", 15674);
	Результат.Вставить("ПереподключениеПриЗакрытииСоединения", Ложь);
	Результат.Вставить("ЗащищенноеСоединение", Ложь);
	Результат.Вставить("ПоддерживаемыеВерсии", "1.0,1.1,1.2");
	Результат.Вставить("Пользователь", "guest");
	Результат.Вставить("Пароль", "guest");
	Результат.Вставить("ВиртуальныйХост", "/");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Таймаут", 300);
	Результат.Вставить("ЧастотаПульса", 3000); // время поддержки активности соединения
	
	Результат.Вставить("ПриОткрытииСоединения", "");
	Результат.Вставить("ПриОшибкеСоединения", "");
	Результат.Вставить("ПриЗакрытииСоединения", "");
	Результат.Вставить("ПриПодтвержденииОтправкиСообщения", "");
	Результат.Вставить("ПриПолученииОшибки", "");
	Результат.Вставить("ПриПолученииСообщения", "");

	ИдентификаторБазы = Отчетность24БРО.ИдентификаторБазы();
	ИдентификаторНаШине = ВРЕГ(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИдентификаторБазы));
	Результат.Вставить("ИдентификаторБазы", ИдентификаторБазы);
	Результат.Вставить("ИдентификаторНаШине", ИдентификаторНаШине);

	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Результат.Вставить("ОбластьДанных", РаботаВМоделиСервиса.ЗначениеРазделителяСеанса());
	Иначе
		Результат.Вставить("ОбластьДанных", 0);
	КонецЕсли;
	
	
	Возврат Результат;

КонецФункции

#Область КомандыРаботыСШиной

// Конструктор строки команды подключения к серверу RabbitMQ
// 
// Параметры:
//  ПараметрыПодключения - см. НовыеПараметрыПодключения
//
// Возвращаемое значение:
//	 Строка
Функция КомандаПодключения(ПараметрыПодключения) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().Подключиться;
	СообщениеSTOMP.Заголовки.Вставить("accept-version",	ПараметрыПодключения.ПоддерживаемыеВерсии);
	СообщениеSTOMP.Заголовки.Вставить("login",			ПараметрыПодключения.Пользователь);
	СообщениеSTOMP.Заголовки.Вставить("passcode",		ПараметрыПодключения.Пароль);
	СообщениеSTOMP.Заголовки.Вставить("host",			ПараметрыПодключения.ВиртуальныйХост);
	СообщениеSTOMP.Заголовки.Вставить("heart-beat",		СтрШаблон("%1,%1", Формат(ПараметрыПодключения.ЧастотаПульса,"ЧГ=0")));
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отключения от шины
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаОтключения() Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();	
	СообщениеSTOMP.Команда = КомандыКлиента().Отключиться;
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подписки на получение сообщений из RabbitMQ
// 
// Параметры:
//  Подписка - см. Подписка
//
// Возвращаемое значение:
//	 Строка
Функция КомандаПодпискаНаПолучениеСообщений(Подписка) Экспорт
	
	Если ТипЗнч(Подписка.ТипПриемника) <> Тип("Строка") Тогда
		Подписка.ТипПриемника = ТипыПриемниковОбработкиСообщений().ПоКлючу;
	КонецЕсли;

	Если ТипЗнч(Подписка.ТипПодтвержденияПолучения) <> Тип("Строка") Тогда
		Подписка.ТипПодтвержденияПолучения = "client-individual";
	КонецЕсли;

	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОформитьПодпискуНаСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id", Подписка.Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("destination", СтрШаблон("/%1/%2", Подписка.ТипПриемника, Подписка.Ключ));
	СообщениеSTOMP.Заголовки.Вставить("ack", Подписка.ТипПодтвержденияПолучения);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подписки на получение сообщений из RabbitMQ
// 
// Параметры:
//  Подписка             - см. Подписка
//
// Возвращаемое значение:
//	 Строка
Функция КомандаОтменыПодпискиНаПолучениеСообщений(Подписка) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОтменитьПодпискуНаСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id", Подписка.Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды подтверждения получения сообщения
//
// Параметры:
//	 Идентификатор - Строка - идентификатор сообщения
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаПодтвержденияПолученияСообщения(Идентификатор) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ПодтвердитьПолучениеСообщения;
	СообщениеSTOMP.Заголовки.Вставить("id",	Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отказа обработки полученного сообщения
//
// Параметры:
//	 Идентификатор - Строка - идентификатор сообщения
//
// Возвращаемое значение:
//	 Строка
//
Функция КомандаНеудачнойОбработкиПолученияСообщения(Идентификатор) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();
	СообщениеSTOMP.Команда = КомандыКлиента().ОтказатьсяОтПолученияСообщения;
	СообщениеSTOMP.Заголовки.Вставить("message-id",	Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("id",			Идентификатор);
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

// Конструктор строки команды отправки сообщения
//
// Параметры:
//	 Параметры - см. ПараметрыСообщенияДляОтправки 
//
// Возвращаемое значение:
//	 Строка
Функция КомандаОтправкиСообщения(Параметры) Экспорт
	
	СообщениеSTOMP = СообщениеSTOMP();	
	СообщениеSTOMP.Команда = КомандыКлиента().ОтправитьСообщение;
	СообщениеSTOMP.Заголовки.Вставить("receipt",		Параметры.Идентификатор);
	СообщениеSTOMP.Заголовки.Вставить("content-type",	Параметры.ТипСодержимого);
	СообщениеSTOMP.Заголовки.Вставить("destination",	СтрШаблон("/exchange/%1/%2", Параметры.ТочкаОбмена,
																					 Параметры.КлючМаршрутизации));
		
	Для Каждого КлючЗначение Из Параметры.Заголовки Цикл
		СообщениеSTOMP.Заголовки.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение); 
	КонецЦикла;
	
	СообщениеSTOMP.Тело = Параметры.Тело;
	
	Результат = ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор параметров для сообщения для отправки
//
// Возвращаемое значение:
//   Структура:
//     * Идентификатор      - Строка - уникальный идентификатор сообщения (по умолчанию пустой).
//     * ТипСодержимого     - Строка - MIME-тип содержимого сообщения (по умолчанию "text/plain").
//     * ТочкаОбмена        - Строка - amq.direct, amq.fanout, amq.headers, amq.match, amq.topic и т.п. (Binding from)	 
//     * КлючМаршрутизации  - Строка - ключ маршрутизации сообщения (Routing key) 
//     * Заголовки          - Соответствие Из КлючИЗначение:
//     ** Ключ              - Строка
//     ** Значение          - Строка
//     * Тело               - Строка - содержимое сообщения.
Функция ПараметрыСообщенияДляОтправки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ТипСодержимого", "text/plain");
	Результат.Вставить("ТочкаОбмена", "");
	Результат.Вставить("КлючМаршрутизации", "");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Тело", "");
	
	Возврат Результат;
	
КонецФункции

// Выполняет попытку отправки накопленных сообщений
// 
// Параметры:
//  Соединение - WebSocketКлиентСоединение 
Процедура ОтправитьСообщения(Соединение)
	
	СохраненныеПараметры = СохраняемыеПараметрыСокета(Соединение.Ключ);

	Для Каждого ПараметрыБазы Из СохраненныеПараметры Цикл
		Для Каждого Сообщение Из ПараметрыБазы.СообщенияДляОтправки Цикл
			ПараметрыСообщения = ПараметрыСообщенияДляОтправки();
			ПараметрыСообщения.Идентификатор = Сообщение.ИдентификаторОтправки;
			ПараметрыСообщения.КлючМаршрутизации = Сообщение.КлючМаршрутизации;
			ПараметрыСообщения.Заголовки = Сообщение.Заголовки;
			ПараметрыСообщения.Тело = Сообщение.ТекстСообщения;
			ПараметрыСообщения.ТочкаОбмена = Сообщение.ТочкаОбмена;

			ТекстКоманды = КомандаОтправкиСообщения(ПараметрыСообщения);
			ОтправитьСообщение(Соединение, ТекстКоманды);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру описывающую вариант подписки на сообщения
// 
// Параметры:
//  Ключ - Строка - Ключ маршрутизации (RoutingKey)
//  ТипПриемника - Строка - См. ТипыПриемниковОбработкиСообщений()
//  ТипПодтвержденияПолучения - Строка - Тип подтверждения получения сообщения
// 										 auto (все полученные сообщения сразу считаются подтвержденными)
// 										 client (необходимо подтвердить все последние полученные сообщения)
// 										 client-individual (необходимо подтвердить получение каждого сообщения)
// Возвращаемое значение:
//  Структура - Подписка:
// * Идентификатор - Строка - 
// * Ключ - Строка - 
// * ТипПриемника - Строка
// * ТипПодтвержденияПолучения - Строка 
Функция Подписка(Ключ, ТипПриемника = "topic", ТипПодтвержденияПолучения = "auto") 
	
	Результат = Новый Структура( );
	Результат.Вставить("Идентификатор", Строка(Ключ));
	Результат.Вставить("Ключ", Строка(Ключ));
	Результат.Вставить("ТипПриемника", Строка(ТипПриемника));
	Результат.Вставить("ТипПодтвержденияПолучения", ТипПодтвержденияПолучения);
	
	Возврат Результат;
КонецФункции

// Возваращает перечень типы приемников обработки сообщений на основе которых происходит их маршрутизация по получателям
// 
// Возвращаемое значение:
//  Структура:
// * ПоКлючу      - Строка - 
// * ДляВсем      - Строка - 
// * ПоЗаголовкам - Строка - 
// * ПоШаблону    - Строка - 
Функция ТипыПриемниковОбработкиСообщений() 

	Результат = Новый Структура();

	Результат.Вставить("ПоКлючу",      "direct");  // Маршрутизация происходит по точному совпадению ключа маршрутизации 
	                                               // сообщения с ключом привязки. 
	                                               // Если ключ не совпадает ни с одной привязкой, 
	                                               // сообщение отбрасывается 
	                                               // (или перенаправляется в обменник мёртвых писем, если он настроен)

	Результат.Вставить("ДляВсем",      "fanout");  // Широковещательная рассылка копии каждого сообщения во все 
	                                               // привязанные к нему очереди, полностью игнорируя ключ маршрутизации.

	Результат.Вставить("ПоЗаголовкам", "headers"); // Маршрутизация осуществляется на основе заголовков сообщения 
	                                               // (пар ключ-значение), а не ключа маршрутизации. 
	                                               // При привязке очереди задаётся набор пар ключ-значение 
	                                               // и режим совпадения (x-match):
	                                               //   all — должны совпасть все указанные заголовки.
	                                               //   any — должен совпасть хотя бы один из указанных заголовков

	Результат.Вставить("ПоШаблону",    "topic");   // Маршрутизация основана на сопоставлении шаблонов 
	                                               // с подстановочными знаками. 
	                                               // Ключи маршрутизации и ключи привязки представляют собой 
	                                               // последовательности слов, разделённых точками. 
	                                               // Специальные символы:
	                                               // * (звездочка) — соответствует ровно одному слову.
	                                               // # (решётка) — соответствует нулю или более словам. 

	Возврат Результат;
	
КонецФункции


// Возвращает перечень команд с сервера
// 
// Возвращаемое значение:
//  Структура:
// * ПодключениеВыполнено  - Строка - 
// * ВходящееСообщение     - Строка - 
// * ПодтверждениеОтправки - Строка - 
// * Ошибка                - Строка - 
Функция КомандыСервера() 
	
	Результат = Новый Структура();
	Результат.Вставить("ПодключениеВыполнено",  "CONNECTED");
	Результат.Вставить("ВходящееСообщение",     "MESSAGE");
	Результат.Вставить("ПодтверждениеОтправки", "RECEIPT");
	Результат.Вставить("Ошибка", "ERROR");
	
	Возврат Результат;
	
КонецФункции

// Возвращает перечень команд для отправки на сервер
// 
// Возвращаемое значение:
//  Структура - Команды клиента:
// * ОтправитьСообщение             - Строка - 
// * ОформитьПодпискуНаСообщения    - Строка - 
// * ОтменитьПодпискуНаСообщения    - Строка - 
// * НачатьТранзакцию               - Строка - 
// * ЗафиксироватьТранзакцию        - Строка - 
// * ОтменитьТранзакцию             - Строка - 
// * ПодтвердитьПолучениеСообщения  - Строка - 
// * ОтказатьсяОтПолученияСообщения - Строка - 
// * Отключиться                    - Строка - 
// * Подключиться                   - Строка - 
Функция КомандыКлиента() 
	
	Результат = Новый Структура();
	Результат.Вставить("ОтправитьСообщение",             "SEND");
	Результат.Вставить("ОформитьПодпискуНаСообщения",    "SUBSCRIBE");
	Результат.Вставить("ОтменитьПодпискуНаСообщения",    "UNSUBSCRIBE");
	Результат.Вставить("НачатьТранзакцию",               "BEGIN");
	Результат.Вставить("ЗафиксироватьТранзакцию",        "COMMIT");
    Результат.Вставить("ОтменитьТранзакцию",             "ABORT");
    Результат.Вставить("ПодтвердитьПолучениеСообщения",  "ACK");
    Результат.Вставить("ОтказатьсяОтПолученияСообщения", "NACK");
    Результат.Вставить("Отключиться",                    "DISCONNECT");
    Результат.Вставить("Подключиться",                   "CONNECT");

	Возврат Результат;

КонецФункции

// Возвращает подписки сокета
// 
// Параметры:
//  Ключ - Строка
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//	* Ключ - Строка - Имя подписки
//	* Значение - см. ПараметрыПодписки
Функция ОформленныеПодписки(Ключ)
	
	Результат = Новый Соответствие(); // см. ОформленныеПодписки 

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Отчетность24БРОПараметрыШины.ИдентификаторБазы КАК ИдентификаторБазы,
			|	Отчетность24БРОПараметрыШины.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанных
			|ИЗ
			|	РегистрСведений.Отчетность24БРОПараметрыШины КАК Отчетность24БРОПараметрыШины
			|ГДЕ
			|	Отчетность24БРОПараметрыШины.Ключ = &Ключ";
		
		Запрос.УстановитьПараметр("Ключ", Ключ);
		
		РезультатЗапроса = Запрос.Выполнить();

		СтруктураВыборки = Новый Структура();
		СтруктураВыборки.Вставить("ИдентификаторБазы", "");
		СтруктураВыборки.Вставить("ОбластьДанных", 0);
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураВыборки, ВыборкаДетальныеЗаписи);
			
			ИмяПодписки = ИмяПодписки(СтруктураВыборки.ИдентификаторБазы);
			Результат.Вставить(ИмяПодписки, ПараметрыПодписки(СтруктураВыборки));
			
		КонецЦикла;
		
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает параметры подписки
// 
// Параметры: 
//  Параметры - см. НовыеПараметрыПодключения
// 
// Возвращаемое значение:
//  Структура:
// * ИдентификаторБазы - Строка - 
// * ОбластьДанных     - Число - 
Функция ПараметрыПодписки(Параметры)
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторБазы", Параметры.ИдентификаторБазы);
	Результат.Вставить("ОбластьДанных", Параметры.ОбластьДанных);
	Возврат Результат;
КонецФункции

// Возвращает имя подписки
// 
// Параметры:
//  ИдентификаторБазы - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИмяПодписки(ИдентификаторБазы)
	ИдентификаторНаШине = ВРЕГ(ОбщегоНазначения.КонтрольнаяСуммаСтрокой(ИдентификаторБазы)); 
	Результат = "db." + ИдентификаторНаШине; // получение сообщений адресованных этой базе
	Возврат Результат;
КонецФункции

// Сохраняет подписку в базе для использования при переподключении
// 
// Параметры:
//  Параметры  - см. НовыеПараметрыПодключения
//  Соединение - WebSocketКлиентСоединение
Процедура ДобавитьПодписку(Параметры, Соединение = Неопределено)
	
	
	КлючСоединения = КлючСоединения(Параметры);
	ОформленныеПодписки = ОформленныеПодписки(КлючСоединения);
	ИмяПодписки = ИмяПодписки(Параметры.ИдентификаторБазы); // получение сообщений адресованных этой базе

	Если ОформленныеПодписки.Получить(ИмяПодписки) = Неопределено Тогда
		ОформленныеПодписки.Вставить(ИмяПодписки, ПараметрыПодписки(Параметры));

		УстановитьПривилегированныйРежим(Истина);

		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(
				Метаданные.РегистрыСведений.Отчетность24БРОПараметрыШины.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ключ", КлючСоединения);
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторБазы", Параметры.ИдентификаторБазы);
			Блокировка.Заблокировать();

			Запись = РегистрыСведений.Отчетность24БРОПараметрыШины.СоздатьМенеджерЗаписи();
			Запись.Ключ = КлючСоединения;
			Запись.ИдентификаторБазы = Параметры.ИдентификаторБазы;
			Запись.Записать();

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;

		УстановитьПривилегированныйРежим(Ложь);

		Если Соединение <> Неопределено И Не СоединениеЗакрыто(Соединение) Тогда
			Подписка = Подписка(ИмяПодписки, ТипыПриемниковОбработкиСообщений().ПоШаблону, "auto"); // получение сообщений адресованных этой базе
			ОтправитьСообщение(Соединение, КомандаПодпискаНаПолучениеСообщений(Подписка));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает строку подключения
// 
// Параметры:
//  Параметры - см. НовыеПараметрыПодключения
// 
// Возвращаемое значение:
//  Строка 
Функция СтрокаПодключения(Параметры)

	ТипСоединения = ?(Параметры.ЗащищенноеСоединение, "wss", "ws");
	СтрокаПодключения = СтрШаблон("%1://%2:%3%4",
		ТипСоединения, Параметры.Сервер, Формат(Параметры.Порт, "ЧГ=0"), Параметры.Путь);
			
	Возврат СтрокаПодключения;
	
КонецФункции

// Возвращает ключ соединения
// 
// Параметры:
//  Параметры - см. НовыеПараметрыПодключения
// 
// Возвращаемое значение:
//  Строка 
Функция КлючСоединения(Параметры) Экспорт

	СтрокаПодключения = СтрокаПодключения(Параметры);
	
	Результат = "RabbitMQ" + ОбщегоНазначения.КонтрольнаяСуммаСтрокой(
		СтрокаПодключения + Параметры.Пользователь + Параметры.Пароль); //  Для создания соединения для каждой области добавить Строка(Параметры.ОбластьДанных)
	
	Возврат Результат;
	
КонецФункции

// Возвращает имена пользовательских приложений.
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция ИменаПользовательскихПриложений()
	
	Результат = Новый Массив; // Массив Из Строка
	Результат.Добавить("1CV8"); // идентификатор приложения "1С:Предприятие";
	Результат.Добавить("1CV8C"); // идентификатор приложения тонкого клиента "1С:Предприятие";
	Результат.Добавить("WebClient");
	Результат.Добавить("WebServerExtension"); // идентификатор приложения модуля расширения веб-сервера;

	Возврат Результат;
	
КонецФункции

// Возвращает необходимость прервать соединение
// 
// Возвращаемое значение:
//  Булево
Функция ТребуетсяЗакрытиеВебСокета()
	
	УстановитьПривилегированныйРежим(Истина);

	ЕстьЗапущенныйКонфигуратор = Ложь;
	ЕстьАктивныеПользователи = Ложь;
	ИменаПользовательскихПриложений = ИменаПользовательскихПриложений();
	АктивныеСоединения = ПолучитьСеансыИнформационнойБазы();
	Для Каждого АктивноеСоединение Из АктивныеСоединения Цикл
		Если Не ЕстьАктивныеПользователи 
			И ИменаПользовательскихПриложений.Найти(АктивноеСоединение.ИмяПриложения) <> Неопределено
			И АктивноеСоединение.Пользователь.УникальныйИдентификатор 
				<> ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
			
			ЕстьАктивныеПользователи = Истина;
			Прервать;
			
		КонецЕсли;
		
		Если АктивноеСоединение.ИмяПриложения = "Designer" Тогда
			ЕстьЗапущенныйКонфигуратор = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьЗапущенныйКонфигуратор И Не ЕстьАктивныеПользователи;
	
КонецФункции

// Отправляет сообщение в шину
// 
// Параметры:
//  Соединение     - WebSocketКлиентСоединение
//  ТекстСообщения - Строка
// 
Процедура ОтправитьСообщение(Соединение, ТекстСообщения)

	Если СоединениеЗакрыто(Соединение) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Соединение.ОтправитьСообщение(ТекстСообщения);
	Исключение
		Состояние =  Соединение.ПолучитьСостояние(); // СостояниеWebSocketСоединения
		СоединениеЗакрыто = СостояниеWebSocketСоединения.Закрыто;
		Если Состояние = СоединениеЗакрыто Тогда
			ЗаписьЖурналаРегистрации(
				"ШинаRabbitMQ", 
				УровеньЖурналаРегистрации.Информация, , , 
				СтрШаблон("Не удалось отправить сообщение 
				|Тело: '%1'
				|Статус соединения - %2", Строка(Состояние)));
		КонецЕсли; 
	КонецПопытки;
КонецПроцедуры

// Возвращает статус закрытого соединения
// 
// Параметры:
//  Соединение     - WebSocketКлиентСоединение
// 
// Возвращаемое значение:
//  Булево
Функция СоединениеЗакрыто(Соединение) 
	
	Если ТипЗнч(Соединение) = Тип("WebSocketКлиентСоединение") Тогда

		Состояние =  Соединение.ПолучитьСостояние(); // СостояниеWebSocketСоединения
		СоединениеЗакрыто = СостояниеWebSocketСоединения.Закрыто;
		
		Возврат Состояние = СоединениеЗакрыто;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Сохранение параметров сокета в параметрах сеанса
// 
// Параметры:
//  Соединение        - WebSocketКлиентСоединение
//  РазрешитьЗакрытие - Булево
Процедура РазрешитьЗакрытиеСокета(Соединение, РазрешитьЗакрытие)
	
	ОбщегоНазначения.ХранилищеСистемныхНастроекСохранить("ИнтеграцияСОтчетность24.Соединение", Соединение.Ключ, 
		РазрешитьЗакрытие);
	
КонецПроцедуры

// Сохранение параметров сокета в базе
// 
// Параметры:
//  КлючСоединения - Строка
//  СохраняемыеПараметрыСокета - см. СохраняемыеПараметрыСокета
Процедура ЗаписатьСохраняемыеПараметрыСокета(КлючСоединения, СохраняемыеПараметрыСокета = Неопределено)
	
	Если СохраняемыеПараметрыСокета = Неопределено Тогда
		СохраняемыеПараметрыСокета = СохраняемыеПараметрыСокета(КлючСоединения);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();
	Попытка
		ИмяОбластьДанныхВспомогательныеДанные = "ОбластьДанныхВспомогательныеДанные";
		Для Каждого ПараметрыБазы Из СохраняемыеПараметрыСокета Цикл

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(
				Метаданные.РегистрыСведений.Отчетность24БРОПараметрыШины.ПолноеИмя());
			ЭлементБлокировки.УстановитьЗначение("Ключ", КлючСоединения);
			ЭлементБлокировки.УстановитьЗначение("ИдентификаторБазы", ПараметрыБазы.ИдентификаторБазы);
			Блокировка.Заблокировать();

			Запись = РегистрыСведений.Отчетность24БРОПараметрыШины.СоздатьМенеджерЗаписи();
			Запись.Ключ = КлючСоединения;
			Запись.ИдентификаторБазы = ПараметрыБазы.ИдентификаторБазы;
			Если Не (РаботаВМоделиСервиса.РазделениеВключено()
				И РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных()) Тогда
				Запись[ИмяОбластьДанныхВспомогательныеДанные] = ПараметрыБазы.ОбластьДанных;
			КонецЕсли;
			Запись.СообщенияДляОтправки = Новый ХранилищеЗначения(ПараметрыБазы.СообщенияДляОтправки);
			Запись.Записать();

		КонецЦикла;

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Контруктор структуры сообщения для отправки.
// 
// Параметры:
//  КлючМаршрутизации - Строка
//  ТекстСообщения    - Строка
//  ТочкаОбмена       - Строка
//  Заголовки         - Соответствие из КлючИЗначение - заголовки для маршрутизации:
// * Ключ     - Строка
// * Значение - Строка 
// 
// Возвращаемое значение:
//  Структура - Новое сообщение для отправки:
// * ИдентификаторОтправки - Строка
// * КлючМаршрутизации     - Строка
// * ТочкаОбмена           - Строка
// * ТекстСообщения        - Строка
// * Заголовки             - Соответствие из КлючИЗначение - заголовки для маршрутизации:
// ** Ключ     - Строка
// ** Значение - Строка 
Функция НовоеСообщениеДляОтправки(КлючМаршрутизации, ТекстСообщения = "", ТочкаОбмена = "amq.topic", 
	Заголовки = Неопределено) Экспорт

	СтруктураСообщения = Новый Структура();
	СтруктураСообщения.Вставить("ИдентификаторБазы", Отчетность24БРО.ИдентификаторБазы());
	СтруктураСообщения.Вставить("Сообщение", ТекстСообщения);
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторОтправки", Строка(Новый УникальныйИдентификатор()));
	Результат.Вставить("КлючМаршрутизации", КлючМаршрутизации);
	Результат.Вставить("ТочкаОбмена", ТочкаОбмена);
	Результат.Вставить("ТекстСообщения", ОбщегоНазначения.ЗначениеВJSON(СтруктураСообщения));
	Если ТипЗнч(Заголовки) = Тип("Соответствие") Тогда
		Результат.Вставить("Заголовки", Заголовки);
	Иначе
		Результат.Вставить("Заголовки", Новый Соответствие);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает сохраняемые параметры сокета из базы
// 
// Параметры:
//  КлючСоединения - Строка
// 
// Возвращаемое значение:
//  Массив Из Структура:
//  * ИдентификаторБазы    - Строка
//  * ОбластьДанных        - Число
// 	* СообщенияДляОтправки - Массив Из см. НовоеСообщениеДляОтправки
Функция СохраняемыеПараметрыСокета(КлючСоединения)
	
	Результат = Новый Массив(); // см. СохраняемыеПараметрыСокета

	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Отчетность24БРОПараметрыШины.ИдентификаторБазы КАК ИдентификаторБазы,
			|	Отчетность24БРОПараметрыШины.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанных,
			|	Отчетность24БРОПараметрыШины.СообщенияДляОтправки КАК СообщенияДляОтправкиХранилище
			|ИЗ
			|	РегистрСведений.Отчетность24БРОПараметрыШины КАК Отчетность24БРОПараметрыШины
			|ГДЕ
			|	Отчетность24БРОПараметрыШины.Ключ = &Ключ";
		
		Запрос.УстановитьПараметр("Ключ", КлючСоединения);
		
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктураВыборки = Новый Структура();
			СтруктураВыборки.Вставить("ИдентификаторБазы", "");
			СтруктураВыборки.Вставить("ОбластьДанных", 0);
			СтруктураВыборки.Вставить("СообщенияДляОтправкиХранилище", Новый ХранилищеЗначения(Новый Массив()));
			СтруктураВыборки.Вставить("СообщенияДляОтправки", Новый Массив());

			ЗаполнитьЗначенияСвойств(СтруктураВыборки, ВыборкаДетальныеЗаписи);
			
			МассивСообщений =  СтруктураВыборки.СообщенияДляОтправкиХранилище.Получить();
			Если ТипЗнч(МассивСообщений) = Тип("Массив") Тогда
				СтруктураВыборки.СообщенияДляОтправки = МассивСообщений;
			КонецЕсли;
			СтруктураВыборки.Удалить("СообщенияДляОтправкиХранилище");
			
			Результат.Добавить(СтруктураВыборки);
			
		КонецЦикла;
		
	Исключение
		ЗаписьЖурналаРегистрации(
			"ШинаRabbitMQ",
			УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

	КонецПопытки;

	Возврат Результат;
	
КонецФункции

// Возвращает сохраняемые параметры соединения
// 
// Параметры:
//  КлючСоединения - Строка
// 
// Возвращаемое значение:
//  Булево - Признак для блокировки переподключения сокета при закрытии
Функция РазрешеноЗакрытиеСоединения(КлючСоединения)
	
	Результат =  ОбщегоНазначения.ХранилищеСистемныхНастроекЗагрузить("ИнтеграцияСОтчетность24.Соединение", 
		КлючСоединения, Ложь);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текст сообщения в формате STOMP
// 
// Параметры:
//  СообщениеSTOMP - см. СообщениеSTOMP
// 
// Возвращаемое значение:
//  Строка
Функция ТекстСообщенияВФорматеSTOMP(СообщениеSTOMP)
	
	Заголовки = "";
	
	Для Каждого КлючЗначение Из СообщениеSTOMP.Заголовки Цикл
		
		Заголовки = СтрШаблон("%1:%2%3%4", КлючЗначение.Ключ, ЭкранироватьСимволы(КлючЗначение.Значение), 
										   Символы.ПС, Заголовки);
	КонецЦикла;

	Результат = СообщениеSTOMP.Команда + Символы.ПС + Заголовки;
	
	Результат = СтрШаблон("%1%2%3%4", Результат, Символы.ПС, СообщениеSTOMP.Тело, Символ(0));

	Возврат Результат;
	
КонецФункции

// Структура сообщения STOMP
// 
// Параметры:
//  Данные - Неопределено, Строка - Текст сообщения в формате STOMP
// 
// Возвращаемое значение:
//  Структура:
// * Команда   - Строка 
// * Заголовки - Соответствие из КлючИЗначение:
// ** Ключ     - Строка
// ** Значение - Строка 
// * Тело      - Строка 
Функция СообщениеSTOMP(Знач Данные = Неопределено) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Команда", "");
	Результат.Вставить("Заголовки", Новый Соответствие);
	Результат.Вставить("Тело", "");

	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		
		Данные = СтрЗаменить(Данные, Символ(0), "");
		
		ПозицияЗавершенияКоманды = СтрНайти(Данные, Символы.ПС);
		Команда = Лев(Данные, ПозицияЗавершенияКоманды - 1);
		Если Не ЗначениеЗаполнено(Команда) Тогда
			Возврат Результат;
		КонецЕсли;

		Результат.Команда = Команда;
		
		Данные = Сред(Данные, СтрДлина(Результат.Команда) + 2);
		ПозицияЗавершенияЗаголовков = СтрНайти(Данные, Символы.ПС + Символы.ПС);
		СтрокаЗаголовков = Лев(Данные, ПозицияЗавершенияЗаголовков - 1);
		
		Заголовки = СтрРазделить(СтрокаЗаголовков, Символы.ПС, Ложь);
		Для Каждого Заголовок Из Заголовки Цикл
			ДанныеЗаголовка = СтрРазделить(Заголовок, ":", Ложь);
			Результат.Заголовки.Вставить(СокрЛП(ДанныеЗаголовка[0]), СокрЛП(ДанныеЗаголовка[1]));
		КонецЦикла;
		
		РазмерТела = СтрДлина(Данные) - (ПозицияЗавершенияЗаголовков + 2);
		Результат.Тело = Сред(Данные, ПозицияЗавершенияЗаголовков + 2, РазмерТела);
		
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Экранирует символы для передачи в шину
// 
// Параметры:
//  Значение - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ЭкранироватьСимволы(Значение)
	
	Результат = Значение;
	
	ЭкранируемыеСимволы = Новый Соответствие;
	ЭкранируемыеСимволы.Вставить("\", "\\");
	ЭкранируемыеСимволы.Вставить(":", "\c");
	ЭкранируемыеСимволы.Вставить(Символ(10), "\n");
	ЭкранируемыеСимволы.Вставить(Символ(13), "\r");
	
	Для Каждого КлючЗначение Из ЭкранируемыеСимволы Цикл
		Результат = СтрЗаменить(Результат, КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
