// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных.
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных.
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт

	Типы.Добавить(Метаданные.Константы.УдалитьЛогироватьЗапускиЗаданийОчереди);
	Типы.Добавить(Метаданные.Константы.УдалитьМаксимальнаяДлительностьВыполненияИсполняющегоФоновогоЗадания);
	Типы.Добавить(Метаданные.Константы.УдалитьМаксимальноеКоличествоИсполняющихФоновыхЗаданий);
	Типы.Добавить(Метаданные.Константы.УдалитьПериодХраненияИсторииЗапусковЗаданийОчереди);

	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.УдалитьОбработчикиОчередиЗаданий,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.УдалитьОчередьЗаданий,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.УдалитьОчередьЗаданийУстаревший,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.УдалитьШаблоныЗаданийОчереди,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());

	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьИсторияЗапускаЗаданийОчереди);

КонецПроцедуры

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных
//
// Параметры:
//  ЗагружаемыеСправочники - ТаблицаЗначений -
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// Выполняет обработку тела сообщения из канала в соответствии с алгоритмом текущего канала сообщений.
//
// Параметры:
//  КаналСообщений - Строка - идентификатор канала сообщений, из которого получено сообщение.
//  ТелоСообщения - Произвольный - тело сообщения, полученное из канала, которое подлежит обработке.
//  Отправитель - ПланОбменаСсылка.ОбменСообщениями - конечная точка, которая является отправителем сообщения.
Процедура ОбработатьСообщение(Знач КаналСообщений, Знач ТелоСообщения, Знач Отправитель) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// Получает список обработчиков сообщений, которые обрабатывают подсистемы библиотеки.
// 
// Параметры:
//  Обработчики - ТаблицаЗначений - состав полей см. в ОбменСообщениями.НоваяТаблицаОбработчиковСообщений.
Процедура ПриОпределенииОбработчиковКаналовСообщений(Обработчики) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач ПоддерживаемыеВерсии) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

#КонецОбласти