////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
//
////////////////////////////////////////////////////////////////////////////////

// Данный модуль содержит интерфейсные процедуры функции
// вызова процессов выгрузки и загрузки данных.


#Область ПрограммныйИнтерфейс

// Записывает объект в файл.
//
// Параметры:
//	Объект - Произвольный - записываемый объект.
//	ИмяФайла - Строка - путь к файлу.
//	Сериализатор - СериализаторXDTO - сериализатор.
//
Процедура ЗаписатьОбъектВФайл(Знач Объект, Знач ИмяФайла, Сериализатор = Неопределено) Экспорт
	
	ВыгрузкаЗагрузкаДанныхСлужебный.ЗаписатьОбъектВФайл(Объект, ИмяФайла, Сериализатор);
	
КонецПроцедуры

// Возвращает объект из файла.
//
// Параметры:
//	ИмяФайла - Строка - путь к файлу.
//
// Возвращаемое значение:
//	Произвольный - объект содержащий прочитанные данные
//
Функция ПрочитатьОбъектИзФайла(Знач ИмяФайла) Экспорт
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ПрочитатьОбъектИзФайла(ИмяФайла);
	
КонецФункции

#Область ОбработкаСсылокНаТипыИсключаемыеИзВыгрузки

// Дополняет массив типов исключаемых из выгрузки-загрузки
// Предназначен для использования в обработчиках ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
//
// Параметры:
// 	Типы - Массив из ФиксированнаяСтруктура
//	Тип - ОбъектМетаданных - объект метаданных исключаемый из выгрузки-загрузки
//	ДействиеСоСсылками - Строка -  вариант действия при обнаружении ссылки на объект исключаемый из выгрузки
//		Поддерживаются следующие действия:
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять() - не будет произведено никаких действий  
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиОчищать() - будет выполнено очищение ссылки на невыгружаемый объект  
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеВыгружатьОбъект() - объект содержащий ссылку не будет выгружен
//		  
// Пример использования:
//  Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
//		ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
//			Типы,
//			Метаданные.Справочники.СценарииПроверок,
//			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеВыгружатьОбъект());
//	КонецПроцедуры 
//
Процедура ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(Типы, Тип, ДействиеСоСсылками) Экспорт

	ВыгрузкаЗагрузкаДанныхСлужебный.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(Типы, Тип, ДействиеСоСсылками);
	
КонецПроцедуры
	
// Действие со ссылками - Не изменять.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиНеИзменять() Экспорт
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ДействиеСоСсылкамиНеИзменять();
	
КонецФункции

// Действие со ссылками - Очищать.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиОчищать() Экспорт
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ДействиеСоСсылкамиОчищать();
	
КонецФункции

// Действие со ссылками - Не выгружать объект.
// 
// Возвращаемое значение:
//  Строка
Функция ДействиеСоСсылкамиНеВыгружатьОбъект() Экспорт
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ДействиеСоСсылкамиНеВыгружатьОбъект();
	
КонецФункции

#КонецОбласти

#КонецОбласти
