
#Область ПрограммныйИнтерфейс

// Возвращает версию интерфейса биллинга (версии нумеруются простым натуральным числом).
// 
// Возвращаемое значение:
//  Число - версия интерфейса.
//
Функция ВерсияИнтерфейса() Экспорт
	
	Возврат 3;
	
КонецФункции

// Возвращает представление валюты оплаты услуг сервиса.
// 
// Возвращаемое значение:
//  Строка - представление валюты оплаты. 
//
Функция ПредставлениеВалютыОплаты() Экспорт
	
	ПредставлениеВалютыОплаты = НСтр("ru = 'руб.'"); 
	ОплатаСервисаПереопределяемый.ПриУстановкеПредставленияВалютыОплаты(ПредставлениеВалютыОплаты);
	
	Возврат ПредставлениеВалютыОплаты;
	
КонецФункции

// Возвращает состояния истечения сроков подписок на тарифы поданным менеджера сервиса.
// Данные возвращаются только для пользователей с ролью "Владелец абонента".
// Метод переопределяется в расширении fresh.
// @skip-check module-empty-method
// 
// Возвращаемое значение:
//  Структура:
//   * ЗавершаетсяТестовых - Число
//   * ЗавершаетсяБесплатных - Число
//   * ЗавершаетсяПлатных - Число
//   * ЗавершаетсяВсего - Число
//   * НеЗавершаетсяТестовых - Число
//   * НеЗавершаетсяБесплатных - Число
//   * НеЗавершаетсяПлатных - Число
//   * НеЗавершаетсяВсего - Число
Функция СостоянияЗавершенияПодписокНаТарифы() Экспорт
КонецФункции

// Возвращает признак поддержки загрузки тарифов сервиса в данные информационной базы.
// 
// Возвращаемое значение:
//  Булево - если Истина, то загрузка поддерживается.
//
Функция ПоддерживаетсяЗагрузкаТарифов() Экспорт
	
	Результат = Ложь;
	ОплатаСервисаПереопределяемый.ПриОпределенииПоддержкиЗагрузкиТарифов(Результат);
	
	Возврат Результат;
	
КонецФункции

// Загрузка тарифов в справочники информационной базы из менеджера сервиса.
// 
Процедура ЗагрузитьТарифыСервиса() Экспорт
	
	Если Не РаботаВМоделиСервиса.РазделениеВключено() Тогда
		ДанныеАвторизации = ПрограммныйИнтерфейсСервисаСлужебный.ДанныеАвторизацииВСервисе();
		КодАбонента = ДанныеАвторизации.КодАбонента;
	Иначе
		КодАбонента = ПрограммныйИнтерфейсСервиса.КодАбонента();
	КонецЕсли; 
	
	Отбор = ПрограммныйИнтерфейсСервиса.НовыйОтборСпискаТарифовОбслуживающейОрганизации();
	Отбор.КодОбслуживающейОрганизации = КодАбонента;
	Отбор.ПараметрыПолучения.Добавить(ПрограммныйИнтерфейсСервиса.ПараметрПолученияПериодыДействия());

	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("ТарифыОбслуживающейОрганизации", 
		ПрограммныйИнтерфейсСервиса.ТарифыОбслуживающейОрганизации(Отбор));
		
	Отбор = ПрограммныйИнтерфейсСервиса.НовыйОтборСпискаТарифов();
	Отбор.ПараметрыПолучения.Добавить(ПрограммныйИнтерфейсСервиса.ПараметрПолученияТолькоПлатные());
	Отбор.ПараметрыПолучения.Добавить(ПрограммныйИнтерфейсСервиса.ПараметрПолученияПериодыДействия());
	ИсходныеДанные.Вставить("ТарифыПровайдера", ПрограммныйИнтерфейсСервиса.ТарифыСервиса(Отбор));
	
	РезультатОбработки = ОплатаСервисаСлужебный.НовыйРезультатОбработки();
	
	Попытка
		ОплатаСервисаПереопределяемый.ПриЗагрузкеТарифов(ИсходныеДанные, РезультатОбработки);
		Если РезультатОбработки.Ошибка Тогда
			ВызватьИсключение РезультатОбработки.Сообщение;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = ОплатаСервисаСлужебный.СобытиеЖурналаРегистрации(
			НСтр("ru = 'Загрузка тарифов сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Ошибка при загрузке тарифов сервиса по причине:
					   |%1
					   |См. подробности в журнале регистрации приложения биллинга.'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

// Отправляет ответ в учетную систему биллинга на адрес счета на оплату.
//
// Параметры:
//  ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета на оплату.
//  Данные - см. ОплатаСервиса.ШаблонДанныхОтвета
//
// Возвращаемое значение:
//  HTTPОтвет - ответ менеджера сервиса.
//
// Пример:
//  ...
//  Данные = ОплатаСервиса.ШаблонДанныхОтвета();
//  Данные.Вставить("paid", Истина); // Признак оплаты счета.
//  ОплатаСервиса.ОтправитьЗапросВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные); // Отправка.
//
Функция ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные) Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		АдресСервиса = РаботаВМоделиСервиса.ВнутреннийАдресМенеджераСервиса();
	Иначе
		АдресСервиса = ПрограммныйИнтерфейсСервисаСлужебный.АдресСервисаИзЛокальнойБазы();
	КонецЕсли;
	
	АдресСчета = СтрШаблон("%1/%2/%3", АдресСервиса, АдресСчетовНаОплатуУчетнойСистемыБиллинга(), ИдентификаторСчета);
	ДанныеСервера = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресСчета);
	ИмяПользователяУчетнойСистемы = Константы.ИмяПользователяУчетнойСистемы.Получить();
	ПарольПользователяУчетнойСистемы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ОплатаСервисаСлужебный.ВладелецПароляАвторизацииВУчетнойСистеме());
		
	Если Не ЗначениеЗаполнено(ИмяПользователяУчетнойСистемы) Тогда
		ТекстОшибки = НСтр("ru = 'Не настроены параметры подключения к учетной системе биллинга. 
								 |Нужно установить настройки по ссылке: 
								 |%1'");
		СсылкаНаНастройку = "e1cib/data/Обработка.ПанельАдминистрированияБТС.Форма.НастройкиОплатыСервиса";
		ВызватьИсключение СтрШаблон(ТекстОшибки, СсылкаНаНастройку); 
	КонецЕсли;
	
	СхемаSSL = "https";
	Если НРег(ДанныеСервера.Схема) = СхемаSSL Тогда
		ЗащищенноеСоединение =  ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(ДанныеСервера.Хост, ДанныеСервера.Порт,
		ИмяПользователяУчетнойСистемы, ПарольПользователяУчетнойСистемы,
		ПолучениеФайловИзИнтернета.ПолучитьПрокси(ДанныеСервера.Схема), 5, ЗащищенноеСоединение);
	
	МетодHTTP = "PUT";
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = ДанныеСервера.ПутьНаСервере;
	ЗапросHTTP.УстановитьТелоИзСтроки(ОплатаСервисаСлужебный.СтрокаJSON(Данные));
	Ответ = Соединение.ВызватьHTTPМетод(МетодHTTP, ЗапросHTTP);
	ОплатаСервисаСлужебный.ЛогироватьHTTPЗапрос(ЗапросHTTP, Ответ);
	
	// По объекту может не успеть зафиксироваться транзакция.
	Если Ответ.КодСостояния = 404 Тогда
		Для Счетчик = 1 По 3 Цикл
			ВызватьПаузу(1000);
			Ответ = Соединение.ВызватьHTTPМетод(МетодHTTP, ЗапросHTTP);
			Если Не Ответ.КодСостояния = 404 Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		Если Ответ.КодСостояния = 404 Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка 404 при отправке ответа по счету %1 на адрес %2. 
				|Возможно во внутренней публикации Менеджера сервиса не опубликован HTTP-сервис %3.'"),
				ИдентификаторСчета, АдресСчета, "УниверсальнаяИнтеграция");
		КонецЕсли; 
	КонецЕсли;
	
	ШаблонТекстаОшибки = НСтр("ru = 'Ошибка %1 при отправке ответа по счету %2 на адрес %3 по причине: %4'");
	Если Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, Ответ.КодСостояния, ИдентификаторСчета, АдресСчета,
			СтрШаблон(НСтр("ru = 'Пользователь %1 не авторизован.'"), ИмяПользователяУчетнойСистемы));
	ИначеЕсли Ответ.КодСостояния = 403 Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, Ответ.КодСостояния, ИдентификаторСчета, АдресСчета,
			СтрШаблон(НСтр("ru = 'Запрос %1 не разрешен пользователю %2.'"), МетодHTTP, ИмяПользователяУчетнойСистемы)); 
	ИначеЕсли Ответ.КодСостояния = 405 Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, Ответ.КодСостояния, ИдентификаторСчета, АдресСчета,
			СтрШаблон(НСтр("ru = 'Метод %1 не поддерживается.'"), МетодHTTP));
	ИначеЕсли Ответ.КодСостояния = 400 Или Ответ.КодСостояния >= 500 Тогда
		ВызватьИсключение СтрШаблон(ШаблонТекстаОшибки, Ответ.КодСостояния, ИдентификаторСчета, АдресСчета,
			Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Возвращает шаблон данных при отправке информации о состоянии счета на оплату.
//
// Параметры:
//  КодОтвета - Число - код ответа. Если параметр не передается, устанавливается 10200.
//              Для установки можно использовать методы:
//              КодВозвратаОшибкаДанных() - соответствует коду 10400 - используется при обработке известных ошибок.
//              КодВозвратаВнутренняяОшибка() - соответствует коду 10500 - используется при возникновении непредвиденных ошибок.
//  Сообщение - Строка - сообщение об ошибке. Может быть установлен текст ошибки, который будет возвращен пользователю.
// 
// Возвращаемое значение:
//  Структура:
//   * response - Число - код ответа.
//   * error - Булево - признак ошибки. Взводится, если передан код ответа отличный от 102xx.
//   * message - Строка - сообщение об ошибке.
//
Функция ШаблонДанныхОтвета(КодОтвета = 10200, Сообщение = "") Экспорт
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("response", КодОтвета);
	ДанныеОтвета.Вставить("error", ?(КодОтвета >= 10200 И КодОтвета <= 10299, Ложь, Истина));
	ДанныеОтвета.Вставить("message", Сообщение);
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Возвращает данные запроса счета на оплату в структурированном виде.
// 
// Параметры:
//  ТелоЗапроса - Структура - ожидаемое тело запроса счета на оплату из менеджера сервиса:
//  * id - Строка
//  * seller_id - Число
//  * seller_name - Строка
//  * seller_public_id - Строка
//  * seller_email - Строка
//  * client_id - Число
//  * client_name - Строка
//  * client_public_id - Строка
//  * client_email - Строка
//  * client_phone - Строка
//  * client_info - Строка
//  * renewal - Булево
//  * payment_link - Строка
//  * total_cost - Число
//  * tariffs - Массив из Структура:
//    ** tariff_id - Строка
//    ** servant_tariff_id - Строка
//    ** period_id - Строка
//    ** amount - Число
//    ** cost - Число
//    ** basis_id - Строка
//  * services - Массив из Структура:
//    ** service - Строка
//    ** cost - Число  
//
// Возвращаемое значение:
//  Структура - данные запроса:
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета на оплату
//   * КодПродавца - Число - код абонента-продавца
//   * НаименованиеПродавца - Строка - наименование абонента-продавца
//   * ПубличныйИдентификаторПродавца - Строка - публичный налоговый идентификатор (ИНН) абонента-продавца
//   * ПочтаПродавца - Строка - адрес электронной почты абонента-продавца
//   * КодПокупателя - Число - код абонента-покупателя
//   * НаименованиеПокупателя - Строка - наименование абонента-покупателя
//   * ПубличныйИдентификаторПокупателя - Строка - публичный налоговый идентификатор (ИНН) абонента-покупателя
//   * ПочтаПокупателя - Строка - адрес электронной почты абонента-покупателя
//   * ТелефонПокупателя - Строка - телефон абонента-покупателя
//   * ДополнительнаяИнформация - Строка - дополнительная информация по счету на оплату
//   * Продление - Булево - признак продления платного периода 
//   * ПлатежнаяСсылка - Строка - платежная ссылка счета на оплату
//   * Сумма - Число - сумма счета на оплату (разрядность 31.2)
//   * Тарифы - ТаблицаЗначений:
//     ** КодТарифаПровайдера - Строка - код тарифа провайдера
//     ** КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации, переопределяющего тариф провайдера
//     ** КодПериодаДействия - Строка - код периода действия тарифа
//     ** Количество - Число - количество тарифов (разрядность 10.0)
//     ** Сумма - Число - стоимость указанного периода действия тарифа (разрядность 31.2)
//     ** НомерОснования - Строка - номер подписки на тариф, по которой был отправлен запрос на счет
//   * Услуги - ТаблицаЗначений:
//     ** Услуга - Строка - наименование услуги
//     ** Сумма - Число - стоимость услуги (разрядность 31.2).
//
Функция ДанныеЗапросаСчетаНаОплату(ТелоЗапроса) Экспорт
	
	Служебный = ПрограммныйИнтерфейсСервисаСлужебный;
	Результат = Служебный.ПереименоватьСвойства(ТелоЗапроса, ОплатаСервисаСлужебный.ПереименованияПолейЗапроса());
	Результат.Тарифы = Служебный.МассивСтруктурВТаблицуЗначений(Результат.Тарифы, Служебный.ПереименованияСчетТарифы());
	Результат.Услуги = Служебный.МассивСтруктурВТаблицуЗначений(Результат.Услуги, Служебный.ПереименованияСчетУслуги());
		
	Возврат Результат; // @skip-check constructor-function-return-section

КонецФункции

// Возвращает код ошибки данных.
// 
// Возвращаемое значение:
//   Число - код возврата ошибки данных - 10400.
//
Функция КодВозвратаОшибкаДанных() Экспорт
	
	Возврат 10400;
	
КонецФункции

// Возвращает код внутренней ошибки.
// 
// Возвращаемое значение:
//   Число - код возврата внутренней ошибки - 10500.
//
Функция КодВозвратаВнутренняяОшибка() Экспорт
	
	Возврат 10500;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция АдресСчетовНаОплатуУчетнойСистемыБиллинга()
	
	Возврат "hs/ui/bills";
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ЗагрузитьТарифыСервиса", Истина);
	
КонецПроцедуры

#КонецОбласти
