#Область СлужебныйПрограммныйИнтерфейс

Процедура ФормаРассылкиОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	ПриЗаписиШаблонаСообщений(Форма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ФормаРассылкиПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр) Экспорт
	ШаблоныПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
КонецПроцедуры

Процедура ФормаРассылкиПередУдалением(Форма, Элемент, Отказ) Экспорт
	ШаблоныПередУдалением(Форма, Элемент, Отказ);
КонецПроцедуры

Процедура ФормаРассылкиПриАктивизацииСтроки(Форма, Элемент) Экспорт
	ШаблоныПриАктивизацииСтроки(Форма, Элемент);
КонецПроцедуры

Процедура ФормаРассылкиПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	ШаблоныПередНачаломИзменения(Форма, Элемент, Отказ);
КонецПроцедуры

Процедура ФормаРассылкиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	ШаблоныВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
КонецПроцедуры

Процедура ФормаРассылкиПриУспешномЗавершенииОтправки(Форма, Результат, ДополнительныеПараметры) Экспорт
	СохранитьПользовательскиеНастройки(Форма);
КонецПроцедуры

Процедура ФормаРассылкиВыполнитьКоманду(Форма, Команда) Экспорт
	Если Команда.Имя = "ДобавитьШаблон" Тогда
		ДобавитьШаблон(Форма, Команда);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗаписиШаблонаСообщений(Форма, ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_ШаблоныСообщений" Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РассылатьПоШаблону Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Параметр, "ОбновитьСписокШаблонов");
	
	Если Параметр = Форма.ВыбранныйШаблон Тогда
		ПриАктивизацииСтрокиШаблона(Форма);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыШаблоны

Процедура ШаблоныПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование И Не Группа Тогда
		СоздатьНовыйШаблон(Форма, Элемент.ТекущиеДанные.Ссылка);
		Возврат;
	КонецЕсли;

	СоздатьНовыйШаблон(Форма);
	
КонецПроцедуры

Процедура ШаблоныПередУдалением(Форма, Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

Процедура ШаблоныПриАктивизацииСтроки(Форма, Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриАктивизацииСтрокиШаблона(Форма);
	
КонецПроцедуры

Процедура ШаблоныПередНачаломИзменения(Форма, Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьШаблон(Элемент.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

Процедура ШаблоныВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОткрытьШаблон(Форма.Шаблоны.НайтиПоИдентификатору(ВыбраннаяСтрока).Ссылка);
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьНовыйШаблон(Форма, ЗначениеКопирования = Неопределено)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения"          , "Письмо");
	ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", Форма.ПредметШаблона);
	ПараметрыФормы.Вставить("ТолькоДляАвтора",        Истина);
	ПараметрыФормы.Вставить("ВладелецШаблона",        Форма.ВладелецШаблона);
	ПараметрыФормы.Вставить("ЗначениеКопирования",    ЗначениеКопирования);
	ПараметрыФормы.Вставить("Новый",                  Истина);
	
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ОткрытьШаблон(ШаблонПисьма)

	Если Не ЗначениеЗаполнено(ШаблонПисьма) Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура("Ключ", ШаблонПисьма);
	ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

Процедура ПриАктивизацииСтрокиШаблона(Форма)

	Элементы = Форма.Элементы;

	Форма.ВыбранныйШаблон = Элементы.Шаблоны.ТекущиеДанные.Ссылка;

	Если Элементы.Шаблоны.ТекущиеДанные.ТипТекстаПисьма = ПредопределенноеЗначение("Перечисление.СпособыРедактированияЭлектронныхПисем.HTML") Тогда
		Элементы.СтраницыПредпросмотра.ТекущаяСтраница = Элементы.СтраницаФорматированныйДокумент;
		ОбновитьДанныеПредпросмотра(Форма);
	Иначе
		Элементы.СтраницыПредпросмотра.ТекущаяСтраница = Элементы.СтраницаОбычныйТекст;
		Форма.ПредпросмотрОбычныйТекст.УстановитьТекст(Элементы.Шаблоны.ТекущиеДанные.ТекстШаблона);
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьДанныеПредпросмотра(Форма)
	
	ТекущиеДанные = Форма.Элементы.Шаблоны.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("ТекстШаблонаПисьмаHTML", ТекущиеДанные.ТекстШаблона);
	Параметры.Вставить("СсылкаНаТекущийОбъект", ТекущиеДанные.Ссылка);
	
	Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Параметры, "УстановитьHTMLВФорматированныйДокумент");
		
КонецПроцедуры

Процедура СохранитьПользовательскиеНастройки(Форма)
	
	Если Форма.РассылатьПоШаблону Тогда
		Форма.Подключаемый_РассылкаПоШаблонамВызовСервера(Неопределено, "СохранитьПользовательскиеНастройки");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьШаблон(Форма, Команда)
	СоздатьНовыйШаблон(Форма);
КонецПроцедуры

#КонецОбласти