
#Область СлужебныйПрограммныйИнтерфейс

Процедура СтрокаРасчетаПриНачалеРедактирования(Форма, ИмяТаблицы, ДанныеСтроки, НоваяСтрока, Копирование) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура СтрокаРасчетаПриОкончанииРедактирования(Форма, ОписаниеТаблицы, ПересчитыватьСотрудникаБезусловно = Неопределено, ПроводитьПерерасчет = Истина, ОписаниеДокумента = Неопределено) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ОтменитьИсправление(Форма, ОписаниеТаблицы) Экспорт 
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ОтменитьВсеИсправления(Форма, ОписаниеТаблицы) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ФормаПодробнееОРасчетеНДФЛКорректировкиВыплатыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка, ОписаниеТаблицыКорректировкиВыплаты, МесяцНачисления, Организация) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ФормаПодробнееОРасчетеНДФЛПерераспределитьКорректировкиВыплаты(СтрокаКорректировкиВыплаты, РаботаВБюджетномУчреждении) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ФормаПодробнееОРасчетеНДФЛВыполнитьКомандуРедактированияРезультатовРаспределенияНачисленийИУдержаний(Форма, КорректировкиВыплаты, Организация, МесяцНачисления, Элемент, СтандартнаяОбработка) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

#КонецОбласти
