
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭтапа = Параметры.ИдентификаторТекущегоЭтапа;
	ВладелецЭтапа = Параметры.ВладелецЭтапа;
	ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	ИмяИдентификатораДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента, "ПолноеИмя");
	
	ТекущийЭтапСтрокой = "№" + Параметры.НомерТекущегоЭтапа + " " + Параметры.НаименованиеТекущегоЭтапа;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Дополнительные обработчики и события этапа ""%1""'"),
		ТекущийЭтапСтрокой);
	
	ЗаполнитьТаблицуРезультатовВыполнения();
	
	ЗаполнитьСписокДоступныхОбработчиков();
	
	ЗаполнитьПредставленияЗаполненныхДопОбработчиков();
	
	ЗаполнитьСписокСобытий();
	
	ЗаполнитьПредставленияЗаполненныхСобытий();
	
	// Перенос данные из параметров в реквизит формы для последующего чтения в событии ПриОткрытии
	ДопОбработчики.ЗагрузитьЗначения(Параметры.ДопОбработчики);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОбработчиков = ПроцессыОбработкиДокументовКлиент.ОписаниеДополнительныхОбработчиков();
	Для Каждого ОписаниеОбработчика Из ОписаниеОбработчиков Цикл
		ДобавитьВСписокВыбора = Истина;
		Если ОписаниеОбработчика.Свойство("ОбъектыМетаданных") Тогда
			ИменаОбъектовМетаданных = СтрРазделить(ОписаниеОбработчика.ОбъектыМетаданных, "," + Символы.ПС, Ложь);
			Если ИменаОбъектовМетаданных.Количество() > 0 Тогда
				ДобавитьВСписокВыбора = Ложь;
				Для Каждого ИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
					Если ИмяОбъектаМетаданных = ИмяИдентификатораДокумента Тогда
						ДобавитьВСписокВыбора = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если ДобавитьВСписокВыбора Тогда
			ДоступныеОбработчикиКлиент.Добавить(ОписаниеОбработчика.Идентификатор, ОписаниеОбработчика.Представление);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДопОбработчик Из ДопОбработчики Цикл
		Если ПустаяСтрока(ДопОбработчик.Значение.ОбработчикКлиентский) Тогда
			Продолжить;
		КонецЕсли;
		ПараметрыОтбора = Новый Структура("Статус", ДопОбработчик.Значение.Статус);
		НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			РезультатВыполнения = НайденныеСтроки[0];
		Иначе
			РезультатВыполнения = РезультатыВыполнения.Добавить();
			РезультатВыполнения.Статус = ДопОбработчик.Значение.Статус;
			РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ДопОбработчик.Значение.Статус;
			РезультатВыполнения.СтатусНеНайден = Истина;
		КонецЕсли;
		РезультатВыполнения.ОбработчикКлиентский = ДопОбработчик.Значение.ОбработчикКлиентский;
		РезультатВыполнения.ПредставлениеКлиентского = ПредставлениеКлиентскогоОбработчика(ДопОбработчик.Значение.ОбработчикКлиентский);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РезультатыВыполнения

&НаКлиенте
Процедура РезультатыВыполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "РезультатыВыполненияПредставление" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидОбработчиков", "Сервер");
		ПараметрыФормы.Вставить("ВыбранныеОбработчики", ТекущиеДанные.Обработчик);
		ПараметрыФормы.Вставить("ДоступныеОбработчики", ДоступныеОбработчикиСервер);
		
		ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.ВыборДополнительныхОбработчиков", ПараметрыФормы, Элемент);
		
	ИначеЕсли Поле.Имя = "РезультатыВыполненияПредставлениеСерверногоДоТранзакции" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидОбработчиков", "СерверДоТранзакции");
		ПараметрыФормы.Вставить("ВыбранныеОбработчики", ТекущиеДанные.ОбработчикДоТранзакции);
		ПараметрыФормы.Вставить("ДоступныеОбработчики", ДоступныеОбработчикиСервер);
		ПараметрыФормы.Вставить("ДоступныеОбработчикиГрупповые", ДоступныеОбработчикиСерверГрупповые);
		
		ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.ВыборДополнительныхОбработчиков", ПараметрыФормы, Элемент);
		
	ИначеЕсли Поле.Имя = "РезультатыВыполненияПредставлениеКлиентского" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидОбработчиков", "Клиент");
		ПараметрыФормы.Вставить("ВыбранныеОбработчики", ТекущиеДанные.ОбработчикКлиентский);
		ПараметрыФормы.Вставить("ДоступныеОбработчики", ДоступныеОбработчикиКлиент);
		
		ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.ВыборДополнительныхОбработчиков", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ВыбранноеЗначение.ВидОбработчиков = "Сервер" Тогда
		ТекущиеДанные.Обработчик = СтрСоединить(ВыбранноеЗначение.ВыбранныеДопОбработчики, ";");
		ТекущиеДанные.Представление = ПредставлениеСерверногоОбработчика(ТекущиеДанные.Обработчик);
	ИначеЕсли ВыбранноеЗначение.ВидОбработчиков = "СерверДоТранзакции" Тогда
		ТекущиеДанные.ОбработчикДоТранзакции = СтрСоединить(ВыбранноеЗначение.ВыбранныеДопОбработчики, ";");
		ТекущиеДанные.ПредставлениеСерверногоДоТранзакции =
			ПредставлениеСерверногоОбработчикаДоТранзакции(ТекущиеДанные.ОбработчикДоТранзакции);
	ИначеЕсли ВыбранноеЗначение.ВидОбработчиков = "Клиент" Тогда
		ТекущиеДанные.ОбработчикКлиентский = СтрСоединить(ВыбранноеЗначение.ВыбранныеДопОбработчики, ";");
		ТекущиеДанные.ПредставлениеКлиентского = ПредставлениеКлиентскогоОбработчика(ТекущиеДанные.ОбработчикКлиентский);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РезультатыВыполненияСобытия

&НаКлиенте
Процедура РезультатыВыполненияСобытияПредставлениеСобытияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыВыполненияСобытия.ТекущиеДанные;
	ТекущиеДанные.Событие = ТекущиеДанные.ПредставлениеСобытия;
	
	ТекущиеДанные.ПредставлениеСобытия = "";
	ТекущиеДанные.ОписаниеСобытия = "";
	
	Если ПустаяСтрока(ТекущиеДанные.Событие) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Событие Из События Цикл
		Если Событие.Значение.Идентификатор = ТекущиеДанные.Событие Тогда
			ТекущиеДанные.ПредставлениеСобытия = Событие.Значение.Представление;
			ТекущиеДанные.ОписаниеСобытия = Событие.Значение.Описание;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ЕстьДублированиеИнициирующихСобытий() Тогда
		ТекстСообщения = НСтр("ru = 'Обнаружено дублирование инициирующих событий. Одно и то же событие не может инициировать разные результаты выполнения этапа'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСобытия;
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ВыбранныеДопОбработчики = Новый Массив;
	ВыбранныеСобытия = Новый Массив;
	
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		
		Если ЗначениеЗаполнено(РезультатВыполнения.Обработчик)
			ИЛИ ЗначениеЗаполнено(РезультатВыполнения.ОбработчикДоТранзакции)
			ИЛИ ЗначениеЗаполнено(РезультатВыполнения.ОбработчикКлиентский) Тогда
			ДанныеОбработчика = Новый Структура;
			ДанныеОбработчика.Вставить("Статус", РезультатВыполнения.Статус);
			ДанныеОбработчика.Вставить("Обработчик", РезультатВыполнения.Обработчик);
			ДанныеОбработчика.Вставить("ОбработчикДоТранзакции", РезультатВыполнения.ОбработчикДоТранзакции);
			ДанныеОбработчика.Вставить("ОбработчикКлиентский", РезультатВыполнения.ОбработчикКлиентский);
			ВыбранныеДопОбработчики.Добавить(ДанныеОбработчика);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатВыполнения.Событие) Тогда
			ДанныеСобытия = Новый Структура;
			ДанныеСобытия.Вставить("Статус", РезультатВыполнения.Статус);
			ДанныеСобытия.Вставить("Событие", РезультатВыполнения.Событие);
			ВыбранныеСобытия.Добавить(ДанныеСобытия);
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа);
	ДанныеВозврата.Вставить("ДопОбработчики", ВыбранныеДопОбработчики);
	ДанныеВозврата.Вставить("События", ВыбранныеСобытия);
	ДанныеВозврата.Вставить("УдаленыНесуществующиеСтатусы", УдаленыНесуществующиеСтатусы);
	
	ДанныеВозврата.Вставить("ИмяНастройки", "НастройкаДополнительныхОбработчиков");
	
	ОповеститьОВыборе(ДанныеВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтсутствующиеСтатусы(Команда)
	
	ЭлементыКУдалению = Новый Массив;
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		Если РезультатВыполнения.СтатусНеНайден Тогда
			ЭлементыКУдалению.Добавить(РезультатВыполнения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из ЭлементыКУдалению Цикл
		РезультатыВыполнения.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	УдаленыНесуществующиеСтатусы = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуРезультатовВыполнения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.ПредставлениеРезультата КАК ПредставлениеРезультата,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Статус
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Параметры.ТекущийЭтап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыВыполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ПредставлениеРезультатаИСтатус = Выборка.ПредставлениеРезультата+" ("+Выборка.Статус+")";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбработчиков()
	
	ОписаниеОбработчиков = ПроцессыОбработкиДокументов.ОписаниеДополнительныхОбработчиков();
	Для Каждого ОписаниеОбработчика Из ОписаниеОбработчиков Цикл
		ДобавитьВСписокВыбора = Истина;
		Если ОписаниеОбработчика.Свойство("ОбъектыМетаданных") Тогда
			ИменаОбъектовМетаданных = СтрРазделить(ОписаниеОбработчика.ОбъектыМетаданных, "," + Символы.ПС, Ложь);
			Если ИменаОбъектовМетаданных.Количество() > 0 Тогда
				ДобавитьВСписокВыбора = Ложь;
				Для Каждого ИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
					Если ИмяОбъектаМетаданных = ИмяИдентификатораДокумента Тогда
						ДобавитьВСписокВыбора = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		Если ДобавитьВСписокВыбора Тогда
			Если ОписаниеОбработчика.Свойство("ГрупповаяОбработка") И ОписаниеОбработчика.ГрупповаяОбработка Тогда
				ДоступныеОбработчикиСерверГрупповые.Добавить(
					ОписаниеОбработчика.Идентификатор, ОписаниеОбработчика.Представление + НСтр("ru = ' (гр.)'"));
			Иначе
				ДоступныеОбработчикиСервер.Добавить(ОписаниеОбработчика.Идентификатор, ОписаниеОбработчика.Представление);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияЗаполненныхДопОбработчиков()
	
	Для Каждого ДопОбработчик Из Параметры.ДопОбработчики Цикл
		Если НЕ ПустаяСтрока(ДопОбработчик.Обработчик) Тогда
			ПараметрыОтбора = Новый Структура("Статус", ДопОбработчик.Статус);
			НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				РезультатВыполнения = НайденныеСтроки[0];
			Иначе
				РезультатВыполнения = РезультатыВыполнения.Добавить();
				РезультатВыполнения.Статус = ДопОбработчик.Статус;
				РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ДопОбработчик.Статус;
				РезультатВыполнения.СтатусНеНайден = Истина;
			КонецЕсли;
			РезультатВыполнения.Обработчик = ДопОбработчик.Обработчик;
			РезультатВыполнения.Представление = ПредставлениеСерверногоОбработчика(ДопОбработчик.Обработчик);
		КонецЕсли;
		Если НЕ ПустаяСтрока(ДопОбработчик.ОбработчикДоТранзакции) Тогда
			ПараметрыОтбора = Новый Структура("Статус", ДопОбработчик.Статус);
			НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				РезультатВыполнения = НайденныеСтроки[0];
			Иначе
				РезультатВыполнения = РезультатыВыполнения.Добавить();
				РезультатВыполнения.Статус = ДопОбработчик.Статус;
				РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ДопОбработчик.Статус;
				РезультатВыполнения.СтатусНеНайден = Истина;
			КонецЕсли;
			РезультатВыполнения.ОбработчикДоТранзакции = ДопОбработчик.ОбработчикДоТранзакции;
			РезультатВыполнения.ПредставлениеСерверногоДоТранзакции =
				ПредставлениеСерверногоОбработчикаДоТранзакции(ДопОбработчик.ОбработчикДоТранзакции);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеСерверногоОбработчика(Обработчики)
	
	ПредставлениеОбработчиков = Новый Массив;
	Для Каждого Обработчик Из СтрРазделить(Обработчики, ";", Ложь) Цикл
		ДоступныйОбработчик = ДоступныеОбработчикиСервер.НайтиПоЗначению(Обработчик);
		Если ДоступныйОбработчик <> Неопределено Тогда
			ПредставлениеОбработчиков.Добавить(ДоступныйОбработчик.Представление);
		Иначе
			ПредставлениеОбработчиков.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найден обработчик с ID ""%1""'"), Обработчик));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(ПредставлениеОбработчиков, "; ");
	
КонецФункции

&НаСервере
Функция ПредставлениеСерверногоОбработчикаДоТранзакции(Обработчики)
	
	ПредставлениеОбработчиков = Новый Массив;
	Для Каждого Обработчик Из СтрРазделить(Обработчики, ";", Ложь) Цикл
		ДоступныйОбработчик = ДоступныеОбработчикиСервер.НайтиПоЗначению(Обработчик);
		ДоступныйОбработчикГрупповой = ДоступныеОбработчикиСерверГрупповые.НайтиПоЗначению(Обработчик);
		Если ДоступныйОбработчик <> Неопределено Тогда
			ПредставлениеОбработчиков.Добавить(ДоступныйОбработчик.Представление);
		ИначеЕсли ДоступныйОбработчикГрупповой <> Неопределено Тогда
			ПредставлениеОбработчиков.Добавить(ДоступныйОбработчикГрупповой.Представление);
		Иначе
			ПредставлениеОбработчиков.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найден обработчик с ID ""%1""'"), Обработчик));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(ПредставлениеОбработчиков, "; ");
	
КонецФункции

&НаКлиенте
Функция ПредставлениеКлиентскогоОбработчика(Обработчики)
	
	ПредставлениеОбработчиков = Новый Массив;
	Для Каждого Обработчик Из СтрРазделить(Обработчики, ";", Ложь) Цикл
		ДоступныйОбработчик = ДоступныеОбработчикиКлиент.НайтиПоЗначению(Обработчик);
		Если ДоступныйОбработчик <> Неопределено Тогда
			ПредставлениеОбработчиков.Добавить(ДоступныйОбработчик.Представление);
		Иначе
			ПредставлениеОбработчиков.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найден клиентский обработчик с ID ""%1""'"), Обработчик));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(ПредставлениеОбработчиков, "; ");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокСобытий()
	
	События.Очистить();
	
	ОписаниеСобытий = ПроцессыОбработкиДокументов.ОписаниеСобытийИнициирующихВыполнениеЭтапов();
	Для Каждого ОписаниеСобытия Из ОписаниеСобытий Цикл
		
		ИменаОбъектовМетаданных = СтрРазделить(ОписаниеСобытия.ОбъектыМетаданных, "," + Символы.ПС, Ложь);
		
		Если ИменаОбъектовМетаданных.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ИмяОбъектаМетаданных Из ИменаОбъектовМетаданных Цикл
			Если ИмяОбъектаМетаданных = ИмяИдентификатораДокумента Тогда
				События.Добавить(ОписаниеСобытия);
				Элементы.РезультатыВыполненияСобытияПредставлениеСобытия.СписокВыбора.Добавить(
					ОписаниеСобытия.Идентификатор, ОписаниеСобытия.Представление);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияЗаполненныхСобытий()
	
	Для Каждого ПараметрСобытие Из Параметры.События Цикл
		
		Если ПустаяСтрока(ПараметрСобытие.Событие) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Статус", ПараметрСобытие.Статус);
		НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			РезультатВыполнения = НайденныеСтроки[0];
		Иначе
			РезультатВыполнения = РезультатыВыполнения.Добавить();
			РезультатВыполнения.Статус = ПараметрСобытие.Статус;
			РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ПараметрСобытие.Статус;
			РезультатВыполнения.СтатусНеНайден = Истина;
		КонецЕсли;
		РезультатВыполнения.Событие = ПараметрСобытие.Событие;
		
		НайденоВТаблицеСобытий = Ложь;
		Для Каждого Событие Из События Цикл
			Если Событие.Значение.Идентификатор = ПараметрСобытие.Событие Тогда
				РезультатВыполнения.ПредставлениеСобытия = Событие.Значение.Представление;
				РезультатВыполнения.ОписаниеСобытия = Событие.Значение.Описание;
				НайденоВТаблицеСобытий = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НайденоВТаблицеСобытий Тогда
			РезультатВыполнения.ПредставлениеСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не найдено инициирующее событие с ID ""%1""; '"), ПараметрСобытие.Событие);
			РезультатВыполнения.ОписаниеСобытия = "";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьДублированиеИнициирующихСобытий()
	
	КэшСобытий = Новый Структура;
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		
		Если ПустаяСтрока(РезультатВыполнения.Событие) Тогда
			Продолжить;
		КонецЕсли;
		
		Если КэшСобытий.Свойство(РезультатВыполнения.Событие) Тогда
			Возврат Истина;
		Иначе
			КэшСобытий.Вставить(РезультатВыполнения.Событие);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ВНастройкеЕстьОтсутствующиеСтатусы()
	
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		Если РезультатВыполнения.СтатусНеНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти