#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИнформацияДляПечати() Экспорт 
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(128));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИмяФормы", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("ИмяОтчета", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("МенеджерПечати", ОписаниеТиповСтрока);
	Результат.Колонки.Добавить("ЗаголовокФормы", ОписаниеТиповСтрока);
	
	МакетДанных = Отчеты["ВизуализацияУстаревшихОтчетов"].ПолучитьМакет("ИнформацияДляПечати");
	ОбластьДанные = МакетДанных.Области.Найти("Данные");
	Для Инд = ОбластьДанные.Верх По ОбластьДанные.Низ Цикл
		ИмяФормы = МакетДанных.Область(Инд, 1, Инд, 1).Текст;
		Если Не ЗначениеЗаполнено(ИмяФормы) Тогда 
			Прервать;
		КонецЕсли;
		
		Для Каждого СтрФорма Из СтрРазделить(ИмяФормы, ",", Ложь) Цикл 
			НовСтр = Результат.Добавить();
			НовСтр.ИмяФормы = СтрФорма;
			НовСтр.ИмяОтчета = МакетДанных.Область(Инд, 2, Инд, 2).Текст;
			НовСтр.МенеджерПечати = МакетДанных.Область(Инд, 3, Инд, 3).Текст;
			НовСтр.ЗаголовокФормы = МакетДанных.Область(Инд, 4, Инд, 4).Текст;
			
			Если Не ЗначениеЗаполнено(НовСтр.МенеджерПечати) Тогда 
				НовСтр.МенеджерПечати = "Отчеты." + НовСтр.ИмяОтчета;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(НовСтр.ЗаголовокФормы)  Тогда 
				МетаданныеОтчета = Метаданные.Отчеты.Найти(НовСтр.ИмяОтчета);
				НовСтр.ЗаголовокФормы = ?(ТипЗнч(МетаданныеОтчета) = Тип("ОбъектМетаданных"), МетаданныеОтчета.ОсновнаяФорма.Синоним, "");
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Функция РедакцияУдалена(ИмяОтчета, ИмяФормы) Экспорт 
	Возврат ЗначениеЗаполнено(РегламентированнаяОтчетностьПовтИсп.ТаблицаУдаленныхОтчетовИФорм().НайтиСтроки(
		Новый Структура("ИмяОтчета, ИмяФормы", ИмяОтчета, ИмяФормы)));
КонецФункции

Функция ИнформацияДляПечатиОтчета(Ссылка) Экспорт 
	ИнформацияДляПечати = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ВыбраннаяФорма,ИсточникОтчета,Организация");
	ИнформацияДляПечати.Вставить("МенеджерПечати");
	ИнформацияДляПечати.Вставить("СписокПечатаемыхЛистов");
	ИнформацияДляПечати.Вставить("ЗаголовокФормы");
	
	ДанныеМакета = ИнформацияДляПечати();
	НайденныеСтроки = ДанныеМакета.НайтиСтроки(Новый Структура("ИмяФормы, ИмяОтчета", ИнформацияДляПечати.ВыбраннаяФорма, ИнформацияДляПечати.ИсточникОтчета));
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда 
		Информация = НайденныеСтроки[0];
		ИнформацияДляПечати.Вставить("ЗаголовокФормы", Информация.ЗаголовокФормы + " (" + ИнформацияДляПечати.Организация + ")");
		ИнформацияДляПечати.Вставить("СписокПечатаемыхЛистов", ОбщегоНазначения.ОбщийМодуль(Информация.МенеджерПечати).СформироватьСписокЛистов(Ссылка));
		Возврат ИнформацияДляПечати;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли