#Область ПрограммныйИнтерфейс

#Область ЭтапыРаботыСКандидатами

// Возвращает таблицу с данными по этапу работу с кандидатами.
//
// Параметры:
//	Кандидаты				- Массив - ссылки на элементы справочника Кандидаты.
//	ЭтапРаботы				- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются данные.
//
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//		* Кандидат			- СправочникСсылка.Кандидаты - кандидат, приглашенный на этап.
//		* ЭтапРаботы		- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются данные.
//		* Бронь				- ДокументСсылка.Бронь - документ бронирующий помещение для проводимого этапа.
//		* Помещение			- СправочникСсылка.ТерриторииИПомещения - помещение, в котором будет проходить этап.
//		* Период			- Дата - дата и время начала проведения этапа.
//		* ПериодОкончание	- Дата - дата и время окончания проведения этапа.
//
Функция ДанныеЭтапаРаботыСКандидатами(Кандидаты, ЭтапРаботы) Экспорт
	
	Запрос = ЗапросДанныеЭтапаРаботыСКандидатами(Новый МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы);
	ДанныеЭтапаРаботы = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеЭтапаРаботы;
	
КонецФункции

// Формирует временную таблицу ВТДанныеЭтапаРаботы содержащую поля:
//		* Кандидат			- СправочникСсылка.Кандидаты - кандидат, приглашенный на этап.
//		* ЭтапРаботы		- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются данные.
//		* Бронь				- ДокументСсылка.Бронь - документ бронирующий помещение для проводимого этапа.
//		* Помещение			- СправочникСсылка.ТерриторииИПомещения - помещение, в котором будет проходить этап.
//		* Период			- Дата - дата и время начала проведения этапа.
//		* ПериодОкончание	- Дата - дата и время окончания проведения этапа.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер, в котором будет сформирована временная таблица.
//	Кандидаты				- Массив - ссылки на элементы справочника Кандидаты.
//	ЭтапРаботы				- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются данные.
//
Процедура СоздатьВТДанныеЭтапаРаботыСКандидатами(МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы) Экспорт
	
	Запрос = ЗапросДанныеЭтапаРаботыСКандидатами(МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы);
	ЗарплатаКадры.СоздатьВТПоЗапросу(МенеджерВременныхТаблиц, Запрос, "ВТДанныеЭтапаРаботы");
	
КонецПроцедуры

// Устанавливает состояние этапа работы с кандидатом.
//
// Параметры:
//	РезультатВыбора - см. ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом.
//
Процедура УстановитьСостояниеЭтапаРаботыКандидатов(РезультатВыбора) Экспорт
	
	Кандидаты = РезультатВыбора.Кандидаты;
	ЭтапРаботы = РезультатВыбора.ЭтапРаботы;
	
	Отказ = Ложь;
	ПроверитьВозможностьУстановкиЭтапаРаботы(Кандидаты, ЭтапРаботы.Этап, ЭтапРаботы.Период, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТДанныеЭтапаРаботыСКандидатами(Запрос.МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы.Этап);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрежниеДанныеЭтапа.Кандидат КАК Кандидат,
		|	ПрежниеДанныеЭтапа.Бронь КАК Бронь,
		|	ПрежниеДанныеЭтапа.Помещение КАК Помещение,
		|	ПрежниеДанныеЭтапа.ПериодОкончание КАК ПериодОкончание,
		|	ПрежниеДанныеЭтапа.Период КАК Период
		|ИЗ
		|	ВТДанныеЭтапаРаботы КАК ПрежниеДанныеЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		Отказ = Ложь;
		БронированиеПомещенийБЗК.ЗадатьБроньПоЭтапу(Запрос.МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы, Отказ);
		Если Отказ Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось забронировать помещение'");
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
		Пока Выборка.Следующий() Цикл
			ПрежниеДанныеЭтапа = Справочники.ЭтапыРаботыСКандидатами.СтруктураДанныхПланированияЭтапа();
			ЗаполнитьЗначенияСвойств(ПрежниеДанныеЭтапа, Выборка);
			СменитьЭтапРаботыКандидата(Выборка.Кандидат, ЭтапРаботы, ПрежниеДанныеЭтапа, РезультатВыбора);
		КонецЦикла;
		ОписаниеРешения = РезультатВыбора.Решение;
		Если ЗначениеЗаполнено(ОписаниеРешения.Кандидаты) Тогда
			УстановитьРешениеПоКандидатам(ОписаниеРешения.Кандидаты, ОписаниеРешения);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаполнитьВакансииКандидатов(Кандидаты, РезультатВыбора.Вакансии);
	
	Если СинхронизацияКалендарей.НастроенаСинхронизация() Тогда
		ВсеУчастники = ВсеУчастникиЭтапаРаботыСКандидатами(Кандидаты, ЭтапРаботы.Этап);
		СинхронизацияКалендарей.ПослеПланированияЭтапа(ВсеУчастники, ЭтапРаботы);
	КонецЕсли;
	
	Если РезультатВыбора.ОбратнаяСвязьПоОтклику.Отправить Тогда
		РекрутинговыеСайты.ОтправитьОбратнуюСвязьПоОтклику(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Валюты

// Функция - Валюта по справочнику
//
// Параметры:
//  КодВалютыБуквенный	 - Строка - код валюты.
//  КодВалютыЦифровой	 - Строка - код валюты.
// 
// Возвращаемое значение:
//   - СправочникСсылка.Валюты
//
Функция ВалютаПоСправочнику(Знач КодВалютыБуквенный = "", Знач КодВалютыЦифровой = "") Экспорт
	
	Если ЗначениеЗаполнено(КодВалютыЦифровой) Тогда
		Валюта = Справочники.Валюты.НайтиПоКоду(Число(КодВалютыЦифровой));
		Если ЗначениеЗаполнено(Валюта) Тогда
			Возврат Валюта;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодВалютыБуквенный) Тогда
		КодВалютыБуквенный = ВРег(КодВалютыБуквенный);
		Если КодВалютыБуквенный = "RUR" Тогда
			КодВалютыБуквенный = "RUB";
		КонецЕсли;
		КлассификаторВалют = Обработки.ЗагрузкаКурсовВалют.КлассификаторВалют();
		НайденнаяСтрока = КлассификаторВалют.Найти(КодВалютыБуквенный, "CodeSymbol");
		Если ЗначениеЗаполнено(НайденнаяСтрока) Тогда
			Валюта = Справочники.Валюты.НайтиПоКоду(Число(НайденнаяСтрока.code));
			Если ЗначениеЗаполнено(Валюта) Тогда
				Возврат Валюта;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Валюты.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	Объекты.Добавить(Метаданные.Справочники.Вакансии);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Взаимодействия

// См. ВзаимодействияПереопределяемый.ПриЗаполненииНаборовЗначенийДоступа.
Процедура ПриЗаполненииНаборовЗначенийДоступаВзаимодействий(Объект, Таблица) Экспорт
	ЗаполнитьНаборЗначенийДоступаВзаимодействияСПредметомКандидатом(Объект, Таблица);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Взаимодействия

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт

	Раздел = Разделы.Добавить();
	Раздел.Имя  = "ПодборПерсонала";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("8ff2b10d-ae8f-4065-984f-a3a9113f001e");
	Раздел.Представление = НСтр("ru = 'Подбор персонала'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));

КонецПроцедуры

// СтандартныеПодсистемы.ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе")
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ТекущиеЭтапыРаботыСКандидатами) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(ПодборПерсонала);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат; // Модель сервиса.
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта(Метаданные.Справочники.Кандидаты.ПолноеИмя());
	Если Разделы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Способ = ПодборПерсоналаПроверки.СпособыВыявленияЗадержавшихсяКандидатов().Предупреждение;
	ЗадержавшиесяКандидаты = ПодборПерсоналаПроверки.ЗадержавшиесяКандидаты(Способ);
	Если ЗадержавшиесяКандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Раздел Из Разделы Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор  = "ЗадержавшиесяКандидаты";
		Дело.ЕстьДела       = Истина;
		Дело.Важное         = Истина;
		Дело.Владелец       = Раздел;
		Дело.Представление  = НСтр("ru = 'Задержавшиеся кандидаты'");
		Дело.Количество     = ЗадержавшиесяКандидаты.Количество();
		Дело.Форма          = "Справочник.Кандидаты.Форма.ФормаСписка";
		Дело.ПараметрыФормы = Новый Структура("ЗадержавшиесяКандидаты", ЗадержавшиесяКандидаты);
	КонецЦикла;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ТекущиеДела

// СтандартныеПодсистемы.РегламентныеЗадания

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.РегламентныеЗадания

// ТехнологияСервиса.ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе.Имя);
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе.ИмяМетода);
КонецПроцедуры

// Конец ТехнологияСервиса.ОчередьЗаданий

// Дополняет колонки таблицы хранения состава документа.
// 
// Параметры:
// 	Таблица - ТаблицаЗначений:
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * ГоловнойСотрудник - СправочникСсылка.Сотрудники
//   * Сотрудник - СправочникСсылка.Сотрудники
//   * ВключатьВКраткийСостав - Булево
Процедура ПриСозданииТаблицыХраненияСоставаДокумента(Таблица) Экспорт
	
	КолонкаФизическоеЛицо = Таблица.Колонки.Найти("ФизическоеЛицо");
	Если КолонкаФизическоеЛицо <> Неопределено Тогда
		Таблица.Колонки.Удалить(Таблица.Колонки.Индекс(КолонкаФизическоеЛицо));
	КонецЕсли;
	
	Таблица.Колонки.Добавить("ФизическоеЛицо", КадровыйРезерв.ОписаниеТиповУчастниковКадровогоРезерва());
	
КонецПроцедуры

// Дополняет соответствие данными ФИО кандидатов.
// 
// Параметры:
//  СоответствиеФИОФизическихЛицСсылкам - см. ЗарплатаКадры.СоответствиеФИОФизЛицСсылкам
//  ДатаАктуальности - см. ЗарплатаКадры.СоответствиеФИОФизЛицСсылкам.ДатаАктуальности
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица,СправочникСсылка.ЛичныеДанныеКандидатов
Процедура ДополнитьСоответствиеФИОФизическихЛиц(СоответствиеФИОФизическихЛицСсылкам, Знач ДатаАктуальности,
	Знач ФизическиеЛица) Экспорт
	
	ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатовИзМассиваДанных(ФизическиеЛица);
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКандидатов = ОсновныеСведенияОЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов);
	Для Каждого ДанныеКандидата Из ДанныеКандидатов Цикл
		ФИО = ЗарплатаКадры.НовоеОписаниеФИО();
		ЗаполнитьЗначенияСвойств(ФИО, ДанныеКандидата);
		ФИО.ФамилияИО = СтрШаблон(НСтр("ru = '%1 %2. %3.'"), ФИО.Фамилия,
			?(ЗначениеЗаполнено(ФИО.Имя), Лев(ФИО.Имя, 1), ""),
			?(ЗначениеЗаполнено(ФИО.Отчество), Лев(ФИО.Отчество, 1), ""));
		СоответствиеФИОФизическихЛицСсылкам.Вставить(ДанныеКандидата.ЛичныеДанныеКандидата, ФИО);
	КонецЦикла;
	
КонецПроцедуры

// ЗарплатаКадрыПриложения.КадровыйРезерв

// Возвращает данные кандидатов для отображения в форме документа "Включение в кадровый резерв".
// 
// Параметры:
//  УчастникиКадровогоРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
// 
// Возвращаемое значение:
//  см. КадровыйРезервФормы.НоваяТаблицаДанныхУчастниковКадровогоРезерва
Функция ДанныеКандидатовДляВключенияВКадровыйРезерв(Знач УчастникиКадровогоРезерва) Экспорт
	
	ДанныеУчастниковКадровогоРезерва = КадровыйРезервФормы.НоваяТаблицаДанныхУчастниковКадровогоРезерва();
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат ДанныеУчастниковКадровогоРезерва;
	КонецЕсли;
	
	ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатовИзМассиваДанных(УчастникиКадровогоРезерва);
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидатов) Тогда
		Возврат ДанныеУчастниковКадровогоРезерва;
	КонецЕсли;
	
	ОсновныеСведения = ОсновныеСведенияОЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов);
	ОсновныеСведения.Индексы.Добавить("ЛичныеДанныеКандидата");
	
	ДанныеКандидатов = КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	ДанныеКандидатов.Индексы.Добавить("ЛичныеДанныеКандидата");
	
	Образование = ОбразованиеКандидатов(ЛичныеДанныеКандидатов); 
	Образование.Индексы.Добавить("ЛичныеДанныеКандидата");
	
	ОпытРаботы = ОпытРаботыКандидатов(ЛичныеДанныеКандидатов);
	ОпытРаботы.Индексы.Добавить("ЛичныеДанныеКандидата");
	
	ЗнаниеЯзыков = ЗнаниеЯзыковКандидатов(ЛичныеДанныеКандидатов);
	ЗнаниеЯзыков.Индексы.Добавить("ЛичныеДанныеКандидата");

	Для Каждого ЛичныеДанныеКандидата Из ЛичныеДанныеКандидатов Цикл
		НайденнаяСтрока = ОсновныеСведения.Найти(ЛичныеДанныеКандидата, "ЛичныеДанныеКандидата");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеДанных = КадровыйРезервФормы.НовоеОписаниеУчастникаКадровогоРезерва();
		ОписаниеДанных.УчастникКадровогоРезерва = ЛичныеДанныеКандидата;
		ОписаниеДанных.ДатаРождения = НайденнаяСтрока.ДатаРождения;
		ОписаниеДанных.ТекстВозраста = Формат(НайденнаяСтрока.ДатаРождения, "ДЛФ=D");
		
		СтрокиДанныеКандидатов = ДанныеКандидатов.НайтиСтроки(Новый Структура("ЛичныеДанныеКандидата",
			ЛичныеДанныеКандидата));
		Если СтрокиДанныеКандидатов.Количество() > 0 Тогда
			ОписаниеДанных.Вставить("Кандидат", СтрокиДанныеКандидатов[0].Кандидат);
		КонецЕсли;
		
		ЗнанияЯзыковПредставление = "";
		СтрокиЯзыки = ЗнаниеЯзыков.НайтиСтроки(Новый Структура("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата));
		Для Каждого СтрокаЯзык Из СтрокиЯзыки Цикл
			ЗнанияЯзыковПредставление = СтрШаблон(НСтр("ru = '%1 %2 (%3),'"), ЗнанияЯзыковПредставление,
				СтрокаЯзык.Язык, СтрокаЯзык.СтепеньЗнанияЯзыка);
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ЗнанияЯзыковПредставление);
		ОписаниеДанных.ЗнанияЯзыков = СокрЛП(ЗнанияЯзыковПредставление);
		
		ОбразованиеПредставление = "";
		СтрокиОбразование = Образование.НайтиСтроки(Новый Структура("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата));
		Для Каждого СтрокаОбразование Из СтрокиОбразование Цикл
			ОбразованиеПредставление = СтрШаблон(НСтр("ru = '%1 %2,'"), ОбразованиеПредставление,
				СтрокаОбразование.УчебноеЗаведение);
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ОбразованиеПредставление);
		ОписаниеДанных.ПолученныеОбразования = СокрЛП(ОбразованиеПредставление);
		
		ОпытРаботыПредставление = "";
		СтрокиОпытРаботы = ОпытРаботы.НайтиСтроки(Новый Структура("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата));
		Для Каждого СтрокаОпытРаботы Из СтрокиОпытРаботы Цикл
			ОпытРаботыПредставление = СтрШаблон(НСтр("ru = '%1 %2, %3, с %4 по %5%6'"), ОпытРаботыПредставление,
				СтрокаОпытРаботы.Компания, СтрокаОпытРаботы.Должность, Формат(СтрокаОпытРаботы.ДатаНачала, "ДЛФ=D"),
				Формат(СтрокаОпытРаботы.ДатаОкончания, "ДЛФ=D"), Символы.ПС );
		КонецЦикла;
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ОпытРаботыПредставление);
		ОписаниеДанных.ТрудоваяДеятельность = СокрЛП(ОпытРаботыПредставление);
		
		НоваяСтрока = ДанныеУчастниковКадровогоРезерва.Добавить();
		НоваяСтрока.УчастникКадровогоРезерва = ЛичныеДанныеКандидата;
		НоваяСтрока.СтруктураДанных = ОписаниеДанных;
	КонецЦикла;
	
	Возврат ДанныеУчастниковКадровогоРезерва;
	
КонецФункции

// Дополнить данные резервистов.
// 
// Параметры:
//  ДанныеРезервистов - см. КадровыйРезерв.НоваяТаблицаДанныхУчастниковКадровогоРезерва
//  УчастникиКадровогоРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
Процедура ДополнитьДанныеРезервистов(ДанныеРезервистов, Знач УчастникиКадровогоРезерва) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатовИзМассиваДанных(УчастникиКадровогоРезерва);
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКандидатов = КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	Для Каждого ДанныеКандидата Из ДанныеКандидатов Цикл
		НоваяСтрока = ДанныеРезервистов.Добавить();
		НоваяСтрока.УчастникКадровогоРезерва = ДанныеКандидата.ЛичныеДанныеКандидата;
		НоваяСтрока.ФИОПолные = ДанныеКандидата.ФИО;
		НоваяСтрока.Подразделение = ДанныеКандидата.Подразделение;
		Если ЗначениеЗаполнено(ДанныеКандидата.Позиция) Тогда
			ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ДанныеКандидатов[0].Позиция);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПозиции, "Организация, МестоВСтруктуреПредприятия, Должность");
		ИначеЕсли ЗначениеЗаполнено(ДанныеКандидата.Подразделение) Тогда
			Источник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеКандидата.Подразделение, "Источник");
			Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
				НоваяСтрока.Организация = Источник;
			ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				НоваяСтрока.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "Владелец");
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.ДополнительныеДанные = Новый Структура("Кандидат", ДанныеКандидата.Кандидат);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет таблицу для подбора кандидатов в кадровый резерв из формы ФормаПодбораКандидатовПоТребованиям справочника
// КадровыйРезерв. Таблица дополняется личными данными кандидатов, которые не являются сотрудниками.
// 
// Параметры:
//  КандидатыВРезервисты - см. КадровыйРезервФормы.НоваяТаблицаКандидатовВРезервисты
//  КритерииПоиска - см. КадровыйУчет.КритерииПоискаСотрудниковПоКоллекцииОтборов 
Процедура ДополнитьТаблицуДляПодбораКандидатовВКадровыйРезерв(КандидатыВРезервисты, КритерииПоиска = Неопределено) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата
	|ПОМЕСТИТЬ ВТКандидатыССотрудниками
	|ИЗ
	|	РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			Справочник.Сотрудники КАК Сотрудники
	|		ГДЕ
	|			Сотрудники.ФизическоеЛицо = ФизическиеЛицаКандидатов.ФизическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК УчастникКадровогоРезерва,
	|	Т.Представление
	|ИЗ
	|	Справочник.ЛичныеДанныеКандидатов КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления
	|	И &ОтборПоОбразованию
	|	И НЕ ЛОЖЬ В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ЛОЖЬ
	|		ИЗ
	|			ВТКандидатыССотрудниками КАК КандидатыССотрудниками
	|		ГДЕ
	|			КандидатыССотрудниками.ЛичныеДанныеКандидата = Т.Ссылка)";
	
	ОтборПоОбразованию = Истина;
	
	Если ЗначениеЗаполнено(КритерииПоиска) Тогда
		СхемаЗапроса = Новый СхемаЗапроса();
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		ПакетЗапроса = СхемаЗапроса.ПакетЗапросов[1];
		ОператорЗапроса = ПакетЗапроса.Операторы[0];

		Для Каждого КритерийПоиска Из КритерииПоиска Цикл
			Ключ = КритерийПоиска.Ключ;
			Если СтрНайти(Ключ, "РегистрСведений.СтажиФизическихЛиц") > 0 Тогда
				// Если задан отбор по стажу, то кандидатов не добавляем.
				Возврат;
			ИначеЕсли Ключ = "Справочник.ФизическиеЛица" Тогда
				Для Каждого Отбор Из КритерийПоиска.Значение Цикл
					ОператорЗапроса.Отбор.Добавить(
						СтрШаблон("%1 %2 %3", Отбор.ЛевоеЗначение, Отбор.ВидСравнения, Отбор.ПравоеЗначение));
				КонецЦикла;
			ИначеЕсли Ключ = "Справочник.ОбразованиеФизическихЛиц" Тогда
				Для Каждого Отбор Из КритерийПоиска.Значение Цикл
					Если Отбор.ЛевоеЗначение = "ВИДОБРАЗОВАНИЯ" И Отбор.ВидСравнения = "В"
						И ТипЗнч(Отбор.ПравоеЗначение) = Тип("Массив") Тогда
						ВыражениеОтборПоОбразованию = ОператорЗапроса.Отбор.Найти("&ОтборПоОбразованию");
						Если ВыражениеОтборПоОбразованию <> Неопределено Тогда
							ОператорЗапроса.Отбор.Удалить(ОператорЗапроса.Отбор.Индекс(ВыражениеОтборПоОбразованию));
						КонецЕсли;
						ОтборПоОбразованию = Отбор.ПравоеЗначение;
						ОператорЗапроса.Отбор.Добавить(ТекстОтбораПоВидуОбразования());
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОтборПоОбразованию", ОтборПоОбразованию);

	РезультатЗапроса = Запрос.Выполнить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса.Выгрузить(), КандидатыВРезервисты);

КонецПроцедуры

// Заполняет роль резервиста в таблице значений с данными кадрового резерва на дату.
// 
// Параметры:
//  ДанныеРезерва - см. КадровыйРезерв.НоваяТаблицаКадровогоРезерваНаДату
Процедура ПриЗаполненииКадровогоРезерваНаДату(ДанныеРезерва) Экспорт
	
	Для Каждого ТекущаяСтрока Из ДанныеРезерва Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.РольФизическогоЛица)
			И ТипЗнч(ТекущаяСтрока.УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			ТекущаяСтрока.РольФизическогоЛица = Перечисления.РолиФизическихЛиц.Кандидат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Конец ЗарплатаКадрыПриложения.КадровыйРезерв

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("СформироватьШаблоныСообщений");
	Методы.Вставить("ПеренестиЗначениеИспользоватьПодборПерсонала");
	Методы.Вставить("УточнитьВладельцевШаблоновСообщенийСогласования");
	Методы.Вставить("ДобавитьПредопределенныеЭтапыВакансийПрофилейДолжности");
	Методы.Вставить("ИсправитьБесконтекстныеШаблоныСообщений");
	Методы.Вставить("ОбновитьНаборыЗначенийДоступаВзаимодействий");
	Методы.Вставить("УточнитьТекущийЭтапРаботыСКандидатами");
	Методы.Вставить("ДобавитьПредопределенныеЭтапыРаботыСКандидатами");
	Методы.Вставить("ЗаполнитьВидыКонтактнойИнформацииКандидатов");
	Методы.Вставить("ЗаменитьУстаревшиеПараметрыШаблоновСообщений");
	Методы.Вставить("ЗаполнитьЛичныеДанныеКандидатовИСвязанныеДанные");
	Методы.Вставить("УточнитьВладельцевШаблоновСообщенийИзмененияЭтаповРаботы");
	Методы.Вставить("ЗаменитьПараметрыШаблоновСообщенийКандидатов");
	Методы.Вставить("ОбновитьОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе");
	Методы.Вставить("ОбновитьДанныеРегистраГруппыЗначенийДоступа");
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Обработка.ПоискРезюмеВИнтернете";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПоискаКандидатов";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, ПараметрыМетода)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "РегистрСведений.РаботаСКандидатами";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПолученияДанных";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, УчетнаяЗапись, Идентификатор)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "РегистрСведений.РаботаСКандидатами";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияОтменыВидеоконференции";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, УчетнаяЗапись, Идентификатор)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Справочник.Кандидаты";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияЗагрузкиКомментариев";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяПроцедуры, Кандидат)";
	
КонецПроцедуры

#КонецОбласти

// Синхронизирует наименования личных данных кандидатов при смене ФИО физического лица.
// 
// Параметры:
//  ФИОФизическихЛиц - ТаблицаЗначений:
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * Фамилия - Строка - новая фамилия
//   * Имя - Строка - новое имя
//   * Отчество - Строка - новое отчество
Процедура ПриИзмененииНаименованияФизическогоЛица(ФИОФизическихЛиц) Экспорт
	
	ЛичныеДанныеКандидатовФизическихЛиц = ЛичныеДанныеКандидатовФизическихЛиц(
		ОбщегоНазначения.ВыгрузитьКолонку(ФИОФизическихЛиц, "ФизическоеЛицо", Истина));
		
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидатовФизическихЛиц) Тогда
		Возврат;
	КонецЕсли;
		
	СведенияОЛичныхДанных = ОсновныеСведенияОЛичныхДанныхКандидатов(
		ОбщегоНазначения.ВыгрузитьКолонку(ЛичныеДанныеКандидатовФизическихЛиц, "Значение", Истина));
		
	Для Каждого СтрокаТаблицы Из ФИОФизическихЛиц Цикл
		
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатовФизическихЛиц.Получить(СтрокаТаблицы.ФизическоеЛицо);
		ДанныеКандидата = СведенияОЛичныхДанных.Найти(ЛичныеДанныеКандидата, "ЛичныеДанныеКандидата");
		
		СтруктураФИО = Новый Структура;
		СтруктураФИО.Вставить("Фамилия", СтрокаТаблицы.Фамилия);
		СтруктураФИО.Вставить("Имя", СтрокаТаблицы.Имя);
		СтруктураФИО.Вставить("Отчество", СтрокаТаблицы.Отчество);
		
		НаименованиеПоФИОФизлица = Справочники.Кандидаты.НаименованиеПоФИО(СтруктураФИО,
			ДанныеКандидата.УточнениеНаименования);
		
		Если ДанныеКандидата.Наименование = НаименованиеПоФИОФизлица Тогда
			Продолжить;
		КонецЕсли;

		ЛичныеДанныеОбъект = ЛичныеДанныеКандидата.ПолучитьОбъект();
		Попытка 
			ЛичныеДанныеОбъект.Заблокировать();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось изменить наименование личных данных кандидата %1.
				|Возможно, данные редактируются другим пользователем'"),
				ЛичныеДанныеОбъект.Наименование);
			ВызватьИсключение ТекстСообщения;
		КонецПопытки;
		
		ЛичныеДанныеОбъект.Наименование = НаименованиеПоФИОФизлица;
		ЛичныеДанныеОбъект.ФИО = Справочники.Кандидаты.НаименованиеПоФИО(СтруктураФИО);
		ЛичныеДанныеОбъект.ФИООтсутствует = Ложь;
		ЛичныеДанныеОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// См. Справочники.Кандидаты.КандидатыФизическихЛиц
Функция КандидатыФизическихЛиц(ФизическиеЛица) Экспорт
	Возврат Справочники.Кандидаты.КандидатыФизическихЛиц(ФизическиеЛица);
КонецФункции

// См. Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов
Функция КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, ПолучатьДанныеКандидатов = Истина) Экспорт
	Возврат Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, ПолучатьДанныеКандидатов);
КонецФункции

// См. Справочники.Кандидаты.ЛичныеДанныеКандидатов
Функция ЛичныеДанныеКандидатов(Кандидаты) Экспорт
	Возврат Справочники.Кандидаты.ЛичныеДанныеКандидатов(Кандидаты);
КонецФункции

// См. Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеКандидатовФизическихЛиц
Функция ЛичныеДанныеКандидатовФизическихЛиц(ФизическиеЛица) Экспорт
	Возврат Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеКандидатовФизическихЛиц(ФизическиеЛица);
КонецФункции

// См. Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеКандидатаФизическогоЛица
Функция ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо) Экспорт
	Возврат Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицо);
КонецФункции

// См. Справочники.ЛичныеДанныеКандидатов.ФизическиеЛицаЛичныхДанныхКандидатов
Функция ФизическиеЛицаЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, ТолькоНеПомеченныеНаУдаление = Ложь) Экспорт
	Возврат Справочники.ЛичныеДанныеКандидатов.ФизическиеЛицаЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов,
		ТолькоНеПомеченныеНаУдаление);
КонецФункции

// См. Справочники.ЛичныеДанныеКандидатов.ФизическоеЛицоЛичныхДанныхКандидата
Функция ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата) Экспорт
	Возврат Справочники.ЛичныеДанныеКандидатов.ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата);
КонецФункции

// Возвращает массив личных данных кандидатов для переданного массива кандидатов.
// 
// Параметры:
//  Кандидаты - Массив из Произвольный
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ЛичныеДанныеКандидатов
Функция СсылкиНаЛичныеДанныеКандидатов(Знач Кандидаты) Экспорт
	
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(Кандидаты, Тип("СправочникСсылка.Кандидаты"));
	ЛичныеДанныеКандидатов = ОбщегоНазначения.ВыгрузитьКолонку(ЛичныеДанныеКандидатов(Кандидаты), "Значение");
	
	Возврат ЛичныеДанныеКандидатов;
		
КонецФункции

#Область ДанныеКандидатов

// Возвращает таблицу значений с основными данными о кандидатах по массиву кандидатов.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ОсновныеСведенияОКандидатахПоДаннымВТ
Функция ОсновныеСведенияОКандидатах(Кандидаты, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовКандидатов(Кандидаты, МенеджерВременныхТаблиц);
	
	Возврат ОсновныеСведенияОКандидатахПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "Кандидат");
	
КонецФункции

// Возвращает таблицу значений с основными данными о кандидатах по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Кандидат - СправочникСсылка.Кандидаты
//   * Код - Строка
//   * Наименование - Строка
//   * Вакансия - СправочникСсылка.Вакансии
//   * Позиция - СправочникСсылка.ШтатноеРасписание
//   * Подразделение - СправочникСсылка.СтруктураПредприятия
//   * ОжидаемыйДоход - Число
//   * ВалютаДохода - СправочникСсылка.Валюты
//   * ПериодичностьДохода - ПеречислениеСсылка.ПериодичностьОжидаемогоДоходаКандидатов
//   * ОСебе - Строка
//   * Письмо - Строка
//   * Ответственный - СправочникСсылка.Пользователи,
//   * ОтветственныйФизическоеЛицо - СправочникСсылка.ФизическиеЛица,
//   * ДатаРегистрации - Дата,
//   * Рейтинг - Число,
//   * СреднийРейтинг - Число,
//   * ДатаРешения - Дата,
//   * ПричинаОтклонения - СправочникСсылка.ПричиныОтклоненияКандидатов,
//   * ПрофильДолжности - СправочникСсылка.ПрофилиДолжностей,
//   * Состояние - ПеречислениеСсылка.СостоянияСогласования,
//   * КомментарийРешения - Строка,
//   * ТекущийЭтап - СправочникСсылка.ЭтапыРаботыСКандидатами,
//   * СостояниеЭтапа - ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами,
//   * ДатаВремяЭтапа - Дата,
//   * ИсточникИнформации - СправочникСсылка.ИсточникиИнформацииОКандидатах,
//   см. ОсновныеСведенияОЛичныхДанныхКандидатовПоДаннымВТ
Функция ОсновныеСведенияОКандидатахПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора) Экспорт
	
	ОписательВременныхТаблиц = ОписательВременныхТаблицДляСоздатьВТОсновныеСведенияОКандидатах(МенеджерВременныхТаблиц);
	СоздатьВТОсновныеСведенияОКандидатах(ОписательВременныхТаблиц, Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияОКандидатах.Кандидат КАК Кандидат,
	|	СведенияОКандидатах.Код КАК Код,
	|	СведенияОКандидатах.Наименование КАК Наименование,
	|	СведенияОКандидатах.ПометкаУдаления КАК ПометкаУдаления,
	|	СведенияОКандидатах.Вакансия КАК Вакансия,
	|	СведенияОКандидатах.Позиция КАК Позиция,
	|	СведенияОКандидатах.Подразделение КАК Подразделение,
	|	СведенияОКандидатах.ОжидаемыйДоход КАК ОжидаемыйДоход,
	|	СведенияОКандидатах.ВалютаДохода КАК ВалютаДохода,
	|	СведенияОКандидатах.ПериодичностьДохода КАК ПериодичностьДохода,
	|	СведенияОКандидатах.ОСебе КАК ОСебе,
	|	СведенияОКандидатах.ФотографияСсылка КАК ФотографияСсылка,
	|	СведенияОКандидатах.ХранилищеФотографии КАК ХранилищеФотографии,
	|	СведенияОКандидатах.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
	|	СведенияОКандидатах.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СведенияОКандидатах.ФИО КАК ФИО,
	|	СведенияОКандидатах.Фамилия КАК Фамилия,
	|	СведенияОКандидатах.Имя КАК Имя,
	|	СведенияОКандидатах.Отчество КАК Отчество,
	|	СведенияОКандидатах.УточнениеНаименования КАК УточнениеНаименования,
	|	СведенияОКандидатах.Пол КАК Пол,
	|	СведенияОКандидатах.ДатаРождения КАК ДатаРождения,
	|	СведенияОКандидатах.Гражданство КАК Гражданство,
	|	СведенияОКандидатах.EMail КАК EMail,
	|	СведенияОКандидатах.Адрес КАК Адрес,
	|	СведенияОКандидатах.Телефон КАК Телефон,
	|	СведенияОКандидатах.Возраст КАК Возраст,
	|	СведенияОКандидатах.Ответственный КАК Ответственный,
	|	СведенияОКандидатах.ОтветственныйФизическоеЛицо КАК ОтветственныйФизическоеЛицо,
	|	СведенияОКандидатах.Письмо КАК Письмо,
	|	СведенияОКандидатах.ИсточникИнформации КАК ИсточникИнформации,
	|	СведенияОКандидатах.Язык КАК Язык,
	|	СведенияОКандидатах.ВидОбразования КАК ВидОбразования,
	|	СведенияОКандидатах.УчебноеЗаведение КАК УчебноеЗаведение,
	|	СведенияОКандидатах.Факультет КАК Факультет,
	|	СведенияОКандидатах.Специальность КАК Специальность,
	|	СведенияОКандидатах.ГодОкончания КАК ГодОкончания,
	|	СведенияОКандидатах.ДатаРегистрации КАК ДатаРегистрации,
	|	СведенияОКандидатах.Рейтинг КАК Рейтинг,
	|	СведенияОКандидатах.ДатаРешения КАК ДатаРешения,
	|	СведенияОКандидатах.ПричинаОтклонения КАК ПричинаОтклонения,
	|	СведенияОКандидатах.СреднийРейтинг КАК СреднийРейтинг,
	|	СведенияОКандидатах.ПрофильДолжности КАК ПрофильДолжности,
	|	СведенияОКандидатах.Состояние КАК Состояние,
	|	СведенияОКандидатах.КомментарийРешения КАК КомментарийРешения,
	|	СведенияОКандидатах.ТекущийЭтап КАК ТекущийЭтап,
	|	СведенияОКандидатах.СостояниеЭтапа КАК СостояниеЭтапа,
	|	СведенияОКандидатах.ДатаВремяЭтапа КАК ДатаВремяЭтапа,
	|	СведенияОКандидатах.Образование1ВидОбразования КАК Образование1ВидОбразования,
	|	СведенияОКандидатах.Образование1УчебноеЗаведение КАК Образование1УчебноеЗаведение,
	|	СведенияОКандидатах.Образование1Факультет КАК Образование1Факультет,
	|	СведенияОКандидатах.Образование1Специальность КАК Образование1Специальность,
	|	СведенияОКандидатах.Образование1ГодОкончания КАК Образование1ГодОкончания,
	|	СведенияОКандидатах.Образование2ВидОбразования КАК Образование2ВидОбразования,
	|	СведенияОКандидатах.Образование2УчебноеЗаведение КАК Образование2УчебноеЗаведение,
	|	СведенияОКандидатах.Образование2Факультет КАК Образование2Факультет,
	|	СведенияОКандидатах.Образование2Специальность КАК Образование2Специальность,
	|	СведенияОКандидатах.Образование2ГодОкончания КАК Образование2ГодОкончания
	|ИЗ
	|	ВТСведенияОКандидатах КАК СведенияОКандидатах
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с основными данными о личных данных кандидатов по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ОсновныеСведенияОКандидатахПоДаннымВТ
Функция ОсновныеСведенияОЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат ОсновныеСведенияОЛичныхДанныхКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы",
		"ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с основными данными о личных данных кандидатов по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//   * Наименование - Строка
//   * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//   * ФИО - Строка
//   * Фамилия - Строка
//   * Имя - Строка
//   * Отчество - Строка
//   * УточнениеНаименования - Строка
//   * Пол - ПеречислениеСсылка.ПолФизическогоЛица
//   * ХранилищеФотографии - ХранилищеЗначения
//   * ДатаРождения - Дата
//   * Гражданство - СправочникСсылка.СтраныМира
//   * EMail - Строка
//   * Адрес - Строка
//   * Телефон - Строка
//   * Возраст - Число
//   * Язык - СправочникСсылка.ЯзыкиНародовМира,
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц,
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения,
//   * Факультет - Строка,
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию,
//   * ГодОкончания - Число,
//   * Образование1ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц,
//   * Образование1УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения,
//   * Образование1Факультет - Строка,
//   * Образование1Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию,
//   * Образование1ГодОкончания - Число,
//   * Образование2ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц,
//   * Образование2УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения,
//   * Образование2Факультет - Строка,
//   * Образование2Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию,
//   * Образование2ГодОкончания - Число
Функция ОсновныеСведенияОЛичныхДанныхКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов,
	ИмяПоляОтбора) Экспорт
	
	ОписательВременныхТаблиц = ОписательВременныхТаблицДляСоздатьВТЛичныеДанныеКандидатов(МенеджерВременныхТаблиц);
	СоздатьВТЛичныеДанныеКандидатов(ОписательВременныхТаблиц, Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
	|	ЛичныеДанныеКандидатов.Наименование КАК Наименование,
	|	ЛичныеДанныеКандидатов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЛичныеДанныеКандидатов.ФИО КАК ФИО,
	|	ЛичныеДанныеКандидатов.Фамилия КАК Фамилия,
	|	ЛичныеДанныеКандидатов.Имя КАК Имя,
	|	ЛичныеДанныеКандидатов.Отчество КАК Отчество,
	|	ЛичныеДанныеКандидатов.УточнениеНаименования КАК УточнениеНаименования,
	|	ЛичныеДанныеКандидатов.Пол КАК Пол,
	|	ЛичныеДанныеКандидатов.ДатаРождения КАК ДатаРождения,
	|	ЛичныеДанныеКандидатов.Гражданство КАК Гражданство,
	|	ЛичныеДанныеКандидатов.EMailПредставление КАК EMail,
	|	ЛичныеДанныеКандидатов.АдресПредставление КАК Адрес,
	|	ЛичныеДанныеКандидатов.ТелефонПредставление КАК Телефон,
	|	ЛичныеДанныеКандидатов.Возраст КАК Возраст,
	|	ЛичныеДанныеКандидатов.Язык КАК Язык,
	|	ЛичныеДанныеКандидатов.ВидОбразования КАК ВидОбразования,
	|	ЛичныеДанныеКандидатов.УчебноеЗаведение КАК УчебноеЗаведение,
	|	ЛичныеДанныеКандидатов.Факультет КАК Факультет,
	|	ЛичныеДанныеКандидатов.Специальность КАК Специальность,
	|	ЛичныеДанныеКандидатов.ГодОкончания КАК ГодОкончания,
	|	ЛичныеДанныеКандидатов.Образование1ВидОбразования КАК Образование1ВидОбразования,
	|	ЛичныеДанныеКандидатов.Образование1УчебноеЗаведение КАК Образование1УчебноеЗаведение,
	|	ЛичныеДанныеКандидатов.Образование1Факультет КАК Образование1Факультет,
	|	ЛичныеДанныеКандидатов.Образование1Специальность КАК Образование1Специальность,
	|	ЛичныеДанныеКандидатов.Образование1ГодОкончания КАК Образование1ГодОкончания,
	|	ЛичныеДанныеКандидатов.Образование2ВидОбразования КАК Образование2ВидОбразования,
	|	ЛичныеДанныеКандидатов.Образование2УчебноеЗаведение КАК Образование2УчебноеЗаведение,
	|	ЛичныеДанныеКандидатов.Образование2Факультет КАК Образование2Факультет,
	|	ЛичныеДанныеКандидатов.Образование2Специальность КАК Образование2Специальность,
	|	ЛичныеДанныеКандидатов.Образование2ГодОкончания КАК Образование2ГодОкончания,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатовФото.Фотография, НЕОПРЕДЕЛЕНО) КАК ФотографияСсылка,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатовФото.Фотография.ФайлХранилище, НЕОПРЕДЕЛЕНО) КАК ХранилищеФотографии
	|ИЗ
	|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатовФото
	|		ПО ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатовФото.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с данными об опыте работы кандидатов по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ОпытРаботыКандидатовПоДаннымВТ
Функция ОпытРаботыКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат ОпытРаботыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с данными об опыте работы кандидатов по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
//  ИмяВТ - Строка - Имя временной таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * Компания - Строка
//    * ДатаНачала - Дата
//    * ДатаОкончания - Дата
//    * Должность - Строка
//    * Обязанности - Строка
//    * СфераДеятельностиКомпании - Строка
Функция ОпытРаботыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора,
	ИмяВТ = "ВТОпытРаботыКандидатов") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) = Неопределено Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяВТ,
			ИмяПоляОтбора);
		СоздатьВТОпытРаботыКандидатов(ОписательВременныхТаблиц, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОпытРаботы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОпытРаботы.Компания КАК Компания,
		|	ОпытРаботы.ДатаНачала КАК ДатаНачала,
		|	ОпытРаботы.ДатаОкончания КАК ДатаОкончания,
		|	ОпытРаботы.Должность КАК Должность,
		|	ОпытРаботы.Обязанности КАК Обязанности,
		|	ОпытРаботы.СфераДеятельностиКомпании КАК СфераДеятельностиКомпании
		|ИЗ
		|	ВТОпытРаботыКандидатов КАК ОпытРаботы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОпытРаботы.ЛичныеДанныеКандидата,
		|	ОпытРаботы.ДатаНачала";
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОпытРаботыКандидатов", ИмяВТ);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с данными об образовании кандидатов по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ОбразованиеКандидатовПоДаннымВТ
Функция ОбразованиеКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат ОбразованиеКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с данными об образовании кандидатов по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
//  ИмяВТ - Строка - Имя временной таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//    * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//    * Факультет - Строка
//    * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//    * ГодОкончания - Число
Функция ОбразованиеКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора,
	ИмяВТ = "ВТОбразованияКандидатов") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) = Неопределено Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяВТ,
			ИмяПоляОтбора);
		СоздатьВТОбразованиеКандидатов(ОписательВременныхТаблиц, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Образование.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образование.ВидОбразования КАК ВидОбразования,
		|	Образование.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Образование.Факультет КАК Факультет,
		|	Образование.Специальность КАК Специальность,
		|	Образование.ГодОкончания КАК ГодОкончания
		|ИЗ
		|	ВТОбразованияКандидатов КАК Образование
		|
		|УПОРЯДОЧИТЬ ПО
		|	Образование.ЛичныеДанныеКандидата,
		|	Образование.ГодОкончания";
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОбразованияКандидатов", ИмяВТ);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с данными об образовании кандидатов по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. КурсыКандидатовПоДаннымВТ
Функция КурсыКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат КурсыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с данными об образовании кандидатов по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
//  ИмяВТ - Строка - Имя временной таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * НаименованиеКурса - Строка
//    * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//    * ГодОкончания - Число
//    * ДополнительнаяИнформация - Строка
Функция КурсыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора, ИмяВТ = "ВТКурсыКандидатов") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) = Неопределено Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяВТ,
			ИмяПоляОтбора);
		СоздатьВТКурсыКандидатов(ОписательВременныхТаблиц, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Курсы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Курсы.НаименованиеКурса КАК НаименованиеКурса,
		|	Курсы.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Курсы.ГодОкончания КАК ГодОкончания,
		|	Курсы.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		|ИЗ
		|	ВТКурсыКандидатов КАК Курсы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Курсы.ЛичныеДанныеКандидата,
		|	Курсы.ГодОкончания";
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТКурсыКандидатов", ИмяВТ);
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с данными о знании языков кандидатов по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. КурсыКандидатовПоДаннымВТ
Функция ЗнаниеЯзыковКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат ЗнаниеЯзыковКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с данными о знании языков кандидатов по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
//  ИмяВТ - Строка - Имя временной таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * Язык - СправочникСсылка.ЯзыкиНародовМира
//    * СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыкаКандидата
Функция ЗнаниеЯзыковКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора,
	ИмяВТ = "ВТЗнаниеЯзыковКандидатов") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) = Неопределено Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяВТ,
			ИмяПоляОтбора);
		СоздатьВТЗнаниеЯзыковКандидатов(ОписательВременныхТаблиц, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЗнаниеЯзыков.Язык КАК Язык,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыка КАК СтепеньЗнанияЯзыка
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата";
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТЗнаниеЯзыковКандидатов", ИмяВТ);
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает таблицу значений с данными о дополнительной контактной информации кандидатов
// по массиву личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. ДополнительныеКонтактыКандидатовПоДаннымВТ
Функция ДополнительныеКонтактыКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц = Неопределено) Экспорт

	Если МенеджерВременныхТаблиц = Неопределено Тогда
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц);
	
	Возврат ДополнительныеКонтактыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, "ВТОтборы", "ЛичныеДанныеКандидата");
	
КонецФункции

// Возвращает таблицу значений с данными о дополнительной контактной информации кандидатов
// по данным из временной таблицы.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц с таблицей отборов кандидатов
//  ИмяТаблицыОтборов - Строка - Имя таблицы отборов
//  ИмяПоляОтбора - Строка - Имя поля отбора
//  ИмяВТ - Строка - Имя временной таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
//    * Язык - СправочникСсылка.ЯзыкиНародовМира
//    * СтепеньЗнанияЯзыка - СправочникСсылка.СтепениЗнанияЯзыкаКандидата
Функция ДополнительныеКонтактыКандидатовПоДаннымВТ(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяПоляОтбора,
	ИмяВТ = "ВТДополнительныеКонтактыКандидатов") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) = Неопределено Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяТаблицыОтборов, ИмяВТ,
			ИмяПоляОтбора);
		СоздатьВТДополнительныеКонтактыКандидатов(ОписательВременныхТаблиц, Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеКонтактыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ДополнительныеКонтактыКандидатов.Вид КАК Вид,
		|	ДополнительныеКонтактыКандидатов.Представление КАК Представление
		|ИЗ
		|	ВТДополнительныеКонтактыКандидатов КАК ДополнительныеКонтактыКандидатов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДополнительныеКонтактыКандидатов.ЛичныеДанныеКандидата";
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТДополнительныеКонтактыКандидатов", ИмяВТ);
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Возвращает пол кандидата.
// 
// Параметры:
//  Кандидат - СправочникСсылка.ЛичныеДанныеКандидатов, СправочникСсылка.Кандидаты -
// 
// Возвращаемое значение:
//  Неопределено, ПеречислениеСсылка.ПолФизическогоЛица - 
Функция ПолКандидата(Кандидат) Экспорт
	
	Если ТипЗнч(Кандидат) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "Пол");
	ИначеЕсли ТипЗнч(Кандидат) = Тип("СправочникСсылка.Кандидаты") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ЛичныеДанные.Пол");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// См. Справочники.Кандидаты.ИспользоватьКандидатов
Функция ИспользоватьКандидатов() Экспорт
	Возврат Справочники.Кандидаты.ИспользоватьКандидатов();
КонецФункции

// См. Справочники.Кандидаты.ФизическиеЛицаКандидатов
Функция ФизическиеЛицаКандидатов(Кандидаты, ТолькоНеПомеченныеНаУдаление) Экспорт
	Возврат Справочники.Кандидаты.ФизическиеЛицаКандидатов(Кандидаты, ТолькоНеПомеченныеНаУдаление);
КонецФункции

// См. Справочники.Кандидаты.ФизическоеЛицоКандидата
Функция ФизическоеЛицоКандидата(Кандидат, ТолькоНеПомеченныеНаУдаление, ПривилегированныйРежим) Экспорт
	Возврат Справочники.Кандидаты.ФизическоеЛицоКандидата(Кандидат, ТолькоНеПомеченныеНаУдаление, ПривилегированныйРежим);
КонецФункции

// Заполняет организацию физического лица по данным кандидата.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//  Организация - СправочникСсылка.Организации
Процедура ПриОпределенииОрганизацииФизическогоЛица(ФизическоеЛицо, Организация) Экспорт
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Кандидаты = КандидатыФизическихЛиц(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо));
	УстановитьПривилегированныйРежим(Ложь);
	Если Не ЗначениеЗаполнено(Кандидаты) Тогда
		Возврат;
	КонецЕсли;
	
	Кандидаты.Сортировать("ДатаРегистрации Убыв");
	Позиция = Кандидаты[0].Позиция;
	Если Не ЗначениеЗаполнено(Позиция) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Позиция);
	Организация = ДанныеПозиции.Организация;
	
КонецПроцедуры

// Настройки ленты событий с включением всех событий.
// 
// Возвращаемое значение:
//  Структура - настройки ленты событий:
// * СозданиеКандидата - Булево
// * РаботаСКандидатами - Булево
// * ЗагрузкаФайловПоКандидату - Булево
// * ДобавлениеИнформацииПоКандидату - Булево
// * ИзменениеИнформацииПоКандидату - Булево
// * Комментарии - Булево
// * Оценки - Булево
Функция НастройкиЛентыСобытийПоУмолчанию() Экспорт
	
	НастройкиЛентыСобытий = Новый Структура;
	НастройкиЛентыСобытий.Вставить("СозданиеКандидата", Истина);
	НастройкиЛентыСобытий.Вставить("РаботаСКандидатами", Истина);
	НастройкиЛентыСобытий.Вставить("ЗагрузкаФайловПоКандидату", Истина);
	НастройкиЛентыСобытий.Вставить("ДобавлениеИнформацииПоКандидату", Истина);
	НастройкиЛентыСобытий.Вставить("ИзменениеИнформацииПоКандидату", Истина);
	НастройкиЛентыСобытий.Вставить("Комментарии", Истина);
	НастройкиЛентыСобытий.Вставить("Оценки", Истина);
	
	Возврат НастройкиЛентыСобытий;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// АПК:581-выкл.
#Область ЗапросыПолученияДанныхКандидатов

// См. ОписательВременныхТаблиц
Функция ОписательВременныхТаблицДляСоздатьВТЛичныеДанныеКандидатов(МенеджерВременныхТаблиц,
	ИмяВременнойТаблицыОтборов = "ВТОтборы", ИмяСоздаваемойВТ = "ВТЛичныеДанныеКандидатов",
	ИмяПоляОтбора = "ЛичныеДанныеКандидата") Экспорт
	
	Возврат ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборов, ИмяСоздаваемойВТ,
		ИмяПоляОтбора);
	
КонецФункции

// См. ОписательВременныхТаблиц
Функция ОписательВременныхТаблицДляСоздатьВТОсновныеСведенияОКандидатах(МенеджерВременныхТаблиц,
	ИмяВременнойТаблицыОтборов = "ВТОтборы", ИмяСоздаваемойВТ = "ВТСведенияОКандидатах",
	ИмяПоляОтбора = "Кандидат") Экспорт
	
	Возврат ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборов, ИмяСоздаваемойВТ,
		ИмяПоляОтбора);
	
КонецФункции

// Возвращает структуру с параметрами для методов создания временных таблиц
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//	ИмяВременнойТаблицыОтборов - Строка - имя временной таблицы-"фильтра"
//	ИмяСоздаваемойВТ - Строка - имя создаваемой временной таблицы
//	ИмяПоляОтбора - Строка - имя поля таблицы отбора кандидатов
//
// Возвращаемое значение:
//	 Структура:
//	   * МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//	   * ИмяВременнойТаблицыОтборов - Строка - имя временной таблицы отборов кандидатов
//	   * ИмяСоздаваемойВТ - Строка - имя создаваемой временной таблицы
//	   * ИмяПоляОтбора - Строка - имя поля таблицы отбора кандидатов
Функция ОписательВременныхТаблиц(МенеджерВременныхТаблиц, ИмяВременнойТаблицыОтборов, ИмяСоздаваемойВТ, ИмяПоляОтбора) Экспорт
	
	ОписательВременныхТаблиц = Новый Структура;
	
	ОписательВременныхТаблиц.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	ОписательВременныхТаблиц.Вставить("ИмяВременнойТаблицыОтборов", ИмяВременнойТаблицыОтборов);
	ОписательВременныхТаблиц.Вставить("ИмяСоздаваемойВТ", ИмяСоздаваемойВТ);
	ОписательВременныхТаблиц.Вставить("ИмяПоляОтбора", ИмяПоляОтбора);
	
	Возврат ОписательВременныхТаблиц
	
КонецФункции

// Создает в менеджере временных таблиц временную таблицу для отбора кандидатов.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ИмяВТ - Строка - имя создаваемой таблицы
Процедура СоздатьВТОтборовКандидатов(Кандидаты, МенеджерВременныхТаблиц, ИмяВТ = "ВТОтборы") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Кандидаты.Ссылка КАК Кандидат
	|ПОМЕСТИТЬ ВТОтборы
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|ГДЕ
	|	Кандидаты.Ссылка В (&Кандидаты)";
	
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОтборы", ИмяВТ);
	Запрос.Выполнить();
	
КонецПроцедуры

// Создает в менеджере временных таблиц временную таблицу для отбора личных данных кандидатов.
// 
// Параметры:
//  ЛичныеДанныеКандидатов - Массив из СправочникСсылка.ЛичныеДанныеКандидатов
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ИмяВТ - Строка - имя создаваемой таблицы
Процедура СоздатьВТОтборовЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов, МенеджерВременныхТаблиц, ИмяВТ = "ВТОтборы") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
	|ПОМЕСТИТЬ ВТОтборы
	|ИЗ
	|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
	|ГДЕ
	|	ЛичныеДанныеКандидатов.Ссылка В (&ЛичныеДанныеКандидатов)";
	
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОтборы", ИмяВТ);
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует временную таблицу с личными данными кандидатов
//
// Параметры:
//   ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//   ТолькоРазрешенные - Булево
Процедура СоздатьВТЛичныеДанныеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросЛичныеДанныеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ЗапросЛичныеДанныеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	ОписательТаблицКонтактнойИнформации = ОписательВременныхТаблиц(ОписательВременныхТаблиц.МенеджерВременныхТаблиц,
		ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов, "ВТКонтактнаяИнформация",
		ОписательВременныхТаблиц.ИмяПоляОтбора);
	ИтоговыйЗапрос = ЗапросКонтактнаяИнформацияКандидатов(ОписательТаблицКонтактнойИнформации,
		ТолькоРазрешенные);
	
	ОписательТаблицЗнаниеЯзыков = ОписательВременныхТаблиц(ОписательВременныхТаблиц.МенеджерВременныхТаблиц,
		ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов, "ВТЗнаниеЯзыковКандидатов",
		ОписательВременныхТаблиц.ИмяПоляОтбора);
	ЗапросЗнаниеЯзыков = ЗапросВТЗнаниеЯзыковКандидатов(ОписательТаблицЗнаниеЯзыков, ТолькоРазрешенные);
	
	ОписательТаблицОбразование = ОписательВременныхТаблиц(ОписательВременныхТаблиц.МенеджерВременныхТаблиц,
		ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов, "ВТОбразованияКандидатов",
		ОписательВременныхТаблиц.ИмяПоляОтбора);
	ЗапросОбразование = ЗапросВТОбразованиеКандидатов(ОписательТаблицОбразование, ТолькоРазрешенные);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата,
	|	ЛичныеДанныеКандидатов.Наименование КАК Наименование,
	|	ЛичныеДанныеКандидатов.ФИО КАК ФИО,
	|	ЛичныеДанныеКандидатов.Фамилия КАК Фамилия,
	|	ЛичныеДанныеКандидатов.Имя КАК Имя,
	|	ЛичныеДанныеКандидатов.Отчество КАК Отчество,
	|	ЛичныеДанныеКандидатов.УточнениеНаименования КАК УточнениеНаименования,
	|	ЛичныеДанныеКандидатов.Пол КАК Пол,
	|	ЛичныеДанныеКандидатов.ДатаРождения КАК ДатаРождения,
	|	ЛичныеДанныеКандидатов.МестоРождения КАК МестоРождения,
	|	ЛичныеДанныеКандидатов.СостояниеВБраке КАК СостояниеВБраке,
	|	ЛичныеДанныеКандидатов.Гражданство КАК Гражданство,
	|	ВЫБОР
	|		КОГДА ЛичныеДанныеКандидатов.ДатаРождения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА ЛичныеДанныеКандидатов.ДатаРождения >= &ТекущаяДата
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЛичныеДанныеКандидатов.ДатаРождения, &ТекущаяДата, ГОД) + ВЫБОР
	|			КОГДА МЕСЯЦ(ЛичныеДанныеКандидатов.ДатаРождения) > МЕСЯЦ(&ТекущаяДата)
	|				ТОГДА -1
	|			КОГДА МЕСЯЦ(ЛичныеДанныеКандидатов.ДатаРождения) = МЕСЯЦ(&ТекущаяДата)
	|			И ДЕНЬ(ЛичныеДанныеКандидатов.ДатаРождения) > ДЕНЬ(&ТекущаяДата)
	|				ТОГДА -1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КОНЕЦ КАК Возраст,
	|	ЕСТЬNULL(EMailКандидата.Представление, """") КАК EMailПредставление,
	|	ЕСТЬNULL(АДРЕСКандидата.Представление, """") КАК АдресПредставление,
	|	ЕСТЬNULL(ТЕЛЕФОНКандидата.Представление, """") КАК ТелефонПредставление,
	|	ЕСТЬNULL(ФизическиеЛицаКандидатов.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК
	|		ФизическоеЛицо,
	|	ЕСТЬNULL(ЗнаниеЯзыкаКандидатов.Язык, ЗНАЧЕНИЕ(Справочник.ЯзыкиНародовМира.ПустаяСсылка)) КАК Язык,
	|	ЕСТЬNULL(ОбразованиеКандидатов.ВидОбразования, ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК
	|		ВидОбразования,
	|	ЕСТЬNULL(ОбразованиеКандидатов.УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		УчебноеЗаведение,
	|	ЕСТЬNULL(ОбразованиеКандидатов.Факультет, """") КАК Факультет,
	|	ЕСТЬNULL(ОбразованиеКандидатов.Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Специальность,
	|	ЕСТЬNULL(ОбразованиеКандидатов.ГодОкончания, 0) КАК ГодОкончания,
	|	ЕСТЬNULL(ОбразованиеПервое.Образование1ВидОбразования,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК Образование1ВидОбразования,
	|	ЕСТЬNULL(ОбразованиеПервое.Образование1УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		Образование1УчебноеЗаведение,
	|	ЕСТЬNULL(ОбразованиеПервое.Образование1Факультет, """") КАК Образование1Факультет,
	|	ЕСТЬNULL(ОбразованиеПервое.Образование1Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Образование1Специальность,
	|	ЕСТЬNULL(ОбразованиеПервое.Образование1ГодОкончания, 0) КАК Образование1ГодОкончания,
	|	ЕСТЬNULL(ОбразованиеВторое.Образование2ВидОбразования,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК Образование2ВидОбразования,
	|	ЕСТЬNULL(ОбразованиеВторое.Образование2УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		Образование2УчебноеЗаведение,
	|	ЕСТЬNULL(ОбразованиеВторое.Образование2Факультет, """") КАК Образование2Факультет,
	|	ЕСТЬNULL(ОбразованиеВторое.Образование2Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Образование2Специальность,
	|	ЕСТЬNULL(ОбразованиеВторое.Образование2ГодОкончания, 0) КАК Образование2ГодОкончания
	|ПОМЕСТИТЬ ВТЛичныеДанныеКандидатов
	|ИЗ
	|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтактнаяИнформация КАК EMailКандидата
	|		ПО ЛичныеДанныеКандидатов.Ссылка = EMailКандидата.ЛичныеДанныеКандидата
	|		И EMailКандидата.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтактнаяИнформация КАК АДРЕСКандидата
	|		ПО ЛичныеДанныеКандидатов.Ссылка = АДРЕСКандидата.ЛичныеДанныеКандидата
	|		И АДРЕСКандидата.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтактнаяИнформация КАК ТЕЛЕФОНКандидата
	|		ПО ЛичныеДанныеКандидатов.Ссылка = ТЕЛЕФОНКандидата.ЛичныеДанныеКандидата
	|		И ТЕЛЕФОНКандидата.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
	|		ПО ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗнаниеЯзыкаКандидатов КАК ЗнаниеЯзыкаКандидатов
	|		ПО ЗнаниеЯзыкаКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбразованиеКандидатовМаксимум КАК ОбразованиеКандидатов
	|		ПО ОбразованиеКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбразованиеПервое КАК ОбразованиеПервое
	|		ПО ОбразованиеПервое.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбразованиеВторое КАК ОбразованиеВторое
	|		ПО ОбразованиеВторое.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Ссылка
	|ГДЕ
	|	ИСТИНА В
	|		(ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			ВТОтборы КАК ТаблицаОтборов
	|		ГДЕ
	|			ЛичныеДанныеКандидатов.Ссылка = ТаблицаОтборов.ЛичныеДанныеКандидата)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТЛичныеДанныеКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ИтоговыйЗапрос, ЗапросЗнаниеЯзыков);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ИтоговыйЗапрос, ЗапросОбразование);
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьЗапросы(ИтоговыйЗапрос, Запрос);

	ТаблицыКУничтожению = Новый Массив;
	ТаблицыКУничтожению.Добавить("ВТКонтактнаяИнформация");
	ТаблицыКУничтожению.Добавить("ВТЗнаниеЯзыковКандидатов");
	ТаблицыКУничтожению.Добавить("ВТЗнаниеЯзыкаКандидатов");
	ТаблицыКУничтожению.Добавить("ВТСтепеньЗнанияЯзыкаКандидатов");
	ТаблицыКУничтожению.Добавить("ВТСтепеньЗнанияЯзыкаКандидатов1");
	ТаблицыКУничтожению.Добавить("ВТСтепеньЗнанияЯзыкаКандидатов2");
	ТаблицыКУничтожению.Добавить("ВТОбразованиеКандидатовМаксимум");
	ТаблицыКУничтожению.Добавить("ВТОбразование1ПриоритетКодаВидаОбразования");
	ТаблицыКУничтожению.Добавить("ВТОбразованиеПервое");
	ТаблицыКУничтожению.Добавить("ВТОбразование2ПриоритетКодаВидаОбразования");
	ТаблицыКУничтожению.Добавить("ВТОбразованиеВторое");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросыУничтоженияВременныхТаблиц(ИтоговыйЗапрос.Текст, ТаблицыКУничтожению);
	
	Возврат ИтоговыйЗапрос;
	
КонецФункции

// АПК:299-выкл

// Формирует временную таблицу с контактной информацией кандидатов
//
// Параметры:
//   ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//   ТолькоРазрешенные - Булево
Процедура СоздатьВТКонтактнаяИнформацияКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросКонтактнаяИнформацияКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// АПК:299-вкл

Функция ЗапросКонтактнаяИнформацияКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Ссылка КАК ЛичныеДанныеКандидата,
	|	КонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
	|	КонтактнаяИнформация.Тип КАК Тип,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Страна КАК Страна,
	|	КонтактнаяИнформация.Регион КАК Регион,
	|	КонтактнаяИнформация.Город КАК Город,
	|	КонтактнаяИнформация.Представление КАК Представление,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(КонтактнаяИнформация.Значение КАК СТРОКА(1))) = """"
	|			ТОГДА ВЫРАЗИТЬ(КонтактнаяИнформация.ЗначенияПолей  КАК СТРОКА(1000))
	|		ИНАЧЕ ВЫРАЗИТЬ(КонтактнаяИнформация.Значение КАК СТРОКА(1000))
	|	КОНЕЦ КАК ЗначенияПолей
	|ПОМЕСТИТЬ ВТВсяКонтактнаяИнформация
	|ИЗ
	|	Справочник.ЛичныеДанныеКандидатов.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборы КАК ТаблицаОтборов
	|		ПО КонтактнаяИнформация.Ссылка = ТаблицаОтборов.ЛичныеДанныеКандидата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсяКонтактнаяИнформация.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
	|	ВсяКонтактнаяИнформация.Вид КАК Вид,
	|	МИНИМУМ(ВсяКонтактнаяИнформация.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТПервыеЗначенияПоВидуКонтактнойИнформации
	|ИЗ
	|	ВТВсяКонтактнаяИнформация КАК ВсяКонтактнаяИнформация
	|СГРУППИРОВАТЬ ПО
	|	ВсяКонтактнаяИнформация.ЛичныеДанныеКандидата,
	|	ВсяКонтактнаяИнформация.Вид
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсяКонтактнаяИнформация.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
	|	ВсяКонтактнаяИнформация.Тип КАК Тип,
	|	ВсяКонтактнаяИнформация.Вид КАК Вид,
	|	ВсяКонтактнаяИнформация.Страна КАК Страна,
	|	ВсяКонтактнаяИнформация.Регион КАК Регион,
	|	ВсяКонтактнаяИнформация.Город КАК Город,
	|	ВсяКонтактнаяИнформация.Представление КАК Представление,
	|	ВсяКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
	|ПОМЕСТИТЬ ВТКонтактнаяИнформация
	|ИЗ
	|	ВТВсяКонтактнаяИнформация КАК ВсяКонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПервыеЗначенияПоВидуКонтактнойИнформации КАК ПервыеЗначенияПоВидуКонтактнойИнформации
	|		ПО ВсяКонтактнаяИнформация.ЛичныеДанныеКандидата = ПервыеЗначенияПоВидуКонтактнойИнформации.ЛичныеДанныеКандидата
	|		И ВсяКонтактнаяИнформация.Вид = ПервыеЗначенияПоВидуКонтактнойИнформации.Вид
	|		И ВсяКонтактнаяИнформация.НомерСтроки = ПервыеЗначенияПоВидуКонтактнойИнформации.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВсяКонтактнаяИнформация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПервыеЗначенияПоВидуКонтактнойИнформации";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
		
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТКонтактнаяИнформация",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу сведений о кандидатах.
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТОсновныеСведенияОКандидатах(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт

	Запрос = ЗапросОсновныеСведенияОКандидатах(ОписательВременныхТаблиц, ТолькоРазрешенные);
	
	Запрос.Выполнить();
	
	УдалитьВТ = Новый Массив;
	УдалитьВТ.Добавить("ВТКандидаты");
	УдалитьВТ.Добавить("ВТОткликиКандидатов");
	
	ЗарплатаКадры.УничтожитьВТ(ОписательВременныхТаблиц.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

Функция ЗапросОсновныеСведенияОКандидатах(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;

	ТекстЗапросаВТКандидаты =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кандидаты.Ссылка КАК Кандидат,
	|	Кандидаты.Код КАК Код,
	|	Кандидаты.Наименование КАК Наименование,
	|	Кандидаты.ПометкаУдаления КАК ПометкаУдаления,
	|	Кандидаты.Вакансия КАК Вакансия,
	|	Кандидаты.Позиция КАК Позиция,
	|	Кандидаты.Подразделение КАК Подразделение,
	|	Кандидаты.ЛичныеДанные КАК ЛичныеДанныеКандидата,
	|	Кандидаты.ОжидаемыйДоход КАК ОжидаемыйДоход,
	|	Кандидаты.ВалютаДохода КАК ВалютаДохода,
	|	Кандидаты.ПериодичностьДохода КАК ПериодичностьДохода,
	|	Кандидаты.ИсточникИнформации КАК ИсточникИнформации,
	|	Кандидаты.АдресРезюме КАК АдресРезюме,
	|	Кандидаты.ОСебе КАК ОСебе,
	|	Кандидаты.Ответственный КАК Ответственный,
	|	Кандидаты.Ответственный.ФизическоеЛицо КАК ОтветственныйФизическоеЛицо,
	|	Кандидаты.ПричинаОтклонения КАК ПричинаОтклонения,
	|	Кандидаты.СреднийРейтинг КАК СреднийРейтинг,
	|	ЕСТЬNULL(Вакансии.ПрофильДолжности, ЗНАЧЕНИЕ(Справочник.ПрофилиДолжностей.ПустаяСсылка)) КАК ПрофильДолжности,
	|	Кандидаты.Состояние КАК Состояние,
	|	Кандидаты.ДатаРегистрации КАК ДатаРегистрации,
	|	Кандидаты.Рейтинг КАК Рейтинг,
	|	Кандидаты.ДатаРешения КАК ДатаРешения,
	|	Кандидаты.КомментарийРешения КАК КомментарийРешения
	|ПОМЕСТИТЬ ВТКандидаты
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборы КАК ТаблицаОтборов
	|		ПО Кандидаты.Ссылка = ТаблицаОтборов.Кандидат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вакансии КАК Вакансии
	|		ПО Кандидаты.Вакансия = Вакансии.Ссылка";
	
	ТекстЗапросаВТКандидаты = СтрЗаменить(ТекстЗапросаВТКандидаты, "ВТОтборы",
		ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	ТекстЗапросаВТКандидаты = СтрЗаменить(ТекстЗапросаВТКандидаты, "ТаблицаОтборов.Кандидат",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	
	ОписательВТЛичныеДанныеКандидатов = ОписательВременныхТаблицДляСоздатьВТЛичныеДанныеКандидатов(
		ОписательВременныхТаблиц.МенеджерВременныхТаблиц, "ВТКандидаты");
	ЗапросЛичныеДанные = ЗапросЛичныеДанныеКандидатов(ОписательВТЛичныеДанныеКандидатов, ТолькоРазрешенные);
	
	ТекстЗапросаВТСведенияОКандидатах = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кандидаты.Кандидат КАК Кандидат,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА НЕ ОткликиКандидатовНаВакансию.Вакансия ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ОткликиКандидатовНаВакансию.СопроводительноеПисьмо КАК СТРОКА(1000))
	|		КОГДА НЕ ОткликиКандидатов.Вакансия ЕСТЬ NULL
	|			ТОГДА ВЫРАЗИТЬ(ОткликиКандидатов.СопроводительноеПисьмо КАК СТРОКА(1000))
	|		ИНАЧЕ """"
	|	КОНЕЦ) КАК Письмо
	|ПОМЕСТИТЬ ВТОткликиКандидатов
	|ИЗ
	|	ВТКандидаты КАК Кандидаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК ОткликиКандидатов
	|		ПО Кандидаты.ИсточникИнформации = ОткликиКандидатов.ИсточникИнформации
	|		И Кандидаты.Кандидат = ОткликиКандидатов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК ОткликиКандидатовНаВакансию
	|		ПО Кандидаты.ИсточникИнформации = ОткликиКандидатовНаВакансию.ИсточникИнформации
	|		И Кандидаты.Вакансия = ОткликиКандидатовНаВакансию.Вакансия
	|		И Кандидаты.Кандидат = ОткликиКандидатовНаВакансию.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Кандидаты.Кандидат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кандидаты.Кандидат КАК Кандидат,
	|	Кандидаты.Код КАК Код,
	|	Кандидаты.Наименование КАК Наименование,
	|	Кандидаты.ПометкаУдаления КАК ПометкаУдаления,
	|	Кандидаты.Вакансия КАК Вакансия,
	|	Кандидаты.Позиция КАК Позиция,
	|	Кандидаты.Подразделение КАК Подразделение,
	|	Кандидаты.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
	|	Кандидаты.ОжидаемыйДоход КАК ОжидаемыйДоход,
	|	Кандидаты.ВалютаДохода КАК ВалютаДохода,
	|	Кандидаты.ПериодичностьДохода КАК ПериодичностьДохода,
	|	Кандидаты.ИсточникИнформации КАК ИсточникИнформации,
	|	Кандидаты.АдресРезюме КАК АдресРезюме,
	|	Кандидаты.ОСебе КАК ОСебе,
	|	Кандидаты.Ответственный КАК Ответственный,
	|	Кандидаты.ОтветственныйФизическоеЛицо КАК ОтветственныйФизическоеЛицо,
	|	Кандидаты.ПричинаОтклонения КАК ПричинаОтклонения,
	|	Кандидаты.СреднийРейтинг КАК СреднийРейтинг,
	|	Кандидаты.ПрофильДолжности КАК ПрофильДолжности,
	|	Кандидаты.Состояние КАК Состояние,
	|	Кандидаты.ДатаРегистрации КАК ДатаРегистрации,
	|	Кандидаты.Рейтинг КАК Рейтинг,
	|	Кандидаты.ДатаРешения КАК ДатаРешения,
	|	Кандидаты.КомментарийРешения КАК КомментарийРешения,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ФИО, """") КАК ФИО,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Имя, """") КАК Имя,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Отчество, """") КАК Отчество,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.УточнениеНаименования, """") КАК УточнениеНаименования,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Пол, ЗНАЧЕНИЕ(Перечисление.ПолФизическогоЛица.ПустаяСсылка)) КАК Пол,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРождения,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.МестоРождения, """") КАК МестоРождения,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.СостояниеВБраке, ЗНАЧЕНИЕ(Справочник.СостояниеВБраке.ПустаяСсылка)) КАК
	|		СостояниеВБраке,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Гражданство, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК Гражданство,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.EMailПредставление, """") КАК EMail,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.АдресПредставление, """") КАК Адрес,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ТелефонПредставление, """") КАК Телефон,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Возраст, 0) КАК Возраст,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Язык, ЗНАЧЕНИЕ(Справочник.ЯзыкиНародовМира.ПустаяСсылка)) КАК Язык,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ВидОбразования, ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК
	|		ВидОбразования,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		УчебноеЗаведение,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Факультет, """") КАК Факультет,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Специальность,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.ГодОкончания, 0) КАК ГодОкончания,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование1ВидОбразования,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК Образование1ВидОбразования,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование1УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		Образование1УчебноеЗаведение,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование1Факультет, """") КАК Образование1Факультет,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование1Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Образование1Специальность,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование1ГодОкончания, 0) КАК Образование1ГодОкончания,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование2ВидОбразования,
	|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка)) КАК Образование2ВидОбразования,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование2УчебноеЗаведение, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) КАК
	|		Образование2УчебноеЗаведение,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование2Факультет, """") КАК Образование2Факультет,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование2Специальность,
	|		ЗНАЧЕНИЕ(Справочник.КлассификаторСпециальностейПоОбразованию.ПустаяСсылка)) КАК Образование2Специальность,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатов.Образование2ГодОкончания, 0) КАК Образование2ГодОкончания,
	|	ЕСТЬNULL(ОткликиКандидатов.Письмо, """") КАК Письмо,
	|	ЕСТЬNULL(ТекущиеЭтапы.ЭтапРаботы, ЗНАЧЕНИЕ(Справочник.ЭтапыРаботыСКандидатами.ПустаяСсылка)) КАК ТекущийЭтап,
	|	ЕСТЬNULL(ТекущиеЭтапы.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.ПустаяСсылка)) КАК
	|		СостояниеЭтапа,
	|	ЕСТЬNULL(ТекущиеЭтапы.ДатаВремя, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВремяЭтапа,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатовФото.Фотография, НЕОПРЕДЕЛЕНО) КАК ФотографияСсылка,
	|	ЕСТЬNULL(ЛичныеДанныеКандидатовФото.Фотография.ФайлХранилище, НЕОПРЕДЕЛЕНО) КАК ХранилищеФотографии
	|ПОМЕСТИТЬ ВТСведенияОКандидатах
	|ИЗ
	|	ВТКандидаты КАК Кандидаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
	|		ПО Кандидаты.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОткликиКандидатов КАК ОткликиКандидатов
	|		ПО Кандидаты.Кандидат = ОткликиКандидатов.Кандидат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапы
	|		ПО (ТекущиеЭтапы.Кандидат = Кандидаты.Кандидат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатовФото
	|		ПО Кандидаты.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатовФото.Ссылка";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапросаВТСведенияОКандидатах,
		"ВТСведенияОКандидатах", ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(ТекстЗапросаВТСведенияОКандидатах,
		ТолькоРазрешенные);
	
	Запрос.Текст = ЗарплатаКадрыОбщиеНаборыДанных.ТекстОбъединенногоЗапроса(ТекстЗапросаВТКандидаты,
		ЗапросЛичныеДанные.Текст, ТекстЗапросаВТСведенияОКандидатах);
	
	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросЛичныеДанные);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу с данными об опыте работы кандидатов в ОписательВременныхТаблиц.МенеджерВременныхТаблиц
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТОпытРаботыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросВТОпытРаботыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
// 
// Возвращаемое значение:
//  Запрос
Функция ЗапросВТОпытРаботыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОпытРаботы.Компания КАК Компания,
		|	ОпытРаботы.ДатаНачала КАК ДатаНачала,
		|	ОпытРаботы.ДатаОкончания КАК ДатаОкончания,
		|	ОпытРаботы.Должность КАК Должность,
		|	ОпытРаботы.Обязанности КАК Обязанности,
		|	ОпытРаботы.СфераДеятельностиКомпании КАК СфераДеятельностиКомпании
		|ПОМЕСТИТЬ ВТОпытРаботыКандидатов
		|ИЗ
		|	ВТОтборы КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.ОпытРаботы КАК ОпытРаботы
		|		ПО ТаблицаОтборов.ЛичныеДанныеКандидата = ОпытРаботы.Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОпытРаботыКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу с данными об образовании кандидатов в ОписательВременныхТаблиц.МенеджерВременныхТаблиц
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТОбразованиеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросВТОбразованиеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
// 
// Возвращаемое значение:
//  Запрос
Функция ЗапросВТОбразованиеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	
	ВТКУничтожению = Новый Массив;
	ВТКУничтожению.Добавить("ВТОбразованияКандидатовПервые");
	ВТКУничтожению.Добавить("ВТОбразование1ПриоритетВидаОбразования");
	ВТКУничтожению.Добавить("ВТОбразование1ПриоритетГОдаОкончания");
	ВТКУничтожению.Добавить("ВТОбразование1ПриоритетНомераСтроки");
	
	ВТКУничтожению.Добавить("ВТОбразованияКандидатовВторые");
	ВТКУничтожению.Добавить("ВТОбразование2ПриоритетВидаОбразования");
	ВТКУничтожению.Добавить("ВТОбразование2ПриоритетГОдаОкончания");
	ВТКУничтожению.Добавить("ВТОбразование2ПриоритетНомераСтроки");
	
	ЗапросВажностиОбразований = Новый Массив;
	
	ПервыйЗапрос = Истина;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц") Тогда
		МодульОбразованияФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ОбразованияФизическихЛиц");
		ВидыОбразованийПоВажности = МодульОбразованияФизическихЛиц.ВидыОбразованийПоВажности();
	Иначе
		ВидыОбразованийПоВажности = Новый Массив;
	КонецЕсли;
	
	Для Индекс = 0 По ВидыОбразованийПоВажности.Количество() - 1 Цикл
		ИндексСтрокой = Формат(Индекс, "ЧГ=; ЧН=");
		Если Не ПервыйЗапрос Тогда
			ЗапросВажностиОбразований.Добавить("ОБЪЕДИНИТЬ");
		КонецЕсли;
		ЗапросВажностиОбразований.Добавить("ВЫБРАТЬ
			|	" + ИндексСтрокой + " КАК Важность,
			|	&ПараметрВТОбразованияФизическихЛиц" + ИндексСтрокой + " КАК ВидОбразования");
		Запрос.УстановитьПараметр("ПараметрВТОбразованияФизическихЛиц" + ИндексСтрокой, ВидыОбразованийПоВажности[Индекс]);
		Если ПервыйЗапрос Тогда
			ЗапросВажностиОбразований.Добавить("ПОМЕСТИТЬ ВТВидыОбразованийПоВажности");
		КонецЕсли;
		ПервыйЗапрос = Ложь;
	КонецЦикла;
	
	ВТКУничтожению.Добавить("ВТВидыОбразованийПоВажности");
	
	Запрос.Текст = ТекстЗапросаОбразованиеКандидатов(ЗапросВажностиОбразований);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОбразованияКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ВТОбразованияКандидатов КАК",
		СтрШаблон("	%1 КАК", ОписательВременныхТаблиц.ИмяСоздаваемойВТ));
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросыУничтоженияВременныхТаблиц(Запрос.Текст, ВТКУничтожению);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу с данными о курсах кандидатов в ОписательВременныхТаблиц.МенеджерВременныхТаблиц
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТКурсыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросВТКурсыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
// 
// Возвращаемое значение:
//  Запрос
Функция ЗапросВТКурсыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Курсы.НаименованиеКурса КАК НаименованиеКурса,
		|	Курсы.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Курсы.ГодОкончания КАК ГодОкончания,
		|	Курсы.ДополнительнаяИнформация КАК ДополнительнаяИнформация
		|ПОМЕСТИТЬ ВТКурсыКандидатов
		|ИЗ
		|	ВТОтборы КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.Курсы КАК Курсы
		|		ПО ТаблицаОтборов.ЛичныеДанныеКандидата = Курсы.Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТКурсыКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу с данными о знании языков кандидатов в ОписательВременныхТаблиц.МенеджерВременныхТаблиц
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТЗнаниеЯзыковКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросВТЗнаниеЯзыковКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
// 
// Возвращаемое значение:
//  Запрос
Функция ЗапросВТЗнаниеЯзыковКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЗнаниеЯзыков.Язык КАК Язык,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата КАК СтепеньЗнанияЯзыка
		|ПОМЕСТИТЬ ВТЗнаниеЯзыковКандидатов
		|ИЗ
		|	ВТОтборы КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.ЗнаниеЯзыков КАК ЗнаниеЯзыков
		|		ПО ТаблицаОтборов.ЛичныеДанныеКандидата = ЗнаниеЯзыков.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.Язык) КАК Язык
		|ПОМЕСТИТЬ ВТЗнаниеЯзыкаКандидатов
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.СтепеньЗнанияЯзыка) КАК СтепеньЗнания
		|ПОМЕСТИТЬ ВТСтепеньЗнанияЯзыкаКандидатов
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.СтепеньЗнанияЯзыка.Наименование) КАК СтепеньЗнанияЯзыкаНаименование
		|ПОМЕСТИТЬ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов1
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.Язык) КАК Язык,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыка КАК СтепеньЗнанияЯзыка
		|ПОМЕСТИТЬ ВТСтепеньЗнанияЯзыкаКандидатов1
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов1 КАК НаименованиеСтепениЗнанияЯзыка1
		|		ПО ЗнаниеЯзыков.ЛичныеДанныеКандидата = НаименованиеСтепениЗнанияЯзыка1.ЛичныеДанныеКандидата
		|		И ЗнаниеЯзыков.СтепеньЗнанияЯзыка.Наименование = НаименованиеСтепениЗнанияЯзыка1.СтепеньЗнанияЯзыкаНаименование
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.СтепеньЗнанияЯзыка.Наименование) КАК СтепеньЗнанияЯзыкаНаименование
		|ПОМЕСТИТЬ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов2
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтепеньЗнанияЯзыкаКандидатов1 КАК СтепеньЗнанияЯзыка1
		|		ПО ЗнаниеЯзыков.ЛичныеДанныеКандидата = СтепеньЗнанияЯзыка1.ЛичныеДанныеКандидата
		|		И ЗнаниеЯзыков.Язык = СтепеньЗнанияЯзыка1.Язык
		|		И ЗнаниеЯзыков.СтепеньЗнанияЯзыка = СтепеньЗнанияЯзыка1.СтепеньЗнанияЯзыка
		|ГДЕ
		|	СтепеньЗнанияЯзыка1.Язык ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ЗнаниеЯзыков.Язык) КАК Язык,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыка КАК СтепеньЗнанияЯзыка
		|ПОМЕСТИТЬ ВТСтепеньЗнанияЯзыкаКандидатов2
		|ИЗ
		|	ВТЗнаниеЯзыковКандидатов КАК ЗнаниеЯзыков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов2 КАК НаименованиеСтепениЗнанияЯзыка2
		|		ПО ЗнаниеЯзыков.ЛичныеДанныеКандидата = НаименованиеСтепениЗнанияЯзыка2.ЛичныеДанныеКандидата
		|		И ЗнаниеЯзыков.СтепеньЗнанияЯзыка.Наименование = НаименованиеСтепениЗнанияЯзыка2.СтепеньЗнанияЯзыкаНаименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтепеньЗнанияЯзыкаКандидатов1 КАК СтепеньЗнанияЯзыка1
		|		ПО ЗнаниеЯзыков.ЛичныеДанныеКандидата = СтепеньЗнанияЯзыка1.ЛичныеДанныеКандидата
		|		И ЗнаниеЯзыков.Язык = СтепеньЗнанияЯзыка1.Язык
		|ГДЕ
		|	СтепеньЗнанияЯзыка1.Язык ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	ЗнаниеЯзыков.ЛичныеДанныеКандидата,
		|	ЗнаниеЯзыков.СтепеньЗнанияЯзыка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТНаименованиеСтепениЗнанияЯзыкаКандидатов2";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТЗнаниеЯзыковКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "	ВТЗнаниеЯзыковКандидатов КАК",
		СтрШаблон("	%1 КАК", ОписательВременныхТаблиц.ИмяСоздаваемойВТ));
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос;
	
КонецФункции

// Создает временную таблицу с данными о дополнительной контактной информации кандидатов
// в ОписательВременныхТаблиц.МенеджерВременныхТаблиц
// 
// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
Процедура СоздатьВТДополнительныеКонтактыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗапросВТДополнительныеКонтактыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	Запрос.Выполнить();
	
КонецПроцедуры

// Параметры:
//  ОписательВременныхТаблиц - см. ОписательВременныхТаблиц
//  ТолькоРазрешенные - Булево
// 
// Возвращаемое значение:
//  Запрос
Функция ЗапросВТДополнительныеКонтактыКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ПОМЕСТИТЬ ВТДополнительныеКонтактыКандидатов
		|ИЗ
		|	ВТОтборы КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО ТаблицаОтборов.ЛичныеДанныеКандидата = КонтактнаяИнформация.Ссылка
		|ГДЕ
		|	НЕ КонтактнаяИнформация.Вид.Предопределенный";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТОтборы", ОписательВременныхТаблиц.ИмяВременнойТаблицыОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаОтборов.ЛичныеДанныеКандидата",
		"ТаблицаОтборов." + ОписательВременныхТаблиц.ИмяПоляОтбора);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТДополнительныеКонтактыКандидатов",
		ОписательВременныхТаблиц.ИмяСоздаваемойВТ);
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
// АПК:581-вкл.

#Область КонтактнаяИнформация

// См. УправлениеКонтактнойИнформациейПереопределяемый.ПриНачальномЗаполненииЭлементов.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	РеквизитыГруппы = Новый Структура("ЭтоГруппа, Используется", Истина, Истина);
	ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "СправочникЛичныеДанныеКандидатов",
		"ru = 'Контактная информация справочника ""Личные данные кандидатов""'", РеквизитыГруппы);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Используется", Истина);
	Реквизиты.Вставить("Родитель", Справочники.ВидыКонтактнойИнформации.СправочникЛичныеДанныеКандидатов);
	
	Элемент = ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "ТелефонЛичныеДанныеКандидатов",
		"ru = 'Телефон'", Реквизиты);
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.МожноИзменятьСпособРедактирования = Истина;
	Элемент.ОбязательноеЗаполнение = Ложь;
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.РазрешитьВводНесколькихЗначений = Ложь;
	Элемент.ЗапретитьРедактированиеПользователем = Истина;
	
	Элемент = ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "EMailЛичныеДанныеКандидатов",
		"ru = 'Email'", Реквизиты);
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Элемент.ПроверятьКорректность = Истина;
	Элемент.ОбязательноеЗаполнение = Ложь;
	Элемент.ЗапретитьРедактированиеПользователем = Истина;
	
	Элемент = ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "АдресЛичныеДанныеКандидатов",
		"ru = 'Адрес места проживания'", Реквизиты);
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
	Элемент.МожноИзменятьСпособРедактирования = Ложь;
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОбязательноеЗаполнение = Ложь;
	Элемент.ТолькоНациональныйАдрес = Истина;
	Элемент.ПроверятьКорректность = Ложь;
	Элемент.СкрыватьНеактуальныеАдреса = Ложь;
	Элемент.ВключатьСтрануВПредставление = Истина;
	Элемент.ЗапретитьРедактированиеПользователем = Истина;
	
	Элемент = ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "TelegramЛичныеДанныеКандидатов",
		"ru = 'Telegram'", Реквизиты);
	Элемент.ИмяПредопределенногоВида = Элемент.ИмяПредопределенныхДанных;
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	Элемент.МожноИзменятьСпособРедактирования = Ложь;
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОбязательноеЗаполнение = Ложь;
	Элемент.РазрешитьВводНесколькихЗначений = Истина;
	Элемент.ЗапретитьРедактированиеПользователем = Истина;
	Элемент.ВидПоляДругое = "ОднострочноеУзкое";
	
	Элемент = ОбновлениеБЗК.ОписаниеПредопределенного(КодыЯзыков, Элементы, "MAXЛичныеДанныеКандидатов",
		"ru = 'MAX'", Реквизиты);
	Элемент.ИмяПредопределенногоВида = Элемент.ИмяПредопределенныхДанных;
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	Элемент.МожноИзменятьСпособРедактирования = Ложь;
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОбязательноеЗаполнение = Ложь;
	Элемент.РазрешитьВводНесколькихЗначений = Ложь;
	Элемент.ЗапретитьРедактированиеПользователем = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольВеденияУчета

// См. КонтрольВеденияУчетаПереопределяемый.ПриОпределенииПроверок.
Процедура ОпределитьПроверкиВеденияУчета(ГруппыПроверок, Проверки) Экспорт
	
	ГруппаПроверок = ГруппыПроверок.Добавить();
	ГруппаПроверок.Наименование					= НСтр("ru = 'Подбор персонала'");
	ГруппаПроверок.Идентификатор				= 
		ПодборПерсоналаПроверки.ИдентификаторГруппыПроверокКонтрольПодбораПерсонала();
	ГруппаПроверок.КонтекстПроверокВеденияУчета	= ГруппаПроверок.Идентификатор;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы			= ГруппаПроверок.Идентификатор;
	Проверка.Наименование					= НСтр("ru = 'Наличие кандидатов, задержавшихся на одном этапе'");
	Проверка.Причины						= НСтр("ru = 'Кандидат долгое время находится на одном этапе'");
	Проверка.Рекомендация					= НСтр("ru = 'Продолжить работу с кандидатом или отклонить его (если работа завершена)'");
	Проверка.Идентификатор					= ГруппаПроверок.Идентификатор + ".ПроверкаНаличияЗадержавшихсяКандидатов";
	Проверка.ОбработчикПроверки				= "ПодборПерсоналаПроверки.ПроверкаНаличияЗадержавшихсяКандидатов";
	Проверка.КонтекстПроверокВеденияУчета	= ГруппаПроверок.КонтекстПроверокВеденияУчета;
	
	Проверка = Проверки.Добавить();
	Проверка.ИдентификаторГруппы			= ГруппаПроверок.Идентификатор;
	Проверка.Наименование					= НСтр("ru='Проверка дублей личных данных кандидатов'");
	Проверка.Причины						= НСтр("ru='Обнаружены дубли личных данных кандидатов'");
	Проверка.Рекомендация					= НСтр("ru='Объединить дубли личных данных кандидатов'");
	Проверка.Идентификатор					= ГруппаПроверок.Идентификатор + ".ПроверкаНаличияДублейЛичныхДанныхКандидатов";
	Проверка.ОбработчикПроверки				= "ПодборПерсоналаПроверки.ПроверкаНаличияДублейЛичныхДанныхКандидатов";
	Проверка.ОбработчикПереходаКИсправлению	= "ПодборПерсоналаКлиент.ОткрытьФормуДляОбъединенияЛичныхДанныхКандидатов";
	Проверка.КонтекстПроверокВеденияУчета	= ГруппаПроверок.КонтекстПроверокВеденияУчета;
	
КонецПроцедуры

#КонецОбласти

Функция ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапросаКомпоновки, ТолькоРазрешенные) Экспорт
	
	Запрос = Неопределено;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат Запрос;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Если ВРег(ИмяПредставления) = ВРег("СведенияОКандидатах") Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблицДляСоздатьВТОсновныеСведенияОКандидатах(
			МенеджерВременныхТаблиц, , "Представления_СведенияОКандидатах");
		Запрос = ЗапросОсновныеСведенияОКандидатах(ОписательВременныхТаблиц, ТолькоРазрешенные);
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ЛичныеДанныеКандидатов") Тогда
		ОписательВременныхТаблиц = ОписательВременныхТаблицДляСоздатьВТЛичныеДанныеКандидатов(
			МенеджерВременныхТаблиц, , "Представления_ЛичныеДанныеКандидатов");
		Запрос = ЗапросЛичныеДанныеКандидатов(ОписательВременныхТаблиц, ТолькоРазрешенные);
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СтажПринятыхКандидатов") Тогда
		Запрос = ЗапросСтажПринятыхКандидатов();
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

// Формирует временную таблицу с вакансиями, соответствующими отбору.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц, Неопределено - Описание
// 	Отбор - Структура - значения отбора,
// 	ТолькоРазрешенные - Булево - Описание, если Истина, в таблицу будут включены вакансии, доступные текущему пользователю.
//
Процедура СоздатьВТВакансииПоОтбору(МенеджерВременныхТаблиц, Отбор, ТолькоРазрешенные = Истина) Экспорт
	
	Справочники.Вакансии.СоздатьВТВакансииПоОтбору(МенеджерВременныхТаблиц, Отбор, ТолькоРазрешенные);
	
КонецПроцедуры

// См. Справочники.Кандидаты.СсылкаНаКандидатаПоЛичнымДанным
Функция СсылкаНаКандидатаПоЛичнымДанным(ЛичныеДанныеКандидата) Экспорт
	
	Возврат Справочники.Кандидаты.СсылкаНаКандидатаПоЛичнымДанным(ЛичныеДанныеКандидата);
	
КонецФункции

// Добавляет в таблицу взаимоотношений сведения о кандидатах физических лиц.
// 
// Параметры:
// 	История - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.История
//	ОбъектыВзаимоотношений - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.ОбъектыВзаимоотношений
Процедура ДополнитьИсториюВзаимоотношенийКандидатамиПоФизическимЛицам(История, ОбъектыВзаимоотношений) Экспорт
	
	ФизическиеЛица = ОбщегоНазначения.СкопироватьРекурсивно(ОбъектыВзаимоотношений);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ФизическиеЛица,
		Тип("СправочникСсылка.ФизическиеЛица"));
	
	Если ФизическиеЛица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Кандидаты = КандидатыФизическихЛиц(ФизическиеЛица).ВыгрузитьКолонку("Кандидат");
	ДополнитьИсториюВзаимоотношенийКандидатами(История, Кандидаты, "ФизическоеЛицо");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Добавляет в таблицу взаимоотношений сведения о кандидатах по личным данным кандидатов.
// 
// Параметры:
// 	История - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.История
//	ОбъектыВзаимоотношений - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.ОбъектыВзаимоотношений
Процедура ДополнитьИсториюВзаимоотношенийКандидатамиПоЛичнымДанным(История, ОбъектыВзаимоотношений) Экспорт
	
	ЛичныеДанныеКандидатов = ОбщегоНазначения.СкопироватьРекурсивно(ОбъектыВзаимоотношений);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ЛичныеДанныеКандидатов,
		Тип("СправочникСсылка.ЛичныеДанныеКандидатов"));
	
	Если ЛичныеДанныеКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Кандидаты = КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, Ложь).ВыгрузитьКолонку("Кандидат");
	ДополнитьИсториюВзаимоотношенийКандидатами(История, Кандидаты, "ЛичныеДанныеКандидата");
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Добавляет в таблицу взаимоотношений сведения о кандидатах.
// 
// Параметры:
// 	История - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.История
//  Кандидаты - Массив из СправочникСсылка.Кандидаты
//  ИмяПоляОбъектВзаимоотношений - см. ДобавитьСтрокуВИсториюВзаимоотношений.ИмяПоляОбъектВзаимоотношений
Процедура ДополнитьИсториюВзаимоотношенийКандидатами(История, Кандидаты, ИмяПоляОбъектВзаимоотношений) Экспорт
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОКандидатах = ОсновныеСведенияОКандидатах(Кандидаты);
	
	Для Каждого СтрокаДанных Из СведенияОКандидатах Цикл
		НайденнаяСтрока = История.Найти(СтрокаДанных.Кандидат, "Кандидат");
		Если НайденнаяСтрока = Неопределено Тогда
			ДобавитьСтрокуВИсториюВзаимоотношений(История, СтрокаДанных, ИмяПоляОбъектВзаимоотношений);
		Иначе
			НайденнаяСтрока.Кандидат = СтрокаДанных.Кандидат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. СотрудникиФормы.РолиФизическогоЛицаИсторииВзаимоотношений.
// 
Процедура ПриЗаполненииРолейФизическогоЛица(Роли) Экспорт
	
	Если Не ИспользоватьКандидатов() Тогда
		Возврат;
	КонецЕсли;

	Роли.Вставить("Кандидат", 3);

КонецПроцедуры

// Формирует таблицу откликов кандидатов на указанную вакансию.
// 
// Параметры:
//  ОтборВакансий - Структура
//  ТолькоНеРассмотренные - Булево
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Вакансия - СправочникСсылка.Вакансии
// * Кандидат - СправочникСсылка.Кандидаты
// * Рассмотрен - Булево
Функция ОткликиКандидатов(ОтборВакансий, ТолькоНеРассмотренные = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВакансииПоОтбору(Запрос.МенеджерВременныхТаблиц, ОтборВакансий);
	СоздатьВТОтклики(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТОтклики.Вакансия КАК Вакансия,
	|	ВТОтклики.Кандидат КАК Кандидат,
	|	ВТОтклики.Рассмотрен
	|ИЗ
	|	ВТОтклики КАК ВТОтклики
	|ГДЕ
	|	&УсловиеТолькоНеРассмотренные
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вакансия,
	|	Кандидат.ДатаРегистрации,
	|	Кандидат.Наименование";
	
	ТекстУсловия = ?(ТолькоНеРассмотренные, "НЕ ВТОтклики.Рассмотрен", "ИСТИНА");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоНеРассмотренные", ТекстУсловия);
	Запрос.УстановитьПараметр("ТолькоНеРассмотренные", ТолькоНеРассмотренные);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Выбирает причину отклонения кандидата, используемую по умолчанию.
//
Функция ПричинаОтклоненияКандидатаПоУмолчанию() Экспорт
	
	Возврат ПодборПерсоналаПовтИсп.ПричинаОтклоненияКандидатаПоУмолчанию();
	
КонецФункции

Процедура УстановитьСостояниеЭтапаРаботыКандидата(Кандидат, ЭтапРаботы, ПрежниеДанныеЭтапа) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РаботаСКандидатами.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = Кандидат;
	
	Если ЗначениеЗаполнено(ПрежниеДанныеЭтапа.Период) Тогда
		МенеджерЗаписи.Период = ПрежниеДанныеЭтапа.Период;
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтапРаботы.Период) Тогда
		МенеджерЗаписи.Удалить();
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Период = ЭтапРаботы.Период;
	МенеджерЗаписи.ЭтапРаботы = ЭтапРаботы.Этап;
	МенеджерЗаписи.СостояниеЭтапа = ЭтапРаботы.Состояние;
	МенеджерЗаписи.Комментарий = ЭтапРаботы.Комментарий;
	МенеджерЗаписи.ШаблонАнкеты = ЭтапРаботы.ШаблонАнкеты;
	МенеджерЗаписи.ДокументОснование = ЭтапРаботы.ДокументОснование;
	МенеджерЗаписи.УчетнаяЗаписьВидеоконференции = ЭтапРаботы.УчетнаяЗаписьВидеоконференции;
	МенеджерЗаписи.ИдентификаторВидеоконференции = ЭтапРаботы.ИдентификаторВидеоконференции;
	Если ЗначениеЗаполнено(ЭтапРаботы.Организатор) Тогда
		МенеджерЗаписи.Организатор = ЭтапРаботы.Организатор;
	КонецЕсли;
	
	Если ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		МенеджерЗаписи.ПериодОкончание = ЭтапРаботы.ПериодОкончание;
		МенеджерЗаписи.Бронь = ЭтапРаботы.Бронь;
	Иначе
		Если ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
			МенеджерЗаписи.Бронь = ПрежниеДанныеЭтапа.Бронь;
		Иначе
			МенеджерЗаписи.Бронь = Неопределено;
		КонецЕсли;
		МенеджерЗаписи.ПериодОкончание = Неопределено;
	КонецЕсли;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура:
// * Фамилия - Строка -
// * Имя - Строка -
// * Отчество - Строка -
// * ДатаРождения - Дата -
// * Адрес - Строка -
// * Телефон - Строка -
// * EMail - Строка -
// * Сообщение - Строка -
// * ФайлРезюме - Неопределено, ХранилищеЗначения -
// * Источник - СправочникСсылка.ИсточникиИнформацииОКандидатах -
// * ДатаОтклика - Дата -
// * ИдентификаторРезюме - Строка -
// * АдресРезюме - Строка -
Функция ОписаниеОткликаНаВакансию() Экспорт
	
	ОписаниеОтклика = Новый Структура();
	ОписаниеОтклика.Вставить("Фамилия", "");
	ОписаниеОтклика.Вставить("Имя", "");
	ОписаниеОтклика.Вставить("Отчество", "");
	ОписаниеОтклика.Вставить("ДатаРождения", Дата(1, 1, 1));
	ОписаниеОтклика.Вставить("Адрес", "");
	ОписаниеОтклика.Вставить("Телефон", "");
	ОписаниеОтклика.Вставить("EMail", "");
	ОписаниеОтклика.Вставить("Сообщение", "");
	ОписаниеОтклика.Вставить("ФайлРезюме", Неопределено);
	ОписаниеОтклика.Вставить("Источник", Справочники.ИсточникиИнформацииОКандидатах.ПустаяСсылка());
	ОписаниеОтклика.Вставить("ДатаОтклика", Дата(1, 1, 1));
	ОписаниеОтклика.Вставить("ИдентификаторРезюме", "");
	ОписаниеОтклика.Вставить("АдресРезюме", "");
	
	Возврат ОписаниеОтклика;
	
КонецФункции

Процедура ДобавитьОткликНаВакансию(Вакансия, ОписаниеОтклика) Экспорт
	
	СоздатьКандидатаПоДаннымОтклика(Вакансия, ОписаниеОтклика);
	
КонецПроцедуры

Функция ПланируемаяДатаЗакрытияПоУмолчанию(ДатаОткрытия) Экспорт
	
	Настройки = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	Если Настройки.ЕдиницаИзмеренияПериодаРаботыСВакансией = Перечисления.Периодичность.День Тогда
		Возврат ДатаОткрытия + (ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах() * Настройки.ПериодРаботыСВакансией);
	ИначеЕсли Настройки.ЕдиницаИзмеренияПериодаРаботыСВакансией = Перечисления.Периодичность.Месяц Тогда
		Возврат ДобавитьМесяц(ДатаОткрытия, Настройки.ПериодРаботыСВакансией);
	Иначе
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
КонецФункции

Функция ЕстьДоступКПрофилямДолжностей(ВидДоступа = "Чтение") Экспорт
	Возврат ПравоДоступа(ВидДоступа, Метаданные.Справочники.ПрофилиДолжностей);
КонецФункции

#Область РегламентныеЗадания

// Регламентное задание ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе
//
Процедура ОтклонитьКандидатовЗадержавшихсяНаОдномЭтапе() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе);
	
	УстановитьПривилегированныйРежим(Истина);
	Способ = ПодборПерсоналаПроверки.СпособыВыявленияЗадержавшихсяКандидатов().Отклонение;
	ЗадержавшиесяКандидаты = ПодборПерсоналаПроверки.ЗадержавшиесяКандидаты(Способ);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗадержавшиесяКандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Решение = ПодборПерсоналаКлиентСервер.ОписаниеРешенияПоКандидату();
	Решение.Решение = Перечисления.СостоянияСогласования.Отклонено;
	Решение.ДатаРешения = ТекущаяДатаСеанса();
	Решение.Причина = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек().ПричинаАвтоматическогоОтклонения;
	РезультатВыбора = ПодборПерсоналаКлиентСервер.ОписаниеРешенияПоКандидатам();
	РезультатВыбора.Кандидаты = ЗадержавшиесяКандидаты;
	РезультатВыбора.Решение = Решение;
	УстановитьРешениеПоКандидатам(ЗадержавшиесяКандидаты, РезультатВыбора);
	
	Проверка = КонтрольВеденияУчета.ПроверкаПоИдентификатору("КонтрольПодбораПерсонала.ПроверкаНаличияЗадержавшихсяКандидатов");
	КонтрольВеденияУчета.ВыполнитьПроверку(Проверка);
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзменения

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаПодборПерсонала", "Дата", "ПодборПерсонала", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходыНаИсточникИнформацииОКандидатах", "НачалоПериодаОказанияУслуги", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ОплатаПубликацийВакансий", "НачалоПериодаОказанияУслуги", "ПодборПерсонала", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасходыНаИсточникиИнформацииОКандидатах", "Период", "ПодборПерсонала", "Организация");
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОбработками.
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	Разделы.Добавить(Метаданные.Подсистемы.ПодборПерсонала);
КонецПроцедуры

// См. ДополнительныеОтчетыИОбработкиПереопределяемый.ОпределитьРазделыСДополнительнымиОтчетами.
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	Разделы.Добавить(Метаданные.Подсистемы.ПодборПерсонала);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#Область ЗащитаПерсональныхДанных

Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.Кандидаты";
	НовыеСведения.ПоляРегистрации	= "ЛичныеДанные";
	НовыеСведения.ПоляДоступа		= "Наименование,ДатаРегистрации,Резюме,РезюмеТекст,ОжидаемыйДоход,ДатаРешения,КомментарийРешения,ПричинаОтклонения,Состояние";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";

	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.ЛичныеДанныеКандидатов";
	НовыеСведения.ПоляРегистрации	= "Ссылка,Наименование";
	НовыеСведения.ПоляДоступа		= "КонтактнаяИнформация.ЗначенияПолей,КонтактнаяИнформация.Значение,КонтактнаяИнформация.Представление,КонтактнаяИнформация.Регион,КонтактнаяИнформация.Город,КонтактнаяИнформация.АдресЭП,КонтактнаяИнформация.НомерТелефона,КонтактнаяИнформация.НомерТелефонаБезКодов";
	НовыеСведения.ОбластьДанных		= "КонтактнаяИнформация";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.ЛичныеДанныеКандидатов";
	НовыеСведения.ПоляРегистрации	= "Ссылка,Наименование";
	НовыеСведения.ПоляДоступа		= "ДатаРождения,Пол,МестоРождения,Наименование,ФИО";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";

КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов.
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
	// Добавим в Субъекты личные данные кандидатов, связанных с физическими лицами.
	
	ДобавляемыеСубъекты = Новый Массив;
	
	Для Каждого Субъект Из Субъекты Цикл
		
		Если ТипЗнч(Субъект) <> Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаблицаИсключений.Найти(Субъект, "Субъект") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатаФизическогоЛица(Субъект);
		Если ЗначениеЗаполнено(ЛичныеДанныеКандидата) Тогда
			ДобавляемыеСубъекты.Добавить(ЛичныеДанныеКандидата);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субъекты, ДобавляемыеСубъекты, Истина);
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередУничтожениемПерсональныхДанных.
Процедура ПередУничтожениемПерсональныхДанных(Объект, Субъекты, ВыполнитьЗаписьОбъекта) Экспорт

	Если ТипЗнч(Объект) <> Тип("СправочникОбъект.ЛичныеДанныеКандидатов") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Фотография = Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка();
	
КонецПроцедуры

Процедура ПриСкрытииПерсональныхДанныхКандидата(Объект, Отказ) Экспорт
	
	Если Не Объект.ДополнительныеСвойства.Свойство("СкрытиеКонфиденциальнойИнформации") Тогда
		Возврат;
	КонецЕсли;
	
	Файлы = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Объект.Ссылка, Файлы);
	
	Для Каждого Файл Из Файлы Цикл
		ФайлОбъект = Файл.ПолучитьОбъект();
		ФайлОбъект.ПометкаУдаления = Истина;
		ФайлОбъект.ДополнительныеСвойства.Вставить("СкрытиеКонфиденциальнойИнформации");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ФайлОбъект);
	КонецЦикла;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных.
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт

	// Справочники.ЛичныеДанныеКандидатов
	МетаданныеЛичныеДанные = Метаданные.Справочники.ЛичныеДанныеКандидатов;
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеЛичныеДанные.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеЛичныеДанные.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеЛичныеДанные.СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.НаименованиеСлужебное.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.УточнениеНаименования.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.ФИО.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.Фамилия.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.Имя.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.Отчество.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.Инициалы.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";

	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеЛичныеДанные.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеЛичныеДанные.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.ДатаРождения.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.Реквизиты.МестоРождения.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ДатаМестоРождения";

	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеЛичныеДанные.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеЛичныеДанные.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.ЗначенияПолей.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Значение.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Представление.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Регион.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.Город.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.АдресЭП.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.НомерТелефона.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты.НомерТелефонаБезКодов.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";

	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеЛичныеДанные.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеЛичныеДанные.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.Образование.Реквизиты.Факультет.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.Образование.Реквизиты.ГодОкончания.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.Курсы.Реквизиты.НаименованиеКурса.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.Курсы.Реквизиты.ДополнительнаяИнформация.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.Курсы.Реквизиты.ГодОкончания.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";

	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеЛичныеДанные.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеЛичныеДанные.СтандартныеРеквизиты.Ссылка.Имя;
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.Компания.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.СфераДеятельностиКомпании.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.Должность.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.Обязанности.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.ДатаНачала.ПолноеИмя());
	Поля.Добавить(МетаданныеЛичныеДанные.ТабличныеЧасти.ОпытРаботы.Реквизиты.ДатаОкончания.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ОпытРаботы";
	
	// Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы
	МетаданныеПрисоединенныеФайлы = Метаданные.Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеПрисоединенныеФайлы.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеПрисоединенныеФайлы.Реквизиты.ВладелецФайла.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеПрисоединенныеФайлы.Реквизиты.ФайлХранилище.ПолноеИмя());
	Поля.Добавить(МетаданныеПрисоединенныеФайлы.Реквизиты.ТекстХранилище.ПолноеИмя());
	Поля.Добавить(МетаданныеПрисоединенныеФайлы.Реквизиты.ПутьКФайлу.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Фотография";
	
	// Справочники.Кандидаты
	МетаданныеКандидаты = Метаданные.Справочники.Кандидаты;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеКандидаты.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеКандидаты.Реквизиты.ЛичныеДанные.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеКандидаты.СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(МетаданныеКандидаты.Реквизиты.УточнениеНаименования.ПолноеИмя());
	Поля.Добавить(МетаданныеКандидаты.Реквизиты.Резюме.ПолноеИмя());
	Поля.Добавить(МетаданныеКандидаты.Реквизиты.РезюмеТекст.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";

КонецПроцедуры

Процедура ДобавитьСубъектыДляРасчетаСроковХранения(Источник) Экспорт
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ФизическиеЛицаКандидатов") Тогда
		РегистрыСведений.ФизическиеЛицаКандидатов.ДобавитьСубъектыДляРасчетаСроковХранения(Источник);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриРасчетеСроковХраненияПерсональныхДанных
Процедура ПриРасчетеСроковХраненияПерсональныхДанных(ДанныеСубъектов, СрокиХранения) Экспорт

	Для Каждого СтрокаТаблицы Из ДанныеСубъектов Цикл
		Если ТипЗнч(СтрокаТаблицы.Субъект) <> Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			Продолжить;
		КонецЕсли;
		ФизическоеЛицо = ФизическоеЛицоЛичныхДанныхКандидата(СтрокаТаблицы.Субъект);
		Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			НоваяСтрока = СрокиХранения.Добавить();
			НоваяСтрока.Субъект = СтрокаТаблицы.Субъект;
			НоваяСтрока.СрокХранения = ЗащитаПерсональныхДанныхЗарплатаКадры.ДатаНеУничтожать();
			НоваяСтрока.Комментарий = НСтр("ru = 'Кандидат связан с физическим лицом'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ДополнитьДанныеСубъектовПерсональныхДанных.
Процедура ДополнитьДанныеСубъектовПерсональныхДанных(СубъектыПерсональныхДанных, ДатаАктуальности) Экспорт
	
	ЛичныеДанныеКандидатов = ОбщегоНазначения.ВыгрузитьКолонку(СубъектыПерсональныхДанных, "Субъект", Истина);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ЛичныеДанныеКандидатов,
		Тип("СправочникСсылка.ЛичныеДанныеКандидатов"));
		
	ДанныеЛичныхДанныхКандидатов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ЛичныеДанныеКандидатов, "ФИО");
	
	Для Каждого ТекСтрока Из СубъектыПерсональныхДанных Цикл 
		ДанныеЛичныхДанныхКандидата = ДанныеЛичныхДанныхКандидатов.Получить(ТекСтрока.Субъект);
		Если ДанныеЛичныхДанныхКандидата <> Неопределено Тогда
			ТекСтрока.ФИО = ДанныеЛичныхДанныхКандидата.ФИО;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf76-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ЗаявкаНаПодборПерсонала);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf5a-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.Вакансии);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf71-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ИсточникиИнформацииОКандидатах);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf95-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.Кандидаты);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4ef-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ПричиныОтклоненияКандидатов);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4d9-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ПричиныОткрытияВакансий);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbf-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ПрофилиДолжностей);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4f4-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ЭтапыРаботыСКандидатами);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "9e90f341-c9a2-4797-bd92-91f8d5ebfdec", Метаданные.Справочники.ЛичныеДанныеКандидатов);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.ОценкаЭффективностиИсточниковИнформации") Тогда
		УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf99-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.РасходыНаИсточникИнформацииОКандидатах);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала
	Списки.Вставить(Метаданные.Справочники.Вакансии, Истина);
	Списки.Вставить(Метаданные.Справочники.ВакансииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПрофилиДолжностей, Истина);
	Списки.Вставить(Метаданные.Справочники.ПрофилиДолжностейПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Кандидаты, Истина);
	Списки.Вставить(Метаданные.Справочники.КандидатыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛичныеДанныеКандидатов, Истина);
	Списки.Вставить(Метаданные.Справочники.ЛичныеДанныеКандидатовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФизическиеЛицаКандидатов, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаПодборПерсонала, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаПодборПерсоналаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КомментарииКандидатов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПротоколыОтправкиСообщенийКандидатам, Истина);
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала
	
	// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.ОценкаЭффективностиИсточниковИнформации
	Списки.Вставить(Метаданные.Документы.РасходыНаИсточникИнформацииОКандидатах, Истина);
	Списки.Вставить(Метаданные.Справочники.РасходыНаИсточникИнформацииОКандидатахПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОплатаПубликацийВакансий, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасходыНаИсточникиИнформацииОКандидатах, Истина);
	// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.ОценкаЭффективностиИсточниковИнформации
	
КонецПроцедуры

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт 
	
	ЕстьИнтерфейс = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыКомандныйИнтерфейс");
	
	ОписаниеПрофиля = ОписаниеПрофиляМенеджерПоНаборуПерсонала(ЕстьИнтерфейс);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = ОписаниеПрофиляСтаршийМенеджерПоНаборуПерсонала(ЕстьИнтерфейс);
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = ОписаниеПрофиляСогласованиеЗаявокНаПодбор();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ЗагрузкаКандидатовИзИнтернета.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ЗаполнитьСпискиСОграничениемДоступаВзаимодействий(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.Встреча, Ложь);
	Списки.Вставить(Метаданные.Документы.ЗапланированноеВзаимодействие, Ложь);
	Списки.Вставить(Метаданные.Документы.СообщениеSMS, Ложь);
	Списки.Вставить(Метаданные.Документы.ТелефонныйЗвонок, Ложь);
	Списки.Вставить(Метаданные.Документы.ЭлектронноеПисьмоВходящее, Ложь);
	Списки.Вставить(Метаданные.Документы.ЭлектронноеПисьмоИсходящее, Ложь);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ЗаполнитьОграниченияДоступаВзаимодействий(Список, Ограничение) Экспорт

	Если Список = Метаданные.Документы.Встреча 
		Или Список = Метаданные.Документы.ЗапланированноеВзаимодействие 
		Или Список = Метаданные.Документы.СообщениеSMS 
		Или Список = Метаданные.Документы.ТелефонныйЗвонок Тогда
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК Взаимодействия
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК Предметы
		|	ПО Предметы.Взаимодействие = Взаимодействия.Ссылка
		|;
		|РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Выразить(Предметы.Предмет КАК Справочник.Кандидаты).ЛичныеДанные, Отключено КАК Ложь)";
	КонецЕсли;

	Если Список = Метаданные.Документы.ЭлектронноеПисьмоВходящее Тогда
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК Взаимодействия
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК Предметы
		|	ПО Предметы.Взаимодействие = Взаимодействия.Ссылка
		|;
		|РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(УчетнаяЗапись, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Выразить(Предметы.Предмет КАК Справочник.Кандидаты).ЛичныеДанные, Отключено КАК Ложь)";
	КонецЕсли;
	
	Если Список = Метаданные.Документы.ЭлектронноеПисьмоИсходящее Тогда
		Ограничение.Текст =
		"ПрисоединитьДополнительныеТаблицы
		|ЭтотСписок КАК Взаимодействия
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПредметыПапкиВзаимодействий КАК Предметы
		|	ПО Предметы.Взаимодействие = Взаимодействия.Ссылка
		|;
		|РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Ответственный, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Автор, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(УчетнаяЗапись, Отключено КАК Ложь)
		|	ИЛИ ЗначениеРазрешено(Выразить(Предметы.Предмет КАК Справочник.Кандидаты).ЛичныеДанные, Отключено КАК Ложь)";
	КонецЕсли;
	
КонецПроцедуры

// Обслуживание подсистемы УправлениеДоступом
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	// Кандидаты
	Если ВидыДоступа.Найти("ГруппыКандидатов", "Имя") = Неопределено Тогда
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя = "ГруппыКандидатов";
		ВидДоступа.Представление = НСтр("ru = 'Группы кандидатов'");
		ВидДоступа.ТипЗначений = Тип("СправочникСсылка.ЛичныеДанныеКандидатов");
		ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаКандидатов");
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	Если ИмяВидаДоступа = "ГруппыКандидатов" Тогда
		Использование = Константы.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов.Получить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	
	ДополнитьОписаниеПрофиляПравамиНаЧтение(ОписаниеПрофиля);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаПодборПерсонала");
	ДополнитьПрофильВидомДоступаПоГруппамКандидатов(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиляПравамиНаЧтение(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрофилейДолжности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВакансий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхКандидатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОткрытияВакансий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛичныхДанныхКандидатов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтепенейЗнанияЯзыкаКандидата");
	
КонецПроцедуры

Процедура ДополнитьПрофильВидомДоступаПоГруппамКандидатов(ОписаниеПрофиля) Экспорт
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКандидатов");
КонецПроцедуры

#КонецОбласти

// Функция возвращает актуальные настройки подбора персонала
// 
// Возвращаемое значение:
//   - НастройкиПодбораПерсонала
//
Функция УстановленныеНастройки() Экспорт
	Возврат РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
КонецФункции

Функция АдресФотографииЛичныхДанныхКандидата(ЛичныеДанныеКандидата) Экспорт
	
	Фотографии = АдресаФотографийЛичныхДанныхКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ЛичныеДанныеКандидата));
	
	Возврат ?(Фотографии[ЛичныеДанныеКандидата] = Неопределено, "", Фотографии[ЛичныеДанныеКандидата]);
	
КонецФункции

Функция АдресаФотографийЛичныхДанныхКандидатов(ЛичныеДанныеКандидатов) Экспорт
	
	Фотографии = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Фотография КАК Фотография
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.Ссылка В (&ЛичныеДанныеКандидатов)
		|	И ЛичныеДанныеКандидатов.Фотография <> ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Фотографии;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.Фотография,
			Новый Структура("ИдентификаторФормы", Выборка.ЛичныеДанныеКандидата.УникальныйИдентификатор()));
		АдресФотографии = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		Фотографии.Вставить(Выборка.ЛичныеДанныеКандидата, АдресФотографии);
	КонецЦикла;
	
	Возврат Фотографии;
	
КонецФункции

// АПК:299-выкл
Функция АдресФотографииКандидата(Кандидат) Экспорт
	
	Фотографии = АдресаФотографийКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат));
	
	Возврат ?(Фотографии[Кандидат] = Неопределено, "", Фотографии[Кандидат]);
	
КонецФункции
// АПК:299-вкл

Функция АдресаФотографийКандидатов(Кандидаты) Экспорт
	
	Фотографии = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	Кандидаты.ЛичныеДанные.Фотография КАК Фотография
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Ссылка В (&Кандидаты)
		|	И
		|		Кандидаты.ЛичныеДанные.Фотография <> ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатовПрисоединенныеФайлы.ПустаяСсылка)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Фотографии;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.Фотография,
			Новый Структура("ИдентификаторФормы", Выборка.Кандидат.УникальныйИдентификатор()));
		АдресФотографии = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
		Фотографии.Вставить(Выборка.Кандидат, АдресФотографии);
	КонецЦикла;
	
	Возврат Фотографии;
	
КонецФункции

// Дополняет массив объектов метаданных физических лиц.
// 
// Параметры:
//  ОбъектыМетаданныхФизическихЛиц - Массив из ОбъектМетаданных
Процедура ДополнитьОбъектыМетаданныхФизическихЛиц(ОбъектыМетаданныхФизическихЛиц) Экспорт
	ОбъектыМетаданныхФизическихЛиц.Добавить(Метаданные.Справочники.ЛичныеДанныеКандидатов);
КонецПроцедуры

Процедура ДополнитьТекстЗапросаГлобальногоПоискаФизическихЛиц(ТекстЗапроса) Экспорт

	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	СхемаЗапроса = Новый СхемаЗапроса();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ПакетЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорыЗапроса = ПакетЗапроса.Операторы;
	НовыйОператор = ОператорыЗапроса.Добавить(ОператорыЗапроса[0]);
	
	ТаблицаЛичныеДанныеКандидатов = ПакетЗапроса.ДоступныеТаблицы.Найти("Справочник.ЛичныеДанныеКандидатов");
	НовыйОператор.Источники.Заменить(0, ТаблицаЛичныеДанныеКандидатов);
	
	Источник = НовыйОператор.Источники[0].Источник;
	Источник.Псевдоним = "ЛичныеДанныеКандидатов";
	
	ИсточникФизическиеЛицаКандидатов = НовыйОператор.Источники.Добавить("РегистрСведений.ФизическиеЛицаКандидатов",
		"ФизическиеЛицаКандидатов");
	ИсточникФизическиеЛицаКандидатов.Соединения.Очистить();
	ИсточникФизическиеЛицаКандидатов.Соединения.Добавить("ЛичныеДанныеКандидатов");
	ИсточникФизическиеЛицаКандидатов.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
	
	НовыйОператор.Отбор.Добавить("&УсловияПоиска");
	НовыйОператор.Отбор.Добавить(
		"ФизическиеЛицаКандидатов.ФизическоеЛицо Есть NULL ИЛИ ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления = Истина");
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УсловияПоиска = "(ЛичныеДанныеКандидатов.ФИО ПОДОБНО &СтрокаПоиска
	|	ИЛИ ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты ПОДОБНО &СтрокаПоиска
	|	ИЛИ ДанныеПоискаФизическихЛиц.Телефоны ПОДОБНО &СтрокаПоиска)";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловияПоиска", УсловияПоиска);
	
КонецПроцедуры

#Область РазделыДанных

// Добавляет разделы в таблицу разделов данных.
// 
// Параметры:
//  РазделыДанных - ТаблицаЗначений - см. СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.ТаблицаВсехРазделовДанных
Процедура ПриДобавленииРазделовДанных(РазделыДанных) Экспорт
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьРазделДанныхВТаблицу(РазделыДанных, "ПодборПерсонала",
		"Подбор персонала", "УправленческиеДанные", БиблиотекаКартинок.ПодборПерсонала,
		"ПодборПерсонала.ПриДобавленииРазделовДанных");
	
КонецПроцедуры

#КонецОбласти

#Область КандидатыПоСотрудникам

// Возвращает таблицу с кандидатами по сотрудникам, связывая их через решения о приеме на работу.
// Если по такому принципу не удается найти кандидатов для сотрудников, выполняется сопоставление
// при помощи метода ПриоритетныеКандидатыПоСотрудникам(Сотрудники).
//
// Параметры:
//	Сотрудники - Массив Из СправочникСсылка.Сотрудники - сотрудники, по которым необходимо найти кандидатов.
// 
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//	* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо сотрудника.
//	* Сотрудник		 - СправочникСсылка.Сотрудники - сотрудник.
//	* Кандидат		 - СправочникСсылка.Кандидаты - приоритетный кандидат по сотруднику.
//	* Вакансия		 - СправочникСсылка.Вакансии - вакансия кандидата.
//
Функция КандидатыПоСотрудникам(Сотрудники) Экспорт
	
	КандидатыПоСотрудникам = ТаблицаКандидатыПоСотрудникам();
	
	УстановитьПривилегированныйРежим(Истина);
	РешенияПоСотрудникам =
		РегистрыСведений.СотрудникиПоРешениямОПриемеНаРаботу.РешенияОПриемеНаРаботуПоСотрудникам(Сотрудники);
	КандидатыПоРешениям = Документы.РешениеОПриемеНаРаботу.КандидатыПоРешениям(
		ОбщегоНазначения.ВыгрузитьКолонку(РешенияПоСотрудникам, "Значение", Истина));
	ОсновныеСведенияОКандидатах = ОсновныеСведенияОКандидатах(
		ОбщегоНазначения.ВыгрузитьКолонку(КандидатыПоРешениям, "Значение", Истина));
	УстановитьПривилегированныйРежим(Ложь);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ОсновныеСведенияОКандидатах, "Кандидат");
	
	СотрудникиСКандидатами = Новый Массив;
	КандидатыССотрудниками = Новый Массив;
	Для Каждого РешениеПоСотруднику Из РешенияПоСотрудникам Цикл
		Кандидат = КандидатыПоРешениям.Получить(РешениеПоСотруднику.Значение);
		ОсновныеСведенияОКандидате = ОсновныеСведенияОКандидатах.НайтиСтроки(Новый Структура("Кандидат", Кандидат));
		Если ОсновныеСведенияОКандидате.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		КандидатПоСотруднику = КандидатыПоСотрудникам.Добавить();
		КандидатПоСотруднику.Сотрудник = РешениеПоСотруднику.Ключ;
		КандидатПоСотруднику.Кандидат = Кандидат;
		КандидатПоСотруднику.ФизическоеЛицо = ОсновныеСведенияОКандидате[0].ФизическоеЛицо;
		КандидатПоСотруднику.Вакансия = ОсновныеСведенияОКандидате[0].Вакансия;
		СотрудникиСКандидатами.Добавить(КандидатПоСотруднику.Сотрудник);
		КандидатыССотрудниками.Добавить(КандидатПоСотруднику.Кандидат);
	КонецЦикла;
	
	ОставшиесяСотрудники = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Сотрудники, СотрудникиСКандидатами);
	Если ОставшиесяСотрудники.Количество() = 0 Тогда
		Возврат КандидатыПоСотрудникам;
	КонецЕсли;
	
	ПриоритетныеКандидатыПоСотрудникам = ПриоритетныеКандидатыПоСотрудникам(
		ОставшиесяСотрудники,
		СотрудникиСКандидатами,
		КандидатыССотрудниками);
	Для Каждого ПриоритетныйКандидатПоСотруднику Из ПриоритетныеКандидатыПоСотрудникам Цикл
		КандидатПоСотруднику = КандидатыПоСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(КандидатПоСотруднику, ПриоритетныйКандидатПоСотруднику);
	КонецЦикла;
	
	Возврат КандидатыПоСотрудникам;
	
КонецФункции

// Возвращает таблицу с кандидатами по сотрудникам, связывая их через физические лица и выбирая лучший приоритет:
//      Приоритеты:
//              1 - Кандидат согласован и его позиция совпадает с должностью по ШР сотрудника;
//              2 - Кандидат согласован и имеет тоже подразделение, что и сотрудник;
//              3 - Кандидат согласован;
//              4 - Все остальные удовлетворяющие вышеперечисленным условиям.
//
// Параметры:
//	Сотрудники - Массив Из СправочникСсылка.Сотрудники - сотрудники, по которым необходимо найти кандидатов.
//	ИсключаемыеСотрудники - Массив Из СправочникСсылка.Сотрудники - сотрудники, которых нужно исключить из анализа.
//	ИсключаемыеКандидаты - Массив Из СправочникСсылка.Кандидаты - кандидаты, которых нужно исключить из анализа.
// 
// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//	* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо сотрудника.
//	* Сотрудник		 - СправочникСсылка.Сотрудники - сотрудник.
//	* Кандидат		 - СправочникСсылка.Кандидаты - приоритетный кандидат по сотруднику.
//	* Вакансия		 - СправочникСсылка.Вакансии - вакансия кандидата.
//
Функция ПриоритетныеКандидатыПоСотрудникам(Сотрудники, ИсключаемыеСотрудники = Неопределено, ИсключаемыеКандидаты = Неопределено) Экспорт
	
	ПриоритетныеКандидатыПоСотрудникам = ТаблицаКандидатыПоСотрудникам();
	
	Если ИсключаемыеКандидаты = Неопределено Тогда
		ИсключаемыеКандидаты = Новый Массив;
	КонецЕсли;
	
	// Получение физических лиц и всех сотрудников по ним с необходимыми кадровыми данными для установления приоритетности.
	// Исключаем уже связанных (по пункуту 1) сотрудников.
	// Упорядочиваем по физическим лицам и по возрастанию даты приема.
	УстановитьПривилегированныйРежим(Истина);
	ФизическиеЛицаСотрудников = КадровыйУчет.ФизическиеЛицаСотрудников(Сотрудники);
	СотрудникиФизическихЛиц = ОбщегоНазначения.ВыгрузитьКолонку(
		КадровыйУчет.СотрудникиФизическихЛиц(ФизическиеЛицаСотрудников), "Сотрудник", Истина);
	Если ИсключаемыеСотрудники <> Неопределено Тогда
		СотрудникиФизическихЛиц = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			СотрудникиФизическихЛиц,
			ИсключаемыеСотрудники);
	КонецЕсли;
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СотрудникиФизическихЛиц,
		"ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия, ДатаПриема, ФизическоеЛицо");
	ЗаполнитьПолеЕслиНеЗаполнено(КадровыеДанныеСотрудников, "ДатаПриема", Дата(3999, 12, 31));
	КадровыеДанныеСотрудников.Сортировать("ФизическоеЛицо, ДатаПриема");
	
	// Получение кандидатов по физическим лицам.
	// Исключаем уже связанных (по пункуту 1) кандидатов.
	// Упорядочиваем по физическим лицам и по возрастанию даты утверждения.
	КандидатыФизическихЛиц = КандидатыФизическихЛиц(ФизическиеЛицаСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(КандидатыФизическихЛиц , "ФизическоеЛицо");
	КандидатыФизическихЛиц.Сортировать("ФизическоеЛицо, ДатаРешения");
	
	// Создание таблицы для сотрудников с неоднозначными кандидатами.
	СотрудникиСНесколькимиКандидатами = ТаблицаКандидатыПоСотрудникам();
	СотрудникиСНесколькимиКандидатами.Колонки.Добавить("ПриоритетКандидата", Новый ОписаниеТипов("Число"));
	СотрудникиСНесколькимиКандидатами.Колонки.Добавить("КандидатовПоСотруднику", Новый ОписаниеТипов("Число"));
	СотрудникиСНесколькимиКандидатами.Колонки.Добавить("ДатаУтверждения", Новый ОписаниеТипов("Дата"));
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(СотрудникиСНесколькимиКандидатами, "Кандидат");
	
	// Удаляем помеченных на удаление, отклоненных и связанных кандидатов
	Индекс = КандидатыФизическихЛиц.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ИндексКандидата = ИсключаемыеКандидаты.Найти(КандидатыФизическихЛиц[Индекс].Кандидат);
		Если КандидатыФизическихЛиц[Индекс].ПометкаУдаления
			Или КандидатыФизическихЛиц[Индекс].Состояние = Перечисления.СостоянияСогласования.Отклонено
			Или ИндексКандидата <> Неопределено Тогда
			КандидатыФизическихЛиц.Удалить(КандидатыФизическихЛиц[Индекс]);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ОбходПоСотрудникам = Обработки.ОбходКоллекции.НовыйОбход(КадровыеДанныеСотрудников);
	ОбходПоКандидатам = Обработки.ОбходКоллекции.НовыйОбход(КандидатыФизическихЛиц);
	
	ЛучшийПриоритетКандидатов = Новый Соответствие;
	Пока ОбходПоСотрудникам.СледующийПоЗначениюПоля("ФизическоеЛицо") Цикл
		Пока ОбходПоСотрудникам.Следующий() Цикл
			ТекущиеДанныеСотрудника = ОбходПоСотрудникам.ТекущиеДанные();
			КандидатыСотрудника = Новый Массив;
			// Обход по кандидатам с подходящим физическим лицом
			Пока ОбходПоКандидатам.НайтиСледующий(Новый Структура("ФизическоеЛицо",
				ТекущиеДанныеСотрудника.ФизическоеЛицо)) Цикл
				ТекущиеДанныеКандидата = ОбходПоКандидатам.ТекущиеДанные();
				// Если это кандидат с датой регистрации большей чем дата приема, можно переходить к следующему кандидату
				Если ТекущиеДанныеСотрудника.ДатаПриема < НачалоДня(ТекущиеДанныеКандидата.ДатаРегистрации) Тогда
					Продолжить;
				КонецЕсли;
				// Если это кандидат с датой решения большей чем дата приема, можно останавливать цикл
				Если ТекущиеДанныеСотрудника.ДатаПриема < НачалоДня(ТекущиеДанныеКандидата.ДатаРешения) Тогда
					Прервать;
				КонецЕсли;
				// Сохраняем кандидатов и индексы строк для них
				Кандидат = Новый Структура;
				Кандидат.Вставить("ИндексСтроки", ОбходПоКандидатам.ТекущаяСтрока());
				Кандидат.Вставить("ДанныеКандидата", ТекущиеДанныеКандидата);
				КандидатыСотрудника.Добавить(Кандидат);
			КонецЦикла;
			КандидатовПоСотруднику = КандидатыСотрудника.Количество();
			ИндексКандидата = КандидатовПоСотруднику - 1;
			// Обход кандидатов в обратном порядке по дате утверждения для установки связей
			Пока ИндексКандидата >= 0 Цикл
				ПриоритетКандидата = ПриоритетКандидата(ТекущиеДанныеСотрудника, КандидатыСотрудника[ИндексКандидата].ДанныеКандидата);
				// Если кандидат имеет 1 приоритет, его можно сразу связать с сотрудником и удалить из доступных
				Если ПриоритетКандидата = 1 Тогда
					Если Сотрудники.Найти(ТекущиеДанныеСотрудника.Сотрудник) <> Неопределено Тогда
						КандидатПоСотруднику = ПриоритетныеКандидатыПоСотрудникам.Добавить();
						КандидатПоСотруднику.Сотрудник = ТекущиеДанныеСотрудника.Сотрудник;
						КандидатПоСотруднику.ФизическоеЛицо = ТекущиеДанныеСотрудника.ФизическоеЛицо;
						КандидатПоСотруднику.Кандидат = КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.Кандидат;
						КандидатПоСотруднику.Вакансия = КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.Вакансия;
					КонецЕсли;
					КандидатыФизическихЛиц.Удалить(КандидатыСотрудника[ИндексКандидата].ИндексСтроки);
					//Удаляем все связи с кандидатом, которые установили до этого момента.
					СвязиСКандидатом = СотрудникиСНесколькимиКандидатами.НайтиСтроки(
						Новый Структура("Кандидат", КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.Кандидат));
					Для Каждого СтрокаСвязь Из СвязиСКандидатом Цикл
						СотрудникиСНесколькимиКандидатами.Удалить(СтрокаСвязь);
					КонецЦикла;
					Прервать;
				КонецЕсли;
				// Записываем связь
				СотрудникСНесколькимиКандидатами = СотрудникиСНесколькимиКандидатами.Добавить();
				СотрудникСНесколькимиКандидатами.ФизическоеЛицо = ТекущиеДанныеСотрудника.ФизическоеЛицо;
				СотрудникСНесколькимиКандидатами.Сотрудник = ТекущиеДанныеСотрудника.Сотрудник;
				СотрудникСНесколькимиКандидатами.Кандидат = КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.Кандидат;
				СотрудникСНесколькимиКандидатами.Вакансия = КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.Вакансия;
				СотрудникСНесколькимиКандидатами.ДатаУтверждения =
					КандидатыСотрудника[ИндексКандидата].ДанныеКандидата.ДатаРешения;
				СотрудникСНесколькимиКандидатами.КандидатовПоСотруднику = КандидатовПоСотруднику;
				СотрудникСНесколькимиКандидатами.ПриоритетКандидата = ПриоритетКандидата;
				ИндексКандидата = ИндексКандидата - 1;
				// Запоминаем лучшие приоритеты кандидатов для сотрудников
				ЛучшийПриоритетКандидата = ЛучшийПриоритетКандидатов.Получить(СотрудникСНесколькимиКандидатами.Кандидат);
				Если ЛучшийПриоритетКандидата = Неопределено Или ЛучшийПриоритетКандидата > ПриоритетКандидата Тогда
					ЛучшийПриоритетКандидатов.Вставить(СотрудникСНесколькимиКандидатами.Кандидат, ПриоритетКандидата);
				КонецЕсли;
			КонецЦикла;
			ОбходПоКандидатам.Сбросить();
		КонецЦикла;
	КонецЦикла;
	
	// Если остались неоднозначные связи, сортируем и отбираем приоритетных кандидатов
	Если СотрудникиСНесколькимиКандидатами.Количество() <> 0 Тогда
		СотрудникиСНесколькимиКандидатами.Сортировать(
			"ФизическоеЛицо,
			|КандидатовПоСотруднику,
			|Сотрудник,
			|ПриоритетКандидата,
			|ДатаУтверждения Убыв");
		ОставшиесяКандидаты = КандидатыФизическихЛиц.ВыгрузитьКолонку("Кандидат");
		Обход = Обработки.ОбходКоллекции.НовыйОбход(СотрудникиСНесколькимиКандидатами);
		Пока Обход.СледующийПоЗначениюПоля("Сотрудник") Цикл
			Пока Обход.Следующий() Цикл
				ТекущиеДанные = Обход.ТекущиеДанные();
				ИндексКандидата = ОставшиесяКандидаты.Найти(ТекущиеДанные.Кандидат);
				// Если это не лучший приоритет кандидата для сотрудника, берем следующего
				ЛучшийПриоритетКандидата = ЛучшийПриоритетКандидатов.Получить(ТекущиеДанные.Кандидат);
				Если ИндексКандидата <> Неопределено И ЛучшийПриоритетКандидата = ТекущиеДанные.ПриоритетКандидата Тогда
					Если Сотрудники.Найти(ТекущиеДанные.Сотрудник) <> Неопределено Тогда
						КандидатПоСотруднику = ПриоритетныеКандидатыПоСотрудникам.Добавить();
						ЗаполнитьЗначенияСвойств(КандидатПоСотруднику, ТекущиеДанные);
					КонецЕсли;
					ОставшиесяКандидаты.Удалить(ИндексКандидата);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПриоритетныеКандидатыПоСотрудникам;
	
КонецФункции

// Создает временную таблицу с кандидатами по сотрудникам.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//	Сотрудники - Массив, СправочникСсылка.Сотрудники - сотрудники, по которым необходимо найти кандидатов.
//	ИмяВТ - Строка - имя временной таблицы с кандидатами по сотрудникам.
//
Процедура СоздатьВТКандидатыПоСотрудникам(МенеджерВременныхТаблиц, Сотрудники, ИмяВТ ="ВТКандидатыПоСотрудникам") Экспорт
	КандидатыПоСотрудникам = КандидатыПоСотрудникам(Сотрудники);
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, КандидатыПоСотрудникам, ИмяВТ);
КонецПроцедуры

// Создает временную таблицу с кандидатами, которые приняты в указанном периоде.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//	НачалоПериода - Дата.
//	ОкончаниеПериода - Дата.
//
Процедура СоздатьВТПринятыеКандидаты(МенеджерВременныхТаблиц, НачалоПериода, ОкончаниеПериода) Экспорт
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыСотрудников.Отборы, "ДатаПриема", ">=", НачалоПериода);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыСотрудников.Отборы, "ДатаПриема", "<=", ОкончаниеПериода);
	
	УстановитьПривилегированныйРежим(Истина);
	Сотрудники = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	
	КандидатыПоСотрудникам = КандидатыПоСотрудникам(Сотрудники.ВыгрузитьКолонку("Сотрудник"));
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, КандидатыПоСотрудникам, "ВТПринятыеКандидаты");
	
КонецПроцедуры

// Создает временную таблицу с кандидатами, которые уволены в указанном периоде.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц.
//	НачалоПериода - Дата.
//	ОкончаниеПериода - Дата.
//
Процедура СоздатьВТУволенныеКандидаты(МенеджерВременныхТаблиц, НачалоПериода, ОкончаниеПериода) Экспорт
	
	ПараметрыСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыСотрудников.Отборы, "ДатаУвольнения", ">=", НачалоПериода);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыСотрудников.Отборы, "ДатаУвольнения", "<=", ОкончаниеПериода);
	
	УстановитьПривилегированныйРежим(Истина);
	Сотрудники = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыСотрудников);
	УстановитьПривилегированныйРежим(Ложь);
	
	КандидатыПоСотрудникам = КандидатыПоСотрудникам(Сотрудники.ВыгрузитьКолонку("Сотрудник"));
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, КандидатыПоСотрудникам, "ВТУволенныеКандидаты");
	
КонецПроцедуры

// Получает сотрудников по кандидатам на основании алгоритма, реализованного в КандидатыПоСотрудникам.
// 
// Параметры:
//  Кандидаты - Массив Из СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  Соответствие Из СправочникСсылка.Сотрудники
Функция СотрудникиПоКандидатам(Кандидаты) Экспорт
	
	ФизическиеЛицаКандидатов = Справочники.Кандидаты.ФизическиеЛицаКандидатов(Кандидаты);
	СотрудникиТаблица = КадровыйУчет.СотрудникиФизическихЛиц(
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияСоответствия(ФизическиеЛицаКандидатов));
	
	КандидатыПоСотрудникам = КандидатыПоСотрудникам(СотрудникиТаблица.ВыгрузитьКолонку("Сотрудник"));
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(КандидатыПоСотрудникам, "Кандидат");
	
	СотрудникиПоКандидатам = Новый Соответствие();
	Для Каждого Кандидат Из Кандидаты Цикл
		НайденныеСтроки = КандидатыПоСотрудникам.НайтиСтроки(Новый Структура("Кандидат", Кандидат));
		ОбщегоНазначенияКлиентСервер.Проверить(НайденныеСтроки.Количество() <= 1, 
			СтрШаблон(НСтр("ru = 'Получили более 1 записи с кандидатом %1 по сотрудникам'"), Кандидат), 
			"ПодборПерсонала.СотрудникиПоКандидатам");
		Если НайденныеСтроки.Количество() > 0 Тогда
			СотрудникиПоКандидатам.Вставить(Кандидат, НайденныеСтроки[0].Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СотрудникиПоКандидатам;
	
КонецФункции

#КонецОбласти

#Область Видеоконференции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Начало - Дата
//  Окончание - Дата
// 
// Возвращаемое значение:
//  Структура:
// * ЕстьПересечения - Булево -
// * Кандидат - Строка -
// * ЭтапРаботы - Строка -
// * Начало - Дата -
// * Окончание - Дата -
Функция ДанныеПересеченияВидеоконференций(УчетнаяЗапись, Начало, Окончание) Экспорт
	
	ДанныеПересечения = Новый Структура();
	ДанныеПересечения.Вставить("ЕстьПересечения", Ложь);
	ДанныеПересечения.Вставить("Кандидат", "");
	ДанныеПересечения.Вставить("ЭтапРаботы", "");
	ДанныеПересечения.Вставить("Начало", Дата(1, 1, 1));
	ДанныеПересечения.Вставить("Окончание", Дата(1, 1, 1));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(РаботаСКандидатами.Кандидат) КАК Кандидат,
	|	ПРЕДСТАВЛЕНИЕ(РаботаСКандидатами.ЭтапРаботы) КАК ЭтапРаботы,
	|	РаботаСКандидатами.Период КАК Начало,
	|	РаботаСКандидатами.ПериодОкончание КАК Окончание
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|ГДЕ
	|	РаботаСКандидатами.УчетнаяЗаписьВидеоконференции = &УчетнаяЗапись
	|	И (&НачалоПериода < РаботаСКандидатами.ПериодОкончание
	|	И &КонецПериода > РаботаСКандидатами.Период)";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("НачалоПериода", Начало);
	Запрос.УстановитьПараметр("КонецПериода", Окончание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПересечения, Выборка);
		ДанныеПересечения.ЕстьПересечения = Истина;
	КонецЕсли;
	
	Возврат ДанныеПересечения;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Кандидат - СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  Массив Из Строка - Массив из идентификаторов видеоконференций
Функция ВидеоконференцииПоКандидату(УчетнаяЗапись, Кандидат) Экспорт
	
	ВидеоконференцииПоКандидату = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботаСКандидатами.ИдентификаторВидеоконференции КАК Идентификатор
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|ГДЕ
	|	РаботаСКандидатами.Кандидат = &Кандидат
	|	И РаботаСКандидатами.УчетнаяЗаписьВидеоконференции = &УчетнаяЗапись
	|
	|УПОРЯДОЧИТЬ ПО
	|	РаботаСКандидатами.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Идентификатор) Тогда
			ВидеоконференцииПоКандидату.Добавить(Выборка.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВидеоконференцииПоКандидату;
	
КонецФункции

// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ОтменитьВидеоконференцииПоКандидату(Кандидат, УчетнаяЗапись, Идентификатор) Экспорт
	
	Результат = Истина;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РаботаСКандидатами");
		ЭлементБлокировки.УстановитьЗначение("Кандидат", Кандидат);
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.РаботаСКандидатами.СоздатьНаборЗаписей();
		Набор.Отбор.Кандидат.Установить(Кандидат);
		Набор.Прочитать();
		
		Для каждого Запись Из Набор Цикл
			Если Запись.УчетнаяЗаписьВидеоконференции = УчетнаяЗапись
				И Запись.ИдентификаторВидеоконференции = Идентификатор Тогда
				Запись.УчетнаяЗаписьВидеоконференции = Неопределено;
				Запись.ИдентификаторВидеоконференции = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
		Набор.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отмена видеоконференций по кандидату'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Возвращает таблицу значений с данными об образовании физического лица.
// 
// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Трудовая деятельность физ лица:
//   * УчебноеЗаведение - СправочникСсылка.УчебныеЗаведения
//   * ВидОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидПослевузовскогоОбразования - СправочникСсылка.ВидыОбразованияФизическихЛиц
//   * ВидДополнительногоОбучения - ПеречислениеСсылка.ВидыПрофессиональнойПодготовки
//   * Начало - Дата
//   * Окончание - Дата
//   * Квалификация - Строка
//   * Специальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию
//   * НаименованиеКурса - Строка
Функция ОбразованиеФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ФизическоеЛицоСсылка);
	
	Запрос.Выполнить();
	
	ОписаниеВТ = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц("ВТФизическиеЛицаПериоды");
	КадровыйУчет.СоздатьВТОбразованияФизическихЛиц(МенеджерВременныхТаблиц, Истина, ОписаниеВТ);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Образование.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Образование.ВидОбразования КАК ВидОбразования,
		|	Образование.ВидПослевузовскогоОбразования КАК ВидПослевузовскогоОбразования,
		|	Образование.ВидДополнительногоОбучения КАК ВидДополнительногоОбучения,
		|	Образование.Начало КАК Начало,
		|	Образование.Окончание КАК Окончание,
		|	Образование.Квалификация КАК Квалификация,
		|	Образование.Специальность КАК Специальность,
		|	Образование.НаименованиеКурса КАК НаименованиеКурса
		|ИЗ
		|	ВТОбразованияФизическихЛиц КАК Образование";

	Образование = Запрос.Выполнить().Выгрузить();
	
	Возврат Образование;
	
КонецФункции

// Возвращает таблицу значений с данными о трудовой деятельности физического лица.
// 
// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Трудовая деятельность физ лица:
//   * ДатаНачала - Дата
//   * ДатаОкончания - Дата
//   * Компания - Строка
//   * Должность - Строка
//   * Обязанности - Строка
//   * СфераДеятельностиКомпании - Строка
Функция ТрудоваяДеятельностьФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТФизическиеЛицаПериоды
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ФизическоеЛицоСсылка);
	
	Запрос.Выполнить();
	
	ОписаниеВТ = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц("ВТФизическиеЛицаПериоды");
	
	Запрос = КадровыйУчетРасширенный.ЗапросВТТрудоваяДеятельностьФизическихЛиц(Истина, ОписаниеВТ);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТрудоваяДеятельность.ДатаНачала КАК ДатаНачала,
		|	ТрудоваяДеятельность.ДатаОкончания КАК ДатаОкончания,
		|	ТрудоваяДеятельность.Организация КАК Компания,
		|	ТрудоваяДеятельность.Должность КАК Должность,
		|	ТрудоваяДеятельность.Обязанности КАК Обязанности,
		|	ТрудоваяДеятельность.СфераДеятельностиКомпании КАК СфераДеятельностиКомпании
		|ИЗ
		|	ВТТрудоваяДеятельностьФизическихЛиц КАК ТрудоваяДеятельность
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТрудоваяДеятельность.ДатаНачала";
	
	ТрудоваяДеятельность = Запрос.Выполнить().Выгрузить();
	
	Возврат ТрудоваяДеятельность;
	
КонецФункции

// Создает временную таблицу ВТЗадублированныеКандидаты в менеджере временных таблиц.
// 
// Параметры:
//  МенеджерВременныхТаблиц  - МенеджерВременныхТаблиц
Процедура СоздатьВТЗадублированныеКандидаты(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
		|ПОМЕСТИТЬ ВТОтборы
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	НЕ ЛичныеДанныеКандидатов.ПометкаУдаления";
		
	Запрос.Выполнить();
	
	ОписательВТЛичныеДанныеКандидатов = ОписательВременныхТаблицДляСоздатьВТЛичныеДанныеКандидатов(
		МенеджерВременныхТаблиц);
	СоздатьВТЛичныеДанныеКандидатов(ОписательВТЛичныеДанныеКандидатов, Истина);
	
	Запрос.Текст = ТекстЗапросаСоздатьВТЗадублированныеКандидаты();
		
	Запрос.УстановитьПараметр("ФИО", НСтр("ru='ФИО'"));
	Запрос.УстановитьПараметр("Телефон", НСтр("ru='Телефон'"));
	Запрос.УстановитьПараметр("EMail", НСтр("ru='E-mail'"));
	Запрос.УстановитьПараметр("ФизическоеЛицо", НСтр("ru='Физическое лицо'"));
	
	Запрос.Выполнить();
	
КонецПроцедуры

#Область ИнформацияОКандидате

// Возвращает ссылку на приоритетного кандидата.
// Используется для страницы "О кандидате" справочника "Сотрудники".
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники
// 
// Возвращаемое значение:
//  СправочникСсылка.Кандидаты, Неопределено - Кандидат сотрудника
Функция КандидатСотрудника(Сотрудник) Экспорт
	
	ТаблицаКандидатов = КандидатыПоСотрудникам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник));
	Если ТаблицаКандидатов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат ТаблицаКандидатов[0].Кандидат;
	
КонецФункции

// Определяет сотрудника по кандидату.
// 
// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники, Неопределено - Сотрудник кандидата
Функция СотрудникКандидата(Кандидат) Экспорт
	Возврат СотрудникиПоКандидатам(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат))[Кандидат];
КонецФункции

#КонецОбласти

// Формирует временную таблицу с откликами.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
// 	ИмяВТОтбора - Строка
// 	ИмяВТ - Строка
Процедура СоздатьВТОтклики(МенеджерВременныхТаблиц, ИмяВТОтбора = "ВТВакансииПоОтбору", ИмяВТ = "ВТОтклики") Экспорт
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТ) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВТОтбора) = Неопределено Тогда
		СоздатьВТВакансииПоОтбору(МенеджерВременныхТаблиц, Новый Структура());
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Кандидаты.Вакансия КАК Вакансия,
	|	РаботаСКандидатамиСрезПоследних.Кандидат КАК Кандидат,
	|	НЕ(РаботаСКандидатамиСрезПоследних.СостояниеЭтапа = ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован)
	|			И Кандидаты.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)) КАК Рассмотрен
	|ПОМЕСТИТЬ ВТОтклики
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами.СрезПоследних(, ЭтапРаботы = ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика)) КАК РаботаСКандидатамиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
	|		ПО РаботаСКандидатамиСрезПоследних.Кандидат = Кандидаты.Ссылка
	|ГДЕ
	|	Кандидаты.Вакансия В
	|			(ВЫБРАТЬ
	|				ВТВакансииПоОтбору.Вакансия
	|			ИЗ
	|				ВТВакансииПоОтбору)
	|	И НЕ Кандидаты.ПометкаУдаления";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТВакансииПоОтбору", ИмяВТОтбора);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "ВТОтклики", ИмяВТ);
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Возвращаемое значение:
//  Структура - Структура контактной информации:
// * Тип - ПеречислениеСсылка.ТипыКонтактнойИнформации -
// * Вид - СправочникСсылка.ВидыКонтактнойИнформации -
// * Представление - Строка -
Функция ОписаниеКонтактнойИнформации() Экспорт
	
	КонтактнаяИнформация = Новый Структура();
	КонтактнаяИнформация.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка());
	КонтактнаяИнформация.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	КонтактнаяИнформация.Вставить("Представление", "");
	
	Возврат КонтактнаяИнформация;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Отклик 	- Структура: См. ОписаниеОткликаНаВакансию
//  		- СтрокаТаблицыЗначений: См. РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов
//  Пользователь - Неопределено, СправочникСсылка.Пользователи -
Процедура СоздатьКандидатаПоДаннымОтклика(Вакансия, Отклик, Пользователь = Неопределено) Экспорт
	
	Рассмотрен =
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Отклик, "Рассмотрено") И Отклик.Рассмотрено;
	ЭтоОбновление =
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Отклик, "ЭтоОбновление") И Отклик.ЭтоОбновление;
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	ЗаполнитьЗначенияСвойств(ДанныеКандидата, Отклик);
	ДанныеКандидата.ИсточникИнформации = Отклик.Источник;
	
	ДанныеРезюме = Неопределено;
	
	Если ЗначениеЗаполнено(Отклик.АдресРезюме) И Не ЭтоОбновление Тогда
		ДанныеРезюме = РекрутинговыеСайты.ДанныеКандидатаССайта(Отклик.АдресРезюме, Пользователь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеРезюме) Тогда
		ДанныеКандидата = ДанныеРезюме;
	КонецЕсли;
	
	ДополнитьИнформациюПоДаннымОтклика(ДанныеКандидата, Отклик);
	
	ДанныеКандидата.Вакансия = Вакансия;
	ДанныеКандидата.Ответственный = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "Ответственный");
	ДанныеКандидата.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.Отклик;
	
	НачатьТранзакцию();
	
	Попытка
		КандидатОбъект = Справочники.Кандидаты.СоздатьЭлемент();
		
		КандидатОбъект.ДополнительныеСвойства.Вставить("ЭтоОтклик", Истина);
		Если Не ЗначениеЗаполнено(ДанныеКандидата.Фамилия) И Не ЗначениеЗаполнено(ДанныеКандидата.Имя)
			И Не ЗначениеЗаполнено(ДанныеКандидата.Отчество) Тогда
			КандидатОбъект.ДополнительныеСвойства.Вставить("ФИООтсутствует", Истина);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Отклик.ДатаОтклика) Тогда
			ДатаОтклика = Отклик.ДатаОтклика;
		Иначе
			ДатаОтклика = ТекущаяДатаСеанса();
		КонецЕсли;
		
		КандидатОбъект.Заполнить(ДанныеКандидата);
		КандидатОбъект.ДатаРегистрации = ДатаОтклика;
		КандидатОбъект.СопроводительноеПисьмо = Отклик.Сообщение;
		Если ЭтоОбновление И Рассмотрен Тогда
			КандидатОбъект.Состояние = Перечисления.СостоянияСогласования.Отклонено;
			КандидатОбъект.ДатаРешения = ДатаОтклика;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		
		КандидатОбъект.Записать();
		Кандидат = КандидатОбъект.Ссылка;
		
		УстановитьЭтапРассмотрениеОтклика(Кандидат, Рассмотрен, ЭтоОбновление);
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// См. НастройкиПрограммыПереопределяемый.НастройкиПользователейИПравПриСозданииНаСервере.
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	ПодборПерсоналаФормы.НастройкиПользователейИПравПриСозданииНаСервере(Форма);
	
КонецПроцедуры

// Добавляет предопределенные этапы работы с кандидатами в вакансии, профили должностей и регистр РаботаСКандидатами
// после переноса кандидатов из прошлых программ.
Процедура ДобавитьЭтапыРаботыСКандидатамиПослеПереноса() Экспорт
	
	ПараметрыОбновления = Новый Структура("ОбработкаЗавершена", Ложь);
	
	Пока Истина Цикл
		ДобавитьПредопределенныеЭтапыРаботыСКандидатами(ПараметрыОбновления);
		Если ПараметрыОбновления.ОбработкаЗавершена Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// См. РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИКандидатовПоКИФизическихЛиц
Функция ВидыКИКандидатовПоКИФизическихЛиц() Экспорт
	
	Возврат ПодборПерсоналаПовтИсп.ВидыКИКандидатовПоКИФизическихЛиц();
	
КонецФункции

// См. РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИФизическихЛицПоКИКандидатов
Функция ВидыКИФизическихЛицПоКИКандидатов() Экспорт
	
	Возврат ПодборПерсоналаПовтИсп.ВидыКИФизическихЛицПоКИКандидатов();
	
КонецФункции

// Параметры:
//  ПараметрыПоиска - Структура
Процедура ДополнитьПараметрыПоискаПохожихЛюдей(ПараметрыПоиска) Экспорт
	
	Если Не ПараметрыПоиска.Свойство("ИскатьСредиКандидатов") Тогда
		ПараметрыПоиска.Вставить("ИскатьСредиКандидатов", Истина);
	КонецЕсли;
	
КонецПроцедуры

// См. Справочники.ФизическиеЛица.ПослеОбъединенияДублей
Процедура ПослеОбъединенияДублейФизическихЛиц(ОставляемыйДубль, УдаляемыеДубли, ДополнительныеПараметры) Экспорт
	
	// Обновим состояние этапа приема на работу у кандидата, свзянного с физическим лицом.
	Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Параметры.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОставляемыйДубль);
	Параметры.КадровыеДанные = "ДатаПриема";
	
	СотрудникиДубля = КадровыйУчет.СотрудникиОрганизации(Истина, Параметры);
	Сотрудники = Новый Массив; // Массив из СправочникСсылка.Сотрудники
	
	Для Каждого СтрокаТаблицы Из СотрудникиДубля Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаПриема) Тогда
			Сотрудники.Добавить(СтрокаТаблицы.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	Если Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КандидатыПоСотрудникам = КандидатыПоСотрудникам(Сотрудники);
	
	Для Каждого СтрокаТаблицы Из КандидатыПоСотрудникам Цикл
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТаблицы.Кандидат);
		Результат.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу;
		Результат.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
		НайденнаяСтрока = СотрудникиДубля.Найти(СтрокаТаблицы.Сотрудник, "Сотрудник");
		Результат.ЭтапРаботы.Период = Перечисления.ЭтапыРаботыСКандидатами.УточнитьВремяЭтапа(
			Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу, НайденнаяСтрока.ДатаПриема);
		//@skip-check query-in-loop
		УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
	КонецЦикла;
	
КонецПроцедуры

// Описание типа личные данные кандидатов
Функция ОписаниеТипаВладельцаЛичныхДанных() Экспорт
	
	Возврат Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов");
	
КонецФункции

Функция ЕстьДоступККандидатам(ВидДоступа = "Чтение") Экспорт
	Возврат ПравоДоступа(ВидДоступа, Метаданные.Справочники.Кандидаты);
КонецФункции

Функция ЕстьДоступКЛичнымДаннымКандидата(ВидДоступа = "Чтение") Экспорт
	Возврат ПравоДоступа(ВидДоступа, Метаданные.Справочники.ЛичныеДанныеКандидатов);
КонецФункции

Функция ДанныеПрофиляДолжности(ПрофильДолжности) Экспорт
	Возврат Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(ПрофильДолжности);
КонецФункции

Функция ДанныеВакансии(Вакансия) Экспорт
	Возврат Справочники.Вакансии.ДанныеВакансии(Вакансия);
КонецФункции

Функция ДанныеКандидата(Кандидат) Экспорт

	Возврат Справочники.Кандидаты.ДанныеКандидата(Кандидат);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Справочники.Вакансии);
	СписокОбъектов.Добавить(Справочники.Кандидаты);
	СписокОбъектов.Добавить(Справочники.ПрофилиДолжностей);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаПодборПерсонала);
	СписокОбъектов.Добавить(Документы.РасходыНаИсточникИнформацииОКандидатах);
	СписокОбъектов.Добавить(Обработки.ПечатьДолжностнойИнструкции);
	
КонецПроцедуры

Функция СклонениеКандидата(Кандидат, Падеж) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ФизическоеЛицо,
		|	ЛичныеДанныеКандидатов.ФИО КАК ФИО,
		|	ЛичныеДанныеКандидатов.Фамилия КАК Фамилия,
		|	ЛичныеДанныеКандидатов.Имя КАК Имя,
		|	ЛичныеДанныеКандидатов.Отчество КАК Отчество,
		|	ЛичныеДанныеКандидатов.Инициалы КАК Инициалы,
		|	ЛичныеДанныеКандидатов.Пол КАК Пол
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО (Кандидаты.ЛичныеДанные = ЛичныеДанныеКандидатов.Ссылка)
		|		И (Кандидаты.Ссылка = &Кандидат)";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СклонениеКандидата = "";
	ФизическиеЛицаЗарплатаКадры.Просклонять(Выборка.ФИО, Падеж, СклонениеКандидата, Выборка.Пол, Выборка.ФизическоеЛицо);
	
	Возврат ФизическиеЛицаКлиентСервер.ФамилияИнициалы(СклонениеКандидата);
	
КонецФункции

Процедура УстановитьРешениеПоКандидатам(Кандидаты, РезультатВыбора) Экспорт
	
	// Все сопряженные действия выполняем целостно.
	НачатьТранзакцию();
	Попытка
		УстановитьСостояниеКандидатов(Кандидаты, РезультатВыбора);
		ЗакрытьВакансииКандидатов(Кандидаты, РезультатВыбора);
		ОтправитьСообщенияОПринятомРешении(РезультатВыбора);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если РезультатВыбора.ОбратнаяСвязьПоОтклику.Отправить Тогда
		РекрутинговыеСайты.ОтправитьОбратнуюСвязьПоОтклику(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьРешениеПоКандидатам(Кандидаты) Экспорт
	
	Для Каждого Кандидат Из Кандидаты Цикл
		Справочники.Кандидаты.УстановитьРешениеПоКандидату(Кандидат, Перечисления.СостоянияСогласования.Рассматривается);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСостояниеКандидатов(Кандидаты, РезультатВыбора)
	
	ДеталиРешения = РезультатВыбора.Решение;
	
	// Устанавливаем решение выбранным кандидатам.
	ПараметрыРешения = Справочники.Кандидаты.ДополнительныеПараметрыРешенияПоКандидату();
	ПараметрыРешения.КомментарийРешения = ДеталиРешения.Комментарий;
	ПараметрыРешения.ПричинаОтклонения = ДеталиРешения.Причина;
	ПараметрыРешения.ГруппаДоступаФизическогоЛица = РезультатВыбора.ГруппаДоступа;
	Для Каждого Кандидат Из Кандидаты Цикл
		Справочники.Кандидаты.УстановитьРешениеПоКандидату(Кандидат, ДеталиРешения.Решение, ДеталиРешения.ДатаРешения,
			ПараметрыРешения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗакрытьВакансииКандидатов(Кандидаты, РезультатВыбора)
	
	// Если указано - закрываем вакансию.
	Если РезультатВыбора.Вакансия.ЗакрыватьВакансию = Истина Тогда
		Вакансии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатВыбора.Вакансия.Вакансия);
		Справочники.Вакансии.ЗакрытьВакансии(Вакансии, РезультатВыбора.Вакансия.Дата);
	КонецЕсли;
	
	// Если указано - отклоняем других кандидатов.
	Если РезультатВыбора.ДругиеКандидаты.Отклонять = Истина Тогда
		Для Каждого СтрокаКоллекции Из РезультатВыбора.ДругиеКандидаты.Кандидаты Цикл
			ПараметрыРешения = Справочники.Кандидаты.ДополнительныеПараметрыРешенияПоКандидату();
			ПараметрыРешения.ПричинаОтклонения = СтрокаКоллекции.ПричинаОтклонения;
			Справочники.Кандидаты.УстановитьРешениеПоКандидату(
				СтрокаКоллекции.Кандидат, Перечисления.СостоянияСогласования.Отклонено, РезультатВыбора.ДругиеКандидаты.Дата, ПараметрыРешения);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьСообщенияОПринятомРешении(РезультатВыбора)
	
	Отказ = Ложь;
	
	Если РезультатВыбора.ПисьмоОдобрение.Написать = Истина Тогда
		Для Каждого Получатель Из РезультатВыбора.ПисьмоОдобрение.Получатели Цикл
			СформироватьСообщениеИОтправить(РезультатВыбора.ПисьмоОдобрение.Шаблон, Получатель, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	Если РезультатВыбора.СообщениеSMSОдобрение.Написать = Истина Тогда
		Для Каждого Получатель Из РезультатВыбора.СообщениеSMSОдобрение.Получатели Цикл
			СформироватьСообщениеИОтправить(РезультатВыбора.СообщениеSMSОдобрение.Шаблон, Получатель, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	Если РезультатВыбора.ПисьмоОтказ.Написать = Истина Тогда
		Для Каждого Получатель Из РезультатВыбора.ПисьмоОтказ.Получатели Цикл
			СформироватьСообщениеИОтправить(РезультатВыбора.ПисьмоОтказ.Шаблон, Получатель, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	Если РезультатВыбора.СообщениеSMSОтказ.Написать = Истина Тогда
		Для Каждого Получатель Из РезультатВыбора.СообщениеSMSОтказ.Получатели Цикл
			СформироватьСообщениеИОтправить(РезультатВыбора.СообщениеSMSОтказ.Шаблон, Получатель, Отказ);
		КонецЦикла;
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось отправить одно или несколько сообщений кандидатам'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеКандидатаДляСтрокиИсторииВзаимоотношений(СтрокаДанных)

	ПараметрыШаблона = Новый Структура(
		"Вакансия,
		|Подразделение,
		|Ответственный");
	ЗаполнитьЗначенияСвойств(ПараметрыШаблона, СтрокаДанных);
	Если ЗначениеЗаполнено(СтрокаДанных.ОтветственныйФизическоеЛицо) Тогда
		ПараметрыШаблона["Ответственный"] = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(
			Строка(СтрокаДанных.ОтветственныйФизическоеЛицо));
	КонецЕсли;

	Если Перечисления.СостоянияСогласования.РешениеПринято(СтрокаДанных.Состояние) Тогда
		ПараметрыШаблона.Вставить("ДатаРешения", Формат(СтрокаДанных.ДатаРешения, "ДЛФ=D;"));
		Если СтрокаДанных.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
			Шаблон = НСтр("ru = 'Кандидат отклонен [ДатаРешения] по вакансии «[Вакансия]», отв. [Ответственный]'");
			Если ЗначениеЗаполнено(СтрокаДанных.ПричинаОтклонения) Тогда
				Шаблон = Шаблон + " " + НСтр("ru = 'по причине «[Причина]»'");
				ПараметрыШаблона.Вставить("Причина", СтрокаДанных.ПричинаОтклонения);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаДанных.КомментарийРешения) Тогда
				Шаблон = Шаблон + ", " + НСтр("ru = 'с комментарием: «[КомментарийРешения]»'");
				ПараметрыШаблона.Вставить("КомментарийРешения", СтрокаДанных.КомментарийРешения);
			КонецЕсли;
		ИначеЕсли СтрокаДанных.Состояние = Перечисления.СостоянияСогласования.Согласовано Тогда
			Шаблон = НСтр("ru = 'Кандидат утвержден [ДатаРешения] на вакансию «[Вакансия]», отв. [Ответственный]'");
		КонецЕсли;
	Иначе
		ПараметрыШаблона.Вставить("ДатаРегистрации", Формат(СтрокаДанных.ДатаРегистрации, "ДЛФ=D;"));
		Шаблон = НСтр(
			"ru = 'Кандидат в работе на вакансию «[Вакансия]», поступил [ДатаРегистрации], отв. [Ответственный]'");
		Если Не ЗначениеЗаполнено(ПараметрыШаблона["Вакансия"]) Тогда
			Шаблон = НСтр(
				"ru = 'Кандидат в работе, подразделение «[Подразделение]», поступил [ДатаРегистрации], отв. [Ответственный]'");
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(Шаблон, ПараметрыШаблона);

КонецФункции

Процедура ЗаполнитьНаборЗначенийДоступаВзаимодействияСПредметомКандидатом(Объект, Таблица)
	
	Предмет = ?(Объект.ДополнительныеСвойства.Свойство("Предмет"), 
		Объект.ДополнительныеСвойства.Предмет, Взаимодействия.ПредметВзаимодействия(Объект.Ссылка));
	Если ТипЗнч(Предмет) <> Тип("СправочникСсылка.Кандидаты") Или Не ЗначениеЗаполнено(Предмет) Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.ЗаполнитьНаборыЗначенийДоступаПоУмолчанию(Объект, Таблица);

	НоваяТаблица = УправлениеДоступом.ТаблицаНаборыЗначенийДоступа();
	НоваяТаблица.Добавить().ЗначениеДоступа = Справочники.Кандидаты.ФизическоеЛицоКандидата(Предмет);

	УправлениеДоступом.ДобавитьНаборыЗначенийДоступа(Таблица, НоваяТаблица);
	
КонецПроцедуры

// Параметры:
// 	История - см. СотрудникиФормыРасширенный.ЗаполнитьИсториюВзаимоотношений.История
//  СтрокаДанных - СтрокаТаблицыЗначений
//  ИмяПоляОбъектВзаимоотношений - Строка - имя колонки таблицы сведений о кандидатах, значениями из которой будет
//    заполнена колонка ОбъектВзаимоотношений в таблице История.
Процедура ДобавитьСтрокуВИсториюВзаимоотношений(История, СтрокаДанных, ИмяПоляОбъектВзаимоотношений)
	
	НоваяСтрока = История.Добавить();
	НоваяСтрока.ОбъектВзаимоотношений = СтрокаДанных[ИмяПоляОбъектВзаимоотношений];
	НоваяСтрока.Ссылка = СтрокаДанных.Кандидат;
	НоваяСтрока.Кандидат = СтрокаДанных.Кандидат;
	НоваяСтрока.ЛичныеДанныеКандидата = СтрокаДанных.ЛичныеДанныеКандидата;
	НоваяСтрока.Роль = СотрудникиФормы.РолиФизическогоЛицаИсторииВзаимоотношений().Кандидат;
	НоваяСтрока.ГруппаРоли = СотрудникиФормы.РолиФизическогоЛицаИсторииВзаимоотношений().Кандидат;
	НоваяСтрока.ДатаАктуальности = СтрокаДанных.ДатаРегистрации;
	Если Перечисления.СостоянияСогласования.РешениеПринято(СтрокаДанных.Состояние) Тогда
		НоваяСтрока.ДатаАктуальности = СтрокаДанных.ДатаРешения;
	КонецЕсли;
	НоваяСтрока.Примечание = ОписаниеКандидатаДляСтрокиИсторииВзаимоотношений(СтрокаДанных);
	
КонецПроцедуры

#Область ПрофилиДоступа

Функция ИдентификаторПрофиляМенеджерПоНаборуПерсонала() 
	
	Возврат "31f07ebf-8960-4839-b4f3-36dbab7dc653";
	
КонецФункции

Функция ИдентификаторПрофиляСтаршийМенеджерПоНаборуПерсонала()
	
	Возврат "9ebace86-f46b-4b17-83e7-7ad23d437ec1";
	
КонецФункции

Функция ИдентификаторПрофиляСогласованиеЗаявокНаПодбор()
	
	Возврат "de541a41-cf4d-45e2-9e6f-88f34ab9a16b";
	
КонецФункции

Функция ОписаниеПрофиляМенеджерПоНаборуПерсонала(ПраваНаИнтерфейс = Ложь)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляМенеджерПоНаборуПерсонала();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по набору персонала'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ВыводНаПринтерФайлБуферОбмена");
	
	// Роли для доступа к функциональности других подсистем.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхОбОбразованииФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхСотрудниковРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЖурналаЗаявокСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеАрхиваФизическихЛиц", "ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеШтатногоРасписания");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеГрейдов", "ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраНачисленияУдержанияПоказатели");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеБезПросмотраПлановыхНачислений");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПВРНачисления");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровогоСостоянияРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПросмотрОхраныТрудаСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРабочихМестСотрудников", "ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНаправленийНаМедицинскийОсмотр", "ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРезультатовМедицинскихОсмотров", "ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВредныхФакторовВидовРаботРабочихМест", "ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеМероприятийАдаптацииУвольнения", "ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеРешенийПоКадровымИзменениям", "ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "КонтрольИсполненияМероприятийАдаптацииУвольнения", "ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗаписейРабочегоКалендаряСотрудников" ,"ЗарплатаКадрыКорпоративнаяПодсистемы.РабочийКалендарь");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеИспытательногоСрокаСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСостоянийСотрудников", "ЗарплатаКадрыРасширеннаяПодсистемы.КадровыйУчетРасширенная.СостоянияСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеКадровыхДокументовПоРешениям", "ЗарплатаКадрыКорпоративнаяПодсистемы.АдаптацияУвольнение");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПрофессийФизическихЛиц",			"ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСводныхДанныхФизическихЛиц",		"ЗарплатаКадрыПриложения.КадровыйУчет.СводныеДанныеФизическихЛиц");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСемейныхПоложенийФизическихЛиц",	"ЗарплатаКадрыПриложения.КадровыйУчет.СемейныеПоложенияФизическихЛиц");
	
	// Роли на общие объекты КОРП из подсистемы «характеристики персонала».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДействийСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеХарактеристикПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеКомпетенцийПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "УправлениеМероприятиемОценкиПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ХарактеристикиПерсонала");
	
	// Роли подсистемы «Подбор персонала».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПрофилейДолжности", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПрофилейДолжности", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВакансий", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВакансий", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЛичныхДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЛичныхДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЗаявокНаПодборПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеРасходовНаИсточникиИнформацииОКандидатах", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеКомментариевКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеПричинОткрытияВакансий", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСтепенейЗнанияЯзыкаКандидата", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНастроекВидовКонтактнойИнформацииКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСогласованияВакансий");
	
	// Роли подсистемы «Электронное интервью».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхЭлектронногоИнтервью", "ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеИнтервью");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхЭлектронногоИнтервью", "ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеИнтервью");
	
	// Роли подсистемы «Электронное тестирование кандидатов».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДанныхЭлектронногоТестированияКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеТестированиеКандидатов");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "БазовыеПраваЭлектронногоОбучения");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЭлектронныхКурсов");
	
	// Роли подсистемы «Анализ текучести персонала».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеТекучестиПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.АнализТекучестиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПричинУвольненияСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.АнализТекучестиПерсонала");
	
	// Роли подсистемы «Чатботы».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСообщенийЧатовЧатботов", "ЗарплатаКадрыКорпоративнаяПодсистемы.Чатботы");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВакансийЧатботов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	
	// Роли подсистемы «Бронирование помещений».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеБронированияПомещений", "ЗарплатаКадрыКорпоративнаяПодсистемы.БронированиеПомещений");
	
	// Анкетирование.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновАнкет", "СтандартныеПодсистемы.Анкетирование");
	
	// Взаимодействия
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВзаимодействий", "СтандартныеПодсистемы.Взаимодействия");
	
	// Интеграция видеоконференций
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеВидеоконференций", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.Видеособеседования");
	
	// Синхронизация календарей.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеСинхронизацииКалендарей", "ЗарплатаКадрыКорпоративнаяПодсистемы.РабочийКалендарь.СинхронизацияКалендарей");

	// Синхронизация с MS Exchange
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеСинхронизацииMSExchange", "ЗарплатаКадрыКорпоративнаяПодсистемы.СинхронизацияMSExchange");
	
	// Интеграция с рекрутинговыми сайтами.
	РекрутинговыеСайты.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	
	// Загрузка кандидатов из Интернета.
	ЗагрузкаКандидатовИзИнтернета.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);

	// Роли подсистемы «Разбор резюме».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеЗагрузкиКандидатовИзФайлов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.РазборРезюме");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеКлючейДоступаСервисаСемантическогоАнализа", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.РазборРезюме");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыКандидатов");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи");
	ОписаниеПрофиля.ВидыДоступа.Добавить("УчетныеЗаписиЭлектроннойПочты");
	
	// КонфигурацииЗарплатаКадрыРасширенный
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенный.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	// Конец КонфигурацииЗарплатаКадрыРасширенный
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ПраваНаИнтерфейс Тогда
		ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаПодборПерсонала");
	КонецЕсли;
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляСтаршийМенеджерПоНаборуПерсонала(ПраваНаИнтерфейс = Ложь)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСтаршийМенеджерПоНаборуПерсонала();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Старший менеджер по набору персонала'");
	
	ЗарплатаКадрыРасширенный.ДополнитьПрофиль(ОписаниеПрофиля, ОписаниеПрофиляМенеджерПоНаборуПерсонала(ПраваНаИнтерфейс));
	
	// Роли для доступа к функциональности других подсистем.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеНачисленийШтатногоРасписания");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеШтатногоРасписания");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеШаблоновСообщений");
	
	// Роли подсистемы «КадровыеРешения».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, 
		"НастройкаКадровыхРешений", "ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыеРешения");
	
	// Роли подсистемы «Подбор персонала».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИзменениеВакансииКандидата", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "НастройкаПодбораПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеРасходовНаИсточникиИнформацииОКандидатах", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПричинОткрытияВакансий", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСтепениЗнанияЯзыкаКандидата", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеНастроекВидовКонтактнойИнформацииКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеОбработкиОбъединениеДублейПерсональныхДанных", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ОбъединениеДублейЛичныхДанныхКандидатов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");	
	
	// Роли подсистемы «Электронное интервью».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "НастройкаЭлектронногоИнтервью", "ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеИнтервью");
	
	// Роли подсистемы «Анализ текучести персонала».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "НастройкаСоставаПричинУвольнения", "ЗарплатаКадрыКорпоративнаяПодсистемы.АнализТекучестиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеТекучестиПерсонала", "ЗарплатаКадрыКорпоративнаяПодсистемы.АнализТекучестиПерсонала");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеПричинУвольненияСотрудников", "ЗарплатаКадрыКорпоративнаяПодсистемы.АнализТекучестиПерсонала");
	
	// Роли подсистемы «Чатботы».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЧатботов", "ЗарплатаКадрыКорпоративнаяПодсистемы.Чатботы");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВакансийЧатботов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала");
	
	// Роли подсистемы «Бронирование помещений».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеТерриторийИПомещений");
	
	// Роли подсистемы «Разбор резюме».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеЗагрузкиКандидатовИзФайлов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.РазборРезюме");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеКлючейДоступаСервисаСемантическогоАнализа", "ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.РазборРезюме");
	
	// Роли подсистемы «Валюты».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеКурсовВалют");
	
	// Роли подсистемы «Контактная информация».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеВидовКонтактнойИнформации");
	
	// Роли подсистемы «Свойства».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	
	// Роли подсистемы «Защита персональных данных».
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля,"ЗащитаПерсональныхДанных", "ЗарплатаКадрыПодсистемы.ЗащитаПерсональныхДанных");
	
	// КонфигурацииЗарплатаКадрыРасширенный
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенный.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	// Конец КонфигурацииЗарплатаКадрыРасширенный
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляСогласованиеЗаявокНаПодбор()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСогласованиеЗаявокНаПодбор();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Согласование заявок на подбор персонала'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "СогласованиеЗаявокНаПодборПерсонала");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

#КонецОбласти

#Область ЭтапыРаботыСКандидатами

Функция ЗапросДанныеЭтапаРаботыСКандидатами(МенеджерВременныхТаблиц, Кандидаты, ЭтапРаботы)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Кандидаты.Ссылка КАК Кандидат,
	|	&ЭтапРаботы КАК ЭтапРаботы,
	|	ЕСТЬNULL(РаботаСКандидатами.Бронь, ЗНАЧЕНИЕ(Документ.Бронь.ПустаяСсылка)) КАК Бронь,
	|	ЕСТЬNULL(РаботаСКандидатами.Бронь.Помещение, ЗНАЧЕНИЕ(Справочник.ТерриторииИПомещения.ПустаяСсылка)) КАК Помещение,
	|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
	|	РаботаСКандидатами.Период КАК Период
	|ПОМЕСТИТЬ ВТТекущиеДанныеЭтапа
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|		ПО (РаботаСКандидатами.Кандидат = Кандидаты.Ссылка)
	|			И (РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы)
	|ГДЕ
	|	Кандидаты.Ссылка В(&Кандидаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеДанныеЭтапа.Кандидат КАК Кандидат,
	|	ТекущиеДанныеЭтапа.ЭтапРаботы КАК ЭтапРаботы,
	|	ТекущиеДанныеЭтапа.Бронь КАК Бронь,
	|	ТекущиеДанныеЭтапа.Помещение КАК Помещение,
	|	ТекущиеДанныеЭтапа.ПериодОкончание КАК ПериодОкончание,
	|	ТекущиеДанныеЭтапа.Период КАК Период
	|ИЗ
	|	ВТТекущиеДанныеЭтапа КАК ТекущиеДанныеЭтапа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТТекущиеДанныеЭтапа";
	
	Возврат Запрос;
	
КонецФункции

// Возвращает текущий этап работы кандидатов, если он одинаковый.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  ОпределяемыйТип.ЭтапРаботыСКандидатами
Функция ТекущийЭтапРаботыКандидатов(Кандидаты) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(Кандидаты.Количество() > 0, 
		НСтр("ru = 'Кандидаты не выбраны.'"), "ПодборПерсонала.ТекущийЭтапРаботыКандидатов");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("СостоянияРешениеПринято", Перечисления.СостоянияСогласования.СостоянияРешениеПринято());
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Ссылка В(&Кандидаты)
		|	И Кандидаты.Состояние В (&СостоянияРешениеПринято)";
	РезультатЗапроса = Запрос.Выполнить();
	
	// Проверяем, что все выбранные кандидаты пока рассматриваются.
	Если Не РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = НСтр("ru = 'По одному или нескольким кандидатам уже приняты решения (они одобрены или отклонены). 
                               |Планирование этапа для таких кандидатов недоступно.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗавершенныеСостояния", Перечисления.СостоянияЭтаповРаботыСКандидатами.Завершенные());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	ТекущиеЭтапы.ЭтапРаботы КАК ЭтапРаботы
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапы
		|		ПО (ТекущиеЭтапы.Кандидат = Кандидаты.Ссылка)
		|			И (ТекущиеЭтапы.Состояние НЕ В (&ЗавершенныеСостояния))
		|ГДЕ
		|	Кандидаты.Ссылка В(&Кандидаты)";
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	РезультатТаблица.Свернуть("ЭтапРаботы");

	// Проверяем, что вообще есть не завершенные этапы.
	ОбщегоНазначенияКлиентСервер.Проверить(РезультатТаблица.Количество() > 0, 
		НСтр("ru = 'Не удалось определить этап для планирования для кандидата. 
			 |Кандидаты должны находиться на этапе, который пока не пройден.'"));

	// Проверяем, что этап только один, то есть у всех одинаковый.
	ОбщегоНазначенияКлиентСервер.Проверить(РезультатТаблица.Количество() = 1, 
		НСтр("ru = 'Кандидаты находятся на разных этапах отбора. 
			 |Запланировать следующий этап можно только для кандидатов, находящихся на одинаковом этапе работы.'"));
	
	Возврат РезультатТаблица[0].ЭтапРаботы;
	
КонецФункции

// Возвращает следующие этапы работы с кандидатами.
// 
// Параметры:
//  Кандидаты - Массив из СправочникСсылка.Кандидаты
//  ТекущийЭтапРаботы - ОпределяемыйТип.ЭтапРаботыСКандидатами
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//	* Ключ - СправочникСсылка.Кандидаты
//	* Значение - ОпределяемыйТип.ЭтапРаботыСКандидатами
Функция СледующиеЭтапыРаботыСКандидатами(Кандидаты, ТекущийЭтапРаботы) Экспорт
	
	СледующиеЭтапы = Новый Соответствие();
	
	ТаблицаЭтапов = ТаблицаЭтаповРаботыСКандидатами(Кандидаты);
	ДобавитьЭтапыРаботыОтсутствующиеВВакансии(ТаблицаЭтапов, Кандидаты, Истина);
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ТаблицаЭтапов);
	Пока Обход.СледующийПоЗначениюПоля("Кандидат") Цикл
		НашлиТекущийЭтап = Ложь;
		НашлиСледующийЭтап = Ложь;
		Пока Обход.Следующий() Цикл
			Если НашлиТекущийЭтап Тогда
				НашлиСледующийЭтап = Истина;
				СледующиеЭтапы.Вставить(Обход.ТекущиеДанные().Кандидат, Обход.ТекущиеДанные().ЭтапРаботы);
				Прервать;
			КонецЕсли;
			Если Обход.ТекущиеДанные().ЭтапРаботы = ТекущийЭтапРаботы Тогда
				НашлиТекущийЭтап = Истина;
			КонецЕсли;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.Проверить(НашлиТекущийЭтап, 
			СтрШаблон(НСтр("ru = 'Для кандидата %1 не удалось найти этап %2'"), 
				Обход.ТекущиеДанные().Кандидат, ТекущийЭтапРаботы));
		ОбщегоНазначенияКлиентСервер.Проверить(НашлиСледующийЭтап, 
			СтрШаблон(НСтр("ru = 'Для кандидата %1 не удалось найти этап, следующий после %2'"), 
				Обход.ТекущиеДанные().Кандидат, ТекущийЭтапРаботы));
	КонецЦикла;
	
	Возврат СледующиеЭтапы;
	
КонецФункции

Процедура ПроверитьВозможностьУстановкиЭтапаРаботы(Кандидаты, ЭтапРаботы, Период, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК ЭтапНаВыбраннуюДату
		|		ПО (ЭтапНаВыбраннуюДату.Кандидат = Кандидаты.Ссылка)
		|			И (ЭтапНаВыбраннуюДату.Период = &Период)
		|			И (ЭтапНаВыбраннуюДату.ЭтапРаботы <> &ЭтапРаботы)
		|ГДЕ
		|	Кандидаты.Ссылка В(&Кандидаты)";
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Если Не РезультатЗапроса.Пустой() Тогда
		Если Кандидаты.Количество() = 1 Тогда
			ФормулировкаКандидата = НСтр("ru = 'кандидата'");
		Иначе
			ФормулировкаКандидата = НСтр("ru = 'одного или нескольких кандидатов'");
		КонецЕсли;
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для %1 на выбранные дату и время уже зарегистрирован этап работы.
                  |Попробуйте выбрать другие дату или время.'"), 
			ФормулировкаКандидата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СменитьЭтапРаботыКандидата(Кандидат, ЭтапРаботы, ПрежниеДанныеЭтапа, ДополнительныеПараметры)
	
	Участники = ДополнительныеПараметры.Участники;
	ОбязательныеУчастники = ДополнительныеПараметры.ОбязательныеУчастники;
	Напоминание = ДополнительныеПараметры.Напоминание;
	Письмо = ДополнительныеПараметры.Письмо;
	СообщениеSMS = ДополнительныеПараметры.СообщениеSMS;
	
	// Записать этап работы с кандидатом.
	УстановитьСостояниеЭтапаРаботыКандидата(Кандидат, ЭтапРаботы, ПрежниеДанныеЭтапа);
	
	РаботаСРабочимКалендаремБЗК.ОбновитьЗаписиКалендаряПоЭтапуРаботыСКандидатом(Кандидат, ЭтапРаботы, Участники, 
		ПрежниеДанныеЭтапа, ОбязательныеУчастники);
	
	// Установить/снять напоминание.
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 в %2 запланирован этап «%3» для кандидата %4.'"),
		Формат(Напоминание.Период, "ДЛФ=D"),
		Формат(Напоминание.Период, "ДФ=ЧЧ:мм"),
		ЭтапРаботы.Этап, 
		Кандидат);
	
	УстановитьНапоминание(
		Напоминание.Напоминать, Напоминание.Период, Напоминание.ИнтервалВремени, Кандидат, ТекстСообщения, ПрежниеДанныеЭтапа.Период);
	
	Отказ = Ложь;
	
	// Написать письма и SMS.
	Если Письмо.Написать Тогда
		СформироватьСообщениеИОтправить(Письмо.Шаблон, Кандидат, Отказ);
	КонецЕсли;
	
	Если СообщениеSMS.Написать Тогда
		СформироватьСообщениеИОтправить(СообщениеSMS.Шаблон, Кандидат, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось отправить одно или несколько сообщений кандидатам'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

// Обновить текущий этап работы кандидатов.
// 
// Параметры:
//  КандидатыМассив - Массив Из СправочникСсылка.Кандидаты
//  ЭтоОбновлениеИБ - Булево - признак того, что метод вызван из обработчика обновления ИБ
Процедура ОбновитьТекущийЭтапРаботыКандидатов(КандидатыМассив, ЭтоОбновлениеИБ = Ложь) Экспорт
	
	Если КандидатыМассив.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Составить актуальную таблицу работы с кандидатами.
	ТаблицаЭтапов = ТаблицаЭтаповРаботыСКандидатами(КандидатыМассив);
	ДобавитьЭтапыРаботыОтсутствующиеВВакансии(ТаблицаЭтапов, КандидатыМассив, Истина);
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(КандидатыМассив);
	//@skip-warning
	ОрганизацииПозиций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ДанныеКандидатов.ВыгрузитьКолонку("Позиция"), "Владелец");
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаЭтапов, "Кандидат");
	
	Для Каждого ВыборкаКандидатов Из ДанныеКандидатов Цикл
		НаборЗаписей = РегистрыСведений.ТекущиеЭтапыРаботыСКандидатами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Кандидат.Установить(ВыборкаКандидатов.Кандидат);
		ОтборСтрок = Новый Структура("Кандидат");
		ОтборСтрок.Кандидат = ВыборкаКандидатов.Кандидат;
		СтрокиКандидата = ТаблицаЭтапов.Скопировать(ОтборСтрок);
		Если СтрокиКандидата.Количество() > 0 Тогда
			ТекущийЭтап = ТекущийЭтапРаботыСКандидатом(СтрокиКандидата, ВыборкаКандидатов.Состояние);
			Если ТекущийЭтап <> Неопределено Тогда
				НоваяСтрока = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаКандидатов);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущийЭтап);
				НоваяСтрока.Состояние = ТекущийЭтап.СостояниеЭтапа;
				НоваяСтрока.Организация = ОрганизацииПозиций[ВыборкаКандидатов.Позиция];
			КонецЕсли;
		КонецЕсли;
		Если ЭтоОбновлениеИБ Тогда
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		Иначе
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаЭтаповРаботыСКандидатомНаВакансию(Кандидат, Вакансия) Экспорт
	
	ТаблицаЭтапов = ТаблицаЭтаповРаботыСКандидатами(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат), Вакансия);
	ДобавитьЭтапыРаботыОтсутствующиеВВакансии(ТаблицаЭтапов, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат));
	
	Возврат ТаблицаЭтапов;
	
КонецФункции

// Таблица этапов работы с кандидатами.
// 
// Параметры:
//  Кандидаты - Массив Из СправочникСсылка.Кандидаты
//  Вакансия - Неопределено, СправочникСсылка.Вакансии - если не указано, то используется вакансия каждого кандидата.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаЭтаповРаботыСКандидатами()
Функция ТаблицаЭтаповРаботыСКандидатами(Кандидаты, Вакансия = Неопределено)
	
	Вакансии = ?(Вакансия <> Неопределено, 
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вакансия), 
		Справочники.Кандидаты.ДанныеКандидатов(Кандидаты).ВыгрузитьКолонку("Вакансия"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	ЕСТЬNULL(РаботаСКандидатами.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВремя,
		|	ЭтапыРаботыВакансии.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ЭтапыРаботыВакансии.ЭтапРаботы, ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.ПустаяСсылка)) КАК ЭтапРаботы,
		|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
		|	РаботаСКандидатами.Организатор КАК Организатор,
		|	ЕСТЬNULL(РаботаСКандидатами.ШаблонАнкеты, ЭтапыРаботыВакансии.ШаблонАнкеты) КАК ШаблонАнкеты,
		|	РаботаСКандидатами.ПричинаОтклонения КАК ПричинаОтклонения,
		|	ЕСТЬNULL(РаботаСКандидатами.Комментарий, ЭтапыРаботыВакансии.Комментарий) КАК Комментарий,
		|	ЕСТЬNULL(РаботаСКандидатами.ПериодОкончание, ДАТАВРЕМЯ(1, 1, 1)) КАК ПериодОкончание,
		|	РаботаСКандидатами.УчетнаяЗаписьВидеоконференции КАК УчетнаяЗаписьВидеоконференции,
		|	РаботаСКандидатами.ИдентификаторВидеоконференции КАК ИдентификаторВидеоконференции,
		|	РаботаСКандидатами.Бронь КАК Бронь,
		|	РаботаСКандидатами.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыРаботыВакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО (ЭтапыРаботыВакансии.Ссылка = Кандидаты.Вакансия)
		|			И (Кандидаты.Ссылка В (&Кандидаты))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО (РаботаСКандидатами.ЭтапРаботы = ЭтапыРаботыВакансии.ЭтапРаботы)
		|			И (РаботаСКандидатами.Кандидат = Кандидаты.Ссылка)
		|ГДЕ
		|	ЭтапыРаботыВакансии.Ссылка В(&Вакансии)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидат,
		|	НомерСтроки";
		
	
	ТаблицаЭтапов = НоваяТаблицаЭтаповРаботыСКандидатами();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЭтапов.Добавить(), Выборка);
	КонецЦикла;

	Возврат ТаблицаЭтапов;
	
КонецФункции

// Новая таблица этапов работы с кандидатами.
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция НоваяТаблицаЭтаповРаботыСКандидатами()

	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	Таблица.Колонки.Добавить("ДатаВремя", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(9));
	Таблица.Колонки.Добавить("ЭтапРаботы", Метаданные.ОпределяемыеТипы.ЭтапРаботыСКандидатами.Тип);
	Таблица.Колонки.Добавить("СостояниеЭтапа", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами"));
	Таблица.Колонки.Добавить("Организатор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Таблица.Колонки.Добавить("ШаблонАнкеты", Новый ОписаниеТипов("СправочникСсылка.ШаблоныАнкет, СправочникСсылка.ЭлектронныеКурсы"));
	Таблица.Колонки.Добавить("ПричинаОтклонения", Новый ОписаниеТипов("СправочникСсылка.ПричиныОтклоненияКандидатов"));
	Таблица.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Таблица.Колонки.Добавить("ПериодОкончание", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("Бронь", Новый ОписаниеТипов("ДокументСсылка.Бронь"));
	Таблица.Колонки.Добавить("УчетнаяЗаписьВидеоконференции", Новый ОписаниеТипов("СправочникСсылка.УчетныеЗаписиВидеоконференций"));
	Таблица.Колонки.Добавить("ИдентификаторВидеоконференции", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ДокументОснование", Новый ОписаниеТипов(ТипыДокументовОснованияРаботыСКандидатами()));
	
	Возврат Таблица;
	
КонецФункции

Функция ТипыДокументовОснованияРаботыСКандидатами()
	
	Типы = Новый Массив();
	Типы.Добавить(Тип("ДокументСсылка." + Метаданные.Документы.РешениеОПриемеНаРаботу.Имя));
	Типы.Добавить(Тип("ДокументСсылка." + Метаданные.Документы.ПриемНаРаботу.Имя));
	Типы.Добавить(Тип("ДокументСсылка." + Метаданные.Документы.ПриемНаРаботуСписком.Имя));
	Возврат Типы;
	
КонецФункции

Процедура ДобавитьЭтапыРаботыОтсутствующиеВВакансии(ТаблицаЭтапов, Кандидаты, ТолькоРассмотрениеОтклика = Ложь)
	
	// Выборка этапов, отмеченных у кандидатов, но отсутствующих в таблице этапов вакансии.
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботаСКандидатами.Кандидат КАК Кандидат,
		|	РаботаСКандидатами.Период КАК ДатаВремя,
		|	РаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
		|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
		|	РаботаСКандидатами.Организатор КАК Организатор,
		|	РаботаСКандидатами.Комментарий КАК Комментарий,
		|	РаботаСКандидатами.ШаблонАнкеты КАК ШаблонАнкеты,
		|	РаботаСКандидатами.ПричинаОтклонения КАК ПричинаОтклонения,
		|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
		|	РаботаСКандидатами.Бронь КАК Бронь,
		|	РаботаСКандидатами.УчетнаяЗаписьВидеоконференции КАК УчетнаяЗаписьВидеоконференции,
		|	РаботаСКандидатами.ИдентификаторВидеоконференции КАК ИдентификаторВидеоконференции,
		|	РаботаСКандидатами.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО (Кандидаты.Ссылка = РаботаСКандидатами.Кандидат)
		|		И Кандидаты.Ссылка В (&Кандидаты) И &УсловиеТолькоРассмотрениеОтклика
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыРаботыВакансии
		|		ПО РаботаСКандидатами.ЭтапРаботы = ЭтапыРаботыВакансии.ЭтапРаботы
		|			И (Кандидаты.Вакансия = ЭтапыРаботыВакансии.Ссылка)
		|ГДЕ
		|	ЭтапыРаботыВакансии.ЭтапРаботы ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	РаботаСКандидатами.Кандидат,
		|	РаботаСКандидатами.Период";
	
	ТекстУсловия = ?(ТолькоРассмотрениеОтклика,
		"РаботаСКандидатами.ЭтапРаботы = ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика)",
		"ИСТИНА");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеТолькоРассмотрениеОтклика", ТекстУсловия);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаЭтапов, "Кандидат");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		ОтборСтрок = Новый Структура("Кандидат");
		ОтборСтрок.Кандидат = Выборка.Кандидат;
		СтрокиКандидата = ТаблицаЭтапов.НайтиСтроки(ОтборСтрок);
		Пока Выборка.Следующий() Цикл
			Если СтрокиКандидата.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаЭтапов.Добавить();
			Иначе
				Для Каждого СтрокаКандидата Из СтрокиКандидата Цикл
					Если Выборка.ДатаВремя < СтрокаКандидата.ДатаВремя 
						Или Не ЗначениеЗаполнено(СтрокаКандидата.ДатаВремя) Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				МестоВставки = ТаблицаЭтапов.Индекс(СтрокаКандидата);
				НоваяСтрока = ТаблицаЭтапов.Вставить(МестоВставки);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекущийЭтапРаботыСКандидатом(РаботаСКандидатом, СостояниеКандидата) Экспорт
	
	ТекущийЭтап = Неопределено;
	ЗавершенныйЭтап = Неопределено;
	ЗапланированныеЭтапы = Новый Массив();

	Индекс = РаботаСКандидатом.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТаблицы = РаботаСКандидатом[Индекс];
		Если СтрокаТаблицы.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
			ЗапланированныеЭтапы.Добавить(СтрокаТаблицы);
		КонецЕсли;
		Если СтрокаТаблицы.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден
			Или СтрокаТаблицы.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
			
			Если СтрокаТаблицы.ЭтапРаботы <> Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика Тогда
				ЗавершенныйЭтап = СтрокаТаблицы;
				Прервать;
			КонецЕсли;
			
		Иначе
			ТекущийЭтап = СтрокаТаблицы;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ЗапланированныеЭтапы.Количество() > 0 Тогда
		// Если первым с конца встретился запланированный этап, то он и есть текущий во всех случаях.
		Если ЗапланированныеЭтапы.Количество() = 1 Тогда
			Возврат ЗапланированныеЭтапы[0];
		КонецЕсли;
		// Если запланировано несколько этапов, выбираем тот, у которого раньше дата назначена.
		ДатаЭтапа = Дата(3999, 12, 31);
		Этап = Неопределено;
		Для Каждого СтрокаТаблицы Из ЗапланированныеЭтапы Цикл
			Если СтрокаТаблицы.ДатаВремя <= ДатаЭтапа Тогда
				ДатаЭтапа = СтрокаТаблицы.ДатаВремя;
				Этап = СтрокаТаблицы;
			КонецЕсли;
		КонецЦикла;
		Возврат Этап;
	КонецЕсли;
	
	Если СостояниеКандидата = Перечисления.СостоянияСогласования.Отклонено Тогда
		Возврат ЗавершенныйЭтап;
	КонецЕсли;
	
	Если ТекущийЭтап = Неопределено Тогда
		// Последний этап завершен или пропущен или нет этапов вообще.
		ТекущийЭтап = ЗавершенныйЭтап;
		Если РаботаСКандидатом.Количество() > 0 Тогда
			// Если все же этапы были, и пройден (пропущен) последний из них, 
			// устанавливаем специальный предопределенный этап.
			КопияЭтапа = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
				РегистрыСведений.РаботаСКандидатами.СоздатьМенеджерЗаписи(), 
				Метаданные.РегистрыСведений.РаботаСКандидатами);
			КопияЭтапа.Кандидат = ТекущийЭтап.Кандидат;
			КопияЭтапа.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена;
			КопияЭтапа.Период = ТекущийЭтап.ДатаВремя;
			Возврат КопияЭтапа;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТекущийЭтап;
	
КонецФункции

Процедура УстановитьНапоминание(Напоминать, Период, ИнтервалВремени, Кандидат, ТекстСообщения, ПрежнийПериод = Неопределено)
	
	Если ЗначениеЗаполнено(ПрежнийПериод) Тогда
		// Снимаем возможное напоминание.
		ОписаниеНапоминания = НапоминанияПользователяКлиентСервер.ОписаниеНапоминания();
		ОписаниеНапоминания.Пользователь = Пользователи.ТекущийПользователь();
		ОписаниеНапоминания.ВремяСобытия = ПрежнийПериод;
		ОписаниеНапоминания.Источник = Кандидат;
		НапоминанияПользователяСлужебный.ОтключитьНапоминание(ОписаниеНапоминания);
	КонецЕсли;	
	
	Если Не Напоминать Тогда
		Возврат;
	КонецЕсли;
	
	НапоминанияПользователяСлужебный.ПодключитьПроизвольноеНапоминание(
		ТекстСообщения, Период, ИнтервалВремени, Кандидат);
	
КонецПроцедуры

Процедура ЗаполнитьВакансииКандидатов(Кандидаты, Вакансии) Экспорт
	Вакансии = ОбщегоНазначения.ВыгрузитьКолонку(ВакансииКандидатов(Кандидаты), "Значение");
КонецПроцедуры

Функция ВакансииКандидатов(Кандидаты) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты, "Вакансия", Истина);
КонецФункции

Функция ВсеУчастникиЭтапаРаботыСКандидатами(Кандидаты, ЭтапРаботы)
	
	Участники = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботаСКандидатами.Организатор КАК Участник
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|ГДЕ
	|	РаботаСКандидатами.Кандидат В(&Кандидаты)
	|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчастникиЭтапаРаботыСКандидатом.Участник
	|ИЗ
	|	РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|ГДЕ
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат В(&Кандидаты)
	|	И УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы = &ЭтапРаботы");
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Участники;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Участник");
	
КонецФункции

// Добавить предопределенные этапы, которые действуют, но отсутствуют в переданной таблице.
// 
// Параметры:
//  ЭтапыРаботыСКандидатами - ТабличнаяЧасть: см. Справочник.Вакансии.ЭтапыРаботыСКандидатами
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами
Функция ДобавитьДействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами) Экспорт
	
	ДобавленныеЭтапы = Новый Массив();
	
	СуществующиеЭтапы = Новый Соответствие();

	ДействующиеЭтапы = Перечисления.ЭтапыРаботыСКандидатами.Действующие();
	Сведения = Перечисления.ЭтапыРаботыСКандидатами.СведенияОбЭтапах(ДействующиеЭтапы);
	
	Индекс = ДействующиеЭтапы.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ЭтапРаботы = ДействующиеЭтапы[Индекс];
		НайденныеСтроки = ЭтапыРаботыСКандидатами.НайтиСтроки(Новый Структура("ЭтапРаботы", ЭтапРаботы));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Нашли = Ложь;
			Если Сведения[ЭтапРаботы].СтрогоПоследовательный Тогда
				ВПоследовательности = Сведения[ЭтапРаботы].Последовательность.Найти(ЭтапРаботы);
				Выше = ВПоследовательности - 1;
				Пока (Выше >= 0) Цикл
					ВышеЭтап = Сведения[ЭтапРаботы].Последовательность[Выше];
					Найдены = ЭтапыРаботыСКандидатами.НайтиСтроки(Новый Структура("ЭтапРаботы", ВышеЭтап));
					Если Найдены.Количество() > 0 Тогда
						МестоВставки = ЭтапыРаботыСКандидатами.Индекс(Найдены[0]) + 1;
						Если МестоВставки = ЭтапыРаботыСКандидатами.Количество() Тогда
							НоваяСтрока = ЭтапыРаботыСКандидатами.Добавить();
						Иначе
							НоваяСтрока = ЭтапыРаботыСКандидатами.Вставить(МестоВставки);
						КонецЕсли;
						Нашли = Истина;
						Прервать;
					КонецЕсли;
					Выше = Выше - 1;
				КонецЦикла;
				Если Не Нашли Тогда
					Ниже = ВПоследовательности + 1;
					Пока (Ниже < Сведения[ЭтапРаботы].Последовательность.Количество()) Цикл
						НижеЭтап = Сведения[ЭтапРаботы].Последовательность[Ниже];
						Найдены = ЭтапыРаботыСКандидатами.НайтиСтроки(Новый Структура("ЭтапРаботы", НижеЭтап));
						Если Найдены.Количество() > 0 Тогда
							МестоВставки = ЭтапыРаботыСКандидатами.Индекс(Найдены[0]);
							НоваяСтрока = ЭтапыРаботыСКандидатами.Вставить(МестоВставки);
							Нашли = Истина;
							Прервать;
						КонецЕсли;
						Ниже = Ниже + 1;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			Если Не Нашли Тогда
				Если Индекс = ДействующиеЭтапы.Количество() - 1 Тогда
					НоваяСтрока = ЭтапыРаботыСКандидатами.Добавить();
				Иначе
					НоваяСтрока = ЭтапыРаботыСКандидатами.Вставить(СуществующиеЭтапы.Получить(ДействующиеЭтапы[Индекс + 1]));
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.ЭтапРаботы = ЭтапРаботы;
			ДобавленныеЭтапы.Добавить(ЭтапРаботы);
			СуществующиеЭтапы.Вставить(ЭтапРаботы, ЭтапыРаботыСКандидатами.Индекс(НоваяСтрока));
		Иначе
			СуществующиеЭтапы.Вставить(ЭтапРаботы, ЭтапыРаботыСКандидатами.Индекс(НайденныеСтроки[0]));
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ДобавленныеЭтапы;
	
КонецФункции

// Удаляет предопределенные этапы, которые есть в таблице, но на данный момент уже не действуют.
// 
// Параметры:
//  ЭтапыРаботыСКандидатами - ТабличнаяЧасть: см. Справочник.Вакансии.ЭтапыРаботыСКандидатами
// 
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами
Функция УдалитьНедействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами) Экспорт

	УдаленныеЭтапы = Новый Массив();
	
	ВсеЭтапы = Перечисления.ЭтапыРаботыСКандидатами.ВсеЭтапы();
	ДействующиеЭтапы = Перечисления.ЭтапыРаботыСКандидатами.Действующие();
	
	Индекс = 0;
	Пока Индекс < ЭтапыРаботыСКандидатами.Количество() Цикл
		Если ВсеЭтапы.Найти(ЭтапыРаботыСКандидатами[Индекс].ЭтапРаботы) <> Неопределено 
			И ДействующиеЭтапы.Найти(ЭтапыРаботыСКандидатами[Индекс].ЭтапРаботы) = Неопределено Тогда
			УдаленныеЭтапы.Добавить(ЭтапыРаботыСКандидатами[Индекс].ЭтапРаботы);
			ЭтапыРаботыСКандидатами.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат УдаленныеЭтапы;
	
КонецФункции

Процедура УстановитьЭтапРассмотрениеОтклика(Кандидат, Рассмотрен, ЭтоОбновление = Ложь)

	ЭтапРаботы = ПодборПерсоналаКлиентСервер.ОписаниеЭтапаРаботыСКандидатом();
	ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика;
	ЭтапРаботы.Состояние = ?(Рассмотрен,
		Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден,
		Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован);
	ЭтапРаботы.Период = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ДатаРегистрации");
	
	УстановитьСостояниеЭтапаРаботыКандидата(
		Кандидат, ЭтапРаботы, Справочники.ЭтапыРаботыСКандидатами.СтруктураДанныхПланированияЭтапа());

КонецПроцедуры

#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ПодборПерсонала) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ПодборПерсонала, НСтр("ru = 'Отчеты по подбору персонала'"));
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СтатистикаПодбораПерсонала);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаПодбораПерсонала, "СтатистикаПодбораПерсонала");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьПодборПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатистикаПодбораПерсонала, "ПоказателиЭффективностиПодбора");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьПодборПерсонала");
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ЭффективностьИсточниковИнформацииОКандидатах);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.МассовыйНаборПерсонала);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.Кандидаты);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ВоронкаПодбораПерсонала);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.Вакансии);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.КандидатыПоЗаявкам);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ИспытательныйСрокКандидатов);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОткликиКандидатов);
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

Функция ШаблоныСообщенийКандидатов(Отбор = Неопределено) Экспорт
	
	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ТекстУсловия = "";
	Для Каждого КлючИЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Если Не ПустаяСтрока(ТекстУсловия) Тогда
			ТекстУсловия = ТекстУсловия + " И ";
		КонецЕсли;
		ТекстУсловия = ТекстУсловия + КлючИЗначение.Ключ + " = &" + КлючИЗначение.Ключ;
	КонецЦикла;
	Если ПустаяСтрока(ТекстУсловия) Тогда
		ТекстУсловия = "ИСТИНА";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИмяТипаПараметра", Метаданные.Справочники.Кандидаты.ПолноеИмя());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ШаблоныСообщений.Ссылка КАК Ссылка,
		|	ШаблоныСообщений.Код КАК Код,
		|	ШаблоныСообщений.Наименование КАК Наименование,
		|	ШаблоныСообщений.ПредназначенДляSMS КАК SMS,
		|	ШаблоныСообщений.ПредназначенДляЭлектронныхПисем КАК Email
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании = &ИмяТипаПараметра
		|	И НЕ ШаблоныСообщений.ПометкаУдаления
		|	И &ТекстУсловия
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловия", ТекстУсловия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СформироватьСообщениеИОтправить(Шаблон, Предмет, Отказ, ДополнительныеПараметры = Неопределено)
	
	РезультатОтправки = ШаблоныСообщений.СформироватьСообщениеИОтправить(Шаблон, Предмет, Новый УникальныйИдентификатор, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(РезультатОтправки.ОписаниеОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(РезультатОтправки.ОписаниеОшибки, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ПолучитьНастройкиПрограммы(НастройкиПриложения) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПриложения.Вставить("ИспользоватьПодборПерсонала", Константы.ИспользоватьПодборПерсонала.Получить());
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Константы.ИспользоватьПодборПерсонала.Установить(Параметры.ИспользоватьПодборПерсонала);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаСообщений

Функция ТекстВHTML(Текст) Экспорт
	
	ДокументHTML = Новый ДокументHTML;
	
	ЭлементТело = ДокументHTML.СоздатьЭлемент("body");
	ДокументHTML.Тело = ЭлементТело;
	
	Для НомерСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
		
		Строка = СтрПолучитьСтроку(Текст, НомерСтроки);
		
		ЭлементБлок = ДокументHTML.СоздатьЭлемент("p");
		ЭлементТело.ДобавитьДочерний(ЭлементБлок);
		
		ЭлементТекст = ДокументHTML.СоздатьТекстовыйУзел(Строка);
		ЭлементБлок.ДобавитьДочерний(ЭлементТекст);
		
	КонецЦикла;
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML);
	Результат = ЗаписьHTML.Закрыть();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОписанияВакансий

Функция ОписанияВакансийПоУмолчанию(Вакансии) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Вакансии.Ссылка КАК Ссылка,
	|	Вакансии.Наименование КАК НаименованиеВакансии,
	|	Вакансии.ДатаОткрытия КАК ДатаОткрытия,
	|	Вакансии.Ответственный КАК Ответственный,
	|	Вакансии.Ответственный.Наименование КАК КонтактноеЛицо,
	|	Вакансии.Позиция КАК Позиция,
	|	ВЫБОР
	|		КОГДА Вакансии.ПредполагаемыйДоход = 0
	|			ТОГДА """"
	|		ИНАЧЕ Вакансии.ПредполагаемыйДоход
	|	КОНЕЦ КАК ПредполагаемыйДоход,
	|	Вакансии.Условия КАК Условия,
	|	Вакансии.Требования КАК Требования,
	|	Вакансии.Обязанности КАК Обязанности,
	|	ЕСТЬNULL(ШтатноеРасписание.Владелец.Наименование, """") КАК Организация,
	|	ЕСТЬNULL(ШтатноеРасписание.Владелец, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияСсылка,
	|	ЕСТЬNULL(ФизическиеЛица.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.Вакансии КАК Вакансии
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО Вакансии.Позиция = ШтатноеРасписание.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Вакансии.Ответственный.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	Вакансии.Ссылка В(&Вакансии)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеВакансии";
	
	ТаблицаОписаний = Запрос.Выполнить().Выгрузить();
	
	ТаблицаОписаний.Колонки.Добавить("ЭлектроннаяПочтаКонтактногоЛица", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаОписаний.Колонки.Добавить("ТелефонКонтактногоЛица", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаОписаний.Колонки.Добавить("АдресКонтактногоЛица", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	
	Если ТаблицаОписаний.Количество() > 0 Тогда
		
		СписокФизическихЛиц = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаОписаний, "ФизическоеЛицо");
		СписокПользователей = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаОписаний, "Ответственный");
		СписокОрганизаций   = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаОписаний, "ОрганизацияСсылка");
		
		ВидПочтыФизическихЛиц    = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
		ВидПочтыПользователей    = Справочники.ВидыКонтактнойИнформации.EmailПользователя;
		ВидТелефонаФизическихЛиц = Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица;
		ВидТелефонаПользователей = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя;
		ВидАдресаОрганизации     = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
		
		ВидыКИ = ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(ВидПочтыФизическихЛиц, ВидТелефонаФизическихЛиц);
		ТаблицаКИФизическихЛиц = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(СписокФизическихЛиц, , ВидыКИ);
		
		ВидыКИ = ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(ВидПочтыПользователей, ВидТелефонаПользователей);
		ТаблицаКИПользователей = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(СписокФизическихЛиц, , ВидыКИ);
		
		ТаблицаКИОрганизаций = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(СписокФизическихЛиц, , ВидАдресаОрганизации);
		
		Для Каждого СтрокаТаблицы Из ТаблицаОписаний Цикл
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ФизическоеЛицо) Тогда
				
				ФИО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ФизическоеЛицо, "Фамилия,Имя,Отчество,Инициалы");
				СтрокаТаблицы.КонтактноеЛицо = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ФИО);
				
			КонецЕсли;
			
			СтрокаТаблицы.ЭлектроннаяПочтаКонтактногоЛица = КонтактнаяИнформацияБЗК.ПредставлениеКонтактнойИнформации(
				ТаблицаКИФизическихЛиц,
				СтрокаТаблицы.ФизическоеЛицо,
				ВидПочтыФизическихЛиц);
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ЭлектроннаяПочтаКонтактногоЛица) Тогда
				СтрокаТаблицы.ЭлектроннаяПочтаКонтактногоЛица = КонтактнаяИнформацияБЗК.ПредставлениеКонтактнойИнформации(
					ТаблицаКИПользователей,
					СтрокаТаблицы.Ответственный,
					ВидПочтыПользователей);
			КонецЕсли;
			
			СтрокаТаблицы.ТелефонКонтактногоЛица = КонтактнаяИнформацияБЗК.ПредставлениеКонтактнойИнформации(
				ТаблицаКИФизическихЛиц,
				СтрокаТаблицы.ФизическоеЛицо,
				ВидТелефонаФизическихЛиц);
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ТелефонКонтактногоЛица) Тогда
				СтрокаТаблицы.ТелефонКонтактногоЛица = КонтактнаяИнформацияБЗК.ПредставлениеКонтактнойИнформации(
					ТаблицаКИПользователей,
					СтрокаТаблицы.Ответственный,
					ВидТелефонаПользователей);
			КонецЕсли;
			
			СтрокаТаблицы.АдресКонтактногоЛица = КонтактнаяИнформацияБЗК.ПредставлениеКонтактнойИнформации(
				ТаблицаКИОрганизаций,
				СтрокаТаблицы.ОрганизацияСсылка,
				ВидАдресаОрганизации);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаОписаний;
	
КонецФункции

Процедура УдалитьОписанияВакансии(Вакансия, НаименованияОписаний) Экспорт
	
	Для Каждого НаименованиеОписания Из НаименованияОписаний Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ПубликацияВакансий.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
			НаборЗаписей.Отбор.МестоПубликации.Установить(НаименованиеОписания);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
			НаборЗаписей = РегистрыСведений.ДанныеПубликацииВакансий.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
			НаборЗаписей.Отбор.МестоПубликации.Установить(НаименованиеОписания);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОписаниеВакансии(Вакансия, ИдентификаторОписания, ДанныеОписания) Экспорт
	
	НаименованиеОписания = ДанныеОписания.Наименование;
	РеквизитыОписания = ДанныеОписания.Реквизиты;
	
	Если Не ЗначениеЗаполнено(ИдентификаторОписания) Тогда
		ИдентификаторОписания = ИдентификаторОписанияВакансииИзНаименования(НаименованиеОписания);
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Делаем запись о новом описании.
		НаборЗаписей = РегистрыСведений.ПубликацияВакансий.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
		НаборЗаписей.Отбор.МестоПубликации.Установить(НаименованиеОписания);
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Вакансия = Вакансия;
		НоваяЗапись.МестоПубликации = НаименованиеОписания;
		НоваяЗапись.ИдентификаторВакансии = ИдентификаторОписания;
		
		НаборЗаписей.Записать();
		
		// Записываем реквизиты описания.
		НаборЗаписей = РегистрыСведений.ДанныеПубликацииВакансий.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
		НаборЗаписей.Отбор.МестоПубликации.Установить(НаименованиеОписания);
		
		Для Каждого КлючИЗначение Из РеквизитыОписания Цикл
			
			НаборЗаписей.Отбор.ПолеДанных.Установить(КлючИЗначение.Ключ);
			
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Вакансия = Вакансия;
			НоваяЗапись.МестоПубликации = НаименованиеОписания;
			НоваяЗапись.ПолеДанных = КлючИЗначение.Ключ;
			НоваяЗапись.Значение = КлючИЗначение.Значение;
			
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

Функция ЗапросСоставаОписанийВакансий(Вакансии = Неопределено, ТолькоАктуальные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Не ОписанияВакансийДоступны() Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	ЗНАЧЕНИЕ(Справочник.Вакансии.ПустаяСсылка) КАК Вакансия,
			|	"""" КАК МестоПубликации,
			|	"""" КАК ИдентификаторОписания";
		Возврат Запрос;
	КонецЕсли;
		
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПубликацияВакансий.Вакансия КАК Вакансия,
		|	ПубликацияВакансий.МестоПубликации КАК МестоПубликации,
		|	ВЫРАЗИТЬ(ПубликацияВакансий.ИдентификаторВакансии КАК СТРОКА(100)) КАК ИдентификаторОписания
		|ИЗ
		|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущиеСостоянияВакансий
		|		ПО (ТекущиеСостоянияВакансий.Вакансия = ПубликацияВакансий.Вакансия)
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПубликацияВакансий.МестоПубликации) = ТИП(СТРОКА)
		|	#УсловиеОтбораВакансии
		|	#УсловиеОтбораСостоянияВакансии
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторОписания,
		|	Вакансия";
		
	ТекстУсловияОтбораВакансии = "";
	Если Вакансии <> Неопределено Тогда
		Запрос.УстановитьПараметр("Вакансии", Вакансии);
		ТекстУсловияОтбораВакансии = "И ПубликацияВакансий.Вакансия В (&Вакансии)";
	КонецЕсли;
	
	ТекстУсловияОтбораСостоянияВакансии = "";
	Если ТолькоАктуальные Тогда
		ТекстУсловияОтбораСостоянияВакансии = "И (НЕ ТекущиеСостоянияВакансий.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Закрыта), ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Отменена)))";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеОтбораВакансии", ТекстУсловияОтбораВакансии);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеОтбораСостоянияВакансии", ТекстУсловияОтбораСостоянияВакансии);
	
	Возврат Запрос;
	
КонецФункции

Функция ВыборкаСоставаОписанийВакансий(Вакансии = Неопределено, ТолькоАктуальные = Ложь) Экспорт
	Возврат ЗапросСоставаОписанийВакансий(Вакансии, ТолькоАктуальные).Выполнить().Выбрать();
КонецФункции

Функция ВыборкаДанныхОписанияВакансии(ИдентификаторОписания, Вакансии) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.УстановитьПараметр("ИдентификаторОписания", ИдентификаторОписания);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПубликацияВакансий.Вакансия КАК Вакансия,
	|	ПубликацияВакансий.МестоПубликации КАК МестоПубликации
	|ПОМЕСТИТЬ ОписаниеВакансииДляПечати
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия В(&Вакансии)
	|	И (ВЫРАЗИТЬ(ПубликацияВакансий.ИдентификаторВакансии КАК СТРОКА(100))) = &ИдентификаторОписания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПубликацииВакансий.Вакансия КАК Вакансия,
	|	ДанныеПубликацииВакансий.ПолеДанных КАК ПолеДанных,
	|	ДанныеПубликацииВакансий.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДанныеПубликацииВакансий КАК ДанныеПубликацииВакансий
	|ГДЕ
	|	(ДанныеПубликацииВакансий.Вакансия, ДанныеПубликацииВакансий.МестоПубликации) В
	|			(ВЫБРАТЬ
	|				ОписаниеВакансииДляПечати.Вакансия КАК Вакансия,
	|				ОписаниеВакансииДляПечати.МестоПубликации КАК МестоПубликации
	|			ИЗ
	|				ОписаниеВакансииДляПечати КАК ОписаниеВакансииДляПечати)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Вакансия";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ОписанияВакансийДоступны() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПубликацияВакансий);
	
КонецФункции

Функция ИдентификаторОписанияВакансииИзНаименования(Знач НаименованиеОписания)
	
	ИдентификаторОписания = "";
	Цифры = "1234567890";
	Буквы = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯABCDEFGHIJKLMNOPQRSTUVWXYZ ";
	
	НомерСимвола = 1;
	
	Пока НомерСимвола <= СтрДлина(НаименованиеОписания) Цикл
		
		ТекущийСимвол = Сред(НаименованиеОписания, НомерСимвола, 1);
		Если Найти(Буквы, ВРег(ТекущийСимвол)) = 0 И Найти(Цифры, ТекущийСимвол) = 0 Тогда
			ТекущийСимвол = " ";
		КонецЕсли;
		
		ИдентификаторОписания = ИдентификаторОписания + ТекущийСимвол;
		НомерСимвола = НомерСимвола + 1;
		
	КонецЦикла;
	
	Строки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИдентификаторОписания, " ");
	
	КоличествоСтрок = Строки.Количество();
	ИндексСтроки = 0;
	
	Пока ИндексСтроки < КоличествоСтрок Цикл
		Строки[ИндексСтроки] = ТРег(Строки[ИндексСтроки]);
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	Возврат СтрСоединить(Строки);
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ПричиныОткрытияВакансий.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ПричиныОтклоненияКандидатов.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ЭтапыРаботыСКандидатами.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ИсточникиИнформацииОКандидатах.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ПодборПерсонала.СформироватьШаблоныСообщений";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура =
		"РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ЗаполнитьНастройкиВидовКонтактнойИнформацииКандидатов";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.24";
	Обработчик.Процедура = "РегистрыСведений.КомментарииКандидатов.ЗаполнениеДоступностиПоПризнакуСкрытый";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("37067dc2-27b5-4707-bb33-d23f36078699");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение доступности комментариев кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.33";
	Обработчик.Процедура = "ПодборПерсонала.ПеренестиЗначениеИспользоватьПодборПерсонала";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("560d0880-3646-4e20-8060-99dbcbedb362");
	Обработчик.Комментарий = НСтр("ru = 'Перенос настройки использования подбора персонала.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.33";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПодбораПерсонала.УстановитьИспользованиеЗаявокИСогласованияВакансий";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("277e4c95-31ed-4661-9b9c-9702b1e76eae");
	Обработчик.Комментарий = НСтр("ru = 'Установка использования согласования вакансий и заявок на подбор персонала.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.9.35";
	Обработчик.Процедура = "РегистрыСведений.СогласованиеВакансий.ЗаполнитьСведенияСогласования";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("89caf58a-5a57-4993-8029-b8e4de8f481f");
	Обработчик.Комментарий = НСтр("ru = 'Заполнить сведения о согласовании вакансий.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.7";
	Обработчик.Процедура = "Справочники.ЭтапыРаботыСКандидатами.ЗаполнитьНастройкиКонтроляЗадержкиКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3a8db2ba-fb6c-4250-9812-88b40c901aa2");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек контроля задержки кандидатов в этапах.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.16";
	Обработчик.Процедура = "ПодборПерсонала.УточнитьВладельцевШаблоновСообщенийСогласования";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9f4b01f6-1936-41a8-901e-29d4d9381f08");
	Обработчик.Комментарий = НСтр("ru = 'Уточнение ранее созданных шаблонов сообщений согласования кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.16";
	Обработчик.Процедура = "ПодборПерсонала.УточнитьВладельцевШаблоновСообщенийИзмененияЭтаповРаботы";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ccd9e7e1-a037-49ca-9371-384e2737b871");
	Обработчик.Комментарий = НСтр("ru = 'Уточнение ранее созданных шаблонов сообщений смены этапов работы с кандидатами.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.16";
	Обработчик.Процедура = "ПодборПерсонала.ИсправитьБесконтекстныеШаблоныСообщений";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72fdaf33-fe26-461a-bc9d-819a4822b5db");
	Обработчик.Комментарий = НСтр("ru = 'Исправление ранее созданных бесконтекстных шаблонов сообщений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.16";
	Обработчик.Процедура = "ПодборПерсонала.ЗаменитьУстаревшиеПараметрыШаблоновСообщений";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2b94ebbc-580b-43cf-b2d1-1e214ea025f0");
	Обработчик.Комментарий = НСтр("ru = 'Замена устаревших параметров шаблонов сообщений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.80";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("6075c931-4566-47e0-8963-e4ed5efcfb75");
	Обработчик.Процедура = "Справочники.Кандидаты.ЗаполнитьРолиКандидатов";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение ролей кандидатов'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.14.77";
	Обработчик.Процедура = "ПодборПерсонала.ОбновитьНаборыЗначенийДоступаВзаимодействий";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0293f0ac-2083-4549-9ebd-7b9810a1e4dc");
	Обработчик.Комментарий = НСтр("ru = 'Обновление наборов значений доступа взаимодействий с кандидатами.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.15.8";
	Обработчик.Процедура = "ПодборПерсонала.ОбновитьОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0445ee22-e728-4402-bad6-feb24a0b45ac");
	Обработчик.Комментарий = НСтр("ru = 'Обновление регламентного задания по отклонению кандидатов задержавшихся на одном этапе.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.15.10";
	Обработчик.Процедура = "Справочники.ПричиныОтклоненияКандидатов.УточнитьНастройкуПорядкаПричинОтклонения";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("61b6894e-85bb-4838-a049-12ba90abd790");
	Обработчик.Комментарий = НСтр("ru = 'Исправить нарушения порядка причин отклонения кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.15.62";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПодбораПерсонала.УстановитьПериодРаботыСВакансией";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("760abb1a-b2ad-4b2b-917b-421c78955968");
	Обработчик.Комментарий = НСтр("ru = 'Установка периода работы с вакансией по умолчанию.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.18.4";
	Обработчик.Процедура = "Справочники.Кандидаты.ЗаполнитьВалютуИПериодичностьОжидаемогоДохода";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72ca9628-af9d-420c-9c3b-8375ce6e0571");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение валюты и периодичности ожидаемого дохода кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.2";
	Обработчик.Процедура = "Справочники.Вакансии.УточнитьСостояниеСогласованияПоСостояниюВакансии";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b2b827ae-25b9-4d3a-ae09-35b0237821fc");
	Обработчик.Комментарий = НСтр("ru = 'Уточнение состояния согласования по состояниям вакансий.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.2";
	Обработчик.Процедура = "ПодборПерсонала.УточнитьТекущийЭтапРаботыСКандидатами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("74d68b13-7525-4c84-8b40-9ae648e95c52");
	Обработчик.Комментарий = НСтр("ru = 'Уточнение текущего этапа работы с кандидатами.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.3";
	Обработчик.Процедура = "ПодборПерсонала.ЗаполнитьЛичныеДанныеКандидатовИСвязанныеДанные";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("319d1e00-3b95-4c7e-91c8-29755a235e6c");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение личных данных кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.300";
	Обработчик.Процедура = "ПодборПерсонала.ЗаменитьПараметрыШаблоновСообщенийКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a0e74d78-6c4f-4d92-9993-cd21f1e7a6da");
	Обработчик.Комментарий = НСтр("ru = 'Замена параметров шаблонов сообщений кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.11";
	Обработчик.Процедура = "ПодборПерсонала.ДобавитьПредопределенныеЭтапыРаботыСКандидатами";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3b77131b-8a10-4479-876b-4fa8a1bb67ae");
	Обработчик.Комментарий = НСтр("ru = 'Добавление предопределенных этапов работы с кандидатами и данных по ним.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.12";
	Обработчик.Процедура = "ПодборПерсонала.ДобавитьПредопределенныеЭтапыВакансийПрофилейДолжности";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2cbdb39d-3202-4e37-9178-4f87b0f84dde");
	Обработчик.Комментарий = НСтр("ru = 'Добавление предопределенных этапов работы в вакансии и профили должности, 
								  |не связанные с кандидатами.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.25.23";
	Обработчик.Процедура = "Справочники.Кандидаты.СоздатьФизическиеЛицаДляУтвержденныхКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e5f3ca65-461b-4dbd-bc1b-449db24d50c9");
	Обработчик.Комментарий = НСтр("ru = 'Создание физических лиц для утвержденных кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.13";
	Обработчик.Процедура = "ПодборПерсонала.ОбновитьДанныеРегистраГруппыЗначенийДоступа";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("3336e909-6e7d-45db-9ff6-a10d822f6a8c");
	Обработчик.Комментарий = НСтр("ru = 'Обновление данных регистра ""Группы значений доступа"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.19";
	Обработчик.Процедура = "РегистрыСведений.СостоянияВакансий.ИсправитьСостоянияВакансий";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("74038432-344e-4d81-b8eb-c2004fab5ac2");
	Обработчик.Комментарий = НСтр("ru = 'Исправления состояний вакансий: отсутствие состояний, повторяющиеся состояния, 
								  |состояния внутри суток и др.'"); 
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.40";
	Обработчик.Процедура = "ПодборПерсоналаПроверки.ПриНачальномЗаполненииДанныхКонтроляЗадержкиКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("21d8ce80-77e3-45e7-8090-c683f9f1957a");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных контроля задержки кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.43";
	Обработчик.Процедура = 
		"РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ЗаполнитьНастройкиВидовКонтактнойИнформацииКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cb8f797c-15f3-48d3-906f-989fa856c8fd");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение настроек видов контактной информации кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.8";
	Обработчик.Процедура = "Справочники.ПрофилиДолжностей.ЗаполнитьВалютуИПериодичностьЗарплаты";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("56eef731-de24-4381-93a3-2d952064f475");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение валюты и периодичности зарплатной вилки.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.8";
	Обработчик.Процедура = "Документы.ЗаявкаНаПодборПерсонала.ЗаполнитьНеобходимоЧеловекВалютуИПериодичностьЗарплаты";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0af6f8a8-fa68-463f-865e-f37c2e1627af");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение необходимого количества человек, валюты и периодичности зарплатной вилки.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.46";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8052a5fb-a724-4d36-a946-2e0cfeb1343d");
	Обработчик.Процедура = "Справочники.ЛичныеДанныеКандидатов.ЗаполнитьФИОСлужебныеСБуквамиЕЁ";
	Обработчик.Комментарий = НСтр("ru = 'Заполняет служебные данные справочника ""Личные данные кандидатов"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.38";
	Обработчик.Процедура = "ПодборПерсонала.ЗаполнитьВидыКонтактнойИнформацииКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("1b37fec6-c784-442d-b0f6-9a9b7646ace1");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение видов контактной информации кандидатов.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.38";
	Обработчик.Процедура =
		"РегистрыСведений.ВидыКонтактнойИнформацииКонтактовРекрутинговыхСайтов.ЗаполнитьМессенджерыРекрутинговыхСайтов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("fb28dff7-e2d8-4a41-ba38-d8597299ce6b");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение сопоставления видов контактной информации по рекрутинговым сайтам.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.38";
	Обработчик.Процедура = "Справочники.ЛичныеДанныеКандидатов.ЗаполнитьМессенджерыКандидатов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("32ed28e5-f617-4fe6-ab87-71caab85d7c6");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение мессенджеров по уже созданным доп. контактам.'");
	
КонецПроцедуры

Процедура СформироватьШаблоныСообщений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	(ШаблоныСообщений.ВладелецШаблона ССЫЛКА Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала
		|			ИЛИ ШаблоныСообщений.ВладелецШаблона ССЫЛКА Перечисление.СостоянияСогласования)";
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;

	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов 

	// Отправка вакансии.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Вакансии.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Вакансии.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = 'Вакансия «[Вакансии.Наименование]»'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Получатель.Имя] [Получатель.Отчество]!
			 |
			 |Возможно, вам будет интересна вакансия нашей компании «[Вакансии.Наименование]».
			 |
			 |Обязанности:
			 |[Вакансии.Обязанности]
			 |
			 |Требования:
			 |[Вакансии.Требования]
			 |
			 |Условия:
			 |[Вакансии.Условия]
			 |
			 |С уважением, служба персонала [Позиция.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСВакансией;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Описание вакансии'"), ПараметрыШаблона);

	// Отправка одного кандидата.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = '[Кандидаты.ЛичныеДанные.ФИО] «[Кандидаты.Вакансия.Наименование]»'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Получатель.Имя] [Получатель.Отчество]!
			 |
			 |Пожалуйста, рассмотрите резюме кандидата:
			 |[Кандидаты.ЛичныеДанные.ФИО]
			 |
			 |Материалы во вложении.
			 |			 
			 |С уважением,
			 |[ТекущийПользователь.ФизическоеЛицо.Фамилия] [ТекущийПользователь.ФизическоеЛицо.Имя]'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСКандидатом;
	ПараметрыШаблона.ВыбранныеВложения.Вставить("Резюме");
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Резюме кандидата'"), ПараметрыШаблона);

	// Отправка нескольких кандидатов.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = 'Резюме кандидатов'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Получатель.Имя] [Получатель.Отчество]!
			 |
			 |Пожалуйста, рассмотрите резюме кандидатов:
			 |[Списки.СписокКандидатов]
			 |
			 |С уважением,
			 |[ТекущийПользователь.ФизическоеЛицо.Фамилия] [ТекущийПользователь.ФизическоеЛицо.Имя]'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСКандидатами;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Резюме кандидатов'"), ПараметрыШаблона);

	// Кандидат одобрен (письмо).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = 'Ваша кандидатура одобрена'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]!
              |
              |Мы рады сообщить вам, что ваша кандидатура одобрена руководством на должность «[Кандидаты.Вакансия]».
              |Для оформления документов ждем вас в нашем офисе по адресу [Кандидаты.Организация.ФактическийАдрес]. 
              |
              |С собой необходимо иметь: паспорт, трудовую книжку, СНИЛС, военный билет (если вы военнообязанный).
              |
              |С уважением, служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Кандидат одобрен (письмо)'"), ПараметрыШаблона);
	
	// Кандидат одобрен (SMS).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "SMS";
	ПараметрыШаблона.Текст = 
		НСтр("ru = '[Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]! Ваша кандидатура одобрена на должность «[Кандидаты.Вакансия]». Для оформления документов ждем вас по адресу: [Кандидаты.Организация.ФактическийАдрес]. С собой иметь: паспорт, трудовую книжку, СНИЛС, военный билет (если вы военнообязанный). Служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Кандидат одобрен (SMS)'"), ПараметрыШаблона);
	
	// Кандидат отклонен (письмо).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = 'Ответ по вакансии'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]!
              |
              |К сожалению, в конкурсе на вакансию «[Кандидаты.Вакансия]» принято решение в пользу другого кандидата.
              |Благодарим вас за участие.
              |Ваше резюме внесено в базу данных службы персонала. В случае, если у нас возникнет вакансия, подходящая вам по вашим требованиям, мы обязательно вам сообщим.
              |
              |С уважением, служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Кандидат отклонен (письмо)'"), ПараметрыШаблона);
	
	// Кандидат отклонен (SMS).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "SMS";
	ПараметрыШаблона.Текст = 
		НСтр("ru = '[Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]! К сожалению, ваша кандидатура была отклонена в конкурсе на вакансию «[Кандидаты.Вакансия]». Благодарим вас за участие. Служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Кандидат отклонен (SMS)'"), ПараметрыШаблона);

	// Приглашение на собеседование (письмо).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона);	
	ПараметрыШаблона.Тема = НСтр("ru = 'Приглашение на собеседование'");
	ПараметрыШаблона.Текст = 
		НСтр("ru = 'Добрый день, [Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]!
              |
              |Наша компания [Кандидаты.Организация.Наименование] получила ваш отклик на вакансию «[Кандидаты.Вакансия]».
              |Мы внимательно ознакомились с вашим резюме. Считаем, что ваши знания и навыки соответствуют заявленным требованиям. 
              |
              |Приглашаем вас пройти собеседование со специалистом по подбору персонала [ЭтапРаботы.Дата] в [ЭтапРаботы.Время] в нашем офисе по адресу [Кандидаты.Организация.ФактическийАдрес].
              |
              |Просим взять с собой паспорт.
              |
              |С уважением, служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Приглашение на собеседование (письмо)'"), ПараметрыШаблона);
	
	// Приглашение на собеседование (SMS).
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "SMS";
	ПараметрыШаблона.Текст = 
		НСтр("ru = '[Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]! Мы ознакомились с вашим резюме на вакансию «[Кандидаты.Вакансия]». Приглашаем вас пройти собеседование [ЭтапРаботы.Дата] в [ЭтапРаботы.Время] по адресу [Кандидаты.Организация.ФактическийАдрес]. Просим взять с собой паспорт. Служба персонала [Кандидаты.Организация.Наименование].'");
	ПараметрыШаблона.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом;
	ШаблоныСообщений.СоздатьШаблон(НСтр("ru = 'Приглашение на собеседование (SMS)'"), ПараметрыШаблона);

	// АПК:1223-вкл. 
	
КонецПроцедуры

Процедура УстановитьФорматПисьмаШаблонаСообщений(ПараметрыШаблона)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПочтовыйКлиент") 
		И Не ПолучитьФункциональнуюОпцию("ОтправлятьПисьмаВФорматеHTML") Тогда
		ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПеренестиЗначениеИспользоватьПодборПерсонала(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("РегистрСведений.НастройкиПодбораПерсонала");
	Блокировка.Добавить("Константа.ИспользоватьПодборПерсонала");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка блокировки'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, 
			Метаданные.Константы.ИспользоватьПодборПерсонала);
	КонецПопытки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодбораПерсонала.УдалитьИспользоватьПодборПерсонала КАК УдалитьИспользоватьПодборПерсонала
		|ИЗ
		|	РегистрСведений.НастройкиПодбораПерсонала КАК НастройкиПодбораПерсонала";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОтменитьТранзакцию();
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ЗначениеВРегистре = РезультатЗапроса.Выгрузить()[0].УдалитьИспользоватьПодборПерсонала;
	ЗначениеВКонстанте = Константы.ИспользоватьПодборПерсонала.Получить();
	Если ЗначениеВРегистре = Истина И ЗначениеВКонстанте = Ложь Тогда
		МенеджерЗначения = Константы.ИспользоватьПодборПерсонала.СоздатьМенеджерЗначения();
		МенеджерЗначения.Значение = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(МенеджерЗначения);
	КонецЕсли;
	
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Не удалось зафиксировать транзакцию'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура УточнитьВладельцевШаблоновСообщенийСогласования(ПараметрыОбновления = Неопределено) Экспорт

	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить("Справочник.Вакансии");
	НазначенияШаблонов.Добавить("Справочник.Кандидаты");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияШаблонов", НазначенияШаблонов); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка,
		|	ШаблоныСообщений.ВладелецШаблона КАК ВладелецШаблона
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании В(&НазначенияШаблонов)
		|	И ШаблоныСообщений.ВладелецШаблона ССЫЛКА Перечисление.СостоянияСогласования";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Ложь);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Выборка.ВладелецШаблона = Перечисления.СостоянияСогласования.Согласовано Тогда
			ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата;
		ИначеЕсли Выборка.ВладелецШаблона = Перечисления.СостоянияСогласования.Отклонено Тогда
			ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата;
		Иначе
			ШаблонОбъект.ВладелецШаблона = Неопределено;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура УточнитьВладельцевШаблоновСообщенийИзмененияЭтаповРаботы(ПараметрыОбновления = Неопределено) Экспорт

	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить("Справочник.Вакансии");
	НазначенияШаблонов.Добавить("Справочник.Кандидаты");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияШаблонов", НазначенияШаблонов); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании В(&НазначенияШаблонов)
		|	И ШаблоныСообщений.ВладелецШаблона ССЫЛКА Справочник.ЭтапыРаботыСКандидатами";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Ложь);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ИсправитьБесконтекстныеШаблоныСообщений(ПараметрыОбновления = Неопределено) Экспорт

	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить("Справочник.Вакансии");
	НазначенияШаблонов.Добавить("Справочник.Кандидаты");

	ОписаниеОднойВакансии = НСтр("ru = 'Описание одной вакансии на ознакомление'");
	ОписаниеНесколькихВакансий = НСтр("ru = 'Описания нескольких вакансий на ознакомление'");
	ВнутренниеСсылкиНаВакансии = НСтр("ru = 'Внутренние ссылки на несколько вакансий'");
	РезюмеОдногоКандидата = НСтр("ru = 'Резюме одного кандидата на ознакомление'");
	РезюмеНесколькихКандидатов = НСтр("ru = 'Резюме нескольких кандидатов на ознакомление'");
	ВнутренниеСсылкиНаКандидатов = НСтр("ru = 'Внутренние ссылки на резюме нескольких кандидатов'");

	НаименованияШаблонов = Новый Массив;
	НаименованияШаблонов.Добавить(ОписаниеОднойВакансии);
	НаименованияШаблонов.Добавить(ОписаниеНесколькихВакансий);
	НаименованияШаблонов.Добавить(ВнутренниеСсылкиНаВакансии);
	НаименованияШаблонов.Добавить(РезюмеОдногоКандидата);
	НаименованияШаблонов.Добавить(РезюмеНесколькихКандидатов);
	НаименованияШаблонов.Добавить(ВнутренниеСсылкиНаКандидатов);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияШаблонов", НазначенияШаблонов); 
	Запрос.УстановитьПараметр("НаименованияШаблонов", НаименованияШаблонов); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка,
		|	ШаблоныСообщений.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании В(&НазначенияШаблонов)
		|	И ШаблоныСообщений.ВладелецШаблона = НЕОПРЕДЕЛЕНО
		|	И ШаблоныСообщений.Наименование В(&НаименованияШаблонов)
		|	И НЕ ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Ложь);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ШаблонОбъект.Наименование = ОписаниеОднойВакансии Тогда
			ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСВакансией;
			ШаблонОбъект.Наименование = НСтр("ru = 'Описание вакансии'");
			ШаблонОбъект.ТемаПисьма = НСтр("ru = 'Вакансия «[Вакансии.Наименование]»'");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		ИначеЕсли ШаблонОбъект.Наименование = РезюмеОдногоКандидата Тогда
			ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСКандидатом;
			ШаблонОбъект.Наименование = НСтр("ru = 'Резюме кандидата'");
			ШаблонОбъект.ТемаПисьма = НСтр("ru = '[Кандидаты.ФизическоеЛицо.ФИО] «[Кандидаты.Вакансия.Наименование]»'");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		ИначеЕсли ШаблонОбъект.Наименование = РезюмеНесколькихКандидатов Тогда
			ШаблонОбъект.ВладелецШаблона = Перечисления.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОзнакомлениеСКандидатами;
			ШаблонОбъект.Наименование = НСтр("ru = 'Резюме кандидатов'");
			ШаблонОбъект.ТемаПисьма = НСтр("ru = 'Резюме кандидатов'");
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		Иначе
			ШаблонОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

Процедура ЗаменитьУстаревшиеПараметрыШаблоновСообщений(ПараметрыОбновления = Неопределено) Экспорт

	НазначенияШаблонов = Новый Массив;
	НазначенияШаблонов.Добавить("Справочник.Вакансии");
	НазначенияШаблонов.Добавить("Справочник.Кандидаты");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияШаблонов", НазначенияШаблонов); 
	Запрос.УстановитьПараметр("НазначениеКандидаты", "Справочник.Кандидаты"); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании В(&НазначенияШаблонов)
		|	И (ШаблоныСообщений.ТекстШаблонаПисьма ПОДОБНО ""%\[Произвольные.ФИОПолучателя\]%"" СПЕЦСИМВОЛ ""\""
		|			ИЛИ ШаблоныСообщений.ТекстШаблонаПисьмаHTML ПОДОБНО ""%\[Произвольные.ФИОПолучателя\]%"" СПЕЦСИМВОЛ ""\"")
		|	И НЕ ШаблоныСообщений.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании В(&НазначениеКандидаты)
		|	И (ШаблоныСообщений.ТекстШаблонаПисьма ПОДОБНО ""%\[Произвольные.ПредставлениеСпискаПредметов\]%"" СПЕЦСИМВОЛ ""\""
		|			ИЛИ ШаблоныСообщений.ТекстШаблонаПисьмаHTML ПОДОБНО ""%\[Произвольные.ПредставлениеСпискаПредметов\]%"" СПЕЦСИМВОЛ ""\"")
		|	И НЕ ШаблоныСообщений.ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Ложь);

	ЗаменаПараметров = Новый Соответствие;
	ЗаменаПараметров.Вставить("[Произвольные.ФИОПолучателя]", "[Получатель.ФИО]");
	ЗаменаПараметров.Вставить("[Произвольные.ПредставлениеСпискаПредметов]", "[Списки.СписокКандидатов]");

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Для Каждого КлючИЗначение Из ЗаменаПараметров Цикл
			ШаблонОбъект.ТекстШаблонаПисьма = СтрЗаменить(ШаблонОбъект.ТекстШаблонаПисьма, КлючИЗначение.Ключ, КлючИЗначение.Значение);
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = СтрЗаменить(ШаблонОбъект.ТекстШаблонаПисьмаHTML, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ОбновитьНаборыЗначенийДоступаВзаимодействий(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Взаимодействие КАК Взаимодействие
		|ИЗ
		|	РегистрСведений.ПредметыПапкиВзаимодействий КАК ПредметыВзаимодействий
		|ГДЕ
		|	Предмет ССЫЛКА Справочник.Кандидаты
		|	И Взаимодействие НЕ В (&Обработанные)";
	
	Обработанные = Новый Массив;
	Пока Истина Цикл
		Запрос.УстановитьПараметр("Обработанные", Обработанные);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			УправлениеДоступом.ОбновитьНаборыЗначенийДоступа(Выборка.Взаимодействие, Истина);
			Обработанные.Добавить(Выборка.Взаимодействие);
		КонецЦикла;
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
		ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	
КонецПроцедуры

Процедура ОбновитьОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе(ПараметрыОбновления = Неопределено) Экспорт
	
	Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ОтклонениеКандидатовЗадержавшихсяНаОдномЭтапе);
	
	Если Задание.Использование = ПолучитьФункциональнуюОпцию("ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе") Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(Задание, 
		ПолучитьФункциональнуюОпцию("ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе"));
	
КонецПроцедуры

// Заполняет личные данные кандидатов и связанные с ними данные при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьЛичныеДанныеКандидатовИСвязанныеДанные(ПараметрыОбновления) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено
		Или Метаданные.Справочники.Кандидаты.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Справочники.СтепениЗнанияЯзыкаКандидата.ВыполнитьНачальноеЗаполнение();
	РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ЗаполнитьНастройкиВидовКонтактнойИнформацииКандидатов();
	Справочники.ЛичныеДанныеКандидатов.ЗаполнитьЛичныеДанныеКандидатов(ПараметрыОбновления);
	Если Не ПараметрыОбновления.ОбработкаЗавершена Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаЗавершена = КадровыеРешенияРасширенный.ЗаполнитьКандидатов(ПараметрыОбновления);

	Если ОбработкаЗавершена
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеИнтервью") Тогда
		МодульЭлектронноеИнтервью = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеИнтервью");
		ОбработкаЗавершена = МодульЭлектронноеИнтервью.ЗаполнитьЛичныеДанныеКандидатов();
	КонецЕсли;
	
	Если ОбработкаЗавершена И Константы.ОграничиватьДоступНаУровнеЗаписейФизическиеЛица.Получить() Тогда
		Константы.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов.Установить(Истина);
		ОбработкаЗавершена = ЗаполнитьЗначенияДоступаВГруппахДоступа();
		Если ОбработкаЗавершена Тогда
			РегистрыСведений.ГруппыЗначенийДоступа.ОбновитьДанныеРегистра();
		КонецЕсли;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", ОбработкаЗавершена);
	
КонецПроцедуры

Функция ЗаполнитьЗначенияДоступаВГруппахДоступа()
	
	Профили = Новый Массив;
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ИдентификаторПрофиляМенеджерПоНаборуПерсонала()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ИдентификаторПрофиляСтаршийМенеджерПоНаборуПерсонала()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ИнструментыРуководителя.ИдентификаторПрофиляРуководительПодразделения()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикБезДоступаКЗарплате()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровик()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровик()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ЗарплатаКадрыРасширенный.ИдентификаторПрофиляКадровикРасчетчик()));
	Профили.Добавить(УправлениеДоступом.ПоставляемыйПрофильПоИдентификатору(
		ЗарплатаКадрыРасширенный.ИдентификаторПрофиляСтаршийКадровикРасчетчик()));
	
	ВидДоступаКандидаты = Справочники.ЛичныеДанныеКандидатов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыДоступаЗначенияДоступа.Ссылка КАК Профиль,
		|	ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование КАК ЗначениеДоступаНаименование,
		|	ГруппыДоступаВидыДоступа.ВсеРазрешены КАК ВсеРазрешены
		|ИЗ
		|	Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ЗначенияДоступа КАК ГруппыДоступаЗначенияДоступа1
		|		ПО ГруппыДоступаЗначенияДоступа.Ссылка = ГруппыДоступаЗначенияДоступа1.Ссылка
		|		И (ГруппыДоступаЗначенияДоступа.ВидДоступа = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
		|		И (ГруппыДоступаЗначенияДоступа1.ВидДоступа = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка))
		|		И
		|			(ГруппыДоступаЗначенияДоступа1.ЗначениеДоступа.Наименование = ГруппыДоступаЗначенияДоступа.ЗначениеДоступа.Наименование)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа.ВидыДоступа КАК ГруппыДоступаВидыДоступа
		|		ПО (ГруппыДоступаЗначенияДоступа.Ссылка = ГруппыДоступаВидыДоступа.Ссылка
		|		И ГруппыДоступаЗначенияДоступа.ВидДоступа = ГруппыДоступаВидыДоступа.ВидДоступа)
		|ГДЕ
		|	ГруппыДоступаЗначенияДоступа.Ссылка.Профиль В (&Профили)
		|	И ГруппыДоступаЗначенияДоступа.ВидДоступа = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|	И ГруппыДоступаЗначенияДоступа1.ЗначениеДоступа ЕСТЬ NULL
		|ИТОГИ
		|	МАКСИМУМ(ВсеРазрешены) КАК ВсеРазрешены
		|ПО
		|	Профиль";
	
	Запрос.УстановитьПараметр("Профили", Профили);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ГруппыДоступа.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();

		Если РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат Истина;
		КонецЕсли;
		
		ВыборкаПрофиль = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПрофиль.Следующий() Цикл
			
			ПрофильОбъект = ВыборкаПрофиль.Профиль.ПолучитьОбъект();
			НайденнаяСтрока = ПрофильОбъект.ВидыДоступа.Найти(ВидДоступаКандидаты, "ВидДоступа");
			Если НайденнаяСтрока = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НайденнаяСтрока.ВсеРазрешены = ВыборкаПрофиль.ВсеРазрешены;
			
			ВыборкаДетальныеЗаписи = ВыборкаПрофиль.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ГруппаДоступа = Справочники.ГруппыДоступаКандидатов.НайтиПоНаименованию(
					ВыборкаДетальныеЗаписи.ЗначениеДоступаНаименование);
				Если ЗначениеЗаполнено(ГруппаДоступа) Тогда
					НовоеЗначениеДоступа = ПрофильОбъект.ЗначенияДоступа.Добавить();
					НовоеЗначениеДоступа.ВидДоступа = ВидДоступаКандидаты;
					НовоеЗначениеДоступа.ЗначениеДоступа = ГруппаДоступа;
				КонецЕсли;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПрофильОбъект, Истина);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		Возврат Истина;
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения значений доступа в группах доступа'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ГруппыВнешнихПользователей);
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Инициализирует виды контактной информации кандидатов.
Процедура ЗаполнитьВидыКонтактнойИнформацииКандидатов(ПараметрыОбновления = Неопределено) Экспорт
	
	Отбор = ОбновлениеИнформационнойБазы.ПараметрыОбновленияПредопределенныхЭлементов();
	Отбор.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"ТелефонЛичныеДанныеКандидатов"));
	Отбор.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"EMailЛичныеДанныеКандидатов"));
	Отбор.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"АдресЛичныеДанныеКандидатов"));
	Отбор.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"TelegramЛичныеДанныеКандидатов"));
	Отбор.Элементы.Добавить(УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени(
		"MAXЛичныеДанныеКандидатов"));
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(Метаданные.Справочники.ВидыКонтактнойИнформации, Отбор);
	
КонецПроцедуры

Процедура ЗаменитьПараметрыШаблоновСообщенийКандидатов(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НазначенияШаблонов", "Справочник.Кандидаты"); 
	Запрос.УстановитьПараметр("НазначениеКандидаты", "Справочник.Кандидаты"); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.ПолноеИмяТипаПараметраВводаНаОсновании = &НазначенияШаблонов
		|	И (ШаблоныСообщений.ТекстШаблонаПисьма ПОДОБНО ""%\[Кандидаты.ФизическоеЛицо.%"" СПЕЦСИМВОЛ ""\""
		|	ИЛИ ШаблоныСообщений.ТекстШаблонаПисьмаHTML ПОДОБНО ""%\[Кандидаты.ФизическоеЛицо.%"" СПЕЦСИМВОЛ ""\""
		|	ИЛИ ШаблоныСообщений.ТекстШаблонаSMS ПОДОБНО ""%\[Кандидаты.ФизическоеЛицо.%"" СПЕЦСИМВОЛ ""\""
		|	ИЛИ ШаблоныСообщений.ТемаПисьма ПОДОБНО ""%\[Кандидаты.ФизическоеЛицо.%"" СПЕЦСИМВОЛ ""\"")
		|	И НЕ ШаблоныСообщений.ПометкаУдаления";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.ШаблоныСообщений.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
				ПараметрыОбновления, "ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
		СтрокаПоиска = "[Кандидаты.ФизическоеЛицо.";
		СтрокаЗамены = "[Кандидаты.ЛичныеДанные.";
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонОбъект.ТекстШаблонаПисьма = СтрЗаменить(ШаблонОбъект.ТекстШаблонаПисьма, СтрокаПоиска, СтрокаЗамены);
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = СтрЗаменить(ШаблонОбъект.ТекстШаблонаПисьмаHTML, СтрокаПоиска, СтрокаЗамены);
			ШаблонОбъект.ТекстШаблонаSMS = СтрЗаменить(ШаблонОбъект.ТекстШаблонаSMS, СтрокаПоиска, СтрокаЗамены);
			ШаблонОбъект.ТемаПисьма = СтрЗаменить(ШаблонОбъект.ТемаПисьма, СтрокаПоиска, СтрокаЗамены);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
		КонецЦикла;
	
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(
			ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура УточнитьТекущийЭтапРаботыСКандидатами(ПараметрыОбновления) Экспорт

	// Текущий этап рассчитывается как
	// - первый не пройденный (или не пропущенный) этап для кандидатов на рассмотрении
	// - последний пройденный (или пропущенный) этап для отклоненных кандидатов
	// В этом случае, если у кандидата есть пропуски в этапах, не отмеченные статусом "Пропущен", 
	// то ожидается, что текущим будет следующий за последним пройденным или пропущенным
	
	// Обработчик 
	// - находит минимальный не пройденный этап для кандидатов
	// - отбирает тех кандидатов, у которых есть пройденные этапы с номером выше, чем первый не пройденный
	// Для таких кандидатов текущий этап будет пересчитан

	ОбработанныеКандидаты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыОбновления, "ОбработанныеКандидаты", Новый Массив);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ЗавершенныеЭтапы", 
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
			Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден, 
			Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен));
	Запрос.УстановитьПараметр("Обработанные", ОбработанныеКандидаты);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	МИНИМУМ(ЭтапыВакансии.НомерСтроки) КАК НомерЭтапа
		|ПОМЕСТИТЬ ВТПервыйНеПройденныйЭтапПоНомеру
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО (Кандидаты.Вакансия = ЭтапыВакансии.Ссылка)
		|			И (НЕ Кандидаты.Ссылка В (&Обработанные))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО (ЭтапыВакансии.Ссылка = Кандидаты.Вакансия)
		|			И (РаботаСКандидатами.Кандидат = Кандидаты.Ссылка)
		|			И (ЭтапыВакансии.ЭтапРаботы = РаботаСКандидатами.ЭтапРаботы)
		|ГДЕ
		|	НЕ ЕСТЬNULL(РаботаСКандидатами.СостояниеЭтапа, ЗНАЧЕНИЕ(Перечисление.СостоянияЭтаповРаботыСКандидатами.ПустаяСсылка)) В (&ЗавершенныеЭтапы)
		|
		|СГРУППИРОВАТЬ ПО
		|	Кандидаты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	Кандидаты.Ссылка КАК Кандидат
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кандидаты КАК Кандидаты
		|		ПО (Кандидаты.Вакансия = ЭтапыВакансии.Ссылка)
		|			И (НЕ Кандидаты.Ссылка В (&Обработанные))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО (ЭтапыВакансии.Ссылка = Кандидаты.Вакансия)
		|			И (РаботаСКандидатами.Кандидат = Кандидаты.Ссылка)
		|			И ЭтапыВакансии.ЭтапРаботы = РаботаСКандидатами.ЭтапРаботы
		|			И (РаботаСКандидатами.СостояниеЭтапа В (&ЗавершенныеЭтапы))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПервыйНеПройденныйЭтапПоНомеру КАК ПервыйНеПройденныйЭтапПоНомеру
		|		ПО (ПервыйНеПройденныйЭтапПоНомеру.Кандидат = Кандидаты.Ссылка)
		|			И (ПервыйНеПройденныйЭтапПоНомеру.НомерЭтапа < ЭтапыВакансии.НомерСтроки)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;

	Кандидаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Кандидат");

	Если ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, 
			"РегистрСведений.ТекущиеЭтапыРаботыСКандидатами", Неопределено, Неопределено) Тогда
		ОбновитьТекущийЭтапРаботыКандидатов(Кандидаты);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбработанныеКандидаты, Кандидаты);
	ПараметрыОбновления.Вставить("ОбработанныеКандидаты", ОбработанныеКандидаты);

КонецПроцедуры

Процедура ДобавитьПредопределенныеЭтапыРаботыСКандидатами(ПараметрыОбновления) Экспорт

	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПредопределенныеЭтапы", Перечисления.ЭтапыРаботыСКандидатами.Действующие());
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 300
		|	Кандидаты.Ссылка КАК Ссылка,
		|	Кандидаты.Вакансия КАК Вакансия
		|ПОМЕСТИТЬ ВТКандидаты
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|ГДЕ
		|	Кандидаты.Вакансия В
		|			(ВЫБРАТЬ
		|				Вакансии.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Вакансии КАК Вакансии
		|			ГДЕ
		|				НЕ Вакансии.Ссылка В
		|						(ВЫБРАТЬ
		|							Этапы.Ссылка
		|						ИЗ
		|							Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК Этапы
		|						ГДЕ
		|							Этапы.ЭтапРаботы В (&ПредопределенныеЭтапы)))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидаты.ДатаРегистрации УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Кандидаты.Ссылка КАК Кандидат,
		|	Кандидаты.Вакансия КАК Вакансия,
		|	РаботаСКандидатами.Период КАК Период,
		|	РаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
		|	РаботаСКандидатами.Комментарий КАК Комментарий,
		|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
		|	РаботаСКандидатами.ШаблонАнкеты КАК ШаблонАнкеты,
		|	РаботаСКандидатами.ПричинаОтклонения КАК ПричинаОтклонения,
		|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
		|	РаботаСКандидатами.Бронь КАК Бронь,
		|	РаботаСКандидатами.Организатор КАК Организатор,
		|	РаботаСКандидатами.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Справочник.Кандидаты КАК Кандидаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО (РаботаСКандидатами.Кандидат = Кандидаты.Ссылка)
		|			И (НЕ РаботаСКандидатами.ЭтапРаботы В (&ПредопределенныеЭтапы))
		|ГДЕ
		|	Кандидаты.Вакансия В
		|			(ВЫБРАТЬ
		|				ВТКандидаты.Вакансия
		|			ИЗ
		|				ВТКандидаты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кандидаты.Вакансия,
		|	Кандидаты.Ссылка";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.Вакансии));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.ПрофилиДолжностей));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.РаботаСКандидатами));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.РегистрыСведений.ТекущиеЭтапыРаботыСКандидатами));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Документы.РешениеОПриемеНаРаботу));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Документы.ПриемНаРаботу));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Документы.ПриемНаРаботуСписком));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;

	ВсеКандидаты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Кандидат");
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(ВсеКандидаты);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеКандидатов, "Кандидат");

	РешенияПоКандидатам = Документы.РешениеОПриемеНаРаботу.РешенияПоКандидатам(ВсеКандидаты);
	РеквизитыРешений = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОбщегоНазначения.ВыгрузитьКолонку(РешенияПоКандидатам, "Значение"), "Проведен, ДатаПриема, Комментарий");
	
	СотрудникиПоКандидатам = СотрудникиПоКандидатам(ВсеКандидаты);
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Ложь, 
		ОбщегоНазначения.ВыгрузитьКолонку(СотрудникиПоКандидатам, "Значение"), "ДатаПриема, ПриказОПриеме");
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(КадровыеДанные, "Сотрудник");
	
	Профили = Новый Соответствие();
	ОбновленныеКандидаты = Новый Массив;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		ВакансияОбъект = Выборка.Вакансия.ПолучитьОбъект(); // СправочникОбъект.Вакансии
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ВакансияОбъект.ЭтапыРаботыСКандидатами, 
			Перечисления.ЭтапыРаботыСКандидатами.Действующие(), "ЭтапРаботы");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ВакансияОбъект);
		Если ВакансияОбъект.СоответствуетПрофилюДолжности 
			И ЗначениеЗаполнено(ВакансияОбъект.ПрофильДолжности) 
			И Профили.Получить(ВакансияОбъект.ПрофильДолжности) = Неопределено Тогда
			ПрофильОбъект = ВакансияОбъект.ПрофильДолжности.ПолучитьОбъект();
			Если ПрофильОбъект.ЭтапыРаботыСКандидатами.НайтиСтроки(
				Новый Структура("ЭтапРаботы", Перечисления.ЭтапыРаботыСКандидатами.Утверждение)).Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ПрофильОбъект.ЭтапыРаботыСКандидатами, 
					Перечисления.ЭтапыРаботыСКандидатами.Действующие(), "ЭтапРаботы");
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрофильОбъект);
			КонецЕсли;
			Профили.Вставить(ПрофильОбъект.Ссылка, Истина);
		КонецЕсли;
		Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
			НаборЗаписей = РегистрыСведений.РаботаСКандидатами.СоздатьНаборЗаписей();
			ДанныеКандидата = ДанныеКандидатов.НайтиСтроки(Новый Структура("Кандидат", Выборка.Кандидат))[0];
			Если ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Согласовано Тогда
				СтрокаНабора = НаборЗаписей.Добавить();
				СтрокаНабора.Кандидат = Выборка.Кандидат;
				СтрокаНабора.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.Утверждение;
				СтрокаНабора.Период = ДанныеКандидата.ДатаРешения + 1;
				СтрокаНабора.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
				СтрокаНабора.Комментарий = ДанныеКандидата.КомментарийРешения;
			КонецЕсли;
			Если РешенияПоКандидатам[Выборка.Кандидат] <> Неопределено Тогда
				Решение = РешенияПоКандидатам[Выборка.Кандидат];
				СтрокаНабора = НаборЗаписей.Добавить();
				СтрокаНабора.Кандидат = Выборка.Кандидат;
				СтрокаНабора.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу;
				СтрокаНабора.Период = КонецДня(РеквизитыРешений[Решение].ДатаПриема) - 1;
				СтрокаНабора.СостояниеЭтапа = ?(РеквизитыРешений[Решение].Проведен,
					Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден,
					Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован);
				СтрокаНабора.Комментарий = РеквизитыРешений[Решение].Комментарий;
				СтрокаНабора.ДокументОснование = Решение;
			КонецЕсли;
			Если СотрудникиПоКандидатам[Выборка.Кандидат] <> Неопределено Тогда
				НайденныеСтроки = КадровыеДанные.НайтиСтроки(
					Новый Структура("Сотрудник", СотрудникиПоКандидатам[Выборка.Кандидат]));
				Если НайденныеСтроки.Количество() > 0 И ЗначениеЗаполнено(НайденныеСтроки[0].ДатаПриема) Тогда
					СтрокаНабора = НаборЗаписей.Добавить();
					СтрокаНабора.Кандидат = Выборка.Кандидат;
					СтрокаНабора.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу;
					СтрокаНабора.Период = КонецДня(НайденныеСтроки[0].ДатаПриема);
					СтрокаНабора.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
					СтрокаНабора.ДокументОснование = НайденныеСтроки[0].ПриказОПриеме;
				КонецЕсли;
			КонецЕсли;
			Если НаборЗаписей.Количество() > 0 Тогда
				Пока Выборка.Следующий() Цикл
					Если ЗначениеЗаполнено(Выборка.ЭтапРаботы) Тогда
						ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
					КонецЕсли;
				КонецЦикла;
				НаборЗаписей.Отбор.Кандидат.Установить(Выборка.Кандидат);
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КонецЕсли;
			ОбновленныеКандидаты.Добавить(Выборка.Кандидат); // Текуший этап все равно нужно пересчитать.
		КонецЦикла;
	КонецЦикла;

	ОбновитьТекущийЭтапРаботыКандидатов(ОбновленныеКандидаты, Истина);
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ДобавитьПредопределенныеЭтапыВакансийПрофилейДолжности(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПредопределенныеЭтапы", Перечисления.ЭтапыРаботыСКандидатами.Действующие());
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Вакансии.Ссылка КАК Ссылка,
		|	Вакансии.СоответствуетПрофилюДолжности КАК СоответствуетПрофилюДолжности,
		|	Вакансии.ПрофильДолжности КАК ПрофильДолжности
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	НЕ Вакансии.Ссылка В
		|				(ВЫБРАТЬ
		|					Этапы.Ссылка
		|				ИЗ
		|					Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК Этапы
		|				ГДЕ
		|					Этапы.ЭтапРаботы В (&ПредопределенныеЭтапы))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрофилиДолжностей.Ссылка,
		|	ЛОЖЬ,
		|	NULL
		|ИЗ
		|	Справочник.ПрофилиДолжностей КАК ПрофилиДолжностей
		|ГДЕ
		|	НЕ ПрофилиДолжностей.Ссылка В
		|				(ВЫБРАТЬ
		|					Этапы.Ссылка
		|				ИЗ
		|					Справочник.ПрофилиДолжностей.ЭтапыРаботыСКандидатами КАК Этапы
		|				ГДЕ
		|					Этапы.ЭтапРаботы В (&ПредопределенныеЭтапы))";
	
	ОписаниеДанных = Новый Массив;
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.Вакансии));
	ОписаниеДанных.Добавить(ОписаниеБлокируемыхДанных(Метаданные.Справочники.ПрофилиДолжностей));

	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Профили = Новый Соответствие();

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Профили.Получить(Выборка.Ссылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.Вакансии
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(СправочникОбъект.ЭтапыРаботыСКандидатами, 
			Перечисления.ЭтапыРаботыСКандидатами.Действующие(), "ЭтапРаботы");
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
		Если Выборка.СоответствуетПрофилюДолжности 
			И ЗначениеЗаполнено(Выборка.ПрофильДолжности) 
			И Профили.Получить(Выборка.ПрофильДолжности) = Неопределено Тогда
			ПрофильОбъект = Выборка.ПрофильДолжности.ПолучитьОбъект();
			Если ПрофильОбъект.ЭтапыРаботыСКандидатами.НайтиСтроки(
				Новый Структура("ЭтапРаботы", Перечисления.ЭтапыРаботыСКандидатами.Утверждение)).Количество() = 0 Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ПрофильОбъект.ЭтапыРаботыСКандидатами, 
					Перечисления.ЭтапыРаботыСКандидатами.Действующие(), "ЭтапРаботы");
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ПрофильОбъект);
			КонецЕсли;
			Профили.Вставить(ПрофильОбъект.Ссылка, Истина);
		КонецЕсли;
	КонецЦикла;

	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Функция ОписаниеБлокируемыхДанных(МетаданныеОбъекта)
	Описание = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(МетаданныеОбъекта);
	Описание.ПоляБлокировки.Очистить();
	Возврат Описание;
КонецФункции

// Обновляет данные регистра ГруппыЗначенийДоступа.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ОбновитьДанныеРегистраГруппыЗначенийДоступа(ПараметрыОбновления) Экспорт
	
	Если Константы.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов.Получить() Тогда
		РегистрыСведений.ГруппыЗначенийДоступа.ОбновитьДанныеРегистра();
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует отказаться от использования.
Процедура ДополнитьОписаниеПрофиляДоступомКИнтерфейсу(ОписаниеПрофиля) Экспорт
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область ЗапросыПоПредставлению

Функция ЗапросСтажПринятыхКандидатов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Месяцев
		|ПОМЕСТИТЬ ВТСтажМесяцы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	4
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	5
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	6
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	7
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	8
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	9
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	10
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	11
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	12
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	24
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	36
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	48
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	60
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСтажМесяцы.Месяцев КАК Месяцев
		|ПОМЕСТИТЬ Представления_СтажПринятыхКандидатов
		|ИЗ
		|	ВТСтажМесяцы КАК ВТСтажМесяцы
		|{ГДЕ
		|	(ВТСтажМесяцы.Месяцев В (&Стаж))}";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

// Возвращаемое значение:
//	ТаблицаЗначений - Таблица значений, содержащая поля:
//	* ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - физическое лицо сотрудника.
//	* Сотрудник		 - СправочникСсылка.Сотрудники - сотрудник.
//	* Кандидат		 - СправочникСсылка.Кандидаты - приоритетный кандидат по сотруднику.
//	* Вакансия		 - СправочникСсылка.Вакансии - вакансия кандидата.
Функция ТаблицаКандидатыПоСотрудникам()
	
	КандидатыПоСотрудникам = Новый ТаблицаЗначений;
	КандидатыПоСотрудникам.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	КандидатыПоСотрудникам.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	КандидатыПоСотрудникам.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	КандидатыПоСотрудникам.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	
	Возврат КандидатыПоСотрудникам;
	
КонецФункции

Процедура ЗаполнитьПолеЕслиНеЗаполнено(Коллекция, ИмяПоля, ЗначениеЗаполнения)
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл
		Если Не ЗначениеЗаполнено(ЭлементКоллекции[ИмяПоля]) Тогда
			ЭлементКоллекции[ИмяПоля] = ЗначениеЗаполнения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПриоритетКандидата(ДанныеСотрудника, ДанныеКандидата)
	
	ПриоритетКандидата = Неопределено;
	Если ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Согласовано
		И ДанныеСотрудника.ДолжностьПоШтатномуРасписанию = ДанныеКандидата.Позиция Тогда
		ПриоритетКандидата = 1;
	ИначеЕсли ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Согласовано
		И ДанныеСотрудника.МестоВСтруктуреПредприятия = ДанныеКандидата.Подразделение Тогда
		ПриоритетКандидата = 2;
	ИначеЕсли ДанныеКандидата.Состояние = Перечисления.СостоянияСогласования.Согласовано Тогда
		ПриоритетКандидата = 3;
	Иначе
		ПриоритетКандидата = 4;
	КонецЕсли;
	
	Возврат ПриоритетКандидата;
	
КонецФункции

Процедура ДополнитьИнформациюПоДаннымОтклика(ДанныеКандидата, Отклик)
	
	ДанныеКандидата.АдресРезюме = Отклик.АдресРезюме;
	
	Если Не ЗначениеЗаполнено(ДанныеКандидата.Фамилия) Тогда
		ДанныеКандидата.Фамилия = Отклик.Фамилия;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеКандидата.Имя) Тогда
		ДанныеКандидата.Имя = Отклик.Имя;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеКандидата.Отчество) Тогда
		ДанныеКандидата.Отчество = Отклик.Отчество;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеКандидата.ДатаРождения) Тогда
		ДанныеКандидата.ДатаРождения = Отклик.ДатаРождения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отклик.Телефон) Тогда
		ДобавитьКонтактнуюИнформациюПоОтклику(
			ДанныеКандидата.КонтактнаяИнформация,
			Перечисления.ТипыКонтактнойИнформации.Телефон,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"),
			Отклик.Телефон);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отклик.EMail) Тогда
		ДобавитьКонтактнуюИнформациюПоОтклику(
			ДанныеКандидата.КонтактнаяИнформация,
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"),
			Отклик.EMail);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отклик.Адрес) Тогда
		ДобавитьКонтактнуюИнформациюПоОтклику(
			ДанныеКандидата.КонтактнаяИнформация,
			Перечисления.ТипыКонтактнойИнформации.Адрес,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов"),
			Отклик.Адрес);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКонтактнуюИнформациюПоОтклику(КонтактнаяИнформация, Тип, Вид, Представление)
	
	Для Индекс = 0 По КонтактнаяИнформация.ВГраница() Цикл
		СтрокаКИ = КонтактнаяИнформация[Индекс];
		
		Если СтрокаКИ.Вид = Вид Тогда
			Если ЗначениеЗаполнено(СтрокаКИ.Представление) Тогда
				Возврат;
			Иначе
				КонтактнаяИнформация.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаКИ = ОписаниеКонтактнойИнформации();
	СтрокаКИ.Тип = Тип;
	СтрокаКИ.Вид = Вид;
	СтрокаКИ.Представление = Представление;
	КонтактнаяИнформация.Добавить(СтрокаКИ);
	
КонецПроцедуры

Функция ТекстЗапросаСоздатьВТЗадублированныеКандидаты()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.ФИО КАК ФИО,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) КАК Количество
		|ПОМЕСТИТЬ ВТЗадублированныеФИО
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.ФИО <> """"
		|СГРУППИРОВАТЬ ПО
		|	ЛичныеДанныеКандидатов.ФИО
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПоискаФизическихЛиц.Телефоны КАК Телефон,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) КАК Количество
		|ПОМЕСТИТЬ ВТЗадублированныеТелефоны
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата
		|ГДЕ
		|	ДанныеПоискаФизическихЛиц.Телефоны <> """"
		|СГРУППИРОВАТЬ ПО
		|	ДанныеПоискаФизическихЛиц.Телефоны
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.EMailПредставление КАК EMail,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) КАК Количество
		|ПОМЕСТИТЬ ВТЗадублированныеEMail
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.EMailПредставление <> """"
		|СГРУППИРОВАТЬ ПО
		|	ЛичныеДанныеКандидатов.EMailПредставление
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) КАК Количество
		|ПОМЕСТИТЬ ВТЗадублированныеФизическиеЛица
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.ФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ЛичныеДанныеКандидатов.ФизическоеЛицо
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ФИО КАК ОбластьПоиска,
		|	ЗадублированныеФИО.ФИО КАК Значение,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Представление,
		|	ЗадублированныеФИО.ФИО КАК ФИО,
		|	"""" КАК Телефон,
		|	"""" КАК EMail,
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТЗадублированныеКандидаты
		|ИЗ
		|	ВТЗадублированныеФИО КАК ЗадублированныеФИО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЗадублированныеФИО.ФИО = ЛичныеДанныеКандидатов.ФИО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Телефон КАК ОбластьПоиска,
		|	ЗадублированныеТелефоны.Телефон КАК Значение,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Представление,
		|	"""" КАК ФИО,
		|	ЗадублированныеТелефоны.Телефон КАК Телефон,
		|	"""" КАК EMail,
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо
		|ИЗ
		|	ВТЗадублированныеТелефоны КАК ЗадублированныеТелефоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ЗадублированныеТелефоны.Телефон = ДанныеПоискаФизическихЛиц.Телефоны
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата = ДанныеПоискаФизическихЛиц.ФизическоеЛицо
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&EMail КАК ОбластьПоиска,
		|	ЗадублированныеEMail.EMail КАК Значение,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Представление,
		|	"""" КАК ФИО,
		|	"""" КАК Телефон,
		|	ЗадублированныеEMail.EMail КАК EMail,
		|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо
		|ИЗ
		|	ВТЗадублированныеEMail КАК ЗадублированныеEMail
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЗадублированныеEMail.EMail = ЛичныеДанныеКандидатов.EMailПредставление
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ФизическоеЛицо КАК ОбластьПоиска,
		|	ЗадублированныеФизическиеЛица.ФизическоеЛицо КАК Значение,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Представление,
		|	"""" КАК ФИО,
		|	"""" КАК Телефон,
		|	"""" КАК EMail,
		|	ЗадублированныеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	ВТЗадублированныеФизическиеЛица КАК ЗадублированныеФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ПО ЗадублированныеФизическиеЛица.ФизическоеЛицо = ЛичныеДанныеКандидатов.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЛичныеДанныеКандидатов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗадублированныеФИО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗадублированныеТелефоны
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗадублированныеФизическиеЛица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТЗадублированныеEMail";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Параметры:
//  ЗапросВажностиОбразований - Массив из Строка
// 
// Возвращаемое значение:
//  Строка
Функция ТекстЗапросаОбразованиеКандидатов(ЗапросВажностиОбразований)
	
	ТекстЗапроса =  СтрСоединить(ЗапросВажностиОбразований, Символы.ПС)
		+ ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблицаОтборов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образование.ВидОбразования КАК ВидОбразования,
		|	Образование.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Образование.Факультет КАК Факультет,
		|	Образование.Специальность КАК Специальность,
		|	Образование.ГодОкончания КАК ГодОкончания,
		|	Образование.НомерСтроки
		|ПОМЕСТИТЬ ВТОбразованияКандидатов
		|ИЗ
		|	ВТОтборы КАК ТаблицаОтборов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЛичныеДанныеКандидатов.Образование КАК Образование
		|		ПО ТаблицаОтборов.ЛичныеДанныеКандидата = Образование.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразованияКандидатов.ЛичныеДанныеКандидата,
		|	МАКСИМУМ(ОбразованияКандидатов.ВидОбразования) КАК ВидОбразования,
		|	МАКСИМУМ(ОбразованияКандидатов.УчебноеЗаведение) КАК УчебноеЗаведение,
		|	МАКСИМУМ(ОбразованияКандидатов.Факультет) КАК Факультет,
		|	МАКСИМУМ(ОбразованияКандидатов.Специальность) КАК Специальность,
		|	МАКСИМУМ(ОбразованияКандидатов.ГодОкончания) КАК ГодОкончания
		|ПОМЕСТИТЬ ВТОбразованиеКандидатовМаксимум
		|ИЗ
		|	ВТОбразованияКандидатов КАК ОбразованияКандидатов
		|СГРУППИРОВАТЬ ПО
		|	ОбразованияКандидатов.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбразованияФЛ.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВЫРАЗИТЬ(ОбразованияФЛ.ВидОбразования КАК Справочник.ВидыОбразованияФизическихЛиц) КАК ВидОбразования,
		|	ОбразованияФЛ.УчебноеЗаведение КАК УчебноеЗаведение,
		|	ОбразованияФЛ.Факультет КАК Факультет,
		|	ОбразованияФЛ.Специальность КАК Специальность,
		|	ОбразованияФЛ.ГодОкончания КАК ГодОкончания,
		|	ОбразованияФЛ.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(ВидыОбразованийПоВажности.Важность, 0) КАК Важность
		|ПОМЕСТИТЬ ВТОбразованияКандидатовПервые
		|ИЗ
		|	ВТОбразованияКандидатов КАК ОбразованияФЛ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыОбразованийПоВажности КАК ВидыОбразованийПоВажности
		|		ПО ОбразованияФЛ.ВидОбразования = ВидыОбразованийПоВажности.ВидОбразования
		|ГДЕ
		|	ОбразованияФЛ.ВидОбразования В (ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.НачальноеПрофессиональноеОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ОсновноеОбщееОбразование),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура),
		|		ЗНАЧЕНИЕ(Справочник.ВидыОбразованияФизическихЛиц.СреднееОбщееОбразование))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(Образования.Важность) КАК Важность
		|ПОМЕСТИТЬ ВТОбразование1ПриоритетКодаВидаОбразования
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(Образования.ВидОбразования) КАК ВидОбразования,
		|	Образования.Важность КАК Важность
		|ПОМЕСТИТЬ ВТОбразование1ПриоритетВидаОбразования
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование1ПриоритетКодаВидаОбразования КАК Образование1ПриоритетКодаВидаОбразования
		|		ПО Образования.ЛичныеДанныеКандидата = Образование1ПриоритетКодаВидаОбразования.ЛичныеДанныеКандидата
		|		И Образования.Важность = Образование1ПриоритетКодаВидаОбразования.Важность
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.Важность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования КАК ВидОбразования,
		|	МАКСИМУМ(Образования.ГодОкончания) КАК ГодОкончания
		|ПОМЕСТИТЬ ВТОбразование1ПриоритетГодаОкончания
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование1ПриоритетВидаОбразования КАК Образование1ПриоритетВидаОбразования
		|		ПО Образования.ЛичныеДанныеКандидата = Образование1ПриоритетВидаОбразования.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование1ПриоритетВидаОбразования.ВидОбразования
		|		И Образования.Важность = Образование1ПриоритетВидаОбразования.Важность
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования КАК ВидОбразования,
		|	Образования.ГодОкончания КАК ГодОкончания,
		|	МИНИМУМ(Образования.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТОбразование1ПриоритетНомераСтроки
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование1ПриоритетГодаОкончания КАК Образование1ПриоритетГОдаОкончания
		|		ПО Образования.ЛичныеДанныеКандидата = Образование1ПриоритетГОдаОкончания.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование1ПриоритетГОдаОкончания.ВидОбразования
		|		И Образования.ГодОкончания = Образование1ПриоритетГОдаОкончания.ГодОкончания
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования,
		|	Образования.ГодОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВЫРАЗИТЬ(Образования.ВидОбразования КАК Справочник.ВидыОбразованияФизическихЛиц) КАК Образование1ВидОбразования,
		|	Образования.УчебноеЗаведение КАК Образование1УчебноеЗаведение,
		|	Образования.ГодОкончания КАК Образование1ГодОкончания,
		|	Образования.Специальность КАК Образование1Специальность,
		|	Образования.Факультет КАК Образование1Факультет
		|ПОМЕСТИТЬ ВТОбразованиеПервое
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование1ПриоритетНомераСтроки КАК Образование1ПриоритетНомераСтроки
		|		ПО Образования.ЛичныеДанныеКандидата = Образование1ПриоритетНомераСтроки.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование1ПриоритетНомераСтроки.ВидОбразования
		|		И Образования.ГодОкончания = Образование1ПриоритетНомераСтроки.ГодОкончания
		|		И Образования.НомерСтроки = Образование1ПриоритетНомераСтроки.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образования.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Образования.ВидОбразования КАК Справочник.ВидыОбразованияФизическихЛиц) КАК ВидОбразования,
		|	Образования.УчебноеЗаведение КАК УчебноеЗаведение,
		|	Образования.ГодОкончания КАК ГодОкончания,
		|	Образования.Специальность КАК Специальность,
		|	Образования.Факультет КАК Факультет,
		|	Образования.Важность КАК Важность
		|ПОМЕСТИТЬ ВТОбразованияКандидатовВторые
		|ИЗ
		|	ВТОбразованияКандидатовПервые КАК Образования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбразование1ПриоритетНомераСтроки КАК Образование1ПриоритетНомераСтроки
		|		ПО Образования.ЛичныеДанныеКандидата = Образование1ПриоритетНомераСтроки.ЛичныеДанныеКандидата
		|		И Образования.НомерСтроки = Образование1ПриоритетНомераСтроки.НомерСтроки
		|ГДЕ
		|	Образование1ПриоритетНомераСтроки.НомерСтроки ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(Образования.Важность) КАК Важность
		|ПОМЕСТИТЬ ВТОбразование2ПриоритетКодаВидаОбразования
		|ИЗ
		|	ВТОбразованияКандидатовВторые КАК Образования
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(Образования.ВидОбразования) КАК ВидОбразования,
		|	Образования.Важность КАК Важность
		|ПОМЕСТИТЬ ВТОбразование2ПриоритетВидаОбразования
		|ИЗ
		|	ВТОбразованияКандидатовВторые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование2ПриоритетКодаВидаОбразования КАК Образование2ПриоритетКодаВидаОбразования
		|		ПО Образования.ЛичныеДанныеКандидата = Образование2ПриоритетКодаВидаОбразования.ЛичныеДанныеКандидата
		|		И Образования.Важность = Образование2ПриоритетКодаВидаОбразования.Важность
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.Важность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования КАК ВидОбразования,
		|	МАКСИМУМ(Образования.ГодОкончания) КАК ГодОкончания
		|ПОМЕСТИТЬ ВТОбразование2ПриоритетГодаОкончания
		|ИЗ
		|	ВТОбразованияКандидатовВторые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование2ПриоритетВидаОбразования КАК Образование2ПриоритетВидаОбразования
		|		ПО Образования.ЛичныеДанныеКандидата = Образование2ПриоритетВидаОбразования.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование2ПриоритетВидаОбразования.ВидОбразования
		|		И Образования.Важность = Образование2ПриоритетВидаОбразования.Важность
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования КАК ВидОбразования,
		|	Образования.ГодОкончания КАК ГодОкончания,
		|	МИНИМУМ(Образования.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ВТОбразование2ПриоритетНомераСтроки
		|ИЗ
		|	ВТОбразованияКандидатовВторые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование2ПриоритетГодаОкончания КАК Образование2ПриоритетГодаОкончания
		|		ПО Образования.ЛичныеДанныеКандидата = Образование2ПриоритетГОдаОкончания.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование2ПриоритетГОдаОкончания.ВидОбразования
		|		И Образования.ГодОкончания = Образование2ПриоритетГодаОкончания.ГодОкончания
		|СГРУППИРОВАТЬ ПО
		|	Образования.ЛичныеДанныеКандидата,
		|	Образования.ВидОбразования,
		|	Образования.ГодОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Образования.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВЫРАЗИТЬ(Образования.ВидОбразования КАК Справочник.ВидыОбразованияФизическихЛиц) КАК Образование2ВидОбразования,
		|	Образования.УчебноеЗаведение КАК Образование2УчебноеЗаведение,
		|	Образования.ГодОкончания КАК Образование2ГодОкончания,
		|	Образования.Специальность КАК Образование2Специальность,
		|	Образования.Факультет КАК Образование2Факультет
		|ПОМЕСТИТЬ ВТОбразованиеВторое
		|ИЗ
		|	ВТОбразованияКандидатовВторые КАК Образования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбразование2ПриоритетНомераСтроки КАК Образование2ПриоритетНомераСтроки
		|		ПО Образования.ЛичныеДанныеКандидата = Образование2ПриоритетНомераСтроки.ЛичныеДанныеКандидата
		|		И Образования.ВидОбразования = Образование2ПриоритетНомераСтроки.ВидОбразования
		|		И Образования.ГодОкончания = Образование2ПриоритетНомераСтроки.ГодОкончания
		|		И Образования.НомерСтроки = Образование2ПриоритетНомераСтроки.НомерСтроки";
		
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОтбораПоВидуОбразования()
	
	Текст = "ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			Справочник.ЛичныеДанныеКандидатов.Образование КАК ЛичныеДанныеКандидатовОбразование
		|		ГДЕ
		|			ЛичныеДанныеКандидатовОбразование.Ссылка = Т.Ссылка
		|			И ЛичныеДанныеКандидатовОбразование.ВидОбразования В (&ОтборПоОбразованию))";
		
	Возврат Текст;

КонецФункции

// Параметры:
//  МассивДанных - Массив из Произвольный - Массив данных, из которого нужно выделить личные данные кандидатов.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ЛичныеДанныеКандидатов
Функция ЛичныеДанныеКандидатовИзМассиваДанных(МассивДанных)
	
	Если ТипЗнч(МассивДанных) <> Тип("Массив") Тогда
		МассивДанных = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(МассивДанных);
	КонецЕсли;
	
	ЛичныеДанныеКандидатов = Новый Массив;
	Для Каждого УчастникКадровогоРезерва Из МассивДанных Цикл
		Если ТипЗнч(УчастникКадровогоРезерва) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
			ЛичныеДанныеКандидатов.Добавить(УчастникКадровогоРезерва);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЛичныеДанныеКандидатов;
	
КонецФункции

#КонецОбласти