///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Инициирует уведомление об имеющихся в МС поставляемых данных конкретного вида
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ВидДанных - Строка - имя вида поставляемых данных, например "ИнформационныеСсылки"
//
Процедура ЗапроситьДанные(ВидДанных) Экспорт
КонецПроцедуры

// Получить дескрипторы данных по заданным условиям.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ВидДанных - Строка - имя вида поставляемых данных.
//  Фильтр - Неопределено - фильтр не задан
//         - Массив из Структура:
//  * Код - Строка
//  * Значение - Строка
//
// Возвращаемое значение:
//    ОбъектXDTO - типа ArrayOfDescriptor.
//
Функция ДескрипторыПоставляемыхДанныхИзМенеджера(Знач ВидДанных, Знач Фильтр = Неопределено) Экспорт  
КонецФункции

// Получить данные по заданным условиям.
// Для получения самого файла необходимо вызвать ПолучитьПоставляемыеДанныеИзКэша.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ВидДанных - Строка - имя вида поставляемых данных.
//  Фильтр - Неопределено - фильтр не задан
//         - Массив из Структура:
//  * Код - Строка
//  * Значение - Строка
//  ВВидеXDTO - Булево - в каком виде возвращать значения.
//
// Возвращаемое значение:
//    - ОбъектXDTO - типа ArrayOfDescriptor
//    - Массив из Структура:
//    * ВидДанных - Строка
//    * ДатаДобавления - Дата
//    * ИдентификаторФайла - УникальныйИдентификатор
//    * Характеристики - Массив из Структура:
//    	* Код - Строка
//    	* Значение - Строка
//    	* Ключевая - Булево
//
Функция ДескрипторыПоставляемыхДанныхИзКэша(Знач ВидДанных, Знач Фильтр = Неопределено, Знач ВВидеXDTO = Ложь) Экспорт
КонецФункции

// Инициирует обработку данных.
//
// Может использоваться в связке с ДескрипторыПоставляемыхДанныхИзМенеджера для 
// ручной инициации процесса обработки данных. После вызова метода система поведет 
// себя так, как будто она только что получила уведомление о доступности новых данных, 
// с указанным дескриптором - будет вызван ДоступныНовыеДанные, а затем, при необходимости, 
// ОбработатьНовыеДанные для соответствующих обработчиков.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Дескриптор - ОбъектXDTO - Descriptor.
//
Процедура ЗагрузитьИОбработатьДанные(Знач Дескриптор) Экспорт
КонецПроцедуры
	
// Помещает данные в справочник ПоставляемыеДанные.
//
// Данные сохраняются либо в том на диске, либо в поле таблицы ПоставляемыеДанные в 
// зависимости от константы ХранитьФайлыВТомахНаДиске и наличия свободных томов. Данные 
// могут быть позднее извлечены при помощи поиска по реквизитам, либо путем указания 
// уникального идентификатора, который передавался в поле Дескриптор.FileGUID. Если в базе 
// уже есть данные с тем же видом данных и набором ключевых характеристик - новые данные 
// замещают старые. При это используется обновление существующего элемента справочника, а 
// не удаление и создание нового.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Дескриптор - ОбъектXDTO, Массив из Структура - Descriptor или структура с полями:
//    * ВидДанных - Строка
//    * ДатаДобавления - Дата
//    * ИдентификаторФайла - УникальныйИдентификатор
//    * Характеристики - Массив из Структура:
//    	* Код - Строка
//    	* Значение - Строка
//    	* Ключевая - Булево
//   ПутьКФайлу - Строка - полное имя извлеченного файла.
//
Процедура СохранитьПоставляемыеДанныеВКэш(Знач Дескриптор, Знач ПутьКФайлу) Экспорт
КонецПроцедуры

// Удаляет файл из кэша.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор - уникальный идентификатор файла.
//
Процедура УдалитьПоставляемыеДанныеИзКэша(Знач ИдентификаторФайла) Экспорт
КонецПроцедуры

// Возвращает двоичные данные присоединенного файла.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор - уникальный идентификатор файла.
//
// Возвращаемое значение:
//  ДвоичныеДанные - двоичные данные поставляемых данных.
//
Функция ПоставляемыеДанныеИзКэша(Знач ИдентификаторФайла) Экспорт
КонецФункции

// Проверяет наличие данных с указанными ключевыми характеристиками в кэше.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   Дескриптор - ОбъектXDTO - Descriptor.
//
// Возвращаемое значение:
//  Булево - наличие дескриптора в кэше.
//
Функция ЕстьВКеше(Знач Дескриптор) Экспорт
КонецФункции

// Возвращает массив ссылок на данные, удовлетворяющие заданным условиям.
//
// Параметры:
//  ВидДанных - Строка - имя вида поставляемых данных.
//  Фильтр - Неопределено - фильтр не задан
//         - Массив из Структура:
//  * Код - Строка -
//  * Значение - Строка -
//
// Возвращаемое значение:
//    Массив из ЛюбаяСсылка - массив ссылок на данные.
//
Функция СсылкиПоставляемыхДанныхИзКэша(Знач ВидДанных, Знач Фильтр = Неопределено) Экспорт

	Возврат Новый Массив();
	
КонецФункции

// Возвращает пользовательское представление дескриптора поставляемых данных.
// Может быть использовано при выводе сообщений в журнал регистрации.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  Дескриптор - ОбъектXDTO - типа Descriptor или  структура с полями.
//	 	"ВидДанных, ДатаДобавления, ИдентификаторФайла, Характеристики",
//    	где Характеристики - массив структур с полями "Код, Значение".
//	ДескрипторJSON - Булево - признак того, что дескриптор в формате JSON
//
// Возвращаемое значение:
//  Строка - пользовательское представление дескриптора.
//
Функция ПолучитьОписаниеДанных(Знач Дескриптор, Знач ДескрипторJSON = Ложь) Экспорт
КонецФункции

///////////////////////////////////////////////////////////////////////////////////
// Обновление информации в областях данных.

// Возвращает список областей данных, в которые еще не были скопированы поставляемые данные.
// @skip-check module-empty-method - особенность реализации.
//
// В случае первого вызова функции возвращается полный набор доступных областей.
// При последующем вызове, при восстановлении после сбоя, будут возвращены только
// необработанные области. После копирования данных в область следует вызвать ОбластьОбработана.
//
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор - идентификатор файла поставляемых данных,
//  КодОбработчика - Строка - код обработчика,
//  ВключаяНеразделенную - Булево - если Истина, ко всем имеющимся областям добавится область с кодом -1.
// 
// Возвращаемое значение:
//  Массив из Число - области требующие обработки.
//
Функция ОбластиТребующиеОбработки(Знач ИдентификаторФайла, Знач КодОбработчика, Знач ВключаяНеразделенную = Ложь) Экспорт
КонецФункции

// Удаляет область из списка необработанных. Выключает разделение сеанса (если оно было включено),
// поскольку при включенном разделении запись в неразделенный регистр запрещена.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//  ИдентификаторФайла - УникальныйИдентификатор - файла поставляемых данных,
//  КодОбработчика - Строка - код обработчика,
//  ОбластьДанных - Число - идентификатор обработанной области.
// 
Процедура ОбластьОбработана(Знач ИдентификаторФайла, Знач КодОбработчика, Знач ОбластьДанных) Экспорт
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем 

// Возвращает зарегистрированные обработчики поставляемых данных.
// Используется для запуска процедур проверки и загрузки новых поставляемых данных. Так же может
// быть использована для получения списка поддерживаемых видов поставляемых данных.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица с колонками:
//		* ВидДанных - Строка - код вида данных, обрабатываемый обработчиком.
//		* КодОбработчика - Строка - используется при восстановлении обработки данных после сбоя.
//		* Обработчик - ОбщийМодуль - модуль, содержащий следующие экспортные процедуры:
//			ДоступныНовыеДанные(Дескриптор, Загружать)  
//			ОбработатьНовыеДанные(Дескриптор, ПутьКФайлу)
//			ОбработкаДанныхОтменена(Дескриптор)
//
Функция ПолучитьОбработчики() Экспорт
	
	Обработчики = Новый ТаблицаЗначений;
	Обработчики.Колонки.Добавить("ВидДанных");
	Обработчики.Колонки.Добавить("Обработчик");
	Обработчики.Колонки.Добавить("КодОбработчика");
	
	ИнтеграцияПодсистемБТС.ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	ПоставляемыеДанныеПереопределяемый.ПолучитьОбработчикиПоставляемыхДанных(Обработчики);
	
	Возврат Обработчики;
	
КонецФункции

#КонецОбласти

#КонецОбласти
