#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МестоположениеФормы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.МестоположениеФормы();
	МестоположениеФормы.Документооборот2 = Истина;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуБИД(
		МестоположениеФормы,
		"МоиОтчеты",
		Неопределено,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти