#Область ПрограммныйИнтерфейс

// Открывает форму настроек интеграции с порталом "Работа России".
//
// Параметры:
//   Организация - СправочникСсылка.Организации - Организация, для которой будут показаны настройки.
//
Процедура ОткрытьНастройкиОрганизации(Организация = Неопределено) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Организация);
	
	ОткрытьФорму("ОбщаяФорма.ИнтеграцияСПорталомРаботаРоссии", Параметры,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. УправлениеПечатьюКлиентПереопределяемый.ПечатьДокументовВыполнитьКоманду
//
Процедура ПечатьДокументовВыполнитьКоманду(Форма, Команда, ПродолжитьВыполнениеНаСервере, ДополнительныеПараметры) Экспорт
	
	Если Команда.Имя = "ПередатьПодписанныеPDFНаРаботаРоссии" Тогда
		ЭДОБЗККлиент.ПодписатьПоНастройкам(Форма,
			ПредопределенноеЗначение("Перечисление.ДействияСФайламиДокументовЭДОБЗК.ПередатьНаРаботаРоссии"));
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстПредупрежденияОрганизацияНеИспользуетПРР() Экспорт
	
	Возврат НСтр("ru = 'Организация не имеет регистрации на портале ""Работа России""'");
	
КонецФункции
	
Процедура ПередатьДокументы(ПечатныеФормы) Экспорт
	
	ОписанияПечатныхФорм = Новый Массив;
	ПрисоединенныеФайлы = Новый Массив;
	Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		
		Если ТипЗнч(ПечатнаяФорма) = Тип("Структура") Тогда
			ОписанияПечатныхФорм.Добавить(ПечатнаяФорма);
		Иначе
			ПрисоединенныеФайлы.Добавить(ПечатнаяФорма);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПрисоединенныеФайлы.Количество() > 0 Тогда
		ЭДОБЗКВызовСервера.ЗапланироватьДействияСПечатнымиФормами(ПечатныеФормы,
			ПредопределенноеЗначение("Перечисление.ДействияСФайламиДокументовЭДОБЗК.ПередатьНаРаботаРоссии"));
	КонецЕсли;
	
	Если ОписанияПечатныхФорм.Количество() > 0 Тогда
		ИнтеграцияСРаботаРоссииВызовСервера.ПередатьДокументыПоОписаниямПечатныхФорм(ОписанияПечатныхФорм);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
