
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИспользованиеВОбъектах.Отбор, "СтатусДокумента", Неопределено,,, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИспользованиеВОбъектах();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаИспользованияВОбъектах", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыШаблоныПроцессов

&НаКлиенте
Процедура ИспользованиеВОбъектахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ИспользованиеВОбъектах.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Поле = Элементы.ИспользованиеВОбъектах.ТекущийЭлемент;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОбъектИспользования) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ОбъектИспользования);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИспользованиеВОбъектах(Команда)
	
	ОтображениеИспользованияВОбъектах = Не ОтображениеИспользованияВОбъектах;
	УстановитьВидимостьИспользованиеВОбъектах();
	ПроверкаИспользованияВОбъектах();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьИспользованиеВОбъектах()
	
	Элементы.ФормаИспользованиеВОбъектах.Пометка = ОтображениеИспользованияВОбъектах;
	Элементы.ИспользованиеВОбъектах.Видимость = ОтображениеИспользованияВОбъектах;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИспользованияВОбъектах()
	
	Если ОтображениеИспользованияВОбъектах Тогда
	
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИспользованиеВОбъектах.Отбор, "СтатусДокумента", ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка"),,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИспользованиеВОбъектах.Отбор, "СтатусДокумента", ТекущиеДанные.Ссылка,,, Истина);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

