
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменДанными

// Пересчитывает зависимые данные после загрузки сообщения обмена
//
// Параметры:
//		ЗависимыеДанные - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные ведущих данных
//			* ЗависимыеМетаданные - ОбъектМетаданных - Метаданные текущего объекта
//			* ВедущиеДанные - Массив объектов, заполненный при загрузке сообщения обмена
//				по этим объектам требуется обновить зависимые данные
//
Процедура ОбновитьЗависимыеДанныеПослеЗагрузкиОбменаДанными(ЗависимыеДанные) Экспорт
	
	ТаблицаОбновления = КадровыйУчетАналитикаДанных.НоваяТаблицаОбновлениеАналитикиСтажейКандидатов();
	
	Для Каждого СтрокаТаблицы Из ЗависимыеДанные Цикл
		ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоДаннымИспытательногоСрокаСотрудников(ТаблицаОбновления, СтрокаТаблицы);
	КонецЦикла;
	
	КадровыйУчетАналитикаДанных.ЗарегистрироватьОбновлениеАналитикиСтажейКандидатов(ТаблицаОбновления);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.КадроваяИсторияСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновленияКадровойИсторииДляСтажейКандидатов, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоДаннымИспытательногоСрокаСотрудников(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.ДанныеИспытательногоСрокаСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновленияДанныхИспытательногоСрокаДляСтажейКандидатов, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
