// @strict-types

#Область ПрограммныйИнтерфейс

// Получает задания очереди по заданному отбору.
//
// Параметры:
//  Отбор - Структура - значения, по которым требуется отбирать задания (объединяются по И). Возможные ключи структуры:
//            * ОбластьДанных - Число - область данных,
//            * ИмяМетода - Строка - имя метода,
//            * Идентификатор - УникальныйИдентификатор - идентификатор задания,
//            * СостояниеЗадания - ПеречислениеСсылка.СостоянияЗаданий - состояние задания,
//            * Ключ - Строка - ключ задания,
//            * Шаблон - СправочникСсылка - шаблон задания,
//            * Использование - Булево - использование задания.
//        - Массив Из Структура - описание:
//            * ВидСравнения - ВидСравнения - допустимыми значениями являются:
//                ВидСравнения.Равно, ВидСравнения.НеРавно - для сравнения со значением,
//                ВидСравнения.ВСписке, ВидСравнения.НеВСписке - для сравнения с массивом.
//            * Значение - Произвольный - значения сравнения  для видов сравнения Равно / НеРавно
//            			 - Массив из Произвольный -  для видов сравнения ВСписке и НеВСписке
//
// Возвращаемое значение:
//  ТаблицаЗначений, Неопределено - таблица найденных заданий. Колонки соответствуют параметрам заданий:
//	 * Идентификатор - СправочникСсылка - ссылка на справочник.
//	 ...
Функция ПолучитьЗадания(Знач Отбор) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

// Добавляет новое задание в очередь.
// В случае вызова в транзакции на задание устанавливается объектная блокировка.
// 
// Параметры: 
//  ПараметрыЗадания - Структура - параметры добавляемого задания. Описание:
//   * ОбластьДанных - Число - номер области данных.
//   * Использование - Булево - признак использования.
//   * ЗапланированныйМоментЗапуска - Дата - момент запуска (ДатаВремя)
//   * ЭксклюзивноеВыполнение - Булево - признак эксклюзивного выполнения.
//   * ИмяМетода - Строка - имя метода для задания, обязательно для указания.
//   * Параметры - Массив из Произвольный - параметры метода.
//   * Ключ - Строка - ключ уникальности задания.
//   * ИнтервалПовтораПриАварийномЗавершении - Число - интервал повтора в секундах.
//   * Расписание - РасписаниеРегламентногоЗадания - расписания выполнения задания.
//   * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов.
//   * ИмяПользователя - Строка - имя пользователя.
//
// Возвращаемое значение: 
//  СправочникСсылка, Неопределено - идентификатор добавленного задания.
Функция ДобавитьЗадание(ПараметрыЗадания) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

// Изменяет задание с указанным идентификатором.
// В случае вызова в транзакции на задание устанавливается объектная блокировка.
// 
// Параметры: 
//	Идентификатор - СправочникСсылка - идентификатор задания.
//	ПараметрыЗадания - Структура - параметры, которые следует установить заданию, возможные ключи:
//						* Использование - Булево -
//						* ЗапланированныйМоментЗапуска - Дата -
//						* ЭксклюзивноеВыполнение - Булево - 
//						* ИмяМетода - Строка - не по шаблону 
//						* Параметры - Массив из Произвольный - (недоступно для задания на основе шаблона)
//  					* Ключ - Строка - (недоступно для задания на основе шаблона) 
//						* ИнтервалПовтораПриАварийномЗавершении - Число - 
//						* Расписание - РасписаниеРегламентногоЗадания - 
//						* КоличествоПовторовПриАварийномЗавершении - Число - 
Процедура ИзменитьЗадание(Идентификатор, ПараметрыЗадания) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();

КонецПроцедуры

// Удаляет задание из очереди заданий.
// Удаление заданий с установленным шаблоном запрещено.
// В случае вызова в транзакции на задание устанавливается объектная блокировка.
//
// Параметры:
//  Идентификатор - СправочникСсылка - идентификатор задания.
Процедура УдалитьЗадание(Идентификатор) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();

КонецПроцедуры

// Возвращает шаблон задания очереди по имени предопределенного регламентного задания из которого он создан.
//
// Параметры:
//  Имя - Строка - имя предопределенного регламентного задания.
//
// Возвращаемое значение:
//  СправочникСсылка, Неопределено - шаблон задания.
Функция ШаблонПоИмени(Знач Имя) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

// Возвращает текст ошибки при попытке выполнить одновременно два задания с одним ключом.
// 
// Возвращаемое значение:
//   Строка, Неопределено - текст исключения.
Функция ПолучитьТекстИсключенияДублированиеЗаданийСОдинаковымКлючом() Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

// Возвращает список шаблонов заданий очереди.
//
// Возвращаемое значение:
//  Массив Из Строка, Неопределено - имена предопределенных неразделенных регламентных заданий, которые используются 
//           в качестве шаблонов для заданий очереди.
Функция ШаблоныЗаданийОчереди() Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Новый Массив;

КонецФункции

// Возвращает менеджер справочника ОчередьЗаданий.
// 
// Возвращаемое значение:
//	СправочникМенеджер - менеджер справочника.
Функция СправочникОчередьЗаданий() Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

#КонецОбласти