#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру, ключами которой являются имена разделов данные которых представлены в
// 				в многофункциональных документах, по сути представляет собой перечисление. 
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * КадровыеДанные - Строка - соответствует разделу данных КадровыеДанные
// * ПлановыеНачисления - Строка - соответствует разделу данных ПлановыеНачисления
// * НачисленнаяЗарплата - Строка - соответствует  разделу данных НачисленнаяЗарплата
// * РабочееВремя - Строка - соответствует  разделу данных РабочееВремя
//
Функция РазделыДанных() Экспорт
	РазделыДанных = Новый Структура();
	РазделыДанных.Вставить("НачисленнаяЗарплата", "НачисленнаяЗарплата");
	РазделыДанных.Вставить("ПлановыеНачисления", "ПлановыеНачисления");
	РазделыДанных.Вставить("КадровыеДанные", "КадровыеДанные");
	РазделыДанных.Вставить("РабочееВремя", "РабочееВремя");
	
	Возврат РазделыДанных;
КонецФункции	

// Возвращает структуру, ключами которой являются виды прав на данные отдельных учетов
// 				в многофункциональных документах, по сути представляет собой перечисление. 
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * Просмотр - Строка - соответствует праву Просмотр
// * Редактирование - Строка - соответствует праву Редактирование
//
Функция ВидыПравНаРазделыДанных() Экспорт
	ВидыПрав = Новый Структура();
	ВидыПрав.Вставить("Просмотр", "Просмотр");
	ВидыПрав.Вставить("Редактирование", "Редактирование");
	
	Возврат ВидыПрав;
КонецФункции	

// Возвращает пустую структуру - описание раздела данных многофункционального документа
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * РеквизитОтветсвенный - Строка, Неопределено - имя реквизита в котором хранится ответственный утвердивший раздел,
// 		если значение Неопределено, значит в документе нет соответствующего поля
// * РеквизитСостояние - Строка, Неопределено - имя реквизита, в котором хранится состояние раздела (булево, 
// 		либо раздел утвержден, либо нет). Если значение Неопределено, значит в документе нет соответствующего поля
// * ТребуетсяУтверждениеПриПроведении - Булево - признак того что необходимо выполнять проверку 
// 		на то что раздел утвержден при проведении документа. 						
// * СообщениеДокументНеУтвержден - Строка - сообщение которое будет выдано при проверке документа при проведении,
//		если раздел не утвержден
//
Функция НовыйОписаниеРазделаДанных() Экспорт
	ОписаниеРаздела = Новый Структура();
	ОписаниеРаздела.Вставить("РеквизитСостояние", Неопределено);
	ОписаниеРаздела.Вставить("РеквизитОтветсвенный", Неопределено);
	ОписаниеРаздела.Вставить("ТребуетсяУтверждениеПриПроведении", Ложь);
	ОписаниеРаздела.Вставить("СообщениеДокументНеУтвержден", "");
	
	Возврат ОписаниеРаздела;	
КонецФункции	
 

#Область ОписаниеРазделовДокументов

Функция ОписаниеРазделовДанных_ПриемНаРаботу() Экспорт
	
	ВсеРазделы = РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.ПлановыеНачисления, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "НачисленияУтверждены";	
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден =  НСтр("ru = '%1 - ежемесячные начисления не установлены.'");
	
	Возврат ОписаниеРазделовДанных;
	
КонецФункции

Функция ОписаниеРазделовДанных_КадровыйПеревод() Экспорт
	ВсеРазделы = МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.ПлановыеНачисления, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "НачисленияУтверждены";	
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден =  НСтр("ru = '%1 - документ не утвержден.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции

Функция ОписаниеРазделовДанных_Увольнение() Экспорт
	ВсеРазделы = РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "ДокументРассчитан";	
	ОписаниеРаздела.РеквизитОтветсвенный = "Рассчитал";
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - документ не рассчитан.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции

Функция ОписаниеРазделовДанных_Отпуск() Экспорт
	ВсеРазделы = РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "ДокументРассчитан";	
	ОписаниеРаздела.РеквизитОтветсвенный = "Рассчитал";
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - документ не рассчитан.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции

Функция ОписаниеРазделовДанных_ОтпускБезСохраненияОплаты() Экспорт
	ВсеРазделы = РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "ПерерасчетВыполнен";	
	ОписаниеРаздела.РеквизитОтветсвенный = "Рассчитал";
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - документ не рассчитан.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции

Функция ОписаниеРазделовДанных_БольничныйЛист() Экспорт
	ВсеРазделы = РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "ДокументРассчитан";	
	ОписаниеРаздела.РеквизитОтветсвенный = "Рассчитал";
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - документ не рассчитан.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции	

Функция ОписаниеРазделовДанных_Премия() Экспорт
	ВсеРазделы = МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных();
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.КадровыеДанные, ОписаниеРаздела);	
	ОписаниеРаздела.РеквизитСостояние = "Проведен";
	ОписаниеРаздела.РеквизитОтветсвенный = "Ответственный";
	
	ОписаниеРаздела = МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных();
	ОписаниеРазделовДанных.Вставить(ВсеРазделы.НачисленнаяЗарплата, ОписаниеРаздела);
	ОписаниеРаздела.РеквизитСостояние = "ДокументРассчитан";	
	ОписаниеРаздела.РеквизитОтветсвенный = "Рассчитал";
	ОписаниеРаздела.ТребуетсяУтверждениеПриПроведении = Истина;
	ОписаниеРаздела.СообщениеДокументНеУтвержден = НСтр("ru = '%1 - документ не рассчитан.'");
	
	Возврат ОписаниеРазделовДанных;
КонецФункции	

#КонецОбласти

#КонецОбласти

