#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыПослеЗаписи;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
	Если Параметры.Ключ.Пустая() Тогда
		ПодборПерсоналаКлиентСервер.ЗаполнитьНаименованиеПрофиляДолжности(Объект);
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	// Отобразим элементы в зависимости от функциональной опции
	Элементы.ГруппаФункцииТребованияКХарактеристикам.Видимость = ИспользоватьЭлектронноеИнтервью
		Или ИспользоватьЭлектронноеТестирование Или ИспользоватьОценкуПерсонала Или ИспользоватьЭкспертнуюОценку;
	Если НЕ ИспользоватьЭлектронноеИнтервью Тогда
		Элементы.ГруппаДанныеДляПубликацииВакансии.Поведение = ПоведениеОбычнойГруппы.Обычное;
		Элементы.ГруппаДанныеДляПубликацииВакансии.Отображение = ОтображениеОбычнойГруппы.Нет;
		Элементы.ГруппаДанныеДляПубликацииВакансии.ОтображатьЗаголовок = Ложь;
		Элементы.ЭтапыРаботыСКандидатамиПечатьАнкеты.Видимость = Ложь;
	КонецЕсли;
	
	ХарактеристикиПерсоналаФормы.УстановитьСвойстваЭлементовОценкиХарактеристик(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	УстановитьЗаголовокСпособовОценки();
	
	ЗакрыватьПриВыборе = Ложь;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ИмяЭлементаКоманднойПанели", "ГруппаКомандыФормы");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКомандыФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "ГруппаКомандыФормы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	НастроитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Или Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ЗаписатьСКлиента();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РеквизитыВДанные(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитыВДанные(ТекущийОбъект);

	Если Не ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Объект");
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ХарактеристикиПерсоналаФормы.ОбработкаПроверкиЗаполненияТабличныхЧастейХарактеристик(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	ХарактеристикиПерсоналаФормы.ОбработкаПроверкиЗаполненияТабличныхЧастейЭтаповРабот(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ОбработкаНавигационнойСсылкиУстановкиЭтаповПоУмолчанию(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользоватьЭлектронноеТестирование Тогда
		ЗаписатьНастройкиТеста(ТекущийОбъект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	ПодборПерсоналаКлиентСервер.ЗаполнитьНаименованиеПрофиляДолжности(Объект, ЭтаФорма);
	ПрежняяДолжность = Объект.Должность;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодборПерсоналаКлиентСервер.ЗаполнитьНаименованиеПрофиляДолжности(Объект, ЭтаФорма);
	ПрежнееПодразделение = Объект.Подразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПланаОбученияПриИзменении(Элемент)
	ОбучениеРазвитиеКлиент.ПриИзмененииПродолжительностиПланаОбучения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РазмерностьПродолжительностиПланаОбученияПриИзменении(Элемент)
	ОбучениеРазвитиеКлиентСервер.УстановитьЗаголовкиКолонкамПрограммыОбучения(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИспытательныйСрокПриИзменении(Элемент)
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элемент);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаОтПриИзменении(Элемент)
	Элементы.ЗарплатаДо.МинимальноеЗначение = Объект.ЗарплатаОт;
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаДоПриИзменении(Элемент)
	Элементы.ЗарплатаОт.МаксимальноеЗначение = Объект.ЗарплатаДо;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДействияСотрудников

&НаКлиенте
Процедура ДействияСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ОткрытьПодборФункций();
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковПередУдалением(Элемент, Отказ)
	
	Если Элементы.ДействияСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеДействия = Новый Массив;
	Для Каждого ТекущаяСтрока Из Элементы.ДействияСотрудников.ВыделенныеСтроки Цикл
		СтрокаДействия = Объект.ДействияСотрудников.НайтиПоИдентификатору(ТекущаяСтрока);
		Если СтрокаДействия = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеДействия.Добавить(СтрокаДействия.ДействиеСотрудника);
	КонецЦикла;
	
	ПрочиеДействия = Новый Массив;
	Для Каждого ТекущаяСтрока Из Объект.ДействияСотрудников Цикл
		Если УдаляемыеДействия.Найти(ТекущаяСтрока.ДействиеСотрудника) = Неопределено Тогда
			ПрочиеДействия.Добавить(ТекущаяСтрока.ДействиеСотрудника);
		КонецЕсли;
	КонецЦикла;
	МассивХарактеристик = Новый Массив;
	Для Каждого ТекущаяСтрока Из Характеристики Цикл
		МассивХарактеристик.Добавить(ТекущаяСтрока.Характеристика);
	КонецЦикла;
	МассивЗначенийХарактеристик = Новый Массив;
	Для Каждого ТекущаяСтрока Из ЗначенияХарактеристики Цикл
		МассивЗначенийХарактеристик.Добавить(ТекущаяСтрока.Значение);
	КонецЦикла;
	
	ЭлектронноеИнтервьюКлиент.УдалитьДействияСотрудника(ЭтаФорма, УдаляемыеДействия, ПрочиеДействия, МассивХарактеристик, МассивЗначенийХарактеристик);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элементы.ДействияСотрудников.ТекущиеДанные.ДействиеСотрудника);
КонецПроцедуры

&НаКлиенте
Процедура ДействияСотрудниковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
		Объект.ДействияСотрудников, ВыбранноеЗначение, "ДействиеСотрудника");
	
	ДобавитьХарактеристикиИзДействийНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристики

&НаКлиенте
Процедура ХарактеристикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуДобавленияХарактеристик(ЭтаФорма, Копирование, Отказ, Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПередУдалением(Элемент, Отказ)
	
	Если Элементы.Характеристики.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	Модифицированность = Истина;
	
	ИзменяемыеХарактеристики = Новый Структура;
	УдаляемыеХарактеристики = Новый Массив;
	Для Каждого ТекущаяСтрока Из Элементы.Характеристики.ВыделенныеСтроки Цикл
		СтрокаХарактеристики = Характеристики.НайтиПоИдентификатору(ТекущаяСтрока);
		Если СтрокаХарактеристики = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеХарактеристики.Добавить(СтрокаХарактеристики.Характеристика);
	КонецЦикла;
	ИзменяемыеХарактеристики.Вставить("УдаляемыеХарактеристики", УдаляемыеХарактеристики);
	ИзменяемыеХарактеристики.Вставить("ДобавляемыеХарактеристики", Новый Массив);
	
	ЭлектронноеИнтервьюКлиент.ИзменитьСоставХарактеристик(Объект, Характеристики, ЗначенияХарактеристики, ИзменяемыеХарактеристики);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> "ХарактеристикиЗначение" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Характеристики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Характеристика) Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиПерсоналаКлиент.ОткрытьНастройкуЗначенийХарактеристик(ЭтаФорма, ТекущиеДанные.Характеристика);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Характеристики.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ХарактеристикаРедактируемойСтроки = Элементы.Характеристики.ТекущиеДанные.Характеристика;
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиХарактеристикаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Характеристики.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронноеИнтервьюКлиент.ОбработатьИзменениеХарактеристики(ЭтаФорма, ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыРаботыСКандидатами

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	НачатьПодборЭтапов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиПередУдалением(Элемент, Отказ)
	ПодборПерсоналаФормыКлиент.ЭтапыРаботыПередУдалением(ЭтотОбъект, 
		Элементы.ЭтапыРаботыСКандидатами, Объект.ЭтапыРаботыСКандидатами, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиОбработкаВыбора(Элемент, ВыбранныеЭтапы, СтандартнаяОбработка)
	
	Если ВыбранныеЭтапы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПодборПерсоналаФормыКлиент.ТаблицаЭтаповРаботыОбработкаВыбора(ЭтотОбъект, 
		Объект.ЭтапыРаботыСКандидатами, ВыбранныеЭтапы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиСпособОценкиХарактеристикПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособОценкиХарактеристик) Тогда
		ТекущиеДанные.ШаблонАнкеты = Неопределено;
	Иначе
		Если (ТипЗнч(ТекущиеДанные.ШаблонАнкеты) = Тип("СправочникСсылка.ШаблоныАнкет")
			И ТекущиеДанные.СпособОценкиХарактеристик <> ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью"))
			Или (ТипЗнч(ТекущиеДанные.ШаблонАнкеты) = Тип("СправочникСсылка.ЭлектронныеКурсы")
			И ТекущиеДанные.СпособОценкиХарактеристик <> ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест")) Тогда
			ТекущиеДанные.ШаблонАнкеты = Неопределено;
		КонецЕсли;
			
	КонецЕсли;
	
	УстановитьОграничениеТипаСпособаОценки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиШаблонАнкетыОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	ТекущиеДанные.ШаблонАнкеты = Неопределено;
	Если ИспользуетсяОдинИнструментОценки Тогда
		ТекущиеДанные.СпособОценкиХарактеристик = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиШаблонАнкетыОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуНастройкиВопросов(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиШаблонАнкетыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораИнструментаОценки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботыСКандидатамиШаблонАнкетыСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	ОткрытьФормуНастройкиВопросов(ТекущиеДанные, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммаОбучения

&НаКлиенте
Процедура ПрограммаОбученияПриИзменении(Элемент)
	ОбучениеРазвитиеКлиент.ПрограммаОбученияПриИзменении(ЭтаФорма, Элемент, Элементы.ПрограммаОбучения);
КонецПроцедуры

&НаКлиенте
Процедура ПрограммаОбученияМероприятиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммаОбучения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВторичныеДанныеОбученияНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	ЗакрыватьПослеЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНеЗакрывать(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборХарактеристикПерсонала(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДобавлятьЗначенияХарактеристик", Истина);
	
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуПодбораХарактеристик(
		ЭтаФорма,
		ПараметрыПодбора,
		Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЭтапов(Команда)
	НачатьПодборЭтапов();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапРаботыПереместитьВверх(Команда)
	ПодборПерсоналаФормыКлиент.ИзменитьПорядокЭтапа(Объект.ЭтапыРаботыСКандидатами, 
		Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные, -1);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапРаботыПереместитьВниз(Команда)
	ПодборПерсоналаФормыКлиент.ИзменитьПорядокЭтапа(Объект.ЭтапыРаботыСКандидатами, 
		Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные, 1);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЭтапыПоУмолчанию(Команда)
	УстановитьЭтапыПоУмолчаниюНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАнкеты(Команда)
	
	ТекущиеДанные = Элементы.ЭтапыРаботыСКандидатами.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) И ТипЗнч(ТекущиеДанные.ШаблонАнкеты) = Тип("СправочникСсылка.ШаблоныАнкет")Тогда
		ЭлектронноеИнтервьюКлиент.ПечатьАнкеты(ТекущиеДанные.ШаблонАнкеты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоФункциям(Команда)
	
	ЭлектронноеИнтервьюКлиент.ЗаполнитьПоФункциям(Объект, Характеристики, ЗначенияХарактеристики);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПрограммыОбученияПоХарактеристикам(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресХарактеристикПерсонала", АдресХарактеристикПерсонала());
	СтруктураПараметров.Вставить("АдресПрограммыОбучения", АдресПрограммыОбучения());
	
	ОбучениеРазвитиеКлиент.ОткрытьФормуПодбораПрограммыОбучения(
		ЭтаФорма,
		Новый Структура("ПараметрыФормыПодбора", СтруктураПараметров),
		Новый ОписаниеОповещения("ЗагрузитьПрограммуОбученияНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДействияДеревом(Команда)
	Если Элементы.ГруппаДействияСотрудников.ТекущаяСтраница = Элементы.СтраницаДействияСотрудниковСписком Тогда
		СписокДействий = Новый Массив;
		Для Каждого ТекущаяСтрока Из Объект.ДействияСотрудников Цикл
			СписокДействий.Добавить(ТекущаяСтрока.ДействиеСотрудника);
		КонецЦикла;
		ЗаполнитьДеревоДействийСотрудников(СписокДействий);
		Элементы.ГруппаДействияСотрудников.ТекущаяСтраница = Элементы.СтраницаДействияСотрудниковДеревом;
	Иначе
		Элементы.ГруппаДействияСотрудников.ТекущаяСтраница = Элементы.СтраницаДействияСотрудниковСписком;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаВсеХарактеристики(Команда)
	
	ВидВсеХарактеристики = Истина;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоФункциям(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Истина;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоКомпетенциям(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Истина;
	ВидПоГруппам = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоГруппам(Команда)
	
	ВидВсеХарактеристики = Ложь;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Истина;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборФункций(Команда)
	
	ОткрытьПодборФункций();
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)

	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	ИспользоватьЭлектронноеИнтервью = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью");
	ИспользоватьЭлектронноеТестирование = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов");
	ИспользоватьОценкуПерсонала = ПолучитьФункциональнуюОпцию("ИспользоватьОценкуПерсонала");
	ИспользоватьЭкспертнуюОценку = ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	ХарактеристикиПерсоналаФормы.ПрочитатьХарактеристикиВТаблицы(ТекущийОбъект.ХарактеристикиПерсонала, Характеристики, ЗначенияХарактеристики);
	
	УстановитьОтображениеЗакладкиЭтапы();
	
	СоздаватьВакансииТолькоПоЗаявке = ПолучитьФункциональнуюОпцию("ОткрытиеВакансииТребуетСогласования");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ЗаявкаНаПодборПерсоналаСоздатьНаОсновании", "Видимость", СоздаватьВакансииТолькоПоЗаявке);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ВакансииСоздатьНаОсновании", "Видимость", Не СоздаватьВакансииТолькоПоЗаявке);
	
	ОбучениеРазвитиеФормы.СоздатьИЗаполнитьРеквизитыПланаОбучения(ЭтаФорма);
	
	ПрежняяДолжность = ТекущийОбъект.Должность;
	ПрежнееПодразделение = ТекущийОбъект.Подразделение;
	
	УстановитьСклонениеИспытательногоСрока(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрок);
	УстановитьВидимостьПредупреждения(Объект.ИспытательныйСрок, Элементы.ИспытательныйСрокПредупреждение);

	ПодборПерсоналаФормы.ПроверитьЭтапыРаботыСКандидатамиПоУмолчанию(ЭтотОбъект, 
		Объект.ЭтапыРаботыСКандидатами, Элементы.ЭтапыПоУмолчаниюПредупреждениеГруппа);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	ХарактеристикиПерсонала.УстановитьУсловноеОформлениеСпособовОценки(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСпособовОценки()
	
	Если ИспользоватьЭлектронноеИнтервью Тогда
		ЗаголовокСпособОценкиАнкета = НСтр("ru = 'Анкета'");
	Иначе
		ЗаголовокСпособОценкиАнкета = "";
	КонецЕсли;
	Если ИспользоватьЭлектронноеТестирование Тогда
		ЗаголовокСпособОценкиТест = НСтр("ru = 'Тест'");
	Иначе
		ЗаголовокСпособОценкиТест = "";
	КонецЕсли;
	Если ИспользоватьЭлектронноеИнтервью И ИспользоватьЭлектронноеТестирование Тогда
		Разделитель = НСтр("ru = '/'");
	Иначе
		Разделитель = "";
	КонецЕсли;
	Элементы.ЭтапыРаботыСКандидатамиШаблонАнкеты.Заголовок = СтрШаблон("%1 %2 %3", ЗаголовокСпособОценкиАнкета, Разделитель, ЗаголовокСпособОценкиТест);
	
КонецПроцедуры

&НаСервере
Процедура РеквизитыВДанные(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ХарактеристикиПерсоналаФормы.ПеренестиХарактеристикиВТабличнуюЧасть(ТекущийОбъект.ХарактеристикиПерсонала, Характеристики, ЗначенияХарактеристики);
	
КонецПроцедуры

#Область ДлительнаяОперация

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСКлиента()
	
	ДлительнаяОперация = НачатьЗаписьДлительнойОперацией();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаписьДлительнойОперацией", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаписьДлительнойОперацией()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СправочникОбъект = Неопределено;
	
	// Преобразовываем данные формы в объект.
	Если Модифицированность Тогда
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
		РеквизитыВДанные(СправочникОбъект);
		ДанныеОбъекта = ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запись профиля должности'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
		"Справочники.ПрофилиДолжностей.ВыполнитьЗаписьОбъекта", ДанныеОбъекта);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаписьДлительнойОперацией(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ЗаписьПослеВыполненияДлительнойОперацииНаСервере(Результат.АдресРезультата);
	ЗаписатьНастройкиТеста(Объект.Ссылка);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПослеЗаписи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПослеЗаписи.Свойство("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(ПараметрыПослеЗаписи["ОписаниеОповещения"]);
	КонецЕсли;
	
	ПараметрыПослеЗаписи = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьПослеВыполненияДлительнойОперацииНаСервере(АдресРезультата)
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(АдресРезультата);
	СправочникОбъект = ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта);
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
	ПриПолученииДанныхНаСервере(СправочникОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура НастройкаВопросовЗавершение(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Если ИспользуетсяОдинИнструментОценки Тогда
			ТекущиеДанные.СпособОценкиХарактеристик = Неопределено;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ОповеститьОбИзменении(Результат.СпособОценки);
	ТекущиеДанные.ШаблонАнкеты = Результат.СпособОценки;
	Модифицированность = Истина;
	
	Если Не Результат.Свойство("АдресНастроек") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиВопросовИзХранилища = ПолучитьИзВременногоХранилища(Результат.АдресНастроек);
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СпособОценки", ТекущиеДанные.ШаблонАнкеты);
	СтруктураПоиска.Вставить("ЭтапРаботы", ТекущиеДанные.ЭтапРаботы);
	НайденныеСтроки = НастройкиВопросов.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НастройкиВопросов.Удалить(НайденнаяСтрока);
	КонецЦикла;
	Для Каждого Настройка Из НастройкиВопросовИзХранилища Цикл
		НоваяНастройка = НастройкиВопросов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяНастройка, Настройка);
		НоваяНастройка.СпособОценки = ТекущиеДанные.ШаблонАнкеты;
		НоваяНастройка.ЭтапРаботы = ТекущиеДанные.ЭтапРаботы;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИнструментаОценкиЗавершение(Результат, ТекущиеДанные) Экспорт
	
	Если Результат = Неопределено Тогда
		Если ИспользуетсяОдинИнструментОценки Тогда
			ТекущиеДанные.СпособОценкиХарактеристик = Неопределено;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Результат.ИнструментОценки = ТекущиеДанные.ШаблонАнкеты Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ШаблонАнкеты = Результат.ИнструментОценки;
	Модифицированность = Истина;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СпособОценки", ТекущиеДанные.ШаблонАнкеты);
	СтруктураПоиска.Вставить("ЭтапРаботы", ТекущиеДанные.ЭтапРаботы);
	НайденныеСтроки = НастройкиВопросов.НайтиСтроки(СтруктураПоиска);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НастройкиВопросов.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

#Область ДобавлениеХарактеристик

&НаСервере
Процедура ДобавитьХарактеристикиИзДействийНаСервере(МассивДобавленныхДействий) Экспорт
	
	ДобавляемыеХарактеристики = ХарактеристикиПерсонала.МассивСтруктурХарактеристикСоЗначениямиИзДействий(МассивДобавленныхДействий);
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиСоЗначениями(Характеристики, ЗначенияХарактеристики, ДобавляемыеХарактеристики);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикиПерсоналаНаКлиенте(НовыеХарактеристики, ДополнительныеПараметры = Неопределено) Экспорт
	ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры)
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиВТабличнуюЧасть(ЭтаФорма, НовыеХарактеристики, ДополнительныеПараметры);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьОграничениеТипаСпособаОценки(ТекущиеДанные)
	
	Если ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью") Тогда
		Элементы.ЭтапыРаботыСКандидатамиШаблонАнкеты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ШаблоныАнкет");
	ИначеЕсли ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест") Тогда 
		Элементы.ЭтапыРаботыСКандидатамиШаблонАнкеты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДействийСотрудников(СписокДействий)
	
	ДеревоДействий = ЭлектронноеИнтервью.ДеревоДействийСотрудников(СписокДействий);
	ЗначениеВДанныеФормы(ДеревоДействий, ДействияСотрудниковДерево);
	
КонецПроцедуры

#Область ПрограммаОбучения

&НаСервере
Процедура ПересоздатьКолонкиПериодовПрограммыОбучения() Экспорт

	ОбучениеРазвитиеФормы.УдалитьЭлементыКолонкиПериодовПлана(ЭтаФорма);
	ОбучениеРазвитиеФормы.СоздатьКолонкиПериодовПрограммыОбучения(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПрограммуОбученияНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры)
	ОбучениеРазвитиеФормы.ЗагрузитьПрограммуОбучения(ЭтаФорма, Результат);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеДанныеОбученияНаСервере(ИдентификаторТекущейСтроки)
	ОбучениеРазвитиеФормы.ЗаполнитьУчебныеЧасыПланаОбучения(ЭтаФорма, ИдентификаторТекущейСтроки);
	ОбучениеРазвитиеФормы.ЗаполнитьОтветственногоВСтрокеПрограммыОбучения(ЭтаФорма, ИдентификаторТекущейСтроки);
КонецПроцедуры

&НаСервере
Функция АдресХарактеристикПерсонала()
	Возврат ПоместитьВоВременноеХранилище(Характеристики.Выгрузить(, "Характеристика,КартинкаВида,ТребуетсяОбучение"), УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция АдресПрограммыОбучения()
	Возврат ПоместитьВоВременноеХранилище(Объект.ПрограммаОбучения.Выгрузить(, "Мероприятие,Ответственный"), УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура УстановитьОтображениеЗакладкиЭтапы()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"СтраницаЭтапыРаботыСКандидатами",
			"Видимость",
			ПравоДоступа("Чтение", Метаданные.Справочники.ЭтапыРаботыСКандидатами));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьФормуНастройкиВопросов(ТекущиеДанные, СозданиеНового = Ложь)
	
	УстановитьСпособОценкиДляОдногоИнструмента(ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("НастройкаВопросовЗавершение", ЭтаФорма, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	ПараметрыФормы.Вставить("СпособОценкиХарактеристик", ТекущиеДанные.СпособОценкиХарактеристик);
	ПараметрыФормы.Вставить("ШаблонАнкеты", ?(СозданиеНового, Неопределено, ТекущиеДанные.ШаблонАнкеты));
	ПараметрыФормы.Вставить("ЭтапРаботы", ТекущиеДанные.ЭтапРаботы);
	ПараметрыФормы.Вставить("АдресНастроек", АдресНастроекВопросов(ТекущиеДанные.ШаблонАнкеты, ТекущиеДанные.ЭтапРаботы));
	
	ОткрытьФорму("ОбщаяФорма.НастройкаВопросовДляСобеседования",
		ПараметрыФормы,
		ЭтаФорма,
		ТекущиеДанные.ПолучитьИдентификатор(),,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораИнструментаОценки(ТекущиеДанные)
	
	УстановитьСпособОценкиДляОдногоИнструмента(ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ВыборИнструментаОценкиЗавершение", ЭтаФорма, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Объект", Объект.Ссылка);
	ПараметрыФормы.Вставить("СпособОценкиХарактеристик", ТекущиеДанные.СпособОценкиХарактеристик);
	ПараметрыФормы.Вставить("ЭтапРаботы", ТекущиеДанные.ЭтапРаботы);
	ПараметрыФормы.Вставить("ИнструментОценки", ТекущиеДанные.ШаблонАнкеты);
	
	Если ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест") Тогда
		ИмяФормыВыбора = "ОбщаяФорма.ВыборЭлектронногоТеста";
	ИначеЕсли ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью") Тогда
		ИмяФормыВыбора = "ОбщаяФорма.ВыборАнкетыЭлектронногоИнтервью";
	КонецЕсли;
	
	ОткрытьФорму(ИмяФормыВыбора,
		ПараметрыФормы,
		ЭтаФорма,
		ТекущиеДанные.ПолучитьИдентификатор(),,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСпособОценкиДляОдногоИнструмента(ТекущиеДанные)
	
	Если ИспользуетсяОдинИнструментОценки Тогда
		Если ИспользоватьЭлектронноеИнтервью Тогда
			ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью");
		ИначеЕсли ИспользоватьЭлектронноеТестирование Тогда
			ТекущиеДанные.СпособОценкиХарактеристик = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресНастроекВопросов(ШаблонАнкеты, ЭтапРаботы)
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("СпособОценки", ШаблонАнкеты);
	СтруктураПоиска.Вставить("ЭтапРаботы", ЭтапРаботы);
	НайденныеСтроки = НастройкиВопросов.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	НастройкиОтветов = Новый ТаблицаЗначений();
	НастройкиОтветов.Колонки.Добавить("ВариантОтвета");
	НастройкиОтветов.Колонки.Добавить("ХарактеристикаПерсонала");
	НастройкиОтветов.Колонки.Добавить("ЗначениеХарактеристики");
	НастройкиОтветов.Колонки.Добавить("Балл");
	
	Для Каждого Настройка Из НайденныеСтроки Цикл
		СтрокаНастройки = НастройкиОтветов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, Настройка);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ОбщегоНазначения.ТаблицаЗначенийВМассив(НастройкиОтветов), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиТеста(ПрофильСсылка)
	
	Если НастройкиВопросов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭтапРаботыСКандидатом Из Объект.ЭтапыРаботыСКандидатами Цикл
		Если Не ЗначениеЗаполнено(ЭтапРаботыСКандидатом.ШаблонАнкеты) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("СпособОценки", ЭтапРаботыСКандидатом.ШаблонАнкеты);
		СтруктураПоиска.Вставить("ЭтапРаботы", ЭтапРаботыСКандидатом.ЭтапРаботы);
		НайденныеСтроки = НастройкиВопросов.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НаборЗаписей = РегистрыСведений.НастройкаВопросовДляЭлектронногоТестирования.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(ПрофильСсылка);
			НаборЗаписей.Отбор.ЭлектронныйКурс.Установить(ЭтапРаботыСКандидатом.ШаблонАнкеты);
			НаборЗаписей.Отбор.ЭтапРаботы.Установить(ЭтапРаботыСКандидатом.ЭтапРаботы);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			Для Каждого Настройка Из НайденныеСтроки Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Настройка);
				Запись.Объект = ПрофильСсылка;
				Запись.ЭлектронныйКурс = Настройка.СпособОценки;
				Запись.ЭтапРаботы = Настройка.ЭтапРаботы;
			КонецЦикла;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НастройкиВопросов.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборЭтапов()

	ПараметрыФормы = Новый Структура("РежимВыбора, МножественныйВыбор, АдресПодобранных");
	ПараметрыФормы.РежимВыбора = Истина;
	ПараметрыФормы.МножественныйВыбор = Истина;
	ПараметрыФормы.АдресПодобранных = АдресПодобранныхЭтаповРаботы();
	ОткрытьФорму("Справочник.ЭтапыРаботыСКандидатами.ФормаВыбора", ПараметрыФормы, Элементы.ЭтапыРаботыСКандидатами);

КонецПроцедуры

&НаСервере
Функция АдресПодобранныхЭтаповРаботы()
	Возврат ПоместитьВоВременноеХранилище(Объект.ЭтапыРаботыСКандидатами.Выгрузить().ВыгрузитьКолонку("ЭтапРаботы"));
КонецФункции

#Область УправлениеСвойствами

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклонениеИспытательногоСрока(ИспытательныйСрок, Элемент)
	Элемент.Подсказка = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';месяц;;месяца;месяцев;'"), ИспытательныйСрок);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупреждения(ИспытательныйСрок, Предупреждение)
	Предупреждение.Видимость = (ИспытательныйСрок > 3);
КонецПроцедуры

&НаСервере
Процедура НастроитьВидСпискаХарактеристик()
	
	ВидВсеХарактеристики = Истина;
	ВидПоФункциям = Ложь;
	ВидПоКомпетенциям = Ложь;
	ВидПоГруппам = Ложь;
	
	УстановитьВидСпискаХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидСпискаХарактеристик()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаВсеХарактеристики", "Пометка", ВидВсеХарактеристики);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоФункциям", "Пометка", ВидПоФункциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоКомпетенциям", "Пометка", ВидПоКомпетенциям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПоГруппам", "Пометка", ВидПоГруппам);
	Если ВидВсеХарактеристики Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаВсеХарактеристики);
	ИначеЕсли ВидПоКомпетенциям Тогда
		ДеревоХарактеристик = РеквизитФормыВЗначение("ХарактеристикиДеревоФункций");
		ДеревоХарактеристик.Строки.Очистить();
		МассивХарактеристик = Характеристики.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика");
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка КАК Функция,
			|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика КАК Характеристика
			|ИЗ
			|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсоналаХарактеристикиПерсонала
			|ГДЕ
			|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика В(&Характеристики)
			|
			|СГРУППИРОВАТЬ ПО
			|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка,
			|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика
			|ИТОГИ ПО
			|	Функция";
		Запрос.УстановитьПараметр("Характеристики", МассивХарактеристик);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Функция = Null Тогда
				СтрокаКомпетенций = ДеревоХарактеристик;
			Иначе
				СтрокаКомпетенций = ДеревоХарактеристик.Строки.Добавить();
				СтрокаКомпетенций.Характеристика = Выборка.Функция;
			КонецЕсли;
			
			ВыборкаХарактеристик = Выборка.Выбрать();
			Пока ВыборкаХарактеристик.Следующий() Цикл
				СтрокаХарактеристик = СтрокаКомпетенций.Строки.Добавить();
				СтрокаХарактеристик.Характеристика = ВыборкаХарактеристик.Характеристика;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоХарактеристик, "ХарактеристикиДеревоФункций");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаКомпетенции);
	ИначеЕсли ВидПоГруппам Тогда
		ДеревоХарактеристик = РеквизитФормыВЗначение("ХарактеристикиДеревоФункций");
		ДеревоХарактеристик.Строки.Очистить();
		МассивХарактеристик = Характеристики.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика");
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Ссылка КАК Группа,
			|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Характеристика КАК Характеристика
			|ИЗ
			|	Справочник.ГруппыХарактеристикПерсонала.ХарактеристикиПерсонала КАК ГруппыХарактеристикПерсоналаХарактеристикиПерсонала
			|ГДЕ
			|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Характеристика В(&Характеристики)
			|
			|СГРУППИРОВАТЬ ПО
			|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Характеристика,
			|	ГруппыХарактеристикПерсоналаХарактеристикиПерсонала.Ссылка
			|ИТОГИ ПО
			|	Группа";
		Запрос.УстановитьПараметр("Характеристики", МассивХарактеристик);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Группа = Null Тогда
				СтрокаКомпетенций = ДеревоХарактеристик;
			Иначе
				СтрокаКомпетенций = ДеревоХарактеристик.Строки.Добавить();
				СтрокаКомпетенций.Характеристика = Выборка.Группа;
			КонецЕсли;
			ВыборкаХарактеристик = Выборка.Выбрать();
			Пока ВыборкаХарактеристик.Следующий() Цикл
				СтрокаХарактеристик = СтрокаКомпетенций.Строки.Добавить();
				СтрокаХарактеристик.Характеристика = ВыборкаХарактеристик.Характеристика;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоХарактеристик, "ХарактеристикиДеревоФункций");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаГруппы);
	ИначеЕсли ВидПоФункциям Тогда
		ДеревоХарактеристик = РеквизитФормыВЗначение("ХарактеристикиДеревоФункций");
		ДеревоХарактеристик.Строки.Очистить();
		МассивХарактеристик = Характеристики.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика");
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДействияСотрудниковХарактеристикиПерсонала.Ссылка КАК Функция,
			|	ДействияСотрудниковХарактеристикиПерсонала.Характеристика КАК Характеристика
			|ИЗ
			|	Справочник.ДействияСотрудников.ХарактеристикиПерсонала КАК ДействияСотрудниковХарактеристикиПерсонала
			|ГДЕ
			|	ДействияСотрудниковХарактеристикиПерсонала.Характеристика В(&Характеристики)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДействияСотрудниковХарактеристикиПерсонала.Ссылка,
			|	ДействияСотрудниковХарактеристикиПерсонала.Характеристика
			|ИТОГИ ПО
			|	Функция";
		Запрос.УстановитьПараметр("Характеристики", МассивХарактеристик);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		Пока Выборка.Следующий() Цикл
			Если Выборка.Функция = Null Тогда
				СтрокаКомпетенций = ДеревоХарактеристик;
			Иначе
				СтрокаКомпетенций = ДеревоХарактеристик.Строки.Добавить();
				СтрокаКомпетенций.Характеристика = Выборка.Функция;
			КонецЕсли;
			
			ВыборкаХарактеристик = Выборка.Выбрать();
			Пока ВыборкаХарактеристик.Следующий() Цикл
				СтрокаХарактеристик = СтрокаКомпетенций.Строки.Добавить();
				СтрокаХарактеристик.Характеристика = ВыборкаХарактеристик.Характеристика;
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ДеревоХарактеристик, "ХарактеристикиДеревоФункций");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницыВидСписка", "ТекущаяСтраница", Элементы.СтраницаФункции);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборФункций()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ХарактеристикаПерсонала", Объект.Ссылка);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("АдресПодобранных", АдресПодобранныхФункций());
	
	ОткрытьФорму("Справочник.ДействияСотрудников.Форма.ФормаСписка", ПараметрыФормы, Элементы.ДействияСотрудников);
	
КонецПроцедуры

&НаСервере
Функция АдресПодобранныхФункций()
	Возврат ПоместитьВоВременноеХранилище(Объект.ДействияСотрудников.Выгрузить().ВыгрузитьКолонку("ДействиеСотрудника"));
КонецФункции

&НаКлиенте
Процедура УстановитьЭтапыПоУмолчаниюНаКлиенте()
	Результат = УстановитьЭтапыПоУмолчаниюНаСервере();
	ПодборПерсоналаФормыКлиент.ПослеУстановкиЭтаповПоУмолчанию(ЭтотОбъект, Результат);
КонецПроцедуры

&НаСервере
Функция УстановитьЭтапыПоУмолчаниюНаСервере()
	Результат = ПодборПерсоналаФормы.УстановитьЭтапыПоУмолчанию(Объект.ЭтапыРаботыСКандидатами);
	ПодборПерсоналаФормы.ПроверитьЭтапыРаботыСКандидатамиПоУмолчанию(ЭтотОбъект, 
		Объект.ЭтапыРаботыСКандидатами, Элементы.ЭтапыПоУмолчаниюПредупреждениеГруппа);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиУстановкиЭтаповПоУмолчанию(НавигационнаяСсылка, СтандартнаяОбработка)
	Если НавигационнаяСсылка = "УстановитьЭтапыПоУмолчанию" Тогда
		УстановитьЭтапыПоУмолчаниюНаКлиенте();
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти