#Область СлужебныеПроцедурыИФункции

Функция ДлительнаяОперацияЗаполненияЗанятости(ДанныеПозиции, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнение информационной строки занятости'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Справочники.ПозицииКадровогоПлана.ИнформационнаяСтрокаЗанятости", ДанныеПозиции);

КонецФункции

#КонецОбласти