
#Область ПрограммныйИнтерфейс

// Возвращает подразделение в структуре предприятия соответствующее организации или подразделению организации.
//
// Параметры:
//	СтруктурнаяЕдиница - СправочникСсылка.Организации, СправочникСсылка.ПодразделенияОрганизаций - элемент структуры юридических лиц.
//
// Возвращаемое значение:
//	СправочникСсылка.СтруктураПредприятия - ссылка на найденное подразделение.
//
Функция ПодразделениеВСтруктуреПредприятия(СтруктурнаяЕдиница) Экспорт
	
	Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Источник", СтруктурнаяЕдиница);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Источник = &Источник";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Подразделение = Выборка.Подразделение;		
	КонецЕсли;
	
	Возврат Подразделение;
	
КонецФункции

// Возвращает запрос с полями Период, ПериодЗаписи, ПозицияШтатногоРасписания, СтруктурноеПодразделение, Основание.
//
// Параметры:
//  ТолькоРазрешенные                    - Булево
//  ИмяВТПериодПозицияШтатногоРасписания - Строка
//  ИмяПоляПериод                        - Строка
//  ИмяПоляПозицияШтатногоРасписания     - Строка
//  ПоляОтбораПериодическихДанных        - Структура
//
// Возвращаемое значение:
//  Запрос
//
Функция ЗапросВТМестаПозицийВСтруктуреПредприятия(ТолькоРазрешенные,
	ИмяВТПериодПозицияШтатногоРасписания = "ВТПериодПозицияШтатногоРасписания", ИмяПоляПериод = "Период",
	ИмяПоляПозицияШтатногоРасписания = "ПозицияШтатногоРасписания") Экспорт

	СоответствиеПсевдонимовПолей = Новый Соответствие;

	СоответствиеПсевдонимовПолей.Вставить("Позиция", "ПозицияШтатногоРасписания");
	СоответствиеПсевдонимовПолей.Вставить("Подразделение", "СтруктурноеПодразделение");

	ПараметрыПостроения = ПараметрыПостроенияВТМестоПозицииВСтруктуреПредприятия(ИмяВТПериодПозицияШтатногоРасписания,
		СтрШаблон("%1,%2", ИмяПоляПозицияШтатногоРасписания, ИмяПоляПериод));
	ПараметрыПостроения.ТолькоРазрешенные = ТолькоРазрешенные;
	ПараметрыПостроения.ИмяВТМестоПозицииВСтруктуреПредприятия = "ВТМестаПозицийВСтруктуреПредприятия";
	ПараметрыПостроения.СоответствиеПсевдонимовПолей = СоответствиеПсевдонимовПолей;

	Возврат ЗапросВТМестоПозицииВСтруктуреПредприятия(ПараметрыПостроения);

КонецФункции

// Возвращает организацию по структуре предприятия.
// 
// Параметры:
//  СтруктураПредприятия - СправочникСсылка.СтруктураПредприятия
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.ПодразделенияОрганизаций, СправочникСсылка.Организации - Организация структуры предприятия
Функция ОрганизацияСтруктурыПредприятия(СтруктураПредприятия) Экспорт
	
	ВышестоящиеПодразделения = ОрганизационнаяСтруктура.ВышестоящиеПодразделения(СтруктураПредприятия);
	КоличествоВышестоящихПодразделений = ВышестоящиеПодразделения.Количество();
	Если КоличествоВышестоящихПодразделений = 0 Тогда
		ВышестоящееПодразделение = СтруктураПредприятия;
	Иначе
		ВышестоящееПодразделение =
			ВышестоящиеПодразделения[КоличествоВышестоящихПодразделений - 1].ВышестоящееПодразделение;
	КонецЕсли;
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВышестоящееПодразделение, "Источник");
	Если Не ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Организация;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("УстановитьИспользованиеСтруктурыПредприятия", Истина);
	Методы.Вставить("ДобавитьРольИзменениеМестаСотрудникаВСтруктуреПредприятияВПользовательскиеПрофили");
	Методы.Вставить("ОбновитьСтруктуруПредприятия");
	Методы.Вставить("ЗаполнитьКодИсточникаВСтруктуреПредприятия");
	Методы.Вставить("ЗаполнитьМестаВСтруктуреПредприятияДокументовШтатногоРасписания");
	Методы.Вставить("ЗаполнитьМестаПозицииШтатногоРасписанияВСтруктуреПредприятия");
	Методы.Вставить("УстановитьРежимСоответствияСтруктурыПредприятияСтруктуреЮридическихЛиц");
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураПредприятия() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктураПредприятия.Ссылка КАК Подразделение,
	|	СтруктураПредприятия.Родитель КАК ПодразделениеРодитель
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	НЕ СтруктураПредприятия.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураПредприятия.Ссылка ИЕРАРХИЯ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Считывает подразделение структуры предприятия, соответствующее позиции штатного расписания.
//
// Параметры:
//   Позиция             - СправочникСсылка.ШтатноеРасписание - Позиция штатного расписания
//   ДатаПолученияДанных - Дата - Дата на которую необходимо получить данные 
// Возвращаемое значение:
//   СправочникСсылка.СтруктураПредприятия, Неопределено - Подразделение, соответствующее позиции штатного расписания, или Неопределено, если не найдено
//
Функция МестоПозицииВСтруктуреПредприятия(Позиция, ДатаПолученияДанных = '00010101') Экспорт

	Если Не ЗначениеЗаполнено(Позиция) Тогда
		Возврат Неопределено;
	КонецЕсли;

	СписокПозиций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Позиция);
	МестаПозиций = МестаПозицийВСтруктуреПредприятия(СписокПозиций, ДатаПолученияДанных);

	Если МестаПозиций.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат МестаПозиций[0].Подразделение;

КонецФункции

Функция МестаПозицийВСтруктуреПредприятия(Позиции, ДатаПолученияДанных = '00010101') Экспорт

	Если ТипЗнч(Позиции) <> Тип("Массив") Тогда
		МассивПозиций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Позиции);
	Иначе
		МассивПозиций = Позиции;
	КонецЕсли;

	Если ДатаПолученияДанных = '00010101' Тогда
		ДатаПолученияДанных = ТекущаяДатаСеанса();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ШтатноеРасписание.Ссылка КАК Позиция
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|ГДЕ
	|	ШтатноеРасписание.Ссылка В (&МассивПозиций)";

	Запрос.УстановитьПараметр("Период", ДатаПолученияДанных);
	Запрос.УстановитьПараметр("МассивПозиций", МассивПозиций);

	Запрос.Выполнить();

	СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестаПозицийВСтруктуреПредприятия.Позиция КАК Позиция,
	|	МестаПозицийВСтруктуреПредприятия.Подразделение КАК Подразделение
	|ИЗ
	|	ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ОбновитьСведенияПодразделенийПоСпискуПозиций(СписокПозицийШтатногоРасписания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|ГДЕ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция В (&СписокПозиций)";

	Запрос.УстановитьПараметр("СписокПозиций", СписокПозицийШтатногоРасписания);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ОбновляемыеПодразделения = Новый Массив;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбновляемыеПодразделения.Добавить(Выборка.Подразделение);
	КонецЦикла;

	ОбновитьСведенияПодразделений(ОбновляемыеПодразделения);

КонецПроцедуры

Функция МестоСотрудниковВСтруктуреПредприятия(ТолькоРазрешенные, СписокСотрудников, ДатаПолученияДанных) Экспорт
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(ТолькоРазрешенные, СписокСотрудников, "МестоВСтруктуреПредприятия", ДатаПолученияДанных);
	
	МестоСотрудниковВСтруктуреПредприятия = Новый Соответствие;
	Для Каждого КадровыеДанныеСотрудника Из КадровыеДанные Цикл 
		МестоСотрудниковВСтруктуреПредприятия.Вставить(КадровыеДанныеСотрудника.Сотрудник, КадровыеДанныеСотрудника.МестоВСтруктуреПредприятия);
	КонецЦикла;
	
	Возврат МестоСотрудниковВСтруктуреПредприятия;
	
КонецФункции

Процедура ЗаполнитьДанныеИсточникаВыбранногоПодразделения(ДанныеИсточника, ВыбранноеПодразделение) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранноеПодразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбранноеПодразделение", ВыбранноеПодразделение);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтруктураПредприятия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Источник = &ВыбранноеПодразделение";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ДанныеИсточника = Выборка.Ссылка;
	
КонецПроцедуры

Процедура СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(МенеджерВременныхТаблиц,
	ИмяТаблицыПозиций = "ВТПозиции", ИмяКолонкиПозиции = "Позиция", ИмяКолонкиПериод = "Период") Экспорт

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ИмяТаблицыПозиций, "Позиция");

	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Позиция", ИмяКолонкиПозиции);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", ИмяКолонкиПериод);

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", МенеджерВременныхТаблиц, Истина, ОписаниеФильтра,
		ПараметрыПостроения, "ВТМестаПозицийВСтруктуреПредприятия");

КонецПроцедуры

Процедура СоздатьВТПозицииПодразделений(МенеджерВременныхТаблиц, ИмяФильтра) Экспорт

	Запрос = ЗапросВТПозицииПодразделений(ИмяФильтра);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();

КонецПроцедуры

Функция ПозицииПодразделений(Подразделения, ДатаПолученияДанных = '00010101') Экспорт

	Если ТипЗнч(Подразделения) <> Тип("Массив") Тогда
		МассивПодразделений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделения);
	Иначе
		МассивПодразделений = Подразделения;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ВТПодразделения
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В (&МассивПодразделений)";

	Запрос.УстановитьПараметр("МассивПодразделений", МассивПодразделений);
	Запрос.УстановитьПараметр("Период", ДатаПолученияДанных);

	Запрос.Выполнить();

	СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТПодразделения");

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТПозицииПодразделений.Подразделение КАК Подразделение,
	|	ВТПозицииПодразделений.Позиция КАК Позиция
	|ИЗ
	|	ВТПозицииПодразделений КАК ВТПозицииПодразделений";

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПодчиненныеПодразделения(МассивПодразделенийУзла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивПодразделенийУзла);
	
	МассивДопустимыхЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение");
	
	Возврат МассивДопустимыхЗначений;
	
КонецФункции

// Вышестоящие подразделения.
// 
// Параметры:
//  Поздразделения - Массив из СправочникСсылка.СтруктураПредприятия
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Вышестоящие подразделения:
//    * Подразделение - СправочникСсылка.СтруктураПредприятия - запрашиваемое подразделение
//    * ВышестоящееПодразделение - СправочникСсылка.СтруктураПредприятия - вышестоящее подразделение
//    * Уровень - Число - дистанция по иерархии, где 1 - это непосредственный родитель, 2 - родитель родителя и т.д.
Функция ВышестоящиеПодразделения(Поздразделения) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Подразделения", Поздразделения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Подчиненность.СтруктурнаяЕдиница КАК Подразделение,
		|	Подчиненность.ВышестоящаяСтруктурнаяЕдиница КАК ВышестоящееПодразделение,
		|	Подчиненность.Уровень КАК Уровень
		|ИЗ
		|	РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК Подчиненность
		|ГДЕ
		|	Подчиненность.СтруктурнаяЕдиница В(&Подразделения)
		|	И Подчиненность.Уровень > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Подчиненность.СтруктурнаяЕдиница,
		|	Подчиненность.Уровень";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу значений - соответствие подразделений в структуре предприятия для переданным подразделениям организации.
//
// Параметры:
//	ПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций, Массив (СправочникСсылка.ПодразделенияОрганизаций) - подразделение или массив подразделений.
//
// Возвращаемое значение:
//	ТаблицаЗначений, с колонками
//		* Источник - СправочникСсылка.ПодразделенияОрганизаций - регламентированное подразделение.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия - соответствующее ему управленческое подразделение.
//
Функция ПодразделенияВСтруктуреПредприятия(ПодразделенияОрганизации) Экспорт

	СоответствиеПодразделений = Новый Соответствие;
	
	Если ТипЗнч(ПодразделенияОрганизации) = Тип("Массив") Тогда
		МассивПараметр = ПодразделенияОрганизации;
	Иначе
		МассивПараметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПодразделенияОрганизации);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Источник КАК Источник,
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Источник В(&МассивИсточников)";
	Запрос.УстановитьПараметр("МассивИсточников", МассивПараметр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ЗапросВТДатыОкончанияМестаПозицииВСтруктуреПредприятия() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция КАК Позиция,
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение КАК Подразделение,
	|	МИНИМУМ(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период) КАК ДатаНачала,
	|	МАКСИМУМ(МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период) КАК ДатаПоследнейУстановки
	|ПОМЕСТИТЬ ВТДатыПоследнейУстановки
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|СГРУППИРОВАТЬ ПО
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция,
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПоследнейУстановки.Позиция КАК Позиция,
	|	ДатыПоследнейУстановки.Подразделение КАК Подразделение,
	|	ДатыПоследнейУстановки.ДатаНачала КАК ДатаНачала,
	|	МИНИМУМ(ВЫБОР
	|		КОГДА МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция ЕСТЬ NULL
	|			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	|		ИНАЧЕ МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период
	|	КОНЕЦ) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТДатыОкончанияМестаПозицииВСтруктуреПредприятия
	|ИЗ
	|	ВТДатыПоследнейУстановки КАК ДатыПоследнейУстановки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|			МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО ДатыПоследнейУстановки.Позиция = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
	|		И ДатыПоследнейУстановки.Подразделение <> МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
	|		И ДатыПоследнейУстановки.ДатаПоследнейУстановки < МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период
	|СГРУППИРОВАТЬ ПО
	|	ДатыПоследнейУстановки.Позиция,
	|	ДатыПоследнейУстановки.Подразделение,
	|	ДатыПоследнейУстановки.ДатаНачала";
	
	Возврат Запрос;

КонецФункции

#Область СостояниеСтруктурыПредприятия

// Проверяет наличие подсистемы состояния структуры предприятия
//
// Возвращаемое значение:
//   Булево - Истина, если подсистема существует
Функция ПодсистемаСостоянияСтруктурыПредприятияСуществует() Экспорт
	Возврат ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СостояниеСтруктурыПредприятия");
КонецФункции

// Проверяет, является ли переданный объект элементом справочника СтруктураПредприятия.
//
// Параметры:
//   Источник - Произвольный - проверяемый объект
//
// Возвращаемое значение:
//   Булево - Истина, если объект является СправочникОбъект.СтруктураПредприятия
Функция ЭтоОбъектСтруктурыПредприятия(Источник) Экспорт
	Возврат ТипЗнч(Источник) = Тип("СправочникОбъект.СтруктураПредприятия");
КонецФункции

// Возвращает запрос для получения данных представления организационной структуры предприятия.
//
// Параметры:
//   ИмяПредставления - Строка - 
//   ТолькоРазрешенные - Булево - 
//   ПараметрыЗапросаКомпоновки - Структура - 
//   ИмяВТПредставления - Строка - 
//   ИменаВТИсточниковПараметров - Массив из Строка, Неопределено - 
//
// Возвращаемое значение:
//   Запрос - Запрос -
Функция ЗапросПоПредставлению(ИмяПредставления, ТолькоРазрешенные, ПараметрыЗапросаКомпоновки,
	ИмяВТПредставления = "Представления_СтруктураПредприятия", ИменаВТИсточниковПараметров = Неопределено) Экспорт

	Запрос = Неопределено;
	Если ВРег(ИмяПредставления) <> ВРег("СтруктураПредприятия") Тогда
		Возврат Запрос;
	КонецЕсли;

	Если ИменаВТИсточниковПараметров = Неопределено Или ИменаВТИсточниковПараметров.Количество() = 0 Тогда
		ИмяВТМестоПозиции = "ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия";
	Иначе
		ИмяВТМестоПозиции = ИменаВТИсточниковПараметров[0];
	КонецЕсли;

	Запрос = ЗапросПредставленияСтруктураПредприятия(ТолькоРазрешенные, ИмяВТПредставления, ИмяВТМестоПозиции);

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.УточнитьЗапросПоПредставлениюСтруктураПредприятия(Запрос, ИмяВТПредставления);
	КонецЕсли;

	УстановитьПараметрЗапросаПоПредставлению(Запрос, ПараметрыЗапросаКомпоновки, "ДатаАктуальности", ТекущаяДатаСеанса());
	УстановитьПараметрЗапросаПоПредставлению(Запрос, ПараметрыЗапросаКомпоновки, "ЮридическаяСтруктура", Ложь);
	УстановитьПараметрЗапросаПоПредставлению(Запрос, ПараметрыЗапросаКомпоновки, "ПоказыватьНовыеПодразделения", Ложь);
	УстановитьПараметрЗапросаПоПредставлению(Запрос, ПараметрыЗапросаКомпоновки, "ПоказыватьРасформированныеПодразделения", Ложь);

	Возврат Запрос;

КонецФункции

// Возвращает параметры для уточнения запроса по состоянию структуры предприятия.
//
// Возвращаемое значение:
//   Структура:
//     * ИмяВТ - Строка - имя временной таблицы
//     * ИмяПараметраПоказыватьРасформированные - Строка - имя параметра показа расформированных
//     * ИмяПараметраДаты - Строка - имя параметра даты
//     * ИмяПараметраРазрешенныхПодразделений - Строка - имя параметра разрешенных подразделений
//     * ДобавлятьОтбор - Булево - признак добавления отбора
Функция ПараметрыУточненияЗапросаПоСостояниюСтруктурыПредприятия() Экспорт
	
	ПараметрыУточнения = Новый Структура;
	ПараметрыУточнения.Вставить("ИмяВТ", "");
	ПараметрыУточнения.Вставить("ИмяПараметраПоказыватьРасформированные", "");
	ПараметрыУточнения.Вставить("ИмяПараметраДаты", "");
	ПараметрыУточнения.Вставить("ИмяПараметраРазрешенныхПодразделений", "");
	ПараметрыУточнения.Вставить("ДобавлятьОтбор", Истина);
	
	Возврат ПараметрыУточнения;
	
КонецФункции

// Уточняет запрос по состоянию структуры предприятия, если доступна подсистема состояния структуры предприятия.
//
// Параметры:
//   Запрос - Запрос - уточняемый запрос.
//   ПараметрыУточнения - Структура - параметры уточнения запроса.
Процедура УточнитьЗапросПоСостояниюСтруктурыПредприятия(Запрос, ПараметрыУточнения) Экспорт

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.УточнитьЗапросПоСостояниюСтруктурыПредприятия(Запрос, ПараметрыУточнения);
	КонецЕсли;

КонецПроцедуры

// Уточняет запрос измененных элементов источника реквизитами состояния,
// если доступна подсистема состояния структуры.
//
// Параметры:
//   Запрос - Запрос - уточняемый запрос.
//   РеквизитыИсточника - КоллекцияОбъектовМетаданных - реквизиты справочника-источника.
Процедура УточнитьЗапросИзмененныхЭлементовИсточника(Запрос, РеквизитыИсточника) Экспорт

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.УточнитьЗапросИзмененныхЭлементовИсточника(Запрос, РеквизитыИсточника);
	КонецЕсли;

КонецПроцедуры

// Дополняет список исключаемых реквизитов именами, относящимися к подсистеме состояния структуры предприятия, если она доступна.
//
// Параметры:
//   СписокИсключаемых - Массив из Строка - дополняемый список имен реквизитов.
//   РеквизитыИсточника - КоллекцияОбъектовМетаданных - реквизиты справочника-источника.
Процедура ДополнитьСписокИсключаемыхРеквизитов(СписокИсключаемых, РеквизитыИсточника) Экспорт

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.ДополнитьСписокИсключаемыхРеквизитов(СписокИсключаемых, РеквизитыИсточника);
	КонецЕсли;

КонецПроцедуры

// Заполняет даты создания в структуре предприятия
Процедура ЗаполнитьДатыСозданияВСтруктуреПредприятия() Экспорт
	
	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.ЗаполнитьДатыСозданияВСтруктуреПредприятия();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеОтборамиВФормахСДинамическимСписком

Процедура УстановитьПараметрыВыбораУправленческойОрганизацииПоЭлементу(Форма, ЭлементФормы) Экспорт
	
	ПараметрВыбора = Новый ПараметрВыбора("ПоказыватьУправленческуюОрганизацию", Истина);
	
	ПараметрыВыбора = Новый Массив(ЭлементФормы.ПараметрыВыбора);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

Процедура УстановитьПараметрыВыбораУправленческойОрганизации(Форма, СоздатьЭлементы = Истина, ИмяПоляОрганизация = "") Экспорт
	
	Если СоздатьЭлементы Тогда
		Форма.Элементы[Форма.НаименованиеРеквизитаФормыДинамическийСписок].СоздатьЭлементыФормыПользовательскихНастроек();
	КонецЕсли;
	
	Если ИмяПоляОрганизация = "" Тогда
		ИмяПоляОрганизация = Форма.ИмяПоляОрганизация;
	КонецЕсли;
	
	ЭлементФормы = ЭлементФормыПользовательскийОтборПоОрганизации(Форма.Элементы.СписокКомпоновщикНастроекПользовательскиеНастройки, ИмяПоляОрганизация);
	Если ЭлементФормы <> Неопределено Тогда
		УстановитьПараметрыВыбораУправленческойОрганизацииПоЭлементу(Форма, ЭлементФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтатноеРасписание

Процедура ПриСозданииФормыПозицииШтатногоРасписания(Форма) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьУправленческуюОрганизациюВШтатномРасписании() Тогда
		УстановитьПараметрыВыбораУправленческойОрганизацииПоЭлементу(Форма, Форма.Элементы["Владелец"]);
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	// Создаем реквизиты места в структуре предприятия.
	ОписаниеТипов = Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	РеквизитФормы = Новый РеквизитФормы("МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ОписаниеТипов, , ,
		Истина);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

	ОписаниеТипов = Новый ОписаниеТипов("Булево");
	РеквизитФормы = Новый РеквизитФормы("РедактированиеМестаВСтруктуреПредприятияЗапрещено",
		ОписаниеТипов, , , Истина);
	ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

	Если Не Форма.Внешниеданные Тогда

		ОписаниеТипов = Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
		РеквизитФормы = Новый РеквизитФормы("МестоПозицииШтатногоРасписанияВСтруктуреПредприятияНаборЗаписей",
			ОписаниеТипов, , , Истина);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

		ОписаниеТипов = Новый ОписаниеТипов("Булево");

		РеквизитФормы = Новый РеквизитФормы("МестоПозицииШтатногоРасписанияВСтруктуреПредприятияНаборЗаписейПрочитан",
			ОписаниеТипов, , , Истина);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

		РеквизитФормы = Новый РеквизитФормы("МестоПозицииШтатногоРасписанияВСтруктуреПредприятияНоваяЗапись",
			ОписаниеТипов, , , Истина);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

		ОписаниеТипов = Новый ОписаниеТипов("");
		РеквизитФормы = Новый РеквизитФормы("МестоПозицииШтатногоРасписанияВСтруктуреПредприятияПрежняя",
			ОписаниеТипов, , , Истина);
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);

	КонецЕсли;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	// Добавляем поля ввода.
	Элементы = Форма.Элементы;
	
	Если Элементы.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда
		Поле = Элементы.Добавить("МестоВСтруктуреПредприятия", Тип("ПолеФормы"),
			Элементы.МестоВСтруктуреПредприятияГруппа);
		Поле.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
		Поле.Вид = ВидПоляФормы.ПолеВвода;
		Поле.ПутьКДанным = "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение";
		Поле.УстановитьДействие("ПриИзменении", "Подключаемый_МестоВСтруктуреПредприятияПриИзменении");
	КонецЕсли;
	
	Если Форма.ВнешниеДанные Тогда
		Возврат;
	КонецЕсли;

	Если Элементы.Найти("МестоВСтруктуреПредприятияПериодИсторияГруппа") = Неопределено Тогда
		ЭлементГруппаПериодИстория = Элементы.Добавить("МестоВСтруктуреПредприятияПериодИсторияГруппа", Тип(
			"ГруппаФормы"), Элементы.МестоВСтруктуреПредприятияГруппа);
		ЭлементГруппаПериодИстория.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаПериодИстория.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппаПериодИстория.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЭлементГруппаПериодИстория.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаПериодИстория.РастягиватьПоГоризонтали = Истина;
	КонецЕсли;

	Если Элементы.Найти("МестоВСтруктуреПредприятияПериод") = Неопределено Тогда
		Поле = Элементы.Добавить("МестоВСтруктуреПредприятияПериод", Тип("ПолеФормы"), ЭлементГруппаПериодИстория);
		Поле.Заголовок = НСтр("ru = 'Действует с'");
		Поле.Вид = ВидПоляФормы.ПолеВвода;
		Поле.ПутьКДанным = "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период";
	КонецЕсли;

	ИмяКоманды = "МестоВСтруктуреПредприятияИсторияИзменения";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = СтрШаблон("Подключаемый_%1", ИмяКоманды);
		НоваяКоманда.Заголовок = НСтр("ru = 'История изменения'");
	КонецЕсли;

	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппаПериодИстория);
		Кнопка.Заголовок = НСтр("ru = 'История изменения'");
		Кнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		Кнопка.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииНовойПозиции(Форма, ПозицияСсылка) Экспорт

	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;

	ПрочитатьМестоВСтруктуреПредприятия(Форма, ПозицияСсылка);

КонецПроцедуры

Процедура ПриПолученииДанныхФормыПозицииШтатногоРасписания(Форма, ПозицияСсылка, ЗначениеКопирования) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьМестоВСтруктуреПредприятия(Форма, ПозицияСсылка);
	Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено = РедактированиеПоляМестоВСтруктуреПредприятияЗапрещено(Форма);
	
	УстановитьСвойстваЭлементовМестаВСтруктуреПредприятия(Форма);
	
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда

		МенеджерЗаписи = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Позиция = ПозицияСсылка;

		Отбор = Новый Структура("Позиция", ЗначениеКопирования);

		МестоВСтруктуреПредприятияСрезПоследних = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних( ,
			Отбор);

		Если МестоВСтруктуреПредприятияСрезПоследних.Количество() > 0 Тогда
			
			МестоВСтруктуреПредприятия = МестоВСтруктуреПредприятияСрезПоследних[0];
			
			МенеджерЗаписи.Подразделение = МестоВСтруктуреПредприятия.Подразделение;
			МенеджерЗаписи.Период = МестоВСтруктуреПредприятия.Период;
			
		КонецЕсли;

		Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");

		РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма,
			"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПозицияСсылка);

	КонецЕсли;
	
КонецПроцедуры

Процедура ШтатноеРасписаниеОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ) Экспорт

	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;

	Если Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено Тогда
		Возврат;
	КонецЕсли;

	Если Форма.ВнешниеДанные Тогда
		Возврат;
	КонецЕсли;

	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(Форма,
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Форма.СсылкаНаОбъект, Отказ);

КонецПроцедуры

Процедура ПриЗаписиФормыПозицииШтатногоРасписания(Форма, ТекущийОбъект) Экспорт

	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;

	Если Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено Тогда
		Возврат;
	КонецЕсли;

	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(Форма,
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ТекущийОбъект.Ссылка);

КонецПроцедуры

Процедура ДополнитьДанныеПозицииШтатногоРасписания(ДанныеПозиции, ПозицияШтатногоРасписания, ДатаПолученияДанных = '00010101') Экспорт
	
	МестоВСтруктуреПредприятия = МестоПозицииВСтруктуреПредприятия(ПозицияШтатногоРасписания, ДатаПолученияДанных);
	ДанныеПозиции.Вставить("МестоВСтруктуреПредприятия", МестоВСтруктуреПредприятия);
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовУправленияШтатногоРасписания(Форма, СозданиеНовой) Экспорт 
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Подразделение",
		"АвтоОтметкаНезаполненного",
		Ложь);
	
	УстановитьСвойстваЭлементовМестаВСтруктуреПредприятия(Форма);
	
	Если СозданиеНовой Тогда 
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Владелец",
		"ТолькоПросмотр",
		ЗначениеЗаполнено(Объект.Владелец) И Объект.Владелец <> УправленческаяОрганизация);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Подразделение",
		"ТолькоПросмотр",
		ЗначениеЗаполнено(Объект.Подразделение));
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовУправленияШтатногоРасписанияПриВеденииИстории(Форма) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	УстановитьСвойстваЭлементовМестаВСтруктуреПредприятия(Форма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	Если Объект.Владелец <> УправленческаяОрганизация Тогда 
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Подразделение",
		"АвтоОтметкаНезаполненного",
		Ложь);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Должность",
		"ТолькоПросмотр",
		ЗначениеЗаполнено(Объект.Должность));
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовУправленияШтатногоРасписанияВнешниеДанные(Форма) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"МестоВСтруктуреПредприятия",
		"ТолькоПросмотр",
		Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Владелец");
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	Если Организация <> УправленческаяОрганизация Тогда 
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Подразделение",
		"ТолькоПросмотр",
		ЗначениеЗаполнено(Объект.Подразделение));
		
КонецПроцедуры

Процедура ШтатноеРасписаниеФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
	
	Форма.СтруктураПредприятияСписок.ТекстЗапроса = ТекстЗапросаСпискаСтруктурыПредприятияДляШтатногоРасписания();
	
	ДобавитьПанельОтбораШтатногоРасписанияПоСтруктуреПредприятия(Форма, Отказ, СтандартнаяОбработка);
	ДобавитьКомандуСозданияУправленческойПозицииВСпискеШтатногоРасписания(Форма, Отказ, СтандартнаяОбработка);
	ДобавитьМестоВСтруктуреПредприятияВФормуСпискаШтатногоРасписания(Форма, "СправочникШтатноеРасписание");
	
КонецПроцедуры

Процедура УстановитьОтображениеУправленческойОрганизацииВШтатномРасписании(Форма) Экспорт 
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
		
	Если Не ОтображатьУправленческуюОрганизациюВШтатномРасписании() Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьПараметрыВыбораУправленческойОрганизации(Форма, Ложь, "Организация");
		
КонецПроцедуры

Процедура ПриПолученииВнешнихДанныхПозицииШтатногоРасписания(Форма, ДанныеПозиции) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено = РедактированиеПоляМестоВСтруктуреПредприятияЗапрещено(Форма);
	
	МенеджерЗаписи = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Позиция = ДанныеПозиции.ПозицияШтатногоРасписания;
	МенеджерЗаписи.Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	
КонецПроцедуры

Процедура ЗаполнитьМестоВСтруктуреПредприятияПоДаннымФормы(Форма, ДанныеПозиции) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПозиции.МестоВСтруктуреПредприятия = Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение;
	
КонецПроцедуры

Процедура ИзменитьПроверяемыеРеквизитыШтатногоРасписания(ПроверяемыеРеквизиты) Экспорт 
	
	Если Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда 
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Подразделение");
	
КонецПроцедуры

Процедура ПриПроведенииДокументовИзмененияШтатногоРасписания(Объект, ДатаВступленияВСилу) Экспорт 
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	СведенияОНаименованиях = Неопределено;
	Объект.ДополнительныеСвойства.Свойство("СведенияОНаименованиях", СведенияОНаименованиях);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ПозицииШтатногоРасписания", Объект.Позиции);
	Запрос.УстановитьПараметр("ИзменитьОрганизацию", Объект.Организация <> УправленческаяОрганизация);
	Запрос.УстановитьПараметр("УправленческаяОрганизация", УправленческаяОрганизация);
	Запрос.УстановитьПараметр("Период", ДатаВступленияВСилу);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ПозицииШтатногоРасписания.Позиция КАК Позиция,
	|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
	|	ПозицииШтатногоРасписания.Должность КАК Должность,
	|	ПозицииШтатногоРасписания.Подразделение КАК Подразделение,
	|	ПозицииШтатногоРасписания.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	&ПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания";

	Запрос.Выполнить();

	СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция,
	|	Позиции.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
	|	Позиции.Должность КАК Должность,
	|	Позиции.Подразделение КАК Подразделение,
	|	Позиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
	|ИЗ
	|	ВТПозиции КАК Позиции
	|ГДЕ
	|	Позиции.Позиция.Владелец = &УправленческаяОрганизация
	|	И &ИзменитьОрганизацию
	|	ИЛИ Позиции.Позиция.Должность <> Позиции.Должность
	|	ИЛИ Позиции.Позиция.Подразделение <> Позиции.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция,
	|	Позиции.Позиция.Наименование КАК Наименование,
	|	Позиции.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
	|	Позиции.Должность КАК Должность,
	|	Позиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
	|ИЗ
	|	ВТПозиции КАК Позиции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
	|		ПО Позиции.Позиция = МестаПозицийВСтруктуреПредприятия.Позиция
	|ГДЕ
	|	ЕСТЬNULL(МестаПозицийВСтруктуреПредприятия.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) <> Позиции.МестоВСтруктуреПредприятия";

	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		ПозицияОбъект = Выборка.Позиция.ПолучитьОбъект();
		ПозицияОбъект.Владелец = Объект.Организация;
		ПозицияОбъект.Должность = Выборка.Должность;
		ПозицияОбъект.Подразделение = Выборка.Подразделение;
		
		НаименованиеПозиции = "";
		Если ТипЗнч(СведенияОНаименованиях) = Тип("Соответствие") Тогда 
			НаименованиеПозиции = СведенияОНаименованиях.Получить(Выборка.ИдентификаторСтрокиПозиции);
			СведенияОНаименованиях.Удалить(Выборка.ИдентификаторСтрокиПозиции);
		ИначеЕсли ЗначениеЗаполнено(Выборка.МестоВСтруктуреПредприятия) Тогда  
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
			ДополнительныеПараметры.Вставить("МестоВСтруктуреПредприятия", Выборка.МестоВСтруктуреПредприятия);
			ДополнительныеПараметры.Вставить("ПолноеНаименованиеДолжности", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияОбъект.Должность, "НаименованиеДляЗаписейОТрудовойДеятельности"));
			ДополнительныеПараметры.Вставить("ПолноеНаименованиеПодразделения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияОбъект.Подразделение, "НаименованиеДляЗаписейОТрудовойДеятельности"));
				
			НаименованиеПозиции = УправлениеШтатнымРасписаниемКлиентСервер.НаименованиеПозицииШтатногоРасписания(
				ПозицияОбъект.Подразделение,
				ПозицияОбъект.Должность,
				ДополнительныеПараметры);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаименованиеПозиции.Наименование) Тогда 
			ПозицияОбъект.Наименование = НаименованиеПозиции.Наименование;
			ПозицияОбъект.НаименованиеПолное = НаименованиеПозиции.НаименованиеПолное;
		КонецЕсли;
		
		ПозицияОбъект.Записать();
		
	КонецЦикла;	
		
	Выборка = РезультатыЗапроса[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаименованиеПозиции = "";
		Если ТипЗнч(СведенияОНаименованиях) = Тип("Соответствие") Тогда 
			НаименованиеПозиции = СведенияОНаименованиях.Получить(Выборка.ИдентификаторСтрокиПозиции);
			СведенияОНаименованиях.Удалить(Выборка.ИдентификаторСтрокиПозиции);
		ИначеЕсли ЗначениеЗаполнено(Выборка.МестоВСтруктуреПредприятия) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
			ДополнительныеПараметры.Вставить("МестоВСтруктуреПредприятия", Выборка.МестоВСтруктуреПредприятия);
			ДополнительныеПараметры.Вставить("ПолноеНаименованиеДолжности", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Должность, "НаименованиеДляЗаписейОТрудовойДеятельности"));
			
			НаименованиеПозиции = УправлениеШтатнымРасписаниемКлиентСервер.НаименованиеПозицииШтатногоРасписания(
				Выборка.МестоВСтруктуреПредприятия,
				Выборка.Должность,
				ДополнительныеПараметры);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НаименованиеПозиции) И НаименованиеПозиции.Наименование <> Выборка.Наименование Тогда 
			ПозицияОбъект = Выборка.Позиция.ПолучитьОбъект();
			ПозицияОбъект.Наименование = НаименованиеПозиции.Наименование;
			ПозицияОбъект.НаименованиеПолное = НаименованиеПозиции.НаименованиеПолное;
			ПозицияОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьФормуДокументовИзмененияШтатногоРасписания(Форма, ПутьКДаннымДатаВступленияВСилу) Экспорт 
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "ПодборУправленческойПозиции";
	Элементы = Форма.Элементы;
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Подбор'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.Позиции.КоманднаяПанель);
		Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
	Если Элементы.Найти("ПозицииМестоВСтруктуреПредприятия") = Неопределено Тогда
		ПолеПодразделение = Элементы.Добавить("ПозицииМестоВСтруктуреПредприятия", Тип("ПолеФормы"), Элементы.ПодразделениеДолжностьГруппа);
		ПолеПодразделение.Вид = ВидПоляФормы.ПолеВвода;
		ПолеПодразделение.ПутьКДанным = "Объект.Позиции.МестоВСтруктуреПредприятия";
		ПолеПодразделение.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ОрганизационнаяСтруктура.МестаПозицийШтатногоРасписанияВСтруктуреПредприятия") Тогда
		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятияФормы = ОбщегоНазначения.ОбщийМодуль(
			"МестаПозицийШтатногоРасписанияВСтруктуреПредприятияФормы");
		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятияФормы.ДополнитьФормуДокументовИзмененияШтатногоРасписания(
			Форма, ПутьКДаннымДатаВступленияВСилу);
	КонецЕсли;
	
КонецПроцедуры

Процедура ШтатноеРасписаниеПриЗаписи(ПозицияОбъект, Отказ) Экспорт
	
	ПозицияВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПозицияОбъект.Ссылка);
	Если ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		ПрежниеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПозицияОбъект.ДополнительныеСвойства, "ПрежниеДанныеОбъекта");
		Если ПрежниеДанные <> Неопределено
			И (ПрежниеДанные.Утверждена <> ПозицияОбъект.Утверждена
				Или ПрежниеДанные.ДатаУтверждения <> ПозицияОбъект.ДатаУтверждения
				Или ПрежниеДанные.Закрыта <> ПозицияОбъект.Закрыта
				Или ПрежниеДанные.ДатаЗакрытия <> ПозицияОбъект.ДатаЗакрытия) Тогда
			
			ОбновитьСведенияПодразделенийПоСпискуПозиций(ПозицияВМассиве);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Если ПозицияОбъект.ГруппаПозицийПодразделения Тогда
		Возврат;
	КонецЕсли;

	ОбновитьМестаПозицийШтатногоРасписанияПоСтруктуреЮридическихЛиц(ПозицияВМассиве);
	
КонецПроцедуры

Процедура ОбновитьМестаПозицийШтатногоРасписанияПоСтруктуреЮридическихЛиц(Позиции = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если Позиции <> Неопределено Тогда
		ИсточникДляБлокировки = Новый ТаблицаЗначений;
		ИсточникДляБлокировки.Колонки.Добавить("Позиция");
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ИсточникДляБлокировки, Позиции, "Позиция");
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШтатноеРасписание");
	Если Позиции <> Неопределено Тогда
		ЭлементБлокировкиДанных.ИсточникДанных = ИсточникДляБлокировки;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Ссылка", "Позиция");
	КонецЕсли;
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	Если Позиции <> Неопределено Тогда
		ЭлементБлокировкиДанных.ИсточникДанных = ИсточникДляБлокировки;
		ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Позиция", "Позиция");
	КонецЕсли;
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Позиции", Позиции);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтатноеРасписание.Ссылка КАК Позиция,
	|	ВЫБОР
	|		КОГДА ШтатноеРасписание.ДатаУтверждения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(1900, 1, 1)
	|		ИНАЧЕ ШтатноеРасписание.ДатаУтверждения
	|	КОНЕЦ КАК Период,
	|	МАКСИМУМ(СтруктураПредприятия.Ссылка) КАК Подразделение
	|ПОМЕСТИТЬ ВТМестаВСтруктуреПредприятия
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО СтруктураПредприятия.Источник = ШтатноеРасписание.Подразделение
	|		И НЕ ШтатноеРасписание.ГруппаПозицийПодразделения
	|		И &ОтборПозиций
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписание.Ссылка,
	|	ВЫБОР
	|		КОГДА ШтатноеРасписание.ДатаУтверждения = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(1900, 1, 1)
	|		ИНАЧЕ ШтатноеРасписание.ДатаУтверждения
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МестаПозиций.Позиция КАК Позиция,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	ВТМестаВСтруктуреПредприятия КАК МестаПозиций";

	Запрос.Текст = СтрЗаменить(
		Запрос.Текст, 
		"&ОтборПозиций", 
		?(Позиции = Неопределено, "ИСТИНА", "ШтатноеРасписание.Ссылка В (&Позиции)"));
	
	Запрос.Выполнить();

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПозиции", "Позиция"),
		,
		"ВТСохраненныеМеста");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МестаПозиций.Период КАК Период,
	|	МестаПозиций.Позиция КАК Позиция,
	|	МестаПозиций.Подразделение КАК Подразделение
	|ИЗ
	|	ВТМестаВСтруктуреПредприятия КАК МестаПозиций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСохраненныеМеста КАК ОтсутствующиеЗаписи
	|		ПО ОтсутствующиеЗаписи.Период = МестаПозиций.Период
	|		И ОтсутствующиеЗаписи.Позиция = МестаПозиций.Позиция
	|		И ОтсутствующиеЗаписи.Подразделение = МестаПозиций.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСохраненныеМеста КАК ОтличающиесяЗаписи
	|		ПО ОтличающиесяЗаписи.Позиция = МестаПозиций.Позиция
	|		И (ОтличающиесяЗаписи.Период <> МестаПозиций.Период
	|		ИЛИ ОтличающиесяЗаписи.Подразделение <> МестаПозиций.Подразделение)
	|ГДЕ
	|	ОтсутствующиеЗаписи.Позиция ЕСТЬ NULL
	|	ИЛИ ОтличающиесяЗаписи.Позиция ЕСТЬ НЕ NULL";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(Выборка.Позиция);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		
		НаборЗаписей.Записать();
	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьМестаПозицийШтатногоРасписанияПоДвижениямИзмененияМеста() Экспорт

	Запрос = ЗапросОбновленияМестаПозицийШтатногоРасписанияПоДвижениямИзмененияМеста();

	УстановитьПривилегированныйРежим(Истина);

	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(
		"РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();

	Попытка

		БлокировкаДанных.Заблокировать();

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Позиция") Цикл

			НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Позиция.Установить(Выборка.Позиция);

			Пока Выборка.Следующий() Цикл

				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);

			КонецЦикла;

			НаборЗаписей.Записать();

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр(
			"ru = 'Организационная структура. Полное обновление истории изменения места позиции в структуре предприятия.'",
			ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));

		ВызватьИсключение;

	КонецПопытки;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура УточнитьЗапросДанныхВыбораСправочникаШтатноеРасписание(Запрос, Параметры) Экспорт
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("МестоВСтруктуреПредприятия") Тогда
		
		Если ЗначениеЗаполнено(Параметры.Отбор.МестоВСтруктуреПредприятия) Тогда

			ТекстЗапросаФильтрВТМестаПозиций =
			"ВЫБРАТЬ
			|	&ДатаОкончанияПримененияОтбора КАК Период
			|ПОМЕСТИТЬ ВТФильтрМестаПозиций";

			ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
				"ВТФильтрМестаПозиций");
			ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
			
			ЗапросВТМестаПозиций = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
				"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Истина, ОписаниеФильтра, ПараметрыПостроения,
				Истина, "ВТМестаПозицийВСтруктуреПредприятия");

			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ШтатноеРасписание КАК ШтатноеРасписание", "Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|	ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
			|	ПО ШтатноеРасписание.Ссылка = МестаПозицийВСтруктуреПредприятия.Позиция");

			Запрос.Текст = Запрос.Текст + "
			|	И ЕСТЬNULL(МестаПозицийВСтруктуреПредприятия.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) В (
			|		ВЫБРАТЬ
			|			СтруктурнаяЕдиница
			|		ИЗ
			|			РегистрСведений.ПодчиненностьСтруктурныхЕдиниц
			|		ГДЕ
			|			ВышестоящаяСтруктурнаяЕдиница В (&МестоВСтруктуреПредприятия))";
			
			ТекстОбъединенногоЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ТекстОбъединенногоЗапроса(
				ТекстЗапросаФильтрВТМестаПозиций, ЗапросВТМестаПозиций.Текст, Запрос.Текст);
			Запрос.Текст = ТекстОбъединенногоЗапроса;
			
			Запрос.УстановитьПараметр("МестоВСтруктуреПредприятия", Параметры.Отбор.МестоВСтруктуреПредприятия);

		КонецЕсли;
		
		Параметры.Отбор.Удалить("МестоВСтруктуреПредприятия");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриПолученииТекстаЗапросаАктуальныхПозицийШтатногоРасписания(Запрос, Ссылка, СтандартнаяОбработка) Экспорт
	
	Если Не ТипЗнч(Ссылка) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаФильтрВТМестаПозиций =
	"ВЫБРАТЬ
	|	&ДатаОкончанияПримененияОтбора КАК Период
	|ПОМЕСТИТЬ ВТФильтрМестаПозиций";

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрМестаПозиций");

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Подразделение", "=",
		"&Подразделение");

	ЗапросВТМестаПозицийСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Истина, ОписаниеФильтра, ПараметрыПостроения, Истина,
		"ВТМестаПозицийВСтруктуреПредприятияСрезПоследних");

	ТекстЗапросаВТМестаПозицийВСтруктуреПредприятия =
	"ВЫБРАТЬ
	|	МестаПозицийВСтруктуреПредприятияСрезПоследних.Позиция КАК Позиция,
	|	МестаПозицийВСтруктуреПредприятияСрезПоследних.Подразделение Как Подразделение
	|ПОМЕСТИТЬ ВТМестаПозицийВСтруктуреПредприятия
	|ИЗ
	|	ВТМестаПозицийВСтруктуреПредприятияСрезПоследних КАК МестаПозицийВСтруктуреПредприятияСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция,
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|		МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|ГДЕ
	|	МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение = &Подразделение
	|	И МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период >= &ДатаОкончанияПримененияОтбора";
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтатноеРасписание.Наименование КАК ПозицияШтатногоРасписания,
	|	ШтатноеРасписание.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
	|		ПО МестаПозицийВСтруктуреПредприятия.Позиция = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	НЕ ШтатноеРасписание.ГруппаПозицийПодразделения
	|	И НЕ (ШтатноеРасписание.Закрыта
	|	И ШтатноеРасписание.ДатаЗакрытия <= &ДатаРасформирования)";

	ТекстОбъединенногоЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ТекстОбъединенногоЗапроса(
		ТекстЗапросаФильтрВТМестаПозиций, ЗапросВТМестаПозицийСрез.Текст,
		ТекстЗапросаВТМестаПозицийВСтруктуреПредприятия, Запрос.Текст);
	Запрос.Текст = ТекстОбъединенногоЗапроса;

	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ПриЗаписиИсторииИспользованияШтатногоРасписания(НаборЗаписей, Отказ, Замещение) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ОрганизационнаяСтруктура.МестаПозицийШтатногоРасписанияВСтруктуреПредприятия") Тогда

		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия  = ОбщегоНазначения.ОбщийМодуль(
			"МестаПозицийШтатногоРасписанияВСтруктуреПредприятия");
		Если МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	ПараметрыФормирования = ПараметрыФормированияВторичныхДанныхМестаПозицииВСтруктуре(НаборЗаписей, Замещение);
	ПараметрыФормирования.ИмяПоляПериод = "Дата";
	
	ОбновитьВторичныеДанныеМестаПозицииВСтруктуре(ПараметрыФормирования, Отказ);
	
КонецПроцедуры

Функция ПараметрыФормированияВторичныхДанныхМестаПозицииВСтруктуре(НаборЗаписей, Замещение) Экспорт
	
	ПараметрыФормирования = Новый Структура;
	ПараметрыФормирования.Вставить("НаборЗаписей", НаборЗаписей);
	ПараметрыФормирования.Вставить("Замещение", Замещение);
	ПараметрыФормирования.Вставить("ИмяПоляПозиция", "ПозицияШтатногоРасписания");
	ПараметрыФормирования.Вставить("ИмяПоляПериод", "Период");
	
	Возврат ПараметрыФормирования;
	
КонецФункции

Процедура ОбновитьВторичныеДанныеМестаПозицииВСтруктуре(ПараметрыФормирования, Отказ) Экспорт
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ПараметрыФормирования.НаборЗаписей,
		ПараметрыФормирования.Замещение, "Регистратор");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредыдущийНабор.Позиция КАК Позиция,
	|	ПредыдущийНабор.Период КАК Период,
	|	NULL КАК Подразделение,
	|	NULL КАК Основание,
	|	ИСТИНА КАК УдалитьЗапись
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ПредыдущийНабор
	|		ЛЕВОЕ СОЕДИНЕНИЕ &ИмяТаблицы КАК ТекущийНабор
	|		ПО ПредыдущийНабор.Позиция = ТекущийНабор.ПозицияШтатногоРасписания
	|		И ПредыдущийНабор.Период = ТекущийНабор.Период
	|		И ПредыдущийНабор.Основание = ТекущийНабор.Регистратор
	|ГДЕ
	|	ПредыдущийНабор.Основание В (&Регистраторы)
	|	И ТекущийНабор.ПозицияШтатногоРасписания ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущийНабор.ПозицияШтатногоРасписания,
	|	ТекущийНабор.Период,
	|	ТекущийНабор.МестоВСтруктуреПредприятия,
	|	ТекущийНабор.Регистратор,
	|	ЛОЖЬ
	|ИЗ
	|	&ИмяТаблицы КАК ТекущийНабор
	|ГДЕ
	|	ТекущийНабор.Регистратор В (&Регистраторы)";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТекущийНабор.ПозицияШтатногоРасписания", СтрШаблон("ТекущийНабор.%1",
		ПараметрыФормирования.ИмяПоляПозиция));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТекущийНабор.Период", СтрШаблон("ТекущийНабор.%1",
		ПараметрыФормирования.ИмяПоляПериод));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ОбщегоНазначения.ИмяТаблицыПоСсылке(
		ПараметрыФормирования.НаборЗаписей));
	
	НачатьТранзакцию();
	Попытка

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(
				"РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
			ЭлементБлокировки.УстановитьЗначение("Позиция", Выборка.Позиция);
			ЭлементБлокировки.УстановитьЗначение("Период", Выборка.Период);
			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Позиция.Установить(Выборка.Позиция);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);

			Если Выборка.УдалитьЗапись Тогда
				НаборЗаписей.Записать();
				Продолжить;
			КонецЕсли;

			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);

			НаборЗаписей.Записать();

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();

		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке()), ,
			, , Отказ);

	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьДанныеДляПодбораСотрудниковПоСпискуПозиций(СписокПозиций, ОтключитьБизнесЛогику = Ложь, ДополнительныеСвойства = Неопределено) Экспорт
	
	Если ТипЗнч(СписокПозиций) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
		МассивПозиций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СписокПозиций);
	Иначе
		МассивПозиций = СписокПозиций;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДляПодбора.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
	|ГДЕ
	|	ДанныеДляПодбора.ДолжностьПоШтатномуРасписанию В (&МассивПозиций)";
	
	Запрос.УстановитьПараметр("МассивПозиций", МассивПозиций);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивСотрудников = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивСотрудников.Добавить(Выборка.Сотрудник);
	КонецЦикла;

	Если МассивСотрудников.Количество() > 0 Тогда
		РегистрыСведений.ДанныеДляПодбораСотрудников.ОбновитьДанныеДляПодбораСотрудников(МассивСотрудников, ОтключитьБизнесЛогику, ДополнительныеСвойства);
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьКадровуюИсториюМестамиВСтруктуреПредприятия(Запрос) Экспорт

	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст,
		"ВТРегистрСведенийКадровыхДанных", "ВТКадровыеДанныеДляМестаВСтруктуреПредприятия");

	Запрос.Выполнить();

	ВТКуничтожению = Новый Массив;

	ПромежуточныйЗапрос = Новый Запрос;
	ПромежуточныйЗапрос.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ПромежуточныйЗапрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КадровыеДанные.ДолжностьПоШтатномуРасписанию КАК Позиция,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТПозиции
	|ИЗ
	|	ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК КадровыеДанные";

	ПромежуточныйЗапрос.Выполнить();

	ВТКуничтожению.Добавить("ВТПозиции");

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПозиции", "Позиция"));

	ВТКуничтожению.Добавить("ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия");

	СоздатьВТКадроваяИсторияМестаВСтруктуреПредприятия(Запрос.МенеджерВременныхТаблиц);

	ПромежуточныйЗапрос.Текст = "";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросыУничтоженияВременныхТаблиц(ПромежуточныйЗапрос.Текст,ВТКуничтожению);

	ПромежуточныйЗапрос.Выполнить();

	ПозицияСловаПоместить = СтрНайти(ВРег(Запрос.Текст), ВРег("ПОМЕСТИТЬ "));
	КоллекцияПолей = ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(Запрос.Текст, ПозицияСловаПоместить - 1));

	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить("ВЫБРАТЬ");

	ПоляЗапроса = Новый Массив;
	Для Каждого Поле Из КоллекцияПолей Цикл
		Если Поле = "МестоВСтруктуреПредприятия" Тогда
			ПоляЗапроса.Добавить(СтрШаблон("	ЕСТЬNULL(МестаВСтруктуреПредприятия.%1, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК %1", Поле));
		ИначеЕсли Поле = "Период" Тогда
			ПоляЗапроса.Добавить(СтрШаблон("	МестаВСтруктуреПредприятия.%1 КАК %1", Поле));
		Иначе
			ПоляЗапроса.Добавить(СтрШаблон("	РегистрСведений.%1 КАК %1", Поле));
		КонецЕсли;
	КонецЦикла;

	ЧастиЗапроса.Добавить(СтрСоединить(ПоляЗапроса, СтрШаблон(",%1", Символы.ПС)));
	
	ЧастиЗапроса.Добавить(
	"ПОМЕСТИТЬ ВТРегистрСведенийКадровыхДанных
	|ИЗ
	|	ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК РегистрСведений
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТКадроваяИсторияМестаВСтруктуреПредприятия КАК МестаВСтруктуреПредприятия
	|		ПО РегистрСведений.ДолжностьПоШтатномуРасписанию = МестаВСтруктуреПредприятия.ДолжностьПоШтатномуРасписанию
	|			И РегистрСведений.Сотрудник = МестаВСтруктуреПредприятия.Сотрудник
	|			И РегистрСведений.Период = МестаВСтруктуреПредприятия.ПериодКадроваяИстория");

	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);

КонецПроцедуры

Процедура СоздатьВТКадроваяИсторияМестаВСтруктуреПредприятия(МенеджерВременныхТаблиц, ИмяПериода = "Период") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеДанные.Сотрудник КАК Сотрудник,
	|	КадровыеДанные.Период КАК Период,
	|	КадровыеДанные.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	МИНИМУМ(КадровыеДанныеСледующие.Период) КАК ПериодСледующегоСобытия
	|ПОМЕСТИТЬ ВТКадровыеСобытияСПоследующими
	|ИЗ
	|	ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК КадровыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК КадровыеДанныеСледующие
	|		ПО КадровыеДанные.Сотрудник = КадровыеДанныеСледующие.Сотрудник
	|			И КадровыеДанные.Период < КадровыеДанныеСледующие.Период
	|СГРУППИРОВАТЬ ПО
	|	КадровыеДанные.Сотрудник,
	|	КадровыеДанные.Период,
	|	КадровыеДанные.ДолжностьПоШтатномуРасписанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПериодыКадровойИстории.Сотрудник КАК Сотрудник,
	|	ПериодыКадровойИстории.Период КАК Период,
	|	ПериодыКадровойИстории.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию
	|ПОМЕСТИТЬ ВТПериодыМестВСтруктуре
	|ИЗ
	|	ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК ПериодыКадровойИстории
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КадровыеСобытия.Сотрудник,
	|	МестаПозиций.Период,
	|	МестаПозиций.Позиция
	|ИЗ
	|	ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестаПозиций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыеСобытияСПоследующими КАК КадровыеСобытия
	|		ПО МестаПозиций.Позиция = КадровыеСобытия.ДолжностьПоШтатномуРасписанию
	|			И МестаПозиций.Период > КадровыеСобытия.Период
	|			И (КадровыеСобытия.ПериодСледующегоСобытия ЕСТЬ NULL
	|				ИЛИ МестаПозиций.Период < КадровыеСобытия.ПериодСледующегоСобытия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Периоды.Сотрудник КАК Сотрудник,
	|	Периоды.Период КАК Период,
	|	Периоды.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	МАКСИМУМ(МестаПозиций.Период) КАК ПериодМестаСтруктуры,
	|	МАКСИМУМ(ПериодыКадровойИстории.Период) КАК ПериодКадроваяИстория
	|ПОМЕСТИТЬ ВТПериодыИсторииМестВСтруктуре
	|ИЗ
	|	ВТПериодыМестВСтруктуре КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеДляМестаВСтруктуреПредприятия КАК ПериодыКадровойИстории
	|		ПО Периоды.ДолжностьПоШтатномуРасписанию = ПериодыКадровойИстории.ДолжностьПоШтатномуРасписанию
	|			И Периоды.Сотрудник = ПериодыКадровойИстории.Сотрудник
	|			И Периоды.Период >= ПериодыКадровойИстории.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестаПозиций
	|		ПО Периоды.ДолжностьПоШтатномуРасписанию = МестаПозиций.Позиция
	|			И Периоды.Период >= МестаПозиций.Период
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Сотрудник,
	|	Периоды.Период,
	|	Периоды.ДолжностьПоШтатномуРасписанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыИстории.Сотрудник КАК Сотрудник,
	|	ПериодыИстории.Период КАК Период,
	|	ПериодыИстории.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	|	ПериодыИстории.ПериодКадроваяИстория КАК ПериодКадроваяИстория,
	|	МестаПозиций.Подразделение КАК МестоВСтруктуреПредприятия
	|ПОМЕСТИТЬ ВТКадроваяИсторияМестаВСтруктуреПредприятия
	|ИЗ
	|	ВТПериодыИсторииМестВСтруктуре КАК ПериодыИстории
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестаПозиций
	|		ПО ПериодыИстории.ДолжностьПоШтатномуРасписанию = МестаПозиций.Позиция
	|		И ПериодыИстории.ПериодМестаСтруктуры = МестаПозиций.Период
	|ГДЕ
	|	НЕ ПериодыИстории.ПериодКадроваяИстория ЕСТЬ NULL";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "МестаПозиций.Период", "МестаПозиций." + ИмяПериода);

	ВТКуничтожению = Новый Массив;
	ВТКуничтожению.Добавить("ВТКадровыеСобытияСПоследующими");
	ВТКуничтожению.Добавить("ВТПериодыМестВСтруктуре");
	ВТКуничтожению.Добавить("ВТПериодыИсторииМестВСтруктуре");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросыУничтоженияВременныхТаблиц(Запрос.Текст, ВТКуничтожению);

	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ИспользованиеВРегламентированномУчете

Функция СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Экспорт
	
	Используется = Ложь;
	
	ЗарплатаКадрыРасширенныйПереопределяемый.ОпределитьИспользованиеСтруктурыПредприятияДляОтраженияВРегламентированномУчете(Используется);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенный.ОпределитьИспользованиеСтруктурыПредприятияДляОтраженияВРегламентированномУчете(Используется);
	КонецЕсли;

	Возврат Используется;
	
КонецФункции

Процедура ДополнитьФормуДокументаОтражениеЗарплатыВБухучете(Форма) Экспорт 
	
	Если Не СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = "НачисленнаяЗарплатаИВзносыМестоВСтруктуреПредприятия";
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда 
	
		Родитель = Форма.Элементы.Найти("НачисленнаяЗарплатаИВзносы");
		СледующийЭлемент = Форма.Элементы.Найти("НачисленнаяЗарплатаИВзносыВидОперации");
		
		СтруктураПредприятия = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, СледующийЭлемент); 
		СтруктураПредприятия.Вид = ВидПоляФормы.ПолеВвода;
		СтруктураПредприятия.ПутьКДанным = "Объект.НачисленнаяЗарплатаИВзносы.МестоВСтруктуреПредприятия";
		СтруктураПредприятия.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
		
	КонецЕсли;
		
	ИмяЭлемента = "УдержаннаяЗарплатаМестоВСтруктуреПредприятия";
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда 
	
		Родитель = Форма.Элементы.Найти("УдержаннаяЗарплата");
		СледующийЭлемент = Форма.Элементы.Найти("УдержаннаяЗарплатаВидОперации");
		
		СтруктураПредприятия = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, СледующийЭлемент); 
		СтруктураПредприятия.Вид = ВидПоляФормы.ПолеВвода;
		СтруктураПредприятия.ПутьКДанным = "Объект.УдержаннаяЗарплата.МестоВСтруктуреПредприятия";
		СтруктураПредприятия.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДанныеДокументаМестомВСтруктуреПредприятия(ДанныеДокумента, ИменаТаблиц) Экспорт 
	
	Если Не СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Тогда 
		Возврат;
	КонецЕсли;
	
	СписокТаблиц = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаТаблиц);
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НомерТаблицы = 1;
	ИсходныеДанныеТекст = "";
	СотрудникиПериодыТекст = "";
	
	Для Каждого КлючИЗначение Из ДанныеДокумента Цикл 
		
		Если СписокТаблиц.Найти(КлючИЗначение.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ИмяТаблицы = "ТаблицаДокумента" + НомерТаблицы;
		ИмяВременнойТаблицы = "ВТТаблицаДокумента" + НомерТаблицы;
		
		Запрос.УстановитьПараметр(ИмяТаблицы, КлючИЗначение.Значение);
		
		Если КлючИЗначение.Ключ = "УдержаннаяЗарплата" Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ТаблицаДокумента.Сотрудник КАК Сотрудник,
			               |	ТаблицаДокумента.ДатаНачала КАК Период
			               |ПОМЕСТИТЬ ВТПредварительнаяТаблицаДокумента
			               |ИЗ
			               |	&ИмяТаблицы КАК ТаблицаДокумента
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаДокумента.Сотрудник КАК Сотрудник,
			               |	ТаблицаДокумента.Период КАК Период
			               |ПОМЕСТИТЬ ВТТаблицаДокумента
			               |ИЗ
			               |	ВТПредварительнаяТаблицаДокумента КАК ТаблицаДокумента
			               |
			               |ОБЪЕДИНИТЬ
			               |
			               |ВЫБРАТЬ
			               |	ТаблицаДокумента.Сотрудник,
			               |	НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ТаблицаДокумента.Период, МЕСЯЦ), ДЕНЬ)
			               |ИЗ
			               |	ВТПредварительнаяТаблицаДокумента КАК ТаблицаДокумента";
		Иначе
			ТекстЗапроса = "ВЫБРАТЬ
			               |	ТаблицаДокумента.Сотрудник КАК Сотрудник,
			               |	ТаблицаДокумента.ДатаНачала КАК Период
			               |ПОМЕСТИТЬ ВТТаблицаДокумента
			               |ИЗ
			               |	&ИмяТаблицы КАК ТаблицаДокумента";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяТаблицы", ИмяТаблицы);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВТТаблицаДокумента", ИмяВременнойТаблицы);
		
		РазделительЗапросов = ?(НомерТаблицы = 1, "", ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов());
		ИсходныеДанныеТекст = ИсходныеДанныеТекст + РазделительЗапросов + ТекстЗапроса;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТаблицаДокумента.Сотрудник,
		               |	ТаблицаДокумента.Период
		               |ПОМЕСТИТЬ ВТСотрудникиПериоды
		               |ИЗ
		               |	#ВТТаблицаДокумента КАК ТаблицаДокумента";
					   
		Если НомерТаблицы <> 1 Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТСотрудникиПериоды", "");
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ВТТаблицаДокумента", ИмяВременнойТаблицы);
		
		ТекстОбъединить = "
		                  |ОБЪЕДИНИТЬ
		                  |";

		Если НомерТаблицы = 1 Тогда 
			ТекстОбъединить = "";
		КонецЕсли;
		
		СотрудникиПериодыТекст = СотрудникиПериодыТекст + ТекстОбъединить + ТекстЗапроса;
		
		НомерТаблицы = НомерТаблицы + 1;
		
	КонецЦикла;
	
	Если ИсходныеДанныеТекст = "" Тогда 
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(ИсходныеДанныеТекст, СотрудникиПериодыТекст);
	
	Запрос.Текст = ИсходныеДанныеТекст;
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
	КадровыеДанные = "МестоВСтруктуреПредприятия";
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадровыеДанныеСотрудников.Сотрудник,
	               |	КадровыеДанныеСотрудников.Период,
	               |	КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия
	               |ИЗ
	               |	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников";
				   
	МестоВСтруктуреПредприятияСотрудников = Запрос.Выполнить().Выгрузить();
	МестоВСтруктуреПредприятияСотрудников.Индексы.Добавить("Сотрудник,Период");
	
	ТипСтруктураПредприятия = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	
	Для Каждого КлючИЗначение Из ДанныеДокумента Цикл 
		
		Если СписокТаблиц.Найти(КлючИЗначение.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ТаблицаДокумента = КлючИЗначение.Значение;
		Если ТаблицаДокумента.Колонки.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда 
			ТаблицаДокумента.Колонки.Добавить("МестоВСтруктуреПредприятия", ТипСтруктураПредприятия);
		КонецЕсли;
		
		ЭтоУдержаннаяЗарплата = КлючИЗначение.Ключ = "УдержаннаяЗарплата";
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл 
			Отбор = Новый Структура("Сотрудник,Период", СтрокаТаблицы.Сотрудник, СтрокаТаблицы.ДатаНачала);
			НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() > 0 Тогда 
				СтрокаТаблицы.МестоВСтруктуреПредприятия = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
			КонецЕсли;
			Если ЭтоУдержаннаяЗарплата И Не ЗначениеЗаполнено(СтрокаТаблицы.МестоВСтруктуреПредприятия) Тогда
				Отбор.Период = НачалоДня(КонецМесяца(СтрокаТаблицы.ДатаНачала));
				НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
				Если НайденныеСтроки.Количество() > 0 Тогда 
					СтрокаТаблицы.МестоВСтруктуреПредприятия = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьФормуДокументаНачислениеОценочныхОбязательствПоОтпускам(Форма) Экспорт 
	
	Если Не СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = "ОценочныеОбязательстваМестоВСтруктуреПредприятия";
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда 
		Родитель = Форма.Элементы.Найти("ОценочныеОбязательства");
		СледующийЭлемент = Форма.Элементы.Найти("ОценочныеОбязательстваПодразделение");
		СтруктураПредприятия = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, СледующийЭлемент); 
		СтруктураПредприятия.Вид = ВидПоляФормы.ПолеВвода;
		СтруктураПредприятия.ПутьКДанным = "Объект.ОценочныеОбязательства.МестоВСтруктуреПредприятия";
		СтруктураПредприятия.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
	КонецЕсли;
	
	ИмяЭлемента = "ОценочныеОбязательстваПоСотрудникамМестоВСтруктуреПредприятия";
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда 
		Родитель = Форма.Элементы.Найти("ОценочныеОбязательстваПоСотрудникам");
		СледующийЭлемент = Форма.Элементы.Найти("ОценочныеОбязательстваПоСотрудникамПодразделение");
		СтруктураПредприятия = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, СледующийЭлемент); 
		СтруктураПредприятия.Вид = ВидПоляФормы.ПолеВвода;
		СтруктураПредприятия.ПутьКДанным = "Объект.ОценочныеОбязательстваПоСотрудникам.МестоВСтруктуреПредприятия";
		СтруктураПредприятия.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТаблицуЗначенийМестомВСтруктуреПредприятия(ТаблицаСДанными) Экспорт
	
	МестоВСтруктуреПредприятияСотрудников = КадровыйУчет.КадровыеДанныеСотрудниковПоТаблицеЗначений(
		Ложь, 
		ТаблицаСДанными, 
		"МестоВСтруктуреПредприятия");
	
	Для Каждого СтрокаТаблицы Из ТаблицаСДанными Цикл 
		Отбор = Новый Структура("Сотрудник,Период", СтрокаТаблицы.Сотрудник, СтрокаТаблицы.Период);
		НайденныеСтроки = МестоВСтруктуреПредприятияСотрудников.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			СтрокаТаблицы.МестоВСтруктуреПредприятия = НайденныеСтроки[0].МестоВСтруктуреПредприятия;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьФормуДокументаСтатистикаПерсонала(Форма) Экспорт 
	
	Если Не СтруктураПредприятияИспользуетсяДляОтраженияЗарплатыВРегламентированномУчете() Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяЭлемента = "ПоказателиМестоВСтруктуреПредприятия";
	
	Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда 
	
		Родитель = Форма.Элементы.Найти("Показатели");
		СледующийЭлемент = Форма.Элементы.Найти("ГруппаСреднесписочнаяЧисленность");
		
		СтруктураПредприятия = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, СледующийЭлемент); 
		СтруктураПредприятия.Вид = ВидПоляФормы.ПолеВвода;
		СтруктураПредприятия.ПутьКДанным = "Объект.Показатели.МестоВСтруктуреПредприятия";
		СтруктураПредприятия.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ОрганизационнаяСтруктура);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОрганизационнаяСтруктура, "ЮридическаяСтруктура");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ОрганизационнаяСтруктура, "УправленческаяСтруктура");
	Вариант.ФункциональныеОпции.Добавить("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц");
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4fd-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.СтруктураПредприятия);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.СтруктураПредприятия, Истина);
	
КонецПроцедуры

Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения");
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ОрганизационнаяСтруктура.МестаПозицийШтатногоРасписанияВСтруктуреПредприятия") Тогда
		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия  = ОбщегоНазначения.ОбщийМодуль(
			"МестаПозицийШтатногоРасписанияВСтруктуреПредприятия");
		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ДополнитьОписаниеПрофиляЧтение(ОписаниеПрофиля);
	КонецЕсли;
	
КонецПроцедуры

// Обслуживание подсистемы УправлениеДоступом
// см. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	// Структура предприятия.
	Если ВидыДоступа.Найти("Подразделения", "Имя") = Неопределено Тогда
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя = "Подразделения";
		ВидДоступа.Представление = НСтр("ru = 'Структура предприятия'");
		ВидДоступа.ТипЗначений = Тип("СправочникСсылка.СтруктураПредприятия");
	КонецЕсли;
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	Если ИмяВидаДоступа = "Подразделения" Тогда
		Использование = Константы.ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы.Получить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Устанавливает использование структуры предприятия.
// 
// Параметры:
// 	СоответствуетСтруктуреЮридическихЛиц - Булево - устанавливаемое положение настройки.
//
Процедура УстановитьИспользованиеСтруктурыПредприятия(СоответствуетСтруктуреЮридическихЛиц) Экспорт
	Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц.Установить(Не СоответствуетСтруктуреЮридическихЛиц);
КонецПроцедуры

// Возвращает соответствует ли структура предприятия структуре юридических лиц
//
// Возвращаемое значение:
//	Булево - ИСТИНА, если структура соответствует структуре юридических лиц
//		Иначе возвращает ЛОЖЬ
//
Функция СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц() Экспорт
	
	Возврат Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц");
	
КонецФункции

Процедура ЗарегистрироватьИзменениеКадровойИсторииПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанных") Тогда
		Возврат;
	КонецЕсли;
	МодульСинхронизацияДанных = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыСервер");
	
	Если Не МодульСинхронизацияДанных.ПринадлежностьФизическихЛицПоПодразделениямЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделенияНовые = Новый Массив;
	ФизическиеЛицаНовые = Новый Массив;
	ПодразделенияУтраченные = Новый Массив;
	ФизическиеЛицаУтраченные = Новый Массив;
	
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора();
	
	Позиции = ИзменившиесяДанные.ВыгрузитьКолонку("НовоеЗначениеДолжностьПоШтатномуРасписанию");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Позиции, ИзменившиесяДанные.ВыгрузитьКолонку("СтароеЗначениеДолжностьПоШтатномуРасписанию"), Истина);
	МестаПозицийВСтруктуреПредприятия = МестаПозицийВСтруктуреПредприятия(Позиции);
	МестаПозицийВСтруктуреПредприятия.Индексы.Добавить("Позиция");
	
	// Анализируем изменения того, что влияет на принадлежность физического лица к структурным подразделениям: позиции.
	ОтборСтрок = Новый Структура("Позиция");
	Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
		Если СтрокаТаблицы["Добавление"] = Истина Или СтрокаТаблицы["ИзменилсяРесурсДолжностьПоШтатномуРасписанию"] = Истина Тогда
			ОтборСтрок.Позиция = СтрокаТаблицы.НовоеЗначениеДолжностьПоШтатномуРасписанию;
			НайденныеСтроки = МестаПозицийВСтруктуреПредприятия.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Подразделение = НайденныеСтроки[0].Подразделение;
				ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(ПодразделенияНовые, Подразделение);
				ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(ФизическиеЛицаНовые, СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;
		Если СтрокаТаблицы["Удаление"] = Истина Или СтрокаТаблицы["ИзменилсяРесурсДолжностьПоШтатномуРасписанию"] = Истина Тогда
			ОтборСтрок.Позиция = СтрокаТаблицы.СтароеЗначениеДолжностьПоШтатномуРасписанию;
			НайденныеСтроки = МестаПозицийВСтруктуреПредприятия.НайтиСтроки(ОтборСтрок);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Подразделение = НайденныеСтроки[0].Подразделение;
				ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(ПодразделенияУтраченные, Подразделение);
				ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(ФизическиеЛицаУтраченные, СтрокаТаблицы.ФизическоеЛицо);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МодульСинхронизацияДанных.ЗарегистрироватьПринадлежностьФизическихЛиц(
		ПодразделенияНовые, ФизическиеЛицаНовые,
		МодульСинхронизацияДанных.МетаданныеРегистраСведенийПодразделенийФизическихЛиц(), "Подразделение");
	МодульСинхронизацияДанных.ЗарегистрироватьУтраченныхФизическихЛиц(
		ПодразделенияУтраченные, ФизическиеЛицаУтраченные,
		МодульСинхронизацияДанных.МетаданныеРегистраСведенийУтраченныхПодразделенийФизическихЛиц(), "Подразделение");
	
КонецПроцедуры

#Область ШаблоныПравилРегистрации

// Заменяет текст запроса регистрации изменений объекта для получения списка узлов-получателей по подразделениям
//
// Параметры:
//  ИмяПланаОбмена - Строка - Имя метаданных плана обмена
//  Отказ - Булево - флаг отказа от выполнения правил регистрации.
//      Отказ от выполнения правил означает, что объект и присоединенные файлы не будет зарегистрированы на узлах плана
//      обмена, для которого создано это правило.
//  ТекстЗапроса - Строка - текст запроса, который будет использован для определения узлов-получателей.
//  ПараметрыЗапроса - Структура - содержит значения свойств текущей версии объекта,
//      которые используются в качестве параметров в запросе для определения узлов-получателей.
//  ИспользоватьКэш - Булево - параметр определяет включение платформенного механизма повторно используемых значений
//      при определении узлов-получателей. Если передаваемые запросу значения в структуре ПараметрыЗапроса содержат
//      недопустимые типы данных для платформенного механизма кэширования, то флаг следует сбросить. Значение по
//      умолчанию - Истина.
//  Объект - СправочникОбъект
//  Подразделения - СправочникСсылка.СтруктураПредприятия, Массив из СправочникСсылка.СтруктураПредприятия -
//   ссылка или массив ссылок на подразделения, по которым нужно получить список узлов-получателей
Процедура ОграничитьРегистрациюОбъектаОтборомПоПодразделениям(ИмяПланаОбмена, Отказ, ТекстЗапроса, ПараметрыЗапроса,
	ИспользоватьКэш, Объект, Подразделения) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанных") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСинхронизацияДанных = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыСервер");
	Если Не МодульСинхронизацияДанных.ИспользуютсяУзлыРИБСОтборомПоПодразделениям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Подразделения) = Тип("Массив") Тогда
		ИспользоватьКэш = Ложь;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Подразделения", Подразделения);
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПланОбмена КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ПланОбменаПодразделения КАК ПланОбменаПодразделения
	|		ПО (ПланОбменаПодразделения.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
	|ГДЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка В(&СвойствоОбъекта_ПолучателиОбъекта)
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &ИмяПланаОбменаЭтотУзел
	|	И ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям
	|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
	|	И &УсловиеОтбораПоРеквизитуФлагу
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланОбменаОсновнаяТаблица.Ссылка
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(ВЫБОР
	|				КОГДА ПланОбменаПодразделения.Подразделение В (&СвойствоОбъекта_Подразделения)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) = ИСТИНА
	|		ИЛИ КОЛИЧЕСТВО(ПланОбменаПодразделения.Подразделение) = 0)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбменаПодразделения","ПланОбмена." + ИмяПланаОбмена + ".Подразделения");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбмена", "ПланОбмена." + ИмяПланаОбмена);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПланаОбменаЭтотУзел", "&" + ИмяПланаОбмена + "ЭтотУзел");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтбораПоРеквизитуФлагу", "[УсловиеОтбораПоРеквизитуФлагу]");
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТекстЗапроса", ТекстЗапроса);
	Параметры.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	РазделыДанных = МодульСинхронизацияДанных.РазделыДанныхОбъекта(Объект.Метаданные().ПолноеИмя());
	МодульСинхронизацияДанных.ДобавитьВЗапросОтборПоУзламОтобраннымПоРазделамДанных(ИмяПланаОбмена, Параметры,
		РазделыДанных);
		
	ТекстЗапроса = Параметры.ТекстЗапроса;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыЗапроса, Параметры.ПараметрыЗапроса, Истина);
	
КонецПроцедуры

// Заменяет текст запроса регистрации изменений объекта для получения списка узлов-получателей по подразделениям
//
// Параметры:
//  ИмяПланаОбмена - Строка - Имя метаданных плана обмена
//  Отказ - Булево - флаг отказа от выполнения правил регистрации.
//      Отказ от выполнения правил означает, что объект и присоединенные файлы не будет зарегистрированы на узлах плана
//      обмена, для которого создано это правило.
//  ТекстЗапроса - Строка - текст запроса, который будет использован для определения узлов-получателей.
//  ПараметрыЗапроса - Структура - содержит значения свойств текущей версии объекта,
//      которые используются в качестве параметров в запросе для определения узлов-получателей.
//  ИспользоватьКэш - Булево - параметр определяет включение платформенного механизма повторно используемых значений
//      при определении узлов-получателей. Если передаваемые запросу значения в структуре ПараметрыЗапроса содержат
//      недопустимые типы данных для платформенного механизма кэширования, то флаг следует сбросить. Значение по
//      умолчанию - Истина.
//  Объект - СправочникОбъект
//  Подразделения - СправочникСсылка.СтруктураПредприятия, Массив из СправочникСсылка.СтруктураПредприятия -
//   ссылка или массив ссылок на подразделения, по которым нужно получить список узлов-получателей
//  ЗаменитьТекстЗапроса - Булево - если Истина, то текст запроса полностью заменятся, если Ложь, то дополняется.
Процедура ДополнитьОграничениеРегистрацииОбъектаОтборомПоПодразделениям(ИмяПланаОбмена, Отказ, ТекстЗапроса,
	ПараметрыЗапроса, ИспользоватьКэш, Объект, Подразделения, ЗаменитьТекстЗапроса = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанных") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСинхронизацияДанных = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыСервер");
	Если Не МодульСинхронизацияДанных.ИспользуютсяУзлыРИБСОтборомПоПодразделениям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Подразделения) = Тип("Массив") Тогда
		ИспользоватьКэш = Ложь;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Подразделения", Подразделения);
	
	Если ЗаменитьТекстЗапроса Тогда
		ТекстЗапроса = "";
	ИначеЕсли Не ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПланОбмена КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ПланОбменаПодразделения КАК ПланОбменаПодразделения
	|		ПО (ПланОбменаПодразделения.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
	|ГДЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка В(&СвойствоОбъекта_ПолучателиОбъекта)
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &ИмяПланаОбменаЭтотУзел
	|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
	|	И &УсловиеОтбораПоРеквизитуФлагу
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланОбменаОсновнаяТаблица.Ссылка
	|
	|ИМЕЮЩИЕ
	|	(МАКСИМУМ(ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям)
	|			И МАКСИМУМ(ВЫБОР
	|					КОГДА ПланОбменаПодразделения.Подразделение В (&СвойствоОбъекта_Подразделения)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) = ИСТИНА
	|		ИЛИ КОЛИЧЕСТВО(ПланОбменаПодразделения.Подразделение) = 0)";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбменаПодразделения","ПланОбмена." + ИмяПланаОбмена + ".Подразделения");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбмена", "ПланОбмена." + ИмяПланаОбмена);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПланаОбменаЭтотУзел", "&" + ИмяПланаОбмена + "ЭтотУзел");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтбораПоРеквизитуФлагу", "[УсловиеОтбораПоРеквизитуФлагу]");
	
КонецПроцедуры

Процедура ДополнитьОграничениеРегистрацииОбъектаОтборомПоСотруднику(ИмяПланаОбмена, Отказ, ТекстЗапроса,
	ПараметрыЗапроса, ИспользоватьКэш, Объект, Сотрудник, ЗаменитьТекстЗапроса = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанных") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСинхронизацияДанных = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыСервер");
	Если Не МодульСинхронизацияДанных.ИспользуютсяУзлыРИБСОтборомПоПодразделениям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаменитьТекстЗапроса Тогда
		ТекстЗапроса = "";
	ИначеЕсли Не ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	КОЛИЧЕСТВО(ПодразделенияСотрудников.Подразделение) КАК КоличествоПодразделений
	|ПОМЕСТИТЬ ВТКоличествоПодразделенийСотрудника
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияСотрудников КАК ПодразделенияСотрудников
	|		ПО Сотрудники.Ссылка = ПодразделенияСотрудников.Сотрудник
	|ГДЕ
	|	Сотрудники.Ссылка = &СвойствоОбъекта_Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка
	|;
	|" + ТекстЗапроса +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПланОбмена КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ПланОбменаПодразделения КАК ПланОбменаПодразделения
	|		ПО (ПланОбменаПодразделения.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияСотрудников КАК ПодразделенияСотрудников
	|		ПО (ПланОбменаПодразделения.Подразделение = ПодразделенияСотрудников.Подразделение)
	|		И (ПодразделенияСотрудников.Сотрудник = &СвойствоОбъекта_Сотрудник)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоПодразделенийСотрудника КАК ВТКоличествоПодразделенийСотрудника
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка В(&СвойствоОбъекта_ПолучателиОбъекта)
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &ИмяПланаОбменаЭтотУзел
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &СвойствоОбъекта_Отправитель
	|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
	|	И &УсловиеОтбораПоРеквизитуФлагу
	|СГРУППИРОВАТЬ ПО
	|	ПланОбменаОсновнаяТаблица.Ссылка,
	|	ВТКоличествоПодразделенийСотрудника.КоличествоПодразделений,
	|	ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям
	|ИМЕЮЩИЕ
	|	ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям
	|	И (МАКСИМУМ(ВЫБОР
	|		КОГДА ПодразделенияСотрудников.Подразделение ЕСТЬ НЕ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) = ИСТИНА
	|	ИЛИ КОЛИЧЕСТВО(ПланОбменаПодразделения.Подразделение) = 0
	|	ИЛИ ВТКоличествоПодразделенийСотрудника.КоличествоПодразделений = 0
	|	И МИНИМУМ(ПланОбменаПодразделения.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбменаПодразделения","ПланОбмена." + ИмяПланаОбмена + ".Подразделения");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбмена", "ПланОбмена." + ИмяПланаОбмена);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПланаОбменаЭтотУзел", "&" + ИмяПланаОбмена + "ЭтотУзел");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтбораПоРеквизитуФлагу", "[УсловиеОтбораПоРеквизитуФлагу]");
	
КонецПроцедуры

// Заменяет текст запроса регистрации изменений физических лиц для получения списка узлов-получателей по Подразделениям,
// в которых установлены трудовые отношения по этим физическим лицам.
//
// Параметры:
//  ИмяПланаОбмена - Строка - Имя метаданных плана обмена.
//  Отказ - Булево - флаг отказа от выполнения правил регистрации.
//      Отказ от выполнения правил означает, что объект и присоединенные файлы не будет зарегистрированы на узлах плана
//      обмена, для которого создано это правило.
//  ТекстЗапроса - Строка - текст запроса, который будет использован для определения узлов-получателей.
//  ПараметрыЗапроса - Структура - содержит значения свойств текущей версии объекта,
//      которые используются в качестве параметров в запросе для определения узлов-получателей.
//  ИспользоватьКэш - Булево - параметр определяет включение платформенного механизма повторно используемых значений
//      при определении узлов-получателей. Если передаваемые запросу значения в структуре ПараметрыЗапроса содержат
//      недопустимые типы данных для платформенного механизма кэширования, то флаг следует сбросить. Значение по
//      умолчанию - Истина.
//  Выгрузка - (только чтение) - Булево - параметр определяет контекст выполнения правила регистрации.
//      Истина - правило регистрации выполняется в контексте выгрузки объекта.
//      Ложь - правило регистрации выполняется в контексте перед записью объекта.
//  ФизическиеЛица - Ссылка или массив ссылок физических лиц, по которым нужно получить список узлов-получателей.
//  ДополнительныеПараметрыПолученияСотрудников - Структура параметров, которые будут использоваться для получения
//                                                списка сотрудников физического лица.
//
Процедура ДополнитьОграничениеРегистрацииОбъектаОтборомПоФизическимЛицам(ИмяПланаОбмена, Отказ, ТекстЗапроса,
	ПараметрыЗапроса, ИспользоватьКэш, Объект, ФизическоеЛицо, ЗаменитьТекстЗапроса = Ложь) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанных") Тогда
		Возврат;
	КонецЕсли;
	
	МодульСинхронизацияДанных = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыСервер");
	Если Не МодульСинхронизацияДанных.ИспользуютсяУзлыРИБСОтборомПоПодразделениям() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаменитьТекстЗапроса Тогда
		ТекстЗапроса = "";
	ИначеЕсли Не ПустаяСтрока(ТекстЗапроса) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо,
	|	КОЛИЧЕСТВО(ПодразделенияФизическихЛиц.Подразделение) КАК КоличествоПодразделений
	|ПОМЕСТИТЬ ВТКоличествоПодразделенийФизЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияФизическихЛиц КАК ПодразделенияФизическихЛиц
	|		ПО ФизическиеЛица.Ссылка = ПодразделенияФизическихЛиц.ФизическоеЛицо
	|ГДЕ
	|	ФизическиеЛица.Ссылка = &СвойствоОбъекта_ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ФизическиеЛица.Ссылка
	|;
	|" + ТекстЗапроса + "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
	|ИЗ
	|	#ПланОбмена КАК ПланОбменаОсновнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ #ПланОбменаПодразделения КАК ПланОбменаПодразделения
	|		ПО (ПланОбменаПодразделения.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодразделенияФизическихЛиц КАК ПодразделенияФизическихЛиц
	|		ПО (ПланОбменаПодразделения.Подразделение = ПодразделенияФизическихЛиц.Подразделение)
	|			И (ПодразделенияФизическихЛиц.ФизическоеЛицо = &СвойствоОбъекта_ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоПодразделенийФизЛица КАК ВТКоличествоПодразделенийФизЛица
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ПланОбменаОсновнаяТаблица.Ссылка В(&СвойствоОбъекта_ПолучателиОбъекта)
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &ИмяПланаОбменаЭтотУзел
	|	И ПланОбменаОсновнаяТаблица.Ссылка <> &СвойствоОбъекта_Отправитель
	|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
	|	И &УсловиеОтбораПоРеквизитуФлагу
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланОбменаОсновнаяТаблица.Ссылка,
	|	ВТКоличествоПодразделенийФизЛица.КоличествоПодразделений,
	|	ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям
	|
	|ИМЕЮЩИЕ
	|	ПланОбменаОсновнаяТаблица.СинхронизироватьДанныеПоПодразделениям И
	|	(МАКСИМУМ(ВЫБОР
	|				КОГДА ПодразделенияФизическихЛиц.Подразделение ЕСТЬ НЕ NULL 
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) = ИСТИНА
	|		ИЛИ КОЛИЧЕСТВО(ПланОбменаПодразделения.Подразделение) = 0
	|		ИЛИ ВТКоличествоПодразделенийФизЛица.КоличествоПодразделений = 0
	|			И МИНИМУМ(ПланОбменаПодразделения.Подразделение) = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка))";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбменаПодразделения","ПланОбмена." + ИмяПланаОбмена + ".Подразделения");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПланОбмена", "ПланОбмена." + ИмяПланаОбмена);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПланаОбменаЭтотУзел", "&" + ИмяПланаОбмена + "ЭтотУзел");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &УсловиеОтбораПоРеквизитуФлагу", "[УсловиеОтбораПоРеквизитуФлагу]");
	
КонецПроцедуры

#Область ПереносДанныхИзПрежнихПрограмм

Процедура УточнениеПозицииШРСотрудниковПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Параметры, Отказ) Экспорт
	
	Если ОбъектНайден И ПараметрыОбъекта <> Неопределено Тогда
		
		Если Не Параметры.Свойство("НовыеПозицииСотрудников") Тогда
			Параметры.Вставить("НовыеПозицииСотрудников", Новый Соответствие);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Владелец", ПараметрыОбъекта["Организация"]);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПараметрыОбъекта["ПодразделениеОрганизации"]);
		Запрос.УстановитьПараметр("Должность", ПараметрыОбъекта["Должность"]);
		Запрос.УстановитьПараметр("Подразделение", ПараметрыОбъекта["Подразделение"]);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	""00010101"" КАК Период,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТПозиции
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Владелец = &Владелец
		|	И ШтатноеРасписание.Подразделение = &ПодразделениеОрганизации
		|	И ШтатноеРасписание.Должность = &Должность";
		
		Запрос.Выполнить();
		
		СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МестоПозиции.Позиция КАК Позиция,
		|	МестоПозиции.Подразделение КАК Подразделение
		|ИЗ
		|	ВТМестаПозицийВСтруктуреПредприятия КАК МестоПозиции
		|ГДЕ
		|	МестоПозиции.Подразделение = &Подразделение";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ОписаниеПозиции = Новый Структура("Позиция,Подразделение");
			ОписаниеПозиции.Позиция = Выборка.Позиция;
			ОписаниеПозиции.Подразделение = Выборка.Подразделение;
			
			Параметры.НовыеПозицииСотрудников.Вставить(Объект.Ссылка, ОписаниеПозиции);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура ЗаменитьПозицииСотрудниковПослеЗагрузки(Параметры) Экспорт
	
	Если Параметры.Свойство("НовыеПозицииСотрудников") Тогда
		
		ПозицииСотрудников = Параметры.НовыеПозицииСотрудников;
		СотрудникиДляОбработки = Новый Массив;
		Для каждого ЭлементКоллекции Из ПозицииСотрудников Цикл
			СотрудникиДляОбработки.Добавить(ЭлементКоллекции.Ключ);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

		Запрос.Текст =
		"ВЫБРАТЬ
		|	""00010101"" КАК Период
		|ПОМЕСТИТЬ ВТФильтрМестаПозиций";

		Запрос.Выполнить();
		
		ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрМестаПозиций");
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();

		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Запрос.МенеджерВременныхТаблиц, Истина, ОписаниеФильтра,
			ПараметрыПостроения, "ВТМестаПозицийВСтруктуреПредприятия");

		Запрос.Текст =
		"ВЫБРАТЬ
		|	КадроваяИсторияСотрудников.Сотрудник КАК Сотрудник,
		|	КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
		|	КадроваяИсторияСотрудников.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|ГДЕ
		|	КадроваяИсторияСотрудников.Сотрудник В(&Сотрудники)
		|	И КадроваяИсторияСотрудников.Регистратор ССЫЛКА Документ.НачальнаяШтатнаяРасстановка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МестаПозицийВСтруктуреПредприятия.Позиция КАК Позиция,
		|	МестаПозицийВСтруктуреПредприятия.Подразделение КАК Подразделение
		|ИЗ
		|	ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия";

		Запрос.УстановитьПараметр("Сотрудники", СотрудникиДляОбработки);

		Результат = Запрос.ВыполнитьПакет();
		
		Расстановка  = Результат[0].Выгрузить();
		МестаПозиций = Результат[1].Выгрузить();
		
		СоответствиеПозиций = Новый Соответствие;
		Для каждого СтрокаТЗ Из МестаПозиций Цикл
			СоответствиеПозиций.Вставить(СтрокаТЗ.Позиция, СтрокаТЗ.Подразделение);
		КонецЦикла;
		
		ДокументыКОбработке = Новый Соответствие;
		
		Для каждого СтрокаТЗ Из Расстановка Цикл
			
			ПозицияРасстановки = СтрокаТЗ.ДолжностьПоШтатномуРасписанию;
			Подразделение = СоответствиеПозиций[ПозицияРасстановки];
			
			ОписаниеПозиции = ПозицииСотрудников[СтрокаТЗ.Сотрудник];
			Если ОписаниеПозиции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОписаниеПозиции.Подразделение = Подразделение И ОписаниеПозиции.Позиция = ПозицияРасстановки Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСотрудников = ДокументыКОбработке[СтрокаТЗ.Регистратор];
			Если МассивСотрудников = Неопределено Тогда
				МассивСотрудников = Новый Массив;
				ДокументыКОбработке.Вставить(СтрокаТЗ.Регистратор, МассивСотрудников);
			КонецЕсли;
			МассивСотрудников.Добавить(СтрокаТЗ.Сотрудник);
			
		КонецЦикла;
		
		Для каждого ЭлементКоллекции Из ДокументыКОбработке Цикл
			
			ДокументОбъект = ЭлементКоллекции.Ключ.ПолучитьОбъект();
			Если ДокументОбъект.Проведен Тогда
				
				ТЧСотрудники = ДокументОбъект.Сотрудники;
				
				МассивСотрудников = ЭлементКоллекции.Значение;
				Для каждого Сотрудник Из МассивСотрудников Цикл
					
					СтрокаТЧ = ТЧСотрудники.Найти(Сотрудник, "Сотрудник");
					Если СтрокаТЧ <> Неопределено Тогда
						ОписаниеПозиции = ПозицииСотрудников[СтрокаТЧ.Сотрудник];
						СтрокаТЧ.ДолжностьПоШтатномуРасписанию = ОписаниеПозиции.Позиция;
					КонецЕсли;
					
				КонецЦикла;
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура МестоПозицииВСтруктуреПредприятияПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Отказ) Экспорт
	
	Если ОбъектНайден И ПараметрыОбъекта <> Неопределено И ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Владелец", ПараметрыОбъекта["Организация"]);
		Запрос.УстановитьПараметр("ПодразделениеОрганизации", ПараметрыОбъекта["ПодразделениеОрганизации"]);
		Запрос.УстановитьПараметр("Должность", ПараметрыОбъекта["Должность"]);
		Запрос.УстановитьПараметр("Подразделение", Объект.Ссылка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	""00010101"" КАК Период,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТПозиции
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Владелец = &Владелец
		|	И ШтатноеРасписание.Подразделение = &ПодразделениеОрганизации
		|	И ШтатноеРасписание.Должность = &Должность";
		
		Запрос.Выполнить();
		
		СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МестоПозиции.Позиция КАК Позиция,
		|	МестоПозиции.Подразделение КАК Подразделение
		|ИЗ
		|	ВТМестаПозицийВСтруктуреПредприятия КАК МестоПозиции
		|ГДЕ
		|	МестоПозиции.Подразделение = &Подразделение";

		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			
			// нет такой позиции и места в структуре, создадим новую
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ШтатноеРасписание.Позиция КАК Ссылка
			|ИЗ
			|	ВТПозиции КАК ШтатноеРасписание";

			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ПозицияОснование = Выборка.Ссылка;
				
				НоваяПозицияОбъект = Справочники.ШтатноеРасписание.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НоваяПозицияОбъект, ПозицияОснование.ПолучитьОбъект());
				НоваяПозицияОбъект.Записать();
				
				НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
				
				ТекущаяДата = ТекущаяДатаСеанса();
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ТекущаяДата;
				НоваяЗапись.Позиция = НоваяПозицияОбъект.Ссылка;
				НоваяЗапись.Подразделение = Объект.Ссылка;
				НаборЗаписей.Отбор.Позиция.Установить(НоваяПозицияОбъект.Ссылка);
				НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

Процедура ШтатноеРасписаниеМестоВСтруктуреПредприятия_ПоляПоиска(СвойстваПоиска, ПараметрыОбъекта, СсылкаНаОбъект, ПрекратитьПоиск, СтрокаИменСвойствПоиска) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыОбъекта) Или Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		СтрокаИменСвойствПоиска = "Владелец, Должность, Подразделение";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		СвойствоДолжность = СвойстваПоиска.Получить("Должность");
		Запрос.УстановитьПараметр("Должность", СвойствоДолжность);
		Запрос.УстановитьПараметр("ЕстьДолжность", ЗначениеЗаполнено(СвойствоДолжность));
		
		СвойствоПодразделение = СвойстваПоиска.Получить("Подразделение");
		Запрос.УстановитьПараметр("Подразделение", СвойствоПодразделение);
		Запрос.УстановитьПараметр("ЕстьПодразделение", ЗначениеЗаполнено(СвойствоПодразделение));
		
		СвойствоВладелец = СвойстваПоиска.Получить("Владелец");
		Запрос.УстановитьПараметр("Владелец", СвойствоВладелец);
		Запрос.УстановитьПараметр("ЕстьВладелец", ЗначениеЗаполнено(СвойствоВладелец));
		
		СвойствоМестоВСтруктуреПредприятия = ПараметрыОбъекта.Получить("МестоВСтруктуреПредприятия");
		Запрос.УстановитьПараметр("МестоВСтруктуреПредприятия", СвойствоМестоВСтруктуреПредприятия);
		Запрос.УстановитьПараметр("ЕстьМестоВСтруктуреПредприятия", ЗначениеЗаполнено(СвойствоМестоВСтруктуреПредприятия));
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	""00010101"" КАК Период
		|ПОМЕСТИТЬ ВТФильтрМестаПозиций";

		Запрос.Выполнить();
		
		ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТФильтрМестаПозиций");
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();

		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Запрос.МенеджерВременныхТаблиц, Истина, ОписаниеФильтра,
			ПараметрыПостроения, "ВТМестаПозицийВСтруктуреПредприятия");
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ШтатноеРасписание.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
		|		ПО ШтатноеРасписание.Ссылка = МестаПозицийВСтруктуреПредприятия.Позиция
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ЕстьДолжность
		|				ТОГДА ШтатноеРасписание.Должность = &Должность
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ЕстьПодразделение
		|				ТОГДА ШтатноеРасписание.Подразделение = &Подразделение
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ЕстьВладелец
		|				ТОГДА ШтатноеРасписание.Владелец = &Владелец
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ЕстьМестоВСтруктуреПредприятия
		|				ТОГДА МестаПозицийВСтруктуреПредприятия.Подразделение = &МестоВСтруктуреПредприятия
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаНаОбъект = Выборка.Ссылка;
		КонецЕсли;
		ПрекратитьПоиск = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ШтатноеРасписаниеМестоВСтруктуреПредприятияПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта) Экспорт
	
	Если ПараметрыОбъекта <> Неопределено Тогда
		МестоВСтруктуреПредприятия = ПараметрыОбъекта.Получить("МестоВСтруктуреПредприятия");
		Если ОбъектНайден Тогда
			СсылкаОбъекта = Объект.Ссылка;
		Иначе
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
			СсылкаОбъекта = МенеджерОбъекта.ПолучитьСсылку();
			Объект.УстановитьСсылкуНового(СсылкаОбъекта);
		КонецЕсли;
		ТекущаяДата = ТекущаяДатаСеанса();
		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДата;
		НоваяЗапись.Позиция = СсылкаОбъекта;
		НоваяЗапись.Подразделение = МестоВСтруктуреПредприятия;
		НаборЗаписей.Отбор.Позиция.Установить(СсылкаОбъекта);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДата);
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область КабинетСотрудника

Функция ТипСтруктураПредприятия() Экспорт
		
	Возврат Тип("СправочникСсылка.СтруктураПредприятия");

КонецФункции

#КонецОбласти

// Возвращает массив организация, связанных с подразделением.
//
// Параметры:
//	Подразделение - СправочникСсылка.СтруктураПредприятия
//	ДатаПолученияДанных - Дата - Дата на которую необходимо получить данные
//
// Возвращаемое значение:
//	Массив из СправочникСсылка.Организации - Массив ссылок на организации
//
Функция ОрганизацииПодразделения(Подразделение, ДатаПолученияДанных = '00010101') Экспорт

	Если Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат ВсеОрганизацииБезУправленческой();
	КонецЕсли;

	Если СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц() Тогда
		ПодразделениеВСтруктуреПредприятия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Источник");
		Если ТипЗнч(ПодразделениеВСтруктуреПредприятия) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			ПодразделениеВСтруктуреПредприятия = 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПодразделениеВСтруктуреПредприятия, "Владелец");
		КонецЕсли;

		Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПодразделениеВСтруктуреПредприятия);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Период КАК Период,
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ВТСтруктураПредприятияОтбор
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ (&Подразделение)";

	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Период", ДатаПолученияДанных);

	Запрос.Выполнить();

	СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТСтруктураПредприятияОтбор");

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШтатноеРасписание.Владелец КАК Организация
	|ИЗ
	|	ВТПозицииПодразделений КАК Позиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ПО Позиции.Позиция = ШтатноеРасписание.Ссылка
	|ГДЕ
	|	ШтатноеРасписание.Утверждена
	|	И НЕ ШтатноеРасписание.Закрыта";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");

КонецФункции

// Возвращает таблицу значений, заполненную сотрудниками.
//
// Параметры:
//	Подразделение - СправочникСсылка.СтруктураПредприятия
//	НачалоПериода - Дата - начало периода
//	ОкончаниеПериода - Дата - конец периода
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица значений - см. КадровыйУчет.СотрудникиОрганизации.
//   					
Функция СотрудникиПодразделения(Подразделение, НачалоПериода, ОкончаниеПериода) Экспорт
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.НачалоПериода = НачалоПериода;
	ПараметрыПолученияСотрудников.ОкончаниеПериода = ОкончаниеПериода;
	ПараметрыПолученияСотрудников.КадровыеДанные = "ДолжностьПоШтатномуРасписанию,МестоВСтруктуреПредприятия";
	ПараметрыПолученияСотрудников.ПодработкиРаботниковПоТрудовымДоговорам = Истина;
	ПараметрыПолученияСотрудников.РаботникиПоДоговорамГПХ = Истина;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПодчиненныеПодразделения = ПодчиненныеПодразделения(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение));
		ПозицииПодразделения = ПозицииПодразделений(ПодчиненныеПодразделения, ОкончаниеПериода).ВыгрузитьКолонку("Позиция");
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			ПараметрыПолученияСотрудников.Отборы, "ДолжностьПоШтатномуРасписанию", "В", ПозицииПодразделения);
	КонецЕсли;
	
	Возврат КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
	
КонецФункции

Функция ВсеОрганизацииБезУправленческой(УправленческаяОрганизация = Неопределено, УчитыватьПомеченныеНаУдаление = Истина) Экспорт
	
	Если УправленческаяОрганизация = Неопределено Тогда 
		УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УправленческаяОрганизация", УправленческаяОрганизация);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка <> &УправленческаяОрганизация
		|	И НЕ Организации.ПометкаУдаления";
	
	Если УчитыватьПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕ Организации.ПометкаУдаления", "ИСТИНА")
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Определяет, требуется ли условное оформление структуры предприятия.
//
// Возвращаемое значение:
//   Булево - необходимость условного оформления структуры предприятия
Функция ТребуетсяУсловноеОформлениеСтруктурыПредприятия() Экспорт
	
	Если Не ПодсистемаСостоянияСтруктурыПредприятияСуществует() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТребуетсяОформление = Истина;
	
	ОрганизационнаяСтруктураПереопределяемый.ПриОпределенииНеобходимостиУсловногоОформленияСтруктурыПредприятия(ТребуетсяОформление);
	
	Возврат ТребуетсяОформление;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СостояниеСтруктурыПредприятия

Функция МодульСостоянияСтруктурыПредприятия()

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СостояниеСтруктурыПредприятия") Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("СостояниеСтруктурыПредприятия");
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция ТекстЗапросаСпискаСтруктурыПредприятияДляШтатногоРасписания()

	Возврат ТекстЗапросаСпискаСтруктурыПредприятия(Ложь, Истина);

КонецФункции

Функция ТекстЗапросаСпискаСтруктурыПредприятияДляСпискаСотрудников()

	Возврат ТекстЗапросаСпискаСтруктурыПредприятия(Истина, Ложь);

КонецФункции

Функция ТекстЗапросаСпискаСтруктурыПредприятия(ВключатьВычисляемыеПоляСостояния, ВключатьУсловиеПодчиненности)

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Ссылка,
		|	СтруктураПредприятия.ВерсияДанных КАК ВерсияДанных,
		|	СтруктураПредприятия.ПометкаУдаления КАК ПометкаУдаления,
		|	СтруктураПредприятия.Родитель КАК Родитель,
		|	СтруктураПредприятия.Код КАК Код,
		|	СтруктураПредприятия.Наименование КАК Наименование,
		|	СтруктураПредприятия.Источник КАК Источник,
		|	СтруктураПредприятия.СоответствуетСтруктуреЮридическихЛиц КАК СоответствуетСтруктуреЮридическихЛиц,
		|	СтруктураПредприятия.Предопределенный КАК Предопределенный,
		|	СтруктураПредприятия.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия";

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния <> Неопределено Тогда
		МодульСостояния.УточнитьЗапросСпискаСтруктурыПредприятия(ТекстЗапроса, ВключатьВычисляемыеПоляСостояния);
	КонецЕсли;

	Если ВключатьУсловиеПодчиненности Тогда
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + ТекстОтбораСпискаСтруктурыПредприятияПоПодчиненности();
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстОтбораСпискаСтруктурыПредприятияПоПодчиненности()

	Возврат
		"{ГДЕ
		|	(СтруктураПредприятия.Ссылка В
		|		(ВЫБРАТЬ
		|			ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница
		|		ИЗ
		|			РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|		ГДЕ
		|			ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница В (&СтруктурнаяЕдиница)))}";

КонецФункции

Функция ЗапросПредставленияСтруктураПредприятия(ТолькоРазрешенные, ИмяВТПредставления = "Представления_СтруктураПредприятия",
	ИмяВТМестоПозиции = "ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия")

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	СтруктураПредприятия.Ссылка КАК Подразделение,
		|	ШтатноеРасписание.Ссылка КАК Позиция,
		|	ШтатноеРасписание.Должность.РеквизитДопУпорядочивания КАК ПорядокДолжности
		|ПОМЕСТИТЬ Представления_СтруктураПредприятия
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|			КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|			ПО МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция = ШтатноеРасписание.Ссылка
		|				И (НЕ ШтатноеРасписание.ПометкаУдаления)
		|				И (НЕ ВЫБОР
		|						КОГДА ШтатноеРасписание.Закрыта
		|							ТОГДА ШтатноеРасписание.ДатаЗакрытия <= &ДатаАктуальности
		|						ИНАЧЕ ЛОЖЬ
		|					КОНЕЦ)
		|				И (НЕ &ЮридическаяСтруктура)
		|				И ШтатноеРасписание.ДатаУтверждения <= &ДатаАктуальности
		|		ПО СтруктураПредприятия.Ссылка = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение
		|ГДЕ
		|	НЕ СтруктураПредприятия.ПометкаУдаления
		|	И НЕ &ЮридическаяСтруктура";

	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьИмяСоздаваемойВременнойТаблицы(Запрос.Текст, "Представления_СтруктураПредприятия", ИмяВТПредставления);
	Если ИмяВТМестоПозиции <> "ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ИмяВТМестоПозиции);
	КонецЕсли;
	ЗарплатаКадрыОбщиеНаборыДанных.УстановитьВыборкуТолькоРазрешенныхДанных(Запрос.Текст, ТолькоРазрешенные);

	Возврат Запрос;

КонецФункции

Процедура УстановитьПараметрЗапросаПоПредставлению(Запрос, ПараметрыЗапросаКомпоновки, ИмяПараметра, ЗначениеПоУмолчанию)
	
	ПредставлениеЗначенияПараметра = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса(ИмяПараметра, ПараметрыЗапросаКомпоновки);
	Если ПредставлениеЗначенияПараметра = Неопределено Тогда
		Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПоУмолчанию);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&" + ИмяПараметра, ПредставлениеЗначенияПараметра);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтатноеРасписание

Функция ЗапросОбновленияМестаПозицийШтатногоРасписанияПоДвижениямИзмененияМеста()

	Запрос = Неопределено;

	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ОрганизационнаяСтруктура.МестаПозицийШтатногоРасписанияВСтруктуреПредприятия") Тогда

		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия  = ОбщегоНазначения.ОбщийМодуль(
			"МестаПозицийШтатногоРасписанияВСтруктуреПредприятия");
		Запрос = МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ЗапросОбновленияМестаПозицийШтатногоРасписанияПоДвижениямИзмененияМеста();

	КонецЕсли;

	Если Запрос = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИсторияИспользованияШтатногоРасписания.Дата КАК Период,
		|	ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания КАК Позиция,
		|	ИсторияИспользованияШтатногоРасписания.МестоВСтруктуреПредприятия КАК Подразделение,
		|	ИсторияИспользованияШтатногоРасписания.Регистратор КАК Основание
		|ИЗ
		|	РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиция,
		|	Период";
	КонецЕсли;

	Возврат Запрос;

КонецФункции

Функция ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия()
	
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ОтображатьУправленческуюОрганизациюВШтатномРасписании()
	Возврат ОрганизационнаяСтруктураПовтИсп.ОтображатьУправленческуюОрганизациюВШтатномРасписании();	
КонецФункции

Функция РедактированиеПоляМестоВСтруктуреПредприятияЗапрещено(Форма)

	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ОрганизационнаяСтруктура.МестаПозицийШтатногоРасписанияВСтруктуреПредприятия") Тогда

		МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия  = ОбщегоНазначения.ОбщийМодуль(
			"МестаПозицийШтатногоРасписанияВСтруктуреПредприятия");
		Если МодульМестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Тогда
			Возврат ?(Форма.ВнешниеДанные, Форма.СуществующаяПозиция, ЗначениеЗаполнено(Форма.Объект.Ссылка));
		КонецЕсли;

	КонецЕсли;
	
	Возврат Форма.ИспользоватьИсторию И Не Форма.ВнешниеДанные;

КонецФункции

Процедура ДобавитьПанельОтбораШтатногоРасписанияПоСтруктуреПредприятия(Форма, Отказ, СтандартнаяОбработка)
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Список = Форма.СтруктураПредприятияСписок;
	Список.ОсновнаяТаблица = "Справочник.СтруктураПредприятия";
	
	Для каждого ЭлементОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Источник") Тогда
			ЭлементОтбора.Использование = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Элементы = Форма.Элементы;
	ГруппаСтруктураПредприятия = Элементы.ГруппаСтруктураПредприятия;
	
	Если Элементы.Найти("СтруктураПредприятияСписок") = Неопределено Тогда
		ПолеСтруктураПредприятияСписок = Элементы.Добавить("СтруктураПредприятияСписок", Тип("ТаблицаФормы"), ГруппаСтруктураПредприятия);
		ПолеСтруктураПредприятияСписок.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ПолеСтруктураПредприятияСписок.Отображение = ОтображениеТаблицы.Дерево;
		ПолеСтруктураПредприятияСписок.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
		ПолеСтруктураПредприятияСписок.ПутьКДанным = "СтруктураПредприятияСписок";
		ПолеСтруктураПредприятияСписок.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_СтруктураПредприятияСписокПриАктивизацииСтроки");
	КонецЕсли;
	
	Если Элементы.Найти("СтруктураПредприятияСписокПодразделение") = Неопределено Тогда
		ПолеПодразделение = Элементы.Добавить("СтруктураПредприятияСписокПодразделение", Тип("ПолеФормы"), ПолеСтруктураПредприятияСписок);
		ПолеПодразделение.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеПодразделение.Заголовок = НСтр("ru = 'Подразделение'");
		ПолеПодразделение.ПутьКДанным = "СтруктураПредприятияСписок.Ссылка";
	КонецЕсли;
	
	Если ТребуетсяУсловноеОформлениеСтруктурыПредприятия() Тогда
		УправлениеШтатнымРасписаниемФормы.УстановитьУсловноеОформлениеСпискаПодразделений(
			Форма, "СтруктураПредприятияСписок",,, "Ссылка");
	КонецЕсли;
	
	
	ИмяКоманды = "ВидСтруктураПредприятия";
	ВидСпискаГруппа = Элементы.ВидСписка;
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Структура предприятия'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ВидСпискаГруппа);
		Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандуСозданияУправленческойПозицииВСпискеШтатногоРасписания(Форма, Отказ, СтандартнаяОбработка)
	
	Если Не ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда 
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	
	ИмяКоманды = "СоздатьУправленческуюПозицию";
	СоздатьСкопироватьГруппа = Элементы.СоздатьСкопироватьГруппа;
	
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Создать'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), СоздатьСкопироватьГруппа);
		Элемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьМестоВСтруктуреПредприятияВФормуСпискаШтатногоРасписания(Форма, ИмяОсновнойТаблицы, ИмяРеквизитаСписок = "Список")
	
	ОтборМестоВСтруктуреПредприятия = Неопределено;
	Если Форма.Параметры.Отбор.Свойство("МестоВСтруктуреПредприятия", ОтборМестоВСтруктуреПредприятия) Тогда
		Форма.Параметры.Отбор.Удалить("МестоВСтруктуреПредприятия")
	КонецЕсли;
	
	ОтображатьМестоВСтруктуреПредприятия = ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия();
	УстановленОтборПоМестуВСтруктуреПредприятия = ЗначениеЗаполнено(ОтборМестоВСтруктуреПредприятия);
	
	Если Не ОтображатьМестоВСтруктуреПредприятия И Не УстановленОтборПоМестуВСтруктуреПредприятия Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВидСтруктураПредприятия",
		"Видимость",
		Не УстановленОтборПоМестуВСтруктуреПредприятия);
	
	Список = Форма[ИмяРеквизитаСписок];
	
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, """МестоВСтруктуреПредприятия"" КАК МестоВСтруктуреПредприятия", "МестоВСтруктуреПредприятия.Подразделение КАК МестоВСтруктуреПредприятия");
	Список.ТекстЗапроса = Список.ТекстЗапроса + "
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК МестоВСтруктуреПредприятия
	|	ПО " + ИмяОсновнойТаблицы + ".Ссылка = МестоВСтруктуреПредприятия.Позиция";
	
	Элементы = Форма.Элементы;
	ГруппаМестоВСтруктуреПредприятия = Элементы.ГруппаМестоВСтруктуреПредприятия;
	
	Если Элементы.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда
		Поле = Элементы.Добавить("МестоВСтруктуреПредприятия", Тип("ПолеФормы"), ГруппаМестоВСтруктуреПредприятия);
		Поле.Заголовок = НСтр("ru = 'В структуре предприятия'");
		Поле.Вид = ВидПоляФормы.ПолеНадписи;
		Поле.Ширина = 12;
		Поле.ПутьКДанным = ИмяРеквизитаСписок + ".МестоВСтруктуреПредприятия";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		"МестоВСтруктуреПредприятия", 
		"Видимость", 
		ОтображатьМестоВСтруктуреПредприятия);
	
	Если УстановленОтборПоМестуВСтруктуреПредприятия Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "МестоВСтруктуреПредприятия", ОтборМестоВСтруктуреПредприятия, ВидСравненияКомпоновкиДанных.ВИерархии);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьМестоВСтруктуреПредприятия(Форма, ПозицияСсылка)
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(Форма,
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПозицияСсылка);
	
КонецПроцедуры

Процедура УстановитьСвойстваЭлементовМестаВСтруктуреПредприятия(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"МестоВСтруктуреПредприятия",
		"ТолькоПросмотр",
		Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"МестоВСтруктуреПредприятияПериод",
		"ТолькоПросмотр",
		Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"МестоВСтруктуреПредприятияИсторияИзменения",
		"Доступность",
		ЗначениеЗаполнено(Объект.Ссылка));
	
КонецПроцедуры

#КонецОбласти

Процедура УправленческаяПозицияПриСозданииНаСервере(Форма, Параметры, СозданиеНовой) Экспорт 
	
	Если Не Параметры.Свойство("УправленческаяПозиция") Тогда 
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	
	Если СозданиеНовой Тогда 
		Объект.Владелец = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	КонецЕсли;
	
КонецПроцедуры

Функция ПоляОтбораПозиций(ИменаПолейВременнойТаблицыОтборовСотрудников = "Позиция,Период") Экспорт
	
	МассивИменПолейОтбора = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(
		ИменаПолейВременнойТаблицыОтборовСотрудников, ",", , Истина);
	Возврат Новый Структура("Позиция,Период", МассивИменПолейОтбора[0], МассивИменПолейОтбора[1]);
	
КонецФункции

Функция ПараметрыПостроенияВТМестоПозицииВСтруктуреПредприятия(ИмяВременнойТаблицыОтборов,
	ИменаПолейВременнойТаблицыОтборов = "Позиция,Период") Экспорт
	
	ПараметрыПостроения = Новый Структура;
	
	ПараметрыПостроения.Вставить("ИмяВременнойТаблицыОтборов", ИмяВременнойТаблицыОтборов);
	ПараметрыПостроения.Вставить("ПоляОтбораПозиций", ПоляОтбораПозиций(ИменаПолейВременнойТаблицыОтборов));
	ПараметрыПостроения.Вставить("СоответствиеПсевдонимовПолей", Новый Соответствие);
	ПараметрыПостроения.Вставить("ИмяВТМестоПозицииВСтруктуреПредприятия", "ВТМестоПозицииВСтруктуреПредприятия");
	ПараметрыПостроения.Вставить("ТолькоРазрешенные", Истина);
	
	Возврат ПараметрыПостроения;
	
КонецФункции

Функция ЗапросВТМестоПозицииВСтруктуреПредприятия(ПараметрыПостроения) Экспорт

	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ПараметрыПостроения.ИмяВременнойТаблицыОтборов, "Позиция");

	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период",
		ПараметрыПостроения.ПоляОтбораПозиций.Период);
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Позиция",
		ПараметрыПостроения.ПоляОтбораПозиций.Позиция);

	ПараметрыПостроенияВТСрез = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроенияВТСрез.СоответствиеПсевдонимовПолей = ПараметрыПостроения.СоответствиеПсевдонимовПолей;

	ЗапросВТИмяРегистраСрез = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПараметрыПостроения.ТолькоРазрешенные, ОписаниеФильтра,
		ПараметрыПостроенияВТСрез, Истина, ПараметрыПостроения.ИмяВТМестоПозицииВСтруктуреПредприятия);

	Возврат ЗапросВТИмяРегистраСрез

КонецФункции

Функция ДобавитьПолеСведенийОМестеВСтруктуреПредприятия(Знач ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт 
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСведенияОМестеВСтруктуреПредприятия(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		ИсточникиДанных.Вставить("СведенияОМестеВСтруктуреПредприятия", Истина);
		
		КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "БазовыеКадровыеДанныеСотрудников", "ДолжностьПоШтатномуРасписанию");
		
		ПутьКДанным = ПутьКДаннымСведенийОМестеВСтруктуреПредприятия(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция НеобходимыСведенияОМестеВСтруктуреПредприятия(Знач ИмяПоля)
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("МестоВСтруктуреПредприятия");
		
КонецФункции

Функция ПутьКДаннымСведенийОМестеВСтруктуреПредприятия(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("МестоВСтруктуреПредприятия") Тогда
		ПутьКДанным = "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

Процедура ДобавитьТекстЗапросаСведенияОМестеВСтруктуреПредприятия(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ИсточникиДанных) Экспорт 
	
	Если ИсточникиДанных.Получить("СведенияОМестеВСтруктуреПредприятия") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ИмяВТСведенияКадровойИсторииСотрудников = ИсточникиДанных.Получить("ИмяВТСведенияКадровойИсторииСотрудников");
	Если ИмяВТСведенияКадровойИсторииСотрудников = Неопределено Тогда
		ИмяВТСведенияКадровойИсторииСотрудников = "ВТКадроваяИсторияСотрудников";
	КонецЕсли;

	ПараметрыПостроения = ПараметрыПостроенияВТМестоПозицииВСтруктуреПредприятия(
		ИмяВТСведенияКадровойИсторииСотрудников, "ДолжностьПоШтатномуРасписанию, Период");
	ПараметрыПостроения.ТолькоРазрешенные = ТолькоРазрешенные;

	ЗапросВТ = ЗапросВТМестоПозицииВСтруктуреПредприятия(ПараметрыПостроения);

	ЗарплатаКадрыОбщиеНаборыДанных.СкопироватьПараметрыЗапроса(Запрос, ЗапросВТ);
	
	ЧастиИсходногоЗапроса = СтрРазделить(Запрос.Текст, ";");
	ЧастиИсходногоЗапроса.Вставить(ЧастиИсходногоЗапроса.Количество() - 1, ЗапросВТ.Текст);
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(СтрСоединить(ЧастиИсходногоЗапроса, ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов()));
	
	ЧастиЗапроса.Добавить(
	"		{ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО КадроваяИсторияСотрудников.ДолжностьПоШтатномуРасписанию = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
	|			И КадроваяИсторияСотрудников.Период  = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период}");
	
	Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);

	КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "ВТКУничтожению",
		"ВТМестоПозицииВСтруктуреПредприятия");

КонецПроцедуры

Процедура СкрытьУправленческуюОрганизациюИзДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт 
	
	Если ПоказыватьУправленческуюОрганизацию(Параметры) Или Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	Если УправленческаяОрганизация = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Если Не Параметры.Отбор.Свойство("Ссылка") Тогда
		Параметры.Отбор.Вставить("Ссылка", ВсеОрганизацииБезУправленческой(УправленческаяОрганизация));
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Параметры.Отбор["Ссылка"]) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(Параметры.Отбор["Ссылка"], УправленческаяОрганизация);
	Иначе
		Если Параметры.Отбор["Ссылка"] = УправленческаяОрганизация Тогда
			Параметры.Отбор.Вставить("Ссылка", Новый Массив);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьУправленческуюОрганизацию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	УправленческаяОрганизация = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	Если УправленческаяОрганизация <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = Справочники.Организации.СоздатьЭлемент();
	
	УправленческаяОрганизация.Наименование = НСтр("ru = 'Управленческая организация'");
	УправленческаяОрганизация.НаименованиеПолное = НСтр("ru = 'Управленческая организация'");
	УправленческаяОрганизация.НаименованиеСокращенное = НСтр("ru = 'Управленческая организация'");
	
	УправленческаяОрганизация.ВидОбменаСКонтролирующимиОрганами = Перечисления.ВидыОбменаСКонтролирующимиОрганами.ОбменОтключен;
	УправленческаяОрганизация.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	
	УправленческаяОрганизация.ИмяПредопределенныхДанных = "УправленческаяОрганизация";
	
	УправленческаяОрганизация.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ПриУстановкеИспользованияУправленческойЗарплаты(ИспользоватьУправленческуюЗарплату) Экспорт
	
	Если ИспользоватьУправленческуюЗарплату = Истина Тогда
		СоздатьУправленческуюОрганизацию();
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлементФормыПользовательскийОтборПоОрганизации(ПодчиненныеЭлементыНастроек, ИмяПоляОрганизация)
	
	Для Каждого ЭлементПодчиненныхЭлементовНастроек Из ПодчиненныеЭлементыНастроек.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементПодчиненныхЭлементовНастроек) = Тип("ГруппаФормы") И ЭлементПодчиненныхЭлементовНастроек.Заголовок = ИмяПоляОрганизация Тогда
			Для Каждого ЭлементГруппыОрганизация Из ЭлементПодчиненныхЭлементовНастроек.ПодчиненныеЭлементы Цикл
				Если ЭлементГруппыОрганизация.Имя = ЭлементПодчиненныхЭлементовНастроек.Имя + "Значение" Тогда
					Возврат ЭлементГруппыОрганизация;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ТипЗнч(ЭлементПодчиненныхЭлементовНастроек) = Тип("ГруппаФормы") Тогда
			ЭлементГруппыОрганизация = ЭлементФормыПользовательскийОтборПоОрганизации(ЭлементПодчиненныхЭлементовНастроек, ИмяПоляОрганизация);
			Если ЭлементГруппыОрганизация <> Неопределено Тогда
				Возврат ЭлементГруппыОрганизация;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИспользуетсяОбменУправлениеПредприятием2() Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользуетсяОбменУправлениеПредприятием2 = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбменДаннымиУниверсальныйФормат") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиУниверсальныйФормат");
		ИспользуетсяОбменУправлениеПредприятием2 = Модуль.ИспользуетсяОбменУправлениеПредприятием2();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ИспользуетсяОбменУправлениеПредприятием2;
	
КонецФункции

Процедура ОбновитьНастройкиСтруктурыПредприятияПриИспользованииОбменаУП2(ОбменНастроен) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбменДаннымиУниверсальныйФормат") Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	УстановитьИспользованиеСтруктурыПредприятия(Не ОбменНастроен);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ЗапросВТПозицииПодразделений(ИмяФильтра)

	ВТКУничтожению = Новый Массив;
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		ИмяФильтра);
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	Запрос = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Истина, ОписаниеФильтра, ПараметрыПостроения, Истина,
		"ВТМестаПозицийВСтруктуреПредприятия");

	ВТКУничтожению.Добавить("ВТМестаПозицийВСтруктуреПредприятия");

	ТекстЗапросаВТПозицииПодразделений =
	"ВЫБРАТЬ
	|	МестаПозицийВСтруктуреПредприятия.Период КАК Период,
	|	МестаПозицийВСтруктуреПредприятия.Подразделение КАК Подразделение,
	|	МестаПозицийВСтруктуреПредприятия.Позиция КАК Позиция
	|ПОМЕСТИТЬ ВТПозицииПодразделений
	|ИЗ
	|	ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ #ВТПодразделения КАК ВТПодразделения
	|		ПО МестаПозицийВСтруктуреПредприятия.Подразделение = ВТПодразделения.Подразделение
	|			И МестаПозицийВСтруктуреПредприятия.Период = ВТПодразделения.Период
	|ГДЕ
	|	НЕ МестаПозицийВСтруктуреПредприятия.Позиция.ГруппаПозицийПодразделения";
	
	ТекстЗапросаВТПозицииПодразделений = СтрЗаменить(ТекстЗапросаВТПозицииПодразделений, "#ВТПодразделения", ИмяФильтра);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ОбъединитьТекстыЗапросов(Запрос.Текст, ТекстЗапросаВТПозицииПодразделений);
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьЗапросыУничтоженияВременныхТаблиц(Запрос.Текст, ВТКУничтожению);
	
	Возврат Запрос;
	
КонецФункции

#Область ОбработчикиОбновленияИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//
// Параметры:
//  Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "ОрганизационнаяСтруктура.УстановитьРежимСоответствияСтруктурыПредприятияСтруктуреЮридическихЛиц";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.НеВыполнятьПриПереходеСДругойПрограммы = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.8.10";
	Обработчик.Процедура = "РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.УдалитьЛишниеЗаписиДляГруппыПозицийПодразделения";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2b642695-21cb-4180-a939-24f4a232c5b3");
	Обработчик.Комментарий = НСтр("ru = 'Удаление лишних записей мест позиций в структуре предприятия, ошибочно созданных для групп позиций.'");	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.15.65";
	Обработчик.Процедура = "ОрганизационнаяСтруктура.ЗаполнитьКодИсточникаВСтруктуреПредприятия";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("02fe3f12-0101-4f64-9996-539d5e56de9f");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение служебного реквизита «Код источника» элементов структуры предприятия.'");	
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.29.2";
	Обработчик.Процедура = "ОрганизационнаяСтруктура.ДобавитьРольИзменениеМестаСотрудникаВСтруктуреПредприятияВПользовательскиеПрофили";
	Обработчик.РежимВыполнения = "Оперативно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.35.69";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Процедура = "ОрганизационнаяСтруктура.ОбновитьСтруктуруПредприятия";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("989c8519-3c38-4ff1-85fc-f7c0c486f9a7");
	Обработчик.Комментарий = НСтр("ru = 'Обновление элементов справочника «Структура предприятия» в режиме соответствия структур.'");	

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.34";
	Обработчик.Процедура = "ОрганизационнаяСтруктура.ЗаполнитьМестаВСтруктуреПредприятияДокументовШтатногоРасписания";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("0fd6d3b0-7726-4e03-a412-124a7f2969f1");
	Обработчик.Комментарий = НСтр(
		"ru = 'Заполнение мест в структуре предприятия движений документов штатного расписания.'");

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.51";
	Обработчик.Процедура = "ОрганизационнаяСтруктура.ЗаполнитьМестаПозицииШтатногоРасписанияВСтруктуреПредприятия";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ee1e01fd-300f-41bd-add8-374d5dce377c");
	Обработчик.Комментарий = НСтр(
		"ru = 'Заполнение мест позиций в структуре предприятия по данным движений истории изменения.'");

КонецПроцедуры

Процедура УстановитьРежимСоответствияСтруктурыПредприятияСтруктуреЮридическихЛиц() Экспорт
	
	Соответствует = Истина;
	ЗарплатаКадрыРасширенныйПереопределяемый.ПриУстановкеСоответствияСтруктурыПредприятияСтруктуреЮридическихЛиц(Соответствует);
	
	УстановитьИспользованиеСтруктурыПредприятия(Соответствует);

КонецПроцедуры

Процедура ЗаполнитьКодИсточникаВСтруктуреПредприятия(ПараметрыОбновления) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка,
		|	ПодразделенияОрганизаций.Код
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|		ПО ПодразделенияОрганизаций.Ссылка = СтруктураПредприятия.Источник
		|		И ПодразделенияОрганизаций.Код <> СтруктураПредприятия.КодИсточника";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ОписаниеБлокировки = ОбновлениеИБ.ОписаниеБлокируемыхДанных(Метаданные.Справочники.СтруктураПредприятия);
	
	ВыборкаОбновляемыхДанных = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаОбновляемыхДанных.Следующий() Цикл
		ОписаниеБлокировки.ПоляБлокировки.Ссылка = ВыборкаОбновляемыхДанных.Ссылка;
		Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеБлокировки, ПараметрыОбновления) Тогда
			Возврат;
		КонецЕсли;
		Подразделение = ВыборкаОбновляемыхДанных.Ссылка.ПолучитьОбъект();
		Подразделение.КодИсточника = ВыборкаОбновляемыхДанных.Код;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Подразделение);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСтруктуруПредприятия(ПараметрыОбновления = Неопределено) Экспорт
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	ОрганизационнаяСтруктураСобытия.ОбновитьСтруктуруПредприятия(Ложь);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
КонецПроцедуры

// Добавляет роль изменения мест сотрудников в структуре предприятия в непоставляемые (пользовательские) профили групп доступа.
//
// Параметры:
//   ПараметрыОбновления - Структура - Параметры отложенного обновления.
//
Процедура ДобавитьРольИзменениеМестаСотрудникаВСтруктуреПредприятияВПользовательскиеПрофили() Экспорт
	
	ЗаменяемыеРоли = Новый Соответствие;
	
	НовыеРоли = Новый Массив;
	НовыеРоли.Добавить(Метаданные.Роли.ДобавлениеИзменениеОрганизационнойСтруктуры.Имя);
	НовыеРоли.Добавить(Метаданные.Роли.ИзменениеМестаСотрудникаВСтруктуреПредприятия.Имя);
	ЗаменяемыеРоли.Вставить("ДобавлениеИзменениеОрганизационнойСтруктуры", НовыеРоли);
	
	УправлениеДоступом.ЗаменитьРолиВПрофилях(ЗаменяемыеРоли);
	
КонецПроцедуры

Процедура ЗаполнитьМестаВСтруктуреПредприятияДокументовШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт

	ИспользоватьИсториюИзмененияШтатногоРасписания = ПолучитьФункциональнуюОпцию(
		"ИспользоватьИсториюИзмененияШтатногоРасписания");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияИспользованияШтатногоРасписания.Дата КАК Дата,
	|	ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	|	Позиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ИсторияИспользованияШтатногоРасписания.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеШтатногоРасписания.Позиции КАК Позиции
	|		ПО ИсторияИспользованияШтатногоРасписания.Регистратор = Позиции.Ссылка
	|		И ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания = Позиции.Позиция
	|		И Позиции.МестоВСтруктуреПредприятия <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		И ТИПЗНАЧЕНИЯ(Позиции.МестоВСтруктуреПредприятия) = ТИП(Справочник.СтруктураПредприятия)
	|ГДЕ
	|	ИсторияИспользованияШтатногоРасписания.МестоВСтруктуреПредприятия = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсторияИспользованияШтатногоРасписания.Дата,
	|	ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания,
	|	Позиции.МестоВСтруктуреПредприятия,
	|	ИсторияИспользованияШтатногоРасписания.Регистратор
	|ИЗ
	|	РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УтверждениеШтатногоРасписания.Позиции КАК Позиции
	|		ПО ИсторияИспользованияШтатногоРасписания.Регистратор = Позиции.Ссылка
	|		И ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания = Позиции.Позиция
	|		И Позиции.МестоВСтруктуреПредприятия <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		И ТИПЗНАЧЕНИЯ(Позиции.МестоВСтруктуреПредприятия) = ТИП(Справочник.СтруктураПредприятия)
	|ГДЕ
	|	ИсторияИспользованияШтатногоРасписания.МестоВСтруктуреПредприятия = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";

	РезультатЗапроса = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(
		Запрос, ПараметрыОбновления);

	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);

	ВыгрузкаМест = РезультатЗапроса.Выгрузить();

	Регистраторы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВыгрузкаМест.ВыгрузитьКолонку("Регистратор"));

	Для Каждого Регистратор Из Регистраторы Цикл

		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
			"РегистрСведений.ИсторияИспользованияШтатногоРасписания.НаборЗаписей", "Регистратор", Регистратор) Тогда
			Продолжить;
		КонецЕсли;

		НаборЗаписей = РегистрыСведений.ИсторияИспользованияШтатногоРасписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);

		Если Не ЗначениеЗаполнено(НаборЗаписей.Отбор.Регистратор.Значение) Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			Продолжить;
		КонецЕсли;

		НаборЗаписей.Прочитать();

		Для Каждого СтрокаПозиции Из НаборЗаписей Цикл

			Отбор = Новый Структура;
			Отбор.Вставить("Регистратор", СтрокаПозиции.Регистратор);
			Отбор.Вставить("ПозицияШтатногоРасписания", СтрокаПозиции.ПозицияШтатногоРасписания);
			Отбор.Вставить("Дата", СтрокаПозиции.Дата);

			ДанныеМеста = ВыгрузкаМест.НайтиСтроки(Отбор);
			Если ДанныеМеста.Количество() > 0 Тогда
				СтрокаПозиции.МестоВСтруктуреПредприятия = ДанныеМеста[0].МестоВСтруктуреПредприятия;
			КонецЕсли;

		КонецЦикла;

		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);

		Если ИспользоватьИсториюИзмененияШтатногоРасписания Тогда

			ПараметрыФормирования = ПараметрыФормированияВторичныхДанныхМестаПозицииВСтруктуре(НаборЗаписей, Истина);
			ПараметрыФормирования.ИмяПоляПериод = "Дата";

			ОбновитьВторичныеДанныеМестаПозицииВСтруктуре(ПараметрыФормирования, Ложь);

		КонецЕсли;
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьМестаПозицииШтатногоРасписанияВСтруктуреПредприятия(ПараметрыОбновления = Неопределено) Экспорт

	Если ОтображатьВШтатномРасписанииМестоВСтруктуреПредприятия()
		И ПолучитьФункциональнуюОпцию("ИспользоватьИсториюИзмененияШтатногоРасписания") Тогда

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТекущийНабор.ПозицияШтатногоРасписания КАК Позиция,
		|	ТекущийНабор.Дата КАК Период,
		|	ТекущийНабор.МестоВСтруктуреПредприятия КАК Подразделение,
		|	ТекущийНабор.Регистратор КАК Основание
		|ПОМЕСТИТЬ ВТТекущийНабор
		|ИЗ
		|	РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ТекущийНабор
		|ГДЕ
		|	НЕ ТекущийНабор.ПозицияШтатногоРасписания В (&ОбработанныеПозиции)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ТекущийНабор.Период) КАК Период,
		|	ТекущийНабор.Позиция КАК Позиция
		|ПОМЕСТИТЬ ВТПоследниеДаты
		|ИЗ
		|	ВТТекущийНабор КАК ТекущийНабор
		|СГРУППИРОВАТЬ ПО
		|	ТекущийНабор.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущийНабор.Период КАК Период,
		|	ТекущийНабор.Позиция КАК Позиция,
		|	ТекущийНабор.Подразделение КАК Подразделение,
		|	ТекущийНабор.Основание КАК Основание
		|ИЗ
		|	ВТТекущийНабор КАК ТекущийНабор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.ДатаУтверждения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1900, 1, 1)
		|		ИНАЧЕ ШтатноеРасписание.ДатаУтверждения
		|	КОНЕЦ,
		|	ТекущийНабор.Позиция,
		|	ТекущийНабор.Подразделение,
		|	NULL
		|ИЗ
		|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК ТекущийНабор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО ТекущийНабор.Позиция = ШтатноеРасписание.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИспользованияШтатногоРасписания КАК ИсторияИспользованияШтатногоРасписания
		|		ПО ТекущийНабор.Позиция = ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НЕ ТекущийНабор.Позиция В (&ОбработанныеПозиции)
		|	И ИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДОБАВИТЬКДАТЕ(ПоследниеДаты.Период, День, 1),
		|	ПредыдущийНабор.Позиция,
		|	ПредыдущийНабор.Подразделение,
		|	NULL
		|ИЗ
		|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК ПредыдущийНабор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеДаты КАК ПоследниеДаты
		|		ПО ПредыдущийНабор.Позиция = ПоследниеДаты.Позиция
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТекущийНабор КАК ТекущийНабор
		|		ПО ПредыдущийНабор.Позиция = ТекущийНабор.Позиция
		|		И ПоследниеДаты.Период = ТекущийНабор.Период
		|		И ПредыдущийНабор.Подразделение <> ТекущийНабор.Подразделение
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиция,
		|	Период";

	Иначе

		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ШтатноеРасписание.ДатаУтверждения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДАТАВРЕМЯ(1900, 1, 1)
		|		ИНАЧЕ ШтатноеРасписание.ДатаУтверждения
		|	КОНЕЦ КАК Период,
		|	ТекущийНабор.Позиция КАК Позиция,
		|	ТекущийНабор.Подразделение КАК Подразделение,
		|	ТекущийНабор.Основание КАК Основание
		|ИЗ
		|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних КАК ТекущийНабор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО ТекущийНабор.Позиция = ШтатноеРасписание.Ссылка
		|ГДЕ
		|	НЕ ТекущийНабор.Позиция В (&ОбработанныеПозиции)";

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Если Не ПараметрыОбновления.Свойство("ОбработанныеПозиции") Тогда
		ОбработанныеПозиции = Новый Массив;
		ПараметрыОбновления.Вставить("ОбработанныеПозиции");
	Иначе
		ОбработанныеПозиции = ПараметрыОбновления.ОбработанныеПозиции;
	КонецЕсли;

	Запрос.УстановитьПараметр("ОбработанныеПозиции", ОбработанныеПозиции);

	РезультатЗапроса = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(
		Запрос, ПараметрыОбновления);

	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Позиция") Цикл

		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления,
			"РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", "Позиция",
			Выборка.Позиция) Тогда
			Продолжить;
		КонецЕсли;

		НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(Выборка.Позиция);

		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;

		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);

		ОбновитьДанныеДляПодбораСотрудниковПоСпискуПозиций(Выборка.Позиция, Истина);

		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

		ОбработанныеПозиции.Добавить(Выборка.Позиция);

	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработанныеПозиции", ОбработанныеПозиции);

КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло", Форма.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло);
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло") Тогда
		Форма["СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло"] = СохраненныеНастройки["СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло"];
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло = ?(Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц.Получить(), 0, 1);
	
КонецПроцедуры

Процедура ПолучитьНастройкиПрограммы(НастройкиПриложения) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПриложения.Вставить("СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло", ?(Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц, 1, 0));
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда 
		Возврат;
	КонецЕсли;
	
	Константы.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц.Установить(Параметры.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛицЧисло = 0);
	
КонецПроцедуры

#КонецОбласти

Функция ПоказыватьУправленческуюОрганизацию(ПараметрыВыбора = Неопределено) Экспорт
	
	Если ИспользоватьУмолчаниеДляОтображенияУправленческойОрганизации(ПараметрыВыбора) Тогда
		Возврат ПоказыватьУправленческуюОрганизациюПоУмолчанию();
	КонецЕсли;

	ПоказыватьУправленческуюОрганизацию = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ПараметрыВыбора, "ПоказыватьУправленческуюОрганизацию", Ложь);
	ЭтоВыборЗначенияДоступа = ПараметрыВыбора.Свойство("ЭтоВыборЗначенияДоступа");
	
	ИспользоватьУправленческуюЗарплату  = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата")
		И ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюЗарплату");
	
	Возврат (ПоказыватьУправленческуюОрганизацию Или ЭтоВыборЗначенияДоступа)
		И (ИспользоватьУправленческуюЗарплату
			Или ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц"));
	
КонецФункции

Функция ПоказыватьУправленческуюОрганизациюПоУмолчанию()

	Показывать = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		МодульКонфигурацииЗарплатаКадрыРасширенная = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		МодульКонфигурацииЗарплатаКадрыРасширенная.ПриОпределенииПоказыватьУправленческуюОрганизациюПоУмолчанию(Показывать);
	КонецЕсли;

	Если Показывать = Неопределено Тогда
		Показывать = Истина;
	КонецЕсли;
	
	Возврат Показывать;

КонецФункции

Функция ИспользоватьУмолчаниеДляОтображенияУправленческойОрганизации(ПараметрыВыбора)
	
	Если ПараметрыВыбора = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ПараметрыВыбора.Свойство("ПоказыватьУправленческуюОрганизацию") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыВыбора.Свойство("ЭтоВыборЗначенияДоступа") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПриСозданииФормыСпискаОрганизаций(Форма, Параметры, СписокОрганизаций) Экспорт
	
	Если ПоказыватьУправленческуюОрганизацию(Параметры) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокОрганизаций, 
		"Ссылка", 
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация"), 
		ВидСравненияКомпоновкиДанных.НеРавно);
	
КонецПроцедуры

Процедура ДополнитьДополнительныеПоляОтчетаШтатноеРасписание(СоответствиеДополнительныхПолейПредставлениям) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременнойТаблицы = "Представления_ШтатноеРасписание";
	
	ДополнительныеПоляПредставлений = Неопределено;
	Если Не СоответствиеДополнительныхПолейПредставлениям.Свойство(ИмяВременнойТаблицы, ДополнительныеПоляПредставлений) Тогда
		
		ДополнительныеПоляПредставлений = ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений();
		СоответствиеДополнительныхПолейПредставлениям.Вставить(ИмяВременнойТаблицы, ДополнительныеПоляПредставлений);
		
	КонецЕсли;
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
	СтрокаДополнительногоПоля.ИмяПоля = "МестоВСтруктуреПредприятия";
	СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	СтрокаДополнительногоПоля.ПутьПоляСКД = "МестоВСтруктуреПредприятия";
	
КонецПроцедуры

Процедура ДополнитьДополнительныеПоляОтчетаКадроваяИсторияСотрудников(СоответствиеДополнительныхПолейПредставлениям) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременнойТаблицы = "Представления_КадровыеДанныеСотрудников";
	
	ДополнительныеПоляПредставлений = Неопределено;
	Если Не СоответствиеДополнительныхПолейПредставлениям.Свойство(ИмяВременнойТаблицы, ДополнительныеПоляПредставлений) Тогда
		
		ДополнительныеПоляПредставлений = ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений();
		СоответствиеДополнительныхПолейПредставлениям.Вставить(ИмяВременнойТаблицы, ДополнительныеПоляПредставлений);
		
	КонецЕсли;
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
	СтрокаДополнительногоПоля.ИмяПоля = "МестоВСтруктуреПредприятия";
	СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	СтрокаДополнительногоПоля.ПутьПоляСКД = "МестоВСтруктуреПредприятия";
	
КонецПроцедуры

Процедура ЗаполнитьМестоВСтруктуреПредприятияДанныхДляПодбораСотрудников(НаборЗаписейДанныеДляПодбораСотрудников) Экспорт
	
	СписокПозиций = Новый Соответствие;
	Для Каждого Запись Из НаборЗаписейДанныеДляПодбораСотрудников Цикл
		
		Если ЗначениеЗаполнено(Запись.ДолжностьПоШтатномуРасписанию)
			И Не ЗначениеЗаполнено(Запись.МестоВСтруктуреПредприятия) Тогда
			
			СписокПозиций.Вставить(Запись.ДолжностьПоШтатномуРасписанию);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокПозиций.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	""00010101"" КАК Период,
		|	ШтатноеРасписание.Ссылка КАК Позиция
		|ПОМЕСТИТЬ ВТПозиции
		|ИЗ
		|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|ГДЕ
		|	ШтатноеРасписание.Ссылка В (&СписокПозиций)";
		
		Запрос.УстановитьПараметр("СписокПозиций", ОбщегоНазначения.ВыгрузитьКолонку(СписокПозиций, "Ключ"));
		
		Запрос.Выполнить();
		
		СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МестаПозицийВСтруктуреПредприятия.Позиция КАК Позиция,
		|	МестаПозицийВСтруктуреПредприятия.Подразделение КАК Подразделение
		|ИЗ
		|	ВТМестаПозицийВСтруктуреПредприятия КАК МестаПозицийВСтруктуреПредприятия
		|ГДЕ
		|	МестаПозицийВСтруктуреПредприятия.Подразделение ЕСТЬ НЕ NULL";

		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				СписокПозиций.Вставить(Выборка.Позиция, Выборка.Подразделение);
			КонецЦикла;
			
			Для Каждого Запись Из НаборЗаписейДанныеДляПодбораСотрудников Цикл
				
				Если ЗначениеЗаполнено(Запись.ДолжностьПоШтатномуРасписанию) Тогда
					Запись.МестоВСтруктуреПредприятия = СписокПозиций.Получить(Запись.ДолжностьПоШтатномуРасписанию);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСозданииФормСпискаИлиВыбораСотрудников(Форма, Параметры) Экспорт
	
	Если Не Форма.ПолучитьФункциональнуюОпциюФормы("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Справочники.СтруктураПредприятия) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МестоВСтруктуреПредприятия",
		"Видимость",
		Истина);
	
	ДобавитьТаблицуСтруктурыПредприятия = Не Параметры.Отбор.Свойство("МестоВСтруктуреПредприятия");
	
	Если ДобавитьТаблицуСтруктурыПредприятия Тогда
		
		КоллекцияОтборов = Новый Массив;
		КоллекцияОтборов.Добавить(Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы);
		КоллекцияОтборов.Добавить(Форма.Список.КомпоновщикНастроек.Настройки.Отбор.Элементы);
		ПользовательскиеОтборы = СотрудникиКлиентСерверРасширенный.ПользовательскиеОтборы(Форма.Список);
		Если ПользовательскиеОтборы <> Неопределено Тогда
			КоллекцияОтборов.Добавить(ПользовательскиеОтборы);
		КонецЕсли;
		
		Для Каждого ЭлементыОтбора Из КоллекцияОтборов Цикл
			
			Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
				
				Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация")
					Или ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал")
					Или ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации")
					Или ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МестоВСтруктуреПредприятия") Тогда
					
					ДобавитьТаблицуСтруктурыПредприятия = Ложь;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ДобавитьТаблицуСтруктурыПредприятия Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ДобавитьТаблицуСтруктурыПредприятия Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаОтборов = Форма.Элементы.Найти("ПодразделенияГруппыСотрудниковСтраницы");
	Если ГруппаОтборов <> Неопределено Тогда
		
		ИмяОрганизационнаяСтруктураСтраница = "ОрганизационнаяСтруктураСтраница";
		ОрганизационнаяСтруктураСтраница = Форма.Элементы.Найти(ИмяОрганизационнаяСтруктураСтраница);
		Если ОрганизационнаяСтруктураСтраница = Неопределено Тогда
			
			// Добавление реквизита
			
			МассивНовыхРеквизитов = Новый Массив;
			МассивНовыхРеквизитов.Добавить(Новый РеквизитФормы("ОрганизационнаяСтруктура", Новый ОписаниеТипов("ДинамическийСписок")));
			
			Форма.ИзменитьРеквизиты(МассивНовыхРеквизитов);
			
			Форма.ОрганизационнаяСтруктура.ТекстЗапроса =
				ТекстЗапросаСпискаСтруктурыПредприятияДляСпискаСотрудников();
			Форма.ОрганизационнаяСтруктура.ОсновнаяТаблица = "Справочник.СтруктураПредприятия";
			
			// Добавление таблицы
			
			ОрганизационнаяСтруктураСтраница = Форма.Элементы.Добавить(ИмяОрганизационнаяСтруктураСтраница, Тип("ГруппаФормы"), ГруппаОтборов);
			ОрганизационнаяСтруктураСтраница.Вид = ВидГруппыФормы.Страница;
			
			ОрганизационнаяСтруктураТаблица = Форма.Элементы.Добавить("ОрганизационнаяСтруктура", Тип("ТаблицаФормы"), ОрганизационнаяСтруктураСтраница);
			ОрганизационнаяСтруктураТаблица.ПутьКДанным = "ОрганизационнаяСтруктура";
			ОрганизационнаяСтруктураТаблица.ТолькоПросмотр = Истина;
			ОрганизационнаяСтруктураТаблица.Шапка = Ложь;
			ОрганизационнаяСтруктураТаблица.Отображение = ОтображениеТаблицы.Дерево;
			ОрганизационнаяСтруктураТаблица.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВерхнийУровень;
			ОрганизационнаяСтруктураТаблица.ИзменятьСоставСтрок = Ложь;
			ОрганизационнаяСтруктураТаблица.ИзменятьПорядокСтрок = Ложь;
			ОрганизационнаяСтруктураТаблица.УстановитьДействие("ПриАктивизацииСтроки", "Подключаемый_ОрганизационнаяСтруктураПриАктивизацииСтроки");
			
			ОрганизационнаяСтруктураТаблицаСсылка = Форма.Элементы.Добавить("ОрганизационнаяСтруктураСсылка", Тип("ПолеФормы"), ОрганизационнаяСтруктураТаблица);
			ОрганизационнаяСтруктураТаблицаСсылка.Вид = ВидПоляФормы.ПолеНадписи;
			ОрганизационнаяСтруктураТаблицаСсылка.ПутьКДанным = "ОрганизационнаяСтруктура.Ссылка";
			
			// Добавление команды
			
			Команда = Форма.Команды.Добавить("ПоОрганизационнойСтруктуре");
			Команда.Заголовок = НСтр("ru='Структура предприятия'");
			Команда.Действие = "Подключаемый_ПоОрганизационнойСтруктуре";
			
			ГруппаКоманд = Форма.Элементы.Найти("ВидСпискаГруппа");
			Если ГруппаКоманд <> Неопределено Тогда
				
				КомандаФормы = Форма.Элементы.Добавить("ФормаПоОрганизационнойСтруктуре", Тип("КнопкаФормы"), ГруппаКоманд);
				КомандаФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
				КомандаФормы.ИмяКоманды = "ПоОрганизационнойСтруктуре";
				
				НастройкаВидПоОрганизационнойСтруктуре = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("СписокСотрудников", "ВидПоОрганизационнойСтруктуре");
				КомандаФормы.Пометка = ?(НастройкаВидПоОрганизационнойСтруктуре = Неопределено, Ложь, НастройкаВидПоОрганизационнойСтруктуре);
				
			КонецЕсли;
			
			Если ТребуетсяУсловноеОформлениеСтруктурыПредприятия() Тогда
				УправлениеШтатнымРасписаниемФормы.УстановитьУсловноеОформлениеСпискаПодразделений(
					Форма, "ОрганизационнаяСтруктура", "СформированоНаСегодня", "РасформированоНаСегодня", "Ссылка");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СписокСотрудниковУстановитьОтображениеСписков(Форма, СохранитьНастройки) Экспорт
	
	ОрганизационнаяСтруктураКлиентСервер.СписокСотрудниковУстановитьОтображениеСписков(Форма);
	
	Если СохранитьНастройки Тогда
		
		Если Не Форма.ПолучитьФункциональнуюОпциюФормы("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СписокСотрудников", "ВидПоОрганизационнойСтруктуре", Ложь);
		Иначе
			ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("СписокСотрудников", "ВидПоОрганизационнойСтруктуре", Форма.Элементы.ФормаПоОрганизационнойСтруктуре.Пометка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхСотрудников(ДополнительныеПоляПредставлений, ПутьКПолямСотрудника, ИсключаемыеПоля) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "МестоВСтруктуреПредприятия";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямСотрудника + ".МестоВСтруктуреПредприятия";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеПоляОтчетаАнализНачисленийИУдержаний(ОтчетОбъект, ДополнительныеПоля) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПоляПредставлений = Неопределено;
	Если Не ДополнительныеПоля.Свойство("Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний", ДополнительныеПоляПредставлений) Тогда
		ДополнительныеПоляПредставлений = ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений();
	КонецЕсли;
	
	ИмяПоля = "МестоВСтруктуреПредприятия";
	
	СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Найти(ИмяПоля, "ИмяПоля");
	Если СтрокаДополнительногоПоля = Неопределено Тогда
		
		СтрокаДополнительногоПоля = ДополнительныеПоляПредставлений.Добавить();
		СтрокаДополнительногоПоля.ИмяПоля = ИмяПоля;
		СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
		
	КонецЕсли;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПсевдонимПоля(
		СтрокаДополнительногоПоля,
		"КадровыеДанныеСотрудников",
		"МестоВСтруктуреПредприятия",
		"Работа.МестоВСтруктуреПредприятия");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПсевдонимПоля(
		СтрокаДополнительногоПоля,
		"КадровыеДанныеСотрудниковНаКонецПериода",
		"МестоВСтруктуреПредприятияНаКонецПериода",
		"Работа.МестоВСтруктуреПредприятияНаКонецПериода");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПсевдонимПоля(
		СтрокаДополнительногоПоля,
		"КадровыеДанныеГоловныхСотрудников",
		"МестоВСтруктуреПредприятияГоловногоСотрудникаНаКонецПериода",
		"Работа.МестоВСтруктуреПредприятияГоловногоСотрудникаНаКонецПериода",
		НСтр("ru='Место в структуре предприятия основного сотрудника на конец периода'"));
	
КонецПроцедуры

Процедура ОбновитьСведенияПодразделений(
	ОбновляемыеПодразделения, ЭтоОбработчикОбновления = Ложь, ПроверятьСоответствиеСтруктур = Истина) Экспорт

	МодульСостояния = МодульСостоянияСтруктурыПредприятия();
	Если МодульСостояния = Неопределено Тогда
		Возврат;
	КонецЕсли;

	МодульСостояния.ОбновитьСведенияПодразделений(ОбновляемыеПодразделения, ЭтоОбработчикОбновления, ПроверятьСоответствиеСтруктур);
	
КонецПроцедуры

#Область ИсточникСведенийОШтатномРасписании

Процедура ДополнитьОписаниеИсточниковСведенийОШтатномРасписании(ОписаниеИсточников) Экспорт
	
	ДобавитьОписаниеСведенийМестаВСтруктуреПредприятия(ОписаниеИсточников);
	
КонецПроцедуры

Процедура ДобавитьОписаниеСведенийМестаВСтруктуреПредприятия(ОписаниеИсточников)
	
	ИдентификаторИсточника = "РегистрСведенийМестоПозицииШтатногоРасписанияВСтруктуреПредприятия";
	ОписаниеИсточника = УправлениеШтатнымРасписанием.ОписаниеИсточникаСведений(ОписаниеИсточников, ИдентификаторИсточника);
	
	ИмяДанныхШР = "МестоВСтруктуреПредприятия";
	УправлениеШтатнымРасписанием.ДобавитьОписаниеСведенийШтатногоРасписания(ОписаниеИсточников, ИмяДанныхШР, ИдентификаторИсточника,
		"РегистрСведенийМестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение");
	
	ПараметрыПостроения = ПараметрыПостроенияВТМестоПозицииВСтруктуреПредприятия("ВТОтборПозицийШтатногоРасписания",
		"ПозицияШтатногоРасписания,Период");

	ОписаниеИсточника.ЗапросВспомогательныхТаблиц = ЗапросВТМестоПозицииВСтруктуреПредприятия(ПараметрыПостроения);
    ОписаниеИсточника.ЗависимостьОтИсточников.Добавить("ВТОтборПозицийШтатногоРасписания");

	ОписаниеИсточника.ТекстСоединений = "
	|	{ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииВСтруктуреПредприятия КАК РегистрСведенийМестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО ОтборПозицийШтатногоРасписания.ПозицияШтатногоРасписания = РегистрСведенийМестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
	|			И ОтборПозицийШтатногоРасписания.Период = РегистрСведенийМестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Период}";

	ОписаниеИсточника.ИменаВТКУничтожению.Добавить("ВТМестоПозицииВСтруктуреПредприятия");

КонецПроцедуры

#КонецОбласти

#КонецОбласти
