

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализация(Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытии_ПослеПолученияКонтекста", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
	ПодключитьОбработчикОжидания("Подключаемый_ДополнительнаяАктивизация", 1, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеСпискаОрганизацийНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПредставлениеСпискаОрганизацийНажатие_ПослеВыбора", 
		ЭтотОбъект);
		
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СписокОрганизаций", СписокОрганизаций);
		
	ОткрытьФорму("Обработка.ПереносСправочниковБРО.Форма.ВыборОрганизации",ДополнительныеПараметры,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВосстановлениеПароляНажатие(Элемент)

	Если ЕстьБИП Тогда
		
		МодульИнтернетПоддержкаПользователейКлиент = 
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
			
		МодульИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуВосстановленияПароля();
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаРегистрацияНажатие(Элемент)
	
	Если ЕстьБИП Тогда
		
		МодульИнтернетПоддержкаПользователейКлиент = 
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
			
		МодульИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуРегистрацииНовогоПользователя();
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	ПоказатьСтраницуВыборОрганизаций();
КонецПроцедуры

&НаКлиенте
Процедура СтраницаПодключение_Назад(Команда)
	
	ПоказатьСтраницуВыборОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаВыгрузка_Назад(Команда)
	
	ПоказатьСтраницуВыборОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРасширение(Команда)
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеУстановкиРасширенияРаботыСФайлами",
		ЭтотОбъект,
		,
		"ПриОшибкеУстановкиРасширения",
		ЭтотОбъект);
		
	НачатьУстановкуРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьДействие(Команда)
	
	СообщитьОЗавершенииИЗакрытьБазу("BREAK.txt");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборОрганизаций_Далее(Команда)
	
	ПоказатьСтраницуВыгрузка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИТС(Команда)
	
	Если Не ЗначениеЗаполнено(ЛогинИнтернетПоддержки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введите логин'"),, "ЛогинИнтернетПоддержки");
		
		Возврат;
		
	ИначеЕсли Не ЗначениеЗаполнено(ПарольИнтернетПоддержки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введите пароль'"),, "ПарольИнтернетПоддержки");
		
		Возврат;
		
	КонецЕсли;
	
	ПодключитьИнтернетПоддержку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИТСПозже(Команда)
	
	Если УстановитьПинКодИнтеграцииСОтчетностью Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПодключитьИТСПозже_ПослеВопроса", 
			ЭтотОбъект);
			
		ТекстВопроса = НСтр("ru = 'Ранее вы разрешили заполнение регламентированных отчетов по данным этой базы. Заполнение невозможно без подключения ИТС. Продолжить без заполнения регламентированных отчетов?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПодключитьИТСПозже_ПослеВопроса(КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДополнительнаяАктивизация()
	
	КоличествоПроверок = КоличествоПроверок + 1;
	Если КоличествоПроверок > 10 Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ДополнительнаяАктивизация");
	КонецЕсли;
	
	АктивноеОкно = АктивноеОкно();
	Если АктивноеОкно = Неопределено ИЛИ АктивноеОкно.Заголовок <> Заголовок Тогда
		Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИТСПозже_ПослеВопроса(Ответ, ВходящийКонтекст = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЗапретитьИнтеграцию = Истина;
		ПослеПоказаСтраницыИТС();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСпискаОрганизацийНажатие_ПослеВыбора(Результат, ВходящийКонтекст) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокОрганизаций.Очистить();
	СписокОрганизаций = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Результат);
	
	ИзменитьОформлениеСпискаОрганизаций();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОформлениеСпискаОрганизаций()
	
	Элементы.ВыборОрганизаций_ГруппаОрганизации.Видимость = НЕ ИспользуетсяОднаОрганизация;;

	Если НЕ Элементы.ВыборОрганизаций_ГруппаОрганизации.Видимость Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоВыбранных = 0;
	ПредставленияВыбранных = Новый Массив;
	Для каждого Строка Из СписокОрганизаций Цикл
		Если Строка.Пометка Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
			ПредставленияВыбранных.Добавить(Строка.Представление);
		КонецЕсли;
	КонецЦикла;

	Если КоличествоВыбранных = ВсегоОрганизаций Тогда
		Представление  = НСтр("ru = 'Все организации'");
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Представление  = НСтр("ru = 'Выбрать'");
	ИначеЕсли КоличествоВыбранных = 1 Тогда
		Представление  = ПредставленияВыбранных[0];
	ИначеЕсли КоличествоВыбранных = 2 Тогда
		Представление  = ПредставленияВыбранных[0] + НСтр("ru = ' и '") + ПредставленияВыбранных[1];
	ИначеЕсли КоличествоВыбранных > 2 Тогда
		Представление  = ПредставленияВыбранных[0] + НСтр("ru = ' и еще '") + Строка(КоличествоВыбранных - 1);
	КонецЕсли;
	
	Элементы.ПредставлениеСпискаОрганизаций.Заголовок = Представление;
	
КонецПроцедуры
	
&НаСервере
Процедура ИнициализироватьСписокОрганизации()
	
	ИспользуетсяОднаОрганизация = РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация();
	
	СписокОрганизаций.Очистить();
	
	Если ИспользуетсяОднаОрганизация Тогда
		
		ВсегоОрганизаций = 1;
		
		Организация = ОбработкаЗаявленийАбонента.ОрганизацияПоУмолчанию();
		СписокОрганизаций.Добавить(Организация, Строка(Организация), Истина);
		
	Иначе
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	НЕ Организации.ПометкаУдаления";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		ВсегоОрганизаций = Выборка.Количество();
		
		Пока Выборка.Следующий() Цикл
			СписокОрганизаций.Добавить(Выборка.Ссылка, Строка(Выборка.Ссылка), Истина);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Инициализация(Параметры)
	
	ЕстьБИП =
		ЭлектронныйДокументооборотСКонтролирующимиОрганами.МодульИнтернетПоддержкаПользователей() <> Неопределено;
		
	ИнициализироватьСписокОрганизации();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПодключитьИнтернетПоддержку()
	
	УстановитьДоступностьЭлементовОжиданияПодключения(Истина);
	
	Элементы.ГруппаОшибкаПодключения.Видимость = Ложь;
	
	ПодключитсяКИнтернетПоддержкеНаСервере();
	Результат = ОбработкаЗаявленийАбонентаВызовСервера.ТикетАутентификацииНаПорталеПоддержки();
	
	Если Результат = Неопределено Тогда 
		УстановитьДоступностьЭлементовОжиданияПодключения(Ложь);
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.СообщениеОбОшибке) Тогда
		УстановитьДоступностьЭлементовОжиданияПодключения(Ложь);
		Элементы.ГруппаОшибкаПодключения.Видимость = Истина;
		Элементы.ТекстОшибкиПодключения.Заголовок = Результат.СообщениеОбОшибке;
		Возврат;
	КонецЕсли;
	
	ПослеПоказаСтраницыИТС();
	
КонецПроцедуры

&НаСервере
Функция ПодключитсяКИнтернетПоддержкеНаСервере()
	
	Если ЕстьБИП Тогда
		
		МодульИнтернетПоддержкаПользователей = 
			ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
		
		ДанныеАутентификации = Новый Структура("Логин, Пароль", ЛогинИнтернетПоддержки, ПарольИнтернетПоддержки);
		УстановитьПривилегированныйРежим(Истина);
		МодульИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(ДанныеАутентификации);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементовОжиданияПодключения(Ожидание)
	
	Элементы.ГруппаПодключиться.Доступность         = НЕ Ожидание;
	Элементы.Подключиться.Видимость                 = НЕ Ожидание;
	Элементы.ПодключитьИТСПозже.Видимость           = НЕ Ожидание;
	Элементы.ГруппаОжиданиеПодключения.Видимость    = Ожидание;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии_ПослеПолученияКонтекста(Результат, ДополнительныеПараметры) Экспорт

	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
	РазобратьПараметрыЗапуска();
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПриОткрытии_ПослеОпределенияНаличияРасширения", 
		ЭтотОбъект); 
		
	НачатьПодключениеРасширенияРаботыСФайлами(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии_ПослеОпределенияНаличияРасширения(Подключено, ДополнительныеПараметры) Экспорт

	РасширенияРаботыСФайламиПодключено = Подключено;

	// Второй тихий запуск источника только для подключения к шине - выгрузка справочников уже сделана
	Если ТолькоПодключениеИнтеграции Тогда
		ПоказатьСтраницуПодключение();
		Возврат;
	КонецЕсли;

	Если НужноПоказатьСтраницуИТС() Тогда
		
		АктивизироватьСтраницу(
			Элементы.СтраницыПомощника, 
			Элементы.СтраницаИТС);
			
		Активизировать();
			
	Иначе
			
		ПослеПоказаСтраницыИТС();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеПоказаСтраницыИТС() Экспорт
	
	Если НужноПоказатьСтраницуВыборОрганизаций(ЭтотОбъект) Тогда
			
		ПоказатьСтраницуВыборОрганизаций();
		Активизировать();
		
	Иначе
			
		ПоказатьСтраницуВыгрузка();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуВыгрузка() Экспорт
	
	Элементы.СтраницаВыгрузка_Назад.Видимость = НужноПоказатьСтраницуВыборОрганизаций(ЭтотОбъект);
	
	АктивизироватьСтраницу(
		Элементы.СтраницыПомощника, 
		Элементы.СтраницаВыгрузка);
		
	ПодключитьОбработчикОжидания("Подключаемый_НачатьВыгрузкуДанных", 1, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьВыгрузкуДанных() Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"НачатьВыгрузкуДанных_ПроверитьСостояние", 
		ЭтотОбъект); 
		
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.Интервал = 1;
	
	ДлительнаяОперация = НачатьВыгрузкуДанных();
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыгрузкуДанных_ПроверитьСостояние(ДлительнаяОперация, ВходящийКонтекст) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		ТекстОшибки = НСтр("ru = 'Не обнаружено фоновое задание по выгрузке справочников'");
		ПоказатьСтраницуОшибкиВыгрузки(ЭтотОбъект, ТекстОшибки);
		Возврат;
	КонецЕсли;
		
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		Файлы = РезультатФоновогоЗадания(ДлительнаяОперация);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"НачатьВыгрузкуДанных_ПослеПолученияФайловНаКлиенте", 
			ЭтотОбъект);
			
		НачатьПолучениеФайловССервера(ОписаниеОповещения, Файлы, ПапкаОбмена);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		
		ПоказатьСтраницуОшибкиВыгрузки(ЭтотОбъект, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатФоновогоЗадания(ДлительнаяОперация)
	
	Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);

	Файлы = Новый Массив;
	
	// ВыгрузкаСправочников
	Если Результат.ВыгрузкаСправочников.Размер() <> 0 Тогда
		ДобавитьНовоеОписание(Файлы, "ВыгрузкаСправочников.txt", Результат.ВыгрузкаСправочников);
	КонецЕсли;
	
	// ВыгрузкаМЧДФНСиУПУП
	Если Результат.ВыгрузкаМЧДФНСиУПУП <> Неопределено Тогда
		Для каждого Файл Из Результат.ВыгрузкаМЧДФНСиУПУП Цикл
			ДобавитьНовоеОписание(Файлы, Файл.Имя, Файл.ДвДанные);
		КонецЦикла;
	КонецЕсли;
	
	Если Результат.ВыгрузкаУниверсальнымОбменом <> Неопределено Тогда
		ДобавитьНовоеОписание(Файлы, "ВыгрузкаУниверсальнымОбменом.xml", Результат.ВыгрузкаУниверсальнымОбменом);
	КонецЕсли;
	
	ДобавитьНовоеОписание(Файлы, "Ошибки.txt", Результат.Ошибки);
	
	Возврат Файлы;
	
КонецФункции

&НаСервере
Процедура ДобавитьНовоеОписание(Файлы, Имя, ДвДанные)
	
	Адрес = ПоместитьВоВременноеХранилище(ДвДанные, УникальныйИдентификатор);
	
	Описание = Новый ОписаниеПередаваемогоФайла(Имя, Адрес);
	
	Файлы.Добавить(Описание);
	
КонецПроцедуры

&НаСервере
Функция НачатьВыгрузкуДанных()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выгрузка справочников'");
	ПараметрыВыполнения.ОжидатьЗавершение = Истина;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СписокОрганизаций", СписокОрганизаций);
	ДополнительныеПараметры.Вставить("ВерсияБРО", ВерсияБРО);
	ДополнительныеПараметры.Вставить("ВерсияБСП", ВерсияБСП);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПереносСправочниковБРО.НачатьВыгрузкуДанных", 
		ДополнительныеПараметры, 
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура НачатьВыгрузкуДанных_ПослеПолученияФайловНаКлиенте(ПолученныеФайлы, ВходящийКонтекст) Экспорт
	
	Если НужноПоказатьСтраницуПодключение() Тогда
		
		ПоказатьСтраницуПодключение();
		
	Иначе
		
		СообщитьОЗавершенииИЗакрытьБазу("READY.txt");
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьСтраницуОшибкиВыгрузки(Форма, ТекстОшибки) Экспорт
	
	Элементы = Форма.Элементы;
	
	Элементы.ОшибкаВыгрузки_Причина.Заголовок = ТекстОшибки;
	
	Элементы.ОшибкаВыгрузки_Назад.Видимость = НужноПоказатьСтраницуВыборОрганизаций(Форма);
	
	АктивизироватьСтраницу(
		Элементы.СтраницыПомощника, 
		Элементы.СтраницаОшибкаВыгрузки);
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуПодключение() Экспорт
	
	Элементы.СтраницаПодключение_Назад.Видимость = НужноПоказатьСтраницуВыборОрганизаций(ЭтотОбъект);
	
	АктивизироватьСтраницу(
		Элементы.СтраницыПомощника, 
		Элементы.СтраницаПодключение);
		
	ПодключитьОбработчикОжидания("Подключаемый_НачатьУстановкуСоединения", 1, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьУстановкуСоединения() Экспорт
	
	НачатьПодключениеКШине();
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтраницуВыборОрганизаций() Экспорт

	ИзменитьОформлениеСтраницыВыбораОрганизаций();
	
	АктивизироватьСтраницу(
		Элементы.СтраницыПомощника, 
		Элементы.СтраницаВыборОрганизаций);
		
КонецПроцедуры

&НаКлиенте
Функция НужноПоказатьСтраницуПодключение()
	
	Возврат УстановитьПинКодИнтеграцииСОтчетностью И НЕ ЗапретитьИнтеграцию;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НужноПоказатьСтраницуВыборОрганизаций(Форма)
	
	ПропуститьСтраницу = Форма.ИспользуетсяОднаОрганизация И Форма.РасширенияРаботыСФайламиПодключено;
	
	Возврат НЕ ПропуститьСтраницу;
	
КонецФункции

&НаСервере
Функция НужноПоказатьСтраницуИТС() 
	
	Результат = ОбработкаЗаявленийАбонентаВызовСервера.ТикетАутентификацииНаПорталеПоддержки();
	
	ПропуститьСтраницуИТС = 
		Результат = Неопределено 
		ИЛИ ЗначениеЗаполнено(Результат.Тикет) 
		ИЛИ Результат.КодОшибки = "ОшибкаПодключения"
		ИЛИ ОбщегоНазначения.РазделениеВключено();
		
	НужноПоказать = НЕ ПропуститьСтраницуИТС;
	
	Возврат НужноПоказать;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура АктивизироватьСтраницу(МногостраничныйЭлемент, ТекущаяСтраница, МенятьВидимость = Ложь) Экспорт
	
	ДокументооборотСКОКлиентСервер.АктивизироватьСтраницу(
		МногостраничныйЭлемент, 
		ТекущаяСтраница, 
		МенятьВидимость);
		
КонецПроцедуры
	
&НаКлиенте
Процедура ИзменитьОформлениеСтраницыВыбораОрганизаций()
	
	Элементы.ВыборОрганизаций_ТекстПроРасширение.Видимость = НЕ РасширенияРаботыСФайламиПодключено;
	Элементы.УстановитьРасширение.Видимость = НЕ РасширенияРаботыСФайламиПодключено;
	
	Элементы.ВыборОрганизаций_Далее.Видимость = РасширенияРаботыСФайламиПодключено;

	Если ТолькоПодключениеИнтеграции Тогда
		Элементы.ВыборОрганизаций_Заголовок.Заголовок = НСтр("ru = 'Подключение учетной базы'");
	Иначе
		Элементы.ВыборОрганизаций_Заголовок.Заголовок = НСтр("ru = 'Выгрузка данных из базы'");
	КонецЕсли;

	ИзменитьОформлениеСпискаОрганизаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУстановкиРасширенияРаботыСФайлами(ВходящийКонтекст) Экспорт
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеПодключенияРасширенияРаботыСФайлами",
		ЭтотОбъект,
		ВходящийКонтекст,
		"ПриОшибкеУстановкиРасширения",
		ЭтотОбъект);
	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияРасширенияРаботыСФайлами(Подключено, ВходящийКонтекст) Экспорт
	
	Если Подключено Тогда
		
		РасширенияРаботыСФайламиПодключено = Истина;
		
		ПоказатьСтраницуВыгрузка();
		
	Иначе
		
		ПоказатьОшибкуУстановкиРасширения();
		
	КонецЕсли;
		
КонецПроцедуры
	
&НаКлиенте
Процедура ПриОшибкеУстановкиРасширения(ИнформацияОбОшибке, СтандартнаяОбработка, ВходящийКонтекст) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьОшибкуУстановкиРасширения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибкуУстановкиРасширения() Экспорт
	
	Сообщить(НСтр("ru = 'Не удалось установить расширение работы с файлами'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключениеКШине() Экспорт

	Ошибка = "";
	Попытка

		МодульИнтеграцияСОтчетность24ВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияСОтчетность24ВызовСервера");
		РезультатПодключения = МодульИнтеграцияСОтчетность24ВызовСервера.ПодключитьсяИСохранитьНастройки(ПинКод, Ошибка);

		Если Не ЗначениеЗаполнено(Ошибка) И Не ПодключениеУспешно(РезультатПодключения) Тогда
			Ошибка = ТекстСостоянияПодключения(РезультатПодключения);
		КонецЕсли;

	Исключение

		Ошибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());

	КонецПопытки;

	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПолноеИмяФайлаРезультата = ПолучитьПолноеИмяФайла("PIN_ERROR.txt");
	Иначе
		ПолноеИмяФайлаРезультата = ПолучитьПолноеИмяФайла("PIN_READY.txt");
	КонецЕсли;

	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Ошибка);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодключениеКШине", ЭтотОбъект);
	ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ПолноеИмяФайлаРезультата);

КонецПроцедуры

// Признак успешного подключения к шине
//
// Параметры:
//  РезультатПодключения - Структура, Неопределено - см. ИнтеграцияСОтчетность24ВызовСервера.Подключиться
//
// Возвращаемое значение:
//  Булево - Истина если база подключена или была подключена ранее
//
&НаКлиенте
Функция ПодключениеУспешно(РезультатПодключения)

	Если ТипЗнч(РезультатПодключения) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Состояние = 0;
	Если Не РезультатПодключения.Свойство("Состояние", Состояние) Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат Состояние = 1 Или Состояние = 3;

КонецФункции

// Текст состояния подключения к шине
//
// Параметры:
//  РезультатПодключения - Структура, Неопределено - см. ИнтеграцияСОтчетность24ВызовСервера.Подключиться
//
// Возвращаемое значение:
//  Строка - описание неуспешного состояния
//
&НаКлиенте
Функция ТекстСостоянияПодключения(РезультатПодключения)

	ТекстСостояния = "";
	Если ТипЗнч(РезультатПодключения) = Тип("Структура") Тогда
		РезультатПодключения.Свойство("ТекстСостояния", ТекстСостояния);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстСостояния) Тогда
		ТекстСостояния = НСтр("ru = 'Не удалось подключить базу к приложению 1С-Отчетность'");
	КонецЕсли;

	Возврат ТекстСостояния;

КонецФункции

&НаКлиенте
Процедура ПослеПодключениеКШине(Результат, ВходящийКонтекст) Экспорт
	
	СообщитьОЗавершенииИЗакрытьБазу("READY.txt");
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПолноеИмяФайла(ИмяФайла)
	
	Возврат ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПапкаОбмена) + ИмяФайла;
	
КонецФункции

&НаКлиенте
Процедура СообщитьОЗавершенииИЗакрытьБазу(ИмяФайла)
	
	ПолноеИмяФайлаРезультата = ПолучитьПолноеИмяФайла(ИмяФайла);
		
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерейтиКЗакрытиюБазы", ЭтотОбъект);
	ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ПолноеИмяФайлаРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКЗакрытиюБазы(Результат, ВходящийКонтекст) Экспорт
	
	ЗавершитьРаботуСистемы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьПараметрыЗапуска()

	ПараметрыЗапускаМассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска,";");

	// Хвост команды всегда: <ПапкаОбмена>;БРО<версия>;БСП<версия>
	// ПереносСправочниковБРО;<папка>;БРО1.2.1.263;БСП3.1.11.142
	// ПереносСправочниковБРО;УстановитьПинКодИнтеграцииСОтчетностью;<пин>;<папка>;БРО...;БСП...
	// ПереносСправочниковБРО;ТолькоПодключение;УстановитьПинКодИнтеграцииСОтчетностью;<пин>;<папка>;БРО...;БСП...
	Количество = ПараметрыЗапускаМассив.Количество();
	ВерсияБСП   = ПараметрыЗапускаМассив[Количество - 1];
	ВерсияБРО   = ПараметрыЗапускаМассив[Количество - 2];
	ПапкаОбмена = ПараметрыЗапускаМассив[Количество - 3];

	ТолькоПодключениеИнтеграции = ПараметрыЗапускаМассив.Найти("ТолькоПодключение") <> Неопределено;

	ИндексТокенаПин = ПараметрыЗапускаМассив.Найти("УстановитьПинКодИнтеграцииСОтчетностью");
	Если ИндексТокенаПин <> Неопределено Тогда
		УстановитьПинКодИнтеграцииСОтчетностью = Истина;
		ПинКод = ПараметрыЗапускаМассив[ИндексТокенаПин + 1];
	КонецЕсли;

КонецПроцедуры


#КонецОбласти


