#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ФайлДанных;

Перем ТипСтрока;
Перем ТипДата;
Перем ТипЧисло;
Перем ТипБулево;
Перем ТипСтандартнаяДатаНачала;

Перем ТипУзлаНачалоЭлемента;
Перем ТипУзлаКонецЭлемента;

Перем ИзмененыИдентификаторыПоддержки;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ВыполнитьВыгрузкуДанных(СписокШаблонов) Экспорт
	
	ДанныеШаблонов = ДанныеВыгружаемыхШаблонов(СписокШаблонов);
	
	ИзмененыИдентификаторыПоддержки = Ложь;
	
	УстановитьИдентификаторПоддержкиШаблоновПередВыгрузкой(ДанныеШаблонов[3].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьИдентификаторПоддержкиЭтаповПередВыгрузкой(ДанныеШаблонов[4].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьИдентификаторПоддержкиСтатусовПередВыгрузкой(ДанныеШаблонов[5].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьИдентификаторПоддержкиРегламентныхИнтерваловПередВыгрузкой(ДанныеШаблонов[6].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	УстановитьИдентификаторПоддержкиРолейИсполнителейПередВыгрузкой(ДанныеШаблонов[7].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если ИзмененыИдентификаторыПоддержки Тогда
		ДанныеШаблонов = ДанныеВыгружаемыхШаблонов(СписокШаблонов);
	КонецЕсли;
	
	ИдентификаторыРолей = ИдентификаторыРолейИсполнителей(ДанныеШаблонов[7].Выбрать());
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ИнициализироватьФайлДанныхДляВыгрузки(ИмяВременногоФайла);
	
	ВыборкаШаблоны = ДанныеШаблонов[3].Выбрать();
	ФайлДанных.ЗаписатьНачалоЭлемента("ШаблоныПроцессов");
	Пока ВыборкаШаблоны.Следующий() Цикл
		ВыгрузитьШаблонПроцесса(ВыборкаШаблоны, ИдентификаторыРолей);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //ШаблоныПроцессов
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ЭтапыПроцессов");
	ТаблицаЭтапы = ДанныеШаблонов[4].Выгрузить();
	ТаблицаЭтапы.Сортировать("ИдентификаторПоддержки");
	Для Каждого ВыборкаЭтапы Из ТаблицаЭтапы Цикл
		ВыгрузитьЭтапПроцесса(ВыборкаЭтапы);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //ЭтапыПроцессов
	
	ФайлДанных.ЗаписатьНачалоЭлемента("СтатусыДокументов");
	ТаблицаСтатусы = ДанныеШаблонов[5].Выгрузить();
	ТаблицаСтатусы.Сортировать("ИдентификаторПоддержки");
	Для Каждого ВыборкаСтатусы Из ТаблицаСтатусы Цикл
		ВыгрузитьСтатус(ВыборкаСтатусы);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //СтатусыДокументов
	
	ВыборкаИнтервалы = ДанныеШаблонов[6].Выбрать();
	ФайлДанных.ЗаписатьНачалоЭлемента("РегламентныеИнтервалы");
	Пока ВыборкаИнтервалы.Следующий() Цикл
		ВыгрузитьРегламентныйИнтервал(ВыборкаИнтервалы);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //РегламентныеИнтервалы
	
	ВыборкаРоли = ДанныеШаблонов[7].Выбрать();
	ФайлДанных.ЗаписатьНачалоЭлемента("РолиИсполнителей");
	Пока ВыборкаРоли.Следующий() Цикл
		ВыгрузитьРольИсполнителя(ВыборкаРоли);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //РолиИсполнителей
	
	ВыборкаНастройкиИспользования = ДанныеШаблонов[8].Выбрать();
	ФайлДанных.ЗаписатьНачалоЭлемента("НастройкиИспользования");
	Пока ВыборкаНастройкиИспользования.Следующий() Цикл
		ВыгрузитьНастройкиИспользования(ВыборкаНастройкиИспользования);
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); //НастройкиИспользования
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриВыгрузкеШаблоновПроцессов(ФайлДанных, СписокШаблонов);
	
	ЗавершитьВыгрузку();
	
	ДанныеФайла = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(ДанныеФайла);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// обработка исключения не требуется
	КонецПопытки;
	
	Возврат АдресФайлаВХранилище;
	
КонецФункции

Процедура ВыполнитьЗагрузкуДанных(ПараметрыЗагрузки) Экспорт
	
	АдресФайлаЗагрузки = ПараметрыЗагрузки.АдресФайлаЗагрузки;
	СоответствияОбъектов = ПараметрыЗагрузки.СоответствияОбъектов;
	ОбъектыДляЗагрузки = ПараметрыЗагрузки.ОбъектыДляЗагрузки;
	ЗагружатьИсполнителей = ПараметрыЗагрузки.ЗагружатьИсполнителей;
	ЗагружатьНастройкиИспользования = ПараметрыЗагрузки.ЗагружатьНастройкиИспользования;
	ЗагружатьНастройкиСвойствЭлементов = ПараметрыЗагрузки.ЗагружатьНастройкиСвойствЭлементов; 

	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаЗагрузки);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстовыйДокумент = Неопределено;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// обработка исключения не требуется
	КонецПопытки;
	
	НачатьТранзакцию();
	Попытка
		
		Если ЗагружатьИсполнителей Тогда
			ЗагрузитьРолиИсполнителей(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.РолиДляЗагрузки);
		КонецЕсли;
		
		ЗагрузитьСтатусыДокументов(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.СтатусыДляЗагрузки);
		
		ЗагрузитьЭтапыПроцессов(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.ЭтапыДляЗагрузки);
		
		ЗагрузитьШаблоныПроцессов(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.ШаблоныДляЗагрузки, 
			ЗагружатьИсполнителей, ЗагружатьНастройкиСвойствЭлементов);
		
		ЗагрузитьРегламентныеИнтервалы(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.ИнтервалыДляЗагрузки);
		
		Если ЗагружатьНастройкиИспользования Тогда
			ЗагрузитьНастройкиИспользования(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки.ШаблоныДляЗагрузки);
		КонецЕсли;
		
		ПроцессыОбработкиДокументовПереопределяемый.ПриЗагрузкеШаблоновПроцессов(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение импорта шаблонов процессов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

Процедура ПолучитьДанныеСвязанныхШаблонов(Шаблон, СписокШаблонов) Экспорт
	
	Для Каждого Влияние Из Шаблон.ВлияниеНаДругиеПроцессы Цикл
		Если СписокШаблонов.Найти(Влияние.ЗависимыйШаблон) = Неопределено Тогда
			СписокШаблонов.Добавить(Влияние.ЗависимыйШаблон);
			ПолучитьДанныеСвязанныхШаблонов(Влияние.ЗависимыйШаблон, СписокШаблонов);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовВлияниеНаДругиеПроцессы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПроцессов.ВлияниеНаДругиеПроцессы КАК ШаблоныПроцессовВлияниеНаДругиеПроцессы
	|ГДЕ
	|	ШаблоныПроцессовВлияниеНаДругиеПроцессы.ЗависимыйШаблон = &Шаблон
	|	И НЕ ШаблоныПроцессовВлияниеНаДругиеПроцессы.Ссылка В (&СписокШаблонов)";
	Запрос.УстановитьПараметр("Шаблон",Шаблон);
	Запрос.УстановитьПараметр("СписокШаблонов",СписокШаблонов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СписокШаблонов.Найти(Выборка.Ссылка) = Неопределено Тогда
			СписокШаблонов.Добавить(Выборка.Ссылка);
			ПолучитьДанныеСвязанныхШаблонов(Выборка.Ссылка, СписокШаблонов);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьИдентификаторПоддержкиШаблоновПередВыгрузкой(СписокШаблонов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|ГДЕ
	|	ШаблоныПроцессов.Ссылка В(&СписокШаблонов)
	|	И ШаблоныПроцессов.ИдентификаторПоддержки = &ПустойИД";
	
	Запрос.УстановитьПараметр("СписокШаблонов", СписокШаблонов);
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыИдентификаторыПоддержки = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ШаблоныПроцессов");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ШаблонОбъект.Заблокировать();
			
			ШаблонОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			
			ШаблонОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка идентификатора поддержки для шаблонов процессов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьИдентификаторПоддержкиЭтаповПередВыгрузкой(СписокЭтапов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыПроцессов КАК ЭтапыПроцессов
	|ГДЕ
	|	ЭтапыПроцессов.Ссылка В(&СписокЭтапов)
	|	И ЭтапыПроцессов.ИдентификаторПоддержки = &ПустойИД";
	
	Запрос.УстановитьПараметр("СписокЭтапов", СписокЭтапов);
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыИдентификаторыПоддержки = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ЭтапыПроцессов");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЭтапОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЭтапОбъект.Заблокировать();
			
			ЭтапОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			
			ЭтапОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка идентификатора поддержки для этапов процессов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьИдентификаторПоддержкиСтатусовПередВыгрузкой(СписокСтатусов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтатусыДокументов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтатусыДокументов КАК СтатусыДокументов
	|ГДЕ
	|	СтатусыДокументов.Ссылка В(&СписокСтатусов)
	|	И СтатусыДокументов.ИдентификаторПоддержки = &ПустойИД";
	
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыИдентификаторыПоддержки = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.СтатусыДокументов");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			СтатусОбъект.Заблокировать();
			
			СтатусОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			
			СтатусОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка идентификатора поддержки для статусов документов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьИдентификаторПоддержкиРегламентныхИнтерваловПередВыгрузкой(СписокИнтервалов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегламентныеИнтервалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РегламентныеИнтервалы КАК РегламентныеИнтервалы
	|ГДЕ
	|	РегламентныеИнтервалы.Ссылка В(&СписокИнтервалов)
	|	И РегламентныеИнтервалы.ИдентификаторПоддержки = &ПустойИД";
	
	Запрос.УстановитьПараметр("СписокИнтервалов", СписокИнтервалов);
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыИдентификаторыПоддержки = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.РегламентныеИнтервалы");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			РегламентныйИнтервалОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			РегламентныйИнтервалОбъект.Заблокировать();
			
			РегламентныйИнтервалОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			
			РегламентныйИнтервалОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка идентификатора поддержки для регламентных интервалов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьИдентификаторПоддержкиРолейИсполнителейПередВыгрузкой(СписокРолей)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РолиИсполнителей.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.РолиИсполнителей КАК РолиИсполнителей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыПоддержкиРолейИсполнителей КАК ИдентификаторыПоддержки
	|		ПО РолиИсполнителей.Ссылка = ИдентификаторыПоддержки.РольИсполнителя
	|ГДЕ
	|	РолиИсполнителей.Ссылка В(&СписокРолей)
	|	И (ИдентификаторыПоддержки.ИдентификаторПоддержки ЕСТЬ NULL
	|			ИЛИ ИдентификаторыПоддержки.ИдентификаторПоддержки = &ПустойИД)";
	
	Запрос.УстановитьПараметр("СписокРолей", СписокРолей);
	Запрос.УстановитьПараметр("ПустойИД", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыИдентификаторыПоддержки = Истина;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыПоддержкиРолейИсполнителей");
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("РольИсполнителя", "Ссылка");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоддержкиРолейИсполнителей.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.РольИсполнителя = Выборка.Ссылка;
			МенеджерЗаписи.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Установка идентификатора поддержки для регламентных интервалов'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
								УровеньЖурналаРегистрации.Ошибка,,,
								ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ИнициализироватьФайлДанныхДляВыгрузки(ИмяФайла = "")
	
	ФайлДанных = Новый ЗаписьXML;
	Если ИмяФайла = "" Тогда
		ФайлДанных.УстановитьСтроку();
	Иначе
		ФайлДанных.ОткрытьФайл(ИмяФайла);
	КонецЕсли;
	ФайлДанных.ЗаписатьНачалоЭлемента("ВыгрузкаШаблоновПроцессов");
	
	ЗаписатьЭлемент("ДатаВыгрузки", ТекущаяДатаСеанса());
	
КонецПроцедуры

Функция ЗавершитьВыгрузку()

	ФайлДанных.ЗаписатьКонецЭлемента();
	
	Возврат ФайлДанных.Закрыть();

КонецФункции

Функция ДанныеВыгружаемыхШаблонов(СписокШаблонов)
	
	Для Каждого Шаблон Из СписокШаблонов Цикл
		ПолучитьДанныеСвязанныхШаблонов(Шаблон, СписокШаблонов);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовВлияниеНаДругиеПроцессы.ЗависимыйШаблон КАК ЗависимыйШаблон
	|ПОМЕСТИТЬ ЗависимыеШаблоны
	|ИЗ
	|	Справочник.ШаблоныПроцессов.ВлияниеНаДругиеПроцессы КАК ШаблоныПроцессовВлияниеНаДругиеПроцессы
	|ГДЕ
	|	ШаблоныПроцессовВлияниеНаДругиеПроцессы.Ссылка В(&СписокШаблонов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШаблоныПроцессовЭтапы.Этап КАК Этап
	|ПОМЕСТИТЬ Этапы
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	(ШаблоныПроцессовЭтапы.Ссылка В (&СписокШаблонов)
	|			ИЛИ ШаблоныПроцессовЭтапы.Ссылка В
	|				(ВЫБРАТЬ
	|					Т.ЗависимыйШаблон
	|				ИЗ
	|					ЗависимыеШаблоны КАК Т))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Роли.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ Роли
	|ИЗ
	|	(ВЫБРАТЬ
	|		ШаблоныПроцессовЭтапы.Исполнитель КАК Исполнитель
	|	ИЗ
	|		Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|	ГДЕ
	|		(ШаблоныПроцессовЭтапы.Ссылка В (&СписокШаблонов)
	|				ИЛИ ШаблоныПроцессовЭтапы.Ссылка В
	|					(ВЫБРАТЬ
	|						Т.ЗависимыйШаблон
	|					ИЗ
	|						ЗависимыеШаблоны КАК Т))
	|		И ТИПЗНАЧЕНИЯ(ШаблоныПроцессовЭтапы.Исполнитель) = ТИП(Справочник.РолиИсполнителей)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ШаблоныПроцессовИсполнителиГрупповыхЭтапов.Исполнитель
	|	ИЗ
	|		Справочник.ШаблоныПроцессов.ИсполнителиГрупповыхЭтапов КАК ШаблоныПроцессовИсполнителиГрупповыхЭтапов
	|	ГДЕ
	|		(ШаблоныПроцессовИсполнителиГрупповыхЭтапов.Ссылка В (&СписокШаблонов)
	|				ИЛИ ШаблоныПроцессовИсполнителиГрупповыхЭтапов.Ссылка В
	|					(ВЫБРАТЬ
	|						Т.ЗависимыйШаблон
	|					ИЗ
	|						ЗависимыеШаблоны КАК Т))
	|		И ТИПЗНАЧЕНИЯ(ШаблоныПроцессовИсполнителиГрупповыхЭтапов.Исполнитель) = ТИП(Справочник.РолиИсполнителей)) КАК Роли
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПроцессов.Ссылка КАК Ссылка,
	|	ШаблоныПроцессов.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	ШаблоныПроцессов.Наименование КАК Наименование,
	|	ШаблоныПроцессов.ИдентификаторДокумента.Имя КАК Документ,
	|	ШаблоныПроцессов.НачальныйСтатус.ИдентификаторПоддержки КАК НачальныйСтатус,
	|	ШаблоныПроцессов.Описание КАК Описание,
	|	ШаблоныПроцессов.ИспользоватьРеквизитДляРасчетаСроковОбработки КАК ИспользоватьРеквизитДляРасчетаСроковОбработки,
	|	ШаблоныПроцессов.РеквизитДляРасчетаСроковОбработки КАК РеквизитДляРасчетаСроковОбработки,
	|	ШаблоныПроцессов.РазрешенаОтправкаФормуляровКонтрагентамПоЭДО КАК РазрешенаОтправкаФормуляровКонтрагентамПоЭДО,
	|	ШаблоныПроцессов.НеИспользуется КАК НеИспользуется,
	|	ШаблоныПроцессов.ЕстьНастройкиФормированияИПодписанияФормуляров КАК ЕстьНастройкиФормированияИПодписанияФормуляров,
	|	ШаблоныПроцессов.Этапы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Исполнитель КАК Исполнитель,
	|		Этап.ИдентификаторПоддержки КАК Этап,
	|		ПредшественникиВариантИспользования КАК ПредшественникиВариантИспользования,
	|		ИмяРеквизитаОсновногоОбъектаАдресации КАК ИмяРеквизитаОсновногоОбъектаАдресации,
	|		ИмяРеквизитаДополнительногоОбъектаАдресации КАК ИмяРеквизитаДополнительногоОбъектаАдресации,
	|		Порядок КАК Порядок,
	|		ВключатьВШтампВизуализацииЭП КАК ВключатьВШтампВизуализацииЭП,
	|		ЗапретитьПроведениеОтменуПроведения КАК ЗапретитьПроведениеОтменуПроведения,
	|		ЗапретитьПерепроведение КАК ЗапретитьПерепроведение,
	|		СрокВыполненияЧасы КАК СрокВыполненияЧасы, 
	|		СрокиОбработкиПоРеквизитуДни КАК СрокиОбработкиПоРеквизитуДни,
	|		СрокиОбработкиПоРеквизитуЧасы КАК СрокиОбработкиПоРеквизитуЧасы,
	|		ЗапрещеноДобавлениеФайлов КАК ЗапрещеноДобавлениеФайлов,
	|		ЗапрещеноИзменениеФайлов КАК ЗапрещеноИзменениеФайлов,
	|		НаличиеФайловОбязательно КАК НаличиеФайловОбязательно,
	|		РасшифровкаОбязательныхПрисоединенныхФайлов КАК РасшифровкаОбязательныхПрисоединенныхФайлов,
	|		ПодписыватьФайлыЭП КАК ПодписыватьФайлыЭП,
	|		ИдентификаторыКомандПечатиСоШтампом КАК ИдентификаторыКомандПечатиСоШтампом,
	|		ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске КАК ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске,
	|		НеЗапрещатьОтменуВыполненияПриНаличииПрерванных КАК НеЗапрещатьОтменуВыполненияПриНаличииПрерванных,
	|		ОбособленнаяЗонаОтветственности КАК ОбособленнаяЗонаОтветственности,
	|		ЭтапВыполняетсяНесколькимиИсполнителями КАК ЭтапВыполняетсяНесколькимиИсполнителями,
	|		ИдентификаторЭтапаКуратора КАК ИдентификаторЭтапаКуратора,
	|		ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа КАК ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа,
	|		ОбменСЛичнымКабинетом КАК ОбменСЛичнымКабинетом,
	|		КодыНастройкиФормированияИПодписанияФормуляров КАК КодыНастройкиФормированияИПодписанияФормуляров
	|	) КАК Этапы,
	|	ШаблоныПроцессов.ПредшественникиЭтапов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторПоследователя КАК ИдентификаторПоследователя,
	|		ИдентификаторПредшественника КАК ИдентификаторПредшественника,
	|		УсловиеПерехода КАК УсловиеПерехода,
	|		УсловиеРассмотрения.ИдентификаторПоддержки КАК УсловиеРассмотрения,
	|		ЛюбаяЗадачаПредшественника КАК ЛюбаяЗадачаПредшественника
	|	) КАК ПредшественникиЭтапов,
	|	ШаблоныПроцессов.ПрерываниеЭтапов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторПоследователя КАК ИдентификаторПоследователя,
	|		ИдентификаторПредшественника КАК ИдентификаторПредшественника,
	|		УсловиеПерехода КАК УсловиеПерехода,
	|		УсловиеРассмотрения.ИдентификаторПоддержки КАК УсловиеРассмотрения,
	|		ЛюбаяЗадачаПредшественника КАК ЛюбаяЗадачаПредшественника
	|	) КАК ПрерываниеЭтапов,
	|	ШаблоныПроцессов.ОтветственностьЗаРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|		ИмяРеквизита КАК ИмяРеквизита
	|	) КАК ОтветственностьЗаРеквизиты,
	|	ШаблоныПроцессов.ИзменениеРеквизитовЭтапов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|		ИмяРеквизита КАК ИмяРеквизита
	|	) КАК ИзменениеРеквизитовЭтапов,
	|	ШаблоныПроцессов.ОбязательныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|		ИмяРеквизита КАК ИмяРеквизита
	|	) КАК ОбязательныеРеквизиты,
	|	ШаблоныПроцессов.НедоступныеРеквизиты.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|		ИмяРеквизита КАК ИмяРеквизита
	|	) КАК НедоступныеРеквизиты,
	|	ШаблоныПроцессов.ДополнительныеОбработчики.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Статус.ИдентификаторПоддержки КАК Статус,
	|		Обработчик КАК Обработчик,
	|		ОбработчикДоТранзакции КАК ОбработчикДоТранзакции,
	|		ОбработчикКлиентский КАК ОбработчикКлиентский
	|	) КАК ДополнительныеОбработчики, 
	|	ШаблоныПроцессов.УправлениеЭлементамиФормы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		ИмяЭлемента КАК ИмяЭлемента,
	|		ЗапретДоступности КАК ЗапретДоступности,
	|		ЗапретВидимости КАК ЗапретВидимости,
	|		ОтметкаНезаполненного КАК ОтметкаНезаполненного,
	|		СтартоваяСтраница КАК СтартоваяСтраница
	|	) КАК УправлениеЭлементамиФормы,
	|	ШаблоныПроцессов.ВлияниеНаДругиеПроцессы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Статус.ИдентификаторПоддержки КАК Статус,
	|		ЗависимыйШаблон.ИдентификаторПоддержки КАК ЗависимыйШаблон,
	|		ИдентификаторЭтапаЗависимогоШаблона КАК ИдентификаторЭтапаЗависимогоШаблона,
	|		УстанавливаемыйСтатус.ИдентификаторПоддержки КАК УстанавливаемыйСтатус,
	|		СвязьСОбъектом КАК СвязьСОбъектом
	|	) КАК ВлияниеНаДругиеПроцессы,
	|	ШаблоныПроцессов.ТребованияКПроведению.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Статус.ИдентификаторПоддержки КАК Статус,
	|		ПризнакПроведенности КАК ПризнакПроведенности
	|	) КАК ТребованияКПроведению,
	|	ШаблоныПроцессов.ТребованияКВыполнению.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Статус.ИдентификаторПоддержки КАК Статус,
	|		УсловиеВыполнения КАК УсловиеВыполнения
	|	) КАК ТребованияКВыполнению,
	|	ШаблоныПроцессов.ИнициирующиеСобытия.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Статус.ИдентификаторПоддержки КАК Статус,
	|		Событие КАК Событие
	|	) КАК ИнициирующиеСобытия,
	|	ШаблоныПроцессов.ИсполнителиГрупповыхЭтапов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		Исполнитель КАК Исполнитель,
	|		ИмяРеквизитаОсновногоОбъектаАдресации КАК ИмяРеквизитаОсновногоОбъектаАдресации,
	|		ИмяРеквизитаДополнительногоОбъектаАдресации КАК ИмяРеквизитаДополнительногоОбъектаАдресации
	|	) КАК ИсполнителиГрупповыхЭтапов
	|ИЗ
	|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|ГДЕ
	|	(ШаблоныПроцессов.Ссылка В (&СписокШаблонов)
	|			ИЛИ ШаблоныПроцессов.Ссылка В
	|				(ВЫБРАТЬ
	|					Т.ЗависимыйШаблон
	|				ИЗ
	|					ЗависимыеШаблоны КАК Т))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапыПроцессов.Ссылка КАК Ссылка,
	|	ЭтапыПроцессов.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	ЭтапыПроцессов.Наименование КАК Наименование,
	|	ЭтапыПроцессов.Описание КАК Описание,
	|	ЭтапыПроцессов.Комментарий КАК Комментарий,
	|	ЭтапыПроцессов.РезультатыВыполнения.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ПредставлениеРезультата КАК ПредставлениеРезультата,
	|		СтатусПослеВыполнения.ИдентификаторПоддержки КАК СтатусПослеВыполнения,
	|		ОтрицательныйРезультат КАК ОтрицательныйРезультат,
	|		ТребуетсяЭП КАК ТребуетсяЭП,
	|		ТребуетсяПростаяЭП КАК ТребуетсяПростаяЭП,
	|		Скрытый КАК Скрытый
	|	) КАК РезультатыВыполнения
	|ИЗ
	|	Справочник.ЭтапыПроцессов КАК ЭтапыПроцессов
	|ГДЕ
	|	ЭтапыПроцессов.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Этап
	|			ИЗ
	|				Этапы КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Ссылка,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения.Наименование КАК Наименование,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения.ИдентификаторПоддержки КАК ИдентификаторПоддержки
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Этап
	|			ИЗ
	|				Этапы КАК Т)
	|	И НЕ ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШаблоныПроцессов.НачальныйСтатус,
	|	ШаблоныПроцессов.НачальныйСтатус.Наименование,
	|	ШаблоныПроцессов.НачальныйСтатус.ИдентификаторПоддержки
	|ИЗ
	|	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	|ГДЕ
	|	(ШаблоныПроцессов.Ссылка В (&СписокШаблонов)
	|			ИЛИ ШаблоныПроцессов.Ссылка В
	|				(ВЫБРАТЬ
	|					Т.ЗависимыйШаблон
	|				ИЗ
	|					ЗависимыеШаблоны КАК Т))
	|	И НЕ ШаблоныПроцессов.НачальныйСтатус = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегламентныеИнтервалы.Ссылка КАК Ссылка,
	|	РегламентныеИнтервалы.Владелец.ИдентификаторПоддержки КАК Шаблон,
	|	РегламентныеИнтервалы.Наименование КАК Наименование,
	|	РегламентныеИнтервалы.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	РегламентныеИнтервалы.ИдентификаторНачальногоЭтапа КАК ИдентификаторНачальногоЭтапа,
	|	РегламентныеИнтервалы.ИдентификаторКонечногоЭтапа КАК ИдентификаторКонечногоЭтапа,
	|	РегламентныеИнтервалы.СрокЗависитОтВремениНачала КАК СрокЗависитОтВремениНачала,
	|	РегламентныеИнтервалы.ВремяНачала КАК ВремяНачала,
	|	РегламентныеИнтервалы.СрокВыполненияЧасы КАК СрокВыполненияЧасы,
	|	РегламентныеИнтервалы.СрокВыполненияДни КАК СрокВыполненияДни,
	|	РегламентныеИнтервалы.СпособУказанияВремениОкончания КАК СпособУказанияВремениОкончания,
	|	РегламентныеИнтервалы.ВремяОкончания КАК ВремяОкончания,
	|	РегламентныеИнтервалы.СрокВыполненияЧасыПосле КАК СрокВыполненияЧасыПосле,
	|	РегламентныеИнтервалы.СрокВыполненияДниПосле КАК СрокВыполненияДниПосле,
	|	РегламентныеИнтервалы.СпособУказанияВремениОкончанияПосле КАК СпособУказанияВремениОкончанияПосле,
	|	РегламентныеИнтервалы.ВремяОкончанияПосле КАК ВремяОкончанияПосле,
	|	РегламентныеИнтервалы.Этапы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|		СрокВыполненияЧасы КАК СрокВыполненияЧасы
	|	) КАК Этапы,
	|	РегламентныеИнтервалы.ПредшественникиЭтапов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ИдентификаторПоследователя КАК ИдентификаторПоследователя,
	|		ИдентификаторПредшественника КАК ИдентификаторПредшественника
	|	) КАК ПредшественникиЭтапов
	|ИЗ
	|	Справочник.РегламентныеИнтервалы КАК РегламентныеИнтервалы
	|ГДЕ
	|	(РегламентныеИнтервалы.Владелец В (&СписокШаблонов)
	|			ИЛИ РегламентныеИнтервалы.Владелец В
	|				(ВЫБРАТЬ
	|					Т.ЗависимыйШаблон
	|				ИЗ
	|					ЗависимыеШаблоны КАК Т))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РолиИсполнителей.Ссылка КАК Ссылка,
	|	РолиИсполнителей.Наименование КАК Наименование,
	|	РолиИсполнителей.КраткоеПредставление КАК КраткоеПредставление,
	|	РолиИсполнителей.ИспользуетсяСОбъектамиАдресации КАК ИспользуетсяСОбъектамиАдресации,
	|	РолиИсполнителей.ИспользуетсяБезОбъектовАдресации КАК ИспользуетсяБезОбъектовАдресации,
	|	РолиИсполнителей.Комментарий КАК Комментарий,
	|	ИдентификаторыПоддержки.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	РолиИсполнителей.ТипыОсновногоОбъектаАдресации.ТипЗначения КАК ТипыООАТипЗначения,
	|	РолиИсполнителей.ТипыОсновногоОбъектаАдресации.ИмяПредопределенныхДанных КАК ТипыООАИмяПредопределенныхДанных,
	|	РолиИсполнителей.ТипыДополнительногоОбъектаАдресации.ТипЗначения КАК ТипыДОАТипЗначения,
	|	РолиИсполнителей.ТипыДополнительногоОбъектаАдресации.ИмяПредопределенныхДанных КАК ТипыДОАИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.РолиИсполнителей КАК РолиИсполнителей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыПоддержкиРолейИсполнителей КАК ИдентификаторыПоддержки
	|		ПО РолиИсполнителей.Ссылка = ИдентификаторыПоддержки.РольИсполнителя
	|ГДЕ
	|	РолиИсполнителей.Ссылка В
	|			(ВЫБРАТЬ
	|				Т.Исполнитель
	|			ИЗ
	|				Роли КАК Т)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторПоддержки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкаИспользованияШаблонов.ИдентификаторДокумента.Имя КАК Документ,
	|	НастройкаИспользованияШаблонов.Шаблон.ИдентификаторПоддержки КАК Шаблон,
	|	НастройкаИспользованияШаблонов.УсловиеИспользования КАК УсловиеИспользования
	|ИЗ
	|	РегистрСведений.НастройкаИспользованияШаблонов КАК НастройкаИспользованияШаблонов
	|ГДЕ
	|	(НастройкаИспользованияШаблонов.Шаблон В (&СписокШаблонов)
	|			ИЛИ НастройкаИспользованияШаблонов.Шаблон В
	|				(ВЫБРАТЬ
	|					Т.ЗависимыйШаблон
	|				ИЗ
	|					ЗависимыеШаблоны КАК Т))";
	
	Запрос.УстановитьПараметр("СписокШаблонов", СписокШаблонов);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Функция ИдентификаторыРолейИсполнителей(ВыборкаРоли)
	
	ИдентификаторыРолей = Новый Соответствие;
	
	Пока ВыборкаРоли.Следующий() Цикл
		ИдентификаторыРолей.Вставить(ВыборкаРоли.Ссылка, ВыборкаРоли.ИдентификаторПоддержки);
	КонецЦикла;
	
	Возврат ИдентификаторыРолей;
	
Конецфункции

Процедура ВыгрузитьШаблонПроцесса(ВыборкаШаблоны, ИдентификаторыРолей)
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ШаблонПроцесса");
	
	ФайлДанных.ЗаписатьАтрибут("ИдентификаторПоддержки", Строка(ВыборкаШаблоны.ИдентификаторПоддержки));
	ФайлДанных.ЗаписатьАтрибут("Наименование", ВыборкаШаблоны.Наименование);
	ФайлДанных.ЗаписатьАтрибут("Документ", ВыборкаШаблоны.Документ);
	ФайлДанных.ЗаписатьАтрибут("НачальныйСтатус", Строка(ВыборкаШаблоны.НачальныйСтатус)); 

	ЗаписатьЭлемент("ИспользоватьРеквизитДляРасчетаСроковОбработки", ВыборкаШаблоны.ИспользоватьРеквизитДляРасчетаСроковОбработки);
	ЗаписатьЭлемент("РеквизитДляРасчетаСроковОбработки", ВыборкаШаблоны.РеквизитДляРасчетаСроковОбработки);
	
	ЗаписатьЭлемент("НеИспользуется", ВыборкаШаблоны.НеИспользуется);
	ЗаписатьЭлемент("ЕстьНастройкиФормированияИПодписанияФормуляров", ВыборкаШаблоны.ЕстьНастройкиФормированияИПодписанияФормуляров);
	ЗаписатьЭлемент("ОписаниеШаблона", ВыборкаШаблоны.Описание);

	ЗаписатьЭлемент("РазрешенаОтправкаФормуляровКонтрагентамПоЭДО", ВыборкаШаблоны.РазрешенаОтправкаФормуляровКонтрагентамПоЭДО);
	
	ФайлДанных.ЗаписатьНачалоЭлемента("Этапы");
	ВыборкаЭтапы = ВыборкаШаблоны.Этапы.Выбрать();
	Пока ВыборкаЭтапы.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ЭтапСтрока");
		
		ТипИсполнителя = ТипЗнч(ВыборкаЭтапы.Исполнитель);
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаЭтапы.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Этап", Строка(ВыборкаЭтапы.Этап));
		
		Если ТипИсполнителя = Тип("Строка") Тогда
			ЗаписатьЭлемент("Исполнитель", ВыборкаЭтапы.Исполнитель);
		ИначеЕсли ТипИсполнителя = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			ЗаписатьЭлемент("Исполнитель", ИдентификаторыРолей[ВыборкаЭтапы.Исполнитель]);
		Иначе
			ЗаписатьЭлемент("Исполнитель", "")
		КонецЕсли;
		
		ЗаписатьЭлемент("ПредшественникиВариантИспользования", ВыборкаЭтапы.ПредшественникиВариантИспользования);
		ЗаписатьЭлемент("ИмяРеквизитаОсновногоОбъектаАдресации", ВыборкаЭтапы.ИмяРеквизитаОсновногоОбъектаАдресации);
		ЗаписатьЭлемент("ИмяРеквизитаДополнительногоОбъектаАдресации", ВыборкаЭтапы.ИмяРеквизитаДополнительногоОбъектаАдресации);
		ЗаписатьЭлемент("Порядок", ВыборкаЭтапы.Порядок);
		ЗаписатьЭлемент("ВключатьВШтампВизуализацииЭП", ВыборкаЭтапы.ВключатьВШтампВизуализацииЭП);
		ЗаписатьЭлемент("ЗапретитьПроведениеОтменуПроведения", ВыборкаЭтапы.ЗапретитьПроведениеОтменуПроведения);
		ЗаписатьЭлемент("ЗапретитьПерепроведение", ВыборкаЭтапы.ЗапретитьПерепроведение);
		ЗаписатьЭлемент("СрокВыполненияЧасы", ВыборкаЭтапы.СрокВыполненияЧасы); 
		ЗаписатьЭлемент("СрокиОбработкиПоРеквизитуДни", ВыборкаЭтапы.СрокиОбработкиПоРеквизитуДни);
        ЗаписатьЭлемент("СрокиОбработкиПоРеквизитуЧасы", ВыборкаЭтапы.СрокиОбработкиПоРеквизитуЧасы);
		ЗаписатьЭлемент("ЗапрещеноДобавлениеФайлов", ВыборкаЭтапы.ЗапрещеноДобавлениеФайлов);
		ЗаписатьЭлемент("ЗапрещеноИзменениеФайлов", ВыборкаЭтапы.ЗапрещеноИзменениеФайлов);
		ЗаписатьЭлемент("НаличиеФайловОбязательно", ВыборкаЭтапы.НаличиеФайловОбязательно);
		ЗаписатьЭлемент("РасшифровкаОбязательныхПрисоединенныхФайлов", ВыборкаЭтапы.РасшифровкаОбязательныхПрисоединенныхФайлов);
		ЗаписатьЭлемент("ПодписыватьФайлыЭП", ВыборкаЭтапы.ПодписыватьФайлыЭП);
		ЗаписатьЭлемент("ИдентификаторыКомандПечатиСоШтампом", ВыборкаЭтапы.ИдентификаторыКомандПечатиСоШтампом);
		ЗаписатьЭлемент("ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске", ВыборкаЭтапы.ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске);
		ЗаписатьЭлемент("НеЗапрещатьОтменуВыполненияПриНаличииПрерванных", ВыборкаЭтапы.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных);
		ЗаписатьЭлемент("ОбособленнаяЗонаОтветственности", ВыборкаЭтапы.ОбособленнаяЗонаОтветственности);
		ЗаписатьЭлемент("ЭтапВыполняетсяНесколькимиИсполнителями", ВыборкаЭтапы.ЭтапВыполняетсяНесколькимиИсполнителями);
		ЗаписатьЭлемент("ИдентификаторЭтапаКуратора", ВыборкаЭтапы.ИдентификаторЭтапаКуратора);
		ЗаписатьЭлемент("ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа", ВыборкаЭтапы.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа);
		ЗаписатьЭлемент("ОбменСЛичнымКабинетом", ВыборкаЭтапы.ОбменСЛичнымКабинетом);
		ЗаписатьЭлемент("КодыНастройкиФормированияИПодписанияФормуляров", ВыборкаЭтапы.КодыНастройкиФормированияИПодписанияФормуляров);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ЭтапСтрока
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // Этапы
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ПредшественникиЭтапов");
	ВыборкаПредшественники = ВыборкаШаблоны.ПредшественникиЭтапов.Выбрать();
	Пока ВыборкаПредшественники.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ПредшественникиЭтапа");
		
		ЗаписатьЭлемент("ИдентификаторПоследователя", ВыборкаПредшественники.ИдентификаторПоследователя);
		ЗаписатьЭлемент("ИдентификаторПредшественника", ВыборкаПредшественники.ИдентификаторПредшественника);
		
		ЗаписатьЭлемент("УсловиеПерехода", ВыборкаПредшественники.УсловиеПерехода);
		ЗаписатьЭлемент("УсловиеРассмотрения", Строка(ВыборкаПредшественники.УсловиеРассмотрения));
		
		ЗаписатьЭлемент("ЛюбаяЗадачаПредшественника", ВыборкаПредшественники.ЛюбаяЗадачаПредшественника);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ПредшественникиЭтапа
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ПредшественникиЭтапов
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ПрерываниеЭтапов");
	ВыборкаПрерывание = ВыборкаШаблоны.ПрерываниеЭтапов.Выбрать();
	Пока ВыборкаПрерывание.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ПрерываниеЭтапа");
		
		ЗаписатьЭлемент("ИдентификаторПоследователя", ВыборкаПрерывание.ИдентификаторПоследователя);
		ЗаписатьЭлемент("ИдентификаторПредшественника", ВыборкаПрерывание.ИдентификаторПредшественника);
		
		ЗаписатьЭлемент("УсловиеПерехода", ВыборкаПрерывание.УсловиеПерехода);
		ЗаписатьЭлемент("УсловиеРассмотрения", Строка(ВыборкаПрерывание.УсловиеРассмотрения));
		
		ЗаписатьЭлемент("ЛюбаяЗадачаПредшественника", ВыборкаПрерывание.ЛюбаяЗадачаПредшественника);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ПрерываниеЭтапа
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ПрерываниеЭтапов
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ОтветственностьЗаРеквизиты");
	ТаблицаОтветственность = ВыборкаШаблоны.ОтветственностьЗаРеквизиты.Выгрузить();
	ТаблицаОтветственность.Сортировать("ИмяТабличнойЧасти, ИмяРеквизита, ИдентификаторЭтапа");
	Для Каждого ВыборкаОтветственность Из ТаблицаОтветственность Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ОтветственностьЗаРеквизит");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаОтветственность.ИдентификаторЭтапа);
		ЗаписатьЭлемент("ИмяТабличнойЧасти", ВыборкаОтветственность.ИмяТабличнойЧасти);
		ЗаписатьЭлемент("ИмяРеквизита", ВыборкаОтветственность.ИмяРеквизита);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ОтветственностьЗаРеквизит
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ОтветственностьЗаРеквизиты
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ИзменениеРеквизитовЭтапов");
	ТаблицаИзменение = ВыборкаШаблоны.ИзменениеРеквизитовЭтапов.Выгрузить();
	ТаблицаИзменение.Сортировать("ИмяТабличнойЧасти, ИмяРеквизита, ИдентификаторЭтапа");
	Для Каждого ВыборкаИзменение Из ТаблицаИзменение Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ИзменениеРеквизитовЭтапа");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаИзменение.ИдентификаторЭтапа);
		ЗаписатьЭлемент("ИмяТабличнойЧасти", ВыборкаИзменение.ИмяТабличнойЧасти);
		ЗаписатьЭлемент("ИмяРеквизита", ВыборкаИзменение.ИмяРеквизита);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ИзменениеРеквизитовЭтапа
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ИзменениеРеквизитовЭтапов
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ОбязательныеРеквизиты");
	ТаблицаОбязательность = ВыборкаШаблоны.ОбязательныеРеквизиты.Выгрузить();
	ТаблицаОбязательность.Сортировать("ИмяТабличнойЧасти, ИмяРеквизита, ИдентификаторЭтапа");
	Для Каждого ВыборкаОбязательность Из ТаблицаОбязательность Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ОбязательныйРеквизит");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаОбязательность.ИдентификаторЭтапа);
		ЗаписатьЭлемент("ИмяТабличнойЧасти", ВыборкаОбязательность.ИмяТабличнойЧасти);
		ЗаписатьЭлемент("ИмяРеквизита", ВыборкаОбязательность.ИмяРеквизита);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ОбязательныйРеквизит
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ОбязательныеРеквизиты
	
	ФайлДанных.ЗаписатьНачалоЭлемента("НедоступныеРеквизиты");
	ТаблицаНедоступность = ВыборкаШаблоны.НедоступныеРеквизиты.Выгрузить();
	ТаблицаНедоступность.Сортировать("ИмяТабличнойЧасти, ИмяРеквизита, ИдентификаторЭтапа");
	Для Каждого ВыборкаНедоступность Из ТаблицаНедоступность Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("НедоступныйРеквизит");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаНедоступность.ИдентификаторЭтапа);
		ЗаписатьЭлемент("ИмяТабличнойЧасти", ВыборкаНедоступность.ИмяТабличнойЧасти);
		ЗаписатьЭлемент("ИмяРеквизита", ВыборкаНедоступность.ИмяРеквизита);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // НедоступныйРеквизит
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // НедоступныеРеквизиты
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ДополнительныеОбработчики");
	ВыборкаОбработчики = ВыборкаШаблоны.ДополнительныеОбработчики.Выбрать();
	Пока ВыборкаОбработчики.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ДополнительныйОбработчик");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаОбработчики.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Статус", Строка(ВыборкаОбработчики.Статус));
		ЗаписатьЭлемент("Обработчик", ВыборкаОбработчики.Обработчик);
		ЗаписатьЭлемент("ОбработчикДоТранзакции", ВыборкаОбработчики.ОбработчикДоТранзакции);
		ЗаписатьЭлемент("ОбработчикКлиентский", ВыборкаОбработчики.ОбработчикКлиентский);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ДополнительныйОбработчик
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ДополнительныеОбработчики
	
	ФайлДанных.ЗаписатьНачалоЭлемента("УправлениеЭлементамиФормы"); //УправлениеЭлементамиФорм
	ВыборкаЭлементыФормы = ВыборкаШаблоны.УправлениеЭлементамиФормы.Выбрать();
	Пока ВыборкаЭлементыФормы.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ЭлементФормы"); // Элемент формы

		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаЭлементыФормы.ИдентификаторЭтапа);
		ЗаписатьЭлемент("ИмяЭлемента", ВыборкаЭлементыФормы.ИмяЭлемента);
		ЗаписатьЭлемент("ЗапретДоступности", ВыборкаЭлементыФормы.ЗапретДоступности);
		ЗаписатьЭлемент("ЗапретВидимости", ВыборкаЭлементыФормы.ЗапретВидимости);
		ЗаписатьЭлемент("ОтметкаНезаполненного", ВыборкаЭлементыФормы.ОтметкаНезаполненного);
		ЗаписатьЭлемент("СтартоваяСтраница", ВыборкаЭлементыФормы.СтартоваяСтраница);

		ФайлДанных.ЗаписатьКонецЭлемента(); // Элемент формы
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // УправлениеЭлементамиФормы

	ФайлДанных.ЗаписатьНачалоЭлемента("ВлияниеНаДругиеПроцессы");
	ВыборкаВлияние = ВыборкаШаблоны.ВлияниеНаДругиеПроцессы.Выбрать();
	Пока ВыборкаВлияние.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("Влияние");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаВлияние.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Статус", Строка(ВыборкаВлияние.Статус));
		ЗаписатьЭлемент("ЗависимыйШаблон", Строка(ВыборкаВлияние.ЗависимыйШаблон));
		ЗаписатьЭлемент("ИдентификаторЭтапаЗависимогоШаблона", ВыборкаВлияние.ИдентификаторЭтапаЗависимогоШаблона);
		ЗаписатьЭлемент("УстанавливаемыйСтатус", Строка(ВыборкаВлияние.УстанавливаемыйСтатус));
		ЗаписатьЭлемент("СвязьСОбъектом", ВыборкаВлияние.СвязьСОбъектом);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // Влияние
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ВлияниеНаДругиеПроцессы
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ТребованияКПроведению");
	ВыборкаТребования = ВыборкаШаблоны.ТребованияКПроведению.Выбрать();
	Пока ВыборкаТребования.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ТребованиеКПроведению");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаТребования.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Статус", Строка(ВыборкаТребования.Статус));
		ЗаписатьЭлемент("ПризнакПроведенности", ВыборкаТребования.ПризнакПроведенности);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ТребованиеКПроведению
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ТребованияКПроведению
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ТребованияКВыполнению");
	ВыборкаТребования = ВыборкаШаблоны.ТребованияКВыполнению.Выбрать();
	Пока ВыборкаТребования.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ТребованиеКВыполнению");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаТребования.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Статус", Строка(ВыборкаТребования.Статус));
		ЗаписатьЭлемент("УсловиеВыполнения", ВыборкаТребования.УсловиеВыполнения);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ТребованиеКВыполнению
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ТребованияКВыполнению
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ИнициирующиеСобытия");
	ВыборкаСобытия = ВыборкаШаблоны.ИнициирующиеСобытия.Выбрать();
	Пока ВыборкаСобытия.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ИнициирующееСобытие");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаСобытия.ИдентификаторЭтапа);
		ЗаписатьЭлемент("Статус", Строка(ВыборкаСобытия.Статус));
		ЗаписатьЭлемент("Событие", ВыборкаСобытия.Событие);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ИнициирующееСобытие
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ИнициирующиеСобытия
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ИсполнителиГрупповыхЭтапов");
	ВыборкаИсполнители = ВыборкаШаблоны.ИсполнителиГрупповыхЭтапов.Выбрать();
	Пока ВыборкаИсполнители.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ИсполнительГрупповогоЭтапа");
		
		ТипИсполнителя = ТипЗнч(ВыборкаИсполнители.Исполнитель);
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаИсполнители.ИдентификаторЭтапа);
		
		Если ТипИсполнителя = Тип("Строка") Тогда
			ЗаписатьЭлемент("Исполнитель", ВыборкаИсполнители.Исполнитель);
		ИначеЕсли ТипИсполнителя = Тип("СправочникСсылка.РолиИсполнителей") Тогда
			ЗаписатьЭлемент("Исполнитель", ИдентификаторыРолей[ВыборкаИсполнители.Исполнитель]);
		Иначе
			ЗаписатьЭлемент("Исполнитель", "")
		КонецЕсли;
		
		ЗаписатьЭлемент("ИмяРеквизитаОсновногоОбъектаАдресации", ВыборкаИсполнители.ИмяРеквизитаОсновногоОбъектаАдресации);
		ЗаписатьЭлемент("ИмяРеквизитаДополнительногоОбъектаАдресации", ВыборкаИсполнители.ИмяРеквизитаДополнительногоОбъектаАдресации);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ИсполнительГрупповогоЭтапа
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ИсполнителиГрупповыхЭтапов
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // ШаблонПроцесса
	
КонецПроцедуры

Процедура ВыгрузитьЭтапПроцесса(ВыборкаЭтапы)

	ФайлДанных.ЗаписатьНачалоЭлемента("ЭтапПроцесса");
	
	ФайлДанных.ЗаписатьАтрибут("ИдентификаторПоддержки", Строка(ВыборкаЭтапы.ИдентификаторПоддержки));
	ФайлДанных.ЗаписатьАтрибут("Наименование", ВыборкаЭтапы.Наименование);
	
	ЗаписатьЭлемент("ОписаниеЭтапа", ВыборкаЭтапы.Описание);
	ЗаписатьЭлемент("КомментарийЭтапа", ВыборкаЭтапы.Комментарий);
	
	ФайлДанных.ЗаписатьНачалоЭлемента("РезультатыВыполнения");
	Для Каждого ВыборкаРезультатыВыполнения Из ВыборкаЭтапы.РезультатыВыполнения Цикл;
		ФайлДанных.ЗаписатьНачалоЭлемента("РезультатВыполнения");
		
		ЗаписатьЭлемент("ПредставлениеРезультата", ВыборкаРезультатыВыполнения.ПредставлениеРезультата);
		ЗаписатьЭлемент("СтатусПослеВыполнения", Строка(ВыборкаРезультатыВыполнения.СтатусПослеВыполнения));
		ЗаписатьЭлемент("ОтрицательныйРезультат", ВыборкаРезультатыВыполнения.ОтрицательныйРезультат);
		ЗаписатьЭлемент("ТребуетсяЭП", ВыборкаРезультатыВыполнения.ТребуетсяЭП);
		ЗаписатьЭлемент("ТребуетсяПростаяЭП", ВыборкаРезультатыВыполнения.ТребуетсяПростаяЭП);
		ЗаписатьЭлемент("Скрытый", ВыборкаРезультатыВыполнения.Скрытый);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // РезультатВыполнения
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // РезультатыВыполнения
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // ЭтапПроцесса
	
КонецПроцедуры

Процедура ВыгрузитьСтатус(ВыборкаСтатусы)
	
	ФайлДанных.ЗаписатьНачалоЭлемента("СтатусДокумента");
	
	ФайлДанных.ЗаписатьАтрибут("ИдентификаторПоддержки", Строка(ВыборкаСтатусы.ИдентификаторПоддержки));
	ФайлДанных.ЗаписатьАтрибут("Наименование", ВыборкаСтатусы.Наименование);
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // СтатусДокумента
	
КонецПроцедуры

Процедура ВыгрузитьРегламентныйИнтервал(ВыборкаИнтервалы)

	ФайлДанных.ЗаписатьНачалоЭлемента("РегламентныйИнтервал");
	
	ФайлДанных.ЗаписатьАтрибут("ИдентификаторПоддержки", Строка(ВыборкаИнтервалы.ИдентификаторПоддержки));
	ФайлДанных.ЗаписатьАтрибут("Наименование", ВыборкаИнтервалы.Наименование);
	ФайлДанных.ЗаписатьАтрибут("Шаблон", Строка(ВыборкаИнтервалы.Шаблон));
	
	ЗаписатьЭлемент("ИдентификаторНачальногоЭтапа", ВыборкаИнтервалы.ИдентификаторНачальногоЭтапа);
	ЗаписатьЭлемент("ИдентификаторКонечногоЭтапа", ВыборкаИнтервалы.ИдентификаторКонечногоЭтапа);
	ЗаписатьЭлемент("СрокЗависитОтВремениНачала", ВыборкаИнтервалы.СрокЗависитОтВремениНачала);
	ЗаписатьЭлемент("ВремяНачала", ВыборкаИнтервалы.ВремяНачала);
	ЗаписатьЭлемент("СрокВыполненияЧасы", ВыборкаИнтервалы.СрокВыполненияЧасы);
	ЗаписатьЭлемент("СрокВыполненияДни", ВыборкаИнтервалы.СрокВыполненияДни);
	ЗаписатьЭлемент("СпособУказанияВремениОкончания", ВыборкаИнтервалы.СпособУказанияВремениОкончания);
	ЗаписатьЭлемент("ВремяОкончания", ВыборкаИнтервалы.ВремяОкончания);
	ЗаписатьЭлемент("СрокВыполненияЧасыПосле", ВыборкаИнтервалы.СрокВыполненияЧасыПосле);
	ЗаписатьЭлемент("СрокВыполненияДниПосле", ВыборкаИнтервалы.СрокВыполненияДниПосле);
	ЗаписатьЭлемент("СпособУказанияВремениОкончанияПосле", ВыборкаИнтервалы.СпособУказанияВремениОкончанияПосле);
	ЗаписатьЭлемент("ВремяОкончанияПосле", ВыборкаИнтервалы.ВремяОкончанияПосле);
	
	ФайлДанных.ЗаписатьНачалоЭлемента("Этапы");
	ВыборкаЭтапы = ВыборкаИнтервалы.Этапы.Выбрать();
	Пока ВыборкаЭтапы.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ЭтапСтрока");
		
		ЗаписатьЭлемент("ИдентификаторЭтапа", ВыборкаЭтапы.ИдентификаторЭтапа);
		ЗаписатьЭлемент("СрокВыполненияЧасы", ВыборкаЭтапы.СрокВыполненияЧасы);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ЭтапСтрока
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // Этапы
	
	ФайлДанных.ЗаписатьНачалоЭлемента("ПредшественникиЭтаповИнтервала");
	ВыборкаПредшественники = ВыборкаИнтервалы.ПредшественникиЭтапов.Выбрать();
	Пока ВыборкаПредшественники.Следующий() Цикл
		ФайлДанных.ЗаписатьНачалоЭлемента("ПредшественникиЭтапа");
		
		ЗаписатьЭлемент("ИдентификаторПоследователя", ВыборкаПредшественники.ИдентификаторПоследователя);
		ЗаписатьЭлемент("ИдентификаторПредшественника", ВыборкаПредшественники.ИдентификаторПредшественника);
		
		ФайлДанных.ЗаписатьКонецЭлемента(); // ПредшественникиЭтапа
	КонецЦикла;
	ФайлДанных.ЗаписатьКонецЭлемента(); // ПредшественникиЭтаповИнтервала
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // РегламентныйИнтервал
	
КонецПроцедуры

Процедура ВыгрузитьРольИсполнителя(ВыборкаРоли)
	
	ФайлДанных.ЗаписатьНачалоЭлемента("РольИсполнителя");
	
	ФайлДанных.ЗаписатьАтрибут("ИдентификаторПоддержки", Строка(ВыборкаРоли.ИдентификаторПоддержки));
	ФайлДанных.ЗаписатьАтрибут("Наименование", ВыборкаРоли.Наименование);
	
	ЗаписатьЭлемент("КраткоеПредставление", ВыборкаРоли.КраткоеПредставление);
	ЗаписатьЭлемент("ИспользуетсяСОбъектамиАдресации", ВыборкаРоли.ИспользуетсяСОбъектамиАдресации);
	ЗаписатьЭлемент("ИспользуетсяБезОбъектовАдресации", ВыборкаРоли.ИспользуетсяБезОбъектовАдресации);
	ЗаписатьЭлемент("ТипыООАИмяПредопределенныхДанных", ВыборкаРоли.ТипыООАИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(ВыборкаРоли.ТипыООАТипЗначения) Тогда
		Типы = Новый Массив;
		Для Каждого Тип Из ВыборкаРоли.ТипыООАТипЗначения.Типы() Цикл
			Типы.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
		КонецЦикла;
		ЗаписатьЭлемент("ТипыООАТипЗначения", СтрСоединить(Типы, ","));
	Иначе
		ЗаписатьЭлемент("ТипыООАТипЗначения", "");
	КонецЕсли;
	ЗаписатьЭлемент("ТипыДОАИмяПредопределенныхДанных", ВыборкаРоли.ТипыДОАИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(ВыборкаРоли.ТипыДОАТипЗначения) Тогда
		Типы = Новый Массив;
		Для Каждого Тип Из ВыборкаРоли.ТипыДОАТипЗначения.Типы() Цикл
			Типы.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
		КонецЦикла;
		ЗаписатьЭлемент("ТипыДОАТипЗначения", СтрСоединить(Типы, ","));
	Иначе
		ЗаписатьЭлемент("ТипыДОАТипЗначения", "");
	КонецЕсли;
	ЗаписатьЭлемент("Комментарий", ВыборкаРоли.Комментарий);
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // РольИсполнителя
	
КонецПроцедуры

Процедура ВыгрузитьНастройкиИспользования(Выборка)

	ФайлДанных.ЗаписатьНачалоЭлемента("НастройкаИспользования");
	
	ФайлДанных.ЗаписатьАтрибут("Документ", Выборка.Документ);
	ФайлДанных.ЗаписатьАтрибут("Шаблон", Строка(Выборка.Шаблон));
	
	ЗаписатьЭлемент("УсловиеИспользования", Выборка.УсловиеИспользования);
	
	ФайлДанных.ЗаписатьКонецЭлемента(); // НастройкаИспользования
	
КонецПроцедуры

Процедура ЗаписатьЭлемент(ИмяЭлемента, ЗначениеЭлемента, Атрибуты = Неопределено)

	ФайлДанных.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	Если Атрибуты <> Неопределено Тогда
		Для Каждого ТекАтрибут Из Атрибуты Цикл
			ФайлДанных.ЗаписатьАтрибут(ТекАтрибут.Ключ, ТекАтрибут.Значение);
		КонецЦикла;
	КонецЕсли;
	ФайлДанных.ЗаписатьТекст(XMLСтрока(ЗначениеЭлемента));
	ФайлДанных.ЗаписатьКонецЭлемента();

КонецПроцедуры

Процедура ЗагрузитьСтатусыДокументов(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "СтатусДокумента" Тогда
				
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если Не ЗаписатьОбъект Тогда
					Продолжить;
				КонецЕсли;
				
				СтатусСсылка = СоответствияОбъектов.СоответствиеСтатусов.Получить(ИдентификаторПоддержки);
				
				Если СтатусСсылка.Пустая() Тогда
					СтатусОбъект = Справочники.СтатусыДокументов.СоздатьЭлемент();
					СтатусОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					СтатусОбъект.Наименование = Наименование;
					СтатусОбъект.Записать();
					
					СтатусСсылка = СтатусОбъект.Ссылка;
					СоответствияОбъектов.СоответствиеСтатусов.Вставить(ИдентификаторПоддержки, СтатусСсылка)
				Иначе
					СтатусОбъект = СтатусСсылка.ПолучитьОбъект();
					НадоЗаписать = Ложь;
					ПроверитьУстановитьЗначениеРеквизита(СтатусОбъект, "ИдентификаторПоддержки", Новый УникальныйИдентификатор(ИдентификаторПоддержки), НадоЗаписать);
					ПроверитьУстановитьЗначениеРеквизита(СтатусОбъект, "Наименование", Наименование, НадоЗаписать);
					Если НадоЗаписать Тогда
						СтатусОбъект.Записать();
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "СтатусыДокументов" Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЭтапыПроцессов(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "ЭтапПроцесса" Тогда
				
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если НЕ ЗаписатьОбъект Тогда
					ЭтапОбъект = Справочники.ЭтапыПроцессов.СоздатьЭлемент();
					Продолжить;
				КонецЕсли;
				
				ЭтапСсылка = СоответствияОбъектов.СоответствиеЭтапов.Получить(ИдентификаторПоддержки);
				
				Если ЭтапСсылка.Пустая() Тогда
					
					ЭтапОбъект = Справочники.ЭтапыПроцессов.СоздатьЭлемент();
					ЭтапОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					ЭтапОбъект.Наименование = Наименование;
					
					НоваяСсылка = Справочники.ЭтапыПроцессов.ПолучитьСсылку();
					СоответствияОбъектов.СоответствиеЭтапов.Вставить(ИдентификаторПоддержки, НоваяСсылка);
					
					ЭтапОбъект.УстановитьСсылкуНового(НоваяСсылка);
					
				Иначе
					ЭтапОбъект = ЭтапСсылка.ПолучитьОбъект();
					ПроверитьУстановитьЗначениеРеквизита(ЭтапОбъект, "ИдентификаторПоддержки", Новый УникальныйИдентификатор(ИдентификаторПоддержки));
					ПроверитьУстановитьЗначениеРеквизита(ЭтапОбъект, "Наименование", Наименование);
					ЭтапОбъект.РезультатыВыполнения.Очистить();
				КонецЕсли;
				
			ИначеЕсли ФайлДанных.Имя = "ОписаниеЭтапа" Тогда
				
				ЭтапОбъект.Описание = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			ИначеЕсли ФайлДанных.Имя = "КомментарийЭтапа" Тогда
				
				ЭтапОбъект.Комментарий = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			ИначеЕсли ФайлДанных.Имя = "РезультатыВыполнения" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "РезультатыВыполнения" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "РезультатВыполнения" Тогда
						НовыйРезультатВыполнения = ЭтапОбъект.РезультатыВыполнения.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ПредставлениеРезультата" Тогда
						
						НовыйРезультатВыполнения[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					ИначеЕсли ИмяУзла = "СтатусПослеВыполнения" Тогда
						
						НовыйРезультатВыполнения[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ОтрицательныйРезультат"
						ИЛИ ИмяУзла = "ТребуетсяЭП"
						ИЛИ ИмяУзла = "ТребуетсяПростаяЭП"
						ИЛИ ИмяУзла = "Скрытый" Тогда
						
						НовыйРезультатВыполнения[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ЭтапПроцесса"
			И ЗаписатьОбъект Тогда
			
			ЭтапОбъект.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ЭтапыПроцессов" Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьШаблоныПроцессов(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки, 
	ЗагружатьИсполнителей, ЗагружатьНастройкиСвойствЭлементов = Ложь)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	// файл надо обойти два раза из-за возможной ошибки при обратном порядке
	// загрузки новых влияющих и зависимых шаблонов
	Пока ФайлДанных.Прочитать() Цикл
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			Если ФайлДанных.Имя = "ШаблонПроцесса" Тогда
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				ШаблонСсылка = СоответствияОбъектов.СоответствиеШаблонов.Получить(ИдентификаторПоддержки);
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если НЕ ЗаписатьОбъект Тогда
					ШаблонОбъект = Справочники.ШаблоныПроцессов.СоздатьЭлемент();
					Продолжить;
				КонецЕсли;
				
				Если ШаблонСсылка.Пустая() Тогда
					
					ИсполнителиЭтапов = Неопределено;
					ИсполнителиГрупповыхЭтапов = Неопределено;
					
					ШаблонОбъект = Справочники.ШаблоныПроцессов.СоздатьЭлемент();
					ШаблонОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					
					НоваяСсылка = Справочники.ШаблоныПроцессов.ПолучитьСсылку();
					СоответствияОбъектов.СоответствиеШаблонов.Вставить(ИдентификаторПоддержки, НоваяСсылка);
					ШаблонОбъект.УстановитьСсылкуНового(НоваяСсылка);
					
				Иначе
					// если ссылка уже есть, то требуется сразу перезаполнить таблицу влияний для корректной записи зависимых шаблонов
					ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
					
					// Сохранение текущих исполнителей этапов в таблицу значений
					ИсполнителиЭтапов = ШаблонОбъект.Этапы.Выгрузить( ,
						"ИдентификаторЭтапа, Этап, Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,"
						+ "ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
					
					ЭтапыПоИдентификаторам = Новый Соответствие;
					Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
						ЭтапыПоИдентификаторам.Вставить(Этап.ИдентификаторЭтапа, Этап.Этап);
					КонецЦикла;
					
					ИсполнителиГрупповыхЭтапов = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Выгрузить( ,
						"ИдентификаторЭтапа, Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,"
						+ "ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
					
					ШаблонОбъект.Этапы.Очистить();
					ШаблонОбъект.ВлияниеНаДругиеПроцессы.Очистить();
					ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Очистить();
					
				КонецЕсли;
				
			ИначеЕсли ФайлДанных.Имя = "Этапы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "Этапы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ЭтапСтрока" Тогда
						НоваяСтрока = ШаблонОбъект.Этапы.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Этап" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеЭтапов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Исполнитель" Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							// это роль исполнителя
							НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеРолей.Получить(ИсполнительИзФайла);
						ИначеЕсли ИсполнительИзФайла = "" Тогда
							// это пользователь, не загружается
						Иначе
							// это функция либо предопределенная роль (например "Автор документа")
							НоваяСтрока[ИмяУзла] = ИсполнительИзФайла
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ВлияниеНаДругиеПроцессы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ВлияниеНаДругиеПроцессы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "Влияние" Тогда
						НоваяСтрока = ШаблонОбъект.ВлияниеНаДругиеПроцессы.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа"
						ИЛИ ИмяУзла = "ИдентификаторЭтапаЗависимогоШаблона" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус"
						ИЛИ ИмяУзла = "УстанавливаемыйСтатус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ЗависимыйШаблон" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеШаблонов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "СвязьСОбъектом" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИсполнителиГрупповыхЭтапов" И ЗагружатьИсполнителей Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИсполнителиГрупповыхЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИсполнительГрупповогоЭтапа" Тогда
						НоваяСтрока = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Исполнитель" Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							// это роль исполнителя
							НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеРолей.Получить(ИсполнительИзФайла);
						ИначеЕсли ИсполнительИзФайла = "" Тогда
							// это пользователь, не загружается
						Иначе
							// это функция либо предопределенная роль (например "Автор документа")
							НоваяСтрока[ИмяУзла] = ИсполнительИзФайла
						КонецЕсли;
						
					ИначеЕсли ИмяУзла = "ИмяРеквизитаОсновногоОбъектаАдресации"
						ИЛИ ИмяУзла = "ИмяРеквизитаДополнительногоОбъектаАдресации" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ШаблонПроцесса"
			И ЗаписатьОбъект Тогда
			
			// Заполнение исполнителей этапов согласно сохраненных значений
			Если ИсполнителиЭтапов <> Неопределено Тогда
				Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
					
					Если ЗагружатьИсполнителей Тогда
						Если ТипЗнч(Этап.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
							// При флаге "загружать исполнителей" для ролей необходимо восстановить объекты адресации
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
							ПараметрыОтбора.Вставить("Этап", Этап.Этап);
							ПараметрыОтбора.Вставить("Исполнитель", Этап.Исполнитель);
							МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
							Если МассивСтрок.Количество() > 0 Тогда
								ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
									"ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации");
							КонецЕсли;
						ИначеЕсли ТипЗнч(Этап.Исполнитель) = Тип("Строка") Тогда
							Продолжить;
						ИначеЕсли Этап.Исполнитель = Неопределено Тогда
							// При флаге "загружать исполнителей" для пользователей необходимо их восстановить
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
							ПараметрыОтбора.Вставить("Этап", Этап.Этап);
							МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
							Если МассивСтрок.Количество() > 0 Тогда
								ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
									"Исполнитель");
							КонецЕсли;
						КонецЕсли;
					Иначе
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
						ПараметрыОтбора.Вставить("Этап", Этап.Этап);
						МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
						Если МассивСтрок.Количество() > 0 Тогда
							ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
								"Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации"
								+ ", ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			// Заполнение исполнителей групповых этапов согласно сохраненных значений
			Если ИсполнителиГрупповыхЭтапов <> Неопределено Тогда
				Если НЕ ЗагружатьИсполнителей Тогда
					
					НовыеЭтапыПоИдентификаторам = Новый Соответствие;
					Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
						НовыеЭтапыПоИдентификаторам.Вставить(Этап.ИдентификаторЭтапа, Этап.Этап);
					КонецЦикла;
					
					Для Каждого ИсполнительГрупповогоЭтапа Из ИсполнителиГрупповыхЭтапов Цикл
						// Если идентификатор этапа не найден в новых этапах, то строку не добавляем
						Если НовыеЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						// Если идентификатор этапа стал указывать на другой этап, то строку не добавляем
						Если НовыеЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] <>
							ЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] Тогда
							Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить(), ИсполнительГрупповогоЭтапа);
						
					КонецЦикла;
					
				Иначе
					
					// Если в загруженных групповых исполнителях есть пользователи,
					// то заполняем вместо них сохраненных пользователей (в рамках этапов)
					ИдентификаторыГрупповыхЭтаповСПользователями = Новый Соответствие;
					
					ПараметрыОтбора = Новый Структура("Исполнитель", Неопределено);
					МассивСтрокКУдалению = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.НайтиСтроки(ПараметрыОтбора);
					Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
						ИдентификаторыГрупповыхЭтаповСПользователями.Вставить(СтрокаКУдалению.ИдентификаторЭтапа, Истина);
						ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Удалить(СтрокаКУдалению);
					КонецЦикла;
					
					Для Каждого ИсполнительГрупповогоЭтапа Из ИсполнителиГрупповыхЭтапов Цикл
						Если ИдентификаторыГрупповыхЭтаповСПользователями[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] <> Неопределено
							И ТипЗнч(ИсполнительГрупповогоЭтапа.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
							ЗаполнитьЗначенияСвойств(ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить(), ИсполнительГрупповогоЭтапа);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			ШаблонОбъект.ОбменДанными.Загрузка = Истина;
			ШаблонОбъект.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ШаблоныПроцессов" Тогда
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			Если ФайлДанных.Имя = "ШаблонПроцесса" Тогда
				
				Документ = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ."
					+ ФайлДанных.ПолучитьАтрибут("Документ"));
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если НЕ ЗаписатьОбъект Тогда
					ШаблонОбъект = Справочники.ШаблоныПроцессов.СоздатьЭлемент();
					Продолжить;
				КонецЕсли;
				
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				НачальныйСтатус = СоответствияОбъектов.СоответствиеСтатусов.Получить(ФайлДанных.ПолучитьАтрибут("НачальныйСтатус"));
				
				ШаблонСсылка = СоответствияОбъектов.СоответствиеШаблонов.Получить(ИдентификаторПоддержки);
				Если ШаблонСсылка.Пустая() Тогда
					
					ИсполнителиЭтапов = Неопределено;
					ИсполнителиГрупповыхЭтапов = Неопределено;
					
					ШаблонОбъект = Справочники.ШаблоныПроцессов.СоздатьЭлемент();
					ШаблонОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					ШаблонОбъект.Наименование = Наименование;
					ШаблонОбъект.ИдентификаторДокумента = Документ;
					ШаблонОбъект.НачальныйСтатус = НачальныйСтатус;
					
					НоваяСсылка = Справочники.ШаблоныПроцессов.ПолучитьСсылку();
					СоответствияОбъектов.СоответствиеШаблонов.Вставить(ИдентификаторПоддержки, НоваяСсылка);
					
					ШаблонОбъект.УстановитьСсылкуНового(НоваяСсылка);
					
				Иначе
					
					ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
					
					// Сохранение текущих исполнителей этапов в таблицу значений
					ИсполнителиЭтапов = ШаблонОбъект.Этапы.Выгрузить( ,
						"ИдентификаторЭтапа, Этап, Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,"
						+ "ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
					
					ЭтапыПоИдентификаторам = Новый Соответствие;
					Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
						ЭтапыПоИдентификаторам.Вставить(Этап.ИдентификаторЭтапа, Этап.Этап);
					КонецЦикла;
					
					ИсполнителиГрупповыхЭтапов = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Выгрузить( ,
						"ИдентификаторЭтапа, Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,"
						+ "ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
					
					ПроверитьУстановитьЗначениеРеквизита(ШаблонОбъект, "ИдентификаторПоддержки", Новый УникальныйИдентификатор(ИдентификаторПоддержки));
					ПроверитьУстановитьЗначениеРеквизита(ШаблонОбъект, "Наименование", Наименование);
					ПроверитьУстановитьЗначениеРеквизита(ШаблонОбъект, "ИдентификаторДокумента", Документ);
					ПроверитьУстановитьЗначениеРеквизита(ШаблонОбъект, "НачальныйСтатус", НачальныйСтатус);
					
					ШаблонОбъект.Этапы.Очистить();
					ШаблонОбъект.ПредшественникиЭтапов.Очистить();
					ШаблонОбъект.ПрерываниеЭтапов.Очистить();
					ШаблонОбъект.ОтветственностьЗаРеквизиты.Очистить();
					ШаблонОбъект.ИзменениеРеквизитовЭтапов.Очистить();
					ШаблонОбъект.ОбязательныеРеквизиты.Очистить();
					ШаблонОбъект.НедоступныеРеквизиты.Очистить();
					ШаблонОбъект.ДополнительныеОбработчики.Очистить();
					ШаблонОбъект.ВлияниеНаДругиеПроцессы.Очистить();
					ШаблонОбъект.ТребованияКПроведению.Очистить();
					ШаблонОбъект.ТребованияКВыполнению.Очистить();
					ШаблонОбъект.ИнициирующиеСобытия.Очистить();
					ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Очистить();
					Если ЗагружатьНастройкиСвойствЭлементов Тогда
						ШаблонОбъект.УправлениеЭлементамиФормы.Очистить();
					КонецЕсли;	
					
				КонецЕсли;
				
			ИначеЕсли ФайлДанных.Имя = "ОписаниеШаблона" Тогда
				
				ШаблонОбъект.Описание = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);

			ИначеЕсли ФайлДанных.Имя = "РеквизитДляРасчетаСроковОбработки" Тогда

				ШаблонОбъект.РеквизитДляРасчетаСроковОбработки = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			ИначеЕсли ФайлДанных.Имя = "ИспользоватьРеквизитДляРасчетаСроковОбработки" Тогда

				ШаблонОбъект.ИспользоватьРеквизитДляРасчетаСроковОбработки = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
	
			ИначеЕсли ФайлДанных.Имя = "НеИспользуется" Тогда
				
				ШаблонОбъект.НеИспользуется = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));

			ИначеЕсли ФайлДанных.Имя = "ЕстьНастройкиФормированияИПодписанияФормуляров" Тогда
				
				ШаблонОбъект.ЕстьНастройкиФормированияИПодписанияФормуляров = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));

			ИначеЕсли ФайлДанных.Имя = "РазрешенаОтправкаФормуляровКонтрагентамПоЭДО" Тогда
				
				ШаблонОбъект.РазрешенаОтправкаФормуляровКонтрагентамПоЭДО = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "Этапы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "Этапы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ЭтапСтрока" Тогда
						НоваяСтрока = ШаблонОбъект.Этапы.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа"
						ИЛИ ИмяУзла = "ИдентификаторЭтапаКуратора" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Этап" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеЭтапов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ПредшественникиВариантИспользования"
						ИЛИ ИмяУзла = "ИмяРеквизитаОсновногоОбъектаАдресации"
						ИЛИ ИмяУзла = "ИмяРеквизитаДополнительногоОбъектаАдресации"
						ИЛИ ИмяУзла = "КодыНастройкиФормированияИПодписанияФормуляров"
						ИЛИ ИмяУзла = "РасшифровкаОбязательныхПрисоединенныхФайлов"
						ИЛИ ИмяУзла = "ИдентификаторыКомандПечатиСоШтампом" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					ИначеЕсли ИмяУзла = "Порядок"
						ИЛИ ИмяУзла = "СрокиОбработкиПоРеквизитуДни"
						ИЛИ ИмяУзла = "СрокиОбработкиПоРеквизитуЧасы"
						ИЛИ ИмяУзла = "СрокВыполненияЧасы" Тогда
						
						НоваяСтрока[ИмяУзла] = Число(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ВключатьВШтампВизуализацииЭП"
						ИЛИ ИмяУзла = "ЗапретитьПроведениеОтменуПроведения"
						ИЛИ ИмяУзла = "ЗапретитьПерепроведение"
						ИЛИ ИмяУзла = "ЗапрещеноДобавлениеФайлов"
						ИЛИ ИмяУзла = "ЗапрещеноИзменениеФайлов"
						ИЛИ ИмяУзла = "НаличиеФайловОбязательно"
						ИЛИ ИмяУзла = "ПодписыватьФайлыЭП"
						ИЛИ ИмяУзла = "ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске"
						ИЛИ ИмяУзла = "НеЗапрещатьОтменуВыполненияПриНаличииПрерванных"
						ИЛИ ИмяУзла = "ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа"
						ИЛИ ИмяУзла = "ОбособленнаяЗонаОтветственности"
						ИЛИ ИмяУзла = "ОбменСЛичнымКабинетом"
						ИЛИ ИмяУзла = "ЭтапВыполняетсяНесколькимиИсполнителями" Тогда
						
						НоваяСтрока[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Исполнитель" И ЗагружатьИсполнителей Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							// это роль исполнителя
							НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеРолей.Получить(ИсполнительИзФайла);
						ИначеЕсли ИсполнительИзФайла = "" Тогда
							// это пользователь, не загружается
						Иначе
							// это функция либо предопределенная роль (например "Автор документа")
							НоваяСтрока[ИмяУзла] = ИсполнительИзФайла
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ПредшественникиЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ПредшественникиЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ПредшественникиЭтапа" Тогда
						НоваяСтрока = ШаблонОбъект.ПредшественникиЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторПоследователя"
						ИЛИ ИмяУзла = "ИдентификаторПредшественника" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "УсловиеПерехода" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					ИначеЕсли ИмяУзла = "УсловиеРассмотрения" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ЛюбаяЗадачаПредшественника" Тогда
						
						НоваяСтрока[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ПрерываниеЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ПрерываниеЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ПрерываниеЭтапа" Тогда
						НоваяСтрока = ШаблонОбъект.ПрерываниеЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторПоследователя"
						ИЛИ ИмяУзла = "ИдентификаторПредшественника" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "УсловиеПерехода" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					ИначеЕсли ИмяУзла = "УсловиеРассмотрения" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ЛюбаяЗадачаПредшественника" Тогда
						
						НоваяСтрока[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ОтветственностьЗаРеквизиты" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ОтветственностьЗаРеквизиты" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ОтветственностьЗаРеквизит" Тогда
						НоваяСтрока = ШаблонОбъект.ОтветственностьЗаРеквизиты.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ИмяТабличнойЧасти"
						ИЛИ ИмяУзла = "ИмяРеквизита" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИзменениеРеквизитовЭтапов" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИзменениеРеквизитовЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИзменениеРеквизитовЭтапа" Тогда
						НоваяСтрока = ШаблонОбъект.ИзменениеРеквизитовЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ИмяТабличнойЧасти"
						ИЛИ ИмяУзла = "ИмяРеквизита" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ОбязательныеРеквизиты" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ОбязательныеРеквизиты" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ОбязательныйРеквизит" Тогда
						НоваяСтрока = ШаблонОбъект.ОбязательныеРеквизиты.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ИмяТабличнойЧасти"
						ИЛИ ИмяУзла = "ИмяРеквизита" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "НедоступныеРеквизиты" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "НедоступныеРеквизиты" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "НедоступныйРеквизит" Тогда
						НоваяСтрока = ШаблонОбъект.НедоступныеРеквизиты.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ИмяТабличнойЧасти"
						ИЛИ ИмяУзла = "ИмяРеквизита" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ДополнительныеОбработчики" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ДополнительныеОбработчики" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ДополнительныйОбработчик" Тогда
						НоваяСтрока = ШаблонОбъект.ДополнительныеОбработчики.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Обработчик"
						ИЛИ ИмяУзла = "ОбработчикДоТранзакции"
						ИЛИ ИмяУзла = "ОбработчикКлиентский" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла; 

			ИначеЕсли ФайлДанных.Имя = "УправлениеЭлементамиФормы" 
					И ЗагружатьНастройкиСвойствЭлементов Тогда

				Пока ФайлДанных.Прочитать() Цикл

					ИмяУзла = ФайлДанных.Имя;

					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "УправлениеЭлементамиФормы" Тогда
						Прервать;
					КонецЕсли;

					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ЭлементФормы" Тогда
						НоваяСтрока = ШаблонОбъект.УправлениеЭлементамиФормы.Добавить();
						Продолжить;
					КонецЕсли;

					Если ИмяУзла = "ИдентификаторЭтапа" Тогда

						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));

					ИначеЕсли ИмяУзла = "ЗапретДоступности" 
						ИЛИ ИмяУзла = "ЗапретВидимости"
						ИЛИ ИмяУзла = "ОтметкаНезаполненного" Тогда

						НоваяСтрока[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));

					ИначеЕсли ИмяУзла = "ИмяЭлемента"
						ИЛИ ИмяУзла = "СтартоваяСтраница" Тогда

						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);

					КонецЕсли;

				КонецЦикла;

			ИначеЕсли ФайлДанных.Имя = "ВлияниеНаДругиеПроцессы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ВлияниеНаДругиеПроцессы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "Влияние" Тогда
						НоваяСтрока = ШаблонОбъект.ВлияниеНаДругиеПроцессы.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа"
						ИЛИ ИмяУзла = "ИдентификаторЭтапаЗависимогоШаблона" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус"
						ИЛИ ИмяУзла = "УстанавливаемыйСтатус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ЗависимыйШаблон" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеШаблонов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "СвязьСОбъектом" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ТребованияКПроведению" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ТребованияКПроведению" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ТребованиеКПроведению" Тогда
						НоваяСтрока = ШаблонОбъект.ТребованияКПроведению.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "ПризнакПроведенности" Тогда
						
						НоваяСтрока[ИмяУзла] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ТребованияКВыполнению" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ТребованияКВыполнению" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ТребованиеКВыполнению" Тогда
						НоваяСтрока = ШаблонОбъект.ТребованияКВыполнению.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "УсловиеВыполнения" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИнициирующиеСобытия" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИнициирующиеСобытия" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИнициирующееСобытие" Тогда
						НоваяСтрока = ШаблонОбъект.ИнициирующиеСобытия.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Статус" Тогда
						
						НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеСтатусов.Получить(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Событие" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ИсполнителиГрупповыхЭтапов" И ЗагружатьИсполнителей Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ИсполнителиГрупповыхЭтапов" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ИсполнительГрупповогоЭтапа" Тогда
						НоваяСтрока = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "Исполнитель" Тогда
						
						ИсполнительИзФайла = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
						Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИсполнительИзФайла) Тогда
							// это роль исполнителя
							НоваяСтрока[ИмяУзла] = СоответствияОбъектов.СоответствиеРолей.Получить(ИсполнительИзФайла);
						ИначеЕсли ИсполнительИзФайла = "" Тогда
							// это пользователь, не загружается
						Иначе
							// это функция либо предопределенная роль (например "Автор документа")
							НоваяСтрока[ИмяУзла] = ИсполнительИзФайла
						КонецЕсли;
						
					ИначеЕсли ИмяУзла = "ИмяРеквизитаОсновногоОбъектаАдресации"
						ИЛИ ИмяУзла = "ИмяРеквизитаДополнительногоОбъектаАдресации" Тогда
						
						НоваяСтрока[ИмяУзла] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ШаблонПроцесса"
			И ЗаписатьОбъект Тогда
			
			// Заполнение исполнителей этапов согласно сохраненных значений
			Если ИсполнителиЭтапов <> Неопределено Тогда
				Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
					
					Если ЗагружатьИсполнителей Тогда
						Если ТипЗнч(Этап.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
							// При флаге "загружать исполнителей" для ролей необходимо восстановить объекты адресации
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
							ПараметрыОтбора.Вставить("Этап", Этап.Этап);
							ПараметрыОтбора.Вставить("Исполнитель", Этап.Исполнитель);
							МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
							Если МассивСтрок.Количество() > 0 Тогда
								ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
									"ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации");
							КонецЕсли;
						ИначеЕсли ТипЗнч(Этап.Исполнитель) = Тип("Строка") Тогда
							Продолжить;
						ИначеЕсли Этап.Исполнитель = Неопределено Тогда
							// При флаге "загружать исполнителей" для пользователей необходимо их восстановить
							ПараметрыОтбора = Новый Структура;
							ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
							ПараметрыОтбора.Вставить("Этап", Этап.Этап);
							МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
							Если МассивСтрок.Количество() > 0 Тогда
								ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
									"Исполнитель");
							КонецЕсли;
						КонецЕсли;
					Иначе
						ПараметрыОтбора = Новый Структура;
						ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
						ПараметрыОтбора.Вставить("Этап", Этап.Этап);
						МассивСтрок = ИсполнителиЭтапов.НайтиСтроки(ПараметрыОтбора);
						Если МассивСтрок.Количество() > 0 Тогда
							ЗаполнитьЗначенияСвойств(Этап, МассивСтрок[0],
								"Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации"
								+ ", ИмяРеквизитаОсновногоОбъектаАдресации, ИмяРеквизитаДополнительногоОбъектаАдресации");
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
			// Заполнение исполнителей групповых этапов согласно сохраненных значений
			Если ИсполнителиГрупповыхЭтапов <> Неопределено Тогда
				Если НЕ ЗагружатьИсполнителей Тогда
					
					НовыеЭтапыПоИдентификаторам = Новый Соответствие;
					Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
						НовыеЭтапыПоИдентификаторам.Вставить(Этап.ИдентификаторЭтапа, Этап.Этап);
					КонецЦикла;
					
					Для Каждого ИсполнительГрупповогоЭтапа Из ИсполнителиГрупповыхЭтапов Цикл
						// Если идентификатор этапа не найден в новых этапах, то строку не добавляем
						Если НовыеЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						// Если идентификатор этапа стал указывать на другой этап, то строку не добавляем
						Если НовыеЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] <>
							ЭтапыПоИдентификаторам[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] Тогда
							Продолжить;
						КонецЕсли;
						
						ЗаполнитьЗначенияСвойств(ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить(), ИсполнительГрупповогоЭтапа);
						
					КонецЦикла;
					
				Иначе
					
					// Если в загруженных групповых исполнителях есть пользователи,
					// то заполняем вместо них сохраненных пользователей (в рамках этапов)
					ИдентификаторыГрупповыхЭтаповСПользователями = Новый Соответствие;
					
					ПараметрыОтбора = Новый Структура("Исполнитель", Неопределено);
					МассивСтрокКУдалению = ШаблонОбъект.ИсполнителиГрупповыхЭтапов.НайтиСтроки(ПараметрыОтбора);
					Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
						ИдентификаторыГрупповыхЭтаповСПользователями.Вставить(СтрокаКУдалению.ИдентификаторЭтапа, Истина);
						ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Удалить(СтрокаКУдалению);
					КонецЦикла;
					
					Для Каждого ИсполнительГрупповогоЭтапа Из ИсполнителиГрупповыхЭтапов Цикл
						Если ИдентификаторыГрупповыхЭтаповСПользователями[ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа] <> Неопределено
							И ТипЗнч(ИсполнительГрупповогоЭтапа.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
							ЗаполнитьЗначенияСвойств(ШаблонОбъект.ИсполнителиГрупповыхЭтапов.Добавить(), ИсполнительГрупповогоЭтапа);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
			
			ШаблонОбъект.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "ШаблоныПроцессов" Тогда
			
			Возврат;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьРегламентныеИнтервалы(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "РегламентныйИнтервал" Тогда
				
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				Шаблон = СоответствияОбъектов.СоответствиеШаблонов.Получить(ФайлДанных.ПолучитьАтрибут("Шаблон"));
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если НЕ ЗаписатьОбъект Тогда
					ИнтервалОбъект = Справочники.РегламентныеИнтервалы.СоздатьЭлемент();
					Продолжить;
				КонецЕсли;
				
				ИнтервалСсылка = СоответствияОбъектов.СоответствиеИнтервалов.Получить(ИдентификаторПоддержки);
				
				Если ИнтервалСсылка.Пустая() Тогда
					
					ИнтервалОбъект = Справочники.РегламентныеИнтервалы.СоздатьЭлемент();
					ИнтервалОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					ИнтервалОбъект.Наименование = Наименование;
					ИнтервалОбъект.Владелец = Шаблон;
					
					НоваяСсылка = Справочники.РегламентныеИнтервалы.ПолучитьСсылку();
					СоответствияОбъектов.СоответствиеИнтервалов.Вставить(ИдентификаторПоддержки, НоваяСсылка);
					
					ИнтервалОбъект.УстановитьСсылкуНового(НоваяСсылка);
					
				Иначе
					ИнтервалОбъект = ИнтервалСсылка.ПолучитьОбъект();
					ПроверитьУстановитьЗначениеРеквизита(ИнтервалОбъект, "ИдентификаторПоддержки", Новый УникальныйИдентификатор(ИдентификаторПоддержки));
					ПроверитьУстановитьЗначениеРеквизита(ИнтервалОбъект, "Наименование", Наименование);
					ПроверитьУстановитьЗначениеРеквизита(ИнтервалОбъект, "Владелец", Шаблон);
					ИнтервалОбъект.Этапы.Очистить();
					ИнтервалОбъект.ПредшественникиЭтапов.Очистить();
				КонецЕсли;
				
			ИначеЕсли ИнтервалОбъект = Неопределено Тогда
				
				Продолжить;
				
			ИначеЕсли ФайлДанных.Имя = "ИдентификаторНачальногоЭтапа"
				ИЛИ ФайлДанных.Имя = "ИдентификаторКонечногоЭтапа" Тогда
				
				ИнтервалОбъект[ФайлДанных.Имя] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "СрокЗависитОтВремениНачала" Тогда
				
				ИнтервалОбъект[ФайлДанных.Имя] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "ВремяНачала"
				ИЛИ ФайлДанных.Имя = "ВремяОкончания"
				ИЛИ ФайлДанных.Имя = "ВремяОкончанияПосле" Тогда
				
				ИнтервалОбъект[ФайлДанных.Имя] = XMLЗначение(Тип("Дата"), ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "СрокВыполненияЧасы"
				ИЛИ ФайлДанных.Имя = "СрокВыполненияДни"
				ИЛИ ФайлДанных.Имя = "СпособУказанияВремениОкончания"
				ИЛИ ФайлДанных.Имя = "СрокВыполненияЧасыПосле"
				ИЛИ ФайлДанных.Имя = "СрокВыполненияДниПосле"
				ИЛИ ФайлДанных.Имя = "СпособУказанияВремениОкончанияПосле" Тогда
				
				ИнтервалОбъект[ФайлДанных.Имя] = Число(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "Этапы" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "Этапы" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ЭтапСтрока" Тогда
						НоваяСтрока = ИнтервалОбъект.Этапы.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторЭтапа" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					ИначеЕсли ИмяУзла = "СрокВыполненияЧасы" Тогда
						
						НоваяСтрока[ИмяУзла] = Число(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			ИначеЕсли ФайлДанных.Имя = "ПредшественникиЭтаповИнтервала" Тогда
				
				Пока ФайлДанных.Прочитать() Цикл
					
					ИмяУзла = ФайлДанных.Имя;
					
					Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
						И ИмяУзла = "ПредшественникиЭтаповИнтервала" Тогда
						Прервать;
					КонецЕсли;
					
					Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента
						И ИмяУзла = "ПредшественникиЭтапа" Тогда
						НоваяСтрока = ИнтервалОбъект.ПредшественникиЭтапов.Добавить();
						Продолжить;
					КонецЕсли;
					
					Если ИмяУзла = "ИдентификаторПоследователя"
						ИЛИ ИмяУзла = "ИдентификаторПредшественника" Тогда
						
						НоваяСтрока[ИмяУзла] = Новый УникальныйИдентификатор(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "РегламентныйИнтервал"
			И ЗаписатьОбъект Тогда
			
			ИнтервалОбъект.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "РегламентныеИнтервалы" Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьРолиИсполнителей(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	ОбъектыАдресации = Новый Структура;
	ОбъектыАдресации.Вставить("ТипыООАИмяПредопределенныхДанных");
	ОбъектыАдресации.Вставить("ТипыООАТипЗначения");
	ОбъектыАдресации.Вставить("ТипыДОАИмяПредопределенныхДанных");
	ОбъектыАдресации.Вставить("ТипыДОАТипЗначения");
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "РольИсполнителя" Тогда
				
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				Если НЕ ЗаписатьОбъект Тогда
					РольОбъект = Справочники.РолиИсполнителей.СоздатьЭлемент();
					Продолжить;
				КонецЕсли;
				
				ОбъектыАдресации.Вставить("ТипыООАИмяПредопределенныхДанных");
				ОбъектыАдресации.Вставить("ТипыООАТипЗначения");
				ОбъектыАдресации.Вставить("ТипыДОАИмяПредопределенныхДанных");
				ОбъектыАдресации.Вставить("ТипыДОАТипЗначения");
				
				РольСсылка = СоответствияОбъектов.СоответствиеРолей.Получить(ИдентификаторПоддержки);
				
				Если РольСсылка.Пустая() Тогда
					
					РольОбъект = Справочники.РолиИсполнителей.СоздатьЭлемент();
					РольОбъект.Наименование = Наименование;
					
					РольСсылка = Справочники.РолиИсполнителей.ПолучитьСсылку();
					СоответствияОбъектов.СоответствиеРолей.Вставить(ИдентификаторПоддержки, РольСсылка);
					
					РольОбъект.УстановитьСсылкуНового(РольСсылка);
					
				Иначе
					РольОбъект = РольСсылка.ПолучитьОбъект();
					ПроверитьУстановитьЗначениеРеквизита(РольОбъект, "Наименование", Наименование);
				КонецЕсли;
				
				УстановитьИдентификаторПодержкиРолиИсполнителя(РольСсылка, Новый УникальныйИдентификатор(ИдентификаторПоддержки));
				
			ИначеЕсли РольОбъект = Неопределено Тогда
				
				Продолжить;
				
			ИначеЕсли ФайлДанных.Имя = "ИспользуетсяСОбъектамиАдресации"
				ИЛИ ФайлДанных.Имя = "ИспользуетсяБезОбъектовАдресации" Тогда
				
				РольОбъект[ФайлДанных.Имя] = БулевоПоПредставлению(ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных));
				
			ИначеЕсли ФайлДанных.Имя = "ТипыООАИмяПредопределенныхДанных"
				ИЛИ ФайлДанных.Имя = "ТипыООАТипЗначения"
				ИЛИ ФайлДанных.Имя = "ТипыДОАИмяПредопределенныхДанных"
				ИЛИ ФайлДанных.Имя = "ТипыДОАТипЗначения" Тогда
				
				ОбъектыАдресации[ФайлДанных.Имя] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			ИначеЕсли ФайлДанных.Имя = "КраткоеПредставление"
				ИЛИ ФайлДанных.Имя = "Комментарий" Тогда
				
				РольОбъект[ФайлДанных.Имя] = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "РольИсполнителя"
			И ЗаписатьОбъект Тогда
			
			Если ЗначениеЗаполнено(ОбъектыАдресации.ТипыООАИмяПредопределенныхДанных)
				И ЗначениеЗаполнено(ОбъектыАдресации.ТипыООАТипЗначения) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ОбъектыАдресацииЗадач.Ссылка КАК Ссылка,
				|	ОбъектыАдресацииЗадач.ТипЗначения КАК ТипЗначения,
				|	ОбъектыАдресацииЗадач.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
				|ИЗ
				|	ПланВидовХарактеристик.ОбъектыАдресацииЗадач КАК ОбъектыАдресацииЗадач";
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.ИмяПредопределенныхДанных = ОбъектыАдресации.ТипыООАИмяПредопределенныхДанных Тогда
						ТипыПВХВБазе = Новый Массив;
						Для Каждого Тип Из Выборка.ТипЗначения.Типы() Цикл
							ТипыПВХВБазе.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
						КонецЦикла;
						Если ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(
							ТипыПВХВБазе, СтрРазделить(ОбъектыАдресации.ТипыООАТипЗначения, ",", Ложь)) Тогда
							РольОбъект.ТипыОсновногоОбъектаАдресации = Выборка.Ссылка;
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОбъектыАдресации.ТипыДОАИмяПредопределенныхДанных)
				И ЗначениеЗаполнено(ОбъектыАдресации.ТипыДОАТипЗначения) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	ОбъектыАдресацииЗадач.Ссылка КАК Ссылка,
				|	ОбъектыАдресацииЗадач.ТипЗначения КАК ТипЗначения,
				|	ОбъектыАдресацииЗадач.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
				|ИЗ
				|	ПланВидовХарактеристик.ОбъектыАдресацииЗадач КАК ОбъектыАдресацииЗадач";
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Если Выборка.ИмяПредопределенныхДанных = ОбъектыАдресации.ТипыДОАИмяПредопределенныхДанных Тогда
						ТипыПВХВБазе = Новый Массив;
						Для Каждого Тип Из Выборка.ТипЗначения.Типы() Цикл
							ТипыПВХВБазе.Добавить(ОбщегоНазначения.СтроковоеПредставлениеТипа(Тип));
						КонецЦикла;
						Если ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(
							ТипыПВХВБазе, СтрРазделить(ОбъектыАдресации.ТипыДОАТипЗначения, ",", Ложь)) Тогда
							РольОбъект.ТипыДополнительногоОбъектаАдресации = Выборка.Ссылка;
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			РольОбъект.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "РолиИсполнителей" Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьНастройкиИспользования(Данные, СоответствияОбъектов, ОбъектыДляЗагрузки)
	
	ШаблоныДляОчисткиНастройки = ОбщегоНазначения.СкопироватьРекурсивно(СоответствияОбъектов.СоответствиеШаблонов);
	ДокументыДляОчисткиПустойНастройки = Новый Соответствие;
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "НастройкаИспользования" Тогда
				
				Документ = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
					"Документ." + ФайлДанных.ПолучитьАтрибут("Документ"));
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("Шаблон");
				Шаблон = СоответствияОбъектов.СоответствиеШаблонов.Получить(ИдентификаторПоддержки);
				
				ЗаписатьОбъект = ОбъектыДляЗагрузки[ИдентификаторПоддержки] <> Неопределено;
				
				МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ИдентификаторДокумента = Документ;
				МенеджерЗаписи.Шаблон = Шаблон;
				
				ШаблоныДляОчисткиНастройки.Удалить(ФайлДанных.ПолучитьАтрибут("Шаблон"));
				
				Если ЗаписатьОбъект Тогда
					ДокументыДляОчисткиПустойНастройки.Вставить(Документ, Истина);
				КонецЕсли;
				
			ИначеЕсли ФайлДанных.Имя = "УсловиеИспользования" Тогда
				
				МенеджерЗаписи.УсловиеИспользования = ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных);
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "НастройкаИспользования"
			И ЗаписатьОбъект Тогда
			
			МенеджерЗаписи.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента
			И ФайлДанных.Имя = "НастройкиИспользования" Тогда
			
			Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента")
				И ПроцессыОбработкиДокументов.ЕстьТипыДокументовСНесколькимиШаблонами() Тогда
				ТекстСообщения = НСтр("ru = 'Загрузка отменена. Не удалось загрузить настройки использования шаблонов. '")
					+ НСтр("ru = '""Необходимо включить флаг ""Использовать несколько шаблонов для одного типа документа"" '")
					+ НСтр("ru = 'в настройках процессов обработки документов'");
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Очистка настроек использования из выгрузки, настроек которых в выгрузке нет (значит их нет в базе-поставщике)
	Для Каждого КлючЗначение Из ШаблоныДляОчисткиНастройки Цикл
		// Ели шаблон не загружался, то не нужно удалять его настройку использования
		Если ОбъектыДляЗагрузки[КлючЗначение.Ключ] = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			КлючЗначение.Значение, "ИдентификаторДокумента");
		МенеджерЗаписи.Шаблон = КлючЗначение.Значение;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	// Очистка настроек использования с пустым шаблоном, у которых в выгрузке есть заполненный шаблон,
	// чтобы не получилось ситуации, когда для одного типа документа есть записи с заполненным и незаполненным шаблоном
	Для Каждого КлючЗначение Из ДокументыДляОчисткиПустойНастройки Цикл
		МенеджерЗаписи = РегистрыСведений.НастройкаИспользованияШаблонов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторДокумента = КлючЗначение.Ключ;
		МенеджерЗаписи.Шаблон = ПредопределенноеЗначение("Справочник.ШаблоныПроцессов.ПустаяСсылка");
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУстановитьЗначениеРеквизита(ТекущийОбъект, ИмяРеквизита, НовоеЗначениеРеквизита, ЗначениеИзменилось = Ложь)
	
	Если ТекущийОбъект[ИмяРеквизита] <> НовоеЗначениеРеквизита Тогда
		ТекущийОбъект[ИмяРеквизита] = НовоеЗначениеРеквизита;
		ЗначениеИзменилось = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция БулевоПоПредставлению(Знач Представление)
	
	Представление = ВРЕГ(Представление);
	
	Возврат Представление = "TRUE"
		ИЛИ Представление = "ИСТИНА";
	
КонецФункции

Функция ПрочитатьТекстовоеЗначениеИзФайла(ФайлДанных)

	ТекстовоеЗначение = "";
	Если ФайлДанных.ТипУзла = ТипУзлаНачалоЭлемента Тогда
		ФайлДанных.Прочитать();
	КонецЕсли;
	Если ФайлДанных.ТипУзла = ТипУзлаКонецЭлемента Тогда
		Возврат "";
	КонецЕсли;
	ТекстовоеЗначение = ФайлДанных.Значение;
	ФайлДанных.Прочитать();
	
	Возврат ТекстовоеЗначение;

КонецФункции

Процедура УстановитьИдентификаторПодержкиРолиИсполнителя(Роль, ИдентификаторПоддержки)
	
	МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоддержкиРолейИсполнителей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.РольИсполнителя = Роль;
	МенеджерЗаписи.ИдентификаторПоддержки = ИдентификаторПоддержки;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ТипСтрока                = Тип("Строка");
ТипДата                  = Тип("Дата");
ТипЧисло                 = Тип("Число");
ТипБулево                = Тип("Булево");
ТипСтандартнаяДатаНачала = Тип("СтандартнаяДатаНачала");

ТипУзлаНачалоЭлемента = ТипУзлаXML.НачалоЭлемента;
ТипУзлаКонецЭлемента  = ТипУзлаXML.КонецЭлемента;

#КонецОбласти

#КонецЕсли