#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПередИзменением
Процедура ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта(Объект, Отказ, Параметры) Экспорт

	ИмяПроцедуры = "СинхронизацияДанныхБЗКОтборПоРазделамДанных.ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта";
	ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, ИмяПроцедуры);
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПослеИзменения
Процедура ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта(Объект, Отказ, Параметры) Экспорт
	
	ИмяПроцедуры = "СинхронизацияДанныхБЗКОтборПоРазделамДанных.ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта";
	ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, ИмяПроцедуры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, ИмяПроцедуры)

	Если Отказ Или Параметры.НеИзменятьТекстЗапроса
		Или Не СинхронизацияДанныхЗарплатаКадрыСервер.ИспользуютсяУзлыРИБСОтборомПоРазделамДанных() Тогда
		Возврат;
	КонецЕсли;

	ПроверитьПараметры(Параметры, ИмяПроцедуры);
	
	РазделыДанных = Параметры.ДополнительныеПараметры.РазделыДанных;
	СинхронизацияДанныхЗарплатаКадрыСервер.ДобавитьВЗапросОтборПоРазделамДанных(Параметры.ТекстЗапроса,
		Параметры.ПараметрыЗапроса, Параметры.ПРО.ИмяПланаОбмена, РазделыДанных);
	
КонецПроцедуры

Процедура ПроверитьПараметры(Параметры, ИмяПроцедуры)
	
	ТекстОшибки = НСтр("ru = 'В параметре Параметры.ДополнительныеПараметры отсутствует свойство ""РазделыДанных""'");
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.ДополнительныеПараметры.Свойство("РазделыДанных"), ТекстОшибки,
		СтрШаблон(НСтр("ru = '%1'"), ИмяПроцедуры));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяПроцедуры, "Параметры.ДополнительныеПараметры.РазделыДанных",
		Параметры.ДополнительныеПараметры.РазделыДанных, Новый ОписаниеТипов("Массив,Строка"));
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
