#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.УчастникКадровогоРезерва, NULL КАК ИСТИНА))
	|	И ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьУчастниковКадровогоРезерва");
	Методы.Вставить("ЗаполнитьСтатусыГотовности");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	ОписаниеСостава = ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта();
	ОписаниеСостава.ЗаполнятьТабличнуюЧастьФизическиеЛицаДокумента = Ложь;
	ОписаниеСостава.ЗаполнятьФизическиеЛицаПоСотрудникам = Ложь;
	ОписаниеСостава.ИспользоватьОграничениеДоступа = Ложь;
	
	ОписаниеХранения = ЗарплатаКадрыСоставДокументов.ОписаниеХраненияСотрудниковФизическихЛиц();
	ОписаниеХранения.ИмяТаблицы = "Сотрудники";
	ОписаниеХранения.ПолеСотрудник = Неопределено;
	ОписаниеХранения.ПолеФизическоеЛицо = "УчастникКадровогоРезерва";
	ОписаниеСостава.ОписаниеХраненияСотрудниковФизическихЛиц.Добавить(ОписаниеХранения);
	
	Возврат ОписаниеСостава;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ПолучитьДанныеДляПроведения(Ссылка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВключениеВКадровыйРезерв.ДатаРассмотрения КАК Период,
		|	ВключениеВКадровыйРезервСотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	ВключениеВКадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	ВключениеВКадровыйРезервСотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВключениеВКадровыйРезервСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ВключениеВКадровыйРезервСотрудники.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Утвердить)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка)
		|	КОНЕЦ КАК Статус,
		|	ВключениеВКадровыйРезервСотрудники.Наставник КАК Наставник,
		|	ВключениеВКадровыйРезервСотрудники.Куратор КАК Куратор,
		|	ВключениеВКадровыйРезервСотрудники.Основание КАК Основание
		|ИЗ
		|	Документ.ВключениеВКадровыйРезерв.Сотрудники КАК ВключениеВКадровыйРезервСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВключениеВКадровыйРезерв КАК ВключениеВКадровыйРезерв
		|		ПО ВключениеВКадровыйРезервСотрудники.Ссылка = ВключениеВКадровыйРезерв.Ссылка
		|ГДЕ
		|	ВключениеВКадровыйРезерв.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВключениеВКадровыйРезерв.ДатаРассмотрения КАК Период,
		|	ВключениеВКадровыйРезервСотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	ВключениеВКадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	ВключениеВКадровыйРезервСотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВключениеВКадровыйРезервСотрудники.СтатусГотовности КАК Статус
		|ИЗ
		|	Документ.ВключениеВКадровыйРезерв.Сотрудники КАК ВключениеВКадровыйРезервСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВключениеВКадровыйРезерв КАК ВключениеВКадровыйРезерв
		|		ПО ВключениеВКадровыйРезервСотрудники.Ссылка = ВключениеВКадровыйРезерв.Ссылка
		|ГДЕ
		|	ВключениеВКадровыйРезерв.Ссылка = &Ссылка
		|	И ВключениеВКадровыйРезервСотрудники.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Утвердить)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДвиженияИсторииКадровогоРезерва = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2];
	ДвиженияСтатусыРезервистов = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияИсторииКадровогоРезерва", ДвиженияИсторииКадровогоРезерва.Выгрузить());
	ДанныеДляПроведения.Вставить("ДвиженияСтатусыРезервистов", ДвиженияСтатусыРезервистов.Выгрузить());
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ПриПолученииДанныхДляПроведения(ДанныеДляПроведения);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.ДополнитьДанныеДляПроведенияПоНаставничеству(Ссылка, ДанныеДляПроведения);
	КонецЕсли;
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#Область ОбработчикиОбновления

// Выполняет заполнение реквизита СтатусГотовности при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьСтатусыГотовности(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Если Не ПараметрыОбновления.Свойство("ОбработанныеДокументы") Тогда
		ПараметрыОбновления.Вставить("ОбработанныеДокументы", Новый Массив);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ПараметрыОбновления.ОбработанныеДокументы);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ВключениеВКадровыйРезерв.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВключениеВКадровыйРезерв КАК ВключениеВКадровыйРезерв
		|ГДЕ
		|	(ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			Документ.ВключениеВКадровыйРезерв.Сотрудники КАК ВключениеВКадровыйРезервСотрудники
		|		ГДЕ
		|			ВключениеВКадровыйРезервСотрудники.Ссылка = ВключениеВКадровыйРезерв.Ссылка
		|			И
		|				ВключениеВКадровыйРезервСотрудники.СтатусГотовности = ЗНАЧЕНИЕ(Справочник.СтатусыГотовностиРезервистов.ПустаяСсылка)))
		|	И НЕ ВключениеВКадровыйРезерв.Ссылка В (&ОбработанныеДокументы)";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.ВключениеВКадровыйРезерв.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработанныеДокументы", Новый Массив);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.ВключениеВКадровыйРезерв
			Для Каждого СтрокаСотрудники Из ДокументОбъект.Сотрудники Цикл
				Если Не ЗначениеЗаполнено(СтрокаСотрудники.СтатусГотовности) Тогда
					СтрокаСотрудники.СтатусГотовности = Справочники.СтатусыГотовностиРезервистов.ГотовКНазначению;
				КонецЕсли;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			
			//@skip-check query-in-loop
			ДанныеДляПроведения = ПолучитьДанныеДляПроведения(Выборка.Ссылка);
			НаборЗаписей = ДокументОбъект.Движения.СтатусыГотовностиРезервистов;
			КадровыйРезерв.СформироватьДвиженияСтатусыГотовностиРезервистов(ДокументОбъект.Движения, ДанныеДляПроведения,
				"ДвиженияСтатусыРезервистов");
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
			ПараметрыОбновления.ОбработанныеДокументы.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Выполняет перенос данных из реквизита ФизическоеЛицо в УчастникКадровогоРезерва при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьУчастниковКадровогоРезерва(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Если Не ПараметрыОбновления.Свойство("ОбработанныеДокументы") Тогда
		ПараметрыОбновления.Вставить("ОбработанныеДокументы", Новый Массив);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ПараметрыОбновления.ОбработанныеДокументы);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ВключениеВКадровыйРезерв.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВключениеВКадровыйРезерв КАК ВключениеВКадровыйРезерв
		|ГДЕ
		|	(ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			Документ.ВключениеВКадровыйРезерв.Сотрудники КАК ВключениеВКадровыйРезервСотрудники
		|		ГДЕ
		|			ВключениеВКадровыйРезервСотрудники.Ссылка = ВключениеВКадровыйРезерв.Ссылка
		|			И ВключениеВКадровыйРезервСотрудники.УчастникКадровогоРезерва = НЕОПРЕДЕЛЕНО))
		|	И НЕ ВключениеВКадровыйРезерв.Ссылка В (&ОбработанныеДокументы)";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.ВключениеВКадровыйРезерв.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработанныеДокументы", Новый Массив);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.ВключениеВКадровыйРезерв
			Для Каждого СтрокаСотрудники Из ДокументОбъект.Сотрудники Цикл
				Если Не ЗначениеЗаполнено(СтрокаСотрудники.УчастникКадровогоРезерва) Тогда
					СтрокаСотрудники.УчастникКадровогоРезерва = СтрокаСотрудники.УдалитьФизическоеЛицо;
				КонецЕсли;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			ПараметрыОбновления.ОбработанныеДокументы.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ДобавитьКомандыПечатиВключенияВКадровыйРезервГосслужащих(КомандыПечати);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли