#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроверитьДействующиеВключения(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ВключениеВКадровыйРезерв.ПолучитьДанныеДляПроведения(Ссылка);
	
	КадровыйРезерв.СформироватьДвиженияИсторииКадровогоРезерва(Движения, ДанныеДляПроведения,
		"ДвиженияИсторииКадровогоРезерва");
	КадровыйРезерв.СформироватьДвиженияСтатусыГотовностиРезервистов(Движения, ДанныеДляПроведения,
		"ДвиженияСтатусыРезервистов");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.СформироватьДвиженияПоНаставничеству(Ссылка, ЭтотОбъект, Движения, ДанныеДляПроведения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВключениеВКадровыйРезерв") Тогда
		ЗаполнитьПоЗаявке(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьПоСтруктуре(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаРассмотрения, "Объект.ДатаРассмотрения", Отказ,
		НСтр("ru='Дата рассмотрения'"));
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ВключениеВРезервПриОбработкеПроверкиЗаполнения(МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	Для Каждого СтрокаСотрудника Из Сотрудники Цикл
		Если СтрокаСотрудника.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить
			И Не ЗначениеЗаполнено(СтрокаСотрудника.СтатусГотовности) Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'У сотрудника %1 (строка %2) не заполнен статус готовности'"),
				СтрокаСотрудника.УчастникКадровогоРезерва,
				СтрокаСотрудника.НомерСтроки);
			
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Сотрудники", СтрокаСотрудника.НомерСтроки, "СтатусГотовности");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);
			
		КонецЕсли;
	КонецЦикла;
	
	//Проверка дублей
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	Сотрудники.ПозицияРезерва КАК ПозицияРезерва,
	|	Сотрудники.НомерСтроки КАК КоличествоСтрок
	|ПОМЕСТИТЬ ВТУчастникиИПозиции
	|ИЗ
	|	&Сотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчастникиИПозиции.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
	|	УчастникиИПозиции.ПозицияРезерва КАК ПозицияРезерва
	|ИЗ
	|	ВТУчастникиИПозиции КАК УчастникиИПозиции
	|
	|СГРУППИРОВАТЬ ПО
	|	УчастникиИПозиции.УчастникКадровогоРезерва,
	|	УчастникиИПозиции.ПозицияРезерва
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчастникиИПозиции.КоличествоСтрок) > 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	УчастникКадровогоРезерва,
	|	ПозицияРезерва";
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Отказ = Истина;
		Выборка = Результат.Выбрать();
		СтруктураПоиска = Новый Структура("УчастникКадровогоРезерва, ПозицияРезерва");
		Пока Выборка.Следующий() Цикл 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, Выборка);
			ДублирующиесяСтроки = Сотрудники.Выгрузить(СтруктураПоиска,"НомерСтроки");
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'Резервист %1 на позицию ""%2"" дублируется в строках %3'"),
				Выборка.УчастникКадровогоРезерва,
				Выборка.ПозицияРезерва,
				СтрСоединить(ДублирующиесяСтроки.ВыгрузитьКолонку("НомерСтроки"), ","));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка,, "Объект", Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРассмотрения = НачалоДня(ДатаРассмотрения) + КадровыйРезерв.ЗначениеВремениПоСтатусуРезерва(
		ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДействующиеВключения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	Сотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	Сотрудники.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	&Сотрудники КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТСотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	ИсторияКадровогоРезерваСрезПоследних.Период КАК ДатаВключения,
		|	ВТСотрудники.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКадровогоРезерва.СрезПоследних(&ДатаВключения,) КАК
		|			ИсторияКадровогоРезерваСрезПоследних
		|		ПО ВТСотрудники.УчастникКадровогоРезерва = ИсторияКадровогоРезерваСрезПоследних.УчастникКадровогоРезерва
		|		И ВТСотрудники.ПозицияРезерва = ИсторияКадровогоРезерваСрезПоследних.ПозицияРезерва
		|ГДЕ
		|	ИсторияКадровогоРезерваСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Согласовано)
		|	И (ИсторияКадровогоРезерваСрезПоследних.ДатаОкончания >= &ДатаВключения
		|	ИЛИ ИсторияКадровогоРезерваСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсторияКадровогоРезерваСрезПоследних.Регистратор <> &Ссылка";
		
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.Выгрузить());
	Запрос.УстановитьПараметр("ДатаВключения", ДатаРассмотрения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	ШаблонТекстаОшибки = НСтр("ru = 'Сотрудник %1 уже включен в резерв на позицию ""%2"" с %3.'");
	Пока РезультатЗапроса.Следующий() Цикл
		ТекстОшибки = СтрШаблон(
			ШаблонТекстаОшибки,
			РезультатЗапроса.УчастникКадровогоРезерва,
			РезультатЗапроса.ПозицияРезерва,
			Формат(РезультатЗапроса.ДатаВключения, "ДЛФ=D"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка,
			"Объект.Сотрудники[" + Формат(РезультатЗапроса.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].УчастникКадровогоРезерва", ,
			Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаявке(ДанныеЗаполнения)
	
	Заявка = ДанныеЗаполнения.ПолучитьОбъект();
	ОснованиеОбъект = Заявка.Ссылка;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Заявка, "Подразделение, ВидРезерва");
	НоваяСтрока = Сотрудники.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Заявка, "УчастникКадровогоРезерва, ПозицияРезерва, Наставник, Куратор");
	НоваяСтрока.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить;
	
КонецПроцедуры

// Параметры:
//  ДанныеЗаполнения - Структура
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ДанныеСотрудники = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Сотрудники");
	Если ЗначениеЗаполнено(ДанныеСотрудники) И ТипЗнч(ДанныеСотрудники) = Тип("Массив") Тогда
		Для Каждого ДанныеСотрудника Из ДанныеСотрудники Цикл
			НоваяСтрока = Сотрудники.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
			НоваяСтрока.Действие = Перечисления.ДействияСКадровымиРезервистами.Утвердить;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли