#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользуетсяУчетОригиналовПервичныхДокументов() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУчетОригиналовПервичныхДокументов");;
	
КонецФункции

Процедура ЗаписатьСостояниеОригиналаДокумента(РассылаемыйДокумент, Идентификатор, Представление) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СостояниеПриРассылке = Константы.СостояниеОригиналаПервичногоДокументаПриРассылке.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	РегистрыСведений.СостоянияОригиналовПервичныхДокументов.ЗаписатьСостояниеОригиналаДокументаПоПечатнымФормам(
		РассылаемыйДокумент,
		Идентификатор,
		Представление,
		СостояниеПриРассылке,
		Ложь);
	РегистрыСведений.СостоянияОригиналовПервичныхДокументов.ЗаписатьОбщееСостояниеОригиналаДокумента(
		РассылаемыйДокумент,
		СостояниеПриРассылке);
	
КонецПроцедуры

#КонецОбласти

