#Область ПрограммныйИнтерфейс

Функция ДанныеДляПодписиМассивДокументов(ДанныеДокументов, УИДФормы, УсиленнаяПодпись) Экспорт
	
	СтруктураДляВозврата = Новый Структура;
	
	НаборДанныхДляПодписи = Новый Массив;
	
	ЕстьПрисоединенныеФайлы = Ложь;
	
	СведенияДляПростойПодписи = Новый Соответствие;
	
	ПодписыватьПрисоединенныеФайлы = УсиленнаяПодпись И Константы.ПодписыватьПрисоединенныеФайлы.Получить();
	ПодписьФайловНастраиваетсяВШаблоне = ПодписыватьПрисоединенныеФайлы И Константы.ПодписьФайловНастраиваетсяВШаблоне.Получить();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	Иначе
		МодульРаботаСФайлами = Неопределено;
	КонецЕсли;
	
	МодульОценкаПроизводительности = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") Тогда
		МодульОценкаПроизводительности = ОбщегоНазначения.ОбщийМодуль("ОценкаПроизводительности");
		ОписаниеЗамера = МодульОценкаПроизводительности.НачатьЗамерДлительнойОперации(
			"ПроцессыОбработкиДокументов.ПодготовкаДанныхДляПодписи");
	КонецЕсли;
	
	ПроцессыОбработкиДокументов.РеквизитыДляПодписиМассиваДокументов(ДанныеДокументов);
	
	Если МодульОценкаПроизводительности <> Неопределено Тогда
		МодульОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(
			ОписаниеЗамера, ДанныеДокументов.Количество(), "ПолучениеЗначенийРеквизитов");
	КонецЕсли;
	
	Для Каждого ДанныеДокументаДляПодписи Из ДанныеДокументов Цикл
		
		// значения реквизитов
		
		Результат = Новый Структура;
		
		РеквизитыДокументов = Новый Структура;
		ПроцессыОбработкиДокументовПереопределяемый.XMLДанныеОписанияПодписываемыхДокументов(ДанныеДокументаДляПодписи, РеквизитыДокументов);
		
		ОбщийРезультат = Новый Структура;
		ОбщийРезультат.Вставить("ОписаниеПодписываемыхДокументов", РеквизитыДокументов);
		ОбщийРезультат.Вставить("ПодписываемыеДанныеДокументов", ДанныеДокументаДляПодписи.ЗначенияРеквизитов);
		
		Результат.Вставить("ДанныеПодписи", ОбщийРезультат);
		
		СериализованныйРезультат = ПроцессыОбработкиДокументов.СтруктуруВСтрокуXML(Результат);
		
		ДвоичныйРезультат = ПолучитьДвоичныеДанныеИзСтроки(СериализованныйРезультат);
		
		ДанныеСтруктура = Новый Структура;
		ДанныеСтруктура.Вставить("Данные", ПоместитьВоВременноеХранилище(ДвоичныйРезультат, УИДФормы));
		ДанныеСтруктура.Вставить("Представление", СериализованныйРезультат);
		ДанныеСтруктура.Вставить("Ссылка", ДанныеДокументаДляПодписи.Документ);
		ДанныеСтруктура.Вставить("Владелец", Неопределено);
		
		ДанныеСтруктура.Вставить("Шаблон", ДанныеДокументаДляПодписи.Шаблон);
		ДанныеСтруктура.Вставить("ИдентификаторЭтапа", ДанныеДокументаДляПодписи.ИдентификаторЭтапа); 
		
		Если Константы.ИспользоватьПроверкуПодписываемыхДанныхЧерезХэш.Получить() Тогда
	
			РазмерФайлаXML = ДвоичныйРезультат.Размер();
			ИспользуетсяПроверкаЧерезХэш = ПроцессыОбработкиДокументов.ИспользуетсяПроверкаХэшДляДанныхБольшогоОбъема(
										   ДанныеДокументаДляПодписи.Шаблон, РазмерФайлаXML);
			
			Если ИспользуетсяПроверкаЧерезХэш Тогда
				
				СоставПодписи = Неопределено;
				НастройкаПодписиСсылочныхДанных = Неопределено;
				Если ДанныеДокументаДляПодписи.Свойство("ПроверкаХэшКонтролируемыеРеквизиты", СоставПодписи) 
					И ДанныеДокументаДляПодписи.Свойство("ПроверкаХэшНастройкаПодписиСсылочныхДанных", НастройкаПодписиСсылочныхДанных) Тогда
					
					// записываем в регистр данные для последующего быстрого формирования структуры проверяемых данных
					ПроцессыОбработкиДокументов.ДобавитьНастройкиПроверкиДанныхБольшихОбъемов(ДанныеДокументаДляПодписи.Задача,
					СоставПодписи, НастройкаПодписиСсылочныхДанных, РазмерФайлаXML);
					
					ДанныеДокументаДляПодписи.Удалить("ПроверкаХэшКонтролируемыеРеквизиты");
					ДанныеДокументаДляПодписи.Удалить("ПроверкаХэшНастройкаПодписиСсылочныхДанных");
					КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если УсиленнаяПодпись Тогда
			ДанныеДокументаДляПодписи.Вставить("ПодписанЭП", Истина);
		Иначе
			ДанныеДокументаДляПодписи.Вставить("ПодписанПростойЭП", Истина);
			
			ДанныеДляПростойПодписи = Новый Структура("Организация, Должность");
			СведенияДляПростойПодписи.Вставить(ДанныеДокументаДляПодписи.Документ, ДанныеДляПростойПодписи);
		КонецЕсли;
		
		ДанныеДокументаДляПодписи.Вставить("АдресДанных", ДанныеСтруктура.Данные);
		
		НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
		
		ДанныеДокументаДляПодписи.Удалить("ЗначенияРеквизитов");
		
		//Формирование формуляров
		Если ПроцессыОбработкиДокументов.ВключенаПоддержкаФормированияИПодписанияФормуляров() Тогда
			Реквизиты = "ЕстьНастройкиФормированияИПодписанияФормуляров";
			ЗначенияРеквизитовШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокументаДляПодписи.Шаблон, Реквизиты);
			
			Если ЗначенияРеквизитовШаблона.ЕстьНастройкиФормированияИПодписанияФормуляров Тогда
				ПроцессыОбработкиДокументов.ФормированиеФормуляраДляПодписания(
					ДанныеДокументаДляПодписи.Задача,
					ДанныеДокументаДляПодписи.Документ,
					ДанныеДокументаДляПодписи.Шаблон,
					ДанныеДокументаДляПодписи.ИдентификаторЭтапа);
					
				ПроцессыОбработкиДокументов.ПодписаниеФормуляровЭД(
					ДанныеДокументаДляПодписи.Задача,
					НаборДанныхДляПодписи,
					УсиленнаяПодпись, УИДФормы);
			КонецЕсли;
		КонецЕсли;
			
		// первичные документы
		
		ПервичныеДокументы = Неопределено;
		ДанныеДокументаДляПодписи.Свойство("ПервичныеДокументы", ПервичныеДокументы);
		Если ПервичныеДокументы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ПервичныйДокумент Из ПервичныеДокументы Цикл
			
			Если ПервичныйДокумент.ПоФормату Тогда
				
				СериализованныйРезультат = ПроцессыОбработкиДокументов.ДанныеФорматаПервичногоДокументаВСтрокуXML(
					ДанныеДокументаДляПодписи.Документ, ПервичныйДокумент.ИдентификаторПечатнойФормы, ПервичныйДокумент.Данные);
				
				ДвоичныйРезультат = ПолучитьДвоичныеДанныеИзСтроки(СериализованныйРезультат);
				
				ДанныеСтруктура = Новый Структура;
				
				ДанныеСтруктура.Вставить("ВидДокумента", ПервичныйДокумент.ВидДокумента);
				ДанныеСтруктура.Вставить("Владелец", ДанныеДокументаДляПодписи.Документ);
				ДанныеСтруктура.Вставить("ИдентификаторПечатнойФормы", ПервичныйДокумент.ИдентификаторПечатнойФормы);
				ДанныеСтруктура.Вставить("Ссылка", ПервичныйДокумент.Файл);
				ДанныеСтруктура.Вставить("Обработчик", ПервичныйДокумент.Обработчик);
				
				ДанныеСтруктура.Вставить("Данные", ПоместитьВоВременноеХранилище(ДвоичныйРезультат, УИДФормы));
				ДанныеСтруктура.Вставить("Представление", СериализованныйРезультат);
				ДанныеСтруктура.Вставить("ИмяФайла", "");
				ДанныеСтруктура.Вставить("ФорматПервичногоДокумента", "xml");
				
				НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
				
			ИначеЕсли ЗначениеЗаполнено(ПервичныйДокумент.Обработчик) Тогда
				
				ДанныеСтруктура = Новый Структура;
				
				ДанныеСтруктура.Вставить("ВидДокумента", ПервичныйДокумент.ВидДокумента);
				ДанныеСтруктура.Вставить("Владелец", ДанныеДокументаДляПодписи.Документ);
				ДанныеСтруктура.Вставить("ИдентификаторПечатнойФормы", ПервичныйДокумент.ИдентификаторПечатнойФормы);
				ДанныеСтруктура.Вставить("Ссылка", ПервичныйДокумент.Файл);
				ДанныеСтруктура.Вставить("Обработчик", ПервичныйДокумент.Обработчик);
				
				// Для последующего сравнения с уже подписанными первичными документами
				ДанныеСтруктура.Вставить("Шаблон", ДанныеДокументаДляПодписи.Шаблон);
				ДанныеСтруктура.Вставить("ИдентификаторЭтапа", ДанныеДокументаДляПодписи.ИдентификаторЭтапа);
				
				НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
				
			ИначеЕсли НЕ ЗначениеЗаполнено(ПервичныйДокумент.Обработчик) Тогда
				
				ДанныеСтруктура = Новый Структура;
				
				ДанныеСтруктура.Вставить("ВидДокумента", ПервичныйДокумент.ВидДокумента);
				ДанныеСтруктура.Вставить("Владелец", ДанныеДокументаДляПодписи.Документ);
				ДанныеСтруктура.Вставить("ИдентификаторПечатнойФормы", ПервичныйДокумент.ИдентификаторПечатнойФормы);
				ДанныеСтруктура.Вставить("Ссылка", ПервичныйДокумент.Файл);
				ДанныеСтруктура.Вставить("Обработчик", ПервичныйДокумент.Обработчик);
				
				ДанныеСтруктура.Вставить("Данные", ПоместитьВоВременноеХранилище(ПервичныйДокумент.Данные, УИДФормы));
				ДанныеСтруктура.Вставить("Представление", ПервичныйДокумент.Представление);
				ДанныеСтруктура.Вставить("ИмяФайла", ПервичныйДокумент.ИмяФайла);
				ДанныеСтруктура.Вставить("ФорматПервичногоДокумента", "mxl");
				
				НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
				
				ДанныеСтруктура = Новый Структура;
				
				ДанныеСтруктура.Вставить("ВидДокумента", ПервичныйДокумент.ВидДокумента);
				ДанныеСтруктура.Вставить("Владелец", ДанныеДокументаДляПодписи.Документ);
				ДанныеСтруктура.Вставить("ИдентификаторПечатнойФормы", ПервичныйДокумент.ИдентификаторПечатнойФормы);
				ДанныеСтруктура.Вставить("Ссылка", ПервичныйДокумент.ФайлPDF);
				
				ДанныеСтруктура.Вставить("Данные", ПоместитьВоВременноеХранилище(ПервичныйДокумент.ДанныеPDF, УИДФормы));
				ДанныеСтруктура.Вставить("Представление", ПервичныйДокумент.Представление);
				ДанныеСтруктура.Вставить("ИмяФайла", ПервичныйДокумент.ИмяФайлаPDF);
				ДанныеСтруктура.Вставить("ФорматПервичногоДокумента", "pdf");
				
				НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеДокументаДляПодписи.Удалить("ПервичныеДокументы");
		
	КонецЦикла;
	
	Если МодульОценкаПроизводительности <> Неопределено Тогда
		МодульОценкаПроизводительности.ЗафиксироватьЗамерДлительнойОперации(
			ОписаниеЗамера, ДанныеДокументов.Количество(), "СериализацияЗначенийРеквизитов");
	КонецЕсли;
	
	Для Каждого ДанныеДокументаДляПодписи Из ДанныеДокументов Цикл
		
		// Если у документа есть присоединенные файлы, то их также необходимо подписать
		Если МодульРаботаСФайлами <> Неопределено Тогда
			
			Файлы = Новый Массив;
			
			Если (ПодписьФайловНастраиваетсяВШаблоне И ДанныеДокументаДляПодписи.ПодписыватьФайлыЭП)
				ИЛИ (НЕ ПодписьФайловНастраиваетсяВШаблоне И ПодписыватьПрисоединенныеФайлы) Тогда
				МодульРаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ДанныеДокументаДляПодписи.Документ, Файлы);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Файлы, ДанныеДокументаДляПодписи.ФайлыДляПодписи, Истина);
			
			ПервичныеДокументы = ПроцессыОбработкиДокументовКлиентСервер.МассивВСоответствие(
				ПроцессыОбработкиДокументов.ФайлыПервичныхДокументов(ДанныеДокументаДляПодписи.Документ));
			
			Для Каждого Файл Из Файлы Цикл
				
				// Первичные документы не нужно подписывать как обычные файлы
				Если ПервичныеДокументы[Файл] <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыДанныхФайла = Новый Структура;
				ПараметрыДанныхФайла.Вставить("ВызыватьИсключение", Ложь);
				ПараметрыДанныхФайла.Вставить("ПолучатьСсылкуНаДвоичныеДанные", Истина);
				ПараметрыДанныхФайла.Вставить("ИдентификаторФормы", УИДФормы);
				
				ДанныеФайла = МодульРаботаСФайлами.ДанныеФайла(Файл, ПараметрыДанныхФайла);
				
				Если ДанныеФайла.Служебный Тогда
					Продолжить;
				КонецЕсли;
				
				ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				
				Если ДвоичныеДанныеФайла = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЕстьПрисоединенныеФайлы = Истина;
				
				ДанныеСтруктура = Новый Структура;
				ДанныеСтруктура.Вставить("Данные", ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
				ДанныеСтруктура.Вставить("Представление", ДанныеФайла.ИмяФайла);
				ДанныеСтруктура.Вставить("Ссылка", Файл);
				ДанныеСтруктура.Вставить("Владелец", ДанныеДокументаДляПодписи.Документ);
				
				НаборДанныхДляПодписи.Добавить(ДанныеСтруктура);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МодульОценкаПроизводительности <> Неопределено Тогда
		МодульОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(
			ОписаниеЗамера, ДанныеДокументов.Количество(), "ПолучениеДанныхПрисоединенныхФайлов");
	КонецЕсли;
	
	СтруктураДляВозврата.Вставить("НаборДанных", НаборДанныхДляПодписи);
	
	Если ДанныеДокументов.Количество() = 1 Тогда
		ПредставлениеНабора = Строка(ДанныеДокументов[0].Документ);
	Иначе
		ПредставлениеНабора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Документы (%1)'"), ДанныеДокументов.Количество());
	КонецЕсли;
	
	Если ЕстьПрисоединенныеФайлы Тогда
		СтруктураДляВозврата.Вставить("ПредставлениеНабора", ПредставлениеНабора + НСтр("ru=' (с присоединенными файлами)'"));
	Иначе
		СтруктураДляВозврата.Вставить("ПредставлениеНабора", ПредставлениеНабора);
	КонецЕсли;
	
	Если УсиленнаяПодпись Тогда
		СтруктураДляВозврата.Вставить("МассивДоступныхСертификатов",
			ПроцессыОбработкиДокументов.МассивДоступныхДляВыбораСертификатовКлючейЭП());
	Иначе
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		СведенияДляПростойПодписи = Новый Структура("ПолноеИмя, ОрганизацииИДолжности", "", СведенияДляПростойПодписи);
		ПроцессыОбработкиДокументовПереопределяемый.ЗаполнитьСведенияОПользователе(ТекущийПользователь, СведенияДляПростойПодписи);
		СтруктураДляВозврата.Вставить("СведенияДляПростойПодписи", СведенияДляПростойПодписи);
		
	КонецЕсли;
	
	Возврат СтруктураДляВозврата;
	
КонецФункции

// Отмечает указанные задачи как принятые к исполнению.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую не удалось принять к исполнению.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ПринятьЗадачиКИсполнению(Задачи, ЗадачиСОтказом) Экспорт
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			Если ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.ПринятаКИсполнению Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача уже принята к исполнению.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.ПометкаУдаления Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача помечена на удаление.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			Результат = Неопределено;
			Если НЕ ПроцессыОбработкиДокументов.ПользовательМожетПринятьКИсполнениюЗадачу(ТекущийПользователь, ЗадачаОбъект, Результат) Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, Строка(Результат));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект.Заблокировать();
			ЗадачаОбъект.ПринятаКИсполнению = Истина;
			ЗадачаОбъект.ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
			//Если НЕ ЗначениеЗаполнено(ЗадачаОбъект.Исполнитель) Тогда
			//	ЗадачаОбъект.Исполнитель = ТекущийПользователь;
			//КонецЕсли;
			ЗадачаОбъект.Исполнитель = ТекущийПользователь;
			ЗадачаОбъект.Записать();
			
			НовыйМассивЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(НовыйМассивЗадач,
			ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.ПринятиеКИсполнению"),
			ТекущийПользователь);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

// Отмечает указанные задачи как не принятые к исполнению.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, для которой не удалось выполнить действие.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ОтменитьПринятиеЗадачКИсполнению(Задачи, ЗадачиСОтказом) Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли НЕ ЗадачаОбъект.ПринятаКИсполнению Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача не принята к исполнению.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.ИсполнительНазначенПринудительно Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Исполнитель был назначен персонально.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			Результат = Неопределено;
			Если НЕ ПроцессыОбработкиДокументов.ПользовательМожетОтменитьПринятиеКИсполнениюЗадачи(ТекущийПользователь, ЗадачаОбъект, Результат) Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, Строка(Результат));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект.Заблокировать();
			ЗадачаОбъект.ПринятаКИсполнению = Ложь;
			ЗадачаОбъект.ДатаПринятияКИсполнению = "00010101000000";
			Если Не ЗадачаОбъект.РольИсполнителя.Пустая() Тогда
				ЗадачаОбъект.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
			ЗадачаОбъект.Записать();
			
			НовыйМассивЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(НовыйМассивЗадач,
			ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.ОтменаПринятияКИсполнению"));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

// Очищает исполнителя для указанных задач при ролевой адресации
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, для которой не удалось выполнить действие.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ВернутьНаРольИсполнителя(Задачи, ЗадачиСОтказом) Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			Если ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование,
					НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.ПринятаКИсполнению Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование,
					НСтр("ru = 'Задача принята к исполнению.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.ИсполнительНазначенПринудительно Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование,
					НСтр("ru = 'Исполнитель был назначен персонально.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЗадачаОбъект.РольИсполнителя) Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование,
					НСтр("ru = 'Возврат на роль исполнителя возможен только при ролевой адресации.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли Не ЗначениеЗаполнено(ЗадачаОбъект.Исполнитель) Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование,
					НСтр("ru = 'Исполнитель уже не назначен.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект.Заблокировать();
			ЗадачаОбъект.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
			ЗадачаОбъект.Записать();
			
			НовыйМассивЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(НовыйМассивЗадач,
			ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.ВозвратНаРольИсполнителя"));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

// Устанавливает исполнителя для указанных задач с отметкой ручного назначения,
// а также отмечает эти задачи как принятые к исполнению.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   Исполнитель - СправочникСсылка.ВнешниеПользователи, СправочникСсылка.Пользователи - ссылка на назначаемого исполнителя.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, для которой не удалось выполнить действие.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура НазначитьИсполнителя(Задачи, Исполнитель, ЗадачиСОтказом) Экспорт
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			Если ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.Исполнитель = Исполнитель Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Этот исполнитель уже назначен.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект.Заблокировать();
			ЗадачаОбъект.ИсполнительНазначенПринудительно = Истина;
			ЗадачаОбъект.ПринятаКИсполнению = Истина;
			ЗадачаОбъект.ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
			ЗадачаОбъект.Исполнитель = Исполнитель;
			ЗадачаОбъект.Записать();
			
			НовыйМассивЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(НовыйМассивЗадач,
			ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.НазначениеИсполнителя"), Исполнитель);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

// Отменяет установку исполнителя для указанных задач,
// снимает отметку ручного назначения и принятия к исполнению.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, для которой не удалось выполнить действие.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ОтменитьНазначениеИсполнителя(Задачи, ЗадачиСОтказом) Экспорт
	
	МассивОбработанныхЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			Если ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			ЗадачаОбъект.Заблокировать();
			ЗадачаОбъект.ИсполнительНазначенПринудительно = Ложь;
			ЗадачаОбъект.ПринятаКИсполнению = Ложь;
			ЗадачаОбъект.ДатаПринятияКИсполнению = Дата(1,1,1);
			Если Не ЗадачаОбъект.РольИсполнителя.Пустая() Тогда
				ЗадачаОбъект.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
			КонецЕсли;
			ЗадачаОбъект.Записать();
			
			МассивОбработанныхЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ПроцессыОбработкиДокументов.СохранитьСобытиеИсторииЗадач(МассивОбработанныхЗадач,
			ПредопределенноеЗначение("Перечисление.СобытияИсторииЗадач.ОтменаНазначенияИсполнителя"));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = МассивОбработанныхЗадач;
	
КонецПроцедуры

// Отменяет выполнение указанных задач, отмечает их как невыполненные,
// прерывает выполнение задач-последователей, если они еще не были выполнены или приняты с исполнению.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, для которой не удалось выполнить действие.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ОтменитьВыполнениеЗадач(Задачи, ЗадачиСОтказом, ДополнительныйКонтекст = Неопределено) Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(Задачи);
		
		ПроцессыОбработкиДокументов.ЗаблокироватьЗадачи(Задачи);
		
		Для Каждого Задача Из Задачи Цикл
			
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(Истина);
			ЗадачаОбъект = Задача.ПолучитьОбъект();
			УстановитьПривилегированныйРежим(Ложь);
			
			Если НЕ ЗадачаОбъект.Выполнена Тогда
				ЗадачаСОтказом = Новый Структура(
					"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача еще не выполнена'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ЗадачаОбъект.Прервана Тогда
				ЗадачаСОтказом = Новый Структура(
					"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Задача была прервана'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			ИначеЕсли ПроцессыОбработкиДокументов.ЭтапЗадачиПрерван(Задача) Тогда
				ЗадачаСОтказом = Новый Структура(
					"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Этап задачи был прерван'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			СвойстваЭтапа = ПроцессыОбработкиДокументов.СвойстваЭтапаШаблонаПроцесса(ЗадачаОбъект.Шаблон, ЗадачаОбъект.ИдентификаторЭтапа);
			ПроверитьНаличиеПрерванных = НЕ СвойстваЭтапа.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных;
			
			// Если задача при выполнении прервала другие задачи, то отменить ее выполнение нельзя
			Если ПроверитьНаличиеПрерванных И ПроцессыОбработкиДокументов.ЕстьРанееПрерванныеЗадачи(Задача) Тогда
				ЗадачаСОтказом = Новый Структура(
					"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'При выполнении задачи были прерваны другие задачи'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			УстановленСтатус = ПроцессыОбработкиДокументов.УстановленныйСтатус(ЗадачаОбъект.Предмет, Задача);
			
			ПризнакПроведенности = ПроцессыОбработкиДокументовПовтИсп.ПризнакПроведенности(
				ЗадачаОбъект.Шаблон,
				Строка(ЗадачаОбъект.ИдентификаторЭтапа),
				УстановленСтатус);
			
			Если ПризнакПроведенности = Ложь
				И ОбщегоНазначения.ПроверитьПроведенностьДокументов(
					ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗадачаОбъект.Предмет)).Количество() = 0 Тогда
				ЗадачаСОтказом = Новый Структура(
					"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'Необходимо отменить проведение документа'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			Результат = Неопределено;
			Если НЕ ПроцессыОбработкиДокументов.ПользовательМожетОтменитьВыполнениеЗадачи(ТекущийПользователь, ЗадачаОбъект, Результат) Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, Строка(Результат));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
				Продолжить;
			КонецЕсли;
			
			//Исполнителю без полных прав запрещено отменять задачу
			Если Константы.ЗапретитьИсполнителямОтменуВыполненныхЭтаповПОД.Получить() Тогда
				Если НЕ Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь) Тогда
					Если ЗадачаОбъект.Исполнитель = ТекущийПользователь Тогда
						ЗадачаСОтказом = Новый Структура(
							"Задача, ПричинаОтказа", ЗадачаОбъект.Наименование, НСтр("ru = 'В настройках процессов обработки документов исполнителю запрещено отменять выполненные этапы.'"));
						ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
						Продолжить;
					КонецЕсли;
				КонецЕсли;
			Иначе	
				ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа = СвойстваЭтапа.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа;
				Если ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа Тогда
					Если НЕ Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь) Тогда
						ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", 
							ЗадачаОбъект.Наименование, 
							НСтр("ru = 'В настройках шаблона исполнителю запрещено отменять выполненную задачу этого этапа.'"));
						ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
						Продолжить;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			
			ПроцессыОбработкиДокументов.ОтменитьВыполнениеЗадачи(
				Задача,
				ЗадачаОбъект.Предмет,
				ЗадачаОбъект.Шаблон,
				ЗадачаОбъект.ИдентификаторЭтапа,
				СвойстваЭтапа,
				ДополнительныйКонтекст);
				
			ОтменитьПроведениеДокумента(ЗадачаОбъект, ЗадачиСОтказом);
			
			НовыйМассивЗадач.Добавить(Задача);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отмена выполнения задачи по обработке документа'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

// Отмечает указанные задачи как не выполненные из-за ошибки, записывает описание ошибки.
//
// Параметры:
//  ЗадачиСОшибками - Массив - коллекция, где каждый элемент - Структура с полями:
//     * Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую не удалось выполнить
//     * ОписаниеОшибки - Строка - описание ошибки при попытке выполнить задачу
//  Комментарий - Строка, Неопределено - комментарий исполнителя задачи.
//                Будет сохранен, если передано значение типа "Строка"
//
Процедура ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОшибками, Комментарий = Неопределено) Экспорт
	
	ПроцессыОбработкиДокументов.ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОшибками, Комментарий);
	
КонецПроцедуры

// Снимает признак выполняемости задач, а также задач с тем же идентификатором пачки,
// и отменяет активные фоновые задания по выполнению указанных задач
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//   ЗадачиСОтказом - Массив - массив структур со свойствами:
//      * Задача         - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, фоновое задание которой не удалось отменить.
//      * ПричинаОтказа - Строка - текст причины неудачного выполнения команды.
//
Процедура ПрерватьПроцессВыполненияЗадач(Задачи, ЗадачиСОтказом) Экспорт
	
	НовыйМассивЗадач = Новый Массив;
	
	НачатьТранзакцию();
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставПачекВыполняемыхЗадач.ИдентификаторПачки КАК ИдентификаторПачки,
		|	СоставПачекВыполняемыхЗадач.Задача КАК Задача
		|ИЗ
		|	РегистрСведений.СоставПачекВыполняемыхЗадач КАК СоставПачекВыполняемыхЗадач
		|ГДЕ
		|	СоставПачекВыполняемыхЗадач.Задача В(&Задачи)";
		
		Запрос.УстановитьПараметр("Задачи", Задачи);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		ИдентификаторыПачек = РезультатЗапроса.ВыгрузитьКолонку("ИдентификаторПачки");
		ИдентификаторыПачек = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИдентификаторыПачек);
		
		// Отмена выполнения фоновых заданий
		Отбор = Новый Структура;
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		Отбор.Вставить("Наименование", "ПроцессыОбработкиДокументов.ВыполнитьЗадачи");
		
		Для Каждого ФоновоеЗадание Из ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор) Цикл
			Если ИдентификаторыПачек.Найти(Новый УникальныйИдентификатор(ФоновоеЗадание.Ключ)) <> Неопределено Тогда
				ФоновоеЗадание.Отменить();
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ИдентификаторПачки Из ИдентификаторыПачек Цикл
			ПроцессыОбработкиДокументов.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
		КонецЦикла;
		
		ЗадачиОтмеченныеКакНевыполняемые = РезультатЗапроса.ВыгрузитьКолонку("Задача");
		
		Для Каждого Задача Из Задачи Цикл
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			Если ЗадачиОтмеченныеКакНевыполняемые.Найти(Задача) = Неопределено Тогда
				ЗадачаСОтказом = Новый Структура("Задача, ПричинаОтказа", Задача, НСтр("ru = 'Задача уже выполнена.'"));
				ЗадачиСОтказом.Добавить(ЗадачаСОтказом);
			Иначе
				НовыйМассивЗадач.Добавить(Задача);
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Задачи = НовыйМассивЗадач;
	
КонецПроцедуры

Процедура СохранитьКомментарийИсполнителяЗадачи(Задача, Комментарий) Экспорт
	
	ПроцессыОбработкиДокументов.СохранитьКомментарийИсполнителяЗадачи(Задача, Комментарий);
	
КонецПроцедуры

Функция ЗадачаНовогоДокумента(Шаблон, ИдентификаторЭтапа, Документ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	НЕ ЗадачаПоОбработкеДокумента.Выполнена
	|	И ЗадачаПоОбработкеДокумента.Исполнитель = &Исполнитель
	|	И ЗадачаПоОбработкеДокумента.Шаблон = &Шаблон
	|	И ЗадачаПоОбработкеДокумента.ИдентификаторЭтапа = &ИдентификаторЭтапа
	|	И ЗадачаПоОбработкеДокумента.Предмет = &Документ";
	
	Запрос.УстановитьПараметр("Исполнитель", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.УстановитьПараметр("ИдентификаторЭтапа", ИдентификаторЭтапа);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось определить текущую задачу по документу.'");
	КонецЕсли;
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Процедура ПроверитьСоответствиеПодписанныхИТекущихДанных(ДокументСсылка, МассивПодписей, Параметры) Экспорт
	ПроцессыОбработкиДокументов.ПроверитьСоответствиеПодписанныхИТекущихДанных(ДокументСсылка, МассивПодписей, Параметры);
КонецПроцедуры

// Выполняет попытку проведения документов.
// Дополнительно в описание ошибки непроведенного документа записывается весь лог сообщений пользователю
//
// Параметры:
//   Документы - Массив - документы, которые необходимо провести.
//
// Возвращаемое значение:
//   Массив - массив структур со свойствами:
//      * Ссылка         - ДокументСсылка - документ, который не удалось провести.
//      * ОписаниеОшибки - Строка         - текст описания ошибки при проведении.
//
Функция ПровестиДокументы(Документы, ДополнительныеСвойства) Экспорт
	
	НепроведенныеДокументы = Новый Массив;
	ИндексПоследнегоСообщения = ПолучитьСообщенияПользователю().ВГраница();
	
	Для Каждого Документ Из Документы Цикл
		НепроведенныйДокумент = ПроцессыОбработкиДокументов.ПровестиДокументы(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ), ДополнительныеСвойства);
		Если НепроведенныйДокумент.ВГраница() = 0 Тогда
			Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По ПолучитьСообщенияПользователю().ВГраница() Цикл
				НепроведенныйДокумент[0].ОписаниеОшибки = " - " + ПолучитьСообщенияПользователю()[ИндексСообщения].Текст + "
														|" + НепроведенныйДокумент[0].ОписаниеОшибки;
			КонецЦикла;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроведенныеДокументы, НепроведенныйДокумент);
	КонецЦикла;
	
	Возврат НепроведенныеДокументы;
	
КонецФункции

// Выполняет попытку отмены проведения документов.
// Дополнительно в описание ошибки непроведенного документа записывается весь лог сообщений пользователю
//
// Параметры:
//   Документы - Массив - документы, проведение которых необходимо отменить.
//
// Возвращаемое значение:
//   Массив - массив структур со свойствами:
//      * Ссылка         - ДокументСсылка - документ, проведение которого не удалось отменить.
//      * ОписаниеОшибки - Строка         - текст описания ошибки при отмене проведения.
//
Функция ОтменитьПроведениеДокументов(Документы, ДополнительныеСвойства) Экспорт
	
	ПроведенныеДокументы = Новый Массив;
	ИндексПоследнегоСообщения = ПолучитьСообщенияПользователю().ВГраница();
	
	Для Каждого Документ Из Документы Цикл
		ПроведенныйДокумент = ПроцессыОбработкиДокументов.ОтменитьПроведениеДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ), ДополнительныеСвойства);
		Если ПроведенныйДокумент.ВГраница() = 0 Тогда
			Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По ПолучитьСообщенияПользователю().ВГраница() Цикл
				ПроведенныйДокумент[0].ОписаниеОшибки = " - " + ПолучитьСообщенияПользователю()[ИндексСообщения].Текст + "
														|" + ПроведенныйДокумент[0].ОписаниеОшибки;
			КонецЦикла;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроведенныеДокументы, ПроведенныйДокумент);
	КонецЦикла;
	
	Возврат ПроведенныеДокументы;
	
КонецФункции

// Отмечает указанные задачи как выполняемые. При этом если задачи в данный момент уже выполняются,
// то вызывается исключение. Возвращает идентификатор пачки заблокированных задач.
//
// Параметры:
//   Задачи - Массив - массив ссылок на задачи.
//
// Возвращаемое значение:
//   УникальныйИдентификатор - идентификатор пачки заблокированных задач.
Функция ОтметитьЗадачиКакВыполняемые(Задачи) Экспорт
	
	ИдентификаторПачки = Неопределено;
	
	НачатьТранзакцию();
	Попытка
		
		МассивЗадач = Новый Массив;
		Для Каждого Задача Из Задачи Цикл
			Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда 
				Продолжить;
			КонецЕсли;
			МассивЗадач.Добавить(Задача);
		КонецЦикла;
		
		Если МассивЗадач.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Отсутствуют задачи для выполнения.'");
		КонецЕсли;
		
		ПроцессыОбработкиДокументов.ПроверитьИЗаблокироватьЗадачиОтВыполнения(МассивЗадач);
		
		// Создание пачки выполняемых задач
		ИдентификаторПачки = Новый УникальныйИдентификатор;
		
		МенеджерЗаписи = РегистрыСведений.ПачкиВыполняемыхЗадач.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторПачки 		= ИдентификаторПачки;
		МенеджерЗаписи.ДатаПоследнегоОбновления = ТекущаяДата();
		МенеджерЗаписи.Инициатор 				= Пользователи.ТекущийПользователь();
		МенеджерЗаписи.Записать();
		
		Для Каждого Задача Из МассивЗадач Цикл
			МенеджерЗаписи = РегистрыСведений.СоставПачекВыполняемыхЗадач.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Задача = Задача;
			МенеджерЗаписи.ИдентификаторПачки = ИдентификаторПачки;
			МенеджерЗаписи.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ИдентификаторПачки;
	
КонецФункции

// Снимает признак выполняемости всех задач в пачке.
//
// Параметры:
//   ИдентификаторПачки - УникальныйИдентификатор - Идентификатор пачки выполняемых задач, которые требуется освободить.
Процедура ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки) Экспорт
	
	ПроцессыОбработкиДокументов.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
	
КонецПроцедуры

Функция КодНастройкиФормированияИПодписанияФормуляров(ЗначениеНастройки) Экспорт
	Результат = "0";
	Если ЗначениеНастройки = Перечисления.ВариантыФормированияФормуляровПОД.ФормироватьИПодписыватьТолькоНаЭтомЭтапе Тогда
		Результат = "1";
	ИначеЕсли ЗначениеНастройки = Перечисления.ВариантыФормированияФормуляровПОД.ФормироватьИПодписыватьНаЭтомИСледующихЭтапах Тогда
		Результат = "2";
	ИначеЕсли ЗначениеНастройки = Перечисления.ВариантыФормированияФормуляровПОД.ПодписыватьНаЭтомЭтапе Тогда
		Результат = "3";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЗначениеНастройкиФормированияИПодписанияФормуляров(КодНастройки) Экспорт
	Результат = Перечисления.ВариантыФормированияФормуляровПОД.ПустаяСсылка();
	Если КодНастройки = "1" Тогда
		Результат = Перечисления.ВариантыФормированияФормуляровПОД.ФормироватьИПодписыватьТолькоНаЭтомЭтапе;
	ИначеЕсли КодНастройки = "2" Тогда
		Результат = Перечисления.ВариантыФормированияФормуляровПОД.ФормироватьИПодписыватьНаЭтомИСледующихЭтапах;
	ИначеЕсли КодНастройки = "3" Тогда
		Результат = Перечисления.ВариантыФормированияФормуляровПОД.ПодписыватьНаЭтомЭтапе;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ИдентификаторыКомандПечатиСоШтампомШаблона(ШаблонПроцесса) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныПроцессовЭтапы.ИдентификаторыКомандПечатиСоШтампом КАК ИдентификаторыКомандПечатиСоШтампом
	               |ИЗ
	               |	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	               |ГДЕ
	               |	ШаблоныПроцессовЭтапы.Ссылка = &ШаблонПроцесса";
	Запрос.УстановитьПараметр("ШаблонПроцесса", ШаблонПроцесса);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ОтмеченныеФормы = Выборка.ИдентификаторыКомандПечатиСоШтампом;
		ИдентификаторыКомандПечатиСоШтампом = СтрРазделить(ОтмеченныеФормы, ",");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ИдентификаторыКомандПечатиСоШтампом, Истина);
	КонецЦикла;	

	Возврат Результат;
КонецФункции

Процедура ВыполнитьЗадачиПоСобытию(Документ, Статус, Комментарий)  Экспорт

	 ПроцессыОбработкиДокументов.ВыполнитьЗадачиПоСобытию(Документ, Статус, Комментарий);

КонецПроцедуры 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьПроцедурыСВызовомСервера(ДанныеДокументов, ДополнительныйКонтекст, ТребуетсяЭП, ТребуетсяПростаяЭП,
	ДанныеДляПодписи, УИДФормы, ТребуетсяПроверкаПредыдущихЭП, ТребуетсяПроверкаПодписанныхДанных,
	ТребуетсяПроверкаНаличияКлючаПЭПВРеестре, ЗадачиСОтказомВыполнения) Экспорт
	
	Если ТребуетсяПроверкаНаличияКлючаПЭПВРеестре
		И ПроцессыОбработкиДокументов.УПользователяОтсутствуетКлючПЭПВРеесте() Тогда
		
		ДатаПроверки = ТекущаяДатаСеанса();
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Подписание не выполнено. Ключ простой электронной подписи пользователя отсутствует в реестре выданных ключей на %1'"),
			Формат(ДатаПроверки, "ДЛФ=D"));
		
		Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
			ЗадачаСОтказомВыполнения = Новый Структура;
			ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
			ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ДатаПроверки);
			ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
		КонецЦикла;
		
		// Задачи всех документов далее не выполняются
		ДанныеДокументов.Очистить();
		
	КонецЕсли;
	
	КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		ДанныеДокумента = ДанныеДокументов[Индекс];
		
		Если ДанныеДокумента.ТребуетсяПроверкаЗаполненностиРеквизитов Тогда
			
			ДанныеДокументаДляПроверки = Новый Структура;
			ДанныеДокументаДляПроверки.Вставить("Источник", ДанныеДокумента.Документ);
			ДанныеДокументаДляПроверки.Вставить("Шаблон", ДанныеДокумента.Шаблон);
			ДанныеДокументаДляПроверки.Вставить("ИдентификаторЭтапа", ДанныеДокумента.ИдентификаторЭтапа);
			ДанныеДокументаДляПроверки.Вставить("Отказ", Ложь);
			ДанныеДокументаДляПроверки.Вставить("ОписаниеОшибки", "");
			ДанныеДокументаДляПроверки.Вставить("Исполнитель", Неопределено);
			
			ПроцессыОбработкиДокументов.ПроверитьЗаполненностьОбязательныхРеквизитов(ДанныеДокументаДляПроверки);
			Если ДанныеДокументаДляПроверки.Отказ Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ДанныеДокументаДляПроверки.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				// Для документов с отказом задача далее не выполняется
				ДанныеДокументов.Удалить(Индекс);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		ДанныеДокумента = ДанныеДокументов[Индекс];
		
		Если ДанныеДокумента.ТребуетсяПроверкаЗаполненностиРеквизитовПервичныхДокументов Тогда
			
			ДанныеДокументаДляПроверки = Новый Структура;
			ДанныеДокументаДляПроверки.Вставить("Источник", ДанныеДокумента.Документ);
			ДанныеДокументаДляПроверки.Вставить("Шаблон", ДанныеДокумента.Шаблон);
			ДанныеДокументаДляПроверки.Вставить("ИдентификаторЭтапа", ДанныеДокумента.ИдентификаторЭтапа);
			ДанныеДокументаДляПроверки.Вставить("Отказ", Ложь);
			ДанныеДокументаДляПроверки.Вставить("ОписаниеОшибки", "");
			
			ПроцессыОбработкиДокументов.ПроверитьЗаполненностьОбязательныхРеквизитовПервичныхДокументов(ДанныеДокументаДляПроверки);
			Если ДанныеДокументаДляПроверки.Отказ Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ДанныеДокументаДляПроверки.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				// Для документов с отказом задача далее не выполняется
				ДанныеДокументов.Удалить(Индекс);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		ДанныеДокумента = ДанныеДокументов[Индекс];
		
		Если Не ЗначениеЗаполнено(ДанныеДокумента.УсловиеВыполнения) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ПроцессыОбработкиДокументов.ДокументПодходитПоУсловию(
			ДанныеДокумента.Документ, ДанныеДокумента.УсловиеВыполнения) Тогда
			
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не выполнено условие выполнения этапа: %1'"),
				ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(ДанныеДокумента.УсловиеВыполнения));
			
			ЗадачаСОтказомВыполнения = Новый Структура;
			ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
			ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
			ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
			ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
			// Для документов с отказом задача далее не выполняется
			ДанныеДокументов.Удалить(Индекс);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	Иначе
		МодульРаботаСФайлами = Неопределено;
	КонецЕсли;
	
	КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		ДанныеДокумента = ДанныеДокументов[Индекс];
		
		Если ДанныеДокумента.НаличиеФайловОбязательно И МодульРаботаСФайлами <> Неопределено Тогда
			
			Файлы = Новый Массив;
			МодульРаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ДанныеДокумента.Документ, Файлы);
			
			ФайлыПервичныхДокументов = ПроцессыОбработкиДокументов.ФайлыПервичныхДокументов(ДанныеДокумента.Документ);
			
			Файлы = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Файлы, ФайлыПервичныхДокументов);
			
			Если Файлы.Количество() = 0 Тогда
				
				ОписаниеОшибки = НСтр("ru = 'Для выполнения этапа документ должен содержать присоединенные файлы'");
				
				РасшифровкаПрисоединенныхФайлов = ДанныеДокумента.РасшифровкаОбязательныхПрисоединенныхФайлов; 
				Если ЗначениеЗаполнено(РасшифровкаПрисоединенныхФайлов) Тогда
					ПредставлениеРасшифровки = "";
					МассивРасшифровки = СтрРазделить(РасшифровкаПрисоединенныхФайлов, ";", Ложь);
					Для Каждого СтрокаРасшифровки Из МассивРасшифровки Цикл
						ПредставлениеРасшифровки = ПредставлениеРасшифровки + "- " + СтрокаРасшифровки + Символы.ПС;
					КонецЦикла;	
					
					ОписаниеОшибки = (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для выполнения текущего этапа документ ""%1"" должен содержать присоединенные файлы: 
					|%2'"),
					Строка(ДанныеДокумента.Документ), ПредставлениеРасшифровки));
				КонецЕсли;
				
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				// Для документов с отказом задача далее не выполняется
				ДанныеДокументов.Удалить(Индекс);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяЭП ИЛИ ТребуетсяПростаяЭП Тогда
		КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
		Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
			
			Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
			ДанныеДокумента = ДанныеДокументов[Индекс];
			
			// Для каждого документа необходимо определить перечень подписей, которые необходимо проверить.
			// Требуется проверить подписи с порядком ниже текущего
			
			ЭлектронныеПодписиПредыдущихЭтапов = ПроцессыОбработкиДокументов.ЭлектронныеПодписиПредыдущихЭтапов(
				ДанныеДокумента.Документ, ДанныеДокумента.Шаблон, ДанныеДокумента.ИдентификаторЭтапа);
			
			ЭлектронныеПодписи = ЭлектронныеПодписиПредыдущихЭтапов.ЭлектронныеПодписи;
			ПодписиДляПроверкиДанных = ЭлектронныеПодписиПредыдущихЭтапов.ПодписиДляПроверкиДанных;
			
			ЕстьОтрицательныеРезультатыПроверки = Ложь;
			
			Если ТребуетсяПроверкаПодписанныхДанных Тогда
				
				ПроверитьСоответствиеПодписанныхИТекущихДанных(ДанныеДокумента.Документ, ПодписиДляПроверкиДанных,
					ДанныеДокумента.ДополнительныеПараметры);
				
				Для Каждого ПровереннаяПодпись Из ПодписиДляПроверкиДанных Цикл
					
					Если ПустаяСтрока(ПровереннаяПодпись.ОписаниеОшибки) Тогда
						Продолжить;
					КонецЕсли;
					
					ЗадачаСОтказомВыполнения = Новый Структура;
					ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
					ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
					ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ПровереннаяПодпись.ОписаниеОшибки);
					ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
					// Для документов с отказом задача далее не выполняется
					ДанныеДокументов.Удалить(Индекс);
					
					ЕстьОтрицательныеРезультатыПроверки = Истина;
					
					Прервать;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЕстьОтрицательныеРезультатыПроверки Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТребуетсяПроверкаПредыдущихЭП Тогда
				// Сохранение массива усиленных ЭП для последующей клиентской проверки, если требуется проверка средствами криптопровайдера
				ЭлектронныеПодписиДляКлиента = Новый Массив;
				Для Каждого ЭлектроннаяПодписьФайла Из ЭлектронныеПодписи Цикл
					СтруктураДанных = Новый Структура;
					
					ДвоичныеДанныеФайла = Неопределено;
					Если ЭлектроннаяПодписьФайла.Свойство("ПодписанныеДанныеФайл") 
						И ЗначениеЗаполнено(ЭлектроннаяПодписьФайла.ПодписанныеДанныеФайл) Тогда
						ПрисоединенныеФайлы = Новый Массив; 
						РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ЭлектроннаяПодписьФайла.ПодписанныеДанныеФайл, ПрисоединенныеФайлы);
						ДвоичныеДанныеФайла = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныеФайлы[0], Истина);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ДвоичныеДанныеФайла) Тогда
						СтруктураДанных.Вставить("АдресДанных", ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла, УИДФормы));
					ИначеЕсли ЭлектроннаяПодписьФайла.ПодписанныеДанные <> Неопределено Тогда
						СтруктураДанных.Вставить("АдресДанных", ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.ПодписанныеДанные, УИДФормы));
					Иначе
						ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Для задачи %1 не найдены подписанные данные'"),
						ДанныеДокумента.Задача);

						ЗадачаСОтказомВыполнения = Новый Структура;
						ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
						ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
						ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
						ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);

						// Для документов с отказом задача далее не выполняется
						ДанныеДокументов.Удалить(Индекс);

						Прервать;

					КонецЕсли;
					
					СтруктураДанных.Вставить("АдресПодписи", ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.Подпись, УИДФормы));
					СтруктураДанных.Вставить("Отпечаток", ЭлектроннаяПодписьФайла.Отпечаток);
					СтруктураДанных.Вставить("Документ", ДанныеДокумента.Документ);
					СтруктураДанных.Вставить("Задача", ДанныеДокумента.Задача);
					ЭлектронныеПодписиДляКлиента.Добавить(СтруктураДанных);
				КонецЦикла;
				ДанныеДокумента.Вставить("ЭлектронныеПодписи", ЭлектронныеПодписиДляКлиента)
			Иначе
				// Проверка результата последней проверки усиленной ЭП по данным регистра
				Для Каждого ЭлектроннаяПодписьФайла Из ЭлектронныеПодписи Цикл
					
					Если ЭлектроннаяПодписьФайла.ПодписьВерна Тогда
						Продолжить;
					КонецЕсли;
					
					ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Электронная подпись (подпись от %1, автор %2, этап ""%3"") не верна по данным проверки от %4'"),
						ЭлектроннаяПодписьФайла.ДатаПодписи,
						ЭлектроннаяПодписьФайла.КомуВыданСертификат,
						ЭлектроннаяПодписьФайла.Этап,
						ЭлектроннаяПодписьФайла.ДатаПроверкиПодписи);
					
					ЗадачаСОтказомВыполнения = Новый Структура;
					ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
					ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
					ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
					ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
					
					// Для документов с отказом задача далее не выполняется
					ДанныеДокументов.Удалить(Индекс);
					
					Прервать;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	// Поиск и выполнение групповых обработчиков
	ГрупповыеОбработчики = Новый Массив;
	Для Каждого Обработчик Из ПроцессыОбработкиДокументов.ОписаниеДополнительныхОбработчиков() Цикл
		Если Обработчик.Свойство("ГрупповаяОбработка") И Обработчик.ГрупповаяОбработка Тогда
			ГрупповыеОбработчики.Добавить(Обработчик.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	НаборыДанныхДляГрупповойОбработки = Новый Структура;
	ИндексыЗадачСГрупповойОбработкой = Новый Соответствие;
	
	Для Индекс = 0 По ДанныеДокументов.ВГраница() Цикл
		ДанныеДокумента = ДанныеДокументов[Индекс];
		Если НЕ ПустаяСтрока(ДанныеДокумента.ОбработчикДоТранзакции)
			И ГрупповыеОбработчики.Найти(ДанныеДокумента.ОбработчикДоТранзакции) <> Неопределено Тогда
			
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("Источник", ДанныеДокумента.Документ);
			ПараметрыДокумента.Вставить("Задача", ДанныеДокумента.Задача);
			ПараметрыДокумента.Вставить("Отказ", Ложь);
			ПараметрыДокумента.Вставить("ОписаниеОшибки", "");
			ПараметрыДокумента.Вставить("ДополнительныеПараметры", ДанныеДокумента.ДополнительныеПараметры);
			
			Если НаборыДанныхДляГрупповойОбработки.Свойство(ДанныеДокумента.ОбработчикДоТранзакции) Тогда
				НаборыДанныхДляГрупповойОбработки[ДанныеДокумента.ОбработчикДоТранзакции].Добавить(ПараметрыДокумента);
			Иначе
				НаборыДанныхДляГрупповойОбработки.Вставить(
					ДанныеДокумента.ОбработчикДоТранзакции, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыДокумента));
			КонецЕсли;
			
			ИндексыЗадачСГрупповойОбработкой.Вставить(ПараметрыДокумента.Задача, Индекс);
			
		КонецЕсли;
	КонецЦикла;
	
	ИндексыЗадачСОтказом = Новый Массив;
	
	Для Каждого НаборДанныхДляГрупповойОбработки Из НаборыДанныхДляГрупповойОбработки Цикл
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("НаборДанных", НаборДанныхДляГрупповойОбработки.Значение);
		ПараметрыОбработчика.Вставить("Отказ", Ложь);
		ПараметрыОбработчика.Вставить("ОписаниеОшибки", "");
		ПараметрыОбработчика.Вставить("ДополнительныйКонтекст", ДополнительныйКонтекст);
		
		ИндексПоследнегоСообщения = ПолучитьСообщенияПользователю().ВГраница();
		
		ТекстСообщенийПользователю = "";
		
		Попытка
			
			ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ВыполнитьДополнительныйОбработчик(
				НаборДанныхДляГрупповойОбработки.Ключ, ПараметрыОбработчика);
			
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По СообщенияПользователю.ВГраница() Цикл
				ТекстСообщенийПользователю = ТекстСообщенийПользователю +
					" - " + СообщенияПользователю[ИндексСообщения].Текст + "
					|";
			КонецЦикла;
			
			ТекстСообщенийПользователю = СокрП(ТекстСообщенийПользователю);
			
			Если ПараметрыОбработчика.Отказ Тогда
				ПараметрыОбработчика.ОписаниеОшибки = НСтр("ru = 'В дополнительном обработчике был установлен отказ от выполнения этапа по причине:
					|'") + ПараметрыОбработчика.ОписаниеОшибки + Символы.ПС + ТекстСообщенийПользователю;
			КонецЕсли;
			
		Исключение
			
			// В случае исключения все задачи в наборе далее не выполняются
			ПараметрыОбработчика.Отказ = Истина;
			
			ПараметрыОбработчика.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По СообщенияПользователю.ВГраница() Цикл
				ТекстСообщенийПользователю = ТекстСообщенийПользователю +
					" - " + СообщенияПользователю[ИндексСообщения].Текст + "
					|";
			КонецЦикла;
			
			ТекстСообщенийПользователю = СокрП(ТекстСообщенийПользователю);
			
			ПараметрыОбработчика.ОписаниеОшибки = ПараметрыОбработчика.ОписаниеОшибки + Символы.ПС + ТекстСообщенийПользователю;
			
		КонецПопытки;
		
		Если ПараметрыОбработчика.Отказ Тогда
			Для Каждого ДанныеДокумента Из НаборДанныхДляГрупповойОбработки.Значение Цикл
				ДанныеДокумента.Отказ = Истина;
				ДанныеДокумента.ОписаниеОшибки = ПараметрыОбработчика.ОписаниеОшибки;
			КонецЦикла;
		Иначе
			Для Каждого ДанныеДокумента Из НаборДанныхДляГрупповойОбработки.Значение Цикл
				Если ДанныеДокумента.Отказ Тогда
					ДанныеДокумента.ОписаниеОшибки = НСтр("ru = 'В дополнительном обработчике был установлен отказ от выполнения этапа по причине:
					|'") + ДанныеДокумента.ОписаниеОшибки + Символы.ПС + ТекстСообщенийПользователю;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого ДанныеДокумента Из НаборДанныхДляГрупповойОбработки.Значение Цикл
			ДанныеДокументов[ИндексыЗадачСГрупповойОбработкой[ДанныеДокумента.Задача]].ДополнительныеПараметры = ДанныеДокумента.ДополнительныеПараметры;
			Если ДанныеДокумента.Отказ Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ДанныеДокумента.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				// Для документов с отказом задача далее не выполняется
				ИндексыЗадачСОтказом.Добавить(ИндексыЗадачСГрупповойОбработкой[ДанныеДокумента.Задача]);
			ИначеЕсли ДанныеДокумента.Свойство("ПараметрыОповещения") Тогда
				ДанныеДокументов[ИндексыЗадачСГрупповойОбработкой[ДанныеДокумента.Задача]].Вставить("ПараметрыОповещения", ДанныеДокумента.ПараметрыОповещения);
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныйКонтекст = ПараметрыОбработчика.ДополнительныйКонтекст;
		
	КонецЦикла;
	
	КоличествоЭлементовКоллекции = ДанныеДокументов.Количество();
	Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
		
		Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
		ДанныеДокумента = ДанныеДокументов[Индекс];
		
		Если ИндексыЗадачСОтказом.Найти(Индекс) <> Неопределено Тогда
			
			ДанныеДокументов.Удалить(Индекс);
			
		ИначеЕсли ИндексыЗадачСГрупповойОбработкой.Получить(ДанныеДокумента.Задача) = Неопределено
			И НЕ ПустаяСтрока(ДанныеДокумента.ОбработчикДоТранзакции) Тогда
			
			Для Каждого Обработчик Из СтрРазделить(ДанныеДокумента.ОбработчикДоТранзакции, ";", Ложь) Цикл
				
				ПараметрыОбработчика = Новый Структура;
				ПараметрыОбработчика.Вставить("Источник", ДанныеДокумента.Документ);
				ПараметрыОбработчика.Вставить("Задача", ДанныеДокумента.Задача);
				ПараметрыОбработчика.Вставить("ОтменаВыполнения", Ложь);
				ПараметрыОбработчика.Вставить("Отказ", Ложь);
				ПараметрыОбработчика.Вставить("ОписаниеОшибки", "");
				ПараметрыОбработчика.Вставить("ОписаниеОшибкиБезСообщений", "");
				ПараметрыОбработчика.Вставить("ДополнительныеПараметры", ДанныеДокумента.ДополнительныеПараметры);
				ПараметрыОбработчика.Вставить("ДополнительныйКонтекст", ДополнительныйКонтекст);
				
				ИндексПоследнегоСообщения = ПолучитьСообщенияПользователю().ВГраница();
				
				ТекстСообщенийПользователю = "";
				
				Попытка
					
					ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ВыполнитьДополнительныйОбработчик(Обработчик, ПараметрыОбработчика);
					
					СообщенияПользователю = ПолучитьСообщенияПользователю();
					Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По СообщенияПользователю.ВГраница() Цикл
						ТекстСообщенийПользователю = ТекстСообщенийПользователю +
							" - " + СообщенияПользователю[ИндексСообщения].Текст + "
							|";
					КонецЦикла;
					
					ТекстСообщенийПользователю = СокрП(ТекстСообщенийПользователю);
					
					Если ПараметрыОбработчика.Отказ Тогда
						ПараметрыОбработчика.ОписаниеОшибкиБезСообщений =
							НСтр("ru = 'В дополнительном обработчике был установлен отказ от выполнения этапа по причине:
							|'") + ПараметрыОбработчика.ОписаниеОшибки;
						ПараметрыОбработчика.ОписаниеОшибки = ПараметрыОбработчика.ОписаниеОшибкиБезСообщений + Символы.ПС + ТекстСообщенийПользователю;
					КонецЕсли;
					
				Исключение
					
					ПараметрыОбработчика.Отказ = Истина;
					
					ПараметрыОбработчика.ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
					
					СообщенияПользователю = ПолучитьСообщенияПользователю();
					Для ИндексСообщения = ИндексПоследнегоСообщения + 1 По СообщенияПользователю.ВГраница() Цикл
						ТекстСообщенийПользователю = ТекстСообщенийПользователю +
							" - " + СообщенияПользователю[ИндексСообщения].Текст + "
							|";
					КонецЦикла;
					
					ТекстСообщенийПользователю = СокрП(ТекстСообщенийПользователю);
					
					ПараметрыОбработчика.ОписаниеОшибкиБезСообщений = ПараметрыОбработчика.ОписаниеОшибки;
					ПараметрыОбработчика.ОписаниеОшибки = ПараметрыОбработчика.ОписаниеОшибкиБезСообщений + Символы.ПС + ТекстСообщенийПользователю;
					
				КонецПопытки;
				
				ДанныеДокумента.ДополнительныеПараметры = ПараметрыОбработчика.ДополнительныеПараметры;
				
				ДополнительныйКонтекст = ПараметрыОбработчика.ДополнительныйКонтекст;
				
				Если ПараметрыОбработчика.Отказ Тогда
					ЗадачаСОтказомВыполнения = Новый Структура;
					ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
					ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
					ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ПараметрыОбработчика.ОписаниеОшибки);
					ЗадачаСОтказомВыполнения.Вставить("СообщениеДляВывода", ПараметрыОбработчика.ОписаниеОшибкиБезСообщений);
					ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
					// Для документов с отказом задача далее не выполняется
					ДанныеДокументов.Удалить(Индекс);
					// Следующие доп. обработчики по документу не выполняются
					Прервать;
				ИначеЕсли ПараметрыОбработчика.Свойство("ПараметрыОповещения") Тогда
					ДанныеДокумента.Вставить("ПараметрыОповещения", ПараметрыОбработчика.ПараметрыОповещения);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяЭП ИЛИ ТребуетсяПростаяЭП Тогда
		Попытка
			ДанныеДляПодписи = ДанныеДляПодписиМассивДокументов(ДанныеДокументов, УИДФормы, ТребуетсяЭП);
		Исключение
			Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ТекущаяДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
			КонецЦикла;
			ДанныеДокументов.Очистить();
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтрокуИзВременногоХранилища(АдресВременногоХранилища, Кодировка) Экспорт
	
	Если ПустаяСтрока(АдресВременногоХранилища) Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ПолучитьИзВременногоХранилища(АдресВременногоХранилища).Записать(ИмяВременногоФайла);
	
	ТекстовыйФайл = Новый ЧтениеТекста(ИмяВременногоФайла, Кодировка);
	Текст = ТекстовыйФайл.Прочитать();
	ТекстовыйФайл.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Текст;
	
КонецФункции

Функция АдресДанныхГрафическойСхемы(ГрафическаяСхема) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("grs");
	ГрафическаяСхема.Записать(ИмяВременногоФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
КонецФункции

Функция НачатьВыполнениеЗадач(Контекст, ИдентификаторФормы) Экспорт
	
	ПроцессыОбработкиДокументов.ПодготовитьПараметрыПередВыполнениемЗадачВФоне(Контекст);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ПроцессыОбработкиДокументов.ВыполнитьЗадачи";
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(Контекст.ИдентификаторПачки);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("ФоновыеЗаданияПроцессыОбработкиДокументов.ВыполнитьЗадачи", Контекст, ПараметрыВыполнения);
	
КонецФункции

Функция ИспользуютсяГрафикиРаботы() Экспорт
	
	Возврат Константы.ИспользоватьГрафикиРаботы.Получить();
	
КонецФункции

Функция ИнформацияДляОповещенияОНовыхЗадачах(ДатаПредыдущегоОповещения) Экспорт
	
	Информация = Новый Структура;
	Информация.Вставить("Всего", 0);
	Информация.Вставить("Новые", 0);
	Информация.Вставить("ПринятоКИсполнению", 0);
	Информация.Вставить("Просроченные", 0);
	Информация.Вставить("ПросроченныеНовые", 0);
	Информация.Вставить("Срочные", 0);
	Информация.Вставить("СрочныеНовые", 0);
	Информация.Вставить("ТекущаяДата", ТекущаяДатаСеанса());
	Информация.Вставить("ИнтервалЗапуска", 0);
	
	Если НЕ ЗначениеЗаполнено(ДатаПредыдущегоОповещения) Тогда
		
		ЗапроситьИнформациюОВсехЗадачах = Истина;
		
		ИнтервалОповещенийОНовыхЗадачах = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиПроцессовОбработкиДокументов",
			"ИнтервалОповещенийОНовыхЗадачах",
			10);
		Информация.Вставить("ИнтервалЗапуска", ИнтервалОповещенийОНовыхЗадачах);
		
	Иначе
		ЗапроситьИнформациюОВсехЗадачах = Ложь;
	КонецЕсли;
	
	ПользователиПустаяСсылка = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка"); 
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Если НЕ ЗапроситьИнформациюОВсехЗадачах Тогда
		
		// Проверка наличия новых задач
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеЗадачи.Ссылка КАК Ссылка,
		|	ДанныеЗадачи.РольИсполнителя КАК РольИсполнителя,
		|	ДанныеЗадачи.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
		|	ДанныеЗадачи.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации
		|ПОМЕСТИТЬ ВТ_ЗадачиБезИсполнителя
		|ИЗ
		|	Задача.ЗадачаПоОбработкеДокумента КАК ДанныеЗадачи
		|ГДЕ
		|	ДанныеЗадачи.Исполнитель = &ПустаяСсылка
		|	И ДанныеЗадачи.Дата МЕЖДУ &ДатаПредыдущегоОповещения И &ТекущаяДата
		|	И ДанныеЗадачи.Выполнена = ЛОЖЬ
		|	И ДанныеЗадачи.ПометкаУдаления = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РольИсполнителя,
		|	ОсновнойОбъектАдресации,
		|	ДополнительныйОбъектАдресации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(*) КАК Новые
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеЗадачи.Ссылка КАК Ссылка
		|	ИЗ
		|		Задача.ЗадачаПоОбработкеДокумента КАК ДанныеЗадачи
		|	ГДЕ
		|		ДанныеЗадачи.Исполнитель = &Исполнитель
		|		И ДанныеЗадачи.Дата МЕЖДУ &ДатаПредыдущегоОповещения И &ТекущаяДата
		|		И ДанныеЗадачи.Выполнена = ЛОЖЬ
		|		И ДанныеЗадачи.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадачиБезИсполнителя.Ссылка
		|	ИЗ
		|		РегистрСведений.ИсполнителиЗадач КАК РегистрИсполнителиЗадач
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗадачиБезИсполнителя КАК ЗадачиБезИсполнителя
		|			ПО (РегистрИсполнителиЗадач.Исполнитель = &Исполнитель)
		|				И (ЗадачиБезИсполнителя.РольИсполнителя = РегистрИсполнителиЗадач.РольИсполнителя)
		|				И (ЗадачиБезИсполнителя.ОсновнойОбъектАдресации = РегистрИсполнителиЗадач.ОсновнойОбъектАдресации)
		|				И (ЗадачиБезИсполнителя.ДополнительныйОбъектАдресации = РегистрИсполнителиЗадач.ДополнительныйОбъектАдресации)) КАК Временный";

		Запрос.УстановитьПараметр("ДатаПредыдущегоОповещения", ДатаПредыдущегоОповещения);
		Запрос.УстановитьПараметр("ТекущаяДата", Информация.ТекущаяДата);
		Запрос.УстановитьПараметр("Исполнитель",  ТекущийПользователь);
		Запрос.УстановитьПараметр("ПустаяСсылка", ПользователиПустаяСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Информация.Новые = Информация.Новые + Выборка.Новые;
		КонецЕсли;
		
		ЗапроситьИнформациюОВсехЗадачах = ЗапроситьИнформациюОВсехЗадачах ИЛИ Информация.Новые > 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		РегистрИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя, 
		|       РегистрИсполнителиЗадач.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
		|		РегистрИсполнителиЗадач.ДополнительныйОбъектАдресации  КАК ДополнительныйОбъектАдресации
		|ПОМЕСТИТЬ ВТ_РолиИсполнителя
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК РегистрИсполнителиЗадач
        |ГДЕ  
		|	РегистрИсполнителиЗадач.Исполнитель = &Исполнитель
		|ИНДЕКСИРОВАТЬ ПО
		|	РольИсполнителя,ОсновнойОбъектАдресации,ДополнительныйОбъектАдресации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		ДанныеЗадачи.Ссылка КАК Ссылка
        |ПОМЕСТИТЬ ВТ_ЗадачиИсполнителя
		|	ИЗ
		|		Задача.ЗадачаПоОбработкеДокумента КАК ДанныеЗадачи
		|	ГДЕ
		|		ДанныеЗадачи.Исполнитель = &Исполнитель
		|		И ДанныеЗадачи.Дата < &ДатаПредыдущегоОповещения
		|		И ДанныеЗадачи.Выполнена = ЛОЖЬ
		|		И ДанныеЗадачи.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадачиПоОбработкеДокумента.Ссылка
		|	ИЗ
		|		ВТ_РолиИсполнителя КАК РолиИсполнителя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|			Задача.ЗадачаПоОбработкеДокумента КАК ЗадачиПоОбработкеДокумента 
		|				ПО РолиИсполнителя.РольИсполнителя	=	ЗадачиПоОбработкеДокумента.РольИсполнителя
		|					И РолиИсполнителя.ОсновнойОбъектАдресации	=	ЗадачиПоОбработкеДокумента.ОсновнойОбъектАдресации
		|					И РолиИсполнителя.ДополнительныйОбъектАдресации	=	ЗадачиПоОбработкеДокумента.ДополнительныйОбъектАдресации
		|					И ЗадачиПоОбработкеДокумента.Исполнитель = &ПустаяСсылка	
		|	ГДЕ
		|		ЗадачиПоОбработкеДокумента.Дата < &ДатаПредыдущегоОповещения
		|		И ЗадачиПоОбработкеДокумента.Выполнена = ЛОЖЬ
		|		И ЗадачиПоОбработкеДокумента.ПометкаУдаления = ЛОЖЬ 
        |;
		|УНИЧТОЖИТЬ ВТ_РолиИсполнителя
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ИсторияЗадачСрезПоследних.Задача) КАК Новые
		|ИЗ
		|	РегистрСведений.ИсторияЗадачПоОбработкеДокументов.СрезПоследних(
		|				&ТекущаяДата,
		|				Задача В
		|						(ВЫБРАТЬ
		|							Таблица.Ссылка
		|						ИЗ
		|							ВТ_ЗадачиИсполнителя КАК Таблица)
		|					И Период >= &ДатаПредыдущегоОповещения) КАК ИсторияЗадачСрезПоследних
		|ГДЕ
		|	(ИсторияЗадачСрезПоследних.Событие = &СобытиеНазначениеИсполнителя
		|			ИЛИ ИсторияЗадачСрезПоследних.Событие В (&СобытияВозвратаНаРоль)
		|				И ИсторияЗадачСрезПоследних.Пользователь <> &ТекущийПользователь)";

		
		Запрос.УстановитьПараметр("ДатаПредыдущегоОповещения", ДатаПредыдущегоОповещения);
		Запрос.УстановитьПараметр("ТекущаяДата", Информация.ТекущаяДата);
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("СобытиеНазначениеИсполнителя", Перечисления.СобытияИсторииЗадач.НазначениеИсполнителя);
		Запрос.УстановитьПараметр("СобытияВозвратаНаРоль", Информация.ТекущаяДата);
		Запрос.УстановитьПараметр("Исполнитель",  ТекущийПользователь);
		Запрос.УстановитьПараметр("ПустаяСсылка", ПользователиПустаяСсылка);

		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Информация.Новые = Информация.Новые + Выборка.Новые;
		КонецЕсли;
		
		ЗапроситьИнформациюОВсехЗадачах = ЗапроситьИнформациюОВсехЗадачах ИЛИ Информация.Новые > 0;
		
	КонецЕсли;
	
	Если ЗапроситьИнформациюОВсехЗадачах ИЛИ ЗначениеЗаполнено(ДатаПредыдущегоОповещения) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		РегистрИсполнителиЗадач.РольИсполнителя КАК РольИсполнителя, 
		|       РегистрИсполнителиЗадач.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
		|		РегистрИсполнителиЗадач.ДополнительныйОбъектАдресации  КАК ДополнительныйОбъектАдресации
		|ПОМЕСТИТЬ ВТ_РолиИсполнителя
		|ИЗ
		|	РегистрСведений.ИсполнителиЗадач КАК РегистрИсполнителиЗадач
        |ГДЕ  
		|	РегистрИсполнителиЗадач.Исполнитель = &Исполнитель
		|ИНДЕКСИРОВАТЬ ПО
		|	РольИсполнителя,ОсновнойОбъектАдресации,ДополнительныйОбъектАдресации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		ДанныеЗадачи.Ссылка КАК Ссылка,
		|		ДанныеЗадачи.ПринятаКИсполнению КАК ПринятаКИсполнению,
		|		ДанныеЗадачи.СрокВыполнения КАК СрокВыполнения,
		|		ДанныеЗадачи.СрокОбработки КАК СрокОбработки,
		|		ДанныеЗадачи.СрокНапоминания КАК СрокНапоминания,
		|		ДанныеЗадачи.СрокНапоминанияОбработки КАК СрокНапоминанияОбработки,
		|		ДанныеЗадачи.РегламентныйИнтервал КАК РегламентныйИнтервал,
		|		ДанныеЗадачи.НомерИтерации КАК НомерИтерации,
		|		ДанныеЗадачи.Предмет КАК Предмет,
		|		ДанныеЗадачи.ИдентификаторЭтапа КАК ИдентификаторЭтапа
        |ПОМЕСТИТЬ ВТ_ЗадачиПоИсполнителю 
		|	ИЗ
		|		Задача.ЗадачаПоОбработкеДокумента КАК ДанныеЗадачи
		|	ГДЕ
		|		ДанныеЗадачи.Исполнитель = &Исполнитель
		|		И ДанныеЗадачи.Выполнена = ЛОЖЬ
		|		И ДанныеЗадачи.ПометкаУдаления = ЛОЖЬ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадачиПоОбработкеДокумента.Ссылка,
		|		ЗадачиПоОбработкеДокумента.ПринятаКИсполнению КАК ПринятаКИсполнению,
		|		ЗадачиПоОбработкеДокумента.СрокВыполнения КАК СрокВыполнения,
		|		ЗадачиПоОбработкеДокумента.СрокОбработки КАК СрокОбработки,
		|		ЗадачиПоОбработкеДокумента.СрокНапоминания КАК СрокНапоминания,
		|		ЗадачиПоОбработкеДокумента.СрокНапоминанияОбработки КАК СрокНапоминанияОбработки,
		|		ЗадачиПоОбработкеДокумента.РегламентныйИнтервал КАК РегламентныйИнтервал,
		|		ЗадачиПоОбработкеДокумента.НомерИтерации КАК НомерИтерации,
		|		ЗадачиПоОбработкеДокумента.Предмет КАК Предмет,
		|		ЗадачиПоОбработкеДокумента.ИдентификаторЭтапа КАК ИдентификаторЭтапа
		|	ИЗ
		|		ВТ_РолиИсполнителя КАК РолиИсполнителя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|			Задача.ЗадачаПоОбработкеДокумента КАК ЗадачиПоОбработкеДокумента 
		|				ПО РолиИсполнителя.РольИсполнителя = ЗадачиПоОбработкеДокумента.РольИсполнителя
		|					И РолиИсполнителя.ОсновнойОбъектАдресации = ЗадачиПоОбработкеДокумента.ОсновнойОбъектАдресации
		|					И РолиИсполнителя.ДополнительныйОбъектАдресации = ЗадачиПоОбработкеДокумента.ДополнительныйОбъектАдресации
		|					И ЗадачиПоОбработкеДокумента.Исполнитель = &ПустаяСсылка	
		|	ГДЕ
		|		ЗадачиПоОбработкеДокумента.Выполнена = ЛОЖЬ
		|		И ЗадачиПоОбработкеДокумента.ПометкаУдаления = ЛОЖЬ 
        |;
		|УНИЧТОЖИТЬ ВТ_РолиИсполнителя
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОЛИЧЕСТВО(ЗадачиПоИсполнителю.Ссылка) КАК Всего,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадачиПоИсполнителю.ПринятаКИсполнению
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПринятоКИсполнению,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадачиПоИсполнителю.СрокВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокВыполнения < &ТекущаяДата
		|					ИЛИ НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту < &ТекущаяДата
		|					ИЛИ НЕ ЗадачиПоИсполнителю.СрокОбработки ЕСТЬ NULL 
		|			    		И (ЗадачиПоИсполнителю.СрокОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|			   			И ЗадачиПоИсполнителю.СрокОбработки < &ТекущаяДата)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Просроченные,
		|	0 КАК ПросроченныеНовые,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадачиПоИсполнителю.СрокВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокНапоминания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокВыполнения >= &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминания < &ТекущаяДата
		|					ИЛИ НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту >= &ТекущаяДата
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания < &ТекущаяДата
		|					ИЛИ НЕ ЗадачиПоИсполнителю.СрокОбработки ЕСТЬ NULL
		|						И ЗадачиПоИсполнителю.СрокОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И НЕ ЗадачиПоИсполнителю.СрокНапоминанияОбработки ЕСТЬ NULL
		|						И ЗадачиПоИсполнителю.СрокНапоминанияОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокОбработки >= &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминанияОбработки < &ТекущаяДата
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Срочные,
		|	0 КАК СрочныеНовые
		|ИЗ ВТ_ЗадачиПоИсполнителю КАК ЗадачиПоИсполнителю
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭтапыРегламентногоИнтервалаДокумента КАК ЭтапыРегламентногоИнтервалаДокумента
		|		ПО ЗадачиПоИсполнителю.РегламентныйИнтервал = ЭтапыРегламентногоИнтервалаДокумента.РегламентныйИнтервал
		|			И ЗадачиПоИсполнителю.НомерИтерации = ЭтапыРегламентногоИнтервалаДокумента.НомерИтерации
		|			И ЗадачиПоИсполнителю.Предмет = ЭтапыРегламентногоИнтервалаДокумента.Предмет
		|			И ЗадачиПоИсполнителю.ИдентификаторЭтапа = ЭтапыРегламентногоИнтервалаДокумента.ИдентификаторЭтапа";
		
		Запрос.УстановитьПараметр("ТекущаяДата", Информация.ТекущаяДата);
		Запрос.УстановитьПараметр("Исполнитель",  ТекущийПользователь);
		Запрос.УстановитьПараметр("ПустаяСсылка", ПользователиПустаяСсылка);
		
		Если ЗначениеЗаполнено(ДатаПредыдущегоОповещения) Тогда
			Запрос.УстановитьПараметр("ДатаПредыдущегоОповещения", ДатаПредыдущегоОповещения);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК ПросроченныеНовые",
				"СУММА(ВЫБОР
		|			КОГДА ЗадачиПоИсполнителю.СрокВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокВыполнения < &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокВыполнения > &ДатаПредыдущегоОповещения
		|					ИЛИ НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту < &ТекущаяДата
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту > &ДатаПредыдущегоОповещения
		|					ИЛИ НЕ ЗадачиПоИсполнителю.СрокОбработки ЕСТЬ NULL 
		|		    			И (ЗадачиПоИсполнителю.СрокОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|		   				И ЗадачиПоИсполнителю.СрокОбработки < &ТекущаяДата) 
		|		    			И ЗадачиПоИсполнителю.СрокОбработки > &ДатаПредыдущегоОповещения
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ПросроченныеНовые");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СрочныеНовые",
				"СУММА(ВЫБОР
		|			КОГДА ЗадачиПоИсполнителю.СрокВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокНапоминания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокВыполнения >= &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминания < &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминания > &ДатаПредыдущегоОповещения
		|					ИЛИ НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И НЕ ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания ЕСТЬ NULL
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту >= &ТекущаяДата
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания < &ТекущаяДата
		|						И ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания > &ДатаПредыдущегоОповещения
		|					ИЛИ ЗадачиПоИсполнителю.СрокОбработки ЕСТЬ NULL
		|						И ЗадачиПоИсполнителю.СрокОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И НЕ ЗадачиПоИсполнителю.СрокНапоминанияОбработки ЕСТЬ NULL
		|						И ЗадачиПоИсполнителю.СрокНапоминанияОбработки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						И ЗадачиПоИсполнителю.СрокОбработки >= &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминанияОбработки < &ТекущаяДата
		|						И ЗадачиПоИсполнителю.СрокНапоминанияОбработки > &ДатаПредыдущегоОповещения

		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СрочныеНовые");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			// Если запрос был выполнен только из-за новых срочных и просроченных задач и таковых нет, то результат не заполняется
			Если НЕ ЗапроситьИнформациюОВсехЗадачах И ЗначениеЗаполнено(ДатаПредыдущегоОповещения)
				И Выборка.ПросроченныеНовые = 0 И Выборка.СрочныеНовые = 0 Тогда
				
			Иначе
				ЗаполнитьЗначенияСвойств(Информация, Выборка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Информация;
	
КонецФункции

Функция СокращенноеИмяФайла(ИмяФайла, ТребуемаяДлина) Экспорт
	
	Возврат ОбщегоНазначения.СократитьСтрокуКонтрольнойСуммой(ИмяФайла, ТребуемаяДлина);
	
КонецФункции

Функция ТабличныйДокументПоДвоичнымДанным(Знач ДвоичныеДанные) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ТипЗнч(ДвоичныеДанные) = Тип("Строка") Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДвоичныеДанные);
	КонецЕсли;
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат ТабДок;
	КонецЕсли;
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	Возврат МодульУправлениеПечатью.ТабличныйДокументПоДвоичнымДанным(ДвоичныеДанные);
	
КонецФункции

Процедура ПроверитьСовпадениеФайловПервичныхДокументовСРанееПодписанными(ПервичныеДокументы, УникальныйИдентификатор) Экспорт
	
	Для Каждого ПервичныйДокумент Из ПервичныеДокументы Цикл
		
		ПервичныйДокумент.Вставить("Файл");
		ПервичныйДокумент.Вставить("ФайлPDF");
		
		ПакетЗапросов = ПроцессыОбработкиДокументов.ПакетЗапросовПоИмеющимсяПервичнымДокументам(ПервичныйДокумент.Предмет,
			ПервичныйДокумент.ИдентификаторПечатнойФормы, ПервичныйДокумент.Шаблон, ПервичныйДокумент.ИдентификаторЭтапа);
		
		ВыборкаMXL = ПакетЗапросов[0].Выбрать();
		ВыборкаPDF = ПакетЗапросов[1].Выбрать();
		
		Если НЕ ВыборкаMXL.Следующий() Тогда
			Продолжить;
		КонецЕсли;
		
		Данные = ПолучитьИзВременногоХранилища(ПервичныйДокумент.Данные);
		
		Если РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаMXL.ПервичныйДокумент) = Данные Тогда
			ПервичныйДокумент.Вставить("Файл", ВыборкаMXL.ПервичныйДокумент);
			// Если mxl-файлы совпадают, то считаем, что pdf-файлы тоже
			ВыборкаPDF.Следующий();
			ПервичныйДокумент.Вставить("ФайлPDF", ВыборкаPDF.ПервичныйДокумент);
			ПервичныйДокумент.Вставить("ДанныеPDF", ПоместитьВоВременноеХранилище(
				РаботаСФайлами.ДвоичныеДанныеФайла(ВыборкаPDF.ПервичныйДокумент), УникальныйИдентификатор));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКонстантуПроверятьСведенияОДолжностиПодписантаПЭППОД() Экспорт 
	
	Возврат Константы.ПроверятьСведенияОДолжностиПодписантаПЭППОД.Получить();
	
КонецФункции

Процедура ОтменитьПроведениеДокумента(Знач ЗадачаОбъект, Знач ЗадачиСОтказом)
	
	Если Константы.ОтменятьПроведениеДокументаПриОтменеВыполненияЭтапа.Получить()
		И ЗадачаОбъект.Предшественники.Количество() > 0 Тогда
		
		ПредыдущаяЗадача = ЗадачаОбъект.Предшественники[0].ЗадачаПредшественник; 
		ПредыдущаяЗадачаДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредыдущаяЗадача,
																			"Предмет, Шаблон, ИдентификаторЭтапа, Этап");
		
		УстановленСтатусПредыдущейЗадачи = ПроцессыОбработкиДокументов.УстановленныйСтатус(ПредыдущаяЗадачаДанные.Предмет, 	
																							ПредыдущаяЗадача);
		
		ПризнакПроведенностиПредыдущегоЭтапа = ПроцессыОбработкиДокументовПовтИсп.ПризнакПроведенности(
																				ПредыдущаяЗадачаДанные.Шаблон,
																				Строка(ПредыдущаяЗадачаДанные.ИдентификаторЭтапа),
																				УстановленСтатусПредыдущейЗадачи);
		
		Если ПризнакПроведенностиПредыдущегоЭтапа = Ложь
			И ОбщегоНазначения.ПроверитьПроведенностьДокументов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗадачаОбъект.Предмет)).Количество() = 0 
			И ЗадачиСОтказом.Найти(ЗадачаОбъект.Наименование) = Неопределено Тогда
			
			ПризнакЗапретаПроведенияТекущегоЭтапа = ПроцессыОбработкиДокументов.ПризнакЗапретаПроведенияЭтапа(
													ЗадачаОбъект.Шаблон,
													Строка(ЗадачаОбъект.ИдентификаторЭтапа));
													
			Если ПризнакЗапретаПроведенияТекущегоЭтапа Тогда 
					
					ПредставлениеРеквизитовЗадачи = Новый Массив();
					ПредставлениеРеквизитовЗадачи.Добавить(ЗадачаОбъект.Предмет);
					ПредставлениеРеквизитовЗадачи.Добавить(ЗадачаОбъект.Шаблон);
					ПредставлениеРеквизитовЗадачи.Добавить(ЗадачаОбъект.Этап);

					ПредставлениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ПредставлениеРеквизитовЗадачи, "Представление");
					ПредставлениеШаблона   = ПредставлениеРеквизитов.Получить(ЗадачаОбъект.Шаблон).Представление;
					ПредставлениеЭтапа     = ПредставлениеРеквизитов.Получить(ЗадачаОбъект.Этап).Представление;
					ПредставлениеДокумента = ПредставлениеРеквизитов.Получить(ЗадачаОбъект.Предмет).Представление;
					
					ОписаниеОшибки = НСтр(СтрШаблон("ru = 'для шаблона процесса ""%1"" на этапе ""%2"" установлен запрет на отмену проведения документа'",
									 ПредставлениеШаблона, ПредставлениеЭтапа));
					
					ВызватьИсключение НСтр(СтрШаблон("ru = 'Не удалось отменить проведение документа %1 по причине %2: '", 
									  ПредставлениеДокумента, 
									  ОписаниеОшибки));
			КонецЕсли;										
			
			Если Пользователи.РолиДоступны("ОтменаВыполненияЗадачПоОбработкеДокументов", Пользователи.ТекущийПользователь()) Тогда
				ДополнительныеСвойства = Новый Структура("ПроцессыОбработкиДокументов_ЗаписатьБезПроверки", Истина);
			Иначе	
				ДополнительныеСвойства = Новый Структура("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиЗапущенногоПроцессаВыполнения", Истина); 
			КонецЕсли;
			
			ДокументыДляОтменыПроведения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗадачаОбъект.Предмет);
			
			СписокНепроведенныхДокументов = ОтменитьПроведениеДокументов(ДокументыДляОтменыПроведения, ДополнительныеСвойства);
			
			Если СписокНепроведенныхДокументов.Количество() = 1 Тогда 
				
				ОписаниеОшибки = СписокНепроведенныхДокументов[0].ОписаниеОшибки;
				ВызватьИсключение НСтр(СтрШаблон("ru = 'Не удалось отменить проведение документа %1 по причине %2'", 
								  ПредставлениеДокумента, 
								  ОписаниеОшибки));
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

Функция МногопоточнаПроверкаПодписанныхДанныхНаСервере(УникальныйИдентификатор, ДанныеДокументов) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение многопоточной проверки подписанных данных'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;

	
	ПараметрыМетода = Новый Соответствие(); 
	
	ПотокиДокументов = Новый Соответствие(); 
	ИндексПотока = 0;
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
	     Результат = ПроцессыОбработкиДокументов.ЭлектронныеПодписиПредыдущихЭтапов(ДанныеДокумента.Документ, 
		             ДанныеДокумента.Шаблон, ДанныеДокумента.ИдентификаторЭтапа);
		 КоличествоЭлектронныхПодписейПредыдущихЭтапов = ?(Результат.Свойство("ПодписиДляПроверкиДанных"), 
		 												   Результат.ПодписиДляПроверкиДанных.Количество(), 
														   0);

         ИндексПодписи = 0;
		 Пока ИндексПодписи < КоличествоЭлектронныхПодписейПредыдущихЭтапов Цикл 
			 
			 КодПотока = "Поток" + Строка(ИндексПотока);
			 ПараметрыПотока 						= ПроцессыОбработкиДокументов.ПараметрыМногопоточнойФункции();
			 ПараметрыПотока.Документ       		= ДанныеДокумента.Документ;
			 ПараметрыПотока.Шаблон       			= ДанныеДокумента.Шаблон; 
			 ПараметрыПотока.ИдентификаторЭтапа		= ДанныеДокумента.ИдентификаторЭтапа;
			 ПараметрыПотока.ИндексПотока        	= ИндексПодписи; 
			 
			 ПараметрыВызоваСервера = Новый Массив;
			 ПараметрыВызоваСервера.Добавить(КодПотока); 		 
			 ПараметрыВызоваСервера.Добавить(ПараметрыПотока);    // Параметры функции в потоке
			 
			 ПараметрыМетода.Вставить(КодПотока,ПараметрыВызоваСервера); 
			 ИндексПодписи = ИндексПодписи + 1;
			 ИндексПотока = ИндексПотока + 1;
         КонецЦикла;
	КонецЦикла;
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункциюВНесколькоПотоков("ФоновыеЗаданияПроцессыОбработкиДокументов.ВыполнитьПроверкуПодписанныхДанныхМногопоточно",
						ПараметрыВыполнения, ПараметрыМетода);
		
	Возврат ФоновоеЗадание;	
	
КонецФункции 

Функция СуществуютЭлектронныеПодписииПредыдущихЭтапов(ДанныеДокументов) Экспорт
	ВозможностьИспользоватьМногопотончнуюПроверку = Истина;
	
	 Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		
	     Результат = ПроцессыОбработкиДокументов.ЭлектронныеПодписиПредыдущихЭтапов(ДанныеДокумента.Документ, 
		             ДанныеДокумента.Шаблон, ДанныеДокумента.ИдентификаторЭтапа);
		 КоличествоЭлектронныхПодписейПредыдущихЭтапов = ?(Результат.Свойство("ПодписиДляПроверкиДанных"), 
		 												   Результат.ПодписиДляПроверкиДанных.Количество(), 
														   0);
		 Если КоличествоЭлектронныхПодписейПредыдущихЭтапов < 1 Тогда
			 // многопоточная проверка возможна только если для каждого документа 
			 // есть хотя бы одна подпись на предыдущем этапе	
			 ВозможностьИспользоватьМногопотончнуюПроверку = Ложь;
		 КонецЕсли;	  
		 
	КонецЦикла;	 

	Возврат ВозможностьИспользоватьМногопотончнуюПроверку;
	
КонецФункции

#КонецОбласти
