#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("СоздатьФормуЗачетаСтоБаллов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Процедура СоздатьФормуЗачетаСтоБаллов(ПараметрыОбновления = Неопределено) Экспорт
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ФормыЗачетаМероприятийОбучения");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ОценкиОбучения");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ФормаЗачетаШкалаСтоБалловСсылка = НайтиПоНаименованию(НСтр("ru = '100-балльная шкала'"));
		Если Не ЗначениеЗаполнено(ФормаЗачетаШкалаСтоБалловСсылка) Тогда
			ФормаЗачетаШкалаСтоБаллов = СоздатьЭлемент();
			ФормаЗачетаШкалаСтоБаллов.Наименование = НСтр("ru = '100-балльная шкала'");
			ФормаЗачетаШкалаСтоБаллов.Записать();
			ФормаЗачетаШкалаСтоБалловСсылка = ФормаЗачетаШкалаСтоБаллов.Ссылка;
			Для Оценка = 0 По 100 Цикл
				НовыйЭлементОценка = Справочники.ОценкиОбучения.СоздатьЭлемент();
				НовыйЭлементОценка.Владелец = ФормаЗачетаШкалаСтоБалловСсылка;
				НовыйЭлементОценка.Записать();
			КонецЦикла;
		КонецЕсли;
		ЭлементНоль = Справочники.ОценкиОбучения.НайтиПоРеквизиту("Балл", 0,, ФормаЗачетаШкалаСтоБалловСсылка);
		Если ЗначениеЗаполнено(ЭлементНоль) Тогда
			ОценкаОбъект = ЭлементНоль.ПолучитьОбъект();
		Иначе
			ОценкаОбъект = Справочники.ОценкиОбучения.СоздатьЭлемент();
			ОценкаОбъект.Владелец = ФормаЗачетаШкалаСтоБалловСсылка;
		КонецЕсли; 
		ОценкаОбъект.Наименование = 0;
		ОценкаОбъект.Записать();
		Для Оценка = 1 По 100 Цикл
			ЭлементОценка = Справочники.ОценкиОбучения.НайтиПоРеквизиту("Балл", Оценка,, ФормаЗачетаШкалаСтоБалловСсылка);
			ОценкаОбъект = ЭлементОценка.ПолучитьОбъект();
			ОценкаОбъект.Наименование = ОценкаОбъект.Балл;
			ОценкаОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли