///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ИнтернетПоддержкаПользователейВызовСервера.
//
// Серверные процедуры и функции Интернет-поддержки пользователей:
//  - определение доступности подключения;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет, доступно ли текущему пользователю выполнение подключения
// Интернет-поддержки: авторизация/регистрация пользователя, регистрация
// программного продукта в соответствии с текущим режимом работы
// и правами пользователя.
//
// Возвращаемое значение:
//  Булево - Истина - подключение Интернет-поддержки доступно,
//           Ложь - в противном случае.
//
Функция ДоступноПодключениеИнтернетПоддержки() Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиПрограммы

// Обработка события отключения Интернет-поддержки пользователей.
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция ВыйтиИзИПП() Экспорт
	
	// Проверка права записи данных
	Если Не ИнтернетПоддержкаПользователей.ПравоЗаписиПараметровИПП() Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав для записи данных аутентификации Интернет-поддержки.'");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ИнтернетПоддержкаПользователей.Отключить();
	
КонецФункции

// Возвращает значение функциональной опции "ОтправлятьПисьмаВФорматеHTML"
//
// Возвращаемое значение:
//  Булево - признак использования функциональной опции "ОтправлятьПисьмаВФорматеHTML".
//
Функция ОтправлятьПисьмаВФорматеHTML() Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.ОтправлятьПисьмаВФорматеHTML();
	
КонецФункции

#КонецОбласти

#Область Тарификация

// См. ИнтернетПоддержкаПользователей.УслугаПодключена.
//
Функция УслугаПодключена(Знач ИдентификаторУслуги, Знач ЗначениеРазделителя = Неопределено) Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслуги, ЗначениеРазделителя);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область КодированиеСтроки

// Преобразует переданную строку в кодировку URL.
//
// Параметры:
//  СтрокаДляКодирования - Строка - строка для кодирования.
// 
// Возвращаемое значение:
//  Строка - перекодированная строка.
//
Функция СтрокаВURLКодировке(Знач СтрокаДляКодирования) Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.СтрокаВURLКодировке(СтрокаДляКодирования);
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

// См. ИнтернетПоддержкаПользователей.СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта.
//
Функция СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(Знач URLСтраницыСайта) Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.СлужебнаяURLДляПереходаНаСтраницуИнтегрированногоСайта(URLСтраницыСайта);
	
КонецФункции

// Проверяет, что введены логин и пароль интернет-поддержки.
//
// Возвращаемое значение:
//  Булево - признак того, что интернет-поддержка пользователя подключена.
//
Функция ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Экспорт 
	
	ЕстьДанныеАутентификации = 
		ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		
	Возврат ЕстьДанныеАутентификации;
	
КонецФункции

// см. ИнтернетПоддержкаПользователей.ДоменРасположенияСерверовИПП.
// 
Функция ДоменРасположенияСерверовИПП() Экспорт
	
	Возврат ИнтернетПоддержкаПользователей.ДоменРасположенияСерверовИПП();
	
КонецФункции

#КонецОбласти

#КонецОбласти
