
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьРеквизитыОтбора");
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьРеквизитыОтбора(Параметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЖурналНовыхСобытий.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ЖурналОтправокВКонтролирующиеОрганы.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА ЖурналОтчетовСтатусы.Ссылка ЕСТЬ NULL
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтраницыЖурналаОтчетность.Входящие)
		|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтраницыЖурналаОтчетность.Отчеты)
		|			КОНЕЦ
		|		ИНАЧЕ ЖурналОтправокВКонтролирующиеОрганы.СтраницаЖурнала
		|	КОНЕЦ КАК СтраницаЖурнала,
		|	ВЫБОР
		|		КОГДА ЖурналОтправокВКонтролирующиеОрганы.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА ЖурналОтчетовСтатусы.Ссылка ЕСТЬ NULL
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыКонтролирующихОрганов.ПустаяСсылка)
		|				ИНАЧЕ ЖурналОтчетовСтатусы.ВидКонтролирующегоОргана
		|			КОНЕЦ
		|		ИНАЧЕ ЖурналОтправокВКонтролирующиеОрганы.ВидКонтролирующегоОргана
		|	КОНЕЦ КАК ВидКонтролирующегоОргана,
		|	ВЫБОР
		|		КОГДА ЖурналОтправокВКонтролирующиеОрганы.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА ЖурналОтчетовСтатусы.Ссылка ЕСТЬ NULL
		|					ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИНАЧЕ ЖурналОтчетовСтатусы.ДатаНачала
		|			КОНЕЦ
		|		ИНАЧЕ ЖурналОтправокВКонтролирующиеОрганы.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ЖурналОтправокВКонтролирующиеОрганы.Ссылка ЕСТЬ NULL
		|			ТОГДА ВЫБОР
		|				КОГДА ЖурналОтчетовСтатусы.Ссылка ЕСТЬ NULL
		|					ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				ИНАЧЕ ЖурналОтчетовСтатусы.ДатаОкончания
		|			КОНЕЦ
		|		ИНАЧЕ ЖурналОтправокВКонтролирующиеОрганы.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ЖурналОтправокВКонтролирующиеОрганы.Ссылка ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДокументовВЖурнале.ПустаяСсылка)
		|		ИНАЧЕ ЖурналОтправокВКонтролирующиеОрганы.ВидДокумента
		|	КОНЕЦ КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.ЖурналНовыхСобытий КАК ЖурналНовыхСобытий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы КАК ЖурналОтправокВКонтролирующиеОрганы
		|		ПО ЖурналНовыхСобытий.Ссылка = ЖурналОтправокВКонтролирующиеОрганы.Ссылка
		|			И ЖурналНовыхСобытий.Организация = ЖурналОтправокВКонтролирующиеОрганы.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтчетовСтатусы КАК ЖурналОтчетовСтатусы
		|		ПО ЖурналНовыхСобытий.Ссылка = ЖурналОтчетовСтатусы.Ссылка
		|			И ЖурналНовыхСобытий.Организация = ЖурналОтчетовСтатусы.Организация
		|ГДЕ
		|	ЖурналНовыхСобытий.СтраницаЖурнала = ЗНАЧЕНИЕ(Перечисление.СтраницыЖурналаОтчетность.ПустаяСсылка)
		|	ИЛИ ЖурналНовыхСобытий.ВидКонтролирующегоОргана = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролирующихОрганов.ПустаяСсылка)");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ЖурналНовыхСобытий.СоздатьМенеджерЗаписи();
		ВыборкаСсылка = Выборка.Ссылка;
		Если НЕ ЗначениеЗаполнено(ВыборкаСсылка) Тогда
			Продолжить;
		КонецЕсли;
		МенеджерЗаписи.Ссылка = ВыборкаСсылка;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() И (НЕ ЗначениеЗаполнено(МенеджерЗаписи.СтраницаЖурнала)
			ИЛИ НЕ ЗначениеЗаполнено(МенеджерЗаписи.ВидКонтролирующегоОргана)) Тогда
			
			Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			МенеджерЗаписи.СтраницаЖурнала = Выборка.СтраницаЖурнала;
			ВидКонтролирующегоОргана = Выборка.ВидКонтролирующегоОргана;
			МенеджерЗаписи.ВидКонтролирующегоОргана =
				?(ТипЗнч(ВидКонтролирующегоОргана) = Тип("ПеречислениеСсылка.ТипыКонтролирующихОрганов"),
				ВидКонтролирующегоОргана, Перечисления.ТипыКонтролирующихОрганов.ПустаяСсылка());
			МенеджерЗаписи.ДатаНачала = Выборка.ДатаНачала;
			МенеджерЗаписи.ДатаОкончания = Выборка.ДатаОкончания;
			МенеджерЗаписи.ВидДокумента = Выборка.ВидДокумента;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли