
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Код - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция Подключить(Код) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	КодАвторизации = Код;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе
Функция ИнформацияОПользователе(Показыватьпредупреждение = Истина) Экспорт
	
	ИнформацияОПользователе = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("core/v1/accounts/self");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОПользователеAvito = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
	Иначе
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеИнформацияОПользователе(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	ИнформацияОПользователе.ИдентификаторПользователя =
		Формат(ЗначениеСвойстваУзла(ИнформацияОПользователеAvito, "id"), "ЧГ=0");
	ИнформацияОПользователе.ИмяПользователя = ЗначениеСвойстваУзла(ИнформацияОПользователеAvito, "name");
	
	Возврат ИнформацияОПользователе;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
// 
// Параметры:
//  Показыватьпредупреждение - Булево -
Функция ПроверитьПодключение(Показыватьпредупреждение = Истина) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен(Показыватьпредупреждение);
	КонецЕсли;
	
	Если Результат.Подключен Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКлассификаторы() Экспорт
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура());
	
КонецФункции

// Найти кандидатов.
// 
// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений: см. Обработки.ПоискРезюмеВИнтернете.НайденныеКандидаты
//  СтруктураОтбора - Структура: см. РекрутинговыеСайтыСлужебный.СтруктураОтбораКандидатов
//  ПараметрыПоиска - Структура: см. РекрутинговыеСайтыСлужебный.НовыеПараметрыПоиска
Процедура НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	НомерСтраницы = ПараметрыПоиска.НомерСтраницы;
	ПолеСортировки = ПараметрыПоиска.ПолеСортировки;
	ВсегоКандидатов = ПараметрыПоиска.ВсегоКандидатов;
	
	СтрокаОтбора = СтрокаОтбора(СтруктураОтбора, НомерСтраницы);
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("job/v1/resumes?" + СтрокаОтбора);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоискаРезюме(Сайт, ЭтотОбъект, РезультатЗапроса)
	Иначе
		РезультатПоискаРезюме = ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса);
		
		Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(РезультатПоискаРезюме, "resumes")) Тогда
			Возврат;
		КонецЕсли;
		
		ВсегоКандидатов = ЗначениеСвойстваУзла(РезультатПоискаРезюме, "meta", "pages")
			* ЗначениеСвойстваУзла(РезультатПоискаРезюме, "meta", "per_page");
		
		ПараметрыПоиска.ВсегоКандидатов = Мин(Число(ВсегоКандидатов), 500);
		
		ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Массив из См. СтруктураПоля
Функция ПоляВакансии(ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONНачалоОбъекта = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта();
	ТипЗначенияJSONНачалоМассива = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();
	ТипЗначенияJSONБулево = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONБулево();

	МассивПолей = Новый Массив;
	
	// Название
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "title";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название (не более 50 символов)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Сфера деятельности
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "business_area";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Сфера деятельности'");
	СтруктураПоля.Обязательное = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Профессия
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "profession";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Профессия'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Описание
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "description";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание (не более 5000 символов)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Вариант размещения
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "billing_type";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Вариант платного размещения'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Опыт работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "experience";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Опыт работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// График работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "schedule";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'График работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Способ оформления
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "registration_method";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Способ оформления'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Подработка
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "is_side_job";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Подработка'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Работа из дома
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "is_remote";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Работа из дома'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Зарплата
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salary";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата (руб.)'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПодчиненногоПоля = СтруктураПоля();
	СтруктураПодчиненногоПоля.Путь = "from";
	СтруктураПодчиненногоПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПодчиненногоПоля.Описание = НСтр("ru = 'Нижняя граница зарплаты (руб./мес.)'");
	ПодчиненныеЭлементы.Добавить(СтруктураПодчиненногоПоля);
	
	СтруктураПодчиненногоПоля = СтруктураПоля();
	СтруктураПодчиненногоПоля.Путь = "to";
	СтруктураПодчиненногоПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПодчиненногоПоля.Описание = НСтр("ru = 'Верхняя граница зарплаты (руб./мес.)'");
	СтруктураПодчиненногоПоля.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПодчиненногоПоля);
	
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Частота выплат
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "payout_frequency";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Частота выплат'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Место работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "location";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Место работы'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Контактное лицо
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "contacts";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Контактное лицо'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПодчиненногоПоля = СтруктураПоля();
	СтруктураПодчиненногоПоля.Путь = "name";
	СтруктураПодчиненногоПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПодчиненногоПоля.Описание = НСтр("ru = 'ФИО'");
	ПодчиненныеЭлементы.Добавить(СтруктураПодчиненногоПоля);
	
	СтруктураПодчиненногоПоля = СтруктураПоля();
	СтруктураПодчиненногоПоля.Путь = "phone";
	СтруктураПодчиненногоПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПодчиненногоПоля.Описание = НСтр("ru = 'Телефон'");
	ПодчиненныеЭлементы.Добавить(СтруктураПодчиненногоПоля);
	
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);

	Возврат МассивПолей;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Строка
Функция АдресВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = "";
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("core/v1/accounts/%1/items/%2", ИдентификаторПользователя, ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОбОбъявлении = ПрочитатьОтветАдресВакансии(РезультатЗапроса);
	Иначе
		ВызватьИсключение СтрШаблон("%1:%2", РезультатЗапроса.КодСостояния, РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Результат = ЗначениеСвойстваУзла(ИнформацияОбОбъявлении, "url");
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	ИдентификаторРезюме = АдресРезюме;
	
	Если СтрНайти(АдресРезюме, "messenger/channel") <> 0 Тогда
		Возврат ИдентификаторРезюме;
	КонецЕсли;
	
	Разделитель = "_";
	
	Если СтрНайти(ИдентификаторРезюме, Разделитель) <> 0 Тогда
		Пока РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель) > 0 Цикл
			НомерВхожденияРазделителя = 
				РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
			ИдентификаторРезюме = 
				Сред(ИдентификаторРезюме, 
					НомерВхожденияРазделителя + СтрДлина(Разделитель), 
					СтрДлина(ИдентификаторРезюме) - НомерВхожденияРазделителя);
		КонецЦикла;
	Иначе
		ИдентификаторРезюме = СтрЗаменить(ИдентификаторРезюме, ДанныеСайта.ГлавнаяСтраница + "/", "");
	КонецЕсли;
	
	Возврат ИдентификаторРезюме;

КонецФункции

// Параметры:
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	Если СтрНайти(ИдентификаторРезюме, ДанныеСайта.ГлавнаяСтраница) <> 0 Тогда
		Возврат Новый Структура();
	КонецЕсли;
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(СтруктураРезюме) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(СтруктураРезюме);
		
		ДанныеКандидата.Комментарии = ЗначениеСвойстваУзла(СтруктураРезюме, "Комментарии");
		ДанныеКандидата.ДанныеПубликации = СтруктураРезюме;
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	ИмяКлассификатора = "";
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ИмяКлассификатора = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ИмяКлассификатора = "education_level";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ИмяКлассификатора = "periods";
	Иначе
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	Классификатор = СписокВыбораПоКлассификатору(ИмяКлассификатора);
	
	Найдено = Ложь;
	Для Каждого Элемент Из Классификатор Цикл
		ЗначениеСравнения = НРег(СокрЛП(Элемент.Представление));
		
		Если ЗначениеСравнения = НРег(Значение) Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Найдено Тогда
		ЭлементКлассификатора = Элемент.Значение;
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "title");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "title";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "description");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "description";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "address");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "address";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "business_area");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "business_area";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "experience");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "experience";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
	ПолеВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "params", "schedule");
	Если ЗначениеЗаполнено(ПолеВакансии) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "schedule";
		НовоеПоле.ПубликацияВакансии = ПолеВакансии;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СОдиночнымВыборомИзДерева = ПоляВакансииСОдиночнымВыборомИзДерева();
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.НедоступныеДляРедактирования = ПоляВакансииНедоступныеДляРедактирования();
	ВидыПолей.СТекстомВHTML = ПоляВакансииСТекстомВHTML();
	ВидыПолей.СМножественнымВыборомИзСписка = ПоляВакансииСМножественнымВыборомИзСписка();
	
	Возврат ВидыПолей;
	
КонецФункции

// Параметры:
//  Путь - Строка
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка
Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Если Путь = "billing_type" Тогда
		СписокВыбора.Добавить("package", НСтр("ru = 'при наличии подходящего пакета размещения'"));
		СписокВыбора.Добавить("packageOrSingle", НСтр("ru = 'если нет подходящего пакета, то разовое размещение'"));
	ИначеЕсли Путь = "business_area" Тогда
		СписокВыбора.Добавить(1, НСтр("ru = 'IT, интернет, телеком'"));
		СписокВыбора.Добавить(13, НСтр("ru = 'Медицина, фармацевтика'"));
		СписокВыбора.Добавить(17, НСтр("ru = 'Продажи'"));
		СписокВыбора.Добавить(19, НСтр("ru = 'Страхование'"));
		СписокВыбора.Добавить(21, НСтр("ru = 'Транспорт, логистика'"));
		СписокВыбора.Добавить(14, НСтр("ru = 'Образование, наука'"));
		СписокВыбора.Добавить(20, НСтр("ru = 'Строительство'"));
		СписокВыбора.Добавить(22, НСтр("ru = 'Туризм, рестораны'"));
		СписокВыбора.Добавить(24, НСтр("ru = 'Фитнес, салоны красоты'"));
		СписокВыбора.Добавить(15, НСтр("ru = 'Без опыта, студенты'"));
		СписокВыбора.Добавить(7, НСтр("ru = 'Автомобильный бизнес'"));
		СписокВыбора.Добавить(2, НСтр("ru = 'Бухгалтерия, финансы'"));
		СписокВыбора.Добавить(9, НСтр("ru = 'Высший менеджмент'"));
		СписокВыбора.Добавить(16, НСтр("ru = 'Госслужба, НКО'"));
		СписокВыбора.Добавить(10124, НСтр("ru = 'ЖКХ, эксплуатация'"));
		СписокВыбора.Добавить(11, НСтр("ru = 'Искусство, развлечения'"));
		СписокВыбора.Добавить(12, НСтр("ru = 'Консультирование'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'Маркетинг, реклама, PR'"));
		СписокВыбора.Добавить(8, НСтр("ru = 'Охрана, безопасность'"));
		СписокВыбора.Добавить(6, НСтр("ru = 'Управление персоналом'"));
		СписокВыбора.Добавить(23, НСтр("ru = 'Юриспруденция'"));
		СписокВыбора.Добавить(4, НСтр("ru = 'Административная работа'"));
		СписокВыбора.Добавить(5, НСтр("ru = 'Банки, инвестиции'"));
		СписокВыбора.Добавить(18, НСтр("ru = 'Производство, сырьё, с/х'")); // АПК:163 Значение классификатора
		СписокВыбора.Добавить(27, НСтр("ru = 'Домашний персонал'"));
		СписокВыбора.Добавить(2804249, НСтр("ru = 'Курьерская доставка'"));
		СписокВыбора.Добавить(2804093, НСтр("ru = 'Такси'"));
	ИначеЕсли Путь = "profession" Тогда
		ЗаполнитьСписокВыбораПрофессий(СписокВыбора);
	ИначеЕсли Путь = "schedule" Тогда
		СписокВыбора.Добавить("fiveDay", НСтр("ru = 'Пятидневная рабочая неделя'"));
		СписокВыбора.Добавить("sixDay", НСтр("ru = 'Шестидневная рабочая неделя'"));
		СписокВыбора.Добавить("flyInFlyOut", НСтр("ru = 'Вахтовый'"));
		СписокВыбора.Добавить("flexible", НСтр("ru = 'Плавающий'"));
		СписокВыбора.Добавить("shift", НСтр("ru = 'Сменный'"));
	ИначеЕсли Путь = "experience" Тогда
		СписокВыбора.Добавить("noMatter", НСтр("ru = 'Не имеет значения'"));
		СписокВыбора.Добавить("moreThan1", НСтр("ru = 'Более 1 года'"));
		СписокВыбора.Добавить("moreThan3", НСтр("ru = 'Более 3 лет'"));
		СписокВыбора.Добавить("moreThan5", НСтр("ru = 'Более 5 лет'"));
		СписокВыбора.Добавить("moreThan10", НСтр("ru = 'Более 10 лет'"));
	ИначеЕсли Путь = "payout_frequency" Тогда
		СписокВыбора.Добавить("dailyPay", НСтр("ru = 'Каждый день'"));
		СписокВыбора.Добавить("weeklyPay", НСтр("ru = 'Раз в неделю'"));
		СписокВыбора.Добавить("thriceMonthlyPay", НСтр("ru = 'Три раза в месяц'"));
		СписокВыбора.Добавить("biweeklyPay", НСтр("ru = 'Дважды в месяц'"));
		СписокВыбора.Добавить("monthlyPay", НСтр("ru = 'Раз в месяц'"));
	ИначеЕсли Путь = "registration_method" Тогда
		СписокВыбора.Добавить("contract", НСтр("ru = 'Трудовой договор'"));
		СписокВыбора.Добавить("gph_ip", НСтр("ru = 'ГПХ с ИП'"));
		СписокВыбора.Добавить("gph_self_employed", НСтр("ru = 'ГПХ с самозанятым'"));
		СписокВыбора.Добавить("gph_individual", НСтр("ru = 'ГПХ с физическим лицом'"));
	ИначеЕсли Путь = "gender" Тогда
		СписокВыбора.Добавить("male", НСтр("ru = 'Мужской'"));
		СписокВыбора.Добавить("female", НСтр("ru = 'Женский'"));
	ИначеЕсли Путь = "education_level" Тогда
		СписокВыбора.Добавить("secondary", НСтр("ru = 'Среднее'"));
		СписокВыбора.Добавить("special-secondary", НСтр("ru = 'Среднее специальное'"));
		СписокВыбора.Добавить("unfinished-higher", НСтр("ru = 'Незаконченное высшее'"));
		СписокВыбора.Добавить("higher", НСтр("ru = 'Высшее'"));
	ИначеЕсли Путь = "periods" Тогда
		СписокВыбора.Добавить(0, НСтр("ru = 'За все время'"));
		СписокВыбора.Добавить(1, НСтр("ru = 'За последние 24 часа'"));
		СписокВыбора.Добавить(3, НСтр("ru = 'За последние 3 дня'"));
		СписокВыбора.Добавить(7, НСтр("ru = 'За последнюю неделю'"));
		СписокВыбора.Добавить(14, НСтр("ru = 'За последние 2 недели'"));
		СписокВыбора.Добавить(30, НСтр("ru = 'За последний 1 месяц'"));
		СписокВыбора.Добавить(60, НСтр("ru = 'За последние 2 месяца'"));
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("job/v2/vacancies");
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 202 Тогда
		Опубликовано = Ложь;
		ИдентификаторПубликации = ЗначениеСвойстваУзла(ПрочитатьОтветПубликацияВакансии(РезультатЗапроса), "id");
		
		Пока Не Опубликовано Цикл
			Запрос = НовыйHTTPЗапрос("job/v2/vacancies/statuses");
			Запрос.УстановитьТелоИзСтроки(
				РекрутинговыеСайтыСлужебный.ЗаписьJSON(
					Новый Структура("ids", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПубликации))) , ,
				ИспользованиеByteOrderMark.НеИспользовать);
				
			РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				ДанныеПубликации = ПрочитатьОтветСтатусПубликацииВакансии(РезультатЗапроса);
				
				Если ЗначениеСвойстваУзла(ДанныеПубликации, "last_action", "status") = "success" Тогда
					Опубликовано = Истина;
					Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией(
						ЗначениеСвойстваУзла(ДанныеПубликации, "vacancy", "id"));
				ИначеЕсли ЗначениеСвойстваУзла(ДанныеПубликации, "last_action", "status") = "error" Тогда
					Опубликовано = Истина;
					Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
				КонецЕсли;
			Иначе
				Опубликовано = Истина;
				Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = РеактивироватьВакансию(ИдентификаторВакансии, Дерево);
	
	Если Не Результат.Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Или Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ДанныеПубликации = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("job/v2/vacancies/update/%1", ЗначениеСвойстваУзла(ДанныеПубликации, "uuid")));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 202 Тогда
		Успешно = Ложь;
		ИдентификаторПубликации = ЗначениеСвойстваУзла(ПрочитатьОтветПубликацияВакансии(РезультатЗапроса), "id");
		
		Пока Не Успешно Цикл
			Запрос = НовыйHTTPЗапрос("job/v2/vacancies/statuses");
			Запрос.УстановитьТелоИзСтроки(
				РекрутинговыеСайтыСлужебный.ЗаписьJSON(
					Новый Структура("ids", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторПубликации))) , ,
				ИспользованиеByteOrderMark.НеИспользовать);
				
			РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				ДанныеПубликации = ПрочитатьОтветСтатусПубликацииВакансии(РезультатЗапроса);
				
				Если ЗначениеСвойстваУзла(ДанныеПубликации, "last_action", "status") = "success" Тогда
					Успешно = Истина;
					Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией(
						ЗначениеСвойстваУзла(ДанныеПубликации, "vacancy", "id"));
				ИначеЕсли ЗначениеСвойстваУзла(ДанныеПубликации, "last_action", "status") = "error" Тогда
					Успешно = Истина;
					Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
				КонецЕсли;
			Иначе
				Успешно = Истина;
				Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("job/v1/vacancies/archived/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура: см. РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии
Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	Описание = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	Если ЗначениеЗаполнено(Описание) Тогда
		СвойстваПубликации.Опубликована = ЗначениеСвойстваУзла(Описание, "is_active");
		
		Если СвойстваПубликации.Опубликована Тогда
			СвойстваПубликации.ДатаПубликации = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Описание, "start_time"));
			СвойстваПубликации.ДатаОбновления = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Описание, "update_time"));
		Иначе
			Если ЗначениеЗаполнено(СвойстваПубликации.ДатаПубликации) Тогда
				СвойстваПубликации.ДатаСнятияСПубликации =
					Мин(ДобавитьМесяц(СвойстваПубликации.ДатаПубликации, 1), ТекущаяДатаСеанса());
			Иначе
				СвойстваПубликации.ДатаСнятияСПубликации = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		ЗначениеСвойства = ЗначениеСвойстваУзла(Вакансия, "title");
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойства), ЗначениеСвойства, "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		ЗначениеСвойства = ЗначениеСвойстваУзла(Вакансия, "params", "salary", "to");
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойства), ЗначениеСвойства, 0);
	ИначеЕсли Реквизит = "ДатаОткрытия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "start_time"));
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" Тогда
		Результат = ДобавитьМесяц(РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "start_time")), 1);
	ИначеЕсли Реквизит = "Требования" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Требования;
	ИначеЕсли Реквизит = "Обязанности" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Обязанности;
	ИначеЕсли Реквизит = "Условия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Условия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь) Экспорт
	
	МассивВакансий = Новый Массив;
	
	Если Не УстановитьСоединение() Тогда
		БылиОшибки = Истина;
		Возврат МассивВакансий;
	КонецЕсли;
	
	Вакансии = Новый Массив();
	ПолучитьВсеСтраницыРесурса("core/v1/items?category=111", "resources", Вакансии);
	
	Для Каждого Вакансия Из Вакансии Цикл
		Описание = ОписаниеПубликацииВакансии(Формат(ЗначениеСвойстваУзла(Вакансия, "id"), "ЧГ=0"));
		Если ЗначениеЗаполнено(Описание) Тогда
			МассивВакансий.Добавить(Описание);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивВакансий;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	Отклики = РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов();
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		ОткликиССайта = ОткликиССайта(ИдентификаторВакансии);
		
		Для Каждого Отклик Из ОткликиССайта Цикл
			ИдентификаторРезюме = ЗначениеСвойстваУзла(Отклик, "applicant", "resume_id");
			ЕстьРезюме = ЗначениеЗаполнено(ИдентификаторРезюме);
			
			Если Не ЕстьРезюме Тогда
				ИдентификаторРезюме = СтрШаблон("%1/profile/messenger/channel/%2",
					ДанныеСайта.ГлавнаяСтраница, ЗначениеСвойстваУзла(Отклик, "contacts", "chat", "value"));
			КонецЕсли;
			
			Если Не ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(
				ЗначениеСвойстваУзла(Отклик, "applicant", "data", "name"));
			
			НоваяЗапись = Отклики.Добавить();
			НоваяЗапись.Источник = Сайт;
			НоваяЗапись.Вакансия = Вакансия;
			НоваяЗапись.Имя = СтруктураФИО.Имя;
			НоваяЗапись.Фамилия = СтруктураФИО.Фамилия;
			НоваяЗапись.Отчество = СтруктураФИО.Отчество;
			НоваяЗапись.ДатаОтклика = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(
				ЗначениеСвойстваУзла(Отклик, "created_at"));
			НоваяЗапись.ДатаРождения = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(
				ЗначениеСвойстваУзла(Отклик, "applicant", "data", "birthday"));
			НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
			
			Телефоны = ЗначениеСвойстваУзла(Отклик, "contacts", "phones");
			Если ЗначениеЗаполнено(Телефоны) Тогда
				Для Каждого Телефон Из Телефоны Цикл
					НоваяЗапись.Телефон = ЗначениеСвойстваУзла(Телефон, "value");
				КонецЦикла;
			КонецЕсли;
			
			Если ЕстьРезюме Тогда
				НоваяЗапись.АдресРезюме = СтрШаблон("%1/%2", ДанныеСайта.ГлавнаяСтраница, ИдентификаторРезюме);
			Иначе
				НоваяЗапись.АдресРезюме = ИдентификаторРезюме;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Отклики, Пользователь);
	
КонецПроцедуры

// Параметры:
//  Классификатор - Строка
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Булево
Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "areas_towns" Тогда
		Дерево = ДеревоРегионов();
		Результат = Истина;
	ИначеЕсли Классификатор = "location" Тогда
		Дерево = ДеревоРегионов(Истина);
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме
Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме);
	
	Возврат ДоступностьКонтактов;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме
Функция КонтактыРезюме(АдресРезюме) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("job/v1/resumes/" + ИдентификаторРезюме + "/contacts");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибки(
			НСтр("ru = 'Не удалось получить контакты резюме.'"), Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Контакты = ПрочитатьОтветКонтактыРезюме(РезультатЗапроса);
	
	ЗаполнитьЗначенияСвойств(Результат, ФизическиеЛицаКлиентСервер.ЧастиИмени(ЗначениеСвойстваУзла(Контакты, "name")));
	
	Для Каждого Контакт Из ЗначениеСвойстваУзла(Контакты, "contacts") Цикл
		Если ЗначениеСвойстваУзла(Контакт, "type") = "e-mail" Тогда
			Результат.ЭлектроннаяПочта = ЗначениеСвойстваУзла(Контакт, "value");
		ИначеЕсли ЗначениеСвойстваУзла(Контакт, "type") = "phone" Тогда
			Результат.Телефон = ЗначениеСвойстваУзла(Контакт, "value");
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если СтрНайти(ОписаниеОшибки, "Payment required") <> 0 Тогда
		УточненноеОписаниеОшибки = НСтр("ru = 'Требуется оплата.'");
	ИначеЕсли СтрНайти(ОписаниеОшибки, "invalid_grant") <> 0 Или
		СтрНайти(ОписаниеОшибки, "Missing scope") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеОшибкиАвторизации();
	ИначеЕсли СтрНайти(ОписаниеОшибки, "not_enough_purchased_services") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеНеоплаченныхУслуг();
	ИначеЕсли СтрНайти(ОписаниеОшибки, """code"":100") <> 0 Тогда
		УточненноеОписаниеОшибки = НСтр("ru = 'Проверьте корректность номера телефона.'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(УточненноеОписаниеОшибки) Тогда
		ИменаПолей = Новый Соответствие();
		Для каждого Поле Из ПоляВакансии() Цикл
			ИменаПолей.Вставить(Поле.Путь, Поле.Описание);
		КонецЦикла;
		
		Если СтрНайти(ОписаниеОшибки, "errors") <> 0 Тогда
			Описание = ПарсерJSON(ОписаниеОшибки);
			Если ТипЗнч(Описание) = Тип("Структура") Тогда
				Для каждого Ошибка Из Описание.errors Цикл
					ТекстОшибки = Ошибка;
					ИмяПоля = Неопределено;
					Для каждого КлючИЗначение Из ИменаПолей Цикл
						Если СтрНайти(Ошибка, КлючИЗначение.Ключ) <> 0 Тогда
							ИмяПоля = КлючИЗначение.Ключ;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ИмяПоля <> Неопределено Тогда
						ТекстОшибки = СтрЗаменить(ТекстОшибки, ИмяПоля, ИменаПолей[ИмяПоля]);
					КонецЕсли;
					
					УточненноеОписаниеОшибки = УточненноеОписаниеОшибки + Символы.ПС + ТекстОшибки;
				КонецЦикла;
			КонецЕсли;
		ИначеЕсли СтрНайти(ОписаниеОшибки, "error") <> 0 Тогда
			ИмяПоля = Неопределено;
			Для каждого КлючИЗначение Из ИменаПолей Цикл
				Если СтрНайти(ОписаниеОшибки, КлючИЗначение.Ключ) <> 0 Тогда
					ИмяПоля = КлючИЗначение.Ключ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ИмяПоля <> Неопределено Тогда
				ТекстОшибки = "Некорректно заполнено поле " + ИменаПолей[ИмяПоля];
			КонецЕсли;
			
			УточненноеОписаниеОшибки =
				УточненноеОписаниеОшибки + Символы.ПС + ТекстОшибки + Символы.ПС + ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

// Параметры:
//  ДанныеДляОтправки - См. РекрутинговыеСайтыСлужебный.ДанныеДляОтправкиОбратнойСвязи
// 
// Возвращаемое значение:
//  Булево - Отправка прошла успешно
Функция ОтправитьОбратнуюСвязьПоОтклику(ДанныеДляОтправки) Экспорт
	
	Результат = Ложь;
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(ДанныеДляОтправки.Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		ТекстОшибки = НСтр("ru = 'Вакансия не опубликована.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		ТекстОшибки = НСтр("ru = 'Не настроен доступ к сайту.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось установить соединение с сайтом.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		ОткликиССайта = ОткликиССайта(ИдентификаторВакансии);
		
		Для Каждого Отклик Из ОткликиССайта Цикл
			ИдентификаторРезюме = ЗначениеСвойстваУзла(Отклик, "applicant", "resume_id");
			ЕстьРезюме = ЗначениеЗаполнено(ИдентификаторРезюме);
			
			Если Не ЕстьРезюме Тогда
				ИдентификаторРезюме = СтрШаблон("%1/profile/messenger/channel/%2",
					ДанныеСайта.ГлавнаяСтраница, ЗначениеСвойстваУзла(Отклик, "contacts", "chat", "value"));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ИдентификаторРезюме) Или СтрНайти(ДанныеДляОтправки.АдресРезюме, ИдентификаторРезюме) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = НовыйHTTPЗапрос(
				СтрШаблон("/messenger/v1/accounts/%1/chats/%2/messages",
					ИдентификаторПользователя, ЗначениеСвойстваУзла(Отклик, "contacts", "chat", "value")));
			
			Тело = Новый Структура();
			Тело.Вставить("type", "text");
			Тело.Вставить("message", Новый Структура("text", ДанныеДляОтправки.Сообщение));
			
			Запрос.УстановитьТелоИзСтроки(РекрутинговыеСайтыСлужебный.ЗаписьJSON(Тело));
			
			РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				Результат = Истина;
				Прервать;
			Иначе
				ТекстОшибки = НСтр("ru = 'Не удалось отправить обратную связь.'");
				РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
					Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

// Параметры:
//  Обновление - Булево
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
// Структура: см. РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров
Функция СтруктураМаркеров(Обновление = Ложь, Показыватьпредупреждение = Истина)
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляАвитоРабота();
	Структура_token_uri = ОбщегоНазначенияКлиентСервер.СтруктураURI(ИдентификаторПриложения.token_uri);
	АдресАутентификации = Структура_token_uri.Хост;
	
	Если Обновление Тогда
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1?grant_type=refresh_token&client_id=%2&client_secret=%3&refresh_token=%4",
					Структура_token_uri.ПутьНаСервере,
					ИдентификаторПриложения.client_id,
					ИдентификаторПриложения.client_secret,
					МаркерОбновления);
	Иначе
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"%1?grant_type=authorization_code&client_id=%2&client_secret=%3&code=%4",
					Структура_token_uri.ПутьНаСервере,
					ИдентификаторПриложения.client_id,
					ИдентификаторПриложения.client_secret,
					КодАвторизации);
	КонецЕсли;

	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресАутентификации, Истина);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	// Авито при ошибках возвращает 200
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
	
	Если ОтветОбъект.Свойство("error") Тогда
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	СтруктураМаркеров.МаркерДоступа = ОтветОбъект.access_token;
	СтруктураМаркеров.МаркерОбновления = ОтветОбъект.refresh_token;
	СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = ТекущаяДатаСеанса() + ОтветОбъект.expires_in;
	
	МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
	МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
	ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен(Показыватьпредупреждение = Истина)
	
	МаркерДействителен = ЗначениеЗаполнено(МаркерДоступа) 
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	МаркерАктивен = Ложь;
		
	Если МаркерДействителен Тогда
		МаркерАктивен = СайтДоступен(Показыватьпредупреждение);
	КонецЕсли;
		
	Если Не МаркерАктивен И ЗначениеЗаполнено(МаркерОбновления) Тогда
		РезультатОбновления = ОбновитьМаркеры(Показыватьпредупреждение);
		Если ЗначениеЗаполнено(РезультатОбновления.МаркерДоступа) Тогда
			МаркерАктивен = Истина;
			РезультатОбновления.Пользователь = Пользователь;
			РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизацииСОдинаковымИдентификатором(РезультатОбновления);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МаркерАктивен;
	
КонецФункции

Функция СайтДоступен(Показыватьпредупреждение = Истина)
	
	Возврат ЗначениеЗаполнено(ИнформацияОПользователе(Показыватьпредупреждение).ИмяПользователя);
	
КонецФункции

Функция ОбновитьМаркеры(Показыватьпредупреждение = Истина)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	Результат.Сайт = Сайт;
	Результат.Пользователь = Пользователь;
	
	СтруктураМаркеров = СтруктураМаркеров(Истина, Показыватьпредупреждение);
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе= ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/json");
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция АдресСервера()
	
	Возврат ДанныеСайта.АдресЗапроса;
	
КонецФункции

Функция АдресСайта()
	
	Возврат ДанныеСайта.ИмяСайта;
	
КонецФункции

Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветАдресВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветПубликацияВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветСтатусПубликацииВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект[0];
	
КонецФункции

Функция ПрочитатьОтветКонтактыРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветИдентификаторыОткликов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат ЗначениеСвойстваУзла(РезультатЗапроса.ОтветОбъект, "applies");
	
КонецФункции

Функция ПрочитатьОтветОтклики(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат ЗначениеСвойстваУзла(РезультатЗапроса.ОтветОбъект, "applies");
	
КонецФункции

Функция ПрочитатьОтветСтруктураРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
//  ПрочитатьВСоответствие - Булево
// 
// Возвращаемое значение:
//  см. РекрутинговыеСайтыСлужебный.ПарсерJSON
Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	
	Возврат РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

// Возвращаемое значение:
// см. РекрутинговыеСайтыСлужебный.СтруктураПоля
Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

Функция ОткликиССайта(ИдентификаторВакансии)

	ОткликиССайта = Новый Массив();
	ВсеОткликиЗагружены = Ложь;
	ВсеИдентификаторыОткликов = Новый Массив();
	
	Пока Не ВсеОткликиЗагружены Цикл
		// Сначала получаем идентификаторы откликов, по 100 штук за раз максимум
		Курсор = ?(ВсеИдентификаторыОткликов.Количество() <> 0,
			"&cursor=" + ВсеИдентификаторыОткликов[ВсеИдентификаторыОткликов.ВГраница()], "");
		
		Запрос = НовыйHTTPЗапрос(
			СтрШаблон("job/v1/applications/get_ids?updatedAtFrom=2000-01-01&vacancyIds=%1%2",
				ИдентификаторВакансии, Курсор));
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			ИдентификаторыОткликовССайта = ПрочитатьОтветИдентификаторыОткликов(РезультатЗапроса);
		Иначе
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатЗапроса);
			Возврат ОткликиССайта;
		КонецЕсли;
		
		Если ИдентификаторыОткликовССайта.Количество() = 0 Тогда
			Возврат ОткликиССайта;
		ИначеЕсли ИдентификаторыОткликовССайта.Количество() < 100 Тогда
			ВсеОткликиЗагружены = Истина;
		КонецЕсли;
		
		ИдентификаторыОткликов = Новый Массив();
		Для Каждого ОткликССайта Из ИдентификаторыОткликовССайта Цикл
			ИдентификаторОтклика = ЗначениеСвойстваУзла(ОткликССайта, "id");
			ИдентификаторыОткликов.Добавить(ИдентификаторОтклика);
			ВсеИдентификаторыОткликов.Добавить(ИдентификаторОтклика);
		КонецЦикла;
		
		// Затем получаем данные откликов по идентификаотрам загруженной порции
		Запрос = НовыйHTTPЗапрос("job/v1/applications/get_by_ids");
		Запрос.УстановитьТелоИзСтроки(
			РекрутинговыеСайтыСлужебный.ЗаписьJSON(Новый Структура("ids", ИдентификаторыОткликов)));
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
		
		Если РезультатЗапроса.КодСостояния = 200 Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОткликиССайта, ПрочитатьОтветОтклики(РезультатЗапроса));
		Иначе
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатЗапроса);
			Возврат ОткликиССайта;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОткликиССайта;

КонецФункции

Функция СтруктураРезюмеССайта(ИдентификаторРезюме, ПолучатьФото = Истина, ПолучатьКонтакты = Ложь)
	
	Резюме = Неопределено;
	
	Если Не ЗначениеЗаполнено(ИдентификаторРезюме) Или СтрНайти(ИдентификаторРезюме, ДанныеСайта.ГлавнаяСтраница) <> 0 Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("job/v2/resumes/" + ИдентификаторРезюме + "?photos=true");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоОписанию(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Резюме = ПрочитатьОтветСтруктураРезюме(РезультатЗапроса);
	
	Если ПолучатьФото Тогда
		Фотографии = ЗначениеСвойстваУзла(Резюме, "photos");
		Если ЗначениеЗаполнено(Фотографии) Тогда
			АдресФото = Фотографии[0]["url"];
			Если ЗначениеЗаполнено(АдресФото) Тогда
				Резюме.Вставить("Фото", РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресФото));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПолучатьКонтакты = ЗначениеСвойстваУзла(Резюме, "is_purchased") Или ПолучатьКонтакты;
	
	Если ПолучатьКонтакты Тогда
		Запрос = НовыйHTTPЗапрос("job/v1/resumes/" + ИдентификаторРезюме + "/contacts/");
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	КонецЕсли;
	
	Контакты = ПрочитатьОтветКонтактыРезюме(РезультатЗапроса);
	Резюме.Вставить("contact_name", ЗначениеСвойстваУзла(Контакты, "name"));
	Резюме.Вставить("contacts", ЗначениеСвойстваУзла(Контакты, "contacts"));
	
	Резюме.Вставить("Комментарии", Новый Массив());
	
	Возврат Резюме;
	
КонецФункции

// Параметры:
//  СтруктураРезюме - Структура: см. СтруктураРезюмеССайта
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата
Функция ДанныеКандидатаПоРезюме(СтруктураРезюме)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	ДанныеКандидата.ИсточникИнформации = Сайт;

	ЗаполнитьДоступностьКонтактов(ДанныеКандидата.ДоступностьКонтактов, СтруктураРезюме);

	// Адрес резюме
	АдресРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "url", , Неопределено);
	Если Не АдресРезюме = Неопределено Тогда
		ДанныеКандидата.АдресРезюме = СтрШаблон("https://www.avito.ru%1", АдресРезюме);
	КонецЕсли;
	
	// ФИО
	ФИО = ЗначениеСвойстваУзла(СтруктураРезюме, "contact_name", , , Неопределено);
	Если Не ФИО = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКандидата, ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО));
	КонецЕсли;
	
	// Контактная информация
	ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, ДанныеКандидата.КонтактнаяИнформация);
	
	// Пол
	Пол = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "pol", , Неопределено);
	Если Не Пол = Неопределено Тогда
		Если Пол = "Мужской" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Пол = "Женский" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
	КонецЕсли;
	
	// Гражданство
	СтранаГражданства = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "nationality", , Неопределено);
	Если Не СтранаГражданства = Неопределено Тогда
		СтруктураГражданство = Новый Структура("Страна, Дата");
		СтруктураГражданство.Страна = СтранаГражданства;
		ДанныеКандидата.Гражданство.Добавить(СтруктураГражданство);
	КонецЕсли;
	
	// Образование
	ЗаполнитьМассивОбразование(СтруктураРезюме, ДанныеКандидата.Образование);
	
	// Трудовая деятельность
	МестаРаботы = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "experience_list", , Неопределено);
	Если Не МестаРаботы = Неопределено Тогда
		Для Каждого МестоРаботы Из МестаРаботы Цикл
			СтруктураТрудоваяДеятельность = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
			СтруктураТрудоваяДеятельность.Компания = ЗначениеСвойстваУзла(МестоРаботы, "company");
			ДатаНачала = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(МестоРаботы, "work_start"), Ложь);
			ДатаОкончания = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(МестоРаботы, "work_finish"), Ложь);
			Если ЗначениеЗаполнено(ДатаНачала) Тогда
				СтруктураТрудоваяДеятельность.ДатаНачала = ДатаНачала;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				СтруктураТрудоваяДеятельность.ДатаОкончания = ДатаОкончания;
			КонецЕсли;
			СтруктураТрудоваяДеятельность.Должность = ЗначениеСвойстваУзла(МестоРаботы, "position");
			СтруктураТрудоваяДеятельность.Обязанности = ЗначениеСвойстваУзла(МестоРаботы, "responsibilities");
			ДанныеКандидата.ТрудоваяДеятельность.Добавить(СтруктураТрудоваяДеятельность);
		КонецЦикла;
	КонецЕсли;
	
	// Знание языков
	ЗнанияЯзыков = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "language_list", , Неопределено);
	Если Не ЗнанияЯзыков = Неопределено Тогда
		Для Каждого ЗнаниеЯзыка Из ЗнанияЯзыков Цикл
			СтруктураЗнаниеЯзыков = РекрутинговыеСайтыСлужебный.НовоеЗнаниеЯзыка();
			СтруктураЗнаниеЯзыков.Язык = ЗначениеСвойстваУзла(ЗнаниеЯзыка, "language");
			СтруктураЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата =
				СтепеньЗнанияЯзыкаПоИдентификатору(ЗначениеСвойстваУзла(ЗнаниеЯзыка, "language_level"));
			ДанныеКандидата.ЗнаниеЯзыков.Добавить(СтруктураЗнаниеЯзыков);
		КонецЦикла;
	КонецЕсли;
	
	// Ожидаемый доход
	ДанныеКандидата.ОжидаемыйДоход = ЗначениеСвойстваУзла(СтруктураРезюме, "salary", , , Неопределено);
	
	// О себе
	СтрокаОСебе = ЗначениеСвойстваУзла(СтруктураРезюме, "description");
	
	// Авито не возвращает дату рождения, только возраст.
	Возраст = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "age");
	Если ЗначениеЗаполнено(Возраст) Тогда
		СтрокаОСебе = СтрШаблон(НСтр("ru = 'Возраст: %1'"), Возраст) + Символы.ПС + СтрокаОСебе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаОСебе) Тогда
		РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(СтрокаОСебе);
		ДанныеКандидата.ОСебе = СтрокаОСебе;
	КонецЕсли;
	
	// Фото
	ДанныеКандидата.Фото = ЗначениеСвойстваУзла(СтруктураРезюме, "Фото");
	
	// Название резюме
	ДанныеКандидата.НазваниеРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "title");
	
	Возврат ДанныеКандидата;
	
КонецФункции

Функция СтруктураКонтактнойИнформации() Экспорт
	
	СтруктураКонтактнойИнформации = Новый Структура();
	
	СтруктураКонтактнойИнформации.Вставить("Тип", Перечисления.ТипыКонтактнойИнформации.ПустаяСсылка());
	СтруктураКонтактнойИнформации.Вставить("Вид", Справочники.ВидыКонтактнойИнформации.ПустаяСсылка());
	СтруктураКонтактнойИнформации.Вставить("Представление", "");
	
	Возврат СтруктураКонтактнойИнформации
	
КонецФункции

// Параметры:
//  Узел - Структура
//  ИмяСвойства - Строка
//  ИмяСвойстваВторогоУровня - Неопределено, Строка -
//  ИмяСвойстваТретьегоУровня - Неопределено, Строка -
//  ЗначениеПоУмолчанию - Строка
// 
// Возвращаемое значение:
//  Строка, Массив, Произвольный -
Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

Процедура ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме)
	
	ДоступПриобретен = ЗначениеСвойстваУзла(СтруктураРезюме, "is_purchased", , Неопределено);

	Если ДоступПриобретен = Ложь Тогда
		ДоступностьКонтактов.КонтактыОткрыты = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция СтепеньЗнанияЯзыкаПоИдентификатору(Идентификатор)
	
	Если Идентификатор = "basic" Тогда // начальный
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли Идентификатор = "middle" Тогда // средний
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B1;
	ИначеЕсли Идентификатор = "upper-middle" Тогда // выше среднего
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B2;
	Иначе // свободное владение
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C2;
	КонецЕсли;
	
	Возврат Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(УровеньВладенияЯзыком);
	
КонецФункции

// Параметры:
//  СтруктураОтбора - Структура
//  НомерСтраницы - Число
// 
// Возвращаемое значение:
// Строка
Функция СтрокаОтбора(СтруктураОтбора, НомерСтраницы)
	
	СтрокаОтбора = "per_page=99&page=" + (НомерСтраницы + 1);
	
	СоответствиеПолей = СоответствиеПолейПоискаКандидатов();
	
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		
		ИмяПараметра = СоответствиеПолей.Получить(КлючИЗначение.Ключ);
		
		Если Не ЗначениеЗаполнено(ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;

		ЗначениеПоля = КлючИЗначение.Значение;

		Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
			ЗначениеПоля = Формат(ЗначениеПоля, "ЧН=0; ЧГ=0");
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("Дата") Тогда
			ЗначениеПоля = Формат(ЗначениеПоля, "ДЛФ=Д");
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("Булево") Тогда
			Если КлючИЗначение.Ключ = "ТолькоВНазвании" Тогда
				ЗначениеПоля = Формат(ЗначениеПоля, "БЛ=fullthrottle; БИ=simple")
			Иначе
				ЗначениеПоля = Формат(ЗначениеПоля, "БЛ=false; БИ=true");
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеПоля) = Тип("СписокЗначений") Тогда
			Если КлючИЗначение.Ключ = "Регион" Тогда
				Индекс = 0;
				Для Каждого ЭлементСписка Из ЗначениеПоля Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
						Идентификатор = "";
						
						Если ЭлементСписка.Значение.Свойство("IDAvito") Тогда
							Если Не ЭлементСписка.Значение.Свойство("IDAvito", Идентификатор) Тогда
								Продолжить;
							КонецЕсли;
						ИначеЕсли ЭлементСписка.Значение.Свойство("ИдентификаторОбщий") Тогда
							Идентификатор = ЭлементСписка.Значение.ИдентификаторОбщий;
						Иначе
							Продолжить;
						КонецЕсли;
						
					Иначе
						Идентификатор = ЭлементСписка.Значение;
					КонецЕсли;
					
					Если Индекс = 0 Тогда
						СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"&%1=%2", ИмяПараметра, Формат(Идентификатор, "ЧГ=0"));
					Иначе
						СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						",%1", Формат(Идентификатор, "ЧГ=0"));
					КонецЕсли;
					
					Индекс = Индекс + 1;
				КонецЦикла;
				
				Продолжить;
				
			ИначеЕсли ЗначениеЗаполнено(ЗначениеПоля) Тогда
				ЗначениеПоля = ЗначениеПоля[0];
				
				Если ТипЗнч(ЗначениеПоля.Значение) = Тип("Структура") Тогда
					Если ЗначениеПоля.Значение.Свойство("IDAvito") Тогда
						ЗначениеПоля = ЗначениеПоля.Значение.IDAvito;
					Иначе
						Продолжить;
					КонецЕсли;
				Иначе
					ЗначениеПоля = ЗначениеПоля.Значение
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если КлючИЗначение.Ключ = "ПериодРазмещения" Тогда
			Если ЗначениеПоля = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЗначениеПоля = РекрутинговыеСайтыСлужебный.ДатаRFC3339(-ЗначениеПоля*86400);
		КонецЕсли;
	
		СтрокаОтбора = СтрокаОтбора
			+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("&%1=%2", ИмяПараметра, ЗначениеПоля);
	КонецЦикла;

	Возврат СтрокаОтбора;
	
КонецФункции

Функция СсылкаНаРезюме(ИдентификаторРезюме)
	
	СсылкаНаРезюме = "";
	
	Попытка
		Резюме = СтруктураРезюмеССайта(ИдентификаторРезюме, Ложь, Ложь);
	Исключение
		Возврат СсылкаНаРезюме;
	КонецПопытки;

	Если ЗначениеЗаполнено(Резюме) Тогда
		СсылкаНаРезюме = "https://www.avito.ru" + ЗначениеСвойстваУзла(Резюме, "url");
	КонецЕсли;
	
	Возврат СсылкаНаРезюме;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Обновление - Булево
// 
// Возвращаемое значение:
//  Строка
Функция JSONОписаниеВакансии(Дерево, Обновление = Ложь, Реактивация = Ложь)
	
	СтрокаJSON = "";
	
	СтруктураОписанияВакансииAvito = СтруктураОписанияВакансии(Дерево, Обновление, Реактивация);
	СтрокаJSON = РекрутинговыеСайтыСлужебный.ЗаписьJSON(СтруктураОписанияВакансииAvito);
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СтруктураОписанияВакансии(Дерево, Обновление = Ложь, Реактивация = Ложь)
	
	СтруктураВакансии = Новый Структура;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ТипЗнч(СтрокаДерева.Показатель) = Тип("СправочникСсылка.Вакансии") Тогда
			Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
				ДополнитьСтруктуруВакансии(СтруктураВакансии, СтрокаДереваПодчиненная, Обновление, Реактивация);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураВакансии;
	
КонецФункции

Процедура ДополнитьСтруктуруВакансии(СтруктураВакансии, СтрокаДерева, Обновление, Реактивация)
	
	Если Реактивация И СтрокаДерева.Путь <> "billing_type" Тогда
		Возврат;
	КонецЕсли;
	
	Значение = Неопределено;
	Если СтрокаДерева.ТипРеквизита = "Строка" Тогда
		Если Обновление И Не СтрокаДерева.СтрокаИзменена Тогда
			Если СтрокаДерева.Путь = "title" Или СтрокаДерева.Путь = "description" Тогда
				СтрокаДерева.ПубликацияВакансии = СтрокаДерева.ВакансияВПрограмме;
				СтрокаДерева.ПубликацияВакансииТекст = СтрокаДерева.ВакансияВПрограммеТекст;
			КонецЕсли;
		КонецЕсли;
		
		Если ПоляВакансииСТекстомВHTML().Найти(СтрокаДерева.Путь) <> Неопределено Тогда
			Значение = СтрокаДерева.ПубликацияВакансииТекст;
		Иначе
			Значение = СтрокаДерева.ПубликацияВакансии;
		КонецЕсли;
	ИначеЕсли СтрокаДерева.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоМассива() Тогда
		Если ЗначениеЗаполнено(СтрокаДерева.ПубликацияВакансии) Тогда
			Значение = СтрокаДерева.ПубликацияВакансии.ВыгрузитьЗначения();
		КонецЕсли;
	ИначеЕсли СтрокаДерева.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта() Тогда
		Если СтрокаДерева.Путь = "salary" Тогда
			ЗарплатаОт = ?(ЗначениеЗаполнено(СтрокаДерева.Строки[0].ПубликацияВакансии),
				СтрокаДерева.Строки[0].ПубликацияВакансии, 0);
			ЗарплатаДо = ?(ЗначениеЗаполнено(СтрокаДерева.Строки[1].ПубликацияВакансии),
				СтрокаДерева.Строки[1].ПубликацияВакансии, 0);
				
			ЗарплатаОт = ?(ЗарплатаОт = ЗарплатаДо, 0, ЗарплатаОт);
			
			Значение = Новый Структура("from,to",
				Мин(ЗарплатаОт, ЗарплатаДо), Макс(ЗарплатаОт, ЗарплатаДо));
		ИначеЕсли СтрокаДерева.Путь = "contacts" Тогда
			Значение = Новый Структура();
			
			Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.Строки Цикл
				Если ПодчиненнаяСтрока.Путь = "contacts.name"
					И ЗначениеЗаполнено(ПодчиненнаяСтрока.ПубликацияВакансии) Тогда
					Значение.Вставить("name", ПодчиненнаяСтрока.ПубликацияВакансии);
				ИначеЕсли ПодчиненнаяСтрока.Путь = "contacts.phone"
					И ЗначениеЗаполнено(ПодчиненнаяСтрока.ПубликацияВакансии) Тогда
					Значение.Вставить("phone", ПодчиненнаяСтрока.ПубликацияВакансии);
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Значение) Тогда
				Значение.Вставить("allow_messages", Истина);
			КонецЕсли;
		ИначеЕсли СтрокаДерева.Путь = "location" Тогда
			Координаты = СтрРазделить(СтрокаДерева.ПубликацияВакансии[0].Значение, " ");
			Значение = Новый Структура("coordinates",
				Новый Структура("latitude,longitude", Число(Координаты[0]), Число(Координаты[1])));
		Иначе
			Если СтрокаДерева.ПубликацияВакансии <> Неопределено Тогда
				Значение = СтрокаДерева.ПубликацияВакансии[0].Значение;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Значение = СтрокаДерева.ПубликацияВакансии;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		СтруктураВакансии.Вставить(СтрокаДерева.Путь, Значение);
	КонецЕсли;
	
КонецПроцедуры

#Область ПоляВакансии

Функция ПоляВакансииСОдиночнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("location");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("billing_type");
	Поля.Добавить("business_area");
	Поля.Добавить("schedule");
	Поля.Добавить("experience");
	Поля.Добавить("profession");
	Поля.Добавить("payout_frequency");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("registration_method");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииНедоступныеДляРедактирования()
	
	Поля = Новый Массив;
	Поля.Добавить("contacts");
	Поля.Добавить("salary");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСТекстомВHTML()
	
	Поля = Новый Массив;
	Поля.Добавить("description");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

Функция РеактивироватьВакансию(ИдентификаторВакансии, Дерево)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансииAvito = JSONОписаниеВакансии(Дерево, Истина, Истина);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("job/v1/vacancies/%1/prolongate", ИдентификаторВакансии));
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансииAvito);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 И РезультатЗапроса.КодСостояния <> 403 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьВсеСтраницыРесурса(Ресурс, ИмяСвойстваРезультата, Результат, Страница = 1)
	
	НаСтранице = 20;
	ТекстЗапроса = Ресурс;
	Если СтрНайти(Ресурс, "?") > 0 Тогда
		ТекстЗапроса = ТекстЗапроса + "&";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "?";
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон("%1per_page=%2&page=%3", ТекстЗапроса,
		Формат(НаСтранице, "ЧН=0; ЧГ="),
		Формат(Страница, "ЧН=0; ЧГ="));

	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка получения содержимого ресурса %1 с сайта %2.'"), Ресурс, Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат;
	КонецЕсли;
	
	Ответ = ПарсерJSON(РезультатЗапроса.ТелоОтвета, Истина);
	Ресурсы = ЗначениеСвойстваУзла(Ответ, ИмяСвойстваРезультата);
	
	Если Ресурсы = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка получения содержимого ресурса %1 с сайта %2.'"), Ресурс, Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат;
	КонецЕсли;
	
	Если Ресурсы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, Ресурсы);
	
	Страница = Страница + 1;
	
	ПолучитьВсеСтраницыРесурса(Ресурс, ИмяСвойстваРезультата, Результат, Страница);
	
КонецПроцедуры

Функция СоответствиеПолейПоискаКандидатов()
	
	СоответствиеПолейПоиска = Новый Соответствие;
	
	СоответствиеПолейПоиска.Вставить("КлючевоеСлово", "query");
	СоответствиеПолейПоиска.Вставить("ВозрастОт", "age_min");
	СоответствиеПолейПоиска.Вставить("ВозрастДо", "age_max");
	СоответствиеПолейПоиска.Вставить("Пол", "gender");
	СоответствиеПолейПоиска.Вставить("УровеньОбразования", "education_level");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыОт", "salary_min");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыДо", "salary_max");
	СоответствиеПолейПоиска.Вставить("Регион", "location");
	СоответствиеПолейПоиска.Вставить("ПериодРазмещения", "updated_than");
	
	Возврат СоответствиеПолейПоиска;
	
КонецФункции

Функция ДеревоРегионов(Публикация = Ложь)
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Значение", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ИдентификаторДоп", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Пометка", Новый ОписаниеТипов("Число"));
	
	Макет = ПолучитьМакет("КлассификаторРегионов");
	СтрокаXML = Макет.ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	СтрокаРегион = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Region" Тогда
				НоваяСтрока = Дерево.Строки.Добавить();
				СтрокаРегион = НоваяСтрока;
			ИначеЕсли ЧтениеXML.Имя = "City" Тогда
				НоваяСтрока = СтрокаРегион.Строки.Добавить();
			Иначе
				Продолжить;
			КонецЕсли;
			
			Если Публикация Тогда
				НоваяСтрока.Идентификатор = ЧтениеXML.ПолучитьАтрибут("Coord");
			Иначе
				НоваяСтрока.Идентификатор = ЧтениеXML.ПолучитьАтрибут("Id");
			КонецЕсли;
			
			НоваяСтрока.Значение = ЧтениеXML.ПолучитьАтрибут("Name");
		КонецЕсли;
	КонецЦикла;

	Возврат Дерево;
	
КонецФункции

Процедура ЗаполнитьСписокВыбораПрофессий(СписокВыбора)
	
	Макет = ПолучитьМакет("ПрофессииАвитоРабота");
	СтрокаXML = Макет.ПолучитьТекст();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "profession" Тогда
			Идентификатор = "";
			Имя = "";
			Пока ЧтениеXML.Прочитать() Цикл
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "id" Тогда
					ЧтениеXML.Прочитать();
					Идентификатор = ЧтениеXML.Значение;
					Продолжить;
				КонецЕсли;
				
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "name" Тогда
					ЧтениеXML.Прочитать();
					Имя = ЧтениеXML.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			СписокВыбора.Добавить(Число(Идентификатор), Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеПубликацииВакансии(ИдентификаторВакансии, СообщатьОбОшибке = Истина)
	
	ОписаниеПубликации = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат ОписаниеПубликации;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("job/v2/vacancies/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если СообщатьОбОшибке Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	Иначе
		ОписаниеПубликации = ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса);
		ОписаниеПубликации.Вставить("url", ДанныеСайта.ГлавнаяСтраница + ЗначениеСвойстваУзла(ОписаниеПубликации, "url"));
	КонецЕсли;
	
	Возврат ОписаниеПубликации;
	
КонецФункции

Процедура ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, МассивКИ)
	
	РегионРаботы = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "address",, Неопределено);
	Если Не РегионРаботы = Неопределено Тогда
		СтруктураКИ = СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = РегионРаботы;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	КонтактнаяИнформация = ЗначениеСвойстваУзла(СтруктураРезюме, "contacts", ,, Неопределено);
	Если Не ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Контакт Из КонтактнаяИнформация Цикл
		СтруктураКИ = СтруктураКонтактнойИнформации();
		Если ЗначениеСвойстваУзла(Контакт, "type") = "e-mail" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		Иначе
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		КонецЕсли;
		СтруктураКИ.Представление = ЗначениеСвойстваУзла(Контакт, "value");
		МассивКИ.Добавить(СтруктураКИ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразование(СтруктураРезюме, МассивОбразование)
	
	Образования = ЗначениеСвойстваУзла(СтруктураРезюме, "params", "education_list",, Неопределено);
	Если Образования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УровеньОбразования = ВидОбразованияПоИдентификатору(ЗначениеСвойстваУзла(СтруктураРезюме, "params", "education"));
		
	Для Каждого Образование Из Образования Цикл
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		СтруктураОбразование.УчебноеЗаведение = ЗначениеСвойстваУзла(Образование, "institution");
		СтруктураОбразование.Специальность = ЗначениеСвойстваУзла(Образование, "specialty");
		ДатаОкончания = ЗначениеСвойстваУзла(Образование, "education_stop");
		СтруктураОбразование.ВидОбразования = УровеньОбразования;
		МассивОбразование.Добавить(СтруктураОбразование);
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОбразованияПоИдентификатору(Идентификатор)
	
	ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	// АПК:1297-выкл Идентификаторы внешнего классификатора, не требуют локализации
	Если Идентификатор = "Среднее" Тогда // среднее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли Идентификатор = "Среднее специальное" Тогда // средне-специальное
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли Идентификатор = "Незаконченное высшее" Тогда // неполное высшее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли Идентификатор = "Высшее" Тогда // высшее
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	КонецЕсли;
	// АПК:1297-вкл
	
	Возврат ВидОбразования;
	
КонецФункции

// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений
//  РезультатПоискаРезюме - Соответствие
//  ПолеСортировки - Число
Процедура ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки)
	
	Для Каждого Резюме Из ЗначениеСвойстваУзла(РезультатПоискаРезюме, "resumes") Цикл
		
		НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
		НоваяСтрока.ГдеНайден = Сайт;
		НоваяСтрока.НазваниеРезюме = ЗначениеСвойстваУзла(Резюме, "title");
		НоваяСтрока.ФИО = НСтр("ru = 'Будут загружены при создании кандидата.'");
		НоваяСтрока.ПоследнееМестоРаботы = НСтр("ru = 'Будет загружено при создании кандидата.'");
		НоваяСтрока.УровеньЗарплаты = ЗначениеСвойстваУзла(Резюме, "salary",,, 0);
		НоваяСтрока.Регион = ЗначениеСвойстваУзла(Резюме, "location", "title");
		
		Пол = ЗначениеСвойстваУзла(Резюме, "gender");
		Если Пол = "male" Тогда
			НоваяСтрока.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Пол = "female" Тогда
			НоваяСтрока.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		Иначе
			НоваяСтрока.Пол = "-";
		КонецЕсли;
		НоваяСтрока.Возраст = ЗначениеСвойстваУзла(Резюме, "age");
		НоваяСтрока.ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Резюме, "id"), "ЧГ=");
		
		НоваяСтрока.СсылкаНаРезюме = СсылкаНаРезюме(НоваяСтрока.ИдентификаторРезюме);
		
		ДатаОбновления = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "updated_at"), Ложь);
		ДатаСоздания = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "created_at"), Ложь);
		Если ЗначениеЗаполнено(ДатаОбновления) Тогда
			НоваяСтрока.ДатаРазмещения = ДатаОбновления;
		ИначеЕсли ЗначениеЗаполнено(ДатаСоздания) Тогда
			НоваяСтрока.ДатаРазмещения = ДатаСоздания;
		КонецЕсли;
		
		НоваяСтрока.ПолеСортировки = ПолеСортировки;
		ПолеСортировки = ПолеСортировки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
