#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("РезультатРазбораРезюме", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя = "СоздатьКандидата";
	Вид.ИмяПодменю = "СоздатьКандидата";
	Вид.Заголовок = НСтр("ru = 'Создать кандидата'");
	Вид.Порядок = 50;
	Вид.Картинка = Новый Картинка;
	Вид.Отображение = ОтображениеКнопки.Текст;
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если Источники.Строки.Найти(Метаданные.ЖурналыДокументов.Взаимодействия, "Метаданные") <> Неопределено Тогда
		Команда = Команды.Добавить();
		Команда.Вид = "СоздатьКандидата";
		Команда.Представление = НСтр("ru = 'Создать кандидата'"); //КоманднаяПанельВариантаНавигации
		Команда.ВидимостьВФормах = "ФормаСписка";
		Команда.Обработчик = "РазборРезюмеКлиент.СоздатьКандидатаПоВложениюПодключаемый";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВложений(Вложения, Расширения, Результат) Экспорт
	
	Для Каждого Вложение Из Вложения Цикл
		Если Расширения.Найти(Вложение.Расширение) <> Неопределено Тогда
			СтрокаСписка = Результат.Добавить();
			СтрокаСписка.Значение = Вложение.Ссылка;
			СтрокаСписка.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1.%2'"),
				Вложение.Наименование, Вложение.Расширение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатРазбораРезюме(ФайлыРезюме, ДанныеФайловWord, СпособРазбораРезюме) Экспорт
	
	СтруктураОтвета = СтруктурыОтвета();
	ДанныеКандидатов = СтруктураОтвета.ДанныеКандидатов;
	ТекстыРезюме = Новый Массив;
	
	ПолучитьРезюмеИзФайлов(ДанныеКандидатов, ФайлыРезюме, ТекстыРезюме);
	ПолучитьРезюмеИзДанныхФайловWord(ДанныеКандидатов, ДанныеФайловWord, ТекстыРезюме);
	
	Если СпособРазбораРезюме <> РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнешнийСервис Тогда
		ЗаполнитьДанныеКандидатов(ДанныеКандидатов);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	РезультатЗапроса = РазборРезюмеСемантическийАнализ.ЗапросКСервису(ТекстыРезюме);
	Если РезультатЗапроса.Данные <> Неопределено Тогда
		РазборРезюмеСемантическийАнализ.ПрочитатьРезультатЗапроса(РезультатЗапроса.Данные, ДанныеКандидатов);
		Возврат СтруктураОтвета;
	КонецЕсли;
	
	СтруктураОтвета.СтруктураОшибки.ОшибкаСервиса = РезультатЗапроса.ОшибкаСервиса;
	СтруктураОтвета.СтруктураОшибки.ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	ЗаполнитьДанныеКандидатов(ДанныеКандидатов);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция СписокСоответствийСемейноеПоложение() Экспорт
	
	СоответствиеКлассификаторов = Новый Соответствие();
	
	СоответствиеКлассификаторов.Вставить("холост", Справочники.СостояниеВБраке.НайтиПоКоду(1));
	СоответствиеКлассификаторов.Вставить("не замужем", Справочники.СостояниеВБраке.НайтиПоКоду(1));
	СоответствиеКлассификаторов.Вставить("женат", Справочники.СостояниеВБраке.НайтиПоКоду(2));
	СоответствиеКлассификаторов.Вставить("замужем", Справочники.СостояниеВБраке.НайтиПоКоду(2));
	СоответствиеКлассификаторов.Вставить("разведен", Справочники.СостояниеВБраке.НайтиПоКоду(5));
	СоответствиеКлассификаторов.Вставить("разведена", Справочники.СостояниеВБраке.НайтиПоКоду(5));
	
	Возврат СоответствиеКлассификаторов;
	
КонецФункции

Функция СтрокаКакЧисло(Знач ИсходнаяСтрока) Экспорт
	
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Длина = СтрДлина(ИсходнаяСтрока);
	Для НомерСимвола = 1 По Длина Цикл
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Или КодСимвола = 40 Тогда // Минус или открывающая скобка.
			Если Результат <> 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			ЗнакОтрицательный = Истина;
		ИначеЕсли КодСимвола = 41 Тогда // Закрывающая скобка.
			Если Не ЗнакОтрицательный Или Результат = 0 Тогда // Не было открывающей скобки или нет числа.
				Возврат Неопределено;
			КонецЕсли;
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				Возврат Неопределено; // Разделитель уже был, следовательно это не число.
			КонецЕсли;
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСФайламиРезюме

Процедура ПолучитьРезюмеИзФайлов(ДанныеКандидатов, ФайлыРезюме, ТекстыРезюме)
	
	Если ФайлыРезюме = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВременныйКаталог = ФайловаяСистема.СоздатьВременныйКаталог();
	
	Для Каждого ФайлРезюме Из ФайлыРезюме Цикл
		СтруктураРезюме = ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ФайлРезюме.ИмяФайла);
		ИмяВременногоФайла = СтрШаблон("%1.%2", Новый УникальныйИдентификатор, РасширениеФайла);
		ВременныйФайл = СоздатьВременныйФайл(ВременныйКаталог, ИмяВременногоФайла, ФайлРезюме.ДвоичныеДанные);
		
		Если РазборРезюмеКлиентСервер.ЭтоФорматTXT(РасширениеФайла) Тогда 
			ТекстРезюме = ТекстИзФайлаTXT(ВременныйФайл, ВременныйКаталог);
		ИначеЕсли РазборРезюмеКлиентСервер.ЭтоФорматPDF(РасширениеФайла) Тогда
			ТекстРезюме = ТекстИзФайлаPDF(ВременныйФайл, ВременныйКаталог);
			СтруктураРезюме.Фото = ФотоИзФайлаPDF(ВременныйФайл, ВременныйКаталог);
		КонецЕсли;
		ТекстРезюме = РазборРезюмеКлиентСервер.ТекстПослеНормализации(ТекстРезюме);
		
		СтруктураРезюме.ТекстРезюме = ТекстРезюме;
		СтруктураРезюме.ФайлРезюме.ИмяФайла = ФайлРезюме.ИмяФайла;
		СтруктураРезюме.ФайлРезюме.Хранение = ФайлРезюме.Хранение;
		СтруктураРезюме.ИсточникИнформации = РазборРезюмеКлиентСервер.ИсточникИнформацииПоТексту(ТекстРезюме);
		СтруктураРезюме.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.ФайлРезюме;
		
		ТекстыРезюме.Добавить(ТекстРезюме);
		ДанныеКандидатов.Добавить(СтруктураРезюме);
	КонецЦикла;
	
	ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
	
КонецПроцедуры

Процедура ПолучитьРезюмеИзДанныхФайловWord(ДанныеКандидатов, ДанныеФайловWord, ТекстыРезюме)
	
	Если ДанныеФайловWord = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеФайлаWord Из ДанныеФайловWord Цикл
		СтруктураРезюме = ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
		СтруктураРезюме.ТекстРезюме = ДанныеФайлаWord.ТекстРезюме;
		СтруктураРезюме.ФайлРезюме.ИмяФайла = ДанныеФайлаWord.ИмяФайла;
		СтруктураРезюме.ФайлРезюме.Хранение = ДанныеФайлаWord.Хранение;
		СтруктураРезюме.Фото = ДанныеФайлаWord.Фотография;
		СтруктураРезюме.ИсточникИнформации = ДанныеФайлаWord.ИсточникИнформации;
		СтруктураРезюме.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.ФайлРезюме;
		ТекстыРезюме.Добавить(ДанныеФайлаWord.ТекстРезюме);
		ДанныеКандидатов.Добавить(СтруктураРезюме);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьКомандуMuPDF(Команда, ИмяФайлаPDF, ВременныйКаталог, ИмяФайлаTXT = "")
	
	ПолныйПуть = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		ПодборПерсонала.УстановленныеНастройки().ПутьККаталогуMuPDF);
	
	Если ЗначениеЗаполнено(ИмяФайлаTXT) Тогда
		ИмяСоздаваемогоФайла = ИмяФайлаTXT;
	Иначе
		ИмяСоздаваемогоФайла = "";
	КонецЕсли;
	
	СтрокаКоманды = СтрШаблон("""%1%2"" %3 %4 ""%5""",
		СокрЛП(ПолныйПуть),
		?(ОбщегоНазначения.ЭтоWindowsСервер(), "mutool.exe", "mutool"),
		Команда,
		ИмяСоздаваемогоФайла,
		ИмяФайлаPDF);
	
	Попытка
		ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
		ПараметрыЗапускаПрограммы.ТекущийКаталог = ВременныйКаталог;
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		Результат = ФайловаяСистема.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка при запуске MuPDF:
			|%1
			|(%2)'"),
			СтрокаКоманды,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запуск MuPDF'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	Если Результат.КодВозврата <> 0 Тогда
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка %1 при работе MuPDF:
			|%2
			|Возможно, нарушена структура командной строки.'"),
			Результат.КодВозврата,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запуск MuPDF'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьВременныйФайл(ВременныйКаталог, ИмяФайла, ДвоичныеДанные = Неопределено)
	
	ВременныйФайл = ФайловаяСистема.УникальноеИмяФайла(СтрШаблон("%1%2", ВременныйКаталог, ИмяФайла));
	
	Попытка
		Если ДвоичныеДанные = Неопределено Тогда
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Записать(ВременныйФайл, КодировкаТекста.UTF8);
		Иначе
			ДвоичныеДанные.Записать(ВременныйФайл);
		КонецЕсли;
		Возврат ВременныйФайл;
	Исключение
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось записать %1 на сервере
			|по причине: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ИмяФайла, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Разбор резюме.Запись файла на сервере'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
КонецФункции

Функция ТекстИзФайлаTXT(ВременныйФайлTXT, ВременныйКаталог)
	
	ИзвлеченныйТекст = "";
	
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйФайл.Прочитать(ВременныйФайлTXT,
			КодировкаТекста.UTF8,
			Символы.ВК + Символы.ПС);
		ИзвлеченныйТекст = ТекстовыйФайл.ПолучитьТекст();
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось извлечь текст резюме из файла TXT
			|по причине: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Разбор резюме.Извлечение текста'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

Функция ТекстИзФайлаPDF(ВременныйФайлPDF, ВременныйКаталог)
	
	ИмяВременногоФайлаTXT = СтрШаблон("%1.txt", Новый УникальныйИдентификатор);
	ВременныйФайлTXT = СоздатьВременныйФайл(ВременныйКаталог, ИмяВременногоФайлаTXT);
	ВыполнитьКомандуMuPDF("convert -o", ВременныйФайлPDF, ВременныйКаталог, ВременныйФайлTXT);
	
	ИзвлеченныйТекст = "";
	ТекстовыйФайл = Новый ТекстовыйДокумент;
	Попытка
		ТекстовыйФайл.Прочитать(ВременныйФайлTXT,
			КодировкаТекста.UTF8,
			Символы.ВК + Символы.ПС);
		ИзвлеченныйТекст = ТекстовыйФайл.ПолучитьТекст();
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(ВременныйКаталог);
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось извлечь текст резюме из файла PDF
			|по причине: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Разбор резюме.Извлечение текста'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстИсключения);
		ВызватьИсключение ТекстИсключения;
	КонецПопытки;
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

Функция ФотоИзФайлаPDF(ВременныйФайлPDF, ВременныйКаталог)
	
	ВыполнитьКомандуMuPDF("extract", ВременныйФайлPDF, ВременныйКаталог);
	
	РазмерФотографии = 0;
	Фотография = Неопределено;
	МассивФайлов = НайтиФайлы(ВременныйКаталог, "im*");
	Для Каждого Файл Из МассивФайлов Цикл
		
		Картинка = Новый Картинка(Файл.ПолноеИмя);
		Если Картинка.РазмерФайла() > РазмерФотографии Тогда
			РазмерФотографии = Картинка.РазмерФайла();
			Фотография = Картинка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Фотография;
	
КонецФункции

#КонецОбласти

#Область ПоискДанныхРезюме

Функция ПравилоПоискаПоКлючу(КлючПоиска,
							 ЯвляетсяЗначением,
							 КоличествоСимволовПодЗначение,
							 УчитыватьРегистр,
							 ЭтоСписок = Ложь,
							 КлючОкончанияПоиска = Неопределено)
	
	ПравилоПоиска = Новый Структура();
	
	ПравилоПоиска.Вставить("КлючПоиска", КлючПоиска);
	ПравилоПоиска.Вставить("ЯвляетсяЗначением", ЯвляетсяЗначением);
	ПравилоПоиска.Вставить("КоличествоСимволовПодЗначение", КоличествоСимволовПодЗначение);
	ПравилоПоиска.Вставить("УчитыватьРегистр", УчитыватьРегистр);
	ПравилоПоиска.Вставить("ЭтоСписок", ЭтоСписок);
	
	Если КлючОкончанияПоиска <> Неопределено Тогда
		ПравилоПоиска.Вставить("КлючОкончанияПоиска", КлючОкончанияПоиска);
	КонецЕсли;
	
	Возврат ПравилоПоиска;
	
КонецФункции

Функция ЗначениеИзТекстаПоКлючевомуСлову(Знач ТекстДляРаспознавания, Знач ПравилоПоиска)
	
	ЗначениеИзТекста = "";
	КлючПоиска = ПравилоПоиска.КлючПоиска;
	КоличествоСимволовПодЗначение = ПравилоПоиска.КоличествоСимволовПодЗначение;
	
	ЯвляетсяЗначением = Ложь;
	Если Не ПравилоПоиска.Свойство("ЯвляетсяЗначением", ЯвляетсяЗначением) Тогда
		ЯвляетсяЗначением = Ложь;
	КонецЕсли;
	
	УчитыватьРегистр = Ложь;
	Если Не ПравилоПоиска.Свойство("УчитыватьРегистр", УчитыватьРегистр) Тогда
		УчитыватьРегистр = Ложь;
	КонецЕсли;
	
	Если УчитыватьРегистр Тогда
		ПозицияНачала = СтрНайти(ТекстДляРаспознавания, КлючПоиска);
	Иначе
		ПозицияНачала = СтрНайти(НРег(ТекстДляРаспознавания), НРег(КлючПоиска));
	КонецЕсли;
	
	ПозицияОкончанияПоиска = Неопределено;
	Если ПравилоПоиска.Свойство("КлючОкончанияПоиска") Тогда
		КлючОкончанияПоиска = ПравилоПоиска.КлючОкончанияПоиска;
		ПозицияОкончанияПоиска = СтрНайти(ТекстДляРаспознавания, КлючОкончанияПоиска);
	КонецЕсли;
	
	Если ПозицияНачала > 0 Тогда
		
		Если ПравилоПоиска.ЭтоСписок Тогда
			Если ПравилоПоиска.ЯвляетсяЗначением = Истина Тогда
				Пока ПозицияНачала > 0 Цикл
					ПозицияКонца = СтрНайти(ТекстДляРаспознавания, Символы.ПС,, ПозицияНачала);
					Если ПозицияКонца = 0 Тогда // Если в строке нет переноса строки, то берем весь оставшийся текст после текущего блока.
						ЗначениеИзТекста = СокрЛП(Сред(ТекстДляРаспознавания, ПозицияНачала + СтрДлина(КлючПоиска)));
						Прервать;
					ИначеЕсли СтрДлина(КлючПоиска) <> (ПозицияКонца-ПозицияНачала) Тогда
						ПозицияНачала = СтрНайти(ТекстДляРаспознавания, КлючПоиска,,ПозицияКонца);
					Иначе
						ЗначениеИзТекста = Сред(ТекстДляРаспознавания, ПозицияКонца + 1);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ПозицияКонца = СтрНайти(ТекстДляРаспознавания, Символы.ПС,, ПозицияНачала);
				Если ПозицияОкончанияПоиска <> Неопределено И ПозицияОкончанияПоиска <> 0 Тогда
					ЗначениеИзТекста = Сред(ТекстДляРаспознавания, ПозицияКонца + 1, ПозицияОкончанияПоиска - ПозицияКонца - 1);
				Иначе
					ЗначениеИзТекста = Сред(ТекстДляРаспознавания, ПозицияКонца + 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЯвляетсяЗначением Тогда
			ЗначениеИзТекста = КлючПоиска;
		КонецЕсли;
		
		Если КоличествоСимволовПодЗначение > 0 Тогда
			ЗначениеИзТекста = ЗначениеИзТекста + Сред(ТекстДляРаспознавания, ПозицияНачала + СтрДлина(КлючПоиска), КоличествоСимволовПодЗначение);
		ИначеЕсли КоличествоСимволовПодЗначение < 0 Тогда
			ПозицияНачала = ?((ПозицияНачала + КоличествоСимволовПодЗначение) > 0, ПозицияНачала + КоличествоСимволовПодЗначение, 1);
			ЗначениеИзТекста = Сред(ТекстДляРаспознавания, ПозицияНачала, - КоличествоСимволовПодЗначение) + ЗначениеИзТекста;
		КонецЕсли;
		
		Если Не ЯвляетсяЗначением Тогда
			ЗначениеИзТекста = СтрЗаменить(ЗначениеИзТекста, КлючПоиска, "");
		КонецЕсли;
		
		ЗначениеИзТекста = СтрЗаменить(ЗначениеИзТекста, ":", "");
		ЗначениеИзТекста = СтрЗаменить(ЗначениеИзТекста, ";", "");
		
		ЗначениеИзТекста = СокрЛП(ЗначениеИзТекста);
		КлючПоискаПС = Символы.ПС;
		НаправлениеПоискаЗначение = ?(КоличествоСимволовПодЗначение > 0, НаправлениеПоиска.СНачала, НаправлениеПоиска.СКонца);
		ПозНачПС = СтрНайти(ЗначениеИзТекста, КлючПоискаПС, НаправлениеПоискаЗначение);
		
		Если ПозНачПС > 0 Тогда
			Если КоличествоСимволовПодЗначение > 0 Тогда
				ЗначениеИзТекста = Лев(ЗначениеИзТекста, ПозНачПС);
			ИначеЕсли КоличествоСимволовПодЗначение < 0 Тогда
				ЗначениеИзТекста = Сред(ЗначениеИзТекста, ПозНачПС);
			КонецЕсли;
			
			ЗначениеИзТекста = СокрЛП(ЗначениеИзТекста);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьДанныеКандидатов(ДанныеКандидатов)
	
	Для Каждого ДанныеКандидата Из ДанныеКандидатов Цикл
		ЗаполнитьДанныеКандидата(ДанныеКандидата);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКандидата(ДанныеКандидата)
	
	СтруктураДанныхРезюме = СтруктураДанныхРезюмеОбщая(ДанныеКандидата.ТекстРезюме);
	
	ДанныеКандидатаПоВерсииHH = СтруктураДанныхРезюмеHH(ДанныеКандидата.ТекстРезюме);
	ДозаполнитьСтруктураДанныхРезюме(СтруктураДанныхРезюме, ДанныеКандидатаПоВерсииHH);
	
	ДанныеКандидатаПоВерсииSJ = СтруктураДанныхРезюмеSJ(ДанныеКандидата.ТекстРезюме);
	ДозаполнитьСтруктураДанныхРезюме(СтруктураДанныхРезюме, ДанныеКандидатаПоВерсииSJ);
	
	Для Каждого КлючИЗначение Из СтруктураДанныхРезюме Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Или Не ДанныеКандидата.Свойство(КлючИЗначение.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ДанныеКандидата[КлючИЗначение.Ключ], КлючИЗначение.Значение);
		Иначе
			ДанныеКандидата[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеСвойства = Неопределено;
	
	Если СтруктураДанныхРезюме.Свойство("Телефон", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.КонтактнаяИнформация.Добавить(
			Новый Структура(
			"Тип,Вид,Представление",
			Перечисления.ТипыКонтактнойИнформации.Телефон,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"),
			ЗначениеСвойства));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("EMail", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.КонтактнаяИнформация.Добавить(
			Новый Структура(
			"Тип,Вид,Представление",
			Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"),
			ЗначениеСвойства));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("Адрес", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.КонтактнаяИнформация.Добавить(
			Новый Структура(
			"Тип,Вид,Представление",
			Перечисления.ТипыКонтактнойИнформации.Адрес,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов"),
			ЗначениеСвойства));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("Telegram", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.КонтактнаяИнформация.Добавить(
			Новый Структура(
			"Тип,Вид,Представление",
			Перечисления.ТипыКонтактнойИнформации.Другое,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.TelegramЛичныеДанныеКандидатов"),
			ЗначениеСвойства));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("Max", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.КонтактнаяИнформация.Добавить(
			Новый Структура(
			"Тип,Вид,Представление",
			Перечисления.ТипыКонтактнойИнформации.ВебСтраница,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.MAXЛичныеДанныеКандидатов"),
			ЗначениеСвойства));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("ТекущееГражданство", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.Гражданство.Добавить(Новый Структура("Страна, Дата", Строка(ЗначениеСвойства)));
	КонецЕсли;
	
	Если СтруктураДанныхРезюме.Свойство("СостояниеВБракеСсылка", ЗначениеСвойства) И ЗначениеЗаполнено(ЗначениеСвойства) Тогда
		ДанныеКандидата.СостояниеВБраке.Добавить(Новый Структура("СостояниеВБраке, Дата", ЗначениеСвойства));
	КонецЕсли;
	
КонецПроцедуры

Процедура ДозаполнитьСтруктураДанныхРезюме(СтруктураДанныхРезюме, ДанныеКандидатаПоВерсии)
	
	Для Каждого КлючИЗначение Из ДанныеКандидатаПоВерсии Цикл
		ТекущееЗначениеДанных = Неопределено;
		СтруктураДанныхРезюме.Свойство(КлючИЗначение.Ключ, ТекущееЗначениеДанных);
		Если ТипЗнч(КлючИЗначение.Значение) <> Тип("Массив") Тогда
			Если Не ЗначениеЗаполнено(ТекущееЗначениеДанных) Тогда
				СтруктураДанныхРезюме.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		Иначе
			СтруктураДанныхРезюме.Вставить(КлючИЗначение.Ключ, 
				ЗначениеНаиболееПодходящееДаннымРезюме(
					КлючИЗначение.Ключ, ТекущееЗначениеДанных, КлючИЗначение.Значение));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СтруктурыОтвета()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ДанныеКандидатов", Новый Массив);
	СтруктураОтвета.Вставить("СтруктураОшибки", СтруктураОшибкиРазбораРезюме());
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция СтруктураОшибкиРазбораРезюме()
	
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("ОшибкаСервиса", Ложь);
	СтруктураОшибки.Вставить("ОписаниеОшибки", "");
	
	Возврат СтруктураОшибки;
	
КонецФункции

Функция ЗначениеНаиболееПодходящееДаннымРезюме(Имя, ТекущееЗначение, НовоеЗначение)
	
	Если НовоеЗначение = Неопределено
		ИЛИ НовоеЗначение.Количество() = 0 Тогда
		Возврат ТекущееЗначение;
	КонецЕсли;
	
	Если ТекущееЗначение = Неопределено
		ИЛИ ТекущееЗначение.Количество() = 0 Тогда
		Возврат НовоеЗначение;
	КонецЕсли;
	
	Если Имя = "ТрудоваяДеятельность" Тогда
		КлючевоеПоле = "ДатаНачала";
		
		ВесТекущегоЗначения = 0;
		СуммаЗначения = 0;
		Для Каждого ТекЭлемент Из ТекущееЗначение Цикл
			Если ЗначениеЗаполнено(ТекЭлемент[КлючевоеПоле]) Тогда
				СуммаЗначения = СуммаЗначения + 1;
			КонецЕсли;
		КонецЦикла;
		ВесТекущегоЗначения = СуммаЗначения/ТекущееЗначение.Количество();
		
		ВесНовогоЗначения = 0;
		СуммаЗначения = 0;
		Для Каждого ТекЭлемент Из НовоеЗначение Цикл
			Если ЗначениеЗаполнено(ТекЭлемент[КлючевоеПоле]) Тогда
				СуммаЗначения = СуммаЗначения + 1;
			КонецЕсли;
		КонецЦикла;
		ВесНовогоЗначения = СуммаЗначения/НовоеЗначение.Количество();
		
		Если ВесТекущегоЗначения >= ВесНовогоЗначения Тогда
			Возврат ТекущееЗначение;
		Иначе
			Возврат НовоеЗначение;
		КонецЕсли;
		
	ИначеЕсли Имя = "Образование" Тогда
		КлючевоеПоле = "Окончание";
		
		ВесТекущегоЗначения = 0;
		СуммаЗначения = 0;
		Для Каждого ТекЭлемент Из ТекущееЗначение Цикл
			Если ЗначениеЗаполнено(ТекЭлемент[КлючевоеПоле]) И ТекЭлемент[КлючевоеПоле] > 1900 Тогда
					СуммаЗначения = СуммаЗначения + 1;
			КонецЕсли;
		КонецЦикла;
		ВесТекущегоЗначения = СуммаЗначения/ТекущееЗначение.Количество();
		
		ВесНовогоЗначения = 0;
		СуммаЗначения = 0;
		Для Каждого ТекЭлемент Из НовоеЗначение Цикл
			Если ЗначениеЗаполнено(ТекЭлемент[КлючевоеПоле]) И ТекЭлемент[КлючевоеПоле] > 1900 Тогда
				СуммаЗначения = СуммаЗначения + 1;
			КонецЕсли;
		КонецЦикла;
		ВесНовогоЗначения = СуммаЗначения/НовоеЗначение.Количество();
		
		Если ВесТекущегоЗначения >= ВесНовогоЗначения Тогда
			Возврат ТекущееЗначение;
		Иначе
			Возврат НовоеЗначение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекущееЗначение;
	
КонецФункции

Функция СтруктураДанныхРезюмеВнутренняя()
	
	СтруктураДанныхКандидата = Новый Структура();
	СтруктураДанныхКандидата.Вставить("Фамилия");
	СтруктураДанныхКандидата.Вставить("Имя");
	СтруктураДанныхКандидата.Вставить("Отчество");
	СтруктураДанныхКандидата.Вставить("Гражданство");
	СтруктураДанныхКандидата.Вставить("ДатаРождения");
	СтруктураДанныхКандидата.Вставить("ЗнаниеЯзыков");
	СтруктураДанныхКандидата.Вставить("ИсточникИнформации");
	СтруктураДанныхКандидата.Вставить("КонтактнаяИнформация");
	СтруктураДанныхКандидата.Вставить("МестоРождения");
	СтруктураДанныхКандидата.Вставить("ОжидаемыйДоход");
	СтруктураДанныхКандидата.Вставить("Образование");
	СтруктураДанныхКандидата.Вставить("Пол");
	СтруктураДанныхКандидата.Вставить("СостояниеВБраке");
	СтруктураДанныхКандидата.Вставить("ТрудоваяДеятельность");
	
	Возврат СтруктураДанныхКандидата;
	
КонецФункции

Функция СтруктураДанныхРезюмеОбщая(Знач ТекстДляРаспознавания)
	
	СобственнаяСтруктураДанных = СтруктураДанныхРезюмеВнутренняя();
	
	ЗаполнитьЗначенияСвойств(СобственнаяСтруктураДанных, ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИОИзТекста(ТекстДляРаспознавания)));
	
	ОжидаемыйДоходИзТекста = ОжидаемыйДоходИзТекста(ТекстДляРаспознавания);
	
	СобственнаяСтруктураДанных.Вставить("ОжидаемыйДоход", ОжидаемыйДоходИзТекста.ОжидаемыйДоход);
	СобственнаяСтруктураДанных.Вставить("ВалютаДохода", ОжидаемыйДоходИзТекста.ВалютаДохода);
	СобственнаяСтруктураДанных.Вставить("ПериодичностьДохода", Перечисления.ПериодичностьОжидаемогоДоходаКандидатов.Месяц);
	СобственнаяСтруктураДанных.Вставить("Пол", Строка(ПолИзТекста(ТекстДляРаспознавания, СобственнаяСтруктураДанных)));
	СобственнаяСтруктураДанных.Вставить("ДатаРождения",ДатаРожденияИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("EMail", EMailИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("Телефон", ТелефонИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("Адрес", АдресИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("Telegram", TelegramИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("Max", MaxИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("МестоРождения", МестоРожденияИзТекста(ТекстДляРаспознавания));
	СобственнаяСтруктураДанных.Вставить("ТекущееГражданство", Строка(ГражданствоИзТекста(ТекстДляРаспознавания)));
	СобственнаяСтруктураДанных.Вставить("СостояниеВБракеСсылка", СостояниеВБракеИзТекста(ТекстДляРаспознавания));
	
	Возврат СобственнаяСтруктураДанных;
	
КонецФункции

Функция СтруктураДанныхРезюмеHH(Знач ТекстДляРаспознавания)
	
	СтруктураДанныхРезюме = СтруктураДанныхРезюмеОбщая(ТекстДляРаспознавания);
	
	ФорматРезюме = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter");
	
	СтруктураДанныхРезюме.Вставить("ТрудоваяДеятельность", МассивСтруктурОпытРаботыИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	СтруктураДанныхРезюме.Вставить("Образование", МассивСтруктурОбразованиеИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	СтруктураДанныхРезюме.Вставить("ЗнаниеЯзыков", МассивСтруктурЗнаниеЯзыковИзТекста(ТекстДляРаспознавания, ФорматРезюме)); 
	
	СтруктураДанныхРезюме.Вставить("СодержаниеПрочее", ПрочееИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	Возврат СтруктураДанныхРезюме;
	
КонецФункции

Функция СтруктураДанныхРезюмеSJ(Знач ТекстДляРаспознавания)
	
	СтруктураДанныхРезюме = СтруктураДанныхРезюмеОбщая(ТекстДляРаспознавания);
	
	ФорматРезюме =  ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.SuperJob");
	
	СтруктураДанныхРезюме.Вставить("ТрудоваяДеятельность", МассивСтруктурОпытРаботыИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	СтруктураДанныхРезюме.Вставить("Образование", МассивСтруктурОбразованиеИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	СтруктураДанныхРезюме.Вставить("ЗнаниеЯзыков", МассивСтруктурЗнаниеЯзыковИзТекста(ТекстДляРаспознавания, ФорматРезюме)); 
	
	СтруктураДанныхРезюме.Вставить("СодержаниеПрочее", ПрочееИзТекста(ТекстДляРаспознавания, ФорматРезюме));
	
	Возврат СтруктураДанныхРезюме;
	
КонецФункции

Функция ПолИзТекста(Знач ТекстДляРаспознавания, Знач СобственнаяСтруктураДанных)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Мужчина", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ПолПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Женщина", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ПолПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("мужской", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ПолПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("женский", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ПолПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ЗначениеИзТекста = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПолПоЧастямФИО(СобственнаяСтруктураДанных);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Функция ФИОИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = "";
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Ф.И.О.:", Ложь, 100, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("ФИО:", Ложь, 100, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Если ЗначениеИзТекста <> "" Тогда
		ТекстДляРаспознавания = ЗначениеИзТекста;
	КонецЕсли;
	
	ПравилоПоиска = ПравилоПоискаПоКлючу("", Ложь, 100, Ложь);
	
	Для Ид = 1 По 5 Цикл
		
		ЗначениеИзТекстаВременное = СтрПолучитьСтроку(ТекстДляРаспознавания, Ид);
		
		Если СтрНайти(ЗначениеИзТекстаВременное, ":") <> 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеИзТекстаВременное = ЗначениеИзТекстаПоКлючевомуСлову(ЗначениеИзТекстаВременное, ПравилоПоиска);
		ЗначениеИзТекстаВременное = СтрЗаменить(ЗначениеИзТекстаВременное, "  ", " ");
		
		Если Не ЗначениеЗаполнено(ЗначениеИзТекстаВременное)
			ИЛИ ФИОСодержитЗапрещенныеСимволы(ЗначениеИзТекстаВременное) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТРег(ЗначениеИзТекстаВременное) <> ЗначениеИзТекстаВременное Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверим, что ФИО состоит из более чем одного слова.
		СловаЗначенияИзТекста = СтрРазделить(ЗначениеИзТекстаВременное, " ");
		КоличествоСлов = СловаЗначенияИзТекста.Количество();
		Если КоличествоСлов > 1 И КоличествоСлов < 4 Тогда
			ЗначениеИзТекста = ЗначениеИзТекстаВременное;
			Прервать;
		КонецЕсли;
		
		СловаЗначенияИзТекста = СтрРазделить(ЗначениеИзТекстаВременное, " ");
		КоличествоСлов = СловаЗначенияИзТекста.Количество();
		Если КоличествоСлов > 1 И КоличествоСлов < 4 Тогда
			ЗначениеИзТекста = ЗначениеИзТекстаВременное;
			Прервать;
		КонецЕсли;
		
		Ид = Ид + 1;
		
	КонецЦикла;
	
	Возврат ТРег(ЗначениеИзТекста);
	
КонецФункции

Функция ДатаРожденияИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Дата рождения", Ложь, 25, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакДата(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Родился", Ложь, 25, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакДата(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Родилась", Ложь, 25, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакДата(ЗначениеИзТекста);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
	
КонецФункции

Функция EMailИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	ПравилоПоиска = ПравилоПоискаПоКлючу("", Ложь, 100, Ложь);
	
	Для Ид = 1 По 50 Цикл
		ЗначениеИзТекстаВременное = СтрПолучитьСтроку(ТекстДляРаспознавания, Ид);
		ЗначениеИзТекстаВременное = ЗначениеИзТекстаПоКлючевомуСлову(ЗначениеИзТекстаВременное, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакEmail(ЗначениеИзТекстаВременное);
		Если ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Эл. почта", Ложь, 50, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакEmail(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Email", Ложь, 50, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакEmail(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("E-mail", Ложь, 50, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакEmail(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("E-mail", Ложь, 50, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакEmail(ЗначениеИзТекста);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Функция ТелефонИзТекста(Знач ТекстДляРаспознавания)
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("+7", Истина, 18, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакТелефон(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Телефон", Ложь, 20, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакТелефон(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Контактный номер", Ложь, 20, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакТелефон(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Тел.", Ложь, 20, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = СтрокаКакТелефон(ЗначениеИзТекста);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Функция СтрокаКакТелефон(Знач ЗначениеИзТекста)
	Результат = "";
	
	ДопустимыеСимволы = "+-()0123456789";
	Для НомерСимвола = 1 По СтрДлина(ЗначениеИзТекста) Цикл
		ТекущийСимвол = Сред(ЗначениеИзТекста, НомерСимвола, 1);
		Если Найти(ДопустимыеСимволы, ТекущийСимвол) > 0 Тогда
			Результат = Результат + ТекущийСимвол;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции

Функция АдресИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Проживает:", Ложь, 150, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Город проживания:", Ложь, 150, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Место жительства:", Ложь, 150, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Функция TelegramИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("telegram:", Ложь, 50, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
	
КонецФункции

Функция MaxИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("max:", Ложь, 100, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
	
КонецФункции

Функция МестоРожденияИзТекста(Знач ТекстДляРаспознавания)
	ЗначениеИзТекста = Неопределено;
	Возврат ЗначениеИзТекста;
КонецФункции

Функция ГражданствоИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Гражданство:", Ложь, 15, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
		ЗначениеИзТекста = ГражданствоПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Гражданство :", Ложь, 15, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
		ЗначениеИзТекста = ГражданствоПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Гражданство", Ложь, 15, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
		ЗначениеИзТекста = ГражданствоПоКлассификатору(ЗначениеИзТекста);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста; 
	
КонецФункции

Функция ЗначениеДоРазделителя(Знач ЗначениеИзТекста)
	
	ЧастиЗначения =  СтрРазделить(ЗначениеИзТекста,",.;/" + Символы.ПС + Символы.ВТаб);
	
	Если ЧастиЗначения.Количество() > 0 Тогда
		ЗначениеИзТекста = СокрЛП(ЧастиЗначения[0]);
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
	
КонецФункции

Функция СостояниеВБракеИзТекста(Знач ТекстДляРаспознавания)
	
	ЗначениеИзТекста = Неопределено;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Семейное положение:", Ложь, 25, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		Если ЗначениеИзТекста <> "" Тогда
			ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
			ЗначениеИзТекста = СемейноеПоложениеПоКлассификатору(ЗначениеИзТекста);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Холост", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		Если ЗначениеИзТекста <> "" Тогда
			ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
			ЗначениеИзТекста = СемейноеПоложениеПоКлассификатору(ЗначениеИзТекста);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		ПравилоПоиска = ПравилоПоискаПоКлючу("Замужем", Истина, 0, Ложь);
		ЗначениеИзТекста = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
		Если ЗначениеИзТекста <> "" Тогда
			ЗначениеИзТекста = ЗначениеДоРазделителя(ЗначениеИзТекста);
			ЗначениеИзТекста = СемейноеПоложениеПоКлассификатору(ЗначениеИзТекста);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Функция ОжидаемыйДоходИзТекста(Знач ТекстДляРаспознавания)
	
	ТекстДляРаспознавания = Нрег(Лев(ТекстДляРаспознавания, 1000));
	
	Если Найти(ТекстДляРаспознавания, "usd") <> 0 Тогда
		КлючВалюты = "usd";
		КодВалюты = "840";
	ИначеЕсли Найти(ТекстДляРаспознавания, "eur") <> 0 Тогда
		КлючВалюты = "eur";
		КодВалюты = "978";
	ИначеЕсли Найти(ТекстДляРаспознавания, "₽") <> 0 Тогда
		КлючВалюты = "₽";
		КодВалюты = "643";
	Иначе
		КлючВалюты = "руб.";
		КодВалюты = "643";
	КонецЕсли;
	ПравилоПоиска = ПравилоПоискаПоКлючу(КлючВалюты, Ложь, -15, Ложь);
	Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	Доход = СтрокаКакЧисло(ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска));
	
	Если Не ЗначениеЗаполнено(Валюта) И ПравоДоступа("Добавление", Метаданные.Справочники.Валюты) Тогда
		КодыВалют = Новый Массив();
		КодыВалют.Добавить(КодВалюты);
		Валюта = РаботаСКурсамиВалют.ДобавитьВалютыПоКоду(КодыВалют)[0];
	КонецЕсли;
	
	Возврат Новый Структура("ОжидаемыйДоход,ВалютаДохода", Доход, Валюта);
	
КонецФункции

Функция ПравилоРаспознаванияОпытаРаботы(Знач ФорматРезюме = Неопределено)
	
	СоставБлока = Новый ТаблицаЗначений;
	
	СоставБлока.Колонки.Добавить("ПорядковыйНомер");
	СоставБлока.Колонки.Добавить("Наименование");
	СоставБлока.Колонки.Добавить("ТипДанных");
	СоставБлока.Колонки.Добавить("Обязательный");
	СоставБлока.Колонки.Добавить("БлокРазделитель");
	СоставБлока.Колонки.Добавить("КлючПоиска");
	СоставБлока.Колонки.Добавить("КоличествоСтрок");
	
	Если ФорматРезюме = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		ПолучитьСоставБлокаОпытаРаботыДляHH(СоставБлока);
	ИначеЕсли ФорматРезюме = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		ПолучитьСоставБлокаОпытаРаботыДляSJ(СоставБлока);
	КонецЕсли;
	
	Возврат СоставБлока;
КонецФункции	

Функция ПолПоКлассификатору(Знач ТекстДляОбработки)
	
	Пол = Неопределено;
	
		СоответствиеПола = СписокСоответствийПола();
		ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
		Пол = СоответствиеПола.Получить(НРег(ТекстДляОбработки));
		
	Возврат Пол;
КонецФункции

Функция ГражданствоПоКлассификатору(Знач ТекстДляОбработки)
	
	Если Не ЗначениеЗаполнено(ТекстДляОбработки) Тогда
		Возврат ТекстДляОбработки;
	КонецЕсли;
	
	Гражданство = Справочники.СтраныМира.НайтиПоНаименованию(ТекстДляОбработки);
	Если Не ЗначениеЗаполнено(Гражданство) Тогда
		СоответствиеГражданства = СписокСоответствийГражданства();
		ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
		Гражданство = СоответствиеГражданства.Получить(НРег(ТекстДляОбработки));
	КонецЕсли;
	
	Возврат Гражданство;
	
КонецФункции

Функция СемейноеПоложениеПоКлассификатору(Знач ТекстДляОбработки, Знач ВидРезюме = Неопределено)
	
	СемейноеПоложение = Неопределено;
	
	Если ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		СемейноеПоложение = СемейноеПоложениеПоКлассификатору(ТекстДляОбработки);
	ИначеЕсли ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		СемейноеПоложение = СемейноеПоложениеПоКлассификатору(ТекстДляОбработки);
	Иначе
		СоответствиеСемейногоПоложения = СписокСоответствийСемейноеПоложение();
		ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
		СемейноеПоложение = СоответствиеСемейногоПоложения.Получить(НРег(ТекстДляОбработки));
	КонецЕсли;
		
	Возврат СемейноеПоложение;
	
КонецФункции

Функция МассивСтруктурОпытРаботыИзТекста(Знач ТекстДляРаспознавания, Знач ФорматРезюме = Неопределено)
	
	БазовыйБлок = "";
	ЗначениеИзТекста = "";
	
	Если Не ЗначениеЗаполнено(ЗначениеИзТекста) Тогда
		БазовыйБлок = "Опыт работы";
		КлючОкончанияПоиска = Неопределено;
		Если ФорматРезюме = Справочники.ИсточникиИнформацииОКандидатах.HeadHunter Тогда
			КлючОкончанияПоиска = "Образование";
		КонецЕсли;
		ПравилоПоиска = ПравилоПоискаПоКлючу(БазовыйБлок, Ложь, 0, Истина, Истина, КлючОкончанияПоиска);
		ТекстДляРаспознавания = ЗначениеИзТекстаПоКлючевомуСлову(ТекстДляРаспознавания, ПравилоПоиска);
	КонецЕсли;
	
	СтруктураСоставаБлока = СтруктураСтрокиОпытаРаботы();
	
	СоставБлокаИсточника = ПравилоРаспознаванияОпытаРаботы(ФорматРезюме);
	
	КоличествоСтрок = СтрЧислоСтрок(ТекстДляРаспознавания);
	КоличествоБлоковИсточника = СоставБлокаИсточника.Количество();
	МассивЭлементовБлока = Новый Массив;
	
	Если КоличествоБлоковИсточника > 0 Тогда
		ИдПравила = 0;
		ПервыйБлок = СоставБлокаИсточника[0];
		
		Для Каждого ТекущийБлок Из СоставБлокаИсточника Цикл
			Если ТекущийБлок.Обязательный Тогда
				ПервыйБлок = ТекущийБлок;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Ид = 1 По КоличествоСтрок Цикл
			
			ТекущаяСтрока = СокрЛП(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид));
			ТекущийБлок = СоставБлокаИсточника[ИдПравила]; 
			
			Если ТекущаяСтрока = "" Тогда
				Если ТекущийБлок.КоличествоСтрок > 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Проверяем, закончился ли блок с опытом работы.
			Если СледующийБлокРезюме(ТекущаяСтрока, БазовыйБлок, ФорматРезюме) Тогда
				Если ТекущийБлок <> ПервыйБлок Тогда
					МассивЭлементовБлока.Добавить(СтруктураСоставаБлока);
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
			// Проверяем а не перескочил ли подблок (только для блоков с разделителями).
			Если ТекущаяСтрока <> "" Тогда
				БлокПоСтроке = СоставБлокаИсточника.Найти(ТекущаяСтрока, "КлючПоиска"); 
				Если БлокПоСтроке <> Неопределено И БлокПоСтроке <> ТекущийБлок Тогда
					ИдПравилаНовый = БлокПоСтроке.ПорядковыйНомер-1;
					Если ИдПравилаНовый < ИдПравила Тогда
						МассивЭлементовБлока.Добавить(СтруктураСоставаБлока);
						СтруктураСоставаБлока = СтруктураСтрокиОпытаРаботы();
					КонецЕсли;
					ИдПравила = ИдПравилаНовый;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			// Проверяем, закончился ли подблок с текущей строкой списка блока.
			// Для блоков без разделителей считаем, что все новые блоки начинаются с даты.
			Если ТекущийБлок <> ПервыйБлок И ПервыйБлок.КлючПоиска = "" Тогда
				Если ФорматРезюме <> Справочники.ИсточникиИнформацииОКандидатах.HeadHunter
					ИЛИ (ФорматРезюме = Справочники.ИсточникиИнформацииОКандидатах.HeadHunter
					И СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, " ").Найти("—") = 2) Тогда
					Период = СтрокаКакПериод(ТекущаяСтрока);
					ДатаНачала = Период.ДатаНачала;
					Если ДатаНачала <> Дата(1, 1, 1) Тогда
						МассивЭлементовБлока.Добавить(СтруктураСоставаБлока);
						СтруктураСоставаБлока = СтруктураСтрокиОпытаРаботы();
						ИдПравила = ПервыйБлок.ПорядковыйНомер-1;
						ТекущийБлок = СоставБлокаИсточника[ИдПравила];
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			// Если текущая строка, это заголовок блока, то мы пропускаем такую строку.
			Если ТекущийБлок.КлючПоиска <> "" И СтрНайти(ТекущаяСтрока, ТекущийБлок.КлючПоиска) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеДляОбработки = ТекущаяСтрока;
			
			Для ИдСтрокПодблока = 1 По ТекущийБлок.КоличествоСтрок - 1 Цикл
				Ид = Ид + 1;
				Если Ид <= КоличествоСтрок Тогда
					ТекущаяСтрока = СокрЛП(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид));
					ДанныеДляОбработки = ДанныеДляОбработки + Символы.ПС + ТекущаяСтрока;
				КонецЕсли;
			КонецЦикла;
			
			Если ТекущийБлок.КоличествоСтрок = 1 И ТекущийБлок.БлокРазделитель <> ""  Тогда
				ПозицияРазделителя = СтрНайти(ДанныеДляОбработки, ТекущийБлок.БлокРазделитель);
				Если ПозицияРазделителя > 0 Тогда
					ДанныеДляОбработки = Лев(ДанныеДляОбработки, ПозицияРазделителя - 1);
					ТекстДляРаспознавания = СтрЗаменить(ТекстДляРаспознавания, ДанныеДляОбработки + ТекущийБлок.БлокРазделитель, "");
					ДанныеДляОбработки = СокрЛП(ДанныеДляОбработки);
					Ид = Ид - 1;
				КонецЕсли;
			КонецЕсли;
			
			Если СтруктураСоставаБлока.Свойство(ТекущийБлок.Наименование) Тогда
				Если ТекущийБлок.ТипДанных = "Период" Тогда
					
					Если ФорматРезюме <> Справочники.ИсточникиИнформацииОКандидатах.SuperJob Тогда
						Если Не ЗначениеЗаполнено(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 1)) Тогда
							ДанныеДляОбработки = ДанныеДляОбработки + Символы.НПП + СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 2);
							Ид = Ид + 3;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 2)) Тогда
							ДанныеДляОбработки = ДанныеДляОбработки + Символы.НПП + СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 1);
							Ид = Ид + 1;
						КонецЕсли;
					КонецЕсли;
					
					Период = СтрокаКакПериод(ДанныеДляОбработки);
					СтруктураСоставаБлока.ДатаНачала = Формат(Период.ДатаНачала, "ДФ=yyyy-MM-dd; ДП=' '") ;
					СтруктураСоставаБлока.ДатаОкончания = Формат(Период.ДатаОкончания, "ДФ=yyyy-MM-dd; ДП=' '");
					
				ИначеЕсли ТекущийБлок.ТипДанных = "Дата" Тогда
					
					СтруктураСоставаБлока[ТекущийБлок.Наименование] = СтрокаКакДата(ДанныеДляОбработки);
					
				ИначеЕсли ТекущийБлок.ТипДанных = "ПроизвольнаяСтрока" Тогда
					
					СтруктураСоставаБлока[ТекущийБлок.Наименование] = СокрЛП("" + СтруктураСоставаБлока[ТекущийБлок.Наименование] 
																				+ ?(СтруктураСоставаБлока[ТекущийБлок.Наименование] = Неопределено, "", Символы.ПС )
																				+ ДанныеДляОбработки);
					Если ФорматРезюме = Справочники.ИсточникиИнформацииОКандидатах.HeadHunter
						 И ТекущийБлок.Наименование = "СфераДеятельностиКомпании" Тогда
						СтрокиНаПроверку = СокрЛП(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 1))
										 + СокрЛП(СтрПолучитьСтроку(ТекстДляРаспознавания, Ид + 2));
						Если СтрНайти(СтрокиНаПроверку, "•") = 0 Тогда
							ИдПравила = ИдПравила + 1;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущийБлок.КоличествоСтрок > 0 Тогда
				ИдПравила = ИдПравила + 1;
			КонецЕсли;
			
			// Последний блок может состоять из произвольного количества строчек, и он будет сброшен, только признаком начала
			// нового блока или подблока В противном случае переходим к первому блоку.
			Если ИдПравила >= КоличествоБлоковИсточника Тогда
				Если ТекущийБлок.КоличествоСтрок = 0 Тогда
					ИдПравила = ИдПравила - 1;
				Иначе
					МассивЭлементовБлока.Добавить(СтруктураСоставаБлока);
					СтруктураСоставаБлока = СтруктураСтрокиОпытаРаботы();
					ИдПравила = ПервыйБлок.ПорядковыйНомер - 1;
				КонецЕсли;
			ИначеЕсли Ид = КоличествоСтрок Тогда
				МассивЭлементовБлока.Добавить(СтруктураСоставаБлока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивЭлементовБлока;
КонецФункции

Функция СтрокаКакДата(Знач ИсходнаяСтрока)
	
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"г.","");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"года","");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"год","");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,Символы.НПП,".");
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,Символы.ПС," ");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока," ",".");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,",",".");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"/",".");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"-",".");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока,"..",".");
	ЧастиСтроки = СтрРазделить(ИсходнаяСтрока,".");
	
	ДеньМесяца = 0;
	НомерМесяца = 0;
	Год = 0;
	
	КоличествоЧастейСтроки = ЧастиСтроки.Количество();
	Если КоличествоЧастейСтроки = 1 Тогда
		Если ТолькоЦифрыВСтроке(ЧастиСтроки[0]) Тогда  
	 		Год = Число(ЧастиСтроки[0]); 
			Если Год <= 1900 Тогда 
				Год = 0;
			КонецЕсли;
		Иначе
			НомерМесяца = НомерМесяцаПоНаименованиюМесяца(ЧастиСтроки[0]);
			Если НомерМесяца <> 0 Тогда
				Год = Год(ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли КоличествоЧастейСтроки = 2 Тогда
		
		ТекЧасть = ЧастиСтроки[1];
		
		Если СтрДлина(ТекЧасть) > 4 Тогда
			ТекЧасть = Лев(ТекЧасть, 4);
		КонецЕсли;
		
		Если ТолькоЦифрыВСтроке(ТекЧасть) Тогда 
	 		Год = Число(ТекЧасть); 
			Если Год <= 12 Тогда 
				НомерМесяца = Год;
				Год = Год(ТекущаяДатаСеанса());
			КонецЕсли;
		Иначе
			НомерМесяца = НомерМесяцаПоНаименованиюМесяца(ЧастиСтроки[1]);
			Если НомерМесяца <> 0 Тогда
				Год = Год(ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
		
		Если НомерМесяца > 0 Тогда
			Если ТолькоЦифрыВСтроке(ЧастиСтроки[0]) Тогда 
				ДеньМесяца = Число(ЧастиСтроки[0]); 
			Иначе
				ДеньМесяца = 1;
			КонецЕсли;
		Иначе
			Если ТолькоЦифрыВСтроке(ЧастиСтроки[0]) Тогда 
				НомерМесяца = Число(ЧастиСтроки[0]); 
			Иначе
				НомерМесяца = НомерМесяцаПоНаименованиюМесяца(ЧастиСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если (ДеньМесяца = 0 И Год = 0) ИЛИ  НомерМесяца = 0 Тогда
			ДеньМесяца = 0;
			НомерМесяца = 0;
			Год = 0;
		КонецЕсли;
		
	ИначеЕсли КоличествоЧастейСтроки > 2 Тогда
		Для Каждого ТекЧасть Из ЧастиСтроки Цикл
			Если ДеньМесяца = 0 Тогда
				Если ТолькоЦифрыВСтроке(ТекЧасть) Тогда 
					ДеньМесяца = Число(ТекЧасть); 
				Иначе
					НомерМесяца = НомерМесяцаПоНаименованиюМесяца(ТекЧасть);
					ДеньМесяца = 1;
				КонецЕсли;
			ИначеЕсли НомерМесяца = 0 Тогда
				Если ТолькоЦифрыВСтроке(ТекЧасть) Тогда 
					НомерМесяца = Число(ТекЧасть); 
				Иначе
					НомерМесяца = НомерМесяцаПоНаименованиюМесяца(ТекЧасть);
				КонецЕсли;
			Иначе
				Если СтрДлина(ТекЧасть) > 4 Тогда
					ТекЧасть = Лев(ТекЧасть, 4);
				КонецЕсли;
				
				Если ТолькоЦифрыВСтроке(ТекЧасть) Тогда 
					Год = Число(ТекЧасть); 
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ДеньМесяца = 0 ИЛИ НомерМесяца = 0 ИЛИ Год = 0 Тогда
			ДеньМесяца = 0;
			НомерМесяца = 0;
			Год = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если ДеньМесяца = 0 Тогда
		ДеньМесяца = 1;
	КонецЕсли;
	
	Если Год = 0 Тогда
		Год = ДеньМесяца;
		ДеньМесяца = 1;
	ИначеЕсли Год > 3000 Тогда
		Год = 1;
	ИначеЕсли Год < 100 Тогда
		Год = 2000 + Год;
	КонецЕсли;
	
	Если НомерМесяца = 0 
		ИЛИ НомерМесяца > 12 Тогда
		НомерМесяца = 1;
	КонецЕсли;
	
	ДатаМесяца = Дата(Год, НомерМесяца, 1);
	
	Если День(КонецМесяца(ДатаМесяца)) < ДеньМесяца Тогда
		ДеньМесяца = 1;
	КонецЕсли;
	
	Возврат Дата(Год, НомерМесяца, ДеньМесяца);
	
КонецФункции

Функция НомерМесяцаПоНаименованиюМесяца(Знач СтрокаМесяца)
	
	МассивМесяцев = МассивМесяцев();
	ИскомыйМесяц = 0;
	НомерМесяца = 0;
	
	Для Каждого ТекЭлемент Из МассивМесяцев Цикл
		
		НомерМесяца = НомерМесяца + 1;
		
		СписокКлючейПоиска = СтрРазделить(ТекЭлемент,",");
		
		Для Каждого КлючПоиска Из СписокКлючейПоиска Цикл
			НачПоз = Найти(НРег(СтрокаМесяца), КлючПоиска);
			Если НачПоз > 0  Тогда
				ИскомыйМесяц = НомерМесяца;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ИскомыйМесяц;
	
КонецФункции

Функция МассивМесяцев()
	
	МассивМесяцев = Новый Массив;
	МассивМесяцев.Добавить("янв");
	МассивМесяцев.Добавить("фев");
	МассивМесяцев.Добавить("мар");
	МассивМесяцев.Добавить("апр");
	МассивМесяцев.Добавить("май,мая");
	МассивМесяцев.Добавить("июн");
	МассивМесяцев.Добавить("июл");
	МассивМесяцев.Добавить("авг");
	МассивМесяцев.Добавить("сен");
	МассивМесяцев.Добавить("окт");
	МассивМесяцев.Добавить("ноя");
	МассивМесяцев.Добавить("дек");
	
	Возврат МассивМесяцев;
КонецФункции

Функция ТолькоЦифрыВСтроке(ПроверяемаяСтрока)
	
	Если ТипЗнч(ПроверяемаяСтрока) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (Не ПустаяСтрока(ПроверяемаяСтрока)) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ПроверяемаяСтрока);
	
КонецФункции

Функция СтрокаКакEmail(Знач ТекстДляРаспознавания)
	ЗначениеИзТекста = Неопределено;
	
	ТекстДляРаспознавания = СтрЗаменить(ТекстДляРаспознавания, Символы.ПС, " ");
	ТекстДляРаспознавания = СтрЗаменить(ТекстДляРаспознавания, "  ", " ");
	ЧастиТекста = СтрРазделить(ТекстДляРаспознавания, " ");
	
	КлючПоиска = "@";
	
	Для Каждого ТекущаяЧасть Из ЧастиТекста Цикл
		
		ПозНач = СтрНайти(ТекущаяЧасть, КлючПоиска);
		Если ПозНач > 0 Тогда
			ЗначениеИзТекста = СокрЛП(ТекущаяЧасть);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначениеИзТекста;
КонецФункции

Процедура ПолучитьСоставБлокаОпытаРаботыДляHH(СоставБлока)
	
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 1, "Период", 						"Период",				Истина, "", 1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 2, "ПериодТекст", 					"ПроизвольнаяСтрока",	Истина, "", 1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 3, "Компания",						"ПроизвольнаяСтрока",	Истина, "", 1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 4, "СайтКомпании",					"ПроизвольнаяСтрока",	Истина, "", 1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 5, "СфераДеятельностиКомпании", 	"ПроизвольнаяСтрока",	Истина, "", 0);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 6, "Должность", 					"ПроизвольнаяСтрока",	Истина, "", 1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 7, "Обязанности", 					"ПроизвольнаяСтрока",	Истина, "", 0);
	
КонецПроцедуры

Процедура ПолучитьСоставБлокаОпытаРаботыДляSJ(СоставБлока)
	
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 1, "Период", 						"Период",				Истина,	 "Период работы",	 						1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 2, "Должность", 					"ПроизвольнаяСтрока",	Ложь,	 "Должность", 								1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 3, "Компания",						"ПроизвольнаяСтрока",	Ложь,	 "В организации", 							1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 4, "СайтКомпании",					"ПроизвольнаяСтрока",	Ложь,	 "Сайт компании", 							1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 5, "СфераДеятельностиКомпании", 	"ПроизвольнаяСтрока",	Ложь,	 "Деятельность компании", 					1);
	ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, 6, "Обязанности", 					"ПроизвольнаяСтрока",	Ложь,	 "Должностные обязанности и достижения", 	0);
	
КонецПроцедуры
 
Функция СписокСоответствийПола()
	
	СоответствиеКлассификаторов = Новый Соответствие(); 
	
	СоответствиеКлассификаторов.Вставить("мужчина",
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПолФизическогоЛица.Мужской"));
	СоответствиеКлассификаторов.Вставить("мужской",
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПолФизическогоЛица.Мужской"));
	
	СоответствиеКлассификаторов.Вставить("женщина",
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПолФизическогоЛица.Женский"));
	СоответствиеКлассификаторов.Вставить("женский",
		ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.ПолФизическогоЛица.Женский"));
	
	Возврат СоответствиеКлассификаторов;
	
КонецФункции

Функция СписокСоответствийГражданства()
	СоответствиеКлассификаторов = Новый Соответствие(); 
	
	СоответствиеКлассификаторов.Вставить("рф", Справочники.СтраныМира.Россия);
	СоответствиеКлассификаторов.Вставить("россия", Справочники.СтраныМира.Россия);
	СоответствиеКлассификаторов.Вставить("русский", Справочники.СтраныМира.Россия);
	СоответствиеКлассификаторов.Вставить("беларусь", Справочники.СтраныМира.НайтиПоКоду(112));
	СоответствиеКлассификаторов.Вставить("беларус", Справочники.СтраныМира.НайтиПоКоду(112));
	
	Возврат СоответствиеКлассификаторов;
	
КонецФункции

Функция СтруктураСтрокиОпытаРаботы()
	
	СтруктураСтрокиОпытаРаботы = Справочники.ЛичныеДанныеКандидатов.НовыйОпытРаботы();
	
	Возврат СтруктураСтрокиОпытаРаботы;
	
КонецФункции

Функция СледующийБлокРезюме(Знач ТекстДляОбработки, Знач ТекущийЭтап, Знач ФорматРезюме)
	
	Результат = Ложь;
	
	ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
	Если ФорматРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		СтрокаНазванийБлоков = "Желаемая должность и зарплатаОпыт работыОбразованиеКлючевые навыкиДополнительная информацияПовышение квалификации, курсыТесты, экзаменыЭлектронные сертификатыКлючевые навыкиЗнание языковНавыкиРекомендацииОбо мне";
	ИначеЕсли ФорматРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		СтрокаНазванийБлоков = "Курсы и тренингиОпыт работыОбразованиеИностранные языкиДополнительная информацияКлючевые навыки и достиженияДополнительные сведения";
	Иначе
		СтрокаНазванийБлоков = "Желаемая должность и зарплатаОпыт работыОбразованиеКлючевые навыкиДополнительная информацияПовышение квалификации, курсыТесты, экзаменыЭлектронные сертификатыКлючевые навыкиЗнание языковНавыкиРекомендацииОбо мне";
	КонецЕсли;
	
	СтрокаНазванийБлоковБезТекущего = СтрЗаменить(СтрокаНазванийБлоков, ТекущийЭтап, "");
	Если ТекстДляОбработки <> "" И СтрНайти(СтрокаНазванийБлоковБезТекущего, ТекстДляОбработки) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаКакПериод(Знач ТекстДляОбработки)
	
	Период = Новый Структура("ДатаНачала, ДатаОкончания");
	
	ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки, "С ", ""); 
	
	ПозНач = СтрНайти(ТекстДляОбработки, "год");
	Если ПозНач > 0 Тогда
		ТекстДляОбработки = СокрЛП(Лев(ТекстДляОбработки, ПозНач-1));
	КонецЕсли;
	
	ПозНач = СтрНайти(ТекстДляОбработки, "(");
	Если ПозНач > 0 Тогда
		ТекстДляОбработки = СокрЛП(Лев(ТекстДляОбработки, ПозНач-1));
	КонецЕсли;
	
	ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки,"–", "-");
	ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки,"—", "-");
	ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки,"по", "-");
	ТекстДляОбработки = СтрЗаменить(ТекстДляОбработки,Символы.ПС, "-");
	
	ЧастиПериода = СтрРазделить(ТекстДляОбработки,"-");  
	
	Если ЧастиПериода.Количество() > 1 Тогда
		Период.ДатаНачала = СтрокаКакДата(ЧастиПериода[0]);
		Период.ДатаОкончания = СтрокаКакДата(ЧастиПериода[1]);
	Иначе
		Период.ДатаНачала = СтрокаКакДата(ТекстДляОбработки);
		Период.ДатаОкончания = Дата(1,1,1);
	КонецЕсли;
	
	Возврат Период;
КонецФункции

Процедура ДобавитьСтрокуБлокаОпытаРаботы(СоставБлока, Знач ПорядковыйНомер, Знач Наименование, Знач ТипДанных, Знач Обязательный, Знач КлючПоиска, Знач КоличествоСтрок)
	
	ПодБлок = СоставБлока.Добавить();
	ПодБлок.ПорядковыйНомер = ПорядковыйНомер;
	ПодБлок.Наименование = Наименование;
	ПодБлок.ТипДанных = ТипДанных;
	ПодБлок.Обязательный = Обязательный;
	ПодБлок.БлокРазделитель = "";
	ПодБлок.КлючПоиска = КлючПоиска;
	ПодБлок.КоличествоСтрок = КоличествоСтрок;
	
КонецПроцедуры

Функция МассивСтруктурОбразованиеИзТекста(Знач ТекстДляРаспознаванияИсходный, Знач ФорматРезюме = Неопределено)
	
	ТекущийБлок = "Образование";
	ПозНач = СтрНайти(ТекстДляРаспознаванияИсходный, ТекущийБлок);
	ТекстДляРаспознавания = "";
	ФорматHeadHunter = Справочники.ИсточникиИнформацииОКандидатах.HeadHunter;
	
	Пока ПозНач > 0 Цикл
		ПозКон = СтрНайти(ТекстДляРаспознаванияИсходный, Символы.ПС,, ПозНач);
		Если ПозКон = 0 Тогда // Если в строке нет переноса строки, то берем весь оставшийся текст после текущего блока.
			ТекстДляРаспознавания = СокрЛП(Сред(ТекстДляРаспознаванияИсходный, ПозНач + СтрДлина(ТекущийБлок)));
			Прервать;
		ИначеЕсли СтрДлина(ТекущийБлок) <> (ПозКон-ПозНач) Тогда
			ПозНач = СтрНайти(ТекстДляРаспознаванияИсходный, ТекущийБлок,,ПозКон);
		Иначе
			ТекстДляРаспознавания = Сред(ТекстДляРаспознаванияИсходный, ПозКон + 1);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ФорматРезюме = ФорматHeadHunter Тогда
		РезультатПоиска = СтрНайтиПоРегулярномуВыражению(ТекстДляРаспознавания, "\b(19|20)\d{2}\b");
		Если ЗначениеЗаполнено(РезультатПоиска.НачальнаяПозиция) Тогда
			ТекстДляРаспознавания = Прав(ТекстДляРаспознавания,
				СтрДлина(ТекстДляРаспознавания) - РезультатПоиска.НачальнаяПозиция + 1);
		КонецЕсли;
		
		СледующиеБлоки = Новый Массив;
		СледующиеБлоки.Добавить("Повышение квалификации, курсы");
		СледующиеБлоки.Добавить("Электронные сертификаты");
		СледующиеБлоки.Добавить("Навыки");
		СледующиеБлоки.Добавить("Дополнительная информация");
		
		Для Каждого СледующийБлок Из СледующиеБлоки Цикл
			ПозицияСледующегоБлока = СтрНайти(ТекстДляРаспознавания, СледующийБлок);
			Если ПозицияСледующегоБлока > 0 Тогда
				ТекстДляРаспознавания = Лев(ТекстДляРаспознавания, ПозицияСледующегоБлока - 1);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Правила = ПравилоРаспознаванияОбразование(ФорматРезюме);
	КоличествоСтрок = СтрЧислоСтрок(ТекстДляРаспознавания);
	КоличествоПравил = Правила.Количество() - 1;
	ОбразованиеМассив = Новый Массив;
	СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
	
	Если КоличествоПравил > 0 Тогда
		ИдПравила = 1;
		Для Ид = 1 По КоличествоСтрок Цикл
			
			ТекущаяСтрокаПравила = Правила[ИдПравила]; 
			ТекущаяСтрока = СтрПолучитьСтроку(ТекстДляРаспознавания, Ид);
			ТекущаяСтрока = СокрЛП(ТекущаяСтрока);
			
			Если СледующийБлокРезюме(ТекущаяСтрока, "Образование", ФорматРезюме) Тогда
				Если ТекущаяСтрокаПравила = "Конец" Тогда
					ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
					СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
			Если ТекущаяСтрока = "" Тогда
				Если ТекущаяСтрокаПравила = "Конец" Тогда
					ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
					СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
					ИдПравила = 1;
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			
			Если ТекущаяСтрокаПравила <> "УчебноеЗаведение" Тогда
				Если СтрНайти(ТекущаяСтрока, "Учебное заведение:") Тогда
					ИдПравилаНовый = Правила.Найти("УчебноеЗаведение") ;
					Если ИдПравилаНовый < ИдПравила Тогда
						ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
						СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
					КонецЕсли;
					ИдПравила = ИдПравилаНовый;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрокаПравила <> "ВидОбразования" Тогда
				Если СтрНайти(ТекущаяСтрока, "Уровень образования:") Тогда
					ИдПравилаНовый = Правила.Найти("ВидОбразования") ;
					Если ИдПравилаНовый < ИдПравила Тогда
						ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
						СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
					КонецЕсли;
					ИдПравила = ИдПравилаНовый;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрокаПравила <> "Специальность" Тогда
				Если СтрНайти(ТекущаяСтрока, "Специальность:") Тогда
					ИдПравилаНовый = Правила.Найти("Специальность") ;
					Если ИдПравилаНовый < ИдПравила Тогда
						ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
						СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
					КонецЕсли;
					ИдПравила = ИдПравилаНовый;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрокаПравила <> "Окончание" Тогда
				Если СтрНайти(ТекущаяСтрока, "Дата  окончания:") Тогда
					ИдПравилаНовый = Правила.Найти("Окончание") ;
					Если ИдПравилаНовый < ИдПравила Тогда
						ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
						СтруктураСтрокиОбразование = СтруктураСтрокиОбразование();
					КонецЕсли;
					ИдПравила = ИдПравилаНовый;
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрокаПравила = "ВидОбразования" Тогда
				Если СтрНайти(ТекущаяСтрока, "Уровень образования:") Тогда
					Продолжить;
				КонецЕсли;
				СтруктураСтрокиОбразование.ВидОбразования =
					СокрЛП(ВидОбразованияПоКлассификатору(ТекущаяСтрока, ФорматРезюме));
			ИначеЕсли ТекущаяСтрокаПравила = "Окончание" Тогда
				Если СтрНайти(ТекущаяСтрока, "Дата окончания:") Тогда
					Продолжить;
				КонецЕсли;
				СтруктураСтрокиОбразование.Окончание = Год(СтрокаКакДата(ТекущаяСтрока));
			ИначеЕсли ТекущаяСтрокаПравила = "УчебноеЗаведение" Тогда
				Если СтрНайти(ТекущаяСтрока, "Учебное заведение:") Тогда
					Продолжить;
				КонецЕсли;
				СтруктураСтрокиОбразование.УчебноеЗаведение = ТекущаяСтрока;
			ИначеЕсли ТекущаяСтрокаПравила = "Специальность" Тогда
				Если СтрНайти(ТекущаяСтрока, "Специальность:") Тогда
					Продолжить;
				КонецЕсли;
				СтруктураСтрокиОбразование.Специальность = ТекущаяСтрока;
			ИначеЕсли ТекущаяСтрокаПравила = "Факультет" Тогда
				Если СтрНайти(ТекущаяСтрока, "Факультет:") Тогда
					Продолжить;
				КонецЕсли;
				Если ФорматРезюме = ФорматHeadHunter Тогда
					ФакультетСпециальность = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущаяСтрока, ", ");
					КоличествоФакультетСпециальность = ФакультетСпециальность.Количество();
					Если КоличествоФакультетСпециальность > 1 Тогда
						СтруктураСтрокиОбразование.Факультет = ФакультетСпециальность[0];
						СтруктураСтрокиОбразование.Специальность = ФакультетСпециальность[КоличествоФакультетСпециальность - 1];
					ИначеЕсли КоличествоФакультетСпециальность = 1 Тогда
						СтруктураСтрокиОбразование.Специальность = ФакультетСпециальность[0];
					КонецЕсли;
					ИдПравила = ИдПравила + 1;
				КонецЕсли;
			ИначеЕсли ТекущаяСтрокаПравила = "ФормаОбучения" Тогда
				Если СтрНайти(ТекущаяСтрока, "Форма обучения:") Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли ТекущаяСтрокаПравила = "Конец" Тогда
				ОбразованиеМассив.Добавить(СтруктураСтрокиОбразование);
			КонецЕсли;
			
			ИдПравила = ИдПравила + 1;
			Если ИдПравила > КоличествоПравил Тогда
				ИдПравила = 1;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОбразованиеМассив;
	
КонецФункции

Функция ПравилоРаспознаванияОбразование(Знач ВидРезюме = Неопределено)
	
	Если ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		Правило = ПравилоРаспознаванияОбразованиеHH();
	ИначеЕсли ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		Правило = ПравилоРаспознаванияОбразованиеSJ();
	Иначе
		Правило = Новый Массив();
	КонецЕсли;
	
	Возврат Правило;
	
КонецФункции

Функция ПравилоРаспознаванияОбразованиеHH()
	Правило = Новый Массив;
	
	Правило.Добавить("Начало");
	Правило.Добавить("Окончание");
	Правило.Добавить("ВидОбразования");
	Правило.Добавить("УчебноеЗаведение");
	Правило.Добавить("Факультет");
	Правило.Добавить("Специальность");
	Правило.Добавить("Конец");
	
	Возврат Правило;
КонецФункции

Функция ПравилоРаспознаванияОбразованиеSJ()
	Правило = Новый Массив;
	
	Правило.Добавить("Начало");
	Правило.Добавить("УчебноеЗаведение");
	Правило.Добавить("Окончание");
	Правило.Добавить("ВидОбразования");
	Правило.Добавить("Факультет");
	Правило.Добавить("Специальность");
	Правило.Добавить("ФормаОбучения");
	Правило.Добавить("Конец");
	
	Возврат Правило;
КонецФункции

Функция СтруктураСтрокиОбразование()
	СтруктураСтрокиОбразование = Новый Структура();
	
	СтруктураСтрокиОбразование.Вставить("ВидОбразования");
	СтруктураСтрокиОбразование.Вставить("Окончание");
	СтруктураСтрокиОбразование.Вставить("УчебноеЗаведение");
	СтруктураСтрокиОбразование.Вставить("Специальность"); 
	СтруктураСтрокиОбразование.Вставить("Факультет"); 
	                            
	Возврат СтруктураСтрокиОбразование;
	
КонецФункции

Функция СтруктураСтрокиЗнаниеЯзыков()
	
	СтруктураСтрокиЗнаниеЯзыков = Справочники.ЛичныеДанныеКандидатов.НовоеЗнаниеЯзыка();
	СтруктураСтрокиЗнаниеЯзыков.Вставить("Содержание");
	
	Возврат СтруктураСтрокиЗнаниеЯзыков;
	
КонецФункции

Функция ВидОбразованияПоКлассификатору(Знач ТекстДляОбработки, Знач ВидРезюме = Неопределено)
	
	ВидОбразования = Неопределено;
	
	Если ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		ВидОбразования = ВидОбразованияПоКлассификаторуHH(ТекстДляОбработки);
	ИначеЕсли ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		ВидОбразования = ВидОбразованияПоКлассификаторуSJ(ТекстДляОбработки);
	КонецЕсли;
	
	Возврат ВидОбразования;
	
КонецФункции

Функция ВидОбразованияПоКлассификаторуHH(Знач ТекстДляОбработки)
	
	СоответствиеВидовОбразования = СписокСоответствийВидовОбразованияHH();
	ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
	ВидОбразования = СоответствиеВидовОбразования.Получить(ТекстДляОбработки);
	
	Возврат ВидОбразования;
КонецФункции

Функция ВидОбразованияПоКлассификаторуSJ(Знач ТекстДляОбработки)
	
	СоответствиеВидовОбразования = СписокСоответствийВидовОбразованияSJ();
	ТекстДляОбработки = СокрЛП(ТекстДляОбработки);
	ВидОбразования = СоответствиеВидовОбразования.Получить(ТекстДляОбработки);
	
	Возврат ВидОбразования;
КонецФункции

Функция СписокСоответствийВидовОбразованияHH()
	
	СоответствиеВидовОбразованияHH = Новый Соответствие(); 
	СоответствиеВидовОбразованияHH.Вставить("Высшее", 				ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Бакалавр", 			ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат"));
	СоответствиеВидовОбразованияHH.Вставить("Магистр", 				ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура"));
	СоответствиеВидовОбразованияHH.Вставить("Кандидат наук", 		ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура"));
	СоответствиеВидовОбразованияHH.Вставить("Доктор наук", 			ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.Докторантура"));
	СоответствиеВидовОбразованияHH.Вставить("Неоконченное высшее", 	ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Среднее специальное", 	ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Среднее", 				ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование"));
	
	Возврат СоответствиеВидовОбразованияHH;
	
КонецФункции

Функция СписокСоответствийВидовОбразованияSJ()
	
	СоответствиеВидовОбразованияHH = Новый Соответствие(); 
	СоответствиеВидовОбразованияHH.Вставить("Высшее", 					ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Высшее (бакалавр)", 		ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат"));
	СоответствиеВидовОбразованияHH.Вставить("Высшее (магистр)", 		ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура"));
	СоответствиеВидовОбразованияHH.Вставить("Высшее (кандидат наук)", 	ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура"));
	СоответствиеВидовОбразованияHH.Вставить("Высшее (доктор наук)", 	ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.Докторантура"));
	СоответствиеВидовОбразованияHH.Вставить("Неполное высшее", 			ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Среднее специальное", 		ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Среднее", 					ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.СреднееОбщееОбразование"));
	СоответствиеВидовОбразованияHH.Вставить("Учащийся школы", 			ПредопределенноеЗначение("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка"));
	
	Возврат СоответствиеВидовОбразованияHH;
	
КонецФункции

Функция МассивСтруктурЗнаниеЯзыковИзТекста(Знач ТекстДляРаспознаванияИсходный, Знач ФорматРезюме = Неопределено)
	
	ТекущийБлок = НазваниеТекущегоБлокаПоФорматуРезюме("ЗнаниеЯзыков", ФорматРезюме);
	
	ПозНач = СтрНайти(ТекстДляРаспознаванияИсходный, ТекущийБлок);
	
	Если ПозНач > 0 Тогда
		ПозКон = СтрНайти(ТекстДляРаспознаванияИсходный, Символы.ПС,, ПозНач);
		
		Если ПозКон = 0 Тогда // Если в строке нет переноса строки, то берем весь оставшийся текст после текущего блока.
			ТекстДляРаспознавания = СокрЛП(Сред(ТекстДляРаспознаванияИсходный, ПозНач + СтрДлина(ТекущийБлок)));
		Иначе
			ТекстДляРаспознавания = Сред(ТекстДляРаспознаванияИсходный, ПозКон + 1);
		КонецЕсли;
	Иначе
		ТекстДляРаспознавания = "";
	КонецЕсли;
	
	КоличествоСтрок = СтрЧислоСтрок(ТекстДляРаспознавания);
	ЗнаниеЯзыковМассив = Новый Массив;
	
	Для Ид = 1 По КоличествоСтрок Цикл
		
		ТекущаяСтрока = СтрПолучитьСтроку(ТекстДляРаспознавания, Ид);
		ТекущаяСтрока = СокрЛП(ТекущаяСтрока);
		
		Если СледующийБлокРезюме(ТекущаяСтрока, ТекущийБлок, ФорматРезюме) Тогда
			Прервать;
		КонецЕсли;
		
		Если ТекущаяСтрока = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока,"—", "-");
		
		Если ФорматРезюме <> ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob")
			И СтрНайти(ТекущаяСтрока, "-") = 0 Тогда
				Продолжить;
		Иначе
			ТекущаяСтрока = СтрЗаменить(ТекущаяСтрока,":", "-");
		КонецЕсли;
		
		Если СтрЗаканчиваетсяНа(ТекущаяСтрока, "-") Тогда
			Ид = Ид + 1;
			Если Ид <= КоличествоСтрок Тогда 
				ТекущаяСтрока = ТекущаяСтрока + СтрПолучитьСтроку(ТекстДляРаспознавания, Ид)
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ЧастиЗнанияЯзыков = СтрРазделить(ТекущаяСтрока, "-");
		СтруктураСтрокиЗнаниеЯзыков = СтруктураСтрокиЗнаниеЯзыков();
		Если ЧастиЗнанияЯзыков.Количество() > 1 Тогда
			СтруктураСтрокиЗнаниеЯзыков.Язык = Справочники.ЯзыкиНародовМира.НайтиПоНаименованию(СокрЛП(ЧастиЗнанияЯзыков[0]));
			СтруктураСтрокиЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата = СтепеньЗнанияЯзыка(ЧастиЗнанияЯзыков[1]);
			СтруктураСтрокиЗнаниеЯзыков.Содержание = ТекущаяСтрока;
			ЗнаниеЯзыковМассив.Добавить(СтруктураСтрокиЗнаниеЯзыков);
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	ДозаполнитьМассивСтруктурЗнаниеЯзыков(ЗнаниеЯзыковМассив);
	
	Возврат ЗнаниеЯзыковМассив;
	
КонецФункции

Процедура ДозаполнитьМассивСтруктурЗнаниеЯзыков(МассивЯзыков)
	
	Для Каждого Язык Из МассивЯзыков Цикл
		
		Позиция = СтрНайти(Язык.Язык, "язык");
		Если Позиция <> 0 Тогда
			Язык.Язык = Сред(Язык.Язык, 1, Позиция - 2);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Язык.СтепеньЗнанияЯзыкаКандидата) Тогда
			Язык.СтепеньЗнанияЯзыкаКандидата = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
				Перечисления.УровниВладенияЯзыком.A1);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НазваниеТекущегоБлокаПоФорматуРезюме(Знач ТипБлока, Знач ВидРезюме)
	
	НазваниеТекущегоБлока = "";
	
	Если ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		Если ТипБлока = "ЗнаниеЯзыков" Тогда
			НазваниеТекущегоБлока = "Знание языков";
		КонецЕсли;
	ИначеЕсли ВидРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		Если ТипБлока = "ЗнаниеЯзыков" Тогда
			НазваниеТекущегоБлока = "Иностранные языки";
		КонецЕсли; 
	Иначе
	
	КонецЕсли;
	
	Возврат НазваниеТекущегоБлока;
	
КонецФункции

Функция СтепеньЗнанияЯзыка(Знач СтепеньЗнанияСтрока)
	
	Результат = Неопределено;
	СтепеньЗнанияСтрока = СокрЛП(СтепеньЗнанияСтрока);
	СтепеньЗнанияСтрока = НРег(СтепеньЗнанияСтрока);
	
	Если СтрНайти("a1а1", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.A1);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти("a2а2", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.A2);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти("b1", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.B1);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти("b2", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.B2);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти("c1с1", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.C1);
		Возврат Результат;
	КонецЕсли;
	
	Если СтрНайти("c2с2родной", СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.C2);
		Возврат Результат;
	КонецЕсли;
	
	СтрокаДляПоиска = "базовыйбазовыйбазовые знаниячитаю профессиональную литературутехнический";
	
	Если СтрНайти(СтрокаДляПоиска, СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.A2);
		Возврат Результат;
	КонецЕсли;
	
	СтрокаДляПоиска = "intermediateсреднийразговорныймогу проходить интервью";
	
	Если СтрНайти(СтрокаДляПоиска, СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.B2);
		Возврат Результат;
	КонецЕсли;
	
	СтрокаДляПоиска = "fluencyсвободно владею"; //АПК:216,1297
	
	Если СтрНайти(СтрокаДляПоиска,СтепеньЗнанияСтрока) Тогда
		Результат = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			Перечисления.УровниВладенияЯзыком.C2);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрочееИзТекста(Знач ТекстДляРаспознавания, Знач ФорматРезюме = Неопределено)
	БлокиПрочее = СписокБлоковПрочее(ФорматРезюме);
	Прочее = "";
	
	Для Каждого ТекущийБлок Из БлокиПрочее Цикл
		ПозНач = СтрНайти(ТекстДляРаспознавания, ТекущийБлок);
		Если ПозНач > 0 Тогда
			ПозКон = СтрНайти(ТекстДляРаспознавания, Символы.ПС,, ПозНач);
			
			Если ПозКон = 0 Тогда // Если в строке нет переноса строки, то берем весь оставшийся текст после текущего блока.
				ЗначениеСтроки = ТекущийБлок;
			Иначе
				ЗначениеСтроки = Сред(ТекстДляРаспознавания, ПозНач, ПозКон-ПозНач);
			КонецЕсли;
			
			ЗначениеСтроки = СокрЛП(СтрЗаменить(ЗначениеСтроки, ":", ""));
			ЗначениеСтроки = СокрЛП(СтрЗаменить(ЗначениеСтроки, ";", ""));
			
			Если СтрДлина(ТекущийБлок) <> СтрДлина(ЗначениеСтроки) Тогда
				ТекстДляРаспознаванияИзмененный = "";
			Иначе
				ТекстДляРаспознаванияИзмененный = Сред(ТекстДляРаспознавания, ПозНач);
			КонецЕсли;
		Иначе
			ТекстДляРаспознаванияИзмененный = "";
		КонецЕсли;
		
		КоличествоСтрок = СтрЧислоСтрок(ТекстДляРаспознаванияИзмененный);
		
		Для Ид = 1 По КоличествоСтрок Цикл
			
			ТекущаяСтрока = СтрПолучитьСтроку(ТекстДляРаспознаванияИзмененный, Ид);
			
			Если СледующийБлокРезюме(ТекущаяСтрока, ТекущийБлок, ФорматРезюме) Тогда
				Прервать;
			КонецЕсли;
			
			Прочее = Прочее + ТекущаяСтрока + Символы.ПС;
			
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат	Прочее;
	
КонецФункции

Функция СписокБлоковПрочее(Знач ФорматРезюме)
	
	МассивБлоковПрочего = Новый Массив();
	
	Если ФорматРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter") Тогда
		МассивБлоковПрочего.Добавить("Навыки");
		МассивБлоковПрочего.Добавить("Рекомендации");
		МассивБлоковПрочего.Добавить("Обо мне");
	ИначеЕсли ФорматРезюме = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиИнформацииОКандидатах.SuperJob") Тогда
		МассивБлоковПрочего.Добавить("Курсы и тренинги");
		МассивБлоковПрочего.Добавить("Дополнительная информация");
	КонецЕсли;
	
	Возврат МассивБлоковПрочего;
	
КонецФункции

Функция ФИОСодержитЗапрещенныеСимволы(СтрокаФИО)
	
	НомерСимвола = 0;
	Пока НомерСимвола <= СтрДлина(СтрокаФИО) Цикл
		НомерСимвола = НомерСимвола + 1;
		Символ = Сред(СтрокаФИО, НомерСимвола, 1);
		Если ((Символ >="0") И (Символ <="9")) ИЛИ (Символ = "«") ИЛИ (Символ = """") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
