#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСостояниеЗагрузкиКандидатаИзИнтернетаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ДляЗаписи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Источник.ДополнительныеСвойства, "ДляЗаписи");
	
	Идентификатор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДляЗаписи, "ИдентификаторЗагрузки");
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСостояния = РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.НовыеДанныеСостояния();
	ДанныеСостояния.Состояние = Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.Загружен;
	ДанныеСостояния.ЗагруженныйКандидат = Источник.Ссылка;
	ДанныеСостояния.ЗагруженВручную = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДляЗаписи, "ЗагруженВручную", Ложь);
	
	РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.УстановитьСостояниеЗагрузкиКандидата(Идентификатор, ДанныеСостояния);
	
КонецПроцедуры

#КонецОбласти