
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанныеФормы(Параметры);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПодразделенияДолжности = Подразделения.ВыгрузитьЗначения();
	МассивПодразделений = Новый Массив;
	Для Каждого Элемент Из ПодразделенияДолжности Цикл
		Если МассивПодразделений.Найти(Элемент) = Неопределено Тогда
			МассивПодразделений.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивПодразделений, ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
	
	СтруктураПараметраОповещения = Новый Структура;
	СтруктураПараметраОповещения.Вставить("Должность", Должность);
	СтруктураПараметраОповещения.Вставить("Подразделения", МассивПодразделений);
	Оповестить("ИзмененыПодразделения", СтруктураПараметраОповещения, ВладелецФормы);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(Параметры)
	
	Должность = Параметры.Должность;
	
	Если Не Параметры.Свойство("Подразделения") Тогда
		Возврат;
	КонецЕсли;
	
	Подразделения.ЗагрузитьЗначения(Параметры.Подразделения);
	
КонецПроцедуры

#КонецОбласти