///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.Http.
//
// Серверные процедуры и функции отправки HTTP запросов:
//  - конструктор параметров запроса.
//  - методы выполнения HTTP запросов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область КонструкторыПараметров

// Создает параметры запроса.
//
// Параметры:
//  ДанныеДляОбработки - Строка, ДвоичныеДанные, Неопределено - данные для отправки методов передаваемые методом POST,
//    PUT, PATCH.
//    Значение по умолчанию: Неопределено
//  Заголовки - Неопределено
//            - Соответствие из КлючИЗначение:
//    * Ключ - Строка - имя заголовка запроса.
//    * Значение - Строка - значение заголовка запроса.
//    Значение по умолчанию: Неопределено
//  СтандартныеЗаголовки - Булево - если Истина, будут добавлены стандартные заголовки методов сервисов ИТС:
//    X-Correlation-ID, X-Session-ID, X-Info-Base-ID.
//    Значение по умолчанию: Истина
//  ПараметрыЗапросаURL - Неопределено
//                      - Соответствие из КлючИЗначение - параметры запроса, которые будут отправлены в URL
//    (key=value1&key=value2):
//    * Ключ - Строка - имя параметра запроса.
//    * Значение - Строка - значение параметра запроса.
//    Значение по умолчанию: Неопределено
//  ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//    0 - как файл (HTTP методы в поле ответа "Содержимое" будет возвращен файл во временном каталоге с именем,
//      указанным в параметре "ИмяФайла").
//    1 - как строка.
//    2 - как двоичные данные.
//    Любое другое значение - как HTTPОтвет.
//    Значение по умолчанию: 1
//  ФорматДанныхДляОбработки - Число - формат отправки данных:
//    0 - как файл.
//    1 - как строка.
//    2 - как двоичные данные.
//    Значение по умолчанию: 1
//  ИмяФайла - Строка - имя файла с расширением, которое будет использовано при создании нового файла если
//    ФорматОтвета = 0.
//
// Возвращаемое значение:
//  Структура - параметры отправки запроса:
//    * ДанныеДляОбработки - Строка, ДвоичныеДанные, Неопределено - данные для отправки методов передаваемые методом
//        POST, PUT, PATCH.
//        Значение по умолчанию: Неопределено
//    * Заголовки - Неопределено
//                - Соответствие из КлючИЗначение:
//        ** Ключ - Строка - имя заголовка запроса.
//        ** Значение - Строка - значение заголовка запроса.
//        Значение по умолчанию: Неопределено
//    * СтандартныеЗаголовки - Булево - если Истина, будут добавлены стандартные заголовки методов сервисов ИТС:
//        X-Correlation-ID, X-Session-ID, X-Info-Base-ID.
//        Значение по умолчанию: Истина
//    * ПараметрыЗапросаURL - Неопределено
//                          - Соответствие из КлючИЗначение - параметры запроса, которые будут отправлены в URL
//        (key=value1&key=value2):
//        ** Ключ - Строка - имя параметра запроса.
//        ** Значение - Строка - значение параметра запроса.
//        Значение по умолчанию: Неопределено
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (HTTP методы в поле ответа "Содержимое" будет возвращен файл во временном каталоге с именем,
//          указанным в параметре "ИмяФайла").
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//        Значение по умолчанию: 1
//    * ФорматДанныхДляОбработки - Число - формат отправки данных:
//        0 - как файл.
//        1 - как строка.
//        2 - как двоичные данные.
//        Значение по умолчанию: 1
//    * ИмяФайла - Строка - имя файла с расширением, которое будет использовано при создании нового файла если
//        ФорматОтвета = 0.
//
//@skip-check method-too-many-params
Функция НовыйПараметрыЗапроса(
		ДанныеДляОбработки = Неопределено,
		Заголовки = Неопределено,
		СтандартныеЗаголовки = Истина,
		ПараметрыЗапросаURL = Неопределено,
		ФорматОтвета = 1,
		ФорматДанныхДляОбработки = 1,
		ИмяФайла = "") Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("СтандартныеЗаголовки", СтандартныеЗаголовки);
	ПараметрыЗапроса.Вставить("ПараметрыЗапросаURL", ПараметрыЗапросаURL);
	ПараметрыЗапроса.Вставить("ФорматОтвета", ФорматОтвета);
	ПараметрыЗапроса.Вставить("ФорматДанныхДляОбработки", ФорматДанныхДляОбработки);
	ПараметрыЗапроса.Вставить("ИмяФайла", ИмяФайла);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

// Создает параметры обновления токена аутентификации.
//
// Параметры:
//  ИмяМетода - Строка - имя метода, который будет вызван в безопасном режиме
//    в случае если целевая операция вернет значение равное параметру КодОтвета.
//    В вызываемый метод будет передано два параметра:
//      Значения из параметра ПараметрыМетода
//      Обновленный токен аутентификации.
//    В результате работы метода должна быть возвращена структура см. НовыйДанныеВызова.
//  ПараметрыМетода - Произвольный, Неопределено - параметры методы обновления данных запроса.
//  ИдентификаторСервиса - Строка - имя сервиса, для которого выполняется
//    формирование токена.
//  КодОтвета - Число - код ответа метода сервиса при котором необходимо обновить
//    токен аутентификации и повторить запрос.
//    Значение по умолчанию: 401
//
// Возвращаемое значение:
//  Структура - параметры обновления токена аутентификации:
//    * ИмяМетода - Строка - имя метода, который будет вызван в безопасном режиме
//        в случае если целевая операция вернет значение равное параметру КодОтвета.
//        В вызываемый метод будет передано два параметра:
//          Значения из параметра ПараметрыМетода
//          Обновленный токен аутентификации.
//        В результате работы метода должна быть возвращена структура см. НовыйДанныеВызова.
//    * ПараметрыМетода - Произвольный, Неопределено - параметры методы обновления данных запроса.
//    * ИдентификаторСервиса - Строка - имя сервиса, для которого выполняется
//        формирование токена.
//    * КодОтвета - Число - код ответа метода сервиса при котором необходимо обновить
//        токен аутентификации и повторить запрос.
//        Значение по умолчанию: 401
//
// Пример:
//
// Функция ИнформацияОВерсиях(
//    Идентификаторы,
//    ДанныеАутентификации,
//    URLОперации)
//
// ДанныеДляОбработки = versionlatest(
//    Идентификаторы,
//    ДанныеАутентификации,
//    ПараметрыТела.ДополнительныеПараметры);
//  Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации();
//
//  ПараметрыОбновленияТокена = Http.НовыйПараметрыОбновленияТокена(
//   "РаботаСКлассификаторами.ПараметрыЗапроса",
//    Http.НовыйДанныеВызова(
//      Заголовки,
//      ДанныеДляОбработки),
//    "OnecClassifiers",
//    401);
//
//  ПараметрЗапроса = Http.НовыйПараметрыЗапроса(
//    ДанныеДляОбработки,
//    Заголовки);
//
//  // Вызов операции сервиса.
//  Возврат Http.POST(
//    URLОперации,
//    ПараметрЗапроса,
//    ПараметрыОбновленияТокена);
//
// КонецФункции
//
// Функция ПараметрыЗапроса(Параметры, ТокенАутентификации) Экспорт
// 
//  Параметры.Заголовки.Вставить(
//    "Authorization",
//    ИнтернетПоддержкаПользователей.ЗаголовокBearerАутентификации(
//      ТокенАутентификации));
//  Возврат Параметры;
// 
// КонецФункции
//
Функция НовыйПараметрыОбновленияТокена(
		ИмяМетода,
		ПараметрыМетода,
		ИдентификаторСервиса,
		КодОтвета = 401) Экспорт
	
	ПараметрыОбновленияТокена = Новый Структура;
	ПараметрыОбновленияТокена.Вставить("ИмяМетода", ИмяМетода);
	ПараметрыОбновленияТокена.Вставить("ПараметрыМетода", ПараметрыМетода);
	ПараметрыОбновленияТокена.Вставить("КодОтвета", КодОтвета);
	ПараметрыОбновленияТокена.Вставить("ИдентификаторСервиса", ИдентификаторСервиса);
	
	Возврат ПараметрыОбновленияТокена;
	
КонецФункции

// Создает структуру с данными вызова операции.
//
// Параметры:
//  ДанныеДляОбработки - Строка - данные для отправки в теле запроса.
//  Заголовки - Соответствие из КлючИЗначение:
//    * Ключ - Строка - имя заголовка вызова операции.
//    * Значение - Строка - значение заголовка вызова операции.
//
// Возвращаемое значение:
//  Структура - данные вызова:
//    * ДанныеДляОбработки - Строка, Неопределено - данные для отправки в теле запроса.
//    * Заголовки - Соответствие из КлючИЗначение:
//        ** Ключ - Строка - имя заголовка вызова операции.
//        ** Значение - Строка - значение заголовка вызова операции.
//
Функция НовыйДанныеВызова(
		ДанныеДляОбработки,
		Заголовки) Экспорт
	
	ДанныеВызова = Новый Структура;
	ДанныеВызова.Вставить("Заголовки", Заголовки);
	ДанныеВызова.Вставить("ДанныеДляОбработки", ДанныеДляОбработки);
	
	Возврат ДанныеВызова;
	
КонецФункции

// Создает параметры подключения.
//
// Параметры:
//  Таймаут - Число - время ожидания завершения операции в секундах.
//    Значение по умолчанию: 30
//  НастройкиПрокси - Неопределено - настройки прокси будут получены из информационной базы.
//                  - Структура - настройки подключения к прокси серверу.
//    Значение по умолчанию: Неопределено
//  ИспользоватьЗащищенноеСоединение - Булево - признак использования защищенного соединения
//    для запросов https.
//    Значение по умолчанию: Истина
//  ЗащищенноеСоединение - Неопределено - при использовании защищенного соединения будет
//    создан новый объект ЗащищенноеСоединениеOpenSSL.
//                       - ЗащищенноеСоединениеOpenSSL - защищенное соединение, которое
//    следует использовать при создании соединения.
//    Значение по умолчанию: Неопределено
//  КоличествоПеренаправлений - Число - максимальное количество перенаправлений,
//    которое следует обрабатывать.
//    Значение по умолчанию: 7
//
// Возвращаемое значение:
//  Структура:
//    * Таймаут - Число - время ожидания завершения операции в секундах.
//        Значение по умолчанию: 30
//    * НастройкиПрокси - Неопределено - настройки прокси будут получены из информационной базы.
//                      - Структура - настройки подключения к прокси серверу.
//        Значение по умолчанию: Неопределено
//    * ИспользоватьЗащищенноеСоединение - Булево - признак использования защищенного соединения
//        для запросов https.
//        Значение по умолчанию: Истина
//    * ЗащищенноеСоединение - Неопределено - при использовании защищенного соединения будет
//        создан новый объект ЗащищенноеСоединениеOpenSSL.
//                           - ЗащищенноеСоединениеOpenSSL - защищенное соединение, которое
//        следует использовать при создании соединения.
//        Значение по умолчанию: Неопределено
//    * КоличествоПеренаправлений - Число - максимальное количество перенаправлений,
//        которое следует обрабатывать.
//        Значение по умолчанию: 7
//
//@skip-check method-too-many-params
Функция НовыйПараметрыПодключения(
		Таймаут = 30,
		НастройкиПрокси = Неопределено,
		ИспользоватьЗащищенноеСоединение = Истина,
		ЗащищенноеСоединение = Неопределено,
		КоличествоПеренаправлений = 7) Экспорт
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("Таймаут", Таймаут);
	ПараметрыПодключения.Вставить("НастройкиПрокси", НастройкиПрокси);
	ПараметрыПодключения.Вставить("ИспользоватьЗащищенноеСоединение", ИспользоватьЗащищенноеСоединение);
	ПараметрыПодключения.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	ПараметрыПодключения.Вставить("КоличествоПеренаправлений", КоличествоПеренаправлений);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

#КонецОбласти

#Область HTTPМетоды

// Выполняет отправку GET запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция GET(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"GET",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.GET");
	
КонецФункции

// Выполняет отправку OPTIONS запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция OPTIONS(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"OPTIONS",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.Options");
	
КонецФункции

// Выполняет отправку HEAD запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция HEAD(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"HEAD",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.HEAD");
	
КонецФункции

// Выполняет отправку POST запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция POST(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"POST",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.POST");
	
КонецФункции

// Выполняет отправку PUT запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция PUT(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"PUT",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.PUT");
	
КонецФункции

// Выполняет отправку PATCH запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция PATCH(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"PATCH",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.Patch");
	
КонецФункции

// Выполняет отправку DELETE запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//    Значение по умолчанию: Неопределено
//  ПараметрыПодключения - Неопределено - будут сформированы настройки по умолчанию из
//    метода см. НовыйПараметрыПодключения.
//                       - см. НовыйПараметрыПодключения
//    Значение по умолчанию: Неопределено
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция DELETE(
		URL,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена = Неопределено,
		ПараметрыПодключения = Неопределено) Экспорт
	
	Возврат ВыполнитьHTTPЗапрос(
		URL,
		"DELETE",
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		"HTTP.DELETE");
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет отправку HTTP запроса запроса по переданным параметрам.
//
// Параметры:
//  URL - Строка - URL операции.
//  Метод - Строка - используемый HTTP метод.
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ПараметрыОбновленияТокена - Неопределено
//                            - см. НовыйПараметрыОбновленияТокена
//  ПараметрыПодключения - Неопределено
//                       - см. НовыйПараметрыПодключения
//  ИмяФункции - Строка - имя вызывающей функции.
//
// Возвращаемое значение:
//  Структура - содержит результат операции:
//    * КодОшибки - Строка - идентификатор ошибки:
//        LockError - запрос заблокирован настройками программы.
//        ConnectError - ошибка установки соединения с сервисом.
//        ServerError - ошибка на сервере.
//        ClientError - ошибка формирования запроса на клиенте.
//    * СообщениеОбОшибке - Строка - описание ошибки для пользователя.
//    * ИнформацияОбОшибке - Строка - описание ошибки для администратора.
//    * Содержимое - Строка, ДвоичныеДанные, HTTPОтвет, Неопределено - тело ответа.
//    * КодСостояния - Число - код состояния http, который вернул сервер.
//        Возможно передача кодов состояний -1 и -2 в случае блокирования запроса
//        со стороны программы 1С.
//    * ФорматОтвета - Число - определяет формат возврата содержимого ответа операции:
//        0 - как файл (в поле "Содержимое" будет возвращен файл во временном
//          каталоге с именем, указанным в параметре см. НовыйПараметрыЗапроса.ИмяФайла).
//        1 - как строка.
//        2 - как двоичные данные.
//        Любое другое значение - как HTTPОтвет.
//   * Заголовки - Соответствие из КлючИЗначение:
//       ** Ключ - Строка - имя заголовка запроса.
//       ** Значение - Строка - значение заголовка запроса.
//
Функция ВыполнитьHTTPЗапрос(
		Знач URL,
		Метод,
		ПараметрыЗапроса,
		ПараметрыОбновленияТокена,
		ПараметрыПодключения,
		ИмяФункции)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"URL",
		URL,
		Тип("Строка"));
	
	НовыйПараметрыЗапроса = НовыйПараметрыЗапроса();
	НовыйПараметрыЗапроса.Вставить("Метод", Метод);
	
	ЗаполнитьЗначенияСвойств(
		НовыйПараметрыЗапроса,
		ПараметрыЗапроса);
	ПроверитьПараметрыЗапроса(
		НовыйПараметрыЗапроса,
		ИмяФункции);
	
	НовыйПараметрыПодключения = НовыйПараметрыПодключения();
	Если ПараметрыПодключения <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			НовыйПараметрыПодключения,
			ПараметрыПодключения);
		ПроверитьПараметрыПодключения(
			НовыйПараметрыПодключения,
			ИмяФункции);
	КонецЕсли;
	
	НовыйПараметрыОбновленияТокена = НовыйПараметрыОбновленияТокена(
		Неопределено,
		Неопределено,
		Неопределено,
		Неопределено);
	Если ПараметрыОбновленияТокена <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			НовыйПараметрыОбновленияТокена,
			ПараметрыОбновленияТокена);
		ПроверитьПараметрыОбновленияТокена(
			НовыйПараметрыОбновленияТокена,
			ИмяФункции);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(
		НовыйПараметрыЗапроса,
		НовыйПараметрыПодключения);
	ДобавитьСтандартныеЗаголовки(НовыйПараметрыЗапроса);
	
	URL = URL
		+ СтрокаПараметрыЗапросаURL(
			ПараметрыЗапроса.ПараметрыЗапросаURL);
	
	РезультатОперации = ИнтернетПоддержкаПользователей.ЗагрузитьСодержимоеИзИнтернет(
		URL,
		,
		,
		НовыйПараметрыЗапроса);
	
	// Обработка устаревшего токена
	Если ПараметрыОбновленияТокена <> Неопределено
		И НовыйПараметрыОбновленияТокена.КодОтвета = РезультатОперации.КодСостояния Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатАутентификации = ИнтернетПоддержкаПользователей.ТокенАутентификации(
			НовыйПараметрыОбновленияТокена.ИдентификаторСервиса,
			Истина);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ЗначениеЗаполнено(РезультатАутентификации.КодОшибки) Тогда
			Возврат РезультатОперации;
		КонецЕсли;
		
		ПараметрыВызова = Новый Массив;
		ПараметрыВызова.Добавить(НовыйПараметрыОбновленияТокена.ПараметрыМетода);
		ПараметрыВызова.Добавить(РезультатАутентификации.Токен);
		
		ДанныеВызова = ОбщегоНазначения.ВыполнитьМетодКонфигурации(
			НовыйПараметрыОбновленияТокена.ИмяМетода,
			ПараметрыВызова,
			Истина);
		
		НовыйПараметрыЗапроса.Заголовки = ДанныеВызова.Заголовки;
		НовыйПараметрыЗапроса.ДанныеДляОбработки = ДанныеВызова.ДанныеДляОбработки;
		ДобавитьСтандартныеЗаголовки(НовыйПараметрыЗапроса);
		
		РезультатОперации = ИнтернетПоддержкаПользователей.ЗагрузитьСодержимоеИзИнтернет(
			URL,
			,
			,
			НовыйПараметрыЗапроса);
		
	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Добавляет стандартные заголовки сервисов ИТС.
//
// Параметры:
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//
Процедура ДобавитьСтандартныеЗаголовки(
		ПараметрыЗапроса)
	
	Если ПараметрыЗапроса.СтандартныеЗаголовки Тогда
		Если ПараметрыЗапроса.Заголовки = Неопределено Тогда
			ПараметрыЗапроса.Заголовки = Новый Соответствие;
		КонецЕсли;
		ПараметрыЗапроса.Заголовки.Вставить(
			"X-Correlation-ID",
			Строка(Новый УникальныйИдентификатор));
		ПараметрыЗапроса.Заголовки.Вставить(
			"X-Session-ID",
			ИнтернетПоддержкаПользователейСлужебныйПовтИспНаВремяВызова.НовыйИдентификаторСессии());
		ПараметрыЗапроса.Заголовки.Вставить(
			"X-Info-Base-ID",
			СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
		ПараметрыЗапроса.Заголовки.Вставить(
			"X-Program-Nick",
			ИнтернетПоддержкаПользователей.ИмяПрограммы());
	КонецЕсли;
	
КонецПроцедуры

// Проверяет параметры запроса перед выполнением запроса.
//
// Параметры:
//  ПараметрыЗапроса - см. НовыйПараметрыЗапроса
//  ИмяФункции - Строка - имя вызывающей функции.
//
Процедура ПроверитьПараметрыЗапроса(
		ПараметрыЗапроса,
		ИмяФункции)
	
	ТипыДанныеДляОбработки = Новый Массив;
	ТипыДанныеДляОбработки.Добавить(Тип("Строка"));
	ТипыДанныеДляОбработки.Добавить(Тип("ДвоичныеДанные"));
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса.ДанныеДляОбработки) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ДанныеДляОбработки",
			ПараметрыЗапроса.ДанныеДляОбработки,
			ТипыДанныеДляОбработки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Заголовки) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"Заголовки",
			ПараметрыЗапроса.Заголовки,
			Тип("Соответствие"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ФорматОтвета",
		ПараметрыЗапроса.ФорматОтвета,
		Тип("Число"));
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса.ПараметрыЗапросаURL) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ПараметрыЗапроса",
			ПараметрыЗапроса.ПараметрыЗапросаURL,
			Тип("Соответствие"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ФорматДанныхДляОбработки",
		ПараметрыЗапроса.ФорматДанныхДляОбработки,
		Тип("Число"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ИмяФайла",
		ПараметрыЗапроса.ИмяФайла,
		Тип("Строка"));
	
КонецПроцедуры

// Проверяет параметры запроса перед выполнением запроса.
//
// Параметры:
//  ПараметрыОбновленияТокена - см. НовыйПараметрыОбновленияТокена
//  ИмяФункции - Строка - имя вызывающей функции.
//
Процедура ПроверитьПараметрыОбновленияТокена(
		ПараметрыОбновленияТокена,
		ИмяФункции)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ИмяМетода",
		ПараметрыОбновленияТокена.ИмяМетода,
		Тип("Строка"));
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ИдентификаторСервиса",
		ПараметрыОбновленияТокена.ИдентификаторСервиса,
		Тип("Строка"));
	
	Если ЗначениеЗаполнено(ПараметрыОбновленияТокена.ПараметрыМетода) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ПараметрыМетода",
			ПараметрыОбновленияТокена.ПараметрыМетода,
			Тип("Структура"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"КодОтвета",
		ПараметрыОбновленияТокена.КодОтвета,
		Тип("Число"));
	
КонецПроцедуры

// Проверяет параметры запроса перед выполнением запроса.
//
// Параметры:
//  ПараметрыПодключения - см. НовыйПараметрыЗапроса
//  ИмяФункции - Строка - имя вызывающей функции.
//
Процедура ПроверитьПараметрыПодключения(
		ПараметрыПодключения,
		ИмяФункции)
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"Таймаут",
		ПараметрыПодключения.Таймаут,
		Тип("Число"));
	
	Если ЗначениеЗаполнено(ПараметрыПодключения.НастройкиПрокси) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"НастройкиПрокси",
			ПараметрыПодключения.НастройкиПрокси,
			Тип("Структура"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ИспользоватьЗащищенноеСоединение",
		ПараметрыПодключения.ИспользоватьЗащищенноеСоединение,
		Тип("Булево"));
	
	Если ЗначениеЗаполнено(ПараметрыПодключения.ЗащищенноеСоединение) Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ЗащищенноеСоединение",
			ПараметрыПодключения.ЗащищенноеСоединениеOpenSSL,
			Тип("ЗащищенноеСоединениеOpenSSL"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"КоличествоПеренаправлений",
		ПараметрыПодключения.КоличествоПеренаправлений,
		Тип("Число"));
	
КонецПроцедуры

// Формирует строку параметров URL.
//
// Параметры:
//  ПараметрыЗапросаURL - Соответствие из КлючИЗначение - параметры запроса, которые будут отправлены в URL:
//    * Ключ - Строка - имя параметра запроса.
//    * Значение - Строка - значение параметра запроса.
//
// Возвращаемое значение:
//  Строка - параметры запроса URL.
//
Функция СтрокаПараметрыЗапросаURL(ПараметрыЗапросаURL)
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапросаURL) Тогда
		Возврат "";
	КонецЕсли;
	
	Параметры = Новый Массив;
	Для Каждого Параметр Из ПараметрыЗапросаURL Цикл
		
		Если ТипЗнч(Параметр.Значение) = Тип("Массив") Тогда
			Значения = Параметр.Значение;
		Иначе
			Значения = Новый Массив;
			Значения.Добавить(Параметр.Значение);
		КонецЕсли;
	
		Если Параметр.Значение = Неопределено Тогда
			Параметры.Добавить(Параметр.Ключ);
		Иначе
			Для Каждого Значение Из Значения Цикл
				Параметры.Добавить(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						"%1=%2",
						Параметр.Ключ,
						КодироватьСтроку(
							Значение,
							СпособКодированияСтроки.КодировкаURL)));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "?" + СтрСоединить(Параметры, "&");
	
КонецФункции

#КонецОбласти
