////////////////////////////////////////////////////////////////////////////////
// Отражение расходов на персонал.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция формирует структуру с данными отражения расходов на персонал.
//
// Параметры:
//  ПериодРегистрации - дата - первое число месяца, данные отражения расходов за который будут получены.
//  ИсключаемыйРегистратор - ДокументСсылка.ОтражениеРасходовНаПерсонал
//  Отказ - Булево
//  Подразделение - СправочникСсылка.СтруктураПредприятия
// 
// Возвращаемое значение:
//  Структура - данные для отражения, где 
//				Ключ - имя таблицы, соответствует разделам данных для отражения расходов, 
//				Значение - таблица значений, данные соответствующего раздела.
//
Функция РезультатыОтраженияРасходовНаПерсонал(ПериодРегистрации, ИсключаемыйРегистратор, Отказ = Ложь, Подразделение = Неопределено) Экспорт
	
	БезОтбораПоПодразделению = Не ЗначениеЗаполнено(Подразделение);
	ОрганизацииПодразделения = ОрганизационнаяСтруктура.ОрганизацииПодразделения(Подразделение, ПериодРегистрации);
	
	ТаблицаНачислений = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеНачислений(ОрганизацииПодразделения, ПериодРегистрации);
	ТаблицаВзносов = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеВзносов(ОрганизацииПодразделения, ПериодРегистрации);
	ТаблицаУдержаннаяЗарплата = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеУдержаний(ОрганизацииПодразделения, ПериодРегистрации);
	
	ТаблицаЗаймов = ТаблицаУдержаннаяЗарплата.СкопироватьКолонки();
	ТаблицаОбучения = ТаблицаЗаймов.Скопировать();
	ОбработатьТаблицыУдержанийЗаймовОбучения(ТаблицаУдержаннаяЗарплата, ТаблицаЗаймов, ТаблицаОбучения);
	
	РезультатОтражения = Новый Структура;
	РезультатОтражения.Вставить("Зарплата", ТаблицаНачислений);
	РезультатОтражения.Вставить("СтраховыеВзносы", ТаблицаВзносов);
	РезультатОтражения.Вставить("УдержаннаяЗарплата", ТаблицаУдержаннаяЗарплата);
	РезультатОтражения.Вставить("Займы", ТаблицаЗаймов);
	РезультатОтражения.Вставить("Обучение", ТаблицаОбучения);
	
	ДобавитьПоляФинансовогоУчета(РезультатОтражения);
	
	Подразделения = ОрганизационнаяСтруктура.ПодчиненныеПодразделения(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Подразделение));
	ДополнитьТаблицуЗаймов(ТаблицаЗаймов, Подразделения, ОрганизацииПодразделения, ПериодРегистрации);
	ДополнитьТаблицуОбучения(ТаблицаОбучения, Подразделение, ПериодРегистрации, БезОтбораПоПодразделению);
	
	// Данные отражения в учете нужно дополнить данными структуры предприятия.
	// Если структура предприятия соответствует структуре юридических лиц, 
	// то подбираем значения структуры предприятия, соответствующие кадровой истории.
	// Если не соответствует, то пропорционально заполнению места сотрудника в структуре предприятия.
	Если ОрганизационнаяСтруктура.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц() Тогда 
		УстановитьПодразделенияПоСтруктуреЮридическихЛиц(РезультатОтражения, Подразделения, БезОтбораПоПодразделению);
	Иначе
		УстановитьПодразделенияПоМестамСотрудников(РезультатОтражения, ПериодРегистрации, Подразделения, БезОтбораПоПодразделению);
	КонецЕсли;
	
	ЗаполнитьСведенияОФинансовомУчетеСотрудников(РезультатОтражения, ПериодРегистрации);
	КолонкиГруппировок = "ФизическоеЛицо, СпособОтражения, Подразделение, НаправлениеДеятельности, СтатьяРасходов, АналитикаРасходов";
	СвернутьТаблицыДанных(РезультатОтражения, КолонкиГруппировок);
	
	ВычестьРанееЗарегистрированныеДанные(РезультатОтражения, ПериодРегистрации, Подразделение, ИсключаемыйРегистратор);
	
	Возврат РезультатОтражения;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Метод предназначен для регистрации результатов отражения расходов на персонал.
//
// Параметры:
//  Движения - коллекция движения документа, выполняющего регистрацию результатов.
//  Отказ - булево, признак отказа от проведения документа.
//  ПериодРегистрации - дата, первое число месяца, отражение расходов за который будет выполнено.
//  ДанныеДляОтражения - структура, ключ - имя раздела данных, 
//		значение - таблица значений с соответствующими данными.
//  Подразделение - Подразделение (необязательный)
//
Процедура ЗарегистрироватьРасходыНаПерсонал(Движения, Отказ, ПериодРегистрации, СсылкаНаОбъект, ДанныеДляОтражения = Неопределено, Подразделение = Неопределено) Экспорт
	
	Если ДанныеДляОтражения = Неопределено Тогда
		// Получим структуру с результатами отражения зарплаты
		// структура РезультатыОтраженияРасходовНаПерсонал
		// ключ - имя таблицы, значение - таблица значений с полученными данными
		// в структуре присутствуют все таблицы, а заполнены только те, которые входят в СтрокаСписокТаблиц.
		ДанныеДляОтражения = РезультатыОтраженияРасходовНаПерсонал(ПериодРегистрации, СсылкаНаОбъект, Отказ, Подразделение);
	КонецЕсли;
	
	ЗаполнитьКатегорииРасходов(ДанныеДляОтражения);
	КолонкиГруппировок = "Подразделение, КатегорияРасходов, НаправлениеДеятельности, СтатьяРасходов, АналитикаРасходов";
	СвернутьТаблицыДанных(ДанныеДляОтражения, КолонкиГруппировок);
	
	// формирование проводок
	СформироватьДвижения(Движения, Отказ, Подразделение, ПериодРегистрации, ДанныеДляОтражения);
	ОтражениеРасходовНаПерсоналПереопределяемый.ЗарегистрироватьРасходыНаПерсонал(
		Движения, Отказ, ПериодРегистрации, ДанныеДляОтражения, Подразделение);

КонецПроцедуры

// Процедура предназначена для формирования движений регистрам подсистемы.
//
// Параметры:
//	Движения - Коллекция движений документа. 
//	Отказ - Булево - признак отказа от проведения документа.
//	Подразделение - СправочникСсылка.СтруктураПредприятия - Подразделение.
//	МесяцНачисления - Дата - месяц, зарплата которого отражается в бухучете.
//	ДанныеДляОтражения - Структура - Таблицы значений с данными, которые 
//						использоваться для формирования движений.
//
Процедура СформироватьДвижения(Движения, Отказ, Подразделение, МесяцНачисления, ДанныеДляОтражения) Экспорт
	
	ИменаКолонок = "Подразделение, КатегорияРасходов, СтатьяРасходов, НаправлениеДеятельности";
	ИменаКолонокБезАналитики = ИменаКолонок + ", Сумма";
	ИменаКолонокСАналитикой = ИменаКолонокБезАналитики + ", АналитикаРасходов";
	ОтборСтрок = Новый Структура(ИменаКолонок);
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		ВременнаяТаблица = ДанныеДляОтражения[ИмяТаблицы].Скопировать();
		ВременнаяТаблица.Свернуть(ИменаКолонок);
		СтрокиБезАналитики = ДанныеДляОтражения[ИмяТаблицы].СкопироватьКолонки(ИменаКолонокБезАналитики);
		СтрокиСАналитикой = ДанныеДляОтражения[ИмяТаблицы].СкопироватьКолонки(ИменаКолонокСАналитикой);
		Для Каждого СтрокаВременнойТаблицы Из ВременнаяТаблица Цикл
			СтрокиБезАналитики.Очистить();
			СтрокиСАналитикой.Очистить();
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаВременнойТаблицы);
			СтрокиРаспределения = ДанныеДляОтражения[ИмяТаблицы].НайтиСтроки(ОтборСтрок);
			Для Каждого СтрокаТаблицы Из СтрокиРаспределения Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы.АналитикаРасходов) Тогда
					НоваяСтрока = СтрокиБезАналитики.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					Продолжить;
				КонецЕсли;
				НоваяСтрока = СтрокиСАналитикой.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
				НовоеДвижение = Движения.ОтражениеРасходовНаПерсонал.Добавить();
				НовоеДвижение.Период = МесяцНачисления;
				ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
			КонецЦикла;
			СтрокиБезАналитики.Свернуть(ИменаКолонок, "Сумма");
			Если СтрокиБезАналитики.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокиСАналитикой.Количество() = 0 Тогда
				СтрокаТаблицы = СтрокиБезАналитики[0];
				НовоеДвижение = Движения.ОтражениеРасходовНаПерсонал.Добавить();
				НовоеДвижение.Период = МесяцНачисления;
				ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
				Продолжить;
			КонецЕсли;
			МассивКоэффициентов = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиСАналитикой, "Сумма");
			МассивСумм = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(СтрокиБезАналитики[0].Сумма, МассивКоэффициентов);
			Индекс = 0;
			Пока Индекс < СтрокиСАналитикой.Количество() Цикл
				НовоеДвижение = Движения.ОтражениеРасходовНаПерсонал.Добавить();
				НовоеДвижение.Период = МесяцНачисления;
				НовоеДвижение.КатегорияРасходов = СтрокиСАналитикой[Индекс].КатегорияРасходов;
				НовоеДвижение.Подразделение = СтрокиСАналитикой[Индекс].Подразделение;
				НовоеДвижение.НаправлениеДеятельности = СтрокиСАналитикой[Индекс].НаправлениеДеятельности;
				НовоеДвижение.СтатьяРасходов = СтрокиСАналитикой[Индекс].СтатьяРасходов;
				НовоеДвижение.АналитикаРасходов = СтрокиСАналитикой[Индекс].АналитикаРасходов;
				НовоеДвижение.Сумма = МассивСумм[Индекс];
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Движения.ОтражениеРасходовНаПерсонал.Записывать = Истина;
	
КонецПроцедуры

// Функция определяет возможность выполнения операции отражения расходов на персонал, 
// осуществляемой документом «Отражение расходов на персонал», 
// одним экземпляром документа по всем подразделениям.
//
// Возвращаемое значение:
// - булево, 
//	Истина, если операция одним документом по всем подразделениям доступна, 
//	Ложь - в противном случае.
//
Функция ОтражениеРасходовНаПерсоналОднимДокументомПоВсемПодразделениямДоступно() Экспорт
	
	Доступность = Истина;
	
	ОтражениеРасходовНаПерсоналПереопределяемый.ЗаполнитьДоступностьОтраженияРасходовНаПерсоналОднимДокументомПоВсемПодразделениям(Доступность);
	
	Возврат Доступность;
	
КонецФункции

#Область ЗащитаПерсональныхДанных

// Процедура обеспечивает сбор сведений о хранении данных, 
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации, 
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ОтражениеРасходовНаПерсонал";
	НовыеСведения.ПоляРегистрации	= "НачисленнаяЗарплата.ФизическоеЛицо,Взносы.ФизическоеЛицо,УдержаннаяЗарплата.ФизическоеЛицо,Займы.ФизическоеЛицо,Обучение.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НачисленнаяЗарплата.Сумма,Взносы.Сумма,УдержаннаяЗарплата.Сумма,Займы.Сумма,Обучение.Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Если Разделы.НайтиСтроки(Новый Структура("Имя", "ФинансовыйУчетЗарплаты")).Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Раздел = Разделы.Добавить();
	Раздел.Имя = "ФинансовыйУчетЗарплаты";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("715573d4-7d68-43dd-b74a-e978a1772df7");
	Раздел.Представление = НСтр("ru = 'Финансовый учет зарплаты'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(
		ИсточникиДанных, "Документ.ОтражениеРасходовНаПерсонал", "ПериодРегистрации", "ФинансовыйУчетЗарплаты", "");
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ОтражениеРасходовНаПерсонал, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтражениеРасходовНаПерсоналПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОтражениеРасходовНаПерсонал, Истина);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.23.5",
		"Роль.ДобавлениеИзменениеОтраженияЗарплатыВФинансовомУчете",
		"Роль.ОтражениеЗарплатыВФинансовомУчете");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.23.5",
		"Роль.ЧтениеОтраженияЗарплатыВФинансовомУчете",
		"Роль.ЧтениеОтраженияРасходовНаПерсонал");
	
КонецПроцедуры

#Область СведенияОФинансовомУчете

// Формирует временную таблицу ВТСведенияОФинансовомУчетеСотрудников, список сотрудников и периодов,
// по которым необходимо получить данные, берутся из временной таблицы в менеджере временных
// таблиц, переданном в качестве параметра. Временная таблица обязательно должна содержать
// колонки Сотрудник и Период.
//		Поля "Сотрудник,Период" можно переопределить в параметре ИменаПолейВременнойТаблицы.
//
//	Структура таблицы ВТСведенияОФинансовомУчетеСотрудников.
//		Подразделение
//		Сотрудник
//		Период
//		КатегорияРасходов
//		НаправлениеДеятельности
//		СтатьяРасходов
//		АналитикаРасходов
//		СпособОтражения.
//
// Параметры:
//		МенеджерВременныхТаблиц - содержит временную таблицу с именем, указанным в параметре ИмяВременнойТаблицы.
//		Организация - если значение Неопределенно, то должно быть поле Организация в таблице ИмяВременнойТаблицы.
//		Подразделение - если значение Неопределенно, то должно быть поле Подразделение в таблице ИмяВременнойТаблицы.
//		ИмяВременнойТаблицы - временная таблица с полями Организация, Подразделение, Сотрудник, Период.
//			Поля Организация и Подразделение могут отсутствовать, если заполнены параметр Организация, Подразделение.
//			Имена полей Сотрудник и Период можно переопределить в параметре ИменаПолейВременнойТаблицы.
//		ИменаПолейВременнойТаблицы - строка, имена полей Сотрудник и Период временной таблицы ИмяВременнойТаблицы.
//		ЕстьПозиции - Булево, признак наличия колонки "Позиция" во временной таблице.
//
Процедура СоздатьВТСведенияОФинансовомУчетеСотрудников(МенеджерВременныхТаблиц, ИмяВременнойТаблицы,
	ИменаПолейВременнойТаблицы = "Сотрудник,Период", ЕстьПозиции = Ложь) Экспорт
	
	МассивИменПолейОтбора = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПолейВременнойТаблицы, ",");
	ИмяПоляСотрудник = "Таблица." + МассивИменПолейОтбора[0];
	ИмяПоляПериод = "Таблица." + МассивИменПолейОтбора[1];
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ФинансовыйУчетПоУмолчанию",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВременнойТаблицы),
		ПараметрыПостроения);
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетПоУмолчаниюСрезПоследних");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Подразделение КАК Подразделение,
	|	&ИмяПоляПериод КАК Период,
	|	ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница,
	|	ПодчиненностьСтруктурныхЕдиниц.Уровень
	|ПОМЕСТИТЬ ВТОтборПодразделений
	|ИЗ
	|	ИмяВременнойТаблицы КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|		ПО Таблица.Подразделение = СтруктураПредприятия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
	|		ПО Таблица.Подразделение = ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляПериод", ИмяПоляПериод);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТОтборПодразделений");
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТОтборПодразделений", "Подразделение");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Подразделение", "ВышестоящаяСтруктурнаяЕдиница");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ФинансовыйУчетПодразделений",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ОписаниеФильтра,
		ПараметрыПостроения);
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетПодразделенийСрезПоследних");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтборПодразделений.Подразделение,
	|	ОтборПодразделений.Период,
	|	ОтборПодразделений.Уровень,
	|	ФинансовыйУчетПодразделений.СпособОтражения,
	|	ФинансовыйУчетПодразделений.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ФинансовыйУчетПодразделений.ИдентификаторСтроки = 0 И ФинансовыйУчетПодразделений.ДоляРаспределения = 0
	|			ТОГДА 100
	|		ИНАЧЕ ФинансовыйУчетПодразделений.ДоляРаспределения
	|	КОНЕЦ ДоляРаспределения
	|ПОМЕСТИТЬ ВТФинансовыйУчетПодразделенийПредварительно
	|ИЗ
	|	ВТОтборПодразделений КАК ОтборПодразделений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПодразделенийСрезПоследних КАК ФинансовыйУчетПодразделений
	|		ПО ОтборПодразделений.Период = ФинансовыйУчетПодразделений.Период
	|		И ОтборПодразделений.ВышестоящаяСтруктурнаяЕдиница = ФинансовыйУчетПодразделений.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйУчетПодразделенийПредварительно.Подразделение КАК Подразделение,
	|	ФинансовыйУчетПодразделенийПредварительно.Период КАК Период,
	|	МИНИМУМ(ФинансовыйУчетПодразделенийПредварительно.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ВТМинимальныеУровни
	|ИЗ
	|	ВТФинансовыйУчетПодразделенийПредварительно КАК ФинансовыйУчетПодразделенийПредварительно
	|СГРУППИРОВАТЬ ПО
	|	ФинансовыйУчетПодразделенийПредварительно.Подразделение,
	|	ФинансовыйУчетПодразделенийПредварительно.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйУчетПодразделенийПредварительно.Подразделение,
	|	ФинансовыйУчетПодразделенийПредварительно.Период,
	|	ФинансовыйУчетПодразделенийПредварительно.СпособОтражения,
	|	ФинансовыйУчетПодразделенийПредварительно.ИдентификаторСтроки,
	|	ФинансовыйУчетПодразделенийПредварительно.ДоляРаспределения
	|ПОМЕСТИТЬ ВТФинансовыйУчетПодразделений
	|ИЗ
	|	ВТФинансовыйУчетПодразделенийПредварительно КАК ФинансовыйУчетПодразделенийПредварительно
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМинимальныеУровни КАК МинимальныеУровни
	|		ПО ФинансовыйУчетПодразделенийПредварительно.Подразделение = МинимальныеУровни.Подразделение
	|		И ФинансовыйУчетПодразделенийПредварительно.Период = МинимальныеУровни.Период
	|		И ФинансовыйУчетПодразделенийПредварительно.Уровень = МинимальныеУровни.Уровень";
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетПодразделенийПредварительно");
	УдалитьВТ.Добавить("ВТМинимальныеУровни");
	УдалитьВТ.Добавить("ВТФинансовыйУчетПодразделений");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ИмяПоляПериод КАК Период,
		|	&ИмяПоляСотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТОтборСотрудников
		|ИЗ
		|	ИмяВременнойТаблицы КАК Таблица";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляПериод", ИмяПоляПериод);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляСотрудник", ИмяПоляСотрудник);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТОтборСотрудников");
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ФинансовыйУчетСотрудников",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТОтборСотрудников", "Сотрудник"),
		ПараметрыПостроения);
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетСотрудниковСрезПоследних");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "ПустойИнтервал", "<>", Истина);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ФинансовыйУчетРаспределениеРасходовНаПерсонал",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТОтборСотрудников", "Сотрудник"),
		ПараметрыПостроения);
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетРаспределениеРасходовНаПерсоналСрезПоследних");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Сотрудник КАК Сотрудник,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Период КАК Период,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Подразделение КАК Подразделение,
	|	МАКСИМУМ(ФинансовыйУчетРаспределениеРасходовНаПерсонал.ПериодЗаписи) КАК ПериодЗаписи
	|ПОМЕСТИТЬ ВТМаксимальныеПериоды
	|ИЗ
	|	ВТФинансовыйУчетРаспределениеРасходовНаПерсоналСрезПоследних КАК ФинансовыйУчетРаспределениеРасходовНаПерсонал
	|СГРУППИРОВАТЬ ПО
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Сотрудник,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Период,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Сотрудник КАК Сотрудник,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Период КАК Период,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Подразделение КАК Подразделение,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.СпособОтражения КАК СпособОтражения,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.ДоляРаспределения КАК ДоляРаспределения,
	|	АВТОНОМЕРЗАПИСИ() КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТФинансовыйУчетРаспределениеРасходовНаПерсонал
	|ИЗ
	|	ВТФинансовыйУчетРаспределениеРасходовНаПерсоналСрезПоследних КАК ФинансовыйУчетРаспределениеРасходовНаПерсонал
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныеПериоды КАК МаксимальныеПериоды
	|		ПО ФинансовыйУчетРаспределениеРасходовНаПерсонал.Сотрудник = МаксимальныеПериоды.Сотрудник
	|		И ФинансовыйУчетРаспределениеРасходовНаПерсонал.Период = МаксимальныеПериоды.Период
	|		И ФинансовыйУчетРаспределениеРасходовНаПерсонал.Подразделение = МаксимальныеПериоды.Подразделение
	|		И ФинансовыйУчетРаспределениеРасходовНаПерсонал.ПериодЗаписи = МаксимальныеПериоды.ПериодЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Сотрудник КАК Сотрудник,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.Период КАК Период,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.СпособОтражения КАК СпособОтражения,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.ДоляРаспределения КАК ДоляРаспределения,
	|	ФинансовыйУчетРаспределениеРасходовНаПерсонал.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТФинансовыйУчетСотрудников
	|ИЗ
	|	ВТФинансовыйУчетРаспределениеРасходовНаПерсонал КАК ФинансовыйУчетРаспределениеРасходовНаПерсонал
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФинансовыйУчетСотрудниковСрезПоследних.Сотрудник,
	|	ФинансовыйУчетСотрудниковСрезПоследних.Период,
	|	ФинансовыйУчетСотрудниковСрезПоследних.СпособОтражения,
	|	100,
	|	0
	|ИЗ
	|	ВТФинансовыйУчетСотрудниковСрезПоследних КАК ФинансовыйУчетСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ (ФинансовыйУчетСотрудниковСрезПоследних.Период, ФинансовыйУчетСотрудниковСрезПоследних.Сотрудник) В
	|		(ВЫБРАТЬ
	|			Т.Период,
	|			Т.Сотрудник
	|		ИЗ
	|			ВТФинансовыйУчетРаспределениеРасходовНаПерсонал КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Подразделение КАК Подразделение,
	|	&ИмяПоляСотрудник КАК Сотрудник,
	|	&ИмяПоляПериод КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетСотрудников.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетСотрудников.СпособОтражения
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетПодразделений.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетПодразделений.СпособОтражения
	|		ИНАЧЕ ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка))
	|	КОНЕЦ КАК СпособОтражения,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетСотрудников.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетСотрудников.ИдентификаторСтроки
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетПодразделений.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетПодразделений.ИдентификаторСтроки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетСотрудников.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетСотрудников.ДоляРаспределения
	|		КОГДА ЕСТЬNULL(ФинансовыйУчетПодразделений.СпособОтражения,
	|			ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
	|			ТОГДА ФинансовыйУчетПодразделений.ДоляРаспределения
	|		ИНАЧЕ 100
	|	КОНЕЦ КАК ДоляРаспределения,
	|	ВЫБОР
	|		КОГДА ФинансовыйУчетПодразделений.СпособОтражения ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьФинансовыйУчетПодразделения,
	|	ВЫБОР
	|		КОГДА ФинансовыйУчетСотрудников.СпособОтражения ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьФинансовыйУчетСотрудника,
	|	ВЫБОР
	|		КОГДА ФинансовыйУчетПоУмолчанию.СпособОтражения ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьФинансовыйУчетПоУмолчанию,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.НаправлениеДеятельности, НЕОПРЕДЕЛЕНО) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.Зарплата, НЕОПРЕДЕЛЕНО) КАК Зарплата,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.СтраховыеВзносы, НЕОПРЕДЕЛЕНО) КАК СтраховыеВзносы,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.УдержаннаяЗарплата, НЕОПРЕДЕЛЕНО) КАК УдержаннаяЗарплата,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.Займы, НЕОПРЕДЕЛЕНО) КАК Займы,
	|	ЕСТЬNULL(ФинансовыйУчетПоУмолчанию.Обучение, НЕОПРЕДЕЛЕНО) КАК Обучение
	|ПОМЕСТИТЬ ВТСведенияОФинансовомУчетеСотрудников
	|ИЗ
	|	ИмяВременнойТаблицы КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетСотрудников КАК ФинансовыйУчетСотрудников
	|		ПО (&ИмяПоляСотрудник = ФинансовыйУчетСотрудников.Сотрудник)
	|		И (&ИмяПоляПериод = ФинансовыйУчетСотрудников.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПодразделений КАК ФинансовыйУчетПодразделений
	|		ПО (&ИмяПоляПериод = ФинансовыйУчетПодразделений.Период)
	|		И Таблица.Подразделение = ФинансовыйУчетПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПоУмолчаниюСрезПоследних КАК ФинансовыйУчетПоУмолчанию
	|		ПО (&ИмяПоляПериод = ФинансовыйУчетПоУмолчанию.Период)";
	
	Если ЕстьПозиции Тогда
		ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
			"ФинансовыйУчетПозицийКадровогоПлана",
			Запрос.МенеджерВременныхТаблиц,
			Истина,
			ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВременнойТаблицы, "Позиция"),
			ПараметрыПостроения,
			"ВТФинансовыйУчетПозицийКадровогоПлана");
		
		УдалитьВТ.Добавить("ВТФинансовыйУчетПозицийКадровогоПлана");	
	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ТОГДА ФинансовыйУчетСотрудников.СпособОтражения",
			"ТОГДА ФинансовыйУчетСотрудников.СпособОтражения
			|		КОГДА ЕСТЬNULL(ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения, ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
			|			ТОГДА ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ТОГДА ФинансовыйУчетСотрудников.ИдентификаторСтроки",
			"ТОГДА ФинансовыйУчетСотрудников.ИдентификаторСтроки
			|		КОГДА ЕСТЬNULL(ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения, ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
			|			ТОГДА ФинансовыйУчетПозицийКадровогоПлана.ИдентификаторСтроки");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"ТОГДА ФинансовыйУчетСотрудников.ДоляРаспределения",
			"ТОГДА ФинансовыйУчетСотрудников.ДоляРаспределения
			|		КОГДА ЕСТЬNULL(ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения, ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
			|			ТОГДА ВЫБОР
			|					КОГДА ФинансовыйУчетПозицийКадровогоПлана.ИдентификаторСтроки = 0 И ФинансовыйУчетПозицийКадровогоПлана.ДоляРаспределения = 0
			|						ТОГДА 100
			|					ИНАЧЕ ФинансовыйУчетПозицийКадровогоПлана.ДоляРаспределения
			|				КОНЕЦ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"КОНЕЦ КАК ЕстьФинансовыйУчетСотрудника",
			"КОНЕЦ КАК ЕстьФинансовыйУчетСотрудника,
			|	Таблица.Позиция КАК Позиция,
			|	ВЫБОР
			|		КОГДА ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЕстьФинансовыйУчетПозицииКадровогоПлана");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"(&ИмяПоляПериод = ФинансовыйУчетСотрудников.Период)",
			"(&ИмяПоляПериод = ФинансовыйУчетСотрудников.Период)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПозицийКадровогоПлана КАК ФинансовыйУчетПозицийКадровогоПлана
			|		ПО Таблица.Позиция = ФинансовыйУчетПозицийКадровогоПлана.Позиция
			|			И (&ИмяПоляПериод = ФинансовыйУчетПозицийКадровогоПлана.Период)");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ИмяВременнойТаблицы", ИмяВременнойТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляСотрудник", ИмяПоляСотрудник);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИмяПоляПериод", ИмяПоляПериод);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТФинансовыйУчетРаспределениеРасходовНаПерсонал");
	УдалитьВТ.Добавить("ВТФинансовыйУчетСотрудников");
	УдалитьВТ.Добавить("ВТМаксимальныеПериоды");
	
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СвернутьТаблицыДанных(ДанныеДляОтражения, КолонкиГруппировок)
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ДанныеДляОтражения[КлючИЗначение.Ключ].Свернуть(КолонкиГруппировок, "Сумма");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПоляФинансовогоУчета(ДанныеДляОтражения)
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		КолонкаПодразделение = ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("Подразделение");
		Если КолонкаПодразделение <> Неопределено Тогда
			Если КолонкаПодразделение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций") Тогда
				КолонкаПодразделение.Имя = "ПодразделениеОрганизации";
			КонецЕсли;
		КонецЕсли;
		Если ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("Подразделение") = Неопределено Тогда
			ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить(
				"Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
		КонецЕсли;
		Если ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("СпособОтражения") = Неопределено Тогда
			ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить(
				"СпособОтражения", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияВФинансовомУчете"));
		КонецЕсли;
		Если ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("НаправлениеДеятельности") = Неопределено Тогда
			ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить(
				"НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
		КонецЕсли;
		Если Не ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("СтатьяРасходов") = Неопределено Тогда
			ДанныеДляОтражения[ИмяТаблицы].Колонки.Удалить("СтатьяРасходов");
		КонецЕсли;
		ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить(
			"СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
		Если ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("АналитикаРасходов") = Неопределено Тогда
			ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить("АналитикаРасходов");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПодразделенияПоСтруктуреЮридическихЛиц(ДанныеДляОтражения, Подразделения, БезОтбораПоПодразделению)
		
	// Выбираем подразделения юридических лиц.
	ПодразделенияЮридическихЛиц = Новый Массив;
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПодразделенияЮридическихЛиц, ОбщегоНазначения.ВыгрузитьКолонку(
			ДанныеДляОтражения[КлючИЗначение.Ключ], "ПодразделениеОрганизации", Истина), Истина);
	КонецЦикла;
	
	// Определяем соответствующие им подразделения предприятия.
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СтруктураПредприятия.Ссылка КАК Подразделение,
	|	СтруктураПредприятия.Источник КАК ПодразделениеОрганизации
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	СтруктураПредприятия.Источник В(&ПодразделенияЮридическихЛиц)
	|	И (&БезОтбораПоПодразделению
	|			ИЛИ СтруктураПредприятия.Ссылка В (&Подразделения))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПодразделенияЮридическихЛиц", ПодразделенияЮридическихЛиц);
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Запрос.УстановитьПараметр("БезОтбораПоПодразделению", БезОтбораПоПодразделению);
	
	СоответствиеПодразделений = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеПодразделений.Вставить(Выборка.ПодразделениеОрганизации, Выборка.Подразделение);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		ВременнаяТаблица = ДанныеДляОтражения[ИмяТаблицы].Скопировать();
		ДанныеДляОтражения[ИмяТаблицы].Очистить();
		Для Каждого СтрокаВременнойТаблицы Из ВременнаяТаблица Цикл
			НайденноеПодразделение = СтрокаВременнойТаблицы.Подразделение;
			Если Не ЗначениеЗаполнено(НайденноеПодразделение) Тогда
				НайденноеПодразделение = СоответствиеПодразделений[СтрокаВременнойТаблицы["ПодразделениеОрганизации"]];
			КонецЕсли;
			Если Не (БезОтбораПоПодразделению Или ЗначениеЗаполнено(НайденноеПодразделение)) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
			НоваяСтрока["Подразделение"] = НайденноеПодразделение;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКатегорииРасходов(ДанныеДляОтражения)
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ЗаполнитьКатегориюРасходов(ДанныеДляОтражения, КлючИЗначение.Ключ);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКатегориюРасходов(ДанныеДляОтражения, ИмяТаблицы, ИмяЗначенияПеречисления = "")
	
	Если Не ДанныеДляОтражения.Свойство(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеДляОтражения[ИмяТаблицы].Колонки.Найти("КатегорияРасходов") = Неопределено Тогда
		ДанныеДляОтражения[ИмяТаблицы].Колонки.Добавить(
			"КатегорияРасходов", Новый ОписаниеТипов("ПеречислениеСсылка.КатегорииРасходовНаПерсонал"));
	КонецЕсли;
	
	Если ИмяЗначенияПеречисления = "" Тогда
		ИмяЗначенияПеречисления = ИмяТаблицы;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ДанныеДляОтражения[ИмяТаблицы] Цикл
		СтрокаТаблицы.КатегорияРасходов = Перечисления.КатегорииРасходовНаПерсонал[ИмяЗначенияПеречисления];
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПодразделенияПоМестамСотрудников(ДанныеДляОтражения, ПериодРегистрации, Подразделения, БезОтбораПоПодразделению)
	
	// Для каждого сотрудника необходимо определить подразделение структуры предприятия, 
	// распределить суммы расходов сотрудников пропорционально времени в разных подразделениях 
	// (если подразделение менялось в течение месяца).
	
	// Получаем сотрудников
	// Для каждого сотрудника определяем подразделение на начало периода, а также все изменения.
	// Составляем интервалы действия подразделений для сотрудника.
	// Для различных интервалов рассчитываем время по производственному календарю.
	
	Сотрудники = Новый Массив;
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Сотрудники, ОбщегоНазначения.ВыгрузитьКолонку(
			ДанныеДляОтражения[КлючИЗначение.Ключ], "Сотрудник", Истина), Истина);
	КонецЦикла;
		
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	&Период КАК Период,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудникиПериоды
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Сотрудники)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ПериодРегистрации) + 1);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ПериодРегистрации));
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	ПараметрыПостроения.ВключатьЗаписиНаНачалоПериода = Истина;
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистра(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТСотрудникиПериоды",
			"Сотрудник"),
		ПараметрыПостроения,
		"ВТКадроваяИсторияСрезИДвиженияПредварительно");
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КадроваяИсторияСрезИДвижения.Период,
	|	КадроваяИсторияСрезИДвижения.Сотрудник,
	|	КадроваяИсторияСрезИДвижения.ДолжностьПоШтатномуРасписанию
	|ПОМЕСТИТЬ ВТКадроваяИсторияСрезИДвижения
	|ИЗ
	|	ВТКадроваяИсторияСрезИДвиженияПредварительно КАК КадроваяИсторияСрезИДвижения";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТКадроваяИсторияСрезИДвижения", "Позиция");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Позиция", "ДолжностьПоШтатномуРасписанию");

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", МенеджерВременныхТаблиц, Истина, ОписаниеФильтра,
		ПараметрыПостроения, "ВТМестоПозицииВСтруктуреПредприятия");
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КадроваяИстория.Период КАК Период,
	|	КадроваяИстория.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(МестоПозицииВСтруктуреПредприятия.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК
	|		Подразделение
	|ПОМЕСТИТЬ ВТМестаВСтруктуреСрезИДвижения
	|ИЗ
	|	ВТКадроваяИсторияСрезИДвижения КАК КадроваяИстория
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииВСтруктуреПредприятия КАК МестоПозицииВСтруктуреПредприятия
	|		ПО КадроваяИстория.ДолжностьПоШтатномуРасписанию = МестоПозицииВСтруктуреПредприятия.Позиция
	|		И КадроваяИстория.Период = МестоПозицииВСтруктуреПредприятия.Период";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Периоды.Период,
	|	Периоды.Сотрудник
	|ПОМЕСТИТЬ ВТПериоды
	|ИЗ
	|	ВТМестаВСтруктуреСрезИДвижения КАК Периоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Периоды.Сотрудник,
	|	Периоды.Период КАК ДатаНачала,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ПериодыСлед.Период) ЕСТЬ NULL 
	|			ТОГДА &ДатаОкончания
	|		ИНАЧЕ МИНИМУМ(ДОБАВИТЬКДАТЕ(ПериодыСлед.Период, СЕКУНДА, -1))
	|	КОНЕЦ КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТИнтервалы
	|ИЗ
	|	ВТПериоды КАК Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериоды КАК ПериодыСлед
	|		ПО Периоды.Период < ПериодыСлед.Период
	|			И Периоды.Сотрудник = ПериодыСлед.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	Периоды.Сотрудник,
	|	Периоды.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Интервалы.Сотрудник,
	|	Интервалы.ДатаНачала,
	|	Интервалы.ДатаОкончания
	|ПОМЕСТИТЬ ВТСотрудникиИнтервалы
	|ИЗ
	|	ВТИнтервалы КАК Интервалы";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.Выполнить();
	
	// Получаем данные о времени за интервалы для распределения сумм.
	УчетРабочегоВремениРасширенный.СоздатьВТРабочееСотрудниковВремяПоИнтервалам(МенеджерВременныхТаблиц, ПериодРегистрации);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Интервалы.Сотрудник,
	|	Интервалы.ДатаНачала,
	|	Интервалы.ДатаОкончания,
	|	МестаВСтруктуре.Подразделение,
	|	РабочееВремяПоИнтервалам.НормаДней,
	|	РабочееВремяПоИнтервалам.НормаЧасов
	|ИЗ
	|	ВТИнтервалы КАК Интервалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочееВремяПоИнтервалам КАК РабочееВремяПоИнтервалам
	|		ПО (РабочееВремяПоИнтервалам.Сотрудник = Интервалы.Сотрудник)
	|			И (РабочееВремяПоИнтервалам.ДатаНачала = Интервалы.ДатаНачала)
	|			И (РабочееВремяПоИнтервалам.ДатаОкончания = Интервалы.ДатаОкончания)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестаВСтруктуреСрезИДвижения КАК МестаВСтруктуре
	|		ПО (МестаВСтруктуре.Период = Интервалы.ДатаНачала)
	|			И (МестаВСтруктуре.Сотрудник = Интервалы.Сотрудник)";
	
	Запрос.Текст = ТекстЗапроса;
	
	МестаСотрудниковВСтруктуреПредприятия = Запрос.Выполнить().Выгрузить();
	
	ОтборСтрок = Новый Структура("Сотрудник");
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		ВременнаяТаблица = ДанныеДляОтражения[ИмяТаблицы].Скопировать();
		ДанныеДляОтражения[ИмяТаблицы].Очистить();
		Для Каждого СтрокаВременнойТаблицы Из ВременнаяТаблица Цикл
			РаспределяемаяСумма = СтрокаВременнойТаблицы.Сумма;
			Если РаспределяемаяСумма = 0 Тогда
				// Строка переносится "как есть".
				ЗаполнитьЗначенияСвойств(ДанныеДляОтражения[ИмяТаблицы].Добавить(), СтрокаВременнойТаблицы);
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаВременнойТаблицы);
			СтрокиРаспределения = МестаСотрудниковВСтруктуреПредприятия.НайтиСтроки(ОтборСтрок);
			Если СтрокиРаспределения.Количество() = 0 Тогда
				// Нет данных для распределения - переносим "как есть".
				ЗаполнитьЗначенияСвойств(ДанныеДляОтражения[ИмяТаблицы].Добавить(), СтрокаВременнойТаблицы);
				Продолжить;
			КонецЕсли;
			МассивКоэффициентов = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиРаспределения, "НормаЧасов");
			МассивСумм = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(РаспределяемаяСумма, МассивКоэффициентов);
			Индекс = 0;
			Пока Индекс < СтрокиРаспределения.Количество() Цикл
				Если Не БезОтбораПоПодразделению И Подразделения.Найти(СтрокиРаспределения[Индекс].Подразделение) = Неопределено Тогда
					Индекс = Индекс + 1;
					Продолжить;
				КонецЕсли;
				НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
				НоваяСтрока.Сумма = МассивСумм[Индекс];
				НоваяСтрока.Подразделение = СтрокиРаспределения[Индекс].Подразделение;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОФинансовомУчетеСотрудников(ДанныеДляОтражения, ПериодРегистрации)
	
	ЗаполнитьКатегорииРасходов(ДанныеДляОтражения);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	Зарплата.Сотрудник КАК Сотрудник,
	|	Зарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Зарплата.Подразделение КАК Подразделение,
	|	Зарплата.ДокументОснование КАК ДокументОснование,
	|	Зарплата.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТЗарплата
	|ИЗ
	|	&Зарплата КАК Зарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	Взносы.Сотрудник КАК Сотрудник,
	|	Взносы.Подразделение КАК Подразделение,
	|	Взносы.Начисление КАК Начисление
	|ПОМЕСТИТЬ ВТВзносы
	|ИЗ
	|	&СтраховыеВзносы КАК Взносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	УдержаннаяЗарплата.Сотрудник КАК Сотрудник,
	|	УдержаннаяЗарплата.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТУдержаннаяЗарплата
	|ИЗ
	|	&УдержаннаяЗарплата КАК УдержаннаяЗарплата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	Займы.Сотрудник КАК Сотрудник,
	|	Займы.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТЗаймы
	|ИЗ
	|	&Займы КАК Займы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	Обучение.Сотрудник КАК Сотрудник,
	|	Обучение.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТОбучение
	|ИЗ
	|	&Обучение КАК Обучение";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Зарплата", ДанныеДляОтражения["Зарплата"]);
	Запрос.УстановитьПараметр("СтраховыеВзносы", ДанныеДляОтражения["СтраховыеВзносы"]);
	Запрос.УстановитьПараметр("УдержаннаяЗарплата", ДанныеДляОтражения["УдержаннаяЗарплата"]);
	Запрос.УстановитьПараметр("Займы", ДанныеДляОтражения["Займы"]);
	Запрос.УстановитьПараметр("Обучение", ДанныеДляОтражения["Обучение"]);
	Запрос.УстановитьПараметр("Период", НачалоМесяца(ПериодРегистрации));
	Запрос.Выполнить();
	
	НачислениеДоговор = Перечисления.ВидыОсобыхНачисленийИУдержаний.ДоговорРаботыУслуги;
	Запрос.УстановитьПараметр("НачислениеДоговор", НачислениеДоговор);
	
	СведенияОПлановыхНачисленияхПоДоговорам = СведенияОПлановыхНачисленияхПоДоговорам(Запрос);
	ЕстьДоговоры = СведенияОПлановыхНачисленияхПоДоговорам.Количество() > 0;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Зарплата.Период КАК Период,
	|	Зарплата.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ФинансовыйУчетПлановыеНачисленияПоДоговорам.Подразделение, Зарплата.Подразделение) КАК Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПериодыПредварительно
	|ИЗ
	|	ВТЗарплата КАК Зарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПлановыеНачисленияПоДоговорам КАК ФинансовыйУчетПлановыеНачисленияПоДоговорам
	|		ПО (Зарплата.Начисление = &НачислениеДоговор)
	|			И Зарплата.Период = ФинансовыйУчетПлановыеНачисленияПоДоговорам.Период
	|			И Зарплата.Сотрудник = ФинансовыйУчетПлановыеНачисленияПоДоговорам.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взносы.Период,
	|	Взносы.Сотрудник,
	|	ЕСТЬNULL(ФинансовыйУчетПлановыеНачисленияПоДоговорам.Подразделение, Взносы.Подразделение)
	|ИЗ
	|	ВТВзносы КАК Взносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФинансовыйУчетПлановыеНачисленияПоДоговорам КАК ФинансовыйУчетПлановыеНачисленияПоДоговорам
	|		ПО (Взносы.Начисление = &НачислениеДоговор)
	|			И Взносы.Период = ФинансовыйУчетПлановыеНачисленияПоДоговорам.Период
	|			И Взносы.Сотрудник = ФинансовыйУчетПлановыеНачисленияПоДоговорам.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдержаннаяЗарплата.Период,
	|	УдержаннаяЗарплата.Сотрудник,
	|	УдержаннаяЗарплата.Подразделение
	|ИЗ
	|	ВТУдержаннаяЗарплата КАК УдержаннаяЗарплата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Займы.Период,
	|	Займы.Сотрудник,
	|	Займы.Подразделение
	|ИЗ
	|	ВТЗаймы КАК Займы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Обучение.Период,
	|	Обучение.Сотрудник,
	|	Обучение.Подразделение
	|ИЗ
	|	ВТОбучение КАК Обучение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиПериодыПредварительно.Период КАК Период,
	|	СотрудникиПериодыПредварительно.Сотрудник КАК Сотрудник,
	|	СотрудникиПериодыПредварительно.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТСотрудникиПериоды
	|ИЗ
	|	ВТСотрудникиПериодыПредварительно КАК СотрудникиПериодыПредварительно";
	
	Запрос.Выполнить();
	
	СоздатьВТСведенияОФинансовомУчетеСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиПериоды");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОФинансовомУчетеСотрудников.*
	|ИЗ
	|	ВТСведенияОФинансовомУчетеСотрудников КАК СведенияОФинансовомУчетеСотрудников";
	
	СведенияОФинансовомУчетеСотрудников = Запрос.Выполнить().Выгрузить();
	СпособыОтражения = ОбщегоНазначения.ВыгрузитьКолонку(СведенияОФинансовомУчетеСотрудников, "СпособОтражения", Истина);
	
	Если ЕстьДоговоры Тогда
		СпособыОтраженияДоговоры = ОбщегоНазначения.ВыгрузитьКолонку(
			СведенияОПлановыхНачисленияхПоДоговорам, "СпособОтражения", Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СпособыОтражения, СпособыОтраженияДоговоры, Истина);
	КонецЕсли;
	
	СведенияОВыплатах = СведенияОВыплатах(МенеджерВременныхТаблиц);
	ЕстьВыплаты = СведенияОВыплатах.Количество() > 0;
	Если ЕстьВыплаты Тогда
		СпособыОтраженияВыплаты = ОбщегоНазначения.ВыгрузитьКолонку(СведенияОВыплатах, "СпособОтражения", Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СпособыОтражения, СпособыОтраженияВыплаты, Истина);
	КонецЕсли;
	
	// В таблице обучения могут быть уже заполненные способы отражения
	СпособыОтраженияОбучение = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеДляОтражения.Обучение, "СпособОтражения", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СпособыОтражения, СпособыОтраженияОбучение, Истина);
	
	ДанныеСпособовОтражения = ДанныеСпособовОтражения(СпособыОтражения);
	
	Для Каждого КлючИЗначение Из ДанныеДляОтражения Цикл
		ИмяТаблицы = КлючИЗначение.Ключ;
		ВременнаяТаблица = ДанныеДляОтражения[ИмяТаблицы].Скопировать();
		ДанныеДляОтражения[ИмяТаблицы].Очистить();
		Для Каждого СтрокаВременнойТаблицы Из ВременнаяТаблица Цикл
			РаспределяемаяСумма = СтрокаВременнойТаблицы.Сумма;
			Если РаспределяемаяСумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если (ИмяТаблицы = "Зарплата" Или ИмяТаблицы = "СтраховыеВзносы") Тогда
				Если ЕстьДоговоры И СтрокаВременнойТаблицы.Начисление = НачислениеДоговор Тогда
					ОтборСтрок = Новый Структура("Период, Сотрудник");
					ОтборСтрок.Период = ПериодРегистрации;
					ОтборСтрок.Сотрудник = СтрокаВременнойТаблицы.Сотрудник;
					Если ИмяТаблицы = "Зарплата" Тогда
						ОтборСтрок.Вставить("ДоговорАкт", СтрокаВременнойТаблицы.ДокументОснование);
					КонецЕсли;
					СтрокиДоговоры = СведенияОПлановыхНачисленияхПоДоговорам.НайтиСтроки(ОтборСтрок);
					Если СтрокиДоговоры.Количество() > 0 Тогда
						СтрокаДоговор = СтрокиДоговоры[0];
						СтрокаВременнойТаблицы.Подразделение = СтрокаДоговор.Подразделение;
						Если ЗначениеЗаполнено(СтрокаДоговор.СпособОтражения) Тогда
							НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
							НоваяСтрока.СпособОтражения = СтрокаДоговор.СпособОтражения;
							ДанныеСпособаОтражения = ДанныеСпособовОтражения.Получить(СтрокаДоговор.СпособОтражения);
							НоваяСтрока.НаправлениеДеятельности = ДанныеСпособаОтражения.НаправлениеДеятельности;
							НоваяСтрока.АналитикаРасходов = ДанныеСпособаОтражения.АналитикаРасходов;
							НоваяСтрока.СтатьяРасходов = ДанныеСпособаОтражения[ИмяТаблицы];
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ЕстьВыплаты И ТипЗнч(СтрокаВременнойТаблицы.Начисление) = Тип("СправочникСсылка.ВидыВыплатБывшимСотрудникам") Тогда
					ОтборСтрок = Новый Структура("Период, Начисление, ФизическоеЛицо");
					ОтборСтрок.Период = СтрокаВременнойТаблицы.ДатаНачала;
					ОтборСтрок.Начисление = СтрокаВременнойТаблицы.Начисление;
					ОтборСтрок.ФизическоеЛицо = СтрокаВременнойТаблицы.ФизическоеЛицо;
					Если ИмяТаблицы = "Зарплата" Тогда
						ОтборСтрок.Вставить("ДокументОснование", СтрокаВременнойТаблицы.ДокументОснование);
					КонецЕсли;
					СтрокиВыплаты = СведенияОВыплатах.НайтиСтроки(ОтборСтрок);
					Если СтрокиВыплаты.Количество() > 0 Тогда
						СтрокаВыплаты = СтрокиВыплаты[0];
						Если ЗначениеЗаполнено(СтрокаВыплаты.Подразделение) Тогда
							СтрокаВременнойТаблицы.Подразделение = СтрокаВыплаты.Подразделение;
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаВыплаты.СпособОтражения) Тогда
							НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
							НоваяСтрока.СпособОтражения = СтрокаВыплаты.СпособОтражения;
							ДанныеСпособаОтражения = ДанныеСпособовОтражения.Получить(СтрокаВыплаты.СпособОтражения);
							НоваяСтрока.НаправлениеДеятельности = ДанныеСпособаОтражения.НаправлениеДеятельности;
							НоваяСтрока.АналитикаРасходов = ДанныеСпособаОтражения.АналитикаРасходов;
							НоваяСтрока.СтатьяРасходов = ДанныеСпособаОтражения[ИмяТаблицы];
							Продолжить;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ИмяТаблицы = "Обучение" И ЗначениеЗаполнено(СтрокаВременнойТаблицы.СпособОтражения) Тогда
				НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
				ДанныеСпособаОтражения = ДанныеСпособовОтражения.Получить(СтрокаВременнойТаблицы.СпособОтражения);
				НоваяСтрока.НаправлениеДеятельности = ДанныеСпособаОтражения.НаправлениеДеятельности;
				НоваяСтрока.АналитикаРасходов = ДанныеСпособаОтражения.АналитикаРасходов;
				НоваяСтрока.СтатьяРасходов = ДанныеСпособаОтражения[ИмяТаблицы];
				Продолжить;
			КонецЕсли;
			
			ОтборСтрок = Новый Структура("Сотрудник, Подразделение");
			ЗаполнитьЗначенияСвойств(ОтборСтрок, СтрокаВременнойТаблицы);
			СтрокиРаспределения = СведенияОФинансовомУчетеСотрудников.НайтиСтроки(ОтборСтрок);
			КоличествоСтрокРаспределения = СтрокиРаспределения.Количество();
			Если КоличествоСтрокРаспределения = 0 Тогда
				// Нет данных для распределения - переносим "как есть".
				ЗаполнитьЗначенияСвойств(ДанныеДляОтражения[ИмяТаблицы].Добавить(), СтрокаВременнойТаблицы);
				Продолжить;
			КонецЕсли;
			МассивКоэффициентов = ОбщегоНазначения.ВыгрузитьКолонку(СтрокиРаспределения, "ДоляРаспределения");
			МассивСумм = ЗарплатаКадрыКлиентСервер.РаспределитьПропорциональноКоэффициентам(РаспределяемаяСумма, МассивКоэффициентов);
			Индекс = 0;
			СуммаПропорциональноКоличествуСтрок = РаспределяемаяСумма / КоличествоСтрокРаспределения;
			Пока Индекс < КоличествоСтрокРаспределения Цикл
				НоваяСтрока = ДанныеДляОтражения[ИмяТаблицы].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВременнойТаблицы);
				СтрокаРаспределения = СтрокиРаспределения[Индекс];
				ДанныеСпособаОтражения = ДанныеСпособовОтражения.Получить(СтрокаРаспределения.СпособОтражения);
				НоваяСтрока.СпособОтражения = СтрокаРаспределения.СпособОтражения;
				НоваяСтрока.НаправлениеДеятельности =
					?(ДанныеСпособаОтражения <> Неопределено И ЗначениеЗаполнено(ДанныеСпособаОтражения.НаправлениеДеятельности),
					ДанныеСпособаОтражения.НаправлениеДеятельности, СтрокаРаспределения.НаправлениеДеятельности);
				НоваяСтрока.АналитикаРасходов =
					?(ДанныеСпособаОтражения <> Неопределено И ЗначениеЗаполнено(ДанныеСпособаОтражения.АналитикаРасходов),
					ДанныеСпособаОтражения.АналитикаРасходов, СтрокаРаспределения.АналитикаРасходов);
				НоваяСтрока.СтатьяРасходов =
					?(ДанныеСпособаОтражения <> Неопределено И ЗначениеЗаполнено(ДанныеСпособаОтражения[ИмяТаблицы]),
					ДанныеСпособаОтражения[ИмяТаблицы], СтрокаРаспределения[ИмяТаблицы]);
				Если МассивСумм = Неопределено Тогда
					НоваяСтрока.Сумма = СуммаПропорциональноКоличествуСтрок;
				Иначе
					НоваяСтрока.Сумма = МассивСумм[Индекс];
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОПлановыхНачисленияхПоДоговорам(Запрос)
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Зарплата.Период КАК Период,
		|	Зарплата.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудникиПериодыДоговора
		|ИЗ
		|	ВТЗарплата КАК Зарплата
		|ГДЕ
		|	Зарплата.Начисление = &НачислениеДоговор
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Взносы.Период,
		|	Взносы.Сотрудник
		|ИЗ
		|	ВТВзносы КАК Взносы
		|ГДЕ
		|	Взносы.Начисление = &НачислениеДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таблица.Период КАК Период,
		|	ФинансовыйУчетПлановыеНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	ФинансовыйУчетПлановыеНачисленияПоДоговорам.ДоговорАкт КАК ДоговорАкт,
		|	ФинансовыйУчетПлановыеНачисленияПоДоговорам.СпособОтражения КАК СпособОтражения,
		|	ФинансовыйУчетПлановыеНачисленияПоДоговорам.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ ВТФинансовыйУчетПлановыеНачисленияПоДоговорам
		|ИЗ
		|	ВТСотрудникиПериодыДоговора КАК Таблица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыйУчетПлановыеНачисленияПоДоговорам КАК ФинансовыйУчетПлановыеНачисленияПоДоговорам
		|		ПО Таблица.Период = ФинансовыйУчетПлановыеНачисленияПоДоговорам.МесяцНачисления
		|			И Таблица.Сотрудник = ФинансовыйУчетПлановыеНачисленияПоДоговорам.Сотрудник";
	
	// АПК:96 -вкл
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам.Период КАК Период,
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам.Сотрудник КАК Сотрудник,
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам.ДоговорАкт КАК ДоговорАкт,
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам.СпособОтражения КАК СпособОтражения,
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам.Подразделение КАК Подразделение
		|ИЗ
		|	ВТФинансовыйУчетПлановыеНачисленияПоДоговорам КАК ВТФинансовыйУчетПлановыеНачисленияПоДоговорам";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СведенияОВыплатах(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Зарплата.Период КАК Период,
		|	Зарплата.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Зарплата.Начисление КАК Начисление,
		|	Зарплата.ДокументОснование КАК ДокументОснование,
		|	ФинансовыйУчетПервичныхДокументов.СпособОтражения КАК СпособОтражения,
		|	ФинансовыйУчетПервичныхДокументов.Подразделение КАК Подразделение
		|ИЗ
		|	ВТЗарплата КАК Зарплата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ФинансовыйУчетПервичныхДокументов КАК
		|			ФинансовыйУчетПервичныхДокументов
		|		ПО Зарплата.ДокументОснование = ФинансовыйУчетПервичныхДокументов.ДокументОснование
		|		И Зарплата.Период = ФинансовыйУчетПервичныхДокументов.ПериодРегистрации
		|		И Зарплата.ФизическоеЛицо = ФинансовыйУчетПервичныхДокументов.ФизическоеЛицо
		|		И Зарплата.Начисление = ФинансовыйУчетПервичныхДокументов.НачислениеУдержание
		|ГДЕ
		|	ФинансовыйУчетПервичныхДокументов.СпособОтражения <> ЗНАЧЕНИЕ(Справочник.СпособыОтраженияВФинансовомУчете.ПустаяСсылка)
		|	ИЛИ ФинансовыйУчетПервичныхДокументов.Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеСпособовОтражения(СпособыОтражения = Неопределено)
	
	СоответствиеДанныхСпособамОтражения = Новый Соответствие;
	
	Если ТипЗнч(СпособыОтражения) = Тип("СправочникСсылка.СпособыОтраженияВФинансовомУчете") Тогда
		СписокСпособовОтражения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СпособыОтражения);
	Иначе
		СписокСпособовОтражения = СпособыОтражения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СпособыОтраженияВФинансовомУчете.Ссылка КАК СпособОтражения,
		|	СпособыОтраженияВФинансовомУчете.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	СпособыОтраженияВФинансовомУчете.АналитикаРасходов КАК АналитикаРасходов,
		|	СпособыОтраженияВФинансовомУчетеКатегорииСтатейРасходов.КатегорияРасходов КАК Категория,
		|	СпособыОтраженияВФинансовомУчетеКатегорииСтатейРасходов.СтатьяРасходов КАК СтатьяРасходов
		|ИЗ
		|	Справочник.СпособыОтраженияВФинансовомУчете.КатегорииСтатейРасходов КАК
		|		СпособыОтраженияВФинансовомУчетеКатегорииСтатейРасходов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияВФинансовомУчете КАК СпособыОтраженияВФинансовомУчете
		|		ПО СпособыОтраженияВФинансовомУчетеКатегорииСтатейРасходов.Ссылка = СпособыОтраженияВФинансовомУчете.Ссылка
		|		И
		|			СпособыОтраженияВФинансовомУчетеКатегорииСтатейРасходов.КатегорияРасходов <> ЗНАЧЕНИЕ(Перечисление.КатегорииРасходовНаПерсонал.ПустаяСсылка)
		|ГДЕ
		|	(СпособыОтраженияВФинансовомУчете.Ссылка В (&СпособыОтражения)
		|	ИЛИ &ПоВсемСпособамОтражения)
		|ИТОГИ
		|	МАКСИМУМ(АналитикаРасходов) КАК АналитикаРасходов,
		|	МАКСИМУМ(НаправлениеДеятельности) КАК НаправлениеДеятельности
		|ПО
		|	СпособОтражения";
	
	Запрос.УстановитьПараметр("СпособыОтражения", СписокСпособовОтражения);
	Запрос.УстановитьПараметр("ПоВсемСпособамОтражения", СписокСпособовОтражения = Неопределено);
	
	ВыборкаПоСпособамОтражения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСпособамОтражения.Следующий() Цикл
		ДанныеСпособаОтражения = ОписаниеСпособаОтражения();
		ЗаполнитьЗначенияСвойств(ДанныеСпособаОтражения, ВыборкаПоСпособамОтражения);
		
		ВыборкаПоКатегориям = ВыборкаПоСпособамОтражения.Выбрать();
		Пока ВыборкаПоКатегориям.Следующий() Цикл
			ИмяКатегории = ОбщегоНазначения.ИмяЗначенияПеречисления(ВыборкаПоКатегориям.Категория);
			ДанныеСпособаОтражения[ИмяКатегории] = ВыборкаПоКатегориям.СтатьяРасходов;
		КонецЦикла;
		СоответствиеДанныхСпособамОтражения.Вставить(ВыборкаПоСпособамОтражения.СпособОтражения, ДанныеСпособаОтражения);
	КонецЦикла;
	
	Возврат СоответствиеДанныхСпособамОтражения;
	
КонецФункции

Функция ОписаниеСпособаОтражения()
	
	ДанныеСпособаОтражения = Новый Структура();
	ДанныеСпособаОтражения.Вставить("СпособОтражения");
	ДанныеСпособаОтражения.Вставить("НаправлениеДеятельности");
	ДанныеСпособаОтражения.Вставить("АналитикаРасходов");
	ДанныеСпособаОтражения.Вставить("Зарплата");
	ДанныеСпособаОтражения.Вставить("СтраховыеВзносы");
	ДанныеСпособаОтражения.Вставить("УдержаннаяЗарплата");
	ДанныеСпособаОтражения.Вставить("Займы");
	ДанныеСпособаОтражения.Вставить("Обучение");
	
	Возврат ДанныеСпособаОтражения;
	
КонецФункции

Процедура ОбработатьТаблицыУдержанийЗаймовОбучения(ТаблицаУдержаннаяЗарплата, ТаблицаЗаймов, ТаблицаОбучения)
	
	УдержанияФинансовогоУчета = Перечисления.ВидыОперацийПоЗарплате.УдержанияФинансовыйУчет();
	
	УдержанияВидыРасчета = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаУдержаннаяЗарплата, "Удержание", Истина);
	Сч = УдержанияВидыРасчета.Количество() - 1;
	Пока Сч >= 0 Цикл
		Если ТипЗнч(УдержанияВидыРасчета[Сч]) <> Тип("ПланВидовРасчетаСсылка.Удержания") Тогда
			УдержанияВидыРасчета.Удалить(Сч);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	КатегорииУдержаний = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(УдержанияВидыРасчета, "КатегорияУдержания");
	
	Сч = ТаблицаУдержаннаяЗарплата.Количество() - 1;
	Пока Сч >= 0 Цикл
		СтрокаУдержаний = ТаблицаУдержаннаяЗарплата[Сч];
		Сч = Сч - 1;
		Если УдержанияФинансовогоУчета.Найти(СтрокаУдержаний.ВидОперации) = Неопределено Тогда
			ТаблицаУдержаннаяЗарплата.Удалить(СтрокаУдержаний);
		ИначеЕсли СтрокаУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПогашениеЗаймов
			Или СтрокаУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.ПроцентыПоЗайму Тогда
			
			СтрокаУдержаний.Сумма = - СтрокаУдержаний.Сумма;
			ЗаполнитьЗначенияСвойств(ТаблицаЗаймов.Добавить(), СтрокаУдержаний);
			ТаблицаУдержаннаяЗарплата.Удалить(СтрокаУдержаний);
		ИначеЕсли СтрокаУдержаний.ВидОперации = Перечисления.ВидыОперацийПоЗарплате.УдержаниеПоПрочимОперациямСРаботниками
			И КатегорииУдержаний.Получить(СтрокаУдержаний.Удержание) = Перечисления.КатегорииУдержаний.ОбязательстваПоУченическомуДоговору Тогда
			
			СтрокаУдержаний.Сумма = - СтрокаУдержаний.Сумма;
			ЗаполнитьЗначенияСвойств(ТаблицаОбучения.Добавить(), СтрокаУдержаний);
			ТаблицаУдержаннаяЗарплата.Удалить(СтрокаУдержаний);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуОбучения(ТаблицаОбучения, Подразделение, ПериодРегистрации, БезОтбораПоПодразделению)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("БезОтбораПоПодразделению", БезОтбораПоПодразделению);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФинансовыйУчетОбучениеСотрудников.Подразделение КАК Подразделение,
		|	ФинансовыйУчетОбучениеСотрудников.ДатаНачала КАК ДатаНачала,
		|	ФинансовыйУчетОбучениеСотрудников.Сотрудник КАК Сотрудник,
		|	ФинансовыйУчетОбучениеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФинансовыйУчетОбучениеСотрудников.СуммаРасходов КАК СуммаРасходов,
		|	ФинансовыйУчетОбучениеСотрудников.СпособОтражения КАК СпособОтражения
		|ПОМЕСТИТЬ ВТФинансовыйУчетОбучениеСотрудников
		|ИЗ
		|	РегистрСведений.ФинансовыйУчетОбучениеСотрудников КАК ФинансовыйУчетОбучениеСотрудников
		|ГДЕ
		|	ФинансовыйУчетОбучениеСотрудников.ДатаНачала МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
		|	И (&БезОтбораПоПодразделению
		|			ИЛИ ФинансовыйУчетОбучениеСотрудников.Подразделение В
		|				(ВЫБРАТЬ
		|					ПодчиненностьСтруктурныхЕдиниц.ВышестоящаяСтруктурнаяЕдиница
		|				ИЗ
		|					РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ПодчиненностьСтруктурныхЕдиниц
		|				ГДЕ
		|					ПодчиненностьСтруктурныхЕдиниц.СтруктурнаяЕдиница В (&Подразделение))
		|			ИЛИ ФинансовыйУчетОбучениеСотрудников.Подразделение В ИЕРАРХИИ (&Подразделение))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&ПериодРегистрации КАК Период,
		|	ФинансовыйУчетОбучениеСотрудников.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудникиОбучение
		|ИЗ
		|	ВТФинансовыйУчетОбучениеСотрудников КАК ФинансовыйУчетОбучениеСотрудников";
	
	Запрос.Выполнить();
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОбучение"),
		Ложь,
		"ФизическоеЛицо, МестоВСтруктуреПредприятия");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия КАК Подразделение,
		|	ФинансовыйУчетОбучениеСотрудников.ДатаНачала КАК ДатаНачала,
		|	ФинансовыйУчетОбучениеСотрудников.Сотрудник КАК Сотрудник,
		|	ФинансовыйУчетОбучениеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ФинансовыйУчетОбучениеСотрудников.СуммаРасходов КАК Сумма,
		|	ФинансовыйУчетОбучениеСотрудников.СпособОтражения КАК СпособОтражения
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФинансовыйУчетОбучениеСотрудников КАК ФинансовыйУчетОбучениеСотрудников
		|		ПО КадровыеДанныеСотрудников.ФизическоеЛицо = ФинансовыйУчетОбучениеСотрудников.ФизическоеЛицо
		|			И КадровыеДанныеСотрудников.Сотрудник = ФинансовыйУчетОбучениеСотрудников.Сотрудник
		|			И (КадровыеДанныеСотрудников.МестоВСтруктуреПредприятия В ИЕРАРХИИ (&Подразделение))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОбучения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуЗаймов(ТаблицаЗаймов, Подразделения, ОрганизацииПодразделения, ПериодРегистрации)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаймыСотрудникам.СоздатьВТВыданныеЗаймы(МенеджерВременныхТаблиц, ПериодРегистрации, ОрганизацииПодразделения);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"КадроваяИсторияСотрудников",
		МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТВыданныеЗаймы",
			"ФизическоеЛицо"),
		ПараметрыПостроения);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Позиции", ОрганизационнаяСтруктура.ПозицииПодразделений(Подразделения,
		ПериодРегистрации).ВыгрузитьКолонку("Позиция"));
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыданныеЗаймы.Период КАК ДатаНачала,
	|	ВыданныеЗаймы.ФизическоеЛицо,
	|	ВыданныеЗаймы.ВыданнаяСумма КАК Сумма,
	|	ЕСТЬNULL(КадроваяИсторияСрезПоследних.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
	|	ЕСТЬNULL(КадроваяИсторияСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(КадроваяИсторияСрезПоследних.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)) КАК
	|		ПодразделениеОрганизации
	|ИЗ
	|	ВТВыданныеЗаймы КАК ВыданныеЗаймы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадроваяИсторияСотрудниковСрезПоследних КАК КадроваяИсторияСрезПоследних
	|		ПО ВыданныеЗаймы.Период = КадроваяИсторияСрезПоследних.Период
	|		И ВыданныеЗаймы.ФизическоеЛицо = КадроваяИсторияСрезПоследних.ФизическоеЛицо
	|		И КадроваяИсторияСрезПоследних.ДолжностьПоШтатномуРасписанию В (&Позиции)";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаЗаймов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВычестьРанееЗарегистрированныеДанные(РезультатОтражения, ПериодРегистрации, Подразделение, ИсключаемыйРегистратор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЕстьОтборПоПодразделению", ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Таблица.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	#ИмяТаблицы КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеРасходовНаПерсонал КАК Документ
	|		ПО Таблица.Ссылка = Документ.Ссылка
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ЕстьОтборПоПодразделению
	|			ТОГДА Таблица.Подразделение В ИЕРАРХИИ (&Подразделение)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И Документ.ПериодРегистрации = &ПериодРегистрации
	|	И Документ.Ссылка <> &ИсключаемыйРегистратор
	|	И Документ.Проведен
	|	И НЕ Документ.ПометкаУдаления";
	
	Первый = Истина;
	Для каждого ЭлементКоллекции Из РезультатОтражения Цикл
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,"#ИмяТаблицы","Документ.ОтражениеРасходовНаПерсонал." + ИмяТаблицы(ЭлементКоллекции));
		Если Первый Тогда
			Запрос.Текст = ТекстЗапроса;
			Первый = Ложь;
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РАЗРЕШЕННЫЕ", "");
			Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" + ТекстЗапроса;
		КонецЕсли;
	КонецЦикла;
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонТекстаЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Таблица.ИмяПоля КАК ИмяПоля
	|ИЗ
	|	#ИмяТаблицы КАК Таблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтражениеРасходовНаПерсонал КАК Документ
	|			ПО Таблица.Ссылка = Документ.Ссылка
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ЕстьОтборПоПодразделению
	|			ТОГДА Таблица.Подразделение В ИЕРАРХИИ (&Подразделение)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И Документ.ПериодРегистрации = &ПериодРегистрации
	|	И Документ.Ссылка <> &ИсключаемыйРегистратор
	|	И Документ.Проведен
	|	И НЕ Документ.ПометкаУдаления";
	
	Для каждого ЭлементКоллекции Из РезультатОтражения Цикл
		Таблица = ЭлементКоллекции.Значение;
		
		ПоляЗапроса = Новый Массив;
		Для каждого КолонкаТЗ Из Таблица.Колонки Цикл
			ИмяПоля = КолонкаТЗ.Имя;
			Если КолонкаТЗ.ТипЗначения.СодержитТип(Тип("Число")) Тогда
				ПоляЗапроса.Добавить("-Таблица." + ИмяПоля + " КАК " + ИмяПоля);
			Иначе
				ПоляЗапроса.Добавить("Таблица." + ИмяПоля + " КАК " + ИмяПоля);
			КонецЕсли;
		КонецЦикла;
		ПоляЗапроса = СтрСоединить(ПоляЗапроса, "," + Символы.ПС);
		
		ТекстЗапроса = СтрЗаменить(ШаблонТекстаЗапроса,"Таблица.ИмяПоля КАК ИмяПоля",ПоляЗапроса);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"#ИмяТаблицы","Документ.ОтражениеРасходовНаПерсонал." + ИмяТаблицы(ЭлементКоллекции));
		
		Запрос.Текст = ТекстЗапроса;
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Выборка);
			КонецЦикла;
			ОтражениеЗарплатыВУчете.СвернутьТаблицу(Таблица);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ИмяТаблицы(Знач ЭлементКоллекции)
	
	Если ЭлементКоллекции.Ключ = "Зарплата" Тогда
		Возврат "НачисленнаяЗарплата";
	ИначеЕсли ЭлементКоллекции.Ключ = "СтраховыеВзносы" Тогда
		Возврат "Взносы";
	КонецЕсли;
	
	Возврат ЭлементКоллекции.Ключ;

КонецФункции

#КонецОбласти
