#Область ПрограммныйИнтерфейс

// Открывает форму создания нового электронного курса.
// 
// Параметры:
//   Тип - ПеречислениеСсылка.ТипыЭлектронныхКурсов - Тип курса, который надо создать.
//   ВладелецФормыКурса - УправляемаяФорма - необязательный, форма-источник команды. 
//                        Для данного элемента будет вызвано событие ОбработкаЗаписиНового.
//   КонтекстРедактирования - Структура - произвольные данные, связанные с созданием курса.
//                            Будут возвращены в процедуру
//                            ИзучениеЭлектронныхКурсовПереопределяемый.ПриЗаписиЭлектронногоКурса.
//
Процедура СоздатьЭлектронныйКурс(Тип, ВладелецФормыКурса = Неопределено, КонтекстРедактирования = Неопределено) Экспорт	
	ИзучениеЭлектронныхКурсовСлужебныйКлиент.СоздатьЭлектронныйКурс(Тип, ВладелецФормыКурса, КонтекстРедактирования);
КонецПроцедуры

// Копирует электронный курс.
// 
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Копируемый курс.
//   ВладелецФормыКурса - УправляемаяФорма - необязательный, форма-источник команды. 
//                        Для данного элемента будет вызвано событие ОбработкаЗаписиНового.
//   КонтекстРедактирования - Структура - произвольные данные, связанные с созданием курса.
//                            Будут возвращены в процедуру
//                            ИзучениеЭлектронныхКурсовПереопределяемый.ПриЗаписиЭлектронногоКурса.
//
Процедура СкопироватьЭлектронныйКурс(ЭлектронныйКурс, ВладелецФормыКурса = Неопределено, КонтекстРедактирования = Неопределено) Экспорт	
	ИзучениеЭлектронныхКурсовСлужебныйКлиент.СкопироватьЭлектронныйКурс(ЭлектронныйКурс, ВладелецФормыКурса, КонтекстРедактирования);
КонецПроцедуры

// Открывает форму тестового вопроса.
// 
// Параметры:
//   ПараметрыФормы - Структура - параметры формы тестового вопроса.
//     * Ключ - СправочникСсылка.ТестовыеВопросы - ссылка на тестовый вопрос, который нужно отредактировать.
//     * ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - ссылка на курс, который сейчас редактируется.
//     * Тест - СправочникСсылка.ЭлектронныеТесты - ссылка на тест, в который вставлен вопрос.
//     * Страница - СправочникСсылка.СтраницыЭлементовЭлектронныхКурсов - страница теста.
//     * КонтекстРедактирования - Произвольный - произвольные данные, связанные с созданием курса.
//   ВладелецФормы - УправляемаяФорма - форма или элемент управления другой формы.
//
Процедура ОткрытьТестовыйВопрос(ПараметрыФормы, ВладелецФормы = Неопределено) Экспорт		
	ОткрытьФорму("Справочник.ТестовыеВопросы.Форма.ФормаЭлемента", ПараметрыФормы, ВладелецФормы);		
КонецПроцедуры

#КонецОбласти