#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриНачальномЗаполненииДанныхПодсистемыЭкспертнаяОценкаПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "f7a4c92f-1d56-4960-9e93-b6516d1aee9e", Метаданные.Справочники.ОпросыПоКомпетенциям);
	
КонецПроцедуры

#КонецОбласти

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.10";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a8b4273c-a1ab-4ff0-8a11-e694ebb09c8d");
	Обработчик.Процедура = "ЭкспертнаяОценкаПерсонала.ПриНачальномЗаполненииДанныхПодсистемыЭкспертнаяОценкаПерсонала";
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных экспертной оценки персонала.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение данных подсистемы экспертная оценка персонала
//
Процедура ПриНачальномЗаполненииДанныхПодсистемыЭкспертнаяОценкаПерсонала(ПараметрыОбновления = Неопределено) Экспорт

	СоздатьИЗаполнитьГруппуДоступаЭксперта();

КонецПроцедуры

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ОпросыПоКомпетенциям, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|Справочник.ОпросыПоКомпетенциям.Чтение.ГруппыФизическихЛиц
		|Справочник.ОпросыПоКомпетенциям.Чтение.Подразделения
		|Справочник.ОпросыПоКомпетенциям.Изменение.ГруппыФизическихЛиц
		|Справочник.ОпросыПоКомпетенциям.Изменение.Подразделения";
	
КонецПроцедуры

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	ОписаниеПрофиля = ОписаниеПрофиляЭксперт();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);

КонецПроцедуры

#КонецОбласти

// См. ИнформацияПриЗапускеПереопределяемый.ОпределитьНастройки.
Процедура ОпределитьНастройки(Настройки) Экспорт

	Если ЭкспертнаяОценкаПерсоналаВызовСервера.ЗапуститьПолноэкранноеРабочееМесто() Тогда
		Настройки.Показывать = Ложь;
	КонецЕсли;

КонецПроцедуры

// Обработчик заполнения адресов электронной почты экспертов в опросе по компетенциям
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//  МассивФизическихЛиц - Массив из СправочникСсылка.ФизическиеЛица - эксперты у которых требуется заполнить адрес электронной почты.
//  СтандартнаяОбработка - Булево - если установить Ложь, то стандартная обработка заполнения не будет выполнена.
//
Процедура ПриЗаполненииЭлектроннойПочтыЭкспертов(Форма, МассивФизическихЛиц, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается при создании формы опроса по компетенциям
//
// Параметры:
//	РолиЭкспертов - Массив, СправочникСсылка.РолиРеспондентаОценкиПерсонала.
//
Процедура ПриЗаполненииРолейЭкспертовВОпросе(РолиЭкспертов) Экспорт
	
КонецПроцедуры

// Обработчик заполнения адресов электронной почты экспертов в опросе по компетенциям
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения.
//
Процедура ПриЗаполненииПользователейЭкспертов(Форма) Экспорт
	
КонецПроцедуры

Функция РезультатыЭкспертнойОценки(Оцениваемые) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОпросы
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо В(&Оцениваемые)
		|	И ОпросыПоКомпетенциямОцениваемые.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка.ДатаНачала УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям КАК ОпросПоКомпетенциям,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности КАК ПрофильДолжности,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|		КОНЕЦ) КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо В(&Оцениваемые)
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям В
		|			(ВЫБРАТЬ
		|				ВТОпросы.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТОпросы КАК ВТОпросы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ПрофильДолжности,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("Оцениваемые", Оцениваемые);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДополнитьХарактеристикиОценками(Форма) Экспорт
	
	Если Форма.Характеристики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Объект.Основание) Тогда
		ДополнитьХарактеристикиОценкамиОтветовОпросаПоКомпетенциям(Форма);
	Иначе
		ДополнитьХарактеристикиРезультатамиЭкспертнойОценкиПерсонала(Форма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Служебный программный интерфейс.

// Возвращает структуру с демонстрационными текстами для шаблона анкеты нового опроса по компетенциям.
//
Функция ДемонстрационныеТекстыОпросаПоКомпетенциям(НаименованиеОпроса) Экспорт
	
	ДемонстрационныеТексты = Новый Структура;
	
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов 
	
	// Шаблон анкеты
	
	АнкетаЗаголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Анкета опроса по компетенциям %1'"), НаименованиеОпроса);
	
	АнкетаВступление =
	НСтр("ru = 'Вы приступаете к оценке сотрудника путем опроса по компетенциям. Вам предстоит ответить на несколько вопросов об этом человеке.
          |
          |Чтобы оценка сотрудника была максимально объективной, важно, чтобы на вопросы отвечали именно Вы, без посторонней помощи.
          |
          |Если потребуется, заполнение анкеты можно прервать, пока редактирование анкеты не завершено, к ней можно перейти из списка доступных анкет.'");
	
	АнкетаЗаключение =
	НСтр("ru = 'Заполнение анкеты завершено. Если Вы ответили на все вопросы, можно завершить редактирование анкеты. 
          |Вернуться к заполнению анкеты будет невозможно.'");
	
	ДемонстрационныеТексты.Вставить("ШаблонАнкетыЗаголовок", АнкетаЗаголовок);
	ДемонстрационныеТексты.Вставить("ШаблонАнкетыВступление", АнкетаВступление);
	ДемонстрационныеТексты.Вставить("ШаблонАнкетыЗаключение", АнкетаЗаключение);
	
	// АПК:1223-вкл. 
	
	Возврат ДемонстрационныеТексты;
	
КонецФункции

// Возвращает структуру с демонстрационными текстами для шаблона сообщения нового мероприятия.
//
Функция ДемонстрационныеТекстыШаблоныСообщений() Экспорт
	
	ДемонстрационныеТексты = Новый Структура;
	
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов 
	
	// Шаблон сообщений
	
	ТемаПисьма = НСтр("ru = 'Приглашение к участию в ""[ОпросыПоКомпетенциям.Наименование]""'");
	
	ТекстШаблонаПисьма = НСтр("ru = '<HTML><BODY>Уважаемый(ая) [ФизическиеЛица.Имя] [ФизическиеЛица.Отчество]!
	|<BR>Мы приглашаем вас принять участие в экспертной оценке по компетенциям <b>""[ОпросыПоКомпетенциям.Наименование]""</b>.
	|Вам потребуется ответить на несколько вопросов, содержащихся в анкете, чтобы оценить характеристики одного из наших сотрудников.
	|Вы можете приступить к опросу частями и в любое удобное время. Анкеты, которые вы начнете заполнять, будут доступны в списке доступных анкет до тех пор, пока вы не завершите их редактирование.
	|Обратите внимание, что дата окончания опроса - <b>[ОпросыПоКомпетенциям.ДатаОкончания]</b><BR>После этой даты анкеты больше не будут доступны для заполнения.
	|Если у вас возникнут вопросы, вы всегда можете обратиться к ответственному лицу за проведение этого мероприятия, <b>[ОпросыПоКомпетенциям.Ответственный]</b>. Он с удовольствием ответит на все ваши вопросы.
	|Чтобы приступить к работе, пожалуйста, перейдите по <a href=""[Произвольные.ВебСсылкаАнкетирования]"">этой ссылке</a>. Если ссылка не работает, вы можете скопировать ее и вставить в адресную строку вашего браузера.
	|Заранее благодарим вас за участие в нашем опросе!
	|<P>С уважением, Служба персонала<BR></P></BODY></HTML>'");
	
	ДемонстрационныеТексты.Вставить("Тема", ТемаПисьма);
	ДемонстрационныеТексты.Вставить("Текст", ТекстШаблонаПисьма);
	
	// АПК:1223-вкл. 
	
	Возврат ДемонстрационныеТексты;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры расчета оценок.

// Заполняет регистры сведений оценок персонала
// "ОценкиОтветовОпросаПоКомпетенциям", "РезультатыЭкспертнойОценкиПерсонала" по содержимому ОтветыНаВопросыАнкет.
// передаваемые параметры
// 	Мероприятие - тип СправочникСсылка.ОпросыПоКомпетенциям - опрос, в рамках которого необходимо произвести пересчет
//  Анкета - тип ДокументСсылка.Анкета - анкета, в рамках ответов которой необходимо произвести пересчет
//	Удаление - тип булево - признак того, что произошла отмена проведения документа Анкеты.
Процедура РассчитатьОценкиПоОтветам(Опрос, Анкета, Удаление) Экспорт
	
	РассчитатьОценкиОтветовНаВопросыАнкет(Опрос, Анкета, Удаление);
	РассчитатьРезультатыОценкиСотрудников(Опрос);
	
КонецПроцедуры

Процедура РассчитатьОценкиОтветовНаВопросыАнкет(Опрос, Анкета, Удаление)
	
	НаборЗаписей = РегистрыСведений.ОценкиОтветовОпросаПоКомпетенциям.СоздатьНаборЗаписей();
	
	Если Не Удаление Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОпросыПоКомпетенциямХарактеристики.Характеристика КАК Характеристика,
		|	ОпросыПоКомпетенциямХарактеристики.Вопрос КАК Вопрос
		|ПОМЕСТИТЬ ВТВопросыХарактеристик
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Характеристики КАК ОпросыПоКомпетенциямХарактеристики
		|ГДЕ
		|	ОпросыПоКомпетенциямХарактеристики.Ссылка = &Опрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Опрос КАК Опрос,
		|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Анкеты.Респондент.ФизическоеЛицо КАК Эксперт,
		|	ОпросыПоКомпетенциямОценивающиеЭксперты.РольЭксперта КАК РольЭксперта,
		|	ВТВопросыХарактеристик.Характеристика КАК ХарактеристикаПерсонала,
		|	ОтветыНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ВариантыОтветовАнкет.Ссылка КАК Ответ,
		|	ОтветыНаВопросыАнкет.Ответ КАК Балл,
		|	ВЫРАЗИТЬ(АнкетаСостав.ОткрытыйОтвет КАК СТРОКА(150)) КАК КомментарийЭксперта
		|ПОМЕСТИТЬ ВТОтветы
		|ИЗ
		|	РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Анкета КАК Анкеты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОпросыПоКомпетенциям.ОценивающиеЭксперты КАК ОпросыПоКомпетенциямОценивающиеЭксперты
		|			ПО (ОпросыПоКомпетенциямОценивающиеЭксперты.Ссылка = &Опрос)
		|				И Анкеты.Респондент.ФизическоеЛицо = ОпросыПоКомпетенциямОценивающиеЭксперты.ОценивающийЭксперт
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|			ПО Анкеты.Опрос = ОпросыПоКомпетенциямОцениваемые.НазначениеОпроса
		|				И (ОпросыПоКомпетенциямОцениваемые.Ссылка = &Опрос)
		|				И (&УсловиеПоФизическомуЛицу)
		|		ПО (Анкеты.Ссылка = &Анкета)
		|			И ОтветыНаВопросыАнкет.Анкета = Анкеты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВопросыХарактеристик КАК ВТВопросыХарактеристик
		|		ПО ОтветыНаВопросыАнкет.Вопрос = ВТВопросыХарактеристик.Вопрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ОтветыНаВопросыАнкет.Ответ) = ТИП(Справочник.ВариантыОтветовАнкет)
		|					ТОГДА ОтветыНаВопросыАнкет.ЭлементарныйВопрос = ВариантыОтветовАнкет.Владелец
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ОтветыНаВопросыАнкет.Ответ) = ТИП(Справочник.ВариантыОтветовАнкет)
		|					ТОГДА ОтветыНаВопросыАнкет.Ответ = ВариантыОтветовАнкет.Ссылка
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(ОтветыНаВопросыАнкет.Ответ) = ТИП(Справочник.ВариантыОтветовАнкет)
		|					ТОГДА НЕ ВариантыОтветовАнкет.ПометкаУдаления
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Анкета.Состав КАК АнкетаСостав
		|		ПО ОтветыНаВопросыАнкет.Анкета = АнкетаСостав.Ссылка
		|			И ОтветыНаВопросыАнкет.Вопрос = АнкетаСостав.Вопрос
		|ГДЕ
		|	ОтветыНаВопросыАнкет.БезОтвета = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ОпросыПоКомпетенциямОценивающиеЭксперты.РольЭксперта,
		|	ВТВопросыХарактеристик.Характеристика,
		|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо,
		|	ВариантыОтветовАнкет.Ссылка,
		|	ОтветыНаВопросыАнкет.Ответ,
		|	ВЫРАЗИТЬ(АнкетаСостав.ОткрытыйОтвет КАК СТРОКА(150)),
		|	ОтветыНаВопросыАнкет.Вопрос,
		|	Анкеты.Респондент.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтветы.Опрос КАК ОпросПоКомпетенциям,
		|	ВТОтветы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТОтветы.Эксперт КАК Эксперт,
		|	ВТОтветы.РольЭксперта КАК РольЭксперта,
		|	ВТОтветы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТОтветы.Вопрос КАК Вопрос,
		|	ВТОтветы.Ответ КАК Ответ,
		|	ВЫБОР
		|		КОГДА ВТОтветы.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|			ТОГДА ЗначенияХарактеристик.Ссылка
		|	КОНЕЦ КАК Значение,
		|	ВЫБОР
		|		КОГДА ВТОтветы.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ТочноеЗначение)
		|			ТОГДА ВТОтветы.Балл
		|	КОНЕЦ КАК Оценка,
		|	ВТОтветы.КомментарийЭксперта КАК КомментарийЭксперта
		|ИЗ
		|	ВТОтветы КАК ВТОтветы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО ВТОтветы.ХарактеристикаПерсонала.ШкалаЗначений.Ссылка = ЗначенияХарактеристик.Владелец
		|			И ВТОтветы.Ответ.Наименование = ЗначенияХарактеристик.Наименование");
		Запрос.УстановитьПараметр("Опрос", Опрос);
		Запрос.УстановитьПараметр("Анкета", Анкета);
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Опрос, "СпособЗаполненияЭкспертов") = Перечисления.СпособЗаполненияРеспондентовВОценке360.ЕдиноеДляВсех Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ОпросыПоКомпетенциям.ОценивающиеЭксперты", "Справочник.ОпросыПоКомпетенциям.ОценивающиеЭкспертыЕдиныйНабор");
			Запрос.УстановитьПараметр("УсловиеПоФизическомуЛицу", Истина);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоФизическомуЛицу", "(ОпросыПоКомпетенциямОценивающиеЭксперты.ФизическоеЛицо = ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо)");
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		НаборЗаписей.Загрузить(РезультатЗапроса);
	Иначе
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	&Мероприятие КАК ОпросПоКомпетенциям,
			|	МероприятияОценкиПерсоналаУчастники.ФизическоеЛицо КАК ФизическоеЛицо,
			|	Анкеты.Респондент.ФизическоеЛицо КАК Эксперт
			|ИЗ
			|	Документ.Анкета КАК Анкеты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеОпросов КАК НазначениеОпросов
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК МероприятияОценкиПерсоналаУчастники
			|			ПО НазначениеОпросов.Ссылка = МероприятияОценкиПерсоналаУчастники.НазначениеОпроса
			|				И (МероприятияОценкиПерсоналаУчастники.Ссылка = &Мероприятие)
			|		ПО Анкеты.Опрос = НазначениеОпросов.Ссылка
			|			И (Анкеты.Ссылка = &Анкета)
			|
			|СГРУППИРОВАТЬ ПО
			|	МероприятияОценкиПерсоналаУчастники.ФизическоеЛицо,
			|	Анкеты.Респондент.ФизическоеЛицо");
		Запрос.УстановитьПараметр("Мероприятие", Опрос);
		Запрос.УстановитьПараметр("Анкета", Анкета);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить()
	КонецЕсли;
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		НаборЗаписей.Отбор.ОпросПоКомпетенциям.Установить(РезультатЗапроса[0].ОпросПоКомпетенциям);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(РезультатЗапроса[0].ФизическоеЛицо);
		НаборЗаписей.Отбор.Эксперт.Установить(РезультатЗапроса[0].Эксперт);
		НаборЗаписей.Записать();
	Иначе
		ПредставлениеОшибки =
			НСтр("ru = 'Не удалось рассчитать оценки ответов на вопросы анкет'");
		ВызватьИсключение ПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьРезультатыОценкиСотрудников(Опрос)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала КАК Период,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.Эксперт КАК Эксперт,
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|		КОНЕЦ) КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям = &Опрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала,
		|	ОценкиОтветовОпросаПоКомпетенциям.Эксперт,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала";
	Запрос.УстановитьПараметр("Опрос", Опрос);
	
	НаборЗаписей = РегистрыСведений.РезультатыЭкспертнойОценкиПерсонала.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	НаборЗаписей.Отбор.Период.Установить(Опрос.ДатаНачала);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область ПеренесенныйШаблоныСообщенийСервер

Функция ВнешняяСсылкаНаСписокДоступныхАнкет(ПользовательИБ, Пароль = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	НайденныйПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПользовательИБ.ИдентификаторПользователяИБ);
	АдресПубликацииИБ = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();
	УстановитьПривилегированныйРежим(Ложь);
	
	СтрокаПользователя = ?(НайденныйПользовательИБ = Неопределено, "", "?N=" + НайденныйПользовательИБ.Имя);
	СтрокаПароля = ?(Пароль = Неопределено, "", "&P=" + Пароль);
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(АдресПубликацииИБ);
	ЧастиСтроки.Добавить(?(СтрЗаканчиваетсяНа(СокрЛП(АдресПубликацииИБ), "/"), "", "/"));
	ЧастиСтроки.Добавить(КодироватьСтроку(СтрокаПользователя, СпособКодированияСтроки.URLВКодировкеURL));
	ЧастиСтроки.Добавить(КодироватьСтроку(СтрокаПароля, СпособКодированияСтроки.URLВКодировкеURL));
	ЧастиСтроки.Добавить(КодироватьСтроку("#e1cib/app/" + Метаданные.Обработки.ДоступныеАнкеты.ПолноеИмя(), 
		СпособКодированияСтроки.URLВКодировкеURL));
		
	Возврат СтрСоединить(ЧастиСтроки);
	
КонецФункции
	
#КонецОбласти

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ОбучениеИРазвитие) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ОбучениеИРазвитие, НСтр("ru = 'Отчеты по обучению и развитию'"));
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РезультатыОпросовПоКомпетенциям);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ПрофильнаяОценкаКомпетенцийСотрудников);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СравнительныйАнализКомпетенцийСотрудников);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СтатусыЗаполненияОпросовПоКомпетенциям);
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РезультатыОпросовПоКомпетенциям, "РезультатыОпросаПоКомпетенциям");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РезультатыОпросовПоКомпетенциям, "ИндивидуальнаяОценка");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.РезультатыОпросовПоКомпетенциям, "ИндивидуальнаяОценкаДляСотрудника");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ПрофильнаяОценкаКомпетенцийСотрудников, "ПрофильнаяОценкаКомпетенцийСотрудников");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СравнительныйАнализКомпетенцийСотрудников, "СравнительныйАнализКомпетенцийСотрудников");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СтатусыЗаполненияОпросовПоКомпетенциям, "СтатусыЗаполненияОпросов");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьЭкспертнуюОценкуПерсонала");
	
КонецПроцедуры

#КонецОбласти

// Функция дополняет описание профиля ролями для работы с подсистемой Экспертная оценка персонала.
// 
Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЭкспертнаяОценка");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОпросовПоКомпетенциям");
	
КонецПроцедуры

Процедура ЗаполнитьПараметрМероприятияОценкиШаблонаСообщения(ПараметрыСообщения, Объект) Экспорт

	ПараметрыСообщения.Вставить("Наименование", Объект.Наименование);
	ПараметрыСообщения.Вставить("ДатаНачала", Формат(Объект.ДатаНачала, "ДЛФ=D"));
	ПараметрыСообщения.Вставить("ДатаОкончания", Формат(Объект.ДатаОкончания, "ДЛФ=D"));
	ПараметрыСообщения.Вставить("Ответственный", Объект.Ответственный);

КонецПроцедуры

#Область РаботаСШаблонамиСообщений

Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт

	Если Не ДополнительныеПараметры.Свойство("ВладелецШаблона") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры.ВладелецШаблона)
		<> Тип("ПеречислениеСсылка.ИспользованиеШаблоновСообщенийПриОценкеПерсонала") Тогда
		Возврат;
	КонецЕсли;

	ДополнитьШаблонРеквизитамиМероприятияОценкиПерсонала(Реквизиты, Вложения, ДополнительныеПараметры);
	ДополнитьШаблонПроизвольнымиПараметрами(Реквизиты, Вложения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПриФормированииСообщения(Сообщение, НазначениеШаблона, ПредметСообщения, ДополнительныеПараметры) Экспорт

	Если Не ДополнительныеПараметры.Свойство("ВладелецШаблона") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры.ВладелецШаблона)
		<> Тип("ПеречислениеСсылка.ИспользованиеШаблоновСообщенийПриОценкеПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыШаблонаЗначениямиМероприятияОценки(Сообщение, ПредметСообщения, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, НазначениеШаблона, ПредметСообщения) Экспорт
	
	Если Не ПредметСообщения.Свойство("ПроизвольныеПараметры") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПредметСообщения.ПроизвольныеПараметры["ПараметрыПолучателей"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучателей = ПредметСообщения.ПроизвольныеПараметры["ПараметрыПолучателей"];
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыПолучателей, "ПереопределятьПолучателей", Ложь) Тогда
		ПереопределитьПолучателейПисьма(ПолучателиПисьма, НазначениеШаблона, ПараметрыПолучателей);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьШаблонРеквизитамиМероприятияОценкиПерсонала(Реквизиты, Вложения, ДополнительныеПараметры)
	
	РеквизитыШаблона = Реквизиты.Родитель.Владелец().Строки;
	
	ГруппаМероприятиеОценки = РеквизитыШаблона.Добавить();
	ГруппаМероприятиеОценки.Имя = "ОпросыПоКомпетенциям";
	ГруппаМероприятиеОценки.Представление = НСтр("ru = 'Опросы по компетенциям'");
	
	РеквизитыМероприятия = ГруппаМероприятиеОценки.Строки;
	
	// Наименование.
	НоваяСтрока = РеквизитыМероприятия.Добавить();
	НоваяСтрока.Имя = "ОпросыПоКомпетенциям.Наименование";
	НоваяСтрока.Представление = НСтр("ru = 'Наименование'");
	
	// Дата начала.
	НоваяСтрока = РеквизитыМероприятия.Добавить();
	НоваяСтрока.Имя = "ОпросыПоКомпетенциям.ДатаНачала";
	НоваяСтрока.Представление = НСтр("ru = 'Дата начала'");
	
	// Дата окончания.
	НоваяСтрока = РеквизитыМероприятия.Добавить();
	НоваяСтрока.Имя = "ОпросыПоКомпетенциям.ДатаОкончания";
	НоваяСтрока.Представление = НСтр("ru = 'Дата окончания'");
	
	// Дата Ответственный.
	НоваяСтрока = РеквизитыМероприятия.Добавить();
	НоваяСтрока.Имя = "ОпросыПоКомпетенциям.Ответственный";
	НоваяСтрока.Представление = НСтр("ru = 'Ответственный'");

КонецПроцедуры

Процедура ДополнитьШаблонПроизвольнымиПараметрами(РеквизитыОбъектаНазначения, Вложения, ДополнительныеПараметры)

	Описание = Новый Структура("ОписаниеТипа, Представление");
	Описание.ОписаниеТипа = Новый ОписаниеТипов("Строка");
	Описание.Представление = НСтр("ru = 'Веб-ссылка на форму анкетирования'");
	
	ДополнительныеПараметры.Параметры.Вставить("ВебСсылкаАнкетирования", Описание);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыШаблонаЗначениямиМероприятияОценки(Сообщение, ПредметСообщения, ДополнительныеПараметры)

	ПараметрыШаблона = Сообщение.ДополнительныеПараметры.ПроизвольныеПараметры;
	Если ПараметрыШаблона["ОпросыПоКомпетенциям"] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыМероприятияОценкиПерсонала = ПараметрыШаблона["ОпросыПоКомпетенциям"];
	ПараметрыСообщения = ДополнительныеПараметры.ПараметрыСообщения;
	
	Для каждого ПараметрСообщения Из ПараметрыСообщения Цикл
		ПараметрыМероприятияОценкиПерсонала.Вставить(ПараметрСообщения.Ключ, ПараметрСообщения.Значение);
	КонецЦикла; 

КонецПроцедуры

Процедура ПереопределитьПолучателейПисьма(ПолучателиПисьма, НазначениеШаблона, ПараметрыПолучателей)

	ПолучателиПисьма.Очистить();
	
	НоваяСтрока = ПолучателиПисьма.Добавить();
	НоваяСтрока.Представление = ПараметрыПолучателей.ФИОПолучателя;
	НоваяСтрока.Контакт = ПараметрыПолучателей.ФИОПолучателя;
	НоваяСтрока.Адрес = ПараметрыПолучателей.Адрес;

КонецПроцедуры

Процедура ЗаполнитьРеквизитШаблонаВебСсылкаАнкетирования(ПараметрыШаблона) Экспорт

	Если НЕ ПараметрыШаблона.Свойство("ПроизвольныеПараметры") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыШаблона.Свойство("ПользовательИБ") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона["ПроизвольныеПараметры"].Вставить("ВебСсылкаАнкетирования", 
		ВнешняяСсылкаНаСписокДоступныхАнкет(ПараметрыШаблона.ПользовательИБ));
	
КонецПроцедуры

Процедура ДобавитьПереопределениеПолучателейСообщения(ПараметрыШаблона, ПриглашаемыйРеспондент) Экспорт

	Если Не ПараметрыШаблона.Свойство("ПроизвольныеПараметры") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучателей = Новый Структура;
	
	ФИОПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПриглашаемыйРеспондент.ФизическоеЛицо, "ФИО");
	ПараметрыПолучателей.Вставить("ПереопределятьПолучателей", Истина);
	ПараметрыПолучателей.Вставить("Получатель", ПриглашаемыйРеспондент.ФизическоеЛицо);
	ПараметрыПолучателей.Вставить("ФИОПолучателя", ФИОПолучателя);
	ПараметрыПолучателей.Вставить("Адрес", ПриглашаемыйРеспондент.Адрес);
	
	ПараметрыШаблона["ПроизвольныеПараметры"].Вставить("ПараметрыПолучателей", ПараметрыПолучателей);

КонецПроцедуры

#КонецОбласти

Функция ОписаниеПрофиляЭксперт()

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Эксперты'");
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляЭксперт();
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Профиль для доступа экспертов к системе для заполнения опросов по компетенциям'");

	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаЭкспертнаяОценка");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОтветовНаВопросыАнкет");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеОтветовНаВопросыАнкет");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "БазовыеПраваБСП");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЗапускВебКлиента");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЗапускТонкогоКлиента");

	Возврат ОписаниеПрофиля;

КонецФункции

Функция ИдентификаторПрофиляЭксперт() Экспорт

	Возврат "3be571ad-3085-4176-b870-47749f1165fd";

КонецФункции

Процедура СоздатьИЗаполнитьГруппуДоступаЭксперта()

	ПрофильЭксперт = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных",
		Новый УникальныйИдентификатор(ИдентификаторПрофиляЭксперт()));
	Если ПрофильЭксперт = Справочники.ПрофилиГруппДоступа.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Профиль = &Профиль";
	Запрос.УстановитьПараметр("Профиль", ПрофильЭксперт);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаДоступаОбъект = Справочники.ГруппыДоступа.СоздатьЭлемент();
	ГруппаДоступаОбъект.Наименование = НСтр("ru = 'Эксперты'");
	ГруппаДоступаОбъект.Профиль = ПрофильЭксперт;
	ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ГруппаДоступаОбъект);
	
	Константы.ГруппаДоступаЭксперта.Установить(ГруппаДоступаОбъект.Ссылка);

КонецПроцедуры

Функция РолиЭкспертовВОпросе() Экспорт
	
	РолиЭкспертов = Новый Массив;
	РолиЭкспертов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Клиент"));
	РолиЭкспертов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Коллега"));
	РолиЭкспертов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Подчиненный"));
	РолиЭкспертов.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.РолиРеспондентаОценкиПерсонала.Руководитель"));
	
	ПриЗаполненииРолейЭкспертовВОпросе(РолиЭкспертов);
	
	Возврат РолиЭкспертов;
	
КонецФункции

Процедура СозданиеПользователейЭкспертов(ЭкспертыБезПользователей) Экспорт
	
	Если ЭкспертыБезПользователей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ГруппаДоступа = Константы.ГруппаДоступаЭксперта.Получить();
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ВызватьИсключение НСтр(
			"ru = 'В настройках программы не указана группа доступа для создания пользователя-эксперта'");
	КонецЕсли;
	ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
	УстановитьПривилегированныйРежим(Ложь);
	
	Эксперты = Новый Массив;
	Для Каждого ЭкспертБезПользователя Из ЭкспертыБезПользователей Цикл
		Эксперты.Добавить(ЭкспертБезПользователя.ФизическоеЛицо);
	КонецЦикла;
	
	НастройкиУведомленийПоУмолчанию = СамообслуживаниеСотрудниковКлиентСервер.НастройкиОтправкиУведомленийПоУмолчанию();
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, Эксперты, "Фамилия, Имя, Отчество");
	КадровыеДанные.Индексы.Добавить("ФизическоеЛицо");
	
	Для Каждого ДанныеЭксперта Из ЭкспертыБезПользователей Цикл
		Отбор = Новый Структура("ФизическоеЛицо", ДанныеЭксперта.ФизическоеЛицо);
		НайденныеСтроки = КадровыеДанные.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ИмяПользователя = СвободноеИмяПользователя(НайденныеСтроки[0].Фамилия, НайденныеСтроки[0].Имя,
				НайденныеСтроки[0].Отчество, " (2)");
				
			ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
			ОписаниеПользователяИБ.Имя = ИмяПользователя;
			ОписаниеПользователяИБ.ПолноеИмя = ИмяПользователя;
			ОписаниеПользователяИБ.АутентификацияСтандартная = Истина;
			ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = Истина;
			ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = Истина;
			ОписаниеПользователяИБ.АутентификацияOpenID = Ложь;
			ОписаниеПользователяИБ.АутентификацияОС = Ложь;
			ОписаниеПользователяИБ.Пароль = СамообслуживаниеСотрудников.СлучайныйПароль();
			ОписаниеПользователяИБ.Вставить("Действие", "Записать");
			
			УстановитьПривилегированныйРежим(Истина);
			
			Пользователь = Справочники.Пользователи.СоздатьЭлемент();
			Пользователь.Наименование = ОписаниеПользователяИБ.ПолноеИмя;
			Пользователь.ФизическоеЛицо = ДанныеЭксперта.ФизическоеЛицо;
			Пользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", ОписаниеПользователяИБ);
			Пользователь.Записать();
			
			ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = Пользователь.Ссылка;
			
			ТекстПисьма = ТекстПисьмаУведомления(ОписаниеПользователяИБ.Имя, ОписаниеПользователяИБ.Пароль, НастройкиУведомленийПоУмолчанию);
			СамообслуживаниеСотрудников.ОтправитьСообщениеПользователю(ДанныеЭксперта, ТекстПисьма, НастройкиУведомленийПоУмолчанию);
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ГруппаДоступаОбъект.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ВключитьПользователейВГруппуДоступаЭксперты(ЭкспертыСПользователями) Экспорт
	
	Если ЭкспертыСПользователями.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ГруппаДоступа = Константы.ГруппаДоступаЭксперта.Получить();
	Если Не ЗначениеЗаполнено(ГруппаДоступа) Тогда
		ВызватьИсключение НСтр(
			"ru = 'В настройках программы не указана группа доступа для создания пользователя-эксперта'");
	КонецЕсли;
	
	ПользователиБезГруппыДоступа = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Ссылка = &ГруппаДоступа
		|	И ГруппыДоступаПользователи.Пользователь В (&Пользователи)";
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступа);
	Запрос.УстановитьПараметр("Пользователи", ЭкспертыСПользователями);
	ПользователиЭксперты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Если ПользователиЭксперты.Количество() = 0 Тогда
		ПользователиБезГруппыДоступа = ЭкспертыСПользователями;
	Иначе
		Для Каждого Эксперт Из ЭкспертыСПользователями Цикл
			Если ПользователиЭксперты.Найти(Эксперт) = Неопределено Тогда
				ПользователиБезГруппыДоступа.Добавить(Эксперт);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПользователиБезГруппыДоступа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПользовательБезГруппы Из ПользователиБезГруппыДоступа Цикл
		Если Пользователи.ЭтоПолноправныйПользователь(ПользовательБезГруппы, Ложь, Ложь) Тогда
			Продолжить;
		КонецЕсли;
		ГруппаДоступаОбъект = ГруппаДоступа.ПолучитьОбъект();
		ГруппаДоступаОбъект.Пользователи.Добавить().Пользователь = ПользовательБезГруппы;
		ГруппаДоступаОбъект.Записать();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура УстановитьАутентификациюПользователей(ЭкспертыСПользователями) Экспорт

	Если ЭкспертыСПользователями.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Пользователь Из ЭкспертыСПользователями Цикл
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "Недействителен") Тогда
			СамообслуживаниеСотрудников.УстановитьАутентификациюПользователя(Пользователь, Истина);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция СвободноеИмяПользователя(Фамилия, Имя, Отчество, Постфикс = Неопределено)

	ВозможныеЗначения = Новый Массив;

	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;

	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4) + " " + Постфикс);
	КонецЕсли;

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Пользователи.Наименование
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Наименование В(&ВозможныеЗначения)";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВозможныеЗначения", ВозможныеЗначения);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();

	ЗанятыеЗначения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ЗанятыеЗначения.Вставить(СокрЛП(Выборка.Наименование), Истина);
	КонецЦикла;

	Для Каждого ИмяПользователя Из ВозможныеЗначения Цикл
		Если ЗанятыеЗначения[ИмяПользователя] = Неопределено Тогда
			Возврат ИмяПользователя;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ТекстПисьмаУведомления(ПользовательИБ, Пароль, НастройкиСообщений) Экспорт 
	
	ТекстПисьма = НастройкиСообщений.ШаблонУведомления;
	
	// имя пользователя и пароль
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ИмяПользователяИБ%", ПользовательИБ);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%Пароль%", ?(Не ПустаяСтрока(Пароль), Пароль, НСтр("ru = 'без пароля'")));
	
	// адрес веб-сервера
	АдресВебСервера = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();
	Если ЗначениеЗаполнено(АдресВебСервера) Тогда
		Шаблон = "%1%2" + ?(ЗначениеЗаполнено(ПользовательИБ), "?N=%3", "") + ?(ЗначениеЗаполнено(Пароль), "&P=%4", "");
		ВебСсылкаПереходаВСистему = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, 
			СокрЛП(АдресВебСервера), ?(Прав(СокрЛП(АдресВебСервера), 1) <> "/", "/", ""), ПользовательИБ, Пароль);
			ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1
				|
				|Прямая ссылка:
				|<a href=""%2"">%2</a>'"),
				ТекстПисьма,
				ВебСсылкаПереходаВСистему);
	КонецЕсли;
	
	// обрабатываем разрывы строк
	ОтдельныеСтрокиТекста = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПисьма, Символы.ПС);
	HTMLКодОтдельныхСтрок = ОтдельныеСтрокиТекста[0];
	НомерСтроки = 1;
	Пока НомерСтроки < ОтдельныеСтрокиТекста.Количество() Цикл
		HTMLКодОтдельныхСтрок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1<BR>%2</BR>",
									HTMLКодОтдельныхСтрок, 
									ОтдельныеСтрокиТекста[НомерСтроки]);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	HTMLКод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1<P>%2</P>",
				HTMLКод,
				HTMLКодОтдельныхСтрок);
	
	Возврат HTMLКод;
	
КонецФункции

Функция ПолучитьСтатусОпроса(МероприятиеЗавершено, АнкетированиеНачато, ДатаОкончания) Экспорт
	
	ТекстИнформацииТекущаяСтадия = "";
	Если ДатаОкончания = NULL Тогда
		Возврат ТекстИнформацииТекущаяСтадия;
	КонецЕсли;
	
	Если МероприятиеЗавершено Тогда 
		ТекстИнформацииТекущаяСтадия = НСтр("ru = 'Прием анкет завершен'");
	Иначе
		Если АнкетированиеНачато Тогда
			ТекстИнформацииТекущаяСтадия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Идет процесс приема анкет. Анкетирование завершается %1'"), Формат(ДатаОкончания, "ДФ=dd.MM.yy"));
		Иначе
			ТекстИнформацииТекущаяСтадия = НСтр("ru = 'Анкетирование не начато'");
		КонецЕсли;
	КонецЕсли;
		
	Возврат ТекстИнформацииТекущаяСтадия;
КонецФункции

Процедура ДополнитьХарактеристикиОценкамиОтветовОпросаПоКомпетенциям(Форма) Экспорт
	
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.Объект.Основание,
		"Назначение, ПозицияШтатногоРасписания, ПрофильДолжности");
	
	Если ДанныеОснования.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва Тогда
		ПрофильДолжности = ДанныеОснования.ПрофильДолжности;
		Если Не ЗначениеЗаполнено(ПрофильДолжности) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ПрофильДолжностиМассив = ХарактеристикиПерсонала.ПрофильДолжностиПоПозицииШтатногоРасписания(
			ДанныеОснования.ПозицияШтатногоРасписания);
		Если Не ЗначениеЗаполнено(ПрофильДолжностиМассив) Тогда
			Возврат;
		КонецЕсли;
		ПрофильДолжности = ПрофильДолжностиМассив[0];
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОпросы
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОпросыПоКомпетенциямОцениваемые.Ссылка.ПрофильДолжности = &ПрофильДолжности
		|	И ОпросыПоКомпетенциямОцениваемые.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка.ДатаНачала УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала КАК ДатаОценки,
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	СРЕДНЕЕ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|		КОНЕЦ) КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо В(&ФизическоеЛицо)
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям В
		|			(ВЫБРАТЬ
		|				ВТОпросы.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТОпросы КАК ВТОпросы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала УБЫВ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Форма.Объект.Владелец);
	Запрос.УстановитьПараметр("ПрофильДолжности", ПрофильДолжности);
	
	РезультатыОценки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаХарактеристик Из Форма.Характеристики Цикл
		НайденныеСтроки = РезультатыОценки.НайтиСтроки(
			Новый Структура("ХарактеристикаПерсонала", СтрокаХарактеристик.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если НайденныеСтроки.Количество() = 1 Тогда
			СтрокаХарактеристик.Оценка = НайденныеСтроки[0].Оценка;
		КонецЕсли;
		Если НайденныеСтроки.Количество() = 2 Тогда
			Если НайденныеСтроки[0].ДатаОценки > НайденныеСтроки[1].ДатаОценки Тогда
				СтрокаХарактеристик.Оценка = НайденныеСтроки[0].Оценка;
				СтрокаХарактеристик.ПредыдущаяОценка = НайденныеСтроки[1].Оценка;
			Иначе
				СтрокаХарактеристик.ПредыдущаяОценка = НайденныеСтроки[0].Оценка;
				СтрокаХарактеристик.Оценка = НайденныеСтроки[1].Оценка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьХарактеристикиРезультатамиЭкспертнойОценкиПерсонала(Форма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РезультатыЭкспертнойОценкиПерсоналаСрезПоследних.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	РезультатыЭкспертнойОценкиПерсоналаСрезПоследних.Оценка КАК Оценка
		|ИЗ
		|	РегистрСведений.РезультатыЭкспертнойОценкиПерсонала.СрезПоследних(
		|			,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И ХарактеристикаПерсонала В (&Характеристики)) КАК РезультатыЭкспертнойОценкиПерсоналаСрезПоследних";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Форма.Объект.Владелец);
	Запрос.УстановитьПараметр("Характеристики", Форма.Характеристики.Выгрузить().ВыгрузитьКолонку("Характеристика"));
	
	РезультатыОценки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаХарактеристик Из Форма.Характеристики Цикл
		НайденныеСтроки = РезультатыОценки.НайтиСтроки(
			Новый Структура("ХарактеристикаПерсонала", СтрокаХарактеристик.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаХарактеристик.Оценка = НайденныеСтроки[0].Оценка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 