#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	МодульТрудоустройствоПоКвотам = ОбщегоНазначения.ОбщийМодуль("ТрудоустройствоПоКвотам");
	МодульТрудоустройствоПоКвотам.СформироватьДвиженияПоТрудоустройствуСотрудниковПоКвотам(Движения, ДанныеДляПроведения);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзменениеКвотыПоТрудоустройству.Дата КАК Период,
	|	ИзменениеКвотыПоТрудоустройству.Организация КАК Организация,
	|	ИзменениеКвотыПоТрудоустройствуСотрудники.Сотрудник КАК Сотрудник,
	|	ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте КАК ТрудоустроенПоКвоте,
	|	ВЫБОР
	|		КОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте
	|			ТОГДА ИзменениеКвотыПоТрудоустройству.ВидКвоты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.ПустаяСсылка)
	|	КОНЕЦ КАК ВидКвоты,
	|	ВЫБОР
	|		КОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.ТрудоустроенПоКвоте
	|			ТОГДА ИзменениеКвотыПоТрудоустройствуСотрудники.КатегорияКвоты
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КатегорииСотрудниковТрудоустроенныхПоКвотам.ПустаяСсылка)
	|	КОНЕЦ КАК КатегорияКвоты
	|ИЗ
	|	Документ.ИзменениеКвотыПоТрудоустройству.Сотрудники КАК ИзменениеКвотыПоТрудоустройствуСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеКвотыПоТрудоустройству КАК ИзменениеКвотыПоТрудоустройству
	|		ПО ИзменениеКвотыПоТрудоустройствуСотрудники.Ссылка = ИзменениеКвотыПоТрудоустройству.Ссылка
	|ГДЕ
	|	ИзменениеКвотыПоТрудоустройству.Ссылка = &Ссылка";
	
	ДанныеДляПроведения = Новый Структура; 
	ДанныеДляПроведения.Вставить("ТрудоустройствоСотрудниковПоКвотам", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
