
#Область ОписаниеПеременных

// Переменная используется для исключения повторной проверки подписанных данных,
// которая инициируется при возникновении исключения в процедуре проверки, так как
// при этом повторно вызывается обработчик ПослеПроверкиОчереднойПодписи
&НаКлиенте
Перем ЗапущенаПроверкаСоответствияПодписанныхИТекущихДанных;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЕстьНастройки = Ложь;
	ФормированиеФормуляровВключено = ПроцессыОбработкиДокументов.ВключенаПоддержкаФормированияИПодписанияФормуляров();
	
	ШаблонИСтатус = ПроцессыОбработкиДокументов.ШаблонИСтатусДокумента(Параметры.ЗначениеОтбора);
	
	ШаблонПроцесса = ШаблонИСтатус.Шаблон;
	ТекущийСтатус = ШаблонИСтатус.Статус;
	
	ИспользуетсяЭДОСКонтрагентамиБЭД = ПроцессыОбработкиДокументов.ЕстьДоступностьВнешнегоЭДО(Параметры.ЗначениеОтбора);
	
	Если ИспользуетсяЭДОСКонтрагентамиБЭД Тогда
		РазрешенаОтправкаФормуляровКонтрагентамПоЭДО = ПроцессыОбработкиДокументов.РазрешенаОтправкаФормуляровКонтрагентамПоЭДОДляШаблона(ШаблонПроцесса);
	    Если РазрешенаОтправкаФормуляровКонтрагентамПоЭДО Тогда
			МожноСоздатьНовыйВнешнийЭД = Истина;
		КонецЕсли;	
		ЗаполнитьСписокВнешнихЭД(Параметры.ЗначениеОтбора);
	КонецЕсли;	
		
	ЗаполнитьПорядокТекущегоЭтапа();
	
	ЗаполнитьСписокПодписей();

	ЗаполнитьФормулярыДокументов();
	Если ФормулярыДокументов.Количество() > 0 Тогда
		ЗаполнитьПредставленияЭлектронныхДокументов();
	Иначе	
		ЗаполнитьСохраненныеПредставленияЭлектронныхДокументов();
	КонецЕсли;	
	
	ЗаполнитьПервичныеДокументы();
	
	ЗаполнитьТекущийРегламентныйИнтервал();
	
	Заголовок = НСтр("ru = 'Карточка процесса по документу'");
	
	Если Параметры.Свойство("ОткрытиеВОтдельномОкне") Тогда
		Заголовок = Заголовок + ": " + Параметры.ЗначениеОтбора;
	КонецЕсли;
	
	ПредставлениеДокумента = ПроцессыОбработкиДокументов.ПредставлениеДокументаДляИмениФайла(Параметры.ЗначениеОтбора);
	
	ДобавитьДополнительныеКомандыКарточкиПроцессаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента" Тогда

		ОбновитьСпискиНаКлиенте();

	ИначеЕсли ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
	    Если ИспользуетсяЭДОСКонтрагентамиБЭД Тогда
			УстановитьВидимостьЭлементовВнешнегоЭДО(Параметры.ЗначениеОтбора);
			ЗаполнитьСписокВнешнихЭД(Параметры.ЗначениеОтбора);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	ПоказыватьВыполненные = Настройки["ПоказыватьВыполненные"];
	ЗаполнитьСписокЗадач(ПоказыватьВыполненные);
	УстановитьДоступностьКнопок();
	ЕстьНастройки = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЕстьНастройки Тогда
		ПоказыватьВыполненные = Истина;
		ЗаполнитьСписокЗадач(ПоказыватьВыполненные);
		УстановитьДоступностьКнопок();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеГрупповогоЭтапаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Документ", Параметры.ЗначениеОтбора);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа", ИдентификаторГрупповогоЭтапа);
	ПараметрыФормы.Вставить("НаименованиеЭтапа", НаименованиеГрупповогоЭтапа);
	ОткрытьФорму("ОбщаяФорма.ХодВыполненияГрупповогоЭтапа", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	ОтобратьЗадачиДляОтображения(ПоказыватьВыполненные);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьДоступностьКнопок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадач

&НаКлиенте
Процедура СписокЗадачВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.НеВыполненаИзЗаОшибки Тогда
		МассивЗадач = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элемент.ТекущиеДанные.Ссылка);
		ПроцессыОбработкиДокументовКлиент.ПоказатьИнформациюОбОшибках(МассивЗадач);
	ИначеЕсли Поле.Имя = "СписокЗадачОписаниеВыполнения" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.РезультатВыполнения) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Описание выполнения'"));
		ПараметрыФормы.Вставить("Автор", Элемент.ТекущиеДанные.Исполнитель);
		ПараметрыФормы.Вставить("ОписаниеЗадачи", Элемент.ТекущиеДанные.РезультатВыполнения);
		ОткрытьФорму("ОбщаяФорма.ОписаниеЗадачи", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПриАктивизацииСтроки(Элемент)
	УправлениеДоступностьюКомандЗадач(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеПодписи

&НаКлиенте
Процедура ЭлектронныеПодписиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьЭлектроннуюПодпись();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПервичныеДокументы

&НаКлиенте
Процедура ПервичныеДокументыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьТабличныйДокумент();
		Возврат;
	КонецЕсли;
	
	ОтобразитьВизуализациюПервичногоДокумента(ТекущиеДанные.ИдентификаторПечатнойФормы, ТекущиеДанные.ПервичныйДокумент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыФормулярыДокументов

&НаКлиенте
Процедура ФормулярыДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ФормулярыДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьТабличныйДокументФормуляра();
		Возврат;
	КонецЕсли;
	
	ОтобразитьВизуализациюФормуляраДокумента(Параметры.ЗначениеОтбора,
		ТекущиеДанные.ДанныеПредставленияПервичногоДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПредставленияЭлектронныхДокументов

&НаКлиенте
Процедура ПредставленияЭлектронныхДокументовПриАктивизацииСтроки(Элемент)

	ТекущиеДанные = Элементы.ПредставленияЭлектронныхДокументов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ОчиститьТабличныйДокументПредставленияЭлектронногоДокумента();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДанныеПредставленияПервичногоДокумента) Тогда
		ОтобразитьВизуализациюСохраненногоПредставленияЭлектронногоДокумента(ТекущиеДанные.ДанныеПредставленияПервичногоДокумента);
	Иначе
		Если ЗначениеЗаполнено(ТекущиеДанные.ОсновнойФормуляр) Тогда
			ОтобразитьВизуализациюПредставленияЭлектронногоДокумента(ТекущиеДанные.ОсновнойФормуляр, ТекущиеДанные.ИдентификаторыПрочихФормуляров);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

 #Область  ОбработчикиСобытийЭлементовТаблицыФормыВнешниеЭлектронные

&НаКлиенте
Процедура ВнешниеЭлектронныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ВнешниеЭлектронныеДокументы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ЭлектронныйДокумент) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.ЭлектронныйДокумент);
		ОткрытьФормуПроизвольногоЭлектронногоДокумента(ПараметрыФормы);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭП(Команда)
	
	ОткрытьЭлектроннуюПодпись();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЭП(Команда)
	
	Если Элементы.ЭлектронныеПодписи.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УсиленныеПодписи = Новый Массив;
	ПростыеПодписи = Новый Массив;
	Для Каждого Подпись Из Элементы.ЭлектронныеПодписи.ВыделенныеСтроки Цикл
		СтрокаПодписи = ЭлектронныеПодписи.НайтиПоИдентификатору(Подпись);
		Если СтрокаПодписи.ПростаяПодпись Тогда
			ПростыеПодписи.Добавить(СтрокаПодписи);
		Иначе
			УсиленныеПодписи.Добавить(СтрокаПодписи);
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьПодписи(УсиленныеПодписи, ПростыеПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВсе(Команда)
	
	УсиленныеПодписи = Новый Массив;
	ПростыеПодписи = Новый Массив;
	Для Каждого Подпись Из ЭлектронныеПодписи Цикл
		Если Подпись.ПростаяПодпись Тогда
			ПростыеПодписи.Добавить(Подпись);
		Иначе
			УсиленныеПодписи.Добавить(Подпись);
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьПодписи(УсиленныеПодписи, ПростыеПодписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьДанные(Команда)
	
	ТекущиеДанные = Элементы.ЭлектронныеПодписи.ТекущиеДанные;

	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать строку в списке ""Электронные подписи"" и повторить операцию.'"));
		Возврат;
	КонецЕсли;
	
	АдресДанныхXML = АдресXMLПодписанныхДанных(ТекущиеДанные.АдресДанных, УникальныйИдентификатор);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ПолучитьИзВременногоХранилища(АдресДанныхXML));
	ТекстовыйДокумент.ТолькоПросмотр = Истина;
	ТекстовыйДокумент.Показать(Строка(Параметры.ЗначениеОтбора) + НСтр("ru = ' (Подписанные данные)'"),"signdata.xml");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПодпись(Команда)
	
	ТекущиеДанные = Элементы.ЭлектронныеПодписи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Объект = Неопределено Или ТекущиеДанные.Объект.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ПростаяПодпись Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Команда не может быть выполнена для простой подписи'"));
		Возврат;
	КонецЕсли;
	
	ПерсональныеНастройки = ЭлектроннаяПодписьКлиент.ПерсональныеНастройки();
	
	ИмяФайла = ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаПодписиПоУмолчанию(ТекущиеДанные, ПерсональныеНастройки);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьПодписьПослеПолученияФайла", ЭтотОбъект, Неопределено);
	Фильтр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Файлы электронных подписей (*.%1)|*.%1|Все файлы (*.*)|*.*'"),
		ЭлектроннаяПодписьКлиент.ПерсональныеНастройки().РасширениеДляФайловПодписи);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Фильтр = Фильтр;
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл для сохранения подписи'");
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, ТекущиеДанные.АдресПодписи, ИмяФайла, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Команда)
	
	ТекущиеДанные = Элементы.ЭлектронныеПодписи.ТекущиеДанные;
	
	ИмяФайла = ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаДанныхПоУмолчанию(ТекущиеДанные, ПредставлениеДокумента);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьДанныеПослеПолученияФайла", ЭтотОбъект, Неопределено);
	Фильтр = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Файлы xml (*.%1)|*.%1|Все файлы (*.*)|*.*'"),
		"xml");
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохранения.Диалог.Фильтр = Фильтр;
	ПараметрыСохранения.Диалог.Заголовок = НСтр("ru = 'Выберите файл для сохранения данных'");
	
	ФайловаяСистемаКлиент.СохранитьФайл(Оповещение, ТекущиеДанные.АдресДанных, ИмяФайла, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеСПодписью(Команда)
	
	Если Элементы.ЭлектронныеПодписи.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЭлектронныеПодписи.ТекущиеДанные;
	
	Если ТекущиеДанные.Объект = Неопределено Или ТекущиеДанные.Объект.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПерсональныеНастройки = ЭлектроннаяПодписьКлиент.ПерсональныеНастройки();
	
	ПередаваемыеФайлы = Новый Массив;
	ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(
		ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаДанныхПоУмолчанию(ТекущиеДанные, ПредставлениеДокумента), ТекущиеДанные.АдресДанных));
	Если НЕ ТекущиеДанные.ПростаяПодпись Тогда
		ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(
			ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаПодписиПоУмолчанию(ТекущиеДанные, ПерсональныеНастройки), ТекущиеДанные.АдресПодписи));
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Новый ОписаниеОповещения(
		"СохранитьДанныеПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект, ПередаваемыеФайлы));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеСПодписьюВсе(Команда)
	
	ПерсональныеНастройки = ЭлектроннаяПодписьКлиент.ПерсональныеНастройки();
	
	ПередаваемыеФайлы = Новый Массив;
	
	Для Каждого ТекущиеДанные Из ЭлектронныеПодписи Цикл
		
		ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(
			ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаДанныхПоУмолчанию(ТекущиеДанные, ПредставлениеДокумента), ТекущиеДанные.АдресДанных));
		Если НЕ ТекущиеДанные.ПростаяПодпись Тогда
			ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(
				ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаПодписиПоУмолчанию(ТекущиеДанные, ПерсональныеНастройки), ТекущиеДанные.АдресПодписи));
		КонецЕсли;
		
	КонецЦикла;
	
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(Новый ОписаниеОповещения(
		"СохранитьДанныеПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект, ПередаваемыеФайлы));
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКартуМаршрута(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокументСсылка", Параметры.ЗначениеОтбора);
	ОткрытьФорму("ОбщаяФорма.КартаМаршрутаПроцесса", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьПринятиеЗадачКИсполнению(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.Ссылка));
		
	ОбновитьФормуВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьВыполнениеЗадач(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущиеДанные.Ссылка));
		
	ОбновитьФормуВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийРегламентныйИнтервал(Команда)
	
	Отбор = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый Структура("Предмет, РегламентныйИнтервал, НомерИтерации",
		Параметры.ЗначениеОтбора, ТекущийРегламентныйИнтервал, ТекущийНомерИтерации));
	
	КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.РегламентныеИнтервалыДокументов", Отбор);
	
	ОткрытьФорму("РегистрСведений.РегламентныеИнтервалыДокументов.ФормаЗаписи", Новый Структура("Ключ", КлючЗаписи));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПервичныеДокументы(Команда)
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	
	// Для сохранения первичных документов берем все задачи с порядком меньше текущего, получаем их файлы и выгружаем
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемыеФайлы = ФайлыПервичногоДокумента(ТекущиеДанные.ИдентификаторПечатнойФормы);
	
	ОбеспечитьУникальностьИменФайлов(ПередаваемыеФайлы);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьПервичныеДокументыПослеПолученияФайла", ЭтотОбъект, Неопределено);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
	
	ФайловаяСистемаКлиент.СохранитьФайлы(Оповещение, ПередаваемыеФайлы, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПервичныеДокументыСПодписью(Команда)
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	
	// Для сохранения первичных документов берем все задачи с порядком меньше текущего, получаем их файлы и выгружаем
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемыеФайлы = ФайлыПодписиПервичногоДокумента(ТекущиеДанные.ИдентификаторПечатнойФормы);
	
	ОбеспечитьУникальностьИменФайлов(ПередаваемыеФайлы);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьПервичныеДокументыПослеПолученияФайла", ЭтотОбъект, Неопределено);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
	
	ФайловаяСистемаКлиент.СохранитьФайлы(Оповещение, ПередаваемыеФайлы, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПервичныеДокументыСПодписьюИВизуализацией(Команда)
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	
	// Для сохранения первичных документов берем все задачи с порядком меньше текущего, получаем их файлы и выгружаем
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПередаваемыеФайлы = ФайлыПодписиВизуализацияПервичногоДокумента(
		ТекущиеДанные.ИдентификаторПечатнойФормы, ТекущиеДанные.ПервичныйДокумент);
	
	ОбеспечитьУникальностьИменФайлов(ПередаваемыеФайлы);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьПервичныеДокументыПослеПолученияФайла", ЭтотОбъект, Неопределено);
	
	ПараметрыСохранения = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
	
	ФайловаяСистемаКлиент.СохранитьФайлы(Оповещение, ПередаваемыеФайлы, ПараметрыСохранения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьДополнительнуюКоманду(Команда)
	Если ПараметрыДополнительныхКоманд[Команда.Имя].Серверная Тогда
		Подключаемый_ВыполнитьДополнительнуюКомандуНаСервере(Команда.Имя);
	Иначе
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ВыполнитьКомандуКарточкиПроцессаДокумента(Команда.Имя, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьДополнительнуюКомандуНаСервере(ИмяКоманды)
	ПроцессыОбработкиДокументовПереопределяемый.ВыполнитьКомандуКарточкиПроцессаДокумента(ИмяКоманды, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКакВнешнийЭД(Команда)
	ОтправитьКакВнешнийЭДНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКакВнешнийЭДКопию(Команда)
	ОтправитьКакВнешнийЭДКопиюНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущиеДелаЭДО(Команда)
	ОткрытьТекущиеДелаЭДОНаКлиенте();	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СохранитьПодписьПослеПолученияФайла(ПолученныеФайлы, Контекст) Экспорт
	
	Если ПолученныеФайлы = Неопределено ИЛИ ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Электронная подпись сохранена в файл:'"), , ПолученныеФайлы[0].Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеПослеПолученияФайла(ПолученныеФайлы, Контекст) Экспорт
	
	Если ПолученныеФайлы = Неопределено ИЛИ ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Данные сохранены в файл:'"), , ПолученныеФайлы[0].Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеПослеПодключенияРасширенияРаботыСФайлами(Подключено, Контекст) Экспорт
	
	Если Не Подключено Тогда
		
		Для Каждого ПолучаемыйФайл Из Контекст Цикл
			ПолучитьФайл(ПолучаемыйФайл.Хранение, ПолучаемыйФайл.Имя);
		КонецЦикла;
		
	Иначе
		
		ФайловаяСистемаКлиент.ВыбратьКаталог(Новый ОписаниеОповещения(
			"СохранитьДанныеВместеСПодписьюПослеВыбораКаталога", ЭтотОбъект, Контекст));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеВместеСПодписьюПослеВыбораКаталога(ПутьККаталогу, Контекст) Экспорт
	
	Если ПустаяСтрока(ПутьККаталогу) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПередаваемыйФайл Из Контекст Цикл
		ПередаваемыйФайл.Имя = ПутьККаталогу + "\" + ПередаваемыйФайл.Имя;
	КонецЦикла;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ПередаваемыеФайлы", Контекст);
	ПараметрыОповещения.Вставить("ПроверяемыйИндекс", 0);
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтотОбъект, ПараметрыОповещения);
	
	Файл = Новый Файл(Контекст[ПараметрыОповещения.ПроверяемыйИндекс].Имя);
	Файл.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(Существует, ДополнительныеПараметры) Экспорт
	
	ПередаваемыеФайлы = ДополнительныеПараметры.ПередаваемыеФайлы;
	ПроверяемыйИндекс = ДополнительныеПараметры.ПроверяемыйИндекс;
	
	Если Существует Тогда
		// Если такой файл уже существует, то надо добавить к его имени "(n + 1)"
		РазложенноеИмяФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПередаваемыеФайлы[ПроверяемыйИндекс].Имя);
		ИмяБезРасширения = РазложенноеИмяФайла.ИмяБезРасширения;
		
		ПорядковыйНомерНовогоФайла = 1;
		
		Если Прав(ИмяБезРасширения, 1) = ")" Тогда
			ПозицияОткрывающейСкобки = СтрНайти(ИмяБезРасширения, "(", НаправлениеПоиска.СКонца);
			Если ПозицияОткрывающейСкобки <> 0 Тогда
				ТекущийПорядковыйНомер = Сред(ИмяБезРасширения, ПозицияОткрывающейСкобки + 1,
					СтрДлина(ИмяБезРасширения) - ПозицияОткрывающейСкобки - 1);
				Попытка
					ПорядковыйНомерНовогоФайла = Число(ТекущийПорядковыйНомер) + 1;
				Исключение
					// Исключение не обрабатывается
				КонецПопытки
			КонецЕсли;
		КонецЕсли;
		
		Если ПорядковыйНомерНовогоФайла = 1 Тогда
			ПередаваемыеФайлы[ПроверяемыйИндекс].Имя = РазложенноеИмяФайла.Путь
				+ РазложенноеИмяФайла.ИмяБезРасширения
				+ " (" + ПорядковыйНомерНовогоФайла + ")"
				+ РазложенноеИмяФайла.Расширение;
		Иначе
			ПередаваемыеФайлы[ПроверяемыйИндекс].Имя = РазложенноеИмяФайла.Путь
				+ Сред(РазложенноеИмяФайла.ИмяБезРасширения, 1, ПозицияОткрывающейСкобки)
				+ ПорядковыйНомерНовогоФайла + ")"
				+ РазложенноеИмяФайла.Расширение;
		КонецЕсли;
	Иначе
		ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
	КонецЕсли;
	
	Если ПроверяемыйИндекс <= ПередаваемыеФайлы.ВГраница() Тогда
		// проверка очередного файла
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ПередаваемыеФайлы", ПередаваемыеФайлы);
		ПараметрыОповещения.Вставить("ПроверяемыйИндекс", ПроверяемыйИндекс);
		
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтотОбъект, ПараметрыОповещения);
		
		Файл = Новый Файл(ПередаваемыеФайлы[ПроверяемыйИндекс].Имя);
		Файл.НачатьПроверкуСуществования(Оповещение);
		
	Иначе
		// все файлы проверены, сохраняем неинтерактивно
		ПараметрыСохраненияФайлов = ФайловаяСистемаКлиент.ПараметрыСохраненияФайлов();
		ПараметрыСохраненияФайлов.Интерактивно = Ложь;
		ФайловаяСистемаКлиент.СохранитьФайлы(Новый ОписаниеОповещения(
			"СохранитьДанныеВместеСПодписьюПослеПолученияФайлов", ЭтотОбъект, Неопределено),
			ПередаваемыеФайлы, ПараметрыСохраненияФайлов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеВместеСПодписьюПослеПолученияФайлов(ПолученныеФайлы, Контекст) Экспорт
	
	Если ПолученныеФайлы = Неопределено ИЛИ ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КаталогСФайлами = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолученныеФайлы[0].ПолноеИмя).Путь;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Файлы сохранены в каталог:'"),
		Новый ОписаниеОповещения("ОткрытьКаталогСФайлами", ЭтотОбъект, КаталогСФайлами),
		КаталогСФайлами);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПервичныеДокументыПослеПолученияФайла(ПолученныеФайлы, Контекст) Экспорт
	
	Если ПолученныеФайлы = Неопределено ИЛИ ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КаталогСФайлами = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолученныеФайлы[0].ПолноеИмя).Путь;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Файлы сохранены в каталог:'"),
		Новый ОписаниеОповещения("ОткрытьКаталогСФайлами", ЭтотОбъект, КаталогСФайлами),
		КаталогСФайлами);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталогСФайлами(КаталогСФайлами) Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьПроводник(КаталогСФайлами);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбеспечитьУникальностьИменФайлов(ОписаниеФайлов)
	
	УникальныеИменаФайлов = Новый Соответствие;
	
	Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
		
		НомерФайла = УникальныеИменаФайлов[ОписаниеФайла.Имя];
		
		Если НомерФайла = Неопределено Тогда
			УникальныеИменаФайлов.Вставить(ОписаниеФайла.Имя, 0);
			Продолжить;
		КонецЕсли;
		
		ПорядковыйНомерНовогоФайла = НомерФайла + 1;
		
		УникальныеИменаФайлов.Вставить(ОписаниеФайла.Имя, ПорядковыйНомерНовогоФайла);
		
		РазложенноеИмяФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ОписаниеФайла.Имя);
		ИмяБезРасширения = РазложенноеИмяФайла.ИмяБезРасширения;
		
		ОписаниеФайла.Имя = РазложенноеИмяФайла.Путь
			+ РазложенноеИмяФайла.ИмяБезРасширения
			+ " ("+ Строка(ПорядковыйНомерНовогоФайла) + ")"
			+ РазложенноеИмяФайла.Расширение;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресXMLПодписанныхДанных(АдресДанных, УИД)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Буфер = Новый БуферДвоичныхДанных(4);
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения().Прочитать(Буфер, 0, 4);
	// документ FastInfoset должен начинаться с шестнадцатеричной последовательности октетов E0 00 00 01,
	// в случае, если необязательная декларация XML отсутствует.
	Если Буфер.ПрочитатьЦелое32(0, ПорядокБайтов.BigEndian) = 3758096385 Тогда
		ЧтениеFastInfoSet = Новый ЧтениеFastInfoSet;
		ЧтениеFastInfoSet.УстановитьДвоичныеДанные(ДвоичныеДанные);
		Возврат ПоместитьВоВременноеХранилище(ПрочитатьXML(ЧтениеFastInfoSet), УИД);
	Иначе
		Возврат ПоместитьВоВременноеХранилище(ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные), УИД);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодписи(УсиленныеПодписи, ПростыеПодписи)
	
	Если УсиленныеПодписи.Количество() > 0 Тогда
		
		Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
			Возврат;
		КонецЕсли;
		
		ЗапущенаПроверкаСоответствияПодписанныхИТекущихДанных = Ложь;
		
		// Объединим простые и усиленные подписи так, чтобы простые подписи располагались в начале массива
		// проверка криптопровайдером начнется с первой усиленной подписи
		ПроверяемыйИндекс = ПростыеПодписи.ВГраница() + 1;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПростыеПодписи, УсиленныеПодписи);
		
		ПараметрыОповещения = Новый Структура("ПодписиДляПроверки, ПроверяемыйИндекс", ПростыеПодписи, ПроверяемыйИндекс);
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиОчереднойПодписи", ЭтотОбъект, ПараметрыОповещения);
		
		ПроцессыОбработкиДокументовКлиент.ПроверитьПодпись(Оповещение,
			ПростыеПодписи[ПроверяемыйИндекс].АдресДанных, ПростыеПодписи[ПроверяемыйИндекс].АдресПодписи);
		
	Иначе
		
		ПроверитьСоответствиеПодписанныхИТекущихДанных(ПростыеПодписи);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиОчереднойПодписи(Результат, ДопПараметры) Экспорт
	
	ПодписиДляПроверки = ДопПараметры.ПодписиДляПроверки;
	ПроверяемыйИндекс = ДопПараметры.ПроверяемыйИндекс;
	
	ПодписиДляПроверки[ПроверяемыйИндекс].ДатаПроверкиПодписи = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Если ТипЗнч(Результат) = Тип("Булево") Тогда
		ПодписиДляПроверки[ПроверяемыйИндекс].ПодписьВерна = Результат;
		ПодписиДляПроверки[ПроверяемыйИндекс].ОписаниеОшибки = "";
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		ТекстОшибки = НСтр("ru = 'Электронная подпись в строке %1 неверна.
			|Причина: %2'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ПодписиДляПроверки[ПроверяемыйИндекс].НомерСтроки, Результат);
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстОшибки,,"ЭлектронныеПодписи["+(ПодписиДляПроверки[ПроверяемыйИндекс].НомерСтроки-1)+"].Статус");
		ПодписиДляПроверки[ПроверяемыйИндекс].ПодписьВерна = Ложь;
		ПодписиДляПроверки[ПроверяемыйИндекс].ОписаниеОшибки = Результат;
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось проверить подписи электронного документа.
			|Проверьте настройки криптографии или обратитесь к администратору.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПроверяемыйИндекс < ПодписиДляПроверки.ВГраница() Тогда
		
		ПараметрыОповещения = Новый Структура("ПодписиДляПроверки, ПроверяемыйИндекс", ПодписиДляПроверки, ПроверяемыйИндекс + 1);
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиОчереднойПодписи", ЭтотОбъект, ПараметрыОповещения);
		
		ПроцессыОбработкиДокументовКлиент.ПроверитьПодпись(Оповещение,
			ПодписиДляПроверки[ПроверяемыйИндекс + 1].АдресДанных, ПодписиДляПроверки[ПроверяемыйИндекс + 1].АдресПодписи);
		
	ИначеЕсли НЕ ЗапущенаПроверкаСоответствияПодписанныхИТекущихДанных Тогда
		
		ЗапущенаПроверкаСоответствияПодписанныхИТекущихДанных = Истина;
		
		// все подписи проверены, запускаем вторую проверку на соответствие текущим данным
		ПроверитьСоответствиеПодписанныхИТекущихДанных(ПодписиДляПроверки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеПодписанныхИТекущихДанных(ПодписиДляПроверки)
	
	Подписи = Новый Массив;
	ТекущийИндекс = 0;
	Для Каждого СтрокаПодписи Из ПодписиДляПроверки Цикл
		Подпись = Новый Структура;
		Подпись.Вставить("СоставПодписи", СтрокаПодписи.АдресСоставаПодписи);
		Подпись.Вставить("ПодписанныеДанные", СтрокаПодписи.АдресДанных);
		Подпись.Вставить("Индекс", ТекущийИндекс);
		Подпись.Вставить("ОписаниеОшибки", "");
		Подпись.Вставить("ДатаПодписи", СтрокаПодписи.ДатаПодписи);
		Подпись.Вставить("КомуВыданСертификат", СтрокаПодписи.КомуВыданСертификат);
		Подпись.Вставить("Этап", СтрокаПодписи.Этап);
		Подпись.Вставить("УстановившийПодпись", СтрокаПодписи.УстановившийПодпись);
		Подписи.Добавить(Подпись);
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	
	ДанныеДокумента = Новый Структура("Документ, ДополнительныеПараметры", Параметры.ЗначениеОтбора, Неопределено);
	ДанныеДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеДокумента);
	
	ОписаниеОшибки = "";
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДанныеДокументов, ОписаниеОшибки);
	// При ошибке подготовки данных документа, все данные считаем неактуальными
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Для Каждого СтрокаПодписи Из Подписи Цикл
			СтрокаПодписи.ОписаниеОшибки = ОписаниеОшибки;
		КонецЦикла;
	Иначе
		ПроцессыОбработкиДокументовВызовСервера.ПроверитьСоответствиеПодписанныхИТекущихДанных(Параметры.ЗначениеОтбора, Подписи, ДанныеДокументов[0].ДополнительныеПараметры);
	КонецЕсли;
	
	Для Каждого СтрокаПодписи Из Подписи Цикл
		
		ПодписиДляПроверки[СтрокаПодписи.Индекс].ДатаПроверкиДанных = ОбщегоНазначенияКлиент.ДатаСеанса();
		ПодписиДляПроверки[СтрокаПодписи.Индекс].ДанныеАктуальны = НЕ ЗначениеЗаполнено(СтрокаПодписи.ОписаниеОшибки);
		
		МассивСтрокОписаниеОшибки = СтрРазделить(СтрокаПодписи.ОписаниеОшибки, Символы.ПС);
		Если МассивСтрокОписаниеОшибки.Количество() > 1 Тогда
			МассивСтрокОписаниеОшибки.Удалить(0);
			ОписаниеОшибкиДанных = СтрСоединить(МассивСтрокОписаниеОшибки, Символы.ПС);
		Иначе
			ОписаниеОшибкиДанных = СтрокаПодписи.ОписаниеОшибки;
		КонецЕсли;
		ПодписиДляПроверки[СтрокаПодписи.Индекс].ОписаниеОшибкиДанных = ОписаниеОшибкиДанных;
		
		ЗаполнитьСтатусПодписи(ПодписиДляПроверки[СтрокаПодписи.Индекс]);
		
		Если ЗначениеЗаполнено(СтрокаПодписи.ОписаниеОшибки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Данные, подписанные электронной подписью в строке %1, неактуальны.'"),
				ПодписиДляПроверки[СтрокаПодписи.Индекс].НомерСтроки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки + "
				|"+СтрокаПодписи.ОписаниеОшибки,
				,
				"ЭлектронныеПодписи["+(ПодписиДляПроверки[СтрокаПодписи.Индекс].НомерСтроки-1)+"].СтатусПроверкиДанных");
		КонецЕсли;
	КонецЦикла;
	
	СохранитьРезультатыПроверкиПодписей(ЭлектронныеПодписи);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСтатусПодписи(СтрокаПодписи)
	
	Если Не ЗначениеЗаполнено(СтрокаПодписи.ДатаПроверкиПодписи) Тогда
		СтрокаПодписи.Статус = "";
	ИначеЕсли НЕ СтрокаПодписи.ПодписьВерна Тогда
		СтрокаПодписи.Статус = НСтр("ru = 'Неверна'");
	Иначе
		СтрокаПодписи.Статус = НСтр("ru = 'Верна'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаПодписи.ДатаПроверкиДанных) Тогда
		СтрокаПодписи.СтатусПроверкиДанных = "";
	ИначеЕсли НЕ СтрокаПодписи.ДанныеАктуальны Тогда
		СтрокаПодписи.СтатусПроверкиДанных = НСтр("ru = 'Отличаются от текущих'");
	Иначе
		СтрокаПодписи.СтатусПроверкиДанных = НСтр("ru = 'Соответствуют текущим'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьРезультатыПроверкиПодписей(Знач ПодписиВФорме)
	
	Для Каждого Строка Из ПодписиВФорме Цикл
		
		Если Строка.ПростаяПодпись Тогда
			Продолжить;
		КонецЕсли;
		
		ПодписиВОбъекте = ПроцессыОбработкиДокументов.УстановленныеПодписи(Строка.Задача);
		СтрокаВОбъекте = ПодписиВОбъекте.Получить(Строка.ПорядковыйНомер - 1);
		
		Если Строка.ДатаПодписи <> СтрокаВОбъекте.ДатаПодписи
			ИЛИ Строка.КомуВыданСертификат <> СтрокаВОбъекте.КомуВыданСертификат
			ИЛИ Строка.Отпечаток <> СтрокаВОбъекте.Отпечаток
			ИЛИ Строка.УстановившийПодпись <> СтрокаВОбъекте.УстановившийПодпись Тогда
			Продолжить; // Если подпись была изменена, результаты проверки не переносятся.
		КонецЕсли;
		
		Если Строка.ДатаПроверкиПодписи = СтрокаВОбъекте.ДатаПроверкиПодписи
			И Строка.ПодписьВерна = СтрокаВОбъекте.ПодписьВерна Тогда
			Продолжить; // Не нужно обновлять данные проверки, если результаты проверки совпадают.
		КонецЕсли;
		
		СтрокаВОбъекте.ПодписьВерна = Строка.ПодписьВерна;
		СтрокаВОбъекте.ДатаПроверкиПодписи = Строка.ДатаПроверкиПодписи;
		
		ПроцессыОбработкиДокументов.ОбновитьПодпись(Строка.Задача, СтрокаВОбъекте);
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// сохранение результатов проверки соответствия подписанных и текущих данных
	Для Каждого Строка Из ПодписиВФорме Цикл
		
		НаборЗаписей = РегистрыСведений.ПодписанныеДанные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Задача.Установить(Строка.Задача);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 1 Тогда
			
			ТекущаяЗапись = НаборЗаписей[0];
			Если Строка.ДатаПроверкиДанных = ТекущаяЗапись.ДатаПроверкиДанных
				И Строка.ДанныеАктуальны = ТекущаяЗапись.ДанныеАктуальны
				И Строка.ОписаниеОшибкиДанных = ТекущаяЗапись.ОписаниеОшибки Тогда
				Продолжить; // Не нужно обновлять данные проверки, если результаты проверки совпадают.
			КонецЕсли;
			
			ТекущаяЗапись.ДатаПроверкиДанных = Строка.ДатаПроверкиДанных;
			ТекущаяЗапись.ДанныеАктуальны = Строка.ДанныеАктуальны;
			ТекущаяЗапись.ОписаниеОшибки = Строка.ОписаниеОшибкиДанных;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписки()
	
	ЗаполнитьСписокЗадач(ПоказыватьВыполненные);
	
	ТекущийСтатус = ТекущийСтатус(Параметры.ЗначениеОтбора);
	
	ЗаполнитьПорядокТекущегоЭтапа();
	
	ЗаполнитьСписокПодписей();

	ЗаполнитьФормулярыДокументов();
	Если ФормулярыДокументов.Количество() > 0 Тогда
		ЗаполнитьПредставленияЭлектронныхДокументов();
	Иначе	
		ЗаполнитьСохраненныеПредставленияЭлектронныхДокументов();
	КонецЕсли;	
	
	ЗаполнитьПервичныеДокументы();
	
	ЗаполнитьТекущийРегламентныйИнтервал();
	
	УстановитьДоступностьКнопок();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийСтатус(ДокументСсылка)
	
	ТаблицаСтатусовДокументов = ПроцессыОбработкиДокументов.СтатусыОбъектов(ДокументСсылка);
	Если ТаблицаСтатусовДокументов.Количество() > 0 Тогда
		Возврат ТаблицаСтатусовДокументов[0].Статус;
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЗадач(ПоказатьВсеЗадачи)
	
	СписокЗадач.Очистить();
	
	// Проверка права на чтение документа перед получением списка задач
	ЗапросПоПравамДоступа = Новый Запрос;
	ЗапросПоПравамДоступа.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	"+ОбщегоНазначения.ИмяТаблицыПоСсылке(Параметры.ЗначениеОтбора)+" КАК Т
	|ГДЕ
	|	Т.Ссылка = &Документ";
	ЗапросПоПравамДоступа.УстановитьПараметр("Документ", Параметры.ЗначениеОтбора);
	ЗапросПоПравамДоступа.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Ссылка КАК Ссылка,
	|	Задачи.ПометкаУдаления КАК ПометкаУдаления,
	|	Задачи.Номер КАК Номер,
	|	Задачи.Дата КАК Дата,
	|	Задачи.Наименование КАК Наименование,
	|	Задачи.Выполнена КАК Выполнена,
	|	ВЫБОР
	|		КОГДА Задачи.Выполнена
	|			ТОГДА 1
	|		КОГДА НЕ СоставПачекВыполняемыхЗадач.Задача ЕСТЬ NULL
	|			ТОГДА 3
	|		КОГДА Задачи.Исполнитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Задачи.НеВыполненаИзЗаОшибки
	|						ТОГДА 5
	|					ИНАЧЕ 4
	|				КОНЕЦ
	|		КОГДА Задачи.НеВыполненаИзЗаОшибки
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерКартинки,
	|	Задачи.Прервана КАК Прервана,
	|	Задачи.Автор КАК Автор,
	|	Задачи.РезультатВыполнения КАК РезультатВыполнения,
	|	Задачи.Исполнитель КАК Исполнитель,
	|	Задачи.РольИсполнителя КАК РольИсполнителя,
	|	Задачи.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	Задачи.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации,
	|	Задачи.Представление КАК Представление,
	|	Задачи.ПринятаКИсполнению КАК ПринятаКИсполнению,
	|	ИсторияИзмененияСтатусовДокументов.Статус КАК Статус,
	|	Задачи.ДатаИсполнения КАК ДатаИсполнения,
	|	Задачи.ПодписанЭП КАК ПодписанЭП,
	|	Задачи.Этап КАК Этап,
	|	Задачи.НеВыполненаИзЗаОшибки КАК НеВыполненаИзЗаОшибки
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК Задачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияСтатусовДокументов КАК ИсторияИзмененияСтатусовДокументов
	|		ПО Задачи.Предмет = ИсторияИзмененияСтатусовДокументов.Предмет
	|			И Задачи.Ссылка = ИсторияИзмененияСтатусовДокументов.Установил
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставПачекВыполняемыхЗадач КАК СоставПачекВыполняемыхЗадач
	|		ПО Задачи.Ссылка = СоставПачекВыполняемыхЗадач.Задача
	|ГДЕ
	|	Задачи.Предмет = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Задачи.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущиеНевыполненныеЗадачи.Ссылка КАК Ссылка,
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК ИдентификаторГрупповогоЭтапа,
	|	ШаблоныПроцессовЭтапы.Этап.Наименование КАК НаименованиеГрупповогоЭтапа
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента.ЗадачиПоИсполнителю(
	|			,
	|			Предмет = &Документ
	|				И НЕ Выполнена) КАК ТекущиеНевыполненныеЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО (ШаблоныПроцессовЭтапы.Ссылка = ТекущиеНевыполненныеЗадачи.Шаблон)
	|			И (ШаблоныПроцессовЭтапы.ИдентификаторЭтапаКуратора = ТекущиеНевыполненныеЗадачи.ИдентификаторЭтапа)";
	
	Запрос.УстановитьПараметр("Документ", Параметры.ЗначениеОтбора);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПолныйСписокЗадач.Загрузить(Результат[0].Выгрузить());
	
	ЭтоКураторГрупповогоЭтапа = Ложь;
	ИдентификаторГрупповогоЭтапа = "";
	НаименованиеГрупповогоЭтапа = "";
	
	Выборка = Результат[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтоКураторГрупповогоЭтапа = Истина;
		ИдентификаторГрупповогоЭтапа = Выборка.ИдентификаторГрупповогоЭтапа;
		НаименованиеГрупповогоЭтапа = НСтр("ru = 'Ход выполнения группового этапа: '") + Выборка.НаименованиеГрупповогоЭтапа;
	КонецЕсли;
	
	ОтобратьЗадачиДляОтображения(ПоказатьВсеЗадачи);
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьЗадачиДляОтображения(ПоказатьВсеЗадачи)
	
	Если ПоказатьВсеЗадачи Тогда
		СписокЗадач.Загрузить(ПолныйСписокЗадач.Выгрузить());
	Иначе
		СписокЗадач.Загрузить(ПолныйСписокЗадач.Выгрузить(Новый Структура("Выполнена", Ложь)));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПодписей()
	
	ЭлектронныеПодписи.Очистить();
	
	ЭП = СписокЭлектронныхПодписей(Параметры.ЗначениеОтбора, УникальныйИдентификатор);
	
	НомерСтроки = 0;
	
	Для Каждого ЭлектроннаяПодписьФайла Из ЭП Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ЭлектронныеПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлектроннаяПодписьФайла);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.КартинкаЭП = ?(НоваяСтрока.ПростаяПодпись, 3, 1);
		
		ЗаполнитьСтатусПодписи(НоваяСтрока);
		
	КонецЦикла;
	
	ТекстЗаголовка = НСтр("ru = 'Электронные подписи'");
	
	Если ЭлектронныеПодписи.Количество() <> 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(ЭлектронныеПодписи.Количество()) + ")";
	КонецЕсли;
	
	Элементы.ГруппаЭлектронныеПодписи.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокЭлектронныхПодписей(Предмет, УникальныйИдентификатор)
	
	ЭлектронныеПодписи = УстановленныеПодписи(Предмет);
	
	Для Каждого ЭлектроннаяПодписьФайла Из ЭлектронныеПодписи Цикл
		
		ЭлектроннаяПодписьФайла.Вставить("Объект", Предмет);
		
		АдресПодписи = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.Подпись, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.Вставить("АдресПодписи", АдресПодписи);
		
		АдресСертификата = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.Сертификат, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.Вставить("АдресСертификата", АдресСертификата);
		
		АдресСоставаПодписи = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.СоставПодписи, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.Вставить("АдресСоставаПодписи", АдресСоставаПодписи);
		
		Владелец = ЭлектроннаяПодписьФайла.ПодписанныеДанныеФайл;
		ДвоичныеДанныеФайл = Неопределено;
		Если ЗначениеЗаполнено(Владелец) Тогда
			ПрисоединенныеФайлы = Новый Массив; 
			РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Владелец, ПрисоединенныеФайлы);
			Если ПрисоединенныеФайлы.Количество() > 0 Тогда
				ДвоичныеДанныеФайл = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныеФайлы[0], Истина); 
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеФайл) Тогда	
			АдресДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайл, УникальныйИдентификатор);
			ЭлектроннаяПодписьФайла.Вставить("АдресДанных", АдресДанных);

		ИначеЕсли ЭлектроннаяПодписьФайла.ПодписанныеДанные <> Неопределено	Тогда
		
			АдресДанных = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.ПодписанныеДанные, УникальныйИдентификатор);
			ЭлектроннаяПодписьФайла.Вставить("АдресДанных", АдресДанных);
		КонецЕсли;	
		
		РезультатПроверкиПодписиПоМЧД = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.РезультатПроверкиПодписиПоМЧД, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.РезультатПроверкиПодписиПоМЧД = РезультатПроверкиПодписиПоМЧД;
	КонецЦикла;
	
	Возврат ЭлектронныеПодписи;
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановленныеПодписи(Ссылка)
	
	// Проверка права на чтение документа перед получением списка задач
	ЗапросПоПравамДоступа = Новый Запрос;
	ЗапросПоПравамДоступа.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	"+ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка)+" КАК Т
	|ГДЕ
	|	Т.Ссылка = &Документ";
	ЗапросПоПравамДоступа.УстановитьПараметр("Документ", Ссылка);
	ЗапросПоПравамДоступа.Выполнить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Задача,
	|	ЗадачаПоОбработкеДокумента.Этап КАК Этап,
	|	ЗадачаПоОбработкеДокумента.Этап.Наименование КАК НаименованиеЭтапа,
	|	РегистрСведенийПодписанныеДанные.СоставПодписи КАК СоставПодписи,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанные КАК ПодписанныеДанные,
	|	РегистрСведенийПодписанныеДанные.ДанныеАктуальны КАК ДанныеАктуальны,
	|	РегистрСведенийПодписанныеДанные.ДатаПроверкиДанных КАК ДатаПроверкиДанных,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл КАК ПодписанныеДанныеФайл,
	|	РегистрСведенийПодписанныеДанные.ОписаниеОшибки КАК ОписаниеОшибкиДанных
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеДанные КАК РегистрСведенийПодписанныеДанные
	|		ПО (РегистрСведенийПодписанныеДанные.Задача = ЗадачаПоОбработкеДокумента.Ссылка)
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.ПодписанЭП
	|	И ЗадачаПоОбработкеДокумента.Предмет = &Документ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачаПоОбработкеДокумента.Дата";
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивЭлектронныхПодписей = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ПодписиВОбъекте = ПроцессыОбработкиДокументов.УстановленныеПодписи(Выборка.Задача);
		
		Если ПодписиВОбъекте.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтпечатокСтруктура = Новый Структура(
			"ПорядковыйНомер, ДатаПодписи, УстановившийПодпись, ПростаяПодпись, ДатаПроверкиПодписи,
			|ИмяФайлаПодписи, КомуВыданСертификат, Отпечаток, Подпись, ПодписьВерна,
			|Сертификат, Задача, Этап, НаименованиеЭтапа, СоставПодписи, ПодписанныеДанные,
			|СоставПодписи, ДанныеАктуальны, ДатаПроверкиДанных, ОписаниеОшибкиДанных,
			|ВладелецПодписи, Организация, Должность, ТипПодписи, РезультатПроверкиПодписиПоМЧД,
			|МашиночитаемаяДоверенность, МашиночитаемаяДоверенностьВерна, ПодписанныеДанныеФайл");
		
		ЗаполнитьЗначенияСвойств(ОтпечатокСтруктура, ПодписиВОбъекте[0]);
		ЗаполнитьЗначенияСвойств(ОтпечатокСтруктура, Выборка);
		
		Если ОтпечатокСтруктура.ПростаяПодпись = Неопределено Тогда
			ОтпечатокСтруктура.Сертификат = ОтпечатокСтруктура.Сертификат.Получить();
		КонецЕсли;
		ОтпечатокСтруктура.СоставПодписи = ОтпечатокСтруктура.СоставПодписи.Получить();
		ОтпечатокСтруктура.ПодписанныеДанные = ОтпечатокСтруктура.ПодписанныеДанные.Получить();
		
		Если ЗначениеЗаполнено(ОтпечатокСтруктура.РезультатПроверкиПодписиПоМЧД) Тогда
			ОтпечатокСтруктура.МашиночитаемаяДоверенностьВерна = ОтпечатокСтруктура.РезультатПроверкиПодписиПоМЧД[0].Верна;
			ОтпечатокСтруктура.МашиночитаемаяДоверенность = ОтпечатокСтруктура.РезультатПроверкиПодписиПоМЧД[0].МашиночитаемаяДоверенность;
		КонецЕсли;	
		
		МассивЭлектронныхПодписей.Добавить(ОтпечатокСтруктура);
		
	КонецЦикла;
	
	Возврат МассивЭлектронныхПодписей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФормулярыДокументов()

	УстановитьПривилегированныйРежим(Истина);
	
	ФормулярыДокументов.Очистить();

	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Параметры.ЗначениеОтбора));
	КомандыПечати = МодульУправлениеПечатью.КомандыПечатиОбъекта(ОбъектМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК ДанныеПредставленияПервичногоДокумента,
	               |	ВЫРАЗИТЬ(ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).ИдентификаторФормуляра КАК ИдентификаторФормуляра,
	               |	ВЫРАЗИТЬ(ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).НаименованиеДокумента КАК Представление,
	               |	ВЫРАЗИТЬ(ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).НомерДокумента КАК НомерДокумента,
	               |	ВЫРАЗИТЬ(ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).ДатаДокумента КАК ДатаДокумента,
	               |	ВЫРАЗИТЬ(ФайлыФормуляровЭДПОД.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).ОсновнойФайл.ДатаМодификацииУниверсальная КАК ДатаФормирования,
	               |	ФайлыФормуляровЭДПОД.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы
	               |ПОМЕСТИТЬ Формуляры
	               |ИЗ
	               |	РегистрСведений.ФайлыФормуляровЭДПОД КАК ФайлыФормуляровЭДПОД
	               |ГДЕ
	               |	ФайлыФормуляровЭДПОД.Предмет = &Предмет
	               |	И ФайлыФормуляровЭДПОД.КодВидаСведений = 1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Формуляры.ДанныеПредставленияПервичногоДокумента КАК ДанныеПредставленияПервичногоДокумента,
	               |	Формуляры.ИдентификаторФормуляра КАК ИдентификаторФормуляра,
	               |	Формуляры.Представление КАК Представление,
	               |	Формуляры.НомерДокумента КАК НомерДокумента,
	               |	Формуляры.ДатаДокумента КАК ДатаДокумента,
	               |	Формуляры.ДатаФормирования КАК ДатаФормирования,
	               |	Формуляры.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы
	               |ИЗ
	               |	Формуляры КАК Формуляры
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЫРАЗИТЬ(Формуляры.ДанныеПредставленияПервичногоДокумента КАК Документ.ФормулярПервичногоДокументаПОД).ОсновнойФайл.ДатаМодификацииУниверсальная УБЫВ";
	
	Запрос.УстановитьПараметр("Предмет", Параметры.ЗначениеОтбора);
	Запрос.УстановитьПараметр("ВариантФормированияИПодписания", Перечисления.ВариантыФормированияФормуляровПОД.ФормироватьИПодписыватьТолькоНаЭтомЭтапе);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ФормулярыДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
	КонецЦикла;
	
	ТекстЗаголовка = НСтр("ru = 'Формуляры'");
	
	Если ФормулярыДокументов.Количество() > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(ФормулярыДокументов.Количество()) + ")";
	КонецЕсли;
	
	Элементы.СтраницаПодписанныеПредставленияЭД.Заголовок = ТекстЗаголовка;
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыФормуляров(ЭтаФорма);

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервичныеДокументы()
	
	ПервичныеДокументы.Очистить();
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Параметры.ЗначениеОтбора));
	КомандыПечати = МодульУправлениеПечатью.КомандыПечатиОбъекта(ОбъектМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервичныеДокументыПОД.ИдентификаторПечатнойФормы КАК ИдентификаторПечатнойФормы,
	|	ПервичныеДокументыПОД.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ПервичныеДокументыПОД.ВидДокумента КАК ВидДокумента
	|ИЗ
	|	РегистрСведений.ПервичныеДокументыПОД КАК ПервичныеДокументыПОД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрисоединенныеФайлыПодписанныеЗадачами КАК ПрисоединенныеФайлыПодписанныеЗадачами
	|		ПО ПервичныеДокументыПОД.ПервичныйДокумент = ПрисоединенныеФайлыПодписанныеЗадачами.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО (ПрисоединенныеФайлыПодписанныеЗадачами.ИдентификаторЭтапа = ШаблоныПроцессовЭтапы.ИдентификаторЭтапа)
	|			И (ШаблоныПроцессовЭтапы.Ссылка = &ШаблонПроцесса)
	|ГДЕ
	|	ПервичныеДокументыПОД.Предмет = &Документ
	|	И ПервичныеДокументыПОД.Формат = ""mxl""
	|	И ШаблоныПроцессовЭтапы.Порядок <= &ПорядокТекущегоЭтапа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПрисоединенныеФайлыПодписанныеЗадачами.Задача.ДатаИсполнения";
	
	Запрос.УстановитьПараметр("Документ", Параметры.ЗначениеОтбора);
	Запрос.УстановитьПараметр("ШаблонПроцесса", ШаблонПроцесса);
	Запрос.УстановитьПараметр("ПорядокТекущегоЭтапа", ПорядокТекущегоЭтапа);
	
	ИдентификаторыИзРегистра = Новый Соответствие;
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Пока Выборка.Следующий() Цикл
		Документ = Новый Структура("ПервичныйДокумент, ВидДокумента", Выборка.ПервичныйДокумент, Выборка.ВидДокумента);
		ИдентификаторыИзРегистра.Вставить(Выборка.ИдентификаторПечатнойФормы, Документ);
	КонецЦикла;
	
	// сначала выводятся первичные документы в соответствии с сортировкой команд печати,
	// а потом отсутствующие в текущих командах печати
	Для Каждого КомандаПечати Из КомандыПечати Цикл
		Документ = ИдентификаторыИзРегистра[КомандаПечати.Идентификатор];
		Если Документ <> Неопределено Тогда
			НоваяСтрока = ПервичныеДокументы.Добавить();
			НоваяСтрока.ИдентификаторПечатнойФормы = КомандаПечати.Идентификатор;
			НоваяСтрока.Представление = Документ.ВидДокумента;
			НоваяСтрока.ПервичныйДокумент = Документ.ПервичныйДокумент;
			ИдентификаторыИзРегистра.Удалить(КомандаПечати.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ИдентификаторыИзРегистра Цикл
		НоваяСтрока = ПервичныеДокументы.Добавить();
		НоваяСтрока.ИдентификаторПечатнойФормы = КлючЗначение.Ключ;
		НоваяСтрока.Представление = КлючЗначение.Значение.ВидДокумента;
		НоваяСтрока.ПервичныйДокумент = КлючЗначение.Значение.ПервичныйДокумент;
	КонецЦикла;
	
	ТекстЗаголовка = НСтр("ru = 'Первичные документы'");
	
	Если ПервичныеДокументы.Количество() > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(ПервичныеДокументы.Количество()) + ")";
	КонецЕсли;
	
	Элементы.СтраницаПервичныеДокументы.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопок()

	ВидимостьПредставленийЭД = ПредставленияЭлектронныхДокументов.Количество() > 0;
	ВидимостьФормуляровЭД = ФормулярыДокументов.Количество() > 0;
	
	ДоступностьКнопокЭП = ЭлектронныеПодписи.Количество() > 0;
	ВидимостьПервичныхДокументов = ПервичныеДокументы.Количество() > 0;
	ВидимостьЗакладкиПервичныхДокументов = ВидимостьПервичныхДокументов;
	ВидимостьСохраненныхПредставленийЭД = ПервичныеДокументы.Количество() > 0;
	
	ВидимостьЗакладкиПервичныхДокументов = ВидимостьПервичныхДокументов;

	СтраницаПервичныеДокументы = Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПервичныеДокументы;
	
	Элементы.ЭлектронныеПодписиОткрыть.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиПроверить.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиПроверитьВсе.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиСохранить.Доступность = ДоступностьКнопокЭП;
	
	Элементы.ЭлектронныеПодписиПросмотреть.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиСохранитьДанные.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиСохранитьДанныеСПодписью.Доступность = ДоступностьКнопокЭП;
	Элементы.ЭлектронныеПодписиСохранитьДанныеСПодписьюВсе.Доступность = ДоступностьКнопокЭП;
	
	Элементы.НаименованиеГрупповогоЭтапа.Видимость = ЭтоКураторГрупповогоЭтапа;
	
	Элементы.ФормаТекущийРегламентныйИнтервал.Видимость = ЗначениеЗаполнено(ТекущийРегламентныйИнтервал);
	
	Элементы.ГруппаСохраненныеФормуляры.Видимость = ВидимостьФормуляровЭД;
	Элементы.ГруппаСохраненныеПредставленияЭД.Видимость = ВидимостьПредставленийЭД;
	
	Элементы.ПервичныеДокументы.Видимость = ВидимостьПервичныхДокументов;
	Элементы.ПервичныйДокумент.Видимость = ВидимостьПервичныхДокументов;
	Элементы.ГруппаСтраницы.ОтображениеСтраниц =
		?(ВидимостьЗакладкиПервичныхДокументов ИЛИ ВидимостьПредставленийЭД ИЛИ ВидимостьФормуляровЭД, ОтображениеСтраницФормы.Авто, ОтображениеСтраницФормы.Нет);
	
	Элементы.ФормаПечать.Видимость = СтраницаПервичныеДокументы;
	Элементы.ФормаПредварительныйПросмотр.Видимость = СтраницаПервичныеДокументы;
	Элементы.ПервичныеДокументыГруппаСохранить.Видимость = СтраницаПервичныеДокументы;

	Элементы.СтраницаПодписанныеПредставленияЭД.Видимость = ВидимостьФормуляровЭД;
	Элементы.СтраницаНеПодписанныеПредставленияЭД.Видимость = ВидимостьПредставленийЭД;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаПодписанныеПредставленияЭД",
		"Видимость",
		ФормированиеФормуляровВключено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаНеПодписанныеПредставленияЭД",
		"Видимость",
		ФормированиеФормуляровВключено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаВнешниеЭД",
		"Видимость",
		ВнешниеЭлектронныеДокументы.Количество() > 0);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОтправитьКакВнешнийЭД",
		"Видимость",
		ФормированиеФормуляровВключено И РазрешенаОтправкаФормуляровКонтрагентамПоЭДО);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОтправитьКакВнешнийЭДКопию",
		"Видимость",
		ФормированиеФормуляровВключено И РазрешенаОтправкаФормуляровКонтрагентамПоЭДО);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьТекущиеДелаЭДО",
		"Видимость",
		ФормированиеФормуляровВключено И РазрешенаОтправкаФормуляровКонтрагентамПоЭДО);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьТекущиеДелаЭДОДляВизуализации",
		"Видимость",
		ФормированиеФормуляровВключено И РазрешенаОтправкаФормуляровКонтрагентамПоЭДО);
		
	ПроцессыОбработкиДокументовПереопределяемый.УстановитьСвойстваЭлементовКарточкиПроцессаДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//Тип файла формуляра внешнего ЭДО
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВнешниеЭлектронныеДокументыНаименованиеТипаФайла");

	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВнешниеЭлектронныеДокументы.ТипФайлаФормуляра");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = 1;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Текст");
	ЭлементШрифтаОформления.Значение = НСтр("ru = 'Оригинал'");
	ЭлементШрифтаОформления.Использование = Истина;

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВнешниеЭлектронныеДокументыНаименованиеТипаФайла");

	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВнешниеЭлектронныеДокументы.ТипФайлаФормуляра");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = 2;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Текст");
	ЭлементШрифтаОформления.Значение = НСтр("ru = 'Копия'");
	ЭлементШрифтаОформления.Использование = Истина;
	
	// Установка оформления для задач, не принятых к исполнению.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокЗадач");
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗадач.ПринятаКИсполнению");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Ложь;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Шрифт");
	ЭлементШрифтаОформления.Значение = Метаданные.ЭлементыСтиля.НеПринятыеКИсполнениюЗадачи.Значение; 
	ЭлементШрифтаОформления.Использование = Истина;
	
	// Установка оформления для прерванных задач.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокЗадач");
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЗадач.Прервана");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Шрифт");
	ЭлементШрифтаОформления.Значение = Новый Шрифт(Новый Шрифт, , , , , , Истина, );
	ЭлементШрифтаОформления.Использование = Истина;
	
	// Установка оформления для простых электронных подписей.
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЭлектронныеПодписиСтатус");
	
	ЭлементОтбораДанных = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭлектронныеПодписи.ПростаяПодпись");
	ЭлементОтбораДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбораДанных.ПравоеЗначение = Истина;
	ЭлементОтбораДанных.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("Текст");
	ЭлементШрифтаОформления.Значение = "<проверка не выполняется>";
	ЭлементШрифтаОформления.Использование = Истина;
	
	ЭлементШрифтаОформления = ЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
	ЭлементШрифтаОформления.Значение = WebЦвета.Серый;
	ЭлементШрифтаОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДополнительныеКомандыКарточкиПроцессаДокумента()
	
	МассивКоманд = Новый Массив;
	ПараметрыДополнительныхКоманд = Новый Структура;
	
	ПроцессыОбработкиДокументовПереопределяемый.ОписаниеДополнительныхКомандКарточкиПроцессаДокумента(МассивКоманд);
	
	Для Каждого ДополнительнаяКоманда Из МассивКоманд Цикл
		
		Команда = Команды.Добавить(ДополнительнаяКоманда.Идентификатор);
		Команда.Заголовок = ДополнительнаяКоманда.Представление;
		Команда.Действие = "Подключаемый_ВыполнитьДополнительнуюКоманду";
		Если ДополнительнаяКоманда.Свойство("Картинка") Тогда
			Команда.Картинка = ДополнительнаяКоманда.Картинка;
		КонецЕсли;
		
		Элемент = Элементы.Добавить(ДополнительнаяКоманда.Идентификатор, Тип("КнопкаФормы"), Элементы.КоманднаяПанельСписка);
		Элемент.ИмяКоманды = ДополнительнаяКоманда.Идентификатор;
		Элемент.ТолькоВоВсехДействиях = Истина;
		
		ПараметрыКоманды = Новый Структура("Серверная", ДополнительнаяКоманда.Свойство("Серверная"));
		ПараметрыДополнительныхКоманд.Вставить(ДополнительнаяКоманда.Идентификатор, ПараметрыКоманды);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюКомандЗадач(ТекущиеДанные)
	
	ДоступностьОтменитьПринятиеКИсполнению = Ложь;
	ДоступностьОтменитьВыполнение = Ложь;
	
	Если ТекущиеДанные = Неопределено Тогда
		
	ИначеЕсли НЕ ТекущиеДанные.Выполнена
		И ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьОтменитьПринятиеКИсполнению = Истина;
	ИначеЕсли ТекущиеДанные.Выполнена И НЕ ТекущиеДанные.Прервана Тогда
		ДоступностьОтменитьВыполнение = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокЗадачКонтекстноеМенюОтменитьПринятиеКИсполнению", "Доступность", ДоступностьОтменитьПринятиеКИсполнению);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокЗадачКонтекстноеМенюОтменитьВыполнение", "Доступность", ДоступностьОтменитьВыполнение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиНаКлиенте()
	
	ЗапомнитьВыделеннуюЗадачу();
	
	ОбновитьСписки();
	
	УстановитьТекущуюЗадачу();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьВыделеннуюЗадачу()
	
	ТекущиеДанные = Элементы.СписокЗадач.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВыделеннаяЗадача = Неопределено;
	Иначе
		ВыделеннаяЗадача = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюЗадачу()
	
	Если НЕ ЗначениеЗаполнено(ВыделеннаяЗадача) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из СписокЗадач Цикл
		Если Задача.Ссылка = ВыделеннаяЗадача Тогда
			Элементы.СписокЗадач.ТекущаяСтрока = Задача.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущийРегламентныйИнтервал()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьРегламентныеИнтервалы") Тогда
		Возврат;
	КонецЕсли;
	
	РегламентныйИнтервалДокумента = ПроцессыОбработкиДокументов.АктивныйРегламентныйИнтервалДокумента(Параметры.ЗначениеОтбора);
	
	ТекущийРегламентныйИнтервал = РегламентныйИнтервалДокумента.РегламентныйИнтервал;
	ТекущийНомерИтерации = РегламентныйИнтервалДокумента.НомерИтерации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлектроннуюПодпись()
	
	ТекущиеДанные = Элементы.ЭлектронныеПодписи.ТекущиеДанные;
	
	Если ТекущиеДанные.ПростаяПодпись Тогда
		ПроцессыОбработкиДокументовКлиент.ОткрытьПростуюПодпись(ТекущиеДанные);
	ИначеЕсли ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		ПроцессыОбработкиДокументовКлиент.ОткрытьПодпись(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокТекущегоЭтапа()
	
	ПорядокТекущегоЭтапа = ПроцессыОбработкиДокументов.ПорядокТекущегоЭтапаШаблонаПроцесса(
		Параметры.ЗначениеОтбора, ШаблонПроцесса);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныйДокумент()
	ПервичныйДокументMXL.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВизуализациюПервичногоДокумента(ИдентификаторПечатнойФормы, ПервичныйДокумент)
	
	ПервичныйДокументMXL = ПроцессыОбработкиДокументов.ВизуализацияПервичногоДокумента(
		Параметры.ЗначениеОтбора, ИдентификаторПечатнойФормы, ПервичныйДокумент, ШаблонПроцесса, ПорядокТекущегоЭтапа);
	
КонецПроцедуры

&НаСервере
Функция ВыборкаФайловПервичногоДокумента(ИдентификаторПечатнойФормы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервичныеДокументыПОД.ПервичныйДокумент КАК ПервичныйДокумент
	|ИЗ
	|	РегистрСведений.ПервичныеДокументыПОД КАК ПервичныеДокументыПОД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрисоединенныеФайлыПодписанныеЗадачами КАК ПрисоединенныеФайлыПодписанныеЗадачами
	|		ПО ПервичныеДокументыПОД.ПервичныйДокумент = ПрисоединенныеФайлыПодписанныеЗадачами.Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО (ПрисоединенныеФайлыПодписанныеЗадачами.ИдентификаторЭтапа = ШаблоныПроцессовЭтапы.ИдентификаторЭтапа)
	|			И (ШаблоныПроцессовЭтапы.Ссылка = &ШаблонПроцесса)
	|ГДЕ
	|	ПервичныеДокументыПОД.Предмет = &Документ
	|	И ПервичныеДокументыПОД.ИдентификаторПечатнойФормы = &ИдентификаторПечатнойФормы
	|	И ШаблоныПроцессовЭтапы.Порядок < &ПорядокТекущегоЭтапа
	|
	|СГРУППИРОВАТЬ ПО
	|	ПервичныеДокументыПОД.ПервичныйДокумент";
	
	Запрос.УстановитьПараметр("Документ", Параметры.ЗначениеОтбора);
	Запрос.УстановитьПараметр("ШаблонПроцесса", ШаблонПроцесса);
	Запрос.УстановитьПараметр("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы);
	Запрос.УстановитьПараметр("ПорядокТекущегоЭтапа", ПорядокТекущегоЭтапа);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

&НаСервере
Функция ФайлыПервичногоДокумента(ИдентификаторПечатнойФормы)
	
	ДанныеФайлов = Новый Массив;
	
	ПараметрыДанных = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	
	Выборка = ВыборкаФайловПервичногоДокумента(ИдентификаторПечатнойФормы);
	
	Пока Выборка.Следующий() Цикл
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ПервичныйДокумент, ПараметрыДанных);
		ДанныеФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(
			ДанныеФайла.ИмяФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла));
	КонецЦикла;
	
	Возврат ДанныеФайлов;
	
КонецФункции

&НаСервере
Функция ФайлыПодписиПервичногоДокумента(ИдентификаторПечатнойФормы)
	
	ДанныеФайлов = Новый Массив;
	
	ПараметрыДанных = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПерсональныеНастройки = ЭлектроннаяПодпись.ПерсональныеНастройки();
	
	УникальныеИменаФайлов = Новый Соответствие;
	
	Выборка = ВыборкаФайловПервичногоДокумента(ИдентификаторПечатнойФормы);
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.ПервичныйДокумент, ПараметрыДанных);
		
		ИмяФайла = ДанныеФайла.ИмяФайла;
		
		НомерФайла = УникальныеИменаФайлов[ДанныеФайла.ИмяФайла];
		
		Если НомерФайла = Неопределено Тогда
			УникальныеИменаФайлов.Вставить(ДанныеФайла.ИмяФайла, 0);
		Иначе
			ПорядковыйНомерНовогоФайла = НомерФайла + 1;
			УникальныеИменаФайлов.Вставить(ДанныеФайла.ИмяФайла, ПорядковыйНомерНовогоФайла);
			
			РазложенноеИмяФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДанныеФайла.ИмяФайла);
			ИмяБезРасширения = РазложенноеИмяФайла.ИмяБезРасширения;
			
			ДанныеФайла.ИмяФайла = РазложенноеИмяФайла.Путь
				+ РазложенноеИмяФайла.ИмяБезРасширения
				+ " ("+ Строка(ПорядковыйНомерНовогоФайла) + ")"
				+ РазложенноеИмяФайла.Расширение;
		КонецЕсли;
		
		ДанныеФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(
			ДанныеФайла.ИмяФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла));
		
		Подписи = ЭлектроннаяПодпись.УстановленныеПодписи(Выборка.ПервичныйДокумент);
		Для Каждого Подпись Из Подписи Цикл
			ДанныеФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(
				ПроцессыОбработкиДокументовКлиентСервер.ИмяФайлаПодписиПервичногоДокументаПоУмолчанию(
					ДанныеФайла, Подпись, ПерсональныеНастройки),
				ПоместитьВоВременноеХранилище(Подпись.Подпись)));
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеФайлов;
	
КонецФункции

&НаСервере
Функция ФайлыПодписиВизуализацияПервичногоДокумента(ИдентификаторПечатнойФормы, ПервичныйДокумент)
	
	ДанныеФайлов = ФайлыПодписиПервичногоДокумента(ИдентификаторПечатнойФормы);
	
	ИмяВременногоКаталога = ФайловаяСистема.СоздатьВременныйКаталог();
	
	ПараметрыДанных = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанных.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
	
	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПервичныйДокумент, ПараметрыДанных);
	
	РазложенноеИмяФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДанныеФайла.ИмяФайла);
	
	ИмяФайла = РазложенноеИмяФайла.ИмяБезРасширения + " (визуализация)" + ".pdf";
	ПолноеИмяФайла = ИмяВременногоКаталога + ИмяФайла;
	
	ТабличныйДокумент = ПроцессыОбработкиДокументов.ВизуализацияПервичногоДокумента(
		Параметры.ЗначениеОтбора, ИдентификаторПечатнойФормы, ПервичныйДокумент, ШаблонПроцесса, ПорядокТекущегоЭтапа);
	
	ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF_A_3);
	
	ДанныеФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(
		ИмяФайла, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла))));
	
	Возврат ДанныеФайлов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСохраненныеПредставленияЭлектронныхДокументов()
	УстановитьПривилегированныйРежим(Истина);
	
	ПредставленияЭлектронныхДокументов.Очистить();
	
	ЕстьПредставлениеФормуляра = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.Ссылка КАК ДанныеПредставленияПервичногоДокумента,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ИдентификаторФормуляра КАК ИдентификаторФормуляра,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.НаименованиеДокумента КАК Представление,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.НомерДокумента КАК НомерДокумента,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ДатаДокумента КАК ДатаДокумента,
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ОсновнойФайл.ДатаСоздания КАК ДатаФормирования
	               |ИЗ
	               |	Документ.ПредставлениеФормуляраПервичногоДокументаПОД КАК ПредставлениеФормуляраПервичногоДокументаПОД
	               |ГДЕ
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.Предмет = &Предмет
	               |	И ПредставлениеФормуляраПервичногоДокументаПОД.КодВидаСведений = 1
	               |	И ПредставлениеФормуляраПервичногоДокументаПОД.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПредставлениеФормуляраПервичногоДокументаПОД.ОсновнойФайл.ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("Предмет", Параметры.ЗначениеОтбора);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ПредставленияЭлектронныхДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка); 
		ЕстьПредставлениеФормуляра = Истина;
	КонецЦикла;

	ТекстЗаголовка = НСтр("ru = 'Представление формуляров'");
	
	Если ПредставленияЭлектронныхДокументов.Количество() > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + Строка(ПредставленияЭлектронныхДокументов.Количество()) + ")";
	КонецЕсли;
	
	Элементы.СтраницаНеПодписанныеПредставленияЭД.Заголовок = ТекстЗаголовка;

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПредставленияЭлектронныхДокументов()
	Для Каждого ТекСтрока Из ФормулярыДокументов Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ИдентификаторПечатнойФормы", ТекСтрока.ИдентификаторПечатнойФормы);
		НайденныеСтроки = ПредставленияЭлектронныхДокументов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ПредставленияЭлектронныхДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.ОсновнойФормуляр = ТекСтрока.ДанныеПредставленияПервичногоДокумента;
			
			Реквизиты = "ИдентификаторПечатнойФормы";
			
			СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСтрока.ДанныеПредставленияПервичногоДокумента, Реквизиты);
			НоваяСтрока.ИдентификаторПечатнойФормы = СтруктураДанных.ИдентификаторПечатнойФормы;
		Иначе
			СтрокаФормуляра = НайденныеСтроки[0];
	        ИдентификаторыПрочихФормуляров = СтрокаФормуляра.ИдентификаторыПрочихФормуляров;
			МассивИдентификаторов = СтрРазделить(ИдентификаторыПрочихФормуляров, ",", Ложь);
			МассивИдентификаторов.Добавить(ТекСтрока.ИдентификаторФормуляра);
			ИдентификаторыПрочихФормуляров = СтрСоединить(МассивИдентификаторов, ",");
			СтрокаФормуляра.ИдентификаторыПрочихФормуляров = ИдентификаторыПрочихФормуляров;
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныйДокументФормуляра()
	ФормулярДокументаMXL.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОчиститьТабличныйДокументПредставленияЭлектронногоДокумента()
	ПредставлениеДокументаMXL.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВизуализациюФормуляраДокумента(Предмет, ДокументФормуляраПОД)
	
	ФормулярДокументаMXL = ПроцессыОбработкиДокументов.ВизуализацияФормуляраПервичногоДокумента(
		Параметры.ЗначениеОтбора, ШаблонПроцесса, ДокументФормуляраПОД);
		
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВизуализациюСохраненногоПредставленияЭлектронногоДокумента(СсылкаНаДокументПредставленияФормуляраЭД)
	
	ПредставлениеДокументаMXL = ПроцессыОбработкиДокументов.ВизуализацияПредставленияЭлектронногоДокументаПоСсылке(СсылкаНаДокументПредставленияФормуляраЭД);
		
КонецПроцедуры

&НаСервере
Процедура ОтобразитьВизуализациюПредставленияЭлектронногоДокумента(ДокументФормуляраПОД, ИдентификаторыПрочихФормуляров)
	
	ПредставлениеДокументаMXL = ПроцессыОбработкиДокументов.ВизуализацияИтоговогоФормуляраПервичногоДокумента(
		Параметры.ЗначениеОтбора, ШаблонПроцесса, ДокументФормуляраПОД, ИдентификаторыПрочихФормуляров);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокФайловФормуляра(Команда)

	ТекущиеДанные = Элементы.ФормулярыДокументов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторФормуляра) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИдентификаторФормуляра", ТекущиеДанные.ИдентификаторФормуляра);
		
		ОткрытьФорму("Документ.ФормулярПервичногоДокументаПОД.Форма.ФормаСпискаФайловФормуляров", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормулярВФорматеPDF(Команда)
	ТекущиеДанные = Элементы.ФормулярыДокументов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторФормуляра) Тогда
		ВладелецФайла = ФормулярВФорматеPDF(ТекущиеДанные.ИдентификаторФормуляра);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла", ВладелецФайла);

		ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФормулярВФорматеPDF(ИдентификаторФормуляра)
	
	Возврат ПроцессыОбработкиДокументов.ФормулярПоИдентификаторуИКодуВидаСведений(ИдентификаторФормуляра, 2);
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыФормуляров(Форма)

	Для Каждого ТекущаяСтрока Из Форма.ФормулярыДокументов Цикл
		ОбновитьТекстЗаголовковВСтрокеФормуляров(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеФормуляров(ТекущаяСтрока)

	ТекущаяСтрока.ЗаголовокДата = НСтр("ru = 'Дата формирования:'");
	ТекущаяСтрока.ЗаголовокЭтап = НСтр("ru = 'Этап формирования:'");
	ТекущаяСтрока.ЗаголовокШаблон = НСтр("ru = 'Шаблон:'");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКакВнешнийЭДНаКлиенте()
	ТекущиеДанныеФормуляров = Элементы.ФормулярыДокументов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанныеФормуляров.ИдентификаторФормуляра) Тогда
		//Оригинал
		ОткрытьВнешнийЭлектронныйДокументФайла(ТекущиеДанныеФормуляров.ИдентификаторФормуляра);
	Иначе
		ТекстСообщения = НСтр("ru = 'Не выбран формуляр для отправки контрагенту по ЭДО.
			|Следует выбрать формуляр из списка и повторить операцию.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКакВнешнийЭДКопиюНаКлиенте()
	ТекущиеДанныеПредставлений = Элементы.ПредставленияЭлектронныхДокументов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанныеПредставлений.ИдентификаторФормуляра) Тогда
		//Копия
	    ОткрытьВнешнийЭлектронныйДокументСКопиейФайла(Параметры.ЗначениеОтбора, ПредставлениеДокументаMXL, 
			ТекущиеДанныеПредставлений.ИдентификаторФормуляра, ТекущиеДанныеПредставлений.Представление); 
	Иначе
		ТекстСообщения = НСтр("ru = 'Не выбрана визуализация формуляра для отправки контрагенту по ЭДО.
			|Следует выбрать формуляр из списка и повторить операцию.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущиеДелаЭДОНаКлиенте();	

	Если ИспользуетсяЭДОСКонтрагентамиБЭД Тогда
		ПроцессыОбработкиДокументовКлиент.ОткрытьТекущиеДелаЭДО();
	КонецЕсли;	
	
КонецПроцедуры
	
/////////////////////

&НаКлиенте
Процедура ОткрытьВнешнийЭлектронныйДокументСКопиейФайла(Предмет, ПредставлениеДокумента, 
	ИдентификаторПредставленияДокумента, НаименованиеПредставленияДокумента, ЭлектронныйДокумент = Неопределено)

	ПараметрыФормы = Новый Структура;
	
	КопияФормуляраВнешнийЭлектронныйДокументФайла(Предмет, ПредставлениеДокумента, 
		ИдентификаторПредставленияДокумента, НаименованиеПредставленияДокумента, ПараметрыФормы);
	
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		ПараметрыФормы.Вставить("Ключ", ЭлектронныйДокумент);
	КонецЕсли;	
	
	Если ПараметрыФормы.Свойство("ДвоичныеДанныеФайла") Тогда
		ОткрытьФормуПроизвольногоЭлектронногоДокумента(ПараметрыФормы);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура КопияФормуляраВнешнийЭлектронныйДокументФайла(УчетныйДокумент, ПредставленияФормуляра,
	ИдентификаторПредставленияДокумента, НаименованиеПредставленияДокумента, ПараметрыФормы)
	
	ИмяФайлаБезРасширения = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеПредставленияДокумента, "_");
	
	ПредставленияФормуляра.АвтоМасштаб = Истина;
	
	ПотокФайла = Новый ПотокВПамяти();
	ПредставленияФормуляра.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.PDF_A_3);
	ДвоичныеДанныеФайлаPDF = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
	
	Если НЕ ДвоичныеДанныеФайлаPDF = Неопределено Тогда
		
		GUIDВнутреннегоЭД = ИдентификаторПредставленияДокумента;
		ШаблонИмениФайла = "%1_2_%2";
		НовоеИмяФайла = СтрШаблон(ШаблонИмениФайла, GUIDВнутреннегоЭД, ИмяФайлаБезРасширения);
		ОграничениеДлиныИмениФайла = 130;
		Если СтрДлина(НовоеИмяФайла) > ОграничениеДлиныИмениФайла Тогда
			ИмяФайлаБезРасширения = Сред(НовоеИмяФайла, 1, ОграничениеДлиныИмениФайла);
		Иначе
			ИмяФайлаБезРасширения = НовоеИмяФайла;
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ДвоичныеДанныеФайла", ДвоичныеДанныеФайлаPDF);
		ПараметрыФормы.Вставить("НаименованиеФайла", ИмяФайлаБезРасширения);
		ПараметрыФормы.Вставить("Расширение", "pdf");
		ПараметрыФормы.Вставить("Уникальность", Истина);
		ПараметрыФормы.Вставить("Основание", УчетныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВнешнийЭлектронныйДокументФайла(ФормулярЭД, ПараметрыФормы) Экспорт
	РеквизитыФормуляра = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФормулярЭД, "ОсновнойФайл, Предмет, НомерДокумента, ДатаДокумента");
	
	ПараметрыДанных = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыДанных.ВызыватьИсключение = Ложь;
	
	ДанныеФайла = РаботаСФайлами.ДанныеФайла(РеквизитыФормуляра.ОсновнойФайл, ПараметрыДанных);
	
	ДвоичныеДанныеФайлаPDF = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
	
	Если ДвоичныеДанныеФайлаPDF = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Документ %1 не содержит файлов. Возможно, он помечен на удаление'"), ФормулярЭД);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИмяФайлаБезРасширения = Сред(ДанныеФайла.ИмяФайла, 1, СтрДлина(ДанныеФайла.ИмяФайла) - 4);
	
	GUIDВнутреннегоЭД = ФормулярЭД.ИдентификаторФормуляра;
	ШаблонИмениФайла = "%1_1_%2";
	НовоеИмяФайла = СтрШаблон(ШаблонИмениФайла, GUIDВнутреннегоЭД, ИмяФайлаБезРасширения);
	ОграничениеДлиныИмениФайла = 130;
	Если СтрДлина(НовоеИмяФайла) > ОграничениеДлиныИмениФайла Тогда
		ИмяФайлаБезРасширения = Сред(НовоеИмяФайла, 1, ОграничениеДлиныИмениФайла);
	Иначе
		ИмяФайлаБезРасширения = Сред(НовоеИмяФайла, 1, СтрДлина(НовоеИмяФайла) - 4);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ДвоичныеДанныеФайла", ДвоичныеДанныеФайлаPDF);
	ПараметрыФормы.Вставить("НаименованиеФайла", ИмяФайлаБезРасширения);
	ПараметрыФормы.Вставить("Расширение", "pdf");
	ПараметрыФормы.Вставить("Уникальность", Истина);
	ПараметрыФормы.Вставить("Основание", РеквизитыФормуляра.Предмет);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВнешнихЭД(Предмет)
	Если НЕ ИспользуетсяЭДОСКонтрагентамиБЭД Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницаВнешниеЭД", "Видимость", Ложь);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаЭДОСКонтрагентами", "Видимость", Ложь);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаЭДОСКонтрагентамиДляВизуализации", "Видимость", Ложь);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДекорацияРазделительДанных", "Видимость", Ложь);

		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументыВнешнегоЭДО = ВсеВнешниеПроизвольныеЭлектронныеДокументыВнутреннегоДокумента(Параметры.ЗначениеОтбора);
	ВнешниеЭлектронныеДокументы.Загрузить(ЭлектронныеДокументыВнешнегоЭДО);

	ТекстЗаголовкаПоУмолчанию = НСтр("ru = 'ЭДО с контрагентами'");
	
	Если ВнешниеЭлектронныеДокументы.Количество() > 0 Тогда
		ТекстЗаголовка = СтрШаблон("%1 (%2)", ТекстЗаголовкаПоУмолчанию, ВнешниеЭлектронныеДокументы.Количество());
	Иначе
		ТекстЗаголовка = ТекстЗаголовкаПоУмолчанию;
	КонецЕсли;
	
	Элементы.СтраницаВнешниеЭД.Заголовок = ТекстЗаголовка;
	
	УстановитьВидимостьЭлементовВнешнегоЭДО(Параметры.ЗначениеОтбора);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовВнешнегоЭДО(Предмет)
	ЕстьЭДОСКонтрагентами = Истина;
	Если ПроцессыОбработкиДокументов.ПоддерживаетсяИнтеграцияСБЭД() Тогда
		ЕстьПравоДоступаКУчетномуДокументу = ПравоДоступа("Просмотр", Метаданные.Документы[Предмет.Метаданные().Имя]);

		УстановитьПривилегированныйРежим(Истина);

		Если Пользователи.РолиДоступны("ДобавлениеИзменениеЭлектронныхДокументов",, Ложь) Тогда
			МожноСоздатьНовыйВнешнийЭД = Истина;
		Иначе
			МожноСоздатьНовыйВнешнийЭД = Ложь;
		КонецЕсли;	
	Иначе	
		ЕстьЭДОСКонтрагентами = Ложь;
		МожноСоздатьНовыйВнешнийЭД = Ложь;
	КонецЕсли;	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтправитьКакВнешнийЭДКопию", "Видимость", МожноСоздатьНовыйВнешнийЭД И ЕстьПравоДоступаКУчетномуДокументу);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтправитьКакВнешнийЭД", "Видимость", МожноСоздатьНовыйВнешнийЭД И ЕстьПравоДоступаКУчетномуДокументу);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницаВнешниеЭД", "Видимость", ВнешниеЭлектронныеДокументы.Количество() > 0);
КонецПроцедуры

&НаСервере

&НаСервере
Функция ВсеВнешниеПроизвольныеЭлектронныеДокументыВнутреннегоДокумента(УчетныйДокумент) Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ЭлектронныйДокумент");
	Результат.Колонки.Добавить("ТипФайлаФормуляра");
	Результат.Колонки.Добавить("СостояниеЭДО");
	
	ПроизвольныеЭД = Новый ТаблицаЗначений;
	ПроцессыОбработкиДокументов.ЗаполнитьВсеВнешниеПроизвольныеЭлектронныеДокументыУчетногоДокумента(УчетныйДокумент, ПроизвольныеЭД);

	Для Каждого ТекСтрока Из ПроизвольныеЭД Цикл
		ИмяФайла = Строка(ТекСтрока.ФайлЭД);
		СтрокаТипаДокумента = Сред(ИмяФайла, 38, 1);
		ПередачаОригинала = Ложь;
		Если СтрокаТипаДокумента = "1" Тогда
			ПередачаОригинала = Истина;
		КонецЕсли;
			
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.ТипФайлаФормуляра = ?(ПередачаОригинала, 1, 2);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ВнешнийЭлектронныйДокументФормуляра(ИдентификаторФормуляра, ПараметрыФормы)
	ФормулярЭД = ПроцессыОбработкиДокументов.ФормулярПоИдентификаторуИКодуВидаСведений(ИдентификаторФормуляра, 2);
	
	ВнешнийЭлектронныйДокументФайла(ФормулярЭД, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВнешнийЭлектронныйДокументФайла(ИдентификаторФормуляра, ЭлектронныйДокумент = Неопределено)
	ПараметрыФормы = Новый Структура;
	
	ВнешнийЭлектронныйДокументФормуляра(ИдентификаторФормуляра, ПараметрыФормы);
	
	Если ЗначениеЗаполнено(ЭлектронныйДокумент) Тогда
		ПараметрыФормы.Вставить("Ключ", ЭлектронныйДокумент);
	КонецЕсли;	
	
	Если ПараметрыФормы.Свойство("ДвоичныеДанныеФайла") Тогда
		ОткрытьФормуПроизвольногоЭлектронногоДокумента(ПараметрыФормы);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроизвольногоЭлектронногоДокумента(ПараметрыФормы) Экспорт
	Если ИспользуетсяЭДОСКонтрагентамиБЭД Тогда
		ПроцессыОбработкиДокументовКлиент.ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьФормуВладельца()

	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, "ВладелецФормы")
		И Не ЭтаФорма.ВладелецФормы = Неопределено Тогда
		Попытка
			ЭтаФорма.ВладелецФормы.Прочитать();
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось обновить форму документа'"));    
		КонецПопытки
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти
