// @strict-types

#Область ПрограммныйИнтерфейс

#Область КодыВозврата

// Возвращает код ошибки данных.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода.
//
Функция КодВозвратаОшибкаДанных() Экспорт
КонецФункции

// Возвращает код внутренней ошибки.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода.
//
Функция КодВозвратаВнутренняяОшибка() Экспорт
КонецФункции

// Возвращает код выполнения с предупреждениями.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВыполненоСПредупреждениями() Экспорт
КонецФункции
	
// Возвращает код успешного выполнения.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода.
//
Функция КодВозвратаВыполнено() Экспорт
КонецФункции

// Возвращает код отсутствия данных.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода.
//
Функция КодВозвратаНеНайдено() Экспорт
КонецФункции

#КонецОбласти

#КонецОбласти

