
&НаКлиенте
Процедура ПосмотретьПодписанныеДанные(Команда)
	
	АдресДанныхXML = АдресXMLПодписанныхДанных(АдресДанных, УникальныйИдентификатор);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ПолучитьИзВременногоХранилища(АдресДанныхXML));
	ТекстовыйДокумент.ТолькоПросмотр = Истина;
	ТекстовыйДокумент.Показать(НСтр("ru = ' (Подписанные данные)'"),"signdata.xml");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресXMLПодписанныхДанных(АдресДанных, УИД)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДанных).Получить();
	
	Буфер = Новый БуферДвоичныхДанных(4);
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения().Прочитать(Буфер, 0, 4);
	// документ FastInfoset должен начинаться с шестнадцатеричной последовательности октетов E0 00 00 01,
	// в случае, если необязательная декларация XML отсутствует.
	Если Буфер.ПрочитатьЦелое32(0, ПорядокБайтов.BigEndian) = 3758096385 Тогда
		ЧтениеFastInfoSet = Новый ЧтениеFastInfoSet;
		ЧтениеFastInfoSet.УстановитьДвоичныеДанные(ДвоичныеДанные);
		Возврат ПоместитьВоВременноеХранилище(ПрочитатьXML(ЧтениеFastInfoSet), УИД);
	Иначе
		Возврат ПоместитьВоВременноеХранилище(ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанные), УИД);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ПодписанныеДанныеФайл) Тогда
		АдресДанных = ПоместитьВоВременноеХранилище(ТекущийОбъект.ПодписанныеДанные, УникальныйИдентификатор);
	Иначе
		ДвоичныеДанныеФайл = Неопределено;
		Если ЗначениеЗаполнено(ТекущийОбъект.ПодписанныеДанныеФайл) Тогда
			ПрисоединенныеФайлы = Новый Массив; 
			РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ТекущийОбъект.ПодписанныеДанныеФайл, ПрисоединенныеФайлы);
			Если ПрисоединенныеФайлы.Количество() > 0 Тогда
				ДвоичныеДанныеФайл = РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныеФайлы[0], Истина);
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДвоичныеДанныеФайл) Тогда
			 ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанныеФайл, Новый СжатиеДанных(6));
			 АдресДанных = ПоместитьВоВременноеХранилище(ХранилищеДанных, УникальныйИдентификатор);
		КонецЕсли;	
		
	КонецЕсли;	
КонецПроцедуры
