
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПеренестиОтпускИКомандировкуВОтсутствияНаОснованииОбучения");
	Методы.Вставить("ПеренестиОтпускаКомандировкиВОтсутствияСотрудников");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументОтсутствия", "УправленческиеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьЗаписиПоОтсутствиямСотрудника(Документ, Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия,
	|	ОтсутствияНаОснованииОбучения.Сотрудник,
	|	ОтсутствияНаОснованииОбучения.Организация
	|ИЗ
	|	РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
	|ГДЕ
	|	ОтсутствияНаОснованииОбучения.ДокументОснование = &ДокументОснование
	|	И ОтсутствияНаОснованииОбучения.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ДокументОснование", Документ);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
		НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Записать();
		
	КонецЦикла;

КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ПеренестиОтпускаКомандировкиВОтсутствияСотрудников(ПараметрыОбновления = Неопределено) Экспорт
	
	Обработанные = ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьОтпускаСотрудниковОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьКомандировкиСотрудниковОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтсутствияНаОснованииОбучения");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускаСотрудниковОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	ОтпускаСотрудниковОснования.Обучение КАК ДокументОснование,
		|	ОтпускаСотрудниковОснования.Организация
		|ПОМЕСТИТЬ ВТДокументыКПереносу
		|ИЗ
		|	РегистрСведений.УдалитьОтпускаСотрудниковОснования КАК ОтпускаСотрудниковОснования
		|ГДЕ
		|	НЕ ОтпускаСотрудниковОснования.ОбъектСсылка В (&Обработанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомандировкиСотрудниковОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	КомандировкиСотрудниковОснования.Обучение КАК ДокументОснование,
		|	КомандировкиСотрудниковОснования.Организация
		|ИЗ
		|	РегистрСведений.УдалитьКомандировкиСотрудниковОснования КАК КомандировкиСотрудниковОснования
		|ГДЕ
		|	НЕ КомандировкиСотрудниковОснования.ОбъектСсылка В (&Обработанные)";
	
	
		Запрос.УстановитьПараметр("Обработанные", Обработанные);

		ОбновляемыеДанные = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления, "ВТДокументыКПереносу");
	
		Если ОбновляемыеДанные.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
		Запрос.Текст = "ВЫБРАТЬ
		|	ДокументыКПереносу.ДокументОтсутствия КАК ДокументОтсутствия,
		|	ДокументыКПереносу.ДокументОснование,
		|	ДокументыКПереносу.Организация,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДокументыКПереносу.ДокументОтсутствия) = Тип(Документ.ОтпускаСотрудников)
		|			ТОГДА ОтпускаСотрудниковСотрудники.Сотрудник
		|		ИНАЧЕ КомандировкиСотрудниковСотрудники.Сотрудник
		|	КОНЕЦ КАК Сотрудник
		|ИЗ
		|	ВТДокументыКПереносу КАК ДокументыКПереносу
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаСотрудников.Сотрудники КАК ОтпускаСотрудниковСотрудники
		|		ПО ДокументыКПереносу.ДокументОтсутствия = ОтпускаСотрудниковСотрудники.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КомандировкиСотрудников.Сотрудники КАК КомандировкиСотрудниковСотрудники
		|		ПО ДокументыКПереносу.ДокументОтсутствия = КомандировкиСотрудниковСотрудники.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОтсутствия";
	
		Выборка = Запрос.Выполнить().Выбрать();
		НовыеОбработанные = Новый Массив;
		Пока Выборка.СледующийПоЗначениюПоля("ДокументОтсутствия") Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
			Пока Выборка.Следующий() Цикл 
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			НовыеОбработанные.Добавить(Выборка.ДокументОтсутствия);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Для Каждого ОбработанныйДокумент Из НовыеОбработанные Цикл
			Обработанные.Добавить(ОбработанныйДокумент);
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);
	
КонецПроцедуры

Процедура ПеренестиОтпускИКомандировкуВОтсутствияНаОснованииОбучения(ПараметрыОбновления = Неопределено) Экспорт
	
	Обработанные = ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьОтпускОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УдалитьКомандировкаОснования");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОтсутствияНаОснованииОбучения");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтпускОснования.ОбъектСсылка КАК ДокументОтсутствия,
		|	ОтпускОснования.Обучение КАК ДокументОснование,
		|	ОтпускОснования.Организация КАК Организация,
		|	ОтпускОснования.ОбъектСсылка.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.УдалитьОтпускОснования КАК ОтпускОснования
		|ГДЕ
		|	НЕ ОтпускОснования.ОбъектСсылка В (&Обработанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КомандировкаОснования.ОбъектСсылка,
		|	КомандировкаОснования.Обучение,
		|	КомандировкаОснования.Организация,
		|	КомандировкаОснования.ОбъектСсылка.Сотрудник
		|ИЗ
		|	РегистрСведений.УдалитьКомандировкаОснования КАК КомандировкаОснования
		|ГДЕ
		|	НЕ КомандировкаОснования.ОбъектСсылка В (&Обработанные)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументОтсутствия";
	
		Запрос.УстановитьПараметр("Обработанные", Обработанные);
	
		ОбновляемыеДанные = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);

		Если ОбновляемыеДанные.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
	
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
		Выборка = ОбновляемыеДанные.Выбрать();

		НовыеОбработанные = Новый Массив;
		
		Пока Выборка.Следующий() Цикл 
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументОтсутствия.Установить(Выборка.ДокументОтсутствия);
			НаборЗаписей.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			НовыеОбработанные.Добавить(Выборка.ДокументОтсутствия);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		Для Каждого ОбработанныйДокумент Из НовыеОбработанные Цикл
			Обработанные.Добавить(ОбработанныйДокумент);
		КонецЦикла;
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "Обработанные", Обработанные);

КонецПроцедуры

Функция ЗначениеПараметраОбновленияОбработанные(ПараметрыОбновления)
	
	Если ПараметрыОбновления = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если Не ПараметрыОбновления.Свойство("Обработанные") 
		Или ПараметрыОбновления.Обработанные = Неопределено Тогда
		ПараметрыОбновления.Вставить("Обработанные", Новый Массив);
	КонецЕсли;
	
	Возврат ПараметрыОбновления.Обработанные;
	
КонецФункции

#КонецОбласти

Функция ОснованиеДокументаОтсутствия(ДокументОтсутствия) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбучениеРазвитиеСотрудников")
		Или Не ПравоДоступа("Чтение", Метаданные.Документы.ОбучениеРазвитиеСотрудников) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОтсутствия", ДокументОтсутствия);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ
		|	ОтсутствияНаОснованииОбучения.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
		|ГДЕ
		|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия = &ДокументОтсутствия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.ДокументОснование, Неопределено);
	
КонецФункции

#КонецОбласти

#КонецЕсли
