#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаголовокПредставленияФормуляра(ПредставлениеФормуляра) Экспорт
	Результат = "";
	
	Реквизиты = "Организация, НаименованиеДокумента, НомерДокумента, ДатаДокумента, НаименованиеВидаРегистраУчета, ОписаниеРегистраУчета, НачалоПериода, КонецПериода";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПредставлениеФормуляра, Реквизиты);
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.НаименованиеВидаРегистраУчета) Тогда
		ПериодРегистраУчета = "";
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НачалоПериода) Тогда
			ПериодРегистраУчета = ЗначенияРеквизитов.НачалоПериода;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.КонецПериода) Тогда
			ПериодРегистраУчета = ЗначенияРеквизитов.КонецПериода;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначенияРеквизитов.НачалоПериода) И ЗначениеЗаполнено(ЗначенияРеквизитов.КонецПериода) Тогда
			ПериодРегистраУчета = СтрШаблон("%1 - %2", ЗначенияРеквизитов.НачалоПериода, ЗначенияРеквизитов.КонецПериода);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПериодРегистраУчета) Тогда
			Результат = СтрШаблон("Регистр учета %1 %2 (%3)", 
				ЗначенияРеквизитов.НаименованиеВидаРегистраУчета,
				ЗначенияРеквизитов.ОписаниеРегистраУчета,
				ПериодРегистраУчета);
		Иначе
			Результат = СтрШаблон("Регистр учета %1 %2", 
				ЗначенияРеквизитов.НаименованиеВидаРегистраУчета,
				ЗначенияРеквизитов.ОписаниеРегистраУчета);
		КонецЕсли;	
	Иначе
		Результат = СтрШаблон("%1 от %2 № %3", 
			ЗначенияРеквизитов.НаименованиеДокумента,
			ЗначенияРеквизитов.ДатаДокумента,
			ЗначенияРеквизитов.НомерДокумента);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("НаименованиеДокумента");
	Поля.Добавить("НомерДокумента");
	Поля.Добавить("ДатаДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеФормуляраПоСвойствам(Данные);
	
КонецПроцедуры

#КонецОбласти
