#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() Тогда
		
		Если НЕ ДополнительныеСвойства.Свойство("АдресОсновногоФайла")
			ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеСвойства.АдресОсновногоФайла) Тогда
			ТекстСообщения = НСтр("ru='Формуляр документа не сформирован. Запись документа запрещена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		ФайлФормируетПользователь = Пользователи.ТекущийПользователь();
		Если ДополнительныеСвойства.Свойство("ФайлФормируетПользователь") Тогда
			Если ЗначениеЗаполнено(ДополнительныеСвойства.ФайлФормируетПользователь) Тогда
				ФайлФормируетПользователь = ДополнительныеСвойства.ФайлФормируетПользователь;
			КонецЕсли;
		КонецЕсли;	
		
		НоваяСсылка = Документы.ПредставлениеФормуляраПервичногоДокументаПОД.ПолучитьСсылку();
		УстановитьСсылкуНового(НоваяСсылка);
		
		ДобавитьОсновнойФайл(ДополнительныеСвойства.АдресОсновногоФайла, ДополнительныеСвойства.ИмяФайла, ФайлФормируетПользователь, НоваяСсылка);
		ДополнительныеСвойства.Вставить("ЭтоНовый", Ссылка.Пустая());
	Иначе
		Если ДополнительныеСвойства.Свойство("АдресОсновногоФайла") Тогда
			ИнформацияОФайле = Новый Структура;
			ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", ДополнительныеСвойства.АдресОсновногоФайла);
			ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
			ИнформацияОФайле.Вставить("ИмяБезРасширения", ДополнительныеСвойства.ИмяФайла);
			
			РаботаСФайлами.ОбновитьФайл(Ссылка.ОсновнойФайл, ИнформацияОФайле);
			ДополнительныеСвойства.Вставить("ЭтоНовый", Ссылка);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ПроцессыОбработкиДокументовПереопределяемый.ФормулярЭлектронныйДокументОбработкаЗаполнения(
		ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОсновнойФайл(АдресФайла, ИмяФайла, ФайлФормируетПользователь, Владелец)
	
	ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор = ФайлФормируетПользователь;
	ПараметрыФайла.ВладелецФайлов = Владелец;
	ПараметрыФайла.ИмяБезРасширения = ИмяФайла;
	ПараметрыФайла.Служебный = Ложь;
	
	ОсновнойФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайла);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
