#Область СлужебныеПроцедурыИФункции

Процедура ПослеПолученияДанныхНаСервере(Форма, ОписаниеТаблицыНДФЛ) Экспорт
	
	МодульКонтракта().ПослеПолученияДанныхНаСервере(Форма, ОписаниеТаблицыНДФЛ);
	
КонецПроцедуры

Процедура РеквизитыВДанные(Форма, ТекущийОбъект, ОписаниеТаблицыНДФЛ) Экспорт 
	
	МодульКонтракта().РеквизитыВДанные(Форма, ТекущийОбъект, ОписаниеТаблицыНДФЛ);
	
КонецПроцедуры

Процедура РаспределитьПоИсточникамФинансирования(Объект) Экспорт 
	
	МодульКонтракта().РаспределитьПоИсточникамФинансирования(Объект);
	
КонецПроцедуры

Процедура ДополнитьФормуДокумента(Форма) Экспорт
	
	МодульКонтракта().ДополнитьФормуДокумента(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ВозвратНДФЛФормыБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ВозвратНДФЛФормыРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
