
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗарегистрироватьСведенияОФайле(ПараметрыРегистрации) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЗаписьСведений = РегистрыСведений.СведенияОФайлах1САрхив.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьСведений, ПараметрыРегистрации);
	ЗаписьСведений.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПараметрыРегистрацииСведенийОФайле() Экспорт
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Файл");
	ПараметрыРегистрации.Вставить("ВидДокументаБИА");
	ПараметрыРегистрации.Вставить("ИдентификаторПечатнойФормы");
	ПараметрыРегистрации.Вставить("Организация");
	ПараметрыРегистрации.Вставить("Дата");
	ПараметрыРегистрации.Вставить("Номер");
	ПараметрыРегистрации.Вставить("НеВыгружать", Истина);
	ПараметрыРегистрации.Вставить("Сотрудник");
	Возврат ПараметрыРегистрации;
КонецФункции

Функция СведенияОФайлеДляВыгрузкиВАрхив(Файл, ДополнитьСведениямиВладельца = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДополнитьСведениямиВладельца", ДополнитьСведениямиВладельца);
	Запрос.УстановитьПараметр("Файл", Файл);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Файл,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.ВидДокументаБИА, ЗНАЧЕНИЕ(Справочник.ВидыДокументовБИА.ПустаяСсылка)) КАК ВидДокументаБИА,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.НеВыгружать, ИСТИНА) КАК НеВыгружать,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.ИдентификаторПечатнойФормы, """") КАК ИдентификаторПечатнойФормы,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК ОрганизацияРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Номер, """") КАК НомерРегистр,
	|	ЕСТЬNULL(СведенияОФайлах1САрхив.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОФайлах1САрхив КАК СведенияОФайлах1САрхив
	|		ПО Файлы.Ссылка = СведенияОФайлах1САрхив.Файл
	|ГДЕ
	|	Файлы.Ссылка = &Файл";

	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	ОператорПоследнегоЗапроса = ПоследнийЗапрос.Операторы[0];
	
	ОператорПоследнегоЗапроса.Источники.Заменить(0, ПоследнийЗапрос.ДоступныеТаблицы.Найти(СтрШаблон("Справочник.%1", Файл.Метаданные().Имя)));

	ПервыйИсточник = ОператорПоследнегоЗапроса.Источники[0];
	ВторойИсточник = ОператорПоследнегоЗапроса.Источники[1];
	
	Если ОбщегоНазначения.ЭтоДокумент(Файл.ВладелецФайла.Ссылка.Метаданные()) Тогда
		
		ДокументСодержитНомер = Не Файл.ВладелецФайла.Ссылка.Метаданные().ДлинаНомера = 0;
		
		НовыйИсточник = ОператорПоследнегоЗапроса.Источники.Добавить(
		"Документ."+Файл.ВладелецФайла.Метаданные().Имя, "Владелец");
		УсловиеСоединения = ПервыйИсточник.Источник.Псевдоним + ".ВладелецФайла = Владелец.Ссылка";
		ПервыйИсточник.Соединения.Добавить(НовыйИсточник.Источник.Псевдоним, УсловиеСоединения);
		ПервыйИсточник.Соединения[ПервыйИсточник.Соединения.Количество()-1].ТипСоединения = ТипСоединенияСхемыЗапроса.ЛевоеВнешнее;
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И СокрЛП(ЕстьNULL(СведенияОФайлах1САрхив.Номер,"""")) = """"
		|		ТОГДА "+?(ДокументСодержитНомер, "Владелец.Номер", """""")+"
		|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Номер,"""")
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Номер";
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Дата, ДатаВремя(1,1,1)) = ДатаВремя(1,1,1)
		|		ТОГДА НачалоПериода(Владелец.Дата, День)
		|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Дата, ДатаВремя(1,1,1))
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Дата";
		
		Если Не Файл.ВладелецФайла.Метаданные().Реквизиты.Найти("Организация") = Неопределено Тогда
			ДобавляемоеПоле = 
			"ВЫБОР
			|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка)) = Значение(Справочник.Организации.ПустаяСсылка)
			|		ТОГДА Владелец.Организация
			|	ИНАЧЕ ЕСТЬNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка))
			|КОНЕЦ"; 
			
			ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
			ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Файл.ВладелецФайла.Ссылка) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		НовыйИсточник = ОператорПоследнегоЗапроса.Источники.Добавить("Справочник.Сотрудники", "Сотрудники");
		УсловиеСоединения = "СведенияОФайлах1САрхив.Сотрудник = Сотрудники.Ссылка";
		ВторойИсточник.Соединения.Добавить(НовыйИсточник.Источник.Псевдоним, УсловиеСоединения); 
		
		ДобавляемоеПоле = 
		"ВЫБОР
		|	КОГДА &ДополнитьСведениямиВладельца И ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка)) = Значение(Справочник.Организации.ПустаяСсылка)
		|		ТОГДА Сотрудники.ГоловнаяОрганизация
		|	ИНАЧЕ ЕстьNULL(СведенияОФайлах1САрхив.Организация,Значение(Справочник.Организации.ПустаяСсылка))
		|КОНЕЦ"; 
		
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
		
	КонецЕсли;
	
	Если ПоследнийЗапрос.Колонки.Найти("Номер") = Неопределено Тогда
		ДобавляемоеПоле = "ЕстьNULL(СведенияОФайлах1САрхив.Номер,"""")";
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Номер";
	КонецЕсли;

	Если ПоследнийЗапрос.Колонки.Найти("Дата") = Неопределено Тогда
		ДобавляемоеПоле = "ВЫБОР
		|	КОГДА ЕстьNULL(СведенияОФайлах1САрхив.Дата,ДатаВремя(1,1,1)) = ДатаВремя(1,1,1)
		|		ТОГДА ЕстьNULL(СведенияОФайлах1САрхив.Файл.ДатаСоздания, ДатаВремя(1,1,1))
		|	ИНАЧЕ ЕстьNULL(СведенияОФайлах1САрхив.Дата,ДатаВремя(1,1,1))
		|КОНЕЦ"; 
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Дата";
	КонецЕсли;
	
	Если ПоследнийЗапрос.Колонки.Найти("Организация") = Неопределено Тогда
		ДобавляемоеПоле = "ЕстьNULL(СведенияОФайлах1САрхив.Организация, Значение(Справочник.Организации.ПустаяСсылка))";
		ОператорПоследнегоЗапроса.ВыбираемыеПоля.Добавить(ДобавляемоеПоле);
		ПоследнийЗапрос.Колонки[ПоследнийЗапрос.Колонки.Количество()-1].Псевдоним = "Организация";
	КонецЕсли;

	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПараметрыРегистрации = ПараметрыРегистрацииСведенийОФайле();
	ПараметрыРегистрации.Вставить("ОрганизацияРегистр");
	ПараметрыРегистрации.Вставить("ДатаРегистр");
	ПараметрыРегистрации.Вставить("НомерРегистр");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыРегистрации, Выборка);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
