
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Кандидат",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеРезультатаОтправки() Экспорт
	
	Результат = Новый Структура(
		"Отправлено,
		|ОписаниеОшибки,
		|ДатаОтправления,
		|Письмо");
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьРезультатОтправки(Кандидат, Получатель, РезультатОтправки) Экспорт

	МенеджерЗаписи = РегистрыСведений.ОтправкаРезюме.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = Кандидат;
	МенеджерЗаписи.Получатель = Получатель;
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РезультатОтправки);
	МенеджерЗаписи.Комментарий = РезультатОтправки.ОписаниеОшибки;
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
