#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.НазначениеПоказателейЭффективности.ПолучитьДанныеДляПроведения(Ссылка);
	
	КлючевыеПоказателиЭффективности.СформироватьДвиженияПоказателейПодразделений(
		Движения,
		ДанныеДляПроведения.ПоказателиПодразделений,
		ДанныеДляПроведения.ШкалыПодразделений);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияПоказателейПозиций(
		Движения,
		ДанныеДляПроведения.ПоказателиПозиций,
		ДанныеДляПроведения.ШкалыПозиций);
	КлючевыеПоказателиЭффективности.СФормироватьДвиженияПоказателейСотрудников(
		Движения,
		ДанныеДляПроведения.ПоказателиСотрудников,
		ДанныеДляПроведения.ШкалыСотрудников);
	КлючевыеПоказателиЭффективности.СформироватьДвиженияМестВводаЗначенийПоказателейЭффективности(
		Движения,
		ДанныеДляПроведения.ПодразделенияВводаЗначений,
		ДанныеДляПроведения.ПозицииВводаЗначений,
		ДанныеДляПроведения.СотрудникиВводаЗначений);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Утвержден Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Утвердил");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьНазначениеПоказателейПодразделенийНаГоризонт() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'На указанный период уже введены показатели по подразделениям.'"));
		Возврат;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьНазначениеПоказателейПодразделенийНаГоризонт()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Подразделения", Подразделения.ВыгрузитьКолонку("Подразделение"));
	Запрос.УстановитьПараметр("Показатели", ПоказателиПодразделений.ВыгрузитьКолонку("Показатель"));
	Запрос.УстановитьПараметр("Горизонт", ПоказателиПодразделений.ВыгрузитьКолонку("Горизонт"));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоказателиЭффективностиПодразделений.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПоказателиЭффективностиПодразделений КАК ПоказателиЭффективностиПодразделений
		|ГДЕ
		|	ПоказателиЭффективностиПодразделений.Подразделение В(&Подразделения)
		|	И ПоказателиЭффективностиПодразделений.Период = &Период
		|	И ПоказателиЭффективностиПодразделений.Показатель В(&Показатели)
		|	И ПоказателиЭффективностиПодразделений.Регистратор <> &Регистратор
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли