#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "УнифицированнаяФормаТ13");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Унифицированная форма Т-13.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьРасширеннуюФункциональность");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Форма0504421с2015");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Форма 0504421.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьРасширеннуюФункциональность");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Форма0504421");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Форма 0504421 до 2015 года.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьРасширеннуюФункциональность");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли