
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Начальное заполнение видов происшествий.
Процедура НачальноеЗаполнение() Экспорт
	
	СправочникСсылка = Справочники.ВидыКвотДляТрудоустройства.КвотаДляТрудоустройстваИнвалидов;
	СправочникОбъект =СправочникСсылка.ПолучитьОбъект();
	СправочникОбъект.ИспользуютсяКатегории = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
	
	СправочникСсылка = Справочники.ВидыКвотДляТрудоустройства.КвотаДляТрудоустройстваМолодежи;
	СправочникОбъект =СправочникСсылка.ПолучитьОбъект();
	СправочникОбъект.ИспользуютсяКатегории = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
