
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОбразования = Параметры.ДанныеСтрокиТабличнойЧасти.ВидОбразования;
	УчебноеЗаведение = Параметры.ДанныеСтрокиТабличнойЧасти.УчебноеЗаведение;
	Факультет = Параметры.ДанныеСтрокиТабличнойЧасти.Факультет;
	Специальность = Параметры.ДанныеСтрокиТабличнойЧасти.Специальность;
	ГодОкончания = Параметры.ДанныеСтрокиТабличнойЧасти.ГодОкончания;
	
	Элементы.ФормаУдалить.Видимость = Не Параметры.ЭтоНоваяЗапись;
	
	Если Не ЗначениеЗаполнено(ВидОбразования) Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразование;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.ДанныеСтрокиТабличнойЧасти.ВидОбразования = ВидОбразования;
	Параметры.ДанныеСтрокиТабличнойЧасти.УчебноеЗаведение = УчебноеЗаведение;
	Параметры.ДанныеСтрокиТабличнойЧасти.Факультет = Факультет;
	Параметры.ДанныеСтрокиТабличнойЧасти.Специальность = Специальность;
	Параметры.ДанныеСтрокиТабличнойЧасти.ГодОкончания = ГодОкончания;
	
	Закрыть(Параметры.ДанныеСтрокиТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьЗапись();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьЗапись()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗаписьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Запись будет удалена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть("УдалитьЗапись");
	
КонецПроцедуры

#КонецОбласти
