#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Испытательный срок сотрудников";
	// АПК:1297-вкл
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Данные испытательного срока сотрудников", СтатистикаИспытательныхСроков(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаИспытательныхСроков(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ИспытательныеСроки.Сотрудник) КАК ИспытательныхСроков,
		|	КОЛИЧЕСТВО(ПродленияИспытательногоСрока.Сотрудник) КАК Продлений,
		|	КОЛИЧЕСТВО(ВнеплановыеЗавершенияИспытательногоСрока.Сотрудник) КАК ВнеплановыхЗавершений
		|ИЗ
		|	РегистрСведений.ДанныеИспытательногоСрокаСотрудников КАК ИспытательныеСроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИспытательногоСрокаСотрудников КАК ПродленияИспытательногоСрока
		|		ПО ИспытательныеСроки.Регистратор = ПродленияИспытательногоСрока.Регистратор
		|			И (ИспытательныеСроки.ПродлениеИспытательногоСрока = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеИспытательногоСрокаСотрудников КАК ВнеплановыеЗавершенияИспытательногоСрока
		|		ПО ИспытательныеСроки.Регистратор = ВнеплановыеЗавершенияИспытательногоСрока.Регистратор
		|			И (ИспытательныеСроки.ИспытательныйСрокЗавершен = ИСТИНА)
		|			И (ИспытательныеСроки.Период < ИспытательныеСроки.ДатаЗавершения)
		|ГДЕ
		|	ИспытательныеСроки.Период > &НачалоПериода
		|	И ИспытательныеСроки.Период <= &КонецПериода";
	
	ТаблицаИспытательныхСроков = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Испытательных сроков", ТаблицаИспытательныхСроков.ВыгрузитьКолонку("ИспытательныхСроков")[0]);
	ПоказателиСтатистики.Вставить("Продлений", ТаблицаИспытательныхСроков.ВыгрузитьКолонку("Продлений")[0]);
	ПоказателиСтатистики.Вставить("Внеплановых завершений", ТаблицаИспытательныхСроков.ВыгрузитьКолонку("ВнеплановыхЗавершений")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти