///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает имя общего реквизита, который является разделителем основных данных.
//
// Возвращаемое значение:
//   Строка - имя общего реквизита, который является разделителем основных данных.
//
Функция РазделительОсновныхДанных() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.РазделительОсновныхДанных();
	
КонецФункции

// Возвращает имя общего реквизита, который является разделителем вспомогательных данных.
//
// Возвращаемое значение:
//   Строка - имя общего реквизита, который является разделителем вспомогательных данных.
//
Функция РазделительВспомогательныхДанных() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.РазделительВспомогательныхДанных();
	
КонецФункции

// Возвращает признак работы в режиме разделения данных по областям
// (технически это признак условного разделения).
// 
// Возвращает Ложь, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//  Булево - Истина, если разделение включено.
//  Булево - Ложь,   если разделение выключено или не поддерживается.
//
Функция РазделениеВключено() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.РазделениеВключено();
	
КонецФункции

// Возвращает признак возможности обращения к разделенным данным (которые входят в состав разделителей).
// Признак относится к сеансу, но может меняться во время работы сеанса, если разделение было включено
// в самом сеансе, поэтому проверку следует делать непосредственно перед обращением к разделенным данным.
// 
// Возвращает Истина, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//   Булево - Истина, если разделение не поддерживается, либо разделение выключено,
//                    либо разделение включено и разделители    установлены.
//   Булево - Ложь,   если разделение включено и разделители не установлены.
//
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ДоступноИспользованиеРазделенныхДанных();
	
КонецФункции

// Проверяет блокировку области данных.
//
// Параметры:
//  ОбластьДанных -  Число - значение разделителя области данных, 
//   блокировку которой требуется проверить.
//
// Возвращаемое значение:
//  Булево - если Истина, область данных заблокирована, иначе нет.
//
Функция ОбластьДанныхЗаблокирована(Знач ОбластьДанных) Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;
	
КонецФункции

// Возвращает прокси web-сервиса для синхронизации административных действий в сервисе.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
// 
// Параметры:
//  ПарольПользователя - Строка - пароль для подключения.
// 
// Возвращаемое значение: 
//   WSПрокси - прокси менеджера сервиса. 
// 
Функция ПолучитьПроксиМенеджераСервиса(Знач ПарольПользователя = Неопределено) Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;
	
КонецФункции

// Выполняет вход в область данных. Входить в область можно только из неразделенного сеанса.
// 
// Параметры:
// 	ОбластьДанных - Число - 
Процедура ВойтиВОбластьДанных(Знач ОбластьДанных) Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	
КонецПроцедуры

// Выполняет выход из области данных.
//
Процедура ВыйтиИзОбластиДанных() Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	
КонецПроцедуры

// Возвращает значение разделителя текущей области данных.
// В случае если значение не установлено, выдается ошибка.
// 
// Возвращаемое значение: 
//   Число - значение разделителя текущей области данных. 
// 
Функция ЗначениеРазделителяСеанса() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЗначениеРазделителяСеанса();
	
КонецФункции


// Возвращает флаг использования разделителя ОбластьДанных для текущего сеанса.
//
// Возвращаемое значение: 
//  Булево - если Истина, разделение используется, иначе нет.
//
Функция ИспользованиеРазделителяСеанса() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ИспользованиеРазделителяСеанса();
	
КонецФункции

// Добавляет описание параметра по имени константы в таблицу параметров.
// Возвращает добавленный параметр.
//
// Параметры: 
//   ТаблицаПараметров - см. РаботаВМоделиСервисаПереопределяемый.ПриЗаполненииТаблицыПараметровИБ.ТаблицаПараметров
//   ИмяКонстанты - Строка - имя константы, которую необходимо добавить в параметры ИБ
//   ВызыватьИсключение - Булево - если константа не может являться параметром ИБ
//
// Возвращаемое значение: 
//   Неопределено, СтрокаТаблицыЗначений - описание добавленного параметра:
//    * Имя - Строка - имя параметра, должно соответствовать правилам именования переменных, поскольку используется
//                            в качестве ключей структур
//    * Описание - Строка - описание параметра для отображения в пользовательском интерфейсе.
//    * ЗапретЧтения - Булево - признак запрета считывания параметра ИБ. Может быть установлен, например, для
//                            паролей. 
//    * ЗапретЗаписи - Булево - признак запрета изменения параметра ИБ. Может быть установлен, например, для 
//                            параметра "ВерсияКонфигурации"
//    * Тип - ОписаниеТипов - тип значения параметра. Допускается использовать только Число, Строка, Дата, Булево
//    * ЗначениеПоУмолчанию - Число, Строка, Дата, Булево - может использоваться для установки при развертывании новых
//                            информационных баз
//    * ДопустимыеЗначения - СписокЗначений из Строка - Может использоваться для сопоставления со значениями
//                            перечислений (включая системные)
//    * ДополнительнаяИнформация - Строка - например, имена подсистем, к которой относится параметр ИБ
//    * Дополнительный - Булево - для внутреннего использования. Истина устанавливается автоматически для параметров,
//        добавленных в процессе обработки сообщений из Менеджера сервиса
Функция ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, Знач ИмяКонстанты, ВызыватьИсключение = Истина) Экспорт

	Возврат РаботаВМоделиСервисаСлужебный.ДобавитьКонстантуВТаблицуПараметровИБ(
		ТаблицаПараметров, ИмяКонстанты, ВызыватьИсключение);

КонецФункции

// Получает имя приложения - так, как его задал абонент.
//
// Возвращаемое значение:
//   Строка - имя приложения.
//
Функция ПолучитьИмяПриложения() Экспорт
	
	Возврат "";
	
КонецФункции

// Возвращает часовой пояс области данных.
// Предназначена для вызова из сеансов с неустановленным использованием
// разделителей. В сеансах с установленным использованием разделителей
// следует использовать ПолучитьЧасовойПоясИнформационнойБазы().
//
// Параметры:
//  ОбластьДанных - Число - значение разделителя области данных, часовой
//   пояс которой требуется получить.
//
// Возвращаемое значение:
//  Строка, Неопределено - часовой пояс области данных, Неопределено,
//   если часовой пояс не задан.
//
Функция ПолучитьЧасовойПоясОбластиДанных(Знач ОбластьДанных) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает признак наличия настройки конечной точки менеджера сервиса
//
// Возвращаемое значение:
//  Булево - Истина, если конечная точка менеджера сервиса установлена и в настройках транспорта заполнено имя пользователя.
//
Функция КонечнаяТочкаМенеджераСервисаНастроена() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.КонечнаяТочкаМенеджераСервисаНастроена();
	
КонецФункции

// Возвращает внутренний адрес менеджера сервиса.
//
// Возвращаемое значение:
//  Строка - внутренний адрес менеджера сервиса.
//
Функция ВнутреннийАдресМенеджераСервиса() Экспорт
	
	Возврат "";
	
КонецФункции

// Возвращает адрес провайдера аутентификации.
//
// Возвращаемое значение:
//  Строка - адрес провайдера аутентификации.
//
Функция АдресПровайдераАутентификации() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.АдресПровайдераАутентификации();
	
КонецФункции

// Возвращает признак аутентификации токеном доступа внутренних вызовов программного интерфейса.
// 
// Возвращаемое значение:
//  Булево
Функция АутентификацияТокеномДоступаВнутреннихВызововПрограммногоИнтерфейса() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.АутентификацияТокеномДоступаВнутреннихВызововПрограммногоИнтерфейса();
	
КонецФункции

// Возвращает имя служебного пользователя менеджера сервиса.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Возвращаемое значение:
//  Строка - имя служебного пользователя менеджера сервиса.
//
Функция ИмяСлужебногоПользователяМенеджераСервиса() Экспорт
	
	Возврат "";
	
КонецФункции

// Возвращает пароль служебного пользователя менеджера сервиса.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Возвращаемое значение:
//  Строка - пароль служебного пользователя менеджера сервиса.
//
Функция ПарольСлужебногоПользователяМенеджераСервиса() Экспорт
	
	Возврат "";
	
КонецФункции

// Обрабатывает информацию об ошибке, полученную из web-сервиса.
// В случае если передана не пустая информация об ошибке, записывает
// подробное представление ошибки в журнал регистрации и вызывает
// исключение с текстом краткого представления об ошибке.
//
// Параметры:
//   ИнформацияОбОшибке - ИнформацияОбОшибке - информация об ошибке,
//   ИмяПодсистемы - Строка - имя подсистемы,
//   ИмяВебСервиса - Строка - имя web-сервиса,
//   ИмяОперации - Строка - имя операции.
//
Процедура ОбработатьИнформациюОбОшибкеWebСервиса(Знач ИнформацияОбОшибке, Знач ИмяПодсистемы = "",
	Знач ИмяВебСервиса = "", Знач ИмяОперации = "") Экспорт
	
	РаботаВМоделиСервисаСлужебный.ОбработатьИнформациюОбОшибкеWebСервиса(
		ИнформацияОбОшибке, ИмяПодсистемы, ИмяВебСервиса, ИмяОперации);
	
КонецПроцедуры

// Возвращает псевдоним пользователя, который должен использоваться в интерфейсе.
//
// Параметры:
//   ИдентификаторПользователя - УникальныйИдентификатор - идентификатор пользователя.
//
// Возвращаемое значение:
//   Строка - псевдоним пользователя информационной базы для отображения в интерфейсе.
//
Функция ПсевдонимПользователяИнформационнойБазы(Знач ИдентификаторПользователя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ПсевдонимПользователяИнформационнойБазы(ИдентификаторПользователя);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Контроль неразделенных данных.

// Обработчик подписки на событие КонтрольНеразделенныхОбъектовПриЗаписи.
// ОбменДанными.Загрузка не требуется.
// Запись неразделенных данных из разделенного сеанса запрещена.
// @skip-check module-empty-method - особенность реализации.
// 
// Параметры:
//  Источник - КонстантаМенеджерЗначения, СправочникОбъект, ПланОбменаОбъект - источник
//  Отказ - Булево - Отказ
Процедура КонтрольНеразделенныхОбъектовПриЗаписи(Источник, Отказ) Экспорт
КонецПроцедуры

// Обработчик подписки на событие КонтрольНеразделенныхНаборовЗаписейПриЗаписи.
// ОбменДанными.Загрузка не требуется.
// Запись неразделенных данных из разделенного сеанса запрещена.
// @skip-check module-empty-method - особенность реализации.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей
//  Отказ - Булево - Отказ
//  Замещение - Булево, РежимЗамещения - Замещение
Процедура КонтрольНеразделенныхНаборовЗаписейПриЗаписи(Источник, Отказ, Замещение) Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Работа с файлами

// Возвращает полное имя файла, полученного из файлового хранилища МС по его идентификатору.
//
// Параметры:
//   ИДФайла - УникальныйИдентификатор - идентификатор файла в файловом хранилище МС.
//
// Возвращаемое значение:
//   Строка - полное имя извлеченного файла.
//
Функция ПолучитьФайлИзХранилищаМенеджераСервиса(Знач ИДФайла) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

// Добавляет файл в хранилище менеджера сервиса.
//
// Параметры:
//   АдресДанныеФайл - Строка - адрес файла во временном хранилище,
//                   - ДвоичныеДанные - двоичные данные файла,
//                   - Файл - файл.
//   ИмяФайла - Строка - хранимое имя файла.
//   ДополнительныеПараметры - Структура - сериализуемый в json данные.
//		
// Возвращаемое значение:
//   УникальныйИдентификатор - Идентификатор файла в хранилище.
//
Функция ПоместитьФайлВХранилищеМенеджераСервиса(Знач АдресДанныеФайл, Знач ИмяФайла = "",
	ДополнительныеПараметры = Неопределено) Экспорт

	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Функции определения типов объектов метаданных по полному имени объекта
// метаданных.

// Ссылочные типы данных

// Определяет принадлежность объекта метаданных к общему типу "Документ" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если документ.
//
Функция ЭтоПолноеИмяДокумента(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяДокумента(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Справочник" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если справочник.
//
Функция ЭтоПолноеИмяСправочника(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяСправочника(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Перечисление" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если перечисление.
//
Функция ЭтоПолноеИмяПеречисления(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПеречисления(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План обмена" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если план обмена.
//
Функция ЭтоПолноеИмяПланаОбмена(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПланаОбмена(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План видов характеристик" по
//  полному имени объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина если план видов характеристик.
//
Функция ЭтоПолноеИмяПланаВидовХарактеристик(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПланаВидовХарактеристик(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Бизнес-процесс" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если бизнес-процесс.
//
Функция ЭтоПолноеИмяБизнесПроцесса(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяБизнесПроцесса(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Задача" по полному имени объекта
//  метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
// 
// Возвращаемое значение:
//  Булево - Истина, если задача.
//
Функция ЭтоПолноеИмяЗадачи(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяЗадачи(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План счетов" по полному имени объекта
//  метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если план счетов.
//
Функция ЭтоПолноеИмяПланаСчетов(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПланаСчетов(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "План видов расчета" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если план видов расчета.
//
Функция ЭтоПолноеИмяПланаВидовРасчета(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПланаВидовРасчета(ПолноеИмя);
	
КонецФункции

// Регистры

// Определяет принадлежность объекта метаданных к общему типу "Регистр сведений" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина если регистр сведений.
//
Функция ЭтоПолноеИмяРегистраСведений(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегистраСведений(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр накопления" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если регистр накопления.
//
Функция ЭтоПолноеИмяРегистраНакопления(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегистраНакопления(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр бухгалтерии" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если регистр бухгалтерии.
//
Функция ЭтоПолноеИмяРегистраБухгалтерии(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегистраБухгалтерии(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к общему типу "Регистр расчета" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если регистр расчета.
//
Функция ЭтоПолноеИмяРегистраРасчета(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегистраРасчета(ПолноеИмя);
	
КонецФункции

// Перерасчеты

// Определяет принадлежность объекта метаданных к типу "Перерасчет" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина если перерасчет.
//
Функция ЭтоПолноеИмяПерерасчета(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПерерасчета(ПолноеИмя);
	
КонецФункции

// Константы

// Определяет принадлежность объекта метаданных к общему типу "Константа" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если константа.
//
Функция ЭтоПолноеИмяКонстанты(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяКонстанты(ПолноеИмя);
	
КонецФункции

// Журналы документов

// Определяет принадлежность объекта метаданных к общему типу "Журнал документов" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если журнал документов.
//
Функция ЭтоПолноеИмяЖурналаДокументов(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяЖурналаДокументов(ПолноеИмя);
	
КонецФункции

// Последовательности

// Определяет принадлежность объекта метаданных к общему типу "Последовательности" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если последовательность.
//
Функция ЭтоПолноеИмяПоследовательности(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяПоследовательности(ПолноеИмя);
	
КонецФункции

// РегламентныеЗадания

// Определяет принадлежность объекта метаданных к общему типу "Регламентные задания" по полному имени
//  объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если регламентное задание.
//
Функция ЭтоПолноеИмяРегламентногоЗадания(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегламентногоЗадания(ПолноеИмя);
	
КонецФункции

// Общие

// Определяет принадлежность объекта метаданных к типу регистр по полному имени объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если регистр.
//
Функция ЭтоПолноеИмяРегистра(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяРегистра(ПолноеИмя);
	
КонецФункции

// Определяет принадлежность объекта метаданных к ссылочному типу по полному имени объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   принадлежность к заданному типу.
//
// Возвращаемое значение:
//  Булево - Истина, если ссылочный тип.
//
Функция ЭтоПолноеИмяОбъектаСсылочногоТипа(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяОбъектаСсылочногоТипа(ПолноеИмя);
	
КонецФункции

// Определяет поддержку предопределенных данных объектом метаданных по полному имени объекта метаданных.
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных, для которого необходимо определить
//   поддержку предопределенных данных.
//
// Возвращаемое значение:
//  Булево - Истина, если объект метаданных поддерживает предопределенные данные.
//
Функция ЭтоПолноеИмяОбъектаСПредопределеннымиДанными(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоПолноеИмяОбъектаСПредопределеннымиДанными(ПолноеИмя);
	
КонецФункции

// См. ОбменДаннымиПереопределяемый.ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы.
// 
// Параметры:
// 	Типы - См. ОбменДаннымиПереопределяемый.ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы.Типы
// 
Процедура ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы(Типы) Экспорт

	РаботаВМоделиСервисаСлужебный.ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы(Типы);

КонецПроцедуры

// Для общего модуля РаботаВМоделиСервисаСлужебныйПовтИсп.

// Определяет, запущен сеанс с разделителями или без.
//
// Возвращаемое значение:
//   Булево - Истина, если сеанс запущен без разделителей.
//
Функция СеансЗапущенБезРазделителей() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.СеансЗапущенБезРазделителей();
	
КонецФункции

// Возвращает признак наличия в конфигурации общих реквизитов-разделителей.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенная конфигурация.
//
Функция ЭтоРазделеннаяКонфигурация() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.ЭтоРазделеннаяКонфигурация();
	
КонецФункции

// Возвращает признак того, что объект метаданных используется в общих реквизитах-разделителях.
//
// Параметры:
//   ОбъектМетаданных - Строка - имя объекта метаданных.
//   Разделитель - Строка - имя общего реквизита-разделителя, на разделение которыми проверяется объект метаданных.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенный объект.
//
Функция ЭтоРазделенныйОбъектМетаданных(Знач ОбъектМетаданных, Знач Разделитель = Неопределено) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.ЭтоРазделенныйОбъектМетаданных(ОбъектМетаданных, Разделитель);
	
КонецФункции

// Возвращает конечную точку для отправки сообщений в менеджер сервиса.
//
// Возвращаемое значение:
//  ПланОбменаСсылка.ОбменСообщениями - узел соответствующий менеджеру сервиса.
//
Функция КонечнаяТочкаМенеджераСервиса() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.КонечнаяТочкаМенеджераСервиса();
	
КонецФункции

// Возвращает соответствие видов контактной информации пользователя видам.
// КИ используемой в XDTO модели сервиса.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение- соответствие видов КИ:
//  * Ключ - СправочникСсылка.ВидыКонтактнойИнформации
//  * Значение - Строка
//
Функция СоответствиеВидовКИПользователяXDTO() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.СоответствиеВидовКИПользователяXDTO();
	
КонецФункции

// Возвращает соответствие видов контактной информации XDTO видам КИ пользователя.
// 
// Возвращаемое значение: 
//  Соответствие из КлючИЗначение -- соответствие видов КИ:
//  * Ключ - Строка
//  * Значение - СправочникСсылка.ВидыКонтактнойИнформации
Функция СоответствиеВидовКИXDTOВидамКИПользователя() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.СоответствиеВидовКИXDTOВидамКИПользователя();
	
КонецФункции

// Возвращает соответствие прав XDTO используемым в модели сервиса возможным
// действиям с пользователем сервиса.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение - соответствие прав действиям:
//  * Ключ - Строка
//  * Значение - Строка
//
Функция СоответствиеПравXDTOДействиямСПользователемСервиса() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.СоответствиеПравXDTOДействиямСПользователемСервиса();
	
КонецФункции

// Возвращает описание модели данных, относящихся к области данных.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - модель данных области:
//    * Ключ - ОбъектМетаданных - объект метаданных,
//    * Значение - Строка - имя общего реквизита-разделителя.
//
Функция ПолучитьМодельДанныхОбласти() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.ПолучитьМодельДанныхОбласти();
	
КонецФункции

// Возвращает массив существующих в конфигурации разделителей.
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - массив имен общих реквизитов, которые
//     являются разделителями.
//
Функция РазделителиКонфигурации() Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.РазделителиКонфигурации();
	
КонецФункции

// Возвращает состав общего реквизита с заданным именем.
//
// Параметры:
//   Имя - Строка - имя общего реквизита.
//
// Возвращаемое значение:
//   СоставОбщегоРеквизита - список объектов метаданных, в которые входит общий реквизит.
//
Функция СоставОбщегоРеквизита(Знач Имя) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.СоставОбщегоРеквизита(Имя);
	
КонецФункции

// Возвращает флаг доступности действий изменения пользователей.
//
// Возвращаемое значение:
// 	Булево - Истина, если изменение пользователей доступно, иначе Ложь.
//
Функция ДоступноИзменениеПользователей() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Возвращает коллекцию используемых областей данных.
//
// Возвращаемое значение:
//  Массив из Число - список областей данных
//
Функция ИспользуемыеОбластиДанных() Экспорт
	
	Возврат Новый Массив();
	
КонецФункции

// Создает ключ записи для регистра сведений, включенного в состав разделителя ОбластьДанныхВспомогательныеДанные.
//
// Параметры:
//  Менеджер - РегистрСведенийМенеджер - менеджер регистра сведений, для которого требуется получить ключ записи,
//  ЗначенияКлюча - Структура - содержащая значения для заполнения свойств ключа записи.
//                              Имена элементов структуры должны соответствовать именам ключевых полей.
//
// Возвращаемое значение:
//  РегистрСведенийКлючЗаписиИмяРегистраСведений - ключ записи.
//
Функция СоздатьКлючЗаписиРегистраСведенийВспомогательныхДанных(Знач Менеджер, Знач ЗначенияКлюча) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.СоздатьКлючЗаписиРегистраСведенийВспомогательныхДанных(Менеджер, ЗначенияКлюча);
	
КонецФункции

// Устанавливает признак активности пользователя в текущей области.
// @skip-check module-empty-method - особенность реализации.
//
Процедура УстановитьФлагАктивностиПользователяВОбластиДляРезервногоКопирования() Экспорт
КонецПроцедуры

// Получается значение даты последнего старта клиентского сеанса пользователя в текущей области.
// Возвращаемое значение:
//  Дата - Дата последнего старта клиентского сеанса пользователя в области
//
Функция ПолучитьДатуПоследнегоСтартаКлиентскогоСеанса() Экспорт
	
	Возврат Дата(1,1,1);
	
КонецФункции

// Проверка блокировки области данных при запуске.
// Только для вызова из СтандартныеПодсистемыСервер.ДобавитьПараметрыРаботыКлиентаПриЗапуске().
// @skip-check module-empty-method - особенность реализации.
//  
// Параметры:
//  ОписаниеОшибки - Строка - Текст с описанием ошибки
//
Процедура ПриПроверкеБлокировкиОбластиДанныхПриЗапуске(ОписаниеОшибки) Экспорт	
КонецПроцедуры

// Возвращает коллекцию используемых пользователями областей данных.
//  Используемые пользователями области определяются по установленному виду приложения для области
//
// Возвращаемое значение:
//  Массив из Число - список областей данных
//
Функция ИспользуемыеПользователямиОбластиДанных() Экспорт
	
	Возврат Новый Массив;
	
КонецФункции

// Возвращает признак того, что область данных используется пользователями.
// Используемые пользователями области определяются по установленному виду приложения для области
//
// Параметры:
//  ОбластьДанных -  Число - значение разделителя области данных, 
//   использование пользователями которой требуется получить.
//
// Возвращаемое значение:
//  Булево
//
Функция ОбластьДанныхИспользуетсяПользователями(ОбластьДанных) Экспорт
			
	Возврат Ложь;
	
КонецФункции

// Возвращает признак того, что область данных используется
//
// Параметры:
//  ОбластьДанных -  Число - значение разделителя области данных, 
//   использование которой требуется получить.
//
// Возвращаемое значение:
//  Булево
//
Функция ОбластьДанныхИспользуется(ОбластьДанных) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращает признак того, что информационная база используется как демонстрационная
//
// Возвращаемое значение:
//   Булево - Истина, если информационная база используется как демонстрационная
//
Функция ЭтоДемонстрационнаяИнформационнаяБаза() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Получает префикс области данных 
//
// Возвращаемое значение:
//  Строка
Функция ПолучитьПрефиксОбластиДанных() Экспорт
	
	Возврат "";
	
КонецФункции

// Устанавливает префикс области данных
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Параметры:
//	Префикс - Строка - префикс, который необходимо установить для области данных
//
Процедура УстановитьПрефиксОбластиДанных(Знач Префикс) Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	
КонецПроцедуры

// Возвращает массив номеров версий, поддерживаемых интерфейсом менеджера сервиса.
// Обращение к веб-сервису InterfaceVersion выполняется по переданным параметрам подключения. Если параметры подключения
// не указаны, по обращение производится под учетными данными служебного пользователя сервиса.
//
// Параметры:
//  ИмяИнтерфейса - Строка - имя запрашиваемого программного интерфейса, например, "СервисПередачиФайлов";
//  ПараметрыПодключения - см. НовыйПараметрыПодключенияКМенеджеруСервиса
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - массив строк, каждая строка является представлением номера версии интерфейса.
//                                   Например, "1.0.2.1".
//
Функция ПолучитьВерсииИнтерфейсаМенеджераСервиса(ИмяИнтерфейса, ПараметрыПодключения = Неопределено) Экспорт 
	
	Возврат РаботаВМоделиСервисаСлужебный.ПолучитьВерсииИнтерфейсаМенеджераСервиса(ИмяИнтерфейса, ПараметрыПодключения);
	
КонецФункции

// Возвращает шаблон параметров подключения к менеджеру сервиса.
// В шаблон подставляются значения переданных параметров Адрес, Пользователь и Пароль
// 
// Параметры:
//  Адрес - Строка - адрес веб-сервиса InterfaceVersion;
//  Пользователь - Строка - имя пользователя веб-сервиса;
//  Пароль - Строка - пароль пользователя веб-сервиса;
//
// Возвращаемое значение:
//  Структура:
//   Адрес - Строка - адрес веб-сервиса InterfaceVersion;
//   Пользователь - Строка - имя пользователя веб-сервиса;
//   Пароль - Строка - пароль пользователя веб-сервиса;
//
Функция НовыйПараметрыПодключенияКМенеджеруСервиса(Адрес = "", Пользователь = "", Пароль = "") Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебный.НовыйПараметрыПодключенияКМенеджеруСервиса(Адрес, Пользователь, Пароль);
	
КонецФункции

// Возвращает ключ области данных.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
//
// Возвращаемое значение:
//   Строка - ключ области данных.
//
Функция КлючОбластиДанных() Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;
	
КонецФункции

// Возвращает представление области данных.
//
// Возвращаемое значение:
//   Строка - представление области данных.
//
Функция ПредставлениеОбластиДанных() Экспорт
	
	РаботаВМоделиСервисаСлужебный.ВызватьИсключениеОтсутствуетРасширениеБТС();
	Возврат Неопределено;
	
КонецФункции

// Возвращает признак того, что информационная база находится в модели сервиса
//
// Возвращаемое значение:
//   Булево - Истина, если информационная база находится в модели сервиса
//
Функция ЭтоИнформационнаяБазаВМоделиСервиса() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Только для вызовов из конфигурации АгентСервиса и расширения FreshCustomIB

Функция ПоддерживаетсяНастройкаПравПользователейВМоделиСервисаБСП() Экспорт
	Возврат Ложь;
КонецФункции

Процедура ОчиститьДанныеОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, ОписаниеОбъектаМетаданных) Экспорт

	РаботаВМоделиСервисаСлужебный.ОчиститьДанныеОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, ОписаниеОбъектаМетаданных);

КонецПроцедуры

Процедура УдалитьПользователейОбласти(УдалятьТекущегоПользователя = Истина) Экспорт
	
	РаботаВМоделиСервисаСлужебный.УдалитьПользователейОбласти(УдалятьТекущегоПользователя);
	
КонецПроцедуры

Процедура УстановитьМонопольнуюБлокировку(ИспользоватьМногопоточность = Ложь) Экспорт
	
	РаботаВМоделиСервисаСлужебный.УстановитьМонопольнуюБлокировку(ИспользоватьМногопоточность);
	
КонецПроцедуры

Процедура СнятьМонопольнуюБлокировку(ИспользоватьМногопоточность = Ложь) Экспорт
	
	РаботаВМоделиСервисаСлужебный.СнятьМонопольнуюБлокировку(ИспользоватьМногопоточность);
	
КонецПроцедуры

// Выполняет контроль структуры метаданных по критерию недоступности неразделенных данных
// для записи из сеансов с включенным разделением.
// 
// Параметры:
//  ВызыватьИсключение - Булево - вызывать исключение при ошибке контроля.
// 
// Возвращаемое значение:
//	Структура:
//		* НеразделенныхДанныхНетВКонтролирующейПодписке - Массив из ОбъектМетаданных
//		* ТекстИсключенияНеразделенныхДанных - Строка
//		* ОбъектыСНесколькимиРазделителями - Массив из ОбъектМетаданных
//		* ТекстИсключенияСНесколькимиРазделителями - Строка
//		* ОбъектыМетаданных - Массив из ОбъектМетаданных - устаревшее свойство.
//		* ТекстИсключения - Строка - устаревшее свойство.
//
Функция КонтрольНеразделенныхДанныхПриОбновлении(ВызыватьИсключение = Истина) Экспорт
	
	ПравилаКонтроляМетаданных = Новый Соответствие;
	
	ПравилаКонтроляМетаданных.Вставить(Метаданные.Константы, "КонстантаМенеджерЗначения.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.Справочники, "СправочникОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.Документы, "ДокументОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.БизнесПроцессы, "БизнесПроцессОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.Задачи, "ЗадачаОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.ПланыВидовРасчета, "ПланВидовРасчетаОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.ПланыВидовХарактеристик, "ПланВидовХарактеристикОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.ПланыОбмена, "ПланОбменаОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.ПланыСчетов, "ПланСчетовОбъект.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.РегистрыБухгалтерии, "РегистрБухгалтерииНаборЗаписей.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.РегистрыНакопления, "РегистрНакопленияНаборЗаписей.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.РегистрыРасчета, "РегистрРасчетаНаборЗаписей.%1");
	ПравилаКонтроляМетаданных.Вставить(Метаданные.РегистрыСведений, "РегистрСведенийНаборЗаписей.%1");
	
	Исключения = Новый Массив();
	
	Исключения.Добавить(Метаданные.РегистрыСведений.КэшПрограммныхИнтерфейсов);
	Исключения.Добавить(Метаданные.Константы.БлокировкаОтправкиБыстрыхСообщений);
	Исключения.Добавить(Метаданные.РегистрыСведений.БезопасноеХранилищеДанных);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("СостоянияОбменовДанными"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("СостоянияУспешныхОбменовДанными"));
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") Тогда
		
		Исключения.Добавить(Метаданные.Справочники.Найти("КлючевыеОперации"));
		Исключения.Добавить(Метаданные.Справочники.Найти("ПрофилиКлючевыхОпераций"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыВремени"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыВремениТехнологические"));
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЦентрМониторинга") Тогда
		
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ДампыПлатформы"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ОперацииСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("КомментарииСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ОбластиСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("КомментарииОперацииСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("БуферОперацийСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыОперацииСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыКомментарииСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыОбластиСтатистики"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("СтатистикаКонфигурации"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ПакетыДляОтправки"));
		Исключения.Добавить(Метаданные.РегистрыСведений.Найти("ЗамерыСтатистики"));
		
	КонецЕсли;
	
	ИнтеграцияПодсистемБТС.ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	
	СтандартныеРазделители = Новый Массив; // Массив Из ОбъектМетаданныхОбщийРеквизит
	СтандартныеРазделители.Добавить(Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные);
	СтандартныеРазделители.Добавить(Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные);
	
	КонтрольныеПроцедуры = Новый Массив;
	КонтрольныеПроцедуры.Добавить(Метаданные.ПодпискиНаСобытия.КонтрольНеразделенныхНаборовЗаписейПриЗаписи.Обработчик);
	КонтрольныеПроцедуры.Добавить(Метаданные.ПодпискиНаСобытия.КонтрольНеразделенныхОбъектовПриЗаписи.Обработчик);
	КонтрольныеПроцедуры.Добавить(Метаданные.ПодпискиНаСобытия.КонтрольНеразделенныхНаборовЗаписейПриЗаписиТехнологияСервиса.Обработчик);
	КонтрольныеПроцедуры.Добавить(Метаданные.ПодпискиНаСобытия.КонтрольНеразделенныхОбъектовПриЗаписиТехнологияСервиса.Обработчик);
	
	КонтролирующиеПодписки = Новый Массив; // Массив Из ОбъектМетаданныхПодпискаНаСобытие
	
	Для Каждого ПодпискаНаСобытие Из Метаданные.ПодпискиНаСобытия Цикл
		
		Если КонтрольныеПроцедуры.Найти(ПодпискаНаСобытие.Обработчик) <> Неопределено Тогда
			
			КонтролирующиеПодписки.Добавить(ПодпискаНаСобытие);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НеразделенныхДанныхНетВКонтролирующейПодписке = Новый Массив;
	ОбъектыСНесколькимиРазделителями = Новый Массив;
	ОбъектыМетаданныхСНарушениями = Новый Массив;
	
	Для Каждого ПравилоКонтроляМетаданных Из ПравилаКонтроляМетаданных Цикл
		
		КонтролируемыеОбъектыМетаданных = ПравилоКонтроляМетаданных.Ключ; // Массив Из ОбъектМетаданных
		КонструкторТипаОбъектовМетаданных = ПравилоКонтроляМетаданных.Значение;
		
		Для Каждого КонтролируемыйОбъектМетаданных Из КонтролируемыеОбъектыМетаданных Цикл
			
			// 1. Проверка объекта метаданных на разделение несколькими разделителями.
			
			ЧислоРазделителей = 0;
			
			Для Каждого СтандартныйРазделитель Из СтандартныеРазделители Цикл
				
				Если ЭтоРазделенныйОбъектМетаданных(КонтролируемыйОбъектМетаданных, СтандартныйРазделитель.Имя) Тогда
					
					ЧислоРазделителей = ЧислоРазделителей + 1;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЧислоРазделителей > 1 Тогда
				
				ОбъектыСНесколькимиРазделителями.Добавить(КонтролируемыйОбъектМетаданных);
				ОбъектыМетаданныхСНарушениями.Добавить(КонтролируемыйОбъектМетаданных);
				
			КонецЕсли;
			
			// 2. Проверка неразделенных объектов метаданных на включение в состав контролирующих
			// подписок на события.
			
			Если ЗначениеЗаполнено(КонструкторТипаОбъектовМетаданных) Тогда
				
				Если Исключения.Найти(КонтролируемыйОбъектМетаданных) <> Неопределено Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				ТипОбъектаМетаданных = Тип(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КонструкторТипаОбъектовМетаданных, КонтролируемыйОбъектМетаданных.Имя));
				
				ТребуетсяКонтроль = Истина;
				
				Для Каждого СтандартныйРазделитель Из СтандартныеРазделители Цикл
					
					Если ЭтоРазделенныйОбъектМетаданных(КонтролируемыйОбъектМетаданных, СтандартныйРазделитель.Имя) Тогда
						
						ТребуетсяКонтроль = Ложь;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ОбеспеченКонтроль = Ложь;
				
				Если ТребуетсяКонтроль Тогда
					
					Для Каждого КонтролирующаяПодписка Из КонтролирующиеПодписки Цикл
						
						Если КонтролирующаяПодписка.Источник.СодержитТип(ТипОбъектаМетаданных) Тогда
							
							ОбеспеченКонтроль = Истина;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если ТребуетсяКонтроль И Не ОбеспеченКонтроль Тогда
					
					НеразделенныхДанныхНетВКонтролирующейПодписке.Добавить(КонтролируемыйОбъектМетаданных);
					ОбъектыМетаданныхСНарушениями.Добавить(КонтролируемыйОбъектМетаданных);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВызываемыеИсключения = Новый Массив;
	
	ТекстРазделителей = "";
	
	Для Каждого СтандартныйРазделитель Из СтандартныеРазделители Цикл
		
		Если Не ПустаяСтрока(ТекстРазделителей) Тогда
			
			ТекстРазделителей = ТекстРазделителей + ", ";
			
		КонецЕсли;
		
		ТекстРазделителей = ТекстРазделителей + СтандартныйРазделитель.Имя;
		
	КонецЦикла;
	
	ТекстИсключенияНеразделенныхДанных = "";
	
	Если НеразделенныхДанныхНетВКонтролирующейПодписке.Количество() > 0 Тогда
		
		ТекстПроблемныеОбъекты = "";
		
		Если ВызыватьИсключение Тогда
			
			Для Каждого ПроблемныйОбъект Из НеразделенныхДанныхНетВКонтролирующейПодписке Цикл
				
				Если Не ПустаяСтрока(ТекстПроблемныеОбъекты) Тогда
					
					ТекстПроблемныеОбъекты = ТекстПроблемныеОбъекты + ", ";
					
				КонецЕсли;
				
				ТекстПроблемныеОбъекты = ТекстПроблемныеОбъекты + ПроблемныйОбъект.ПолноеИмя();
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТекстПодписок = "";
		
		Для Каждого КонтролирующаяПодписка Из КонтролирующиеПодписки Цикл
			
			Если Не ПустаяСтрока(ТекстПодписок) Тогда
				
				ТекстПодписок = ТекстПодписок + ", ";
				
			КонецЕсли;
			
			ТекстПодписок = ТекстПодписок + КонтролирующаяПодписка.Имя;
			
		КонецЦикла;
		
		ТекстИсключенияНеразделенныхДанных = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Объекты метаданных, не входящие в состав разделителей %1,
						|должны быть включены в состав одной из подписок на события, контролирующих
						|невозможность записи неразделенных данных в разделенных сеансах: 
						|%2.'"),
					ТекстРазделителей, ТекстПодписок);
					
		Если ВызыватьИсключение Тогда
						
			ТекстИсключения = ТекстИсключенияНеразделенныхДанных + Символы.ПС + Символы.ПС 
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Следующие объекты метаданных не удовлетворяют этому критерию: 
						|%1.'"),
				ТекстПроблемныеОбъекты);
			ВызываемыеИсключения.Добавить(ТекстИсключения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстИсключенияСНесколькимиРазделителями = "";
	
	Если ОбъектыСНесколькимиРазделителями.Количество() > 0 Тогда
		
		ТекстПроблемныеОбъекты = "";
		
		Для Каждого ПроблемныйОбъект Из ОбъектыСНесколькимиРазделителями Цикл
			
			Если Не ПустаяСтрока(ТекстПроблемныеОбъекты) Тогда
				
				ТекстПроблемныеОбъекты = ТекстПроблемныеОбъекты + ", ";
				
			КонецЕсли;
			
			ТекстПроблемныеОбъекты = ТекстПроблемныеОбъекты + ПроблемныйОбъект.ПолноеИмя();
			
		КонецЦикла;
		
		ТекстИсключенияСНесколькимиРазделителями = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Объекты метаданных конфигурации должны быть разделены не более чем одним разделителем: %1.'"),
			ТекстРазделителей);
			
		Если ВызыватьИсключение Тогда
			
			ТекстИсключения = ТекстИсключенияСНесколькимиРазделителями + Символы.ПС + Символы.ПС 
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Следующие объекты не удовлетворяют этому критерию:
						|%1'"),
					ТекстПроблемныеОбъекты);
			ВызываемыеИсключения.Добавить(ТекстИсключения);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекстИсключения = "";
	Результат = Новый Структура;
	Результат.Вставить("ОбъектыМетаданных", ОбъектыМетаданныхСНарушениями); // для обратной совместимости
	Результат.Вставить("ТекстИсключения", ТекстИсключения); // для обратной совместимости
	Результат.Вставить("НеразделенныхДанныхНетВКонтролирующейПодписке", НеразделенныхДанныхНетВКонтролирующейПодписке);
	Результат.Вставить("ТекстИсключенияНеразделенныхДанных", ТекстИсключенияНеразделенныхДанных);
	Результат.Вставить("ОбъектыСНесколькимиРазделителями", ОбъектыСНесколькимиРазделителями);
	Результат.Вставить("ТекстИсключенияСНесколькимиРазделителями", ТекстИсключенияСНесколькимиРазделителями);
	
	Итератор = 1;
	
	Для Каждого ВызываемоеИсключение Из ВызываемыеИсключения Цикл
		
		Если Не ПустаяСтрока(Результат.ТекстИсключения) Тогда
			
			Результат.ТекстИсключения = Результат.ТекстИсключения + Символы.ПС + Символы.ВК;
			
		КонецЕсли;
		
		Результат.ТекстИсключения = Результат.ТекстИсключения + Формат(Итератор, "ЧДЦ=0; ЧГ=0") + ". " + ВызываемоеИсключение;
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Если ВызыватьИсключение Тогда
		
		Если Не ПустаяСтрока(Результат.ТекстИсключения) Тогда
			
			ВызватьИсключение НСтр("ru = 'Обнаружены ошибки в структуре метаданных конфигурации:'") 
				+ Символы.ПС + Символы.ВК + Результат.ТекстИсключения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет контроль структуры метаданных по критерию  упорядоченности общих реквизитов
// в дереве метаданных конфигурации.
//
Процедура КонтрольРазделителейПриОбновлении() Экспорт
	
	ПорядокПрикладныхДанных = 99;
	ПорядокВнутреннихДанных = 99;
	
	РазделительПрикладной = Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные;
	РазделительВнутренний = Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные;
	
	Итератор = 0;
	Для Каждого ОбщийРеквизитКонфигурации Из Метаданные.ОбщиеРеквизиты Цикл
		
		Если ОбщийРеквизитКонфигурации = РазделительПрикладной Тогда
			ПорядокПрикладныхДанных = Итератор;
		ИначеЕсли ОбщийРеквизитКонфигурации = РазделительВнутренний Тогда
			ПорядокВнутреннихДанных = Итератор;
		КонецЕсли;
		
		Итератор = Итератор + 1;
		
	КонецЦикла;
	
	Если ПорядокПрикладныхДанных <= ПорядокВнутреннихДанных Тогда
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обнаружено нарушение структуры метаданных конфигурации: общий реквизит %1 должен
                  |быть расположен в дереве метаданных конфигурации до общего реквизита
                  |%2 по порядку.'"),
			РазделительВнутренний.Имя,
			РазделительПрикладной.Имя);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
