
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(ФорматВидеоВИнтернете) Тогда
		ФорматВидеоВИнтернете = "video/mp4"
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВставитьВидеоYouTube(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоYouTube) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео YouTube не указан'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;
	
	ИдентификаторВидео = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ИдентификаторВидеоYouTubeИзURI(АдресВидеоYouTube);
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторВидео) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес не содержит идентификатор видео.
		|Укажите адрес страницы видео с сайта youtube.com.'"),,"ВставитьВидеоYouTube","ВставитьВидеоYouTube");
		Возврат;
	КонецЕсли;	
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоYouTube");
	РезультатВыбора.Вставить("ИдентификаторВидео", ИдентификаторВидео);
	
	Закрыть(РезультатВыбора);		
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьВидеоИзИнтернета(Команда)
	
	Если НЕ ЗначениеЗаполнено(АдресВидеоВИнтернете) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Адрес видео не указан'"),,"АдресВидеоВИнтернете","АдресВидеоВИнтернете");
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВидеоИзИнтернета");
	РезультатВыбора.Вставить("ГиперссылкаНаВидео", АдресВидеоВИнтернете);
	РезультатВыбора.Вставить("ФорматВидео", ФорматВидеоВИнтернете);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВидеоСДиска(Команда)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайлаВидеоВХранилище", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения,,, Истина, УникальныйИдентификатор);
		
	#Иначе
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФайлаВидео", ЭтотОбъект);
	
	МассивТиповВыбора = Новый Массив;
	МассивТиповВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипыЭлементовЭлектронныхРесурсов.Video"));
	
	ДиалогВыбораВидео = РазработкаЭлектронныхКурсовСлужебныйКлиент.ДиалогВыбораФайлаПоТипу(
		МассивТиповВыбора,
		НСтр("ru = 'Выберите файл с видео'"),
		НСтр("ru = 'Видео'"));
	
	ДиалогВыбораВидео.Показать(ОписаниеОповещения);
	
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПослеВыбораФайлаВидео(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ВыбранныеФайлы");
	РезультатВыбора.Вставить("ВыбранныеФайлы", ВыбранныеФайлы);
	
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайлаВидеоВХранилище(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	РезультатВыбора = Новый Структура();
	РезультатВыбора.Вставить("Тип", "ПомещенныеФайлы");
	РезультатВыбора.Вставить("Результат", Результат);
	РезультатВыбора.Вставить("Адрес", Адрес);
	РезультатВыбора.Вставить("ВыбранноеИмяФайла", ВыбранноеИмяФайла);
	
	Закрыть(РезультатВыбора);	
	
КонецПроцедуры

#КонецОбласти

