 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
         Возврат;
	 КонецЕсли;
	 
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		 Возврат;
	КонецЕсли;	 
 
	ДатаПереноса = НачалоГода(ТекущаяДатаСеанса()); 
	СпособХраненияФайлов = Константы.СпособХраненияФайлов.Получить();
	РазмерПорции = 50;
	УдалятьПодписанныеДанные = Истина;
	ЕстьТомаХраненияФайлов = РаботаСФайламиВТомахСлужебный.ЕстьТомаХраненияФайлов();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьУсловноеОформление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НачалоПереноса(Команда)
	
	ДлительнаяОперация = ПоискПодписанныхДанныхНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьСписокЗадачЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
	ПараметрыОжидания.Заголовок = НСтр("ru='Процесс поиска подписанных данных...'"); ; 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина; 
	ПараметрыОжидания.РежимОткрытияОкнаОжидания = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереносДанных(Команда)
	Если РазмерПорции = 0 Тогда
		 ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо указать размер порции'"),,Элементы.РазмерПорции);
		Возврат;
	КонецЕсли;	
	
	Если ПодписанныеДанныеЗадач.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нет данных для переноса'"),,Элементы.ПодписанныеДанныеЗадач);
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выполнить перенос данных (%1)?
			|Это может занять длительное время.'"),
		ПодписанныеДанныеЗадач.Количество());
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыполнитьПереносПродолжение", ЭтотОбъект),
		ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезПодтверждения(Отказ)
	
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьУсловноеОформление()
	
	Если Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.НачалоПереноса Тогда 
		
		УсловноеОформлениеНачалоПереноса();
		
	ИначеЕсли Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.НастройкиПереноса Тогда
		
		УсловноеОформлениеНастройкиПереноса();
		
	ИначеЕсли Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.ОжиданиеЗагрузки Тогда
		
		УсловноеОформлениеОжиданиеЗагрузки();
		
	ИначеЕсли Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.УспешноеЗавершение Тогда
		
		УсловноеОформлениеЗавершение();
		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеНачалоПереноса()

	СпособХраненияТолькоВБазе = СпособХраненияФайлов = "ВИнформационнойБазе"; 
	ТекстЗаголовка = "";  
	Если СпособХраненияТолькоВБазе Тогда
		ТекстЗаголовка = НСтр("ru='Внимание! Текущий вариант хранения файлов ""%1"". Для корректного переноса " +
		"в присоединенные файлы, необходимо  настроить хранение файлов ""В томах на сервере"" " + 
		"или ""В информационной базе и томах на сервере"" в разделе ""Настройки работы с файлами""'");
		ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, "В информационной базе"); 
	ИначеЕсли Не ЕстьТомаХраненияФайлов Тогда
		ТекстЗаголовка = НСтр("ru='Внимание! Необходимо настроить тома хранения в разделе ""Настройки работы с файлами""'");
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияАнализВариантаХранения", "Заголовок", 
	ТекстЗаголовка);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияАнализВариантаХранения", "Видимость", 
	СпособХраненияТолькоВБазе ИЛИ Не ЕстьТомаХраненияФайлов); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПереноса", "Видимость", ДанныеНаДату); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КнопкаНачалоПереноса", "Доступность", 
	Не СпособХраненияТолькоВБазе И ЕстьТомаХраненияФайлов);



КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеНастройкиПереноса()
	
	ЕстьЗадачиДляПереноса = ПодписанныеДанныеЗадач.Количество() > 0; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Перенести", "КнопкаПоУмолчанию", ЕстьЗадачиДляПереноса);
	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеОжиданиеЗагрузки()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрерватьЗагрузку", "Доступность", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УсловноеОформлениеЗавершение()
	ЕстьЗадачиДляПереноса = ПодписанныеДанныеЗадач.Количество() > 0;
	
	Если ЕстьЗадачиДляПереноса Тогда
		СтатусОшибка = СтатусФоновогоЗадания = "Ошибка"; 
		
		ТекстЗаголовка = ?(СтатусОшибка, ТекстОшибки,
		НСтр("ru = 'Подписанные данные успешно перенесены в присоединенные файлы.'")); 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Закрыть", "КнопкаПоУмолчанию", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияУспешноеЗавершение", "Заголовок", ТекстЗаголовка);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КартинкаУспешноеЗавершение", "Видимость", Не СтатусОшибка);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КартинкаЗавершениеСОшибкой", "Видимость", СтатусОшибка); 
		
	Иначе
		ТекстЗаголовка =  НСтр("ru='Не найдены подписанные данные, хранящиеся в хранилище значений. Перенос данных не требуется'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияУспешноеЗавершение", "Заголовок", ТекстЗаголовка);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Закрыть", "КнопкаПоУмолчанию", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КартинкаЗавершениеСОшибкой", "Видимость", ЕстьЗадачиДляПереноса);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоискПодписанныхДанныхНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Анализ хранения задач в базе данных'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	ДатаПереноса = ?(ДанныеНаДату, ДатаПереноса, Неопределено);
	Возврат 
		ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
			"РегистрыСведений.ПодписанныеДанные.ПолучитьЗадачиСДаннымиВХранилищеЗначений", ДатаПереноса);
	
КонецФункции 
	
&НаКлиенте
Процедура ЗаполнитьСписокЗадачЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ИнформацияОбОшибке = Результат.ИнформацияОбОшибке;
		Уточнение = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(ИнформацияОбОшибке,
			НСтр("ru = 'При заполнении списка задач произошла ошибка фонового задания'"));
		ОбработкаОшибок.ПоказатьИнформациюОбОшибке(ИнформацияОбОшибке, Уточнение.Текст);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокЗадачЗавершениеНаСервере(Результат.АдресРезультата); 
	
	Элементы.ШагиПереноса.ТекущаяСтраница = ?(ПодписанныеДанныеЗадач.Количество() > 0, 
	Элементы.НастройкиПереноса,	Элементы.УспешноеЗавершение);
	УстановитьУсловноеОформление();
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗадачЗавершениеНаСервере(АдресРезультата)
	
	СписокЗадач = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если СписокЗадач.Количество() > 0 Тогда
				
		ОбщийРазмерПодписанныхДанных = 0;
		Для Каждого ЭлементСпискаЗадач Из СписокЗадач Цикл
			НоваяСтрока = ПодписанныеДанныеЗадач.Добавить();
			НоваяСтрока.Задача = ЭлементСпискаЗадач;	
		КонецЦикла;	
		ПодписанныеДанныеЗадач[0].КоличествоВсего = СписокЗадач.Количество(); 
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереносПродолжение(РезультатВопроса, Проверки) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.ОжиданиеЗагрузки;
	УстановитьУсловноеОформление();
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполненияМногопоточно", ЭтотОбъект);  
	
	Задание = ЗапуститьМногопоточныйФоновыйПереносНаСервере();
	
	ИдентификаторЗадания = Задание.ИдентификаторЗадания;
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	НастройкиОжидания.ВыводитьОкноОжидания           = Ложь;
	НастройкиОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	НастройкиОжидания.ОтменятьПриЗакрытииФормыВладельца = Истина;
	
	Обработчик = Новый ОписаниеОповещения("ПослеФоновогоПереносаПодписанныхДанныхМногопоточно", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, Обработчик, НастройкиОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьМногопоточныйФоновыйПереносНаСервере()
	
	МассивЗадач = Новый Массив;
	Индекс = 0;
	ИндексЗадачиПотока = 0; 
	Поток = 0;
	ВсегоЗадач = ПодписанныеДанныеЗадач.Количество();  
	
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перенос подписанных данных в присоединенные файлы'");
	ПараметрыВыполнения.ПрерватьВыполнениеЕслиОшибка = Истина;
	
	ПараметрыМетода = Новый Соответствие();
	Пока Индекс < ВсегоЗадач Цикл 
		
		Если ИндексЗадачиПотока < РазмерПорции Тогда
			
			МассивЗадач.Добавить(ПодписанныеДанныеЗадач[Индекс].Задача);
			ИндексЗадачиПотока = ИндексЗадачиПотока + 1;
			Индекс = Индекс + 1; 
			
			Если Индекс = ВсегоЗадач Тогда 
				Поток = Поток + 1;
				СформироватьДанныеПотока(ВсегоЗадач, ПараметрыМетода, Поток, МассивЗадач);
			КонецЕсли;
			
		Иначе
			ИндексЗадачиПотока = 0;
			Поток = Поток + 1;
			СформироватьДанныеПотока(ВсегоЗадач, ПараметрыМетода, Поток, МассивЗадач);
		КонецЕсли;	
		 
	КонецЦикла;	
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьПроцедуруВНесколькоПотоков(
	"Обработки.ПомощникПереносаПодписанныхДанныхXMLВПрисоединенныеФайлы.ПеренестиХранениеПодписанныхДанныхМногопоточныйРежим", 
		ПараметрыВыполнения, ПараметрыМетода);

	Возврат ФоновоеЗадание;
	
КонецФункции

&НаСервере
Процедура СформироватьДанныеПотока(Знач ВсегоЗадач, Знач ПараметрыМетода, Поток, Знач МассивЗадач)
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("МассивЗадач", ОбщегоНазначения.СкопироватьРекурсивно(МассивЗадач)); 
	ПараметрыЗагрузки.Вставить("ВсегоЗадач", ВсегоЗадач);
	ПараметрыЗагрузки.Вставить("НомерПотока", Поток); 
	ПараметрыЗагрузки.Вставить("ПроверятьПодписанныеДанные", ПроверятьПодписанныеДанные);
	ПараметрыЗагрузки.Вставить("УдалятьПодписанныеДанные", УдалятьПодписанныеДанные);
	ПараметрыЗагрузки.Вставить("РазмерПорции", РазмерПорции);
	
	
	ПараметрыВызоваСервера = Новый Массив;
	ПараметрыВызоваСервера.Добавить(Поток);
	ПараметрыВызоваСервера.Добавить(ПараметрыЗагрузки);
	
	ПараметрыМетода.Вставить("Поток" + Формат(Поток,"ЧГ=0"), ПараметрыВызоваСервера);
	
	МассивЗадач.Очистить();

КонецПроцедуры     

&НаКлиенте
Процедура ПослеФоновогоПереносаПодписанныхДанныхМногопоточно(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Результат.Статус;  
	
	Если Статус = "Выполнено" Тогда
		
		Порции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ТипЗнч(Порции) = Тип("Соответствие") Тогда
	 		Для Каждого Порция Из Порции Цикл
				
				Если Порция.Значение.Статус = "Ошибка" Тогда
					Статус = Порция.Значение.Статус;
					Прервать;
				КонецЕсли;
			
	 		КонецЦикла;
 		КонецЕсли;
		
	КонецЕсли;
	
	Если Статус = "Ошибка" Тогда
		ТекстОшибки = НСтр("ru = 'Данные не перенесены. В процессе переноса данных в присоединенные файлы произошла ошибка.
				|Техническая информация:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		
		Результаты = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ТипЗнч(Результаты) = Тип("Соответствие") Тогда
			Для Каждого РезультатПорции Из Результаты Цикл
				Если РезультатПорции.Значение.Статус = "Ошибка" Тогда
					ТекстОшибки = НСтр("ru = 'Данные не перенесены. В процессе переноса данных в присоединенные файлы произошла ошибка.
						|Техническая информация:'") + Символы.ПС + РезультатПорции.Значение.КраткоеПредставлениеОшибки;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ШагиПереноса.ТекущаяСтраница = Элементы.УспешноеЗавершение;
	СтатусФоновогоЗадания = Статус;
    УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрогрессВыполненияМногопоточно(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполняется"
	   И Результат.Прогресс <> Неопределено Тогда
	
		Прогресс = Результат.Прогресс;
		
		Если Прогресс.Свойство("Процент") 
			И Прогресс.Свойство("ДополнительныеПараметры")
			И Прогресс.ДополнительныеПараметры = "ПрогрессМногопоточногоПроцесса" Тогда
			
			ПрогрессЗагрузки = Прогресс.Процент;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеНаДатуПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПереноса", "Видимость", ДанныеНаДату);

КонецПроцедуры

#КонецОбласти	   

	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   
	   





