#Область ПрограммныйИнтерфейс

// Вызывается при начале изучения электронного курса.
// Может быть использована для регистрации события.
// Отказаться от изучения нельзя.
// Для одного изучения может вызываться несколько раз.
// Можно переопределить переменные, например
// 	Контекст = ЭлектронныйКурс;
// 	Учащийся = Пользователи.ТекущийПользователь();
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого проходит изучение курса.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на тестируемого.
//
Процедура ПриСозданииФормыИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся) Экспорт
		
КонецПроцедуры

// Вызывается при закрытии формы электронного курса в режиме изучения.
// Отказаться от закрытия нельзя.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого пользователь изучает курс.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на учащегося.
//   Данные - Структура - Значения структуры:
//             - ЗавершеноВПроцентах - Число - прогресс изучения.
//             
//
Процедура ПриЗакрытииФормыИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, Данные) Экспорт
	
КонецПроцедуры

// Вызывается после окончания изучения электронного курса учащимся.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого пользователь изучает курс.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на учащегося.
//   Данные - Структура - Значения структуры:
//             - Балл - Число - оценка в стобалльной шкале.
//             
//
Процедура ПослеОкончанияИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, Данные) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Вызывается при закрытии электронного курса.
// Используйте процедуру ПриЗакрытииФормыИзученияЭлектронногоКурса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого пользователь изучает курс.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на учащегося.
//   Данные - Структура - Значения структуры:
//             - ЗавершеноВПроцентах - Число - прогресс изучения.
//             
//
Процедура ПриЗакрытииФормыЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, Данные) Экспорт	
	
КонецПроцедуры

// Устарела. Вызывается при начале изучения курса.
// Используйте процедуру ПриСозданииФормыИзученияЭлектронногоКурса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого проходит изучение курса.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на тестируемого.
//
Процедура ПриИзученииЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся) Экспорт
	
КонецПроцедуры

// Устарела. Вызывается после окончания изучения электронного курса учащимся.
// Используйте процедуру ПослеОкончанияИзученияЭлектронногоКурса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого пользователь изучает курс.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на учащегося.
//   Данные - Структура - Значения структуры:
//             - Балл - Число - оценка в стобалльной шкале.
//             
//
Процедура ПослеИзученияЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, Данные) Экспорт
	
КонецПроцедуры

// Устарела. Вызывается при создании формы электронного курса и перед выполнением проверок.
// Используйте процедуру ЭлектронноеОбучениеПереопределяемый.ПриСозданииФормыЭлектронногоКурса.
// 
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный тест.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого проходит тестирование.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//                 Задает ссылку на тестируемого.
//   РежимПроверки - Булево - Форма открыта для проверки преподавателем.
//   РежимРедактирования - Булево - Форма открыта для редактирования курса.
//   РежимПросмотра - Булево - Форма открыта для изучения курса.
//   ИмяОповещенияПриЗакрытии - Строка - Имя оповещения, которое будет вызвано после закрытия.
//   Отказ - Булево - Отказ от открытия.
// 
Процедура ПриСозданииФормыЭлектронногоКурса(ЭлектронныйКурс, Контекст, Учащийся, РежимПроверки, РежимРедактирования, РежимПросмотра, ИмяОповещенияПриЗакрытии, Отказ) Экспорт
	
КонецПроцедуры

// Устарела. Определяет версию обработчика обновления подсистемы электронного обучения.
// Используйте процедуру ЭлектронноеОбучениеПереопределяемый.ПриОпределенииСоответствияВерсийОбработчиковОбновлений. 
//
// Параметры:
//   СоответствиеВерсий - Соответствие - соответствие версии подсистемы Электронное обучение
//                        и родительской подсистемы.
//
//
Процедура ПриОпределенииСоответствияВерсийОбработчиковОбновлений(СоответствиеВерсий) Экспорт
	
КонецПроцедуры

// Устарела. Обработчик вызывается после загрузки курса через XML.
// Используйте процедуру РазработкаЭлектронныхКурсовПереопределяемый.ПослеЗагрузкиЭлектронногоКурсаВБазу.
//
Процедура ПослеЗагрузкиЭлектронногоКурсаВБазу() Экспорт
	
КонецПроцедуры

// Устарела. Вызывается при открытии формы списка электронных курсов.
// Используйте процедуру РазработкаЭлектронныхКурсовПереопределяемый.ПриОпределенииВариантаИнтерфейса.
//
// Параметры:
//   ТипыЭлектронныхКурсов - ПеречислениеСсылка.ТипыЭлектронныхКурсов - доступные типы курсов.
//   СтандартнаяОбработка - Булево - при значении Истина можно определить свой набор типов курсов.
//
Процедура ПриОпределенииВариантаИнтерфейса(ТипыЭлектронныхКурсов, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти
