#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Характеристики.Количество() > 0 Тогда
		ТаблицаХарактеристик = Характеристики.Выгрузить( , "Характеристика");
		Характеристики.Загрузить(ТаблицаХарактеристик);
	КонецЕсли;

	Оцениваемые.Очистить();
	ОценивающиеЭксперты.Очистить();
	ОценивающиеЭкспертыЕдиныйНабор.Очистить();
	
	ШаблонАнкеты = ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		ПометкаУдаленияДоЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Ссылка, "ПометкаУдаления");
			
		Если ПометкаУдаления <> ПометкаУдаленияДоЗаписи Тогда
			УстановитьПометкуУдаленияДокументовАнкетирования();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПометкуУдаленияДокументовАнкетирования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпросыПоКомпетенциямОцениваемые.НазначениеОпроса КАК Опрос
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка = &Ссылка
		|	И ОпросыПоКомпетенциямОцениваемые.НазначениеОпроса <> ЗНАЧЕНИЕ(Документ.НазначениеОпросов.ПустаясСылка)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	МассивОпросов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Опрос");
	
	Если МассивОпросов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Опрос Из МассивОпросов Цикл
		ОпросОбъект = Опрос.ПолучитьОбъект();
		ОпросОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		Если Не ПометкаУдаления Тогда
			ОпросОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НазначениеОпросов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОпросы
		|ИЗ
		|	Документ.НазначениеОпросов КАК НазначениеОпросов
		|ГДЕ
		|	НазначениеОпросов.Ссылка В (&МассивОпросов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Анкета.Ссылка КАК Анкета
		|ИЗ
		|	ВТОпросы КАК ВТОпросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Анкета КАК Анкета
		|		ПО ВТОпросы.Ссылка = Анкета.Опрос";
	Запрос.УстановитьПараметр("МассивОпросов", МассивОпросов);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АнкетаОбъект = Выборка.Анкета.ПолучитьОбъект();
		Если АнкетаОбъект.Проведен И ПометкаУдаления Тогда
			АнкетаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		ИначеЕсли АнкетаОбъект.ПометкаУдаления И Не ПометкаУдаления Тогда
			АнкетаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
			АнкетаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли