#Область СлужебныйПрограммныйИнтерфейс

// Возвращает ссылку на "Регистрацию в налоговом органе" по состоянию на дату.
//
// Параметры:
//  СтруктурнаяЕдиница	 - СправочникСсылка.ПодразделенияОрганизаций, 
//						   СправочникСсылка.Организации, 
//						   ОпределяемыйТип.ТерриторияВыполненияРабот  - структурная единица для получения регистрации в НО.
//  ДатаАктуальности	 - Дата                                       - дата, на которую будет получена регистрация.
// 
// Возвращаемое значение:
//  СправочникСсылка.РегистрацияВНалоговомОргане - ссылка на существующую регистрацию, либо ПустаяСсылка().
//
Функция РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, Знач ДатаАктуальности = Неопределено) Экспорт
	
	МенеджерСтруктурнойЕдиницы = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СтруктурнаяЕдиница);
	
	Возврат МенеджерСтруктурнойЕдиницы.РегистрацияВНалоговомОргане(СтруктурнаяЕдиница, ДатаАктуальности);
	
КонецФункции

Функция ДатаВступленияВСилуНА(ИмяНА) Экспорт
	Возврат РегистрыСведений.ДатыВступленияВСилуНА.ДатаВступленияВСилуНА(ИмяНА);
КонецФункции

Функция ДействующийПользовательФизическогоЛица(ФизическоеЛицо) Экспорт
	
	Возврат ФизическиеЛицаЗарплатаКадры.ПользовательФизическогоЛица(ФизическоеЛицо, Истина);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КэшИнформацииОВидахРасчета() Экспорт
	Возврат Новый Соответствие;
КонецФункции

// См. ЗарплатаКадры.ГоловнаяОрганизация.
Функция ГоловнаяОрганизация(Организация) Экспорт
	Возврат РегламентированнаяОтчетность.ГоловнаяОрганизация(Организация);
КонецФункции

// См. ЗарплатаКадры.ЭтоЮридическоеЛицо.
Функция ЭтоЮридическоеЛицо(Организация) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
КонецФункции

// Возвращает ссылку на валюту в которой происходит расчет заработной платы (рубль РФ).
// Номинирование тарифов, надбавок, выплата зарплаты допускается в любой валюте, 
// но расчеты выполняются в валюте учета зарплаты.
Функция ВалютаУчетаЗаработнойПлаты() Экспорт

	Возврат Справочники.Валюты.НайтиПоКоду("643");

КонецФункции

// Возвращает массив ссылок на виды документов удостоверяющих личность.
//
// Параметры:
//	ТолькоДляИностранныхГраждан - Булево - флаг, указывающий, будет ли проверка проходить 
//                                         только по документам иностранных граждан или нет.
//
// Возвращаемое значение:
//		Массив из Справочник.ВидыДокументовФизическихЛиц.Ссылка

Функция ВидыДокументовУдостоверяющихЛичностьФНС(ТолькоДляИностранныхГраждан = Ложь) Экспорт
	
	Если ТолькоДляИностранныхГраждан Тогда
		КодыДокументовСтрокой = УчетНДФЛ.КодыДопустимыхДокументовУдостоверяющихЛичностьИностранныхГраждан();
	Иначе
		КодыДокументовСтрокой = УчетНДФЛ.КодыДопустимыхДокументовУдостоверяющихЛичность();
	КонецЕсли;

	КодыДокументов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодыДокументовСтрокой, ",", , Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодыДокументов", КодыДокументов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыДокументовФизическихЛиц.Ссылка
	|ИЗ
	|	Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
	|ГДЕ
	|	ВидыДокументовФизическихЛиц.КодМВД В(&КодыДокументов)";
	
	ВидыДокументов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ВидыДокументов.Добавить(Выборка.Ссылка);	
	КонецЦикла;	
	
	Возврат ВидыДокументов;
		
КонецФункции	

// Возвращает настройки формирования печатных форм.
//
// Возвращаемое значение:
// 	ФиксированнаяСтруктура - см. РегистрыСведений.ДополнительныеНастройкиЗарплатаКадры.НастройкиПечатныхФорм()
//
Функция НастройкиПечатныхФорм() Экспорт
	
	НастройкиПечатныхФорм = РегистрыСведений.ДополнительныеНастройкиЗарплатаКадры.НастройкиПечатныхФорм();
	Возврат Новый ФиксированнаяСтруктура(НастройкиПечатныхФорм);
	
КонецФункции

// Возвращает коллекцию элементов справочника ВидыКонтактнойИнформации с типом Адрес.
//
Функция ВидыРоссийскихАдресов() Экспорт
	
	РоссийскиеАдреса = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
		|ГДЕ
		|	ВидыКонтактнойИнформации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
		|	И ВидыКонтактнойИнформации.ТолькоНациональныйАдрес";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РоссийскиеАдреса.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла; 
	
	Возврат РоссийскиеАдреса;
	
КонецФункции

// Получает размер минимальной оплаты труда.
//
// Параметры:
//	ДатаАктуальности - дата, на которую нужно получить МРОТ.
//
// Возвращаемое значение:
//	число, размер МРОТ на дату, или Неопределено, если МРОТ на дату не определен.
//
Функция МинимальныйРазмерОплатыТрудаРФ(ДатаАктуальности) Экспорт
	
	Возврат РегистрыСведений.МинимальнаяОплатаТрудаРФ.ДанныеМинимальногоРазмераОплатыТрудаРФ(ДатаАктуальности)["Размер"];
	
КонецФункции	

Функция МаксимальныйПриоритетСостоянийСотрудника() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Увольнение", Перечисления.СостоянияСотрудника.Увольнение);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СостоянияСотрудника.Порядок
	|ИЗ
	|	Перечисление.СостоянияСотрудника КАК СостоянияСотрудника
	|ГДЕ
	|	СостоянияСотрудника.Ссылка = &Увольнение";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Порядок;
КонецФункции	

// Проверяет принадлежность объекта метаданных к подсистемам. Проверка производится на вхождение
// в состав указанных подсистем и на вхождение в состав подсистем подчиненных указанным.
//
// Параметры:
//			ПолноеИмяОбъектаМетаданных 	- Строка, полное имя объекта метаданных (см. функцию НайтиПоПолномуИмени).
//			ИменаПодсистем				- Строка, имена подсистем, перечисленные через запятую.
//
// Возвращаемое значение:
//		Булево
//
Функция ОбъектМетаданныхВключенВПодсистемы(ПолноеИмяОбъектаМетаданных, ИменаПодсистем) Экспорт
	
	ЭтоОбъектПодсистемы = Ложь;
	
	МассивИменПодсистем = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаПодсистем);
	Для каждого ИмяПодсистемы Из МассивИменПодсистем Цикл
		
		МетаданныеПодсистемы = Метаданные.Подсистемы.Найти(ИмяПодсистемы);
		Если МетаданныеПодсистемы <> Неопределено Тогда
			ЭтоОбъектПодсистемы = ОбъектМетаданныхВключенВПодсистему(МетаданныеПодсистемы, ПолноеИмяОбъектаМетаданных);
		КонецЕсли;
		
		Если ЭтоОбъектПодсистемы Тогда
			Прервать;
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат ЭтоОбъектПодсистемы;
	
КонецФункции

// Проверяет вхождение объекта метаданных в подсистему. Рекурсивно проверяется вхождение
// объекта метаданных в подсистемы подчиненные указанной.
//
// Параметры:
//		МетаданныеПодсистемы	- Метаданные подсистемы.
//		МетаданныеОбъекта		- Метаданные объекта.
//
// Возвращаемое значение:
//		Булево
//
Функция ОбъектМетаданныхВключенВПодсистему(МетаданныеПодсистемы, ПолноеИмяОбъектаМетаданных)
	
	Возврат ЗарплатаКадрыПовтИсп.ОбъектыМетаданныхПодсистемы(МетаданныеПодсистемы.ПолноеИмя()).Получить(ПолноеИмяОбъектаМетаданных) = Истина;
	
КонецФункции

Функция ОбъектыМетаданныхПодсистемы(ПолноеИмяОбъектаМетаданныхПодсистемы) Экспорт
	
	СоставОбъектов = Новый Соответствие;
	ЗаполнитьОбъектыПодсистемы(Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданныхПодсистемы), СоставОбъектов);
	
	Возврат СоставОбъектов;
	
КонецФункции

Процедура ЗаполнитьОбъектыПодсистемы(МетаданныеПодсистемы, КоллекцияИменОбъектов)
	
	Для Каждого ОбъектСостава Из МетаданныеПодсистемы.Состав Цикл
		
		Если ОбъектСостава <> Неопределено Тогда
			КоллекцияИменОбъектов.Вставить(ОбъектСостава.ПолноеИмя(), Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого МетаданныеПодчиненнойПодсистемы Из МетаданныеПодсистемы.Подсистемы Цикл
		ЗаполнитьОбъектыПодсистемы(МетаданныеПодчиненнойПодсистемы, КоллекцияИменОбъектов);
	КонецЦикла;
	
КонецПроцедуры

// Строит соответствие тарифов страховых взносов на ОПС по категориям застрахованных лиц. 
//
// Параметры:
//  ОтчетныйГод - Число - год, для которого следует определить тариф;
//
// Возвращаемое значение:
//  Соответствие, ключом которого является категория ЗЛ (ПеречислениеСсылка.КатегорииЗастрахованныхЛицДляПФР), 
//					а значением - структура с полями ПФРСтраховая и ПФРНакопительная.
//
Функция ТарифыВзносовПоКатегориямЗЛ(ОтчетныйГод) Экспорт

	Возврат ПерсонифицированныйУчет.ТарифыПоКатегориям(Дата(ОтчетныйГод, 1, 1))

КонецФункции 

// Строит соответствие кодов тарифов страховых взносов на ОПС кодам категорий застрахованных лиц. 
//
// Параметры:
//  ОтчетныйГод - Число - год, для которого следует определить тариф;
//
// Возвращаемое значение:
//  Соответствие, ключом которого является код категории ЗЛ (строка), а значением - код тарифа (строка).
//
Функция СоответствиеКодовТарифаКодамКатегорийЗастрахованных(ОтчетныйГод) Экспорт
	Возврат ПерсонифицированныйУчет.СоответствиеКодовТарифаКодамКатегорийЗастрахованных(ОтчетныйГод)
КонецФункции

Функция ДоступныеОрганизации() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	ДоступныеОбъекты = Новый Структура("Организации,Филиалы");
	ДоступныеОбъекты.Филиалы = УправлениеДоступом.РазрешенныеЗначенияДляДинамическогоСписка(
		"Справочник.Организации", Тип("СправочникСсылка.Организации"));
	УстановитьОтключениеБезопасногоРежима(Ложь);
	
	ДоступныеОбъекты.Организации = ОрганизацииФилиалов(ДоступныеОбъекты.Филиалы);
	
	Возврат ДоступныеОбъекты;
	
КонецФункции

Функция ОрганизацииФилиалов(Филиалы)
	
	Если ЗначениеЗаполнено(Филиалы) Тогда
		
		ЗапросПоОрганизациям = Новый Запрос;
		ЗапросПоОрганизациям.УстановитьПараметр("РазрешенныеФилиалы", Филиалы);
		
		ЗапросПоОрганизациям.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В(&РазрешенныеФилиалы)";
		
		УстановитьПривилегированныйРежим(Истина);
		Организации = ЗапросПоОрганизациям.Выполнить().Выгрузить().ВыгрузитьКолонку("ГоловнаяОрганизация");
		УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		Организации = Новый Массив;
	КонецЕсли;
	
	Возврат Организации;
	
КонецФункции

// Возвращает список организаций, которые разрешены пользователю настройками ограничения доступа на уровне записей.
// Не проверяет доступность связанных данных организации, например, данных бухгалтерского учета.
// Можно использовать для установки отбора по организациям в динамических списках.
//
// Не следует (запрещается) вызывать эту функцию из кода, который может выполняться в привилегированном режиме,
// так как это приведет к последующей неверной ее работе вне привилегированного режима:
// может повторно использоваться значение, вычисленное в привилегированном режиме.
//
// Возвращаемое значение:
//  Массив - содержит СправочникСсылка.Организации
//
Функция ОрганизацииРазрешенныеПользователю(Пользователь = Неопределено) Экспорт
	
	Если Не УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей()
		Или Пользователи.ЭтоПолноправныйПользователь(Пользователь, , Ложь) Тогда
		
		// Ограничений по RLS нет, возвращаем все организации из справочника
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации");
		
		РазрешенныеЗначения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		
		// Вычисляем список разрешенных значений справочника "Организации" в рамках всех групп доступа
		РазрешенныеЗначения = УправлениеДоступом.РазрешенныеЗначенияДляДинамическогоСписка(
			"Справочник.Организации",
			Тип("СправочникСсылка.Организации"), ,
			Истина);
		
		Если Не ЗначениеЗаполнено(РазрешенныеЗначения) Тогда
			РазрешенныеЗначения = Новый Массив;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РазрешенныеЗначения;
	
КонецФункции

// Определяет перечень организаций, чтение данных которых, размещенных в конкретном объекте метаданных,
// разрешено пользователю настройками прав доступа.
//
// Функцию можно использовать, если требуется получать данные в привилегированном режиме для предоставления их пользователю - 
// она позволяет ограничить эти данные в соответствии с настройками.
//
// Функцию можно использовать только в тех случаях (для тех объектов),
// когда применяется стандартное ограничение доступа к запрашиваемому объекту метаданных - 
// то есть, аналогичное ограничению, применяемому для регистру бухгалтерии Хозрасчетный
// роли ДобавлениеИзменениеДанныхБухгалтерии.
//
// Порядок использования:
//  1. с помощью функции определяется список доступных организаций
//  2. в текстах запросов к самим данных (регистрам, документам) 
//     устанавливаются отборы по этим организациям
//  3. перед выполнением запроса к данным включается привилегированный режим.
//
// При использовании функции следует иметь в виду, что в общем случае ограничить выбираемые данные
// в соответствии с ОДД по Организации недостаточно:
// 1. в прикладном решении могут использоваться и иные виды доступа, не только Организации
// 2. перед установкой привилегированного режима в вызывающем коде следует проверить наличие прав
//    на чтение запрашиваемой таблицы (регистра, документов) в целом.
//
// Не следует (запрещается) вызывать эту функцию из кода, который может выполняться в привилегированном режиме,
// так как это приведет к последующей неверной ее работе вне привилегированного режима:
// может повторно использоваться значение, вычисленное в привилегированном режиме.
//
// Возвращаемое значение:
//  ФиксированныйМассив - содержит СправочникСсылка.Организации
//
// Параметры:
//  ИмяОбъектаДанных - Строка - полное имя объекта данных, доступ к которым проверяется, например, "РегистрБухгалтерии.Хозрасчетный"
//  ПравоНаИзменение - Булево - Истина, если после выполнения запроса данные предполагается менять
//               и нужно проверить, что у пользователя есть право на изменение
//  Пользователь     - СправочникСсылка.Пользователи - Ссылка на пользователя, для которого нужно получить список организаций.
// 
Функция ОрганизацииДанныеКоторыхДоступныПользователю(ИмяОбъектаДанных, ПравоНаИзменение = Ложь, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;

	Если Пользователи.ЭтоПолноправныйПользователь(Пользователь , , Ложь)
	 Или Не УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
		
		// Ограничений по RLS нет, возвращаем все организации из справочника
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
		Возврат Новый ФиксированныйМассив(МассивОрганизаций);
		
	КонецЕсли;

	Если ПараметрыСеанса.ОграничениеДоступаНаУровнеЗаписейУниверсально Тогда
	
		// Используется механизм ограничения доступа БСП 3.0.
		// В этом случае проверка права на запись отдельно не учитывается,
		// т.к. права на добавление/изменение/удаление проверяются в момент записи, а не чтения,
		// поэтому считаем, что если есть право на чтение, то может быть доступен и для записи.
		
		// Список доступных организаций получаем в обычном, непривилегированном режиме.
		// Выбираем список организаций, по которым можно читать записи регистра.
		
		Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				#ТаблицаРегистра КАК ТаблицаРегистра
		|			ГДЕ
		|				ТаблицаРегистра.Организация = Организации.Ссылка)",
		"#ТаблицаРегистра", ИмяОбъектаДанных);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		// Если по организации не введено ни одной записи, то считаем, что ее данные можно читать любому пользователю.
		
		Запрос.Текст = СтрЗаменить(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ #ТаблицаРегистра КАК ТаблицаРегистра
		|		ПО Организации.Ссылка = ТаблицаРегистра.Организация
		|ГДЕ
		|	ТаблицаРегистра.Организация ЕСТЬ NULL",
		"#ТаблицаРегистра", ИмяОбъектаДанных);
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОрганизаций,
			РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Иначе

		// Запрос взят из шаблона #ПоЗначениям роли ДобавлениеИзменениеДанныхБухгалтерии
		// с теми параметрами, с которыми он применяется для регистра бухгалтерии Хозрасчетный.
		Запрос.УстановитьПараметр("Пользователь",
			?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
		Запрос.УстановитьПараметр("Изменение", ПравоНаИзменение);
		Запрос.УстановитьПараметр("ИмяОбъектаДанных", ИмяОбъектаДанных);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Справочник.ИдентификаторыОбъектовМетаданных КАК СвойстваТекущейТаблицы
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|					ПО
		|						СвойстваТекущейТаблицы.ПолноеИмя = &ИмяОбъектаДанных
		|							И ИСТИНА В
		|								(ВЫБРАТЬ ПЕРВЫЕ 1
		|									ИСТИНА
		|								ИЗ
		|									РегистрСведений.ТаблицыГруппДоступа КАК ТаблицыГруппДоступа
		|								ГДЕ
		|									ТаблицыГруппДоступа.Таблица = СвойстваТекущейТаблицы.Ссылка
		|									И ТаблицыГруппДоступа.ГруппаДоступа = ГруппыДоступа.Ссылка
		|									И ТаблицыГруппДоступа.ПравоИзменение = &Изменение)
		|							И ГруппыДоступа.Ссылка В
		|								(ВЫБРАТЬ
		|									ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|								ИЗ
		|									Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|										ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|										ПО
		|											СоставыГруппПользователей.Пользователь = &Пользователь
		|												И СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
		|			ГДЕ
		|				ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступа КАК Значения
		|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыЗначенийДоступа КАК ГруппыЗначений
		|									ПО
		|										Значения.ГруппаДоступа = ГруппыДоступа.Ссылка
		|											И Значения.ЗначениеДоступа = Организации.Ссылка
		|											И ГруппыЗначений.ЗначениеДоступа = ГруппыЗначений.ГруппаЗначенийДоступа)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ = ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступаПоУмолчанию КАК ЗначенияПоУмолчанию
		|							ГДЕ
		|								ЗначенияПоУмолчанию.ГруппаДоступа = ГруппыДоступа.Ссылка
		|								И ТИПЗНАЧЕНИЯ(ЗначенияПоУмолчанию.ТипЗначенийДоступа) = ТИПЗНАЧЕНИЯ(Организации.Ссылка)
		|								И ЗначенияПоУмолчанию.ВсеРазрешены = ЛОЖЬ)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)";
		
		Если Не ПравоНаИзменение Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ТаблицыГруппДоступа.ПравоИзменение = &Изменение", "");
		КонецЕсли;
		Запрос.Текст = ТекстЗапроса;
		
		// Доступ к настройкам RLS выполняется в привилегированном режиме.
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		МассивОрганизаций = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");		
		
	КонецЕсли;

	Возврат Новый ФиксированныйМассив(МассивОрганизаций);
	
КонецФункции

Функция ИмяКлиентскогоПриложения() Экспорт
	
	ИмяПриложения = "1C Enterprise 8.3";
	
	СтандартнаяОбработка = Истина;
	
	ЗарплатаКадрыПереопределяемый.ПриОпределенииИмениКлиентскогоПриложения(ИмяПриложения, СтандартнаяОбработка);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадры") Тогда
		МодульКонфигурацииЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадры");
		МодульКонфигурацииЗарплатаКадры.ПриОпределенииИмениКлиентскогоПриложения(ИмяПриложения, СтандартнаяОбработка);
	КонецЕсли;
	
	Возврат ИмяПриложения;
	
КонецФункции

// Формирует соответствие статей расходов способам расчетов с физическими лицами.
//
//	Возвращаемое значение: Соответствие
//		Ключ 		- ПеречислениеСсылка.СпособыРасчетовСФизическимиЛицами
//		Значение 	- СправочникаСсылка.СтатьиРасходовЗарплата
//
Функция СтатьиРасходовПоСпособамРасчетовСФизическимиЛицами() Экспорт

	СоответствиеСпособовРасчетов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СтатьиРасходовЗарплата.Ссылка, ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка)) КАК Ссылка,
	|	СпособыРасчетовСФизическимиЛицами.Ссылка КАК СпособРасчетов
	|ИЗ
	|	Перечисление.СпособыРасчетовСФизическимиЛицами КАК СпособыРасчетовСФизическимиЛицами
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиРасходовЗарплата КАК СтатьиРасходовЗарплата
	|		ПО СпособыРасчетовСФизическимиЛицами.Ссылка = СтатьиРасходовЗарплата.СпособРасчетовСФизическимиЛицами
	|ГДЕ
	|	СтатьиРасходовЗарплата.СпособРасчетовСФизическимиЛицами <> ЗНАЧЕНИЕ(Перечисление.СпособыРасчетовСФизическимиЛицами.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСпособовРасчетов.Вставить(Выборка.СпособРасчетов, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат СоответствиеСпособовРасчетов;

КонецФункции

Функция УОрганизацииЕстьФилиалы(Знач Организация) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЕстьФилиалы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЕстьОбособленныеПодразделения");
	
	Если ЕстьФилиалы Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", Организация);
		
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ЕстьФилиал
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация
			|	И Организации.Ссылка <> &ГоловнаяОрганизация";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ЕстьФилиалы = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЕстьФилиалы;
	
КонецФункции

Функция РегномерПФРЗаполнен(Знач Организация, Знач Дата = Неопределено) Экспорт
	Возврат ЗначениеЗаполнено(СЭДОФСС.СведенияОСтрахователе(Организация, "РегНомПФР", Дата).РегНомПФР);
КонецФункции

Функция ОбъектыЗарплатноКадровойБиблиотекиСДополнительнымиСвойствами() Экспорт
	
	ОбъектыСоСвойствами = Новый Соответствие;
	ИменаПредопределенных = Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений.ПолучитьИменаПредопределенных();
	
	КоллекцииОбъектов = Новый Структура;
	КоллекцииОбъектов.Вставить("Справочник", Метаданные.Справочники);
	КоллекцииОбъектов.Вставить("Документ", Метаданные.Документы);
	КоллекцииОбъектов.Вставить("ПланВидовРасчета", Метаданные.ПланыВидовРасчета);
	
	Для Каждого ОписаниеКоллекции Из КоллекцииОбъектов Цикл
		
		Для Каждого МетаданныеОбъекта Из ОписаниеКоллекции.Значение Цикл
			
			ПолноеИмяОбъектаМетаданных = МетаданныеОбъекта.ПолноеИмя();
			Если Не ЗарплатаКадры.ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных) Тогда
				Продолжить;
			КонецЕсли; 
			
			ИмяНабораСвойств = ОписаниеКоллекции.Ключ + "_" + МетаданныеОбъекта.Имя;
			Если ИменаПредопределенных.Найти(ИмяНабораСвойств) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектыСоСвойствами.Вставить(ПолноеИмяОбъектаМетаданных, ИмяНабораСвойств);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОбъектыСоСвойствами;
	
КонецФункции

// Возвращает соответствие у которого Ключ содержит полное имя объекта метаданных,
// управляющего функциональными опциями, а значение- Массив полных имен метаданных
// функциональных опций которыми он управляет.
//
Функция ОбъектыУправляющиеФункциональнымиОпциями() Экспорт
	
	ОбъектыУправляющиеОпциями = Новый Соответствие;
	
	Для Каждого ФункциональнаяОпция Из Метаданные.ФункциональныеОпции Цикл
		
		Если Не ЗарплатаКадры.ЭтоОбъектЗарплатноКадровойБиблиотеки(ФункциональнаяОпция.ПолноеИмя()) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяХранения = ФункциональнаяОпция.Хранение.ПолноеИмя();
		Если СтрЧислоВхождений(ИмяХранения, ".") > 1 Тогда
			ИмяХранения = Лев(ИмяХранения, СтрНайти(ИмяХранения, ".", , , 2) - 1);
		КонецЕсли;
		
		КоллекцияОпций = ОбъектыУправляющиеОпциями.Получить(ИмяХранения);
		Если КоллекцияОпций = Неопределено Тогда
			КоллекцияОпций = Новый Массив;
		КонецЕсли;
		
		КоллекцияОпций.Добавить(ФункциональнаяОпция.ПолноеИмя());
		ОбъектыУправляющиеОпциями.Вставить(ИмяХранения, КоллекцияОпций);
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ОбъектыУправляющиеОпциями);
	
КонецФункции

// Возвращает соответствие с описанием объекта метаданных с дополнительными
// реквизитами (свойствами), управляемых значениями функциональных опций.
//
// Параметры:
//	ПолноеИмяФункциональнойОпции	- Строка, полное имя объектов метаданных
//										функциональная опция
//
// Возвращаемое значение:
//	Соответствие	-	*Ключ		- полное имя объекта метаданных
//						*Значение	- Имя предопределенной группы справочника
//										НаборыДополнительныхРеквизитовИСведений
//
Функция ОбъектыСДополнительнымиСвойствамиУправляемыеФункциональнымиОпциями(ПолноеИмяФункциональнойОпции) Экспорт
	
	ОбъектыЗарплатноКадровойБиблиотеки = ЗарплатаКадрыПовтИсп.ОбъектыЗарплатноКадровойБиблиотекиСДополнительнымиСвойствами();
	ОбъектыОпции = Новый Соответствие;
	
	ФункциональнаяОпция = Метаданные.НайтиПоПолномуИмени(ПолноеИмяФункциональнойОпции);
	Для Каждого Элемент Из ФункциональнаяОпция.Состав Цикл
		
		Если Элемент.Объект <> Неопределено Тогда
			
			ПолноеИмяОбъекта = Элемент.Объект.ПолноеИмя();
			
			ОписаниеОбъекта = ОбъектыЗарплатноКадровойБиблиотеки.Получить(ПолноеИмяОбъекта);
			Если ОписаниеОбъекта <> Неопределено Тогда
				ОбъектыОпции.Вставить(ПолноеИмяОбъекта, ОписаниеОбъекта);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбъектыОпции;
	
КонецФункции

// Возвращает соответствие с описанием объекта метаданных с дополнительными
// реквизитами (свойствами) не управляемыми значениями функциональных опций.
//
// Возвращаемое значение:
//	Соответствие	-	*Ключ - полное имя объекта метаданных
//						*Значение - Имя предопределенной группы справочника
//									НаборыДополнительныхРеквизитовИСведений
//
Функция ОбъектыСДополнительнымиСвойствамиНеУправляемыеФункциональнымиОпциями() Экспорт
	
	ОбъектыЗарплатноКадровойБиблиотеки = ЗарплатаКадрыПовтИсп.ОбъектыЗарплатноКадровойБиблиотекиСДополнительнымиСвойствами();
	
	ОбъектыОпций = ОбщегоНазначения.СкопироватьРекурсивно(ОбъектыЗарплатноКадровойБиблиотеки);
	Для Каждого ФункциональнаяОпция Из Метаданные.ФункциональныеОпции Цикл
		
		Для Каждого Элемент Из ФункциональнаяОпция.Состав Цикл
			
			Если Элемент.Объект <> Неопределено Тогда
				ОбъектыОпций.Удалить(Элемент.Объект.ПолноеИмя());
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ОбъектыОпций;
	
КонецФункции

Функция ОбъектыУправляемыеНесколькимиФункциональнымиОпциями() Экспорт
	
	ФункциональныеОпцииОбъектов = Новый Соответствие;
	ОбъектыКУдалению = Новый Соответствие;
	Для Каждого ФункциональнаяОпция Из Метаданные.ФункциональныеОпции Цикл
		
		Если Не ЗарплатаКадры.ЭтоОбъектЗарплатноКадровойБиблиотеки(ФункциональнаяОпция.ПолноеИмя()) Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОбъектСостава Из ФункциональнаяОпция.Состав Цикл
			
			Если ОбъектСостава.Объект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяОбъекта = ОбъектСостава.Объект.ПолноеИмя();
			Если СтрЧислоВхождений(ИмяОбъекта, ".") > 1 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не СтрНачинаетсяС(ИмяОбъекта, "Справочник.")
				И Не СтрНачинаетсяС(ИмяОбъекта, "Документ.") Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ФункциональныеОпцииОбъекта = ФункциональныеОпцииОбъектов.Получить(ИмяОбъекта);
			Если ФункциональныеОпцииОбъекта = Неопределено Тогда
				ФункциональныеОпцииОбъекта = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФункциональнаяОпция.ПолноеИмя());
				ОбъектыКУдалению.Вставить(ИмяОбъекта);
			Иначе
				ФункциональныеОпцииОбъекта.Добавить(ФункциональнаяОпция.ПолноеИмя());
				ОбъектыКУдалению.Удалить(ИмяОбъекта);
			КонецЕсли;
			
			ФункциональныеОпцииОбъектов.Вставить(ИмяОбъекта, ФункциональныеОпцииОбъекта);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ОписаниеОбъекта Из ОбъектыКУдалению Цикл
		ФункциональныеОпцииОбъектов.Удалить(ОписаниеОбъекта.Ключ);
	КонецЦикла;
	
	Возврат ФункциональныеОпцииОбъектов;
	
КонецФункции

Функция НачисленияРКСН() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииРК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииСН)";
	Запрос.УстановитьПараметр("КатегорииРК", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КатегорииРК());
	Запрос.УстановитьПараметр("КатегорииСН", Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КатегорииСН());
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура(
		"НачисленияРК,
		|НачисленияСН,
		|ДополнительныеНачисленияРК,
		|ДополнительныеНачисленияСН,
		|НачисленияРК2025,
		|НачисленияСН2025");
	
	Результат.НачисленияРК = РезультатыЗапроса[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Результат.НачисленияСН = РезультатыЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Результат.ДополнительныеНачисленияРК = Новый Массив;
	Результат.ДополнительныеНачисленияСН = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы") Тогда 
		МодульЗарплатаКадрыРасширенный = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыРасширенный");
		ДополнительныеНачисления = МодульЗарплатаКадрыРасширенный.ДополнительныеНачисленияРКСН();
		Результат.ДополнительныеНачисленияРК = ДополнительныеНачисления.ДополнительныеНачисленияРК;
		Результат.ДополнительныеНачисленияСН = ДополнительныеНачисления.ДополнительныеНачисленияСН;
	КонецЕсли;
	
	ОтборРК = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", ПредопределенноеЗначение("Перечисление.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент"));
	Результат.НачисленияРК2025 = ПланыВидовРасчета.Начисления.НачисленияПоОтбору(ОтборРК);
	
	ОтборСН = Новый Структура("КатегорияНачисленияИлиНеоплаченногоВремени", ПредопределенноеЗначение("Перечисление.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка"));
	Результат.НачисленияСН2025 = ПланыВидовРасчета.Начисления.НачисленияПоОтбору(ОтборСН);
	
	Возврат Результат;
КонецФункции

Функция РежимыЗамещения() Экспорт
	Если Не ЗарплатаКадрыПовтИсп.РежимыЗамещенияДоступны() Тогда
		Возврат Новый ФиксированнаяСтруктура("Добавление,Замещение,Обновление,Слияние,Удаление");
	КонецЕсли;
	// АПК:488-выкл Поддержка новых типов платформы (исполняемый код безопасен)
	Возврат Вычислить("РежимЗамещения");
	// АПК:488-вкл
КонецФункции

Функция РежимДобавленияНабораЗаписей() Экспорт
	Возврат ЗарплатаКадрыПовтИсп.РежимыЗамещения().Добавление;
КонецФункции

Функция РежимЗамещенияНабораЗаписей() Экспорт
	Возврат ЗарплатаКадрыПовтИсп.РежимыЗамещения().Замещение;
КонецФункции

Функция РежимыЗамещенияДоступны() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Версия = СистемнаяИнформация.ВерсияПриложения;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Версия, "8.3.26.1398") < 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ЗарплатаКадры.ИнформацияОВидеРасчета.
Функция ПолучитьИнформациюОВидеРасчета(ВидРасчета) Экспорт
	Возврат ЗарплатаКадры.ИнформацияОВидеРасчета(ВидРасчета);
КонецФункции

#КонецОбласти

#КонецОбласти
