
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьРегистрацииВОрганеСтатистики");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений) Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений);
	
КонецФункции

Функция УсловияЗапросаПроверкиНеобходимостиЗаполненияПодчиненныхПодразделений(Запрос, ИсточникДанных) Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.УсловияЗапросаПроверкиНеобходимостиЗаполненияПодчиненныхПодразделений(Запрос, ИсточникДанных);

КонецФункции

Процедура ЗаполнитьПодчиненноеПодразделение(ПодразделениеОбъект, ИсточникДанных) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьПодчиненноеПодразделение(ПодразделениеОбъект, ИсточникДанных);
		
КонецПроцедуры

Функция ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных) Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных);
	
КонецФункции

Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	Возврат ЗарплатаКадрыРасширенный.ЭтоБазоваяВерсияКонфигурации();
КонецФункции

// См. ЗарплатаКадры.ИспользуютсяДокументыОплатыВедомостей.
Функция ИспользуютсяДокументыОплатыВедомостей() Экспорт
	Возврат ЗарплатаКадрыРасширенный.ИспользуютсяДокументыОплатыВедомостей();
КонецФункции

Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КонфигурацииЗарплатаКадрыРасширенная") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КонфигурацииЗарплатаКадрыРасширенный");
		Модуль.ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

// Регистрация оплаты ведомостей.
//
// Параметры:
//		ПлатежныйДокумент - ДокументОбъект - платежный документ.
//		Организация       - СправочникСсылка.Организации - организация, выплачивающая зарплату.
//		Ведомости         - массив ссылок на ведомости (типа ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу,
//								Определяемый тип ВедомостьВБанкЗарплатаКадры).
//		ФизическиеЛица    - массив ссылок на физические лица.
//		ДатаОперации      - Дата - дата фактического выполнения оплаты. Если не указана, используется дата платежного документа
//		Отказ             - признак отказа выполнения операции.
//
// Обработка ошибочных ситуаций
//	выдается сообщение, признак «Отказ» выставляется в Истина.
//
Процедура ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, Ведомости, ФизическиеЛица, ДатаОперации, Отказ) Экспорт
	ЗарплатаКадрыРасширенный.ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, Ведомости, ФизическиеЛица, ДатаОперации, Отказ);	
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбораСправочникаОрганизации(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыРасширенный.ОбработкаПолученияДанныхВыбораСправочникаОрганизации(ДанныеВыбора, Параметры, СтандартнаяОбработка);
КонецПроцедуры

#Область БлокФункцийПолученияЗначенийПоУмолчанию

Процедура ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений) Экспорт
	ЗарплатаКадрыРасширенный.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений);
КонецПроцедуры

// Массив поддерживаемых идентификаторов значений по умолчанию.
Функция СписокДоступныхЗначенийПоУмолчанию() Экспорт
	Возврат ЗарплатаКадрыРасширенный.СписокДоступныхЗначенийПоУмолчанию();
КонецФункции

#КонецОбласти

#Область БазоваяФункциональность

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	ЗарплатаКадрыРасширенный.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
КонецПроцедуры

#КонецОбласти

#Область БизнесПроцессыИЗадачи

Процедура ПриЗаполненииНаборовЗначенийДоступаБизнесПроцессовИЗадач(Объект, Таблица) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииНаборовЗначенийДоступаБизнесПроцессовИЗадач(Объект, Таблица);
КонецПроцедуры

#КонецОбласти

#Область ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	ЗарплатаКадрыРасширенный.ОпределитьОбъектыСКомандамиОтчетов(Объекты);
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервереФормыОтчета(Форма, Отказ, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыРасширенный.ПриСозданииНаСервереФормыОтчета(Форма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Взаимодействия

Процедура ПриЗаполненииНаборовЗначенийДоступаВзаимодействий(Объект, Таблица) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииНаборовЗначенийДоступаВзаимодействий(Объект, Таблица);
КонецПроцедуры

#КонецОбласти

#Область Пользователи

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииНазначенияРолей(НазначениеРолей)
КонецПроцедуры

Процедура ЗаполнитьДанныеПодписанта(Объект, ПолеПодписанта, ПолеДолжностиПодписанта) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьДанныеПодписанта(Объект, ПолеПодписанта, ПолеДолжностиПодписанта);
КонецПроцедуры

#КонецОбласти

#Область ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииРазделовДатЗапретаИзменения(Разделы);
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
КонецПроцедуры

#КонецОбласти

#Область КалендарныеГрафики

Процедура ПриОбновленииПроизводственныхКалендарей(УсловияОбновления) Экспорт
	ЗарплатаКадрыРасширенный.ПриОбновленииПроизводственныхКалендарей(УсловияОбновления)
КонецПроцедуры

Процедура ПриОбновленииДанныхЗависимыхОтПроизводственныхКалендарей(УсловияОбновления) Экспорт
	ЗарплатаКадрыРасширенный.ПриОбновленииДанныхЗависимыхОтПроизводственныхКалендарей(УсловияОбновления)	
КонецПроцедуры

Процедура ПриЗаполненииИзменяемыхОбъектовЗависимыхОтПроизводственныхКалендарей(ИзменяемыеОбъекты) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииИзменяемыхОбъектовЗависимыхОтПроизводственныхКалендарей(ИзменяемыеОбъекты)
КонецПроцедуры

#КонецОбласти

#Область ПрефиксацияСправочниковПоОрганизации

Процедура ПолучитьПрефиксообразующиеРеквизиты(Объекты) Экспорт
	ЗарплатаКадрыРасширенный.ПолучитьПрефиксообразующиеРеквизиты(Объекты);
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

Процедура ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииСправочниковХраненияФайлов(ТипВладелецФайла, ИменаСправочников);
КонецПроцедуры

#КонецОбласти

#Область СозданиеНаОсновании

// См. СозданиеНаОснованииПереопределяемый.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании.
Процедура ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	ЗарплатаКадрыРасширенный.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииНаименованийНаборовСвойств.
Процедура ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка) Экспорт
	ЗарплатаКадрыРасширенный.ПриПолученииНаименованийНаборовСвойств(Наименования, КодЯзыка);
КонецПроцедуры

// См. УправлениеСвойствамиПереопределяемый.ЗаполнитьНаборыСвойствОбъекта.
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения);
КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты);
КонецПроцедуры

#КонецОбласти

#Область КонтрольВеденияУчета

// См. КонтрольВеденияУчетаПереопределяемый.ПриОпределенииПроверок.
Процедура ПриОпределенииПроверок(ГруппыПроверок, Проверки) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииПроверок(ГруппыПроверок, Проверки);
КонецПроцедуры

#КонецОбласти

#Область ЦентрМониторинга

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	ЗарплатаКадрыРасширенный.ПриСбореПоказателейСтатистикиКонфигурации();
КонецПроцедуры

#КонецОбласти

#Область НастройкиПрограммы

// См. НастройкиПрограммыПереопределяемый.НастройкиПользователейИПравПриСозданииНаСервере.
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.НастройкиПользователейИПравПриСозданииНаСервере(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ТехнологияСервиса

Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
	ЗарплатаКадрыРасширенный.ПриВключенииРазделенияПоОбластямДанных();
КонецПроцедуры

Процедура УстановитьПраваПоУмолчанию(Пользователь) Экспорт
	ЗарплатаКадрыРасширенный.УстановитьПраваПоУмолчанию(Пользователь)
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых не требуется сопоставление ссылок
// при загрузке данных в другую информационную базу, т.к. корректное сопоставление ссылок
// гарантируется с помощью других механизмов.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
КонецПроцедуры

#КонецОбласти

#Область ПоставляемыеДанные

Процедура ПолучитьОбработчикиПоставляемыхДанных(Обработчики) Экспорт
	ЗарплатаКадрыРасширенный.ПолучитьОбработчикиПоставляемыхДанных(Обработчики)	
КонецПроцедуры

#КонецОбласти

#Область ОчередьЗаданий

// См. ЗарплатаКадры.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	ЗарплатаКадрыРасширенный.ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны);
КонецПроцедуры

// См. ЗарплатаКадры.ПриПолученииСпискаШаблонов.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса);
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	
КонецПроцедуры

// См. БлокировкаРаботыСВнешнимиРесурсамиПереопределяемый.ПриЗапретеРаботыСВнешнимиРесурсами
Процедура ПриЗапретеРаботыСВнешнимиРесурсами() Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗапретеРаботыСВнешнимиРесурсами();
	
КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбработчиковТекущихДел(Обработчики);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОтключенииТекущихДел.
Процедура ПриОтключенииТекущихДел(ОтключаемыеДела) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОтключенииТекущихДел(ОтключаемыеДела);
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

// См. ШаблоныСообщенийПереопределяемый.ПриОпределенииНастроек
Процедура ПриОпределенииНастроекШаблоновСообщений(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНастроекШаблоновСообщений(Настройки);
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриПодготовкеШаблонаСообщения
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры);
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриФормированииСообщения
Процедура ПриФормированииСообщения(Сообщение, НазначениеШаблона, ПредметСообщения, ПараметрыШаблона) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриФормированииСообщения(Сообщение, НазначениеШаблона, ПредметСообщения, ПараметрыШаблона);
	
КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииПочтыПолучателейВСообщении
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, НазначениеШаблона, ПредметСообщения) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, НазначениеШаблона, ПредметСообщения);

КонецПроцедуры

// См. ШаблоныСообщенийПереопределяемый.ПриЗаполненииТелефоновПолучателейВСообщении
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, НазначениеШаблона, ПредметСообщения) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, НазначениеШаблона, ПредметСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентированнаяОтчетность

// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ВыгрузитьДокумент
Функция ВыгрузитьДокумент(Ссылка, УникальныйИдентификатор = Неопределено) Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.ВыгрузитьДокумент(Ссылка, УникальныйИдентификатор);
	
КонецФункции

// Функция возвращает сведения об организации.
//
// Параметры:
//  Организация			- ссылка на элемент справочника "Организации";
//  ДатаЗначения		- дата, на которую нужно получить сведения;
//  СписокПоказателей	- список показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//  Структура с ключами из списка показателей и возвращаемыми значениями.
//
Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	Возврат ЗарплатаКадрыРасширенный.ПолучитьСведенияОбОрганизации(Организация, ДатаЗначения, СписокПоказателей);
КонецФункции

// Процедура заполняет список используемых регламентированных отчетов.
//
Процедура ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов);
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета,
// 	ИДОтчета         - идентификатор отчета,
//	ИДРедакцииОтчета - идентификатор редакции формы отчета.
//  ПараметрыОтчета  - Структура - структура параметров отчета.
//
Процедура ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета = Неопределено) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета);
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗаполнитьРегламентированныйОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	ЗарплатаКадрыРасширенный.ЗаполнитьРегламентированныйОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер);
КонецПроцедуры

// Для ЗарплатаКадры.ПолучитьНастройкиВидимостиЭлементовФормы возвращает характеристику показываемой формы регламентированного отчета.
//  
// Возвращаемое значение:
//  Булево, истина - если рассматриваемую форму заполнять автоматически мы еще не умеем.
//
Функция НоваяФормаРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета) Экспорт
	Возврат	ЗарплатаКадрыРасширенный.НоваяФормаРегламентированногоОтчета(ИДОтчета, ИДРедакцииОтчета)
КонецФункции

// Функция возвращает имя справочника обособленных подразделений,
// используемого для автоматического заполнения статистической отчетности.
//
// Пример:
//  Возврат "ПодразделенияОрганизаций";
//
Функция ИмяСправочникаОбособленныхПодразделений() Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.ИмяСправочникаОбособленныхПодразделений();
	
КонецФункции

// Функция возвращает имя реквизита справочника подразделений, который
// определяет, является ли подразделение обособленным (в трактовке Росстата).
// Используется для автоматического заполнения статистической отчетности.
//
// Тип реквизита - Булево.
// Если значение реквизита равно Истина - подразделение является обособленным.
// Если значение реквизита равно Ложь - подразделение не является обособленным.
//
// Пример:
//  Возврат "ИмеетНомерТерриториальногоОрганаРосстата";
//
Функция ИмяРеквизитаПризнакаОбособленногоПодразделения() Экспорт
	
	Возврат ЗарплатаКадрыРасширенный.ИмяРеквизитаПризнакаОбособленногоПодразделения();
	
КонецФункции

// Процедура переопределяет свойства объекта, с которыми он будет отображен в форме Отчетность.
// Параметры:
//  СвойстваОбъектов  - ТаблицаЗначений - (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность).
Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	ЗарплатаКадрыРасширенный.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов);		
КонецПроцедуры

// Определяет свойства, касающиеся общих свойств объектов конфигураций-потребителей для отображения в форме Отчетность
// и возможности создания новый объектов из формы Отчетность.
//
// Параметры:
//  ТаблицаОписания  - ТаблицаЗначений -  (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности).
//
Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	ЗарплатаКадрыРасширенный.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);	
КонецПроцедуры

// Процедура переопределяет обработчик подписки на событие "ЗаписьОбъектовРегламентированнойОтчетности*".
//
// Параметры: - (см. РегламентированнаяОтчетностьПереопределяемый.ЗаписьОбъектовРегламентированнойОтчетности).
//
Процедура ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыРасширенный.ЗаписьОбъектовРегламентированнойОтчетности(Ссылка, Отказ, СтандартнаяОбработка);
КонецПроцедуры

// Получает код ОКПО обособленного подразделения
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   КодОКПО       - Строка(14) - код ОКПО обособленного подразделения.
Процедура ПолучитьКодОКПОПодразделения(Знач Подразделение, КодОКПО) Экспорт 
	ЗарплатаКадрыРасширенный.ПолучитьКодОКПОПодразделения(Подразделение, КодОКПО);
КонецПроцедуры

// Получает код органа ФСГС обособленного подразделения
// 
// Параметры:
//   Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   КодФСГС       - Строка(5) - код органа ФСГС для подразделения (например, "23-45").
//
Процедура ПолучитьКодОрганаФСГСПодразделения(Подразделение, КодФСГС) Экспорт 
	ЗарплатаКадрыРасширенный.ПолучитьКодОрганаФСГСПодразделения(Подразделение, КодФСГС);
КонецПроцедуры

// См. РегламентированнаяОтчетностьПереопределяемый.ОтчетыПриАктивизацииСтрокиНаСервере.
Процедура ОтчетыПриАктивизацииСтрокиНаСервере(СсылкаНаОбъект) Экспорт
	ЗарплатаКадрыРасширенный.ОтчетыПриАктивизацииСтрокиНаСервере(СсылкаНаОбъект);
КонецПроцедуры

// См. РегламентированнаяОтчетностьПереопределяемый.ФормаРегламентированнойОтчетности_ПриСозданииНаСервере.
Процедура ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма) Экспорт
	ЗарплатаКадрыРасширенный.ФормаРегламентированнойОтчетности_ПриСозданииНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	
КонецПроцедуры

// Дополнительные настройки списка команд печати.
//
// Параметры:
//  НастройкиСписка - Структура - модификаторы списка команд печати.
//   * МенеджерКомандПечати     - МенеджерОбъекта - менеджер объекта, в котором формируется список команд печати;
//   * АвтоматическоеЗаполнение - Булево - заполнять команды печати из объектов, входящих в состав журнала.
//                                         Значение по умолчанию: Истина.
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииНастроекПечати.
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНастроекПечати(Настройки);

КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриДобавленииКомандПечати
Процедура ПриДобавленииКомандПечати(ИмяФормы, КомандыПечати) Экспорт
	ЗарплатаКадрыРасширенный.ПриДобавленииКомандПечати(ИмяФормы, КомандыПечати);
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриПолученииКомандПечати.
Процедура ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииКомандПечати(КомандыПечати, ИмяОбъекта);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовПечатнойФормы.
Процедура ПриОпределенииОбъектовПечатнойФормы(ОбъектыПечатнойФормы, ИдентификаторПечатнойФормы, ИмяМенеджераПечати, ПараметрыПечати) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовПечатнойФормы(ОбъектыПечатнойФормы, ИдентификаторПечатнойФормы, ИмяМенеджераПечати, ПараметрыПечати);
	
КонецПроцедуры

// См. УправлениеПечатьюПереопределяемый.ПриПечати.
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

// См. УправлениеПечатьюМультиязычностьПереопределяемый.ПриОпределенииДоступныхДляПереводаМакетов
Процедура ПриОпределенииДоступныхДляПереводаМакетов(Макеты) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииДоступныхДляПереводаМакетов(Макеты);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронноеВзаимодействие

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников.
Процедура ЭлектронноеВзаимодействиеПриОпределенииСоответствияСправочников(СоответствиеСправочников) Экспорт
	
	ЗарплатаКадрыРасширенный.ЭлектронноеВзаимодействиеПриОпределенииСоответствияСправочников(СоответствиеСправочников);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа.
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	ЗарплатаКадрыРасширенный.ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа.
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииВидовДоступа(ВидыДоступа);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииИспользованияВидаДоступа.
Процедура ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииИспользованияВидаДоступа(ИмяВидаДоступа, Использование);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтернетПоддержкаПользователей

// См. ИнтернетПоддержкаПользователейПереопределяемый.ПриИзмененииДанныхАутентификацииИнтернетПоддержки.
Процедура ПриИзмененииДанныхАутентификацииИнтернетПоддержки(ДанныеПользователя) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриИзмененииДанныхАутентификацииИнтернетПоддержки(ДанныеПользователя);
	
КонецПроцедуры

// ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриДобавленииКлассификаторов(Классификаторы);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры);
	
КонецПроцедуры

// Конец ИнтернетПоддержкаПользователей.РаботаСКлассификаторами

#КонецОбласти

// Создает команду перехода из исходных регистров в обработку редактирования законодательных значений.
//
Процедура ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений(Форма, КоманднаяПанельФормы) Экспорт
	ЗарплатаКадрыРасширенный.ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений(Форма, КоманднаяПанельФормы);
КонецПроцедуры

Функция РегистраторыПереносаДанных() Экспорт
	Возврат ЗарплатаКадрыРасширенный.РегистраторыПереносаДанных();
КонецФункции

#Область УправлениеОтборамиВФормахСДинамическимСписком

Процедура НастроитьМодифицирующийПараметрОтбора(СтрокаПараметра, Список, МетаданныеОбъекта, Элементы) Экспорт
	ЗарплатаКадрыРасширенный.НастроитьМодифицирующийПараметрОтбора(СтрокаПараметра, Список, МетаданныеОбъекта, Элементы);
КонецПроцедуры

Процедура ДополнитьОписаниеМодифицирующегоПараметраОтбора(ИмяПараметра, ОписаниеПараметра, ИмяМодификации) Экспорт
	ЗарплатаКадрыРасширенный.ДополнитьОписаниеМодифицирующегоПараметраОтбора(
		ИмяПараметра, ОписаниеПараметра, ИмяМодификации);
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьЗначенияМинимальнойОплатыТрудаРФ(ТекстXML, ПолучатьДанныеИзСервиса) Экспорт
	ЗарплатаКадрыРасширенный.ОбновитьЗначенияМинимальнойОплатыТрудаРФ(ТекстXML, ПолучатьДанныеИзСервиса);
КонецПроцедуры

// Выполняет начальное заполнение справочников и регистров сведений. Поддерживаются
// следующие имена объектов метаданных:
//
// Подсистема РасчетЗарплаты:
//		РегистрСведений.МинимальнаяОплатаТрудаРФ
//
// Подсистема УчетНДФЛ:
//		Справочник.ВидыВычетовНДФЛ
//		Справочник.ВидыДоходовНДФЛ
//		Справочник.СтатусыНалогоплательщиковПоНДФЛ
//		РегистрСведений.ВычетыПоДоходамНДФЛ
//		РегистрСведений.РазмерВычетовНДФЛ.
//
// Подсистема УчетСтраховыхВзносов:
//		Справочник.ВидыДоходовПоСтраховымВзносам
//		Справочник.ВидыТарифовСтраховыхВзносов
//		РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов
//		РегистрСведений.СтраховыеВзносыСкидкиКДоходам
//		РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
//		РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда
//		РегистрСведений.ТарифыСтраховыхВзносов.
//
// Подсистема ПерсонифицированныйУчет;
//		Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК
//		Справочник.ОснованияДосрочногоНазначенияПенсии
//		Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК
//		Справочник.ПараметрыИсчисляемогоСтраховогоСтажа
//		Справочник.ТерриториальныеУсловияПФР
//		РегистрСведений.ДопустимыеСочетанияКодовГруппСтажа.
//
// Подсистема УчетПособийСоциальногоСтрахования:
//		РегистрСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты
//
Процедура УстановитьНачальныеЗначения(ИменаОбъектовМетаданных) Экспорт

	ЗарплатаКадрыРасширенный.УстановитьНачальныеЗначения(ИменаОбъектовМетаданных);

КонецПроцедуры

Процедура ПроверитьВозможностьСменыГоловнойОрганизации(Организация, Отказ) Экспорт
	
	ЗарплатаКадрыБазовый.ПроверитьВозможностьСменыГоловнойОрганизации(Организация, Отказ);
	
КонецПроцедуры

Функция ОписанияРегистровСодержащихРегистрацииВНалоговомОргане() Экспорт
	
	Возврат ЗарплатаКадрыБазовый.ОписанияРегистровСодержащихРегистрацииВНалоговомОргане();
	
КонецФункции

// ЗарплатаКадрыПодсистемы.ПодписиДокументов

// См. ПодписиДокументовПереопределяемый.ПриОпределенииРолейПодписантов.
Процедура ПриОпределенииРолейПодписантов(РолиПодписантов) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииРолейПодписантов(РолиПодписантов);
КонецПроцедуры


Процедура ОбработкаПолученияФормыСтатьиРасходовЗарплата(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыРасширенный.ОбработкаПолученияФормыСтатьиРасходовЗарплата(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец ЗарплатаКадрыПодсистемы.ПодписиДокументов

Процедура ПроверитьИсключенияПроверкиЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПроверкиЗапретаЗагрузки, ВерсияОбъекта) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьИсключенияПроверкиЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПроверкиЗапретаЗагрузки, ВерсияОбъекта);
	
КонецПроцедуры

// Предназначена для использования в ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных.
//
// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриДобавленииПереименованийОбъектовМетаданных(Итог);
	
КонецПроцедуры

Процедура ОбработкаДокументовПечатныхФорм() Экспорт
	
	ЗарплатаКадрыБазовый.ОбработкаДокументовПечатныхФорм();
	
КонецПроцедуры

// СтандартныеПодсистемы.ПоискИУдалениеДублей

Процедура ПриОпределенииОбъектовСПоискомДублей(Объекты) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовСПоискомДублей(Объекты);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииОбъектовСКомандамиУчетаОригиналов.
Процедура ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбъектовСКомандамиУчетаОригиналов(СписокОбъектов);
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ПриОпределенииМногосотрудниковыхДокументов.
Процедура ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииМногосотрудниковыхДокументов(СписокОбъектов);
	
КонецПроцедуры

// См. УчетОригиналовПервичныхДокументовПереопределяемый.ЗаполнитьТаблицуУчетаОригиналов.
Процедура ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьТаблицуУчетаОригиналов(ТаблицаУчетаОригиналов);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// СтандартныеПодсистемы.ИнформацияПриЗапуске

// См. ИнформацияПриЗапускеПереопределяемый.ОпределитьНастройки.
Процедура ОпределитьНастройки(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьНастройки(Настройки);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ИнформацияПриЗапуске

// СтандартныеПодсистемы.КонтактнаяИнформация

// См. УправлениеКонтактнойИнформацией.ПриОпределенииНастроек
//
Процедура ПриОпределенииНастроек(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНастроек(Настройки);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#Область РаботаСФайлами

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыСпискаФайлов.
Процедура ПриСозданииФормыСпискаФайлов(Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриСозданииФормыСпискаФайлов(Форма);
	
КонецПроцедуры

// См. РаботаСФайламиПереопределяемый.ПриСозданииФормыЭлементаФайлов.
Процедура ПриСозданииФормыЭлементаФайлов(Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриСозданииФормыЭлементаФайлов(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияС1СДокументооборот

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ДополнитьСоответствиеТипов.
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	
	ЗарплатаКадрыРасширенный.ДополнитьСоответствиеТипов(Таблица);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
Процедура ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриЗаполненииСвойстваОбъектаXDTOПоЗначению.
Процедура ПриЗаполненииСвойстваОбъектаXDTOПоЗначению(Значение, Свойства, ТипОбъекта, ИмяСвойства, ТипСвойства,
		СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииСвойстваОбъектаXDTOПоЗначению(
		Значение,
		Свойства,
		ТипОбъекта,
		ИмяСвойства,
		ТипСвойства,
		СтандартнаяОбработка);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриИзмененииСостоянияСогласования.
Процедура ПриИзмененииСостоянияСогласования(ПредметСогласования, Состояние, ВызовИзФормыОбъекта) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриИзмененииСостоянияСогласования(ПредметСогласования, Состояние, ВызовИзФормыОбъекта);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO.
Процедура ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(Результат, ЗначениеЗаполнения, ТипРеквизита, ИмяРеквизита,
		ТипОбъекта, Объект, ЭтоДополнительноеСвойство, Свойство, ПараметрыВыбора) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(
		Результат,
		ЗначениеЗаполнения,
		ТипРеквизита,
		ИмяРеквизита,
		ТипОбъекта,
		Объект,
		ЭтоДополнительноеСвойство,
		Свойство,
		ПараметрыВыбора);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииНеобходимостиВыводитьКомандуПрисоединенныхФайловДО.
Процедура ПриОпределенииНеобходимостиВыводитьКомандуПрисоединенныхФайловДО(Форма, НужноВыводитьКоманду, СтандартнаяОбработка = Неопределено) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНеобходимостиВыводитьКомандуПрисоединенныхФайловДО(
		Форма,
		НужноВыводитьКоманду,
		СтандартнаяОбработка);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииОбновляемыхРеквизитовПроведенногоДокумента.
Процедура ПриОпределенииОбновляемыхРеквизитовПроведенногоДокумента(ПолноеИмя, ОбновляемыеРеквизиты) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОбновляемыхРеквизитовПроведенногоДокумента(ПолноеИмя, ОбновляемыеРеквизиты);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотПереопределяемый.ПриОпределенииСокращенногоНаименованияКонфигурации.
Процедура ПриОпределенииСокращенногоНаименованияКонфигурации(СокращенноеНаименование) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииСокращенногоНаименованияКонфигурации(СокращенноеНаименование);
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриСозданииПоСсылке.
Процедура ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтеграцияС1САрхивом

// См. ОбменСАрхивомПереопределяемый.ПриСозданииНаСервере.
Процедура ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта) Экспорт

	ЗарплатаКадрыРасширенный.ПриСозданииНаСервере(Форма, ПараметрыРазмещения, ЭтоФормаОбъекта);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриОпределенииТипаФормы.
Процедура ЭтоФормаОбъекта(Форма, ЭтоФормаОбъекта) Экспорт
	
	ЗарплатаКадрыРасширенный.ЭтоФормаОбъекта(Форма, ЭтоФормаОбъекта);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриОпределенииИмениРеквизитаФормыСодержащегоИнтегрируемыйОбъект.
Процедура ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма, ИмяРеквизита) Экспорт
	
	ЗарплатаКадрыРасширенный.ИмяРеквизитаФормыСодержащегоИнтегрируемыйОбъект(Форма, ИмяРеквизита);

КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриОпределенииИменИсключаемыхКоманд.
Процедура ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииИменИсключаемыхКоманд(Форма, ИменаИсключаемыхКоманд);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.УстановитьВидимостьИДоступностьКоманд.
Процедура УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьВидимостьИДоступностьКоманд(Форма, СтандартнаяОбработка);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПроверитьГотовностьДокументаКОтправке.
Процедура ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ) Экспорт

	ЗарплатаКадрыРасширенный.ПроверитьГотовностьДокументаКОтправке(Ссылка, Отказ);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриЗаполненииТаблицыДанныхНСИДляВыгрузки.
Процедура ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, СвойстваОбъектаXDTO, ТаблицаНСИ) Экспорт
	
	ЗарплатаКадрыРасширенный.ТаблицаДанныхНСИДляВыгрузки(СсылкиНаОбъектыНСИ, СвойстваОбъектаXDTO, ТаблицаНСИ);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ОбновитьВидыДокументовПриОбновленииКонфигурации.
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ЗарплатаКадрыРасширенный.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);

КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриСозданииДокументовБИА.
Процедура СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА) Экспорт
	
	ЗарплатаКадрыРасширенный.СоздатьДокументыБИА(СсылкаНаОбъектИсточник, ДокументыБИА);
	
КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.ПриЗаписиКонстантыИнтеграцияС1САрхивом.
Процедура ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаписиКонстантыИнтеграцияС1САрхивом(Объект, Отказ);
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьРегистрацииВОрганеСтатистики(ПараметрыОбновления = Неопределено) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьРегистрацииВОрганеСтатистики(ПараметрыОбновления);
	
КонецПроцедуры

Процедура ПриОпределенииИнформацииОНачислениях(Кэш, Результат, ВидыРасчета) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииИнформацииОНачислениях(Кэш, Результат, ВидыРасчета);
КонецПроцедуры

Процедура ПриОпределенииИнформацииОбУдержаниях(Кэш, Результат, ВидыРасчета) Экспорт
	ЗарплатаКадрыРасширенный.ПриОпределенииИнформацииОбУдержаниях(Кэш, Результат, ВидыРасчета);
КонецПроцедуры

#Область ЗадачиБухгалтера

// См. ДокументооборотСКОПереопределяемый.ОбновитьИЗаполнитьТребованияФНС.
Процедура ОбновитьИЗаполнитьТребованияФНС(Организация, Дата) Экспорт
	
	ЗарплатаКадрыРасширенный.ОбновитьИЗаполнитьТребованияФНС(Организация, Дата);
	
КонецПроцедуры

// См. ДокументооборотСКОПереопределяемый.ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС.
Процедура ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС(Ссылка) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС(Ссылка);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьДоступныеВидыДействийКалендаряБухгалтера.
Процедура ПолучитьДоступныеВидыДействийКалендаряБухгалтера(МассивДоступныхДействий) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьДоступныеВидыДействийКалендаряБухгалтера(МассивДоступныхДействий);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныеИдентификаторыТребованийОтчетов.
Процедура ЗаполнитьКорректныеИдентификаторыТребованийОтчетов(ИдентификаторыТребований) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьКорректныеИдентификаторыТребованийОтчетов(ИдентификаторыТребований);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьПравилаИсключения.
Процедура ПолучитьПравилаИсключения(МенеджерВременныхТаблиц) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьПравилаИсключения(МенеджерВременныхТаблиц);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ДополнитьПредопределенныеПравила.
Процедура ДополнитьПредопределенныеПравила(Правила, ВерсияПравил) Экспорт
	
	ЗарплатаКадрыРасширенный.ДополнитьПредопределенныеПравила(Правила, ВерсияПравил);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов.
Процедура УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов(ВерсияДополнительныхПравил) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов(ВерсияДополнительныхПравил);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииТекстаЗапросаСпискаЗадач.
Процедура ПриОпределенииТекстаЗапросаСпискаЗадач(СписокЗадач) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииТекстаЗапросаСпискаЗадач(СписокЗадач);
	
КонецПроцедуры

// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействия.
Процедура ПриОпределенииОписанияДействия(ОписаниеДействия, Событие) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДействия(ОписаниеДействия, Событие);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов
//
Процедура ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов(Событие, ОписаниеДействия) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов(Событие, ОписаниеДействия);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ
//
Процедура ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ(Событие, Аванс, ОписаниеДействия) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ(Событие, Аванс, ОписаниеДействия);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные
//
Процедура ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные(Событие, ОписаниеДействия) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные(Событие, ОписаниеДействия);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПолучитьСвязанныеЗадачиВыплатыЗарплаты
//
Процедура ПолучитьСвязанныеЗадачиВыплатыЗарплаты(ТаблицаЗадач, РеквизитыДокумента, ПравилоВыплатыЗарплатыАванс) Экспорт

	ЗарплатаКадрыРасширенный.ПолучитьСвязанныеЗадачиВыплатыЗарплаты(ТаблицаЗадач, РеквизитыДокумента, ПравилоВыплатыЗарплатыАванс);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьСсылкиНаРеглОтчеты
//
Процедура ЗаполнитьСсылкиНаРеглОтчеты(ПараметрыРеглОтчетов) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьСсылкиНаРеглОтчеты(ПараметрыРеглОтчетов);

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииПризнакаДокументВыполняетЗадачу
//
Процедура ПриОпределенииПризнакаДокументВыполняетЗадачу(ДокументВыполняетЗадачу, ДокументОбъект) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииПризнакаДокументВыполняетЗадачу(ДокументВыполняетЗадачу, ДокументОбъект);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьРеквизитыПлатежаПоДаннымДокумента
//
Процедура ОпределитьРеквизитыПлатежаПоДаннымДокумента(РеквизитыПлатежа, ДокументСсылка) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьРеквизитыПлатежаПоДаннымДокумента(РеквизитыПлатежа, ДокументСсылка);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.УстановитьТекстЗапросаРеспондентыРосстата
//
Процедура УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса) Экспорт

	ЗарплатаКадрыРасширенный.УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.ОпределитьОрганизациюПоРеспонденту
//
Процедура ОпределитьОрганизациюПоРеспонденту(Организация, Респондент)Экспорт

	ЗарплатаКадрыРасширенный.ОпределитьОрганизациюПоРеспонденту(Организация, Респондент);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетРайонныйКоэффициент
//
Процедура ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетСевернуюНадбавку
//
Процедура ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияРаботаетВСельскойМестности
//
Процедура ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период) Экспорт

	ЗарплатаКадрыРасширенный.ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДоговорыПодряда
//
Процедура ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДокументыОтпускаБезСодержания
//
Процедура ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность);

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьСотрудники_ЧАЭС
//
Процедура ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьИспользуетсяТрудНаемныхРаботников
//
Процедура ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплачиваетсяЗарплата
//
Процедура ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период)

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированыКадровыеМероприятия
//
Процедура ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность) Экспорт

	ЗарплатаКадрыРасширенный.ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность);

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикТорговогоСбора
//
Процедура ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период) Экспорт

	ЗарплатаКадрыРасширенный.ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьНалогКУплатеПоДекларации3НДФЛ
//
Процедура УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период) Экспорт

	ЗарплатаКадрыРасширенный.ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия);
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов);
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме
//
Процедура ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам
//
Процедура ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомления
//
Процедура ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомленияСЭДО
//
Процедура ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьПолучателя
//
Процедура ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ЗаполнитьАдресИнформационнойБазы
//
Процедура ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьОтправлятьУведомления
//
Процедура УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных);

КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьПолучателя
//
Процедура УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя
//
Процедура ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя(Правила, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя(Правила, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление
//
Процедура ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление(ОписаниеДействия, Правило, Событие, ПолноеИмяПравила) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление(ОписаниеДействия, Правило, Событие, ПолноеИмяПравила);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииЗадачСвязанныхСОтчетом
//
Процедура ПриОпределенииЗадачСвязанныхСОтчетом(ЗадачиСвязанныеСОтчетом, Документ, СвойстваОтчета, ИсточникОтчета) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииЗадачСвязанныхСОтчетом(ЗадачиСвязанныеСОтчетом, Документ, СвойстваОтчета, ИсточникОтчета);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииОтбораНалоговыеОрганы
//
Процедура ПриПолученииОтбораНалоговыеОрганы(ОтборНалоговыеОрганы, Организация, КодНалоговогоОргана) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииОтбораНалоговыеОрганы(ОтборНалоговыеОрганы, Организация, КодНалоговогоОргана);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.УдалитьНеЗаполненныеЭлементыМассива
//
Процедура УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов) Экспорт
	
	ЗарплатаКадрыРасширенный.УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов);

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьДоступныеОрганизацииДляОтбора
//
Процедура ЗаполнитьДоступныеОрганизацииДляОтбора(Результат, Организация, ПравоНаИзменение) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьДоступныеОрганизацииДляОтбора(Результат, Организация, ПравоНаИзменение);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.РегулярныеПлатежи
//
Процедура ПриОпределенииНоваяТаблицаПлатежи(ТаблицаПлатежи, ТаблицаЗадач) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииНоваяТаблицаПлатежи(ТаблицаПлатежи, ТаблицаЗадач);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныйПериодВводаДокументов
//
Процедура ЗаполнитьКорректныйПериодВводаДокументов(КорректныйПериод) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьКорректныйПериодВводаДокументов(КорректныйПериод);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьИмяЗадачиБухгалтера
//
Процедура ПолучитьИмяЗадачиБухгалтера(ИмяЗадачи, ВидНалога, Организация, Период) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьИмяЗадачиБухгалтера(ИмяЗадачи, ВидНалога, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьОсобыеСрокиСверкиИмущественныхНалогов
//
Процедура ПолучитьОсобыеСрокиСверкиИмущественныхНалогов(ОсобыеСрокиСверки, Организация) Экспорт

	ЗарплатаКадрыРасширенный.ПолучитьОсобыеСрокиСверкиИмущественныхНалогов(ОсобыеСрокиСверки, Организация);

КонецПроцедуры

Процедура ЗаполнитьТаблицуСоответствияЗадачБухгалтераДляУведомлений(ВидыКодыНалогов) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьТаблицуСоответствияЗадачБухгалтераДляУведомлений(ВидыКодыНалогов);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьЭтоПравилоУплатыВзносовСДоходов
//
Процедура ПроверитьЭтоПравилоУплатыВзносовСДоходов(ЭтоПравилоУплатыВзносовСДоходов, Правило) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьЭтоПравилоУплатыВзносовСДоходов(ЭтоПравилоУплатыВзносовСДоходов, Правило);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизации
//
Процедура ЗаполнитьДоступныеОрганизации(ДоступныеОрганизации) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьДоступныеОрганизации(ДоступныеОрганизации);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизацииПоRLS
//
Процедура ЗаполнитьДоступныеОрганизацииПоRLS(ВсеОрганизации) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьДоступныеОрганизацииПоRLS(ВсеОрганизации);

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииЗадачНовыхОрганизаций
//
Процедура ПриПолученииЗадачНовыхОрганизаций(ЗадачиОрганизаций) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииЗадачНовыхОрганизаций(ЗадачиОрганизаций);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииТиповПравил
//
Процедура ПриПолученииТиповПравил(ТипыПравил) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииТиповПравил(ТипыПравил);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ
//
Процедура СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц, Организация, ОтборПравил) Экспорт
	
	ЗарплатаКадрыРасширенный.СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц, Организация, ОтборПравил);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилаУплатыНалоговНаМестах
//
Процедура СоздатьПравилаУплатыНалоговНаМестах(МенеджерВременныхТаблиц, Организация, ИмяЗадачи = "", ТекущийПериод = Неопределено) Экспорт
	
	ЗарплатаКадрыРасширенный.СоздатьПравилаУплатыНалоговНаМестах(МенеджерВременныхТаблиц, Организация, ИмяЗадачи, ТекущийПериод);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.УстановитьОтборПоОсновнойОрганизации
//
Процедура УстановитьОтборПоОсновнойОрганизации(Форма, ИмяСписка = "Список", ИмяРеквизита = "Организация", ЗначениеОтбора = Неопределено) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьОтборПоОсновнойОрганизации(Форма, ИмяСписка, ИмяРеквизита, ЗначениеОтбора);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьДанныеЗаполненияПриОднофирменномУчете
//
Процедура ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения, ИмяРеквизитаОрганизация) Экспорт
	
	ЗарплатаКадрыРасширенный.ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения, ИмяРеквизитаОрганизация);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПравоРедактированияНалогиОтчеты
//
Процедура ПроверитьПравоРедактированияНалогиОтчеты(Право) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьПравоРедактированияНалогиОтчеты(Право);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьЗапросПриПолученииАктуальныхПравил
//
Процедура ДополнитьЗапросПриПолученииАктуальныхПравил(Запрос, ТекстЗапроса) Экспорт
	
	ЗарплатаКадрыРасширенный.ДополнитьЗапросПриПолученииАктуальныхПравил(Запрос, ТекстЗапроса);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьКорректностьЗагружаемогоТребования
//
Процедура ПроверитьКорректностьЗагружаемогоТребования(Некорректное, КорректныеИдентификаторы, МассивДоступныхДействий, ИдентификаторЗадачи, ИдентификаторТребования, Действие) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьКорректностьЗагружаемогоТребования(Некорректное, КорректныеИдентификаторы, МассивДоступныхДействий, ИдентификаторЗадачи, ИдентификаторТребования, Действие);

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадачНастройка
//
Процедура ПриСозданииНаСервереСписокЗадачНастройка(Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриСозданииНаСервереСписокЗадачНастройка(Форма);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадач
//
Процедура ПриСозданииНаСервереСписокЗадач(Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриСозданииНаСервереСписокЗадач(Форма);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПоддерживается1СФинОтчетность
//
Процедура ПроверитьПоддерживается1СФинОтчетность(Поддерживается1СФинОтчетность) Экспорт
	
	ЗарплатаКадрыРасширенный.ПроверитьПоддерживается1СФинОтчетность(Поддерживается1СФинОтчетность);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ВосстановитьОтборСписка
//
Процедура ВосстановитьОтборСписка(Список, Настройки, ИмяОтбора) Экспорт
	
	ЗарплатаКадрыРасширенный.ВосстановитьОтборСписка(Список, Настройки, ИмяОтбора);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьУсловияПримененияПравил
//
Процедура ЗаполнитьУсловияПримененияПравил(Условия, Организация, НачалоПериода, КонецПериода) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьУсловияПримененияПравил(Условия, Организация, НачалоПериода, КонецПериода);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле
//
Процедура ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьСтруктуруИзРезультатаЗапроса
//
Процедура ПолучитьСтруктуруИзРезультатаЗапроса(СтруктураПараметров, РезультатЗапроса) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьСтруктуруИзРезультатаЗапроса(СтруктураПараметров, РезультатЗапроса);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьБаннерНаСервере
//
Процедура ПолучитьБаннерНаСервере(РезультатПолученияБаннера, СторонниеСертификаты, ПоказатьПредыдущий, Форма) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьБаннерНаСервере(РезультатПолученияБаннера, СторонниеСертификаты, ПоказатьПредыдущий, Форма);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьПравоВыполненияЗадачи
//
Процедура ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача);
	
КонецПроцедуры 

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ЗаполнитьСобытияКалендаряБухгалтера
//
Процедура ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДанныеЗадачиБухгалтера
//
Процедура ПолучитьДанныеЗадачиБухгалтера(ДанныеЗадачиБухгалтера, Организация) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьДанныеЗадачиБухгалтера(ДанныеЗадачиБухгалтера, Организация);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера
//
Процедура ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю
//
Процедура ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение, Пользователь) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение, Пользователь);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуНачалаДеятельности
//
Процедура ПолучитьДатуНачалаДеятельности(Дата, Организация) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьДатуНачалаДеятельности(Дата, Организация);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуПостановкиНаУчетНалогоплательщика
//
Процедура ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода) Экспорт
	
	ЗарплатаКадрыРасширенный.ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераВызовСервера.ИмяФормыНалогиОтчеты
//
Процедура ПриОпределенииИмениФормыНалогиОтчеты(ИмяФормы) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииИмениФормыНалогиОтчеты(ИмяФормы);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.КалендарьОтчетностиПриСозданииНаСервере
//
Процедура КалендарьОтчетностиПриСозданииНаСервере(Форма, Параметры, Отказ, СтандартнаяОбработка) Экспорт
	
	ЗарплатаКадрыРасширенный.КалендарьОтчетностиПриСозданииНаСервере(Форма, Параметры, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииСтатусовЗадачПоДокументамСЭДО
//
Процедура ПриОпределенииСтатусовЗадачПоДокументамСЭДО(ТаблицаЗадач, ЗадачиСоСтатусами, Запрос) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииСтатусовЗадачПоДокументамСЭДО(ТаблицаЗадач, ЗадачиСоСтатусами, Запрос);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьЭтоДокументСЗВ_ТД
//
Процедура ОпределитьЭтоДокументСЗВ_ТД(ЭтоДокументСЗВ_ТД, Документ) Экспорт
	
	ЗарплатаКадрыРасширенный.ОпределитьЭтоДокументСЗВ_ТД(ЭтоДокументСЗВ_ТД, Документ);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДанныеПлатежей
//
Процедура ЗаполнитьДанныеПлатежей(ДанныеПлатежей, Параметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьДанныеПлатежей(ДанныеПлатежей, Параметры);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриОпределенииТиповПравила
//
Процедура ПриОпределенииСпискаТиповПравила(СписокТипов) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииСпискаТиповПравила(СписокТипов);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриУстановкеТекстаЗапросаДанныеПриложения
//
Процедура ПриУстановкеТекстаЗапросаДанныеПриложения(ТекстЗапроса) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриУстановкеТекстаЗапросаДанныеПриложения(ТекстЗапроса);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриЗаполненииНаименованияОрганизацииОблачногоПриложения
//
Процедура ПриЗаполненииНаименованияОрганизацииОблачногоПриложения(Организация, Наименование) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииНаименованияОрганизацииОблачногоПриложения(Организация, Наименование);

КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.УстановитьПараметрыВыводаКалендаряОтчетности
//
Процедура УстановитьПараметрыВыводаКалендаряОтчетности(ПараметрыВывода) Экспорт
	
	ЗарплатаКадрыРасширенный.УстановитьПараметрыВыводаКалендаряОтчетности(ПараметрыВывода);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьРасписаниеДокументыСЭДО
//
Процедура ЗаполнитьРасписаниеДокументыСЭДО(Запрос, Расписание) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьРасписаниеДокументыСЭДО(Запрос, Расписание);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьЗаписьРасписанияДокументСЭДО
//
Процедура ЗаполнитьЗаписьРасписанияДокументСЭДО(Запрос, Расписание) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьЗаписьРасписанияДокументСЭДО(Запрос, Расписание);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииЗапросаИзменений
//
Процедура ПриОпределенииЗапросаИзменений(Запрос) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриОпределенииЗапросаИзменений(Запрос);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ВТЗадачиПоКадровымМероприятиям
//
Процедура ВТЗадачиПоКадровымМероприятиям(Запрос, ИмяТаблицы) Экспорт
	
	ЗарплатаКадрыРасширенный.ВТЗадачиПоКадровымМероприятиям(Запрос, ИмяТаблицы);
	
КонецПроцедуры

// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПриИзмененииСтатусаОтправкиДокумента.
Функция ПриИзмененииСтатусаОтправкиДокумента(Ссылка, СтатусОтправки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриИзмененииСтатусаОтправкиДокумента(Ссылка, СтатусОтправки);
	
КонецФункции

// Подробнее
// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ПриИзмененииРучногоСтатуса
//
Процедура ПриИзмененииРучногоСтатуса(Ссылка, Статус) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриИзмененииРучногоСтатуса(Ссылка, Статус);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПолученииДоступныхОрганизацийПользователя
//
Процедура ПриПолученииДоступныхОрганизацийПользователя(Организации) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриПолученииДоступныхОрганизацийПользователя(Организации);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодготовкеОтветаДанныеОтчетности
//
Процедура ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор) Экспорт

	ЗарплатаКадрыРасширенный.ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор);
	
КонецПроцедуры

// Подробнее
// См. РегламентированнаяОтчетностьПереопределяемый.ИзменитьРучнойСтатус
//
Процедура ИзменитьРучнойСтатус(Ссылка, Статус) Экспорт
	
	ЗарплатаКадрыРасширенный.ИзменитьРучнойСтатус(Ссылка, Статус);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцессыОбработкиДокументов

// См. ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ОписаниеДополнительныхОбработчиков.
Процедура ПриОпределенииОписанияДополнительныхОбработчиковПОД(МассивОбработчиков) Экспорт

	ЗарплатаКадрыРасширенный.ПриОпределенииОписанияДополнительныхОбработчиковПОД(МассивОбработчиков);

КонецПроцедуры

// См. ПроцессыОбработкиДокументовОбработчикиПереопределяемый.ИзменитьСтатусЗаявкиНаПолучениеОбразовательногоСертификата.
Процедура ИзменитьСтатусЗаявкиНаПолучениеОбразовательногоСертификата(Параметры) Экспорт

	ЗарплатаКадрыРасширенный.ИзменитьСтатусЗаявкиНаПолучениеОбразовательногоСертификата(Параметры);

КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.БазоваяФункциональность

// См. ОбщегоНазначенияПереопределяемый.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.БазоваяФункциональность

#КонецОбласти
