#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Параметры.Свойство("СинонимДокумента") Тогда
		 СинонимДокумента = Параметры.СинонимДокумента;
	Иначе	 
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИдентификаторДокумента);
		СинонимДокумента = МетаданныеДокумента.Синоним;
	КонецЕсли;	
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru = 'Список доступных этапов для документа ""%1""'"), СинонимДокумента);
	
	ВидНастроек = Параметры.ВидНастроек;
	РежимЗаполнения = Параметры.РежимЗаполнения;
	
	СписокДоступныхШаблонов.Параметры.УстановитьЗначениеПараметра("ИдентификаторДокумента", Параметры.ИдентификаторДокумента);
	СписокДоступныхШаблонов.Параметры.УстановитьЗначениеПараметра("ИдентификаторТекущегоЭтапа", Параметры.ИдентификаторТекущегоЭтапа);
	СписокДоступныхШаблонов.Параметры.УстановитьЗначениеПараметра("ТекущийШаблон", Параметры.ТекущийШаблон);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущаяСтрока = Элементы.СписокДоступныхШаблонов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Необходимо выбрать один из этапов'"));
		Возврат;
	КонецЕсли;	
	
	Если ВидНастроек = "НастройкаСвойствЭлементовПоЭтапам" Тогда
		
		СтруктураЭлементов = ЗаполнитьСтруктуруСвойствЭлементовВыбранногоЭтапаЭтапа(ТекущаяСтрока.Шаблон, ТекущаяСтрока.ИдентификаторЭтапа);
		СтруктураЭлементов.Вставить("РежимЗаполнения", РежимЗаполнения);
		
		Оповестить("КопированиеНастроекСвойствЭлементов", СтруктураЭлементов);
		
	ИначеЕсли ВидНастроек = "НастройкаЗонОтветственностиПоЭтапам" Тогда
		СтруктураЭлементов = Новый Структура;
		СтруктураЭлементов.Вставить("РежимЗаполнения", РежимЗаполнения);
		
		Оповестить("КопированиеНастроекЗонОтветственностиПоЭтапам", СтруктураЭлементов);

	КонецЕсли;
	
	Закрыть(); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаполнитьСтруктуруСвойствЭлементовВыбранногоЭтапаЭтапа(Знач Шаблон, Знач ИдентификаторЭтапа)

	ТаблицаНастроекСвойствЭлементов = ПроцессыОбработкиДокументов.НастройкиУправленияСвойствамиЭлементовСогласноЭтапу(Шаблон, ИдентификаторЭтапа);
	
	СтруктураЭлементов = ПроцессыОбработкиДокументовКлиентСервер.ПолучитьСтруктуруНастроекСвойствЭлементовСогласноЭтапу(
						 ТаблицаНастроекСвойствЭлементов, ИдентификаторЭтапа);
	
	Возврат СтруктураЭлементов;
КонецФункции

#КонецОбласти