////////////////////////////////////////////////////////////////////////////////
// Подсистема "Синхронизация данных".
// Серверные процедуры - шаблоны настроек обработчиков регистрации, вызываемые из методов
// НастройкиОбработчиковПравилРегистрации модулей менеджеров объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОтборПоСвойствамПланаОбмена

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации
Процедура ДляОтбораПоОрганизации(Настройки, СвойстваОбъекта = "Организация",
	РазделыДанных = "РегламентированныеДанные") Экспорт
	
	ДляОтбораПоСвойствамПланаОбмена(Настройки, СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоОрганизациям,
		СвойстваОбъекта);
		
	Если РазделыДанных <> Неопределено Тогда
		ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению
Процедура ДляОтбораПоПодразделению(Настройки, СвойстваОбъекта = "Подразделение",
	РазделыДанных = "УправленческиеДанные") Экспорт
	
	ДляОтбораПоСвойствамПланаОбмена(Настройки, СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоПодразделениям,
		СвойстваОбъекта);
		
	Если РазделыДанных <> Неопределено Тогда
		ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоСвойствамПланаОбмена
Процедура ДляОтбораПоСвойствамПланаОбмена(Настройки, ВидОтбора, СвойстваОбъекта) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"СинхронизацияДанныхБЗКНастройкиОбработчиков.ДляОтбораПоСвойствамПланаОбмена", "СвойстваОбъекта",
		СвойстваОбъекта, Новый ОписаниеТипов("Массив, Строка"));
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаОтборПоСвойствамПланаОбмена;
	
	Настройка.ДополнительныеПараметры.Вставить("СвойстваОбъекта", СвойстваОбъекта);
	Настройка.ДополнительныеПараметры.Вставить("ВидОтбора", ВидОтбора);

КонецПроцедуры

#КонецОбласти

#Область ОтборПоРазделамДанных

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных
Процедура ДляРегламентированныхДанных(Настройки) Экспорт
	ДляОтбораПоРазделамДанных(Настройки, "РегламентированныеДанные");
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных
Процедура ДляУправленческихДанных(Настройки) Экспорт
	ДляОтбораПоРазделамДанных(Настройки, "УправленческиеДанные");
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных
Процедура ДляОтбораПоРазделамДанных(Настройки, РазделыДанных) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"СинхронизацияДанныхБЗКНастройкиОбработчиков.ДляОтбораПоРазделамДанных", "РазделыДанных", РазделыДанных,
		Новый ОписаниеТипов("Массив,Строка"));
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаОтборПоРазделамДанных;
	
	Настройка.ДополнительныеПараметры.Вставить("РазделыДанных", РазделыДанных);

КонецПроцедуры

#КонецОбласти

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов
Процедура ДляСправочникаПрисоединенныхФайлов(Настройки) Экспорт
	ДляОграниченияПоРеквизиту(Настройки, "ВладелецФайла");
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами
Процедура ДляОбъектаСПрисоединеннымиФайлами(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаОбъектыСПрисоединеннымиФайлами;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника
Процедура ДляПодчиненногоСправочника(Настройки, РазделыДанных = Неопределено) Экспорт
	ДляОграниченияПоРеквизиту(Настройки, "Владелец", РазделыДанных);
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору
Процедура ДляРегистраПодчиненногоРегистратору(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаПодчиненныеРегистры;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра
Процедура ДляНезависимогоРегистра(Настройки, Данные, РазделыДанных = Неопределено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Настройки.Найти(СинхронизацияДанныхБЗКПравилаНезависимыеРегистры, "Модуль") = Неопределено,
		НСтр("ru = 'В настройках уже присутствует строка с модулем СинхронизацияДанныхБЗКПравилаНезависимыеРегистры'"),
		НСтр("ru = 'СинхронизацияДанныхБЗКНастройкиОбработчиков.ДляНезависимогоРегистра'"));
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаНезависимыеРегистры;
	Настройка.ДополнительныеПараметры.Вставить("Данные", Данные);
	
	Если РазделыДанных <> Неопределено Тогда
		Настройка.ДополнительныеПараметры.Вставить("РазделыДанных", РазделыДанных);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту
Процедура ДляОграниченияПоРеквизиту(Настройки, Реквизит, РазделыДанных = Неопределено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Настройки.Найти(СинхронизацияДанныхБЗКПравилаОграничениеПоРеквизиту, "Модуль") = Неопределено,
		НСтр("ru = 'В настройках уже присутствует строка с модулем СинхронизацияДанныхБЗКПравилаОграничениеПоРеквизиту'"),
		НСтр("ru = 'СинхронизацияДанныхБЗКНастройкиОбработчиков.ДляОграниченияПоРеквизиту'"));
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаОграничениеПоРеквизиту;
	Настройка.ДополнительныеПараметры.Вставить("Реквизит", Реквизит);
	
	Если РазделыДанных <> Неопределено Тогда
		Настройка.ДополнительныеПараметры.Вставить("РазделыДанных", РазделыДанных);
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистрацииДвижений
Процедура ДляРегистрацииДвижений(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаРегистрацияДвижений;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСовместноРегистрируемыхОбъектов
Процедура ДляСовместноРегистрируемыхОбъектов(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаРегистрацияОбъектов;
		
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом
Процедура ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки, РазделыДанных = "РегламентированныеДанные",
	ИменаРеквизитов = Неопределено) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.ПриОбработкеПослеИзменения = Истина;
	Настройка.ПриОбработкеПередИзменением = Истина;
	Настройка.ПослеОбработки = Истина;
	Настройка.Модуль = СинхронизацияДанныхБЗКПравилаОтборПоГоловнойОрганизацииФизлица;

	Если ЗначениеЗаполнено(РазделыДанных) Тогда
		Настройка.ДополнительныеПараметры.Вставить("РазделыДанных", РазделыДанных);
	КонецЕсли;
	
	Если ИменаРеквизитов <> Неопределено Тогда
		Настройка.ДополнительныеПараметры.Вставить("ИменаРеквизитов", ИменаРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
