///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

&НаКлиенте
Перем ЗагруженныеРазделы;	// Массив из Строка - список загруженных разделов после последнего обновления.

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не МониторПортала1СИТС.ДоступноИспользованиеМонитора() Тогда
		ВызватьИсключение НСтр("ru = 'Использование Монитора Портала 1С:ИТС недоступно в текущем режиме работы.'");
	КонецЕсли;
	
	ЭтоWindowsКлиент     = ОбщегоНазначения.ЭтоWindowsКлиент();
	АктивныйРазделЦвет   = ЦветаПалитры.ПервыйБрендовый;
	НеАктивныйРазделЦвет = Элементы.КарточкаУсловияСопровождения.ЦветФона;
	
	ПараметрыОбработчикаПриОткрытии = Новый Структура;
	Если Не ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки() Тогда
		ПараметрыОбработчикаПриОткрытии.Вставить("ПодключитьИнтернетПоддержку", Истина);
		Возврат;
	Иначе
		ПараметрыОбработчикаПриОткрытии.Вставить("ПодключитьИнтернетПоддержку", Ложь);
	КонецЕсли;
	
	МониторПортала1СИТС.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПараметрыСоздания = Новый Структура;
	ИнтеграцияПодсистемБИП.ПриСозданииФормыМонитора(
		ЭтотОбъект,
		ПараметрыСоздания);
	МониторПортала1СИТСПереопределяемый.ПриСозданииФормыМонитора(
		ЭтотОбъект,
		ПараметрыСоздания);
	
	ОчиститьКонтекстФормы();
	ИнициализироватьОписаниеЗаданий();
	
	НачатьОбновлениеСодержимогоМонитораНаСервере(Ложь, Параметры.ПриНачалеРаботы);
	
	ДоступнаОтправкаСообщенийТехПоддержке =
		ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки");
	Если Не ДоступнаОтправкаСообщенийТехПоддержке Тогда
		
		Элементы.СообщениеВТехподдержку.Видимость                                   = Ложь;
		Элементы.ДекорацияСсылкаНаписатьВТехподдержку.Видимость                     = Ложь;
		Элементы.ДекорацияСсылкаНаписатьВТехподдержкуУсловияСопровождения.Видимость = Ложь;
		Элементы.ДекорацияСсылкаНаписатьВТехподдержкуОбновлениеПрограммы.Видимость  = Ложь;
		Элементы.ДекорацияСсылкаНаписатьВТехподдержкуСервисы1С.Видимость            = Ложь;
		
		Элементы.ПоддержкаПродуктаНеОказываетсяОписание.Заголовок =
			НСтр("ru = 'Интернет-поддержка этого программного продукта не оказывается.
				|Обратитесь к партнеру, у которого приобретена эта программа.'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПараметрыОбработчикаПриОткрытии.ПодключитьИнтернетПоддержку Тогда
		Отказ = Истина;
		МониторПортала1СИТСКлиент.ОткрытьМониторСПодключениемИнтернетПоддержки();
	Иначе
		ПриНачалеЗадания(
			ОперацияСодержимоеМонитора());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ОбработатьОжидание");
		Если ЕстьАктивныеЗадания(Задания) Тогда
			ОтменитьВыполнениеВсехЗаданий();
		КонецЕсли;
	КонецЕсли;
	
	ИнтеграцияПодсистемБИПКлиент.ПриЗакрытииФормыМонитора(
		ЭтотОбъект,
		ЗавершениеРаботы);
	МониторПортала1СИТСКлиентПереопределяемый.ПриЗакрытииФормыМонитора(
		ЭтотОбъект,
		ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИнтернетПоддержкаПодключена" Тогда
		НачатьОбновлениеСодержимогоМонитора();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область Шапка

&НаКлиенте
Процедура ЛогинНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИнтернетПоддержкаПользователейКлиент.ОткрытьЛичныйКабинетПользователя();
	
КонецПроцедуры

#КонецОбласти

#Область КарточкиРазделов

&НаКлиенте
Процедура КарточкаУсловияСопровожденияНажатие(Элемент)
	
	ПриВыбореКарточкиРаздела(
		ОперацияУсловияСопровождения());
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаОбновлениеПрограммыНажатие(Элемент)
	
	ПриВыбореКарточкиРаздела(
		ОперацияОбновлениеПрограммы());
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаСервисы1СНажатие(Элемент)
	
	ПриВыбореКарточкиРаздела(
		ОперацияСервисы1С());
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаПредупрежденияНажатие(Элемент)
	
	ПриВыбореКарточкиРаздела(
		ОперацияПредупрежденийСервисов());
	
КонецПроцедуры

#КонецОбласти

#Область УсловияСопровождения

#Область УсловияВыполнены

&НаКлиенте
Процедура ДекорацияКакОформитьДоговорИТСУсловияВыполненыИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакАктивироватьСервисСопровожденияУсловияВыполненыИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область УсловияНеВыполнены

&НаКлиенте
Процедура ДекорацияКакЗарегистрироватьПродуктСсылкаНажатие(Элемент)
	
	ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуОфициальнаяПоддержка(
		"#register-portal");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакЗаключитьДоговорИТСИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакАктивироватьСервисСопровожденияИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияСсылкаЖурналРегистрацииУсловияСопровожденияНажатие(Элемент)
	
	ОткрытьЖурналРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНастройкиПроксиУсловияСопровожденияНажатие(Элемент)
	
	ОткрытьФормуПараметровПроксиСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаписатьВТехподдержкуУсловияСопровожденияНажатие(Элемент)
	
	ОтправитьСообщениеВТехПоддержку(
		НСтр("ru = 'Не удалось получить данные об условиях сопровождения.'")
		+ Символы.ПС
		+ ИнтернетПоддержкаПользователейКлиент.ТекстФорматированногоЗаголовка(
			Элементы.УсловияСопровожденияОшибкаНадпись.Заголовок)
		+ Символы.ПС
		+ ПодробноеОписаниеОшибкиДляТехПоддержки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПрограммы

&НаКлиенте
Процедура ДекорацияИнформацияОбОбновленииОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаЖурналРегистрацииОбновлениеПрограммыНажатие(Элемент)
	
	ОткрытьЖурналРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНастройкиПроксиОбновлениеПрограммыНажатие(Элемент)
	
	ОткрытьФормуПараметровПроксиСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаписатьВТехподдержкуОбновлениеПрограммыНажатие(Элемент)
	
	ОтправитьСообщениеВТехПоддержку(
		НСтр("ru = 'Не удалось обновить информацию об обновлении программы.'")
		+ Символы.ПС
		+ ИнтернетПоддержкаПользователейКлиент.ТекстФорматированногоЗаголовка(
			Элементы.ОбновлениеПрограммыОшибкаНадпись.Заголовок)
		+ Символы.ПС
		+ ПодробноеОписаниеОшибкиДляТехПоддержки);
	
КонецПроцедуры

#КонецОбласти

#Область Сервисы1С

&НаКлиенте
Процедура ДекорацияКакПродлитьСервис1СИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСервисы1СПояснениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКакПодключитьСервис1СИнструкцияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаЖурналРегистрацииСервисы1СНажатие(Элемент)
	
	ОткрытьЖурналРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНастройкиПроксиСервисы1СНажатие(Элемент)
	
	ОткрытьФормуПараметровПроксиСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаписатьВТехподдержкуСервисы1СНажатие(Элемент)
	
	ОтправитьСообщениеВТехПоддержку(
		НСтр("ru = 'Не удалось получить данные о сервисах 1С.'")
		+ Символы.ПС
		+ ИнтернетПоддержкаПользователейКлиент.ТекстФорматированногоЗаголовка(
			Элементы.Сервисы1СОшибкаНадпись.Заголовок)
		+ Символы.ПС
		+ ПодробноеОписаниеОшибкиДляТехПоддержки);
	
КонецПроцедуры

#КонецОбласти

#Область Подвал

&НаКлиенте
Процедура ПоказыватьПриНачалеРаботыПриИзменении(Элемент)
	
	НастройкаПоказПриСтартеПриИзмененииНаСервере(ПоказыватьПриНачалеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеДекорации

&НаКлиенте
Процедура ДекорацияСсылкаЖурналРегистрацииНажатие(Элемент)
	
	ОткрытьЖурналРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНастройкиПроксиНажатие(Элемент)
	
	ОткрытьФормуПараметровПроксиСервера();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСсылкаНаписатьВТехподдержкуНажатие(Элемент)
	
	ОтправитьСообщениеВТехПоддержку(
		НСтр("ru = 'Не удалось получить данные Монитора Портала 1С:ИТС.'")
		+ Символы.ПС
		+ ИнтернетПоддержкаПользователейКлиент.ТекстФорматированногоЗаголовка(
			Элементы.ДекорацияКраткоеОписаниеОшибки.Заголовок)
		+ Символы.ПС
		+ ПодробноеОписаниеОшибкиДляТехПоддержки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоддержкаПродуктаНеОказываетсяОписаниеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтправитьСообщениеВТехПоддержку(
		НСтр("ru = 'Интернет-поддержка программного продукта не оказывается.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПоясненияПодключенияАвторизацияОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура Подключаемый_ДекорацияНажатие(Элемент)
	
	ИнтеграцияПодсистемБИПКлиент.ПриНажатииДекорацииВФормеМонитора(
		ЭтотОбъект,
		Элемент);
	МониторПортала1СИТСКлиентПереопределяемый.ПриНажатииДекорацииВФормеМонитора(
		ЭтотОбъект,
		Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьНавигационнуюСсылку(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ИнтеграцияПодсистемБИПКлиент.ОбработатьНавигационнуюСсылкуВФормеМонитора(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	МониторПортала1СИТСКлиентПереопределяемый.ОбработатьНавигационнуюСсылкуВФормеМонитора(
		ЭтотОбъект,
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьКоманду(Команда)
	
	ИнтеграцияПодсистемБИПКлиент.ОбработатьКомандуВФормеМонитора(
		ЭтотОбъект,
		Команда);
	МониторПортала1СИТСКлиентПереопределяемый.ОбработатьКомандуВФормеМонитора(
		ЭтотОбъект,
		Команда);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПовторитьПопыткуПодключения(Команда)
	
	// Проверка заполнения данных авторизации
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка
		И Элементы.ГруппаПодключениеКПорталу.Видимость
		И Не ЗаполнениеЛогинаИПароляКорректно() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НачатьОбновлениеСодержимогоМонитора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСодержимое(Команда)
	
	НачатьОбновлениеСодержимогоМонитора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПортал(Команда)
	
	ИнтернетПоддержкаПользователейКлиент.ОткрытьГлавнуюСтраницуПортала();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеВТехподдержку(Команда)
	
	ТекстСообщения = НСтр("ru = 'При использовании Монитора Портала 1С:ИТС возникли следующие проблемы:
		|<Опишите проблемы>'");
	
	ОтправитьСообщениеВТехПоддержку(ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбновление(Команда)
	
	МодульПолучениеОбновленийПрограммыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПолучениеОбновленийПрограммыКлиент");
	МодульПолучениеОбновленийПрограммыКлиент.ОбновитьПрограмму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

&НаСервереБезКонтекста
Процедура НастройкаПоказПриСтартеПриИзмененииНаСервере(Знач НастройкаПоказПриСтарте)
	
	МониторПортала1СИТС.СохранитьНастройкиПоказПриСтарте(НастройкаПоказПриСтарте);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеВТехПоддержку(ТекстСообщения)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки") Тогда
		
		МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер =
			ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
		ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
		ДанныеСообщения.Получатель = "webIts";
		ДанныеСообщения.Сообщение = ТекстСообщения;
		
		МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ЗаполнитьНастройкиПоискаГотовогоОтвета(
			ТекстСообщения,
			ДанныеСообщения.НастройкиПоискаГотовогоОтвета);
		
		МодульСообщенияВСлужбуТехническойПоддержкиКлиент =
			ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
		МодульСообщенияВСлужбуТехническойПоддержкиКлиент.ОтправитьСообщение(
			ДанныеСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНавигационнуюСсылку(Элемент, Ссылка, СтандартнаяОбработка)
	
	СсылкаНРег = НРег(СокрЛП(Ссылка));
	Если СтрНачинаетсяС(СсылкаНРег, "action:openportal") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИнтернетПоддержкаПользователейКлиент.ОткрытьГлавнуюСтраницуПортала();
		
	ИначеЕсли СтрНачинаетсяС(СсылкаНРег, "action:profile") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИнтернетПоддержкаПользователейКлиент.ОткрытьЛичныйКабинетПользователя();
		
	ИначеЕсли СтрНачинаетсяС(СсылкаНРег, "http://") Или СтрНачинаетсяС(СсылкаНРег, "https://") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(Ссылка);
		
	ИначеЕсли СтрНачинаетсяС(СсылкаНРег, "mailto:") Тогда
		
		СтандартнаяОбработка = Ложь;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Ссылка);
		
	Иначе
		
		ИнтеграцияПодсистемБИПКлиент.ОбработатьНавигационнуюСсылкуВФормеМонитора(
			ЭтотОбъект,
			Элемент,
			Ссылка,
			СтандартнаяОбработка);
		МониторПортала1СИТСКлиентПереопределяемый.ОбработатьНавигационнуюСсылкуВФормеМонитора(
			ЭтотОбъект,
			Элемент,
			Ссылка,
			СтандартнаяОбработка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаркированныйСписокСПериодами(ДанныеСписка, СписокСервисов1С, ЗаголовокСписка = "")
	
	Если ДанныеСписка = Неопределено
		Или ДанныеСписка.serviceContracts = Неопределено
		Или ДанныеСписка.serviceContracts.Количество() = 0 Тогда
		
		Возврат НСтр("ru = '<Нет данных>'");
		
	КонецЕсли;
	
	СписокДоговоров = ДанныеСписка.serviceContracts;
	
	//@skip-check use-non-recommended-method
	ТекДата       = ТекущаяДата(); // АПК:143 используется для расчета смещения.
	ТекДатаСеанса = ТекущаяДатаСеанса();
	Смещение = (ТекДатаСеанса - ТекДата);
	
	ЧастиСтроки = Новый Массив();	// Массив из Строка
	Если Не ПустаяСтрока(ЗаголовокСписка) Тогда
		ЧастиСтроки.Добавить(ЗаголовокСписка);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокДоговоров Цикл
		
		СтрокаЧасти = "● " + ЭлементСписка.name;
		
		// Приведение времени сервера ко времени сеанса.
		ФорматДаты = "ДЛФ=D";
		ТекущийПериод = ЭлементСписка.period;
		ДатаОт = (ТекущийПериод.from + Смещение);
		ДатаПо = (ТекущийПериод.to + Смещение);
		СтрокаЧасти = СтрокаЧасти
			+ " "
			+ ?(СписокСервисов1С И (ДатаОт < ТекДатаСеанса),
				"",
				НСтр("ru = 'с'") + " " + Формат(ДатаОт, ФорматДаты) + " ")
			+ ?(СписокСервисов1С, НСтр("ru = 'до'"), НСтр("ru = 'по'"))
			+ " "
			+ ?(ТекущийПериод.warning,
				"<span style=""color:ПредупреждениеМониторПорталаЦвет"">" + Формат(ДатаПо, ФорматДаты) + "</span>",
				Формат(ДатаПо, ФорматДаты));
		
		ЧастиСтроки.Добавить(СтрокаЧасти);
		
	КонецЦикла;
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		СтрСоединить(ЧастиСтроки, Символы.ПС));
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЗаголовокИзМакета(ЭлементДекорация, ИмяМакета)
	
	Если ТипЗнч(ЭлементДекорация.Заголовок) <> Тип("ФорматированнаяСтрока") Тогда
		ЭлементДекорация.Заголовок = ТекстИнструкцииИзМакета(ИмяМакета, Домен);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьКонтекстФормы()
	
	ПодробноеОписаниеОшибкиДляТехПоддержки = "";
	
	// УсловияСопровождения
	Элементы.ДекорацияДоговорИТССписок.Заголовок           = "";
	Элементы.ДекорацияСервисыСопровожденияСписок.Заголовок = "";
	
	// ИнформацияОбОбновлении
	Элементы.ДекорацияИнформацияОбОбновлении.Заголовок = "";
	
	// Сервисы1С
	Элементы.ДекорацияСервисы1ССписок.Заголовок = "";
	
	// ПредупрежденияСервисов
	Элементы.ДекорацияПредупрежденияСервисов1ССписок.Заголовок = "";
	
	ОчиститьТекстыИнструкций();
	
	ДанныеМонитора = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТекстыИнструкций()
	
	// УсловияСопровождения
	Элементы.ДекорацияКакЗаключитьДоговорИТСИнструкция.Заголовок                             = "";
	Элементы.ДекорацияКакАктивироватьСервисСопровожденияИнструкция.Заголовок                 = "";
	Элементы.ДекорацияКакОформитьДоговорИТСУсловияВыполненыИнструкция.Заголовок              = "";
	Элементы.ДекорацияКакАктивироватьСервисСопровожденияУсловияВыполненыИнструкция.Заголовок = "";
	
	// Сервисы1С
	Элементы.ДекорацияКакПодключитьСервис1СИнструкция.Заголовок = "";
	Элементы.ДекорацияКакПродлитьСервис1СИнструкция.Заголовок   = "";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстИнструкцииИзМакета(ИмяМакета, Домен)
	
	Макет = Обработки.МониторПортала1СИТС.ПолучитьМакет(ИмяМакета + ?(Домен = 0, "_RU", "_EU"));
	ФДок = Новый ФорматированныйДокумент;
	ФДок.УстановитьHTML(Макет.ПолучитьТекст(), Новый Структура);
	Возврат ФДок.ПолучитьФорматированнуюСтроку();
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора)
	
	КодУспехаСтрока = "200";
	КодУспехаЧисло = 200;
	
	Если ДанныеМонитора.supportConditionsImplStatus <> Неопределено
		И ДанныеМонитора.supportConditionsImplStatus.blockStatus <> КодУспехаСтрока
		И ДанныеМонитора.supportConditionsImplStatus.blockStatus <> КодУспехаЧисло
		Или ДанныеМонитора.serviceContractsStatus <> Неопределено
		И ДанныеМонитора.serviceContractsStatus.blockStatus <> КодУспехаСтрока
		И ДанныеМонитора.serviceContractsStatus.blockStatus <> КодУспехаЧисло
		Или ДанныеМонитора.updateInfo <> Неопределено
		И ДанныеМонитора.updateInfo.blockStatus <> КодУспехаСтрока
		И ДанныеМонитора.updateInfo.blockStatus <> КодУспехаЧисло
		Или ДанныеМонитора.patchesInfo <> Неопределено
		И ДанныеМонитора.patchesInfo.blockStatus <> КодУспехаСтрока
		И ДанныеМонитора.patchesInfo.blockStatus <> КодУспехаЧисло Тогда
		
		// При ошибке получения данных не сохранять отпечаток.
		Возврат;
		
	КонецЕсли;
	
	МониторПортала1СИТС.СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнениеЛогинаИПароляКорректно()
	
	Результат = ИнтернетПоддержкаПользователейКлиентСервер.ПроверитьДанныеАутентификации(
		Новый Структура("Логин, Пароль", Логин, ПарольИПП));
	
	Если Результат.Отказ Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			Результат.СообщениеОбОшибке,
			,
			?(Результат.Поле = "Пароль", "ПарольИПП", "ЛогинИПП"));
	КонецЕсли;
	
	Возврат Не Результат.Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПриВыбореКарточкиРаздела(ИмяРаздела)
	
	Элементы.КарточкаУсловияСопровождения.ЦветФона = НеАктивныйРазделЦвет;
	Элементы.КарточкаОбновлениеПрограммы.ЦветФона  = НеАктивныйРазделЦвет;
	Элементы.КарточкаСервисы1С.ЦветФона            = НеАктивныйРазделЦвет;
	Элементы.КарточкаПредупреждения.ЦветФона       = НеАктивныйРазделЦвет;
	
	// Сброс отображения элементов в которых отображается список
	Элементы.ДекорацияДоговорИТССписок.Видимость = Ложь;
	Элементы.ДекорацияИнформацияОбОбновлении.Видимость = Ложь;
	Элементы.ДекорацияСервисы1ССписок.Видимость = Ложь;
	Элементы.ДекорацияПредупрежденияСервисов1ССписок.Видимость = Ложь;
	
	ТекущийРаздел   = ИмяРаздела;
	ЗагрузитьРаздел = (ЗагруженныеРазделы.Найти(ИмяРаздела) = Неопределено);
	
	Если ИмяРаздела = ОперацияУсловияСопровождения() Тогда
		
		Элементы.КарточкаУсловияСопровождения.ЦветФона = АктивныйРазделЦвет;
		Элементы.ДекорацияДоговорИТССписок.Видимость = Истина;
		СтраницаРаздела = Элементы.РазделУсловияСопровождения;
		
		Если ЗагрузитьРаздел
			И ТипЗнч(ДанныеМонитора) = Тип("Структура")
			И ДанныеМонитора.Свойство("supportConditionsImplStatus")
			И ДанныеМонитора.supportConditionsImplStatus <> Неопределено Тогда
			
			НачатьПолучениеДеталиУсловияСопровожденияНаСервере();
			ПриНачалеЗадания(ИмяРаздела);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = ОперацияОбновлениеПрограммы() Тогда
		
		Элементы.КарточкаОбновлениеПрограммы.ЦветФона = АктивныйРазделЦвет;
		Элементы.ДекорацияИнформацияОбОбновлении.Видимость = Истина;
		СтраницаРаздела = Элементы.РазделОбновлениеПрограммы;
		
		Если ЗагрузитьРаздел
			И (ДанныеМонитора.ДоступноОбновление
			Или ДанныеМонитора.ИнформироватьОВыходеВерсийДлительнойПоддержки
			Или (ДанныеМонитора.patchesInfo <> Неопределено
				И ДанныеМонитора.patchesInfo.patchesAvailable)) Тогда
			
			НачатьПолучениеДеталиИнформацияОбОбновленииНаСервере();
			ПриНачалеЗадания(ИмяРаздела);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = ОперацияСервисы1С() Тогда
		
		Элементы.КарточкаСервисы1С.ЦветФона = АктивныйРазделЦвет;
		Элементы.ДекорацияСервисы1ССписок.Видимость = Истина;
		СтраницаРаздела = Элементы.РазделСервисы1С;
		
		Если ЗагрузитьРаздел
			И ДанныеМонитора.serviceContractsStatus <> Неопределено Тогда
			
			НачатьПолучениеДеталиСервисы1СНаСервере();
			ПриНачалеЗадания(ИмяРаздела);
			
		КонецЕсли;
		
	ИначеЕсли ИмяРаздела = ОперацияПредупрежденийСервисов() Тогда
		
		Элементы.КарточкаПредупреждения.ЦветФона = АктивныйРазделЦвет;
		Элементы.ДекорацияПредупрежденияСервисов1ССписок.Видимость = Истина;
		СтраницаРаздела = Элементы.РазделПредупреждения;
		
		Если ЗагрузитьРаздел Тогда
			
			Если ДанныеМонитора.ПредупрежденияСервисов.ЕстьПредупреждения Тогда
				Элементы.ДекорацияПредупрежденияСервисов1ССписок.Видимость = Истина;
				Элементы.ДекорацияПредупрежденияСервисов1ССписок.Заголовок = МаркированныйСписокПредупреждений(
					ДанныеМонитора.ПредупрежденияСервисов.ДанныеПредупреждений);
				Элементы.ГруппаПредупрежденияОтсутствуют.Видимость         = Ложь;
			Иначе
				Элементы.ДекорацияПредупрежденияСервисов1ССписок.Видимость = Ложь;
				Элементы.ГруппаПредупрежденияОтсутствуют.Видимость         = Истина;
			КонецЕсли;
			
			ЗагруженныеРазделы.Добавить(ИмяРаздела);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.СтраницыРазделов.ТекущаяСтраница = СтраницаРаздела;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьОжидание()
	
	ИнтеграцияПодсистемБИПКлиент.ПриВыполненииОбработчикаОжиданияВФормеМонитора(
		ЭтотОбъект);
	МониторПортала1СИТСКлиентПереопределяемый.ПриВыполненииОбработчикаОжиданияВФормеМонитора(
		ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПараметровПроксиСервера()
	
	ИнформационнаяБазаФайловая = ОбщегоНазначенияКлиент.ИнформационнаяБазаФайловая();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("НастройкаПроксиНаКлиенте", ИнформационнаяБазаФайловая);
	
	ПолучениеФайловИзИнтернетаКлиент.ОткрытьФормуПараметровПроксиСервера(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации()
	
	ПараметрыФормы = Новый Структура("Пользователь", ИмяПользователя());
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ДлительныеОперации

&НаСервере
Процедура ИнициализироватьОписаниеЗаданий()
	
	ИдентификаторЭтойФормы = УникальныйИдентификатор;
	
	НоваяСтрока = Задания.Добавить();
	НоваяСтрока.Имя             = ОперацияСодержимоеМонитора(); // Содержимое монитора.
	НоваяСтрока.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторЭтойФормы);
	
	НоваяСтрока = Задания.Добавить();
	НоваяСтрока.Имя             = ОперацияУсловияСопровождения(); // Содержимое блока выполненных условий.
	НоваяСтрока.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторЭтойФормы);
	
	НоваяСтрока = Задания.Добавить();
	НоваяСтрока.Имя             = ОперацияСервисы1С(); // Сервисы 1С.
	НоваяСтрока.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторЭтойФормы);
	
	НоваяСтрока = Задания.Добавить();
	НоваяСтрока.Имя             = ОперацияОбновлениеПрограммы(); // Обновление программы.
	НоваяСтрока.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ИдентификаторЭтойФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНачалеЗадания(ИмяЗадания)
	
	Если ЕстьАктивныеЗадания(Задания, ИмяЗадания) Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ОписательЗадания(Задания, ИмяЗадания).ДлительнаяОперация,
			Новый ОписаниеОповещения("ПриЗавершенииЗадания", ЭтотОбъект, ИмяЗадания),
			ПараметрыОжидания);
			
	ИначеЕсли ИмяЗадания = ОперацияСодержимоеМонитора() Тогда
		ЗагруженныеРазделы = Новый Массив();	// Массив из Строка
		Если Не ПустаяСтрока(ТекущийРаздел)
			И ДанныеМонитора <> Неопределено Тогда
			
			ПриВыбореКарточкиРаздела(ТекущийРаздел);
			
		КонецЕсли;
	Иначе
		ЗагруженныеРазделы.Добавить(ИмяЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписательЗадания(ТаблицаЗаданий, Имя)
	
	Для Каждого СтрокаЗадания Из ТаблицаЗаданий Цикл
		Если СтрокаЗадания.Имя = Имя Тогда
			Возврат СтрокаЗадания;
		КонецЕсли;
	КонецЦикла;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Неизвестное имя задания (%1).'"),
		Имя);
	
КонецФункции

&НаСервере
Процедура ОтменитьВыполнениеВсехЗаданий()
	
	ПустойИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Для Каждого СтрокаЗадания Из Задания Цикл
		Если ЗначениеЗаполнено(СтрокаЗадания.Идентификатор) Тогда
			ДлительныеОперации.ОтменитьВыполнениеЗадания(СтрокаЗадания.Идентификатор);
			СтрокаЗадания.Идентификатор = ПустойИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьАктивныеЗадания(ТаблицаЗаданий, ИмяЗадания = Неопределено)
	
	Для Каждого СтрокаЗадания Из ТаблицаЗаданий Цикл
		Если ЗначениеЗаполнено(СтрокаЗадания.Идентификатор)
			И (ИмяЗадания = Неопределено
			Или СтрокаЗадания.Имя = ИмяЗадания) Тогда
			
			Возврат Истина;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииЗадания(Результат, ИмяЗадания) Экспорт
	
	Если Результат = Неопределено
		Или Не Открыта() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	// Очистить параметры в описателе задания.
	ОписательЗадания = ОписательЗадания(Задания, ИмяЗадания);
	ОписательЗадания.ДлительнаяОперация = Неопределено;
	ОписательЗадания.Идентификатор      = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
	Если ИмяЗадания = ОперацияСодержимоеМонитора() Тогда
		Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
			
			ПриПолученииСодержимогоМонитора();
			
			ЗагруженныеРазделы = Новый Массив();	// Массив из Строка
			Если Не ПустаяСтрока(ТекущийРаздел) Тогда
				ПриВыбореКарточкиРаздела(ТекущийРаздел);
			КонецЕсли;
			
		Иначе
			ОтобразитьСостояниеОшибка(
				Результат.КраткоеПредставлениеОшибки,
				Результат.ПодробноеПредставлениеОшибки,
				Ложь);
		КонецЕсли;
	ИначеЕсли ИмяЗадания = ОперацияУсловияСопровождения() Тогда
		Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
			ПриПолученииДеталиУсловияСопровождения();
		Иначе
			ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(Результат.КраткоеПредставлениеОшибки);
		КонецЕсли;
		ЗагруженныеРазделы.Добавить(ИмяЗадания);
	ИначеЕсли ИмяЗадания = ОперацияСервисы1С() Тогда
		Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
			ПриПолученииДеталиСервисы1С();
		Иначе
			ОтобразитьОшибкаПолученияДеталиСервисы1С(Результат.КраткоеПредставлениеОшибки);
		КонецЕсли;
		ЗагруженныеРазделы.Добавить(ИмяЗадания);
	ИначеЕсли ИмяЗадания = ОперацияОбновлениеПрограммы() Тогда
		Если ПустаяСтрока(Результат.КраткоеПредставлениеОшибки) Тогда
			ПриПолученииДеталиИнформацияОбОбновлении();
		Иначе
			ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(Результат.КраткоеПредставлениеОшибки);
		КонецЕсли;
		ЗагруженныеРазделы.Добавить(ИмяЗадания);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеИнтернетПоддержки

&НаКлиентеНаСервереБезКонтекста
Функция ТребуетсяПодключениеИнтернетПоддержки(Элементы)
	
	Возврат (Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка
		И Элементы.ГруппаПодключениеКПорталу.Видимость);
	
КонецФункции

&НаКлиенте
Функция ПодключитьИнтернетПоддержку(Капча = Неопределено)
	
	РезультатПодключения = ПодключитьИнтернетПоддержкуНаСервере(
		Логин,
		ПарольИПП,
		Капча);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработкаРезультатаПодключения",
		ЭтотОбъект);
	ИнтернетПоддержкаПользователейКлиент.ОбработатьРезультатПодключения(
		РезультатПодключения,
		ОписаниеОповещения,
		ЭтотОбъект);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодключитьИнтернетПоддержкуНаСервере(
		Знач Логин,
		Знач Пароль,
		Знач Капча = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ИнтернетПоддержкаПользователей.Подключить(
		Новый Структура(
			"Логин, Пароль",
			Логин,
			Пароль),
		Капча);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаРезультатаПодключения(
		РезультатПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если РезультатПодключения.Подключена Тогда
		ПарольИПП = "";
		НачатьОбновлениеСодержимогоМонитораНаСервере();
		ПриНачалеЗадания(ОперацияСодержимоеМонитора());
	ИначеЕсли РезультатПодключения.ТребуетсяВводКапчи Тогда
		ПодключитьИнтернетПоддержку(РезультатПодключения.Капча);
	ИначеЕсли РезультатПодключения.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Проверьте правильность ввода логина и пароля.'"),
			,
			"Логин");
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			РезультатПодключения.СообщениеОбОшибке,
			,
			"Логин");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Главное

&НаСервере
Процедура ОтобразитьСодержимоеМонитора(РезультатОперацииСервиса)
	
	// Видимость была отключена в см. НачатьОбновлениеСодержимогоМонитораНаСервере
	Элементы.СтраницаСодержимое.Видимость = Истина;
	
	ДанныеМонитора = РезультатОперацииСервиса.Данные;
	Логин          = РезультатОперацииСервиса.Логин;
	
	Если Домен <> РезультатОперацииСервиса.Домен Тогда
		Домен = РезультатОперацииСервиса.Домен;
		// При смене домена тексты инструкций должны быть очищены и заполнены заново, т.к. зависят от домена.
		ОчиститьТекстыИнструкций();
	КонецЕсли;
	
	СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
	
	АвтоАктивацияРаздела = Новый Структура();
	АвтоАктивацияРаздела.Вставить("Раздел"  , "");
	АвтоАктивацияРаздела.Вставить("Важность", 0);
	
	ОтобразитьБлокШапка();
	ОтобразитьБлокУсловияСопровождения(АвтоАктивацияРаздела);
	ОтобразитьБлокОбновлениеПрограммы(АвтоАктивацияРаздела);
	ОтобразитьБлокДоговорыНаСервисы(АвтоАктивацияРаздела);
	ОтобразитьБлокПредупрежденияСервисов(АвтоАктивацияРаздела);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСодержимое;
	
	Если ПустаяСтрока(ТекущийРаздел)
		И Не ПустаяСтрока(АвтоАктивацияРаздела.Раздел) Тогда
		
		ТекущийРаздел = АвтоАктивацияРаздела.Раздел;
		
	КонецЕсли;
	
	ИнтеграцияПодсистемБИП.ОтобразитьДополнительныеДанныеМонитора(
		ЭтотОбъект,
		РезультатОперацииСервиса.ДополнительныеДанные);
	МониторПортала1СИТСПереопределяемый.ОтобразитьДополнительныеДанныеМонитора(
		ЭтотОбъект,
		РезультатОперацииСервиса.ДополнительныеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеОшибка(
		Знач КраткоеОписаниеОшибки,
		Знач ПодробноеОписаниеОшибки,
		Знач ОшибкаСоединения = Истина,
		Знач ПоказатьПоляАутентификации = Ложь)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибка;
	Если ОшибкаСоединения Тогда
		Элементы.ДекорацияОшибкаЗаголовок.Заголовок       = НСтр("ru = 'Не удалось подключиться к сервису'");
		Элементы.ДекорацияКраткоеОписаниеОшибки.Заголовок = КраткоеОписаниеОшибки;
	Иначе
		Элементы.ДекорацияОшибкаЗаголовок.Заголовок       = НСтр("ru = 'Ошибка'");
		Элементы.ДекорацияКраткоеОписаниеОшибки.Заголовок =
			НСтр("ru = 'Возникла ошибка при получении информации из сервиса Монитора Портала 1С:ИТС:'")
			+ Символы.ПС
			+ КраткоеОписаниеОшибки;
	КонецЕсли;
	
	Элементы.ДекорацияСсылкаЖурналРегистрации.Видимость =
		ПравоДоступа("Просмотр", Метаданные.Обработки.ЖурналРегистрации);
	
	Элементы.ДекорацияСсылкаНастройкиПрокси.Видимость =
		ОшибкаСоединения
		И (ОбщегоНазначения.ИнформационнаяБазаФайловая()
		Или ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ПараметрыПроксиСервера));
	
	ПодробноеОписаниеОшибкиДляТехПоддержки = ПодробноеОписаниеОшибки;
	
	Элементы.ДекорацияРекомендацияСетеваяОшибка.Видимость = ОшибкаСоединения;
	Элементы.ГруппаПодключениеКПорталу.Видимость          = ПоказатьПоляАутентификации;
	Элементы.ПовторитьПопыткуПодключения.Важность         = ВажностьКнопки.Главная;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОбновлениеСодержимогоМонитора()
	
	ОчиститьКонтекстФормы();
	ОтключитьОбработчикОжидания("Подключаемый_ОбработатьОжидание");
	ИнтеграцияПодсистемБИПКлиент.ПередПолучениемДанныхМонитора(
		ЭтотОбъект);
	МониторПортала1СИТСКлиентПереопределяемый.ПередПолучениемДанныхМонитора(
		ЭтотОбъект);
	Если ТребуетсяПодключениеИнтернетПоддержки(Элементы) Тогда
		ПодключитьИнтернетПоддержку();
	Иначе
		НачатьОбновлениеСодержимогоМонитораНаСервере();
		ПриНачалеЗадания(
			ОперацияСодержимоеМонитора());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьОбновлениеСодержимогоМонитораНаСервере(
		Знач ОжидатьЗавершения = Истина,
		Знач ТолькоФоновыйРежим = Истина)
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Подготовка к получению данных Монитора'"));
	
	ОтменитьВыполнениеВсехЗаданий();
	
	// Исключить отображение полосы прокрутки в форме.
	Элементы.СтраницаСодержимое.Видимость = Ложь;
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияСодержимоеМонитора());
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Если Не ОжидатьЗавершения Тогда
		ПараметрыВыполненияВФоне.ОжидатьЗавершение = 0;
	КонецЕсли;
	
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ПолучениеИнформацииМонитора"
		+ Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.АдресРезультата     = Описатель.АдресРезультата;
	ПараметрыВыполненияВФоне.ЗапуститьВФоне      = ТолькоФоновыйРежим;
	
	ПараметрыПолученияДополнительныхДанных = Неопределено;
	ИнтеграцияПодсистемБИП.ПередПолучениемДанныхМонитора(
		ЭтотОбъект,
		ПараметрыПолученияДополнительныхДанных);
	МониторПортала1СИТСПереопределяемый.ПередПолучениемДанныхМонитора(
		ЭтотОбъект,
		ПараметрыПолученияДополнительныхДанных);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ПараметрыПолученияДополнительныхДанных", ПараметрыПолученияДополнительныхДанных);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторПортала1СИТС.ПолучитьДанныеМонитора",
		ПараметрыЗадания,
		ПараметрыВыполненияВФоне);
	Описатель.ДлительнаяОперация = РезультатВыполнения;
	
	Если РезультатВыполнения.Статус = "Выполняется" Тогда
		
		Описатель.Идентификатор = РезультатВыполнения.ИдентификаторЗадания;
		ОтобразитьСостояниеДлительнаяОперация();
		
	ИначеЕсли РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПриПолученииСодержимогоМонитора();
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Не удалось отобразить данные Монитора. Задание получение данных Монитора отменено администратором.'"));
		ОтобразитьСостояниеОшибка(
			НСтр("ru = 'Задание отменено администратором.'"),
			"",
			Ложь);
		
	Иначе
		
		// Ошибка
		СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить данные Монитора.
				|%1'"),
			РезультатВыполнения.ПодробноеПредставлениеОшибки);
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
		ОтобразитьСостояниеОшибка(
			РезультатВыполнения.КраткоеПредставлениеОшибки,
			РезультатВыполнения.ПодробноеПредставлениеОшибки,
			Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеДлительнаяОперация()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеИПППродуктаНеОказывается()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПоддержкаПродуктаНеОказывается;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииСодержимогоМонитора()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияСодержимоеМонитора());
	
	РезультатОперацииСервиса = ПолучитьИзВременногоХранилища(Описатель.АдресРезультата);
	Если ПустаяСтрока(РезультатОперацииСервиса.ИмяОшибки) Тогда
		
		ДанныеМонитора = РезультатОперацииСервиса.Данные;
		Если Не ДанныеМонитора.authResult.authenticated Тогда
			
			СообщениеЖурнала = НСтр("ru = 'Не удалось отобразить содержимое Монитора.
				|Некорректные данные аутентификации пользователя Интернет-поддержки.'");
			МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
			ОтобразитьСостояниеОшибка(
				НСтр("ru = 'Некорректные данные аутентификации пользователя Интернет-поддержки.
					|Не подключена Интернет-поддержка пользователей.'"),
				СообщениеЖурнала,
				Ложь,
				Истина);
			
		ИначеЕсли ДанныеМонитора.programName = Неопределено Тогда
			
			ОтобразитьСостояниеИПППродуктаНеОказывается();
			
		Иначе
			
			Попытка
				ОтобразитьСодержимоеМонитора(РезультатОперацииСервиса);
			Исключение
				
				ИнформацияОшибка = ИнформацияОбОшибке();
				СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось отобразить содержимое Монитора.
						|%1'"),
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОшибка));
				МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
				ОтобразитьСостояниеОшибка(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не удалось отобразить содержимое Монитора.
							|%1'"),
						ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОшибка)),
					СообщениеЖурнала,
					Ложь);
				
				Возврат;
				
			КонецПопытки;
			
			ОписаниеОшибкиДанных = МониторПортала1СИТС.ОписаниеОшибкиПолученияДанныхМонитора(
				РезультатОперацииСервиса.Данные);
			Если Не ПустаяСтрока(ОписаниеОшибкиДанных) Тогда
				МониторПортала1СИТС.ЗаписатьПредупреждениеВЖурналРегистрации(
					НСтр("ru = 'Не удалось получить часть данных Монитора.'")
					+ Символы.ПС
					+ ОписаниеОшибкиДанных);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли РезультатОперацииСервиса.ИмяОшибки = "ОшибкаСоединения" Тогда
		
		ОтобразитьСостояниеОшибка(
			РезультатОперацииСервиса.СообщениеОбОшибке,
			РезультатОперацииСервиса.ИнформацияОбОшибке,
			Истина);
		
	ИначеЕсли РезультатОперацииСервиса.ИмяОшибки = "НеЗаполненыДанныеАутентификации"
		Или РезультатОперацииСервиса.ИмяОшибки = "НекорректныеДанныеАутентификации" Тогда
		
		СообщениеЖурнала = НСтр("ru = 'Не удалось отобразить содержимое Монитора.
			|Не подключена Интернет-поддержка пользователей.'");
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
		ОтобразитьСостояниеОшибка(
			НСтр("ru = 'Некорректные данные аутентификации пользователя Интернет-поддержки.
				|Не подключена Интернет-поддержка пользователей.'"),
			СообщениеЖурнала,
			Ложь,
			Истина);
		
	Иначе
		
		// Все остальные ошибки
		ОтобразитьСостояниеОшибка(
			РезультатОперацииСервиса.СообщениеОбОшибке,
			РезультатОперацииСервиса.ИнформацияОбОшибке,
			Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШапкаФормы

&НаСервере
Процедура ОтобразитьБлокШапка()
	
	Элементы.ДекорацияНазваниеПП.Заголовок = ДанныеМонитора.programName;
	
КонецПроцедуры

#КонецОбласти

#Область УсловияСопровождения

&НаСервере
Процедура ОтобразитьБлокУсловияСопровождения(АвтоАктивацияРаздела = Неопределено)
	
	// Обновление карточки раздела
	ВыполнениеУсловий = ДанныеМонитора.supportConditionsImplStatus;
	Если ВыполнениеУсловий.blockStatus <> "200"
		И ВыполнениеУсловий.blockStatus <> 200 Тогда
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеОшибка(
			Элементы.УсловияСопровожденияКартинка);
		Элементы.УсловияСопровожденияНадпись.Заголовок = НСтр("ru = 'Ошибка обновления информации'");
		Элементы.УсловияСопровожденияНадпись.Подсказка = НСтр(
			"ru = 'Не удалось получить информацию о выполнении условий сопровождения программного продукта.
			|Повторите попытку позднее.'");
		Элементы.КарточкаРазделаУсловияСопровождения.Заголовок = НСтр("ru = 'Условия сопровождения'");
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 0 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияУсловияСопровождения();
			АвтоАктивацияРаздела.Важность = 1;
			
		КонецЕсли;
		
	ИначеЕсли ВыполнениеУсловий.status = "NOT_COMPLIED" Тогда
		
		ЗаголовокУсловия = НСтр("ru = 'Условия сопровождения не выполнены'");
		
		Элементы.УсловияСопровожденияКартинка.Картинка = БиблиотекаКартинок.ВажноеСообщениеПредупреждение;
		Элементы.УсловияСопровожденияКартинка.ЦветКартинки = ЦветаПалитры.Красный;
		Элементы.УсловияСопровожденияНадпись.Заголовок = ЗаголовокУсловия;
		Элементы.УсловияСопровожденияНадпись.Подсказка = "";
		Элементы.КарточкаРазделаУсловияСопровождения.Заголовок = ЗаголовокУсловия;
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 2 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияУсловияСопровождения();
			АвтоАктивацияРаздела.Важность = 3;
			
		КонецЕсли;
		
	Иначе
		
		ЗаголовокУсловия = НСтр("ru = 'Условия сопровождения выполнены'");
		
		Элементы.УсловияСопровожденияНадпись.Заголовок         = ЗаголовокУсловия;
		Элементы.УсловияСопровожденияНадпись.Подсказка         = "";
		Элементы.КарточкаРазделаУсловияСопровождения.Заголовок = ЗаголовокУсловия;
		
		Если Не ЗначениеЗаполнено(ВыполнениеУсловий.itsStatus)
			И Не ЗначениеЗаполнено(ВыполнениеУсловий.supportServiceActivationStatus) Тогда
			
			// Нет данных для просмотра.
			ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
				Элементы.УсловияСопровожденияКартинка);
			
		ИначеЕсли ВыполнениеУсловий.status = "WARNING" Тогда
			
			ИнтернетПоддержкаПользователей.УстановитьСостояниеПредупреждение(
				Элементы.УсловияСопровожденияКартинка);
			
			Если АвтоАктивацияРаздела <> Неопределено
				И АвтоАктивацияРаздела.Важность <= 1 Тогда
				
				АвтоАктивацияРаздела.Раздел   = ОперацияУсловияСопровождения();
				АвтоАктивацияРаздела.Важность = 2;
				
			КонецЕсли;
			
		Иначе
			ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
				Элементы.УсловияСопровожденияКартинка);
		КонецЕсли;
		
	КонецЕсли;
	
	// Обновление страницы раздела
	Элементы.ГруппаУсловияСопровожденияДлительнаяОперация.Видимость       = Ложь;
	Элементы.ГруппаУсловияСопровожденияОшибка.Видимость                   = Ложь;
	Элементы.ГруппаНеВыполненоРегистрационныйНомер.Видимость              = Ложь;
	Элементы.ГруппаНеВыполненоДоговорИТС.Видимость                        = Ложь;
	Элементы.ГруппаНеВыполненоСервисыСопровождения.Видимость              = Ложь;
	Элементы.ГруппаВыполненоДоговорИТС.Видимость                          = Ложь;
	Элементы.ГруппаВыполненоСервисыСопровождения.Видимость                = Ложь;
	Элементы.ГруппаПроверкаУсловияСопровожденияВыполненаУспешно.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеДеталиУсловияСопровожденияНаСервере()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияУсловияСопровождения());
	Если ЗначениеЗаполнено(Описатель.Идентификатор) Тогда
		// Ранее запущенное задание еще не завершено
		Возврат;
	КонецЕсли;
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Подготовка к получению деталей выполненных условий сопровождения.'"));
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ПолучениеИнформацииМонитораУсловияСопровождения"
		+ Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.АдресРезультата = Описатель.АдресРезультата;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Логин", Логин);
	ПараметрыЗадания.Вставить("Договоры1СИТС",
		ЗначениеЗаполнено(ДанныеМонитора.supportConditionsImplStatus.itsStatus));
	ПараметрыЗадания.Вставить("АктивацияСервисовСопровождения",
		ЗначениеЗаполнено(ДанныеМонитора.supportConditionsImplStatus.supportServiceActivationStatus));
	ПараметрыЗадания.Вставить("ДоговорыНаСервисы", Ложь);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторПортала1СИТС.ПолучитьДеталиДанныхМонитора",
		ПараметрыЗадания,
		ПараметрыВыполненияВФоне);
	Описатель.ДлительнаяОперация = РезультатВыполнения;
	
	Если РезультатВыполнения.Статус = "Выполняется" Тогда
		
		Описатель.Идентификатор = РезультатВыполнения.ИдентификаторЗадания;
		ОтобразитьСостояниеДлительнойОперацииУсловияСопровождения();
		
	ИначеЕсли РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПриПолученииДеталиУсловияСопровождения();
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Не удалось отобразить детали выполненных условий сопровождения. Задание получение данных отменено.'"));
		ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(
			НСтр("ru = 'Задание отменено.'"));
		
	Иначе
		
		// Ошибка.
		СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить детали выполненных условий.
				|%1'"),
			РезультатВыполнения.ПодробноеПредставлениеОшибки);
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
		ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(РезультатВыполнения.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДеталиУсловияСопровождения()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияУсловияСопровождения());
	
	РезультатОперацииСервиса = ПолучитьИзВременногоХранилища(Описатель.АдресРезультата);
	Если ПустаяСтрока(РезультатОперацииСервиса.ИмяОшибки) Тогда
		
		Данные = РезультатОперацииСервиса.Данные;
		
		СостояниеИзменилось = ТипЗнч(ДанныеМонитора.supportConditionsImplStatus) <> ТипЗнч(Данные.supportConditionsImplStatus)
			Или ДанныеМонитора.supportConditionsImplStatus.blockStatus <> Данные.supportConditionsImplStatus.blockStatus
			Или ДанныеМонитора.supportConditionsImplStatus.status <> Данные.supportConditionsImplStatus.status;
		
		Попытка
			ДанныеМонитора.supportConditionsImplStatus = Данные.supportConditionsImplStatus;
			ОтобразитьБлокУсловияСопровождения();
			ОтобразитьДеталиУсловияСопровождения(Данные);
		Исключение
			ИнформацияОшибка = ИнформацияОбОшибке();
			СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось отобразить детали выполненных условий сопровождения.
					|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОшибка));
			МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
			ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка отображения данных.
						|%1'"),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОшибка)));
		КонецПопытки;
		
		Если СостояниеИзменилось Тогда
			СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
		КонецЕсли;
		
	Иначе
		
		Данные = РезультатОперацииСервиса.Данные;
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			ДанныеМонитора.supportConditionsImplStatus = Данные.supportConditionsImplStatus;
		КонецЕсли;
		ОтобразитьБлокУсловияСопровождения();
		
		ОшибкаСоединения = (РезультатОперацииСервиса.ИмяОшибки = "ОшибкаСоединения");
		ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(
			РезультатОперацииСервиса.СообщениеОбОшибке,
			ОшибкаСоединения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДеталиУсловияСопровождения(Данные)
	
	ВыполнениеУсловий = Данные.supportConditionsImplStatus;
	
	ОтобразитьРегистрацияПрограммногоПродуктаУсловияСопровождения(ВыполнениеУсловий);
	ОтобразитьДоговорИТСУсловияСопровождения(Данные);
	ОтобразитьСервисыУсловияСопровождения(Данные);
	
	Если Не Элементы.ГруппаУсловияСопровожденияДлительнаяОперация.Видимость
		И Не Элементы.ГруппаУсловияСопровожденияОшибка.Видимость
		И Не Элементы.ГруппаНеВыполненоРегистрационныйНомер.Видимость
		И Не Элементы.ГруппаНеВыполненоДоговорИТС.Видимость
		И Не Элементы.ГруппаНеВыполненоСервисыСопровождения.Видимость
		И Не Элементы.ГруппаВыполненоДоговорИТС.Видимость
		И Не Элементы.ГруппаВыполненоСервисыСопровождения.Видимость Тогда
		
		// Нет данных для отображения
		Элементы.КарточкаРазделаУсловияСопровождения.Заголовок                = НСтр("ru = 'Условия сопровождения'");
		Элементы.ГруппаПроверкаУсловияСопровожденияВыполненаУспешно.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьРегистрацияПрограммногоПродуктаУсловияСопровождения(ВыполнениеУсловий)
	
	Если ВыполнениеУсловий.status <> "NOT_COMPLIED"
		Или ВыполнениеУсловий.productRegistrationStatus <> "NOT_REGISTERED" Тогда
		Элементы.ГруппаНеВыполненоРегистрационныйНомер.Видимость = Ложь;
	Иначе
		Элементы.ГруппаНеВыполненоРегистрационныйНомер.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДоговорИТСУсловияСопровождения(Данные)
	
	ВыполнениеУсловий = Данные.supportConditionsImplStatus;
	
	Если ВыполнениеУсловий.itsStatus = Неопределено Тогда
		Элементы.ГруппаНеВыполненоДоговорИТС.Видимость = Ложь;
		Элементы.ГруппаВыполненоДоговорИТС.Видимость   = Ложь;
	ИначеЕсли ВыполнениеУсловий.itsStatus = "NO_CONTRACT" Тогда
		Элементы.ГруппаНеВыполненоДоговорИТС.Видимость = Истина;
		ЗаполнитьЗаголовокИзМакета(
			Элементы.ДекорацияКакЗаключитьДоговорИТСИнструкция,
			"ИнструкцияОформитьДоговорИТС");
	Иначе
		
		Элементы.ГруппаВыполненоДоговорИТС.Видимость = Истина;
		
		НетДанныхДляОтображения =
			(Данные.itsContracts.serviceContracts = Неопределено
			Или Данные.itsContracts.serviceContracts.Количество() = 0);
		
		Если ВыполнениеУсловий.itsStatus = "WARNING" Тогда
			Если НетДанныхДляОтображения Тогда
				Элементы.ДекорацияЗаголовокДоговорИТСВУ.Заголовок =
					НСтр("ru = 'Договор 1С:ИТС заканчивается'");
			Иначе
				Элементы.ДекорацияЗаголовокДоговорИТСВУ.Заголовок =
					НСтр("ru = 'Договор 1С:ИТС заканчивается:'");
			КонецЕсли;
		Иначе
			Если НетДанныхДляОтображения Тогда
				Элементы.ДекорацияЗаголовокДоговорИТСВУ.Заголовок =
					НСтр("ru = 'Договор 1С:ИТС'");
			Иначе
				Элементы.ДекорацияЗаголовокДоговорИТСВУ.Заголовок =
					НСтр("ru = 'Договор 1С:ИТС:'");
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ДекорацияДоговорИТССписок.Заголовок =
			МаркированныйСписокСПериодами(
				Данные.itsContracts,
				Ложь);
		
		Если НетДанныхДляОтображения Тогда
			Элементы.ДекорацияКакОформитьДоговорИТСУсловияВыполненыИнструкция.Видимость = Ложь;
		Иначе
			Элементы.ДекорацияКакОформитьДоговорИТСУсловияВыполненыИнструкция.Видимость = Истина;
			ЗаполнитьЗаголовокИзМакета(
				Элементы.ДекорацияКакОформитьДоговорИТСУсловияВыполненыИнструкция,
				"ИнструкцияОформитьДоговорИТС");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСервисыУсловияСопровождения(Данные)
	
	ВыполнениеУсловий = Данные.supportConditionsImplStatus;
	
	Если ВыполнениеУсловий.supportServiceActivationStatus = Неопределено Тогда
		Элементы.ГруппаНеВыполненоСервисыСопровождения.Видимость = Ложь;
		Элементы.ГруппаВыполненоСервисыСопровождения.Видимость   = Ложь;
	ИначеЕсли ВыполнениеУсловий.supportServiceActivationStatus = "NO_ACTIVATIONS" Тогда
		Элементы.ГруппаНеВыполненоСервисыСопровождения.Видимость = Истина;
		ЗаполнитьЗаголовокИзМакета(
			Элементы.ДекорацияКакАктивироватьСервисСопровожденияИнструкция,
			"ИнструкцияАктивироватьСервисСопровождения");
	Иначе
		
		Элементы.ГруппаВыполненоСервисыСопровождения.Видимость = Истина;
		
		НетДанныхДляОтображения =
			(Данные.supportServiceActivations.serviceContracts = Неопределено
			Или Данные.supportServiceActivations.serviceContracts.Количество() = 0);
		
		Если ВыполнениеУсловий.supportServiceActivationStatus = "WARNING" Тогда
			Если НетДанныхДляОтображения Тогда
				Элементы.ДекорацияЗаголовокСервисыСопровожденияВУ.Заголовок =
					НСтр("ru = 'Срок сервиса сопровождения конфигурации заканчивается'");
			Иначе
				Элементы.ДекорацияЗаголовокСервисыСопровожденияВУ.Заголовок =
					НСтр("ru = 'Срок сервиса сопровождения конфигурации заканчивается:'");
			КонецЕсли;
		Иначе
			Если НетДанныхДляОтображения Тогда
				Элементы.ДекорацияЗаголовокСервисыСопровожденияВУ.Заголовок =
					НСтр("ru = 'Сервис сопровождения конфигурации'");
			Иначе
				Элементы.ДекорацияЗаголовокСервисыСопровожденияВУ.Заголовок =
					НСтр("ru = 'Активирован сервис сопровождения конфигурации:'");
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ДекорацияСервисыСопровожденияСписок.Заголовок = МаркированныйСписокСПериодами(
			Данные.supportServiceActivations,
			Ложь);
		
		Если НетДанныхДляОтображения Тогда
			Элементы.ГруппаКакАктивироватьСервисСопровожденияУсловияВыполненыИнструкция.Видимость = Ложь;
		Иначе
			Элементы.ГруппаКакАктивироватьСервисСопровожденияУсловияВыполненыИнструкция.Видимость = Истина;
			ЗаполнитьЗаголовокИзМакета(
				Элементы.ДекорацияКакАктивироватьСервисСопровожденияУсловияВыполненыИнструкция,
				"ИнструкцияАктивироватьСервисСопровождения");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеДлительнойОперацииУсловияСопровождения()
	
	Элементы.ГруппаУсловияСопровожденияДлительнаяОперация.Видимость       = Истина;
	Элементы.ГруппаУсловияСопровожденияОшибка.Видимость                   = Ложь;
	Элементы.ГруппаНеВыполненоРегистрационныйНомер.Видимость              = Ложь;
	Элементы.ГруппаНеВыполненоДоговорИТС.Видимость                        = Ложь;
	Элементы.ГруппаНеВыполненоСервисыСопровождения.Видимость              = Ложь;
	Элементы.ГруппаВыполненоДоговорИТС.Видимость                          = Ложь;
	Элементы.ГруппаВыполненоСервисыСопровождения.Видимость                = Ложь;
	Элементы.ГруппаПроверкаУсловияСопровожденияВыполненаУспешно.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОшибкаПолученияДеталиУсловияСопровождения(Знач СообщениеОбОшибке, Знач ОшибкаСоединения = Ложь)
	
	Элементы.ГруппаУсловияСопровожденияДлительнаяОперация.Видимость   = Ложь;
	Элементы.ГруппаУсловияСопровожденияОшибка.Видимость               = Истина;
	Элементы.УсловияСопровожденияОшибкаНадпись.Заголовок              = СообщениеОбОшибке;
	Элементы.ПовторитьПопыткуПодключенияУсловияСопровождения.Важность = ВажностьКнопки.Главная;
	
	Элементы.ДекорацияСсылкаНастройкиПроксиУсловияСопровождения.Видимость =
		ОшибкаСоединения
		И (ОбщегоНазначения.ИнформационнаяБазаФайловая()
		Или ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ПараметрыПроксиСервера));
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеПрограммы

&НаСервере
Процедура ОтобразитьБлокОбновлениеПрограммы(АвтоАктивацияРаздела)
	
	// Управление видимостью раздела
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
		
		// Проверка доступности использовать подсистему
		МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
		ПараметрыПолученияОбновлений       = МодульПолучениеОбновленийПрограммы.СлужебнаяПараметрыПолученияОбновлений();
		Если Не МодульПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы(Ложь, Ложь)
			Или (Не ПараметрыПолученияОбновлений.ПолучатьОбновленияКонфигурации
			И Не ПараметрыПолученияОбновлений.ПолучатьИсправления
			И Не ПараметрыПолученияОбновлений.ПолучатьОбновленияПлатформы) Тогда
			
			Элементы.КарточкаОбновлениеПрограммы.Видимость = Ложь;
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		// Подсистема отсутствует в конфигурации
		Элементы.КарточкаОбновлениеПрограммы.Видимость = Ложь;
		Возврат;
		
	КонецЕсли;
	
	// Обновление карточки раздела
	Если ДанныеМонитора.updateInfo <> Неопределено
		И ДанныеМонитора.updateInfo.blockStatus <> "200"
		И ДанныеМонитора.updateInfo.blockStatus <> 200
		Или ДанныеМонитора.patchesInfo <> Неопределено
		И ДанныеМонитора.patchesInfo.blockStatus <> "200"
		И ДанныеМонитора.patchesInfo.blockStatus <> 200 Тогда
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеОшибка(
			Элементы.ОбновлениеПрограммыКартинка);
		Элементы.ОбновлениеПрограммыНадпись.Заголовок = НСтр("ru = 'Ошибка обновления информации'");
		Элементы.ОбновлениеПрограммыНадпись.Подсказка = НСтр(
			"ru = 'Не удалось получить информацию о доступном обновлении программы.
			|Повторите попытку позднее.'");
		
		ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(Элементы.ОбновлениеПрограммыНадпись.Подсказка);
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 0 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияОбновлениеПрограммы();
			АвтоАктивацияРаздела.Важность = 1;
			
		КонецЕсли;
		
	Иначе
		
		ЕстьНеобязательныеОбновления = Ложь;
		
		Элементы.ОбновлениеПрограммыНадпись.Подсказка = "";
		
		НастроитьОтображениеБлокаОбновлениеПрограммы(АвтоАктивацияРаздела);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеБлокаОбновлениеПрограммы(АвтоАктивацияРаздела = Неопределено)
	
	ДоступнаУстановкаИсправлений = ДанныеМонитора.patchesInfo <> Неопределено
		И (ДанныеМонитора.patchesInfo.blockStatus = "200"
		Или ДанныеМонитора.patchesInfo.blockStatus = 200)
		И ДанныеМонитора.patchesInfo.patchesAvailable;
	
	МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
	
	Если ДанныеМонитора.ДоступноОбновление Тогда
		
		Если ДанныеМонитора.updateInfo <> Неопределено
			И (ДанныеМонитора.updateInfo.blockStatus = "200"
			Или ДанныеМонитора.updateInfo.blockStatus = 200)
			И Не ДанныеМонитора.updateInfo.updateAvailable
			И МодульПолучениеОбновленийПрограммы.АвтоматическаяЗагрузкаИсправленийВключена() Тогда
			
			ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
				Элементы.ОбновлениеПрограммыКартинка);
			
		Иначе
			
			ИнтернетПоддержкаПользователей.УстановитьСостояниеПредупреждение(
				Элементы.ОбновлениеПрограммыКартинка);
			
			Если АвтоАктивацияРаздела <> Неопределено
				И АвтоАктивацияРаздела.Важность <= 1 Тогда
				
				АвтоАктивацияРаздела.Раздел   = ОперацияОбновлениеПрограммы();
				АвтоАктивацияРаздела.Важность = 2;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Элементы.ОбновлениеПрограммыНадпись.Заголовок = ЗаголовокДоступноОбновлениеПрограммы();
		Элементы.ОбновлениеПрограммыНадпись.Подсказка = "";
		
		Если МодульПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы(Истина, Ложь) Тогда
			Элементы.УстановитьОбновление.Видимость = ЭтоWindowsКлиент
				Или ДоступнаУстановкаИсправлений;
			Элементы.ДекорацияНадписьОбновлениеОбратитесьКАдминистратору.Видимость = Ложь;
		Иначе
			Элементы.УстановитьОбновление.Видимость                                = Ложь;
			Элементы.ДекорацияНадписьОбновлениеОбратитесьКАдминистратору.Видимость = Истина;
		КонецЕсли;
		
	Иначе
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
			Элементы.ОбновлениеПрограммыКартинка);
		Элементы.ОбновлениеПрограммыНадпись.Заголовок = ЗаголовокУстановленаАктуальнаяВерсияПрограммы();
		Элементы.ОбновлениеПрограммыНадпись.Подсказка = "";
		
		ТекстОбновлений = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
				|Нет доступных обновлений для текущей версии конфигурации <b>%2</b>.'"),
			ДанныеМонитора.programName,
			ИнтернетПоддержкаПользователей.ВерсияКонфигурации());
		
		Элементы.ДекорацияИнформацияОбОбновлении.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстОбновлений);
		
		Элементы.ГруппаОбновлениеПрограммыДлительнаяОперация.Видимость = Ложь;
		Элементы.ГруппаОбновлениеПрограммыОшибка.Видимость             = Ложь;
		Элементы.ГруппаИнформацияОбОбновлении.Видимость                = Истина;
		
		Элементы.УстановитьОбновление.Видимость = (ЭтоWindowsКлиент
			И ЕстьНеобязательныеОбновления
			Или ДоступнаУстановкаИсправлений)
			И МодульПолучениеОбновленийПрограммы.ДоступноИспользованиеОбновленияПрограммы(Истина, Ложь);
		Элементы.ДекорацияНадписьОбновлениеОбратитесьКАдминистратору.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеДеталиИнформацияОбОбновленииНаСервере()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияОбновлениеПрограммы());
	Если ЗначениеЗаполнено(Описатель.Идентификатор) Тогда
		// Ранее запущенное задание еще не завершено
		Возврат;
	КонецЕсли;
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Подготовка к получению деталей информации о доступном обновлении.'"));
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ПолучениеИнформацииМонитораИнформацияОбОбновлении"
		+ Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.АдресРезультата = Описатель.АдресРезультата;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторПортала1СИТС.ПолучитьДеталиИнформацияОДоступномОбновлении",
		Неопределено,
		ПараметрыВыполненияВФоне);
	Описатель.ДлительнаяОперация = РезультатВыполнения;
	
	Если РезультатВыполнения.Статус = "Выполняется" Тогда
		
		Описатель.Идентификатор = РезультатВыполнения.ИдентификаторЗадания;
		ОтобразитьСостояниеДлительнаяОперацияИнформацияОбОбновлении();
		
	ИначеЕсли РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПриПолученииДеталиИнформацияОбОбновлении();
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Не удалось отобразить детали информации о доступном обновлении. Задание получение данных отменено.'"));
		ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(
			НСтр("ru = 'Задание отменено.'"));
		
	Иначе
		
		// Ошибка
		СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить детали информации о доступном обновлении.
				|%1'"),
			РезультатВыполнения.ПодробноеПредставлениеОшибки);
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
		ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(РезультатВыполнения.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДеталиИнформацияОбОбновлении()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияОбновлениеПрограммы());
	
	ОбновлениеПрограммы = ПолучитьИзВременногоХранилища(Описатель.АдресРезультата);
	Если ПустаяСтрока(ОбновлениеПрограммы.ИмяОшибки) Тогда
		
		Попытка
			ОтобразитьДеталиИнформацияОбОбновлении(ОбновлениеПрограммы);
		Исключение
			ИнформацияОшибка = ИнформацияОбОшибке();
			СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось отобразить информацию об обновлении.
					|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОшибка));
			МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
			ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка отображения данных.
						|%1'"),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОшибка)));
		КонецПопытки;
		
	Иначе
		
		ОшибкаСоединения = (ОбновлениеПрограммы.ИмяОшибки = "ConnectError");
		ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(ОбновлениеПрограммы.Сообщение, ОшибкаСоединения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДеталиИнформацияОбОбновлении(Данные)
	
	Элементы.ГруппаОбновлениеПрограммыДлительнаяОперация.Видимость = Ложь;
	Элементы.ГруппаОбновлениеПрограммыОшибка.Видимость             = Ложь;
	Элементы.ГруппаИнформацияОбОбновлении.Видимость                = Истина;
	
	ТекущаяВерсия   = ИнтернетПоддержкаПользователей.ВерсияКонфигурации();
	ТекстОбновлений = Новый Массив();
	ТекстОбновлений.Добавить(ДанныеМонитора.programName);
	
	Если ДанныеМонитора.ДоступноОбновление Тогда
		
		ТекстОбновлений.Добавить(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для текущей версии конфигурации <b>%1</b> доступны обновления:'"),
				ТекущаяВерсия));
		
		// Добавление информации о наличии доступных исправлений (патчей) для текущей версии
		Если Данные.Исправления <> Неопределено Тогда
			
			ОтборСтрок            = Новый Структура("ДляТекущейВерсии", Истина);
			КоличествоИсправлений = Данные.Исправления.НайтиСтроки(ОтборСтрок).Количество();
			
			Если КоличествоИсправлений > 0 Тогда
				ТекстОбновлений.Добавить(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1● Исправления (патчи) для версии <b>%2</b>: <b>%3</b>'"),
						"  ",
						ТекущаяВерсия,
						Строка(КоличествоИсправлений)));
			КонецЕсли;
			
		КонецЕсли;
		
		// Добавление информации о наличии доступных обновлений на версии с длительной поддержкой
		Для Каждого ДополнительнаяВерсия Из Данные.ДополнительныеВерсии Цикл
			ТекстОбновлений.Добавить(
				ТекстНовойВерсииКонфигурации(ДополнительнаяВерсия.Конфигурация));
		КонецЦикла;
		
		// Добавление информации о доступном обновлений конфигурации на актуальную версию
		Если Данные.Конфигурация <> Неопределено
			И Данные.Конфигурация.ДоступноОбновление Тогда
			
			ТекстОбновлений.Добавить(
				ТекстНовойВерсииКонфигурации(Данные.Конфигурация));
			
		// Добавление информации о доступном обновлении платформы для текущей версии конфигурации
		ИначеЕсли Данные.Платформа <> Неопределено
			И Данные.Платформа.ДоступноОбновление Тогда
			
			Если Данные.Платформа.ОбязательностьУстановки < 2 Тогда
				ТекстОбновлений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1● Платформа 1С:Предприятие <b>%2</b>. Рекомендуется установить.'"),
					"  ",
					Данные.Платформа.Версия));
			Иначе
				ТекстОбновлений.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1● Платформа 1С:Предприятие <b>%2</b>'"),
					"  ",
					Данные.Платформа.Версия));
			КонецЕсли;
			
		КонецЕсли;
		
		ДоступноОбновление = (Данные.Конфигурация <> Неопределено
			И Данные.Конфигурация.ДоступноОбновление
			Или Данные.Исправления <> Неопределено
			И Данные.Исправления.Количество() > 0
			Или Данные.Платформа <> Неопределено
			И Данные.Платформа.ДоступноОбновление);
		
		Если ДоступноОбновление <> ДанныеМонитора.ДоступноОбновление Тогда
			ДанныеМонитора.ДоступноОбновление = ДоступноОбновление;
			НастроитьОтображениеБлокаОбновлениеПрограммы();
			СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
		КонецЕсли;
		
	Иначе
		
		// Добавление информации о наличии доступных исправлений (патчей) для текущей версии
		КоличествоИсправлений = 0;
		Если Данные.Исправления <> Неопределено Тогда
			ОтборСтрок            = Новый Структура("ДляТекущейВерсии", Истина);
			КоличествоИсправлений = Данные.Исправления.НайтиСтроки(ОтборСтрок).Количество();
		КонецЕсли;
		
		Если КоличествоИсправлений > 0 Тогда
			
			ТекстОбновлений.Добавить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для текущей версии конфигурации <b>%1</b> доступны обновления:'"),
					ТекущаяВерсия));
			ТекстОбновлений.Добавить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1● Исправления (патчи) для версии <b>%2</b>: <b>%3</b>'"),
				"  ",
				ТекущаяВерсия,
				Строка(КоличествоИсправлений)));
			
		Иначе
			ТекстОбновлений.Добавить(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Нет доступных обновлений для текущей версии конфигурации <b>%1</b>.'"),
				ТекущаяВерсия));
		КонецЕсли;
		
		Если Данные.Конфигурация <> Неопределено
			И Данные.Конфигурация.ДоступноОбновление Тогда
			
			ЕстьНеобязательныеОбновления = Истина;
			
			ТекстОбновлений.Добавить(
				НСтр("ru = 'Для использования нового функционала доступны обновления:'"));
			
			Для Каждого ДополнительнаяВерсия Из Данные.ДополнительныеВерсии Цикл
				ТекстОбновлений.Добавить(
					ТекстНовойВерсииКонфигурации(ДополнительнаяВерсия.Конфигурация));
			КонецЦикла;
			
			ТекстОбновлений.Добавить(
				ТекстНовойВерсииКонфигурации(Данные.Конфигурация));
			
			НастроитьОтображениеБлокаОбновлениеПрограммы();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ДекорацияИнформацияОбОбновлении.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
		СтрСоединить(ТекстОбновлений, Символы.ПС));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстНовойВерсииКонфигурации(ОбновлениеКонфигурации)
	
	Если ПустаяСтрока(ОбновлениеКонфигурации.URLНовоеВВерсии) Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1● Версия <b>%2</b>'"),
			"  ",
			ОбновлениеКонфигурации.Версия);
	Иначе
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1● Версия <b>%2</b>   <a href=""%3"">Новое в версии</a>'"),
			"  ",
			ОбновлениеКонфигурации.Версия,
			ОбновлениеКонфигурации.URLНовоеВВерсии);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОтобразитьСостояниеДлительнаяОперацияИнформацияОбОбновлении()
	
	Элементы.ГруппаОбновлениеПрограммыДлительнаяОперация.Видимость = Истина;
	Элементы.ГруппаОбновлениеПрограммыОшибка.Видимость             = Ложь;
	Элементы.ОбновлениеПрограммыОшибкаНадпись.Заголовок            = "";
	Элементы.ГруппаИнформацияОбОбновлении.Видимость                = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОшибкаПолученияДеталиИнформацияОбОбновлении(Знач СообщениеОбОшибке, Знач ОшибкаСоединения = Ложь)
	
	Элементы.ГруппаОбновлениеПрограммыДлительнаяОперация.Видимость   = Ложь;
	Элементы.ГруппаОбновлениеПрограммыОшибка.Видимость               = Истина;
	Элементы.ОбновлениеПрограммыОшибкаНадпись.Заголовок              = СообщениеОбОшибке;
	Элементы.ПовторитьПопыткуПодключенияОбновлениеПрограммы.Важность = ВажностьКнопки.Главная;
	Элементы.ГруппаИнформацияОбОбновлении.Видимость                  = Ложь;
	
	Элементы.ДекорацияСсылкаНастройкиПроксиОбновлениеПрограммы.Видимость =
		ОшибкаСоединения
		И (ОбщегоНазначения.ИнформационнаяБазаФайловая()
		Или ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ПараметрыПроксиСервера));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокДоступноОбновлениеПрограммы()
	Возврат НСтр("ru = 'Доступно обновление программы'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокУстановленаАктуальнаяВерсияПрограммы()
	Возврат НСтр("ru = 'Установлена актуальная версия программы'");
КонецФункции

#КонецОбласти

#Область Сервисы1С

&НаСервере
Процедура ОтобразитьБлокДоговорыНаСервисы(АвтоАктивацияРаздела = Неопределено)
	
	// Обновление карточки раздела
	Если ДанныеМонитора.serviceContractsStatus.blockStatus <> "200"
		И ДанныеМонитора.serviceContractsStatus.blockStatus <> 200 Тогда
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеОшибка(
			Элементы.Сервисы1СКартинка);
		Элементы.Сервисы1СНадпись.Заголовок = НСтр("ru = 'Ошибка обновления информации'");
		Элементы.Сервисы1СНадпись.Подсказка = НСтр(
			"ru = 'Не удалось получить информацию о сервисах 1С.
			|Повторите попытку позднее.'");
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 0 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияСервисы1С();
			АвтоАктивацияРаздела.Важность = 1;
			
		КонецЕсли;
		
	ИначеЕсли ДанныеМонитора.serviceContractsStatus.status = "NO_CONTRACTS" Тогда
		
		// Нет договоров на сервисы.
		ИнтернетПоддержкаПользователей.УстановитьСостояниеПредупреждение(
			Элементы.Сервисы1СКартинка);
		Элементы.Сервисы1СНадпись.Заголовок = НСтр("ru = 'Нет подключенных сервисов'");
		Элементы.Сервисы1СНадпись.Подсказка = "";
		
		Элементы.ГруппаСервисы1СКакОформитьИнструкция.Видимость = Истина;
		
		ЗаполнитьЗаголовокИзМакета(
			Элементы.ДекорацияКакПодключитьСервис1СИнструкция,
			"ИнструкцияКакПодключитьСервисы1С");
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 1 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияСервисы1С();
			АвтоАктивацияРаздела.Важность = 2;
			
		КонецЕсли;
		
	Иначе
		
		// Склонение первого слова в предложение выполним самостоятельно
		Если ДанныеМонитора.serviceContractsStatus.applicationCount = 1 Тогда
			ШаблонНадписи = НСтр("ru = 'Подключен %1'");
		Иначе
			ШаблонНадписи = НСтр("ru = 'Подключено %1'");
		КонецЕсли;
		
		РезультатСклонения = ПолучитьСклоненияСтрокиПоЧислу(
			НСтр("ru = 'сервис'"),
			ДанныеМонитора.serviceContractsStatus.applicationCount,
			,
			"L=ru_RU")[0];
		
		Элементы.Сервисы1СНадпись.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонНадписи,
			РезультатСклонения);
		Элементы.Сервисы1СНадпись.Подсказка = "";
		
		Элементы.ГруппаСервисы1СКакОформитьИнструкция.Видимость = Ложь;
		
		ОтобразитьОбщееСостояниеДоговоровНаСервисы(АвтоАктивацияРаздела);
		
		ЗаполнитьЗаголовокИзМакета(
			Элементы.ДекорацияКакПродлитьСервис1СИнструкция,
			"ИнструкцияКакПродлитьСервис1С");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОбщееСостояниеДоговоровНаСервисы(АвтоАктивацияРаздела = Неопределено)
	
	Если ДанныеМонитора.serviceContractsStatus.status = "WARNING" Тогда
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеПредупреждение(
			Элементы.Сервисы1СКартинка);
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 1 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияСервисы1С();
			АвтоАктивацияРаздела.Важность = 2;
			
		КонецЕсли;
		
	Иначе
		ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
			Элементы.Сервисы1СКартинка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьПолучениеДеталиСервисы1СНаСервере()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияСервисы1С());
	Если ЗначениеЗаполнено(Описатель.Идентификатор) Тогда
		// Ранее запущенное задание еще не завершено
		Возврат;
	КонецЕсли;
	
	МониторПортала1СИТС.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Подготовка к получению деталей договоров на сервисы.'"));
	
	ПараметрыВыполненияВФоне = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.КлючФоновогоЗадания = "ПолучениеИнформацииМонитораДоговорыНаСервисы"
		+ Строка(Новый УникальныйИдентификатор);
	ПараметрыВыполненияВФоне.АдресРезультата = Описатель.АдресРезультата;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Логин"                         , Логин);
	ПараметрыЗадания.Вставить("Договоры1СИТС"                 , Ложь);
	ПараметрыЗадания.Вставить("АктивацияСервисовСопровождения", Ложь);
	ПараметрыЗадания.Вставить("ДоговорыНаСервисы"             , Истина);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.МониторПортала1СИТС.ПолучитьДеталиДанныхМонитора",
		ПараметрыЗадания,
		ПараметрыВыполненияВФоне);
	Описатель.ДлительнаяОперация = РезультатВыполнения;
	
	Если РезультатВыполнения.Статус = "Выполняется" Тогда
		
		Описатель.Идентификатор = РезультатВыполнения.ИдентификаторЗадания;
		ОтобразитьСостояниеДлительнаяОперацияСервисы1С();
		
	ИначеЕсли РезультатВыполнения.Статус = "Выполнено" Тогда
		
		ПриПолученииДеталиСервисы1С();
		
	ИначеЕсли РезультатВыполнения.Статус = "Отменено" Тогда
		
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(
			НСтр("ru = 'Не удалось отобразить детали договоров на сервисы. Задание получение данных отменено.'"));
		ОтобразитьОшибкаПолученияДеталиСервисы1С(
			НСтр("ru = 'Задание отменено.'"));
		
	Иначе
		
		// Ошибка.
		СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить детали договоров на сервисы.
				|%1'"),
			РезультатВыполнения.ПодробноеПредставлениеОшибки);
		МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
		ОтобразитьОшибкаПолученияДеталиСервисы1С(РезультатВыполнения.КраткоеПредставлениеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДеталиСервисы1С()
	
	Описатель = ОписательЗадания(
		Задания,
		ОперацияСервисы1С());
	
	РезультатОперацииСервиса = ПолучитьИзВременногоХранилища(Описатель.АдресРезультата);
	Если ПустаяСтрока(РезультатОперацииСервиса.ИмяОшибки) Тогда
		
		Данные = РезультатОперацииСервиса.Данные;
		
		СостояниеИзменилось = ТипЗнч(ДанныеМонитора.serviceContractsStatus) <> ТипЗнч(Данные.serviceContractsStatus)
			Или ДанныеМонитора.serviceContractsStatus.blockStatus <> Данные.serviceContractsStatus.blockStatus
			Или ДанныеМонитора.serviceContractsStatus.status <> Данные.serviceContractsStatus.status;
		
		Попытка
			ДанныеМонитора.serviceContractsStatus = Данные.serviceContractsStatus;
			ОтобразитьБлокДоговорыНаСервисы();
			ОтобразитьДеталиСервисы1С(Данные);
		Исключение
			ИнформацияОшибка = ИнформацияОбОшибке();
			СообщениеЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось отобразить детали договоров на сервисы.
					|%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОшибка));
			МониторПортала1СИТС.ЗаписатьОшибкуВЖурналРегистрации(СообщениеЖурнала);
			ОтобразитьОшибкаПолученияДеталиСервисы1С(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка отображения данных.
						|%1'"),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОшибка)));
		КонецПопытки;
		
		Если СостояниеИзменилось Тогда
			СохранитьОтпечатокДанныхМонитора(Логин, ДанныеМонитора);
		КонецЕсли;
		
	Иначе
		ОтобразитьОшибкаПолученияДеталиСервисы1С(РезультатОперацииСервиса.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьДеталиСервисы1С(Данные)
	
	Элементы.ГруппаСервисы1СДлительнаяОперация.Видимость = Ложь;
	Элементы.ГруппаСервисы1СОшибка.Видимость             = Ложь;
	
	Если Данные.serviceContractsStatus.status = "NO_CONTRACTS" Тогда
		Элементы.ГруппаСервисы1СДетали.Видимость = Ложь;
	Иначе
		Элементы.ГруппаСервисы1СДетали.Видимость    = Истина;
		Элементы.ДекорацияСервисы1ССписок.Заголовок = МаркированныйСписокСПериодами(
			Данные.serviceContracts,
			Истина,
			НСтр("ru = 'Срок действия сервисов:'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьСостояниеДлительнаяОперацияСервисы1С()
	
	Элементы.ГруппаСервисы1СДлительнаяОперация.Видимость = Истина;
	Элементы.ГруппаСервисы1СОшибка.Видимость             = Ложь;
	Элементы.ГруппаСервисы1СДетали.Видимость             = Ложь;
	Элементы.Сервисы1СОшибкаНадпись.Заголовок            = "";
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьОшибкаПолученияДеталиСервисы1С(Знач СообщениеОбОшибке, Знач ОшибкаСоединения = Ложь)
	
	Элементы.ГруппаСервисы1СДлительнаяОперация.Видимость   = Ложь;
	Элементы.ГруппаСервисы1СОшибка.Видимость               = Истина;
	Элементы.ГруппаСервисы1СДетали.Видимость               = Ложь;
	Элементы.Сервисы1СОшибкаНадпись.Заголовок              = СообщениеОбОшибке;
	Элементы.ПовторитьПопыткуПодключенияСервисы1С.Важность = ВажностьКнопки.Главная;
	
	Элементы.ДекорацияСсылкаНастройкиПроксиСервисы1С.Видимость =
		ОшибкаСоединения
		И (ОбщегоНазначения.ИнформационнаяБазаФайловая()
		Или ПравоДоступа("Просмотр", Метаданные.ОбщиеФормы.ПараметрыПроксиСервера));
	
КонецПроцедуры

#КонецОбласти

#Область ПредупрежденияСервисов

&НаСервере
Процедура ОтобразитьБлокПредупрежденияСервисов(АвтоАктивацияРаздела)
	
	Если ДанныеМонитора.ПредупрежденияСервисов.ЕстьПредупреждения Тогда
		
		Склонения = ПолучитьСклоненияСтрокиПоЧислу(
			НСтр("ru = 'предупреждение'"),
			ДанныеМонитора.ПредупрежденияСервисов.КоличествоПредупреждений,
			,
			"L=ru_RU");
		
		ИнтернетПоддержкаПользователей.УстановитьСостояниеПредупреждение(
			Элементы.ПредупрежденияКартинка);
		Элементы.ПредупрежденияНадпись.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Получено %1'"),
			Склонения[0]);
		
		Если АвтоАктивацияРаздела <> Неопределено
			И АвтоАктивацияРаздела.Важность <= 1 Тогда
			
			АвтоАктивацияРаздела.Раздел   = ОперацияПредупрежденийСервисов();
			АвтоАктивацияРаздела.Важность = 2;
			
		КонецЕсли;
		
	Иначе
		ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
			Элементы.ПредупрежденияКартинка);
		Элементы.ПредупрежденияНадпись.Заголовок = НСтр("ru = 'Предупреждения отсутствуют'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаркированныйСписокПредупреждений(Знач ДанныеСписка)
	
	Если ДанныеСписка = Неопределено
		Или ДанныеСписка.Количество() = 0 Тогда
		
		Возврат НСтр("ru = '<Нет предупреждений>'");
		
	КонецЕсли;
	
	ТекстыПредупреждений = МониторПортала1СИТС.ТекстыПредупреждений(ДанныеСписка);
	
	ЧастиСтроки = Новый Массив();	// Массив из Строка
	Для Каждого ЭлементСписка Из ТекстыПредупреждений Цикл
		ЧастиСтроки.Добавить("● " + ЭлементСписка);
	КонецЦикла;
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		СтрСоединить(ЧастиСтроки, Символы.ПС));
	
КонецФункции

#КонецОбласти

#Область ИдентификаторыОпераций

&НаКлиентеНаСервереБезКонтекста
Функция ОперацияСодержимоеМонитора()
	
	Возврат "СодержимоеМонитора";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОперацияУсловияСопровождения()
	
	Возврат "УсловияСопровождения";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОперацияОбновлениеПрограммы()
	
	Возврат "ОбновлениеПрограммы";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОперацияСервисы1С()
	
	Возврат "Сервисы1С";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОперацияПредупрежденийСервисов()
	
	Возврат "ПредупрежденийСервисов";
	
КонецФункции

#КонецОбласти

#КонецОбласти
