// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриНачальномЗаполненииПодсистемыАналитикаДанных");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.24.202";
	Обработчик.Процедура = "ПодборПерсоналаАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("72f8dd7a-f6bc-11ec-8499-ca102586f8a5");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение аналитики данных: подбор персонала.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение аналитики данных
//
// Параметры:
//  ПараметрыОбновления - Структура - описывает текущие параметры обновления:
//   * ОбработкаЗавершена - Булево
//
Процедура ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодборПерсонала.СоздатьВТВакансииПоОтбору(Запрос.МенеджерВременныхТаблиц, Новый Структура);
	
	Запрос.УстановитьПараметр("ДатаНачала", АналитикаДанных.ДатаНачалаАналитики());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ВакансииПоОтбору.Вакансия КАК Вакансия
		|ИЗ
		|	ВТВакансииПоОтбору КАК ВакансииПоОтбору
		|ГДЕ
		|	НЕ ВакансииПоОтбору.Вакансия В
		|		(ВЫБРАТЬ
		|			ОбновлениеАналитики.Вакансия КАК Вакансия
		|		ИЗ
		|			РегистрСведений.ОбновлениеАналитикиВакансий КАК ОбновлениеАналитики)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	// Метаданные.РегистрыСведений.КадроваяИсторияСотрудников
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий;
	
	// Метаданные.РегистрыСведений.СостоянияВакансий
	НоваяСтрока = ЗависимыеДанные.Добавить();
	НоваяСтрока.ВедущиеМетаданные = Метаданные.РегистрыСведений.СостоянияВакансий;
	НоваяСтрока.ЗависимыеМетаданные = Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура ПриОбновленииАналитикиДанных() Экспорт
	ОбновитьАналитикуВакансий();
КонецПроцедуры

#КонецОбласти

// Регистрация обновления аналитики состояний вакансий.
// 
// Параметры:
//  ТаблицаОбновления - См. НоваяТаблицаОбновлениеАналитикиВакансий
Процедура ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновления) Экспорт
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбновления.Свернуть("Вакансия");
	
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ОбновлениеАналитикиВакансий");
	ЭлементБлокировкиДанных.ИсточникДанных = ТаблицаОбновления;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("Вакансия", "Вакансия");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();

	Попытка
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ОбновлениеАналитикиВакансий.СоздатьНаборЗаписей();
		Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
			НаборЗаписей.Очистить();
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), СтрокаТаблицы);
			НаборЗаписей.Отбор["Вакансия"].Установить(СтрокаТаблицы["Вакансия"]);
			НаборЗаписей.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Аналитика данных.Регистрация обновления аналитики вакансий'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#Область ОснованияДляОбновленияАналитикиДанных

// Заполняет таблицу обновления кадровой истории.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников
Процедура ЗаполнитьТаблицуОбновленияКадровойИстории(Источник) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияКадровойИсторииДляВакансий",
		ТаблицаОбновленияКадровойИсторииДляВакансий(Источник));
	
КонецПроцедуры

// Заполняет таблицу обновления состояний вакансий.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияВакансий
Процедура ЗаполнитьТаблицуОбновленияСостоянийВакансий(Источник, Замещение) Экспорт
	Источник.ДополнительныеСвойства.Вставить("ТаблицаОбновленияСостоянияВакансий", ТаблицаОбновленияСостоянияВакансий(Источник, Замещение));
КонецПроцедуры

#КонецОбласти

// При инициализации наборов регистров обновления аналитики данных.
// 
// Параметры:
//  НаборРегистров - Массив - См. АналитикаДанныхВнутренний.НаборРегистровОбновленияАналитикиДанных
Процедура ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров) Экспорт
	НаборРегистров.Добавить(Метаданные.РегистрыСведений.ОбновлениеАналитикиВакансий.ПолноеИмя());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеСобытийОбновленияАналитикиДанных

// Зарегистрировать изменение кадровой истории сотрудников.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.КадроваяИсторияСотрудников - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеКадровойИсторииДляПодборПерсоналаАналитикаДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновленияКадровойИсторииДляВакансий(Источник));
	
КонецПроцедуры

// Зарегистрировать изменение состояний вакансий.
// 
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияВакансий - Источник
//  Отказ - Булево - Отказ
//  Замещение - Булево - Замещение
Процедура ЗарегистрироватьИзменениеСостоянийВакансийДляАналитикиДанныхПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеАналитикиВакансий(ТаблицаОбновленияСостоянияВакансий(Источник, Замещение));
	
КонецПроцедуры

#КонецОбласти

// Конструктор таблицы обновления аналитики состояния вакансий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Вакансия - СправочникСсылка.Вакансии 
Функция НоваяТаблицаОбновлениеАналитикиВакансий() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	Возврат Таблица;
	
КонецФункции

Функция НоваяТаблицаАналитикаВакансий()
	Возврат ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("АналитикаВакансий");
КонецФункции

Функция ТаблицаОбновленияКадровойИсторииДляВакансий(Источник)
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиВакансий();
	ИзменившиесяДанные = Источник.ТаблицаИзменившихсяДанныхНабора(); // ТаблицаЗначений
	
	Если ИзменившиесяДанные <> Неопределено Тогда
		КандидатыПоСотрудникам = ПодборПерсонала.КандидатыПоСотрудникам(ИзменившиесяДанные.ВыгрузитьКолонку("Сотрудник"));
		КандидатыПоСотрудникам.Индексы.Добавить("Сотрудник");
		ВидСобытияПрием = Перечисления.ВидыКадровыхСобытий.Прием;
		Для Каждого СтрокаТаблицы Из ИзменившиесяДанные Цикл
			КандидатыСотрудника = КандидатыПоСотрудникам.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник));
			Если КандидатыСотрудника.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Вакансия = КандидатыСотрудника[0].Вакансия;
			Если Не ЗначениеЗаполнено(Вакансия) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТаблицы["Добавление"] = Истина И СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			ИначеЕсли СтрокаТаблицы["Удаление"] = Истина И СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			ИначеЕсли СтрокаТаблицы["ИзменилсяРесурсВидСобытия"] = Истина
					И (СтрокаТаблицы.НовоеЗначениеВидСобытия = ВидСобытияПрием Или СтрокаТаблицы.СтароеЗначениеВидСобытия = ВидСобытияПрием) Тогда
				НоваяСтрока = ТаблицаОбновления.Добавить();
				НоваяСтрока.Вакансия = Вакансия;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаОбновления;
	
КонецФункции

Функция ТаблицаОбновленияСостоянияВакансий(Источник, Замещение)
	
	ПрежнийНабор = Источник.ДополнительныеСвойства["ПрежнийНабор"]; // ТаблицаЗначений
	
	Если Источник.Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат ПрежнийНабор;
	КонецЕсли;
	
	НовыйНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(Источник, Замещение);
	Если Не Источник.ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат НовыйНабор;
	КонецЕсли;
	
	ТаблицаОбновления = НоваяТаблицаОбновлениеАналитикиВакансий();
	Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, НовыйНабор, "Период, Вакансия, Состояние") Тогда
		Возврат ТаблицаОбновления;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НовыйНабор, ТаблицаОбновления);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПрежнийНабор, ТаблицаОбновления);
	
	Возврат ТаблицаОбновления;
	
КонецФункции

#Область Вакансии

Процедура ОбновитьАналитикуВакансий(Вакансии = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ДанныеНабора.Вакансия КАК Вакансия
		|ИЗ
		|	РегистрСведений.ОбновлениеАналитикиВакансий КАК ДанныеНабора";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	Если Вакансии <> Неопределено Тогда
		ОтборЗапроса.Добавить("ДанныеНабора.Вакансия В(&Вакансии)");
		Запрос.УстановитьПараметр("Вакансии", Вакансии);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока Истина Цикл
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбновлениеАналитикиВакансий"); 
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Вакансия", "Вакансия");
		
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			ТаблицаОбновления = РезультатЗапроса.Выгрузить();
			ТаблицаОбновления.Индексы.Добавить("Вакансия");
			ОбновитьАналитикуВакансийПоТаблице(ТаблицаОбновления);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьАналитикуВакансийПоТаблице(ТаблицаОбновления)
	
	АналитикаВакансий = НоваяТаблицаАналитикаВакансий();
	ЗаполнитьТаблицуАналитикиВакансий(АналитикаВакансий, ТаблицаОбновления);
	АналитикаВакансий.Индексы.Добавить("Вакансия");
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбновления Цикл
		// Заполняем набор аналитики.
		НаборАналитика = РегистрыСведений.АналитикаВакансий.СоздатьНаборЗаписей();
		НаборАналитика.Отбор.Вакансия.Установить(СтрокаТаблицы.Вакансия);
		
		// Дополняем набор аналитики новыми строками.
		ОтборСтрок = Новый Структура("Вакансия", СтрокаТаблицы.Вакансия);
		НайденныеСтроки = АналитикаВакансий.НайтиСтроки(ОтборСтрок);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НайденныеСтроки, НаборАналитика);
		
		// Подготавливаем к очистке набор обновления.
		НаборОбновления = РегистрыСведений.ОбновлениеАналитикиВакансий.СоздатьНаборЗаписей();
		НаборОбновления.Отбор.Вакансия.Установить(СтрокаТаблицы.Вакансия);
		НачатьТранзакцию();
		Попытка
			НаборАналитика.Записать();
			НаборОбновления.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуАналитикиВакансий(АналитикаВакансий, ТаблицаОбновления)
	
	Если ТаблицаОбновления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ТекущаяДата = КонецДня(ТекущаяДатаСеанса());
	ПодборПерсонала.СоздатьВТПринятыеКандидаты(Запрос.МенеджерВременныхТаблиц, АналитикаДанных.ДатаНачалаАналитики(), ТекущаяДата);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятыеКандидаты.Кандидат.Вакансия КАК Вакансия,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПринятыеКандидаты.ФизическоеЛицо) КАК ПринятоКандидатов
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВТПринятыеКандидаты КАК ПринятыеКандидаты
		|СГРУППИРОВАТЬ ПО
		|	ПринятыеКандидаты.Кандидат.Вакансия
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	Вакансии.ДатаОткрытия КАК НачалоПериода,
		|	Вакансии.ПланируемаяДатаЗакрытия КАК КонецПериода,
		|	РАЗНОСТЬДАТ(Вакансии.ДатаОткрытия, ВЫБОР
		|		КОГДА Вакансии.ПланируемаяДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ТекущаяДата
		|		ИНАЧЕ ВЫБОР
		|			КОГДА Вакансии.ПланируемаяДатаЗакрытия < &ТекущаяДата
		|				ТОГДА Вакансии.ПланируемаяДатаЗакрытия
		|			ИНАЧЕ &ТекущаяДата
		|		КОНЕЦ
		|	КОНЕЦ, ДЕНЬ) КАК Длительность,
		|	ТекущиеСостоянияВакансий.Состояние КАК ТекущееСостояние,
		|	ТекущиеСостоянияВакансий.Период КАК ДатаТекущегоСостояния,
		|	ЕСТЬNULL(ВТСотрудники.ПринятоКандидатов, 0) КАК ПринятоКандидатов
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущиеСостоянияВакансий
		|		ПО (ТекущиеСостоянияВакансий.Вакансия = Вакансии.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотрудники КАК ВТСотрудники
		|		ПО Вакансии.Ссылка = ВТСотрудники.Вакансия
		|ГДЕ
		|	Вакансии.Ссылка В (&Вакансии)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	Запрос.УстановитьПараметр("Вакансии", ТаблицаОбновления.ВыгрузитьКолонку("Вакансия"));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = АналитикаВакансий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
