#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Действие") Тогда
			Если ДанныеЗаполнения.Действие = "Исправить" Тогда
				
				ДокументыРазовыхНачислений.СкопироватьИсправляемыйДокумент(ДокументОбъект, 
												ДанныеЗаполнения.Ссылка, 
												"ДокументРассчитан,ДокументЗаполнения,Рассчитал", 
												"ДанныеОбИндексации,Начисления,НачисленияПерерасчет,НачисленияПерерасчетНулевыеСторно,
												|ОтпускаАвансомПерерасчет,НДФЛ,ОтработанноеВремяДляСреднегоОбщий,ПогашениеЗаймов,
												|Показатели,ПримененныеВычетыНаДетейИИмущественные,
												|РаспределениеРезультатовНачислений,РаспределениеРезультатовУдержаний,
												|СреднийЗаработокОбщий,Удержания",
												ДанныеЗаполнения);
				
				ДокументОбъект.ИсправленныйДокумент = ДанныеЗаполнения.Ссылка;
				
				ЗапрашиваемыеЗначения = Новый Структура;
				ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
				ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ДокументОбъект, ЗапрашиваемыеЗначения);
				
				Если ДокументОбъект.ПредоставитьОсновнойОтпуск И ДокументОбъект.КоличествоДнейОсновногоОтпускаАвансом > 0 Тогда
					НоваяСтрока = ДокументОбъект.ОтпускаАвансомПерерасчет.Добавить();
					НоваяСтрока.ВидРасчета = ДокументОбъект.ВидРасчетаОсновногоОтпуска;
					НоваяСтрока.КоличествоДнейАвансом = ДокументОбъект.КоличествоДнейОсновногоОтпускаАвансом;
				КонецЕсли;
				
				Для Каждого ДанныеДополнительногоОтпуска Из ДокументОбъект.ДополнительныеОтпуска Цикл 
					ЗаполнитьЗначенияСвойств(ДокументОбъект.ОтпускаАвансомПерерасчет.Добавить(), ДанныеДополнительногоОтпуска);
				КонецЦикла;
				
				Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда 
					Модуль = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
					Модуль.ЗаполнитьОтпускПоЗаявкеСотрудника(ДокументОбъект, ДанныеЗаполнения);
				КонецЕсли;
				
				Если ДанныеЗаполнения.Свойство("ОснованиеПриостановки") Тогда
					ЗаполнитьПоОснованиямПриостановки(ДокументОбъект, ДанныеЗаполнения);
				КонецЕсли;
				
			ИначеЕсли ДанныеЗаполнения.Действие = "Заполнить" Тогда
				
				ЗаполнитьПоДаннымЗаполнения(ДокументОбъект, ДанныеЗаполнения);
				
			ИначеЕсли ДанныеЗаполнения.Действие = "ЗаполнитьПоДокументуОтпускаСотрудников" Тогда
				
				ЗаполнитьПоДокументуОтпускаСотрудников(ДокументОбъект, ДанныеЗаполнения);
				
			ИначеЕсли ДанныеЗаполнения.Действие = "ЗаполнитьПоЗаявке" Тогда
				
				Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда 
					Модуль = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
					Модуль.ЗаполнитьОтпускПоЗаявкеСотрудника(ДокументОбъект, ДанныеЗаполнения);
				КонецЕсли;
				
			ИначеЕсли ДанныеЗаполнения.Действие = "ЗаполнитьИзОбучения" Тогда
				
				Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОбучениеРазвитие") Тогда 
					Модуль = ОбщегоНазначения.ОбщийМодуль("ОбучениеРазвитие");
					Модуль.ЗаполнитьОтпускИзДокументаОбучения(ДокументОбъект, ДанныеЗаполнения);
				КонецЕсли;
				
			ИначеЕсли ДанныеЗаполнения.Действие = "ЗаполнитьПослеПереноса" Тогда	
				
				ЗаполнитьПослеПереноса(ДокументОбъект, ДанныеЗаполнения);	
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(ДокументОбъект, Отказ, РежимПроведения) Экспорт
	
	Документы.Отпуск.ПровестиПоУчетам(ДокументОбъект.Ссылка, РежимПроведения, Отказ, Неопределено, ДокументОбъект.Движения, ДокументОбъект, ДокументОбъект.ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		
		ЗарплатаКадры.ПроверитьКорректностьДаты(ДокументОбъект.Ссылка, ДокументОбъект.ДатаНачалаОсновногоОтпуска, "Объект.ДатаНачалаОсновногоОтпуска", Отказ, НСтр("ru='Дата начала основного отпуска'"), , , Ложь);
		ЗарплатаКадры.ПроверитьКорректностьДаты(ДокументОбъект.Ссылка, ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск, "Объект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", Отказ, НСтр("ru='Начало периода за который предоставляется основной отпуск'"), , , Ложь);
		
	КонецЕсли;
	
	Если ДокументОбъект.ОсвобождатьСтавку Тогда
		
		ПериодыОтсутствий = Документы.Отпуск.ПериодыОтсутствий(ДокументОбъект);
		ПериодОтсутствия = Документы.Отпуск.ПериодОтсутствия(ПериодыОтсутствий);
		
		УправлениеШтатнымРасписанием.ПроверитьВозможностьПроведенияВременногоОсвобожденияСтавок(
			ДокументОбъект.Ссылка, ДокументОбъект.Проведен, ДокументОбъект.Сотрудник, ПериодОтсутствия.НачалоПериода, ПериодОтсутствия.ОкончаниеПериода, Отказ,
			ДокументОбъект.ИсправленныйДокумент, "Сотрудник,ДатаНачалаПериодаОтсутствия,ДатаОкончанияПериодаОтсутствия");
		
	КонецЕсли;
	
	КонтейнерОшибок = Неопределено;
	
	ПроверитьЗаполнениеРеквизитовШапки(ДокументОбъект, КонтейнерОшибок);	

	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда
		
		Если ДокументОбъект.ДокументРассчитан Тогда 
			
			ЗарплатаКадры.ПроверитьДатуВыплаты(ДокументОбъект, Отказ);
			
			ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(ДокументОбъект, КонтейнерОшибок);
			
			ИсправлениеДокументовЗарплатаКадры.ПроверитьЗаполнение(ДокументОбъект, ПроверяемыеРеквизиты, Отказ);
			ПроверитьПериодДействияНачислений(ДокументОбъект, Отказ);
			
			// Проверка корректности распределения по источникам финансирования
			ИменаТаблицРаспределяемыхПоСтатьямФинансирования = "Начисления,НачисленияПерерасчет,Удержания,НДФЛ,ПогашениеЗаймов,КорректировкиВыплаты";
			
			ОтражениеЗарплатыВБухучетеРасширенный.ПроверитьРезультатыРаспределенияНачисленийУдержанийОбъекта(
				ДокументОбъект, ИменаТаблицРаспределяемыхПоСтатьямФинансирования, Отказ);
			
			// Проверка корректности распределения по территориям и условиям труда
			ИменаТаблицРаспределенияПоТерриториямУсловиямТруда = "Начисления,НачисленияПерерасчет";
			
			РасчетЗарплатыРасширенный.ПроверитьРаспределениеПоТерриториямУсловиямТрудаДокумента(
				ДокументОбъект, ИменаТаблицРаспределенияПоТерриториямУсловиямТруда, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Документы.Отпуск.ПроверитьРаботающих(ДокументОбъект, Отказ);
	
	ПроверитьПериодРаботыЗаКоторыйПредоставляетсяОтпуск(ДокументОбъект, КонтейнерОшибок);
	
	Если Не ДокументОбъект.ДополнительныеСвойства.Свойство("ПроверкаПересеченияПериодовВыполнена") Тогда
		ПроверитьПересечениеПериодовОтсутствия(ДокументОбъект, Отказ);
	КонецЕсли;
	
	ПроверитьКоличествоДнейОтгула(ДокументОбъект, КонтейнерОшибок);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
		Модуль.ПроверитьНаличиеОтпускаПоЗаявкеСотрудника(ДокументОбъект.ЗаявкаСотрудника, ДокументОбъект.Сотрудник, ДокументОбъект.Ссылка, Отказ, ДокументОбъект.ИсправленныйДокумент);
	КонецЕсли;
	
	УдалитьПроверенныеРеквизиты(ПроверяемыеРеквизиты);
	
	ЭДОБЗК.ПроверитьВозможностьСохраненияИзмененийДокументаСПечатнымиФормами(
		ДокументОбъект, Метаданные.Роли.ДобавлениеИзменениеНачисленнойЗарплатыРасширенная, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(ДокументОбъект, Отказ) Экспорт
	
	Если ДокументОбъект.ОсвобождатьСтавку Тогда
		
		УправлениеШтатнымРасписанием.ПроверитьВозможностьОтменыПроведения(ДокументОбъект.Ссылка, ДокументОбъект.Сотрудник,
			ДокументОбъект.ДатаНачалаПериодаОтсутствия, ДокументОбъект.ДатаОкончанияПериодаОтсутствия, Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) И ДокументОбъект.ПериодыПриостановкиОтпуска.Количество() > 0 Тогда
	
		ПроверитьПересекающиесяБольничные(ДокументОбъект);
	
	КонецЕсли;
	
	ПерерасчетЗарплаты.УдалитьПерерасчетыПоРегистратору(ДокументОбъект.Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ПериодыОтсутствий = Документы.Отпуск.ПериодыОтсутствий(ДокументОбъект);
	ПериодОтсутствия = Документы.Отпуск.ПериодОтсутствия(ПериодыОтсутствий);
	ДокументОбъект.ДатаНачалаПериодаОтсутствия = ПериодОтсутствия.НачалоПериода;
	ДокументОбъект.ДатаОкончанияПериодаОтсутствия = ПериодОтсутствия.ОкончаниеПериода;
	
	ПредставлениеПериода = ЗарплатаКадрыРасширенный.ПредставлениеПериодаРасчетногоДокумента(ДокументОбъект.ДатаНачалаПериодаОтсутствия, ДокументОбъект.ДатаОкончанияПериодаОтсутствия);
	
	ДокументыРазовыхНачислений.ЗаполнитьРегистраторРазовыхНачисленийПередЗаписью(ДокументОбъект);
	РасчетЗарплатыРасширенный.ЗаполнитьИсходныйДокумент(ДокументОбъект);
	ОтражениеЗарплатыВБухучетеРасширенный.ОбновитьДанныеБухучетаДокументаПередЗаписью(ДокументОбъект);
	
	ЗаполнитьКоличествоДнейОтпускаАвансом(ДокументОбъект);
	
	ЗаполнитьФлажкиНаличияВидовОтпусков(ДокументОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(ДокументОбъект, Отказ) Экспорт
	
	УчетСреднегоЗаработка.ЗаписатьДатуНачалаСобытия(ДокументОбъект.Ссылка, ДокументОбъект.Сотрудник, ДокументОбъект.ДатаНачалаСобытия);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ЦепочкиДокументов") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ЦепочкиДокументов");
		Модуль.УстановитьВторичныеРеквизитыДокументаЗамещения(ДокументОбъект);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Модуль.СохранитьВариантРасчетаСреднегоЗаработкаДокумента(ДокументОбъект, ДокументОбъект.ДатаНачалаСобытия);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДокументЗаполнения) И Не ДокументОбъект.ДополнительныеСвойства.Свойство("ОтпускаСотрудников") Тогда 
		Документы.ОтпускаСотрудников.УстановитьСвойствоДокументРассчитан(ДокументОбъект.ДокументЗаполнения);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОбучениеРазвитие") Тогда
		МодульОбучениеРазвитие = ОбщегоНазначения.ОбщийМодуль("ОбучениеРазвитие");
		МодульОбучениеРазвитие.ЗаписатьОтсутствиеНаОснованииОбучения(ДокументОбъект);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДляБухучета = Документы.Отпуск.ДанныеДляБухучетаЗарплатыПервичныхДокументов(ДокументОбъект);
	ОтражениеЗарплатыВБухучетеРасширенный.ЗарегистрироватьБухучетЗарплатыПервичныхДокументов(ДанныеДляБухучета);
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ПриКопировании(ДокументОбъект, ОбъектКопирования) Экспорт
	
	ДокументыРазовыхНачислений.ПриКопированииДокумента(ДокументОбъект);
	РасчетЗарплатыРасширенный.ЗаполнитьИсходныйДокументПриКопировании(ДокументОбъект, ОбъектКопирования.Ссылка);
	
КонецПроцедуры

Процедура ЗаполнитьФлажкиНаличияВидовОтпусков(ДокументОбъект) Экспорт
	ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускПострадавшимВАварииЧАЭС");
	ДокументОбъект.ЕстьОтпускЧАЭС = ДокументОбъект.ДополнительныеОтпуска.Найти(ВидОтпуска, "ВидОтпуска") <> Неопределено;
	
	ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаСанаторноКурортноеЛечение");
	ДокументОбъект.ЕстьОтпускНаПериодЛечения = ДокументОбъект.ДополнительныеОтпуска.Найти(ВидОтпуска, "ВидОтпуска") <> Неопределено;
КонецПроцедуры

Функция ДокументГотовКРасчету(ДокументОбъект, ВыводитьСообщения = Истина) Экспорт
	
	КонтейнерОшибок = Неопределено;
	
	ПроверитьЗаполнениеРеквизитовШапки(ДокументОбъект, КонтейнерОшибок);
	
	ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(ДокументОбъект, КонтейнерОшибок, Истина);                                                                        
		
	КонтейнерСодержитОшибки = Ложь;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, КонтейнерСодержитОшибки);
	
	Если Не ВыводитьСообщения Тогда
		
		ПолучитьСообщенияПользователю(Истина);		
		
	КонецЕсли;
	
	Возврат Не КонтейнерСодержитОшибки;	
	
КонецФункции

Функция РезультатПроверкиПересеченийПериодовОтсутствия(ДокументОбъект) Экспорт
	
	РеквизитыДляПроведения = Документы.Отпуск.РеквизитыДляПроведенияПустаяСтруктура();
	ЗаполнитьЗначенияСвойств(РеквизитыДляПроведения, ДокументОбъект);
	ИсходныеДанные = Документы.Отпуск.ДанныеСостоянийСотрудника(РеквизитыДляПроведения);
	
	Возврат СостоянияСотрудников.ПроверитьПересечениеПериодовОтсутствия(ИсходныеДанные, ДокументОбъект.Ссылка, ДокументОбъект.ИсправленныйДокумент);
	
КонецФункции

 Процедура Рассчитать(ДокументОбъект, ПараметрыРасчета = Неопределено) Экспорт
	
	Если ПараметрыРасчета = Неопределено Тогда
		ПараметрыРасчета = ДокументОбъект.ПараметрыРасчета();
	КонецЕсли;
	
	ОписаниеДокумента = Документы.Отпуск.ОписаниеДокументаРасчета();
	Если ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) Тогда
		ПараметрыИсправленногоДокумента = Документы.Отпуск.ПараметрыИсправляемогоДокумента(ДокументОбъект.ИсправленныйДокумент);
	Иначе
		ПараметрыИсправленногоДокумента = Неопределено;
	КонецЕсли;
	
	Документы.Отпуск.ОчиститьРассчитанныеДанные(ДокументОбъект, ПараметрыРасчета.ПерезаполнитьНачисления, ПараметрыРасчета.ОбновитьРасчетДенежногоСодержания);
	
	НачалоПериода = ?(ПараметрыРасчета.ПерезаполнитьНачисления, Документы.Отпуск.НачальныйПериодРасчетаЗарплаты(ДокументОбъект).ДатаНачала, Неопределено);
	ПериодРасчетаЗарплаты = Документы.Отпуск.ПериодРасчетаЗарплатыДоНачалаОтпуска(ДокументОбъект, НачалоПериода);
	
	МенеджерРасчета = РасчетЗарплатыРасширенный.СоздатьМенеджерРасчета(ДокументОбъект.ПериодРегистрации, ДокументОбъект.Организация);
	ЗаполнитьНастройкиМенеджераРасчета(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыРасчета.СохранятьИсправления);
	
	ЗафиксированныеСтрокиОплатыТруда = Новый Соответствие;
	
	Если ПараметрыРасчета.ПерезаполнитьНачисления Тогда
		
		Если (ДокументОбъект.РассчитатьЗарплату Или ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску
			Или (ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске И ДокументОбъект.РасчетДенежногоСодержания))
			И Документы.Отпуск.ОтпускНачинаетсяВСледующемМесяце(ДокументОбъект, НачалоПериода) Тогда
			
			ЗаполнитьНачисления(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыИсправленногоДокумента, ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего);
			ЗаполнитьПерерасчеты(ДокументОбъект, МенеджерРасчета);
			
			Если Не ПараметрыРасчета.СкорректированСреднийЗаработок Тогда 
				ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего = Истина;
			КонецЕсли;
			
			ЗафиксированныеСтрокиОплатыОтпуска = УстановитьПризнакФиксРасчетНачислениямОплатыОтпуска(ДокументОбъект, МенеджерРасчета);
			
			НастройкиРасчетаОтпуска = ОбщегоНазначения.СкопироватьРекурсивно(МенеджерРасчета.НастройкиРасчета);
			МенеджерРасчета.УстановитьНастройкиРасчетаПоУмолчанию();
			МенеджерРасчета.НастройкиРасчета.Сотрудники = НастройкиРасчетаОтпуска.Сотрудники;
			МенеджерРасчета.НастройкиРасчета.ФизическиеЛица = НастройкиРасчетаОтпуска.ФизическиеЛица;
			МенеджерРасчета.НастройкиРасчета.РассчитыватьНачисления = Истина;			
			
			МенеджерРасчета.РассчитатьЗарплату();
			
			ЗаполнитьНастройкиМенеджераРасчетаПоШаблону(МенеджерРасчета, НастройкиРасчетаОтпуска);
			РезультатРасчетаНачисленийВДанныеОбъекта(ДокументОбъект, МенеджерРасчета.Зарплата);
			
			НоваяТранзакция = ДокументОбъект.НачатьНовуюТранзакцию();
			ЗарегистрироватьНачисленияОплатыТруда(ДокументОбъект, МенеджерРасчета.Зарплата);
			ОбновитьДанныеДляРасчетаСохраняемогоЗаработка(ДокументОбъект, ПараметрыРасчета);
			
			Если НоваяТранзакция Тогда
				ОтменитьТранзакцию();
			КонецЕсли;	
			
			Документы.Отпуск.ОчиститьРассчитанныеДанные(ДокументОбъект, ПараметрыРасчета.ПерезаполнитьНачисления, ложь);
			ОчиститьДанныеДляРасчетаСреднегоЗаПериодРегистрации(ДокументОбъект, ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего);
			СброситьПризнакФиксРасчет(МенеджерРасчета, ЗафиксированныеСтрокиОплатыОтпуска);
			
			ЗафиксированныеСтрокиОплатыТруда = УстановитьПризнакФиксРасчетНачислениямОплатыТруда(ДокументОбъект, МенеджерРасчета);
		Иначе
			ОбновитьДанныеДляРасчетаСохраняемогоЗаработка(ДокументОбъект, ПараметрыРасчета);
		КонецЕсли;
		МенеджерРасчета = РасчетЗарплатыРасширенный.СоздатьМенеджерРасчета(ДокументОбъект.ПериодРегистрации, ДокументОбъект.Организация);
		ЗаполнитьНастройкиМенеджераРасчета(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыРасчета.СохранятьИсправления);
		ЗаполнитьНачисления(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыИсправленногоДокумента, ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего);
		ЗаполнитьПерерасчеты(ДокументОбъект, МенеджерРасчета);
		
		МенеджерРасчета.НастройкиБухучета.КоэффициентыСреднегоЗаработкаДокумента 
			= УчетСреднегоЗаработка.КоэффициентыРаспределенияСреднегоЗаработкаДокумента(ДокументОбъект, ОписаниеДокумента, ЭтоСреднеЧасовойЗаработок(ДокументОбъект));
		МенеджерРасчета.НастройкиБухучета.КоэффициентыРаспределенияДенежногоСодержания = ДокументОбъект.КоэффициентыРаспределенияДенежногоСодержания.Выгрузить();
		
	Иначе
		ДанныеФормыВДанныеМенеджераРасчета(ДокументОбъект, МенеджерРасчета);
	КонецЕсли;	
	
	ЗаполнитьУдержания(ДокументОбъект, МенеджерРасчета);
	
	МенеджерРасчета.РассчитатьЗарплату();
	
	СброситьПризнакФиксРасчет(МенеджерРасчета, ЗафиксированныеСтрокиОплатыТруда); 
	
	РасчетЗарплатыВДанныeОбъекта(ДокументОбъект, МенеджерРасчета.Зарплата);
КонецПроцедуры

Функция ДанныеДляВременнойРегистрацииНачислений(ДокументОбъект) Экспорт
	
	// Чтобы применить методы, осуществляющие сбор данных для проведения запишем документ.
	ОткрытаТранзакция = ДокументОбъект.НачатьНовуюТранзакцию();
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйДокументОбъект = ДокументОбъект;
		
	// служебное копирование.
	ДокументОбъект.ДополнительныеСвойства.Вставить("МодификацияЗапрещена");
	НовыйДокументОбъект = ДокументОбъект.Скопировать();
	ДокументОбъект.ДополнительныеСвойства.Удалить("МодификацияЗапрещена");
	НовыйДокументОбъект.Дата = ДокументОбъект.Дата;
	// Исключаем дублирование номеров при ручной нумерации
	Если Не ЗначениеЗаполнено(НовыйДокументОбъект.Номер)
		И Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Прав(ДокументОбъект.Номер, 3)) Тогда 
		ГенераторСлучайныхЧисел = Новый ГенераторСлучайныхЧисел(255);
		СлучайныйНомер = СтрЗаменить(ГенераторСлучайныхЧисел.СлучайноеЧисло(0, 99999), Символы.НПП, ""); 
		НовыйДокументОбъект.Номер = "ОТПК-8" + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СлучайныйНомер, 5);
	КонецЕсли;
	
	ВременнаяСсылка = Документы.Отпуск.ПолучитьСсылку();
	НовыйДокументОбъект.УстановитьСсылкуНового(ВременнаяСсылка);
	НовыйДокументОбъект.ДополнительныеСвойства.Вставить("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиИсполнителяЭтапа");
	НовыйДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	ДокументСсылка = НовыйДокументОбъект.Ссылка;
	НовыйДокументОбъект.ДополнительныеСвойства.Удалить("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиИсполнителяЭтапа");
	
	// Сбор данных для проведения
	РеквизитыДляПроведения = Документы.Отпуск.РеквизитыДляПроведения(ДокументСсылка);
	РеквизитыДляПроведения.ДокументРассчитан = Истина;
	ДанныеДляПроведения = Документы.Отпуск.ДанныеДляПроведения(РеквизитыДляПроведения);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ОткрытаТранзакция Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
	ДанныеДляПроведения.Вставить("ДокументСсылка", ДокументСсылка);
	ДанныеДляПроведения.Вставить("ПериодРегистрации", ДокументОбъект.ПериодРегистрации);
	
	ИсправлениеРасчетовБЗК.ДополнитьДанныеДляВременнойРегистрации(ДанныеДляПроведения, ДокументОбъект.ИсправленныйДокумент);
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура ПровестиПоУчетам(ДокументСсылка, РежимПроведения, Отказ, ВидыУчетов = Неопределено, Движения = Неопределено, Объект = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	СтруктураВидовУчета = ПроведениеСервер.СтруктураВидовУчета();
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвиженийПоВидамУчета(РежимПроведения, ДокументСсылка, СтруктураВидовУчета, ВидыУчетов, Движения, Объект, Отказ);
	
	РеквизитыДляПроведения = Документы.Отпуск.РеквизитыДляПроведения(ДокументСсылка);
	ДанныеДляПроведения = ДанныеДляПроведения(РеквизитыДляПроведения, СтруктураВидовУчета);
	
	РезультатИсправления = ИсправлениеДокументовЗарплатаКадры.ПриПроведенииИсправления(ДокументСсылка,
		Движения, РежимПроведения, Отказ, РеквизитыДляПроведения, СтруктураВидовУчета, Объект);
	
	Если РеквизитыДляПроведения.ДокументРассчитан Тогда 
		
		Если СтруктураВидовУчета.ОстальныеВидыУчета Тогда
			
			Если РеквизитыДляПроведения.ПериодыПриостановкиОтпуска.Количество() > 0 Тогда
				Движения.Начисления.ДополнительныеСвойства.Вставить("ОтключитьРегистрациюПерерасчетов");
			КонецЕсли;

			РасчетЗарплатыРасширенный.СформироватьДвиженияНачислений(Движения, Отказ, РеквизитыДляПроведения.Организация, КонецМесяца(РеквизитыДляПроведения.ПериодРегистрации), ДанныеДляПроведения.Начисления, ДанныеДляПроведения.ПоказателиНачислений, Истина);
			РасчетЗарплатыРасширенный.СформироватьДвиженияРаспределенияПоТерриториямУсловиямТруда(Движения, Отказ, РеквизитыДляПроведения.Ссылка, РеквизитыДляПроведения.РаспределениеПоТерриториямУсловиямТруда);
			РасчетЗарплатыРасширенный.СформироватьДвиженияРаспределенияРезультатовНачислений(Движения, Отказ, РеквизитыДляПроведения.Ссылка, РеквизитыДляПроведения.РаспределениеРезультатовНачислений);
			ПерерасчетЗарплаты.СформироватьДвиженияИсходныеДанныхПерерасчетов(Движения, РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.Начисления);
			РасчетЗарплатыРасширенный.СформироватьДвиженияУдержаний(
				Движения, Отказ, РеквизитыДляПроведения.Организация, КонецМесяца(РеквизитыДляПроведения.ПериодРегистрации), ДанныеДляПроведения.Удержания, ДанныеДляПроведения.ПоказателиУдержаний);
			ИсполнительныеЛисты.СформироватьУдержанияПоИсполнительнымДокументам(Движения, ДанныеДляПроведения.УдержанияПоИсполнительнымДокументам);
			РасчетЗарплатыРасширенный.СформироватьДвиженияУдержанийДоПределаПоСотрудникам(Движения, Отказ, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.УдержанияДоПределаПоСотрудникам);
			РасчетЗарплатыРасширенный.СформироватьЗадолженностьПоУдержаниямФизическихЛиц(Движения, ДанныеДляПроведения.ЗадолженностьПоУдержаниям);
			
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
				Модуль.СформироватьДвиженияНачислений(Движения, Отказ, ДанныеДляПроведения, РеквизитыДляПроведения.ПериодРегистрации);
			КонецЕсли;
			
			ПроверитьПересечениеФактическогоПериодаДействия(ДокументСсылка, Отказ);

			// Заполним описание данных для проведения в учете начисленной зарплаты.
			ДанныеДляПроведенияУчетЗарплаты = ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения();
			ДанныеДляПроведенияУчетЗарплаты.Движения 				= Движения;
			ДанныеДляПроведенияУчетЗарплаты.Организация 			= РеквизитыДляПроведения.Организация;
			ДанныеДляПроведенияУчетЗарплаты.ПериодРегистрации 		= РеквизитыДляПроведения.ПериодРегистрации;
			ДанныеДляПроведенияУчетЗарплаты.ПланируемаяДатаВыплаты	= РеквизитыДляПроведения.ПланируемаяДатаВыплаты;
			ДанныеДляПроведенияУчетЗарплаты.ПорядокВыплаты 			= РеквизитыДляПроведения.ПорядокВыплаты;
			ДанныеДляПроведенияУчетЗарплаты.ДниОтпускаАвансом 		= ДанныеДляПроведения.ДниОтпускаАвансом;
			ДанныеДляПроведенияУчетЗарплаты.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
			
			// - Регистрация начислений в учете начислений и удержаний.
			УчетНачисленнойЗарплаты.ЗарегистрироватьНачисления(ДанныеДляПроведенияУчетЗарплаты, Отказ, ДанныеДляПроведения.НачисленияПоСотрудникам, Неопределено);
			УчетНачисленнойЗарплаты.ЗарегистрироватьОтработанноеВремя(ДанныеДляПроведенияУчетЗарплаты, Отказ, ДанныеДляПроведения.ОтработанноеВремяПоСотрудникам, Истина);
			
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
				Модуль.ЗарегистрироватьНачисленияУдержания(Движения, Отказ, ДанныеДляПроведения, РеквизитыДляПроведения.ПериодРегистрации, 
					РеквизитыДляПроведения.ПорядокВыплаты, РеквизитыДляПроведения.ПланируемаяДатаВыплаты);
				Модуль.ЗарегистрироватьОтработанноеВремя(Движения, Отказ, ДанныеДляПроведения, РеквизитыДляПроведения.ПериодРегистрации, РеквизитыДляПроведения.ПорядокВыплаты);
			КонецЕсли;
			
			// - Регистрация бухучета начислений и удержаний, выполняется до вызова регистрации доходов в учете НДФЛ.
			ОтражениеЗарплатыВБухучетеРасширенный.ЗарегистрироватьНачисленияУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ,
				ДанныеДляПроведения.НачисленияПоСотрудникам, ДанныеДляПроведения.УдержанияПоСотрудникам, Неопределено);
						
			// - Регистрация бухучета займов.
			ОтражениеЗарплатыВБухучетеРасширенный.ЗарегистрироватьНачисленияУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ,
				Неопределено, ДанныеДляПроведения.УдержанияЗаймов, Неопределено);
						
			// Подготовка данных для регистрации удержаний, НДФЛ и Корректировок выплаты в учете начисленной зарплаты.
			УчетНачисленнойЗарплаты.СоздатьВТРаспределениеНачисленийТекущегоДокумента(ДанныеДляПроведенияУчетЗарплаты);
						
			// - Регистрация материальной выгоды в учете НДФЛ.
			ДатаОперацииПоНалогам = НачалоДня(РеквизитыДляПроведения.ДатаНачалаСобытия) - 1;
			УчетНДФЛ.СформироватьДоходыНДФЛПоКодамДоходовИзТаблицыЗначений(Движения, Отказ, РеквизитыДляПроведения.Организация, ДатаОперацииПоНалогам, ДанныеДляПроведения.МатериальнаяВыгода, Ложь, , ДокументСсылка, РеквизитыДляПроведения.ДоходПолученНаТерриторииРФ);
						
			// НДФЛ
			// Если ранее при начислении авансов НДФЛ был удержан и перечислен, соответствующие ему доходы следует зачесть при
			// начислении зарплаты за тот же месяц.
			ЗасчитыватьДанныеАвансов = РеквизитыДляПроведения.РассчитатьЗарплату;	
			Если ЗасчитыватьДанныеАвансов
				И РезультатИсправления.ИсправлениеВТекущемПериоде 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДляПроведения.ИсправленныйДокумент, "РассчитатьЗарплату") Тогда
					 ЗасчитыватьДанныеАвансов = Ложь
			КонецЕсли;
			УчетНДФЛРасширенный.ЗарегистрироватьДоходыИСуммыНДФЛПоВременнойТаблицеНачислений(
				РеквизитыДляПроведения.Ссылка, Движения, Отказ, РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.Дата, РеквизитыДляПроведения.ПериодРегистрации, РеквизитыДляПроведения.ПорядокВыплаты, РеквизитыДляПроведения.ПланируемаяДатаВыплаты, ДанныеДляПроведения, Истина, Истина, РеквизитыДляПроведения.ДоходПолученНаТерриторииРФ, , , "ВТНачисленияДляУчетаДоходовНДФЛ", ЗасчитыватьДанныеАвансов);
				
			// КорректировкиВыплаты
			РасчетЗарплатыРасширенный.СформироватьДвиженияКорректировкиВыплатыПоВременнойТаблицеНачислений(Движения, Отказ, РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации, РеквизитыДляПроведения.ПорядокВыплаты, ДанныеДляПроведения, Истина, Истина);
			
			// Займы
			// - взаиморасчеты по займам
			ЗаймыСотрудникам.ЗарегистрироватьВзаиморасчетыПоЗаймам(Движения, ДанныеДляПроведения.ВзаиморасчетыПоЗаймам, Отказ);
			
			УчетНДФЛ.СформироватьНалогиВычеты(Движения, Отказ, РеквизитыДляПроведения.Организация, ДатаОперацииПоНалогам, ДанныеДляПроведения.НалогНаМатериальнуюВыгоду);
			
			// - Регистрация удержаний в учете начисленной зарплаты.
			УчетНачисленнойЗарплаты.ПодготовитьДанныеНДФЛКРегистрации(ДанныеДляПроведения.НалогНаМатериальнуюВыгоду, РеквизитыДляПроведения.Организация, ДатаОперацииПоНалогам);
			УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ, ДанныеДляПроведения.УдержанияПоСотрудникам);
			УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьЗаймы(ДанныеДляПроведенияУчетЗарплаты, Отказ,
				ДанныеДляПроведения.УдержанияЗаймов, ДанныеДляПроведения.НалогНаМатериальнуюВыгоду);	
			
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
				Модуль.ЗарегистрироватьКорректировкиДляРасчетаСохраняемогоДенежногоСодержания(ДанныеДляПроведения.КорректировкиДляРегистрацииДенежногоСодержания, РеквизитыДляПроведения.ПериодРасчетаСреднегоЗаработкаНачало, РеквизитыДляПроведения.ПериодРасчетаСреднегоЗаработкаОкончание);
				Модуль.ЗарегистрироватьНачисленияСоставМесячногоДенежногоСодержания(Движения, Отказ, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.СоставМесячногоДенежногоСодержания);
			КонецЕсли;
			
			// - Регистрация бухучета НДФЛ.
			ОтражениеЗарплатыВБухучетеРасширенный.ЗарегистрироватьНачисленияУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ,
				Неопределено, Неопределено, ДанныеДляПроведения.НДФЛПоСотрудникам);
			Если ЗасчитыватьДанныеАвансов Тогда
				УчетНачисленнойЗарплатыРасширенный.ЗаполнитьЗачетАвансаНДФЛВНаборахЗаписей(Движения, РеквизитыДляПроведения.ПериодРегистрации);
			КонецЕсли;
						
			// - Регистрация бухучета займов.
			ОтражениеЗарплатыВБухучетеРасширенный.ЗарегистрироватьНачисленияУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ,
				Неопределено, Неопределено, ДанныеДляПроведения.НалогНаМатериальнуюВыгоду);

			// - регистрация пособий
			УчетСтраховыхВзносов.СформироватьПособия(Движения, Отказ, РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.Пособия, Неопределено);
			
		КонецЕсли;
		
		Если СтруктураВидовУчета.СтраховыеВзносы Тогда
			// - Регистрация начислений в доходах для страховых взносов.
			УчетСтраховыхВзносов.СформироватьСведенияОДоходахСтраховыеВзносы(Движения, Отказ, РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.МенеджерВременныхТаблиц, Ложь, Истина, РеквизитыДляПроведения.Ссылка);
		КонецЕсли;
		
		Если СтруктураВидовУчета.ДанныеДляРасчетаСреднего Тогда
			// Корректировки данных для среднего заработка.
			ПараметрыКорректировок = УчетСреднегоЗаработка.ДополнительныеПараметрыЗаписиКорректировокОбщегоСреднегоЗаработка();
			ПараметрыКорректировок.Организация = РеквизитыДляПроведения.Организация;
			ПараметрыКорректировок.ФизическоеЛицо = РеквизитыДляПроведения.ФизическоеЛицо;
			ПараметрыКорректировок.Сотрудник = РеквизитыДляПроведения.Сотрудник;
			
			УчетСреднегоЗаработка.ЗаписатьКорректировкиОбщегоСреднегоЗаработка(
				УчетСреднегоЗаработка.КорректировкиОбщегоСреднегоЗаработкаДокумента(РеквизитыДляПроведения.Ссылка), 
				РеквизитыДляПроведения.ПериодРасчетаСреднегоЗаработкаНачало, 
				РеквизитыДляПроведения.ПериодРасчетаСреднегоЗаработкаОкончание, 
				ПараметрыКорректировок);
				
				// Учет среднего заработка
			УчетСреднегоЗаработка.ЗарегистрироватьДанныеСреднегоЗаработка(Движения, Отказ, ДанныеДляПроведения.НачисленияДляСреднегоЗаработка);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураВидовУчета.ОстальныеВидыУчета Тогда
		
		ПараметрыДвиженийОтпусков = ОстаткиОтпусков.ПараметрыДляСформироватьДвиженияФактическихОтпусков();
		ПараметрыДвиженийОтпусков.ДатаРегистрации = РеквизитыДляПроведения.Дата;
		ПараметрыДвиженийОтпусков.Начисления = ДанныеДляПроведения.Начисления;
		ПараметрыДвиженийОтпусков.РабочиеПериоды = ДанныеДляПроведения.РабочиеПериодыДляОтпусков;
		ПараметрыДвиженийОтпусков.Основания = ДанныеДляПроведения.ОснованияДляОтпусков;
		ПараметрыДвиженийОтпусков.ПериодНачисления = РеквизитыДляПроведения.ПериодРегистрации;
		
		ДатыНачалаКомпенсаций = Новый Соответствие;
		ДатаКомпенсации = Документы.Отпуск.ДатаКомпенсацииОтпуска(РеквизитыДляПроведения.ПланируемаяДатаВыплаты, РеквизитыДляПроведения.ПериодРегистрации);
		ДатыНачалаКомпенсаций.Вставить(РеквизитыДляПроведения.Сотрудник, ДатаКомпенсации);
		ПараметрыДвиженийОтпусков.ДатыНачалаКомпенсаций = ДатыНачалаКомпенсаций;
		
		ОстаткиОтпусков.СформироватьДвиженияФактическихОтпусков(Движения, Отказ, ПараметрыДвиженийОтпусков);
		ОстаткиОтпусков.СформироватьДвиженияПериодовОтпусков(Движения, РеквизитыДляПроведения.Ссылка, ДанныеДляПроведения.ПериодыОтпусков);
		
		СостоянияСотрудников.ЗарегистрироватьСостоянияСотрудников(Движения, РеквизитыДляПроведения.Ссылка, ДанныеСостоянийСотрудника(РеквизитыДляПроведения));
		
		Если РеквизитыДляПроведения.ПредоставитьОтгул Тогда
			ДанныеОбОтгулах = ДанныеОбОтгулах(РеквизитыДляПроведения);
			УчетРабочегоВремениРасширенный.ЗарегистрироватьИПроверитьОстаткиДниЧасыОтгуловСотрудников(Движения, ДанныеОбОтгулах, Отказ);
			УчетОтгулов.ЗарегистрироватьДанныеОбИспользованииОтгулов(Движения, ДанныеДляПроведения.ИспользованиеОтгулов);
		КонецЕсли;
		
		УчетСтажаПФР.ЗарегистрироватьПериодыВУчетеСтажаПФР(Движения, ДанныеДляРегистрацииВУчетаСтажаПФР(РеквизитыДляПроведения.Ссылка)[РеквизитыДляПроведения.Ссылка]);
		
		Если РеквизитыДляПроведения.ОсвобождатьСтавку Тогда
			ЗарплатаКадрыРасширенный.УстановитьВремяРегистрацииДокумента(Движения, РеквизитыДляПроведения.СотрудникиДаты, РеквизитыДляПроведения.Ссылка);
			КадровыйУчетРасширенный.СформироватьДвиженияЗанятостиВременноОсвобожденныхПозицииШтатногоРасписания(
				Движения, РеквизитыДляПроведения.Сотрудник, РеквизитыДляПроведения.ДатаНачалаПериодаОтсутствия, РеквизитыДляПроведения.ДатаОкончанияПериодаОтсутствия, Ложь);
		КонецЕсли;
		
		ОграничениеВзысканий.ЗарегистрироватьДанныеСохраняемогоЗаработка(Движения, Отказ, РеквизитыДляПроведения.ПериодРегистрации, РеквизитыДляПроведения.ПорядокВыплаты);
		
		УчетСреднегоЗаработка.УдалитьПричиныПерерасчетов(РеквизитыДляПроведения.Ссылка, ДополнительныеПараметры);
		ПерерасчетЗарплаты.УдалитьПерерасчетыПоДополнительнымПараметрам(РеквизитыДляПроведения.Ссылка, ДополнительныеПараметры);
		
	КонецЕсли;
	
	ПроведениеРасширенныйСервер.ВыполнитьЗапланированныеКорректировкиДвижений(Движения);
	
	ПроведениеСервер.ЗаписьДвиженийПоУчетам(Движения, СтруктураВидовУчета);
	
КонецПроцедуры

Функция СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры) Экспорт
	
	Если СтруктураВидовУчета.ОстальныеВидыУчета Тогда
		УчетРабочегоВремениРасширенный.СторнироватьДниЧасыОтгуловСотрудников(Движения, ИсправленныйДокумент);
		УчетОтгулов.СторнироватьДанныеОбИспользованииОтгулов(Движения, ИсправленныйДокумент);
	КонецЕсли;
	
	Если (ДополнительныеПараметры.ОтменаДокумента Или ДополнительныеПараметры.ИсправлениеВТекущемПериоде)
		И Не ДополнительныеПараметры.ИсправлениеДоначислением Тогда
		
		// При отмене документа реквизиты для проведения сформированы документом СторнированиеНачислений,
		// их структура отличается от реквизитов для проведения исправленного документа.
		СторнироватьРасчеты = ДополнительныеПараметры.ОтменаДокумента Или ДополнительныеПараметры.РеквизитыДляПроведения.ДокументРассчитан;
		
		Если СтруктураВидовУчета.ДанныеДляРасчетаСреднего И СторнироватьРасчеты Тогда
			УчетСреднегоЗаработка.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент);
		КонецЕсли;
		
		Если СтруктураВидовУчета.СтраховыеВзносы И СторнироватьРасчеты Тогда
			УчетСтраховыхВзносовРасширенный.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ДополнительныеПараметры);
		КонецЕсли;
		
		Если СтруктураВидовУчета.ОстальныеВидыУчета Тогда
			УправлениеШтатнымРасписанием.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент);
		КонецЕсли;
		
		Если СтруктураВидовУчета.ОстальныеВидыУчета И СторнироватьРасчеты Тогда
			
			Если ДополнительныеПараметры.ИсправлениеВТекущемПериоде Тогда
				Если Не ДополнительныеПараметры.Свойство("СторнироватьЗарегистрированноеПриНачисленииАванса")
					И (ДополнительныеПараметры.ОтменаДокумента Или Не ДополнительныеПараметры.РеквизитыДляПроведения.РассчитатьЗарплату)
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсправленныйДокумент, "РассчитатьЗарплату") Тогда
					ДополнительныеПараметры.Вставить("СторнироватьЗарегистрированноеПриНачисленииАванса", Истина)
				КонецЕсли;
				
				Если Не ДополнительныеПараметры.ОтменаДокумента
					И ДополнительныеПараметры.РеквизитыДляПроведения.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
					РеквизитыИсправленного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсправленныйДокумент, "ПорядокВыплаты");
					Если ДополнительныеПараметры.РеквизитыДляПроведения.ПорядокВыплаты <> РеквизитыИсправленного.ПорядокВыплаты Тогда
						УчетНачисленнойЗарплатыРасширенный.ЗапланироватьКопированиеСторноВАванс(Движения);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			РасчетЗарплатыРасширенный.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ДополнительныеПараметры);
			ОтражениеЗарплатыВБухучетеРасширенный.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент);
			УчетНДФЛРасширенный.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ДополнительныеПараметры);
			УчетНачисленнойЗарплатыРасширенный.СторнироватьДвиженияДокумента(Движения, ИсправленныйДокумент, ДополнительныеПараметры);
			
			ИсправлениеДокументовЗарплатаКадры.СторнироватьДвиженияБезСпецификиУчетов(
				Движения, ИсправленныйДокумент, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приказ о предоставлении отпуска.
	КадровыйУчетРасширенный.ДобавитьКомандуПечатиПриказаОПредоставленииОтпуска(КомандыПечати);
	
	Макеты = Метаданные.ОбщиеМакеты;
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеНачисленнойЗарплатыРасширенная,ПолныеПрава,ЧтениеНачисленнойЗарплатыРасширенная", , Ложь) 
		И ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовРасширенная";
		КомандаПечати.Идентификатор = "ПФ_MXL_Т60";
		КомандаПечати.Представление = НСтр("ru = 'Записка - расчет о предоставлении отпуска (Т-60)'");
		КомандаПечати.Порядок = 20;
		КомандаПечати.ФункциональныеОпции = "РаботаВХозрасчетнойОрганизации";
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		
		Макет = Макеты.ПФ_MXL_СправкаДляОплатыОтпускаЧАЭС;
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.Идентификатор  = Макет.Имя;
		КомандаПечати.Представление  = Макет.Представление();
		КомандаПечати.Порядок        = 80;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ЕстьОтпускЧАЭС", Истина);
		
		Макет = Макеты.ПФ_MXL_ОтпускНаПериодЛечения_2024;
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.Идентификатор  = Макет.Имя;
		КомандаПечати.Представление  = Макет.Представление();
		КомандаПечати.Порядок        = 80;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ЕстьОтпускНаПериодЛечения", Истина);
	КонецЕсли;
	
	// Расчет среднего заработка
	УчетСреднегоЗаработка.ДобавитьКомандуПечатиРасчетаСреднегоЗаработка(КомандыПечати, "Документ.Отпуск");
	УчетСреднегоЗаработка.ДобавитьКомандуПечатиРасчетаСреднегоЗаработка0504425(КомандыПечати, "Документ.Отпуск");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульГосударственнаяСлужба = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		МодульГосударственнаяСлужба.ДобавитьКомандыПечатиСохраняемогоДенежногоСодержания(КомандыПечати);
	КонецЕсли; 
	
	// Подробный расчет начислений.
	РасчетЗарплатыРасширенный.ДобавитьКомандуПечатиПодробногоРасчетаНачислений(КомандыПечати);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	МенеджерПечати = Документы.Отпуск;
	УправлениеПечатьюБЗК.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, МенеджерПечати);
	
	Обработки.ПечатьРасчетаСреднегоЗаработка.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

Процедура ПриФормированииПечатнойФормы(КонтекстПечати) Экспорт
	
	Макеты = Метаданные.ОбщиеМакеты;
	Если КонтекстПечати.МетаданныеМакета = Макеты.ПФ_MXL_СправкаДляОплатыОтпускаЧАЭС Тогда
		ПриПечатиСправкиДляОплатыОтпускаЧАЭС(КонтекстПечати);
	ИначеЕсли КонтекстПечати.МетаданныеМакета = Макеты.ПФ_MXL_ОтпускНаПериодЛечения_2024 Тогда
		ПриПечатиОтпускаНаПериодЛечения_2024(КонтекстПечати);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия          = "3.1.30.34";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор   = Новый УникальныйИдентификатор("9d6378e1-44f6-11ef-812c-4cedfb43b11a");
	Обработчик.Процедура       = "ДокументОтпускРасширенный.ЗаполнитьФлажкиНаличияВидовОтпусковПриОбновлении";
	Обработчик.Комментарий     = НСтр("ru = 'Заполнение флажков наличия видов дополнительных отпусков.'");
	
КонецПроцедуры

// Обновление флажков наличия видов отпусков.
//
// Параметры:
//   ПараметрыОбновления - Структура - Параметры отложенного обновления.
//
Процедура ЗаполнитьФлажкиНаличияВидовОтпусковПриОбновлении(ПараметрыОбновления = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьОтпускЧАЭС) КАК ЕстьОтпускЧАЭС,
	|	МАКСИМУМ(ВложенныйЗапрос.ЕстьОтпускНаПериодЛечения) КАК ЕстьОтпускНаПериодЛечения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Шапка.Ссылка КАК Ссылка,
	|		ИСТИНА КАК ЕстьОтпускЧАЭС,
	|		ЛОЖЬ КАК ЕстьОтпускНаПериодЛечения
	|	ИЗ
	|		Документ.Отпуск.ДополнительныеОтпуска КАК ТабличнаяЧасть
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Отпуск КАК Шапка
	|			ПО ТабличнаяЧасть.Ссылка = Шапка.Ссылка
	|				И (Шапка.ЕстьОтпускЧАЭС = ЛОЖЬ)
	|	ГДЕ
	|		ТабличнаяЧасть.ВидОтпуска = &ВидОтпускаЧАЭС
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Шапка.Ссылка,
	|		ЛОЖЬ,
	|		ИСТИНА
	|	ИЗ
	|		Документ.Отпуск.ДополнительныеОтпуска КАК ТабличнаяЧасть
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Отпуск КАК Шапка
	|			ПО ТабличнаяЧасть.Ссылка = Шапка.Ссылка
	|				И (Шапка.ЕстьОтпускНаПериодЛечения = ЛОЖЬ)
	|	ГДЕ
	|		ТабличнаяЧасть.ВидОтпуска = &ВидОтпускаСКЛ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка";
	ВидОтпускаЧАЭС = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускПострадавшимВАварииЧАЭС");
	ВидОтпускаСКЛ  = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаСанаторноКурортноеЛечение");
	Если Не ЗначениеЗаполнено(ВидОтпускаЧАЭС) И Не ЗначениеЗаполнено(ВидОтпускаСКЛ) Тогда
		Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидОтпускаЧАЭС) Тогда
		Запрос.УстановитьПараметр("ВидОтпускаЧАЭС", ВидОтпускаЧАЭС);
	Иначе
		Запрос.УстановитьПараметр("ВидОтпускаЧАЭС", 0);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидОтпускаСКЛ) Тогда
		Запрос.УстановитьПараметр("ВидОтпускаСКЛ", ВидОтпускаСКЛ);
	Иначе
		Запрос.УстановитьПараметр("ВидОтпускаСКЛ", 0);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ЕстьОтпускЧАЭС            = Выборка.ЕстьОтпускЧАЭС;
		ДокументОбъект.ЕстьОтпускНаПериодЛечения = Выборка.ЕстьОтпускНаПериодЛечения;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
	КонецЦикла;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

Процедура ЗаполнитьДниОтпускаАвансом(ДокументСсылка, ДанныеДляПроведения, Сторнирование = Ложь) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Или ТипЗнч(ДокументСсылка) <> Тип("ДокументСсылка.Отпуск") Тогда 
		ДниОтпускаАвансом = ОтражениеЗарплатыВУчете.НоваяТаблицаДнейОтпускаАвансом();
		ДанныеДляПроведения.Вставить("ДниОтпускаАвансом", ДниОтпускаАвансом);	
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Сторнирование", Сторнирование);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Отпуск.ВидРасчетаОсновногоОтпуска КАК Начисление,
	               |	Отпуск.КоличествоДнейОсновногоОтпускаАвансом КАК КоличествоДнейАвансом,
	               |	&Сторнирование КАК Сторно
	               |ПОМЕСТИТЬ ВТДниОтпускаАвансом
	               |ИЗ
	               |	Документ.Отпуск КАК Отпуск
	               |ГДЕ
	               |	Отпуск.Ссылка = &Ссылка
	               |	И Отпуск.ВидРасчетаОсновногоОтпуска <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтпускДополнительныеОтпуска.ВидРасчета,
	               |	ОтпускДополнительныеОтпуска.КоличествоДнейАвансом,
	               |	&Сторнирование
	               |ИЗ
	               |	Документ.Отпуск.ДополнительныеОтпуска КАК ОтпускДополнительныеОтпуска
	               |ГДЕ
	               |	ОтпускДополнительныеОтпуска.Ссылка = &Ссылка
	               |	И ОтпускДополнительныеОтпуска.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОтпускОтпускаАвансомПерерасчет.ВидРасчета,
	               |	ОтпускОтпускаАвансомПерерасчет.КоличествоДнейАвансом,
	               |	ИСТИНА
	               |ИЗ
	               |	Документ.Отпуск.ОтпускаАвансомПерерасчет КАК ОтпускОтпускаАвансомПерерасчет
	               |ГДЕ
	               |	ОтпускОтпускаАвансомПерерасчет.Ссылка = &Ссылка
	               |	И ОтпускОтпускаАвансомПерерасчет.ВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
	               |	И НЕ &Сторнирование
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДниОтпускаАвансом.Начисление КАК Начисление,
	               |	ОтпускНачисления.Начисление КАК НачислениеРКСН
	               |ПОМЕСТИТЬ ВТНачисленияРКСН
	               |ИЗ
	               |	ВТДниОтпускаАвансом КАК ДниОтпускаАвансом
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Отпуск.Начисления КАК ОтпускНачисления
	               |		ПО (ОтпускНачисления.Ссылка = &Ссылка)
	               |			И ДниОтпускаАвансом.Начисление = ОтпускНачисления.Начисление.ОсновнойВидРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДниОтпускаАвансом.Начисление КАК Начисление,
	               |	ДниОтпускаАвансом.КоличествоДнейАвансом КАК КоличествоДнейАвансом,
	               |	ДниОтпускаАвансом.Сторно КАК Сторно
	               |ИЗ
	               |	ВТДниОтпускаАвансом КАК ДниОтпускаАвансом
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НачисленияРКСН.НачислениеРКСН,
	               |	ДниОтпускаАвансом.КоличествоДнейАвансом,
	               |	ДниОтпускаАвансом.Сторно
	               |ИЗ
	               |	ВТДниОтпускаАвансом КАК ДниОтпускаАвансом
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияРКСН КАК НачисленияРКСН
	               |		ПО ДниОтпускаАвансом.Начисление = НачисленияРКСН.Начисление";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДниОтпускаАвансом = ОтражениеЗарплатыВУчете.НоваяТаблицаДнейОтпускаАвансом();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДниОтпускаАвансом.Добавить(), Выборка);
	КонецЦикла;
	
	ДниОтпускаАвансом.Свернуть("Начисление, Сторно", "КоличествоДнейАвансом");
	
	ДанныеДляПроведения.Вставить("ДниОтпускаАвансом", ДниОтпускаАвансом);	
	
КонецПроцедуры

Функция ОписаниеТаблицРазовыхНачислений() Экспорт 
	ОписаниеТаблиц = Новый Массив;
	ОписаниеТаблицы = ДокументыРазовыхНачислений.НовыйОписаниеТаблицыРазовыхНачислений();
	ОписаниеТаблиц.Добавить(ОписаниеТаблицы);
	ОписаниеТаблицы.ИмяТаблицы = "Начисления";
	ОписаниеТаблицы.ИмяПоляВидРасчета = "Начисление";
	
	Возврат ОписаниеТаблиц;
КонецФункции	

Функция ПараметрыСторнируемогоДокумента(ДокументСсылка) Экспорт
	
	Свойства = Документы.Отпуск.ПараметрыИсправляемогоДокумента(ДокументСсылка);
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ДатаВыплаты", "ПланируемаяДатаВыплаты");
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(Свойства, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты));
	
	Параметры = ИсправлениеДокументовЗарплатаКадры.ПараметрыСторнируемогоДокумента(ДокументСсылка, Свойства);
	
	ОписаниеТаблицы = ИсправлениеДокументовЗарплатаКадры.НовыйОписаниеТаблицыНачислений();
	ОписаниеТаблицы.ИмяТаблицы = "Начисления";
	ОписаниеТаблицы.ИмяПоляВидРасчета = "Начисление";
	Параметры.ТаблицыНачислений.Добавить(ОписаниеТаблицы);
	
	ОписаниеТаблицы = ИсправлениеДокументовЗарплатаКадры.НовыйОписаниеТаблицыНачислений();
	ОписаниеТаблицы.ИмяТаблицы = "УправленческиеНачисления";
	ОписаниеТаблицы.ИмяПоляВидРасчета = "Начисление";
	Параметры.ТаблицыНачислений.Добавить(ОписаниеТаблицы);
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Команда = Команды.Добавить();
	Команда.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.Отпуск");
	Команда.Представление = НСтр("ru = 'Рассылка приказов (Т-6)'");
	Команда.Назначение = РассылкаДокументов.ВидыНазначенияКомандыРассылки().ДляСписка;
	Команда.РежимЗаписи = РассылкаДокументов.РежимыЗаписиОбъектаПередВыполнениемКомандыРассылки().Проводить;
	Команда.ПечатныеФормы = РассылкаДокументовКлиентСервер.НоваяПечатнаяФорма();
	Команда.ПечатныеФормы.Идентификатор = "ПФ_MXL_Т6";
	Команда.ТемаПисьма = НСтр("ru = 'Приказ о предоставлении отпуска (Т-6)'");
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не в сообщении пользователю.
	Команда.ТекстПисьма = 
		НСтр("ru = 'Добрый день!
			 |
			 |Во вложении приказ о вашем отпуске (форма Т-6).
			 |Пожалуйста, распечатайте его, поставьте свою подпись в обозначенных местах и пришлите нам фотографию или скан-копию в ответ на это письмо.
			 |
			 |С уважением, Администрация.'");
	// АПК:374-вкл
	
КонецПроцедуры

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	Команда = СозданиеНаОсновании.ДобавитьКомандуСозданияНаОсновании(
		КомандыСозданияНаОсновании, Метаданные.Документы.СведенияДляОплатыОтпускаСФР);
	Если Команда <> Неопределено Тогда
		Команда.РежимЗаписи = "Проводить";
		Команда.ВидимостьВФормах = "ФормаДокумента";
		Команда.МножественныйВыбор = Ложь;
		Команда.ИмяФормы = "Документ.СведенияДляОплатыОтпускаСФР.ФормаОбъекта";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "ЕстьОтпускНаПериодЛечения", Истина);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.БизнесПроцессыИЗадачи") Тогда
		МодульБизнесПроцессыЗадание = ОбщегоНазначения.ОбщийМодуль("БизнесПроцессы.Задание");
		МодульБизнесПроцессыЗадание.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	КонецЕсли;
КонецПроцедуры

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВКоллекциюКомандуСозданияДокументаПоМетаданнымДокумента(
		КомандыСозданияДокументов, Метаданные.Документы.Отпуск);
	
КонецФункции

Функция ДанныеДляПроведения(РеквизитыДляПроведения, СтруктураВидовУчета = Неопределено) Экспорт 
	
	Если СтруктураВидовУчета = Неопределено Тогда
		СтруктураВидовУчета = ПроведениеСервер.СтруктураВидовУчета();
		Для Каждого ВидУчета Из СтруктураВидовУчета Цикл
			СтруктураВидовУчета[ВидУчета.Ключ] = Истина;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеДляПроведения = РасчетЗарплаты.СоздатьДанныеДляПроведенияНачисленияЗарплаты();
	
	Если СтруктураВидовУчета.ОстальныеВидыУчета Или СтруктураВидовУчета.СтраховыеВзносы Тогда
		РасчетЗарплатыРасширенный.ЗаполнитьНачисления(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, "Начисления,НачисленияПерерасчет,НачисленияПерерасчетНулевыеСторно", "Ссылка.ПериодРегистрации");
		Если РеквизитыДляПроведения.ДокументРассчитан Тогда
			ОтражениеЗарплатыВБухучете.СоздатьВТНачисленияСДаннымиЕНВД(РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации, ДанныеДляПроведения.МенеджерВременныхТаблиц, ДанныеДляПроведения.НачисленияПоСотрудникам);
		КонецЕсли;
	КонецЕсли;
	
	Если СтруктураВидовУчета.ОстальныеВидыУчета Тогда
			
		Если РеквизитыДляПроведения.ДокументРассчитан Тогда
			
			РасчетЗарплатыРасширенный.ЗаполнитьУдержания(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка);
			РасчетЗарплаты.ЗаполнитьСписокФизическихЛиц(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, РеквизитыДляПроведения.ИсправленныйДокумент);
			РасчетЗарплаты.ЗаполнитьДанныеНДФЛ(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка);
			РасчетЗарплатыРасширенный.ЗаполнитьДанныеКорректировкиВыплаты(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка);
			ЗаполнитьСведенияОПособиях(РеквизитыДляПроведения, ДанныеДляПроведения);
			РасчетЗарплатыРасширенный.ЗаполнитьПогашениеЗадолженностиПоУдержаниям(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, РеквизитыДляПроведения.ПериодРегистрации);
				
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
				ПараметрыУправленческаяЗарплата = Модуль.ДополнительныеПараметрыПодготовкиДанныхДляПроведения();
				ПараметрыУправленческаяЗарплата.ПолеДатыДействия = "Ссылка.ПериодРегистрации"; 
				ПараметрыУправленческаяЗарплата.ПолеВидаНачисления = "Начисление"; 
				Модуль.ПриПодготовкеДанныхДляПроведенияДокументаРасчетаЗарплаты(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, ПараметрыУправленческаяЗарплата);
			КонецЕсли;
			
			ДатаОперации = Мин(КонецМесяца(РеквизитыДляПроведения.ПериодРегистрации), РеквизитыДляПроведения.ДатаНачалаСобытия - 1);
			ЗаймыСотрудникам.ЗаполнитьДанныеДляПроведенияПоЗаймам(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, ДатаОперации, "Ссылка.ПериодРегистрации");
			
			Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
				Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
				КорректировкиДляРегистрацииДенежногоСодержания = Модуль.СведенияОКорректировкахДляРегистрацииДенежногоСодержанияДокумента(РеквизитыДляПроведения.Ссылка);
				ДанныеДляПроведения.Вставить("КорректировкиДляРегистрацииДенежногоСодержания", КорректировкиДляРегистрацииДенежногоСодержания);
				
				СоставМесячногоДенежногоСодержания = Модуль.СведенияОСоставеМесячногоДенежногоСодержания(РеквизитыДляПроведения.Ссылка, "ДенежноеСодержание,ДенежноеСодержаниеФактическиеНачисления");
				ДанныеДляПроведения.Вставить("СоставМесячногоДенежногоСодержания", СоставМесячногоДенежногоСодержания);
			КонецЕсли;
			
		КонецЕсли;
		
		ДанныеДляПроведения.Вставить("РабочиеПериодыДляОтпусков", РабочиеПериодыДляОтпусков(РеквизитыДляПроведения.Ссылка));
		ДанныеДляПроведения.Вставить("ОснованияДляОтпусков", ОснованияДляОтпусков(РеквизитыДляПроведения.Ссылка));
		
		ЗаполнитьДниОтпускаАвансом(РеквизитыДляПроведения.Ссылка, ДанныеДляПроведения);
		ЗаполнитьПериодыОтпусков(РеквизитыДляПроведения, ДанныеДляПроведения);
		ЗаполнитьДанныеОбИспользованииОтгулов(РеквизитыДляПроведения, ДанныеДляПроведения);
		
	КонецЕсли;
	
	Если РеквизитыДляПроведения.ДокументРассчитан И СтруктураВидовУчета.ДанныеДляРасчетаСреднего Тогда
		ДополнительныеПараметры = УчетСреднегоЗаработка.ДополнительныеПараметрыРегистрацииДанныхСреднегоЗаработка();
		ДополнительныеПараметры.МесяцНачисления = "Ссылка.ПериодРегистрации";
		УчетСреднегоЗаработка.ЗаполнитьТаблицыДляРегистрацииДанныхСреднегоЗаработка(ДанныеДляПроведения, РеквизитыДляПроведения.Ссылка, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Процедура ПроверитьРаботающих(ДокументОбъект, Отказ) Экспорт
	
	Если НЕ (ДокументОбъект.ПредоставитьОсновнойОтпуск 
		Или ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска
		Или ДокументОбъект.ПредоставитьДополнительныйОтпуск) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПроверяемогоПериода 			= '00010101';
	ОкончаниеПроверяемогоПериода 		= '00010101';
	
	Если ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда	
		НачалоПроверяемогоПериода = ДокументОбъект.ПериодРегистрации;
		ОкончаниеПроверяемогоПериода = КонецМесяца(ДокументОбъект.ПериодРегистрации);
		Если ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) Тогда
			ИсходныйДокумент = ИсправлениеДокументовЗарплатаКадры.ПервыйДокументЦепочкиИсправлений(ДокументОбъект.ИсправленныйДокумент);
			НачалоПроверяемогоПериода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "ПериодРегистрации"); 
			ОкончаниеПроверяемогоПериода = КонецМесяца(НачалоПроверяемогоПериода);
		КонецЕсли;	
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		
		Если НЕ ЗначениеЗаполнено(НачалоПроверяемогоПериода) Тогда
			НачалоПроверяемогоПериода = ДокументОбъект.ДатаНачалаОсновногоОтпуска;
		ИначеЕсли ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) Тогда
			НачалоПроверяемогоПериода = Мин(НачалоПроверяемогоПериода, ДокументОбъект.ДатаНачалаОсновногоОтпуска);
		КонецЕсли;
		
		ОкончаниеПроверяемогоПериода = Макс(ОкончаниеПроверяемогоПериода, ДокументОбъект.ДатаОкончанияОсновногоОтпуска);
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда
		Для каждого ДополнительныйОтпуск Из ДокументОбъект.ДополнительныеОтпуска Цикл
			
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) Тогда
				
				Если НЕ ЗначениеЗаполнено(НачалоПроверяемогоПериода) Тогда
					НачалоПроверяемогоПериода = ДополнительныйОтпуск.ДатаНачала;
				Иначе
					НачалоПроверяемогоПериода = Мин(НачалоПроверяемогоПериода, ДополнительныйОтпуск.ДатаНачала);
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) Тогда
				ОкончаниеПроверяемогоПериода = Макс(ОкончаниеПроверяемогоПериода, ДополнительныйОтпуск.ДатаОкончания);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияРабочихМестВОрганизацийПоВременнойТаблице();
	ПараметрыПолученияСотрудниковОрганизаций.Организация 				= ДокументОбъект.Организация;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода				= НачалоПроверяемогоПериода;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода			= ОкончаниеПроверяемогоПериода;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ 	= Неопределено;
	
	КадровыйУчет.ПроверитьРаботающихСотрудников(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОбъект.Сотрудник),
		ПараметрыПолученияСотрудниковОрганизаций,
		Отказ,
		Новый Структура("ИмяПоляСотрудник, ИмяОбъекта", "Сотрудник", "Объект")
	);
	
КонецПроцедуры

Функция ДанныеСостоянийСотрудника(РеквизитыДляПроведения) Экспорт 
	
	ДанныеСостояний = СостоянияСотрудников.ПустаяТаблицаДанныхСостоянийСотрудника();
	
	Если РеквизитыДляПроведения.ПредоставитьОсновнойОтпуск Тогда
		ПериодыНачислений = Новый Массив;
		ПериодОтпуска = Новый Структура;
		ПериодОтпуска.Вставить("ДатаНачалаПериода", РеквизитыДляПроведения.ДатаНачалаОсновногоОтпуска);
		ПериодОтпуска.Вставить("ДатаОкончанияПериода", РеквизитыДляПроведения.ДатаОкончанияОсновногоОтпуска);
		ПериодыНачислений.Добавить(ПериодОтпуска);
		Если РеквизитыДляПроведения.ПериодыПриостановкиОтпуска.Количество()> 0 Тогда
			ПериодыНачислений = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодОтпуска, РеквизитыДляПроведения.ПериодыПриостановкиОтпуска);
		КонецЕсли;
		Для Каждого ПериодНачисления Из ПериодыНачислений Цикл
			НоваяСтрока = ДанныеСостояний.Добавить();
			НоваяСтрока.Сотрудник = РеквизитыДляПроведения.Сотрудник;
			НоваяСтрока.Состояние = Перечисления.СостоянияСотрудника.ОтпускОсновной;
			НоваяСтрока.Начало = ПериодНачисления.ДатаНачалаПериода;
			НоваяСтрока.Окончание = ПериодНачисления.ДатаОкончанияПериода;
			НоваяСтрока.ВидВремени = РеквизитыДляПроведения.ВидВремени;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыДляПроведения.ПредоставитьДополнительныйОтпуск Тогда
		Для Каждого СтрокаТаблицы Из РеквизитыДляПроведения.ДополнительныеОтпуска Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаНачала) 
				И Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
				// Если не заполнен период, то это - компенсация.
				Продолжить;
			КонецЕсли;
			ПериодыНачисленияДопОтпусков = Новый Массив;
			ПериодДопОтпуска = Новый Структура;
			ПериодДопОтпуска.Вставить("ДатаНачалаПериода", СтрокаТаблицы.ДатаНачала);
			ПериодДопОтпуска.Вставить("ДатаОкончанияПериода", СтрокаТаблицы.ДатаОкончания);
			ПериодыНачисленияДопОтпусков.Добавить(ПериодДопОтпуска);
			Если РеквизитыДляПроведения.ПериодыПриостановкиОтпуска.Количество() > 0 Тогда
				ПериодыНачисленияДопОтпусков = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодДопОтпуска, РеквизитыДляПроведения.ПериодыПриостановкиОтпуска);
			КонецЕсли;
			Для Каждого ПериодНачисления Из ПериодыНачисленияДопОтпусков Цикл
				НоваяСтрока = ДанныеСостояний.Добавить();
				НоваяСтрока.Сотрудник = РеквизитыДляПроведения.Сотрудник;
				НоваяСтрока.Состояние = СостоянияСотрудников.СостояниеПоВидуОтпуска(СтрокаТаблицы.ВидОтпуска);
				НоваяСтрока.Начало = ПериодНачисления.ДатаНачалаПериода;
				НоваяСтрока.Окончание = ПериодНачисления.ДатаОкончанияПериода;
				НоваяСтрока.ВидВремени = СтрокаТаблицы.ВидВремени;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыДляПроведения.ПредоставитьОтгул Тогда
		НоваяСтрока = ДанныеСостояний.Добавить();
		НоваяСтрока.Сотрудник = РеквизитыДляПроведения.Сотрудник;
		НоваяСтрока.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияСотрудника.ДополнительныеВыходныеДниНеоплачиваемые");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПериодОтгула(РеквизитыДляПроведения));
	КонецЕсли;
	
	Возврат ДанныеСостояний;
	
КонецФункции

Функция ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, ПоСтатьямФинансирования = Ложь, ИмяМакета = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	СоздатьВТКадровыеДанныеСотрудниковДокумента(Запрос);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуск.Сотрудник КАК Сотрудник,
	|	Отпуск.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	Отпуск.Ссылка КАК Ссылка,
	|	Отпуск.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА НЕ ОтпускаСотрудников.Дата ЕСТЬ NULL
	|			ТОГДА ОтпускаСотрудников.Дата
	|		КОГДА Отпуск.ДатаПервичногоДокумента <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Отпуск.ДатаПервичногоДокумента
	|		ИНАЧЕ Отпуск.Дата
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА НЕ ОтпускаСотрудников.Номер ЕСТЬ NULL
	|			ТОГДА ОтпускаСотрудников.Номер
	|		КОГДА Отпуск.НомерПервичногоДокумента <> """"
	|			ТОГДА Отпуск.НомерПервичногоДокумента
	|		ИНАЧЕ Отпуск.Номер
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА ОтпускаСотрудников.Номер ЕСТЬ NULL
	|			И Отпуск.НаименованиеПервичногоДокумента <> """"
	|			ТОГДА Отпуск.НаименованиеПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НаименованиеПервичногоДокумента,
	|	Отпуск.ДатаНачалаПериодаОтсутствия КАК ДатаНачалаОтсутствия,
	|	Отпуск.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончанияОтсутствия,
	|	Отпуск.ПериодРасчетаСреднегоЗаработкаНачало КАК НачалоРасчетногоПериода,
	|	Отпуск.ПериодРасчетаСреднегоЗаработкаОкончание КАК ОкончаниеРасчетногоПериода,
	|	Отпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск КАК НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	Отпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск КАК КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	КадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
	|	КадровыеДанныеСотрудников.ТабельныйНомер КАК ТабельныйНомер,
	|	КадровыеДанныеСотрудников.Подразделение КАК Подразделение,
	|	КадровыеДанныеСотрудников.Должность КАК Должность,
	|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
	|	Организации.НаименованиеСокращенное КАК ОрганизацияНаименованиеСокращенное,
	|	Организации.КодПоОКПО КАК КодПоОКПО,
	|	Организации.НаименованиеПолное КАК ОрганизацияНаименованиеПолное
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО Отпуск.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И Отпуск.ДатаНачалаСобытия = КадровыеДанныеСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Отпуск.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускаСотрудников КАК ОтпускаСотрудников
	|		ПО Отпуск.ДокументЗаполнения = ОтпускаСотрудников.Ссылка
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)";
	
	Результат = Запрос.Выполнить();
	
	ДанныеДокументов = Новый Массив;
	
	Если Результат.Пустой() Тогда
		Возврат ДанныеДокументов;
	КонецЕсли;
		
	ТаблицыДанныхОСреднем = УчетСреднегоЗаработка.ТаблицыДанныхОСреднемЗаработке("Отпуск", МассивСсылок);
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДанныеДокумента = Обработки.ПечатьРасчетаСреднегоЗаработка.ПустаяСтруктураДанныхДляПечатиСреднегоЗаработка(); 
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.РеквизитыДокумента, Выборка);
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.КадровыеДанныеСотрудника, Выборка);
		
		ДанныеОНачислениях 	= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОНачислениях"], 		"Ссылка", Выборка.Ссылка);
		ДанныеОВремени 		= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОВремени"], 			"Ссылка", Выборка.Ссылка);
		ДанныеОбИндексации 	= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОбИндексации"], 		"Ссылка", Выборка.Ссылка);
		
		МассивОтпусков = ВидыОтпусковОбъекта(Выборка.Ссылка.ПолучитьОбъект());
		Если ОстаткиОтпусков.СодержатсяТолькоОтпускаПоРабочимДням(МассивОтпусков, Выборка.Сотрудник, Выборка.ДатаНачалаСобытия) Тогда
			СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоШестидневке;
		Иначе
			СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням;
		КонецЕсли;
		
		ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
		ДополнительныеПараметры.Индексации = ДанныеОбИндексации;
		ДополнительныеПараметры.ДатаНачалаСобытия = Выборка.ДатаНачалаСобытия;
		ДополнительныеПараметры.НачалоПериода = Выборка.НачалоРасчетногоПериода;
		ДополнительныеПараметры.ОкончаниеПериода = Выборка.ОкончаниеРасчетногоПериода;
		ДополнительныеПараметры.ПоСтатьямФинансирования = ПоСтатьямФинансирования;
		ДополнительныеПараметры.СпособРасчетаОтпуска = СпособРасчета;

		ДанныеДокумента.ДанныеРасчетаСреднего = УчетСреднегоЗаработкаКлиентСервер.ДанныеДляРасчетаСреднегоЗаработка(ДанныеОНачислениях, ДанныеОВремени, ДополнительныеПараметры);
		
		ДанныеДокумента.ПараметрыРасчета.СпособРасчета = СпособРасчета;
		ДанныеДокумента.ПараметрыРасчета.ИспользоватьСреднеЧасовойЗаработок = Ложь;
		ДанныеДокумента.ПараметрыРасчета.НачалоРасчетногоПериода = Выборка.НачалоРасчетногоПериода;
		ДанныеДокумента.ПараметрыРасчета.ОкончаниеРасчетногоПериода = Выборка.ОкончаниеРасчетногоПериода;
		
		ДанныеДокументов.Добавить(ДанныеДокумента);
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Функция ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка0504425(МассивСсылок) Экспорт
	
	ЗапросПоОрганизациям = Новый Запрос;
	ЗапросПоОрганизациям.УстановитьПараметр("МассивСсылок", МассивСсылок);
	ЗапросПоОрганизациям.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Отпуск.Организация КАК Организация,
	|	Отпуск.ДатаНачалаСобытия КАК ДатаНачалаСобытия
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)";
	
	ТаблицаРезультатовПоОрганизациям = ЗапросПоОрганизациям.Выполнить().Выгрузить();
	
	ОрганизацииИСведенияОНих = ЗарплатаКадрыРасширенный.ПолучитьИННиКППОрганизаций(ТаблицаРезультатовПоОрганизациям);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Отпуск.Ссылка КАК Ссылка,
	|	Отпуск.ДатаНачалаПериодаОтсутствия КАК Дата,
	|	Отпуск.ГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	Отпуск.Бухгалтер КАК Бухгалтер,
	|	Отпуск.Исполнитель КАК Исполнитель,
	|	Отпуск.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель
	|ПОМЕСТИТЬ ВТСотрудникиИПериод
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, "ГлавныйБухгалтер,Бухгалтер,Исполнитель,ОтветственныйИсполнитель", "ВТСотрудникиИПериод");
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ДополнительныеОтпуска.КоличествоДней) КАК КоличествоДней,
	|	ДополнительныеОтпуска.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТДополнительныеОтпуска
	|ИЗ
	|	Документ.Отпуск.ДополнительныеОтпуска КАК ДополнительныеОтпуска
	|ГДЕ
	|	ДополнительныеОтпуска.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДополнительныеОтпуска.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отпуск.Ссылка КАК Ссылка,
	|	Отпуск.ВидРасчетаОсновногоОтпуска КАК Начисление,
	|	Отпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск КАК НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	Отпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск КАК КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	Отпуск.ДатаНачалаПериодаОтсутствия КАК ДатаНачалаОтсутствия,
	|	Отпуск.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончанияОтсутствия,
	|	Отпуск.КоличествоДнейОсновногоОтпуска КАК ДнейОсновногоОтпуска,
	|	ЕСТЬNULL(ВТДополнительныеОтпуска.КоличествоДней, 0) КАК ДнейДополнительногоОтпуска,
	|	Отпуск.КоличествоДнейОсновногоОтпуска + ЕСТЬNULL(ВТДополнительныеОтпуска.КоличествоДней, 0) КАК ДнейОтпускаВсего,
	|	ФИОГлавногоБухгалтера.РасшифровкаПодписи КАК ГлавныйБухгалтерРасшифровкаПодписи,
	|	ФИОБухгалтера.РасшифровкаПодписи КАК БухгалтерРасшифровкаПодписи,
	|	ФИОИсполнителя.РасшифровкаПодписи КАК ИсполнительРасшифровкаПодписи,
	|	ФИООтветственногоИсполнителя.РасшифровкаПодписи КАК ОтветственныйИсполнительРасшифровкаПодписи,
	|	Отпуск.ДолжностьИсполнителя КАК ДолжностьИсполнителя,
	|	Отпуск.ДолжностьОтветственногоИсполнителя КАК ДолжностьОтветственногоИсполнителя,
	|	Отпуск.Основание КАК Основание,
	|	Отпуск.РассчитатьЗарплату КАК РассчитатьЗарплату,
	|	ВЫБОР
	|		КОГДА Отпуск.ИсправленныйДокумент <> ЗНАЧЕНИЕ(Документ.Отпуск.ПустаяСсылка)
	|			ТОГДА Отпуск.ИсправленныйДокумент.ПериодРегистрации
	|		ИНАЧЕ Отпуск.ПериодРегистрации
	|	КОНЕЦ КАК НачалоПериодаРасчетаЗарплаты
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОГлавногоБухгалтера
	|		ПО Отпуск.Ссылка = ФИОГлавногоБухгалтера.Ссылка
	|			И Отпуск.ГлавныйБухгалтер = ФИОГлавногоБухгалтера.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОБухгалтера
	|		ПО Отпуск.Ссылка = ФИОБухгалтера.Ссылка
	|			И Отпуск.Бухгалтер = ФИОБухгалтера.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОИсполнителя
	|		ПО Отпуск.Ссылка = ФИОИсполнителя.Ссылка
	|			И Отпуск.Исполнитель = ФИОИсполнителя.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИООтветственногоИсполнителя
	|		ПО Отпуск.Ссылка = ФИОИсполнителя.Ссылка
	|			И Отпуск.ОтветственныйИсполнитель = ФИООтветственногоИсполнителя.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДополнительныеОтпуска КАК ВТДополнительныеОтпуска
	|		ПО Отпуск.Ссылка = ВТДополнительныеОтпуска.Ссылка
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Отпуск.Ссылка КАК Ссылка,
	|	1 КАК Приоритет,
	|	ВЫБОР
	|		КОГДА Отпуск.ПредоставитьОсновнойОтпуск = ИСТИНА
	|			ТОГДА &ОсновнойОтпуск
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ВидОтпуска,
	|	ВидыОтпусков.Наименование КАК ВидОтпускаНаименование,
	|	Отпуск.Основание КАК Основание
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыОтпусков КАК ВидыОтпусков
	|		ПО (ВидыОтпусков.Ссылка = &ОсновнойОтпуск)
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)
	|	И НЕ ВЫБОР
	|				КОГДА Отпуск.ПредоставитьОсновнойОтпуск = ИСТИНА
	|					ТОГДА &ОсновнойОтпуск
	|				ИНАЧЕ NULL
	|			КОНЕЦ ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтпускДополнительныеОтпуска.Ссылка,
	|	2,
	|	ОтпускДополнительныеОтпуска.ВидОтпуска,
	|	ОтпускДополнительныеОтпуска.ВидОтпуска.Наименование,
	|	ОтпускДополнительныеОтпуска.Основание
	|ИЗ
	|	Документ.Отпуск.ДополнительныеОтпуска КАК ОтпускДополнительныеОтпуска
	|ГДЕ
	|	ОтпускДополнительныеОтпуска.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
	Запрос.УстановитьПараметр("ОсновнойОтпуск", ?(ОсновнойОтпуск = Неопределено, Null, ОсновнойОтпуск));
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаВидыОтпусков = Результаты[Результаты.Количество() - 1].Выбрать();
	Выборка = Результаты[Результаты.Количество() - 2].Выбрать();
	
	ДанныеДокументов = Новый Массив;
	
	БазовыеДанныеДокументов = ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, Истина);
	
	Отбор = Новый Структура("Ссылка");
	
	Для каждого БазовыеДанныеДокумента Из БазовыеДанныеДокументов Цикл
		
		Выборка.Сбросить();
		НаименованиеСобытия = "";
		ОснованиеОтпуска = Новый Массив;
		
		ДанныеДокумента = Обработки.ПечатьРасчетаСреднегоЗаработка.ПустаяСтруктураДанныхДляПечатиСреднегоЗаработка0504425(); 
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, БазовыеДанныеДокумента, , "РеквизитыДокумента");   
		
		// Т.к. структура реквизитов документа в базовых и расширенных данных различается их надо обработать отдельно.
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.РеквизитыДокумента, БазовыеДанныеДокумента.РеквизитыДокумента);
		Отбор.Ссылка = БазовыеДанныеДокумента.РеквизитыДокумента.Ссылка;
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеДокумента.РеквизитыДокумента, Выборка); 
			Пока ВыборкаВидыОтпусков.НайтиСледующий(Отбор) Цикл
				НаименованиеСобытия = НаименованиеСобытия + ?(ЗначениеЗаполнено(НаименованиеСобытия), ", ", "") + ВыборкаВидыОтпусков.ВидОтпускаНаименование;
				Если ОснованиеОтпуска.Найти(ВыборкаВидыОтпусков.Основание) = Неопределено Тогда 
					ОснованиеОтпуска.Добавить(ВыборкаВидыОтпусков.Основание);
				КонецЕсли;
			КонецЦикла;
			ДанныеДокумента.РеквизитыДокумента.НаименованиеСобытия = НаименованиеСобытия;
			ДанныеДокумента.РеквизитыДокумента.Основание = СтрСоединить(ОснованиеОтпуска, ", ");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДанныеДокумента.РеквизитыДокумента, 
			ОрганизацииИСведенияОНих.Получить(БазовыеДанныеДокумента.РеквизитыДокумента.Организация),
			"ИНН, КПП"); 
		
		ДанныеДокументов.Добавить(ДанныеДокумента);
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

Процедура ЗаполнитьДанныеДокументовДляПодробногоРасчетаНачислений(МассивСсылок, ДанныеДокументов) Экспорт
	РасчетЗарплатыРасширенный.ЗаполнитьДанныеДокументовДляПодробногоРасчетаНачислений(МассивСсылок, Документы.Отпуск.ПустаяСсылка().Метаданные().Имя, ДанныеДокументов);	
КонецПроцедуры

Функция НачисленияПоказателиДокументов(МассивСсылок) Экспорт 
	Возврат РасчетЗарплатыРасширенный.НачисленияПоказателиДокументов(МассивСсылок, Документы.Отпуск.ПустаяСсылка().Метаданные().Имя);	
КонецФункции

Функция КоличествоОплачиваемыхДнейПоВидуОтпуска(МассивОтпусков, ВидОтпуска) Экспорт
	
	ДокументыИОплачиваемыеДниПоВидуОтпуска = Новый ТаблицаЗначений;

	ДокументыИОплачиваемыеДниПоВидуОтпуска.Колонки.Добавить("Отпуск", Новый ОписаниеТипов("ДокументСсылка.Отпуск"));
	ДокументыИОплачиваемыеДниПоВидуОтпуска.Колонки.Добавить("КоличествоДней", Новый ОписаниеТипов("Число"));
	ДокументыИОплачиваемыеДниПоВидуОтпуска.Колонки.Добавить("ПериодыОтпуска", Новый ОписаниеТипов("Массив"));
	
	Отбор = Новый Структура("ВидОтпуска", ВидОтпуска);
	
	Для Каждого Отпуск Из МассивОтпусков Цикл
		КоличествоОплачиваемыхДнейПоВидуОтпуска = 0;
		ПериодыПоВидуОтпуска = Новый Массив;
		СтрокиПоВидуОтпуска = Отпуск.ДополнительныеОтпуска.НайтиСтроки(Отбор);
		Если СтрокиПоВидуОтпуска.Количество() > 0 Тогда
			
			ПериодыПриостановкиОтпуска = Новый ТаблицаЗначений;
			ПериодыПриостановкиОтпуска.Колонки.Добавить("ДатаНачалаПериода");
			ПериодыПриостановкиОтпуска.Колонки.Добавить("ДатаОкончанияПериода");
			Для Каждого СтрокаПриостановки Из Отпуск.ПериодыПриостановкиОтпуска Цикл
				НоваяСтрока = ПериодыПриостановкиОтпуска.Добавить();
				НоваяСтрока.ДатаНачалаПериода = СтрокаПриостановки.ДатаНачалаПериода;
				НоваяСтрока.ДатаОкончанияПериода = СтрокаПриостановки.ДатаОкончанияПериода;
			КонецЦикла; 
			НачисленияПоВидуОтпуска = Новый Массив;
			Для Каждого СтрокаПоВидуОтпуска Из СтрокиПоВидуОтпуска Цикл 
				ПериодДопОтпуска = Новый Структура;
				ПериодДопОтпуска.Вставить("ДатаНачалаПериода", СтрокаПоВидуОтпуска.ДатаНачала);
				ПериодДопОтпуска.Вставить("ДатаОкончанияПериода", СтрокаПоВидуОтпуска.ДатаОкончания);
				ПериодыОтпускаСУчетомПриостановок = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(
					ПериодДопОтпуска, ПериодыПриостановкиОтпуска);
				ОтпускВРабочихДняхПоДоговору = ОстаткиОтпусков.ОтпускСотрудникаВРабочихДняхПоДоговору(
					Отпуск.Сотрудник, Отпуск.ДатаНачалаСобытия);
				ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(ВидОтпуска, ОтпускВРабочихДняхПоДоговору);
				КоличествоДнейОтпускаСУчетомПриостановок = 0;
				Для Каждого ПериодОтпускаСУчетомПриостановок Из ПериодыОтпускаСУчетомПриостановок Цикл
					КоличествоДнейОтпускаСУчетомПриостановок = КоличествоДнейОтпускаСУчетомПриостановок +
						УчетРабочегоВремениРасширенный.ДлительностьИнтервала(
							Отпуск.Сотрудник,
							ПериодОтпускаСУчетомПриостановок.ДатаНачалаПериода,
							ПериодОтпускаСУчетомПриостановок.ДатаОкончанияПериода,
							ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням,
							ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
					ПериодыПоВидуОтпуска.Добавить(ПериодОтпускаСУчетомПриостановок);
				КонецЦикла;
 				КоличествоОплачиваемыхДнейПоВидуОтпуска = КоличествоОплачиваемыхДнейПоВидуОтпуска + КоличествоДнейОтпускаСУчетомПриостановок;
			КонецЦикла;
			
		КонецЕсли;
		
		НоваяСтрока = ДокументыИОплачиваемыеДниПоВидуОтпуска.Добавить();
		НоваяСтрока.Отпуск = Отпуск;
		НоваяСтрока.КоличествоДней = КоличествоОплачиваемыхДнейПоВидуОтпуска; 
		НоваяСтрока.ПериодыОтпуска = ПериодыПоВидуОтпуска;
		
	КонецЦикла;
	
	Возврат ДокументыИОплачиваемыеДниПоВидуОтпуска;
	
КонецФункции

Функция ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок) Экспорт 	
	
	ДанныеДляРегистрацииВУчете = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуск.Сотрудник КАК Сотрудник,
	|	Отпуск.ДатаНачалаОсновногоОтпуска КАК ДатаНачалаОсновногоОтпуска,
	|	Отпуск.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончанияОсновногоОтпуска,
	|	Отпуск.ВидРасчетаОсновногоОтпуска.ВидСтажаПФР2014 КАК ВидСтажаОтпускОсновной,
	|	Отпуск.ПредоставитьДополнительныйОтпуск КАК ПредоставитьДополнительныйОтпуск,
	|	Отпуск.Ссылка КАК Ссылка,
	|	Отпуск.ПредоставитьОсновнойОтпуск КАК ПредоставитьОсновнойОтпуск
	|ПОМЕСТИТЬ ВТДанныеДокумента
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДокумента.Сотрудник КАК Сотрудник,
	|	ДанныеДокумента.ДатаНачалаОсновногоОтпуска КАК ДатаНачалаОсновногоОтпуска,
	|	ДанныеДокумента.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончанияОсновногоОтпуска,
	|	ДанныеДокумента.ВидСтажаОтпускОсновной КАК ВидСтажаОтпускОсновной,
	|	ДанныеДокумента.ПредоставитьДополнительныйОтпуск КАК ПредоставитьДополнительныйОтпуск,
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ПредоставитьОсновнойОтпуск КАК ПредоставитьОсновнойОтпуск,
	|	ОтпускДополнительныеОтпуска.ВидОтпуска КАК ВидОтпуска,
	|	ОтпускДополнительныеОтпуска.ВидРасчета.ВидСтажаПФР2014 КАК ВидСтажаДополнительныйОтпуск,
	|	ОтпускДополнительныеОтпуска.ДатаНачала КАК ДатаНачала,
	|	ОтпускДополнительныеОтпуска.ДатаОкончания КАК ДатаОкончания,
	|	ОтпускДополнительныеОтпуска.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	ВТДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Отпуск.ДополнительныеОтпуска КАК ОтпускДополнительныеОтпуска
	|		ПО ДанныеДокумента.Ссылка = ОтпускДополнительныеОтпуска.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускПериодыПриостановкиОтпуска.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ОтпускПериодыПриостановкиОтпуска.ДатаОкончанияПериода КАК ДатаОкончанияПериода,
	|	ОтпускПериодыПриостановкиОтпуска.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Отпуск.ПериодыПриостановкиОтпуска КАК ОтпускПериодыПриостановкиОтпуска
	|ГДЕ
	|	ОтпускПериодыПриостановкиОтпуска.Ссылка В(&МассивСсылок)";
	
	Результат =  Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	ПериодыПриостановкиОтпусков = Результат[2].Выгрузить();
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеДляРегистрацииВУчетеПоДокументу = УчетСтажаПФР.ДанныеДляРегистрацииВУчетеСтажаПФР();
		ДанныеДляРегистрацииВУчете.Вставить(Выборка.Ссылка, ДанныеДляРегистрацииВУчетеПоДокументу);
		Отбор = Новый Структура("Ссылка", Выборка.Ссылка);
		ПериодыПриостановкиОтпуска = ПериодыПриостановкиОтпусков.Скопировать(Отбор);
		Если Выборка.ПредоставитьОсновнойОтпуск Тогда
			Если ЗначениеЗаполнено(Выборка.ВидСтажаОтпускОсновной) Тогда 
				ПериодыНачислений = Новый Массив;
				ПериодОтпуска = Новый Структура;
				ПериодОтпуска.Вставить("ДатаНачалаПериода", Выборка.ДатаНачалаОсновногоОтпуска);
				ПериодОтпуска.Вставить("ДатаОкончанияПериода", Выборка.ДатаОкончанияОсновногоОтпуска);
				ПериодыНачислений.Добавить(ПериодОтпуска);
				Если ПериодыПриостановкиОтпуска.Количество()> 0 Тогда
					ПериодыНачислений = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодОтпуска, ПериодыПриостановкиОтпуска);
				КонецЕсли;
				Для Каждого ПериодНачислений Из ПериодыНачислений Цикл
					ОписаниеПериода = УчетСтажаПФР.ОписаниеРегистрируемогоПериода();
					ОписаниеПериода.Сотрудник = Выборка.Сотрудник;	
					ОписаниеПериода.ДатаНачалаПериода = ПериодНачислений.ДатаНачалаПериода;
					ОписаниеПериода.ДатаОкончанияПериода = ПериодНачислений.ДатаОкончанияПериода;
					ОписаниеПериода.Состояние = Перечисления.СостоянияСотрудника.ОтпускОсновной;
					РегистрируемыйПериод = УчетСтажаПФР.ДобавитьЗаписьВДанныеДляРегистрацииВУчета(ДанныеДляРегистрацииВУчетеПоДокументу, ОписаниеПериода);
					УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "ВидСтажаПФР", Выборка.ВидСтажаОтпускОсновной);							
				КонецЦикла;
			КонецЕсли;									
		КонецЕсли;
		
		Если Выборка.ПредоставитьДополнительныйОтпуск Тогда
			Пока Выборка.Следующий() Цикл
				Если Не ЗначениеЗаполнено(Выборка.ДатаНачала) 
					Или Не ЗначениеЗаполнено(Выборка.ДатаОкончания) 
					Или Не ЗначениеЗаполнено(Выборка.ВидРасчета) Тогда
					
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Выборка.ВидСтажаДополнительныйОтпуск) Тогда
					ПериодыНачисленияДопОтпусков = Новый Массив;
					ПериодДопОтпуска = Новый Структура;
					ПериодДопОтпуска.Вставить("ДатаНачалаПериода", Выборка.ДатаНачала);
					ПериодДопОтпуска.Вставить("ДатаОкончанияПериода", Выборка.ДатаОкончания);
					ПериодыНачисленияДопОтпусков.Добавить(ПериодДопОтпуска);
					Если ПериодыПриостановкиОтпуска.Количество()> 0 Тогда
						ПериодыНачисленияДопОтпусков = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодДопОтпуска, ПериодыПриостановкиОтпуска);
					КонецЕсли;
					Для Каждого ПериодНачисленияДопОтпуска Из ПериодыНачисленияДопОтпусков Цикл
						ОписаниеПериода = УчетСтажаПФР.ОписаниеРегистрируемогоПериода();
						ОписаниеПериода.Сотрудник = Выборка.Сотрудник;	
						ОписаниеПериода.ДатаНачалаПериода = ПериодНачисленияДопОтпуска.ДатаНачалаПериода;
						ОписаниеПериода.ДатаОкончанияПериода = ПериодНачисленияДопОтпуска.ДатаОкончанияПериода;
						ОписаниеПериода.Состояние = СостоянияСотрудников.СостояниеПоВидуОтпуска(Выборка.ВидОтпуска);
						РегистрируемыйПериод = УчетСтажаПФР.ДобавитьЗаписьВДанныеДляРегистрацииВУчета(ДанныеДляРегистрацииВУчетеПоДокументу, ОписаниеПериода);
						УчетСтажаПФР.УстановитьЗначениеРегистрируемогоРесурса(РегистрируемыйПериод, "ВидСтажаПФР", Выборка.ВидСтажаДополнительныйОтпуск);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеДляРегистрацииВУчете;
	
КонецФункции	

Функция ПериодыОтсутствий(Объект) Экспорт
	
	ПериодыОтсутствий = Новый ТаблицаЗначений;
	ПериодыОтсутствий.Колонки.Добавить("НачалоПериода");
	ПериодыОтсутствий.Колонки.Добавить("ОкончаниеПериода");
	
	КонецИнтервала = Дата(1,1,1);
	
	Если Объект.ПредоставитьОсновнойОтпуск Тогда
		ПериодОтсутствия = ПериодыОтсутствий.Добавить();
		ПериодОтсутствия.НачалоПериода = Объект.ДатаНачалаОсновногоОтпуска;
		ПериодОтсутствия.ОкончаниеПериода  = Объект.ДатаОкончанияОсновногоОтпуска;
		КонецИнтервала = Макс(КонецИнтервала, ПериодОтсутствия.ОкончаниеПериода);
	КонецЕсли;
	
	Если Объект.ПредоставитьДополнительныйОтпуск Тогда
		Для каждого ДополнительныйОтпуск Из Объект.ДополнительныеОтпуска Цикл
			ПериодОтсутствия = ПериодыОтсутствий.Добавить();
			ПериодОтсутствия.НачалоПериода = ДополнительныйОтпуск.ДатаНачала;
			ПериодОтсутствия.ОкончаниеПериода  = ДополнительныйОтпуск.ДатаОкончания;
			КонецИнтервала = Макс(КонецИнтервала, ПериодОтсутствия.ОкончаниеПериода);
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.ПредоставитьОтгул Тогда
		ПериодОтсутствия = ПериодыОтсутствий.Добавить();
		ПериодОтсутствия.НачалоПериода = КонецДня(КонецИнтервала) + 1;
		ПериодОтсутствия.ОкончаниеПериода  = УчетРабочегоВремениРасширенный.ДатаОкончанияПоГрафикуРаботыСотрудника(Объект.Сотрудник, ПериодОтсутствия.НачалоПериода, Объект.КоличествоДнейОтгула);
	КонецЕсли;
	
	Возврат ПериодыОтсутствий;
	
КонецФункции

Функция ВидыОтпусковОбъекта(ТекущийОбъект) Экспорт

	МассивВидовОтпусков = Новый Массив;
	
	Если ТекущийОбъект.ПредоставитьОсновнойОтпуск ИЛИ ТекущийОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		МассивВидовОтпусков.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"));
	КонецЕсли;
	Если ТекущийОбъект.ПредоставитьДополнительныйОтпуск Тогда
		МассивДополнительныхОтпусков = ТекущийОбъект.ДополнительныеОтпуска.Выгрузить().ВыгрузитьКолонку("ВидОтпуска");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовОтпусков, МассивДополнительныхОтпусков, Истина);
	КонецЕсли;
	
	Возврат МассивВидовОтпусков;

КонецФункции

Функция ОписаниеДокумента() Экспорт 

	ОписаниеДокумента = ЗарплатаКадрыРасширенныйКлиентСервер.СтруктураОписанияДокумента();
	
	ОписаниеДокумента.КраткоеНазваниеИменительныйПадеж	 = НСтр("ru = 'отпуск'");
	ОписаниеДокумента.КраткоеНазваниеРодительныйПадеж	 = НСтр("ru = 'отпуска'");
	ОписаниеДокумента.ИмяРеквизитаСотрудник				 = "Сотрудник";
	ОписаниеДокумента.ИмяРеквизитаОтсутствующийСотрудник = "Сотрудник";
	ОписаниеДокумента.ИмяРеквизитаДатаНачалаСобытия		 = "ДатаНачалаПериодаОтсутствия";
	ОписаниеДокумента.ИмяРеквизитаДатаОкончанияСобытия	 = "ДатаОкончанияПериодаОтсутствия";
	
	Возврат ОписаниеДокумента;

КонецФункции

Функция ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект) Экспорт

	ДанныеДляБухучета = Новый Структура;
	ДанныеДляБухучета.Вставить("ДокументОснование", Объект.Ссылка);
	
	ВРОтпускаКомпенсации = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ВидРасчетаОсновногоОтпуска) Тогда
		ВРОтпускаКомпенсации.Добавить(Объект.ВидРасчетаОсновногоОтпуска);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ВидРасчетаКомпенсацииОсновногоОтпуска) Тогда
		ВРОтпускаКомпенсации.Добавить(Объект.ВидРасчетаКомпенсацииОсновногоОтпуска);
	КонецЕсли;
	Для каждого СтрокаТЧ Из Объект.ДополнительныеОтпуска Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.ВидРасчета) И ВРОтпускаКомпенсации.Найти(СтрокаТЧ.ВидРасчета) = Неопределено Тогда
			ВРОтпускаКомпенсации.Добавить(СтрокаТЧ.ВидРасчета);	
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.ВидРасчетаКомпенсации) И ВРОтпускаКомпенсации.Найти(СтрокаТЧ.ВидРасчетаКомпенсации) = Неопределено Тогда
			ВРОтпускаКомпенсации.Добавить(СтрокаТЧ.ВидРасчетаКомпенсации);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаБухучетЗарплаты = ОтражениеЗарплатыВБухучетеРасширенный.ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект, ВРОтпускаКомпенсации);
	ДанныеДляБухучета.Вставить("ТаблицаБухучетЗарплаты", ТаблицаБухучетЗарплаты);
	
	Возврат ДанныеДляБухучета;
	
КонецФункции

Функция ДополнительныеПараметрыВыбораНачислений(Документ, ПутьКРеквизиту) Экспорт
	Результат = Новый Соответствие;
	
	Если ПутьКРеквизиту = "ВидРасчетаОсновногоОтпуска" Тогда
		Категория = Документы.Отпуск.КатегорияНачисленияОтпуск(Документ);
	ИначеЕсли ПутьКРеквизиту = "ВидРасчетаКомпенсацииОсновногоОтпуска" Тогда
		Категория = Документы.Отпуск.КатегорияНачисленияКомпенсацияОтпуска(Документ);
	ИначеЕсли ПутьКРеквизиту = "ВидРасчетаЕдиновременнойВыплатыКОтпуску" Тогда
		Категория = Документы.Отпуск.КатегорияНачисленияЕдиновременнойВыплаты(Документ);
	ИначеЕсли ПутьКРеквизиту = "ВидРасчетаМатериальнойПомощиПриОтпуске" Тогда
		Категория = Документы.Отпуск.КатегорияНачисленияМатериальнойПомощи(Документ);
	ИначеЕсли ПутьКРеквизиту = "ДополнительныеОтпуска.ВидРасчета" Тогда
		МассивКатегорий = Новый Массив;
		МассивКатегорий.Добавить(Документы.Отпуск.КатегорияНачисленияОтпуск(Документ));
		МассивКатегорий.Добавить(Документы.Отпуск.КатегорияНачисленияОтпускБезОплаты());
		Категория = Новый ФиксированныйМассив(МассивКатегорий);
	ИначеЕсли ПутьКРеквизиту = "ДополнительныеОтпуска.ВидРасчетаКомпенсации" Тогда
		Категория = Документы.Отпуск.КатегорияНачисленияКомпенсацияОтпуска(Документ);
	КонецЕсли;
	
	Результат.Вставить("Отбор.КатегорияНачисленияИлиНеоплаченногоВремени", Категория);
	
	Если Документ.РасчетДенежногоСодержания
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		Результат.Вставить("ОтборНачисленийГосслужбы", Модуль.НачисленияКомпенсацииГосслужащим(Категория, Документ.ДатаНачалаСобытия, ПутьКРеквизиту = "ВидРасчетаКомпенсацииОсновногоОтпуска"));
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления) Экспорт

	ПараметрыЗаполнения = ПерерасчетЗарплаты.ПараметрыЗаполненияИсходныхДанныхПерерасчетов();
	ПерерасчетЗарплаты.ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления, Метаданные.Документы.Отпуск, ПараметрыЗаполнения);

КонецПроцедуры

Процедура ЗаполнитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ТаблицаДокумента.Ссылка КАК Регистратор,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.ДатаНачалаПериодаОтсутствия КАК ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончания,
		|	ЕСТЬNULL(ТаблицаДокументаИсправления.Ссылка, ТаблицаДокументаСторнирование.Ссылка) КАК РегистраторИзмерение
		|ИЗ
		|	Документ.Отпуск КАК ТаблицаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
		|		ПО ТаблицаДокумента.Сотрудник = КадроваяИсторияСотрудников.Сотрудник
		|			И (КОНЕЦПЕРИОДА(ТаблицаДокумента.ДатаНачалаПериодаОтсутствия, ДЕНЬ) >= КадроваяИсторияСотрудников.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗанятостьПозицийШтатногоРасписания КАК ЗанятостьПозицийШтатногоРасписания
		|		ПО ТаблицаДокумента.Ссылка = ЗанятостьПозицийШтатногоРасписания.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Отпуск КАК ТаблицаДокументаИсправления
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИспр КАК ЗанятостьПозицийШтатногоРасписанияИспр
		|			ПО ТаблицаДокументаИсправления.Ссылка = ЗанятостьПозицийШтатногоРасписанияИспр.РегистраторИзмерение
		|		ПО ТаблицаДокумента.Ссылка = ТаблицаДокументаИсправления.ИсправленныйДокумент
		|			И (ТаблицаДокументаИсправления.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК ТаблицаДокументаСторнирование
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗанятостьПозицийШтатногоРасписанияИспр КАК ЗанятостьПозицийШтатногоРасписанияСторнирование
		|			ПО ТаблицаДокументаСторнирование.Ссылка = ЗанятостьПозицийШтатногоРасписанияСторнирование.РегистраторИзмерение
		|		ПО ТаблицаДокумента.Ссылка = ТаблицаДокументаСторнирование.СторнируемыйДокумент
		|			И (ТаблицаДокументаСторнирование.Проведен)
		|ГДЕ
		|	ТаблицаДокумента.Проведен
		|	И ТаблицаДокумента.ОсвобождатьСтавку
		|	И ЗанятостьПозицийШтатногоРасписания.Регистратор ЕСТЬ NULL
		|	И ЗанятостьПозицийШтатногоРасписанияИспр.РегистраторИзмерение ЕСТЬ NULL
		|	И ЗанятостьПозицийШтатногоРасписанияСторнирование.РегистраторИзмерение ЕСТЬ NULL
		|	И НЕ КадроваяИсторияСотрудников.Сотрудник ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала,
		|	Регистратор,
		|	Сотрудник";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	РегистрыСведений.ЗанятостьПозицийШтатногоРасписания.ЗаполнитьДвиженияПоДаннымВыборкиРегистраторов(Выборка, Ложь, ПараметрыОбновления);
	
КонецПроцедуры

Функция ОстаткиВРазрезеВидовОтпусков(Сотрудник, ДатаНачалаСобытия, ИсключаемыеРегистраторы) Экспорт
	
	ОстатокОтпуска = ОстаткиОтпусков.ОстатокОтпускаСотрудникаНаДату(Сотрудник, ДатаНачалаСобытия - 86400, ИсключаемыеРегистраторы);
	
	ОстаткиВРазрезеВидовОтпусков = Новый Соответствие;
	Для Каждого ДанныеВидаОтпуска Из ОстатокОтпуска.ОстаткиВРазрезеВидовОтпусков Цикл 
		ОстаткиВРазрезеВидовОтпусков.Вставить(ДанныеВидаОтпуска.ВидЕжегодногоОтпуска, ДанныеВидаОтпуска.КоличествоДней);
	КонецЦикла;	
	
	Возврат ОстаткиВРазрезеВидовОтпусков;
	
КонецФункции

Процедура ИсправитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|	ЗанятостьПозицийШтатногоРасписания.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТРегистраторы
		|ИЗ
		|	РегистрСведений.ЗанятостьПозицийШтатногоРасписания КАК ЗанятостьПозицийШтатногоРасписания
		|ГДЕ
		|	ЗанятостьПозицийШтатногоРасписания.КоличествоСтавок = 0
		|	И ЗанятостьПозицийШтатногоРасписания.ДействуетДо <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ТИПЗНАЧЕНИЯ(ЗанятостьПозицийШтатногоРасписания.Регистратор) = ТИП(Документ.Отпуск)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Регистраторы.Регистратор КАК Регистратор
		|ИЗ
		|	ВТРегистраторы КАК Регистраторы";
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаДокумента.Ссылка КАК Регистратор,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.ДатаНачалаПериодаОтсутствия КАК ДатаНачала,
		|	ТаблицаДокумента.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончания,
		|	ЕСТЬNULL(ТаблицаДокументаИсправления.Ссылка, ТаблицаДокументаСторнирование.Ссылка) КАК РегистраторИзмерение
		|ИЗ
		|	ВТРегистраторы КАК Регистраторы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Отпуск КАК ТаблицаДокумента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Отпуск КАК ТаблицаДокументаИсправления
		|			ПО ТаблицаДокумента.Ссылка = ТаблицаДокументаИсправления.ИсправленныйДокумент
		|				И (ТаблицаДокументаИсправления.Проведен)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК ТаблицаДокументаСторнирование
		|			ПО ТаблицаДокумента.Ссылка = ТаблицаДокументаСторнирование.СторнируемыйДокумент
		|				И (ТаблицаДокументаСторнирование.Проведен)
		|		ПО Регистраторы.Регистратор = ТаблицаДокумента.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала,
		|	Регистратор,
		|	Сотрудник";
	
	Выборка = Запрос.Выполнить().Выбрать();
	РегистрыСведений.ЗанятостьПозицийШтатногоРасписания.ЗаполнитьДвиженияПоДаннымВыборкиРегистраторов(Выборка, Ложь, ПараметрыОбновления);
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоДнейПриостановки(ДокументОбъект, СтрокаПериодов) Экспорт
	ОтпускВРабочихДняхПоДоговору = ОстаткиОтпусков.ОтпускСотрудникаВРабочихДняхПоДоговору(
		ДокументОбъект.Сотрудник, ДокументОбъект.ДатаНачалаСобытия);
	ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), ОтпускВРабочихДняхПоДоговору);
	СтрокаПериодов.КоличествоДнейПриостановки = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(ДокументОбъект.Сотрудник, 
		СтрокаПериодов.ДатаНачалаПериода, СтрокаПериодов.ДатаОкончанияПериода, 
		ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
КонецПроцедуры

Функция ДанныеНовогоДокумента() Экспорт
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("ПериодРегистрации", НачалоМесяца(ТекущаяДатаСеанса()));
	ДанныеДокумента.Вставить("Дата", ТекущаяДатаСеанса());
	ДанныеДокумента.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ДанныеДокумента.Вставить("Сотрудник", Справочники.Сотрудники.ПустаяСсылка());
	ДанныеДокумента.Вставить("ОсвобождатьСтавку", Ложь);
	ДанныеДокумента.Вставить("ВидРасчетаЕдиновременнойВыплатыКОтпуску", Справочники.Сотрудники.ПустаяСсылка());
	ДанныеДокумента.Вставить("ВидРасчетаМатериальнойПомощиПриОтпуске", Справочники.Сотрудники.ПустаяСсылка());
	
	ПараметрыРасчета = Новый Структура();
	ПараметрыРасчета.Вставить("УчитыватьМРОТПриОплатеПоСреднемуЗаработку", Ложь);
	ПараметрыРасчета.Вставить("ДоначислитьЗарплатуПриНеобходимости", Ложь);
	ПараметрыРасчета.Вставить("РассчитатьЗарплату", Ложь);
	ПараметрыРасчета.Вставить("РасчетДенежногоСодержания", Неопределено);
	ПараметрыРасчета.Вставить("ДоходПолученНаТерриторииРФ", Ложь);
	ДанныеДокумента.Вставить("ПараметрыРасчета", ПараметрыРасчета);
	
	Выплата = Новый Структура();
	Выплата.Вставить("ПланируемаяДатаВыплаты", '00010101');
	Выплата.Вставить("ПорядокВыплаты", Перечисления.ХарактерВыплатыЗарплаты.ПустаяСсылка());
	ДанныеДокумента.Вставить("Выплата", Выплата);
	
	ОсновнойОтпуск = Новый Структура();
	ОсновнойОтпуск.Вставить("ВидРасчета", ПланыВидовРасчета.Начисления.ПустаяСсылка());
	ОсновнойОтпуск.Вставить("ДатаНачала", '00010101');
	ОсновнойОтпуск.Вставить("ДатаОкончания", '00010101');
	ДанныеДокумента.Вставить("ОсновнойОтпуск", ОсновнойОтпуск);
	
	КомпенсацияОтпуска = Новый Структура();
	КомпенсацияОтпуска.Вставить("ВидРасчета", ПланыВидовРасчета.Начисления.ПустаяСсылка());
	КомпенсацияОтпуска.Вставить("КоличествоДней", '00010101');
	ДанныеДокумента.Вставить("КомпенсацияОтпуска", КомпенсацияОтпуска);
	
	ПериодЗаКоторыйПредоставляетсяОтпуск = Новый Структура();
	ПериодЗаКоторыйПредоставляетсяОтпуск.Вставить("Начало", '00010101');
	ПериодЗаКоторыйПредоставляетсяОтпуск.Вставить("Окончание", '00010101');
	ДанныеДокумента.Вставить("ПериодЗаКоторыйПредоставляетсяОтпуск", ПериодЗаКоторыйПредоставляетсяОтпуск);
	
	ДополнительныеОтпуска = Новый ТаблицаЗначений();
	ДополнительныеОтпуска.Колонки.Добавить("ВидОтпуска", Новый ОписаниеТипов("СправочникСсылка.ВидыОтпусков"));
	ДополнительныеОтпуска.Колонки.Добавить("ВидРасчета", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
	ДополнительныеОтпуска.Колонки.Добавить("НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", Новый ОписаниеТипов("Дата"));
	ДополнительныеОтпуска.Колонки.Добавить("КонецПериодаЗаКоторыйПредоставляетсяОтпуск", Новый ОписаниеТипов("Дата"));
	ДополнительныеОтпуска.Колонки.Добавить("ДатаНачала", Новый ОписаниеТипов("Дата"));
	ДополнительныеОтпуска.Колонки.Добавить("ДатаОкончания", Новый ОписаниеТипов("Дата"));
	ДополнительныеОтпуска.Колонки.Добавить("ВидРасчетаКомпенсации", Новый ОписаниеТипов("ПланВидовРасчетаСсылка.Начисления"));
	ДополнительныеОтпуска.Колонки.Добавить("КоличествоДнейКомпенсации", Новый ОписаниеТипов("Число"));
	ДанныеДокумента.Вставить("ДополнительныеОтпуска", ДополнительныеОтпуска);
	
	Отгул = Новый Структура();
	Отгул.Вставить("КоличествоДней", 0);
	Отгул.Вставить("РасходДней", 0);
	Отгул.Вставить("РасходЧасов", 0);
	ДанныеДокумента.Вставить("Отгул", Отгул);
	
	Возврат ДанныеДокумента;
КонецФункции		

Функция СоздатьНовыйДокумент(ДанныеНовогоДокумента) Экспорт
	Документ = Документы.Отпуск.СоздатьДокумент();
	ЗаполнитьИсходныеДанныеДокумента(Документ, ДанныеНовогоДокумента);
	Документы.Отпуск.ЗаполнитьДанныеСотрудника(Документ);
	Документы.Отпуск.УстановитьДатуНачалаСобытия(Документ);

	ОтпускВРабочихДняхПоДоговору = ОстаткиОтпусков.ОтпускСотрудникаВРабочихДняхПоДоговору(Документ.Сотрудник, Документ.ДатаНачалаСобытия);
	ОбновитьДлительностьИнтервалов(Документ, ОтпускВРабочихДняхПоДоговору);
	ОстатокОтпускаСотрудника = РассчитатьОстаткиОтпусков(Документ);
	УстановитьКоличествоДнейОсновногоОтпуска(Документ, ОтпускВРабочихДняхПоДоговору);
	УстановитьКоличествоДнейДополнительныхОтпусков(Документ, ОтпускВРабочихДняхПоДоговору);
	УстановитьКоличествоДнейОтпускаАвансом(Документ, ОстатокОтпускаСотрудника);
	УстановитьОбщийПериодОтпуска(Документ);
	Если ДанныеНовогоДокумента.ПараметрыРасчета.РасчетДенежногоСодержания = Неопределено Тогда
		Документ.РасчетДенежногоСодержания = Ложь;
		ЗарплатаКадрыРасширенный.УстановитьВариантРасчетаДокументаПоСреднемуЗаработку(Документ);
	КонецЕсли;
	Документы.Отпуск.ЗаполнитьПериодРасчетаСреднегоЗаработка(Документ);
	
	Возврат Документ;
КонецФункции	

Процедура ОбновитьДлительностьИнтервалов(Объект, ОтпускВРабочихДняхПоДоговору) Экспорт
	ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), ОтпускВРабочихДняхПоДоговору); 
	Объект.КоличествоДнейОсновногоОтпуска = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Объект.Сотрудник, Объект.ДатаНачалаОсновногоОтпуска, Объект.ДатаОкончанияОсновногоОтпуска,ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
	
	Для каждого Строка Из Объект.ДополнительныеОтпуска Цикл
		ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(Строка.ВидОтпуска, ОтпускВРабочихДняхПоДоговору);                           
		Строка.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Объект.Сотрудник, Строка.ДатаНачала, Строка.ДатаОкончания, ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
	КонецЦикла;

КонецПроцедуры

Функция РассчитатьОстаткиОтпусков(Объект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Сотрудник) Или Не ЗначениеЗаполнено(Объект.ДатаНачалаСобытия) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ИсключаемыеРегистраторы = Новый Массив;
	ИсключаемыеРегистраторы.Добавить(Объект.Ссылка);
	ИсключаемыеРегистраторы.Добавить(Объект.ИсправленныйДокумент);
	
	ОстаткиВРазрезеВидовОтпусков = Документы.Отпуск.ОстаткиВРазрезеВидовОтпусков(Объект.Сотрудник, Объект.ДатаНачалаСобытия, ИсключаемыеРегистраторы);
	Возврат ОстаткиВРазрезеВидовОтпусков;
КонецФункции

Процедура УстановитьКоличествоДнейОтпускаАвансом(Объект, ОстатокОтпускаСотрудника) Экспорт	
	УстановитьКоличествоДнейОсновногоОтпускаАвансом(Объект, ОстатокОтпускаСотрудника);
	ДополнительныеОтпускаСотрудника = Объект.ДополнительныеОтпуска.Выгрузить( , "ВидОтпуска").ВыгрузитьКолонку("ВидОтпуска");
	МассивДополнительныхОтпусков = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДополнительныеОтпускаСотрудника);
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(МассивДополнительныхОтпусков, Справочники.ВидыОтпусков.ПустаяСсылка());
	ЕжегодностьОтпусков = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДополнительныхОтпусков, "ОтпускЯвляетсяЕжегодным");
	
	Для Каждого СтрокаОтпуска Из Объект.ДополнительныеОтпуска Цикл 
		УстановитьКоличествоДнейДополнительногоОтпускаАвансом(СтрокаОтпуска, ОстатокОтпускаСотрудника, ЕжегодностьОтпусков[СтрокаОтпуска.ВидОтпуска]);
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьКоличествоДнейОсновногоОтпускаАвансом(Объект, ОстатокОтпускаСотрудника) Экспорт
	Если ОстатокОтпускаСотрудника = Неопределено Тогда
		Объект.КоличествоДнейОсновногоОтпускаАвансом = 0;
		Возврат;
	КонецЕсли;
	
	ОстатокОтпуска = ОстатокОтпускаСотрудника.Получить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"));
	Объект.КоличествоДнейОсновногоОтпускаАвансом = Документы.Отпуск.КоличествоДнейОтпускаАвансом(Объект.КоличествоДнейОсновногоОтпуска, ОстатокОтпуска);
КонецПроцедуры

Процедура УстановитьКоличествоДнейДополнительногоОтпускаАвансом(СтрокаОтпуска, ОстатокОтпускаСотрудника, ЭтоЕжегодныйОтпуск) Экспорт
	
	Если Не ЭтоЕжегодныйОтпуск Тогда
		СтрокаОтпуска.КоличествоДнейАвансом = 0;
		Возврат;
	КонецЕсли;
	
	Если ОстатокОтпускаСотрудника = Неопределено Тогда
		СтрокаОтпуска.КоличествоДнейАвансом = 0;
		Возврат;
	КонецЕсли;
	
	ОстатокОтпуска = ОстатокОтпускаСотрудника.Получить(СтрокаОтпуска.ВидОтпуска);
	СтрокаОтпуска.КоличествоДнейАвансом = Документы.Отпуск.КоличествоДнейОтпускаАвансом(СтрокаОтпуска.КоличествоДней, ОстатокОтпуска);
	
КонецПроцедуры

Процедура УстановитьКоличествоДнейОсновногоОтпуска(Объект, ОтпускВРабочихДняхПоДоговору) Экспорт
	ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), ОтпускВРабочихДняхПоДоговору);
	
	Если ЗначениеЗаполнено(Объект.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(Объект.ДатаОкончанияОсновногоОтпуска) 
		И Объект.ДатаНачалаОсновногоОтпуска <= Объект.ДатаОкончанияОсновногоОтпуска Тогда
		Объект.КоличествоДнейОсновногоОтпуска = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(Объект.Сотрудник, Объект.ДатаНачалаОсновногоОтпуска, Объект.ДатаОкончанияОсновногоОтпуска, ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
	ИначеЕсли ЗначениеЗаполнено(Объект.ДатаНачалаОсновногоОтпуска) 
		И ЗначениеЗаполнено(Объект.КоличествоДнейОсновногоОтпуска) Тогда
		Объект.ДатаОкончанияОсновногоОтпуска = ОстаткиОтпусковКлиентСервер.ДатаОкончанияОтпуска(Объект.Сотрудник, Объект.ДатаНачалаОсновногоОтпуска, Объект.КоличествоДнейОсновногоОтпуска, ОписаниеВидаОтпуска);
	Иначе 
		Объект.КоличествоДнейОсновногоОтпуска = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбщийПериодОтпуска(Объект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбщийПериодОтпускаВДокументах") Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоОтпуска = Неопределено;
	Объект.ОкончаниеОтпуска = Неопределено;
	
	Если Объект.ПредоставитьОсновнойОтпуск 
		И ЗначениеЗаполнено(Объект.ДатаНачалаОсновногоОтпуска)
		И ЗначениеЗаполнено(Объект.ДатаОкончанияОсновногоОтпуска) Тогда
		Объект.НачалоОтпуска = Объект.ДатаНачалаОсновногоОтпуска;
		Объект.ОкончаниеОтпуска = Объект.ДатаОкончанияОсновногоОтпуска;
	КонецЕсли;
	
	Если Объект.ПредоставитьДополнительныйОтпуск Тогда
		Для Каждого ДополнительныйОтпуск Из Объект.ДополнительныеОтпуска Цикл 
			Если Не ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала)
				Или Не ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) Тогда
				Продолжить;
			КонецЕсли;
			Объект.НачалоОтпуска = ?(ЗначениеЗаполнено(Объект.НачалоОтпуска), Мин(Объект.НачалоОтпуска, ДополнительныйОтпуск.ДатаНачала), ДополнительныйОтпуск.ДатаНачала);
			Объект.ОкончаниеОтпуска = ?(ЗначениеЗаполнено(Объект.ОкончаниеОтпуска), Макс(Объект.ОкончаниеОтпуска, ДополнительныйОтпуск.ДатаОкончания), ДополнительныйОтпуск.ДатаОкончания);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеДокументаРасчета() Экспорт
	Описание = РасчетДокументовБЗК.ОписаниеДокумента();
	Описание.МесяцНачисленияИмя = "ПериодРегистрации";
	Описание.НачисленияПерерасчетИмя = "НачисленияПерерасчет";
	Описание.ДатаНачалаСобытияИмя = "ДатаНачалаСобытия";
	Описание.СпособыРасчетаСреднегоЗаработка = СпособыРасчетаСреднегоЗаработка();
	
	Возврат Описание;
КонецФункции

Функция НачальныйПериодРасчетаЗарплаты(ДанныеОбъекта) Экспорт
	Результат = Новый Структура();
	Результат.Вставить("ДатаНачала", ДанныеОбъекта.ПериодРегистрации);
	Результат.Вставить("ЭтоПериодИсправленногоДокумента", Ложь);
	Результат.Вставить("ВыполнялсяРасчетЗарплаты", Неопределено);
	
	Если ЗначениеЗаполнено(ДанныеОбъекта.ИсправленныйДокумент) Тогда
		ПервичныйДокумент = ИсправлениеДокументовЗарплатаКадры.ПервыйДокументЦепочкиИсправлений(ДанныеОбъекта.ИсправленныйДокумент);
		
		Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПервичныйДокумент, "ПериодРегистрации, РассчитатьЗарплату");
		Результат.ЭтоПериодИсправленногоДокумента = Истина;
		Результат.ДатаНачала = Значения.ПериодРегистрации;
		Результат.ВыполнялсяРасчетЗарплаты = Значения.РассчитатьЗарплату;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СпособыРасчетаСреднегоЗаработка() Экспорт
	СпособыРасчетаСреднегоЗаработка = Новый Структура;
	СпособыРасчетаСреднегоЗаработка.Вставить("СреднийЗаработок", Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням);
	СпособыРасчетаСреднегоЗаработка.Вставить("СреднийЗаработокПоРабочимДням", Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоШестидневке);
	
	Возврат СпособыРасчетаСреднегоЗаработка;
КонецФункции

Функция ОписаниеТаблицыНачислений() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	
	ОписаниеТаблицы.ИмяТаблицы									= "Начисления";
	ОписаниеТаблицы.ИмяРеквизитаПериод 							= "ПериодРегистрации";
	ОписаниеТаблицы.ИмяРеквизитаДокументОснование 				= "ДокументОснование";
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

Функция ОписаниеТаблицыПерерасчетов() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	
	ОписаниеТаблицы.ИмяТаблицы									= "НачисленияПерерасчет";
	ОписаниеТаблицы.НомерТаблицы 								= 1;

	ОписаниеТаблицы.ИмяРеквизитаПериод 							= "ПериодРегистрации";
	ОписаниеТаблицы.ИмяРеквизитаДокументОснование 				= "ДокументОснование";
	
	Возврат ОписаниеТаблицы;
КонецФункции

Функция ОписаниеТаблицыПерерасчетовНулевыеСторно() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	
	ОписаниеТаблицы.ИмяТаблицы									= "НачисленияПерерасчетНулевыеСторно";
	ОписаниеТаблицы.НомерТаблицы 								= 1.1;
	
	ОписаниеТаблицы.ИмяРеквизитаПериод 							= "ПериодРегистрации";
	ОписаниеТаблицы.ИмяРеквизитаДокументОснование 				= "ДокументОснование";
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

Функция ОписаниеТаблицыУдержаний() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "Удержания";
	ОписаниеТаблицы.ИмяРеквизитаВидРасчета = "Удержание";
	ОписаниеТаблицы.НомерТаблицы = 2;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

Функция ОписаниеТаблицыНДФЛ() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "НДФЛ";
	ОписаниеТаблицы.НомерТаблицы = 3;
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	ОписаниеТаблицы.ИмяРеквизитаИдентификаторСтроки = "ИдентификаторСтрокиНДФЛ";
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

Функция ОписаниеТаблицыПогашениеЗаймов() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "ПогашениеЗаймов";
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	ОписаниеТаблицы.НомерТаблицы = 5;
	
	ОписаниеТаблицы.ИмяРеквизитаИдентификаторСтроки = "ИдентификаторСтроки";
	Возврат ОписаниеТаблицы;
	
КонецФункции

Функция ОписаниеТаблицыКорректировкиВыплаты() Экспорт
	
	ОписаниеТаблицы = РасчетДокументовБЗК.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "КорректировкиВыплаты";
	ОписаниеТаблицы.НомерТаблицы = РасчетЗарплатыКлиентСервер.НомерТаблицыКорректировкиВыплаты();
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	
	ОписаниеТаблицы.ИмяРеквизитаИдентификаторСтроки = "ИдентификаторСтроки";
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

Процедура ЗаполнитьПериодРасчетаСреднегоЗаработка(Объект) Экспорт
	
	Если Объект.ФиксПериодРасчетаСреднегоЗаработка Тогда
		// Период расчета среднего заработка установлен принудительно.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСобытия) 
		Или Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	ВидРасчета = ?(Документы.Отпуск.ТолькоКомпенсация(Объект), Объект.ВидРасчетаКомпенсацииОсновногоОтпуска, Объект.ВидРасчетаОсновногоОтпуска);
	ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(Объект.ДатаНачалаСобытия, Объект.Сотрудник, ВидРасчета);
	Если Документы.Отпуск.ПериодРасчетаСреднегоЗаработкаИзменился(Объект, ПериодРасчетаСреднего) Тогда
		Объект.ПериодРасчетаСреднегоЗаработкаНачало		= ПериодРасчетаСреднего.ДатаНачала;
		Объект.ПериодРасчетаСреднегоЗаработкаОкончание 	= ПериодРасчетаСреднего.ДатаОкончания;
		ОбновитьДанныеДляРасчетаСреднего = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДаннымЗаполнения(ДокументОбъект, ДанныеЗаполнения)
	
	Если ДокументОбъект.ЭтоНовый() Тогда
		
		ДокументОбъект.ДокументЗаполнения = ДанныеЗаполнения.Ссылка;
		ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
		ДокументОбъект.Сотрудник = ДанныеЗаполнения.Сотрудник;
				
		ДанныеЗаполнения.Свойство("Руководитель", ДокументОбъект.Руководитель);
		ДанныеЗаполнения.Свойство("ДолжностьРуководителя", ДокументОбъект.ДолжностьРуководителя);
		
		ДокументОбъект.ПредоставитьОсновнойОтпуск = Ложь;
		
		ДанныеЗаполнения.Свойство("ПредоставитьМатериальнуюПомощьПриОтпуске", ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске);
		ДанныеЗаполнения.Свойство("ПредоставитьЕдиновременнуюВыплатуКОтпуску", ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску);
		
	КонецЕсли;
	
	РанняяДатаОтпуска = '00010101';
	ДокументОбъект.ПредоставитьДополнительныйОтпуск = Ложь;
	
	Для каждого ДанныеОтпуска Из ДанныеЗаполнения.ДанныеОтпусков Цикл
		
		Если РанняяДатаОтпуска > ДанныеОтпуска.ДатаНачала
			ИЛИ РанняяДатаОтпуска = '00010101' Тогда
			
			РанняяДатаОтпуска = ДанныеОтпуска.ДатаНачала;
			
		КонецЕсли; 
		
		КоличествоДнейКомпенсации = ?(ДанныеОтпуска.Свойство("КоличествоДнейКомпенсации"), ДанныеОтпуска.КоличествоДнейКомпенсации, 0);
		
		Если Не ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску Тогда 
			ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску = ?(ДанныеОтпуска.Свойство("ПредоставитьЕдиновременнуюВыплатуКОтпуску"), ДанныеОтпуска.ПредоставитьЕдиновременнуюВыплатуКОтпуску, Ложь);
		КонецЕсли;
		
		Если (ДанныеЗаполнения.Свойство("АвторасчетПериодаПредоставления")
			И ДанныеЗаполнения.АвторасчетПериодаПредоставления)
			ИЛИ НЕ ДанныеОтпуска.Свойство("НачалоПериодаЗаКоторыйПредоставляетсяОтпуск")
			ИЛИ НЕ ДанныеОтпуска.Свойство("КонецПериодаЗаКоторыйПредоставляетсяОтпуск") Тогда
			
			// Если необходимо рассчитать период предоставления отпуска - рассчитываем.
			СтруктураПараметров = ОстаткиОтпусков.ПараметрыПолученияРабочегоПериодаОтпуска();
			СтруктураПараметров.Сотрудник = ДокументОбъект.Сотрудник;
			СтруктураПараметров.ТекущийРегистратор = ДокументОбъект.Ссылка;
			СтруктураПараметров.ВидОтпуска = ДанныеОтпуска.ВидОтпуска;
			СтруктураПараметров.ДатаНачала = ДанныеОтпуска.ДатаНачала;
			СтруктураПараметров.ДатаОкончания = ДанныеОтпуска.ДатаОкончания;
			СтруктураПараметров.ДатаКомпенсации = ?(ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации), ДокументОбъект.ПериодРегистрации, НачалоМесяца(ТекущаяДатаСеанса()));
			СтруктураПараметров.КоличествоДнейКомпенсации = ?(ЗначениеЗаполнено(КоличествоДнейКомпенсации), КоличествоДнейКомпенсации, ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска);
			РабочийПериодОтпуска = ОстаткиОтпусков.РабочийПериодОтпуска(СтруктураПараметров);
			
			НачалоПериодаПредоставления = РабочийПериодОтпуска.РабочийГодС;
			КонецПериодаПредоставления = РабочийПериодОтпуска.РабочийГодПо;
		Иначе
			// Если нет - копируем из данных заполнения.
			НачалоПериодаПредоставления = ДанныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск;
			КонецПериодаПредоставления = ДанныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск;
		КонецЕсли;
			
		Если ДанныеОтпуска.ВидОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной") Тогда
			
			Если ДанныеОтпуска.Свойство("Основание") Тогда
				ДокументОбъект.Основание = ДанныеОтпуска.Основание;
			КонецЕсли;
			
			ДокументОбъект.ДатаНачалаОсновногоОтпуска = ДанныеОтпуска.ДатаНачала;
			ДокументОбъект.ДатаОкончанияОсновногоОтпуска = ДанныеОтпуска.ДатаОкончания;
			
			ДокументОбъект.КоличествоДнейОсновногоОтпуска = ДанныеОтпуска.КоличествоДней;
			ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска = КоличествоДнейКомпенсации;
			
			ДокументОбъект.ПредоставитьОсновнойОтпуск = ДокументОбъект.КоличествоДнейОсновногоОтпуска <> 0;
			
			ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска = ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска <> 0;
			
			ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск	= НачалоПериодаПредоставления;
			ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск	= КонецПериодаПредоставления;
			
			Если ЗначениеЗаполнено(ДанныеОтпуска.ВидОтпускаПрежний)
				И ДанныеОтпуска.ВидОтпускаПрежний <> ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной") Тогда
				
				СтрокиОтпуска = ДокументОбъект.ДополнительныеОтпуска.НайтиСтроки(Новый Структура("ВидОтпуска", ДанныеОтпуска.ВидОтпускаПрежний));
				Если СтрокиОтпуска.Количество() > 0 Тогда
					
					ДокументОбъект.ДополнительныеОтпуска.Удалить(СтрокиОтпуска[0]);
					ДокументОбъект.ПредоставитьДополнительныйОтпуск = ДокументОбъект.ДополнительныеОтпуска.Количество() > 0;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ДокументОбъект.ПредоставитьДополнительныйОтпуск = Истина;
			
			Если ЗначениеЗаполнено(ДанныеОтпуска.ВидОтпускаПрежний) Тогда
				
				Если ДанныеОтпуска.ВидОтпускаПрежний = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной") Тогда
				
					ДокументОбъект.ПредоставитьОсновнойОтпуск = Ложь;
					
					ДокументОбъект.ДатаНачалаОсновногоОтпуска = '00010101';
					ДокументОбъект.ДатаОкончанияОсновногоОтпуска = '00010101';
					
					ДокументОбъект.КоличествоДнейОсновногоОтпуска = 0;
					ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска = 0;
					ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска = Ложь;
					
					ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = '00010101';
					ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = '00010101';
					
					ИскомыйВидОтпуска = ДанныеОтпуска.ВидОтпуска;
					
				Иначе
					ИскомыйВидОтпуска = ДанныеОтпуска.ВидОтпускаПрежний;
				КонецЕсли
				
			Иначе
				ИскомыйВидОтпуска = ДанныеОтпуска.ВидОтпуска;
			КонецЕсли;
			
			СтрокиОтпуска = ДокументОбъект.ДополнительныеОтпуска.НайтиСтроки(Новый Структура("ВидОтпуска", ИскомыйВидОтпуска));
			Если СтрокиОтпуска.Количество() > 0 Тогда
				СтрокаДополнительногоОтпуска = СтрокиОтпуска[0];
			Иначе
				СтрокаДополнительногоОтпуска = ДокументОбъект.ДополнительныеОтпуска.Добавить();
			КонецЕсли;
			
			Если ДанныеОтпуска.Свойство("Основание") Тогда
				СтрокаДополнительногоОтпуска.Основание = ДанныеОтпуска.Основание;
			КонецЕсли;
			
			СтрокаДополнительногоОтпуска.ВидОтпуска = ДанныеОтпуска.ВидОтпуска;
			
			СтрокаДополнительногоОтпуска.ДатаНачала = ДанныеОтпуска.ДатаНачала;
			СтрокаДополнительногоОтпуска.ДатаОкончания = ДанныеОтпуска.ДатаОкончания;
			
			СтрокаДополнительногоОтпуска.КоличествоДней = ДанныеОтпуска.КоличествоДней;
			СтрокаДополнительногоОтпуска.КоличествоДнейКомпенсации = КоличествоДнейКомпенсации;
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДополнительногоОтпуска.ВидОтпуска, "ОтпускЯвляетсяЕжегодным") Тогда
				СтрокаДополнительногоОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = НачалоПериодаПредоставления;
				СтрокаДополнительногоОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = КонецПериодаПредоставления;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда 
		ДокументОбъект.ДополнительныеОтпуска.Очистить();
	КонецЕсли;
	
	Если Не ДокументОбъект.ЭтоНовый() Тогда 
		Если ДокументОбъект.ПредоставитьОсновнойОтпуск И ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) Тогда 
			РанняяДатаОтпуска = Мин(ДокументОбъект.ДатаНачалаОсновногоОтпуска, РанняяДатаОтпуска);
		КонецЕсли;
		Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда 
			Для Каждого СтрокаДополнительногоОтпуска Из ДокументОбъект.ДополнительныеОтпуска Цикл
				Если ЗначениеЗаполнено(СтрокаДополнительногоОтпуска.ДатаНачала) Тогда 
					РанняяДатаОтпуска = Мин(СтрокаДополнительногоОтпуска.ДатаНачала, РанняяДатаОтпуска);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.ДатаНачалаСобытия = РанняяДатаОтпуска;
	
	Если ДокументОбъект.ЭтоНовый() И Не ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаСобытия) Тогда
		ДокументОбъект.ДатаНачалаСобытия = НачалоМесяца(ТекущаяДатаСеанса());
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДокументОбъект.Сотрудник, "ДатаПриема");
		Если КадровыеДанные.Количество() > 0 
			И ЗначениеЗаполнено(КадровыеДанные[0].ДатаПриема) 
			И НачалоМесяца(КадровыеДанные[0].ДатаПриема) = ДокументОбъект.ДатаНачалаСобытия
			И КадровыеДанные[0].ДатаПриема > ДокументОбъект.ДатаНачалаСобытия Тогда
			// Если сотрудник принят в месяце начисления, то установим дату начал события равной дате приема.
			ДокументОбъект.ДатаНачалаСобытия = КадровыеДанные[0].ДатаПриема;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьКоличествоДнейОтпускаАвансом(ДокументОбъект);
	
	ЗарплатаКадрыРасширенный.УстановитьВариантРасчетаДокументаПоСреднемуЗаработку(ДокументОбъект);
	
	// Определим категории начислений.
	ДопПараметры = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаОсновногоОтпуска");
	ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаОсновногоОтпуска", ДопПараметры);
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаСобытия) И ЗначениеЗаполнено(ДокументОбъект.Сотрудник) Тогда
		ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(ДокументОбъект.ДатаНачалаСобытия, ДокументОбъект.Сотрудник, ДокументОбъект.ВидРасчетаОсновногоОтпуска);
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало	= ПериодРасчетаСреднего.ДатаНачала;
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание = ПериодРасчетаСреднего.ДатаОкончания;
	КонецЕсли;
	
	ПланируемаяДатыВыплатыОтпуска = РасчетЗарплатыРасширенный.ДатаСобытияСУчетомНерабочихДней(
		Документы.Отпуск.ПредварительнаяДатаОплатыОтпуска(ДокументОбъект), 
		ДокументОбъект.Организация, ДокументОбъект.Сотрудник);
	
	Если ПланируемаяДатыВыплатыОтпуска <> Неопределено Тогда
		ДокументОбъект.ПланируемаяДатаВыплаты = ПланируемаяДатыВыплатыОтпуска;
	КонецЕсли;
	
	Если ДокументОбъект.ЭтоНовый() Тогда
		
		Если ЗначениеЗаполнено(РанняяДатаОтпуска) И РанняяДатаОтпуска < ТекущаяДатаСеанса() Тогда
			ДокументОбъект.Дата = РанняяДатаОтпуска;
		Иначе
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ДокументОбъект.Дата);
		
		ЗапрашиваемыеЗначения = Новый Структура;
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
		
		ФиксированныеЗначения = Новый Массив;
		
		Если ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
			
			ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
			
			ИсключаемыеСвойства = Новый Массив;
			СведенияОПодписях = ПодписиДокументов.СведенияОПодписяхПоУмолчаниюДляОбъектаМетаданных(ДокументОбъект.Метаданные(), ДокументОбъект.Организация);
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.Руководитель) Тогда
				Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПодписях, "Руководитель")) Тогда
					ДокументОбъект.Руководитель = СведенияОПодписях.Руководитель;
					ИсключаемыеСвойства.Добавить("Руководитель");
				Иначе
					ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
				КонецЕсли;
			Иначе
				ИсключаемыеСвойства.Добавить("Руководитель");
			КонецЕсли; 
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.ДолжностьРуководителя) Тогда
				Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОПодписях, "ДолжностьРуководителя")) Тогда
					ДокументОбъект.ДолжностьРуководителя = СведенияОПодписях.ДолжностьРуководителя;
					ИсключаемыеСвойства.Добавить("ДолжностьРуководителя");
				Иначе
					ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
				КонецЕсли; 
			Иначе
				ИсключаемыеСвойства.Добавить("ДолжностьРуководителя");
			КонецЕсли; 
			
			ЗаполнитьЗначенияСвойств(ДокументОбъект, СведенияОПодписях, , СтрСоединить(ИсключаемыеСвойства, ","));
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.ГлавныйБухгалтер) Тогда
				ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", "ГлавныйБухгалтер");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.Бухгалтер) Тогда
				ЗапрашиваемыеЗначения.Вставить("Бухгалтер", "Бухгалтер");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.РаботникКадровойСлужбы) Тогда
				ЗапрашиваемыеЗначения.Вставить("РаботникКадровойСлужбы", "РаботникКадровойСлужбы");
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументОбъект.ДолжностьРаботникаКадровойСлужбы) Тогда
				ЗапрашиваемыеЗначения.Вставить("ДолжностьРаботникаКадровойСлужбы", "ДолжностьРаботникаКадровойСлужбы");
			КонецЕсли;
			
			ФиксированныеЗначения.Добавить("Организация");
			
		КонецЕсли;
		
		ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ДокументОбъект, ЗапрашиваемыеЗначения, ФиксированныеЗначения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОтпускаСотрудников(ДокументОбъект, ДанныеЗаполнения)
	
	Если ДокументОбъект.ЭтоНовый() Тогда 
	
		ДокументЗаполнения = ДанныеЗаполнения.ДокументЗаполнения;
		ДокументОбъект.Организация = ДанныеЗаполнения.Организация;
		ДокументОбъект.Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОбъект.Руководитель = ДанныеЗаполнения.Руководитель;
		ДокументОбъект.ДолжностьРуководителя = ДанныеЗаполнения.ДолжностьРуководителя;
		
		ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДанныеЗаполнения.ДатаНачала), Мин(ДанныеЗаполнения.ДатаНачала, ТекущаяДатаСеанса()), ТекущаяДатаСеанса());
		
		ДатаРегистрации = Макс(ДанныеЗаполнения.ДатаДокументаЗаполнения, ТекущаяДатаСеанса());
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ДатаНачала) И ДанныеЗаполнения.ДатаНачала < ДатаРегистрации Тогда 
			ДатаРегистрации = ДанныеЗаполнения.ДатаНачала;
		КонецЕсли;
		ДокументОбъект.ПериодРегистрации = НачалоМесяца(ДатаРегистрации);
		
		ЗапрашиваемыеЗначения = Новый Структура;
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
		ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
		ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", "ГлавныйБухгалтер");
		ЗапрашиваемыеЗначения.Вставить("Бухгалтер", "Бухгалтер");
		ЗапрашиваемыеЗначения.Вставить("РаботникКадровойСлужбы", "РаботникКадровойСлужбы");
		ЗапрашиваемыеЗначения.Вставить("ДолжностьРаботникаКадровойСлужбы", "ДолжностьРаботникаКадровойСлужбы");
		
		ФиксированныеЗначения = Новый Массив;
		ФиксированныеЗначения.Добавить("Организация");
		
		ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ДокументОбъект, ЗапрашиваемыеЗначения, ФиксированныеЗначения);
		
	КонецЕсли;
	
	ДокументОбъект.ДатаНачалаСобытия = ДанныеЗаполнения.ДатаНачала;
	Если Не ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаСобытия) Тогда
		ДокументОбъект.ДатаНачалаСобытия = НачалоМесяца(ДокументОбъект.ПериодРегистрации);
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ДокументОбъект.Сотрудник, "ДатаПриема");
		Если КадровыеДанные.Количество() > 0 
			И ЗначениеЗаполнено(КадровыеДанные[0].ДатаПриема) 
			И НачалоМесяца(КадровыеДанные[0].ДатаПриема) = ДокументОбъект.ДатаНачалаСобытия
			И КадровыеДанные[0].ДатаПриема > ДокументОбъект.ДатаНачалаСобытия Тогда
			// Если сотрудник принят в месяце начисления, то установим дату начал события равной дате приема.
			ДокументОбъект.ДатаНачалаСобытия = КадровыеДанные[0].ДатаПриема;
		КонецЕсли;
	КонецЕсли;
	
	ДокументОбъект.НачалоОтпуска = ДанныеЗаполнения.ДатаНачала;
	ДокументОбъект.ОкончаниеОтпуска = ДанныеЗаполнения.ДатаОкончания;
	
	ДокументОбъект.ПредоставитьОсновнойОтпуск = Ложь;
	ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска = Ложь;
	ДокументОбъект.ПредоставитьДополнительныйОтпуск = Ложь;
	ДокументОбъект.ДополнительныеОтпуска.Очистить();
	
	ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
	ВидыОтпусковБезОплаты = Справочники.ВидыОтпусков.ВидыОтпусковБезОплаты();
	
	КатегорияОтпуск = Документы.Отпуск.КатегорияНачисленияОтпуск(ДокументОбъект);
	КатегорияКомпенсация = Документы.Отпуск.КатегорияНачисленияКомпенсацияОтпуска(ДокументОбъект);
	КатегорияОтпускБезОплаты = Документы.Отпуск.КатегорияНачисленияОтпускБезОплаты();
	
	ПараметрыДополнительногоОтпуска = ОбщегоНазначенияБЗК.ПараметрыВыбораВСтруктуру( 
		ДокументОбъект, ДокументОбъект.Метаданные().ТабличныеЧасти.ДополнительныеОтпуска.Реквизиты.Найти("ВидРасчета"));
	ПараметрыКомпенсацииДополнительногоОтпуска = ОбщегоНазначенияБЗК.ПараметрыВыбораВСтруктуру( 
		ДокументОбъект, ДокументОбъект.Метаданные().ТабличныеЧасти.ДополнительныеОтпуска.Реквизиты.Найти("ВидРасчетаКомпенсации"));
		
	Для Каждого ДанныеОтпуска Из ДанныеЗаполнения.ДанныеОтпусков Цикл
		Если ДанныеОтпуска.ВидОтпуска = ОсновнойОтпуск Тогда 
			Если ЗначениеЗаполнено(ДанныеОтпуска.ДатаНачала) Тогда 
				ДокументОбъект.ПредоставитьОсновнойОтпуск = Истина;
				ДокументОбъект.ДатаНачалаОсновногоОтпуска = ДанныеОтпуска.ДатаНачала;
				ДокументОбъект.ДатаОкончанияОсновногоОтпуска = ДанныеОтпуска.ДатаОкончания;
				ДокументОбъект.КоличествоДнейОсновногоОтпуска = ДанныеОтпуска.КоличествоДней;
				ДокументОбъект.Основание = ДанныеОтпуска.Основание;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеОтпуска.КоличествоДнейКомпенсации) Тогда
				ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска = Истина;
				ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска = ДанныеОтпуска.КоличествоДнейКомпенсации;
			КонецЕсли;
			ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск;
			ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск;
		Иначе 
			ДокументОбъект.ПредоставитьДополнительныйОтпуск = Истина;
			НоваяСтрока = ДокументОбъект.ДополнительныеОтпуска.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеОтпуска);
			Если ЗначениеЗаполнено(НоваяСтрока.ВидОтпуска) И НоваяСтрока.КоличествоДней > 0
				И Не ЗначениеЗаполнено(НоваяСтрока.ВидРасчета) Тогда 
				КатегорияВидаОтпуска = КатегорияОтпуск;
				Если ВидыОтпусковБезОплаты.Найти(НоваяСтрока.ВидОтпуска) <> Неопределено Тогда
					КатегорияВидаОтпуска = КатегорияОтпускБезОплаты;
				КонецЕсли;
				ПараметрыДополнительногоОтпуска.Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", КатегорияВидаОтпуска);
				ПараметрыДополнительногоОтпуска.Отбор.Вставить("ВидОтпуска", НоваяСтрока.ВидОтпуска);
				НоваяСтрока.ВидРасчета = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(ПараметрыДополнительногоОтпуска.Отбор);
			КонецЕсли;
			Если ЗначениеЗаполнено(НоваяСтрока.ВидОтпуска) И НоваяСтрока.КоличествоДнейКомпенсации > 0
				И Не ЗначениеЗаполнено(НоваяСтрока.ВидРасчетаКомпенсации) Тогда 
				ПараметрыКомпенсацииДополнительногоОтпуска.Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", КатегорияКомпенсация);
				ПараметрыКомпенсацииДополнительногоОтпуска.Отбор.Вставить("ВидОтпуска", НоваяСтрока.ВидОтпуска);
				НоваяСтрока.ВидРасчетаКомпенсации = ПланыВидовРасчета.Начисления.НачислениеПоУмолчанию(ПараметрыКомпенсацииДополнительногоОтпуска.Отбор);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске = ДанныеЗаполнения.ПредоставитьМатериальнуюПомощьПриОтпуске;
	ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску = ДанныеЗаполнения.ПредоставитьЕдиновременнуюВыплатуКОтпуску;
	ДокументОбъект.ОсвобождатьСтавку = ДанныеЗаполнения.ОсвобождатьСтавку;
	
	ЗаполнитьКоличествоДнейОтпускаАвансом(ДокументОбъект);
	
	ЗарплатаКадрыРасширенный.УстановитьВариантРасчетаДокументаПоСреднемуЗаработку(ДокументОбъект);
	
	// Определим категории начислений.
	ПараметрыВыбораНачислений = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаОсновногоОтпуска");
	ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаОсновногоОтпуска", ПараметрыВыбораНачислений);
	
	Если ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда 
		ПараметрыВыбораКомпенсации = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаКомпенсацииОсновногоОтпуска");
		ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаКомпенсацииОсновногоОтпуска", ПараметрыВыбораКомпенсации);
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске Тогда 
		ПараметрыМатериальнойПомощи = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаМатериальнойПомощиПриОтпуске");
		ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаМатериальнойПомощиПриОтпуске", ПараметрыМатериальнойПомощи);
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску Тогда 
		ПараметрыЕдиновременнойВыплаты = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаЕдиновременнойВыплатыКОтпуску");
		ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаЕдиновременнойВыплатыКОтпуску", ПараметрыЕдиновременнойВыплаты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаСобытия) И ЗначениеЗаполнено(ДокументОбъект.Сотрудник) Тогда
		ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(ДокументОбъект.ДатаНачалаСобытия, ДокументОбъект.Сотрудник, ДокументОбъект.ВидРасчетаОсновногоОтпуска);
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало	= ПериодРасчетаСреднего.ДатаНачала;
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание = ПериодРасчетаСреднего.ДатаОкончания;
	КонецЕсли;
	
	ПланируемаяДатыВыплатыОтпуска = РасчетЗарплатыРасширенный.ДатаСобытияСУчетомНерабочихДней(
		Документы.Отпуск.ПредварительнаяДатаОплатыОтпуска(ДокументОбъект),
		ДокументОбъект.Организация, ДокументОбъект.Сотрудник);
	Если ПланируемаяДатыВыплатыОтпуска <> Неопределено Тогда
		ДокументОбъект.ПланируемаяДатаВыплаты = ПланируемаяДатыВыплатыОтпуска;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПланируемаяДатаВыплаты) Или ДокументОбъект.ПланируемаяДатаВыплаты < ДокументОбъект.Дата Тогда 
		ДокументОбъект.ПланируемаяДатаВыплаты = ДокументОбъект.Дата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПорядокВыплаты) Тогда 
		ДокументОбъект.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Межрасчет;
	КонецЕсли;
	
	РассчитатьДокумент = Истина;
	Если Не ПривилегированныйРежим() Тогда
		ПраваНаДокумент = МногофункциональныеДокументыБЗК.ПраваНаДокумент(ДокументОбъект)["НачисленнаяЗарплата"];
		РассчитатьДокумент = ПраваНаДокумент <> Неопределено И ПраваНаДокумент.Редактирование;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Если (РассчитатьДокумент Или Константы.РассчитыватьДокументыПриРедактировании.Получить()) И ДокументГотовКРасчету(ДокументОбъект) Тогда 
		ПараметрыРасчета = Документы.Отпуск.ПараметрыРасчета();
		ПараметрыРасчета.ПерезаполнитьНачисления = Истина;
		ПараметрыРасчета.СохранятьИсправления = Истина;
		ПараметрыРасчета.СкорректированСреднийЗаработок = Ложь;
		ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего = Истина;
		Рассчитать(ДокументОбъект, ПараметрыРасчета);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоДнейОтпускаАвансом(ДокументОбъект)
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.Сотрудник) Или Не ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаСобытия) Тогда 
		Возврат;
	КонецЕсли;
	
	ИсключаемыеРегистраторы = Новый Массив;
	ИсключаемыеРегистраторы.Добавить(ДокументОбъект.Ссылка);
	ИсключаемыеРегистраторы.Добавить(ДокументОбъект.ИсправленныйДокумент);
	
	ОстаткиВРазрезеВидовОтпусков = Документы.Отпуск.ОстаткиВРазрезеВидовОтпусков(ДокументОбъект.Сотрудник, ДокументОбъект.ДатаНачалаСобытия, ИсключаемыеРегистраторы);
	
	КоличествоДнейОтпусков = Неопределено;
	Если ДокументОбъект.ДокументРассчитан Тогда 
		
		КоличествоДнейОтпусков = Новый Соответствие;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Начисления", ДокументОбъект.Начисления);
		Запрос.УстановитьПараметр("КатегорииОплатыДолейРКСН", ПланыВидовРасчета.Начисления.КатегорииНачисленийОплатыДолейРКиСН());
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Начисления.Начисление КАК Начисление,
			|	Начисления.ОплаченоДней КАК ОплаченоДней
			|ПОМЕСТИТЬ ВТНачисленияДокумента
			|ИЗ
			|	&Начисления КАК Начисления
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Начисления.ВидОтпуска КАК ВидОтпуска,
			|	СУММА(НачисленияДокумента.ОплаченоДней) КАК ОплаченоДней
			|ИЗ
			|	ВТНачисленияДокумента КАК НачисленияДокумента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
			|		ПО НачисленияДокумента.Начисление = Начисления.Ссылка
			|			И (Начисления.ВидОтпуска.ОтпускЯвляетсяЕжегодным = ИСТИНА)
			|			И (НЕ Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&КатегорииОплатыДолейРКСН))
			|
			|СГРУППИРОВАТЬ ПО
			|	Начисления.ВидОтпуска";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			КоличествоДнейОтпусков.Вставить(Выборка.ВидОтпуска, Выборка.ОплаченоДней);
		КонецЦикла;
		
	КонецЕсли;
	
	ДокументОбъект.КоличествоДнейОсновногоОтпускаАвансом = 0;
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
		ОстатокОтпуска = ОстаткиВРазрезеВидовОтпусков.Получить(ОсновнойОтпуск);
		КоличествоДней = ДокументОбъект.КоличествоДнейОсновногоОтпуска;
		Если КоличествоДнейОтпусков <> Неопределено И КоличествоДнейОтпусков[ОсновнойОтпуск] <> Неопределено Тогда
			КоличествоДней = КоличествоДнейОтпусков[ОсновнойОтпуск];
		КонецЕсли;	
		ДокументОбъект.КоличествоДнейОсновногоОтпускаАвансом = Документы.Отпуск.КоличествоДнейОтпускаАвансом(КоличествоДней, ОстатокОтпуска);
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда 
		ВидыОтпусков = ДокументОбъект.ДополнительныеОтпуска.ВыгрузитьКолонку("ВидОтпуска");
		ЕжегодныеОтпуска = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВидыОтпусков, "ОтпускЯвляетсяЕжегодным");
		Для Каждого СтрокаОтпуска Из ДокументОбъект.ДополнительныеОтпуска Цикл
			Если Не ЕжегодныеОтпуска[СтрокаОтпуска.ВидОтпуска] Тогда
				СтрокаОтпуска.КоличествоДнейАвансом = 0;
				Продолжить;
			КонецЕсли;
			КоличествоДней = СтрокаОтпуска.КоличествоДней;
			Если КоличествоДнейОтпусков <> Неопределено И КоличествоДнейОтпусков[СтрокаОтпуска.ВидОтпуска] <> Неопределено Тогда
				КоличествоДней = КоличествоДнейОтпусков[СтрокаОтпуска.ВидОтпуска];
			КонецЕсли;	
			ОстатокОтпуска = ОстаткиВРазрезеВидовОтпусков.Получить(СтрокаОтпуска.ВидОтпуска);
			СтрокаОтпуска.КоличествоДнейАвансом = Документы.Отпуск.КоличествоДнейОтпускаАвансом(КоличествоДней, ОстатокОтпуска);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ПериодыНачисленийПродлеваемыхОтпусков(ДокументОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтпускНачисления.ДатаНачала КАК ДатаНачала,
		|	ОтпускНачисления.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.Отпуск.Начисления КАК ОтпускНачисления
		|ГДЕ
		|	ОтпускНачисления.Ссылка = &Ссылка
		|	И ОтпускНачисления.Начисление.ВидОтпуска В (&ВидОтпуска)";
	
	Запрос.УстановитьПараметр("ВидОтпуска", Справочники.ВидыОтпусков.ВидыПродлеваемыхОтпусков());
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.ИсправленныйДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьПоОснованиямПриостановки(ДокументОбъект, ДанныеЗаполнения)
	ДанныеБольничного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.ОснованиеПриостановки, 
		"ДатаНачала, ДатаОкончания, ПериодРегистрации");
	ДокументОбъект.ПериодРегистрации = ДанныеБольничного.ПериодРегистрации;
	ДокументОбъект.ПорядокВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
	НоваяСтрока = ДокументОбъект.ПериодыПриостановкиОтпуска.Добавить();
	НоваяСтрока.Причина = ДанныеЗаполнения.ОснованиеПриостановки;
	ПериодПересечения = ОбщегоНазначенияБЗК.ПериодПересеченияДвухИнтервалов(ДанныеБольничного.ДатаНачала, 
		ДанныеБольничного.ДатаОкончания, ДокументОбъект.ДатаНачалаПериодаОтсутствия, ДокументОбъект.ДатаОкончанияПериодаОтсутствия);
	НоваяСтрока.ДатаНачалаПериода = ПериодПересечения.ДатаНачала;
	НоваяСтрока.ДатаОкончанияПериода = ПериодПересечения.ДатаОкончания;
	
	Документы.Отпуск.ЗаполнитьКоличествоДнейПриостановки(ДокументОбъект, НоваяСтрока);
КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовШапки(ДокументОбъект, КонтейнерОшибок)
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПериодРегистрации) Тогда
		ТекстСообщения = НСтр("ru = 'Не указан период регистрации.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПериодРегистрации", ТекстСообщения, "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" обязательно к заполнению.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Организация", ТекстСообщения, "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект.Сотрудник) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Сотрудник"" обязательно к заполнению.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Сотрудник", ТекстСообщения, "");
	КонецЕсли;

	Если НЕ ДокументОбъект.ПредоставитьОсновнойОтпуск 
		И НЕ ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска 
		И НЕ ДокументОбъект.ПредоставитьДополнительныйОтпуск 
		И НЕ ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске Тогда
		ТекстСообщения = НСтр("ru = 'Документом не оплачивается ни основной, ни дополнительный отпуск.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.", ТекстСообщения, "");
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) И НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) Тогда
			Если НЕ ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
				ТекстСообщения = НСтр("ru = 'Необходимо заполнить даты начала и окончания отпуска.'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДатаНачалаОсновногоОтпуска", ТекстСообщения, "");
			Иначе
				ТекстСообщения = НСтр("ru = 'Флажок оплаты основного отпуска взведен, но не одно поле не заполнено. Снимите флажок, или заполните даты основного отпуска.'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПредоставитьОсновнойОтпуск", ТекстСообщения, "");
			КонецЕсли;
		Иначе
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнена дата начала основного отпуска.'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДатаНачалаОсновногоОтпуска", ТекстСообщения, "");
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) И ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнена дата окончания основного отпуска.'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДатаОкончанияОсновногоОтпуска", ТекстСообщения, "");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) И ДокументОбъект.ДатаНачалаОсновногоОтпуска > ДокументОбъект.ДатаОкончанияОсновногоОтпуска Тогда
				ТекстСообщения = НСтр("ru = 'Дата окончания основного отпуска не может быть меньше даты начала.'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДатаОкончанияОсновногоОтпуска", ТекстСообщения, "");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		Если НЕ	ЗначениеЗаполнено(ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска) Тогда
			ТекстСообщения = НСтр("ru = 'Флажок оплаты компенсации основного отпуска взведен, но не указано количество дней. Снимите флажок или укажите количество дней компенсации'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПредоставитьКомпенсациюОсновногоОтпуска", ТекстСообщения, "");
		КонецЕсли;
	КонецЕсли;

	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда
		Если ДокументОбъект.ДополнительныеОтпуска.Количество() < 1 Тогда                            			
			ТекстСообщения = НСтр("ru = 'Флажок оплаты дополнительных отпусков взведен, но не один отпуск не добавлен. Снимите флажок или добавьте дополнительный отпуск.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска", ТекстСообщения, "");
		Иначе
			
			Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
				Период = Новый Структура;
				Период.Вставить("НомерСтроки", 0);
				Период.Вставить("ДатаНачала", ДокументОбъект.ДатаНачалаОсновногоОтпуска);
				Период.Вставить("ДатаОкончания", ДокументОбъект.ДатаОкончанияОсновногоОтпуска);
				НомераСтрок = ПересеченияПериодов(Период, ДокументОбъект.ДополнительныеОтпуска);
				Если ЗначениеЗаполнено(НомераСтрок) Тогда
					ТекстСообщения = НСтр("ru = 'Период основного отпуска пересекается с периодами следующих строк дополнительных отпусков: %1.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомераСтрок);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска", ТекстСообщения, "");
				КонецЕсли;
			КонецЕсли;
			
			Для каждого ДополнительныйОтпуск Из ДокументОбъект.ДополнительныеОтпуска Цикл
				ИндексСтроки = ДополнительныйОтпуск.НомерСтроки - 1;
				Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ВидОтпуска) Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не заполнен вид дополнительного отпуска.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ВидОтпуска", ТекстСообщения, "", ИндексСтроки);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) И НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания)
					И НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДнейКомпенсации) Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не заполнены ни даты отпуска, ни количество дней компенсации.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ДатаНачала", ТекстСообщения, "", ИндексСтроки);
				Иначе
					Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) Тогда
						ТекстСообщения = НСтр("ru = 'В строке %1 не заполнена дата начала отпуска.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ДатаНачала", ТекстСообщения, "", ИндексСтроки);
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) Тогда
						ТекстСообщения = НСтр("ru = 'В строке %1 не заполнена дата окончания отпуска.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ДатаОкончания", ТекстСообщения, "", ИндексСтроки);
					КонецЕсли;
					Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) 
						И ДополнительныйОтпуск.ДатаНачала > ДополнительныйОтпуск.ДатаОкончания Тогда
						ТекстСообщения = НСтр("ru = 'В строке %1 дата окончания отпуска меньше даты начала.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ДатаОкончания", ТекстСообщения, "", ИндексСтроки);
					КонецЕсли;
					Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) 
						И ДополнительныйОтпуск.ДатаНачала <= ДополнительныйОтпуск.ДатаОкончания  Тогда
						НомераСтрок = ПересеченияПериодов(ДополнительныйОтпуск, ДокументОбъект.ДополнительныеОтпуска);
						Если ЗначениеЗаполнено(НомераСтрок) Тогда
							ТекстСообщения = НСтр("ru = 'Период строки %1 пересекается с периодами следующих строк: %2.'");
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки, НомераСтрок);
							ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ДатаОкончания", ТекстСообщения, "", ИндексСтроки);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	    	
	ПроверитьЦелостностьПериодаОтпуска(ДокументОбъект, КонтейнерОшибок);

КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(ДокументОбъект, КонтейнерОшибок, ПроверкаПередРасчетом = Ложь)
	
	Если Не ДокументОбъект.ДокументРассчитан И Не ПроверкаПередРасчетом Тогда
		Возврат;
	КонецЕсли;	
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск 
		И ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) 
		И НЕ ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаОсновногоОтпуска) Тогда
		
		Если ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияОсновногоОтпуска")  Тогда
			ТекстСообщения = НСтр("ru = 'Не выбран вид начисления для оплаты основного отпуска.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось подобрать вид начисления для оплаты основного отпуска.'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ВидРасчетаОсновногоОтпуска", ТекстСообщения, "");
		
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска 
		И Не ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска) Тогда
		Если ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияКомпенсацииОсновногоОтпуска") Тогда 
			ТекстСообщения = НСтр("ru = 'Не выбран вид начисления для оплаты компенсации основного отпуска.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось подобрать вид начисления для оплаты компенсации основного отпуска.'");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ВидРасчетаКомпенсацииОсновногоОтпуска", ТекстСообщения, "");
	КонецЕсли; 
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда
		Для каждого ДополнительныйОтпуск Из ДокументОбъект.ДополнительныеОтпуска Цикл
			ИндексСтроки = ДополнительныйОтпуск.НомерСтроки - 1;
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала)	И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) 
				И Не ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДней) Тогда
				ТекстСообщения = НСтр("ru = 'В строке %1 указаны даты отпуска, но не указано количество дней.'");
				ЗначениеПодстановки = ДополнительныйОтпуск.НомерСтроки;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЗначениеПодстановки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].КоличествоДней", ТекстСообщения, "", ИндексСтроки);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала)	И ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаОкончания) 
				И ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДней) И НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ВидРасчета) Тогда
				Если ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияДополнительногоОтпуска") Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не выбран вид начисления для оплаты отпуска.'");
					ЗначениеПодстановки = ДополнительныйОтпуск.НомерСтроки;
				Иначе 
					ТекстСообщения = НСтр("ru = 'Не удалось подобрать вид начисления для оплаты %1.'"); 
					ЗначениеПодстановки = ДополнительныйОтпуск.ВидОтпуска;
				КонецЕсли;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЗначениеПодстановки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ВидРасчета", ТекстСообщения, "", ИндексСтроки);
			КонецЕсли;
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДнейКомпенсации) И НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.ВидРасчетаКомпенсации) Тогда
				Если ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияКомпенсацииДополнительногоОтпуска") Тогда 	
					ТекстСообщения = НСтр("ru = 'В строке %1 не выбран вид начисления для оплаты компенсации отпуска.'");
					ЗначениеПодстановки = ДополнительныйОтпуск.НомерСтроки;
				Иначе 
					ТекстСообщения = НСтр("ru = 'Не удалось подобрать вид начисления для оплаты компенсации %1.'"); 
					ЗначениеПодстановки = ДополнительныйОтпуск.ВидОтпуска;
				КонецЕсли;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЗначениеПодстановки);
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].ВидРасчетаКомпенсации", ТекстСообщения, "", ИндексСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске 
		И ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияОплатыМатериальнойПомощиКОтпуску") 
		И Не ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаМатериальнойПомощиПриОтпуске) Тогда
		ТекстСообщения = НСтр("ru = 'Не выбран вид начисления для выплаты материальной помощи к отпуску.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ВидРасчетаМатериальнойПомощиПриОтпуске", ТекстСообщения, "");
	КонецЕсли;
	
	ПроверитьЗаполнениеПланируемойДатыВыплаты(ДокументОбъект, КонтейнерОшибок, ПроверкаПередРасчетом);
	
КонецПроцедуры

Процедура ПроверитьЦелостностьПериодаОтпуска(ДокументОбъект, КонтейнерОшибок)
	
	ПериодыРазрывов = ПериодыРазрывов(ДокументОбъект);
	
	Для каждого ПериодРазрыва Из ПериодыРазрывов Цикл
		Если НачалоДня(ПериодРазрыва.ДатаНачала) = НачалоДня(ПериодРазрыва.ДатаОкончания) Тогда
			ТекстСообщения = НСтр("ru = 'Период отпуска прерывается %1.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Формат(ПериодРазрыва.ДатаНачала,"ДЛФ=D"));
		Иначе 				
			ТекстСообщения = НСтр("ru = 'Период отпуска прерывается с %1 по %2.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Формат(ПериодРазрыва.ДатаНачала,"ДЛФ=D"), Формат(ПериодРазрыва.ДатаОкончания,"ДЛФ=D"));
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПериодРазрыва" + ПериодРазрыва.ДатаНачала, ТекстСообщения, "");
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПланируемойДатыВыплаты(ДокументОбъект, КонтейнерОшибок, ПроверкаПередРасчетом)
	
	МассивНачисленийДокумента = Новый Массив;
	
	Если НЕ ПроверкаПередРасчетом Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНачисленийДокумента, ДокументОбъект.Начисления.ВыгрузитьКолонку("Начисление"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНачисленийДокумента, ДокументОбъект.НачисленияПерерасчет.ВыгрузитьКолонку("Начисление"), Истина);
	КонецЕсли;
	
	Если УчетНДФЛРасширенный.ДатаВыплатыОбязательнаКЗаполнению(ДокументОбъект.ПорядокВыплаты, МассивНачисленийДокумента)
		И Не ЗначениеЗаполнено(ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
		ТекстСообщения = НСтр("ru = 'Дата выплаты обязательна к заполнению при выплате в межрасчет.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПланируемаяДатаВыплаты", ТекстСообщения, "");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПериодРаботыЗаКоторыйПредоставляетсяОтпуск(ДокументОбъект, КонтейнерОшибок)
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Или ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск) И ЗначениеЗаполнено(ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск) 
			И ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск > ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск Тогда
			ТекстСообщения = НСтр("ru  = 'Начало периода работы за который предоставляется отпуск (компенсация) не может быть больше окончания этого периода.'"); 
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", ТекстСообщения, "");
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда 
		ВидыОтпусков = ДокументОбъект.ДополнительныеОтпуска.ВыгрузитьКолонку("ВидОтпуска");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыОтпусков.Ссылка КАК ВидОтпуска
		|ИЗ
		|	Справочник.ВидыОтпусков КАК ВидыОтпусков
		|ГДЕ
		|	ВидыОтпусков.ОтпускБезОплаты = ЛОЖЬ
		|	И ВидыОтпусков.Ссылка В(&ВидыОтпусков)
		|	И ВидыОтпусков.ОтпускЯвляетсяЕжегодным = ИСТИНА";
		Запрос.УстановитьПараметр("ВидыОтпусков", ВидыОтпусков);
		
		ЕжегодныеОтпуска = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидОтпуска");
		
		Для каждого ДополнительныйОтпуск Из ДокументОбъект.ДополнительныеОтпуска Цикл
			
			ИндексСтроки = ДополнительныйОтпуск.НомерСтроки - 1;
			
			Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДней) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЕжегодныеОтпуска.Найти(ДополнительныйОтпуск.ВидОтпуска) = Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск) 
					И НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск) Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не указан период за который предоставляется отпуск.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", ТекстСообщения, "", ИндексСтроки);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск) 
					И ЗначениеЗаполнено(ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск) Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не заполнена дата начала периода за который предоставляется отпуск.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", ТекстСообщения, "", ИндексСтроки);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск) 
					И ЗначениеЗаполнено(ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск) Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 не заполнена дата окончания периода за который предоставляется отпуск.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].КонецПериодаЗаКоторыйПредоставляетсяОтпуск", ТекстСообщения, "", ИндексСтроки);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск) 
					И ЗначениеЗаполнено(ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск) 
					И ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск > ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск Тогда
					ТекстСообщения = НСтр("ru = 'В строке %1 дата окончания периода за который предоставляется отпуск меньше даты начала.'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДополнительныйОтпуск.НомерСтроки);
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДополнительныеОтпуска[%1].НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", ТекстСообщения, "", ИндексСтроки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ПересеченияПериодов(ПроверяемыйПериод, Периоды)
	НомераСтрок = "";
	Если ЗначениеЗаполнено(ПроверяемыйПериод.ДатаНачала) Тогда
		
		Для каждого Период Из Периоды Цикл
			Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) Тогда
				Продолжить;
			КонецЕсли;
			Если ПроверяемыйПериод.НомерСтроки < Период.НомерСтроки Тогда
				Если ПроверяемыйПериод.ДатаНачала <= Период.ДатаНачала И ПроверяемыйПериод.ДатаОкончания >= Период.ДатаНачала Тогда
					НомераСтрок = НомераСтрок + ", " + Период.НомерСтроки; 
					Продолжить;
				КонецЕсли;
				Если ПроверяемыйПериод.ДатаНачала >= Период.ДатаНачала И ПроверяемыйПериод.ДатаНачала <= Период.ДатаОкончания Тогда
					НомераСтрок = НомераСтрок + ", " + Период.НомерСтроки; 
					Продолжить;
				КонецЕсли;
				Если ПроверяемыйПериод.ДатаОкончания >= Период.ДатаНачала И ПроверяемыйПериод.ДатаОкончания <= Период.ДатаОкончания Тогда
					НомераСтрок = НомераСтрок + ", " + Период.НомерСтроки; 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	Возврат Прав(НомераСтрок, СтрДлина(НомераСтрок) - 2);
КонецФункции

Функция ПериодыРазрывов(ДокументОбъект)
	
	ПериодыОтпусков = Новый ТаблицаЗначений;
	ПериодыОтпусков.Колонки.Добавить("ДатаНачала"); 
	ПериодыОтпусков.Колонки.Добавить("ДатаОкончания");
	
	ПериодыРазрывов = ПериодыОтпусков.СкопироватьКолонки();
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		ПериодОсновногоОтпуска = ПериодыОтпусков.Добавить();
		ПериодОсновногоОтпуска.ДатаНачала 		= ДокументОбъект.ДатаНачалаОсновногоОтпуска;
		ПериодОсновногоОтпуска.ДатаОкончания 	= ДокументОбъект.ДатаОкончанияОсновногоОтпуска;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДокументОбъект.ДополнительныеОтпуска, ПериодыОтпусков);
	КонецЕсли;
	
	Компенсации = ПериодыОтпусков.НайтиСтроки(Новый Структура("ДатаНачала", '00010101'));
	Для каждого СтрокаКомпенсации Из Компенсации Цикл
		ПериодыОтпусков.Удалить(СтрокаКомпенсации);
	КонецЦикла;
	
	ПериодыОтпусков.Сортировать("ДатаНачала, ДатаОкончания");
	
	КоличествоПериодов = ПериодыОтпусков.Количество();
	Индекс = 0;
	Пока Индекс < КоличествоПериодов - 1 Цикл
		ТекущийПериод 	= ПериодыОтпусков[Индекс];
		СледующийПериод = ПериодыОтпусков[Индекс + 1];
		
		Если КонецДня(ТекущийПериод.ДатаОкончания) + 1 < НачалоДня(СледующийПериод.ДатаНачала) Тогда
			ПериодРазрыва = ПериодыРазрывов.Добавить();
			ПериодРазрыва.ДатаНачала = КонецДня(ТекущийПериод.ДатаОкончания) + 1;
			ПериодРазрыва.ДатаОкончания = НачалоДня(СледующийПериод.ДатаНачала) - 1;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат ПериодыРазрывов
КонецФункции

Процедура ПроверитьПериодДействияНачислений(ДокументОбъект, Отказ)
	ПараметрыПроверкиПериодаДействия = РасчетЗарплатыРасширенный.ПараметрыПроверкиПериодаДействия();
	ПараметрыПроверкиПериодаДействия.Ссылка = ДокументОбъект.Ссылка;
	ПроверяемыеКоллекции = Новый Массив;
	ПроверяемыеКоллекции.Добавить(РасчетЗарплатыРасширенный.ОписаниеКоллекцииДляПроверкиПериодаДействия("Начисления", НСтр("ru='Начисления'")));
	ПроверяемыеКоллекции.Добавить(РасчетЗарплатыРасширенный.ОписаниеКоллекцииДляПроверкиПериодаДействия("Удержания", НСтр("ru='Удержания'"), "Удержание"));
	ПроверяемыеКоллекции.Добавить(РасчетЗарплатыРасширенный.ОписаниеКоллекцииДляПроверкиПериодаДействия("НачисленияПерерасчет", НСтр("ru='Перерасчет прошлого периода'")));
	РасчетЗарплатыРасширенный.ПроверитьПериодДействияВКоллекцияхНачислений(ДокументОбъект, ПараметрыПроверкиПериодаДействия, ПроверяемыеКоллекции, Отказ);
КонецПроцедуры

Процедура ПроверитьКоличествоДнейОтгула(ДокументОбъект, КонтейнерОшибок)
	
	Если ДокументОбъект.ПредоставитьОтгул И ДокументОбъект.КоличествоДнейОтгула = 0 Тогда  
		ТекстСообщения = НСтр("ru = 'Не указано количество дней отгула.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.КоличествоДнейОтгула", ТекстСообщения, "");
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьПроверенныеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ПроверяемыеРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Организация");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Сотрудник");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПланируемаяДатаВыплаты");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "НачалоПериодаЗаКоторыйПредоставляетсяОтпуск");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "КонецПериодаЗаКоторыйПредоставляетсяОтпуск");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДополнительныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск");

КонецПроцедуры

Процедура ПроверитьПересекающиесяБольничные(ДокументОбъект)
	
	ПересекающиесяБольничные = Новый Массив;
	КатегорииБольничного = Новый Массив;
	КатегорииБольничного.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста);
	КатегорииБольничного.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя);
	КатегорииБольничного.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	КатегорииБольничного.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание);
	
	НачисленияПродлеваемыхОтпусковДокумента = ПериодыНачисленийПродлеваемыхОтпусков(ДокументОбъект);

	Отборы = Новый Массив;
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "ФизическоеЛицо", "В", ДокументОбъект.ФизическоеЛицо);
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "ПериодДействия", ">=", 
		НачалоМесяца(ДокументОбъект.ДатаНачалаПериодаОтсутствия));
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "ПериодДействия", "<=", 
		НачалоМесяца(ДокументОбъект.ДатаОкончанияПериодаОтсутствия));
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(Отборы, "ВидРасчета.КатегорияНачисленияИлиНеоплаченногоВремени",
		"В", КатегорииБольничного);
	НачисленияПересекающегосяБольничного = РегистрыРасчета.Начисления.РезультирующийПериодДействия(Отборы);
		
	Для Каждого НачислениеЕжегодногоОплачиваемогоОтпускаДокумента Из НачисленияПродлеваемыхОтпусковДокумента Цикл
		Для Каждого НачислениеПересекающегосяБольничного Из НачисленияПересекающегосяБольничного Цикл
			Если ОбщегоНазначенияБЗК.ИнтервалыПересекаются(
				НачислениеЕжегодногоОплачиваемогоОтпускаДокумента.ДатаНачала, 
				НачислениеЕжегодногоОплачиваемогоОтпускаДокумента.ДатаОкончания, 
				НачислениеПересекающегосяБольничного.ПериодДействияНачало,
				НачислениеПересекающегосяБольничного.ПериодДействияКонец) Тогда
				ПересекающийсяБольничныйПоНачислению = НачислениеПересекающегосяБольничного.Регистратор;
				ПересекающиесяБольничные.Добавить(ПересекающийсяБольничныйПоНачислению);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	ПересекающиесяБольничные = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПересекающиесяБольничные);
	ТекстОтменыПроведенияБольничных = Новый Массив;
	Для Каждого Больничный Из ПересекающиесяБольничные Цикл
		ТекстОтменыПроведенияБольничных.Добавить(СтрШаблон(НСтр("ru = 'Отмените проведение %1'"), Больничный));
	КонецЦикла;
	
	ИнформацияОПересечении = СтрСоединить(ТекстОтменыПроведенияБольничных, Символы.ПС);
	
	Если ПересекающиесяБольничные.Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru = 'Отмена проведения запрещена. 
			|Есть больничные, пересекающиеся с исправленным документом.'") + Символы.ПС + ИнформацияОПересечении;
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПересечениеПериодовОтсутствия(ДокументОбъект, Отказ)
	
	РезультатПроверки = РезультатПроверкиПересеченийПериодовОтсутствия(ДокументОбъект);
	
	ДанныеСотрудника = РезультатПроверки.ДанныеСотрудников.Получить(ДокументОбъект.Сотрудник);
	Если ДанныеСотрудника = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.Отказ Тогда
		ТекстСообщения = НСтр("ru = 'На период %1 сотруднику уже зарегистрирован отпуск документом %2.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДанныеСотрудника.ПредставлениеПериода, ДанныеСотрудника.Регистратор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПослеПереноса(ДокументОбъект, ДанныеЗаполнения)
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		
		ВидОсновногоОтпуска = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
		
		СтруктураПараметров = ОстаткиОтпусков.ПараметрыПолученияРабочегоПериодаОтпуска();
		СтруктураПараметров.Сотрудник 			= ДокументОбъект.Сотрудник;
		СтруктураПараметров.ТекущийРегистратор 	= ДокументОбъект.Ссылка;
		СтруктураПараметров.ВидОтпуска 			= ДокументОбъект.ВидОсновногоОтпуска;
		СтруктураПараметров.ДатаНачала 			= ДокументОбъект.ДатаНачалаОсновногоОтпуска;
		СтруктураПараметров.ДатаОкончания 		= ДокументОбъект.ДатаОкончанияОсновногоОтпуска;
		СтруктураПараметров.ДатаКомпенсации 	= ДокументОбъект.ПериодРегистрации;
		СтруктураПараметров.КоличествоДнейКомпенсации = ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска;
		РабочийПериодОтпуска = ОстаткиОтпусков.РабочийПериодОтпуска(СтруктураПараметров);
		
		ДокументОбъект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = РабочийПериодОтпуска.РабочийГодС;
		ДокументОбъект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск  = РабочийПериодОтпуска.РабочийГодПо;
		
	КонецЕсли;
	
	Для каждого СтрокаДополнительногоОтпуска Из ДокументОбъект.ДополнительныеОтпуска Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДополнительногоОтпуска.ВидОтпуска) Тогда
			ПредоставитьДополнительныйОтпуск = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаДополнительногоОтпуска.ВидОтпуска, "ОтпускЯвляетсяЕжегодным") Тогда
			
			СтруктураПараметров = ОстаткиОтпусков.ПараметрыПолученияРабочегоПериодаОтпуска();
			СтруктураПараметров.Сотрудник = ДокументОбъект.Сотрудник;
			СтруктураПараметров.ТекущийРегистратор = ДокументОбъект.Ссылка;
			СтруктураПараметров.ВидОтпуска = СтрокаДополнительногоОтпуска.ВидОтпуска;
			СтруктураПараметров.ДатаНачала = СтрокаДополнительногоОтпуска.ДатаНачала;
			СтруктураПараметров.ДатаОкончания = СтрокаДополнительногоОтпуска.ДатаОкончания;
			СтруктураПараметров.ДатаКомпенсации = ДокументОбъект.ПериодРегистрации;
			СтруктураПараметров.КоличествоДнейКомпенсации = 0;
			РабочийПериодОтпуска = ОстаткиОтпусков.РабочийПериодОтпуска(СтруктураПараметров);
			
			СтрокаДополнительногоОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = РабочийПериодОтпуска.РабочийГодС;
			СтрокаДополнительногоОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск  = РабочийПериодОтпуска.РабочийГодПо;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Определим категории начислений.
	ДопПараметры = Документы.Отпуск.ДополнительныеПараметрыВыбораНачислений(ДокументОбъект, "ВидРасчетаОсновногоОтпуска");
	ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ДокументОбъект, "ВидРасчетаОсновногоОтпуска", ДопПараметры);

	ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(ДокументОбъект.ДатаНачалаСобытия, ДокументОбъект.Сотрудник, ДокументОбъект.ВидРасчетаОсновногоОтпуска);
	ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало	= ПериодРасчетаСреднего.ДатаНачала;
	ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание = ПериодРасчетаСреднего.ДатаОкончания;
	
	ЗапрашиваемыеЗначения = Новый Структура;
	ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
	ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
	ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
	ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
	ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", "ГлавныйБухгалтер");
	ЗапрашиваемыеЗначения.Вставить("Бухгалтер", "Бухгалтер");
	ЗапрашиваемыеЗначения.Вставить("РаботникКадровойСлужбы", "РаботникКадровойСлужбы");
	ЗапрашиваемыеЗначения.Вставить("ДолжностьРаботникаКадровойСлужбы", "ДолжностьРаботникаКадровойСлужбы");
	ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ДокументОбъект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиМенеджераРасчета(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, СохранятьИсправления = Истина)
	ОписаниеДокумента = Документы.Отпуск.ОписаниеДокументаРасчета();
	ПараметрыИсправляемого = Документы.Отпуск.ПараметрыИсправляемогоДокумента(ДокументОбъект.ИсправленныйДокумент);
	
	МенеджерРасчета.ИсключаемыйРегистратор = ДокументОбъект.Ссылка;
	
	ИсправлениеРасчетовБЗК.НастроитьМенеджерРасчета(МенеджерРасчета, ДокументОбъект, ОписаниеДокумента, ПараметрыИсправляемого);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		Модуль.ПриИнициализацииМенеджераРасчетаДляЗаполненияДокументаРасчетаЗарплаты(МенеджерРасчета);
	КонецЕсли;
	
	МенеджерРасчета.НастройкиРасчета.РассчитыватьНачисления = Истина;
	МенеджерРасчета.НастройкиРасчета.РассчитыватьНДФЛ = Истина;
	МенеджерРасчета.НастройкиРасчета.РассчитыватьКорректировкиВыплаты = Истина;
	МенеджерРасчета.НастройкиРасчета.РассчитыватьЗаймы = ПериодРасчетаЗарплаты <> Неопределено;
	МенеджерРасчета.НастройкиРасчета.РассчитыватьУдержания = РасчетЗарплатыРасширенный.ЭтоМежрасчетнаяВыплата(ДокументОбъект.ПорядокВыплаты);
	МенеджерРасчета.НастройкиРасчета.СохранятьИсправления = СохранятьИсправления;
	МенеджерРасчета.НастройкиРасчета.РасчетЗарплаты = ПериодРасчетаЗарплаты <> Неопределено;
	
	МенеджерРасчета.НастройкиНДФЛ.Сотрудники = ДокументОбъект.Сотрудник;
	МенеджерРасчета.НастройкиНДФЛ.ДатаВыплаты = ДокументОбъект.ПланируемаяДатаВыплаты;
	МенеджерРасчета.НастройкиНДФЛ.ОкончательныйРасчет = Ложь;
	МенеджерРасчета.НастройкиНДФЛ.ДоходПолученНаТерриторииРФ = ДокументОбъект.ДоходПолученНаТерриторииРФ;
	
	ЗасчитыватьДанныеАвансов = ДокументОбъект.РассчитатьЗарплату;	
	Если ЗасчитыватьДанныеАвансов
		И ИсправлениеРасчетовБЗККлиентСервер.ИсправлениеВТекущемПериоде(ДокументОбъект, ПараметрыИсправляемого)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.ИсправленныйДокумент, "РассчитатьЗарплату") Тогда
			 ЗасчитыватьДанныеАвансов = Ложь
	КонецЕсли;
	МенеджерРасчета.НастройкиНДФЛ.ЗасчитыватьДанныеАвансов = ЗасчитыватьДанныеАвансов;
	
	МенеджерРасчета.НастройкиУдержаний.РассчитыватьТолькоПоТекущемуДокументу = Истина;
	Если ПериодРасчетаЗарплаты <> Неопределено Тогда
		МенеджерРасчета.НастройкиЗаймов.Сотрудники = ДокументОбъект.Сотрудник;
		МенеджерРасчета.НастройкиЗаймов.ДатаПогашения = ПериодРасчетаЗарплаты.ДатаОкончания;
	КонецЕсли;
	МенеджерРасчета.НастройкиБухучета.НастройкиБухучетаДокумента = Документы.Отпуск.ДанныеДляБухучетаЗарплатыПервичныхДокументов(ДокументОбъект)["ТаблицаБухучетЗарплаты"];
	
	МенеджерРасчета.ДобавитьДатуНачалаСобытия(ДокументОбъект.Сотрудник, ДокументОбъект.ДатаНачалаСобытия);	
	
КонецПроцедуры

Процедура ЗаполнитьНачисления(ДокументОбъект, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыИсправленногоДокумента, ОбновитьДанныеДляРасчетаСреднего)
	
	Если Не ДокументОбъект.РассчитатьЗарплату Тогда
		ОчиститьДанныеДляРасчетаСреднегоЗаПериодРегистрации(ДокументОбъект, ОбновитьДанныеДляРасчетаСреднего);
	КонецЕсли;
		
	ТаблицаНачислений = МенеджерРасчета.ТаблицаИсходныеДанныеНачисленияЗарплатыПоНачислениям();
	ДополнитьНачисленияВыплачиваемыеКОтпуску(ДокументОбъект, ТаблицаНачислений, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыИсправленногоДокумента);
	ДополнитьНачисленияОплатаОтпуска(ДокументОбъект, ТаблицаНачислений, МенеджерРасчета);
	
	МенеджерРасчета.ЗаполнитьНачисленияСотрудникаЗаПериод(ДокументОбъект.Сотрудник, ТаблицаНачислений, ПериодРасчетаЗарплаты);
	
КонецПроцедуры
	
Процедура ЗаполнитьПерерасчеты(ДокументОбъект, МенеджерРасчета)
	Если Не ИсправлениеДокументовРасчетЗарплаты.ДоначисленияРазрешены(МенеджерРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	ИсходныеДанныеДляПерерасчета = ИсправлениеРасчетовБЗК.ИсходныеДанныеДляПерерасчетаИзРезультатаРасчета(МенеджерРасчета.Зарплата.Начисления);
	
	Если ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) Тогда
		ОписаниеТаблиц = Новый Массив();
		ОписаниеТаблиц.Добавить(Документы.Отпуск.ОписаниеТаблицыНачислений());
		РезультатПерерасчета = ИсправлениеРасчетовБЗК.ДанныеПерерасчетаДляИсправления(
			ДокументОбъект.Организация, 
			ДокументОбъект.ПериодРегистрации, 
			ИсходныеДанныеДляПерерасчета, 
			ДокументОбъект.ИсправленныйДокумент,
			ДокументОбъект.Ссылка, 
			Документы.Отпуск.ОписаниеДокументаРасчета(),
			ОписаниеТаблиц,,
			ДокументОбъект.ДоначислитьЗарплатуПриНеобходимости);
	Иначе
		РезультатПерерасчета = ИсправлениеРасчетовБЗК.ДанныеПерерасчета(ДокументОбъект, ИсходныеДанныеДляПерерасчета, Документы.Отпуск.ОписаниеДокументаРасчета());
	КонецЕсли;
	
	Если Не РезультатПерерасчета = Неопределено Тогда
		ИсправлениеРасчетовБЗК.ДанныеПерерасчетаВМенеджерРасчета(РезультатПерерасчета, МенеджерРасчета);
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОчиститьДанныеДляРасчетаСреднегоЗаПериодРегистрации(ДокументОбъект, ОбновитьДанныеДляРасчетаСреднего)
	
	Если ДокументОбъект.РасчетДенежногоСодержания 
		Или Не ОбновитьДанныеДляРасчетаСреднего Тогда
		Возврат;
	КонецЕсли;
	
	// Т.к. зарплата за текущий месяц начисляется в документе отпуска, 
	// ее нужно в любом случае обновить в данных среднего заработка.
	// Удаляем из таблиц среднего заработка данные за последний месяц.
	ТаблицыСреднего = Новый Массив;
	ТаблицыСреднего.Добавить(ДокументОбъект.СреднийЗаработокОбщий);
	ТаблицыСреднего.Добавить(ДокументОбъект.ОтработанноеВремяДляСреднегоОбщий);
	Для Каждого ТаблицаСреднего Из ТаблицыСреднего Цикл
		НайденныеСтроки = ТаблицаСреднего.НайтиСтроки(Новый Структура("Период", ДокументОбъект.ПериодРегистрации));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТаблицаСреднего.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ДополнитьНачисленияВыплачиваемыеКОтпуску(ДокументОбъект, ТаблицаНачислений, МенеджерРасчета, ПериодРасчетаЗарплаты, ПараметрыИсправленногоДокумента)
	
	ПредоставляетсяЕдиновременнаяВыплатаКОтпуску =
		ДокументОбъект.ПредоставитьЕдиновременнуюВыплатуКОтпуску И ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаЕдиновременнойВыплатыКОтпуску);
		
	ПериодРегистрацииЕдиновременнойВыплаты = ДокументОбъект.ПериодРегистрации;
	ПериодРегистрацииМатериальнойПомощи = ДокументОбъект.ПериодРегистрации;
		
	// Если потребуется начислять единоразовые начисления и при этом данный документ - исправление,
	// нужно переопределить периоды действия для единоразовых начислений.
	Если ИсправлениеРасчетовБЗККлиентСервер.ЭтоИсправление(ПараметрыИсправленногоДокумента)
		И (ПредоставляетсяЕдиновременнаяВыплатаКОтпуску	Или ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске) Тогда
			
		РеквизитыИсправленного = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыИсправленногоДокумента.Ссылка,
			"ПредоставитьЕдиновременнуюВыплатуКОтпуску,ВидРасчетаЕдиновременнойВыплатыКОтпуску,ПредоставитьМатериальнуюПомощьПриОтпуске");
		
		ПервичныйДокумент = ИсправлениеДокументовЗарплатаКадры.ПервыйДокументЦепочкиИсправлений(ПараметрыИсправленногоДокумента.Ссылка);
		ПервичныйПериодРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервичныйДокумент, "ПериодРегистрации");
		
		// Если единовременная выплата начислялась и будет начисляться - сохраним ее период в документе-исправлении.
		Если ПредоставляетсяЕдиновременнаяВыплатаКОтпуску
			И РеквизитыИсправленного.ПредоставитьЕдиновременнуюВыплатуКОтпуску И ЗначениеЗаполнено(РеквизитыИсправленного.ВидРасчетаЕдиновременнойВыплатыКОтпуску) Тогда
			ПериодРегистрацииЕдиновременнойВыплаты = ПервичныйПериодРегистрации;
		КонецЕсли;
		// Если матпомощь начислялась и будет начисляться - сохраним ее период в документе-исправлении.
		Если ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске И РеквизитыИсправленного.ПредоставитьМатериальнуюПомощьПриОтпуске Тогда
			ПериодРегистрацииМатериальнойПомощи = ПервичныйПериодРегистрации;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаВедущихНачислений = МенеджерРасчета.НовыйВедущиеНачисленияСотрудников();
	
	РегистраторРазовыхНачислений = ДокументыРазовыхНачислений.РегистраторРазовогоНачисления(ДокументОбъект.Ссылка);
	
	Если ПредоставляетсяЕдиновременнаяВыплатаКОтпуску Тогда
		НовыйИнтервал = ТаблицаНачислений.Добавить();
		НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
		НовыйИнтервал.Начисление = ДокументОбъект.ВидРасчетаЕдиновременнойВыплатыКОтпуску;
		НовыйИнтервал.ДатаНачала = НачалоМесяца(ПериодРегистрацииЕдиновременнойВыплаты);
		НовыйИнтервал.ДатаОкончания = КонецМесяца(ПериодРегистрацииЕдиновременнойВыплаты);
		НовыйИнтервал.ПериодПолученияПоказателей = ДокументОбъект.ДатаНачалаСобытия;
		НовыйИнтервал.РегистраторРазовогоНачисления = РегистраторРазовыхНачислений;
		
		СтрокаТаблицыВедущих = ТаблицаВедущихНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВедущих, НовыйИнтервал); 
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьМатериальнуюПомощьПриОтпуске Тогда
		НовыйИнтервал = ТаблицаНачислений.Добавить();
		НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
		НовыйИнтервал.Начисление = ДокументОбъект.ВидРасчетаМатериальнойПомощиПриОтпуске;
		НовыйИнтервал.ДатаНачала = НачалоМесяца(ПериодРегистрацииМатериальнойПомощи);
		НовыйИнтервал.ДатаОкончания = КонецМесяца(ПериодРегистрацииМатериальнойПомощи);
		НовыйИнтервал.ПериодПолученияПоказателей = ДокументОбъект.ДатаНачалаСобытия;
		НовыйИнтервал.РегистраторРазовогоНачисления = РегистраторРазовыхНачислений;
		
		СтрокаТаблицыВедущих = ТаблицаВедущихНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыВедущих, НовыйИнтервал); 
	КонецЕсли;
	
	Если ТаблицаВедущихНачислений.Количество() > 0 Тогда	
		ЗависимыеНачисления = МенеджерРасчета.ЗависимыеНачисленияРассчитываемыеСРазовыми(ТаблицаВедущихНачислений);
		Для Каждого СтрокаЗависимогоНачисления Из ЗависимыеНачисления Цикл
			Если ПериодРасчетаЗарплаты <> Неопределено
				И ОбщегоНазначенияБЗК.ДатаВИнтервале(СтрокаЗависимогоНачисления.ДатаНачала, ПериодРасчетаЗарплаты.ДатаНачала, ПериодРасчетаЗарплаты.ДатаОкончания, Истина) 
				И ОбщегоНазначенияБЗК.ДатаВИнтервале(СтрокаЗависимогоНачисления.ДатаОкончания, ПериодРасчетаЗарплаты.ДатаНачала, ПериодРасчетаЗарплаты.ДатаОкончания, Истина) Тогда
				
				Продолжить;
			КонецЕсли;	
			
			Если ПериодРасчетаЗарплаты <> Неопределено
				И ОбщегоНазначенияБЗК.ДатаВИнтервале(СтрокаЗависимогоНачисления.ДатаНачала, ПериодРасчетаЗарплаты.ДатаНачала, ПериодРасчетаЗарплаты.ДатаОкончания, Истина) Тогда
				
				НовыйИнтервал = ТаблицаНачислений.Добавить();	
				ЗаполнитьЗначенияСвойств(НовыйИнтервал, СтрокаЗависимогоНачисления);
				НовыйИнтервал.РассчитыватьПоРазовымНачислениямДокумента = Истина;
				НовыйИнтервал.РегистраторРазовогоНачисления = РегистраторРазовыхНачислений;
				НовыйИнтервал.ДатаНачала = КонецДня(ПериодРасчетаЗарплаты.ДатаОкончания) + 1;
			Иначе
				НовыйИнтервал = ТаблицаНачислений.Добавить();	
				ЗаполнитьЗначенияСвойств(НовыйИнтервал, СтрокаЗависимогоНачисления);
				НовыйИнтервал.РассчитыватьПоРазовымНачислениямДокумента = Истина;
				НовыйИнтервал.РегистраторРазовогоНачисления = РегистраторРазовыхНачислений;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры
	
Процедура ДополнитьНачисленияОплатаОтпуска(ДокументОбъект, ТаблицаНачислений, МенеджерРасчета)
	ОтпускВРабочихДняхПоДоговору = ОстаткиОтпусков.ОтпускСотрудникаВРабочихДняхПоДоговору(ДокументОбъект.Сотрудник, ДокументОбъект.ДатаНачалаСобытия);
	
	ПоКалендарнымДням = ОстаткиОтпусков.ОписаниеВидаОтпуска(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), ОтпускВРабочихДняхПоДоговору).СпособРасчетаПоКалендарнымДням;
	//Показатели среднего заработка.
	ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
	ДополнительныеПараметры.Индексации = ДокументОбъект.ДанныеОбИндексации;
	ДополнительныеПараметры.ДатаНачалаСобытия = ДокументОбъект.ДатаНачалаСобытия;
	ДополнительныеПараметры.НачалоПериода = ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало;
	ДополнительныеПараметры.ОкончаниеПериода = ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание;
	ДополнительныеПараметры.ПоЧасам = ЭтоСреднеЧасовойЗаработок(ДокументОбъект);
	
	Если ДокументОбъект.РасчетДенежногоСодержания Тогда
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
			СтруктураОбъекта = ПодготовитьСтруктуруОбъектаДляРасчетаДенежногоСодержания(ДокументОбъект);
			МодульРасчетДенежногоСодержания = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
			ЗначенияПоказателейСохраняемогоДенежногоСодержания = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержания(СтруктураОбъекта);
		КонецЕсли;
		
		ПоказательСохраняемыйЗаработок = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СохраняемоеДенежноеСодержание");
		ЗначениеПоказателяПоКалендарнымДням = ДокументОбъект.СохраняемоеДенежноеСодержание;
		ЗначениеПоказателяПоРабочимДням = ДокументОбъект.СохраняемоеДенежноеСодержание;
		
	Иначе
		
		Если ПоКалендарнымДням Тогда
			ДополнительныеПараметры.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням;
		Иначе
			ДополнительныеПараметры.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоШестидневке;
		КонецЕсли;
		ЗначенияПоказателейСреднегоЗаработка = УчетСреднегоЗаработкаКлиентСервер.ЗначенияПоказателейСреднегоЗаработкаОбщего(ДокументОбъект.СреднийЗаработокОбщий, ДокументОбъект.ОтработанноеВремяДляСреднегоОбщий, ДополнительныеПараметры);
		ПоказательСохраняемыйЗаработок = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СреднийЗаработокОбщий");
		ЗначениеПоказателяПоКалендарнымДням = ДокументОбъект.СреднийЗаработок;
		ЗначениеПоказателяПоРабочимДням = ДокументОбъект.СреднийЗаработокПоРабочимДням;
			
	КонецЕсли;

	ДниКомпенсацииСсылка = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.КоличествоДнейКомпенсации");
	ПоказательСДСНеИндексируемое = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.СохраняемоеДенежноеСодержаниеНеИндексируемое");
	ЗначениеПоказателяСДСНеИндексируемое = ДокументОбъект.СохраняемоеДенежноеСодержаниеНеИндексируемое;
	ПоказательМесячноеДенежноеСодержание = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.МесячноеДенежноеСодержание");
	ЗначениеПоказателяМесячноеДенежноеСодержание = ДокументОбъект.МесячноеДенежноеСодержание;
	
	ЗначениеПоказателяУчитыватьМРОТ = ?(ДокументОбъект.УчитыватьМРОТПриОплатеПоСреднемуЗаработку, 1, 0);
	ПоказательУчитыватьМРОТ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.УчитыватьМРОТ");
	
	КонецОтпуска = Неопределено;
	
	ДополнительныеВидыРасчета = РасчетЗарплатыРасширенный.ДополнительныеНачисленияОсновныхВидовРасчета(ВидыРасчетаДокумента(ДокументОбъект));
	ДатаНачалаРаздельногоРасчетаРКСН = УчетНДФЛРасширенный.ДатаЗаконаПроРКиЕАЭС();
	
	Если ДокументОбъект.ПредоставитьОсновнойОтпуск Тогда
		Если ЗначениеЗаполнено(ДокументОбъект.ДатаНачалаОсновногоОтпуска) И ЗначениеЗаполнено(ДокументОбъект.ДатаОкончанияОсновногоОтпуска) Тогда
			Если ДокументОбъект.РасчетДенежногоСодержания
				И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
				ЗначенияПоказателейСреднегоЗаработка = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ЕжегодныйОтпуск");
			КонецЕсли;
			
			ПериодыНачислений = Новый Массив;
			ПериодОтпуска = Новый Структура;
			ПериодОтпуска.Вставить("ДатаНачалаПериода", ДокументОбъект.ДатаНачалаОсновногоОтпуска);
			ПериодОтпуска.Вставить("ДатаОкончанияПериода", ДокументОбъект.ДатаОкончанияОсновногоОтпуска);
			ПериодыНачислений.Добавить(ПериодОтпуска);
			Если ДокументОбъект.ПериодыПриостановкиОтпуска.Количество()> 0 Тогда
				ПериодыНачислений = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодОтпуска, ДокументОбъект.ПериодыПриостановкиОтпуска);
			КонецЕсли;
			
			Для Каждого ПериодНачисления Из ПериодыНачислений Цикл
				НовыйИнтервал = ТаблицаНачислений.Добавить();
				НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
				НовыйИнтервал.Начисление = ДокументОбъект.ВидРасчетаОсновногоОтпуска;
				НовыйИнтервал.ДатаНачала = ПериодНачисления.ДатаНачалаПериода;
				НовыйИнтервал.ДатаОкончания = КонецДня(ПериодНачисления.ДатаОкончанияПериода);
				Если ПоКалендарнымДням Тогда
					ЗначениеПоказателя = ЗначениеПоказателяПоКалендарнымДням;
				Иначе
					ЗначениеПоказателя = ЗначениеПоказателяПоРабочимДням;
				КонецЕсли;
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСохраняемыйЗаработок, ЗначениеПоказателя);
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательУчитыватьМРОТ, ЗначениеПоказателяУчитыватьМРОТ);
				Если ЗначениеЗаполнено(ПоказательСДСНеИндексируемое) Тогда
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСДСНеИндексируемое, ЗначениеПоказателяСДСНеИндексируемое);
				КонецЕсли;
				Если ЗначениеЗаполнено(ПоказательМесячноеДенежноеСодержание) Тогда
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательМесячноеДенежноеСодержание, ЗначениеПоказателяМесячноеДенежноеСодержание);
				КонецЕсли;
				КонецОтпуска = ДокументОбъект.ДатаОкончанияОсновногоОтпуска;
				Если Не ДокументОбъект.РасчетДенежногоСодержания И ПолучитьФункциональнуюОпцию("ИндексироватьСреднийЗаработокЧастично") Тогда
					УчетСреднегоЗаработка.ДобавитьЗначенияПоказателейЧастичнойИндексацииОтпусков(ДокументОбъект, МенеджерРасчета, НовыйИнтервал, ПоКалендарнымДням);
				КонецЕсли;
				
				//Дополнительные начисления долей РК, СН
				ВидыРасчетаДолейРКСН = ДополнительныеВидыРасчета.Получить(ДокументОбъект.ВидРасчетаОсновногоОтпуска);
				Если ВидыРасчетаДолейРКСН <> Неопределено И ДокументОбъект.ПланируемаяДатаВыплаты >= ДатаНачалаРаздельногоРасчетаРКСН Тогда
					Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
						НоваяСтрока = ТаблицаНачислений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
						НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК;
						РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
					КонецЕсли;
					
					Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
						НоваяСтрока = ТаблицаНачислений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
						НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН;
						РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
					КонецЕсли;
				Иначе
					НулевыеЗначенияПоказателейРКСН = Справочники.ПоказателиРасчетаЗарплаты.НулевыеЗначенияПоказателейРКСН();
					РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НовыйИнтервал, МенеджерРасчета, НулевыеЗначенияПоказателейРКСН);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		Если ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска > 0 Тогда
			Если ДокументОбъект.РасчетДенежногоСодержания
				И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
				ЗначенияПоказателейСреднегоЗаработка = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ВыходноеПособие");
			КонецЕсли;
				
			НовыйИнтервал = ТаблицаНачислений.Добавить();
			НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
			НовыйИнтервал.Начисление = ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска;
			НовыйИнтервал.ДатаНачала = НачалоМесяца(ДокументОбъект.ПериодРегистрации);
			НовыйИнтервал.ДатаОкончания = КонецМесяца(ДокументОбъект.ПериодРегистрации);
			Если ПоКалендарнымДням Тогда
				ЗначениеПоказателя = ЗначениеПоказателяПоКалендарнымДням;
			Иначе
				ЗначениеПоказателя = ЗначениеПоказателяПоРабочимДням;
			КонецЕсли;
			МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСохраняемыйЗаработок, ЗначениеПоказателя);
			МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ДниКомпенсацииСсылка, ДокументОбъект.КоличествоДнейКомпенсацииОсновногоОтпуска);
			МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательУчитыватьМРОТ, ЗначениеПоказателяУчитыватьМРОТ);
			Если ЗначениеЗаполнено(ПоказательСДСНеИндексируемое) Тогда
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСДСНеИндексируемое, ЗначениеПоказателяСДСНеИндексируемое);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПоказательМесячноеДенежноеСодержание) Тогда
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательМесячноеДенежноеСодержание, ЗначениеПоказателяМесячноеДенежноеСодержание);
			КонецЕсли;
			Если Не ДокументОбъект.РасчетДенежногоСодержания И ПолучитьФункциональнуюОпцию("ИндексироватьСреднийЗаработокЧастично") Тогда
				УчетСреднегоЗаработка.ДобавитьЗначенияПоказателейЧастичнойИндексацииОтпусков(ДокументОбъект, МенеджерРасчета, НовыйИнтервал, ПоКалендарнымДням);
			КонецЕсли;
			//Дополнительные начисления долей РК, СН
			ВидыРасчетаДолейРКСН = ДополнительныеВидыРасчета.Получить(ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска);
			Если ВидыРасчетаДолейРКСН <> Неопределено И ДокументОбъект.ПланируемаяДатаВыплаты >= ДатаНачалаРаздельногоРасчетаРКСН Тогда
				Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
					НоваяСтрока = ТаблицаНачислений.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
					НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК;
					РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
				КонецЕсли;
				
				Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
					НоваяСтрока = ТаблицаНачислений.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
					НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН;
					РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
				КонецЕсли;
			Иначе
				НулевыеЗначенияПоказателейРКСН = Справочники.ПоказателиРасчетаЗарплаты.НулевыеЗначенияПоказателейРКСН();
				РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НовыйИнтервал, МенеджерРасчета, НулевыеЗначенияПоказателейРКСН);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументОбъект.ПредоставитьДополнительныйОтпуск Тогда
		Для Каждого СтрокаДополнительногоОтпуска Из ДокументОбъект.ДополнительныеОтпуска Цикл
			
			Если ДокументОбъект.РасчетДенежногоСодержания
				И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
				ЗначенияПоказателейСреднегоЗаработка = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ЕжегодныйОтпуск");
			Иначе
				Если ПоКалендарнымДням <> ОстаткиОтпусков.ОписаниеВидаОтпуска(СтрокаДополнительногоОтпуска.ВидОтпуска, ОтпускВРабочихДняхПоДоговору).СпособРасчетаПоКалендарнымДням Тогда
					ПоКалендарнымДням = Не ПоКалендарнымДням;	
					Если ПоКалендарнымДням Тогда
						ДополнительныеПараметры.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням;
					Иначе
						ДополнительныеПараметры.СпособРасчетаОтпуска = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоШестидневке;
					КонецЕсли;
					ЗначенияПоказателейСреднегоЗаработка = УчетСреднегоЗаработкаКлиентСервер.ЗначенияПоказателейСреднегоЗаработкаОбщего(ДокументОбъект.СреднийЗаработокОбщий, ДокументОбъект.ОтработанноеВремяДляСреднегоОбщий, ДополнительныеПараметры);	
				КонецЕсли;
			КонецЕсли;
				
			Если ЗначениеЗаполнено(СтрокаДополнительногоОтпуска.ДатаНачала) И ЗначениеЗаполнено(СтрокаДополнительногоОтпуска.ДатаОкончания) Тогда
				ПериодыНачисленияДопОтпусков = Новый Массив;
				ПериодДопОтпуска = Новый Структура;
				ПериодДопОтпуска.Вставить("ДатаНачалаПериода", СтрокаДополнительногоОтпуска.ДатаНачала);
				ПериодДопОтпуска.Вставить("ДатаОкончанияПериода", СтрокаДополнительногоОтпуска.ДатаОкончания);
				ПериодыНачисленияДопОтпусков.Добавить(ПериодДопОтпуска);
				Если ДокументОбъект.ПериодыПриостановкиОтпуска.Количество() > 0 Тогда
					ПериодыНачисленияДопОтпусков = Документы.Отпуск.ИсключитьИнтервалыИзПериодов(ПериодДопОтпуска, ДокументОбъект.ПериодыПриостановкиОтпуска);
				КонецЕсли;
				Для Каждого ПериодНачисления Из ПериодыНачисленияДопОтпусков Цикл
					НовыйИнтервал = ТаблицаНачислений.Добавить();
					НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
					НовыйИнтервал.Начисление = СтрокаДополнительногоОтпуска.ВидРасчета;
					НовыйИнтервал.ДатаНачала = ПериодНачисления.ДатаНачалаПериода;
					НовыйИнтервал.ДатаОкончания = КонецДня(ПериодНачисления.ДатаОкончанияПериода);
					Если ПоКалендарнымДням Тогда
						ЗначениеПоказателя = ЗначениеПоказателяПоКалендарнымДням;
					Иначе
						ЗначениеПоказателя = ЗначениеПоказателяПоРабочимДням;
					КонецЕсли;
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСохраняемыйЗаработок, ЗначениеПоказателя);
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательУчитыватьМРОТ, ЗначениеПоказателяУчитыватьМРОТ);
					Если ЗначениеЗаполнено(ПоказательСДСНеИндексируемое) Тогда
						МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСДСНеИндексируемое, ЗначениеПоказателяСДСНеИндексируемое);
					КонецЕсли;
					Если ЗначениеЗаполнено(ПоказательМесячноеДенежноеСодержание) Тогда
						МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательМесячноеДенежноеСодержание, ЗначениеПоказателяМесячноеДенежноеСодержание);
					КонецЕсли;
					КонецОтпуска = СтрокаДополнительногоОтпуска.ДатаОкончания;
					Если Не ДокументОбъект.РасчетДенежногоСодержания И ПолучитьФункциональнуюОпцию("ИндексироватьСреднийЗаработокЧастично") Тогда
						УчетСреднегоЗаработка.ДобавитьЗначенияПоказателейЧастичнойИндексацииОтпусков(ДокументОбъект, МенеджерРасчета, НовыйИнтервал, ПоКалендарнымДням);
					КонецЕсли;
					//Дополнительные начисления долей РК, СН
					ВидыРасчетаДолейРКСН = ДополнительныеВидыРасчета.Получить(СтрокаДополнительногоОтпуска.ВидРасчета);
					Если ВидыРасчетаДолейРКСН <> Неопределено И ДокументОбъект.ПланируемаяДатаВыплаты >= ДатаНачалаРаздельногоРасчетаРКСН Тогда
						Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
							НоваяСтрока = ТаблицаНачислений.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
							НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК;
							РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
						КонецЕсли;
						
						Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
							НоваяСтрока = ТаблицаНачислений.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
							НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН;
							РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
						КонецЕсли;
					Иначе
						НулевыеЗначенияПоказателейРКСН = Справочники.ПоказателиРасчетаЗарплаты.НулевыеЗначенияПоказателейРКСН();
						РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НовыйИнтервал, МенеджерРасчета, НулевыеЗначенияПоказателейРКСН);	
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если СтрокаДополнительногоОтпуска.КоличествоДнейКомпенсации > 0 Тогда
				Если ДокументОбъект.РасчетДенежногоСодержания
					И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда
					ЗначенияПоказателейСреднегоЗаработка = МодульРасчетДенежногоСодержания.ЗначенияПоказателейСохраняемогоДенежногоСодержанияПоНазначению(ЗначенияПоказателейСохраняемогоДенежногоСодержания, "ВыходноеПособие");
				КонецЕсли;
				НовыйИнтервал = ТаблицаНачислений.Добавить();
				НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
				НовыйИнтервал.Начисление = СтрокаДополнительногоОтпуска.ВидРасчетаКомпенсации;
				НовыйИнтервал.ДатаНачала = НачалоМесяца(ДокументОбъект.ПериодРегистрации);
				НовыйИнтервал.ДатаОкончания = КонецМесяца(ДокументОбъект.ПериодРегистрации);
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ДниКомпенсацииСсылка, СтрокаДополнительногоОтпуска.КоличествоДнейКомпенсации);
				Если ПоКалендарнымДням Тогда
					ЗначениеПоказателя = ЗначениеПоказателяПоКалендарнымДням;
				Иначе
					ЗначениеПоказателя = ЗначениеПоказателяПоРабочимДням;
				КонецЕсли;
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСохраняемыйЗаработок, ЗначениеПоказателя);
				МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательУчитыватьМРОТ, ЗначениеПоказателяУчитыватьМРОТ);
				Если ЗначениеЗаполнено(ПоказательСДСНеИндексируемое) Тогда
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательСДСНеИндексируемое, ЗначениеПоказателяСДСНеИндексируемое);
				КонецЕсли;
				Если ЗначениеЗаполнено(ПоказательМесячноеДенежноеСодержание) Тогда
					МенеджерРасчета.ДобавитьИзвестноеЗначениеПоказателя(НовыйИнтервал, ПоказательМесячноеДенежноеСодержание, ЗначениеПоказателяМесячноеДенежноеСодержание);
				КонецЕсли;
				Если Не ДокументОбъект.РасчетДенежногоСодержания И ПолучитьФункциональнуюОпцию("ИндексироватьСреднийЗаработокЧастично") Тогда
					УчетСреднегоЗаработка.ДобавитьЗначенияПоказателейЧастичнойИндексацииОтпусков(ДокументОбъект, МенеджерРасчета, НовыйИнтервал, ПоКалендарнымДням);
				КонецЕсли;
				//Дополнительные начисления долей РК, СН
				ВидыРасчетаДолейРКСН = ДополнительныеВидыРасчета.Получить(СтрокаДополнительногоОтпуска.ВидРасчетаКомпенсации);
				Если ВидыРасчетаДолейРКСН <> Неопределено И ДокументОбъект.ПланируемаяДатаВыплаты >= ДатаНачалаРаздельногоРасчетаРКСН Тогда
					Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
						НоваяСтрока = ТаблицаНачислений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
						НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиРК;
						РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
					КонецЕсли;
					
					Если РасчетЗарплатыРасширенный.ЗаполнятьНачислениеДолиРКСН(ЗначенияПоказателейСреднегоЗаработка, ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН, ДокументОбъект.ПланируемаяДатаВыплаты) Тогда
						НоваяСтрока = ТаблицаНачислений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйИнтервал);
						НоваяСтрока.Начисление = ВидыРасчетаДолейРКСН.ВидРасчетаДолиСН;
						РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НоваяСтрока, МенеджерРасчета, ЗначенияПоказателейСреднегоЗаработка);
					КонецЕсли;
				Иначе
					НулевыеЗначенияПоказателейРКСН = Справочники.ПоказателиРасчетаЗарплаты.НулевыеЗначенияПоказателейРКСН();
					РасчетЗарплатыРасширенный.ЗаполнитьПоказателиРКСН(НовыйИнтервал, МенеджерРасчета, НулевыеЗначенияПоказателейРКСН);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Если ДокументОбъект.ПредоставитьОтгул Тогда
		Если КонецОтпуска <> Неопределено Тогда
			НовыйИнтервал = ТаблицаНачислений.Добавить();
			НовыйИнтервал.Сотрудник = ДокументОбъект.Сотрудник;
			НовыйИнтервал.Начисление = ДокументОбъект.ВидРасчетаОтгул;
			НовыйИнтервал.ДатаНачала = НачалоДня(КонецДня(КонецОтпуска) + 1);
			НовыйИнтервал.ДатаОкончания = УчетРабочегоВремениРасширенный.ДатаОкончанияПоГрафикуРаботыСотрудника(ДокументОбъект.Сотрудник, НовыйИнтервал.ДатаНачала, ДокументОбъект.КоличествоДнейОтгула);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Функция УстановитьПризнакФиксРасчетНачислениямОплатыОтпуска(ДокументОбъект, МенеджерРасчета)
	ЗафиксированныеСтроки = Новый Соответствие;	
	
	НачисленияОплатыОтпуска = НачисленияОплатыОтпуска(ДокументОбъект);
	
	Для Каждого СтрокаНачисления Из МенеджерРасчета.Зарплата.Начисления Цикл
		Если Не ЗначениеЗаполнено(СтрокаНачисления.Начисление) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НачисленияОплатыОтпуска[СтрокаНачисления.Начисление] = Истина
			И Не СтрокаНачисления.ФиксРасчет Тогда
			
			СтрокаНачисления.ФиксРасчет = Истина;
			СтрокаНачисления.ФиксРасчетВремени = Истина;
			ЗафиксированныеСтроки.Вставить(СтрокаНачисления, Истина);
		КонецЕсли;
	КонецЦикла;		
	
	Возврат ЗафиксированныеСтроки;
КонецФункции	

Функция УстановитьПризнакФиксРасчетНачислениямОплатыТруда(ДокументОбъект, МенеджерРасчета)
	ЗафиксированныеСтроки = Новый Соответствие;	
	
	НачисленияОплатыОтпуска = НачисленияОплатыОтпуска(ДокументОбъект);
	
	Для Каждого СтрокаНачисления Из МенеджерРасчета.Зарплата.Начисления Цикл
		Если Не ЗначениеЗаполнено(СтрокаНачисления.Начисление) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НачисленияОплатыОтпуска[СтрокаНачисления.Начисление] <> Истина
			И Не СтрокаНачисления.ФиксРасчет Тогда
			
			СтрокаНачисления.ФиксРасчет = Истина;
			СтрокаНачисления.ФиксРасчетВремени = Истина;
			ЗафиксированныеСтроки.Вставить(СтрокаНачисления, Истина);
		КонецЕсли;
	КонецЦикла;		
	
	Возврат ЗафиксированныеСтроки;
КонецФункции	

Функция НачисленияОплатыОтпуска(ДокументОбъект)
	НачисленияОплатыОтпуска = Новый Соответствие;
	
	Если ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаМатериальнойПомощиПриОтпуске)
		И НЕ ДокументОбъект.РасчетДенежногоСодержания Тогда
		НачисленияОплатыОтпуска.Вставить(ДокументОбъект.ВидРасчетаМатериальнойПомощиПриОтпуске, Истина);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаОсновногоОтпуска) Тогда
		НачисленияОплатыОтпуска.Вставить(ДокументОбъект.ВидРасчетаОсновногоОтпуска, Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска) Тогда
		НачисленияОплатыОтпуска.Вставить(ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска, Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОбъект.ВидРасчетаОтгул) Тогда
		НачисленияОплатыОтпуска.Вставить(ДокументОбъект.ВидРасчетаОтгул, Истина);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.ДополнительныеОтпуска Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.ВидРасчета) Тогда
			НачисленияОплатыОтпуска.Вставить(СтрокаТаблицы.ВидРасчета, Истина);	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат НачисленияОплатыОтпуска;
КонецФункции
	
Процедура ЗаполнитьНастройкиМенеджераРасчетаПоШаблону(МенеджерРасчета, ШаблонНастроек)
	МенеджерРасчета.УстановитьНастройкиРасчетаПоУмолчанию();
	Для Каждого ЭлементНастроек Из ШаблонНастроек Цикл
		МенеджерРасчета.НастройкиРасчета.Вставить(ЭлементНастроек.Ключ, ЭлементНастроек.Значение);		
	КонецЦикла;	
КонецПроцедуры	

Процедура РезультатРасчетаНачисленийВДанныеОбъекта(ДокументОбъект, ДанныеМенеджераРасчета)
	ТаблицыНачислений = РасчетДокументовБЗК.ТаблицыНачисленийДокумента();
	ТаблицыНачислений.Начисления = ДокументОбъект.Начисления;
	ТаблицыНачислений.НачисленияПерерасчет = ДокументОбъект.НачисленияПерерасчет;
	ТаблицыНачислений.НачисленияПерерасчетНулевыеСторно = ДокументОбъект.НачисленияПерерасчетНулевыеСторно;
	ТаблицыНачислений.Показатели = ДокументОбъект.Показатели;
	ТаблицыНачислений.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовНачислений;
	ТаблицыНачислений.РаспределениеПоТерриториямУсловиямТруда = ДокументОбъект.РаспределениеПоТерриториямУсловиямТруда;
	
	ОписаниеТаблиц = РасчетДокументовБЗК.ОписаниеТаблицНачисленийДокумента();
	ОписаниеТаблиц.Начисления = Документы.Отпуск.ОписаниеТаблицыНачислений();
	ОписаниеТаблиц.НачисленияПерерасчет = Документы.Отпуск.ОписаниеТаблицыПерерасчетов();
	ОписаниеТаблиц.НачисленияПерерасчетНулевыеСторно = Документы.Отпуск.ОписаниеТаблицыПерерасчетовНулевыеСторно();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		ТаблицыНачислений.УправленческиеНачисления = ДокументОбъект.УправленческиеНачисления;
		ОписаниеТаблиц.УправленческиеНачисления = Модуль.ОписаниеТаблицыНачисленийДокумента();
	КонецЕсли;
	
	РасчетДокументовБЗК.РасчетЗарплатыНачисленияВДанныеОбъекта(
		ТаблицыНачислений, 
		ДанныеМенеджераРасчета.Начисления, 
		ДокументОбъект.Организация, 
		ОписаниеТаблиц);
	
	РасчетЗарплатыРасширенныйФормы.СортироватьПерерасчеты(ДокументОбъект.НачисленияПерерасчет);
КонецПроцедуры	

Процедура ЗарегистрироватьНачисленияОплатыТруда(ДокументОбъект, ДанныеМенеджераРасчета)
	ДанныеДляПроведения = ДанныеДляВременнойРегистрацииНачислений(ДокументОбъект);
	
	Отказ = Ложь;
	
	НаборыЗаписей = ЗарплатаКадры.НаборыЗаписейРегистратора(Метаданные.Документы.Отпуск, ДанныеДляПроведения.ДокументСсылка);
	
	// Заполним описание данных для проведения в учете начисленной зарплаты.
	ДанныеДляПроведенияУчетЗарплаты = ОтражениеЗарплатыВУчете.ОписаниеДанныеДляПроведения();
	ДанныеДляПроведенияУчетЗарплаты.Движения 				= НаборыЗаписей;
	ДанныеДляПроведенияУчетЗарплаты.Организация 			= ДокументОбъект.Организация;
	ДанныеДляПроведенияУчетЗарплаты.ПериодРегистрации 		= ДокументОбъект.ПериодРегистрации;
	ДанныеДляПроведенияУчетЗарплаты.ПланируемаяДатаВыплаты	= ДокументОбъект.ПланируемаяДатаВыплаты;
	ДанныеДляПроведенияУчетЗарплаты.ПорядокВыплаты 			= ДокументОбъект.ПорядокВыплаты;
	ДанныеДляПроведенияУчетЗарплаты.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	
	Если ДокументОбъект.РасчетДенежногоСодержания Тогда
		
		// Регистрация начислений и удержаний
		УчетНачисленнойЗарплаты.ЗарегистрироватьНачисления(ДанныеДляПроведенияУчетЗарплаты, Отказ,
			ДанныеДляПроведения.НачисленияПоСотрудникам, Неопределено, Истина);
		УчетНачисленнойЗарплатыРасширенный.ЗарегистрироватьУдержания(ДанныеДляПроведенияУчетЗарплаты, Отказ, ДанныеДляПроведения.УдержанияПоСотрудникам);
		
	Иначе
		
		ИсправлениеДокументовРасчетЗарплаты.ПриВременнойРегистрацииИсправления(НаборыЗаписей, ДанныеДляПроведения);
		
		// Регистрация начислений
		РасчетЗарплатыРасширенный.СформироватьДвиженияНачислений(
			НаборыЗаписей, 
			Отказ, 
			ДокументОбъект.Организация, 
			КонецМесяца(ДокументОбъект.ПериодРегистрации), 
			ДанныеДляПроведения.Начисления, 
			ДанныеДляПроведения.ПоказателиНачислений, 
			Истина);
		// Регистрация отработанного времени в учете начислений и удержаний.
		УчетНачисленнойЗарплаты.ЗарегистрироватьОтработанноеВремя(ДанныеДляПроведенияУчетЗарплаты, Отказ,
			ДанныеДляПроведения.ОтработанноеВремяПоСотрудникам, Истина);	
		// Определяем исключаемый регистратор, который будет использоваться при обновлении корректировок.	
		НаборыЗаписей.ДанныеОВремениДляРасчетаСреднегоОбщий.ДополнительныеСвойства.Вставить("ИсключаемыйРегистратор", ДокументОбъект.Ссылка);
		// Учет среднего заработка
		УчетСреднегоЗаработка.ЗарегистрироватьДанныеСреднегоЗаработка(НаборыЗаписей, Отказ, ДанныеДляПроведения.НачисленияДляСреднегоЗаработка, Истина);
				
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДанныеДляРасчетаСохраняемогоЗаработка(ДокументОбъект, ПараметрыРасчета)
	
	Если ДокументОбъект.РасчетДенежногоСодержания
		И ПараметрыРасчета.ОбновитьРасчетДенежногоСодержания Тогда
		ОбновитьДанныеДляРасчетаСохраняемогоДенежногоСодержания(ДокументОбъект);
	Иначе	
		ОбновитьДанныеДляРасчетаСреднего(ДокументОбъект, ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеДляРасчетаСреднего(ДокументОбъект, ПараметрыРасчета)
	
	Если Не ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего Тогда
		Возврат
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УчетСреднегоЗаработка.ОбновитьДанныеОбщегоСреднегоЗаработка(
		Новый Структура("ДанныеОНачислениях, ДанныеОВремени, ДанныеОбИндексации", 
		ДокументОбъект.СреднийЗаработокОбщий, ДокументОбъект.ОтработанноеВремяДляСреднегоОбщий, ДокументОбъект.ДанныеОбИндексации), 
		ДокументОбъект.ДатаНачалаСобытия, 
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало, 
		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОбъект.Сотрудник), , 
		ДокументОбъект.Ссылка,
		Истина);
	
	РассчитатьСреднийЗаработок(ДокументОбъект);
	
	ПараметрыРасчета.ОбновитьДанныеДляРасчетаСреднего = Ложь;
КонецПроцедуры	

Процедура ОбновитьДанныеДляРасчетаСохраняемогоДенежногоСодержания(ДокументОбъект)
	УстановитьПривилегированныйРежим(Истина);

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
		//ПодготовитьОбъектДляРасчетаДенежногоСодержания();
		СтруктураОбъекта = ПодготовитьСтруктуруОбъектаДляРасчетаДенежногоСодержания(ДокументОбъект);
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
		Модуль.ОбновитьДанныеСохраняемогоДенежногоСодержанияДокумента(СтруктураОбъекта);
	КонецЕсли;

	РассчитатьСреднийЗаработок(ДокументОбъект);
	
КонецПроцедуры

Функция ПодготовитьСтруктуруОбъектаДляРасчетаДенежногоСодержания(ДокументОбъект)
	
	ОбъектСтруктура = Новый Структура;
	ОбъектСтруктура.Вставить("Ссылка", 				ДокументОбъект.Ссылка);
	ОбъектСтруктура.Вставить("ИсправленныйДокумент",ДокументОбъект.ИсправленныйДокумент);
	ОбъектСтруктура.Вставить("Сотрудник", 			ДокументОбъект.Сотрудник);
	ОбъектСтруктура.Вставить("Организация", 		ДокументОбъект.Организация);
	ОбъектСтруктура.Вставить("ПериодРегистрации", 	ДокументОбъект.ПериодРегистрации);
	ОбъектСтруктура.Вставить("ДатаНачалаСобытия",	ДокументОбъект.ДатаНачалаСобытия);
	ОбъектСтруктура.Вставить("ДенежноеСодержание", 	ДокументОбъект.ДенежноеСодержание);
	ОбъектСтруктура.Вставить("Показатели", 			ДокументОбъект.Показатели);
	ОбъектСтруктура.Вставить("ДенежноеСодержаниеФактическиеНачисления", 		ДокументОбъект.ДенежноеСодержаниеФактическиеНачисления);
	ОбъектСтруктура.Вставить("КоэффициентыРаспределенияДенежногоСодержания", 	ДокументОбъект.КоэффициентыРаспределенияДенежногоСодержания);
	ОбъектСтруктура.Вставить("ПериодРасчетаСохраняемогоСодержанияНачало", 		ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало);
	ОбъектСтруктура.Вставить("ПериодРасчетаСохраняемогоСодержанияОкончание", 	ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание);
	ОбъектСтруктура.Вставить("ФиксПериодРасчетаСохраняемогоСодержания", 		ДокументОбъект.ФиксПериодРасчетаСреднегоЗаработка);
	ОбъектСтруктура.Вставить("СохраняемоеДенежноеСодержаниеНеИндексируемое", 	ДокументОбъект.СохраняемоеДенежноеСодержаниеНеИндексируемое);
	ОбъектСтруктура.Вставить("СохраняемоеДенежноеСодержание", 					ДокументОбъект.СохраняемоеДенежноеСодержание);
	ОбъектСтруктура.Вставить("МесячноеДенежноеСодержание", 						ДокументОбъект.МесячноеДенежноеСодержание);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
		ОбъектСтруктура.Вставить("НазначенияРасчетаДенежногоСодержания", Модуль.НазначенияРасчетаДенежногоСодержания(ДокументОбъект.Ссылка));
	КонецЕсли;
	
	//ОбъектСтруктура.Вставить("ДатаРасчетаДенежногоСодержания", ЭтотОбъект.ДатаРасчетаДенежногоСодержания);
	
	Возврат ОбъектСтруктура;
	
КонецФункции

Процедура РассчитатьСреднийЗаработок(ДокументОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДокументОбъект.РасчетДенежногоСодержания Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
			Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетДенежногоСодержания");
			Модуль.РассчитатьСохраняемоеДенежноеСодержаниеПоОбъекту(
				ДокументОбъект, 
				Документы.Отпуск.ОписаниеДокументаРасчета());
		КонецЕсли;
	Иначе	
		ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
		ДополнительныеПараметры.Индексации = ДокументОбъект.ДанныеОбИндексации;
		ДополнительныеПараметры.ДатаНачалаСобытия = ДокументОбъект.ДатаНачалаСобытия;
		ДополнительныеПараметры.НачалоПериода = ДокументОбъект.ПериодРасчетаСреднегоЗаработкаНачало;
		ДополнительныеПараметры.ОкончаниеПериода = ДокументОбъект.ПериодРасчетаСреднегоЗаработкаОкончание;
		ДополнительныеПараметры.ПоЧасам = ЭтоСреднеЧасовойЗаработок(ДокументОбъект);
		
		СпособыРасчетаСреднегоЗаработка = Документы.Отпуск.СпособыРасчетаСреднегоЗаработка();
		
		Для Каждого КлючИЗначение Из СпособыРасчетаСреднегоЗаработка Цикл
			ДополнительныеПараметры.СпособРасчетаОтпуска = КлючИЗначение.Значение;
			ЗначенияПоказателей = УчетСреднегоЗаработкаКлиентСервер.ЗначенияПоказателейСреднегоЗаработкаОбщего(ДокументОбъект.СреднийЗаработокОбщий, ДокументОбъект.ОтработанноеВремяДляСреднегоОбщий, ДополнительныеПараметры);
			ДокументОбъект[КлючИЗначение.Ключ] = ЗначенияПоказателей.СреднийЗаработокОбщий;
			Если ПолучитьФункциональнуюОпцию("ИндексироватьСреднийЗаработокЧастично") Тогда
				УчетСреднегоЗаработка.ЗаполнитьДанныеЧастичнойИндексацииОтпусков(ДокументОбъект, ЗначенияПоказателей, КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры	
	
Функция ЭтоСреднеЧасовойЗаработок(ДокументОбъект)
	
	// Отпускные считаются только по среднедневному заработку.
	Возврат Ложь;
	
КонецФункции

Процедура СброситьПризнакФиксРасчет(МенеджерРасчета, СбрасываемыеСтроки)
	Для Каждого СтрокаТаблицы Из МенеджерРасчета.Зарплата.Начисления Цикл
		Если СтрокаТаблицы.ФиксРасчет 
			И СбрасываемыеСтроки[СтрокаТаблицы] = Истина Тогда
			
			СтрокаТаблицы.ФиксРасчет = Ложь;
			СтрокаТаблицы.ФиксРасчетВремени = Ложь;
		КонецЕсли;				
	КонецЦикла;	
КонецПроцедуры	
	
Процедура ЗаполнитьУдержания(ДокументОбъект, МенеджерРасчета)
	
	Если Не РасчетЗарплатыРасширенный.ЭтоМежрасчетнаяВыплата(ДокументОбъект.ПорядокВыплаты) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерРасчета.ЗаполнитьУдержанияСотрудникаЗаПериод(
		ДокументОбъект.Сотрудник, 
		ДокументОбъект.ПериодРегистрации, 
		КонецМесяца(ДокументОбъект.ПериодРегистрации));
	
КонецПроцедуры

Процедура РасчетЗарплатыВДанныeОбъекта(ДокументОбъект, ДанныеМенеджераРасчета)
	Документы.Отпуск.ОчиститьРассчитанныеДанные(ДокументОбъект, Истина, Ложь);
	
	РезультатРасчетаНачисленийВДанныеОбъекта(ДокументОбъект, ДанныеМенеджераРасчета);
		
	ТаблицыУдержаний = РасчетДокументовБЗК.ТаблицыУдержанийДокумента();
	ТаблицыУдержаний.Удержания = ДокументОбъект.Удержания;
	ТаблицыУдержаний.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовУдержаний;
	ТаблицыУдержаний.Показатели = ДокументОбъект.Показатели;
	
	ОписаниеТаблицУдержаний = РасчетДокументовБЗК.ОписаниеТаблицУдержанийДокумента();
	ОписаниеТаблицУдержаний.Удержания = Документы.Отпуск.ОписаниеТаблицыУдержаний();
	
	РасчетДокументовБЗК.РасчетЗарплатыУдержанияВДанныеОбъекта(
		ТаблицыУдержаний, 
		ДанныеМенеджераРасчета.Удержания, 
		ОписаниеТаблицУдержаний);
	
	ТаблицыНДФЛ = РасчетДокументовБЗК.ТаблицыНДФЛДокумента();
	ТаблицыНДФЛ.НДФЛ = ДокументОбъект.НДФЛ;
	ТаблицыНДФЛ.Вычеты = ДокументОбъект.ПримененныеВычетыНаДетейИИмущественные;
	ТаблицыНДФЛ.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовУдержаний;	
	ОписаниеТаблицыНДФЛ = Документы.Отпуск.ОписаниеТаблицыНДФЛ();
	
	РасчетДокументовБЗК.РасчетЗарплатыНДФЛВДанныеОбъекта(ТаблицыНДФЛ, ДанныеМенеджераРасчета.НДФЛ, ОписаниеТаблицыНДФЛ);
	
	ОписаниеТаблицыЗаймов = Документы.Отпуск.ОписаниеТаблицыПогашениеЗаймов();
	РасчетДокументовБЗК.РасчетЗарплатыПогашениеЗаймовВДанныеОбъекта(
		ДокументОбъект.ПогашениеЗаймов, 
		ДанныеМенеджераРасчета.ПогашениеЗаймов, 
		ДокументОбъект.РаспределениеРезультатовУдержаний, 
		ОписаниеТаблицыЗаймов);
		
	РасчетДокументовБЗК.РасчетЗарплатыКорректировкиВыплатыВДанныеОбъекта(
		ДокументОбъект.КорректировкиВыплаты, 
		ДанныеМенеджераРасчета.КорректировкиВыплаты, 
		ДокументОбъект.РаспределениеРезультатовУдержаний, 
		ОписаниеТаблицыЗаймов);

КонецПроцедуры

Процедура ДанныеФормыВДанныеМенеджераРасчета(ДокументОбъект, МенеджерРасчета)
	
	ДокументыРазовыхНачислений.ПередПомещениемДанныхОбъектаВМенеджерРасчета(ДокументОбъект);
	
	ТаблицыНачисленийДокумента = РасчетДокументовБЗК.ТаблицыНачисленийДокумента();
	ТаблицыНачисленийДокумента.Показатели = ДокументОбъект.Показатели;
	ТаблицыНачисленийДокумента.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовНачислений;
	ТаблицыНачисленийДокумента.РаспределениеПоТерриториямУсловиямТруда = ДокументОбъект.РаспределениеПоТерриториямУсловиямТруда;
	
	//Начисления
	РасчетДокументовБЗК.НачисленияВМенеджерРасчета(ДокументОбъект.Начисления, МенеджерРасчета, ТаблицыНачисленийДокумента, ДокументОбъект.Организация);
	
	//НачисленияПерерасчет
	РасчетДокументовБЗК.НачисленияПерерасчетСНулевымиСторноМенеджерРасчета(
		ДокументОбъект.НачисленияПерерасчет, 
		ДокументОбъект.НачисленияПерерасчетНулевыеСторно, 
		МенеджерРасчета, 
		ТаблицыНачисленийДокумента,
		ДокументОбъект.Организация);
	
	//УправленческиеНачисления
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		Модуль.НачисленияОбъектаВМенеджерРасчета(
			ДокументОбъект.УправленческиеНачисления, 
			МенеджерРасчета,
			ТаблицыНачисленийДокумента);
	КонецЕсли;
	
	ТаблицыУдержанийДокумента = РасчетДокументовБЗК.ТаблицыУдержанийДокумента();
	ТаблицыУдержанийДокумента.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовУдержаний;
	ТаблицыУдержанийДокумента.Показатели = ДокументОбъект.Показатели;
	
	//Удержания
	РасчетДокументовБЗК.УдержанияВМенеджерРасчета(ДокументОбъект.Удержания, МенеджерРасчета, ТаблицыУдержанийДокумента);
	
	//КорректировкиВыплаты
	РасчетДокументовБЗК.КорректировкиВыплатыВМенеджерРасчета(ДокументОбъект.КорректировкиВыплаты, МенеджерРасчета, ТаблицыНачисленийДокумента.РаспределениеПоСтатьям);
	
	//ПогашениеЗаймов
	РасчетДокументовБЗК.ПогашениеЗаймовВДанныеМенеджераРасчета(ДокументОбъект.ПогашениеЗаймов, МенеджерРасчета, ТаблицыНачисленийДокумента.РаспределениеПоСтатьям);
	
	ТаблицыНДФЛ = РасчетДокументовБЗК.ТаблицыНДФЛДокумента();
	ТаблицыНДФЛ.НДФЛ = ДокументОбъект.НДФЛ;
	ТаблицыНДФЛ.Вычеты = ДокументОбъект.ПримененныеВычетыНаДетейИИмущественные;
	ТаблицыНДФЛ.РаспределениеПоСтатьям = ДокументОбъект.РаспределениеРезультатовУдержаний;	
	
	//НДФЛ
	РасчетДокументовБЗК.НДФЛВДанныеМенеджераРасчета(ТаблицыНДФЛ, МенеджерРасчета);
	
	//КоэффициентыСреднегоЗаработкаДокумента
	МенеджерРасчета.НастройкиБухучета.КоэффициентыСреднегоЗаработкаДокумента = 
		УчетСреднегоЗаработка.КоэффициентыРаспределенияСреднегоЗаработкаДокумента(
			ДокументОбъект, 
			Документы.Отпуск.ОписаниеДокументаРасчета(),
			ЭтоСреднеЧасовойЗаработок(ДокументОбъект));
	
	//КоэффициентыРаспределенияДенежногоСодержания
	МенеджерРасчета.НастройкиБухучета.КоэффициентыРаспределенияДенежногоСодержания = ДокументОбъект.КоэффициентыРаспределенияДенежногоСодержания.Выгрузить();
КонецПроцедуры

// Функция возвращает виды расчета, хранящихся в документе. 
//
// Возвращаемое значение - тип Массив.
Функция ВидыРасчетаДокумента(ДокументОбъект)

	МассивВидовРасчета = Новый Массив;
	МассивВидовРасчета.Добавить(ДокументОбъект.ВидРасчетаОсновногоОтпуска);
	МассивВидовРасчета.Добавить(ДокументОбъект.ВидРасчетаКомпенсацииОсновногоОтпуска);
	
	ВидыРасчетаДополнительныхОтпусков = ДокументОбъект.ДополнительныеОтпуска.ВыгрузитьКолонку("ВидРасчета");
	ВидыРасчетаКомпенсацииДополнительныхОтпусков = ДокументОбъект.ДополнительныеОтпуска.ВыгрузитьКолонку("ВидРасчетаКомпенсации");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовРасчета, ВидыРасчетаДополнительныхОтпусков);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовРасчета, ВидыРасчетаКомпенсацииДополнительныхОтпусков);
	
	Возврат МассивВидовРасчета;
	
КонецФункции

Функция ДанныеОбОтгулах(РеквизитыДляПроведения)

	ТаблицаОтгулов = Новый Структура("Организация, Сотрудник, Период, ВидДвижения, Дни, Часы");
	ТаблицаОтгулов.Период = ДатаНачалаОтгула(РеквизитыДляПроведения);
	ТаблицаОтгулов.ВидДвижения = ВидДвиженияНакопления.Расход;
	ТаблицаОтгулов.Организация = РеквизитыДляПроведения.Организация;
	ТаблицаОтгулов.Сотрудник = РеквизитыДляПроведения.Сотрудник;
	ТаблицаОтгулов.Дни = РеквизитыДляПроведения.РасходДнейОтгула; 
	ТаблицаОтгулов.Часы = РеквизитыДляПроведения.РасходЧасовОтгула;

	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаОтгулов);
	
КонецФункции

Процедура ЗаполнитьДанныеОбИспользованииОтгулов(РеквизитыДляПроведения, ДанныеДляПроведения)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДляПроведения.Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ОтпускОтработанныеДни.Ссылка.Организация КАК Организация,
		|	ОтпускОтработанныеДни.Ссылка.Сотрудник КАК Сотрудник,
		|	ОтпускОтработанныеДни.Дата КАК ОтработанныйДень,
		|	ВЫБОР
		|		КОГДА ОтпускОтработанныеДни.Часы = 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Дни,
		|	ОтпускОтработанныеДни.Часы КАК Часы
		|ИЗ
		|	Документ.Отпуск.ОтработанныеДни КАК ОтпускОтработанныеДни
		|ГДЕ
		|	ОтпускОтработанныеДни.Ссылка = &Ссылка
		|	И ОтпускОтработанныеДни.Ссылка.ПредоставитьОтгул";
	
	ИспользованиеОтгулов = Запрос.Выполнить().Выгрузить();
	ИспользованиеОтгулов.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	ИспользованиеОтгулов.ЗаполнитьЗначения(ДатаНачалаОтгула(РеквизитыДляПроведения), "Период");
	
	ДанныеДляПроведения.Вставить("ИспользованиеОтгулов", ИспользованиеОтгулов);
	
КонецПроцедуры

Функция ПериодОтгула(РеквизитыДляПроведения)
	
	Начало = ?(РеквизитыДляПроведения.ПредоставитьОсновнойОтпуск, КонецДня(РеквизитыДляПроведения.ДатаОкончанияОсновногоОтпуска)+1, '00010101');
	Если РеквизитыДляПроведения.ПредоставитьДополнительныйОтпуск Тогда
		Для Каждого СтрокаТаблицы Из РеквизитыДляПроведения.ДополнительныеОтпуска Цикл
			Начало = Макс(Начало , КонецДня(СтрокаТаблицы.ДатаОкончания)+1);
		КонецЦикла;
	КонецЕсли;
	Окончание = УчетРабочегоВремениРасширенный.ДатаОкончанияПоГрафикуРаботыСотрудника(РеквизитыДляПроведения.Сотрудник, Начало, РеквизитыДляПроведения.КоличествоДнейОтгула);
	
	Возврат Новый Структура("Начало, Окончание", Начало, Окончание);
	
КонецФункции

Функция ДатаНачалаОтгула(РеквизитыДляПроведения)

	ОтгулыНачисления = РеквизитыДляПроведения.Начисления.НайтиСтроки(Новый Структура("Начисление", РеквизитыДляПроведения.ВидРасчетаОтгул));
	Если ОтгулыНачисления.Количество() > 0 Тогда
		Возврат ОтгулыНачисления[0].ДатаНачала;
	Иначе	
		Возврат РеквизитыДляПроведения.Дата;
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьПериодыОтпусков(РеквизитыДляПроведения, ДанныеДляПроведения)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДляПроведения.Ссылка);
	Запрос.УстановитьПараметр("ОсновнойОтпуск", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Отпуск.Сотрудник КАК Сотрудник,
	               |	Отпуск.ДатаНачалаОсновногоОтпуска КАК ДатаНачала,
	               |	Отпуск.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончания,
	               |	&ОсновнойОтпуск КАК ВидОтпуска,
	               |	Отпуск.КоличествоДнейОсновногоОтпуска КАК КоличествоДней,
	               |	Отпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск КАК РабочийПериодС,
	               |	Отпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск КАК РабочийПериодПо,
	               |	ЛОЖЬ КАК Компенсация,
	               |	Отпуск.ДатаНачалаОсновногоОтпуска КАК ПериодЗаписи,
	               |	Отпуск.Основание КАК Основание
	               |ИЗ
	               |	Документ.Отпуск КАК Отпуск
	               |ГДЕ
	               |	Отпуск.Ссылка = &Ссылка
	               |	И Отпуск.ПредоставитьОсновнойОтпуск
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДополнительныеОтпуска.Ссылка.Сотрудник,
	               |	ДополнительныеОтпуска.ДатаНачала,
	               |	ДополнительныеОтпуска.ДатаОкончания,
	               |	ДополнительныеОтпуска.ВидОтпуска,
	               |	ДополнительныеОтпуска.КоличествоДней,
	               |	ДополнительныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	               |	ДополнительныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	               |	ЛОЖЬ,
	               |	ДополнительныеОтпуска.ДатаНачала,
	               |	ДополнительныеОтпуска.Основание
	               |ИЗ
	               |	Документ.Отпуск.ДополнительныеОтпуска КАК ДополнительныеОтпуска
	               |ГДЕ
	               |	ДополнительныеОтпуска.Ссылка = &Ссылка
	               |	И ДополнительныеОтпуска.Ссылка.ПредоставитьДополнительныйОтпуск
	               |	И ДополнительныеОтпуска.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Отпуск.Сотрудник,
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	&ОсновнойОтпуск,
	               |	Отпуск.КоличествоДнейКомпенсацииОсновногоОтпуска,
	               |	Отпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	               |	Отпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	               |	ИСТИНА,
	               |	Отпуск.Дата,
	               |	Отпуск.Основание
	               |ИЗ
	               |	Документ.Отпуск КАК Отпуск
	               |ГДЕ
	               |	Отпуск.Ссылка = &Ссылка
	               |	И Отпуск.ПредоставитьКомпенсациюОсновногоОтпуска
	               |	И Отпуск.КоличествоДнейКомпенсацииОсновногоОтпуска > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДополнительныеОтпуска.Ссылка.Сотрудник,
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	ДАТАВРЕМЯ(1, 1, 1),
	               |	ДополнительныеОтпуска.ВидОтпуска,
	               |	СУММА(ДополнительныеОтпуска.КоличествоДнейКомпенсации),
	               |	МИНИМУМ(ДополнительныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск),
	               |	МАКСИМУМ(ДополнительныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск),
	               |	ИСТИНА,
	               |	ДополнительныеОтпуска.Ссылка.Дата,
	               |	МАКСИМУМ(ВЫРАЗИТЬ(ДополнительныеОтпуска.Основание КАК СТРОКА(1024)))
	               |ИЗ
	               |	Документ.Отпуск.ДополнительныеОтпуска КАК ДополнительныеОтпуска
	               |ГДЕ
	               |	ДополнительныеОтпуска.Ссылка = &Ссылка
	               |	И ДополнительныеОтпуска.Ссылка.ПредоставитьДополнительныйОтпуск
	               |	И ДополнительныеОтпуска.КоличествоДнейКомпенсации > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДополнительныеОтпуска.Ссылка.Сотрудник,
	               |	ДополнительныеОтпуска.ВидОтпуска,
	               |	ДополнительныеОтпуска.Ссылка.Дата";
	
	ПериодыОтпусков = ОстаткиОтпусков.ПустаяТаблицаПериодовОтпусков();
	
	ИсходныйДокумент = РеквизитыДляПроведения.Ссылка;
	ИсходныйДокументДата = РеквизитыДляПроведения.Дата;
	ИсходныйДокументНомер = ЗарплатаКадрыОтчеты.НомерНаПечать(РеквизитыДляПроведения.Номер, РеквизитыДляПроведения.НомерПервичногоДокумента);
	ДокументЗаполнения = РеквизитыДляПроведения.ДокументЗаполнения;
	
	Если ЗначениеЗаполнено(РеквизитыДляПроведения.ИсправленныйДокумент) Тогда 
		ИсходныйДокумент = ИсправлениеДокументовЗарплатаКадры.ПервыйДокументЦепочкиИсправлений(РеквизитыДляПроведения.ИсправленныйДокумент);
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйДокумент, "Дата, Номер, ДокументЗаполнения, НомерПервичногоДокумента"); 
	    ИсходныйДокументДата = ЗначенияРеквизитов["Дата"];
	    ИсходныйДокументНомер = ЗарплатаКадрыОтчеты.НомерНаПечать(ЗначенияРеквизитов["Номер"], ЗначенияРеквизитов["НомерПервичногоДокумента"]);
	    ДокументЗаполнения = ЗначенияРеквизитов["ДокументЗаполнения"];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументЗаполнения) Тогда
		ИсходныйДокумент = ДокументЗаполнения;
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйДокумент, "Дата, Номер, НомерПервичногоДокумента"); 
	    ИсходныйДокументДата = ЗначенияРеквизитов["Дата"];
	    ИсходныйДокументНомер = ЗначенияРеквизитов["Номер"];
	    ИсходныйДокументНомер = ЗарплатаКадрыОтчеты.НомерНаПечать(ЗначенияРеквизитов["Номер"], ЗначенияРеквизитов["НомерПервичногоДокумента"]);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ПериодыОтпусков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Состояние = СостоянияСотрудников.СостояниеПоВидуОтпуска(Выборка.ВидОтпуска);
		НоваяСтрока.ИсходныйДокумент = ИсходныйДокумент;
		НоваяСтрока.ИсходныйДокументДата = ИсходныйДокументДата;
		НоваяСтрока.ИсходныйДокументНомер = ИсходныйДокументНомер;
	КонецЦикла;
	
	ДанныеДляПроведения.Вставить("ПериодыОтпусков", ПериодыОтпусков);	
	
КонецПроцедуры

Процедура ПроверитьПересечениеФактическогоПериодаДействия(ДокументСсылка, Отказ)
	
	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
	
	ИменаРеквизитов = 
	"ПериодРегистрации,
	|Организация,
	|ИсправленныйДокумент,
	|ВидРасчетаОсновногоОтпуска";
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, ИменаРеквизитов);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Начисления.*
	               |ИЗ
	               |	Документ.Отпуск.Начисления КАК Начисления
	               |ГДЕ
	               |	Начисления.Ссылка = &Ссылка";
				   
	Начисления = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПроверки = РасчетЗарплатыРасширенный.ПараметрыПроверкиПересеченияФактическогоПериодаДействия();
	ПараметрыПроверки.Организация = РеквизитыДокумента.Организация;
	ПараметрыПроверки.ПериодРегистрации = РеквизитыДокумента.ПериодРегистрации;
	ПараметрыПроверки.Документ = ДокументСсылка;
	ПараметрыПроверки.Начисления = Начисления;
	ПараметрыПроверки.ИсправленныйДокумент = РеквизитыДокумента.ИсправленныйДокумент;
	ПараметрыПроверки.ОсновныеНачисления = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РеквизитыДокумента.ВидРасчетаОсновногоОтпуска);
	
	РасчетЗарплатыРасширенный.ПроверитьПересечениеФактическогоПериодаДействия(ПараметрыПроверки, Отказ);
	
КонецПроцедуры

Процедура СоздатьВТКадровыеДанныеСотрудниковДокумента(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуск.Сотрудник КАК Сотрудник,
	|	Отпуск.ДатаНачалаСобытия КАК Период
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка В(&МассивСсылок)";
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, "ФизическоеЛицо,ФИОПолные,ТабельныйНомер,Подразделение,Должность,ВидЗанятости");
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВТСотрудники";
	Запрос.Выполнить();
	
КонецПроцедуры

#Область ПечатьСправкиДляОплатыОтпускаЧАЭС

Функция ДанныеДляПечатиСправкиДляОплатыОтпускаЧАЭС(МассивСсылок)

	ВидОтпускаПострадавшимВАварииЧАЭС = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускПострадавшимВАварииЧАЭС");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок); 
	Запрос.УстановитьПараметр("ТаблицаДниОтпускаЧАЭС", КоличествоОплачиваемыхДнейПоВидуОтпуска(МассивСсылок, ВидОтпускаПострадавшимВАварииЧАЭС));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуска.Ссылка КАК Ссылка,
	|	Отпуска.ДатаНачалаПериодаОтсутствия КАК Дата,
	|	Отпуска.Руководитель КАК Руководитель,
	|	Отпуска.ГлавныйБухгалтер КАК ГлавныйБухгалтер
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.Отпуск КАК Отпуска
	|ГДЕ
	|	Отпуска.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниОтпускаЧАЭС.Отпуск КАК Ссылка,
	|	ДниОтпускаЧАЭС.КоличествоДней КАК КоличествоДнейОтпуска
	|ПОМЕСТИТЬ ВТДниОтпускаЧАЭС
	|ИЗ
	|	&ТаблицаДниОтпускаЧАЭС КАК ДниОтпускаЧАЭС";
	
	Запрос.Выполнить();
	
	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить("Руководитель");
	ИменаПолей.Добавить("ГлавныйБухгалтер");
	ЗарплатаКадры.СоздатьВТФИООтветственныхЛиц(Запрос.МенеджерВременныхТаблиц, Истина, ИменаПолей, "ВТДанныеДокументов");

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуска.Ссылка КАК Ссылка,
	|	Отпуска.Сотрудник КАК Сотрудник,
	|	Отпуска.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Отпуска.Номер КАК НомерДокумента,
	|	Отпуска.Дата КАК ДатаДокумента,
	|	Отпуска.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
	|	Отпуска.СохраняемоеДенежноеСодержание КАК СохраняемоеДенежноеСодержание,
	|	ВЫБОР
	|		КОГДА ОрганизацияСправочник.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ОрганизацияСправочник.Наименование
	|		ИНАЧЕ ОрганизацияСправочник.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ФИОРуководителя.РасшифровкаПодписи КАК РуководительРасшифровкаПодписи,
	|	ФИОГлавногоБухгалтера.РасшифровкаПодписи КАК ГлавныйБухгалтерРасшифровкаПодписи,
	|	Отпуска.ДолжностьРуководителя КАК ДолжностьРуководителя,
	|	Отпуска.ПериодРасчетаСреднегоЗаработкаНачало КАК РасчетныйПериодС,
	|	Отпуска.ПериодРасчетаСреднегоЗаработкаОкончание КАК РасчетныйПериодПо,
	|	ОтпускДополнительныеОтпуска.ДатаНачала КАК ДатаНачала,
	|	ОтпускДополнительныеОтпуска.ДатаОкончания КАК ДатаОкончания,
	|	ОтпускДополнительныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск КАК НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	ОтпускДополнительныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск КАК КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	ВТДниОтпускаЧАЭС.КоличествоДнейОтпуска КАК ДнейОтпуска
	|ИЗ
	|	ВТДанныеДокументов КАК ВТДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Отпуск КАК Отпуска
	|		ПО ВТДанныеДокументов.Ссылка = Отпуска.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОРуководителя
	|		ПО (Отпуска.ДатаНачалаПериодаОтсутствия = ФИОРуководителя.Дата)
	|			И (Отпуска.Ссылка = ФИОРуководителя.Ссылка)
	|			И (Отпуска.Руководитель = ФИОРуководителя.ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИООтветственныхЛиц КАК ФИОГлавногоБухгалтера
	|		ПО (Отпуска.ДатаНачалаПериодаОтсутствия = ФИОГлавногоБухгалтера.Дата)
	|			И (Отпуска.Ссылка = ФИОГлавногоБухгалтера.Ссылка)
	|			И (Отпуска.ГлавныйБухгалтер = ФИОГлавногоБухгалтера.ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияСправочник
	|		ПО (Отпуска.Организация = ОрганизацияСправочник.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Отпуск.ДополнительныеОтпуска КАК ОтпускДополнительныеОтпуска
	|		ПО ВТДанныеДокументов.Ссылка = ОтпускДополнительныеОтпуска.Ссылка
	|			И (ОтпускДополнительныеОтпуска.ВидОтпуска = &ОтпускЧАЭС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДниОтпускаЧАЭС КАК ВТДниОтпускаЧАЭС
	|		ПО ВТДанныеДокументов.Ссылка = ВТДниОтпускаЧАЭС.Ссылка";
	
	Запрос.УстановитьПараметр("ОтпускЧАЭС", ВидОтпускаПострадавшимВАварииЧАЭС);
	Результат = Запрос.Выполнить();
	
	СписокСотрудников = Результат.Выгрузить().ВыгрузитьКолонку("Сотрудник");
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, "ФИО,ДокументПредставление,Пол");
	
	ДанныеРасчетаСреднегоЗаработкаДокументов = Документы.Отпуск.ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок);

	Возврат Новый Структура("ДанныеСправок, КадровыеДанныеСотрудников, ДанныеРасчетаСреднегоЗаработкаДокументов", Результат.Выбрать(), КадровыеДанныеСотрудников, ДанныеРасчетаСреднегоЗаработкаДокументов);
	
КонецФункции 

Процедура ПриПечатиСправкиДляОплатыОтпускаЧАЭС(КонтекстПечати)
	ДанныеДляПечатиСправок = ДанныеДляПечатиСправкиДляОплатыОтпускаЧАЭС(КонтекстПечати.МассивОбъектов);
	
	ДанныеСправок				= ДанныеДляПечатиСправок.ДанныеСправок;
	КадровыеДанныеСотрудников 	= ДанныеДляПечатиСправок.КадровыеДанныеСотрудников;
	ДанныеРасчетаСреднегоЗаработкаДокументов = ДанныеДляПечатиСправок.ДанныеРасчетаСреднегоЗаработкаДокументов;
	
	Если ДанныеСправок.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Документом не регистрируется дополнительных отпусков гражданам, подвергшимся воздействию радиации вследствие катастрофы на ЧАЭС.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	
	Пока ДанныеСправок.Следующий() Цикл
		
		УправлениеПечатьюБЗК.ПередПечатьюОчередногоОбъекта(КонтекстПечати);
		
		СекцияСправка = КонтекстПечати.Макет.ПолучитьОбласть("Справка");
		СекцияИндексация = КонтекстПечати.Макет.ПолучитьОбласть("Индексация");
		СекцияПодвал = КонтекстПечати.Макет.ПолучитьОбласть("Подвал");
		
		ЗаполняемыеСвойства = "НаименованиеОрганизации,НомерДокумента,ДатаДокумента,ДнейОтпуска";
		ЗаполнитьЗначенияСвойств(СекцияСправка.Параметры, ДанныеСправок, ЗаполняемыеСвойства);
		
		ЗаполняемыеСвойства = "РуководительРасшифровкаПодписи,ДолжностьРуководителя,ГлавныйБухгалтерРасшифровкаПодписи";
		ЗаполнитьЗначенияСвойств(СекцияПодвал.Параметры, ДанныеСправок, ЗаполняемыеСвойства);
		
		СекцияСправка.Параметры.НаименованиеОрганизации = СокрЛП(СекцияСправка.Параметры.НаименованиеОрганизации);
		
		КадровыеДанныеСотрудника = КадровыеДанныеСотрудников.Найти(ДанныеСправок.Сотрудник);
		ФамилияИО = КадровыеДанныеСотрудника.ФИО;
		ФизическиеЛицаЗарплатаКадры.Просклонять(ФамилияИО, 3, ФамилияИО, КадровыеДанныеСотрудника.Пол, КадровыеДанныеСотрудника.ФизическоеЛицо);
		СекцияСправка.Параметры.ФамилияИО = ФамилияИО;
		
		ФорматнаяСтрокаДаты = "ДЛФ=DD";
		
		ПредставлениеДатыНачалаОтпуска  							= Формат(ДанныеСправок.ДатаНачала, ФорматнаяСтрокаДаты);
		ПредставлениеДатыОкончанияОтпуска  							= Формат(ДанныеСправок.ДатаОкончания, ФорматнаяСтрокаДаты);
		СекцияСправка.Параметры.ДатаНачалаЧисло 					= СокрЛП(Лев(ПредставлениеДатыНачалаОтпуска,2));
		СекцияСправка.Параметры.ДатаНачалаМесяцГод 					= СокрЛП(Прав(ПредставлениеДатыНачалаОтпуска, СтрДлина(ПредставлениеДатыНачалаОтпуска)-2));
		СекцияСправка.Параметры.ДатаОкончанияЧисло 					= СокрЛП(Лев(ПредставлениеДатыОкончанияОтпуска,2));
		СекцияСправка.Параметры.ДатаОкончанияМесяцГод 				= СокрЛП(Прав(ПредставлениеДатыОкончанияОтпуска, СтрДлина(ПредставлениеДатыОкончанияОтпуска)-2));
		
		ПредставлениеДатыНачалаРасчетногоПериода 						= Формат(ДанныеСправок.РасчетныйПериодС, ФорматнаяСтрокаДаты);
		ПредставлениеДатыОкончанияРасчетногоПериода  					= Формат(ДанныеСправок.РасчетныйПериодПо, ФорматнаяСтрокаДаты);
		СекцияСправка.Параметры.ДатаНачалаРасчетногоПериодаЧисло 		= СокрЛП(Лев(ПредставлениеДатыНачалаРасчетногоПериода,2));
		СекцияСправка.Параметры.ДатаНачалаРасчетногоПериодаМесяцГод 	= СокрЛП(Прав(ПредставлениеДатыНачалаРасчетногоПериода, СтрДлина(ПредставлениеДатыНачалаРасчетногоПериода)-2));
		СекцияСправка.Параметры.ДатаОкончанияРасчетногоПериодаЧисло 	= СокрЛП(Лев(ПредставлениеДатыОкончанияРасчетногоПериода,2));
		СекцияСправка.Параметры.ДатаОкончанияРасчетногоПериодаМесяцГод 	= СокрЛП(Прав(ПредставлениеДатыОкончанияРасчетногоПериода, СтрДлина(ПредставлениеДатыОкончанияРасчетногоПериода)-2));
		
		ПредставлениеДатыНачалаПериодаРаботы  						= Формат(ДанныеСправок.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск, ФорматнаяСтрокаДаты);
		ПредставлениеДатыОкончанияПериодаРаботы  					= Формат(ДанныеСправок.КонецПериодаЗаКоторыйПредоставляетсяОтпуск, ФорматнаяСтрокаДаты);
		СекцияСправка.Параметры.ДатаНачалаПериодаРаботыЧисло 		= СокрЛП(Лев(ПредставлениеДатыНачалаПериодаРаботы,2));
		СекцияСправка.Параметры.ДатаНачалаПериодаРаботыМесяцГод 	= СокрЛП(Прав(ПредставлениеДатыНачалаПериодаРаботы, СтрДлина(ПредставлениеДатыНачалаПериодаРаботы)-2));
		СекцияСправка.Параметры.ДатаОкончанияПериодаРаботыЧисло 	= СокрЛП(Лев(ПредставлениеДатыОкончанияПериодаРаботы,2));
		СекцияСправка.Параметры.ДатаОкончанияПериодаРаботыМесяцГод 	= СокрЛП(Прав(ПредставлениеДатыОкончанияПериодаРаботы, СтрДлина(ПредставлениеДатыОкончанияПериодаРаботы)-2));
		
		Для каждого Элемент Из ДанныеРасчетаСреднегоЗаработкаДокументов Цикл
			Если ДанныеСправок.Ссылка = Элемент.РеквизитыДокумента.Ссылка Тогда
				ДанныеРасчетаСреднегоЗаработка 	= Элемент.ДанныеРасчетаСреднего;
				ПараметрыРасчетаСреднего 		= Элемент.ПараметрыРасчета;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Заработок 			= УчетСреднегоЗаработкаКлиентСервер.ИтогиПоПолю(ДанныеРасчетаСреднегоЗаработка["Заработок"], "Учтено");		
		ОтработаноДней 		= УчетСреднегоЗаработкаКлиентСервер.ИтогиПоПолю(ДанныеРасчетаСреднегоЗаработка["ОтработанноеВремя"], "Учтено");
		СреднийЗаработок 	= УчетСреднегоЗаработкаКлиентСервер.СреднийЗаработок(Заработок, ОтработаноДней);
		
		Если ДанныеСправок.РасчетДенежногоСодержания Тогда
			НормаДней = 0;
			Если ОбщегоНазначенияБЗККлиентСервер.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.РасчетДенежногоСодержания") Тогда 
				Модуль = ОбщегоНазначенияБЗККлиентСервер.ОбщийМодуль("РасчетДенежногоСодержания");
				НормаДней = Модуль.КоличествоДнейВМесяцеДляОплатыОтпусков(ДанныеСправок.ДатаНачала);	
			КонецЕсли;
			
			Заработок 		 = ДанныеСправок.СохраняемоеДенежноеСодержание;		
			СреднийЗаработок = 0;
			Если НормаДней <> 0 Тогда 
				СреднийЗаработок = Заработок / НормаДней;	
			КонецЕсли;
		КонецЕсли;
		
		СекцияСправка.Параметры.ОтработаноДней 		= ОтработаноДней;
		СекцияСправка.Параметры.ЗаработокРуб 		= Формат(Цел(Заработок),"ЧДЦ=0; ЧН=-");
		СекцияСправка.Параметры.ЗаработокКоп 		= Формат((Заработок - Цел(Заработок)) * 100,"ЧЦ=2; ЧДЦ=0; ЧН=-");
		СекцияСправка.Параметры.ДневнойЗаработокРуб = Формат(Цел(СреднийЗаработок),"ЧДЦ=0; ЧН=-");
		СекцияСправка.Параметры.ДневнойЗаработокКоп = Формат((СреднийЗаработок - Цел(СреднийЗаработок)) * 100,"ЧЦ=2; ЧДЦ=0; ЧН=-");
		
		Если ДанныеСправок.РасчетДенежногоСодержания Тогда
			СекцияСправка.Область("ОбластьОтработаноДней").Текст = "";
		КонецЕсли;
		
		КонтекстПечати.ТабличныйДокумент.Вывести(СекцияСправка);
		
		ПериодОтпуска = Новый Структура("ДатаНачалаПериода, ДатаОкончанияПериода", ДанныеСправок.ДатаНачала, ДанныеСправок.ДатаОкончания); 
		ПериодыОтпуска = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПериодОтпуска);
		
		ДанныеОтпускаЧАЭС = УчетСреднегоЗаработка.ДанныеОплатыОтпускаЧАЭС(ДанныеСправок.Сотрудник, СреднийЗаработок, ДанныеСправок.ДнейОтпуска, ПериодыОтпуска);
		Для Каждого ДанныеИндексации Из ДанныеОтпускаЧАЭС.КоэффициентыИндексации Цикл
			СекцияИндексация.Параметры.ДатаИндексации = Формат(ДанныеИндексации.Период, ФорматнаяСтрокаДаты);
			СекцияИндексация.Параметры.КоэффициентИндексации = Окр(ДанныеИндексации.Коэффициент, 2);
			КонтекстПечати.ТабличныйДокумент.Вывести(СекцияИндексация);
		КонецЦикла;
		
		КВыплате = ДанныеОтпускаЧАЭС.Сумма;
		
		СекцияПодвал.Параметры.КВыплатеРуб 		= Формат(Цел(КВыплате),"ЧДЦ=0; ЧН=-");
		СекцияПодвал.Параметры.КВыплатеКоп 		= Формат((КВыплате - Цел(КВыплате)) * 100,"ЧЦ=2; ЧДЦ=0; ЧН=-");
		СекцияПодвал.Параметры.КВыплатеПрописью 	= РаботаСКурсамиВалют.СформироватьСуммуПрописью(КВыплате, ВалютаУчета);
		
		СекцияПодвал.Параметры.ДокументПредставление = КадровыеДанныеСотрудника.ДокументПредставление;
		
		КонтекстПечати.ТабличныйДокумент.Вывести(СекцияПодвал);
		
		УправлениеПечатьюБЗК.ПослеПечатиОчередногоОбъекта(КонтекстПечати, ДанныеСправок.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПФ_MXL_ОтпускНаПериодЛечения

Процедура ПриПечатиОтпускаНаПериодЛечения_2024(КонтекстПечати)
	СЭДОФСС.УстановитьСтандартныйОтступПечати(КонтекстПечати);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", КонтекстПечати.МассивОбъектов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Номер КАК Номер,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.ДатаНачалаПериодаОтсутствия КАК Период,
	|	ДанныеДокументов.ДатаНачалаПериодаОтсутствия КАК ДатаНачала,
	|	ДанныеДокументов.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТДанныеДокументов
	|ИЗ
	|	Документ.Отпуск КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Период КАК Период
	|ПОМЕСТИТЬ ВТОрганизацииПериоды
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов";
	Запрос.Выполнить();
	
	ЗарплатаКадрыРасширенный.СоздатьВТОтветственныеЛица(
		Запрос.МенеджерВременныхТаблиц,
		"ВТОрганизацииПериоды",
		"ПредставительСФР, ДолжностьПредставителяСФР",
		"ВТОтветственныеЛица");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.Период КАК Период
	|ПОМЕСТИТЬ ВТФизлица
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтветственныеЛица.ПредставительСФР,
	|	ОтветственныеЛица.Период
	|ИЗ
	|	ВТОтветственныеЛица КАК ОтветственныеЛица";
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТФизлица",
		"ФизическоеЛицо,Период");
	ИменаПолей = "СтраховойНомерПФР, Фамилия, Имя, Отчество, ФИОПолные, ИОФамилия";
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(Описатель, Истина, ИменаПолей);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.Номер КАК Номер,
	|	ДанныеДокументов.Дата КАК Дата,
	|	ДанныеДокументов.Организация КАК Организация,
	|	ДанныеДокументов.Сотрудник КАК Сотрудник,
	|	ДанныеДокументов.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеДокументов.Период КАК Период,
	|	ДанныеДокументов.ДатаНачала КАК ДатаНачала,
	|	ДанныеДокументов.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА ОрганизацияСправочник.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА ОрганизацияСправочник.Наименование
	|		ИНАЧЕ ОрганизацияСправочник.НаименованиеПолное
	|	КОНЕЦ КАК СтраховательНаименование,
	|	ОтветственныеЛица.ПредставительСФР КАК ПредставительСФР,
	|	ОтветственныеЛица.ДолжностьПредставителяСФР КАК ДолжностьПредставителяСФР,
	|	УполномоченныйКадровыеДанные.ИОФамилия КАК РасшифровкаПодписиПредставителяСФР,
	|	УполномоченныйКадровыеДанные.ФИОПолные КАК ФИОПредставителяСФР,
	|	ФизическоеЛицоКадровыеДанные.СтраховойНомерПФР КАК СНИЛС,
	|	ФизическоеЛицоКадровыеДанные.Фамилия КАК Фамилия,
	|	ФизическоеЛицоКадровыеДанные.Имя КАК Имя,
	|	ФизическоеЛицоКадровыеДанные.Отчество КАК Отчество
	|ИЗ
	|	ВТДанныеДокументов КАК ДанныеДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ОрганизацияСправочник
	|		ПО ДанныеДокументов.Организация = ОрганизацияСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветственныеЛица КАК ОтветственныеЛица
	|		ПО ДанныеДокументов.Организация = ОтветственныеЛица.Организация
	|			И ДанныеДокументов.Период = ОтветственныеЛица.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК УполномоченныйКадровыеДанные
	|		ПО (ОтветственныеЛица.ПредставительСФР = УполномоченныйКадровыеДанные.ФизическоеЛицо)
	|			И (ОтветственныеЛица.Период = УполномоченныйКадровыеДанные.Период)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ФизическоеЛицоКадровыеДанные
	|		ПО ДанныеДокументов.ФизическоеЛицо = ФизическоеЛицоКадровыеДанные.ФизическоеЛицо
	|			И ДанныеДокументов.Период = ФизическоеЛицоКадровыеДанные.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ФизическоеЛицо,
	|	Дата";
	
	ТаблицаШапка = Запрос.Выполнить().Выгрузить();
	ТаблицаШапка.Колонки.Добавить("СреднийЗаработокОбщий");
	
	ЗаполнитьДолжностьПредставителяСФРПоКадровомуУчету(Запрос, ТаблицаШапка);
	
	Запрос.УстановитьПараметр("ВидОтпуска", ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.ОтпускНаСанаторноКурортноеЛечение"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеОтпуска.Ссылка КАК Ссылка,
	|	СУММА(ДополнительныеОтпуска.КоличествоДней) КАК КоличествоДней,
	|	МИНИМУМ(ДополнительныеОтпуска.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ДополнительныеОтпуска.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	Документ.Отпуск.ДополнительныеОтпуска КАК ДополнительныеОтпуска
	|ГДЕ
	|	ДополнительныеОтпуска.Ссылка В(&МассивСсылок)
	|	И ДополнительныеОтпуска.ВидОтпуска = &ВидОтпуска
	|
	|СГРУППИРОВАТЬ ПО
	|	ДополнительныеОтпуска.Ссылка";
	
	ПродолжительностьОтпусков = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПериодОтпуска = Новый Структура("ДатаНачала, ДатаОкончания, КоличествоДней");
		ЗаполнитьЗначенияСвойств(ПериодОтпуска, Выборка);
		ПродолжительностьОтпусков.Вставить(Выборка.Ссылка, ПериодОтпуска);
	КонецЦикла;
	
	ДанныеСреднегоЗаработка = Новый Соответствие;
	СреднийЗаработокДокументов = ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(КонтекстПечати.МассивОбъектов);
	Для Каждого ДанныеДокумента Из СреднийЗаработокДокументов Цикл
		СсылкаНаДокумент = ДанныеДокумента.РеквизитыДокумента.Ссылка;
		ДанныеСреднегоЗаработка.Вставить(СсылкаНаДокумент, ДанныеДокумента);
	КонецЦикла;
	
	ВидыПремий = Новый Массив;
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой);
	
	Организации = КоллекцииБЗК.УникальныеЗначенияКолонки(ТаблицаШапка, "Организация");
	ПустаяДата = Неопределено;
	ТипыСпособовПрямыхВыплат = СпособыПрямыхВыплатФСС.ТипыСпособовПрямыхВыплат();
	Для Каждого Организация Из Организации Цикл
		Фильтр = Новый Структура("Организация", Организация);
		Физлица = КоллекцииБЗК.УникальныеЗначенияКолонкиСФильтром(ТаблицаШапка, Фильтр, "ФизическоеЛицо");
		НастройкиПрямыхВыплат = СпособыПрямыхВыплатФСС.НастройкиСотрудников(Организация, Физлица, ПустаяДата);
		СпособыПрямыхВыплатФСС.ЗаполнитьСведенияОбАдресах(НастройкиПрямыхВыплат.ТаблицаРезультат);
		
		ИменаПолей = "НаимЮЛПол, НаимЮЛСокр, РегистрационныйНомерФСС, ДополнительныйКодФСС, ИННЮЛ";
		Страхователь = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей);
		
		Найденные = ТаблицаШапка.НайтиСтроки(Фильтр);
		Для Каждого СтрокаТаблицы Из Найденные Цикл
			Данные = Обработки.ОбщиеФормыСЭДОФСС.ПустаяСтруктураДанныхДляПечатиОтпускаНаПериодЛечения();
			ЗаполнитьЗначенияСвойств(Данные, СтрокаТаблицы);
			
			ПериодОтпуска = ПродолжительностьОтпусков.Получить(СтрокаТаблицы.Ссылка);
			Если ПериодОтпуска = Неопределено Тогда 
				ПериодОтпуска = Новый Структура("ДатаНачала, ДатаОкончания, КоличествоДней");
			КонецЕсли;
			
			Если СтрДлина(Страхователь.НаимЮЛПол) <= 150 Или Не ЗначениеЗаполнено(Страхователь.НаимЮЛСокр) Тогда
				Данные.СтраховательНаименование = Страхователь.НаимЮЛПол;
			Иначе
				Данные.СтраховательНаименование = Страхователь.НаимЮЛСокр;
			КонецЕсли;
			Данные.РегистрационныйНомер = Страхователь.РегистрационныйНомерФСС;
			Данные.ДополнительныйКод = Страхователь.ДополнительныйКодФСС;
			Данные.СтраховательИНН = Страхователь.ИННЮЛ;
			
			Данные.УполномоченныйПредставительДолжность = СокрЛП(СтрокаТаблицы.ДолжностьПредставителяСФР);
			Данные.УполномоченныйПредставительФИО       = СокрЛП(СтрокаТаблицы.ФИОПредставителяСФР);
			
			Данные.ОтпускНомер                          = СтрокаТаблицы.Номер;
			Данные.ОтпускДата                           = СтрокаТаблицы.Дата;
			Данные.ОтпускДатаНачала                     = ПериодОтпуска.ДатаНачала;
			Данные.ОтпускДатаОкончания                  = ПериодОтпуска.ДатаОкончания;
			
			СпособПрямыхвыплат = НастройкиПрямыхВыплат.ТаблицаРезультат.Найти(СтрокаТаблицы.ФизическоеЛицо, "ФизическоеЛицо");
			Если СпособПрямыхвыплат <> Неопределено Тогда
				ТипСпособа = ТипыСпособовПрямыхВыплат.Найти(ТипЗнч(СпособПрямыхвыплат.Значение), "Тип");
				Если ТипСпособа <> Неопределено Тогда
					Данные.СпособВыплатыПособия = ТипСпособа.СпособВыплатыПособия;
					Если ТипСпособа.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.НаКартуМИР Тогда
						Если ЗначениеЗаполнено(СпособПрямыхвыплат.Значение) Тогда
							Данные.КартаМИР = БанковскиеКарты.ПолныйНомерКарты(СпособПрямыхвыплат.Значение);
						КонецЕсли;
					ИначеЕсли ТипСпособа.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк Тогда
						Данные.БанкНаименование = СпособПрямыхвыплат.НаименованиеБанка;
						Данные.БанкБИК          = СпособПрямыхвыплат.БИК;
						Данные.НомерСчета       = СпособПрямыхвыплат.НомерСчета;
					Иначе
						Данные.АдресПроживания = СпособПрямыхвыплат.ЗначениеАдреса;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ПремияВсего = 0;
			
			СреднийЗаработок = ДанныеСреднегоЗаработка.Получить(СтрокаТаблицы.Ссылка);
			Для Каждого ДанныеЗаработка Из СреднийЗаработок.ДанныеРасчетаСреднего.Заработок Цикл 
				Если ВидыПремий.Найти(ДанныеЗаработка.СоставнаяЧасть) <> Неопределено Тогда 
					ПремияВсего = ПремияВсего + ДанныеЗаработка.Учтено;
				КонецЕсли;
				Если ДанныеЗаработка.СоставнаяЧасть = Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок Тогда 
					СтрокаСредний = Данные.СреднийЗаработок.Найти(ДанныеЗаработка.Месяц, "Период");
					Если СтрокаСредний = Неопределено Тогда 
						СтрокаСредний = Данные.СреднийЗаработок.Добавить();
					КонецЕсли;
					СтрокаСредний.Период = ДанныеЗаработка.Месяц;
					СтрокаСредний.СуммаВыплат = СтрокаСредний.СуммаВыплат + ДанныеЗаработка.Учтено;
				КонецЕсли;
			КонецЦикла;
			Для Каждого ДанныеВремени Из СреднийЗаработок.ДанныеРасчетаСреднего.ОтработанноеВремя Цикл 
				СтрокаСредний = Данные.СреднийЗаработок.Найти(ДанныеВремени.Месяц, "Период");
				Если СтрокаСредний = Неопределено Тогда 
					СтрокаСредний = Данные.СреднийЗаработок.Добавить();
				КонецЕсли;
				СтрокаСредний.Период = ДанныеВремени.Месяц;
				СтрокаСредний.КалендарныхДней = ДанныеВремени.Учтено;
			КонецЦикла;
			
			Данные.СреднийЗаработок.Сортировать("Период");
			
			Данные.ИтогоСуммаВыплат                  = Данные.СреднийЗаработок.Итог("СуммаВыплат");
			Данные.ИтогоКалендарныхДней              = Данные.СреднийЗаработок.Итог("КалендарныхДней");
			Данные.ПремияВсего                       = ПремияВсего;
			Данные.ЗаработокВключаяПремию            = Данные.ИтогоСуммаВыплат + ПремияВсего;
			Данные.СреднийЗаработокЗаРасчетныйПериод = УчетСреднегоЗаработкаКлиентСервер.СреднийЗаработок(
				Данные.ЗаработокВключаяПремию,
				Данные.ИтогоКалендарныхДней);
			Данные.КоличествоДнейОтпуска             = ПериодОтпуска.КоличествоДней;
			Данные.СуммаКВыплатеЗаОтпуск             = ?(Данные.КоличествоДнейОтпуска = Неопределено,
				0, Данные.СреднийЗаработокЗаРасчетныйПериод * Данные.КоличествоДнейОтпуска);
			
			Обработки.ОбщиеФормыСЭДОФСС.НапечататьОтпускНаПериодЛечения(КонтекстПечати, Данные);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДолжностьПредставителяСФРПоКадровомуУчету(Запрос, ДанныеПечати)
	Отбор = Новый Структура("ДолжностьПредставителяСФР", Справочники.Должности.ПустаяСсылка());
	ОтветственныеБезДолжности = ДанныеПечати.НайтиСтроки(Отбор);
	Если ОтветственныеБезДолжности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	МассивОрганизаций = Новый Массив;
	Для Каждого СтрокаДанных Из ОтветственныеБезДолжности Цикл
		Если ЗначениеЗаполнено(СтрокаДанных.ПредставительСФР) И МассивОрганизаций.Найти(СтрокаДанных.Организация) = Неопределено Тогда
			МассивОрганизаций.Добавить(СтрокаДанных.Организация);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Организация Из МассивОрганизаций Цикл
		ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
		КадровыйУчет.СоздатьВТОсновныеСотрудникиФизическихЛицВПериодах(
			Запрос.МенеджерВременныхТаблиц, Истина, ГоловнаяОрганизация, "ВТФизлица", "ВТОсновныеСотрудники");
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОсновныеСотрудники.ФизическоеЛицо КАК ПредставительСФР,
		|	ВТОсновныеСотрудники.Должность КАК ДолжностьПредставителяСФР,
		|	ВТОсновныеСотрудники.Период КАК Период,
		|	ВТОсновныеСотрудники.Организация КАК Организация
		|ИЗ
		|	ВТОсновныеСотрудники КАК ВТОсновныеСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтветственныеЛица КАК ВТОтветственныеЛица
		|		ПО ВТОсновныеСотрудники.ФизическоеЛицо = ВТОтветственныеЛица.ПредставительСФР
		|			И ВТОсновныеСотрудники.Организация = ВТОтветственныеЛица.Организация
		|			И ВТОсновныеСотрудники.Период = ВТОтветственныеЛица.Период
		|ГДЕ
		|	ВТОтветственныеЛица.ДолжностьПредставителяСФР = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)";
		Выборка = Запрос.Выполнить().Выбрать();
		Отбор = Новый Структура("Период,Организация,ПредставительСФР");
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отбор, Выборка);
			Для Каждого СтрокДанных Из ДанныеПечати.НайтиСтроки(Отбор) Цикл
				СтрокДанных.ДолжностьПредставителяСФР = Выборка.ДолжностьПредставителяСФР;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

Функция РабочиеПериодыДляОтпусков(Объект)
	
	РабочиеПериодыДляОтпусков = Новый Соответствие;
	Если Объект.ПредоставитьОсновнойОтпуск Или Объект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		РабочиеПериодыДляОтпусков.Вставить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), 
		Новый Структура("РабочийПериодС, РабочийПериодПо", Объект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск, Объект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск));
	КонецЕсли;
	
	Если Объект.ПредоставитьДополнительныйОтпуск Тогда  
		Для каждого ДополнительныйОтпуск Из Объект.ДополнительныеОтпуска Цикл
			РабочиеПериодыДляОтпусков.Вставить(ДополнительныйОтпуск.ВидОтпуска, 
			Новый Структура("РабочийПериодС, РабочийПериодПо", ДополнительныйОтпуск.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск, ДополнительныйОтпуск.КонецПериодаЗаКоторыйПредоставляетсяОтпуск));
		КонецЦикла;
	КонецЕсли;
	
	Возврат РабочиеПериодыДляОтпусков;
	
КонецФункции

Функция ОснованияДляОтпусков(Объект)
	
	ОснованияДляОтпусков = Новый Соответствие;
	Если Объект.ПредоставитьОсновнойОтпуск Или Объект.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		ОснованияДляОтпусков.Вставить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), Объект.Основание);
	КонецЕсли;
	
	Если Объект.ПредоставитьДополнительныйОтпуск Тогда  
		Для каждого ДополнительныйОтпуск Из Объект.ДополнительныеОтпуска Цикл
			ОснованияДляОтпусков.Вставить(ДополнительныйОтпуск.ВидОтпуска, ДополнительныйОтпуск.Основание);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОснованияДляОтпусков;
	
КонецФункции

Процедура ЗаполнитьСведенияОПособиях(РеквизитыДляПроведения, ДанныеДляПроведения)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНачислений.Ссылка,
	|	ТаблицаНачислений.Начисление,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидЗанятости КАК ВидЗанятости,
	|	ЛОЖЬ КАК Сторно,
	|	ТаблицаНачислений.ОплаченоДней,
	|	ТаблицаНачислений.Результат,
	|	0 КАК РезультатВТомЧислеЗаСчетФБ
	|ПОМЕСТИТЬ ВТНачисленияДляУчетаПособий
	|ИЗ
	|	Документ.Отпуск.Начисления КАК ТаблицаНачислений
	|ГДЕ
	|	ТаблицаНачислений.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаНачислений.Сторно
	|			ТОГДА ТаблицаНачислений.СторнируемыйДокумент
	|		ИНАЧЕ ТаблицаНачислений.Ссылка
	|	КОНЕЦ,
	|	ТаблицаНачислений.Начисление,
	|	ТаблицаНачислений.Сотрудник,
	|	ТаблицаНачислений.ВидЗанятости,
	|	ТаблицаНачислений.Сторно,
	|	ТаблицаНачислений.ОплаченоДней,
	|	ТаблицаНачислений.Результат,
	|	0
	|ИЗ
	|	Документ.Отпуск.НачисленияПерерасчет КАК ТаблицаНачислений
	|ГДЕ
	|	ТаблицаНачислений.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", РеквизитыДляПроведения.Ссылка);
	
	Запрос.Выполнить();
	
	ПособиеПлатитУчастникПилотногоПроекта = ПрямыеВыплатыПособийСоциальногоСтрахования.ПособиеПлатитУчастникПилотногоПроекта(РеквизитыДляПроведения.Организация, РеквизитыДляПроведения.ПериодРегистрации);

	УчетПособийСоциальногоСтрахованияРасширенный.ЗаполнитьСведенияОПособиях(ДанныеДляПроведения, ПособиеПлатитУчастникПилотногоПроекта);

КонецПроцедуры

Процедура ЗаполнитьИсходныеДанныеДокумента(Документ, ДанныеНовогоДокумента)
	Документ.ПериодРегистрации = ДанныеНовогоДокумента.ПериодРегистрации;
	Документ.Дата = ДанныеНовогоДокумента.Дата;
	Документ.Организация = ДанныеНовогоДокумента.Организация;
	Документ.ПланируемаяДатаВыплаты = ДанныеНовогоДокумента.Выплата.ПланируемаяДатаВыплаты;
	Документ.ПорядокВыплаты = ДанныеНовогоДокумента.Выплата.ПорядокВыплаты;
	Документ.Сотрудник = ДанныеНовогоДокумента.Сотрудник;
	Документ.ОсвобождатьСтавку = ДанныеНовогоДокумента.ОсвобождатьСтавку;
	Если ЗначениеЗаполнено(ДанныеНовогоДокумента.ВидРасчетаЕдиновременнойВыплатыКОтпуску) Тогда
		Документ.ПредоставитьЕдиновременнуюВыплатуКОтпуску = Истина;
		Документ.ВидРасчетаЕдиновременнойВыплатыКОтпуску = ДанныеНовогоДокумента.ВидРасчетаЕдиновременнойВыплатыКОтпуску;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеНовогоДокумента.ВидРасчетаМатериальнойПомощиПриОтпуске) Тогда
		Документ.ПредоставитьМатериальнуюПомощьПриОтпуске = Истина;
		Документ.ВидРасчетаМатериальнойПомощиПриОтпуске = ДанныеНовогоДокумента.ВидРасчетаМатериальнойПомощиПриОтпуске;
	КонецЕсли;
	Документ.УчитыватьМРОТПриОплатеПоСреднемуЗаработку = ДанныеНовогоДокумента.ПараметрыРасчета.УчитыватьМРОТПриОплатеПоСреднемуЗаработку;
	Документ.ДоначислитьЗарплатуПриНеобходимости = ДанныеНовогоДокумента.ПараметрыРасчета.ДоначислитьЗарплатуПриНеобходимости;
	Документ.РассчитатьЗарплату = ДанныеНовогоДокумента.ПараметрыРасчета.РассчитатьЗарплату;
	Документ.РасчетДенежногоСодержания = ДанныеНовогоДокумента.ПараметрыРасчета.РасчетДенежногоСодержания;
	Документ.ДоходПолученНаТерриторииРФ = ДанныеНовогоДокумента.ПараметрыРасчета.ДоходПолученНаТерриторииРФ;
	
	Если ЗначениеЗаполнено(ДанныеНовогоДокумента.ОсновнойОтпуск.ВидРасчета) Тогда
		Документ.ПредоставитьОсновнойОтпуск = Истина;
		Документ.ВидРасчетаОсновногоОтпуска = ДанныеНовогоДокумента.ОсновнойОтпуск.ВидРасчета;
		Документ.ДатаНачалаОсновногоОтпуска = ДанныеНовогоДокумента.ОсновнойОтпуск.ДатаНачала;
		Документ.ДатаОкончанияОсновногоОтпуска = ДанныеНовогоДокумента.ОсновнойОтпуск.ДатаОкончания;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНовогоДокумента.КомпенсацияОтпуска.ВидРасчета) Тогда
		Документ.ПредоставитьКомпенсациюОсновногоОтпуска= Истина;
		Документ.ВидРасчетаКомпенсацииОсновногоОтпуска = ДанныеНовогоДокумента.КомпенсацияОтпуска.ВидРасчета;
		Документ.КоличествоДнейКомпенсацииОсновногоОтпуска = ДанныеНовогоДокумента.КомпенсацияОтпуска.КоличествоДней;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеНовогоДокумента.Отгул.КоличествоДней) Тогда
		Документ.ПредоставитьОтгул = Истина;
		Документ.КоличествоДнейОтгула = ДанныеНовогоДокумента.Отгул.КоличествоДней;
		Документ.РасходДнейОтгула = ДанныеНовогоДокумента.Отгул.РасходДней;
		Документ.РасходЧасовОтгула = ДанныеНовогоДокумента.Отгул.РасходЧасов;
	КонецЕсли;

	Документ.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеНовогоДокумента.ПериодЗаКоторыйПредоставляетсяОтпуск.Начало;
	Документ.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеНовогоДокумента.ПериодЗаКоторыйПредоставляетсяОтпуск.Окончание;
	
	Для Каждого ДанныеДополнительногоОтпуска Из ДанныеНовогоДокумента.ДополнительныеОтпуска Цикл
		СтрокаДокумента = Документ.ДополнительныеОтпуска.Добавить();
		СтрокаДокумента.ВидОтпуска = ДанныеДополнительногоОтпуска.ВидОтпуска;
		СтрокаДокумента.ВидРасчета = ДанныеДополнительногоОтпуска.ВидРасчета;
		СтрокаДокумента.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеДополнительногоОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск;
		СтрокаДокумента.КонецПериодаЗаКоторыйПредоставляетсяОтпуск = ДанныеДополнительногоОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск;
		СтрокаДокумента.ДатаНачала = ДанныеДополнительногоОтпуска.ДатаНачала;
		СтрокаДокумента.ДатаОкончания = ДанныеДополнительногоОтпуска.ДатаОкончания;
		СтрокаДокумента.ВидРасчетаКомпенсации = ДанныеДополнительногоОтпуска.ВидРасчетаКомпенсации;
		СтрокаДокумента.КоличествоДнейКомпенсации = ДанныеДополнительногоОтпуска.КоличествоДнейКомпенсации;	
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьКоличествоДнейДополнительныхОтпусков(Объект, ОтпускВРабочихДняхПоДоговору)
	Для Каждого СтрокаОтпуска Из Объект.ДополнительныеОтпуска Цикл
		ОписаниеВидаОтпуска = ОстаткиОтпусков.ОписаниеВидаОтпуска(СтрокаОтпуска.ВидОтпуска, ОтпускВРабочихДняхПоДоговору);
		СтрокаОтпуска.КоличествоДней = УчетРабочегоВремениРасширенный.ДлительностьИнтервала(
			Объект.Сотрудник, 
			СтрокаОтпуска.ДатаНачала, 
			СтрокаОтпуска.ДатаОкончания, 
			ОписаниеВидаОтпуска.СпособРасчетаПоКалендарнымДням, 
			ОписаниеВидаОтпуска.ЕжегодныйОтпуск);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
