
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = РегламентированнаяОтчетность.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.СкрытьЭлементыФормыПриИспользованииОднойОрганизации(
			ЭтаФорма, "Организация");
	КонецЕсли;
		
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("НомерДоверенности", 	НомерДоверенности);
	СтруктураДанных.Вставить("Организация", 		Организация);
	
	Закрыть(СтруктураДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(НомерДоверенности) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан номер доверенности.'"),,
			"НомерДоверенности",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задана организация.'"),,
			"Организация",, Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере_85()

	Если ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85() Тогда
		ОтключитьВидимостьЭлементов_85();
		ВключитьЗаголовкиЭлементовСверху_85();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьЭлементов_85()
	
	СтрокаИменЭлементов = "ДекорацияРазделитель";
	
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, " ", "");
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, Символы.ПС, "");

	СписокЭлементов = СтрРазделить(СтрокаИменЭлементов, ",");
	
	Для каждого Эл из СписокЭлементов Цикл
		Если НЕ Элементы.Найти(Эл) = Неопределено Тогда
			Элементы[Эл].Видимость= Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьЗаголовкиЭлементовСверху_85()
	
	СтрокаИменЭлементов = "НомерДоверенности, Организация";
	
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, " ", "");
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, Символы.ПС, "");
	
	СписокЭлементов = СтрРазделить(СтрокаИменЭлементов, ",");
	
	Для каждого Эл из СписокЭлементов Цикл
		Если НЕ Элементы.Найти(Эл) = Неопределено Тогда
			Элементы[Эл].ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
