#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("СохранитьНастройкиШаблонаАнкеты", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует печатную форму бланка анкеты кандидата
//
// Параметры:
//   ШаблонАнкеты - СправочникСсылка.ШаблоныАнкет - шаблон анкеты, по которому формируется печатная форма.
//
// Возвращаемое значение:
//   ТабличныйДокумент - печатная форма бланка анкеты кандидата.
//
Функция ПечатьАнкеты(ШаблонАнкеты) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ШаблонАнкеты = Справочники.ШаблоныАнкет.ПустаяСсылка() Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	ДанныеШаблона = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШаблонАнкеты, 
		"Наименование, Вступление, Заключение");
	Макет = ПолучитьОбщийМакет("БланкАнкетыЭлектронногоИнтервью");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ИмяШаблона = ДанныеШаблона.Наименование;
	ТабличныйДокумент.Вывести(Шапка);
	Если ЗначениеЗаполнено(ДанныеШаблона.Вступление) Тогда
		Вступление = Макет.ПолучитьОбласть("Вступление");
		Вступление.Параметры.Вступление = ДанныеШаблона.Вступление;
		ТабличныйДокумент.Вывести(Вступление);
	КонецЕсли;
	
	Результат = ДанныеВопросовШаблонаАнкеты(ШаблонАнкеты);
	Если Результат.Пустой() Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Если Выборка.Количество() > 0 Тогда
		ДобавитьСтрокиДереваАнкеты(Выборка, Макет, ТабличныйДокумент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеШаблона.Заключение) Тогда
		Заключение = Макет.ПолучитьОбласть("Заключение");
		Заключение.Параметры.Заключение = ДанныеШаблона.Заключение;
		ТабличныйДокумент.Вывести(Заключение);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура-обработчик подписки РассчитатьХарактеристикиКандидатов.
// Рассчитывает характеристики физических лиц по данным набора записей регистра ответов на вопросы анкет.
//
Процедура РассчитатьХарактеристикиКандидатов(НаборЗаписейРегистра, Отказ, Замещение) Экспорт
	
	ИспользоватьЭлектронноеИнтервью = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью");
	Если Не ИспользоватьЭлектронноеИнтервью Тогда
		Возврат;
	КонецЕсли;
	
	Анкеты = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписейРегистра, Замещение, "Регистратор");
	Если Анкеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПараметровОтбора = Новый Запрос;
	ЗапросПараметровОтбора.Текст =
		"ВЫБРАТЬ
		|	АнкетыКандидатов.Анкета КАК Анкета,
		|	АнкетыКандидатов.Вакансия КАК Вакансия,
		|	АнкетыКандидатов.Кандидат КАК Кандидат,
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом КАК Этап
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|ГДЕ
		|	АнкетыКандидатов.Анкета В(&Анкеты)";
	ЗапросПараметровОтбора.УстановитьПараметр("Анкеты", Анкеты);
	РезультатЗапросаПараметровОтбора = ЗапросПараметровОтбора.Выполнить();
	Если РезультатЗапросаПараметровОтбора.Пустой() Тогда
		Возврат;
	КонецЕсли;
	ВыборкаПараметровОтбора = РезультатЗапросаПараметровОтбора.Выбрать();
	Пока ВыборкаПараметровОтбора.Следующий() Цикл
		ОбработатьВыборкуПараметровОтбора(НаборЗаписейРегистра, Замещение, ВыборкаПараметровОтбора);
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьВыборкуПараметровОтбора(НаборЗаписейРегистра, Замещение, ВыборкаПараметровОтбора)
	ОтборАнкета = ВыборкаПараметровОтбора.Анкета;
	ОтборВакансия = ВыборкаПараметровОтбора.Вакансия;
	ОтборЛичныеДанныеКандидата = ВыборкаПараметровОтбора.ЛичныеДанныеКандидата;
	Кандидат = ВыборкаПараметровОтбора.Кандидат;
	ЭтапРаботы = ВыборкаПараметровОтбора.Этап;
	
	НаборХарактеристик = РегистрыСведений.ХарактеристикиФизическихЛиц.СоздатьНаборЗаписей();
	НаборХарактеристик.Отбор.Вакансия.Установить(ОтборВакансия);
	НаборХарактеристик.Отбор.ФизическоеЛицо.Установить(ОтборЛичныеДанныеКандидата);
	НаборХарактеристик.Отбор.Этап.Установить(ЭтапРаботы);
	НаборХарактеристик.Прочитать();
	
	МассивСтарыхЗаписей = Новый Массив;
	Для Каждого ТекущаяЗапись Из НаборХарактеристик Цикл
		Если ТекущаяЗапись.Этап = ЭтапРаботы Тогда
			МассивСтарыхЗаписей.Добавить(ТекущаяЗапись);
		КонецЕсли;
	КонецЦикла;
	Для Каждого УстаревшаяЗапись Из МассивСтарыхЗаписей Цикл
		НаборХарактеристик.Удалить(УстаревшаяЗапись);
	КонецЦикла;
	
	Если НаборЗаписейРегистра.Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		НаборХарактеристик.Записать();
		Кандидаты = Новый Массив;
		Кандидаты.Добавить(Кандидат);
		РассчитатьОценкиКандидатов(ОтборВакансия, Кандидаты);
		Возврат;
	КонецЕсли;
	
	Вопрос = Неопределено;
	Родитель = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию("Служебные вопросы", Истина,
		ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка());
	Если ЗначениеЗаполнено(Родитель) Тогда
		Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию("Отказался отвечать", Истина,
			Родитель);
	КонецЕсли;
	
	Фильтр = Новый Структура("Регистратор", ОтборАнкета);
	Ответы = РасширеннаяТаблицаОтветов(НаборЗаписейРегистра.Выгрузить().Скопировать(Фильтр));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ответы", Ответы);
	Запрос.УстановитьПараметр("ВопросОтказалсяОтвечать", Вопрос);
	Запрос.УстановитьПараметр("Расшифровка", Ложь);
	Запрос.Текст = ТекстЗапросаПоБаллам();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = НаборХарактеристик.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.ФизическоеЛицо = Выборка.ЛичныеДанныеКандидата;
		НоваяЗапись.СпособОценкиХарактеристик = Перечисления.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью;
		НоваяЗапись.Период = ОтборАнкета.Дата;
		НоваяЗапись.Этап = ЭтапРаботы
	КонецЦикла;
	НаборХарактеристик.Записать();
	
	Кандидаты = Новый Массив;
	Кандидаты.Добавить(Кандидат);
	РассчитатьОценкиКандидатов(ОтборВакансия, Кандидаты);
	
КонецПроцедуры

// Процедура-обработчик подписки ЗавершитьЭтапРаботыСКандидатомПриПроведенииАнкеты.
// Завершает этап работы с кандидатом при проведении анкеты по этому этапу.
//
Процедура ЗавершитьЭтапРаботыСКандидатом(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АнкетыКандидатов.Вакансия,
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом,
		|	АнкетыКандидатов.Кандидат,
		|	РаботаСКандидатами.Бронь КАК Бронь,
		|	РаботаСКандидатами.Период
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|		ПО АнкетыКандидатов.Кандидат = РаботаСКандидатами.Кандидат
		|			И АнкетыКандидатов.ЭтапРаботыСКандидатом = РаботаСКандидатами.ЭтапРаботы
		|ГДЕ
		|	АнкетыКандидатов.Анкета = &Анкета";
	Запрос.УстановитьПараметр("Анкета", Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПараметрыДанных = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
		ПараметрыДанных.ЭтапыРаботыСКандидатами = Истина;
		ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Выборка.Вакансия, ПараметрыДанных);
		СтрокаЭтапаВакансии = Неопределено;
		Для Каждого Строка Из ДанныеВакансии.ЭтапыРаботыСКандидатами Цикл
			Если Строка.ЭтапРаботы = Выборка.ЭтапРаботыСКандидатом Тогда
				СтрокаЭтапаВакансии = Строка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		ОписаниеЭтапа = ПодборПерсоналаКлиентСервер.ОписаниеЭтапаРаботыСКандидатом();
		ОписаниеЭтапа.Этап = Выборка.ЭтапРаботыСКандидатом;
		ОписаниеЭтапа.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден;
		ОписаниеЭтапа.Период = ТекущаяДатаСеанса();
		Если СтрокаЭтапаВакансии <> Неопределено Тогда
			ОписаниеЭтапа.Комментарий = СтрокаЭтапаВакансии.Комментарий;
			ОписаниеЭтапа.ШаблонАнкеты = СтрокаЭтапаВакансии.ШаблонАнкеты;
		КонецЕсли;
		ПрежниеДанныеЭтапа = Справочники.ЭтапыРаботыСКандидатами.СтруктураДанныхПланированияЭтапа();
		ЗаполнитьЗначенияСвойств(ПрежниеДанныеЭтапа, Выборка);
		ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидата(Выборка.Кандидат, ОписаниеЭтапа, ПрежниеДанныеЭтапа);
	КонецЦикла;
	
КонецПроцедуры

// Формирует дерево расшифровки характеристик кандидата по ответам на вопросы анкет
//
// Параметры:
//   Вакансия - СправочникСсылка.Вакансии - вакансия для расшифровки.
//   ЛичныеДанныеКандидатов - СписокЗначений - личные данные кандидатов для расшифровки.
//   ХарактеристикаПерсонала - ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала - характеристика персонала для расшифровки.
//   ЗначениеХарактеристики - СправочникСсылка.ЗначенияХарактеристикПерсонала - значение характеристики персонала для расшифровки.
//
// ВозвращаемоеЗначение:
//   ДеревоЗначений - результат расшифровки характеристики кандидата по ответам на вопросы анкет.
//
Функция РасшифровкаХарактеристикПоОтветам(Вакансия, ЛичныеДанныеКандидатов, ХарактеристикаПерсонала,
	ЗначениеХарактеристики, ОтветыЭлектронногоТеста = Неопределено) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветыНаВопросыАнкет.Анкета КАК Анкета,
		|	ОтветыНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ОтветыНаВопросыАнкет.НомерЯчейки КАК НомерЯчейки,
		|	ОтветыНаВопросыАнкет.Ответ КАК Ответ,
		|	ОтветыНаВопросыАнкет.ОткрытыйОтвет КАК ОткрытыйОтвет
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
		|		ПО АнкетыКандидатов.Анкета = ОтветыНаВопросыАнкет.Анкета
		|ГДЕ
		|	(АнкетыКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов))
		|	И АнкетыКандидатов.Вакансия = &Вакансия";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Вопрос = Неопределено;
	Родитель = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию("Служебные вопросы", Истина,
		ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка());
	Если ЗначениеЗаполнено(Родитель) Тогда
		Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию("Отказался отвечать", Истина,
			Родитель);
	КонецЕсли;
	
	Ответы = РасширеннаяТаблицаОтветов(РезультатЗапроса.Выгрузить());
	Если ОтветыЭлектронногоТеста = Неопределено Тогда
		ОтветыЭлектронногоТеста = ЭлектронноеТестированиеКандидатов.ТаблицаОтветовТеста(Вакансия, ЛичныеДанныеКандидатов);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ХарактеристикаПерсонала", ХарактеристикаПерсонала);
	Запрос.УстановитьПараметр("ЗначениеХарактеристики", ЗначениеХарактеристики);
	Запрос.УстановитьПараметр("Ответы", Ответы);
	Запрос.УстановитьПараметр("ВопросОтказалсяОтвечать", Вопрос);
	Запрос.УстановитьПараметр("Расшифровка", Истина);
	Запрос.УстановитьПараметр("ОтветыЭлектронногоТеста", ОтветыЭлектронногоТеста);
	Запрос.Текст = ТекстЗапросаПоВсемСпособамОценки();
	
	Запрос.Текст = Запрос.Текст + ";" +
		"ВЫБРАТЬ
		|	ВопросыДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	МАКСИМУМ(ВопросыДляСобеседования.ВопросШаблонаАнкетыЭлементарныйВопрос) КАК ВопросШаблонаАнкетыЭлементарныйВопрос,
		|	МАКСИМУМ(ВопросыДляСобеседования.ЭлементарныйВопрос) КАК ЭлементарныйВопрос,
		|	МАКСИМУМ(ВопросыДляСобеседования.Вопрос) КАК Вопрос
		|ПОМЕСТИТЬ ВТСписокВопросов
		|ИЗ
		|	ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|ГДЕ
		|	НЕ ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВопросыДляСобеседования.ВопросДляСобеседования
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВопросыДляСобеседования.ВопросДляСобеседования,
		|	ВопросыДляСобеседования.ВопросШаблонаАнкетыЭлементарныйВопрос,
		|	ВопросыДляСобеседования.ЭлементарныйВопрос,
		|	МАКСИМУМ(ВопросыДляСобеседования.Вопрос)
		|ИЗ
		|	ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|ГДЕ
		|	ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВопросыДляСобеседования.ВопросДляСобеседования,
		|	ВопросыДляСобеседования.ВопросШаблонаАнкетыЭлементарныйВопрос,
		|	ВопросыДляСобеседования.ЭлементарныйВопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветыЭлектронногоТеста.Объект КАК Объект,
		|	ОтветыЭлектронногоТеста.ЭлектронныйКурс КАК ЭлектронныйКурс,
		|	ОтветыЭлектронногоТеста.Вакансия КАК Вакансия,
		|	ОтветыЭлектронногоТеста.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОтветыЭлектронногоТеста.Вопрос КАК Вопрос,
		|	ОтветыЭлектронногоТеста.ВариантОтвета КАК ВариантОтвета,
		|	ОтветыЭлектронногоТеста.Выбран КАК Выбран,
		|	ОтветыЭлектронногоТеста.ЭтапРаботы КАК ЭтапРаботы
		|ПОМЕСТИТЬ ВТТестовыеВопросы
		|ИЗ
		|	&ОтветыЭлектронногоТеста КАК ОтветыЭлектронногоТеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МаксимальныеБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	МаксимальныеБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	МаксимальныеБаллы.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	СписокВопросов.Вопрос КАК Вопрос,
		|	МаксимальныеБаллы.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ЕСТЬNULL(ВТВопросыДляСобеседования.Ответ, """") КАК Ответ,
		|	ЕСТЬNULL(ОтветыСБаллами.Балл, 0) КАК Балл,
		|	МаксимальныеБаллы.Балл КАК МаксимальныйБалл
		|ПОМЕСТИТЬ ВТРасшифровкаБаллов
		|ИЗ
		|	ВТМаксимальныеБаллы КАК МаксимальныеБаллы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАктуальныеАнкеты КАК ВТАктуальныеАнкеты
		|		ПО МаксимальныеБаллы.Вакансия = ВТАктуальныеАнкеты.Вакансия
		|			И МаксимальныеБаллы.ЛичныеДанныеКандидата = ВТАктуальныеАнкеты.ЛичныеДанныеКандидата
		|			И МаксимальныеБаллы.ХарактеристикаПерсонала = ВТАктуальныеАнкеты.ХарактеристикаПерсонала
		|			И МаксимальныеБаллы.ЗначениеХарактеристики = ВТАктуальныеАнкеты.ЗначениеХарактеристики
		|			И МаксимальныеБаллы.Анкета = ВТАктуальныеАнкеты.Анкета
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокВопросов КАК СписокВопросов
		|		ПО (ВЫБОР
		|				КОГДА МаксимальныеБаллы.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|					ТОГДА СписокВопросов.ВопросДляСобеседования ЕСТЬ NULL
		|							И МаксимальныеБаллы.ЭлементарныйВопрос = СписокВопросов.ВопросШаблонаАнкетыЭлементарныйВопрос
		|				ИНАЧЕ МаксимальныеБаллы.ВопросДляСобеседования = СписокВопросов.ВопросДляСобеседования
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВопросыДляСобеседования КАК ВТВопросыДляСобеседования
		|		ПО МаксимальныеБаллы.Вакансия = ВТВопросыДляСобеседования.Вакансия
		|			И МаксимальныеБаллы.ЛичныеДанныеКандидата = ВТВопросыДляСобеседования.Кандидат.ЛичныеДанные
		|			И (МаксимальныеБаллы.ВопросДляСобеседования = ВТВопросыДляСобеседования.ВопросДляСобеседования
		|				ИЛИ МаксимальныеБаллы.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|					И ВТВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL)
		|			И МаксимальныеБаллы.ЭлементарныйВопрос = ВТВопросыДляСобеседования.ЭлементарныйВопрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветыСБаллами КАК ОтветыСБаллами
		|		ПО МаксимальныеБаллы.Вакансия = ОтветыСБаллами.Вакансия
		|			И МаксимальныеБаллы.ЛичныеДанныеКандидата = ОтветыСБаллами.ЛичныеДанныеКандидата
		|			И МаксимальныеБаллы.ХарактеристикаПерсонала = ОтветыСБаллами.ХарактеристикаПерсонала
		|			И МаксимальныеБаллы.ЗначениеХарактеристики = ОтветыСБаллами.ЗначениеХарактеристики
		|			И (МаксимальныеБаллы.ВопросДляСобеседования = ОтветыСБаллами.ВопросДляСобеседования
		|				ИЛИ МаксимальныеБаллы.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|					И ОтветыСБаллами.ВопросДляСобеседования ЕСТЬ NULL)
		|			И МаксимальныеБаллы.ЭлементарныйВопрос = ОтветыСБаллами.ЭлементарныйВопрос
		|ГДЕ
		|	(МаксимальныеБаллы.ХарактеристикаПерсонала = &ХарактеристикаПерсонала
		|			ИЛИ &ХарактеристикаПерсонала = НЕОПРЕДЕЛЕНО)
		|	И (МаксимальныеБаллы.ЗначениеХарактеристики = &ЗначениеХарактеристики
		|			ИЛИ &ЗначениеХарактеристики = НЕОПРЕДЕЛЕНО)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТТестовыеВопросы.ЛичныеДанныеКандидата,
		|	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики,
		|	NULL,
		|	ВТТестовыеВопросы.Вопрос,
		|	NULL,
		|	ВТТестовыеВопросы.ВариантОтвета,
		|	ВЫБОР
		|		КОГДА ВТТестовыеВопросы.Выбран
		|			ТОГДА НастройкаВопросовДляЭлектронногоТестирования.Балл
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	НастройкаВопросовДляЭлектронногоТестирования.Балл
		|ИЗ
		|	ВТТестовыеВопросы КАК ВТТестовыеВопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК НастройкаВопросовДляЭлектронногоТестирования
		|		ПО ВТТестовыеВопросы.Объект = НастройкаВопросовДляЭлектронногоТестирования.Объект
		|			И ВТТестовыеВопросы.ЭлектронныйКурс = НастройкаВопросовДляЭлектронногоТестирования.ЭлектронныйКурс
		|			И ВТТестовыеВопросы.ВариантОтвета = НастройкаВопросовДляЭлектронногоТестирования.ВариантОтвета
		|ГДЕ
		|	(НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала = &ХарактеристикаПерсонала
		|			ИЛИ &ХарактеристикаПерсонала = НЕОПРЕДЕЛЕНО)
		|	И (НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики = &ЗначениеХарактеристики
		|			ИЛИ &ЗначениеХарактеристики = НЕОПРЕДЕЛЕНО
		|			ИЛИ &ЗначениеХарактеристики = ЗНАЧЕНИЕ(Справочник.ЗначенияХарактеристик.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасшифровкаБаллов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	РасшифровкаБаллов.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	РасшифровкаБаллов.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	РасшифровкаБаллов.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	РасшифровкаБаллов.Вопрос КАК Вопрос,
		|	РасшифровкаБаллов.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	РасшифровкаБаллов.Ответ КАК Ответ,
		|	РасшифровкаБаллов.Балл КАК Балл,
		|	РасшифровкаБаллов.МаксимальныйБалл КАК МаксимальныйБалл,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.МаксимальныйВесЗначения, 0) = 0
		|			ТОГДА ЕСТЬNULL(ВакансииХарактеристикиПерсонала.ВесЗначения, 0)
		|		ИНАЧЕ ЕСТЬNULL(ВакансииХарактеристикиПерсонала.ВесЗначения, 0) / ВложенныйЗапрос.МаксимальныйВесЗначения
		|	КОНЕЦ КАК Вес,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВложенныйЗапрос.МаксимальныйВесЗначения, 0) = 0
		|			ТОГДА ЕСТЬNULL(ВакансииХарактеристикиПерсонала.ВесЗначения, 0)
		|		ИНАЧЕ ЕСТЬNULL(ВакансииХарактеристикиПерсонала.ВесЗначения, 0) / ВложенныйЗапрос.МаксимальныйВесЗначения
		|	КОНЕЦ * ЕСТЬNULL(ИтоговыеЗначения.Балл, 0) КАК ИтоговыйБалл
		|ИЗ
		|	ВТРасшифровкаБаллов КАК РасшифровкаБаллов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вакансии.ХарактеристикиПерсонала КАК ВакансииХарактеристикиПерсонала
		|		ПО РасшифровкаБаллов.ХарактеристикаПерсонала = ВакансииХарактеристикиПерсонала.Характеристика
		|			И РасшифровкаБаллов.ЗначениеХарактеристики = ВакансииХарактеристикиПерсонала.Значение
		|			И (ВакансииХарактеристикиПерсонала.Ссылка = &Вакансия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтоговыеЗначения КАК ИтоговыеЗначения
		|		ПО РасшифровкаБаллов.ЛичныеДанныеКандидата = ИтоговыеЗначения.ЛичныеДанныеКандидата
		|			И РасшифровкаБаллов.ХарактеристикаПерсонала = ИтоговыеЗначения.ХарактеристикаПерсонала
		|			И РасшифровкаБаллов.ЗначениеХарактеристики = ИтоговыеЗначения.ЗначениеХарактеристики
		|			И (ИтоговыеЗначения.Вакансия = &Вакансия)
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВакансииХарактеристикиПерсонала.Ссылка КАК Ссылка,
		|			ВакансииХарактеристикиПерсонала.Характеристика КАК Характеристика,
		|			МАКСИМУМ(ВакансииХарактеристикиПерсонала.ВесЗначения) КАК МаксимальныйВесЗначения
		|		ИЗ
		|			Справочник.Вакансии.ХарактеристикиПерсонала КАК ВакансииХарактеристикиПерсонала
		|		ГДЕ
		|			ВакансииХарактеристикиПерсонала.Ссылка = &Вакансия
		|			И (ВакансииХарактеристикиПерсонала.Характеристика = &ХарактеристикаПерсонала
		|					ИЛИ &ХарактеристикаПерсонала = НЕОПРЕДЕЛЕНО)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВакансииХарактеристикиПерсонала.Ссылка,
		|			ВакансииХарактеристикиПерсонала.Характеристика) КАК ВложенныйЗапрос
		|		ПО РасшифровкаБаллов.ХарактеристикаПерсонала = ВложенныйЗапрос.Характеристика
		|ИТОГИ
		|	СУММА(Балл),
		|	СУММА(МаксимальныйБалл),
		|	МАКСИМУМ(Вес),
		|	МАКСИМУМ(ИтоговыйБалл)
		|ПО
		|	ЛичныеДанныеКандидата,
		|	ХарактеристикаПерсонала,
		|	ЗначениеХарактеристики,
		|	Вопрос,
		|	ЭлементарныйВопрос,
		|	Ответ";
	
	ДанныеРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Возврат ДанныеРезультат;
	
КонецФункции

// Формирует таблицу для отображения дерева в формах настроек вопросов
//
Процедура ЗаполнитьТаблицуДереваКритериевОценки(ДеревоРезультат, Ответы, СоздаватьНовыеОбъекты = Ложь, ЭлементарныйВопрос = Неопределено, ОтветНаВопрос = Неопределено, 
	ЭлементарныйВопросВопросаДляСобеседования = Неопределено, ОтветНаВопросВопросаДляСобеседования = Неопределено, СтарыеОтветы = Неопределено) Экспорт 
		
	Для Каждого СтрокаДерева Из ДеревоРезультат Цикл
		
		Уровень = СтрокаДерева.Уровень();
		
		Если Уровень = 2 
			И Не ЗначениеЗаполнено(СтрокаДерева.ОтветНаВопрос) Тогда
			Продолжить;
		КонецЕсли; 

		Если Уровень = 3 
			И Не ЗначениеЗаполнено(СтрокаДерева.Характеристика) 
			И Не ЗначениеЗаполнено(СтрокаДерева.Значение) 
			И Не ЗначениеЗаполнено(СтрокаДерева.Балл) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Уровень = 3 
			И СоздаватьНовыеОбъекты 
			И Не (ЗначениеЗаполнено(СтрокаДерева.Характеристика) 
			И ЗначениеЗаполнено(СтрокаДерева.Значение) 
			И ЗначениеЗаполнено(СтрокаДерева.Балл)) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Ответы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		Если СоздаватьНовыеОбъекты И (Уровень = 1 Или Уровень = 2) Тогда
			Если Уровень = 1 Тогда
				ИмяКолонки = "ЭлементарныйВопрос";
			ИначеЕсли Уровень = 2 Тогда 
				ИмяКолонки = "ОтветНаВопрос";
			КонецЕсли;
			СтрокаОбъект = НоваяСтрока[ИмяКолонки].ПолучитьОбъект();
			НовОбъект = СтрокаОбъект.Скопировать();
			НовОбъект.УстановитьНовыйКод();
			Если Уровень = 2 Тогда 
				НовОбъект.Владелец = ЭлементарныйВопрос;
			КонецЕсли;
			НовОбъект.Записать();
			НоваяСтрока[ИмяКолонки + "ВопросаДляСобеседования"] = НоваяСтрока[ИмяКолонки];
			НоваяСтрока[ИмяКолонки] = НовОбъект.Ссылка;
			Если Уровень = 1 Тогда
				ЭлементарныйВопрос = НовОбъект.Ссылка;
				ЭлементарныйВопросВопросаДляСобеседования = НоваяСтрока.ЭлементарныйВопросВопросаДляСобеседования;
			ИначеЕсли Уровень = 2 Тогда 
				НоваяСтрока.ЭлементарныйВопрос = ЭлементарныйВопрос;
				НоваяСтрока.ЭлементарныйВопросВопросаДляСобеседования = ЭлементарныйВопросВопросаДляСобеседования;
				ОтветНаВопрос = НоваяСтрока.ОтветНаВопрос;
				ОтветНаВопросВопросаДляСобеседования = НоваяСтрока.ОтветНаВопросВопросаДляСобеседования;
			КонецЕсли;
			
			Если СтарыеОтветы <> Неопределено И Уровень = 2 Тогда
				СтруктураВопросовДляСобеседования = Новый Структура;
				СтруктураВопросовДляСобеседования.Вставить("ЭлементарныйВопрос", СтрокаДерева.ЭлементарныйВопрос);
				СтруктураВопросовДляСобеседования.Вставить("ОтветНаВопрос", СтрокаДерева.ОтветНаВопрос);
				СтарыеОтветыСтроки = СтарыеОтветы.НайтиСтроки(СтруктураВопросовДляСобеседования);
				Если СтарыеОтветыСтроки.Количество() > 0 Тогда
					НоваяСтрока.СтарыйЭлементарныйВопрос = СтарыеОтветыСтроки[0].СтарыйЭлементарныйВопрос;
					НоваяСтрока.СтарыйОтветНаВопрос = СтарыеОтветыСтроки[0].СтарыйОтветНаВопрос;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Если СоздаватьНовыеОбъекты И Уровень = 3 Тогда
			НоваяСтрока.ЭлементарныйВопрос = ЭлементарныйВопрос;
			НоваяСтрока.ОтветНаВопрос = ОтветНаВопрос;
			НоваяСтрока.ЭлементарныйВопросВопросаДляСобеседования = ЭлементарныйВопросВопросаДляСобеседования;
			НоваяСтрока.ОтветНаВопросВопросаДляСобеседования = ОтветНаВопросВопросаДляСобеседования;
		КонецЕсли;
		
		Если Не СоздаватьНовыеОбъекты И НоваяСтрока.Свойство("ЭлементарныйВопросВопросаДляСобеседования") Тогда
			Если Уровень = 0 Тогда
				НоваяСтрока.ЭлементарныйВопросВопросаДляСобеседования = ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка();
				НоваяСтрока.ОтветНаВопросВопросаДляСобеседования = Справочники.ВариантыОтветовАнкет.ПустаяСсылка();
			ИначеЕсли Уровень = 1 Тогда
				НоваяСтрока.ОтветНаВопросВопросаДляСобеседования = Справочники.ВариантыОтветовАнкет.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;	
		
		НоваяСтрока.Уровень = СтрокаДерева.Уровень();
		Если СтрокаДерева.Строки.Количество() > 0 Тогда
			ЗаполнитьТаблицуДереваКритериевОценки(СтрокаДерева.Строки, Ответы, СоздаватьНовыеОбъекты, ЭлементарныйВопрос, ОтветНаВопрос, ЭлементарныйВопросВопросаДляСобеседования, ОтветНаВопросВопросаДляСобеседования, СтарыеОтветы);
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Установка оформления дерева критериев оценки
//
Процедура УстановитьОформлениеДереваКритериевОценки(Форма) Экспорт 
	
	ЭлементОформления = Форма.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	Отбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КритерииОценкиДерево.КоличествоКлючей");
	Отбор.ПравоеЗначение = 0;
	Отбор.Использование = Истина;
	
	Отбор = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КритерииОценкиДерево.Уровень");
	Отбор.ПравоеЗначение = 1;
	Отбор.Использование = Истина;
	
	ОформляемоеПоле =  ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КритерииОценкиДерево"); 
	ОформляемоеПоле.Использование = Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры

// Находит или создает вопрос для собеседования по наименованию из макета Библиотека.
//
// Параметры:
//   ВопросДляСобеседованияСтрокой - строка - наименование вопроса для собеседования.
//   БиблиотекаТаблица - ТаблицаЗначений - таблица из библиотеки Вопросов для собеседования.
//   БиблиотекаТаблицаКлючевыхВопросов - ТаблицаЗначений - таблица ключевых вопросов из библиотеки Вопросов для собеседования.
//   БиблиотекаОтветовТаблица - ТаблицаЗначений - таблица ответов из библиотеки Вопросов для собеседования.
//   БиблиотекаХарактеристикТаблица - ТаблицаЗначений - таблица характеристик персонала из библиотеки.
//
// ВозвращаемоеЗначение:
//   СправочникСсылка.ВопросыДляСобеседования - ссылка на вопрос.
//
Функция ВопросДляСобеседованияИзМакета(ВопросДляСобеседованияСтрокой, БиблиотекаТаблица, БиблиотекаТаблицаКлючевыхВопросов, БиблиотекаОтветовТаблица, БиблиотекаХарактеристикТаблица) Экспорт
	
	Если Не ЗначениеЗаполнено(ВопросДляСобеседованияСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВопросСсылка = Справочники.ВопросыДляСобеседования.НайтиПоНаименованию(ВопросДляСобеседованияСтрокой, Истина);
	Если ЗначениеЗаполнено(ВопросСсылка) Тогда
		Возврат ВопросСсылка;
	КонецЕсли;
		
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование", ВопросДляСобеседованияСтрокой);
	СтрокиКлючей = БиблиотекаТаблица.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиКлючей.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВопросДляСобеседования = Справочники.ВопросыДляСобеседования.СоздатьЭлемент();
	ВопросДляСобеседования.Наименование = ВопросДляСобеседованияСтрокой;
	ВопросДляСобеседования.ТипВопроса = Перечисления.ТипыВопросовПоМетодуСИвановой[СтрокиКлючей[0].ТипВопроса];
	ВопросДляСобеседования.Формулировка = СтрокиКлючей[0].Формулировка;
	ВопросДляСобеседования.Подсказка = СтрокиКлючей[0].Подсказка;
	ВопросДляСобеседования.СпособОтображенияПодсказки = Перечисления.СпособыОтображенияПодсказок[СтрокиКлючей[0].СпособОтображенияПодсказки];
	
	СтрокиВопросов = БиблиотекаТаблицаКлючевыхВопросов.НайтиСтроки(СтруктураПоиска);
	Для Каждого ТекущаяСтрока Из СтрокиВопросов Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЭлементарныйВопрос) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементарныйВопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
		ЭлементарныйВопрос.Наименование = ТекущаяСтрока.ЭлементарныйВопрос;
		ЭлементарныйВопрос.Формулировка = ТекущаяСтрока.ЭлементарныйВопрос;
		ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.ОдинВариантИз;
		ЭлементарныйВопрос.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовАнкет");
		ЭлементарныйВопрос.ВидПереключателя = Перечисления.ВидыПереключателяВАнкетах.Тумблер;
		ЭлементарныйВопрос.ТребуетсяКомментарий = ТекущаяСтрока.ТребуетсяКомментарий;
		ЭлементарныйВопрос.ПояснениеКомментария = ТекущаяСтрока.ПояснениеКомментария;
		ЭлементарныйВопрос.Записать();
		
		НоваяСтрокаВопросов = ВопросДляСобеседования.КлючевыеВопросы.Добавить();
		НоваяСтрокаВопросов.ЭлементарныйВопрос = ЭлементарныйВопрос.Ссылка;
		НоваяСтрокаВопросов.Предопределенный = ТекущаяСтрока.Предопределенный;
		
		МассивОтветов = Новый Массив;
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Вопрос", ВопросДляСобеседованияСтрокой);
		СтруктураПоиска.Вставить("ЭлементарныйВопрос", ТекущаяСтрока.ЭлементарныйВопрос);
		СтрокиОтветов = БиблиотекаОтветовТаблица.НайтиСтроки(СтруктураПоиска);
		Для Каждого ТекущийОтвет Из СтрокиОтветов Цикл
			Ответ = Справочники.ВариантыОтветовАнкет.СоздатьЭлемент();
			Ответ.Наименование = ТекущийОтвет.Ответ;
			Ответ.Владелец = ЭлементарныйВопрос.Ссылка;
			Ответ.Записать();
			МассивОтветов.Добавить(Ответ.Ссылка);
		КонецЦикла;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Наименование", ВопросДляСобеседованияСтрокой);
		СтруктураПоиска.Вставить("ЭлементарныйВопрос", ТекущаяСтрока.ЭлементарныйВопрос);
		СтрокиКлючей = БиблиотекаТаблица.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаКлючей Из СтрокиКлючей Цикл
			Если Не ЗначениеЗаполнено(СтрокаКлючей.ХарактеристикаПерсонала) Тогда
				Продолжить;
			КонецЕсли;
			СвойстваХарактеристики = Новый Структура("ИспользоватьЭлектронноеИнтервью", Истина);
			СтруктураХарактеристики = ХарактеристикиПерсонала.ХарактеристикаИзМакета(СтрокаКлючей.ХарактеристикаПерсонала, СтрокаКлючей.ЗначениеХарактеристики, БиблиотекаХарактеристикТаблица, СвойстваХарактеристики);
			Если СтруктураХарактеристики = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаТЧ = ВопросДляСобеседования.Ключи.Добавить();
			НоваяСтрокаТЧ.ЭлементарныйВопрос = ЭлементарныйВопрос.Ссылка;
			НоваяСтрокаТЧ.ОтветНаВопрос = ОтветНаВопрос(СтрокаКлючей.ОтветНаВопрос, МассивОтветов);
			НоваяСтрокаТЧ.ХарактеристикаПерсонала = СтруктураХарактеристики.Характеристика;
			НоваяСтрокаТЧ.ЗначениеХарактеристики = СтруктураХарактеристики.Значение;
			НоваяСтрокаТЧ.Балл = СтрокаКлючей.Балл;
		КонецЦикла;
	КонецЦикла;
	ВопросДляСобеседования.Записать();
	Возврат ВопросДляСобеседования.Ссылка;	
	
КонецФункции

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд.
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя        = "Анкетирование";
	Вид.ИмяПодменю = "ПодменюАнкетирование";	
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииСоставаНастроекПодключаемыхОбъектов.
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	
	Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
	Настройка.Ключ          = "ДобавитьПодключаемыеКоманды";
	Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
	Настройка.ВидыПодключаемыхОбъектов = "Обработка";	
	
КонецПроцедуры

// См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту.
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Если Источники.Строки.Найти(Метаданные.Документы.Анкета, "Метаданные") <> Неопределено Тогда
		Команда = Команды.Добавить();
		Команда.Вид = "Анкетирование";
		Команда.Представление = НСтр("ru = 'Мотивация'");
		Команда.РежимЗаписи = "НеЗаписывать";
		Команда.ВидимостьВФормах = "ФормаДокумента";
		Команда.Обработчик = "ЭлектронноеИнтервьюКлиент.ЗаполнитьМотивацию";
		Команда.ФункциональныеОпции = "ИспользоватьЭлектронноеИнтервью";
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(Команда, "РежимАнкетирования", Перечисления.РежимыАнкетирования.Интервью);
	КонецЕсли;	
	
КонецПроцедуры

// Копирует шаблоны анкет и настройки этапов вакансий и профилей должностей
//
// Параметры:
//   Объект - СправочникОбъект.Вакансии, СправочникОбъект.ПрофилиДолжностей - объект, для которого выполняется копирование.
//
Процедура СкопироватьНастройкиЭтапов(Объект, ИмяВладельца) Экспорт
	
	СоответствиеЗаписейНастроекВопросовДляСобеседования = Новый Соответствие;
	Для Каждого ТекущаяСтрока Из Объект.ЭтапыРаботыСКандидатами Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ШаблонАнкеты) Тогда
			Продолжить;
		КонецЕсли;
		НовыйЭлементСсылка = КопияШаблонаАнкеты(ТекущаяСтрока.ШаблонАнкеты, ТекущаяСтрока.ЭтапРаботы, СоответствиеЗаписейНастроекВопросовДляСобеседования, Объект.Наименование, ИмяВладельца);
		ТекущаяСтрока.ШаблонАнкеты = НовыйЭлементСсылка;
	КонецЦикла;
	СсылкаНового = Объект.ПолучитьСсылкуНового();
	Если СсылкаНового.Пустая() Тогда
		СсылкаНового = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ПолучитьСсылку();
	КонецЕсли;
	Для Каждого Соответствие Из СоответствиеЗаписейНастроекВопросовДляСобеседования Цикл
		ВопросДляСобеседования = Соответствие.Ключ;
		СтрокиНастройкаВопросовДляСобеседования = Соответствие.Значение;
		НаборЗаписей = РегистрыСведений.НастройкаВопросовДляСобеседования.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(СсылкаНового);
		Если ТипЗнч(ВопросДляСобеседования) = Тип("СправочникСсылка.ВопросыДляСобеседования") Тогда
			НаборЗаписей.Отбор.ВопросДляСобеседования.Установить(ВопросДляСобеседования);
		Иначе
			НаборЗаписей.Отбор.ВопросДляСобеседования.Установить(Справочники.ВопросыДляСобеседования.ПустаяСсылка());
			НаборЗаписей.Отбор.ЭлементарныйВопрос.Установить(ВопросДляСобеседования);
		КонецЕсли;
		Для каждого СтрокаТаблицы Из СтрокиНастройкаВопросовДляСобеседования Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
			НоваяЗапись.Объект = СсылкаНового;
			НоваяЗапись.Подразделение = Объект.Подразделение;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Проверяет необходимость создания новой характеристики из библиотеки
//
// Параметры:
//  Характеристика - Строка - наименование проверяемой характеристики персонала.
//  МассивХарактеристик - Массив - массив наименований характеристик персонала, которые будут создаваться в рамках
//                                 проверяемой операции.
//
Процедура ПроверитьНовуюХарактеристику(Характеристика, МассивХарактеристик) Экспорт
	
	ХарактеристикаСсылка = ПланыВидовХарактеристик.ХарактеристикиПерсонала.НайтиПоНаименованию(Характеристика, Истина);
	Если ЗначениеЗаполнено(ХарактеристикаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	БиблиотекаXML = ПланыВидовХарактеристик.ХарактеристикиПерсонала.ПолучитьМакет("Библиотека").ПолучитьТекст();
	БиблиотекаТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(БиблиотекаXML).Данные;
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Наименование", Характеристика);
	СтрокиХарактеристики = БиблиотекаТаблица.НайтиСтроки(СтруктураПоиска);
	Если СтрокиХарактеристики.Количество() > 0 Тогда
		МассивХарактеристик.Добавить(Характеристика);
	КонецЕсли;
	
КонецПроцедуры

// Создает табличный документ с расшифровкой характеристик по ответам
//
// Параметры:
//   Вакансия - СправочникСсылка.Вакансии - вакансия для расшифровки.
//   ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов - личные данные кандидата для расшифровки.
//   ХарактеристикаПерсонала - ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала - характеристика персонала для расшифровки.
//   ЗначениеХарактеристики - СправочникСсылка.ЗначенияХарактеристикПерсонала - значение характеристики персонала для расшифровки.
//
// ВозвращаемоеЗначение:
//   ТабличныйДокумент - табличный документ с расшифровкой.
Функция ТабличныйДокументРасшифровкиХарактеристикПоОтветам(Вакансия, ЛичныеДанныеКандидата, ХарактеристикаПерсонала,
	ЗначениеХарактеристики) Экспорт
	
	ТаблицаОтчета = Новый ТабличныйДокумент;
	
	ЛичныеДанныеКандидатов = Новый СписокЗначений;
	ЛичныеДанныеКандидатов.Добавить(ЛичныеДанныеКандидата);
	ОтветыЭлектронногоТеста = ЭлектронноеТестированиеКандидатов.ТаблицаОтветовТеста(Вакансия, ЛичныеДанныеКандидатов);
	ДеревоРасшифровки = РасшифровкаХарактеристикПоОтветам(Вакансия, ЛичныеДанныеКандидатов, ХарактеристикаПерсонала,
		ЗначениеХарактеристики, ОтветыЭлектронногоТеста);	
	ТаблицаОтветов = ТаблицаОтветов(Вакансия, ЛичныеДанныеКандидата);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "СоответствуетПрофилюДолжности") Тогда
		ОбъектОценки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "ПрофильДолжности");
	Иначе
		ОбъектОценки = Вакансия;
	КонецЕсли;
	
	Сч = 6;
	Макет = Обработки.СравнениеХарактеристикКандидатов.ПолучитьМакет("МакетРасшифровка");
	ПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ТаблицаОтчета.Вывести(ПустаяСтрока, 0);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	ТаблицаОтчета.НачатьГруппуСтрок("Шапка");
	Если ДеревоРасшифровки.Строки.Количество() > 0 И ДеревоРасшифровки.Строки[0].Строки.Количество() > 0 И ДеревоРасшифровки.Строки[0].Строки[0].Строки.Количество() > 0 Тогда
		СтрокаРасшифровки = ДеревоРасшифровки.Строки[0].Строки[0].Строки[0];
		ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаРасшифровки);
	КонецЕсли; 
	
	Область.Параметры.ПараметрыРасшифровки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Вакансия: %1
              |Личные данные кандидата: %2
              |Характеристика персонала: %3
              |Значение характеристики: %4'"),
		Вакансия,
		ЛичныеДанныеКандидата,
		ХарактеристикаПерсонала,
		ЗначениеХарактеристики);
	ТаблицаОтчета.Вывести(Область, 0);

	НомерВопроса = 1;
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	ТаблицаОтчета.Вывести(ПустаяСтрока, 0);
	
	Если ДеревоРасшифровки.Строки.Количество() = 0 Или ДеревоРасшифровки.Строки[0].Строки.Количество() = 0 Или ДеревоРасшифровки.Строки[0].Строки[0].Строки.Количество() = 0 Тогда
		Возврат ТаблицаОтчета;
	КонецЕсли;
	
	ТаблицаВопросовСобеседования = ТаблицаВопросовСобеседования(СтрокаРасшифровки);
	
	ТаблицаОтчета.НачатьАвтогруппировкуСтрок();
	
	Для Каждого ВеткаВопрос Из СтрокаРасшифровки.Строки Цикл
		
		ЭтоВопросЭлектронногоТеста = ?(ТипЗнч(ВеткаВопрос.Вопрос) = Тип("СправочникСсылка.ТестовыеВопросы"), Истина, Ложь);
		
		Область = Макет.ПолучитьОбласть("Вопрос");
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВеткаВопрос);
		Если ЭтоВопросЭлектронногоТеста Тогда
			Область.Параметры.ВопросФормулировка = СтрШаблон("%1.", НомерВопроса);
		Иначе
			Область.Параметры.ВопросФормулировка = СтрШаблон("%1. %2", НомерВопроса, ВеткаВопрос.Вопрос.Формулировка);
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ВопросШаблонаАнкеты", ВеткаВопрос.Вопрос);
		Массив = ТаблицаВопросовСобеседования.НайтиСтроки(СтруктураПоиска);
		ЭтоТриПлюсаТриМинуса = Ложь;
		Если Массив.Количество()>0 Тогда
			Область.Параметры.Вопрос = Массив[0].ВопросДляСобеседования;
			Если Массив[0].ТипВопросаПоМетодуСИвановой = Перечисления.ТипыВопросовПоМетодуСИвановой.ТриПлюсаТриМинуса Тогда
				ЭтоТриПлюсаТриМинуса = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
		НомерВопроса = НомерВопроса + 1;
		ТаблицаОтчета.Вывести(Область, 0);
		Сч = Сч + 1;
		
		Если ЭтоТриПлюсаТриМинуса Тогда
			
			Область = Макет.ПолучитьОбласть("ТриПлюсаТриМинуса");
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Вопрос", ВеткаВопрос.Вопрос);
			СтруктураПоиска.Вставить("ЭлементарныйВопросПредставление", "");
			СтруктураПоиска.ЭлементарныйВопросПредставление = "Плюсы";
			МассивПлюсы = ТаблицаОтветов.НайтиСтроки(СтруктураПоиска);
			Если МассивПлюсы.Количество()>0 Тогда
				Область.Параметры.Плюсы = МассивПлюсы[0].Ответ;
			КонецЕсли;
			СтруктураПоиска.ЭлементарныйВопросПредставление = "Минусы";
			МассивМинусы = ТаблицаОтветов.НайтиСтроки(СтруктураПоиска);
			Если МассивМинусы.Количество()>0 Тогда
				Область.Параметры.Минусы = МассивМинусы[0].Ответ;
			КонецЕсли;
			
			ТаблицаОтчета.Вывести(Область, 1);
			Сч = Сч + 2;
			
		КонецЕсли; 
			
		Для Каждого ВеткаЭлементарныйВопрос Из ВеткаВопрос.Строки Цикл
			
			ОбластьВопрос = Макет.ПолучитьОбласть("ЭлементарныйВопрос|КолонкиВопрос");
			Если ЭтоВопросЭлектронногоТеста Тогда
				
				ДанныеВопроса = Справочники.ТестовыеВопросы.ДанныеВопросов(ВеткаВопрос.Вопрос, Истина);
				ОбластьВопрос.Параметры.ЭлементарныйВопрос = ДанныеВопроса.Вопросы[0].Задание.ПолучитьТекст();
				ТаблицаОтчета.Вывести(ОбластьВопрос, 1);
				Сч = Сч + 1;
				
				ВариантыОтвета = ДанныеВопроса.Варианты;
				
				ПерваяСтрока = Истина;
				ТекущаяВысота = 0;
				Для Каждого ВариантОтвета Из ВариантыОтвета Цикл
					ДополнительнаяКолонка = ?(ПерваяСтрока, "|КолонкиОтвет", "");
					
					Отбор = Новый Структура();
					Отбор.Вставить("Вакансия", Вакансия);
					Отбор.Вставить("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);
					Отбор.Вставить("Вопрос", ВеткаВопрос.Вопрос);
					Отбор.Вставить("ВариантОтвета", ВариантОтвета.Ссылка);
					Вариант = ОтветыЭлектронногоТеста.НайтиСтроки(Отбор);
					
					Если Вариант[0].Выбран Тогда
						Область = Макет.ПолучитьОбласть("УказанныйОтвет" + ДополнительнаяКолонка);
					Иначе
						Область = Макет.ПолучитьОбласть("Ответ" + ДополнительнаяКолонка);
					КонецЕсли;
					Область.Параметры.Балл = ЭлектронноеТестированиеКандидатов.ПолученныйБаллПоОтветуТеста(
						ВариантОтвета.Ссылка, ХарактеристикаПерсонала, ЗначениеХарактеристики, ОбъектОценки);
					Область.Параметры.Ответ = ВариантОтвета.ТекстВарианта;
					Если ПерваяСтрока Тогда
						ТаблицаОтчета.Присоединить(Область);
						ПерваяСтрока = Ложь;
					Иначе
						ТаблицаОтчета.Вывести(Область);
						Сч = Сч + 1;
						ТекущаяВысота = ТекущаяВысота + 1;
					КонецЕсли; 
				КонецЦикла;
				
				Область = ТаблицаОтчета.Область(Сч-ТекущаяВысота, 1, Сч, 5);
				Область.Объединить();
				
			Иначе
				ЗаполнитьЗначенияСвойств(ОбластьВопрос.Параметры, ВеткаЭлементарныйВопрос);
				ТаблицаОтчета.Вывести(ОбластьВопрос, 1);
				Сч = Сч + 1;
				Выборка = ДанныеАнкеты(Вакансия, ВеткаЭлементарныйВопрос.ЭлементарныйВопрос, ХарактеристикаПерсонала,
					ЗначениеХарактеристики);
				
				ПерваяСтрока = Истина;
				ТекущаяВысота = 0;
				Пока Выборка.Следующий() Цикл
					ВеткаОтвет = ВеткаЭлементарныйВопрос.Строки.Найти(Выборка.Ответ);
					ДополнительнаяКолонка = ?(ПерваяСтрока, "|КолонкиОтвет", "");
					Если ВеткаОтвет<>Неопределено Тогда
						Область = Макет.ПолучитьОбласть("УказанныйОтвет" + ДополнительнаяКолонка);
						ЗаполнитьЗначенияСвойств(Область.Параметры, ВеткаОтвет);
					Иначе
						Область = Макет.ПолучитьОбласть("Ответ" + ДополнительнаяКолонка);
						ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка);
						Область.Параметры.Балл = Выборка.МаксимальныйБалл;
					КонецЕсли; 
					Если ПерваяСтрока Тогда
						ТаблицаОтчета.Присоединить(Область);
						ПерваяСтрока = Ложь;
					Иначе
						ТаблицаОтчета.Вывести(Область);
						Сч = Сч + 1;
						ТекущаяВысота = ТекущаяВысота + 1;
					КонецЕсли; 
				КонецЦикла;
				
				Область = ТаблицаОтчета.Область(Сч-ТекущаяВысота, 1, Сч, 5);
				Область.Объединить();
				 			
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Вопрос", ВеткаВопрос.Вопрос);
				СтруктураПоиска.Вставить("ЭлементарныйВопрос", ВеткаЭлементарныйВопрос.ЭлементарныйВопрос);
				МассивКомментариев = ТаблицаОтветов.НайтиСтроки(СтруктураПоиска);
				Если МассивКомментариев.Количество()>0 И СокрЛП(МассивКомментариев[0].ОткрытыйОтвет)<>"" Тогда
					Область = Макет.ПолучитьОбласть("Комментарий");
					Область.Параметры.Комментарий = МассивКомментариев[0].ОткрытыйОтвет;
					ТаблицаОтчета.Вывести(Область, 1);
					Сч = Сч + 1;
				КонецЕсли;
			КонецЕсли;
		
		КонецЦикла;
				
	КонецЦикла; 
	
	ТаблицаОтчета.ЗакончитьАвтогруппировкуСтрок();
			
	Область = Макет.ПолучитьОбласть("Итоги");
	ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаРасшифровки);
	ТаблицаОтчета.Вывести(Область);
	
	Возврат ТаблицаОтчета;
	
КонецФункции

// Создает табличный документ для подробного отчета по характеристикам
//
// Параметры:
//   ТаблицаОтчета - ТабличныйДокумент - табличный документ подробного отчета.
//   Вакансия - СправочникСсылка.Вакансии - вакансия для формирования отчета.
//   Кандидаты - СписокЗначений - кандидаты для формирования отчета.
//
Процедура ТабличныйДокументПодробногоОтчетаПоХарактеристикам(ТаблицаОтчета, Вакансия, Кандидаты) Экспорт
	
	ЛичныеДанныеКандидатов = Новый СписокЗначений;
	Если Кандидаты.Количество() > 0 Тогда
		ЛичныеДанныеКандидатовСоответствие = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты.ВыгрузитьЗначения(),
			"ЛичныеДанные");
		ЛичныеДанныеКандидатов.ЗагрузитьЗначения(
			ОбщегоНазначения.ВыгрузитьКолонку(ЛичныеДанныеКандидатовСоответствие, "Значение"));
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Кандидаты.ЛичныеДанные КАК ЛичныеДанныеКандидата
			|ИЗ
			|	Справочник.Кандидаты КАК Кандидаты
			|ГДЕ
			|	Кандидаты.Вакансия = &Вакансия
			|	И НЕ Кандидаты.ПометкаУдаления";
		Запрос.УстановитьПараметр("Вакансия", Вакансия);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЛичныеДанныеКандидатов.Добавить(Выборка.ЛичныеДанныеКандидата);
		КонецЦикла;
	КонецЕсли;
	
	ОценкиПоХарактеристикам = ОценкиКандидатовПоХарактеристикам(Вакансия, ЛичныеДанныеКандидатов,
		Новый СписокЗначений, Ложь);
	Данные = ОценкиПоХарактеристикам.Данные;
	ТаблицаИтогов = ОценкиПоХарактеристикам.ТаблицаИтогов;
	УдаляемыеСтроки = Новый Массив;
	Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.ЛичныеДанныеКандидата) Тогда
			УдаляемыеСтроки.Добавить(ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекущаяСтрока Из УдаляемыеСтроки Цикл
		ТаблицаИтогов.Удалить(ТекущаяСтрока);
	КонецЦикла;
	
	Для Каждого ЛичныеДанныеКандидата Из ЛичныеДанныеКандидатов Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата.Значение);
		Если ТаблицаИтогов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			НоваяСтрока = ТаблицаИтогов.Добавить();
			НоваяСтрока.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата.Значение;
			НоваяСтрока.ОтносительнаяОценка = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаХарактеристик = Данные.Скопировать();
	ТаблицаХарактеристик.Свернуть("Характеристика");
	
	ОтветыЭлектронногоТеста = ЭлектронноеТестированиеКандидатов.ТаблицаОтветовТеста(Вакансия, ЛичныеДанныеКандидатов);
	ДеревоРасшифровки = РасшифровкаХарактеристикПоОтветам(Вакансия, ЛичныеДанныеКандидатов, Неопределено, Неопределено);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "СоответствуетПрофилюДолжности") Тогда
		ОбъектОценки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "ПрофильДолжности");
	Иначе
		ОбъектОценки = Вакансия;
	КонецЕсли;
	
	Макет = Отчеты.СравнениеХарактеристикКандидатовПодробно.ПолучитьМакет("Макет");
	
	ШапкаОбщая = Макет.ПолучитьОбласть("ШапкаОбщая");
	ШапкаОбщая.Параметры.Вакансия = Вакансия;
	ТаблицаОтчета.Вывести(ШапкаОбщая);
	ОбластьНачалоЗаголовков = Макет.ПолучитьОбласть("ОбластьИтоговыйБалл|КолонкиФормулировка");
	ОбластьИмяЗаголовок = Макет.ПолучитьОбласть("ОбластьИтоговыйБалл|Балл");
	Если Кандидаты.Количество() = 1 Тогда
		Шапка2 = Макет.ПолучитьОбласть("ШапкаКандидат");
		Шапка2.Параметры.Кандидат = Кандидаты[0].Значение;
		ТаблицаОтчета.Вывести(Шапка2);
		ТаблицаОтчета.Вывести(ОбластьНачалоЗаголовков);
		Если ТаблицаИтогов.Количество() > 0 Тогда
			ОбластьИмяЗаголовок.Параметры.ИтоговыйБалл = ТаблицаИтогов[0].ОтносительнаяОценка;
			ТаблицаОтчета.Присоединить(ОбластьИмяЗаголовок);
		КонецЕсли;
	Иначе
		Шапка2 = Макет.ПолучитьОбласть("ШапкаКандидаты");
		Если ТаблицаИтогов.Количество() > 1 Тогда
			Область = Шапка2.Область(1, 12, 1, 11 + ТаблицаИтогов.Количество());
			Область.Объединить();
		КонецЕсли;
		ТаблицаОтчета.Вывести(Шапка2);
		ТаблицаОтчета.Вывести(ОбластьНачалоЗаголовков);
		Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
			ОбластьИмяЗаголовок.Параметры.Кандидат = ТекущаяСтрока.ЛичныеДанныеКандидата;
			ОбластьИмяЗаголовок.Параметры.ИтоговыйБалл = ТекущаяСтрока.ОтносительнаяОценка;
			ТаблицаОтчета.Присоединить(ОбластьИмяЗаголовок);
		КонецЦикла;
	КонецЕсли;
	ОбластьЗаголовков = Новый ТабличныйДокумент;
	ОбластьЗаголовков.Вывести(ТаблицаОтчета);
	
	Для Каждого ТекущаяХарактеристика Из ТаблицаХарактеристик Цикл
		СоответствиеРасшифровок = Новый Соответствие;
		
		ДеревоВопросов = Новый ДеревоЗначений;
		ДеревоВопросов.Колонки.Добавить("Вопрос");
		ДеревоВопросов.Колонки.Добавить("ЭлементарныйВопрос");
		Для Каждого ВеткаФизЛицо Из ДеревоРасшифровки.Строки Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ВеткаФизЛицо.ЛичныеДанныеКандидата); 
			СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика.Характеристика); 
			СтрокиХарактеристики = Данные.НайтиСтроки(СтруктураПоиска);
			Если СтрокиХарактеристики.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			ВеткаХарактеристики = ВеткаФизЛицо.Строки.Найти(ТекущаяХарактеристика.Характеристика);
			Если ВеткаХарактеристики = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ВеткаЗначения = ВеткаХарактеристики.Строки.Найти(СтрокиХарактеристики[0].Значение);
			Если ВеткаЗначения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СоответствиеРасшифровок.Вставить(ВеткаФизЛицо.ЛичныеДанныеКандидата, ВеткаЗначения);
			Для Каждого ВеткаВопрос Из ВеткаЗначения.Строки Цикл
				СтрокаВопроса = ДеревоВопросов.Строки.Найти(ВеткаВопрос.Вопрос);
				Если СтрокаВопроса = Неопределено Тогда
					СтрокаВопроса = ДеревоВопросов.Строки.Добавить();
					СтрокаВопроса.Вопрос = ВеткаВопрос.Вопрос;
				КонецЕсли;
				Для Каждого ВеткаЭлементарныйВопрос Из ВеткаВопрос.Строки Цикл
					СтрокаЭлементарногоВопроса = СтрокаВопроса.Строки.Найти(ВеткаЭлементарныйВопрос.ЭлементарныйВопрос);
					Если СтрокаЭлементарногоВопроса = Неопределено Тогда
						СтрокаЭлементарногоВопроса = СтрокаВопроса.Строки.Добавить();
						СтрокаЭлементарногоВопроса.ЭлементарныйВопрос = ВеткаЭлементарныйВопрос.ЭлементарныйВопрос;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
			
		ОбластьХарактеристикиЗаголовок = Новый ТабличныйДокумент;
		ОбластьЗаголовокХарактеристики = Макет.ПолучитьОбласть("ХарактеристикаЗаголовок|КолонкиФормулировка");
		ОбластьЗаголовокХарактеристикиБаллы = Макет.ПолучитьОбласть("ХарактеристикаЗаголовок|Балл");
		ОбластьСтрокаХарактеристики = Макет.ПолучитьОбласть("Характеристика|КолонкиФормулировка");
		ОбластьЗаголовокХарактеристики.Параметры.Характеристика = ТекущаяХарактеристика.Характеристика;
		ОбластьХарактеристикиЗаголовок.Вывести(ОбластьЗаголовокХарактеристики);
		Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
			ОбластьХарактеристикиЗаголовок.Присоединить(ОбластьЗаголовокХарактеристикиБаллы);
		КонецЦикла;
		ОбластьСтроки = ОбластьХарактеристикиЗаголовок.Область(1, 1, 1, ТаблицаИтогов.Количество() + 11);
		ОбластьСтроки.Объединить();
		ОбластьХарактеристики = Новый ТабличныйДокумент;
		ОбластьХарактеристики.Вывести(ОбластьСтрокаХарактеристики);
		ОбластьСтрокаХарактеристикиБаллы = Макет.ПолучитьОбласть("Характеристика|Балл");
		Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
			ОбластьСтрокаХарактеристикиБаллы.Параметры.МаксимальныйБалл = 0;
			ОбластьСтрокаХарактеристикиБаллы.Параметры.Вес = 0;
			ОбластьСтрокаХарактеристикиБаллы.Параметры.Балл = 0;
			ОбластьСтрокаХарактеристикиБаллы.Параметры.ИтоговыйБалл = 0;
			ОбластьСтрокаХарактеристикиБаллы.Параметры.ЗначениеХарактеристики = "";
			СтрокаРасшифровки = СоответствиеРасшифровок.Получить(ТекущаяСтрока.ЛичныеДанныеКандидата);
			Если СтрокаРасшифровки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОбластьСтрокаХарактеристикиБаллы.Параметры, СтрокаРасшифровки);
			Иначе
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика.Характеристика); 
				СтрокиХарактеристики = Данные.НайтиСтроки(СтруктураПоиска);
				Если СтрокиХарактеристики.Количество() > 0 Тогда
					ОбластьСтрокаХарактеристикиБаллы.Параметры.ЗначениеХарактеристики = СтрокиХарактеристики[0].ОсновноеЗначение;
					ОбластьСтрокаХарактеристикиБаллы.Параметры.Вес = 1;
				КонецЕсли;
			КонецЕсли;
			ОбластьХарактеристики.Присоединить(ОбластьСтрокаХарактеристикиБаллы);
		КонецЦикла;
		ГруппировкаХарактеристики = Новый ТабличныйДокумент;
		ГруппировкаХарактеристики.Вывести(ОбластьХарактеристикиЗаголовок);
		ГруппировкаХарактеристики.Вывести(ОбластьХарактеристики);
		Если Не ТаблицаОтчета.ПроверитьВывод(ГруппировкаХарактеристики) Тогда
			ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
			ТаблицаОтчета.Вывести(ОбластьЗаголовков);
		КонецЕсли;
		ТаблицаОтчета.Вывести(ОбластьХарактеристикиЗаголовок);
		ТаблицаОтчета.НачатьГруппуСтрок();
		ТаблицаОтчета.Вывести(ОбластьХарактеристики);
		
		НомерВопроса = 1;
		Для Каждого ВеткаВопрос Из ДеревоВопросов.Строки Цикл
			ОбластьВопрос = Новый ТабличныйДокумент;
			ЭтоВопросЭлектронногоТеста = ?(ТипЗнч(ВеткаВопрос.Вопрос) = Тип("СправочникСсылка.ТестовыеВопросы"),
				Истина, Ложь);
			Область = Макет.ПолучитьОбласть("Вопрос|КолонкиФормулировка");
			ОбластьВопросПустая = Макет.ПолучитьОбласть("Вопрос|Балл");
			ЗаполнитьЗначенияСвойств(Область.Параметры, ВеткаВопрос);
			Если ЭтоВопросЭлектронногоТеста Тогда
				Область.Параметры.ВопросФормулировка = СтрШаблон("%1.", НомерВопроса);
			Иначе
				Область.Параметры.ВопросФормулировка = СтрШаблон("%1. %2", НомерВопроса, ВеткаВопрос.Вопрос.Формулировка);
			КонецЕсли;
			
			НомерВопроса = НомерВопроса + 1;
			ОбластьВопрос.Вывести(Область, 0);
			Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
				ОбластьВопрос.Присоединить(ОбластьВопросПустая);
			КонецЦикла;
			Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьВопрос) Тогда
				ТаблицаОтчета.ЗакончитьГруппуСтрок();
				ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
				ТаблицаОтчета.Вывести(ОбластьЗаголовков);
				ТаблицаОтчета.Вывести(ОбластьХарактеристикиЗаголовок);
				ТаблицаОтчета.НачатьГруппуСтрок();
				ТаблицаОтчета.Вывести(ОбластьХарактеристики);
			КонецЕсли;
			ТаблицаОтчета.Вывести(ОбластьВопрос, 1);
			ТаблицаОтчета.НачатьГруппуСтрок();
			Для Каждого ВеткаЭлементарныйВопрос Из ВеткаВопрос.Строки Цикл
				ОбластьТаблицаОтветов = Новый ТабличныйДокумент;
				
				ОбластьЭлементарныйВопрос = Макет.ПолучитьОбласть("ЭлементарныйВопрос|КолонкиВопрос");
				
				Если ЭтоВопросЭлектронногоТеста Тогда
					ДанныеВопроса = Справочники.ТестовыеВопросы.ДанныеВопросов(ВеткаВопрос.Вопрос, Истина);
					ОбластьЭлементарныйВопрос.Параметры.ЭлементарныйВопрос = ДанныеВопроса.Вопросы[0].Задание.ПолучитьТекст();
					ОбластьТаблицаОтветов.Вывести(ОбластьЭлементарныйВопрос, 1);
					
					ВариантыОтвета = ДанныеВопроса.Варианты;
					
					ПерваяСтрока = Истина;
					ТекущаяВысота = 0;
					Для Каждого ВариантОтвета Из ВариантыОтвета Цикл
						ДополнительнаяКолонка = ?(ПерваяСтрока, "|КолонкиОтвет", "|КолонкиФормулировка");
						Область = Макет.ПолучитьОбласть("Ответ" + ДополнительнаяКолонка);
						Область.Параметры.Ответ = ВариантОтвета.ТекстВарианта;
						
						Если ПерваяСтрока Тогда
							ОбластьТаблицаОтветов.Присоединить(Область);
							ПерваяСтрока = Ложь;
						Иначе
							ОбластьТаблицаОтветов.Вывести(Область);
							ТекущаяВысота = ТекущаяВысота + 1;
						КонецЕсли;
					
						ОбластьБалл = Макет.ПолучитьОбласть("Ответ|Балл");
						ОбластьПолученныйБалл = Макет.ПолучитьОбласть("УказанныйОтвет|Балл");
					
						Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
							Область = ОбластьБалл;
							Область.Параметры.Балл = 0;
							
							Отбор = Новый Структура();
							Отбор.Вставить("Вакансия", Вакансия);
							Отбор.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата);
							Отбор.Вставить("Вопрос", ВеткаВопрос.Вопрос);
							Отбор.Вставить("ВариантОтвета", ВариантОтвета.Ссылка);
							Вариант = ОтветыЭлектронногоТеста.НайтиСтроки(Отбор);
							
							Если Вариант.Количество() > 0 Тогда
								Если Вариант[0].Выбран Тогда
									Область = Макет.ПолучитьОбласть("УказанныйОтвет|Балл");
								Иначе
									Область = Макет.ПолучитьОбласть("Ответ|Балл");
								КонецЕсли;
								СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата); 
								СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика.Характеристика); 
								СтрокиХарактеристики = Данные.НайтиСтроки(СтруктураПоиска);
								Если СтрокиХарактеристики.Количество() > 0 Тогда
									Область.Параметры.Балл =
										ЭлектронноеТестированиеКандидатов.ПолученныйБаллПоОтветуТеста(
											ВариантОтвета.Ссылка, ТекущаяХарактеристика.Характеристика,
											 СтрокиХарактеристики[0].Значение, ОбъектОценки);
								КонецЕсли;
								ОбластьТаблицаОтветов.Присоединить(Область);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЦикла;
					
					Область = ОбластьТаблицаОтветов.Область(1, 1, 1 + ТекущаяВысота, 5);
					Область.Объединить();
					Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьТаблицаОтветов) Тогда
						ТаблицаОтчета.ЗакончитьГруппуСтрок();
						ТаблицаОтчета.ЗакончитьГруппуСтрок();
						ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
						ТаблицаОтчета.Вывести(ОбластьЗаголовков);
						ТаблицаОтчета.Вывести(ОбластьХарактеристикиЗаголовок);
						ТаблицаОтчета.НачатьГруппуСтрок();
						ТаблицаОтчета.Вывести(ОбластьХарактеристики);
						ТаблицаОтчета.Вывести(ОбластьВопрос, 1);
						ТаблицаОтчета.НачатьГруппуСтрок();
					КонецЕсли;
					ТаблицаОтчета.Вывести(ОбластьТаблицаОтветов);
					
				Иначе
					ЗаполнитьЗначенияСвойств(ОбластьЭлементарныйВопрос.Параметры, ВеткаЭлементарныйВопрос);
					ОбластьТаблицаОтветов.Вывести(ОбластьЭлементарныйВопрос, 1);
					Выборка = ДанныеАнкеты(Вакансия, ВеткаЭлементарныйВопрос.ЭлементарныйВопрос,
						ТекущаяХарактеристика.Характеристика, Неопределено);
					ТаблицаОтветов = Новый ТаблицаЗначений;
					ТаблицаОтветов.Колонки.Добавить("Ответ");
					ТаблицаОтветов.Колонки.Добавить("ЗначениеХарактеристики");
					ТаблицаОтветов.Колонки.Добавить("МаксимальныйБалл");
					Пока Выборка.Следующий() Цикл
						НоваяСтрока = ТаблицаОтветов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
					КонецЦикла;
					СписокОтветов = ТаблицаОтветов.Скопировать();
					СписокОтветов.Свернуть("Ответ");
					
					ПерваяСтрока = Истина;
					ТекущаяВысота = 0;
					Для Каждого Ответ Из СписокОтветов Цикл
						ДополнительнаяКолонка = ?(ПерваяСтрока, "|КолонкиОтвет", "|КолонкиФормулировка");
						Область = Макет.ПолучитьОбласть("Ответ" + ДополнительнаяКолонка);
						ЗаполнитьЗначенияСвойств(Область.Параметры, Ответ);
						Если ПерваяСтрока Тогда
							ОбластьТаблицаОтветов.Присоединить(Область);
							ПерваяСтрока = Ложь;
						Иначе
							ОбластьТаблицаОтветов.Вывести(Область);
							ТекущаяВысота = ТекущаяВысота + 1;
						КонецЕсли;
						ОбластьБалл = Макет.ПолучитьОбласть("Ответ|Балл");
						ОбластьПолученныйБалл = Макет.ПолучитьОбласть("УказанныйОтвет|Балл");
						Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
							Область = ОбластьБалл;
							Область.Параметры.Балл = 0;
							СтруктураПоиска = Новый Структура;
							СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата); 
							СтруктураПоиска.Вставить("Характеристика", ТекущаяХарактеристика.Характеристика); 
							СтрокиХарактеристики = Данные.НайтиСтроки(СтруктураПоиска);
							Если СтрокиХарактеристики.Количество() > 0 Тогда
								СтруктураПоиска = Новый Структура;
								СтруктураПоиска.Вставить("Ответ", Ответ.Ответ);
								СтруктураПоиска.Вставить("ЗначениеХарактеристики", СтрокиХарактеристики[0].Значение);
								СтрокиОтвета = ТаблицаОтветов.НайтиСтроки(СтруктураПоиска);
								Если СтрокиОтвета.Количество() > 0 Тогда
									Область.Параметры.Балл = СтрокиОтвета[0].МаксимальныйБалл;
								КонецЕсли;
							КонецЕсли;
							ДанныеРасшифровки = СоответствиеРасшифровок.Получить(ТекущаяСтрока.ЛичныеДанныеКандидата);
							Если ДанныеРасшифровки <> Неопределено Тогда
								СтрокаВопроса = ДанныеРасшифровки.Строки.Найти(ВеткаВопрос.Вопрос);
								Если СтрокаВопроса <> Неопределено Тогда
									СтрокаЭлементарногоВопроса = СтрокаВопроса.Строки.Найти(
										ВеткаЭлементарныйВопрос.ЭлементарныйВопрос);
									Если СтрокаЭлементарногоВопроса <> Неопределено Тогда
										СтрокаОтвета = СтрокаЭлементарногоВопроса.Строки.Найти(Ответ.Ответ);
										Если СтрокаОтвета <> Неопределено Тогда
											Область = ОбластьПолученныйБалл;
											ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаОтвета);
										КонецЕсли;
									КонецЕсли;
								КонецЕсли
							КонецЕсли;
							ОбластьТаблицаОтветов.Присоединить(Область);
						КонецЦикла;
					КонецЦикла;
					Область = ОбластьТаблицаОтветов.Область(1, 1, 1 + ТекущаяВысота, 5);
					Область.Объединить();
					Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьТаблицаОтветов) Тогда
						ТаблицаОтчета.ЗакончитьГруппуСтрок();
						ТаблицаОтчета.ЗакончитьГруппуСтрок();
						ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
						ТаблицаОтчета.Вывести(ОбластьЗаголовков);
						ТаблицаОтчета.Вывести(ОбластьХарактеристикиЗаголовок);
						ТаблицаОтчета.НачатьГруппуСтрок();
						ТаблицаОтчета.Вывести(ОбластьХарактеристики);
						ТаблицаОтчета.Вывести(ОбластьВопрос, 1);
						ТаблицаОтчета.НачатьГруппуСтрок();
					КонецЕсли;
					ТаблицаОтчета.Вывести(ОбластьТаблицаОтветов);
				КонецЕсли;
			КонецЦикла;
			ТаблицаОтчета.ЗакончитьГруппуСтрок();
		КонецЦикла;
		ТаблицаОтчета.ЗакончитьГруппуСтрок();
	КонецЦикла;
	
	ДобавитьМотиваторыВОтчет(ТаблицаОтчета, ТаблицаИтогов, Вакансия, ЛичныеДанныеКандидатов, Макет, ОбластьЗаголовков);
	ДобавитьМотивирующиеФразыВОтчет(ТаблицаОтчета, ТаблицаИтогов, Вакансия, ЛичныеДанныеКандидатов, Макет,
		ОбластьЗаголовков);
	
КонецПроцедуры

// Возвращает структуру с таблицами оценок физических лиц по характеристикам
//
// Параметры:
//   Вакансия - СправочникСсылка.Вакансии - оцениваемая вакансия.
//   ЛичныеДанныеКандидатов - СписокЗначений,Массив из СправочникСсылка.ЛичныеДанныеКандидатов - оцениваемые кандидаты.
//   ОтбираемыеХарактеристики - СписокЗначений - список оцениваемых характеристик персонала, используется в случае
//                                               отбора по этапам.
//   ИспользоватьОтборПоЭтапам - Булево - признак использования отбора по этапам.
//
// ВозвращаемоеЗначение:
//   Структура - структура с таблицами оценок физических лиц по характеристикам:
//    * Данные - ТаблицаЗначений
//    * ТаблицаИтогов - ТаблицаЗначений
//
Функция ОценкиКандидатовПоХарактеристикам(Вакансия, ЛичныеДанныеКандидатов, ОтбираемыеХарактеристики,
	ИспользоватьОтборПоЭтапам) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВакансииХарактеристикиПерсонала.Ссылка КАК Ссылка,
		|	ВакансииХарактеристикиПерсонала.Характеристика КАК Характеристика,
		|	ВакансииХарактеристикиПерсонала.Значение КАК Значение,
		|	ВакансииХарактеристикиПерсонала.Вес КАК Вес,
		|	ВакансииХарактеристикиПерсонала.ВесЗначения КАК ВесЗначения
		|ПОМЕСТИТЬ ВТХарактеристикиВакансий
		|ИЗ
		|	Справочник.Вакансии.ХарактеристикиПерсонала КАК ВакансииХарактеристикиПерсонала
		|ГДЕ
		|	ВакансииХарактеристикиПерсонала.Ссылка = &Вакансия
		|	И ВакансииХарактеристикиПерсонала.ТребуетсяПроверка
		|	И (ВакансииХарактеристикиПерсонала.Характеристика В (&Характеристики)
		|	ИЛИ НЕ &ИспользоватьОтборПоЭтапам)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	МАКСИМУМ(ХарактеристикиВакансий.Значение) КАК ОсновноеЗначение,
		|	ВложенныйЗапрос.ВесЗначения КАК ВесЗначения,
		|	ВложенныйЗапрос.Вес КАК Вес
		|ПОМЕСТИТЬ ВТЗначенияХарактеристик
		|ИЗ
		|	(ВЫБРАТЬ
		|		ХарактеристикиВакансий.Ссылка КАК Ссылка,
		|		МАКСИМУМ(ХарактеристикиВакансий.ВесЗначения) КАК ВесЗначения,
		|		ХарактеристикиВакансий.Характеристика КАК Характеристика,
		|		ХарактеристикиВакансий.Вес КАК Вес
		|	ИЗ
		|		ВТХарактеристикиВакансий КАК ХарактеристикиВакансий
		|	СГРУППИРОВАТЬ ПО
		|		ХарактеристикиВакансий.Ссылка,
		|		ХарактеристикиВакансий.Характеристика,
		|		ХарактеристикиВакансий.Вес) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиВакансий КАК ХарактеристикиВакансий
		|		ПО ВложенныйЗапрос.ВесЗначения = ХарактеристикиВакансий.ВесЗначения
		|		И ВложенныйЗапрос.Характеристика = ХарактеристикиВакансий.Характеристика
		|		И ВложенныйЗапрос.Ссылка = ХарактеристикиВакансий.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.ВесЗначения,
		|	ВложенныйЗапрос.Вес
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиВакансий.Ссылка КАК Вакансия,
		|	ХарактеристикиВакансий.Характеристика КАК Характеристика,
		|	ХарактеристикиВакансий.Значение КАК Значение,
		|	ХарактеристикиВакансий.Вес КАК Вес,
		|	ХарактеристикиФизическихЛиц.ФизическоеЛицо КАК ЛичныеДанныеКандидата,
		|	ХарактеристикиВакансий.ВесЗначения КАК ВесЗначения,
		|	ЕСТЬNULL(ХарактеристикиФизическихЛиц.Балл, 0) * ХарактеристикиВакансий.ВесЗначения КАК Оценка
		|ПОМЕСТИТЬ ВТОценкиЗначений
		|ИЗ
		|	ВТХарактеристикиВакансий КАК ХарактеристикиВакансий
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиФизическихЛиц.СрезПоследних КАК ХарактеристикиФизическихЛиц
		|		ПО ХарактеристикиВакансий.Характеристика = ХарактеристикиФизическихЛиц.ХарактеристикаПерсонала
		|		И ХарактеристикиВакансий.Значение = ХарактеристикиФизическихЛиц.ЗначениеХарактеристики
		|		И ХарактеристикиВакансий.Ссылка = ХарактеристикиФизическихЛиц.Вакансия
		|		И (ХарактеристикиФизическихЛиц.ФизическоеЛицо В (&ЛичныеДанныеКандидатов))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Вакансия КАК Вакансия,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.Вес КАК Вес,
		|	ВложенныйЗапрос.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВложенныйЗапрос.Оценка КАК Оценка,
		|	ОценкиЗначений.Значение КАК Значение,
		|	ОценкиЗначений.ВесЗначения КАК ВесЗначения
		|ПОМЕСТИТЬ ВТАбсолютныеОценкиХарактеристик
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОценкиЗначений.Вакансия КАК Вакансия,
		|		ОценкиЗначений.Характеристика КАК Характеристика,
		|		ОценкиЗначений.Вес КАК Вес,
		|		ОценкиЗначений.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|		МАКСИМУМ(ОценкиЗначений.Оценка) КАК Оценка
		|	ИЗ
		|		ВТОценкиЗначений КАК ОценкиЗначений
		|	СГРУППИРОВАТЬ ПО
		|		ОценкиЗначений.Вакансия,
		|		ОценкиЗначений.Характеристика,
		|		ОценкиЗначений.Вес,
		|		ОценкиЗначений.ЛичныеДанныеКандидата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОценкиЗначений КАК ОценкиЗначений
		|		ПО ВложенныйЗапрос.Вакансия = ОценкиЗначений.Вакансия
		|		И ВложенныйЗапрос.Характеристика = ОценкиЗначений.Характеристика
		|		И ВложенныйЗапрос.ЛичныеДанныеКандидата = ОценкиЗначений.ЛичныеДанныеКандидата
		|		И ВложенныйЗапрос.Оценка = ОценкиЗначений.Оценка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Вакансия КАК Вакансия,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.Вес КАК Вес,
		|	ВложенныйЗапрос.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВложенныйЗапрос.Оценка КАК Оценка,
		|	МАКСИМУМ(АбсолютныеОценкиХарактеристик.Значение) КАК Значение
		|ПОМЕСТИТЬ ВТАбсолютныеОценкиХарактеристикСвернутые
		|ИЗ
		|	(ВЫБРАТЬ
		|		АбсолютныеОценкиХарактеристик.Вакансия КАК Вакансия,
		|		АбсолютныеОценкиХарактеристик.Характеристика КАК Характеристика,
		|		АбсолютныеОценкиХарактеристик.Вес КАК Вес,
		|		АбсолютныеОценкиХарактеристик.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|		АбсолютныеОценкиХарактеристик.Оценка КАК Оценка,
		|		МАКСИМУМ(АбсолютныеОценкиХарактеристик.ВесЗначения) КАК ВесЗначения
		|	ИЗ
		|		ВТАбсолютныеОценкиХарактеристик КАК АбсолютныеОценкиХарактеристик
		|	СГРУППИРОВАТЬ ПО
		|		АбсолютныеОценкиХарактеристик.Вакансия,
		|		АбсолютныеОценкиХарактеристик.Характеристика,
		|		АбсолютныеОценкиХарактеристик.Вес,
		|		АбсолютныеОценкиХарактеристик.ЛичныеДанныеКандидата,
		|		АбсолютныеОценкиХарактеристик.Оценка) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАбсолютныеОценкиХарактеристик КАК АбсолютныеОценкиХарактеристик
		|		ПО ВложенныйЗапрос.Вакансия = АбсолютныеОценкиХарактеристик.Вакансия
		|		И ВложенныйЗапрос.Характеристика = АбсолютныеОценкиХарактеристик.Характеристика
		|		И ВложенныйЗапрос.Вес = АбсолютныеОценкиХарактеристик.Вес
		|		И ВложенныйЗапрос.ЛичныеДанныеКандидата = АбсолютныеОценкиХарактеристик.ЛичныеДанныеКандидата
		|		И ВложенныйЗапрос.Оценка = АбсолютныеОценкиХарактеристик.Оценка
		|		И ВложенныйЗапрос.ВесЗначения = АбсолютныеОценкиХарактеристик.ВесЗначения
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Вакансия,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Вес,
		|	ВложенныйЗапрос.ЛичныеДанныеКандидата,
		|	ВложенныйЗапрос.Оценка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АбсолютныеОценкиХарактеристикСвернутые.Вакансия КАК Вакансия,
		|	АбсолютныеОценкиХарактеристикСвернутые.Характеристика КАК Характеристика,
		|	АбсолютныеОценкиХарактеристикСвернутые.Вес КАК Вес,
		|	АбсолютныеОценкиХарактеристикСвернутые.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВЫБОР
		|		КОГДА ЗначенияХарактеристик.ВесЗначения = 0
		|			ТОГДА 0
		|		ИНАЧЕ АбсолютныеОценкиХарактеристикСвернутые.Оценка / ЗначенияХарактеристик.ВесЗначения
		|	КОНЕЦ КАК Оценка,
		|	АбсолютныеОценкиХарактеристикСвернутые.Значение КАК Значение,
		|	ЗначенияХарактеристик.ОсновноеЗначение КАК ОсновноеЗначение
		|ПОМЕСТИТЬ ВТОценкиХарактеристик
		|ИЗ
		|	ВТАбсолютныеОценкиХарактеристикСвернутые КАК АбсолютныеОценкиХарактеристикСвернутые
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО АбсолютныеОценкиХарактеристикСвернутые.Вакансия = ЗначенияХарактеристик.Ссылка
		|		И АбсолютныеОценкиХарактеристикСвернутые.Характеристика = ЗначенияХарактеристик.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияХарактеристик.Ссылка КАК Ссылка,
		|	СУММА(ЗначенияХарактеристик.Вес) КАК Вес
		|ПОМЕСТИТЬ ВТСуммаВесовХарактеристик
		|ИЗ
		|	ВТЗначенияХарактеристик КАК ЗначенияХарактеристик
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияХарактеристик.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОценкиХарактеристик.Вакансия КАК Вакансия,
		|	ОценкиХарактеристик.Характеристика КАК Характеристика,
		|	ОценкиХарактеристик.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОценкиХарактеристик.Оценка КАК Оценка,
		|	ВЫБОР
		|		КОГДА СуммаВесов.Вес = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОценкиХарактеристик.Оценка * ОценкиХарактеристик.Вес / СуммаВесов.Вес
		|	КОНЕЦ КАК ОтносительнаяОценка,
		|	ОценкиХарактеристик.Значение КАК Значение,
		|	ОценкиХарактеристик.ОсновноеЗначение КАК ОсновноеЗначение
		|ИЗ
		|	ВТОценкиХарактеристик КАК ОценкиХарактеристик
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСуммаВесовХарактеристик КАК СуммаВесов
		|		ПО ОценкиХарактеристик.Вакансия = СуммаВесов.Ссылка";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	Запрос.УстановитьПараметр("Характеристики", ОтбираемыеХарактеристики);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоЭтапам", ИспользоватьОтборПоЭтапам);
	Данные = Запрос.Выполнить().Выгрузить();
	
	ТаблицаИтогов = Данные.Скопировать();
	ТаблицаИтогов.Свернуть("ЛичныеДанныеКандидата", "Оценка, ОтносительнаяОценка");
	ТаблицаИтогов.Сортировать("ОтносительнаяОценка Убыв");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Данные", Данные);
	СтруктураВозврата.Вставить("ТаблицаИтогов", ТаблицаИтогов);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Процедура отменяет анкеты кандидатов по этапу работы вакансии
//
// Параметры:
//   Вакансия - СправочникСсылка.Вакансии - вакансия.
//   ЭтапРаботы - СправочникСсылка.ЭтапыРаботыСКандидатами - этап работы с кандидатами.
//   Кандидат - СправочникСсылка.Кандидаты, Неопределено - кандидат, для которого отменяется этап работы.
//
Процедура ОтменитьАнкетыПоЭтапу(Вакансия, ЭтапРаботы, Кандидат = Неопределено) Экспорт
	
	НаборХарактеристик = РегистрыСведений.ХарактеристикиФизическихЛиц.СоздатьНаборЗаписей();
	НаборХарактеристик.Отбор.Вакансия.Установить(Вакансия);
	Если ЗначениеЗаполнено(Кандидат) Тогда
		НаборХарактеристик.Отбор.ФизическоеЛицо.Установить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Кандидат, "ЛичныеДанные"));
	КонецЕсли;
	НаборХарактеристик.Прочитать();
	МассивСтарыхЗаписей = Новый Массив;
	Для Каждого ТекущаяЗапись Из НаборХарактеристик Цикл
		Если ТекущаяЗапись.Этап = ЭтапРаботы Тогда
			МассивСтарыхЗаписей.Добавить(ТекущаяЗапись);
		КонецЕсли;
	КонецЦикла;
	Для Каждого УстаревшаяЗапись Из МассивСтарыхЗаписей Цикл
		НаборХарактеристик.Удалить(УстаревшаяЗапись);
	КонецЦикла;
	НаборХарактеристик.Записать();
	
	НаборЗаписей = РегистрыСведений.АнкетыКандидатов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
	НаборЗаписей.Отбор.ЭтапРаботыСКандидатом.Установить(ЭтапРаботы);
	Если ЗначениеЗаполнено(Кандидат) Тогда
		НаборЗаписей.Отбор.Кандидат.Установить(Кандидат);
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура-обработчик подписки ПроверитьЗаполнениеМотиваторовВАнкете.
// Проверяет, установлен ли признак "Мотиваторы разобраны". Если нет, то отказывает в проведении Анкеты.
//
Процедура ПроверитьЗаполнениеМотиваторовВАнкетеОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВопросыШаблонаАнкеты.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК ВопросыДляСобеседованияВопросовШаблоновАнкет
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|		ПО ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты = ВопросыШаблонаАнкеты.Ссылка
		|ГДЕ
		|	ВопросыШаблонаАнкеты.Владелец = &Владелец
		|	И ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.ТипВопроса = ЗНАЧЕНИЕ(Перечисление.ТипыВопросовПоМетодуСИвановой.Мотивация)
		|	И НЕ ВопросыШаблонаАнкеты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Владелец", Источник.ШаблонАнкеты);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеПоМотивацииВАнкетахДополнительно.МотиваторыРазобраны КАК МотиваторыРазобраны
	|ИЗ
	|	РегистрСведений.ДанныеПоМотивацииВАнкетахДополнительно КАК ДанныеПоМотивацииВАнкетахДополнительно
	|ГДЕ
	|	ДанныеПоМотивацииВАнкетахДополнительно.Анкета = &Анкета";
	Запрос.УстановитьПараметр("Анкета", Источник.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = Результат.Выбрать();
	
	ТекстОшибки = НСтр("ru = 'Завершение интервью невозможно, пока не разобраны мотиваторы в анкете. Мотиваторы заполняются через кнопку ""Мотивация"".'");
	Если Выборка.Следующий() Тогда
		Если Не Выборка.МотиваторыРазобраны Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает и сохраняет итоговые оценки кандидатов по характеристикам
//
// Параметры:
//   Вакансия - СправочникСсылка.Вакансии - вакансия, по которой осуществляется оценка.
//   Кандидаты - Массив - массив оцениваемых кандидатов.
//
Процедура РассчитатьОценкиКандидатов(Вакансия, Кандидаты) Экспорт
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидатов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты, "ЛичныеДанные");
	
	ОценкиПоХарактеристикам = ОценкиКандидатовПоХарактеристикам(Вакансия,
		ОбщегоНазначения.ВыгрузитьКолонку(ЛичныеДанныеКандидатов, "Значение"), Новый СписокЗначений, Ложь);
	ТаблицаИтогов = ОценкиПоХарактеристикам.ТаблицаИтогов;
	
	Для Каждого Кандидат Из Кандидаты Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ЛичныеДанныеКандидатов[Кандидат]);
		СтрокиОценки = ТаблицаИтогов.НайтиСтроки(СтруктураПоиска);
		Если СтрокиОценки.Количество() = 0 Тогда
			Оценка = 0;
		Иначе
			Оценка = СтрокиОценки[0].ОтносительнаяОценка;
		КонецЕсли;
		ЗаписьРегистра = РегистрыСведений.ОценкиКандидатовПоХарактеристикам.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Кандидат = Кандидат;
		ЗаписьРегистра.Оценка = Оценка;
		ЗаписьРегистра.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов[Кандидат];
		ЗаписьРегистра.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Отменяет удаляемые из вакансии этапы.
//
Процедура ОтменитьАнкетыУдаленныхЭтапов(Вакансия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнкетыКандидатов.Вакансия КАК Вакансия,
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом КАК ЭтапРаботы
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|		ПО (ЭтапыВакансии.Ссылка = АнкетыКандидатов.Вакансия)
		|			И (ЭтапыВакансии.ЭтапРаботы = АнкетыКандидатов.ЭтапРаботыСКандидатом)
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И ЭтапыВакансии.ЭтапРаботы ЕСТЬ NULL";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтменитьАнкетыПоЭтапу(Вакансия, Выборка.ЭтапРаботы);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик подписки на событие УстановитьИспользованиеЭлектронногоИнтервью
//
Процедура УстановитьИспользованиеЭлектронногоИнтервью(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.Значение Тогда
		Если Константы.ИспользоватьЭлектронноеИнтервью.Получить() Тогда
			// Значит надо выключить оценку, так как ее использование без "Анкетирования" невозможно.
			Константы.ИспользоватьЭлектронноеИнтервью.Установить(Ложь);
			
			Если ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьАнкетирование") Тогда
				НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Анкетирования'");
			ИначеЕсли ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений") Тогда
				НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Шаблонов сообщений'");
			Иначе
				НаименованиеИсточникаРодительныйПадеж = "";
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Использование Электронного интервью невозможно без использования %1. Электронное интервью так же было выключено.'"),
					НаименованиеИсточникаРодительныйПадеж);

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает дерево по списку действий сотрудников, добавляя их родительские элементы.
//
// Параметры:
//   СписокДействий - Массив - массив действий сотрудников.
//
// ВозвращаемоеЗначение:
//   ДеревоЗначений - дерево из переданных действий сотрудников и их родительских элементов.
//
Функция ДеревоДействийСотрудников(СписокДействий) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДействияСотрудников.Ссылка КАК ДействиеСотрудника,
		|	ВЫБОР
		|		КОГДА ДействияСотрудников.Ссылка В (&СписокДействий)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьВОбъекте
		|ИЗ
		|	Справочник.ДействияСотрудников КАК ДействияСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДействияСотрудников КАК ДействияСотрудников1
		|		ПО ДействияСотрудников.Ссылка = ДействияСотрудников1.Родитель
		|ГДЕ
		|	(ДействияСотрудников.Ссылка В (&СписокДействий)
		|			ИЛИ ДействияСотрудников1.Ссылка В (&СписокДействий))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДействиеСотрудника ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("СписокДействий", СписокДействий);
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
КонецФункции

// Возвращает соответствие с ключом в виде шаблона анкеты и значением равным количеству вопросов
//
// Параметры:
//   ШаблоныАнкеты - Массив - массив шаблонов.
//
// ВозвращаемоеЗначение:
//   ВопросовВШаблонахАнкет - Соответствие - с количеством вопросов по шаблону.
//
Функция КоличествоВопросовВШаблонахАнкет(ШаблоныАнкеты)Экспорт
	
	ВопросовВШаблонахАнкет = Новый Соответствие;
	
	Если ШаблоныАнкеты.Количество() = 0 Тогда
		Возврат ВопросовВШаблонахАнкет;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблоныАнкеты", ШаблоныАнкеты);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВопросыШаблонаАнкеты.Ссылка) КАК КоличествоВопросов,
		|	ВопросыШаблонаАнкеты.Владелец КАК ШаблонАнкеты
		|ИЗ
		|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|ГДЕ
		|	ВопросыШаблонаАнкеты.Владелец В (&ШаблоныАнкеты)
		|	И НЕ ВопросыШаблонаАнкеты.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	ВопросыШаблонаАнкеты.Владелец";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВопросовВШаблонахАнкет.Вставить(Выборка.ШаблонАнкеты, Выборка.КоличествоВопросов);
	КонецЦикла;
	
	Возврат ВопросовВШаблонахАнкет;
	
КонецФункции

// Заполняет личные данные кандидатов при обновлении и возвращает признак успешного завершения заполнения
// 
// Возвращаемое значение:
//  Булево
Функция ЗаполнитьЛичныеДанныеКандидатов() Экспорт
	
	ОбработкаЗавершена = РегистрыСведений.АнкетыКандидатов.ЗаполнитьКандидатов();
	Если Не ОбработкаЗавершена Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработкаЗавершена = РегистрыСведений.ОценкиКандидатовПоХарактеристикам.ЗаполнитьКандидатов();
	Если Не ОбработкаЗавершена Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбработкаЗавершена = РегистрыСведений.ХарактеристикиФизическихЛиц.ЗаменитьФизическиеЛицаНаКандидатов();
	
	Возврат ОбработкаЗавершена;
	
КонецФункции


// Добовляет вопрос отказался отвечать в комплексный вопрос
//
// Параметры:
//  СоставКомплексногоВопроса	 - СправочникТабличнаяЧасть.ВопросыШаблонаАнкеты.СоставКомплексногоВопроса
//
Процедура ДобавитьПроверкуОтказаОтвечать(СоставКомплексногоВопроса) Экспорт
	
	СлужебныеВопросыСтрока = НСтр("ru = 'Служебные вопросы'");
	Родитель = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(СлужебныеВопросыСтрока, Истина, ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка());
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		РодительОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьГруппу();
		РодительОбъект.Наименование = СлужебныеВопросыСтрока;
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
	КонецЕсли;
	
	ОтказалсяОтвечатьСтрока = НСтр("ru = 'Отказался отвечать'");
	Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(ОтказалсяОтвечатьСтрока, Истина, Родитель);
	Если Не ЗначениеЗаполнено(Вопрос) Тогда
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
		ВопросОбъект.Родитель = Родитель;
		ВопросОбъект.Наименование = ОтказалсяОтвечатьСтрока;
		ВопросОбъект.Формулировка = "";
		ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ВариантыОтветовАнкет");
		ВопросОбъект.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево;
		ВопросОбъект.ВидФлажка = Перечисления.ВидыФлажкаВАнкетах.Флажок;
		ВопросОбъект.Записать();
		Вопрос = ВопросОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока = СоставКомплексногоВопроса.Добавить();
	НоваяСтрока.ЭлементарныйВопрос = Вопрос;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РасширеннаяТаблицаОтветов(СтрокиОтветов)
	
	Ответы = Новый ТаблицаЗначений;
	Ответы.Колонки.Добавить("Анкета", Новый ОписаниеТипов("ДокументСсылка.Анкета"));
	Ответы.Колонки.Добавить("ШаблонАнкеты", Новый ОписаниеТипов("СправочникСсылка.ШаблоныАнкет"));
	Ответы.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.ВопросыШаблонаАнкеты"));
	Ответы.Колонки.Добавить("ЭлементарныйВопрос", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВопросыДляАнкетирования"));
	Ответы.Колонки.Добавить("Ответ", Метаданные.ПланыВидовХарактеристик.ВопросыДляАнкетирования.Тип);
	Для Каждого ТекущаяЗапись Из СтрокиОтветов Цикл
		НоваяСтрока = Ответы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяЗапись);
		НоваяСтрока.ШаблонАнкеты = ТекущаяЗапись.Анкета.ШаблонАнкеты;
	КонецЦикла;
	
	Возврат Ответы;
	
КонецФункции

Функция ТекстЗапросаПоБаллам()
	
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	ОтветыНаВопросыАнкет.Анкета КАК Анкета,
		|	ОтветыНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ОтветыНаВопросыАнкет.Ответ КАК Ответ,
		|	ОтветыНаВопросыАнкет.ШаблонАнкеты КАК ШаблонАнкеты
		|ПОМЕСТИТЬ ВТОтветы
		|ИЗ
		|	&Ответы КАК ОтветыНаВопросыАнкет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Анкета,
		|	Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиФизическихЛицСрезПоследних.Вакансия КАК Вакансия,
		|	ХарактеристикиФизическихЛицСрезПоследних.ФизическоеЛицо КАК ЛичныеДанныеКандидата,
		|	ХарактеристикиФизическихЛицСрезПоследних.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ХарактеристикиФизическихЛицСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	АнкетыКандидатов.Анкета КАК Анкета
		|ПОМЕСТИТЬ ВТАктуальныеАнкеты
		|ИЗ
		|	РегистрСведений.ХарактеристикиФизическихЛиц.СрезПоследних КАК ХарактеристикиФизическихЛицСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ПО ХарактеристикиФизическихЛицСрезПоследних.Вакансия = АнкетыКандидатов.Вакансия
		|			И ХарактеристикиФизическихЛицСрезПоследних.ФизическоеЛицо = АнкетыКандидатов.ЛичныеДанныеКандидата
		|			И ХарактеристикиФизическихЛицСрезПоследних.Этап = АнкетыКандидатов.ЭтапРаботыСКандидатом
		|ГДЕ
		|	&Расшифровка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтветы.Анкета КАК Анкета,
		|	ВТОтветы.Вопрос КАК Вопрос
		|ПОМЕСТИТЬ ВТОтказалсяОтветить
		|ИЗ
		|	ВТОтветы КАК ВТОтветы
		|ГДЕ
		|	ВТОтветы.ЭлементарныйВопрос = &ВопросОтказалсяОтвечать
		|	И ВТОтветы.Ответ = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОтветы.Анкета КАК Анкета,
		|	ВТОтветы.ШаблонАнкеты КАК ШаблонАнкеты,
		|	ВопросыШаблонаАнкеты.Ссылка КАК ВопросШаблонаАнкеты
		|ПОМЕСТИТЬ ВТВопросыШаблонаАнкеты
		|ИЗ
		|	ВТОтветы КАК ВТОтветы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|		ПО ВТОтветы.ШаблонАнкеты = ВопросыШаблонаАнкеты.Владелец
		|			И (НЕ ВопросыШаблонаАнкеты.ПометкаУдаления)
		|			И (НЕ ВопросыШаблонаАнкеты.ЭтоГруппа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты КАК ВопросШаблонаАнкеты,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВТВопросыШаблонаАнкеты.Анкета КАК Анкета,
		|	ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты.ЭлементарныйВопрос КАК ВопросШаблонаАнкетыЭлементарныйВопрос,
		|	ВЫБОР
		|		КОГДА ВТОтказалсяОтветить.Вопрос ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОтказалсяОтветить
		|ПОМЕСТИТЬ ВТВопросыАнкеты
		|ИЗ
		|	ВТВопросыШаблонаАнкеты КАК ВТВопросыШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК ВопросыДляСобеседованияВопросовШаблоновАнкет
		|		ПО ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты = ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтказалсяОтветить КАК ВТОтказалсяОтветить
		|		ПО ВТВопросыШаблонаАнкеты.Анкета = ВТОтказалсяОтветить.Анкета
		|			И ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты = ВТОтказалсяОтветить.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВопросыАнкеты.Анкета КАК Анкета,
		|	ВТВопросыАнкеты.ВопросШаблонаАнкеты КАК Вопрос,
		|	Ответы.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	Ответы.Ответ КАК Ответ,
		|	АнкетыКандидатов.Вакансия КАК Вакансия,
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом КАК ЭтапРаботыСКандидатом,
		|	АнкетыКандидатов.Кандидат КАК Кандидат,
		|	ВТВопросыАнкеты.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВТВопросыАнкеты.ВопросШаблонаАнкетыЭлементарныйВопрос КАК ВопросШаблонаАнкетыЭлементарныйВопрос
		|ПОМЕСТИТЬ ВТВопросыДляСобеседования
		|ИЗ
		|	ВТВопросыАнкеты КАК ВТВопросыАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветы КАК Ответы
		|		ПО ВТВопросыАнкеты.ВопросШаблонаАнкеты = Ответы.Вопрос
		|			И ВТВопросыАнкеты.Анкета = Ответы.Анкета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ПО ВТВопросыАнкеты.Анкета = АнкетыКандидатов.Анкета
		|ГДЕ
		|	(ВТВопросыАнкеты.ОтказалсяОтветить
		|			ИЛИ Ответы.Ответ <> ЗНАЧЕНИЕ(Справочник.ВариантыОтветовАнкет.ПустаяСсылка))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ВопросДляСобеседования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыДляСобеседования.Анкета КАК Анкета,
		|	ВопросыДляСобеседования.Вопрос КАК Вопрос,
		|	ВопросыДляСобеседования.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ВопросыДляСобеседования.Ответ КАК Ответ,
		|	ВопросыДляСобеседования.Вакансия КАК Вакансия,
		|	ВопросыДляСобеседования.ЭтапРаботыСКандидатом КАК ЭтапРаботыСКандидатом,
		|	ВопросыДляСобеседования.Кандидат КАК Кандидат,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные КАК ЛичныеДанныеКандидата,
		|	ВопросыДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.Балл КАК Балл
		|ПОМЕСТИТЬ ВТОтветыСБаллами
		|ИЗ
		|	ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ПО (ВЫБОР
		|				КОГДА ВопросыДляСобеседования.Вакансия.СоответствуетПрофилюДолжности
		|					ТОГДА ВопросыДляСобеседования.Вакансия.ПрофильДолжности
		|				ИНАЧЕ ВопросыДляСобеседования.Вакансия
		|			КОНЕЦ = НастройкаВопросовДляСобеседования.Объект)
		|			И (ВопросыДляСобеседования.ВопросДляСобеседования = НастройкаВопросовДляСобеседования.ВопросДляСобеседования
		|				ИЛИ ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|					И НастройкаВопросовДляСобеседования.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка))
		|			И ВопросыДляСобеседования.ЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос
		|			И ВопросыДляСобеседования.Ответ = НастройкаВопросовДляСобеседования.ОтветНаВопрос
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветыСБаллами.Вакансия КАК Вакансия,
		|	ОтветыСБаллами.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОтветыСБаллами.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ОтветыСБаллами.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(ОтветыСБаллами.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТБаллы
		|ИЗ
		|	ВТОтветыСБаллами КАК ОтветыСБаллами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеАнкеты КАК ВТАктуальныеАнкеты
		|		ПО ОтветыСБаллами.Анкета = ВТАктуальныеАнкеты.Анкета
		|			И ОтветыСБаллами.Вакансия = ВТАктуальныеАнкеты.Вакансия
		|			И ОтветыСБаллами.ЛичныеДанныеКандидата = ВТАктуальныеАнкеты.ЛичныеДанныеКандидата
		|			И ОтветыСБаллами.ХарактеристикаПерсонала = ВТАктуальныеАнкеты.ХарактеристикаПерсонала
		|			И ОтветыСБаллами.ЗначениеХарактеристики = ВТАктуальныеАнкеты.ЗначениеХарактеристики
		|ГДЕ
		|	НЕ(ВТАктуальныеАнкеты.Анкета ЕСТЬ NULL
		|				И &Расшифровка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтветыСБаллами.Вакансия,
		|	ОтветыСБаллами.ЛичныеДанныеКандидата,
		|	ОтветыСБаллами.ХарактеристикаПерсонала,
		|	ОтветыСБаллами.ЗначениеХарактеристики
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыДляСобеседования.Вакансия КАК Вакансия,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(НастройкаВопросовДляСобеседования.Балл) КАК Балл,
		|	ВопросыДляСобеседования.Анкета КАК Анкета
		|ПОМЕСТИТЬ ВТМаксимальныеБаллы
		|ИЗ
		|	РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|		ПО (НастройкаВопросовДляСобеседования.Объект = ВЫБОР
		|				КОГДА ВопросыДляСобеседования.Вакансия.СоответствуетПрофилюДолжности
		|					ТОГДА ВопросыДляСобеседования.Вакансия.ПрофильДолжности
		|				ИНАЧЕ ВопросыДляСобеседования.Вакансия
		|			КОНЕЦ)
		|			И (ВопросыДляСобеседования.ВопросДляСобеседования = НастройкаВопросовДляСобеседования.ВопросДляСобеседования
		|				ИЛИ ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|					И НастройкаВопросовДляСобеседования.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|					И ВопросыДляСобеседования.ВопросШаблонаАнкетыЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос)
		|			И НастройкаВопросовДляСобеседования.ЭлементарныйВопрос = ВопросыДляСобеседования.ЭлементарныйВопрос
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВопросыДляСобеседования.Вакансия,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные,
		|	ВопросыДляСобеседования.Анкета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллы.Вакансия КАК Вакансия,
		|	МаксимальныеБаллы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МаксимальныеБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	МаксимальныеБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(МаксимальныеБаллы.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТМаксимальныеБаллыСвернутые
		|ИЗ
		|	ВТМаксимальныеБаллы КАК МаксимальныеБаллы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеАнкеты КАК ВТАктуальныеАнкеты
		|		ПО МаксимальныеБаллы.Вакансия = ВТАктуальныеАнкеты.Вакансия
		|			И МаксимальныеБаллы.ЛичныеДанныеКандидата = ВТАктуальныеАнкеты.ЛичныеДанныеКандидата
		|			И МаксимальныеБаллы.ХарактеристикаПерсонала = ВТАктуальныеАнкеты.ХарактеристикаПерсонала
		|			И МаксимальныеБаллы.ЗначениеХарактеристики = ВТАктуальныеАнкеты.ЗначениеХарактеристики
		|			И МаксимальныеБаллы.Анкета = ВТАктуальныеАнкеты.Анкета
		|ГДЕ
		|	НЕ(ВТАктуальныеАнкеты.Анкета ЕСТЬ NULL
		|				И &Расшифровка)
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксимальныеБаллы.Вакансия,
		|	МаксимальныеБаллы.ХарактеристикаПерсонала,
		|	МаксимальныеБаллы.ЗначениеХарактеристики,
		|	МаксимальныеБаллы.ЛичныеДанныеКандидата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллыСвернутые.Вакансия КАК Вакансия,
		|	МаксимальныеБаллыСвернутые.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МаксимальныеБаллыСвернутые.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	МаксимальныеБаллыСвернутые.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ВЫБОР
		|		КОГДА МаксимальныеБаллыСвернутые.Балл = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(Баллы.Балл, 0) / МаксимальныеБаллыСвернутые.Балл * 100
		|	КОНЕЦ КАК Балл
		|ПОМЕСТИТЬ ВТИтоговыеЗначения
		|ИЗ
		|	ВТМаксимальныеБаллыСвернутые КАК МаксимальныеБаллыСвернутые
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБаллы КАК Баллы
		|		ПО МаксимальныеБаллыСвернутые.ЛичныеДанныеКандидата = Баллы.ЛичныеДанныеКандидата
		|			И (Баллы.ХарактеристикаПерсонала = МаксимальныеБаллыСвернутые.ХарактеристикаПерсонала)
		|			И (Баллы.ЗначениеХарактеристики = МаксимальныеБаллыСвернутые.ЗначениеХарактеристики)
		|			И (Баллы.Вакансия = МаксимальныеБаллыСвернутые.Вакансия)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговыеЗначения.Вакансия КАК Вакансия,
		|	ИтоговыеЗначения.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ИтоговыеЗначения.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ИтоговыеЗначения.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ИтоговыеЗначения.Балл КАК Балл
		|ИЗ
		|	ВТИтоговыеЗначения КАК ИтоговыеЗначения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПоВсемСпособамОценки()
	
	ТекстЗапроса =  
		"ВЫБРАТЬ
		|	ОтветыНаВопросыАнкет.Анкета КАК Анкета,
		|	ОтветыНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ОтветыНаВопросыАнкет.Ответ КАК Ответ,
		|	ОтветыНаВопросыАнкет.ШаблонАнкеты КАК ШаблонАнкеты
		|ПОМЕСТИТЬ ВТОтветы
		|ИЗ
		|	&Ответы КАК ОтветыНаВопросыАнкет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Анкета,
		|	Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветыЭлектронногоТеста.Объект КАК Объект,
		|	ОтветыЭлектронногоТеста.ЭлектронныйКурс КАК ЭлектронныйКурс,
		|	ОтветыЭлектронногоТеста.Вакансия КАК Вакансия,
		|	ОтветыЭлектронногоТеста.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОтветыЭлектронногоТеста.Вопрос КАК Вопрос,
		|	ОтветыЭлектронногоТеста.ВариантОтвета КАК ВариантОтвета,
		|	ОтветыЭлектронногоТеста.Выбран КАК Выбран,
		|	ОтветыЭлектронногоТеста.ЭтапРаботы КАК ЭтапРаботы
		|ПОМЕСТИТЬ ВТРезультатыЭлектронногоТеста
		|ИЗ
		|	&ОтветыЭлектронногоТеста КАК ОтветыЭлектронногоТеста
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиФизическихЛицСрезПоследних.Вакансия КАК Вакансия,
		|	ХарактеристикиФизическихЛицСрезПоследних.ФизическоеЛицо КАК ЛичныеДанныеКандидата,
		|	ХарактеристикиФизическихЛицСрезПоследних.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ХарактеристикиФизическихЛицСрезПоследних.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	АнкетыКандидатов.Анкета КАК Анкета
		|ПОМЕСТИТЬ ВТАктуальныеАнкеты
		|ИЗ
		|	РегистрСведений.ХарактеристикиФизическихЛиц.СрезПоследних КАК ХарактеристикиФизическихЛицСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ПО ХарактеристикиФизическихЛицСрезПоследних.Вакансия = АнкетыКандидатов.Вакансия
		|		И ХарактеристикиФизическихЛицСрезПоследних.ФизическоеЛицо = АнкетыКандидатов.ЛичныеДанныеКандидата
		|		И ХарактеристикиФизическихЛицСрезПоследних.Этап = АнкетыКандидатов.ЭтапРаботыСКандидатом
		|ГДЕ
		|	&Расшифровка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтветы.Анкета КАК Анкета,
		|	ВТОтветы.Вопрос КАК Вопрос
		|ПОМЕСТИТЬ ВТОтказалсяОтветить
		|ИЗ
		|	ВТОтветы КАК ВТОтветы
		|ГДЕ
		|	ВТОтветы.ЭлементарныйВопрос = &ВопросОтказалсяОтвечать
		|	И ВТОтветы.Ответ = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТОтветы.Анкета КАК Анкета,
		|	ВТОтветы.ШаблонАнкеты КАК ШаблонАнкеты,
		|	ВопросыШаблонаАнкеты.Ссылка КАК ВопросШаблонаАнкеты
		|ПОМЕСТИТЬ ВТВопросыШаблонаАнкеты
		|ИЗ
		|	ВТОтветы КАК ВТОтветы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|		ПО ВТОтветы.ШаблонАнкеты = ВопросыШаблонаАнкеты.Владелец
		|		И (НЕ ВопросыШаблонаАнкеты.ПометкаУдаления)
		|		И (НЕ ВопросыШаблонаАнкеты.ЭтоГруппа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты КАК ВопросШаблонаАнкеты,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВТВопросыШаблонаАнкеты.Анкета КАК Анкета,
		|	ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты.ЭлементарныйВопрос КАК ВопросШаблонаАнкетыЭлементарныйВопрос,
		|	ВЫБОР
		|		КОГДА ВТОтказалсяОтветить.Вопрос ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ОтказалсяОтветить
		|ПОМЕСТИТЬ ВТВопросыАнкеты
		|ИЗ
		|	ВТВопросыШаблонаАнкеты КАК ВТВопросыШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК
		|			ВопросыДляСобеседованияВопросовШаблоновАнкет
		|		ПО ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты = ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтказалсяОтветить КАК ВТОтказалсяОтветить
		|		ПО ВТВопросыШаблонаАнкеты.Анкета = ВТОтказалсяОтветить.Анкета
		|		И ВТВопросыШаблонаАнкеты.ВопросШаблонаАнкеты = ВТОтказалсяОтветить.Вопрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВопросыАнкеты.Анкета КАК Анкета,
		|	ВТВопросыАнкеты.ВопросШаблонаАнкеты КАК Вопрос,
		|	Ответы.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	Ответы.Ответ КАК Ответ,
		|	АнкетыКандидатов.Вакансия КАК Вакансия,
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом КАК ЭтапРаботыСКандидатом,
		|	АнкетыКандидатов.Кандидат КАК Кандидат,
		|	ВТВопросыАнкеты.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВТВопросыАнкеты.ВопросШаблонаАнкетыЭлементарныйВопрос КАК ВопросШаблонаАнкетыЭлементарныйВопрос
		|ПОМЕСТИТЬ ВТВопросыДляСобеседования
		|ИЗ
		|	ВТВопросыАнкеты КАК ВТВопросыАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтветы КАК Ответы
		|		ПО ВТВопросыАнкеты.ВопросШаблонаАнкеты = Ответы.Вопрос
		|		И ВТВопросыАнкеты.Анкета = Ответы.Анкета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ПО ВТВопросыАнкеты.Анкета = АнкетыКандидатов.Анкета
		|ГДЕ
		|	(ВТВопросыАнкеты.ОтказалсяОтветить
		|	ИЛИ Ответы.Ответ <> ЗНАЧЕНИЕ(Справочник.ВариантыОтветовАнкет.ПустаяСсылка))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ВопросДляСобеседования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыДляСобеседования.Анкета КАК Анкета,
		|	ВопросыДляСобеседования.Вопрос КАК Вопрос,
		|	ВопросыДляСобеседования.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ВопросыДляСобеседования.Ответ КАК Ответ,
		|	ВопросыДляСобеседования.Вакансия КАК Вакансия,
		|	ВопросыДляСобеседования.ЭтапРаботыСКандидатом КАК ЭтапРаботыСКандидатом,
		|	ВопросыДляСобеседования.Кандидат КАК Кандидат,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные КАК ЛичныеДанныеКандидата,
		|	ВопросыДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.Балл КАК Балл
		|ПОМЕСТИТЬ ВТОтветыСБаллами
		|ИЗ
		|	ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ПО (ВЫБОР
		|			КОГДА ВопросыДляСобеседования.Вакансия.СоответствуетПрофилюДолжности
		|				ТОГДА ВопросыДляСобеседования.Вакансия.ПрофильДолжности
		|			ИНАЧЕ ВопросыДляСобеседования.Вакансия
		|		КОНЕЦ = НастройкаВопросовДляСобеседования.Объект)
		|		И (ВопросыДляСобеседования.ВопросДляСобеседования = НастройкаВопросовДляСобеседования.ВопросДляСобеседования
		|		ИЛИ ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|		И
		|			НастройкаВопросовДляСобеседования.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка))
		|		И ВопросыДляСобеседования.ЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос
		|		И ВопросыДляСобеседования.Ответ = НастройкаВопросовДляСобеседования.ОтветНаВопрос
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтветыСБаллами.Вакансия КАК Вакансия,
		|	ОтветыСБаллами.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ОтветыСБаллами.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ОтветыСБаллами.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(ОтветыСБаллами.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТБаллы
		|ИЗ
		|	ВТОтветыСБаллами КАК ОтветыСБаллами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеАнкеты КАК ВТАктуальныеАнкеты
		|		ПО ОтветыСБаллами.Анкета = ВТАктуальныеАнкеты.Анкета
		|		И ОтветыСБаллами.Вакансия = ВТАктуальныеАнкеты.Вакансия
		|		И ОтветыСБаллами.ЛичныеДанныеКандидата = ВТАктуальныеАнкеты.ЛичныеДанныеКандидата
		|		И ОтветыСБаллами.ХарактеристикаПерсонала = ВТАктуальныеАнкеты.ХарактеристикаПерсонала
		|		И ОтветыСБаллами.ЗначениеХарактеристики = ВТАктуальныеАнкеты.ЗначениеХарактеристики
		|ГДЕ
		|	НЕ (ВТАктуальныеАнкеты.Анкета ЕСТЬ NULL
		|	И &Расшифровка)
		|СГРУППИРОВАТЬ ПО
		|	ОтветыСБаллами.Вакансия,
		|	ОтветыСБаллами.ЛичныеДанныеКандидата,
		|	ОтветыСБаллами.ХарактеристикаПерсонала,
		|	ОтветыСБаллами.ЗначениеХарактеристики
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультатыЭлектронногоТеста.Вакансия КАК Вакансия,
		|	ВТРезультатыЭлектронногоТеста.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(ВЫБОР
		|		КОГДА ВТРезультатыЭлектронногоТеста.Выбран
		|			ТОГДА НастройкаВопросовДляЭлектронногоТестирования.Балл
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Балл
		|ПОМЕСТИТЬ ВТБаллыЗаТест
		|ИЗ
		|	ВТРезультатыЭлектронногоТеста КАК ВТРезультатыЭлектронногоТеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК
		|			НастройкаВопросовДляЭлектронногоТестирования
		|		ПО ВТРезультатыЭлектронногоТеста.Объект = НастройкаВопросовДляЭлектронногоТестирования.Объект
		|		И ВТРезультатыЭлектронногоТеста.ЭлектронныйКурс = НастройкаВопросовДляЭлектронногоТестирования.ЭлектронныйКурс
		|		И ВТРезультатыЭлектронногоТеста.ВариантОтвета = НастройкаВопросовДляЭлектронногоТестирования.ВариантОтвета
		|СГРУППИРОВАТЬ ПО
		|	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала,
		|	ВТРезультатыЭлектронногоТеста.ЛичныеДанныеКандидата,
		|	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики,
		|	ВТРезультатыЭлектронногоТеста.Вакансия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТБаллы.Вакансия КАК Вакансия,
		|	ВТБаллы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВТБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ВТБаллы.Балл КАК Балл
		|ПОМЕСТИТЬ ВТБаллыЗаАнкетированиеИТестирование
		|ИЗ
		|	ВТБаллы КАК ВТБаллы
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТБаллыЗаТест.Вакансия,
		|	ВТБаллыЗаТест.ЛичныеДанныеКандидата,
		|	ВТБаллыЗаТест.ХарактеристикаПерсонала,
		|	ВТБаллыЗаТест.ЗначениеХарактеристики,
		|	ВТБаллыЗаТест.Балл
		|ИЗ
		|	ВТБаллыЗаТест КАК ВТБаллыЗаТест
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОбщиеБаллы.Вакансия КАК Вакансия,
		|	ВТОбщиеБаллы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВТОбщиеБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТОбщиеБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(ВТОбщиеБаллы.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТРезультатПоВсемСпособамОценки
		|ИЗ
		|	ВТБаллыЗаАнкетированиеИТестирование КАК ВТОбщиеБаллы
		|СГРУППИРОВАТЬ ПО
		|	ВТОбщиеБаллы.Вакансия,
		|	ВТОбщиеБаллы.ЗначениеХарактеристики,
		|	ВТОбщиеБаллы.ЛичныеДанныеКандидата,
		|	ВТОбщиеБаллы.ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВопросыДляСобеседования.Вакансия КАК Вакансия,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования КАК ВопросДляСобеседования,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные КАК ЛичныеДанныеКандидата,
		|	МАКСИМУМ(НастройкаВопросовДляСобеседования.Балл) КАК Балл,
		|	ВопросыДляСобеседования.Анкета КАК Анкета
		|ПОМЕСТИТЬ ВТМаксимальныеБаллы
		|ИЗ
		|	РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВопросыДляСобеседования КАК ВопросыДляСобеседования
		|		ПО (НастройкаВопросовДляСобеседования.Объект = ВЫБОР
		|			КОГДА ВопросыДляСобеседования.Вакансия.СоответствуетПрофилюДолжности
		|				ТОГДА ВопросыДляСобеседования.Вакансия.ПрофильДолжности
		|			ИНАЧЕ ВопросыДляСобеседования.Вакансия
		|		КОНЕЦ)
		|		И (ВопросыДляСобеседования.ВопросДляСобеседования = НастройкаВопросовДляСобеседования.ВопросДляСобеседования
		|		ИЛИ ВопросыДляСобеседования.ВопросДляСобеседования ЕСТЬ NULL
		|		И
		|			НастройкаВопросовДляСобеседования.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|		И
		|			ВопросыДляСобеседования.ВопросШаблонаАнкетыЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос)
		|		И НастройкаВопросовДляСобеседования.ЭлементарныйВопрос = ВопросыДляСобеседования.ЭлементарныйВопрос
		|ГДЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	ВопросыДляСобеседования.Вакансия,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования,
		|	ВопросыДляСобеседования.Кандидат.ЛичныеДанные,
		|	ВопросыДляСобеседования.Анкета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеБаллы.Вакансия КАК Вакансия,
		|	МаксимальныеБаллы.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МаксимальныеБаллы.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	МаксимальныеБаллы.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(МаксимальныеБаллы.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТМаксимальныеБаллыСвернутые
		|ИЗ
		|	ВТМаксимальныеБаллы КАК МаксимальныеБаллы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТАктуальныеАнкеты КАК ВТАктуальныеАнкеты
		|		ПО МаксимальныеБаллы.Вакансия = ВТАктуальныеАнкеты.Вакансия
		|		И МаксимальныеБаллы.ЛичныеДанныеКандидата = ВТАктуальныеАнкеты.ЛичныеДанныеКандидата
		|		И МаксимальныеБаллы.ХарактеристикаПерсонала = ВТАктуальныеАнкеты.ХарактеристикаПерсонала
		|		И МаксимальныеБаллы.ЗначениеХарактеристики = ВТАктуальныеАнкеты.ЗначениеХарактеристики
		|		И МаксимальныеБаллы.Анкета = ВТАктуальныеАнкеты.Анкета
		|ГДЕ
		|	НЕ (ВТАктуальныеАнкеты.Анкета ЕСТЬ NULL
		|	И &Расшифровка)
		|СГРУППИРОВАТЬ ПО
		|	МаксимальныеБаллы.Вакансия,
		|	МаксимальныеБаллы.ХарактеристикаПерсонала,
		|	МаксимальныеБаллы.ЗначениеХарактеристики,
		|	МаксимальныеБаллы.ЛичныеДанныеКандидата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Вакансия,
		|	ХарактеристикаПерсонала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультатыЭлектронногоТеста.Вакансия КАК Вакансия,
		|	ВТРезультатыЭлектронногоТеста.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(НастройкаВопросовДляЭлектронногоТестирования.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТМаксимальныеБаллыЗаТест
		|ИЗ
		|	ВТРезультатыЭлектронногоТеста КАК ВТРезультатыЭлектронногоТеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляЭлектронногоТестирования КАК
		|			НастройкаВопросовДляЭлектронногоТестирования
		|		ПО ВТРезультатыЭлектронногоТеста.Объект = НастройкаВопросовДляЭлектронногоТестирования.Объект
		|		И ВТРезультатыЭлектронногоТеста.ЭлектронныйКурс = НастройкаВопросовДляЭлектронногоТестирования.ЭлектронныйКурс
		|		И ВТРезультатыЭлектронногоТеста.ВариантОтвета = НастройкаВопросовДляЭлектронногоТестирования.ВариантОтвета
		|СГРУППИРОВАТЬ ПО
		|	НастройкаВопросовДляЭлектронногоТестирования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляЭлектронногоТестирования.ЗначениеХарактеристики,
		|	ВТРезультатыЭлектронногоТеста.Вакансия,
		|	ВТРезультатыЭлектронногоТеста.ЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаксимальныеБаллыЗаТест.Вакансия КАК Вакансия,
		|	ВТМаксимальныеБаллыЗаТест.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВТМаксимальныеБаллыЗаТест.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТМаксимальныеБаллыЗаТест.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ВТМаксимальныеБаллыЗаТест.Балл КАК Балл
		|ПОМЕСТИТЬ ВТМаксимальныеБаллыЗаАнкетированиеИТестирование
		|ИЗ
		|	ВТМаксимальныеБаллыЗаТест КАК ВТМаксимальныеБаллыЗаТест
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТМаксимальныеБаллыСвернутые.Вакансия,
		|	ВТМаксимальныеБаллыСвернутые.ЛичныеДанныеКандидата,
		|	ВТМаксимальныеБаллыСвернутые.ХарактеристикаПерсонала,
		|	ВТМаксимальныеБаллыСвернутые.ЗначениеХарактеристики,
		|	ВТМаксимальныеБаллыСвернутые.Балл
		|ИЗ
		|	ВТМаксимальныеБаллыСвернутые КАК ВТМаксимальныеБаллыСвернутые
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.Вакансия КАК Вакансия,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	СУММА(ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.Балл) КАК Балл
		|ПОМЕСТИТЬ ВТМаксимальныеБаллыПоВсемСпособамОценки
		|ИЗ
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование КАК ВТМаксимальныеБаллыЗаАнкетированиеИТестирование
		|СГРУППИРОВАТЬ ПО
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ЛичныеДанныеКандидата,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.Вакансия,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ХарактеристикаПерсонала,
		|	ВТМаксимальныеБаллыЗаАнкетированиеИТестирование.ЗначениеХарактеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТМаксимальныеБаллыПоВсемСпособамОценки.Вакансия КАК Вакансия,
		|	ВТМаксимальныеБаллыПоВсемСпособамОценки.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ВТМаксимальныеБаллыПоВсемСпособамОценки.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ВТМаксимальныеБаллыПоВсемСпособамОценки.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ВЫБОР
		|		КОГДА ВТМаксимальныеБаллыПоВсемСпособамОценки.Балл = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ВТРезультатПоВсемСпособамОценки.Балл, 0) / ВТМаксимальныеБаллыПоВсемСпособамОценки.Балл * 100
		|	КОНЕЦ КАК Балл
		|ПОМЕСТИТЬ ВТИтоговыеЗначения
		|ИЗ
		|	ВТМаксимальныеБаллыПоВсемСпособамОценки КАК ВТМаксимальныеБаллыПоВсемСпособамОценки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезультатПоВсемСпособамОценки КАК ВТРезультатПоВсемСпособамОценки
		|		ПО ВТМаксимальныеБаллыПоВсемСпособамОценки.ЛичныеДанныеКандидата = ВТРезультатПоВсемСпособамОценки.ЛичныеДанныеКандидата
		|		И
		|			ВТМаксимальныеБаллыПоВсемСпособамОценки.ХарактеристикаПерсонала = ВТРезультатПоВсемСпособамОценки.ХарактеристикаПерсонала
		|		И
		|			ВТМаксимальныеБаллыПоВсемСпособамОценки.ЗначениеХарактеристики = ВТРезультатПоВсемСпособамОценки.ЗначениеХарактеристики
		|		И ВТМаксимальныеБаллыПоВсемСпособамОценки.Вакансия = ВТРезультатПоВсемСпособамОценки.Вакансия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговыеЗначения.Вакансия КАК Вакансия,
		|	ИтоговыеЗначения.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ИтоговыеЗначения.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ИтоговыеЗначения.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ИтоговыеЗначения.Балл КАК Балл
		|ИЗ
		|	ВТИтоговыеЗначения КАК ИтоговыеЗначения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДанныеВопросовШаблонаАнкеты(ШаблонАнкеты)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ВопросыШаблонаАнкеты.Ссылка КАК ВопросШаблона,
		|	ВопросыШаблонаАнкеты.Родитель КАК Родитель,
		|	ВопросыШаблонаАнкеты.Наименование КАК Наименование,
		|	ВопросыШаблонаАнкеты.Обязательный КАК Обязательный,
		|	ВопросыШаблонаАнкеты.ТипВопроса КАК ТипВопроса,
		|	ВопросыШаблонаАнкеты.ТипТабличногоВопроса КАК ТипТабличногоВопроса,
		|	ВопросыШаблонаАнкеты.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ВопросыШаблонаАнкеты.ЭтоГруппа КАК ЭтоРаздел,
		|	ВопросыШаблонаАнкеты.РодительВопрос КАК РодительВопрос,
		|	ВЫБОР
		|		КОГДА ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.ТипВопроса = ЗНАЧЕНИЕ(Перечисление.ТипыВопросовПоМетодуСИвановой.Мотивация)
		|			ТОГДА ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.Подсказка	
		|		ИНАЧЕ ВопросыШаблонаАнкеты.Подсказка 
		|	КОНЕЦ КАК Подсказка,
		|	ВопросыШаблонаАнкеты.СпособОтображенияПодсказки КАК СпособОтображенияПодсказки,
		|	ВопросыШаблонаАнкеты.Формулировка КАК Формулировка,
		|	ВопросыШаблонаАнкеты.СоставТабличногоВопроса.(
		|		НомерСтроки КАК НомерСтроки,
		|		ЭлементарныйВопрос
		|	),
		|	ВопросыШаблонаАнкеты.ПредопределенныеОтветы.(
		|		НомерСтроки КАК НомерСтроки,
		|		ЭлементарныйВопрос,
		|		Ответ
		|	),
		|	ВопросыШаблонаАнкеты.СоставКомплексногоВопроса.(
		|		НомерСтроки КАК НомерСтроки,
		|		ЭлементарныйВопрос
		|	),
		|	ЕСТЬNULL(ВопросыДляАнкетирования.Длина, 0) КАК Длина,
		|	ВопросыДляАнкетирования.ТипЗначения КАК ТипЗначения,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.ТребуетсяКомментарий, ЛОЖЬ) КАК ТребуетсяКомментарий,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.ПояснениеКомментария, """") КАК ПояснениеКомментария,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.МинимальноеЗначение, 0) КАК МинимальноеЗначение,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.МаксимальноеЗначение, 0) КАК МаксимальноеЗначение,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.ТипОтвета, ЗНАЧЕНИЕ(Перечисление.ТипыОтветовНаВопрос.ПустаяСсылка)) КАК ТипОтвета,
		|	ЕСТЬNULL(ВопросыДляАнкетирования.Точность, 0) КАК Точность,
		|	ВопросыШаблонаАнкеты.Заметки,
		|	ВЫБОР
		|		КОГДА ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.ТипВопроса = ЗНАЧЕНИЕ(Перечисление.ТипыВопросовПоМетодуСИвановой.Мотивация)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Мотивация,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.ТипВопроса КАК ТипВопросаПоМетодуСИвановой
		|ИЗ
		|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВопросыДляАнкетирования КАК ВопросыДляАнкетирования
		|		ПО ВопросыШаблонаАнкеты.ЭлементарныйВопрос = ВопросыДляАнкетирования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК ВопросыДляСобеседованияВопросовШаблоновАнкет
		|		ПО (ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты = ВопросыШаблонаАнкеты.Ссылка)
		|ГДЕ
		|	НЕ ВопросыШаблонаАнкеты.ПометкаУдаления
		|	И ВопросыШаблонаАнкеты.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВопросыШаблонаАнкеты.Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Владелец", ШаблонАнкеты);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ДобавитьСтрокиДереваАнкеты(Выборка, Макет, ТабличныйДокумент)
	
	ЛистТабличногоДокумента = Новый ТабличныйДокумент;
	ЛистТабличногоДокумента.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ЛистТабличногоДокумента.АвтоМасштаб = Истина;
	ЛистТабличногоДокумента.Вывести(ТабличныйДокумент);
	ТабличныйДокумент.Очистить();
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ЭтоРаздел Тогда
			Продолжить;
		КонецЕсли;
		
		ПодчиненнаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ОбластьВопроса = Макет.ПолучитьОбласть("ВопросШаблона");
		ПустойВопрос = Макет.ПолучитьОбласть("ПустойВопрос");
		МассивКолонок = Новый Массив;
		Пока ПодчиненнаяВыборка.Следующий() Цикл
			ФормулировкаВопроса = ПодчиненнаяВыборка.Формулировка;
			Если ПодчиненнаяВыборка.ТипВопросаПоМетодуСИвановой = Перечисления.ТипыВопросовПоМетодуСИвановой.PARLA Тогда
				ФормулировкаВопроса = СтрЗаменить(ФормулировкаВопроса, "P(Problem)", "•");
				ФормулировкаВопроса = СтрЗаменить(ФормулировкаВопроса, "A(Action)", "•");
				ФормулировкаВопроса = СтрЗаменить(ФормулировкаВопроса, "R(Result)", "•");
				ФормулировкаВопроса = СтрЗаменить(ФормулировкаВопроса, "L(Learned)", "•");
				ФормулировкаВопроса = СтрЗаменить(ФормулировкаВопроса, "A(Applied)", "•");
			КонецЕсли;
			Если ЗначениеЗаполнено(ПодчиненнаяВыборка.Подсказка) Тогда
				ФормулировкаВопроса = ФормулировкаВопроса + "(" + ПодчиненнаяВыборка.Подсказка + ")";
			КонецЕсли;
			ОбластьВопроса.Параметры.ВопросШаблона = ФормулировкаВопроса;
			ДобавляемыйТабличныйДокумент = Новый ТабличныйДокумент;
			ДобавляемыйТабличныйДокумент.Вывести(ОбластьВопроса);
			Если ПодчиненнаяВыборка.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Простой Тогда
				Если ПодчиненнаяВыборка.Мотивация Тогда
					ДобавитьМотивацию(ДобавляемыйТабличныйДокумент, Макет, ПодчиненнаяВыборка.ЭлементарныйВопрос);
				Иначе
					ДобавитьПростойВопрос(ДобавляемыйТабличныйДокумент, Макет, ПодчиненнаяВыборка.ЭлементарныйВопрос);
				КонецЕсли;
				МассивКолонок.Добавить(ДобавляемыйТабличныйДокумент);
			ИначеЕсли ПодчиненнаяВыборка.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный Тогда
				
				СоставВопроса = ПодчиненнаяВыборка.СоставКомплексногоВопроса.Выгрузить();
				
				Если ПодчиненнаяВыборка.ТипВопросаПоМетодуСИвановой = Перечисления.ТипыВопросовПоМетодуСИвановой.ТриПлюсаТриМинуса Тогда
					
					ВопросПлюсМинус = 0;
					Если СоставВопроса.Количество() > 0 
						И СоставВопроса[0].ЭлементарныйВопрос.Наименование = "Отказался отвечать" Тогда
						ДобавитьЭлементарныйВопрос(ДобавляемыйТабличныйДокумент, Макет, СоставВопроса[0].ЭлементарныйВопрос);
						ВопросПлюсМинус = 1;
					КонецЕсли;
					
					СтрокаОтвета = Макет.ПолучитьОбласть("ВопросТаблицы");
					Если СоставВопроса.Количество() > ВопросПлюсМинус Тогда
						СтрокаОтвета.Параметры.Вопрос1 = СоставВопроса[ВопросПлюсМинус].ЭлементарныйВопрос.Формулировка;
					КонецЕсли;
					Если СоставВопроса.Количество() > ВопросПлюсМинус + 1 Тогда
						СтрокаОтвета.Параметры.Вопрос2 = СоставВопроса[ВопросПлюсМинус + 1].ЭлементарныйВопрос.Формулировка;
					КонецЕсли; 
					ДобавляемыйТабличныйДокумент.Вывести(СтрокаОтвета);
					
					Если СоставВопроса.Количество()>ВопросПлюсМинус + 2 Тогда
						Для Сч=ВопросПлюсМинус + 3 По СоставВопроса.Количество() Цикл
							ДобавитьЭлементарныйВопрос(ДобавляемыйТабличныйДокумент, Макет, СоставВопроса[Сч-1].ЭлементарныйВопрос);
						КонецЦикла; 
					КонецЕсли; 
					
				Иначе
					
					Для Каждого ТекущаяСтрока Из СоставВопроса Цикл
						ДобавитьЭлементарныйВопрос(ДобавляемыйТабличныйДокумент, Макет, ТекущаяСтрока.ЭлементарныйВопрос);
					КонецЦикла;
					
				КонецЕсли; 
				МассивКолонок.Добавить(ДобавляемыйТабличныйДокумент);
				
			ИначеЕсли ПодчиненнаяВыборка.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Табличный Тогда
				СтрокаОтвета = Макет.ПолучитьОбласть("ВопросТаблицы");
				СоставТабличногоВопроса = ПодчиненнаяВыборка.СоставТабличногоВопроса.Выгрузить();
				Если СоставТабличногоВопроса.Количество() > 0 Тогда
					СтрокаОтвета.Параметры.Вопрос1 = СоставТабличногоВопроса[0].ЭлементарныйВопрос.Формулировка;
				КонецЕсли;
				Если СоставТабличногоВопроса.Количество() > 1 Тогда
					СтрокаОтвета.Параметры.Вопрос2 = СоставТабличногоВопроса[1].ЭлементарныйВопрос.Формулировка;
				КонецЕсли; 
				ДобавляемыйТабличныйДокумент.Вывести(СтрокаОтвета);
				МассивКолонок.Добавить(ДобавляемыйТабличныйДокумент);
			КонецЕсли;
		КонецЦикла;
		
		НачалоРаздела = ЛистТабличногоДокумента.ВысотаТаблицы;
		ВысотаРаздела = 0;
		НомерКолонки = 0;
		Пока НомерКолонки < МассивКолонок.Количество() Цикл
			ПромежуточныйТабличныйДокумент = Новый ТабличныйДокумент;
			ОбластьРаздел = Макет.ПолучитьОбласть("ОбластьРаздел");
			ОбластьРаздел.Параметры.Раздел = Выборка.ВопросШаблона;
			ПромежуточныйТабличныйДокумент.Вывести(ОбластьРаздел);
			ВысотаФрагмента = 1;
			НомерПоследнейКолонки = НомерКолонки + 2;
			МассивДляВывода = Новый Массив;
			Пока НомерКолонки < МассивКолонок.Количество() И НомерКолонки <= НомерПоследнейКолонки Цикл
				Высота = МассивКолонок[НомерКолонки].ВысотаТаблицы;
				МассивДляВывода.Добавить(МассивКолонок[НомерКолонки]);
				Если Высота > ВысотаФрагмента Тогда
					ВысотаФрагмента = Высота;
				КонецЕсли;
				НомерКолонки = НомерКолонки + 1;
			КонецЦикла;
			КолонокВыведено = 0;
			ПромежуточныйТабличныйДокументКолонок = Новый ТабличныйДокумент;
			Для Каждого ТабличныйДокументКолонка Из МассивДляВывода Цикл
				Пока ТабличныйДокументКолонка.ВысотаТаблицы < ВысотаФрагмента Цикл
					ТабличныйДокументКолонка.Вывести(ПустойВопрос);
				КонецЦикла;
				ПромежуточныйТабличныйДокументКолонок.Присоединить(ТабличныйДокументКолонка);
				КолонокВыведено = КолонокВыведено + 1;
			КонецЦикла;
			Пока КолонокВыведено < 3 Цикл
				ТабличныйДокументКолонка = Новый ТабличныйДокумент;
				Для Строк = 1 По ВысотаФрагмента Цикл
					ТабличныйДокументКолонка.Вывести(ПустойВопрос);
				КонецЦикла;
				ПромежуточныйТабличныйДокументКолонок.Присоединить(ТабличныйДокументКолонка);
				КолонокВыведено = КолонокВыведено + 1;
			КонецЦикла;
			Если Не ЛистТабличногоДокумента.ПроверитьВывод(ПромежуточныйТабличныйДокументКолонок) Тогда
				ТабличныйДокумент.Вывести(ЛистТабличногоДокумента);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ЛистТабличногоДокумента = Новый ТабличныйДокумент;
				ЛистТабличногоДокумента.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
				ЛистТабличногоДокумента.АвтоМасштаб = Истина;
				НачалоРаздела = 0;
				ВысотаРаздела = 0;
			КонецЕсли;
			ВысотаРаздела = ВысотаРаздела + ВысотаФрагмента;
			Если ВысотаРаздела > 0 Тогда
				Сплошная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 2);
				ПромежуточныйТабличныйДокумент.Присоединить(ПромежуточныйТабличныйДокументКолонок);
				ЛистТабличногоДокумента.Вывести(ПромежуточныйТабличныйДокумент);
				ЛистТабличногоДокумента.Область(НачалоРаздела + 1, 1, НачалоРаздела + ВысотаРаздела, 1).Обвести(Сплошная, Сплошная, Сплошная, Сплошная);
				ЛистТабличногоДокумента.Область(НачалоРаздела + 1, 1, НачалоРаздела + ВысотаРаздела, 1).Объединить();
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	ТабличныйДокумент.Вывести(ЛистТабличногоДокумента);
	
КонецПроцедуры

Процедура ДобавитьЭлементарныйВопрос(ТабличныйДокумент, Макет, ЭлементарныйВопрос)
	
	Если ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.ОдинВариантИз
		Или ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
		СтрокаВопроса = Макет.ПолучитьОбласть("ЭлементарныйВопрос");
		ТекстВопроса = ЭлементарныйВопрос.Формулировка + ":";
		СтрокаВопроса.Параметры.Вопрос = ТекстВопроса;
		ТабличныйДокумент.Вывести(СтрокаВопроса);
		СтрокаОтвета = Макет.ПолучитьОбласть("ЭлементарныйОтвет");
		Ответ = "";
		ВариантыОтветов = ВариантыОтветов(ЭлементарныйВопрос);
		Для Каждого ТекущийВариант Из ВариантыОтветов Цикл
			Ответ = Ответ + ?(ПустаяСтрока(Ответ), "", "  /  ") + ТекущийВариант.Наименование;
		КонецЦикла;
		СтрокаОтвета.Параметры.Ответ = Ответ;
		ТабличныйДокумент.Вывести(СтрокаОтвета);
		Если ЭлементарныйВопрос.ТребуетсяКомментарий Тогда
			ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
			ОбластьКомментарий.Параметры.Комментарий = ЭлементарныйВопрос.ПояснениеКомментария + ":";
			ТабличныйДокумент.Вывести(ОбластьКомментарий);
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
		КонецЕсли;
	Иначе
		СтрокаВопроса = Макет.ПолучитьОбласть("ЭлементарныйВопрос");
		СтрокаВопроса.Параметры.Вопрос = ?(ЗначениеЗаполнено(ЭлементарныйВопрос.Формулировка),
			ЭлементарныйВопрос.Формулировка,
			ЭлементарныйВопрос.Наименование) + ":";
		ТабличныйДокумент.Вывести(СтрокаВопроса);
		Если ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево Тогда
			СтрокаОтвета = Макет.ПолучитьОбласть("ЭлементарныйОтвет");;
			СтрокаОтвета.Параметры.Ответ = НСтр("ru = 'Да / Нет'");
			ТабличныйДокумент.Вывести(СтрокаОтвета);
		Иначе
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПростойВопрос(ТабличныйДокумент, Макет, ЭлементарныйВопрос)
	
	Если ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.ОдинВариантИз
		Или ЭлементарныйВопрос.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.НесколькоВариантовИз Тогда
		СтрокаОтвета = Макет.ПолучитьОбласть("ЭлементарныйОтвет");
		Ответ = "";
		ВариантыОтветов = ВариантыОтветов(ЭлементарныйВопрос);
		Для Каждого ТекущийВариант Из ВариантыОтветов Цикл
			Ответ = Ответ + ?(Ответ = "", "", "  /  ") + ТекущийВариант.Наименование;
		КонецЦикла;
		СтрокаОтвета.Параметры.Ответ = Ответ;
		ТабличныйДокумент.Вывести(СтрокаОтвета);
		Если ЭлементарныйВопрос.ТребуетсяКомментарий Тогда
			ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
			ОбластьКомментарий.Параметры.Комментарий = ЭлементарныйВопрос.ПояснениеКомментария + ":";
			ТабличныйДокумент.Вывести(ОбластьКомментарий);
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
		КонецЕсли;
	Иначе
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДобавитьМотивацию(ТабличныйДокумент, Макет, ЭлементарныйВопрос)
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	Если ЭлементарныйВопрос.ТребуетсяКомментарий Тогда
		ОбластьКомментарий = Макет.ПолучитьОбласть("Комментарий");
		ОбластьКомментарий.Параметры.Комментарий = ЭлементарныйВопрос.ПояснениеКомментария + ":";
		ТабличныйДокумент.Вывести(ОбластьКомментарий);
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ПустойВопрос"));
	КонецЕсли;	
	
КонецПроцедуры

Функция ВариантыОтветов(ЭлементарныйВопрос)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВариантыОтветовАнкет.Ссылка,
		|	ВариантыОтветовАнкет.ТребуетОткрытогоОтвета,
		|	ВариантыОтветовАнкет.Наименование
		|ИЗ
		|	Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
		|ГДЕ
		|	ВариантыОтветовАнкет.Владелец = &Владелец
		|	И НЕ ВариантыОтветовАнкет.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВариантыОтветовАнкет.РеквизитДопУпорядочивания";
	Запрос.УстановитьПараметр("Владелец", ЭлементарныйВопрос);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ОтветНаВопрос(ОтветСтрокой, МассивОтветов)
	
	Для Каждого Ответ Из МассивОтветов Цикл
		Если Ответ.Наименование = ОтветСтрокой Тогда
			Возврат Ответ;
		КонецЕсли;
	КонецЦикла;
	Возврат Справочники.ВариантыОтветовАнкет.ПустаяСсылка();
	
КонецФункции

// Копирует шаблон анкеты, соответствующий определенному этапу работы.
// Функция вызывается при создании нового объекта копированием. При этом шаблоны анкеты копируемого объекта должны
// заменяться на аналогичные новые шаблоны.
//
// Параметры 
//	ЭлементКопирования - СправочникСсылка.ШаблоныАнкет - копируемый шаблон анкеты. 
//	ЭтапРаботы - СправочникСсылка.ЭтапыРаботыСКандидатами - этап, для которого копируется шаблон анкеты.
//	СоответствиеЗаписейНастроекВопросовДляСобеседования - Соответствие - соответствие настроек вопросам для собеседования.
//	Наименование - Строка - наименование нового элемента справочника, для которого копируется шаблон анкеты.
//	ИмяВладельца - Строка - имя справочника, для которого копируется шаблон анкеты.
//
// ВозвращаемоеЗначение:
//   СправочникСсылка.ШаблоныАнкет - ссылка на новый шаблон анкеты.
//
Функция КопияШаблонаАнкеты(ЭлементКопирования, ЭтапРаботы, СоответствиеЗаписейНастроекВопросовДляСобеседования, Наименование, ИмяВладельца)
	
	ШаблонАнкетыОбъект = Справочники.ШаблоныАнкет.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(ШаблонАнкетыОбъект, ЭлементКопирования, "ПометкаУдаления, Наименование, Заголовок, Вступление, Заключение");
	ШаблонАнкетыОбъект.Наименование = Наименование + " / " + ЭтапРаботы.Наименование;
	ШаблонАнкетыОбъект.Заголовок = ШаблонАнкетыОбъект.Наименование;
	ШаблонАнкетыОбъект.УстановитьСсылкуНового(Справочники.ШаблоныАнкет.ПолучитьСсылку());
	ШаблонАнкетыОбъект.РедактированиеШаблонаЗавершено = Ложь;
	ШаблонАнкетыОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.ШаблонАнкеты = &ШаблонАнкеты";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Вакансии", ИмяВладельца);
	Запрос.УстановитьПараметр("ШаблонАнкеты", ЭлементКопирования);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтарыйОбъект = Выборка.Ссылка;
	Иначе
		СтарыйОбъект = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыШаблонаАнкеты.Ссылка КАК Ссылка,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования,
		|	ВопросыШаблонаАнкеты.ЭлементарныйВопрос
		|ПОМЕСТИТЬ ВТВопросы
		|ИЗ
		|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК ВопросыДляСобеседованияВопросовШаблоновАнкет
		|		ПО ВопросыШаблонаАнкеты.Ссылка = ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты
		|ГДЕ
		|	ВопросыШаблонаАнкеты.Владелец = &ШаблонАнкеты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вопросы.Ссылка КАК Ссылка,
		|	Вопросы.Ссылка.Владелец КАК Владелец,
		|	Вопросы.Ссылка.Родитель КАК Родитель,
		|	Вопросы.Ссылка.ЭтоГруппа КАК ЭтоГруппа,
		|	Вопросы.Ссылка.Код КАК Код,
		|	Вопросы.Ссылка.Наименование КАК Наименование,
		|	Вопросы.Ссылка.Формулировка КАК Формулировка,
		|	Вопросы.Ссылка.Обязательный КАК Обязательный,
		|	Вопросы.Ссылка.ТипВопроса КАК ТипВопроса,
		|	Вопросы.Ссылка.ТипТабличногоВопроса КАК ТипТабличногоВопроса,
		|	Вопросы.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	Вопросы.Ссылка.РодительВопрос КАК РодительВопрос,
		|	Вопросы.Ссылка.Заметки КАК Заметки,
		|	Вопросы.Ссылка.Подсказка КАК Подсказка,
		|	Вопросы.Ссылка.СпособОтображенияПодсказки КАК СпособОтображенияПодсказки,
		|	Вопросы.Ссылка.СоставТабличногоВопроса.(
		|		ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК СоставТабличногоВопроса,
		|	Вопросы.Ссылка.ПредопределенныеОтветы.(
		|		ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|		Ответ КАК Ответ,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК ПредопределенныеОтветы,
		|	Вопросы.Ссылка.СоставКомплексногоВопроса.(
		|		ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК СоставКомплексногоВопроса,
		|	Вопросы.ВопросДляСобеседования
		|ИЗ
		|	ВТВопросы КАК Вопросы
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка ИЕРАРХИЯ,
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопрос,
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.Балл,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопросВопросаДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопросВопросаДляСобеседования
		|ИЗ
		|	ВТВопросы КАК Вопросы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ПО (ВЫБОР
		|				КОГДА Вопросы.ВопросДляСобеседования ЕСТЬ NULL 
		|					ТОГДА НастройкаВопросовДляСобеседования.ВопросДляСобеседования = ЗНАЧЕНИЕ(Справочник.ВопросыДляСобеседования.ПустаяСсылка)
		|							И Вопросы.ЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос
		|				ИНАЧЕ Вопросы.ВопросДляСобеседования = НастройкаВопросовДляСобеседования.ВопросДляСобеседования
		|			КОНЕЦ)
		|			И (НастройкаВопросовДляСобеседования.Объект = &Объект)
		|
		|СГРУППИРОВАТЬ ПО
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопрос,
		|	НастройкаВопросовДляСобеседования.ЗначениеХарактеристики,
		|	НастройкаВопросовДляСобеседования.ВопросДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопрос,
		|	НастройкаВопросовДляСобеседования.Балл,
		|	НастройкаВопросовДляСобеседования.ЭлементарныйВопросВопросаДляСобеседования,
		|	НастройкаВопросовДляСобеседования.ОтветНаВопросВопросаДляСобеседования";
	
	Запрос.УстановитьПараметр("ШаблонАнкеты", ЭлементКопирования);
	Запрос.УстановитьПараметр("Объект", СтарыйОбъект);
	
	Результаты = Запрос.ВыполнитьПакет();
	Если Результаты[1].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	НастройкаВопросовДляСобеседования = Результаты[2].Выгрузить();
	
	ДобавитьЭлементыСправочникаВопросыШаблонаАнкеты(ШаблонАнкетыОбъект.Ссылка, Выборка, НастройкаВопросовДляСобеседования, СоответствиеЗаписейНастроекВопросовДляСобеседования);
	
	Возврат ШаблонАнкетыОбъект.Ссылка;
	
КонецФункции

Процедура ДобавитьЭлементыСправочникаВопросыШаблонаАнкеты(Ссылка, Выборка, НастройкаВопросовДляСобеседования, СоответствиеЗаписейНастроекВопросовДляСобеседования, Родитель = Неопределено)
	
	ВопросыСУсловием = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			
			НовыйЭлемент = Справочники.ВопросыШаблонаАнкеты.СоздатьГруппу();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, Выборка, "Наименование, Код, Формулировка");
			
		Иначе
			
			НовыйЭлемент = Справочники.ВопросыШаблонаАнкеты.СоздатьЭлемент();
			
			СсылкаНового = Справочники.ВопросыШаблонаАнкеты.ПолучитьСсылку();
			НовыйЭлемент.УстановитьСсылкуНового(СсылкаНового);
			
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, Выборка,, "Владелец, Родитель, СоставТабличногоВопроса, ПредопределенныеОтветы, Код, РодительВопрос");
			СоставТабличногоВопроса = Выборка.СоставТабличногоВопроса.Выгрузить();
			СоставТабличногоВопроса.Сортировать("НомерСтроки Возр");
			НовыйЭлемент.СоставТабличногоВопроса.Загрузить(СоставТабличногоВопроса);
			ПредопределенныеОтветы = Выборка.ПредопределенныеОтветы.Выгрузить();
			ПредопределенныеОтветы.Сортировать("НомерСтроки Возр");
			НовыйЭлемент.ПредопределенныеОтветы.Загрузить(ПредопределенныеОтветы);
			СоставКомплексногоВопроса = Выборка.СоставКомплексногоВопроса.Выгрузить();
			СоставКомплексногоВопроса.Сортировать("НомерСтроки Возр");
			НовыйЭлемент.СоставКомплексногоВопроса.Загрузить(СоставКомплексногоВопроса);
			
			Если Выборка.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.ВопросСУсловием Тогда
				ВопросыСУсловием.Вставить(Выборка.Ссылка, СсылкаНового);
			КонецЕсли;
			
			Если Не Выборка.РодительВопрос.Пустая() Тогда
				НовыйЭлемент.РодительВопрос = ВопросыСУсловием.Получить(Выборка.РодительВопрос);
			КонецЕсли;
			
		КонецЕсли;
		
		НовыйЭлемент.Владелец = Ссылка;
		НовыйЭлемент.Родитель = ?(Родитель = Неопределено, Справочники.ВопросыШаблонаАнкеты.ПустаяСсылка(), Родитель);
		НовыйЭлемент.Записать();
		
		Если ЗначениеЗаполнено(Выборка.ВопросДляСобеседования) Тогда
			
			// Запись вопросов для собеседования шаблонов анкет
			Запись = РегистрыСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет.СоздатьМенеджерЗаписи();
			Запись.ВопросШаблонаАнкеты = НовыйЭлемент.Ссылка;
			Запись.ВопросДляСобеседования = Выборка.ВопросДляСобеседования;
			Запись.Записать();
				
			// Запись настроек вопросов для собеседования
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ВопросДляСобеседования", Выборка.ВопросДляСобеседования);
			СтрокиНастройкаВопросовДляСобеседования = НастройкаВопросовДляСобеседования.НайтиСтроки(СтруктураПоиска);
			Если СтрокиНастройкаВопросовДляСобеседования.Количество() > 0 Тогда
				СоответствиеЗаписейНастроекВопросовДляСобеседования.Вставить(Выборка.ВопросДляСобеседования, СтрокиНастройкаВопросовДляСобеседования);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЭлементарныйВопрос) Тогда
			
			// Запись настроек вопросов для собеседования
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ВопросДляСобеседования", Справочники.ВопросыДляСобеседования.ПустаяСсылка());
			СтруктураПоиска.Вставить("ЭлементарныйВопрос", Выборка.ЭлементарныйВопрос);
			СтрокиНастройкаВопросовДляСобеседования = НастройкаВопросовДляСобеседования.НайтиСтроки(СтруктураПоиска);
			Если СтрокиНастройкаВопросовДляСобеседования.Количество() > 0 Тогда
				СоответствиеЗаписейНастроекВопросовДляСобеседования.Вставить(Выборка.ЭлементарныйВопрос, СтрокиНастройкаВопросовДляСобеседования);
			КонецЕсли;
			
		КонецЕсли;
		
		ПодчиненнаяВыборка = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если ПодчиненнаяВыборка.Количество() > 0 Тогда
			ДобавитьЭлементыСправочникаВопросыШаблонаАнкеты(Ссылка, ПодчиненнаяВыборка, НастройкаВопросовДляСобеседования, СоответствиеЗаписейНастроекВопросовДляСобеседования, НовыйЭлемент.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик фонового задания сохранения настроек шаблона анкеты и пересчета результатов анкетирования.
//
// Параметры 
//	Параметры - Структура - параметры фонового задания. 
//	АдресРезультата - Строка - адрес временного хранилища результатов работы фонового задания.
//
Процедура СохранитьНастройкиШаблонаАнкеты(Параметры, АдресРезультата) Экспорт
	
	НачатьТранзакцию();
	Попытка
		ОбновитьВопросыШаблонаАнкеты(Параметры);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьВопросыШаблонаАнкеты(Параметры)
	
	МассивАнкет = Параметры.МассивАнкет;
	
	ВопросыАнкеты = ВопросыШаблонаАнкеты(Параметры.ШаблонАнкеты);
	
	Если МассивАнкет.Количество() = 0 Тогда
		// Если нет ни одной анкеты, которую нужно обработать - удаляем вопросы сразу.
		// Если есть, то удалим после обработки.
		УдалитьВопросыАнкеты(ВопросыАнкеты);
	КонецЕсли;
	
	СоответствиеВопросов = Новый Соответствие;
	КодыРазделов = Новый Соответствие;
	
	ЗаписатьДеревоШаблонаАнкеты(Параметры, Параметры.ДеревоШаблонаАнкеты, СоответствиеВопросов, КодыРазделов, 1);
	ПерезаполнитьАнкеты(Параметры, МассивАнкет, СоответствиеВопросов);
	
	УдалитьВопросыАнкеты(ВопросыАнкеты);
	
	Если КодыРазделов <> Неопределено Тогда
		Для Каждого КодРаздела Из КодыРазделов Цикл
			ТекущийРаздел = КодРаздела.Ключ.ПолучитьОбъект();
			ТекущийРаздел.Код = КодРаздела.Значение;
			ТекущийРаздел.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Если Параметры.ТребуетсяПересчетАнкет Тогда
		ВыполнитьПересчетАнкет(Параметры.МассивАнкет);
	КонецЕсли;
	
КонецПроцедуры

Функция ВопросыШаблонаАнкеты(ШаблонАнкеты)
	
	ВопросыАнкеты = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ШаблонАнкеты);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыШаблонаАнкеты.Ссылка
		|ИЗ
		|	Справочник.ВопросыШаблонаАнкеты КАК ВопросыШаблонаАнкеты
		|ГДЕ
		|	ВопросыШаблонаАнкеты.Владелец = &Владелец";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВопросыАнкеты = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат ВопросыАнкеты;
	
КонецФункции

Процедура УдалитьВопросыАнкеты(ВопросыАнкеты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ВопросСсылка Из ВопросыАнкеты Цикл
		СправочникОбъект = ВопросСсылка.ПолучитьОбъект();
		Если СправочникОбъект <> Неопределено Тогда
			СправочникОбъект.Удалить();
		КонецЕсли;
	КонецЦикла;
		
	УстановитьПривилегированныйРежим(Ложь);
	
	ВопросыАнкеты.Очистить();
	
КонецПроцедуры

Процедура ЗаписатьДеревоШаблонаАнкеты(Параметры, СтрокаДереваРодитель, СоответствиеВопросов, КодыРазделов, УровеньРекурсии, СправочникРодитель = Неопределено)
	
	Счетчик = 0;
	
	// запишем новые
	Для каждого СтрокаДерева Из СтрокаДереваРодитель.Строки Цикл
		
		Счетчик = Счетчик + 1;
		СпрСсылка = ЭлементСправочникаВопросШаблонаАнкеты(Параметры, СтрокаДерева, СоответствиеВопросов, КодыРазделов, ?(УровеньРекурсии = 1, Счетчик, Неопределено), СправочникРодитель);
		
		Если СтрокаДерева.Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.ТипСтроки = "Раздел" Тогда
			ЗаписатьДеревоШаблонаАнкеты(Параметры, СтрокаДерева, СоответствиеВопросов, КодыРазделов, УровеньРекурсии+1, СпрСсылка);
		Иначе
			Для Каждого СтрокаПодчиненныйВопрос Из СтрокаДерева.Строки Цикл
				ЭлементСправочникаВопросШаблонаАнкеты(Параметры, СтрокаПодчиненныйВопрос, СоответствиеВопросов, КодыРазделов, Неопределено, СправочникРодитель, СпрСсылка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЭлементСправочникаВопросШаблонаАнкеты(Параметры, СтрокаДерева, СоответствиеВопросов, КодыРазделов, Код = Неопределено, СправочникРодитель = Неопределено, ВопросРодитель = Неопределено)
	
	Если СтрокаДерева.ТипСтроки = "Раздел" Тогда
		
		СпрОбъект = Справочники.ВопросыШаблонаАнкеты.СоздатьГруппу();
		
	Иначе
		
		// запись комментария
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ВопросДляСобеседования", СтрокаДерева.ВопросДляСобеседования);
		СтруктураОтбора.Вставить("Уровень", 2);
		Таблица = Параметры.Ответы.Скопировать(СтруктураОтбора, "ЭлементарныйВопрос, ТребуетсяКомментарий, ПояснениеКомментария");
		Таблица.Свернуть("ЭлементарныйВопрос, ТребуетсяКомментарий, ПояснениеКомментария");
		Для Каждого СтрокаТЗ Из Таблица Цикл
			ВопросОбъект = СтрокаТЗ.ЭлементарныйВопрос.ПолучитьОбъект();
			ЗаполнитьЗначенияСвойств(ВопросОбъект, СтрокаТЗ);
			ВопросОбъект.Записать();
		КонецЦикла; 
		
		СпрОбъект = Справочники.ВопросыШаблонаАнкеты.СоздатьЭлемент();
		СпрОбъект.РодительВопрос = ?(ВопросРодитель = Неопределено, Справочники.ВопросыШаблонаАнкеты.ПустаяСсылка(), ВопросРодитель);
		СпрОбъект.Подсказка = СтрокаДерева.Подсказка;
		СпрОбъект.СпособОтображенияПодсказки = СтрокаДерева.СпособОтображенияПодсказки;
			
		Если ТипЗнч(СтрокаДерева.ВопросДляСобеседования) = Тип("СправочникСсылка.ВопросыДляСобеседования") Тогда
			
			Если СтрокаДерева.ВопросДляСобеседования.ТипВопроса = Перечисления.ТипыВопросовПоМетодуСИвановой.Мотивация Тогда
				
				СпрОбъект.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный;
				СпрОбъект.Подсказка = НСтр("ru = 'Ответ вводить через кнопку ""Мотивация""'");
				Если ЗначениеЗаполнено(СтрокаДерева.ВопросДляСобеседования.Подсказка) Тогда
					СпрОбъект.Подсказка = СтрокаДерева.ВопросДляСобеседования.Подсказка + "
										  |" + СпрОбъект.Подсказка;
				КонецЕсли;
				СоставВопросаПоМотивации = СоставВопросаПоМотивации();
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СоставВопросаПоМотивации, СпрОбъект.СоставКомплексногоВопроса);
				
			Иначе
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ВопросДляСобеседования", СтрокаДерева.ВопросДляСобеседования);
				СтруктураОтбора.Вставить("Уровень", 1);
				СоставКомплексногоВопроса = Параметры.Ответы.Скопировать(СтруктураОтбора, "ЭлементарныйВопрос");
				СоставКомплексногоВопроса.Свернуть("ЭлементарныйВопрос");
				
				ДобавитьПроверкуОтказаОтвечать(СпрОбъект.СоставКомплексногоВопроса);
				
				Если СтрокаДерева.ВопросДляСобеседования.ТипВопроса = Перечисления.ТипыВопросовПоМетодуСИвановой.ТриПлюсаТриМинуса Тогда
					СпрОбъект.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный;
					СпрОбъект.ТипТабличногоВопроса = Перечисления.ТипыТабличныхВопросов.Составной;
					// вопрос "плюс" и "минус" должен отображаться в анкетах всегда
					СоставТабличногоВопросаПоУмолчанию = СоставТабличногоВопроса();
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СоставТабличногоВопросаПоУмолчанию, СпрОбъект.СоставКомплексногоВопроса);
				Иначе
					СпрОбъект.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Комплексный;
				КонецЕсли;
				
				 ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СоставКомплексногоВопроса, СпрОбъект.СоставКомплексногоВопроса);

			КонецЕсли;
			
		Иначе	
			// Характеристика
			СпрОбъект.ТипВопроса = Перечисления.ТипыВопросовШаблонаАнкеты.Простой;
			СпрОбъект.ЭлементарныйВопрос = СтрокаДерева.ЭлементарныйВопрос;
		КонецЕсли;
		
	КонецЕсли;
	
	НужноИзменитьКод = Ложь;
	Если Код <> Неопределено Тогда
		Если СправочникРодитель <> Неопределено Тогда
			СпрОбъект.Код = Код;
		ИначеЕсли КодыРазделов <> Неопределено Тогда
			НужноИзменитьКод = Истина;
		КонецЕсли;
	КонецЕсли;
	СпрОбъект.Наименование = СтрокаДерева.Наименование;
	СпрОбъект.Формулировка = СтрокаДерева.Формулировка;
	СпрОбъект.Родитель     = ?(СправочникРодитель = Неопределено, Справочники.ВопросыШаблонаАнкеты.ПустаяСсылка(), СправочникРодитель);
	СпрОбъект.Владелец     = Параметры.ШаблонАнкеты;
	
	СпрОбъект.Записать();
	Если ЗначениеЗаполнено(СтрокаДерева.ВопросШаблона) И СоответствиеВопросов <> Неопределено Тогда
		СоответствиеВопросов.Вставить(СтрокаДерева.ВопросШаблона, СпрОбъект.Ссылка);
	КонецЕсли;
	СтрокаДерева.ВопросШаблона = СпрОбъект.Ссылка;
	Если НужноИзменитьКод Тогда
		КодыРазделов.Вставить(СпрОбъект.Ссылка, Код);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаДерева.ВопросДляСобеседования) Тогда
		Возврат СпрОбъект.Ссылка;
	КонецЕсли;
	
	// Запись настроек вопросов для собеседования
	НаборЗаписей = РегистрыСведений.НастройкаВопросовДляСобеседования.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Параметры.Объект);
	Если ТипЗнч(СтрокаДерева.ВопросДляСобеседования) = Тип("СправочникСсылка.ВопросыДляСобеседования") Тогда
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ВопросДляСобеседования", СтрокаДерева.ВопросДляСобеседования);
		СоставКомплексногоВопроса = Параметры.Ответы.Скопировать(СтруктураОтбора);
		НаборЗаписей.Отбор.ВопросДляСобеседования.Установить(СтрокаДерева.ВопросДляСобеседования);
		ОбработатьСоставКомплексногоВопроса(СоставКомплексногоВопроса);
	Иначе
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ВопросДляСобеседования", Справочники.ВопросыДляСобеседования.ПустаяСсылка());
		СтруктураОтбора.Вставить("Характеристика", СтрокаДерева.ВопросДляСобеседования);
		СоставКомплексногоВопроса = Параметры.Ответы.Скопировать(СтруктураОтбора);
		НаборЗаписей.Отбор.ВопросДляСобеседования.Установить(Справочники.ВопросыДляСобеседования.ПустаяСсылка());
		НаборЗаписей.Отбор.ХарактеристикаПерсонала.Установить(СтрокаДерева.ВопросДляСобеседования);
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из СоставКомплексногоВопроса Цикл
		Запись = НаборЗаписей.Добавить();
		Запись.Объект = Параметры.Объект;
		Запись.ВопросДляСобеседования = СтрокаТаблицы.ВопросДляСобеседования;
		Запись.ЭлементарныйВопрос = СтрокаТаблицы.ЭлементарныйВопрос;
		Запись.ОтветНаВопрос = СтрокаТаблицы.ОтветНаВопрос;
		Запись.ХарактеристикаПерсонала = СтрокаТаблицы.Характеристика;
		Запись.ЗначениеХарактеристики = СтрокаТаблицы.Значение;
		Запись.Балл = СтрокаТаблицы.Балл;
		Запись.ЭлементарныйВопросВопросаДляСобеседования = СтрокаТаблицы.ЭлементарныйВопросВопросаДляСобеседования;
		Запись.ОтветНаВопросВопросаДляСобеседования = СтрокаТаблицы.ОтветНаВопросВопросаДляСобеседования;
		Запись.Подразделение = Параметры.Объект.Подразделение;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	Если ТипЗнч(СтрокаДерева.ВопросДляСобеседования) = Тип("СправочникСсылка.ВопросыДляСобеседования") Тогда
		// Запись вопросов для собеседования шаблонов анкет
		Запись = РегистрыСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет.СоздатьМенеджерЗаписи();
		Запись.ВопросШаблонаАнкеты = СпрОбъект.Ссылка;
		Запись.ВопросДляСобеседования = СтрокаДерева.ВопросДляСобеседования;
		Запись.Записать();
	КонецЕсли;
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

Функция СоставТабличногоВопроса()
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений;
	ВозвращаемоеЗначение.Колонки.Добавить("ЭлементарныйВопрос");
	
	ФормулировкиВопросов = Новый Массив;
	
	Родитель = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию("3+/3-", Истина, ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка());
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		РодительОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьГруппу();
		РодительОбъект.Наименование = "3+/3-";
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
	КонецЕсли;
	
	ФормулировкиВопросов.Добавить("Плюсы");
	ФормулировкиВопросов.Добавить("Минусы");
		
	Для каждого Формулировка Из ФормулировкиВопросов Цикл
		Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(Формулировка, Истина, Родитель);
		Если Не ЗначениеЗаполнено(Вопрос) Тогда
			ВопросОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
			ВопросОбъект.Родитель = Родитель;
			ВопросОбъект.Наименование = Формулировка;
			ВопросОбъект.Формулировка = Формулировка;
			ВопросОбъект.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Строка;
			ВопросОбъект.ТипЗначения = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150));
			ВопросОбъект.Длина = 150;
			ВопросОбъект.Записать();
			Вопрос = ВопросОбъект.Ссылка;
		КонецЕсли;
		НоваяСтрока = ВозвращаемоеЗначение.Добавить();
		НоваяСтрока.ЭлементарныйВопрос = Вопрос;
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ОбработатьСоставКомплексногоВопроса(СоставКомплексногоВопроса)
	
	УдалитьСтрокиУровня(СоставКомплексногоВопроса, 0);
	УдалитьСтрокиУровня(СоставКомплексногоВопроса, 1, Истина);
	УдалитьСтрокиУровня(СоставКомплексногоВопроса, 2, Истина);
	
КонецПроцедуры

Процедура УдалитьСтрокиУровня(Таблица, Уровень, СПроверкойВложенных = Ложь)
	
	Если СПроверкойВложенных Тогда
		
		МассивУдаления = Новый Массив;
		Для Каждого СтрокаТЗ Из Таблица Цикл
			Если СтрокаТЗ.Уровень <> Уровень Тогда 
				Продолжить;
			КонецЕсли;	
			СтруктураПоиска = Новый Структура(
				"ВопросДляСобеседования,
				|ЭлементарныйВопрос,
				|Уровень");
			Если Уровень = 2 Тогда
				СтруктураПоиска.Вставить("ОтветНаВопрос");
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТЗ);
			СтруктураПоиска.Уровень = Уровень+1;
			РезПоиска = Таблица.НайтиСтроки(СтруктураПоиска);
			Если РезПоиска.Количество()>0 Тогда
				МассивУдаления.Добавить(СтрокаТЗ);
			КонецЕсли; 
		КонецЦикла; 
			
	Иначе
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Уровень", Уровень);
		МассивУдаления = Таблица.НайтиСтроки(СтруктураПоиска);
		
	КонецЕсли; 
	
	Для Каждого ЭлМассива Из МассивУдаления Цикл
		Таблица.Удалить(ЭлМассива);
	КонецЦикла;
	
КонецПроцедуры 

Процедура ВыполнитьПересчетАнкет(МассивАнкет)
	
	Для Каждого Анкета Из МассивАнкет Цикл
		
		НаборЗаписейРегистра = РегистрыСведений.ОтветыНаВопросыАнкет.СоздатьНаборЗаписей();
		НаборЗаписейРегистра.Отбор.Регистратор.Установить(Анкета);
		НаборЗаписейРегистра.Прочитать();
		
		РассчитатьХарактеристикиКандидатов(НаборЗаписейРегистра, Ложь, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаВопросовСобеседования(ДеревоРасшифровки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты,
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросДляСобеседования.ТипВопроса КАК ТипВопросаПоМетодуСИвановой
		|ИЗ
		|	РегистрСведений.ВопросыДляСобеседованияВопросовШаблоновАнкет КАК ВопросыДляСобеседованияВопросовШаблоновАнкет
		|ГДЕ
		|	ВопросыДляСобеседованияВопросовШаблоновАнкет.ВопросШаблонаАнкеты В(&ВопросШаблонаАнкеты)";
	
	Запрос.УстановитьПараметр("ВопросШаблонаАнкеты", ДеревоРасшифровки.Строки.ВыгрузитьКолонку("Вопрос"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаОтветов(Вакансия, ЛичныеДанныеКандидата)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветыНаВопросыАнкет.Анкета КАК Анкета,
		|	ОтветыНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ОтветыНаВопросыАнкет.ЭлементарныйВопрос КАК ЭлементарныйВопрос,
		|	ПРЕДСТАВЛЕНИЕ(ОтветыНаВопросыАнкет.ЭлементарныйВопрос) КАК ЭлементарныйВопросПредставление,
		|	ОтветыНаВопросыАнкет.НомерЯчейки КАК НомерЯчейки,
		|	ОтветыНаВопросыАнкет.Ответ КАК Ответ,
		|	ОтветыНаВопросыАнкет.ОткрытыйОтвет КАК ОткрытыйОтвет,
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросыАнкет КАК ОтветыНаВопросыАнкет
		|		ПО АнкетыКандидатов.Анкета = ОтветыНаВопросыАнкет.Анкета
		|ГДЕ
		|	(АнкетыКандидатов.ЛичныеДанныеКандидата = &ЛичныеДанныеКандидата
		|	ИЛИ &ЛичныеДанныеКандидата = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка))
		|	И АнкетыКандидатов.Вакансия = &Вакансия";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидата", ЛичныеДанныеКандидата);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеАнкеты(Вакансия, ЭлементарныйВопрос, ХарактеристикаПерсонала, ЗначениеХарактеристики)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтветовАнкет.Ссылка КАК Ответ,
		|	НастройкаВопросов.ЗначениеХарактеристики КАК ЗначениеХарактеристики,
		|	ЕСТЬNULL(НастройкаВопросов.Балл, 0) КАК МаксимальныйБалл
		|ИЗ
		|	Справочник.ВариантыОтветовАнкет КАК ВариантыОтветовАнкет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросов
		|		ПО (НастройкаВопросов.ХарактеристикаПерсонала = &ХарактеристикаПерсонала)
		|			И (НастройкаВопросов.Объект = &Объект)
		|			И (НастройкаВопросов.ЗначениеХарактеристики = &ЗначениеХарактеристики
		|				ИЛИ &ЗначениеХарактеристики = НЕОПРЕДЕЛЕНО)
		|			И ВариантыОтветовАнкет.Ссылка = НастройкаВопросов.ОтветНаВопрос
		|ГДЕ
		|	ВариантыОтветовАнкет.Владелец = &Владелец
		|	И НЕ ВариантыОтветовАнкет.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", ЭлементарныйВопрос);
	Запрос.УстановитьПараметр("ХарактеристикаПерсонала", ХарактеристикаПерсонала);
	Запрос.УстановитьПараметр("ЗначениеХарактеристики", ЗначениеХарактеристики);
	Запрос.УстановитьПараметр("Объект", Вакансия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Процедура ПерезаполнитьАнкеты(Параметры, МассивАнкет, СоответствиеВопросов)
	
	СтарыеОтветы = Параметры.Ответы.Скопировать();
	Для Каждого Анкета Из МассивАнкет Цикл
		Если Анкета.Состав.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		УдаляемыеСтроки = Новый Массив;
		АнкетаОбъект = Анкета.ПолучитьОбъект();
		Для Каждого ТекущаяСтрока Из АнкетаОбъект.Состав Цикл
			НовыйВопрос = СоответствиеВопросов.Получить(ТекущаяСтрока.Вопрос);
			Если ЗначениеЗаполнено(НовыйВопрос) Тогда
				ТекущаяСтрока.Вопрос = НовыйВопрос;
				СтруктураПоиска = Новый Структура;
				СтруктураПоиска.Вставить("СтарыйЭлементарныйВопрос", ТекущаяСтрока.ЭлементарныйВопрос);
				СтруктураПоиска.Вставить("СтарыйОтветНаВопрос", ТекущаяСтрока.Ответ);
				СтрокиЗамены = СтарыеОтветы.НайтиСтроки(СтруктураПоиска);
				Если СтрокиЗамены.Количество() > 0 Тогда
					ТекущаяСтрока.ЭлементарныйВопрос = СтрокиЗамены[0].ЭлементарныйВопрос;
					ТекущаяСтрока.Ответ = СтрокиЗамены[0].ОтветНаВопрос;
				КонецЕсли;
			Иначе
				УдаляемыеСтроки.Добавить(ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			АнкетаОбъект.Состав.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		АнкетаОбъект.ОбменДанными.Загрузка = Истина;
		АнкетаОбъект.Записать();
		
		Если АнкетаОбъект.Проведен Тогда
			ПерезаполнитьОтветы(АнкетаОбъект);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПерезаполнитьОтветы(Анкета)
	
	УстановитьПривилегированныйРежим(Истина);
	ОтветыНаВопросыАнкет = Анкета.Движения.ОтветыНаВопросыАнкет;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаСостав.Вопрос,
		|	ТаблицаСостав.ЭлементарныйВопрос,
		|	ТаблицаСостав.НомерЯчейки,
		|	ТаблицаСостав.Ответ,
		|	ТаблицаСостав.ОткрытыйОтвет,
		|	ТаблицаСостав.НомерСтроки
		|ПОМЕСТИТЬ Состав
		|ИЗ
		|	&ТаблицаСостав КАК ТаблицаСостав
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Состав.Вопрос,
		|	Состав.ЭлементарныйВопрос,
		|	Состав.НомерЯчейки,
		|	Состав.Ответ,
		|	Состав.ОткрытыйОтвет,
		|	ИСТИНА КАК Активность,
		|	&Ссылка КАК Регистратор,
		|	&Ссылка КАК Анкета,
		|	Состав.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Состав КАК Состав";
	
	Запрос.УстановитьПараметр("ТаблицаСостав", Анкета.Состав);
	Запрос.УстановитьПараметр("Ссылка", Анкета.Ссылка);
	
	ОтветыНаВопросыАнкет.Загрузить(Запрос.Выполнить().Выгрузить());
	ОтветыНаВопросыАнкет.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьМотивирующиеФразыВОтчет(ТаблицаОтчета, ТаблицаИтогов, Вакансия, ЛичныеДанныеКандидатов, Макет,
	ОбластьШапкиСтраниц)
	
	ОбластьМотивационныеФразыЗаголовок = Макет.ПолучитьОбласть("МотивирующиеФразыЗаголовок|КолонкиФормулировка");
	ОбластьМотивационныеФразыЗаголовокБаллы = Макет.ПолучитьОбласть("МотивирующиеФразыЗаголовок|Балл");
	Заголовок = Новый ТабличныйДокумент;
	Заголовок.Вывести(ОбластьМотивационныеФразыЗаголовок);	
	Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
		Заголовок.Присоединить(ОбластьМотивационныеФразыЗаголовокБаллы);
	КонецЦикла;
	ОбластьЗаголовка = Заголовок.Область(1, 1, 1, ТаблицаИтогов.Количество() + 11);
	ОбластьЗаголовка.Объединить();
	Заголовок.НачатьГруппуСтрок();
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПоМотивацииВАнкетахДополнительно.МотивирующаяФраза КАК МотивирующаяФраза,
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоМотивацииВАнкетахДополнительно КАК ДанныеПоМотивацииВАнкетахДополнительно
		|		ПО АнкетыКандидатов.Анкета = ДанныеПоМотивацииВАнкетахДополнительно.Анкета
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И (АнкетыКандидатов.ЛичныеДанныеКандидата В(&ЛичныеДанныеКандидатов))";
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	ТаблицаФраз = Запрос.Выполнить().Выгрузить();
	ОбластьМотивационныеФразы = Макет.ПолучитьОбласть("МотивирующаяФразаСтрока|КолонкиФормулировка");
	ОбластьМотивационныеФразыРезультат = Макет.ПолучитьОбласть("МотивирующаяФразаСтрока|Балл");
	Заголовок.Вывести(ОбластьМотивационныеФразы);
	Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата);;
		СтрокиФраз = ТаблицаФраз.НайтиСтроки(СтруктураПоиска);
		Фраза = "";
		Для Каждого СтрокаФразы Из СтрокиФраз Цикл
			Фраза = Фраза + ?(ЗначениеЗаполнено(Фраза), Символы.ПС, "") + СтрокаФразы.МотивирующаяФраза;
		КонецЦикла;
		ОбластьМотивационныеФразыРезультат.Параметры.Фраза = Фраза;
		Заголовок.Присоединить(ОбластьМотивационныеФразыРезультат);
	КонецЦикла;
	Заголовок.ЗакончитьГруппуСтрок();
	Если Не ТаблицаОтчета.ПроверитьВывод(Заголовок) Тогда
		ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
		ТаблицаОтчета.Вывести(ОбластьШапкиСтраниц);
	КонецЕсли;
	ТаблицаОтчета.Вывести(Заголовок);
	
КонецПроцедуры

Процедура ДобавитьМотиваторыВОтчет(ТаблицаОтчета, ТаблицаИтогов, Вакансия, ЛичныеДанныеКандидатов, Макет,
	ОбластьШапкиСтраниц)
	
	СписокМотиваторов = Новый Массив;
	СписокДемотиваторов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МотиваторыВАнкетах.Мотиватор КАК Мотиватор,
		|	МотиваторыВАнкетах.Количество КАК Количество,
		|	МотиваторыВАнкетах.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА МотиваторыВАнкетах.Мотиватор ССЫЛКА Справочник.Мотиваторы
		|			ТОГДА ""Мотиватор""
		|		ИНАЧЕ ""Демотиватор""
		|	КОНЕЦ КАК Группа,
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МотиваторыВАнкетах КАК МотиваторыВАнкетах
		|		ПО АнкетыКандидатов.Анкета = МотиваторыВАнкетах.Анкета
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И (АнкетыКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов))";
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	ТаблицаМотиваторов = Запрос.Выполнить().Выгрузить();
	Для Каждого ТекущаяСтрока Из ТаблицаМотиваторов Цикл
		Если ТекущаяСтрока.Группа = "Мотиватор" И СписокМотиваторов.Найти(ТекущаяСтрока.Мотиватор) = Неопределено Тогда
			СписокМотиваторов.Добавить(ТекущаяСтрока.Мотиватор);
		ИначеЕсли ТекущаяСтрока.Группа = "Демотиватор" И СписокДемотиваторов.Найти(ТекущаяСтрока.Мотиватор) = Неопределено Тогда
			СписокДемотиваторов.Добавить(ТекущаяСтрока.Мотиватор);
		КонецЕсли;
	КонецЦикла;
	ОбластьМотиваторыЗаголовок = Макет.ПолучитьОбласть("МотиваторыЗаголовок|КолонкиФормулировка");
	ОбластьМотиваторыЗаголовокБаллы = Макет.ПолучитьОбласть("МотиваторыЗаголовок|Балл");
	Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьМотиваторыЗаголовок) Тогда
		ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
		ТаблицаОтчета.Вывести(ОбластьШапкиСтраниц);
	КонецЕсли;
	Заголовок = Новый ТабличныйДокумент;
	Заголовок.Вывести(ОбластьМотиваторыЗаголовок);
	Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
		Заголовок.Присоединить(ОбластьМотиваторыЗаголовокБаллы);
	КонецЦикла;
	ОбластьЗаголовка = Заголовок.Область(1, 1, 1, ТаблицаИтогов.Количество() + 11);
	ОбластьЗаголовка.Объединить();
	ТаблицаОтчета.Вывести(Заголовок);
	ТаблицаОтчета.НачатьГруппуСтрок();
	ОбластьМотиваторы = Макет.ПолучитьОбласть("МотиваторыСтрока|КолонкиФормулировка");
	ОбластьМотиваторыОценка = Макет.ПолучитьОбласть("МотиваторыСтрока|Балл");
	Для Каждого Мотиватор Из СписокМотиваторов Цикл
		ОбластьМотиватора = Новый ТабличныйДокумент;
		ОбластьМотиваторы.Параметры.Мотиватор = Мотиватор;
		ОбластьМотиватора.Вывести(ОбластьМотиваторы);
		Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата);
			СтруктураПоиска.Вставить("Мотиватор", Мотиватор);
			СтрокиПоКандидату = ТаблицаМотиваторов.НайтиСтроки(СтруктураПоиска);
			Если СтрокиПоКандидату.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМотиваторыОценка.Параметры, СтрокиПоКандидату[0]);
			Иначе
				ОбластьМотиваторыОценка.Параметры.Количество = 0;
				ОбластьМотиваторыОценка.Параметры.Комментарий = "";
			КонецЕсли;
			ОбластьМотиватора.Присоединить(ОбластьМотиваторыОценка);
		КонецЦикла;
		Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьМотиватора) Тогда
			ТаблицаОтчета.ЗакончитьГруппуСтрок();
			ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
			ТаблицаОтчета.Вывести(ОбластьШапкиСтраниц);
			ТаблицаОтчета.Вывести(Заголовок);
			ТаблицаОтчета.НачатьГруппуСтрок();
		КонецЕсли;
		ТаблицаОтчета.Вывести(ОбластьМотиватора);
	КонецЦикла;
	ТаблицаОтчета.ЗакончитьГруппуСтрок();
	
	ОбластьДемотиваторыЗаголовок = Макет.ПолучитьОбласть("ДемотиваторыЗаголовок|КолонкиФормулировка");
	ОбластьДемотиваторыЗаголовокБаллы = Макет.ПолучитьОбласть("ДемотиваторыЗаголовок|Балл");
	Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьДемотиваторыЗаголовок) Тогда
		ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
		ТаблицаОтчета.Вывести(ОбластьШапкиСтраниц);
	КонецЕсли;
	Заголовок = Новый ТабличныйДокумент;
	Заголовок.Вывести(ОбластьДемотиваторыЗаголовок);
	Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
		Заголовок.Присоединить(ОбластьДемотиваторыЗаголовокБаллы);
	КонецЦикла;
	ОбластьЗаголовка = Заголовок.Область(1, 1, 1, ТаблицаИтогов.Количество() + 11);
	ОбластьЗаголовка.Объединить();
	ТаблицаОтчета.Вывести(Заголовок);
	ТаблицаОтчета.НачатьГруппуСтрок();
	ОбластьДемотиваторы = Макет.ПолучитьОбласть("МотиваторыСтрока|КолонкиФормулировка");
	ОбластьДемотиваторыОценка = Макет.ПолучитьОбласть("МотиваторыСтрока|Балл");
	Для Каждого Демотиватор Из СписокДемотиваторов Цикл
		ОбластьДемотиватора = Новый ТабличныйДокумент;
		ОбластьДемотиваторы.Параметры.Мотиватор = Демотиватор;
		ОбластьДемотиватора.Вывести(ОбластьДемотиваторы);
		Для Каждого ТекущаяСтрока Из ТаблицаИтогов Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ЛичныеДанныеКандидата", ТекущаяСтрока.ЛичныеДанныеКандидата);
			СтруктураПоиска.Вставить("Мотиватор", Демотиватор);
			СтрокиПоКандидату = ТаблицаМотиваторов.НайтиСтроки(СтруктураПоиска);
			Если СтрокиПоКандидату.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(ОбластьДемотиваторыОценка.Параметры, СтрокиПоКандидату[0]);
			Иначе
				ОбластьДемотиваторыОценка.Параметры.Количество = 0;
				ОбластьДемотиваторыОценка.Параметры.Комментарий = "";
			КонецЕсли;
			ОбластьДемотиватора.Присоединить(ОбластьДемотиваторыОценка);
		КонецЦикла;
		Если Не ТаблицаОтчета.ПроверитьВывод(ОбластьДемотиватора) Тогда
			ТаблицаОтчета.ЗакончитьГруппуСтрок();
			ТаблицаОтчета.ВывестиГоризонтальныйРазделительСтраниц();
			ТаблицаОтчета.Вывести(ОбластьШапкиСтраниц);
			ТаблицаОтчета.Вывести(Заголовок);
			ТаблицаОтчета.НачатьГруппуСтрок();
		КонецЕсли;
		ТаблицаОтчета.Вывести(ОбластьДемотиватора);
	КонецЦикла;
	ТаблицаОтчета.ЗакончитьГруппуСтрок();	
	
КонецПроцедуры

Функция СоставВопросаПоМотивации()
	
	ВозвращаемоеЗначение = Новый ТаблицаЗначений;
	ВозвращаемоеЗначение.Колонки.Добавить("ЭлементарныйВопрос");
	
	ФормулировкиВопросов = Новый Массив;
	
	НаименованиеВопроса = НСтр("ru = 'Мотивация'");
	Родитель = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(НаименованиеВопроса, Истина, ПланыВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка());
	Если Не ЗначениеЗаполнено(Родитель) Тогда
		РодительОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьГруппу();
		РодительОбъект.Наименование = НаименованиеВопроса;
		РодительОбъект.Записать();
		Родитель = РодительОбъект.Ссылка;
	КонецЕсли;
	
	НаименованиеВопроса = НСтр("ru = 'Ответ получен'");
	Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(НаименованиеВопроса, Истина, Родитель);
	Если Не ЗначениеЗаполнено(Вопрос) Тогда
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
		ВопросОбъект.Родитель = Родитель;
		ВопросОбъект.Наименование = НаименованиеВопроса;
		ВопросОбъект.Формулировка = НаименованиеВопроса;
		ВопросОбъект.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Булево;
		ВопросОбъект.ВидФлажка = Перечисления.ВидыФлажкаВАнкетах.Флажок;
		ВопросОбъект.Записать();
		Вопрос = ВопросОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока = ВозвращаемоеЗначение.Добавить();
	НоваяСтрока.ЭлементарныйВопрос = Вопрос;
	
	НаименованиеВопроса = НСтр("ru = 'Заметки по вопросу'");
	Вопрос = ПланыВидовХарактеристик.ВопросыДляАнкетирования.НайтиПоНаименованию(НаименованиеВопроса, Истина, Родитель);
	Если Не ЗначениеЗаполнено(Вопрос) Тогда
		ВопросОбъект = ПланыВидовХарактеристик.ВопросыДляАнкетирования.СоздатьЭлемент();
		ВопросОбъект.Родитель = Родитель;
		ВопросОбъект.Наименование = НаименованиеВопроса;
		ВопросОбъект.Формулировка = НаименованиеВопроса;
		ВопросОбъект.ТипОтвета = Перечисления.ТипыОтветовНаВопрос.Текст;
		ВопросОбъект.Записать();
		Вопрос = ВопросОбъект.Ссылка;
	КонецЕсли;
	НоваяСтрока = ВозвращаемоеЗначение.Добавить();
	НоваяСтрока.ЭлементарныйВопрос = Вопрос;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.Мотиваторы.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
