#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФормуДокументовИзмененияШтатногоРасписания(Форма, ПутьКДаннымДатаВступленияВСилу) Экспорт

	Если Не МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;

	Элементы = Форма.Элементы;

	Если Элементы.Найти("ГруппаСоответствиеМестВСтруктуреПредприятия") = Неопределено Тогда

		ЭлементГруппаСоответствие = Элементы.Добавить("ГруппаСоответствиеМестВСтруктуреПредприятия", Тип(
			"ГруппаФормы"));
		ЭлементГруппаСоответствие.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаСоответствие.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементГруппаСоответствие.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЭлементГруппаСоответствие.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаСоответствие.РастягиватьПоГоризонтали = Истина;
		
		Элементы.Переместить(ЭлементГруппаСоответствие, Форма, Элементы.Шапка);
		
	КонецЕсли;

	Если Элементы.Найти("ДекорацияСообщенияСоответствиеМестВСтруктуреПредприятия") = Неопределено Тогда
		ПолеСоответствиеГрейдуДекорация = Элементы.Добавить("ДекорацияСообщенияСоответствиеМестВСтруктуреПредприятия",
			Тип("ДекорацияФормы"), Элементы.ГруппаСоответствиеМестВСтруктуреПредприятия);
		ПолеСоответствиеГрейдуДекорация.Вид = ВидДекорацииФормы.Картинка;
		ПолеСоответствиеГрейдуДекорация.Картинка = БиблиотекаКартинок.Предупреждение;
		ПолеСоответствиеГрейдуДекорация.Заголовок = НСтр(
			"ru = 'Декорация о несоответствии места штатного расписания в структуре предприятия'");
	КонецЕсли;

	Если Элементы.Найти("ДекорацияНадписьСообщенияСоответствиеМестВСтруктуреПредприятия") = Неопределено Тогда
		ПолеСоответствиеГрейдуДекорация = Элементы.Добавить(
			"ДекорацияНадписьСообщенияСоответствиеМестВСтруктуреПредприятия", Тип("ДекорацияФормы"),
			Элементы.ГруппаСоответствиеМестВСтруктуреПредприятия);
		ПолеСоответствиеГрейдуДекорация.Вид = ВидДекорацииФормы.Надпись;
		ПолеСоответствиеГрейдуДекорация.АвтоМаксимальнаяШирина = Ложь;
		ПолеСоответствиеГрейдуДекорация.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		ПолеСоответствиеГрейдуДекорация.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	КонецЕсли;

	УстановитьСоответствиеМестВСтруктуреПредприятия(Форма, ПутьКДаннымДатаВступленияВСилу);

КонецПроцедуры

Процедура УстановитьСоответствиеМестВСтруктуреПредприятия(Форма, ПутьКДаннымДатаВступленияВСилу) Экспорт
	
	Если Не МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ИспользоватьДокументИзмененияМестаПозицииВСтруктуреПредприятия() Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ТолькоПросмотр Или Не Форма.Объект.Проведен Тогда

		Форма.Элементы.ГруппаСоответствиеМестВСтруктуреПредприятия.Видимость = Ложь;

	Иначе
		
		Позиции = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.Позиции");
		ДатаВступленияВСилу = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,
			ПутьКДаннымДатаВступленияВСилу);

		РезультатПроверки = МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ПроверитьСоответствиеМестВСтруктуреПредприятия(
			Позиции.Выгрузить(), ДатаВступленияВСилу);

		Если РезультатПроверки.ЕстьРасхождения 
			И РезультатПроверки.Позиции.Количество() > 0 Тогда

			ДанныеПозиции = РезультатПроверки.Позиции[0];

			СодержимоеЗаголовка = Новый Массив;
			СодержимоеЗаголовка.Добавить(НСтр("ru='Установленные места позиций в структуре предприятия не соответствуют актуальным.
											  |См'") + ". ");

			Если ЗначениеЗаполнено(ДанныеПозиции.Регистратор) Тогда
				СодержимоеЗаголовка.Добавить(Новый ФорматированнаяСтрока(Строка(
					ДанныеПозиции.РегистраторПредставление), , , , ПолучитьНавигационнуюСсылку(
					ДанныеПозиции.Регистратор)));
				СодержимоеЗаголовка.Добавить(", ");
			КонецЕсли;

			СодержимоеЗаголовка.Добавить(СтрШаблон(НСтр("ru='позиция - ""%1"".'"), ДанныеПозиции.Позиция));

			ЗаголовокДекорации = Новый ФорматированнаяСтрока(СодержимоеЗаголовка);

			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Форма.Элементы, "ДекорацияНадписьСообщенияСоответствиеМестВСтруктуреПредприятия", "Заголовок",
				ЗаголовокДекорации);

		КонецЕсли;

		Форма.Элементы.ГруппаСоответствиеМестВСтруктуреПредприятия.Видимость = РезультатПроверки.ЕстьРасхождения;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
