#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Значение(ИмяНастройки) Экспорт
	
	РеквизитРегистра = Метаданные.РегистрыСведений.НастройкиЭлектронныхКурсов.Ресурсы.Найти(ИмяНастройки);
		
	Если РеквизитРегистра = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Ошибочное имя настроек электронного обучения'");
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.НастройкиЭлектронныхКурсов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат РеквизитРегистра.Тип.ПривестиЗначение(Неопределено);	
	КонецЕсли;
	
	Возврат НаборЗаписей[0][ИмяНастройки];
		
КонецФункции

Процедура Сохранить(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НастройкиЭлектронныхКурсов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	
	МенеджерЗаписи[ИмяНастройки] = ЗначениеНастройки;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли