// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Настройки кадровых решений.
// 
// Возвращаемое значение:
//  Структура - Настройки кадровых решений:
Функция Настройки() Экспорт
	Запись = СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Запись, Метаданные.РегистрыСведений.НастройкиКадровыхРешений);
КонецФункции

// Установить настройки кадровых решений.
// 
// Параметры:
//  Настройки - см. Настройки
Процедура УстановитьНастройки(Настройки) Экспорт

	Набор = СоздатьНаборЗаписей();
	ЗаполнитьЗначенияСвойств(Набор.Добавить(), Настройки);
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.НастройкиКадровыхРешений.ПолноеИмя());
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Набор.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
