#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Подразделение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Позиции по подразделениям.
// 
// Параметры:
//  Подразделения - Массив из СправочникСсылка.СтруктураПредприятия
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - СправочникСсылка.СтруктураПредприятия
//    * Значение - СправочникСсылка.ШтатноеРасписание
Функция ПозицииПоПодразделениям(Подразделения) Экспорт 

	Соответствие = Новый Соответствие();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Подразделения", Подразделения);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Позиции.Подразделение КАК Подразделение,
		|	Позиции.ПозицияШтатногоРасписания КАК ПозицияРуководителя
		|ИЗ
		|	РегистрСведений.ПозицииРуководителейПодразделений КАК Позиции
		|ГДЕ
		|	Позиции.Подразделение В (&Подразделения)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Подразделение, Выборка.ПозицияРуководителя);
	КонецЦикла;
	
	Возврат Соответствие;

КонецФункции

#КонецОбласти

#КонецЕсли