#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Медицинское страхование";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Сотрудники(Прикрепление к программам медицинского страхования)", СтатистикаСотрудников());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Журнал = Метаданные.ЖурналыДокументов.МедицинскоеСтрахование;
	СтатистикаПоДокументам = СборСтатистики.СтандартныеПоказателиПоЖурналу(Журнал, НачалоПериода);
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоДокументам, ВидСтатистики);
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Родственники(Прикрепление к программам медицинского страхования)", СтатистикаРодственников(НачалоПериода));
	Статистика.Вставить("Расширения(Прикрепление к программам медицинского страхования)", СтатистикаРасширений(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаСотрудников()
	
	Родитель = Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования;
	Таблица = Родитель.ТабличныеЧасти.Сотрудники;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Сотрудник;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Сотрудников";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Прикрепление";
	ДанныеГруппировки.ПредставлениеГруппировки = "Прикреплений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаРодственников(НачалоПериода)
	
	Родитель = Метаданные.Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования;
	Таблица = Родитель.ТабличныеЧасти.Родственники;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Родственник;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Родственников";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ДатаПрикрепления;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ФизическоеЛицо;
	ДанныеГруппировки.ПредставлениеГруппировки = "Сотрудников";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаРасширений(НачалоПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасширенияПрограммСтрахованияРодственников.НомерСтроки) КАК Расширений
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК
		|		РасширенияПрограммСтрахованияРодственников
		|ГДЕ
		|	РасширенияПрограммСтрахованияРодственников.ДатаНачала > &НачалоПериода
		|	И РасширенияПрограммСтрахованияРодственников.ДатаНачала <= &КонецПериода
		|	И РасширенияПрограммСтрахованияРодственников.Ссылка.Проведен = ИСТИНА
		|	И РасширенияПрограммСтрахованияРодственников.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	ПоказателиСтатистики = Новый Структура;
	ПоказателиСтатистики.Вставить("Расширений", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Расширений")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти