#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВыделенныеКвотыНаДату");
	НастройкиВарианта.Включен = Ложь;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПланированиеКвотДляТрудоустройства");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЛокальныеНормативныеАкты");
	НастройкиВарианта.Включен = Ложь;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПланированиеКвотДляТрудоустройства");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВыделенныеКвоты");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьПланированиеКвотДляТрудоустройства");
	НастройкиВарианта.Описание = НСтр("ru = 'Размеры выделенных рабочих мест
		|для трудоустройства по квотам.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОтчетПоТрудоустройствуИнвалидов");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация о наличии созданных или выделенных рабочих местах
		|для трудоустройства инвалидов в соответствии с установленной
		|квотой для приема на работу инвалидов.'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализУчетаТрудоустройстваПоКвотам");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ корректности учета трудоустройства по квотам.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецЕсли
