#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	УстановитьОтобрПредопределенных = Истина;
	Если Параметры.Свойство("ПоказыватьТрудовыеФункцииДоговоровГПХ") Тогда
		Если Параметры.ПоказыватьТрудовыеФункцииДоговоровГПХ = Истина Тогда
			УстановитьОтобрПредопределенных = Ложь;
		КонецЕсли;
		Параметры.Отбор.Удалить("ПоказыватьТрудовыеФункцииДоговоровГПХ");
	КонецЕсли;
	
	Если УстановитьОтобрПредопределенных Тогда
		Параметры.Отбор.Вставить("Предопределенный", Ложь);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ВАрхиве") Тогда
		Параметры.Отбор.Вставить("ВАрхиве", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	ЗагрузитьКлассификатор();
	
КонецПроцедуры

Процедура ЗагрузитьКлассификатор() Экспорт
	
	ИменаПредопределенныхДанных = "ДГПХ,ДАВТ,ДОИП,ИЗЛД,ЛДПИ,ДГПХФЛНС,ДАВТФЛНС";
	НаименованияЭлементов = НаименованияПредопределенныхЭлементов();
	
	Для Каждого ИмяДанных Из СтрРазделить(ИменаПредопределенныхДанных, ",") Цикл
		
		Попытка
			СсылкаСправочника = ПредопределенноеЗначение("Справочник.ТрудовыеФункции." + ИмяДанных);
			ОбъектСправочника = СсылкаСправочника.ПолучитьОбъект();
		Исключение
			ОбъектСправочника = Справочники.ТрудовыеФункции.СоздатьЭлемент();
			ОбъектСправочника.ИмяПредопределенныхДанных = ИмяДанных;
		КонецПопытки;
		
		ОбъектСправочника.КодПрофессиональнойДеятельности = ИмяДанных;
		ОбъектСправочника.Наименование = НаименованияЭлементов.Получить(ИмяДанных);
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектСправочника);
		
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованияПредопределенныхЭлементов()
	
	НаименованияЭлементов = Новый Соответствие;
	НаименованияЭлементов.Вставить("ДГПХ", НСтр("ru = 'Договор (работы, услуги)'"));
	НаименованияЭлементов.Вставить("ДАВТ", НСтр("ru = 'Договор авторского заказа'"));
	НаименованияЭлементов.Вставить("ДОИП", НСтр("ru = 'Договор об отчуждении исключительного права на произведения науки, литературы, искусства'"));
	НаименованияЭлементов.Вставить("ИЗЛД", НСтр("ru = 'Издательский лицензионный договор'"));
	НаименованияЭлементов.Вставить("ЛДПИ", НСтр("ru = 'Лицензионный договор о предоставлении права использования произведения науки, литературы, искусства,'"));
	НаименованияЭлементов.Вставить("ДГПХФЛНС", НСтр("ru = 'Договор (работы, услуги), страхование от несчастных случаев'"));
	НаименованияЭлементов.Вставить("ДАВТФЛНС", НСтр("ru = 'Договор авторского заказа, страхование от несчастных случаев'"));
	
	Возврат НаименованияЭлементов;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли