#Область СлужебныеПроцедурыИФункции

// Обработчик подписки на события ЦепочкиДокументовОбработкаУдаленияПроведения.
// 
// Параметры:
//  Источник - ДокументОбъект.ПриостановлениеТрудовыхДоговоровКонтрактов
//  Отказ - Булево
Процедура ЦепочкиДокументовОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	Если Не ЦепочкиДокументов.ИспользоватьЦепочкиДокументов() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЦепочкиДокументов.ЕстьПодчиненныеДокументы(Источник.Ссылка) Тогда
		ТекстСоощения = СтрШаблон(НСтр("ru = 'По документу %1 введены замещения, отмена проведения невозможна.'"),
			Источник);
		ОбщегоНазначения.СообщитьПользователю(ТекстСоощения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
