
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Параметры.ВидКвоты) Тогда
		
		ОтборВидКвоты = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборВидКвоты.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКвоты");
		ОтборВидКвоты.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборВидКвоты.Использование = Истина;
		ОтборВидКвоты.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ОтборВидКвоты.ПравоеЗначение = Параметры.ВидКвоты;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не Копирование И Не Группа Тогда
		
		ОтборВидКвоты = Неопределено;
		
		Для Каждого ЭлементОтбораСписка Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбораСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидКвоты") Тогда
				ОтборВидКвоты = ЭлементОтбораСписка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтборВидКвоты <> Неопределено Тогда
			Если ОтборВидКвоты.Использование И ОтборВидКвоты.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
				
				ВидКвоты = ОтборВидКвоты.ПравоеЗначение;
				
				Отказ = Истина;
				
				ПараметрыСозданияВФорму = Новый Структура("ВидКвоты", ВидКвоты);
				ОткрытьФорму("Справочник.КатегорииСотрудниковТрудоустроенныхПоКвотам.ФормаОбъекта", Новый Структура("ДополнительныеПараметры", ПараметрыСозданияВФорму), ЭтотОбъект);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
