#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийКлючВарианта;
Перем ТекущийНаставник;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	НастройкиОтчета = КомпоновщикНастроек.Настройки;
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ДокументРезультат.Очистить();
	
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;
	
	Если ТекущийКлючВарианта = "ПодборНаставников" Тогда
		
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "ОграничитьСписокФизическихЛиц", Ложь);
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "СписокФизическихЛиц", Новый Массив);
		
		ПараметрВидКадровогоРезерва = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидКадровогоРезерва"));
		Если Не ПараметрВидКадровогоРезерва = Неопределено И Не ПараметрВидКадровогоРезерва.ИдентификаторПользовательскойНастройки = "" Тогда
			ПараметрВидКадровогоРезерва = ПользовательскиеНастройки.Элементы.Найти(ПараметрВидКадровогоРезерва.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда
			
			МодульКадровыйРезерв = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
			
			Если Не ПараметрВидКадровогоРезерва = Неопределено Тогда
				
				УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "ОграничитьСписокФизическихЛиц", ПараметрВидКадровогоРезерва.Использование);

				ВидКадровогоРезерва = ПараметрВидКадровогоРезерва.Значение;
				Если ЗначениеЗаполнено(ВидКадровогоРезерва) Тогда
					
					ПараметрыПолученияРезерва = Новый Структура("ВидРезерва", ВидКадровогоРезерва);
					ТекущийРезерв = МодульКадровыйРезерв.ТекущийРезерв(ПараметрыПолученияРезерва);
					ТекущийРезерв.Свернуть("УчастникКадровогоРезерва");
					
					СписокФизическихЛиц = Новый Массив;
					Для Каждого СтрокаРезерва Из ТекущийРезерв Цикл
						Если ТипЗнч(СтрокаРезерва.УчастникКадровогоРезерва) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
							СписокФизическихЛиц.Добавить(СтрокаРезерва.УчастникКадровогоРезерва);
						КонецЕсли;
					КонецЦикла;
					
					УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "СписокФизическихЛиц", СписокФизическихЛиц);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущийКлючВарианта = "ИсторияНаставничества" Тогда
		
		ПараметрПериодОтчета = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
		Если Не ПараметрПериодОтчета = Неопределено И Не ПараметрПериодОтчета.ИдентификаторПользовательскойНастройки = "" Тогда
			ПараметрПериодОтчета = ПользовательскиеНастройки.Элементы.Найти(ПараметрПериодОтчета.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если Не ПараметрПериодОтчета = Неопределено И ПараметрПериодОтчета.Использование И ТипЗнч(ПараметрПериодОтчета.Значение) = Тип("СтандартныйПериод") Тогда
			ПериодКадровыхДанных = ПараметрПериодОтчета.Значение.ДатаОкончания;
		Иначе
			ПериодКадровыхДанных = ТекущаяДатаСеанса();
		КонецЕсли;
		
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "ПериодКадровыхДанных", ПериодКадровыхДанных);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФукнции

Процедура УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, ИмяНастройки, Знач Значение)
	
	ПараметрыДанных = НастройкиОтчета.ПараметрыДанных;

	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяНастройки));
	Если ПараметрДанных = Неопределено Тогда
		Для Каждого ЭлементОтбора Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяНастройки) Тогда
				ПользовательскаяНастройка = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
				ПользовательскаяНастройка.Использование = Истина;
				ПользовательскаяНастройка.ПравоеЗначение = Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если СокрЛП(ПараметрДанных.ИдентификаторПользовательскойНастройки) = "" Тогда
			Если ТипЗнч(ПараметрДанных.Значение) = Тип("СписокЗначений") Тогда
				Если ТипЗнч(Значение) = Тип("Массив") Тогда
					ПараметрДанных.Использование = Истина;
					ПараметрДанных.Значение.ЗагрузитьЗначения(Значение);
				КонецЕсли;
			Иначе
				ПараметрДанных.Использование = Истина;
				ПараметрДанных.Значение = Значение;
			КонецЕсли;
		Иначе
			ПользовательскаяНастройка = ПользовательскиеНастройки.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
			Если ТипЗнч(ПользовательскаяНастройка.Значение) = Тип("СписокЗначений") Тогда
				Если ТипЗнч(Значение) = Тип("Массив") Тогда
					ПользовательскаяНастройка.Использование = Истина;
					ПользовательскаяНастройка.Значение.ЗагрузитьЗначения(Значение);
				КонецЕсли;
			Иначе
				ПользовательскаяНастройка.Использование = Истина;
				ПользовательскаяНастройка.Значение = Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьОтчет(КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ДополнительныеПоляПредставлений = КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников();
	
	Если ДополнительныеПоляПредставлений = Неопределено Тогда
		СоответствиеДополнительныхПолейПредставлениям = Неопределено;
	Иначе
		
		СоответствиеДополнительныхПолейПредставления = Новый Структура;
		СоответствиеДополнительныхПолейПредставления.Вставить("Представления_КадровыеДанныеСотрудников", ДополнительныеПоляПредставлений);
		
	КонецЕсли;
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(ЭтотОбъект, СоответствиеДополнительныхПолейПредставления);
	
	ПараметрыДанных = НовыеНастройкиКД.ПараметрыДанных;
	
	Если КлючВарианта = "ПодборНаставников" Тогда
		
		КадровыйРезервПоВидамДоступен = Ложь;
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда
			МодульКадровыйРезерв = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
			МодульКадровыйРезерв.ПроверитьИспользованиеКадровогоРезерваПоВидам(КадровыйРезервПоВидамДоступен);
		КонецЕсли;
		
		Если Не КадровыйРезервПоВидамДоступен Тогда

			ПараметрДанных = ЗарплатаКадрыОтчеты.ДобавитьПараметр(СхемаКомпоновкиДанных, "ВидКадровогоРезерва",,,Ложь, Истина);
			ПараметрДанных.ОграничениеИспользования = Истина;
			ПараметрДанных.ВключатьВДоступныеПоля = Ложь;

			ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидКадровогоРезерва"));
			
			Если Не ПараметрДанных = Неопределено И Не ПараметрДанных.ИдентификаторПользовательскойНастройки = "" Тогда
				ПользовательскаяНастройка = НовыеПользовательскиеНастройкиКД.Элементы.Найти(ПараметрДанных.ИдентификаторПользовательскойНастройки);
				Если Не ПользовательскаяНастройка = Неопределено Тогда
					НовыеПользовательскиеНастройкиКД.Элементы.Удалить(ПользовательскаяНастройка);
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПослеЗагрузкиНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
// Параметры:
//   Контекст - Произвольный
//   КлючСхемы - Строка
//   КлючВарианта - Строка, Неопределено
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ТекущийКлючВарианта = КлючВарианта;

	Если КлючСхемы <> КлючВарианта Тогда
		
		КлючСхемы = КлючВарианта;
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, ПолучитьМакет(КлючВарианта), КлючСхемы);
		НовыеНастройкиКД = СхемаКомпоновкиДанных.ВариантыНастроек[КлючВарианта].Настройки;
		ИнициализироватьОтчет(КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД);
		
	КонецЕсли;
	
КонецПроцедуры

//  Параметры:
//    ДополнительныеПараметры - Структура
//
Процедура ПослеЗагрузкиНастроекВКомпоновщик(ДополнительныеПараметры) Экспорт

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;

	Если ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("Наставник") Тогда
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "Наставник", ПользовательскиеНастройки.ДополнительныеСвойства.Наставник);
	КонецЕсли;
	
	Если ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ПериодОтчета") Тогда
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "ПериодОтчета", ПользовательскиеНастройки.ДополнительныеСвойства.ПериодОтчета);
	КонецЕсли;
	
	Если ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("УчастникПроцессаНаставничества") Тогда
		УстановитьНастройкуОтчета(НастройкиОтчета, ПользовательскиеНастройки, "УчастникПроцессаНаставничества", ПользовательскиеНастройки.ДополнительныеСвойства.УчастникПроцессаНаставничества);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли