
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриОбновленииИБЗаполнитьИзмерениеРабочееМесто");
	Методы.Вставить("УдалитьЛишниеЗаписиДляНепроведенныхЗаключений");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки,
		"МедицинскиеОсмотры");
КонецПроцедуры

#КонецОбласти

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

Процедура УдалитьЛишниеЗаписиДляНепроведенныхЗаключений(ПараметрыОбновления) Экспорт 
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МедицинскиеОсмотрыПоВреднымФакторам.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам КАК МедицинскиеОсмотрыПоВреднымФакторам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|		ПО (ЗаключениеМедицинскогоОсмотра.Ссылка = МедицинскиеОсмотрыПоВреднымФакторам.Регистратор)
		|			И (НЕ ЗаключениеМедицинскогоОсмотра.Проведен)";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = ОбновляемыеДанные.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбновлениеПодготовлено = ОбновлениеИБ.ПодготовитьОбновлениеДанных(ПараметрыОбновления, 
			"РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам.НаборЗаписей", "Регистратор", Выборка.Регистратор);
		Если Не ОбновлениеПодготовлено Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
															  
КонецПроцедуры

Процедура ПриОбновленииИБЗаполнитьИзмерениеРабочееМесто(ПараметрыОбновления) Экспорт 
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МедицинскиеОсмотрыПоВреднымФакторам.Регистратор КАК Регистратор,
		|	ЗаключениеМедицинскогоОсмотра.РабочееМесто КАК РабочееМесто
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам КАК МедицинскиеОсмотрыПоВреднымФакторам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаключениеМедицинскогоОсмотра КАК ЗаключениеМедицинскогоОсмотра
		|		ПО (ЗаключениеМедицинскогоОсмотра.Ссылка = МедицинскиеОсмотрыПоВреднымФакторам.Регистратор)
		|			И (МедицинскиеОсмотрыПоВреднымФакторам.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка))";
	
	ОбновляемыеДанные = ОбновлениеИБ.ВыполнитьЗапросПолученияОбновляемыхДанных(Запрос, ПараметрыОбновления);
	
	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Выборка = ОбновляемыеДанные.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбновлениеПодготовлено = ОбновлениеИБ.ПодготовитьОбновлениеДанных(ПараметрыОбновления, 
			"РегистрСведений.МедицинскиеОсмотрыПоВреднымФакторам.НаборЗаписей", "Регистратор", Выборка.Регистратор);
		Если Не ОбновлениеПодготовлено Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.МедицинскиеОсмотрыПоВреднымФакторам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.РабочееМесто = Выборка.РабочееМесто;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
															  
КонецПроцедуры

#КонецОбласти

#КонецЕсли
