#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Проводит документ по учетам. Если в параметре ВидыУчетов передано Неопределено, то документ проводится по всем учетам.
// Процедура вызывается из обработки проведения и может вызываться из вне.
// 
// Параметры:
//  ДокументСсылка	- ДокументСсылка.Премия - Ссылка на документ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения документа (оперативный, неоперативный)
//  Отказ 			- Булево - Признак отказа от выполнения проведения
//  ВидыУчетов 		- Строка - Список видов учета, по которым необходимо провести документ. Если параметр пустой или Неопределено, то документ проведется по всем учетам
//  Движения 		- Коллекция движений документа - Передается только при вызове из обработки проведения документа
//  Объект			- ДокументОбъект.Премия - Передается только при вызове из обработки проведения документа
//  ДополнительныеПараметры - Структура - Дополнительные параметры, необходимые для проведения документа.
//
Процедура ПровестиПоУчетам(ДокументСсылка, РежимПроведения, Отказ, ВидыУчетов = Неопределено, Движения = Неопределено, Объект = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПровестиПоУчетам(ДокументСсылка, РежимПроведения, Отказ, ВидыУчетов, Движения, Объект, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Сторнирует документ по учетам. Используется подсистемой исправления документов.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений исправляющего документа в которую будут добавлены сторно стоки.
//  Регистратор				 - ДокументСсылка				 - Документ регистратор исправления (документ исправление).
//  ИсправленныйДокумент	 - ДокументСсылка				 - Исправленный документ движения которого будут сторнированы.
//  СтруктураВидовУчета		 - Структура					 - Виды учета, по которым будет выполнено сторнирование исправленного документа.
//  					Состав полей см. в ПроведениеСервер.СтруктураВидовУчета().
//  ДополнительныеПараметры	 - Структура					 - Структура со свойствами:
//  					* ИсправлениеВТекущемПериоде - Булево - Истина когда исправление выполняется в периоде регистрации исправленного документа.
//						* ОтменаДокумента - Булево - Истина когда исправление вызвано документом СторнированиеНачислений.
//  					* ПериодРегистрации	- Дата - Период регистрации документа регистратора исправления.
// 
// Возвращаемое значение:
//  Булево - "Истина" если сторнирование выполнено этой функцией, "Ложь" если специальной процедуры не предусмотрено.
//
Функция СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Описание - возвращает описание разделов данных, которые содержит документ
// 
// Возвращаемое значение:
// 	Соответствие - описание разделов данных документов -
//	 *Ключ - Строка - имя раздела. Одно из значений структуры 
//		возвращаемой методом см. МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных
//   *Значение - см. МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных - описание раздела
//
Функция ОписаниеРазделовДанных() Экспорт
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульМногофункциональныеДокументыБЗККлиентСервер = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗККлиентСервер");
		ОписаниеРазделовДанных = МодульМногофункциональныеДокументыБЗККлиентСервер.ОписаниеРазделовДанных_Премия();
	КонецЕсли;
	
	Возврат ОписаниеРазделовДанных;
	
КонецФункции

// Описание - возвращает структуру со значениями по которым будут проверяться права на разделы документа
// 				 
// Параметры:
//  ДокументОбъект - ДокументОбъект.Премия, ДанныеФормыСтруктура - объект или данные формы, 
//					отображающие данные документа, для которого нужно получить данные
//
// Возвращаемое значение:
// 	Структура -  см. НовыйЗначенияДоступа - значения доступа по которым будут проверяться права на документ
//
Функция ЗначенияДоступа(ДокументОбъект) Экспорт
	
	ЗначенияДоступа = УправлениеДоступомБЗК.НовыйЗначенияДоступа();
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульМногофункциональныеДокументыБЗК = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗК");
		ЗначенияДоступа = МодульМногофункциональныеДокументыБЗК.ЗначенияДоступаПоСоставуДокумента(ДокументОбъект, ДокументОбъект.Организация);
	КонецЕсли;
	Возврат ЗначенияДоступа;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьДатыЗапрета");
	Методы.Вставить("ЗаполнитьИсходныеДанныеПерерасчетов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.Премия;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция ОписаниеТаблицРазовыхНачислений() Экспорт 
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицРазовыхНачислений();
	КонецЕсли;
	
КонецФункции

Функция СвойстваИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СвойстваИсправляемогоДокумента(ДокументСсылка);
	КонецЕсли;
	
КонецФункции

Функция ПараметрыИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ПараметрыИсправляемогоДокумента(ДокументСсылка);
	КонецЕсли;
	
КонецФункции

Функция ПараметрыСторнируемогоДокумента(ДокументСсылка) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат  МодульКонтракта().ПараметрыСторнируемогоДокумента(ДокументСсылка);
	КонецЕсли;
	
КонецФункции

Функция ОбъектЗаблокирован(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульКонтракта() Экспорт
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ДокументПремияБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ДокументПремияРасширенный");
	КонецЕсли;
	
КонецФункции

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Приказ о поощрении сотрудников (Т-11а).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаТ11";
	КомандаПечати.Идентификатор = "ПФ_MXL_Т11а";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о поощрении сотрудников (Т-11а)'");
	
	// Приказ о поощрении сотрудника (Т-11).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Отчет.ПечатнаяФормаТ11";
	КомандаПечати.Идентификатор = "ПФ_MXL_Т11";
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВсехПриказов", Истина);
	КомандаПечати.Представление = НСтр("ru = 'Приказы на каждого сотрудника в отдельности (Т-11)'");
	КомандаПечати.ДополнительныеПараметры.Вставить("РеквизитыДетализации", "РаботаСотрудник");
	
КонецПроцедуры	

Функция ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект);
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента) Экспорт
	
	ЗарплатаКадры.ЗаполнитьДатуЗапретаРедактированияСписочногоДокумента(ОбъектДокумента, "Начисления", "ДатаНачала");
	
КонецПроцедуры

Процедура ЗаполнитьДатыЗапрета(ПараметрыОбновления) Экспорт
	
	ОбновлениеВыполнено = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Премия.Ссылка КАК Ссылка,
		|	Премия.Дата КАК Дата
		|ИЗ
		|	Документ.Премия КАК Премия
		|ГДЕ
		|	Премия.ДатаЗапрета = ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Премия.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбновлениеВыполнено = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, Выборка.Ссылка.Метаданные().ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.Ссылка);
			МенеджерДокумента.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента);
			
			ОбъектДокумента.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбновлениеВыполнено);
	
КонецПроцедуры

Процедура ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНовогоДокумента

Функция ДанныеНовогоДокумента() Экспорт
	
	Возврат МодульКонтракта().ДанныеНовогоДокумента();
	
КонецФункции

#КонецОбласти

#Область Расчет

Процедура ЗаполнитьБазовыйПериод(Объект) Экспорт
	
	МодульКонтракта().ЗаполнитьБазовыйПериод(Объект);
	
КонецПроцедуры 

Функция ОписаниеТаблицыНачислений(ПравоНаЧтениеДокументаБезОграничений) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыНачислений(ПравоНаЧтениеДокументаБезОграничений);
	КонецЕсли;
	
КонецФункции

Функция ТребуетсяРасчетНалога(Знач ВидРасчета, Знач ПланируемаяДатаВыплаты) Экспорт
	
	ВозвращаемоеЗначение = УчетНДФЛ.ДоходыУчитываютсяТолькоПоДатеВыплаты(ПланируемаяДатаВыплаты);
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		ВозвращаемоеЗначение = МодульКонтракта().ТребуетсяРасчетНалога(ВидРасчета, ПланируемаяДатаВыплаты);
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

Функция ЗначенияДоступностиРегистрацииНачислений(ПраваНаДокумент) Экспорт
	
	ЗначенияДоступности = Новый Структура;
	ЗначенияДоступности.Вставить("РегистрацияНачисленийДоступна", ПраваНаДокумент.ПолныеПраваПоРолям);
	ЗначенияДоступности.Вставить("ОграниченияНаУровнеЗаписей", Новый ФиксированнаяСтруктура(ПраваНаДокумент.ОграниченияНаУровнеЗаписей));
	
	Возврат ЗначенияДоступности;
	
КонецФункции

Функция РассчитыватьРазовыеНачисленияВЦеломЗаПериод() Экспорт
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().РассчитыватьРазовыеНачисленияВЦеломЗаПериод();
	КонецЕсли;
КонецФункции

Функция ИсчислятьНалогПриОкончательномРасчете(Знач ОбязательныйРасчетНДФЛ, 
											Знач ОтложитьРасчетНалогаДоРасчетаЗарплатыВКонцеМесяца,
											Знач ПериодРегистрации,
											Знач ПорядокВыплаты) Экспорт
											
	Если УчетНДФЛ.ДоходыУчитываютсяТолькоПоДатеВыплаты(ПериодРегистрации) Тогда
		Возврат Ложь;
	Иначе
		Возврат Не ОбязательныйРасчетНДФЛ 
			И ОтложитьРасчетНалогаДоРасчетаЗарплатыВКонцеМесяца
			И ПорядокВыплаты <> Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
	КонецЕсли;
		
КонецФункции

Функция ОписаниеДокумента(ОбъектДокумента, ПараметрыРасчета) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеДокумента(ОбъектДокумента, ПараметрыРасчета);
	КонецЕсли;
	
КонецФункции

Функция СтруктураОписанияТаблицДляРаспределенияРезультата(РегистрацияНачисленийДоступна) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СтруктураОписанияТаблицДляРаспределенияРезультата(РегистрацияНачисленийДоступна);
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыПерерасчетов(ПравоНаЧтениеДокументаБезОграничений) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыПерерасчетов(ПравоНаЧтениеДокументаБезОграничений);
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыЗависимыеНачисления(ПравоНаЧтениеДокументаБезОграничений) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыЗависимыеНачисления(ПравоНаЧтениеДокументаБезОграничений);
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыУдержаний() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыУдержаний();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыНДФЛ() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыНДФЛ();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыКорректировкиВыплаты() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыКорректировкиВыплаты();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКонтролируемыеПоля() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ПолучитьКонтролируемыеПоля();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ДополнительнаяИнформация.Вставить("ТипДанныхОбъектаФормы", Метаданные.Документы.Премия);
	ЗарплатаКадры.ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли