#Область ОписаниеПеременных

&НаКлиенте
Перем ОтветПередЗакрытием;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКнопокПодключаемыеКоманды;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ПараметрыОтображенияМеток = УправлениеСвойствами.ПараметрыОтображенияМеток();
	ПараметрыОтображенияМеток.ИмяЭлементаДляРазмещенияМеток = "ГруппаМетки";
	ПараметрыОтображенияМеток.ВариантОтображенияМеток = Перечисления.ВариантыОтображенияМеток.Надпись;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("Объект", КандидатОбъект);
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("ПараметрыОтображенияМеток", ПараметрыОтображенияМеток);
	
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	УправлениеСвойствами.ЗаполнитьМеткиОбъекта(ЭтотОбъект, ЛичныеДанныеКандидата);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "ГруппаКнопокРаботаСФайлами";
	ПараметрыГиперссылки.Владелец = "КандидатОбъект.Ссылка"; 
	
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.УправлениеДоступом
	ЭтоНовыйОтклик = ЭтоНовыйОтклик();
	ПараметрыУправленияДоступом = УправлениеДоступом.ПараметрыПриСозданииФормыЗначенияДоступа();
	ПараметрыУправленияДоступом.Реквизит = "ЛичныеДанныеКандидата.ГруппаДоступа";
	ПараметрыУправленияДоступом.ТипЗначения = Тип("СправочникСсылка.ЛичныеДанныеКандидатов");
	ПараметрыУправленияДоступом.СозданиеНового = ЭтоНовыйОтклик Или Параметры.Ключ.Пустая();
	УправлениеДоступом.ПриСозданииФормыЗначенияДоступа(ЭтотОбъект, ПараметрыУправленияДоступом);
	
	// Для отклика не нужно автоматически заполнять группу доступа
	Если ЭтоНовыйОтклик И ЗначениеЗаполнено(ЛичныеДанныеКандидата.ГруппаДоступа) Тогда
		ЛичныеДанныеКандидата.ГруппаДоступа = Неопределено;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	РазмещеныНаФорме = Новый Соответствие;
	РазмещеныНаФорме.Вставить("АдресЛичныеДанныеКандидатов", Истина);
	РазмещеныНаФорме.Вставить("ТелефонЛичныеДанныеКандидатов", Истина);
	РазмещеныНаФорме.Вставить("EMailЛичныеДанныеКандидатов", Истина);
	РазмещеныНаФорме.Вставить("TelegramЛичныеДанныеКандидатов", Истина);
	РазмещеныНаФорме.Вставить("MAXЛичныеДанныеКандидатов", Истина);
	
	ДополнительныеПараметры = УправлениеКонтактнойИнформацией.ПараметрыКонтактнойИнформации();
	ДополнительныеПараметры.РазмещеныНаФорме = РазмещеныНаФорме;
	ДополнительныеПараметры.ИмяЭлементаДляРазмещения = "ГруппаДополнительнаяКонтактнаяИнформация";
	ДополнительныеПараметры.ПоложениеЗаголовкаКИ = ПоложениеЗаголовкаЭлементаФормы.Лево;
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, ЛичныеДанныеКандидата, ДополнительныеПараметры);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		ИзменитьОтображениеДополнительнойКонтактнойИнформации();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// Заполнение данных кандидата.
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьДанныеКандидата();
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
		И ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		ВыполнятьПроверкуОднофамильцев = Истина;
	КонецЕсли;
	
	// Подготовить оповещения взаимодействий.
	Взаимодействия.ПодготовитьОповещения(ЭтотОбъект, Параметры, Ложь);
	
	УстановитьУсловноеОформлениеТаблицыФормыОпытРаботы();
	
	ЗаполнитьИсториюВыбораВакансии();
	ЗаполнитьРезюме(ЭтотОбъект);
	УстановитьВидимостьTelegram(ЭтотОбъект);
	УстановитьВидимостьMAX(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.СоздатьКомандуНаставничествоВФорме(ЭтотОбъект, Элементы.ГруппаНаставничество, ВидКнопкиФормы.КнопкаКоманднойПанели);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, КандидатОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ЛичныеДанныеКандидата,
		"ГруппаДополнительнаяКонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	КандидатСсылка = ТекущийОбъект.Ссылка;
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПодборПерсоналаФормыКлиент.ЗаполненыДанныеИдентифицирующиеКандидата(ЭтотОбъект) Тогда
		ПроверитьУникальностьЛичныхДанныхКандидата(Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(КандидатСсылка);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ЛичныеДанные) Тогда
		ТекущийОбъект.ЛичныеДанные = ЛичныеДанныеКандидатаСсылка;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ЛичныеДанныеКандидата);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ЗаполнитьСвязанныеОбъектыКандидата(ТекущийОбъект, ПараметрыЗаписи);
	
	Если ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоОтклик", Истина);
	КонецЕсли;
	
	ЗаполнитьСреднийРейтинг(ТекущийОбъект);
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормы", Истина);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДляЗаписи", ДляЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если КомментарииУдалены Тогда
		ЗаписатьКомментарии();
		КомментарииУдалены = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(КандидатСсылка);
	КонецЕсли;
	
	РазблокироватьДанныеФормыДляРедактирования();
	РазблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	ПоказатьКомандуСоздатьКандидата();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, КандидатОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, ЛичныеДанныеКандидата, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ПроверитьПериодВТабличнойЧастиЛичныхДанныхКандидата(
		Метаданные.Справочники.ЛичныеДанныеКандидатов.ТабличныеЧасти.ОпытРаботы.Имя, Отказ);
	
	Если ИспользоватьОграничениеПоГруппамДоступа
		И ТекущийЭтап.ЭтапРаботы <> Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
		И Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ГруппаДоступа) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена группа доступа'"), ,
			"ЛичныеДанныеКандидата.ГруппаДоступа", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ФИО) И Не ЛичныеДанныеКандидата.ФИООтсутствует Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено ФИО кандидата'"), ,
			"ЛичныеДанныеКандидата.ФИО", , Отказ);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах") И
		Не ЗначениеЗаполнено(КандидатОбъект.ИсточникИнформации) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен источник информации о кандидате'"), ,
			"КандидатОбъект.ИсточникИнформации", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если КандидатОбъект.Ссылка.Пустая()
		Или ТекущийЭтап.ЭтапРаботы =
			ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика") Тогда
		// Проверить дубли.
		Если ВыполнятьПроверкуОднофамильцев Тогда
			ПодключитьОбработчикОжидания("ПроверитьОднофамильцев", 0.1, Истина);
		КонецЕсли;
	Иначе
		ПроверитьДоступностьКонтактов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		Если ИмяСобытия = "Запись_ИзменениеМеток" Тогда
			ОбновитьМетки();
		КонецЕсли;
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанныхКлиент.ОбработкаОповещенияФормы(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ИмяСобытия = "ИзмененыДанныеДополнительнойФормы" И Источник = ЭтотОбъект Тогда
		ПрочитатьДанныеИзХранилищаВФормуНаСервере(Параметр);
		СотрудникиКлиентСервер.УстановитьПризнакРедактированияДанныхВДополнительнойФорме(Параметр.ИмяФормы, ЭтотОбъект);
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		ЗаполнитьОбразованиеКвалификацию();
	ИначеЕсли ИмяСобытия = "Проведение_Анкета" Или ИмяСобытия = "Запись_Кандидаты" Тогда
		Прочитать();
	ИначеЕсли ИмяСобытия = "Запись_ПриемНаРаботу" Тогда
		ПрочитатьРаботуСКандидатом();
		УстановитьПанельСостояния();
	ИначеЕсли ИмяСобытия = "Запись_РешениеОПриемеНаРаботу" И СвойствоСтруктуры(Параметр, "Кандидат") = КандидатСсылка Тогда
		ПрочитатьРаботуСКандидатом();
		УстановитьПанельСостояния();
	КонецЕсли;
	
	Если ИмяСобытия = "ЗагруженаФотография" И Источник = ЭтотОбъект Тогда
		ЗавершитьВыборФотографии();
	КонецЕсли;
	
	Если ИмяСобытия = "ИзмененаВидеоконференция" Тогда
		ПрочитатьРаботуСКандидатом();
	КонецЕсли;
	
	Если ИмяСобытия = "ИзмененыНастройкиЛентыСобытий" Тогда
		ЗаполнитьЛентуСобытий();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_Кандидаты" Тогда
		ЗаполнитьДругиеОбращенияКандидата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработкаНавигационнойСсылкиТекущийЭтапЗапланировать(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиТекущийЭтапВыполнить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиТекущийЭтапПропустить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиТекущийЭтапПройти(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
	ОбработкаНавигационнойСсылкиУтвердить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	ОбработкаНавигационнойСсылкиОтклонить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
	ОбработкаНавигационнойСсылкиРешениеОПриемеНаРаботуВвести(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ФайлРезюме <> Неопределено Тогда
		ПараметрыЗаписи.Вставить("ФайлРезюмеДляЗагрузки", ФайлРезюме.ПолноеИмя);
	КонецЕсли;
	ФайлРезюме = Неопределено;
	
	ПараметрыЗаписи.Вставить("ЛичныеДанные", ЛичныеДанныеКандидатаСсылка);
	ПараметрыЗаписи.Вставить("Кандидат", КандидатСсылка);
	ВзаимодействияКлиент.ВзаимодействиеПредметПослеЗаписи(ЭтотОбъект, КандидатОбъект, ПараметрыЗаписи, "Кандидаты");
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ЛичныеДанныеКандидатаСсылка);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(КандидатСсылка, ПараметрыОповещения());
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы
		И ОтветПередЗакрытием <> Истина
		И ЗначениеЗаполнено(Комментарий) Тогда
		Отказ = Истина;
		КомментарийПередЗакрытиемВопрос();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФИОПриИзменении(Элемент) Экспорт
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
	ФИОПриИзмененииНаСервере();
	
	// Проверить дубли.
	ПроверитьОднофамильцев();
	
КонецПроцедуры

&НаКлиенте
Процедура ФИООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ФизическиеЛицаЗарплатаКадрыКлиент.ФИООбработкаВыбора(ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ФизическиеЛицаЗарплатаКадрыКлиент.ФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВакансияПриИзменении(Элемент)
	
	ТекущаяВакансия = КандидатОбъект.Вакансия;
	ЗаполнитьПоДаннымВакансии();
	ЗаполнитьНаименованиеПоДаннымКандидата();
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьМестоРожденияГражданство(ЛичныеДанныеКандидата, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура МестоРожденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачатьРедактированиеМестаРождения(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоСтранаПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьМестоРожденияГражданство(ЛичныеДанныеКандидата, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура НазваниеРезюмеПриИзменении(Элемент)
	
	ЗаполнитьНазваниеРезюме(КандидатОбъект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьВозрастПолСемейноеПоложение(ЛичныеДанныеКандидата, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьВозрастПолСемейноеПоложение(ЛичныеДанныеКандидата, Элементы); 
	
КонецПроцедуры

&НаКлиенте
Процедура СостоянияВБракеПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьВозрастПолСемейноеПоложение(ЛичныеДанныеКандидата, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДоступаПриИзменении(Элемент)
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ЗвездаНажатие(Элемент)
	
	Модифицированность = Истина;
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Элемент.Имя, "_");
	Рейтинг = Число(ЧастиИмени[2]);
	
	// В любом случае сбрасываем общий рейтинг.
	КандидатОбъект.Рейтинг = 0;
	
	// Устанавливаем индивидуальный рейтинг.
	СтрокаОценки = СтрокаИндивидуальнойОценки(КандидатОбъект.Оценки, ПользователиКлиент.АвторизованныйПользователь());
	Если СтрокаОценки = Неопределено Тогда
		СтрокаОценки = КандидатОбъект.Оценки.Добавить();
		СтрокаОценки.Пользователь = ПользователиКлиент.АвторизованныйПользователь();
		СтрокаОценки.ДатаОценки = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	СтрокаОценки.Оценка = Рейтинг;
	
	РассчитатьСреднийРейтинг(ЭтотОбъект);
	ОтобразитьРейтинг(ЭтотОбъект, Рейтинг);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаЛентаСобытий" Тогда
		ЗаполнитьЛентуСобытий();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаОценки" Тогда
		РассчитатьСреднийРейтинг(ЭтотОбъект);
		ЗаполнитьОценкуПоХарактеристикам();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаДругое" Тогда
		ЗаполнитьДругиеОбращенияКандидата();
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОценок(Команда)
	
	ПараметрыФормы = Новый Структура("Кандидат, Оценки");
	ПараметрыФормы.Кандидат = КандидатСсылка;
	ПараметрыФормы.Оценки = КандидатОбъект.Оценки;
	
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаОценок", ПараметрыФормы, , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТелефонНажатие(Элемент)
	Если ПустаяСтрока(КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов) Тогда
		ТекстПредупреждения = НСтр("ru = 'Для совершения звонка или отправки SMS требуется ввести номер телефона.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	НачатьЗвонокSMS();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПочтаНажатие(Элемент)
	Если ПустаяСтрока(КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов) Тогда
		ТекстПредупреждения = НСтр("ru = 'Чтобы написать письмо, требуется заполнить адрес электронной почты.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	НачатьНаписатьПисьмо();
КонецПроцедуры

&НаКлиенте
Процедура ОСебеПриИзменении(Элемент)
	ЗаполнитьКандидатОСебе(КандидатОбъект, Элементы);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Утвердить()
	
	Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано");
	НачатьПринятиеРешения(Решение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОтменитьЭтап(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияОтменитьЭтап", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьОтменуЭтапаРаботы(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗавершитьЭтап(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияЗавершитьЭтап", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден");
	НачатьУстановкуСостоянияЭтапаРаботы(СостояниеЭтапа, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапланироватьЭтап(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияЗапланироватьЭтап", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован");
	НачатьУстановкуСостоянияЭтапаРаботы(СостояниеЭтапа, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПропуститьЭтап(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияПропуститьЭтап", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пропущен");
	ТекущиеДанные.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
	НачатьУстановкуСостоянияЭтапаРаботы(СостояниеЭтапа, ТекущиеДанные, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПройтиИнтервью(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияПройтиИнтервью", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПрохождениеЭлектронногоИнтервьюЭтапаРаботы(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СоздатьРешениеОПриемеНаРаботу()
	
	НачатьВводНовогоРешенияОПриемеНаРаботу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьВерсию(Элемент)
	
	ДанныеВерсия = СтрЗаменить(Элемент.Имя, "ДекорацияТекстДобавлениеИнформации", "");
	ДанныеВерсия = СтрЗаменить(ДанныеВерсия, "ДекорацияТекстИзменениеИнформации", "");
	
	Данные = "";
	НомерВерсии = 1;
	Если СтрНайти(ДанныеВерсия, "Кандидат") <> 0 Тогда
		Данные = КандидатСсылка;
		НомерВерсии = Число(СтрЗаменить(ДанныеВерсия, "Кандидат", ""));
	КонецЕсли;
	
	Если СтрНайти(ДанныеВерсия, "ЛичныеДанные") <> 0 Тогда
		Данные = ЛичныеДанныеКандидатаСсылка;
		НомерВерсии = Число(СтрЗаменить(ДанныеВерсия, "ЛичныеДанные", ""));
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Данные, НомерВерсии", Данные, НомерВерсии);
	ОткрытьФорму("ФормаДанныхВерсииИсторииДанных", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьФайл(Элемент)
	
	НомерФайла = Число(СтрЗаменить(Элемент.Имя, "ДекорацияТекстЗагрузкаФайлов", ""));
	ДанныеФайла = ДанныеПрисоединенныхФайлов[НомерФайла].Значение;
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачатьИзменениеКомментария(Элемент)
	
	НомерКомментария = Число(СтрЗаменить(Элемент.Имя, "ДекорацияТекстКомментарий", ""));
	
	ПараметрыФормы = ПодборПерсоналаКлиентСервер.ПараметрыРедактированияКомментарияКандидата();
	
	СтрокиНабора = КомментарииКандидатовНаборЗаписей.НайтиСтроки(Новый Структура("ИсходныйНомерСтроки", НомерКомментария));
	Если СтрокиНабора.Количество() <> 0 Тогда
		СтрокаНабора = СтрокиНабора[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормы, СтрокаНабора);
	
	ДополнительныеПараметры = Новый Структура("НомерКомментария");
	ДополнительныеПараметры.НомерКомментария = НомерКомментария;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьИзменениеКомментария", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("РегистрСведений.КомментарииКандидатов.Форма.КомментарийКандидата", ПараметрыФормы, 
		ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьАнкету(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияОткрытьАнкету", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(КандидатОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.АнкетаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоФормаЗаполнения", Истина);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТекущиеДанные.АнкетаТолькоПросмотр);
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.АнкетаСсылка);
	ПараметрыФормы.Вставить("ВозможностьПредварительногоСохранения", Истина);
	ОткрытьФорму("Документ.Анкета.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПечатьАнкеты(Элемент)
	
	НомерЭтапа = Число(СтрЗаменить(Элемент.Имя, "ДекорацияПечатьАнкеты", ""));
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[НомерЭтапа];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронноеИнтервьюКлиент.ПечатьАнкеты(ТекущиеДанные.ШаблонАнкеты);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СообщениеОСогласииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "НовоеСогласие" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки);
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеЗаполнения = ЗащитаПерсональныхДанныхЗарплатаКадрыКлиент.НовыеДанныеДляЗаполненияСогласия();
	Если ЗначениеЗаполнено(КандидатОбъект.Вакансия) Тогда
		ДанныеЗаполнения.Организация = ОрганизацияВакансии(КандидатОбъект.Вакансия);
	КонецЕсли;
	ДанныеЗаполнения.Субъект = ЛичныеДанныеКандидатаСсылка;
	ДанныеЗаполнения.ДатаСогласия = КандидатОбъект.ДатаРегистрации;
	
	ЗащитаПерсональныхДанныхЗарплатаКадрыКлиент.ПриОбработкеНавигационнойСсылкиНовоеСогласие(
		НавигационнаяСсылкаФорматированнойСтроки, ДанныеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Наставничество(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничествоКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("НаставничествоКлиент");
		МодульНаставничествоКлиент.ОткрытьФормуНаставничество(ЭтотОбъект, КандидатСсылка);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(
		ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(
		ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	Если (Элемент = Элементы.КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов
			И Не ПустаяСтрока(КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов))
		Или (Элемент = Элементы.КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов
			И Не ПустаяСтрока(КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов)) Тогда
		ПроверитьОднофамильцев();
		ПроверкаНаДубли = Истина;
	ИначеЕсли Элемент = Элементы.КонтактнаяИнформацияПолеTelegramЛичныеДанныеКандидатов Тогда
		УстановитьВидимостьTelegram(ЭтотОбъект);
	ИначеЕсли Элемент = Элементы.КонтактнаяИнформацияПолеMAXЛичныеДанныеКандидатов Тогда
		УстановитьВидимостьMAX(ЭтотОбъект);
	КонецЕсли;
	
	ИменаСтатическихКонтактов = ИменаСтатическихКонтактов();
	Если ИменаСтатическихКонтактов.Найти(Элемент.Имя) = Неопределено Тогда
		ИзменитьОтображениеДополнительнойКонтактнойИнформации();
	Иначе
		ЗаполнитьКонтактнуюИнформацию(КонтактнаяИнформацияОписаниеДополнительныхРеквизитов, Элементы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, ЛичныеДанныеКандидата, Результат);
	ИзменитьОтображениеДополнительнойКонтактнойИнформации();
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтактнаяИнформация

&НаКлиенте
Процедура ОжидаемыйДоходПриИзменении(Элемент)
	
	ИсторияОжидаемогоДохода.Очистить();
	ОтобразитьОжидаемыйДоходПоУмолчанию(ЭтотОбъект);
	ПересчитыватьОжидаемыйДоход = Ложь;
	ЗаполнитьОжидаемыйДоход(КандидатОбъект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.ВалютаДохода) Тогда
		КандидатОбъект.ВалютаДохода = ЗарплатаКадрыВызовСервера.ВалютаУчетаЗаработнойПлаты();
	КонецЕсли;
	ОтобразитьОжидаемыйДоходПоУмолчанию(ЭтотОбъект); 
	ЗаполнитьОжидаемыйДоход(КандидатОбъект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьДоходаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.ПериодичностьДохода) Тогда
		КандидатОбъект.ПериодичностьДохода = ПредопределенноеЗначение("Перечисление.ПериодичностьОжидаемогоДоходаКандидатов.Месяц");
	КонецЕсли;
	ОтобразитьОжидаемыйДоходПоУмолчанию(ЭтотОбъект); 
	ЗаполнитьОжидаемыйДоход(КандидатОбъект, Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ПересчитыватьОжидаемыйДоход Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаемыйДоходВИстории = ОжидаемыйДоходВИстории(ВыбранноеЗначение, КандидатОбъект.ПериодичностьДохода);
	Если ОжидаемыйДоходВИстории <> Неопределено Тогда
		КандидатОбъект.ОжидаемыйДоход = ОжидаемыйДоходВИстории;
	Иначе
		ПодборПерсоналаКлиентСервер.РассчитатьДоходПоВалюте(
			КандидатОбъект.ОжидаемыйДоход, КандидатОбъект.ВалютаДохода, ВыбранноеЗначение);
		СохранитьОжидаемыйДоход(ЭтотОбъект, 
			КандидатОбъект.ОжидаемыйДоход, ВыбранноеЗначение, КандидатОбъект.ПериодичностьДохода);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьДоходаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ПересчитыватьОжидаемыйДоход Тогда
		Возврат;
	КонецЕсли;
	
	ОжидаемыйДоходВИстории = ОжидаемыйДоходВИстории(КандидатОбъект.ВалютаДохода, ВыбранноеЗначение);
	Если ОжидаемыйДоходВИстории <> Неопределено Тогда
		КандидатОбъект.ОжидаемыйДоход = ОжидаемыйДоходВИстории;
	Иначе
		ПодборПерсоналаКлиентСервер.РассчитатьДоходПоПериодичности(
			КандидатОбъект.ОжидаемыйДоход, КандидатОбъект.ПериодичностьДохода, ВыбранноеЗначение);
		СохранитьОжидаемыйДоход(ЭтотОбъект, 
			КандидатОбъект.ОжидаемыйДоход, КандидатОбъект.ВалютаДохода, ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФотографияНажатие(Элемент, СтандартнаяОбработка)
	СотрудникиКлиентРасширенный.ФизическиеЛицаАдресФотографииНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФИОИспользуетсяПриИзменении(Элемент)
	
	ПоказыватьПредупреждение = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("НастройкиПрограммы",
		"ПоказыватьПредупреждениеОПустомФИОКандидата", Истина);
	
	Если Не ФИОИспользуется И ПоказыватьПредупреждение Тогда
		
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.Информация32;
		ПараметрыВопроса.ТекстФлажка = НСтр("ru = 'Больше не предупреждать'");
		
		Кнопки = Новый СписокЗначений();
		Кнопки.Добавить(КодВозвратаДиалога.ОК);
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		Если ЗначениеЗаполнено(ЛичныеДанныеКандидата.ФИО) Тогда
			
			ПараметрыВопроса.Заголовок = НСтр("ru = 'Стереть данные?'");
			ТекстВопроса =
				НСтр("ru = 'Поле ""ФИО"" будет очищено,
				| а представление кандидата в списке будет формироваться автоматически.
				| После того как ФИО станет известно, измените положение переключателя.'");
			
		Иначе
			ПараметрыВопроса.Заголовок = НСтр("ru = 'Отсутствует ФИО?'");
			ТекстВопроса =
				НСтр("ru = 'Если в резюме кандидата нет ФИО, то его представление в списке будет формироваться автоматически.
				| После того как ФИО станет известно, измените положение переключателя.'");
		КонецЕсли;
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
			Новый ОписаниеОповещения("ФИОИспользуетсяПриИзмененииЗавершение", ЭтотОбъект),
				СтрЗаменить(ТекстВопроса, Символы.ПС, ""), Кнопки, ПараметрыВопроса);
				
	Иначе
		ФИОИспользуетсяПриИзмененииЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкаЛентыНажатие(Элемент)
	
	ОткрытьФорму("Справочник.Кандидаты.Форма.НастройкаЛентыСобытий",,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияПриИзменении(Элемент)
	
	ДанныеПозиции = ДанныеПозиции(КандидатОбъект.Позиция);
	КандидатОбъект.Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатовОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов = ВыбранноеЗначение.Представление;
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияАдрес", "Заголовок", ВыбранноеЗначение.Представление);
	
КонецПроцедуры

&НаКлиенте
Процедура TelegramНажатие(Элемент)
	
	КонтактнаяИнформацияБЗККлиент.ОбработчикДействияНаписатьTelegram(
		КонтактнаяИнформацияПолеTelegramЛичныеДанныеКандидатов);
	
КонецПроцедуры

&НаКлиенте
Процедура MAXНажатие(Элемент)
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(КонтактнаяИнформацияПолеMAXЛичныеДанныеКандидатов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛичныеДанныеКандидатаОбразование

&НаКлиенте
Процедура ЛичныеДанныеКандидатаОбразованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ЛичныеДанныеКандидатаОбразованиеПредставление Тогда
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОбОбразовании",
			"Образование", Элементы.ЛичныеДанныеКандидатаОбразование.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛичныеДанныеКандидатаОбразованиеПриИзменении(Элемент)
	
	ЗаполнитьПредставлениеОбразования();
	ОтредактироватьРезюме("Образование");
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛичныеДанныеКандидатаКурсы

&НаКлиенте
Процедура ЛичныеДанныеКандидатаКурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ЛичныеДанныеКандидатаКурсыПредставление Тогда
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОКурсе", "Курсы",
			Элементы.ЛичныеДанныеКандидатаКурсы.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛичныеДанныеКандидатаКурсыПриИзменении(Элемент)
	ЗаполнитьПредставлениеКурсов();
	ОтредактироватьРезюме("Курсы");
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛичныеДанныеКандидатаЗнаниеЯзыков

&НаКлиенте
Процедура ЛичныеДанныеКандидатаЗнаниеЯзыковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ЛичныеДанныеКандидатаЗнаниеЯзыковПредставление Тогда
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОЗнанииЯзыка",
			"ЗнаниеЯзыков", Элементы.ЛичныеДанныеКандидатаЗнаниеЯзыков.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛичныеДанныеКандидатаЗнаниеЯзыковПриИзменении(Элемент)
	
	ЗаполнитьПредставлениеЗнаниеЯзыков();
	ОтредактироватьРезюме("ЗнаниеЯзыков");
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЛичныеДанныеКандидатаУченыеСтепени

&НаКлиенте
Процедура ЛичныеДанныеКандидатаУченыеСтепениВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ЛичныеДанныеКандидатаУченыеСтепениПредставление Тогда
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиУченойСтепени",
			"УченыеСтепени", Элементы.ЛичныеДанныеКандидатаУченыеСтепени.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛичныеДанныеКандидатаУченыеСтепениПриИзменении(Элемент)
	ЗаполнитьПредставлениеУченыеСтепени();
	ОтредактироватьРезюме("УченыеСтепени");
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОпытРаботы

&НаКлиенте
Процедура ОпытРаботыПриИзменении(Элемент)
	
	ЗаполнитьПредставлениеОпытаРаботы();
	ОтредактироватьРезюме(Элемент.Имя);
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	ЗаполнитьНаименованиеПоДаннымКандидата();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЛичныеДанныеКандидата.ОпытРаботы.Сортировать("ДатаНачала Убыв");
	ОтредактироватьРезюме(Элемент.Имя);
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыКомпанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуКомпании();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыСфераДеятельностиКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуКомпании();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыОбязанностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МногострочныйЭлементНачалоВыбора("ОпытРаботы", "Обязанности", СтандартнаяОбработка, НСтр("ru = 'Обязанности'"));
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПредставлениеПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачала",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачалаПредставление", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачала",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачалаПредставление");
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачала",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаНачалаПредставление", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаНачалаПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПредставлениеПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончания",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончанияПредставление", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончания",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончанияПредставление");
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончания",
		"Элементы.ОпытРаботы.ТекущиеДанные.ДатаОкончанияПредставление", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПредставлениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОпытРаботыДатаОкончанияПредставлениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не КандидатОбъект.Ссылка.Пустая(),
		НСтр("ru = 'Отклонение возможно только после записи кандидата.'"));
	
	Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено");
	НачатьПринятиеРешения(Решение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРешение(Команда)
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не КандидатОбъект.Ссылка.Пустая(),
		НСтр("ru = 'Отменить решение возможно только после записи кандидата.'"));
	
	НачатьОтменуРешения();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКандидатов(Команда)
	
	ПараметрыСписка = Новый Структура("Отбор");
	ПараметрыСписка.Отбор = Новый Структура("ЛичныеДанные", КандидатОбъект.ЛичныеДанные);
	
	ОткрытьФорму("Справочник.Кандидаты.ФормаСписка", ПараметрыСписка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКандидата(Команда)
	
	ПодборПерсоналаКлиент.ОткрытьФормуНовогоКандидата(
		Новый Структура("ЛичныеДанныеКандидата", КандидатОбъект.ЛичныеДанные),,
		КандидатОбъект.ЛичныеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоСравнениюХарактеристик(Команда)
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Вакансия", КандидатОбъект.Вакансия);
	ОткрытьФорму("Обработка.СравнениеХарактеристикКандидатов.Форма", ПараметрыОткрытия,, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробныйОтчетПоХарактеристикам(Команда)
	
	Если КандидатОбъект.Ссылка.Пустая() Или Не ЗначениеЗаполнено(КандидатОбъект.Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Вакансия", КандидатОбъект.Вакансия);
	ПараметрыОткрытия.Вставить("Кандидат", КандидатОбъект.Ссылка);
	ОткрытьФорму("Отчет.СравнениеХарактеристикКандидатовПодробно.Форма", ПараметрыОткрытия,, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифроватьОценку(Команда)
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Кандидат", КандидатОбъект.Ссылка);
	ОткрытьФорму("Отчет.ОценкиКандидатаРасшифровка.Форма", ПараметрыОткрытия,, Новый УникальныйИдентификатор());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФотографию(Команда)
	НачатьВыборФотографии();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФотографию(Команда)
	
	Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	УдалитьИзВременногоХранилища(АдресФотографии);
	АдресФотографии = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКонтакты(Команда)
	
	ПоказатьВопросПоКонтактногоДоступа(КандидатОбъект.ИсточникИнформации, СкрытыеКонтактыПредставление);
	
КонецПроцедуры

&НаКлиенте
Процедура ОставитьКомментарий(Команда)
	
	Если ЗначениеЗаполнено(Комментарий) Тогда
		ОставитьКомментарийНаСервере();
	КонецЕсли;
	
	Комментарий = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСтаруюФормуОбъекта(Команда)
	
	Если Не КандидатОбъект.Ссылка.Пустая() И Не Модифицированность Тогда
		ОткрытьСтаруюФормуОбъекта();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОткрытьСтаруюФормуОбъектаПослеВопросаЗаписать", ЭтотОбъект);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

#Область КомандыРедактированияТабличныхЧастейЛичныхДанныхКандидата

&НаКлиенте
Процедура ОбразованиеДобавить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОбОбразовании",
		"Образование", ИдентификаторНовойСтроки());
КонецПроцедуры

&НаКлиенте
Процедура ОбразованиеИзменить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОбОбразовании",
		"Образование", Элементы.ЛичныеДанныеКандидатаОбразование.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура КурсыДобавить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОКурсе",
		"Курсы", ИдентификаторНовойСтроки());
КонецПроцедуры

&НаКлиенте
Процедура КурсыИзменить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОКурсе",
		"Курсы", Элементы.ЛичныеДанныеКандидатаКурсы.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЗнаниеЯзыковДобавить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОЗнанииЯзыка",
		"ЗнаниеЯзыков", ИдентификаторНовойСтроки());
КонецПроцедуры

&НаКлиенте
Процедура ЗнаниеЯзыковИзменить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиОЗнанииЯзыка",
		"ЗнаниеЯзыков", Элементы.ЛичныеДанныеКандидатаЗнаниеЯзыков.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура УченыеСтепениДобавить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиУченойСтепени",
		"УченыеСтепени", ИдентификаторНовойСтроки());
КонецПроцедуры

&НаКлиенте
Процедура УченыеСтепениИзменить(Команда)
	ОткрытьФормуЗаписиТабличнойЧасти("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаЗаписиУченойСтепени",
		"УченыеСтепени", Элементы.ЛичныеДанныеКандидатаУченыеСтепени.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, КандидатОбъект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, КандидатОбъект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, КандидатОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОписаниеОбъекта = Неопределено;
	Если ЭлементИлиКоманда.Имя = "РедактироватьМетки"
		Или ЭлементИлиКоманда.Имя = "ОстальныеМетки"
		Или СтрНайти(ЭлементИлиКоманда.Имя, "Метка") = 1 Тогда
		ОписаниеОбъекта = ЛичныеДанныеКандидата;
	КонецЕсли;
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка, ОписаниеОбъекта);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура НастроитьПереносКонтактнойИнформации(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения",
		Сред(Команда.Имя, СтрДлина("КонтактнаяИнформацияДобавитьПолеВвода") + 1));
	ДополнительныеПараметры.Вставить("АсинхронныйВызов", Ложь);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыСпискаВидыКонтактнойИнформации",
		УправлениеКонтактнойИнформациейКлиент, ДополнительныеПараметры);
	ОткрытьФорму("РегистрСведений.НастройкаВидовКонтактнойИнформацииКандидатов.Форма.ФормаНастройкиСоответствия", ,
		ЭтотОбъект, , , , Оповещение);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Оценки

&НаСервере
Процедура ЗаполнитьОценкуПоХарактеристикам()
	
	Если КандидатОбъект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОценкиКандидатовПоХарактеристикам.Оценка КАК Оценка
		|ИЗ
		|	РегистрСведений.ОценкиКандидатовПоХарактеристикам КАК ОценкиКандидатовПоХарактеристикам
		|ГДЕ
		|	ОценкиКандидатовПоХарактеристикам.Кандидат = &Кандидат";
	Запрос.УстановитьПараметр("Кандидат", КандидатОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЗначениеЗаполнено(Выборка.Оценка) Тогда
			ОценкаПоХарактеристикам = Выборка.Оценка;
		Иначе
			ОценкаПоХарактеристикам = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРейтинга()
	
	Если Не ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Для НомерЗвезды = 1 По 5 Цикл
		Элементы["Звезда_Неактивная_" + НомерЗвезды].Доступность = Ложь;
		Элементы["Звезда_Активная_" + НомерЗвезды].Доступность = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция РейтингДляОтображения(ТекущийОбъект)
	
	// Если есть общий рейтинг, показываем его.
	Если ТекущийОбъект.Рейтинг <> 0 Тогда
		Возврат ТекущийОбъект.Рейтинг;
	КонецЕсли;
	
	// Если нет, то ищем индивидуальный по пользователю.
	ИндивидуальнаяОценка = ИндивидуальнаяОценка(ТекущийОбъект.Оценки);
	Если ИндивидуальнаяОценка <> Неопределено Тогда
		Возврат ИндивидуальнаяОценка;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Функция ИндивидуальнаяОценка(Оценки)
	
	СтрокаОценки = СтрокаИндивидуальнойОценки(Оценки, Пользователи.АвторизованныйПользователь());
	Если СтрокаОценки <> Неопределено Тогда
		Возврат СтрокаОценки.Оценка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСреднийРейтинг(Форма)
	
	КандидатОбъект = Форма.КандидатОбъект;
	ВсегоОценок = КандидатОбъект.Оценки.Количество();
	
	Если ВсегоОценок < 1 Тогда
		Форма.Элементы.НадписьАгрегированнаяОценка.Видимость = Ложь;
		Возврат;
	Иначе
		Форма.Элементы.НадписьАгрегированнаяОценка.Видимость = Истина;
	КонецЕсли;
	
	СреднийРейтинг = СреднийРейтинг(Форма, ВсегоОценок);
	КандидатОбъект.Рейтинг = Окр(СреднийРейтинг, 2);
	
	Форма.Элементы.НадписьАгрегированнаяОценка.Заголовок = СтрШаблон(
		НСтр("ru = 'Средняя: %1, всего оценок %2'"), КандидатОбъект.Рейтинг, ВсегоОценок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьРейтинг(Форма, Рейтинг)
	
	Элементы = Форма.Элементы;
	
	Для НомерЗвезды = 1 По 5 Цикл
		Страница = "Неактивная";
		Если НомерЗвезды <= Рейтинг Тогда
			Страница = "Активная";
		КонецЕсли;
		Если Элементы["Звезда" + НомерЗвезды + "Страницы"].ТекущаяСтраница <> Элементы["Звезда" + НомерЗвезды + "Страница" + Страница] Тогда
			Элементы["Звезда" + НомерЗвезды + "Страницы"].ТекущаяСтраница = Элементы["Звезда" + НомерЗвезды + "Страница" + Страница];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СреднийРейтинг(Форма, ВсегоОценок = Неопределено)
	
	Если ВсегоОценок = Неопределено Тогда
		ВсегоОценок = Форма.КандидатОбъект.Оценки.Количество();
	КонецЕсли;
	
	Если ВсегоОценок = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Форма.КандидатОбъект.Оценки.Итог("Оценка") / ВсегоОценок;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаИндивидуальнойОценки(Оценки, ТекущийПользователь)
	
	НайденныеСтроки = Оценки.НайтиСтроки(Новый Структура("Пользователь", ТекущийПользователь));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ЭтапыРаботыСКандидатом

&НаСервере
Процедура УстановитьПанельСостояния(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = КандидатОбъект;
	КонецЕсли;
	
	КандидатОтклонен = Ложь;
	Если ТекущийОбъект.Состояние = Перечисления.СостоянияСогласования.Согласовано Тогда
		ДатаПриема = ДатаПриемаНаРаботу();
		Если ЗначениеЗаполнено(ДатаПриема) Тогда
			Сотрудник = ПодборПерсонала.СотрудникКандидата(КандидатСсылка);
			Элементы.ДекорацияНадписьСостояние.Заголовок = ПредставлениеСотрудника(ДатаПриема);
		КонецЕсли;
		Если ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена Тогда
			Элементы.ГруппаСостояние.ЦветФона = ЦветаСтиля.ЦветФонаПоложительногоЗначения;
		Иначе
			Элементы.ГруппаСостояние.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
		КонецЕсли;
		Элементы.ГруппаСостояние.Видимость = Истина;
	ИначеЕсли ТекущийОбъект.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		Элементы.ГруппаСостояние.ЦветФона = ЦветаСтиля.ЦветФонаОтрицательногоЗначения;
		Элементы.ГруппаСостояние.Видимость = Истина;
		Элементы.ДекорацияНадписьСостояние.Заголовок = СтрШаблон(НСтр("ru = '%1 %2'"),
			?(ЭтоЖенскийПол(ЛичныеДанныеКандидата.Пол), НСтр("ru = 'Отклонена'"), НСтр("ru = 'Отклонен'")),
			Формат(ТекущийОбъект.ДатаРешения, "ДЛФ=D"));
		Если ЗначениеЗаполнено(ТекущийОбъект.ПричинаОтклонения) Тогда
			Элементы.ДекорацияНадписьСостояние.Заголовок = СтрШаблон(НСтр("ru = '%1 по причине: %2'"),
				Элементы.ДекорацияНадписьСостояние.Заголовок,
				ТекущийОбъект.ПричинаОтклонения);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущийОбъект.КомментарийРешения) Тогда
			Элементы.ДекорацияНадписьСостояние.Заголовок = СтрШаблон(НСтр("ru = '%1 c комментарием: %2'"),
				Элементы.ДекорацияНадписьСостояние.Заголовок,
				ТекущийОбъект.КомментарийРешения);
		КонецЕсли;
		КандидатОтклонен = Истина;
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Неопределено Тогда
		Элементы.ГруппаСостояние.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаСостояние.ЦветФона = ЦветаСтиля.ЦветФонаПодсказки;
		Элементы.ГруппаСостояние.Видимость = Истина;
	КонецЕсли;
	
	ЗаполнитьПолосуЭтапов(РаботаСКандидатамиНаборЗаписей, ТекущийЭтап.ЭтапРаботы, КандидатОтклонен, Элементы);
	
	Если ТекущийОбъект.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		КандидатОтклонен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТекущийЭтапРаботы()

	МенеджерЗаписи = РегистрыСведений.ТекущиеЭтапыРаботыСКандидатами.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Кандидат = КандидатСсылка;
	МенеджерЗаписи.Прочитать();

	ЗначениеВРеквизитФормы(МенеджерЗаписи, "ТекущийЭтап");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеТекущегоЭтапа()
	
	Если ТипЗнч(ТекущийЭтап.ЭтапРаботы) = Тип("ПеречислениеСсылка.ЭтапыРаботыСКандидатами") Тогда
		Элементы.ДекорацияНадписьСостояние.Заголовок = ПредставлениеПредопределенногоЭтапа(ТекущийЭтап, 
			НайтиСтрокуРаботыСКандидатом(ЭтотОбъект, ТекущийЭтап));
	Иначе
		Элементы.ДекорацияНадписьСостояние.Заголовок = ПредставлениенеНеПредопределенногоЭтапа(ТекущийЭтап, 
			НайтиСтрокуРаботыСКандидатом(ЭтотОбъект, ТекущийЭтап));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПробел(ЧастиСтроки)
	ЧастиСтроки.Добавить(" ");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРаботуСКандидатом(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = КандидатОбъект;
	КонецЕсли;
	
	ТаблицаЭтапов = ПодборПерсонала.ТаблицаЭтаповРаботыСКандидатомНаВакансию(КандидатСсылка, КандидатОбъект.Вакансия);
	АнкетыПоЭтапам = АнкетыПоЭтапам(ТекущийОбъект.Ссылка, ТекущийОбъект.Вакансия);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(АнкетыПоЭтапам, "ЭтапРаботы");
	
	РаботаСКандидатамиНаборЗаписей.Очистить();
	
	// Установим этап "Рассмотрение отклика" в начало
	СтрокиЭтапаРассмотрениеОтклика = ТаблицаЭтапов.НайтиСтроки(
		Новый Структура("ЭтапРаботы", Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика));
	Если СтрокиЭтапаРассмотрениеОтклика.Количество() <> 0 Тогда
		СтрокаЭтапаРассмотрениеОтклика = СтрокиЭтапаРассмотрениеОтклика[0];
		ТаблицаЭтапов.Сдвинуть(СтрокаЭтапаРассмотрениеОтклика,
			-ТаблицаЭтапов.Индекс(СтрокаЭтапаРассмотрениеОтклика));
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаЭтапов Цикл
		НоваяСтрока = РаботаСКандидатамиНаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.Период = СтрокаТаблицы.ДатаВремя;
		СтрокиАнкеты = АнкетыПоЭтапам.НайтиСтроки(Новый Структура("ЭтапРаботы", СтрокаТаблицы.ЭтапРаботы));
		Если СтрокиАнкеты.Количество() > 0 Тогда
			НоваяСтрока.АнкетаСсылка = СтрокиАнкеты[0].Анкета;
			НоваяСтрока.АнкетаТолькоПросмотр = СтрокиАнкеты[0].ТолькоПросмотр;
		КонецЕсли;
	КонецЦикла;
	
	ПрочитатьТекущийЭтапРаботы();
	ЗаполнитьПредставлениеТекущегоЭтапа();
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаЛентаСобытий" Тогда
		ЗаполнитьЛентуСобытий();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеЭтапаРаботыНаСервере(РезультатВыбора)
	
	ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(РезультатВыбора);
	
	Если РезультатВыбора.ЭтапРаботы.Этап = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
		И РезультатВыбора.ЭтапРаботы.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден
		И КандидатОбъект.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		ОтменитьРешениеНаСервере();
	КонецЕсли;
	
	ЗаписанныйОбъект = КандидатСсылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаписанныйОбъект, "КандидатОбъект");
	
	ПриПолученииДанныхНаСервере(ЗаписанныйОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьРешениеНаСервере()
	
	Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПодборПерсонала.ОтменитьРешениеПоКандидатам(Кандидаты);
	
	ЗаписанныйОбъект = КандидатСсылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаписанныйОбъект, "КандидатОбъект");
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаЛентаСобытий" Тогда
		ЗаполнитьЛентуСобытий();
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере(ЗаписанныйОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеНаСервере(РезультатВыбора)
	
	Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПодборПерсонала.УстановитьРешениеПоКандидатам(Кандидаты, РезультатВыбора);
	
	ЗаписанныйОбъект = КандидатСсылка.ПолучитьОбъект();
	ЗначениеВРеквизитФормы(ЗаписанныйОбъект, "КандидатОбъект");
	
	ПриПолученииДанныхНаСервере(ЗаписанныйОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеСотрудника(ДатаПриема)

	Если Не УправлениеДоступом.ЧтениеРазрешено(Сотрудник) Тогда
		Возврат НСтр("ru = 'Информация недоступна'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаПриема) Тогда
		Возврат "";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(Ложь, 
		Сотрудник, "Организация, ДолжностьПоШтатномуРасписанию", ДатаПриема);
	УстановитьПривилегированныйРежим(Ложь);
	Если КадровыеДанные = Неопределено Или Не ЗначениеЗаполнено(КадровыеДанные.Организация) Тогда
		Возврат НСтр("ru = 'Не удалось получить кадровые данные'");
	КонецЕсли;
	
	МужскойПол = НСтр("ru = 'Принят в %1 с %2 на позицию <a href=""%3"">%4</a>'");
	ЖенскийПол = НСтр("ru = 'Принята в %1 с %2 на позицию <a href=""%3"">%4</a>'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(
		?(ЭтоЖенскийПол(ЛичныеДанныеКандидата.Пол), ЖенскийПол, МужскойПол), 
		КадровыеДанные.Организация, 
		Формат(ДатаПриема, "ДЛФ=D"), 
		ПолучитьНавигационнуюСсылку(Сотрудник), 
		КадровыеДанные.ДолжностьПоШтатномуРасписанию)
	
КонецФункции

&НаСервере
Функция ПредставлениеДаты(Дата)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	Если НачалоДня(ТекущаяДата) = НачалоДня(Дата) Тогда
		Возврат НСтр("ru = 'сегодня'");
	КонецЕсли;
	
	Если КонецДня(ТекущаяДата) + 1 = НачалоДня(Дата) Тогда
		Возврат НСтр("ru = 'завтра'");
	КонецЕсли;
	
	Если НачалоГода(ТекущаяДата) <> НачалоГода(Дата) Тогда
		Возврат Формат(Дата, "ДЛФ=D");
	КонецЕсли;
	
	Возврат Формат(Дата, "ДФ='д ММММ (ддд)'");
	
КонецФункции

&НаСервере
Функция ПредставлениеПредопределенногоЭтапа(ТекущийЭтап, СтрокаНабора)
	
	Если ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.Утверждение Тогда
		// Ожидает утверждения (одобрения) Утвердить или Отклонить.
		Возврат СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Ожидает утверждения (одобрения) <a href=""%1"">Утвердить</a> или <a href=""%2"">Отклонить</a>'"), 
			НавигационныеСсылкиФорматированнойСтроки().Утвердить, 
			НавигационныеСсылкиФорматированнойСтроки().Отклонить);
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу Тогда
		Если ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.ПустаяСсылка() Тогда
			// Ожидается ввод решения о приеме на работу. Ввести
			Если ПравоДоступа("Добавление", Метаданные.Документы.РешениеОПриемеНаРаботу) Тогда
				Возврат СтроковыеФункции.ФорматированнаяСтрока(
					НСтр("ru = 'Ожидается ввод решения о приеме на работу. <a href=""%1"">Ввести</a>'"), 
					НавигационныеСсылкиФорматированнойСтроки().РешениеОПриемеНаРаботуВвести);
			Иначе
				Возврат НСтр("ru = 'Ожидается ввод решения о приеме на работу'");
			КонецЕсли;
		ИначеЕсли ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
			// Ссылка на документ, не проведен
			Возврат СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = '<a href=""%1"">%2</a>, не проведен'"), 
				ПолучитьНавигационнуюСсылку(СтрокаНабора.ДокументОснование),
				Строка(СтрокаНабора.ДокументОснование));
		Иначе
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
				СтрШаблон(НСтр("ru = 'Неожиданное состояние %1 для этапа Решение о приеме на работу'"), 
					ТекущийЭтап.Состояние), 
				"Кандидаты.ФормаЭлемента.ПредставлениеПредопределенногоЭтапа");
		КонецЕсли;
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу Тогда
		Если ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.ПустаяСсылка() Тогда
			// Все этапы пройдены, ожидается прием на работу
			Возврат НСтр("ru = 'Ожидается приказ о приеме на работу'");
		ИначеЕсли ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
			// Ссылка на документ, не проведен
			Возврат СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = '<a href=""%1"">%2</a>, не проведен'"), 
				ПолучитьНавигационнуюСсылку(СтрокаНабора.ДокументОснование),
				Строка(СтрокаНабора.ДокументОснование));
		КонецЕсли;
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика Тогда
		ЧастиСтроки = Новый Массив;
		Если ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
			// Отклик не отработан
			Если КандидатОбъект.Состояние <> Перечисления.СостоянияСогласования.Отклонено Тогда
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Кандидат откликнулся сам. Его можно'") + " "));
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Принять к рассмотрению'"), , , ,
						НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапВыполнить));
				ЧастиСтроки.Добавить(" " + НСтр("ru = 'или'")+ " ");
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Отклонить'"), , , ,
						НавигационныеСсылкиФорматированнойСтроки().Отклонить));
			Иначе
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Кандидат откликнулся сам и был отклонен. Его можно'") + " "));
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Принять к рассмотрению'"), , , ,
						НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапВыполнить));
			КонецЕсли;
		КонецЕсли;
		Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	ИначеЕсли ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена Тогда
		Возврат НСтр("ru = 'Работа с кандидатом по этапам завершена'");
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Неожиданный текущий предопределенный этап %1'"), 
				ТекущийЭтап.ЭтапРаботы), 
			"Кандидаты.ФормаЭлемента.ПредставлениеПредопределенногоЭтапа");
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПредставлениенеНеПредопределенногоЭтапа(ТекущийЭтап, СтрокаНабора)
	
	ДобавлятьКоманды = РольДоступнаДобавлениеИзменениеДанныхКандидатов;

	ТекстДатаВремя = СтрШаблон(НСтр("ru = '%1 в %2'"), 
		ПредставлениеДаты(ТекущийЭтап.ДатаВремя), Формат(ТекущийЭтап.ДатаВремя, "ДФ=ЧЧ:мм"));
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'Текущий этап «%1»'"), ТекущийЭтап.ЭтапРаботы));
	
	ДобавитьПробел(ЧастиСтроки);
	Если ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		ЧастиСтроки.Добавить(
			СтроковыеФункции.ФорматированнаяСтрока(
				НСтр("ru = 'запланирован <a href=""%1"">%2</a>'"), 
				НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапЗапланировать, 
				ТекстДатаВремя));
	Иначе
		Если ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
			ЧастиСтроки.Добавить(
				СтроковыеФункции.ФорматированнаяСтрока(
					НСтр("ru = 'пройден <a href=""%1"">%2</a>'"), 
					НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапВыполнить, 
					ТекстДатаВремя));
			ДобавлятьКоманды = Ложь;
		ИначеЕсли ТекущийЭтап.Состояние = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
			ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = 'пропущен %1'"), ТекстДатаВремя));
			ДобавлятьКоманды = Ложь;
		Иначе
			ЧастиСтроки.Добавить(НСтр("ru = 'пока не запланирован'"));
			Если ДобавлятьКоманды Тогда
				ДобавитьПробел(ЧастиСтроки);
				ЧастиСтроки.Добавить(
					Новый ФорматированнаяСтрока(НСтр("ru = 'Запланировать'"), , , , 
						НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапЗапланировать));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДобавлятьКоманды Тогда
		ДобавитьПробел(ЧастиСтроки);
		Если ЗначениеЗаполнено(СвойствоСтруктуры(СтрокаНабора, "ШаблонАнкеты")) Тогда
			ЧастиСтроки.Добавить(
				Новый ФорматированнаяСтрока(НСтр("ru = 'Пройти'"), , , , 
					НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапПройти));	
		Иначе
			ЧастиСтроки.Добавить(
				Новый ФорматированнаяСтрока(НСтр("ru = 'Отметить пройденным'"), , , , 
					НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапВыполнить));
		КонецЕсли;
		ДобавитьПробел(ЧастиСтроки);
		ЧастиСтроки.Добавить(
			Новый ФорматированнаяСтрока(НСтр("ru = 'Пропустить'"), , , , 
				НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапПропустить));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСтроки);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиТекущийЭтапЗапланировать(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапЗапланировать Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьУстановкуСостоянияТекущегоЭтапаРаботы(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиТекущийЭтапВыполнить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапВыполнить Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьУстановкуСостоянияТекущегоЭтапаРаботы(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиТекущийЭтапПройти(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапПройти Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьПрохождениеЭлектронногоИнтервьюТекущегоЭтапаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиТекущийЭтапПропустить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().ТекущийЭтапПропустить Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьУстановкуСостоянияТекущегоЭтапаРаботы(ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пропущен"), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиУтвердить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().Утвердить Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьПринятиеРешения(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиОтклонить(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().Отклонить Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	НачатьПринятиеРешения(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиРешениеОПриемеНаРаботуВвести(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> НавигационныеСсылкиФорматированнойСтроки().РешениеОПриемеНаРаботуВвести Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	НачатьВводНовогоРешенияОПриемеНаРаботу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПринятиеРешения(Решение)
	
	Если Не Модифицированность Тогда
		ПоказатьФормуПринятияРешения(Решение);
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура("Решение");
	ПараметрыОповещения.Решение = Решение;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ПринятьРешениеПослеВопросаЗаписать", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтменуРешения()
	
	Если Не Модифицированность Тогда
		ОтменитьРешениеНаКлиенте();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОтменитьРешениеПослеВопросаЗаписать", ЭтотОбъект);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьРешениеПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьФормуПринятияРешения(ДополнительныеПараметры.Решение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуПринятияРешения(Решение)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗавершитьПринятиеРешения", ЭтотОбъект);
	
	Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПодборПерсоналаКлиент.НачатьПринятиеРешенияПоКандидату(Кандидаты, Решение, ОбработчикОповещения, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПринятиеРешения(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРешениеНаСервере(РезультатВыбора);
	
	ОповеститьОРешении();
	
	Если РезультатВыбора.РешениеОПриемеНаРаботу.Создавать Тогда
		НачатьВводНовогоРешенияОПриемеНаРаботу(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРешениеПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьРешениеНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРешениеНаКлиенте()
	
	ОтменитьРешениеНаСервере();
	
	ОповеститьОРешении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОРешении()
	
	ПараметрыОповещения = Новый Структура("Кандидаты, Вакансии");
	ПараметрыОповещения.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПараметрыОповещения.Вакансии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатОбъект.Вакансия);
	
	Оповестить("РешениеПоКандидату", ПараметрыОповещения, ЭтотОбъект);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ПараметрыОповещения.Кандидаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗаписиКандидата(ОбработчикОповещения)
	
	ТекстВопроса = НСтр("ru = 'Данные кандидата не записаны.
                         |Для продолжения данные кандидата необходимо записать.'");
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Записать и продолжить'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПрохождениеЭлектронногоИнтервьюТекущегоЭтапаРаботы()
	
	СтрокаНабора = НайтиСтрокуРаботыСКандидатом(ЭтотОбъект, ТекущийЭтап);
	НачатьПрохождениеЭлектронногоИнтервьюЭтапаРаботы(СтрокаНабора);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПрохождениеЭлектронногоИнтервьюЭтапаРаботы(ДанныеЭтапа)
	
	Если Не Модифицированность Тогда
		ПройтиЭлектронноеИнтервьюЭтапаРаботы(ДанныеЭтапа);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДанныеЭтапа");
	ДополнительныеПараметры.ДанныеЭтапа = ДанныеЭтапа;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ПройтиЭлектронноеИнтервьюТекущегоЭтапаРаботыПослеВопросаЗаписать",
		ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПройтиЭлектронноеИнтервьюТекущегоЭтапаРаботыПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ПройтиЭлектронноеИнтервьюЭтапаРаботы(ДополнительныеПараметры.ДанныеЭтапа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПройтиЭлектронноеИнтервьюЭтапаРаботы(ДанныеЭтапа)
	
	Если Не ЗначениеЗаполнено(ДанныеЭтапа.АнкетаСсылка) Или ДанныеЭтапа.АнкетаТолькоПросмотр Тогда
		ЭлектронноеИнтервьюКлиент.НачатьИнтервью(
			КандидатСсылка, ЛичныеДанныеКандидатаСсылка, ДанныеЭтапа.ЭтапРаботы, ДанныеЭтапа.ШаблонАнкеты);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоФормаЗаполнения", Истина);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыФормы.Вставить("Ключ", ДанныеЭтапа.АнкетаТолькоПросмотр);
	ПараметрыФормы.Вставить("ВозможностьПредварительногоСохранения", Истина);
	ОткрытьФорму("Документ.Анкета.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтменуЭтапаРаботы(ТекущиеДанные)
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СостояниеЭтапа) Тогда
		// Не нужно отменять этап, у которого и так пустое состояние.
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.Утверждение") Тогда
		НачатьОтменуРешения();
		Возврат;
	ИначеЕсли ТекущиеДанные.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу") Тогда
		НачатьОтменуРешенияОПриемеНаРаботу(ТекущиеДанные.ДокументОснование);
		Возврат;
	ИначеЕсли ТекущиеДанные.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.ПриемНаРаботу") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пропущен") Тогда
		// Не спрашиваем, чтобы отменить пропущенный этап.
		ТекущиеДанные.Период = Неопределено;
		НачатьУстановкуСостоянияЭтапаРаботы(Неопределено, ТекущиеДанные, Ложь);
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден") Тогда
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'Этап «%1» отмечен как пройденный кандидатом. 
                  |При отмене этого результата убедитесь, что уведомлены все заинтересованные стороны.'"), 
			ТекущиеДанные.ЭтапРаботы);
		Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) Тогда
			ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Кроме того, действие приведет к отмене результатов интервью по этому этапу.'");
		КонецЕсли;
		ТекстВопроса = ТекстВопроса + Символы.ПС + НСтр("ru = 'Продолжить?'");
	ИначеЕсли ТекущиеДанные.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован") Тогда
		ТекстВопроса = НСтр("ru = 'При отмене запланированного этапа убедитесь, что уведомлены все заинтересованные стороны.
                             |Продолжить?'"); 
		
	КонецЕсли;
	
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Отменить этап'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
	
	ДополнительныеПараметры = Новый Структура("ДанныеЭтапа");
	ДополнительныеПараметры.ДанныеЭтапа = ТекущиеДанные;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОтменитьЭтапПослеВопросаПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, СписокКнопок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЭтапПослеВопросаПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ДанныеЭтапа.Период = Неопределено;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ДанныеЭтапа.ИдентификаторВидеоконференции) Тогда
		ВидеособеседованияКлиент.ПриОтменеЭтапа(ЭтотОбъект, ДополнительныеПараметры.ДанныеЭтапа);
	КонецЕсли;
	
	НачатьУстановкуСостоянияЭтапаРаботы(Неопределено, ДополнительныеПараметры.ДанныеЭтапа, Ложь);
	ОтменитьАнкетуКандидата(КандидатСсылка, КандидатОбъект.Вакансия, ДополнительныеПараметры.ДанныеЭтапа.ЭтапРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуСостоянияТекущегоЭтапаРаботы(СостояниеЭтапа, ОткрыватьФорму = Истина)
	СтрокаНабора = НайтиСтрокуРаботыСКандидатом(ЭтотОбъект, ТекущийЭтап);
	НачатьУстановкуСостоянияЭтапаРаботы(СостояниеЭтапа, СтрокаНабора, ОткрыватьФорму);
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуСостоянияЭтапаРаботы(СостояниеЭтапа, ДанныеЭтапа, ОткрыватьФорму = Истина)
	
	Если ИспользоватьОграничениеПоГруппамДоступа
		И ТекущийЭтап.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика")
		И Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ГруппаДоступа) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для продолжения работы с кандидатом необходимо заполнить группу доступа'"), ,
			"ЛичныеДанныеКандидата.ГруппаДоступа");
		Возврат;
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		УстановитьСостояниеЭтапаРаботы(СостояниеЭтапа, ДанныеЭтапа, ОткрыватьФорму);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура(
		"СостояниеЭтапа, 
		|ДанныеЭтапа,
		|ОткрыватьФорму");
	ДополнительныеПараметры.СостояниеЭтапа = СостояниеЭтапа;
	ДополнительныеПараметры.ДанныеЭтапа = ДанныеЭтапа;
	ДополнительныеПараметры.ОткрыватьФорму = ОткрыватьФорму;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("УстановитьСостояниеЭтапаРаботыПослеВопросаЗаписать",
		ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеЭтапаРаботыПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСостояниеЭтапаРаботы(ДополнительныеПараметры.СостояниеЭтапа, ДополнительныеПараметры.ДанныеЭтапа, 
		ДополнительныеПараметры.ОткрыватьФорму);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеСостоянияЭтапаРаботы(ДанныеЭтапа)
	
	Если Не Модифицированность Тогда
		ИзменитьСостояниеЭтапаРаботы(ДанныеЭтапа);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ДанныеЭтапа");
	ДополнительныеПараметры.ДанныеЭтапа = ДанныеЭтапа;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ИзменитьСостояниеЭтапаРаботыПослеВопросаЗаписать", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЭтапаРаботыПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьСостояниеЭтапаРаботы(ДополнительныеПараметры.ДанныеЭтапа);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЭтапаРаботы(ДанныеЭтапа)
	
	ПараметрыФормы = ПодборПерсоналаКлиентСервер.ПараметрыРедактированияЭтапаРаботыСКандидатом();
	ПараметрыФормы.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПараметрыФормы.СостояниеЭтапа = ДанныеЭтапа.СостояниеЭтапа;
	ПараметрыФормы.ЭтапРаботы = ДанныеЭтапа.ЭтапРаботы;
	ПараметрыФормы.Период = ДанныеЭтапа.Период;
	ПараметрыФормы.ТолькоПросмотр = Не РольДоступнаДобавлениеИзменениеДанныхКандидатов;
	ПараметрыФормы.ШаблонАнкеты = ДанныеЭтапа.ШаблонАнкеты;
	ПараметрыФормы.Комментарий = ДанныеЭтапа.Комментарий;
	ПараметрыФормы.Организатор = ДанныеЭтапа.Организатор;
	ПараметрыФормы.Бронь = ДанныеЭтапа.Бронь;
	ПараметрыФормы.УчетнаяЗаписьВидеоконференции = ДанныеЭтапа.УчетнаяЗаписьВидеоконференции;
	ПараметрыФормы.ИдентификаторВидеоконференции = ДанныеЭтапа.ИдентификаторВидеоконференции;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("УстановитьСостояниеЭтапаРаботыПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.РаботаСКандидатами.Форма.ЭтапРаботыСКандидатом", ПараметрыФормы, ЭтотОбъект, 
		ЭтотОбъект, , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеЭтапаРаботы(Состояние, ДанныеЭтапа, ОткрыватьФорму = Истина)
	
	Если Не ОткрыватьФорму Тогда
		Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
		Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
		Результат.ЭтапРаботы.Этап = ДанныеЭтапа.ЭтапРаботы;
		Результат.ЭтапРаботы.Состояние = Состояние;
		Результат.ЭтапРаботы.Период = ДанныеЭтапа.Период;
		Если Не ЗначениеЗаполнено(ДанныеЭтапа.Период) Тогда
			Результат.ЭтапРаботы.Период = ОбщегоНазначенияКлиент.ДатаСеанса();
		КонецЕсли;
		УстановитьСостояниеЭтапаРаботыНаСервере(Результат);
		ОповеститьОбИзмененииЭтапаРаботы();
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПодборПерсоналаКлиентСервер.ПараметрыРедактированияЭтапаРаботыСКандидатом();
	ПараметрыФормы.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка);
	ПараметрыФормы.СостояниеЭтапа = Состояние;
	ПараметрыФормы.ЭтапРаботы = ДанныеЭтапа.ЭтапРаботы;
	ПараметрыФормы.ТолькоПросмотр = Не РольДоступнаДобавлениеИзменениеДанныхКандидатов;
	ПараметрыФормы.ШаблонАнкеты = ДанныеЭтапа.ШаблонАнкеты;
	ПараметрыФормы.Комментарий = ДанныеЭтапа.Комментарий;
	ПараметрыФормы.УчетнаяЗаписьВидеоконференции = ДанныеЭтапа.УчетнаяЗаписьВидеоконференции;
	ПараметрыФормы.ИдентификаторВидеоконференции = ДанныеЭтапа.ИдентификаторВидеоконференции;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("УстановитьСостояниеЭтапаРаботыПослеВыбора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.РаботаСКандидатами.Форма.ЭтапРаботыСКандидатом", ПараметрыФормы, ЭтотОбъект, 
		ЭтотОбъект, , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеЭтапаРаботыПослеВыбора(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСостояниеЭтапаРаботыНаСервере(РезультатВыбора);
	ОповеститьОбИзмененииЭтапаРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииЭтапаРаботы()
	
	Оповестить("ИзмененЭтапРаботыСКандидатом", ПараметрыОповещения(), ЭтотОбъект);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(КандидатСсылка, ПараметрыОповещения()); 
	
	Если Элементы.Страницы.ТекущаяСтраница.Имя = "СтраницаЛентаСобытий" Тогда
		ЗаполнитьЛентуСобытий();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводНовогоРешенияОПриемеНаРаботу(ЗадаватьВопрос)
	
	Если Не ЗадаватьВопрос Или Не ЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу() Тогда
		КадровыеРешенияКлиентРасширенный.ОткрытьФормуНовогоРешенияОПриемеНаРаботу(КандидатСсылка);
		Возврат;
	КонецЕсли;
	
	КнопкиОтвета = Новый СписокЗначений();
	КнопкиОтвета.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Продолжить'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Создание нового документа'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Истина;

	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВводНовогоРешенияОПриемеНаРаботу", ЭтотОбъект), 
		НСтр("ru = 'На этого кандидата будет введен и заполнен новый документ «Решение о приеме на работу»'"), 
		КнопкиОтвета,
		ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводНовогоРешенияОПриемеНаРаботу(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.БольшеНеЗадаватьЭтотВопрос Тогда
		СохранитьЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу(Ложь);
	КонецЕсли;
	
	КадровыеРешенияКлиентРасширенный.ОткрытьФормуНовогоРешенияОПриемеНаРаботу(КандидатСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтменуРешенияОПриемеНаРаботу(РешениеОПриемеНаРаботу)

	КнопкиОтвета = Новый СписокЗначений();
	КнопкиОтвета.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Продолжить'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Отмена решения о приеме на работу'");

	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьОтменуРешенияОПриемеНаРаботу", 
			ЭтотОбъект, Новый Структура("РешениеОПриемеНаРаботу", РешениеОПриемеНаРаботу)), 
		СтроковыеФункцииКлиент.ФорматированнаяСтрока(
			НСтр("ru = 'Проведение документа <a href=""%1"">«%2»</a> будет отменено. 
				 |Не проведенный документ по-прежнему будет доступен по ссылке.
				 |Чтобы документ перестал отображаться, можно пометить его на удаление'"), 
			ПолучитьНавигационнуюСсылку(РешениеОПриемеНаРаботу), 
			РешениеОПриемеНаРаботу), 
		КнопкиОтвета,
		ПараметрыВопроса);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОтменуРешенияОПриемеНаРаботу(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьРешениеОПриемеНаРаботу(ДополнительныеПараметры.РешениеОПриемеНаРаботу);
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(ДополнительныеПараметры.РешениеОПриемеНаРаботу, 
		Новый Структура("Кандидат", КандидатСсылка));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьКарточкуЭтапа(Элемент)
	
	НомерЭтапа = СтрЗаменить(Элемент.Имя, "ПолосаЭтап", "");
	НомерЭтапа = СтрЗаменить(НомерЭтапа, "ДекорацияТекстРаботаСКандидатом", "");
	
	ТекущиеДанные = РаботаСКандидатамиНаборЗаписей[Число(НомерЭтапа)];
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбработатьВыборЭтапаУтверждение(ТекущиеДанные) Тогда
	ИначеЕсли ОбработатьВыборЭтапаРешениеОПриемеНаРаботу(ТекущиеДанные) Тогда
	ИначеЕсли ОбработатьВыборЭтапаПриемНаРаботу(ТекущиеДанные) Тогда
	Иначе
		Если ЗначениеЗаполнено(ТекущиеДанные.СостояниеЭтапа) Тогда
			НачатьИзменениеСостоянияЭтапаРаботы(ТекущиеДанные);
		Иначе
			НачатьУстановкуСостоянияЭтапаРаботы(
				ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован"), ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыборЭтапаУтверждение(ДанныеЭтапа)
	
	Если ДанныеЭтапа.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.Утверждение") Тогда
		НачатьПринятиеРешения(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ОбработатьВыборЭтапаРешениеОПриемеНаРаботу(ДанныеЭтапа)

	Если ДанныеЭтапа.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу") Тогда
		Если ЗначениеЗаполнено(ДанныеЭтапа.ДокументОснование) Тогда
			ПоказатьЗначение(, ДанныеЭтапа.ДокументОснование);
		Иначе
			НачатьВводНовогоРешенияОПриемеНаРаботу(Истина);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция ОбработатьВыборЭтапаПриемНаРаботу(ДанныеЭтапа)

	Если ДанныеЭтапа.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.ПриемНаРаботу") Тогда
		Если ЗначениеЗаполнено(ДанныеЭтапа.ДокументОснование) Тогда
			ПоказатьЗначение(, ДанныеЭтапа.ДокументОснование);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция ПараметрыОповещения()
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("Кандидаты", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатСсылка));
	ПараметрыОповещения.Вставить("Вакансии", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатОбъект.Вакансия));
	ПараметрыОповещения.Вставить("ДляЗаписи", ДляЗаписи);
	
	Если ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
		ПараметрыОповещения.Вставить("ФизическоеЛицо", ФизическоеЛицоСсылка);
	КонецЕсли;
	
	Возврат ПараметрыОповещения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПолосуЭтапов(ЭтапыРаботы, ТекущийЭтап, КандидатОтклонен, Элементы) 
	
	ПодчиненныеЭлементы = Элементы["ГруппаПолосаЭтапов"].ПодчиненныеЭлементы;
	Пока ПодчиненныеЭлементы.Количество() <> 0 Цикл
		Элементы.Удалить(ПодчиненныеЭлементы[0]);
	КонецЦикла;
	
	НомерЭтапа = 0;
	Для Каждого ЭтапРаботы Из ЭтапыРаботы Цикл
		Если НомерЭтапа <> 0 Тогда
			НовыйЭлемент = Элементы.Добавить("ПолосаСоединение" + НомерЭтапа, Тип("ДекорацияФормы"), Элементы.ГруппаПолосаЭтапов);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
			НовыйЭлемент.Картинка = БиблиотекаКартинок.ПолосаЭтаповСоединение;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить("ПолосаЭтап" + НомерЭтапа, Тип("ДекорацияФормы"), Элементы.ГруппаПолосаЭтапов);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		НовыйЭлемент.Гиперссылка = Истина;
		НовыйЭлемент.Картинка = КартинкаПолосыЭтапов(ЭтапРаботы, ТекущийЭтап, КандидатОтклонен);
		НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ОткрытьКарточкуЭтапа");
		НовыйЭлемент.Подсказка = СтрШаблон(НСтр("ru = '%1%2'"),
			ЭтапРаботы.ЭтапРаботы,
			?(ЗначениеЗаполнено(ЭтапРаботы.Период), ", " + Формат(ЭтапРаботы.Период, "ДФ='dd.MM.yyyy ЧЧ:мм'"), ""));
		НомерЭтапа = НомерЭтапа + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьРешениеОПриемеНаРаботу(РешениеОПриемеНаРаботу)
	ДокументОбъект = РешениеОПриемеНаРаботу.ПолучитьОбъект(); // ДокументОбъект.РешениеОПриемеНаРаботу
	ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СохранитьЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу(ЗадаватьВопрос)
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Метаданные.Справочники.Кандидаты.Формы.ФормаЭлементаНовая.ПолноеИмя(), 
		"ЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу", 
		ЗадаватьВопрос);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу()
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Метаданные.Справочники.Кандидаты.Формы.ФормаЭлементаНовая.ПолноеИмя(),
		"ЗадаватьВопросОВводеНовогоРешенияОПриемеНаРаботу", 
		Истина);
КонецФункции

&НаСервереБезКонтекста
Функция КартинкаПолосыЭтапов(ЭтапРаботы, ТекущийЭтап, КандидатОтклонен)
	
	Если ЭтапРаботы.ЭтапРаботы = ТекущийЭтап Тогда
		КартинкаПолосыЭтапов = БиблиотекаКартинок.ПолосаЭтаповТекущий;
	ИначеЕсли ЭтапРаботы.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
		КартинкаПолосыЭтапов = БиблиотекаКартинок.ПолосаЭтаповПройден;
	ИначеЕсли ЭтапРаботы.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
		КартинкаПолосыЭтапов = БиблиотекаКартинок.ПолосаЭтаповПропущен;
	ИначеЕсли КандидатОтклонен Тогда
		КартинкаПолосыЭтапов = БиблиотекаКартинок.ПолосаЭтаповОтклонен;
		КандидатОтклонен = Ложь;
	Иначе
		КартинкаПолосыЭтапов = БиблиотекаКартинок.ПолосаЭтаповПустой;
	КонецЕсли;
	
	Возврат КартинкаПолосыЭтапов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НавигационныеСсылкиФорматированнойСтроки()
	
	Структура = Новый Структура();
	Структура.Вставить("ТекущийЭтапЗапланировать", "ТекущийЭтапЗапланировать");
	Структура.Вставить("ТекущийЭтапВыполнить", "ТекущийЭтапВыполнить");
	Структура.Вставить("ТекущийЭтапПройти", "ТекущийЭтапПройти");
	Структура.Вставить("ТекущийЭтапПройти", "ТекущийЭтапПройти");
	Структура.Вставить("ТекущийЭтапПропустить", "ТекущийЭтапПропустить");
	Структура.Вставить("Утвердить", "Утвердить");
	Структура.Вставить("Отклонить", "Отклонить");
	Структура.Вставить("РешениеОПриемеНаРаботуВвести", "РешениеОПриемеНаРаботуВвести");
	Возврат Структура;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НайтиСтрокуРаботыСКандидатом(Форма, ТекущийЭтап)
	
	Если Не ЗначениеЗаполнено(ТекущийЭтап.ЭтапРаботы) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НайденныеСтроки = Форма.РаботаСКандидатамиНаборЗаписей.НайтиСтроки(
		Новый Структура("ЭтапРаботы", ТекущийЭтап.ЭтапРаботы));
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат НайденныеСтроки[0];
	
КонецФункции

#КонецОбласти

#Область Взаимодействия

&НаКлиенте
Процедура НачатьЗвонокSMS()
	
	Если Не Модифицированность Тогда
		ЗвонокSMSПоказатьПодменю();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ЗвонокSMSПослеВопросаЗаписать", ЭтотОбъект);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗвонокSMSПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ЗвонокSMSПоказатьПодменю();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗвонокSMSПоказатьПодменю()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗвонокSMSПодменюПослеВыбора", ЭтотОбъект);
	
	ЗвонокSMSСписокВыбора = Новый СписокЗначений;
	ЗвонокSMSСписокВыбора.Добавить("Звонок", НСтр("ru = 'Позвонить'"), , БиблиотекаКартинок.Позвонить);
	ЗвонокSMSСписокВыбора.Добавить("SMS", НСтр("ru = 'Отправить SMS...'"), , БиблиотекаКартинок.ОтправитьSMS);
	ЗвонокSMSСписокВыбора.Добавить("Telegram", НСтр("ru = 'Найти в Telegram'"), , БиблиотекаКартинок.ЛоготипTelegram);
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, ЗвонокSMSСписокВыбора, Элементы.ДекорацияТелефон);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗвонокSMSПодменюПослеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныйЭлемент.Значение = "SMS" Тогда
		Если Не ИспользоватьШаблоныСообщений Тогда
			ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет(
				"Документ.СообщениеSMS.ФормаОбъекта", КандидатСсылка, ЭтотОбъект);
			Возврат;
		КонецЕсли;
		ШаблоныСообщенийКлиент.СформироватьСообщение(КандидатСсылка, "СообщениеSMS", Неопределено); 
	ИначеЕсли ВыбранныйЭлемент.Значение = "Звонок" Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет(
			"Документ.ТелефонныйЗвонок.ФормаОбъекта", КандидатСсылка, ЭтотОбъект);
	ИначеЕсли ВыбранныйЭлемент.Значение = "Telegram" Тогда
		КонтактнаяИнформацияБЗККлиент.ОбработчикДействияНаписатьTelegram(
			КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьНаписатьПисьмо()
	
	Если Не Модифицированность Тогда
		НаписатьПисьмоКандидату();
		Возврат;
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("НаписатьПисьмоПослеВопросаЗаписать", ЭтотОбъект);
	ПоказатьВопросЗаписиКандидата(ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмоПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	НаписатьПисьмоКандидату();
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмоКандидату()
	
	Если Не ИспользоватьШаблоныСообщений Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет(
			"Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", КандидатСсылка, ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ШаблоныСообщенийКлиент.СформироватьСообщение(КандидатСсылка, "Письмо", Неопределено); 
	
КонецПроцедуры

#КонецОбласти

#Область ЗащитаПерсональныхДанных

&НаСервереБезКонтекста
Функция ОрганизацияВакансии(Вакансия)
	
	Возврат Справочники.Вакансии.ОрганизацияВакансии(Вакансия);
	
КонецФункции

#КонецОбласти

#Область ПолучениеКонтактовРезюме

&НаСервере
Процедура ЗаполнитьКонтактыСРекрутинговогоСайта()
	
	КонтактыРезюме = РекрутинговыеСайты.КонтактыРезюме(КандидатОбъект.ИсточникИнформации, КандидатОбъект.АдресРезюме);
	
	КонтактнаяИнформация = Новый Массив;
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Фамилия", "");
	СтруктураЗаполнения.Вставить("Имя", "");
	СтруктураЗаполнения.Вставить("Отчество", "");
	СтруктураЗаполнения.Вставить("КонтактнаяИнформация", КонтактнаяИнформация);
	
	ЗаполнитьЛичныеДанныеКандидата = Ложь;
	
	Если ЗначениеЗаполнено(КонтактыРезюме.Фамилия) Тогда
		СтруктураЗаполнения.Фамилия = КонтактыРезюме.Фамилия;
		ЗаполнитьЛичныеДанныеКандидата = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтактыРезюме.Имя) Тогда
		СтруктураЗаполнения.Имя = КонтактыРезюме.Имя;
		ЗаполнитьЛичныеДанныеКандидата = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(КонтактыРезюме.Отчество) Тогда
		СтруктураЗаполнения.Отчество = КонтактыРезюме.Отчество;
		ЗаполнитьЛичныеДанныеКандидата = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактыРезюме.Телефон) Тогда
		СтруктураТелефон = Новый Структура;
		СтруктураТелефон.Вставить("Вид", ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"));
		СтруктураТелефон.Вставить("Представление", КонтактыРезюме.Телефон);
		КонтактнаяИнформация.Добавить(СтруктураТелефон);
		ЗаполнитьЛичныеДанныеКандидата = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонтактыРезюме.ЭлектроннаяПочта) Тогда
		СтруктураЭлектроннаяПочта = Новый Структура;
		СтруктураЭлектроннаяПочта.Вставить("Вид", ОбщегоНазначения.ПредопределенныйЭлемент(
			"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"));
		СтруктураЭлектроннаяПочта.Вставить("Представление", КонтактыРезюме.ЭлектроннаяПочта);
		КонтактнаяИнформация.Добавить(СтруктураЭлектроннаяПочта);
		ЗаполнитьЛичныеДанныеКандидата = Истина;
	КонецЕсли;
	
	Если ЗаполнитьЛичныеДанныеКандидата Тогда
		ЗаполнитьЛичныеДанныеКандидата(СтруктураЗаполнения);
		Элементы.ПолучитьКонтакты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПоКонтактногоДоступа(Сайт, СкрытыеКонтактыПредставление)
	
	ТекстВопроса = РекрутинговыеСайтыКлиент.ТекстВопросаПоКонтактногоДоступа(Сайт);
	Если Не ЗначениеЗаполнено(ТекстВопроса) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Сайт", Сайт);
	ДополнительныеПараметры.Вставить("СкрытыеКонтактыПредставление", СкрытыеКонтактыПредставление);
	
	Оповещение = Новый ОписаниеОповещения("ВопросПоКонтактногоДоступаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Если РекрутинговыеСайтыКлиент.БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Тогда
		ПоказатьВопросСкрытыеКонтакты(СкрытыеКонтактыПредставление);
		Возврат;
	КонецЕсли;
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ДопПараметры = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ДопПараметры.Заголовок = НСтр("ru = 'Получение ФИО и контактов'");
	ДопПараметры.Картинка = БиблиотекаКартинок.Информация32;
	ДопПараметры.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Истина;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, КнопкиВопроса, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПоКонтактногоДоступаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВопроса) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатВопроса.Значение = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса.БольшеНеЗадаватьЭтотВопрос Тогда
		РекрутинговыеСайтыКлиент.СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(ДополнительныеПараметры.Сайт);
	КонецЕсли;
	
	ПоказатьВопросСкрытыеКонтакты(ДополнительныеПараметры.СкрытыеКонтактыПредставление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросСкрытыеКонтакты(СкрытыеКонтактыПредставление)
	
	Если Не ЗначениеЗаполнено(СкрытыеКонтактыПредставление) Тогда
		ЗавершитьВопросПоКонтактногоДоступа(Истина);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросСкрытыеКонтактыЗавершение", ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'Этот кандидат скрыл %1.
		|При продолжении будут получены все данные, кроме этих сведений.'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СкрытыеКонтактыПредставление);
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ДопПараметры = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ДопПараметры.Заголовок = НСтр("ru = 'Скрытые контакты'");
	ДопПараметры.Картинка = БиблиотекаКартинок.Предупреждение32;
	ДопПараметры.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, КнопкиВопроса, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСкрытыеКонтактыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса.Значение = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьВопросПоКонтактногоДоступа(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросПоКонтактногоДоступа(Результат)
	
	Если Не Результат = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКонтактыСРекрутинговогоСайта();
	ЗаполнитьКонтактнуюИнформацию = Ложь;
	Если Не ПустаяСтрока(КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов) Тогда
		УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элементы.КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов);
		ПроверкаНаДубли = Истина;
		ЗаполнитьКонтактнуюИнформацию = Истина;
	КонецЕсли;
	
	Если Не ПустаяСтрока(КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов) Тогда
		УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элементы.КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов);
		ПроверкаНаДубли = Истина;
		ЗаполнитьКонтактнуюИнформацию = Истина;
	КонецЕсли; 
	
	Если Не ПустаяСтрока(КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов) Тогда
		УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элементы.КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов);
		ЗаполнитьКонтактнуюИнформацию = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКонтактнуюИнформацию Тогда
		ЗаполнитьКонтактнуюИнформацию(КонтактнаяИнформацияОписаниеДополнительныхРеквизитов, Элементы);
	КонецЕсли;
	
	Если ПроверкаНаДубли Тогда
		ПроверитьОднофамильцев();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьКонтактов()
	
	Элементы.ПолучитьКонтакты.Видимость = Ложь;
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.ИсточникИнформации) Или Не ЗначениеЗаполнено(КандидатОбъект.АдресРезюме) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияПроверкиДоступностиКонтактов(УникальныйИдентификатор, 
		КандидатОбъект.ИсточникИнформации, КандидатОбъект.АдресРезюме);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиДоступностиКонтактов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПроверкиДоступностиКонтактов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстОшибки = НСтр("ru = 'Произошла ошибка при проверке доступности получения контактов кандидата с рекрутингового сайта.
				|См. подробности в Журнале регистрации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДоступностьКонтактов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УстановитьВидимостьПолученияКонтактов(ЭтотОбъект, ДоступностьКонтактов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПроверкиДоступностиКонтактов(ИдентификаторФормы, Сайт, АдресРезюме)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Определение доступности контактов резюме'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"РекрутинговыеСайты.ДоступныеДляПолученияКонтакты", Сайт, АдресРезюме);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПолученияКонтактов(Форма, ДоступностьКонтактов)

	Форма.Элементы.ПолучитьКонтакты.Видимость = Не ДоступностьКонтактов.КонтактыОткрыты;
	Форма.СкрытыеКонтактыПредставление = СтрСоединить(ДоступностьКонтактов.СкрытыеКандидатомКонтакты, ", ");
	
	Форма.Элементы.ПолучитьКонтакты.РасширеннаяПодсказка.Заголовок = Неопределено;
	Если Не ДоступностьКонтактов.КонтактыОткрыты И Не ПустаяСтрока(ДоступностьКонтактов.КонтактыМожноОткрытьПоАдресу) Тогда
		Форма.Элементы.ПолучитьКонтакты.РасширеннаяПодсказка.Заголовок = 
			НСтр("ru = 'Для открытия контактов кандидата необходимо приобрести доступ к базе резюме.
				 |Подробности в личном кабинете рекрутингового сайта.'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОжидаемыйДоход

&НаКлиенте
Функция ОжидаемыйДоходВИстории(ВалютаДохода, ПериодичностьДохода)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВалютаДохода", ВалютаДохода);
	Отбор.Вставить("ПериодичностьДохода", ПериодичностьДохода);
	Строки = ИсторияОжидаемогоДохода.НайтиСтроки(Отбор);
	
	ОжидаемыйДоход = Неопределено;
	Для Каждого НоваяСтрока Из Строки Цикл
		ОжидаемыйДоход = НоваяСтрока.ОжидаемыйДоход;
	КонецЦикла;
	
	Возврат ОжидаемыйДоход;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьОжидаемыйДоход(Форма, ОжидаемыйДоход, ВалютаДохода, ПериодичностьДохода)
	
	НоваяСтрока = Форма.ИсторияОжидаемогоДохода.Добавить();
	НоваяСтрока.ОжидаемыйДоход = ОжидаемыйДоход;
	НоваяСтрока.ВалютаДохода = ВалютаДохода;
	НоваяСтрока.ПериодичностьДохода = ПериодичностьДохода;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьОжидаемыйДоходПоУмолчанию(Форма, КандидатОбъект = Неопределено)
	
	Если КандидатОбъект = Неопределено Тогда
		КандидатОбъект = Форма.КандидатОбъект;
	КонецЕсли;

	Элементы = Форма.Элементы;
	
	Если КандидатОбъект.ОжидаемыйДоход = 0 Тогда
		Элементы.ОжидаемыйДоходВВалютеПоУмолчанию.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ВалютаПоУмолчанию = ЗарплатаКадрыВызовСервера.ВалютаУчетаЗаработнойПлаты();
	
	Если КандидатОбъект.ВалютаДохода = ВалютаПоУмолчанию Тогда
		Элементы.ОжидаемыйДоходВВалютеПоУмолчанию.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Сумма = ПодборПерсоналаКлиентСервер.СуммаВВалютеПоУмолчанию(КандидатОбъект.ОжидаемыйДоход, КандидатОбъект.ВалютаДохода);
	Если Сумма = КандидатОбъект.ОжидаемыйДоход Тогда
		Элементы.ОжидаемыйДоходВВалютеПоУмолчанию.Видимость = Ложь;
	Иначе
		Форма.ОжидаемыйДоходВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.ПредставлениеОжидаемогоДохода(Сумма, ВалютаПоУмолчанию);
		Элементы.ОжидаемыйДоходВВалютеПоУмолчанию.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	ЧастиКлюча = СтрРазделить(Ключ, ".");
	ВложеннаяСтруктура = Структура;
	Для Каждого ЧастьКлюча Из ЧастиКлюча Цикл
		Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВложеннаяСтруктура, ЧастьКлюча, ЗначениеПоУмолчанию);
		Если Значение = Неопределено Тогда
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
		ВложеннаяСтруктура = Значение;
	КонецЦикла;

	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область ОтображениеТабличныхЧастейЛичныхДанныхКанидата

&НаСервере
Процедура ЗаполнитьОбразованиеКвалификацию(ЭтоДругойКандидатФизЛица = Ложь)
	
	ЗаполнитьПредставлениеОбразования();
	ЗаполнитьПредставлениеКурсов();
	ЗаполнитьПредставлениеЗнаниеЯзыков();
	ЗаполнитьПредставлениеУченыеСтепени();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеЗнаниеЯзыков()
	
	Если ЛичныеДанныеКандидата.ЗнаниеЯзыков.Количество() = 0 Тогда
		ДоступностьИзменения = Ложь;
	Иначе
		ДоступностьИзменения = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛичныеДанныеКандидатаЗнаниеЯзыковИзменить", "Доступность", ДоступностьИзменения);
	
	Для Каждого СтрокаТаблицы Из ЛичныеДанныеКандидата.ЗнаниеЯзыков Цикл
		Представление = ПредставлениеЗаписиОЗнанииЯзыков(СтрокаТаблицы);
		СтрокаТаблицы.Представление = Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеЗаписиОЗнанииЯзыков(СтрокаТаблицы)
	
	ПредставлениеЗаписи = "";
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.Язык) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + Строка(СтрокаТаблицы.Язык);
		Если ЗначениеЗаполнено(СтрокаТаблицы.СтепеньЗнанияЯзыкаКандидата) Тогда
			СтепеньЗнанияЯзыкаКандидата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				СтрокаТаблицы.СтепеньЗнанияЯзыкаКандидата, "Наименование");
			ПредставлениеЗаписи = СтрШаблон(НСтр("ru = '%1 (%2)'"), ПредставлениеЗаписи, СтепеньЗнанияЯзыкаКандидата);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru = '%1'"), ПредставлениеЗаписи);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеОбразования()
	
	Если ЛичныеДанныеКандидата.Образование.Количество() = 0 Тогда
		ДоступностьИзменения = Ложь;
	Иначе
		ДоступностьИзменения = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛичныеДанныеКандидатаОбразованиеИзменить", "Доступность", ДоступностьИзменения);
	
	ЛичныеДанныеКандидата.Образование.Сортировать("ГодОкончания");
	
	НаименованияСпециальностей = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		ЛичныеДанныеКандидата.Образование.Выгрузить().ВыгрузитьКолонку("Специальность"), "Наименование");
	
	Для Каждого СтрокаТаблицы Из ЛичныеДанныеКандидата.Образование Цикл
		Представление = ПредставлениеЗаписиОбОбразовании(СтрокаТаблицы, НаименованияСпециальностей.Получить(СтрокаТаблицы.Специальность));
		СтрокаТаблицы.Представление = Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеЗаписиОбОбразовании(СтрокаТаблицы, НаименованиеСпециальности)
	
	ПредставлениеЗаписи = "";
	Если ЗначениеЗаполнено(СтрокаТаблицы.ВидОбразования) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + СтрокаТаблицы.ВидОбразования + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТаблицы.УчебноеЗаведение) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + СтрокаТаблицы.УчебноеЗаведение + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТаблицы.ГодОкончания) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + Формат((СтрокаТаблицы.ГодОкончания), "ЧГ=") + " г., ";
	КонецЕсли;
	Если ЗначениеЗаполнено(НаименованиеСпециальности) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + НаименованиеСпециальности + ", ";
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПредставлениеЗаписи, 2);
	
	Возврат СтрШаблон(НСтр("ru = '%1'"), ПредставлениеЗаписи);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеКурсов()
	
	Если ЛичныеДанныеКандидата.Курсы.Количество() = 0 Тогда
		ДоступностьИзменения = Ложь;
	Иначе
		ДоступностьИзменения = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛичныеДанныеКандидатаКурсыИзменить", "Доступность", ДоступностьИзменения);
	
	Для Каждого СтрокаТаблицы Из ЛичныеДанныеКандидата.Курсы Цикл
		Представление = ПредставлениеЗаписиОКурсе(СтрокаТаблицы);
		СтрокаТаблицы.Представление = Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеЗаписиОКурсе(СтрокаТаблицы)
	
	ПредставлениеЗаписи = "";
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.НаименованиеКурса) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + СтрокаТаблицы.НаименованиеКурса + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТаблицы.УчебноеЗаведение) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + СтрокаТаблицы.УчебноеЗаведение + ", ";
	КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТаблицы.ГодОкончания) Тогда
		ПредставлениеЗаписи = ПредставлениеЗаписи + Формат((СтрокаТаблицы.ГодОкончания), "ЧГ=") + " г., ";
	КонецЕсли;
	
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ПредставлениеЗаписи, 2);
	
	Возврат СтрШаблон(НСтр("ru = '%1'"), ПредставлениеЗаписи);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеУченыеСтепени()
	
	Если ЛичныеДанныеКандидата.УченыеСтепени.Количество() = 0 Тогда
		ДоступностьИзменения = Ложь;
	Иначе
		ДоступностьИзменения = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛичныеДанныеКандидатаУченыеСтепениИзменить", "Доступность", ДоступностьИзменения);
	
	Для Каждого СтрокаТаблицы Из ЛичныеДанныеКандидата.УченыеСтепени Цикл
		Представление = ПредставлениеЗаписиУченыеСтепени(СтрокаТаблицы);
		СтрокаТаблицы.Представление = Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеЗаписиУченыеСтепени(СтрокаТаблицы)
	
	ПредставлениеЗаписи = "";
	
	Если ЗначениеЗаполнено(СтрокаТаблицы.УченаяСтепень) Тогда
		ПредставлениеЗаписи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.УченаяСтепень, "Наименование");
		Если ЗначениеЗаполнено(СтрокаТаблицы.ДатаПрисужденияУченойСтепени) Тогда
			ПредставлениеЗаписи = СтрШаблон("%1, %2 г.", ПредставлениеЗаписи,
				 Формат(Год(СтрокаТаблицы.ДатаПрисужденияУченойСтепени), "ЧГ="));
		КонецЕсли;
	КонецЕсли;

	Возврат СтрШаблон(НСтр("ru = '%1'"), ПредставлениеЗаписи);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПредставлениеОпытаРаботы()
	
	ЛичныеДанныеКандидата.ОпытРаботы.Сортировать("ДатаНачала Убыв");
	
	Для Каждого СтрокаТаблицы Из ЛичныеДанныеКандидата.ОпытРаботы Цикл
		СтрокаТаблицы.ДатаНачалаПредставление = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(
			СтрокаТаблицы.ДатаНачала);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ДатаОкончания) Тогда
			СтрокаТаблицы.ДатаОкончанияПредставление = НСтр("ru = 'настоящее время'");
		Иначе
			СтрокаТаблицы.ДатаОкончанияПредставление = ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(
				СтрокаТаблицы.ДатаОкончания);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставлениеТабличнойЧасти(ИмяТабличнойЧасти)
	
	Если ИмяТабличнойЧасти = "Образование" Тогда
		ЗаполнитьПредставлениеОбразования();
	ИначеЕсли ИмяТабличнойЧасти = "Курсы" Тогда
		ЗаполнитьПредставлениеКурсов();
	ИначеЕсли ИмяТабличнойЧасти = "ЗнаниеЯзыков" Тогда
		ЗаполнитьПредставлениеЗнаниеЯзыков();
	ИначеЕсли ИмяТабличнойЧасти = "УченыеСтепени" Тогда
		ЗаполнитьПредставлениеУченыеСтепени();
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			СтрШаблон(НСтр("ru = 'Неизвестное имя табличной части %1'"), ИмяТабличнойЧасти),
			"ЗаполнитьПредставлениеТабличнойЧасти");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РедактированиеЛичныхДанныхКандидата

&НаСервере
Процедура ЗаполнитьСвязанныеОбъектыЛичныхДанныхКандидата(ОбъектЛичныеДанныеКандидата)

	СвязанныеОбъекты = Новый Структура();
	
	Если ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
		СвязанныеОбъекты.Вставить("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	КонецЕсли;
	
	СвязанныеОбъекты.Вставить("АдресФотографии", АдресФотографии);
	
	ОбъектЛичныеДанныеКандидата.ДополнительныеСвойства.Вставить("СвязанныеОбъекты", СвязанныеОбъекты);
	ОбъектЛичныеДанныеКандидата.ДополнительныеСвойства.Вставить("ЛичныеДанныеКандидатаСсылка",
		ЛичныеДанныеКандидатаСсылка);
		
	Если ЗначениеЗаполнено(ДанныеДляЗаполненияИзАрхива) Тогда
		ОбъектЛичныеДанныеКандидата.ДополнительныеСвойства.Вставить("ДанныеДляЗаполненияИзАрхива",
			ДанныеДляЗаполненияИзАрхива);
		ОбъектЛичныеДанныеКандидата.ДополнительныеСвойства.Вставить("УдалитьИзАрхива");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования()
	
	Если Не ЛичныеДанныеКандидатаЗаблокированы Тогда
		Возврат;
	КонецЕсли;
	
	РазблокироватьДанныеДляРедактирования(ЛичныеДанныеКандидатаСсылка, УникальныйИдентификатор);
	ЛичныеДанныеКандидатаЗаблокированы = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактированияНаСервере()
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(ЛичныеДанныеКандидатаСсылка, ЛичныеДанныеКандидатаВерсияДанных,
			УникальныйИдентификатор);
		ЛичныеДанныеКандидатаЗаблокированы = Истина;
	Исключение
		ЛичныеДанныеКандидатаЗаблокированы = Ложь;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьЛичныеДанныеКандидатаОбъект(Знач ОбъектЛичныеДанныеКандидата = Неопределено)
	
	Если КандидатОбъект.ЛичныеДанные.Пустая() Тогда
		КандидатОбъект.ЛичныеДанные = Справочники.ЛичныеДанныеКандидатов.ПолучитьСсылку();
	КонецЕсли;
	
	Если ОбъектЛичныеДанныеКандидата = Неопределено
		И ОбщегоНазначения.СсылкаСуществует(КандидатОбъект.ЛичныеДанные) Тогда
		ОбъектЛичныеДанныеКандидата = КандидатОбъект.ЛичныеДанные.ПолучитьОбъект();
		ДополнитьЛичныеДанные(ОбъектЛичныеДанныеКандидата, ЛичныеДанныеКандидата);
	КонецЕсли;
	
	ЛичныеДанныеКандидатаСсылка = КандидатОбъект.ЛичныеДанные;
		
	Если ОбъектЛичныеДанныеКандидата <> Неопределено Тогда
		
		ЗначениеВРеквизитФормы(ОбъектЛичныеДанныеКандидата, "ЛичныеДанныеКандидата");
		
		МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(
			ОбъектЛичныеДанныеКандидата.МестоРождения);
		
		// Контактная информация.
		УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ЛичныеДанныеКандидата,
			"ГруппаДополнительнаяКонтактнаяИнформация");
			
		// Фотография.
		Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
			АдресФотографии = ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(ОбъектЛичныеДанныеКандидата,
				"ДополнительныеСвойства.СвязанныеОбъекты.Адресфотографии");
			Если ЗначениеЗаполнено(АдресФотографии) Тогда
				Фотография = ПолучитьИзВременногоХранилища(АдресФотографии);
				АдресФотографии = ПоместитьВоВременноеХранилище(Фотография, УникальныйИдентификатор);
			Иначе
				АдресФотографии = ПодборПерсонала.АдресФотографииЛичныхДанныхКандидата(ЛичныеДанныеКандидатаСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.Гражданство) Тогда
		// Устанавливаем гражданство по умолчанию.
		ЛичныеДанныеКандидата.Гражданство = Справочники.СтраныМира.Россия;
	КонецЕсли;
	
	ЛичныеДанныеКандидатаВерсияДанных = ЛичныеДанныеКандидата.ВерсияДанных;
	ЗаполнитьОбразованиеКвалификацию();
	ЗаполнитьПредставлениеОпытаРаботы();
	
	ФИОИспользуется = Не ЛичныеДанныеКандидата.ФИООтсутствует;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьЛичныеДанные(ОбъектПриемник, ОбъектИсточник)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактированияНаСервере();
	
	ДополнитьТрудовуюДеятельность(ОбъектПриемник, ОбъектИсточник);
	ДополнитьЗнанияЯзыков(ОбъектПриемник, ОбъектИсточник);
	ДополнитьОбразование(ОбъектПриемник, ОбъектИсточник);
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицоСсылка - СправочникСсылка.ФизическиеЛица
//  РезультатВыбора - Структура
&НаСервере
Процедура ЗаполнитьОбъектЛичныеДанныеКандидатаПоФизЛицу(ФизическоеЛицоСсылка, РезультатВыбора)
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеСвязанныеСФизЛицом = ПодборПерсонала.ЛичныеДанныеКандидатаФизическогоЛица(ФизическоеЛицоСсылка);
	Если ЛичныеДанныеСвязанныеСФизЛицом <> Неопределено Тогда
		ЛичныеДанныеКандидатаСсылка = ЛичныеДанныеСвязанныеСФизЛицом;
		КандидатОбъект.ЛичныеДанные = ЛичныеДанныеСвязанныеСФизЛицом;
		Если РезультатВыбора.ВАрхивеФизическихЛиц Тогда
			ОбъектЛичныеДанныеКандидата = ЛичныеДанныеКандидатаПоДаннымВыбораПохожегоИзАрхива(РезультатВыбора,
				ЛичныеДанныеКандидатаСсылка);
			ДанныеДляЗаполненияИзАрхива = РезультатВыбора;
		Иначе
			ОбъектЛичныеДанныеКандидата = КандидатОбъект.ЛичныеДанные.ПолучитьОбъект();
			ДополнитьЛичныеДанные(ОбъектЛичныеДанныеКандидата, ЛичныеДанныеКандидата);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
			АдресФотографии = ПодборПерсонала.АдресФотографииЛичныхДанныхКандидата(ЛичныеДанныеКандидатаСсылка);
		КонецЕсли;
	Иначе
		Если КандидатОбъект.ЛичныеДанные.Пустая() Тогда
			ЛичныеДанныеКандидатаСсылка = Справочники.ЛичныеДанныеКандидатов.ПолучитьСсылку();
			КандидатОбъект.ЛичныеДанные = ЛичныеДанныеКандидатаСсылка;
		Иначе
			ЛичныеДанныеКандидатаСсылка = КандидатОбъект.ЛичныеДанные;
		КонецЕсли;
		
		Если РезультатВыбора.ВАрхивеФизическихЛиц Тогда
			ОбъектЛичныеДанныеКандидата = ЛичныеДанныеКандидатаПоДаннымВыбораПохожегоИзАрхива(РезультатВыбора,
				ЛичныеДанныеКандидатаСсылка);
			ДанныеДляЗаполненияИзАрхива = РезультатВыбора;
		Иначе
			ОбъектЛичныеДанныеКандидата = КандидатОбъект.ЛичныеДанные.ПолучитьОбъект();
			Если ОбъектЛичныеДанныеКандидата = Неопределено Тогда
				ОбъектЛичныеДанныеКандидата = РеквизитФормыВЗначение("ЛичныеДанныеКандидата");
			КонецЕсли;
			ОбъектЛичныеДанныеКандидата.Заполнить(ФизическоеЛицоСсылка);
			ДополнитьЛичныеДанные(ОбъектЛичныеДанныеКандидата, ЛичныеДанныеКандидата);
			Если Не ЗначениеЗаполнено(АдресФотографии) Тогда
				АдресФотографии = КадровыйУчетРасширенный.АдресФотографииФизическогоЛица(ФизическоеЛицоСсылка);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если КандидатОбъект.ЛичныеДанные.Пустая() Тогда
		КандидатОбъект.ЛичныеДанные = Справочники.ЛичныеДанныеКандидатов.ПолучитьСсылку();
	КонецЕсли;
	Если ОбъектЛичныеДанныеКандидата = Неопределено
		И ОбщегоНазначения.СсылкаСуществует(КандидатОбъект.ЛичныеДанные) Тогда
		ОбъектЛичныеДанныеКандидата = КандидатОбъект.ЛичныеДанные.ПолучитьОбъект();
		ДополнитьЛичныеДанные(ОбъектЛичныеДанныеКандидата, ЛичныеДанныеКандидата);
	КонецЕсли;
	ЗначениеВРеквизитФормы(ОбъектЛичныеДанныеКандидата, "ЛичныеДанныеКандидата");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования()
	
	Если ЛичныеДанныеКандидатаЗаблокированы Тогда
		// Уже заблокирован.
		Возврат;
	КонецЕсли;
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактированияНаСервере();
		
	Если ЛичныеДанныеКандидатаЗаблокированы Тогда
		Модифицированность = Истина;
		Возврат;
	КонецЕсли;
	
	// Не удалось заблокировать.
	ТекстПредупреждения = НСтр("ru = 'Не удается внести изменения в личные данные кандидата. 
                                |Возможно, личные данные этого кандидата редактируются другим пользователем.'");
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаписиТабличнойЧасти(ИмяФормы, ИмяТабличнойЧасти, НомерСтроки)
	
	ДополнительныеПараметры = Новый Структура("ИмяТабличнойЧасти,НомерСтроки", ИмяТабличнойЧасти, НомерСтроки); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуСтрокиТабличнойЧастиЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЭтоНоваяЗапись", Ложь);
	
	ДанныеСтрокиТабличнойЧасти = СтруктураТабличнойЧасти(ИмяТабличнойЧасти);
	Если НомерСтроки = ИдентификаторНовойСтроки() Тогда
		ПараметрыФормы.ЭтоНоваяЗапись = Истина;
	Иначе
		ЗаполнитьЗначенияСвойств(ДанныеСтрокиТабличнойЧасти,
			ЛичныеДанныеКандидата[ИмяТабличнойЧасти].НайтиПоИдентификатору(НомерСтроки));
	КонецЕсли;
	ПараметрыФормы.Вставить("ДанныеСтрокиТабличнойЧасти", ДанныеСтрокиТабличнойЧасти);
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСтрокиТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "УдалитьЗапись" Тогда
		УдалитьЗаписьТабличнойЧасти(ДополнительныеПараметры);
		ОтредактироватьРезюме(ДополнительныеПараметры.ИмяТабличнойЧасти);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Количество() > 0 Тогда
		ИмяТабличнойЧасти = ДополнительныеПараметры.ИмяТабличнойЧасти;
		НомерСтроки = ДополнительныеПараметры.НомерСтроки;
		
		Если НомерСтроки = ИдентификаторНовойСтроки() Тогда
			СтрокаДанных = ЛичныеДанныеКандидата[ИмяТабличнойЧасти].Добавить();
		Иначе
			СтрокаДанных = ЛичныеДанныеКандидата[ИмяТабличнойЧасти].НайтиПоИдентификатору(НомерСтроки);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаДанных, Результат);
		
		ЗаполнитьПредставлениеТабличнойЧасти(ИмяТабличнойЧасти);
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
		ОтредактироватьРезюме(ДополнительныеПараметры.ИмяТабличнойЧасти);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьТабличнойЧасти(ПараметрыУдаляемойЗаписи) Экспорт
	
	ИмяТабличнойЧасти = ПараметрыУдаляемойЗаписи.ИмяТабличнойЧасти;
	НомерСтроки = ПараметрыУдаляемойЗаписи.НомерСтроки;
	
	СтрокаДанных = ЛичныеДанныеКандидата[ИмяТабличнойЧасти].НайтиПоИдентификатору(НомерСтроки);
	ЛичныеДанныеКандидата[ИмяТабличнойЧасти].Удалить(СтрокаДанных);
	ЗаполнитьПредставлениеТабличнойЧасти(ИмяТабличнойЧасти);
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКомпании()
	
	ДополнительныеПараметры = Новый Структура("НомерСтроки", Элементы.ОпытРаботы.ТекущиеДанные.НомерСтроки); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуКомпанииЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Компания", Элементы.ОпытРаботы.ТекущиеДанные.Компания);
	ПараметрыФормы.Вставить("СфераДеятельностиКомпании", Элементы.ОпытРаботы.ТекущиеДанные.СфераДеятельностиКомпании);
	
	ОткрытьФорму("Справочник.ЛичныеДанныеКандидатов.Форма.ФормаКомпании", ПараметрыФормы, ЭтотОбъект, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКомпанииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЛичныеДанныеКандидата.ОпытРаботы[ДополнительныеПараметры.НомерСтроки - 1], Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьТрудовуюДеятельность(ОбъектПриемник, ОбъектИсточник)
	
	Для Каждого ТекущийОпытРаботы Из ОбъектИсточник.ОпытРаботы Цикл
		
		НовыйОпытРаботы = Неопределено;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Компания");
		Отбор.Вставить("ДатаНачала");
		Отбор.Вставить("ДатаОкончания");
		Отбор.Вставить("Должность");
		
		ЗаполнитьЗначенияСвойств(Отбор, ТекущийОпытРаботы);
		Если ЗначениеЗаполнено(ОбъектПриемник.ОпытРаботы.НайтиСтроки(Отбор)) Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("ДатаНачала, ДатаОкончания");
		ЗаполнитьЗначенияСвойств(Отбор, ТекущийОпытРаботы);
		НайденныеСтроки = ОбъектПриемник.ОпытРаботы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			НовыйОпытРаботы = НайденныеСтроки[0];
		КонецЕсли;
		
		Отбор = Новый Структура("Компания, ДатаНачала, Должность");
		ЗаполнитьЗначенияСвойств(Отбор, ТекущийОпытРаботы);
		НайденныеСтроки = ОбъектПриемник.ОпытРаботы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			НовыйОпытРаботы = НайденныеСтроки[0];
		КонецЕсли;
			
		Если НовыйОпытРаботы = Неопределено Тогда
			НовыйОпытРаботы = ОбъектПриемник.ОпытРаботы.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НовыйОпытРаботы, ТекущийОпытРаботы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьЗнанияЯзыков(ОбъектПриемник, ОбъектИсточник)
	
	Для Каждого СтрокаИсточник Из ОбъектИсточник.ЗнаниеЯзыков Цикл
		НайденныеСтроки = ОбъектПриемник.ЗнаниеЯзыков.НайтиСтроки(Новый Структура("Язык", СтрокаИсточник.Язык));
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			Если ЗначениеЗаполнено(СтрокаИсточник.СтепеньЗнанияЯзыкаКандидата)
					И НайденныеСтроки[0].СтепеньЗнанияЯзыкаКандидата <> СтрокаИсточник.СтепеньЗнанияЯзыкаКандидата Тогда
				НайденныеСтроки[0].СтепеньЗнанияЯзыкаКандидата = СтрокаИсточник.СтепеньЗнанияЯзыкаКандидата;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ОбъектПриемник.ЗнаниеЯзыков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьОбразование(ОбъектПриемник, ОбъектИсточник)
	
	Для Каждого СтрокаИсточник Из ОбъектИсточник.Образование Цикл
		
		Отбор = Новый Структура("ВидОбразования, УчебноеЗаведение, ГодОкончания");
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаИсточник);
		Отбор.УчебноеЗаведение = СтрокаИсточник.УчебноеЗаведение;
		Если ЗначениеЗаполнено(ОбъектПриемник.Образование.НайтиСтроки(Отбор)) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Неопределено;
		
		Отбор.Удалить("ГодОкончания");
		НайденныеСтроки = ОбъектПриемник.Образование.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 1 Тогда
			НоваяСтрока = НайденныеСтроки[0];
		КонецЕсли;

		Если НоваяСтрока = Неопределено Тогда
			НоваяСтрока = ОбъектПриемник.Образование.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсточник);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураТабличнойЧасти(ИмяТабличнойЧасти)
	
	СтруктураТабличнойЧасти = Новый Структура;
	Для Каждого Реквизит Из Метаданные.Справочники.ЛичныеДанныеКандидатов.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
		СтруктураТабличнойЧасти.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	Возврат СтруктураТабличнойЧасти;
	
КонецФункции

#КонецОбласти

#Область ДополнительнаяКонтактнаяИнформация

&НаСервере
Процедура ИзменитьОтображениеДополнительнойКонтактнойИнформации()
	
	КоличествоДополнительныхКонтактов = 0;
	ЗаполненныеДопКонтакты = Новый Массив;
	ВидыКИ = КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.Выгрузить(, "Вид").ВыгрузитьКолонку("Вид");
	ЗначенияВидовКИ = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВидыКИ, "Предопределенный, Наименование");
	Для Каждого КонтактнаяИнформация Из КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
		ЗначенияВидаКИ = ЗначенияВидовКИ.Получить(КонтактнаяИнформация.Вид);
		Если Не ЗначениеЗаполнено(ЗначенияВидаКИ) Или ЗначенияВидаКИ.Предопределенный Тогда
			Продолжить;
		КонецЕсли;
		КоличествоДополнительныхКонтактов = КоличествоДополнительныхКонтактов + 1;
		Если ЗначениеЗаполнено(КонтактнаяИнформация.Представление) Тогда
			ЗаполненныеДопКонтакты.Добавить(ЗначенияВидаКИ.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоДополнительныхКонтактов <= 2 Тогда
		Элементы.ГруппаДругиеКонтакты.ОтображатьЗаголовок = Ложь;
	Иначе
		КоличествоЗаполненныхКонтактов = ЗаполненныеДопКонтакты.Количество();
		Если КоличествоЗаполненныхКонтактов = 0 Тогда
			Элементы.ГруппаДругиеКонтакты.Заголовок = НСтр("ru = 'Другие контакты'");
		ИначеЕсли КоличествоЗаполненныхКонтактов <= 2 Тогда
			Элементы.ГруппаДругиеКонтакты.Заголовок = СтрШаблон(НСтр("ru = 'Другие контакты: %1'"),
				СтрСоединить(ЗаполненныеДопКонтакты, " и "));
		Иначе
			Элементы.ГруппаДругиеКонтакты.Заголовок = СтрШаблон(НСтр("ru = 'Другие контакты: %1, %2 и др.'"),
				ЗаполненныеДопКонтакты[0], ЗаполненныеДопКонтакты[1]);
		КонецЕсли;
		Элементы.ГруппаДругиеКонтакты.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИменаСтатическихКонтактов()
	
	ИменаСтатическихКонтактов = Новый Массив;
	ИменаСтатическихКонтактов.Добавить("КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов");
	ИменаСтатическихКонтактов.Добавить("КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов");
	ИменаСтатическихКонтактов.Добавить("КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов");
	ИменаСтатическихКонтактов.Добавить("КонтактнаяИнформацияПолеTelegramЛичныеДанныеКандидатов");
	ИменаСтатическихКонтактов.Добавить("КонтактнаяИнформацияПолеMAXЛичныеДанныеКандидатов");
	
	Возврат ИменаСтатическихКонтактов;
	
КонецФункции

#КонецОбласти

#Область Отклики

&НаСервере
Функция ЭтоНовыйОтклик()
	
	ЭтоНовыйОтклик = ТекущийЭтап.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
		И Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ГруппаДоступа);
	
	Возврат ЭтоНовыйОтклик;
	
КонецФункции

#КонецОбласти

#Область Резюме

&НаСервере
Процедура ОтредактироватьРезюме(ИмяБлока)
	
	ОчиститьБлокРезюме(ИмяБлока, Элементы);
	Если ИмяБлока = "ОпытРаботы" Тогда
		ЗаполнитьОпытРаботы(ЛичныеДанныеКандидата.ОпытРаботы, Элементы);
	ИначеЕсли ИмяБлока = "Образование" Тогда
		ЗаполнитьОбразование(ЛичныеДанныеКандидата.Образование, Элементы);
	ИначеЕсли ИмяБлока = "Курсы" Тогда
		ЗаполнитьКурсы(ЛичныеДанныеКандидата.Курсы, Элементы);
	ИначеЕсли ИмяБлока = "ЗнаниеЯзыков" Тогда
		ЗаполнитьЗнаниеЯзыков(ЛичныеДанныеКандидата.ЗнаниеЯзыков, Элементы);
	ИначеЕсли ИмяБлока = "УченыеСтепени" Тогда
		ЗаполнитьУченыеСтепени(ЛичныеДанныеКандидата.УченыеСтепени, Элементы);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаОтсчетаВозраста()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаСервереБезКонтекста
Функция ШрифтЗаголовкаРезюме()
	
	Возврат Метаданные.ЭлементыСтиля.ШрифтЗаголовкаРезюме.Значение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРезюме(Форма)
	
	Объект = Форма.КандидатОбъект;
	Элементы = Форма.Элементы;
	ЛичныеДанные = Форма.ЛичныеДанныеКандидата;
	КонтактнаяИнформация = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов;
	
	ЗаполнитьНазваниеРезюме(Объект, Элементы);
	ЗаполнитьОжидаемыйДоход(Объект, Элементы);
	ЗаполнитьЛичныеДанные(ЛичныеДанные, КонтактнаяИнформация, Элементы);
	ЗаполнитьКандидатОСебе(Объект, Элементы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьБлокРезюме(ИмяБлока, Элементы)
	
	Если ИмяБлока = "ОпытРаботы" Тогда
		ИмяГруппы = "ГруппаОпытРаботы";
	ИначеЕсли ИмяБлока = "Образование" Тогда
		ИмяГруппы = "ГруппаОбразование";
	ИначеЕсли ИмяБлока = "Курсы" Тогда
		ИмяГруппы = "ГруппаКурсы";
	ИначеЕсли ИмяБлока = "ЗнаниеЯзыков" Тогда
		ИмяГруппы = "ГруппаЗнаниеЯзыков";
	ИначеЕсли ИмяБлока = "УченыеСтепени" Тогда
		ИмяГруппы = "ГруппаУченыеСтепени";
	Иначе
		Возврат;
	КонецЕсли;
	
	ПодчиненныеЭлементы = Элементы[ИмяГруппы].ПодчиненныеЭлементы;
	Пока ПодчиненныеЭлементы.Количество() <> 1 Цикл
		Элементы.Удалить(ПодчиненныеЭлементы[1]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьНазваниеРезюме(Кандидат, Элементы)
	
	Если ЗначениеЗаполнено(Кандидат.НазваниеРезюме) Тогда
		НазваниеРезюме = Кандидат.НазваниеРезюме;
	Иначе
		НазваниеРезюме = НСтр("ru = 'Название резюме'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияНазваниеРезюме", "Заголовок", НазваниеРезюме);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОжидаемыйДоход(Кандидат, Элементы)
	
	Если ЗначениеЗаполнено(Кандидат.ОжидаемыйДоход) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ДекорацияОжидаемыйДоход", "Заголовок", ОжидаемыйДоходРезюме(Кандидат));
		ВидимостьОжидаемогоДохода = Истина;
	Иначе
		ВидимостьОжидаемогоДохода = Ложь;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОжидаемыйДоход", "Видимость", ВидимостьОжидаемогоДохода);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЛичныеДанные(ЛичныеДанные, КонтактнаяИнформация, Элементы)
	
	РедактироватьЛичныеДанные = Ложь;
	ЗаполнитьМестоРожденияГражданство(ЛичныеДанные, Элементы, РедактироватьЛичныеДанные);
	ЗаполнитьВозрастПолСемейноеПоложение(ЛичныеДанные, Элементы, РедактироватьЛичныеДанные);
	ЗаполнитьКонтактнуюИнформацию(КонтактнаяИнформация, Элементы, РедактироватьЛичныеДанные);
	ЗаполнитьОпытРаботы(ЛичныеДанные.ОпытРаботы, Элементы);
	ЗаполнитьОбразование(ЛичныеДанные.Образование, Элементы);
	ЗаполнитьКурсы(ЛичныеДанные.Курсы, Элементы);
	ЗаполнитьЗнаниеЯзыков(ЛичныеДанные.ЗнаниеЯзыков, Элементы);
	ЗаполнитьУченыеСтепени(ЛичныеДанные.УченыеСтепени, Элементы);
	
	Если РедактироватьЛичныеДанные Тогда
		ЗаголовокРедактированияЛичныхДанных = НСтр("ru = 'Редактировать'");
	Иначе
		ЗаголовокРедактированияЛичныхДанных = НСтр("ru = 'Добавить личные данные'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьЛичныеДанные", "Заголовок", ЗаголовокРедактированияЛичныхДанных);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьМестоРожденияГражданство(ЛичныеДанные, Элементы, РедактироватьЛичныеДанные = Неопределено)
	
	МестоРожденияГражданство = Новый Массив;
	
	Если ЗначениеЗаполнено(ЛичныеДанные.МестоРождения) Тогда
		РедактироватьЛичныеДанные = Истина;
		МестоРожденияГражданство.Добавить(СтрШаблон(НСтр("ru = 'Место рождения: %1'"),
			Прав(ЛичныеДанные.МестоРождения, СтрДлина(ЛичныеДанные.МестоРождения) - 2)));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанные.Гражданство) Тогда
		МестоРожденияГражданство.Добавить(СтрШаблон(НСтр("ru = 'Гражданство: %1'"),
			ЛичныеДанные.Гражданство));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияМестоРожденияГражданство", "Заголовок",
		СтрСоединить(МестоРожденияГражданство, ", "));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВозрастПолСемейноеПоложение(ЛичныеДанные, Элементы, РедактироватьЛичныеДанные = Неопределено)
	
	ВозрастПолСемейноеПоложение = Новый Массив;
	
	ДатаРождения = ЛичныеДанные.ДатаРождения;
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		ВозрастРезюме = ВозрастРезюме(ДатаРождения, ДатаОтсчетаВозраста());
		РедактироватьЛичныеДанные = Истина;
	Иначе
		ВозрастРезюме = НСтр("ru = 'Возраст не указан'");
	КонецЕсли;
	ВозрастПолСемейноеПоложение.Добавить(ВозрастРезюме);
	
	ПолРезюме = ПолРезюме(ЛичныеДанные);
	Если ЗначениеЗаполнено(ПолРезюме) Тогда
		РедактироватьЛичныеДанные = Истина;
		ВозрастПолСемейноеПоложение.Добавить(ПолРезюме);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛичныеДанные.СостояниеВБраке) Тогда
		РедактироватьЛичныеДанные = Истина;
		ВозрастПолСемейноеПоложение.Добавить(НРег(ЛичныеДанные.СостояниеВБраке));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияВозрастПолСемейноеПоложение", "Заголовок",
		СтрСоединить(ВозрастПолСемейноеПоложение, ", "));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКонтактнуюИнформацию(КонтактнаяИнформация, Элементы, РедактироватьЛичныеДанные = Неопределено)
	
	Для Каждого Контакт Из КонтактнаяИнформация Цикл
		Если Контакт.ИмяРеквизита = "КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов" Тогда
			Если Не ЗначениеЗаполнено(Контакт.Представление) Тогда
				ВидимостьТелефона = Ложь;
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияТелефон", "Заголовок", Контакт.Представление);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияТелефонКомментарий", "Заголовок", Контакт.Комментарий);
				ВидимостьТелефона = Истина;
				РедактироватьЛичныеДанные = Истина;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаТелефон", "Видимость", ВидимостьТелефона);
			Продолжить;
		КонецЕсли;
		
		Если Контакт.ИмяРеквизита = "КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов" Тогда
			Если Не ЗначениеЗаполнено(Контакт.Представление) Тогда
				ВидимостьПочты = Ложь;
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияПочта", "Заголовок", Контакт.Представление);
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияПочтаКомментарий", "Заголовок", Контакт.Комментарий);
				ВидимостьПочты = Истина;
				РедактироватьЛичныеДанные = Истина;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаПочта", "Видимость", ВидимостьПочты);
			Продолжить;
		КонецЕсли;
		
		Если Контакт.ИмяРеквизита = "КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов" Тогда
			Если Не ЗначениеЗаполнено(Контакт.Представление) Тогда
				ВидимостьАдреса = Ложь;
			Иначе
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Элементы, "ДекорацияАдрес", "Заголовок", Контакт.Представление);
				ВидимостьАдреса = Истина;
				РедактироватьЛичныеДанные = Истина;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ГруппаАдрес", "Видимость", ВидимостьАдреса);
			Продолжить;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОпытРаботы(ОпытРаботы, Элементы)
	
	Если ОпытРаботы.Количество() = 0 Тогда
		БезОпытаРаботы = Истина;
		ЗаголовокРедактироватьОпытРаботы = НСтр("ru = 'Добавить опыт работы'");
	Иначе
		БезОпытаРаботы = Ложь;
		ЗаголовокРедактироватьОпытРаботы = НСтр("ru = 'Редактировать'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОпытРаботы", "Видимость", БезОпытаРаботы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьОпытРаботы", "Заголовок", ЗаголовокРедактироватьОпытРаботы);
	
	Для Каждого Работа Из ОпытРаботы Цикл
		ИмяГруппы = "ГруппаОпытРаботы" + Работа.НомерСтроки;
		Группа = Элементы.Найти(ИмяГруппы);
		Если Группа <> Неопределено Тогда
			Элементы.Удалить(Группа);
		КонецЕсли;
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаОпытРаботы);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НовыйЭлемент = Элементы.Добавить("ОпытРаботыКомпанияСтаж" + Работа.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Шрифт = ШрифтЗаголовкаРезюме();
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1, %2 - %3, %4'"),
			Работа.Компания,
			Работа.ДатаНачалаПредставление,
			Работа.ДатаОкончанияПредставление,
			СтажПоОпытуРаботы(Работа.ДатаНачала, Работа.ДатаОкончания));
		
		НовыйЭлемент = Элементы.Добавить("ОпытРаботыДолжность" + Работа.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = Работа.Должность;
		
		НовыйЭлемент = Элементы.Добавить("ОпытРаботыОбязанности" + Работа.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = Работа.Обязанности;
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОбразование(Образования, Элементы)
	
	Если Образования.Количество() = 0 Тогда
		БезОбразования = Истина;
		ЗаголовокРедактироватьОбразование = НСтр("ru = 'Добавить образование'");
	Иначе
		БезОбразования = Ложь;
		ЗаголовокРедактироватьОбразование = НСтр("ru = 'Редактировать'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОбразование", "Видимость", БезОбразования);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьОбразование", "Заголовок", ЗаголовокРедактироватьОбразование);
	
	Для Каждого Образование Из Образования Цикл
		ИмяГруппы = "ГруппаОбразование" + Образование.НомерСтроки;
		Группа = Элементы.Найти(ИмяГруппы);
		Если Группа <> Неопределено Тогда
			Элементы.Удалить(Группа);
		КонецЕсли;
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаОбразование);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НовыйЭлемент = Элементы.Добавить("ОбразованиеУчебноеЗаведениеПериод" + Образование.НомерСтроки,
			Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Шрифт = ШрифтЗаголовкаРезюме();
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1%2'"),
			Образование.УчебноеЗаведение,
			?(Образование.ГодОкончания = 0, "", ", " + Формат((Образование.ГодОкончания), "ЧГ=") + " г."));
		
		НовыйЭлемент = Элементы.Добавить("ОбразованиеСпециальностьВидОбразования" + Образование.НомерСтроки,
			Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"),
			Образование.Специальность,
			Образование.ВидОбразования);
		
		НовыйЭлемент = Элементы.Добавить("ОбразованиеФакультет" + Образование.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = Образование.Факультет;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКурсы(Курсы, Элементы)
	
	Если Курсы.Количество() = 0 Тогда
		БезКурсов = Истина; 
		ЗаголовокРедактироватьКурсы = НСтр("ru = 'Добавить курсы'");
	Иначе
		БезКурсов = Ложь;
		ЗаголовокРедактироватьКурсы = НСтр("ru = 'Редактировать'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияКурсы", "Видимость", БезКурсов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьКурсы", "Заголовок", ЗаголовокРедактироватьКурсы);
	
	Для Каждого Курс Из Курсы Цикл
		ИмяГруппы = "ГруппаКурс" + Курс.НомерСтроки;
		Группа = Элементы.Найти(ИмяГруппы);
		Если Группа <> Неопределено Тогда
			Элементы.Удалить(Группа);
		КонецЕсли;
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаКурсы);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Элементы.Добавить("Курс" + Курс.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1, %2, %3'"),
			Курс.НаименованиеКурса,
			Курс.УчебноеЗаведение,
			Формат((Курс.ГодОкончания), "ЧГ=") + " г.");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗнаниеЯзыков(ЗнаниеЯзыков, Элементы)
	
	Если ЗнаниеЯзыков.Количество() = 0 Тогда
		БезЗнанияЯзыков = Истина;
		ЗаголовокРедактироватьЗнаниеЯзыков = НСтр("ru = 'Добавить знание языков'");
	Иначе
		БезЗнанияЯзыков = Ложь;
		ЗаголовокРедактироватьЗнаниеЯзыков = НСтр("ru = 'Редактировать'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияИностранныеЯзыки", "Видимость", БезЗнанияЯзыков);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьЗнаниеЯзыков", "Заголовок", ЗаголовокРедактироватьЗнаниеЯзыков);
	
	Для Каждого ЗнаниеЯзыка Из ЗнаниеЯзыков Цикл
		ИмяГруппы = "ГруппаЗнаниеЯзыка" + ЗнаниеЯзыка.НомерСтроки;
		Группа = Элементы.Найти(ИмяГруппы);
		Если Группа <> Неопределено Тогда
			Элементы.Удалить(Группа);
		КонецЕсли;
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаЗнаниеЯзыков);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Элементы.Добавить("ЗнаниеЯзыка" + ЗнаниеЯзыка.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1 - %2'"),
			ЗнаниеЯзыка.Язык,
			ЗнаниеЯзыка.СтепеньЗнанияЯзыкаКандидата);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьУченыеСтепени(УченыеСтепени, Элементы)
	
	Если УченыеСтепени.Количество() = 0 Тогда
		БезУченыхСтепеней = Истина;
		ЗаголовокРедактироватьУченыеСтепени = НСтр("ru = 'Добавить ученые степени'");
	Иначе
		БезУченыхСтепеней = Ложь;
		ЗаголовокРедактироватьУченыеСтепени = НСтр("ru = 'Редактировать'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияУченыеСтепени", "Видимость", БезУченыхСтепеней);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьУченыеСтепени", "Заголовок", ЗаголовокРедактироватьУченыеСтепени);
	
	Для Каждого УченаяСтепень Из УченыеСтепени Цикл
		ИмяГруппы = "ГруппаУченаяСтепень" + УченаяСтепень.НомерСтроки;
		Группа = Элементы.Найти(ИмяГруппы);
		Если Группа <> Неопределено Тогда
			Элементы.Удалить(Группа);
		КонецЕсли;
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаУченыеСтепени);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		
		НовыйЭлемент = Элементы.Добавить("УченаяСтепень" + УченаяСтепень.НомерСтроки, Тип("ДекорацияФормы"), Группа);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1, %2'"),
			УченаяСтепень.УченаяСтепень,
			Формат(Год(УченаяСтепень.ДатаПрисужденияУченойСтепени), "ЧГ=") + " г.");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКандидатОСебе(Кандидат, Элементы)
	
	ЕстьСопроводительноеПисьмо = ЗначениеЗаполнено(Кандидат.СопроводительноеПисьмо);
	Если ЗначениеЗаполнено(Кандидат.ОСебе) Тогда
		ОСебе = Кандидат.ОСебе;
		ЗаголовокРедактироватьКандидатОСебе = НСтр("ru = 'Редактировать'");
	Иначе
		Если ЕстьСопроводительноеПисьмо Тогда
			ОСебе = "";
		Иначе
			ОСебе = НСтр("ru = 'Информация не указана'");
		КонецЕсли;
		ЗаголовокРедактироватьКандидатОСебе = НСтр("ru = 'Добавить информацию о кандидате'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОСебе", "Видимость", ЗначениеЗаполнено(ОСебе));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияОСебе", "Заголовок", ОСебе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаРедактироватьКандидатОСебе", "Заголовок", ЗаголовокРедактироватьКандидатОСебе);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияСопроводительноеПисьмо", "Видимость", ЕстьСопроводительноеПисьмо);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДекорацияСопроводительноеПисьмо", "Заголовок",
		СтрШаблон(НСтр("ru = 'В сопроводительном письме:%1%1%2'"), Символы.ПС, Кандидат.СопроводительноеПисьмо));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтажПоОпытуРаботы(ДатаНачала, ДатаОкончания)
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ДатаОтсчетаВозраста();
	КонецЕсли;
	
	СтажМесяцевВсего = ЗарплатаКадрыРасширенныйКлиентСервер.РазницаВМесяцах(ДатаНачала, ДатаОкончания);
	МесяцевВГоду = 12;
	СтажЛет = Цел(СтажМесяцевВсего / МесяцевВГоду);
	СтажМесяцев = СтажМесяцевВсего % МесяцевВГоду;
	
	Если ЗначениеЗаполнено(СтажЛет) Тогда
		СклонениеЛет = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 год;;%1 года;%1 лет;'"), СтажЛет);
	Иначе
		СклонениеЛет = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтажМесяцев) Тогда
		СклонениеМесяцев = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 месяц;;%1 месяца;%1 месяцев;'"), СтажМесяцев); 
	Иначе
		СклонениеМесяцев = "";
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru = '%1 %2'"), СклонениеЛет, СклонениеМесяцев);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОжидаемыйДоходРезюме(Кандидат)
	
	Возврат СтрШаблон(НСтр("ru = '%1 %2 %3'"),
		Кандидат.ОжидаемыйДоход,
		Кандидат.ВалютаДохода,
		Кандидат.ПериодичностьДохода);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВозрастРезюме(ДатаРождения, ДатаВозраста)
	
	Если ДатаРождения > ДатаВозраста Тогда
		ДатаВозраста = ДатаРождения;
	КонецЕсли;
	
	Возврат ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(ДатаРождения, ДатаВозраста);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолРезюме(ЛичныеДанные)
	
	Пол = ЛичныеДанные.Пол;
	Если Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской") Тогда
		ПолРезюме = НСтр("ru = 'мужчина'");
	ИначеЕсли Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский") Тогда
		ПолРезюме = НСтр("ru = 'женщина'");
	Иначе
		ПолРезюме = "";
	КонецЕсли;
	
	Возврат ПолРезюме;
	
КонецФункции

#КонецОбласти

#Область ЛентаСобытий

&НаСервере
Процедура ЗаполнитьЛентуСобытий()
	
	ЭлементыЛентыСобытий = Элементы["ГруппаСобытия"].ПодчиненныеЭлементы;
	Пока ЭлементыЛентыСобытий.Количество() <> 0 Цикл
		Элементы.Удалить(ЭлементыЛентыСобытий[0]);
	КонецЦикла;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"Кандидаты", "НастройкиЛентыСобытий", ПодборПерсонала.НастройкиЛентыСобытийПоУмолчанию());
	
	События = ТаблицаСобытий();
	
	Если Настройки.СозданиеКандидата Тогда
		ДобавитьСобытиеСозданиеКандидата(События, КандидатОбъект, ЛичныеДанныеКандидата.Пол);
	КонецЕсли;
	Если Настройки.РаботаСКандидатами Тогда
		ДобавитьСобытияРаботыСКандидатом(События, РаботаСКандидатамиНаборЗаписей, КандидатОбъект);
	КонецЕсли;
	Если Настройки.Комментарии Тогда
		ДобавитьСобытияКомментарии(События, КомментарииКандидатовНаборЗаписей);
	КонецЕсли;
	Если Настройки.Оценки Тогда
		ДобавитьСобытияОценки(События, КандидатОбъект.Оценки, КандидатОбъект.ДатаРегистрации);
	КонецЕсли;
	Если Настройки.ЗагрузкаФайловПоКандидату Тогда
		ДобавитьСобытияЗагрузкаФайлов(События, КандидатСсылка, ДанныеПрисоединенныхФайлов);
	КонецЕсли;
	
	ДобавлениеИнформации = Настройки.ДобавлениеИнформацииПоКандидату;
	ИзменениеИнформации = Настройки.ИзменениеИнформацииПоКандидату;
	Если ДобавлениеИнформации Или ИзменениеИнформации Тогда
		ДобавитьСобытияИзменениеИнформации(События, КандидатСсылка, ЛичныеДанныеКандидатаСсылка,
			ДобавлениеИнформации, ИзменениеИнформации);
	КонецЕсли;
	
	События.Сортировать("Период");
	КоличествоСобытий = 0;
	Для Каждого Событие Из События Цикл
		ДобавитьСобытиеВЛенту(Событие);
		КоличествоСобытий = КоличествоСобытий + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьИзменениеКомментарияНаСервере(Результат, ДополнительныеПараметры)
	
	НомерКомментария = ДополнительныеПараметры.НомерКомментария;
	СтрокиНабора = КомментарииКандидатовНаборЗаписей.НайтиСтроки(Новый Структура("ИсходныйНомерСтроки", НомерКомментария));
	Если СтрокиНабора.Количество() <> 0 Тогда
		СтрокаНабора = СтрокиНабора[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Изменение Тогда
		ЗаполнитьЗначенияСвойств(СтрокаНабора, Результат.Данные);
		СтрокаНабора.Комментарий = Результат.Данные.Комментарий;
		СтрокаНабора.Период = ТекущаяДатаСеанса();
		СтрокаНабора.Кандидат = КандидатСсылка;
		ЗаписатьКомментарии();
		УдалитьКомментарийИзЛентыСобытий(НомерКомментария);
		ДобавитьКомментарийВЛентуСобытий(СтрокаНабора);
	ИначеЕсли Результат.Действие = ПодборПерсоналаКлиентСервер.ДействияСКомментариемПриРедактировании().Удаление Тогда
		КомментарииКандидатовНаборЗаписей.Удалить(СтрокаНабора);
		УдалитьКомментарийИзЛентыСобытий(НомерКомментария);
		КомментарииУдалены = Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			НСтр("ru = 'Неопознанное действие в результате редактирования комментария'"),
			"Справочник.Кандидаты.Формы.ФормаЭлемента");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОставитьКомментарийНаСервере()
	
	СтрокаНабора = КомментарииКандидатовНаборЗаписей.Добавить();
	СтрокаНабора.Период = ТекущаяДатаСеанса();
	СтрокаНабора.Кандидат = КандидатСсылка;
	СтрокаНабора.Пользователь = Пользователи.ТекущийПользователь();
	СтрокаНабора.Комментарий = Комментарий;
	СтрокаНабора.Доступность = ?(КомментарийВиденТолькоМне,
		Перечисления.ДоступностьКомментарияКандидата.ТолькоДляАвтора,
		Перечисления.ДоступностьКомментарияКандидата.Общедоступный);
	
	НачатьТранзакцию();
	Попытка
		Идентификатор = КомментарииКандидатовНаборЗаписей.Количество() - 1;
		ДобавитьКомментарийВЛентуСобытий(КомментарииКандидатовНаборЗаписей.Получить(Идентификатор));
		ЗаписатьКомментарии();
		ЗаполнитьЛентуСобытий();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Комментарии кандидатов'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКомментарии()
	
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	
	// Пользователь имеет права только на изменение своих комментариев, поэтому меняем набор с отбором по текущему пользователю.
	НаборЗаписей = РегистрыСведений.КомментарииКандидатов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кандидат.Установить(КандидатСсылка);
	НаборЗаписей.Отбор.Пользователь.Установить(АвторизованныйПользователь);
	
	// Добавляем все комментарии текущего пользователя из текущей формы.
	Для Каждого СтрокаНабора Из КомментарииКандидатовНаборЗаписей Цикл
		Если СтрокаНабора.Пользователь = АвторизованныйПользователь Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
			НоваяСтрока.Кандидат = КандидатСсылка;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	ЗначениеВРеквизитФормы(НаборЗаписей, "КомментарииКандидатовНаборЗаписей");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКомментарийВЛентуСобытий(СтрокаНабора)
	
	ДопустимаяДлинаКомментария = ДопустимаяДлинаКомментария();
	
	СобытиеКомментарий = Новый Структура;
	СобытиеКомментарий.Вставить("Период", СтрокаНабора.Период);
	СобытиеКомментарий.Вставить("Автор", ПредставлениеОтветственного(СтрокаНабора.Пользователь));
	СобытиеКомментарий.Вставить("ВидСобытия", Перечисления.СобытияПоКандидату.Комментарий);
	СобытиеКомментарий.Вставить("Гиперссылка", Истина);
	СобытиеКомментарий.Вставить("НомерСобытия", СтрокаНабора.ИсходныйНомерСтроки);
	СобытиеКомментарий.Вставить("ПредметСобытия", "");
	Текст = Лев(СтрокаНабора.Комментарий, ДопустимаяДлинаКомментария);
	НомерСимволаПереноса = СтрНайти(Текст, Символы.ПС);
	Если НомерСимволаПереноса <> 0 Тогда
		Текст = Лев(Текст, НомерСимволаПереноса - 1);
	КонецЕсли;
	Если СтрДлина(СтрокаНабора.Комментарий) > ДопустимаяДлинаКомментария Тогда
		ТекстСобытия = СтрШаблон(НСтр("ru = '%1...'"), Текст);
	Иначе
		ТекстСобытия = Текст;
	КонецЕсли;
	СобытиеКомментарий.Вставить("ТекстСобытия", ТекстСобытия);
	
	ДобавитьСобытиеВЛенту(СобытиеКомментарий);
	КоличествоСобытий = КоличествоСобытий + 1;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКомментарийИзЛентыСобытий(НомерКомментария)
	
	Элементы.Удалить(Элементы["ГруппаКомментарий" + НомерКомментария]);
	КоличествоСобытий = КоличествоСобытий - 1;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКомментарии(ОбъектКандидат, КандидатСсылка)
	
	ЗагрузитьКомментарииРекрутинговыхСайтов(КандидатСсылка);
	
	Если ТипЗнч(ОбъектКандидат) = Тип("СправочникОбъект.Кандидаты") И ОбъектКандидат.ЭтоНовый() Тогда
		НаборЗаписей = СвойствоСтруктуры(ОбъектКандидат.ДополнительныеСвойства, "СвязанныеОбъекты.КомментарииКандидатов");
		Если НаборЗаписей <> Неопределено Тогда
			ЗначениеВРеквизитФормы(НаборЗаписей, "КомментарииКандидатовНаборЗаписей");
		КонецЕсли;
	Иначе
		ПрочитатьКомментарииИзРегистраСведений(КандидатСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьДобавленияИзмененияКомментариев()
	
	ДобавлениеИзменениеКомментариевДоступно = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.КомментарииКандидатов);
	Если ДобавлениеИзменениеКомментариевДоступно Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаКомментарий.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКомментарииРекрутинговыхСайтов(КандидатСсылка)
	РекрутинговыеСайты.ЗагрузитьКомментарииКандидата(КандидатСсылка);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКомментарииИзРегистраСведений(КандидатСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидат", КандидатСсылка);
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КомментарииКандидатов.Период КАК Период,
		|	КомментарииКандидатов.Кандидат КАК Кандидат,
		|	КомментарииКандидатов.Пользователь КАК Пользователь,
		|	КомментарииКандидатов.Комментарий КАК Комментарий,
		|	КомментарииКандидатов.Доступность КАК Доступность,
		|	КомментарииКандидатов.МестоПубликации КАК МестоПубликации,
		|	КомментарииКандидатов.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.КомментарииКандидатов КАК КомментарииКандидатов
		|ГДЕ
		|	КомментарииКандидатов.Кандидат = &Кандидат
		|	И (КомментарииКандидатов.Доступность = ЗНАЧЕНИЕ(Перечисление.ДоступностьКомментарияКандидата.Общедоступный)
		|			ИЛИ КомментарииКандидатов.Пользователь = &ТекущийПользователь)";
		
	НаборЗаписей = РегистрыСведений.КомментарииКандидатов.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ЗначениеВРеквизитФормы(НаборЗаписей, "КомментарииКандидатовНаборЗаписей");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСобытиеВЛенту(Событие)
	
	Группа = Элементы.ГруппаСобытия;
	ИмяСобытия = ИмяСобытия(Событие.ВидСобытия);
	НомерСобытия = Событие.НомерСобытия;
	ПредметСобытия = Событие.ПредметСобытия;
	
	ГруппаСобытие = Элементы.Добавить("Группа" + ИмяСобытия + ПредметСобытия + НомерСобытия, Тип("ГруппаФормы"), Группа);
	ГруппаСобытие.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСобытие.ОтображатьЗаголовок = Ложь;
	ГруппаСобытие.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Если КоличествоСобытий <> 0 Тогда
		НовыйЭлемент = Элементы.Добавить("ДекорацияОтступ" + ИмяСобытия + ПредметСобытия + НомерСобытия,
			Тип("ДекорацияФормы"), ГруппаСобытие);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
		НовыйЭлемент.Картинка = БиблиотекаКартинок.ЛентаСобытийОтступ;
	КонецЕсли;
	
	ГруппаСобытиеОсновное = Элементы.Добавить("ГруппаОсновное" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ГруппаФормы"), ГруппаСобытие);
	ГруппаСобытиеОсновное.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСобытиеОсновное.ОтображатьЗаголовок = Ложь;
	ГруппаСобытиеОсновное.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияКартинка" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ДекорацияФормы"), ГруппаСобытиеОсновное);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = КартинкаПоВидуСобытия(Событие.ВидСобытия);
	
	ГруппаСобытиеАвторДатаТекст = Элементы.Добавить("ГруппаАвторДатаТекст" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ГруппаФормы"), ГруппаСобытиеОсновное);
	ГруппаСобытиеАвторДатаТекст.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСобытиеАвторДатаТекст.ОтображатьЗаголовок = Ложь;
	ГруппаСобытиеАвторДатаТекст.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияАвторДата" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ДекорацияФормы"), ГруппаСобытиеАвторДатаТекст);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	Если Час(Событие.Период) = 0 И Минута(Событие.Период) = 0 Тогда
		ФорматнаяСтрока = "ДЛФ=D";
	Иначе
		ФорматнаяСтрока = "ДФ='dd.MM.yyyy ЧЧ:мм'";
	КонецЕсли;
	Если Событие.Период = ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата() Тогда
		Событие.Период = Неопределено;
	КонецЕсли;
	НовыйЭлемент.Заголовок = СтрШаблон(НСтр("ru = '%1 %2'"), Событие.Автор,
		Формат(Событие.Период, ФорматнаяСтрока));
	НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветТекстаЛентыСобытийВспомогательный;
	НовыйЭлемент.Шрифт = ШрифтыСтиля.ШрифтЛентыСобытийВспомогательный;
	
	ГруппаСобытиеТекст = Элементы.Добавить("ГруппаТекст" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ГруппаФормы"), ГруппаСобытиеАвторДатаТекст);
	ГруппаСобытиеТекст.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСобытиеТекст.ОтображатьЗаголовок = Ложь;
	ГруппаСобытиеТекст.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСобытиеТекст.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	Если Событие.Гиперссылка Тогда
		НовыйЭлемент = Элементы.Добавить("ДекорацияЗаголовок" + ИмяСобытия + ПредметСобытия + НомерСобытия,
			Тип("ДекорацияФормы"), ГруппаСобытиеТекст);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.Заголовок = ЗаголовокСобытия(ЭтотОбъект, Событие.ВидСобытия, ПредметСобытия, НомерСобытия);
		НовыйЭлемент.Шрифт = ШрифтыСтиля.ШрифтЛентыСобытийОсновной;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияТекст" + ИмяСобытия + ПредметСобытия + НомерСобытия,
		Тип("ДекорацияФормы"), ГруппаСобытиеТекст);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок = Событие.ТекстСобытия;
	НовыйЭлемент.Шрифт = ШрифтыСтиля.ШрифтЛентыСобытийОсновной;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	Если Событие.Гиперссылка Тогда
		НовыйЭлемент.Гиперссылка = Истина;
		Если Событие.ВидСобытия = Перечисления.СобытияПоКандидату.Комментарий Тогда
			Действие = "Подключаемый_НачатьИзменениеКомментария";
		ИначеЕсли Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ЗагрузкаФайлов Тогда
			Действие = "Подключаемый_ОткрытьФайл";
		ИначеЕсли Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ДобавлениеИнформации
			Или Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ИзменениеИнформации Тогда
			Действие = "Подключаемый_ОткрытьВерсию";
		ИначеЕсли СобытиеЭтапРаботы(Событие.ВидСобытия) Тогда
			Действие = "Подключаемый_ОткрытьКарточкуЭтапа";
			СоздатьКомандыЭтапаРаботы(ЭтотОбъект, Событие.ВидСобытия, НомерСобытия, ГруппаСобытиеТекст);
		КонецЕсли;
		НовыйЭлемент.УстановитьДействие("Нажатие", Действие);
	Иначе
		НовыйЭлемент.ЦветТекста = ЦветаСтиля.ЦветТекстаЛентыСобытийОсновной;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИзменениеКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьИзменениеКомментарияНаСервере(Результат, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПередЗакрытиемВопрос() Экспорт
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("КомментарийПередЗакрытиемЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗакрытии, СтрШаблон(НСтр("ru = 'Сохранить комментарий ""%1""?'"), Комментарий),
		РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтветПередЗакрытием = Истина;
		ОставитьКомментарийНаСервере();
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОтветПередЗакрытием = Истина;
		Закрыть();
	Иначе
		ОтветПередЗакрытием = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСобытиеСозданиеКандидата(События, Кандидат, Пол)
	
	Событие = События.Добавить();
	Событие.Период = Кандидат.ДатаРегистрации;
	Событие.Автор = ПредставлениеОтветственного(Кандидат.Ответственный);
	Событие.ТекстСобытия = ЗаголовокСобытияСозданияКандидата(Кандидат, Пол);
	Событие.ВидСобытия = Перечисления.СобытияПоКандидату.Создание;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСобытияКомментарии(События, Комментарии)
	
	ДопустимаяДлинаКомментария = ДопустимаяДлинаКомментария();
	
	Для Каждого Комментарий Из Комментарии Цикл
		Событие = События.Добавить();
		Событие.Период = Комментарий.Период;
		Событие.Автор = ПредставлениеОтветственного(Комментарий.Пользователь);
		Текст = Лев(Комментарий.Комментарий, ДопустимаяДлинаКомментария);
		НомерСимволаПереноса = СтрНайти(Текст, Символы.ПС);
		Если НомерСимволаПереноса <> 0 Тогда
			Текст = Лев(Текст, НомерСимволаПереноса - 1);
		КонецЕсли;
		Если СтрДлина(Комментарий.Комментарий) > ДопустимаяДлинаКомментария Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = '%1...'"), Текст);
		Иначе
			Событие.ТекстСобытия = Текст;
		КонецЕсли;
		Событие.Гиперссылка = Истина;
		Событие.ВидСобытия = Перечисления.СобытияПоКандидату.Комментарий;
		Событие.НомерСобытия = Комментарий.ИсходныйНомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСобытияОценки(События, Оценки, ДатаРегистрации)
	
	Для Каждого Оценка Из Оценки Цикл
		Событие = События.Добавить();
		Если ЗначениеЗаполнено(Оценка.ДатаОценки) Тогда
			ДатаОценки = Оценка.ДатаОценки;
		Иначе
			ДатаОценки = ДатаРегистрации;
		КонецЕсли;
		Событие.Период = ДатаОценки;
		Событие.Автор = ПредставлениеОтветственного(Оценка.Пользователь);
		Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Поставлена оценка: %1'"), Оценка.Оценка);
		Событие.ВидСобытия = Перечисления.СобытияПоКандидату.Оценка;
		Событие.НомерСобытия = Оценка.ИсходныйНомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСобытияЗагрузкаФайлов(События, Кандидат, ДанныеПрисоединенныхФайлов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Кандидат);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КандидатыПрисоединенныеФайлы.Ссылка КАК Файл,
		|	КандидатыПрисоединенныеФайлы.Автор КАК Автор,
		|	КандидатыПрисоединенныеФайлы.ДатаСоздания КАК ДатаСоздания,
		|	КандидатыПрисоединенныеФайлы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КандидатыПрисоединенныеФайлы КАК КандидатыПрисоединенныеФайлы
		|ГДЕ
		|	КандидатыПрисоединенныеФайлы.ВладелецФайла = &Владелец";
	
	ПрисоединенныеФайлы = Запрос.Выполнить().Выгрузить();
	
	НомерФайла = 0;
	Для Каждого ПрисоединенныйФайл Из ПрисоединенныеФайлы Цикл
		Событие = События.Добавить();
		Событие.Период = ПрисоединенныйФайл.ДатаСоздания;
		Событие.Автор = ПредставлениеОтветственного(ПрисоединенныйФайл.Автор);
		Событие.ТекстСобытия = ПрисоединенныйФайл.Наименование;
		Событие.Гиперссылка = Истина;
		Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ЗагрузкаФайлов;
		Событие.НомерСобытия = НомерФайла;
		
		ПараметрыДанныхФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
		ПараметрыДанныхФайла.ДляРедактирования = Ложь;
		ПараметрыДанныхФайла.ВызыватьИсключение = Ложь;
		
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл.Файл, ПараметрыДанныхФайла);
		ДанныеПрисоединенныхФайлов.Добавить(ДанныеФайла);
		НомерФайла = НомерФайла + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСобытияРаботыСКандидатом(События, РаботаСКандидатом, Кандидат)
	
	КандидатОтклонен = Ложь;
	Если Кандидат.Состояние = Перечисления.СостоянияСогласования.Отклонено Тогда
		КандидатОтклонен = Истина;
	КонецЕсли;
	
	НомерСтроки = 0;
	Для Каждого Работа Из РаботаСКандидатом Цикл
		Событие = События.Добавить();
		Событие.Период = ?(ЗначениеЗаполнено(Работа.Период), Работа.Период,
			ЗарплатаКадрыПериодическиеРегистры.МаксимальнаяДата());
		Событие.Автор = ПредставлениеОтветственного(Кандидат.Ответственный);
		Событие.ТекстСобытия = Работа.ЭтапРаботы;
		Если Работа.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ПрохождениеЭтапа;
		ИначеЕсли ЗначениеЗаполнено(Работа.СостояниеЭтапа) Тогда
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ЭтапРаботы;
		ИначеЕсли КандидатОтклонен Тогда
			Событие.Период = Кандидат.ДатаРешения;
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ОтклонениеСЭтапа;
			КандидатОтклонен = Ложь;
		Иначе
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ЭтапРаботы;
		КонецЕсли;
		Событие.НомерСобытия = НомерСтроки;
		Событие.Гиперссылка = Истина;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаСобытий()
	
	События = Новый ТаблицаЗначений;
	События.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	События.Колонки.Добавить("Автор", Новый ОписаниеТипов("Строка"));
	События.Колонки.Добавить("Гиперссылка", Новый ОписаниеТипов("Булево"));
	События.Колонки.Добавить("НомерСобытия", Новый ОписаниеТипов("Число"));
	События.Колонки.Добавить("ВидСобытия", Новый ОписаниеТипов("ПеречислениеСсылка.СобытияПоКандидату"));
	События.Колонки.Добавить("ПредметСобытия", Новый ОписаниеТипов("Строка"));
	
	СписокТипов = Новый Массив;
	СписокТипов.Добавить(Тип("Строка"));
	СписокТипов.Добавить(Тип("ФорматированнаяСтрока"));
	События.Колонки.Добавить("ТекстСобытия", Новый ОписаниеТипов(СписокТипов));
	
	Возврат События;
	
КонецФункции

&НаСервереБезКонтекста
Функция КартинкаПоВидуСобытия(ВидСобытия)
	
	Если ВидСобытия = Перечисления.СобытияПоКандидату.Комментарий Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийКомментарий;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.Оценка Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийОценка;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ЗагрузкаФайлов Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийЗагрузкаФайлов;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ИзменениеИнформации Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийИзменеиеИнформации;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ДобавлениеИнформации Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийДобавлениеИнформации;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.Создание Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийСозданиеКандидата;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ПрохождениеЭтапа Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийЭтапПройден;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ЭтапРаботы Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийЭтап;
	ИначеЕсли ВидСобытия = Перечисления.СобытияПоКандидату.ОтклонениеСЭтапа Тогда
		Картинка = БиблиотекаКартинок.ЛентаСобытийЭтапОтклонен;
	Иначе
		Картинка = БиблиотекаКартинок.ЛентаСобытийПромежуточный;
	КонецЕсли;
	
	Возврат Картинка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаголовокСобытияСозданияКандидата(Кандидат, Пол)
	
	Обращение = ?(ЭтоЖенскийПол(Пол), НСтр("ru = 'Создана'"), НСтр("ru = 'Создан'"));
	Если Кандидат.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.РекрутинговыйСайт
		Или (Не ЗначениеЗаполнено(Кандидат.СпособСозданияКандидата) И ЗначениеЗаполнено(Кандидат.АдресРезюме)) Тогда
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '%1 с рекрутингового сайта: '"), Обращение));
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Кандидат.АдресРезюме,,,, Кандидат.АдресРезюме));
		ЗаголовокСобытия = Новый ФорматированнаяСтрока(ЧастиСтроки);
	ИначеЕсли Кандидат.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.ФайлРезюме Тогда
		ЗаголовокСобытия = СтрШаблон(НСтр("ru = '%1 из файла'"), Обращение);
	ИначеЕсли Кандидат.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.РучнойВвод Тогда
		ЗаголовокСобытия = СтрШаблон(НСтр("ru = '%1'"), Обращение);
	ИначеЕсли Кандидат.СпособСозданияКандидата = Перечисления.СпособыСозданияКандидата.Отклик Тогда
		ЧастиСтроки = Новый Массив;
		ЧастиСтроки.Добавить(СтрШаблон(НСтр("ru = '%1 по отклику: '"), Обращение));
		ЧастиСтроки.Добавить(Новый ФорматированнаяСтрока(Кандидат.АдресРезюме,,,, Кандидат.АдресРезюме));
		ЗаголовокСобытия = Новый ФорматированнаяСтрока(ЧастиСтроки);
	Иначе
		ЗаголовокСобытия = СтрШаблон(НСтр("ru = '%1'"), Обращение);
	КонецЕсли;
	
	Возврат ЗаголовокСобытия;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеОтветственного(Ответственный)
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный, "ФизическоеЛицо");
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ФизическоеЛицо, "Фамилия,Имя");
	Если КадровыеДанные.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат КадровыеДанные[0].Фамилия + " " + КадровыеДанные[0].Имя;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДекорациюОтменитьЭтап(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияОтменитьЭтап" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.УдалитьСтраницу;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ОтменитьЭтап");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Отменить этап'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюЗавершитьЭтап(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияЗавершитьЭтап" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Успешно;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ЗавершитьЭтап");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Отметка прохождения этапа'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюПройтиИнтервью(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПройтиИнтервью" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ПройтиИнтервью");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Пройти интервью'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюПропуститьЭтап(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПропуститьЭтап" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ЗаполнитьФорму;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ПропуститьЭтап");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Пропустить этап, перейти сразу на следующий'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюУтверждение(Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияУтверждение", Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Успешно;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_Утвердить");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Отметить кандидата как прошедшего отбор'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюРешениеОПриеме(Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияРешениеОПриеме", Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_СоздатьРешениеОПриемеНаРаботу");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Ввести решение'");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура СоздатьДекорациюЗапланироватьЭтап(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияЗапланироватьЭтап" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Календарь;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ЗапланироватьЭтап");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Запланировать'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюОткрытьАнкету(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияОткрытьАнкету" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.АктивироватьЗадачу;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ОткрытьАнкету");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Открыть анкету'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДекорациюПечатьАнкеты(НомерЭтапа, Группа, Элементы)
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияПечатьАнкеты" + НомерЭтапа, Тип("ДекорацияФормы"), Группа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.Печать;
	НовыйЭлемент.УстановитьДействие("Нажатие", "Подключаемый_ПечатьАнкеты");
	НовыйЭлемент.Подсказка = НСтр("ru = 'Печать анкеты'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СоздатьКомандыЭтапаРаботы(Форма, ВидСобытия, НомерСобытия, Группа)
	
	ТекущиеДанные = Форма.РаботаСКандидатамиНаборЗаписей[НомерСобытия];
	Если ТекущиеДанные.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.Утверждение") Тогда
		Если ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ПрохождениеЭтапа") Тогда
			СоздатьДекорациюОтменитьЭтап(НомерСобытия, Группа, Форма.Элементы);
		Иначе
			СоздатьДекорациюУтверждение(Группа, Форма.Элементы);
		КонецЕсли;
		Возврат;
	ИначеЕсли ТекущиеДанные.ЭтапРаботы =
		ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу") Тогда
		Если ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ПрохождениеЭтапа") Тогда
			СоздатьДекорациюОтменитьЭтап(НомерСобытия, Группа, Форма.Элементы);
		Иначе
			СоздатьДекорациюРешениеОПриеме(Группа, Форма.Элементы);
		КонецЕсли;
		Возврат;
	ИначеЕсли ТекущиеДанные.ЭтапРаботы = ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.ПриемНаРаботу")
		Или ТекущиеДанные.ЭтапРаботы =
		ПредопределенноеЗначение("Перечисление.ЭтапыРаботыСКандидатами.РассмотрениеОтклика") Тогда
		Возврат;
	КонецЕсли;
	СоздатьДекорациюЗапланироватьЭтап(НомерСобытия, Группа, Форма.Элементы);
	Если ТекущиеДанные.СостояниеЭтапа <>
		ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден") Тогда
		Если (Форма.ИспользоватьЭлектронноеИнтервью Или Форма.ИспользоватьЭлектронноеТестирование)
			И ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) Тогда
			СоздатьДекорациюПройтиИнтервью(НомерСобытия, Группа, Форма.Элементы);
		Иначе
			СоздатьДекорациюЗавершитьЭтап(НомерСобытия, Группа, Форма.Элементы);
		КонецЕсли;
	КонецЕсли;
	Если (Форма.ИспользоватьЭлектронноеИнтервью Или Форма.ИспользоватьЭлектронноеТестирование)
		И ЗначениеЗаполнено(ТекущиеДанные.ШаблонАнкеты) Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.АнкетаСсылка) Тогда
			СоздатьДекорациюОткрытьАнкету(НомерСобытия, Группа, Форма.Элементы);
		КонецЕсли;
		СоздатьДекорациюПечатьАнкеты(НомерСобытия, Группа, Форма.Элементы);
	КонецЕсли;
	Если ТекущиеДанные.СостояниеЭтапа <>
		ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пропущен") Тогда
		СоздатьДекорациюПропуститьЭтап(НомерСобытия, Группа, Форма.Элементы);
	КонецЕсли;
	СоздатьДекорациюОтменитьЭтап(НомерСобытия, Группа, Форма.Элементы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстДобавленияДанныхКандидата(Различия, Событие)
	
	Если Различия.Количество() = 1 Тогда
		Ключ = Различия[0].Ключ;
		Значение = Различия[0].Значение;
		ЗначениеПослеИзменения = Значение.ЗначениеПослеИзменения;
		Если Ключ = "Вакансия" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписана вакансия: %1'"), ЗначениеПослеИзменения.Представление);
		ИначеЕсли Ключ = "Ответственный" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписан ответственный: %1'"), ЗначениеПослеИзменения.Представление);
		ИначеЕсли Ключ = "ДатаРегистрации" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписана дата поступления: %1'"),
				Формат(ЗначениеПослеИзменения, "ДФ='dd.MM.yyyy ЧЧ:мм'"));
		ИначеЕсли Ключ = "ОжидаемыйДоход" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписан ожидаемый доход: %1'"), ЗначениеПослеИзменения);
		ИначеЕсли Ключ = "НазваниеРезюме" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписано название резюме: %1'"), ЗначениеПослеИзменения);
		КонецЕсли;
	Иначе
		ИменаПолей = Новый Массив;
		Для Каждого Различие Из Различия Цикл
			Если Различие.Ключ = "Вакансия" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения.Ссылка) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'вакансия'"));
			ИначеЕсли Различие.Ключ = "Ответственный" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения.Ссылка) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ответственный'"));
			ИначеЕсли Различие.Ключ = "ДатаРегистрации" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'дата поступления'"));
			ИначеЕсли Различие.Ключ = "ОжидаемыйДоход" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ожидаемый доход'"));
			ИначеЕсли Различие.Ключ = "НазваниеРезюме" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'название резюме'"));
			КонецЕсли;
		КонецЦикла;
		Событие.ТекстСобытия = СтрСоединить(ИменаПолей, ", ");
		Событие.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстИзмененияДанныхКандидата(Различия, Событие)
	
	Если Различия.Количество() = 1 Тогда
		Ключ = Различия[0].Ключ;
		Значение = Различия[0].Значение;
		ЗначениеДоИзменения = Значение.ЗначениеДоИзменения;
		ЗначениеПослеИзменения = Значение.ЗначениеПослеИзменения;
		Если Ключ = "Вакансия" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменена вакансия с %1 на %2'"),
				ЗначениеДоИзменения.Ссылка, ЗначениеПослеИзменения.Ссылка);
		ИначеЕсли Ключ = "ДатаРегистрации" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменена дата поступления с %1 на %2'"),
				Формат(ЗначениеДоИзменения, "ДФ='dd.MM.yyyy ЧЧ:мм'"),
				Формат(ЗначениеПослеИзменения, "ДФ='dd.MM.yyyy ЧЧ:мм'"));
		ИначеЕсли Ключ = "Ответственный" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменен ответственный с %1 на %2'"),
				ЗначениеДоИзменения.Ссылка, ЗначениеПослеИзменения.Ссылка);
		ИначеЕсли Ключ = "ОжидаемыйДоход" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменен ожидаемый доход с %1 на %2'"),
				ЗначениеДоИзменения, ЗначениеПослеИзменения);
		ИначеЕсли Ключ = "ВалютаДохода" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменена валюта дохода с %1 на %2'"),
				ЗначениеДоИзменения.Ссылка, ЗначениеПослеИзменения.Ссылка);
		ИначеЕсли Ключ = "ПериодичностьДохода" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменена периодичность дохода с %1 на %2'"),
				ЗначениеДоИзменения.Ссылка, ЗначениеПослеИзменения.Ссылка);
		ИначеЕсли Ключ = "НазваниеРезюме" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменено название резюме с %1 на %2'"),
				ЗначениеДоИзменения, ЗначениеПослеИзменения);
		КонецЕсли;
	Иначе
		ИменаПолей = Новый Массив;
		Для Каждого Различие Из Различия Цикл
			Если Различие.Ключ = "Вакансия" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'вакансия'"));
			ИначеЕсли Различие.Ключ = "ДатаРегистрации" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'дата поступления'"));
			ИначеЕсли Различие.Ключ = "Ответственный" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ответственный'"));
			ИначеЕсли Различие.Ключ = "ОжидаемыйДоход" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ожидаемый доход'"));
			ИначеЕсли Различие.Ключ = "ВалютаДохода" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'валюта дохода'"));
			ИначеЕсли Различие.Ключ = "ПериодичностьДохода" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'периодичность дохода'"));
			ИначеЕсли Различие.Ключ = "НазваниеРезюме" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'название резюме'"));
			КонецЕсли;
		КонецЦикла;
		Событие.ТекстСобытия = СтрСоединить(ИменаПолей, ", ");
		Событие.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстДобавленияЛичныхДанных(Различия, Событие)
	
	Если Различия.Количество() = 1 И Не ЭтоТаблицаЛичныхДанных(Различия[0].Ключ) Тогда
		Ключ = Различия[0].Ключ;
		Значение = Различия[0].Значение;
		ЗначениеПослеИзменения = Значение.ЗначениеПослеИзменения;
		Если Ключ = "ФИО" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписано ФИО: %1'"), ЗначениеПослеИзменения);
		ИначеЕсли Ключ = "ДатаРождения" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписана дата рождения: %1'"),
				Формат(ЗначениеПослеИзменения, "ДЛФ=D"));
		ИначеЕсли Ключ = "МестоРождения" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписано место рождения: %1'"),
				Прав(ЗначениеПослеИзменения, СтрДлина(ЗначениеПослеИзменения) - 2));
		ИначеЕсли Ключ = "СостояниеВБраке" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Вписано семейное положение: %1'"), ЗначениеПослеИзменения.Ссылка);
		КонецЕсли;
	Иначе
		ИменаПолей = Новый Массив;
		Для Каждого Различие Из Различия Цикл
			Если Различие.Ключ = "ФИО" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ФИО'"));
			ИначеЕсли Различие.Ключ = "ДатаРождения" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'дата рождения'"));
			ИначеЕсли Различие.Ключ = "МестоРождения" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'место рождения'"));
			ИначеЕсли Различие.Ключ = "СостояниеВБраке" И ЗначениеЗаполнено(Различие.Значение.ЗначениеПослеИзменения.Ссылка) Тогда
				ИменаПолей.Добавить(НСтр("ru = 'семейное положение'"));
			ИначеЕсли Различие.Ключ = "КонтактнаяИнформация" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'контактная информация'"));
			ИначеЕсли Различие.Ключ = "ЗнаниеЯзыков" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'знание языков'"));
			ИначеЕсли Различие.Ключ = "Образование" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'образование'"));
			ИначеЕсли Различие.Ключ = "УченыеСтепени" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ученые степени'"));
			ИначеЕсли Различие.Ключ = "ОпытРаботы" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'опыт работы'"));
			ИначеЕсли Различие.Ключ = "Курсы" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'курсы'"));
			КонецЕсли;
		КонецЦикла;
		Событие.ТекстСобытия = СтрСоединить(ИменаПолей, ", ");
		Событие.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьТекстИзмененияЛичныхДанных(Различия, Событие)
	
	Если Различия.Количество() = 1 И Не ЭтоТаблицаЛичныхДанных(Различия[0].Ключ) Тогда
		Ключ = Различия[0].Ключ;
		Значение = Различия[0].Значение;
		ЗначениеДоИзменения = Значение.ЗначениеДоИзменения;
		ЗначениеПослеИзменения = Значение.ЗначениеПослеИзменения;
		Если Ключ = "ФИО" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменено ФИО с %1 на %2'"),
				ЗначениеДоИзменения, ЗначениеПослеИзменения);
		ИначеЕсли Ключ = "ДатаРождения" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменена дата рождения с %1 на %2'"),
				Формат(ЗначениеДоИзменения, "ДЛФ=D"), Формат(ЗначениеПослеИзменения, "ДЛФ=D"));
		ИначеЕсли Ключ = "МестоРождения" Тогда
			МестоРожденияДо = Прав(ЗначениеДоИзменения, СтрДлина(ЗначениеДоИзменения) - 2);
			МестоРожденияПосле = Прав(ЗначениеПослеИзменения, СтрДлина(ЗначениеПослеИзменения) - 2);
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменено место рождения с %1 на %2'"),
				МестоРожденияДо, МестоРожденияПосле);
		ИначеЕсли Ключ = "СостояниеВБраке" Тогда
			Событие.ТекстСобытия = СтрШаблон(НСтр("ru = 'Изменено семейное положение с %1 на %2'"),
				ЗначениеДоИзменения.Ссылка, ЗначениеПослеИзменения.Ссылка);
		КонецЕсли;
	Иначе
		ИменаПолей = Новый Массив;
		Для Каждого Различие Из Различия Цикл
			Если Различие.Ключ = "ФИО" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ФИО'"));
			ИначеЕсли Различие.Ключ = "ДатаРождения" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'дата рождения'"));
			ИначеЕсли Различие.Ключ = "МестоРождения" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'место рождения'"));
			ИначеЕсли Различие.Ключ = "СостояниеВБраке" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'семейное положение'"));
			ИначеЕсли Различие.Ключ = "КонтактнаяИнформация" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'контактная информация'"));
			ИначеЕсли Различие.Ключ = "ЗнаниеЯзыков" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'знание языков'"));
			ИначеЕсли Различие.Ключ = "Образование" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'образование'"));
			ИначеЕсли Различие.Ключ = "УченыеСтепени" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'ученые степени'"));
			ИначеЕсли Различие.Ключ = "ОпытРаботы" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'опыт работы'"));
			ИначеЕсли Различие.Ключ = "Курсы" Тогда
				ИменаПолей.Добавить(НСтр("ru = 'курсы'"));
			КонецЕсли;
		КонецЦикла;
		Событие.ТекстСобытия = СтрСоединить(ИменаПолей, ", ");
		Событие.Гиперссылка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДопустимаяДлинаКомментария()
	
	Возврат 50;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеКлючиИзмененияКандидата()
	
	КлючиИзменеияИнформации = Новый Массив;
	КлючиИзменеияИнформации.Добавить("Вакансия");
	КлючиИзменеияИнформации.Добавить("ДатаРегистрации");
	КлючиИзменеияИнформации.Добавить("Ответственный");
	КлючиИзменеияИнформации.Добавить("ОжидаемыйДоход");
	КлючиИзменеияИнформации.Добавить("ВалютаДохода");
	КлючиИзменеияИнформации.Добавить("ПериодичностьДохода");
	КлючиИзменеияИнформации.Добавить("НазваниеРезюме");
	
	Возврат КлючиИзменеияИнформации;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеКлючиИзмененияЛичныхДанныхКандидата()
	
	КлючиИзменеияИнформации = Новый Массив;
	КлючиИзменеияИнформации.Добавить("ФИО");
	КлючиИзменеияИнформации.Добавить("ДатаРождения");
	КлючиИзменеияИнформации.Добавить("МестоРождения");
	КлючиИзменеияИнформации.Добавить("СостояниеВБраке");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КлючиИзменеияИнформации, ТаблицыЛичныхДанных());
	
	Возврат КлючиИзменеияИнформации;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТаблицыЛичныхДанных()
	
	ТаблицыЛичныхДанных = Новый Массив;
	ТаблицыЛичныхДанных.Добавить("КонтактнаяИнформация");
	ТаблицыЛичныхДанных.Добавить("ЗнаниеЯзыков");
	ТаблицыЛичныхДанных.Добавить("Образование");
	ТаблицыЛичныхДанных.Добавить("УченыеСтепени");
	ТаблицыЛичныхДанных.Добавить("ОпытРаботы");
	ТаблицыЛичныхДанных.Добавить("Курсы");
	
	Возврат ТаблицыЛичныхДанных;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоТаблицаЛичныхДанных(Ключ)
	
	ТаблицыЛичныхДанных = ТаблицыЛичныхДанных();
	Если ТаблицыЛичныхДанных.Найти(Ключ) <> Неопределено Тогда
		ЭтоТаблицаЛичныхДанных = Истина;
	Иначе
		ЭтоТаблицаЛичныхДанных = Ложь;
	КонецЕсли;
	
	Возврат ЭтоТаблицаЛичныхДанных;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяСобытия(ВидСобытия)
	
	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.Создание") Тогда
		ИмяСобытия = "Создание";
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.Комментарий") Тогда
		ИмяСобытия = "Комментарий";
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.Оценка") Тогда
		ИмяСобытия = "Оценка";
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ЗагрузкаФайлов") Тогда
		ИмяСобытия = "ЗагрузкаФайлов";
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ДобавлениеИнформации") Тогда
		ИмяСобытия = "ДобавлениеИнформации";
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ИзменениеИнформации") Тогда
		ИмяСобытия = "ИзменениеИнформации";
	ИначеЕсли СобытиеЭтапРаботы(ВидСобытия) Тогда
		ИмяСобытия = "РаботаСКандидатом";
	Иначе
		ИмяСобытия = "Событие";
	КонецЕсли;
	
	Возврат ИмяСобытия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокСобытия(Форма, ВидСобытия, ПредметСобытия, НомерСобытия)
	
	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.Комментарий") Тогда
		ЗаголовокСобытия = НСтр("ru = 'Оставлен комментарий:'");
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ЗагрузкаФайлов") Тогда
		ЗаголовокСобытия = НСтр("ru = 'Загружен файл:'");
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ДобавлениеИнформации") Тогда
		Если ПредметСобытия = "Кандидат" Тогда
			ЗаголовокСобытия = НСтр("ru = 'Вписаны данные кандидата:'");
		ИначеЕсли ПредметСобытия = "ЛичныеДанные" Тогда
			ЗаголовокСобытия = НСтр("ru = 'Вписаны личные данные:'");
		Иначе
			ЗаголовокСобытия = НСтр("ru = 'Вписана ифнормация:'");
		КонецЕсли;
	ИначеЕсли ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ИзменениеИнформации") Тогда
		Если ПредметСобытия = "Кандидат" Тогда
			ЗаголовокСобытия = НСтр("ru = 'Изменены данные кандидата:'");
		ИначеЕсли ПредметСобытия = "ЛичныеДанные" Тогда 
			ЗаголовокСобытия = НСтр("ru = 'Изменены личные данные:'");
		Иначе
			ЗаголовокСобытия = НСтр("ru = 'Изменена ифнормация:'");
		КонецЕсли;
	ИначеЕсли СобытиеЭтапРаботы(ВидСобытия) Тогда
		ТекущиеДанные = Форма.РаботаСКандидатамиНаборЗаписей[НомерСобытия];
		Если ТекущиеДанные.СостояниеЭтапа =
			ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован") Тогда
			ЗаголовокСобытия = НСтр("ru = 'Этап запланирован'");
		ИначеЕсли ТекущиеДанные.СостояниеЭтапа =
			ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пройден") Тогда
			ЗаголовокСобытия = НСтр("ru = 'Этап пройден'");
		ИначеЕсли ТекущиеДанные.СостояниеЭтапа =
			ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Пропущен") Тогда
			ЗаголовокСобытия = НСтр("ru = 'Этап пропущен'");
		Иначе
			ЗаголовокСобытия = НСтр("ru = 'Этап'");
		КонецЕсли;
	Иначе
		ЗаголовокСобытия = "";
	КонецЕсли;
	
	Возврат ЗаголовокСобытия;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СобытиеЭтапРаботы(ВидСобытия)
	
	СобытиеЭтапРаботы = Ложь;
	Если ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ЭтапРаботы")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ПрохождениеЭтапа")
		Или ВидСобытия = ПредопределенноеЗначение("Перечисление.СобытияПоКандидату.ОтклонениеСЭтапа") Тогда
		СобытиеЭтапРаботы = Истина;
	КонецЕсли;
	
	Возврат СобытиеЭтапРаботы;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьСобытияИзменениеИнформации(События, Кандидат, ЛичныеДанные, Добавления, Изменения)
	
	//Кандидат
	ДоступныеКлючиИзмененияИнформации = ДоступныеКлючиИзмененияКандидата();
	
	ИсторияДанных.ОбновитьИсторию(Кандидат);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Данные", Кандидат);
	ВерсииКандидата = ИсторияДанных.ВыбратьВерсии(Отбор);
	ВерсииКандидата.Сортировать("НомерВерсии");
	
	КоличествоВерсий = ВерсииКандидата.Количество();
	Для НомерВерсии = 0 По КоличествоВерсий - 1 Цикл
		ОтслеживаемыеРазличияДобавление = Новый Массив;
		ОтслеживаемыеРазличияИзменение = Новый Массив;
		РазлицияВерсий = ИсторияДанных.ПолучитьРазличияВерсий(Кандидат, НомерВерсии + 1);
		Для Каждого Различие Из РазлицияВерсий Цикл
			Если ДоступныеКлючиИзмененияИнформации.Найти(Различие.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Различие.Значение.Свойство("ЗначениеДоИзменения") Тогда
				Если Изменения И ((Различие.Ключ = "Вакансия" Или Различие.Ключ = "Ответственный")
						И ЗначениеЗаполнено(Различие.Значение.ЗначениеДоИзменения.Ссылка))
					Или ((Различие.Ключ = "ДатаРегистрации" Или Различие.Ключ = "ОжидаемыйДоход" Или Различие.Ключ = "НазваниеРезюме")
						И ЗначениеЗаполнено(Различие.Значение.ЗначениеДоИзменения))
					Или (Различие.Ключ = "ПериодичностьДохода" Или Различие.Ключ = "ВалютаДохода") Тогда
					ОтслеживаемыеРазличияИзменение.Добавить(Различие);
				ИначеЕсли Добавления Тогда
					ОтслеживаемыеРазличияДобавление.Добавить(Различие);
				КонецЕсли;
			ИначеЕсли Добавления Тогда
				ОтслеживаемыеРазличияДобавление.Добавить(Различие);
			КонецЕсли;
		КонецЦикла;
		
		Ответственный = Справочники.Пользователи.НайтиПоНаименованию(ВерсииКандидата[НомерВерсии].ИмяПользователя); 
		Автор = ПредставлениеОтветственного(Ответственный);
		Если ОтслеживаемыеРазличияДобавление.Количество() <> 0 Тогда
			Событие = События.Добавить();
			Событие.Период = ВерсииКандидата[НомерВерсии].Дата;
			Событие.Автор = Автор;
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ДобавлениеИнформации;
			Событие.НомерСобытия = НомерВерсии + 1;
			Событие.ПредметСобытия = "Кандидат";
			ЗаполнитьТекстДобавленияДанныхКандидата(ОтслеживаемыеРазличияДобавление, Событие);
		КонецЕсли;
		
		Если ОтслеживаемыеРазличияИзменение.Количество() <> 0 Тогда
			Событие = События.Добавить();
			Событие.Период = ВерсииКандидата[НомерВерсии].Дата;
			Событие.Автор = Автор;
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ИзменениеИнформации;
			Событие.НомерСобытия = НомерВерсии + 1;
			Событие.ПредметСобытия = "Кандидат";
			ЗаполнитьТекстИзмененияДанныхКандидата(ОтслеживаемыеРазличияИзменение, Событие);
		КонецЕсли;
	КонецЦикла;
	
	// Личные данные кандидата
	ДоступныеКлючиИзмененияИнформации = ДоступныеКлючиИзмененияЛичныхДанныхКандидата();
	
	ИсторияДанных.ОбновитьИсторию(ЛичныеДанные);
	
	Отбор.Вставить("Данные", ЛичныеДанные);
	ВерсииЛичныхДанных = ИсторияДанных.ВыбратьВерсии(Отбор);
	ВерсииЛичныхДанных.Сортировать("НомерВерсии");
	
	Для НомерВерсии = 0 По ВерсииЛичныхДанных.Количество() - 1 Цикл
		ОтслеживаемыеРазличияДобавление = Новый Массив;
		ОтслеживаемыеРазличияИзменение = Новый Массив;
		РазлицияВерсий = ИсторияДанных.ПолучитьРазличияВерсий(ЛичныеДанные, НомерВерсии + 1);
		Для Каждого Различие Из РазлицияВерсий Цикл
			Если ДоступныеКлючиИзмененияИнформации.Найти(Различие.Ключ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ЭтоТаблицаЛичныхДанных(Различие.Ключ) Тогда
				Если Различие.Значение.Количество() <> 0 Тогда
					Если Добавления И Различие.Значение[0].ВидИзмененияСтроки = ВидИзмененияСтрокиДанных.Добавление Тогда
						ОтслеживаемыеРазличияДобавление.Добавить(Различие);
					ИначеЕсли Изменения Тогда
						ОтслеживаемыеРазличияИзменение.Добавить(Различие);
					КонецЕсли;
				КонецЕсли;
				Продолжить;
			ИначеЕсли Различие.Значение.Свойство("ЗначениеДоИзменения") Тогда
				Если Изменения И ((Различие.Ключ = "ФИО" Или Различие.Ключ = "ДатаРождения" Или Различие.Ключ = "МестоРождения")
						И ЗначениеЗаполнено(Различие.Значение.ЗначениеДоИзменения))
					Или (Различие.Ключ = "СостояниеВБраке"
						И ЗначениеЗаполнено(Различие.Значение.ЗначениеДоИзменения.Ссылка)) Тогда
					ОтслеживаемыеРазличияИзменение.Добавить(Различие);
				ИначеЕсли Добавления Тогда
					ОтслеживаемыеРазличияДобавление.Добавить(Различие);
				КонецЕсли;
			ИначеЕсли Добавления Тогда
				ОтслеживаемыеРазличияДобавление.Добавить(Различие);
			КонецЕсли;
		КонецЦикла;
		
		Ответственный = Справочники.Пользователи.НайтиПоНаименованию(ВерсииЛичныхДанных[НомерВерсии].ИмяПользователя); 
		Автор = ПредставлениеОтветственного(Ответственный);
		Если ОтслеживаемыеРазличияДобавление.Количество() <> 0 Тогда
			Событие = События.Добавить();
			Событие.Период = ВерсииЛичныхДанных[НомерВерсии].Дата;
			Событие.Автор = Автор;
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ДобавлениеИнформации;
			Событие.НомерСобытия = НомерВерсии + 1;
			Событие.ПредметСобытия = "ЛичныеДанные";
			ЗаполнитьТекстДобавленияЛичныхДанных(ОтслеживаемыеРазличияДобавление, Событие);
		КонецЕсли;
		
		Если ОтслеживаемыеРазличияИзменение.Количество() <> 0 Тогда
			Событие = События.Добавить();
			Событие.Период = ВерсииЛичныхДанных[НомерВерсии].Дата;
			Событие.Автор = Автор;
			Событие.ВидСобытия = Перечисления.СобытияПоКандидату.ИзменениеИнформации;
			Событие.НомерСобытия = НомерВерсии + 1;
			Событие.ПредметСобытия = "ЛичныеДанные";
			ЗаполнитьТекстИзмененияЛичныхДанных(ОтслеживаемыеРазличияИзменение, Событие);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеФормыОбъекта

&НаКлиенте
Процедура ОткрытьСтаруюФормуОбъектаПослеВопросаЗаписать(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСтаруюФормуОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтаруюФормуОбъекта()
	
	ПодборПерсоналаВызовСервера.СохранитьНастройкуОткрытияФормы(Истина);
	ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", Новый Структура("Ключ", Параметры.Ключ),, Истина);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.КонтрольВеденияУчета
&НаКлиенте
Процедура Подключаемый_ОткрытьОтчетПоПроблемам(ЭлементИлиКоманда, НавигационнаяСсылка, СтандартнаяОбработка)
	КонтрольВеденияУчетаКлиентБЗК.ОткрытьОтчетПоПроблемамОбъекта(ЭтотОбъект, КандидатОбъект.Ссылка, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, КандидатОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект, КандидатОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект, КандидатОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект, КандидатОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = КандидатОбъект;
	КонецЕсли;
	
	ОбъектЛичныеДанныеКандидата = Неопределено;
	Если ТипЗнч(ТекущийОбъект) = Тип("СправочникОбъект.Кандидаты") Тогда
		ОбъектЛичныеДанныеКандидата = СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства,
			"СвязанныеОбъекты.ЛичныеДанныеКандидата");
	КонецЕсли;
	
	ТекущаяВакансия = КандидатОбъект.Вакансия;
	
	// Прочитать объект личные данные кандидата.
	ПрочитатьЛичныеДанныеКандидатаОбъект(ОбъектЛичныеДанныеКандидата);
	
	УстановитьСвойстваПоляФИО();
	
	РольДоступнаДобавлениеИзменениеДанныхКандидатов =
		ПравоДоступа("Изменение", Метаданные.Справочники.Кандидаты);
	РольДоступнаДобавлениеИзменениеРешенияОПриемеНаРаботу =
		ПравоДоступа("Изменение", Метаданные.Документы.РешениеОПриемеНаРаботу);
	
	ПрочитатьРаботуСКандидатом(ТекущийОбъект);
	ПрочитатьДанныеПубликацииРезюме(ТекущийОбъект);
	
	УстановитьПанельСостояния(ТекущийОбъект);
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	//Рейтинг
	Рейтинг = РейтингДляОтображения(ТекущийОбъект);
	ОтобразитьРейтинг(ЭтотОбъект, Рейтинг);
	УстановитьДоступностьРейтинга();
	
	ПрочитатьКомментарии(ТекущийОбъект, КандидатСсылка);
	УстановитьДоступностьДобавленияИзмененияКомментариев();
	
	ИспользоватьЭлектронноеИнтервью = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью");
	ИспользоватьЭлектронноеТестирование = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов");
	Если Не ИспользоватьЭлектронноеИнтервью И Не ИспользоватьЭлектронноеТестирование Тогда
		Элементы.ГруппаОценкаПоХарактеристикам.Видимость = Ложь;
		Элементы.ПодменюОтчеты.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьШаблоныСообщений = ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений");
	ИспользоватьОграничениеПоГруппамДоступа =
		ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписей")
		И ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов");
	
	УстановитьОтображениеНадписей();
	
	СохранитьОжидаемыйДоход(ЭтотОбъект, 
		ТекущийОбъект.ОжидаемыйДоход, ТекущийОбъект.ВалютаДохода, ТекущийОбъект.ПериодичностьДохода);
	ОтобразитьОжидаемыйДоходПоУмолчанию(ЭтотОбъект, ТекущийОбъект);
	ПересчитыватьОжидаемыйДоход = Истина;
	
	ПрочитатьФайлРезюме(ТекущийОбъект);
	
	ПрочитатьДанныеДляЗаписи(ТекущийОбъект);
	
	Элементы.ФормаОтклонить.Доступность = ТекущийОбъект.Состояние <> Перечисления.СостоянияСогласования.Отклонено;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеДляЗаписи(ОбъектКандидат)

	Если ТипЗнч(ОбъектКандидат) = Тип("СправочникОбъект.Кандидаты") Тогда
		ДляЗаписи = СвойствоСтруктуры(ОбъектКандидат.ДополнительныеСвойства, "ДляЗаписи");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлРезюме(ОбъектКандидат)

	Если ТипЗнч(ОбъектКандидат) = Тип("СправочникОбъект.Кандидаты") И ОбъектКандидат.ЭтоНовый() Тогда
		ДанныеФайла = СвойствоСтруктуры(ОбъектКандидат.ДополнительныеСвойства, "СвязанныеОбъекты.ФайлРезюме");
		Если ДанныеФайла <> Неопределено Тогда
			ФайлРезюме = ДанныеФайла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеПубликацииРезюме(ОбъектКандидат)

	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДанныеПубликацииРезюме) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ТипЗнч(ОбъектКандидат) = Тип("СправочникОбъект.Кандидаты") И ОбъектКандидат.ЭтоНовый() Тогда
		НаборЗаписей = СвойствоСтруктуры(ОбъектКандидат.ДополнительныеСвойства, "СвязанныеОбъекты.ДанныеПубликацииРезюме");
		Если НаборЗаписей <> Неопределено Тогда
			ЗначениеВРеквизитФормы(НаборЗаписей, "ДанныеПубликацииРезюмеНаборЗаписей");
		КонецЕсли;
	Иначе
		НаборЗаписей = РеквизитФормыВЗначение("ДанныеПубликацииРезюмеНаборЗаписей");
		НаборЗаписей.Отбор.Кандидат.Установить(КандидатСсылка);
		НаборЗаписей.Прочитать();
		ЗначениеВРеквизитФормы(НаборЗаписей, "ДанныеПубликацииРезюмеНаборЗаписей");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДругиеОбращенияКандидата()
	
	ДекорацииКандидатов = Элементы.ГруппаСписокДругихКандидатов.ПодчиненныеЭлементы;
	Пока ДекорацииКандидатов.Количество() <> 0 Цикл
		Элементы.Удалить(ДекорацииКандидатов[0]);
	КонецЦикла;
	
	ТаблицаКандидатов = Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КандидатОбъект.ЛичныеДанные));
	
	НомерОбращения = 1;
	Для Каждого СтрокаТаблицы Из ТаблицаКандидатов Цикл
		Если СтрокаТаблицы.Кандидат = КандидатСсылка Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеОбращения = Строка(СтрокаТаблицы.Вакансия);
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Вакансия) Тогда
			ПредставлениеОбращения = Строка(СтрокаТаблицы.Подразделение);
		КонецЕсли;
		НовыйЭлемент = Элементы.Добавить("ДругойКандидат" + НомерОбращения, Тип("ДекорацияФормы"),
			Элементы.ГруппаСписокДругихКандидатов);
		НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
		НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
		НовыйЭлемент.Заголовок = Новый ФорматированнаяСтрока(
			ПредставлениеОбращения,,,, ПолучитьНавигационнуюСсылку(СтрокаТаблицы.Кандидат));
		НомерОбращения = НомерОбращения + 1;
	КонецЦикла;
	
	Элементы.СписокКандидатов.Видимость = ТаблицаКандидатов.Количество() > 1;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымВакансии()
	
	Если Не ЗначениеЗаполнено(КандидатОбъект.Вакансия) Тогда
		Возврат;
	КонецЕсли;
	
	Объект = РеквизитФормыВЗначение("КандидатОбъект");
	Объект.Заполнить(КандидатОбъект.Вакансия);
	ЗначениеВРеквизитФормы(Объект, "КандидатОбъект");
	
	ПрочитатьРаботуСКандидатом();
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	СохранитьВыбраннуюВакансию(КандидатОбъект.Вакансия);
	ЗаполнитьИсториюВыбораВакансии();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПозиции(Позиция)
	Возврат Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Позиция);
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьВыбраннуюВакансию(Вакансия)
	
	ИсторияВыбора = ИсторияВыбораВакансии();
	ИсторияВыбора.Вставить(Вакансия, ТекущаяДатаСеанса());
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		Метаданные.Справочники.Кандидаты.ПолноеИмя(), "ИсторияВыбораВакансии", ИсторияВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсториюВыбораВакансии()

	ИсторияВыбора = ИсторияВыбораВакансии();
	
	ОтборВакансий = Новый Структура();
	ОтборВакансий.Вставить("Ответственный", Пользователи.АвторизованныйПользователь());
	ОтборВакансий.Вставить("Состояние", Перечисления.СостоянияВакансии.Действующие());
	
	ДанныеВыбора = Справочники.Вакансии.ДанныеВакансий(
		Справочники.Вакансии.ВакансииПоОтбору(ОтборВакансий)).Скопировать(, "Вакансия, ПланируемаяДатаЗакрытия");
	ДанныеВыбора.Колонки.Добавить("ДатаВыбора");

	Для Каждого СтрокаДанных Из ДанныеВыбора Цикл
		Если ИсторияВыбора.Получить(СтрокаДанных.Вакансия) <> Неопределено Тогда
			СтрокаДанных.ДатаВыбора = ИсторияВыбора.Получить(СтрокаДанных.Вакансия);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеВыбора.Сортировать("ДатаВыбора Убыв, ПланируемаяДатаЗакрытия Возр");
	
	Элементы.Вакансия.СписокВыбора.Очистить();
	Для Индекс = 0 По Мин(ДанныеВыбора.Количество() - 1, ГлубинаИсторииВыбораВакансии()) Цикл
		Элементы.Вакансия.СписокВыбора.Добавить(ДанныеВыбора[Индекс].Вакансия);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ГлубинаИсторииВыбораВакансии()
	Возврат 7;
КонецФункции

&НаСервереБезКонтекста
Функция ИсторияВыбораВакансии()
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		Метаданные.Справочники.Кандидаты.ПолноеИмя(), "ИсторияВыбораВакансии", Новый Соответствие());
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЖенскийПол(Пол)
	Возврат Пол = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодразделения(Форма)
	
	КандидатОбъект = Форма.КандидатОбъект;
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(КандидатОбъект.Вакансия) 
		Или ЗначениеЗаполнено(КандидатОбъект.Позиция) Тогда
		Элементы.Подразделение.Доступность = Ложь;
	Иначе
		Элементы.Подразделение.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеОбъектыКандидата(ОбъектКандидат, ПараметрыЗаписи)
	
	СвязанныеОбъекты = Новый Структура();
	СвязанныеОбъекты.Вставить("ДанныеПубликацииРезюме", РеквизитФормыВЗначение("ДанныеПубликацииРезюмеНаборЗаписей"));
	Если ФайлРезюме <> Неопределено Тогда
		СвязанныеОбъекты.Вставить("ФайлРезюме", ФайлРезюме);
	КонецЕсли;
	
	ЭтоЗаписьНовыхЛичныхДанныхКандидата = Не ОбщегоНазначения.СсылкаСуществует(ЛичныеДанныеКандидатаСсылка);
	Если ЛичныеДанныеКандидатаЗаблокированы Или ЭтоЗаписьНовыхЛичныхДанныхКандидата Тогда
		СвязанныеОбъекты.Вставить("ЛичныеДанныеКандидата", РеквизитФормыВЗначение("ЛичныеДанныеКандидата"));
		ЗаполнитьСвязанныеОбъектыЛичныхДанныхКандидата(СвязанныеОбъекты.ЛичныеДанныеКандидата);
		ПараметрыЗаписи.Вставить("ЭтоЗаписьНовыхЛичныхДанныхКандидата", ЭтоЗаписьНовыхЛичныхДанныхКандидата);
	КонецЕсли;
	
	ОбъектКандидат.ДополнительныеСвойства.Вставить("СвязанныеОбъекты", СвязанныеОбъекты);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеНадписей()
	
	ФизическоеЛицоКандидата = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидата.Ссылка);
	Если Не ЗначениеЗаполнено(ФизическоеЛицоКандидата) И ЗначениеЗаполнено(КандидатОбъект.Ссылка) Тогда
		ЗащитаПерсональныхДанныхЗарплатаКадры.ФормаСубъектаУстановитьОтображениеНадписей(ЭтотОбъект,
			ЛичныеДанныеКандидата.Ссылка, Элементы.Найти("ГруппаСведенияОСогласииНаОбработкуПДн"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьКомандуСоздатьКандидата()
	Элементы.СоздатьКандидата.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПоказатьКомандуСоздатьКандидата()
	Элементы.СоздатьКандидата.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОднофамильцев()
	
	РезультатПоиска = РезультатПоискаПохожихЛюдей();
		
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПоиска, "ЧеловекУникален", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	ПодборПерсоналаФормыКлиент.ПроверитьОднофамильцев(ЭтотОбъект, РезультатПоиска);
	
КонецПроцедуры

// Возвращаемое значение:
//  см. ПоискФизическихЛиц.ПохожиеЛюди
&НаСервере
Функция РезультатПоискаПохожихЛюдей()
	
	Возврат ПодборПерсоналаФормы.РезультатПоискаПохожихЛюдейИзФормыКандидата(ЭтотОбъект);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьУникальностьЛичныхДанныхКандидата(Отказ)
	
	Если ЛичныеДанныеСуществуют(ЛичныеДанныеКандидатаСсылка) И Не ПроверкаНаДубли Тогда
		Возврат;
	КонецЕсли;
	
	РезультатПроверки = РезультатПроверкиУникальности();
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатПроверки, "ЧеловекУникален", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ПодборПерсоналаФормыКлиент.ПроверитьУникальностьЛичныхДанныхПередЗаписьюКандидата(ЭтотОбъект, РезультатПроверки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛичныеДанныеСуществуют(ЛичныеДанные)
	
	Возврат Справочники.ЛичныеДанныеКандидатов.ЛичныеДанныеСуществуют(ЛичныеДанные);
	
КонецФункции

// Возвращаемое значение:
//  см. ПоискФизическихЛиц.ПохожиеЛюди
&НаСервере
Функция РезультатПроверкиУникальности()
	
	Возврат ПодборПерсоналаФормы.РезультатПроверкиУникальности(ЭтотОбъект);
	
КонецФункции

// Параметры:
//  РезультатВыбора - Структура, Неопределено - 
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура ПроверкаОднофамильцевЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВыбора = Неопределено Тогда
		ЗаполнитьПредставлениеОпытаРаботы();
	ИначеЕсли ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		ПроверкаОднофамильцевЗавершениеНаСервере(РезультатВыбора);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, НСтр("ru = 'Некорректный результат проверки однофамильцев'"),
			"ПроверкаОднофамильцевЗавершение");
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  РезультатВыбора - Структура
&НаСервере
Процедура ПроверкаОднофамильцевЗавершениеНаСервере(РезультатВыбора)
	
	Если ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ЛичныеДанныеКандидатов") Тогда
		ЛичныеДанныеКандидатаСсылка = РезультатВыбора.ПохожийЧеловек;
		КандидатОбъект.ЛичныеДанные = РезультатВыбора.ПохожийЧеловек;
		ФизическоеЛицоСсылка = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(ЛичныеДанныеКандидатаСсылка);
		Если РезультатВыбора.ВАрхивеФизическихЛиц Тогда
			ОбъектЛичныеДанныеКандидата = ЛичныеДанныеКандидатаПоДаннымВыбораПохожегоИзАрхива(РезультатВыбора,
				ЛичныеДанныеКандидатаСсылка);
			ДанныеДляЗаполненияИзАрхива = РезультатВыбора;
		Иначе
			ОбъектЛичныеДанныеКандидата = Неопределено;
		КонецЕсли;
		Если КандидатОбъект.ЛичныеДанные.Пустая() Тогда
			КандидатОбъект.ЛичныеДанные = Справочники.ЛичныеДанныеКандидатов.ПолучитьСсылку();
		КонецЕсли;
		Если ОбъектЛичныеДанныеКандидата = Неопределено
			И ОбщегоНазначения.СсылкаСуществует(КандидатОбъект.ЛичныеДанные) Тогда
			ОбъектЛичныеДанныеКандидата = КандидатОбъект.ЛичныеДанные.ПолучитьОбъект();
			ДополнитьЛичныеДанные(ОбъектЛичныеДанныеКандидата, ЛичныеДанныеКандидата);
		КонецЕсли;
		ЗначениеВРеквизитФормы(ОбъектЛичныеДанныеКандидата, "ЛичныеДанныеКандидата");
	ИначеЕсли ТипЗнч(РезультатВыбора.ПохожийЧеловек) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ФизическоеЛицоСсылка = РезультатВыбора.ПохожийЧеловек;
		ЗаполнитьОбъектЛичныеДанныеКандидатаПоФизЛицу(ФизическоеЛицоСсылка, РезультатВыбора);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
			НСтр("ru = 'В результате поиска получен похожий человек неподдерживаемого типа'"),
			"ПроверкаОднофамильцевЗавершениеНаСервере");
	КонецЕсли;
	
	ЗаполнитьНаименованиеПоДаннымКандидата();
	ЗаполнитьОбразованиеКвалификацию();
	ЗаполнитьПредставлениеОпытаРаботы();
	ЗаполнитьРезюме(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

// Параметры:
//  РезультатВыбора - Структура
//  ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов
&НаСервере
Функция ЛичныеДанныеКандидатаПоДаннымВыбораПохожегоИзАрхива(РезультатВыбора, ЛичныеДанныеКандидата)
	
	ОбъектЛичныеДанныеКандидата = ЛичныеДанныеКандидата.ПолучитьОбъект();
	
	Если Не ОбщегоНазначения.СсылкаСуществует(ЛичныеДанныеКандидата) Тогда
		ОбъектЛичныеДанныеКандидата = Справочники.ЛичныеДанныеКандидатов.СоздатьЭлемент();
		ОбъектЛичныеДанныеКандидата.УстановитьСсылкуНового(ЛичныеДанныеКандидата);
	КонецЕсли;
	ОбъектЛичныеДанныеКандидата.Заполнить(ДанныеЗаполненияКандидатаИзАрхива(РезультатВыбора));
	
	// Очистим контактную информацию, и затем добавим то, что нашли в архиве при поиске похожих.
	УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ОбъектЛичныеДанныеКандидата,
		УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация());
	Если ЗначениеЗаполнено(РезультатВыбора.МобильныйТелефон) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектЛичныеДанныеКандидата,
			РезультатВыбора.МобильныйТелефон,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"));
	КонецЕсли;
	Если ЗначениеЗаполнено(РезультатВыбора.АдресЭлектроннойПочты) Тогда
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектЛичныеДанныеКандидата,
			РезультатВыбора.АдресЭлектроннойПочты,
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"));
	КонецЕсли;
	
	Возврат ОбъектЛичныеДанныеКандидата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеЗаполненияКандидатаИзАрхива(РезультатВыбора)
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("ФИО", РезультатВыбора.ФИОПолные);
	ДанныеЗаполнения.Вставить("ДатаРождения", СтроковыеФункцииКлиентСервер.СтрокаВДату(РезультатВыбора.ДатаРождения));
	ДанныеЗаполнения.Вставить("Образование", Неопределено);
	ДанныеЗаполнения.Вставить("Курсы", Неопределено);
	ДанныеЗаполнения.Вставить("ОпытРаботы", Неопределено);
	ДанныеЗаполнения.Вставить("УченыеСтепени", Неопределено);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
КонецПроцедуры

&НаСервере
Функция АдресДанныхДополнительнойФормыНаСервере(ОписаниеДополнительнойФормы) Экспорт
	Возврат СотрудникиФормы.АдресДанныхДополнительнойФормы(ОписаниеДополнительнойФормы, ЭтотОбъект);
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеИзХранилищаВФормуНаСервере(Параметр) Экспорт
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтотОбъект,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(Параметр.ИмяФормы),
		Параметр.АдресВХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ФИОПриИзмененииНаСервере()
	
	ЛичныеДанныеКандидата.Фамилия = "";
	ЛичныеДанныеКандидата.Имя = "";
	ЛичныеДанныеКандидата.Отчество = "";
	
	Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ФИО) Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидата.ФИООтсутствует = Ложь;
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ЛичныеДанныеКандидата.ФИО);
	
	ЛичныеДанныеКандидата.Фамилия = СтруктураФИО.Фамилия;
	Если СтруктураФИО.Имя <> Неопределено Тогда
		ЛичныеДанныеКандидата.Имя = СтруктураФИО.Имя;
	КонецЕсли;
	Если СтруктураФИО.Отчество <> Неопределено Тогда
		ЛичныеДанныеКандидата.Отчество = СтруктураФИО.Отчество;
	КонецЕсли;
	
	Если ФИОИспользуется Тогда
		
		КандидатОбъект.Наименование = "";
		ЛичныеДанныеКандидата.Наименование = "";
		
		ЛичныеДанныеКандидата.Наименование = Справочники.ЛичныеДанныеКандидатов.НаименованиеКандидата(СтруктураФИО,
			ЛичныеДанныеКандидата.УточнениеНаименования);
		КандидатОбъект.Наименование = Справочники.Кандидаты.НаименованиеПоФИО(ЛичныеДанныеКандидата,
			ЛичныеДанныеКандидата.УточнениеНаименования, КандидатОбъект.УточнениеНаименования);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛичныеДанныеКандидата(СтруктураЗаполнения, ЭтоДругойКандидатФизЛица = Ложь)
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактированияНаСервере();
	
	Если Не ЭтоДругойКандидатФизЛица Тогда
		Если СтруктураЗаполнения.Свойство("Фамилия") Или СтруктураЗаполнения.Свойство("Имя")
			Или СтруктураЗаполнения.Свойство("Отчество") Тогда
				
			ЛичныеДанныеКандидата.ФИО =
				?(СтруктураЗаполнения.Свойство("Фамилия") И ЗначениеЗаполнено(СтруктураЗаполнения.Фамилия),
					СтруктураЗаполнения.Фамилия, "")
				+ ?(СтруктураЗаполнения.Свойство("Имя") И ЗначениеЗаполнено(СтруктураЗаполнения.Имя),
					" " + СтруктураЗаполнения.Имя, "")
				+ ?(СтруктураЗаполнения.Свойство("Отчество") И ЗначениеЗаполнено(СтруктураЗаполнения.Отчество),
					" " + СтруктураЗаполнения.Отчество, "");
					
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ЛичныеДанныеКандидата.ФИО) Тогда
			ЛичныеДанныеКандидата.ФИО = "";
		КонецЕсли;
		
		ФИОПриИзмененииНаСервере();
		
	КонецЕсли;
	
	Если СтруктураЗаполнения.Свойство("КонтактнаяИнформация") 
		И ЗначениеЗаполнено(СтруктураЗаполнения.КонтактнаяИнформация) Тогда
		Для Каждого КонтактнаяИнформацияСтрока Из СтруктураЗаполнения.КонтактнаяИнформация Цикл
			Если КонтактнаяИнформацияСтрока.Вид = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов") Тогда
				КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов = КонтактнаяИнформацияСтрока.Представление;
			КонецЕсли;
			
			Если КонтактнаяИнформацияСтрока.Вид = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов") Тогда
				КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов = КонтактнаяИнформацияСтрока.Представление;
			КонецЕсли; 
			
			Если КонтактнаяИнформацияСтрока.Вид = ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов") Тогда
				КонтактнаяИнформацияПолеАдресЛичныеДанныеКандидатов = КонтактнаяИнформацияСтрока.Представление;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйЭлементНачалоВыбора(ИмяТаблицыФормы, ИмяПоля, СтандартнаяОбработка, Подсказка = Неопределено)

	ТекущиеДанные = Элементы[ИмяТаблицыФормы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущиеДанные", ТекущиеДанные);
	ДополнительныеПараметры.Вставить("ИмяПоля", ИмяПоля);

	Оповещение = Новый ОписаниеОповещения("МногострочныйЭлементНачалоВыбораЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	
	Если Подсказка = Неопределено Тогда
		ПоказатьВводСтроки(Оповещение, ТекущиеДанные[ИмяПоля], , , Истина);
	Иначе
		ПоказатьВводСтроки(Оповещение, ТекущиеДанные[ИмяПоля], Подсказка, , Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйЭлементНачалоВыбораЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекущиеДанные[ДополнительныеПараметры.ИмяПоля] = Строка;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция АнкетыПоЭтапам(Кандидат, Вакансия)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АнкетыКандидатов.ЭтапРаботыСКандидатом КАК ЭтапРаботы,
		|	АнкетыКандидатов.Анкета КАК Анкета,
		|	АнкетыКандидатов.Анкета.Проведен КАК ТолькоПросмотр
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И АнкетыКандидатов.Кандидат = &Кандидат";

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСреднийРейтинг(ТекущийОбъект)
	ТекущийОбъект.СреднийРейтинг = СреднийРейтинг(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборФотографии()
	СотрудникиКлиентРасширенный.НачатьВыборФотографии(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборФотографии()
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура НачатьРедактированиеМестаРождения(Элемент, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеМестаРождения", ЭтотОбъект);
	ПодборПерсоналаКлиент.НачатьРедактированиеМестаРожденияКандидата(
		ЭтотОбъект, Элемент, СтандартнаяОбработка, ЛичныеДанныеКандидата.МестоРождения, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеМестаРождения(МестоРожденияИзменено, ДополнительныеПараметры) Экспорт
	Если МестоРожденияИзменено Тогда
		ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактирования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваПоляФИО()
	
	Элементы.ФИО.Доступность = ФИОИспользуется;
	
	Если ФИОИспользуется Тогда
		Элементы.ФИО.ПодсказкаВвода = НСтр("ru = 'Фамилия Имя Отчество'");
	Иначе
		Элементы.ФИО.ПодсказкаВвода = КандидатОбъект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаименованиеПоДаннымКандидата()
	
	ЗаблокироватьЛичныеДанныеКандидатаОбъектДляРедактированияНаСервере();
	
	Объект = РеквизитФормыВЗначение("КандидатОбъект");
	Объект.ЗаполнитьНаименованиеПоДаннымКандидата(ЛичныеДанныеКандидата);
	ЗначениеВРеквизитФормы(Объект, "КандидатОбъект");
	
	Элементы.ФИО.ПодсказкаВвода = КандидатОбъект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОИспользуетсяПриИзмененииЗавершение(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено И Результат.Значение = КодВозвратаДиалога.Отмена Тогда
		ФИОИспользуется = Не ФИОИспользуется;
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидата.ФИООтсутствует = Не ФИОИспользуется;
	
	Если Результат <> Неопределено И Результат.БольшеНеЗадаватьЭтотВопрос Тогда
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПрограммы",
			"ПоказыватьПредупреждениеОПустомФИОКандидата", Ложь);
	КонецЕсли;
	
	ЗаполнитьНаименованиеПоДаннымКандидата();
	ЛичныеДанныеКандидата.ФИО = "";
	ФИОПриИзмененииНаСервере();
	
	УстановитьСвойстваПоляФИО();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьАнкетуКандидата(Кандидат, Вакансия, ЭтапРаботы)
	
	ЭлектронноеИнтервью.ОтменитьАнкетыПоЭтапу(Вакансия, ЭтапРаботы, Кандидат);
	Кандидаты = Новый Массив;
	Кандидаты.Добавить(Кандидат);
	ЭлектронноеИнтервью.РассчитатьОценкиКандидатов(Вакансия, Кандидаты);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПериодВТабличнойЧастиЛичныхДанныхКандидата(ИмяТабличнойЧасти, Отказ)
	
	Для Каждого ТекущаяСтрока Из ЛичныеДанныеКандидата[ИмяТабличнойЧасти] Цикл
		ПутьКПроверяемойДате = СтрШаблон("ЛичныеДанныеКандидата.%1[%2].ДатаОкончанияПредставление", ИмяТабличнойЧасти,
			ТекущаяСтрока.НомерСтроки - 1);
		ЗарплатаКадры.ПроверитьКорректностьДаты(КандидатОбъект.Ссылка, ТекущаяСтрока.ДатаОкончания,
			ПутьКПроверяемойДате, Отказ, НСтр("ru='Конец периода'"), ТекущаяСтрока.ДатаНачала,
			НСтр("ru='начала периода'"), Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеТаблицыФормыОпытРаботы()
	
	// Отключаем видимость сферы деятельности компании, если она не заполнена.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.ОпытРаботыСфераДеятельностиКомпании.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, 
		"ЛичныеДанныеКандидата.ОпытРаботы.СфераДеятельностиКомпании", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторНовойСтроки()
	Возврат -1;
КонецФункции

&НаСервере
Функция ДатаПриемаНаРаботу()
	НайденныеСтроки = РаботаСКандидатамиНаборЗаписей.НайтиСтроки(
		Новый Структура("ЭтапРаботы", Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу));
	Возврат ?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].Период, Неопределено);
КонецФункции

&НаСервере
Процедура ОбновитьМетки()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, ЛичныеДанныеКандидата);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеКандидата()
	
	Если Параметры.Свойство("ДанныеКандидата") Тогда
		СправочникОбъект = РеквизитФормыВЗначение("КандидатОбъект");
		СправочникОбъект.Заполнить(Параметры.ДанныеКандидата);
		СправочникОбъект.Заполнить(Параметры.ЗначенияЗаполнения);
		ЗначениеВРеквизитФормы(СправочникОбъект, "КандидатОбъект");
		КандидатСсылка = СправочникОбъект.ДополнительныеСвойства.КандидатСсылка;
		ПриПолученииДанныхНаСервере(СправочникОбъект);
		УстановитьВидимостьПолученияКонтактов(ЭтотОбъект, Параметры.ДанныеКандидата.ДоступностьКонтактов);
		ВыполнятьПроверкуОднофамильцев = Истина;
	ИначеЕсли ОбщегоНазначенияБЗККлиентСервер.ЗначениеСвойства(Параметры,
		"ЗначенияЗаполнения.ФизическоеЛицо") <> Неопределено Тогда
		СправочникОбъект = РеквизитФормыВЗначение("КандидатОбъект");
		СправочникОбъект.Заполнить(Параметры.ЗначенияЗаполнения);
		ЗначениеВРеквизитФормы(СправочникОбъект, "КандидатОбъект");
		ПриПолученииДанныхНаСервере(СправочникОбъект);
		ВыполнятьПроверкуОднофамильцев = Ложь;
		ФизическоеЛицоСсылка = Параметры.ЗначенияЗаполнения.ФизическоеЛицо;
	КонецЕсли;
	
	// Если личные данные кандидата были указаны в обработке заполнения.
	Если КандидатОбъект.ЛичныеДанные.Пустая() Тогда
		// Генерируем ссылку, при записи установим ее объекту.
		КандидатОбъект.ЛичныеДанные = Справочники.ЛичныеДанныеКандидатов.ПолучитьСсылку();
		ВыполнятьПроверкуОднофамильцев = Истина;
	КонецЕсли;
	
	// Получаем ссылку нового.
	Если КандидатСсылка.Пустая() Тогда
		КандидатСсылка = Справочники.Кандидаты.ПолучитьСсылку();
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	СкрытьКомандуСоздатьКандидата();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьTelegram(Форма)
	
	Если ЗначениеЗаполнено(Форма.КонтактнаяИнформацияПолеTelegramЛичныеДанныеКандидатов) Тогда
		Форма.Элементы.Telegram.Видимость = Истина;
		Если Лев(Форма.КонтактнаяИнформацияПолеTelegramЛичныеДанныеКандидатов, 1) <> "@" Тогда
			Форма.Элементы.ПредупреждениеTelegram.Видимость = Истина;
		Иначе
			Форма.Элементы.ПредупреждениеTelegram.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Форма.Элементы.Telegram.Видимость = Ложь;
		Форма.Элементы.ПредупреждениеTelegram.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьMAX(Форма)
	
	Если ЗначениеЗаполнено(Форма.КонтактнаяИнформацияПолеMAXЛичныеДанныеКандидатов) Тогда
		Форма.Элементы.MAX.Видимость = Истина;
		Если Лев(Форма.КонтактнаяИнформацияПолеMAXЛичныеДанныеКандидатов, 4) <> "http" Тогда
			Форма.Элементы.ПредупреждениеMAX.Видимость = Истина;
		Иначе
			Форма.Элементы.ПредупреждениеMAX.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Форма.Элементы.MAX.Видимость = Ложь;
		Форма.Элементы.ПредупреждениеMAX.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти