
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Награды физических лиц.
// 
// Параметры:
//  ФизическиеЛица	- Массив - список физических лиц.
//  НаДату 			- Дата	 - срез на дату (проверка по дате приказа).
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Награды физических лиц
Функция НаградыФизическихЛиц(ФизическиеЛица, НаДату = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	Запрос.УстановитьПараметр("ДатаПриказа", НаДату);
	Запрос.УстановитьПараметр("ОтборПоДате", ТипЗнч(НаДату) = Тип("Дата"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НаградыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НаградыФизическихЛиц.Награда КАК Награда,
		|	ЕСТЬNULL(КатегорииНаград.Ссылка, ЗНАЧЕНИЕ(Справочник.КатегорииНаград.ПустаяСсылка)) КАК КатегорияНаграды,
		|	НаградыФизическихЛиц.НомерПриказа КАК НомерПриказа,
		|	НаградыФизическихЛиц.ДатаПриказа КАК ДатаПриказа,
		|	ПРЕДСТАВЛЕНИЕ(НаградыФизическихЛиц.Награда) КАК ПредставлениеНаграды
		|ИЗ
		|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Награды КАК Награды
		|		ПО НаградыФизическихЛиц.Награда = Награды.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииНаград КАК КатегорииНаград
		|		ПО (Награды.КатегорияНаграды = КатегорииНаград.Ссылка)
		|ГДЕ
		|	НаградыФизическихЛиц.ФизическоеЛицо В(&ФизическиеЛица)
		|	И (НаградыФизическихЛиц.ДатаПриказа <= &ДатаПриказа
		|			ИЛИ НЕ &ОтборПоДате)";
	
	НаградыФизическихЛиц = Запрос.Выполнить().Выгрузить();
	
	Возврат НаградыФизическихЛиц;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

// Создает новую структуру для сведений об награде.
// 
// Возвращаемое значение:
//  Структура:
//   * ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица -
//   * НомерПоПорядку	- Число -
//   * Награда			- СправочникСсылка.Награды -
//   * НаименованиеНаграды	- Строка -
//   * НаименованиеКатегорииНаграды	- Строка -
//   * НомерПриказа		- Строка -
//   * ДатаПриказа 		- Дата -
//   * НаименованиеПриказа 		- Строка -
//   * ДокументРегистратор 		- ДокументСсылка.Награждение -
Функция НоваяНаградаФизическогоЛица() Экспорт
	
	СтруктураЗаписи = ОбщегоНазначенияБЗК.СтруктураПоИмениРегистраСведений("НаградыФизическихЛиц");
	
	СтруктураЗаписи.Вставить("НаименованиеНаграды");
	СтруктураЗаписи.Вставить("НаименованиеКатегорииНаграды");
	
	Возврат СтруктураЗаписи;
	
КонецФункции

// Заполняет награды физического лица.
// 
// Параметры:
//  КоллекцияЗаписей - Массив из Структура - см. НоваяНаградаФизическогоЛица
//  НеПроверятьЗаписиДанныхФизическихЛиц - Булево - 
Процедура ЗарегистрироватьНаградыФизическихЛиц(КоллекцияЗаписей, НеПроверятьЗаписиДанныхФизическихЛиц = Ложь) Экспорт
	
	Если КоллекцияЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НаградыФизическихЛиц.СоздатьНаборЗаписей();
	
	Для Каждого ТекущаяСтрока Из КоллекцияЗаписей Цикл
		
		Награда = ТекущаяСтрока.Награда;
		Если Не ЗначениеЗаполнено(Награда) Тогда
			КатегорияНаграды = Справочники.КатегорииНаград.НоваяКатегорияНаграды(ТекущаяСтрока.НаименованиеКатегорииНаграды);
			Награда = Справочники.Награды.НоваяНаграда(ТекущаяСтрока.НаименованиеНаграды,, КатегорияНаграды);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Награда) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяСтрока,, "Награда");
		НоваяЗапись.Награда = Награда;
		
	КонецЦикла;
	
	Если НеПроверятьЗаписиДанныхФизическихЛиц Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеПроверятьЗаписиДанныхФизическихЛиц", НеПроверятьЗаписиДанныхФизическихЛиц);
	КонецЕсли;

	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОчиститьНаградыФизическихЛиц(ДокументРегистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НаградыФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НаградыФизическихЛиц.НомерПоПорядку КАК НомерПоПорядку
	|ИЗ
	|	РегистрСведений.НаградыФизическихЛиц КАК НаградыФизическихЛиц
	|ГДЕ
	|	НаградыФизическихЛиц.ДокументРегистратор = &ДокументРегистратор";
	Запрос.УстановитьПараметр("ДокументРегистратор", ДокументРегистратор);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
			НаборЗаписей.Отбор.НомерПоПорядку.Установить(Выборка.НомерПоПорядку);
			НаборЗаписей.Записать();
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
