#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Параметры.Основание;
	ТабДокументовБИА = ОбменСАрхивом.ТаблицаДокументовБИА(Основание);
	
	ТаблицаДокументовБИА.Загрузить(ТабДокументовБИА);
	Для Каждого Стр Из ТаблицаДокументовБИА Цикл
		Если Стр.Выгружен И Не Стр.Уничтожен Тогда
			Стр.КомандаСкачать = НСтр("ru = 'Скачать'");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДокументовБИА

&НаКлиенте
Процедура ТаблицаДокументовБИАВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаДокументовБИА.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	Если ТекущаяКолонка = Элементы.ТаблицаДокументовБИАКомандаСкачать Тогда
		ОбменСАрхивомКлиент.СкачатьКонтейнерДокумента(ТекущиеДанные.Документ);
	ИначеЕсли ТекущаяКолонка = Элементы.ТаблицаДокументовБИАДокумент
			Или ТекущаяКолонка = Элементы.ТаблицаДокументовБИАВидДокумента Тогда
		ПоказатьЗначение(, ТекущиеДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
