
#Область СлужебныйПрограммныйИнтерфейс

// См. ПередачаДанныхВстраивание.ОшибкаПриПолученииДанных
Процедура ОшибкаПриПолученииДанных(ДанныеОшибки) Экспорт
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации(
		НСтр("ru = 'Получение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЛогироватьОшибкуИсходящегоЗапроса(ДанныеОшибки, ИмяСобытия);

	Контекст = КонтекстОшибкиОтвета(ДанныеОшибки.Ответ);
	ОбщегоНазначенияБТС.ЗаписьТехнологическогоЖурнала("ПолучениеДанных.Ошибка", Контекст);
		
КонецПроцедуры

// См. ПередачаДанныхВстраивание.ОшибкаПриОтправкеДанных
Процедура ОшибкаПриОтправкеДанных(ДанныеОшибки) Экспорт
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации(
		НСтр("ru = 'Отправка'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЛогироватьОшибкуИсходящегоЗапроса(ДанныеОшибки, ИмяСобытия);
	
	Контекст = КонтекстОшибкиОтвета(ДанныеОшибки.Ответ);
	ОбщегоНазначенияБТС.ЗаписьТехнологическогоЖурнала("ОтправкаДанных.Ошибка", Контекст);
	
КонецПроцедуры

// См. ПередачаДанныхВстраивание.ОшибкаПриВыполненииЗапросаДанных
Процедура ОшибкаПриВыполненииЗапросаДанных(ДанныеОшибки) Экспорт
	
	ИмяСобытия = ИмяСобытияЖурналаРегистрации(
		НСтр("ru = 'Выполнение запроса'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ЛогироватьОшибкуИсходящегоЗапроса(ДанныеОшибки, ИмяСобытия);
	
	ОбщегоНазначенияБТС.ЗаписьТехнологическогоЖурнала("ЗапросДанных.Ошибка", 
		Новый Структура("ИнформацияОбОшибке", ДанныеОшибки.ИнформацияОбОшибке));
	
КонецПроцедуры

// Логировать ошибку исходящего запроса и ответ на него в журнал регистрации
// 
// Параметры:
//  ДанныеОшибки - Структура:
//  * Соединение - HTTPСоединение
//  * Метод - Строка - вызываемый метод
//  * Запрос - HTTPЗапрос - выполняемый HTTP-запрос
//  * Ответ - HTTPОтвет, Неопределено - полученный HTTP-ответ (Неопределено - если запрос не выполнен)
//  * ИнформацияОбОшибке - Строка - информация об ошибке
//  * ОтправленыДвоичныеДанные - Булево - признак передачи в запросе двоичных данных
//  ИмяСобытияЖР - Строка - Имя события журнала регистрации
//
Процедура ЛогироватьОшибкуИсходящегоЗапроса(ДанныеОшибки, ИмяСобытияЖР) Экспорт
	
	ПараметрыЛогирования = ОбщегоНазначенияБТССлужебныйКлиентСервер.НовыйПараметрыЛогированияИсходящегоЗапроса();
	ПараметрыЛогирования.ИмяСобытияЖР = ИмяСобытияЖР;
	ПараметрыЛогирования.СоединениеHTTP = ДанныеОшибки.Соединение;
	ПараметрыЛогирования.МетодHTTP = ДанныеОшибки.Метод;
	ПараметрыЛогирования.ЗапросHTTP = ДанныеОшибки.Запрос;
	ПараметрыЛогирования.ОтветHTTP = ДанныеОшибки.Ответ;
	ПараметрыЛогирования.ЛогироватьТелоЗапроса = Ложь;
	ПараметрыЛогирования.ОтправленыДвоичныеДанные = ДанныеОшибки.ОтправленыДвоичныеДанные;
	ПараметрыЛогирования.ИнформацияОбОшибке = ДанныеОшибки.ИнформацияОбОшибке;
	ПараметрыЛогирования.ЭтоОшибка = Истина;
	
	ОбщегоНазначенияБТССлужебныйКлиентСервер.ЛогироватьИсходящийЗапрос(ПараметрыЛогирования);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяСобытияЖурналаРегистрации(ВидСобытия)
	
	Возврат СтрШаблон(НСтр("ru = 'Передача данных.%1'", ОбщегоНазначения.КодОсновногоЯзыка()), ВидСобытия);
	
КонецФункции

Функция КонтекстОшибкиОтвета(Ответ)
	
	Возврат Новый Структура("КодСостояния, Описание",
		Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

#КонецОбласти