
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Параметры.СчетаФактуры Цикл
		СчетФактура = СчетаФактуры.Добавить();
		ЗаполнитьЗначенияСвойств(СчетФактура, Строка.Значение);
		СчетФактура.Представление = Строка.Представление;
	КонецЦикла;
	
	Если ТолькоПросмотр Тогда
		Элементы.СчетаФактуры.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		Элементы.ФормаКомандаОК.Видимость = Ложь;
	КонецЕсли;
	
	РеквизитыСчетовФактур = Документы.ПоясненияКДекларацииПоНДС.РеквизитыСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда 
		
		Если Не ПеренестиВДокумент Тогда
			
			ТекстПредупреждения = НСтр("ru = 'Отменить изменения?'");
	
			ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияПроизвольнойФормы(
				ЭтотОбъект, 
				Отказ, 
				ЗавершениеРаботы,
				ТекстПредупреждения, 
				"ПеренестиВДокумент");
			
		ИначеЕсли Не Отказ Тогда
			Отказ = Не ПроверитьЗаполнениеНаКлиенте();
			Если Отказ Тогда
				ПеренестиВДокумент = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура СчетаФактурыПриИзменении(Элемент)
	
	УстановитьПредставление(Элементы.СчетаФактуры.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПеренестиВДокумент = Истина;
	Если ПроверитьЗаполнениеНаКлиенте() Тогда
		РезультатЗакрытия = СписокСчетовФактур();
		ОповеститьОВыборе(РезультатЗакрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	ПеренестиВДокумент = Ложь;
	Модифицированность = Ложь;
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СписокСчетовФактур()
	
	СписокСчетовФактур = Новый СписокЗначений();
	
	Для Каждого СчетФактура Из СчетаФактуры Цикл
		ЗначенияРеквизитов = Новый Структура(РеквизитыСчетовФактур);
		ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, СчетФактура);
		СписокСчетовФактур.Добавить(ЗначенияРеквизитов, СчетФактура.Представление);
	КонецЦикла;
	
	Возврат СписокСчетовФактур;
	
КонецФункции

&НаКлиенте
Функция ПроверитьЗаполнениеНаКлиенте()
	
	Отказ = Ложь;
	
	Для Каждого СчетФактура Из СчетаФактуры Цикл
		
		Если Не ЗначениеЗаполнено(СчетФактура.Номер) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Номер'"));
			Поле = "СчетаФактуры["+ Формат(СчетаФактуры.Индекс(СчетФактура), "ЧДЦ=; ЧГ=0") +"].Номер";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СчетФактура.Дата) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", НСтр("ru = 'Дата'"));
			Поле = "СчетаФактуры["+ Формат(СчетаФактуры.Индекс(СчетФактура), "ЧДЦ=; ЧГ=0") +"].Дата";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Не Отказ;

КонецФункции

&НаСервере 
Процедура УстановитьПредставление(Строка)
	
	ДанныеСтроки = СчетаФактуры.НайтиПоИдентификатору(Строка);
	ДанныеСтроки.Представление = Документы.ПоясненияКДекларацииПоНДС.ПредставлениеСчетовФактур(ДанныеСтроки);
	
КонецПроцедуры

#КонецОбласти