#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Вакансии", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ДатаСостояния", НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()));
	
	СостоянияВакансийКлиент.НачатьУстановкуСостояния(
		ПараметрКоманды, 
		НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()), 
		ПредопределенноеЗначение("Перечисление.СостоянияВакансии.Открыта"),
		Новый ОписаниеОповещения("ВозобновитьНабор", ЭтотОбъект, ДополнительныеПараметры));
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВозобновитьНабор(Результат, ДополнительныеПараметры) Экспорт
	
	ВозобновитьНаборНаСервере(ДополнительныеПараметры.Вакансии, ДополнительныеПараметры.ДатаСостояния);
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ДополнительныеПараметры.Вакансии);
	
КонецПроцедуры

&НаСервере
Процедура ВозобновитьНаборНаСервере(Вакансии, ДатаВозобновления)
	Справочники.Вакансии.ВозобновитьНабор(Вакансии, ДатаВозобновления);
КонецПроцедуры

#КонецОбласти