#Область СлужебныйПрограммныйИнтерфейс

#Область КадровыйУчет

Процедура ДобавитьКлючиСтруктурыТекущихКадровыхДанныхСотрудника(КлючиСтруктурыТекущихКадровыхДанныхСотрудника) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрейды") Тогда
		Возврат;
	КонецЕсли;
	
	Грейды.ДополнитьИменаКадровыхДанных(КлючиСтруктурыТекущихКадровыхДанныхСотрудника);
	
КонецПроцедуры

Процедура УстановитьТекущийГрейд(ОбъектДанных, ТекущиеКадровыеДанные = Неопределено, ИмяПоля = "Грейд") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрейды") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОбъектДанных, ИмяПоля) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектДанных[ИмяПоля] = ?(
		ТекущиеКадровыеДанные = Неопределено,
		Справочники.Грейды.ПустаяСсылка(),
		ТекущиеКадровыеДанные.Грейд);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти