#Область СлужебныйПрограммныйИнтерфейс

// Используемый в ИБ адрес сервера системы 1С:Аналитика
// (Функции для технического специалиста - Управление системой аналитики).
// 
// Возвращаемое значение:
//  Строка - Адрес сервера системы 1С:Аналитика.
//
Функция АдресСервера() Экспорт
	Возврат СистемаАналитики.ПолучитьАдресСервераСистемыАналитики();
КонецФункции

// Установить адрес подключения сервера системы 1С:Аналитика.
// 
// Параметры:
//  АдресСервера - Строка - Новый адрес сервера 1С:Аналитика.
// 
// Возвращаемое значение:
//  Булево - Новый адрес сервера 1С:Аналитика установлен успешно.
//
Функция УстановитьАдресСервера(АдресСервера) Экспорт

	АдресСервераТекущий = АдресСервера();
	СистемаАналитики.УстановитьАдресСервераСистемыАналитики(АдресСервера);
	
	Если Не СерверСистемыАналитикиДоступен(Истина) Тогда
		СистемаАналитики.УстановитьАдресСервераСистемыАналитики(АдресСервераТекущий);
	КонецЕсли;
	
	Возврат АдресСервера = АдресСервера() И СерверСистемыАналитикиДоступен();
	
КонецФункции

// Поставляемые панели конфигурации к установке и обновлению на сервере 1С:Аналитика.
// 
// Параметры:
//  МассивПанелей - Массив - Массив имен общих макетов, содержащих поставляемые панели.
// 
// Возвращаемое значение:
//  Структура - Поставляемые панели конфигурации к установке и обновлению:
//   * КУстановке 	- Массив Из Структура - Структура имен макетов, содержащих поставляемые панели к установке и имен владельцев макетов.
//   * КОбновлению 	- Массив Из Структура - Структура имен макетов, содержащих поставляемые панели к обновлению и имен владельцев макетов.
//
Функция ПоставляемыеПанелиКонфигурацииКУстановкеИОбновлению() Экспорт
	
	ПанелиКУстановкеИОбновлению = Новый Структура("КУстановке, КОбновлению", Новый Массив, Новый Массив);
	
	ПоставляемыеПанели = ПоставляемыеПанелиКонфигурации();
	ОбъектыАналитики = ОбъектыАналитики(ТипыКонтролируемыхОбъектовПанелиАналитики());
	
	СтрокиПанелей = СтатусыПоставляемыхПанелей(ПоставляемыеПанели, ОбъектыАналитики);
	Для Каждого СтрокаПанели Из СтрокиПанелей Цикл
		Если Не ЗначениеЗаполнено(СтрокаПанели["ДатаИзмененияАналитика"]) Тогда
			СтруктураИменМакета = Новый Структура("ИмяМакета,ИмяРегистра");
			ЗаполнитьЗначенияСвойств(СтруктураИменМакета, СтрокаПанели);
			ПанелиКУстановкеИОбновлению["КУстановке"].Добавить(СтруктураИменМакета);
		ИначеЕсли ЗначениеЗаполнено(СтрокаПанели["ДатаИзмененияКонфигурация"]) Тогда
			СтруктураИменМакета = Новый Структура("ИмяМакета,ИмяРегистра");
			ЗаполнитьЗначенияСвойств(СтруктураИменМакета, СтрокаПанели);
			ПанелиКУстановкеИОбновлению["КОбновлению"].Добавить(СтруктураИменМакета);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПанелиКУстановкеИОбновлению;
	
КонецФункции

// Установить/обновить поставляемые панели на сервере 1С:Аналитика.
// 
// Параметры:
//  СтруктураПанелей - Структура - Ключи - имена макетов, значения - имена регистров.
//  Ошибки - Неопределено - создать новый список ошибок.
//         - Структура:
//            * СписокОшибок - Массив из Структура:
//             ** ПолеОшибки - Строка
//             ** ТекстДляОднойОшибки - Строка
//             ** ГруппаОшибок - Произвольный
//             ** НомерСтроки - Число
//             ** ТекстДляНесколькихОшибок - Строка
//            * ГруппыОшибок - Соответствие
// 
// Возвращаемое значение:
//  Массив - Установленные на сервере 1С:Аналитике поставляемые панели.
//
Функция УстановитьОбновитьПоставляемыеПанели(СтруктураПанелей, Ошибки) Экспорт

	УстановленныеПанели = Новый Массив;
	Для Каждого СтруктураИменМакета Из СтруктураПанелей Цикл
		СтруктураПанели = СтруктураПоставляемойПанели(СтруктураИменМакета.ИмяМакета, СтруктураИменМакета.ИмяРегистра);
		ДвоичныеДанныеПанели = ПолучитьДвоичныеДанныеИзСтроки(ЗначениеВJSON(СтруктураПанели.ДанныеПанели));

		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанныеПанели);

		Попытка
			ЗагрузитьНастройкиПанелиДляПользователя(АдресХранилища);
			УстановленныеПанели.Добавить(СтруктураИменМакета.ИмяМакета);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписатьИнформациюВЖурналРегистрации(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), Истина);
			
			ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при установке/обновлении поставляемой панели ""%1"" 1С:Аналитика.
				|""%2"" (%3)'"), 
				СтруктураИменМакета.ИмяМакета,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке),
				ИнформацияОбОшибке.Описание);
		КонецПопытки;
	КонецЦикла;
	
	Возврат УстановленныеПанели;
	
КонецФункции

// Проверяет актуальность версии 1С:Аналитика.
// 
// Параметры:
//  МинимальнаяВерсияАналитики - Строка
//
// Возвращаемое значение:
//  Булево
//
Функция ТекущаяВерсияАналитикиАктуальна(МинимальнаяВерсияАналитики) Экспорт
	
	МинимальнаяВерсияАналитики = МинимальноДопустимаяВерсияАналитики();
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(МинимальнаяВерсияАналитики, ВерсияАналитики()) < 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВерсияАналитики()
	
	Попытка
		Соединение = СистемаАналитики.ПолучитьСоединение();
		Схема = Соединение.ПолучитьСхему("version", "");
	Исключение
		ВызватьИсключение НСтр("ru = 'Версия 1С:Аналитики не определена'");
	КонецПопытки;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(JSONВЗначение(Схема.ПолучитьКакСтроку()), "version", "");
	
КонецФункции

Функция МинимальноДопустимаяВерсияАналитики()
	Возврат "1.65.0";
КонецФункции

// Доступность сервера системы 1С:Аналитика.
// 
// Возвращаемое значение:
//  Булево - Сервер системы 1С:Аналитика доступен.
//
Функция СерверСистемыАналитикиДоступен(ЗаписыватьОшибки = Ложь)
	
	Попытка
		СистемаАналитики.ПолучитьСоединение().ПолучитьСхему("objects");
		Возврат Истина;
	Исключение
		Если ЗаписыватьОшибки Тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписатьИнформациюВЖурналРегистрации(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке), Истина);
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось установить адрес сервера системы 1С:Аналитика. 
				|Подробности в журнале регистрации.'"));
		КонецЕсли;
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Таблица макетов конфигурации для установки в 1С:Аналитика.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Поставляемые панели 1С:Аналитика, обнаруженные в конфигурации.
// 	 * ИмяМакета 				 - Строка - Имя общего макета, содержащего поставляемую панель.
// 	 * ДатаИзмененияКонфигурация - Дата - Дата изменений поставляемой панели в общем макете.
// 	 * ДатаИзмененияАналитика 	 - Дата - Дата изменений установленной панели на сервере 1С:Аналитика.
// 	 * ПутьКФайламМакета 		 - Строка - Путь к файлам на диске с содержимым поставляемой панели.
//
Функция ПоставляемыеПанелиКонфигурации()
	Возврат ИнтеграцияС1САналитикойПовтИсп.ПоставляемыеПанелиКонфигурации();
КонецФункции

// Объекты текущего подключения сервера 1С:Аналитики.
// 
// Параметры:
//  ТипОбъектов - Строка - Тип объектов, извлекаемых с сервера 1С:Аналитика.
//  Владелец - Строка - Идентификатор пользователя, владельца данных 1С:Аналитика.
// 
// Возвращаемое значение:
//  Массив - Объекты 1С:Аналитика, загруженные с сервера.
//
Функция ОбъектыАналитики(ТипОбъектов = Неопределено, Владелец = Неопределено)
	
	Фильтр = Новый Структура;
	Если ЗначениеЗаполнено(ТипОбъектов) Тогда
		Фильтр.Вставить("type", ТипОбъектов);
	КонецЕсли;

	Если ЗначениеЗаполнено(Владелец) Тогда
		Фильтр.Вставить("owner", Владелец);
	КонецЕсли;
	
	Соединение = СистемаАналитики.ПолучитьСоединение();
	Схема = Соединение.ПолучитьСхему("objects", Фильтр);

	МассивОбъектов = JSONВЗначение(Схема.ПолучитьКакСтроку());

	Возврат МассивОбъектов;
	
КонецФункции

// Статусы поставляемых панелей.
// 
// Параметры:
//  ПоставляемыеПанели 		- ТаблицаЗначений - Таблица статусов поставляемых панелей.
//  РабочиеСтолыАналитики  	- ТаблицаЗначений - Таблица статусов поставляемых панелей
//  											 установленных в 1С:Аналитика.
//  МассивПанелей 			- Массив - Массив имен общих макетов, содержащих поставляемые панели.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Статусы поставляемых панелей.
//
Функция СтатусыПоставляемыхПанелей(ПоставляемыеПанели, ОбъектыАналитики)
	
	Для Каждого ПоставляемаяПанель Из ПоставляемыеПанели Цикл
		СтруктураМакета = СтруктураПоставляемойПанели(ПоставляемаяПанель.ИмяМакета, ПоставляемаяПанель.ИмяРегистра);
		Если ОбъектыАналитики <> Неопределено Тогда
			ДатаИзмененияАналитика = ДатаИзмененияОбъектовАналитики(
				ОбъектыАналитики, СтруктураМакета);
		Иначе
			ДатаИзмененияАналитика = Неопределено;
		КонецЕсли;
		
		ПоставляемаяПанель.ДатаИзмененияКонфигурация = ДатаПоМеткеВремени(СтруктураМакета.ДатаИзменения);
		ПоставляемаяПанель.ДатаИзмененияАналитика = ДатаИзмененияАналитика;
	КонецЦикла;
	
	Возврат ПоставляемыеПанели;
	
КонецФункции

// Привести метку времени в формате 1С:Аналитика к дате.
// 
// Параметры:
//  МеткаВремени - Строка - Метка времени в формате 1С:Аналитика.
// 
// Возвращаемое значение:
//  Неопределено, Дата - Дата по метке времени, если возможно или неопределено.
//
Функция ДатаПоМеткеВремени(МеткаВремени)
	
	Если ЗначениеЗаполнено(МеткаВремени) Тогда
		Возврат МестноеВремя('19700101' + Число(МеткаВремени) / 1000);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Загрузка поставляемой панели 1С:Аналитика в рабочий стол текущего пользователя.
// 
// Параметры:
//  АдресХранилища - Строка с адресом хранилища данных поставляемой панели 1С:Аналитика.
//
Процедура ЗагрузитьНастройкиПанелиДляПользователя(АдресХранилища)

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	Попытка
		ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "ИдентификаторПользователяИБ");
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);

		ИмяПользователя = ПользовательИБ.Имя;
		ИдентификаторПользователяИБ = Строка(ИдентификаторПользователяИБ);
	Исключение
		ВызватьИсключение НСтр("ru = 'Пользователь информационной базы не найден'");
	КонецПопытки;

	ПараметрыЗагрузкиПоставляемойПанели = Новый Структура;
	ПараметрыЗагрузкиПоставляемойПанели.Вставить("АдресХранилища", АдресХранилища);
	ПараметрыЗагрузкиПоставляемойПанели.Вставить("ИдентификаторПользователяИБ", ИдентификаторПользователяИБ);
	ПараметрыЗагрузкиПоставляемойПанели.Вставить("ИмяПользователя", ИмяПользователя);
	
	ЗагрузитьНастройкиПанели(ПараметрыЗагрузкиПоставляемойПанели);

КонецПроцедуры

// Схема объектов текущего подключения сервера 1С:Аналитики.
// 
// Параметры:
//  ТипОбъектов - Строка - Тип объектов, извлекаемых с сервера 1С:Аналитика.
//  Владелец - Строка - Идентификатор пользователя, владельца данных 1С:Аналитика.
//  МассивИдентификаторов - Массив - идентификаторы объектов 1С:Аналитика
// 
// Возвращаемое значение:
//  Схема 1С:Аналитика - Схема 1С:Аналитика, загруженные с сервера.
//
Функция СхемаОбъектовАналитики(ТипОбъектов = Неопределено, Владелец = Неопределено, МассивИдентификаторов = Неопределено)

	Фильтр = Новый Структура;
	Если ЗначениеЗаполнено(ТипОбъектов) Тогда
		Фильтр.Вставить("type", ТипОбъектов);
	КонецЕсли;

	Если ЗначениеЗаполнено(Владелец) Тогда
		Фильтр.Вставить("owner", Владелец);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивИдентификаторов) Тогда
		Фильтр.Вставить("id", МассивИдентификаторов);
	КонецЕсли;
	
	Соединение = СистемаАналитики.ПолучитьСоединение();
	Схема = Соединение.ПолучитьСхему("objects", Фильтр);
	
	Возврат Схема;

КонецФункции

// Строку JSON в значение.
// 
// Параметры:
//  СтрокаJSON - Строка - Строка JSON.
//  ПрочитатьВСоответствие - Булево.
// 
// Возвращаемое значение:
//  Массив - Значение из строки JSON.
//
Функция JSONВЗначение(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт

	Если Не ЗначениеЗаполнено(СтрокаJSON) Или СтрокаJSON = "[]" Тогда
		Возврат Новый Массив;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);

	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);

КонецФункции

// Произвольное значение в JSON
// 
// Параметры:
//  Значение - Произвольный
// 
// Возвращаемое значение:
//  Строка - строка JSON.
Функция ЗначениеВJSON(Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ТипыКонтролируемыхОбъектовПанелиАналитики()

	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить("folder");
	ТипыОбъектов.Добавить("chart");
	ТипыОбъектов.Добавить("dashboard");

	Возврат ТипыОбъектов;

КонецФункции

Функция ТипыОбъектовДляОбмена(ТипОбъекта = Неопределено)
    
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить("folder");
	ТипыОбъектов.Добавить("chart");
	ТипыОбъектов.Добавить("dashboard");
	ТипыОбъектов.Добавить("additional-datasource");
	ТипыОбъектов.Добавить("user-field");
	ТипыОбъектов.Добавить("colorScheme");
	
	ТипыОбъектов.Добавить("user");
	ТипыОбъектов.Добавить("desktop");
	
	Если ТипОбъекта <> Неопределено Тогда
		Если ТипыОбъектов.Найти(ТипОбъекта) <> Неопределено Тогда
			ТипыОбъектов.Очистить();
			ТипыОбъектов.Добавить(ТипОбъекта);
		Иначе
			ТипыОбъектов.Очистить();
		КонецЕсли;
	КонецЕсли;

	Возврат ТипыОбъектов;

КонецФункции

Процедура ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, ИмяТипаДанных, ИмяИдентификатор = "id", ИскатьСуществующие = Истина)

	Для Каждого ДанныеИсточника Из Источник[ИмяТипаДанных] Цикл

		Если ИскатьСуществующие Тогда
			ДанныеПриемника = Приемник[ИмяТипаДанных].НайтиСтроки(Новый Структура(ИмяИдентификатор, ДанныеИсточника[ИмяИдентификатор]));
			Если ДанныеПриемника.Количество() Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		МассивСхем.Добавить(ЗначениеВJSON(ДанныеИсточника.ОбъектСхемы));

	КонецЦикла;

КонецПроцедуры

Функция ОписаниеПанелиИзСхемы(Схема)
	
	ПользователиПанели = ПользователиПанелиИзСхемы(Схема);
	РабочиеСтолыПанели = РабочиеСтолыПанелиИзСхемы(Схема);
	МассивПапок = МассивПапокИзСхемы(Схема);
	ИсточникиДанных = ИсточникиДанныхИзСхемы(Схема);
	ПользовательскиеПоля = ПользовательскиеПоляИзСхемы(Схема);
	ЦветовыеСхемы = ЦветовыеСхемыИзСхемы(Схема);
	
	СущностиРабочихСтолов = Новый Соответствие;
	Для Каждого РабочийСтол Из РабочиеСтолыПанели Цикл
		
		СущностиРабочегоСтола = Новый Соответствие;
		ЗаполнитьСущностиРабочегоСтола(МассивПапок, РабочийСтол["Data_RootFolderId"], СущностиРабочегоСтола);
		
		Для Каждого Сущность Из СущностиРабочегоСтола Цикл
			СущностиРабочихСтолов.Вставить(Сущность.Ключ, Истина);
			РабочийСтол.PresentedEntitiesIds.Добавить(Сущность.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
	ПапкиПанели = ПапкиПанелиИзМассиваПапок(МассивПапок, СущностиРабочихСтолов);
	ДиаграммыПанели = ДиаграммыПанелиИзСхемы(Схема, СущностиРабочихСтолов);
	ДашбордыПанели = ДашбордыПанелиИзСхемы(Схема, СущностиРабочихСтолов);
	ПредставленияДашбордовПанели = ПредставленияДашбордовИзСхемы(Схема, ДашбордыПанели);
	ПредставленияДиаграммПанели = ПредставленияДиаграмИзСхемы(Схема, ДиаграммыПанели);
	
	ПоставляемаяПанель = Новый Структура;
	ПоставляемаяПанель.Вставить("Пользователи", ПользователиПанели);
	ПоставляемаяПанель.Вставить("РабочиеСтолы", РабочиеСтолыПанели);
	ПоставляемаяПанель.Вставить("Папки", ПапкиПанели);
	ПоставляемаяПанель.Вставить("Диаграммы", ДиаграммыПанели);
	ПоставляемаяПанель.Вставить("Дашборды", ДашбордыПанели);
	ПоставляемаяПанель.Вставить("ИсточникиДанных", ИсточникиДанных);
	ПоставляемаяПанель.Вставить("ПользовательскиеПоля", ПользовательскиеПоля);
	ПоставляемаяПанель.Вставить("ЦветовыеСхемы", ЦветовыеСхемы);
	ПоставляемаяПанель.Вставить("ПредставленияДашбордовПанели", ПредставленияДашбордовПанели);
	ПоставляемаяПанель.Вставить("ПредставленияДиаграммПанели", ПредставленияДиаграммПанели);
	
	Возврат ПоставляемаяПанель;

КонецФункции

// Загрузка поставляемой панели 1С:Аналитика в рабочий стол пользователя.
// 
// Параметры:
//  ПараметрыПоставляемойПанели - Структура - Описание параметров загружаемой панели 1С:Аналитика
//
Процедура ЗагрузитьНастройкиПанели(ПараметрыПоставляемойПанели)

	Если ТипЗнч(ПараметрыПоставляемойПанели) = Тип("Структура") 
		И ПараметрыПоставляемойПанели.Свойство("АдресХранилища") Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыПоставляемойПанели.АдресХранилища);
	Иначе
		Возврат;
	КонецЕсли;

	ПоставляемаяПанель = ОписаниеПанелиСистемыАналитикиИзДвоичныхДанных(ДвоичныеДанные);
	ПринимающаяПанель = ОписаниеПодключенияСистемыАналитики();

	ЗаменитьПользователяВПанели(ПоставляемаяПанель, ПараметрыПоставляемойПанели);

	ЗаписатьПоставляемуюПанель(ПоставляемаяПанель, ПринимающаяПанель, ПараметрыПоставляемойПанели, Ложь);

КонецПроцедуры

Функция ОписаниеПанелиСистемыАналитикиИзДвоичныхДанных(ДвоичныеДанныеПанели)
	
	ОписаниеПанели = Неопределено;
	
	#Если НЕ(ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение) Тогда
	// Особенность платформы: Объект СхемаСистемыАналитики не доступен 
	// в толстом клиенте обычного приложения и внешнем соединении.
		ПараметрыВычисления = Новый Структура;
		ПараметрыВычисления.Вставить("ДвоичныеДанныеПанели", ДвоичныеДанныеПанели);
		
		ИсполняемыйФрагмент = "Новый СхемаСистемыАналитики(Параметры.ДвоичныеДанныеПанели)";
		
		СхемаПанели = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ИсполняемыйФрагмент, ПараметрыВычисления);
		ОписаниеПанели = ОписаниеПанелиИзСхемы(СхемаПанели);
	#Иначе
	ВызватьИсключение НСтр("ru = 'Получение схемы системы аналитики из двоичных данных недоступно 
		|в толстом клиенте обычного приложения и внешнем соединении.'");
	#КонецЕсли
	
	Возврат ОписаниеПанели;
	
КонецФункции

Функция ОписаниеПодключенияСистемыАналитики()
	
	СхемаПодключения = СхемаОбъектовАналитики(ТипыОбъектовДляОбмена());
	ОписаниеПодключения = ОписаниеПанелиИзСхемы(СхемаПодключения);
	
	Возврат ОписаниеПодключения;
	
КонецФункции

Процедура ЗаписатьПоставляемуюПанель(Источник, Приемник, ПараметрыЗаписи, ИскатьСуществующие = Истина)

	ДанныеПользователя = ДанныеПользователяПриемника(Приемник, ПараметрыЗаписи.ИдентификаторПользователяИБ);
	
	ПриемникРабочийСтол = ДанныеПользователя.РабочийСтол;
	ПриемникПользователь = ДанныеПользователя.Пользователь;
	
	Если ПриемникРабочийСтол = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствует рабочий стол пользователя-получателя'");
	КонецЕсли;

	Если ПриемникПользователь = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Отсутствует пользователь-получатель'");
	КонецЕсли;

	Если Источник["РабочиеСтолы"].Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Поставляемая панель не содержит настроенных отчетов'"); 
	КонецЕсли;
	
	МассивПапок = Приемник["Папки"].НайтиСтроки(Новый Структура("Id", ПриемникРабочийСтол.Data_RootFolderId));
	Если МассивПапок.Количество() Тогда
		ПриемникКорневаяПапка = МассивПапок[0];
	КонецЕсли;
	
	МассивСхем = Новый Массив;
	
	ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, "ИсточникиДанных",, ИскатьСуществующие);
	
	ИсточникРабочийСтол = Источник["РабочиеСтолы"][0];
	ИсточникКорневаяПапка = ИсточникРабочийСтол["Data_RootFolderId"];
	
	// заполнение данных пользователя
	ОбъектСхемыПользователя = ПриемникПользователь.ОбъектСхемы;
	ДанныеПользователяПриемника = JSONВЗначение(ОбъектСхемыПользователя["data"]);
	МассивСвязей = ОбъектСхемыПользователя["links"];
	Для Каждого ПользовательскоеПоле Из Источник.ПользовательскиеПоля Цикл
	
		Если ИскатьСуществующие Тогда
			ПолеПриемника = Приемник["ПользовательскиеПоля"].НайтиСтроки(Новый Структура("id", ПользовательскоеПоле.id));
			Если ПолеПриемника.Количество() = 0 Тогда
				МассивСхем.Добавить(ЗначениеВJSON(ПользовательскоеПоле.ОбъектСхемы));
			КонецЕсли;
		Иначе
			МассивСхем.Добавить(ЗначениеВJSON(ПользовательскоеПоле.ОбъектСхемы));
		КонецЕсли;
		
		Попытка
			Если ДанныеПользователяПриемника["globalMacroIds"].Найти(ПользовательскоеПоле.id) = Неопределено Тогда
				ДанныеПользователяПриемника["globalMacroIds"].Добавить(ПользовательскоеПоле.id);
			КонецЕсли;
		Исключение
			;
		КонецПопытки;
		
		Если МассивСвязей.Найти(ПользовательскоеПоле.id) = Неопределено Тогда
			МассивСвязей.Добавить(ПользовательскоеПоле.id);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЦветоваяСхема Из Источник.ЦветовыеСхемы Цикл
	
		Если ИскатьСуществующие Тогда
			ЦветоваяСхемаПриемника = Приемник["ЦветовыеСхемы"].НайтиСтроки(Новый Структура("id", ЦветоваяСхема.id));
			Если ЦветоваяСхемаПриемника.Количество() = 0 Тогда
				МассивСхем.Добавить(ЗначениеВJSON(ЦветоваяСхема.ОбъектСхемы));
			КонецЕсли;
		Иначе
			МассивСхем.Добавить(ЗначениеВJSON(ЦветоваяСхема.ОбъектСхемы));			
		КонецЕсли;
		
		Попытка
			Если ДанныеПользователяПриемника["colorSchemeIds"].Найти(ЦветоваяСхема.id) = Неопределено Тогда
				ДанныеПользователяПриемника["colorSchemeIds"].Добавить(ЦветоваяСхема.id);
			КонецЕсли;
		Исключение
			;
		КонецПопытки;
		
		Если МассивСвязей.Найти(ЦветоваяСхема.id) = Неопределено Тогда
			МассивСвязей.Добавить(ЦветоваяСхема.id);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектСхемыПользователя["data"] = ЗначениеВJSON(ДанныеПользователяПриемника);
	ОбъектСхемыПользователя["links"] = МассивСвязей;
	
	ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, "Диаграммы",, ИскатьСуществующие);
	ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, "ПредставленияДиаграммПанели",, ИскатьСуществующие);
	ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, "Дашборды",, ИскатьСуществующие);
	ДобавитьИсточникВМассивСхем(Источник, Приемник, МассивСхем, "ПредставленияДашбордовПанели",, ИскатьСуществующие);
	
	СписокНачальныхКаталогов = Новый СписокЗначений;
	ТаблицаКаталогов = Новый ТаблицаЗначений;
	ТаблицаКаталогов.Колонки.Добавить("ИдентификаторКаталога");
	ТаблицаКаталогов.Колонки.Добавить("ВложенныеКаталоги");
	ТаблицаКаталогов.Колонки.Добавить("Схема");

	Для Каждого Папка Из Источник.Папки Цикл
		
		ОбъектСхемы = Папка.ОбъектСхемы;
		Если ОбъектСхемы["id"] = ИсточникКорневаяПапка Тогда
			// Это корневая папка - перепишем ее содержимое в корневую папку приемника
			// саму эту папку не помещаем в приемник
			
			ИсточникДанныеКорневойПапки = JSONВЗначение(ОбъектСхемы["data"]);
			ПриемникДанныеКорневойПапки = JSONВЗначение(ПриемникКорневаяПапка.ОбъектСхемы["data"]);
			
			Для каждого ИдФайла Из ИсточникДанныеКорневойПапки["fileIds"] Цикл
				Если ПриемникДанныеКорневойПапки["fileIds"].Найти(ИдФайла) = Неопределено Тогда
					ПриемникДанныеКорневойПапки["fileIds"].Добавить(ИдФайла);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого ИдПапки Из ИсточникДанныеКорневойПапки["folderIds"] Цикл
				Если ПриемникДанныеКорневойПапки["folderIds"].Найти(ИдПапки) = Неопределено Тогда
					ПриемникДанныеКорневойПапки["folderIds"].Добавить(ИдПапки);
				КонецЕсли;

				СписокНачальныхКаталогов.Добавить(ИдПапки);

			КонецЦикла;
			
			Если ПриемникКорневаяПапка.ОбъектСхемы["links"] = Неопределено Тогда
				ПриемникКорневаяПапка.ОбъектСхемы["links"] = Новый Массив;
			КонецЕсли;
			
			Для каждого ИдСсылки Из ОбъектСхемы["links"] Цикл
				Если ПриемникКорневаяПапка.ОбъектСхемы["links"].Найти(ИдСсылки) = Неопределено Тогда
					ПриемникКорневаяПапка.ОбъектСхемы["links"].Добавить(ИдСсылки);
				КонецЕсли;
			КонецЦикла;
			
			ПриемникКорневаяПапка.ОбъектСхемы["data"] = ЗначениеВJSON(ПриемникДанныеКорневойПапки);
			
			Продолжить;
		КонецЕсли;
		
		Если ИскатьСуществующие Тогда
			ПапкаПриемника = Приемник["Папки"].НайтиСтроки(Новый Структура("id", Папка.id));
			Если ПапкаПриемника.Количество() Тогда
				Продолжить;// папка уже присутствует в приемнике
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаКаталогов.Добавить();
		НоваяСтрока.ИдентификаторКаталога = Папка.Id;
		НоваяСтрока.Схема = ЗначениеВJSON(Папка.ОбъектСхемы);
		НоваяСтрока.ВложенныеКаталоги = Папка.Data_FolderIds;
		
	КонецЦикла;
	
	УпорядоченныйМассивСхем = Новый Массив;
	УпорядочитьМассивКаталоговСогласноИерархииРекурсивно(УпорядоченныйМассивСхем, ТаблицаКаталогов, СписокНачальныхКаталогов);
	
	Для каждого СхемаКаталога Из УпорядоченныйМассивСхем Цикл
		МассивСхем.Добавить(СхемаКаталога);
	КонецЦикла;

	// публикация в COMMON_FOLDER_ID
	ОбъектСхемыОбщегоКаталога = ОпубликоватьПанельДляВсехПользователей(Приемник.Папки, ПриемникКорневаяПапка, ПриемникДанныеКорневойПапки["folderIds"]);
	МассивСхем.Добавить(ЗначениеВJSON(ОбъектСхемыОбщегоКаталога));
	
	// Добавляем последним корневой каталог, для последующей корректной записи в 1С:Аналитика
	МассивСхем.Добавить(ЗначениеВJSON(ПриемникКорневаяПапка.ОбъектСхемы));
	
	МассивСхем.Добавить(ЗначениеВJSON(ОбъектСхемыПользователя));

	ЕстьОшибкиЗагрузки = Ложь;
	Соединение = СистемаАналитики.ПолучитьСоединение();
	Для каждого СхемаJSON Из МассивСхем Цикл

		Попытка
		#Если НЕ(ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение) Тогда
		// Особенность платформы: Объект СхемаСистемыАналитики не доступен 
		// в толстом клиенте обычного приложения и внешнем соединении.
			Соединение.ЗаписатьСхему("objects", Новый СхемаСистемыАналитики(СхемаJSON));
		#Иначе
			ВызватьИсключение НСтр("ru = 'Получение схемы системы аналитики из строки недоступно 
				|в толстом клиенте обычного приложения и внешнем соединении.'");
		#КонецЕсли
		Исключение
			ЕстьОшибкиЗагрузки = Истина;
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Поставляемые панели 1С:Аналитика.Ошибка записи загружаемой схемы'", 
				ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Обработки.ПанельАдминистрирования1САналитики, СхемаJSON,
				);
				Продолжить;	// Продолжить загрузку элементов схемы несмотря на ошибку записи схемы
		КонецПопытки;

	КонецЦикла;
	
	Если ЕстьОшибкиЗагрузки Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не все элементы схемы поставляемых панелей 1С:Аналитика были загружены. 
		|Подробности в журнале регистрации.'"));
	КонецЕсли;

КонецПроцедуры

Процедура УпорядочитьМассивКаталоговСогласноИерархииРекурсивно(УпорядоченныйМассивСхем, ТаблицаКаталогов, СписокНачальныхКаталогов)
	
	Для каждого НачальныйКаталог Из СписокНачальныхКаталогов Цикл
		
		НайденныйКаталог = ТаблицаКаталогов.Найти(НачальныйКаталог.Значение, "ИдентификаторКаталога");
		Если Не НайденныйКаталог = Неопределено Тогда
			
			Если Не (НайденныйКаталог.ВложенныеКаталоги = Неопределено 
				Или (ТипЗнч(НайденныйКаталог.ВложенныеКаталоги) = Тип("СписокЗначений") И НайденныйКаталог.ВложенныеКаталоги.Количество() = 0)) Тогда
				
				УпорядочитьМассивКаталоговСогласноИерархииРекурсивно(УпорядоченныйМассивСхем, ТаблицаКаталогов, НайденныйКаталог.ВложенныеКаталоги);
			КонецЕсли;
			// добавляем после добавления вложенных
			УпорядоченныйМассивСхем.Добавить(НайденныйКаталог.Схема);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОпубликоватьПанельДляВсехПользователей(Каталоги, КорневойКаталог, МассивИдентификаторовДляОбщейПапки);

	ОбщаяПапка = Каталоги.Найти("COMMON_FOLDER_ID", "id");
	
	Если ОбщаяПапка = Неопределено Или ОбщаяПапка.ОбъектСхемы["ownerName"] = Неопределено Тогда
		// Необходимо сформировать общий каталог
		СоответствиеОбщегоКаталога = Новый Соответствие;
		СоответствиеОбщегоКаталога.Вставить("folderIds", МассивИдентификаторовДляОбщейПапки);
		СоответствиеОбщегоКаталога.Вставить("fileIds", Новый Массив);
		СоответствиеОбщегоКаталога.Вставить("color", "");
		
		ОбъектСхемыОбщегоКаталога = ОбщаяПапка.ОбъектСхемы;
		ОбъектСхемыОбщегоКаталога["owner"]		= КорневойКаталог.ОбъектСхемы["owner"];
		ОбъектСхемыОбщегоКаталога["ownerName"]	= КорневойКаталог.ОбъектСхемы["ownerName"];
		ОбъектСхемыОбщегоКаталога["updated"]	= КорневойКаталог.ОбъектСхемы["updated"];
		ОбъектСхемыОбщегоКаталога["id"]			= "COMMON_FOLDER_ID";
		ОбъектСхемыОбщегоКаталога["data"] 		= ЗначениеВJSON(СоответствиеОбщегоКаталога);
		ОбъектСхемыОбщегоКаталога["links"]		= МассивИдентификаторовДляОбщейПапки;
		
	Иначе
		ОбъектСхемыОбщегоКаталога = ОбщаяПапка.ОбъектСхемы;
		Если ОбъектСхемыОбщегоКаталога["links"] = Неопределено Тогда
			ОбъектСхемыОбщегоКаталога["links"] = Новый Массив;
		КонецЕсли;
		
		СоответствиеОбщегоКаталога = JSONВЗначение(ОбъектСхемыОбщегоКаталога["data"]);
		Для каждого ИдентификаторКаталогаСсылки Из МассивИдентификаторовДляОбщейПапки Цикл
			
			Если ОбъектСхемыОбщегоКаталога["links"].Найти(ИдентификаторКаталогаСсылки) = Неопределено Тогда
				ОбъектСхемыОбщегоКаталога["links"].Добавить(ИдентификаторКаталогаСсылки);
			КонецЕсли;
			
			Если СоответствиеОбщегоКаталога["folderIds"].Найти(ИдентификаторКаталогаСсылки) = Неопределено Тогда
				СоответствиеОбщегоКаталога["folderIds"].Добавить(ИдентификаторКаталогаСсылки);
			КонецЕсли;
				
		КонецЦикла;
		
		ОбъектСхемыОбщегоКаталога["data"] = ЗначениеВJSON(СоответствиеОбщегоКаталога);
		
	КонецЕсли;
	
	Возврат ОбъектСхемыОбщегоКаталога;
	
КонецФункции

Функция ДанныеПользователяПриемника(Приемник, ИдентификаторПользователяИБ)

	РабочийСтолПолучателя = Неопределено;
	МассивРабочихСтолов = Приемник["РабочиеСтолы"].НайтиСтроки(Новый Структура("Owner", ИдентификаторПользователяИБ));
	
	Если МассивРабочихСтолов.Количество() Тогда
		РабочийСтолПолучателя = МассивРабочихСтолов[0];
	КонецЕсли;
	
	ПользовательПолучателя = Неопределено;
	МассивПользователей = Приемник["Пользователи"].НайтиСтроки(Новый Структура("id", ИдентификаторПользователяИБ));
	Если МассивПользователей.Количество() Тогда
		ПользовательПолучателя = МассивПользователей[0];
	КонецЕсли;	
	
	Возврат Новый Структура("РабочийСтол, Пользователь",
		РабочийСтолПолучателя,
		ПользовательПолучателя);

КонецФункции

Процедура ЗаменитьПользователяВПанели(ПоставляемаяПанель, ПараметрыПоставляемойПанели)
	
	Для каждого ОписаниеТаблицыДанных Из ПоставляемаяПанель Цикл
		
		Если ОписаниеТаблицыДанных.Ключ = "Пользователи" Тогда
			Продолжить;
		КонецЕсли;

		Для каждого СтрокаТаблицы Из ОписаниеТаблицыДанных.Значение Цикл
			
			СтрокаТаблицы.OwnerName = ПараметрыПоставляемойПанели.ИмяПользователя;
			СтрокаТаблицы.Owner = ПараметрыПоставляемойПанели.ИдентификаторПользователяИБ;
			
			СтрокаТаблицы.ОбъектСхемы["owner"] = ПараметрыПоставляемойПанели.ИдентификаторПользователяИБ;
			СтрокаТаблицы.ОбъектСхемы["ownerName"] = ПараметрыПоставляемойПанели.ИмяПользователя;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПользователиПанелиИзСхемы(Схема)

	ТаблицаПользователей = ТаблицаОбъектовАналитики("user");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("user"));
	
	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл
		Строка = ТаблицаПользователей.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);
	КонецЦикла;
	
	Возврат ТаблицаПользователей;
	
КонецФункции

Функция ИсточникиДанныхИзСхемы(Схема)

	ТаблицаИсточниковДанных = ТаблицаОбъектовАналитики();
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("additional-datasource"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл

		Строка = ТаблицаИсточниковДанных.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);

	КонецЦикла;

	Возврат ТаблицаИсточниковДанных;

КонецФункции

Функция ПользовательскиеПоляИзСхемы(Схема)

	ТаблицаПолей = ТаблицаОбъектовАналитики();
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("user-field"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл

		Строка = ТаблицаПолей.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);

	КонецЦикла;

	Возврат ТаблицаПолей;

КонецФункции

Функция ЦветовыеСхемыИзСхемы(Схема)

	ТаблицаПолей = ТаблицаОбъектовАналитики("colorScheme");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("colorScheme"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл

		Строка = ТаблицаПолей.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);

	КонецЦикла;

	Возврат ТаблицаПолей;

КонецФункции

Функция РабочиеСтолыПанелиИзСхемы(Схема)

	ТаблицаРабочихСтолов = ТаблицаОбъектовАналитики("desktop");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("desktop"));
	
	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл
		Строка = ТаблицаРабочихСтолов.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);
		
		ДанныеРабочегоСтола = JSONВЗначение(Строка["Data"]);
		
		ИдентификаторКорневойПапки = ДанныеРабочегоСтола["rootFolderId"]; 
		Если ИдентификаторКорневойПапки = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Версия схемы данных не поддерживается обработкой'");
		КонецЕсли;
		
		Строка.Data_RootFolderId = ИдентификаторКорневойПапки;
	КонецЦикла;
	
	Возврат ТаблицаРабочихСтолов;
	
КонецФункции

Функция МассивПапокИзСхемы(Схема)
	
	Возврат ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("folder"));
	
КонецФункции

Процедура ЗаполнитьСущностиРабочегоСтола(МассивПапок, ТекущийИдентификаторПапки, СущностиРабочегоСтола)

	Для Каждого Папка Из МассивПапок Цикл
		
		Если Папка["id"] = ТекущийИдентификаторПапки Тогда
			
			СущностиРабочегоСтола.Вставить(ТекущийИдентификаторПапки, Истина);
			
			ДанныеПапки = JSONВЗначение(Папка["data"]);

			ИдентификаторыФайлов = ДанныеПапки["fileIds"];
			Для Каждого ИдентификаторФайла Из ИдентификаторыФайлов Цикл
				СущностиРабочегоСтола.Вставить(ИдентификаторФайла, Истина);
			КонецЦикла;
			
			ИдентификаторыПапок = ДанныеПапки["folderIds"];
			Для Каждого ИдентификаторПапки Из ИдентификаторыПапок Цикл
				Если СущностиРабочегоСтола.Получить(ИдентификаторПапки) = Неопределено Тогда
					ЗаполнитьСущностиРабочегоСтола(МассивПапок, ИдентификаторПапки, СущностиРабочегоСтола);
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПапкиПанелиИзМассиваПапок(МассивПапок, СущностиРабочихСтолов)

	ТаблицаПапок = ТаблицаОбъектовАналитики("folder");
	Для Каждого Папка In МассивПапок Цикл

		Если Папка.Получить("version") <> Неопределено Тогда
            ВызватьИсключение НСтр("ru = 'Версия схемы данных не поддерживается обработкой'");
		КонецЕсли;
		
		ИдентификаторПапки = Папка["id"];
		Если СущностиРабочихСтолов <> Неопределено 
			И Не ИдентификаторПапки = "COMMON_FOLDER_ID" //общая папка нужна для корректной публикации в дальнейшем
			И СущностиРабочихСтолов.Получить(ИдентификаторПапки) = Неопределено Тогда
            // Исключение удаленных объектов
            Продолжить;
        КонецЕсли;

		Строка = ТаблицаПапок.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, Папка);
		
		ДанныеПапки = JSONВЗначение(Строка["Data"]);
		Строка["Data_FolderIds"].ЗагрузитьЗначения(ДанныеПапки["folderIds"]);
		Строка["Data_FileIds"].ЗагрузитьЗначения(ДанныеПапки["fileIds"]);

	КонецЦикла;
	
	Возврат ТаблицаПапок;

КонецФункции

Функция ДиаграммыПанелиИзСхемы(Схема, СущностиРабочихСтолов)

	ТаблицаДиаграмм = ТаблицаОбъектовАналитики("chart");

	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("chart"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл
		Если ОбъектСхемы.Получить("originalId") <> Неопределено Тогда // это черновик
			Продолжить;
		КонецЕсли;

		Если СущностиРабочихСтолов <> Неопределено 
			И СущностиРабочихСтолов.Получить(ОбъектСхемы["id"]) = Неопределено Тогда
			// Исключение удаленных объектов
			Продолжить;
		КонецЕсли;

		Строка = ТаблицаДиаграмм.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);
	КонецЦикла;

	Возврат ТаблицаДиаграмм;

КонецФункции

Функция ДашбордыПанелиИзСхемы(Схема, СущностиРабочихСтолов)

	ТаблицаДашбордов = ТаблицаОбъектовАналитики("dashboard");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("dashboard"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл

		Если ОбъектСхемы.Получить("originalId") <> Неопределено Тогда // это черновик
			Продолжить;
		КонецЕсли;

		Если СущностиРабочихСтолов <> Неопределено И СущностиРабочихСтолов.Получить(ОбъектСхемы["id"]) = Неопределено Тогда
			// Исключение удаленных объектов
			Продолжить;
		КонецЕсли;

		Строка = ТаблицаДашбордов.Добавить();
		ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);

	КонецЦикла;

	Возврат ТаблицаДашбордов;
	
КонецФункции

Функция ПредставленияДашбордовИзСхемы(Схема, ДашбордыПанели)

	ТаблицаДашбордов = ТаблицаОбъектовАналитики("dashboard", "view");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("dashboard"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл
		Если ОбъектСхемы.Получить("originalId") <> Неопределено Тогда
			НайденнаяСтрока = ДашбордыПанели.Найти(ОбъектСхемы["originalId"], "id");
			Если Не НайденнаяСтрока = Неопределено Тогда
				ИдентификаторОбъекта = Строка(ОбъектСхемы.Получить("id"));
				Если Лев(ИдентификаторОбъекта, 4) = "view" Тогда
					Строка = ТаблицаДашбордов.Добавить();
					ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаДашбордов;

КонецФункции

Функция ПредставленияДиаграмИзСхемы(Схема, ДиаграммыПанели)

	ТаблицаДиаграмм = ТаблицаОбъектовАналитики("chart", "view");
	ОбъектыСхемы = ОбъектыСхемы(Схема, ТипыОбъектовДляОбмена("chart"));

	Для Каждого ОбъектСхемы Из ОбъектыСхемы Цикл
		Если ОбъектСхемы.Получить("originalId") <> Неопределено Тогда
			НайденнаяСтрока = ДиаграммыПанели.Найти(ОбъектСхемы["originalId"], "id");
			Если Не НайденнаяСтрока = Неопределено Тогда
				ИдентификаторОбъекта = Строка(ОбъектСхемы.Получить("id"));
				Если Лев(ИдентификаторОбъекта, 4) = "view" Тогда
					Строка = ТаблицаДиаграмм.Добавить();
					ЗаполнитьСтрокуОбъектаСхемы(Строка, ОбъектСхемы);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ТаблицаДиаграмм;

КонецФункции

Функция ТаблицаОбъектовАналитики(ТипОбъекта = Неопределено, УточнениеТипа = Неопределено)

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	ТаблицаОбъектов.Колонки.Добавить("Id", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("Owner", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("Type", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("OwnerName", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("Updated", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("Data", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("Links", Новый ОписаниеТипов("СписокЗначений"));
	
	Если ТипОбъекта = "folder" Тогда
		ТаблицаОбъектов.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
		ТаблицаОбъектов.Колонки.Добавить("Data_FolderIds", Новый ОписаниеТипов("СписокЗначений"));
		ТаблицаОбъектов.Колонки.Добавить("Data_FileIds", Новый ОписаниеТипов("СписокЗначений"));
	КонецЕсли;
	
	Если ТипОбъекта = "user-field" Тогда
		ТаблицаОбъектов.Колонки.Добавить("cubeName", Новый ОписаниеТипов("Строка"));
	КонецЕсли;

	Если ТипОбъекта = "colorScheme" Тогда
		ТаблицаОбъектов.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
	КонецЕсли;	
	
	Если ТипОбъекта = "desktop" Тогда
		ТаблицаОбъектов.Колонки.Добавить("Data_RootFolderId", Новый ОписаниеТипов("Строка"));
		ТаблицаОбъектов.Колонки.Добавить("PresentedEntitiesIds", Новый ОписаниеТипов("СписокЗначений"));
	КонецЕсли;
	
	Если ТипОбъекта = "chart" Тогда
		ТаблицаОбъектов.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
		ТаблицаОбъектов.Колонки.Добавить("ChartType", Новый ОписаниеТипов("Строка"));
		
		Если УточнениеТипа = "view" Тогда
			ТаблицаОбъектов.Колонки.Добавить("originalId", Новый ОписаниеТипов("Строка"));
			ТаблицаОбъектов.Колонки.Добавить("displayModeEnable", Новый ОписаниеТипов("Булево"));
			ТаблицаОбъектов.Колонки.Добавить("active", Новый ОписаниеТипов("Булево"));
		КонецЕсли;		
	КонецЕсли;
	
	Если ТипОбъекта = "dashboard" Тогда
		ТаблицаОбъектов.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
		
		Если УточнениеТипа = "view" Тогда
			ТаблицаОбъектов.Колонки.Добавить("originalId", Новый ОписаниеТипов("Строка"));
			ТаблицаОбъектов.Колонки.Добавить("displayModeEnable", Новый ОписаниеТипов("Булево"));
			ТаблицаОбъектов.Колонки.Добавить("active", Новый ОписаниеТипов("Булево"));
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаОбъектов.Колонки.Добавить("ОбъектСхемы", Новый ОписаниеТипов("Соответствие"));
	
	Возврат ТаблицаОбъектов;

КонецФункции

Функция ОбъектыСхемы(Схема, ТипыОбъектов = Неопределено)

	ОбъектыСхемы = Новый Массив;

	ВсеОбъектыСхемы = JSONВЗначение(Схема.ПолучитьКакСтроку(), Истина);
	Для Каждого ОбъектСхемы Из ВсеОбъектыСхемы Цикл
		
		Если ЗначениеЗаполнено(ТипыОбъектов)
			И ТипыОбъектов.Найти(ОбъектСхемы["type"]) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектыСхемы.Добавить(ОбъектСхемы);
		
	КонецЦикла;
	
	Возврат ОбъектыСхемы;

КонецФункции

Процедура ЗаполнитьСтрокуОбъектаСхемы(Строка, Знач ОбъектСхемы)
	
	Ключи = Новый Массив;
	Ключи.Добавить("id");
	Ключи.Добавить("owner");
	Ключи.Добавить("type");
	Ключи.Добавить("data");
	Ключи.Добавить("ownerName");
	Ключи.Добавить("updated");
	Ключи.Добавить("links");
	Ключи.Добавить("name");
	Ключи.Добавить("chartType");
	Ключи.Добавить("originalId");
	
	ЗначениеКлюча = Неопределено;
	Для Каждого Ключ Из Ключи Цикл
		
		ЗначениеКлюча = ОбъектСхемы.Получить(Ключ);
		Если ЗначениеКлюча = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Строка[Ключ]) = Тип("СписокЗначений") Тогда
			Строка[Ключ].ЗагрузитьЗначения(ЗначениеКлюча); 
		Иначе
			Строка[Ключ] = ОбъектСхемы[Ключ];
		КонецЕсли;
		
	КонецЦикла;
	
	Строка["ОбъектСхемы"] = ОбъектСхемы;
	
КонецПроцедуры

// Структура поставляемой панели. См. ИнтеграцияС1САналитикойПовтИсп.СтруктураПоставляемойПанели
Функция СтруктураПоставляемойПанели(ИмяМакета, ИмяРегистра)
	
	Возврат ИнтеграцияС1САналитикойПовтИсп.СтруктураПоставляемойПанели(ИмяМакета, ИмяРегистра);
	
КонецФункции

Функция ДатаИзмененияОбъектовАналитики(ОбъектыАналитики, СтруктураПанели)

	МассивИдентификаторовДляПубликации = Неопределено;
	Для каждого ЭлементПанели Из СтруктураПанели.ДанныеПанели Цикл
		
		Если ЭлементПанели.Свойство("name")
			И ЭлементПанели["name"] = "ROOT_FOLDER_NAME" Тогда
			МассивИдентификаторовДляПубликации = ЭлементПанели["links"];
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ДатаИзменения = Дата(1, 1, 1);
	Для каждого ИдентификаторМакета Из СтруктураПанели.Идентификаторы Цикл
		
		Для Каждого ОбъектАналитики Из ОбъектыАналитики Цикл
			
			Если ОбъектАналитики["id"] <> ИдентификаторМакета Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаОбъектаАналитики = ДатаПоМеткеВремени(ОбъектАналитики.updated);
			Если ДатаОбъектаАналитики > ДатаИзменения Тогда
				ДатаИзменения = ДатаОбъектаАналитики;
			КонецЕсли;

		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ДатаИзменения = Дата(1, 1, 1) Тогда
		ДатаИзмененияОбщегоКаталога = Дата(1, 1, 1);
		Для каждого ОбъектАналитики Из ОбъектыАналитики Цикл
			
			Если ОбъектАналитики["Id"] = "COMMON_FOLDER_ID" Тогда
				Если ОбъектАналитики.Свойство("updated") Тогда
					Если ОбъектАналитики.Свойство("links") Тогда
						РазностьМассивов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивИдентификаторовДляПубликации, ОбъектАналитики["links"]);
						Если РазностьМассивов.Количество() Тогда
							// Публикация была удалена или нарушена
							ДатаИзмененияОбщегоКаталога = ДатаПоМеткеВремени(ОбъектАналитики.updated);
						Иначе
							// Публикация для панели корректна
							Прервать;
						КонецЕсли;
					Иначе
						// Публикация была удалена
						ДатаИзмененияОбщегоКаталога = ДатаПоМеткеВремени(ОбъектАналитики.updated);
					КонецЕсли;
				Иначе
					// Публикация не выполнялась ??? - нарушен процесс публикации
					ДатаИзмененияОбщегоКаталога = ?(ДатаИзменения = Дата(1, 1, 1), Дата(1, 1, 1), ДатаИзменения + 1);
				КонецЕсли;
				
				ДатаИзменения = ?(ДатаИзменения > ДатаИзмененияОбщегоКаталога, ДатаИзменения, ДатаИзмененияОбщегоКаталога);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(ДатаИзменения > Дата(1, 1, 1), ДатаИзменения, Неопределено);
	
КонецФункции

// Добавляет запись в журнал регистрации.
//
// Параметры:
//  СообщениеОбОшибке - Строка - комментарий к записи журнала регистрации;
//  Ошибка - Булево - если истина будет установлен уровень журнала регистрации "Ошибка";
//  ОбъектМетаданных - ОбъектМетаданных - объект метаданных для которого регистрируется ошибка.
//
Процедура ЗаписатьИнформациюВЖурналРегистрации(
		СообщениеОбОшибке,
		Ошибка = Истина,
		ОбъектМетаданных = Неопределено) Экспорт
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Поставляемые панели 1С:Аналитики'", ОбщегоНазначения.КодОсновногоЯзыка()),
		?(Ошибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),
		?(ОбъектМетаданных = Неопределено, Обработки.ПанельАдминистрирования1САналитики, ОбъектМетаданных),
		,
		Лев(СообщениеОбОшибке, 5120));
	
КонецПроцедуры

#КонецОбласти