#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.Кандидаты) Тогда
		Возврат;
	КонецЕсли;
	
	Команда = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Кандидаты'");
	Команда.Важность           = "Обычное";
	Команда.ТипПараметра       = Новый ОписаниеТипов("СправочникСсылка.Вакансии");
	Команда.РежимЗаписи        = "ЗаписыватьТолькоНовые";
	Команда.Менеджер           = "Отчет.Кандидаты";
	Команда.КлючВарианта       = "Кандидаты";
	Команда.ИмяПараметраФормы  = "Отбор.Вакансия";
	Команда.СочетаниеКлавиш    = Новый СочетаниеКлавиш(Клавиша.A, Ложь, Истина, Истина);
	Команда.Подменю            = "КандидатыОтчетКандидатыПодменю";
	Команда.Картинка           = БиблиотекаКартинок.Отчет;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов
// 
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ДополнитьСоставКомандПечати(КомандыПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Справочник.Вакансии";
	КомандаПечати.Идентификатор = "Вакансия";
	КомандаПечати.Представление = НСтр("ru = 'Описание вакансии'");
	КомандаПечати.ЗаголовокФормы = НСтр("ru = 'Вакансия'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Вакансия");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Вакансия'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.Вакансии.ПФ_MXL_Вакансия";
		ПечатнаяФорма.ТабличныйДокумент = ПечатьВакансии(МассивОбъектов, ОбъектыПечати, ПечатнаяФорма.ПолныйПутьКМакету);
		
	КонецЕсли;
	
	СформироватьДополнительныеПечатныеФормы(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	ИсключитьВариантыОписанийИзВложений(Реквизиты, Вложения, ДополнительныеПараметры);
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	ЗаполнитьЗначенияРеквизитовШаблонаОтправкиОписания(Сообщение, ПредметСообщения, ДополнительныеПараметры);
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.СогласованиеВакансий

// См. СогласованиеВакансий.ЗаполнитьДанныеСогласованияВакансии
Процедура ЗаполнитьДанныеСогласованияВакансии(ОбъектСогласования, ДанныеСогласования, ТребуетсяСогласование) Экспорт
	
	Если ЗначениеЗаполнено(ОбъектСогласования.Основание) Тогда
		ТребуетсяСогласование = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеСогласования, ОбъектСогласования);
	ДанныеСогласования.Вакансия = ОбъектСогласования.Ссылка;
	ДанныеСогласования.Комментарий = ОбъектСогласования.Примечание;
	ДанныеСогласования.Дата = ?(НачалоДня(ОбъектСогласования.ДатаОткрытия) = НачалоДня(ТекущаяДатаСеанса()), 
		ТекущаяДатаСеанса(), ОбъектСогласования.ДатаОткрытия);
	ДанныеСогласования.Проведен = Истина;
	
	ДанныеСогласования.СостояниеСогласования = Неопределено;
	Если Не ОбъектСогласования.ПометкаУдаления Тогда
		ДанныеСогласования.СостояниеСогласования = Перечисления.СостоянияСогласования.Рассматривается;
	КонецЕсли;
	
КонецПроцедуры

// См. СогласованиеВакансий.ПриУстановкеСостоянияСогласованияВакансии
Процедура ПриУстановкеСостоянияСогласованияВакансии(ОбъектСогласования, ДанныеСогласования) Экспорт
	
	Если ДанныеСогласования.СостояниеСогласования = Перечисления.СостоянияСогласования.Отклонено Тогда
		Вакансии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектСогласования.Ссылка);
		ОтменитьНабор(Вакансии, ДанныеСогласования.ДатаРассмотрения);
	КонецЕсли;
	
	Если ДанныеСогласования.СостояниеСогласования = Перечисления.СостоянияСогласования.Согласовано Тогда
		Вакансии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектСогласования.Ссылка);
		ВозобновитьНабор(Вакансии, ДанныеСогласования.ДатаРассмотрения);
	КонецЕсли;
	
КонецПроцедуры

// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.СогласованиеВакансий

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИнформационнаяСтрокаКандидатовПоВакансии", Истина);
	Методы.Вставить("ИнформационнаяСтрокаЗанятостиПоДаннымВакансии", Истина);
	Методы.Вставить("ВыполнитьЗаписьОбъекта", Истина);
	Методы.Вставить("УточнитьСостояниеСогласованияПоСостояниюВакансии");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки, , "ПодборПерсонала");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Функция-конструктор для составления параметра к методу ДанныеВакансии.
// 
// Возвращаемое значение:
//  Структура - структура с полями, описывающих требования к получению данных вакансии.
Функция ПараметрыПолученияДанныхВакансии() Экспорт
	
	ПараметрыПолучения = Новый Структура();
	ПараметрыПолучения.Вставить("ХарактеристикиПерсонала", Ложь);
	ПараметрыПолучения.Вставить("ДействияСотрудников", Ложь);
	ПараметрыПолучения.Вставить("ЭтапыРаботыСКандидатами", Ложь);
	ПараметрыПолучения.Вставить("Согласование", Ложь);
	ПараметрыПолучения.Вставить("ТекущееСостояние", Ложь);
	
	Возврат ПараметрыПолучения;
	
КонецФункции

// Формирует коллекцию, содержащую данные вакансии.
//
// Параметры:
//  Вакансия			 - СправочникСсылка.Вакансия - вакансия, данные которой нужно получить.
//  ПараметрыПолучения	 - Структура - необязательный, см. ПараметрыПолученияДанныхВакансии.
// 
// Возвращаемое значение:
//  Структура - структура с полями:
//  Вакансия
//  Наименование
//  Требования
//  Обязанности
//  Условия
//  Позиция
//  НоваяПозиция
//  Должность
//  Подразделение
//  Организация
//  СпособНабора
//  НазначениеНабора
//  ПрофильДолжности
//  ДатаОткрытия
//  Заявитель
//  Примечание
//  Основание
//  СоответствуетПрофилюДолжности
//  ХарактеристикиПерсонала - необязательное поле, наличие определяется значением ПараметрыПолучения.ХарактеристикиПерсонала
//  ДействияСотрудников - необязательное поле, наличие определяется значением ПараметрыПолучения.ДействияСотрудников
//  ЭтапыРаботыСКандидатами - необязательное поле, наличие определяется значением ПараметрыПолучения.ЭтапыРаботыСКандидатами
//  Согласование - необязательное поле, наличие определяется значением ПараметрыПолучения.Согласование
//
Функция ДанныеВакансии(Вакансия, ПараметрыПолучения = Неопределено) Экспорт
	
	Если ПараметрыПолучения = Неопределено Тогда
		ПараметрыПолучения = ПараметрыПолученияДанныхВакансии();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	Вакансии.Наименование КАК Наименование,
		|	Вакансии.Требования КАК Требования,
		|	Вакансии.Обязанности КАК Обязанности,
		|	Вакансии.Условия КАК Условия,
		|	Вакансии.Позиция КАК Позиция,
		|	Вакансии.НоваяПозиция КАК НоваяПозиция,
		|	Вакансии.Должность КАК Должность,
		|	Вакансии.Подразделение КАК Подразделение,
		|	Вакансии.Позиция.Владелец КАК Организация,
		|	Вакансии.СпособНабора КАК СпособНабора,
		|	Вакансии.НазначениеНабора КАК НазначениеНабора,
		|	Вакансии.ПрофильДолжности КАК ПрофильДолжности,
		|	Вакансии.ДатаОткрытия КАК ДатаОткрытия,
		|	Вакансии.Заявитель КАК Заявитель,
		|	Вакансии.Примечание КАК Примечание,
		|	Вакансии.Основание КАК Основание,
		|	Вакансии.СоответствуетПрофилюДолжности КАК СоответствуетПрофилюДолжности,
		|	Вакансии.РабочееМесто КАК РабочееМесто,
		|	Вакансии.ИспытательныйСрок КАК ИспытательныйСрок
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|ГДЕ
		|	Вакансии.Ссылка = &Вакансия";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	Колонки = СхемаЗапроса.ПакетЗапросов[0].Колонки;
	
	Если ПараметрыПолучения.ХарактеристикиПерсонала Тогда
		ВыбираемыеПоля.Добавить("Вакансии.ХарактеристикиПерсонала.Характеристика");
		ВыбираемыеПоля.Добавить("Вакансии.ХарактеристикиПерсонала.Значение");
		ВыбираемыеПоля.Добавить("Вакансии.ХарактеристикиПерсонала.Вес");
		ВыбираемыеПоля.Добавить("Вакансии.ХарактеристикиПерсонала.ТребуетсяПроверка");
		ВыбираемыеПоля.Добавить("Вакансии.ХарактеристикиПерсонала.ТребуетсяОбучение");
	КонецЕсли;
	
	Если ПараметрыПолучения.ДействияСотрудников Тогда
		ВыбираемыеПоля.Добавить("Вакансии.ДействияСотрудников.ДействиеСотрудника");
	КонецЕсли;
	
	Если ПараметрыПолучения.ЭтапыРаботыСКандидатами Тогда
		ВыражениеНомерСтроки = "Вакансии.ЭтапыРаботыСКандидатами.НомерСтроки";
		ВыбираемыеПоля.Добавить(ВыражениеНомерСтроки);
		Колонки.Найти(Новый ВыражениеСхемыЗапроса(ВыражениеНомерСтроки)).Псевдоним = "Порядок";
		ВыбираемыеПоля.Добавить("Вакансии.ЭтапыРаботыСКандидатами.ЭтапРаботы");
		ВыбираемыеПоля.Добавить("Вакансии.ЭтапыРаботыСКандидатами.ШаблонАнкеты");
		ВыбираемыеПоля.Добавить("Вакансии.ЭтапыРаботыСКандидатами.Комментарий");
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДанныеВакансии = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
	Если ПараметрыПолучения.Согласование Тогда
		ДанныеВакансии.Вставить("Согласование", ДанныеСогласования(Вакансия));
	КонецЕсли;
	
	Если ПараметрыПолучения.ТекущееСостояние Тогда
		ДанныеВакансии.Вставить("ТекущееСостояние", СостояниеВакансии(Вакансия));
	КонецЕсли;
	
	Возврат ДанныеВакансии;
	
КонецФункции

// Регистрирует факт приостановки набора персонала для указанных вакансий
// 
// Параметры: 
// 	Вакансии - Массив Из СправочникСсылка.Вакансии
// 	ДатаПриостановки - Дата
Процедура ПриостановитьНабор(Вакансии, ДатаПриостановки) Экспорт
	УстановитьСостояние(Вакансии, ДатаПриостановки, Перечисления.СостоянияВакансии.Приостановлена);
КонецПроцедуры

// Регистрирует факт возобновления набора персонала для указанных вакансий
//
// Параметры:
//	Вакансии - Массив Из СправочникСсылка.Вакансии 
//	ДатаВозобновления - Дата
//
Процедура ВозобновитьНабор(Вакансии, ДатаВозобновления) Экспорт
	УстановитьСостояние(Вакансии, ДатаВозобновления, Перечисления.СостоянияВакансии.Открыта);
	ОбновитьДатуОткрытия(Вакансии, ДатаВозобновления);
КонецПроцедуры

// Отменяет набор по вакансиям
//
// Параметры:
//	Вакансии - Массив Из СправочникСсылка.Вакансии 
//	ДатаОтмены - Дата
//
Процедура ОтменитьНабор(Вакансии, ДатаОтмены) Экспорт
	УстановитьСостояние(Вакансии, ДатаОтмены, Перечисления.СостоянияВакансии.Отменена);
КонецПроцедуры

// Закрывает вакансию (кандидат подобран).
//
// Параметры:
//	Вакансии - Массив Из СправочникСсылка.Вакансии 
//	ДатаЗакрытия - Дата
//
Процедура ЗакрытьВакансии(Вакансии, ДатаЗакрытия) Экспорт
	УстановитьСостояние(Вакансии, ДатаЗакрытия, Перечисления.СостоянияВакансии.Закрыта);
КонецПроцедуры

// Массив вакансий, соответствующих указанному отбору.
//
// Параметры:
// 	Отбор - Структура, где ключ имя поля (реквизита справочника).
//
// Возвращаемое значение: 
// 	Массив Из СправочникСсылка.Вакансии.
//
Функция ВакансииПоОтбору(Отбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТВакансииПоОтбору(Запрос.МенеджерВременныхТаблиц, Отбор);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Вакансии.Вакансия
		|ИЗ
		|	ВТВакансииПоОтбору КАК Вакансии";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Вакансия");
	
КонецФункции

// Формирует временную таблицу с вакансиями, соответствующими отбору.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц, Неопределено - Описание
// 	Отбор - Структура - значения отбора,
// 	ТолькоРазрешенные - Булево - Описание, если Истина, в таблицу будут включены вакансии, доступные текущему пользователю.
//
Процедура СоздатьВТВакансииПоОтбору(МенеджерВременныхТаблиц, Отбор, ТолькоРазрешенные = Истина) Экспорт
	
	СтруктураОтбора = Новый Структура;
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		СтруктураОтбора = Отбор;
	ИначеЕсли ТипЗнч(Отбор) = Тип("КоллекцияЭлементовОтбораКомпоновкиДанных") Тогда
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если Не ЭлементОтбора.Использование Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЭлементОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли, 
					НСтр("ru = 'Поддерживаются только группы ИЛИ'"), "Справочник.Вакансии.СоздатьВТВакансииПоОтбору");
				ЭлементыГруппыИЛИ = Новый Структура;
				Для Каждого ЭлементГруппы Из ЭлементОтбора.Элементы Цикл
					Если Не ЭлементГруппы.Использование Тогда
						Продолжить;
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.Проверить(
						ЭлементГруппы.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно, 
						НСтр("ru = 'Внутри группы поддерживается только Вид сравнения - Равно'"), 
						"Справочник.Вакансии.СоздатьВТВакансииПоОтбору");
					ЭлементыГруппыИЛИ.Вставить(ЭлементГруппы.ЛевоеЗначение, ЭлементГруппы.ПравоеЗначение);
				КонецЦикла;
				СтруктураОтбора.Вставить("ГруппаИЛИ_" + ЗарплатаКадрыРасширенныйКлиентСервер.УникальноеИмяРеквизита(), ЭлементыГруппыИЛИ);
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
				Или ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке Тогда
				СтруктураОтбора.Вставить(ЭлементОтбора.ЛевоеЗначение, ЭлементОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			"Справочник.Вакансии.СоздатьВТВакансииПоОтбору", 
			"Отбор", 
			Отбор, 
			ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
				Тип("Структура"), Тип("КоллекцияЭлементовОтбораКомпоновкиДанных")));
	КонецЕсли;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Вакансии.Ссылка КАК Вакансия
		|ПОМЕСТИТЬ ВТВакансииПоОтбору
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		{ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущееСостояние
		|		ПО ТекущееСостояние.Вакансия = Вакансии.Ссылка
		|		И ТекущееСостояние.Состояние В (&Состояние)}
		|ГДЕ
		|	&УСЛОВИЕ";
	
	Если Не ТолькоРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
	КонецЕсли;
	
	ИспользоватьОтборПоСостоянию = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Условие = "";
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("Структура") Тогда
			УсловиеИЛИ = "";
			Для Каждого КлючИЗначениеГруппы Из КлючИЗначение.Значение Цикл
				Запрос.УстановитьПараметр(КлючИЗначениеГруппы.Ключ, КлючИЗначениеГруппы.Значение);
				ДобавитьФрагментУсловия(УсловиеИЛИ, ФрагментУсловия(КлючИЗначениеГруппы), "ИЛИ");
			КонецЦикла;
			ДобавитьФрагментУсловия(Условие, УсловиеИЛИ);
			Продолжить;
		КонецЕсли;
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Если КлючИЗначение.Ключ = "Состояние" Тогда
			ИспользоватьОтборПоСостоянию = Истина;
			Продолжить;
		КонецЕсли;
		ДобавитьФрагментУсловия(Условие, ФрагментУсловия(КлючИЗначение));
	КонецЦикла;
	
	Если Отбор.Количество() = 0 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГДЕ", "");
	КонецЕсли;

	Если Не ИспользоватьОтборПоСостоянию Тогда
		НачалоФрагмента = СтрНайти(ТекстЗапроса, "{");
		КонецФрагмента = СтрНайти(ТекстЗапроса, "}", , НачалоФрагмента);
		Фрагменты = Новый Массив;
		Фрагменты.Добавить(Лев(ТекстЗапроса, НачалоФрагмента - 1));
		Фрагменты.Добавить(Сред(ТекстЗапроса, КонецФрагмента + 1, СтрДлина(ТекстЗапроса) - КонецФрагмента));
		ТекстЗапроса = СтрСоединить(Фрагменты);
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УСЛОВИЕ", Условие);
	
	Запрос.Текст = ТекстЗапроса;
	Если Не ТолькоРазрешенные Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ОбновитьОписаниеВакансийПоПрофилюДолжности(ПрофильДолжности, ДанныеПрофиля) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Вакансии");
	ЭлементБлокировки.УстановитьЗначение("ПрофильДолжности", ПрофильДолжности);
	ЭлементБлокировки.УстановитьЗначение("СоответствуетПрофилюДолжности", Истина);
	
	ОтборВакансий = Новый Структура(
		"ПрофильДолжности,
		|СоответствуетПрофилюДолжности,
		|Состояние");
	ОтборВакансий.ПрофильДолжности = ПрофильДолжности;
	ОтборВакансий.СоответствуетПрофилюДолжности = Истина;
	ОтборВакансий.Состояние = Перечисления.СостоянияВакансии.Действующие();

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ВакансииПоОтбору = ВакансииПоОтбору(ОтборВакансий);
		Для Каждого Вакансия Из ВакансииПоОтбору Цикл
			ВакансияОбъект = Вакансия.ПолучитьОбъект();
			Если ОписаниеВакансииСоответствуетПрофилю(ВакансияОбъект, ДанныеПрофиля) Тогда
				Продолжить;
			КонецЕсли;
			ВакансияОбъект.ЗаполнитьПоПрофилюДолжности(ПрофильДолжности, Ложь, ДанныеПрофиля);
			ЗаписатьОбъектВакансии(ВакансияОбъект);
			ВакансияОбъект.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Функция ОписаниеВакансииДляПубликации(Поля = Неопределено) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("Справочники.Вакансии.ОписаниеВакансииДляПубликации", "Поля", Поля, 
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(Тип("Массив"), Тип("Неопределено")));
	
	Если Поля = Неопределено Тогда
		Поля = ОбщегоНазначения.ВыгрузитьКолонку(ПоляВакансии(), "Значение");
	КонецЕсли;
	
	Описание = Новый Структура();
	Для Каждого Поле Из Поля Цикл
		Описание.Вставить(Поле.Имя, Поле.Тип.ПривестиЗначение());
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

Функция СоответствиеИмениИСинонимаРеквизитовВакансий() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Для Каждого МетаданныеРеквизита Из Метаданные.Справочники.Вакансии.Реквизиты Цикл
		Соответствие.Вставить(МетаданныеРеквизита.Имя, МетаданныеРеквизита.Синоним);
	КонецЦикла;
	
	Для Каждого МетаданныеРеквизита Из Метаданные.Справочники.Вакансии.СтандартныеРеквизиты Цикл
		Синоним = МетаданныеРеквизита.Синоним;
		Если ПустаяСтрока(Синоним) Тогда
			Синоним = МетаданныеРеквизита.Имя;
		КонецЕсли;
		Соответствие.Вставить(МетаданныеРеквизита.Имя, Синоним);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Предназначен для частичной модификации вакансии.
// 
// Параметры:
// 	ВакансияСсылка - СправочникСсылка.Вакансии - ссылка на обновляемую вакансию
// 	ОбновляемыеПоля - Структура - сформирована методом ОписаниеВакансииДляПубликации, 
// 		в который предварительно могут быть переданы поля на выбор, полученные методом ПоляВакансии.
//
// Пример:
// 
//	Поля = Новый Массив();
//	Поля.Добавить(Справочники.Вакансии.ПоляВакансии().Наименование);
//	Поля.Добавить(Справочники.Вакансии.ПоляВакансии().Требования);
//	Поля.Добавить(Справочники.Вакансии.ПоляВакансии().Обязанности);
//	
//	ОбновляемыеПоля = Справочники.Вакансии.ОписаниеВакансииДляПубликации(Поля);
//	ОбновляемыеПоля.Наименование = НСтр("ru = 'Новое название вакансии'");
//	ОбновляемыеПоля.Требования = НСтр("ru = 'Новые требования'");
//	ОбновляемыеПоля.Обязанности = НСтр("ru = 'Новые обязанности'");
//
//	Справочники.Вакансии.ОбновитьВакансию(ВакансияСсылка, ОбновляемыеПоля);
//
Процедура ОбновитьВакансию(ВакансияСсылка, ОбновляемыеПоля) Экспорт

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"Справочники.Вакансии.ОбновитьВакансию", "ОбновляемыеПоля", ОбновляемыеПоля, Тип("Структура"));

	Если ОбновляемыеПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Вакансии");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", ВакансияСсылка);

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ВакансияОбъект = ВакансияСсылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВакансияОбъект, ОбновляемыеПоля);
		ЗаписатьОбъектВакансии(ВакансияОбъект);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает организацию вакансии.
// 
// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  СправочникСсылка.Организации, Неопределено -
Функция ОрганизацияВакансии(Вакансия) Экспорт
	
	Если Не ЗначениеЗаполнено(Вакансия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеВакансии = ДанныеВакансии(Вакансия);
	
	Если Не ЗначениеЗаполнено(ДанныеВакансии.Позиция) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ДанныеВакансии.Позиция);
	
	Возврат ДанныеПозиции.Организация;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОбъектВакансии(ВакансияОбъект)

	ОбщегоНазначенияКлиентСервер.Проверить(ТранзакцияАктивна(), 
		НСтр("ru = 'Перед вызовом метода не открыта транзакция'"), "Справочники.Вакансии.ЗаписатьОбъектВакансии");
	
	Попытка
		ВакансияОбъект.Заблокировать();
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Требуется внести изменение в описание вакансии «%1». 
			|В данный момент изменение невозможно, так как вакансия редактируется другим пользователем или в другой форме программы.'"),
			ВакансияОбъект.Наименование);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	ВакансияОбъект.Записать();
	
КонецПроцедуры

Функция ПоляВакансии() Экспорт
	
	СтандартныеРеквизиты = Метаданные.Справочники.Вакансии.СтандартныеРеквизиты;
	Реквизиты = Метаданные.Справочники.Вакансии.Реквизиты;
	
	Поля = Новый Структура();
	Поля.Вставить("Наименование", СтандартныеРеквизиты.Наименование);
	Поля.Вставить("СпособНабора", Реквизиты.СпособНабора);
	Поля.Вставить("НоваяПозиция", Реквизиты.НоваяПозиция);
	Поля.Вставить("Позиция", Реквизиты.Позиция);
	Поля.Вставить("Должность", Реквизиты.Должность);
	Поля.Вставить("Подразделение", Реквизиты.Подразделение);
	Поля.Вставить("ПрофильДолжности", Реквизиты.ПрофильДолжности);
	Поля.Вставить("ПредполагаемыйДоход", Реквизиты.ПредполагаемыйДоход);
	Поля.Вставить("Ответственный", Реквизиты.Ответственный);
	Поля.Вставить("Заявитель", Реквизиты.Заявитель);
	Поля.Вставить("ДатаОткрытия", Реквизиты.ДатаОткрытия);
	Поля.Вставить("ПланируемаяДатаЗакрытия", Реквизиты.ПланируемаяДатаЗакрытия);
	Поля.Вставить("Обязанности", Реквизиты.Обязанности);
	Поля.Вставить("Требования", Реквизиты.Требования);
	Поля.Вставить("Условия", Реквизиты.Условия);
	Поля.Вставить("ПричинаОткрытия", Реквизиты.ПричинаОткрытия);
	Возврат Поля;
	
КонецФункции

// Предоставляет данные вакансий
// 
// Параметры:
//  Вакансии - Массив Из СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные вакансий
Функция ДанныеВакансий(Вакансии) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Вакансии.Ссылка КАК Вакансия,
		|	Вакансии.ВерсияДанных КАК ВерсияДанных,
		|	Вакансии.ПометкаУдаления КАК ПометкаУдаления,
		|	Вакансии.Код КАК Код,
		|	Вакансии.Наименование КАК Наименование,
		|	Вакансии.Позиция КАК Позиция,
		|	Вакансии.Подразделение КАК Подразделение,
		|	Вакансии.ПрофильДолжности КАК ПрофильДолжности,
		|	Вакансии.ПредполагаемыйДоход КАК ПредполагаемыйДоход,
		|	Вакансии.Ответственный КАК Ответственный,
		|	Вакансии.Заявитель КАК Заявитель,
		|	Вакансии.ДатаОткрытия КАК ДатаОткрытия,
		|	Вакансии.ПланируемаяДатаЗакрытия КАК ПланируемаяДатаЗакрытия,
		|	Вакансии.Основание КАК Основание,
		|	Вакансии.Примечание КАК Примечание,
		|	Вакансии.СоответствуетПрофилюДолжности КАК СоответствуетПрофилюДолжности,
		|	Вакансии.Требования КАК Требования,
		|	Вакансии.Обязанности КАК Обязанности,
		|	Вакансии.Условия КАК Условия,
		|	Вакансии.Сложность КАК Сложность,
		|	Вакансии.Приоритет КАК Приоритет,
		|	Вакансии.ПричинаОткрытия КАК ПричинаОткрытия,
		|	Вакансии.УточнениеНаименования КАК УточнениеНаименования,
		|	Вакансии.Должность КАК Должность,
		|	Вакансии.СпособНабора КАК СпособНабора,
		|	Вакансии.НазначениеНабора КАК НазначениеНабора,
		|	Вакансии.НоваяПозиция КАК НоваяПозиция,
		|	Вакансии.НаименованиеВручную КАК НаименованиеВручную,
		|	СостоянияВакансийСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних(, Вакансия В (&Вакансии)) КАК
		|			СостоянияВакансийСрезПоследних
		|		ПО СостоянияВакансийСрезПоследних.Вакансия = Вакансии.Ссылка
		|ГДЕ
		|	Вакансии.Ссылка В (&Вакансии)";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Получает данные согласования вакансии.
// 
// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  см. СогласованиеВакансий.ДанныеСогласования
Функция ДанныеСогласования(Вакансия) Экспорт
	
	Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "Основание");
	
	Если ЗначениеЗаполнено(Основание) Тогда
		Возврат СогласованиеВакансий.ДанныеСогласования(Основание);
	КонецЕсли;
	
	Возврат СогласованиеВакансий.ДанныеСогласования(Вакансия);
	
КонецФункции

Функция СостояниеВакансии(Вакансия) Экспорт
	Возврат РегистрыСведений.СостоянияВакансий.ТекущееСостояниеВакансий(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вакансия))[Вакансия];
КонецФункции

Функция ЕстьДругиеВакансииПоКомбинацииДолжностьПодразделение(Должность, Подразделение, Заявка = Неопределено, Вакансия = Неопределено) Экспорт 
	
	Если Не ЗначениеЗаполнено(Должность) Или Не ЗначениеЗаполнено(Подразделение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Основание", Заявка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущиеСостоянияВакансий
		|		ПО (ТекущиеСостоянияВакансий.Вакансия = Вакансии.Ссылка)
		|ГДЕ
		|	Вакансии.СпособНабора = ЗНАЧЕНИЕ(Перечисление.СпособНабораПерсоналаНаВакансию.МассовыйНабор)
		|	И НЕ ТекущиеСостоянияВакансий.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Закрыта), ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Отменена))
		|	И Вакансии.Должность = &Должность
		|	И Вакансии.Подразделение = &Подразделение
		|	И Вакансии.Ссылка <> &Вакансия
		|	И Вакансии.Основание <> &Основание";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ВыполнитьЗаписьОбъекта(ДанныеОбъекта, ДанныеФормы) Экспорт
	
	СправочникОбъект = ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта);
	ДесериализоватьДанныеФормы(ДанныеФормы, СправочникОбъект);
	
	НачатьТранзакцию();
	Попытка
		СправочникОбъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Подбор персонала.Запись вакансии'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	
КонецФункции

Функция СериализоватьДанныеФормы(Форма) Экспорт
	
	Данные = Новый Структура();

	НаборЗаписей = ДанныеФормыВЗначение(
		Форма["СостоянияВакансийНаборЗаписей"], Тип("РегистрСведенийНаборЗаписей.СостоянияВакансий"));
	Данные.Вставить("СостоянияВакансийНаборЗаписей", ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(НаборЗаписей));
	
	Возврат Данные;
	
КонецФункции

Процедура ДесериализоватьДанныеФормы(ДанныеФормы, СправочникОбъект)
	
	СправочникОбъект.ДополнительныеСвойства.Вставить("СостоянияВакансийНаборЗаписей", 
		ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеФормы["СостоянияВакансийНаборЗаписей"]));
	
КонецПроцедуры

Функция ПечатьВакансии(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОписаниеВакансии";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	ДанныеПечати = ПодборПерсонала.ОписанияВакансийПоУмолчанию(МассивОбъектов);
	
	Для Каждого СтрокаДанных Из ДанныеПечати Цикл
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		Макет.Параметры.Заполнить(СтрокаДанных);
		
		ТабличныйДокумент.Вывести(Макет);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СтрокаДанных.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьВариантаВакансии(ИдентификаторОписания, МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = СтрШаблон("ПараметрыПечати_ОписаниеВакансии_%1", ИдентификаторОписания);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	Выборка = ПодборПерсонала.ВыборкаДанныхОписанияВакансии(ИдентификаторОписания, МассивОбъектов);
	
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		
		ДанныеПечати = Новый Структура();
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Пока Выборка.Следующий() Цикл
			ДанныеПечати.Вставить(Выборка.ПолеДанных, Выборка.Значение);
		КонецЦикла;
		
		Макет.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(Макет);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Вакансия);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура УстановитьСостояние(Вакансии, Дата, Состояние) Экспорт
	РегистрыСведений.СостоянияВакансий.УстановитьСостояние(Вакансии, Дата, Состояние);
КонецПроцедуры

Процедура ИзменитьДатуСостояния(Вакансия, Состояние, ПрежняяДата, НоваяДата) Экспорт
	РегистрыСведений.СостоянияВакансий.ИзменитьДатуСостояния(Вакансия, Состояние, ПрежняяДата, НоваяДата);
КонецПроцедуры

Процедура ОбновитьДатуОткрытия(Вакансии, ДатаВозобновления)
	
	Отбор = Новый Структура();
	Отбор.Вставить("ДатаОткрытия", ДатаВозобновления);
	Отбор.Вставить("Ссылка", Вакансии);
	
	ИсточникДляБлокировки = Новый ТаблицаЗначений;
	ИсточникДляБлокировки.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ИсточникДляБлокировки, Вакансии, "Вакансия");
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Вакансии");
	ЭлементБлокировки.ИсточникДанных = ИсточникДляБлокировки;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Вакансия");
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		ВакансииДатаСовпадает = ВакансииПоОтбору(Отбор);
		ВакансииДатаОтличается = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Вакансии, ВакансииДатаСовпадает);
		Для Каждого Вакансия Из ВакансииДатаОтличается Цикл
			ВакансияОбъект = Вакансия.ПолучитьОбъект();
			ВакансияОбъект.ДатаОткрытия = ДатаВозобновления;
			ВакансияОбъект.Записать();
		КонецЦикла;
	ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ДополнитьСоставКомандПечати(КомандыПечати)
	
	Выборка = ПодборПерсонала.ВыборкаСоставаОписанийВакансий(, Истина);
	
	Номер = 1;
	Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторОписания") Цикл
		
		Вакансии = Новый Массив;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Справочник.Вакансии";
		КомандаПечати.Идентификатор = Выборка.ИдентификаторОписания;
		КомандаПечати.Представление = Выборка.МестоПубликации;
		КомандаПечати.ЗаголовокФормы = КомандаПечати.Представление;
		КомандаПечати.Порядок = 10 * Номер;
		
		Пока Выборка.Следующий() Цикл
			Вакансии.Добавить(Выборка.Вакансия);
		КонецЦикла;
		
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Ссылка", Вакансии, ВидСравненияКомпоновкиДанных.ВСписке);
		
		Номер = Номер + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДополнительныеПечатныеФормы(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати)
	
	Выборка = ПодборПерсонала.ВыборкаСоставаОписанийВакансий(МассивОбъектов);
	
	Пока Выборка.Следующий() Цикл
		
		ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, Выборка.ИдентификаторОписания);
		Если ПечатнаяФорма <> Неопределено Тогда
			
			ПечатнаяФорма.СинонимМакета = Выборка.МестоПубликации;
			ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.Вакансии.ПФ_MXL_Вакансия";
			ПечатнаяФорма.ТабличныйДокумент = ПечатьВариантаВакансии(Выборка.ИдентификаторОписания, МассивОбъектов, ОбъектыПечати, ПечатнаяФорма.ПолныйПутьКМакету);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаИнформационныхСтрокЗанятостиПоВакансиям() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	Таблица.Колонки.Добавить("СпособНабора", Новый ОписаниеТипов("ПеречислениеСсылка.СпособНабораПерсоналаНаВакансию"));
	Таблица.Колонки.Добавить("НазначениеНабора", Новый ОписаниеТипов("ПеречислениеСсылка.НазначениеНабораПерсоналаНаВакансию"));
	Таблица.Колонки.Добавить("НоваяПозиция", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	Таблица.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Таблица.Колонки.Добавить("ПозицииВакансии", Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("КоличествоПозиций", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("КоличествоСтавок", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ЗанятоСтавок", Новый ОписаниеТипов("Число"));
	Таблица.Колонки.Добавить("ЗанятоСотрудниками", Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("ИнформационнаяСтрокаЗанятости", Новый ОписаниеТипов("ФорматированнаяСтрока"));
	Таблица.Колонки.Добавить("ИнформационнаяСтрокаКандидатов", Новый ОписаниеТипов("ФорматированнаяСтрока"));
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗаполнитьИнформационныеСтрокиЗанятостиПоВакансиям(ТаблицаИнформационныхСтрок) Экспорт
	
	ТаблицаИнформационныхСтрок.Сортировать("НоваяПозиция,НазначениеНабора,СпособНабора,Позиция,Должность,Подразделение");
	
	ЗаполнитьСведенияШтатногоРасписания(ТаблицаИнформационныхСтрок);
	
	ПозицииВакансий = НоваяТаблицаПозицииВакансий();
	ЗаполнитьТаблицуПозицииВакансий(ТаблицаИнформационныхСтрок, ПозицииВакансий);
	
	ТаблицаИнформационныхСтрок.Индексы.Добавить("Позиция");
	
	ЗаполнитьЗанятоСтавокПоПозициямВакансий(ТаблицаИнформационныхСтрок, ПозицииВакансий);
	ЗаполнитьЗанятыСотрудниками(ТаблицаИнформационныхСтрок, ПозицииВакансий);
	
	Для Каждого СтрокаТаблицы Из ТаблицаИнформационныхСтрок Цикл
		Если СтрокаТаблицы.НоваяПозиция Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьИнформационнуюСтрокуЗанятости(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Функция ИнформационнаяСтрокаЗанятостиПоДаннымВакансии(ДанныеВакансии) Экспорт

	ТаблицаИнформационныхСтрок = ТаблицаИнформационныхСтрокЗанятостиПоВакансиям();
	ЗаполнитьЗначенияСвойств(ТаблицаИнформационныхСтрок.Добавить(), ДанныеВакансии);
	ЗаполнитьИнформационныеСтрокиЗанятостиПоВакансиям(ТаблицаИнформационныхСтрок);

	Если ТаблицаИнформационныхСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаИнформационныхСтрок[0]);
	
КонецФункции

Функция ИнформационнаяСтрокаКандидатовПоВакансии(Вакансия, ТолькоКандидатыВРаботе) Экспорт

	ТаблицаИнформационныхСтрок = ТаблицаИнформационныхСтрокЗанятостиПоВакансиям();
	ЗаполнитьЗначенияСвойств(ТаблицаИнформационныхСтрок.Добавить(), ДанныеВакансии(Вакансия));
	ЗаполнитьСтатистикуСостоянийКандидатов(ТаблицаИнформационныхСтрок, ТолькоКандидатыВРаботе);
	
	Если ТаблицаИнформационныхСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаИнформационныхСтрок[0]);
	
КонецФункции

Процедура ЗаполнитьСведенияШтатногоРасписанияПоПозициям(ДанныеВакансий)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	// Получаем данные по вакансиям, у которых набор на позицию.
	ОтборСтрок = Новый Структура("НазначениеНабора, НоваяПозиция");
	ОтборСтрок.НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ПозицияШтатногоРасписания;
	ОтборСтрок.НоваяПозиция = Ложь;
	НайденныеСтроки = ДанныеВакансий.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(ТекущаяДатаСеанса());
	
	Позиции = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "Позиция");
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "ПозицияШтатногоРасписания", "В", Позиции);
	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		МенеджерВТ, Истина, ПараметрыПостроения, "КоличествоСтавок", "ВТШтатноеРасписаниеПоПозициям");
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтатноеРасписание.ПозицияШтатногоРасписания КАК Позиция,
		|	СУММА(ШтатноеРасписание.КоличествоСтавок) КАК КоличествоСтавок
		|ИЗ
		|	ВТШтатноеРасписаниеПоПозициям КАК ШтатноеРасписание
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтатноеРасписание.ПозицияШтатногоРасписания
		|
		|ИМЕЮЩИЕ
		|	СУММА(ШтатноеРасписание.КоличествоСтавок) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиция";
	ДанныеСтавок = Запрос.Выполнить().Выгрузить();
	Если ДанныеСтавок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтавок.Индексы.Добавить("Позиция");
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ОтборСтрок = Новый Структура("Позиция");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, НайденнаяСтрока);
		ДанныеСтавокПоПозиции = ДанныеСтавок.НайтиСтроки(ОтборСтрок);
		НайденнаяСтрока.КоличествоСтавок = 0;
		НайденнаяСтрока.КоличествоПозиций = 1;
		Для Каждого СтрокаПозиции Из ДанныеСтавокПоПозиции Цикл
			НайденнаяСтрока.КоличествоСтавок = НайденнаяСтрока.КоличествоСтавок + СтрокаПозиции.КоличествоСтавок;
			НайденнаяСтрока.ПозицииВакансии.Добавить(СтрокаПозиции.Позиция);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСтатистикуСостоянийКандидатов(ДанныеВакансий, ТолькоКандидатыВРаботе = Истина) Экспорт
	
	Если ДанныеВакансий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Вакансии", ДанныеВакансий.ВыгрузитьКолонку("Вакансия"));
	Запрос.УстановитьПараметр("Отклонено", Перечисления.СостоянияСогласования.Отклонено);
	Запрос.УстановитьПараметр("ПустойЭтап", Справочники.ЭтапыРаботыСКандидатами.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПоследнийЭтап", Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена);
	Запрос.УстановитьПараметр("РассмотрениеОтклика", Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика);
	Запрос.УстановитьПараметр("МинимальноеЗначение", -1);
	Запрос.УстановитьПараметр("МаксимальноеЗначение", 99999);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЭтапыКандидатов.Вакансия КАК Вакансия,
		|	ЭтапыКандидатов.ЭтапРаботы КАК ЭтапРаботы,
		|	ЭтапыКандидатов.НомерЭтапа КАК НомерЭтапа,
		|	КОЛИЧЕСТВО(ЭтапыКандидатов.Кандидат) КАК КоличествоКандидатов
		|ИЗ
		|	(ВЫБРАТЬ
		|		Кандидаты.Ссылка КАК Кандидат,
		|		Вакансии.Ссылка КАК Вакансия,
		|		ЕСТЬNULL(ЭтапыКандидатов.ЭтапРаботы, &ПустойЭтап) КАК ЭтапРаботы,
		|		ЕСТЬNULL(ЭтапыВакансии.НомерСтроки, ВЫБОР
		|				КОГДА ЭтапыКандидатов.ЭтапРаботы = &ПоследнийЭтап
		|					ТОГДА &МаксимальноеЗначение
		|				ИНАЧЕ &МинимальноеЗначение
		|			КОНЕЦ) КАК НомерЭтапа
		|	ИЗ
		|		Справочник.Кандидаты КАК Кандидаты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии КАК Вакансии
		|			ПО (Вакансии.Ссылка = Кандидаты.Вакансия)
		|				И (Кандидаты.Вакансия В (&Вакансии))
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ЭтапыКандидатов
		|			ПО Кандидаты.Ссылка = ЭтапыКандидатов.Кандидат
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|			ПО (ЭтапыВакансии.Ссылка = Вакансии.Ссылка)
		|				И (ЭтапыВакансии.ЭтапРаботы = ЭтапыКандидатов.ЭтапРаботы)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СубъектыДляСкрытияПерсональныхДанных КАК СубъектыСоСкрытымиПДн
		|			ПО Кандидаты.ЛичныеДанные = СубъектыСоСкрытымиПДн.Субъект
		|				И (СубъектыСоСкрытымиПДн.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСубъектовДляСкрытия.СкрытиеВыполнено))
		|	ГДЕ
		|		&ТолькоКандидатыВРаботе
		|		И СубъектыСоСкрытымиПДн.Субъект ЕСТЬ NULL) КАК ЭтапыКандидатов
		|
		|СГРУППИРОВАТЬ ПО
		|	ЭтапыКандидатов.Вакансия,
		|	ЭтапыКандидатов.ЭтапРаботы,
		|	ЭтапыКандидатов.НомерЭтапа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтапыКандидатов.Вакансия,
		|	ЭтапыКандидатов.НомерЭтапа УБЫВ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоКандидатыВРаботе", 
		?(ТолькоКандидатыВРаботе, 
		"Кандидаты.Состояние <> &Отклонено
		|		И НЕ ЭтапыКандидатов.ЭтапРаботы В (&РассмотрениеОтклика, &ПоследнийЭтап)", 
		"ИСТИНА"));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеВакансий, "Вакансия");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		ЧастиНадписи = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Если ЧастиНадписи.Количество() > 0 Тогда
				ЧастиНадписи.Добавить(", ");
			КонецЕсли;
			ТекстСостояния = ?(Не ЗначениеЗаполнено(Выборка.ЭтапРаботы), 
				НСтр("ru = '<Этап не указан>'"), Строка(Выборка.ЭтапРаботы)) + " " + Выборка.КоличествоКандидатов;
			НавигационнаяСтрока = СтрокаНавигационнойСсылкиЭтапаКандидатов(Выборка.ЭтапРаботы);
			ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстСостояния, , , , НавигационнаяСтрока));
		КонецЦикла;
		ИнформационнаяСтрока = Новый ФорматированнаяСтрока(ЧастиНадписи);
		Для Каждого НайденнаяСтрока Из ДанныеВакансий.НайтиСтроки(Новый Структура("Вакансия", Выборка.Вакансия)) Цикл
			НайденнаяСтрока.ИнформационнаяСтрокаКандидатов = ИнформационнаяСтрока;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияШтатногоРасписанияПоДолжностиПодразделению(ДанныеВакансий)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// Получаем данные по вакансиям, у которых массовый набор, и они на должность в подразделение.
	ОтборСтрок = Новый Структура("НазначениеНабора, СпособНабора");
	ОтборСтрок.НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение;
	ОтборСтрок.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор;
	НайденныеСтроки = ДанныеВакансий.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(ТекущаяДатаСеанса());
	
	Должности = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "Должность");
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Должность", "В", Должности);
	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		МенеджерВТ, Истина, ПараметрыПостроения, "КоличествоСтавок", "ВТШтатноеРасписаниеПоДолжностям");
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
		"ВТШтатноеРасписаниеПоДолжностям", "Позиция");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Позиция", "ПозицияШтатногоРасписания");

	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();

	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", МенеджерВТ, Истина, ОписаниеФильтра,
		ПараметрыПостроения, "ВТМестоПозицииВСтруктуреПредприятия");
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтатноеРасписание.Должность КАК Должность,
		|	ШтатноеРасписание.Подразделение КАК Подразделение,
		|	ШтатноеРасписание.Позиция КАК Позиция,
		|	СУММА(ШтатноеРасписание.КоличествоСтавок) КАК КоличествоСтавок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ШтатноеРасписание.Должность КАК Должность,
		|		ШтатноеРасписание.ПозицияШтатногоРасписания КАК Позиция,
		|		ВышестоящиеПодразделения.ВышестоящаяСтруктурнаяЕдиница КАК Подразделение,
		|		ШтатноеРасписание.КоличествоСтавок КАК КоличествоСтавок
		|	ИЗ
		|		ВТШтатноеРасписаниеПоДолжностям КАК ШтатноеРасписание
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииВСтруктуреПредприятия КАК МестоПозиции
		|			ПО (МестоПозиции.Позиция = ШтатноеРасписание.ПозицияШтатногоРасписания)
		|			И (МестоПозиции.Период = ШтатноеРасписание.Период)
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодчиненностьСтруктурныхЕдиниц КАК ВышестоящиеПодразделения
		|			ПО (ВышестоящиеПодразделения.СтруктурнаяЕдиница = МестоПозиции.Подразделение)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ШтатноеРасписание.Должность,
		|		ШтатноеРасписание.ПозицияШтатногоРасписания,
		|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
		|		ШтатноеРасписание.КоличествоСтавок
		|	ИЗ
		|		ВТШтатноеРасписаниеПоДолжностям КАК ШтатноеРасписание) КАК ШтатноеРасписание
		|
		|СГРУППИРОВАТЬ ПО
		|	ШтатноеРасписание.Должность,
		|	ШтатноеРасписание.Подразделение,
		|	ШтатноеРасписание.Позиция
		|
		|ИМЕЮЩИЕ
		|	СУММА(ШтатноеРасписание.КоличествоСтавок) <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ШтатноеРасписание.Должность,
		|	ШтатноеРасписание.Подразделение,
		|	ШтатноеРасписание.Позиция";
	ДанныеСтавок = Запрос.Выполнить().Выгрузить();
	Если ДанныеСтавок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтавок.Индексы.Добавить("Должность,Подразделение");
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ОтборСтрок = Новый Структура("Должность, Подразделение");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, НайденнаяСтрока);
		ДанныеСтавокПоДолжностиПодразделению = ДанныеСтавок.НайтиСтроки(ОтборСтрок);
		НайденнаяСтрока.КоличествоПозиций = 0;
		НайденнаяСтрока.КоличествоСтавок = 0;
		Для Каждого СтрокаПозиции Из ДанныеСтавокПоДолжностиПодразделению Цикл
			НайденнаяСтрока.КоличествоПозиций = НайденнаяСтрока.КоличествоПозиций + 1;
			НайденнаяСтрока.КоличествоСтавок = НайденнаяСтрока.КоличествоСтавок + СтрокаПозиции.КоличествоСтавок;
			НайденнаяСтрока.ПозицииВакансии.Добавить(СтрокаПозиции.Позиция);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияШтатногоРасписания(ДанныеВакансий)
	
	ЗаполнитьСведенияШтатногоРасписанияПоПозициям(ДанныеВакансий);
	ЗаполнитьСведенияШтатногоРасписанияПоДолжностиПодразделению(ДанныеВакансий);
	
КонецПроцедуры

Функция НоваяТаблицаПозицииВакансий()
	
	ПозицииВакансий = Новый ТаблицаЗначений;
	ПозицииВакансий.Колонки.Добавить("Вакансия", Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
	ПозицииВакансий.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ПозицииВакансий.Колонки.Добавить("СпособНабора", Новый ОписаниеТипов("ПеречислениеСсылка.СпособНабораПерсоналаНаВакансию"));
	ПозицииВакансий.Колонки.Добавить("НоваяПозиция", Новый ОписаниеТипов("Булево"));
	
	Возврат ПозицииВакансий;
	
КонецФункции

Процедура ЗаполнитьТаблицуПозицииВакансий(ДанныеВакансий, ПозицииВакансий)
	
	ОтборСтрок = Новый Структура("НазначениеНабора, СпособНабора");
	ОтборСтрок.НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение;
	ОтборСтрок.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор;
	НайденныеСтроки = ДанныеВакансий.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		Для Каждого Позиция Из СтрокаДанных.ПозицииВакансии Цикл
			НоваяСтрока = ПозицииВакансий.Добавить();
			НоваяСтрока.Вакансия = СтрокаДанных.Вакансия;
			НоваяСтрока.Позиция = Позиция;
			НоваяСтрока.СпособНабора = СтрокаДанных.СпособНабора;
		КонецЦикла;
	КонецЦикла;
	
	ОтборСтрок = Новый Структура("НазначениеНабора, НоваяПозиция");
	ОтборСтрок.НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ПозицияШтатногоРасписания;
	ОтборСтрок.НоваяПозиция = Ложь;
	НайденныеСтроки = ДанныеВакансий.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		НоваяСтрока = ПозицииВакансий.Добавить();
		НоваяСтрока.Вакансия = СтрокаДанных.Вакансия;
		НоваяСтрока.Позиция = СтрокаДанных.Позиция;
		НоваяСтрока.СпособНабора = СтрокаДанных.СпособНабора;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗанятоСтавокПоПозициямВакансий(ДанныеВакансий, ПозицииВакансий)
	
	ПозицииМассив = ПозицииВакансий.ВыгрузитьКолонку("Позиция");
	
	Если ПозицииМассив.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗанятоСтавокПоПозициям = УправлениеШтатнымРасписанием.ЗанятостьПозицийШтатногоРасписания(ПозицииМассив, ТекущаяДатаСеанса());
	
	Если ЗанятоСтавокПоПозициям.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗанятоСтавокПоПозициям.Индексы.Добавить("ПозицияШтатногоРасписания");
	
	ОтборСтрок = Новый Структура("ПозицияШтатногоРасписания");
	Для Каждого СтрокаВакансии Из ДанныеВакансий Цикл
		СтрокаВакансии.ЗанятоСтавок = 0;
		Для Каждого Позиция Из СтрокаВакансии.ПозицииВакансии Цикл
			ОтборСтрок.ПозицияШтатногоРасписания = Позиция;
			НайденныеСтроки = ЗанятоСтавокПоПозициям.НайтиСтроки(ОтборСтрок);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				СтрокаВакансии.ЗанятоСтавок = СтрокаВакансии.ЗанятоСтавок + НайденнаяСтрока.КоличествоСтавок;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗанятыСотрудниками(ДанныеВакансий, ПозицииВакансий)
	
	ОтборСтрок = Новый Структура("СпособНабора, НоваяПозиция");
	ОтборСтрок.СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.ЕдиничныйНабор;
	ОтборСтрок.НоваяПозиция = Ложь;
	
	ПозицииЕдиничногоНабора = ПозицииВакансий.Скопировать(ОтборСтрок, "Вакансия, Позиция");
	Если ПозицииЕдиничногоНабора.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоСпискуСотрудников();
	ПараметрыЗапроса.НачалоПериода = ТекущаяДатаСеанса();
	ПараметрыЗапроса.ОкончаниеПериода = ТекущаяДатаСеанса();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
		ПараметрыЗапроса.Отборы, "ДолжностьПоШтатномуРасписанию", "В", ПозицииЕдиничногоНабора.ВыгрузитьКолонку("Позиция"));
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьВТРабочиеМестаСотрудников(МенеджерВТ, Истина, ПараметрыЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РабочиеМеста.Сотрудник КАК Сотрудник,
		|	РабочиеМеста.ДолжностьПоШтатномуРасписанию КАК Позиция
		|ИЗ
		|	ВТРабочиеМестаСотрудников КАК РабочиеМеста
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиция";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Позиция") Цикл
		ОтборСтрок = Новый Структура("Позиция");
		ОтборСтрок.Позиция = Выборка.Позиция;
		НайденныеСтроки = ДанныеВакансий.НайтиСтроки(ОтборСтрок);
		Пока Выборка.Следующий() Цикл
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.ЗанятоСотрудниками.Добавить(Выборка.Сотрудник);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИнформационнуюСтрокуЗанятости(СтрокаТаблицы)
		
	ВакантноСтавок = СтрокаТаблицы.КоличествоСтавок - СтрокаТаблицы.ЗанятоСтавок;
	
	ЧастиНадписи = Новый Массив;
	
	ТекстВакантноСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';Вакантна %1 ставка;;Вакантно %1 ставки;Вакантно %1 ставок;Вакантно %1 ставки'"), 
		ВакантноСтавок);
	ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстВакантноСтавок, Новый Шрифт(, , Истина)));
	
	Если СтрокаТаблицы.НазначениеНабора <> Перечисления.НазначениеНабораПерсоналаНаВакансию.ПозицияШтатногоРасписания Тогда
		ТекстПозиций = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';по %1 позиции;;по %1 позициям;по %1 позициям;по %1 позициям'"), 
			СтрокаТаблицы.КоличествоПозиций);
		ЧастиНадписи.Добавить(" ");	
		ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстПозиций, Новый Шрифт(, , Истина), , , "ПозицииВакансии"));
	КонецЕсли;
	
	ТекстКоличествоСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';запланирована %1 ставка;;запланировано %1 ставки;запланировано %1 ставок;запланировано %1 ставки'"), 
		СтрокаТаблицы.КоличествоСтавок);
	ЧастиНадписи.Добавить(" (");	
	ЧастиНадписи.Добавить(ТекстКоличествоСтавок);
	
	ТекстЗанятоСтавок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru = ';занята %1 ставка;;занято %1 ставки;занято %1 ставок;занято %1 ставки'"), 
		СтрокаТаблицы.ЗанятоСтавок);
	ЧастиНадписи.Добавить(", ");	
	ЧастиНадписи.Добавить(ТекстЗанятоСтавок);
	
	Сотрудников = СтрокаТаблицы.ЗанятоСотрудниками.Количество();
	Если Сотрудников > 0 Тогда
		ЧастиНадписи.Добавить(" ");
		ЧастиНадписи.Добавить(СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';сотрудником;;сотрудниками;сотрудниками;сотрудниками'"), 
			Сотрудников));
		ЧастиНадписи.Добавить(" ");
		СотрудниковВключено = 0;
		Для Каждого Сотрудник Из СтрокаТаблицы.ЗанятоСотрудниками Цикл
			Если СотрудниковВключено = 3 Тогда
				Прервать;
			КонецЕсли;
			ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(Строка(Сотрудник));
			Если СотрудниковВключено > 0 Тогда
				ЧастиНадписи.Добавить(", ");
			КонецЕсли;
			ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ФамилияИнициалы, , , , ПолучитьНавигационнуюСсылку(Сотрудник)));
			СотрудниковВключено = СотрудниковВключено + 1;
		КонецЦикла;
		ЕщеОсталось = Сотрудников - СотрудниковВключено;
		Если ЕщеОсталось > 0 Тогда
			ЧастиНадписи.Добавить(" ");
			ЧастиНадписи.Добавить(НСтр("ru = 'и'"));
			ЧастиНадписи.Добавить(" ");
			ТекстЕщеСотрудники = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'еще %1'"), 
				ЕщеОсталось);
			ЧастиНадписи.Добавить(Новый ФорматированнаяСтрока(ТекстЕщеСотрудники, , , , "СотрудникиПозиции"));
		КонецЕсли;
	КонецЕсли;
	
	ЧастиНадписи.Добавить(")");	
		
	СтрокаТаблицы.ИнформационнаяСтрокаЗанятости = Новый ФорматированнаяСтрока(ЧастиНадписи);
	
КонецПроцедуры

Функция СтрокаНавигационнойСсылкиЭтапаКандидатов(ЭтапРаботы)
	Возврат ПодборПерсоналаФормы.НавигациннаяСсылкаЭтапаКандидата(ЭтапРаботы);
КонецФункции

Процедура ЗаполнитьЗначенияРеквизитовШаблонаОтправкиОписания(Сообщение, ПредметСообщения, ДополнительныеПараметры)
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.ВладелецШаблона) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторОписания = "";
	Если Не Сообщение.ДополнительныеПараметры.Свойство("ИдентификаторОписания", ИдентификаторОписания) 
		Или ИдентификаторОписания = "Вакансия" Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = Сообщение.ЗначенияРеквизитов;
	Выборка = ПодборПерсонала.ВыборкаДанныхОписанияВакансии(ИдентификаторОписания, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПредметСообщения));
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПолеДанных = "КонтактноеЛицо" Тогда
			
			Ответственный = ЗначенияРеквизитов.Получить("Ответственный");
			Если ЗначениеЗаполнено(Ответственный) И ЗначениеЗаполнено(Ответственный.Получить("Наименование")) Тогда
				Ответственный.Вставить("Наименование", Выборка.Значение);
			КонецЕсли;
			
		ИначеЕсли Выборка.ПолеДанных = "Позиция" Тогда
			
			Позиция = ЗначенияРеквизитов.Получить("Позиция");
			Если ЗначениеЗаполнено(Позиция) И ЗначениеЗаполнено(Позиция.Получить("Наименование")) Тогда
				Позиция.Вставить("Наименование", Выборка.Значение);
			КонецЕсли;
			
		ИначеЕсли Выборка.ПолеДанных = "НаименованиеВакансии" Тогда
			
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.Получить("Наименование")) Тогда
				ЗначенияРеквизитов.Вставить("Наименование", Выборка.Значение);
			ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквизитов.Получить("УточнениеНаименования")) Тогда
				ЗначенияРеквизитов.Вставить("УточнениеНаименования", Выборка.Значение);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.Получить(Выборка.ПолеДанных)) Тогда
				ЗначенияРеквизитов.Вставить(Выборка.ПолеДанных, Выборка.Значение);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИсключитьВариантыОписанийИзВложений(Реквизиты, Вложения, ДополнительныеПараметры)
	
	ВариантыОписаний = ПодборПерсонала.ЗапросСоставаОписанийВакансий().Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторОписания");
	
	Индекс = 0;
	Пока Индекс < Вложения.Количество() Цикл
		Если ВариантыОписаний.Найти(Вложения[Индекс].Имя) <> Неопределено Тогда
			Вложения.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеВакансииСоответствуетПрофилю(ВакансияОбъект, ДанныеПрофиля = Неопределено) Экспорт

	Если ДанныеПрофиля = Неопределено Тогда
		ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(ВакансияОбъект.ПрофильДолжности);
	КонецЕсли;

	Если ВакансияОбъект.Требования <> ДанныеПрофиля.Требования Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВакансияОбъект.Обязанности <> ДанныеПрофиля.Обязанности Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВакансияОбъект.Условия <> ДанныеПрофиля.Условия Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВакансияОбъект.ИспытательныйСрок <> ДанныеПрофиля.ИспытательныйСрок Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИменаКолонок = "ЭтапРаботы,ШаблонАнкеты,СпособОценкиХарактеристик,Комментарий";
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ВакансияОбъект.ЭтапыРаботыСКандидатами, ДанныеПрофиля.ЭтапыРаботыСКандидатами, ИменаКолонок, , Истина) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Или ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов") Тогда
		ИменаКолонок = "Характеристика,Значение,Вес,ТребуетсяПроверка,ТребуетсяОбучение,ВесЗначения";
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ВакансияОбъект.ХарактеристикиПерсонала, ДанныеПрофиля.ХарактеристикиПерсонала, ИменаКолонок) Тогда
			Возврат Ложь;
		КонецЕсли;
		ИменаКолонок = "ДействиеСотрудника";
		Если Не ОбщегоНазначения.КоллекцииИдентичны(ВакансияОбъект.ДействияСотрудников, ДанныеПрофиля.ДействияСотрудников, ИменаКолонок, , Истина) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

Процедура ДобавитьФрагментУсловия(Условие, ФрагментУсловия, Разделитель = "И")

	Если Не ПустаяСтрока(Условие) Тогда
		Условие = Условие + " " + Разделитель + " ";
	КонецЕсли;

	Условие = Условие + "(" + ФрагментУсловия + ")";

КонецПроцедуры

Функция ФрагментУсловия(КлючИЗначение)

	Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
		ШаблонУсловия = "Вакансии.%1 В (&%1)";
	Иначе
		ШаблонУсловия = "Вакансии.%1 = &%1";
	КонецЕсли;

	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонУсловия, КлючИЗначение.Ключ);

КонецФункции

Процедура УточнитьСостояниеСогласованияПоСостояниюВакансии(ПараметрыОбновления) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласованиеВакансий.Вакансия КАК Вакансия,
		|	СогласованиеВакансий.Дата КАК Дата,
		|	СогласованиеВакансий.СостояниеСогласования КАК СостояниеСогласования,
		|	СогласованиеВакансий.Рассмотрел КАК Рассмотрел,
		|	СогласованиеВакансий.ДатаРассмотрения КАК ДатаРассмотрения,
		|	СогласованиеВакансий.Позиция КАК Позиция,
		|	СогласованиеВакансий.Подразделение КАК Подразделение,
		|	СогласованиеВакансий.Должность КАК Должность,
		|	СогласованиеВакансий.Ответственный КАК Ответственный,
		|	СогласованиеВакансий.Приоритет КАК Приоритет,
		|	СогласованиеВакансий.Комментарий КАК Комментарий,
		|	СогласованиеВакансий.ПометкаУдаления КАК ПометкаУдаления,
		|	СогласованиеВакансий.Проведен КАК Проведен,
		|	СогласованиеВакансий.НоваяПозиция КАК НоваяПозиция
		|ПОМЕСТИТЬ ВТСогласованиеВакансий
		|ИЗ
		|	РегистрСведений.СогласованиеВакансий КАК СогласованиеВакансий
		|ГДЕ
		|	СогласованиеВакансий.СостояниеСогласования В (ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается), ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка))
		|	И СогласованиеВакансий.Вакансия ССЫЛКА Справочник.Вакансии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СостоянияВакансий.Период КАК Период,
		|	СостоянияВакансий.Вакансия КАК Вакансия,
		|	СостоянияВакансий.Состояние КАК Состояние
		|ПОМЕСТИТЬ ВТСостоянияВакансий
		|ИЗ
		|	РегистрСведений.СостоянияВакансий.СрезПоследних(
		|			,
		|			Вакансия В
		|				(ВЫБРАТЬ
		|					ВТСогласованиеВакансий.Вакансия
		|				ИЗ
		|					ВТСогласованиеВакансий)) КАК СостоянияВакансий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованиеВакансий.Вакансия КАК Вакансия,
		|	СогласованиеВакансий.Дата КАК Дата,
		|	ВЫБОР
		|		КОГДА Состояния.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Открыта)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)
		|		КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Открыта)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка)
		|	КОНЕЦ КАК СостояниеСогласования,
		|	СогласованиеВакансий.Рассмотрел КАК Рассмотрел,
		|	СогласованиеВакансий.ДатаРассмотрения КАК ДатаРассмотрения,
		|	СогласованиеВакансий.Позиция КАК Позиция,
		|	СогласованиеВакансий.Подразделение КАК Подразделение,
		|	СогласованиеВакансий.Должность КАК Должность,
		|	СогласованиеВакансий.Ответственный КАК Ответственный,
		|	СогласованиеВакансий.Приоритет КАК Приоритет,
		|	СогласованиеВакансий.Комментарий КАК Комментарий,
		|	СогласованиеВакансий.ПометкаУдаления КАК ПометкаУдаления,
		|	СогласованиеВакансий.Проведен КАК Проведен,
		|	СогласованиеВакансий.НоваяПозиция КАК НоваяПозиция
		|ИЗ
		|	ВТСогласованиеВакансий КАК СогласованиеВакансий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСостоянияВакансий КАК Состояния
		|		ПО (Состояния.Вакансия = СогласованиеВакансий.Вакансия)
		|			И (ВЫБОР
		|				КОГДА Состояния.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Открыта)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Рассматривается)
		|				КОГДА Состояния.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияВакансии.Открыта)
		|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка)
		|			КОНЕЦ <> СогласованиеВакансий.СостояниеСогласования)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СогласованиеВакансий.Вакансия";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Вакансия") Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, 
				"РегистрСведений.СогласованиеВакансий", 
				"Вакансия", 
				Выборка.Вакансия) Тогда
			Продолжить;
		КонецЕсли;
		НаборЗаписей = РегистрыСведений.СогласованиеВакансий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Вакансия.Установить(Выборка.Вакансия);
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли