#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыеДанныеАвторизации() Экспорт
	
	ДанныеАвторизации = Новый Структура;
	ДанныеАвторизации.Вставить("ИмяПользователя",	"");
	ДанныеАвторизации.Вставить("Пароль",			"");
	ДанныеАвторизации.Вставить("СерверMSExchange",	"");
	Возврат ДанныеАвторизации;
	
КонецФункции

Функция НастройкиСинхронизации(Узел) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Новый Структура;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Настройки.Узел КАК Узел,
	|	Настройки.СерверMSExchange КАК СерверMSExchange,
	|	Настройки.ИмяПользователя КАК ИмяПользователя,
	|	Настройки.СерверMSExchange.АдресРесурса КАК АдресРесурса,
	|	Настройки.СерверMSExchange.ИспользоватьЗащищенноеСоединение КАК ИспользоватьЗащищенноеСоединение,
	|	Настройки.СерверMSExchange.Порт КАК Порт,
	|	Настройки.СерверMSExchange.Сервер КАК Сервер,
	|	Настройки.СерверMSExchange.Таймаут КАК Таймаут,
	|	Настройки.СерверMSExchange.ВерсияСервера КАК ВерсияСервера,
	|	Настройки.СерверMSExchange.ИспользоватьАутентификациюОС КАК ИспользоватьАутентификациюОС
	|ИЗ
	|	РегистрСведений.НастройкиСинхронизацииMSExchange КАК Настройки
	|ГДЕ
	|	Настройки.Узел = &Узел");
	Запрос.УстановитьПараметр("Узел", Узел);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Для Каждого Поле Из РезультатЗапроса.Колонки Цикл
			ЗначениеПоля = Выборка[Поле.Имя];
			Если Поле.Имя = "ИспользоватьАутентификациюОС" Тогда
				ЗначениеПоля = ЗначениеПоля И ОбщегоНазначения.ЭтоWindowsСервер();
			КонецЕсли;
			Результат.Вставить(Поле.Имя, ЗначениеПоля);
		КонецЦикла;
		Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Узел, "Пароль");
		Результат.Вставить("Пароль", Пароль);
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли