// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа = Ложь Тогда
		ДатаНачалаСтрахования = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		СтраховаяКомпания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеЗаполнения, "СтраховаяКомпания"); // СправочникСсылка.Контрагенты
		Если ЗначениеЗаполнено(СтраховаяКомпания) Тогда
			Владелец = СтраховаяКомпания;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(
		Ссылка, ДатаНачалаСтрахования, "Объект.ДатаНачалаСтрахования", Отказ, НСтр("ru='Дата договора'"), , , Ложь);
	
	Если Не Отказ Тогда
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаОкончанияСтрахования, "Объект.ДатаОкончанияСтрахования", Отказ,
			НСтр("ru='Срок действия'"), ДатаНачалаСтрахования, НСтр("ru='даты договора'"), Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
