#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЗадачаИсполнителя
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадач
	|ПО
	|	ЗадачаИсполнителя.РольИсполнителя = ИсполнителиЗадач.РольИсполнителя
	|	И ЗадачаИсполнителя.ОсновнойОбъектАдресации = ИсполнителиЗадач.ОсновнойОбъектАдресации
	|	И ЗадачаИсполнителя.ДополнительныйОбъектАдресации = ИсполнителиЗадач.ДополнительныйОбъектАдресации
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПередачиПравИсполнителей КАК НастройкаПередачиПравИсполнителей
	|ПО
	|	ЗадачаИсполнителя.Исполнитель = НастройкаПередачиПравИсполнителей.ОтКого
	|	И ЗадачаИсполнителя.РольИсполнителя = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|	И НастройкаПередачиПравИсполнителей.РольИсполнителей = ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаПравНазначенияИсполнителей КАК Назначающий
	|ПО
	|	ЗадачаИсполнителя.РольИсполнителя = Назначающий.РольИсполнителя
	|	И ЗадачаИсполнителя.ОсновнойОбъектАдресации = Назначающий.ОсновнойОбъектАдресацииИсполнителя
	|	И ЗадачаИсполнителя.ДополнительныйОбъектАдресации = Назначающий.ДополнительныйОбъектАдресацииИсполнителя
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиЗадач КАК ИсполнителиЗадачНазначающие
	|ПО
	|	Назначающий.НазначающийИсполнителей = ИсполнителиЗадачНазначающие.РольИсполнителя
	|	И Назначающий.ОсновнойОбъектАдресацииНазначающего = ИсполнителиЗадачНазначающие.ОсновнойОбъектАдресации
	|	И Назначающий.ДополнительныйОбъектАдресацииНазначающего = ИсполнителиЗадачНазначающие.ДополнительныйОбъектАдресации
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	(ЗначениеРазрешено(Автор)
	|	ИЛИ ЗначениеРазрешено(Исполнитель)
	|	ИЛИ ЗначениеРазрешено(ИсполнителиЗадач.Исполнитель)
	|	ИЛИ ЗначениеРазрешено(Назначающий.НазначающийИсполнителей КРОМЕ Справочник.РолиИсполнителей)
	|	ИЛИ ЗначениеРазрешено(ИсполнителиЗадачНазначающие.Исполнитель)
	|	ИЛИ ЗначениеРазрешено(НастройкаПередачиПравИсполнителей.Кому))
	|	И ЧтениеОбъектаРазрешено(Предмет)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.Выполнена
	|	И ЗадачаПоОбработкеДокумента.Предмет <> НЕОПРЕДЕЛЕНО
	|	И ЗадачаПоОбработкеДокумента.ТипПредметаСтрокой = """"";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Задача.ЗадачаПоОбработкеДокумента";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
			Блокировка.Заблокировать();
		Исключение
			// Объект не удается заблокировать - попробуем обработать его на следующей итерации.
			// Отдельно обрабатывать ошибку не требуется, т.к. в худшем случае обработчик зациклится
			// и прервется автоматически.
			ЗафиксироватьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			// Вероятно был удален раньше, чем обработчик дошел до него
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если Объект.Предмет <> Неопределено Тогда
			Объект.ТипПредметаСтрокой = Объект.Предмет.Метаданные().Синоним;
		КонецЕсли;
		
		Если Не Объект.Модифицированность() Тогда
			
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать задачу: %Задача% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Задача%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Задачи.ЗадачаПоОбработкеДокумента,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли