
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Строка(ФизическоеЛицо)
		+ ПредставлениеСтруктурнойЕдиницыИДолжностиСотрудника(Подразделение, Должность);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСтруктурнойЕдиницыИДолжностиСотрудника(Подразделение, Должность)
	
	Если Не ЗначениеЗаполнено(Подразделение) И Не ЗначениеЗаполнено(Должность) Тогда
		Возврат "";
	КонецЕсли;
	
	Представление = "";
	Если ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Должность) Тогда 
		Представление = СтрШаблон(" (%1, %2)", Строка(Подразделение), Строка(Должность));
	ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
		Представление = СтрШаблон(" (%1)", Строка(Подразделение));
	ИначеЕсли ЗначениеЗаполнено(Должность) Тогда 	
		Представление = СтрШаблон(" (%1)", Строка(Должность));
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#КонецЕсли