#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ИсходнаяДиаграмма Экспорт;
Перем Макет;
Перем РазмерПорцииСтрок;
Перем ВыводимыйДокумент;
Перем ТекущееКоличествоСтрок;
Перем ТекущаяДиаграмма;
Перем ТекущаяСерия;
Перем ТекущаяКоллекцияТочек;
Перем ПерваяСтраница;
Перем ЗаголовокДокумента;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДиаграммаГантаДляПечати(Заголовок) Экспорт
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ДиаграммаОтпусков.ПФ_MXL_ДиаграммаОтпусков");
	ВыводимыйДокумент = Новый ТабличныйДокумент;
	РазмерПорцииСтрок = КоличествоОтображаемыхСтрок();
	ПерваяСтраница = Истина;
	ЗаголовокДокумента = Заголовок;

	Если ИсходнаяДиаграмма.Точки.Количество() > 0 Тогда
		ПерваяТочка = ИсходнаяДиаграмма.Точки[0];
	КонецЕсли;

	СоздатьНовуюДиаграмму(ПерваяТочка);
	ВывестиТочки(ИсходнаяДиаграмма.Точки);

	Для Каждого Рисунок Из ВыводимыйДокумент.Рисунки Цикл
		Рисунок.Объект.ПоказатьУровеньТочек(0);
	КонецЦикла;

	Возврат ВыводимыйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоОтображаемыхСтрок()
	Возврат 30;
КонецФункции

Процедура СоздатьНовуюДиаграмму(СледующаяТочка)
	
	Если ПерваяСтраница Тогда
		ПерваяСтраница = Ложь;
	Иначе 
		ВыводимыйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;  
 
	Область = Макет.ПолучитьОбласть("ОбластьДиаграммы");
	Область.Параметры.Заголовок = ЗаголовокДокумента;
	ВыводимыйДокумент.Вывести(Область);
	ТекущаяДиаграмма = ВыводимыйДокумент.Рисунки[ВыводимыйДокумент.Рисунки.Количество() - 1].Объект;
 
	ТекущаяДиаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	ТекущаяДиаграмма.УстановитьПолныйИнтервал(ИсходнаяДиаграмма.НачалоПолногоИнтервала, ИсходнаяДиаграмма.КонецПолногоИнтервала);
	ТекущаяДиаграмма.ОтображениеТекстаЗначения = ИсходнаяДиаграмма.ОтображениеТекстаЗначения;
	ТекущаяДиаграмма.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Плоский;
	ИсходнаяШкала = ИсходнаяДиаграмма.ОбластьПостроения.ШкалаВремени;
	ТекущаяШкала = ТекущаяДиаграмма.ОбластьПостроения.ШкалаВремени;
	ТекущаяШкала.Положение = ИсходнаяШкала.Положение;
	ТекущаяШкала.ПрозрачныйФон = ИсходнаяШкала.ПрозрачныйФон;
	ТекущаяШкала.ЦветТекста = ИсходнаяШкала.ЦветТекста;
	ТекущаяШкала.ЦветФона = ИсходнаяШкала.ЦветФона;
	
	Для каждого ИнтервалФона Из ИсходнаяДиаграмма.ИнтервалыФона Цикл
		ТекущаяДиаграмма.ИнтервалыФона.Добавить(ИнтервалФона.Начало, ИнтервалФона.Конец);
	КонецЦикла;

	Для Индекс = 0 По ИсходнаяШкала.Элементы.Количество() - 1 Цикл
		ИсходныйЭлемент = ИсходнаяШкала.Элементы[Индекс];
		Если Индекс = 0 Тогда
			ТекущийЭлемент = ТекущаяШкала.Элементы[0];
		Иначе
			ТекущийЭлемент = ТекущаяШкала.Элементы.Добавить();
		КонецЕсли;
		ТекущийЭлемент.Видимость = ИсходныйЭлемент.Видимость;
		ТекущийЭлемент.Единица = ИсходныйЭлемент.Единица;
		ТекущийЭлемент.Кратность = ИсходныйЭлемент.Кратность;
		ТекущийЭлемент.ЛинииДелений = ИсходныйЭлемент.ЛинииДелений;
		ТекущийЭлемент.ОтображатьПериодическиеМетки = ИсходныйЭлемент.ОтображатьПериодическиеМетки;
		ТекущийЭлемент.Формат = ИсходныйЭлемент.Формат;
		ТекущийЭлемент.ФорматДня = ИсходныйЭлемент.ФорматДня;
		ТекущийЭлемент.ЦветЛиний = ИсходныйЭлемент.ЦветЛиний;
		ТекущийЭлемент.ЦветТекста = ИсходныйЭлемент.ЦветТекста;
		ТекущийЭлемент.ЦветФона = ИсходныйЭлемент.ЦветФона;
	КонецЦикла;
	ТекущееКоличествоСтрок = 0;

	Если ИсходнаяДиаграмма.Серии.Количество() > 0 Тогда
		ТекущаяСерия = ТекущаяДиаграмма.Серии.Добавить();
		ИсходнаяСерия = ИсходнаяДиаграмма.Серии[0];
		ТекущаяСерия.ДополнительныйЦвет = ИсходнаяСерия.ДополнительныйЦвет;
		ТекущаяСерия.ПриоритетЦвета = ИсходнаяСерия.ПриоритетЦвета;
		ТекущаяСерия.Расшифровка = ИсходнаяСерия.Расшифровка;
		ТекущаяСерия.Текст = ИсходнаяСерия.Текст;
		ТекущаяСерия.Значение  = ИсходнаяСерия.Значение;
		ТекущаяСерия.Цвет = ИсходнаяСерия.Цвет;
		ТекущаяСерия.ЦветШтриховкиМеждуИнтервалами = ИсходнаяСерия.ЦветШтриховкиМеждуИнтервалами;
		ТекущаяСерия.ШтриховкаМеждуИнтервалами = ИсходнаяСерия.ШтриховкаМеждуИнтервалами;
		ТекущаяСерия.ШтриховкаПерекрывающихсяИнтервалов = ИсходнаяСерия.ШтриховкаПерекрывающихсяИнтервалов;
	КонецЕсли;

	ТекущаяКоллекцияТочек = ТекущаяДиаграмма.Точки;
	Если СледующаяТочка <> Неопределено Тогда
		Родители = Новый Массив;
		Родитель = СледующаяТочка;
		Пока Родитель.Родитель <> Неопределено Цикл
			Родитель = Родитель.Родитель;
			Родители.Добавить(Родитель);
		КонецЦикла;
		Для Индекс = 1 По Родители.Количество() Цикл
			ИсходныйРодитель = Родители[Родители.Количество() - Индекс];
			ТекущийРодитель = ТекущаяКоллекцияТочек.Добавить();
			ВывестиТочкаВТочку(ИсходныйРодитель, ТекущийРодитель);
			ТекущаяКоллекцияТочек = ТекущийРодитель.Точки;
			ТекущееКоличествоСтрок = ТекущееКоличествоСтрок + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиТочкаВТочку(ИсходнаяТочка, КонечнаяТочка)
	
	КонечнаяТочка.ДополнительныйЦвет = ИсходнаяТочка.ДополнительныйЦвет;
	КонечнаяТочка.Значение = ИсходнаяТочка.Значение;
	КонечнаяТочка.Картинка = ИсходнаяТочка.Картинка;
	КонечнаяТочка.ПриоритетЦвета = ИсходнаяТочка.ПриоритетЦвета;
	КонечнаяТочка.Расшифровка = ИсходнаяТочка.Расшифровка;
	КонечнаяТочка.Текст = ИсходнаяТочка.Текст;
	КонечнаяТочка.Цвет = ИсходнаяТочка.Цвет;
	КонечнаяТочка.ЦветТекста = ИсходнаяТочка.ЦветТекста;
	КонечнаяТочка.ЦветФона = ИсходнаяТочка.ЦветФона;
	КонечнаяТочка.Шрифт = ИсходнаяТочка.Шрифт;
	
	Если ИсходнаяДиаграмма.Серии.Количество() > 0 Тогда
		ИсходноеЗначение = ИсходнаяДиаграмма.ПолучитьЗначение(ИсходнаяТочка, ИсходнаяДиаграмма.Серии[0]);
		КонечноеЗначение = ТекущаяДиаграмма.ПолучитьЗначение(КонечнаяТочка, ТекущаяСерия);

		КонечноеЗначение.ДополнительныйЦвет = ИсходноеЗначение.ДополнительныйЦвет;
		КонечноеЗначение.Расшифровка = ИсходноеЗначение.Расшифровка;
		КонечноеЗначение.Текст = ИсходноеЗначение.Текст;
		КонечноеЗначение.Цвет = ИсходноеЗначение.Цвет;
		КонечноеЗначение.ЦветТекста = ИсходноеЗначение.ЦветТекста;
		КонечноеЗначение.ЦветФона = ИсходноеЗначение.ЦветФона;
	 
		Для Каждого ИсходныйИнтервал Из ИсходноеЗначение Цикл
			КонечныйИнтервал = КонечноеЗначение.Добавить();
			КонечныйИнтервал.Конец = ИсходныйИнтервал.Конец;
			КонечныйИнтервал.Начало = ИсходныйИнтервал.Начало;
			КонечныйИнтервал.Расшифровка = ИсходныйИнтервал.Расшифровка;
			КонечныйИнтервал.Текст = ИсходныйИнтервал.Текст;
			КонечныйИнтервал.Цвет = ИсходныйИнтервал.Цвет;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиТочки(ИсходныеТочки)
	
	Для Каждого Точка Из ИсходныеТочки Цикл 
		Если ТекущееКоличествоСтрок >= РазмерПорцииСтрок Тогда
			СоздатьНовуюДиаграмму(Точка);
		КонецЕсли;

		НоваяТочка = ТекущаяКоллекцияТочек.Добавить();
		ТекущееКоличествоСтрок = ТекущееКоличествоСтрок + 1;
		ВывестиТочкаВТочку(Точка, НоваяТочка);

		Если Точка.Точки.Количество() > 0 Тогда
			ТекущаяКоллекцияТочек = НоваяТочка.Точки;
			ВывестиТочки(Точка.Точки);

			Если ТекущаяКоллекцияТочек.Родитель.Родитель <> Неопределено Тогда
				ТекущаяКоллекцияТочек = ТекущаяКоллекцияТочек.Родитель.Родитель.Точки;
			Иначе
				ТекущаяКоллекцияТочек = ТекущаяДиаграмма.Точки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
