#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ТекущееСостояниеЗагрузки(Пользователь) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Элемент = Блокировка.Добавить(Метаданные.РегистрыСведений.СостояниеЗагрузкиКандидатовИзИнтернета.ПолноеИмя());
	Элемент.УстановитьЗначение("Пользователь", Пользователь);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Состояние = ТекущаяЗаписьСостояния(Пользователь);
		Если Не ЗначениеЗаполнено(Состояние) Тогда
			Состояние = УстановитьЗаписьСостояния(Пользователь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		Возврат Состояние;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция УстановитьНовоеСостояние(Пользователь) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Элемент = Блокировка.Добавить(Метаданные.РегистрыСведений.СостояниеЗагрузкиКандидатовИзИнтернета.ПолноеИмя());
	Элемент.УстановитьЗначение("Пользователь", Пользователь);
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Состояние = УстановитьЗаписьСостояния(Пользователь);
		ЗафиксироватьТранзакцию();
		Возврат Состояние;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецФункции

Функция ТекущаяЗаписьСостояния(Пользователь) Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостояниеЗагрузки.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостояниеЗагрузкиКандидатовИзИнтернета КАК СостояниеЗагрузки
		|ГДЕ
		|	СостояниеЗагрузки.Пользователь = &Пользователь";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Состояние;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция УстановитьЗаписьСостояния(Пользователь)
	
	НаборЗаписей = РегистрыСведений.СостояниеЗагрузкиКандидатовИзИнтернета.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	ЗаписьНабора = НаборЗаписей.Добавить();
	ЗаписьНабора.Пользователь = Пользователь;
	ЗаписьНабора.Состояние = Новый УникальныйИдентификатор();
	НаборЗаписей.Записать();
	
	Возврат ЗаписьНабора.Состояние;
	
КонецФункции

#КонецОбласти

#КонецЕсли