// @strict-types

#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
//
// Параметры:
//  ШаблоныЗаданий - Массив Из Строка - В параметр следует добавить имена предопределенных
//   неразделенных регламентных заданий, которые должны использоваться в качестве
//   шаблонов для заданий очереди.
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец ЭлектронноеВзаимодействие
	
	// ЗарплатаКадрыПодсистемы
	ЗарплатаКадры.ПриПолученииСпискаШаблоновОчередиЗаданий(ШаблоныЗаданий);
	// Конец ЗарплатаКадрыПодсистемы
	
	// РегламентированнаяОтчетность
	ОбщегоНазначенияБРО.ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	// Конец РегламентированнаяОтчетность
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
//
// Параметры:
//  СоответствиеИменПсевдонимам - Соответствие из КлючИЗначение:
//    * Ключ - Строка - псевдоним метода, например "ОчиститьОбластьДанных".
//    * Значение - Строка - Имя метода для вызова, например "РаботаВМоделиСервиса.ОчиститьОбластьДанных".
//        В качестве значения можно указать Неопределено, в этом случае считается что имя 
//        совпадает с псевдонимом.
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЭлектронноеВзаимодействие
	
	// РегламентированнаяОтчетность
	ОбщегоНазначенияБРО.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец РегламентированнаяОтчетность
	
	// ЗарплатаКадрыПодсистемы
	ЗарплатаКадры.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	// Конец ЗарплатаКадрыПодсистемы
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриОпределенииПсевдонимовОбработчиков(
		СоответствиеИменПсевдонимам);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

// Заполняет соответствие методов обработчиков ошибок псевдонимам методов, при возникновении
// ошибок в которых они вызываются.
//
// Параметры:
//  ОбработчикиОшибок - Соответствие из КлючИЗначение:
//    * Ключ - Строка - Псевдоним метода, например ОчиститьОбластьДанных.
//    * Значение - Строка - Имя метода - обработчика ошибок, для вызова при возникновении ошибки. 
//        Обработчик ошибок вызывается в случае завершения выполнения исходного задания
//        с ошибкой. Обработчик ошибок вызывается в той же области данных, что и исходное задание.
//        Метод обработчика ошибок считается разрешенным к вызову механизмами очереди.
//        Параметры обработчика ошибок:
//          ПараметрыЗадания - Структура - параметры задания очереди.
//          Параметры
//          НомерПопытки
//          КоличествоПовторовПриАварийномЗавершении
//          ДатаНачалаПоследнегоЗапуска.
//
Процедура ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

// Формирует таблицу регламентных заданий с признаком использования в модели сервиса.
// 
// Параметры:
//  ТаблицаИспользования - ТаблицаЗначений - описание:
//	* РегламентноеЗадание - Строка - имя регламентного задания.
//  * Использование - Булево - признак использования.
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт
	// @skip-check module-empty-method
КонецПроцедуры

#КонецОбласти