#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Кандидат",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * МестоПубликации - СправочникСсылка.ИсточникиИнформацииОКандидатах
// * ИдентификаторПользователя - Строка
// * ИмяПоля - Строка
// * СодержимоеПоля - Строка
Функция ДанныеРезюме(Кандидат) Экспорт
	
	ДанныеРезюме = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПубликации.МестоПубликации,
	|	НастройкиИнтеграции.ИдентификаторПользователя,
	|	ДанныеПубликации.ПолеДанных КАК ИмяПоля,
	|	ДанныеПубликации.Значение КАК СодержимоеПоля
	|ИЗ
	|	РегистрСведений.ДанныеПубликацииРезюме КАК ДанныеПубликации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов КАК НастройкиИнтеграции
	|		ПО ДанныеПубликации.МестоПубликации = НастройкиИнтеграции.РекрутинговыйСайт
	|			И (ДанныеПубликации.Кандидат = &Кандидат)
	|			И (НастройкиИнтеграции.Пользователь = &Пользователь)
	|			И (НастройкиИнтеграции.Использовать = ИСТИНА)";
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеРезюме = РезультатЗапроса.Выгрузить();
	
	Возврат ДанныеРезюме;
	
КонецФункции

#КонецОбласти

#КонецЕсли