#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
		Метаданные.РегистрыСведений.ОценкиВариантовОтвета.Измерения.ХарактеристикаПерсонала.Имя,
		"УправленческиеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли