#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОшибкиПользователю = Неопределено;
	Шаблон = НСтр("ru = 'Не заполнено поле ""%1"" в разделе ""%2"" для сотрудника %3.'");
	ИндексыРаботников = Новый Соответствие;
	Для Каждого ТекущийРаботник Из Работники Цикл
		ИндексыРаботников.Вставить(ТекущийРаботник.ФизическоеЛицо, Работники.Индекс(ТекущийРаботник));
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			ОшибкиПользователю, "Объект.Организация",
			НСтр("ru ='Необходимо указать учреждение.'"));
	КонецЕсли;
	
	Если ПустаяСтрока(УИНОрганизации) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			ОшибкиПользователю, "Объект.УИНОрганизации",
			НСтр("ru ='Идентификатор учреждения должен быть заполнен.'"));
	КонецЕсли;
	
	Для Каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл 
		ИмяТЧ = ТЧ.Имя;
		Для Каждого СтрокаТЧ Из ЭтотОбъект[ИмяТЧ] Цикл
			Для Каждого Реквизит Из ТЧ.Реквизиты Цикл 
				ИмяРеквизита = Реквизит.Имя;
				Если ПроверяемыеРеквизиты.Найти(ИмяТЧ + "." + ИмяРеквизита)<>Неопределено Тогда
					Если Не ЗначениеЗаполнено(СтрокаТЧ[ИмяРеквизита]) Тогда
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Реквизит.Синоним, ТЧ.Синоним, СтрокаТЧ["ФизическоеЛицо"]);
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
									ОшибкиПользователю, "Объект.Работники[%1].ФизическоеЛицо",
									ТекстСообщения, , ИндексыРаботников[СтрокаТЧ["ФизическоеЛицо"]]);						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПользователю, Отказ);
	ПроверяемыеРеквизиты.Очистить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли