#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// РегламентированнаяОтчетность.ЗадачиБухгалтера

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиентСерверПереопределяемый.ПриОпределенииЭтоДокументСЭДО
//
Процедура ПриОпределенииЭтоДокументСЭДО(Признак, Правило) Экспорт
	
	ЗарплатаКадрыРасширенныйКлиентСервер.ПриОпределенииЭтоДокументСЭДО(Признак, Правило);
	
КонецПроцедуры

// Конец РегламентированнаяОтчетность.ЗадачиБухгалтера

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриОпределенииВозможныхПредметов(ТипыПредметов) Экспорт
	ЗарплатаКадрыРасширенныйКлиентСервер.ПриОпределенииВозможныхПредметов(ТипыПредметов);
КонецПроцедуры

Процедура ПриОпределенииВозможныхКонтактов(ТипыКонтактов) Экспорт
	ЗарплатаКадрыРасширенныйКлиентСервер.ПриОпределенииВозможныхКонтактов(ТипыКонтактов)
КонецПроцедуры

#КонецОбласти

