#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.ДисциплинарноеВзыскание.ПолучитьДанныеДляПроведения(Ссылка);
	
	ДисциплинарныеВзыскания.СформироватьДвиженияДисциплинарногоВзыскания(Движения, ДанныеДляПроведения.ДвиженияДисциплинарногоВзыскания);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Наставничество") Тогда
		МодульНаставничество = ОбщегоНазначения.ОбщийМодуль("Наставничество");
		МодульНаставничество.СформироватьДвиженияПоНаставничеству(Ссылка, ЭтотОбъект, Движения, ДанныеДляПроведения, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТаблицаСотрудников = Сотрудники.Выгрузить(, "Сотрудник");
	ТаблицаСотрудников.Колонки.Добавить("Количество");
	ТаблицаСотрудников.ЗаполнитьЗначения(1, "Количество");
	ТаблицаСотрудников.Свернуть("Сотрудник", "Количество");
	
	Для Каждого Запись Из ТаблицаСотрудников Цикл
		Если Не Запись.Сотрудник.Пустая() И Запись.Количество > 1 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Табличная часть не может иметь несколько строк для одного сотрудника'"), , , , Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Сотрудники.Количество() > 0 Тогда
		Для Счетчик = 0 По Сотрудники.Количество() - 1 Цикл
			ТекСтрокаСотрудники = Сотрудники[Счетчик];
			Если ЗначениеЗаполнено(ТекСтрокаСотрудники.ДатаОкончания) И
				ТекСтрокаСотрудники.ДатаОкончания <= ТекСтрокаСотрудники.ДатаНачала Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Дата окончания взыскания не может быть раньше даты начала'"), ,
					"Объект.Сотрудники[" + Счетчик + "].ДатаОкончания", , Отказ);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Список сотрудников не может быть пустым'"), , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли