#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьПараметры();
	
	ВидыДоходовИсполнительногоПроизводстваКлиентСервер.НастроитьКолонкуВидДоходаДляВыплатыЗарплаты(
		ЭтотОбъект,
		"Выплаты",
		"ВыплатыВидДохода",
		"Выплаты.ВидДоходаИсполнительногоПроизводства",
		ДатаВыплаты,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыВидВыплатыНаКартуМИР", 
		"Видимость", ДляПеречисленийНаКартыМир);
	
	// В режиме просмотра взысканных сумм запрещено менять состав строк и другую аналитику, только взысканные суммы.
	// Изменение состава строк и аналитики должно производиться в режиме просмотра сумм к выплате.
	Если СтрНачинаетсяС(Параметры.ИмяПоля, "СоставВзысканнаяСумма") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыКВыплате",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыплатыВзысканнаяСумма",
			"Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Выплаты",
			"ИзменятьСоставСтрок", Ложь);
		
		Для каждого ПолеТаблицы Из Элементы.Выплаты.ПодчиненныеЭлементы Цикл
			Если Не СтрНайти(ПолеТаблицы.Имя, "ВыплатыВзысканнаяСумма") Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ПолеТаблицы.Имя,
					"ТолькоПросмотр", Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru='%1: " + Параметры.Заголовок + "'"), Строка(ФизическоеЛицо));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗарплата

&НаКлиенте
Процедура ВыплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьЗначенияСвойств(Элемент.ТекущиеДанные, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПараметры()
	
	Параметры.Свойство("ИдентификаторСтроки",	ИдентификаторСтроки);
	Выплаты.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВХранилищеВыплатыПоСтроке));
	
	Параметры.Свойство("ФизическоеЛицо",                       ФизическоеЛицо);
	Параметры.Свойство("Организация",                          Организация);
	Параметры.Свойство("ПериодРегистрации",                    ПериодРегистрации);
	Параметры.Свойство("СтатьяФинансирования",                 СтатьяФинансирования);
	Параметры.Свойство("СтатьяРасходов",                       СтатьяРасходов);
	Параметры.Свойство("ВидДоходаИсполнительногоПроизводства", ВидДоходаИсполнительногоПроизводства);
	Параметры.Свойство("ЗарплатныйПроектДляПеречисленияНаКартыМир", ДляПеречисленийНаКартыМир);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ПроверитьЗаполнение() Тогда
		
		РезультатыРедактирования = Новый Структура;
		РезультатыРедактирования.Вставить("Модифицированность", Модифицированность);
		РезультатыРедактирования.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		РезультатыРедактирования.Вставить("АдресВХранилищеВыплатыПоСтроке", АдресВХранилищеВыплатыПоСтроке());
		
		Модифицированность = Ложь;
		Закрыть(РезультатыРедактирования)
		
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция АдресВХранилищеВыплатыПоСтроке()
	
	ВыплатыФизлицу = Выплаты.Выгрузить();
	ВыплатыФизлицу.ЗаполнитьЗначения(ИдентификаторСтроки, "ИдентификаторСтроки");
	
	Возврат ПоместитьВоВременноеХранилище(ВыплатыФизлицу, УникальныйИдентификатор);
	
КонецФункции	

#КонецОбласти
