#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Интегратор") Тогда
		ЗаголовокДекорации = Элементы.ДекорацияПоясненияУсловияПодключения.Заголовок;
		НаименованиеБанка = ОбменСБанкамиСлужебный.НаименованиеБанка(Параметры.Интегратор);
		Элементы.ДекорацияПоясненияУсловияПодключения.Заголовок = СтрШаблон(ЗаголовокДекорации, НаименованиеБанка);
	Иначе
		Элементы.ДекорацияПоясненияУсловияПодключения.Видимость = Ложь;
	КонецЕсли;
	
	Для Каждого ИнтегрируемыйБанк Из Параметры.ИнтегрируемыеБанки Цикл
		НоваяСтрока = Банки.Добавить();
		НоваяСтрока.Банк = ИнтегрируемыйБанк.Значение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыБанки

&НаКлиенте
Процедура БанкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборБанка();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьБанк(Команда)
	
	ОбработатьВыборБанка();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборБанка()
	
	ТекущиеДанные = Элементы.Банки.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Закрыть(ТекущиеДанные.Банк);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти