
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	Если ЗначениеЗаполнено(Параметры.Этапы) Тогда
		
		Для Каждого Этап Из Параметры.Этапы Цикл
			ЗаполнитьЗначенияСвойств(ЭтапыШаблона.Добавить(), Этап);
		КонецЦикла;
		
	Иначе
		
		Шаблон = Параметры.Шаблон;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ШаблоныПроцессовЭтапы.НомерСтроки КАК НомерЭтапа,
		|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК ИдентификаторЭтапа,
		|	ШаблоныПроцессовЭтапы.Этап КАК Этап,
		|	ШаблоныПроцессовЭтапы.Исполнитель КАК Исполнитель
		|ИЗ
		|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
		|ГДЕ
		|	ШаблоныПроцессовЭтапы.Ссылка = &Шаблон
		|	И &УсловиеПоДоступнымЭтапам";
		
		Запрос.УстановитьПараметр("Шаблон", Шаблон);
		
		Если Параметры.ОграничитьСпискокЭтапов
			И ТипЗнч(Параметры.ДоступныеЭтапы) = Тип("Массив") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоступнымЭтапам", "ШаблоныПроцессовЭтапы.ИдентификаторЭтапа В (&ДоступныеЭтапы)");
			Запрос.УстановитьПараметр("ДоступныеЭтапы", Параметры.ДоступныеЭтапы);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоступнымЭтапам", "ИСТИНА");
		КонецЕсли;
		
		ЭтапыШаблона.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторЭтапа") Тогда
		Строки = ЭтапыШаблона.НайтиСтроки(Новый Структура("ИдентификаторЭтапа",Параметры.ИдентификаторЭтапа));
		Если Строки.Количество() > 0 Тогда
			Элементы.ЭтапыШаблона.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Шаблон", "Видимость", НЕ ЗначениеЗаполнено(Параметры.Этапы));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭтапыШаблона

&НаКлиенте
Процедура ЭтапыШаблонаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьВладельцаОВыборе(Элементы.ЭтапыШаблона.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьВладельцаОВыборе(Элементы.ЭтапыШаблона.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьВладельцаОВыборе(Этап)
	
	ЗначениеВыбора = Новый Структура;
	ЗначениеВыбора.Вставить("НомерЭтапа", Этап.НомерЭтапа);
	ЗначениеВыбора.Вставить("Этап", Этап.Этап);
	ЗначениеВыбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
	ЗначениеВыбора.Вставить("Исполнитель", Этап.Исполнитель);
	
	ОповеститьОВыборе(ЗначениеВыбора);
	
КонецПроцедуры

#КонецОбласти
