#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ИмяРегистра", ИмяРегистра);
	Параметры.Свойство("ИмяИзмерения", ИмяИзмерения);
	
	СоздатьРеквизитНаборЗаписей(ЭтотОбъект);
	
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	Если Не ЗначениеЗаполнено(ОбъектВладелец) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ФинансовыйУчет.ДоступноИзменениеФинансовогоУчета(ИмяРегистра) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли; 
	
	Если ТолькоПросмотр Тогда
		ЗарплатаКадрыКлиентСервер.УстановитьРежимТолькоПросмотрВФормеРедактированияИстории(ЭтотОбъект);
	КонецЕсли;
		
	Для Каждого ЗаписьНабора Из Параметры.МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект["НаборЗаписей"].Добавить(), ЗаписьНабора);
	КонецЦикла;
	
	ЗаполнитьСоответствиеПредставлений();
	
	ЭтотОбъект["НаборЗаписей"].Сортировать("Период");
	Таблица = ЭтотОбъект["НаборЗаписей"].Выгрузить(); 
	Таблица.Свернуть("Период");
	Периоды = Таблица.ВыгрузитьКолонку("Период");
	Отбор = Новый Структура("Период");
	Для каждого Период Из Периоды Цикл
		НоваяСтрокаИстории = ТаблицаИстории.Добавить();
		НоваяСтрокаИстории.Период = Период;
		Отбор.Период = Период;
		СтрокиНабора = ЭтотОбъект["НаборЗаписей"].НайтиСтроки(Отбор);
		Если СтрокиНабора.Количество()>1 Тогда
			НоваяСтрокаИстории.Распределяется = Истина;
			ТаблицаРаспределения = НоваяТаблицаРаспределения();
			Для каждого СтрокаНабора Из СтрокиНабора Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаРаспределения.Добавить(),СтрокаНабора);
			КонецЦикла;
			НоваяСтрокаИстории.Распределение = ЗарплатаКадрыРасширенный.ТаблицаЗначенийВСтруктуру(ТаблицаРаспределения);
			НоваяСтрокаИстории.КомандаРедактированияРаспределения = ПредставлениеРаспределения(НоваяСтрокаИстории.Распределение);
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИстории, СтрокиНабора[0]);
			НоваяСтрокаИстории.Распределение = ЗарплатаКадрыРасширенный.ТаблицаЗначенийВСтруктуру(НоваяТаблицаРаспределения());
			НоваяСтрокаИстории.КомандаРедактированияРаспределения = НСтр("ru = 'Не заполнено'");
		КонецЕсли;
	КонецЦикла;
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДатеВТабличнойЧасти(ТаблицаИстории, "Период", "ПериодСтрокой");
	УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененоРаспределениеФинансовыйУчет" И Источник = ЭтотОбъект Тогда
		
		Отбор = Новый Структура("Период", Параметр.Период);
		НайденныеСтроки = ТаблицаИстории.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество()>0 Тогда
			НайденныеСтроки[0].Распределение = Параметр.ТаблицаРаспределения;
			НайденныеСтроки[0].КомандаРедактированияРаспределения = ПредставлениеРаспределения(НайденныеСтроки[0].Распределение);
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаИстории

&НаКлиенте
Процедура ТаблицаИсторииПериодПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(Элементы.ТаблицаИстории.ТекущиеДанные, "Период", "ПериодСтрокой", Модифицированность);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(ЭтотОбъект, Элементы.ТаблицаИстории.ТекущиеДанные, "Период", "ПериодСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(Элементы.ТаблицаИстории.ТекущиеДанные, "Период", "ПериодСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Если Элемент.ТекущиеДанные <> Неопределено Тогда
			НовыйПериод = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
			Если ТаблицаИстории.Количество() > 1 Тогда
				ПоследнийПериод = ТаблицаИстории.Получить(ТаблицаИстории.Количество() - 2).Период;
			Иначе
				ПоследнийПериод = '00010101000000';
			КонецЕсли; 
			Если НовыйПериод <= ПоследнийПериод Тогда
				НовыйПериод = ДобавитьМесяц(ПоследнийПериод, 1);
			КонецЕсли; 
			Элемент.ТекущиеДанные.Период = НовыйПериод;
			ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Элемент.ТекущиеДанные, "Период", "ПериодСтрокой");
			
			Элемент.ТекущиеДанные.Распределение = НовыйФиксированныйМассивРаспределение();
			Элемент.ТекущиеДанные.КомандаРедактированияРаспределения = НСтр("ru = 'Не заполнено'");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИстории.Сортировать("Период");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Или Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Период) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Необходимо указать месяц, с которого будет действовать настройка финансового учета'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке,,"ТаблицаИстории.Период", , Отказ);
	Иначе
		НайденныеСтроки = ТаблицаИстории.НайтиСтроки(Новый Структура("Период", Элемент.ТекущиеДанные.Период));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока <> Элемент.ТекущиеДанные Тогда
				СообщениеОбОшибке = НСтр("ru = 'Уже есть запись с указанным месяцем начала действия настройки'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибке,,"ТаблицаИстории.Период", , Отказ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИсторииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "КомандаРедактированияРаспределения") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ТаблицаИстории.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ТаблицаРаспределения = ТекущиеДанные.Распределение;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", ЭтотОбъект.ТолькоПросмотр);
	ПараметрыОткрытия.Вставить("Период", ТекущиеДанные.Период);
	ПараметрыОткрытия.Вставить("ИмяРегистра", ИмяРегистра);
	ПараметрыОткрытия.Вставить("ТаблицаРаспределения", ТаблицаРаспределения);
	ОткрытьФорму("ОбщаяФорма.РедактированиеНастройкиРаспределенияФинансовогоУчета" , ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ОшибкиРаспределенияВТаблицеИстории() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект["НаборЗаписей"].Очистить();
	Для каждого СтрокаТЗ Из ТаблицаИстории Цикл
		Если СтрокаТЗ.Распределяется Тогда
			ТаблицаРаспределения = СтрокаТЗ.Распределение;
			ИдентификаторСтроки = 0;
			Для каждого СтрокаРаспределения Из ТаблицаРаспределения Цикл
				НоваяЗапись = ЭтотОбъект["НаборЗаписей"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаРаспределения);
				НоваяЗапись[ИмяИзмерения] = ОбъектВладелец;
				Если ИмяИзмерения = "Позиция" Тогда
					НоваяЗапись.Подразделение = ВладелецФормы.Объект.Подразделение;
				КонецЕсли;
				НоваяЗапись.Период = СтрокаТЗ.Период;
				НоваяЗапись.ИдентификаторСтроки = ИдентификаторСтроки;
				ИдентификаторСтроки = ИдентификаторСтроки +1;
			КонецЦикла;
		Иначе
			НоваяЗапись = ЭтотОбъект["НаборЗаписей"].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
			НоваяЗапись[ИмяИзмерения] = ОбъектВладелец;
			Если ИмяИзмерения = "Позиция" Тогда
				НоваяЗапись.Подразделение = ВладелецФормы.Объект.Подразделение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	РедактированиеПериодическихСведенийКлиент.ОповеститьОЗавершении(ЭтотОбъект, ИмяРегистра, ОбъектВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСоответствиеПредставлений()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СпособыОтражения.Ссылка,
	|	ВЫРАЗИТЬ(СпособыОтражения.Наименование КАК СТРОКА(40)) КАК Наименование
	|ИЗ
	|	Справочник.СпособыОтраженияВФинансовомУчете КАК СпособыОтражения";
	
	Представления = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представления.Вставить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	Представления.Вставить(Справочники.СпособыОтраженияВФинансовомУчете.ПустаяСсылка(), "");

	СоответствиеПредставлений = Новый ФиксированноеСоответствие(Представления);
	
КонецПроцедуры

&НаСервере
Функция ПредставлениеРаспределения(ТаблицаРаспределения)

	Если ТаблицаРаспределения.Количество() = 0 Тогда
		Возврат НСтр("ru = 'Не заполнено'");
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
		
	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("ДоляРаспределения");
	ПроверяемыеПоля.Добавить("СпособОтражения");
	
	ПредставлениеРаспределения = "";
	Для каждого Запись Из ТаблицаРаспределения Цикл
		
		Для каждого ОписаниеПоля Из ПроверяемыеПоля Цикл
			
			Если Не ЗначениеЗаполнено(Запись[ОписаниеПоля]) Тогда   
				ЕстьОшибки = Истина;	
			КонецЕсли;
			
			Если ОписаниеПоля = "ДоляРаспределения" Тогда
				ПредставлениеРаспределения = ПредставлениеРаспределения + Запись[ОписаниеПоля];
			Иначе
				ПредставлениеРаспределения =  ПредставлениеРаспределения + ", " + СокрЛП(СоответствиеПредставлений[Запись[ОписаниеПоля]]);
			КонецЕсли;
			
		КонецЦикла;
		ПредставлениеРаспределения = ПредставлениеРаспределения + Символы.ПС;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат НСтр("ru = 'Заполнено с ошибками'");
	Иначе
		Возврат ПредставлениеРаспределения;
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Функция НоваяТаблицаРаспределения()

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("СпособОтражения", Новый ОписаниеТипов("СправочникСсылка.СпособыОтраженияВФинансовомУчете"));
	Таблица.Колонки.Добавить("ДоляРаспределения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(14, 3)));
	
	Возврат Таблица;

КонецФункции

&НаСервере
Функция ОшибкиРаспределенияВТаблицеИстории()

	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	Синоним = МетаданныеРегистра.Синоним;
	Если ЗначениеЗаполнено(МетаданныеРегистра.ПредставлениеЗаписи) Тогда
		Синоним = МетаданныеРегистра.ПредставлениеЗаписи;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Для каждого СтрокаТЗ Из ТаблицаИстории Цикл
		Если СтрокаТЗ.Распределяется Тогда
			ТаблицаРаспределения = СтрокаТЗ.Распределение;
			Если ТаблицаРаспределения.Количество() = 0 Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1: не указано распределение по способам отражения на %2.'"), Синоним, СтрокаТЗ.ПериодСтрокой);
				ПутьКРеквизитуФормы = "ТаблицаИстории";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,	ПутьКРеквизитуФормы, , Отказ);
			Иначе
				ПроверяемыеПоля = Новый Массив;
				ПроверяемыеПоля.Добавить(МетаданныеРегистра.Ресурсы.СпособОтражения);
				ПроверяемыеПоля.Добавить(МетаданныеРегистра.Ресурсы.ДоляРаспределения);
				Для каждого Запись Из ТаблицаРаспределения Цикл
					Для каждого ОписаниеПоля Из ПроверяемыеПоля Цикл
						Если Не ЗначениеЗаполнено(Запись[ОписаниеПоля.Имя]) Тогда   
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1: не указано распределение по способам отражения на %2.'"), Синоним, СтрокаТЗ.ПериодСтрокой);
							ПутьКРеквизитуФормы = ИмяРегистра + "Распределение";
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,	ПутьКРеквизитуФормы, , Отказ);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отказ;

КонецФункции

&НаСервереБезКонтекста
Функция НовыйФиксированныйМассивРаспределение()

	Возврат ЗарплатаКадрыРасширенный.ТаблицаЗначенийВСтруктуру(НоваяТаблицаРаспределения());

КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУсловногоОформления.Отбор, "ТаблицаИстории.Распределяется", Ложь);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КомандаРедактированияРаспределения");
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУсловногоОформления.Отбор, "ТаблицаИстории.Распределяется", Истина);
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаИсторииСпособОтражения");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьРеквизитНаборЗаписей(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("НаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей." + Форма.ИмяРегистра));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
КонецПроцедуры

#КонецОбласти