////////////////////////////////////////////////////////////////////////////////
// Синхронизация Microsoft Exchange (клиент)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет проверку соединения учетной записи Exchange.
//
// Параметры:
//  Узел - ПланОбменаСсылка.СинхронизацияКалендарей - Узел пользователя Exchange.
//
Процедура ПроверитьСоединение(Узел) Экспорт
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка проверки соединения: Не заполнены данные пользователя.'"));
		Возврат;
	КонецЕсли;
	
	Результат = СинхронизацияMSExchangeВызовСервера.ПроверитьСоединение(Узел);
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = НСтр("ru = 'Проверка выполнена успешно.'");
	Иначе
		Результат = СтрШаблон(НСтр("ru = 'Ошибка проверки соединения: %1'"), Результат);
	КонецЕсли;
	ПоказатьПредупреждение(, Результат);
	
КонецПроцедуры


#КонецОбласти