#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("РезультатОтчета", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатОтчета(Отбор) Экспорт
	
	ЛичныеДанныеКандидатов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ЛичныеДанныеКандидатов");
	Если ЛичныеДанныеКандидатов = Неопределено Тогда
		ЛичныеДанныеКандидатов = ЛичныеДанныеКандидатов(КандидатыПоОтбору(Отбор));
	КонецЕсли;
	
	Возврат ДанныеОтчета(Отбор.Вакансия, ЛичныеДанныеКандидатов, 
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "Характеристики"));
	
КонецФункции

// Получает данные для формирования отчета по сравнению характеристик кандидатов.
//
// Параметры:
//  Вакансия	 - СправочникСсылка.Вакансии - вакансия, для которой формируется отчет.
//  ЛичныеДанныеКандидатов - Массив Из СправочникСсылка.ЛичныеДанныеКандидатов -
//   список отбираемых личных данных кандидатов.
//  Характеристики - Неопределено, Массив Из ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала - список этапов
//      работы, по которым сравниваются характеристики.
// 
// Возвращаемое значение:
//   Структура - данные отчета.
//
Функция ДанныеОтчета(Вакансия, ЛичныеДанныеКандидатов, Характеристики = Неопределено)
	
	ДанныеОценок = ЭлектронноеИнтервью.ОценкиКандидатовПоХарактеристикам(Вакансия, 
		ЛичныеДанныеКандидатов, Характеристики, Характеристики <> Неопределено);
		
	ДанныеДетально = ДанныеОценок.Данные;
	УдалитьСтрокиСПустымиДаннымиКандидатов(ДанныеДетально);

	ДанныеСводно = ДанныеОценок.ТаблицаИтогов;
	УдалитьСтрокиСПустымиДаннымиКандидатов(ДанныеСводно);
	
	ОсновнаяТаблица = Новый ТаблицаЗначений;
	Для Каждого ОписаниеКолонки Из ГруппаОбщихКолонок() Цикл
		ОсновнаяТаблица.Колонки.Добавить(ОписаниеКолонки.Имя, ОписаниеКолонки.Тип);
	КонецЦикла;
	
	НомераКолонок = НоваяТаблицаНомераКолонок();
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(
		КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, Вакансия));
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ДанныеКандидатов, "ЛичныеДанныеКандидата");
	
	Номер = 1;
	Для Каждого ТекущаяСтрока Из ДанныеСводно Цикл
		Для Каждого ОписаниеКолонки Из ГруппаКолонокНаКандидата() Цикл
			ОсновнаяТаблица.Колонки.Добавить(ИмяКолонки(ОписаниеКолонки.Имя, Номер), ОписаниеКолонки.Тип);
		КонецЦикла;
		НоваяСтрока = ДобавитьНомерКолонки(НомераКолонок, ТекущаяСтрока.ЛичныеДанныеКандидата, Номер);
		ДанныеКандидата = НайтиСтрокуТаблицы(ДанныеКандидатов, ТекущаяСтрока.ЛичныеДанныеКандидата,
			"ЛичныеДанныеКандидата");
		Если ДанныеКандидата <> Неопределено Тогда
			НоваяСтрока.Кандидат = ДанныеКандидата.Кандидат;
			НоваяСтрока.КандидатСостояние = ДанныеКандидата.Состояние;
		КонецЕсли;
		Номер = Номер + 1;
	КонецЦикла;
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(НомераКолонок, "ЛичныеДанныеКандидата");

	ПредставленияХарактеристик = ПредставленияХарактеристик(Вакансия);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ПредставленияХарактеристик, "Характеристика");

	ДанныеДетально.Сортировать("Характеристика, ЛичныеДанныеКандидата");
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеДетально);
	Пока Обход.СледующийПоЗначениюПоля("Характеристика") Цикл
		НоваяСтрока = ОсновнаяТаблица.Добавить();
		НоваяСтрока.Характеристика = Обход.ТекущиеДанные()["Характеристика"];
		НайденныеСтроки = ПредставленияХарактеристик.НайтиСтроки(Новый Структура("Характеристика",
			НоваяСтрока.Характеристика));
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока.ОсновноеЗначение = Обход.ТекущиеДанные()["ОсновноеЗначение"];
			НоваяСтрока.ЗначенияПредставление = НайденныеСтроки[0].ЗначенияСтрокой;
		КонецЕсли; 
		Пока Обход.СледующийПоЗначениюПоля("ЛичныеДанныеКандидата") Цикл
			Номер = НомерКолонкиЛичныеДанныеКандидата(НомераКолонок, Обход.ТекущиеДанные()["ЛичныеДанныеКандидата"]);
			НоваяСтрока[ИмяКолонки("Значение", Номер)] = Обход.ТекущиеДанные()["Значение"];
			НоваяСтрока[ИмяКолонки("Оценка", Номер)] = Обход.ТекущиеДанные()["Оценка"];
		КонецЦикла;
	КонецЦикла;
	
	ДанныеМотиваторов = ДанныеМотиваторов(Вакансия, ЛичныеДанныеКандидатов);
	ДанныеМотиваторов.Сортировать("ЛичныеДанныеКандидата, Количество Убыв");
		
	Структура = Новый Структура;
	Структура.Вставить("ОсновнаяТаблица", ОсновнаяТаблица);
	Структура.Вставить("ДанныеМотиваторов", ДанныеМотиваторов);
	Структура.Вставить("НомераКолонок", НомераКолонок);
	Структура.Вставить("ДанныеСводно", ДанныеСводно);
	Структура.Вставить("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	
	Возврат Структура;
	
КонецФункции

Функция ХарактеристикиДляОтбора(Вакансия, ЭтапыРаботыСКандидатами) Экспорт
	
	Если ЭтапыРаботыСКандидатами.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЭтапыРаботы", ЭтапыРаботыСКандидатами);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Вакансии.Ссылка КАК Вакансия,
		|	ВЫБОР
		|		КОГДА Вакансии.СоответствуетПрофилюДолжности
		|			ТОГДА Вакансии.ПрофильДолжности
		|		ИНАЧЕ Вакансии.Ссылка
		|	КОНЕЦ КАК ВладелецВопросов,
		|	ЭтапыВакансии.ЭтапРаботы КАК ЭтапРаботы,
		|	ВопросыАнкеты.ЭлементарныйВопрос КАК ЭлементарныйВопрос
		|ПОМЕСТИТЬ ВТВопросыЭтапов
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты КАК ВопросыАнкеты
		|			ПО ЭтапыВакансии.ШаблонАнкеты = ВопросыАнкеты.Владелец
		|			И НЕ ВопросыАнкеты.ЭтоГруппа
		|			И НЕ ВопросыАнкеты.ПометкаУдаления
		|			И ВопросыАнкеты.ЭлементарныйВопрос <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка)
		|		ПО Вакансии.Ссылка = ЭтапыВакансии.Ссылка
		|		И Вакансии.Ссылка = &Вакансия
		|		И ЭтапыВакансии.ЭтапРаботы В (&ЭтапыРаботы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Вакансии.Ссылка,
		|	ВЫБОР
		|		КОГДА Вакансии.СоответствуетПрофилюДолжности
		|			ТОГДА Вакансии.ПрофильДолжности
		|		ИНАЧЕ Вакансии.Ссылка
		|	КОНЕЦ,
		|	ЭтапыВакансии.ЭтапРаботы,
		|	ВопросыКомплексногоВопроса.ЭлементарныйВопрос
		|ИЗ
		|	Справочник.Вакансии КАК Вакансии
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ЭтапыВакансии
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВопросыШаблонаАнкеты.СоставКомплексногоВопроса КАК ВопросыКомплексногоВопроса
		|			ПО ЭтапыВакансии.ШаблонАнкеты = ВопросыКомплексногоВопроса.Ссылка.Владелец
		|			И НЕ ВопросыКомплексногоВопроса.Ссылка.ПометкаУдаления
		|			И
		|				ВопросыКомплексногоВопроса.ЭлементарныйВопрос <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВопросыДляАнкетирования.ПустаяСсылка)
		|		ПО Вакансии.Ссылка = &Вакансия
		|		И Вакансии.Ссылка = ЭтапыВакансии.Ссылка
		|		И ЭтапыВакансии.ЭтапРаботы В (&ЭтапыРаботы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала
		|ИЗ
		|	ВТВопросыЭтапов КАК ВопросыЭтапов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкаВопросовДляСобеседования КАК НастройкаВопросовДляСобеседования
		|		ПО ВопросыЭтапов.ВладелецВопросов = НастройкаВопросовДляСобеседования.Объект
		|		И ВопросыЭтапов.ЭлементарныйВопрос = НастройкаВопросовДляСобеседования.ЭлементарныйВопрос
		|		И
		|			НастройкаВопросовДляСобеседования.ХарактеристикаПерсонала <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ХарактеристикиПерсонала.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ХарактеристикаПерсонала");

КонецФункции

Функция ПредставленияХарактеристик(Вакансия)

	ПредставленияХарактеристик = Новый ТаблицаЗначений;
	ПредставленияХарактеристик.Колонки.Добавить("Характеристика",
		Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"));
	ПредставленияХарактеристик.Колонки.Добавить("ЗначенияСтрокой", Новый ОписаниеТипов("Строка"));

	ПараметрыПолучения = Справочники.Вакансии.ПараметрыПолученияДанныхВакансии();
	ПараметрыПолучения.ХарактеристикиПерсонала = Истина;
	ДанныеВакансии = Справочники.Вакансии.ДанныеВакансии(Вакансия, ПараметрыПолучения);
	
	Обход = Обработки.ОбходКоллекции.НовыйОбход(ДанныеВакансии.ХарактеристикиПерсонала);
	Пока Обход.СледующийПоЗначениюПоля("Характеристика") Цикл
		ЗначенияСтрокой = "";
		Пока Обход.Следующий() Цикл
			Если Не ПустаяСтрока(ЗначенияСтрокой) Тогда
				ЗначенияСтрокой = ЗначенияСтрокой + ", ";
			КонецЕсли;
			ЗначенияСтрокой = ЗначенияСтрокой + Обход.ТекущиеДанные()["Значение"];
		КонецЦикла;
		НоваяСтрока = ПредставленияХарактеристик.Добавить();
		НоваяСтрока.Характеристика = Обход.ТекущиеДанные()["Характеристика"];
		НоваяСтрока.ЗначенияСтрокой = ЗначенияСтрокой;
	КонецЦикла;
	
	Возврат ПредставленияХарактеристик;
	
КонецФункции

Функция ДанныеМотиваторов(Вакансия, ЛичныеДанныеКандидатов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("ЛичныеДанныеКандидатов", ЛичныеДанныеКандидатов);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АнкетыКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	МотиваторыВАнкетах.Мотиватор КАК Мотиватор,
		|	СУММА(МотиваторыВАнкетах.Количество) КАК Количество
		|ИЗ
		|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МотиваторыВАнкетах КАК МотиваторыВАнкетах
		|		ПО АнкетыКандидатов.Анкета = МотиваторыВАнкетах.Анкета
		|ГДЕ
		|	АнкетыКандидатов.Вакансия = &Вакансия
		|	И АнкетыКандидатов.ЛичныеДанныеКандидата В (&ЛичныеДанныеКандидатов)
		|СГРУППИРОВАТЬ ПО
		|	АнкетыКандидатов.ЛичныеДанныеКандидата,
		|	МотиваторыВАнкетах.Мотиватор";
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура УдалитьСтрокиСПустымиДаннымиКандидатов(Таблица)
	
	Индекс = 0;
	Пока Индекс < Таблица.Количество() Цикл
		Если Не ЗначениеЗаполнено(Таблица[Индекс].ЛичныеДанныеКандидата) Тогда
			Таблица.Удалить(Индекс);
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучениеКандидатов

Функция КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов, Вакансия) Экспорт
	
	ТаблицаКандидатов = Справочники.Кандидаты.КандидатыПоЛичнымДаннымКандидатов(ЛичныеДанныеКандидатов);
	
	ОтборКандидатов = Новый Структура();
	ОтборКандидатов.Вставить("Ссылка", ТаблицаКандидатов.ВыгрузитьКолонку("Кандидат"));
	ОтборКандидатов.Вставить("Вакансия", Вакансия);
	
	Возврат Справочники.Кандидаты.КандидатыПоОтбору(ОтборКандидатов);
	
КонецФункции

Функция КандидатыПоОтбору(Отбор)

	ОтборКандидатов = Новый Соответствие;
	ОтборКандидатов.Вставить("Вакансия", Отбор.Вакансия);
	Если Отбор.Свойство("Кандидаты") Тогда
		ОтборКандидатов.Вставить("Ссылка", Отбор.Кандидаты);
	КонецЕсли;

	Если Отбор.ОтборВРаботе Тогда
		ОтборКандидатов.Вставить("Состояние", Перечисления.СостоянияСогласования.Рассматривается);
	КонецЕсли;

	Если Отбор.ОтборПринятыНаРаботу Тогда
		ОтборКандидатов.Вставить("Состояние", Перечисления.СостоянияСогласования.Согласовано);
		Если Отбор.ОтборПериодОдобрения <> ВидыОтбораПериода().Все Тогда
			ОтборКандидатов.Вставить("ДатаРешения", ДатыПериода(Отбор.ОтборПериодОдобрения, ТекущаяДатаСеанса()));
		КонецЕсли;
	КонецЕсли;
	
	Если Отбор.ОтборТекущийЭтапИспользование Тогда
		ОтборКандидатов.Вставить("ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы", Отбор.ОтборТекущийЭтапЗначение);
	КонецЕсли;

	Кандидаты = Справочники.Кандидаты.КандидатыПоОтбору(ОтборКандидатов);
	ОтобратьКандидатовПоДатеАктуальности(Кандидаты, Отбор);
	ОтобратьКандидатовПоПройденномуЭтапу(Кандидаты, Отбор);
	
	Возврат Кандидаты;

КонецФункции

Процедура ОтобратьКандидатовПоДатеАктуальности(Кандидаты, Отбор)
	
	Если Не Отбор.ОтборВРаботе Или Отбор.ОтборПериодВРаботе = ВидыОтбораПериода().Все Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОтбора = ДатыПериода(Отбор.ОтборПериодВРаботе, ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("Начало", ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание", ПериодОтбора.ДатаОкончания);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатыАктуальности.Кандидат
		|ИЗ
		|	(ВЫБРАТЬ
		|		Кандидаты.Ссылка КАК Кандидат,
		|		Кандидаты.ДатаРегистрации КАК ДатаАктуальности
		|	ИЗ
		|		Справочник.Кандидаты КАК Кандидаты
		|	ГДЕ
		|		Кандидаты.Ссылка В (&Кандидаты)
		|		И ДатаРегистрации МЕЖДУ &Начало И &Окончание
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		РаботаСКандидатамиСрез.Кандидат,
		|		РаботаСКандидатамиСрез.Период
		|	ИЗ
		|		РегистрСведений.РаботаСКандидатами.СрезПоследних(&Окончание, Кандидат В (&Кандидаты)) КАК РаботаСКандидатамиСрез
		|	ГДЕ
		|		Период МЕЖДУ &Начало И &Окончание) КАК ДатыАктуальности";

	Кандидаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кандидат");
	
КонецПроцедуры

Процедура ОтобратьКандидатовПоПройденномуЭтапу(Кандидаты, Отбор)
	
	Если Не Отбор.ОтборПройденныйЭтапИспользование Тогда
		Возврат;
	КонецЕсли;
	
	ПериодОтбора = ДатыПериода(Отбор.ОтборПериодЭтапа, ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", Кандидаты);
	Запрос.УстановитьПараметр("ЭтапРаботы", Отбор.ОтборПройденныйЭтапЗначение);
	Запрос.УстановитьПараметр("Начало", ПериодОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("Окончание", ПериодОтбора.ДатаОкончания);
	Запрос.УстановитьПараметр("СостояниеЭтапа", Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РаботаСКандидатами.Кандидат
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|ГДЕ
		|	РаботаСКандидатами.Кандидат В (&Кандидаты)
		|	И РаботаСКандидатами.Период МЕЖДУ &Начало И &Окончание
		|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы
		|	И РаботаСКандидатами.СостояниеЭтапа = &СостояниеЭтапа";

	Кандидаты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Кандидат");
	
КонецПроцедуры

Функция ЛичныеДанныеКандидатов(Кандидаты)

	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Кандидаты);
	ДанныеКандидатов.Свернуть("ЛичныеДанныеКандидата");
	Возврат ДанныеКандидатов.ВыгрузитьКолонку("ЛичныеДанныеКандидата");
	
КонецФункции

#КонецОбласти

Функция ИмяКолонки(Префикс, Номер)
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.ИмяКолонки(Префикс, Номер);
КонецФункции

Функция ГруппаОбщихКолонок() Экспорт
	ГруппаКолонок = Новый Массив;
	ГруппаКолонок.Добавить(ОписаниеКолонки("Характеристика", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("ЗначенияПредставление", Новый ОписаниеТипов("Строка")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("ОсновноеЗначение", Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристик")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("СовпадаетОценка", Новый ОписаниеТипов("Булево")));
	Возврат ГруппаКолонок;
КонецФункции

Функция ГруппаКолонокНаКандидата() Экспорт
	ГруппаКолонок = Новый Массив;
	ГруппаКолонок.Добавить(ОписаниеКолонки("Значение",  Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристик")));
	ГруппаКолонок.Добавить(ОписаниеКолонки("Оценка", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2)));
	Возврат ГруппаКолонок;
КонецФункции

Функция ОписаниеКолонки(Имя, Тип)
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Тип", Тип);
	Возврат Описание;
	
КонецФункции

Функция ВидыОтбораПериода()
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.ВидыОтбораПериода();
КонецФункции

Функция ДатыПериода(ВидОтбора, ТекущаяДата)
	
	ДатыПериода = Новый СтандартныйПериод();
	
	Если ВидОтбора = ВидыОтбораПериода().Неделя Тогда
		ДатыПериода.ДатаНачала = ДобавитьДней(ТекущаяДата, -7);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Месяц Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -1);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().ТриМесяца Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -3);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Полгода Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -6);
	ИначеЕсли ВидОтбора = ВидыОтбораПериода().Год Тогда
		ДатыПериода.ДатаНачала = ДобавитьМесяц(ТекущаяДата, -12);
	КонецЕсли;

	ДатыПериода.ДатаОкончания = КонецДня(ТекущаяДата);

	Возврат ДатыПериода;
	
КонецФункции

Функция ДобавитьДней(Дата, Дней)
	Возврат НачалоДня(Дата) + Дней * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
КонецФункции

Функция НайтиСтрокуТаблицы(Таблица, Значение, ИмяКолонки)
	
	НайденныеСтроки = Таблица.НайтиСтроки(Новый Структура(ИмяКолонки, Значение));

	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

#Область НомераКолонок

Функция НоваяТаблицаНомераКолонок()
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ЛичныеДанныеКандидата", Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	Таблица.Колонки.Добавить("Номер", ОбщегоНазначения.ОписаниеТипаЧисло(10, 0, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	Таблица.Колонки.Добавить("КандидатСостояние", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСогласования"));
	Возврат Таблица;
	
КонецФункции

Функция НомерКолонкиЛичныеДанныеКандидата(НомераКолонок, ЛичныеДанныеКандидата)
	Возврат СравнениеХарактеристикКандидатовКлиентСервер.НомерКолонкиЛичныеДанныеКандидата(НомераКолонок,
		ЛичныеДанныеКандидата);
КонецФункции

Функция ДобавитьНомерКолонки(НомераКолонок, ЛичныеДанныеКандидата, Номер)
	НоваяСтрока = НомераКолонок.Добавить();
	НоваяСтрока.ЛичныеДанныеКандидата = ЛичныеДанныеКандидата;
	НоваяСтрока.Номер = Номер;
	Возврат НоваяСтрока;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли