#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Основание = ПараметрКоманды; // ОпределяемыйТип.ОснованиеНаправленияНаМедицинскийОсмотр
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не Основание.Пустая(),
		НСтр("ru = 'Оформление документа возможно только после записи данных.'"));
	
	ДанныеЗаполнения = ДанныеЗаполнения(Основание);
	ФизическоеЛицо = ДанныеЗаполнения.ФизическоеЛицо;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Если Не ЧтениеРазрешено(ФизическоеЛицо) Тогда
			ТекстИсключения =
				НСтр("ru = 'Доступ к физическому лицу связанному с кандидатом запрещен. Обратитесь к администратору.'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.Форма.ФормаДокумента",
			Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения), ЭтотОбъект);
	ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения.ЛичныеДанныеКандидата) Тогда
		Оповещение = Новый ОписаниеОповещения("НаправитьНаМедосмотрЗавершение", ЭтотОбъект, Основание);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЛичныеДанныеКандидата", ДанныеЗаполнения.ЛичныеДанныеКандидата);
		ПодборПерсоналаКлиент.ОткрытьФормуСозданияФизическогоЛицаПоКандидату(ПараметрыФормы, Оповещение);
	Иначе
		ТекстИсключения =
			НСтр("ru = 'Не найдено связанное с кандидатом физическое лицо. Направление на медосмотр невозможно.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Результат - СправочникСсылка.ФизическиеЛица
//  Основание - ОпределяемыйТип.ОснованиеНаправленияНаМедицинскийОсмотр 
&НаКлиенте
Процедура НаправитьНаМедосмотрЗавершение(Результат, Основание) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.Форма.ФормаДокумента",
			Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения(Основание)), ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Основание - ОпределяемыйТип.ОснованиеНаправленияНаМедицинскийОсмотр
// 
// Возвращаемое значение:
//  см. Документы.НаправлениеНаМедицинскийОсмотр.ДанныеЗаполненияПоОснованию
&НаСервере
Функция ДанныеЗаполнения(Основание)
	
	Возврат Документы.НаправлениеНаМедицинскийОсмотр.ДанныеЗаполненияПоОснованию(Основание);
	
КонецФункции

&НаСервере
Функция ЧтениеРазрешено(Ссылка)

	Возврат УправлениеДоступом.ЧтениеРазрешено(Ссылка);
	
КонецФункции 

#КонецОбласти