#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Замещение Тогда
		МатериальноОтветственныеЛица.МатериальноОтветственныеЛицаПередЗаписью(ЭтотОбъект, Отказ, Замещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ПолучитьФункциональнуюОпцию("УчитыватьМатериальнуюОтветственностьСотрудников") Тогда
		
		// Настройка "УчитыватьМатериальнуюОтветственностьСотрудников" взводится автоматически при записи в регистр.
		// И при записи интерактивно и при записи обменом.
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
			|ИЗ
			|	РегистрСведений.МатериальноОтветственныеЛица КАК МатериальноОтветственныеЛица
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(*) > 0";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			НастройкиКадровогоУчета = РегистрыСведений.НастройкиКадровогоУчета.СоздатьНаборЗаписей();
			НастройкиКадровогоУчета.Прочитать();
			Если НастройкиКадровогоУчета.Количество() > 0 Тогда
				НастройкиКадровогоУчета[0].УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
				НастройкиКадровогоУчета.ДополнительныеСвойства.Вставить("ПроверятьБизнесЛогикуПриЗаписи");
			Иначе
				НоваяЗапись = НастройкиКадровогоУчета.Добавить();
				НоваяЗапись.УчитыватьМатериальнуюОтветственностьСотрудников = Истина;
			КонецЕсли;
			
			НастройкиКадровогоУчета.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли