#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Медицинские осмотры";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Виды работ медицинских осмотров", СтатистикаВидовРаботМедицинскихОсмотров());
	Статистика.Вставить("Вредные факторы №29н(Виды работ медицинских осмотров)", СтатистикаВредныхФакторов());
	Статистика.Вставить("Виды работ медицинских осмотров рабочего места", СтатистикаВидовРаботМедицинскихОсмотровРабочегоМеста());
	Статистика.Вставить("Вредные факторы и виды работ рабочего места", СтатистикаВредныхФакторовИВидовРаботРабочегоМеста());
	Статистика.Вставить("Вредные факторы рабочего места", СтатистикаВредныхФакторовРабочегоМеста());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Заключение медицинского осмотра", СтатистикаЗаключений(НачалоПериода));
	Статистика.Вставить("Направление на медицинский осмотр", СтатистикаНаправлений(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаВидовРаботМедицинскихОсмотров()
	
	Таблица = Метаданные.Справочники.ВидыРаботМедицинскихОсмотров;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Видов работ";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ВидОсмотра;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов осмотра";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаВредныхФакторов()
	
	Родитель = Метаданные.Справочники.ВидыРаботМедицинскихОсмотров;
	Таблица = Родитель.ТабличныеЧасти.СоответствующиеВредныеФакторы;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.ВредныйФактор;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Вредных факторов";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Вид работы";
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов работ";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаЗаключений(НачалоПериода)
	
	Таблица = Метаданные.Документы.ЗаключениеМедицинскогоОсмотра;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Заключений";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.РабочееМесто;
	ДанныеГруппировки.ПредставлениеГруппировки = "Рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаНаправлений(НачалоПериода)
	
	Таблица = Метаданные.Документы.НаправлениеНаМедицинскийОсмотр;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Направлений";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.РабочееМесто;
	ДанныеГруппировки.ПредставлениеГруппировки = "Рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаВидовРаботМедицинскихОсмотровРабочегоМеста()
	
	Таблица = Метаданные.РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.ВидРабот;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Видов работ";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.РабочееМесто;
	ДанныеГруппировки.ПредставлениеГруппировки = "Рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.ВидОсмотра;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов осмотра";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаВредныхФакторовИВидовРаботРабочегоМеста()
	
	Таблица = Метаданные.РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.ВредныйФактор;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Вредных факторов";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.РабочееМесто;
	ДанныеГруппировки.ПредставлениеГруппировки = "Рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.ВидОсмотра;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов осмотра";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаВредныхФакторовРабочегоМеста()
	
	Таблица = Метаданные.РегистрыСведений.ВредныеФакторыРабочегоМеста;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.ВредныйФактор;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Вредных факторов";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.РабочееМесто;
	ДанныеГруппировки.ПредставлениеГруппировки = "Рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.ВидОсмотра;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов осмотра";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти