
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбновлениеВыдачСИЗ.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбновлениеВыдачСИЗ.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#Область ОбменДанными

// Пересчитывает зависимые данные после загрузки сообщения обмена
//
// Параметры:
//		ЗависимыеДанные - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные ведущих данных
//			* ЗависимыеМетаданные - ОбъектМетаданных - Метаданные текущего объекта
//			* ВедущиеДанные - Массив объектов, заполненный при загрузке сообщения обмена
//				по этим объектам требуется обновить зависимые данные
//
Процедура ОбновитьЗависимыеДанныеПослеЗагрузкиОбменаДанными(ЗависимыеДанные) Экспорт
	
	ТаблицаОбновления = СредстваИндивидуальнойЗащиты.НоваяТаблицаОбновлениеВыдачиСИЗ();
	
	ФизическиеЛица = Новый Массив;
	Для Каждого СтрокаТаблицы Из ЗависимыеДанные Цикл
		Если СтрокаТаблицы.ВедущиеМетаданные = Метаданные.Справочники.ФизическиеЛица Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФизическиеЛица, 
				ОбщегоНазначения.ВыгрузитьКолонку(СтрокаТаблицы.ВедущиеДанные, "Ссылка"), Истина);
			Продолжить;
		КонецЕсли;
		ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоРабочимМестам(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоРезультатамВыдачиСИЗ(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоПериодичностиВыдачиСИЗ(ТаблицаОбновления, СтрокаТаблицы);
	КонецЦикла;
	
	СредстваИндивидуальнойЗащиты.ЗаполнитьТаблицуОбновленияВыдачиСИЗПоФизическимЛицам(ТаблицаОбновления, ФизическиеЛица);
	
	СредстваИндивидуальнойЗащиты.ЗарегистрироватьОбновлениеВыдачиСИЗ(ТаблицаОбновления);
	СредстваИндивидуальнойЗащиты.ЗапуститьОбновлениеВыдачСИЗ();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.КадроваяИсторияСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеВыдачиСИЗ, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоРабочимМестам(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.РабочиеМестаСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеВыдачиСИЗ, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоРезультатамВыдачиСИЗ(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.ВыдачиСИЗПоНоменклатуре Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеВыдачиСИЗ, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоПериодичностиВыдачиСИЗ(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.ПериодичностьВыдачиСИЗРабочихМест Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеВыдачиСИЗ, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
