#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке("ФизическоеЛицо", "");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьДанныеДляБронирования(ДанныеБронирования, ЗаявкиНаБронирование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявки", ЗаявкиНаБронирование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗаявкаКомандировка.РезультатВыполнения = ЗНАЧЕНИЕ(Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Согласована,
	|	Заявка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Заявка.Ответственный КАК Ответственный,
	|	Заявка.ДатаНачала КАК ДатаНачала,
	|	Заявка.ДатаОкончания КАК ДатаОкончания,
	|	Заявка.Организация КАК Организация,
	|	Заявка.СистемаБронирования КАК СистемаБронирования,
	|	Заявка.БронироватьБилеты КАК БронироватьБилеты,
	|	Заявка.ВидТранспорта КАК ВидТранспорта,
	|	Заявка.КлассПерелета КАК КлассПерелета,
	|	Заявка.ГородВылета КАК ГородВылета,
	|	Заявка.ГородПрилета КАК ГородПрилета,
	|	Заявка.СтанцияОтправления КАК СтанцияОтправления,
	|	Заявка.СтанцияПрибытия КАК СтанцияПрибытия,
	|	Заявка.ДатаОтправленияТуда КАК ДатаОтправленияТуда,
	|	Заявка.ДатаОтправленияОбратно КАК ДатаОтправленияОбратно,
	|	Заявка.БилетВОдинКонец КАК БилетВОдинКонец,
	|	Заявка.БронироватьПроживание КАК БронироватьПроживание,
	|	Заявка.МестоПроживания КАК МестоПроживания,
	|	Заявка.ВидЗапросаМестаПроживания КАК ВидЗапросаМестаПроживания,
	|	Заявка.ДатаЗаездаПроживания КАК ДатаЗаездаПроживания,
	|	Заявка.ДатаВыездаПроживания КАК ДатаВыездаПроживания,
	|	Заявка.ФамилияВПаспорте КАК ФамилияВПаспорте,
	|	Заявка.ИмяВПаспорте КАК ИмяВПаспорте,
	|	Заявка.ОтчествоВПаспорте КАК ОтчествоВПаспорте,
	|	Заявка.ВидПаспорта КАК ВидПаспорта,
	|	Заявка.НомерПаспорта КАК НомерПаспорта,
	|	Заявка.СрокДействияПаспорта КАК СрокДействияПаспорта,
	|	Заявка.ФамилияЛатиницей КАК ФамилияЛатиницей,
	|	Заявка.ИмяЛатиницей КАК ИмяЛатиницей,
	|	Заявка.ОтчествоЛатиницей КАК ОтчествоЛатиницей,
	|	Заявка.ДатаРождения КАК ДатаРождения,
	|	Заявка.Пол КАК Пол,
	|	Заявка.Гражданство КАК Гражданство,
	|	Заявка.Телефон КАК Телефон,
	|	Заявка.EMail КАК EMail,
	|	Заявка.Пожелания КАК Пожелания
	|ИЗ
	|	Документ.БронированиеБилетовПроживания КАК Заявка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаКомандировкаКабинетСотрудника КАК ЗаявкаКомандировка
	|		ПО Заявка.ОснованиеДокумента = ЗаявкаКомандировка.Ссылка
	|ГДЕ
	|	Заявка.Ссылка В(&Заявки)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеЗаявки = БронированиеКомандировокРасширенный.НовоеОписаниеДанныеЗаявки();
		ЗаполнитьЗначенияСвойств(ДанныеЗаявки, Выборка);
		Если Выборка.ВидПаспорта = Перечисления.ВидыДокументовБронированияБилетовПроживания.ВнутреннийПаспорт Тогда
			ДанныеЗаявки.ВидПаспорта = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ;
		Иначе
			ДанныеЗаявки.ВидПаспорта = Справочники.ВидыДокументовФизическихЛиц.ЗагранпаспортРФ;
		КонецЕсли;
		ДанныеЗаявки.НомерПаспорта = СтрЗаменить(ДанныеЗаявки.НомерПаспорта," ","");
		НоваяПоездка = БронированиеКомандировокРасширенный.ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования, ДанныеЗаявки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли