#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьНаборыПоФизическимЛицам(ЭтотОбъект, Таблица, "ФизическоеЛицо");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ГражданствоКод = Неопределено;
		Если ДанныеЗаполнения.Свойство("ГражданствоКод", ГражданствоКод) И ЗначениеЗаполнено(ГражданствоКод) Тогда
			ДанныеСтраныМира = УправлениеКонтактнойИнформацией.ДанныеСтраныМира(ГражданствоКод);
			Если ДанныеСтраныМира <> Неопределено Тогда
				Если ЗначениеЗаполнено(ДанныеСтраныМира.Ссылка) Тогда
					Гражданство = ДанныеСтраныМира.Ссылка;
				Иначе
					Гражданство = УправлениеКонтактнойИнформацией.СтранаМираПоКодуИлиНаименованию(ГражданствоКод, ДанныеСтраныМира);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ПрежнийОбъект", Ссылка.ПолучитьОбъект());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок")
		Или ЭтоНовый() Или Не ЗначениеЗаполнено(ОснованиеДокумента) Тогда 
		Возврат;
	КонецЕсли;
	
	ПрежнийОбъект = Неопределено;
	ДополнительныеСвойства.Свойство("ПрежнийОбъект", ПрежнийОбъект);
	Если ПрежнийОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОснованиеДокумента, "РезультатВыполнения");
	Если РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена
		И Не ДанныеБронированияЗаявкиИдентичны(ПрежнийОбъект, ЭтотОбъект) Тогда
		БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеБронированияЗаявкиИдентичны(ЗаявкаОбъект1, ЗаявкаОбъект2)
	
	ДанныеБронирования1 = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	ДанныеЗаявки1 = БронированиеКомандировокРасширенный.НовоеОписаниеДанныеЗаявки();
	ЗаполнитьЗначенияСвойств(ДанныеЗаявки1, ЗаявкаОбъект1);
	ДанныеЗаявки1.Согласована = Истина;
	БронированиеКомандировокРасширенный.ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования1, ДанныеЗаявки1);
	
	ДанныеБронирования2 = БронированиеКомандировокРасширенный.ТаблицаПоездок();
	ДанныеЗаявки2 = БронированиеКомандировокРасширенный.НовоеОписаниеДанныеЗаявки();
	ЗаполнитьЗначенияСвойств(ДанныеЗаявки2, ЗаявкаОбъект2);
	ДанныеЗаявки2.Согласована = Истина;
	БронированиеКомандировокРасширенный.ДобавитьПоездкуКДаннымБронирования(ДанныеБронирования2, ДанныеЗаявки2);
	
	Возврат ЗначениеВСтрокуВнутр(ДанныеБронирования1) = ЗначениеВСтрокуВнутр(ДанныеБронирования2);
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли