#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	// Второстепенные реквизиты шапки заполняются в функции ОбновитьВторичныеДанные.
	ФиксацияИзменений.Очистить();
	
	// Заполнение ключевых реквизитов шапки.
	ИменаРеквизитов = "Организация, ДокументОснование, Сотрудник, ДатаПрекращенияОплаты, ОтветНаЗапрос, Ребенок";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбъектКопирования, ИменаРеквизитов);
	
	// Очистка результатов.
	ХранилищеXML = Неопределено;
	ДатаОтправки = Неопределено;
	ИдентификаторСообщения   = "";
	ИдентификаторУведомления = "";
	
	// Восстановление умолчаний для важных параметров.
	ОтключитьПроверкиПроведения = Ложь;
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("Действие")
			И Основание.Действие = "Исправить"
			И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы.ИсправленияДокументов") Тогда
			МодульИсправлениеДокументовЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ИсправлениеДокументовЗарплатаКадры");
			МодульИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(
				ЭтотОбъект,
				Основание.Ссылка,
				,
				,
				Основание);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
			Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
				Основание = ОбщегоНазначенияБЗК.ЗначениеСвойства(Основание, "Основание");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Сотрудники")
		И Не Основание.Пустая() Тогда
		Сотрудник = Основание;
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаявлениеСотрудникаНаВыплатуПособия")
		И Не Основание.Пустая() Тогда
		ИменаРеквизитов = "Организация, Сотрудник, ДокументОснование";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов);
	ИначеЕсли Метаданные().Реквизиты.ДокументОснование.Тип.СодержитТип(ТипЗнч(Основание))
		И ЗначениеЗаполнено(Основание) Тогда
		ДокументОснование = Основание;
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияДляЗаполнения);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		КадровыеДанные = КадровыеДанныеСотрудника();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, КадровыеДанные);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ПараметрыФиксации = Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.ПараметрыФиксацииВторичныхДанных();
		ЗаполнитьДанныеИзОснования(ПараметрыФиксации, Ложь);
	КонецЕсли;
	
	ОбновитьВторичныеДанные();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипСообщения = 10410 Тогда
		ПриПроверкеЗаполненияТипа10410(Отказ, ПроверяемыеРеквизиты);
	Иначе
		ПриПроверкеЗаполненияТипаПВСО(Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
	
	Если ТипПриказа = Перечисления.ОснованияПрекращенияПособийПоУходу.ПриказОДосрочномВыходеНаРаботу
		И ДатаПрекращенияОплаты >= '20240101' Тогда
		ТекстОшибки = НСтр("ru = 'С %1 %2 не является основанием для прекращения пособия по уходу за ребенком.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Формат('20240101', "ДЛФ=DD"), ТипПриказа);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, ТекстОшибки, "ТипПриказа");
	КонецЕсли;
	
	ТекстОшибки = ТекстОшибкиЕслиДокументЗафиксирован();
	Если ТекстОшибки <> "" Тогда
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, Ссылка, ТекстОшибки);
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = ТекстОшибкиЕслиДокументЗафиксирован();
	Если ТекстОшибки <> "" Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ЗаполнитьПрекращаемыеЗаявленияПоДаннымШапки();
	
	ДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	Если ЭтоНовый()
		Или НачалоДня(Дата)     <> НачалоДня(ДоЗаписи.Дата)
		Или Страхователь        <> ДоЗаписи.Страхователь
		Или (ТипСообщения = 104) <> (ДоЗаписи.ТипСообщения = 104)
		Или ((ТипСообщения = 104) И Не ЗначениеЗаполнено(НомерВПределахДня)) Тогда
		ЗаполнитьНомерВПределахДня();
	КонецЕсли;
	
	ЭтоПроведение = (РежимЗаписи = РежимЗаписиДокумента.Проведение
		Или (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись));
	
	Если ТипСообщения = 104 Или ТипСообщения = 10410 Тогда
		Если ЭтоПроведение Тогда
			ТекстXML = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ТекстXML(ЭтотОбъект);
		Иначе
			ТекстXML = "";
		КонецЕсли;
		ХранилищеXML = Новый ХранилищеЗначения(ТекстXML, Новый СжатиеДанных(9));
	Иначе
		ХранилищеXML = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеВторичныхДанных

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	Если Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ОбъектЗафиксирован(ЭтотОбъект) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Модифицирован = Ложь;
	Если ПараметрыФиксации = Неопределено Тогда
		ПараметрыФиксации = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ПараметрыФиксацииВторичныхДанных(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗаполнитьТипСообщения() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеИзОснования(ПараметрыФиксации, Истина) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеОрганизации(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьИдентификаторУведомления() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьРазрешениеНаПроживание(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКонтактыФизическогоЛица(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьНаименованиеПриказа(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПояснениеКПриказу(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДатуПредставленияПакетаДокументов(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеПредставителя(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеРебенкаВШапке(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	ЗаполнитьПрекращаемыеЗаявленияПоДаннымШапки();
	
	Возврат Модифицирован;
КонецФункции

Функция ЗаполнитьТипСообщения()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ТипСообщения") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ОтправлятьЧерезСЭДО Тогда
		НовоеЗначение = 0;
	Иначе
		НовоеЗначение = 10410;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ТипСообщения, НовоеЗначение);
КонецФункции

Функция ЗаполнитьДанныеИзОснования(ПараметрыФиксации, УчитыватьФиксацию) Экспорт
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Ложь;
	КонецЕсли;
	Реквизиты = Новый Структура;
	// Как правило, заполняются поля Организация, Сотрудник, ДатаПрекращенияОплаты, ТипПриказа, ДатаПриказа, НомерПриказа.
	МенеджерОснования = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументОснование);
	МенеджерОснования.ЗаполнитьУведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПоОснованию(ДокументОснование, Реквизиты);
	Если УчитыватьФиксацию Тогда
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитовШапки(ЭтотОбъект, Реквизиты);
		Возврат Истина;
	КонецЕсли;
КонецФункции

Функция ЗаполнитьДанныеОрганизации(ПараметрыФиксации)
	СведенияОСтрахователе = СведенияОСтрахователе();
	Если СведенияОСтрахователе = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИменаРеквизитов = 
	"Страхователь,
	|НаименованиеСтрахователя,
	|РегистрационныйНомерСФР,
	|РегномерСФРГоловнойОрганизации,
	|РегистрационныйНомерФСС,
	|КодПодчиненностиФСС,
	|ДополнительныйКодФСС,
	|НаименованиеТерриториальногоОрганаФСС,
	|ОГРН,
	|ИНН,
	|КПП,
	|ПредставительСФР,
	|ДолжностьПредставителяСФР,
	|ОснованиеПодписиПредставителяСФР";
	Реквизиты = Новый Структура(ИменаРеквизитов);
	
	// Подписанты.
	СведенияОПодписях = ПодписиДокументов.СведенияОПодписяхПоУмолчаниюДляОбъектаМетаданных(Метаданные(), Организация);
	ЗаполнитьЗначенияСвойств(Реквизиты, СведенияОПодписях);
	
	// Организация.
	ЗаполнитьЗначенияСвойств(Реквизиты, СведенияОСтрахователе);
	
	Реквизиты.РегистрационныйНомерСФР = СведенияОСтрахователе.РегНомерСФР;
	Реквизиты.РегномерСФРГоловнойОрганизации = СведенияОСтрахователе.РегНомерСФРГоловнойОрганизации;
	Реквизиты.ИНН = СведенияОСтрахователе.ИННЮЛ;
	Реквизиты.КПП = СведенияОСтрахователе.КППЮЛ;
	Реквизиты.НаименованиеСтрахователя = СведенияОСтрахователе.НаимЮЛПол;
	Если СтрДлина(Реквизиты.НаименованиеСтрахователя) > 135 Тогда
		Реквизиты.НаименованиеСтрахователя = СведенияОСтрахователе.НаимЮЛСокр;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция СведенияОСтрахователе()
	СведенияОСтрахователе = Неопределено;
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат СведенияОСтрахователе;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("СведенияОСтрахователе", СведенияОСтрахователе) Тогда
		Возврат СведенияОСтрахователе;
	КонецЕсли;
	ИменаПолей =
	"Страхователь,
	|РегНомерСФР,
	|РегНомерСФРГоловнойОрганизации,
	|РегистрационныйНомерФСС,
	|КодПодчиненностиФСС,
	|ДополнительныйКодФСС,
	|НаименованиеТерриториальногоОрганаФСС,
	|ОГРН,
	|ИННЮЛ,
	|КППЮЛ,
	|НаимЮЛПол,
	|НаимЮЛСокр,
	|ТелОрганизации_JSON,
	|АдресЭлектроннойПочтыОрганизации";
	СведенияОСтрахователе = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей, Дата);
	ДополнительныеСвойства.Вставить("СведенияОСтрахователе", СведенияОСтрахователе);
	Возврат СведенияОСтрахователе;
КонецФункции

Функция ЗаполнитьИдентификаторУведомления()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ИдентификаторУведомления") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИдентификаторДоНачала = ИдентификаторУведомления;
	
	Если ЗначениеЗаполнено(НомерВПределахДня) Тогда
		ИдентификаторУведомления = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ИдентификаторУведомления(ЭтотОбъект);
	Иначе
		ИдентификаторУведомления = "";
	КонецЕсли;
	
	Возврат ИдентификаторДоНачала <> ИдентификаторУведомления;
КонецФункции

Функция ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации)
	Реквизиты = Новый Структура(
		"СотрудникФамилия,
		|СотрудникИмя,
		|СотрудникОтчество,
		|СотрудникСНИЛС,
		|СотрудникИНН,
		|СотрудникДатаРождения,
		|КодСтраныГражданства,
		|УдостоверениеЛичностиВид,
		|УдостоверениеЛичностиСерия,
		|УдостоверениеЛичностиНомер,
		|УдостоверениеЛичностиДатаВыдачи,
		|УдостоверениеЛичностиКемВыдан,
		|УдостоверениеЛичностиСрокДействия");
	НовоеФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка();
	
	КадровыеДанные = КадровыеДанныеСотрудника();
	Если КадровыеДанные <> Неопределено Тогда
		НовоеФизическоеЛицо = КадровыеДанные.ФизическоеЛицо;
		// ФИО, ИНН, СНИЛС, Дата рождения, Код страны гражданства.
		Реквизиты.СотрудникФамилия      = КадровыеДанные.Фамилия;
		Реквизиты.СотрудникИмя          = КадровыеДанные.Имя;
		Реквизиты.СотрудникОтчество     = КадровыеДанные.Отчество;
		Реквизиты.СотрудникСНИЛС        = КадровыеДанные.СтраховойНомерПФР;
		Реквизиты.СотрудникИНН          = КадровыеДанные.ИНН;
		Реквизиты.СотрудникДатаРождения = КадровыеДанные.ДатаРождения;
		Если ЗначениеЗаполнено(КадровыеДанные.Страна) Тогда
			Реквизиты.КодСтраныГражданства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные.Страна, "Код");
		КонецЕсли;
		// Удостоверение личности.
		Реквизиты.УдостоверениеЛичностиВид          = КадровыеДанные.ДокументВид;
		Реквизиты.УдостоверениеЛичностиСерия        = СокрЛП(КадровыеДанные.ДокументСерия);
		Реквизиты.УдостоверениеЛичностиНомер        = СокрЛП(КадровыеДанные.ДокументНомер);
		Реквизиты.УдостоверениеЛичностиДатаВыдачи   = КадровыеДанные.ДокументДатаВыдачи;
		Реквизиты.УдостоверениеЛичностиКемВыдан     = КадровыеДанные.ДокументКемВыдан;
		Реквизиты.УдостоверениеЛичностиСрокДействия = КадровыеДанные.ДокументСрокДействия;
	КонецЕсли;
	
	ЕстьИзменения = (ФизическоеЛицо <> НовоеФизическоеЛицо);
	ФизическоеЛицо = НовоеФизическоеЛицо;
	
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Функция КадровыеДанныеСотрудника()
	КадровыеДанныеСотрудника = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "КадровыеДанные");
	Если КадровыеДанныеСотрудника = Неопределено Тогда
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат Неопределено;
		КонецЕсли;
		ИменаПолей = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ИменаПолейТребуемыхКадровыхДанных();
		КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, ИменаПолей, Дата);
		Если КадровыеДанныеСотрудника = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(КадровыеДанныеСотрудника) = Тип("Структура") Тогда
		Возврат КадровыеДанныеСотрудника;
	КонецЕсли;
	ИменаПолей = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ИменаПолейТребуемыхКадровыхДанных();
	КадровыеДанные = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(КадровыеДанные, КадровыеДанныеСотрудника);
	ДополнительныеСвойства.Вставить("КадровыеДанные", КадровыеДанные);
	Возврат КадровыеДанные;
КонецФункции

Функция ЗаполнитьРазрешениеНаПроживание(ПараметрыФиксации)
	Реквизиты = Новый Структура("РазрешениеНаПроживаниеВид, РазрешениеНаПроживаниеСерия, РазрешениеНаПроживаниеНомер,
		|РазрешениеНаПроживаниеДатаВыдачи, РазрешениеНаПроживаниеСрокДействия");
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) И Не СЭДОФСС.ГражданствоРФ(КодСтраныГражданства) Тогда
		РазрешениеНаПроживание = Документы.СведенияОЗастрахованномЛицеФСС.НайтиРазрешениеНаПроживание(ФизическоеЛицо, Дата);
		Реквизиты.РазрешениеНаПроживаниеВид          = РазрешениеНаПроживание.Вид;
		Реквизиты.РазрешениеНаПроживаниеСерия        = СокрЛП(РазрешениеНаПроживание.Серия);
		Реквизиты.РазрешениеНаПроживаниеНомер        = СокрЛП(РазрешениеНаПроживание.Номер);
		Реквизиты.РазрешениеНаПроживаниеДатаВыдачи   = РазрешениеНаПроживание.ДатаВыдачи;
		Реквизиты.РазрешениеНаПроживаниеСрокДействия = РазрешениеНаПроживание.СрокДействия;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКонтактыФизическогоЛица(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "АдресРегистрации") Тогда
		Возврат Ложь;
	КонецЕсли;
	КадровыеДанные = КадровыеДанныеСотрудника();
	Если КадровыеДанные = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(АдресРегистрации, КадровыеДанные.АдресПоПрописке);
КонецФункции

Функция ЗаполнитьНаименованиеПриказа(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "НаименованиеПриказа") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаименованиеПриказаДо = НаименованиеПриказа;
	
	ТипыПриказов = Перечисления.ОснованияПрекращенияПособийПоУходу;
	Если ТипПриказа = ТипыПриказов.ПриказОбУвольнении Тогда
		НаименованиеПриказа = НСтр("ru = 'Приказ о прекращении трудовых отношений'");
	ИначеЕсли ТипПриказа = ТипыПриказов.ПриказОДосрочномВыходеНаРаботу Тогда
		НаименованиеПриказа = НСтр("ru = 'Приказ о выходе на работу'");
	ИначеЕсли ТипПриказа = ТипыПриказов.СвидетельствоОСмертиРебенка Тогда
		НаименованиеПриказа = НСтр("ru = 'Свидетельство о смерти ребенка'");
	ИначеЕсли ТипПриказа = ТипыПриказов.ПрекращениеОснованийДляВыплатыПособия Тогда
		НаименованиеПриказа = "";
	ИначеЕсли ТипПриказа = ТипыПриказов.ИнойПриказИлиДокумент Тогда
		НаименованиеПриказа = "";
	Иначе
		НаименованиеПриказа = "";
	КонецЕсли;
	
	Возврат НаименованиеПриказа <> НаименованиеПриказаДо;
КонецФункции

Функция ЗаполнитьПояснениеКПриказу(ПараметрыФиксации)
	Реквизиты = Новый Структура("ПояснениеКПриказу", НаименованиеПриказа);
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьДатуПредставленияПакетаДокументов(ПараметрыФиксации)
	Реквизиты = Новый Структура("ДатаПредставленияПакетаДокументов", Дата);
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКадровыеДанныеПредставителя(ПараметрыФиксации)
	Реквизиты = Новый Структура("ПредставительФамилия, ПредставительИмя, ПредставительОтчество,
		|ТелефонСтрахователя, АдресЭлектроннойПочтыСтрахователя");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредставительСФР) Тогда
		ИменаПолей = "Фамилия, Имя, Отчество, EMailПредставление";
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическогоЛица(Ложь, ПредставительСФР, ИменаПолей, ТекущаяДатаСеанса());
		Если КадровыеДанные <> Неопределено Тогда
			Реквизиты.ПредставительФамилия = КадровыеДанные.Фамилия;
			Реквизиты.ПредставительИмя = КадровыеДанные.Имя;
			Реквизиты.ПредставительОтчество = КадровыеДанные.Отчество;
			Реквизиты.АдресЭлектроннойПочтыСтрахователя = КадровыеДанные.EMailПредставление;
		КонецЕсли;
		
		// Требуемые виды контактной информации.
		ВидТелефонРабочий = КадровыйУчет.ВидКонтактнойИнформацииТелефонРабочийФизическиеЛица();
		// Получение значений контактной информации из базы данных.
		ВидыКИ = Новый Массив;
		ВидыКИ.Добавить(ВидТелефонРабочий);
		ТаблицаКИ = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(ПредставительСФР, , ВидыКИ);
		// Поиск значений нужных видов контактной информации.
		СтрокаКИ = ТаблицаКИ.Найти(ВидТелефонРабочий, "Вид");
		Если СтрокаКИ <> Неопределено Тогда
			Реквизиты.ТелефонСтрахователя = СтрокаКИ.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Реквизиты.ТелефонСтрахователя)
			Или Не ЗначениеЗаполнено(Реквизиты.АдресЭлектроннойПочтыСтрахователя) Тогда
		СведенияОСтрахователе = СведенияОСтрахователе();
		Если СведенияОСтрахователе <> Неопределено Тогда
			Если Не ЗначениеЗаполнено(Реквизиты.ТелефонСтрахователя) Тогда
				Реквизиты.ТелефонСтрахователя = СведенияОСтрахователе.ТелОрганизации_JSON;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Реквизиты.АдресЭлектроннойПочтыСтрахователя) Тогда
				Реквизиты.АдресЭлектроннойПочтыСтрахователя = СведенияОСтрахователе.АдресЭлектроннойПочтыОрганизации;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

#КонецОбласти

#Область ЗаполнениеДанныхРебенка

Функция ЗаполнитьДанныеРебенкаВШапке(ПараметрыФиксации)
	ЕстьИзменения = Ложь;
	Если ТипСообщения = 0 Или ТипСообщения = 104 Тогда
		// Флажок модифицированности возвращать не требуется, т.к. в случае 104 сообщения при наличии изменений 
		// модифицированность уже должна быть установлена в форме (процедура ЗаполнитьПрекращаемыеОтпуска 
		// или вследствии ручных изменений табличной части).
		ЗаполнитьДанныеРебенкаВШапкеНаОснованииТаблицы();
		Возврат ЕстьИзменения;
	КонецЕсли;
	ДанныеОтветаНаЗапрос = Неопределено;
	Если ЗаполнитьОтветНаЗапрос(ДанныеОтветаНаЗапрос) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ЗаполнитьНаОснованииОтветаНаЗапрос(ДанныеОтветаНаЗапрос) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Процедура ЗаполнитьДанныеРебенкаВШапкеНаОснованииТаблицы() Экспорт // Используется в обработчике обновления.
	Если ТипСообщения = 10410 Тогда
		Возврат;
	КонецЕсли;
	Если ПрекращаемыеЗаявления.Количество() > 0 Тогда
		Таблица = ПрекращаемыеЗаявления.Выгрузить();
		УстановитьЗначениеИзТаблицы(ОтветНаЗапрос, Таблица, "ОтветНаЗапрос");
		УстановитьЗначениеИзТаблицы(РебенокФамилия, Таблица, "РебенокФамилия");
		УстановитьЗначениеИзТаблицы(РебенокИмя, Таблица, "РебенокИмя");
		УстановитьЗначениеИзТаблицы(РебенокОтчество, Таблица, "РебенокОтчество");
		УстановитьЗначениеИзТаблицы(РебенокСНИЛС, Таблица, "РебенокСНИЛС");
		УстановитьЗначениеИзТаблицы(РебенокДатаРождения, Таблица, "РебенокДатаРождения");
		УстановитьЗначениеИзТаблицы(Ребенок, Таблица, "Ребенок");
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначениеИзТаблицы(Значение, Таблица, ИмяКолонки)
	Значения = КоллекцииБЗК.УникальныеЗначенияКолонки(Таблица, ИмяКолонки);
	Если Значения.Количество() = 1 Тогда
		Значение = Значения[0];
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьОтветНаЗапрос(ДанныеОтветаНаЗапрос)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ОтветНаЗапрос") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтветНаЗапрос) Тогда
		ИменаРеквизитов = "Сотрудник, ФизическоеЛицо, Ребенок";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОтветНаЗапрос, ИменаРеквизитов);
		Если (Не ЗначениеЗаполнено(ЗначенияРеквизитов.Сотрудник) Или ЗначенияРеквизитов.Сотрудник = Сотрудник)
			И (Не ЗначениеЗаполнено(ЗначенияРеквизитов.ФизическоеЛицо) Или ЗначенияРеквизитов.ФизическоеЛицо = ФизическоеЛицо)
			И (Не ЗначениеЗаполнено(ЗначенияРеквизитов.Ребенок) Или ЗначенияРеквизитов.Ребенок = Ребенок)
			Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	НовоеЗначение = Неопределено;
	
	// Заполнение в табличной части.
	ВсеДанныеОДетях = Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ДанныеОДетях(
		Ссылка,
		Сотрудник,
		ФизическоеЛицо,
		ДатаПрекращенияОплаты,
		Истина);
	Если ВсеДанныеОДетях.Количество() > 0 Тогда
		ДанныеОДетях = ВсеДанныеОДетях.Скопировать(Новый Структура("ЕстьДругоеУведомление", Ложь));
		ДанныеОДетях.Сортировать("ИдентификаторСтрокиРеестра, РебенокИмя, РебенокОтчество");
		Если ДанныеОДетях.Количество() > 0 Тогда
			НовоеЗначение = ДанныеОДетях[0].ОтветНаЗапрос;
			ДополнительныеСвойства.Вставить("ДанныеОДетях", ДанныеОДетях); // См. в форме ФиксацияЗаполнитьРеквизитыОбъекта().
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ОтветНаЗапрос, НовоеЗначение);
КонецФункции

Функция ЗаполнитьНаОснованииОтветаНаЗапрос(ДанныеОтветаНаЗапрос) Экспорт
	Реквизиты = Новый Структура("РебенокФамилия, РебенокИмя, РебенокОтчество,
		|РебенокДатаРождения, РебенокСНИЛС, Ребенок, ИдентификаторСтрокиРеестра");
	Для Каждого КлючИЗначение Из Реквизиты Цикл
		Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, КлючИЗначение.Ключ) Тогда
			Реквизиты.Удалить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Если Реквизиты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДанныеОтветаНаЗапрос = Неопределено И ЗначениеЗаполнено(ОтветНаЗапрос) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Шапка.Ребенок КАК Ребенок,
		|	Шапка.РебенокФамилия КАК РебенокФамилия,
		|	Шапка.РебенокИмя КАК РебенокИмя,
		|	Шапка.РебенокОтчество КАК РебенокОтчество,
		|	Шапка.РебенокДатаРождения КАК РебенокДатаРождения,
		|	Шапка.РебенокСНИЛС КАК РебенокСНИЛС,
		|	Регистрация.РегистрацияНомерРеестра КАК ИдентификаторРеестра
		|ИЗ
		|	Документ.ОтветНаЗапросФССДляРасчетаПособия КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий КАК Регистрация
		|		ПО Шапка.Ссылка = Регистрация.ИсходящийДокумент
		|ГДЕ
		|	Шапка.Ссылка = &ОтветНаЗапрос";
		Запрос.УстановитьПараметр("ОтветНаЗапрос", ОтветНаЗапрос);
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() > 0 Тогда
			Таблица.Колонки.Добавить("ИдентификаторСтрокиРеестра", Новый ОписаниеТипов("Строка"));
			ДанныеОтветаНаЗапрос = Таблица[0];
			Если ЗначениеЗаполнено(ДанныеОтветаНаЗапрос.ИдентификаторРеестра) Тогда
				ДанныеОтветаНаЗапрос.ИдентификаторСтрокиРеестра = ДанныеОтветаНаЗапрос.ИдентификаторРеестра + ":1";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеОтветаНаЗапрос <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, ДанныеОтветаНаЗапрос);
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначенияРеквизитов(ЭтотОбъект, Реквизиты);
КонецФункции

#КонецОбласти

Процедура ЗаполнитьПрекращаемыеЗаявленияПоДаннымШапки()
	Если ТипСообщения = 10410 Тогда
		ПрекращаемыеЗаявления.Очистить();
		ЗаполнитьЗначенияСвойств(ПрекращаемыеЗаявления.Добавить(), ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Функция ЗначенияРеквизитовДоЗаписи()
	ИменаРеквизитов = "Номер, Дата, Страхователь, ТипСообщения, ОтправлятьЧерезСЭДО";
	Если ЭтоНовый() Тогда
		Возврат ОбщегоНазначенияБЗК.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	Иначе
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьНомерВПределахДня() Экспорт
	Если ТипСообщения = 104 Тогда
		НомерВПределахДня = НомерВПределахДня();
	Иначе
		НомерВПределахДня = 0;
	КонецЕсли;
	Если НомерВПределахДня > 9999 Тогда
		ТекстОШибки = НСтр("ru = 'Номер уведомления о прекращении отпуска по уходу %1 от %2 больше 9999. Перенесите документ на другую дату.'");
		ТекстОШибки = СтрШаблон(ТекстОШибки, Номер, Дата);
		ВызватьИсключение ТекстОШибки;
	КонецЕсли;
	ЗаполнитьИдентификаторУведомления();
КонецПроцедуры

Функция НомерВПределахДня()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Уведомление.НомерВПределахДня КАК НомерВПределахДня
	|ИЗ
	|	Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком КАК Уведомление
	|ГДЕ
	|	Уведомление.Дата МЕЖДУ &НачалоДня И &КонецДня
	|	И Уведомление.Страхователь = &Страхователь
	|	И Уведомление.Ссылка <> &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Уведомление.НомерВПределахДня УБЫВ";
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(Дата));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(Дата));
	Запрос.УстановитьПараметр("Страхователь", Страхователь);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерВПределахДня + 1;
	КонецЕсли;
	
	Возврат 1;
КонецФункции

#Область ОбработкаПроверкиЗаполнения

Функция ТекстОшибкиЕслиДокументЗафиксирован()
	Результат = "";
	Если ДополнительныеСвойства.Свойство("ТекстОшибкиЕслиДокументЗафиксирован", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	Если Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ОбъектЗафиксирован(ЭтотОбъект) Тогда
		Результат = СтрШаблон(НСтр("ru = 'Запрещено изменять %1, поскольку оно уже отправлено в ФСС.'"), Ссылка);
	Иначе
		Результат = "";
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ТекстОшибкиЕслиДокументЗафиксирован", Результат);
	Возврат Результат;
КонецФункции

Процедура ПриПроверкеЗаполненияТипа10410(Отказ, ПроверяемыеРеквизиты)
	// ФИО, СНИЛС, Дата рождения, пол ребенка.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокФамилия");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокИмя");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокДатаРождения");
	ПроверкиБЗК.ПроверитьСНИЛС(Отказ, ЭтотОбъект, "РебенокСНИЛС", Ложь);
	
	// Прекращение отпуска по уходу.
	СЭДОФСС.ПроверитьИдентификаторРеестраПВСО(
		Отказ,
		ЭтотОбъект,
		"ИдентификаторСтрокиРеестра",
		"EP",
		18);
	ПараметрыВыбора = Новый Структура("ТипСообщения", ТипСообщения);
	ДанныеВыбора = Перечисления.ОснованияПрекращенияПособийПоУходу.ПолучитьДанныеВыбора(ПараметрыВыбора);
	Если ДанныеВыбора.НайтиПоЗначению(ТипПриказа) = Неопределено Тогда
		Текст = НСтр("ru = 'Неверный тип приказа'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ТипПриказа");
	КонецЕсли;
	Если ТипПриказа = Перечисления.ОснованияПрекращенияПособийПоУходу.ИнойПриказИлиДокумент Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПояснениеКПриказу");
	КонецЕсли;
	
	// Отправитель.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ТелефонСтрахователя");
	
	// Уникальность выбранных документов среди уведомлений не проверяется т.к., по одному ответу на запрос может быть
	// несколько уведомлений (если первое не принято, то можно исправить и отправить еще раз).
КонецПроцедуры

Процедура ПриПроверкеЗаполненияТипаПВСО(Отказ, ПроверяемыеРеквизиты)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПрекращаемыеЗаявления", ПрекращаемыеЗаявления.Выгрузить());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрекращаемыеЗаявления.НомерСтроки КАК НомерСтроки,
	|	ПрекращаемыеЗаявления.Заявление КАК Заявление,
	|	ПрекращаемыеЗаявления.ОтветНаЗапрос КАК ОтветНаЗапрос
	|ПОМЕСТИТЬ ВТПрекращаемыеЗаявления
	|ИЗ
	|	&ПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрекращаемыеЗаявления1.Заявление КАК Дубль,
	|	""Заявление"" КАК ИмяПоля,
	|	ПрекращаемыеЗаявления1.НомерСтроки КАК НомерСтроки1,
	|	ПрекращаемыеЗаявления2.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления2
	|		ПО ПрекращаемыеЗаявления1.Заявление = ПрекращаемыеЗаявления2.Заявление
	|			И (ПрекращаемыеЗаявления1.Заявление <> ЗНАЧЕНИЕ(Документ.ЗаявлениеСотрудникаНаВыплатуПособия.ПустаяСсылка))
	|			И ПрекращаемыеЗаявления1.НомерСтроки < ПрекращаемыеЗаявления2.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрекращаемыеЗаявления1.ОтветНаЗапрос,
	|	""ОтветНаЗапрос"",
	|	ПрекращаемыеЗаявления1.НомерСтроки,
	|	ПрекращаемыеЗаявления2.НомерСтроки
	|ИЗ
	|	ВТПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления2
	|		ПО ПрекращаемыеЗаявления1.ОтветНаЗапрос = ПрекращаемыеЗаявления2.ОтветНаЗапрос
	|			И (ПрекращаемыеЗаявления1.ОтветНаЗапрос <> ЗНАЧЕНИЕ(Документ.ОтветНаЗапросФССДляРасчетаПособия.ПустаяСсылка))
	|			И ПрекращаемыеЗаявления1.НомерСтроки < ПрекращаемыеЗаявления2.НомерСтроки";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Текст = НСтр("ru = 'Документ ""%1"" уже выбран в строке %2.'");
		Текст = СтрШаблон(Текст, СтрокаТаблицы.Дубль, СтрокаТаблицы.НомерСтроки1);
		СообщенияБЗК.СообщитьОбОшибкеВСтрокеТаблицы(
			Отказ,
			ЭтотОбъект,
			"ПрекращаемыеЗаявления",
			СтрокаТаблицы,
			СтрокаТаблицы.ИмяПоля,
			Текст);
	КонецЦикла;
	
	Если ТипСообщения <> 104 Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "АдресЭлектроннойПочтыСтрахователя");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПрекращаемыеЗаявления.Ребенок");
	КонецЕсли;
	
	Если ОтправлятьЧерезПрямыеВыплаты Тогда
		ОбщегоНазначенияБЗК.ДобавитьЗначениеВМассив(ПроверяемыеРеквизиты, "ПрекращаемыеЗаявления.Заявление");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ПрекращаемыеЗаявления", ПрекращаемыеЗаявления.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрекращаемыеЗаявления.НомерСтроки КАК НомерСтроки,
		|	ПрекращаемыеЗаявления.Заявление КАК Заявление
		|ПОМЕСТИТЬ ВТПрекращаемыеЗаявления
		|ИЗ
		|	&ПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрекращаемыеЗаявления.НомерСтроки КАК НомерСтроки,
		|	ПрочиеПрекращаемыеЗаявления.Ссылка КАК Ссылка,
		|	ПрочиеПрекращаемыеЗаявления.Заявление КАК Заявление
		|ИЗ
		|	ВТПрекращаемыеЗаявления КАК ПрекращаемыеЗаявления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.ПрекращаемыеЗаявления КАК ПрочиеПрекращаемыеЗаявления
		|		ПО ПрекращаемыеЗаявления.Заявление = ПрочиеПрекращаемыеЗаявления.Заявление
		|			И (ПрочиеПрекращаемыеЗаявления.Ссылка <> &Ссылка)
		|			И (ПрекращаемыеЗаявления.Заявление <> ЗНАЧЕНИЕ(Документ.ЗаявлениеСотрудникаНаВыплатуПособия.ПустаяСсылка))
		|			И (НЕ ПрочиеПрекращаемыеЗаявления.Ссылка.ПометкаУдаления)
		|			И (ПрочиеПрекращаемыеЗаявления.Ссылка.ОтправлятьЧерезПрямыеВыплаты)";
		Таблица = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			Текст = СтрШаблон(НСтр("ru = 'Документ ""%1"" уже использован в документе ""%2"".'"), СтрокаТаблицы.Заявление, СтрокаТаблицы.Ссылка);
			СообщенияБЗК.СообщитьОбОшибкеВСтрокеТаблицы(Отказ, ЭтотОбъект, "ПрекращаемыеЗаявления", СтрокаТаблицы, "Заявление", Текст);
		КонецЦикла;
	КонецЕсли;
	
	Если ТипСообщения = 104 Тогда
		Для Каждого СтрокаТаблицы Из ПрекращаемыеЗаявления Цикл
			СЭДОФСС.ПроверитьИдентификаторРеестраВСтрокеТаблицы(
				Отказ,
				ЭтотОбъект,
				"ПрекращаемыеЗаявления",
				СтрокаТаблицы,
				"ИдентификаторСтрокиРеестра",
				"EP",
				18);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
