
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение расшифровки отчета.
//
// Параметры:
//  ОтчетДанныеРасшифровки -Строка - Адрес во временном хранилище расшифровки отчета.
//  Расшифровка            - ИдентификаторРасшифровкиКомпоновкиДанных - Расшифровка ячейки.
//
// Возвращаемое значение:
//  Произвольный
// 
Функция ДанныеЭлементаРасшифровки(ОтчетДанныеРасшифровки, Расшифровка) Экспорт
	
	Данные = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	ЭлементРасшифровки = Данные.Элементы.Получить(Расшифровка);
	
	Поля = ЭлементРасшифровки.ПолучитьПоля();
	
	ДанныеЭлементаРасшифровки = "";
	Если Поля.Количество() Тогда
		ДанныеЭлементаРасшифровки = Поля[0].Значение;
	КонецЕсли;
	
	Возврат ДанныеЭлементаРасшифровки;

КонецФункции

// Формирует дополнительные пункты меню в дополнительной расшифровке тематических отчетов.
//
// Параметры:
//  ОтчетДанныеРасшифровки   - Строка - Адрес во временном хранилище расшифровки отчета.
//  Расшифровка              - Произвольный - Индекс расшифровки.
//  ДополнительныеПунктыМеню - СписокЗначений.
//  ПараметрыРасшифровки     - Структура, см. ЗарплатаКадрыРасширенныйКлиент.НовыеПараметрыДополнительнойРасшифровкиОтчета.
//
// Возвращаемое значение:
//  СписокЗначений
// 
Функция ДействияДополнительнойРасшифровкиОтчета(ОтчетДанныеРасшифровки, Расшифровка, ПараметрыРасшифровки) Экспорт
	
	ДополнительныеПунктыМеню = Новый СписокЗначений;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	ПоляРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка).ПолучитьПоля();
	
	РасшифрованоПолеДляЗаполнения = Ложь;
	Для Каждого ИмяПоля Из ПараметрыРасшифровки.ИменаПолейРасшифровки Цикл
		Если ПоляРасшифровки.Найти(ИмяПоля) <> Неопределено Тогда
			РасшифрованоПолеДляЗаполнения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыРасшифровки.ВариантОтчетаДляЗаполнения И РасшифрованоПолеДляЗаполнения Тогда
		Для Каждого ИмяДокумента Из ПараметрыРасшифровки.ИменаДокументов Цикл
			Документ = Метаданные.Документы[ИмяДокумента];
			Если ПравоДоступа("Добавление", Документ) Тогда
				ДополнительныеПунктыМеню.Добавить("ЗаполнитьДокумент" + ИмяДокумента, НСтр("ru = 'Заполнить '") + Документ.Синоним);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Если ПараметрыРасшифровки.РегистраторРасшифровки <> Неопределено Тогда
		ДополнительныеПунктыМеню.Добавить("ОткрытьРегистратор", СтрШаблон(НСтр("ru = 'Открыть ""Регистратор = %1""'"), ПараметрыРасшифровки.РегистраторРасшифровки));
	Иначе
		ДополнительныеПунктыМеню.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение, НСтр("ru = 'Открыть'"));
	КонецЕсли;
	
	Возврат ДополнительныеПунктыМеню;
	
КонецФункции

// Формирует адрес во временном хранилище таблицы значений - результата выполнения отчета с простой структурой без группировок по выбранным полям для заполнения документа.
// Предназначена для кеширования результата выполнения отчета после переформирования.
//
// Параметры:
//  ИсходныйКомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных отчета для получения текущих настроек и отборов.
//  ИмяОтчета                   - Строка - Имя отчета.
//  ИмяМакета                   - Строка - Имя макета СКД.
//  МассивПолей                 - Массив - Имена выбранных полей СКД.
//
// Возвращаемое значение:
//  Строка - адрес во временном хранилище.
// 
Функция ХранилищеТаблицыРезультатаОтчета(ИсходныйКомпоновщикНастроек, ИмяОтчета, ИмяМакета, МассивПолей, МенеджерВременныхТаблиц) Экспорт
	
	ДанныеОтчета = Новый ТаблицаЗначений;
	
	СхемаКомпоновки = Отчеты[ИмяОтчета].ПолучитьМакет(ИмяМакета);
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", СхемаКомпоновки));

	НастройкиОтчета = ИсходныйКомпоновщикНастроек.ПолучитьНастройки();
	
	НастройкиОтчета.Структура.Очистить();
	НастройкиОтчета.Выбор.Элементы.Очистить();
	
	ГруппировкаОтчета = НастройкиОтчета.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаОтчета.ПоляГруппировки.Элементы.Очистить();
	ГруппировкаОтчета.Выбор.Элементы.Очистить();
	ГруппировкаОтчета.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Для Каждого Поле Из МассивПолей Цикл
		ОтчетыСервер.ДобавитьВыбранноеПоле(НастройкиОтчета.Выбор, Поле);
	КонецЦикла;
	
	МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(СхемаКомпоновки, НастройкиОтчета);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина,,МенеджерВременныхТаблиц);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	СтрокаПолей = СтрЗаменить(СтрСоединить(МассивПолей, ","), ".", "");
	ДанныеОтчета.Свернуть(СтрокаПолей);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОтчета, Новый УникальныйИдентификатор());
	
КонецФункции

// Формирует массив структур на основе значений расшифровок выделенных ячеек отчета для заполнения документа.
//
// Параметры:
//  ОтчетДанныеРасшифровки    - Строка - Адрес во временном хранилище расшифровки отчета.
//  ХранилищеРезультатаОтчета - Строка - Адрес во временном хранилище таблицы значений расшифровок отчета.
//  МассивРасшифровок         - Массив - Элементы типа ИдентификаторРасшифровкиКомпоновкиДанных - Расшифровки выделенных ячеек.
//  МассивПолейОтбора         - Массив - Имена полей расшифровки отчета (пути к полям СКД) для отбора строк таблицы расшифровок.
//  МассивГруппировок         - Массив - Имена колонок таблицы значений расшифровок для реквизитов шапки документа.
//  МассивКолонок             - Массив - Имена колонок таблицы значений расшифровок для реквизитов табличной части документа.
//
// Возвращаемое значение:
//  МассивДанных - Массив из структур для заполнения документов с реквизитами шапки и массивом структур МассивСтрок для табличной части.
// 
Функция ДанныеРасшифровкиИзОтчета(ОтчетДанныеРасшифровки, ХранилищеРезультатаОтчета, МассивРасшифровок, МассивПолейОтбора, МассивГруппировок, МассивКолонок) Экспорт
	
	МассивДанных = Новый Массив;
	Если Не МассивГруппировок.Количество() Тогда
		Возврат МассивДанных;
	КонецЕсли;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(ОтчетДанныеРасшифровки);
	ТаблицаРасшифровок = ПолучитьИзВременногоХранилища(ХранилищеРезультатаОтчета);
	
	МассивВсехПолей = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВсехПолей, МассивГруппировок);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВсехПолей, МассивКолонок, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВсехПолей, МассивПолейОтбора, Истина);
	
	ИменаГруппировок = СтрСоединить(МассивГруппировок, ",");
	ИменаКолонок = СтрСоединить(МассивКолонок, ",");
	ИменаВсехПолей = СтрЗаменить(СтрСоединить(МассивВсехПолей, ","), ".", "");

	СтруктураПараметров = Новый Структура;
	
	Для Каждого ИмяПоля Из МассивПолейОтбора Цикл
		МассивЗначений = Новый Массив;
		Для Каждого Расшифровка Из МассивРасшифровок Цикл
			ЭлементРасшифровки = ДанныеРасшифровки.Элементы.Получить(Расшифровка);
			ПоляРасшифровки = ЭлементРасшифровки.ПолучитьПоля();
			Поле = ПоляРасшифровки.Найти(ИмяПоля);
			Если Поле <> Неопределено Тогда
				МассивЗначений.Добавить(Поле.Значение);
			КонецЕсли;
		КонецЦикла;
		СтруктураПараметров.Вставить(СтрЗаменить(ИмяПоля, ".", ""), МассивЗначений);
	КонецЦикла;
	
	Запрос = ЗапросДанныхРасшифровкиОтчета(ТаблицаРасшифровок, СтруктураПараметров, ИменаВсехПолей, ИменаГруппировок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураДокумента = Новый Структура(ИменаГруппировок);
	МассивСтрок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		СбросШапки = Ложь;
		
		Для Каждого Колонка Из МассивГруппировок Цикл
			Если Выборка[Колонка] <> СтруктураДокумента[Колонка] Тогда
				СбросШапки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СбросШапки Тогда
			СтруктураДокумента = Новый Структура(ИменаГруппировок);
			ЗаполнитьЗначенияСвойств(СтруктураДокумента, Выборка);
			МассивСтрок = Новый Массив;
			СтруктураДокумента.Вставить("МассивСтрок", МассивСтрок);
			МассивДанных.Добавить(СтруктураДокумента);
		КонецЕсли;
		
		СтруктураКолонок = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураКолонок, Выборка);
		МассивСтрок.Добавить(СтруктураКолонок);
		
	КонецЦикла;
	
	Возврат МассивДанных;

КонецФункции

Функция ЗапросДанныхРасшифровкиОтчета(ДанныеОтчета, СтруктураПараметров, ИменаВсехПолей, ИменаГруппировок)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРасшифровок", ДанныеОтчета);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&ИменаВсехПолей
	|ПОМЕСТИТЬ ВТРасшифровок
	|ИЗ
	|	&ТаблицаРасшифровок КАК ТаблицаРасшифровок";
	
	РазделительТаблиц = ОбщегоНазначения.РазделительПакетаЗапросов();
	ТекстЗапроса = ТекстЗапроса + РазделительТаблиц;
	
	РазделительОбъединения = ОбщегоНазначения.ТекстОбъединитьВсе();

	ТекстыЗапросов = Новый Массив;
	ПервыйЭлемент = Истина;
	
	Для Каждого Элемент Из СтруктураПараметров Цикл
		
		Если ПервыйЭлемент Тогда
			ПервыйЭлемент = Ложь;
			ТекстЗапросаУсловие =
			"ВЫБРАТЬ
			|	&ИменаВсехПолей
			|ПОМЕСТИТЬ ВТОтобранных
			|ИЗ
			|	ВТРасшифровок КАК ВТРасшифровок
			|ГДЕ
			|	&Условие";
		Иначе
			ТекстЗапросаУсловие =
			"ВЫБРАТЬ
			|	&ИменаВсехПолей
			|ИЗ
			|	ВТРасшифровок КАК ВТРасшифровок
			|ГДЕ
			|	&Условие";
		КонецЕсли;
		
		ТекстЗапросаУсловие = СтрЗаменить(ТекстЗапросаУсловие, "&Условие", Элемент.Ключ + " В (&" + Элемент.Ключ + ")");
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
		
		ТекстыЗапросов.Добавить(ТекстЗапросаУсловие);

	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + СтрСоединить(ТекстыЗапросов, РазделительОбъединения);
	ТекстЗапроса = ТекстЗапроса + РазделительТаблиц;
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	&ИменаВсехПолей
	|ИЗ
	|	ВТОтобранных КАК ВТОтобранных
	|
	|СГРУППИРОВАТЬ ПО
	|	&ИменаВсехПолей
	|
	|УПОРЯДОЧИТЬ ПО
	|	&ИменаГруппировок";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИменаВсехПолей", ИменаВсехПолей);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИменаГруппировок", ИменаГруппировок);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
