#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

Функция ДанныеШтатногоРасписания(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияДляФРМОШтатныеЕдиницы.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	СведенияДляФРМОШтатныеЕдиницы.НаименованиеПодразделения КАК НаименованиеПодразделения,
	|	СведенияДляФРМОШтатныеЕдиницы.ИдентификаторОтделенияИлиКабинета КАК ИдентификаторОтделенияИлиКабинета,
	|	СведенияДляФРМОШтатныеЕдиницы.НаименованиеОтделенияИлиКабинета КАК НаименованиеОтделенияИлиКабинета,
	|	ЕСТЬNULL(КлассификаторМедицинскаяДолжностьФРМР.НаименованиеПолное, """") КАК ДолжностьНаименование,
	|	ЕСТЬNULL(КлассификаторМедицинскаяДолжностьФРМР.Код, """") КАК ДолжностьКод,
	|	ЕСТЬNULL(КлассификаторФедеральнаяДолжностьФРМР.НаименованиеПолное, """") КАК ДолжностьПоФедСправочникуНаименование,
	|	ЕСТЬNULL(КлассификаторФедеральнаяДолжностьФРМР.Код, """") КАК ДолжностьПоФедСправочникуКод,
	|	СведенияДляФРМОШтатныеЕдиницы.КоличествоСтавок КАК КоличествоСтавок,
	|	СведенияДляФРМОШтатныеЕдиницы.Описание КАК Описание
	|ПОМЕСТИТЬ ВТТаблицаПредварительно
	|ИЗ
	|	Документ.СведенияДляФРМО.ШтатныеЕдиницы КАК СведенияДляФРМОШтатныеЕдиницы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК КлассификаторМедицинскаяДолжностьФРМР
	|		ПО (КлассификаторМедицинскаяДолжностьФРМР.Ссылка = СведенияДляФРМОШтатныеЕдиницы.МедицинскаяДолжностьФРМР)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК КлассификаторФедеральнаяДолжностьФРМР
	|		ПО (КлассификаторФедеральнаяДолжностьФРМР.Ссылка = СведенияДляФРМОШтатныеЕдиницы.ФедеральнаяДолжностьФРМР)
	|ГДЕ
	|	СведенияДляФРМОШтатныеЕдиницы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПредварительно.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	ТаблицаПредварительно.НаименованиеПодразделения КАК НаименованиеПодразделения,
	|	ТаблицаПредварительно.ИдентификаторОтделенияИлиКабинета КАК ИдентификаторОтделенияИлиКабинета,
	|	ТаблицаПредварительно.НаименованиеОтделенияИлиКабинета КАК НаименованиеОтделенияИлиКабинета,
	|	ТаблицаПредварительно.ДолжностьНаименование КАК ДолжностьНаименование,
	|	ТаблицаПредварительно.ДолжностьКод КАК ДолжностьКод,
	|	ТаблицаПредварительно.ДолжностьПоФедСправочникуНаименование КАК ДолжностьПоФедСправочникуНаименование,
	|	ТаблицаПредварительно.ДолжностьПоФедСправочникуКод КАК ДолжностьПоФедСправочникуКод,
	|	СУММА(ТаблицаПредварительно.КоличествоСтавок) КАК КоличествоСтавок,
	|	"""" КАК Описание
	|ИЗ
	|	ВТТаблицаПредварительно КАК ТаблицаПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПредварительно.ИдентификаторПодразделения,
	|	ТаблицаПредварительно.НаименованиеПодразделения,
	|	ТаблицаПредварительно.ИдентификаторОтделенияИлиКабинета,
	|	ТаблицаПредварительно.НаименованиеОтделенияИлиКабинета,
	|	ТаблицаПредварительно.ДолжностьНаименование,
	|	ТаблицаПредварительно.ДолжностьКод,
	|	ТаблицаПредварительно.ДолжностьПоФедСправочникуНаименование,
	|	ТаблицаПредварительно.ДолжностьПоФедСправочникуКод";
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ДанныеЗаработнойПлаты(ДокументСсылка) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.ХарактеристикаКод КАК Код,
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.Объект КАК Начисление
	|ПОМЕСТИТЬ ВТНазначенияНачислений
	|ИЗ
	|	ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиНазначениеНачисленияПоМедРегистру
	|ГДЕ
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидыНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.ХарактеристикаКод КАК Код,
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.Объект КАК Удержание
	|ПОМЕСТИТЬ ВТНазначенияУдержаний
	|ИЗ
	|	ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиНазначениеУдержанияПоМедРегистру
	|ГДЕ
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидыУдержаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеНачислений.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	ДанныеНачислений.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	ДанныеНачислений.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	ДанныеНачислений.ИдентификаторОтделения КАК ИдентификаторОтделения,
	|	ЕСТЬNULL(КлассификаторФедеральнаяДолжностьФРМР.Код, """") КАК ДолжностьПоФедеральномуСправочникуКод,
	|	ДанныеНачислений.Сотрудник КАК Сотрудник,
	|	ДанныеНачислений.Подразделение КАК Подразделение,
	|	ДанныеНачислений.Должность КАК Должность,
	|	ИСТИНА КАК ЭтоНачисление,
	|	ЕСТЬNULL(НазначенияНачислений.Код, """") КАК НазначениеКод,
	|	ДанныеНачислений.КФО КАК КФО,
	|	ДанныеНачислений.СуммаНачисления КАК Сумма
	|ПОМЕСТИТЬ ВТДанныеЗаработнойПлатыПредварительно
	|ИЗ
	|	Документ.СведенияДляФРМО.ДанныеНачислений КАК ДанныеНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК КлассификаторФедеральнаяДолжностьФРМР
	|		ПО (КлассификаторФедеральнаяДолжностьФРМР.Ссылка = ДанныеНачислений.ФедеральнаяДолжностьФРМР)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНазначенияНачислений КАК НазначенияНачислений
	|		ПО (НазначенияНачислений.Начисление = ДанныеНачислений.Начисление)
	|ГДЕ
	|	ДанныеНачислений.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеУдержаний.ИдентификаторЗанятости,
	|	ДанныеУдержаний.ИдентификаторЛичногоДела,
	|	ДанныеУдержаний.ИдентификаторПодразделения,
	|	ДанныеУдержаний.ИдентификаторОтделения,
	|	ЕСТЬNULL(КлассификаторФедеральнаяДолжностьФРМР.Код, """"),
	|	ДанныеУдержаний.Сотрудник,
	|	ДанныеУдержаний.Подразделение,
	|	ДанныеУдержаний.Должность,
	|	ЛОЖЬ,
	|	ЕСТЬNULL(НазначенияУдержаний.Код, """"),
	|	ДанныеУдержаний.КФО,
	|	ДанныеУдержаний.СуммаУдержания
	|ИЗ
	|	Документ.СведенияДляФРМО.ДанныеУдержаний КАК ДанныеУдержаний
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК КлассификаторФедеральнаяДолжностьФРМР
	|		ПО (КлассификаторФедеральнаяДолжностьФРМР.Ссылка = ДанныеУдержаний.ФедеральнаяДолжностьФРМР)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНазначенияУдержаний КАК НазначенияУдержаний
	|		ПО (НазначенияУдержаний.Удержание = ДанныеУдержаний.Удержание)
	|ГДЕ
	|	ДанныеУдержаний.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторОтделения КАК ИдентификаторОтделения,
	|	ВТДанныеЗаработнойПлатыПредварительно.ДолжностьПоФедеральномуСправочникуКод КАК ДолжностьПоФедеральномуСправочникуКод,
	|	ВТДанныеЗаработнойПлатыПредварительно.Сотрудник КАК Сотрудник,
	|	ВТДанныеЗаработнойПлатыПредварительно.Подразделение КАК Подразделение,
	|	ВТДанныеЗаработнойПлатыПредварительно.Должность КАК Должность,
	|	ВТДанныеЗаработнойПлатыПредварительно.ЭтоНачисление КАК ЭтоНачисление,
	|	ВТДанныеЗаработнойПлатыПредварительно.НазначениеКод КАК НазначениеКод,
	|	ВТДанныеЗаработнойПлатыПредварительно.КФО КАК КФО,
	|	СУММА(ВТДанныеЗаработнойПлатыПредварительно.Сумма) КАК Сумма
	|ИЗ
	|	ВТДанныеЗаработнойПлатыПредварительно КАК ВТДанныеЗаработнойПлатыПредварительно
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторЗанятости,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторЛичногоДела,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторПодразделения,
	|	ВТДанныеЗаработнойПлатыПредварительно.ИдентификаторОтделения,
	|	ВТДанныеЗаработнойПлатыПредварительно.ДолжностьПоФедеральномуСправочникуКод,
	|	ВТДанныеЗаработнойПлатыПредварительно.Сотрудник,
	|	ВТДанныеЗаработнойПлатыПредварительно.Подразделение,
	|	ВТДанныеЗаработнойПлатыПредварительно.Должность,
	|	ВТДанныеЗаработнойПлатыПредварительно.ЭтоНачисление,
	|	ВТДанныеЗаработнойПлатыПредварительно.НазначениеКод,
	|	ВТДанныеЗаработнойПлатыПредварительно.КФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторЗанятости,
	|	ИдентификаторЛичногоДела,
	|	ИдентификаторПодразделения,
	|	ИдентификаторОтделения,
	|	ДолжностьПоФедеральномуСправочникуКод";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументСсылка);
	Запрос.УстановитьПараметр("КлассификаторВидыНачислений", "1.2.643.5.1.13.13.99.2.1106");
	Запрос.УстановитьПараметр("КлассификаторВидыУдержаний", "1.2.643.5.1.13.13.99.2.1107");
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеНачисленийЗаработнойПлаты = Новый Массив;
	Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторЗанятости") Цикл 
		Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторЛичногоДела") Цикл 
			Пока Выборка.СледующийПоЗначениюПоля("ИдентификаторПодразделения") Цикл 
				Пока Выборка.СледующийПоЗначениюПоля("ДолжностьПоФедеральномуСправочникуКод") Цикл
					ЗаписьЗП = Новый Структура();
					ЗаписьЗП.Вставить("Сотрудник", Выборка.Сотрудник);
					ЗаписьЗП.Вставить("Подразделение", Выборка.Подразделение);
					ЗаписьЗП.Вставить("Должность", Выборка.Должность);
					ЗаписьЗП.Вставить("ИдЗанятости", Выборка.ИдентификаторЗанятости);
					ЗаписьЗП.Вставить("ИдЛичногоДела", Выборка.ИдентификаторЛичногоДела);
					ЗаписьЗП.Вставить("ИдПодразделения", Выборка.ИдентификаторПодразделения);
					ЗаписьЗП.Вставить("ИдОтделения", Выборка.ИдентификаторОтделения);
					ЗаписьЗП.Вставить("ДолжностьКод", Выборка.ДолжностьПоФедеральномуСправочникуКод);
					ЗаписьЗП.Вставить("Суммы", Новый Массив);
					Пока Выборка.СледующийПоЗначениюПоля("ЭтоНачисление") Цикл 
						Пока Выборка.СледующийПоЗначениюПоля("НазначениеКод") Цикл 
							Пока Выборка.СледующийПоЗначениюПоля("КФО") Цикл 
								ЗаписьНачисления = Новый Структура();	
								ЗаписьНачисления.Вставить("ЭтоНачисление", Выборка.ЭтоНачисление);
								ЗаписьНачисления.Вставить("НазначениеКод", Выборка.НазначениеКод);
								ЗаписьНачисления.Вставить("КФО", Выборка.КФО);
								ЗаписьНачисления.Вставить("Сумма", Выборка.Сумма);
								ЗаписьЗП.Суммы.Добавить(ЗаписьНачисления);
							КонецЦикла;	
						КонецЦикла;
					КонецЦикла;
					ДанныеНачисленийЗаработнойПлаты.Добавить(ЗаписьЗП);
				КонецЦикла;	
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	

	Возврат ДанныеНачисленийЗаработнойПлаты;
	
КонецФункции

Процедура ПодготовитьДанныеДляЗаполненияШтатногоРасписания(Параметры, АдресХранилища) Экспорт	
		
	Если Не ЗначениеЗаполнено(Параметры.ДатаАктуальности) Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаполнятьТолькоМедицинскимиДолжностями = Параметры.ЗаполнятьТолькоМедицинскимиДолжностями;
	Организация 		                   = Параметры.Организация;
	ДатаАктуальности 	                   = Параметры.ДатаАктуальности;

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(ДатаАктуальности, Организация);
	
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(
		МенеджерВременныхТаблиц,
		Истина,
		ПараметрыПостроения,
		Неопределено);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ШтатноеРасписание.Дата КАК ДатаНачалаДействия,
	               |	ШтатноеРасписание.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
	               |	ШтатноеРасписание.КоличествоСтавок КАК КоличествоСтавок,
	               |	ИдентификаторыПодразделений.Идентификатор КАК ИдентификаторПодразделения,
	               |	ИдентификаторыПодразделений.Наименование КАК НаименованиеПодразделения,
	               |	ВЫБОР
	               |		КОГДА НЕ ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	               |		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И НЕ ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК ИдентификаторОтделенияИлиКабинета,
	               |	ВЫБОР
	               |		КОГДА НЕ ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительноеНаименование
	               |		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И НЕ ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	               |				И ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	               |			ТОГДА ИдентификаторыПодразделений.ДополнительноеНаименование
	               |		ИНАЧЕ НЕОПРЕДЕЛЕНО
	               |	КОНЕЦ КАК НаименованиеОтделенияИлиКабинета,
	               |	ВЫРАЗИТЬ(ШтатноеРасписание.Описание КАК СТРОКА(1000)) КАК Описание,
	               |	ШтатноеРасписание.Подразделение КАК Подразделение,
	               |	ШтатноеРасписание.Должность КАК Должность,
	               |	ХарактеристикиДолжностьПоМедРегистру.Характеристика КАК МедицинскаяДолжностьФРМР,
	               |	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика КАК ФедеральнаяДолжностьФРМР,
	               |	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью КАК ЯвляетсяМедицинскойДолжностью
	               |ИЗ
	               |	ВТШтатноеРасписание КАК ШтатноеРасписание
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыПодразделений
	               |		ПО ШтатноеРасписание.Подразделение = ИдентификаторыПодразделений.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру
	               |		ПО (ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	               |			И ШтатноеРасписание.Подразделение = ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру
	               |		ПО (ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	               |			И ШтатноеРасписание.Подразделение.Родитель = ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоМедРегистру
	               |		ПО (ХарактеристикиДолжностьПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжность)
	               |			И ШтатноеРасписание.Должность = ХарактеристикиДолжностьПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру
	               |		ПО (ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжностьПоФедСправочнику)
	               |			И ШтатноеРасписание.Должность = ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
	               |		ПО ШтатноеРасписание.Должность = СвойстваДолжностейМедицинскихРаботников.Должность
	               |ГДЕ
	               |	(&ЗаполнятьТолькоМедицинскимиДолжностями
	               |				И СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью
	               |			ИЛИ НЕ &ЗаполнятьТолькоМедицинскимиДолжностями)";
	
	Запрос.УстановитьПараметр("ЗаполнятьТолькоМедицинскимиДолжностями", ЗаполнятьТолькоМедицинскимиДолжностями);
	Запрос.УстановитьПараметр("КлассификаторДолжностьПоФедСправочнику", "1.2.643.5.1.13.13.99.2.885");
	Запрос.УстановитьПараметр("КлассификаторДолжность", "1.2.643.5.1.13.13.99.2.181");
	Запрос.УстановитьПараметр("КлассификаторТипСтруктурногоПодразделения", "1.2.643.5.1.13.13.99.2.299");
	Запрос.УстановитьПараметр("СтационарноеСтруктурноеПодразделениеКодТипа", "2");

	Параметры.Вставить("ДанныеДляЗаполнения", Новый Структура("ШтатныеЕдиницы", Запрос.Выполнить().Выгрузить()));
	
	ПоместитьВоВременноеХранилище(Параметры, АдресХранилища);
	
КонецПроцедуры	

Процедура ПодготовитьДанныеДляЗаполненияЗаработнойПлаты(Параметры, АдресХранилища) Экспорт	
		
	Если Не ЗначениеЗаполнено(Параметры.ДатаАктуальности) Тогда 
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	НачалоПериода = НачалоМесяца(Параметры.ДатаАктуальности);
	КонецПериода = КонецМесяца(Параметры.ДатаАктуальности);
	ДанныеДляЗаполнения = Параметры.ДанныеДляЗаполнения;
	СписокРаботников = Параметры.СписокРаботников;
	
	НастройкиОрганизации = МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	
	// Выявляем сотрудников, для которых будет выполняться заполнение документа.
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	Если СписокРаботников=Неопределено Или СписокРаботников.Количество()=0 Тогда
		ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = Неопределено;
	Иначе 
		ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = Новый ФиксированныйМассив(СписокРаботников);
	КонецЕсли;
	ПараметрыПолученияСотрудниковОрганизаций.Организация                   = Организация;
	ПараметрыПолученияСотрудниковОрганизаций.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода              = КонецПериода;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоТрудовымДоговорам  = Истина;
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ       = Неопределено;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные = "Должность";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудниковОрганизаций, "ВТСотрудникиОрганизацииДляФильтра");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("УИНОрганизации", НастройкиОрганизации.ИдентификаторДляМедрегистров);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ГруппыНачислений", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ГруппыНачисленияУдержанияВыплаты.Начислено));
	Запрос.УстановитьПараметр("ГруппыУдержаний", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ГруппыНачисленияУдержанияВыплаты.Удержано));
	Запрос.УстановитьПараметр("КлассификаторДолжностьПоФедСправочнику", "1.2.643.5.1.13.13.99.2.885");
	Запрос.УстановитьПараметр("КлассификаторТипСтруктурногоПодразделения", "1.2.643.5.1.13.13.99.2.299");
	Запрос.УстановитьПараметр("СтационарноеСтруктурноеПодразделениеКодТипа", "2");
	Запрос.УстановитьПараметр("КлассификаторВидыНачислений", "1.2.643.5.1.13.13.99.2.1106");
	Запрос.УстановитьПараметр("КлассификаторВидыУдержаний", "1.2.643.5.1.13.13.99.2.1107");
	
	// Выбираем работников, личные дела которые уже выгружались раньше - иначе данные не будут приняты.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиОрганизацииДляФильтра.Сотрудник КАК Сотрудник,
	|	СотрудникиОрганизацииДляФильтра.Период КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиОрганизации
	|ИЗ
	|	ВТСотрудникиОрганизацииДляФильтра КАК СотрудникиОрганизацииДляФильтра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров КАК ИдентификаторыЛичныхДел
	|		ПО СотрудникиОрганизацииДляФильтра.ФизическоеЛицо = ИдентификаторыЛичныхДел.ФизическоеЛицо
	|			И (ИдентификаторыЛичныхДел.УИНОрганизации = &УИНОрганизации)
	|			И (ИдентификаторыЛичныхДел.ДатаНачалаЗаписи <= &КонецПериода)
	|ГДЕ
	|	ИдентификаторыЛичныхДел.МоментВыгрузки > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.Характеристика КАК НазначениеНачисления,
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.Объект КАК Начисление
	|ПОМЕСТИТЬ ВТНазначенияНачислений
	|ИЗ
	|	ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиНазначениеНачисленияПоМедРегистру
	|ГДЕ
	|	ХарактеристикиНазначениеНачисленияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидыНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.Характеристика КАК НазначениеУдержания,
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.Объект КАК Удержание
	|ПОМЕСТИТЬ ВТНазначенияУдержаний
	|ИЗ
	|	ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиНазначениеУдержанияПоМедРегистру
	|ГДЕ
	|	ХарактеристикиНазначениеУдержанияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторВидыУдержаний
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.Подразделение КАК Подразделение,
	|	Начисления.НачислениеУдержание КАК Начисление,
	|	НазначенияНачислений.НазначениеНачисления КАК НазначениеНачисления,
	|	Начисления.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Начисления.ДатаНачала КАК ДатаНачала,
	|	Начисления.ДатаОкончания КАК ДатаОкончания,
	|	Начисления.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТНачисленияСотрудников
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Начисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК Сотрудники
	|		ПО Начисления.Сотрудник = Сотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНазначенияНачислений КАК НазначенияНачислений
	|		ПО (НазначенияНачислений.Начисление = Начисления.НачислениеУдержание)
	|ГДЕ
	|	Начисления.Сумма > 0
	|	И Начисления.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Начисления.Организация = &Организация
	|	И Начисления.ГруппаНачисленияУдержанияВыплаты В(&ГруппыНачислений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Удержания.Сотрудник КАК Сотрудник,
	|	Удержания.Подразделение КАК Подразделение,
	|	Удержания.НачислениеУдержание КАК Удержание,
	|	НазначенияУдержаний.НазначениеУдержания КАК НазначениеУдержания,
	|	Удержания.СтатьяФинансирования КАК СтатьяФинансирования,
	|	Удержания.ДатаНачала КАК ДатаНачала,
	|	Удержания.ДатаОкончания КАК ДатаОкончания,
	|	Удержания.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТУдержанияСотрудников
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК Удержания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОрганизации КАК Сотрудники
	|		ПО Удержания.Сотрудник = Сотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНазначенияУдержаний КАК НазначенияУдержаний
	|		ПО (НазначенияУдержаний.Удержание = Удержания.НачислениеУдержание)
	|ГДЕ
	|	Удержания.Сумма > 0
	|	И Удержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Удержания.Организация = &Организация
	|	И Удержания.ГруппаНачисленияУдержанияВыплаты В(&ГруппыУдержаний)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ДатаНачала КАК Период
	|ПОМЕСТИТЬ ВТСотрудникиДляКадровыхДанных
	|ИЗ
	|	ВТНачисленияСотрудников КАК Начисления
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Удержания.Сотрудник,
	|	Удержания.ДатаНачала
	|ИЗ
	|	ВТУдержанияСотрудников КАК Удержания";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = 
		КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц,
			"ВТСотрудникиДляКадровыхДанных",
			"Сотрудник,Период");
	
	ПереченьИнформацииОСотруднике = "ТабельныйНомер,Подразделение,Должность,ЯвляетсяМедицинскойДолжностью";

	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, ПереченьИнформацииОСотруднике);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КадровыеДанные.ФизическоеЛицо КАК ФизическоеЛицо,
	|	КадровыеДанные.Период КАК Период,
	|	КадровыеДанные.ТабельныйНомер КАК ТабельныйНомер,
	|	МАКСИМУМ(ИдентификаторыЛичныхДел.ДатаНачалаЗаписи) КАК ДатаНачалаЗаписи
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыЛичныхДел
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров КАК ИдентификаторыЛичныхДел
	|		ПО (ИдентификаторыЛичныхДел.ФизическоеЛицо = КадровыеДанные.ФизическоеЛицо)
	|			И (ИдентификаторыЛичныхДел.УИНОрганизации = &УИНОрганизации)
	|			И (ИдентификаторыЛичныхДел.ТабельныйНомер = КадровыеДанные.ТабельныйНомер)
	|			И (ИдентификаторыЛичныхДел.ДатаНачалаЗаписи <= КадровыеДанные.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	КадровыеДанные.ФизическоеЛицо,
	|	КадровыеДанные.Период,
	|	КадровыеДанные.ТабельныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МаксимальныеПериодыЛичныхДел.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МаксимальныеПериодыЛичныхДел.Период КАК Период,
	|	МаксимальныеПериодыЛичныхДел.ТабельныйНомер КАК ТабельныйНомер,
	|	ИдентификаторыЛичныхДел.Идентификатор КАК ИдентификаторЛичногоДела,
	|	ИдентификаторыЛичныхДел.ИдентификаторЗанятости КАК ИдентификаторЗанятости
	|ПОМЕСТИТЬ ВТЛичныеДела
	|ИЗ
	|	ВТМаксимальныеПериодыЛичныхДел КАК МаксимальныеПериодыЛичныхДел
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров КАК ИдентификаторыЛичныхДел
	|		ПО (ИдентификаторыЛичныхДел.ФизическоеЛицо = МаксимальныеПериодыЛичныхДел.ФизическоеЛицо)
	|			И (ИдентификаторыЛичныхДел.УИНОрганизации = &УИНОрганизации)
	|			И (ИдентификаторыЛичныхДел.ТабельныйНомер = МаксимальныеПериодыЛичныхДел.ТабельныйНомер)
	|			И (ИдентификаторыЛичныхДел.ДатаНачалаЗаписи = МаксимальныеПериодыЛичныхДел.ДатаНачалаЗаписи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КадровыеДанные.Сотрудник КАК Сотрудник,
	|	КадровыеДанные.Период КАК Период,
	|	КадровыеДанные.Должность КАК Должность,
	|	ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Характеристика КАК ФедеральнаяДолжностьФРМР,
	|	ИдентификаторыЛичныхДел.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	ИдентификаторыЛичныхДел.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела
	|ПОМЕСТИТЬ ВТКадровыеДанныеСИдентификаторами
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру
	|		ПО (ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторДолжностьПоФедСправочнику)
	|			И КадровыеДанные.Должность = ХарактеристикиДолжностьПоФедСправочникуПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЛичныеДела КАК ИдентификаторыЛичныхДел
	|		ПО (ИдентификаторыЛичныхДел.ФизическоеЛицо = КадровыеДанные.ФизическоеЛицо)
	|			И (ИдентификаторыЛичныхДел.ТабельныйНомер = КадровыеДанные.ТабельныйНомер)
	|			И (ИдентификаторыЛичныхДел.Период = КадровыеДанные.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровыеДанные.Сотрудник КАК Сотрудник,
	|	Начисления.Подразделение КАК Подразделение,
	|	ИдентификаторыПодразделений.Идентификатор КАК ИдентификаторПодразделения,
	|	ВЫБОР
	|		КОГДА НЕ ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	|			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	|		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И НЕ ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	|			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ИдентификаторОтделения,
	|	КадровыеДанные.Должность КАК Должность,
	|	КадровыеДанные.ФедеральнаяДолжностьФРМР КАК ФедеральнаяДолжностьФРМР,
	|	КадровыеДанные.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	КадровыеДанные.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	Начисления.НазначениеНачисления КАК НазначениеНачисления,
	|	Начисления.Начисление КАК Начисление,
	|	СвойстваСтатейФинансирования.КФО КАК КФО,
	|	Начисления.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТДанныеНачисленийЗаработнойПлаты
	|ИЗ
	|	ВТНачисленияСотрудников КАК Начисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСИдентификаторами КАК КадровыеДанные
	|		ПО (КадровыеДанные.Сотрудник = Начисления.Сотрудник)
	|			И (КадровыеДанные.Период = Начисления.ДатаНачала)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыПодразделений
	|		ПО Начисления.Подразделение = ИдентификаторыПодразделений.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру
	|		ПО (ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	|			И Начисления.Подразделение = ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру
	|		ПО (ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	|			И Начисления.Подразделение.Родитель = ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваСтатейФинансированияУчетБюджетныхУчреждений КАК СвойстваСтатейФинансирования
	|		ПО Начисления.СтатьяФинансирования = СвойстваСтатейФинансирования.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровыеДанные.Сотрудник КАК Сотрудник,
	|	Удержания.Подразделение КАК Подразделение,
	|	ИдентификаторыПодразделений.Идентификатор КАК ИдентификаторПодразделения,
	|	ВЫБОР
	|		КОГДА НЕ ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	|			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	|		КОГДА ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И НЕ ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод ЕСТЬ NULL
	|				И ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ХарактеристикаКод = &СтационарноеСтруктурноеПодразделениеКодТипа
	|			ТОГДА ИдентификаторыПодразделений.ДополнительныйИдентификатор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ИдентификаторОтделения,
	|	КадровыеДанные.Должность КАК Должность,
	|	КадровыеДанные.ФедеральнаяДолжностьФРМР КАК ФедеральнаяДолжностьФРМР,
	|	КадровыеДанные.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	КадровыеДанные.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	Удержания.НазначениеУдержания КАК НазначениеУдержания,
	|	Удержания.Удержание КАК Удержание,
	|	СвойстваСтатейФинансирования.КФО КАК КФО,
	|	Удержания.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТДанныеУдержанийЗаработнойПлаты
	|ИЗ
	|	ВТУдержанияСотрудников КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСИдентификаторами КАК КадровыеДанные
	|		ПО (КадровыеДанные.Сотрудник = Удержания.Сотрудник)
	|			И (КадровыеДанные.Период = Удержания.ДатаНачала)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров КАК ИдентификаторыПодразделений
	|		ПО Удержания.Подразделение = ИдентификаторыПодразделений.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру
	|		ПО (ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	|			И Удержания.Подразделение = ХарактеристикиТипСтруктурногоПодразделенияПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру
	|		ПО (ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторТипСтруктурногоПодразделения)
	|			И Удержания.Подразделение.Родитель = ХарактеристикиТипРодителяСтруктурногоПодразделенияПоМедРегистру.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваСтатейФинансированияУчетБюджетныхУчреждений КАК СвойстваСтатейФинансирования
	|		ПО Удержания.СтатьяФинансирования = СвойстваСтатейФинансирования.СтатьяФинансирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	Начисления.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	Начисления.Подразделение КАК Подразделение,
	|	Начисления.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	Начисления.ИдентификаторОтделения КАК ИдентификаторОтделения,
	|	Начисления.Должность КАК Должность,
	|	Начисления.ФедеральнаяДолжностьФРМР КАК ФедеральнаяДолжностьФРМР,
	|	Начисления.НазначениеНачисления КАК НазначениеНачисления,
	|	Начисления.Начисление КАК Начисление,
	|	Начисления.КФО КАК КФО,
	|	СУММА(Начисления.Сумма) КАК СуммаНачисления
	|ИЗ
	|	ВТДанныеНачисленийЗаработнойПлаты КАК Начисления
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Сотрудник,
	|	Начисления.ИдентификаторЗанятости,
	|	Начисления.ИдентификаторЛичногоДела,
	|	Начисления.Подразделение,
	|	Начисления.ИдентификаторПодразделения,
	|	Начисления.ИдентификаторОтделения,
	|	Начисления.Должность,
	|	Начисления.ФедеральнаяДолжностьФРМР,
	|	Начисления.НазначениеНачисления,
	|	Начисления.Начисление,
	|	Начисления.КФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ИдентификаторЛичногоДела
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Удержания.Сотрудник КАК Сотрудник,
	|	Удержания.ИдентификаторЗанятости КАК ИдентификаторЗанятости,
	|	Удержания.ИдентификаторЛичногоДела КАК ИдентификаторЛичногоДела,
	|	Удержания.Подразделение КАК Подразделение,
	|	Удержания.ИдентификаторПодразделения КАК ИдентификаторПодразделения,
	|	Удержания.ИдентификаторОтделения КАК ИдентификаторОтделения,
	|	Удержания.Должность КАК Должность,
	|	Удержания.ФедеральнаяДолжностьФРМР КАК ФедеральнаяДолжностьФРМР,
	|	Удержания.НазначениеУдержания КАК НазначениеУдержания,
	|	Удержания.Удержание КАК Удержание,
	|	Удержания.КФО КАК КФО,
	|	СУММА(Удержания.Сумма) КАК СуммаУдержания
	|ИЗ
	|	ВТДанныеУдержанийЗаработнойПлаты КАК Удержания
	|
	|СГРУППИРОВАТЬ ПО
	|	Удержания.Сотрудник,
	|	Удержания.ИдентификаторЗанятости,
	|	Удержания.ИдентификаторЛичногоДела,
	|	Удержания.Подразделение,
	|	Удержания.ИдентификаторПодразделения,
	|	Удержания.ИдентификаторОтделения,
	|	Удержания.Должность,
	|	Удержания.ФедеральнаяДолжностьФРМР,
	|	Удержания.НазначениеУдержания,
	|	Удержания.Удержание,
	|	Удержания.КФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ИдентификаторЛичногоДела";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КоличествоРезультатов = РезультатЗапроса.Количество();
	ДанныеНачислений = РезультатЗапроса[КоличествоРезультатов-2].Выгрузить();
	ДанныеУдержаний = РезультатЗапроса[КоличествоРезультатов-1].Выгрузить();
	
	ДанныеДляЗаполнения.ДанныеНачислений = ДанныеНачислений;
	ДанныеДляЗаполнения.ДанныеУдержаний = ДанныеУдержаний;
	Параметры.ДанныеДляЗаполнения = ДанныеДляЗаполнения;
	ПоместитьВоВременноеХранилище(Параметры, АдресХранилища);	
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли