#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Отказ = Ложь; // Тривиальный код для АПК.
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет документ данными из хранилища.
// Параметры: АдресХранилища - адрес временного хранилища.
Процедура ЗаполнитьИзХранилища(АдресХранилища) Экспорт
	ПараметрыЗаполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") Тогда 
		ДанныеДляЗаполнения = ПараметрыЗаполнения.ДанныеДляЗаполнения;  
		Если ДанныеДляЗаполнения.Свойство("ШтатныеЕдиницы") Тогда 
			ШтатныеЕдиницы.Загрузить(ДанныеДляЗаполнения.ШтатныеЕдиницы);
		КонецЕсли;
		Если ДанныеДляЗаполнения.Свойство("ДанныеНачислений") Тогда 
			ДанныеНачислений.Загрузить(ДанныеДляЗаполнения.ДанныеНачислений);
		КонецЕсли;
		Если ДанныеДляЗаполнения.Свойство("ДанныеУдержаний") Тогда 
			ДанныеУдержаний.Загрузить(ДанныеДляЗаполнения.ДанныеУдержаний);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустаяСтрока(УИНОрганизации) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Идентификатор учреждения должен быть заполнен'"), ЭтотОбъект, "УИНОрганизации", , Отказ);
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "УИНОрганизации");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли