// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьНастройкиВидовКонтактнойИнформацииКандидатов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ПодборПерсонала");
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Параметры:
//  ПараметрыОбновления - Неопределено, Структура -
// @skip-check invocation-parameter-type-intersect
Процедура ЗаполнитьНастройкиВидовКонтактнойИнформацииКандидатов(ПараметрыОбновления = Неопределено) Экспорт
	
	ДобавитьНастройку(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица"),
		Истина);
	ДобавитьНастройку(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица"),
		Истина);
	ДобавитьНастройку(
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов"),
		ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица"),
		Истина);
		
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Истина);
	
КонецПроцедуры

#КонецОбласти

// Параметры:
//  ВидКИКандидатов - СправочникСсылка.ВидыКонтактнойИнформации
//  ВидКИФизическихЛиц - СправочникСсылка.ВидыКонтактнойИнформации
//  ЭтоОбновлениеБазы - Булево
Процедура ДобавитьНастройку(ВидКИКандидатов, ВидКИФизическихЛиц, ЭтоОбновлениеБазы = Ложь) Экспорт
	
	Если ВидКИКандидатов= Неопределено Или ВидКИФизическихЛиц = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ВидКонтактнойИнформацииКандидата.Установить(ВидКИКандидатов);
	
	Если ЗначениеЗаполнено(ВидКИФизическихЛиц) Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ВидКонтактнойИнформацииКандидата = ВидКИКандидатов;
		НоваяЗапись.ВидКонтактнойИнформацииФизическогоЛица = ВидКИФизическихЛиц;
	КонецЕсли;
	
	Если ЭтоОбновлениеБазы Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	Иначе
		НаборЗаписей.Записать();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает соответствие видов контактной информации физических лиц видам контактной информации кандидатов.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации физических лиц
//   * Значение - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации кандидатов
Функция ВидыКИКандидатовПоКИФизическихЛиц() Экспорт
	
	СоответствиеКИ = Новый Соответствие();
	Выборка = ВыборкаНастроек();
	Пока Выборка.Следующий() Цикл
		СоответствиеКИ.Вставить(Выборка.КИФизлица, Выборка.КИКандидата);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеКИ);
	
КонецФункции

// Возвращает соответствие видов контактной информации кандидатов видам контактной информации физических лиц.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение:
//   * Ключ - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации кандидатов
//   * Значение - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации физических лиц
Функция ВидыКИФизическихЛицПоКИКандидатов() Экспорт
	
	СоответствиеКИ = Новый Соответствие();
	Выборка = ВыборкаНастроек();
	Пока Выборка.Следующий() Цикл
		СоответствиеКИ.Вставить(Выборка.КИКандидата, Выборка.КИФизлица);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеКИ);
	
КонецФункции

// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//   * КИКандидата - СправочникСсылка.ВидыКонтактнойИнформации
//   * КИФизлица - СправочникСсылка.ВидыКонтактнойИнформации
Функция ВыборкаНастроек()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкаВидовКИ.ВидКонтактнойИнформацииКандидата КАК КИКандидата,
		|	НастройкаВидовКИ.ВидКонтактнойИнформацииФизическогоЛица КАК КИФизлица
		|ИЗ
		|	РегистрСведений.НастройкаВидовКонтактнойИнформацииКандидатов КАК НастройкаВидовКИ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли
