#Область ПрограммныйИнтерфейс

// Отправляет сообщение через систему взаимодействия.
//
// Параметры:
//  СтрокаСообщения - СтрокаТаблицыЗначений - Строка таблицы значений, см. функцию УведомленияСервер.ОтправитьУведомления().
//  Предмет - ЛюбаяСсылка - Ссылка на объект, являющийся предметом уведомления.
//  СтруктураПараметровСобытия - Структура - Структура параметров события.
// Возвращаемое значение:
//  РезультатОтправки - Структура - описание полей см. УведомленияОбсуждения.РезультатОтправкиСообщения().
//
Функция СформироватьСообщениеИОтправить(СтрокаСообщения, Предмет, СтруктураПараметровСобытия) Экспорт
	
	РезультатОтправки = РезультатОтправкиСообщения();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения") Тогда
		МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
	Иначе
		РезультатОтправки.ОписаниеОшибки = НСтр("ru = 'Подсистема ""Обсуждения"" не обнаружена.'");
		Возврат РезультатОтправки;
	КонецЕсли;
		
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ОбсужденияБЗК") Тогда
		РезультатОтправки.ОписаниеОшибки = НСтр("ru = 'Подсистема ""Обсуждения БЗК"" не обнаружена.'");
		Возврат РезультатОтправки;
	КонецЕсли;
	
	Если Не МодульОбсуждения.ОбсужденияДоступны() Тогда 
		РезультатОтправки.ОписаниеОшибки = НСтр("ru = 'Отправка невозможна. Обсуждения не подключены.'");
		Возврат РезультатОтправки;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаСообщения.Получатель) Тогда
		РезультатОтправки.ОписаниеОшибки  = НСтр("ru = 'Для отправки сообщения не найден получатель.'");
		Возврат РезультатОтправки;
	КонецЕсли;
	
	Отправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаСообщения.Рассылка, "Отправитель", Истина);
	
	Если Не ЗначениеЗаполнено(Отправитель) Тогда
		РезультатОтправки.ОписаниеОшибки  = НСтр("ru = 'Для отправки сообщения не задан отправитель.'");
		Возврат РезультатОтправки;
	КонецЕсли;
		
	Сообщение = ШаблоныСообщений.СформироватьСообщение(
		СтрокаСообщения.ШаблонСообщения,
		Предмет,
		Новый УникальныйИдентификатор,
		СтруктураПараметровСобытия);
	
	Получатель = СтрокаСообщения.Получатель;
	ПолучательВнешний = Истина;

	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ПользовательФизЛица = ФизическиеЛицаЗарплатаКадры.ПользовательФизическогоЛица(Получатель, Истина);
		Если ПользовательФизЛица <> Неопределено Тогда
			Получатель = ПользовательФизЛица;
			ПолучательВнешний = Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.Пользователи") Тогда
		ПолучательВнешний = Ложь;
	КонецЕсли;
	
	ИдентификаторОтправителяИБ = Отправитель.ИдентификаторПользователяИБ;
	
	ИдентификаторОтправителяСВ = Неопределено;
	
	Попытка
	ИдентификаторОтправителяСВ = СистемаВзаимодействия.ПолучитьИдентификаторПользователя(ИдентификаторОтправителяИБ);
	Исключение
		ШаблонОписания = НСтр(
			"ru = 'Отправитель не найден в системе взаимодействия.
			|Будет выполнена попытка создать пользователя %1.'");
			ТекстИнформации = СтрШаблон(ШаблонОписания, Строка(Отправитель));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Поиск пользователя в системе взаимодействия.'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,,,ТекстИнформации);
	КонецПопытки;
	
	Если ИдентификаторОтправителяСВ = Неопределено Тогда
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			ОтправительИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторОтправителяИБ);
			ПользовательСВ = СистемаВзаимодействия.СоздатьПользователя(ОтправительИБ);
			ПользовательСВ.Записать();
			ИдентификаторОтправителяСВ = ПользовательСВ.Идентификатор;
			УстановитьПривилегированныйРежим(Ложь);
			
		Исключение
			
			РезультатОтправки.ОписаниеОшибки = НСтр(
				"ru='При создании пользователя-отправителя в системе взаимодействия произошла ошибка.'");
			Возврат РезультатОтправки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если ПолучательВнешний Тогда
		
		АдресЭлектроннойПочты = ПолучитьАдресЭлектроннойПочты(Получатель);
		
		Если Не ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			РезультатОтправки.ОписаниеОшибки = НСтр("ru = 'У получателя не заполнен адрес электронной почты.'");
			Возврат РезультатОтправки;
		КонецЕсли;
		
		ИмяПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "Наименование");
		ИдентификаторПолучателяСВ = ОбсужденияБЗК.ВнешнийПользовательСистемыВзаимодействия(ИмяПолучателя, АдресЭлектроннойПочты);
		
		ИдентификаторОбсуждения = ПолучитьИдентификаторОбсуждения(
			Получатель, Отправитель, ИдентификаторОтправителяСВ, ИдентификаторПолучателяСВ);
		
		ПолучательВОбсуждении = СистемаВзаимодействия.ПолучитьПользователя(ИдентификаторПолучателяСВ);
		
		МенеджерЗаписи = РегистрыСведений.СведенияОбОтправкеПриглашенийВОбсуждения.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИдентификаторОбсуждения = ИдентификаторОбсуждения;
		МенеджерЗаписи.Получатель = Получатель;
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Или МенеджерЗаписи.ДатаОтправки = Дата(1,1,1) Тогда
			Попытка
				СистемаВзаимодействия.ОтправитьНавигационнуюСсылкуВнешнегоДоступа(ИдентификаторПолучателяСВ, ИдентификаторОбсуждения);
			Исключение
				РезультатОтправки.ОписаниеОшибки = НСтр("ru = 'Ошибка отправки приглашения в 1С Диалог.'");
				Возврат РезультатОтправки;
			КонецПопытки;
			МенеджерЗаписи.ДатаОтправки = ТекущаяДатаСеанса();
			МенеджерЗаписи.Записать();
		КонецЕсли;
	Иначе
		ИдентификаторПолучателяСВ = МодульОбсуждения.ПользовательСистемыВзаимодействия(Получатель, Истина);
		ИдентификаторОбсуждения = ПолучитьИдентификаторОбсуждения(
			Получатель, Отправитель, ИдентификаторОтправителяСВ, ИдентификаторПолучателяСВ);
		ПолучательВОбсуждении = Получатель;
	КонецЕсли;
	
	ТекстСообщения = Сообщение.Текст;
	
	СообщениеСВ = МодульОбсуждения.ОписаниеСообщения(ТекстСообщения);
	
	Попытка
		МассивПолучателей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПолучательВОбсуждении);
		МодульОбсуждения.ОтправитьСообщение(
			Отправитель,
			МассивПолучателей,
			СообщениеСВ,
			ИдентификаторОбсуждения);
		ЗаписатьВРегистрУведомленияВСистемуВзаимодействия(СтрокаСообщения, ТекстСообщения);
		РезультатОтправки.Отправлено = Истина;
	Исключение
		РезультатОтправки.ОписаниеОшибки = РезультатОтправки.ОписаниеОшибки + НСтр("ru = 'Ошибка отправки сообщения в обсуждение.'");
		ИмяСобытия = НСтр("ru = 'Рассылки уведомлений.Отправка сообщения в обсуждение'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, СтрокаСообщения.Рассылка, РезультатОтправки.ОписаниеОшибки);
	КонецПопытки;
	
	Возврат РезультатОтправки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает идентификатор обсуждения между отправителем и получателем в Системе Взаимодействия.
//
// Параметры:
//  Получатель - ОпределяемыйТип.ПолучательУведомлений - Ссылка на пользователя, который является получателем
//  Отправитель - СправочникСсылка.Пользователи - Ссылка на пользователя, который является отправителем
//  ИдентификаторОтправителяСВ - ИдентификаторПользователяСистемыВзаимодействия - Идентификатор отправителя в Системе Взаимодействия
//  ИдентификаторПолучателяСВ - ИдентификаторПользователяСистемыВзаимодействия - Идентификатор получателя в Системе Взаимодействия
//
// Возвращаемое значение:
//  ИдентификаторОбсужденияСистемыВзаимодействия - Идентификатор обсуждения в Системе Взаимодействия
//
Функция ПолучитьИдентификаторОбсуждения(Получатель, Отправитель, ИдентификаторОтправителяСВ, ИдентификаторПолучателяСВ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИдентификаторыОбсуждений.ИдентификаторОбсуждения КАК ИдентификаторОбсуждения
		|ИЗ
		|	РегистрСведений.ИдентификаторыОбсуждений КАК ИдентификаторыОбсуждений
		|ГДЕ
		|	ИдентификаторыОбсуждений.Получатель = &Получатель
		|	И ИдентификаторыОбсуждений.Отправитель = &Отправитель";
	
	Запрос.УстановитьПараметр("Получатель", Получатель);
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	
	Выборка = Запрос.Выполнить().Выбрать();

	НовоеОбсуждение = Истина;
	Если Выборка.Следующий() Тогда
		ИдентификаторОбсуждения = Новый ИдентификаторОбсужденияСистемыВзаимодействия(Выборка.ИдентификаторОбсуждения);
		УстановитьПривилегированныйРежим(Истина);
		Обсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(ИдентификаторОбсуждения);
		Если Обсуждение <> Неопределено Тогда
			НовоеОбсуждение = Ложь;
			Если Не Обсуждение.Участники.Содержит(ИдентификаторПолучателяСВ) Тогда
				Обсуждение.Участники.Добавить(ИдентификаторПолучателяСВ);
				Попытка
					Обсуждение.Записать();
				Исключение
					ЗаписьЖурналаРегистрации(
						НСтр("ru = 'Добавление получателя в участники Обсуждения'", ОбщегоНазначения.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Если НовоеОбсуждение Тогда
		
		Если ИдентификаторОтправителяСВ = ИдентификаторПолучателяСВ Тогда
			КлючЛичногоОбсуждения = "Уведомления" + "_" + НРег(Получатель.УникальныйИдентификатор());
			Заголовок = НСтр("ru = 'Уведомления'");
			ИдентификаторОбсуждения = ОбсужденияБЗК.ИдентификаторНовогоЛичногоОбсуждения(
				КлючЛичногоОбсуждения, Заголовок, ИдентификаторПолучателяСВ);
		Иначе
			Обсуждение = ОбсужденияБЗК.НеГрупповоеОбсуждениеМеждуПользователями(ИдентификаторОтправителяСВ, ИдентификаторПолучателяСВ);
			ИдентификаторОбсуждения = Обсуждение.Идентификатор;
		КонецЕсли;
		
		НачатьТранзакцию();
		Попытка
			ОбсуждениеЗапись = РегистрыСведений.ИдентификаторыОбсуждений.СоздатьМенеджерЗаписи();
			ОбсуждениеЗапись.Получатель = Получатель;
			ОбсуждениеЗапись.Отправитель = Отправитель;
			ОбсуждениеЗапись.ИдентификаторОбсуждения = ИдентификаторОбсуждения;
			ОбсуждениеЗапись.Записать();
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка записи идентификатора обсуждения'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЕсли;

	Возврат ИдентификаторОбсуждения;
	
КонецФункции

Процедура ЗаписатьВРегистрУведомленияВСистемуВзаимодействия(СтрокаСообщения, ТекстСообщения)

	УведомлениеЗапись = РегистрыСведений.УведомленияВСистемуВзаимодействия.СоздатьМенеджерЗаписи();
	УведомлениеЗапись.Получатель = СтрокаСообщения.Получатель;
	УведомлениеЗапись.ВидТранспорта = СтрокаСообщения.ВидТранспорта;
	УведомлениеЗапись.ВидУведомления = СтрокаСообщения.ВидУведомления;
	УведомлениеЗапись.Рассылка = СтрокаСообщения.Рассылка;
	УведомлениеЗапись.ДатаОтправки = СтрокаСообщения.ДатаОтправки;
	УведомлениеЗапись.ТекстСообщения = ТекстСообщения;
	
	УведомлениеЗапись.Записать();

КонецПроцедуры

// Возвращает адрес электронной почты получателя.
//
// Параметры:
//  Получатель - СправочникСсылка - объект, для которого необходимо получить адрес электронной почты.
//
// Возвращаемое значение:
//  Строка - адрес электронной почты получателя
//
Функция ПолучитьАдресЭлектроннойПочты(Получатель)
	
	АдресЭлектроннойПочты = "";
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Кандидаты") Тогда
		ЛичныеДанныеКандидата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "ЛичныеДанные");
		АдресЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ЛичныеДанныеКандидата, Справочники.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов);
	Иначе
		АдресЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Получатель, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, , Истина);
	КонецЕсли;
	
	Возврат АдресЭлектроннойПочты;
	
КонецФункции

// Возвращает сведения об сформированном сообщении.
//
// Возвращаемое значение:
//  Структура:
//   * Отправлено - Булево - признак того, что письмо отправлено.
//   * ОписаниеОшибки - Строка - содержит описание ошибки, в случае если письмо отправить не удалось.
//
Функция РезультатОтправкиСообщения()
	
	РезультатОтправкиСообщения = Новый Структура;
	
	РезультатОтправкиСообщения.Вставить("Отправлено", Ложь);
	РезультатОтправкиСообщения.Вставить("ОписаниеОшибки", "");
	
	Возврат РезультатОтправкиСообщения;
	
КонецФункции

#КонецОбласти

