#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПриНачальномЗаполненииДанныхПодсистемыУведомлений");
	Методы.Вставить("ОбновитьРассылкуСШаблономПредстоящегоСобеседованияSMS");
	Методы.Вставить("ОбновитьВидКонтактнойИнформацииРассылокКандидатам");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//										общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "ПодборПерсоналаУведомления.ПриНачальномЗаполненииДанныхПодсистемыУведомлений";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d0fd7ea9-2c31-11ec-8394-b37f065f6494");
	Обработчик.Комментарий = НСтр("ru = 'Начальное заполнение данных системы уведомлений: подбор персонала.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "ПодборПерсоналаУведомления.ОбновитьРассылкуСШаблономПредстоящегоСобеседованияSMS";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("813c468c-00e4-4371-a79d-6632a007bb57");
	Обработчик.Комментарий = НСтр("ru = 'Обновление рассылки уведомления с шаблоном предстоящего собеседования по SMS.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.23.3";
	Обработчик.Процедура = "Обработки.МакетыШаблоновСообщений.СформироватьРассылкуСШаблономПредстоящегоСобеседованияПисьмо";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("be893184-774f-44db-ad78-38a361ee1b13");
	Обработчик.Комментарий = НСтр("ru = 'Формирование рассылки уведомления с шаблоном предстоящего собеседования по почте.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.29.5";
	Обработчик.Процедура = "ПодборПерсоналаУведомления.ОбновитьВидКонтактнойИнформацииРассылокКандидатам";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("775582dd-a46a-41a2-ad84-4560528e6db5");
	Обработчик.Комментарий = НСтр("ru = 'Обновление списка видов контактной информации уведомлений для кандидатов.'");
	
КонецПроцедуры

// Процедура выполняет начальное заполнение данных подсистемы уведомлений
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ПриНачальномЗаполненииДанныхПодсистемыУведомлений(ПараметрыОбновления = Неопределено) Экспорт

	ПриНачальномЗаполненииЭтапРаботыСКандидатом();
	ПриНачальномЗаполненииНоваяЗадачаИсполнителя();
	ПриНачальномЗаполненииИстечениеСрокаИсполненияЗадачи();
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Процедура позволяет дополнить структуру видов уведомлений своими видами уведомлений. 
//
// Параметры:
//  СтруктураДоступныхВидовУведомлений - структура - перечень уведомлений, подключенных в подсистеме
//     * Ключ - Строка - Имя вида уведомления
//     * Значение - Структура - Описание вида уведомления (Структура)
//        * ВидУведомления - Строка, строковый идентификатор вида уведомления.
//        * Описание - Строка, Текстовое описание получаемых данных. Доступно пользователю в справочнике Видов уведомлений.
//        * Инициализация - Строка, <ИмяМодуля>.<ИмяПроцедуры> описывающей данные вида уведомления без выполнения
//                          запросов к базе данных.
//        * ПолучениеДанных - Строка, <ИмяМодуля>.<ИмяПроцедуры> выполняемой для получения данных уведомления.
//
Процедура ПриЗаполненииСпискаВидовУведомлений(СтруктураДоступныхВидовУведомлений) Экспорт
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Назначен этап работы с кандидатом'");
	ОписаниеВидаУведомления.GUID = "1d20ba56-3fe2-4c74-bd98-5a94ab3ef618";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомление о назначенном этапе работы с кандидатом.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияУведомлениеОбЭтапеРаботыСКандидатом";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхУведомлениеОбЭтапеРаботыСКандидатом";
	
	СтруктураДоступныхВидовУведомлений.Вставить("ЭтапРаботыСКандидатом", ОписаниеВидаУведомления);
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Назначена новая задача'");
	ОписаниеВидаУведомления.GUID = "9a4441d5-19ea-11ec-837d-a0508b2abe9d";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомление о назначении новой задачи исполнителя.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияВидаУведомленияНоваяЗадачаИсполнителя";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхВидаУведомленияНоваяЗадачаИсполнителя";
	
	СтруктураДоступныхВидовУведомлений.Вставить("НоваяЗадачаИсполнителя", ОписаниеВидаУведомления);
	
	ОписаниеВидаУведомления = УведомленияСервер.ПустоеОписаниеВидаУведомления();
	ОписаниеВидаУведомления.ВидУведомления = НСтр("ru = 'Истечение срока исполнения задачи'");
	ОписаниеВидаУведомления.GUID = "9a4441d6-19ea-11ec-837d-a0508b2abe9d";
	ОписаниеВидаУведомления.Описание = НСтр("ru = 'Уведомления об истечении срока задачи исполнителя.'");
	ОписаниеВидаУведомления.Инициализация = "ПодборПерсоналаУведомления.ИнициализацияВидаУведомленияИстечениеСрокаИсполненияЗадачи";
	ОписаниеВидаУведомления.ПолучениеДанных = "ПодборПерсоналаУведомления.ПолучениеДанныхВидаУведомленияИстечениеСрокаИсполненияЗадачи";
	
	СтруктураДоступныхВидовУведомлений.Вставить("ИстечениеСрокаИсполненияЗадачи", ОписаниеВидаУведомления);
	
КонецПроцедуры

// Процедура выполняет обновление шаблона предстоящего собеседования
//
Процедура ОбновитьРассылкуСШаблономПредстоящегоСобеседованияSMS(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		ИмяШаблонаРассылки = НСтр("ru='Уведомление кандидату о собеседовании'");
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблонаРассылки, Истина);
		РассылкаСсылка = Справочники.РассылкиУведомлений.НайтиПоНаименованию(ИмяШаблонаРассылки, Истина);
		Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (SMS)'");
		
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.Наименование = Наименование;
			// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
			ШаблонОбъект.ТекстШаблонаSMS = НСтр("ru='[Кандидаты.ЛичныеДанные.Имя] [Кандидаты.ЛичныеДанные.Отчество]! Напоминаем, что вы приглашены на [ДанныеУведомления.ЭтапРаботы], которое состоится [ДанныеУведомления.ДатаСобытия{ДЛФ=D}] в [ДанныеУведомления.ВремяСобытия].
			|С уважением, [ДанныеУведомления.ОтветственныйПоРаботеСКандидатом]'");
			// АПК:1223-вкл.
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РассылкаСсылка) Тогда
			РассылкаОбъект = РассылкаСсылка.ПолучитьОбъект();
			РассылкаОбъект.Наименование = Наименование;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление списка видов контактной информации уведомлений для кандидатов
//
Процедура ОбновитьВидКонтактнойИнформацииРассылокКандидатам(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.РассылкиУведомлений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		
		Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (SMS)'");
		ВидыКонтактнойИнформации =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		ОбновитьВидКонтактнойИнформацииРассылки(Наименование, ВидыКонтактнойИнформации); 
		
		Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (письмо)'");
		ВидыКонтактнойИнформации =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		ОбновитьВидКонтактнойИнформацииРассылки(Наименование, ВидыКонтактнойИнформации);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при подготовке шаблонов сообщений и позволяет заполнить поля, доступные для шаблона
//  соответствующего вида уведомлений.
//
// Параметры:
//  ВидУведомления           - СправочникСсылка.ВидУведомления - вид уведомления - владелец шаблона
//  Реквизиты                - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//                                      и др.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  НазначениеШаблона        - Строка  - Имя назначения шаблон сообщения.
//  ДополнительныеПараметры  - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщенияПоУведомлению(ВидУведомления, Реквизиты, Вложения, НазначениеШаблона, ДополнительныеПараметры) Экспорт
	
	Если ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ЭтапРаботыСКандидатом") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаСобытия",НСтр("ru='Дата и время события'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаСобытияПредставление",НСтр("ru='Дата события'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяСобытия",НСтр("ru='Время события'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Предмет",НСтр("ru='Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЭтапРаботы",НСтр("ru='Этап работы'"), Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СостояниеЭтапа",НСтр("ru='Состояние этапа'"), Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ПериодОкончание",НСтр("ru='Окончание'"), Новый ОписаниеТипов("Дата"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Комментарий",НСтр("ru='Комментарий по кандидату'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Вакансия",НСтр("ru='Вакансия'"), Новый ОписаниеТипов("СправочникСсылка.Вакансии"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ОтветственныйПоРаботеСКандидатом",НСтр("ru='Ответственный по кандидату'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ОтветственныйПоВакансии",НСтр("ru='Ответственный по вакансии'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЦелеваяПозиция",НСтр("ru='Целевая позиция'"), Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ЦелевоеПодразделение",НСтр("ru='Целевое подразделение'"), Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	ИначеЕсли ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "НоваяЗадачаИсполнителя") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначения", НСтр("ru = 'Дата и время назначения задачи'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначенияПредставление", НСтр("ru = 'Дата назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяНазначенияПредставление", НСтр("ru = 'Время назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СрокИсполнения", НСтр("ru = 'Срок исполнения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Важность", НСтр("ru = 'Важность'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Автор", НСтр("ru = 'Автор'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Описание", НСтр("ru = 'Описание'"), Новый ОписаниеТипов("Строка"));
	ИначеЕсли ВидУведомления = Справочники.ВидыУведомлений.НайтиПоРеквизиту("Имя", "ИстечениеСрокаИсполненияЗадачи") Тогда
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначения", НСтр("ru = 'Дата и время назначения задачи'"), Новый ОписаниеТипов("Дата"), "ДФ='dd.MM.yyyy HH:mm'");
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ДатаНазначенияПредставление", НСтр("ru = 'Дата назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.ВремяНазначенияПредставление", НСтр("ru = 'Время назначения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.СрокИсполнения", НСтр("ru = 'Срок исполнения задачи'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Важность", НСтр("ru = 'Важность'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Автор", НСтр("ru = 'Автор'"), Новый ОписаниеТипов("Строка"));
		УведомленияСервер.ДобавитьПоле(Реквизиты, "ДанныеУведомления.Описание", НСтр("ru = 'Описание'"), Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Назначено собеседование"
// 
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияУведомлениеОбЭтапеРаботыСКандидатом(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.Кандидаты");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru='Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "ОтветственныйПоРаботеСКандидатом", НСтр("ru='Ответственный по работе с кандидатом'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "ОтветственныйПоВакансии", НСтр("ru='Ответственный по вакансии'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЭтапРаботы", НСтр("ru='Этап работы'"), Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "СостояниеЭтапа", НСтр("ru='Состояние этапа'"), Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЦелеваяПозиция", НСтр("ru='Целевая позиция'"), Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "ЦелевоеПодразделение", НСтр("ru='Целевое подразделение'"), Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Предмет", 	НСтр("ru = 'Кандидат'"), Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхУведомлениеОбЭтапеРаботыСКандидатом(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	РаботаСКандидатами.Период КАК ДатаСобытия,
	|	"""" КАК ДатаСобытияПредставление,
	|	РаботаСКандидатами.Кандидат КАК Предмет,
	|	РаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
	|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
	|	РаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
	|	РаботаСКандидатами.Кандидат.Ответственный КАК ОтветственныйПоРаботеСКандидатом,
	|	РаботаСКандидатами.Комментарий КАК Комментарий,
	|	РаботаСКандидатами.Кандидат.Вакансия КАК Вакансия,
	|	РаботаСКандидатами.Кандидат.Вакансия.Ответственный КАК ОтветственныйПоВакансии,
	|	РаботаСКандидатами.Кандидат.Позиция КАК ЦелеваяПозиция,
	|	РаботаСКандидатами.Кандидат.Подразделение КАК ЦелевоеПодразделение
	|ПОМЕСТИТЬ ВТРаботаСКандидатами
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|ГДЕ
	|	РаботаСКандидатами.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И РаботаСКандидатами.Период >= &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботаСКандидатами.ДатаСобытия КАК ДатаСобытия,
	|	ВТРаботаСКандидатами.ДатаСобытияПредставление КАК ДатаСобытияПредставление,
	|	ВТРаботаСКандидатами.Предмет КАК Предмет,
	|	ВТРаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
	|	ВТРаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа,
	|	ВТРаботаСКандидатами.ПериодОкончание КАК ПериодОкончание,
	|	ВТРаботаСКандидатами.ОтветственныйПоРаботеСКандидатом КАК ОтветственныйПоРаботеСКандидатом,
	|	ВТРаботаСКандидатами.Комментарий КАК Комментарий,
	|	ВТРаботаСКандидатами.Вакансия КАК Вакансия,
	|	ВТРаботаСКандидатами.ОтветственныйПоВакансии КАК ОтветственныйПоВакансии,
	|	ВТРаботаСКандидатами.ЦелеваяПозиция КАК ЦелеваяПозиция,
	|	ВТРаботаСКандидатами.ЦелевоеПодразделение КАК ЦелевоеПодразделение
	|ИЗ
	|	ВТРаботаСКандидатами КАК ВТРаботаСКандидатами");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТРаботаСКандидатами." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ТаблицаДанных = Результат.Выгрузить();
		
		ПараметрыСобытия = Новый Структура();
		Для Каждого КолонкаРезультата Из СхемаЗапроса.ПакетЗапросов[0].Колонки Цикл
			ПараметрыСобытия.Вставить(КолонкаРезультата.Псевдоним);
		КонецЦикла;
		ПараметрыСобытия.Вставить("ВремяСобытия");
		Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
			СтрокаТаблицы = ТаблицаРезультата.Добавить();
			СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
			СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
			ЗаполнитьЗначенияСвойств(ПараметрыСобытия, СтрокаРезультатаЗапроса);
			ПараметрыСобытия.ВремяСобытия = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm");
			ПараметрыСобытия.ДатаСобытияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D");
			СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Заполняет параметры вида уведомления "Назначена новая задача"
//
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияВидаУведомленияНоваяЗадачаИсполнителя(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 		НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Важность", 		НСтр("ru = 'Важность'"), Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыВажностиЗадачи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 	НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхВидаУведомленияНоваяЗадачаИсполнителя(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	|	ВЫРАЗИТЬ(ЗадачаИсполнителя.Исполнитель КАК Справочник.Пользователи).ФизическоеЛицо КАК Предмет,
	|	ЗадачаИсполнителя.Дата КАК Дата,
	|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
	|	ЗадачаИсполнителя.Описание КАК Описание,
	|	ЗадачаИсполнителя.Важность КАК Важность,
	|	ЗадачаИсполнителя.АвторСтрокой КАК АвторСтрокой
	|ПОМЕСТИТЬ ВТЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.Дата >= &ТекущаяДата
	|	И ЗадачаИсполнителя.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадачи.Исполнитель КАК Исполнитель,
	|	ВТЗадачи.Дата КАК ДатаСобытия,
	|	ВТЗадачи.Предмет КАК Предмет,
	|	ВТЗадачи.Дата КАК ДатаНазначения,
	|	ВТЗадачи.СрокИсполнения КАК СрокИсполнения,
	|	ВТЗадачи.Описание КАК Описание,
	|	ВТЗадачи.Важность КАК Важность,
	|	ВТЗадачи.АвторСтрокой КАК Автор
	|ИЗ
	|	ВТЗадачи КАК ВТЗадачи");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТЗадачи." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
	
		ПараметрыСобытия = Новый Структура();

		Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
			ПараметрыСобытия.Вставить(КолонкаРезультата.Имя, СтрокаРезультатаЗапроса[КолонкаРезультата.Имя]);
		КонецЦикла;
	
		ПараметрыСобытия.Вставить("ДатаНазначенияПредставление", Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D"));
		ПараметрыСобытия.Вставить("ВремяНазначенияПредставление", Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm"));
	
		СтрокаТаблицы = ТаблицаРезультата.Добавить();
		СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
		СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
		СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
	
	КонецЦикла;

КонецПроцедуры

// Заполняет параметры вида уведомления "Истечение срока исполнения задачи"
// 
// Параметры:
//  ОписаниеДанных - Структура - Содержит элементы, описывающий вид уведомления
//    * ТипПредмета - ОписаниеТипов - указывает тип предмета уведомления
//    * Отборы - ТаблицаЗначений - описывает отборы, которые будут доступны пользователю, при настройке рассылки
//        * Имя - Строка - Имя поля отбора, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление поля отбора
//        * ОписаниеТипов - ОписаниеТипов - тип значения отбора
//    * Получатели - ТаблицаЗначений - описывает получателей, предлагаемых разработчиком.
//                                 Значение получателей будет выбрано из данных уведомления
//        * Имя - Строка - Имя поля получателя, должно быть уникально в пределах таблицы отборов
//                         и совпадать с одним из полей данных уведомления
//        * Представление - Строка - пользовательское представление получателя
//        * ОписаниеТипов - ОписаниеТипов - тип значения получателя
//
Процедура ИнициализацияВидаУведомленияИстечениеСрокаИсполненияЗадачи(ОписаниеДанных) Экспорт
	
	ОписаниеДанных.ТипПредмета = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
	
	УведомленияСервер.ДобавитьПолучателя(ОписаниеДанных, "Предмет", НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 		НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Важность", 		НСтр("ru = 'Важность'"), Новый ОписаниеТипов("ПеречислениеСсылка.ВариантыВажностиЗадачи"));
	УведомленияСервер.ДобавитьОтбор(ОписаниеДанных, "Исполнитель", 	НСтр("ru = 'Исполнитель'"), Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
КонецПроцедуры

// Процедура заполняет таблицу уведомлений по переданным параметрам и отборам.
//
// Параметры:
//    СтруктураПериода - Структура - два элемента - НачалоПериода и ОкончаниеПериода
//    Отборы - ТаблицаЗначений - перечень отборов событий, заданный пользователем
//       * ЛевоеЗначение - Строка - имя поля отбора в источнике данных.
//       * ВидСравнения - ВидСравнения - Вид сравнения
//       * ЛевоеЗначение - Булево, Число, Строка, Дата, ЛюбаяСсылка - значение отбора.
//    ТаблицаРезультата - ТаблицаЗначений - содержит события изменения объекта.
//
Процедура ПолучениеДанныхВидаУведомленияИстечениеСрокаИсполненияЗадачи(СтруктураПериода, Отборы, ТаблицаРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПериода.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПериода.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ЗадачаИсполнителя.Исполнитель КАК Исполнитель,
	|	ВЫРАЗИТЬ(ЗадачаИсполнителя.Исполнитель КАК Справочник.Пользователи).ФизическоеЛицо КАК Предмет,
	|	ЗадачаИсполнителя.Дата КАК Дата,
	|	ЗадачаИсполнителя.СрокИсполнения КАК СрокИсполнения,
	|	ЗадачаИсполнителя.Описание КАК Описание,
	|	ЗадачаИсполнителя.Важность КАК Важность,
	|	ЗадачаИсполнителя.АвторСтрокой КАК АвторСтрокой
	|ПОМЕСТИТЬ ВТЗадачи
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|ГДЕ
	|	ЗадачаИсполнителя.СрокИсполнения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И НЕ ЗадачаИсполнителя.Выполнена
	|	И НЕ ЗадачаИсполнителя.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗадачи.Исполнитель КАК Исполнитель,
	|	ВТЗадачи.СрокИсполнения КАК ДатаСобытия,
	|	ВТЗадачи.Предмет КАК Предмет,
	|	ВТЗадачи.Дата КАК ДатаНазначения,
	|	ВТЗадачи.СрокИсполнения КАК СрокИсполнения,
	|	ВТЗадачи.Описание КАК Описание,
	|	ВТЗадачи.Важность КАК Важность,
	|	ВТЗадачи.АвторСтрокой КАК Автор
	|ИЗ
	|	ВТЗадачи КАК ВТЗадачи");
	
	Если Отборы.Количество() > 0 Тогда
		ОтборЗапроса = СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор;
		Для Каждого СтрокаОтбора Из Отборы Цикл
			Если СтрокаОтбора.Использование Тогда
				ТекстУсловия = УведомленияСервер.ПредставлениеУсловияДляЗапроса(
					СтрокаОтбора.ВидСравнения,
					СтрокаОтбора.ЛевоеЗначение,
					"ВТЗадачи." + СтрокаОтбора.ЛевоеЗначение);
				ОтборЗапроса.Добавить(ТекстУсловия);
				Запрос.УстановитьПараметр(СтрокаОтбора.ЛевоеЗначение, СтрокаОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	
	ПараметрыСобытия = Новый Структура();
	
	Для Каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		ПараметрыСобытия.Вставить(КолонкаРезультата.Имя);
	КонецЦикла;
	ПараметрыСобытия.Вставить("ДатаНазначенияПредставление");
	ПараметрыСобытия.Вставить("ВремяНазначенияПредставление");
	
	Для Каждого СтрокаРезультатаЗапроса Из ТаблицаДанных Цикл
		СтрокаТаблицы = ТаблицаРезультата.Добавить();
		СтрокаТаблицы.Предмет = СтрокаРезультатаЗапроса.Предмет;
		СтрокаТаблицы.ДатаСобытия = СтрокаРезультатаЗапроса.ДатаСобытия;
		ЗаполнитьЗначенияСвойств(ПараметрыСобытия, СтрокаРезультатаЗапроса);
		ПараметрыСобытия.ВремяНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДФ=HH:mm");
		ПараметрыСобытия.ДатаНазначенияПредставление = Формат(СтрокаРезультатаЗапроса.ДатаСобытия, "ДЛФ=D");
		СтрокаТаблицы.ПараметрыСобытия = ПараметрыСобытия;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриНачальномЗаполненииЭтапРаботыСКандидатом()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ЭтапРаботыСКандидатом");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ТипШаблона = "SMS";
	ПараметрыШаблона.ПолноеИмяТипаНазначения = "Справочник.Кандидаты";
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	ПараметрыШаблона.Текст = НСтр("ru='Здравствуйте. Настоящим подтверждаем приглашение на [ДанныеУведомления.ЭтапРаботы], которое состоится [ДанныеУведомления.ДатаСобытия{ДЛФ=D}] в [ДанныеУведомления.ВремяСобытия].
		|С уважением, [ДанныеУведомления.ОтветственныйПоРаботеСКандидатом]'");
	ПараметрыШаблона.Назначение = "Кандидаты";
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(НСтр("ru='Уведомление кандидату о собеседовании'"), ПараметрыШаблона);
	
	// Рассылка уведомления
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.SMS;
	РассылкаОбъект.Наименование 	= НСтр("ru='Уведомление кандидату о собеседовании'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ДоСобытия;
	РассылкаОбъект.ИнтервалУведомления = 3;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	
	// Отборы
	ЭтапСобеседование = Справочники.ЭтапыРаботыСКандидатами.НайтиПоНаименованию("Собеседование");
	Если ЗначениеЗаполнено(ЭтапСобеседование) Тогда
		НастройкиОтборов = Новый ТаблицаЗначений;
		НастройкиОтборов.Колонки.Добавить("ЛевоеЗначение");
		НастройкиОтборов.Колонки.Добавить("ВидСравнения");
		НастройкиОтборов.Колонки.Добавить("ПравоеЗначение");
		НастройкиОтборов.Колонки.Добавить("Использование");
		НастройкиОтборов.Колонки.Добавить("ОписаниеТипов");
		НастройкиОтборов.Колонки.Добавить("Представление");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЭтапРаботы";
		СтрокаОтбора.ПравоеЗначение = ЭтапСобеседование;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Этап работы'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "СостояниеЭтапа";
		СтрокаОтбора.ПравоеЗначение = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Состояние этапа'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелеваяПозиция";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание");
		СтрокаОтбора.Представление = НСтр("ru='Целевая позиция'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелевоеПодразделение";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
		СтрокаОтбора.Представление = НСтр("ru='Целевое подразделение'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииНоваяЗадачаИсполнителя()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("НоваяЗадачаИсполнителя");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Назначена новая задача'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:1223-выкл. Личные местоимения используются в текстах шаблонов
	ПараметрыШаблона.Текст = НСтр("ru = 'Вам назначена новая задача [ДанныеУведомления.ДатаНазначенияПредставление]:
			|[ДанныеУведомления.Описание]'");
	// АПК:1223-вкл.
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(ПараметрыШаблона.Тема, ПараметрыШаблона);
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование 	= НСтр("ru = 'Назначена новая задача'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПриНачальномЗаполненииИстечениеСрокаИсполненияЗадачи()
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ИстечениеСрокаИсполненияЗадачи");
	Если Не ЗначениеЗаполнено(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	Если УведомленияСервер.ЕстьРассылкиПоВидуУведомления(ВидУведомления) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.ОбычныйТекст;
	ПараметрыШаблона.Тема = НСтр("ru = 'Истечение срока исполнения назначенной задачи'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	ПараметрыШаблона.Текст = НСтр("ru = 'По назначенной задаче истекает срок исполнения [ДанныеУведомления.СрокИсполнения]
		|Описание задачи:
		|[ДанныеУведомления.Описание]'");
	
	ШаблонСообщенияСсылка = ШаблоныСообщений.СоздатьШаблон(ПараметрыШаблона.Тема, ПараметрыШаблона);
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления 	= ВидУведомления;
	РассылкаОбъект.ВидТранспорта 	= Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.Наименование 	= НСтр("ru = 'Истечение срока исполнения назначенной задачи'");
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонСообщенияСсылка;
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура ОбновитьВидКонтактнойИнформацииРассылки(Наименование, ВидыКонтактнойИнформации)
	
	Рассылка = Справочники.РассылкиУведомлений.НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Рассылка) Тогда
		РассылкаОбъект = Рассылка.ПолучитьОбъект();
		РассылкаОбъект.ПолучателиУведомленийДинамические[0].ВидКонтактнойИнформации = ВидыКонтактнойИнформации;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
