
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Выгружает данные информационной базы.
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//	Обработчики - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных - менеджер 
//		обработчиков выгрузки данных. 
//	Сериализатор - СериализаторXDTO - сериализатор XDTO с аннотацией типов. 
//
Процедура ВыгрузитьДанныеИнформационнойБазы(Контейнер, Обработчики, Сериализатор) Экспорт
	
	ПараметрыПроцессаВыгрузки = НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы(
		Контейнер, Обработчики, Сериализатор);
	
	ЗаписатьВыгружаемыеОбъектыМетаданных(ПараметрыПроцессаВыгрузки);
	
	Если ПараметрыПроцессаВыгрузки.ИспользоватьМногопоточность Тогда
		
		ЗаданиеВыгрузки = ВыгрузкаЗагрузкаДанныхСлужебный.ПолучитьЗаданиеПараллельнойВыгрузкиЗагрузкиДанных();
		
		ВыгрузкаЗагрузкаДанныхСлужебный.ПослеЗапускаПотокаВыгрузкиЗагрузкиДанных(
			ЗаданиеВыгрузки,
			Контейнер,
			ВыгрузкаЗагрузкаДанныхСлужебный.ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени("Управляющий"));
		
		Задания = ЗапуститьПотокиВыгрузкиДанных(
			ПараметрыПроцессаВыгрузки,
			Контейнер.КоличествоПотоков(),
			ВыгрузкаЗагрузкаДанныхСлужебный.ВидПотокаПараллельнойВыгрузкиЗагрузкиДанных(Контейнер));
			
		ВыгрузкаЗагрузкаДанныхСлужебный.ОжидатьВыгрузкуЗагрузкуДанныхВПотоках(Задания, ПараметрыПроцессаВыгрузки);
		
	Иначе
		
		ВыгрузитьОсновныеДанные(ПараметрыПроцессаВыгрузки, ПараметрыПроцессаВыгрузки.ОсновнойУзел);
		
	КонецЕсли;
	
	Если ПараметрыПроцессаВыгрузки.ДополнительныйУзел = Неопределено Тогда
		
		// Выгрузка в монопольном режиме
		ЗавершитьВыгрузку(ПараметрыПроцессаВыгрузки, ЗначениеЗаполнено(ПараметрыПроцессаВыгрузки.ОсновнойУзел));
				
	Иначе
		 
		// Выгрузка объектов измененных за время выгрузки
		// Если объектов много, то выгрузить без транзакции
		ВыгрузитьНакопленныеОсновныеДанные(ПараметрыПроцессаВыгрузки, ПараметрыПроцессаВыгрузки.ДополнительныйУзел);
		
		ВыгрузкаВТранзакцииВыполнена = Ложь;
		
		Для НомерПопытки = 1 По 3 Цикл
			
			ВыгрузкаВТранзакцииВыполнена = ЗавершитьВыгрузкуВТранзакции(
				ПараметрыПроцессаВыгрузки, 
				ПараметрыПроцессаВыгрузки.ДополнительныйУзел);
			
			Если ВыгрузкаВТранзакцииВыполнена Тогда
				Прервать;
			КонецЕсли;
			
			ВызватьПаузу(60000);
			
		КонецЦикла;
		
		Если Не ВыгрузкаВТранзакцииВыполнена Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось заблокировать область, резервная копия не сделана.'");
		КонецЕсли;
		
	КонецЕсли;
	
	ВыгрузитьОбщиеДанные(ПараметрыПроцессаВыгрузки);
	
	ПараметрыПроцессаВыгрузки.ПотокЗаписиПересоздаваемыхСсылок.Закрыть();
	ПараметрыПроцессаВыгрузки.ПотокЗаписиСопоставляемыхСсылок.Закрыть();
	
	Если Контейнер.ФиксироватьСостояние() Тогда
		Контейнер.ЗафиксироватьЗавершениеОбработкиОбъектовМетаданных();	
	КонецЕсли;
	
КонецПроцедуры

// Выгрузить данные информационной базы в потоке.
// 
// Параметры:
//  ПараметрыПотока - Структура
// 
Процедура ВыгрузитьДанныеИнформационнойБазыВПотоке(ПараметрыПотока) Экспорт
	
	ЗаданиеВыгрузки = ВыгрузкаЗагрузкаДанныхСлужебный.ПолучитьЗаданиеПараллельнойВыгрузкиЗагрузкиДанных();
	
	Контейнер = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.Создать();
	Контейнер.ИнициализироватьВыгрузкуВПотоке(ПараметрыПотока.Контейнер);
	
	Обработчики = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных.Создать();
	Обработчики.Инициализировать(Контейнер);
	
	Сериализатор = ВыгрузкаЗагрузкаДанныхСлужебный.СериализаторXDTOСАннотациейТипов();
	
	ПараметрыПроцессаВыгрузки = НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы(
		Контейнер, Обработчики, Сериализатор, ПараметрыПотока.ПотокЗаписиСопоставляемыхСсылок);
	
	ВыгрузитьОсновныеДанныеВПотоке(ПараметрыПроцессаВыгрузки, ПараметрыПотока.ОсновнойУзел, ЗаданиеВыгрузки);
	
	ПараметрыПроцессаВыгрузки.ПотокЗаписиПересоздаваемыхСсылок.Закрыть();
	ПараметрыПроцессаВыгрузки.ПотокЗаписиСопоставляемыхСсылок.Закрыть();
	
	ДанныеСообщения = Новый Структура();
	ДанныеСообщения.Вставить(
		"Состав",
		ОбщегоНазначения.ТаблицаЗначенийВМассив(ПараметрыПроцессаВыгрузки.Контейнер.Состав()));
	ДанныеСообщения.Вставить(
		"ИспользуемыеФайлы",
		Новый ФиксированныйМассив(ПараметрыПроцессаВыгрузки.Контейнер.ИспользуемыеФайлы()));
	ДанныеСообщения.Вставить(
		"Предупреждения",
		Новый ФиксированныйМассив(ПараметрыПроцессаВыгрузки.Контейнер.Предупреждения()));
	ДанныеСообщения.Вставить(
		"ДублиПредопределенных",
		ОбщегоНазначения.ЗначениеВСтрокуXML(ПараметрыПроцессаВыгрузки.Контейнер.ДублиПредопределенных()));
	
	ВыгрузкаЗагрузкаДанныхСлужебный.ОтправитьСообщениеВРодительскийПоток(
		ПараметрыПроцессаВыгрузки.Контейнер,
		ВыгрузкаЗагрузкаДанныхСлужебный.ИмяМетодаСообщенияПотока_ЗавершениеВыгрузки(),
		ДанныеСообщения);
	
	Пока Истина Цикл
		
		// Ожидаем обработки файлов управляющим потоком. По завершению обработки управляющий поток завершит это задание.
		ЗаданиеВыгрузки = ЗаданиеВыгрузки.ОжидатьЗавершенияВыполнения(5);
		
		Если Не Контейнер.КлиентскийСеансСуществует() Тогда
			Контейнер.ПрерватьПроцессПриОтсутствииКлиентскогоСеанса();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает признак возможности дифференциальной копии
// 
// Возвращаемое значение:
// 	Булево - Описание
Функция ВыгрузкаДифференциальнойКопииВозможна() Экспорт
	
	Узел = ПланыОбмена.МиграцияПриложений.НайтиПоКоду(КодОсновногоУзла());
	
	Возврат ЗначениеЗаполнено(Узел);
	
КонецФункции

// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  КоличествоПотоков - Число
//  ВидПотоков - см. ВыгрузкаЗагрузкаДанныхСлужебный.ВидПотокаВыгрузкиЗагрузкиДанныхПоИмени
// 
// Возвращаемое значение:
//  Массив из ФоновоеЗадание - Запущенные задания выгрузки данных
Функция ЗапуститьПотокиВыгрузкиДанных(ПараметрыПроцессаВыгрузки, КоличествоПотоков = 1, ВидПотоков = Неопределено) Экспорт
	
	ПараметрыПотоков = ВыгрузкаЗагрузкаДанныхСлужебный.НовыеПараметрыПотоковВыгрузкиЗагрузкиДанных();
	ПараметрыПотоков.ЭтоВыгрузка = Истина;
	ПараметрыПотоков.КоличествоПотоков = КоличествоПотоков;
	
	Если ЗначениеЗаполнено(ВидПотоков) Тогда
		ПараметрыПотоков.ВидПотоков = ВидПотоков;
	КонецЕсли;
	
	ПараметрыПотоков.Параметры.Вставить(
		"Контейнер",
		ПараметрыПроцессаВыгрузки.Контейнер.ПолучитьПараметрыИнициализацииВПотоке());
	ПараметрыПотоков.Параметры.Вставить(
		"ПотокЗаписиСопоставляемыхСсылок",
		ПараметрыПроцессаВыгрузки.ПотокЗаписиСопоставляемыхСсылок.ПолучитьПараметрыИнициализацииВПотоке());
	ПараметрыПотоков.Параметры.Вставить("ОсновнойУзел", ПараметрыПроцессаВыгрузки.ОсновнойУзел);
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ЗапуститьПотокиВыгрузкиЗагрузкиДанных(
		ПараметрыПотоков, ПараметрыПроцессаВыгрузки.Контейнер);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новые параметры процесса выгрузки данных информационной базы.
// 
// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - Контейнер
//  Обработчики - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных - Обработчики
//  Сериализатор - СериализаторXDTO - Сериализатор XDTO с аннотацией типов
//  ПараметрыИнициализацииСопоставленияСсылок - см. ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок.ПолучитьПараметрыИнициализацииВПотоке
// 
// Возвращаемое значение:
//  Структура - Новые параметры процесса выгрузки данных информационной базы:
// * Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера 
// * Обработчики - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерОбработчиковВыгрузкиДанных 
// * Сериализатор - СериализаторXDTO 
// * ПотокЗаписиПересоздаваемыхСсылок - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок
// * ПотокЗаписиСопоставляемыхСсылок - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок
// * ВыгружаемыеТипы - Массив Из ОбъектМетаданных
// * ИсключаемыеТипы - Массив Из ОбъектМетаданных
// 					 - ФиксированныйМассив Из ОбъектМетаданных
// * ИспользоватьМногопоточность - Булево
// * ОсновнойУзел - ПланОбменаСсылка.МиграцияПриложений, Неопределено -
// * ДополнительныйУзел - ПланОбменаСсылка.МиграцияПриложений, Неопределено -
Функция НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы(
	Контейнер, Обработчики, Сериализатор, ПараметрыИнициализацииСопоставленияСсылок = Неопределено)
	
	ПотокЗаписиПересоздаваемыхСсылок = Обработки.ВыгрузкаЗагрузкаДанныхПотокЗаписиПересоздаваемыхСсылок.Создать();
	ПотокЗаписиПересоздаваемыхСсылок.Инициализировать(Контейнер, Сериализатор);
	
	ПотокЗаписиСопоставляемыхСсылок = Обработки.ВыгрузкаЗагрузкаДанныхПотокЗаписиСопоставляемыхСсылок.Создать();
	ПотокЗаписиСопоставляемыхСсылок.Инициализировать(Контейнер, Сериализатор, ПараметрыИнициализацииСопоставленияСсылок);
	
	ПараметрыПроцессаВыгрузки = Новый Структура();
	ПараметрыПроцессаВыгрузки.Вставить("Контейнер", Контейнер);
	ПараметрыПроцессаВыгрузки.Вставить("Обработчики", Обработчики);
	ПараметрыПроцессаВыгрузки.Вставить("Сериализатор", Сериализатор);
	ПараметрыПроцессаВыгрузки.Вставить("ПотокЗаписиПересоздаваемыхСсылок", ПотокЗаписиПересоздаваемыхСсылок);
	ПараметрыПроцессаВыгрузки.Вставить("ПотокЗаписиСопоставляемыхСсылок", ПотокЗаписиСопоставляемыхСсылок);
	
	Если Контейнер.ЭтоДочернийПоток() Тогда
		
		ПараметрыПроцессаВыгрузки.Вставить("ВыгружаемыеТипы", Новый Массив());
		ПараметрыПроцессаВыгрузки.Вставить("ИсключаемыеТипы", Новый Массив());
		ПараметрыПроцессаВыгрузки.Вставить("ИспользоватьМногопоточность", Ложь);
		ПараметрыПроцессаВыгрузки.Вставить("ОсновнойУзел", Неопределено);
		ПараметрыПроцессаВыгрузки.Вставить("ДополнительныйУзел", Неопределено);
		
	Иначе
		
		ПараметрыВыгрузки = Контейнер.ПараметрыВыгрузки();
		ИсключаемыеТипы = ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки();
		ИспользоватьМногопоточность = ВыгрузкаЗагрузкаДанныхСлужебный.ИспользоватьМногопоточность(ПараметрыВыгрузки);
		
		ПараметрыПроцессаВыгрузки.Вставить("ВыгружаемыеТипы", ПараметрыВыгрузки.ВыгружаемыеТипы);
		ПараметрыПроцессаВыгрузки.Вставить("ИсключаемыеТипы", ИсключаемыеТипы);
		ПараметрыПроцессаВыгрузки.Вставить("ИспользоватьМногопоточность", ИспользоватьМногопоточность);
		
		ПараметрыПроцессаВыгрузки.Вставить(
			"ОсновнойУзел", ПолучитьОсновнойУзелРезервногоКопирования(Контейнер));
		ПараметрыПроцессаВыгрузки.Вставить(
			"ДополнительныйУзел", ПолучитьДополнительныйУзелРезервногоКопирования(Контейнер));
		
	КонецЕсли;
	
	Возврат ПараметрыПроцессаВыгрузки;
	
КонецФункции

// Выгрузить основные данные.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  Узел - ПланОбменаСсылка.МиграцияПриложений, Неопределено - Узел плана обмена
Процедура ВыгрузитьОсновныеДанные(ПараметрыПроцессаВыгрузки, Узел)
	
	ВыборкаОбъектов = РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ВыборкаОбъектовКОбработке();
	
	Пока ВыборкаОбъектов.Следующий() Цикл
		РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ЗафиксироватьНачалоОбработкиОбъекта(ВыборкаОбъектов);
		ВыгрузитьДанныеОбъектаМетаданных(ВыборкаОбъектов, ПараметрыПроцессаВыгрузки, Узел);
	КонецЦикла;
	
КонецПроцедуры

// Выгрузить основные данные в потоке.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  Узел - ПланОбменаСсылка.МиграцияПриложений, Неопределено - Узел плана обмена
//  ЗаданиеВыгрузки - ФоновоеЗадание - Задание выгрузки
Процедура ВыгрузитьОсновныеДанныеВПотоке(ПараметрыПроцессаВыгрузки, Узел, ЗаданиеВыгрузки)
	
	ИдентификаторЗадания = ЗаданиеВыгрузки.УникальныйИдентификатор;
	
	Пока Истина Цикл
		
		РезультатПолучения = РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.ПолучитьОбъектКОбработке(
			ИдентификаторЗадания);
		
		Если Не РезультатПолучения.ЕстьОбъектыКОбработке Тогда
			Прервать;
		КонецЕсли;
		
		Если РезультатПолучения.Объект <> Неопределено Тогда
			ВыгрузитьДанныеОбъектаМетаданных(РезультатПолучения.Объект, ПараметрыПроцессаВыгрузки, Узел);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыгрузкаЗагрузкаДанныхСлужебный.ПослеЗавершенияПотокаВыгрузкиЗагрузкиДанных(ИдентификаторЗадания);
	
КонецПроцедуры

// Выгрузить данные объекта метаданных.
// 
// Параметры:
//  ВыборкаОбъектов - ВыборкаИзРезультатаЗапроса - Выборка объектов
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  Узел - ПланОбменаСсылка.МиграцияПриложений, Неопределено - Узел плана обмена
Процедура ВыгрузитьДанныеОбъектаМетаданных(ВыборкаОбъектов, ПараметрыПроцессаВыгрузки, Узел)
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ВыборкаОбъектов.ОбъектМетаданных);
	ВыгрузитьОбъектМетаданных(ПараметрыПроцессаВыгрузки, ОбъектМетаданных, Узел);
	
	РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.УдалитьЗапись(ВыборкаОбъектов);
	
КонецПроцедуры

// Выгрузить накопленные основные данные.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  ДополнительныйУзел - ПланОбменаСсылка.МиграцияПриложений - Узел плана обмена
//  ЭтоЗавершениеВыгрузки - Булево - Флаг завершения выгрузки
Процедура ВыгрузитьНакопленныеОсновныеДанные(ПараметрыПроцессаВыгрузки, ДополнительныйУзел, ЭтоЗавершениеВыгрузки = Ложь)
	
	ДанныеИзмененныхОбъектов = МиграцияПриложений.ПолучитьДанныеИзмененныхОбъектов(ДополнительныйУзел);
	МинимальноеКоличествоИзменений = ?(ЭтоЗавершениеВыгрузки, 0, 99);
	
	Если ДанныеИзмененныхОбъектов.КоличествоОбъектов <= МинимальноеКоличествоИзменений Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИЗаписатьТаблицуВыгружаемыхОбъектов(
		ДанныеИзмененныхОбъектов.ТаблицаОбъектов,
		ПараметрыПроцессаВыгрузки.ИсключаемыеТипы);
	
	Если ПараметрыПроцессаВыгрузки.Контейнер.ФиксироватьСостояние() Тогда
		ПараметрыПроцессаВыгрузки.Контейнер.ДополнитьОбщееКоличествоОбъектов(
			ДанныеИзмененныхОбъектов.ТаблицаОбъектов.Итог("КоличествоОбъектов"));
	КонецЕсли;
	
	ВыгрузитьОсновныеДанные(ПараметрыПроцессаВыгрузки, ДополнительныйУзел);
	
	Если Не ЭтоЗавершениеВыгрузки Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(ДополнительныйУзел, 1);
	КонецЕсли;
	
КонецПроцедуры

// Записать выгружаемые объекты метаданных.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
Процедура ЗаписатьВыгружаемыеОбъектыМетаданных(ПараметрыПроцессаВыгрузки)
	
	ТаблицаОбъектов = Новый ТаблицаЗначений();
	ТаблицаОбъектов.Колонки.Добавить("ПолноеИмя", Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектов.Колонки.Добавить("КоличествоОбъектов", Новый ОписаниеТипов("Число"));
	
	Для Каждого ОбъектМетаданных Из ПараметрыПроцессаВыгрузки.ВыгружаемыеТипы Цикл
		
		Если ОбъектМетаданныхИсключенИзВыгрузки(ОбъектМетаданных, ПараметрыПроцессаВыгрузки.ИсключаемыеТипы) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы = ТаблицаОбъектов.Добавить();
		СтрокаТаблицы.ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Если ПараметрыПроцессаВыгрузки.ИспользоватьМногопоточность Тогда
			СтрокаТаблицы.КоличествоОбъектов
				= ПараметрыПроцессаВыгрузки.Контейнер.ОбъектовКОбработкеПоОбъектуМетаданных(ОбъектМетаданных);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписатьТаблицуВыгружаемыхОбъектов(ТаблицаОбъектов);
		
КонецПроцедуры

// Проверить и записать таблицу выгружаемых объектов.
// 
// Параметры:
//  ТаблицаОбъектов - ТаблицаЗначений - Таблица объектов:
// * ПолноеИмя - Строка - Полное имя объекта метаданных
// * КоличествоОбъектов - Число - Количество объектов
//  ИсключаемыеТипы - ФиксированныйМассив из ОбъектМетаданных - Исключаемые типы
Процедура ПроверитьИЗаписатьТаблицуВыгружаемыхОбъектов(ТаблицаОбъектов, ИсключаемыеТипы)
	
	ИндексСтроки = ТаблицаОбъектов.Количество() - 1;
	
	Пока ИндексСтроки >= 0 Цикл
		
		СтрокаТаблицы = ТаблицаОбъектов[ИндексСтроки];
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(СтрокаТаблицы.ПолноеИмя);
		
		Если ОбъектМетаданныхИсключенИзВыгрузки(ОбъектМетаданных, ИсключаемыеТипы) Тогда
			ТаблицаОбъектов.Удалить(ИндексСтроки);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки - 1;
		
	КонецЦикла;
	
	ЗаписатьТаблицуВыгружаемыхОбъектов(ТаблицаОбъектов);
	
КонецПроцедуры

// Записать таблицу выгружаемых объектов.
// 
// Параметры:
//  ТаблицаОбъектов - ТаблицаЗначений - Таблица объектов:
// * ПолноеИмя - Строка - Полное имя объекта метаданных
// * КоличествоОбъектов - Число - Количество объектов
Процедура ЗаписатьТаблицуВыгружаемыхОбъектов(ТаблицаОбъектов)
	
	Если Не ЗначениеЗаполнено(ТаблицаОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОбъектов.Сортировать("КоличествоОбъектов УБЫВ, ПолноеИмя");
	
	ПорядокОбработки = 0;
	НаборЗаписей = РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОбъектов Цикл
		
		ПорядокОбработки = ПорядокОбработки + 1;
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ПорядокОбработки = ПорядокОбработки;
		ЗаписьНабора.ОбъектМетаданных = СтрокаТаблицы.ПолноеИмя;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  ПланОбменаСсылка.МиграцияПриложений, Неопределено - 
Функция ПолучитьОсновнойУзелРезервногоКопирования(Контейнер)
	
	ОсновнойУзел = Неопределено; // Для полной копии узел не используется
	
	Если Контейнер.ЭтоРезервноеКопирование() И Не Контейнер.ВыгрузитьДифференциальнуюКопию() Тогда
		
		// Если выгружается полная резервная копия, то блокируем основной узел от регистрации изменений и очищаем его.
		// Узел будет разблокирован в конце выгрузки данных, после чего на нем начнут накапливаться изменения
		// для последующей дифференциальной резервной копии.
		
		Узел = ПланыОбмена.МиграцияПриложений.НайтиПоКоду(КодОсновногоУзла());
		
		Если ЗначениеЗаполнено(Узел) Тогда
			
			ЗаблокироватьУзелРезервногоКопированияСУдалениемРегистрации(Узел);			
			УдалитьУзелРезервногоКопирования(Узел);
		
		КонецЕсли;
		
	ИначеЕсли Контейнер.ВыгрузитьДифференциальнуюКопию() Тогда
		
		ОсновнойУзел = ПланыОбмена.МиграцияПриложений.НайтиПоКоду(КодОсновногоУзла());
		
	КонецЕсли;
	
	Возврат ОсновнойУзел;
	
КонецФункции

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
// 
// Возвращаемое значение:
//  ПланОбменаСсылка.МиграцияПриложений, Неопределено - 
Функция ПолучитьДополнительныйУзелРезервногоКопирования(Контейнер)
	
	// Если выполняется выгрузка в монопольном режиме, то все данные выгружаются за раз, без накопления изменений.
	ИспользоватьДополнительныйУзел = Не РаботаВМоделиСервисаСлужебный.УстановленМонопольныйРежим();
	ДополнительныйУзел = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.МиграцияПриложений");
		ЭлементБлокировки.УстановитьЗначение("Код", КодДополнительногоУзла());
		Блокировка.Заблокировать();
		
		ДополнительныйУзел = ПланыОбмена.МиграцияПриложений.НайтиПоКоду(КодДополнительногоУзла());
		
		Если ЗначениеЗаполнено(ДополнительныйУзел) Тогда
			
			ЗаблокироватьУзелРезервногоКопированияСУдалениемРегистрации(ДополнительныйУзел);
			
			Если ИспользоватьДополнительныйУзел Тогда
				РазблокироватьУзелРезервногоКопирования(ДополнительныйУзел);
			Иначе
				УдалитьУзелРезервногоКопирования(ДополнительныйУзел);
				ДополнительныйУзел = Неопределено;
			КонецЕсли;
			
		ИначеЕсли ИспользоватьДополнительныйУзел Тогда
			
			УзелОбъект = ПланыОбмена.МиграцияПриложений.СоздатьУзел();
			УзелОбъект.Код = КодДополнительногоУзла();
			УзелОбъект.Наименование = НСтр("ru = 'Резервное копирование (дополнительный узел)'");
			УзелОбъект.Записать();
			
			ДополнительныйУзел = УзелОбъект.Ссылка;
		
		Иначе
			ДополнительныйУзел = Неопределено;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ДополнительныйУзел) Тогда
		
		Попытка
			ЗаблокироватьДанныеДляРедактирования(ДополнительныйУзел);
		Исключение
			
			ТекстИсключения = СтрШаблон(
				НСтр("ru = 'Не удалось запустить выгрузку данных, выгрузка уже выполняется другим заданием.
					 |Дождитесь его завершения или принудительно завершите сеанс.
					 |%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ВызватьИсключение ТекстИсключения;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ДополнительныйУзел;
	
КонецФункции

// Параметры:
//  Узел - ПланОбменаСсылка.МиграцияПриложений
Процедура УдалитьУзелРезервногоКопирования(Узел)
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.ОбменДанными.Загрузка = Истина;
	УзелОбъект.Удалить();
					
КонецПроцедуры

// Параметры:
//  Узел - ПланОбменаСсылка.МиграцияПриложений
Процедура ЗаблокироватьУзелРезервногоКопированияСУдалениемРегистрации(Узел)
	
	ИзменитьБлокировкуУзлаРезервногоКопирования(Узел, Истина);
	
	// Изменения удаляются вне транзакции, т.к. регистрация на узел уже не будет выполняться, потому что он заблокирован.
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
	
КонецПроцедуры

// Параметры:
//  Узел - ПланОбменаСсылка.МиграцияПриложений
Процедура РазблокироватьУзелРезервногоКопирования(Узел)
	
	ИзменитьБлокировкуУзлаРезервногоКопирования(Узел, Ложь);
	
КонецПроцедуры

// Параметры:
//  Узел - ПланОбменаСсылка.МиграцияПриложений
//  Заблокирован - Булево
Процедура ИзменитьБлокировкуУзлаРезервногоКопирования(Узел, Заблокирован)
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.МиграцияПриложений");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Узел);
		Блокировка.Заблокировать();
		
		УзелОбъект = Узел.ПолучитьОбъект();
		
		Если УзелОбъект.Заблокирован <> Заблокирован Тогда
			
			УзелОбъект.Заблокирован = Заблокирован;
			УзелОбъект.ОбменДанными.Загрузка = Истина;
			
			УзелОбъект.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Объект метаданных исключен из выгрузки.
// 
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
//  ИсключаемыеТипы - Массив Из ОбъектМетаданных - Исключаемые типы
// 
// Возвращаемое значение:
//  Булево - Объект метаданных исключен из выгрузки
Функция ОбъектМетаданныхИсключенИзВыгрузки(ОбъектМетаданных, ИсключаемыеТипы)
	
	Если ОбъектМетаданных = Метаданные.Справочники.Пользователи
		Или Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоИсключаемыйТип(ИсключаемыеТипы, ОбъектМетаданных) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Если объект добавлен расширением и не входит в состав плана Миграция приложений, тогда
	// выгружать данные необходимо при завершении выгрузки, после установки монопольного режима
	Если Не РаботаВМоделиСервисаСлужебный.УстановленМонопольныйРежим()
		И ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено
		И Не Метаданные.ПланыОбмена.МиграцияПриложений.Состав.Содержит(ОбъектМетаданных) Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Выгрузить общие данные.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
Процедура ВыгрузитьОбщиеДанные(ПараметрыПроцессаВыгрузки)
	
	ВыгружаемыеТипы = ПараметрыПроцессаВыгрузки.Контейнер.ПараметрыВыгрузки().ВыгружаемыеТипыОбщихДанных;
	
	Для Каждого ОбъектМетаданных Из ВыгружаемыеТипы Цикл
		
		Если ЭтоИсключаемыйТип(ПараметрыПроцессаВыгрузки.ИсключаемыеТипы, ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыгрузитьОбъектМетаданных(ПараметрыПроцессаВыгрузки, ОбъектМетаданных);
		
	КонецЦикла;
	
КонецПроцедуры

// Выгрузить накопленные основные данные.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  ДополнительныйУзел - ПланОбменаСсылка.МиграцияПриложений
Функция ЗавершитьВыгрузкуВТранзакции(ПараметрыПроцессаВыгрузки, ДополнительныйУзел)
	
	КоличествоОбъектовРасширенийНеВМиграцииДляБлокировки = 
		ВыгрузкаЗагрузкаДанныхСлужебный.КоличествоОбъектовРасширенийНеВМиграцииДляБлокировки();
	Если КоличествоОбъектовРасширенийНеВМиграцииДляБлокировки > 0 Тогда
		
		ОбъектовРасширенийНеВМиграции = КоличествоОбъектовРасширенийНеВМиграции(
			ПараметрыПроцессаВыгрузки.Контейнер, 
			ПараметрыПроцессаВыгрузки.ВыгружаемыеТипы, 
			ПараметрыПроцессаВыгрузки.ИсключаемыеТипы);
		
		Если ОбъектовРасширенийНеВМиграции > КоличествоОбъектовРасширенийНеВМиграцииДляБлокировки Тогда
			ВыгрузкаЗагрузкаДанныхСлужебный.ОповеститьПользователейОЗавершенииВыгрузки();
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ВыгрузкаЗагрузкаДанныхСлужебный.НачатьЗавершениеВыгрузкиВТранзакции();
		Попытка
			
			// При изменении объектов выполняется их регистрация на узлах плана обмена МиграцияПриложений.
			// Перед регистрацией устанавливается разделяемая блокировка на весь план обмена.
			// Для консистентной резервной копии исключительно блокируем дополнительный узел.
			
			Блокировка = Новый БлокировкаДанных();
			ЭлементБлокировки = Блокировка.Добавить("ПланОбмена.МиграцияПриложений");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ДополнительныйУзел);
			Блокировка.Заблокировать();
		
		Исключение
			
			ОтменитьТранзакцию();
			Возврат Ложь;
			
		КонецПопытки;
		
		ВыгружатьДанныеРасширений = ЗначениеЗаполнено(ДополнительныйУзел);
		ВыгрузитьНакопленныеОсновныеДанные(ПараметрыПроцессаВыгрузки, ДополнительныйУзел, Истина);
		ЗавершитьВыгрузку(ПараметрыПроцессаВыгрузки, ВыгружатьДанныеРасширений);
		
		ЗаблокироватьУзелРезервногоКопированияСУдалениемРегистрации(ДополнительныйУзел);
		УдалитьУзелРезервногоКопирования(ДополнительныйУзел);
					
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  ВыгружатьДанныеРасширений - Булево
//
Процедура ЗавершитьВыгрузку(ПараметрыПроцессаВыгрузки, ВыгружатьДанныеРасширений)
	
	ОбъектМетаданных_Пользователи = Метаданные.Справочники.Пользователи;
	
	Для Каждого ОбъектМетаданных Из ПараметрыПроцессаВыгрузки.ВыгружаемыеТипы Цикл
		
		Если ЭтоИсключаемыйТип(ПараметрыПроцессаВыгрузки.ИсключаемыеТипы, ОбъектМетаданных) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначенияБТС.ЭтоНаборЗаписейПоследовательности(ОбъектМетаданных) Тогда
			
			ВыгрузкаЗагрузкаДанныхГраницПоследовательностейСлужебный.ПередВыгрузкойТипа(
				ПараметрыПроцессаВыгрузки.Контейнер,
				ПараметрыПроцессаВыгрузки.Сериализатор,
				ОбъектМетаданных,
				Ложь);
				
			Продолжить;
			
		КонецЕсли;
		
		ВыгружатьОбъектМетаданных = ОбъектМетаданных = ОбъектМетаданных_Пользователи
			Или Метаданные.ПланыОбмена.Содержит(ОбъектМетаданных);
			
		Если Не ВыгружатьОбъектМетаданных И ВыгружатьДанныеРасширений Тогда
			ВыгружатьОбъектМетаданных = ОбъектМетаданных.РасширениеКонфигурации() <> Неопределено
				И Не Метаданные.ПланыОбмена.МиграцияПриложений.Состав.Содержит(ОбъектМетаданных);
		КонецЕсли;
		
		Если ВыгружатьОбъектМетаданных Тогда
			ВыгрузитьОбъектМетаданных(ПараметрыПроцессаВыгрузки, ОбъектМетаданных);
		КонецЕсли;
		
	КонецЦикла;
	
	// Разблокируем основной узел резервного копирования, чтобы на нем начали накапливаться изменения
	// для дифференциальной резервной копии. Основной узел блокируется только при выгрузке полной резервной копии,
	// в данном случае будет заполнен соответствующий параметр процесса выгрузки.
	
	Если ЗначениеЗаполнено(ПараметрыПроцессаВыгрузки.ОсновнойУзел) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновнойУзел = ПланыОбмена.МиграцияПриложений.НайтиПоКоду(КодОсновногоУзла());
	
	// Если основной узел не существует, то дифференциальное резервное копирование не используется.
	Если ЗначениеЗаполнено(ОсновнойУзел) Тогда
		РазблокироватьУзелРезервногоКопирования(ОсновнойУзел);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера
//  ВыгружаемыеТипы - Массив Из ОбъектМетаданных
//  ИсключаемыеТипы - Массив Из ОбъектМетаданных
//
Функция КоличествоОбъектовРасширенийНеВМиграции(Контейнер, ВыгружаемыеТипы, ИсключаемыеТипы)
	
	КоличествоОбъектовВсего = 0;
	КоличествоОбрабатываемыхОбъектовОпределено = Контейнер.КоличествоОбрабатываемыхОбъектовОпределено();
	ОбъектыМетаданныхДляПодсчета = Новый Массив;
	Для Каждого ОбъектМетаданных Из ВыгружаемыеТипы Цикл
		
		Если ИсключаемыеТипы.Найти(ОбъектМетаданных) <> Неопределено 
			Или ОбъектМетаданных.РасширениеКонфигурации() = Неопределено
			Или Метаданные.ПланыОбмена.МиграцияПриложений.Состав.Содержит(ОбъектМетаданных)Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если КоличествоОбрабатываемыхОбъектовОпределено Тогда
			КоличествоОбъектовВсего = 
				КоличествоОбъектовВсего + Контейнер.ОбъектовКОбработкеПоОбъектуМетаданных(ОбъектМетаданных);
		Иначе
			ОбъектыМетаданныхДляПодсчета.Добавить(ОбъектМетаданных);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбъектыМетаданныхДляПодсчета.Количество() = 0 Тогда
		Возврат КоличествоОбъектовВсего;
	КонецЕсли;
	
	ТаблицаКоличестваВыгружаемыхОбъектов = ВыгрузкаЗагрузкаДанныхСлужебный.КоличествоВыгружаемыхОбъектовПоОбъектамМетаданных(
		ОбъектыМетаданныхДляПодсчета, Новый Массив, Ложь);
	
	КоличествоОбъектовВсего = КоличествоОбъектовВсего + ТаблицаКоличестваВыгружаемыхОбъектов.Итог("ЧислоОбъектов");
	
	Возврат КоличествоОбъектовВсего;
	
КонецФункции

Функция КодОсновногоУзла()
	
	Возврат "c191c628-b094-11ea-a48c-0242ac130016";
		
КонецФункции

Функция КодДополнительногоУзла()
	
	Возврат "974d5c6d-2d7e-4067-9614-dac005823e0e";
		
КонецФункции

Функция ЭтоИсключаемыйТип(ИсключаемыеТипы, ОбъектМетаданных)
	
	Если ИсключаемыеТипы.Найти(ОбъектМетаданных) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Событие = НСтр(
		"ru = 'Выгрузка загрузка данных. Выгрузка объекта пропущена'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	Комментарий = СтрШаблон(
		НСтр("ru = 'Выгрузка данных объекта метаданных %1 пропущена, т.к. он включен в
			 |список объектов метаданных, исключаемых из выгрузки и загрузки данных'"),
		ОбъектМетаданных.ПолноеИмя());
	
	ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Информация, ОбъектМетаданных, , Комментарий);
		
	Возврат Истина;
	
КонецФункции

// Выгрузить объект метаданных.
// 
// Параметры:
//  ПараметрыПроцессаВыгрузки - см. НовыеПараметрыПроцессаВыгрузкиДанныхИнформационнойБазы
//  ОбъектМетаданных - ОбъектМетаданных - Выгружаемый объект метаданных
//  Узел - ПланОбменаСсылка.МиграцияПриложений, Неопределено - Узел
Процедура ВыгрузитьОбъектМетаданных(ПараметрыПроцессаВыгрузки, ОбъектМетаданных, Узел = Неопределено)
			
	МенеджерВыгрузкиОбъекта = Создать();
	
	МенеджерВыгрузкиОбъекта.Инициализировать(
		ПараметрыПроцессаВыгрузки.Контейнер,
		ОбъектМетаданных,
		Узел,
		ПараметрыПроцессаВыгрузки.Обработчики,
		ПараметрыПроцессаВыгрузки.Сериализатор,
		ПараметрыПроцессаВыгрузки.ПотокЗаписиПересоздаваемыхСсылок,
		ПараметрыПроцессаВыгрузки.ПотокЗаписиСопоставляемыхСсылок);
	
	МенеджерВыгрузкиОбъекта.ВыгрузитьДанные();
	
	МенеджерВыгрузкиОбъекта.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
