////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

Процедура ПриЧтенииНаСервере(Форма) Экспорт
	ПриПолученииДанныхНаСервере(Форма);
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	ПриПолученииДанныхНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

Процедура ВыполнениеКомандыНаСервере(Форма) Экспорт
	МодульКонтракта().ВыполнениеКомандыНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиВХОФормыБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиВХОФормыРасширенный");
	КонецЕсли;
	
КонецФункции

Процедура ПриПолученииДанныхНаСервере(Форма)
	МодульКонтракта().ПриПолученииДанныхНаСервере(Форма);
КонецПроцедуры

#КонецОбласти
