// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
			МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
			МодульФинансовыйУчет.УстановитьТипЗначенияСтатьиРасходов(Объект);
		Иначе
			Объект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПрочиеРасходы");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти