#Область СлужебныйПрограммныйИнтерфейс

Процедура ВвестиСписаниеСИЗИзЭксплуатации(ПараметрКоманды, ДополнительныеПараметры) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Основание", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ИмяДокумента", "СписаниеСИЗИзЭксплуатации");
	ДополнительныеПараметры.Вставить("ИмяДействия", НСтр("ru = 'списать'"));
	
	ПриВводеДокументаНаОснованииВыдачиСИЗ(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ВвестиПродлениеСроковНоскиСИЗ(ПараметрКоманды, ДополнительныеПараметры) Экспорт
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("Основание", ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ИмяДокумента", "ПродлениеСроковНоскиСИЗ");
	ДополнительныеПараметры.Вставить("ИмяДействия", НСтр("ru = 'продлить'"));
	
	ПриВводеДокументаНаОснованииВыдачиСИЗ(ДополнительныеПараметры);

КонецПроцедуры

Процедура ВвестиДокументНаОснованииВыдачиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Основание", ДополнительныеПараметры.Основание);
	ДанныеЗаполнения.Вставить("УчитыватьТолькоОтмеченные", Результат = "ТолькоОтмеченные");
	ДанныеЗаполнения.Вставить("УчитыватьТолькоИстекающие", Результат = "ТолькоИстекающие");
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ПараметрыФормы.ЗначенияЗаполнения = ДанныеЗаполнения;
	
	ОткрытьФорму(СтрШаблон("Документ.%1.ФормаОбъекта", ДополнительныеПараметры.ИмяДокумента), ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриВводеДокументаНаОснованииВыдачиСИЗ(ДополнительныеПараметры)
	
	Оповещение = Новый ОписаниеОповещения("ВвестиДокументНаОснованииВыдачиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = СтрШаблон(НСтр("ru = 'Какие СИЗ следует %1:
							|только отмеченные с истекающим сроком носки,
							|все отмеченные независимо от срока носки
							|или все ранее выданные без исключения?'"), ДополнительныеПараметры.ИмяДействия);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ТолькоИстекающие", НСтр("ru = 'Только истекающие'"));
	Кнопки.Добавить("ТолькоОтмеченные", НСтр("ru = 'Только отмеченные'"));
	Кнопки.Добавить("ВсеВыданныеСИЗ", НСтр("ru = 'Все ранее выданные'"));
	Кнопки.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки)
	
КонецПроцедуры

#КонецОбласти
 