#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Действие") И ДанныеЗаполнения.Действие = "Исправить" Тогда
			ИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(ЭтотОбъект, ДанныеЗаполнения.Ссылка);
			ИсправленныйДокумент = ДанныеЗаполнения.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Сотрудники.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник");
	МассивФизическихЛиц = Новый Массив;
	ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСотрудников, "ФизическоеЛицо");
	Для каждого ЭлементСоответствия Из ФизическиеЛицаСотрудников Цикл
		Если МассивФизическихЛиц.Найти(ЭлементСоответствия.Значение) = Неопределено Тогда
			МассивФизическихЛиц.Добавить(ЭлементСоответствия.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	Для каждого ЗначениеСтруктуры Из СтруктураИменТаблиц Цикл
		Если ЗначениеСтруктуры.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		СтрокиДляУдаления = Новый Массив;
		Для Каждого СтрокаТаблицы Из ЭтотОбъект[ЗначениеСтруктуры.Значение] Цикл
			Если СтрНайти(ЗначениеСтруктуры.Ключ, "Сотрудник") > 0 Тогда
				Если МассивСотрудников.Найти(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
					СтрокиДляУдаления.Добавить(СтрокаТаблицы);
				КонецЕсли;
			Иначе
				Если МассивФизическихЛиц.Найти(СтрокаТаблицы.ФизическоеЛицо) = Неопределено Тогда
					СтрокиДляУдаления.Добавить(СтрокаТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ЭтотОбъект[ЗначениеСтруктуры.Значение].Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЦикла;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		СтрокиГрафикаДляУдаления = Новый Массив;
		Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
			Если МассивФизическихЛиц.Найти(СтрокаГрафика.ФизическоеЛицо) = Неопределено Тогда
				СтрокиГрафикаДляУдаления.Добавить(СтрокаГрафика);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаГрафикаДляУдаления Из СтрокиГрафикаДляУдаления Цикл
			ГрафикУдержаний.Удалить(СтрокаГрафикаДляУдаления);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОтражениеЗарплатыВБухучетеРасширенный.УточнитьСоставПроверяемыхРеквизитовБухучетПлановыхУдержаний(ЭтотОбъект, ПроверяемыеРеквизиты);
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачалаСтрахования, "Объект.ДатаНачалаСтрахования", Отказ, НСтр("ru='Дата начала события'"), , , Ложь);
	
	УникальныеЗначения = Новый Соответствие;
	ИндексСтроки = 0;
	Для Каждого ДанныеФизическогоЛица Из Сотрудники Цикл
		Если УникальныеЗначения[ДанныеФизическогоЛица.Сотрудник] = Неопределено Тогда
			УникальныеЗначения.Вставить(ДанныеФизическогоЛица.Сотрудник, Истина);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Информация о сотруднике %1 была введена в документе ранее.'"),
				ДанныеФизическогоЛица.Сотрудник);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка,
				"Объект.Сотрудники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].Сотрудник", ,Отказ);
		КонецЕсли;
		Если ДанныеФизическогоЛица.СтраховатьСотрудника Тогда
			ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаПрикрепления,
				"Объект.Сотрудники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаПрикрепления", Отказ,
				НСтр("ru='Дата прикрепления сотрудника'"), ДатаНачалаСтрахования, НСтр("ru='Даты договора'"));
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	ИндексСтроки = 0;
	Для Каждого ДанныеФизическогоЛица Из Родственники Цикл
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаОткрепления,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаОткрепления", Отказ,
			НСтр("ru='Дата открепления родственника'"), ДанныеФизическогоЛица.ДатаПрикрепления, НСтр("ru='Даты прикрепления'"));
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаОкончанияСтрахования,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаОткрепления", Отказ,
			НСтр("ru='Срок действия договора'"), ДанныеФизическогоЛица.ДатаОткрепления, НСтр("ru='Даты открепления родственника'"));
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаПрикрепления,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаПрикрепления", Отказ,
			НСтр("ru='Дата прикрепления родственника'"), ДатаНачалаСтрахования, НСтр("ru='Даты договора'"));
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияРабочихМестВОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация 		= Организация;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода		= ДатаНачалаСтрахования;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода	= ДатаОкончанияСтрахования;
	
	КадровыйУчет.ПроверитьРаботающихСотрудников(
		ОбщегоНазначения.ВыгрузитьКолонку(Сотрудники, "Сотрудник"),
		ПараметрыПолученияСотрудниковОрганизаций,
		Отказ,
		Новый Структура("ИмяПоляСотрудник, ИмяОбъекта", "Сотрудник", "Объект"));
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		ИндексСтроки = 0;
		Для Каждого ДанныеФизическогоЛица Из Сотрудники Цикл
			Если ДанныеФизическогоЛица.СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику Тогда
				Если ДанныеФизическогоЛица.ЧастичноеУдержание Тогда
					СуммаУдержания = ДанныеФизическогоЛица.СуммаЧастичногоУдержания;
				Иначе
					СуммаУдержания = ДанныеФизическогоЛица.ОбщаяСуммаУдержания;
				КонецЕсли;
				Отбор = Новый Структура("ФизическоеЛицо", ДанныеФизическогоЛица.ФизическоеЛицо);
				ГрафикУдержанийСотрудника = ГрафикУдержаний.НайтиСтроки(Отбор);
				СуммаПоГрафику = 0;
				Для Каждого СтрокаГрафика Из ГрафикУдержанийСотрудника Цикл
					СуммаПоГрафику = СтрокаГрафика.Сумма + СуммаПоГрафику;
				КонецЦикла;
				Если СуммаУдержания <> СуммаПоГрафику Тогда
					ШаблонТекстаОшибки = НСтр("ru = 'У сотрудника %1 сумма удержания по графику %2 руб. отличается от общей суммы удержания %3 руб.'");
					ТекстОшибки = СтрШаблон(
						ШаблонТекстаОшибки,
						ДанныеФизическогоЛица.Сотрудник,
						СуммаПоГрафику,
						СуммаУдержания);
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "Объект.Сотрудники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].Сотрудник", , Отказ);
				КонецЕсли;
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Подготовка к регистрации перерасчетов
	ДанныеДокумента = Новый МенеджерВременныхТаблиц;
	СоздатьВТДанныеДокументов(ДанныеДокумента);
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ИсправлениеДокументовЗарплатаКадры.ПриПроведенииИсправления(Ссылка, Движения, РежимПроведения, Отказ,,, ЭтотОбъект, "ДатаНачалаСтрахования");
	
	ПроверитьДействующиеПрикрепления(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьДвиженияПрикрепленияКПрограммамСтрахования(Движения, ДанныеДокумента);
	
	СформироватьДвиженияОтправленныеДанныеЗастрахованных(Движения);
	СформироватьДвиженияОтправленнаяКонтактнаяИнформацияЗастрахованных(Движения);
	СформироватьДвиженияОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных(Движения);
	СформироватьДвиженияПолисыДМС(Движения);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		ДанныеДляПроведения = РасчетЗарплатыРасширенный.СоздатьДанныеДляРегистрацииПлановыхУдержаний();
		ЗаполнитьДанныеДляРегистрацииПлановыхУдержанийСпискаСотрудников(ДанныеДляПроведения, Ссылка);
		ЗаполнитьПредельныеСуммыУдержанийСотрудников(ДанныеДляПроведения);
		
		ДвиженияУдержаний = Новый Структура;
		ДвиженияУдержаний.Вставить("ДанныеПлановыхУдержаний", ДанныеДляПроведения.ДанныеПлановыхУдержаний);
		ДвиженияУдержаний.Вставить("ЗначенияПоказателей", ДанныеДляПроведения.ЗначенияПоказателей);
		ДвиженияУдержаний.Вставить("РабочиеМестаУдержаний", ДанныеДляПроведения.РабочиеМестаУдержаний);
		
		РасчетЗарплатыРасширенный.СформироватьДвиженияПлановыхУдержаний(Движения, ДвиженияУдержаний);
		РасчетЗарплатыРасширенный.СформироватьДвиженияПредельныхСуммУдержанийСотрудников(Движения, ДанныеДляПроведения.ПредельныеСуммыУдержанийСотрудников);
		
		СформироватьДвиженияУдержаний(Движения);
		СформироватьДвиженияГрафикаУдержаний(Движения);
	КонецЕсли;
	
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Движения, Отказ, ДанныеДокумента);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Движения, Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДействующиеПрикрепления(Отказ)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НеПроверятьДействующиеПрикрепления", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники.Выгрузить());
	Запрос.УстановитьПараметр("ДатаОкончанияСтрахования", ДатаОкончанияСтрахования);
	Запрос.УстановитьПараметр("ПрограммыСтрахованияСотрудников", ПрограммыСтрахованияСотрудников.Выгрузить());
	Запрос.УстановитьПараметр("РасширенияПрограммСтрахованияСотрудников", РасширенияПрограммСтрахованияСотрудников.Выгрузить());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДоговорСтрахования", ДоговорСтрахования);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
	|	&ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования,
	|	Сотрудники.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	&Сотрудники КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрограммыСтрахованияСотрудников.Сотрудник КАК Сотрудник,
	|	ПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования
	|ПОМЕСТИТЬ ВТПрограммыСтрахованияСотрудников
	|ИЗ
	|	&ПрограммыСтрахованияСотрудников КАК ПрограммыСтрахованияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасширенияПрограммСтрахованияСотрудников.Сотрудник КАК Сотрудник,
	|	РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеСтрахования
	|ПОМЕСТИТЬ ВТРасширенияПрограммСтрахованияСотрудников
	|ИЗ
	|	&РасширенияПрограммСтрахованияСотрудников КАК РасширенияПрограммСтрахованияСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
	|	Сотрудники.ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования,
	|	ПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	Сотрудники.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрограммыСтрахованияСотрудников КАК ПрограммыСтрахованияСотрудников
	|		ПО Сотрудники.Сотрудник = ПрограммыСтрахованияСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних КАК ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних
	|		ПО (ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Организация = &Организация)
	|			И (ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДоговорСтрахования = &ДоговорСтрахования)
	|			И (ПрограммыСтрахованияСотрудников.ПрограммаСтрахования = ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ПрограммаСтрахования)
	|			И Сотрудники.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Регистратор <> &Ссылка
	|	И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Действует
	|	И (Сотрудники.ДатаПрикрепления МЕЖДУ ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Период И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДействуетДо
	|			ИЛИ Сотрудники.ДатаОкончанияСтрахования МЕЖДУ ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.Период И ПрограммыМедицинскогоСтрахованияСотрудниковСрезПоследних.ДействуетДо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
	|	Сотрудники.ДатаОкончанияСтрахования КАК ДатаОкончанияСтрахования,
	|	РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеСтрахования,
	|	Сотрудники.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТСотрудники КАК Сотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасширенияПрограммСтрахованияСотрудников КАК РасширенияПрограммСтрахованияСотрудников
	|		ПО Сотрудники.Сотрудник = РасширенияПрограммСтрахованияСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудников
	|		ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И (РасширенияПрограммМедицинскогоСтрахованияСотрудников.ДоговорСтрахования = &ДоговорСтрахования)
	|			И (РасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования = РасширенияПрограммМедицинскогоСтрахованияСотрудников.РасширениеПрограммСтрахования)
	|			И Сотрудники.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|ГДЕ
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Регистратор <> &Ссылка
	|	И РасширенияПрограммМедицинскогоСтрахованияСотрудников.Действует
	|	И (Сотрудники.ДатаПрикрепления МЕЖДУ РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ДействуетДо
	|			ИЛИ Сотрудники.ДатаОкончанияСтрахования МЕЖДУ РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ДействуетДо)";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ШаблонТекстаОшибки = НСтр("ru = 'Сотрудник %1 прикреплен к программе страхования ""%2"" в периоде с %3 по %4.'");
	ВыборкаПрограммСтрахования = РезультатЗапроса[3].Выбрать();
	Пока ВыборкаПрограммСтрахования.Следующий() Цикл
		ТекстОшибки = СтрШаблон(
			ШаблонТекстаОшибки,
			ВыборкаПрограммСтрахования.Сотрудник,
			ВыборкаПрограммСтрахования.ПрограммаСтрахования,
			Формат(ВыборкаПрограммСтрахования.ДатаПрикрепления, "ДЛФ=D"),
			Формат(ВыборкаПрограммСтрахования.ДатаОкончанияСтрахования, "ДЛФ=D"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "Объект.Сотрудники[" + Формат(ВыборкаПрограммСтрахования.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сотрудник", , Отказ);
	КонецЦикла;
	
	ШаблонТекстаОшибки = НСтр("ru = 'Сотрудник %1 прикреплен к расширению программы страхования ""%2"" в периоде с %3 по %4.'");
	ВыборкаРасширенийПрограммСтрахования = РезультатЗапроса[4].Выбрать();
	Пока ВыборкаРасширенийПрограммСтрахования.Следующий() Цикл
		ТекстОшибки = СтрШаблон(
			ШаблонТекстаОшибки,
			ВыборкаРасширенийПрограммСтрахования.Сотрудник,
			ВыборкаРасширенийПрограммСтрахования.РасширениеСтрахования,
			Формат(ВыборкаРасширенийПрограммСтрахования.ДатаПрикрепления, "ДЛФ=D"),
			Формат(ВыборкаРасширенийПрограммСтрахования.ДатаОкончанияСтрахования, "ДЛФ=D"));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "Объект.Сотрудники[" + Формат(ВыборкаРасширенийПрограммСтрахования.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].Сотрудник", , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьВТДанныеДокументов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ДоговорСтрахования КАК ДоговорСтрахования,
	|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	"""" КАК Родственник,
	|	ПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	ИСТИНА КАК Действует,
	|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
	|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
	|	ПрикреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
	|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийПрограммСтрахования
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрикреплениеПрограммыСтрахованияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
	|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
	|			И ПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ПрикреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ДоговорСтрахования,
	|	ПрикреплениеРодственники.ФизическоеЛицо,
	|	ПрикреплениеРодственники.РодственникСсылка,
	|	ПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
	|	ИСТИНА,
	|	ПрикреплениеРодственники.ДатаПрикрепления,
	|	ПрикреплениеРодственники.ДатаОткрепления,
	|	ПрикреплениеПрограммыСтрахованияРодственников.СтраховаяПремия
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрикреплениеПрограммыСтрахованияРодственников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
	|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
	|			И ПрикреплениеПрограммыСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ПрикреплениеПрограммыСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ДоговорСтрахования КАК ДоговорСтрахования,
	|	ПрикреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	"""" КАК Родственник,
	|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
	|	ИСТИНА КАК Действует,
	|	ПрикреплениеСотрудники.ДатаПрикрепления КАК Период,
	|	ТаблицаДокумента.ДатаОкончанияСтрахования КАК ДействуетДо,
	|	ПрикреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
	|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ПрикреплениеРасширенияПрограммСтрахованияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеСотрудники
	|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ПрикреплениеСотрудники.Ссылка
	|			И ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ПрикреплениеСотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ПрикреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.ДоговорСтрахования,
	|	ПрикреплениеРодственники.ФизическоеЛицо,
	|	ПрикреплениеРодственники.РодственникСсылка,
	|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
	|	ИСТИНА,
	|	ПрикреплениеРодственники.ДатаПрикрепления,
	|	ПрикреплениеРодственники.ДатаОткрепления,
	|	ПрикреплениеРасширенияПрограммСтрахованияРодственников.СтраховаяПремия
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ПрикреплениеРасширенияПрограммСтрахованияРодственников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеРодственники
	|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ПрикреплениеРодственники.Ссылка
	|			И ПрикреплениеРасширенияПрограммСтрахованияРодственников.РодственникСсылка = ПрикреплениеРодственники.РодственникСсылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ПрикреплениеРасширенияПрограммСтрахованияРодственников.Ссылка = ТаблицаДокумента.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьПредельныеСуммыУдержанийСотрудников(ДанныеДляПроведения)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период,
	|	ПрикреплениеКПрограммамМедицинскогоСтрахования.Организация.ГоловнаяОрганизация КАК Организация,
	|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
	|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
	|	ИСТИНА КАК ПрекратитьПоДостижениюПредела,
	|	ВЫБОР
	|		КОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ЧастичноеУдержание
	|			ТОГДА ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания
	|		ИНАЧЕ ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммамМедицинскогоСтрахования
	|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахования.Ссылка
	|ГДЕ
	|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Документ
	|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания <> 0
	|	И (ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно)
	|			ИЛИ ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно))";
	
	ДанныеДляПроведения.ПредельныеСуммыУдержанийСотрудников = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// Заполняет данные для проведения плановых удержаний для многосотрудникового документа.
//
// Параметры:
//		ДанныеДляПроведения - Структура, описанная в СоздатьДанныеДляРегистрацииПлановыхУдержаний.
//		Документ - Ссылка на документ.
//
Процедура ЗаполнитьДанныеДляРегистрацииПлановыхУдержанийСпискаСотрудников(ДанныеДляПроведения, Документ) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументУдержания.ДатаПрикрепления КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ДокументУдержания.Ссылка.ДатаОкончанияСтрахования > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДокументУдержания.Ссылка.ДатаОкончанияСтрахования, ДЕНЬ, 1)
	|		ИНАЧЕ ДокументУдержания.Ссылка.ДатаОкончанияСтрахования
	|	КОНЕЦ КАК ДействуетДо,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Ссылка.Организация.ГоловнаяОрганизация КАК Организация,
	|	ДокументУдержания.Удержание КАК Удержание,
	|	ДокументУдержания.Ссылка КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ДокументУдержания.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно)
	|			ТОГДА ДокументУдержания.СуммаУдержания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументУдержания.ЧастичноеУдержание
	|					ТОГДА ДокументУдержания.СуммаЧастичногоУдержания
	|				ИНАЧЕ ДокументУдержания.ОбщаяСуммаУдержания
	|			КОНЕЦ
	|	КОНЕЦ КАК Размер,
	|	ИСТИНА КАК Используется
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И ДокументУдержания.ОбщаяСуммаУдержания <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументУдержания.ДатаПрикрепления КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ДокументУдержания.Ссылка.ДатаОкончанияСтрахования > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДокументУдержания.Ссылка.ДатаОкончанияСтрахования, ДЕНЬ, 1)
	|		ИНАЧЕ ДокументУдержания.Ссылка.ДатаОкончанияСтрахования
	|	КОНЕЦ КАК ДействуетДо,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Ссылка.Организация.ГоловнаяОрганизация КАК Организация,
	|	ДокументУдержания.Ссылка КАК ДокументОснование,
	|	ЗначенияПоказателей.Показатель КАК Показатель,
	|	ЗначенияПоказателей.Значение КАК Значение
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Показатели КАК ЗначенияПоказателей
	|		ПО (ЗначенияПоказателей.Ссылка = ДокументУдержания.Ссылка)
	|			И (ЗначенияПоказателей.ИдентификаторСтрокиВидаРасчета = ДокументУдержания.ИдентификаторСтрокиВидаРасчета)
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И (ДокументУдержания.СуммаУдержания <> 0
	|			ИЛИ &ВидРасчетаРассчитывается)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументУдержания.ДатаПрикрепления КАК Период,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Ссылка КАК ДокументОснование,
	|	ДокументУдержания.Сотрудник КАК РабочееМесто
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И ДокументУдержания.ОбщаяСуммаУдержания > 0";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Документ);
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Удержание);
	Запрос.УстановитьПараметр("ВидРасчетаРассчитывается", ?(ВидРасчетаИнфо.Рассчитывается = Неопределено, Ложь, ВидРасчетаИнфо.Рассчитывается));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения.ДанныеПлановыхУдержаний = РезультатыЗапроса[0].Выгрузить();
	ДанныеДляПроведения.ЗначенияПоказателей = РезультатыЗапроса[1].Выгрузить();
	ДанныеДляПроведения.РабочиеМестаУдержаний = РезультатыЗапроса[2].Выгрузить();
	
КонецПроцедуры

Процедура СформироватьДвиженияПрикрепленияКПрограммамСтрахования(Движения, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийПрограммСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
	|	СуммыСтраховыхПремийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийПрограммСтрахования.Родственник КАК Родственник,
	|	СуммыСтраховыхПремийПрограммСтрахования.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	СуммыСтраховыхПремийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийПрограммСтрахования КАК СуммыСтраховыхПремийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Родственник КАК Родственник,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования КАК СуммыСтраховыхПремийРасширенийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияОтправленныеДанныеЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Имя КАК Имя,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Отчество КАК Отчество,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|			И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка.ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Имя,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Отчество,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|			И ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленныеДанныеЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленныеДанныеЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияОтправленнаяКонтактнаяИнформацияЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК Вид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК Представление
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|			И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка = &Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка.ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|			И ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РодственникСсылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленнаяКонтактнаяИнформацияЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленнаяКонтактнаяИнформацияЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Свойство КАК Свойство,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК Значение
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных
		|		ПО ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка
		|			И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияПолисыДМС(Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.СтраховаяКомпания КАК СтраховаяКомпания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.НомерПолиса КАК НомерПолиса,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Регистратор
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ПрикреплениеПодтверждено = ИСТИНА
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.НомерПолиса <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка.Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка.СтраховаяКомпания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РодственникСсылка,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.НомерПолиса,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаПрикрепления
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = &Регистратор
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка.ПрикреплениеПодтверждено = ИСТИНА
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.НомерПолиса <> """"";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ПолисыДМС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ПолисыДМС.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияУдержаний(Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания КАК СпособУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания > 0
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.УдержанияМедицинскогоСтрахования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.УдержанияМедицинскогоСтрахования.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияГрафикаУдержаний(Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Ссылка КАК Ссылка,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Дата КАК Дата,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Сумма КАК Сумма,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Ссылка.Организация КАК Организация
		|ПОМЕСТИТЬ ВТГрафикУдержаний
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ГрафикУдержаний КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Ссылка = &Регистратор
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Сумма > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТГрафикУдержаний.Ссылка КАК ДокументОснование,
		|	ВТГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТГрафикУдержаний.Дата КАК Дата,
		|	ВТГрафикУдержаний.Сумма КАК Сумма,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ВТГрафикУдержаний.Организация КАК Организация,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК Период
		|ИЗ
		|	ВТГрафикУдержаний КАК ВТГрафикУдержаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|		ПО ВТГрафикУдержаний.Ссылка = ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ВТГрафикУдержаний.ФизическоеЛицо = ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Регистратор
		|	И ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику)";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	НомерПоПорядку = 1;
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ГрафикУдержанийМедицинскогоСтрахования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.НомерПоПорядку = НомерПоПорядку;
		НомерПоПорядку = НомерПоПорядку + 1;
		Движения.ГрафикУдержанийМедицинскогоСтрахования.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли