
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		Если ЗначениеЗаполнено(Объект.ИсправленныйДокумент) Тогда
			СсылкаДляЗаполнения = Объект.ИсправленныйДокумент;
		ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			СсылкаДляЗаполнения = Параметры.ЗначениеКопирования;
		КонецЕсли;
		
		МассивСотрудников = Неопределено;
		Если Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("Сотрудники") Тогда
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения, , "Сотрудники");
			Иначе
				ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
			КонецЕсли;
			Если Параметры.ЗначенияЗаполнения.Свойство("Сотрудники") И ТипЗнч(Параметры.ЗначенияЗаполнения.Сотрудники) = Тип("Массив") Тогда
				МассивСотрудников = Параметры.ЗначенияЗаполнения.Сотрудники;
			КонецЕсли;
		Иначе
			ЗначенияДляЗаполнения = Новый Структура;
			ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
			Если Не Параметры.Свойство("ЗначенияЗаполнения") Или Не Параметры.ЗначенияЗаполнения.Свойство("Подразделение") Тогда
				// Подразделение (пустое значение) может быть передано как параметр заполнения из обработки.
				ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
			КонецЕсли;
			ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
			ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		КонецЕсли;
		
		ПриПолученииДанныхНаСервере(Истина);
		Если МассивСотрудников <> Неопределено Тогда
			СотрудникиЗаполнитьНаСервере(МассивСотрудников);
		КонецЕсли;
		
	Иначе
		
		// Если это открытие уже существующего документа, 
		// то оно может выполняться в режиме добавления строк.
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Сотрудники") Тогда
			МассивСотрудников = Новый Массив;
			Для Каждого ПараметрСотрудник Из Параметры.ЗначенияЗаполнения.Сотрудники Цикл
				НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ПараметрСотрудник));
				Если НайденныеСтроки.Количество() = 0 Тогда
					МассивСотрудников.Добавить(ПараметрСотрудник);
				КонецЕсли;
			КонецЦикла;
			
			Если МассивСотрудников.Количество() > 0 Тогда
				СотрудникиЗаполнитьНаСервере(МассивСотрудников);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользуютсяУдержания = ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиУдержания", "Видимость", ИспользуютсяУдержания);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РодственникиРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧастичноеУдержание", "Видимость", ИспользуетсяЧастичноеУдержание);
	УстановитьВидимостьНомеровПолисов();
	ЗаполнитьЦветаНадписей();
	ПроверитьРассылкуПолисовДМС();
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны();
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументов = ОбщегоНазначения.ОбщийМодуль("УчетОригиналовПервичныхДокументов");
		МодульУчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Шапка);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьВидимостьОтправкиПолисов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ПараметрыЗаписи.Свойство("ПроверкаПередЗаписьюВыполнена") Тогда
		ПроверитьЗаполнениеОтправляемыхДанных(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущийОбъект.ДатаОтправки = Дата(Год(ТекущийОбъект.Дата), Месяц(ТекущийОбъект.Дата), День(ТекущийОбъект.Дата), Час(ТекущаяДата), Минута(ТекущаяДата), Секунда(ТекущаяДата));
	РеквизитыВДанные(ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыЗаписи);
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеВРеквизиты();
	ПерерасчетЗарплаты.РегистрацияПерерасчетовПоПредварительнымДаннымВФоне(ТекущийОбъект.Ссылка);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборФорматаВложений") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
			
			МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
			МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	МедицинскоеСтрахованиеФормы.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыПоказателиДокумента" И Источник.ВладелецФормы = ЭтотОбъект Тогда
		Если Параметр.Показатели.Количество() > 0 Тогда 
			ОбработатьИзменениеПоказателейНаСервере(Параметр.Показатели);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетОригиналовПервичныхДокументовКлиент");
		МодульУчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ПриИзмененииОсновныхПолейНаСервере();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ДополнитьФорму();
	ПриИзмененииОсновныхПолейНаСервере();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСтрахованияПриИзменении(Элемент)
 	
	Если Объект.Сотрудники.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ДоговорСтрахованияПриИзмененииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Оставить выбранных сотрудников после редактирования Договора страхования?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ДоговорСтрахованияПриИзмененииЗавершение(КодВозвратаДиалога.Нет, Неопределено);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСтрахованияПриИзмененииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Сотрудники = Новый Массив;
	Для Каждого СтрокаСотрудников Из Объект.Сотрудники Цикл
		Сотрудники.Добавить(СтрокаСотрудников.Сотрудник);
	КонецЦикла;	
		
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ДополнитьФорму();
	УстановитьВидимостьЭлементов(ЭтотОбъект);	
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СотрудникиЗаполнитьНаСервере(Сотрудники);
	Иначе	
		ТекстВопроса = НСтр("ru='Заполнить документ всеми сотрудниками?'");
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьСотрудниковПоДоговоруЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдержатьПриПрикрепленииПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не УдержатьПриПрикреплении Тогда
		ПрекратитьУдержания = Ложь;
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьУдержанияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не ПрекратитьУдержания Тогда
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВводМесяцаУдержанияНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
		Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Неопределено, "Месяц", Ложь),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой", Направление);
	Объект.ГрафикУдержаний.Сортировать("Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой");
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо;
	Объект.ГрафикУдержаний.Сортировать("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если Не СтрокаГрафика.ВведеноПользователем Тогда
			Элементы.ГрафикУдержаний.ТекущиеДанные.ВведеноПользователем = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Если ГрафикУдержаний.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ГрафикУдержаний.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФактическиУдержано) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов") Тогда
		МодульУчетОригиналовПервичныхДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УчетОригиналовПервичныхДокументовКлиент");
		МодульУчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы["ДекорацияСостояниеОригинала"]);
	КонецЕсли;
	
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		УстановитьОтборСтрокРодственников(Элементы, Неопределено);
		УстановитьЗаголовокСтраницыСотрудники();
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрокРодственников(Элементы, ТекущиеДанные.ФизическоеЛицо);
	УстановитьОтборСтрокПоказателей(Элементы, ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);
	
	УдержатьПриПрикреплении = ТекущиеДанные.СуммаУдержания <> 0;
	ПрекратитьУдержания = ТекущиеДанные.СуммаПредела <> 0;
	
	УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
	УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
	УстановитьВидимостьОтправкиПолисов();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьДоступностьЭлементов();
	УстановитьЗаголовокСтраницыСотрудники();
	
	//Удержания
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		ЕстьУдержание = ТекущиеДанные.ОбщаяСуммаУдержания > 0;
		Элементы.ГруппаЧастичноеУдержание.Видимость = ЕстьУдержание;
	КонецЕсли;
	
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	УстановитьВидимостьГрафикаУдержаний();
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		УстановитьОтборГрафикаУдержаний(Элементы, ТекущиеДанные.ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СотрудникиПередУдалениемНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);	
	СотрудникиПрограммыСтрахования = НСтр("ru = '<Не указаны>'");
	СотрудникиРасширенияПрограммСтрахования = НСтр("ru = '<Не указаны>'");
	Элементы.ГруппаНастройкиУдержания.Заголовок = НСтр("ru = 'Удержание стоимости полиса'");
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПередУдалениемНаСервере(Сотрудник, ФизическоеЛицо, ИдентификаторСтрокиВидаРасчета)
	
	МедицинскоеСтрахованиеФормы.УдалитьСвязанныеССотрудникомДанные(ЭтотОбъект, Сотрудник, ФизическоеЛицо, ИдентификаторСтрокиВидаРасчета);	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиОбработкаВыбораНаСервере(ТекущиеДанные.Сотрудник);
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаРождения);
	ЗаполнитьДействиеИПоказатели();
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиЧастичноеУдержаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиПроцентЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	Элементы.СотрудникиСуммаЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПроцентЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.ПроцентЧастичногоУдержания > 100 Тогда
			ТекущиеДанные.ПроцентЧастичногоУдержания = 100;
		КонецЕсли;
		ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * ТекущиеДанные.ПроцентЧастичногоУдержания / 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСуммаЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.СуммаЧастичногоУдержания > ТекущиеДанные.ОбщаяСуммаУдержания Тогда
			ТекущиеДанные.СуммаЧастичногоУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
		КонецЕсли;
		ТекущиеДанные.ПроцентЧастичногоУдержания = Окр(ТекущиеДанные.СуммаЧастичногоУдержания / ТекущиеДанные.ОбщаяСуммаУдержания * 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", "Сотрудник", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДатаРожденияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаРождения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРодственники

&НаКлиенте
Процедура РодственникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанныеПрикрепления = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеПрикрепления = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ФизическоеЛицо = ТекущиеДанныеПрикрепления.ФизическоеЛицо;
		ТекущаяДатаНачала = ОбщегоНазначенияКлиент.ДатаСеанса() + (СдвигДатыПрикрепления * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах());
		Если Объект.ДатаНачалаСтрахования > ТекущаяДатаНачала Тогда
			ТекущиеДанные.ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		Иначе
			ТекущиеДанные.ДатаПрикрепления = ТекущаяДатаНачала;
		КонецЕсли;
		ТекущиеДанные.ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	
	СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
	НайденныеСтроки = Объект.Родственники.НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.Родственники.Удалить(НайденнаяСтрока);
	КонецЦикла;
	НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.ПрограммыСтрахованияРодственников.Удалить(НайденнаяСтрока);
	КонецЦикла;
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Объект.РасширенияПрограммСтрахованияРодственников.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРодственникСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанныеСотрудники);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанныеСотрудники);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРодственникСсылкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	РодственникиОбработкаВыбораНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", "РодственникСсылка", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СотрудникиЗаполнить(Команда)
	
	СотрудникиЗаполнитьНаСервере();
	
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено И Объект.Сотрудники.Количество() > 0 Тогда
		Элементы.Сотрудники.ТекущаяСтрока = Объект.Сотрудники[0].ПолучитьИдентификатор();
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодственникиЗаполнить(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиЗаполнитьНаСервере(ТекущиеДанные.Сотрудник);
	УстановитьЗаголовокСтраницыСотрудники();
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Неопределено;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ГосударственнаяСлужбаКлиент");
		Модуль.УточнитьПараметрыОткрытияФормыВыбораСотрудников(ПараметрыОткрытия);
	КонецЕсли; 
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.Сотрудники,
		Объект.Организация,
		Объект.Подразделение,
		Объект.Дата,
		Истина,
		АдресСпискаПодобранныхСотрудников(),
		ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтроки(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", Объект.Организация);
	Если Элементы.Сотрудники.ВыделенныеСтроки.Количество() = 0 Тогда
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Неопределено);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", 0);
		ПараметрыОткрытия.Вставить("СуммаУдержания", 0);
		ПараметрыОткрытия.Вставить("СуммаПредела", 0);
	Иначе
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(Элементы.Сотрудники.ВыделенныеСтроки[0]);
		СтруктураОтбора = Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник);
		
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.ПрограммыСтрахования.Добавить(НайденнаяСтрока.ПрограммаСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.РасширенияПрограммСтрахования.Добавить(НайденнаяСтрока.РасширениеСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", СтрокаСотрудника.ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", СтрокаСотрудника.СтраховаяПремия);
		ПараметрыОткрытия.Вставить("СуммаУдержания", СтрокаСотрудника.СуммаУдержания);
		ПараметрыОткрытия.Вставить("СуммаПредела", СтрокаСотрудника.СуммаПредела);
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнениеСведенийСтрахованияЗакрытие", ЭтотОбъект, Элементы.Сотрудники.ВыделенныеСтроки);
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ФормаЗаполнениеСведенийСтрахования", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолисыДМС(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями")
		И Объект.Проведен И Не Модифицированность Тогда
			ОткрытьФормуОтправкиПолисовДМС();
    Иначе
        Оповещение = Новый ОписаниеОповещения("ОтправитьПолисыДМСЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, 
			НСтр("ru = 'Для отправки полисов ДМС документ должен быть проведен.
				|Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСотрудников(Команда)

	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка списка сотрудников из файла'");
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьСотрудниковИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикПоДоговору(Команда)
	
	Если Не ЗначениеЗаполнено(ГрафикУдержанийПоДоговору) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Если ГрафикУдержаний.Количество() > 0 Тогда
		Для Каждого НайденнаяСтрокаГрафика Из ГрафикУдержаний Цикл
			Объект.ГрафикУдержаний.Удалить(НайденнаяСтрокаГрафика);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаГрафикаПоДоговору Из ГрафикУдержанийПоДоговору Цикл
		СтрокаГрафика = Объект.ГрафикУдержаний.Добавить();
		СтрокаГрафика.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
		СтрокаГрафика.Дата = СтрокаГрафикаПоДоговору.Значение;
		СтрокаГрафика.ДатаСтрокой = Формат(СтрокаГрафикаПоДоговору.Значение, НСтр("ru='ДЛФ=Д'"));
	КонецЦикла;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	ОбновитьПодвалГрафикаУдержаний();
	
	Модифицированность = Истина;
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ГрафикУдержаний.Представление"));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийСумма.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийСумма.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ФактическиУдержано",
		0,
		ВидСравненияКомпоновкиДанных.Больше);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ИсправлениеДокументов

&НаКлиенте
Процедура УстановитьПоляИсправленияНаКлиенте() Экспорт
	
	УстановитьПоляИсправления(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПоляИсправления(Форма)

	ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(Форма, "ПериодическиеСведения");
	
КонецПроцедуры

#КонецОбласти

// ИсправлениеДокументов
&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(ЭтотОбъект);
КонецПроцедуры
// Конец ИсправлениеДокументов

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ИмяОткрываемойФормы = "ОбщаяФорма.ВыборФорматаВложений";
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиЗаполнитьНаСервере(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, Истина, Истина, Истина, Сотрудники, Объект.Ссылка);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено Тогда
		СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьИзЗарплаты Тогда
			ПересчитатьУдержания(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	Если Результат <> Неопределено Тогда
		
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", Результат);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
		РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено Тогда
		СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьИзЗарплаты Тогда
			ПересчитатьУдержания(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	Если Результат <> Неопределено Тогда
		
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", Результат);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
		РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено Тогда
		РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьССотрудника Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанныеСотрудники);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	Если Результат <> Неопределено Тогда
		
		СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
		МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаРодственника, "ПрограммыСтрахованияРодственников", "РодственникСсылка", Результат, "ФизическоеЛицо");
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
		РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено Тогда
		РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьССотрудника Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанныеСотрудники);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	Если Результат <> Неопределено Тогда
		
		СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
		МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаРодственника, "РасширенияПрограммСтрахованияРодственников", "РодственникСсылка", Результат, "ФизическоеЛицо");
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
		РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиОбработкаВыбораНаСервере(Родственник, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаРодственника.РодственникСсылка = Родственник;
	
	Если Не ЗначениеЗаполнено(Объект.ДоговорСтрахования) Тогда
		Возврат;
	КонецЕсли;
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	ЗначенияРеквизитовРодственника =
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родственник, "Фамилия,Имя,Отчество,ДатаРождения,СНИЛС");
	
	СтрокаРодственника.Фамилия = ЗначенияРеквизитовРодственника.Фамилия;
	СтрокаРодственника.ФамилияДоИзменения = ЗначенияРеквизитовРодственника.Фамилия;
	СтрокаРодственника.Имя = ЗначенияРеквизитовРодственника.Имя;
	СтрокаРодственника.ИмяДоИзменения = ЗначенияРеквизитовРодственника.Имя;
	СтрокаРодственника.Отчество = ЗначенияРеквизитовРодственника.Отчество;
	СтрокаРодственника.ОтчествоДоИзменения = ЗначенияРеквизитовРодственника.Отчество;
	
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		СтрокаРодственника.ДатаРождения = ЗначенияРеквизитовРодственника.ДатаРождения;
		СтрокаРодственника.ДатаРожденияДоИзменения = ЗначенияРеквизитовРодственника.ДатаРождения;
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
		ПолРодственника = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПолПоЧастямФИО(СтрокаРодственника);
		СтрокаРодственника.Пол = ПолРодственника;
		СтрокаРодственника.ПолДоИзменения = ПолРодственника;
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		СтрокаРодственника.СтраховойНомерПФР = ЗначенияРеквизитовРодственника.СНИЛС;
		СтрокаРодственника.СтраховойНомерПФРДоИзменения = ЗначенияРеквизитовРодственника.СНИЛС;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Страна КАК Страна,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументПредставление КАК ДокументПредставление,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументВид КАК ДокументВид,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСерия КАК ДокументСерия,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументНомер КАК ДокументНомер,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения
		|ИЗ
		|	РегистрСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(
		|			,
		|			ДоговорСтрахования = &ДоговорСтрахования
		|				И Застрахованный = &Застрахованный) КАК ОтправленныеДанныеЗастрахованныхСрезПоследних";
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("Застрахованный", Родственник);
	ВыборкаСведения = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСведения.Следующий() Цикл
		Если ОтправляемыеДанные.Найти("Страна") <> Неопределено Тогда
			СтрокаРодственника.Страна = ВыборкаСведения.Страна;
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("ДокументПредставление") <> Неопределено Тогда
			СтрокаРодственника.ДокументПредставление = ВыборкаСведения.ДокументПредставление;
			СтрокаРодственника.ДокументВид = ВыборкаСведения.ДокументВид;
			СтрокаРодственника.ДокументСерия = ВыборкаСведения.ДокументСерия;
			СтрокаРодственника.ДокументНомер = ВыборкаСведения.ДокументНомер;
			СтрокаРодственника.ДокументДатаВыдачи = ВыборкаСведения.ДокументДатаВыдачи;
			СтрокаРодственника.ДокументСрокДействия = ВыборкаСведения.ДокументСрокДействия;
			СтрокаРодственника.ДокументКемВыдан = ВыборкаСведения.ДокументКемВыдан;
			СтрокаРодственника.ДокументКодПодразделения = ВыборкаСведения.ДокументКодПодразделения;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Вид КАК Вид,
		|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ОтправленнаяКонтактнаяИнформацияЗастрахованных.СрезПоследних(
		|			,
		|			ДоговорСтрахования = &ДоговорСтрахования
		|				И Застрахованный = &Застрахованный) КАК ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних";
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("Застрахованный", Родственник);
	ВыборкаКИ = Запрос.Выполнить().Выбрать();
	Пока ВыборкаКИ.Следующий() Цикл
		СтрокаРодственника[ВыборкаКИ.Вид.ИдентификаторДляФормул+ "Представление"] = ВыборкаКИ.Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьФорму()
	
	ТаблицыСоСведениями = Новый Соответствие;
	ТаблицыСоСведениями.Вставить("Сотрудники", "ГруппаСведенияСтрахованияСотрудника");
	ТаблицыСоСведениями.Вставить("Родственники", "ГруппаСведенияСтрахованияРодственника");
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеДополнитьФорму(ЭтотОбъект, ТаблицыСоСведениями, Объект.ДоговорСтрахования);
	
	ИсправлениеДокументовЗарплатаКадры.ГруппаИсправлениеДополнитьФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОсновныхПолейНаСервере(ИзменятьПериодСтрахования = Ложь, ПерезаполнятьДанныеСотрудников = Ложь)
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеПрочитатьНастройки(ЭтотОбъект, ИзменятьПериодСтрахования);
	Если ПерезаполнятьДанныеСотрудников Тогда
		СотрудникиЗаполнитьНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСотрудниковПоДоговоруЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПерезаполнятьСотрудников = Ложь;
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПерезаполнятьСотрудников = Истина;
	КонецЕсли;	
	ПриИзмененииОсновныхПолейНаСервере(Истина, ПерезаполнятьСотрудников);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСуммаПредела", "Доступность", ПрекратитьУдержания);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиДатаНачалаПриИзмененииНаСервере(Сотрудник, ДатаПрикрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("Сотрудник", Сотрудник);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюСотрудников(Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура РодственникиДатаПриИзмененииНаСервере(РодственникСсылка, ДатаПрикрепления, ДатаОткрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("РодственникСсылка", РодственникСсылка);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюРодственников(РодственникСсылка);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюСотрудников(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюСотрудников(Объект, СтруктураИменТаблиц, Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюРодственников(Родственники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюРодственников(Объект, СтруктураИменТаблиц, Родственники);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокРодственников(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родственники", "ОтборСтрок", СтруктураОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокПоказателей(Элементы, ИдентификаторСтроки)
	
	СтруктураОтбора = ?(ИдентификаторСтроки = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ИдентификаторСтрокиВидаРасчета", ИдентификаторСтроки));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Показатели", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборГрафикаУдержаний(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = ?(ФизическоеЛицо = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования;
	Если ПустаяСтрока(СотрудникиПрограммыСтрахования) Тогда
		СотрудникиПрограммыСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиРасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования;
	Если ПустаяСтрока(СотрудникиРасширенияПрограммСтрахования) Тогда
		СотрудникиРасширенияПрограммСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ИзменятьПериодСтрахования = Ложь)
	
	ОписаниеКлючевыхРеквизитов = КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов();
	ТаблицыОчищаемыеПриИзменении = КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении();
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект, ОписаниеКлючевыхРеквизитов);
	
	ДополнитьФорму();
	ДанныеВРеквизиты();
	ПриИзмененииОсновныхПолейНаСервере(ИзменятьПериодСтрахования);
	
КонецПроцедуры

#Область КлючевыеРеквизитыЗаполненияФормы

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация",     НСтр("ru = 'организации'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "СтраховаяКомпания", НСтр("ru = 'страховой компании'")));
		
	Возврат КлючевыеРеквизиты;
	
КонецФункции

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	ОчищаемыеТаблицы = Новый Массив;
	ОчищаемыеТаблицы.Добавить("Объект.Сотрудники");
	ОчищаемыеТаблицы.Добавить("Объект.ПрограммыСтрахованияСотрудников");
	ОчищаемыеТаблицы.Добавить("Объект.РасширенияПрограммСтрахованияСотрудников");
	ОчищаемыеТаблицы.Добавить("Объект.Родственники");
	ОчищаемыеТаблицы.Добавить("Объект.ПрограммыСтрахованияРодственников");
	ОчищаемыеТаблицы.Добавить("Объект.РасширенияПрограммСтрахованияРодственников");
	ОчищаемыеТаблицы.Добавить("Объект.СведенияСотрудников");
	ОчищаемыеТаблицы.Добавить("Объект.СведенияРодственников");
	ОчищаемыеТаблицы.Добавить("Объект.Показатели");
	ОчищаемыеТаблицы.Добавить("Объект.ГрафикУдержаний");
	ОчищаемыеТаблицы.Добавить("Объект.ДанныеЗастрахованных");
	ОчищаемыеТаблицы.Добавить("Объект.КонтактнаяИнформацияЗастрахованных");
	ОчищаемыеТаблицы.Добавить("Объект.ДополнительныеРеквизитыИСведенияЗастрахованных");
		
	Возврат ОчищаемыеТаблицы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма)
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма);
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ДанныеВРеквизиты()
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны();
	ИсправлениеДокументовЗарплатаКадры.ПрочитатьРеквизитыИсправления(ЭтотОбъект, "ПериодическиеСведения");
	УстановитьПоляИсправления(ЭтотОбъект);
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	ОтправляемаяКонтактнаяИнформация = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ОтправляемыеДопРеквизитыИСведения = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
    КонецЕсли;
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаСотрудника.ФизическоеЛицо);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСотрудника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаСотрудника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаСотрудника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаСотрудника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаСотрудника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаСотрудника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаСотрудника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаСотрудника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаСотрудника.ФизическоеЛицо, ОтправляемаяКИ.Вид);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого СтрСвойства Из ОтправляемыеДопРеквизитыИСведения Цикл
				ОтборСтрок = Новый Структура("Застрахованный, Свойство", СтрокаСотрудника.ФизическоеЛицо, СтрСвойства.Свойство);
				НайденнаяСтрокаСвойств = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.НайтиСтроки(ОтборСтрок);
				Если НайденнаяСтрокаСвойств.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСотрудника[СтрСвойства.Имя] = НайденнаяСтрокаСвойств[0].Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаРодственника.РодственникСсылка);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРодственника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаРодственника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаРодственника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаРодственника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаРодственника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаРодственника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаРодственника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаРодственника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаРодственника.РодственникСсылка, ОтправляемаяКИ.Вид);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РеквизитыВДанные(ТекущийОбъект)
	
	ТекущийОбъект.ДанныеЗастрахованных.Очистить();
	ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Очистить();
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	ОтправляемаяКонтактнаяИнформация = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Очистить();
		ОтправляемыеДопРеквизитыИСведения = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	КонецЕсли;
	
	СписокОтсутствующейКИ = "";
	СписокОтсутствующихДопРеквизитов = "";
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
		НоваяСтрока.Фамилия = СтрокаСотрудника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаСотрудника.Фамилия;
		НоваяСтрока.Имя = СтрокаСотрудника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаСотрудника.Имя;
		НоваяСтрока.Отчество = СтрокаСотрудника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаСотрудника.Отчество;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаСотрудника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаСотрудника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			Если СтрокаСотрудника.Свойство(ВидКИ.ИдентификаторДляФормул) = Истина Тогда
				НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
				НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
				НоваяСтрока.Вид = ВидКИ.Вид;
				НоваяСтрока.Значение = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул];
				НоваяСтрока.Представление = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "Представление"];
			Иначе
				Если СписокОтсутствующейКИ = "" Тогда
					СписокОтсутствующейКИ = ВидКИ.Наименование;
				Иначе
					Если Найти(СписокОтсутствующейКИ, ВидКИ.Наименование) = 0 Тогда
						СписокОтсутствующейКИ = СтрШаблон("%1, %2", СписокОтсутствующейКИ, ВидКИ.Наименование);
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого СтрСвойства Из ОтправляемыеДопРеквизитыИСведения Цикл
				Если СтрокаСотрудника.Свойство(СтрСвойства.Имя) = Истина Тогда
					НоваяСтрока = ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
					НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
					НоваяСтрока.Свойство = СтрСвойства.Свойство;
					НоваяСтрока.Значение = СтрокаСотрудника[СтрСвойства.Имя];
				Иначе
					Если СписокОтсутствующихДопРеквизитов = "" Тогда
						СписокОтсутствующихДопРеквизитов = СтрСвойства.Наименование;
					Иначе
						Если Найти(СписокОтсутствующихДопРеквизитов, СтрСвойства.Наименование) = 0 Тогда
							СписокОтсутствующихДопРеквизитов = СтрШаблон("%1, %2", СписокОтсутствующихДопРеквизитов, СтрСвойства.Наименование);		
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СписокОтсутствующейКИ) Или ЗначениеЗаполнено(СписокОтсутствующихДопРеквизитов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'В договоре изменился состав отправляемой в страховую компанию информации.'"));	
	КонецЕсли;	
	Если ЗначениеЗаполнено(СписокОтсутствующейКИ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось обнаружить вид контактной информации %1 в документе, перезаполните сотрудников.'"), 
		СписокОтсутствующейКИ));
	КонецЕсли;
	Если ЗначениеЗаполнено(СписокОтсутствующихДопРеквизитов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не удалось обнаружить значения доп.реквизита %1 в документе, перезаполните сотрудников.'"), 
		СписокОтсутствующихДопРеквизитов));
	КонецЕсли;
	
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
		НоваяСтрока.Фамилия = СтрокаРодственника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаРодственника.Фамилия;
		НоваяСтрока.Имя = СтрокаРодственника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаРодственника.Имя;
		НоваяСтрока.Отчество = СтрокаРодственника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаРодственника.Отчество;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаРодственника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаРодственника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
			НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
			НоваяСтрока.Вид = ВидКИ.Вид;
			НоваяСтрока.Значение = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул];
			НоваяСтрока.Представление = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "Представление"];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиЗаполнитьНаСервере(Сотрудник)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнитьРодственников(ЭтотОбъект, СтруктураИменТаблиц, Объект.Ссылка, Сотрудник);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Сотрудники.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)
	
	Если ТипЗнч(ВыбранныеСотрудники) = Тип("Массив") Тогда
		СписокСотрудников = ВыбранныеСотрудники;
	Иначе
		СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	Если СписокСотрудников.Количество() > 0 Тогда
		СотрудникиЗаполнитьНаСервере(СписокСотрудников);	
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтправкиПисьма(ВыбранноеЗначение)
	Возврат МедицинскоеСтрахование.ПараметрыОтправкиПисьма(ЭтотОбъект, ВыбранноеЗначение, Получатели, НСтр("ru = 'Прикрепление сотрудников'"));
КонецФункции

&НаКлиенте
Процедура ЗаполнениеСведенийСтрахованияЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Модифицированность = Истина;
		ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры);
		ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры);
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
			УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
			Если ИспользуютсяУдержания Тогда
				УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
				Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
					ОбновитьПодвалГрафикаУдержаний();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры)
	
	МассивСотрудников = Новый Массив;
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ДатаПрикрепления = Результат.ДатаНачалаСтрахования;
		СтрокаСотрудника.СуммаУдержания = Результат.СуммаУдержания;
		СтрокаСотрудника.СуммаПредела = Результат.СуммаПредела;
		
		МассивСтруктурПрограмм = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.ПрограммыСтрахования Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", ЭлементСписка);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураПрограммы.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураПрограммы.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураПрограммы.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураПрограммы.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЦикла;
		МассивСтруктурРасширений = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.РасширенияПрограммСтрахования Цикл
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", ЭлементСписка);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураРасширения.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураРасширения.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураРасширения.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураРасширения.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЦикла;
		МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		МассивСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	РассчитатьСтраховуюПремиюСотрудников(МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСотрудниковИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ЗагруженныеДанные.Сортировать("Сотрудник");
	
	СотрудникиДобавлены = Ложь;
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	Для Каждого ТаблицаДокумента Из СтруктураИменТаблиц Цикл
		Если ТаблицаДокумента.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		Объект[ТаблицаДокумента.Значение].Очистить();
	КонецЦикла;
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, Истина, Истина, Истина, ЗагруженныеДанные.ВыгрузитьКолонку("Сотрудник"));
	
	ТекущийСотрудник = Неопределено;
	МассивСотрудников = Новый Массив;
	МассивСтруктурПрограмм = Новый Массив;
	МассивСтруктурРасширений = Новый Массив;
	СтрокаСотрудника = Неопределено;
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТекущийСотрудник <> СтрокаТаблицы.Сотрудник Тогда
			МассивСотрудников.Добавить(СтрокаТаблицы.Сотрудник);
		    Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
			КонецЕсли;
			Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
			КонецЕсли;
			ТекущийСотрудник = СтрокаТаблицы.Сотрудник;
			МассивСтруктурПрограмм = Новый Массив;
			МассивСтруктурРасширений = Новый Массив;
			
			СтруктураОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаСотрудника = Объект.Сотрудники.Добавить();
			Иначе
				СтрокаСотрудника = НайденныеСтроки[0];
				СтрокаСотрудника.СтраховаяПремия = 0;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаСотрудника.Сотрудник = СтрокаТаблицы.Сотрудник;
		СтрокаСотрудника.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Сотрудник, "ФизическоеЛицо");
		СтрокаСотрудника.ДатаПрикрепления = СтрокаТаблицы.ДатаПрикрепления;
		СтрокаСотрудника.СтраховаяПремия = СтрокаСотрудника.СтраховаяПремия;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПрограммаСтрахования) Тогда
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.РасширениеПрограммСтрахования) Тогда
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеПрограммСтрахования);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураРасширения.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремияРасширения);
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЕсли;
		
		СотрудникиДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТекущийСотрудник <> Неопределено Тогда
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		КонецЕсли;
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		КонецЕсли;
	КонецЕсли;
	
	Если СотрудникиДобавлены Тогда
		РассчитатьСтраховуюПремиюСотрудников(МассивСотрудников);
		ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТаблицыУдержаний()
	
	ОписаниеТаблицы = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "Сотрудники";
	ОписаниеТаблицы.ПутьКДанным = "Объект.Сотрудники";
	ОписаниеТаблицы.ИмяРеквизитаВидРасчета = "Удержание";
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	ОписаниеТаблицы.СодержитПолеСотрудник = Истина;
	ОписаниеТаблицы.ИмяРеквизитаСотрудник = "Сотрудник";
	ОписаниеТаблицы.ЭтоПлановыеНачисленияУдержания = Истина;
	ОписаниеТаблицы.НомерТаблицы = 2;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДействиеИПоказатели()
	
	ДокументыПлановыхУдержанийЗаполнитьПоказатели();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаРасширенияПрограммСтрахования", "Видимость", Форма.ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "РодственникиРасширенияПрограммСтрахования", "Видимость", Форма.ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаЧастичноеУдержание", "Видимость", Форма.ИспользуетсяЧастичноеУдержание);
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПлановыхУдержанийЗаполнитьПоказатели() Экспорт
	
	// Принимается решение о том, показывать ли таблицу показателей.
	// Если показывать, то таблица заполняется по состоянию на указанную дату действия.
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	
	// Удалим показатели, которых нет в удержании
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого СтрокаПоказателей Из Объект.Показатели Цикл
		ПоказательНайден = Ложь;
		Для каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если СтрокаПоказателей.Показатель = ДанныеПоказателя.Показатель Тогда
				ПоказательНайден = Истина;
			КонецЕсли
		КонецЦикла;
		Если Не ПоказательНайден Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаПоказателей);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
		Объект.Показатели.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ТаблицаУдержаний = ОписаниеТаблицыУдержаний();
	ИдентификаторСтрокиВидаРасчета = ТаблицаУдержаний.НомерТаблицы * 1000000 + 1;
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		
		ТекущийИдентификаторСтрокиВидаРасчета = СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета;
		
		Для Каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если ДанныеПоказателя.ЗапрашиватьПриВводе Тогда
				
				СтруктураОтбора = Новый Структура("ИдентификаторСтрокиВидаРасчета, Показатель", ТекущийИдентификаторСтрокиВидаРасчета, ДанныеПоказателя.Показатель);
				НайденныеСтроки = Объект.Показатели.НайтиСтроки(СтруктураОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
					КонецЦикла;
				Иначе
					НоваяСтрока = Объект.Показатели.Добавить();
					НоваяСтрока.Показатель = ДанныеПоказателя.Показатель;
					НоваяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
		ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПоказателейНаСервере(ЗначенияПоказателей)
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	ФиксированнаяСумма = ЗначенияПоказателей[Справочники.ПоказателиРасчетаЗарплаты.ПустаяСсылка()];
	
	Для Каждого СтрокаСотрудника Из Объект.Показатели Цикл
		
		Если ФиксированнаяСумма = Неопределено Тогда
			
			МаксимальноеЧислоПоказателей = ВидРасчетаИнфо.КоличествоПостоянныхПоказателей;
			Для Сч = 1 По МаксимальноеЧислоПоказателей Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаСотрудника.Показатель) Тогда 
					Прервать;
				КонецЕсли;
				
				ЗначениеПоказателя = ЗначенияПоказателей[СтрокаСотрудника.Показатель];
				Если ЗначениеПоказателя <> Неопределено Тогда 
					СтрокаСотрудника.Значение = ЗначениеПоказателя;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			СтрокаСотрудника.Размер = ФиксированнаяСумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
		
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУдерживатьИзЗарплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособУдержания) Тогда
		ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно");
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		Элементы.ГруппаЧастичноеУдержание.Видимость = ТекущиеДанные.УдерживатьИзЗарплаты;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиУдерживатьССотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписиУдержаний(ФизическоеЛицо)
	
	СуммаУдержанияЗаСотрудника = СуммаУдержанияЗаСотрудника(ФизическоеЛицо);
	СуммаУдержанияЗаРодственников = СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
	Если СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника = 0 Тогда
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за родственников'");
	ИначеЕсли СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника > 0 Тогда 
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за сотрудника и родственников'");
	Иначе
		НадписьСуммаУдержания = НСтр("ru = 'Удержание стоимости полиса'");
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].ЧастичноеУдержание Тогда
		СуммаУдержания = ДанныеСотрудника[0].СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = СуммаУдержанияЗаРодственников + СуммаУдержанияЗаСотрудника;
	КонецЕсли;

	Если СуммаУдержания = 0 Тогда
		Элементы.ГруппаУдержаниеСпособ.Доступность = Ложь;
		Элементы.СотрудникиСуммаУдержания.Доступность = Ложь;
		Элементы.ГруппаГрафикУдержаний.Доступность = Ложь;
		Элементы.ГруппаНастройкиУдержания.Заголовок = НСтр("ru = 'Удержание стоимости полиса'");
	Иначе
		Элементы.ГруппаУдержаниеСпособ.Доступность = Истина;
		Элементы.СотрудникиСуммаУдержания.Доступность = Истина;
		Элементы.ГруппаГрафикУдержаний.Доступность = Истина;
		Элементы.ГруппаНастройкиУдержания.Заголовок =
			СтрШаблон(НСтр("ru = '%1 %2 руб.'"),
			НадписьСуммаУдержания,
			СуммаУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].УдерживатьИзЗарплаты Тогда
		Сумма = ДанныеСотрудника[0].СтраховаяПремия;
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Функция СуммаУдержанияЗаРодственников(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	НастройкиРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	Сумма = 0;
	Для Каждого Настройка Из НастройкиРодственников Цикл
		Если Настройка.УдерживатьССотрудника Тогда
			Сумма = Сумма + Настройка.СтраховаяПремия;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры)
	
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(СтрокаСотрудника.ФизическоеЛицо)
			+ СуммаУдержанияЗаРодственников(СтрокаСотрудника.ФизическоеЛицо);
		Если СтрокаСотрудника.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
			ПересчитатьГрафикУдержаний(СтрокаСотрудника);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьУдержания(СтрокаСотрудник)

	РассчитатьОбщуюСуммуУдержания(СтрокаСотрудник.ФизическоеЛицо);
	Если ИспользуетсяЧастичноеУдержание Тогда
		РассчитатьЧастичноеУдержание();
	КонецЕсли;
	УстановитьНадписиУдержаний(СтрокаСотрудник.ФизическоеЛицо);
	Если СтрокаСотрудник.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(СтрокаСотрудник);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбщуюСуммуУдержания(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	ДанныеСотрудника[0].ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
		+ СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЧастичноеУдержание()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
			ТекущиеДанные.СуммаЧастичногоУдержания = 0;
		Иначе
			ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * ТекущиеДанные.ПроцентЧастичногоУдержания / 100, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУдержанияМедицинскогоСтрахованияПриИзменении(Элемент)
	
	УстановитьВидимостьГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиСуммаУдержания.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно"), Истина, Ложь);
	Элементы.ГруппаГрафикУдержаний.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику"), Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаУдержанияНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
	СтрокаГрафика.Дата = ВыбранноеЗначение;
	СтрокаГрафика.ДатаСтрокой = Формат(ВыбранноеЗначение, НСтр("ru='ДЛФ=Д'"));
	
	Объект.ГрафикУдержаний.Сортировать("Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьГрафикУдержаний(СтрокаСотрудник)
	
	ДанныеСтрокиСотрудника = НовыйДанныеСтрокиСотрудника();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиСотрудника, СтрокаСотрудник);
	
	ПересчитатьГрафикУдержанийНаСервере(ДанныеСтрокиСотрудника);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыйДанныеСтрокиСотрудника()
	Возврат МедицинскоеСтрахованиеКлиентСервер.НовыйДанныеСтрокиСотрудника();
КонецФункции

&НаСервере
Процедура ПересчитатьГрафикУдержанийНаСервере(СтрокаСотрудник)
	МедицинскоеСтрахованиеФормы.ПересчитатьГрафикУдержаний(Объект, СтрокаСотрудник);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	СуммаПоГрафику = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		СуммаПоГрафику = СтрокаГрафика.Сумма + СуммаПоГрафику;
	КонецЦикла;
	
	Элементы.ГрафикУдержанийСумма.ТекстПодвала = Формат(СуммаПоГрафику, "ЧДЦ=2");
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		СуммаУдержания = ТекущиеДанные.СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
	КонецЕсли;

	Если СуммаУдержания <> СуммаПоГрафику Тогда
		ЭлементыСтиля = СтандартныеПодсистемыКлиент.ЭлементыСтиля();
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = ЭлементыСтиля.ЦветТекстаОтрицательногоЗначения;
	Иначе
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыСотрудники()
	
	КоличествоРодственников = "";
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ДанныеРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	КоличествоРодственниковСотрудника = ДанныеРодственников.Количество();
	Если КоличествоРодственниковСотрудника > 0 Тогда
		КоличествоРодственников = КоличествоРодственниковСотрудника;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНомераПолисовСотрудников(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка номеров полисов сотрудников'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаНомеровПолисовСотрудников";
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЗагрузкаНомеровПолисовСотрудников", Истина);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьНомераПолисовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНомераПолисовРодственников(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.Родственники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка номеров полисов родственников'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаНомеровПолисовРодственников";
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЗагрузкаНомеровПолисовРодственников", Истина);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьНомераПолисовЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПолисыСписком(Команда)
	
	НачатьЗагрузкуПолисов();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПолисНажатие(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Полис) Тогда
	
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(ТекущиеДанные.Полис, Неопределено, УникальныйИдентификатор);
		
		Если ДанныеФайла.Зашифрован Тогда
			ОповеститьОбИзменении(ТекущиеДанные.Полис);
			Возврат;
		КонецЕсли;
		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
		
	Иначе
		
		НачатьЗагрузкуПолисов(ТекущиеДанные.Сотрудник);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузкуПолисов(Сотрудник = Неопределено)
	
	ПараметрыЗагрузки = Новый Структура("Сотрудник", Сотрудник);
	
	НовыйДокумент = Не Параметры.Свойство("Ключ") Или Параметры.Ключ.Пустая();
	
	Если НовыйДокумент Тогда
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьПолисы", ЭтотОбъект, ПараметрыЗагрузки);
		ПоказатьВопрос(Оповещение, 
			НСтр("ru = 'Для загрузки полисов ДМС документ должен быть записан.
				|Продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗагрузитьПолисы(КодВозвратаДиалога.Да, ПараметрыЗагрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПолисы(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	Сотрудник = Неопределено;
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		ДополнительныеПараметры.Свойство("Сотрудник", Сотрудник);
	КонецЕсли;	
	
	СписокПолисов = Новый Массив;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = Нстр("ru = 'Выберите файл полиса ДМС в формате PDF'");
		Диалог.Фильтр = "PDF (*.PDF, *.pdf)|*.PDF;*.pdf)";
		Диалог.МножественныйВыбор = Ложь;
		
		Если Диалог.Выбрать() Тогда
			ВыбранныеФайлы = Диалог.ВыбранныеФайлы;
			Для Каждого ПутьФайлДМС Из ВыбранныеФайлы Цикл
				
				ФайлДМС = НайтиФайлы(ПутьФайлДМС);
				
				Если ФайлДМС.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;	
				
				Для Каждого СтрокаСотрудника Из Сотрудники Цикл
					ДополнитьСписокПолисов(СписокПолисов, СтрокаСотрудника, ФайлДМС[0].Имя, ФайлДМС[0].ПолноеИмя, ФайлДМС[0].Расширение);
				КонецЦикла;
				
			КонецЦикла;
		Иначе	
			Возврат;	
		КонецЕсли;
	
	Иначе	
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		Диалог.Каталог = "";
		Диалог.Заголовок = Нстр("ru = 'Выберите каталог с файлами полисов ДМС'");
		Диалог.Фильтр = "PDF (*.PDF, *.pdf)|*.PDF;*.pdf)";
		Диалог.МножественныйВыбор = Ложь;
		
		Если Диалог.Выбрать() Тогда
			Каталог = Диалог.Каталог;
		Иначе
			Возврат;
		КонецЕсли;
		
		РезультатПоиска = НайтиФайлы(Каталог, ПолучитьМаскуВсеФайлы());
		СписокПолисов = Новый Массив;
	
		Для Каждого ФайлДМС Из РезультатПоиска Цикл
		
			Если ФайлДМС.Расширение = "" Тогда
				Продолжить;
			КонецЕсли;	
			
			Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
				
				НомерПолиса = СтрЗаменить(СтрокаСотрудника.НомерПолиса, "/", "_");
				
				Если ЗначениеЗаполнено(НомерПолиса) И Найти(ФайлДМС.Имя, НомерПолиса) > 0 Тогда
					ДополнитьСписокПолисов(СписокПолисов, СтрокаСотрудника, ФайлДМС.Имя, ФайлДМС.ПолноеИмя, ФайлДМС.Расширение);
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;	
		
	КонецЕсли;
	
	Если СписокПолисов.Количество() > 0 Тогда
		ОбработатьПолисыНаСервере(СписокПолисов);
		УстановитьВидимостьОтправкиПолисов();
		Модифицированность = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьСписокПолисов(СписокПолисов, СтрокаСотрудника, Имя, ПолноеИмя, Расширение)
	
	ПараметрыФайла = ПараметрыФайлаПолиса();
	ПараметрыФайла.Сотрудник = СтрокаСотрудника.Сотрудник;
	ПараметрыФайла.Имя = СтрШаблон(НСтр("ru = 'Полис %1 сотрудника %2'"), СтрокаСотрудника.НомерПолиса, СтрокаСотрудника.Сотрудник);
	ПараметрыФайла.ИмяФайла = Имя;
	ПараметрыФайла.Расширение = Расширение;
	ПараметрыФайла.ФайлДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмя);
	ПараметрыФайла.НомерПолиса = СтрокаСотрудника.НомерПолиса;
	ПараметрыФайла.Полис = СтрокаСотрудника.Полис;
	СписокПолисов.Добавить(ПараметрыФайла);	

КонецПроцедуры	

&НаКлиенте
Процедура ОтметитьКУдалениюФайлПолиса(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ОтметитьКУдалениюФайлПолисаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, 
		НСтр("ru = 'Вы собираетесь отметить к удалению файл полиса ДМС. 
				|После этого он будет недоступен к отправке сотруднику,
				|но будет храниться в файлах документа. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОтметитьКУдалениюФайлПолисаЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Полис) Тогда
		
		УстановитьПометкуУдаленияПолису(ТекущиеДанные.Полис);
		ТекущиеДанные.Полис = Неопределено;
		
		УстановитьВидимостьОтправкиПолисов();
		Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПометкуУдаленияПолису(Полис)
	
	ПолисОбъект = Полис.ПолучитьОбъект();
	ПолисОбъект.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры	

&НаСервере
Процедура ОбработатьПолисыНаСервере(СписокПолисов)

	МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
	
	Для Каждого СтрокаПолиса Из СписокПолисов Цикл
		
		ПараметрыФайла = МодульРаботаСФайлами.ПараметрыДобавленияФайла();
		ПараметрыФайла.ВладелецФайлов = Объект.Ссылка;
		ПараметрыФайла.ИмяБезРасширения = СтрокаПолиса.Имя;
		ПараметрыФайла.РасширениеБезТочки = СтрокаПолиса.Расширение;
			
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СтрокаПолиса.ФайлДвоичныеДанные, Новый УникальныйИдентификатор());
		
		Если ЗначениеЗаполнено(СтрокаПолиса.Полис) Тогда
			
			ИнформацияОбОбновляемомФайле = Новый Структура;
			ИнформацияОбОбновляемомФайле.Вставить("АдресФайлаВоВременномХранилище", АдресВоВременномХранилище);
			ИнформацияОбОбновляемомФайле.Вставить("АдресВременногоХранилищаТекста", "");
			ИнформацияОбОбновляемомФайле.Вставить("ИмяБезРасширения", 				СтрокаПолиса.Имя);
			ИнформацияОбОбновляемомФайле.Вставить("Расширение", 					СтрокаПолиса.Расширение);
			МодульРаботаСФайлами.ОбновитьФайл(СтрокаПолиса.Полис, ИнформацияОбОбновляемомФайле);
			
		Иначе	
			СтрокаПолиса.Полис = МодульРаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресВоВременномХранилище);
		КонецЕсли;
		
			СтрокиСотрудника = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", СтрокаПолиса.Сотрудник));
			Для Каждого СтрокаСотрудника Из СтрокиСотрудника Цикл
				СтрокаСотрудника.Полис = СтрокаПолиса.Полис;
		    КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Функция ПараметрыФайлаПолиса()

	Возврат Новый Структура("Сотрудник, НомерПолиса, Имя, Расширение, ИмяФайла, ФайлДвоичныеДанные, Полис");
	
КонецФункции

&НаСервере
Процедура ПроверитьРассылкуПолисовДМС()
	
	Если Не Объект.ПрикреплениеПодтверждено Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПолисов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеПолисов.НомерПолиса КАК НомерПолиса,
		|	ДанныеПолисов.Полис КАК Полис
		|ПОМЕСТИТЬ ДанныеПолисов
		|ИЗ
		|	&Данные КАК ДанныеПолисов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеПолисов.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеПолисов.НомерПолиса КАК НомерПолиса,
		|	ИсторияРассылкиПолисовДМС.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	ДанныеПолисов КАК ДанныеПолисов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРассылкиПолисовДМС КАК ИсторияРассылкиПолисовДМС
		|		ПО (&Ссылка = ИсторияРассылкиПолисовДМС.Прикрепление)
		|			И ДанныеПолисов.ФизическоеЛицо = ИсторияРассылкиПолисовДМС.ФизическоеЛицо
		|			И ДанныеПолисов.НомерПолиса = ИсторияРассылкиПолисовДМС.НомерПолиса
		|			И ДанныеПолисов.Полис = ИсторияРассылкиПолисовДМС.Полис
		|			И (ИсторияРассылкиПолисовДМС.Выполнена)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Данные", Объект.Сотрудники.Выгрузить(,"ФизическоеЛицо, НомерПолиса, Полис"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура("ФизическоеЛицо, НомерПолиса");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДетальныеЗаписи);
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаСотрудника Из НайденныеСтроки Цикл
			СтрокаСотрудника.РассылкаВыполнена = Истина;
			СтрокаСотрудника.ДатаРассылкиПолиса = ВыборкаДетальныеЗаписи.ДатаОтправки;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПолисыДМСЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
	
	ОткрытьФормуОтправкиПолисовДМС();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтправкиПолисовДМС()
	
	Оповещение = Новый ОписаниеОповещения("УстановитьСтатусОтправкиПолисов", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Прикрепления", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ОтправкаПолисовДМС", ПараметрыФормы, ЭтотОбъект,,,, Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтправкиПолисов(Результат, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат.Количество() Тогда
		СтруктураПоиска = Новый Структура("ФизическоеЛицо");
		ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
		Для Каждого Стр Из Результат Цикл
			СтруктураПоиска.ФизическоеЛицо = Стр;
			НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураПоиска);
			Для Каждого СтрокаСотрудника Из НайденныеСтроки Цикл
				СтрокаСотрудника.РассылкаВыполнена = Истина;
				СтрокаСотрудника.ДатаРассылкиПолиса = ТекущаяДата;
			КонецЦикла;
		КонецЦикла;
		УстановитьВидимостьОтправкиПолисов();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЦветаНадписей()

	ЦветаНадписейСтруктура = Новый Структура;
	ЦветаНадписейСтруктура.Вставить("Красный", ЦветаСтиля.ПоясняющийОшибкуТекст);
	ЦветаНадписейСтруктура.Вставить("Желтый", ЦветаСтиля.ЗаблокированныйРеквизитЦвет);
	ЦветаНадписейСтруктура.Вставить("Зеленый", ЦветаСтиля.ГруппаВариантовОтчетовЦвет);
	ЦветаНадписейСтруктура.Вставить("Синий", ЦветаСтиля.ГиперссылкаЦвет);
	ЦветаНадписейСтруктура.Вставить("Бордовый", ЦветаСтиля.УдаленныеСтроки);
	ЦветаНадписейСтруктура.Вставить("Черный", ЦветаСтиля.ЦветТекстаФормы);
	ЦветаНадписейСтруктура.Вставить("Серый", ЦветаСтиля.ЦветРамки);
	ЦветаНадписейСтруктура.Вставить("ПоясняющийТекст", ЦветаСтиля.ПоясняющийТекст);
	
	ЦветаНадписей = Новый ФиксированнаяСтруктура(ЦветаНадписейСтруктура);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеРодственников(Команда)
	
	Если ПерсИнформацияРодственниковПередаетсяВСтраховую() = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.ЗагрузкаИзФайлаПерсональныхДанныхРодственников";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка персональных данных родственников'");
	ПараметрыЗагрузки.ИмяМакетаСШаблоном = "ЗагрузкаПерсональныхДанныхРодственников";
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЗагрузкаПерсональныхДанныхРодственников", Истина);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеРодственниковЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаСервере
Функция ПерсИнформацияРодственниковПередаетсяВСтраховую()
	
	// Виды предопределены в ТЧ ЗагрузкаИзФайлаПерсональныхДанныхРодственников
	ВидыПерсИнформацииРодственников = Новый Массив;
	ВидыПерсИнформацииРодственников.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица"));
	ВидыПерсИнформацииРодственников.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица"));
	ВидыПерсИнформацииРодственников.Добавить(ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации КАК ВидКонтактнойИнформации
		|ИЗ
		|	Справочник.ДоговорыСтрахования.ОтправляемаяКонтактнаяИнформация КАК ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация
		|ГДЕ
		|	ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.Ссылка = &ДоговорСтрахования
		|	И ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.Отправлять = ИСТИНА
		|	И ДоговорыСтрахованияОтправляемаяКонтактнаяИнформация.ВидКонтактнойИнформации В(&ВидКонтактнойИнформации)";
	
	Запрос.УстановитьПараметр("ВидКонтактнойИнформации", ВидыПерсИнформацииРодственников);
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	
	ПередаваемаяИнформация = Запрос.Выполнить().Выгрузить();
	
	ОтборИнформации = Новый Структура("ВидКонтактнойИнформации");
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'В Договоре страхования %1 не выбраны виды персональных данных родственников, которые планируется загрузить:'"), Объект.ДоговорСтрахования) + Символы.ПС;
	СчетчикПерсИнформации = 0;
	
	Для Каждого ВидИнформации Из ВидыПерсИнформацииРодственников Цикл
		
		ОтборИнформации.ВидКонтактнойИнформации = ВидИнформации;
		СтрокиВидаИнформации = ПередаваемаяИнформация.НайтиСтроки(ОтборИнформации);	
		ИнформацияПередается = СтрокиВидаИнформации.Количество() > 0;
		
		Если ИнформацияПередается Тогда
			СчетчикПерсИнформации = СчетчикПерсИнформации + 1;
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = '%1 %2,'"), ТекстСообщения, ВидИнформации);
		
	КонецЦикла;
	
	ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения) - 1);
	ТекстСообщения = СтрШаблон(НСтр("ru = '%1 %2 Отметьте эти передаваемые в Страховую компанию виды персональных данных в Договоре страхования и перезайдите в документ.'"), ТекстСообщения, Символы.ПС);
	
	// В данный момент количество и виды загружаемой информации предопределены
	Если СчетчикПерсИнформации < 3 Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
	КонецЕсли;
	
	ПерсИнформацияРодственниковПередаетсяВСтраховую = СчетчикПерсИнформации > 0;
	
	Возврат ПерсИнформацияРодственниковПередаетсяВСтраховую;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьНомераПолисовЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗагрузкаНомеровПолисовРодственников") Тогда
		ЗагрузитьНомераПолисовРодственниковНаСервере(АдресЗагруженныхДанных);
	ИначеЕсли ДополнительныеПараметры.Свойство("ЗагрузкаНомеровПолисовСотрудников") Тогда
		ЗагрузитьНомераПолисовСотрудниковНаСервере(АдресЗагруженныхДанных);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеРодственниковЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДанныеРодственниковНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеРодственниковНаСервере(АдресЗагруженныхДанных)

	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ДанныеДобавлены = Ложь;
	
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Родственник) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для родственника %1'"), СтрокаТаблицы.Родственник) + Символы.ПС;			
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", СтрокаТаблицы.Родственник);
		НайденныеСтроки = Объект.Родственники.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаРодственника = НайденныеСтроки[0];
			Если СтрокаРодственника.Свойство("EmailПредставление") Тогда
				СтрокаРодственника.EmailПредставление = СтрокаТаблицы.Email;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.Email) Тогда
					ТекстСообщения = ТекстСообщения + СтрШаблон(НСтр("ru = 'Email %2 не будет загружен в документ, выберите этот вид передаваемой информации в Договоре страхования.'"), СтрокаТаблицы.Email) + Символы.ПС;
				КонецЕсли;	
			КонецЕсли;
			Если СтрокаРодственника.Свойство("МобильныйТелефонПредставление") Тогда
				СтрокаРодственника.МобильныйТелефонПредставление = СтрокаТаблицы.МобильныйТелефон;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.МобильныйТелефон) Тогда
					ТекстСообщения = ТекстСообщения + СтрШаблон(НСтр("ru = 'Мобильный телефон %2 не будет загружен в документ, выберите этот вид передаваемой информации в Договоре страхования.'"), СтрокаТаблицы.МобильныйТелефон) + Символы.ПС;
				КонецЕсли;	
			КонецЕсли;
			Если СтрокаРодственника.Свойство("АдресДляИнформированияПредставление") Тогда
				СтрокаРодственника.АдресДляИнформированияПредставление = СтрокаТаблицы.АдресДляИнформирования;
			Иначе
				Если ЗначениеЗаполнено(СтрокаТаблицы.АдресДляИнформирования) Тогда
					ТекстСообщения = ТекстСообщения + СтрШаблон(НСтр("ru = 'Адрес для информирования %2 не будет загружен в документ, выберите этот вид передаваемой информации в Договоре страхования.'"), СтрокаТаблицы.АдресДляИнформирования);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ДанныеДобавлены = Истина;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДанныеДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНомераПолисовРодственниковНаСервере(АдресЗагруженныхДанных)

	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	НомераПолисовДобавлены = Ложь;
	
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.РодственникСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", СтрокаТаблицы.РодственникСсылка);
		НайденныеСтроки = Объект.Родственники.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаРодственника = НайденныеСтроки[0];
			СтрокаРодственника.НомерПолиса = СтрокаТаблицы.НомерПолиса;
		КонецЕсли;
		НомераПолисовДобавлены = Истина;
		
	КонецЦикла;
	
	Если НомераПолисовДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНомераПолисовСотрудниковНаСервере(АдресЗагруженныхДанных)

	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	НомераПолисовДобавлены = Ложь;
	
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаСотрудника = НайденныеСтроки[0];
			СтрокаСотрудника.НомерПолиса = СтрокаТаблицы.НомерПолиса;
		КонецЕсли;
		НомераПолисовДобавлены = Истина;
		
	КонецЦикла;
	
	Если НомераПолисовДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНомеровПолисов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиЗагрузитьНомераПолисов", "Видимость", Объект.ПрикреплениеПодтверждено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиНомерПолиса", "Видимость", Объект.ПрикреплениеПодтверждено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РодственникиЗагрузитьНомераПолисовРодственников", "Видимость", Объект.ПрикреплениеПодтверждено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РодственникиНомерПолиса", "Видимость", Объект.ПрикреплениеПодтверждено);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьОтправкиПолисов()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПолисЗагружен = Ложь;
		РассылкаВыполнена = Ложь;
	Иначе	
		ПолисЗагружен = ЗначениеЗаполнено(ТекущиеДанные.Полис);
		Если ТекущиеДанные.РассылкаВыполнена Тогда
			Элементы.СтатусОтправкиПолиса.Заголовок = НСтр(СтрШаблон("ru = 'Отправлен %1'", Формат(ТекущиеДанные.ДатаРассылкиПолиса, "ДЛФ=D")));
			Элементы.СтатусОтправкиПолиса.ЦветТекста = ЦветаНадписей["Зеленый"];
			РассылкаВыполнена = Истина;
		Иначе
			Элементы.СтатусОтправкиПолиса.Заголовок = НСтр("ru = 'Рассылка не выполнялась'");
            Элементы.СтатусОтправкиПолиса.ЦветТекста = ЦветаНадписей["ПоясняющийТекст"];
			РассылкаВыполнена = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусОтправкиПолиса", "Видимость", ПолисЗагружен);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиЗагрузитьПолисыСписком", "Видимость", Объект.ПрикреплениеПодтверждено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиПолис", "Видимость", Объект.ПрикреплениеПодтверждено);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиОтметитьКУдалениюФайлПолиса", "Видимость", ПолисЗагружен);
	
	Элементы.СотрудникиПолис.Заголовок = ?(ПолисЗагружен, НСтр("ru = 'Полис'"), НСтр("ru = 'Загрузить полис'"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтправитьПолисыДМС", "Видимость", Объект.ПрикреплениеПодтверждено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплениеПодтвержденоПриИзменении(Элемент)
	УстановитьВидимостьНомеровПолисов();
	УстановитьВидимостьОтправкиПолисов();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОтправляемыхДанных(Отказ, ПараметрыЗаписи)
	
	ВыводитьПредупреждение = Ложь;
	Для Каждого СтрокаПараметров Из ЭтотОбъект.ПараметрыПередаваемыхСведений Цикл
		Если СтрокаПараметров.СпособПроверкиЗаполнения = ПредопределенноеЗначение("Перечисление.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.ВыводитьПредупреждение") Тогда
			ВыводитьПредупреждение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыводитьПредупреждение Тогда
		
		Отказ = Истина;
		
		ЗакрытьПослеЗаписи =
		ПараметрыЗаписи.Свойство("ЗакрытьПослеЗаписи") И ПараметрыЗаписи.ЗакрытьПослеЗаписи;
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Записать", Истина);
		ПараметрыОбработчика.Вставить("Закрыть", ЗакрытьПослеЗаписи);
		ПараметрыОбработчика.Вставить("РежимЗаписи", ПараметрыЗаписи.РежимЗаписи);
		
		ОбработчикОтвета = Новый ОписаниеОповещения("ПроверитьЗаполнениеОтправляемыхДанныхПослеОтветаНаВопрос", ЭтотОбъект, ПараметрыОбработчика);
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.Заголовок = НСтр("ru = 'Отправляемые данные застрахованных не заполнены'");
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		
		ТекстВопроса = НСтр("ru = 'В документе не заполнены отправляемые данные, указанные в параметрах договора'");
		
		КнопкиОтвета = Новый СписокЗначений();
		КнопкиОтвета.Добавить(Истина, НСтр("ru = 'Все равно записать'"));
		КнопкиОтвета.Добавить(Ложь, НСтр("ru = 'Отмена'"));
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОтправляемыхДанныхПослеОтветаНаВопрос(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("Записать") И ДополнительныеПараметры.Записать Тогда
		Если ДополнительныеПараметры.Свойство("Закрыть") И ДополнительныеПараметры.Закрыть Тогда
			ПараметрыЗаписи = Новый Структура("ЗакрытьПослеЗаписи, РежимЗаписи", Истина, ДополнительныеПараметры.РежимЗаписи);
			ЗаписатьВыполнить(ПараметрыЗаписи);
		Иначе
			ПараметрыЗаписи = Новый Структура("ЗакрытьПослеЗаписи, РежимЗаписи", Ложь, ДополнительныеПараметры.РежимЗаписи);
			ЗаписатьВыполнить(ПараметрыЗаписи);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВыполнить(ПараметрыЗаписи)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ПроверкаПередЗаписьюВыполнена");
	
	Если Не Записать(ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.ЗакрытьПослеЗаписи И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

