#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Сотрудники.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, ,
		"Инструктажи");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ИнструктажПоОхранеТруда;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Журнал регистрации вводного инструктажа
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Отчет.ЖурналРегистрацииИнструктажа";
	КомандаПечати.ФункциональныеОпции = "ИспользоватьИнструктажиПоОхранеТруда";
	КомандаПечати.Идентификатор = "ЖурналРегистрацииВводногоИнструктажа";
	КомандаПечати.Представление = НСтр("ru = 'Журнал регистрации вводного инструктажа'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Истина);
	
	// Журнал регистрации инструктажа на рабочем месте
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Отчет.ЖурналРегистрацииИнструктажа";
	КомандаПечати.ФункциональныеОпции = "ИспользоватьИнструктажиПоОхранеТруда";
	КомандаПечати.Идентификатор = "ЖурналРегистрацииИнструктажаНаРабочемМесте";
	КомандаПечати.Представление = НСтр("ru = 'Журнал регистрации инструктажа на рабочем месте'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	ДобавитьУсловиеВидимостиКоманды(КомандаПечати, Ложь);
	
КонецПроцедуры

Процедура ДобавитьУсловиеВидимостиКоманды(КомандаПечати, ЭтоВводныйИнструктаж) Экспорт
	
	Если ЭтоВводныйИнструктаж Тогда
		ВидСравненияДляУсловия = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ВидСравненияДляУсловия = ВидСравненияКомпоновкиДанных.НеРавно;
	КонецЕсли;
	
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидИнструктажа",
		Справочники.ВидыИнструктажейПоОхранеТруда.Вводный, ВидСравненияДляУсловия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли