
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерСайтов = РекрутинговыеСайты.МенеджерРекрутинговыхСайтов(, , Ложь);
	
	Сайты = МенеджерСайтов.Сайты();
	ДанныеСайтов = МенеджерСайтов.ДанныеСайтов();
	
	ДополнитьФорму();
	
	Элементы.ГруппаКолонкаШаблон.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьПодключение();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ЛоготипНажатие(Элемент)
	
	ЗаполнитьТекущийСайт(Элемент);
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ДанныеСайтов[ТекущийСайт].ГлавнаяСтраница);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПройтиАвторизацию(Команда)
	
	ЗаполнитьТекущийСайт(Команда);
	
	ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "Подключение", ТекущийСайт)] = Истина;
	
	ОбновитьВидимостьЭлементов(ЭтотОбъект, ДанныеСайтов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКод(Команда)
	
	ЗаполнитьТекущийСайт(Команда);
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ДанныеСайтов[ТекущийСайт].АдресАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключить(Команда)
	
	ЗаполнитьТекущийСайт(Команда);
	
	Предупреждения = Новый Массив();
	
	Если ДанныеСайтов[ТекущийСайт].ПараметрыФорм.НастройкаДоступа.ВыводитьКодАвторизации Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "КодАвторизации", ТекущийСайт)]) Тогда
			Предупреждения.Добавить(НСтр("ru = 'Введите код авторизации.'"));
		КонецЕсли;
		
	ИначеЕсли ДанныеСайтов[ТекущийСайт].ПараметрыФорм.НастройкаДоступа.ВыводитьПароль Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "ИмяПользователя", ТекущийСайт)]) Тогда
			Предупреждения.Добавить(НСтр("ru = 'Введите имя пользователя.'"));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "Пароль", ТекущийСайт)]) Тогда
			Предупреждения.Добавить(НСтр("ru = 'Введите пароль.'"));
		КонецЕсли;
		
	Иначе
		Предупреждения.Добавить(НСтр("ru = 'Не указаны параметры авторизации. Обратитесь к администратору.'"));
	КонецЕсли;
	
	Если Предупреждения.Количество() <> 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Предупреждения, Символы.ПС));
	Иначе
		НачатьПодключение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	ЗаполнитьТекущийСайт(Команда);
	
	ОтключитьСайт(ТекущийСайт);
	
	ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "Подключен", ТекущийСайт)] = Ложь;
	
	ОбновитьВидимостьЭлементов(ЭтотОбъект, ДанныеСайтов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДополнитьФорму()
	
	ДобавитьРеквизиты();
	
	ДобавитьКоманды();
	
	ДобавитьЭлементы();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизиты()
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	Для Каждого Сайт Из Сайты Цикл
		
		ДанныеСайта = ДанныеСайтов[Сайт]; // См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
		ПараметрыСайта = ДанныеСайта.ПараметрыФорм.НастройкаДоступа;
		
		Если Не ЗначениеЗаполнено(ДанныеСайта.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Имя = "ИмяПользователя" + ДанныеСайта.Имя;
		Тип = ОбщегоНазначения.ОписаниеТипаСтрока(0);
		Реквизит = НовыйРеквизит(Имя, Тип);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		Имя = "Подключен" + ДанныеСайта.Имя;
		Тип = Новый ОписаниеТипов("Булево");
		Реквизит = НовыйРеквизит(Имя, Тип);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		Имя = "Подключение" + ДанныеСайта.Имя;
		Тип = Новый ОписаниеТипов("Булево");
		Реквизит = НовыйРеквизит(Имя, Тип);
		ДобавляемыеРеквизиты.Добавить(Реквизит);
		
		Если ПараметрыСайта.ВыводитьКодАвторизации Тогда
			Имя = "КодАвторизации" + ДанныеСайта.Имя;
			Тип = ОбщегоНазначения.ОписаниеТипаСтрока(0);
			Реквизит = НовыйРеквизит(Имя, Тип);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
		
		Если ПараметрыСайта.ВыводитьПароль Тогда
			Имя = "Пароль" + ДанныеСайта.Имя;
			Тип = ОбщегоНазначения.ОписаниеТипаСтрока(0);
			Реквизит = НовыйРеквизит(Имя, Тип);
			ДобавляемыеРеквизиты.Добавить(Реквизит);
		КонецЕсли;
		
	КонецЦикла;
	
	ИменаРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(ЭтотОбъект, ИменаРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(ЭтотОбъект, ДобавляемыеРеквизиты, ИменаРеквизитовФормы);
	
КонецПроцедуры

&НаСервере
Функция НовыйРеквизит(Имя, Тип, Заголовок = "", Путь = "", СохраняемыеДанные = Ложь)
	
	Возврат РекрутинговыеСайтыФормы.НовыйРеквизит(Имя, Тип, Заголовок, Путь, СохраняемыеДанные);
	
КонецФункции

&НаСервере
Процедура ДобавитьКоманды()
	
	Для Каждого Сайт Из Сайты Цикл
		
		ДанныеСайта = ДанныеСайтов[Сайт]; // См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
		ПараметрыСайта = ДанныеСайта.ПараметрыФорм.НастройкаДоступа;
		
		Если Не ЗначениеЗаполнено(ДанныеСайта.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Команда = Команды.Добавить("ПройтиАвторизацию" + ДанныеСайта.Имя);
		Команда.Заголовок = СтрШаблон(НСтр("ru = 'Пройти авторизацию'"));
		Команда.Действие = "ПройтиАвторизацию";
		
		Если ПараметрыСайта.ВыводитьКодАвторизации Тогда
			Команда = Команды.Добавить("ПолучитьКод" + ДанныеСайта.Имя);
			Команда.Заголовок = СтрШаблон(НСтр("ru = 'Получить код'"));
			Команда.Действие = "ПолучитьКод";
		КонецЕсли;
		
		Команда = Команды.Добавить("Подключить" + ДанныеСайта.Имя);
		Команда.Заголовок = СтрШаблон(НСтр("ru = 'Подключить'"));
		Команда.Действие = "Подключить";
		
		Команда = Команды.Добавить("Отключить" + ДанныеСайта.Имя);
		Команда.Заголовок = СтрШаблон(НСтр("ru = 'Отключить'"));
		Команда.Действие = "Отключить";
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементы()
	
	ШаблонГруппа = Элементы.ГруппаШаблон;
	
	СвойстваГруппа = Новый Массив();
	СвойстваГруппа.Добавить("Вид");
	СвойстваГруппа.Добавить("Отображение");
	СвойстваГруппа.Добавить("Группировка");
	СвойстваГруппа.Добавить("ОтображатьЗаголовок");
	СвойстваГруппа.Добавить("ГоризонтальныйИнтервал");
	СвойстваГруппа.Добавить("ВертикальныйИнтервал");
	СвойстваГруппа.Добавить("ЦветФона");
	СвойстваГруппа.Добавить("Ширина");
	СвойстваГруппа.Добавить("Высота");
	СвойстваГруппа.Добавить("РастягиватьПоГоризонтали");
	СвойстваГруппа.Добавить("РастягиватьПоВертикали");
	
	ШаблонЛоготип = Элементы.ЛоготипШаблон;
	
	СвойстваЛоготип = Новый Массив();
	СвойстваЛоготип.Добавить("Вид");
	СвойстваЛоготип.Добавить("Гиперссылка");
	СвойстваЛоготип.Добавить("ОтображениеПодсказки");
	СвойстваЛоготип.Добавить("СпособПеретаскиванияФайлов");
	СвойстваЛоготип.Добавить("РазмерКартинки");
	СвойстваЛоготип.Добавить("ВертикальноеПоложениеВГруппе");
	
	ШаблонСтраницы = Элементы.СтраницыШаблон;
	
	СвойстваСтраницы = Новый Массив();
	СвойстваСтраницы.Добавить("Вид");
	СвойстваСтраницы.Добавить("ОтображениеСтраниц");
	СвойстваСтраницы.Добавить("ВертикальноеПоложениеВГруппе");
	
	ШаблонСтраницаНеПодключен = Элементы.СтраницаНеПодключенШаблон;
	
	СвойстваСтраницаНеПодключен= Новый Массив();
	СвойстваСтраницаНеПодключен.Добавить("Вид");
	
	ШаблонСтраницаПодключение = Элементы.СтраницаПодключениеШаблон;
	
	СвойстваСтраницаПодключение = Новый Массив();
	СвойстваСтраницаПодключение.Добавить("Вид");
	
	ШаблонСтраницаПодключен = Элементы.СтраницаПодключенШаблон;
	
	СвойстваСтраницаПодключен = Новый Массив();
	СвойстваСтраницаПодключен.Добавить("Вид");
	
	МаксКоличествоКолонок = 3;
	МаксКоличествоСайтовВКолонке = 4;
	КоличествоСайтов = Сайты.Количество();
	КоличествоСайтовВКолонке = 1;
	КоличествоКолонок = Мин(МаксКоличествоКолонок,
		?(КоличествоСайтов % МаксКоличествоСайтовВКолонке = 0,
			Цел(КоличествоСайтов / МаксКоличествоСайтовВКолонке),
			Цел(КоличествоСайтов / МаксКоличествоСайтовВКолонке) + 1));
		
	ДобавитьКолонки(КоличествоКолонок);
	НомерКолонки = 0;
	
	Для Каждого Сайт Из Сайты Цикл
		
		ДанныеСайта = ДанныеСайтов[Сайт]; // См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
		
		Если Не ЗначениеЗаполнено(ДанныеСайта.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НомерКолонки = КоличествоКолонок Тогда
			НомерКолонки = 1;
			КоличествоСайтовВКолонке = КоличествоСайтовВКолонке + 1;
		Иначе
			НомерКолонки = НомерКолонки + 1;
		КонецЕсли;
		
		Если КоличествоСайтовВКолонке > МаксКоличествоСайтовВКолонке Тогда
			Родитель = Элементы.ГруппаКолонкиНиз;
		Иначе
			Родитель = Элементы["ГруппаКолонка" + НомерКолонки];
		КонецЕсли;
		
		ОсновнаяГруппа = ДобавитьЭлементПоШаблону(
			"Группа" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппа,
			СвойстваГруппа,
			Родитель);
		
		Логотип = ДобавитьЭлементПоШаблону(
			"Логотип" + ДанныеСайта.Имя,
			Тип("ДекорацияФормы"),
			ШаблонЛоготип,
			СвойстваЛоготип,
			ОсновнаяГруппа);
		
		Логотип.Картинка = ДанныеСайта.Логотип;
		Логотип.УстановитьДействие("Нажатие", "Подключаемый_ЛоготипНажатие");
		
		Страницы = ДобавитьЭлементПоШаблону(
			"Страницы" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонСтраницы,
			СвойстваСтраницы,
			ОсновнаяГруппа);
		
		СтраницаНеПодключен = ДобавитьЭлементПоШаблону(
			"СтраницаНеПодключен" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонСтраницаНеПодключен,
			СвойстваСтраницаНеПодключен,
			Страницы);
		
		ДобавитьЭлементыСтраницыНеПодключен(СтраницаНеПодключен, ДанныеСайта);
		
		СтраницаПодключение = ДобавитьЭлементПоШаблону(
			"СтраницаПодключение" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонСтраницаПодключение,
			СвойстваСтраницаПодключение,
			Страницы);
		
		ДобавитьЭлементыСтраницыПодключение(СтраницаПодключение, ДанныеСайта);
		
		СтраницаПодключен = ДобавитьЭлементПоШаблону(
			"СтраницаПодключен" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонСтраницаПодключен,
			СвойстваСтраницаПодключен,
			Страницы);
		
		ДобавитьЭлементыСтраницыПодключен(СтраницаПодключен, ДанныеСайта);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКолонки(КоличествоКолонок)
	
	ШаблонКолонка = Элементы.ГруппаКолонкаШаблон;
	
	СвойстваКолонка = Новый Массив();
	СвойстваКолонка.Добавить("Вид");
	СвойстваКолонка.Добавить("Отображение");
	СвойстваКолонка.Добавить("Группировка");
	СвойстваКолонка.Добавить("ОтображатьЗаголовок");
	
	Для НомерКолонки = 1 По КоличествоКолонок Цикл
		ДобавитьЭлементПоШаблону(
			"ГруппаКолонка" + НомерКолонки,
			Тип("ГруппаФормы"),
			ШаблонКолонка,
			СвойстваКолонка,
			Элементы.ГруппаКолонкиВерх);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыСтраницыНеПодключен(СтраницаНеПодключен, ДанныеСайта)
	
	ШаблонГруппаНеПодключен = Элементы.ГруппаНеПодключенШаблон;
	
	СвойстваГруппаНеПодключен = Новый Массив();
	СвойстваГруппаНеПодключен.Добавить("Вид");
	СвойстваГруппаНеПодключен.Добавить("Отображение");
	СвойстваГруппаНеПодключен.Добавить("Группировка");
	СвойстваГруппаНеПодключен.Добавить("ОтображатьЗаголовок");
	СвойстваГруппаНеПодключен.Добавить("ВертикальноеПоложениеПодчиненных");
	
	ШаблонКартинкаНеПодключен = Элементы.КартинкаНеПодключенШаблон;
	
	СвойстваКартинкаНеПодключен = Новый Массив();
	СвойстваКартинкаНеПодключен.Добавить("Вид");
	СвойстваКартинкаНеПодключен.Добавить("Картинка");
	СвойстваКартинкаНеПодключен.Добавить("ОтображениеПодсказки");
	СвойстваКартинкаНеПодключен.Добавить("СпособПеретаскиванияФайлов");
	
	ШаблонНадписьНеПодключен = Элементы.НадписьНеПодключенШаблон;
	
	СвойстваНадписьНеПодключен = Новый Массив();
	СвойстваНадписьНеПодключен.Добавить("Вид");
	СвойстваНадписьНеПодключен.Добавить("Шрифт");
	СвойстваНадписьНеПодключен.Добавить("ОтображениеПодсказки");
	
	ШаблонПройтиАвторизацию = Элементы.ПройтиАвторизациюШаблон;
	
	СвойстваПройтиАвторизацию = Новый Массив();
	СвойстваПройтиАвторизацию.Добавить("Вид");
	СвойстваПройтиАвторизацию.Добавить("ОтображениеПодсказки");
	СвойстваПройтиАвторизацию.Добавить("ГоризонтальноеПоложениеВГруппе");
	
	ГруппаНеПодключен = ДобавитьЭлементПоШаблону(
		"ГруппаНеПодключен" + ДанныеСайта.Имя,
		Тип("ГруппаФормы"),
		ШаблонГруппаНеПодключен,
		СвойстваГруппаНеПодключен,
		СтраницаНеПодключен);
	
	ДобавитьЭлементПоШаблону(
		"КартинкаНеПодключен" + ДанныеСайта.Имя,
		Тип("ДекорацияФормы"),
		ШаблонКартинкаНеПодключен,
		СвойстваКартинкаНеПодключен,
		ГруппаНеПодключен);
	
	НадписьНеПодключен = ДобавитьЭлементПоШаблону(
		"НадписьНеПодключен" + ДанныеСайта.Имя,
		Тип("ДекорацияФормы"),
		ШаблонНадписьНеПодключен,
		СвойстваНадписьНеПодключен,
		ГруппаНеПодключен);
	
	НадписьНеПодключен.Заголовок = СтрШаблон(ШаблонНадписьНеПодключен.Заголовок, ДанныеСайта.Представление);
	
	ПройтиАвторизацию = ДобавитьЭлементПоШаблону(
		"ПройтиАвторизацию" + ДанныеСайта.Имя,
		Тип("КнопкаФормы"),
		ШаблонПройтиАвторизацию,
		СвойстваПройтиАвторизацию,
		СтраницаНеПодключен);
	
	ПройтиАвторизацию.ИмяКоманды = ПройтиАвторизацию.Имя;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыСтраницыПодключение(СтраницаПодключение, ДанныеСайта)
	
	ПараметрыФормы = ДанныеСайта.ПараметрыФорм.НастройкаДоступа;
	
	ШаблонГруппаПодключениеСКодом = Элементы.ГруппаПодключениеСКодомШаблон;
	
	СвойстваГруппаПодключениеСКодом = Новый Массив();
	СвойстваГруппаПодключениеСКодом.Добавить("Вид");
	СвойстваГруппаПодключениеСКодом.Добавить("Отображение");
	СвойстваГруппаПодключениеСКодом.Добавить("Группировка");
	СвойстваГруппаПодключениеСКодом.Добавить("ОтображатьЗаголовок");
	
	ШаблонГруппаПолучениеКода = Элементы.ГруппаПолучениеКодаШаблон;
	
	СвойстваГруппаПолучениеКода = Новый Массив();
	СвойстваГруппаПолучениеКода.Добавить("Вид");
	СвойстваГруппаПолучениеКода.Добавить("Отображение");
	СвойстваГруппаПолучениеКода.Добавить("Группировка");
	СвойстваГруппаПолучениеКода.Добавить("ОтображатьЗаголовок");
	СвойстваГруппаПолучениеКода.Добавить("ВертикальноеПоложениеПодчиненных");
	
	ШаблонНадписьПолучениеКода = Элементы.НадписьПолучениеКодаШаблон;
	
	СвойстваНадписьПолучениеКода = Новый Массив();
	СвойстваНадписьПолучениеКода.Добавить("Вид");
	СвойстваНадписьПолучениеКода.Добавить("Заголовок");
	СвойстваНадписьПолучениеКода.Добавить("Ширина");
	
	ШаблонПолучитьКод = Элементы.ПолучитьКодШаблон;
	
	СвойстваПолучитьКод = Новый Массив();
	СвойстваПолучитьКод.Добавить("Вид");
	СвойстваПолучитьКод.Добавить("Ширина");
	
	ШаблонНадписьВставкаКода = Элементы.НадписьВставкаКодаШаблон;
	
	СвойстваНадписьВставкаКода = Новый Массив();
	СвойстваНадписьВставкаКода.Добавить("Вид");
	СвойстваНадписьВставкаКода.Добавить("Заголовок");
	СвойстваНадписьВставкаКода.Добавить("ГоризонтальноеПоложениеВГруппе");
	
	ШаблонГруппаКодАвторизации = Элементы.ГруппаКодАвторизацииШаблон;
	
	СвойстваГруппаКодАвторизации = Новый Массив();
	СвойстваГруппаКодАвторизации.Добавить("Вид");
	СвойстваГруппаКодАвторизации.Добавить("Отображение");
	СвойстваГруппаКодАвторизации.Добавить("Группировка");
	СвойстваГруппаКодАвторизации.Добавить("ОтображатьЗаголовок");
	СвойстваГруппаКодАвторизации.Добавить("ВертикальноеПоложениеПодчиненных");
	
	ШаблонКодАвторизации = Элементы.КодАвторизацииШаблон;
	
	СвойстваКодАвторизации = Новый Массив();
	СвойстваКодАвторизации.Добавить("Вид");
	СвойстваКодАвторизации.Добавить("ПоложениеЗаголовка");
	СвойстваКодАвторизации.Добавить("Ширина");
	СвойстваКодАвторизации.Добавить("РастягиватьПоГоризонтали");
	
	ШаблонПодключить = Элементы.ПодключитьШаблон;
	
	СвойстваПодключить = Новый Массив();
	СвойстваПодключить.Добавить("Вид");
	СвойстваПодключить.Добавить("Ширина");
	
	ШаблонГруппаПодключениеСПаролем = Элементы.ГруппаПодключениеСПаролемШаблон;
	
	СвойстваГруппаПодключениеСПаролем = Новый Массив();
	СвойстваГруппаПодключениеСПаролем.Добавить("Вид");
	СвойстваГруппаПодключениеСПаролем.Добавить("Отображение");
	СвойстваГруппаПодключениеСПаролем.Добавить("Группировка");
	СвойстваГруппаПодключениеСПаролем.Добавить("ОтображатьЗаголовок");
	
	ШаблонИмяПользователяПодключение = Элементы.ИмяПользователяПодключениеШаблон;
	
	СвойстваИмяПользователяПодключение = Новый Массив();
	СвойстваИмяПользователяПодключение.Добавить("Вид");
	СвойстваИмяПользователяПодключение.Добавить("ПоложениеЗаголовка");
	СвойстваИмяПользователяПодключение.Добавить("ПодсказкаВвода");
	СвойстваИмяПользователяПодключение.Добавить("Ширина");
	СвойстваИмяПользователяПодключение.Добавить("РастягиватьПоГоризонтали");
	
	ШаблонГруппаПароль = Элементы.ГруппаПарольШаблон;
	
	СвойстваГруппаПароль = Новый Массив();
	СвойстваГруппаПароль.Добавить("Вид");
	СвойстваГруппаПароль.Добавить("Отображение");
	СвойстваГруппаПароль.Добавить("Группировка");
	СвойстваГруппаПароль.Добавить("ОтображатьЗаголовок");
	СвойстваГруппаПароль.Добавить("ВертикальноеПоложениеПодчиненных");
	
	ШаблонПароль = Элементы.ПарольШаблон;
	
	СвойстваПароль = Новый Массив();
	СвойстваПароль.Добавить("Вид");
	СвойстваПароль.Добавить("ПоложениеЗаголовка");
	СвойстваПароль.Добавить("РежимПароля");
	СвойстваПароль.Добавить("ПодсказкаВвода");
	СвойстваПароль.Добавить("Ширина");
	СвойстваПароль.Добавить("РастягиватьПоГоризонтали");
	
	Если ПараметрыФормы.ВыводитьКодАвторизации Тогда
		
		ГруппаГруппаПодключениеСКодом = ДобавитьЭлементПоШаблону(
			"ГруппаПодключениеСКодом" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаПодключениеСКодом,
			СвойстваГруппаПодключениеСКодом,
			СтраницаПодключение);
		
		ГруппаПолучениеКода = ДобавитьЭлементПоШаблону(
			"ГруппаПолучениеКода" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаПолучениеКода,
			СвойстваГруппаПолучениеКода,
			ГруппаГруппаПодключениеСКодом);
		
		ДобавитьЭлементПоШаблону(
			"НадписьПолучениеКода" + ДанныеСайта.Имя,
			Тип("ДекорацияФормы"),
			ШаблонНадписьПолучениеКода,
			СвойстваНадписьПолучениеКода,
			ГруппаПолучениеКода);
		
		ПолучитьКод = ДобавитьЭлементПоШаблону(
			"ПолучитьКод" + ДанныеСайта.Имя,
			Тип("КнопкаФормы"),
			ШаблонПолучитьКод,
			СвойстваПолучитьКод,
			ГруппаПолучениеКода);
		
		ПолучитьКод.ИмяКоманды = ПолучитьКод.Имя;
		
		ДобавитьЭлементПоШаблону(
			"НадписьВставкаКода" + ДанныеСайта.Имя,
			Тип("ДекорацияФормы"),
			ШаблонНадписьВставкаКода,
			СвойстваНадписьВставкаКода,
			ГруппаГруппаПодключениеСКодом);
		
		ГруппаКодАвторизации = ДобавитьЭлементПоШаблону(
			"ГруппаКодАвторизации" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаКодАвторизации,
			СвойстваГруппаКодАвторизации,
			ГруппаГруппаПодключениеСКодом);
		
		КодАвторизации = ДобавитьЭлементПоШаблону(
			"КодАвторизации" + ДанныеСайта.Имя,
			Тип("ПолеФормы"),
			ШаблонКодАвторизации,
			СвойстваКодАвторизации,
			ГруппаКодАвторизации);
		
		КодАвторизации.ПутьКДанным = КодАвторизации.Имя;
		КодАвторизации.Подсказка = СтрШаблон(ШаблонКодАвторизации.Подсказка, ДанныеСайта.Представление);
		КодАвторизации.ПодсказкаВвода = СтрШаблон(ШаблонКодАвторизации.ПодсказкаВвода, ДанныеСайта.Представление); //@skip-check property-return-type
		
		Подключить = ДобавитьЭлементПоШаблону(
			"Подключить" + ДанныеСайта.Имя,
			Тип("КнопкаФормы"),
			ШаблонПодключить,
			СвойстваПодключить,
			ГруппаКодАвторизации);
		
		Подключить.ИмяКоманды = Подключить.Имя;
		
	ИначеЕсли ПараметрыФормы.ВыводитьПароль Тогда
		
		ГруппаПодключениеСПаролем = ДобавитьЭлементПоШаблону(
			"ГруппаПодключениеСПаролем" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаПодключениеСПаролем,
			СвойстваГруппаПодключениеСПаролем,
			СтраницаПодключение);
		
		ИмяПользователяПодключение = ДобавитьЭлементПоШаблону(
			"ИмяПользователяПодключение" + ДанныеСайта.Имя,
			Тип("ПолеФормы"),
			ШаблонИмяПользователяПодключение,
			СвойстваИмяПользователяПодключение,
			ГруппаПодключениеСПаролем);
		
		ИмяПользователяПодключение.ПутьКДанным = "ИмяПользователя" + ДанныеСайта.Имя;
		
		ГруппаПароль = ДобавитьЭлементПоШаблону(
			"ГруппаПароль" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаПароль,
			СвойстваГруппаПароль,
			ГруппаПодключениеСПаролем);
		
		Пароль = ДобавитьЭлементПоШаблону(
			"Пароль" + ДанныеСайта.Имя,
			Тип("ПолеФормы"),
			ШаблонПароль,
			СвойстваПароль,
			ГруппаПароль);
		
		Пароль.ПутьКДанным = Пароль.Имя;
		
		Подключить = ДобавитьЭлементПоШаблону(
			"Подключить" + ДанныеСайта.Имя,
			Тип("КнопкаФормы"),
			ШаблонПодключить,
			СвойстваПодключить,
			ГруппаПароль);
		
		Подключить.ИмяКоманды = Подключить.Имя;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыСтраницыПодключен(СтраницаПодключен, ДанныеСайта)
	
	ШаблонГруппаПодключен = Элементы.ГруппаПодключенШаблон;
	
	СвойстваГруппаПодключен = Новый Массив();
	СвойстваГруппаПодключен.Добавить("Вид");
	СвойстваГруппаПодключен.Добавить("Отображение");
	СвойстваГруппаПодключен.Добавить("Группировка");
	СвойстваГруппаПодключен.Добавить("ОтображатьЗаголовок");
	СвойстваГруппаПодключен.Добавить("ВертикальноеПоложениеПодчиненных");
	СвойстваГруппаПодключен.Добавить("ГоризонтальноеПоложениеВГруппе");
	
	ШаблонКартинкаПодключен = Элементы.КартинкаПодключенШаблон;
	
	СвойстваКартинкаПодключен = Новый Массив();
	СвойстваКартинкаПодключен.Добавить("Вид");
	СвойстваКартинкаПодключен.Добавить("Картинка");
	СвойстваКартинкаПодключен.Добавить("СпособПеретаскиванияФайлов");
	
	ШаблонНадписьПодключен = Элементы.НадписьПодключенШаблон;
	
	СвойстваНадписьПодключен = Новый Массив();
	СвойстваНадписьПодключен.Добавить("Вид");
	СвойстваНадписьПодключен.Добавить("Заголовок");
	СвойстваНадписьПодключен.Добавить("Шрифт");
	
	ШаблонИмяПользователя = Элементы.ИмяПользователяШаблон;
	
	СвойстваИмяПользователя = Новый Массив();
	СвойстваИмяПользователя.Добавить("Вид");
	СвойстваИмяПользователя.Добавить("Заголовок");
	СвойстваИмяПользователя.Добавить("ПоложениеЗаголовка");
	СвойстваИмяПользователя.Добавить("РастягиватьПоГоризонтали");
	
	ШаблонОтключить = Элементы.ОтключитьШаблон;
	
	СвойстваОтключить = Новый Массив();
	СвойстваОтключить.Добавить("Вид");
	СвойстваОтключить.Добавить("Ширина");
	СвойстваОтключить.Добавить("ГоризонтальноеПоложениеВГруппе");
	
	ГруппаПодключен = ДобавитьЭлементПоШаблону(
			"ГруппаПодключен" + ДанныеСайта.Имя,
			Тип("ГруппаФормы"),
			ШаблонГруппаПодключен,
			СвойстваГруппаПодключен,
			СтраницаПодключен);
		
	ДобавитьЭлементПоШаблону(
		"КартинкаПодключен" + ДанныеСайта.Имя,
		Тип("ДекорацияФормы"),
		ШаблонКартинкаПодключен,
		СвойстваКартинкаПодключен,
		ГруппаПодключен);
	
	НадписьПодключен = ДобавитьЭлементПоШаблону(
		"НадписьПодключен" + ДанныеСайта.Имя,
		Тип("ДекорацияФормы"),
		ШаблонНадписьПодключен,
		СвойстваНадписьПодключен,
		ГруппаПодключен);
	
	НадписьПодключен.Заголовок = СтрШаблон(ШаблонНадписьПодключен.Заголовок, ДанныеСайта.Представление);
	
	ИмяПользователя = ДобавитьЭлементПоШаблону(
		"ИмяПользователя" + ДанныеСайта.Имя,
		Тип("ПолеФормы"),
		ШаблонИмяПользователя,
		СвойстваИмяПользователя,
		СтраницаПодключен);
	
	ИмяПользователя.ПутьКДанным = ИмяПользователя.Имя;
	
	Отключить = ДобавитьЭлементПоШаблону(
		"Отключить" + ДанныеСайта.Имя,
		Тип("КнопкаФормы"),
		ШаблонОтключить,
		СвойстваОтключить,
		СтраницаПодключен);
	
	Отключить.ИмяКоманды = Отключить.Имя;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЭлементПоШаблону(Имя, Тип, Шаблон, Свойства, Родитель = Неопределено)
	
	Элемент = Элементы.Добавить(Имя, Тип, Родитель);
	
	Если Свойства.Найти("Вид") <> Неопределено Тогда
		Элемент.Вид = Шаблон.Вид;
	КонецЕсли;
	
	СписокСвойств = СтрСоединить(Свойства, ",");
	
	ЗаполнитьЗначенияСвойств(Элемент, Шаблон, СписокСвойств);
	
	Возврат Элемент;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключение()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПроверкаПодключенияЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = ДлительнаяОперацияПроверкиПодключения(Сайты, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Проверка подключения.'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПроверкиПодключения(Сайты, УникальныйИдентификатор) Экспорт
	
	ИмяПроцедуры = "РекрутинговыеСайты.ПроверитьПодключение"; 
	ПараметрыВыполненияФункции = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияФункции, ИмяПроцедуры, Сайты);
	
КонецФункции

&НаКлиенте
Процедура ПроверкаПодключенияЗавершение(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		Возврат;
	ИначеЕсли Не ДлительнаяОперация.Статус = "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
	
	Для Каждого Сайт Из Сайты Цикл
		Если Результат[Сайт] = Неопределено Тогда
			ТекстСообщения = 
				СтрШаблон(НСтр("ru = 'Ошибка при проверке подключения к %1. Подробности в журнале регистрации.'"), Сайт);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "Подключен", Сайт);
		ЭтотОбъект[ИмяРеквизита] = Результат[Сайт].Подключен;
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ИмяПользователя", Сайт);
		ЭтотОбъект[ИмяРеквизита] = Результат[Сайт].ИмяПользователя;
	КонецЦикла;
	
	ОбновитьВидимостьЭлементов(ЭтотОбъект, ДанныеСайтов);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодключение()
	
	ПараметрыПодключения = РекрутинговыеСайтыКлиент.НовыеПараметрыПодключения();
	ПараметрыПодключения.Сайт = ТекущийСайт;
	
	ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "КодАвторизации", ТекущийСайт);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизита) Тогда
		ПараметрыПодключения.КодАвторизации = ЭтотОбъект[ИмяРеквизита];
	КонецЕсли;
	
	ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ИмяПользователя", ТекущийСайт);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизита) Тогда
		ПараметрыПодключения.ИмяПользователя = ЭтотОбъект[ИмяРеквизита];
	КонецЕсли;
	
	ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "Пароль", ТекущийСайт);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизита) Тогда
		ПараметрыПодключения.Пароль = ЭтотОбъект[ИмяРеквизита];
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПодключитьЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = ДлительнаяОперацияПодключения(ПараметрыПодключения, УникальныйИдентификатор);
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Подключение.'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПодключения(ПараметрыПодключения, УникальныйИдентификатор) Экспорт
	
	ИмяПроцедуры = "РекрутинговыеСайты.Подключить";
	ПараметрыВыполненияФункции = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияФункции, ИмяПроцедуры, ПараметрыПодключения);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьЗавершение(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		Возврат;
	ИначеЕсли Не ДлительнаяОперация.Статус = "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
	
	Если Результат.Подключен Тогда
		ТекстПредупреждения = 
			СтрШаблон(НСтр("ru = 'Авторизация на сайте %1 пройдена успешно.'"), ДанныеСайтов[ТекущийСайт].ИмяСайта);
			
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "Подключен", ТекущийСайт);
		ЭтотОбъект[ИмяРеквизита] = Результат.Подключен;
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ИмяПользователя", ТекущийСайт);
		ЭтотОбъект[ИмяРеквизита] = Результат.ИмяПользователя;
	Иначе
		ТекстПредупреждения = НСтр("ru = 'Не удалось авторизоваться. Введены неверные данные.'");
	КонецЕсли;
	
	ПоказатьПредупреждение(, ТекстПредупреждения);
	
	ОбновитьВидимостьЭлементов(ЭтотОбъект, ДанныеСайтов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт)

	Возврат РекрутинговыеСайтыКлиентСервер.ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьЭлементов(Форма, ДанныеСайтов)
	
	Для Каждого КлючИЗначение Из ДанныеСайтов Цикл
		Сайт = КлючИЗначение.Ключ;
		
		ИмяРеквизитаПодключен = ИмяРеквизита(ДанныеСайтов, "Подключен", Сайт);
		ИмяРеквизитаПодключение = ИмяРеквизита(ДанныеСайтов, "Подключение", Сайт);
		ИмяРеквизитаСтраницы = ИмяРеквизита(ДанныеСайтов, "Страницы", Сайт);
		ИмяРеквизитаСтраницаПодключен = ИмяРеквизита(ДанныеСайтов, "СтраницаПодключен", Сайт);
		ИмяРеквизитаСтраницаПодключение = ИмяРеквизита(ДанныеСайтов, "СтраницаПодключение", Сайт);
		ИмяРеквизитаСтраницаНеПодключен = ИмяРеквизита(ДанныеСайтов, "СтраницаНеПодключен", Сайт);
		
		Если Форма[ИмяРеквизитаПодключен] Тогда
			Форма.Элементы[ИмяРеквизитаСтраницы].ТекущаяСтраница = Форма.Элементы[ИмяРеквизитаСтраницаПодключен];
		ИначеЕсли Форма[ИмяРеквизитаПодключение] Тогда
			Форма.Элементы[ИмяРеквизитаСтраницы].ТекущаяСтраница = Форма.Элементы[ИмяРеквизитаСтраницаПодключение];
		Иначе
			Форма.Элементы[ИмяРеквизитаСтраницы].ТекущаяСтраница = Форма.Элементы[ИмяРеквизитаСтраницаНеПодключен];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущийСайт(Элемент)
	
	Сайт = Неопределено;
	
	Для Каждого КлючИЗначение Из ДанныеСайтов Цикл
		Сайт = КлючИЗначение.Ключ;
		ДанныеСайта = КлючИЗначение.Значение;
		
		Если СтрНайти(ВРег(Элемент.Имя), ВРег(ДанныеСайта.Имя)) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийСайт = Сайт;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтключитьСайт(Сайт)
	
	МенеджерЗаписи = РегистрыСведений.НастройкиИнтеграцииРекрутинговыхСайтов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.РекрутинговыйСайт = Сайт;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Использовать = Ложь;
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти