
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ПланГлобальногоПоиска = ГлобальныйПоиск.ПолучитьПлан();
	ЗаполнитьПлан(ПланГлобальногоПоиска);
	ГлобальныйПоиск.УстановитьПлан(ПланГлобальногоПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПлан(ПланГлобальногоПоиска)

	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначенияКлиент.ОбщийМодуль("ПоискФизическихЛицГлобальныйПоискКлиент");
		МодульПоискФизическихЛиц.ДополнитьПлан(ПланГлобальногоПоиска);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти