// @strict-types

#Область ПрограммныйИнтерфейс

#Область КодыВозврата

// Возвращает код ошибки данных.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаОшибкаДанных() Экспорт
КонецФункции

// Возвращает код отказа авторизации.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаОтказАвторизации() Экспорт
КонецФункции

// Возвращает код внутренней ошибки.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаВнутренняяОшибка() Экспорт
КонецФункции

// Возвращает код выполнения с предупреждениями.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаВыполненоСПредупреждениями() Экспорт
КонецФункции

// Возвращает код успешного выполнения.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаВыполнено() Экспорт
КонецФункции

// Возвращает код ожидания данных.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодСостоянияОжидание() Экспорт
КонецФункции

// Возвращает код отсутствия данных.
// 
// Возвращаемое значение:
//	Число - стандартный код возврата по имени метода.
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция КодВозвратаНеНайдено() Экспорт
КонецФункции

#КонецОбласти

#Область ТипыФайлов

// Возвращает строку с типом файла JSON
// 
// Возвращаемое значение:
//	Строка - "json"
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция ТипJSON() Экспорт
КонецФункции

// Возвращает строку с типом файла XLSX
// 
// Возвращаемое значение:
//	Строка - "xlsx"
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция ТипXLSX() Экспорт
КонецФункции

// Возвращает строку с типом файла PDF
// 
// Возвращаемое значение:
//	Строка - "pdf"
//
// @skip-check module-empty-method - реализован в расширении fresh.
Функция ТипPDF() Экспорт
КонецФункции

#КонецОбласти

#КонецОбласти
