#Область СлужебныеПроцедурыИФункции

#Область ВредныеФакторыВидыРабот

Процедура ПрочитатьОписаниеПериодичностиВредногоФактораВидаРабот(Форма, ТекущийОбъект = Неопределено) Экспорт
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Форма.Объект;
	КонецЕсли;
	
	Форма.ПрежняяПериодичность = МедицинскиеОсмотрыКлиентСервер.ОписаниеПериодичностиОсмотров();
	МедицинскиеОсмотрыКлиентСервер.ЗаполнитьОписаниеПериодичностиПоВредномуФакторуВидуРабот(Форма.ПрежняяПериодичность, ТекущийОбъект);
	
КонецПроцедуры

Функция ПериодичностьВредногоФактораВидаРаботИзменилась(НоваяПериодичность, ПрежняяПериодичность) Экспорт
	
	Возврат Не ОбщегоНазначения.КоллекцииИдентичны(НоваяПериодичность, ПрежняяПериодичность);
	
КонецФункции

#КонецОбласти

#КонецОбласти