#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ

Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПричиныОтсутствияСотрудников.Ссылка
	               |ИЗ
	               |	Справочник.ПричиныОтсутствияСотрудников КАК ПричиныОтсутствияСотрудников";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ПричинаОтсутствия = Справочники.ПричиныОтсутствияСотрудников.СоздатьЭлемент();
	ПричинаОтсутствия.Наименование = НСтр("ru = 'Болезнь'");
	ПричинаОтсутствия.Записать();
	
	ПричинаОтсутствия = Справочники.ПричиныОтсутствияСотрудников.СоздатьЭлемент();
	ПричинаОтсутствия.Наименование = НСтр("ru = 'Командировка'");
	ПричинаОтсутствия.Записать();
	
	ПричинаОтсутствия = Справочники.ПричиныОтсутствияСотрудников.СоздатьЭлемент();
	ПричинаОтсутствия.Наименование = НСтр("ru = 'Личные обстоятельства'");
	ПричинаОтсутствия.Записать();
	
	ПричинаОтсутствия = Справочники.ПричиныОтсутствияСотрудников.СоздатьЭлемент();
	ПричинаОтсутствия.Наименование = НСтр("ru = 'Отпуск'");
	ПричинаОтсутствия.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли