
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоПодразделенияФРМО() Тогда
		НастроитьКакПодразделенияФРМО();
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Владелец", ВладелецЭлементов) Тогда
		Если ТипЗнч(ВладелецЭлементов) = Тип("СправочникСсылка.КлассификаторыФедеральныхМедрегистров") И ЗначениеЗаполнено(ВладелецЭлементов) Тогда
			Заголовок = ВладелецЭлементов.ПолноеНаименование();
			АвтоЗаголовок = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецЭлементов) 
		И Не Справочники.КлассификаторыФедеральныхМедрегистров.КлассификаторИспользуетВыборГруппИЭлементов(ВладелецЭлементов) Тогда  
		Параметры.ВыборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Владелец", ВладелецЭлементов);
	ЗначенияЗаполнения.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.Форма.ФормаЭлемента", ПараметрыФормы, 
		ЭтотОбъект, ЭтотОбъект);
		
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтоПодразделенияФРМО()
	
	КодКлассификатора = Неопределено;
	Если Параметры.Отбор.Свойство("КодКлассификатора", КодКлассификатора) Тогда
		Описание = Медицина.ОписаниеКлассификатораПодразделений();
		Результат = КодКлассификатора = Описание.Код;
	Иначе
		Владелец = Неопределено;
		Параметры.Отбор.Свойство("Владелец", Владелец);
		Результат = Владелец = Медицина.ПолучитьКлассификаторПодразделений();
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьКакПодразделенияФРМО()
	
	Если Не Параметры.Отбор.Свойство("Владелец") Тогда
		Параметры.Отбор.Вставить("Владелец", Медицина.ПолучитьКлассификаторПодразделений(Истина));
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("КодКлассификатора") Тогда
		Параметры.Отбор.Удалить("КодКлассификатора");
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("Организация", Организация) Тогда
		ЗначенияДляЗаполнения = Новый Структура("Организация", "Организация");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	КонецЕсли;
	Справочники.КлассификаторыФедеральныхМедрегистров.УстановитьОтборПоOIDОрганизации(Список, Организация);
	
КонецПроцедуры

#КонецОбласти
