
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Параметры.СтруктураДанных;
	
	Если СтруктураДанных.Свойство("ТолькоПросмотрФормы") И СтруктураДанных.ТолькоПросмотрФормы Тогда
		Элементы.ЛицоБезДовЮЛ_НаимОрг.ТолькоПросмотр 	= Истина;
		Элементы.ЛицоБезДовЮЛ_ИНН.ТолькоПросмотр 		= Истина;
		Элементы.ЛицоБезДовЮЛ_КПП.ТолькоПросмотр 		= Истина;
		Элементы.ЛицоБезДовЮЛ_ОГРН.ТолькоПросмотр 		= Истина;
		Элементы.ФормаКнопкаСохранить.Доступность 		= Ложь;
	КонецЕсли;
	
	Если СтруктураДанных <> Неопределено Тогда
		ЛицоБезДовЮЛ_НаимОрг 	= СтруктураДанных.ЛицоБезДовЮЛ_НаимОрг;
		ЛицоБезДовЮЛ_ИНН 		= СтруктураДанных.ЛицоБезДовЮЛ_ИНН;
		ЛицоБезДовЮЛ_КПП 		= СтруктураДанных.ЛицоБезДовЮЛ_КПП;
		ЛицоБезДовЮЛ_ОГРН 		= СтруктураДанных.ЛицоБезДовЮЛ_ОГРН;
	КонецЕсли;
	
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если НЕ СохранениеВозможно() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ЛицоБезДовЮЛ_НаимОрг", 	ЛицоБезДовЮЛ_НаимОрг);
	СтруктураДанных.Вставить("ЛицоБезДовЮЛ_ИНН", 		ЛицоБезДовЮЛ_ИНН);
	СтруктураДанных.Вставить("ЛицоБезДовЮЛ_КПП", 		ЛицоБезДовЮЛ_КПП);
	СтруктураДанных.Вставить("ЛицоБезДовЮЛ_ОГРН", 		ЛицоБезДовЮЛ_ОГРН);
	
	Закрыть(СтруктураДанных);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СохранениеВозможно()
	
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(ЛицоБезДовЮЛ_НаимОрг) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задано наименование организации.'"),,
			"ЛицоБезДовЮЛ_НаимОрг",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЛицоБезДовЮЛ_ИНН) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан ИНН организации.'"),,
			"ЛицоБезДовЮЛ_ИНН",, Отказ);
	ИначеЕсли НЕ РегламентированнаяОтчетностьВызовСервера.ИННСоответствуетТребованиямНаСервере(ЛицоБезДовЮЛ_ИНН,
		Ложь) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ИНН организации.'"),,
			"ЛицоБезДовЮЛ_ИНН",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЛицоБезДовЮЛ_КПП) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не задан КПП организации.'"),,
			"ЛицоБезДовЮЛ_КПП",, Отказ);
	ИначеЕсли СтрДлина(ЛицоБезДовЮЛ_КПП) <> 9 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный КПП организации.'"),,
			"ЛицоБезДовЮЛ_КПП",, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛицоБезДовЮЛ_ОГРН) И СтрДлина(ЛицоБезДовЮЛ_ОГРН) <> 13 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан некорректный ОГРН организации.'"),,
			"ЛицоБезДовЮЛ_ОГРН",, Отказ);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере_85()
	
	ДокументооборотСКО.УбратьДвоеточияЗаголовков_85(ЭтотОбъект);
	ДокументооборотСКОКлиентСервер.УменьшитьВертикальныйИнтервал_85(ЭтотОбъект);
	Если ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85() Тогда
		ПерегруппироватьЭлементы_85();
		ОтключитьВидимостьЭлементов_85();
		ВключитьЗаголовкиЭлементовСверху_85();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерегруппироватьЭлементы_85()
	
	Элементы.ГруппаОбщая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьЭлементов_85()
	
	СтрокаИменЭлементов = "ДекорацияЛицоБезДовЮЛ_ИННКППРазделитель, ДекорацияРазделительОсновной";
	
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, " ", "");
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, Символы.ПС, "");

	СписокЭлементов = СтрРазделить(СтрокаИменЭлементов, ",");
	
	Для каждого Эл из СписокЭлементов Цикл
		Если НЕ Элементы.Найти(Эл) = Неопределено Тогда
			Элементы[Эл].Видимость= Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВключитьЗаголовкиЭлементовСверху_85()
	
	СтрокаИменЭлементов = "ЛицоБезДовЮЛ_НаимОрг, ЛицоБезДовЮЛ_ИНН, ЛицоБезДовЮЛ_КПП, ЛицоБезДовЮЛ_ОГРН";
	
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, " ", "");
	СтрокаИменЭлементов = СтрЗаменить(СтрокаИменЭлементов, Символы.ПС, "");
	
	СписокЭлементов = СтрРазделить(СтрокаИменЭлементов, ",");
	
	Для каждого Эл из СписокЭлементов Цикл
		Если НЕ Элементы.Найти(Эл) = Неопределено Тогда
			Элементы[Эл].ПоложениеЗаголовка= ПоложениеЗаголовкаЭлементаФормы.Верх;
		КонецЕсли;
	КонецЦикла;

	Элементы.ЛицоБезДовЮЛ_ИНН.АвтоМаксимальнаяШирина = Истина;
	Элементы.ЛицоБезДовЮЛ_ОГРН.АвтоМаксимальнаяШирина = Истина;
	
КонецПроцедуры

#КонецОбласти
