
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		СсылкаНаОбъект = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ПолучитьСсылку();
		ПриПолученииДанныхНаСервере(Параметры.ЗначениеКопирования);
		ПриИзмененииОсновныхДанных(Ложь);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	// Вместо вызова стандартного метода ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	Если ВерсионированиеОбъектов.ЕстьПравоЧтенияДанныхВерсийОбъектов() И ПолучитьФункциональнуюОпцию("ИспользоватьВерсионированиеОбъектов") Тогда
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("ТипВерсионируемогоОбъекта",
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.РабочиеМестаОхраныТруда"))));
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьУсловноеОформление(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ТрудоустройствоПоКвотам") Тогда
		МодульТрудоустройствоПоКвотамФормы = ОбщегоНазначения.ОбщийМодуль("ТрудоустройствоПоКвотамФормы");
		МодульТрудоустройствоПоКвотамФормы.РабочееМестоОхраныТрудаУстановитьОтображениеЭлементовФормы(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	СредстваИндивидуальнойЗащиты.ЗапуститьОбновлениеВыдачСИЗ(ТекущийОбъект.Владелец);
	
	Если Не МедицинскиеОсмотры.МедицинскиеОсмотрыИспользуются(ТекущийОбъект.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ЗапуститьОбновлениеПериодическихОсмотров(ТекущийОбъект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_УсловияТруда" И Источник = Объект.УсловияТруда Тогда
		УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	ИначеЕсли ИмяСобытия = "ОтредактированаИстория" И Параметр.ИмяРегистра = "КлассыУсловийТрудаПоДолжностям" Тогда
		Если КлассыУсловийТрудаПоДолжностямНаборЗаписейПрочитан Тогда
			РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
				ЭтотОбъект, СсылкаНаОбъект, ИмяСобытия, Параметр, Источник);
			ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(ЭтотОбъект);
			УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_РезультатыСпецоценкиУсловийТруда" Тогда
		ИнициализироватьРезультатыСпецоценки(СсылкаНаОбъект);
	ИначеЕсли ИмяСобытия = "Запись_ПрограммыОбученияСотрудниковПоОхранеТруда"
		И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "РабочиеМеста") <> Неопределено Тогда
		
		Параметр.Вставить("ПрограммаОбучения", Источник);
		ПрограммыОбучения = ОбучениеПоРабочимМестам.НайтиСтроки(Новый Структура("Обучение", Источник));
		Если ПрограммыОбучения.Количество() = 0 И Параметр.РабочиеМеста.Найти(СсылкаНаОбъект) = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'В программу обучения ""%1"" были внесены изменения. Обновить данные в рабочем месте?'"),
			Элементы.ОбучениеПоРабочимМестам.ТекущиеДанные.Обучение);
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаОповещенияПрограммыОбученияЗавершение", ЭтотОбъект, Параметр);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, , КодВозвратаДиалога.ОК);
	КонецЕсли;
	
	ТекстПодсказкиКПоляДатаРегистрации = УчетСтраховыхВзносовКлиентСервер.ТекстПодсказкиПоляДатаРегистрацииПериодическихРегистров();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, 
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений", 
		"Подсказка", 
		ТекстПодсказкиКПоляДатаРегистрации);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
		
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
	КонецЕсли;
	
	ТекущийОбъект.СоответствуетУсловиямТруда = СоответствуетУсловиямТруда;
	ТекущийОбъект.НормыСИЗСоответствуютДолжности = НормыСИЗСоответствуютДолжности;
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
		РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда", СсылкаНаОбъект);
	КонецЕсли;
	
	ОбучениеПоОхранеТрудаФормы.ЗаписатьИнструктажиРабочегоМестаОхраныТруда(ЭтотОбъект, СсылкаНаОбъект);
	ОбучениеПоОхранеТрудаФормы.ЗаписатьОбучениеРабочегоМестаОхраныТруда(ЭтотОбъект, СсылкаНаОбъект);
	
	Если Не МедицинскиеОсмотры.МедицинскиеОсмотрыИспользуются(ТекущийОбъект.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторыМедицинскихОсмотров", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВидыРаботМедицинскихОсмотров", "ВидРабот");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВредныеФакторыПсихиатрическихОсвидетельствований", "ВредныйФактор");
	ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ЭтотОбъект, "ВидыРаботПсихиатрическихОсвидетельствований", "ВидРабот");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	ЗаписатьВредныеФакторы(ЭтотОбъект, Отказ, ТекущийОбъект, "ВредныеФакторыИВидыРабот");
	ЗаписатьВредныеФакторы(ЭтотОбъект, Отказ, ТекущийОбъект, "ВредныеФакторы");
	ЗаписатьВидыРабот(ЭтотОбъект, Отказ, ТекущийОбъект);
	ЗаписатьНормыВыдачиСИЗ(ЭтотОбъект, Отказ, ТекущийОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект, Отказ);
	
	ПроверитьЗаполнениеВредныхФакторовВидовРабот(ЭтотОбъект, Отказ);
	СредстваИндивидуальнойЗащитыФормы.ОбработкаПроверкиЗаполненияОбъекта(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = Новый Структура("ВладелецФормы");
	ПараметрыОповещения.ВладелецФормы = ВладелецФормы;
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Объект.Номер) Тогда
		Объект.ПорядковыйНомер = Число(Объект.Номер);
	КонецЕсли;
	
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОрганизацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПриИзмененииОсновныхДанных();
	УстановитьНомерВручную(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	
	ПриИзмененииОсновныхДанных();
	УстановитьНомерВручную(ЭтотОбъект);
	ПроверитьНормыСИЗДолжности();

КонецПроцедуры

&НаКлиенте
Процедура УсловияТрудаПриИзменении(Элемент)
	
	Если СоответствуетУсловиямТруда = 1 Тогда
		// Заполняем по данным условий труда.
		ЗаполнитьРеквизитыУсловийТруда();
	Иначе
		ПредложитьЗаполнениеПоДаннымУсловийТруда();
		УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	КонецЕсли;
	
	УстановитьДоступностьТумблераСоответствия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерВручнуюПриИзменении(Элемент)
	
	ПриИзмененииОсновныхДанных();
	УстановитьОтображениеНомера(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеРабочееМестоПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямКлассУсловийТрудаПриИзменении(Элемент)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(
		ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
	УстановитьДатуРегистрацииУсловийТрудаПоПериоду();
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);
	КлассыУсловийТрудаКлиент.УстановитьФлагВредныхФакторовПоКлассу(
		КлассыУсловийТрудаПоДолжностям, ПредыдущийКлассУсловийТруда, Элементы);
	ПредыдущийКлассУсловийТруда = КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямПериодПриИзменении(Элемент)
	УстановитьДатуРегистрацииУсловийТрудаПоПериоду();
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой",
		Модифицированность);	
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтотОбъект,
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтотОбъект,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой",
		Направление,
		Модифицированность);

КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВыплачиваетсяНадбавкаЗаВредностьПриИзменении(Элемент)
	
	УстановитьОтображениеПроцентаНадбавкиЗаВредность(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНадбавкиЗаВредностьПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ПроцентНадбавкиЗаВредностьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейДополнительногоОтпускаВГодПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейФлажокПриИзменении(Элемент)
	
	Если НЕ ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией Тогда
		Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ПредопределенноеЗначение("Перечисление.ВидыРаботСДосрочнойПенсией.ПустаяСсылка");
	КонецЕсли;
	УстановитьОтображениеВзносов(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаКлиенте
Процедура ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеДосрочногоНазначенияПенсииПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияТрудаПФРПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура КодПозицииСпискаПФРПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
КонецПроцедуры

&НаКлиенте
Процедура СоответствуетУсловиямТрудаПриИзменении(Элемент)
	
	Если СоответствуетУсловиямТруда = 1 Тогда
		НачатьЗаполнениеПоДаннымУсловийТруда();
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьРеквизитовУсловийТруда(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НормыСИЗСоответствуютДолжностиПриИзменении(Элемент)
	
	Если НормыСИЗСоответствуютДолжности = 1 Тогда
		НачатьЗаполнениеНормСИЗПоДаннымДолжности();
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовНормСИЗПоДолжности(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактерВыполняемыхРаботПФРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.ХарактерВыполняемыхРаботПФР",
		Элемент.Заголовок);
		
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПФРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.ПервичныеДокументыПФР",
		Элемент.Заголовок);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыИВидыРаботМедицинскихОсмотров

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПередУдалением(Элемент, Отказ)
	ПроверитьВозможностьРедактированияВредногоФактораВидаРабот(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ВредныеФакторыИВидыРаботМедицинскихОсмотровОснование Тогда
		ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботМедицинскихОсмотров.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Основание);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПроверитьВозможностьРедактированияВредногоФактораВидаРабот(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыМедицинскихОсмотров

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторы", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторы", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыРаботМедицинскихОсмотров

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровВидРаботПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыРаботМедицинскихОсмотров.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВидРабот);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРаботМедицинскихОсмотровПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийВредныйФакторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ПериодичностьОсмотра = ПериодичностьОсмотраПоВредномуФактору(ТекущиеДанные.ВредныйФактор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПередУдалением(Элемент, Отказ)
	ПроверитьВозможностьРедактированияВредногоФактораВидаРабот(Элемент, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент = Элементы.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийОснование Тогда
		ТекущиеДанные = Элементы.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Основание) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Основание);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПроверитьВозможностьРедактированияВредногоФактораВидаРабот(Элемент, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствованийПослеУдаления(Элемент)
	ОбновитьПериодичностьОсмотровРабочихМест(СтрЗаменить(Элемент.Имя, "ВредныеФакторыИВидыРабот", ""));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНормыВыдачиСИЗ

&НаКлиенте
Процедура НормыВыдачиСИЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СредстваИндивидуальнойЗащитыФормыКлиент.НормыВыдачиСИЗВыбор(ЭтотОбъект, Элемент, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПериодичностьВыдачиСИЗРабочихМест();
	
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗПослеУдаления(Элемент)
	ОбновитьПериодичностьВыдачиСИЗРабочихМест();
КонецПроцедуры

&НаКлиенте
Процедура НормыВыдачиСИЗПометкаПриИзменении(Элемент)
	СредстваИндивидуальнойЗащитыФормыКлиент.НормыВыдачиСИЗПометкаПриИзменении(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнструктажиПоРабочимМестам

&НаКлиенте
Процедура ИнструктажиПоРабочимМестамИспользуетсяПриИзменении(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияИнструктажей(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбучениеПоРабочимМестам

&НаКлиенте
Процедура ОбучениеПоРабочимМестамОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ПрограммыОбучения = ВыбранноеЗначение;
	Иначе
		ПрограммыОбучения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	ДобавитьПодобранныеПрограммыОбучения(ПрограммыОбучения);
	УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеПоРабочимМестамПослеУдаления(Элемент)
	УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеПоРабочимМестамПередУдалением(Элемент, Отказ)
	
	ВыделенныеСтроки = Элементы.ОбучениеПоРабочимМестам.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонТекста = НСтр("ru = 'Нельзя удалить программу обучения ""%1"", так как она обязательна для всех рабочих мест.'");
	Для Каждого ВыделеннаяСтрока Из ОбучениеПоОхранеТрудаФормыКлиент.УпорядоченныеСтрокиКУдалению(ВыделенныеСтроки) Цикл
		ТекущиеДанные = ОбучениеПоРабочимМестам.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ТекущиеДанные.ИспользуетсяДляВсехРабочихМест Тогда
			ТекстСообщения = СтрШаблон(ШаблонТекста, ТекущиеДанные.Обучение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ТекстСообщения,,
				СтрШаблон("ОбучениеПоРабочимМестам[%1].Пояснение", Формат(ВыделеннаяСтрока, "ЧН=0; ЧГ=0;")), , Отказ);
			Продолжить;
		КонецЕсли;
		ОбучениеПоРабочимМестам.Удалить(ВыделеннаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеПоРабочимМестамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбучениеПоРабочимМестам.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПрограммуОбучения(ТекущиеДанные, Поле);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура КлассУсловийТрудаИстория(Команда)
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект, ЭтотОбъект, ИспользоватьСпециальнуюОценкуУсловийТруда);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУсловиямТруда(Команда)
	НачатьЗаполнениеПоДаннымУсловийТруда();
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВредныеФакторыВидыРаботМедицинские(Команда)
	
	ПараметрыФормы = Новый Структура("ИсключаяРабочееМесто, ВидОсмотра, ОтображатьВредныеФакторы");
	ПараметрыФормы.ИсключаяРабочееМесто = Параметры.Ключ;
	ПараметрыФормы.ВидОсмотра = ВидМедицинскийОсмотр;
	ПараметрыФормы.ОтображатьВредныеФакторы = Истина;
	
	ПараметрыОповещения = Новый Структура("ВидОсмотра, КопироватьВредныеФакторы");
	ПараметрыОповещения.КопироватьВредныеФакторы = Истина;
	ПараметрыОповещения.ВидОсмотра = ПараметрыФормы.ВидОсмотра;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.РабочиеМестаОхраныТруда.Форма.ВыборРабочегоМеста", ПараметрыФормы, ЭтотОбъект, , , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВредныеФакторыВидыРаботПсихиатрические(Команда)
	
	ПараметрыФормы = Новый Структура("ИсключаяРабочееМесто, ВидОсмотра");
	ПараметрыФормы.ИсключаяРабочееМесто = Параметры.Ключ;
	ПараметрыФормы.ВидОсмотра = ВидПсихиатрическоеОсвидетельствование;
	
	ПараметрыОповещения = Новый Структура("ВидОсмотра");
	ПараметрыОповещения.ВидОсмотра = ПараметрыФормы.ВидОсмотра;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.РабочиеМестаОхраныТруда.Форма.ВыборРабочегоМеста", ПараметрыФормы, ЭтотОбъект, , , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВсехРезультатовРабочегоМеста(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РабочееМесто", СсылкаНаОбъект);
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.ФормаСписка", ПараметрыОткрытияФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиРезультатыСпецоценки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", СсылкаНаОбъект);
	
	ОткрытьФорму("Документ.РезультатыСпецоценкиУсловийТруда.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#Область СредстваИндивидуальнойЗащиты

&НаКлиенте
Процедура СнятьФлажки(Команда)
	СредстваИндивидуальнойЗащитыФормыКлиент.НормыВыдачиСИЗСнятьФлажки(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	СредстваИндивидуальнойЗащитыФормыКлиент.НормыВыдачиСИЗУстановитьФлажки(ЭтотОбъект, Команда);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНормыВыдачи(Команда)
	
	ПараметрыФормы = Новый Структура("ИсключаяРабочееМесто, ОтображатьСИЗ");
	ПараметрыФормы.ИсключаяРабочееМесто = Параметры.Ключ;
	ПараметрыФормы.ОтображатьСИЗ = Истина;
	
	ПараметрыОповещения = Новый Структура("КопироватьНормыВыдачиСИЗ");
	ПараметрыОповещения.КопироватьНормыВыдачиСИЗ = Истина;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("Обработка.РабочиеМестаОхраныТруда.Форма.ВыборРабочегоМеста", ПараметрыФормы, ЭтотОбъект, , , , ОбработчикОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДолжности(Команда)
	НачатьЗаполнениеНормСИЗПоДаннымДолжности();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодборПрограммОбучения(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхПрограммОбучения());
	ПараметрыФормы.Вставить("Отбор", Новый Структура("КонтролироватьПроведение, ИспользоватьДляВсехРабочихМест", Истина, Ложь));
	
	ОткрытьФорму("Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаСписка",
		ПараметрыФормы, Элементы.ОбучениеПоРабочимМестам);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьНаименование()
	
	НомерОсновногоРабочегоМеста = "";
	
	Если ЗначениеЗаполнено(АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто) Тогда
		НомерОсновногоРабочегоМеста = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда.РабочееМесто, "Номер");
	КонецЕсли;
	
	Объект.Наименование = РабочиеМестаОхраныТруда.НаименованиеРабочегоМеста(
		Объект.Подразделение,
		Объект.Должность,
		Объект.Номер,
		НомерОсновногоРабочегоМеста);
	
	Заголовок = Объект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииНаСервере()
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Владелец));
	ИспользоватьСпециальнуюОценкуУсловийТруда = ОхранаТруда.СпециальнаяОценкаУсловийТрудаИспользуется(Объект.Владелец);
	УстановитьВидимостьРезультатовСпецоценки();
	УстановитьВидимостьДосрочнойПенсииВредностиВзносов();
	
КонецПроцедуры

#Область МедицинскиеОсмотры

&НаСервереБезКонтекста
Процедура ПроверитьЗаполнениеВредныхФакторовВидовРабот(Форма, Отказ)
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Форма.ВредныеФакторыИВидыРаботМедицинскихОсмотров Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВредныйФактор) Тогда
			ТекстСообщения = НСтр("ru = 'Вредный фактор не заполнен.'");
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("[%1].ВредныйФактор", Форма.ВредныеФакторыИВидыРаботМедицинскихОсмотров.Индекс(СтрокаТаблицы));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Форма.СсылкаНаОбъект, Поле, "ВредныеФакторыИВидыРаботМедицинскихОсмотров", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Форма.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ВредныйФактор) Тогда
			ТекстСообщения = НСтр("ru = 'Вредный фактор не заполнен.'");
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("[%1].ВредныйФактор", Форма.ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.Индекс(СтрокаТаблицы));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Форма.СсылкаНаОбъект, Поле, "ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьВредныеФакторы(Форма, СсылкаНаТекущийОбъект, ВидОсмотра, ВредныеФакторыИмяПоля, ОчиститьОснование = Ложь)
	
	Если СтрНайти(ВредныеФакторыИмяПоля, "ВредныеФакторыИВидыРабот") > 0 Тогда
		НаборЗаписей = РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыСведений.ВредныеФакторыРабочегоМеста.СоздатьНаборЗаписей();
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(СсылкаНаТекущийОбъект);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма[ВредныеФакторыИмяПоля]);
	
	Если ОчиститьОснование Тогда
		Для Каждого Запись Из Форма[ВредныеФакторыИмяПоля] Цикл
			Запись.Основание = Неопределено;
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьПериодичностьВредныхФакторов(Форма, ВредныеФакторыИмяПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодичностьВредныхФакторов(Форма, ВредныеФакторыИмяПоля)
	
	ВредныеФакторы = Форма[ВредныеФакторыИмяПоля];
	
	ВредныеФакторыМассив = ВредныеФакторы.Выгрузить().ВыгрузитьКолонку("ВредныйФактор");
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторыМассив);
	Для Каждого СтрокаКоллекции Из ВредныеФакторы Цикл
		СтрокаКоллекции["ПериодичностьОсмотра"] = ПериодичностьОсмотров[СтрокаКоллекции.ВредныйФактор];
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВредныеФакторы(Форма, Отказ, ТекущийОбъект, ИмяТаблицы)
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "МедицинскихОсмотров");
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
		СтрокаНабора["ВидОсмотра"] = Форма.ВидМедицинскийОсмотр;
	КонецЦикла;
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		НаборЗаписейОПО = Форма.РеквизитФормыВЗначение(ИмяТаблицы + "ПсихиатрическихОсвидетельствований");
		Для каждого СтрокаНабора Из НаборЗаписейОПО Цикл
			СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
			СтрокаНабора["ВидОсмотра"] = Форма.ВидПсихиатрическоеОсвидетельствование;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписейОПО, НаборЗаписей);
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Ложь;
	Иначе
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Перечисления.ВидыОбследований.МедицинскийОсмотр);
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьВидыРабот(Форма, СсылкаНаТекущийОбъект, ВидОсмотра, ВидыРаботИмяПоля)
	
	НаборЗаписей = РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РабочееМесто.Установить(СсылкаНаТекущийОбъект);
	НаборЗаписей.Отбор.ВидОсмотра.Установить(ВидОсмотра);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма[ВидыРаботИмяПоля]);
	
	ЗаполнитьПериодичностьВидовРабот(Форма, ВидыРаботИмяПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПериодичностьВидовРабот(Форма, ВидыРаботИмяПоля)
	
	ВидыРаботМассив = Форма[ВидыРаботИмяПоля].Выгрузить().ВыгрузитьКолонку("ВидРабот");
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВидыРаботМассив);
	Для Каждого СтрокаКоллекции Из Форма[ВидыРаботИмяПоля] Цикл
		СтрокаКоллекции["ПериодичностьОсмотра"] = ПериодичностьОсмотров[СтрокаКоллекции.ВидРабот];
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьВидыРабот(Форма, Отказ, ТекущийОбъект)
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение("ВидыРаботМедицинскихОсмотров");
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
		СтрокаНабора["ВидОсмотра"] = Форма.ВидМедицинскийОсмотр;
	КонецЦикла;
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		НаборЗаписейОПО = Форма.РеквизитФормыВЗначение("ВидыРаботПсихиатрическихОсвидетельствований");
		Для каждого СтрокаНабора Из НаборЗаписейОПО Цикл
			СтрокаНабора["РабочееМесто"] = ТекущийОбъект.Ссылка;
			СтрокаНабора["ВидОсмотра"] = Форма.ВидПсихиатрическоеОсвидетельствование;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(НаборЗаписейОПО, НаборЗаписей);
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Ложь;
	Иначе
		НаборЗаписей.Отбор.ВидОсмотра.Использование = Истина;
		НаборЗаписей.Отбор.ВидОсмотра.Установить(Перечисления.ВидыОбследований.МедицинскийОсмотр);
	КонецЕсли;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИзДругогоРабочегоМестаПослеВыбора(ДругоеРабочееМесто, ДополнительныеПараметры) Экспорт
	
	Если ДругоеРабочееМесто = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДругоеРабочееМесто", ДругоеРабочееМесто);
	
	Если ДополнительныеПараметры.Свойство("КопироватьВредныеФакторы") Тогда
		ЭтоМедицинскийОсмотр = ДополнительныеПараметры.ВидОсмотра = ВидМедицинскийОсмотр;
		ЭтоПсихиатрическоеОсвидетельствование = ДополнительныеПараметры.ВидОсмотра = ВидПсихиатрическоеОсвидетельствование;
		МедицинскиеПустые = ВредныеФакторыИВидыРаботМедицинскихОсмотров.Количество() = 0;
		ПсихиатрическиеПустые = ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований.Количество() = 0;
		
		Если ЭтоМедицинскийОсмотр И МедицинскиеПустые Или ЭтоПсихиатрическоеОсвидетельствование И ПсихиатрическиеПустые Тогда
			НачатьКопированиеИзДругогоРабочегоМеста(ДругоеРабочееМесто, ДополнительныеПараметры);
			Возврат;
		КонецЕсли;
		
		Если ЭтоМедицинскийОсмотр Тогда
			ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ для медицинских осмотров будут очищены перед копированием.
		                         |Продолжить?'");
		ИначеЕсли ЭтоПсихиатрическоеОсвидетельствование Тогда
			ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ для психиатрических освидетельствований будут очищены перед копированием.
		                         |Продолжить?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Списки вредных факторов и видов работ будут очищены перед копированием.
		                         |Продолжить?'");
		КонецЕсли;
	ИначеЕсли ДополнительныеПараметры.Свойство("КопироватьНормыВыдачиСИЗ") Тогда
		Если НормыВыдачиСИЗ.Количество() = 0 Тогда
			НачатьКопированиеИзДругогоРабочегоМеста(ДругоеРабочееМесто, ДополнительныеПараметры);
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru = 'Нормы выдачи СИЗ будут очищены перед копированием.
			|Продолжить?'");
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругогоРабочегоМестаПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьИзДругогоРабочегоМестаПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	НачатьКопированиеИзДругогоРабочегоМеста(ДополнительныеПараметры.ДругоеРабочееМесто, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьКопированиеИзДругогоРабочегоМеста(ДругоеРабочееМесто, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.Свойство("КопироватьВредныеФакторы") Тогда
		СкопироватьВредныеФакторыВидыРаботНаСервере(ДругоеРабочееМесто, ДополнительныеПараметры.ВидОсмотра);
	ИначеЕсли ДополнительныеПараметры.Свойство("КопироватьНормыВыдачиСИЗ") Тогда
		СкопироватьСИЗНаСервере(ДругоеРабочееМесто);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодичностьОсмотраПоВредномуФактору(ВредныйФактор)
	
	ВредныеФакторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВредныйФактор);
	ПериодичностьОсмотров = МедицинскиеОсмотры.ПериодичностьОсмотровПоВреднымФакторам(ВредныеФакторы);
	Возврат ПериодичностьОсмотров[ВредныйФактор];
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьГруппеСписковСтарыхВредныхФакторов(Форма)

    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, 
		"ВредныеФакторыВидыРаботМедицинскихОсмотровГруппа",
		"Видимость",
		Форма.ВредныеФакторыМедицинскихОсмотров.Количество() > 0 Или Форма.ВидыРаботМедицинскихОсмотров.Количество() > 0);

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьРедактированияВредногоФактораВидаРабот(Элемент, Отказ)
	
	Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыделеннаяСтрока);
		Если Не ЗначениеЗаполнено(ДанныеСтроки.Основание) Тогда
			Продолжить;
		КонецЕсли;
		Отказ = Истина;
		ДополнительныеПараметры = Новый Структура("Основание", ДанныеСтроки.Основание);
		ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьВозможностьРедактированияВредногоФактораВидаРаботЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстВопроса = НСтр("ru = 'Добавленный документом вредный фактор недоступен для редактирования в рабочем месте.
			|Открыть результат спецоценки для редактирования?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Прервать;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьРедактированияВредногоФактораВидаРаботЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПоказатьЗначение(, ДополнительныеПараметры.Основание);
	КонецЕсли;
	
КонецПроцедуры
 
#КонецОбласти

&НаСервере
Процедура ПриИзмененииОсновныхДанных(ЗаполнятьНаименование = Истина)
	
	ЗаполнитьНомер();
	СформироватьАвтоматическийНомер();
	Если ЗаполнятьНаименование Тогда
		ЗаполнитьНаименование();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНомер()
	
	Если Объект.НомерВручную Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПорядковыйНомер)
		И Не Константы.КонтролироватьУникальностьНомеровРабочихМест.Получить() = Истина Тогда
			
		Возврат;
	КонецЕсли;
	
	Если Не Справочники.РабочиеМестаОхраныТруда.НомерРабочегоМестаЗанят(Объект, СсылкаНаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПорядковыйНомер = 1 + Справочники.РабочиеМестаОхраныТруда.МаксимальныйНомерРабочегоМеста(Объект.Владелец, Объект.Подразделение);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьАналогичностьРабочегоМеста()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "АналогичныеРабочиеМестаСпециальнойОценкиУсловийТруда", СсылкаНаОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКлассыУсловийТрудаПоДолжностям()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям", СсылкаНаОбъект);
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(ЭтотОбъект);
	ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(ЭтотОбъект);
	ПредыдущийКлассУсловийТруда = КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеКлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений(Форма)
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма,
		"КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений",
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
	
	Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.АвтоОтметкаНезаполненного =
		Форма.Элементы.КлассыУсловийТрудаПоДолжностямПериод.АвтоОтметкаНезаполненного;
	
	Если Не Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.АвтоОтметкаНезаполненного
		И Не ЗначениеЗаполнено(Форма.КлассыУсловийТрудаПоДолжностям.Период) Тогда
		
		Форма.Элементы.КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПолеКлассыУсловийТрудаПоДолжностямПериод(Форма)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, "КлассыУсловийТрудаПоДолжностям", Форма.СсылкаНаОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	ИспользоватьСпециальнуюОценкуУсловийТруда = Форма.ИспользоватьСпециальнуюОценкуУсловийТруда;
		
	УсловияТрудаТолькоПросмотр =
		ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, "УсловияТруда", "ТолькоПросмотр");
	
	ЗапрещатьРедактирование = ИспользоватьСпециальнуюОценкуУсловийТруда Или УсловияТрудаТолькоПросмотр;
	
	БлокироватьВыявленныеФакторы = КлассыУсловийТрудаКлиентСервер.КлассыУсловийТрудаДляБлокировкиФлагаВредныхФакторов().Найти(
		Форма.КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда) <> Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямПериод",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямКлассУсловийТруда",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзменений",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КлассыУсловийТрудаПоДолжностямВыявленыВредныеОпасныеФакторы",
		"ТолькоПросмотр",
		ЗапрещатьРедактирование Или БлокироватьВыявленныеФакторы);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НомерВручную",
		"Доступность",
		Форма.РабочееМестоДоступноДляРедактирования);
	
	УстановитьДоступностьРеквизитовУсловийТруда(Форма);
	УстановитьДоступностьТумблераСоответствия(Форма);
	УстановитьДоступностьЭлементовНормСИЗПоДолжности(Форма);
	УстановитьДоступностьТумблераСоответствияСИЗ(Форма);
	УстановитьОтображениеНомера(Форма);
	УстановитьОтображениеВзносов(Форма);
	УстановитьОтображениеПроцентаНадбавкиЗаВредность(Форма);
	
КонецПроцедуры	

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	
	ПриИзмененииОрганизацииНаСервере();
	
	ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗначениеЗаполнено(Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	СоответствуетУсловиямТруда = ТекущийОбъект.СоответствуетУсловиямТруда;
	НормыСИЗСоответствуютДолжности = ТекущийОбъект.НормыСИЗСоответствуютДолжности;
	РабочееМестоДоступноДляРедактирования = ПравоДоступа("Редактирование", Метаданные.Справочники.РабочиеМестаОхраныТруда);
	НормыСИЗДоступныДляЧтения = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СИЗРабочегоМеста);
	
	ИнициализироватьМедицинскиеОсмотры();
	ИнициализироватьРезультатыСпецоценки(ТекущийОбъект);
	ИнициализироватьСредстваИндивидуальнойЗащиты(ТекущийОбъект);
	ИнициализироватьСпециальныеРабочиеМестаИнвалидов(ТекущийОбъект);
	ИнициализироватьИнструктажи(ТекущийОбъект);
	ИнициализироватьОбучениеПоОхранеТруда(ТекущийОбъект);
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	УстановитьПредупреждениеОРазличияхНормВыдачиСИЗСДолжностью();
	
КонецПроцедуры

#Область МедицинскиеОсмотры

&НаСервере
Процедура ИнициализироватьМедицинскиеОсмотры()
	
	ИспользоватьПсихиатрическиеОсвидетельствования = 
		ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования", Новый Структура("Организация", Объект.Владелец));
	
	ВидМедицинскийОсмотр = Перечисления.ВидыОбследований.МедицинскийОсмотр;
	ВидПсихиатрическоеОсвидетельствование = Перечисления.ВидыОбследований.ПсихиатрическоеОсвидетельствование;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьМедицинскихОсмотровРабочихМест) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СтраницыВредныеФакторыВидыРабот", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаМедицинскиеОсмотры", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВредныеФакторыИВидыРаботРабочегоМеста) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВредныеФакторыИВидыРаботМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВредныеФакторыРабочегоМеста) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВредныеФакторыМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВредныеФакторыПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ВидыРаботМедицинскихОсмотров", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СкопироватьВредныеФакторыВидыРаботМедицинские", "Доступность", Ложь);
		Если ИспользоватьПсихиатрическиеОсвидетельствования Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "ВидыРаботПсихиатрическихОсвидетельствований", "ТолькоПросмотр", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы, "СкопироватьВредныеФакторыВидыРаботПсихиатрические", "Доступность", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ГруппаМедицинскиеОсмотры = Элементы.ГруппаМедицинскиеОсмотры;
	
	СворачиватьМедосмотры = ПолучитьФункциональнуюОпцию("ПрименятьРезультатыСпециальнойОценкиУсловийТрудаРасширенная")
					 Или ПолучитьФункциональнуюОпцию("ИспользоватьНадбавкуЗаВредность")
					 Или ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией");
		
	Если Не СворачиватьМедосмотры Тогда
		ГруппаМедицинскиеОсмотры.Показать();
	КонецЕсли;
	
	Если Не ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		Элементы.Переместить(Элементы.ГруппаОсмотрыПоПриказу29Н, ГруппаМедицинскиеОсмотры);
	Иначе
		Если Не Элементы.ГруппаОсмотрыПоПриказу29Н.Родитель = Элементы.СтраницаОсмотрыПоПриказу29Н Тогда
			Элементы.Переместить(Элементы.ГруппаОсмотрыПоПриказу29Н, Элементы.СтраницаОсмотрыПоПриказу29Н);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьВредныеФакторыВидыРабот(ТекущийОбъект, ВидОсмотра = Неопределено, ЭтоКопирование = Ложь)
	
	Если Не ВидОсмотра = ВидПсихиатрическоеОсвидетельствование Тогда
		ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр,
			"ВредныеФакторыИВидыРаботМедицинскихОсмотров", ЭтоКопирование);
		Если ЭтоКопирование Тогда
		    ВредныеФакторыМедицинскихОсмотров.Очистить();
			ВидыРаботМедицинскихОсмотров.Очистить();		
		Иначе
			ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр, "ВредныеФакторыМедицинскихОсмотров");
			ПрочитатьВидыРабот(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидМедицинскийОсмотр, "ВидыРаботМедицинскихОсмотров");
		КонецЕсли; 
		ОбновитьПериодичностьОсмотровРабочихМест("МедицинскихОсмотров");
		УстановитьВидимостьГруппеСписковСтарыхВредныхФакторов(ЭтотОбъект);
	КонецЕсли;
	
	Если Не ВидОсмотра = ВидМедицинскийОсмотр Тогда
		ПрочитатьВредныеФакторы(ЭтотОбъект, ТекущийОбъект.Ссылка, ВидПсихиатрическоеОсвидетельствование,
			"ВредныеФакторыИВидыРаботПсихиатрическихОсвидетельствований", ЭтоКопирование);
		ОбновитьПериодичностьОсмотровРабочихМест("ПсихиатрическихОсвидетельствований");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодичностьОсмотровРабочихМест(ИмяВидОсмотра, УчитыватьСтарыеФакторы = Истина)
	
	ВредныеФакторыРаботыМассив = Новый Массив;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
		ЭтотОбъект["ВредныеФакторыИВидыРабот" + ИмяВидОсмотра], "ВредныйФактор", Истина), Истина);
	
	Если УчитыватьСтарыеФакторы Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
			ЭтотОбъект["ВредныеФакторы" + ИмяВидОсмотра], "ВредныйФактор", Истина), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВредныеФакторыРаботыМассив, ОбщегоНазначения.ВыгрузитьКолонку(
			ЭтотОбъект["ВидыРабот" + ИмяВидОсмотра], "ВидРабот", Истина), Истина);
	КонецЕсли;
	
	ПериодичностьИмяВидОсмотра = "Периодичность" + ИмяВидОсмотра;
	
	ОписаниеПериодичности = МедицинскиеОсмотры.МинимальнаяПериодичностьОсмотров(ВредныеФакторыРаботыМассив);
	
	ЭтотОбъект[ПериодичностьИмяВидОсмотра] = ОписаниеПериодичности.Представление;
	
	Если ПустаяСтрока(ЭтотОбъект[ПериодичностьИмяВидОсмотра]) Тогда
		ЭтотОбъект[ПериодичностьИмяВидОсмотра] = НСтр("ru = '< Не проводятся >'");
	КонецЕсли;
	
	УстановитьЗаголовокСвернутогоОтображенияМедосмотров(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРезультатыСпецоценки(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	ПрочитатьВредныеФакторыВидыРабот(ТекущийОбъект);
	УстановитьЗаголовокРезультатовСпецоценки();
	ПрочитатьКлассыУсловийТрудаПоДолжностям();
	ПрочитатьАналогичностьРабочегоМеста();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСпециальныеРабочиеМестаИнвалидов(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ТрудоустройствоПоКвотам") Тогда
		МодульТрудоустройствоПоКвотамФормы = ОбщегоНазначения.ОбщийМодуль("ТрудоустройствоПоКвотамФормы");
		МодульТрудоустройствоПоКвотамФормы.ДополнитьФормуРабочегоМеста(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокРезультатовСпецоценки()
	
	УстановитьВидимостьРезультатовСпецоценки();
	
	Если Не ИспользоватьСпециальнуюОценкуУсловийТруда Тогда
		Возврат;
	КонецЕсли;
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка КАК Документ,
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка.ДатаРезультатов КАК Дата
		|ПОМЕСТИТЬ ВТ_РезультатыСпецоценки
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РезультатыСпецоценкиУсловийТрудаРабочиеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаРабочиеМеста.РабочееМесто = &РабочееМесто
		|	И РезультатыСпецоценкиУсловийТрудаРабочиеМеста.Ссылка.Проведен
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка,
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.ДатаРезультатов
		|ИЗ
		|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК РезультатыСпецоценкиУсловийТрудаАналогичныеМеста
		|ГДЕ
		|	РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.АналогичноеМесто = &РабочееМесто
		|	И РезультатыСпецоценкиУсловийТрудаАналогичныеМеста.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_РезультатыСпецоценки.Документ КАК Документ,
		|	ВТ_РезультатыСпецоценки.Дата КАК Дата
		|ИЗ
		|	ВТ_РезультатыСпецоценки КАК ВТ_РезультатыСпецоценки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
	
	// АПК:96 -вкл
		
	Запрос.УстановитьПараметр("РабочееМесто", СсылкаНаОбъект);
	
	ЕстьРезультатыСпецоценки = Не Запрос.Выполнить().Пустой();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьСписокВсехРезультатовСпецоценкиРабочегоМеста",
		"Видимость",
		ЕстьРезультатыСпецоценки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВвестиРезультатыСпецоценки",
		"Видимость",
		Не ЕстьРезультатыСпецоценки);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРезультатовСпецоценки()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВредныеФакторыПоРезультатамСпецоценки", "Видимость",
		МедицинскиеОсмотры.МедицинскиеОсмотрыИспользуются(Объект.Владелец) И ИспользоватьСпециальнуюОценкуУсловийТруда);
		
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДосрочнойПенсииВредностиВзносов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ДосрочнаяПенсияВредностьВзносы",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ПрименятьУсловияТрудаРабочихМестОхраныТруда",
			Новый Структура("Организация", Объект.Владелец)));
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура УстановитьДатуРегистрацииУсловийТрудаПоПериоду()
	
	КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений = НачалоМесяца(КлассыУсловийТрудаПоДолжностям.Период);	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "КлассыУсловийТрудаПоДолжностям.ДатаРегистрацииИзменений", "КлассыУсловийТрудаПоДолжностямДатаРегистрацииИзмененийСтрокой");
	
КонецПроцедуры	

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНомерВручную(Форма)
	
	Объект = Форма.Объект;
	
	Если ПустаяСтрока(Объект.Номер) Тогда
		Объект.НомерВручную = Истина;
		УстановитьОтображениеНомера(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьАвтоматическийНомер()
	
	Если Объект.НомерВручную Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Номер = СтрЗаменить(Строка(Объект.ПорядковыйНомер), Символы.НПП, "");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеПроцентаНадбавкиЗаВредность(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПроцентНадбавкиЗаВредность",
		"Доступность",
		Форма.Объект.ВыплачиваетсяНадбавкаЗаВредность);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеВзносов(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсиейФлажок",
		"Доступность",
		Форма.РабочееМестоДоступноДляРедактирования);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией",
		"Доступность",
		Форма.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеНомера(Форма)
	
	Объект = Форма.Объект;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"ТолькоПросмотр",
		Не Объект.НомерВручную);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"АвтоОтметкаНезаполненного",
		Объект.НомерВручную);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Номер",
		"ОтметкаНезаполненного",
		Объект.НомерВручную И ЗначениеЗаполнено(Объект.Номер));
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаполнениеПоДаннымУсловийТруда()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение по данным условий труда'");
	
	ТекстВопроса = НСтр("ru = 'Данные о досрочной пенсии, надбавке за вредность и страховых взносах - можно заменить аналогичными сведениями из условий труда.
						|Заменить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоДаннымУсловийТруда", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеПоДаннымУсловийТруда()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение по данным условий труда'");
	
	ТекстВопроса = НСтр("ru = 'Данные о досрочной пенсии, надбавке за вредность и страховых взносах - будут заменены аналогичными сведениями из условий труда.
						|Продолжить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеПоДаннымУсловийТруда", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеПоДаннымУсловийТруда(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// Пользователь отказался от замены реквизитов из условий труда.
		СоответствуетУсловиямТруда = 0;
		УстановитьДоступностьРеквизитовУсловийТруда(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыУсловийТруда();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьТумблераСоответствия(Форма)
	
	ТумблерДоступен = Форма.РабочееМестоДоступноДляРедактирования И ЗначениеЗаполнено(Форма.Объект.УсловияТруда);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СоответствуетУсловиямТруда",
		"Доступность",
		ТумблерДоступен);
	
	Если Не ТумблерДоступен Тогда 
		Форма.СоответствуетУсловиямТруда = 0;
		УстановитьДоступностьРеквизитовУсловийТруда(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовУсловийТруда(Форма)
	
	ДоступностьСведений = Форма.СоответствуетУсловиямТруда = 0;
	
	Форма.Элементы.ВредностьГруппа.ТолькоПросмотр = Не ДоступностьСведений;
	Форма.Элементы.ДосрочнаяПенсияГруппа.ТолькоПросмотр = Не ДоступностьСведений;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображенияСтраховыхВзносов(Форма)
	
	ЗаголовокСвернутогоОтображения = "";
	
	КлассУсловийТруда = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, "КлассыУсловийТрудаПоДолжностям.КлассУсловийТруда");
	Период = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, "КлассыУсловийТрудаПоДолжностям.Период");
		
	Если ЗначениеЗаполнено(КлассУсловийТруда) Тогда
		ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = '%1 установлен с %2'"),
			Строка(КлассУсловийТруда), Формат(Период, "ДЛФ=DD"));
	КонецЕсли; 

	Форма.Элементы.ГруппаОсобенностиИсчисленияСтраховыхВзносов.ЗаголовокСвернутогоОтображения =
		?(ПустаяСтрока(ЗаголовокСвернутогоОтображения),
		  Форма.Элементы.ГруппаОсобенностиИсчисленияСтраховыхВзносов.Заголовок,
		  ЗаголовокСвернутогоОтображения);

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности()
	
	ЗаголовокСвернутогоОтображения = РабочиеМестаОхраныТруда.ЗаголовокНаОснованииНабораДанных(
		РабочиеМестаОхраныТруда.ЗначенияВзносовВредностиПФР(Объект));
	
	Элементы.ДосрочнаяПенсияВредностьВзносы.ЗаголовокСвернутогоОтображения =
		?(ПустаяСтрока(ЗаголовокСвернутогоОтображения),
		  Элементы.ДосрочнаяПенсияВредностьВзносы.Заголовок,
		  ЗаголовокСвернутогоОтображения);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображенияМедосмотров(Форма)
	
	ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = 'Осмотры по приказу № 29н: %1'"), Форма.ПериодичностьМедицинскихОсмотров);
	
	Если Форма.ИспользоватьПсихиатрическиеОсвидетельствования Тогда
		ЗаголовокСвернутогоОтображения = СтрШаблон(НСтр("ru = '%1
														|Психиатрические осмотры: %2'"),
		ЗаголовокСвернутогоОтображения, Форма.ПериодичностьПсихиатрическихОсвидетельствований);
	КонецЕсли;

	Форма.Элементы.ГруппаМедицинскиеОсмотры.ЗаголовокСвернутогоОтображения = ЗаголовокСвернутогоОтображения;

КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждениеОРазличияхСУсловиямиТруда()
	
	Элементы.РазличияСУсловиямиТрудаГруппа.Видимость = Ложь;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНадбавкуЗаВредность")
		И Не ПолучитьФункциональнуюОпцию("ИспользуютсяРаботыСДосрочнойПенсией") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.УсловияТруда) Тогда
		Возврат;
	КонецЕсли;
	
	УсловияТруда = РабочиеМестаОхраныТруда.ЗначенияВзносовВредностиПФР(Объект.УсловияТруда);
	
	Если Не Справочники.РабочиеМестаОхраныТруда.РеквизитыРабочегоМестаСоответствуютУсловиямТруда(Объект, УсловияТруда) Тогда
		Элементы.РазличияСУсловиямиТрудаГруппа.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыУсловийТруда()

	Если Не ЗначениеЗаполнено(Объект.УсловияТруда) Тогда
		Возврат;
	КонецЕсли;
	
	РабочееМестоОбъект = РеквизитФормыВЗначение("Объект");
	РабочееМестоОбъект.ЗаполнитьПоУсловиямТруда(Объект.УсловияТруда);
	ЗначениеВРеквизитФормы(РабочееМестоОбъект, "Объект");
	
	ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией = ЗначениеЗаполнено(Объект.ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией);
	СоответствуетУсловиямТруда = Объект.СоответствуетУсловиямТруда;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьПредупреждениеОРазличияхСУсловиямиТруда();
	УстановитьЗаголовокСвернутогоОтображенияДосрочнойПенсииВредности();
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьВредныеФакторыВидыРаботНаСервере(ДругоеРабочееМесто, ВидОсмотра)
	ПрочитатьВредныеФакторыВидыРабот(ДругоеРабочееМесто, ВидОсмотра, Истина);
	Модифицированность = Истина;
КонецПроцедуры

#Область СредстваИндивидуальнойЗащиты

&НаСервере
Процедура ИнициализироватьСредстваИндивидуальнойЗащиты(ТекущийОбъект)
	СредстваИндивидуальнойЗащитыФормы.ПрочитатьДополнительныеДанныеОбъекта(ЭтотОбъект, ТекущийОбъект.Ссылка, Истина);
КонецПроцедуры

&НаСервере
Процедура ОбновитьПериодичностьВыдачиСИЗРабочихМест()
	СредстваИндивидуальнойЗащитыФормы.ОбновитьПериодичностьВыдачиСИЗОбъекта(ЭтотОбъект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьСИЗПослеЗакрытия(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСИЗПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСИЗПослеЗакрытияНаСервере(РезультатЗакрытия, ДополнительныеПараметры)
	СредстваИндивидуальнойЗащитыФормы.УстановитьСИЗПослеЗакрытияНаСервере(ЭтотОбъект, РезультатЗакрытия, ДополнительныеПараметры, Истина);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьНормыВыдачиСИЗ(Форма, Отказ, ТекущийОбъект)
	СредстваИндивидуальнойЗащитыФормы.ЗаписатьДополнительныеДанныеОбъекта(Форма, ТекущийОбъект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(Форма)
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	// СИЗ
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗТипНоменклатуры.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗКомандаСИЗ.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "НормыВыдачиСИЗ.Пометка", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗКомандаСИЗ.Имя);
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "НормыВыдачиСИЗ.Пометка", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "НормыВыдачиСИЗ.КомандаСИЗ", НСтр("ru = '< Не установлены >'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	// Инструктажи
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнструктажиПоРабочимМестамИспользуется");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "ИнструктажиПоРабочимМестам.ИспользуетсяДляВсехРабочихМест", Истина);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Обучение
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ОбучениеПоРабочимМестамПояснение");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "ОбучениеПоРабочимМестам.ИспользуетсяДляВсехРабочихМест", Истина);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", НСтр("ru = '< обязательна для всех рабочих мест >'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНормыСИЗДолжности()
	
	Если Не ПолучитьФункциональнуюОпциюФормы("ИспользоватьСредстваИндивидуальнойЗащиты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НормыСИЗДоступныДляЧтения Тогда
		Возврат;
	КонецЕсли;
	
	Если НормыСИЗСоответствуютДолжности = 1 Тогда
		ЗаполнитьНормыСИЗПоДолжности();
	Иначе
		ПредложитьЗаполнениеНормСИЗПоДаннымДолжности();
		УстановитьПредупреждениеОРазличияхНормВыдачиСИЗСДолжностью();
	КонецЕсли;
	
	УстановитьДоступностьТумблераСоответствияСИЗ(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНормыСИЗПоДолжности()

	Если Не ЗначениеЗаполнено(Объект.Должность) Тогда
		Возврат;
	КонецЕсли;
	
	СредстваИндивидуальнойЗащитыФормы.ПрочитатьДополнительныеДанныеОбъекта(ЭтотОбъект, Объект.Должность, Истина);
	
	НормыСИЗСоответствуютДолжности = Истина;
	
	УстановитьДоступностьЭлементовНормСИЗПоДолжности(ЭтотОбъект);
	УстановитьПредупреждениеОРазличияхНормВыдачиСИЗСДолжностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредложитьЗаполнениеНормСИЗПоДаннымДолжности()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение норм выдачи по данным должности'");
	
	ТекстВопроса = НСтр("ru = 'Нормы выдачи средств индивидуальной защиты можно заменить аналогичными сведениями из должности.
						|Заменить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеНормСИЗПоДаннымДолжности", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗаполнениеНормСИЗПоДаннымДолжности()
	
	ЗаголовокВопроса = НСтр("ru = 'Заполнение норм выдачи по данным должности'");
	
	ТекстВопроса = НСтр("ru = 'Нормы выдачи средств индивидуальной защиты будут заменены аналогичными сведениями из должности.
						|Продолжить?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗаполнениеНормСИЗПоДаннымДолжности", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьЗаполнениеНормСИЗПоДаннымДолжности(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		// Пользователь отказался от замены реквизитов из должности.
		НормыСИЗСоответствуютДолжности = 0;
		УстановитьДоступностьЭлементовНормСИЗПоДолжности(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНормыСИЗПоДолжности();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовНормСИЗПоДолжности(Форма)
	
	ДоступностьСведений = Форма.НормыСИЗСоответствуютДолжности = 0 И Форма.РабочееМестоДоступноДляРедактирования;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "НормыВыдачиСИЗ", "ТолькоПросмотр", Не ДоступностьСведений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СкопироватьНормыВыдачи", "Доступность", ДоступностьСведений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "УстановитьФлажки", "Доступность", ДоступностьСведений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СнятьФлажки", "Доступность", ДоступностьСведений);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждениеОРазличияхНормВыдачиСИЗСДолжностью()
	
	Элементы.РазличияСДолжностьюГруппа.Видимость = Ложь;
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются(Объект.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НормыСИЗДоступныДляЧтения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Должность) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СредстваИндивидуальнойЗащиты.НормыВыдачиСИЗРабочегоМестаСоответствуютДолжности(
		НормыВыдачиСИЗНаборЗаписей.Выгрузить(), Объект.Должность) Тогда
		
		Элементы.РазличияСДолжностьюГруппа.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьТумблераСоответствияСИЗ(Форма)
	
	ТумблерДоступен = Форма.РабочееМестоДоступноДляРедактирования И ЗначениеЗаполнено(Форма.Объект.Должность);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НормыСИЗСоответствуютДолжности",
		"Доступность",
		ТумблерДоступен);
	
	Если Не ТумблерДоступен Тогда 
		Форма.НормыСИЗСоответствуютДолжности = 0;
		УстановитьДоступностьЭлементовНормСИЗПоДолжности(Форма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьСИЗНаСервере(ДругоеРабочееМесто)
	
	СредстваИндивидуальнойЗащитыФормы.ПрочитатьСИЗ(ЭтотОбъект, ДругоеРабочееМесто);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Инструктажи

&НаСервере
Процедура ИнициализироватьИнструктажи(ТекущийОбъект)
	
	ОбучениеПоОхранеТрудаФормы.ПрочитатьИнструктажиРабочегоМестаОхраныТруда(ЭтотОбъект, ТекущийОбъект.Ссылка);
	УстановитьЗаголовокСвернутогоОтображенияИнструктажей(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображенияИнструктажей(Форма)
	
	ИспользуемыеИнструктажи = Форма.ИнструктажиПоРабочимМестам.НайтиСтроки(Новый Структура("Используется", Истина));
	КоличествоИспользуемыхИнструктажей = ИспользуемыеИнструктажи.Количество();
	
	Если КоличествоИспользуемыхИнструктажей = 0 Тогда
		ТекстИнструктажей = НСтр("ru = '< Не проводятся >'");
	ИначеЕсли КоличествоИспользуемыхИнструктажей = 1 Тогда
		ТекстИнструктажей = СтрШаблон(НСтр("ru = '%1'"), НРег(ИспользуемыеИнструктажи[0].Инструктаж));
	ИначеЕсли КоличествоИспользуемыхИнструктажей = 2 Тогда
		ТекстИнструктажей = СтрШаблон(НСтр("ru = '%1 и %2'"),
			НРег(ИспользуемыеИнструктажи[0].Инструктаж), НРег(ИспользуемыеИнструктажи[1].Инструктаж));
	Иначе
		ТекстЕщеИнструктажей = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 инструктаж;;%1 инструктажа;%1 инструктажей;%1 инструктажа'"), КоличествоИспользуемыхИнструктажей - 2);
		ТекстИнструктажей = СтрШаблон(НСтр("ru = '%1, %2 и еще %3'"),
			НРег(ИспользуемыеИнструктажи[0].Инструктаж), НРег(ИспользуемыеИнструктажи[1].Инструктаж), ТекстЕщеИнструктажей);
	КонецЕсли;
	
	Форма.Элементы.ГруппаИнструктажиПоОхранеТруда.ЗаголовокСвернутогоОтображения =
		СтрШаблон(НСтр("ru = '%1: %2'"), Форма.Элементы.ГруппаИнструктажиПоОхранеТруда.Заголовок, ТекстИнструктажей);

КонецПроцедуры

#КонецОбласти

#Область ОбучениеПоОхранеТруда

&НаСервере
Процедура ИнициализироватьОбучениеПоОхранеТруда(ТекущийОбъект)
	
	ОбучениеПоОхранеТрудаФормы.ПрочитатьОбучениеРабочегоМестаОхраныТруда(ЭтотОбъект, ТекущийОбъект.Ссылка);
	УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(Форма)
	
	КоличествоИспользуемогоОбучения = Форма.ОбучениеПоРабочимМестам.Количество();
	
	Если КоличествоИспользуемогоОбучения = 0 Тогда
		ТекстОбучения = НСтр("ru = '< Не проводятся >'");
	Иначе
		ТекстОбучения = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 программа;;%1 программы;%1 программ;%1 программы'"),
			КоличествоИспользуемогоОбучения);
	КонецЕсли;
	
	Форма.Элементы.ГруппаОбучениеПоОхранеТруда.ЗаголовокСвернутогоОтображения =
		СтрШаблон(НСтр("ru = '%1: %2'"), Форма.Элементы.ГруппаОбучениеПоОхранеТруда.Заголовок, ТекстОбучения);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрограммуОбучения(ТекущиеДанные, Поле)
	
	Если Поле <> Элементы.ОбучениеПоРабочимМестамОбучение Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ");
	ПараметрыФормы.Ключ = ТекущиеДанные.Обучение;
	
	Если Не ЗначениеЗаполнено(ПараметрыФормы.Ключ) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияПрограммыОбученияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьОтображениеПрограммыОбучения(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеПрограммыОбучения(ДополнительныеПараметры)
	
	ПрограммыОбучения = ОбучениеПоРабочимМестам.НайтиСтроки(Новый Структура("Обучение", ДополнительныеПараметры.ПрограммаОбучения));
	РабочееМестоЕстьВОбучении = ДополнительныеПараметры.РабочиеМеста.Найти(СсылкаНаОбъект) <> Неопределено;
	Если ПрограммыОбучения.Количество() = 0 Тогда
		Если РабочееМестоЕстьВОбучении Тогда
			СтрокаОбучения = ОбучениеПоРабочимМестам.Добавить();
			СтрокаОбучения.Обучение = ДополнительныеПараметры.ПрограммаОбучения;
			СтрокаОбучения.Период = ДополнительныеПараметры.ПредставлениеПериода;
			СтрокаОбучения.ИспользуетсяДляВсехРабочихМест = ДополнительныеПараметры.ИспользоватьДляВсехРабочихМест;
			УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(ЭтотОбъект);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтрокаОбучения = ПрограммыОбучения[0];
	СтрокаОбучения.Период = ДополнительныеПараметры.ПредставлениеПериода;
	СтрокаОбучения.ИспользуетсяДляВсехРабочихМест = ДополнительныеПараметры.ИспользоватьДляВсехРабочихМест;
	
	Если ДополнительныеПараметры.ИспользоватьДляВсехРабочихМест Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РабочееМестоЕстьВОбучении Тогда
		ОбучениеПоРабочимМестам.Удалить(СтрокаОбучения.ПолучитьИдентификатор());
		УстановитьЗаголовокСвернутогоОтображенияОбученияПоОхранеТруда(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает адрес во временном хранилище массива уже подобранных программ обучения.
&НаСервере
Функция АдресСпискаПодобранныхПрограммОбучения()
	
	ПодобранныеПрограммыОбучения = Новый Массив;
	Для Каждого СтрокаОбучения Из ОбучениеПоРабочимМестам Цикл
		Если СтрокаОбучения.ИспользуетсяДляВсехРабочихМест Тогда
			Продолжить;
		КонецЕсли;
		ПодобранныеПрограммыОбучения.Добавить(СтрокаОбучения.Обучение);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ПодобранныеПрограммыОбучения, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ДобавитьПодобранныеПрограммыОбучения(ПрограммыОбучения)
	
	РеквизитыПрограммОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ПрограммыОбучения, "Ссылка, ПредставлениеПериода, ИспользоватьДляВсехРабочихМест");
	Для Каждого ПрограммаОбучения Из ПрограммыОбучения Цикл
		СтрокаОбучения = ОбучениеПоРабочимМестам.Добавить();
		СтрокаОбучения.Обучение = ПрограммаОбучения;
		ЗначенияРеквизитов = РеквизитыПрограммОбучения.Получить(ПрограммаОбучения);
		СтрокаОбучения.Период = ЗначенияРеквизитов.ПредставлениеПериода;
		СтрокаОбучения.ИспользуетсяДляВсехРабочихМест = ЗначенияРеквизитов.ИспользоватьДляВсехРабочихМест;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
