#Область СлужебныйПрограммныйИнтерфейс

// См. ОбщегоНазначенияБТС.ЭтоОбъектМетаданныхКонфигурация
Функция ЭтоОбъектМетаданныхКонфигурация(Знач ОбъектМетаданных) Экспорт
	
	Возврат ТипЗнч(ОбъектМетаданных) = Тип("ОбъектМетаданныхКонфигурация");
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПодсистема
Функция ЭтоПодсистема(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПодсистемы.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПараметрСеанса
Функция ЭтоПараметрСеанса(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПараметрыСеанса.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоОбщийРеквизит
Функция ЭтоОбщийРеквизит(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеОбщиеРеквизиты.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоКонстанта
Функция ЭтоКонстанта(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеКонстанты.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоСправочник
Функция ЭтоСправочник(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеСправочники.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоДокумент
Функция ЭтоДокумент(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеДокументы.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПеречисление
Функция ЭтоПеречисление(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПеречисления.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоБизнесПроцесс
Функция ЭтоБизнесПроцесс(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеБизнесПроцессы.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоЗадача
Функция ЭтоЗадача(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеЗадачи.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПланСчетов
Функция ЭтоПланСчетов(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПланыСчетов.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПланОбмена
Функция ЭтоПланОбмена(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПланыОбмена.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПланВидовРасчета
Функция ЭтоПланВидовРасчета(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПланыВидовРасчета.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПланВидовХарактеристик
Функция ЭтоПланВидовХарактеристик(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеПланыВидовХарактеристик.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоСсылочныеДанные
Функция ЭтоСсылочныеДанные(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеСсылочныеДанные.Получить(ОбъектМетаданных) = Истина;
		
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоСсылочныеДанныеПоддерживающиеПредопределенныеЭлементы
Функция ЭтоСсылочныеДанныеПоддерживающиеПредопределенныеЭлементы(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеСсылочныеДанныеПоддерживающиеПредопределенныеЭлементы.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРегистрСведений
Функция ЭтоРегистрСведений(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеРегистрыСведений.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРегистрНакопления
Функция ЭтоРегистрНакопления(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеРегистрыНакопления.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРегистрБухгалтерии
Функция ЭтоРегистрБухгалтерии(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеРегистрыБухгалтерии.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРегистрРасчета
Функция ЭтоРегистрРасчета(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеРегистрыРасчета.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНаборЗаписейПерерасчета
Функция ЭтоНаборЗаписейПерерасчета(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеНаборыЗаписейПерерасчета.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНаборЗаписейПоследовательности
Функция ЭтоНаборЗаписейПоследовательности(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеНаборыЗаписейПоследовательности.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНаборЗаписей
Функция ЭтоНаборЗаписей(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеНаборыЗаписей.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНезависимыйНаборЗаписей
Функция ЭтоНезависимыйНаборЗаписей(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеНезависимыеНаборыЗаписей.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНаборЗаписейПоддерживающийИтоги
Функция ЭтоНаборЗаписейПоддерживающийИтоги(Знач ОбъектМетаданных) Экспорт
	
	Если ОбщегоНазначенияБТС.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		
		Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") Тогда
			ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных);
		КонецЕсли;
		
		Возврат (ОбъектМетаданных.РазрешитьИтогиСрезПервых ИЛИ ОбъектМетаданных.РазрешитьИтогиСрезПоследних);
		
	ИначеЕсли ОбщегоНазначенияБТС.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		
		Возврат Истина;
		
	ИначеЕсли ОбщегоНазначенияБТС.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоЖурналДокументов
Функция ЭтоЖурналДокументов(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеЖурналыДокументов.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРегламентноеЗадание
Функция ЭтоРегламентноеЗадание(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеРегламентныеЗадания.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоВнешнийИсточникДанных
Функция ЭтоВнешнийИсточникДанных(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеВнешниеИсточникиДанных.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоСервисИнтеграции
Функция ЭтоСервисИнтеграции(Знач ОбъектМетаданных) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.МодельКонфигурации().ВсеСервисыИнтеграции.Получить(ОбъектМетаданных) = Истина;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоПримитивныйТип
Функция ЭтоПримитивныйТип(Знач ПроверяемыйТип) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.ОписаниеПримитивныхТипов().СодержитТип(ПроверяемыйТип);
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоСсылочныйТип
Функция ЭтоСсылочныйТип(Знач ПроверяемыйТип) Экспорт
	
	Возврат ОбщегоНазначенияБТССлужебныйПовтИсп.ОписаниеСсылочныхТипов().СодержитТип(ПроверяемыйТип);
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоНаборТиповСсылок
Функция ЭтоНаборТиповСсылок(Знач ОписаниеТипов) Экспорт
	
	Если ОписаниеТипов.Типы().Количество() < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СериализацияОписанияТипов = СериализаторXDTO.ЗаписатьXDTO(ОписаниеТипов);
	
	Если СериализацияОписанияТипов.TypeSet.Количество() > 0 Тогда
		
		СодержитНаборыСсылок = Ложь;
		
		Для Каждого НаборТипов Из СериализацияОписанияТипов.TypeSet Цикл
			
			Если НаборТипов.URIПространстваИмен = "http://v8.1c.ru/8.1/data/enterprise/current-config" Тогда
				
				Если НаборТипов.ЛокальноеИмя = "AnyRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "CatalogRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "DocumentRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "BusinessProcessRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "TaskRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "ChartOfAccountsRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "ExchangePlanRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "ChartOfCharacteristicTypesRef"
						ИЛИ НаборТипов.ЛокальноеИмя = "ChartOfCalculationTypesRef" Тогда
					
					СодержитНаборыСсылок = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат СодержитНаборыСсылок;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ОбъектМетаданныхПоТипуСсылки
Функция ОбъектМетаданныхПоТипуСсылки(Знач ТипСсылки) Экспорт
	
	БизнесПроцесс = ОбщегоНазначенияБТССлужебныйПовтИсп.СсылкиТочекМаршрутаБизнесПроцессов().Получить(ТипСсылки);
	Если БизнесПроцесс = Неопределено Тогда
		Ссылка = Новый(ТипСсылки);
		МетаданныеСсылки = Ссылка.Метаданные();
	Иначе
		МетаданныеСсылки = Метаданные.БизнесПроцессы[БизнесПроцесс];
	КонецЕсли;
	
	Возврат МетаданныеСсылки;
	
КонецФункции

// См. ОбщегоНазначенияБТС.ЭтоРазделенныйОбъектМетаданных
Функция ЭтоРазделенныйОбъектМетаданных(Знач ОбъектМетаданных, Знач ИмяРазделителя) Экспорт
	
	Свойства = СвойстваОбъектаМоделиКонфигурации(ОбщегоНазначенияБТССлужебныйПовтИсп.ОписаниеМоделиДанныхКонфигурации(), ОбъектМетаданных);
	Возврат Свойства.РазделениеДанных.Свойство(ИмяРазделителя);
	
КонецФункции

// См. ОбщегоНазначенияБТС.ПустойУникальныйИдентификатор
Функция ПустойУникальныйИдентификатор() Экспорт
	
	Возврат Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецФункции

// Записывает событие в технологический журнал.
//
// Параметры:
//  Событие	 - Строка - имя события для фильтрации записей технологического журнала с помощью настроек logcfg.xml.
//  Контекст - Структура - Произвольные данные для записи в технологический журнал.
//		В значения рекомендуется помещать данные примитивных типов. Это позволит повысить скорость записи.
//
Процедура ЗаписьТехнологическогоЖурнала(Событие, Контекст) Экспорт
	
	Попытка
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		
		Попытка
			
			ЗаписатьJSON(Запись, Контекст);
			
		Исключение
		
			СериализаторXDTO.ЗаписатьJSON(Запись, Контекст);
			
		КонецПопытки;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	&Событие КАК Событие,
		|	&Контекст КАК Контекст");
		
		Запрос.УстановитьПараметр("Событие", "СобытиеТЖ." + Событие);
		Запрос.УстановитьПараметр("Контекст", Запись.Закрыть());
		
		Запрос.Выполнить();
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ЗаписьТехнологическогоЖурнала", УровеньЖурналаРегистрации.Ошибка,,, 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// Активные расширения изменяющие структуру данных.
// 
// Возвращаемое значение:
//  Массив из РасширениеКонфигурации
Функция АктивныеРасширенияИзменяющиеСтруктуруДанных() Экспорт
	
	АктивныеРасширенияИзменяющиеСтруктуруДанных = Новый Массив;
	
	Для Каждого РасширениеКонфигурации Из РасширенияКонфигурации.Получить(, ИсточникРасширенийКонфигурации.СеансАктивные) Цикл	
		Если РасширениеКонфигурации.Активно
			И РасширениеКонфигурации.ИзменяетСтруктуруДанных() Тогда
			АктивныеРасширенияИзменяющиеСтруктуруДанных.Добавить(РасширениеКонфигурации)
		КонецЕсли;
	КонецЦикла;
	
	Возврат АктивныеРасширенияИзменяющиеСтруктуруДанных;
КонецФункции

// Возвращаемое значение:
//  Массив из Строка -
//
Функция ИменаИнтерактивныхПриложений() Экспорт
	ИменаПриложений = Новый Массив();
	ИменаПриложений.Добавить("1CV8");
	ИменаПриложений.Добавить("1CV8C");
	ИменаПриложений.Добавить("WebClient");
	ИменаПриложений.Добавить("MobileClient");
	Возврат ИменаПриложений;
КонецФункции

Функция ПодсистемыОбъектаМетаданных(ОбъектМетаданных) Экспорт
	
	ИменаПодсистем = ОбщегоНазначенияБТССлужебныйПовтИсп.ПодсистемыПоОбъектамМетаданных();
	Результат = ИменаПодсистем.Получить(ОбъектМетаданных);
	Если Результат = Неопределено Тогда
		Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Метаданные.Имя);
	КонецЕсли;
	
	Возврат СтрСоединить(Результат, ", ");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свойства объекта модели конфигурации
// 
// Параметры: 
//  Модель - ФиксированныйМассив из Структура:
//  * Значение - Соответствие из КлючИЗначение:
//  		   - ФиксированноеСоответствие Из КлючИЗначение:
//  			  * Ключ - Строка
//  			  * Значение - см. ОбщегоНазначенияБТССлужебныйПовтИсп.НовыйОписаниеОбъекта
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных
// 
// Возвращаемое значение:  см. ОбщегоНазначенияБТССлужебныйПовтИсп.НовыйОписаниеОбъекта
//
Функция СвойстваОбъектаМоделиКонфигурации(Знач Модель, Знач ОбъектМетаданных) Экспорт
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("ОбъектМетаданных") Тогда
		Имя = ОбъектМетаданных.Имя;
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	Иначе
		ПолноеИмя = ОбъектМетаданных;
		Имя = СтрРазделить(ПолноеИмя, ".").Получить(1);
	КонецЕсли;
	
	Для Каждого КлассМодели Из Модель Цикл
		Значение = КлассМодели.Значение;
		Если ТипЗнч(Значение) = Тип("Соответствие")  Или ТипЗнч(Значение) = Тип("ФиксированноеСоответствие") Тогда
			ОписаниеОбъекта = Значение.Получить(Имя); // см. ОбщегоНазначенияБТССлужебныйПовтИсп.НовыйОписаниеОбъекта
		Иначе
			ОписаниеОбъекта = Неопределено;
		КонецЕсли;
		Если ОписаниеОбъекта <> Неопределено Тогда
			Если ПолноеИмя = ОписаниеОбъекта.ПолноеИмя Тогда
				Возврат ОписаниеОбъекта;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти