#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;
	
	ЗаполнитьРеквизитИспользоватьОтпускаУчебные();
	
	УстановитьОтборыСписка();
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	ОбучениеРазвитиеФормы.УстановитьВидимостьКомандСозданияДокументов(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКоманд();
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	 ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

// Примеры вызова новой универсальной процедуры из команд формы
&НаКлиенте
Процедура СоздатьКомандировку(Команда)
	СоздатьДокумент(Команда, "Командировка", "КомандировкиСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтпуск(Команда)
	СоздатьДокумент(Команда, "Отпуск", "ОтпускаСотрудников");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтсутствие(Команда)
	СоздатьДокумент(Команда, "ОплатаПоСреднемуЗаработку", "ОплатаПоСреднемуЗаработкуСписком");
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Элементы.Список);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыСписка()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Ложь,,,Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	Если Параметры.Свойство("ЭтапыОбучения") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ПервичныйЭтапОбучения",
			Параметры.ЭтапыОбучения,
			ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПервичныеЭтапыОбучения") И Параметры.ТолькоПервичныеЭтапыОбучения Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ЭтоПервичныйЭтап",
			Истина,,,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("СкрыватьСсылку") И ЗначениеЗаполнено(Параметры.СкрыватьСсылку) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Ссылка",
			Параметры.СкрыватьСсылку,
			ВидСравненияКомпоновкиДанных.НеРавно,,Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") И ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Подразделение",
			Параметры.Подразделение,
			ВидСравненияКомпоновкиДанных.ВИерархии,,Истина);
	Иначе
		Если Параметры.Свойство("Организация") И ЗначениеЗаполнено(Параметры.Организация) Тогда
			Если ОрганизационнаяСтруктура.СтруктураПредприятияСоответствуетСтруктуреЮридическихЛиц() Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
					Список,
					"Подразделение",
					ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(Параметры.Организация),
					ВидСравненияКомпоновкиДанных.ВИерархии, , Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Мероприятие") И ЗначениеЗаполнено(Параметры.Мероприятие) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Мероприятие",
			Параметры.Мероприятие,
			ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если Параметры.Свойство("ФизическоеЛицо") И ЗначениеЗаполнено(Параметры.ФизическоеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ФизическоеЛицо", Параметры.ФизическоеЛицо);
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаНачала") И ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ДатаНачала",
			Параметры.ДатаНачала,
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаОкончания") И ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"ДатаОкончания",
			Параметры.ДатаОкончания,
			ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитИспользоватьОтпускаУчебные()
	ИспользоватьОтпускаУчебные = РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты().ИспользоватьОтпускаУчебные;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСотрудниковПоОрганизациямНаСервере(Ссылка)
	
	Возврат ОбучениеРазвитие.ПолучитьСотрудниковПоОрганизациям(Ссылка);

КонецФункции

&НаКлиенте
Процедура СоздатьДокумент(Команда, ИмяДокумента, ИмяДокументаСписок)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиПоОрганизациям = ПолучитьСотрудниковПоОрганизациямНаСервере(ТекущиеДанные.Ссылка);
	
	ОбучениеРазвитиеКлиент.СоздатьПриказИзСписка(ТекущиеДанные, СотрудникиПоОрганизациям, ИмяДокумента, ИмяДокументаСписок, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКоманд()
	 
 	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено ИЛИ (ТекущиеДанные.Свойство("ГруппировкаСтроки") И ТекущиеДанные.ГруппировкаСтроки = Неопределено) Тогда
		УстанавливаемаяДоступность = Ложь;
	Иначе
		УстанавливаемаяДоступность = ТекущиеДанные.ОбучениеСОтрывомОтПроизводства;
	КонецЕсли;
	
 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФормаСоздатьОтпуск",
		"Доступность",
		УстанавливаемаяДоступность И ИспользоватьОтпускаУчебные);
		
 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФормаСоздатьКомандировку",
		"Доступность",
		УстанавливаемаяДоступность);
		
 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФормаСоздатьОтсутствие",
		"Доступность",
		УстанавливаемаяДоступность);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовФормы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаДокументОбучениеРазвитиеСотрудниковСоздатьНаОсновании",
		"Заголовок",
		НСтр("ru = 'Продолжение обучения'"));
	
КонецПроцедуры

#КонецОбласти