
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Подключить(ПолученноеИмяПользователя, ПолученныйПароль) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	ИмяПользователя = ПолученноеИмяПользователя;
	Пароль = ПолученныйПароль;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
		Результат.Пароль = Пароль;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе
Функция ИнформацияОПользователе(Показыватьпредупреждение = Истина) Экспорт
	
	ИнформацияОПользователе = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/user/current/");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОПользователеSuperJob = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
	Иначе
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеИнформацияОПользователе(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОПользователеSuperJob) Тогда
		ИнформацияОПользователе.ИдентификаторКомпании = Формат(ИнформацияОПользователеSuperJob.id_client, "ЧГ=0");
		ИнформацияОПользователе.ИдентификаторПользователя = Формат(ИнформацияОПользователеSuperJob.id, "ЧГ=0");
		ИнформацияОПользователе.ИмяПользователя = ИнформацияОПользователеSuperJob.email;
		
		Для Каждого Тариф Из ИнформацияОПользователеSuperJob.tariffs Цикл
			Если Тариф.is_unlimited Тогда
				ИнформацияОПользователе.БезлимитныйТариф = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат ИнформацияОПользователе;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
// 
// Параметры:
//  Показыватьпредупреждение - Булево -
Функция ПроверитьПодключение(Показыватьпредупреждение = Истина) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		УстановитьПривилегированныйРежим(Истина);
		РеквизитыСайта.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ПарольSuperJob");
		УстановитьПривилегированныйРежим(Ложь);
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен(Показыватьпредупреждение);
	КонецЕсли;
	
	Если Результат.Подключен Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьКлассификаторы() Экспорт
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы <> Неопределено Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/references/");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеЗагрузкиКлассификаторов(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		КлассификаторыSuperJob = ПарсерJSON(РезультатЗапроса.ТелоОтвета, Истина);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/regions/combined/");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки классификатора городов с сайта %1.'"), Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		СправочникРегионовSuperJob = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Запрос = НовыйHTTPЗапрос("/2.0/user/list/");
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки классификатора пользователей с сайта %1.'"), Сайт);
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		Иначе
			СправочникПользователейSuperJob = ПарсерJSON(РезультатЗапроса.ТелоОтвета, Истина);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КлассификаторыSuperJob) Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	КлассификаторыSuperJobНовый = Новый Структура;
	Для Каждого ЭлементСтруктуры Из КлассификаторыSuperJob Цикл
		НоваяСтруктура = Новый Структура;
		Для Каждого ЭлементВложеннойСтруктуры Из ЭлементСтруктуры.Значение Цикл
			Если ТипЗнч(ЭлементВложеннойСтруктуры.Значение) = Тип("Строка") Тогда
				Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЭлементВложеннойСтруктуры.Ключ) Тогда
					НоваяСтруктура.Вставить("Ключ" + ЭлементВложеннойСтруктуры.Ключ, ЭлементВложеннойСтруктуры.Значение);
				Иначе
					НоваяСтруктура.Вставить(ЭлементВложеннойСтруктуры.Ключ, ЭлементВложеннойСтруктуры.Значение);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ЭлементВложеннойСтруктуры.Значение) = Тип("Структура") Тогда
				НоваяВложеннаяСтруктура = Новый Структура;
				Для Каждого ЭлементВложеннойСтруктурыВторогоУровня Из ЭлементВложеннойСтруктуры.Значение Цикл
					Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЭлементВложеннойСтруктурыВторогоУровня.Ключ) Тогда
						НоваяВложеннаяСтруктура.Вставить("Ключ" + ЭлементВложеннойСтруктурыВторогоУровня.Ключ, ЭлементВложеннойСтруктурыВторогоУровня.Значение);
					Иначе
						НоваяВложеннаяСтруктура.Вставить(ЭлементВложеннойСтруктурыВторогоУровня.Ключ, ЭлементВложеннойСтруктурыВторогоУровня.Значение);
					КонецЕсли;
				КонецЦикла;
				НоваяВложеннаяСтруктураФикс = Новый ФиксированнаяСтруктура(НоваяВложеннаяСтруктура);
				НоваяСтруктура.Вставить(ЭлементВложеннойСтруктуры.Ключ, НоваяВложеннаяСтруктураФикс);
			КонецЕсли;
		КонецЦикла;
		НоваяСтруктураФикс = Новый ФиксированнаяСтруктура(НоваяСтруктура);
		КлассификаторыSuperJobНовый.Вставить(ЭлементСтруктуры.Ключ, НоваяСтруктураФикс);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СправочникРегионовSuperJob) Тогда
		НовыйМассив = Новый Массив;
		
		Для Каждого ЭлементМассива Из СправочникРегионовSuperJob Цикл
			НовыйВложенныйМассив = Новый Массив;
			Если ЭлементМассива.Свойство("towns") 
				И ЭлементМассива.towns.Количество() > 0 Тогда
				
				Для Каждого Город Из ЭлементМассива.towns Цикл
					НоваяСтруктура = СтруктураДанныхSuperJob();
					ЗаполнитьЗначенияСвойств(НоваяСтруктура, Город);
					
					НоваяФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(НоваяСтруктура);
					Если ЭлементМассива.Свойство("title") Тогда
						НовыйВложенныйМассив.Добавить(НоваяФиксированнаяСтруктура);
					Иначе
						НовыйМассив.Добавить(НоваяФиксированнаяСтруктура);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ЭлементМассива.Свойство("regions") 
				И ЭлементМассива.regions.Количество() > 0 Тогда
				Для Каждого Регион Из ЭлементМассива.regions Цикл
					
					НовыйВложенныйМассивВторогоУровня = Новый Массив;
					Если Регион.Свойство("towns") 
						И Регион.towns.Количество() > 0 Тогда
						
						Для Каждого Город Из Регион.towns Цикл
							
							НоваяСтруктураТретьегоУровня = СтруктураДанныхSuperJob();
							ЗаполнитьЗначенияСвойств(НоваяСтруктураТретьегоУровня, Город);
							
							НоваяФиксированнаяСтруктураТретьегоУровня = Новый ФиксированнаяСтруктура(НоваяСтруктураТретьегоУровня);
							НовыйВложенныйМассивВторогоУровня.Добавить(НоваяФиксированнаяСтруктураТретьегоУровня);
							
						КонецЦикла;
					КонецЕсли;
					
					Если НЕ (Регион.Свойство("id") И Регион.Свойство("title")) Тогда
						Продолжить;
					КонецЕсли;
					
					НовыйВложенныйФиксированныйМассивВторогоУровня = Новый ФиксированныйМассив(НовыйВложенныйМассивВторогоУровня);
					
					НоваяСтруктураВторогоУровня = Новый Структура("id, title, towns");
					ЗаполнитьЗначенияСвойств(НоваяСтруктураВторогоУровня, Регион, "id, title");
					НоваяСтруктураВторогоУровня.towns = НовыйВложенныйФиксированныйМассивВторогоУровня;
					
					НоваяФиксированнаяСтруктураВторогоУровня = Новый ФиксированнаяСтруктура(НоваяСтруктураВторогоУровня);
					НовыйВложенныйМассив.Добавить(НоваяФиксированнаяСтруктураВторогоУровня);
				КонецЦикла;
			КонецЕсли;
			
			НовыйВложенныйФиксированныйМассив = Новый ФиксированныйМассив(НовыйВложенныйМассив);
			
			Если ЭлементМассива.Свойство("title") Тогда
				НоваяСтруктура = Новый Структура("id, title, regions");
				ЗаполнитьЗначенияСвойств(НоваяСтруктура, ЭлементМассива, "id, title");
				НоваяСтруктура.regions = НовыйВложенныйФиксированныйМассив;
				
				НоваяФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(НоваяСтруктура);
				НовыйМассив.Добавить(НоваяФиксированнаяСтруктура);
			КонецЕсли;
		КонецЦикла;
		
		НовыйФиксированныйМассив = Новый ФиксированныйМассив(НовыйМассив);
		
		КлассификаторыSuperJobНовый.Вставить("towns", НовыйФиксированныйМассив);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СправочникПользователейSuperJob) Тогда
		СтруктураПользователей = Новый Структура;
			
		Для Каждого ЭлементСтруктуры Из СправочникПользователейSuperJob.Получить("objects") Цикл
			Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЭлементСтруктуры.Ключ) Тогда
				СтруктураПользователей.Вставить("Ключ" + ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение.Получить("firstname") + " " + ЭлементСтруктуры.Значение.Получить("lastname"));	
			Иначе
				СтруктураПользователей.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение.Получить("firstname") + " " + ЭлементСтруктуры.Значение.Получить("lastname"));	
			КонецЕсли;
		КонецЦикла;
		
		НовыйФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(СтруктураПользователей);
		
		КлассификаторыSuperJobНовый.Вставить("users", НовыйФиксированнаяСтруктура);
	КонецЕсли;
	
	ТипПоиска = Новый Структура;
	
	ТипПоиска.Вставить("or", НСтр("ru = 'Хотя бы одно слово'"));
	ТипПоиска.Вставить("and", НСтр("ru = 'Все слова'"));
	ТипПоиска.Вставить("particular", НСтр("ru = 'Точная фраза'"));
	
	КлассификаторыSuperJobНовый.Вставить("resumesubscription_kwc", Новый ФиксированнаяСтруктура(ТипПоиска));
	
	ОбластьПоиска = Новый Структура;
	
	ОбластьПоиска.Вставить("Ключ7",  НСтр("ru = 'По опыту'"));
	ОбластьПоиска.Вставить("Ключ50", НСтр("ru = 'По всему резюме'"));
	ОбластьПоиска.Вставить("Ключ60", НСтр("ru = 'По желаемой должности'"));
	ОбластьПоиска.Вставить("Ключ8",  НСтр("ru = 'По названию организации'"));
	ОбластьПоиска.Вставить("Ключ3",  НСтр("ru = 'По ключевым навыкам'"));
	ОбластьПоиска.Вставить("Ключ6",  НСтр("ru = 'По образованию и курсам'"));
	ОбластьПоиска.Вставить("Ключ2",  НСтр("ru = 'По месту проживания'"));
	
	КлассификаторыSuperJobНовый.Вставить("resumesubscription_rws", Новый ФиксированнаяСтруктура(ОбластьПоиска));
	
	ВодительскоеУдостоверение = Новый Структура;
	
	ВодительскоеУдостоверение.Вставить("A", "A");
	ВодительскоеУдостоверение.Вставить("B", "B");
	ВодительскоеУдостоверение.Вставить("C", "C");
	ВодительскоеУдостоверение.Вставить("D", "D");
	ВодительскоеУдостоверение.Вставить("E", "E");
	
	КлассификаторыSuperJobНовый.Вставить("driving_licence", Новый ФиксированнаяСтруктура(ВодительскоеУдостоверение));
	
	ВидДоступа = Новый Структура;
	
	ВидДоступа.Вставить("Ключ0", НСтр("ru = 'Закрытый доступ'"));
	ВидДоступа.Вставить("Ключ1", НСтр("ru = 'Открытый доступ'"));
	
	КлассификаторыSuperJobНовый.Вставить("published", Новый ФиксированнаяСтруктура(ВидДоступа));
	
	Периоды = Новый Структура;
	
	Периоды.Вставить("Ключ0",  НСтр("ru = 'За все время'"));
	Периоды.Вставить("Ключ1",  НСтр("ru = 'За последние 24 часа'"));
	Периоды.Вставить("Ключ3",  НСтр("ru = 'За последние 3 дня'"));
	Периоды.Вставить("Ключ7",  НСтр("ru = 'За последнюю неделю'"));
	Периоды.Вставить("Ключ14", НСтр("ru = 'За последние 2 недели'"));
	Периоды.Вставить("Ключ30", НСтр("ru = 'За последний 1 месяц'"));
	Периоды.Вставить("Ключ60", НСтр("ru = 'За последние 2 месяца'"));
	
	КлассификаторыSuperJobНовый.Вставить("periods", Новый ФиксированнаяСтруктура(Периоды));
	
	Классификаторы = Новый ФиксированнаяСтруктура(КлассификаторыSuperJobНовый);
	
	ТекущиеПараметры =
		РекрутинговыеСайтыСлужебный.СоответствиеПоФиксированномуСоответствию(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("КлассификаторыSuperJob", Классификаторы);
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Классификаторы;
	
КонецФункции

Процедура НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	НомерСтраницы = ПараметрыПоиска.НомерСтраницы;
	ПолеСортировки = ПараметрыПоиска.ПолеСортировки;
	ВсегоКандидатов = ПараметрыПоиска.ВсегоКандидатов;
	
	СтрокаОтбора = СтрокаОтбора(СтруктураОтбора, НомерСтраницы);
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/resumes/resumes/?" + СтрокаОтбора);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоискаРезюме(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		РезультатПоискаРезюме = ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса);
		
		Если РезультатПоискаРезюме.objects = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если РезультатПоискаРезюме.Свойство("total") 
			И Число(РезультатПоискаРезюме.total) > 0 Тогда
			ВсегоКандидатов = РезультатПоискаРезюме.total;
		Иначе
			ВсегоКандидатов = 0;
		КонецЕсли;
		
		ПараметрыПоиска.ВсегоКандидатов = Мин(Число(ВсегоКандидатов), 500);
		
		ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "towns" Или Классификатор = "areas_towns" Тогда
		Результат = ЗаполнитьДеревоРегионов(Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	ИмяКлассификатора = "";
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ИмяКлассификатора = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ИмяКлассификатора = "education";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ИмяКлассификатора = "periods";
	Иначе
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	Классификаторы = КлассификаторыСайта();
	
	Классификатор = Классификаторы[ИмяКлассификатора];
	
	Если Не ЗначениеЗаполнено(Классификатор) Тогда
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	// АПК:1297-выкл Значения классификаторов, не локализуются.
	СоответствиеЗамены = Новый Соответствие;
	СоответствиеЗамены.Вставить("среднее", "среднее общее");
	СоответствиеЗамены.Вставить("среднее специальное", "среднее профессиональное");
	// АПК:1297-вкл
	
	Найдено = Ложь;
	Для Каждого Элемент Из Классификатор Цикл
		ЗначениеСравнения = НРег(СокрЛП(Элемент.Значение));
		
		ЗначениеЗамены = СоответствиеЗамены.Получить(ЗначениеСравнения);
		Если ЗначениеЗаполнено(ЗначениеЗамены) Тогда
			ЗначениеСравнения = ЗначениеЗамены;
		КонецЕсли;
		
		Если ЗначениеСравнения = НРег(Значение) Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Найдено Тогда
		ЭлементКлассификатора = Элемент.Ключ;
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	Разделитель = "-";
	
	ИдентификаторРезюме = СтрЗаменить(АдресРезюме, ".html", "");
	
	Пока РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель) > 0 Цикл
		НомерВхожденияРазделителя = 
			РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
		ИдентификаторРезюме = 
			Сред(ИдентификаторРезюме, 
				НомерВхожденияРазделителя + СтрДлина(Разделитель), 
				СтрДлина(ИдентификаторРезюме) - НомерВхожденияРазделителя);
	КонецЦикла;
	
	Возврат ИдентификаторРезюме;

КонецФункции

Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(СтруктураРезюме) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(СтруктураРезюме);
		
		ДанныеКандидата.Комментарии = ЗначениеСвойстваУзла(СтруктураРезюме, "Комментарии");
		ДанныеКандидата.ДанныеПубликации = СтруктураРезюме;
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь) Экспорт
	
	МассивВакансий = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		БылиОшибки = Истина;
		Возврат МассивВакансий;
	КонецЕсли;
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	ИдентификаторКомпании  = ИнформацияОПользователе.ИдентификаторКомпании;
	ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
	
	Если Не ЗначениеЗаполнено(ИдентификаторКомпании) 
		Или Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		БылиОшибки = Истина;
		Возврат МассивВакансий;
	КонецЕсли;
	
	ЗагрузитьКлассификаторы();
	
	Запрос = НовыйHTTPЗапрос("/2.0/hr/vacancies/?status=all_not_archive&id_user=" + ИдентификаторПользователя);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		БылиОшибки = Истина;
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансий(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Вакансии = ПрочитатьОтветВакансииССайта(РезультатЗапроса);
		МассивВакансий = Вакансии.objects;
	КонецЕсли;
	
	Возврат МассивВакансий;
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		Результат = ?(ЗначениеЗаполнено(Вакансия.profession), Вакансия.profession, "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		Результат = ?(ЗначениеЗаполнено(Вакансия.payment_to), Вакансия.payment_to, 0);
	ИначеЕсли Реквизит = "ДатаОткрытия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.СтрокаВДату(Вакансия.date_last_published);
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" Тогда
		Результат = ДобавитьМесяц(РекрутинговыеСайтыСлужебный.СтрокаВДату(Вакансия.date_last_published), 1);
	ИначеЕсли Реквизит = "Требования" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "candidat")).Требования;
	ИначеЕсли Реквизит = "Обязанности" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "candidat")).Обязанности;
	ИначеЕсли Реквизит = "Условия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "candidat")).Условия;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;

	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "address";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "age_from")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "age_from";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "age_from");
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "age_to")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "age_to";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "age_to");
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "anonymous")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "anonymous";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "anonymous") = "true"
			Или ЗначениеСвойстваУзла(СтруктураВакансииССайта, "anonymous") = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "candidat")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "candidat";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "candidat");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "compensation")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "compensation";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "compensation");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contact")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "contact";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contact");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "email")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "email";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "email");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "extend_vac")) Тогда
    	НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "extend_vac";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "extend_vac") = "true"
			Или ЗначениеСвойстваУзла(СтруктураВакансииССайта, "extend_vac") = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "firm_name")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "firm_name";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "firm_name");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "firm_activity")) Тогда
   		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "firm_activity";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "firm_activity");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "moveable")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "moveable";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "moveable") = "true"
			Или ЗначениеСвойстваУзла(СтруктураВакансииССайта, "moveable") = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "payment_from")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "payment_from";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "payment_from");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "payment_to")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "payment_to";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "payment_to");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "profession")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "profession";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "profession");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "refresh_vac")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "refresh_vac";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "refresh_vac") = "true"
			Или ЗначениеСвойстваУзла(СтруктураВакансииССайта, "refresh_vac") = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_keywords"))  Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "resumesubscription_keywords";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_keywords");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_status")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "resumesubscription_status";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_status") <> "0";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work")) Тогда 
	 	НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "work";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "code")) Тогда 
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "code";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "code");
	КонецЕсли;

	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "children")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "children";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "children", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "children", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "education";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "education", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience")) Тогда
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "experience";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "gender")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "gender";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "gender", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "gender", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "maritalstatus")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "maritalstatus";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "maritalstatus", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "maritalstatus", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "place_of_work")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "place_of_work";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "place_of_work", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "place_of_work", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "type_of_work")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "type_of_work";
		Список = Новый СписокЗначений;
		Список.Добавить("Ключ" + ЗначениеСвойстваУзла(СтруктураВакансииССайта, "type_of_work", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "type_of_work", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "town")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "town.id";
		Список = Новый СписокЗначений;
		Список.Добавить(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "town", "id"), ЗначениеСвойстваУзла(СтруктураВакансииССайта, "town", "title"));
		НовоеПоле.ПубликацияВакансии = Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "driving_licence")) Тогда
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "driving_licence";
		Список = Новый СписокЗначений;
		
		Для Каждого Категория Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "driving_licence") Цикл
			Если Категория = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Список.Добавить(Категория, Категория);
		КонецЦикла;
		
		Если Список.Количество() > 0 Тогда
			НовоеПоле.ПубликацияВакансии = Список;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "languages")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "languages";
		Список = Новый СписокЗначений;
		
		Для Каждого ВложенныйМассив Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "languages") Цикл
			
			Если ВложенныйМассив = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Индекс = 0;
			Для Каждого ЭлементМассива Из ВложенныйМассив Цикл
				
				Если ЭлементМассива = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Индекс = 0 Тогда
					
					СтруктураЯзыка = Новый Структура;
					СтруктураЯзыка.Вставить("id", "Ключ" + ЭлементМассива.id);
					СтруктураЯзыка.Вставить("title", ЭлементМассива.title);
					
				КонецЕсли;
				
				Если Индекс = 1 Тогда
			
					СтруктураУровня = Новый Структура;
					СтруктураУровня.Вставить("id", "Ключ" + ЭлементМассива.id);
					СтруктураУровня.Вставить("title", ЭлементМассива.title);
					
				КонецЕсли;
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
			СтруктураУровняЯзыков = Новый Структура;
			СтруктураУровняЯзыков.Вставить("id_language", СтруктураЯзыка);
			СтруктураУровняЯзыков.Вставить("level", СтруктураУровня);
			
			Список.Добавить(СтруктураУровняЯзыков, СтруктураУровняЯзыков.id_language.title + " (" + СтруктураУровняЯзыков.level.title + ")");
			
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии = Список;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "id_user")) Тогда
		
		Список = Новый СписокЗначений;
		ПредставлениеПользователя = "";
		СправочникПользователи = КлассификаторыСайта().users;
		Для Каждого ЭлементСправочникаПользователи Из СправочникПользователи Цикл
			Если ЭлементСправочникаПользователи.Ключ = "Ключ" + Формат(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "id_user"), "ЧГ=0") Тогда
				ПредставлениеПользователя = ЭлементСправочникаПользователи.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ПредставлениеПользователя) Тогда
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "id_user";
			Список.Добавить("Ключ" + Формат(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "id_user"), "ЧГ=0"), ПредставлениеПользователя);
			НовоеПоле.ПубликацияВакансии = Список;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_kwc")) Тогда 
		
		Список = Новый СписокЗначений;
		Представление = "";
		Справочник = КлассификаторыСайта().resumesubscription_kwc;
		Для Каждого ЭлементСправочника Из Справочник Цикл
			Если ЭлементСправочника.Ключ = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_kwc") Тогда
				Представление = ЭлементСправочника.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(Представление) Тогда
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "resumesubscription_kwc";
			Список.Добавить(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_kwc"), Представление);
			НовоеПоле.ПубликацияВакансии = Список;
		КонецЕсли;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_rws")) Тогда 
	
		Список = Новый СписокЗначений;
		Представление = "";
		Справочник = КлассификаторыСайта().resumesubscription_rws;
		Для Каждого ЭлементСправочника Из Справочник Цикл
			Если ЭлементСправочника.Ключ = "Ключ" + Формат(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_rws"), "ЧГ=0") Тогда
				Представление = ЭлементСправочника.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(Представление) Тогда
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "resumesubscription_rws";
			Список.Добавить("Ключ" + Формат(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "resumesubscription_rws"), "ЧГ=0"), Представление);
			НовоеПоле.ПубликацияВакансии = Список;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.СМножественнымВыборомИзСписка = ПоляВакансииСМножественнымВыборомИзСписка();
	ВидыПолей.СМножественнымВыборомИзДерева = ПоляВакансииСМножественнымВыборомИзДерева();
	ВидыПолей.СоСпециальнойФормойРедактированияСписка = ПоляВакансииСоСпециальнойФормойРедактированияСписка();
	ВидыПолей.СМногострочнымВводом = ПоляВакансииСМногострочнымВводом();
	
	Возврат ВидыПолей;
	
КонецФункции

Функция ПоляВакансии(ОбновлениеПубликации = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONНачалоМассива = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива();
	ТипЗначенияJSONНачалоОбъекта = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();
	ТипЗначенияJSONБулево = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONБулево();

	МассивПолей = Новый Массив;
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "profession";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "town.id";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Город'");
	Если ОбновлениеПубликации Тогда
		СтруктураПоля.Использование = Ложь;
	КонецЕсли;
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "published";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Тип доступа'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "id_user";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Пользователь'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "code";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Код вакансии'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "external_url";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'URL внешнего сайта'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "work";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Должностные обязанности'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "candidat";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Требования к кандидату'");
	МассивПолей.Добавить(СтруктураПоля);

	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "compensation";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Условия работы'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "type_of_work";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Тип занятости'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "place_of_work";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Место работы'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "education";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Образование'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "experience";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Опыт работы'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "languages";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Наименование и уровень владения иностранными языками'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "contact";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Имя контактного лица'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "email";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Адрес электронной почты'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "url";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Адрес сайта компании'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "phones";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Номер телефона'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "driving_licence";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Наличие водительских прав'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "payment_from";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Сумма оклада от'");
	МассивПолей.Добавить(СтруктураПоля);

	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "payment_to";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Сумма оклада до'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "firm_name";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название компании'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "firm_activity";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание деятельности компании'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "address";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Адрес компании'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "anonymous";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Анонимная вакансия'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "refresh_vac";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Обновлять вакансию автоматически'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "extend_vac";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Продлевать вакансию автоматически'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "resumesubscription_status";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Включить подписку на резюме'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "resumesubscription_keywords";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Ключевые слова подписки на резюме'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "resumesubscription_kwc";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Как искать слова в подписке на резюме'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "resumesubscription_rws";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Где искать слова в подписке на резюме'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "moveable";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Рассматриваются соискатели из других городов'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "gender";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Пол'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "age_from";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Возраст от'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "age_to";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Возраст до'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "maritalstatus";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Семейное положение'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "children";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Наличие детей'");
	МассивПолей.Добавить(СтруктураПоля);
	
	Возврат МассивПолей;
	
КонецФункции

Функция АдресВакансии(Идентификатор) Экспорт
	
	Возврат СтрШаблон("https://www.superjob.ru/vakansii/vacancy-%1.html", Идентификатор);
	
КонецФункции

Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/vacancies/");
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 201 Тогда
		СтруктураВакансии = ПрочитатьОтветПубликацияВакансии(РезультатЗапроса);
		Результат.ИдентификаторВакансии = СтруктураВакансии.id;
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	КлассификаторыSuperJob = КлассификаторыСайта();
	Если КлассификаторыSuperJob = Неопределено Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	СтруктураДанных = КлассификаторыSuperJob[Путь];
	Для Каждого ЭлементСтруктурыДанных Из СтруктураДанных Цикл
		Если ЭлементСтруктурыДанных.Значение = "Не имеет значения" Тогда // АПК:1297 Строка не видна пользователю и не локализуется.
			Продолжить;
		КонецЕсли;
		СписокВыбора.Добавить(ЭлементСтруктурыДанных.Ключ, ЭлементСтруктурыДанных.Значение);
	КонецЦикла;
		
	Возврат СписокВыбора;

КонецФункции

Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/2.0/vacancies/%1/archive/", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 И РезультатЗапроса.КодСостояния <> 403 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	Описание = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	Если ЗначениеЗаполнено(Описание) Тогда
		СвойстваПубликации.Опубликована = Не Описание.is_archive;
		
		СвойстваПубликации.ДатаПубликации = РекрутинговыеСайтыСлужебный.СекундыВДату(Описание.date_published);
		СвойстваПубликации.ДатаОбновления = РекрутинговыеСайтыСлужебный.СекундыВДату(Описание.date_lastedit);
		
		Если Не СвойстваПубликации.Опубликована Тогда
			СвойстваПубликации.ДатаСнятияСПубликации = РекрутинговыеСайтыСлужебный.СекундыВДату(Описание.date_archived);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ТекстЗапроса = "/2.0/vacancies/" + ИдентификаторВакансии + "/";
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/2.0/vacancies/%1/republish/", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		Результат.ИдентификаторВакансии = ИдентификаторВакансии;
	Иначе
		Результат = ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
		
		Если Результат.Успешно Тогда
			ДатаСеанса = ТекущаяДатаСеанса();
			
			СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
			СвойстваПубликации.Опубликована = Истина;
			СвойстваПубликации.ДатаПубликации = ДатаСеанса;
			СвойстваПубликации.ДатаОбновления = ДатаСеанса;
		Иначе
			СнятьПубликациюВакансии(ИдентификаторВакансии);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтактыРезюме(АдресРезюме) Экспорт
	
	КонтактыРезюме = РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме();
	
	Если Не УстановитьСоединение() Тогда
		Возврат КонтактыРезюме;
	КонецЕсли;
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюмеПоАдресу(АдресРезюме));

	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		Не ПустаяСтрока(ДоступностьКонтактов.КонтактыМожноОткрытьПоАдресу), 
		НСтр("ru = 'Не заполнен адрес для получения контактов резюме с сайта SuperJob'"), 
		"Обработки.ИнтеграцияSuperJob.КонтактыРезюме");
	
	Запрос = НовыйHTTPЗапрос("/2.0/" + ДоступностьКонтактов.КонтактыМожноОткрытьПоАдресу);
	
	Попытка
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	Исключение
		РекрутинговыеСайтыСлужебный.ЗарегистрироватьОшибкуОбращенияКРекрутинговомуСайту(РезультатЗапроса.ИнформацияОбОшибке);
		Возврат КонтактыРезюме;
	КонецПопытки;
	
	СтруктураРезюме = ПрочитатьОтветКонтактыРезюме(РезультатЗапроса);
	
	КонтактыРезюме.Фамилия = ЗначениеСвойстваУзла(СтруктураРезюме, "resume", "lastname");
	КонтактыРезюме.Имя = ЗначениеСвойстваУзла(СтруктураРезюме, "resume", "firstname");
	КонтактыРезюме.Отчество = ЗначениеСвойстваУзла(СтруктураРезюме, "resume", "middlename");
	
	КонтактыРезюме.Телефон = ЗначениеСвойстваУзла(СтруктураРезюме, "resume", "phone1");
	КонтактыРезюме.ЭлектроннаяПочта = ЗначениеСвойстваУзла(СтруктураРезюме, "resume", "email");
	
	Возврат КонтактыРезюме;
	
КонецФункции

Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	Отклики = РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов();
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		Запрос = НовыйHTTPЗапрос("/2.0/resumes/received/" + ИдентификаторВакансии + "/");
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатЗапроса);
			Возврат;
		Иначе
			ОткликиССайта = ПрочитатьОтветОтклики(РезультатЗапроса);
		КонецЕсли;
		
		Для Каждого Отклик Из ОткликиССайта.objects Цикл
			Если Отклик = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Отклик, "resume", "id"), "ЧГ=0");
			Если ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) = Неопределено Тогда
				НоваяЗапись = Отклики.Добавить();
				НоваяЗапись.Вакансия = Вакансия;
				НоваяЗапись.Фамилия = ЗначениеСвойстваУзла(Отклик, "resume", "lastname");
				НоваяЗапись.Имя = ЗначениеСвойстваУзла(Отклик, "resume", "firstname");
				НоваяЗапись.Отчество = ЗначениеСвойстваУзла(Отклик, "resume", "middlename");
				НоваяЗапись.Источник = Сайт;
				НоваяЗапись.ДатаОтклика = Дата(1970, 1, 1) + Отклик.events[0].date_event;
				НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
				Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Отклик, "resume", "birthyear")) 
					И ЗначениеЗаполнено(ЗначениеСвойстваУзла(Отклик, "resume", "birthmonth")) 
					И ЗначениеЗаполнено(ЗначениеСвойстваУзла(Отклик, "resume", "birthday")) Тогда
					
					НоваяЗапись.ДатаРождения = Дата(ЗначениеСвойстваУзла(Отклик, "resume", "birthyear"), ЗначениеСвойстваУзла(Отклик, "resume", "birthmonth"), ЗначениеСвойстваУзла(Отклик, "resume", "birthday"));
				КонецЕсли;
				НоваяЗапись.Адрес = ЗначениеСвойстваУзла(Отклик, "resume", "town", "title");
				НоваяЗапись.Телефон = ЗначениеСвойстваУзла(Отклик, "resume", "phone1");
				НоваяЗапись.EMail = ЗначениеСвойстваУзла(Отклик, "resume", "email");
				НоваяЗапись.АдресРезюме = СтрЗаменить(ЗначениеСвойстваУзла(Отклик, "resume", "link"), "\", "");
				
				СопроводительноеПисьмо = ЗначениеСвойстваУзла(Отклик, "cover_letter");
				Если ТипЗнч(СопроводительноеПисьмо) = Тип("Массив") 
					И ЗначениеЗаполнено(СопроводительноеПисьмо) Тогда
					НоваяЗапись.Сообщение = РекрутинговыеСайтыСлужебный.УдалитьЛишнееИзСтроки(СопроводительноеПисьмо[0]);
				КонецЕсли;
				
				ЗагруженныеОткликиВакансии.Добавить(ИдентификаторРезюме);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Отклики, Пользователь);
	
КонецПроцедуры

Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме);
	
	Возврат ДоступностьКонтактов;
	
КонецФункции

Процедура ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме) Экспорт
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("МестоПубликации", Сайт);
	ОтборСтрок.Вставить("ИмяПоля", "id");
	
	НайденныеСтроки = ДанныеРезюме.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторРезюме = НайденныеСтроки[0].СодержимоеПоля;
	
	Комментарии = КомментарииКандидата(ИдентификаторРезюме, Кандидат);
	
	РекрутинговыеСайтыСлужебный.ЗаписатьТаблицуКомментариевКандидата(Комментарии, Кандидат, Сайт);
	
КонецПроцедуры

Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если КодСостояния = 403 Тогда
		Если СтрНайти(ОписаниеОшибки, "wrong_tariff") <> 0 Тогда
			Возврат НСтр("ru = 'Проверьте тариф.'");
		ИначеЕсли СтрНайти(ОписаниеОшибки, "closed") <> 0 Тогда
			Возврат НСтр("ru = 'Резюме закрыто соискателем.'");
		КонецЕсли;
	КонецЕсли;
	
	ИнформацияОбОшибках = ПарсерJSON(ОписаниеОшибки);
	
	Если ТипЗнч(ИнформацияОбОшибках) = Тип("Структура") И ИнформацияОбОшибках.Свойство("error") Тогда
		Если ТипЗнч(ИнформацияОбОшибках.error) = Тип("Структура") Тогда
			Если ТипЗнч(ИнформацияОбОшибках.error.message) = Тип("Строка") Тогда
				УточненноеОписаниеОшибки = ИнформацияОбОшибках.error.message;
			Иначе
				Для Каждого ПолеИОшибкиЗаполнения Из ИнформацияОбОшибках.error.message Цикл
					ИмяПоля = ПолеИОшибкиЗаполнения.Ключ;
					ОшибкиЗаполнения = ПолеИОшибкиЗаполнения.Значение;
					
					Поле = РекрутинговыеСайтыСлужебный.ПредставлениеПоля(Сайт, ЭтотОбъект, ИмяПоля);
					УточненноеОписаниеОшибки = УточненноеОписаниеОшибки
					+ ?(ЗначениеЗаполнено(УточненноеОписаниеОшибки), Символы.ПС, "")
					+ РекрутинговыеСайтыСлужебный.ОписаниеНезаполненногоПоля(Поле, ОшибкиЗаполнения[0]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

// Параметры:
//  ДанныеДляОтправки - См. РекрутинговыеСайтыСлужебный.ДанныеДляОтправкиОбратнойСвязи
// 
// Возвращаемое значение:
//  Булево - Отправка прошла успешно
Функция ОтправитьОбратнуюСвязьПоОтклику(ДанныеДляОтправки) Экспорт
	
	Результат = Ложь;
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(ДанныеДляОтправки.Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		ТекстОшибки = НСтр("ru = 'Вакансия не опубликована.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		ТекстОшибки = НСтр("ru = 'Не настроен доступ к сайту.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось установить соединение с сайтом.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		Запрос = НовыйHTTPЗапрос("/2.0/resumes/received/" + ИдентификаторВакансии + "/");
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось получить отклики.'");
			РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
				Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
			Возврат Результат;
		Иначе
			ОткликиССайта = ПрочитатьОтветОтклики(РезультатЗапроса);
		КонецЕсли;
		
		Действие = ?(ДанныеДляОтправки.Отклонить, "reject", "invite");
		
		Для Каждого Отклик Из ОткликиССайта.objects Цикл
			Если Отклик = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Отклик, "resume", "id"), "ЧГ=0");
			
			Если СтрНайти(ДанныеДляОтправки.АдресРезюме, ИдентификаторРезюме) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Запрос = НовыйHTTPЗапрос(СтрШаблон("/2.0/hr/resumes/%1/%2/", ИдентификаторРезюме, Действие));
			
			Тело = СтрШаблон("id_template=1&mail_body=%1",
				КодироватьСтроку(ДанныеДляОтправки.Сообщение, СпособКодированияСтроки.КодировкаURL));
			
			Запрос.УстановитьТелоИзСтроки(Тело);
			
			РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
			
			Если РезультатЗапроса.КодСостояния = 200 Тогда
				Результат = Истина;
				Прервать;
			Иначе
				ТекстОшибки = НСтр("ru = 'Не удалось отправить обратную связь.'");
				РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
					Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
				Возврат Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	УстановитьПривилегированныйРежим(Истина);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Пользователь, "ПарольSuperJob");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

// Параметры:
//  Обновление - Булево
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
// Структура: см. РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров
Функция СтруктураМаркеров(Обновление = Ложь, Показыватьпредупреждение = Истина)
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	Контекст = "Обработки.ИнтеграцияSuperJob.СтруктураМаркеров";
	
	ID_Программы = ID_ПрограммыSuperJob();
	Пароль_Программы = ПарольПрограммыSuperJob();
	
	Если Обновление Тогда
		СтрокаЗапроса = СтрШаблон("/2.0/oauth2/refresh_token/?refresh_token=%1&client_id=%2&client_secret=%3",
					МаркерОбновления, ID_Программы, Пароль_Программы);
	Иначе
		СтрокаЗапроса = СтрШаблон("/2.0/oauth2/password/?login=%1&password=%2&client_id=%3&client_secret=%4&hr=1",
					ИмяПользователя, Пароль, ID_Программы, Пароль_Программы);
	КонецЕсли;
	
	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера(), Истина);
	
	ЗаголовкиHTTP = Новый Соответствие();
	ЗаголовкиHTTP.Вставить("X-User-Type", " hr_user");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовкиHTTP);
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	// Отрабатываем редирект.
	Если РезультатЗапроса.КодСостояния >= 300 И РезультатЗапроса.КодСостояния <= 308 Тогда
		// Проверим обязательные заголовки ответа.
		ТекстСообщения = НСтр("ru = 'В ответе сервера SuperJob с кодом %1 отсутствует обязательный заголовок %2'");
		ОбщегоНазначенияКлиентСервер.Проверить(РезультатЗапроса.Ответ.Заголовки["Set-Cookie"] <> Неопределено, 
			СтрШаблон(ТекстСообщения, РезультатЗапроса.Ответ.КодСостояния, "Set-Cookie"), Контекст);
		ОбщегоНазначенияКлиентСервер.Проверить(РезультатЗапроса.Ответ.Заголовки["Location"] <> Неопределено, 
			СтрШаблон(ТекстСообщения, РезультатЗапроса.Ответ.КодСостояния, "Location"), Контекст);
		// Уточним заголовки нового запроса.
		ЗаголовкиHTTP.Вставить("Cookie", РезультатЗапроса.Ответ.Заголовки["Set-Cookie"]);
		
		Запрос = Новый HTTPЗапрос(РезультатЗапроса.Ответ.Заголовки["Location"], ЗаголовкиHTTP);
		
		РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
			СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	КонецЕсли;
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
	
	СтруктураМаркеров.МаркерДоступа = ОтветОбъект.access_token;
	СтруктураМаркеров.МаркерОбновления = ОтветОбъект.refresh_token;
	СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = ТекущаяДатаСеанса() + ОтветОбъект.expires_in;
	
	МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
	МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
	ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен(Показыватьпредупреждение = Истина)
	
	МаркерДействителен = ЗначениеЗаполнено(МаркерДоступа) 
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	МаркерАктивен = Ложь;
		
	Если МаркерДействителен Тогда
		МаркерАктивен = СайтДоступен(Показыватьпредупреждение);
	КонецЕсли;
		
	Если Не МаркерАктивен И ЗначениеЗаполнено(МаркерОбновления) Тогда
		РезультатОбновления = ОбновитьМаркеры(Показыватьпредупреждение);
		Если ЗначениеЗаполнено(РезультатОбновления.МаркерДоступа) Тогда
			МаркерАктивен = Истина;
			РезультатОбновления.Пользователь = Пользователь;
			РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизации(РезультатОбновления);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МаркерАктивен;
	
КонецФункции

Функция СайтДоступен(Показыватьпредупреждение = Истина)
	
	Возврат ЗначениеЗаполнено(ИнформацияОПользователе(Показыватьпредупреждение).ИмяПользователя);
	
КонецФункции

Функция ОбновитьМаркеры(Показыватьпредупреждение = Истина)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	Результат.Сайт = Сайт;
	Результат.Пользователь = Пользователь;
	
	СтруктураМаркеров = СтруктураМаркеров(Истина, Показыватьпредупреждение);
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе= ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("X-Api-App-Id", ПарольПрограммыSuperJob());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция АдресСервера()
	
	Возврат ДанныеСайта.АдресЗапроса;
	
КонецФункции

Функция АдресСайта()
	
	Возврат ДанныеСайта.ИмяСайта;
	
КонецФункции

Функция КлассификаторыСайта()
	
	Возврат ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("Классификаторы" + ДанныеСайта.Имя);
	
КонецФункции

Функция ID_ПрограммыSuperJob()
	Возврат "281";	
КонецФункции

Функция ПарольПрограммыSuperJob()
	Возврат "v1.h002a1c6e8b6cd8456fa1db3922371bc1025a152965d380b4a97304e42cf37eba4ad90f7b.f3523790948436b2d9d94e9d09955cf01468db5e";
КонецФункции

Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветПубликацияВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветКонтактыРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОткрытоеРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветАвторыКомментариев(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветВакансииССайта(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветОтклики(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветСтруктураРезюме(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПрочитатьОтветКомментарииКандидата(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	
	Возврат РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

Функция СтруктураДанныхSuperJob()
	
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("id", "");
	СтруктураДанных.Вставить("title", "");
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция СтрокаОтбора(СтруктураОтбора, НомерСтраницы)
	
	СтрокаОтбора = "";
	
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = КлючИЗначение.Значение;
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Значение = Значение;
		ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
			Значение = Формат(Значение, "ЧГ=0");
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
			Значение = Формат(Значение, "ДЛФ=Д");
		ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
			Если КлючИЗначение.Ключ = "ТолькоВНазвании" И Значение Тогда
				СтрокаОтбора = СтрокаОтбора + "keywords[0][keys]=" + СтруктураОтбора.КлючевоеСлово + "&keywords[0][skwc]=and&keywords[0][srws]=60&";
				Продолжить;
			КонецЕсли;
			Если КлючИЗначение.Ключ = "СкрыватьРезюмеБезЗарплаты" И Значение Тогда
				СтрокаОтбора = СтрокаОтбора + "payment_no_agreement=1&";
				Продолжить;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
			
			Если КлючИЗначение.Ключ = "Регион" Тогда
				Индекс = 0;
				
				Для Каждого ЭлементСписка Из Значение Цикл
					Идентификатор = "";
					
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
						Если Не ЭлементСписка.Значение.Свойство("IDSuperJob", Идентификатор) Тогда
							Продолжить;
						КонецЕсли;
					Иначе
						Идентификатор = ЭлементСписка.Значение;
					КонецЕсли;
					
					СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ) + "[" + Индекс + "]", Формат(Идентификатор, "ЧГ=0"));
					Индекс = Индекс + 1;
				КонецЦикла;
				
			Иначе
				
				Для Каждого ЭлементСписка Из Значение Цикл
					Идентификатор = "";
					
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
						Если Не ЭлементСписка.Значение.Свойство("IDSuperJob", Идентификатор) Тогда
							Продолжить;
						КонецЕсли;
					Иначе
						Идентификатор = ЭлементСписка.Значение;
					КонецЕсли;
					
					СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), СтрЗаменить(Строка(Идентификатор), "Ключ", ""));
				КонецЦикла;
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если КлючИЗначение.Ключ = "КлючевоеСлово" Тогда
			Если Не СтруктураОтбора.ТолькоВНазвании Тогда
				СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), СтрЗаменить(Значение, "Ключ", ""));
			КонецЕсли;
		Иначе
			СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), СтрЗаменить(Значение, "Ключ", ""));
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокаОтбора = СтрокаОтбора + "order_field=rank&count=50&page=" + НомерСтраницы;
	
	Возврат СтрокаОтбора;
	
КонецФункции

Функция СоответствиеПолейПоискаКандидатов()
	
	СоответствиеПолейПоиска = Новый Соответствие;
	
	СоответствиеПолейПоиска.Вставить("КлючевоеСлово", "keyword");
	СоответствиеПолейПоиска.Вставить("ВозрастОт", "age_from");
	СоответствиеПолейПоиска.Вставить("ВозрастДо", "age_to");
	СоответствиеПолейПоиска.Вставить("Регион", "t");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыОт", "payment_from");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыДо", "payment_to");
	СоответствиеПолейПоиска.Вставить("Пол", "gender");
	СоответствиеПолейПоиска.Вставить("УровеньОбразования", "education");
	СоответствиеПолейПоиска.Вставить("ПериодРазмещения", "period");
	
	Возврат СоответствиеПолейПоиска;
	
КонецФункции

Процедура ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки)
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	Для Каждого Резюме Из РезультатПоискаРезюме.objects Цикл
		
		Если Резюме = Неопределено 
			Или ТипЗнч(Резюме) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
		НоваяСтрока.ИдентификаторРезюме = Формат(ЗначениеСвойстваУзла(Резюме, "id"), "ЧГ=0");
		
		Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "firstname")) 
			И ИнформацияОПользователе.БезлимитныйТариф Тогда
			
			ОткрытоеРезюме = ОткрытоеРезюме(НоваяСтрока.ИдентификаторРезюме);
			Резюме = ?(ОткрытоеРезюме <> Неопределено, ОткрытоеРезюме, Резюме);
			
		КонецЕсли;
		
		ФИО = "" + ЗначениеСвойстваУзла(Резюме, "lastname") + " " + ЗначениеСвойстваУзла(Резюме, "firstname") + " " + ЗначениеСвойстваУзла(Резюме, "middlename");
		
		НоваяСтрока.ФИО = ?(ЗначениеЗаполнено(ФИО), СокрЛП(ФИО), "-");
		НоваяСтрока.НазваниеРезюме = ЗначениеСвойстваУзла(Резюме, "profession");
		НоваяСтрока.Регион = ЗначениеСвойстваУзла(Резюме, "town", "title", , "-");
		НоваяСтрока.ГдеНайден = Сайт;
		НоваяСтрока.УровеньЗарплаты = "" + ЗначениеСвойстваУзла(Резюме, "payment") + " " + ЗначениеСвойстваУзла(Резюме, "currency");
		Если Не ЗначениеЗаполнено(НоваяСтрока.УровеньЗарплаты) Тогда
			НоваяСтрока.УровеньЗарплаты = "-";
		КонецЕсли;
		Возраст = ЗначениеСвойстваУзла(Резюме, "age");
		Если ЗначениеЗаполнено(Возраст) Тогда
			НоваяСтрока.Возраст = Число(Возраст);
		Иначе
			НоваяСтрока.Возраст = "-";
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "date_published")) Тогда
			НоваяСтрока.ДатаРазмещения = Дата(1970, 1, 1) + ЗначениеСвойстваУзла(Резюме, "date_published");
		ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "date_last_modified")) Тогда
			НоваяСтрока.ДатаРазмещения = Дата(1970, 1, 1) + ЗначениеСвойстваУзла(Резюме, "date_last_modified");
		КонецЕсли;
		НоваяСтрока.СсылкаНаРезюме = СтрЗаменить(ЗначениеСвойстваУзла(Резюме, "link"), "\", "");
		МестаРаботы = ЗначениеСвойстваУзла(Резюме, "work_history");
		Если ЗначениеЗаполнено(МестаРаботы) 
			И МестаРаботы.Количество() > 0 Тогда
			ПоследнееМестоРаботы = МестаРаботы[0];
			
			Если ПоследнееМестоРаботы = Неопределено 
				Или ПоследнееМестоРаботы = "null" Тогда
				Продолжить;
			КонецЕсли;
			
			ГодНачала = ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "yearbeg");
			МесяцНачала = ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "monthbeg");
			ДатаНачала = "" + ?(ЗначениеЗаполнено(ГодНачала), Формат(ГодНачала, "ЧГ=0"), "0001") + ?(ЗначениеЗаполнено(МесяцНачала), ?(Число(МесяцНачала) < 10, "0" + МесяцНачала, МесяцНачала), "01") + "01";
			
			ГодОкончания = ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "yearend");
			МесяцОкончания = ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "monthend");
			ДатаОкончания = "" + ?(ЗначениеЗаполнено(ГодОкончания), Формат(ГодОкончания, "ЧГ=0"), "0001") + ?(ЗначениеЗаполнено(МесяцОкончания), ?(Число(МесяцОкончания) < 10, "0" + МесяцОкончания, МесяцОкончания), "01") + "01";
			
			Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "name"))
				И ЗначениеЗаполнено(ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "profession")) Тогда
				
				НоваяСтрока.ПоследнееМестоРаботы = СтрШаблон(НСтр("ru = '%1, %2 с %3 по %4'"),
					ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "name"),
					ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "profession"),
					Формат(Дата(ДатаНачала), "ДЛФ=Д"),
					?(ЗначениеЗаполнено(Дата(ДатаОкончания)),
						Формат(Дата(ДатаОкончания), "ДЛФ=Д"),
						НСтр("ru = 'настоящее время'")));
			КонецЕсли;
		КонецЕсли;
		
		Пол = "-";
		Если Строка(ЗначениеСвойстваУзла(Резюме, "gender", "id")) = "2" Тогда
			Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Строка(ЗначениеСвойстваУзла(Резюме, "gender", "id")) = "3" Тогда
			Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
		
		НоваяСтрока.Пол = Пол;
		НоваяСтрока.ПолеСортировки = ПолеСортировки;
		
		ПолеСортировки = ПолеСортировки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОткрытоеРезюме(ИдентификаторРезюме)
	
	Резюме = Неопределено;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/2.0/hr/resumes/%1/open/", ИдентификаторРезюме));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Результат = ПрочитатьОтветОткрытоеРезюме(РезультатЗапроса);
		
		Если Результат.status Тогда
			Резюме = Результат.resume;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Резюме;
	
КонецФункции

Функция ЗаполнитьДеревоРегионов(Дерево)
	
	Результат = Ложь;
	
	КлассификаторыSuperJob = КлассификаторыСайта();
	
	Если КлассификаторыSuperJob = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Страны = КлассификаторыSuperJob.towns;
	
	Для Каждого Страна Из Страны Цикл
		
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Идентификатор = Формат(Страна.id, "ЧГ=0");
		НоваяСтрока.Значение = Страна.title;
		
		Если Страна.Свойство("regions") 
			И Страна.regions.Количество() > 0 Тогда 
			
			Для Каждого Регион Из Страна.regions Цикл
				
				НоваяПодчиненнаяСтрока = НоваяСтрока.Строки.Добавить();
				НоваяПодчиненнаяСтрока.Идентификатор = Регион.id;
				НоваяПодчиненнаяСтрока.Значение = Регион.title;
				
				Если Регион.Свойство("towns") 
					И Регион.towns.Количество() > 0 Тогда 
					
					Для Каждого Город Из Регион.towns Цикл
						
						НоваяПодчиненнаяСтрокаВторогоУровня = НоваяПодчиненнаяСтрока.Строки.Добавить();
						НоваяПодчиненнаяСтрокаВторогоУровня.Идентификатор = Формат(Город.id, "ЧГ=0");
						НоваяПодчиненнаяСтрокаВторогоУровня.Значение = Город.title;
						
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеКандидатаПоРезюме(СтруктураРезюме)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	ЗаполнитьДоступностьКонтактов(ДанныеКандидата.ДоступностьКонтактов, СтруктураРезюме);
	Если ДанныеКандидата.ДоступностьКонтактов.КонтактыОткрыты Тогда
		ДанныеКандидата.Фамилия = ЗначениеСвойстваУзла(СтруктураРезюме, "lastname");
		ДанныеКандидата.Имя = ЗначениеСвойстваУзла(СтруктураРезюме, "firstname");
		ДанныеКандидата.Отчество = ЗначениеСвойстваУзла(СтруктураРезюме, "middlename");
		ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, ДанныеКандидата.КонтактнаяИнформация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "birthyear")) 
		И ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "birthmonth")) 
		И ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "birthday")) Тогда
		ДанныеКандидата.ДатаРождения = Дата(
			ЗначениеСвойстваУзла(СтруктураРезюме, "birthyear"), 
			ЗначениеСвойстваУзла(СтруктураРезюме, "birthmonth"), 
			ЗначениеСвойстваУзла(СтруктураРезюме, "birthday"));
	КонецЕсли;
		
	Если Не СтруктураРезюме.agreement Тогда
		ДанныеКандидата.ОжидаемыйДоход = ЗначениеСвойстваУзла(СтруктураРезюме, "payment");
		ДанныеКандидата.ВалютаДохода = ПодборПерсонала.ВалютаПоСправочнику(
			ЗначениеСвойстваУзла(СтруктураРезюме, "currency"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "gender")) Тогда
		Если Строка(ЗначениеСвойстваУзла(СтруктураРезюме, "gender", "id")) = "2" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли Строка(ЗначениеСвойстваУзла(СтруктураРезюме, "gender", "id")) = "3" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "citizenship")) Тогда
		СтруктураГражданство = Новый Структура("Страна, Дата");
		СтруктураГражданство.Страна = ЗначениеСвойстваУзла(СтруктураРезюме, "citizenship", "title");
		ДанныеКандидата.Гражданство.Добавить(СтруктураГражданство);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "maritalstatus")) Тогда
		СтруктураСостояниеВБраке = Новый Структура("СостояниеВБраке, Дата");
		СтруктураСостояниеВБраке.СостояниеВБраке = ЗначениеСвойстваУзла(СтруктураРезюме, "maritalstatus", "title");
		ДанныеКандидата.СостояниеВБраке.Добавить(СтруктураСостояниеВБраке);
	КонецЕсли;
	
	ЗаполнитьМассивОбразование(СтруктураРезюме, ДанныеКандидата.Образование);
	
	Для Каждого ТрудоваяДеятельность Из ЗначениеСвойстваУзла(СтруктураРезюме, "work_history") Цикл
		Если ТрудоваяДеятельность = Неопределено Или ТрудоваяДеятельность = "null" Тогда
			Продолжить;
		КонецЕсли;
		СтруктураТД = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
		СтруктураТД.Компания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "name");
		СтруктураТД.Должность = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "profession");
		ГодНачала = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "yearbeg");
		МесяцНачала = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "monthbeg");
		МесяцНачалаСтрокой = ?(ЗначениеЗаполнено(ГодНачала), Формат(ГодНачала, "ЧГ=0"), "0001") 
			+ ?(ЗначениеЗаполнено(МесяцНачала), ?(Число(МесяцНачала) < 10, "0" + МесяцНачала, МесяцНачала), "01") + "01";
		СтруктураТД.ДатаНачала = РекрутинговыеСайтыСлужебный.МесяцСтрокойВДату(МесяцНачалаСтрокой);
		ГодОкончания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "yearend");
		МесяцОкончания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "monthend");
		МесяцОкончанияСтрокой = ?(ЗначениеЗаполнено(ГодОкончания), Формат(ГодОкончания, "ЧГ=0"), "0001") 
			+ ?(ЗначениеЗаполнено(МесяцОкончания), ?(Число(МесяцОкончания) < 10, "0" + МесяцОкончания, МесяцОкончания), "01") + "01";
		СтруктураТД.ДатаОкончания = РекрутинговыеСайтыСлужебный.МесяцСтрокойВДату(МесяцОкончанияСтрокой);
		СтруктураТД.Обязанности = РекрутинговыеСайтыСлужебный.УдалитьЛишнееИзСтроки(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "work"));
		СтруктураТД.СфераДеятельностиКомпании = "";
		ДанныеКандидата.ТрудоваяДеятельность.Добавить(СтруктураТД);
	КонецЦикла;
	
	Если СтруктураРезюме.Свойство("languages") Тогда
		Для Каждого ЗнаниеЯзыка Из ЗначениеСвойстваУзла(СтруктураРезюме, "languages") Цикл
			Если Не ЗначениеЗаполнено(ЗнаниеЯзыка) Тогда
				Продолжить;
			КонецЕсли;
			Если ЗнаниеЯзыка.Количество() = 2 Тогда
				СтруктураЗнаниеЯзыков = РекрутинговыеСайтыСлужебный.НовоеЗнаниеЯзыка();
				СтруктураЗнаниеЯзыков.Язык = ЗнаниеЯзыка[0].title;
				СтруктураЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата =
					СтепеньЗнанияЯзыкаПоИдентификатору(ЗнаниеЯзыка[1].id);
				ДанныеКандидата.ЗнаниеЯзыков.Добавить(СтруктураЗнаниеЯзыков);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДанныеКандидата.ИсточникИнформации = Сайт;
	ДанныеКандидата.АдресРезюме = СтрЗаменить(ЗначениеСвойстваУзла(СтруктураРезюме, "link"), "\", "");
	
	Если СтруктураРезюме.Свойство("Фото") Тогда
		ДанныеКандидата.Фото = ЗначениеСвойстваУзла(СтруктураРезюме, "Фото");
	КонецЕсли;
	
	ДанныеКандидата.Комментарии = СтруктураРезюме["Комментарии"];
	ДанныеКандидата.НазваниеРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "profession");
	
	ОСебе = ЗначениеСвойстваУзла(СтруктураРезюме, "additional_info");
	РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(ОСебе);
	Достижения = ЗначениеСвойстваУзла(СтруктураРезюме, "achievements");
	РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(Достижения);
	
	ИнформацияОСебе = ОСебе + ?(ЗначениеЗаполнено(Достижения), Символы.ПС, "") + Достижения;
	Если ЗначениеЗаполнено(ИнформацияОСебе) Тогда
		ДанныеКандидата.ОСебе = ИнформацияОСебе;
	КонецЕсли;
	
	Возврат ДанныеКандидата;
	
КонецФункции

Функция СтруктураРезюмеССайта(ИдентификаторРезюме)
	
	Резюме = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/2.0/resumes/" + ИдентификаторРезюме + "/");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоОписанию(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Резюме = ПрочитатьОтветСтруктураРезюме(РезультатЗапроса);
	
	Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "firstname"))
		Или (Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "phone1"))
			И Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "email"))) Тогда
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		Если ИнформацияОПользователе.БезлимитныйТариф Тогда
			ОткрытоеРезюме = ОткрытоеРезюме(ИдентификаторРезюме);
			Резюме = ?(ОткрытоеРезюме <> Неопределено, ОткрытоеРезюме, Резюме);
		КонецЕсли;
		
	КонецЕсли;
	
	КомментарииКандидата = МассивКомментариевКандидата(ИдентификаторРезюме);
	Резюме.Вставить("Комментарии", КомментарииКандидата);
	
	Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "photo")) Тогда
		Возврат Резюме;
	КонецЕсли;
	
	АдресФото = СтрЗаменить(Резюме.photo, "\", "");
	Резюме.Вставить("Фото", РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресФото));
	
	Возврат Резюме;
	
КонецФункции

Процедура ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме)
	
	Если ЗначениеСвойстваУзла(СтруктураРезюме, "contacts_bought") Тогда
		Возврат;
	КонецЕсли;
		
	ДоступностьКонтактов.КонтактыОткрыты = Ложь;
	ДоступностьКонтактов.КонтактыМожноОткрытьПоАдресу = 
		СтрШаблон("hr/resumes/%1/buy/", Формат(СтруктураРезюме.id, "ЧГ=;"));
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформации(СтруктураРезюме, МассивКИ)
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "phone1")) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = СтруктураРезюме.phone1;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "phone2")) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = СтруктураРезюме.phone2;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "email")) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = СтруктураРезюме.email;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "town")) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = СтруктураРезюме.town.title;
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
КонецПроцедуры

Функция СтепеньЗнанияЯзыкаПоИдентификатору(Идентификатор) 
	
	Если Строка(Идентификатор) = "3" Тогда // базовый
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли Строка(Идентификатор) = "5" Тогда // технический
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B1;
	ИначеЕсли Строка(Идентификатор) = "7" Тогда // разговорный
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C1;
	ИначеЕсли Строка(Идентификатор) = "9" Тогда // свободно владею	
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C2;
	Иначе
		УровеньВладенияЯзыком = Неопределено;
	КонецЕсли;
	
	Если УровеньВладенияЯзыком = Неопределено Тогда
		СтепеньЗнанияЯзыка = Справочники.СтепениЗнанияЯзыкаКандидата.ПустаяСсылка();
	Иначе
		СтепеньЗнанияЯзыка = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			УровеньВладенияЯзыком);
	КонецЕсли;
	
	Возврат СтепеньЗнанияЯзыка;
	
КонецФункции

Функция МассивКомментариевКандидата(ИдентификаторРезюме, Кандидат = Неопределено)
	
	КомментарииТаблица = КомментарииКандидата(ИдентификаторРезюме, Кандидат);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(КомментарииТаблица);
	
КонецФункции

Функция КомментарииКандидата(ИдентификаторРезюме, Кандидат = Неопределено)
	
	Комментарии = РекрутинговыеСайтыСлужебный.ТаблицаКомментарииКандидатов();
	
	Если Не УстановитьСоединение() Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	ТекстЗапроса = "/2.0/hr/resumes/" + ИдентификаторРезюме + "/comments/";
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	КоллекцияКомментариев = ПрочитатьОтветКомментарииКандидата(РезультатЗапроса);
	
	Если КоллекцияКомментариев["objects"] = Неопределено Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	Для Каждого ОписаниеКомментария Из КоллекцияКомментариев["objects"] Цикл
		НоваяСтрока = Комментарии.Добавить();
		НоваяСтрока.Период = МестноеВремя(ДатаПоСтроке(ОписаниеКомментария["date"]), ЧасовойПояс());
		НоваяСтрока.Идентификатор = Формат(ОписаниеКомментария["id"], "ЧГ=");
		НоваяСтрока.Комментарий = ОписаниеКомментария["text"];
		НоваяСтрока.Автор = ОписаниеКомментария["author"];
		Если Не ЗначениеЗаполнено(ОписаниеКомментария["author"]) Тогда
			НоваяСтрока.ПринадлежитАвторизованномуПользователю = Истина;
		КонецЕсли;
		НоваяСтрока.МестоПубликации = Сайт;
	КонецЦикла;
	
	Если Не РекрутинговыеСайтыСлужебный.ЕстьИзмененияКомментариев(Кандидат, Сайт, Комментарии) Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	ПодобратьПользователейПоАвторамКомментариев(Комментарии);
	
	Возврат Комментарии;
	
КонецФункции

Функция ДатаПоСтроке(СтрокаJSON)
	
	Возврат Дата(1970, 1, 1) + Число(СтрокаJSON);
	
КонецФункции

Процедура ПодобратьПользователейПоАвторамКомментариев(Комментарии)
	
	ОтборСтрок = Новый Структура("ПринадлежитАвторизованномуПользователю");
	ОтборСтрок.ПринадлежитАвторизованномуПользователю = Ложь;
	
	НайденныеСтроки = Комментарии.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		// Все комментарии принадлежат текущему пользователю.
		Комментарии.ЗаполнитьЗначения(Пользователи.АвторизованныйПользователь(), "Пользователь");
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	АвторыКомментариев = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "Автор", Истина);
	
	Запрос = НовыйHTTPЗапрос("/2.0/user/list/");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос, Ложь);
	
	ОтветЗапроса = ПрочитатьОтветАвторыКомментариев(РезультатЗапроса);
	
	АдресаАвторов = РекрутинговыеСайтыСлужебный.НоваяТаблицаАдресаАвторов();
	Для Каждого КлючИЗначение Из ОтветЗапроса["objects"] Цикл
		ОписаниеМенеджера = КлючИЗначение.Значение;
		ИмяАвтора = ОписаниеМенеджера["firstname"] + " " + ОписаниеМенеджера["lastname"];
		Если АвторыКомментариев.Найти(ИмяАвтора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = АдресаАвторов.Добавить();
		НоваяСтрока.ИмяАвтора = ИмяАвтора;
		НоваяСтрока.АдресПочты = ОписаниеМенеджера["email"];
	КонецЦикла;
	
	ПользователиПоАвторам = РекрутинговыеСайтыСлужебный.ПользователиПоАвторам(АдресаАвторов);
	
	Для Каждого Строка Из Комментарии Цикл
		Если Строка.ПринадлежитАвторизованномуПользователю = Истина Тогда
			Строка.Пользователь = Пользователи.АвторизованныйПользователь();
			Продолжить;
		КонецЕсли;
		Пользователь = ПользователиПоАвторам[Строка.Автор];
		Если Пользователь <> Неопределено Тогда
			Строка.Пользователь = Пользователь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПоляВакансии

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("type_of_work");
	Поля.Добавить("place_of_work");
	Поля.Добавить("education");
	Поля.Добавить("experience");
	Поля.Добавить("maritalstatus");
	Поля.Добавить("children");
	Поля.Добавить("id_language");
	Поля.Добавить("level");
	Поля.Добавить("gender");
	Поля.Добавить("id_user");
	Поля.Добавить("resumesubscription_kwc");
	Поля.Добавить("resumesubscription_rws");
	Поля.Добавить("published");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("town.id");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСоСпециальнойФормойРедактированияСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("phones");
	Поля.Добавить("languages");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМногострочнымВводом()
	
	Поля = Новый Массив;
	Поля.Добавить("work");
	Поля.Добавить("compensation");
	Поля.Добавить("candidat");
	Поля.Добавить("firm_activity");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("driving_licence");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

Функция ОписаниеПубликацииВакансии(ИдентификаторВакансии, СообщатьОбОшибке = Истина)
	
	ОписаниеПубликации = Неопределено;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/2.0/vacancies/%1/", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если СообщатьОбОшибке Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	Иначе
		ОписаниеПубликации = ПрочитатьОтветПубликацияВакансии(РезультатЗапроса);
	КонецЕсли;
	
	Возврат ОписаниеПубликации;
	
КонецФункции

Процедура ЗаполнитьМассивОбразование(СтруктураРезюме, МассивОбразование)
	
	УровеньДопОбразования = Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование;
	ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации;
	
	Для Каждого Образование Из СтруктураРезюме.base_education_history Цикл
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Образование, "institute")) Тогда
			СтруктураОбразование.УчебноеЗаведение = ЗначениеСвойстваУзла(Образование, "institute", "title");
		КонецЕсли;
		
		СтруктураОбразование.Факультет = Образование.faculty;
		СтруктураОбразование.Специальность = Образование.profession;
		СтруктураОбразование.Окончание = Образование.yearend;
		
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Образование, "education_type")) Тогда
			СтруктураОбразование.ВидОбразования = ВидОбразованияПоИдентификатору(ЗначениеСвойстваУзла(Образование, "education_type", "id"));
		КонецЕсли;
		
		МассивОбразование.Добавить(СтруктураОбразование);
	КонецЦикла;
	
	Для Каждого ДопОбразование Из СтруктураРезюме.education_history Цикл
		Если Не ЗначениеЗаполнено(ДопОбразование) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		СтруктураОбразование.УчебноеЗаведение = ДопОбразование.institute;
		СтруктураОбразование.НаименованиеКурса = ДопОбразование.name;
		СтруктураОбразование.Окончание = ДопОбразование.yearend;
		СтруктураОбразование.ВидОбразования = УровеньДопОбразования;
		СтруктураОбразование.ВидДополнительногоОбучения = ВидДополнительногоОбучения;
		
		МассивОбразование.Добавить(СтруктураОбразование);
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОбразованияПоИдентификатору(Идентификатор)
	
	ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ПустаяСсылка");
	
	Если Идентификатор = 2 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
	ИначеЕсли Идентификатор = 3 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование");
	ИначеЕсли Идентификатор = 4 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
	ИначеЕсли Идентификатор = 5 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование");
	ИначеЕсли Идентификатор = 6 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ОсновноеОбщееОбразование");
	ИначеЕсли Идентификатор = 7 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат");
	ИначеЕсли Идентификатор = 8 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура");
	ИначеЕсли Идентификатор = 9 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура");
	ИначеЕсли Идентификатор = 10 Тогда
		ВидОбразования = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.Докторантура");
	КонецЕсли;

	Возврат ВидОбразования;
	
КонецФункции

Функция JSONОписаниеВакансии(Дерево)
	
	ОписаниеВакансииДляПубликацииSuperJob = "";
	ПоляСМногострочнымВводом = ПоляВакансииСМногострочнымВводом();
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
	
		Если ТипЗнч(СтрокаДерева.Показатель) = Тип("СправочникСсылка.Вакансии") Тогда
			Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) Тогда
					Продолжить;
				КонецЕсли;
				
				ИмяПоля = СтрокаДереваПодчиненная.Путь;
				Если ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("Строка") Тогда
					
					Если ПоляСМногострочнымВводом.Найти(ИмяПоля) <> Неопределено Тогда
						ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансииТекст;
					Иначе
						ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии;
					КонецЕсли;
					
					ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "=" + ЗначениеПоля + "&";
					
				ИначеЕсли ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("Число") Тогда
					ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "=" + Формат(СтрокаДереваПодчиненная.ПубликацияВакансии, "ЧГ=0") + "&";
				ИначеЕсли ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("Булево") Тогда
					ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "=" + ?(СтрокаДереваПодчиненная.ПубликацияВакансии = Истина, 1, 0) + "&";
				ИначеЕсли ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("СписокЗначений") Тогда
					
					Если СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта() Тогда
						
						Если ИмяПоля = "town.id" Тогда
							ИмяПоля = "town"
						КонецЕсли;
						
						ЗначениеОбъекта = СтрокаДереваПодчиненная.ПубликацияВакансии[0].Значение;
						Если ТипЗнч(ЗначениеОбъекта) = Тип("Число") Или ИмяПоля = "town"Тогда
							ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "=" + Формат(ЗначениеОбъекта) + "&";
						Иначе
							ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "=" + СтрЗаменить(ЗначениеОбъекта, "Ключ", "") + "&";
						КонецЕсли;
						
					ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоМассива() Тогда
						
						Индекс = 0;
						Для Каждого Элемент Из СтрокаДереваПодчиненная.ПубликацияВакансии Цикл
							
							Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
								ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "[" + Индекс + "]" + "=" + СтрЗаменить(Элемент.Значение, "Ключ", "") + "&";				
							ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
								
								Если ИмяПоля = "phones" Тогда
									
									Для Каждого ЭлементСтруктуры Из Элемент.Значение Цикл
										ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "[" + Индекс + "]" + "[" + ЭлементСтруктуры.Ключ + "]" + "=" + ЭлементСтруктуры.Значение + "&";					
									КонецЦикла;
									
								ИначеЕсли ИмяПоля = "languages" Тогда
									
									Для Каждого ЭлементСтруктуры Из Элемент.Значение Цикл
										ОписаниеВакансииДляПубликацииSuperJob = ОписаниеВакансииДляПубликацииSuperJob + ИмяПоля + "[" + Индекс + "]" + "[" + ЭлементСтруктуры.Ключ + "]" + "=" + СтрЗаменить(ЭлементСтруктуры.Значение.id, "Ключ", "") + "&";					
									КонецЦикла;
									
								КонецЕсли;
								
							КонецЕсли;
							
							Индекс = Индекс + 1;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ОписаниеВакансииДляПубликацииSuperJob) Тогда
		ОписаниеВакансииДляПубликацииSuperJob = Лев(ОписаниеВакансииДляПубликацииSuperJob, СтрДлина(ОписаниеВакансииДляПубликацииSuperJob) - 1);
	КонецЕсли;
	
	Возврат ОписаниеВакансииДляПубликацииSuperJob;
	
КонецФункции

#КонецОбласти

#КонецЕсли
