
#Область ПрограммныйИнтерфейс

// Формирует манифест конфигурации (используется для декларации информации о конфигурации
// другим компонентам сервиса).
//
// Возвращаемое значение:
//	ОбъектXDTO - {http://www.1c.ru/1cFresh/Application/Manifest/a.b.c.d}ApplicationInfo.
// 
Функция СформироватьМанифестКонфигурации() Экспорт
	
	Возврат МанифестКонфигурацииСлужебный.СформироватьМанифестКонфигурации();
	
КонецФункции

// Формирует манифест конфигурации, записывает его в файл и помещает двоичные данные файла во временное хранилище.
// Обертка над МанифестКонфигурации.СформироватьМанифестКонфигурации() для вызова из длительных
//  операций или из внешнего соединения.
//
// Параметры:
//  АдресХранилища - Строка - адрес во временном хранилище, по которому требуется поместить двоичные
//  	данные файла манифеста конфигурации.
//
Процедура ПоместитьМанифестКонфигурацииВоВременноеХранилище(Знач АдресХранилища) Экспорт
	
	МанифестКонфигурацииСлужебный.ПоместитьМанифестКонфигурацииВоВременноеХранилище(АдресХранилища);
	
КонецПроцедуры

#КонецОбласти