//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Видеоконференции.ИспользуемыеСервисы
Функция ИспользуемыеСервисы(ТолькоНастраиваемые) Экспорт
	
	ИспользуемыеСервисы = Новый Массив();
	
	ВидеоконференцииВнутренний.ЗаполнитьИспользуемыеСервисы(ИспользуемыеСервисы, ТолькоНастраиваемые);
	
	Возврат Новый ФиксированныйМассив(ИспользуемыеСервисы);
	
КонецФункции

// См. Видеоконференции.ДанныеСервисов
Функция ДанныеСервисов() Экспорт
	
	ДанныеСервисов = Новый Соответствие();
	
	ВидеоконференцииВнутренний.ЗаполнитьДанныеСервисов(ДанныеСервисов);
	
	Возврат Новый ФиксированноеСоответствие(ДанныеСервисов);
	
КонецФункции

#КонецОбласти

