
#Область ПрограммныйИнтерфейс

// Процедура-обработчик события "ПриЗаписи" регистра сведений РегистрСведений.ОтветыНаВопросыАнкет.
//
// Параметры:
//	НаборЗаписейРегистра	- РегистрСведенийНаборЗаписей - источник события.
//	Отказ					- Булево - флаг отказа от выполнения обработчика.
//	Замещение				- Булево - флаг замещения записей при записи.
Процедура ПересчитатьОценкиПоОпросу(НаборЗаписейРегистра, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписейРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Анкеты = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписейРегистра, Замещение, "Регистратор");
	Если Анкеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Анкеты[0], "Опрос") Тогда
		Возврат;
	КонецЕсли;
	
	Опросы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Анкеты, "Опрос");
	Для Каждого Анкета Из Анкеты Цикл
		Опрос = Опросы[Анкета];
		Если Не ЗначениеЗаполнено(Опрос) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокОпросов = СписокОпросовПоНазначению(Опрос);
		Для Каждого Опрос Из СписокОпросов Цикл
			Удаление = НаборЗаписейРегистра.Количество() = 0;
			ЭкспертнаяОценкаПерсонала.РассчитатьОценкиПоОтветам(Опрос, Анкета, Удаление);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик подписки на событие УстановитьИспользованиеЭкспертнойОценкиПерсонала
//
// Параметры:
//  Источник   - КонстантаМенеджерЗначения.ИспользоватьАнкетирование, КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений - источник события.
//  Отказ      - Булево - параметр, передаваемый в подписку на событие ПриЗаписи.
//
Процедура УстановитьИспользованиеЭкспертнойОценкиПерсоналаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Значение Тогда
		Возврат;
	КонецЕсли;

	Если Константы.ИспользоватьЭкспертнуюОценкуПерсонала.Получить() Тогда
		Константы.ИспользоватьЭкспертнуюОценкуПерсонала.Установить(Ложь);
		
		Если ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьАнкетирование") Тогда
			НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Анкетирования'");
		ИначеЕсли ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений") Тогда
			НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Шаблонов сообщений'");
		Иначе
			НаименованиеИсточникаРодительныйПадеж = "";
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Использование Экспертной оценки персонала невозможно без использования %1. Экспертная оценка так же была выключена.'"),
			НаименованиеИсточникаРодительныйПадеж);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СписокОпросовПоНазначению(НазначениеОпроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка КАК Опрос
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.НазначениеОпроса = &НазначениеОпроса";
	Запрос.УстановитьПараметр("НазначениеОпроса", НазначениеОпроса);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Опрос");
	
КонецФункции

#КонецОбласти 

