#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗадачиСДаннымиВХранилищеЗначений(Дата = Неопределено) Экспорт
	МассивЗадач = Новый Массив();   
	
	ДатаФормирования = ?(Не ЗначениеЗаполнено(Дата), Дата(2999,12,31), Дата);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаФормирования);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗадачаПоОбработкеДокумента.Ссылка КАК Задача,
	|	ЗадачаПоОбработкеДокумента.Этап КАК Этап,
	|	ЗадачаПоОбработкеДокумента.Этап.Наименование КАК НаименованиеЭтапа,
	|	РегистрСведенийПодписанныеДанные.СоставПодписи КАК СоставПодписи,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанные КАК ПодписанныеДанные,
	|	РегистрСведенийПодписанныеДанные.ДанныеАктуальны КАК ДанныеАктуальны,
	|	РегистрСведенийПодписанныеДанные.ДатаПроверкиДанных КАК ДатаПроверкиДанных,
	|	РегистрСведенийПодписанныеДанные.ОписаниеОшибки КАК ОписаниеОшибки,
	|	РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл КАК ПодписанныеДанныеФайл
	|ИЗ
	|	Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПодписанныеДанные КАК РегистрСведенийПодписанныеДанные
	|		ПО (РегистрСведенийПодписанныеДанные.Задача = ЗадачаПоОбработкеДокумента.Ссылка
	|			И РегистрСведенийПодписанныеДанные.ПодписанныеДанныеФайл = Значение(Справочник.ПодписанныеДанныеПОД.ПустаяСсылка))
	|ГДЕ
	|	ЗадачаПоОбработкеДокумента.ПодписанЭП
	|	И ЗадачаПоОбработкеДокумента.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачаПоОбработкеДокумента.Дата";	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.ПодписанныеДанные) Тогда
			ДвоичныеДанные = Выборка.ПодписанныеДанные.Получить(); 
			Если ДвоичныеДанные <> Неопределено Тогда
	        	МассивЗадач.Добавить(Выборка.Задача); 
			КонецЕсли;
		 КонецЕсли;
		  
	КонецЦикла;

	Возврат МассивЗадач;
	
КонецФункции

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьЗадачиСДаннымиВХранилищеЗначений", Истина);
КонецПроцедуры

#КонецЕсли