///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы конфигурации.
// Библиотека Интернет-поддержи (БИП).
// ОбщийМодуль.ОбновлениеИнформационнойБазыБИП.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).
//

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииПереопределяемый.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя                            = "БиблиотекаИнтеграцииС1САрхивом";
	Описание.Версия                         = ОбменСАрхивомКлиентСервер.ВерсияБиблиотеки();
	Описание.ИдентификаторИнтернетПоддержки = "AIL";
	Описание.РежимВыполненияОтложенныхОбработчиков = "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии = "1.0.4.2";
	
	// Требуется библиотека стандартных подсистем.
	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//		ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления().
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБИА.ОбновитьВидыДокументов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБИА.ОбновитьИспользованиеПроектовИГрифов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБИА.ПроверитьСоставТипов";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ОбменСАрхивом.ПерейтиНаНовуюВерсиюФорматаОбмена";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.1.1";
	Обработчик.Процедура = "ОбменСАрхивом.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Комментарий = НСтр("ru = 'Установка настроек интеграции с 1С:Архивом по умолчанию'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.3.3";
	Обработчик.Процедура = "ОбновлениеИнформационнойБазыБИА.УстановкаВидаТранспортаПоУмолчанию";
	Обработчик.Комментарий = НСтр("ru = 'Установка вида транспорта для интеграции с 1С:Архивом по умолчанию'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.0.4.2";
	Обработчик.Процедура = "РегистрыСведений.ИсторияОбменаС1САрхивом.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b45ee76c-4fbf-4fbc-9d86-1d6f1858bffa");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.ИсторияОбменаС1САрхивом.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Комментарий = НСтр("ru = 'Перевод регистра ""История обмена с 1С:Архивом"" на новую структуру хранения.'");
	Обработчик.БлокируемыеОбъекты = Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом.ПолноеИмя();
	Обработчик.ЧитаемыеОбъекты = Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом.ПолноеИмя();
	ИзменяемыеОбъекты = Новый Массив;
	ИзменяемыеОбъекты.Добавить(Метаданные.РегистрыСведений.ИсторияОбменаС1САрхивом.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(ИзменяемыеОбъекты, ",");
	
КонецПроцедуры

// Вызывается перед обработчиками обновления данных ИБ.
//
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
	
	
КонецПроцедуры

// Вызывается после завершения обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсияИБ - Строка - версия до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсияИБ - Строка - версия после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления,
//                                             сгруппированных по номеру версии.
//   ВыводитьОписаниеОбновлений - Булево - если установить Истина, то будет выведена форма
//                                с описанием обновлений. По умолчанию, Истина.
//                                Возвращаемое значение.
//   МонопольныйРежим           - Булево - Истина, если обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсияИБ, Знач ТекущаяВерсияИБ,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений системы.
//
// Параметры:
//  Макет - ТабличныйДокумент - описание обновлений. См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить режим обновления данных информационной базы.
// Для использования в редких (нештатных) случаях перехода, не предусмотренных в
// стандартной процедуре определения режима обновления.
//
// Параметры:
//   РежимОбновленияДанных - Строка - в обработчике можно присвоить одно из значений:
//              "НачальноеЗаполнение"     - если это первый запуск пустой базы (области данных);
//              "ОбновлениеВерсии"        - если выполняется первый запуск после обновление конфигурации базы данных;
//              "ПереходСДругойПрограммы" - если выполняется первый запуск после обновление конфигурации базы данных, 
//                                          в которой изменилось имя основной конфигурации.
//
//   СтандартнаяОбработка  - Булево - если присвоить Ложь, то стандартная процедура
//                                    определения режима обновления не выполняется, 
//                                    а используется значение РежимОбновленияДанных.
//
Процедура ПриОпределенииРежимаОбновленияДанных(РежимОбновленияДанных, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//	Обработчики - ТаблицаЗначений - с колонками:
//		* ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//			или "*", если нужно выполнять при переходе с любой конфигурации.
//		* Процедура - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//			Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//			Обязательно должна быть экспортной.
//
// Пример:
//	Обработчик = Обработчики.Добавить();
//	Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//	Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	
	
КонецПроцедуры

// Вызывается после выполнения всех процедур-обработчиков перехода с другой программы (с другим именем конфигурации),
// и до начала выполнения обновления данных ИБ.
//
// Параметры:
//  ПредыдущееИмяКонфигурации    - Строка - имя конфигурации до перехода.
//  ПредыдущаяВерсияКонфигурации - Строка - имя предыдущей конфигурации (до перехода).
//  Параметры                    - Структура - 
//    * ВыполнитьОбновлениеСВерсии   - Булево - по умолчанию Истина. Если установить Ложь, 
//        то будут выполнена только обязательные обработчики обновления (с версией "*").
//    * ВерсияКонфигурации           - Строка - номер версии после перехода. 
//        По умолчанию, равен значению версии конфигурации в свойствах метаданных.
//        Для того чтобы выполнить, например, все обработчики обновления с версии ПредыдущаяВерсияКонфигурации, 
//        следует установить значение параметра в ПредыдущаяВерсияКонфигурации.
//        Для того чтобы выполнить вообще все обработчики обновления, установить значение "0.0.0.1".
//    * ОчиститьСведенияОПредыдущейКонфигурации - Булево - по умолчанию Истина. 
//        Для случаев когда предыдущая конфигурация совпадает по имени с подсистемой текущей конфигурации, следует указать Ложь.
//
Процедура ПриЗавершенииПереходаСДругойПрограммы(Знач ПредыдущееИмяКонфигурации, 
	Знач ПредыдущаяВерсияКонфигурации, Параметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбновитьВидыДокументов");
	Методы.Вставить("ОбновитьИспользованиеПроектовИГрифов");
	Методы.Вставить("ПроверитьСоставТипов");
	Методы.Вставить("УстановкаВидаТранспортаПоУмолчанию");
	Методы.Вставить("ПроверитьНаличиеНевыгруженныхФайловОбмена");
	Методы.Вставить("УстановкаКонстантДляФайловОбмена");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет заполнение справочника ВидыДокументовБИА.
//
Процедура ОбновитьВидыДокументов(ПараметрОбработчика = Неопределено) Экспорт
	
	ОбменСАрхивомПереопределяемый.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);
	
КонецПроцедуры

Процедура ОбновитьИспользованиеПроектовИГрифов(ПараметрОбработчика = Неопределено) Экспорт
	
	ИспользоватьГрифыДоступа = Ложь;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ГрифДоступаБИА.Тип.Типы() Цикл
		Если Тип <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			ИспользоватьГрифыДоступа = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ИспользоватьПроекты = Ложь;
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ПроектБИА.Тип.Типы() Цикл
		Если Тип <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			ИспользоватьПроекты = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Константы.ИспользоватьГрифыДоступаБИА.Получить() <> ИспользоватьГрифыДоступа
			Или Константы.ИспользоватьПроектыБИА.Получить() <> ИспользоватьПроекты Тогда
		Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
			ПараметрОбработчика.МонопольныйРежим = Истина;
			Возврат;
		КонецЕсли;
		Константы.ИспользоватьПроектыБИА.Установить(ИспользоватьПроекты);
		Константы.ИспользоватьГрифыДоступаБИА.Установить(ИспользоватьГрифыДоступа);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСоставТипов(ПараметрОбработчика = Неопределено) Экспорт
	
	Ошибки = Новый Массив;
	
	ПроверитьСоответствиеОпределяемыхТиповМеждуСобой(Ошибки);
	ПроверитьСоответствиеОпределяемыхТиповИПланаОбмена(Ошибки);
	
	Если Ошибки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
	ВызватьИсключение ТекстОшибок;
	
КонецПроцедуры

// Сверяет состав определяемых типов между собой, вызывая исключения.
//
Процедура ПроверитьСоответствиеОпределяемыхТиповМеждуСобой(Ошибки) Экспорт
	
	ИмяТипаВсеСсылки = Метаданные.ОпределяемыеТипы.СсылкаНаИнтегрируемыйОбъектБИА.Имя;
	ИмяТипаДокументыОбъекты = Метаданные.ОпределяемыеТипы.ДокументОбъектБИА.Имя;
	ИмяТипаСправочникиОбъекты = Метаданные.ОпределяемыеТипы.СправочникОбъектБИА.Имя;
	
	ТипСсылкаНаИнтегрируемыйОбъектБИА = Метаданные.ОпределяемыеТипы.СсылкаНаИнтегрируемыйОбъектБИА.Тип;
	ТипСправочникОбъектБИА = Метаданные.ОпределяемыеТипы.СправочникОбъектБИА.Тип;
	ТипДокументОбъектБИА = Метаданные.ОпределяемыеТипы.ДокументОбъектБИА.Тип;
	
	Для Каждого ТипЗначения Из ТипСсылкаНаИнтегрируемыйОбъектБИА.Типы() Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		
		Если ОбъектМетаданных = Неопределено
			Или (Не ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных)
				И Не ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных)) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но интеграция данного объекта с 1С:Архивом не поддерживается.'"),
					ТипЗначения,
					ИмяТипаВсеСсылки));
			Продолжить;
		КонецЕсли;
		
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но в него должны быть включены только ссылочные типы.'"),
					ТипЗначения,
					ИмяТипаВсеСсылки));
			Продолжить;
		КонецЕсли;
		
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Если ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
			Тип = Тип(СтрЗаменить(ПолноеИмя, ".", "Объект."));
			Если Не ТипСправочникОбъектБИА.СодержитТип(Тип) Тогда
				Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Справочник ""%1"" выбран в определяемом типе ""%2"", но отсутствует в типе ""%3"".'"),
					ОбъектМетаданных.Имя,
					ИмяТипаВсеСсылки,
					ИмяТипаСправочникиОбъекты));
			КонецЕсли;
		ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
			Тип = Тип(СтрЗаменить(ПолноеИмя, ".", "Объект."));
			Если Не ТипДокументОбъектБИА.СодержитТип(Тип) Тогда
				Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Документ ""%1"" выбран в определяемом типе ""%2"", но отсутствует в типе ""%3"".'"),
					ОбъектМетаданных.Имя,
					ИмяТипаВсеСсылки,
					ИмяТипаДокументыОбъекты));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТипЗначения Из ТипДокументОбъектБИА.Типы() Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		
		Если ОбъектМетаданных = Неопределено Или Не ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но в него должны быть включены только документы.'"),
					ТипЗначения,
					ИмяТипаДокументыОбъекты));
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но в него должны быть включены только типы %3.'"),
					ТипЗначения,
					ИмяТипаДокументыОбъекты,
					"ДокументОбъект"));
			Продолжить;
		КонецЕсли;
		
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		
		Тип = Тип(СтрЗаменить(ПолноеИмя, ".", "Ссылка."));
		Если Не ТипСсылкаНаИнтегрируемыйОбъектБИА.СодержитТип(Тип) Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Документ ""%1"" выбран в определяемом типе ""%2"", но отсутствует в типе ""%3"".'"),
				ОбъектМетаданных.Имя,
				ИмяТипаДокументыОбъекты,
				ИмяТипаВсеСсылки));
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ТипЗначения Из ТипСправочникОбъектБИА.Типы() Цикл
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
		
		Если ОбъектМетаданных = Неопределено Или Не ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но в него должны быть включены только справочники.'"),
					ТипЗначения,
					ИмяТипаСправочникиОбъекты));
			Продолжить;
		КонецЕсли;
		
		Если ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
			Ошибки.Добавить(СтрШаблон(
					НСтр("ru = 'Тип ""%1"" выбран в определяемом типе ""%2"", но в него должны быть включены только типы %3.'"),
					ТипЗначения,
					ИмяТипаСправочникиОбъекты,
					"СправочникОбъект"));
			Продолжить;
		КонецЕсли;
		
		ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
		Тип = Тип(СтрЗаменить(ПолноеИмя, ".", "Ссылка."));
		Если Не ТипСсылкаНаИнтегрируемыйОбъектБИА.СодержитТип(Тип) Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = 'Справочник ""%1"" выбран в определяемом типе ""%2"", но отсутствует в типе ""%3"".'"),
				ОбъектМетаданных.Имя,
				ИмяТипаСправочникиОбъекты,
				ИмяТипаВсеСсылки));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Сверяет определяемые типы с планом обмена, вызывая исключения.
//
Процедура ПроверитьСоответствиеОпределяемыхТиповИПланаОбмена(Ошибки) Экспорт
	
	ПланОбмена = Метаданные.ПланыОбмена.ОбменНСИСАрхивом;
	ИмяПланаОбмена = ПланОбмена.Имя;
	
	ОпределяемыеТипыНСИ = Новый Массив;
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ОрганизацияБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ПодразделениеБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.КонтрагентБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.СотрудникБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ФизическоеЛицоБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ДолжностьБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ГрифДоступаБИА);
	ОпределяемыеТипыНСИ.Добавить(Метаданные.ОпределяемыеТипы.ПроектБИА);
	
	ТипыНСИ = Новый Соответствие;
	Для Каждого ОпределяемыйТип Из ОпределяемыеТипыНСИ Цикл
		Для Каждого Тип Из ОпределяемыйТип.Тип.Типы() Цикл
			ТипыНСИ[Тип] = ОпределяемыйТип.Имя;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ТипыНСИ Цикл
		
		ТипНСИ = КлючИЗначение.Ключ;
		ИмяОпределяемогоТипа = КлючИЗначение.Значение;
		
		ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипНСИ);
		Если ОбъектМетаданных = Неопределено
				Или ОбъектМетаданных = Метаданные.Справочники.ИдентификаторыОбъектовМетаданных Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ПланОбмена.Состав.Содержит(ОбъектМетаданных) Тогда
			Ошибки.Добавить(СтрШаблон(
				НСтр("ru = '""%1"" выбран в определяемом типе ""%2"", но отсутствует в составе плана обмена ""%3"".'"),
				ОбъектМетаданных.ПолноеИмя(),
				ИмяОпределяемогоТипа,
				ИмяПланаОбмена));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Установка вида транспорта для интеграции с 1С:Архивом по умолчанию.
// 
Процедура УстановкаВидаТранспортаПоУмолчанию(ПараметрОбработчика = Неопределено) Экспорт
	
	Если Константы.ИнтеграцияС1САрхивом.Получить() = Истина
			И Не ЗначениеЗаполнено(Константы.ИнтеграцияС1САрхивомВидТранспорта.Получить())
			И ЗначениеЗаполнено(Константы.ИнтеграцияС1САрхивомКаталог.Получить()) Тогда
		Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
			ПараметрОбработчика.МонопольныйРежим = Истина;
			Возврат;
		КонецЕсли;
		Константы.ИнтеграцияС1САрхивомВидТранспорта.Установить(
			Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
