
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда 
		
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		
		МассивСотрудников = Неопределено;
		Если Параметры.Свойство("ЗначенияЗаполнения") И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
			ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
			Если Параметры.ЗначенияЗаполнения.Свойство("МассивЗастрахованных") И ТипЗнч(Параметры.ЗначенияЗаполнения.МассивЗастрахованных) = Тип("Массив") Тогда
				МассивЗастрахованных = Параметры.ЗначенияЗаполнения.МассивЗастрахованных;
				МассивФизическихЛиц = Новый Массив;
				Для Каждого Застрахованный Из МассивЗастрахованных Цикл
					Если ТипЗнч(Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
						МассивФизическихЛиц.Добавить(Застрахованный);
					Иначе
						МассивФизическихЛиц.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Застрахованный, "Владелец"));
					КонецЕсли;
				КонецЦикла;
				ОсновныеСотрудникиФизическихЛиц = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(МассивФизическихЛиц,
					Истина,
					Объект.Организация,
					ТекущаяДатаСеанса());
				МассивСотрудников = ОсновныеСотрудникиФизическихЛиц.ВыгрузитьКолонку("Сотрудник");
			КонецЕсли;
		Иначе
			ЗначенияДляЗаполнения = Новый Структура;
			ЗначенияДляЗаполнения.Вставить("Организация", "Объект.Организация");
			Если Не Параметры.Свойство("ЗначенияЗаполнения") Или Не Параметры.ЗначенияЗаполнения.Свойство("Подразделение") Тогда
				// Подразделение (пустое значение) может быть передано как параметр заполнения из обработки.
				ЗначенияДляЗаполнения.Вставить("Подразделение", "Объект.Подразделение");
			КонецЕсли;
			ЗначенияДляЗаполнения.Вставить("Ответственный", "Объект.Ответственный");
			ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		КонецЕсли;
		
		Объект.ДатаИзменения = ТекущаяДатаСеанса();
		ПриПолученииДанныхНаСервере(Истина);
		Если МассивСотрудников <> Неопределено Тогда
			СотрудникиЗаполнитьНаСервере(МассивСотрудников, МассивЗастрахованных);
		КонецЕсли;
	Иначе
		
		// Если это открытие уже существующего документа, 
		// то оно может выполняться в режиме добавления строк.
		Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Сотрудники") Тогда
			МассивСотрудников = Новый Массив;
			Для Каждого ПараметрСотрудник Из Параметры.ЗначенияЗаполнения.Сотрудники Цикл
				НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ПараметрСотрудник));
				Если НайденныеСтроки.Количество() = 0 Тогда
					МассивСотрудников.Добавить(ПараметрСотрудник);
				КонецЕсли;
			КонецЦикла;
			
			Если МассивСотрудников.Количество() > 0 Тогда
				СотрудникиЗаполнитьНаСервере(МассивСотрудников);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользуютсяУдержания = ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиУдержания", "Видимость", ИспользуютсяУдержания);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РодственникиРасширенияПрограммСтрахования", "Видимость", ИспользуютсяРасширенияПрограмм);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЧастичноеУдержание", "Видимость", ИспользуетсяЧастичноеУдержание);
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущийОбъект.ДатаОтправки = Дата(Год(ТекущийОбъект.Дата), Месяц(ТекущийОбъект.Дата), День(ТекущийОбъект.Дата), Час(ТекущаяДата), Минута(ТекущаяДата), Секунда(ТекущаяДата));
	РеквизитыВДанные(ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеВРеквизиты();
	ПерерасчетЗарплаты.РегистрацияПерерасчетовПоПредварительнымДаннымВФоне(ТекущийОбъект.Ссылка);
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборФорматаВложений") Тогда
		
		Если ВыбранноеЗначение <> Неопределено И ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
			ПараметрыОтправки = ПараметрыОтправкиПисьма(ВыбранноеЗначение);
			
			МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
			МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	МедицинскоеСтрахованиеФормы.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыПоказателиДокумента" И Источник.ВладелецФормы = ЭтотОбъект Тогда
		Если Параметр.Показатели.Количество() > 0 Тогда 
			ОбработатьИзменениеПоказателейНаСервере(Параметр.Показатели);
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ПриИзмененииОсновныхПолейНаСервере();
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ДополнитьФорму();
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСтрахованияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ДополнитьФорму();
	ПриИзмененииОсновныхПолейНаСервере(Истина, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтотОбъект);
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияПриИзменении(Элемент)
	
	Для Каждого Сотрудники Из Объект.Сотрудники Цикл
		СотрудникиДатаНачалаПриИзмененииНаСервере(Сотрудники.Сотрудник, Объект.ДатаИзменения, Сотрудники.ДатаРождения);
		
		Если ИспользуютсяУдержания Тогда
			ПересчитатьУдержания(Сотрудники);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдержатьПриПрикрепленииПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не УдержатьПриПрикреплении Тогда
		ПрекратитьУдержания = Ложь;
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьУдержанияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
	Если Не ПрекратитьУдержания Тогда
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СуммаПредела = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ФормаОбъекта",
		Новый Структура("Ключ", ТекущиеДанные.Прикрепление));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьОтправленныеДанныеСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Элементы.ГруппаСведенияСтрахованияСотрудника.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = ТекущиеДанные.ИзменилисьОтправленныеДанныеСотрудника;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьУсловияСтрахованияРодственниковПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Родственники.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников Или ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаИзменения, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиЧастичноеУдержаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиПроцентЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	Элементы.СотрудникиСуммаЧастичногоУдержания.Видимость = ТекущиеДанные.ЧастичноеУдержание;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПроцентЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.ПроцентЧастичногоУдержания > 100 Тогда
			ТекущиеДанные.ПроцентЧастичногоУдержания = 100;
		КонецЕсли;
		ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * ТекущиеДанные.ПроцентЧастичногоУдержания / 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСуммаЧастичногоУдержанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьОбщуюСуммуУдержания(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
		ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
		ТекущиеДанные.СуммаЧастичногоУдержания = 0;
	Иначе
		Если ТекущиеДанные.СуммаЧастичногоУдержания > ТекущиеДанные.ОбщаяСуммаУдержания Тогда
			ТекущиеДанные.СуммаЧастичногоУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
		КонецЕсли;
		ТекущиеДанные.ПроцентЧастичногоУдержания = Окр(ТекущиеДанные.СуммаЧастичногоУдержания / ТекущиеДанные.ОбщаяСуммаУдержания * 100, 2);
	КонецЕсли;
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(ТекущиеДанные);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьУсловияСтрахованияСотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтрахованиеШапка.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	МассивСтруктурПрограмм = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
		ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
	Иначе
		ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
	КонецЕсли;
	Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
		ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
	Иначе
		ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
			ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("Программы", МассивСтруктурПрограмм);
	ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
	ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
	ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
	ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
	ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ПараметрыОткрытия.Вставить("ДатаИзменения",  Объект.ДатаИзменения);
	
	ОткрытьФорму("Справочник.ПрограммыМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	МассивСтруктурРасширений = Новый Массив;
	
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
		ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
	Иначе
		ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
	КонецЕсли;
	Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
		ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
	Иначе
		ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
	КонецЕсли;
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		СтруктураПрограммы = Новый Структура;
		СтруктураПрограммы.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеСтрахования);
		СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
		СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
		СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
		СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
		МассивСтруктурРасширений.Добавить(СтруктураПрограммы);
		Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
			ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сотрудник", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("МассивСтруктурРасширений", МассивСтруктурРасширений);
	ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
	ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
	ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
	ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
	ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастов);
	ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.Сотрудник);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	ПараметрыОткрытия.Вставить("ДатаИзменения", Объект.ДатаИзменения);
	
	ОткрытьФорму("Справочник.РасширенияПрограммМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиУдерживатьИзЗарплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СпособУдержания) Тогда
		ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно");
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		Элементы.ГруппаЧастичноеУдержание.Видимость = ТекущиеДанные.УдерживатьИзЗарплаты;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УдержаниеПриИзменении(Элемент)
	
	УдержаниеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУдержанияМедицинскогоСтрахованияПриИзменении(Элемент)
	
	УстановитьВидимостьГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтборСтрокРодственников(Элементы, ТекущиеДанные.ФизическоеЛицо);
	УстановитьОтборСтрокПоказателей(Элементы, ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);
	
	УдержатьПриПрикреплении = ТекущиеДанные.СуммаУдержания <> 0;
	ПрекратитьУдержания = ТекущиеДанные.СуммаПредела <> 0;
	
	НадписьОснование = ТекущиеДанные.Прикрепление;
	УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
	УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
	
	ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиСотрудника", 0.2, Истина);
	УстановитьДоступностьЭлементов();
	УстановитьЗаголовокСтраницыСотрудники();
	
	Элементы.ГруппаСтрахованиеШапка.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника;
	Элементы.ГруппаНастройкиУдержания.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияСотрудника Или ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	Для Каждого Элемент Из Элементы.ГруппаСведенияСтрахованияСотрудника.ПодчиненныеЭлементы Цикл
		Элемент.Доступность = ТекущиеДанные.ИзменилисьОтправленныеДанныеСотрудника;
	КонецЦикла;
	Элементы.Родственники.Доступность = ТекущиеДанные.ИзменилисьУсловияСтрахованияРодственников;
	
	//Удержания
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользуетсяЧастичноеУдержание Тогда
		ЕстьУдержание = ТекущиеДанные.ОбщаяСуммаУдержания > 0;
		Элементы.ГруппаЧастичноеУдержание.Видимость = ЕстьУдержание;
	КонецЕсли;
	
	УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
	УстановитьВидимостьГрафикаУдержаний();
	Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		УстановитьОтборГрафикаУдержаний(Элементы, ТекущиеДанные.ФизическоеЛицо);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиСотрудника()
	УстановитьВидимостьЭлементов();	
КонецПроцедуры	

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СотрудникиОбработкаВыбораНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СотрудникиПередУдалениемНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ФизическоеЛицо, ТекущиеДанные.ИдентификаторСтрокиВидаРасчета);	
	НадписьОснование = НСтр("ru = '<Не указано>'");
	СотрудникиПрограммыСтрахования = НСтр("ru = '<Не указаны>'");
	СотрудникиРасширенияПрограммСтрахования = НСтр("ru = '<Не указаны>'");
	Элементы.ГруппаНастройкиУдержания.Заголовок = НСтр("ru = 'Удержание стоимости полиса'");
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПередУдалениемНаСервере(Сотрудник, ФизическоеЛицо, ИдентификаторСтрокиВидаРасчета)
	
	МедицинскоеСтрахованиеФормы.УдалитьСвязанныеССотрудникомДанные(ЭтотОбъект, Сотрудник, ФизическоеЛицо, ИдентификаторСтрокиВидаРасчета, Истина);	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиОбработкаВыбораНаСервере(ТекущиеДанные.Сотрудник);
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Сотрудники", "Сотрудник", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СотрудникиДатаРожденияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиДатаНачалаПриИзмененииНаСервере(ТекущиеДанные.Сотрудник, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаРождения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРодственники

&НаКлиенте
Процедура РодственникиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		Элементы.РодственникиУдалить.Видимость = Истина;
		Элементы.РодственникиУдалить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.РодственникиУдалить.Картинка = БиблиотекаКартинок.Удалить;
	Иначе
		Элементы.РодственникиУдалить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанныеПрикрепления = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеПрикрепления = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные.ФизическоеЛицо = ТекущиеДанныеПрикрепления.ФизическоеЛицо;
		ТекущиеДанные.ДатаПрикрепления = Объект.ДатаИзменения;
		ТекущиеДанные.ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить");
		Элементы.РодственникиУдалить.Видимость = Истина;
		Элементы.РодственникиУдалить.Заголовок = НСтр("ru = 'Удалить'");
		Элементы.РодственникиУдалить.Картинка = БиблиотекаКартинок.Удалить;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.Родственники.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.Родственники.Удалить(НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.ПрограммыСтрахованияРодственников.Удалить(НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Объект.РасширенияПрограммСтрахованияРодственников.Удалить(НайденнаяСтрока);
		КонецЦикла;
		
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПересчитатьУдержания(ТекущиеДанные);
		
		УстановитьЗаголовокСтраницыСотрудники();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьЗаголовокСтраницыСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРодственникСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ТекущиеДанные.ФизическоеЛицо);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.РодственникиФизическихЛиц.ФормаВыбора", ПараметрыОткрытия, Элементы.Родственники);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанныеСотрудники);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиДатаПриИзмененииНаСервере(ТекущиеДанные.РодственникСсылка, ТекущиеДанные.ДатаПрикрепления, ТекущиеДанные.ДатаОткрепления, ТекущиеДанные.ДатаРождения);
	
	Если ИспользуютсяУдержания Тогда
		ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанныеСотрудники = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПересчитатьУдержания(ТекущиеДанныеСотрудники);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
			ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	Иначе
		МассивСтруктурПрограмм = Новый Массив;
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
			ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
		Иначе
			ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
			ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
		Иначе
			ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
			СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
			СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
			Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
				ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("Программы", МассивСтруктурПрограмм);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
		ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
		ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
		ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
		ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастовДляРодственников);
		ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
		ПараметрыОткрытия.Вставить("ДатаИзменения", Объект.ДатаИзменения);

		ОткрытьФорму("Справочник.ПрограммыМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Родственники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.РодственникСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	
	Если ТекущиеДанные.Действие = ПредопределенноеЗначение("Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Добавить") Тогда
		МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
			ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияРодственников", "РодственникСсылка", ОповещениеЗавершения);
	Иначе
		МассивСтруктурРасширений = Новый Массив;
		
		СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
		Если ТекущиеДанные.Свойство("ДатаПрикрепления") Тогда
			ДатаПрикрепления = ТекущиеДанные.ДатаПрикрепления;
		Иначе
			ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		КонецЕсли;
		Если ТекущиеДанные.Свойство("ДатаОткрепления") Тогда
			ДатаОткрепления = ТекущиеДанные.ДатаОткрепления;
		Иначе
			ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		КонецЕсли;
		Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
			СтруктураПрограммы.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
			СтруктураПрограммы.Вставить("Действие", СтрокаТаблицы.Действие);
			МассивСтруктурРасширений.Добавить(СтруктураПрограммы);
			Если ДатаПрикрепления < СтрокаТаблицы.ДатаНачала И СтрокаТаблицы.ДатаНачала < Объект.ДатаОкончанияСтрахования Тогда
				ДатаПрикрепления = СтрокаТаблицы.ДатаНачала;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("МассивСтруктурРасширений", МассивСтруктурРасширений);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
		ПараметрыОткрытия.Вставить("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
		ПараметрыОткрытия.Вставить("ДатаПрикрепления", ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
		ПараметрыОткрытия.Вставить("ДатаРождения", ТекущиеДанные.ДатаРождения);
		ПараметрыОткрытия.Вставить("ШкалаВозрастов", ШкалаВозрастовДляРодственников);
		ПараметрыОткрытия.Вставить("Страхователь", ТекущиеДанные.РодственникСсылка);
		ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
		ПараметрыОткрытия.Вставить("ДатаИзменения", Объект.ДатаИзменения);

		ОткрытьФорму("Справочник.РасширенияПрограммМедицинскогоСтрахования.Форма.ФормаИзменениеУсловий", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеЗавершения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиУдерживатьССотрудникаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьУдержания(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиЭлементНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ЭлементКонтактнойИнформацииНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РодственникиДокументНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедицинскоеСтрахованиеКлиент.ДокументУдостоверяющийЛичностьНачалоВыбора(ЭтотОбъект, Элемент, "Родственники", "РодственникСсылка", ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафикУдержаний

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВводМесяцаУдержанияНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", 
		Новый Структура("Значение,РежимВыбораПериода,ЗапрашиватьРежимВыбораПериодаУВладельца", Неопределено, "Месяц", Ложь),
		ЭтотОбъект, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой", Направление);
	Объект.ГрафикУдержаний.Сортировать("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийДатаСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "Элементы.ГрафикУдержаний.ТекущиеДанные.Дата", "Элементы.ГрафикУдержаний.ТекущиеДанные.ДатаСтрокой");
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо;
	Объект.ГрафикУдержаний.Сортировать("Дата");
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если Не СтрокаГрафика.ВведеноПользователем Тогда
			Элементы.ГрафикУдержаний.ТекущиеДанные.ВведеноПользователем = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	Если ГрафикУдержаний.Количество() = 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ГрафикУдержаний.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ФактическиУдержано) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикУдержанийПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьГрафикУдержаний(ТекущиеДанные);
	ОбновитьПодвалГрафикаУдержаний();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СотрудникиЗаполнить(Команда)
	
	СотрудникиЗаполнитьНаСервере();
	
	Если Элементы.Сотрудники.ТекущаяСтрока = Неопределено И Объект.Сотрудники.Количество() > 0 Тогда
		Элементы.Сотрудники.ТекущаяСтрока = Объект.Сотрудники[0].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодственникиЗаполнить(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодственникиЗаполнитьНаСервере(ТекущиеДанные.Сотрудник);
	УстановитьЗаголовокСтраницыСотрудники();
	
	Если ИспользуютсяУдержания Тогда
		ПересчитатьУдержания(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиПрограммыСтрахованияЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.ПрограммыСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "ПрограммыСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммСтрахованияРедактировать(Команда)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("СотрудникиРасширенияПрограммЗавершениеРедактирования", ЭтотОбъект, ТекущиеДанные);
	МедицинскоеСтрахованиеКлиент.РасширенияПрограммСтрахованияРедактировать(
		ЭтотОбъект, ТекущиеДанные, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Неопределено;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("ГосударственнаяСлужбаКлиент");
		Модуль.УточнитьПараметрыОткрытияФормыВыбораСотрудников(ПараметрыОткрытия);
	КонецЕсли; 
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.Сотрудники,
		Объект.Организация,
		Объект.Подразделение,
		Объект.Дата,
		Истина,
		АдресСпискаПодобранныхСотрудников(),
		ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтроки(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", Объект.Организация);
	Если Элементы.Сотрудники.ВыделенныеСтроки.Количество() = 0 Тогда
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", Неопределено);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", 0);
		ПараметрыОткрытия.Вставить("СуммаУдержания", 0);
		ПараметрыОткрытия.Вставить("СуммаПредела", 0);
	Иначе
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(Элементы.Сотрудники.ВыделенныеСтроки[0]);
		СтруктураОтбора = Новый Структура("Сотрудник", СтрокаСотрудника.Сотрудник);
		
		ПараметрыОткрытия.Вставить("ПрограммыСтрахования", Новый Массив);
		НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.ПрограммыСтрахования.Добавить(НайденнаяСтрока.ПрограммаСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("РасширенияПрограммСтрахования", Новый Массив);
		НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыОткрытия.РасширенияПрограммСтрахования.Добавить(НайденнаяСтрока.РасширениеСтрахования);
		КонецЦикла;
		
		ПараметрыОткрытия.Вставить("ДатаНачалаСтрахования", СтрокаСотрудника.ДатаПрикрепления);
		ПараметрыОткрытия.Вставить("СтраховаяПремия", СтрокаСотрудника.СтраховаяПремия);
		ПараметрыОткрытия.Вставить("СуммаУдержания", СтрокаСотрудника.СуммаУдержания);
		ПараметрыОткрытия.Вставить("СуммаПредела", СтрокаСотрудника.СуммаПредела);
	КонецЕсли;
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнениеСведенийСтрахованияЗакрытие", ЭтотОбъект, Элементы.Сотрудники.ВыделенныеСтроки);
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Форма.ФормаЗаполнениеСведенийСтрахования", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		МодульРаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)

	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ТабличнаяЧасть.Сотрудники";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка списка сотрудников из файла'");
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьСотрудниковИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Ложь,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("Объект.ГрафикУдержаний.Представление"));
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийСумма.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ВведеноПользователем",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийДатаСтрокой.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ГрафикУдержанийСумма.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор,
		"Объект.ГрафикУдержаний.ФактическиУдержано",
		0,
		ВидСравненияКомпоновкиДанных.Больше);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатУспехЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОтправитьПечатныеФормыПоПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ИмяОткрываемойФормы = "ОбщаяФорма.ВыборФорматаВложений";
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиЗаполнитьНаСервере(МассивСотрудников = Неопределено, МассивЗастрахованных = Неопределено, ЭтоПодбор = Ложь)
	
	Если Не ЭтоПодбор Тогда
		ОчиститьДанныеТаблицДокумента();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДоговорСтрахования) Или Не ЗначениеЗаполнено(Объект.ДатаИзменения) Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьОтборПоСотрудникам = Ложь;
	МассивФизическихЛиц = Новый Массив;
	
	Если МассивСотрудников <> Неопределено Тогда
		ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСотрудников, "ФизическоеЛицо", Истина);
		Для Каждого ЭлементСоответствия Из ФизическиеЛицаСотрудников Цикл
			МассивФизическихЛиц.Добавить(ЭлементСоответствия.Значение);
		КонецЦикла;
		ЕстьОтборПоСотрудникам = Истина;
		
		ОчиститьДанныеПоСотрудникам(МассивСотрудников, МассивФизическихЛиц);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаИзменения", Объект.ДатаИзменения);
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("ЕстьОтборПоСотрудникам", ЕстьОтборПоСотрудникам);
	Запрос.УстановитьПараметр("МассивФизическихЛиц", МассивФизическихЛиц);
	Запрос.УстановитьПараметр("ИсключаемыйДокумент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЕстьДокументОснование", ЗначениеЗаполнено(Объект.Основание));
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Основание);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрограммыСотрудников.Период КАК Период,
		|	ПрограммыСотрудников.Регистратор КАК Регистратор,
		|	ПрограммыСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрограммыСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрограммыСотрудников.Родственник КАК Родственник
		|ПОМЕСТИТЬ ВТПрограммыСотрудников
		|ИЗ
		|	РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(&ДатаИзменения, ДоговорСтрахования = &ДоговорСтрахования
		|	И ВЫБОР
		|		КОГДА &ЕстьДокументОснование
		|			ТОГДА Регистратор = &ДокументОснование
		|		ИНАЧЕ Регистратор <> &ИсключаемыйДокумент
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ФизическоеЛицо В (&МассивФизическихЛиц)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ) КАК ПрограммыСотрудников
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	ФизическоеЛицо,
		|	ПрограммаСтрахования,
		|	Родственник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПрограммыСотрудников.Период) КАК Период,
		|	ПрограммыСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТСгруппированныеПрограммыСотрудников
		|ИЗ
		|	ВТПрограммыСотрудников КАК ПрограммыСотрудников
		|СГРУППИРОВАТЬ ПО
		|	ПрограммыСотрудников.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрограммыСотрудников.Регистратор КАК Регистратор,
		|	ПрограммыСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрограммыСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПоследниеПрограммыСотрудников
		|ИЗ
		|	ВТСгруппированныеПрограммыСотрудников КАК СгруппированныеПрограммыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПрограммыСотрудников КАК ПрограммыСотрудников
		|		ПО СгруппированныеПрограммыСотрудников.Период = ПрограммыСотрудников.Период
		|		И СгруппированныеПрограммыСотрудников.ФизическоеЛицо = ПрограммыСотрудников.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	ФизическоеЛицо,
		|	ПрограммаСтрахования";
	
	Запрос.Выполнить();
	
	Если Не ЗарплатаКадры.ВТСодержитСтроки(Запрос.МенеджерВременныхТаблиц, "ВТПрограммыСотрудников") Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Нет данных для заполнения.'"));
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("ДействиеДобавить", Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить);
	Запрос.УстановитьПараметр("ДействиеИзменить", Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить);
	Запрос.УстановитьПараметр("ДействиеНеИзменять", Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять);
	Запрос.УстановитьПараметр("БезРодственника", Справочники.РодственникиФизическихЛиц.ПустаяСсылка());
	
	СотрудникиТаблица= СотрудникиПрикрепления(Запрос);
	Для Каждого СтрокаСотрудники Из СотрудникиТаблица Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСотрудники);
	КонецЦикла;
	ПрограммыСотрудниковТаблица = ПрограммыСтрахованияСотрудников(Запрос);
	Для Каждого СтрокаПрограммыСотрудника Из ПрограммыСотрудниковТаблица Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПрограммыСотрудника);
	КонецЦикла;
	РасширенияСотрудниковТаблица = РасширенияПрограммСтрахованияСотрудников(Запрос);
	Для Каждого СтрокаРасширениеСотрудника Из РасширенияСотрудниковТаблица Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасширениеСотрудника);
	КонецЦикла;
	ГрафикУдержанийТаблица = ГрафикУдержаний(Запрос);
	Для Каждого СтрокаГрафика Из ГрафикУдержанийТаблица Цикл
		НоваяСтрока = Объект.ГрафикУдержаний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика);
	КонецЦикла;
	РодственникиТаблица = РодственникиПрикрепления(Запрос);
	Для Каждого СтрокаРодственника Из РодственникиТаблица Цикл
		НоваяСтрока = Объект.Родственники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРодственника);
	КонецЦикла;
	ПрограммыРодственниковТаблица = ПрограммыСтрахованияРодственников(Запрос);
	Для Каждого СтрокаПрограммыРодственника Из ПрограммыРодственниковТаблица Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияРодственников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПрограммыРодственника);
	КонецЦикла;
	РасширенияРодственниковТаблица = РасширенияПрограммСтрахованияРодственников(Запрос);
	Для Каждого СтрокаРасширениеРодственника Из РасширенияРодственниковТаблица Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияРодственников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасширениеРодственника);
	КонецЦикла;
	Если РодственникиТаблица.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивФизическихЛиц,
			РодственникиТаблица.ВыгрузитьКолонку("РодственникСсылка"));
	КонецЕсли;
	ДанныеЗастрахованныхТаблица = ДанныеЗастрахованных(Запрос);
	Для Каждого СтрокаДанныеЗастрахованных Из ДанныеЗастрахованныхТаблица Цикл
		НоваяСтрока = Объект.ДанныеЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанныеЗастрахованных);
	КонецЦикла;
	КИЗастрахованныхТаблица = КонтактнаяИнформацияЗастрахованных(Запрос);
	Для Каждого СтрокаКИЗастрахованных Из КИЗастрахованныхТаблица Цикл
		НоваяСтрока = Объект.КонтактнаяИнформацияЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКИЗастрахованных);
	КонецЦикла;
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ДопРеквизитыИСведенияЗастрахованныхТаблица = ДополнительныеРеквизитыИСведенияЗастрахованных(Запрос);
		Для Каждого СтрокаДопРеквизиты Из ДопРеквизитыИСведенияЗастрахованныхТаблица Цикл
			НоваяСтрока = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДопРеквизиты);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьИзмененияПерсональныхДанных(МассивЗастрахованных);
	ДанныеВРеквизиты();
	РассчитатьСтраховуюПремиюСотрудников(МассивСотрудников);
	
	Для Каждого СтрокаСотрудники Из Объект.Сотрудники Цикл
		Если (ЕстьОтборПоСотрудникам И МассивСотрудников.Найти(СтрокаСотрудники.Сотрудник) = Неопределено)
		 Или СтрокаСотрудники.СпособУдержания <> Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику Тогда
			Продолжить;
		КонецЕсли;
		ПересчитатьГрафикУдержанийНаСервере(СтрокаСотрудники);
	КонецЦикла;
	
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		РодственникиОбработкаВыбораНаСервере(СтрокаРодственника.РодственникСсылка, СтрокаРодственника.ПолучитьИдентификатор());
	КонецЦикла;
	
	Объект.Сотрудники.Сортировать("Сотрудник");
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеПоСотрудникам(МассивСотрудников, МассивФизическихЛиц = Неопределено)

	Если МассивФизическихЛиц = Неопределено Тогда
		МассивФизическихЛиц = Новый Массив;
		ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСотрудников, "ФизическоеЛицо", Истина);
		Для Каждого ЭлементСоответствия Из ФизическиеЛицаСотрудников Цикл
			МассивФизическихЛиц.Добавить(ЭлементСоответствия.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполняемыеТаблицыСотрудников = Документы.ИзменениеУсловийМедицинскогоСтрахования.ЗаполняемыеТаблицыСотрудников();
	ЗаполняемыеТаблицыФизическихЛиц	= Документы.ИзменениеУсловийМедицинскогоСтрахования.ЗаполняемыеТаблицыФизическихЛиц();
	ЗаполняемыеТаблицыЗастрахованных = Документы.ИзменениеУсловийМедицинскогоСтрахования.ЗаполняемыеТаблицыЗастрахованных();
	
	ОтборСотрудников 	= Новый Структура("Сотрудник");
	ОтборПоказателей 	= Новый Структура("ИдентификаторСтрокиВидаРасчета");
	ОтборФизическихЛиц 	= Новый Структура("ФизическоеЛицо");
	ОтборЗастрахованных	= Новый Структура("Застрахованный");
	
	Для Каждого Сотрудник Из МассивСотрудников Цикл
		
		ОтборСотрудников.Сотрудник = Сотрудник;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыСотрудников Цикл
			НайденныеСтроки = Объект[ЗаполняемаяТаблица].НайтиСтроки(ОтборСотрудников);
			
			Если ЗаполняемаяТаблица = "Сотрудники" Тогда
				Для Каждого НайденнаяСтрокаСотрудника Из НайденныеСтроки Цикл
					ОтборПоказателей.ИдентификаторСтрокиВидаРасчета = НайденнаяСтрокаСотрудника.ИдентификаторСтрокиВидаРасчета;
					СтрокиПоказателей = Объект.Показатели.НайтиСтроки(ОтборПоказателей);
					Для Каждого НайденнаяСтрокаПоказателей Из СтрокиПоказателей Цикл
						Объект.Показатели.Удалить(НайденнаяСтрокаПоказателей);
					КонецЦикла;
				КонецЦикла;	
			КонецЕсли;	
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект[ЗаполняемаяТаблица].Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
		ОтборЗастрахованных.Застрахованный = Сотрудник;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыЗастрахованных Цикл
			НайденныеСтроки = Объект[ЗаполняемаяТаблица].НайтиСтроки(ОтборЗастрахованных);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект[ЗаполняемаяТаблица].Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ФизическоеЛицо Из МассивФизическихЛиц Цикл
		
		ОтборФизическихЛиц.ФизическоеЛицо = ФизическоеЛицо;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
			НайденныеСтроки = Объект[ЗаполняемаяТаблица].НайтиСтроки(ОтборФизическихЛиц);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект[ЗаполняемаяТаблица].Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
		ОтборЗастрахованных.Застрахованный = ФизическоеЛицо;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыЗастрахованных Цикл
			НайденныеСтроки = Объект[ЗаполняемаяТаблица].НайтиСтроки(ОтборЗастрахованных);
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Объект[ЗаполняемаяТаблица].Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДанныеТаблицДокумента()
	
	Объект.Сотрудники.Очистить();
	Объект.ПрограммыСтрахованияСотрудников.Очистить();
	Объект.РасширенияПрограммСтрахованияСотрудников.Очистить();
	Объект.Родственники.Очистить();
	Объект.ПрограммыСтрахованияРодственников.Очистить();
	Объект.РасширенияПрограммСтрахованияРодственников.Очистить();
	Объект.Показатели.Очистить();
	Объект.ГрафикУдержаний.Очистить();
	Объект.ДанныеЗастрахованных.Очистить();
	Объект.КонтактнаяИнформацияЗастрахованных.Очистить();
	Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияПерсональныхДанных(МассивЗастрахованных)
	
	Если МассивЗастрахованных = Неопределено Тогда
		МассивЗастрахованных = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗастрахованных,
			Объект.Сотрудники.Выгрузить( , "ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЗастрахованных,
			Объект.Родственники.Выгрузить( , "РодственникСсылка").ВыгрузитьКолонку("РодственникСсылка"));
	КонецЕсли;
	
	Если МассивЗастрахованных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИзмененияДанных(МассивЗастрахованных);
	ЗаполнитьИзмененияКонтактнойИнформации(МассивЗастрахованных);
	ЗаполнитьИзмененияДопРеквизитовИСведений(МассивЗастрахованных);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияДанных(МассивЗастрахованных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Фамилия КАК Фамилия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьФамилия КАК ИзмениласьФамилия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Имя КАК Имя,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилосьИмя КАК ИзменилосьИмя,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Отчество КАК Отчество,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилосьОтчество КАК ИзменилосьОтчество,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьДатаРождения КАК ИзмениласьДатаРождения,
		|	ИзменениеОтправленныхДанныхЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилсяСтраховойНомерПФР КАК ИзменилсяСтраховойНомерПФР,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Пол КАК Пол,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзменилсяПол КАК ИзменилсяПол,
		|	ИзменениеОтправленныхДанныхЗастрахованных.Страна КАК Страна,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ИзмениласьСтрана КАК ИзмениласьСтрана,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументВид КАК ДокументВид,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДанныхЗастрахованных КАК ИзменениеОтправленныхДанныхЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДанныхЗастрахованных.ДоговорСтрахования = &ДоговорСтрахования
		|	И ИзменениеОтправленныхДанныхЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ФизическоеЛицо = ?(ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица"),
			Результат.Застрахованный,
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Результат.Застрахованный, "Владелец"));
		НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
		Иначе
			НайденныеСтрокиСотрудники[0].ИзменилисьУсловияСтрахованияРодственников = Истина;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
		НайденныеСтроки = Объект.ДанныеЗастрахованных.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НайденнаяСтрока = Объект.ДанныеЗастрахованных.Добавить();
			НайденнаяСтрока.Застрахованный = Результат.Застрахованный;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];
		КонецЕсли;
		
		Если Результат.ИзмениласьФамилия Тогда
			НайденнаяСтрока.Фамилия = Результат.Фамилия;
		КонецЕсли;
		Если Результат.ИзменилосьИмя Тогда
			НайденнаяСтрока.Имя = Результат.Имя;
		КонецЕсли;
		Если Результат.ИзменилосьОтчество Тогда
			НайденнаяСтрока.Отчество = Результат.Отчество;
		КонецЕсли;
		Если Результат.ИзмениласьДатаРождения Тогда
			НайденнаяСтрока.ДатаРождения = Результат.ДатаРождения;
		КонецЕсли;
		Если Результат.ИзменилсяСтраховойНомерПФР Тогда
			НайденнаяСтрока.СтраховойНомерПФР = Результат.СтраховойНомерПФР;
		КонецЕсли;
		Если Результат.ИзменилсяПол Тогда
			НайденнаяСтрока.Пол = Результат.Пол;
		КонецЕсли;
		Если Результат.ИзмениласьСтрана Тогда
			НайденнаяСтрока.Страна = Результат.Страна;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументВид) Тогда
			НайденнаяСтрока.ДокументВид = Результат.ДокументВид;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСерия) Тогда
			НайденнаяСтрока.ДокументСерия = Результат.ДокументСерия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументНомер) Тогда
			НайденнаяСтрока.ДокументНомер = Результат.ДокументНомер;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументДатаВыдачи) Тогда
			НайденнаяСтрока.ДокументДатаВыдачи = Результат.ДокументДатаВыдачи;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументСрокДействия) Тогда
			НайденнаяСтрока.ДокументСрокДействия = Результат.ДокументСрокДействия;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКемВыдан) Тогда
			НайденнаяСтрока.ДокументКемВыдан = Результат.ДокументКемВыдан;
		КонецЕсли;
		Если ЗначениеЗаполнено(Результат.ДокументКодПодразделения) Тогда
			НайденнаяСтрока.ДокументКодПодразделения = Результат.ДокументКодПодразделения;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияКонтактнойИнформации(МассивЗастрахованных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Вид КАК Вид,
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных КАК ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.ДоговорСтрахования = &ДоговорСтрахования
		|	И ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", Результат.Застрахованный));
			Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
			СтруктураПоиска.Вставить("Вид", Результат.Вид);
			НайденныеСтрокиКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиКИ.Количество() = 0 Тогда
				НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.Добавить();
				НайденнаяСтрокаКИ.Застрахованный = Результат.Застрахованный;
				НайденнаяСтрокаКИ.Вид = Результат.Вид;
			Иначе
				НайденнаяСтрокаКИ = НайденныеСтрокиКИ[0];
			КонецЕсли;
			НайденнаяСтрокаКИ.Значение = Результат.Представление;
			НайденнаяСтрокаКИ.Представление = Результат.Представление;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзмененияДопРеквизитовИСведений(МассивЗастрахованных)
	
	Если Не ИспользоватьДополнительныеРеквизитыИСведения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Свойство КАК Свойство,
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных КАК ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных
		|ГДЕ
		|	ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.ДоговорСтрахования = &ДоговорСтрахования
		|	И ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.Застрахованный В(&МассивЗастрахованных)";
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("МассивЗастрахованных", МассивЗастрахованных);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если ТипЗнч(Результат.Застрахованный) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			НайденныеСтрокиСотрудники = Объект.Сотрудники.НайтиСтроки(Новый Структура("ФизическоеЛицо", Результат.Застрахованный));
			Если НайденныеСтрокиСотрудники.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НайденныеСтрокиСотрудники[0].ИзменилисьОтправленныеДанныеСотрудника = Истина;
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Застрахованный", Результат.Застрахованный);
			СтруктураПоиска.Вставить("Свойство", Результат.Свойство);
			НайденныеСтрокиДопРеквизитыИСведения = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиДопРеквизитыИСведения.Количество() = 0 Тогда
				НайденнаяСтрокаДопРеквизитыИСведения = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
				НайденнаяСтрокаДопРеквизитыИСведения.Застрахованный = Результат.Застрахованный;
				НайденнаяСтрокаДопРеквизитыИСведения.Свойство = Результат.Свойство;
			Иначе
				НайденнаяСтрокаДопРеквизитыИСведения = НайденныеСтрокиДопРеквизитыИСведения[0];
			КонецЕсли;
			НайденнаяСтрокаДопРеквизитыИСведения.Значение = Результат.Значение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СотрудникиПрикрепления(Запрос);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеСотрудники.Сотрудник КАК Сотрудник,
		|	ДокументПрикреплениеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументПрикреплениеСотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ДокументПрикреплениеСотрудники.Ссылка КАК Прикрепление,
		|	ДокументПрикреплениеСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ДокументПрикреплениеСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ДокументПрикреплениеСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ДокументПрикреплениеСотрудники.СуммаПредела КАК СуммаПредела,
		|	ДокументПрикреплениеСотрудники.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументПрикреплениеСотрудники.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
		|	ДокументПрикреплениеСотрудники.УдерживатьИзЗарплаты КАК УдерживатьИзЗарплаты,
		|	ДокументПрикреплениеСотрудники.Удержание КАК Удержание,
		|	ДокументПрикреплениеСотрудники.СпособУдержания КАК СпособУдержания,
		|	ДокументПрикреплениеСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания,
		|	ДокументПрикреплениеСотрудники.ЧастичноеУдержание КАК ЧастичноеУдержание,
		|	ДокументПрикреплениеСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ДокументПрикреплениеСотрудники.ПроцентЧастичногоУдержания КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ДокументПрикреплениеСотрудники
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументПрикреплениеСотрудники.Сотрудник В (&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументПрикреплениеСотрудники.Ссылка, ДокументПрикреплениеСотрудники.ФизическоеЛицо) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПоследниеПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеСотрудники.Сотрудник КАК Сотрудник,
		|	ДокументИзменениеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументИзменениеСотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ВЫБОР
		|		КОГДА &ЕстьДокументОснование
		|			ТОГДА &ДокументОснование
		|		ИНАЧЕ ДокументИзменениеСотрудники.Прикрепление
		|	КОНЕЦ КАК Прикрепление,
		|	ДокументИзменениеСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ДокументИзменениеСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ДокументИзменениеСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ДокументИзменениеСотрудники.СуммаПредела КАК СуммаПредела,
		|	ДокументИзменениеСотрудники.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументИзменениеСотрудники.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
		|	ДокументИзменениеСотрудники.УдерживатьИзЗарплаты КАК УдерживатьИзЗарплаты,
		|	ДокументИзменениеСотрудники.Удержание КАК Удержание,
		|	ДокументИзменениеСотрудники.СпособУдержания КАК СпособУдержания,
		|	ДокументИзменениеСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания,
		|	ДокументИзменениеСотрудники.ЧастичноеУдержание КАК ЧастичноеУдержание,
		|	ДокументИзменениеСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ДокументИзменениеСотрудники.ПроцентЧастичногоУдержания КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументИзменениеСотрудники
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументИзменениеСотрудники.Сотрудник В (&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументИзменениеСотрудники.Ссылка, ДокументИзменениеСотрудники.ФизическоеЛицо) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПоследниеПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПрограммыСтрахованияСотрудников(Запрос);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ДокументПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументПрикреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеПрограммыСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ДокументПрикреплениеПрограммыСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	НЕОПРЕДЕЛЕНО КАК Действие
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|		ДокументПрикреплениеПрограммыСтрахованияСотрудников
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник В
		|			(&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументПрикреплениеПрограммыСтрахованияСотрудников.Ссылка,
		|		ДокументПрикреплениеПрограммыСтрахованияСотрудников.Сотрудник.ФизическоеЛицо,
		|		ДокументПрикреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.ПрограммаСтрахования
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников
		|		ГДЕ
		|			ПрограммыСотрудников.Родственник = &БезРодственника)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеПрограммыСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ДокументИзменениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументИзменениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеПрограммыСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ДокументИзменениеПрограммыСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ДокументИзменениеПрограммыСтрахованияСотрудников.Действие = &ДействиеДобавить
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДокументИзменениеПрограммыСтрахованияСотрудников.Действие = &ДействиеИзменить
		|			ТОГДА &ДействиеНеИзменять
		|		ИНАЧЕ ДокументИзменениеПрограммыСтрахованияСотрудников.Действие
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК
		|		ДокументИзменениеПрограммыСтрахованияСотрудников
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументИзменениеПрограммыСтрахованияСотрудников.Сотрудник В (&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументИзменениеПрограммыСтрахованияСотрудников.Ссылка,
		|		ДокументИзменениеПрограммыСтрахованияСотрудников.Сотрудник.ФизическоеЛицо,
		|		ДокументИзменениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.ПрограммаСтрахования
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников
		|		ГДЕ
		|			ПрограммыСотрудников.Родственник = &БезРодственника)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РасширенияПрограммСтрахованияСотрудников(Запрос);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасширенияПрограммСотрудников.Регистратор КАК Регистратор,
		|	РасширенияПрограммСотрудников.РасширениеПрограммСтрахования КАК РасширениеСтрахования,
		|	РасширенияПрограммСотрудников.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТРасширенияПрограммСотрудников
		|ИЗ
		|	РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников.СрезПоследних(&ДатаИзменения,
		|		ДоговорСтрахования = &ДоговорСтрахования
		|	И Родственник = &БезРодственника
		|	И ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ФизическоеЛицо В (&МассивФизическихЛиц)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ) КАК РасширенияПрограммСотрудников
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	ФизическоеЛицо,
		|	РасширениеПрограммСтрахования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументПрикреплениеРасширенияПрограмм.Сотрудник КАК Сотрудник,
		|	ДокументПрикреплениеРасширенияПрограмм.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ДокументПрикреплениеРасширенияПрограмм.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеРасширенияПрограмм.ДатаНачала КАК ДатаНачала,
		|	ДокументПрикреплениеРасширенияПрограмм.ДатаОкончания КАК ДатаОкончания,
		|	НЕОПРЕДЕЛЕНО КАК Действие
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК
		|		ДокументПрикреплениеРасширенияПрограмм
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументПрикреплениеРасширенияПрограмм.Сотрудник В (&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументПрикреплениеРасширенияПрограмм.Ссылка, ДокументПрикреплениеРасширенияПрограмм.Сотрудник.ФизическоеЛицо,
		|		ДокументПрикреплениеРасширенияПрограмм.РасширениеСтрахования) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.РасширениеСтрахования
		|		ИЗ
		|			ВТРасширенияПрограммСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеРасширенияПрограмм.Сотрудник КАК Сотрудник,
		|	ДокументИзменениеРасширенияПрограмм.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ДокументИзменениеРасширенияПрограмм.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеРасширенияПрограмм.ДатаНачала КАК ДатаНачала,
		|	ДокументИзменениеРасширенияПрограмм.ДатаОкончания КАК ДатаОкончания,
		|	ВЫБОР
		|		КОГДА ДокументИзменениеРасширенияПрограмм.Действие = &ДействиеДобавить
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДокументИзменениеРасширенияПрограмм.Действие = &ДействиеИзменить
		|			ТОГДА &ДействиеНеИзменять
		|		ИНАЧЕ ДокументИзменениеРасширенияПрограмм.Действие
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК
		|		ДокументИзменениеРасширенияПрограмм
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборПоСотрудникам
		|			ТОГДА ДокументИзменениеРасширенияПрограмм.Сотрудник В (&МассивСотрудников)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И (ДокументИзменениеРасширенияПрограмм.Ссылка, ДокументИзменениеРасширенияПрограмм.Сотрудник.ФизическоеЛицо,
		|		ДокументИзменениеРасширенияПрограмм.РасширениеСтрахования) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.РасширениеСтрахования
		|		ИЗ
		|			ВТРасширенияПрограммСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ГрафикУдержаний(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументПрикреплениеГрафикУдержаний.Дата КАК Дата,
		|	ДокументПрикреплениеГрафикУдержаний.ДатаСтрокой КАК ДатаСтрокой,
		|	ДокументПрикреплениеГрафикУдержаний.Сумма КАК Сумма,
		|	ДокументПрикреплениеГрафикУдержаний.ВведеноПользователем КАК ВведеноПользователем,
		|	ДокументПрикреплениеГрафикУдержаний.КоличествоДней КАК КоличествоДней,
		|	ДокументПрикреплениеГрафикУдержаний.Представление КАК Представление
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ГрафикУдержаний КАК ДокументПрикреплениеГрафикУдержаний
		|ГДЕ
		|	(ДокументПрикреплениеГрафикУдержаний.Ссылка, ДокументПрикреплениеГрафикУдержаний.ФизическоеЛицо) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПоследниеПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументИзменениеГрафикУдержаний.Дата КАК Дата,
		|	ДокументИзменениеГрафикУдержаний.ДатаСтрокой КАК ДатаСтрокой,
		|	ДокументИзменениеГрафикУдержаний.Сумма КАК Сумма,
		|	ДокументИзменениеГрафикУдержаний.ВведеноПользователем КАК ВведеноПользователем,
		|	ДокументИзменениеГрафикУдержаний.КоличествоДней КАК КоличествоДней,
		|	ДокументИзменениеГрафикУдержаний.Представление КАК Представление
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ГрафикУдержаний КАК ДокументИзменениеГрафикУдержаний
		|ГДЕ
		|	(ДокументИзменениеГрафикУдержаний.Ссылка, ДокументИзменениеГрафикУдержаний.ФизическоеЛицо) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПоследниеПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РодственникиПрикрепления(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеРодственники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументПрикреплениеРодственники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ДокументПрикреплениеРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ДокументПрикреплениеРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ДокументПрикреплениеРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ДокументПрикреплениеРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеРодственники.УдерживатьССотрудника КАК УдерживатьССотрудника,
		|	ДокументПрикреплениеРодственники.РодственникСсылка КАК РодственникСсылка,
		|	НЕОПРЕДЕЛЕНО КАК Действие
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ДокументПрикреплениеРодственники
		|ГДЕ
		|	(ДокументПрикреплениеРодственники.Ссылка, ДокументПрикреплениеРодственники.ФизическоеЛицо,
		|		ДокументПрикреплениеРодственники.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеРодственники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументИзменениеРодственники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ДокументИзменениеРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ДокументИзменениеРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ДокументИзменениеРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ДокументИзменениеРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеРодственники.УдерживатьССотрудника КАК УдерживатьССотрудника,
		|	ДокументИзменениеРодственники.РодственникСсылка КАК РодственникСсылка,
		|	ВЫБОР
		|		КОГДА ДокументИзменениеРодственники.Действие = &ДействиеДобавить
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДокументИзменениеРодственники.Действие = &ДействиеИзменить
		|			ТОГДА &ДействиеНеИзменять
		|		ИНАЧЕ ДокументИзменениеРодственники.Действие
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ДокументИзменениеРодственники
		|ГДЕ
		|	(ДокументИзменениеРодственники.Ссылка, ДокументИзменениеРодственники.ФизическоеЛицо,
		|		ДокументИзменениеРодственники.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПрограммыСтрахованияРодственников(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ДокументПрикреплениеПрограммыСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка,
		|	НЕОПРЕДЕЛЕНО КАК Действие
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|		ДокументПрикреплениеПрограммыСтрахованияРодственников
		|ГДЕ
		|	(ДокументПрикреплениеПрограммыСтрахованияРодственников.Ссылка,
		|		ДокументПрикреплениеПрограммыСтрахованияРодственников.ФизическоеЛицо,
		|		ДокументПрикреплениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|		ДокументПрикреплениеПрограммыСтрахованияРодственников.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.ПрограммаСтрахования,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеПрограммыСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументИзменениеПрограммыСтрахованияРодственников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ДокументИзменениеПрограммыСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеПрограммыСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ДокументИзменениеПрограммыСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ДокументИзменениеПрограммыСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка,
		|	ВЫБОР
		|		КОГДА ДокументИзменениеПрограммыСтрахованияРодственников.Действие = &ДействиеДобавить
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДокументИзменениеПрограммыСтрахованияРодственников.Действие = &ДействиеИзменить
		|			ТОГДА &ДействиеНеИзменять
		|		ИНАЧЕ ДокументИзменениеПрограммыСтрахованияРодственников.Действие
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК
		|		ДокументИзменениеПрограммыСтрахованияРодственников
		|ГДЕ
		|	(ДокументИзменениеПрограммыСтрахованияРодственников.Ссылка,
		|		ДокументИзменениеПрограммыСтрахованияРодственников.ФизическоеЛицо,
		|		ДокументИзменениеПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|		ДокументИзменениеПрограммыСтрахованияРодственников.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.ПрограммаСтрахования,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция РасширенияПрограммСтрахованияРодственников(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеРасширенияПрограмм.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументПрикреплениеРасширенияПрограмм.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ДокументПрикреплениеРасширенияПрограмм.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументПрикреплениеРасширенияПрограмм.ДатаНачала КАК ДатаНачала,
		|	ДокументПрикреплениеРасширенияПрограмм.ДатаОкончания КАК ДатаОкончания,
		|	ДокументПрикреплениеРасширенияПрограмм.РодственникСсылка КАК РодственникСсылка,
		|	НЕОПРЕДЕЛЕНО КАК Действие
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ДокументПрикреплениеРасширенияПрограмм
		|ГДЕ
		|	(ДокументПрикреплениеРасширенияПрограмм.Ссылка, ДокументПрикреплениеРасширенияПрограмм.ФизическоеЛицо,
		|		ДокументПрикреплениеРасширенияПрограмм.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеРасширенияПрограмм.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументИзменениеРасширенияПрограмм.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ДокументИзменениеРасширенияПрограмм.СтраховаяПремия КАК СтраховаяПремия,
		|	ДокументИзменениеРасширенияПрограмм.ДатаНачала КАК ДатаНачала,
		|	ДокументИзменениеРасширенияПрограмм.ДатаОкончания КАК ДатаОкончания,
		|	ДокументИзменениеРасширенияПрограмм.РодственникСсылка КАК РодственникСсылка,
		|	ВЫБОР
		|		КОГДА ДокументИзменениеРасширенияПрограмм.Действие = &ДействиеДобавить
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		КОГДА ДокументИзменениеРасширенияПрограмм.Действие = &ДействиеИзменить
		|			ТОГДА &ДействиеНеИзменять
		|		ИНАЧЕ ДокументИзменениеРасширенияПрограмм.Действие
		|	КОНЕЦ КАК Действие
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ДокументИзменениеРасширенияПрограмм
		|ГДЕ
		|	(ДокументИзменениеРасширенияПрограмм.Ссылка, ДокументИзменениеРасширенияПрограмм.ФизическоеЛицо,
		|		ДокументИзменениеРасширенияПрограмм.РодственникСсылка) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо,
		|			ПрограммыСотрудников.Родственник
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДанныеЗастрахованных(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ДокументПрикреплениеДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.Пол КАК Пол,
		|	ДокументПрикреплениеДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.Страна КАК Страна,
		|	ДокументПрикреплениеДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ДокументПрикреплениеДанныеЗастрахованных.Имя КАК Имя,
		|	ДокументПрикреплениеДанныеЗастрахованных.Отчество КАК Отчество,
		|	ДокументПрикреплениеДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ДокументПрикреплениеДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК
		|		ДокументПрикреплениеДанныеЗастрахованных
		|ГДЕ
		|	(ДокументПрикреплениеДанныеЗастрахованных.Ссылка, ДокументПрикреплениеДанныеЗастрахованных.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ДокументИзменениеДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ДокументИзменениеДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ДокументИзменениеДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.Пол КАК Пол,
		|	ДокументИзменениеДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.Страна КАК Страна,
		|	ДокументИзменениеДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ДокументИзменениеДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ДокументИзменениеДанныеЗастрахованных.Имя КАК Имя,
		|	ДокументИзменениеДанныеЗастрахованных.Отчество КАК Отчество,
		|	ДокументИзменениеДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ДокументИзменениеДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ДанныеЗастрахованных КАК ДокументИзменениеДанныеЗастрахованных
		|ГДЕ
		|	(ДокументИзменениеДанныеЗастрахованных.Ссылка, ДокументИзменениеДанныеЗастрахованных.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция КонтактнаяИнформацияЗастрахованных(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеКонтактнаяИнформация.Застрахованный КАК Застрахованный,
		|	ДокументПрикреплениеКонтактнаяИнформация.Вид КАК Вид,
		|	ДокументПрикреплениеКонтактнаяИнформация.Значение КАК Значение,
		|	ДокументПрикреплениеКонтактнаяИнформация.Представление КАК Представление,
		|	ДокументПрикреплениеКонтактнаяИнформация.Значение КАК ЗначениеДоИзменения,
		|	ДокументПрикреплениеКонтактнаяИнформация.Представление КАК ПредставлениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ДокументПрикреплениеКонтактнаяИнформация
		|ГДЕ
		|	(ДокументПрикреплениеКонтактнаяИнформация.Ссылка, ДокументПрикреплениеКонтактнаяИнформация.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеКонтактнаяИнформация.Застрахованный КАК Застрахованный,
		|	ДокументИзменениеКонтактнаяИнформация.Вид КАК Вид,
		|	ДокументИзменениеКонтактнаяИнформация.Значение КАК Значение,
		|	ДокументИзменениеКонтактнаяИнформация.Представление КАК Представление,
		|	ДокументИзменениеКонтактнаяИнформация.Значение КАК ЗначениеДоИзменения,
		|	ДокументИзменениеКонтактнаяИнформация.Представление КАК ПредставлениеДоИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ДокументИзменениеКонтактнаяИнформация
		|ГДЕ
		|	(ДокументИзменениеКонтактнаяИнформация.Ссылка, ДокументИзменениеКонтактнаяИнформация.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ДополнительныеРеквизитыИСведенияЗастрахованных(Запрос)

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументПрикреплениеДопРеквизиты.Застрахованный КАК Застрахованный,
		|	ДокументПрикреплениеДопРеквизиты.Свойство КАК Свойство,
		|	ДокументПрикреплениеДопРеквизиты.Значение КАК Значение,
		|	ДокументПрикреплениеДопРеквизиты.Значение КАК ЗначениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК
		|		ДокументПрикреплениеДопРеквизиты
		|ГДЕ
		|	(ДокументПрикреплениеДопРеквизиты.Ссылка, ДокументПрикреплениеДопРеквизиты.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументИзменениеДопРеквизиты.Застрахованный КАК Застрахованный,
		|	ДокументИзменениеДопРеквизиты.Свойство КАК Свойство,
		|	ДокументИзменениеДопРеквизиты.Значение КАК Значение,
		|	ДокументИзменениеДопРеквизиты.Значение КАК ЗначениеДоИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК
		|		ДокументИзменениеДопРеквизиты
		|ГДЕ
		|	(ДокументИзменениеДопРеквизиты.Ссылка, ДокументИзменениеДопРеквизиты.Застрахованный) В
		|		(ВЫБРАТЬ
		|			ПрограммыСотрудников.Регистратор,
		|			ПрограммыСотрудников.ФизическоеЛицо
		|		ИЗ
		|			ВТПрограммыСотрудников КАК ПрограммыСотрудников)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьИзЗарплаты Тогда
			ПересчитатьУдержания(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаСотрудника;
	ПрограммыСтрахования = Результат;
	ТекущиеДанные.ПрограммыСтрахования = "";
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.ПрограммыСтрахованияСотрудников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	НаименованияПрограмм = Новый Массив;
	Для каждого ЭлементМассива Из ПрограммыСтрахования Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияСотрудников.Добавить();
		НоваяСтрока.Сотрудник = ТекущиеДанные.Сотрудник;
		НоваяСтрока.ПрограммаСтрахования = ЭлементМассива.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		НоваяСтрока.Действие = ЭлементМассива.Действие;
		НаименованияПрограмм.Добавить(ЭлементМассива.ПрограммаСтрахования);
	КонецЦикла;
	Для Каждого ПрограммаНаименование Из ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаименованияПрограмм) Цикл
		ТекущиеДанные.ПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования + ПрограммаНаименование + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.ПрограммыСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.ПрограммыСтрахования, 2);
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
	РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиРасширенияПрограммЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьИзЗарплаты Тогда
			ПересчитатьУдержания(ТекущиеДанные);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиРасширенияПрограммЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаСотрудника;
	РасширенияСтрахования = Результат;
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура("Сотрудник", ТекущиеДанные.Сотрудник);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.РасширенияПрограммСтрахованияСотрудников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из РасширенияСтрахования Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияСотрудников.Добавить();
		НоваяСтрока.Сотрудник = ТекущиеДанные.Сотрудник;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		НоваяСтрока.Действие = ЭлементМассива.Действие;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
		
	РассчитатьСтраховуюПремиюСотрудников(СтрокаСотрудника.Сотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьССотрудника Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанныеСотрудники);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиПрограммыСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаРодственника;
	ПрограммыСтрахования = Результат;
	ТекущиеДанные.ПрограммыСтрахования = "";
	СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
	НайденныеСтроки = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.ПрограммыСтрахованияРодственников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из ПрограммыСтрахования Цикл
		НоваяСтрока = Объект.ПрограммыСтрахованияРодственников.Добавить();
		НоваяСтрока.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
		НоваяСтрока.РодственникСсылка = ТекущиеДанные.РодственникСсылка;
		НоваяСтрока.ПрограммаСтрахования = ЭлементМассива.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		Если ЭлементМассива.Свойство("Действие") Тогда
			НоваяСтрока.Действие = ЭлементМассива.Действие;
		Иначе
			НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;
		КонецЕсли;
		ТекущиеДанные.ПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования + ЭлементМассива.ПрограммаСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.ПрограммыСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.ПрограммыСтрахования, 2);
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактирования(Результат, ТекущиеДанные) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ТекущиеДанные.ПолучитьИдентификатор());
		
		Если ИспользуютсяУдержания И ТекущиеДанные.УдерживатьССотрудника Тогда
			ТекущиеДанныеСотрудники = Элементы.Сотрудники.ТекущиеДанные;
			Если ТекущиеДанныеСотрудники = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ПересчитатьУдержания(ТекущиеДанныеСотрудники);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РодственникиРасширенияПрограммСтрахованияЗавершениеРедактированияНаСервере(Результат, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущиеДанные = СтрокаРодственника;
	РасширенияСтрахования = Результат;
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура("РодственникСсылка", ТекущиеДанные.РодственникСсылка);
	НайденныеСтроки = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект.РасширенияПрограммСтрахованияРодственников.Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для Каждого ЭлементМассива Из РасширенияСтрахования Цикл
		НоваяСтрока = Объект.РасширенияПрограммСтрахованияРодственников.Добавить();
		НоваяСтрока.ФизическоеЛицо = ТекущиеДанные.ФизическоеЛицо;
		НоваяСтрока.РодственникСсылка = ТекущиеДанные.РодственникСсылка;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		Если ЭлементМассива.Свойство("Действие") Тогда
			НоваяСтрока.Действие = ЭлементМассива.Действие;
		Иначе
			НоваяСтрока.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить;
		КонецЕсли;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	РассчитатьСтраховуюПремиюРодственников(СтрокаРодственника.РодственникСсылка);
	
КонецПроцедуры

&НаСервере
Процедура РодственникиОбработкаВыбораНаСервере(Родственник, ИдентификаторСтроки)
	
	СтрокаРодственника = Объект.Родственники.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаРодственника.РодственникСсылка = Родственник;
	
	Если Не ЗначениеЗаполнено(Объект.ДоговорСтрахования) Тогда
		Возврат;
	КонецЕсли;
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	ЗначенияРеквизитовРодственника =
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родственник, "Фамилия,Имя,Отчество,ДатаРождения,СНИЛС");
	
	СтрокаРодственника.Фамилия = ЗначенияРеквизитовРодственника.Фамилия;
	СтрокаРодственника.ФамилияДоИзменения = ЗначенияРеквизитовРодственника.Фамилия;
	СтрокаРодственника.Имя = ЗначенияРеквизитовРодственника.Имя;
	СтрокаРодственника.ИмяДоИзменения = ЗначенияРеквизитовРодственника.Имя;
	СтрокаРодственника.Отчество = ЗначенияРеквизитовРодственника.Отчество;
	СтрокаРодственника.ОтчествоДоИзменения = ЗначенияРеквизитовРодственника.Отчество;
	
	Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
		СтрокаРодственника.ДатаРождения = ЗначенияРеквизитовРодственника.ДатаРождения;
		СтрокаРодственника.ДатаРожденияДоИзменения = ЗначенияРеквизитовРодственника.ДатаРождения;
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
		ПолРодственника = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПолПоЧастямФИО(СтрокаРодственника);
		СтрокаРодственника.Пол = ПолРодственника;
		СтрокаРодственника.ПолДоИзменения = ПолРодственника;
	КонецЕсли;
	
	Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
		СтрокаРодственника.СтраховойНомерПФР = ЗначенияРеквизитовРодственника.СНИЛС;
		СтрокаРодственника.СтраховойНомерПФРДоИзменения = ЗначенияРеквизитовРодственника.СНИЛС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РодственникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьФорму()
	
	ТаблицыСоСведениями = Новый Соответствие;
	ТаблицыСоСведениями.Вставить("Сотрудники", "ГруппаСведенияСтрахованияСотрудника");
	ТаблицыСоСведениями.Вставить("Родственники", "ГруппаСведенияСтрахованияРодственника");
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеДополнитьФорму(ЭтотОбъект, ТаблицыСоСведениями, Объект.ДоговорСтрахования);
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОсновныхПолейНаСервере(ИзменятьПериодСтрахования = Ложь, ПерезаполнятьДанныеСотрудников = Ложь)
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеПрочитатьНастройки(ЭтотОбъект, ИзменятьПериодСтрахования);
	Если ПерезаполнятьДанныеСотрудников Тогда
		СотрудникиЗаполнитьНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСуммаПредела", "Доступность", ПрекратитьУдержания);
	
КонецПроцедуры

&НаСервере
Процедура СотрудникиДатаНачалаПриИзмененииНаСервере(Сотрудник, ДатаПрикрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("Сотрудник", Сотрудник);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		Если СтрокаТаблицы.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Изменить Тогда
			ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
			ПараметрыРасчета.ДатаОкончания = ДатаПрикрепления;
		ИначеЕсли СтрокаТаблицы.Действие = Перечисления.ДействияСПрограммамиМедицинскогоСтрахования.Добавить Тогда
			ПараметрыРасчета.ДатаНачала = ДатаПрикрепления;
			ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		Иначе
			ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
			ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		КонецЕсли;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияСотрудников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюСотрудников(Сотрудник);
	
КонецПроцедуры

&НаСервере
Процедура РодственникиДатаПриИзмененииНаСервере(РодственникСсылка, ДатаПрикрепления, ДатаОткрепления, ДатаРождения)
	
	ПараметрыОтбора = Новый Структура("РодственникСсылка", РодственникСсылка);
	СтрокиПрограмм = Объект.ПрограммыСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиПрограмм Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.ПрограммаСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	СтрокиРасширений = Объект.РасширенияПрограммСтрахованияРодственников.НайтиСтроки(ПараметрыОтбора);
	Для Каждого СтрокаТаблицы Из СтрокиРасширений Цикл
		СтрокаТаблицы.ДатаНачала = ДатаПрикрепления;
		СтрокаТаблицы.ДатаОкончания = ДатаОткрепления;
		ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
		ПараметрыРасчета.ДатаНачала = СтрокаТаблицы.ДатаНачала;
		ПараметрыРасчета.ДатаОкончания = СтрокаТаблицы.ДатаОкончания;
		ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
		ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
		ПараметрыРасчета.ДатаРождения = ДатаРождения;
		ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастовДляРодственников;
		ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(СтрокаТаблицы.РасширениеСтрахования);
		СтрокаТаблицы.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюРодственников(РодственникСсылка);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюСотрудников(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюСотрудников(Объект, СтруктураИменТаблиц, Сотрудники);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСтраховуюПремиюРодственников(Родственники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	МедицинскоеСтрахованиеФормы.РассчитатьСтраховуюПремиюРодственников(Объект, СтруктураИменТаблиц, Родственники);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокРодственников(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = ?(ФизическоеЛицо = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Родственники", "ОтборСтрок", СтруктураОтбора);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрокПоказателей(Элементы, ИдентификаторСтроки)
	
	СтруктураОтбора = ?(ИдентификаторСтроки = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ИдентификаторСтрокиВидаРасчета", ИдентификаторСтроки));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Показатели", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборГрафикаУдержаний(Элементы, ФизическоеЛицо)
	
	СтруктураОтбора = ?(ФизическоеЛицо = Неопределено, Неопределено, Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрафикУдержаний", "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования;
	Если ПустаяСтрока(СотрудникиПрограммыСтрахования) Тогда
		СотрудникиПрограммыСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные)
	
	СотрудникиРасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования;
	Если ПустаяСтрока(СотрудникиРасширенияПрограммСтрахования) Тогда
		СотрудникиРасширенияПрограммСтрахования = НСтр("ru = '<Не указаны>'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ИзменятьПериодСтрахования = Ложь)
	
	ОписаниеКлючевыхРеквизитов = КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов();
	ТаблицыОчищаемыеПриИзменении = КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении();
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект, ОписаниеКлючевыхРеквизитов);
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны();
	
	ДополнитьФорму();
	ДанныеВРеквизиты();
	ПриИзмененииОсновныхПолейНаСервере(ИзменятьПериодСтрахования);
	
КонецПроцедуры

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	КлючевыеРеквизиты = Новый Массив;
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация",     НСтр("ru = 'организации'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "Подразделение", НСтр("ru = 'подразделения'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "СтраховаяКомпания", НСтр("ru = 'страховой компании'")));
	КлючевыеРеквизиты.Добавить(Новый Структура("ЭлементФормы, Представление", "ДоговорСтрахования", НСтр("ru = 'договора страхования'")));
	
	Возврат КлючевыеРеквизиты;
	
КонецФункции

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	ОчищаемыеТаблицы = Новый Массив;
	ОчищаемыеТаблицы.Добавить("Объект.Сотрудники");
	ОчищаемыеТаблицы.Добавить("Объект.ПрограммыСтрахованияСотрудников");
	ОчищаемыеТаблицы.Добавить("Объект.РасширенияПрограммСтрахованияСотрудников");
	ОчищаемыеТаблицы.Добавить("Объект.Родственники");
	ОчищаемыеТаблицы.Добавить("Объект.ПрограммыСтрахованияРодственников");
	ОчищаемыеТаблицы.Добавить("Объект.РасширенияПрограммСтрахованияРодственников");
	ОчищаемыеТаблицы.Добавить("Объект.Показатели");
	ОчищаемыеТаблицы.Добавить("Объект.ГрафикУдержаний");
	ОчищаемыеТаблицы.Добавить("Объект.ДанныеЗастрахованных");
	ОчищаемыеТаблицы.Добавить("Объект.КонтактнаяИнформацияЗастрахованных");
	ОчищаемыеТаблицы.Добавить("Объект.ДополнительныеРеквизитыИСведенияЗастрахованных");
		
	Возврат ОчищаемыеТаблицы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма)
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(Форма);
	
КонецФункции

&НаСервере
Процедура ДанныеВРеквизиты()
	
	ИспользоватьДополнительныеРеквизитыИСведения = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны();
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	ОтправляемаяКонтактнаяИнформация = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ОтправляемыеДопРеквизитыИСведения = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
    КонецЕсли;
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаСотрудника.ФизическоеЛицо);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСотрудника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаСотрудника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаСотрудника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаСотрудника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаСотрудника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаСотрудника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаСотрудника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаСотрудника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаСотрудника.ФизическоеЛицо, ОтправляемаяКИ.Вид);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "ДоИзменения"] = НайденнаяСтрокаКИ[0].ЗначениеДоИзменения;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
			СтрокаСотрудника[ОтправляемаяКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"] = НайденнаяСтрокаКИ[0].ПредставлениеДоИзменения;
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого СтрСвойства Из ОтправляемыеДопРеквизитыИСведения Цикл
				ОтборСтрок = Новый Структура("Застрахованный, Свойство", СтрокаСотрудника.ФизическоеЛицо, СтрСвойства.Свойство);
				НайденнаяСтрокаСвойств = Объект.ДополнительныеРеквизитыИСведенияЗастрахованных.НайтиСтроки(ОтборСтрок);
				Если НайденнаяСтрокаСвойств.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
				СтрокаСотрудника[СтрСвойства.Имя] = НайденнаяСтрокаСвойств[0].Значение;
				СтрокаСотрудника[СтрСвойства.Имя + "ДоИзменения"] = НайденнаяСтрокаСвойств[0].ЗначениеДоИзменения;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		ОтборСтрок = Новый Структура("Застрахованный", СтрокаРодственника.РодственникСсылка);
		НайденнаяСтрока = Объект.ДанныеЗастрахованных.НайтиСтроки(ОтборСтрок);
		Если НайденнаяСтрока.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРодственника.Фамилия = НайденнаяСтрока[0].Фамилия;
		СтрокаРодственника.ФамилияДоИзменения = НайденнаяСтрока[0].ФамилияДоИзменения;
		СтрокаРодственника.Имя = НайденнаяСтрока[0].Имя;
		СтрокаРодственника.ИмяДоИзменения = НайденнаяСтрока[0].ИмяДоИзменения;
		СтрокаРодственника.Отчество = НайденнаяСтрока[0].Отчество;
		СтрокаРодственника.ОтчествоДоИзменения = НайденнаяСтрока[0].ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			СтрокаРодственника[Сведение] = НайденнаяСтрока[0][Сведение];
			СтрокаРодственника[Сведение + "ДоИзменения"] = НайденнаяСтрока[0][Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ОтправляемаяКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			ОтборСтрок = Новый Структура("Застрахованный, Вид", СтрокаРодственника.РодственникСсылка, ОтправляемаяКИ.Вид);
			НайденнаяСтрокаКИ = Объект.КонтактнаяИнформацияЗастрахованных.НайтиСтроки(ОтборСтрок);
			Если НайденнаяСтрокаКИ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "ДоИзменения"] = НайденнаяСтрокаКИ[0].Значение;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "Представление"] = НайденнаяСтрокаКИ[0].Представление;
			СтрокаРодственника[ОтправляемаяКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"] = НайденнаяСтрокаКИ[0].Представление;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РеквизитыВДанные(ТекущийОбъект)
	
	ТекущийОбъект.ДанныеЗастрахованных.Очистить();
	ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Очистить();
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	ОтправляемаяКонтактнаяИнформация = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	
	Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
		ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Очистить();
		ОтправляемыеДопРеквизитыИСведения = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	КонецЕсли;
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
		НоваяСтрока.Фамилия = СтрокаСотрудника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаСотрудника.ФамилияДоИзменения;
		НоваяСтрока.Имя = СтрокаСотрудника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаСотрудника.ИмяДоИзменения;
		НоваяСтрока.Отчество = СтрокаСотрудника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаСотрудника.ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаСотрудника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаСотрудника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
			НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
			НоваяСтрока.Вид = ВидКИ.Вид;
			НоваяСтрока.Значение = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул];
			НоваяСтрока.Представление = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "Представление"];
			НоваяСтрока.ЗначениеДоИзменения = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "ДоИзменения"];
			НоваяСтрока.ПредставлениеДоИзменения = СтрокаСотрудника[ВидКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"];
		КонецЦикла;
		Если ИспользоватьДополнительныеРеквизитыИСведения Тогда
			Для Каждого СтрСвойства Из ОтправляемыеДопРеквизитыИСведения Цикл
				НоваяСтрока = ТекущийОбъект.ДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
				НоваяСтрока.Застрахованный = СтрокаСотрудника.ФизическоеЛицо;
				НоваяСтрока.Свойство = СтрСвойства.Свойство;
				НоваяСтрока.Значение = СтрокаСотрудника[СтрСвойства.Имя];
				НоваяСтрока.ЗначениеДоИзменения = СтрокаСотрудника[СтрСвойства.Имя + "ДоИзменения"];
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаРодственника Из Объект.Родственники Цикл
		НоваяСтрока = ТекущийОбъект.ДанныеЗастрахованных.Добавить();
		НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
		НоваяСтрока.Фамилия = СтрокаРодственника.Фамилия;
		НоваяСтрока.ФамилияДоИзменения = СтрокаРодственника.ФамилияДоИзменения;
		НоваяСтрока.Имя = СтрокаРодственника.Имя;
		НоваяСтрока.ИмяДоИзменения = СтрокаРодственника.ИмяДоИзменения;
		НоваяСтрока.Отчество = СтрокаРодственника.Отчество;
		НоваяСтрока.ОтчествоДоИзменения = СтрокаРодственника.ОтчествоДоИзменения;
		Для Каждого Сведение Из ОтправляемыеДанные Цикл
			НоваяСтрока[Сведение] = СтрокаРодственника[Сведение];
			НоваяСтрока[Сведение + "ДоИзменения"] = СтрокаРодственника[Сведение + "ДоИзменения"];
		КонецЦикла;
		Для Каждого ВидКИ Из ОтправляемаяКонтактнаяИнформация Цикл
			НоваяСтрока = ТекущийОбъект.КонтактнаяИнформацияЗастрахованных.Добавить();
			НоваяСтрока.Застрахованный = СтрокаРодственника.РодственникСсылка;
			НоваяСтрока.Вид = ВидКИ.Вид;
			НоваяСтрока.Значение = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул];
			НоваяСтрока.ЗначениеДоИзменения = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "ДоИзменения"];
			НоваяСтрока.Представление = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "Представление"];
			НоваяСтрока.ПредставлениеДоИзменения = СтрокаРодственника[ВидКИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения"];
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура РодственникиЗаполнитьНаСервере(Сотрудник)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийСотрудников = "СведенияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийРодственников = "СведенияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнитьРодственников(ЭтотОбъект, СтруктураИменТаблиц, Объект.Ссылка, Сотрудник);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Сотрудники.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура СотрудникиОбработкаВыбораНаСервере(ВыбранныеСотрудники)

	Если ТипЗнч(ВыбранныеСотрудники) = Тип("Массив") Тогда
		СписокСотрудников = ВыбранныеСотрудники;
	Иначе
		СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеСотрудники);
	КонецЕсли;
	
	Если СписокСотрудников.Количество() > 0 Тогда
		СотрудникиЗаполнитьНаСервере(СписокСотрудников, , Истина);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтправкиПисьма(ВыбранноеЗначение)
	Возврат МедицинскоеСтрахование.ПараметрыОтправкиПисьма(ЭтотОбъект, ВыбранноеЗначение, Получатели, НСтр("ru = 'Прикрепление сотрудников'"));
КонецФункции

&НаКлиенте
Процедура ЗаполнениеСведенийСтрахованияЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Модифицированность = Истина;
		ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры);
		ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры);
		ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			УстановитьНадписьПрограммСтрахования(ТекущиеДанные);
			УстановитьНадписьРасширенийПрограммСтрахования(ТекущиеДанные);
			Если ИспользуютсяУдержания Тогда
				УстановитьНадписиУдержаний(ТекущиеДанные.ФизическоеЛицо);
				Если ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
					ОбновитьПодвалГрафикаУдержаний();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеСведенийСтрахованияЗакрытиеНаСервере(Результат, ДополнительныеПараметры)
	
	МассивСотрудников = Новый Массив;
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ДатаПрикрепления = Результат.ДатаНачалаСтрахования;
		СтрокаСотрудника.СуммаУдержания = Результат.СуммаУдержания;
		СтрокаСотрудника.СуммаПредела = Результат.СуммаПредела;
		
		МассивСтруктурПрограмм = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.ПрограммыСтрахования Цикл
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", ЭлементСписка);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураПрограммы.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураПрограммы.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураПрограммы.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураПрограммы.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЦикла;
		МассивСтруктурРасширений = Новый Массив;
		Для Каждого ЭлементСписка Из Результат.РасширенияПрограммСтрахования Цикл
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", ЭлементСписка);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаСотрудника.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			Если Результат.СтраховаяПремия = 0 Тогда
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = СтруктураРасширения.ДатаНачала;
				ПараметрыРасчета.ДатаОкончания = СтруктураРасширения.ДатаОкончания;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = СтрокаСотрудника.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ЭлементСписка);
				СтруктураРасширения.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
			Иначе
				СтруктураРасширения.Вставить("СтраховаяПремия", Результат.СтраховаяПремия);
			КонецЕсли;
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЦикла;
		МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		МассивСотрудников.Добавить(СтрокаСотрудника.Сотрудник);
	КонецЦикла;
	РассчитатьСтраховуюПремиюСотрудников(МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСотрудниковИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСотрудниковИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ЗагруженныеДанные.Сортировать("Сотрудник");
	
	СотрудникиДобавлены = Ложь;
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийСотрудников = "СведенияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыСведенийРодственников = "СведенияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	Для Каждого ТаблицаДокумента Из СтруктураИменТаблиц Цикл
		Объект[ТаблицаДокумента.Значение].Очистить();
	КонецЦикла;
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, Истина, Истина, Истина, ЗагруженныеДанные.ВыгрузитьКолонку("Сотрудник"));
	
	ТекущийСотрудник = Неопределено;
	МассивСтруктурПрограмм = Новый Массив;
	МассивСтруктурРасширений = Новый Массив;
	СтрокаСотрудника = Неопределено;
	Для Каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТекущийСотрудник <> СтрокаТаблицы.Сотрудник Тогда
			Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
			КонецЕсли;
			Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
				МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
			КонецЕсли;
			ТекущийСотрудник = СтрокаТаблицы.Сотрудник;
			МассивСтруктурПрограмм = Новый Массив;
			МассивСтруктурРасширений = Новый Массив;
			
			СтруктураОтбора = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаСотрудника = Объект.Сотрудники.Добавить();
			Иначе
				СтрокаСотрудника = НайденныеСтроки[0];
				СтрокаСотрудника.СтраховаяПремия = 0;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаСотрудника.Сотрудник = СтрокаТаблицы.Сотрудник;
		СтрокаСотрудника.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.Сотрудник, "ФизическоеЛицо");
		СтрокаСотрудника.ДатаПрикрепления = СтрокаТаблицы.ДатаПрикрепления;
		СтрокаСотрудника.СтраховаяПремия = СтрокаСотрудника.СтраховаяПремия + СтрокаТаблицы.СтраховаяПремия;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПрограммаСтрахования) Тогда
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", СтрокаТаблицы.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураПрограммы.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураПрограммы.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.РасширениеПрограммСтрахования) Тогда
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", СтрокаТаблицы.РасширениеПрограммСтрахования);
			СтруктураРасширения.Вставить("ДатаНачала", СтрокаТаблицы.ДатаПрикрепления);
			СтруктураРасширения.Вставить("ДатаОкончания", Объект.ДатаОкончанияСтрахования);
			СтруктураРасширения.Вставить("СтраховаяПремия", СтрокаТаблицы.СтраховаяПремия);
			МассивСтруктурРасширений.Добавить(СтруктураРасширения);
		КонецЕсли;
		
		СотрудникиДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТекущийСотрудник <> Неопределено Тогда
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурПрограмм.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьПрограммыСтрахования(Объект, СтрокаСотрудника, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		КонецЕсли;
		Если СтрокаСотрудника <> Неопределено И МассивСтруктурРасширений.Количество() > 0 Тогда
			МедицинскоеСтрахованиеФормы.УстановитьРасширенияПрограммСтрахования(Объект, СтрокаСотрудника, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", МассивСтруктурРасширений);
		КонецЕсли;
	КонецЕсли;
	
	Если СотрудникиДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдержаниеПриИзмененииНаСервере()
	
	ЗаполнитьДействиеИПоказатели();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеТаблицыУдержаний()
	
	ОписаниеТаблицы = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеТаблицыРасчета();
	ОписаниеТаблицы.ИмяТаблицы = "Сотрудники";
	ОписаниеТаблицы.ПутьКДанным = "Объект.Сотрудники";
	ОписаниеТаблицы.ИмяРеквизитаВидРасчета = "Удержание";
	ОписаниеТаблицы.СодержитПолеВидРасчета = Ложь;
	ОписаниеТаблицы.СодержитПолеСотрудник = Истина;
	ОписаниеТаблицы.ИмяРеквизитаСотрудник = "Сотрудник";
	ОписаниеТаблицы.ЭтоПлановыеНачисленияУдержания = Истина;
	ОписаниеТаблицы.НомерТаблицы = 2;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДействиеИПоказатели()
	
	ДокументыПлановыхУдержанийЗаполнитьПоказатели();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	РасчетЗарплатыРасширенныйФормы.ДокументыПлановыхУдержанийУстановитьВидимостьПоказателей(Элементы, Объект.Удержание);
	РасчетЗарплатыРасширенныйФормы.ДокументыПлановыхУдержанийУстановитьВидимостьРазмера(Элементы, Объект.Удержание, "ГруппаУдержания");
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПлановыхУдержанийЗаполнитьПоказатели()
	
	// Принимается решение о том, показывать ли таблицу показателей.
	// Если показывать, то таблица заполняется по состоянию на указанную дату действия.
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	
	// Удалим показатели, которых нет в удержании
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого СтрокаПоказателей Из Объект.Показатели Цикл
		ПоказательНайден = Ложь;
		Для каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если СтрокаПоказателей.Показатель = ДанныеПоказателя.Показатель Тогда
				ПоказательНайден = Истина;
			КонецЕсли
		КонецЦикла;
		Если Не ПоказательНайден Тогда
			МассивСтрокДляУдаления.Добавить(СтрокаПоказателей);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаДляУдаления Из МассивСтрокДляУдаления Цикл
		Объект.Показатели.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ТаблицаУдержаний = ОписаниеТаблицыУдержаний();
	ИдентификаторСтрокиВидаРасчета = ТаблицаУдержаний.НомерТаблицы * 1000000 + 1;
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		
		ТекущийИдентификаторСтрокиВидаРасчета = СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета;
		
		Для Каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл
			Если ДанныеПоказателя.ЗапрашиватьПриВводе Тогда
				
				СтруктураОтбора = Новый Структура("ИдентификаторСтрокиВидаРасчета, Показатель", ТекущийИдентификаторСтрокиВидаРасчета, ДанныеПоказателя.Показатель);
				НайденныеСтроки = Объект.Показатели.НайтиСтроки(СтруктураОтбора);
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						НайденнаяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
					КонецЦикла;
				Иначе
					НоваяСтрока = Объект.Показатели.Добавить();
					НоваяСтрока.Показатель = ДанныеПоказателя.Показатель;
					НоваяСтрока.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		СтрокаСотрудника.ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета;
		ИдентификаторСтрокиВидаРасчета = ИдентификаторСтрокиВидаРасчета + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеПоказателейНаСервере(ЗначенияПоказателей)
	
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Объект.Удержание);
	ФиксированнаяСумма = ЗначенияПоказателей[Справочники.ПоказателиРасчетаЗарплаты.ПустаяСсылка()];
	
	Для Каждого СтрокаСотрудника Из Объект.Показатели Цикл
		
		Если ФиксированнаяСумма = Неопределено Тогда
			
			МаксимальноеЧислоПоказателей = ВидРасчетаИнфо.КоличествоПостоянныхПоказателей;
			Для Сч = 1 По МаксимальноеЧислоПоказателей Цикл
				
				Если Не ЗначениеЗаполнено(СтрокаСотрудника.Показатель) Тогда 
					Прервать;
				КонецЕсли;
				
				ЗначениеПоказателя = ЗначенияПоказателей[СтрокаСотрудника.Показатель];
				Если ЗначениеПоказателя <> Неопределено Тогда 
					СтрокаСотрудника.Значение = ЗначениеПоказателя;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе 
			
			СтрокаСотрудника.Размер = ФиксированнаяСумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНадписиУдержаний(ФизическоеЛицо)
	
	СуммаУдержанияЗаСотрудника = СуммаУдержанияЗаСотрудника(ФизическоеЛицо);
	СуммаУдержанияЗаРодственников = СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
	Если СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника = 0 Тогда
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за родственников'");
	ИначеЕсли СуммаУдержанияЗаРодственников > 0 И СуммаУдержанияЗаСотрудника > 0 Тогда 
		НадписьСуммаУдержания = НСтр("ru = 'Удержание за сотрудника и родственников'");
	Иначе
		НадписьСуммаУдержания = НСтр("ru = 'Удержание стоимости полиса'");
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].ЧастичноеУдержание Тогда
		СуммаУдержания = ДанныеСотрудника[0].СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = СуммаУдержанияЗаРодственников + СуммаУдержанияЗаСотрудника;
	КонецЕсли;

	Если СуммаУдержания = 0 Тогда
		Элементы.ГруппаУдержаниеСпособ.Доступность = Ложь;
		Элементы.СотрудникиСуммаУдержания.Доступность = Ложь;
		Элементы.ГруппаГрафикУдержаний.Доступность = Ложь;
		Элементы.ГруппаНастройкиУдержания.Заголовок = НСтр("ru = 'Удержание стоимости полиса'");
	Иначе
		Элементы.ГруппаУдержаниеСпособ.Доступность = Истина;
		Элементы.СотрудникиСуммаУдержания.Доступность = Истина;
		Элементы.ГруппаГрафикУдержаний.Доступность = Истина;
		Элементы.ГруппаНастройкиУдержания.Заголовок =
			СтрШаблон(НСтр("ru = '%1 %2 руб.'"),
			НадписьСуммаУдержания,
			СуммаУдержания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	Если ДанныеСотрудника[0].УдерживатьИзЗарплаты Тогда
		Сумма = ДанныеСотрудника[0].СтраховаяПремия;
	Иначе
		Сумма = 0;
	КонецЕсли;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Функция СуммаУдержанияЗаРодственников(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	НастройкиРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	Сумма = 0;
	Для Каждого Настройка Из НастройкиРодственников Цикл
		Если Настройка.УдерживатьССотрудника Тогда
			Сумма = Сумма + Настройка.СтраховаяПремия;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьУдержанияПослеИзмененияСтрок(Результат, ДополнительныеПараметры)
	
	Если Не ИспользуютсяУдержания Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из ДополнительныеПараметры Цикл
		СтрокаСотрудника = Объект.Сотрудники.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСотрудника.ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(СтрокаСотрудника.ФизическоеЛицо)
			+ СуммаУдержанияЗаРодственников(СтрокаСотрудника.ФизическоеЛицо);
		Если СтрокаСотрудника.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
			ПересчитатьГрафикУдержаний(СтрокаСотрудника);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьУдержания(СтрокаСотрудник)

	РассчитатьОбщуюСуммуУдержания(СтрокаСотрудник.ФизическоеЛицо);
	Если ИспользуетсяЧастичноеУдержание Тогда
		РассчитатьЧастичноеУдержание();
	КонецЕсли;
	УстановитьНадписиУдержаний(СтрокаСотрудник.ФизическоеЛицо);
	Если СтрокаСотрудник.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику") Тогда
		ПересчитатьГрафикУдержаний(СтрокаСотрудник);
		ОбновитьПодвалГрафикаУдержаний();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОбщуюСуммуУдержания(ФизическоеЛицо)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
	ДанныеСотрудника[0].ОбщаяСуммаУдержания = СуммаУдержанияЗаСотрудника(ФизическоеЛицо)
		+ СуммаУдержанияЗаРодственников(ФизическоеЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЧастичноеУдержание()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		Если ТекущиеДанные.ОбщаяСуммаУдержания = 0 Тогда
			ТекущиеДанные.ПроцентЧастичногоУдержания = 0;
			ТекущиеДанные.СуммаЧастичногоУдержания = 0;
		Иначе
			Процент = ?(ТекущиеДанные.ПроцентЧастичногоУдержания = 0, 100, ТекущиеДанные.ПроцентЧастичногоУдержания);
			ТекущиеДанные.СуммаЧастичногоУдержания = Окр(ТекущиеДанные.ОбщаяСуммаУдержания * Процент / 100, 2);
			ТекущиеДанные.ПроцентЧастичногоУдержания = Окр(ТекущиеДанные.СуммаЧастичногоУдержания / ТекущиеДанные.ОбщаяСуммаУдержания * 100, 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СотрудникиСуммаУдержания.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно"), Истина, Ложь);
	Элементы.ГруппаГрафикУдержаний.Видимость =
		?(ТекущиеДанные.СпособУдержания = ПредопределенноеЗначение("Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику"), Истина, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводМесяцаУдержанияНачалоВыбораЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаГрафика = Элементы.ГрафикУдержаний.ТекущиеДанные;
	СтрокаГрафика.ФизическоеЛицо = Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо;
	СтрокаГрафика.Дата = ВыбранноеЗначение;
	СтрокаГрафика.ДатаСтрокой = Формат(ВыбранноеЗначение, НСтр("ru='ДФ=''ММММ гггг'''"));
	
	Объект.ГрафикУдержаний.Сортировать("Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьГрафикУдержаний(СтрокаСотрудник)
	
	ДанныеСтрокиСотрудника = НовыйДанныеСтрокиСотрудника();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокиСотрудника, СтрокаСотрудник);
	
	ПересчитатьГрафикУдержанийНаСервере(ДанныеСтрокиСотрудника);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НовыйДанныеСтрокиСотрудника()
	Возврат МедицинскоеСтрахованиеКлиентСервер.НовыйДанныеСтрокиСотрудника();
КонецФункции

&НаСервере
Процедура ПересчитатьГрафикУдержанийНаСервере(СтрокаСотрудник)
	МедицинскоеСтрахованиеФормы.ПересчитатьГрафикУдержаний(Объект, СтрокаСотрудник);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвалГрафикаУдержаний()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	СуммаПоГрафику = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		СуммаПоГрафику = СтрокаГрафика.Сумма + СуммаПоГрафику;
	КонецЦикла;
	
	Элементы.ГрафикУдержанийСумма.ТекстПодвала = Формат(СуммаПоГрафику, "ЧДЦ=2");
	
	Если ТекущиеДанные.ЧастичноеУдержание Тогда
		СуммаУдержания = ТекущиеДанные.СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = ТекущиеДанные.ОбщаяСуммаУдержания;
	КонецЕсли;

	Если СуммаУдержания <> СуммаПоГрафику Тогда
		ЭлементыСтиля = СтандартныеПодсистемыКлиент.ЭлементыСтиля();
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = ЭлементыСтиля.ЦветТекстаОтрицательногоЗначения;
	Иначе
		Элементы.ГрафикУдержанийСумма.ЦветТекстаПодвала = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокСтраницыСотрудники()
	
	КоличествоРодственников = "";
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо);
	ДанныеРодственников = Объект.Родственники.НайтиСтроки(Отбор);
	КоличествоРодственниковСотрудника = ДанныеРодственников.Количество();
	Если КоличествоРодственниковСотрудника > 0 Тогда
		КоличествоРодственников = КоличествоРодственниковСотрудника;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

