
#Область СлужебныеПроцедурыИФункции

// См.ОбменСАрхивомПереопределяемый.ОбновитьВидыДокументовПриОбновленииКонфигурации.
//
Процедура ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика) Экспорт
	
	ИнтеграцияС1САрхивомРасширенный.ОбновитьВидыДокументовПриОбновленииКонфигурации(ПараметрОбработчика);

КонецПроцедуры

// См. ОбменСАрхивомПереопределяемый.СоздатьДокументыБИА.
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	Возврат ИнтеграцияС1САрхивомРасширенный.СоздатьДокументыБИА(СсылкаНаОбъектИсточник);
	
КонецФункции

Функция ДанныеТрудовогоДоговора(СсылкаНаДокумент, Сотрудник) Экспорт
	
	Возврат ИнтеграцияС1САрхивомРасширенный.ДанныеТрудовогоДоговора(СсылкаНаДокумент, Сотрудник);
	
КонецФункции

Функция СоздатьДокументБИАФайлаДокументаИсключения(Файл) Экспорт
	Возврат ИнтеграцияС1САрхивомРасширенный.СоздатьДокументБИАФайлаДокументаИсключения(Файл);
КонецФункции

#КонецОбласти
