#Область ПрограммныйИнтерфейс

#Область ПолучениеИнформацииИзФормПодборов

// Переносит данные установленных значений отборов из дерева отборов по
//  свойствам вида номенклатуры в таблицу значений и помещает ее во временное
//  хранилище.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - форма подбора.
// 
// Возвращаемое значение:
//  Строка - Адрес таблицы значений во временном хранилище.
//
Функция АдресТаблицыПараметровДереваОтборов(Форма) Экспорт
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	ДеревоЗначенийОтборов        = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	
	АдресТаблицы = Неопределено;
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	
	ТаблицаПараметров.Колонки.Добавить("ИмяРеквизита");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеОтбора");
	ТаблицаПараметров.Колонки.Добавить("ЭтоДопРеквизит");
	
	ПараметрыОтбора = Новый Структура("Отбор", Истина);
	
	СтрокиДереваОтборов = ДеревоЗначенийОтборов.Строки;
	
	НайденныеСтроки = СтрокиДереваОтборов.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаДереваОтборов Из НайденныеСтроки Цикл
		
		Если ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Строка")
			Или ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Булево") Тогда
			
			СтрокаТаблицы = ТаблицаПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДереваОтборов);
			
		ИначеЕсли Не СтрокаДереваОтборов.ОтборДоступен Тогда
			
			ПодчиненныеСтроки = СтрокаДереваОтборов.Строки.НайтиСтроки(ПараметрыОтбора);
			
			Если ПодчиненныеСтроки.Количество() = 1 Тогда
				
				СтрокаЗначенияОтбора = ПодчиненныеСтроки[0];
				СтрокаТаблицы = ТаблицаПараметров.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗначенияОтбора);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаПараметров.Количество() > 0 Тогда
		АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаПараметров, УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Возврат АдресТаблицы;
	
КонецФункции

// Переносит данные установленных значений отборов из дерева отборов по
//  свойствам вида номенклатуры в таблицу значений и помещает ее во временное хранилище.
//
// Параметры:
//  Форма	 - ФормаКлиентскогоПриложения	 - форма подбора.
// 
// Возвращаемое значение:
//  Строка - Адрес таблицы значений во временном хранилище.
//
Функция АдресТаблицыСопоставленияДереваОтборов(Форма) Экспорт
	
	УникальныйИдентификаторФормы = Форма.УникальныйИдентификатор;
	ДеревоЗначенийОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	
	АдресТаблицы = Неопределено;
	
	ТаблицаПараметров = Новый ТаблицаЗначений;
	
	ТаблицаПараметров.Колонки.Добавить("ИмяРеквизита");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеОтбора");
	ТаблицаПараметров.Колонки.Добавить("ЭтоДопРеквизит");
	ТаблицаПараметров.Колонки.Добавить("ИнтервалОт");
	ТаблицаПараметров.Колонки.Добавить("ИнтервалДо");
	ТаблицаПараметров.Колонки.Добавить("Интервал");
	
	ПараметрыОтбора = Новый Структура("Отбор", Истина);
	
	СтрокиДереваОтборов = ДеревоЗначенийОтборов.Строки;
	
	НайденныеСтроки = СтрокиДереваОтборов.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаДереваОтборов Из НайденныеСтроки Цикл
		
		Если СтрокаДереваОтборов.ФиксированноеЗначение Тогда
			
			СтрокаТаблицы = ТаблицаПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДереваОтборов);
			
			Если СтрокаДереваОтборов.ИнтервалОт <> Неопределено Тогда
				СтрокаТаблицы.Интервал = Истина;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Строка")
			Или ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Булево") Тогда
			
			СтрокаТаблицы = ТаблицаПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаДереваОтборов);
			
			СтрокаТаблицы.Интервал = Ложь;
			
		ИначеЕсли Не СтрокаДереваОтборов.ОтборДоступен Тогда
			
			ПодчиненныеСтроки = СтрокаДереваОтборов.Строки.НайтиСтроки(ПараметрыОтбора);
			
			Для Каждого СтрокаЗначенияОтбора Из ПодчиненныеСтроки Цикл
				
				СтрокаТаблицы = ТаблицаПараметров.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаЗначенияОтбора);
				
				СтрокаТаблицы.Интервал = Ложь;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаПараметров.Количество() > 0 Тогда
		АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаПараметров, УникальныйИдентификаторФормы);
	КонецЕсли;
	
	Возврат АдресТаблицы;
	
КонецФункции

#КонецОбласти

#Область ОбщиеОбработчикиСобытийФорм

// Вызывается из обработчика события "ПриСозданииНаСервере" форм списков.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, формы выбора.
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	Форма.ЕстьПравоНастройкиВидовНоменклатуры = ПравоДоступа("Изменение", Метаданные.Справочники.ВидыНоменклатуры);
	Форма.ЦветТекстаФормы = ЦветаСтиля.ЦветТекстаФормы;
	
	УстановитьЗначенияПоНастройкамФормы(Форма);
	
	Если Не ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из Форма.Параметры.Отбор Цикл
		Если Элемент.Ключ = "ТипНоменклатуры" Тогда
			УстановитьОтборПоТипуНоменклатурыПоПараметрам(Форма);
			Продолжить;
		КонецЕсли;
		
		Если Элемент.Ключ = "ВидНоменклатуры" Тогда
			УстановитьОтборПоВидНоменклатурыПоПараметрам(Форма);
			Продолжить;
		КонецЕсли;
		
		Если Элемент.Ключ = "Владелец" Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(Элемент.Значение) = Тип("ФиксированныйМассив") Тогда
			ДобавитьЭлементОтбора(ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура), 
			Элемент.Ключ, Элемент.Значение, ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоУмолчанию");
		Иначе
			ДобавитьЭлементОтбора(ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура), 
			Элемент.Ключ, Элемент.Значение, ВидСравненияКомпоновкиДанных.Равно, "ОтборПоУмолчанию");
		КонецЕсли;
	КонецЦикла;
	ПодборНоменклатурыСИЗКлиентСервер.НазначитьКнопкуВыбораПоУмолчанию(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревомОтбораПоСвойствамВидаНоменклатуры

// Вызывается при изменении значения в дереве отбора по свойствам вида номенклатуры.
// Т.е. клиентские функции обрабатывают обработку значений на элементе формы (устанавливают
// значения флажков на строках, подчиненных строках, открывают форму установки интервала значений
// и т.п.), затем управление передается на сервер и сначала отключаются все установленные отборы
// по дереву свойств, затем включается отбор только по значениям строк с установленными флажками отбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ДеревоОтборовОтборПриИзменении(Форма) Экспорт
	
	Если Не Форма.ИспользоватьФильтры Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьОтборПоСвойствамВидаНоменклатуры(Форма);
	УстановитьОтборПоСвойствамВидаНоменклатуры(Форма);
	
КонецПроцедуры

// Заполняет дерево отборов характеристик по свойствам вида номенклатуры выбранного на форме.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ЗаполнитьДеревоОтборовХарактеристик(Форма) Экспорт
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ДеревоОтборов.Строки.Очистить();
	
	ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, Истина);
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаИУдалениеОтборов

// Устанавливает отбор по владельцу характеристик. Используется в форме подбора справочника "Характеристики номенклатуры".
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма подбора.
//
Процедура УстановитьОтборПоВладельцуХарактеристик(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Список, "Владелец", Форма.ВладелецХарактеристик, 
		ВидСравненияКомпоновкиДанных.Равно, "ОтборПоВладельцуХарактеристик", Истина);
	
КонецПроцедуры

// Добавляет отбор в указанную коллекцию области отбора.
//
// Параметры:
//	ОбластьОтбора - ОтборКомпоновкиДанных - отбор динамического списка,
//	ЛевоеЗначение - Строка - путь к данным поля отбора,
//	ПравоеЗначение - Произвольный - значение отбора,
//	ВидОтбора - ВидСравненияКомпоновкиДанных - вид сравнения,
//	Представление - Строка - представление элемента отбора.
//
Процедура ДобавитьЭлементОтбора(ОбластьОтбора, ЛевоеЗначение, ПравоеЗначение, ВидОтбора, Представление = "") Экспорт
	
	ЭлементОтбора                   = ОбластьОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение     = Новый ПолеКомпоновкиДанных(ЛевоеЗначение);
	ЭлементОтбора.ПравоеЗначение    = ПравоеЗначение;
	ЭлементОтбора.РежимОтображения  = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ВидСравнения      = ВидОтбора;
	
	Если ЗначениеЗаполнено(Представление) Тогда
		ЭлементОтбора.Представление = Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовНаФормахПодборов

// Вызывается из форм подборов при изменении флажка использования фильтров.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ПриИзмененииИспользованияФильтров(Форма) Экспорт
	
	Если ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораХарактеристик(Форма) Тогда
		УдалитьОтборПоСвойствамВидаНоменклатуры(Форма);
		
		Если Форма.ИспользоватьФильтры Тогда
			УстановитьОтборПоСвойствамВидаНоменклатуры(Форма);
		КонецЕсли;
	Иначе
		Если (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
			
			Форма.ВидНоменклатурыДоИзменения = Неопределено;
			
			Если Форма.ИспользоватьФильтры Тогда
				УстановитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
			Иначе
				УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
			КонецЕсли;
			ПриИзмененииВидаНоменклатуры(Форма);
		Иначе
			Если Форма.ИспользоватьФильтры Тогда
				Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
					УстановитьТекущуюСтрокуИерархииНоменклатуры(Форма);
					ПодборНоменклатурыСИЗКлиентСервер.УстановитьОтборПоИерархииНоменклатуры(Форма);
				КонецЕсли;
			Иначе
				ПодборНоменклатурыСИЗКлиентСервер.УдалитьОтборПоИерархииНоменклатуры(Форма);
				УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПодборНоменклатурыСИЗКлиентСервер.УстановитьДоступностьЭлементовФильтров(Форма);
	
КонецПроцедуры

// Вызывается из форм подборов при изменении варианта навигации.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ПриИзмененииВариантаНавигации(Форма) Экспорт
	
	УстановитьСтраницуВариантаНавигации(Форма);
	ПодборНоменклатурыСИЗКлиентСервер.УдалитьОтборПоИерархииНоменклатуры(Форма);
	УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	
	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		ПодборНоменклатурыСИЗКлиентСервер.УстановитьОтборПоИерархииНоменклатуры(Форма);
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам 
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам
			Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
		УстановитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из форм подбора при изменении вида номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма подбора, форма списка, форма выбора.
//
Процедура ПриИзмененииВидаНоменклатуры(Форма) Экспорт
	
	Если Форма.ВидНоменклатуры = Форма.ВидНоменклатурыДоИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
	
	УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	
	Если Не ЗначениеЗаполнено(Форма.ВидНоменклатуры)
		Или Не Форма.ИспользоватьФильтры Тогда
		
		ОчиститьДеревоОтборов(Форма);
		Если Форма.ИспользоватьФильтры Тогда
			УстановитьОтборПоВидуНоменклатуры(Форма);
		КонецЕсли;
	Иначе
		ЗаполнитьДеревоОтборовНоменклатуры(Форма);
		УстановитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Для сброса флажков для свойств номенклатуры в контекстном меню списка номенклатуры в формах подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура СброситьОтборыПоСвойствам(Форма) Экспорт
	
	Для Каждого ОтборПервыйУровень Из Форма.ДеревоОтборов.ПолучитьЭлементы() Цикл
		Если ОтборПервыйУровень.Отбор Тогда
			ОтборПервыйУровень.Отбор = Ложь;
			Для Каждого ОтборВторойУровень Из ОтборПервыйУровень.ПолучитьЭлементы() Цикл
				ОтборВторойУровень.Отбор = Ложь;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Форма.ТаблицаПараметровОтбора.Очистить();	
	
	УдалитьОтборПоСвойствамВидаНоменклатуры(Форма);
	
КонецПроцедуры

// Вызывается при выполнении команды отображения номенклатуры с аналогичными свойствами
// в контекстном меню списка номенклатуры в формах подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора
//
Процедура ПриИзмененииОтображенияНоменклатураСАналогичнымиСвойствами(Форма) Экспорт
	
	ТекущаяСтрока = Форма.Элементы.СписокНоменклатура.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтфильтроватьПоАналогичнымСвойствам(Форма, ТекущаяСтрока.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборыВспомогательные

// Устанавливает отбор на список номенклатуры по аналогичным свойствам вида номенклатуры переданной номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора,
//	Номенклатура - СправочникСсылка.Номенклатура - номенклатура по значениям свойств которого необходимо установить отбор списка номенклатуры.
//
Процедура ОтфильтроватьПоАналогичнымСвойствам(Форма, Номенклатура) Экспорт
	
	// Включить использование фильтров.
	Форма.ИспользоватьФильтры = Истина;
	ПодборНоменклатурыСИЗКлиентСервер.УстановитьДоступностьЭлементовФильтров(Форма);
	
	// Установить вариант навигации - "по свойствам".
	Если Не (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
		Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам;
	КонецЕсли;
	
	УстановитьСтраницуВариантаНавигации(Форма);
	
	// Установить вид номенклатуры и заполнить дерево отборов.
	Форма.ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	Форма.ВидНоменклатурыДоИзменения = Форма.ВидНоменклатуры;
	Форма.ВидНоменклатурыПриОткрытии = Форма.ВидНоменклатуры;
	
	УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	
	ЗаполнитьДеревоОтборовНоменклатуры(Форма);
	
	// Получить список свойств и значений вида номенклатуры текущей номенклатуры.
	СвойстваДляПодбораАналогичнойНоменклатуры = СвойстваДляПодбораАналогичнойНоменклатуры(Номенклатура);
	
	ДеревоОтборов           = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ТаблицаПараметровОтбора = Форма.ТаблицаПараметровОтбора.Выгрузить();
	
	ТаблицаПараметровОтбора.Очистить();
	
	// Пройти по полученному списку свойств, проставить флажки использования.
	Для Каждого ДополнительноеСвойство Из СвойстваДляПодбораАналогичнойНоменклатуры Цикл
		
		Для Каждого Свойство Из ДеревоОтборов.Строки Цикл
			
			Если Не (ДополнительноеСвойство.Представление = Свойство.Представление) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Свойство.ЗначениеОтбора = ДополнительноеСвойство.Значение Тогда
				Свойство.Отбор = Истина;
				НоваяСтрока = ТаблицаПараметровОтбора.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Свойство);
			Иначе
				Для Каждого ЗначениеСвойства Из Свойство.Строки Цикл
					
					// Включить использование свойства в отборе, если значение дерева отбора аналогично 
					// значению списка свойств вида текущей номенклатуры.
					ЗначениеСвойства.Отбор = (ЗначениеСвойства.ЗначениеОтбора = ДополнительноеСвойство.Значение);
					
					Если ЗначениеСвойства.Отбор Тогда
						Свойство.Отбор = Истина;
						
						НоваяСтрока = ТаблицаПараметровОтбора.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗначениеСвойства);
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	Форма.ТаблицаПараметровОтбора.Загрузить(ТаблицаПараметровОтбора);
	
	// Флажки расставлены, теперь применить отборы к списку номенклатуры.
	УстановитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма);
	
КонецПроцедуры

// Возвращает массив свойств по которым устанавливается отбор при отображении
//  списка номенклатуры с аналогичными свойствами в формах подборов.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура для которой формируется массив свойств.
// 
// Возвращаемое значение:
//  Массив - Массив свойств и значений свойств элемента номенклатуры по которым нужно
//  будет отобрать аналогичную номенклатуру.
//
Функция СвойстваДляПодбораАналогичнойНоменклатуры(Номенклатура) Экспорт
	
	ДополнительныеРеквизиты = Новый Массив;
	Свойства = Новый Массив;
	
	// Получить имена и значения реквизитов которые используются для отбора.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РеквизитыБыстрогоОтбораНоменклатуры.ИмяРеквизита   КАК ИмяРеквизита,
	|	РеквизитыБыстрогоОтбораНоменклатуры.Свойство       КАК Свойство,
	|	РеквизитыБыстрогоОтбораНоменклатуры.ЭтоДопРеквизит КАК ЭтоДопРеквизит
	|ИЗ
	|	Справочник.ВидыНоменклатуры.РеквизитыБыстрогоОтбораНоменклатуры КАК РеквизитыБыстрогоОтбораНоменклатуры
	|ГДЕ
	|	РеквизитыБыстрогоОтбораНоменклатуры.Ссылка = &ВидНоменклатуры");
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры"));
	
	КоличествоПолей = 0;
	
	ТекстЗапроса = "ВЫБРАТЬ *";
	ТекстЗапроса = Лев(ТекстЗапроса, 7);
	
	РеквизитыБыстрогоОтбораНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЧ Из РеквизитыБыстрогоОтбораНоменклатуры Цикл
		Если СтрокаТЧ.ЭтоДопРеквизит Тогда
			ДополнительныеРеквизиты.Добавить(СтрокаТЧ.Свойство);
		Иначе
			КоличествоПолей = КоличествоПолей + 1;
			Если КоличествоПолей = 1 Тогда
				ТекстЗапроса = ТекстЗапроса + " " + "Т." + СтрокаТЧ.ИмяРеквизита + " " + "КАК " + СтрокаТЧ.ИмяРеквизита;
			Иначе
				ТекстЗапроса = ТекстЗапроса + ", " + "Т." + СтрокаТЧ.ИмяРеквизита + " " + "КАК " + СтрокаТЧ.ИмяРеквизита;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоПолей > 0 Тогда
		ТекстЗапроса = ТекстЗапроса +" " + "Из Справочник.Номенклатура КАК Т ГДЕ Т.Ссылка = &Номенклатура";
		
		Запрос = Новый Запрос(
		ТекстЗапроса +
		";
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Свойство           КАК Свойство,
		|	НоменклатураДополнительныеРеквизиты.Значение           КАК Значение,
		|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Представление
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
		|	И НоменклатураДополнительныеРеквизиты.Свойство В (&ДополнительныеРеквизиты)");
		
		Запрос.УстановитьПараметр("Номенклатура",            Номенклатура);
		Запрос.УстановитьПараметр("ДополнительныеРеквизиты", ДополнительныеРеквизиты);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Результат = МассивРезультатов[0]; // РезультатЗапроса
		
		Выборка = Результат.Выбрать(); // обход реквизитов номенклатуры
		
		Пока Выборка.Следующий() Цикл
			Для Каждого Колонка Из Результат.Колонки Цикл
				НоваяСтрока = Новый Структура("ИмяРеквизита, Значение, Представление");
				
				НоваяСтрока.ИмяРеквизита = Колонка.Имя;
				НоваяСтрока.Значение     = Выборка[Колонка.Имя];
				
				Реквизит = Метаданные.Справочники.Номенклатура.Реквизиты.Найти(Колонка.Имя);
				
				НоваяСтрока.Представление = Реквизит.Синоним;
				
				Свойства.Добавить(НоваяСтрока); // в выходной массив добавляется имя и значение реквизита элемента номенклатуры
			КонецЦикла;
		КонецЦикла;
		
		Результат = МассивРезультатов[1]; // РезультатЗапроса
		Выборка = Результат.Выбрать(); // обход дополнительных реквизитов номенклатуры
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Новый Структура("Свойство, Значение, Представление");
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если Не ЗначениеЗаполнено(Выборка.Представление) Тогда
				НоваяСтрока.Представление = Строка(Выборка.Свойство);
			КонецЕсли;
			
			Свойства.Добавить(НоваяСтрока); // в выходной массив добавляется имя и значение доп.реквизита вида номенклатуры
		КонецЦикла;
	Иначе
		// В том случае, если реквизиты вида номенклатуры не включены в панель быстрого отбора,
		// то в выходной массив добавляются только значения доп.реквизитов вида номенклатуры.
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Свойство           КАК Свойство,
		|	НоменклатураДополнительныеРеквизиты.Значение           КАК Значение,
		|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Представление
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
		|	И НоменклатураДополнительныеРеквизиты.Свойство В (&ДополнительныеРеквизиты)");
		
		Запрос.УстановитьПараметр("Номенклатура",            Номенклатура);
		Запрос.УстановитьПараметр("ДополнительныеРеквизиты", ДополнительныеРеквизиты);
		
		Если Не ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Номенклатура", Номенклатура.Метаданные().ПолноеИмя());
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Новый Структура("Свойство, Значение, Представление");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			Если Не ЗначениеЗаполнено(Выборка.Представление) Тогда
				НоваяСтрока.Представление = Строка(Выборка.Свойство);
			КонецЕсли;
			
			Свойства.Добавить(НоваяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Свойства;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииСохраненияИВосстановленияНастроек

// Сохраняет значения реквизитов на форме в хранилище общих настроек.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма выбора.
//
Процедура СохранитьНастройкиФормы(Форма) Экспорт
	
	НастройкиФормы = НастройкиФормы(Форма);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(Форма.КодФормы, "", НастройкиФормы);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеВидимостьюСтраницСПараметрамиНавигации

// Устанавливает страницу варианта навигации на форме подбора.
//
// Параметры:
//  Форма						 - ФормаКлиентскогоПриложения	 - форма списка номенклатуры или форма подбора.  
//
Процедура УстановитьСтраницуВариантаНавигации(Форма) Экспорт
	
	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
	ИначеЕсли Не ЗначениеЗаполнено(Форма.ВариантНавигации) Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияИерархияНоменклатуры;
		Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;
	ИначеЕсли (Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам) Тогда
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияВидыНоменклатуры;
		
		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Ложь;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
			Форма.Элементы.ДеревоОтборов.Видимость    = Истина;
			Форма.Элементы.ВидНоменклатуры.Видимость  = Истина;
		КонецЕсли;
		
		Если ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
			ИЛИ ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда
			
			Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
			ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Истина;
			ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
				Форма.Элементы.ВидыНоменклатуры.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоНоменклатуре Тогда
		Форма.Элементы.ВидНоменклатуры.Видимость  = Ложь;
		СтраницаВариантаНавигации = Форма.Элементы.НавигацияНоменклатура;
	КонецЕсли;
	
	Если ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма)
		ИЛИ ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма) Тогда
		Форма.Элементы.ИспользоватьФильтры.Доступность = Истина;
		Форма.Элементы.СписокНоменклатураКоманднаяПанельУстановитьФильтр.Доступность = Истина;
		Форма.Элементы.СписокНоменклатураКоманднаяПанельНоменклатураСАналогичнымиСвойствами.Доступность = Истина;
		СформироватьНадписьВариантНавигации(Форма);
	КонецЕсли;

	Форма.Элементы.ВариантыНавигации.ТекущаяСтраница = СтраницаВариантаНавигации;
	
	Если ПравоДоступа("Изменение", Метаданные.Справочники.ВидыНоменклатуры) Тогда
		
		Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
					Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам;
					
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидыНоменклатурыСоздать", "Видимость", Видимость);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидыНоменклатурыСоздатьГруппу", "Видимость", Видимость);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидыНоменклатурыИзменить", "Видимость", Видимость);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидыНоменклатурыСкопировать", "Видимость", Видимость);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидыНоменклатурыУстановитьПометкуУдаления", "Видимость", Видимость);		
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоздатьВидНоменклатуры", "Видимость", Видимость);		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоздатьГруппуВидовНоменклатуры", "Видимость", Видимость);		
		
	КонецЕсли;
	
	Если ПравоДоступа("Изменение", Метаданные.Справочники.Номенклатура) Тогда
		Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоздатьГруппуНоменклатуры", "Видимость", Видимость);		
	КонецЕсли;
		
	Видимость = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
				Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам
				Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам;
				
	Форма.Элементы.СброситьОтборыПоСвойствам.Видимость = Видимость;
	
	Доступность = Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам
				Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам;
				
	Форма.Элементы.СброситьОтборыПоСвойствам.Доступность = Доступность;
	
КонецПроцедуры

// Формирует представление варианта навигации
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора 
//
Процедура СформироватьНадписьВариантНавигации(Форма)
	МассивСтрокНадписи = Новый Массив();
	
	ШрифтВажнаяНадпись = ШрифтыСтиля.ВажнаяНадписьШрифт;
	
	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		МассивСтрокНадписи.Добавить(НСтр("ru = 'Иерархия номенклатуры'"));
	ИначеЕсли Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам 
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам 
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
		
		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда 
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды и свойства'"),
			ШрифтВажнаяНадпись,
			Форма.ЦветТекстаФормы,
			,));
		Иначе
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды и свойства'"),
			,
			,
			,
			ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам)));
		КонецЕсли;
		
		МассивСтрокНадписи.Добавить("  ");
		
		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды'"),
			ШрифтВажнаяНадпись,
			Форма.ЦветТекстаФормы,
			,));
		Иначе
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Виды'"),
			,
			,
			,
			ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам)));
		КонецЕсли;
		
		МассивСтрокНадписи.Добавить("  ");
		
		Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам Тогда
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Свойства'"),
			ШрифтВажнаяНадпись,
			Форма.ЦветТекстаФормы,,));
		Иначе
			МассивСтрокНадписи.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'Свойства'"),
			,
			,
			,
			ОбщегоНазначения.ИмяЗначенияПеречисления(Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам)));
		КонецЕсли;
	Иначе
		МассивСтрокНадписи = Новый Массив();
	КонецЕсли;
	
	Если МассивСтрокНадписи.Количество() > 0 Тогда
		Форма.НадписьВариантНавигации = Новый ФорматированнаяСтрока(МассивСтрокНадписи);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСДеревомОтбораПоСвойствамВидаНоменклатуры

Процедура НадписьВариантНавигацииНавигационнойСсылки(Форма, НавигационнаяСсылка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ВариантНавигации = ПредопределенноеЗначение("Перечисление.ВариантыНавигацииВФормахНоменклатуры." + НавигационнаяСсылка);
	Форма.ВариантНавигации = ВариантНавигации;
	ПриИзмененииВариантаНавигации(Форма);
	
КонецПроцедуры

// Заполняет дерево отборов по свойствам вида номенклатуры выбранного на форме.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ЗаполнитьДеревоОтборовНоменклатуры(Форма)
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ДеревоОтборов.Строки.Очистить();
	
	ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, Ложь);
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры

// Заполняет дерево значений отборов формы (списка, подбора) значениями
// отбора для номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма подбора.
//	ДеревоОтборов - ДеревоЗначений - дерево значений отборов свойств.
//	ПоХарактеристикам - Булево - признак заполнения значений отборов для списка характеристик.
//
Процедура ЗаполнитьДеревоЗначенийОтборов(Форма, ДеревоОтборов, ПоХарактеристикам)
	
	ВидНоменклатурыДляХарактеристик = Неопределено;
	ТаблицаПараметровОтбора			= Форма.ТаблицаПараметровОтбора.Выгрузить();
	
	Отбор				= Новый Структура("ОтборХарактеристик", ПоХарактеристикам);
	ОтобранныеСтроки	= ТаблицаПараметровОтбора.НайтиСтроки(Отбор);
	
	Для Каждого Строка Из ОтобранныеСтроки Цикл
		Строка.Отбор = Ложь;
	КонецЦикла;
		
	Если ПоХарактеристикам Тогда
		
		РеквизитыВидаНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
										Форма.ВидНоменклатуры,
										"ИспользованиеХарактеристик,ВладелецХарактеристик");
		
		Если РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры
			Или РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры Тогда
			ВидНоменклатурыДляХарактеристик = Форма.ВидНоменклатуры;
		ИначеЕсли РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры Тогда
			ВидНоменклатурыДляХарактеристик = РеквизитыВидаНоменклатуры.ВладелецХарактеристик;
		Иначе
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеквизитыБыстрогоОтбораХарактеристик.НомерСтроки КАК НомерСтроки,
		|	РеквизитыБыстрогоОтбораХарактеристик.Свойство КАК Свойство,
		|	РеквизитыБыстрогоОтбораХарактеристик.ИмяРеквизита КАК ИмяРеквизита,
		|	ВЫБОР
		|		КОГДА РеквизитыБыстрогоОтбораХарактеристик.ЭтоДопРеквизит
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РеквизитыБыстрогоОтбораХарактеристик.Свойство)
		|		ИНАЧЕ РеквизитыБыстрогоОтбораХарактеристик.ПредставлениеРеквизита
		|	КОНЕЦ КАК ПредставлениеРеквизита,
		|	РеквизитыБыстрогоОтбораХарактеристик.ЭтоДопРеквизит КАК ЭтоДопРеквизит,
		|	ВЫБОР
		|		КОГДА НЕ РеквизитыБыстрогоОтбораХарактеристик.Свойство ЕСТЬ NULL 
		|			ТОГДА РеквизитыБыстрогоОтбораХарактеристик.Свойство.ТипЗначения
		|	КОНЕЦ КАК ОписаниеТипаЗначения,
		|	РеквизитыБыстрогоОтбораХарактеристик.Свойство.Заголовок КАК ЗаголовокРеквизита
		|ИЗ
		|	Справочник.ВидыНоменклатуры.РеквизитыБыстрогоОтбораХарактеристик КАК РеквизитыБыстрогоОтбораХарактеристик
		|ГДЕ
		|	РеквизитыБыстрогоОтбораХарактеристик.Ссылка = &ВидНоменклатуры";
		
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатурыДляХарактеристик);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеквизитыБыстрогоОтбораНоменклатуры.НомерСтроки КАК НомерСтроки,
		|	РеквизитыБыстрогоОтбораНоменклатуры.Свойство КАК Свойство,
		|	РеквизитыБыстрогоОтбораНоменклатуры.ИмяРеквизита КАК ИмяРеквизита,
		|	ВЫБОР
		|		КОГДА РеквизитыБыстрогоОтбораНоменклатуры.ЭтоДопРеквизит
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(РеквизитыБыстрогоОтбораНоменклатуры.Свойство)
		|		ИНАЧЕ РеквизитыБыстрогоОтбораНоменклатуры.ПредставлениеРеквизита
		|	КОНЕЦ КАК ПредставлениеРеквизита,
		|	РеквизитыБыстрогоОтбораНоменклатуры.ЭтоДопРеквизит КАК ЭтоДопРеквизит,
		|	ВЫБОР
		|		КОГДА НЕ РеквизитыБыстрогоОтбораНоменклатуры.Свойство ЕСТЬ NULL 
		|			ТОГДА РеквизитыБыстрогоОтбораНоменклатуры.Свойство.ТипЗначения
		|	КОНЕЦ КАК ОписаниеТипаЗначения,
		|	РеквизитыБыстрогоОтбораНоменклатуры.Свойство.Заголовок КАК ЗаголовокРеквизита
		|ИЗ
		|	Справочник.ВидыНоменклатуры.РеквизитыБыстрогоОтбораНоменклатуры КАК РеквизитыБыстрогоОтбораНоменклатуры
		|ГДЕ
		|	РеквизитыБыстрогоОтбораНоменклатуры.Ссылка = &ВидНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.УстановитьПараметр("ВидНоменклатуры", Форма.ВидНоменклатуры);
		
	КонецЕсли;
		
	РеквизитыБыстрогоОтбора = Запрос.Выполнить().Выгрузить();
	СтрокаРеквизита = Неопределено;
	МаксимальноеКоличествоЗначенийВДереве = 100;//Константы.МаксимальноеКоличествоЭлементовВДеревеОтборовНоменклатуры.Получить();
	
	Для Каждого Реквизит Из РеквизитыБыстрогоОтбора Цикл
		
		Если Реквизит.ЭтоДопРеквизит Тогда
			ТипРеквизита = Реквизит.ОписаниеТипаЗначения;
			РеквизитНоменклатуры = Неопределено;
		ИначеЕсли ПоХарактеристикам Тогда
			РеквизитХарактеристикиНоменклатуры = Метаданные.Справочники.ХарактеристикиНоменклатуры.Реквизиты[Реквизит.ИмяРеквизита];
			ТипРеквизита = РеквизитХарактеристикиНоменклатуры.Тип;
		Иначе
			РеквизитНоменклатуры = Метаданные.Справочники.Номенклатура.Реквизиты[Реквизит.ИмяРеквизита];
			ТипРеквизита = РеквизитНоменклатуры.Тип;
		КонецЕсли;
		
		Если СтрокаРеквизита <> Неопределено
			И СтрокаРеквизита.Строки.Количество() > 0 Тогда
			СтрокаРеквизита.Строки.Сортировать("Представление");
		КонецЕсли;
		
		СтрокаРеквизита = ДеревоОтборов.Строки.Добавить();
		СтрокаРеквизита.ИмяРеквизита		= ?(Реквизит.ЭтоДопРеквизит,
												Реквизит.ПредставлениеРеквизита,
												Реквизит.ИмяРеквизита);
		СтрокаРеквизита.ЭтоДопРеквизит		= Реквизит.ЭтоДопРеквизит;
		СтрокаРеквизита.Представление		= ?(ЗначениеЗаполнено(Реквизит.ЗаголовокРеквизита),
												Реквизит.ЗаголовокРеквизита,
												Реквизит.ПредставлениеРеквизита);
		СтрокаРеквизита.ОтборХарактеристик	= ПоХарактеристикам;
		СтрокаРеквизита.ОтборДоступен		= Истина;

		Отбор = Новый Структура("ИмяРеквизита",СтрокаРеквизита.ИмяРеквизита);
		ОтобранныеСтроки = ТаблицаПараметровОтбора.НайтиСтроки(Отбор);
		
		Если ТипРеквизита.СодержитТип(Тип("Дата")) Тогда
			
			Если ОтобранныеСтроки.Количество()>0 Тогда
				ОтобранныеСтроки[0].Отбор = Истина;
				
				ЗаполнитьЗначенияСвойств(СтрокаРеквизита,ОтобранныеСтроки[0]);
			Иначе
				СтрокаРеквизита.ИнтервалОт            = Дата('00010101');
				СтрокаРеквизита.ИнтервалДо            = Дата('00010101');
				СтрокаРеквизита.ФиксированноеЗначение = Истина;
				СтрокаРеквизита.ЗначениеОтбора        = Дата('00010101');
				СтрокаРеквизита.ПредставлениеОтбора   = НСтр("ru = '<не задано>'");
			КонецЕсли;
			
		ИначеЕсли ТипРеквизита.СодержитТип(Тип("Число"))Тогда
			
			Если ОтобранныеСтроки.Количество() > 0 Тогда
				ОтобранныеСтроки[0].Отбор = Истина;
				
				ЗаполнитьЗначенияСвойств(СтрокаРеквизита,ОтобранныеСтроки[0]);
			Иначе
				СтрокаРеквизита.ИнтервалОт            = 0;
				СтрокаРеквизита.ИнтервалДо            = 0;
				СтрокаРеквизита.ФиксированноеЗначение = Истина;
				СтрокаРеквизита.ЗначениеОтбора        = 0;
				СтрокаРеквизита.ПредставлениеОтбора   = НСтр("ru = '<не задано>'");
			КонецЕсли;
			
		ИначеЕсли ТипРеквизита.СодержитТип(Тип("Булево")) Тогда
			
			СтрокаРеквизита.ЗначениеОтбора = Истина;
			Если ОтобранныеСтроки.Количество() > 0 Тогда
				ОтобранныеСтроки[0].Отбор = Истина;
				СтрокаРеквизита.Отбор = Истина;
			КонецЕсли;
			
		ИначеЕсли ТипРеквизита.СодержитТип(Тип("Строка")) Тогда
			
			Если ОтобранныеСтроки.Количество() > 0 Тогда
				ОтобранныеСтроки[0].Отбор = Истина;
				
				ЗаполнитьЗначенияСвойств(СтрокаРеквизита,ОтобранныеСтроки[0]);
			Иначе
				СтрокаРеквизита.ЗначениеОтбора        = "";
				СтрокаРеквизита.ФиксированноеЗначение = Истина;
				СтрокаРеквизита.ПредставлениеОтбора   = НСтр("ru = '<не задано>'");
				СтрокаРеквизита.ОтборДоступен         = Истина;
			КонецЕсли;
			
		Иначе
			
			СтрокаРеквизита.ОтборДоступен = Ложь;
			
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипРеквизита.Типы()[0]);
			
			Если Не ПравоДоступа("Чтение", МетаданныеТипа) Тогда
				ДеревоОтборов.Строки.Удалить(СтрокаРеквизита);
				СтрокаРеквизита = Неопределено;
				Продолжить;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Если ПоХарактеристикам Тогда
				Если Реквизит.ЭтоДопРеквизит Тогда
					ТекстЗапроса =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
					|	ДополнительныеРеквизиты.Значение КАК ЗначениеОтбора
					|ИЗ
					|	Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
					|ГДЕ
					|	&РеквизитВладелецХарактеристик = &ВидНоменклатурыДляХарактеристик
					|	И ДополнительныеРеквизиты.Свойство = &Свойство";
					
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Строка(МаксимальноеКоличествоЗначенийВДереве + 1)+" "); //@Query-part-2
					
					Если РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры Тогда
						РеквизитВладелецХарактеристик = "ДополнительныеРеквизиты.Ссылка.Владелец";
						ОтборНоменклатурыПоВиду = "ИСТИНА";
					ИначеЕсли РеквизитыВидаНоменклатуры.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры Тогда
						РеквизитВладелецХарактеристик = "ДополнительныеРеквизиты.Ссылка.Владелец.ВидНоменклатуры";
						ОтборНоменклатурыПоВиду = "ИСТИНА";
					Иначе
						Возврат;
					КонецЕсли;
					
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РеквизитВладелецХарактеристик", РеквизитВладелецХарактеристик);
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборНоменклатурыПоВиду", ОтборНоменклатурыПоВиду);
				Иначе
					ТекстЗапроса =
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
					|	ТаблицаСправочника." + Реквизит.ИмяРеквизита + " КАК ЗначениеОтбора
					|ИЗ
					|	Справочник.ХарактеристикиНоменклатуры КАК ТаблицаСправочника
					|ГДЕ
					|	ТаблицаСправочника.ВидНоменклатуры = &ВидНоменклатуры";
					
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Строка(МаксимальноеКоличествоЗначенийВДереве + 1)+" "); //@Query-part-2
				КонецЕсли;
			ИначеЕсли Реквизит.ЭтоДопРеквизит Тогда
				
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
				|	ДополнительныеРеквизиты.Значение КАК ЗначениеОтбора
				|ИЗ
				|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
				|ГДЕ
				|	ДополнительныеРеквизиты.Ссылка.ВидНоменклатуры = &ВидНоменклатуры
				|	И ДополнительныеРеквизиты.Свойство = &Свойство";
				
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Строка(МаксимальноеКоличествоЗначенийВДереве + 1)+" "); //@Query-part-2
			Иначе
				
				ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ ПЕРВЫЕ 999
				|	ТаблицаСправочника." + Реквизит.ИмяРеквизита + " КАК ЗначениеОтбора
				|ИЗ
				|	Справочник.Номенклатура КАК ТаблицаСправочника
				|ГДЕ
				|	ТаблицаСправочника.ВидНоменклатуры = &ВидНоменклатуры";
				
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПЕРВЫЕ 999", "ПЕРВЫЕ " + Строка(МаксимальноеКоличествоЗначенийВДереве + 1)+" "); //@Query-part-2
			КонецЕсли;
			
			Запрос.Текст = ТекстЗапроса;
			
			Запрос.УстановитьПараметр("Свойство", Реквизит.Свойство);
			Запрос.УстановитьПараметр("ВидНоменклатуры", Форма.ВидНоменклатуры);
			Запрос.УстановитьПараметр("ВидНоменклатурыДляХарактеристик", ВидНоменклатурыДляХарактеристик);
			
			// На большой базе запрос в цикле работает быстрее, чем один запрос с группировкам.
			// При этом быстрее, как если группировать по Свойство-Значение, так и если объединять запросы
			// с группировками по каждому свойству в отдельности.
			ВыборкаЗначений = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаЗначений.Количество() = 0 Тогда
				ДеревоОтборов.Строки.Удалить(СтрокаРеквизита);
				СтрокаРеквизита = Неопределено;
				
			ИначеЕсли ВыборкаЗначений.Количество() > МаксимальноеКоличествоЗначенийВДереве Тогда 	
				
				Если ОтобранныеСтроки.Количество()>0 Тогда
					ОтобранныеСтроки[0].Отбор = Истина;
					
					ЗаполнитьЗначенияСвойств(СтрокаРеквизита,ОтобранныеСтроки[0]);
				Иначе
					СтрокаРеквизита.ЗначениеОтбора        = Новый СписокЗначений;
					СтрокаРеквизита.ФиксированноеЗначение = Истина;
					СтрокаРеквизита.ПредставлениеОтбора   = НСтр("ru = '<не задано>'");
					СтрокаРеквизита.ОтборДоступен         = Истина;
				КонецЕсли;
				
			Иначе
				
				ОтборУстановлен = Ложь;
				
				Пока ВыборкаЗначений.Следующий() Цикл
					
					Если (ВыборкаЗначений.Количество() = 1
						И Не ЗначениеЗаполнено(ВыборкаЗначений.ЗначениеОтбора)) Тогда
						ДеревоОтборов.Строки.Удалить(СтрокаРеквизита);
						СтрокаРеквизита = Неопределено;
						Продолжить;
					КонецЕсли;
					
					СтрокаЗначения = СтрокаРеквизита.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗначения, СтрокаРеквизита);
					
					СтрокаЗначения.ЗначениеОтбора = ВыборкаЗначений.ЗначениеОтбора;
					
					// Получение представления построчно для 50 значений работает быстрее, выборка его сразу в запросе,
					// формирующем ВыборкаЗначений, т.к. там есть группировка
					// Так же это работает быстрее, чем запрос представления (функция ПРЕДСТАВЛЕНИЕ языка запросов),
					// сделанный сразу для 50 значений.
					СтрокаЗначения.Представление  = Строка(ВыборкаЗначений.ЗначениеОтбора);
					СтрокаЗначения.ОтборДоступен  = Истина;
					
					Отбор = Новый Структура;
					Отбор.Вставить("ИмяРеквизита",СтрокаРеквизита.ИмяРеквизита);
					Отбор.Вставить("Представление",СтрокаЗначения.Представление);
					
					ОтобранныеСтроки = ТаблицаПараметровОтбора.НайтиСтроки(Отбор);
					
					Если ОтобранныеСтроки.Количество()>0 Тогда
						ОтобранныеСтроки[0].Отбор = Истина;
						СтрокаЗначения.Отбор = Истина;
						ОтборУстановлен = Истина;
					КонецЕсли;
					
				КонецЦикла;
				
				Если СтрокаРеквизита <> Неопределено Тогда
					СтрокаРеквизита.Отбор = ОтборУстановлен;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ТаблицаПараметровОтбора.Загрузить(ТаблицаПараметровОтбора);
	
	Если СтрокаРеквизита <> Неопределено
		И СтрокаРеквизита.Строки.Количество() > 0 Тогда
		
		СтрокаРеквизита.Строки.Сортировать("Представление");
		
	КонецЕсли;
	
КонецПроцедуры

// Очищает дерево свойств для отбора по свойствам вида номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура ОчиститьДеревоОтборов(Форма)
	
	ДеревоОтборов = Форма.РеквизитФормыВЗначение("ДеревоОтборов");
	ДеревоОтборов.Строки.Очистить();
	
	Форма.ЗначениеВРеквизитФормы(ДеревоОтборов, "ДеревоОтборов");
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаИУдалениеОтборов

// Устанавливает отбор по родителю текущей строки списка номенклатуры
// в форме подбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УстановитьТекущуюСтрокуИерархииНоменклатуры(Форма)
	
	ТекущаяСтрока = Форма.Элементы.СписокНоменклатура.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрока, "Родитель");
	
	Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Родитель;
	Форма.ТекущаяИерархияНоменклатуры = Родитель; 
	
КонецПроцедуры

// Устанавливает отбор по виду номенклатуры и свойствам вида номенклатуры
// у списка номенклатуры в формах подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УстановитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма)
	
	УстановитьОтборПоВидуНоменклатуры(Форма);
	Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоСвойствам
		Или Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам Тогда
		УстановитьОтборПоСвойствамВидаНоменклатуры(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает отбор по виду номенклатуры у списка номенклатуры на формах подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УстановитьОтборПоВидуНоменклатуры(Форма)
	
	ВидНоменклатуры = Форма.ВидНоменклатуры;
	ЭлементыОтбора = ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура);
	
	// Установить отбор по виду номенклатуры.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементыОтбора,
		"ВидНоменклатуры",
		ВидНоменклатуры,
		ВидСравненияКомпоновкиДанных.Равно, 
		"ОтборПоВидуНоменклатуры",
		Истина);
	
КонецПроцедуры

// Устанавливает отбор по свойствам вида номенклатуры у списка номенклатуры на форме подбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма подбора, форма выбора.
//
Процедура УстановитьОтборПоСвойствамВидаНоменклатуры(Форма)
	
	ЭтоФормаВыбораХарактеристик = ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораХарактеристик(Форма);
	
	ПараметрыОтбора = Новый Структура("Отбор", Истина);
	
	УстанавливатьОтборСпискаХарактеристик = Ложь;
	
	Если ЭтоФормаВыбораХарактеристик Тогда
		УстанавливатьОтборСпискаХарактеристик = Истина;
		ОтборСпискаХарактеристик = ПолучитьОтборДинамическогоСписка(Форма.Список);
	Иначе
		ОтборСпискаНоменклатуры = ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура);
	КонецЕсли;
	
	ИмяСсылки = "Ссылка.[";
	
	ТаблицаПараметровОтбора = Форма.ТаблицаПараметровОтбора.Выгрузить();
	ТаблицаПараметровОтбора = ТаблицаПараметровОтбора.Скопировать(ПараметрыОтбора);
	
	Пока ТаблицаПараметровОтбора.Количество() <> 0 Цикл
		СтрокаДереваОтборов = ТаблицаПараметровОтбора[0];
		Если СтрокаДереваОтборов.ФиксированноеЗначение Тогда
			// Сформировать имя элемента отбора.
			ИмяЭлементаОтбора = ?(СтрокаДереваОтборов.ЭтоДопРеквизит,
									ИмяСсылки + СтрокаДереваОтборов.ИмяРеквизита + "]",
									СтрокаДереваОтборов.ИмяРеквизита);
			// В зависимости от типа установить значение элемента отбора.
			Если ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Булево") Тогда
				Если Не СтрокаДереваОтборов.ОтборХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора, Истина,
						ВидСравненияКомпоновкиДанных.Равно,,Истина);
				ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора, Истина,
						ВидСравненияКомпоновкиДанных.Равно,,Истина);
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Дата")
				Или ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Число") Тогда
				
				Если ЗначениеЗаполнено(СтрокаДереваОтборов.ИнтервалОт) Тогда
					Если Не СтрокаДереваОтборов.ОтборХарактеристик Тогда
						ДобавитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора, СтрокаДереваОтборов.ИнтервалОт,
							ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
					ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
						ДобавитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора, СтрокаДереваОтборов.ИнтервалОт,
							ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаДереваОтборов.ИнтервалДо) Тогда
					Если Не СтрокаДереваОтборов.ОтборХарактеристик Тогда
						ДобавитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора, СтрокаДереваОтборов.ИнтервалДо,
							ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
					ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
						ДобавитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора, СтрокаДереваОтборов.ИнтервалДо,
							ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("Строка") Тогда
				Если Не СтрокаДереваОтборов.ОтборХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора,
						СтрокаДереваОтборов.ЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,,Истина);
				ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора,
						СтрокаДереваОтборов.ЗначениеОтбора, ВидСравненияКомпоновкиДанных.Равно,,Истина);
				КонецЕсли;
			ИначеЕсли ТипЗнч(СтрокаДереваОтборов.ЗначениеОтбора) = Тип("СписокЗначений") Тогда
				Если Не СтрокаДереваОтборов.ОтборХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора,
						СтрокаДереваОтборов.ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
				ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
					ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора,
						СтрокаДереваОтборов.ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
				КонецЕсли;
			КонецЕсли;
			
			ТаблицаПараметровОтбора.Удалить(СтрокаДереваОтборов);
		Иначе
			ПараметрыОтбора = Новый Структура("ИмяРеквизита", СтрокаДереваОтборов.ИмяРеквизита);
			
			МассивСтрок = ТаблицаПараметровОтбора.НайтиСтроки(ПараметрыОтбора);
			
			СтрокаОтбора = МассивСтрок[0];
			ОтборХарактеристик = СтрокаОтбора.ОтборХарактеристик;
			
			// Сформировать имя элемента отбора.
			ИмяЭлементаОтбора = ?(СтрокаОтбора.ЭтоДопРеквизит,
									ИмяСсылки + СтрокаОтбора.ИмяРеквизита + "]",
									СтрокаОтбора.ИмяРеквизита);
			
			ЗначенияОтборов = Новый Массив;
			
			Для Каждого Строка Из МассивСтрок Цикл
				ЗначенияОтборов.Добавить(Строка.ЗначениеОтбора);
				ТаблицаПараметровОтбора.Удалить(Строка);
			КонецЦикла;
			
			Если Не ОтборХарактеристик Тогда 
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаНоменклатуры, ИмяЭлементаОтбора,
					ЗначенияОтборов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
			ИначеЕсли УстанавливатьОтборСпискаХарактеристик Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСпискаХарактеристик, ИмяЭлементаОтбора,
					ЗначенияОтборов, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Отключает установленные отборы по виду номенклатуры и по свойствам выбранного
// вида номенклатуры на форме подбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма подбора, форма выбора.
//
Процедура УдалитьОтборПоВидуНоменклатурыИСвойствамВидаНоменклатуры(Форма)
	
	УдалитьОтборПоВидуНоменклатуры(Форма);
	УдалитьОтборПоСвойствамВидаНоменклатуры(Форма);
	
КонецПроцедуры

// Удаляет отбор по виду номенклатуры у списка номенклатуры на формах подборов.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УдалитьОтборПоВидуНоменклатуры(Форма)
	
	ВидНоменклатуры = Форма.ВидНоменклатуры;
	ЭлементыОтбора = ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементыОтбора,
		"ВидНоменклатуры",
		ВидНоменклатуры,
		ВидСравненияКомпоновкиДанных.Равно, 
		"ОтборПоВидуНоменклатуры",
		Ложь);
	
КонецПроцедуры

// Удаляет установленные отборы по свойствам вида номенклатуры.
// Точнее удаляются все установленные отборы на списке за исключением тех
// которые не относятся к отборам дерева свойств.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора.
//
Процедура УдалитьОтборПоСвойствамВидаНоменклатуры(Форма)
	
	ЭтоФормаВыбораХарактеристик = ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораХарактеристик(Форма);
	ЭтоФормаСпискаНоменклатуры = ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма);
	ЭтоФормаВыбораНоменклатуры = ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма);
	
	// Некоторые элементы отбора не должны удаляться - они не относятся
	// к отбору по свойствам вида номенклатуры.
	НеУдаляемыеЭлементы = НеУдаляемыеЭлементыОтборов();
	
	// Удалить элементы отбора по свойствам вида номенклатуры.
	Если ЭтоФормаСпискаНоменклатуры Или ЭтоФормаВыбораНоменклатуры Тогда
		ОтборСпискаНоменклатуры = ПолучитьОтборДинамическогоСписка(Форма.СписокНоменклатура).Элементы;
		ВГраница = ОтборСпискаНоменклатуры.Количество() - 1;
		
		Для Индекс = 0 По ВГраница Цикл
			ЭлементОтбора = ОтборСпискаНоменклатуры[ВГраница - Индекс];
			
			Если НеУдаляемыеЭлементы.Найти(ЭлементОтбора.Представление) = Неопределено Тогда
				ОтборСпискаНоменклатуры.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ЭтоФормаВыбораХарактеристик Тогда
		ОтборСпискаХарактеристик = ПолучитьОтборДинамическогоСписка(Форма.Список).Элементы;
		ВГраница = ОтборСпискаХарактеристик.Количество() - 1;
		Для Индекс = 0 По ВГраница Цикл
			ЭлементОтбора = ОтборСпискаХарактеристик[ВГраница - Индекс];
			
			Если НеУдаляемыеЭлементы.Найти(ЭлементОтбора.Представление) = Неопределено Тогда
				ОтборСпискаХарактеристик.Удалить(ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает массив имен элементов отбора которые не следует удалять.
//
// Возвращаемое значение:
//	Массив - Массив имен отборов которые не следует удалять - они не относятся 
//		к отбору по свойствам вида номенклатуры.
//
Функция НеУдаляемыеЭлементыОтборов()
	
	НеУдаляемыеЭлементы = Новый Массив;
	
	НеУдаляемыеЭлементы.Добавить("ПоискПоПодстроке");
	НеУдаляемыеЭлементы.Добавить("ОтборПоВидуНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ОтборПоВладельцуХарактеристик");
	НеУдаляемыеЭлементы.Добавить("ОтборПоТипуНоменклатуры");
	НеУдаляемыеЭлементы.Добавить("ОтборПоУмолчанию");
	
	Возврат НеУдаляемыеЭлементы
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииСохраненияИВосстановленияНастроек

// Возвращает структуру - значения настроек формы списка, формы выбора.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка, форма выбора.
//
// Возвращаемое значение:
//	Структура - Значения настроек формы списка, формы выбора.
//
Функция НастройкиФормы(Форма)
	
	НастройкиФормы = Новый Структура;
	
	НастройкиФормы.Вставить("ИспользоватьФильтры", Форма.ИспользоватьФильтры);
	НастройкиФормы.Вставить("ВариантНавигации", "");
	НастройкиФормы.Вставить("ВидНоменклатуры", Форма.ВидНоменклатуры);
	НастройкиФормы.Вставить("ТекущаяИерархияНоменклатуры", Форма.ТекущаяИерархияНоменклатуры);
		
	// Сохранение параметров отбора.
	Если ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаСпискаНоменклатуры(Форма)
		Или ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма) Тогда
		
		НастройкиФормы.Вставить("ТаблицаПараметровОтбора", Форма.ТаблицаПараметровОтбора.Выгрузить());
		
	КонецЕсли;
	
	Возврат НастройкиФормы;
	
КонецФункции

// Восстанавливает значение реквизитов на форме из хранилища общих настроек.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма списка номенклатуры или форма подбора
//
Процедура УстановитьЗначенияПоНастройкамФормы(Форма)
	
	// Установить значения по умолчанию.
	Форма.ИспользоватьФильтры = Истина;
	Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам;
	
	Форма.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	Форма.ТекущаяИерархияНоменклатуры = Справочники.Номенклатура.ПустаяСсылка();
	
	Если Не ПодборНоменклатурыСИЗКлиентСервер.ЭтоФормаВыбораНоменклатуры(Форма) Тогда
		// Если есть сохраненные настройки, то установить значения по настройкам.
		Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(Форма.КодФормы, "");
		
		Если Настройки <> Неопределено Тогда
			Если Настройки.Свойство("ИспользоватьФильтры") Тогда
				Форма.ИспользоватьФильтры = Настройки.ИспользоватьФильтры;
			КонецЕсли;
			
			Если Настройки.Свойство("ВариантНавигации") И ЗначениеЗаполнено(Настройки.ВариантНавигации) Тогда
				Форма.ВариантНавигации = ПредопределенноеЗначение(
					"Перечисление.ВариантыНавигацииВФормахНоменклатуры." + Настройки.ВариантНавигации);
			КонецЕсли;
			
			Если Настройки.Свойство("ТаблицаПараметровОтбора")
				И Не (Форма.Параметры.Свойство("ОтборПоСИЗ") И ЗначениеЗаполнено(Форма.Параметры.ОтборПоСИЗ)) Тогда
				
				Если ЗначениеЗаполнено(Настройки.ТаблицаПараметровОтбора) Тогда
					Форма.ТаблицаПараметровОтбора.Загрузить(Настройки.ТаблицаПараметровОтбора);
				КонецЕсли;
			КонецЕсли;
			
			ОтборПоВидуНоменклатуры = Неопределено;
			Форма.Параметры.Отбор.Свойство("ВидНоменклатуры", ОтборПоВидуНоменклатуры);
			Если Настройки.Свойство("ВидНоменклатуры") И Не ЗначениеЗаполнено(ОтборПоВидуНоменклатуры) Тогда
				Если ЗначениеЗаполнено(Настройки.ВидНоменклатуры) Тогда
					// Проверить, что ссылка указывает на существующий объект.
					Если Настройки.ВидНоменклатуры.ПолучитьОбъект() <> Неопределено Тогда
						Форма.ВидНоменклатуры = Настройки.ВидНоменклатуры;
						Если Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
							ЗаполнитьДеревоОтборовНоменклатуры(Форма);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Настройки.Свойство("ТекущаяИерархияНоменклатуры") Тогда
				Если ЗначениеЗаполнено(Настройки.ТекущаяИерархияНоменклатуры) Тогда
					// Проверить, что ссылка указывает на существующий объект.
					Если Не (Настройки.ТекущаяИерархияНоменклатуры.ПолучитьОбъект() = Неопределено) Тогда
						Форма.Элементы.ИерархияНоменклатуры.ТекущаяСтрока = Настройки.ТекущаяИерархияНоменклатуры;
						Форма.ТекущаяИерархияНоменклатуры = Настройки.ТекущаяИерархияНоменклатуры;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Установить страницу варианта навигации по списку номенклатуры.
	УстановитьСтраницуВариантаНавигации(Форма);
	
	ПриИзмененииИспользованияФильтров(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииЗаполненияФормПоПараметрам

// Обрабатывает переданное в параметрах формы значение для отбора списка номенклатуры по типу номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма подбора.
//
Процедура УстановитьОтборПоТипуНоменклатурыПоПараметрам(Форма)
	
	ОтборПоТипуНоменклатурыИзПараметров = Неопределено;
	Форма.Параметры.Отбор.Свойство("ТипНоменклатуры", ОтборПоТипуНоменклатурыИзПараметров);
	Форма.Параметры.Отбор.Удалить("ТипНоменклатуры");
	
	Если ОтборПоТипуНоменклатурыИзПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоТипуНоменклатуры = Новый СписокЗначений;
	
	// Параметр <ОтборПоТипуНоменклатуры> произвольного типа. Может быть передан как отдельный тип
	// номенклатуры, так и массив типов.
	Если ТипЗнч(ОтборПоТипуНоменклатурыИзПараметров) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда
		ОтборПоТипуНоменклатуры.Добавить(ОтборПоТипуНоменклатурыИзПараметров);
	ИначеЕсли ТипЗнч(ОтборПоТипуНоменклатурыИзПараметров) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Значение Из ОтборПоТипуНоменклатурыИзПараметров Цикл
			ОтборПоТипуНоменклатуры.Добавить(Значение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(ОтборПоТипуНоменклатурыИзПараметров) = Тип("Массив") Тогда
		ОтборПоТипуНоменклатуры.ЗагрузитьЗначения(ОтборПоТипуНоменклатурыИзПараметров);
	ИначеЕсли ТипЗнч(ОтборПоТипуНоменклатурыИзПараметров) = Тип("СписокЗначений") Тогда
		ОтборПоТипуНоменклатуры.ЗагрузитьЗначения(ОтборПоТипуНоменклатурыИзПараметров.ВыгрузитьЗначения());
	Иначе
		Возврат;
	КонецЕсли;
	
	ОтборыПоТипуНоменклатурыБезНаборов = Новый СписокЗначений;
	ОтборыПоТипуНоменклатурыБезНаборов.ЗагрузитьЗначения(ОтборПоТипуНоменклатуры.ВыгрузитьЗначения());
	
	// Установить отбор по типам номенклатуры для списка номенклатуры.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.СписокНоменклатура, "ТипНоменклатуры", ОтборПоТипуНоменклатуры, 
		ВидСравненияКомпоновкиДанных.ВСписке, "ОтборПоТипуНоменклатуры", (ОтборПоТипуНоменклатуры.Количество() > 0));
	
КонецПроцедуры

// Обрабатывает переданное в параметрах формы значение для отбора списка номенклатуры по виду номенклатуры.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - форма подбора.
//
Процедура УстановитьОтборПоВидНоменклатурыПоПараметрам(Форма)

	ОтборПоВидуНоменклатуры = Неопределено;
	Форма.Параметры.Отбор.Свойство("ВидНоменклатуры", ОтборПоВидуНоменклатуры);
	Форма.Параметры.Отбор.Удалить("ВидНоменклатуры");
	
	Если ОтборПоВидуНоменклатуры = Неопределено Или Не ЗначениеЗаполнено(ОтборПоВидуНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользоватьФильтры = Истина; 
	Форма.ВариантНавигации = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидамИСвойствам;
	Форма.ВидНоменклатуры = ОтборПоВидуНоменклатуры;
	
	ЗаполнитьДеревоОтборовНоменклатуры(Форма);
	УстановитьСтраницуВариантаНавигации(Форма);
	ПриИзмененииИспользованияФильтров(Форма);
	
КонецПроцедуры

#КонецОбласти

// Определяет отбор динамического списка в зависимости от наличия режима совместимости.
//
// Параметры:
//  Список - ДинамическийСписок - список, для которого надо определить отбор.
//
// Возвращаемое значение:
//   Отбор - требуемый отбор
//
Функция ПолучитьОтборДинамическогоСписка(Список)
	Возврат Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
КонецФункции

#КонецОбласти
