
#Область СлужебныеПроцедурыИФункции
#Область ИнтеграцияСОблачнойОтчетностью

// Функция определяет отображение кнопки "Заполнить" в облачной отчетности
// 
// Параметры:
//  ИДРедакцииОтчета - Строка
// 
// Возвращаемое значение:
//  Булево - Релизована поддержка заполнения в облачной отчетности
Функция РелизованаПоддержкаЗаполненияВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт
	
	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	МассивПоддерживаемых.Добавить("ФормаОтчета2026Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2025Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2024Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2023Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2022Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2021Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2020Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2019Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2018Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2017Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2016Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2015Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2014Кв1");
	МассивПоддерживаемых.Добавить("ФормаОтчета2013Кв1");
	
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;
	
КонецФункции

// Функция определяет отображение кнопки "Расшифровать" в облачной отчетности
//
// Параметры:
//  ИДРедакцииОтчета - Строка
//  
// Возвращаемое значение:
//   Булево 
Функция РелизованаПоддержкаРасшифровкиВОблачнойОтчетности(ИДРедакцииОтчета) Экспорт

	МассивПоддерживаемых = Новый Массив(); // Массив Из Строка
	
	Возврат МассивПоддерживаемых.Найти(ИДРедакцииОтчета) <> Неопределено;

КонецФункции

#КонецОбласти
#КонецОбласти
