// @strict-types


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуНастроек();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.НастройкиВидКИКандидата Тогда
		СтандартнаяОбработка = Ложь;
		//@skip-check property-return-type
		ПоказатьЗначение(, Элементы.Настройки.ТекущиеДанные.ВидКИКандидата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//@skip-check property-return-type
//@skip-check invocation-parameter-type-intersect
Процедура ТаблицаНастроекВидКИФизическогоЛицаПриИзменении(Элемент)
	
	ВидКИФизическогоЛица = Элементы.Настройки.ТекущиеДанные.ВидКИФизическогоЛица; // СправочникСсылка.ВидыКонтактнойИнформации
	ТекущаяСтрока = Настройки.НайтиПоИдентификатору(Элементы.Настройки.ТекущаяСтрока);
	
	НайденныеСтроки = Настройки.НайтиСтроки(Новый Структура("ВидКИФизическогоЛица", ВидКИФизическогоЛица));
	Для каждого СтрокаНастроек Из НайденныеСтроки Цикл
		Если СтрокаНастроек = ТекущаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНастроек.ВидКИФизическогоЛица = Неопределено;
	КонецЦикла;
	
	ЗаписатьДанные();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Родитель", ОбщегоНазначенияКлиент.ПредопределенныйЭлемент(
		"Справочник.ВидыКонтактнойИнформации.СправочникЛичныеДанныеКандидатов"));
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Оповещение = Новый ОписаниеОповещения("СоздатьЗавершение", ЭтотОбъект);
	
	//@skip-check invocation-parameter-type-intersect
	ОткрытьФорму("Справочник.ВидыКонтактнойИнформации.Форма.ФормаЭлемента", ПараметрыОткрытия, ЭтотОбъект, , , ,
		Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроек()
	
	Настройки.Очистить();
	ВидыКИФизическихЛиц = ПодборПерсонала.ВидыКИФизическихЛицПоКИКандидатов();
	//@skip-check invocation-parameter-type-intersect
	Для Каждого СтрокаТаблицы Из УправлениеКонтактнойИнформацией.ВидыКонтактнойИнформацииОбъекта(
		Справочники.ЛичныеДанныеКандидатов.ПустаяСсылка()) Цикл
			
		СтрокаДанных = Настройки.Добавить();
		СтрокаДанных.ВидКИКандидата = СтрокаТаблицы.Ссылка;
		СтрокаДанных.ТипКИ = СтрокаТаблицы.Тип;
		СтрокаДанных.ВидКИФизическогоЛица = ВидыКИФизическихЛиц.Получить(СтрокаДанных.ВидКИКандидата);
		СтрокаДанных.ИндексПиктограммы = ИндексПиктограммы(СтрокаТаблицы.Тип, ЗначениеЗаполнено(СтрокаТаблицы.ИмяПредопределенногоВида));
		
	КонецЦикла;
	
	Настройки.Сортировать("ВидКИКандидата");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных(Элементы.НастройкиВидКИФизическогоЛица.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, 
		"Настройки.ВидКИФизическогоЛица", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступногоТекста);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не переносить>'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные()
	
	НачатьТранзакцию();
	
	Попытка
		НаборЗаписей = РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		ТаблицаНастроек = Настройки.Выгрузить();
		Для каждого СтрокаНастроек Из ТаблицаНастроек Цикл
			РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ДобавитьНастройку(
				СтрокаНастроек.ВидКИКандидата, СтрокаНастроек.ВидКИФизическогоЛица);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Параметры:
//  ТипКИ - ПеречислениеСсылка.ТипыКонтактнойИнформации
//  ЭтоПредопределенный - Булево
// 
// Возвращаемое значение:
//  Число
&НаСервереБезКонтекста
Функция ИндексПиктограммы(ТипКИ, ЭтоПредопределенный)

	Если ЭтоПредопределенный Тогда
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Индекс = 14;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Индекс = 15;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			Индекс = 16;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
			Индекс = 17;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
			Индекс =18;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Индекс = 19;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
			Индекс = 21;
		Иначе
			Индекс = 3;
		КонецЕсли;
	Иначе
		Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			Индекс = 7;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			Индекс = 8;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			Индекс = 9;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Факс Тогда
			Индекс = 10;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Другое Тогда
			Индекс =11;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			Индекс = 12;
		ИначеЕсли ТипКИ = Перечисления.ТипыКонтактнойИнформации.Skype Тогда
			Индекс = 20;
		Иначе
			Индекс = 3;
		КонецЕсли;
	КонецЕсли;

	Возврат Индекс;
	
КонецФункции

// Параметры:
//  РезультатЗакрытия - Произвольный
//  ДополнительныеПараметры - Произвольный
&НаКлиенте
Процедура СоздатьЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьТаблицуНастроек();
	
КонецПроцедуры

#КонецОбласти
