
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторВзаимодействия = Параметры.ИдентификаторВзаимодействия;
	ИдентификаторОбращения = Параметры.ИдентификаторОбращения;
	ТипВзаимодействия = Параметры.ТипВзаимодействия;
	Входящее = Параметры.Входящее;
	Если Параметры.Свойство("КодПользователя") 
		И ЗначениеЗаполнено(Параметры.КодПользователя) Тогда
		КодПользователя = Параметры.КодПользователя;
	Иначе
		КодПользователя = ИнформационныйЦентрСервер.КодПользователяДляДоступа();
	КонецЕсли;
	Просмотрено = Параметры.Просмотрено;
	
	ЗаполнитьВзаимодействие();
	
	Элементы.КартинкаТипВзаимодействия.Картинка = ИнформационныйЦентрСервер.КартинкаПоВзаимодействию(
			ТипВзаимодействия, Входящее, Просмотрено);
			
	Элементы.НадписьТипВзаимодействия.Заголовок = ИнформационныйЦентрСервер.ТипВзаимодействияСтрокой(
		ТипВзаимодействия, Входящее, Просмотрено);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Просмотрено Тогда 
		Оповестить("ПросмотреноВзаимодействиеПоОбращению");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СодержаниеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ИнформационныйЦентрКлиент.ОткрытьСсылку(ДанныеСобытия.Href, ДанныеСобытия.Element, Элемент.Документ);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ФайлыПредставление" Или Поле.Имя = "ФайлыКартинка" Тогда 
		Результат = ПолучитьИмяФайлаИАдресХранилищаФайла(Элемент.ТекущиеДанные.Идентификатор);
		ИнформационныйЦентрКлиент.ПолучитьФайлИзХранилища(Результат.АдресХранилища, Результат.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	
	ИнформационныйЦентрКлиент.ОткрытьФормуОтправкиСообщенияВСлужбуПоддержки(
		Ложь, ИдентификаторОбращения, КодПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОбращению(Команда)
	
	ИнформационныйЦентрКлиент.ОткрытьОбращениеВСлужбуПоддержки(ИдентификаторОбращения, КодПользователя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьВзаимодействие()
	
	Попытка
		ДанныеПоВзаимодействию = ПолучитьДанныеПоВзаимодействию();
		ЗаполнитьЭлементыФормы(ДанныеПоВзаимодействию);
	Исключение
		ТекстОшибки = ИнформационныйЦентрСлужебный.ПодробныйТекстОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнформационныйЦентрСервер.ПолучитьИмяСобытияДляЖурналаРегистрации(), 
		                         УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ТекстВывода = ИнформационныйЦентрСервер.ТекстВыводаИнформацииОбОшибкеВСлужбеПоддержки();
		ВызватьИсключение ТекстВывода;
	КонецПопытки;
	
КонецПроцедуры

// Получить данные по взаимодействию.
// 
// Возвращаемое значение:
//  ОбъектXDTO 
&НаСервере
Функция ПолучитьДанныеПоВзаимодействию()
	
	WSПрокси = ИнформационныйЦентрСервер.ПолучитьПроксиСлужбыПоддержки();
	
	Результат = WSПрокси.getInteraction(КодПользователя, Строка(ИдентификаторВзаимодействия), 
		ТипВзаимодействия, Входящее);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭлементыФормы(ДанныеПоВзаимодействию)
	
	Заголовок = ДанныеПоВзаимодействию.Name;
	
	ТипДляЗаголовка = НСтр("ru='Взаимодействие'");
	
	Если ТипВзаимодействия = "Email" И Входящее Тогда
		ТипДляЗаголовка = НСтр("ru='Вх. письмо'");
	ИначеЕсли ТипВзаимодействия = "Email" И Не Входящее Тогда
		ТипДляЗаголовка = НСтр("ru='Исх. письмо'");
	ИначеЕсли ТипВзаимодействия = "Comment" И Входящее Тогда
		ТипДляЗаголовка = НСтр("ru='Вх. комментарий'");
	ИначеЕсли ТипВзаимодействия = "Comment" И Не Входящее Тогда
		ТипДляЗаголовка = НСтр("ru='Исх. комментарий'");
	ИначеЕсли ТипВзаимодействия = "PhoneCall" Тогда
		ТипДляЗаголовка = НСтр("ru='Звонок'");
	КонецЕсли;
	
	Заголовок = СтрШаблон(НСтр("ru='%1 от %2'"), ТипДляЗаголовка, Формат(ДанныеПоВзаимодействию.Date, "ДЛФ=DT"));
	
	Если ДанныеПоВзаимодействию.Type = "PhoneCall" Тогда
		
		Элементы.Содержание.Видимость = Ложь;
		Элементы.Файлы.Видимость = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
	HTMLТекст = ДанныеПоВзаимодействию.HTMLText;
	
	Для Каждого ДД Из ДанныеПоВзаимодействию.HTMLFiles Цикл
		 
		Картинка = Новый Картинка(ДД.Data);
		АдресХранилища = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
		HTMLТекст = СтрЗаменить(HTMLТекст, ДД.Name, АдресХранилища);
		
	КонецЦикла;
	
	Содержание = HTMLТекст;
	
	Файлы.Очистить();
	Элементы.Файлы.Видимость = (ДанныеПоВзаимодействию.Files.Количество() <> 0);
	
	СуммарныйРазмерФайловБайт = 0;
	
	Для Каждого ТекущийФайл Из ДанныеПоВзаимодействию.Files Цикл
		СуммарныйРазмерФайловБайт = СуммарныйРазмерФайловБайт + ТекущийФайл.Size;
		НовыйЭлемент = Файлы.Добавить();
		НовыйЭлемент.Представление = ТекущийФайл.Name + "." + ТекущийФайл.Extension
			 + " (" + ПредставлениеРазмераФайла(ТекущийФайл.Size) + ")";
		НовыйЭлемент.Картинка = РаботаСФайламиСлужебныйКлиентСервер.ИндексПиктограммыФайла(ТекущийФайл.Extension);
		НовыйЭлемент.Идентификатор = Новый УникальныйИдентификатор(ТекущийФайл.Id);

	КонецЦикла;
	
	Если ДанныеПоВзаимодействию.Files.Количество() > 0 Тогда
		Элементы.ФайлыКартинка.Заголовок = СтрШаблон(
			НСтр("ru='Файлы (%1), %2'"),
			ДанныеПоВзаимодействию.Files.Количество(),
			ПредставлениеРазмераФайла(СуммарныйРазмерФайловБайт));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяФайлаИАдресХранилищаФайла(ИдентификаторФайла)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АдресХранилища", "");
	ВозвращаемоеЗначение.Вставить("ИмяФайла", "");
	
	Попытка
		
		WSПрокси = ИнформационныйЦентрСервер.ПолучитьПроксиСлужбыПоддержки();
		Результат = WSПрокси.getInteractionFile(КодПользователя, Строка(ИдентификаторВзаимодействия), 
			Строка(ИдентификаторФайла), ТипВзаимодействия, Входящее);
		ВозвращаемоеЗначение.АдресХранилища = ПоместитьВоВременноеХранилище(Результат.Data, УникальныйИдентификатор);
		ВозвращаемоеЗначение.ИмяФайла = Результат.Name + "." + Результат.Extension;
		
	Исключение
		
		ТекстОшибки = ИнформационныйЦентрСлужебный.ПодробныйТекстОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнформационныйЦентрСервер.ПолучитьИмяСобытияДляЖурналаРегистрации(), 
		                         УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ТекстВывода = ИнформационныйЦентрСервер.ТекстВыводаИнформацииОбОшибкеВСлужбеПоддержки();
		
		ВызватьИсключение ТекстВывода;
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеРазмераФайла(Знач РазмерБайт)
	
	РазмерФайла = РазмерБайт;
	
	ЕдиницыРазмераФайла = СтрРазделить(НСтр("ru='Б,КБ,МБ,ГБ,ТБ,ПБ'"), ",");
	ИндексЕдиницы = 0;
	
	Пока РазмерФайла >= 1024 И ИндексЕдиницы < ЕдиницыРазмераФайла.Количество() - 1 Цикл
		РазмерФайла = Окр(РазмерФайла / 1024, 2);
		ИндексЕдиницы = ИндексЕдиницы + 1;
	КонецЦикла;
	
	Возврат СтрШаблон("%1 %2", РазмерФайла, ЕдиницыРазмераФайла[ИндексЕдиницы]);
	
КонецФункции

#КонецОбласти