#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Сотрудники.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник");
	МассивФизическихЛиц = Новый Массив;
	ФизическиеЛицаСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСотрудников, "ФизическоеЛицо");
	Для каждого ЭлементСоответствия Из ФизическиеЛицаСотрудников Цикл
		Если МассивФизическихЛиц.Найти(ЭлементСоответствия.Значение) = Неопределено Тогда
			МассивФизическихЛиц.Добавить(ЭлементСоответствия.Значение);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРодственники = "Родственники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников = "ПрограммыСтрахованияРодственников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников = "РасширенияПрограммСтрахованияРодственников";
	
	Для каждого ЗначениеСтруктуры Из СтруктураИменТаблиц Цикл
		Если ЗначениеСтруктуры.Значение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокиДляУдаления = Новый Массив;
		Для Каждого СтрокаТаблицы Из ЭтотОбъект[ЗначениеСтруктуры.Значение] Цикл
			Если СтрНайти(ЗначениеСтруктуры.Ключ, "Сотрудник") > 0 Тогда
				Если МассивСотрудников.Найти(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
					СтрокиДляУдаления.Добавить(СтрокаТаблицы);
				КонецЕсли;
			Иначе
				Если МассивФизическихЛиц.Найти(СтрокаТаблицы.ФизическоеЛицо) = Неопределено Тогда
					СтрокиДляУдаления.Добавить(СтрокаТаблицы);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ЭтотОбъект[ЗначениеСтруктуры.Значение].Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОтражениеЗарплатыВБухучетеРасширенный.УточнитьСоставПроверяемыхРеквизитовБухучетПлановыхУдержаний(ЭтотОбъект, ПроверяемыеРеквизиты);
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачалаСтрахования, "Объект.ДатаНачалаСтрахования", Отказ, НСтр("ru='Дата начала события'"), , , Ложь);
	
	УникальныеЗначения = Новый Соответствие;
	ИндексСтроки = 0;
	Для Каждого ДанныеФизическогоЛица Из Сотрудники Цикл
		Если УникальныеЗначения[ДанныеФизическогоЛица.Сотрудник] = Неопределено Тогда
			УникальныеЗначения.Вставить(ДанныеФизическогоЛица.Сотрудник, Истина);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Информация о сотруднике %1 была введена в документе ранее.'"),
				ДанныеФизическогоЛица.Сотрудник);
			ОбщегоНазначения.СообщитьПользователю(
				ТекстОшибки, Ссылка, "Объект.Сотрудники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].Сотрудник", ,Отказ);
		КонецЕсли;
		Если ДанныеФизическогоЛица.СтраховатьСотрудника Тогда
			ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаПрикрепления,
				"Объект.Сотрудники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаПрикрепления", Отказ,
				НСтр("ru='Дата прикрепления сотрудника'"), ДатаНачалаСтрахования, НСтр("ru='Даты договора'"));
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	ИндексСтроки = 0;
	Для Каждого ДанныеФизическогоЛица Из Родственники Цикл
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаОткрепления,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаОткрепления", Отказ,
			НСтр("ru='Дата открепления родственника'"), ДанныеФизическогоЛица.ДатаПрикрепления, НСтр("ru='Даты прикрепления'"));
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаОкончанияСтрахования,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаОткрепления", Отказ,
			НСтр("ru='Срок действия договора'"), ДанныеФизическогоЛица.ДатаОткрепления, НСтр("ru='Даты открепления родственника'"));
		ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДанныеФизическогоЛица.ДатаПрикрепления,
			"Объект.Родственники[" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0") + "].ДатаПрикрепления", Отказ,
			НСтр("ru='Дата прикрепления родственника'"), ДатаНачалаСтрахования, НСтр("ru='Даты договора'"));
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияРабочихМестВОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация 		= Организация;
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода		= ДатаНачалаСтрахования;
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода	= ДатаОкончанияСтрахования;
	
	КадровыйУчет.ПроверитьРаботающихСотрудников(
		ОбщегоНазначения.ВыгрузитьКолонку(Сотрудники, "Сотрудник"),
		ПараметрыПолученияСотрудниковОрганизаций,
		Отказ,
		Новый Структура("ИмяПоляСотрудник, ИмяОбъекта", "Сотрудник", "Объект"));
		
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);	
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка к регистрации перерасчетов
	ДанныеДокумента = Новый МенеджерВременныхТаблиц;
	СоздатьВТДанныеДокументов(ДанныеДокумента);
	
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ОчиститьИзмененияПерсональныхДанных();
	СформироватьДвиженияПрикрепленияКПрограммамСтрахования(Движения, ДанныеДокумента);
	
	СформироватьДвиженияОтправленныеДанныеЗастрахованных(Движения);
	СформироватьДвиженияОтправленнаяКонтактнаяИнформацияЗастрахованных(Движения);
	СформироватьДвиженияОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных(Движения);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		ДанныеДляПроведения = РасчетЗарплатыРасширенный.СоздатьДанныеДляРегистрацииПлановыхУдержаний();
		ЗаполнитьДанныеДляРегистрацииПлановыхУдержанийСпискаСотрудников(ДанныеДляПроведения, Ссылка);
		ЗаполнитьПредельныеСуммыУдержанийСотрудников(ДанныеДляПроведения);
		
		ДвиженияУдержаний = Новый Структура;
		ДвиженияУдержаний.Вставить("ДанныеПлановыхУдержаний", ДанныеДляПроведения.ДанныеПлановыхУдержаний);
		ДвиженияУдержаний.Вставить("ЗначенияПоказателей", ДанныеДляПроведения.ЗначенияПоказателей);
		ДвиженияУдержаний.Вставить("РабочиеМестаУдержаний", ДанныеДляПроведения.РабочиеМестаУдержаний);
		
		РасчетЗарплатыРасширенный.СформироватьДвиженияПлановыхУдержаний(Движения, ДвиженияУдержаний);
		РасчетЗарплатыРасширенный.СформироватьДвиженияПредельныхСуммУдержанийСотрудников(Движения, ДанныеДляПроведения.ПредельныеСуммыУдержанийСотрудников);
		
		СформироватьДвиженияУдержаний(Движения);
		СформироватьДвиженияГрафикаУдержаний(Движения);
	КонецЕсли;
	
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Движения, Отказ, ДанныеДокумента);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	МедицинскоеСтрахованиеПереопределяемый.ОбработкаУдаленияПроведения(ЭтотОбъект, Движения, Отказ);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования") Тогда
		Возврат;
	КонецЕсли;
	
	ИменаРеквизитов = "Организация, СтраховаяКомпания, ДоговорСтрахования, Подразделение, ДатаНачалаСтрахования, ДатаОкончанияСтрахования";
	ДанныеПрикрепления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, ИменаРеквизитов);
	
	Основание = ДанныеЗаполнения;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПрикрепления, ИменаРеквизитов);
	
	Сотрудники.Загрузить(СотрудникиПрикрепления(ДанныеЗаполнения));
	ПрограммыСтрахованияСотрудников.Загрузить(ПрограммыСтрахованияСотрудников(ДанныеЗаполнения));
	РасширенияПрограммСтрахованияСотрудников.Загрузить(РасширенияПрограммСтрахованияСотрудников(ДанныеЗаполнения));
	ГрафикУдержаний.Загрузить(ГрафикУдержаний(ДанныеЗаполнения));
	Родственники.Загрузить(РодственникиПрикрепления(ДанныеЗаполнения));
	ПрограммыСтрахованияРодственников.Загрузить(ПрограммыСтрахованияРодственников(ДанныеЗаполнения));
	РасширенияПрограммСтрахованияРодственников.Загрузить(РасширенияПрограммСтрахованияРодственников(ДанныеЗаполнения));
	ДанныеЗастрахованных.Загрузить(ДанныеЗастрахованных(ДанныеЗаполнения));
	КонтактнаяИнформацияЗастрахованных.Загрузить(КонтактнаяИнформацияЗастрахованных(ДанныеЗаполнения));
	ДополнительныеРеквизитыИСведенияЗастрахованных.Загрузить(ДополнительныеРеквизитыИСведенияЗастрахованных(ДанныеЗаполнения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СотрудникиПрикрепления(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка КАК Прикрепление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаУдержания КАК СуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаПредела КАК СуммаПредела,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.УдерживатьИзЗарплаты КАК УдерживатьИзЗарплаты,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СпособУдержания КАК СпособУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания КАК ОбщаяСуммаУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ЧастичноеУдержание КАК ЧастичноеУдержание,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания КАК СуммаЧастичногоУдержания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.ПроцентЧастичногоУдержания КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияСотрудники.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПрограммыСтрахованияСотрудников(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РасширенияПрограммСтрахованияСотрудников(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Сотрудник КАК Сотрудник,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РодственникиПрикрепления(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаПрикрепления КАК ДатаПрикрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ДатаОткрепления КАК ДатаОткрепления,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.ПрограммыСтрахования КАК ПрограммыСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РасширенияПрограммСтрахования КАК РасширенияПрограммСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.УдерживатьССотрудника КАК УдерживатьССотрудника,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРодственники.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПрограммыСтрахованияРодственников(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция РасширенияПрограммСтрахованияРодственников(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования КАК РасширениеСтрахования,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.СтраховаяПремия КАК СтраховаяПремия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ДатаНачала КАК ДатаНачала,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ДатаОкончания КАК ДатаОкончания,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РодственникСсылка КАК РодственникСсылка
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ГрафикУдержаний(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Дата КАК Дата,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ДатаСтрокой КАК ДатаСтрокой,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Сумма КАК Сумма,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.ВведеноПользователем КАК ВведеноПользователем,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.КоличествоДней КАК КоличествоДней,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Представление КАК Представление
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ГрафикУдержаний КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияГрафикУдержаний.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеЗастрахованных(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Имя КАК Имя,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Отчество КАК Отчество,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДанныеЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция КонтактнаяИнформацияЗастрахованных(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК Вид,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Значение КАК Значение,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК Представление,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Значение КАК ЗначениеДоИзменения,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК ПредставлениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДополнительныеРеквизитыИСведенияЗастрахованных(ПрикреплениеСсылка)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ПрикреплениеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Свойство КАК Свойство,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК Значение,
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК ЗначениеДоИзменения
		|ИЗ
		|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных
		|ГДЕ
		|	ПрикреплениеКПрограммамМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка = &Ссылка";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура СоздатьВТДанныеДокументов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахования.Организация КАК Организация,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Действует,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.ДатаОкончания КАК ДействуетДо,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДатаИзменения КАК Период
		|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийПрограммСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Сотрудник = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахования.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА
		|	И ВЫБОР
		|			КОГДА ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка)
		|			  ИЛИ ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахования.Организация,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.ФизическоеЛицо,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ПрограммаСтрахования,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ДатаОкончания,
		|	ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.СтраховаяПремия,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДатаИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ИзменениеУсловийМедицинскогоСтрахованияРодственники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.РодственникСсылка = ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахования.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияРодственников = ИСТИНА
		|	И ВЫБОР
		|			КОГДА ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка)
		|			  ИЛИ ИзменениеУсловийМедицинскогоСтрахованияПрограммыСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахования.Организация КАК Организация,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	"""" КАК Родственник,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Действует,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.ДатаОкончания КАК ДействуетДо,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДатаИзменения КАК Период
		|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Сотрудник = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Сотрудник
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахования.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА
		|	И ВЫБОР
		|			КОГДА ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка)
		|			  ИЛИ ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияСотрудников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахования.Организация,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.ФизическоеЛицо,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РасширениеСтрахования,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.Изменить)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ДатаОкончания,
		|	ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.СтраховаяПремия,
		|	ИзменениеУсловийМедицинскогоСтрахования.ДатаИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ИзменениеУсловийМедицинскогоСтрахованияРодственники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.РодственникСсылка = ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахования.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияРодственников = ИСТИНА
		|	И ВЫБОР
		|			КОГДА ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.ПустаяСсылка)
		|			  ИЛИ ИзменениеУсловийМедицинскогоСтрахованияРасширенияПрограммСтрахованияРодственников.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСПрограммамиМедицинскогоСтрахования.НеИзменять)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаполнитьПредельныеСуммыУдержанийСотрудников(ДанныеДляПроведения)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Документ", Ссылка);
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Удержание);
	Запрос.УстановитьПараметр("ВидРасчетаРассчитывается", ?(ВидРасчетаИнфо.Рассчитывается = Неопределено, Ложь, ВидРасчетаИнфо.Рассчитывается));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахования.ДатаИзменения КАК Период,
		|	ИзменениеУсловийМедицинскогоСтрахования.Организация.ГоловнаяОрганизация КАК Организация,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Прикрепление КАК ДокументОснование,
		|	ИСТИНА КАК ПрекратитьПоДостижениюПредела,
		|	ВЫБОР
		|		КОГДА ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ЧастичноеУдержание
		|			ТОГДА ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания
		|		ИНАЧЕ ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = &Документ
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания <> 0
		|	И НЕ &ВидРасчетаРассчитывается
		|	И (ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Единовременно)
		|			ИЛИ ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно))
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументУдержания.ДатаПрикрепления,
		|	ДокументУдержания.ОрганизацияГоловнаяОрганизация,
		|	ДокументУдержания.ФизическоеЛицо,
		|	ДокументУдержания.Удержание,
		|	ДокументУдержания.Прикрепление,
		|	ИСТИНА,
		|	СУММА(ДокументУдержания.СтраховаяПремия)
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДокументУдержания.ДатаПрикрепления КАК ДатаПрикрепления,
		|		ИзменениеУсловийМедицинскогоСтрахования.Организация.ГоловнаяОрганизация КАК ОрганизацияГоловнаяОрганизация,
		|		ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ИзменениеУсловийМедицинскогоСтрахования.Удержание КАК Удержание,
		|		ДокументУдержания.Прикрепление КАК Прикрепление,
		|		ДокументУдержания.СтраховаяПремия КАК СтраховаяПремия
		|	ИЗ
		|		Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|			ПО ДокументУдержания.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|	ГДЕ
		|		ДокументУдержания.СтраховаяПремия <> 0
		|		И ДокументУдержания.Ссылка = &Документ
		|		И &ВидРасчетаРассчитывается
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ДокументУдержания.ДатаПрикрепления,
		|		ИзменениеУсловийМедицинскогоСтрахования.Организация.ГоловнаяОрганизация,
		|		ДокументУдержания.ФизическоеЛицо,
		|		ИзменениеУсловийМедицинскогоСтрахования.Удержание,
		|		ДокументУдержанияСотрудники.Прикрепление,
		|		ДокументУдержания.СтраховаяПремия
		|	ИЗ
		|		Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ДокументУдержания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования КАК ИзменениеУсловийМедицинскогоСтрахования
		|			ПО ДокументУдержания.Ссылка = ИзменениеУсловийМедицинскогоСтрахования.Ссылка
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументУдержанияСотрудники
		|			ПО ДокументУдержания.Ссылка = ДокументУдержанияСотрудники.Ссылка
		|				И ДокументУдержания.ФизическоеЛицо = ДокументУдержанияСотрудники.ФизическоеЛицо
		|	ГДЕ
		|		ДокументУдержания.СтраховаяПремия <> 0
		|		И ДокументУдержания.Ссылка = &Документ
		|		И &ВидРасчетаРассчитывается) КАК ДокументУдержания
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументУдержания.ДатаПрикрепления,
		|	ДокументУдержания.ОрганизацияГоловнаяОрганизация,
		|	ДокументУдержания.ФизическоеЛицо,
		|	ДокументУдержания.Удержание,
		|	ДокументУдержания.Прикрепление";
	
	ДанныеДляПроведения.ПредельныеСуммыУдержанийСотрудников = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// Заполняет данные для проведения плановых удержаний для многосотрудникового документа.
//
// Параметры:
//		ДанныеДляПроведения - Структура, описанная в СоздатьДанныеДляРегистрацииПлановыхУдержаний.
//		Документ - Ссылка на документ.
//
Процедура ЗаполнитьДанныеДляРегистрацииПлановыхУдержанийСпискаСотрудников(ДанныеДляПроведения, Документ) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументУдержания.Ссылка.ДатаИзменения КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ДокументУдержания.Ссылка.ДатаОкончанияСтрахования > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДокументУдержания.Ссылка.ДатаОкончанияСтрахования, ДЕНЬ, 1)
	|		ИНАЧЕ ДокументУдержания.Ссылка.ДатаОкончанияСтрахования
	|	КОНЕЦ КАК ДействуетДо,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Ссылка.Организация.ГоловнаяОрганизация КАК Организация,
	|	ДокументУдержания.Удержание КАК Удержание,
	|	ДокументУдержания.Прикрепление КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА
	|			ДокументУдержания.СпособУдержания = ЗНАЧЕНИЕ(Перечисление.СпособыУдержанияМедицинскогоСтрахованияСотрудников.Ежемесячно)
	|			ТОГДА ДокументУдержания.СуммаУдержания
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДокументУдержания.ЧастичноеУдержание
	|					ТОГДА ДокументУдержания.СуммаЧастичногоУдержания
	|				ИНАЧЕ ДокументУдержания.ОбщаяСуммаУдержания
	|			КОНЕЦ
	|	КОНЕЦ КАК Размер,
	|	ИСТИНА КАК Используется
	|ИЗ
	|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И ДокументУдержания.ОбщаяСуммаУдержания <> 0
	|	И ДокументУдержания.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументУдержания.Ссылка.ДатаИзменения КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА ДокументУдержания.Ссылка.ДатаОкончанияСтрахования > ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДокументУдержания.Ссылка.ДатаОкончанияСтрахования, ДЕНЬ, 1)
	|		ИНАЧЕ ДокументУдержания.Ссылка.ДатаОкончанияСтрахования
	|	КОНЕЦ КАК ДействуетДо,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Ссылка.Организация.ГоловнаяОрганизация КАК Организация,
	|	ДокументУдержания.Прикрепление КАК ДокументОснование,
	|	ЗначенияПоказателей.Показатель КАК Показатель,
	|	ЗначенияПоказателей.Значение КАК Значение
	|ИЗ
	|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Показатели КАК ЗначенияПоказателей
	|		ПО (ЗначенияПоказателей.Ссылка = ДокументУдержания.Ссылка)
	|		И (ЗначенияПоказателей.ИдентификаторСтрокиВидаРасчета = ДокументУдержания.ИдентификаторСтрокиВидаРасчета)
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И (ДокументУдержания.СуммаУдержания <> 0
	|	ИЛИ &ВидРасчетаРассчитывается)
	|	И ДокументУдержания.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументУдержания.Ссылка.ДатаИзменения КАК Период,
	|	ДокументУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДокументУдержания.Прикрепление КАК ДокументОснование,
	|	ДокументУдержания.Сотрудник КАК РабочееМесто
	|ИЗ
	|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ДокументУдержания
	|ГДЕ
	|	ДокументУдержания.Ссылка = &Документ
	|	И ДокументУдержания.ОбщаяСуммаУдержания > 0
	|	И ДокументУдержания.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Документ);
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(Удержание);
	Запрос.УстановитьПараметр("ВидРасчетаРассчитывается", ?(ВидРасчетаИнфо.Рассчитывается = Неопределено, Ложь, ВидРасчетаИнфо.Рассчитывается));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПроведения.ДанныеПлановыхУдержаний = РезультатыЗапроса[0].Выгрузить();
	ДанныеДляПроведения.ЗначенияПоказателей = РезультатыЗапроса[1].Выгрузить();
	ДанныеДляПроведения.РабочиеМестаУдержаний = РезультатыЗапроса[2].Выгрузить();
	
КонецПроцедуры

Процедура СформироватьДвиженияПрикрепленияКПрограммамСтрахования(Движения, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийПрограммСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
	|	СуммыСтраховыхПремийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийПрограммСтрахования.Родственник КАК Родственник,
	|	СуммыСтраховыхПремийПрограммСтрахования.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	СуммыСтраховыхПремийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийПрограммСтрахования КАК СуммыСтраховыхПремийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ДоговорСтрахования КАК ДоговорСтрахования,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Родственник КАК Родственник,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования КАК СуммыСтраховыхПремийРасширенийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияОтправленныеДанныеЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения КАК ДатаРождения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения КАК ДатаРожденияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения КАК СтраховойНомерПФРДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Пол КАК Пол,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения КАК ПолДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Страна КАК Страна,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения КАК СтранаДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление КАК ДокументПредставление,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения КАК ДокументПредставлениеДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид КАК ДокументВид,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения КАК ДокументВидДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия КАК ДокументСерия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения КАК ДокументСерияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер КАК ДокументНомер,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения КАК ДокументНомерДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения КАК ДокументДатаВыдачиДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия КАК ДокументСрокДействия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения КАК ДокументСрокДействияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан КАК ДокументКемВыдан,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения КАК ДокументКемВыданДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения КАК ДокументКодПодразделения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения КАК ДокументКодПодразделенияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия КАК Фамилия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Имя КАК Имя,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Отчество КАК Отчество,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения КАК ФамилияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения КАК ИмяДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения КАК ОтчествоДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДатаИзменения КАК Период
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.ДанныеЗастрахованных КАК ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьОтправленныеДанныеСотрудника = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка.ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРождения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДатаРожденияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФР,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтраховойНомерПФРДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Пол,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ПолДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Страна,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.СтранаДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставление,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументПредставлениеДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВид,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументВидДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСерияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомер,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументНомерДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачи,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументДатаВыдачиДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументСрокДействияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыдан,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКемВыданДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ДокументКодПодразделенияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Фамилия,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Имя,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Отчество,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ФамилияДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ИмяДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.ОтчествоДоИзменения,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка.ДатаИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ИзменениеУсловийМедицинскогоСтрахованияРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.ДанныеЗастрахованных КАК ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка = ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Застрахованный
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияДанныеЗастрахованных.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленныеДанныеЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленныеДанныеЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияОтправленнаяКонтактнаяИнформацияЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид КАК Вид,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление КАК Представление,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДатаИзменения КАК Период
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьОтправленныеДанныеСотрудника = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка.ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Вид,
		|	ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Представление,
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка.ДатаИзменения
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Родственники КАК ИзменениеУсловийМедицинскогоСтрахованияРодственники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.КонтактнаяИнформацияЗастрахованных КАК ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияРодственники.РодственникСсылка = ИзменениеУсловийМедицинскогоСтрахованияКонтактнаяИнформацияЗастрахованных.Застрахованный
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияРодственники.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленнаяКонтактнаяИнформацияЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленнаяКонтактнаяИнформацияЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных(Движения)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка КАК ДокументОснование,
		|	ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный КАК Застрахованный,
		|	ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Свойство КАК Свойство,
		|	ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Значение КАК Значение,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДатаИзменения КАК Период
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.ДополнительныеРеквизитыИСведенияЗастрахованных КАК ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных
		|		ПО ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка
		|			И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Застрахованный
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияДополнительныеРеквизитыИСведенияЗастрахованных.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьОтправленныеДанныеСотрудника = ИСТИНА";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ОтправленныеДополнительныеРеквизитыИСведенияЗастрахованных.Записывать = Истина;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьДвиженияУдержаний(Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.Организация КАК Организация,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДоговорСтрахования КАК ДоговорСтрахования,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Прикрепление КАК ДокументОснование,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СпособУдержания КАК СпособУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СуммаУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.СуммаЧастичногоУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДатаИзменения КАК Период
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ОбщаяСуммаУдержания > 0
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = &Регистратор
		|	И ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.УдержанияМедицинскогоСтрахования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.УдержанияМедицинскогоСтрахования.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияГрафикаУдержаний(Движения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.НомерСтроки КАК НомерСтроки,
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.Ссылка КАК Ссылка,
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.Дата КАК Дата,
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.Сумма КАК Сумма,
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.Ссылка.Организация КАК Организация
		|ПОМЕСТИТЬ ВТГрафикУдержаний
		|ИЗ
		|	Документ.ИзменениеУсловийМедицинскогоСтрахования.ГрафикУдержаний КАК ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияГрафикУдержаний.Ссылка = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТГрафикУдержаний.НомерСтроки КАК НомерПоПорядку,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Прикрепление КАК ДокументОснование,
		|	ВТГрафикУдержаний.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТГрафикУдержаний.Дата КАК Дата,
		|	ВТГрафикУдержаний.Сумма КАК Сумма,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Удержание КАК Удержание,
		|	ВТГрафикУдержаний.Организация КАК Организация,
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка.ДатаИзменения КАК Период
		|ИЗ
		|	ВТГрафикУдержаний КАК ВТГрафикУдержаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийМедицинскогоСтрахования.Сотрудники КАК ИзменениеУсловийМедицинскогоСтрахованияСотрудники
		|		ПО ВТГрафикУдержаний.Ссылка = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка
		|			И ВТГрафикУдержаний.ФизическоеЛицо = ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ФизическоеЛицо
		|			И (ИзменениеУсловийМедицинскогоСтрахованияСотрудники.ИзменилисьУсловияСтрахованияСотрудника = ИСТИНА)
		|ГДЕ
		|	ИзменениеУсловийМедицинскогоСтрахованияСотрудники.Ссылка = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ГрафикУдержанийМедицинскогоСтрахования.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ГрафикУдержанийМедицинскогоСтрахования.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьИзмененияПерсональныхДанных()
	
	Для Каждого СтрокаСотрудник Из Сотрудники Цикл
		ОчиститьИзмененияОтправленныхДанных(СтрокаСотрудник.ФизическоеЛицо);
		ОчиститьИзмененияОтправленнойКонтактнойИнформации(СтрокаСотрудник.ФизическоеЛицо);
		ОчиститьИзмененияОтправленныхДополнительныхРеквизитовИСведений(СтрокаСотрудник.ФизическоеЛицо);
	КонецЦикла;
	
	Для Каждого СтрокаРодственник Из Родственники Цикл
		ОчиститьИзмененияОтправленныхДанных(СтрокаРодственник.РодственникСсылка);
		ОчиститьИзмененияОтправленнойКонтактнойИнформации(СтрокаРодственник.РодственникСсылка);
		ОчиститьИзмененияОтправленныхДополнительныхРеквизитовИСведений(СтрокаРодственник.РодственникСсылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьИзмененияОтправленныхДанных(Застрахованный)

	НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ДоговорСтрахования);
	НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ОчиститьИзмененияОтправленнойКонтактнойИнформации(Застрахованный)

	НаборЗаписей = РегистрыСведений.ИзменениеОтправленнойКонтактнойИнформацииЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ДоговорСтрахования);
	НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ОчиститьИзмененияОтправленныхДополнительныхРеквизитовИСведений(Застрахованный)

	НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДополнительныхРеквизитовИСведенийЗастрахованных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ДоговорСтрахования);
	НаборЗаписей.Отбор.Застрахованный.Установить(Застрахованный);
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли