
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, настроен ли общий каталог электронных курсов.
// 
// Возвращаемое значение:
//  Булево - Истина, если общий каталог настроен
Функция ОбщийКаталогЭлектронныхКурсовНастроен() Экспорт
	
	Настройки = ЭлектронноеОбучение.НастройкиЭлектронногоОбучения();
	Возврат Настройки.ОбщийКаталогНастроен ;
	
КонецФункции

Процедура СформироватьШаблонПриглашенияНаТестирование() Экспорт
	ЭлектронноеТестированиеКандидатов.СформироватьШаблонПриглашенияНаТестирование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВариантыОтветовВопроса(Вопрос) Экспорт
	
	ВариантыОтветов = РазработкаЭлектронныхКурсов.ВариантыОтветовВопроса(Вопрос);
	Возврат ВариантыОтветов.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти