
#Область СлужебныйПрограммныйИнтерфейс

Процедура ВводНачисленийИнициализироватьСтрокиНачислений(Форма, СтрокиНачислений, ОписаниеТаблицы, РежимРаботы, Сотрудник = Неопределено, ДатаСведений = Неопределено) Экспорт
	
	Модуль = Неопределено;
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Если ЗарплатаКадры.БазовыйРежим() Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("РезервыПоОплатеТрудаДляНебольшихОрганизацийКлиентСервер");
		КонецЕсли;
	#Иначе
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций.ОценочныеОбязательства")
			И ЗарплатаКадрыКлиентПовтИсп.БазовыйРежим() Тогда
			Модуль = ОбщегоНазначенияКлиент.ОбщийМодуль("РезервыПоОплатеТрудаДляНебольшихОрганизацийКлиентСервер");
		КонецЕсли;
	#КонецЕсли
	Если Модуль <> Неопределено Тогда
		Модуль.ВводНачисленийИнициализироватьСтрокиНачислений(Форма, СтрокиНачислений, ОписаниеТаблицы, РежимРаботы, Сотрудник, ДатаСведений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
