#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьСтатусыГотовности");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.РезультатыАттестацииСотрудников;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область ОбработчикиОбновления

// Выполняет заполнение реквизита СтатусГотовности при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьСтатусыГотовности(ПараметрыОбновления) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьАттестацииСотрудников") 
		Или Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв")
		Или ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	МодульКадровыйРезерв = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
	Если Не МодульКадровыйРезерв.КадровыйРезервДоступенПользователю() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
			"ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Если Не ПараметрыОбновления.Свойство("ОбработанныеДокументы") Тогда
		ПараметрыОбновления.Вставить("ОбработанныеДокументы", Новый Массив);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ПараметрыОбновления.ОбработанныеДокументы);
	Запрос.УстановитьПараметр("ПустаяПозиция", МодульКадровыйРезерв.ПустаяПозицияКадровогоРезерва());
	Запрос.УстановитьПараметр("ПустойСтатус", МодульКадровыйРезерв.ПустойСтатусГотовностиРезервистов());
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	РезультатыАттестацииСотрудников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РезультатыАттестацииСотрудников КАК РезультатыАттестацииСотрудников
		|ГДЕ
		|	(ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК
		|				РезультатыАттестацииСотрудниковРезультатыАттестации
		|		ГДЕ
		|			РезультатыАттестацииСотрудниковРезультатыАттестации.Ссылка = РезультатыАттестацииСотрудников.Ссылка
		|			И
		|				РезультатыАттестацииСотрудниковРезультатыАттестации.РешениеКомиссии = ЗНАЧЕНИЕ(Справочник.РешенияАттестационныхКомиссий.РекомендуетсяВКадровыйРезерв)
		|			И РезультатыАттестацииСотрудниковРезультатыАттестации.ПозицияРезерва <> &ПустаяПозиция
		|			И РезультатыАттестацииСотрудниковРезультатыАттестации.СтатусГотовности = &ПустойСтатус))
		|	И НЕ РезультатыАттестацииСотрудников.Ссылка В (&ОбработанныеДокументы)";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.РезультатыАттестацииСотрудников.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработанныеДокументы", Новый Массив);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.РезультатыАттестацииСотрудников
			Для Каждого СтрокаРезультатыАттестации Из ДокументОбъект.РезультатыАттестации Цикл
				Если СтрокаРезультатыАттестации.РешениеКомиссии = Справочники.РешенияАттестационныхКомиссий.РекомендуетсяВКадровыйРезерв
					И ЗначениеЗаполнено(СтрокаРезультатыАттестации.ПозицияРезерва)
					И Не ЗначениеЗаполнено(СтрокаРезультатыАттестации.СтатусГотовности) Тогда
					СтрокаРезультатыАттестации.СтатусГотовности =
						МодульКадровыйРезерв.СтатусГотовностиРезервистовГотовКНазначению();
				КонецЕсли;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект, , , РежимЗаписиДокумента.Проведение);
			ПараметрыОбновления.ОбработанныеДокументы.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьАттестацииСотрудников") Тогда
		
		// График аттестации сотрудников.
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.Идентификатор = "ПФ_MXL_ПротоколЗаседанияАттестационнойКомиссии";
		КомандаПечати.Представление = НСтр("ru = 'Протокол заседания аттестационной комиссии'");
		КомандаПечати.Порядок = 10;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		
		ВидыВнешнихАттестаций = АттестацииСотрудников.ВидыВнешнихАттестаций();
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидАттестации", ВидыВнешнихАттестаций, ВидСравненияКомпоновкиДанных.НеВСписке);

	КонецЕсли;	
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ПротоколЗаседанияАттестационнойКомиссии") Тогда
		ТабличныйДокумент = ТабличныйДокументПротоколЗаседанияАттестационнойКомиссии(МассивОбъектов, ОбъектыПечати);
		Если НЕ ТабличныйДокумент = Неопределено Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"ПФ_MXL_ПротоколЗаседанияАттестационнойКомиссии", НСтр("ru = 'Протокол заседания аттестационной комиссии'"), ТабличныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура печати документа.
// Возвращает табличный документ - сформированную печатную форму протокол заседания Комиссии.
//
// Параметры:
//	МассивОбъектов - массив сотрудников.
//  ОбъектыПечати  - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя области в
//                   которой был выведен объект).
//
// Возвращаемое значение:
//	Табличный документ
//
Функция ТабличныйДокументПротоколЗаседанияАттестационнойКомиссии(МассивСсылок, ОбъектыПечати)
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_ПротоколАттестацииСотрудников";
	
	МассивДанныхДляПечати = ДанныеДляПечатиПротоколЗаседанияАттестационнойКомиссии(МассивСсылок);
	ДанныеДляПечати			 		= МассивДанныхДляПечати[0].Выбрать();
	ДанныеДляПечатиОтветственных 	= МассивДанныхДляПечати[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДанныеДляПечатиСотрудников	 	= МассивДанныхДляПечати[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДляПечати.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ОбластиМакета = ОбластиМакетаПротоколЗаседанияАттестационнойКомиссии(ДанныеДляПечати.ВидАттестации);
		
		Если Не ПервыйДокумент Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
		
		СтруктураЗаполнения = Новый Структура("Организация, Дата, Номер");
		СтруктураЗаполнения.Организация = ?(ЗначениеЗаполнено(ДанныеДляПечати.НаименованиеПолное), ДанныеДляПечати.НаименованиеПолное, ДанныеДляПечати.НаименованиеСокращенное);
		СтруктураЗаполнения.Дата 		= Формат(ДанныеДляПечати.Дата, "ДЛФ=DD");
		СтруктураЗаполнения.Номер 		= КадровыйУчетРасширенный.НомерКадровогоПриказа(ДанныеДляПечати.Номер);
		
		ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьШапка.Параметры, СтруктураЗаполнения);
		ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьПовестка.Параметры, ДанныеДляПечати);
		ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьРешениеКомиссииНачало.Параметры, ДанныеДляПечати);
		
		ДокументРезультат.Вывести(ОбластиМакета.ОбластьШапка);
		
		ДанныеДляПечатиОтветственных.Сбросить(); 
		ДанныеДляПечатиОтветственныхДокумента = Неопределено;
		Если ДанныеДляПечатиОтветственных.НайтиСледующий(Новый Структура("Ссылка", ДанныеДляПечати.Ссылка)) Тогда
			ДанныеДляПечатиОтветственныхДокумента = ДанныеДляПечатиОтветственных.Выбрать();
			НомерПоПорядку = 1;
			Пока ДанныеДляПечатиОтветственныхДокумента.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьЧленКомиссии.Параметры, ДанныеДляПечатиОтветственныхДокумента);
				
				СтруктураЗаполнения = Новый Структура("НомерПоПорядку");
				СтруктураЗаполнения.НомерПоПорядку = НомерПоПорядку;
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьЧленКомиссии.Параметры, СтруктураЗаполнения);
				НомерПоПорядку = НомерПоПорядку + 1;
				
				ДокументРезультат.Вывести(ОбластиМакета.ОбластьЧленКомиссии);
			КонецЦикла; 
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластиМакета.ОбластьПовестка);
		
		ДанныеДляПечатиСотрудников.Сбросить();
		ДанныеДляПечатиСотрудниковДокумента = Неопределено;
		Если ДанныеДляПечатиСотрудников.НайтиСледующий(Новый Структура("Ссылка", ДанныеДляПечати.Ссылка)) Тогда
			ДанныеДляПечатиСотрудниковДокумента = ДанныеДляПечатиСотрудников.Выбрать();
			НомерПоПорядку = 1;
			Пока ДанныеДляПечатиСотрудниковДокумента.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьАттестуемый.Параметры, ДанныеДляПечатиСотрудниковДокумента);
				
				СтруктураЗаполнения = Новый Структура("НомерПоПорядку");
				СтруктураЗаполнения.НомерПоПорядку = НомерПоПорядку;
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьАттестуемый.Параметры, СтруктураЗаполнения);
				НомерПоПорядку = НомерПоПорядку + 1;
				
				ДокументРезультат.Вывести(ОбластиМакета.ОбластьАттестуемый);
			КонецЦикла; 
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластиМакета.ОбластьРешениеКомиссииНачало);
		
		Если НЕ ДанныеДляПечатиСотрудниковДокумента = Неопределено Тогда
			ДанныеДляПечатиСотрудниковДокумента.Сбросить();
			НомерПоПорядку = 1;
			Пока ДанныеДляПечатиСотрудниковДокумента.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьРешениеКомиссии.Параметры, ДанныеДляПечатиСотрудниковДокумента);
				СтруктураЗаполнения = Новый Структура("НомерПоПорядку");
				СтруктураЗаполнения.НомерПоПорядку = НомерПоПорядку;
				ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьРешениеКомиссии.Параметры, СтруктураЗаполнения);
				ДокументРезультат.Вывести(ОбластиМакета.ОбластьРешениеКомиссии);
				НомерПоПорядку = НомерПоПорядку + 1;
			КонецЦикла; 
		КонецЕсли;
		
		Если НЕ ДанныеДляПечатиОтветственныхДокумента = Неопределено  Тогда
			
			ДанныеДляПечатиОтветственныхДокумента.Сбросить();
			
			СтруктураЗаполнения = Новый Структура("ФамилияИОПредседателя, ФамилияИОЗаместителяПредседателя, ФамилияИОСекретаря");
			Если ДанныеДляПечатиОтветственныхДокумента.НайтиСледующий(1, "ПорядокРолей") Тогда
				СтруктураЗаполнения.ФамилияИОПредседателя = ДанныеДляПечатиОтветственныхДокумента.ФамилияИОЧленаКомиссии;
			КонецЕсли;
			Если ДанныеДляПечатиОтветственныхДокумента.НайтиСледующий(2, "ПорядокРолей") Тогда
				СтруктураЗаполнения.ФамилияИОЗаместителяПредседателя = ДанныеДляПечатиОтветственныхДокумента.ФамилияИОЧленаКомиссии;
			КонецЕсли;
			Если ДанныеДляПечатиОтветственныхДокумента.НайтиСледующий(3, "ПорядокРолей") Тогда
				СтруктураЗаполнения.ФамилияИОСекретаря = ДанныеДляПечатиОтветственныхДокумента.ФамилияИОЧленаКомиссии;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьПодвал.Параметры, СтруктураЗаполнения);
			ДокументРезультат.Вывести(ОбластиМакета.ОбластьПодвал);
			
			Пока ДанныеДляПечатиОтветственныхДокумента.СледующийПоЗначениюПоля("ЧленКомиссии") Цикл
				Если ДанныеДляПечатиОтветственныхДокумента.РольВКомиссии = Перечисления.РолиЧленовАттестационнойКомиссии.ЧленКомиссии Тогда
					ЗаполнитьЗначенияСвойств(ОбластиМакета.ОбластьПодписьЧленаКомиссии.Параметры, ДанныеДляПечатиОтветственныхДокумента);
					ДокументРезультат.Вывести(ОбластиМакета.ОбластьПодписьЧленаКомиссии);
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ДокументРезультат, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	

	Возврат ДокументРезультат;
	
КонецФункции

Функция ОбластиМакетаПротоколЗаседанияАттестационнойКомиссии(ВидАттестации)
	
	ОбластиМакета = Новый Структура;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") 
		И АттестацииСотрудников.ЭтоАттестацияГосударственныхСлужащих(ВидАттестации) Тогда
		
		Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
		ОбластиМакета = Модуль.ОбластиМакетаПротоколЗаседанияАттестационнойКомиссии();		
		
	Иначе		
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РезультатыАттестацииСотрудников.ПФ_MXL_ПротоколЗаседанияАттестационнойКомиссии");
		ОбластиМакета.Вставить("ОбластьШапка", Макет.ПолучитьОбласть("Шапка"));
		ОбластиМакета.Вставить("ОбластьЧленКомиссии", Макет.ПолучитьОбласть("ЧленКомиссии"));
		ОбластиМакета.Вставить("ОбластьПовестка", Макет.ПолучитьОбласть("Повестка"));
		ОбластиМакета.Вставить("ОбластьАттестуемый", Макет.ПолучитьОбласть("Аттестуемый"));
		ОбластиМакета.Вставить("ОбластьРешениеКомиссииНачало", Макет.ПолучитьОбласть("РешениеКомиссииНачало"));
		ОбластиМакета.Вставить("ОбластьРешениеКомиссии", Макет.ПолучитьОбласть("РешениеКомиссии"));
		ОбластиМакета.Вставить("ОбластьПодвал", Макет.ПолучитьОбласть("Подвал"));
		ОбластиМакета.Вставить("ОбластьПодписьЧленаКомиссии", Макет.ПолучитьОбласть("ПодписьЧленаКомиссии"));
		
	КонецЕсли;
	
	Возврат ОбластиМакета;
	
КонецФункции

Функция ДанныеДляПечатиПротоколЗаседанияАттестационнойКомиссии(МассивСсылок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);

	СоздатьВТКадровыхДанных(Запрос);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезультатыАттестацииСотрудников.Ссылка КАК Ссылка,
	|	РезультатыАттестацииСотрудников.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА РезультатыАттестацииСотрудников.НомерПервичногоДокумента = """"
	|			ТОГДА РезультатыАттестацииСотрудников.Номер
	|		ИНАЧЕ РезультатыАттестацииСотрудников.НомерПервичногоДокумента
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА РезультатыАттестацииСотрудников.ДатаПервичногоДокумента <> ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА РезультатыАттестацииСотрудников.ДатаПервичногоДокумента
	|		ИНАЧЕ РезультатыАттестацииСотрудников.Дата
	|	КОНЕЦ КАК Дата,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.НаименованиеСокращенное КАК НаименованиеСокращенное,
	|	РезультатыАттестацииСотрудников.ВидАттестации КАК ВидАттестации
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников КАК РезультатыАттестацииСотрудников
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РезультатыАттестацииСотрудников.Организация = Организации.Ссылка
	|ГДЕ
	|	РезультатыАттестацииСотрудников.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧленыКомиссии.Ссылка КАК Ссылка,
	|	ЧленыКомиссии.ЧленКомиссии КАК ЧленКомиссии,
	|	ЧленыКомиссии.РольВКомиссии КАК РольВКомиссии,
	|	ВЫБОР
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.Председатель)
	|			ТОГДА 1
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.ЗаместительПредседателя)
	|			ТОГДА 2
	|		КОГДА ЧленыКомиссии.РольВКомиссии = ЗНАЧЕНИЕ(Перечисление.РолиЧленовАттестационнойКомиссии.Секретарь)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК ПорядокРолей,
	|	ВТКадровыеДанныеФизическихЛиц.ФИОПолные КАК ФИОЧленаКомиссии,
	|	ВТКадровыеДанныеФизическихЛиц.ИОФамилия КАК ФамилияИОЧленаКомиссии
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.СоставАттестационнойКомиссии КАК ЧленыКомиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК ВТКадровыеДанныеФизическихЛиц
	|		ПО ЧленыКомиссии.ЧленКомиссии = ВТКадровыеДанныеФизическихЛиц.ФизическоеЛицо
	|			И ЧленыКомиссии.Ссылка.Дата = ВТКадровыеДанныеФизическихЛиц.Период
	|ГДЕ
	|	ЧленыКомиссии.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокРолей
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Результаты.Ссылка КАК Ссылка,
	|	Результаты.Сотрудник КАК Сотрудник,
	|	Результаты.РезультатАттестации КАК РезультатАттестации,
	|	ВТКадровыеДанныеСотрудников.ФИОПолные КАК ФИОАттестуемого,
	|	Результаты.Должность КАК Должность
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК Результаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК ВТКадровыеДанныеСотрудников
	|		ПО Результаты.Сотрудник = ВТКадровыеДанныеСотрудников.Сотрудник
	|			И Результаты.Ссылка.Дата = ВТКадровыеДанныеСотрудников.Период
	|ГДЕ
	|	Результаты.Ссылка В(&МассивСсылок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник
	|ИТОГИ ПО
	|	Ссылка";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

Процедура СоздатьВТКадровыхДанных(Запрос)
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВТСотрудники
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧленыКомиссии.ЧленКомиссии КАК ФизическоеЛицо,
	|	ЧленыКомиссии.Ссылка.Дата КАК Период
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	Документ.РезультатыАттестацииСотрудников.СоставАттестационнойКомиссии КАК ЧленыКомиссии
	|ГДЕ
	|	ЧленыКомиссии.Ссылка В(&МассивСсылок)";
	
	Запрос.Выполнить();
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(Описатель, Истина, "ФИОПолные,ИОФамилия");
	
	Описатель = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТФизическиеЛица");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(Описатель, Истина, "ФИОПолные,ИОФамилия");
	
КонецПроцедуры

#КонецОбласти

Функция ДанныеДляПроведенияМероприятияТрудовойДеятельности(СсылкаНаДокумент) Экспорт
	
	ДанныеДляПроведения = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Ссылка КАК Ссылка,
		|	ТаблицаДокумента.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ТаблицаДокумента.Ссылка.Организация КАК Организация,
		|	ТаблицаДокумента.Сотрудник КАК Сотрудник,
		|	ТаблицаДокумента.ДатаАттестации КАК ДатаМероприятия,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.УстановлениеВторойПрофессии) КАК ВидМероприятия,
		|	ТаблицаДокумента.ТрудоваяФункция КАК ТрудоваяФункция,
		|	ТаблицаДокумента.Основание КАК НаименованиеДокументаОснования,
		|	ТаблицаДокумента.ДатаДокумента КАК ДатаДокументаОснования,
		|	ТаблицаДокумента.СерияДокумента КАК СерияДокументаОснования,
		|	ТаблицаДокумента.НомерДокумента КАК НомерДокументаОснования,
		|	ТаблицаДокумента.ОписаниеДолжностиДляЗаписиОТрудовойДеятельности КАК ОписаниеДолжности,
		|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
		|	ТаблицаДокумента.Должность КАК Должность,
		|	ТаблицаДокумента.Категория КАК РазрядКатегория
		|ИЗ
		|	Документ.РезультатыАттестацииСотрудников.РезультатыАттестации КАК ТаблицаДокумента
		|ГДЕ
		|	ТаблицаДокумента.Ссылка В(&Ссылка)
		|	И ТаблицаДокумента.ОтразитьВТрудовойКнижке
		|	И ЕСТЬNULL(ТаблицаДокумента.Ссылка.ВидАттестации.ТипАттестации, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДвиженияДокумента = Новый Массив;
		ДанныеДляПроведения.Вставить(Выборка.Ссылка, ДвиженияДокумента);
		
		Пока Выборка.Следующий() Цикл
			ДвиженияДокумента.Добавить(ЭлектронныеТрудовыеКнижки.ЗаписьДвиженияМероприятияТрудовойДеятельности(Выборка, Ложь));
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

Функция ОписаниеДолжностиДляЗаписиОТрудовойДеятельности(РазрядКатегория, Специальность) Экспорт
	
	ТекстОписания = НСтр("ru = 'Присвоен %1 по специальности ""%2""'");
	Возврат СтрШаблон(ТекстОписания, РазрядКатегория, Специальность);
	
КонецФункции

#КонецОбласти

#КонецЕсли
