#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак наличия в конфигурации общих реквизитов-разделителей.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенная конфигурация.
//
Функция ЭтоРазделеннаяКонфигурация() Экспорт
	
	ЕстьРазделители = Ложь;
	Для каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Если ОбщийРеквизит.РазделениеДанных = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять Тогда
			ЕстьРазделители = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьРазделители;
	
КонецФункции

// Возвращает признак того, что объект метаданных используется в общих реквизитах-разделителях.
//
// Параметры:
//   ПолноеИмяОбъектаМетаданных - Строка - имя объекта метаданных.
//   Разделитель - Строка - имя общего реквизита-разделителя, на разделение которыми проверяется объект метаданных.
//
// Возвращаемое значение:
//   Булево - Истина, если это разделенный объект.
//
Функция ЭтоРазделенныйОбъектМетаданных(Знач ПолноеИмяОбъектаМетаданных, Знач Разделитель = Неопределено) Экспорт
	
	Если Разделитель = Неопределено Тогда
		РазделениеПоОсновномуРеквизиту = РаботаВМоделиСервисаСлужебный.РазделенныеОбъектыМетаданных(РаботаВМоделиСервиса.РазделительОсновныхДанных());
		РазделениеПоВспомогательномуРеквизиту = РаботаВМоделиСервисаСлужебный.РазделенныеОбъектыМетаданных(РаботаВМоделиСервиса.РазделительВспомогательныхДанных());
		Результат = РазделениеПоОсновномуРеквизиту.Получить(ПолноеИмяОбъектаМетаданных) <> Неопределено
			Или РазделениеПоВспомогательномуРеквизиту.Получить(ПолноеИмяОбъектаМетаданных) <> Неопределено;
		Возврат Результат;
	Иначе
		РазделенныеОбъектыМетаданных = РаботаВМоделиСервисаСлужебный.РазделенныеОбъектыМетаданных(Разделитель);
		Возврат РазделенныеОбъектыМетаданных.Получить(ПолноеИмяОбъектаМетаданных) <> Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает признак работы в режиме разделения данных по областям
// (технически это признак условного разделения).
// 
// Возвращает Ложь, если конфигурация не может работать в режиме разделения данных
// (не содержит общих реквизитов, предназначенных для разделения данных).
//
// Возвращаемое значение:
//  Булево - Истина, если разделение включено.
//  Булево - Ложь,   если разделение выключено или не поддерживается.
//
Функция РазделениеВключено() Экспорт
	
	Если Не ЭтоРазделеннаяКонфигурация() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМоделиСервиса") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Возвращает конечную точку для отправки сообщений в менеджер сервиса.
//
// Возвращаемое значение:
//  ПланОбменаСсылка.ОбменСообщениями - узел соответствующий менеджеру сервиса.
//
Функция КонечнаяТочкаМенеджераСервиса() Экспорт
	
	Возврат РаботаВМоделиСервисаБТС.КонечнаяТочкаМенеджераСервиса();
	
КонецФункции

// Возвращает соответствие видов контактной информации пользователя видам.
// КИ используемой в XDTO модели сервиса.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - соответствие видов КИ:
//  * Ключ - СправочникСсылка.ВидыКонтактнойИнформации
//  * Значение - Строка
//
Функция СоответствиеВидовКИПользователяXDTO() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Справочники.ВидыКонтактнойИнформации.EmailПользователя, "UserEMail");
	Соответствие.Вставить(Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, "UserPhone");
	
	Возврат Новый ФиксированноеСоответствие(Соответствие);
	
КонецФункции

// Возвращает соответствие видов контактной информации XDTO видам.
// КИ пользователя.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - соответствие видов КИ:
//  * Ключ - Строка
//  * Значение - СправочникСсылка.ВидыКонтактнойИнформации
//
Функция СоответствиеВидовКИXDTOВидамКИПользователя() Экспорт
	
	Соответствие = Новый Соответствие;
	Для каждого КлючИЗначение Из СоответствиеВидовКИПользователяXDTO() Цикл
		Соответствие.Вставить(КлючИЗначение.Значение, КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Соответствие);
	
КонецФункции

// Возвращает соответствие прав XDTO используемым в модели сервиса возможным
// действиям с пользователем сервиса.
// 
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - соответствие прав действиям:
//  * Ключ - Строка
//  * Значение - Строка
//
Функция СоответствиеПравXDTOДействиямСПользователемСервиса() Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ChangePassword", "ИзменениеПароля");
	Соответствие.Вставить("ChangeName", "ИзменениеИмени");
	Соответствие.Вставить("ChangeFullName", "ИзменениеПолногоИмени");
	Соответствие.Вставить("ChangeAccess", "ИзменениеДоступа");
	Соответствие.Вставить("ChangeAdmininstrativeAccess", "ИзменениеАдминистративногоДоступа");
	
	Возврат Новый ФиксированноеСоответствие(Соответствие);
	
КонецФункции

// Возвращает описание модели данных, относящихся к области данных.
//
// Возвращаемое значение:
//  ФиксированноеСоответствие из КлючИЗначение - модель данных области:
//    * Ключ - ОбъектМетаданных - объект метаданных.
//    * Значение - Строка - имя общего реквизита-разделителя.
//
Функция ПолучитьМодельДанныхОбласти() Экспорт
	
	Результат = Новый Соответствие();
	
	РазделительОсновныхДанных = РаботаВМоделиСервиса.РазделительОсновныхДанных();
	ОсновныеДанныеОбласти = РазделенныеОбъектыМетаданных(
		РазделительОсновныхДанных);
	Для Каждого ЭлементОсновныхДанныхОбласти Из ОсновныеДанныеОбласти Цикл
		Результат.Вставить(ЭлементОсновныхДанныхОбласти.Ключ, ЭлементОсновныхДанныхОбласти.Значение);
	КонецЦикла;
	
	РазделительВспомогательныхДанных = РаботаВМоделиСервиса.РазделительВспомогательныхДанных();
	ВспомогательныеДанныеОбласти = РаботаВМоделиСервисаСлужебный.РазделенныеОбъектыМетаданных(
		РазделительВспомогательныхДанных);
	Для Каждого ЭлементВспомогательныхДанныхОбласти Из ВспомогательныеДанныеОбласти Цикл
		Результат.Вставить(ЭлементВспомогательныхДанныхОбласти.Ключ, ЭлементВспомогательныхДанныхОбласти.Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает массив существующих в конфигурации разделителей.
//
// Возвращаемое значение:
//   ФиксированныйМассив из Строка - массив имен общих реквизитов, которые
//     являются разделителями.
//
Функция РазделителиКонфигурации() Экспорт
	
	МассивРазделителей = Новый Массив;
	
	Для Каждого ОбщийРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		Если ОбщийРеквизит.РазделениеДанных = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять Тогда
			МассивРазделителей.Добавить(ОбщийРеквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(МассивРазделителей);
	
КонецФункции

// Возвращает состав общего реквизита с заданным именем.
//
// Параметры:
//   Имя - Строка - Имя общего реквизита.
//
// Возвращаемое значение:
//   Массив из Структура - список объектов метаданных, в которые входит общий реквизит.
Функция СоставОбщегоРеквизита(Знач Имя) Экспорт
	
	Авто = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто;
	НеИспользовать = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать;
	РазделениеВключено = РаботаВМоделиСервиса.РазделениеВключено();
	
	СоставОбщегоРеквизитаРасширений = Новый Соответствие();
	Результат = Новый Массив();
	
	Для Каждого ЭлементСостава Из Метаданные.ОбщиеРеквизиты[Имя].Состав Цикл
		
		РасширениеКонфигурации = Неопределено;
		
		// Получение информации из данных расширения необходимо только для не разделенной базы
		Если Не РазделениеВключено Тогда
			РасширениеКонфигурации = ЭлементСостава.Метаданные.РасширениеКонфигурации();
		КонецЕсли;
		
		Если РасширениеКонфигурации = Неопределено Тогда
			
			ЭлементРезультата = НовыйЭлементСостава(
				ЭлементСостава.Метаданные, ЭлементСостава.Использование, ЭлементСостава.УсловноеРазделение);
			
			Результат.Добавить(ЭлементРезультата);
			
		Иначе
			
			СоставОбщегоРеквизитаРасширения = СоставОбщегоРеквизитаРасширений.Получить(
				РасширениеКонфигурации.УникальныйИдентификатор);
			
			Если СоставОбщегоРеквизитаРасширения = Неопределено Тогда
			
				МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(РасширениеКонфигурации.ПолучитьДанные());
				МетаданныеОбщегоРеквизита = МетаданныеРасширения.ОбщиеРеквизиты.Найти(Имя);
			
				Если МетаданныеОбщегоРеквизита = Неопределено Тогда
				
					СоставОбщегоРеквизитаРасширения = Новый Массив();
					СоставОбщегоРеквизитаРасширений.Вставить(
						РасширениеКонфигурации.УникальныйИдентификатор, СоставОбщегоРеквизитаРасширения);
				
				Иначе
				
					СоставОбщегоРеквизитаРасширения = МетаданныеОбщегоРеквизита.Состав;
					СоставОбщегоРеквизитаРасширений.Вставить(
						РасширениеКонфигурации.УникальныйИдентификатор, СоставОбщегоРеквизитаРасширения);
				
				КонецЕсли;

			КонецЕсли;
			
			НайденныйЭлементСостава = СоставОбщегоРеквизитаРасширения.Найти(ЭлементСостава.Метаданные);
			
			Если НайденныйЭлементСостава = Неопределено Тогда
				
				ЭлементРезультата = НовыйЭлементСостава(
					ЭлементСостава.Метаданные, Авто, ЭлементСостава.УсловноеРазделение);
				
				Результат.Добавить(ЭлементРезультата);
				
			ИначеЕсли НайденныйЭлементСостава.Использование = Авто Тогда
				
				ЭлементРезультата = НовыйЭлементСостава(
					НайденныйЭлементСостава.Метаданные, НеИспользовать, НайденныйЭлементСостава.УсловноеРазделение);
				
				Результат.Добавить(ЭлементРезультата);
				
			Иначе
				
				ЭлементРезультата = НовыйЭлементСостава(
					НайденныйЭлементСостава.Метаданные,
					НайденныйЭлементСостава.Использование,
					НайденныйЭлементСостава.УсловноеРазделение);
				
				Результат.Добавить(ЭлементРезультата);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Возвращает список полных имен всех объектов метаданных, использующихся в общем реквизите-разделителе,
//  имя которого передано в качестве значения параметра Разделитель, и значения свойств объекта метаданных,
//  которые могут потребоваться для дальнейшей его обработки в универсальных алгоритмах.
// Для последовательностей и журналов документов определяет разделенность по входящим документам: любому из.
//
// Параметры:
//  Разделитель - Строка - имя общего реквизита.
//
// Возвращаемое значение:
// ФиксированноеСоответствие из КлючИЗначение:
//  * Ключ - Строка - полное имя объекта метаданных,
//  * Значение - ФиксированнаяСтруктура - с полями:
//    ** Имя - Строка - имя объекта метаданных,
//    ** Разделитель - Строка - имя разделителя, которым разделен объект метаданных,
//    ** УсловноеРазделение - Строка - полное имя объекта метаданных, выступающего в качестве условия использования
//      разделения объекта метаданных данным разделителем.
//
Функция РазделенныеОбъектыМетаданных(Знач Разделитель) Экспорт
	
	Результат = Новый Соответствие;
	
	// I. Перебрать состав всех общих реквизитов.
	
	МетаданныеОбщегоРеквизита = Метаданные.ОбщиеРеквизиты.Найти(Разделитель);
	Если МетаданныеОбщегоРеквизита = Неопределено Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Общий реквизит %1 не обнаружен в конфигурации.'"), Разделитель);
	КонецЕсли;
	
	Если МетаданныеОбщегоРеквизита.РазделениеДанных = Метаданные.СвойстваОбъектов.РазделениеДанныхОбщегоРеквизита.Разделять Тогда
		
		СоставОбщегоРеквизита = СоставОбщегоРеквизита(МетаданныеОбщегоРеквизита.Имя);
		
		НеИспользоватьОбщийРеквизит = (МетаданныеОбщегоРеквизита.АвтоИспользование = Метаданные.СвойстваОбъектов.АвтоИспользованиеОбщегоРеквизита.НеИспользовать);
		Авто = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Авто;
		НеИспользовать = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.НеИспользовать;
		
		Для Каждого ЭлементСостава Из СоставОбщегоРеквизита Цикл
			
			Если НеИспользоватьОбщийРеквизит И ЭлементСостава.Использование = Авто ИЛИ ЭлементСостава.Использование = НеИспользовать Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ДополнительныеДанные = НовыйДополнительныеДанные(ЭлементСостава.Метаданные.Имя, Разделитель, Неопределено);
			Если ЭлементСостава.УсловноеРазделение <> Неопределено Тогда
				ДополнительныеДанные.УсловноеРазделение = ЭлементСостава.УсловноеРазделение.ПолноеИмя();
			КонецЕсли;
			
			Результат.Вставить(ЭлементСостава.Метаданные.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
			
			// По регистрам расчета дополнительно определяется разделенность подчиненных им перерасчетов.
			Если ОбщегоНазначения.ЭтоРегистрРасчета(ЭлементСостава.Метаданные) Тогда
				
				Перерасчеты = ЭлементСостава.Метаданные.Перерасчеты;
				Для Каждого Перерасчет Из Перерасчеты Цикл
					
					ДополнительныеДанные.Имя = Перерасчет.Имя;
					Результат.Вставить(Перерасчет.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
					
				КонецЦикла;
				
			КонецЕсли;
				
		КонецЦикла;
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Для общего реквизита %1 не используется разделение данных.'"), Разделитель);
		
	КонецЕсли;
	
	// II. Для последовательностей и журналов определять разделенность по входящим документам.
	
	// 1) Последовательности. Перебор с проверкой первого входящего документа. Если документов нет, считаем разделенной.
	Для Каждого МетаданныеПоследовательности Из Метаданные.Последовательности Цикл
		
		ДополнительныеДанные = НовыйДополнительныеДанные(МетаданныеПоследовательности.Имя, Разделитель, Неопределено);
		
		Если МетаданныеПоследовательности.Документы.Количество() = 0 Тогда
			
			ШаблонСообщения = НСтр("ru = 'В последовательность %1 не включено ни одного документа.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, МетаданныеПоследовательности.Имя);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Получение разделенных объектов метаданных'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, 
				МетаданныеПоследовательности, , ТекстСообщения);
			
			Результат.Вставить(МетаданныеПоследовательности.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
			
		Иначе
			
			Для Каждого МетаданныеДокумента Из МетаданныеПоследовательности.Документы Цикл
				
				ДополнительныеДанныеОтДокумента = Результат.Получить(МетаданныеДокумента.ПолноеИмя());
				
				Если ДополнительныеДанныеОтДокумента <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ДополнительныеДанные, ДополнительныеДанныеОтДокумента, "Разделитель,УсловноеРазделение");
					Результат.Вставить(МетаданныеПоследовательности.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// 2) Журналы. Перебор с проверкой первого входящего документа. Если документов нет, считаем разделенным.
	Для Каждого МетаданныеЖурналаДокументов Из Метаданные.ЖурналыДокументов Цикл
		
		ДополнительныеДанные = НовыйДополнительныеДанные(МетаданныеЖурналаДокументов.Имя, Разделитель, Неопределено);
		
		Если МетаданныеЖурналаДокументов.РегистрируемыеДокументы.Количество() = 0 Тогда
			
			ШаблонСообщения = НСтр("ru = 'В журнал %1 не включено ни одного документа.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, МетаданныеЖурналаДокументов.Имя);
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Получение разделенных объектов метаданных'", 
				ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, 
				МетаданныеЖурналаДокументов, , ТекстСообщения);
			
			Результат.Вставить(МетаданныеЖурналаДокументов.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
			
		Иначе
			
			Для Каждого МетаданныеДокумента Из МетаданныеЖурналаДокументов.РегистрируемыеДокументы Цикл
				
				ДополнительныеДанныеОтДокумента = Результат.Получить(МетаданныеДокумента.ПолноеИмя());
				
				Если ДополнительныеДанныеОтДокумента <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ДополнительныеДанные, ДополнительныеДанныеОтДокумента, "Разделитель,УсловноеРазделение");
					Результат.Вставить(МетаданныеЖурналаДокументов.ПолноеИмя(), Новый ФиксированнаяСтруктура(ДополнительныеДанные));
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(Результат);
	
КонецФункции

// Возвращает признак наличия настройки конечной точки менеджера сервиса
//
// Возвращаемое значение:
//  Булево - Истина, если конечная точка менеджера сервиса установлена и в настройках транспорта заполнено имя пользователя.
//
Функция КонечнаяТочкаМенеджераСервисаНастроена() Экспорт
	
	Возврат РаботаВМоделиСервиса.КонечнаяТочкаМенеджераСервисаНастроена()
	
КонецФункции

// Возвращает код абонента текущей области данных.
//
// Возвращаемое значение:
//   Число - код абонента
Функция КодАбонента() Экспорт
	
	Возврат 0;
	
КонецФункции

// Возвращает HTTP-соединение с Менеджером сервиса.
// Вызывающий код должен самостоятельно устанавливать привилегированный режим.
// 
// Параметры: 
//  ДанныеСервера - см. ОбщегоНазначенияКлиентСервер.СтруктураURI
//  Таймаут - Число - см. РаботаВМоделиСервисаБТС.СоединениеСМенеджеромСервиса.Таймаут
// 
// Возвращаемое значение: 
//  HTTPСоединение - соединение с менеджером сервиса
// (См. РаботаВМоделиСервисаБТС.СоединениеСМенеджеромСервиса)
Функция СоединениеСМенеджеромСервиса(ДанныеСервера, Таймаут = 60) Экспорт
	
	Возврат РаботаВМоделиСервисаБТС.СоединениеСМенеджеромСервиса(ДанныеСервера, Таймаут);
	
КонецФункции

Функция АдресПровайдераАутентификации() Экспорт
	
	Возврат РаботаВМоделиСервисаБТС.АдресПровайдераАутентификации()
	
КонецФункции

Функция АутентификацияТокеномДоступаВнутреннихВызововПрограммногоИнтерфейса() Экспорт
	
	Возврат РаботаВМоделиСервисаБТС.АутентификацияТокеномДоступаВнутреннихВызововПрограммногоИнтерфейса();
	
КонецФункции

// Параметры:
//  ИмяРасширения - Строка
// 
// Возвращаемое значение:
//  ОбъектМетаданныхКонфигурация
Функция МетаданныеПодключенногоРасширения(ИмяРасширения) Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	НайденныеРасширения = РасширенияКонфигурации.Получить(Новый Структура("Имя", ИмяРасширения));
	Если НайденныеРасширения.Количество() = 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Расширение ""%1"" не найдено.'"), ИмяРасширения);
	КонецЕсли;
	
	МетаданныеРасширения = Новый ОбъектМетаданныхКонфигурация(НайденныеРасширения[0].ПолучитьДанные());
	
	Возврат МетаданныеРасширения;
	
КонецФункции

// Параметры:
//  ИмяРасширения - Строка
// 
// Возвращаемое значение:
//  Булево
Функция РасширениеПоддерживаетИсториюДанных(ИмяРасширения) Экспорт
	
	МетаданныеРасширения = РаботаВМоделиСервисаСлужебныйПовтИсп.МетаданныеПодключенногоРасширения(ИмяРасширения);
	РежимСовместимости = МетаданныеРасширения.РежимСовместимостиРасширенияКонфигурации;
	
	Если РежимСовместимости = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	НеПоддерживающиеРежимыСовместимости = Новый Массив();
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_1);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_16);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_1);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_2);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_3);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_4);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_5);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_6);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_7);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_8);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_9);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_10);
	НеПоддерживающиеРежимыСовместимости.Добавить(Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_11);
	
	Возврат НеПоддерживающиеРежимыСовместимости.Найти(РежимСовместимости) = Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый дополнительные данные.
// 
// Параметры:
//  Имя - Строка - Имя
//  Разделитель - Строка - Разделитель
//  УсловноеРазделение - ОбъектМетаданныхКонстанта, Булево, Неопределено - Условное разделение
// 
// Возвращаемое значение:
//  Структура - Новый дополнительные данные:
// * Имя - Строка - Имя 
// * Разделитель - Строка - Разделитель 
// * УсловноеРазделение - ОбъектМетаданныхКонстанта, Булево, Неопределено - УсловноеРазделение 
Функция НовыйДополнительныеДанные(Имя, Разделитель, УсловноеРазделение = Неопределено)
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("Имя", Имя);
	ДополнительныеДанные.Вставить("Разделитель", Разделитель);
	ДополнительныеДанные.Вставить("УсловноеРазделение", УсловноеРазделение);
	
	Возврат ДополнительныеДанные;
	
КонецФункции

// Новый элемент состава.
// 
// Параметры:
//  Метаданные - ОбъектМетаданных - Метаданные
//  Использование - ИспользованиеОбщегоРеквизита - Использование
//  УсловноеРазделение - ОбъектМетаданныхКонстанта, Булево - Условное разделение
// 
// Возвращаемое значение:
//  Структура - Новый элемент состава:
// * Метаданные - ОбъектМетаданных - Метаданные 
// * Использование - ИспользованиеОбщегоРеквизита - Использование 
// * УсловноеРазделение - ОбъектМетаданныхКонстанта, Булево - УсловноеРазделение 
Функция НовыйЭлементСостава(Метаданные, Использование, УсловноеРазделение)
	
	НовыйЭлементСостава = Новый Структура;
	НовыйЭлементСостава.Вставить("Метаданные", Метаданные);
	НовыйЭлементСостава.Вставить("Использование", Использование);
	НовыйЭлементСостава.Вставить("УсловноеРазделение", УсловноеРазделение);
	
	Возврат НовыйЭлементСостава;

КонецФункции

#КонецОбласти
