#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ПараметрыЗаполнения = Неопределено;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЭтоДействие = ДанныеЗаполнения.Свойство("Действие");
		Если ЭтоДействие И ДанныеЗаполнения.Действие = "Исправить" Тогда
			ИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(ЭтотОбъект, ДанныеЗаполнения.Ссылка,
				"ДокументРассчитан", 
				"Начисления,
				|НачисленияПерерасчет,
				|НачисленияПерерасчетНулевыеСторно,
				|НДФЛ,
				|ПримененныеВычетыНаДетейИИмущественные,
				|РаспределениеРезультатовНачислений,
				|РаспределениеРезультатовУдержаний,
				|Удержания",
				ДанныеЗаполнения);
			ИсправленныйДокумент = ДанныеЗаполнения.Ссылка;
		ИначеЕсли ЭтоДействие И ДанныеЗаполнения.Действие = "ЗаполнитьПоПараметрамЗаполнения" Тогда
			ЗаполнитьПоПараметрамЗаполнения(ДанныеЗаполнения);
		ИначеЕсли ЭтоДействие И ДанныеЗаполнения.Действие = "ЗаполнитьПоДаннымЗаявкиКабинетСотрудника" Тогда
			ЗаполнитьПоДаннымЗаявкиКабинетСотрудника(ДанныеЗаполнения);
		ИначеЕсли ЭтоДействие И ДанныеЗаполнения.Действие = "ЗаполнитьПослеПереноса" Тогда
			ЗаполнитьПослеПереноса(ДанныеЗаполнения);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
			
			ИмяРеквизита = "Дата";
			Если ДанныеЗаполнения.Свойство("ДниУхода") Тогда
				ТипДанных = ТипЗнч(ДанныеЗаполнения.ДниУхода);
				Если ТипДанных = Тип("Массив") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ДниУхода, ДанныеЗаполнения.ДниУхода, ИмяРеквизита);
				ИначеЕсли ТипДанных = Тип("ТаблицаЗначений") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеЗаполнения.ДниУхода, ДниУхода);
				ИначеЕсли ТипДанных = Тип("СтандартныйПериод") Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ДниУхода,
						ОбщегоНазначенияБЗК.МассивДатИзПериода(
							ДанныеЗаполнения.ДниУхода.ДатаНачала, ДанныеЗаполнения.ДниУхода.ДатаОкончания),
						ИмяРеквизита);
				ИначеЕсли ТипДанных = Тип(ИмяРеквизита) Тогда
					НоваяСтрока = ДниУхода.Добавить();
					НоваяСтрока.Дата = ДанныеЗаполнения.ДниУхода;
				КонецЕсли;
			КонецЕсли;
			
			КоличествоДнейУхода = ДниУхода.Количество();
			Если КоличествоДнейУхода > 0 Тогда
				ДниУхода.Сортировать(ИмяРеквизита);
				ДатаНачала = ДниУхода[0].Дата;
				ДатаОкончания = ДниУхода[КоличествоДнейУхода - 1].Дата;
			Иначе
				Если ДатаНачала <> '00010101' И ДатаОкончания <> '00010101' Тогда
					ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(ДниУхода,
						ОбщегоНазначенияБЗК.МассивДатИзПериода(ДатаНачала, ДатаОкончания),
						ИмяРеквизита);
					ДниУхода.Сортировать(ИмяРеквизита);
				КонецЕсли;
			КонецЕсли;
			ДатаНачалаСобытия = ДатаНачала;
			
			Если ДанныеЗаполнения.Свойство("Результат") Тогда
				ПараметрыЗаполнения = ДанныеЗаполнения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Сотрудник.Пустая() Тогда
		Если Организация.Пустая() Тогда
			ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, Сотрудник);
		КонецЕсли;
		
		Если ФизическоеЛицо.Пустая() Тогда
			ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
		КонецЕсли;
	КонецЕсли;
	
	Если Ответственный.Пустая() Тогда
		ЗаполняемыеЗначения = Новый Структура("Ответственный");
		Если ПериодРегистрации = '00010101' Тогда
			ЗаполняемыеЗначения.Вставить("ПериодРегистрации", Неопределено);
		КонецЕсли;
		ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ТекущаяДатаСеанса());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполняемыеЗначения);
	КонецЕсли;
	
	ЗарплатаКадрыРасширенный.УстановитьВариантРасчетаДокументаПоСреднемуЗаработку(ЭтотОбъект);
	
	Менеджер = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами;
	Если ВидРасчета.Пустая() Тогда
		ДопПараметры = Менеджер.ДополнительныеПараметрыВыбораНачислений(ЭтотОбъект, "ВидРасчета");
		ПланыВидовРасчета.Начисления.УстановитьНачислениеПоУмолчаниюВОбъекте(ЭтотОбъект, "ВидРасчета", ДопПараметры);
	КонецЕсли;
	
	ДатаСобытия = ?(ДатаНачалаСобытия = '00010101', ТекущаяДатаСеанса(), ДатаНачалаСобытия);
	Если Ребенок.Пустая() И Не ФизическоеЛицо.Пустая() Тогда
		Ребенок = Менеджер.ПолучитьРебенка(ФизическоеЛицо, ДатаСобытия);
	КонецЕсли;
	
	Если ПараметрыЗаполнения <> Неопределено Тогда
		ЕстьОшибки = Ложь;
		СводнаяИнформация = Менеджер.СводнаяИнформацияПоДнямУхода(ЭтотОбъект, ЕстьОшибки);
		ИспользоватьОстатокДнейЗаГод = СводнаяИнформация.ИспользоватьОстатокДнейЗаГод;
		ДанныеЗаполнения.Результат.Успех = Не ЕстьОшибки;
		
		Если ПериодРасчетаСреднегоЗаработкаНачало = '00010101' Или ПериодРасчетаСреднегоЗаработкаОкончание = '00010101' Тогда
			ПараметрыРасчета = Менеджер.ПараметрыРасчета(ЭтотОбъект);
			Менеджер.ЗаполнитьПериодРасчетаСреднегоЗаработка(ЭтотОбъект, ПараметрыРасчета);
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ЗаполнитьПланируемуюДатуВыплаты Тогда
			УстановитьПланируемуюДатуВыплаты();
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ЗаполнитьУчитыватьМРОТПриОплатеПоСреднемуЗаработку Тогда
			УстановитьЗначениеПоУмолчаниюСвойстваУчитыватьМРОТ();
		КонецЕсли;
		
		Если ПараметрыЗаполнения.ЗаполнитьОтветственныхЛиц Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,
				ПодписиДокументов.ОтветственныеЛицаДляЗаполнения(ЭтотОбъект, ДатаСобытия));
		КонецЕсли;
		
		Если ЕстьОшибки И Не ПараметрыЗаполнения.ВыводитьСообщения Тогда
			ДанныеЗаполнения.Результат.ОшибкиЗаполнения = ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПровестиПоУчетам(Ссылка, РежимПроведения, Отказ, Неопределено, Движения, ЭтотОбъект, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОтключитьПроверкиПроведения Тогда
		Возврат;
	КонецЕсли;
	
	КонтейнерОшибок = Неопределено;
	
	ПроверитьЗаполнениеРеквизитовШапки(КонтейнерОшибок);

	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасчетЗарплатыРасширенная") Тогда
		
		Если ДокументРассчитан Тогда
			
			ЗарплатаКадры.ПроверитьДатуВыплаты(ЭтотОбъект, Отказ);
			
			ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(КонтейнерОшибок);
			
			ИсправлениеДокументовЗарплатаКадры.ПроверитьЗаполнение(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
			ПроверитьПериодДействияНачислений(Отказ);
			
			// Проверка корректности распределения по источникам финансирования
			ИменаТаблицРаспределяемыхПоСтатьямФинансирования = "Начисления,НачисленияПерерасчет,Удержания,НДФЛ,КорректировкиВыплаты";
			
			ОтражениеЗарплатыВБухучетеРасширенный.ПроверитьРезультатыРаспределенияНачисленийУдержанийОбъекта(
				ЭтотОбъект, ИменаТаблицРаспределяемыхПоСтатьямФинансирования, Отказ);
			
			// Проверка корректности распределения по территориям и условиям труда
			ИменаТаблицРаспределенияПоТерриториямУсловиямТруда = "Начисления,НачисленияПерерасчет";
			
			РасчетЗарплатыРасширенный.ПроверитьРаспределениеПоТерриториямУсловиямТрудаДокумента(
				ЭтотОбъект, ИменаТаблицРаспределенияПоТерриториямУсловиямТруда, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
	
	Если Не ДополнительныеСвойства.Свойство("ПроверкаПересеченияПериодовВыполнена") Тогда
		РезультатПроверки = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПроверитьПересечениеПериодовОтсутствия(ЭтотОбъект);
		ДанныеСотрудника = РезультатПроверки.ДанныеСотрудников.Получить(Сотрудник);
		Если ДанныеСотрудника <> Неопределено И РезультатПроверки.Отказ Тогда
			ТекстСообщения = НСтр("ru = 'На период %1 сотруднику уже зарегистрирован уход за детьми-инвалидами документом %2.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДанныеСотрудника.ПредставлениеПериода, ДанныеСотрудника.Регистратор);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДанныеСотрудника.Регистратор, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	УдалитьПроверенныеРеквизиты(ПроверяемыеРеквизиты);
	
	ЭДОБЗК.ПроверитьВозможностьСохраненияИзмененийДокументаСПечатнымиФормами(
		ЭтотОбъект, Метаданные.Роли.ДобавлениеИзменениеНачисленнойЗарплатыРасширенная, Отказ);
	
	КоличествоДней = ДниУхода.Количество();
	Если КоличествоДней > 1 И Год(ДниУхода[0].Дата) <> Год(ДниУхода[КоличествоДней-1].Дата) Тогда
		Текст = НСтр("ru = 'Выбраны дни в разных годах'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ДниУхода");
	КонецЕсли;
	Если КоличествоДней > 0 И ЗначениеЗаполнено(Сотрудник) Тогда
		ДанныеПоДням = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.СводнаяИнформацияПоДнямУхода(ЭтотОбъект, Отказ);
		Если ИспользоватьОстатокДнейЗаГод Тогда
			ПроверитьОтсутствиеДругихДокументовСФлажкомЗаЭтотГод(Отказ);
			Если Не ДанныеПоДням.ИспользоватьОстатокДнейЗаГод И ДанныеПоДням.КоличествоКалендарныхДней <= 4 Тогда
				Текст = СтрШаблон(
					НСтр("ru = 'Избыточно включен флажок ""%1""'"),
					Метаданные().Реквизиты.ИспользоватьОстатокДнейЗаГод.Представление());
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ИспользоватьОстатокДнейЗаГод");
			КонецЕсли;
		Иначе
			Если Не ПустаяСтрока(ДанныеПоДням.ТекстПересечнияОстатка) Тогда
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(
					Отказ, ЭтотОбъект, ДанныеПоДням.ТекстПересечнияОстатка, "ИспользоватьОстатокДнейЗаГод");
			ИначеЕсли ДанныеПоДням.ИспользоватьОстатокДнейЗаГод Или КоличествоДней > 4 Тогда
				Текст = СтрШаблон(
					НСтр("ru = 'В текущем периоде по физическому лицу использовано более 4 дней отпуска необходимо включить флажок ""%1""'"),
					Метаданные().Реквизиты.ИспользоватьОстатокДнейЗаГод.Представление());
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ИспользоватьОстатокДнейЗаГод");
			КонецЕсли;
			МесяцыУхода = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.МесяцыУхода(ДниУхода);
			ПроверитьОграничениеДнейПоСотрудникуЗаМесяцы(Отказ, МесяцыУхода);
		КонецЕсли;
		Для Каждого СообщениеОбОшибке Из ДанныеПоДням.СообщенияОбОшибках Цикл
			СообщениеОбОшибке.Сообщить();
		КонецЦикла;
	КонецЕсли;
	
	Если Дата >= Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ДатаФорм2024() Тогда
		ПроверяемыеРеквизиты.Добавить("Ребенок");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПерерасчетЗарплаты.УдалитьПерерасчетыПоРегистратору(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСотрудникаВТаблицахНачислений();
	
	МесяцыУхода = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.МесяцыУхода(ДниУхода);
	ПредставлениеПериода = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПредставлениеПериодовУхода(МесяцыУхода);
	
	РасчетЗарплатыРасширенный.ЗаполнитьИсходныйДокумент(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УчетСреднегоЗаработка.ЗаписатьДатуНачалаСобытия(Ссылка, Сотрудник, ДатаНачалаСобытия);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	РасчетЗарплатыРасширенный.ЗаполнитьИсходныйДокументПриКопировании(ЭтотОбъект, ОбъектКопирования.Ссылка);
	Дата = ТекущаяДатаСеанса();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаЗаполненияДокумента

Функция ДокументГотовКРасчету(ВыводитьСообщения = Истина, ОшибкиЗаполнения = Неопределено) Экспорт
	КонтейнерОшибок = Неопределено;
	КонтейнерСодержитОшибки = Ложь;
	
	ПроверитьЗаполнениеРеквизитовШапки(КонтейнерОшибок);
	ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(КонтейнерОшибок, Истина);
	Если ВыводитьСообщения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, КонтейнерСодержитОшибки);
	Иначе
		Если КонтейнерОшибок <> Неопределено Тогда
			Если ОшибкиЗаполнения = Неопределено Тогда
				ОшибкиЗаполнения = КонтейнерОшибок;
			Иначе
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОшибкиЗаполнения, КонтейнерОшибок);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Не КонтейнерСодержитОшибки;
КонецФункции

Процедура ПроверитьЗаполнениеРеквизитовШапки(КонтейнерОшибок)
	
	Если Не ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ТекстСообщения = НСтр("ru = 'Не указан период регистрации.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПериодРегистрации", ТекстСообщения, "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Организация"" обязательно к заполнению.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Организация", ТекстСообщения, "");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Сотрудник"" обязательно к заполнению.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.Сотрудник", ТекстСообщения, "");
	КонецЕсли;
	
	Если ДниУхода.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Не указаны дни ухода за детьми-инвалидами.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ДниУхода", ТекстСообщения, "");
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьЗаполнениеРеквизитовНеобходимыхДляРасчета(КонтейнерОшибок, ПроверкаПередРасчетом = Ложь)
	
	Если Не ДокументРассчитан И Не ПроверкаПередРасчетом Тогда
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ВидРасчета) 
		И Не ПолучитьФункциональнуюОпцию("ВыбиратьВидНачисленияОплатыДнейУходаЗаДетьмиИнвалидами") Тогда
		ТекстСообщения = Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ТекстСообщенияНеЗаполненВидРасчета();
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ВидРасчета", ТекстСообщения, "");
	КонецЕсли;
	
	ПроверитьЗаполнениеПланируемойДатыВыплаты(КонтейнерОшибок, ПроверкаПередРасчетом);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПланируемойДатыВыплаты(КонтейнерОшибок, ПроверкаПередРасчетом)
	
	МассивНачисленийДокумента = Новый Массив;
	
	Если НЕ ПроверкаПередРасчетом Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНачисленийДокумента, Начисления.ВыгрузитьКолонку("Начисление"), Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивНачисленийДокумента, НачисленияПерерасчет.ВыгрузитьКолонку("Начисление"), Истина);
	КонецЕсли;
	
	Если УчетНДФЛРасширенный.ДатаВыплатыОбязательнаКЗаполнению(ПорядокВыплаты, МассивНачисленийДокумента, ПериодРегистрации)
		И Не ЗначениеЗаполнено(ПланируемаяДатаВыплаты) Тогда
		ТекстСообщения = НСтр("ru = 'Дата выплаты обязательна к заполнению при выплате в межрасчет.'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПланируемаяДатаВыплаты", ТекстСообщения, "");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПериодДействияНачислений(Отказ)
	ПараметрыПроверкиПериодаДействия = РасчетЗарплатыРасширенный.ПараметрыПроверкиПериодаДействия();
	ПараметрыПроверкиПериодаДействия.Ссылка = Ссылка;
	ПроверяемыеКоллекции = Новый Массив;
	ПроверяемыеКоллекции.Добавить(РасчетЗарплатыРасширенный.ОписаниеКоллекцииДляПроверкиПериодаДействия("НачисленияПерерасчет", НСтр("ru = 'Перерасчет прошлого периода'")));
	ПроверяемыеКоллекции.Добавить(РасчетЗарплатыРасширенный.ОписаниеКоллекцииДляПроверкиПериодаДействия("Удержания", НСтр("ru = 'Удержания'"), "Удержание"));
	РасчетЗарплатыРасширенный.ПроверитьПериодДействияВКоллекцияхНачислений(ЭтотОбъект, ПараметрыПроверкиПериодаДействия, ПроверяемыеКоллекции, Отказ);
КонецПроцедуры

Процедура УдалитьПроверенныеРеквизиты(ПроверяемыеРеквизиты)
	
	Если ПроверяемыеРеквизиты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Организация");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Сотрудник");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПланируемаяДатаВыплаты");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДниУхода");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидРасчета");
	
КонецПроцедуры

Функция ПроверитьОтсутствиеДругихДокументовСФлажкомЗаЭтотГод(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Истина;
	КонецЕсли;
	НачалоГода = НачалоГода(ДниУхода[0].Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДней.Ссылка КАК Ссылка,
	|	Шапка.ДатаНачала КАК ДатаНачала,
	|	Шапка.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ДниУхода КАК ТаблицаДней
	|		ПО (ТаблицаДней.Ссылка = Шапка.Ссылка)
	|			И (ТаблицаДней.Дата МЕЖДУ &НачалоГода И &КонецГода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК Шапка2
	|		ПО Шапка.Ссылка = Шапка2.ИсправленныйДокумент
	|			И (Шапка2.Проведен
	|				ИЛИ Шапка2.Ссылка = &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК Сторнирование
	|		ПО Шапка.Ссылка = Сторнирование.СторнируемыйДокумент
	|			И (Сторнирование.Проведен)
	|ГДЕ
	|	Шапка.ФизическоеЛицо = &ФизическоеЛицо
	|	И Шапка.ИспользоватьОстатокДнейЗаГод
	|	И Шапка.Проведен
	|	И Шапка.Ссылка <> &Ссылка
	|	И Шапка.Ссылка <> &ИсправленныйДокумент
	|	И Шапка2.Ссылка ЕСТЬ NULL
	|	И Сторнирование.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода);
	Запрос.УстановитьПараметр("КонецГода",  КонецГода(НачалоГода));
	Запрос.УстановитьПараметр("Ссылка",     Ссылка);
	Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокумент);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если СтрокаТаблицы.ДатаНачала <= ДатаОкончания
			И СтрокаТаблицы.ДатаОкончания >= ДатаНачала 
			Или НачалоМесяца(СтрокаТаблицы.ДатаНачала) = НачалоМесяца(ДатаНачала)
			Или КонецМесяца(СтрокаТаблицы.ДатаОкончания) = КонецМесяца(ДатаОкончания) Тогда
			// Период пересекается с текущим документом пропускаем.
			Продолжить;
		КонецЕсли;
		Текст = СтрШаблон(
			НСтр("ru = 'В %1 году по физическому лицу %2 обнаружен другой документ с флажком ""%3"": %4'"),
			Формат(НачалоГода, "ДФ=yyyy"),
			Строка(ФизическоеЛицо),
			Метаданные().Реквизиты.ИспользоватьОстатокДнейЗаГод.Представление(),
			Строка(СтрокаТаблицы.Ссылка));
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ИспользоватьОстатокДнейЗаГод");
		Возврат Ложь;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

// Возвращает представление количества дней.
Функция ПредставлениеКоличестваДней(КоличествоДнейЧислом)
	Возврат Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПредставлениеКоличестваДней(КоличествоДнейЧислом);
КонецФункции

Процедура ПроверитьОграничениеДнейПоСотрудникуЗаМесяцы(Отказ, МесяцыУхода)
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	КонецМесяца = КонецМесяца(ДниУхода[0].Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МесяцыУхода.НачалоМесяца КАК НачалоМесяца,
	|	МесяцыУхода.КоличествоДней КАК КоличествоДней
	|ПОМЕСТИТЬ МесяцыУхода
	|ИЗ
	|	&МесяцыУхода КАК МесяцыУхода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыТекущегоДокумента.Дата КАК Дата
	|ПОМЕСТИТЬ ДатыТекущегоДокумента
	|ИЗ
	|	&ДатыТекущегоДокумента КАК ДатыТекущегоДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(МесяцыУхода.НачалоМесяца, ГОД) КАК НачалоГода,
	|	КОНЕЦПЕРИОДА(МесяцыУхода.НачалоМесяца, ГОД) КАК КонецГода,
	|	МИНИМУМ(МесяцыУхода.НачалоМесяца) КАК НачалоПервогоМесяцаВГоду,
	|	МАКСИМУМ(МесяцыУхода.НачалоМесяца) КАК НачалоПоследнегоМесяцаВГоду,
	|	МАКСИМУМ(КОНЕЦПЕРИОДА(МесяцыУхода.НачалоМесяца, МЕСЯЦ)) КАК КонецПоследнегоМесяцаВГоду
	|ПОМЕСТИТЬ ГодыУхода
	|ИЗ
	|	МесяцыУхода КАК МесяцыУхода
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(МесяцыУхода.НачалоМесяца, ГОД),
	|	КОНЕЦПЕРИОДА(МесяцыУхода.НачалоМесяца, ГОД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДней.Дата КАК Дата,
	|	Шапка.Ссылка КАК Ссылка,
	|	НАЧАЛОПЕРИОДА(ТаблицаДней.Дата, ГОД) КАК НачалоГода,
	|	НАЧАЛОПЕРИОДА(ТаблицаДней.Дата, МЕСЯЦ) КАК НачалоМесяца,
	|	Шапка.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод
	|ПОМЕСТИТЬ ДанныеДокументов
	|ИЗ
	|	Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГодыУхода КАК ГодыУхода
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ДниУхода КАК ТаблицаДней
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДатыТекущегоДокумента КАК ДатыТекущегоДокумента
	|			ПО ТаблицаДней.Дата = ДатыТекущегоДокумента.Дата
	|		ПО Шапка.Ссылка = ТаблицаДней.Ссылка
	|			И (ТаблицаДней.Дата МЕЖДУ ГодыУхода.НачалоГода И ГодыУхода.КонецГода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК Шапка2
	|		ПО Шапка.Ссылка = Шапка2.ИсправленныйДокумент
	|			И (Шапка2.Проведен
	|				ИЛИ Шапка2.Ссылка = &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК Сторнирование
	|		ПО Шапка.Ссылка = Сторнирование.СторнируемыйДокумент
	|			И (Сторнирование.Проведен)
	|ГДЕ
	|	Шапка.ФизическоеЛицо = &ФизическоеЛицо
	|	И Шапка.Проведен
	|	И Шапка.Ссылка <> &Ссылка
	|	И Шапка.Ссылка <> &ИсправленныйДокумент
	|	И Шапка2.Ссылка ЕСТЬ NULL
	|	И Сторнирование.Ссылка ЕСТЬ NULL
	|	И ДатыТекущегоДокумента.Дата ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДанныеДокументов.НачалоМесяца) КАК НачалоПервогоМесяца,
	|	ДанныеДокументов.НачалоГода КАК НачалоГода,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДокументов.Дата) КАК ИспользованоДней
	|ПОМЕСТИТЬ ИтогиДокументовСФлажком
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ИспользоватьОстатокДнейЗаГод
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокументов.НачалоГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиДокументовСФлажком1.НачалоПервогоМесяца КАК НачалоПервогоМесяца,
	|	ИтогиДокументовСФлажком1.НачалоГода КАК НачалоГода,
	|	ИтогиДокументовСФлажком1.ИспользованоДней КАК ИспользованоДней,
	|	СУММА(МесяцыУхода.КоличествоДней) КАК ИспользованоТекущимДокументом
	|ПОМЕСТИТЬ ИтогиДокументовСФлажком2
	|ИЗ
	|	ИтогиДокументовСФлажком КАК ИтогиДокументовСФлажком1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МесяцыУхода КАК МесяцыУхода
	|		ПО ИтогиДокументовСФлажком1.НачалоПервогоМесяца >= МесяцыУхода.НачалоМесяца
	|			И (ИтогиДокументовСФлажком1.НачалоГода = НАЧАЛОПЕРИОДА(МесяцыУхода.НачалоМесяца, ГОД))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогиДокументовСФлажком1.НачалоПервогоМесяца,
	|	ИтогиДокументовСФлажком1.НачалоГода,
	|	ИтогиДокументовСФлажком1.ИспользованоДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокументов.Ссылка КАК Ссылка,
	|	ДанныеДокументов.НачалоМесяца КАК НачалоПервогоМесяца
	|ИЗ
	|	ДанныеДокументов КАК ДанныеДокументов
	|ГДЕ
	|	ДанныеДокументов.ИспользоватьОстатокДнейЗаГод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогиДокументовСФлажком2.НачалоПервогоМесяца КАК НачалоПервогоМесяца,
	|	ИтогиДокументовСФлажком2.ИспользованоДней КАК ИспользованоДней,
	|	ИтогиДокументовСФлажком2.ИспользованоТекущимДокументом КАК ИспользованоТекущимДокументом,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДанныеДокументовБезФлажка.Дата) КАК ИспользованоРанее
	|ИЗ
	|	ИтогиДокументовСФлажком2 КАК ИтогиДокументовСФлажком2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументов КАК ДанныеДокументовБезФлажка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументов КАК ДанныеДокументов
	|			ПО ДанныеДокументовБезФлажка.НачалоМесяца = ДанныеДокументов.НачалоМесяца
	|				И ДанныеДокументовБезФлажка.Дата = ДанныеДокументов.Дата
	|				И ДанныеДокументовБезФлажка.ИспользоватьОстатокДнейЗаГод <> ДанныеДокументов.ИспользоватьОстатокДнейЗаГод
	|		ПО ИтогиДокументовСФлажком2.НачалоГода = ДанныеДокументовБезФлажка.НачалоГода
	|			И ИтогиДокументовСФлажком2.НачалоПервогоМесяца >= ДанныеДокументовБезФлажка.НачалоМесяца
	|			И (НЕ ДанныеДокументовБезФлажка.ИспользоватьОстатокДнейЗаГод)
	|ГДЕ
	|	ДанныеДокументов.Дата ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогиДокументовСФлажком2.НачалоПервогоМесяца,
	|	ИтогиДокументовСФлажком2.ИспользованоДней,
	|	ИтогиДокументовСФлажком2.ИспользованоТекущимДокументом";
	Запрос.УстановитьПараметр("МесяцыУхода", МесяцыУхода);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Запрос.УстановитьПараметр("НачалоГода",  НачалоГода(КонецМесяца));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
	Запрос.УстановитьПараметр("Ссылка",      Ссылка);
	Запрос.УстановитьПараметр("ИсправленныйДокумент", ИсправленныйДокумент);
	Запрос.УстановитьПараметр("ДатыТекущегоДокумента", ДниУхода.Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина);
	Пакет = Запрос.ВыполнитьПакет();
	ВсегоПакетов = Пакет.Количество();
	Если Пакет[ВсегоПакетов - 1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоМесяцам = Пакет[ВсегоПакетов - 1].Выгрузить();
	ДокументыПоМесяцам = Пакет[ВсегоПакетов - 2].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоМесяцам Цикл
		Доступно          = Месяц(СтрокаТаблицы.НачалоПервогоМесяца) * 4;
		ИспользованоРанее = СтрокаТаблицы.ИспользованоРанее + СтрокаТаблицы.ИспользованоДней;
		Остаток           = Доступно - ИспользованоРанее;
		Если Остаток >= 0 И Остаток < СтрокаТаблицы.ИспользованоТекущимДокументом Тогда
			Отбор = Новый Структура("НачалоПервогоМесяца", СтрокаТаблицы.НачалоПервогоМесяца);
			НайденныеСтроки = ДокументыПоМесяцам.НайтиСтроки(Отбор);
			ПредставлениеДокументов = "";
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ПредставлениеДокументов = ПредставлениеДокументов +
					?(ПустаяСтрока(ПредставлениеДокументов), "", ", ") + НайденнаяСтрока.Ссылка;
			КонецЦикла;
			ПредставлениеДокументов = СтрШаблон(НСтр("ru = 'Документами %1 всего использовано %2'"),
				ПредставлениеДокументов, ПредставлениеКоличестваДней(СтрокаТаблицы.ИспользованоДней));
			Текст = СтрШаблон(
				НСтр("ru = 'При проведении данного документа будет превышен остаток с учётом более поздних проведённых документов на %1. %2. По состоянию на %3 с учетом всех документов потребуется %4, что больше доступного количества: %5.'"),
				ПредставлениеКоличестваДней(СтрокаТаблицы.ИспользованоТекущимДокументом - Остаток),
				ПредставлениеДокументов,
				НРег(Формат(СтрокаТаблицы.НачалоПервогоМесяца, "ДФ='ММММ yyyy'")),
				ПредставлениеКоличестваДней(ИспользованоРанее + СтрокаТаблицы.ИспользованоТекущимДокументом),
				ПредставлениеКоличестваДней(Доступно));
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ДниУхода");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьСотрудникаВТаблицахНачислений()
	
	ТаблицыНачислений = Новый Массив;
	ТаблицыНачислений.Добавить(Начисления);
	ТаблицыНачислений.Добавить(НачисленияПерерасчет);
	ТаблицыНачислений.Добавить(НачисленияПерерасчетНулевыеСторно);
	
	Для Каждого ТаблицаНачислений Из ТаблицыНачислений Цикл
		Для Каждого СтрокаТаблицы Из ТаблицаНачислений Цикл
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
				СтрокаТаблицы.Сотрудник = Сотрудник;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПослеПереноса(ДанныеЗаполнения)

	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
			ДатаОкончания = ДатаНачала;
		КонецЕсли;
		
		ОчереднаяДата = ДатаНачала;
		Пока ОчереднаяДата <= ДатаОкончания Цикл
			НоваяСтрока = ДниУхода.Добавить();
			НоваяСтрока.Дата = ОчереднаяДата;
			ОчереднаяДата = ОчереднаяДата + 86400;
		КонецЦикла;
		
	КонецЕсли;
	
	ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(ДатаНачалаСобытия, Сотрудник);
	ПериодРасчетаСреднегоЗаработкаНачало	= ПериодРасчетаСреднего.ДатаНачала;
	ПериодРасчетаСреднегоЗаработкаОкончание = ПериодРасчетаСреднего.ДатаОкончания;
	
	ЗапрашиваемыеЗначения = Новый Структура;
	ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
	ЗапрашиваемыеЗначения.Вставить("Ответственный", "Ответственный");
	ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
	ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
	ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", "ГлавныйБухгалтер");
	ЗапрашиваемыеЗначения.Вставить("Бухгалтер", "Бухгалтер");
	ЗарплатаКадры.ЗаполнитьЗначенияВФорме(ЭтотОбъект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));

КонецПроцедуры

Процедура ЗаполнитьПоПараметрамЗаполнения(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполняемыеЗначения = Новый Структура(
		"ПериодРегистрации, 
		|Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ТекущаяДатаСеанса());
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаполняемыеЗначения);
	
	Если ДанныеЗаполнения.Свойство("ДниУхода") Тогда
		Для каждого ДеньУхода Из ДанныеЗаполнения.ДниУхода Цикл
			НовыйДеньУхода = ДниУхода.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйДеньУхода, ДеньУхода);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоДаннымЗаявкиКабинетСотрудника(ДанныеЗаполнения)

	Организация = ДанныеЗаполнения.Организация;
	Сотрудник 	= ДанныеЗаполнения.Сотрудник;
	ДатаНачала 	= ДанныеЗаполнения.ДатаНачала;
	ДатаОкончания = ДатаНачала;
	ИспользоватьОстатокДнейЗаГод = ДанныеЗаполнения.ИспользоватьОстатокДнейЗаГод;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ДниУхода") Тогда
		Для каждого ДеньУхода Из ДанныеЗаполнения.ДниУхода Цикл
			НоваяСтрока = ДниУхода.Добавить();
			НоваяСтрока.Дата = ДеньУхода;
		КонецЦикла;
	КонецЕсли;
	
	ДатаНачалаСобытия = ДатаНачала;
	ПериодРасчетаСреднего = УчетСреднегоЗаработка.ПериодРасчетаОбщегоСреднегоЗаработкаСотрудника(ДатаНачалаСобытия, Сотрудник);
	ПериодРасчетаСреднегоЗаработкаНачало	= ПериодРасчетаСреднего.ДатаНачала;
	ПериодРасчетаСреднегоЗаработкаОкончание = ПериодРасчетаСреднего.ДатаОкончания;

КонецПроцедуры

Процедура УстановитьЗначениеПоУмолчаниюСвойстваУчитыватьМРОТ()
	ПоказательНайден = Ложь;
	ПоказательУчитыватьМРОТ = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ПоказателиРасчетаЗарплаты.УчитыватьМРОТ");
	ВидРасчетаИнфо = ЗарплатаКадрыРасширенныйПовтИсп.ПолучитьИнформациюОВидеРасчета(ВидРасчета);
	Для Каждого ДанныеПоказателя Из ВидРасчетаИнфо.Показатели Цикл 
		Если ДанныеПоказателя.Показатель = ПоказательУчитыватьМРОТ Тогда 
			ПоказательНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПоказательНайден Тогда
		УчитыватьМРОТПриОплатеПоСреднемуЗаработку = Ложь;
		Возврат;
	КонецЕсли;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина, Сотрудник, "ГрафикРаботы,КоличествоСтавок", ДатаНачалаСобытия);
	Если КадровыеДанные.Количество() > 0 Тогда 
		Если Не ЗначениеЗаполнено(КадровыеДанные[0].КоличествоСтавок) Или КадровыеДанные[0].КоличествоСтавок < 1 Тогда
			УчитыватьМРОТПриОплатеПоСреднемуЗаработку = Ложь;;
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(КадровыеДанные[0].ГрафикРаботы)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанные[0].ГрафикРаботы, "НеполноеРабочееВремя") Тогда
			УчитыватьМРОТПриОплатеПоСреднемуЗаработку = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УчитыватьМРОТПриОплатеПоСреднемуЗаработку = Истина;
КонецПроцедуры

Процедура УстановитьПланируемуюДатуВыплаты()
	ПараметрыПолученияДатыВыплаты = РасчетЗарплатыРасширенный.ПараметрыПолученияПланируемойДатыВыплатыЗарплаты();
	ПараметрыПолученияДатыВыплаты.МесяцНачисления = ПериодРегистрации;
	ПараметрыПолученияДатыВыплаты.ПорядокВыплаты = ПорядокВыплаты;
	ПараметрыПолученияДатыВыплаты.Организация = Организация;
	ПараметрыПолученияДатыВыплаты.Сотрудник = Сотрудник;
	
	ПланируемаяДатаВыплаты = РасчетЗарплатыРасширенный.ПланируемаяДатаВыплатыЗарплатыПоНастройкамПоПорядкуВыплаты(
		ПараметрыПолученияДатыВыплаты);
КонецПроцедуры

#КонецОбласти

#Область Расчет

Функция Рассчитать(ПараметрыРасчета) Экспорт
	Если Не ДокументГотовКРасчету(ПараметрыРасчета.ВыводитьСообщения, ПараметрыРасчета.Результат.ОшибкиЗаполнения) Тогда
		Возврат ПараметрыРасчета.Результат;
	КонецЕсли;
	Возврат Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.Рассчитать(ЭтотОбъект, ПараметрыРасчета);
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
