///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КешФормы = Новый Структура;
	КешФормы.Вставить("РезультатПоискаСсылки", Новый Соответствие);
	КешФормы.Вставить("РезультатПоискаНомераСтраницПерехода", ОбнулитьНомераПерехода());
	КешФормы.Вставить("РезультатПоискаВсегоСтраниц", 0);
	КешФормы.Вставить("РезультатПоискаТекущаяСтраница", 0);
	КешФормы.Вставить("ПрикладныеОбъекты", Новый Соответствие);
	КешФормы.Вставить("ИдентификаторыКарусели", Новый Соответствие);
	КешФормы.Вставить("ПараметрыЭлементов", Новый Соответствие);
	КешФормы.Вставить("КомандыКарточки", Новый Массив);
	// для корректной передачи между клиентом и сервером при изменении:
	КешФормы.Вставить("ВремяОбновления", ТекущаяУниверсальнаяДатаВМиллисекундах());
	
	ЭтоИнтерфейс85 = ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85();
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	Если ЭтоИнтерфейс85 Тогда
		ПанельПомощьСлужебный.ПриСозданииНаСервереСлужебный(
			ЭтотОбъект,
			,
			,
			Истина);
	Иначе
		ПанельПомощьСлужебный.ПриСозданииНаСервереСлужебный(
			ЭтотОбъект,
			Элементы.КоманднаяПанельТехПоддержкаТакси,
			Элементы.ГруппаПоискТакси,
			Истина);
	КонецЕсли;
	
	ИнтернетПоддержкаПользователей.НастроитьКоманднуюПанельМастера(
		Неопределено,
		Элементы.Назад);
	
	УстановитьПараметрыЭлементов();
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, ЭтотОбъект);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиЛоготип(Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.Логотип);
	ВывестиСоцСети(Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ПрикладныеПараметры.ДанныеСоцСети);
	ВывестиКарусель(Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ПрикладныеПараметры.Карусель);
	ВывестиКарточки(
		Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ПрикладныеПараметры.ДанныеКарточек,
		Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.Документация,
		Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ОтветыНаВопросы);
	
	УстановитьНастройкиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно()
		И СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(СтандартныйФорматДанныхБуфераОбмена.Текст) Тогда
		БуферОбменаДоступен = Истина;
	Иначе
		БуферОбменаДоступен = Ложь;
	КонецЕсли;
	
	ВключитьВыключитьАвтолистаниеКарусели();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияОшибкаОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработкаНавигационныхСсылок(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНеНайденоОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ОбработкаНавигационныхСсылок(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНайденоКоличествоНажатие(Элемент)
	
	ВыполнитьПереходНаИТС(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КопироватьСсылкуРезультатПоиска(Элемент)
	
	Идентификатор = ИдентификаторРезультатаПоискаПоИмениЭлемента(Элемент.Имя);
	
	СсылкаРезультатПоиска = КешФормы.РезультатПоискаСсылки.Получить(Идентификатор);
	Если СсылкаРезультатПоиска <> Неопределено Тогда
		КопироватьТекстВБуфер(
			СсылкаРезультатПоиска,
			НСтр("ru = 'Ссылка скопирована в буфер обмена'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьСсылкуРезультатПоиска(Элемент)
	
	Идентификатор = ИдентификаторРезультатаПоискаПоИмениЭлемента(Элемент.Имя);
	
	СсылкаРезультатПоиска = КешФормы.РезультатПоискаСсылки.Получить(Идентификатор);
	Если СсылкаРезультатПоиска <> Неопределено Тогда
		Если ИнтернетПоддержкаПользователейКлиентСервер.ОткрытьСАвторизацией(СсылкаРезультатПоиска) Тогда
			ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(СсылкаРезультатПоиска);
		Иначе
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СсылкаРезультатПоиска);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЛоготипНажатие(Элемент)
	
	ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
		СсылкаЛоготип,
		"Логотип");
	
КонецПроцедуры

&НаКлиенте
Процедура АдресЛоготипНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
		СсылкаЛоготип,
		"Логотип");
	
КонецПроцедуры

&НаКлиенте
Процедура КарусельПредыдущийНажатие(Элемент)
	
	ПереключитьКарусель("Предыдущий");
	
КонецПроцедуры

&НаКлиенте
Процедура КарусельСледующийНажатие(Элемент)
	
	ПереключитьКарусель("Следующий");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельПомощьНажатиеЭлемента(Элемент)
	
	Подключаемый_НажатиеЭлементаОбщий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеЭлементаСтандартнаяОбработка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Подключаемый_НажатиеЭлементаОбщий(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КарусельПереходНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеЭлемента = КешФормы.ПрикладныеОбъекты.Получить(Элемент.Имя);
	Если ОписаниеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПереключитьКарусель(ОписаниеЭлемента.Параметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КартинкаКаруселиНажатие(Элемент)
	
	ОписаниеЭлемента = КешФормы.ПрикладныеОбъекты.Получить(Элемент.Имя);
	Если ОписаниеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
		ОписаниеЭлемента.Параметры,
		"Карусель");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КартинкаКаруселиНажатиеСтандартнаяОбработка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеЭлемента = КешФормы.ПрикладныеОбъекты.Получить(Элемент.Имя);
	Если ОписаниеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
		ОписаниеЭлемента.Параметры,
		"Карусель");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КарусельОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	ИнтеграцияПодсистемБИПКлиент.ПриОбработкеНавигационнойСсылкиПанельПомощь(
		"Карусель",
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки(
		"Карусель",
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	
КонецПроцедуры

#Область ПереходПоСтраницам

&НаКлиенте
Процедура ПереходПредыдущаяНажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.ПереходПредыдущая);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПерваяНажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.ПереходПервая);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоНомеруЛевоНажатие(Элемент)
	
	ПереходПоНомеруОбщий();
	
КонецПроцедуры

&НаКлиенте
Процедура Переход1Нажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.Переход1);
	
КонецПроцедуры

&НаКлиенте
Процедура Переход2Нажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.Переход2);
	
КонецПроцедуры

&НаКлиенте
Процедура Переход3Нажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.Переход3);
	
КонецПроцедуры

&НаКлиенте
Процедура Переход4Нажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.Переход4);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоНомеруПравоНажатие(Элемент)
	
	ПереходПоНомеруОбщий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоследняяНажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.ПереходПоследняя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходСледующаяНажатие(Элемент)
	
	НажатиеКнопкиПерехода(КешФормы.РезультатПоискаНомераСтраницПерехода.ПереходСледующая);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Назад(Команда)
	
	ОтобразитьОсновнуюСтраницу();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПанельПомощьВыполнитьКоманду(Команда)
	
	Если КешФормы.КомандыКарточки.Найти(Команда.Имя) = Неопределено Тогда
		ПанельПомощьКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда);
	Иначе
		Подключаемый_НажатиеЭлементаОбщий(Команда);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

&НаКлиенте
Процедура ВыполнитьПереходНаИТС(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаПерехода = ПанельПомощьКлиент.ПолучитьСтрокуПоискаНаИТС(ЭтотОбъект);
	ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(СтрокаПерехода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОсновнуюСтраницу()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОсновная;
	Элементы.СтраницаРезультатПоиска.Видимость = Ложь;
	Элементы.ДекорацияОтступПодвалЛевоЛоготип.Видимость = Истина;
	Элементы.ГруппаПодвал.Видимость = ВидимостьПодвал;
	Элементы.ГруппаСтраницыРезультатаПоиска.Видимость = Ложь;
	
	ВключитьВыключитьАвтолистаниеКарусели();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура КопироватьТекстВБуфер(Текст, СообщениеУспех)
	
	УдалосьПоместить = Ждать ИнтернетПоддержкаПользователейКлиент.ПоместитьСтрокуВБуферОбмена(
		Строка(Текст));
	
	Если УдалосьПоместить Тогда
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Успешно'"),
			,
			СообщениеУспех);
	Иначе
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Не удалось скопировать информацию.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационныхСсылок(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "НеНайденоПереходНаИТС" Тогда
		ВыполнитьПереходНаИТС(СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЭлементов()

	КоличествоКолонок = ПанельПомощьСлужебный.КоличествоКолонокПоРазрешению();
	КешФормы.ПараметрыЭлементов.Вставить("КоличествоКолонок", КоличествоКолонок);
	
	РазмерыЭлементов = ПанельПомощьСлужебный.РазмерыЭлементов(КоличествоКолонок);
	
	Если ЭтоИнтерфейс85 Тогда
		ОбщаяШирина = РазмерыЭлементов.ОбщаяШирина;
		КешФормы.ПараметрыЭлементов.Вставить("ШиринаКартинкаКарусель", ОбщаяШирина - 7);
	Иначе
		ОбщаяШирина = РазмерыЭлементов.ОбщаяШиринаТакси;
		Элементы.АдресЛоготип.Высота = 3;
		Элементы.ДекорацияЛоготип.Высота = 3;
		КешФормы.ПараметрыЭлементов.Вставить("ШиринаКартинкаКарусель", ОбщаяШирина - 5);
	КонецЕсли;
	
	Элементы.ГруппаКарусель.Ширина = ОбщаяШирина;
	
	КешФормы.ПараметрыЭлементов.Вставить("ШиринаТекстКарусель", ОбщаяШирина - 9);
	КешФормы.ПараметрыЭлементов.Вставить("ШиринаРезультатПоиска", ОбщаяШирина + 15);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеЭлементаОбщий(Элемент, СтандартнаяОбработка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеЭлемента = КешФормы.ПрикладныеОбъекты.Получить(Элемент.Имя);
	Если ОписаниеЭлемента = Неопределено Тогда
		ПанельПомощьКлиент.КарточкаНажатие(ЭтотОбъект, Элемент);
		Возврат;
	КонецЕсли;
	
	Если ОписаниеЭлемента.Тип = ТипСоцСети() Тогда
		
		ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
			ОписаниеЭлемента.Параметры,
			"СоцСети");
	
	ИначеЕсли ОписаниеЭлемента.Тип = ТипКарточка() Тогда
		
		Обработано = Ложь;
		ПанельПомощьКлиент.КарточкаНажатие(
			ЭтотОбъект,
			Элемент,
			Обработано);
		
		Если Обработано Тогда
			Возврат;
		КонецЕсли;
		
		ПанельПомощьКлиент.ОткрытьНавигационнуюСсылкуСПереопределением(
			ОписаниеЭлемента.Параметры,
			"Карточка");
	
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает данные картинки для вывода на форму.
//
// Параметры:
//  Значение - Произвольный - значение, которое необходимо обработать.
//
// Возвращаемое значение:
//  Структура - результат обработки значения:
//   * Значение - Неопределено - если передано недопустимое значение.
//              - Картинка, Строка - картинка для вывода, либо адрес картинки во временном хранилище.
//   * Тип - Строка - тип значения. Доступные значения определяются методами ТипКартинкиКартинка
//         и ТипКартинкиАдресВХранилище.
//   * Пустая - Булево - Истина, если в значении содержится пустая картинка
// 
&НаСервере
Функция ДанныеКартинкиДляВывода(Значение)
	
	Результат = Новый Структура(
		"Значение, Тип, Пустая",
		Неопределено,
		"",
		Ложь);
	
	Если ТипЗнч(Значение) = Тип("Картинка") Тогда
		Результат.Значение = Значение;
		Результат.Тип = ТипКартинкиКартинка();
		Результат.Пустая = Значение.Вид = ВидКартинки.Пустая;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		// Имена картинок из библиотеки преобразовываются в тип Картинка в ПанельПомощьСлужебный.ПараметрыРаздела,
		// поэтому сюда должны дойти только адреса во временном хранилище.
		// Остальные варианты - ошибка, не обрабатываем.
		Если ЭтоАдресВременногоХранилища(Значение) Тогда
			Результат.Значение = Значение;
			Результат.Тип = ТипКартинкиАдресВХранилище();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		Результат.Значение = ПоместитьВоВременноеХранилище(Значение, УникальныйИдентификатор);
		Результат.Тип = ТипКартинкиАдресВХранилище();
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКартинкиКартинка()
	
	Возврат "Картинка";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКартинкиАдресВХранилище()
	
	Возврат "АдресВХранилище";
	
КонецФункции

&НаСервере
Процедура УстановитьНастройкиФормы()
	
	Если ЕстьЭлементыНаОсновной Тогда
		Элементы.ДекорацияЗаглушкаПустаяСтраница.Видимость = Ложь;
	КонецЕсли;
	
	ВидимостьПодвал = ВидимостьПодвал И (Не ЭтоМобильныйКлиент);
	Элементы.ГруппаПодвал.Видимость = ВидимостьПодвал;
	
	Если ЭтоМобильныйКлиент Тогда
		
		Элементы.КнопкиПерехода.РастягиватьПоГоризонтали = Истина;
		Элементы.КнопкиПерехода.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
		Элементы.КнопкиПерехода.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		Элементы.КнопкиПерехода.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Авто;
		Элементы.ГруппаСтраницыРезультатаПоиска.РастягиватьПоГоризонтали = Истина;
		
		Элементы.ДекорацияОтступПодвалЛевоЛоготип.Видимость = Ложь;
		Элементы.ДекорацияОтступПодвалЛево.Видимость = Ложь;
		Элементы.ГруппаСоцСети.Видимость = Ложь;
		Элементы.ДекорацияОтступПодвалаПраво.Видимость = Ложь;
		Элементы.АдресЛоготип.Видимость = Ложь;
		Элементы.ДекорацияЛоготип.Видимость = Ложь;
		
		Элементы.ГруппаКарусель.ЦветФона = Новый Цвет();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеПараметры

&НаКлиентеНаСервереБезКонтекста
Функция ТипСоцСети()
	
	Возврат "СоцСети";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКарточка()
	
	Возврат "Карточка";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипПереключательКарусели()
	
	Возврат "Карусель";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипКартинкаКарусели()
	
	Возврат "КарусельКартинка";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеПрикладногоОбъекта(Тип, Параметры)
	
	Результат = Новый Структура;
	
	Результат.Вставить("Тип", Тип);
	Результат.Вставить("Параметры", Параметры);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиЛоготип(Логотип)
	
	Если ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКартинки = ДанныеКартинкиДляВывода(Логотип.Картинка);
	Если ДанныеКартинки.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеКартинки.Тип = ТипКартинкиКартинка()
		И Не ДанныеКартинки.Пустая Тогда
		ЭлементКартинка = Элементы.ДекорацияЛоготип;
		ЭлементКартинка.Картинка = ДанныеКартинки.Значение;
	ИначеЕсли ДанныеКартинки.Тип = ТипКартинкиАдресВХранилище() Тогда
		Элементы.ДекорацияЛоготип.Видимость = Ложь;
		Элементы.АдресЛоготип.Видимость = Истина;
		АдресЛоготип = ДанныеКартинки.Значение;
		ЭлементКартинка = Элементы.АдресЛоготип;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭлементКартинка.Подсказка = Логотип.Подсказка;
	Если Логотип.Цвет <> Неопределено Тогда
		ЭлементКартинка.ЦветКартинки = Логотип.Цвет;
	КонецЕсли;
	СсылкаЛоготип = Логотип.Ссылка;
	
	ЭлементКартинка.Гиперссылка = ЗначениеЗаполнено(СсылкаЛоготип);
	
	Логотип.Картинка = Неопределено;
	
	ВидимостьПодвал = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСоцСети(ДанныеСоцСети)
	
	НовыеРеквизиты = Новый Массив;
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ДанныеКартинок = Новый Массив;
	
	РамкаКартинки = РамкиСтиля.БезРамки;
	
	ЕстьСоцСети = Ложь;
	
	ГруппаСоцСети = ?(ЭтоМобильныйКлиент,
		Элементы.ГруппаСоцСетиМобильный,
		Элементы.ГруппаСоцСети);
	
	Для Каждого ОписаниеСоцСети Из ДанныеСоцСети Цикл
		
		ДанныеКартинки = ДанныеКартинкиДляВывода(ОписаниеСоцСети.Картинка);
		Если ДанныеКартинки.Значение = Неопределено
			Или Не ЗначениеЗаполнено(ОписаниеСоцСети.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяДекорации = "ДекорацияСоцСети_" + ПанельПомощьСлужебный.НовыйИдентификаторДляИмени();
		
		Если ДанныеКартинки.Тип = ТипКартинкиКартинка() Тогда
			
			НоваяКартинка = Элементы.Добавить(
				ИмяДекорации,
				Тип("ДекорацияФормы"),
				ГруппаСоцСети);
			НоваяКартинка.Вид = ВидДекорацииФормы.Картинка;
			НоваяКартинка.Картинка = ДанныеКартинки.Значение;
			НоваяКартинка.УстановитьДействие("Нажатие", "Подключаемый_ПанельПомощьНажатиеЭлемента");
			
		ИначеЕсли ДанныеКартинки.Тип = ТипКартинкиАдресВХранилище() Тогда
			
			НоваяКартинка = Элементы.Добавить(
				ИмяДекорации,
				Тип("ПолеФормы"),
				ГруппаСоцСети);
			НоваяКартинка.Вид = ВидПоляФормы.ПолеКартинки;
			НоваяКартинка.УстановитьДействие("Нажатие", "Подключаемый_НажатиеЭлементаСтандартнаяОбработка");
			НоваяКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НоваяКартинка.Рамка = РамкаКартинки;
			
			НовыеРеквизиты.Добавить(
				Новый РеквизитФормы(
					ИмяДекорации,
					ТипСтрока));
			ДанныеКартинок.Добавить(
				Новый Структура(
					"ИмяРеквизита, Значение",
					ИмяДекорации,
					ДанныеКартинки.Значение));
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ОписаниеСоцСети.ЦветКартинки <> Неопределено Тогда
			НоваяКартинка.ЦветКартинки = ОписаниеСоцСети.ЦветКартинки;
		КонецЕсли;
		НоваяКартинка.Гиперссылка = Истина;
		НоваяКартинка.Подсказка = ОписаниеСоцСети.Подсказка;
		
		НоваяКартинка.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
		НоваяКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
		НоваяКартинка.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		НоваяКартинка.РастягиватьПоГоризонтали = Ложь;
		НоваяКартинка.РастягиватьПоВертикали = Ложь;
		
		Если ЭтоИнтерфейс85 Тогда
			НоваяКартинка.Высота = 1;
		Иначе
			НоваяКартинка.Высота = 2;
		КонецЕсли;
		НоваяКартинка.Ширина = 3;
		
		КешФормы.ПрикладныеОбъекты.Вставить(
			ИмяДекорации,
			ОписаниеПрикладногоОбъекта(
				ТипСоцСети(),
				ОписаниеСоцСети.Ссылка));
		
		ОписаниеСоцСети.Картинка = Неопределено;
		
		ЕстьСоцСети = Истина;
		
	КонецЦикла;
	
	Если НовыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(НовыеРеквизиты);
		
		Для Каждого ДанныеКартинки Из ДанныеКартинок Цикл
			ЭтотОбъект[ДанныеКартинки.ИмяРеквизита] = ДанныеКартинки.Значение;
			Элементы[ДанныеКартинки.ИмяРеквизита].ПутьКДанным = ДанныеКартинки.ИмяРеквизита;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЕстьСоцСети Тогда
		ВидимостьПодвал = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область Карусель

&НаСервере
Процедура ВывестиКарусель(ДанныеКарусель)
	
	Если ДанныеКарусель.Сообщения.Количество() = 0 Или ЭтоМобильныйКлиент Тогда
		КарусельИнтервалАвтолистания = 0;
		Элементы.ГруппаКарусель.Видимость = Ложь;
		Возврат;
	Иначе
		КарусельИнтервалАвтолистания = ДанныеКарусель.ИнтервалАвтолистания;
		ЕстьЭлементыНаОсновной = Истина;
	КонецЕсли;
	
	Идентификаторы = Новый Массив;
	НовыеРеквизиты = Новый Структура(
		"Переключатели, КартинкиВХранилище",
		Новый Массив,
		Новый Массив);
	КоличествоКолонок = КешФормы.ПараметрыЭлементов.Получить("КоличествоКолонок");

	Для Каждого СообщениеКарусели Из ДанныеКарусель.Сообщения Цикл
		
		Идентификатор = ПанельПомощьСлужебный.НовыйИдентификаторДляИмени();
		
		Если ТипЗнч(СообщениеКарусели.Заголовок) = Тип("ФорматированнаяСтрока") Тогда
			ЗаголовокСообщения = СообщениеКарусели.Заголовок;
		Иначе
			ЗаголовокСообщения = СтроковыеФункции.ФорматированнаяСтрока(
				СообщениеКарусели.Заголовок);
		КонецЕсли;
		Если ТипЗнч(СообщениеКарусели.Текст) = Тип("ФорматированнаяСтрока") Тогда
			ТекстСообщения = СообщениеКарусели.Текст;
		Иначе
			ТекстСообщения = СтроковыеФункции.ФорматированнаяСтрока(
				СообщениеКарусели.Текст);
		КонецЕсли;
		
		КартинкаСообщения = КартинкаСообщенияКарусели(СообщениеКарусели, КоличествоКолонок);
		
		Если ЗначениеЗаполнено(ЗаголовокСообщения)
			Или ЗначениеЗаполнено(ТекстСообщения)
			Или КартинкаСообщения.Значение <> Неопределено Тогда
		
			СоздатьСтраницуКарусели(
				Идентификатор,
				КартинкаСообщения,
				ЗаголовокСообщения,
				ТекстСообщения,
				НовыеРеквизиты,
				СообщениеКарусели.СсылкаКартинки);
			
			Идентификаторы.Добавить(
				Новый Структура(
					"Идентификатор, Заголовок",
					Идентификатор,
					ЗаголовокСообщения));
		
		КонецЕсли;
		
	КонецЦикла;

	КарусельТекущееСообщение = Идентификаторы[0].Идентификатор;
	
	Если Идентификаторы.Количество() = 1 Тогда
		Элементы.ГруппаПереключательКарусели.Видимость = Ложь;
		Элементы.КарусельПредыдущий.Видимость = Ложь;
		Элементы.КарусельСледующий.Видимость = Ложь;
		КарусельИнтервалАвтолистания = 0;
		
		Если НовыеРеквизиты.КартинкиВХранилище.Количество() > 0 Тогда
			ДобавляемыеРеквизиты = Новый Массив;
			Для Каждого ОписаниеКартинки Из НовыеРеквизиты.КартинкиВХранилище Цикл
				ДобавляемыеРеквизиты.Добавить(
					Новый РеквизитФормы(
						ОписаниеКартинки.ИмяРеквизита,
						Новый ОписаниеТипов("Строка")));
			КонецЦикла;
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			Для Каждого ОписаниеКартинки Из НовыеРеквизиты.КартинкиВХранилище Цикл
				ЭтотОбъект[ОписаниеКартинки.ИмяРеквизита] = ОписаниеКартинки.Значение;
				Элементы[ОписаниеКартинки.ИмяРеквизита].ПутьКДанным = ОписаниеКартинки.ИмяРеквизита;
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		РазмерыЭлементов = ПанельПомощьСлужебный.РазмерыЭлементов(КоличествоКолонок);
		
		Последний = Идентификаторы.ВГраница();
		
		ВыводитьПереключатели = (Не ЭтоМобильныйКлиент)
			И (Идентификаторы.Количество() < РазмерыЭлементов.КоличествоПереключателей);
		Элементы.ГруппаПереключательКарусели.Видимость = ВыводитьПереключатели;
		
		ДобавляемыеРеквизиты = Новый Массив;
		Для Каждого ОписаниеКартинки Из НовыеРеквизиты.КартинкиВХранилище Цикл
			ДобавляемыеРеквизиты.Добавить(
				Новый РеквизитФормы(
					ОписаниеКартинки.ИмяРеквизита,
					Новый ОписаниеТипов("Строка")));
		КонецЦикла;
		
		Если ВыводитьПереключатели Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
				ДобавляемыеРеквизиты,
				НовыеРеквизиты.Переключатели);
		КонецЕсли;
		
		Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
			ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		КонецЕсли;
		
		Для НомерЭлемента = 0 По Последний Цикл
				
			Текущий = Идентификаторы[НомерЭлемента].Идентификатор;
			Предыдущий = ?(НомерЭлемента = 0,
				Идентификаторы[Последний].Идентификатор,
				Идентификаторы[НомерЭлемента - 1].Идентификатор);
			Следующий = ?(НомерЭлемента = Последний,
				Идентификаторы[0].Идентификатор,
				Идентификаторы[НомерЭлемента + 1].Идентификатор);
			
			КешФормы.ИдентификаторыКарусели.Вставить(
				Текущий,
				Новый Структура(
					"Предыдущий, Следующий",
					Предыдущий,
					Следующий));
			
			Если ВыводитьПереключатели Тогда
				ДобавитьКнопкуПереключения(
					Текущий,
					Предыдущий,
					Следующий,
					Идентификаторы[НомерЭлемента].Заголовок);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ВыводитьПереключатели Тогда
			ЭтотОбъект["КарусельПереключатель_" + Идентификаторы[0].Идентификатор] = 1;
		КонецЕсли;
		
		Для Каждого ОписаниеКартинки Из НовыеРеквизиты.КартинкиВХранилище Цикл
			ЭтотОбъект[ОписаниеКартинки.ИмяРеквизита] = ОписаниеКартинки.Значение;
			Элементы[ОписаниеКартинки.ИмяРеквизита].ПутьКДанным = ОписаниеКартинки.ИмяРеквизита;
		КонецЦикла;
		
	КонецЕсли;
	
	Если Элементы.СтраницыКарусель.ПодчиненныеЭлементы.Количество() = НовыеРеквизиты.КартинкиВХранилище.Количество() Тогда
		// Если в выведены только картинки через адрес в хранилище, то они выводятся меньшего размера.
		// Добавляем скрытую страницу с текстом, чтобы высота всегда была одинаковой.
		
		Идентификатор = ПанельПомощьСлужебный.НовыйИдентификаторДляИмени();
		ИмяСтраницы = "СтраницаКарусель_" + Идентификатор;
		НоваяСтраница = Элементы.Добавить(
			ИмяСтраницы,
			Тип("ГруппаФормы"),
			Элементы.СтраницыКарусель);
		НоваяСтраница.Вид = ВидГруппыФормы.Страница;
		НоваяСтраница.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		НоваяСтраница.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
		НоваяСтраница.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
		НоваяСтраница.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
		НоваяСтраница.РазрешитьИзменениеСостава = Ложь;
		НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ВывестиТекстКарусели(
			НоваяСтраница,
			Идентификатор,
			"Заглушка",
			"Заглушка",
			КешФормы.ПараметрыЭлементов.Получить("ШиринаТекстКарусель"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьСтраницуКарусели(
		Идентификатор,
		КартинкаСообщения,
		ЗаголовокСообщения,
		ТекстСообщения,
		НовыеРеквизиты,
		СсылкаКартинки)
	
	ВыводитьТекст = (КартинкаСообщения.Значение = Неопределено);
	
	ШиринаТекста = КешФормы.ПараметрыЭлементов.Получить("ШиринаТекстКарусель");
	ШиринаКартинки = КешФормы.ПараметрыЭлементов.Получить("ШиринаКартинкаКарусель");
	
	// Кнопка переключения
	НовыеРеквизиты.Переключатели.Добавить(
		Новый РеквизитФормы(
			"КарусельПереключатель_" + Идентификатор,
			Новый ОписаниеТипов("Число"),
			,
			ЗаголовокСообщения));
	
	// Страница
	ИмяСтраницы = "СтраницаКарусель_" + Идентификатор;
	НоваяСтраница = Элементы.Добавить(
		ИмяСтраницы,
		Тип("ГруппаФормы"),
		Элементы.СтраницыКарусель);
	НоваяСтраница.Вид = ВидГруппыФормы.Страница;
	НоваяСтраница.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	НоваяСтраница.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	НоваяСтраница.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяСтраница.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	НоваяСтраница.РазрешитьИзменениеСостава = Ложь;
	
	Если ВыводитьТекст Тогда
		
		НоваяСтраница.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ВывестиТекстКарусели(
			НоваяСтраница,
			Идентификатор,
			ЗаголовокСообщения,
			ТекстСообщения,
			ШиринаТекста);
		
	Иначе
		ИмяКартинки = "КартинкаКарусели_" + Идентификатор;
		
		Если КартинкаСообщения.Тип = ТипКартинкиКартинка() Тогда
		
			НоваяКартинка = Элементы.Добавить(
				ИмяКартинки,
				Тип("ДекорацияФормы"),
				НоваяСтраница);
			НоваяКартинка.Вид = ВидДекорацииФормы.Картинка;
			НоваяКартинка.Картинка = КартинкаСообщения.Значение;
			НоваяКартинка.Гиперссылка = Истина;
			НоваяКартинка.Подсказка = ЗаголовокСообщения;
			НоваяКартинка.Высота = 2;
			НоваяКартинка.АвтоМаксимальнаяВысота = Ложь;
			НоваяКартинка.АвтоМаксимальнаяШирина = Ложь;
			НоваяКартинка.МаксимальнаяВысота = 2;
			НоваяКартинка.МаксимальнаяШирина = ШиринаКартинки;
			НоваяКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			НоваяКартинка.РастягиватьПоГоризонтали = Истина;
			НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
			НоваяКартинка.УстановитьДействие("Нажатие", "Подключаемый_КартинкаКаруселиНажатие");
			
			КешФормы.ПрикладныеОбъекты.Вставить(
				ИмяКартинки,
				ОписаниеПрикладногоОбъекта(
					ТипКартинкаКарусели(),
					СсылкаКартинки));
			
		ИначеЕсли КартинкаСообщения.Тип = ТипКартинкиАдресВХранилище() Тогда
			
			НовыеРеквизиты.КартинкиВХранилище.Добавить(
				Новый Структура("ИмяРеквизита, Значение",
					ИмяКартинки,
					КартинкаСообщения.Значение));
			
			НоваяКартинка = Элементы.Добавить(
				ИмяКартинки,
				Тип("ПолеФормы"),
				НоваяСтраница);
			НоваяКартинка.Вид = ВидПоляФормы.ПолеКартинки;
			НоваяКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
			НоваяКартинка.Рамка = РамкиСтиля.БезРамки;
			НоваяКартинка.Гиперссылка = Истина;
			НоваяКартинка.Подсказка = ЗаголовокСообщения;
			НоваяКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
			НоваяКартинка.АвтоМаксимальнаяШирина = Ложь;
			НоваяКартинка.МаксимальнаяШирина = ШиринаКартинки;
			НоваяКартинка.РастягиватьПоГоризонтали = Истина;
			НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
			НоваяКартинка.УстановитьДействие("Нажатие", "Подключаемый_КартинкаКаруселиНажатиеСтандартнаяОбработка");
			
			КешФормы.ПрикладныеОбъекты.Вставить(
				ИмяКартинки,
				ОписаниеПрикладногоОбъекта(
					ТипКартинкаКарусели(),
					СсылкаКартинки));
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиТекстКарусели(
		СтраницаДляВывода,
		Идентификатор,
		ЗаголовокСообщения,
		ТекстСообщения,
		ШиринаТекста)
	
	// Картинка слева для выравнивания по высоте
	НоваяКартинка = Элементы.Добавить(
		"КартинкаКаруселиВыравниваниеЛево_" + Идентификатор,
		Тип("ДекорацияФормы"),
		СтраницаДляВывода);
	НоваяКартинка.Вид = ВидДекорацииФормы.Картинка;
	НоваяКартинка.Ширина = 1;
	НоваяКартинка.Высота = 2;
	НоваяКартинка.Доступность = Ложь;
	
	// Группа для текста сообщения
	НоваяГруппа = Элементы.Добавить(
		"ГруппаТекстСообщенияКарусели_" + Идентификатор,
		Тип("ГруппаФормы"),
		СтраницаДляВывода);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	НоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	НоваяГруппа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяГруппа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	НоваяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	НоваяГруппа.РазрешитьИзменениеСостава = Ложь;
	
	// Заголовок сообщения
	ДекорацияЗаголовок = Элементы.Добавить(
		"ЗаголовокСообщенияКарусели_" + Идентификатор,
		Тип("ДекорацияФормы"),
		НоваяГруппа);
	ДекорацияЗаголовок.Заголовок = ЗаголовокСообщения;
	ДекорацияЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
	ДекорацияЗаголовок.АвтоМаксимальнаяВысота = Ложь;
	ДекорацияЗаголовок.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияЗаголовок.МаксимальнаяВысота = 1;
	ДекорацияЗаголовок.МаксимальнаяШирина = ШиринаТекста;
	ДекорацияЗаголовок.РастягиватьПоГоризонтали = Истина;
	ДекорацияЗаголовок.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ДекорацияЗаголовок.УстановитьДействие(
		"ОбработкаНавигационнойСсылки",
		"Подключаемый_КарусельОбработкаНавигационнойСсылки");
	
	// Текст сообщения
	ДекорацияТекст = Элементы.Добавить(
		"ТекстСообщенияКарусели_" + Идентификатор,
		Тип("ДекорацияФормы"),
		НоваяГруппа);
	ДекорацияТекст.Заголовок = ТекстСообщения;
	ДекорацияТекст.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	ДекорацияТекст.АвтоМаксимальнаяВысота = Ложь;
	ДекорацияТекст.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияТекст.МаксимальнаяВысота = 1;
	ДекорацияТекст.МаксимальнаяШирина = ШиринаТекста;
	ДекорацияТекст.РастягиватьПоГоризонтали = Истина;
	ДекорацияТекст.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	ДекорацияТекст.УстановитьДействие(
		"ОбработкаНавигационнойСсылки",
		"Подключаемый_КарусельОбработкаНавигационнойСсылки");
	
	// Картинка справа для выравнивания по высоте и корректного центрирования текста
	НоваяКартинка = Элементы.Добавить(
		"КартинкаКаруселиВыравниваниеПраво_" + Идентификатор,
		Тип("ДекорацияФормы"),
		СтраницаДляВывода);
	НоваяКартинка.Вид = ВидДекорацииФормы.Картинка;
	НоваяКартинка.Ширина = 1;
	НоваяКартинка.Высота = 2;
	НоваяКартинка.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкуПереключения(Идентификатор, Предыдущий, Следующий, Заголовок)
	
		ИмяПереключателя = "КарусельПереключатель_" + Идентификатор;
		
		НоваяКартинка = Элементы.Добавить(
			ИмяПереключателя,
			Тип("ПолеФормы"),
			Элементы.ГруппаПереключательКарусели);
		НоваяКартинка.Вид = ВидПоляФормы.ПолеКартинки;
		НоваяКартинка.Рамка = РамкиСтиля.БезРамки;
		НоваяКартинка.ПутьКДанным = ИмяПереключателя;
		НоваяКартинка.КартинкаЗначений = БиблиотекаКартинок.КоллекцияПереключателей;
		НоваяКартинка.Гиперссылка = Истина;
		НоваяКартинка.УстановитьДействие("Нажатие", "Подключаемый_КарусельПереходНажатие");
		НоваяКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НоваяКартинка.Подсказка = Заголовок;
		
		НоваяКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
		ЭтотОбъект[ИмяПереключателя] = 2;
		
		КешФормы.ПрикладныеОбъекты.Вставить(
			ИмяПереключателя,
			ОписаниеПрикладногоОбъекта(
				ТипПереключательКарусели(),
				Идентификатор));
		
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьКарусель(НовыйИдентификатор)

	Если НовыйИдентификатор = "Предыдущий"
		Или НовыйИдентификатор = "Следующий" Тогда
		
		ОписаниеЭлемента = КешФормы.ИдентификаторыКарусели.Получить(КарусельТекущееСообщение);
		Если ОписаниеЭлемента = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НовыйИдентификатор = ОписаниеЭлемента[НовыйИдентификатор];
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйИдентификатор) Тогда
		
		ИмяСтраницы = "СтраницаКарусель_" + НовыйИдентификатор;
		ИмяПереключателяНовый = "КарусельПереключатель_" + НовыйИдентификатор;
		ИмяПереключателяСтарый = "КарусельПереключатель_" + КарусельТекущееСообщение;
		
		Элементы.СтраницыКарусель.ТекущаяСтраница = Элементы[ИмяСтраницы];
		
		Если Элементы.ГруппаПереключательКарусели.Видимость Тогда
			ЭтотОбъект[ИмяПереключателяНовый] = 1;
			ЭтотОбъект[ИмяПереключателяСтарый] = 2;
		КонецЕсли;
		
		КарусельТекущееСообщение = НовыйИдентификатор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтолистаниеКарусели()
	
	ПереключитьКарусель("Следующий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВыключитьАвтолистаниеКарусели(Включить = Истина)
	
	Если КарусельИнтервалАвтолистания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Включить Тогда
		ПодключитьОбработчикОжидания("АвтолистаниеКарусели", КарусельИнтервалАвтолистания);
	Иначе
		ОтключитьОбработчикОжидания("АвтолистаниеКарусели");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КартинкаСообщенияКарусели(СообщениеКарусели, КоличествоКолонок)
	
	КартинкаСообщения = Новый Структура(
		"Значение, Тип, Пустая",
		Неопределено,
		"Картинка",
		Истина);
	
	Если СообщениеКарусели.Картинки <> Неопределено Тогда
		
		ВзятьПоУмолчанию = Истина;
		
		Если КоличествоКолонок = 2 Тогда
			КартинкаСообщения = ДанныеКартинкиДляВывода(
				СообщениеКарусели.Картинки.Картинка2);
		ИначеЕсли КоличествоКолонок = 4 Тогда
			КартинкаСообщения = ДанныеКартинкиДляВывода(
				СообщениеКарусели.Картинки.Картинка4);
		Иначе
			КартинкаСообщения = ДанныеКартинкиДляВывода(
				СообщениеКарусели.Картинки.ПоУмолчанию);
			ВзятьПоУмолчанию = Ложь;
		КонецЕсли;
		
		Если ВзятьПоУмолчанию
			И (КартинкаСообщения.Значение = Неопределено
			Или КартинкаСообщения.Пустая) Тогда
			КартинкаСообщения = ДанныеКартинкиДляВывода(
				СообщениеКарусели.Картинки.ПоУмолчанию);
		КонецЕсли;
		
		// Очищаем картинки, чтобы не висели в памяти не нужные варианты.
		СообщениеКарусели.Картинки.Очистить();
		
	КонецЕсли;
	
	Если КартинкаСообщения.Пустая Тогда
		КартинкаСообщения.Значение = Неопределено;
	КонецЕсли;
	
	Возврат КартинкаСообщения;
	
КонецФункции

#КонецОбласти

#Область Карточки

&НаСервере
Процедура ВывестиКарточки(Карточки, Документация, ОтветыНаВопросы)
	
	КоличествоКолонок = КешФормы.ПараметрыЭлементов.Получить("КоличествоКолонок");
	ПараметрыВывода = ПанельПомощьСлужебный.НовыйПараметрыВыводаКарточек(КоличествоКолонок);
	ПараметрыВывода.РодительКарточки = Элементы.ГруппаКарточки;
	
	ПанельПомощьСлужебный.ВывестиТиповыеКарточки(
		ЭтотОбъект,
		ПараметрыВывода,
		Документация,
		ОтветыНаВопросы);
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, ЭтотОбъект);
	Если Эталон.БИП_ПанельПомощьПараметры <> Неопределено Тогда
		Для Каждого КлючЗначение Из ПараметрыВывода.ОписаниеКарточек Цикл
			Эталон.БИП_ПанельПомощьПараметры.ТиповыеКарточки.Вставить(
				КлючЗначение.Ключ,
				КлючЗначение.Значение);
			Эталон.БИП_ПанельПомощьПараметры.Команды.Вставить(
				КлючЗначение.Ключ,
				"Карточка");
		КонецЦикла;
		КешФормы.ВремяОбновления = ТекущаяУниверсальнаяДатаВМиллисекундах();
	КонецЕсли;
	
	ПараметрыВывода.ОписаниеКарточек.Очистить();
	
	Для Каждого ОписаниеКарточки Из Карточки Цикл
		ПанельПомощьСлужебный.ВывестиКарточкуОбщий(
			ЭтотОбъект,
			ОписаниеКарточки,
			ПараметрыВывода);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из ПараметрыВывода.ОписаниеКарточек Цикл
		КешФормы.ПрикладныеОбъекты.Вставить(
			КлючЗначение.Ключ,
			ОписаниеПрикладногоОбъекта(
				ТипКарточка(),
				КлючЗначение.Значение));
		КешФормы.КомандыКарточки.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Если Элементы.ГруппаКарточки.ПодчиненныеЭлементы.Количество() > 0 Тогда
		ЕстьЭлементыНаОсновной = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РезультатПоиска

&НаКлиенте
Процедура ПриЗавершенииПоиска(РезультатОперации, ДополнительныеПараметры) Экспорт

	Если РезультатОперации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПанельПомощьКлиент.УстановитьКартинкуСтрокиПоиска(ЭтотОбъект);
	
	Если РезультатОперации.Статус = "Ошибка" Тогда
		ОчиститьРезультатыПоиска();
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультатПоиска;
		Элементы.СтраницаРезультатПоиска.Видимость = Истина;
		Элементы.ГруппаПодвал.Видимость = Истина;
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить поиск информации:
			|
			|%1
			|
			|<a href=""НеНайденоПереходНаИТС"">Перейти на сайт its.1c.ru для тонкой настройки параметров запроса.</a>'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(РезультатОперации.ИнформацияОбОшибке));
		Элементы.ДекорацияОшибка.Видимость = Истина;
		Элементы.ДекорацияОшибка.Заголовок = СтроковыеФункцииКлиент.ФорматированнаяСтрока(ТекстОшибки);
		ВключитьВыключитьАвтолистаниеКарусели(Ложь);
		Возврат;
	КонецЕсли;
	
	ВывестиРезультатПоиска(
		РезультатОперации.АдресРезультата,
		ДополнительныеПараметры);
	
	ВключитьВыключитьАвтолистаниеКарусели(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРезультатыПоиска()
	
	Элементы.ДекорацияОшибка.Видимость = Ложь;
	Элементы.ДекорацияНеНайдено.Видимость = Ложь;
	Элементы.ГруппаСтраницыРезультатаПоиска.Видимость = Ложь;
	
	КешФормы.РезультатПоискаСсылки.Очистить();
	КешФормы.РезультатПоискаНомераСтраницПерехода = ОбнулитьНомераПерехода();
	КешФормы.РезультатПоискаВсегоСтраниц = 0;
	КешФормы.РезультатПоискаТекущаяСтраница = 0;
	
	КешФормы.ВремяОбновления = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого РезультатПоискаКарточка Из Элементы.СтраницаРезультатПоискаПрокрутка.ПодчиненныеЭлементы Цикл
		УдаляемыеЭлементы.Добавить(РезультатПоискаКарточка);
	КонецЦикла;

	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		Элементы.Удалить(УдаляемыйЭлемент);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВывестиРезультатПоиска(Знач АдресРезультата, Знач ДополнительныеПараметры)
	
	ОчиститьРезультатыПоиска();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРезультатПоиска;
	Элементы.СтраницаРезультатПоиска.Видимость = Истина;
	Элементы.ГруппаПодвал.Видимость = Истина;
	
	РезультатОперации = ПолучитьИзВременногоХранилища(АдресРезультата); // см. ПанельПомощьСлужебный.ПоискВСервисе
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось выполнить поиск информации:
			|
			|%1
			|
			|<a href=""НеНайденоПереходНаИТС"">Перейти на сайт its.1c.ru для тонкой настройки параметров запроса.</a>'"),
			РезультатОперации.СообщениеОбОшибке);
		Элементы.ДекорацияОшибка.Видимость = Истина;
		Элементы.ДекорацияОшибка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеСервиса = РезультатОперации.РезультатПоиска;
	Если ДанныеСервиса = Неопределено Тогда
		Элементы.ДекорацияНеНайдено.Видимость = Истина;
		Элементы.ДекорацияОтступПодвалЛевоЛоготип.Видимость = Истина;
		Элементы.ГруппаСтраницыРезультатаПоиска.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	КоличествоВсего = ДанныеСервиса.Получить("count");
	ВсегоСтраниц = ДанныеСервиса.Получить("pages");
	Данные = ДанныеСервиса.Получить("items");
	
	Элементы.ПереходПоследняя.Заголовок = ВсегоСтраниц;
	
	Если ТипЗнч(Данные) <> Тип("Массив")
		Или Данные.Количество() = 0 Тогда
		Элементы.ДекорацияНеНайдено.Видимость = Истина;
		Элементы.ДекорацияОтступПодвалЛевоЛоготип.Видимость = Истина;
		Элементы.ГруппаСтраницыРезультатаПоиска.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияНеНайдено.Видимость = Ложь;
		Элементы.ДекорацияОтступПодвалЛевоЛоготип.Видимость = Ложь;
		Элементы.ГруппаСтраницыРезультатаПоиска.Видимость = Истина;
	КонецЕсли;
	
	Если Не ЭтоИнтерфейс85 Тогда
		Элементы.Добавить(
			"РезультатПустышкаДо",
			Тип("ДекорацияФормы"),
			Элементы.СтраницаРезультатПоискаПрокрутка);
	КонецЕсли;
	
	РезультатыПоиска.Очистить();
	
	Для Каждого ЭлементПоиска Из Данные Цикл
		
		ТекстЭлемента = ЭлементПоиска.Получить("snippet_text");
		Если ТипЗнч(ТекстЭлемента) = Тип("Массив") Тогда
			ТекстЭлемента = СтрСоединить(ТекстЭлемента, Символы.ПС);
		КонецЕсли;
		
		ДобавитьРезультатПоискаВТаблицу(
			ЭлементПоиска.Получить("url"),
			ЭлементПоиска.Получить("title"),
			ТекстЭлемента,
			ЭлементПоиска.Получить("datetime"));
		
	КонецЦикла;
	
	ТекущаяСтраница = ДополнительныеПараметры.НомерСтраницы;
	
	Если ТекущаяСтраница = 0 Тогда
		ТекущаяСтраница = 1;
	КонецЕсли;
	КешФормы.РезультатПоискаТекущаяСтраница = ТекущаяСтраница;
	
	ПанельПомощьПереопределяемый.ПриПолученииРезультатовПоиска(
		РезультатыПоиска,
		ТекущаяСтраница,
		ВсегоСтраниц);
	
	Для Каждого СтрокаРезультата Из РезультатыПоиска Цикл
		СоздатьКарточкиРезультатПоиска(СтрокаРезультата);
	КонецЦикла;
	
	Элементы.ДекорацияНайденоКоличество.Подсказка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выведено %1 записей из %2.
		|
		|Воспользуйтесь поиском непосредственно на сайте 1С:ИТС.
		|Это позволит выполнить более тонкую настройку и искать информацию с использованием ИИ помощника 1С:Напарник.'"),
		РезультатыПоиска.Количество(),
		КоличествоВсего);
	
	РезультатыПоиска.Очистить();
	
	КешФормы.РезультатПоискаНомераСтраницПерехода = ОбнулитьНомераПерехода();
	КешФормы.РезультатПоискаВсегоСтраниц = ВсегоСтраниц;
	
	ВыполнитьПереходНаСтраницу(КешФормы.РезультатПоискаТекущаяСтраница);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРезультатПоискаВТаблицу(Ссылка, Заголовок, Текст, Дата)
	
	НоваяСтрока = РезультатыПоиска.Добавить();
	
	НоваяСтрока.Ссылка = Ссылка;
	НоваяСтрока.Заголовок = Заголовок;
	НоваяСтрока.Текст = Текст;
	НоваяСтрока.Дата = Дата;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКарточкиРезультатПоиска(СтрокаРезультата)
	
	Идентификатор = Строка(Новый УникальныйИдентификатор);
	Идентификатор = СтрЗаменить(Идентификатор, "-", "");
	
	КешФормы.РезультатПоискаСсылки.Вставить(Идентификатор, СтрокаРезультата.Ссылка);
	КешФормы.ВремяОбновления = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ШиринаЭлементов = КешФормы.ПараметрыЭлементов.Получить("ШиринаРезультатПоиска");
	
	НоваяГруппа = Элементы.Добавить(
		"РезультатПоиска_" + Идентификатор,
		Тип("ГруппаФормы"),
		Элементы.СтраницаРезультатПоискаПрокрутка);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьКакКарточку = Истина;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НоваяГруппа.Заголовок = НСтр("ru = 'Результат поиска'");
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	НоваяГруппа.РастягиватьПоГоризонтали = Истина;
	НоваяГруппа.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	НоваяГруппа.Гиперссылка = Истина;
	НоваяГруппа.Ширина = ШиринаЭлементов;
	НоваяГруппа.РазрешитьИзменениеСостава = Ложь;
	НоваяГруппа.УстановитьДействие(
		"Нажатие",
		"Подключаемый_ОткрытьСсылкуРезультатПоиска");
	
	ГруппаЗаголовок = Элементы.Добавить(
		"РезультатПоискаГруппаЗаголовок_" + Идентификатор,
		Тип("ГруппаФормы"),
		НоваяГруппа);
	ГруппаЗаголовок.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЗаголовок.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаЗаголовок.Заголовок = НСтр("ru = 'Результат поиска (заголовок)'");
	ГруппаЗаголовок.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаЗаголовок.ОтображатьЗаголовок = Ложь;
	ГруппаЗаголовок.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
	ГруппаЗаголовок.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Нет;
	ГруппаЗаголовок.РазрешитьИзменениеСостава = Ложь;
	
	ДекорацияЗаголовок = Элементы.Добавить(
		"РезультатПоискаЗаголовок_" + Идентификатор,
		Тип("ДекорацияФормы"),
		ГруппаЗаголовок);
	ДекорацияЗаголовок.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияЗаголовок.Шрифт = ШрифтыСтиля.ЗаголовокТретьегоУровня;
	ДекорацияЗаголовок.ЦветТекста = ЦветаПалитры.ВторойБрендовый;
	ДекорацияЗаголовок.Заголовок = СтрокаРезультата.Заголовок;
	ДекорацияЗаголовок.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияЗаголовок.МаксимальнаяШирина = ШиринаЭлементов;
	Если ЭтоМобильныйКлиент И Не ЭтоИнтерфейс85 Тогда
		ДекорацияЗаголовок.Гиперссылка = Истина;
		ДекорацияЗаголовок.УстановитьДействие(
			"Нажатие",
			"Подключаемый_ОткрытьСсылкуРезультатПоиска");
	КонецЕсли;
	
	Если БуферОбменаДоступен Тогда
		ДекорацияЗаголовокКопировать = Элементы.Добавить(
			"РезультатПоискаЗаголовокКопировать_" + Идентификатор,
			Тип("ДекорацияФормы"),
			ГруппаЗаголовок);
		ДекорацияЗаголовокКопировать.Вид = ВидДекорацииФормы.Картинка;
		ДекорацияЗаголовокКопировать.Картинка = БиблиотекаКартинок.КатегорииКопировать;
		ДекорацияЗаголовокКопировать.Гиперссылка = Истина;
		ДекорацияЗаголовокКопировать.Подсказка = НСтр("ru = 'Копировать адрес ссылки'");
		ДекорацияЗаголовокКопировать.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		ДекорацияЗаголовокКопировать.УстановитьДействие(
			"Нажатие",
			"Подключаемый_КопироватьСсылкуРезультатПоиска");
	КонецЕсли;
	
	ДекорацияТекст = Элементы.Добавить(
		"РезультатПоискаТекст_" + Идентификатор,
		Тип("ДекорацияФормы"),
		НоваяГруппа);
	ДекорацияТекст.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияТекст.Шрифт = ШрифтыСтиля.ТекстТретьегоУровня;
	ДекорацияТекст.Заголовок = СтрокаРезультата.Текст;
	ДекорацияТекст.АвтоМаксимальнаяШирина = Ложь;
	ДекорацияТекст.МаксимальнаяШирина = ШиринаЭлементов;
	
	ДекорацияДата = Элементы.Добавить(
		"РезультатПоискаДата_" + Идентификатор,
		Тип("ДекорацияФормы"),
		НоваяГруппа);
	ДекорацияДата.Вид = ВидДекорацииФормы.Надпись;
	ДекорацияДата.Шрифт = ШрифтыСтиля.ПодзаголовокПервогоУровня;
	ДекорацияДата.Заголовок = Формат(СтрокаРезультата.Дата, "ДЛФ=D");
	
	Если Не ЭтоИнтерфейс85 Тогда
		Элементы.Добавить(
			"РезультатПустышка_" + Идентификатор,
			Тип("ДекорацияФормы"),
			НоваяГруппа);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторРезультатаПоискаПоИмениЭлемента(ИмяЭлемента)
	
	Результат = СтрЗаменить(ИмяЭлемента, "РезультатПоиска_", "");
	Результат = СтрЗаменить(Результат, "РезультатПоискаГруппаЗаголовок_", "");
	Результат = СтрЗаменить(Результат, "РезультатПоискаЗаголовок_", "");
	Результат = СтрЗаменить(Результат, "РезультатПоискаЗаголовокКопировать_", "");
	Результат = СтрЗаменить(Результат, "РезультатПоискаТекст_", "");
	Результат = СтрЗаменить(Результат, "РезультатПоискаДата_", "");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьПоискСтраница(НомерСтраницы)
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, ЭтотОбъект);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПанельПомощьКлиент.ВыполнитьПоискВСервисе(
		ЭтотОбъект,
		Эталон.БИП_ПанельПомощьПараметры,
		НомерСтраницы);
	
КонецПроцедуры

#Область ПереходПоСтраницам

&НаКлиенте
Процедура НажатиеКнопкиПерехода(НомерСтраницы)
	
	Если НомерСтраницы = КешФормы.РезультатПоискаТекущаяСтраница
		Или НомерСтраницы <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НомерСтраницы > КешФормы.РезультатПоискаВсегоСтраниц Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Переход на страницу с номером больше %1 не поддерживается.
			|Уточните параметры поиска.'"),
			КешФормы.РезультатПоискаВсегоСтраниц);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ЗапуститьПоискСтраница(НомерСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереходПоНомеруОбщий()
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("ВыбораСтраницыРезультатаПоискаЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура(
		"МаксимальноеЗначение, ТекущееЗначение, ДоступноСтраниц",
		КешФормы.РезультатПоискаВсегоСтраниц,
		КешФормы.РезультатПоискаТекущаяСтраница,
		КешФормы.РезультатПоискаВсегоСтраниц);
	
	ОткрытьФорму(
		"ОбщаяФорма.ВыборСтраницыДляПерехода",
		ПараметрыФормы,
		УникальныйИдентификатор,
		,
		,
		,
		ОповещениеОВыборе);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПереходНаСтраницу(Знач НомерСтраницы)
	
	ВсегоСтраниц = КешФормы.РезультатПоискаВсегоСтраниц;
	КешФормы.РезультатПоискаНомераСтраницПерехода = ОбнулитьНомераПерехода(ВсегоСтраниц);
	НомераСтраницПерехода = КешФормы.РезультатПоискаНомераСтраницПерехода;
	
	Если ВсегоСтраниц = 0 Тогда
		Элементы.КнопкиПерехода.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.КнопкиПерехода.Видимость = Истина;
	КонецЕсли;
	
	ОбычныйШрифт = Новый Шрифт();
	ШрифтВыбраннойКнопки = ШрифтыСтиля.ВажнаяНадписьШрифт;
	
	Для Каждого Кнопка Из Элементы.КнопкиПерехода.ПодчиненныеЭлементы Цикл
		Кнопка.Видимость = Ложь;
		Кнопка.Шрифт = ОбычныйШрифт;
	КонецЦикла;
	
	Элементы.ПереходПервая.Видимость = ВсегоСтраниц > 0;
	Элементы.ПереходПоследняя.Видимость = ВсегоСтраниц > 1;
	Элементы.ПереходПоследняя.Заголовок = ВсегоСтраниц;
	
	ВидимостьСтрелки = Ложь;
	
	ИмяТекущейКнопки = "";
	Если НомерСтраницы = 1 Тогда
		ИмяТекущейКнопки = "ПереходПервая";
	ИначеЕсли НомерСтраницы = ВсегоСтраниц Тогда
		ИмяТекущейКнопки = "ПереходПоследняя";
	КонецЕсли;
	
	Если ВсегоСтраниц <= 2 Тогда
		Элементы[ИмяТекущейКнопки].Шрифт = ШрифтВыбраннойКнопки;
		Возврат;
		
	ИначеЕсли ВсегоСтраниц <= 6 Тогда
		
		Для ном = 1 По ВсегоСтраниц - 2 Цикл
			
			ИмяКнопки = "Переход" + ном;
			Элементы[ИмяКнопки].Видимость = Истина;
			Элементы[ИмяКнопки].Заголовок = Формат(ном + 1, "ЧГ=");
			НомераСтраницПерехода["Переход" + ном] = ном + 1;
			
			Если НомерСтраницы = ном + 1 Тогда
				ИмяТекущейКнопки = ИмяКнопки;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ВидимостьСтрелки = Истина;
		
		Если НомерСтраницы <= 3 Тогда
			
			Для ном = 1 По 4 Цикл
				
				ИмяКнопки = "Переход" + ном;
				Элементы[ИмяКнопки].Видимость = Истина;
				Элементы[ИмяКнопки].Заголовок = Формат(ном + 1, "ЧГ=");
				НомераСтраницПерехода["Переход" + ном] = ном + 1;
				
				Если НомерСтраницы = ном + 1 Тогда
					ИмяТекущейКнопки = ИмяКнопки;
				КонецЕсли;
				
			КонецЦикла;
			
			Элементы.ПереходПоНомеруПраво.Видимость = Истина;
			
		ИначеЕсли НомерСтраницы > 3 
			И НомерСтраницы < (ВсегоСтраниц - 2) Тогда
			
			Элементы.Переход1.Видимость = Истина;
			Элементы.Переход1.Заголовок = Формат(НомерСтраницы - 1, "ЧГ=");
			Элементы.Переход2.Видимость = Истина;
			Элементы.Переход2.Заголовок = Формат(НомерСтраницы, "ЧГ=");
			Элементы.Переход3.Видимость = Истина;
			Элементы.Переход3.Заголовок = Формат(НомерСтраницы + 1, "ЧГ=");
			Элементы.ПереходПоНомеруЛево.Видимость = Истина;
			Элементы.ПереходПоНомеруПраво.Видимость = Истина;
			
			НомераСтраницПерехода.Переход1 = НомерСтраницы - 1;
			НомераСтраницПерехода.Переход2 = НомерСтраницы;
			НомераСтраницПерехода.Переход3 = НомерСтраницы + 1;
			
			ИмяТекущейКнопки = "Переход2";
			
		Иначе
			
			Элементы.ПереходПоНомеруЛево.Видимость = Истина;
			
			Для ном = 1 По 4 Цикл
				
				ИмяКнопки = "Переход" + ном;
				НомерСтраницыПерехода = ВсегоСтраниц - 5 + ном;
				Элементы[ИмяКнопки].Видимость = Истина;
				Элементы[ИмяКнопки].Заголовок = Формат(НомерСтраницыПерехода, "ЧГ=");
				
				НомераСтраницПерехода["Переход" + ном] = НомерСтраницыПерехода;
				
				Если НомерСтраницы = НомерСтраницыПерехода Тогда
					ИмяТекущейКнопки = ИмяКнопки;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы[ИмяТекущейКнопки].Шрифт = ШрифтВыбраннойКнопки;
	
	Если ВидимостьСтрелки Тогда
		
		Элементы.ПереходПредыдущая.Видимость = Истина;
		Элементы.ПереходПредыдущая.Доступность = НомерСтраницы <> 1;
		Элементы.ПереходСледующая.Видимость = Истина;
		Элементы.ПереходСледующая.Доступность = НомерСтраницы <> ВсегоСтраниц;
		
		НомераСтраницПерехода.ПереходПредыдущая = НомерСтраницы - 1;
		НомераСтраницПерехода.ПереходСледующая = НомерСтраницы + 1;
		
	КонецЕсли;
	
	КешФормы.ВремяОбновления = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОбнулитьНомераПерехода(Последняя = 0)
	
	Результат = Новый Структура;
	Результат.Вставить("Переход1",          1);
	Результат.Вставить("Переход2",          0);
	Результат.Вставить("Переход3",          0);
	Результат.Вставить("Переход4",          0);
	Результат.Вставить("ПереходПредыдущая", 0);
	Результат.Вставить("ПереходСледующая",  0);
	Результат.Вставить("ПереходПервая",     1);
	Результат.Вставить("ПереходПоследняя",  Последняя);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыбораСтраницыРезультатаПоискаЗавершение(
		НомерСтраницы,
		ДополнительныеПараметры) Экспорт
	
	Если НомерСтраницы <> Неопределено Тогда
		НажатиеКнопкиПерехода(НомерСтраницы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
