#Область ПрограммныйИнтерфейс

// Дополняет колонки истории взаимоотношений.
// 
// Параметры:
//  Таблица - ТаблицаЗначений
Процедура ДополнитьКолонкиИсторииВзаимоотношений(Таблица) Экспорт
	Таблица.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	Таблица.Колонки.Добавить("ЛичныеДанныеКандидата", Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
КонецПроцедуры

// Формирует запрос для поиска похожих физических лиц.
// 
// Параметры:
//  Запрос - Запрос
//  ПараметрыПоиска - см. СотрудникиКлиентСервер.ПараметрыПоискаПохожих
Процедура СформироватьЗапросПоискаПохожихФизическихЛиц(Запрос, ПараметрыПоиска) Экспорт
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТИсключаемыеФизическиеЛица
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В (&ИсключаемыеФизическиеЛица)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизическиеЛицаКандидатов.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|ГДЕ
		|	ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата = &ИсключаемыеЛичныеДанныеКандидата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ФизическиеЛица.Ссылка КАК Ссылка,
		|	ФизическиеЛица.Наименование КАК Наименование,
		|	ФизическиеЛица.УточнениеНаименования КАК УточнениеНаименования,
		|	1 КАК Приоритет,
		|	ДанныеПоискаФизическихЛиц.Телефоны КАК Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключаемыеФизическиеЛица КАК ИсключаемыеФизическиеЛица
		|		ПО ИсключаемыеФизическиеЛица.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	&НомерТелефона
		|	И ИсключаемыеФизическиеЛица.ФизическоеЛицо ЕСТЬ NULL
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование,
		|	ФизическиеЛица.УточнениеНаименования,
		|	2,
		|	ДанныеПоискаФизическихЛиц.Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключаемыеФизическиеЛица КАК ИсключаемыеФизическиеЛица
		|		ПО ИсключаемыеФизическиеЛица.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	&АдресЭП
		|	И ИсключаемыеФизическиеЛица.ФизическоеЛицо ЕСТЬ NULL
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка,
		|	ФизическиеЛица.Наименование,
		|	ФизическиеЛица.УточнениеНаименования,
		|	3,
		|	"""",
		|	""""
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключаемыеФизическиеЛица КАК ИсключаемыеФизическиеЛица
		|		ПО ИсключаемыеФизическиеЛица.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|ГДЕ
		|	ИсключаемыеФизическиеЛица.ФизическоеЛицо ЕСТЬ NULL
		|	И НЕ ФизическиеЛица.ПометкаУдаления
		|	И &ФИО";
		
	Если ЗначениеЗаполнено(ПараметрыПоиска.Телефон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерТелефона",
			"ДанныеПоискаФизическихЛиц.Телефоны ПОДОБНО &НомерТелефона");
		Запрос.УстановитьПараметр("НомерТелефона",
			"%" + ПоискФизическихЛиц.ТелефонВФорматеПоиска(ПараметрыПоиска.Телефон) + "%");
	Иначе
		Запрос.УстановитьПараметр("НомерТелефона", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыПоиска.Email) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&АдресЭП",
			"ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты ПОДОБНО &АдресЭП");
		Запрос.УстановитьПараметр("АдресЭП", "%" + ПараметрыПоиска.Email + "%");
	Иначе
		Запрос.УстановитьПараметр("АдресЭП", Ложь);
	КонецЕсли;

	Запрос.УстановитьПараметр("ИсключаемыеЛичныеДанныеКандидата", ПараметрыПоиска.Ссылка);
	
КонецПроцедуры

// Добавляет и заполняет колонку "СовпадающиеДанные" в таблице похожих кандидатов.
// 
// Параметры:
//  ТаблицаПохожих - ТаблицаЗначений -:
//   * Ссылка - СправочникСсылка.ФизическиеЛица -
//   * Наименование - Строка -
//   * Приоритет - Число -
//  ТаблицаДанных - ТаблицаЗначений
//  ИмяКолонкиПохожих - Строка
//  ИмяКолонкиДанных - Строка
Процедура ДобавитьЗаполнитьКолонкуСовпадающиеДанные(ТаблицаПохожих, ТаблицаДанных, ИмяКолонкиПохожих,
	ИмяКолонкиДанных) Экспорт

	Если ТаблицаДанных.Колонки.Найти("СовпадающиеДанные") = Неопределено Тогда
		ТаблицаДанных.Колонки.Добавить("СовпадающиеДанные", Новый ОписаниеТипов("Строка"));
	КонецЕсли;
	Если ТаблицаДанных.Колонки.Найти("КоличествоСовпадающихДанных") = Неопределено Тогда
		ТаблицаДанных.Колонки.Добавить("КоличествоСовпадающихДанных", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из ТаблицаДанных Цикл
		
		НайденныеСтроки = ТаблицаПохожих.НайтиСтроки(Новый Структура(ИмяКолонкиПохожих, ТекущаяСтрока[ИмяКолонкиДанных]));
		ОбщегоНазначенияКлиентСервер.Проверить(НайденныеСтроки.Количество() > 0,
			СтрШаблон(НСтр("ru = 'Не найдены данные %1 в таблице похожих'"), ТекущаяСтрока[ИмяКолонкиДанных]),
			"ПодборПерсоналаФормы.ДобавитьЗаполнитьКолонкуСовпадающиеДанные");
		
		КоличествоСовпадающихДанных = 0;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ТекущаяСтрока.СовпадающиеДанные = ТекущаяСтрока.СовпадающиеДанные
				+ СовпадающиеДанныеПоПриоритету()[НайденнаяСтрока.Приоритет] + ",";
			КоличествоСовпадающихДанных = КоличествоСовпадающихДанных + 1;
		КонецЦикла;
		ТекущаяСтрока.КоличествоСовпадающихДанных = КоличествоСовпадающихДанных;
		
		Если Не ПустаяСтрока(ТекущаяСтрока.СовпадающиеДанные) Тогда
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущаяСтрока.СовпадающиеДанные);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в ДополнительныеСвойства объекта физического лица связанные данные.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ФизическоеЛицоОбъект - СправочникОбъект.ФизическиеЛица
Процедура ЗаполнитьСвязанныеДанныеФизическогоЛица(Форма, ФизическоеЛицоОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(Форма.ЛичныеДанныеКандидатаСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеФизическогоЛица = КадровыйУчет.НовыеДанныеФизическогоЛица();
	
	ДополнительныеПараметры = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "АдресФотографии") Тогда
		ДополнительныеПараметры.Вставить("АдресФотографии", Форма.АдресФотографии);
	КонецЕсли;
	Справочники.ЛичныеДанныеКандидатов.ЗаполнитьДанныеФизическогоЛица(ДанныеФизическогоЛица,
		Форма.ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры);
	СвязанныеОбъекты = КадровыйУчет.СвязанныеОбъектыДанныхФизическогоЛица(ДанныеФизическогоЛица);
	СвязанныеОбъекты.Вставить("ЛичныеДанныеКандидата", Форма.ЛичныеДанныеКандидатаСсылка);
	
	ФизическоеЛицоОбъект.ДополнительныеСвойства.Вставить("СвязанныеОбъекты", СвязанныеОбъекты);
	
КонецПроцедуры

// Устанавливает параметры открытия формы физические лица с похожими данными.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ФизическиеЛицаСПохожимиДаннымиПриСозданииНаСервере(Форма) Экспорт
	
	ПараметрыФормы = Форма.Параметры;
	ДанныеКандидатов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыФормы, "ДанныеКандидатов");
	Если ДанныеКандидатов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоНайденных = ПараметрыФормы.ДанныеФизическихЛиц.Количество()
		+ ПараметрыФормы.ДанныеКандидатов.Количество();
	ПараметрыФормы.КлючНазначенияИспользования = ?(КоличествоНайденных < 2, "БезСписка", "СоСписком");
	
	ПараметрыФормы.ДанныеФизическихЛицДоступны = 
		(ПараметрыФормы.ДанныеФизическихЛиц.Количество() = 0
			Или ПараметрыФормы.ДанныеФизическихЛицДоступны)
		И (ПараметрыФормы.ДанныеКандидатов.Количество() = 0
			Или ПараметрыФормы.ДанныеКандидатовДоступны);

	ПохожиеЛюди = Новый Массив(Форма.ПохожиеЛюди);
	ЛичыеДанныеКандидатов = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеКандидатов, "ЛичныеДанныеКандидата", Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПохожиеЛюди, ЛичыеДанныеКандидатов);
	Форма.ПохожиеЛюди = Новый ФиксированныйМассив(ПохожиеЛюди);
		
	ДобавитьРеквизитыФормыПоискаОднофамильцев(Форма);
	
КонецПроцедуры

// Добавляет реквизиты в форму поиска однофамильцев.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПриЗаполненииОднофамильцев(Форма) Экспорт
	
	ДанныеКандидатов = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ДанныеКандидатов");
	Если ДанныеКандидатов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьОднофамильцев(Форма.Однофамильцы, ДанныеКандидатов);
	Форма.Однофамильцы.Сортировать("КоличествоСовпадающихДанных Убыв, ФИОПолные Возр");
	
КонецПроцедуры

// Заполняет данные физического лица по кандидату в форме физического лица.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения -
Процедура ЗаполнитьФизическоеЛицоПоКандидату(Форма) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторФормы", Форма.УникальныйИдентификатор);
	
	УстановитьПривилегированныйРежим(Истина);
	ФизическоеЛицоОбъект = Справочники.ЛичныеДанныеКандидатов.ОбъектФизическоеЛицоПоДаннымКандидата(
		Форма.ЛичныеДанныеКандидатаСсылка, ДополнительныеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Форма.ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
	Форма.ФизическоеЛицоМестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(
		Форма.ФизическоеЛицо.МестоРождения);
	Форма.АдресФотографии = ФизическоеЛицоОбъект.ДополнительныеСвойства.СвязанныеОбъекты.АдресФотографии;
	
	Для Каждого ЭлементКонтактнойИнформации Из Форма.ФизическоеЛицо.КонтактнаяИнформация Цикл
		Для Каждого ОписаниеРеквизита Из Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов Цикл
			Если ОписаниеРеквизита.Вид <> ЭлементКонтактнойИнформации.Вид Тогда
				Продолжить;
			КонецЕсли;
			ОписаниеРеквизита.Значение = ЭлементКонтактнойИнформации.Значение;
			ОписаниеРеквизита.Представление = ЭлементКонтактнойИнформации.Представление;
			Форма[ОписаниеРеквизита.ИмяРеквизита] = ЭлементКонтактнойИнформации.Представление;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗащитаПерсональныхДанных

// В форме списка кандидатов заполняет колонку с картинкой, сигнализирующей об отсутствии требуемого согласия 
// на обработку персональных данных кандидата.
// Вызывается из события ПриПолученииДанныхНаСервере формы списка.
//
// Параметры:
//	Настройки - НастройкиКомпоновкиДанных - содержит копию полных настроек динамического списка.
//	Строки - СтрокиДинамическогоСписка - коллекция содержит данные и оформление всех строк, получаемых в списке,
//	  кроме строк группировок.
Процедура СписокКандидатовПриПолученииДанныхНаСервере(Настройки, Строки) Экспорт
	
	Перем ТекущаяДата;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкрытиеПерсональныхДанныхСубъектов") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Настройки.ДополнительныеСвойства.Свойство("ТекущаяДата", ТекущаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЛичныеДанные = Новый Массив;
	СтрокиЛичныхДанных = Новый Соответствие;
	
	Кандидаты = Строки.ПолучитьКлючи(); // Массив из СправочникСсылка.Кандидаты
	ЛичныеДанныеКандидатов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Кандидаты, "ЛичныеДанные");
	
	Для Каждого Строка Из Строки Цикл
		ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.Получить(Строка.Ключ);
		ЛичныеДанные.Добавить(ЛичныеДанныеКандидата);
		СтрокиЛичныхДанных.Вставить(ЛичныеДанныеКандидата, Строка);
	КонецЦикла;

	// АПК:БЗК.277-выкл
	Субъекты = РегистрыСведений.СрокиХраненияПерсональныхДанных.СубъектыСИстекшимСрокомХранения(
		ЛичныеДанные, ТекущаяДата);
	// АПК:БЗК.277-вкл

	Для Каждого Субъект Из Субъекты Цикл
		СтрокаСписка = СтрокиЛичныхДанных.Получить(Субъект).Значение;
		СтрокаСписка.Данные["ОтсутствуетСогласие"] = 1;
	КонецЦикла;

КонецПроцедуры

// Вызывается при получении формой данных объекта. Дополняет состав элементов формы надписью о статусе согласия 
// на обработку персональных данных субъекта и декорацией отсутствия согласия. Формирует текст надписи.
//
// Параметры:
//	Форма				- ФормаКлиентскогоПриложения - форма, связанная с субъектом.
//	ТекущийОбъект		- СправочникОбъект - объект, который будет прочитан.
//	ИмяКлючевогоПоля	- Строка - "Ссылка" или заданное имя реквизита, содержащего ссылку на субъект.
//
Процедура ФормаСубъектаПриПолученииДанныхНаСервере(Форма, ТекущийОбъект, ИмяКлючевогоПоля = "Ссылка") Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкрытиеПерсональныхДанныхСубъектов") Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСведения = Элементы.Найти("ГруппаСведенияОСогласииНаОбработкуПДн");
	Если ГруппаСведения = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.ЛичныеДанныеКандидатов) Тогда
		Возврат;
	КонецЕсли;
	
	Субъект = ТекущийОбъект[ИмяКлючевогоПоля];
	
	ФизическоеЛицо = ПодборПерсонала.ФизическоеЛицоЛичныхДанныхКандидата(Субъект);
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти("ДекорацияПредупреждениеОбОтсутствииСогласия") = НеОпределено Тогда
		
		Элемент = Элементы.Добавить("ДекорацияПредупреждениеОбОтсутствииСогласия", Тип("ДекорацияФормы"), ГруппаСведения);
		Элемент.Заголовок = НСтр("ru = 'Предупреждение об отсутствии согласия'");
		Элемент.Вид = ВидДекорацииФормы.Картинка;
		Элемент.Картинка = БиблиотекаКартинок.Предупреждение;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		
	КонецЕсли;
	
	Если Элементы.Найти("СообщениеОСогласииНаОбработкуПДн") = НеОпределено Тогда
		
		Элемент = Элементы.Вставить("СообщениеОСогласииНаОбработкуПДн", Тип("ДекорацияФормы"), ГруппаСведения);
		Элемент.Заголовок = Новый ФорматированнаяСтрока("");
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элемент.АвтоМаксимальнаяШирина = Ложь;
		Элемент.УстановитьДействие("ОбработкаНавигационнойСсылки", "Подключаемый_СообщениеОСогласииОбработкаНавигационнойСсылки");
		
	КонецЕсли;
	
	ЭлементНадписи = Элементы.Найти("СообщениеОСогласииНаОбработкуПДн");
	ЭлементДекорации = Элементы.ДекорацияПредупреждениеОбОтсутствииСогласия;
	
	ГруппаСведения.Видимость = ОбщегоНазначения.СсылкаСуществует(Субъект);
	
	СтатусСогласия = СтатусСогласияНаОбработкуПДнСубъекта(Субъект);
	
	ЭлементДекорации.Видимость = СтатусСогласия.Требуется;
	ЭлементНадписи.Заголовок = СтатусСогласия.Описание;
	
КонецПроцедуры

#КонецОбласти

Процедура ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(Форма, ГруппаКоманд) Экспорт

	Если Не ПодборПерсонала.ИспользоватьКандидатов() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьКомандуДобавленияНовогоКандидата(Форма, ГруппаКоманд);	
	
КонецПроцедуры

Процедура ПриНастройкеОтбораИсторииВзаимоотношенийФизическогоЛица(Форма, ПереключательОтбора) Экспорт 

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
		Возврат;
	КонецЕсли;

	ПереключательОтбора.СписокВыбора.Добавить(3, НСтр("ru = 'Кандидаты'"));

КонецПроцедуры

// Добавляет команды в подменю "Оформить документ" для справочника "Сотрудники".
// См. СотрудникиФормыРасширенный.ОписаниеМенюВводаНаОсновании.
// 
// Параметры:
// 	ОписаниеМеню
//
Процедура ДобавитьПодменюПодбораПерсонала(ОписаниеМеню) Экспорт
	
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.Вакансии) Тогда
		Возврат;
	КонецЕсли;
	
	ПунктыМеню = Новый Массив;
	ПунктыМеню.Добавить("Справочники.Вакансии");

	Представления = Новый Соответствие;
	Представления.Вставить("Справочники.Вакансии", НСтр("ru = 'Открыть вакансию'"));

	РазделМеню = СотрудникиФормы.РазделМеню(НСтр("ru = 'Подбор персонала'"), ПунктыМеню, , Представления); 

	ОписаниеМеню.Пункты.Добавить(РазделМеню);
	
КонецПроцедуры

Процедура ДобавитьВМассивСоздаваемыеРеквизитыФормыСотрудника(МассивДобавляемыхРеквизитов, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЛичныеДанныеКандидатаСсылкаРеквизитФормы = Новый РеквизитФормы("ЛичныеДанныеКандидатаСсылка",
		Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов"));
	МассивДобавляемыхРеквизитов.Добавить(ЛичныеДанныеКандидатаСсылкаРеквизитФормы);
	
	Если ПодборПерсонала.ИспользоватьКандидатов() Тогда
		КандидатРеквизитФормы = Новый РеквизитФормы("КандидатСсылка", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
		МассивДобавляемыхРеквизитов.Добавить(КандидатРеквизитФормы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - Форма
Процедура ПриСозданииНаСервереФормыСотрудника(Форма) Экспорт

	Если Не ПодборПерсонала.ИспользоватьКандидатов() Тогда
		Возврат;
	КонецЕсли;
	
	Кандидат = ПодборПерсонала.КандидатСотрудника(Форма.СотрудникСсылка);
	
	Если Кандидат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГиперссылкаКандидата = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), Форма.Элементы.ГруппаПодборПерсонала);
	ГиперссылкаКандидата.Вид = ВидКнопкиФормы.Гиперссылка;
	
	Команда = Форма.Команды.Добавить("ОткрытьКандидатаСотрудника");
	Команда.Заголовок = НСтр("ru = 'Открыть кандидата сотрудника'");
	Команда.Подсказка = НСтр("ru = 'Перейти к кандидату'");
	Команда.Действие = "Подключаемый_ОткрытьКандидатаСотрудника";
	
	ГиперссылкаКандидата.ИмяКоманды = "ОткрытьКандидатаСотрудника";
	ГиперссылкаКандидата.Заголовок = НСтр("ru = 'О кандидате'");
	
	Форма.КандидатСсылка = Кандидат;
	
КонецПроцедуры

Процедура ЗаполнитьОжидаемыйДоходВВалютеПоУмолчанию(Настройки, Строки) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Вакансии) Тогда
		Возврат;
	КонецЕсли;

	Кандидаты = Строки.ПолучитьКлючи();
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Кандидаты);
	
	Если ДанныеКандидатов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КурсыВалют = Новый Соответствие;
	Если Настройки.ДополнительныеСвойства.Свойство("КурсыВалют") Тогда
		КурсыВалют = Настройки.ДополнительныеСвойства["КурсыВалют"];
	Иначе
		Настройки.ДополнительныеСвойства.Вставить("КурсыВалют", КурсыВалют);
	КонецЕсли;
	
	КолонкаОжидаемыйДоходВВалютеПоУмолчанию = Строки.Получить(Кандидаты[0]).Оформление.Получить("ОжидаемыйДоходВВалютеПоУмолчанию");
	КолонкаОжидаемыйДоход = Строки.Получить(Кандидаты[0]).Оформление.Получить("ОжидаемыйДоход");
	
	Для Каждого Кандидат Из ДанныеКандидатов Цикл
		СтрокаКандидат = Строки.Получить(Кандидат.Кандидат);
		Если СтрокаКандидат = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОформлениеСтроки = СтрокаКандидат.Оформление;
		Если КолонкаОжидаемыйДоходВВалютеПоУмолчанию <> Неопределено Тогда
			ОжидаемыйДоходВВалютеПоУмолчанию = ПодборПерсоналаКлиентСервер.ОжидаемыйДоходВВалютеПоУмолчанию(
				Кандидат.ОжидаемыйДоход, Кандидат.ВалютаДохода, Кандидат.ПериодичностьДохода, КурсыВалют);
			ОформлениеСтроки["ОжидаемыйДоходВВалютеПоУмолчанию"].УстановитьЗначениеПараметра("Текст", ОжидаемыйДоходВВалютеПоУмолчанию);
		КонецЕсли;
		Если КолонкаОжидаемыйДоход <> Неопределено Тогда
			Если ЗначениеЗаполнено(Кандидат.ОжидаемыйДоход) Тогда
				ОжидаемыйДоход = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 %2 %3'"),
					Кандидат.ОжидаемыйДоход, Кандидат.ВалютаДохода, Кандидат.ПериодичностьДохода);
			Иначе
				ОжидаемыйДоход = Формат(Кандидат.ОжидаемыйДоход, "ЧН=' '");
			КонецЕсли;
			ОформлениеСтроки["ОжидаемыйДоход"].УстановитьЗначениеПараметра("Текст", ОжидаемыйДоход);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#Область ПоискПохожихКандидатов

// Возвращаемое значение:
//  см. ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей
Функция ПараметрыПоискаПохожихКандидатов() Экспорт
	
	ПараметрыПоиска = ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей();
	ПараметрыПоиска.ИскатьСредиФизическихЛиц = Ложь;
	
	Возврат ПараметрыПоиска;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Фамилия - Строка -
// * Имя - Строка -
// * Отчество - Строка -
// * Телефон - Строка -
// * EMail - Строка -
// * ДанныеКандидатовДоступны - Булево -
// * ДанныеКандидатов - Массив из Структура:
//      ** ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
//      ** Наименование - Строка 
//      ** УточнениеНаименования - Строка 
//      ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица 
//      ** НомерТелефона - Строка 
//      ** Email - Строка 
//      ** Приоритет - Число 
// * КандидатУникален - Булево -
Функция НовыйРезультатПоискаПохожихКандидатов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Фамилия", "");
	Результат.Вставить("Имя", "");
	Результат.Вставить("Отчество", "");
	Результат.Вставить("Телефон", "");
	Результат.Вставить("EMail", "");
	Результат.Вставить("ДанныеКандидатовДоступны", Истина);
	Результат.Вставить("ДанныеКандидатов", Новый Массив);
	Результат.Вставить("КандидатУникален", Истина);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ПараметрыПоиска - см. ПараметрыПоискаПохожихКандидатов
// 
// Возвращаемое значение:
//  см. НовыйРезультатПоискаПохожихКандидатов
Функция ПохожиеКандидаты(ПараметрыПоиска) Экспорт

	ПараметрыПоиска = ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей(ПараметрыПоиска);
	ПараметрыПоиска.ИскатьСредиФизическихЛиц = Ложь;
	ПохожиеЛюди = ПоискФизическихЛиц.ПохожиеЛюди(ПараметрыПоиска);
	
	Возврат ПохожиеЛюди.РезультатПоискаКандидатов;
	
КонецФункции

// Подбирает похожих кандидатов.
// 
// Параметры:
//  ПараметрыПоиска - см. ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей
// 
// Возвращаемое значение:
//  см. НовыйРезультатПоискаПохожихКандидатов
Функция РезультатПоискаПохожихКандидатов(ПараметрыПоиска) Экспорт
	
	Результат = НовыйРезультатПоискаПохожихКандидатов();
	ЗаполнитьЗначенияСвойств(Результат, ПараметрыПоиска);
	
	ПараметрыПоиска.Фамилия  = СОКРЛП(ПараметрыПоиска.Фамилия);
	ПараметрыПоиска.Имя = СОКРЛП(ПараметрыПоиска.Имя);
	ПараметрыПоиска.Отчество = СОКРЛП(ПараметрыПоиска.Отчество);
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПохожих = ТаблицаПохожихКандидатов(ПараметрыПоиска);
	МассивНайденных = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаПохожих, "ЛичныеДанныеКандидата", Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если МассивНайденных.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
		
	Результат.КандидатУникален = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЛичныхДанныхКандидатов", МассивНайденных);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	ЛичныеДанныеКандидатов.Ссылка В (&МассивЛичныхДанныхКандидатов)";
	МассивДоступных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛичныеДанныеКандидата");
	
	Результат.ДанныеКандидатовДоступны = МассивДоступных.Количество() = МассивНайденных.Количество();
	ДанныеКандидатов = ПодборПерсонала.ОсновныеСведенияОЛичныхДанныхКандидатов(МассивДоступных);
	
	Если ПараметрыПоиска.ИскатьВАрхиве
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц") Тогда
		МодульАрхивФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АрхивФизическихЛиц");
		МодульАрхивФизическихЛиц.ДополнитьДанныеКандидатов(ДанныеКандидатов, МассивНайденных, Результат);
	КонецЕсли;
	
	ДобавитьЗаполнитьКолонкуСовпадающиеДанные(ТаблицаПохожих, ДанныеКандидатов, "ЛичныеДанныеКандидата",
		"ЛичныеДанныеКандидата");
	
	Результат.ДанныеКандидатов = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеКандидатов);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьИспытательныйСрок(Настройки, Строки) Экспорт
	
	ПрофилиДолжности = Строки.ПолучитьКлючи();
	ДанныеПрофилейДолжности = Справочники.ПрофилиДолжностей.ДанныеПрофилейДолжности(ПрофилиДолжности);
	
	Если ДанныеПрофилейДолжности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПрофиль = Строки.Получить(ДанныеПрофилейДолжности[0].Ссылка);
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаПрофиль.Данные, "ИспытательныйСрок") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПрофильДолжности Из ДанныеПрофилейДолжности Цикл
		
		СтрокаПрофиль = Строки.Получить(ПрофильДолжности.Ссылка);
		
		Если СтрокаПрофиль = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПрофильДолжности.ИспытательныйСрок) Тогда
			Продолжить;
		КонецЕсли;
		ОформлениеСтроки = СтрокаПрофиль.Оформление;
		ОформлениеСтроки["ИспытательныйСрок"].УстановитьЗначениеПараметра("Текст", 
			СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru = ';%1 месяц;;%1 месяца;%1 месяцев;'"), ПрофильДолжности.ИспытательныйСрок));
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПодборПерсонала") Тогда
			Возврат;
		КонецЕсли;
		
		Элементы = Форма.Элементы;
		
		НоваяГруппа = Элементы.Добавить("ДоступПоКандидатамГруппыДоступа", Тип("ГруппаФормы"),
			Элементы.ОграниченияПодробноФлаги);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НоваяГруппа.Подсказка = НСтр("ru = 'Можно ограничивать доступ по группам кандидатов. 
			|Это потребует дополнительных ресурсов - применяйте только в случае необходимости.'");
		НоваяГруппа.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		
		ИмяРеквизита = "ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов";
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево"), , , Ложь);
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Форма[ИмяРеквизита] = Константы.ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов.Получить();
		
		НовыйФлажок = Элементы.Добавить("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов", Тип("ПолеФормы"),
			НоваяГруппа);
		НовыйФлажок.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйФлажок.Заголовок = НСтр("ru = 'Доступ по группам кандидатов'");
		НовыйФлажок.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		НовыйФлажок.ПутьКДанным = ИмяРеквизита;
		НовыйФлажок.УстановитьДействие("ПриИзменении",
			"Подключаемый_ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатовПриИзменении");
	
		Если ОбщегоНазначения.ЭтоАвтономноеРабочееМесто() Тогда
			НовыйФлажок.Доступность = Ложь;
		КонецЕсли;
		
		ФорматированнаяСтрока = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<a href=""%1"">Группы кандидатов</a>'"), "e1cib/list/Справочник.ГруппыДоступаКандидатов");
		Декорация = Элементы.Добавить("ГруппыДоступаКандидатовОткрытьСписок", Тип("ДекорацияФормы"), НоваяГруппа);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
		Декорация.Заголовок = ФорматированнаяСтрока;
		Декорация.Видимость = ПолучитьФункциональнуюОпцию("ОграничиватьДоступНаУровнеЗаписейЛичныеДанныеКандидатов");
		
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ПрочитатьДанныеСвязанныеССотрудником(Форма) Экспорт
	
	Если Форма.СозданиеНового И Форма.ЛичныеДанныеКандидатаСсылка <> Неопределено
		И Не Форма.ЛичныеДанныеКандидатаСсылка.Пустая() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ФизическоеЛицоОбъект =
			Справочники.ЛичныеДанныеКандидатов.ОбъектФизическоеЛицоПоДаннымКандидата(Форма.ЛичныеДанныеКандидатаСсылка);
		Форма.ЗначениеВРеквизитФормы(ФизическоеЛицоОбъект, "ФизическоеЛицо");
		УстановитьПривилегированныйРежим(Ложь);
		
		СотрудникиФормыБазовый.ПрочитатьТекущиеДанныеСотрудника(Форма);
	Иначе
		СотрудникиФормыБазовый.ПрочитатьДанныеСвязанныеССотрудником(Форма);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ФизическоеЛицоОбъект  - СправочникОбъект.ФизическиеЛица
//  СвязанныеОбъекты - Структура
Процедура ЗаписатьСвязанныеОбъектыФизическогоЛица(ФизическоеЛицоОбъект, СвязанныеОбъекты) Экспорт
	
	Если СвязанныеОбъекты.Свойство("ЛичныеДанныеКандидата") Тогда
		РегистрыСведений.ФизическиеЛицаКандидатов.УстановитьСвязьКандидатаСФизическимЛицом(
			СвязанныеОбъекты.ЛичныеДанныеКандидата, ФизическоеЛицоОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЭтапыРаботыСКандидатамиПоУмолчанию(Форма, ЭтапыРаботыСКандидатами, ГруппаРезультатыПроверки) Экспорт
	
	Если ЭтапыРаботыСоответствуютУмолчанию(ЭтапыРаботыСКандидатами) Тогда
		ГруппаРезультатыПроверки.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ГруппаРезультатыПроверки.Видимость = Истина;
	Если Форма.Элементы.Найти("ЭтапыПоУмолчаниюПредупреждение") = Неопределено Тогда
		Картинка = Форма.Элементы.Добавить("ЭтапыПоУмолчаниюПредупреждение", Тип("ДекорацияФормы"), ГруппаРезультатыПроверки);
		Картинка.Вид = ВидДекорацииФормы.Картинка;
		Картинка.Картинка = БиблиотекаКартинок.Предупреждение32;
		Картинка.РасширеннаяПодсказка.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Состав этапов работы отличается от предусмотренных программой по умолчанию.
				 |<a href = ""УстановитьЭтапыПоУмолчанию"">Нажмите здесь</a>, чтобы установить состав этапов по умолчанию.'"));
		Картинка.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
		Картинка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("ИспользоватьПодборПерсонала", Форма.ИспользоватьПодборПерсонала);
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("ИспользоватьПодборПерсонала") Тогда
		Форма["ИспользоватьПодборПерсонала"] = СохраненныеНастройки["ИспользоватьПодборПерсонала"];
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользоватьПодборПерсонала = Константы.ИспользоватьПодборПерсонала.Получить();
	
КонецПроцедуры

#КонецОбласти

Процедура УстановитьВидимостьЭлементаФормы(Элемент) Экспорт
	
	РекрутинговыеСайтыФормы.УстановитьВидимостьЭлементаФормы(Элемент);
	
КонецПроцедуры

Функция НавигациннаяСсылкаЭтапаКандидата(ЭтапРаботы) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("СтрокаНавигационнойСсылкиЭтапаКандидатов", 
		"ЭтапРаботы", ЭтапРаботы, Метаданные.ОпределяемыеТипы.ЭтапРаботыСКандидатами.Тип);
	
	Строка = "ЭтапКандидата";
	Если ТипЗнч(ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСКандидатами") Тогда
		Строка = Строка + "_" + Метаданные.Справочники.ЭтапыРаботыСКандидатами.ПолноеИмя();
		Строка = Строка + "_" + ?(ЭтапРаботы.Пустая(), ИдентификаторПустогоЭтапа(), 
			ЭтапРаботы.УникальныйИдентификатор());
	ИначеЕсли ТипЗнч(ЭтапРаботы) = Тип("ПеречислениеСсылка.ЭтапыРаботыСКандидатами") Тогда
		Строка = Строка + "_" + Метаданные.Перечисления.ЭтапыРаботыСКандидатами.ПолноеИмя();
		Строка = Строка + "_" + ?(ЭтапРаботы.Пустая(), ИдентификаторПустогоЭтапа(), 
			ОбщегоНазначения.ИмяЗначенияПеречисления(ЭтапРаботы));
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Неожиданное значение этап работы = %1'"), ЭтапРаботы), 
			Метаданные.Справочники.Вакансии.ПолноеИмя());
	КонецЕсли;

	Возврат Строка;
	
КонецФункции

Функция ЭтапКандидатаПоНавигационнойСсылке(НавигационнаяСсылка) Экспорт
	
	Части = СтрРазделить(НавигационнаяСсылка, "_");
	ОбщегоНазначенияКлиентСервер.Проверить(Части.Количество() = 3, 
		СтрШаблон(НСтр("ru = 'Некорректная навигационная ссылка этапа кандидатов %1'"), НавигационнаяСсылка), 
		"ПодборПерсоналаФормы.ЭтапКандидатаПоНавигационнойСсылке");
	
	Если Части[1] = Метаданные.Справочники.ЭтапыРаботыСКандидатами.ПолноеИмя() Тогда
		Возврат ?(Части[2] = ИдентификаторПустогоЭтапа(), 
			Справочники.ЭтапыРаботыСКандидатами.ПустаяСсылка(), 
			Справочники.ЭтапыРаботыСКандидатами.ПолучитьСсылку(Новый УникальныйИдентификатор(Части[2])));
	ИначеЕсли Части[1] = Метаданные.Перечисления.ЭтапыРаботыСКандидатами.ПолноеИмя() Тогда
		Возврат ?(Части[2] = ИдентификаторПустогоЭтапа(), 
			Перечисления.ЭтапыРаботыСКандидатами.ПустаяСсылка(), 
			Перечисления.ЭтапыРаботыСКандидатами[Части[2]]);
	Иначе
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, 
			СтрШаблон(НСтр("ru = 'Некорректная навигационная ссылка этапа кандидатов %1'"), НавигационнаяСсылка), 
			"ПодборПерсоналаФормы.ЭтапКандидатаПоНавигационнойСсылке");
	КонецЕсли;
	
КонецФункции

Функция ИдентификаторПустогоЭтапа()
	Возврат "ПустаяСсылка";
КонецФункции

Функция СостояниеКандидатаЭтапСсылкаПоНавигационнойСтроке(НавигационнаяСсылкаФорматированнойСтроки) Экспорт

	СтрокаИдентификатора = СтрЗаменить(НавигационнаяСсылкаФорматированнойСтроки, "СостояниеКандидата_Этап_", "");
	Если СтрокаИдентификатора = "ПустаяСсылка" Тогда
		Возврат Справочники.ЭтапыРаботыСКандидатами.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Справочники.ЭтапыРаботыСКандидатами.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаИдентификатора));
	
КонецФункции

Процедура СоздатьКомандуДобавленияНовогоКандидата(Форма, ГруппаКоманд)

	Гиперссылка = Форма.Элементы.Добавить("Кнопка", Тип("КнопкаФормы"), ГруппаКоманд);
	Гиперссылка.Вид = ВидКнопкиФормы.Гиперссылка;
	
	Команда = Форма.Команды.Добавить(ПодборПерсоналаКлиентСервер.ИмяКомандыНовыйКандидатВФормеФизическиеЛица());
	Команда.Заголовок = НСтр("ru = 'Новый кандидат'");
	Команда.Подсказка = НСтр("ru = 'Зарегистрировать обращение этого человека на вакансию'");
	Команда.Действие = "Подключаемый_ПодборПерсонала";
	
	Гиперссылка.ИмяКоманды = "НовыйКандидат";
	Гиперссылка.Заголовок = НСтр("ru = 'Новый кандидат'");
	
КонецПроцедуры

// Возвращает таблицу похожих кандидатов.
// 
// Параметры:
//  ПараметрыПоиска - см. ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Приоритет - Число - 
//   	1 - если совпал телефон,
//   	2 - если совпал адрес электронной почты,
//   	3 - если совпало ФИО
//   * ЛичныеДанныеКандидата - СправочникСсылка.ЛичныеДанныеКандидатов 
//   * Наименование - Строка 
//   * УточнениеНаименования - Строка 
//   * ФИОПолные - Строка 
//   * Фамилия - Строка 
//   * Имя - Строка 
//   * Отчество - Строка 
//   * Телефоны - Строка 
//   * АдресаЭлектроннойПочты - Строка 
//   * ДатаРождения - Дата 
//   * Пол - ПеречислениеСсылка.ПолФизическогоЛица 
//   * ИНН - Строка 
//   * СтраховойНомерПФР - Строка 
//   * МестоРождения - Строка 
//   * ТелефонПредставление - Строка 
//   * EmailПредставление - Строка 
Функция ТаблицаПохожихКандидатов(ПараметрыПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПохожихКандидатов();
	
	Фамилия = ФизическиеЛицаЗарплатаКадры.ФамилияДляПоиска(ПараметрыПоиска.Фамилия);
	Имя = ФизическиеЛицаЗарплатаКадры.ИмяДляПоиска(ПараметрыПоиска.Имя);
	Отчество = ФизическиеЛицаЗарплатаКадры.ОтчествоДляПоиска(ПараметрыПоиска.Отчество);
	ФИО = ПараметрыПоиска.Фамилия + " " + ПараметрыПоиска.Имя + " " + ПараметрыПоиска.Отчество;
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыПоиска.Ссылка);
	Запрос.УстановитьПараметр("ИсключаемыеФизическиеЛица", ПараметрыПоиска.ИсключаемыеФизическиеЛица);
		
	Если ЗначениеЗаполнено(ПараметрыПоиска.Телефон) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НомерТелефона",
			"ДанныеПоискаФизическихЛиц.Телефоны ПОДОБНО &НомерТелефона");
		Запрос.УстановитьПараметр("НомерТелефона",
			"%" + ПоискФизическихЛиц.ТелефонВФорматеПоиска(ПараметрыПоиска.Телефон) + "%");
	Иначе
		Запрос.УстановитьПараметр("НомерТелефона", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыПоиска.Email) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&АдресЭП",
			"ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты ПОДОБНО &АдресЭП");
		Запрос.УстановитьПараметр("АдресЭП", "%" + ПараметрыПоиска.Email + "%");
	Иначе
		Запрос.УстановитьПараметр("АдресЭП", Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
		УсловиеНаФИО = "
		|	(ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &Фамилия СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмя СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмяОтчество СПЕЦСИМВОЛ ""~""
		|	ИЛИ ЛичныеДанныеКандидатов.НаименованиеСлужебное ПОДОБНО &ФамилияИмяОтчествоУточнение СПЕЦСИМВОЛ ""~"")";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФИО", УсловиеНаФИО);
		
		Запрос.УстановитьПараметр("ФамилияИмяОтчество", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя)
			+ ?(ПустаяСтрока(Отчество), "%", " " + Отчество));
		Запрос.УстановитьПараметр("Фамилия", Фамилия);
		Запрос.УстановитьПараметр("ФамилияИмя", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя));
		Запрос.УстановитьПараметр("ФамилияИмяОтчествоУточнение", Фамилия + ?(ПустаяСтрока(Имя), "", " " + Имя)
			+ ?(ПустаяСтрока(Отчество), "", " " + Отчество) + ?(ПустаяСтрока(Отчество), "", " "
			+ ПараметрыПоиска.УточнениеНаименования));
	Иначе
		Запрос.УстановитьПараметр("ФИО", Ложь);
	КонецЕсли;
	
	ТаблицаПохожих = Запрос.Выполнить().Выгрузить();
	
	Если ПараметрыПоиска.ИскатьВАрхиве
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АрхивФизическихЛиц") Тогда
		МодульАрхивФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АрхивФизическихЛиц");
		МодульАрхивФизическихЛиц.ДополнитьТаблицуПохожихКандидатов(ТаблицаПохожих, ЧастиИмени,
			ПараметрыПоиска.ТочноеСовпадение, ПараметрыПоиска.Ссылка);
	КонецЕсли;
	
	ПоискФизическихЛиц.УдалитьСтрокиСНеполнымСовпадением(ТаблицаПохожих, ПараметрыПоиска);
	
	ТаблицаПохожих.Колонки.Добавить("ТелефонПредставление", Новый ОписаниеТипов("Строка"));
	ТаблицаПохожих.Колонки.Добавить("EmailПредставление", Новый ОписаниеТипов("Строка"));
	Для Каждого СтрокаДанных Из ТаблицаПохожих Цикл
		СтрокаДанных.ТелефонПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			СтрокаДанных.ЛичныеДанныеКандидата, Справочники.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов);
		СтрокаДанных.EmailПредставление = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			СтрокаДанных.ЛичныеДанныеКандидата, Справочники.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов);
	КонецЦикла;
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаПохожих, "ЛичныеДанныеКандидата");
	
	Возврат ТаблицаПохожих;
	
КонецФункции

Функция ТекстЗапросаПохожихКандидатов()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛичныеДанныеКандидатов.Ссылка КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Наименование,
		|	1 КАК Приоритет,
		|	ДанныеПоискаФизическихЛиц.Телефоны КАК Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
		|ПОМЕСТИТЬ ВТЛичныеДанныеКандидатов
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ЛичныеДанныеКандидатов.Ссылка)
		|ГДЕ
		|	&НомерТелефона
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Ссылка,
		|	ЛичныеДанныеКандидатов.Наименование,
		|	2,
		|	ДанныеПоискаФизическихЛиц.Телефоны,
		|	ДанныеПоискаФизическихЛиц.АдресаЭлектроннойПочты
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоискаФизическихЛиц КАК ДанныеПоискаФизическихЛиц
		|		ПО (ДанныеПоискаФизическихЛиц.ФизическоеЛицо = ЛичныеДанныеКандидатов.Ссылка)
		|ГДЕ
		|	&АдресЭП
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Ссылка,
		|	ЛичныеДанныеКандидатов.Наименование,
		|	3,
		|	"""",
		|	""""
		|ИЗ
		|	Справочник.ЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|ГДЕ
		|	&ФИО
		|	И ЛичныеДанныеКандидатов.Ссылка <> &Ссылка
		|	И НЕ ЛичныеДанныеКандидатов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛичныеДанныеКандидатов.Приоритет КАК Приоритет,
		|	ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата КАК ЛичныеДанныеКандидата,
		|	ЛичныеДанныеКандидатов.Наименование КАК Наименование,
		|	ЛичныеДанныеКандидатов.Телефоны КАК Телефоны,
		|	ЛичныеДанныеКандидатов.АдресаЭлектроннойПочты КАК АдресаЭлектроннойПочты
		|ИЗ
		|	ВТЛичныеДанныеКандидатов КАК ЛичныеДанныеКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО (ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата = ЛичныеДанныеКандидатов.ЛичныеДанныеКандидата)
		|			И (НЕ ФизическиеЛицаКандидатов.ФизическоеЛицо.ПометкаУдаления)
		|ГДЕ
		|	(ФизическиеЛицаКандидатов.ФизическоеЛицо ЕСТЬ NULL
		|			ИЛИ НЕ ФизическиеЛицаКандидатов.ФизическоеЛицо В (&ИсключаемыеФизическиеЛица))";
		
	Возврат ТекстЗапроса;
	
КонецФункции

// Представление автора комментария.
// 
// Параметры:
//  АвторКомментария - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Строка - Представление автора комментария
Функция ПредставлениеАвтораКомментария(АвторКомментария) Экспорт
	
	Если АвторКомментария = Пользователи.СсылкаНеуказанногоПользователя() Тогда
		Возврат Пользователи.ПолноеИмяНеуказанногоПользователя();
	КонецЕсли;
	
	ФизическоеЛицоАвтора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АвторКомментария, "ФизическоеЛицо");
	Если Не ЗначениеЗаполнено(ФизическоеЛицоАвтора) Тогда
		Возврат Строка(АвторКомментария);
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	ФИОАвтора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ФизическоеЛицоАвтора, "Фамилия, Имя");
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ФИОАвтора.Фамилия + ?(Не ПустаяСтрока(ФИОАвтора.Имя), " " + ФИОАвтора.Имя, "");
	
КонецФункции

// Установить этапы по умолчанию на сервере.
// 
// Параметры:
//  ЭтапыРаботыСКандидатами - ТабличнаяЧасть -
// 
// Возвращаемое значение:
//  Структура -- Установить этапы по умолчанию на сервере::
// * Добавленные - Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами -
// * Удаленные - Массив из ПеречислениеСсылка.ЭтапыРаботыСКандидатами -
Функция УстановитьЭтапыПоУмолчанию(ЭтапыРаботыСКандидатами) Экспорт
	Результат = Новый Структура();
	Результат.Вставить("Добавленные", ПодборПерсонала.ДобавитьДействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами));
	Результат.Вставить("Удаленные", ПодборПерсонала.УдалитьНедействующиеПредопределенныеЭтапы(ЭтапыРаботыСКандидатами));
	Возврат Результат;
КонецФункции

Процедура ПриСозданииФормыСоСпискомКандидатов(Форма, КандидатыСписок) Экспорт
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(КандидатыСписок.Отбор, 
		ПодборПерсоналаКлиентСервер.ПредставлениеОтбораТолькоВРаботеКандидаты(), 
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	СписокСостояний = Новый СписокЗначений;
	СписокСостояний.Добавить(Перечисления.СостоянияСогласования.Отклонено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "Состояние", СписокСостояний, ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	
	СписокЭтапов = Новый СписокЗначений;
	СписокЭтапов.Добавить(Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика);
	СписокЭтапов.Добавить(Перечисления.ЭтапыРаботыСКандидатами.РаботаЗавершена);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ГруппаОтбора, "ЭтапРаботы", СписокЭтапов, ВидСравненияКомпоновкиДанных.НеВСписке, , Истина);
	
КонецПроцедуры

// Добавляет реквизиты и заполняет данные физического лица по кандидату в форме поиска однофамильцев.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ДобавитьРеквизитыФормыПоискаОднофамильцев(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СовпадающиеДанные", Новый ОписаниеТипов("Строка"),
		"Однофамильцы"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СовпадающиеДанные", Новый ОписаниеТипов("Строка"),
		"ВсеОднофамильцы"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КоличествоСовпадающихДанных", Новый ОписаниеТипов("Число"),
		"Однофамильцы"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КоличествоСовпадающихДанных", Новый ОписаниеТипов("Число"),
		"ВсеОднофамильцы"));
		
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

// Дополняет однофамильцев кандидатами.
// 
// Параметры:
//  Однофамильцы - ДанныеФормыКоллекция
//  ДанныеКандидатов - ТаблицаЗначений
Процедура ДобавитьОднофамильцев(Однофамильцы, ДанныеКандидатов)

	Для Каждого СтрокаДанных Из ДанныеКандидатов Цикл
		НоваяСтрока = Однофамильцы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.ПохожийЧеловек = СтрокаДанных.ЛичныеДанныеКандидата;
		НоваяСтрока.ФИОПолные = СтрокаДанных.ФИО;
		Если ЗначениеЗаполнено(НоваяСтрока.ДатаРождения) Тогда
			НоваяСтрока.ВозрастПредставление = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеВозраста(
				НоваяСтрока.ДатаРождения, ТекущаяДатаСеанса());
		КонецЕсли;
		НоваяСтрока.МобильныйТелефон = СтрокаДанных.Телефон;
		НоваяСтрока.АдресЭлектроннойПочты = СтрокаДанных.EMail;
		НоваяСтрока.ПолПредставление = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПредставлениеПола(СтрокаДанных.Пол);
		НоваяСтрока.АдресФотографии = ПодборПерсонала.АдресФотографииЛичныхДанныхКандидата(СтрокаДанных.ЛичныеДанныеКандидата);
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
Функция СовпадающиеДанныеПоПриоритету()
	
	Результат = Новый Соответствие();
	Результат.Вставить(1, "Телефон");
	Результат.Вставить(2, "E-mail");
	Результат.Вставить(3, "ФИО");
	
	Возврат Результат;
	
КонецФункции

Функция ЭтапыРаботыСоответствуютУмолчанию(ЭтапыРаботыСКандидатами)

	ЭтапыРаботы = ОбщегоНазначения.ВыгрузитьКолонку(ЭтапыРаботыСКандидатами, "ЭтапРаботы", Истина);

	// Есть все из действующих.
	Если РазностьМассивов(Перечисления.ЭтапыРаботыСКандидатами.Действующие(), ЭтапыРаботы).Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Нет ни одного из тех, которые есть во всех, но нет в действующих
	Недействующие = РазностьМассивов(Перечисления.ЭтапыРаботыСКандидатами.ВсеЭтапы(), 
		Перечисления.ЭтапыРаботыСКандидатами.Действующие());
	Если РазностьМассивов(Недействующие, ЭтапыРаботы).Количество() < Недействующие.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РазностьМассивов(Массив, МассивВычитания)
	Возврат ОбщегоНазначенияКлиентСервер.РазностьМассивов(Массив, МассивВычитания);
КонецФункции

#Область ЗащитаПерсональныхДанных

Функция СтатусСогласияНаОбработкуПДнСубъекта(Субъект)
	
	СтатусСогласия = Новый Структура();
	СтатусСогласия.Вставить("Требуется", Ложь);
	СтатусСогласия.Вставить("Описание", ТекстСообщенияОтсутствующегоСогласия());
	
	Если ЗащитаПерсональныхДанных.ЭтоОбъектСУничтоженнымиПерсональнымиДанными(Субъект) Тогда
		СтатусСогласия.Описание = ТекстСообщенияСкрытогоСубъекта(
			ЗащитаПерсональныхДанных.ДатаУничтоженияДанныхСубъекта(Субъект));
		Возврат СтатусСогласия;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаСогласияНаОбработкуПерсональныхДанных();
	Запрос.УстановитьПараметр("Субъект", Субъект);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Регистратор) = Тип("ДокументСсылка.СогласиеНаОбработкуПерсональныхДанных") Тогда
			Если ВыборкаДетальныеЗаписи.СрокХранения = ЗащитаПерсональныхДанныхЗарплатаКадры.ДатаНеУничтожать() Тогда
				СтатусСогласия.Описание = ТекстСообщенияБессрочногоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			Иначе
				СтатусСогласия.Описание = ТекстСообщенияДействующегоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			КонецЕсли;
		Иначе
			СтатусСогласия.Описание = ТекстСообщенияОтзываемогоСогласия(ВыборкаДетальныеЗаписи.Регистратор);
			СтатусСогласия.Требуется = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтатусСогласия;
	
КонецФункции

Функция ТекстЗапросаСогласияНаОбработкуПерсональныхДанных()
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СогласияНаОбработку.Субъект КАК Субъект,
		|	ВЫБОР
		|		КОГДА СогласияНаОбработку.Действует
		|			ТОГДА ВЫБОР
		|				КОГДА СогласияНаОбработку.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
		|				ИНАЧЕ СогласияНаОбработку.СрокДействия
		|			КОНЕЦ
		|		ИНАЧЕ СогласияНаОбработку.Период
		|	КОНЕЦ КАК СрокХранения,
		|	СогласияНаОбработку.Действует КАК Действует,
		|	СогласияНаОбработку.Регистратор
		|ПОМЕСТИТЬ ВТСогласияНаОбработку
		|ИЗ
		|	РегистрСведений.СогласияНаОбработкуПерсональныхДанных.СрезПоследних(, Субъект = &Субъект) КАК СогласияНаОбработку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСогласияНаОбработку.Субъект КАК Субъект,
		|	МАКСИМУМ(ВТСогласияНаОбработку.СрокХранения) КАК СрокХранения
		|ПОМЕСТИТЬ ВТМаксимальныйСрокХранения
		|ИЗ
		|	ВТСогласияНаОбработку КАК ВТСогласияНаОбработку
		|СГРУППИРОВАТЬ ПО
		|	ВТСогласияНаОбработку.Субъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСогласияНаОбработку.Субъект КАК Субъект,
		|	ВТСогласияНаОбработку.СрокХранения КАК СрокХранения,
		|	МАКСИМУМ(ВТСогласияНаОбработку.Действует) КАК Действует,
		|	МАКСИМУМ(ВТСогласияНаОбработку.Регистратор) КАК Регистратор
		|ИЗ
		|	ВТСогласияНаОбработку КАК ВТСогласияНаОбработку
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныйСрокХранения КАК ВТМаксимальныйСрокХранения
		|		ПО ВТСогласияНаОбработку.Субъект = ВТМаксимальныйСрокХранения.Субъект
		|		И ВТСогласияНаОбработку.СрокХранения = ВТМаксимальныйСрокХранения.СрокХранения
		|СГРУППИРОВАТЬ ПО
		|	ВТСогласияНаОбработку.Субъект,
		|	ВТСогласияНаОбработку.СрокХранения";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ГиперСсылкаСогласие(Согласие)
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'согласие на обработку ПДн'"), , , , ПолучитьНавигационнуюСсылку(Согласие));
	
КонецФункции

Функция ГиперСсылкаОтзывСогласия(ОтзывСогласия)
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'отзывается'"), , , , ПолучитьНавигационнуюСсылку(ОтзывСогласия));
	
КонецФункции

Функция ГиперСсылкаНовоеСогласие()
	
	Возврат Новый ФорматированнаяСтрока(НСтр("ru = 'ввести новое согласие'"), , , , "НовоеСогласие");
	
КонецФункции

Процедура ДобавитьЧастиВводаСогласия(ЧастиСообщения)
	
	ЧастиСообщения.Добавить(ГиперСсылкаНовоеСогласие());
	ЧастиСообщения.Добавить(НСтр("ru='.'"));
	
КонецПроцедуры

// Возвращаемое значение:
//  ФорматированнаяСтрока
Функция ТекстСообщенияДействующегоСогласия(Согласие)
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Согласие, "ДатаПолучения,СрокДействия");
	
	ДатаПолучения = ЗначенияРеквизитов.ДатаПолучения;
	СрокДействия = ЗначенияРеквизитов.СрокДействия;
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='У субъекта %1 было получено'"), Формат(ДатаПолучения, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаСогласие(Согласие));
	
	Если СрокДействия > ТекущаяДатаСеанса() Тогда
		ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru=', которое действует до %1.'"), Формат(СрокДействия, "ДЛФ=D")));
	Иначе
		
		ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru=', которое действовало до %1. Можно'") + " ", Формат(СрокДействия, "ДЛФ=D")));
		ДобавитьЧастиВводаСогласия(ЧастиСообщения);
		
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияБессрочногоСогласия(Согласие)
	
	ДатаПолучения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Согласие, "ДатаПолучения");
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='У субъекта %1 было получено'"), Формат(ДатаПолучения, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаСогласие(Согласие));
	ЧастиСообщения.Добавить(" " + НСтр("ru=', которое действует бессрочно.'"));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияОтсутствующегоСогласия()
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='У субъекта не было получено согласие на обработку ПДн. Можно'") + " ");
	
	ДобавитьЧастиВводаСогласия(ЧастиСообщения);
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияОтзываемогоСогласия(ОтзывСогласия)
	
	ДатаОтзыва = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтзывСогласия, "ДатаОтзыва");
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(НСтр("ru='Согласие на обработку ПДн'") + " ");
	ЧастиСообщения.Добавить(ГиперСсылкаОтзывСогласия(ОтзывСогласия));
	ЧастиСообщения.Добавить(" " + СтрШаблон(НСтр("ru='%1. Можно'"), Формат(ДатаОтзыва, "ДЛФ=D")) + " ");
	
	ДобавитьЧастиВводаСогласия(ЧастиСообщения);
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

Функция ТекстСообщенияСкрытогоСубъекта(ДатаСкрытия)
	
	ЧастиСообщения = Новый Массив;
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='Персональные данные субъекта уничтожены %1.'"), Формат(ДатаСкрытия, "ДЛФ=D")) + " ");
	ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru='Истек срок согласия на обработку ПДн или согласие не было получено.'")));
	
	Возврат Новый ФорматированнаяСтрока(ЧастиСообщения);
	
КонецФункции

#КонецОбласти

#Область ФормаКандидата

// Параметры:
//  Форма - см. Справочник.Кандидаты.Форма.ФормаЭлементаНовая
//  
// Возвращаемое значение:
//  см. ПоискФизическихЛиц.ПохожиеЛюди
Функция РезультатПоискаПохожихЛюдейИзФормыКандидата(Форма) Экспорт
	
	ПараметрыПоиска = ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей();
	ЗаполнитьЗначенияСвойств(ПараметрыПоиска, Форма.ЛичныеДанныеКандидата, "Фамилия,Имя,Отчество,УточнениеНаименования");
	ПараметрыПоиска.Ссылка = Форма.ЛичныеДанныеКандидатаСсылка;
	ПараметрыПоиска.Телефон = СокрЛП(Форма.КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов);
	ПараметрыПоиска.EMail = СокрЛП(Форма.КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов);
	ПараметрыПоиска.ОбязательноЗаполненноеФИО = Ложь;
	ПараметрыПоиска.ИсключаемыеФизическиеЛица.Добавить(Форма.ФизическоеЛицоСсылка);
	
	Если Не Форма.Параметры.Ключ.Пустая() Тогда
		ПараметрыПоиска.ИскатьСредиФизическихЛиц = Ложь;
		ПараметрыПоиска.ИскатьВАрхиве = Ложь;
	КонецЕсли;
	
	Результат = ПоискФизическихЛиц.ПохожиеЛюди(ПараметрыПоиска);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Форма - см. Справочник.Кандидаты.Форма.ФормаЭлементаНовая
//  
// Возвращаемое значение:
//  см. ПоискФизическихЛиц.ПохожиеЛюди
Функция РезультатПроверкиУникальности(Форма) Экспорт
	
	ПараметрыПоиска = ПоискФизическихЛиц.ПараметрыПоискаПохожихЛюдей();
	ПараметрыПоиска.Ссылка = Форма.ЛичныеДанныеКандидатаСсылка;
	ПараметрыПоиска.Телефон = СокрЛП(Форма.КонтактнаяИнформацияПолеТелефонЛичныеДанныеКандидатов);
	ПараметрыПоиска.EMail = СокрЛП(Форма.КонтактнаяИнформацияПолеEMailЛичныеДанныеКандидатов);
	ПараметрыПоиска.ОбязательноЗаполненноеФИО = Ложь;
	ПараметрыПоиска.ИсключаемыеФизическиеЛица.Добавить(Форма.ФизическоеЛицоСсылка);
	
	Результат = ПоискФизическихЛиц.ПохожиеЛюди(ПараметрыПоиска);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти