

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыФормы = Параметры.ПараметрыФормы;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ПараметрыФормы);
	
	ИнициализацияИзПомощникаМЧД(Параметры);
	
	ВладелецЭЦПВидДокументаИзПомощникаМЧД = ВладелецЭЦПВидДокумента;
	ИзменитьОформлениеКраснойПанелиИСкорректироватьВидДокумента();
	
	ИнициалироватьПереключатель();
	
	ПриИзмененииВидаДокумента();
	
	ДобавитьОбработчикиОшибок();
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПередЗакрытием_Завершение", 
		ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(
		ОписаниеОповещения, 
		Отказ, 
		ЗавершениеРаботы);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ИзПомощникаМЧД
		И (ИмяСобытия = "Запись_ФизическиеЛица" ИЛИ ИмяСобытия = "Запись_ВладельцаИлиБухгалтера")
		И (Параметр = ВладелецЭЦП ИЛИ Источник = ВладелецЭЦП) Тогда
		
		ЗаполнитьДанныеСотрудникаНаСервере();
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецЭЦПВидДокументаИзПомощникаМЧДПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	
	
	ПриИзмененииВидаДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательВидаДокументаПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ПриИзмененииВидаДокумента();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоляПаспортаПриИзменении(Элемент)
	ИзменитьОформлениеПаспортныхДанных();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда = Неопределено)

	Если НЕ ЗначениеЗаполнено(ВладелецЭЦПВидДокумента) И ИзПомощникаМЧД Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Выберите вид документа'"),,"ВладелецЭЦПВидДокументаИзПомощникаМЧД");
		Возврат;
	КонецЕсли;
	
	ДанныеКорректны = Истина;
	ПаспортныеДанныеУказаныКорректно(ДанныеКорректны, Истина);
	
	Если ДанныеКорректны Тогда
		
		ДополнительныеПараметры = Новый Структура(ПараметрыФормы);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ЭтотОбъект, ПараметрыФормы); 
		ДополнительныеПараметры.Вставить("ПараметрыФормы",     ПараметрыФормы);
		ДополнительныеПараметры.Вставить("Модифицированность", Модифицированность);
		
		Модифицированность = Ложь;
		
		Закрыть(ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеСотрудникаНаСервере()
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	
	СтруктураРеквизитов = Новый Структура();
	СтруктураРеквизитов.Вставить("Организация", Организация);
	СтруктураРеквизитов.Вставить("ПриОткрытии", Истина);
	СтруктураРеквизитов.Вставить("АдресЮридический",);
	СтруктураРеквизитов.Вставить("АдресФактический",);
	
	КонтекстЭДОСервер.ЗаполнитьДанныеОрганизации(СтруктураРеквизитов);
	ДанныеОрганизацииИОтветственныхЛиц = КонтекстЭДОСервер.ДополнитьДанныеОрганизацииДаннымиПоОтветственнымЛицам(СтруктураРеквизитов);
	ДанныеОрганизации = ДанныеОрганизацииИОтветственныхЛиц.СтруктураДанныхОрганизации;
	
	ДанныеСотрудника = ОбработкаЗаявленийАбонента.ПолучитьДанныеСотрудника(
		ВладелецЭЦПТип,
		ДанныеОрганизации,
		ВладелецЭЦП);
	
	ВидДокумента = ДанныеСотрудника.ВидДокумента;
	ВладелецЭЦПВидДокумента = КонтекстЭДОСервер.СкорректироватьВидУдостоверения(ВидДокумента);
	
	Если ЗначениеЗаполнено(ВладелецЭЦПВидДокумента) Тогда
		
		ВладелецЭЦПСерияДокумента      = ДанныеСотрудника.Серия;
		ВладелецЭЦПНомерДокумента      = ДанныеСотрудника.Номер;
		ВладелецЭЦПДатаВыдачиДокумента = ДанныеСотрудника.ДатаВыдачи;
		ВладелецЭЦПКемВыданДокумент    = ДанныеСотрудника.КемВыдан;
		ВладелецЭЦПДатаРождения        = ДанныеСотрудника.ДатаРождения;
		ВладелецЭЦПМестоРождения       = ДанныеСотрудника.МестоРождения;
		ВладелецЭЦПКодПодразделения    = ДанныеСотрудника.КодПодразделения;
		ВладелецЭЦППол                 = ДанныеСотрудника.Пол;
		ВладелецЭЦПГражданство         = ДанныеСотрудника.Гражданство;
		
	Иначе
		
		ВладелецЭЦПСерияДокумента      = "";
		ВладелецЭЦПНомерДокумента      = "";
		ВладелецЭЦПДатаВыдачиДокумента = Неопределено;
		ВладелецЭЦПКемВыданДокумент    = "";
		ВладелецЭЦПДатаРождения        = Неопределено;
		ВладелецЭЦПМестоРождения       = "";
		ВладелецЭЦПКодПодразделения    = "";
		ВладелецЭЦППол                 = Неопределено;
		ВладелецЭЦПГражданство         = Неопределено;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ИзменитьОформлениеКраснойПанелиИСкорректироватьВидДокумента();
	ПриИзмененииВидаДокумента();
	
КонецПроцедуры
		
&НаСервере
Процедура ИзменитьОформлениеКраснойПанелиИСкорректироватьВидДокумента()
	
	Если ИзПомощникаМЧД Тогда
		Элементы.ГруппаПредупреждениеОПаспорте.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭтоИностранныйПаспорт = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЭтоИностранныйПаспорт(ВладелецЭЦПВидДокумента);
	
	Если ЗначениеЗаполнено(ВладелецЭЦП) Тогда
		ДанныеВладельца = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПолучитьДанныеИсполнителя(
			ВладелецЭЦП, Организация);
			
		Если ТипЗнч(ДанныеВладельца) = Тип("Структура") И ДанныеВладельца.Свойство("ВидДокумента") Тогда
			ВладелецЭЦПВидДокументаНепреобразованный = ДанныеВладельца.ВидДокумента;
		КонецЕсли;
		
	Иначе
		ВладелецЭЦПВидДокументаНепреобразованный = Неопределено;
	КонецЕсли;
	
	ВыбранНеПаспорт = 
		ЗначениеЗаполнено(ВладелецЭЦПВидДокументаНепреобразованный) 
		И НЕ ЗначениеЗаполнено(ВладелецЭЦПВидДокумента)
		И НЕ ЭтоПаспортРФ() И НЕ ЭтоИностранныйПаспорт;
	
	Если ВыбранНеПаспорт И ЗначениеЗаполнено(ВладелецЭЦП) Тогда
		// Вариант, когда есть Владелец ЭП и у него выбран некорректный вид документа
		
		ВладелецЭЦПВидДокумента = Перечисления.ВидыУдостоверенийВладельцаЭП.ПаспортРФ;
		
		ТекстПредупрежденияНачало = НСтр("ru = 'Реквизиты удостоверения не могут быть заполнены по данным карточки физ.лица, поскольку в качестве документа разрешено указывать только российский или иностранный паспорт. Заполните сведения в карточке физ. лица '");
		ТекстПредупрежденияКонец  = НСтр("ru = ' или в этой форме.
	                                      |
                                          |Если в карточке физ. лица выбран паспорт, убедитесь, что у выбранного вида документа корректно заполнен код ФНС.'");
		
		Элементы.ПредупреждениеОПаспорте.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			ТекстПредупрежденияНачало,
			ФИОФорматированнойСтрокой(),
			ТекстПредупрежденияКонец);
			
		Элементы.ГруппаПредупреждениеОПаспорте.Видимость = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВладелецЭЦПВидДокументаНепреобразованный) 
		И НЕ ЗначениеЗаполнено(ВладелецЭЦПВидДокумента)
		И ЗначениеЗаполнено(ВладелецЭЦП) Тогда
		// Вариант, когда есть Владелец ЭП и у него не указан вид документа
		
		ВладелецЭЦПВидДокумента = Перечисления.ВидыУдостоверенийВладельцаЭП.ПаспортРФ;
		
		ТекстПредупрежденияНачало = НСтр("ru = 'Заполните сведения о паспорте в карточке физ. лица '");
		ТекстПредупрежденияКонец  = НСтр("ru = ' или в этой форме.'");
		
		Элементы.ПредупреждениеОПаспорте.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			ТекстПредупрежденияНачало,
			ФИОФорматированнойСтрокой(),
			ТекстПредупрежденияКонец);
			
		Элементы.ГруппаПредупреждениеОПаспорте.Видимость = Истина;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВладелецЭЦПВидДокумента) 
		И НЕ ЗначениеЗаполнено(ВладелецЭЦП) Тогда
		// Если владелец не заполнен, то некуда отправлять исправлять данные.
		
		ВладелецЭЦПВидДокумента = Перечисления.ВидыУдостоверенийВладельцаЭП.ПаспортРФ;
		Элементы.ГруппаПредупреждениеОПаспорте.Видимость = Ложь;
		
	Иначе
		// Вариант, когда указаны корректные данные
		Элементы.ГруппаПредупреждениеОПаспорте.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФИОФорматированнойСтрокой()
	
	ФИО = Новый Структура();
	ФИО.Вставить("Фамилия",  ВладелецЭЦПФамилия);
	ФИО.Вставить("Имя",      ВладелецЭЦПИмя);
	ФИО.Вставить("Отчество", ВладелецЭЦПОтчество);
		
	ФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО);

	Возврат Новый ФорматированнаяСтрока(ФИО,,,,ПолучитьНавигационнуюСсылку(ВладелецЭЦП));
	
КонецФункции
	
&НаКлиенте
Процедура ПередЗакрытием_Завершение(Результат, ВходящийКонтекст) Экспорт
	
	Сохранить();
	
КонецПроцедуры

&НаСервере
Функция ПаспортныеДанныеУказаныКорректно(МастерДалее = Истина, ВыводитьСообщения)
	
	Если ИзПомощникаМЧД Тогда
		Возврат Новый Массив;
	Иначе
		КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
		Возврат КонтекстЭДОСервер.ПаспортныеДанныеУказаныКорректно(ЭтотОбъект, МастерДалее, ВыводитьСообщения);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриИзмененииВидаДокумента()
	
	Если ИзПомощникаМЧД Тогда
		
		Если ВидДокументаПереключатель = Перечисления.ВидыУдостоверенийВладельцаЭП.Иное Тогда
			Если ВладелецЭЦПВидДокументаИзПомощникаМЧД  = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда
				ВладелецЭЦПВидДокумента = Неопределено;
				ВладелецЭЦПВидДокументаИзПомощникаМЧД = Неопределено;
			Иначе
				ВладелецЭЦПВидДокумента = ВладелецЭЦПВидДокументаИзПомощникаМЧД;
			КонецЕсли;
		Иначе
			ВладелецЭЦПВидДокумента = ВидДокументаПереключатель;
		КонецЕсли;
		
	Иначе
		
		КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
		ВладелецЭЦПВидДокумента = КонтекстЭДОСервер.СкорректироватьВидУдостоверения(ВидДокументаПереключатель);
		
	КонецЕсли;
	
	Если ЭтоПаспортРФ() И НЕ ЗначениеЗаполнено(ВладелецЭЦПГражданство) Тогда
		ВладелецЭЦПГражданство = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.СтраныМира.Россия");
	КонецЕсли;
	
	ИзменитьОформлениеПаспортныхДанных();
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОформлениеПаспортныхДанных() 
	
	// Для паспорта своя страница, для остальных - своя
	ЭтоПаспортРФ = ЭтоПаспортРФ();
	Если ЭтоПаспортРФ Тогда
		
		Элементы.ВладелецЭЦПСерияДокумента.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(5));
		Элементы.ВладелецЭЦПНомерДокумента.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(6));
		
	Иначе
		
		Элементы.ВладелецЭЦПСерияДокумента.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВладелецЭЦПСерияДокумента.ОтметкаНезаполненного     = Ложь;
		Элементы.ВладелецЭЦПНомерДокумента.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ВладелецЭЦПНомерДокумента.ОтметкаНезаполненного     = Ложь;
		
		Элементы.ВладелецЭЦПСерияДокумента.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки());
		Элементы.ВладелецЭЦПНомерДокумента.ОграничениеТипа = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки());
		
	КонецЕсли;
	
	Элементы.ВладелецЭЦПГражданство.Видимость =
		НЕ ЭтоПаспортРФ
		И (ИзПомощникаМЧД И НЕ СкрытьГражданство
		ИЛИ НЕ ИзПомощникаМЧД);
	
	Элементы.ВладелецЭЦПДатаРождения.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьДатуРождения 
		ИЛИ НЕ ИзПомощникаМЧД;
		
	Элементы.ВладелецЭЦПМестоРождения.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьМестоРождения 
		ИЛИ НЕ ИзПомощникаМЧД;
		
	Элементы.ВладелецЭЦППол.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьПол 
		ИЛИ НЕ ИзПомощникаМЧД;
	
	Элементы.ВладелецЭЦПКемВыданДокумент.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьКемКогдаВыдан 
		ИЛИ НЕ ИзПомощникаМЧД;
		
	Элементы.ВладелецЭЦПДатаВыдачиДокумента.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьКемКогдаВыдан 
		ИЛИ НЕ ИзПомощникаМЧД;
		
	Элементы.ВладелецЭЦПКодПодразделения.Видимость = 
		ИзПомощникаМЧД И НЕ СкрытьКемКогдаВыдан 
		ИЛИ НЕ ИзПомощникаМЧД;
	
	Элементы.ВладелецЭЦПВидДокументаИзПомощникаМЧД.Видимость = 
		ИзПомощникаМЧД И НЕ ЭтоПаспортРФ();
	
	// Только просмотр
	Если ЗапретитьИзменение Тогда
		
		Для каждого Элемент Из Элементы Цикл
			Если Элемент.Вид = ВидПоляФормы.ПолеВвода
				ИЛИ Элемент.Вид = ВидПоляФормы.ПолеПереключателя Тогда
				Элемент.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.Сохранить.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Видимость = Ложь;
		
	КонецЕсли;
	
	// Вывод ошибок
	РезультатПроверки = ПаспортныеДанныеУказаныКорректно(, Ложь);
	
	УбратьОтображениеОшибок();
	
	Для каждого Строка Из РезультатПроверки Цикл
		Если Строка.ЕстьОшибка Тогда
			
			Элемент = Элементы[Строка.Поле];
			
			Элемент.Подсказка = Строка.ТекстОшибки;
			Элемент.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(БиблиотекаКартинок.ПризнакНаличияКритическойОшибки,,,,"Ошибка");
			Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьПредупреждение(,Элемент.Родитель.Подсказка);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОбработчикиОшибок()
	
	Если ИзПомощникаМЧД Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") 
			И ДокументооборотСКОКлиентСервер.ЕстьСвойство(Элемент, "РасширеннаяПодсказка") Тогда
			Элемент.РасширеннаяПодсказка.УстановитьДействие("ОбработкаНавигационнойСсылки", "ОшибкаОбработкаНавигационнойСсылки");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УбратьОтображениеОшибок()
	
	Для каждого Элемент Из Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы")
			И ДокументооборотСКОКлиентСервер.ЕстьСвойство(Элемент, "ОтображениеПодсказки") Тогда
			Элемент.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияИзПомощникаМЧД(Параметры)
	
	Параметры.Свойство("ИзПомощникаМЧД", ИзПомощникаМЧД);
	
	Если ИзПомощникаМЧД Тогда
		СкрытьДатуРождения  = Параметры.СкрытьДатуРождения;
		СкрытьМестоРождения = Параметры.СкрытьМестоРождения;
		СкрытьПол           = Параметры.СкрытьПол;
		СкрытьГражданство   = Параметры.СкрытьГражданство;
		СкрытьКемКогдаВыдан = Параметры.СкрытьКемКогдаВыдан;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоПаспортРФ()

	Возврат ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ЭтоПаспортРФ(ВладелецЭЦПВидДокумента);

КонецФункции

&НаСервере
Процедура ИнициалироватьПереключатель()
	
	Виды = Перечисления.ВидыУдостоверенийВладельцаЭП;
	
	Элементы.ПереключательВидаДокумента.СписокВыбора.Очистить();
	Элементы.ПереключательВидаДокумента.СписокВыбора.Добавить(Виды.ПаспортРФ, НСтр("ru = 'Паспорт РФ'"));
	
	Если ИзПомощникаМЧД Тогда
		ВтороеЗначение = Виды.Иное;
		Элементы.ПереключательВидаДокумента.СписокВыбора.Добавить(ВтороеЗначение, НСтр("ru = 'Иной'"));
	Иначе
		ВтороеЗначение = Виды.ИностранныйПаспорт;
		Элементы.ПереключательВидаДокумента.СписокВыбора.Добавить(ВтороеЗначение, НСтр("ru = 'Иностранный'"));
	КонецЕсли;
	
	Если ЭтоПаспортРФ() Тогда
		ВидДокументаПереключатель = Виды.ПаспортРФ;
	ИначеЕсли ЗначениеЗаполнено(ВладелецЭЦПВидДокумента) Тогда
		ВидДокументаПереключатель = ВтороеЗначение;
	Иначе
		ВидДокументаПереключатель = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере_85()
	
	Это85 = ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85();
	Элементы.ОтступСнизуТакси.Видимость = НЕ Это85;
	
	ДокументооборотСКОКлиентСервер.УменьшитьВертикальныйИнтервал_85(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
