#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриПолученииДанныхНаСервере();
	Элементы.ФинансовыйУчетПоУмолчаниюАналитикаРасходов.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Проекты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ОтредактированаИстория" И Параметр.Свойство("ИмяРегистра") 
		И Параметр.ИмяРегистра = "ФинансовыйУчетПоУмолчанию" Тогда
		РедактированиеПериодическихСведенийКлиент.ОбработкаОповещенияПоСтруктуре(
			ЭтотОбъект, СтруктураВедущихОбъектов, ИмяСобытия, Параметр, Источник);
		
		ЭлементПериод = Элементы.Найти(Параметр.ИмяРегистра + "ПериодСтрокой");
		Если ЭлементПериод <> Неопределено Тогда
			ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(
				ЭтотОбъект, Параметр.ИмяРегистра + ".Период", Параметр.ИмяРегистра + "ПериодСтрокой");
			Возврат;
		КонецЕсли;
		
		ЭлементПериод = Элементы.Найти(Параметр.ИмяРегистра + "ПериодГод");
		Если ЭлементПериод <> Неопределено Тогда
			ЭтотОбъект[Параметр.ИмяРегистра + "ПериодГод"] = Год(ЭтотОбъект[Параметр.ИмяРегистра].Период);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПриИзменении(НаименованиеПособия)
	
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВводаПоСтруктуре(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию", СтруктураВедущихОбъектов);
	Модифицированность = Модифицированность Или ФинансовыйУчетПоУмолчанию[НаименованиеПособия] <> ФинансовыйУчетПоУмолчаниюПрежняя[НаименованиеПособия];
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюСпособОтраженияПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("СпособОтражения");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюНаправлениеДеятельностиПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("НаправлениеДеятельности");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюАналитикаРасходовПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("АналитикаРасходов");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюЗарплатаПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("Зарплата");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюСтраховыеВзносыПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("СтраховыеВзносы");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюУдержаннаяЗарплатаПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("УдержаннаяЗарплата");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюЗаймыПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("Займы");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюОбучениеПриИзменении(Элемент)
	ФинансовыйУчетПоУмолчаниюПриИзменении("Обучение");
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПериодСтрокойПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(
		ЭтотОбъект, "ФинансовыйУчетПоУмолчанию.Период", "ФинансовыйУчетПоУмолчаниюПериодСтрокой", Модифицированность);
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтотОбъект,
		ЭтотОбъект,
		"ФинансовыйУчетПоУмолчанию.Период",
		"ФинансовыйУчетПоУмолчаниюПериодСтрокой",
		,
		,
		МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(
		ЭтотОбъект, "ФинансовыйУчетПоУмолчанию.Период", "ФинансовыйУчетПоУмолчаниюПериодСтрокой",
		Направление, Модифицированность, МесяцПоУмолчанию());
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФинансовыйУчетПоУмолчаниюИстория(Команда)
	ОткрытьИсторию("ФинансовыйУчетПоУмолчанию");
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	СохранитьИЗакрытьНаКлиенте(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере(НеЗакрыватьФорму = Истина)
	
	Если ЗаписатьФинансовыйУчетПоУмолчанию() И НеЗакрыватьФорму Тогда
		ПрочитатьФинансовыйУчетПоУмолчанию();
	КонецЕсли;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьИЗакрытьНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ТолькоПросмотр = Не Пользователи.ЭтоПолноправныйПользователь(, Истина) Или ОбщегоНазначения.ЭтоАвтономноеРабочееМесто();
	
	ОбновитьЭлементыФормыПоТекущимНастройкам();
	
	ФинансовыйУчетПоУмолчаниюНаборЗаписей.Очистить();
	ФинансовыйУчетПоУмолчаниюНаборЗаписейПрочитан = Ложь;
	
	СтруктураВедущихОбъектов = Новый Структура;
	
	РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФормеПоСтруктуре(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию", СтруктураВедущихОбъектов);
	
	ПрочитатьФинансовыйУчетПоУмолчанию();
	
КонецПроцедуры

#Область ЧтениеЗапись

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведенийПоСтруктуре(ИмяРегистра, ВедущиеОбъекты) Экспорт
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписейПоСтруктуре(ЭтотОбъект, ИмяРегистра, ВедущиеОбъекты);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФинансовыйУчетПоУмолчанию()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФормеПоСтруктуре(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию", СтруктураВедущихОбъектов);
	
	ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию.Период", "ФинансовыйУчетПоУмолчаниюПериодСтрокой");
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьФинансовыйУчетПоУмолчанию()
	
	ИзменилисьДанные = РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФормеПоСтруктуре(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию", СтруктураВедущихОбъектов, ,Новый Структура("ЗаписьОбщихДанных"));
	
	Возврат ИзменилисьДанные;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОткрытьИсторию(ИмяРегистра)
	
	МассивЗаписей = РедактированиеПериодическихСведенийКлиентСервер.МассивЗаписейИсторииПоСтруктуре(ЭтотОбъект, ИмяРегистра, СтруктураВедущихОбъектов);
	ПараметрыФормы = Новый Структура("МассивЗаписей,СтруктураВедущихОбъектов,ТолькоПросмотр", МассивЗаписей, СтруктураВедущихОбъектов, ТолькоПросмотр);
	ОткрытьФорму("Обработка.ПанельНастроекУправлениеПерсоналом.Форма." + ИмяРегистра + "РедактированиеИстории" , ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Функция МесяцПоУмолчанию()
	Возврат НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПоТекущимНастройкам()
	Элементы.ФинансовыйУчетПоУмолчаниюГруппа.ТолькоПросмотр = ТолькоПросмотр;
КонецПроцедуры

#Область Сохранение

&НаКлиенте
Процедура СохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗаписатьНаСервере(Ложь);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиенте(ЗакрытьФорму = Истина) Экспорт 
	
	ДополнительныеПараметры = Новый Структура("ЗакрытьФорму", ЗакрытьФорму);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	СохранитьДанные(Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьНаКлиентеЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	Если Не Отказ И Открыта() Тогда
		Модифицированность = Ложь;
		Если ДополнительныеПараметры.ЗакрытьФорму Тогда
			Закрыть();
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Отказ, ОповещениеЗавершения = Неопределено) Экспорт
	
	Если Не Модифицированность Тогда
		Если ОповещениеЗавершения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
		КонецЕсли;
		Возврат;
	КонецЕсли; 
	ЗапроситьРежимИзмененияФинансовыйУчетПоУмолчанию(Отказ, ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапроситьРежимИзмененияФинансовыйУчетПоУмолчанию(Отказ, ОповещениеЗавершения) Экспорт 
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ФинансовыйУчетПоУмолчанию.Период;
	
	ТекстКнопкиДа = НСтр("ru = 'Изменились значения по умолчанию'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru =  'При редактировании изменены значения по умолчанию.
			|Если исправлено прежнее значение (оно было ошибочным), нажмите ""Исправлена ошибка"".
			|Если изменились сведения с %1, нажмите'") + " ""%2""",
		Формат(ДатаИзменения, НСтр("ru='ДФ=''д ММММ гггг ""г""'''")), ТекстКнопкиДа);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьДанныеЗавершение", ЭтотОбъект, ОповещениеЗавершения);
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтотОбъект, "ФинансовыйУчетПоУмолчанию", ТекстВопроса, ТекстКнопкиДа, Отказ, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанныеЗавершение(Отказ, ОповещениеЗавершения) Экспорт  
	
	ЗаписатьНаСервере();
	Если ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
