#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// АдаптацияИнтерфейса
	АдаптироватьИнтерфейс();
	// Конец АдаптацияИнтерфейса
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоИдентификаторуПриИзменении(Элемент)
	
	Идентификатор = Неопределено;
	
	Если ЗначениеЗаполнено(ПоИдентификатору) Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПоИдентификатору) Тогда
			Идентификатор = Новый УникальныйИдентификатор(ПоИдентификатору);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = '""%1"" не является уникальным идентификатором'"), ПоИдентификатору);
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Идентификатор = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Идентификатор",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Равно,,
			Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Идентификатор",
			Идентификатор,
			ВидСравненияКомпоновкиДанных.Равно,,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АдаптацияИнтерфейса

&НаСервере
Процедура АдаптироватьИнтерфейс()
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Элементы.ГруппаКоманднаяПанель.Видимость = Истина;
		Элементы.ФормаОбновить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти