#Область СлужебныйПрограммныйИнтерфейс

#Область ВыводВидовУдостоверенийВФормеДолжностей

Процедура ГруппаВидыУдостоверенийДополнитьФорму(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетУдостоверений") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	Если Элементы.Найти("ГруппаВидыУдостоверений") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаВидыУдостоверений = Элементы.ГруппаВидыУдостоверений;
	
	ИмяРеквизита = "ВыдаваемыеВидыУдостоверений";
	ИмяКолонки = "ВидУдостоверения";
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.ВидыУдостоверений"), ИмяРеквизита, НСтр("ru='Вид удостоверения.'")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ВидыУдостоверений)
		Или Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДолжностиПоВидамУдостоверений) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
		ТаблицаВыдаваемыеВидыУдостоверений = Элементы.Добавить(ИмяРеквизита, Тип("ТаблицаФормы"), ГруппаВидыУдостоверений);
		ТаблицаВыдаваемыеВидыУдостоверений.ТолькоПросмотр = Истина;
		ТаблицаВыдаваемыеВидыУдостоверений.ПутьКДанным = ИмяРеквизита;
		ТаблицаВыдаваемыеВидыУдостоверений.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		ТаблицаВыдаваемыеВидыУдостоверений.Шапка = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяКолонки) = Неопределено Тогда
		КолонкаТаблицы = Элементы.Добавить(ИмяКолонки, Тип("ПолеФормы"), Элементы[ИмяРеквизита]);
		КолонкаТаблицы.ПутьКДанным = ИмяРеквизита + "." + ИмяКолонки;
		КолонкаТаблицы.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	ПрочитатьСписокВидовУдостоверений(Форма);

КонецПроцедуры

Процедура ПрочитатьСписокВидовУдостоверений(Форма)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетУдостоверений") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.ВидыУдостоверений)
		Или Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДолжностиПоВидамУдостоверений) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ВыдаваемыеВидыУдостоверений") <> Неопределено Тогда
		СписокВидовУдостоверенийПоДолжности = СписокВидовУдостоверенийПоДолжности(Форма.Объект.Ссылка);
		Форма.ВыдаваемыеВидыУдостоверений.Загрузить(СписокВидовУдостоверенийПоДолжности);
	КонецЕсли;
	
КонецПроцедуры

Функция СписокВидовУдостоверенийПоДолжности(Должность)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Должность", Должность);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДолжностиПоВидамУдостоверений.ВидУдостоверения КАК ВидУдостоверения
		|ИЗ
		|	РегистрСведений.ДолжностиПоВидамУдостоверений КАК ДолжностиПоВидамУдостоверений
		|ГДЕ
		|	ДолжностиПоВидамУдостоверений.Должность = &Должность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВидыУдостоверений.Ссылка
		|ИЗ
		|	Справочник.ВидыУдостоверений КАК ВидыУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДолжностиПоВидамУдостоверений КАК ДолжностиПоВидамУдостоверений
		|		ПО ВидыУдостоверений.Ссылка = ДолжностиПоВидамУдостоверений.ВидУдостоверения
		|ГДЕ
		|	ДолжностиПоВидамУдостоверений.Должность ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецОбласти