#Область ПрограммныйИнтерфейс

// Возвращает признак использования каталога расширений в приложении
//
// Возвращаемое значение:
//  Булево
Функция Используется() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Возвращает наименование ссылки для перехода в каталог расширений
//
// Возвращаемое значение:
//  Строка
Функция НаименованиеСсылкиКаталогаРасширений() Экспорт
	
	Возврат НСтр("ru = 'Каталог расширений'");
	
КонецФункции

// Возвращает актуальное состояние расширения
// @skip-check module-empty-method - особенность реализации.
// 
// Параметры:
//  ПубличныйИдентификатор - Строка - публичный идентификатор расширения из Менеджера сервиса
// 
// Возвращаемое значение:
//  Строка - представление состояния расширения. Принимает одно из состояний: "Устанавливается", "Установлено",
//  	"Удаляется", "Удалено", "Ошибка установки", "Ошибка удаления", "Отключено", "Установлена каркасная версия",
//		"Не установлено"
Функция СостояниеРасширения(ПубличныйИдентификатор) Экспорт
КонецФункции


// Информация об оценке пользователя.
// 
// Параметры:
//  ПубличныйИдентификатор - Строка - публичный идентификатор расширения из Менеджера сервиса
// 
// Возвращаемое значение:
//  Структура - Информация об оценке пользователя:
// * ОценкаВыставлена - Булево - флаг того, что пользователь выставил оценку
// * НаименованиеРасширения - Строка - наименование расширения
// * Оценка - Число - числовое представление оценки
// * ДатаСоздания - Дата - дата создания первой оценки
// * ДатаПоследнегоИзменения - Дата - дата последнего изменения оценки
// * Версия - Строка - версия расширения которая была установлена в момент последнего редактирования оценки
// * ОтветРазработчика - Строка - текст ответа разработчика на оценку
// * ДатаОтветаРазработчика - Дата - дата ответа разработчика на оценку
// * ДатаУстановкиРасширения - Дата - дата установки расширения в приложение 
// * ОшибкаПолученияДанных - Структура - если при получении данных произошла ошибка, тогда данное свойство существует:
// ** ТекстОшибки - Строка - текст информации об ошибке
Функция ИнформацияОбОценкеПользователя(ПубличныйИдентификатор) Экспорт
	
	ДанныеОшибки = Новый Структура();
	ДанныеОшибки.Вставить("ТекстОшибки", НСтр("ru = 'Расширение fresh не подключено.'"));
	
	ДанныеОтвета = Новый Структура();
	ДанныеОтвета.Вставить("ОценкаВыставлена", Ложь);
	ДанныеОтвета.Вставить("НаименованиеРасширения", "");
	ДанныеОтвета.Вставить("Оценка", 0);
	ДанныеОтвета.Вставить("ДатаСоздания", Дата(1, 1, 1));
	ДанныеОтвета.Вставить("ДатаПоследнегоИзменения", Дата(1, 1, 1));
	ДанныеОтвета.Вставить("Версия", "");
	ДанныеОтвета.Вставить("ОтветРазработчика", "");
	ДанныеОтвета.Вставить("ДатаОтветаРазработчика", Дата(1, 1, 1));
	ДанныеОтвета.Вставить("ДатаУстановкиРасширения", Дата(1, 1, 1));
	ДанныеОтвета.Вставить("ОшибкаПолученияДанных", ДанныеОшибки);
	
	Возврат ДанныеОтвета;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// Меняет значение использования Каталога расширений в приложении
// 
// Параметры:
//  Использовать - Булево - требуемое значение использования Каталога расширений в приложении
//
// Возвращаемое значение:
//  Булево - при успешном выполнении возвращает в качестве результата значение Истина
//@skip-check module-empty-method
Функция ИзменитьЗначениеИспользованияВПриложении(Использовать) Экспорт
КонецФункции

#КонецОбласти

#КонецОбласти