#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заголовок") Тогда
		Заголовок = Параметры["Заголовок"];
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокКоманды") Тогда
		Элементы.Готово.Заголовок = Параметры["ЗаголовокКоманды"];
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектИС") Тогда
		ТипОбъектаИС = Параметры.ОбъектИС.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	Элементы.НастроитьПравило.Видимость =
		ПравоДоступа("Добавление", Метаданные.Справочники.ПравилаИнтеграцииС1СДокументооборотом3);
	
	ТипыXDTO = Новый Массив;
	ТипыXDTO.Добавить("DMDocument");
	ТипыXDTO.Добавить("DMCorrespondent");
	ТипыXDTO.Добавить("DMMeeting");
	
	Для Каждого ТипXDTO Из ТипыXDTO Цикл
		НоваяСтрока = ТипыОбъектов.Добавить();
		НоваяСтрока.Тип = ТипXDTO;
		НоваяСтрока.Представление = ИнтеграцияС1СДокументооборот3КлиентСервер.ПредставлениеТипаОбъектаXDTO(ТипXDTO);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыОбъектов

&НаКлиенте
Процедура ТипыОбъектовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПравило(Команда)
	
	ПараметрыФормы = Новый Структура("ТипОбъектаИС", ТипОбъектаИС);
	
	ИнтеграцияС1СДокументооборот3Клиент.ОткрытьФормуПравилаИнтеграции("ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	ТекущиеДанные = Элементы.ТипыОбъектов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ТекущиеДанные.Тип);
	
КонецПроцедуры

#КонецОбласти