#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует структуру данных показателя виджета.
// 
// Возвращаемое значение:
//  Структура - Новый данные виджета:
//   * Ссылка - СправочникСсылка.ПоказателиВиджетов.
//   * Выражение - Строка
Функция НовыйДанныеПоказателяВиджета() Экспорт
	
	ДанныеПоказателяВиджета = Новый Структура;
	ДанныеПоказателяВиджета.Вставить("Ссылка", Справочники.ПоказателиВиджетов.ПустаяСсылка());
	ДанныеПоказателяВиджета.Вставить("Выражение", "");
	ДанныеПоказателяВиджета.Вставить("Действие", Перечисления.ДействияВиджетов.НичегоНеДелать);
	ДанныеПоказателяВиджета.Вставить("Источник", "");
	ДанныеПоказателяВиджета.Вставить("Шрифт", ШрифтыСтиля.ОбычныйШрифтТекста);
	ДанныеПоказателяВиджета.Вставить("АлгоритмДействия", "");
	
	Возврат ДанныеПоказателяВиджета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли