#Область СлужебныйПрограммныйИнтерфейс

Процедура РеквизитыМедицинскогоРегистраЭлементПриИзменении(Форма, ИмяЭлемента) Экспорт
	Форма.Модифицированность = Истина;
КонецПроцедуры

// Параметры вызова метода
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	Метод - Строка - метод выполнения запроса ("GET", "PUT", "POST" и т.п.).
//  	Команда - Строка - часть url запроса с именем метода и некоторыми параметрами.
//  	Тело - Строка - Тело запроса в формате json.
//  	РазделМедрегистра - Строка - Имя метода для Команды (см. выше).
//
Функция ПараметрыВызоваМетода() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Метод", Неопределено);
	Результат.Вставить("Команда", Неопределено);
	Результат.Вставить("Тело", Неопределено);
	Результат.Вставить("РазделМедрегистра", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	Если ИмяСобытия = "КлассифицированОбъектМетаданныхДляФедеральныхМедрегистров" Тогда
		ЗначенияРекизитов = МедицинскиеРегистрыВызовСервера.ЗначенияДополнительныхРеквизитовМедицинскихРегистров(Форма.Объект.Ссылка);
		ДополнительныеРеквизитыМедицинскихРегистров = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "ДополнительныеРеквизитыМедицинскихРегистров");
		Для Каждого ДополнительныйРеквизитМедицинскихРегистров Из ДополнительныеРеквизитыМедицинскихРегистров Цикл
			Для Каждого ЗначениеРекизита Из ЗначенияРекизитов Цикл 
			    Если ЗначениеРекизита.Классификатор = ДополнительныйРеквизитМедицинскихРегистров.Ссылка Тогда 
					ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ДополнительныйРеквизитМедицинскихРегистров.ИмяРеквизита, ЗначениеРекизита.Характеристика);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция КвалификацияПоКлассификатору(Элемент) Экспорт
	
	Если ТипЗнч(Элемент.ПараметрыВыбора) = Тип("ФиксированныйМассив") И Элемент.ПараметрыВыбора.Количество() = 1 Тогда 
		ИсточникВыбора = Элемент.ПараметрыВыбора[0];
		Если ИсточникВыбора.Имя = "Отбор.Владелец" И ИсточникВыбора.Значение = МедицинскиеРегистрыВызовСервера.КлассификаторКвалификацияМедицинскогоПерсонала() Тогда 
			 Возврат Элемент.ТекстРедактирования;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТокенДоступа(ДанныеСертификата, Пароль, АдресСервиса, МоментВыпуска, ИдентификаторИнформационнойСистемы) Экспорт
	
	МоментОкончания = МоментВыпуска + 300;
	
	JsonHeader = "{""x5c"": [""" + ДвоичныеДанныеВСтрокуBase64(ДанныеСертификата.Данные) + """], ""alg"": ""ECGOST3410-2012""}";
	JsonHeaderBinary = ПолучитьДвоичныеДанныеИзСтроки(JsonHeader, КодировкаТекста.UTF8, Ложь);
	JsonPayload = "{""sub"": """ + ИдентификаторИнформационнойСистемы 
			+ """, ""aud"": """ + АдресСервиса 
			+ """, ""exp"": " + Формат(МоментОкончания, "ЧГ=0")
			+ ", ""iat"": " + Формат(МоментВыпуска, "ЧГ=0") + "}";
	JsonPayloadBinary = ПолучитьДвоичныеДанныеИзСтроки(JsonPayload, КодировкаТекста.UTF8, Ложь); 
	
	JsonHeaderAndPayload = ДвоичныеДанныеВСтрокуBase64Url(JsonHeaderBinary) + "." + ДвоичныеДанныеВСтрокуBase64Url(JsonPayloadBinary);
	ДанныеНаПодпись = ПолучитьДвоичныеДанныеИзСтроки(JsonHeaderAndPayload, КодировкаТекста.UTF8, Ложь);

	ДанныеПодписи = Новый ПотокВПамяти();
	СертификатКриптографии = Новый СертификатКриптографии(ДанныеСертификата.Данные);
    МенеджерКриптографии = Новый МенеджерКриптографии("", "", 80);
    МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = Пароль;
	МенеджерКриптографии.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.НеВключать;
    ДвоичныеДанныеПодписи = МенеджерКриптографии.Подписать(ДанныеНаПодпись, СертификатКриптографии);
	
	JsonSignature = ДвоичныеДанныеВСтрокуBase64Url(ДвоичныеДанныеПодписи);
	
	Возврат JsonHeaderAndPayload + "." + JsonSignature;

КонецФункции

Функция ДвоичныеДанныеВСтрокуBase64(Знач ДвоичныеДанные)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанные);
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	Возврат СтрокаBase64;
	
КонецФункции

Функция ДвоичныеДанныеВСтрокуBase64Url(Знач ДвоичныеДанные)
	
	СтрокаBase64 = Base64Строка(ДвоичныеДанные);
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");  
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ВК, "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "=", "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "+", "-");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "/", "_");
	Возврат СтрокаBase64;
	
КонецФункции

Функция ТолькоЦифры(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	Цифры = "0123456789";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(ИсходнаяСтрока, ИндексСимвола, 1);
		Если СтрНайти(Цифры, Символ)>0 Тогда 
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаИзUTC(ДатаВремяUTC) Экспорт
	
	Если ДатаВремяUTC=Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиДатаВремя = СтрРазделить(ДатаВремяUTC, "T", Ложь);
	ЧастиДата = СтрРазделить(ЧастиДатаВремя[0], "-", Ложь);
	
	Возврат Дата(ЧастиДата[0] + ЧастиДата[1] + ЧастиДата[2]);
	
КонецФункции

// Формирует "командную" часть url запроса данных медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Строка - часть url, содержащая пары &параметр=значение.
//
Функция PersonKeyUrl(PersonKey, ПропуститьКлючMr = Ложь, ПропуститьКлючMo = Ложь) Экспорт 
	
	ЭлементыКоманды = Новый Массив;
	Если Не ПропуститьКлючMo И PersonKey.mo <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("mo=" + PersonKey.mo);
	КонецЕсли;
	Если Не ПропуститьКлючMr И PersonKey.mr <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("mr=" + ?(PersonKey.mr, "true", "false"));
	КонецЕсли;
	Если PersonKey.oid <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("oid=" + PersonKey.oid);
	КонецЕсли;
	Если PersonKey.snils <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("snils=" + PersonKey.snils);
	КонецЕсли; 
	documentId = ТегСоЗначениемИзЧислаИлиСтроки("documentId", PersonKey.documentId); 
	Если documentId <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить(documentId);
	КонецЕсли;
	Если PersonKey.serial <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("serial=" + PersonKey.serial);
	КонецЕсли;
	Если PersonKey.number <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("number=" + PersonKey.number);
	КонецЕсли;
	Если PersonKey.passDate <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("passDate=" + Формат(PersonKey.passDate, "ДФ=гггг-ММ-дд"));
	КонецЕсли;
	entityId = ТегСоЗначениемИзЧислаИлиСтроки("entityId", PersonKey.entityId); 
	Если entityId <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить(entityId);
	КонецЕсли;
	
	Возврат СтрСоединить(ЭлементыКоманды, "&");	      	
    
КонецФункции

Функция ТегСоЗначениемИзЧислаИлиСтроки(Тег, ЗначениеИдентификатора)
	Результат = Неопределено;
	Если ЗначениеИдентификатора<>Неопределено Тогда 
		Если ТипЗнч(ЗначениеИдентификатора)=Тип("Число") Тогда 
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2", Тег, Формат(ЗначениеИдентификатора, "ЧГ=0; ЧН="));
		ИначеЕсли ТипЗнч(ЗначениеИдентификатора)=Тип("Строка") Тогда 
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2", Тег, СокрЛП(ЗначениеИдентификатора));
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти