#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Печать кадрового плана (периоды в колонках).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьКадровогоПланаПериодыВКолонках";
	КомандаПечати.Представление = НСтр("ru = 'Кадровый план (периоды в колонках)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Печать кадрового плана (периоды в строках).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПечатьКадровогоПланаПериодыВСтроках";
	КомандаПечати.Представление = НСтр("ru = 'Кадровый план (периоды в строках)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
//  Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	Реквизиты.Добавить("ЗагрузкаИзФайлаПозицииКадровогоПлана.*");
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Переопределяет параметры загрузки данных из файла.
//
// Параметры:
//  Параметры - Структура:
//   * ИмяМакетаСШаблоном - Строка - наименование макета. Например, "ЗагрузкаИзФайла".
//   * ИмяТабличнойЧасти - Строка - Полное имя табличной части. Например, "Документ._ДемоСчетНаОплатуПокупателю.ТабличнаяЧасть.Товары"
//   * ОбязательныеКолонки - Массив из Строка - наименования обязательных для заполнения колонок.
//   * ТипДанныхКолонки - Соответствие из КлючИЗначение:
//      * Ключ - Строка - имя колонки;
//      * Значение - ОписаниеТипов - тип колонки загружаемых данных.
//   * ДополнительныеПараметры - Структура
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                               находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                               являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаСопоставления = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	СтруктурыСоответствуют = ДополнительныеПараметры.СтруктурыСоответствуют;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСотрудников", ВыгрузитьКолонку(ЗагружаемыеДанные, "Сотрудник"));
	Запрос.УстановитьПараметр("МассивКодовСотрудников", ВыгрузитьКолонку(ЗагружаемыеДанные, "КодСотрудника"));
	Запрос.УстановитьПараметр("МассивКодовПодразделений", ВыгрузитьКолонку(ЗагружаемыеДанные, "КодПодразделения"));
	Запрос.УстановитьПараметр("МассивПозиций", ВыгрузитьКолонку(ЗагружаемыеДанные, "Позиция"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Код КАК КодСотрудника,
		|	Сотрудники.Наименование КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование В(&МассивСотрудников)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	Сотрудники.Код КАК КодСотрудника,
		|	Сотрудники.Наименование КАК Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Код В(&МассивКодовСотрудников)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПозицииКадровогоПлана.Ссылка КАК Ссылка,
		|	ПозицииКадровогоПлана.Наименование КАК Позиция,
		|	ПозицииКадровогоПлана.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ПозицииКадровогоПлана КАК ПозицииКадровогоПлана
		|ГДЕ
		|	ПозицииКадровогоПлана.Наименование В(&МассивПозиций)";
	
	Если СтруктурыСоответствуют Тогда
		Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка,
			|	СтруктураПредприятия.КодИсточника КАК КодПодразделения,
			|	ПодразделенияОрганизаций.Владелец.Наименование КАК Организация
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|		ПО СтруктураПредприятия.Источник = ПодразделенияОрганизаций.Ссылка
			|ГДЕ
			|	СтруктураПредприятия.КодИсточника В (&МассивКодовПодразделений)";
	Иначе
		Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка,
			|	СтруктураПредприятия.Код КАК КодПодразделения
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|ГДЕ
			|	СтруктураПредприятия.Код В (&МассивКодовПодразделений)";
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатЗагрузки = Новый Структура;
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[0].Выгрузить(), "ТаблицаСотрудники", "Сотрудник");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[1].Выгрузить(), "ТаблицаКодыСотрудников", "КодСотрудника");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[2].Выгрузить(), "ТаблицаПозиции", "Позиция");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[3].Выгрузить(), "ТаблицаКодыПодразделений", "КодПодразделения");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаСотрудники.Скопировать(), "ТаблицаСотрудникиКодыСотрудников", "Сотрудник, КодСотрудника");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаПозиции.Скопировать(), "ТаблицаПозицииПодразделения", "Позиция, Подразделение");
	
	КэшДанныхЗагрузки = Новый Структура;
	КэшДанныхЗагрузки.Вставить("СоответствиеСтрокДатам", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеСотрудниковПоОтбору", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеСотрудников", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеКодовСотрудников", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеКодовПодразделений", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеПозиций", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеПозицийПодразделений", Новый Соответствие);
	
	Если СтруктурыСоответствуют Тогда
		СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаКодыПодразделений.Скопировать(), "ТаблицаОрганизацийКодыИсточников", "Организация, КодПодразделения");
		КэшДанныхЗагрузки.Вставить("СоответствиеПодразделенийПоОтбору", Новый Соответствие);
	КонецЕсли;
	
	ПустаяДата = Дата(1,1,1);
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		НоваяСтрока = ТаблицаСопоставления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Если НоваяСтрока.Период = ПустаяДата Тогда
			ЗаполнитьПериодИзСтрокиВДату(НоваяСтрока, КэшДанныхЗагрузки.СоответствиеСтрокДатам, СтрокаТаблицы.Период);
		КонецЕсли;
		ПроверитьНеоднозначностьСотрудника(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки, СтруктурыСоответствуют);
		ПроверитьНеоднозначностьПозиции(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//    ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//    ИмяКолонки               - Строка - Имя колонки, в который возникла неоднозначность. 
//    СписокНеоднозначностей    - Массив  - Массив для заполнения с неоднозначными данными.
//    ЗагружаемыеЗначенияСтрока - Строка  - Загружаемые данные, на основании которых возникла неоднозначность.
//    ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "Сотрудник" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Сотрудник);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);  
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Позиция" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Позиции.Ссылка
			|ИЗ
			|	Справочник.ПозицииКадровогоПлана КАК Позиции
			|ГДЕ
			|	Позиции.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Позиция);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Подразделение" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|ГДЕ
			|	СтруктураПредприятия.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьКадровыйПланПоДаннымШтатнойРасстановки", Истина);
	Методы.Вставить("ВывестиОтчетВТабличныйДокумент", Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сторнирует документ по учетам. Используется подсистемой исправления документов.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений исправляющего документа в которую будут добавлены сторно стоки.
//  Регистратор				 - ДокументСсылка				 - Документ регистратор исправления (документ исправление).
//  ИсправленныйДокумент	 - ДокументСсылка				 - Исправленный документ движения которого будут сторнированы.
//  СтруктураВидовУчета		 - Структура					 - Виды учета, по которым будет выполнено сторнирование исправленного документа.
//  					Состав полей см. в ПроведениеСервер.СтруктураВидовУчета().
//  ДополнительныеПараметры	 - Структура					 - Структура со свойствами:
//  					* ИсправлениеВТекущемПериоде - Булево - Истина когда исправление выполняется в периоде регистрации исправленного документа.
//						* ОтменаДокумента - Булево - Истина когда исправление вызвано документом СторнированиеНачислений.
//  					* ПериодРегистрации	- Дата - Период регистрации документа регистратора исправления.
// 
// Возвращаемое значение:
//  Булево - "Истина" если сторнирование выполнено этой функцией, "Ложь" если специальной процедуры не предусмотрено.
//
Функция СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры) Экспорт
	
	ИсправлениеДокументовЗарплатаКадры.СторнироватьДвиженияБезСпецификиУчетов(Движения, ИсправленныйДокумент, ДополнительныеПараметры);
	
	Возврат Истина;
	
КонецФункции

Функция СвойстваИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Реквизиты = ИсправлениеДокументовЗарплатаКадры.РеквизитыИсправляемогоДокумента();
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты);
	
КонецФункции

Функция ПараметрыИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Возврат ИсправлениеДокументовЗарплатаКадры.ПараметрыИсправляемогоДокумента(ДокументСсылка,
		СвойстваИсправляемогоДокумента(ДокументСсылка));
	
КонецФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьКадровогоПланаПериодыВКолонках") Тогда
		ТабличныйДокумент = СформироватьПечатнуюФормуКадровогоПлана(МассивОбъектов, ОбъектыПечати,
			КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВКолонках);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм, 
			"ПечатьКадровогоПланаПериодыВКолонках",
			НСтр("ru = 'Кадровый план (периоды в колонках)'"),
			ТабличныйДокумент);
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьКадровогоПланаПериодыВСтроках") Тогда
		ТабличныйДокумент = СформироватьПечатнуюФормуКадровогоПлана(МассивОбъектов, ОбъектыПечати,
			КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВСтроках);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПечатьКадровогоПланаПериодыВСтроках",
			НСтр("ru = 'Кадровый план (периоды в строках)'"),
			ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуКадровогоПлана(МассивОбъектов, ОбъектыПечати, ИмяВарианта)
	
	Результат = Новый ТабличныйДокумент;
	Результат.АвтоМасштаб = Истина;
	Результат.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПечатьКадровогоПлана" + ИмяВарианта;
	
	Если ИмяВарианта = КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВКолонках Тогда
		Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	КонецЕсли;
	
	ДанныеДляПечати = ДанныеПечатиКадровыхПланов(МассивОбъектов);
	
	Для Каждого ОписаниеКадровогоПлана Из ДанныеДляПечати Цикл
		РезультатПечати = ВывестиОтчетВТабличныйДокумент(ИмяВарианта, ОписаниеКадровогоПлана.ПозицииКадровогоПлана,
			ОписаниеКадровогоПлана.Ставки, ОписаниеКадровогоПлана.СвойстваПоказателей,
			ОписаниеКадровогоПлана.МесяцНачала, ОписаниеКадровогоПлана.МесяцОкончания);
		Результат.Вывести(РезультатПечати);
		Результат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПечатиКадровыхПланов(КадровыеПланы)
	
	ДанныеПечати = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КадровыеПланы", КадровыеПланы);
	Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", КадровоеПланирование.ПоказательКоличествоСтавок());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыйПлан.Ссылка КАК ДокументСсылка,
		|	КадровыйПлан.ПериодПланирования,
		|	КадровыйПлан.Сценарий,
		|	КадровыйПлан.Периодичность,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Документ.КадровыйПлан.ПозицииКадровогоПлана КАК КадровыйПланПозиции
		|			ГДЕ
		|				КадровыйПланПозиции.Ссылка = КадровыйПлан.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьПозиции,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияКоличестваСтавок
		|			ГДЕ
		|				ЗначенияКоличестваСтавок.КадровыйПлан = КадровыйПлан.Ссылка
		|				И ЗначенияКоличестваСтавок.Показатель = &ПоказательКоличествоСтавок)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьЗначенияКоличестваСтавок,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателей
		|			ГДЕ
		|				ЗначенияПоказателей.КадровыйПлан = КадровыйПлан.Ссылка
		|				И НЕ ЗначенияПоказателей.Показатель = &ПоказательКоличествоСтавок)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьЗначенияПоказателей
		|ИЗ
		|	Документ.КадровыйПлан КАК КадровыйПлан
		|ГДЕ
		|	КадровыйПлан.Ссылка В (&КадровыеПланы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйПланПозиции.Ссылка КАК ДокументСсылка,
		|	КадровыйПланПозиции.НомерСтроки,
		|	КадровыйПланПозиции.Позиция,
		|	КадровыйПланПозиции.ИдентификаторСтроки,
		|	КадровыйПланПозиции.Сотрудник
		|ИЗ
		|	Документ.КадровыйПлан.ПозицииКадровогоПлана КАК КадровыйПланПозиции
		|ГДЕ
		|	КадровыйПланПозиции.Ссылка В (&КадровыеПланы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияКоличестваСтавок.КадровыйПлан,
		|	ЗначенияКоличестваСтавок.ПериодПоказателя КАК Период,
		|	ЗначенияКоличестваСтавок.ИдентификаторСтроки,
		|	ЗначенияКоличестваСтавок.Значение КАК КоличествоСтавок
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияКоличестваСтавок
		|ГДЕ
		|	ЗначенияКоличестваСтавок.КадровыйПлан В (&КадровыеПланы)
		|	И ЗначенияКоличестваСтавок.Показатель = &ПоказательКоличествоСтавок
		|
		|УПОРЯДОЧИТЬ ПО
		|	КадровыйПлан,
		|	ИдентификаторСтроки,
		|	ПериодПоказателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.КадровыйПлан,
		|	ЗначенияПоказателей.ПериодПоказателя КАК Период,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.ИдентификаторСтроки,
		|	ЗначенияПоказателей.Значение,
		|	ЗначенияПоказателей.Показатель.Категория КАК Категория,
		|	ЗначенияПоказателей.Показатель.КраткоеНаименование КАК КраткоеНаименование
		|ПОМЕСТИТЬ ВТЗначенияПоказателей
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателей
		|ГДЕ
		|	ЗначенияПоказателей.КадровыйПлан В (&КадровыеПланы)
		|	И НЕ ЗначенияПоказателей.Показатель = &ПоказательКоличествоСтавок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПоказателей.КадровыйПлан,
		|	ЗначенияПоказателей.Период,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.ИдентификаторСтроки,
		|	ЗначенияПоказателей.Значение
		|ИЗ
		|	ВТЗначенияПоказателей КАК ЗначенияПоказателей
		|
		|УПОРЯДОЧИТЬ ПО
		|	КадровыйПлан,
		|	ИдентификаторСтроки,
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗначенияПоказателей.КадровыйПлан,
		|	ЗначенияПоказателей.Показатель,
		|	ЗначенияПоказателей.Категория КАК Категория,
		|	ЗначенияПоказателей.КраткоеНаименование КАК КраткоеНаименование
		|ИЗ
		|	ВТЗначенияПоказателей КАК ЗначенияПоказателей
		|
		|УПОРЯДОЧИТЬ ПО
		|	КадровыйПлан";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПозицииКадровогоПлана = РезультатЗапроса[1].Выбрать();
	ВыборкаСтавки = РезультатЗапроса[2].Выбрать();
	ВыборкаПоказатели = РезультатЗапроса[4].Выбрать();
	ВыборкаСоставПоказателей = РезультатЗапроса[5].Выбрать();
	
	РеквизитыТЧ = Метаданные.Документы.КадровыйПлан.ТабличныеЧасти.ПозицииКадровогоПлана.Реквизиты;
	ПозицииКадровогоПланаПустая = Новый ТаблицаЗначений;
	Для Каждого Реквизит Из РеквизитыТЧ Цикл
		ПозицииКадровогоПланаПустая.Колонки.Добавить(Реквизит.Имя, Реквизит.Тип);
	КонецЦикла;
	ОписаниеТиповЧ = ОбщегоНазначения.ОписаниеТипаЧисло(12, 2);
	ОписаниеТиповСП = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
	ПозицииКадровогоПланаПустая.Колонки.Добавить("Подразделение", ОписаниеТиповСП);
	ПозицииКадровогоПланаПустая.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	
	СтавкиПустая = ОбщегоНазначенияБЗК.ТаблицаЗначенийПоИмениРегистраСведений("ЗначенияПоказателейКадровыхПланов");
	СтавкиПустая.Колонки.ПериодПоказателя.Имя = "Период";
	
	ПоказателиПустая = СтавкиПустая.Скопировать();
	ПоказателиПустая.Колонки.Добавить("УникальноеИмяПоказателя", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	СтавкиПустая.Колонки.Значение.Имя = "КоличествоСтавок";
	СтавкиПустая.Колонки.Добавить("Подразделение", ОписаниеТиповСП);
	СтавкиПустая.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ПозицииКадровогоПлана"));
	СтавкиПустая.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СтавкиПустая.Колонки.Добавить("ЗависимаяВакансия", Новый ОписаниеТипов("Булево"));
	
	ВыборкаКадровыхПланов = РезультатЗапроса[0].Выбрать();
	
	Пока ВыборкаКадровыхПланов.Следующий() Цикл
		Описание = ОписаниеДляПечати();
		ЗаполнитьЗначенияСвойств(Описание, ВыборкаКадровыхПланов);
		
		СвойстваПоказателей = КадровоеПланирование.СвойстваПоказателейПоВыборкеРезультатаЗапроса(
			ВыборкаСоставПоказателей, ВыборкаКадровыхПланов.ДокументСсылка);
		УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
		МесяцНачала = Месяц(Описание.ПериодПланирования);
		ШагРегулирования = ЗарплатаКадрыРасширенный.КоличествоМесяцевПериодичности(Описание.Периодичность);
		МесяцОкончания = МесяцНачала + ШагРегулирования - 1;
		
		Описание.СвойстваПоказателей = СвойстваПоказателей;
		Описание.МесяцНачала = МесяцНачала;
		Описание.МесяцОкончания = МесяцОкончания;
		
		Если ВыборкаКадровыхПланов.ЕстьПозиции Тогда
			ПозицииКадровогоПлана = ПозицииКадровогоПланаПустая.Скопировать();
			Для Сч = МесяцНачала По МесяцОкончания Цикл
				ПозицииКадровогоПлана.Колонки.Добавить("КоличествоСтавок" + Сч, ОписаниеТиповЧ);
			КонецЦикла;
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				Для Сч = МесяцНачала По МесяцОкончания Цикл
					ПозицииКадровогоПлана.Колонки.Добавить(ИмяПоказателя + Сч, ОписаниеТиповЧ);
				КонецЦикла;
			КонецЦикла;
			Пока ВыборкаПозицииКадровогоПлана.НайтиСледующий(ВыборкаКадровыхПланов.ДокументСсылка, "ДокументСсылка") Цикл
				ЗаполнитьЗначенияСвойств(ПозицииКадровогоПлана.Добавить(), ВыборкаПозицииКадровогоПлана);
			КонецЦикла;
			Описание.ПозицииКадровогоПлана = ПозицииКадровогоПлана;
		КонецЕсли;
		Если ВыборкаКадровыхПланов.ЕстьЗначенияКоличестваСтавок Тогда
			Ставки = СтавкиПустая.Скопировать();
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				Ставки.Колонки.Добавить(ИмяПоказателя, ОписаниеТиповЧ);
			КонецЦикла;
			Пока ВыборкаСтавки.НайтиСледующий(ВыборкаКадровыхПланов.ДокументСсылка, "КадровыйПлан") Цикл
				ЗаполнитьЗначенияСвойств(Ставки.Добавить(), ВыборкаСтавки);
			КонецЦикла;
			Описание.Ставки = Ставки;
		КонецЕсли;
		Если ВыборкаКадровыхПланов.ЕстьЗначенияПоказателей Тогда
			Показатели = ПоказателиПустая.Скопировать();
			Пока ВыборкаПоказатели.НайтиСледующий(ВыборкаКадровыхПланов.ДокументСсылка, "КадровыйПлан") Цикл
				ЗаполнитьЗначенияСвойств(Показатели.Добавить(), ВыборкаПоказатели);
			КонецЦикла;
			ЗаполнитьУникальныеИменаПоказателей(Показатели);
			Описание.Показатели = Показатели;
		КонецЕсли;
		ЗаполнитьПоказателиВТаблицах(Описание.ПозицииКадровогоПлана, Описание.Ставки, Описание.Показатели,
			СвойстваПоказателей, МесяцНачала, МесяцОкончания);
		ДанныеПечати.Добавить(Описание);
	КонецЦикла;
	
	Возврат ДанныеПечати;
	
КонецФункции

Функция ОписаниеДляПечати()
	
	Описание = Новый Структура;
	Описание.Вставить("ДокументСсылка");
	Описание.Вставить("ПериодПланирования");
	Описание.Вставить("Сценарий");
	Описание.Вставить("Периодичность");
	Описание.Вставить("СвойстваПоказателей");
	Описание.Вставить("МесяцНачала");
	Описание.Вставить("МесяцОкончания");
	Описание.Вставить("ПозицииКадровогоПлана");
	Описание.Вставить("Ставки");
	Описание.Вставить("Показатели");
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

Процедура ЗаполнитьПоказателиВТаблицах(ПозицииКадровогоПлана, Ставки, Показатели, СвойстваПоказателей, МесяцНачала, МесяцОкончания) Экспорт
	
	Если ТипЗнч(ПозицииКадровогоПлана) = Тип("ДанныеФормыКоллекция") Тогда
		МассивПозиций = ПозицииКадровогоПлана.Выгрузить().ВыгрузитьКолонку("Позиция");
	Иначе
		МассивПозиций = ПозицииКадровогоПлана.ВыгрузитьКолонку("Позиция");
	КонецЕсли;
	ПодразделенияПозиций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивПозиций, "Подразделение");
	
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	КоличествоПоказателей = УникальныеИменаПоказателей.Количество();
	
	Для Каждого СтрокаПозиции Из ПозицииКадровогоПлана Цикл
		СтрокаПозиции.Подразделение = ПодразделенияПозиций.Получить(СтрокаПозиции.Позиция);
		ОтборСтрок = Новый Структура("ИдентификаторСтроки", СтрокаПозиции.ИдентификаторСтроки);
		НайденныеСтавки = Ставки.НайтиСтроки(ОтборСтрок);
		Для Каждого СтрокаСтавка Из НайденныеСтавки Цикл
			СтрокаСтавка.Позиция = СтрокаПозиции.Позиция;
			СтрокаСтавка.Подразделение = СтрокаПозиции.Подразделение;
			СтрокаСтавка.Сотрудник = СтрокаПозиции.Сотрудник;
			СтрокаСтавка.ЗависимаяВакансия = СтрокаПозиции.ЗависимаяВакансия;
			НомерМесяца = Месяц(СтрокаСтавка.Период);
			СтрокаПозиции["КоличествоСтавок" + НомерМесяца] = СтрокаСтавка.КоличествоСтавок;
			ОтборСтрок.Вставить("Период", СтрокаСтавка.Период);
			НайденныеПоказатели = Показатели.НайтиСтроки(ОтборСтрок);
			Для Каждого СтрокаПоказатель Из НайденныеПоказатели Цикл
				СтрокаСтавка[СтрокаПоказатель.УникальноеИмяПоказателя] = СтрокаПоказатель.Значение;
				СтрокаПозиции[СтрокаПоказатель.УникальноеИмяПоказателя + НомерМесяца] = СтрокаПоказатель.Значение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Вывести отчет в табличный документ.
// 
// Параметры:
//  ИмяВарианта - Строка - Имя варианта
//  ПозицииКадровогоПлана - ТаблицаЗначений - Позиции кадрового плана
//  Ставки - ТаблицаЗначений - Ставки
//  СвойстваПоказателей - Соответствие - Свойства показателей
//  МесяцНачала - Дата
//  МесяцОкончания - Дата
// 
// Возвращаемое значение:
//  ТабличныйДокумент - Вывести отчет в табличный документ
Функция ВывестиОтчетВТабличныйДокумент(ИмяВарианта, ПозицииКадровогоПлана, Ставки, СвойстваПоказателей, МесяцНачала, МесяцОкончания) Экспорт
	
	СхемаСКД = ПолучитьМакет("МакетСКДКадровыйПлан");
	КомпоновщикНастроек = КомпоновщикСхемы(СхемаСКД);
	
	ВариантОтчета = СхемаСКД.ВариантыНастроек.Найти(ИмяВарианта);
	НастройкиКомпоновки = ВариантОтчета.Настройки;
	
	УсловноеОформление = НастройкиКомпоновки.УсловноеОформление.Элементы.Добавить();
	УсловноеОформление.Использование = Истина;
	УсловноеОформление.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Формат"), "ЧН=");
	
	Для Сч = МесяцНачала По МесяцОкончания Цикл
		ДобавитьКоличествоСтавокВСКД(СхемаСКД, НастройкиКомпоновки, УсловноеОформление, "ПозицииКадровогоПлана", Сч);
	КонецЦикла;
	
	Для Каждого ИмяПоказателя Из СвойстваПоказателей.Получить("УникальныеИменаПоказателей") Цикл
		СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
		Заголовок = СвойстваПоказателя.КраткоеНаименование;
		Если ИмяВарианта = КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВСтроках Тогда
			ДобавитьПоказательВСКД(СхемаСКД, НастройкиКомпоновки, "Ставки", ИмяПоказателя, Заголовок);
		ИначеЕсли ИмяВарианта = КадровоеПланированиеКлиентСервер.ВариантыКомпоновки().МесяцыВКолонках Тогда
			Для Сч = МесяцНачала По МесяцОкончания Цикл
				ДобавитьПоказательВСКД(СхемаСКД, НастройкиКомпоновки, "ПозицииКадровогоПлана", ИмяПоказателя, Заголовок, Сч);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаСКД, Настройки, ДанныеРасшифровки);
	ВнешнийНаборДанных = Новый Структура;
	ВнешнийНаборДанных.Вставить("ПозицииКадровогоПлана", ПозицииКадровогоПлана);
	ВнешнийНаборДанных.Вставить("Ставки", Ставки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
		
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ДобавитьПоказательВСКД(СхемаКомпоновкиДанных, НастройкиКомпоновки, ИмяНабора, ИмяПоказателя, Заголовок, Счетчик = "")
	
	ИмяПоля = ИмяПоказателя + Счетчик;
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяНабора);
	
	ПолеНабораДанныхСхемыКомпоновкиДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанныхСхемыКомпоновкиДанных.Поле = ИмяПоля;
	ПолеНабораДанныхСхемыКомпоновкиДанных.ПутьКДанным = ИмяПоля;
	ПолеНабораДанныхСхемыКомпоновкиДанных.Заголовок = Заголовок;
	
	Ресурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Ресурс.ПутьКДанным = ИмяПоля;
	Ресурс.Выражение = СтрШаблон("Сумма(%1)", ИмяПоля);
	
	Если Счетчик = "" Тогда
		ВыбранноеПолеКомпоновкиДанных = НастройкиКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
		ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Иначе
		МесяцСтрокой = КадровоеПланирование.МесяцСтрокой(Счетчик, Истина);
		Для Каждого ВыбранноеПоле Из НастройкиКомпоновки.Выбор.Элементы Цикл
			Если ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") И ВыбранноеПоле.Заголовок = МесяцСтрокой Тогда
				ВыбранноеПолеКомпоновкиДанных = ВыбранноеПоле.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
				ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
				ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКоличествоСтавокВСКД(СхемаКомпоновкиДанных, НастройкиКомпоновки, УсловноеОформление, ИмяНабора, Счетчик = "")
	
	ИмяПоля = "КоличествоСтавок" + Счетчик;
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти(ИмяНабора);
	
	ПолеНабораДанныхСхемыКомпоновкиДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанныхСхемыКомпоновкиДанных.Поле = ИмяПоля;
	ПолеНабораДанныхСхемыКомпоновкиДанных.ВыражениеПредставления = СтрШаблон("Выразить(%1, ""Число(15,2)"")", ИмяПоля);
	ПолеНабораДанныхСхемыКомпоновкиДанных.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	ПолеНабораДанныхСхемыКомпоновкиДанных.ПутьКДанным = ИмяПоля;
	ПолеНабораДанныхСхемыКомпоновкиДанных.Заголовок = НСтр("ru = 'Колич. ставок'");
	
	Ресурс = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	Ресурс.ПутьКДанным = ИмяПоля;
	Ресурс.Выражение = СтрШаблон("Выразить(Сумма(%1), ""Число(15,2)"")", ИмяПоля);
	
	МесяцСтрокой = КадровоеПланирование.МесяцСтрокой(Счетчик, Истина);
	
	Для Каждого ВыбранноеПоле Из НастройкиКомпоновки.Выбор.Элементы Цикл
		Если ТипЗнч(ВыбранноеПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") И ВыбранноеПоле.Заголовок = МесяцСтрокой Тогда
			ВыбранноеПолеКомпоновкиДанных = ВыбранноеПоле.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
			ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВыбранноеПолеКомпоновкиДанных = УсловноеОформление.Поля.Элементы.Добавить();
	ВыбранноеПолеКомпоновкиДанных.Использование = Истина;
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	
КонецПроцедуры

// Заполнить кадровый план по данным штатной расстановки.
// 
// Параметры:
//  СвойстваПоказателей - Структура - Имена показателей сценария
//  МестоВСтруктуреПредприятия - СправочникСсылка.СтруктураПредприятия - Место в структуре предприятия
//  ПериодПланирования - Дата - Период планирования
//  Периодичность - ПеречислениеСсылка.Периодичность - Периодичность
//  Позиции - Массив из СправочникСсылка.ШтатноеРасписание - Выбранные позиции ШР
//  МаксимальныйИдентификаторСтроки - Число
//  ПериодЗакрытия - Дата - Дата последнего закрытого периода
// 
// Возвращаемое значение:
//  Структура - Заполнить кадровый план по данным штатной расстановки:
// * ПозицииКадровогоПлана - ТаблицаЗначений
// * Ставки - ТаблицаЗначений
// * Показатели - ТаблицаЗначений
Функция ЗаполнитьКадровыйПланПоДаннымШтатнойРасстановки(СвойстваПоказателей, МестоВСтруктуреПредприятия, ПериодПланирования,
		Периодичность, Позиции, МаксимальныйИдентификаторСтроки, ПериодЗакрытия) Экспорт
	
	ДанныеКадровогоПлана = ИнициализироватьТаблицыДляЗаполнения();
	
	КоличествоМесяцев = ЗарплатаКадрыРасширенный.КоличествоМесяцевПериодичности(Периодичность);
	МесяцНачала = Месяц(ПериодПланирования);
	МесяцОкончания = МесяцНачала + КоличествоМесяцев - 1;
	
	ДобавитьДинамическиеКолонкиВТаблицы(ДанныеКадровогоПлана, МесяцНачала, МесяцОкончания, СвойстваПоказателей);
	
	// Разделим показатели по категориям один раз перед циклом
	ПоказателиПоКатегориям = Новый Структура("Зарплата, СтраховыеВзносы, УникальныеИмена");
	ПоказателиПоКатегориям.Зарплата = Новый Массив;
	ПоказателиПоКатегориям.СтраховыеВзносы = Новый Массив;
	ПоказателиПоКатегориям.УникальныеИмена = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	Для Каждого ИмяПоказателя Из ПоказателиПоКатегориям.УникальныеИмена Цикл
		СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
		Если СвойстваПоказателя.Категория = Перечисления.КатегорииРасходовНаПерсонал.Зарплата Тогда
			ПоказателиПоКатегориям.Зарплата.Добавить(СвойстваПоказателя);
		ИначеЕсли СвойстваПоказателя.Категория = Перечисления.КатегорииРасходовНаПерсонал.СтраховыеВзносы Тогда
			ПоказателиПоКатегориям.СтраховыеВзносы.Добавить(СвойстваПоказателя);
		КонецЕсли;
	КонецЦикла;
	
	ИдентификаторСтроки = МаксимальныйИдентификаторСтроки + 1;
	ДатаОкончанияПериода = ДобавитьМесяц(ПериодПланирования, КоличествоМесяцев - 1);
	
	РезультатЗапроса = ТекущиеДанныеДляЗаполненияПоШтатнойРасстановке(МестоВСтруктуреПредприятия, ПериодПланирования,
		ДатаОкончанияПериода, Периодичность, Позиции, ПериодЗакрытия);
		
	ВыборкаПоПозициям = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоПозициям.Следующий() Цикл
		ОбработатьПозициюШтатногоРасписания(ВыборкаПоПозициям, ДанныеКадровогоПлана, ПоказателиПоКатегориям, 
			МесяцНачала, МесяцОкончания, ИдентификаторСтроки, ПериодПланирования, ДатаОкончанияПериода);
	КонецЦикла;
	
	Возврат ДанныеКадровогоПлана;
	
КонецФункции

// Инициализирует таблицы для заполнения кадрового плана.
// 
// Возвращаемое значение:
//  Структура - Заполнить кадровый план по данным штатной расстановки:
//   * ПозицииКадровогоПлана - ТаблицаЗначений
//   * Ставки - ТаблицаЗначений
//   * Показатели - ТаблицаЗначений
Функция ИнициализироватьТаблицыДляЗаполнения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	*
	|ИЗ
	|	Документ.КадровыйПлан.ПозицииКадровогоПлана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ПозицииКадровогоПлана.ПустаяСсылка) КАК Позиция,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗначенияКоличестваСтавок.ИдентификаторСтроки,
	|	ЗначенияКоличестваСтавок.ПериодПоказателя КАК Период,
	|	ЗначенияКоличестваСтавок.Значение КАК КоличествоСтавок,
	|	ЗначенияКоличестваСтавок.ЗначениеЗаполнения КАК КоличествоСтавокЗаполнения
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияКоличестваСтавок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗначенияПоказателей.ИдентификаторСтроки,
	|	ЗначенияПоказателей.ПериодПоказателя КАК Период,
	|	ЗначенияПоказателей.Показатель КАК Показатель,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК УникальноеИмяПоказателя,
	|	ЗначенияПоказателей.Значение КАК Значение,
	|	ЗначенияПоказателей.ЗначениеЗаполнения КАК ЗначениеЗаполнения
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателей";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеКадровогоПлана = Новый Структура("ПозицииКадровогоПлана, Ставки, Показатели");
	ДанныеКадровогоПлана.ПозицииКадровогоПлана = Результаты[0].Выгрузить();
	ДанныеКадровогоПлана.Ставки = Результаты[1].Выгрузить();
	ДанныеКадровогоПлана.Показатели = Результаты[2].Выгрузить();
	
	ДанныеКадровогоПлана.ПозицииКадровогоПлана.Колонки.Добавить("ПозицияШтатногоРасписания", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ДанныеКадровогоПлана.Ставки.Колонки.Добавить("ПозицияШтатногоРасписания", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ДанныеКадровогоПлана.Ставки.Колонки.Добавить("ЗависимаяВакансия", Новый ОписаниеТипов("Булево"));
	
	Возврат ДанныеКадровогоПлана;
	
КонецФункции

Процедура ДобавитьДинамическиеКолонкиВТаблицы(ДанныеКадровогоПлана, МесяцНачала, МесяцОкончания, СвойстваПоказателей)
	
	ТипЧислаСтавок = ОбщегоНазначения.ОписаниеТипаЧисло(22, 20, ДопустимыйЗнак.Неотрицательный);
	ТипЧислаПоказателя = ОбщегоНазначения.ОписаниеТипаЧисло(12,2);
	
	Для НомерМесяца = МесяцНачала По МесяцОкончания Цикл
		ДанныеКадровогоПлана.ПозицииКадровогоПлана.Колонки.Добавить("КоличествоСтавок" + НомерМесяца, ТипЧислаСтавок);
		ДанныеКадровогоПлана.ПозицииКадровогоПлана.Колонки.Добавить("КоличествоСтавокЗаполнения" + НомерМесяца, ТипЧислаСтавок);
	КонецЦикла;
	
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
		ДанныеКадровогоПлана.Ставки.Колонки.Добавить(ИмяПоказателя, ТипЧислаПоказателя);
		ДанныеКадровогоПлана.Ставки.Колонки.Добавить(ИмяПоказателя + "Заполнения", ТипЧислаПоказателя);
		Для НомерМесяца = МесяцНачала По МесяцОкончания Цикл
			ДанныеКадровогоПлана.ПозицииКадровогоПлана.Колонки.Добавить(ИмяПоказателя + НомерМесяца, ТипЧислаПоказателя);
			ДанныеКадровогоПлана.ПозицииКадровогоПлана.Колонки.Добавить(СтрШаблон("%1Заполнения%2", ИмяПоказателя, НомерМесяца), ТипЧислаПоказателя);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обрабатывает данные по одной позиции штатного расписания.
Процедура ОбработатьПозициюШтатногоРасписания(ВыборкаПоПозициям, ДанныеКадровогоПлана, ПоказателиПоКатегориям, МесяцНачала,
		МесяцОкончания, ИдентификаторСтроки, ПериодПланирования, ДатаПолученияДанных)
	
	Если Не ЗначениеЗаполнено(ВыборкаПоПозициям.Позиция) Тогда
		Возврат;
	КонецЕсли;
	
	ПозицияКадровогоПлана = ?(ЗначениеЗаполнено(ВыборкаПоПозициям.ПозицияКадровогоПлана),
		ВыборкаПоПозициям.ПозицияКадровогоПлана, НоваяПозицияКадровогоПлана(ВыборкаПоПозициям.Позиция, ДатаПолученияДанных));
	Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияКадровогоПлана, "Подразделение");
	
	ПараметрыРасчетаВзносовСотрудников = Новый Соответствие;
	ПредельнаяВеличинаБазыСтраховыхВзносов =
		УчетСтраховыхВзносов.ТекущаяПредельнаяВеличинаБазыСтраховыхВзносов(КонецГода(ПериодПланирования));
	
	ОбщиеЗанятыеСтавкиПоМесяцам = НовыйЗанятыеСтавкиПоМесяцам(МесяцНачала, МесяцОкончания);
	
	КоличествоОбработанныхСтавок = 0;
	ИдентификаторСтрокиШаблона = 0;
	
	ВыборкаПоЗависимости = ВыборкаПоПозициям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоЗависимости.Следующий() Цикл
		ВыборкаПоСотрудникам = ВыборкаПоЗависимости.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЗависимаяСтрокаДляСотрудника = Неопределено;
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			ЗанятыеСтавкиПоМесяцамСотрудника = НовыйЗанятыеСтавкиПоМесяцам(МесяцНачала, МесяцОкончания);
			ПараметрыРасчетаВзносов = ПараметрыРасчетаВзносовСотрудников.Получить(ВыборкаПоСотрудникам.Сотрудник);
			Если ПараметрыРасчетаВзносов = Неопределено Тогда
				ПараметрыРасчетаВзносов = НовыйПараметрыРасчетаВзносов(ПредельнаяВеличинаБазыСтраховыхВзносов);
			КонецЕсли;
			Если Не ВыборкаПоСотрудникам.ЗависимаяВакансия Тогда
				СтрокаПозицииКадровогоПлана = НоваяСтрокаПозицииКадровогоПлана(ПозицияКадровогоПлана, ВыборкаПоПозициям.Позиция,
					ИдентификаторСтроки, Подразделение, ВыборкаПоСотрудникам, ДанныеКадровогоПлана);
			
				ВыборкаПоПериодам = ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоПериодам.Следующий() Цикл
					НомерМесяца = Месяц(ВыборкаПоПериодам.Период);
					ЗанятоСтавок = ОбщиеЗанятыеСтавкиПоМесяцам.Получить(НомерМесяца);
					ЗаполнитьПоказателиПозиции(ВыборкаПоПериодам, СтрокаПозицииКадровогоПлана, ДанныеКадровогоПлана,
						ПараметрыРасчетаВзносов, ПоказателиПоКатегориям.Зарплата, ПоказателиПоКатегориям.СтраховыеВзносы);
					ОбщиеЗанятыеСтавкиПоМесяцам.Вставить(НомерМесяца, ЗанятоСтавок + ВыборкаПоПериодам.КоличествоСтавокСотрудника);
					ЗанятыеСтавкиПоМесяцамСотрудника.Вставить(НомерМесяца, ВыборкаПоПериодам.КоличествоСтавокСотрудника);
				КонецЦикла;
				КоличествоСтавокСотрудника = КоличествоПолностьюУчтенныхСтавок(Истина, ЗанятыеСтавкиПоМесяцамСотрудника, ВыборкаПоСотрудникам.КоличествоСтавокСотрудника);
			Иначе
				Если ЗависимаяСтрокаДляСотрудника = Неопределено Тогда
					ЗависимаяСтрокаДляСотрудника = НоваяСтрокаПозицииКадровогоПлана(ПозицияКадровогоПлана,
						ВыборкаПоПозициям.Позиция, ИдентификаторСтроки, Подразделение, ВыборкаПоСотрудникам, ДанныеКадровогоПлана);
				КонецЕсли;
				
				ВыборкаПоПериодам = ВыборкаПоСотрудникам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоПериодам.Следующий() Цикл
					НомерМесяца = Месяц(ВыборкаПоПериодам.Период);
					ЗанятоСтавок = ОбщиеЗанятыеСтавкиПоМесяцам.Получить(НомерМесяца);
					СтавкаКЗаполнению = Мин(ВыборкаПоПериодам.КоличествоСтавокСотрудника, ВыборкаПоСотрудникам.КоличествоСтавок - ЗанятоСтавок);
					Если СтавкаКЗаполнению > 0 Тогда
						Если ВыборкаПоСотрудникам.КоличествоСтавок < ЗанятоСтавок + СтавкаКЗаполнению Тогда
							ЗависимаяСтрокаДляСотрудника = НоваяСтрокаПозицииКадровогоПлана(ПозицияКадровогоПлана,
								ВыборкаПоПозициям.Позиция, ИдентификаторСтроки, Подразделение, ВыборкаПоСотрудникам,
								ДанныеКадровогоПлана);
							ОбщиеЗанятыеСтавкиПоМесяцам = НовыйЗанятыеСтавкиПоМесяцам(МесяцНачала, МесяцОкончания);
						КонецЕсли;
						ЗаполнитьПоказателиПозиции(ВыборкаПоПериодам, ЗависимаяСтрокаДляСотрудника, ДанныеКадровогоПлана,
							ПараметрыРасчетаВзносов, ПоказателиПоКатегориям.Зарплата, ПоказателиПоКатегориям.СтраховыеВзносы,
								СтавкаКЗаполнению);
						ОбщиеЗанятыеСтавкиПоМесяцам.Вставить(НомерМесяца, ЗанятоСтавок + СтавкаКЗаполнению);
						ЗанятыеСтавкиПоМесяцамСотрудника.Вставить(НомерМесяца, СтавкаКЗаполнению);
					КонецЕсли;
				КонецЦикла;
				КоличествоСтавокСотрудника = КоличествоПолностьюУчтенныхСтавок(Ложь, ЗанятыеСтавкиПоМесяцамСотрудника);
			КонецЕсли;
			КоличествоОбработанныхСтавок = КоличествоОбработанныхСтавок + КоличествоСтавокСотрудника;
			Если ИдентификаторСтрокиШаблона = 0 И КоличествоОбработанныхСтавок > 0 Тогда
				ИдентификаторСтрокиШаблона = ИдентификаторСтроки - 1;
			КонецЕсли;
			ПараметрыРасчетаВзносовСотрудников.Вставить(ВыборкаПоСотрудникам.Сотрудник, ПараметрыРасчетаВзносов);
		КонецЦикла;
	КонецЦикла;
	
	// Создаем строки для полностью вакантных ставок
	КоличествоПолностьюВакантныхСтавок = ВыборкаПоПозициям.КоличествоСтавок - КоличествоОбработанныхСтавок;
	Если КоличествоПолностьюВакантныхСтавок > 0 Тогда
		СоздатьСтрокиДляВакантныхСтавок(КоличествоПолностьюВакантныхСтавок, ИдентификаторСтрокиШаблона, ДанныеКадровогоПлана,
			МесяцНачала, МесяцОкончания, ПоказателиПоКатегориям.УникальныеИмена, ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

// Создает строки для вакантных ставок на основе последней заполненной строки.
Процедура СоздатьСтрокиДляВакантныхСтавок(КоличествоСтавокОстаток, ИдентификаторСтрокиШаблона, ДанныеКадровогоПлана, МесяцНачала, МесяцОкончания, УникальныеИменаПоказателей, ИдентификаторСтроки)
	
	КоличествоИтераций = ЗарплатаКадрыКлиентСервер.Округлить(
		КоличествоСтавокОстаток, 1, Перечисления.ПравилаОкругленияПриРасчетеЗарплаты.ВБольшуюСторону);
		
	СтруктураОтбора = Новый Структура("ИдентификаторСтроки", ИдентификаторСтрокиШаблона);
	НайденныеСтрокиПозиции = ДанныеКадровогоПлана.ПозицииКадровогоПлана.НайтиСтроки(СтруктураОтбора);
	НайденныеСтрокиСтавки = ДанныеКадровогоПлана.Ставки.НайтиСтроки(СтруктураОтбора);
	НайденныеСтрокиПоказатели = ДанныеКадровогоПлана.Показатели.НайтиСтроки(СтруктураОтбора);
	
	Если НайденныеСтрокиПозиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Счетчик = 1 По КоличествоИтераций Цикл
		КоличествоСтавок = ?(КоличествоСтавокОстаток < 1, КоличествоСтавокОстаток, 1);
		
		НоваяСтрокаПозиция = ДанныеКадровогоПлана.ПозицииКадровогоПлана.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПозиция, НайденныеСтрокиПозиции[0], , "Сотрудник");
		НоваяСтрокаПозиция.ИдентификаторСтроки = ИдентификаторСтроки;
		Для НомерМесяца = МесяцНачала По МесяцОкончания Цикл
			НоваяСтрокаПозиция["КоличествоСтавок" + НомерМесяца] = КоличествоСтавок;
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл 
				НоваяСтрокаПозиция[ИмяПоказателя + НомерМесяца] =
					КоличествоСтавок * НоваяСтрокаПозиция[СтрШаблон("%1Заполнения%2", ИмяПоказателя, НомерМесяца)];
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаСтавка Из НайденныеСтрокиСтавки Цикл
			НоваяСтрокаСтавка = ДанныеКадровогоПлана.Ставки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтавка, СтрокаСтавка, , "Сотрудник");
			НоваяСтрокаСтавка.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрокаСтавка.КоличествоСтавок = КоличествоСтавок;
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				НоваяСтрокаСтавка[ИмяПоказателя] = КоличествоСтавок * НоваяСтрокаСтавка[СтрШаблон("%1Заполнения", ИмяПоказателя)];
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаПоказатель Из НайденныеСтрокиПоказатели Цикл
			НоваяСтрокаПоказатель = ДанныеКадровогоПлана.Показатели.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказатель, СтрокаПоказатель);
			НоваяСтрокаПоказатель.ИдентификаторСтроки = ИдентификаторСтроки;
			Если НоваяСтрокаПоказатель.Значение = 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаПоказатель.Значение = КоличествоСтавок * НоваяСтрокаПоказатель.ЗначениеЗаполнения;
		КонецЦикла;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
		КоличествоСтавокОстаток = КоличествоСтавокОстаток - КоличествоСтавок;
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяСтрокаПозицииКадровогоПлана(
		ПозицияКадровогоПлана, ПозицияШтатногоРасписания, ИдентификаторСтроки, Подразделение, ВыборкаСотрудник, ДанныеКадровогоПлана)
	
	СтрокаПозицииКадровогоПлана = ДанныеКадровогоПлана.ПозицииКадровогоПлана.Добавить();
	СтрокаПозицииКадровогоПлана.Позиция = ПозицияКадровогоПлана;
	СтрокаПозицииКадровогоПлана.ПозицияШтатногоРасписания = ПозицияШтатногоРасписания;
	СтрокаПозицииКадровогоПлана.ИдентификаторСтроки = ИдентификаторСтроки;
	СтрокаПозицииКадровогоПлана.Подразделение = Подразделение;
	СтрокаПозицииКадровогоПлана.ЗависимаяВакансия = ВыборкаСотрудник.ЗависимаяВакансия;
	Если Не СтрокаПозицииКадровогоПлана.ЗависимаяВакансия Тогда
		СтрокаПозицииКадровогоПлана.Сотрудник = ВыборкаСотрудник.Сотрудник;
	КонецЕсли;
	ИдентификаторСтроки = ИдентификаторСтроки + 1;
	
	Возврат СтрокаПозицииКадровогоПлана;
	
КонецФункции

Процедура ЗаполнитьПоказателиПозиции(ВыборкаПериод, НоваяСтрока, ДанныеКадровогоПлана, ПараметрыРасчетаВзносов, Знач ПоказателиЗарплата, Знач ПоказателиСтраховыеВзносы, СтавкаКЗаполнению = Неопределено)
	
	НоваяСтрокаСтавка = ДанныеКадровогоПлана.Ставки.Добавить();
	НоваяСтрокаСтавка.Период = ВыборкаПериод.Период;
	НоваяСтрокаСтавка.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
	НоваяСтрокаСтавка.КоличествоСтавок = ?(СтавкаКЗаполнению = Неопределено, ВыборкаПериод.КоличествоСтавокСотрудника, СтавкаКЗаполнению);
	НоваяСтрокаСтавка.КоличествоСтавокЗаполнения = ?(НоваяСтрокаСтавка.КоличествоСтавок = 0, 1, НоваяСтрокаСтавка.КоличествоСтавок);
	НоваяСтрокаСтавка.Сотрудник = НоваяСтрока.Сотрудник;
	НоваяСтрокаСтавка.ЗависимаяВакансия = НоваяСтрока.ЗависимаяВакансия;
	НоваяСтрокаСтавка.Позиция = НоваяСтрока.Позиция;
	НоваяСтрокаСтавка.ПозицияШтатногоРасписания = НоваяСтрока.ПозицияШтатногоРасписания;
	НоваяСтрокаСтавка.Подразделение = НоваяСтрока.Подразделение;
	НомерМесяца = Месяц(ВыборкаПериод.Период);
	НоваяСтрока["КоличествоСтавок" + НомерМесяца] = НоваяСтрокаСтавка.КоличествоСтавок;
	НоваяСтрока["КоличествоСтавокЗаполнения" + НомерМесяца] = НоваяСтрокаСтавка.КоличествоСтавокЗаполнения;
	
	ВзносыБезУчетаСтавки = НоваяСтрокаВзносов();
	ВзносыСУчетомСтавки = НоваяСтрокаВзносов();
	Для Каждого СвойстваПоказателя Из ПоказателиЗарплата Цикл
		НоваяСтрокаПоказатель = ДанныеКадровогоПлана.Показатели.Добавить();
		НоваяСтрокаПоказатель.Период = ВыборкаПериод.Период;
		НоваяСтрокаПоказатель.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
		НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
		НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
		ЗначениеБезУчетаСтавки = 0;
		ЗначениеСУчетомСтавки = 0;
		Для Каждого СтрокаНачисление Из СвойстваПоказателя.Показатель.Начисления Цикл
			Выборка = ВыборкаПериод.Выбрать();
			Пока Выборка.СледующийПоЗначениюПоля("Начисление") Цикл
				Если Выборка.Начисление = СтрокаНачисление.Начисление Тогда
					ТекущееЗначениеБезУчетаСтавки = Выборка.Размер / ?(НоваяСтрокаСтавка.КоличествоСтавок = 0, 1, НоваяСтрокаСтавка.КоличествоСтавок);
					Если Выборка.ЭтоНачисленияШтатногоРасписания Тогда 
						ТекущееЗначениеСУчетомСтавки = Выборка.Размер * НоваяСтрокаСтавка.КоличествоСтавок;
					ИначеЕсли НоваяСтрокаСтавка.КоличествоСтавок = 0 Тогда
						ТекущееЗначениеСУчетомСтавки = 0;
					Иначе
						ТекущееЗначениеСУчетомСтавки = Выборка.Размер;
					КонецЕсли;
					ЗначениеБезУчетаСтавки = ЗначениеБезУчетаСтавки + ТекущееЗначениеБезУчетаСтавки;
					ЗначениеСУчетомСтавки = ЗначениеСУчетомСтавки + ТекущееЗначениеСУчетомСтавки;
					ПараметрыРасчетаВзносов.БазаСтраховыхВзносовБезУчетаСтавки = ПараметрыРасчетаВзносов.БазаСтраховыхВзносовБезУчетаСтавки + ЗначениеБезУчетаСтавки;
					ПараметрыРасчетаВзносов.БазаСтраховыхВзносовСУчетомСтавки = ПараметрыРасчетаВзносов.БазаСтраховыхВзносовСУчетомСтавки + ЗначениеСУчетомСтавки;
					Для Каждого КлючИЗначение Из ВзносыБезУчетаСтавки Цикл
						Если Выборка.ЭтоФактическиеНачисления Тогда
							ВзносыБезУчетаСтавки[КлючИЗначение.Ключ] = КлючИЗначение.Значение + Выборка[КлючИЗначение.Ключ];
							ВзносыСУчетомСтавки[КлючИЗначение.Ключ] = КлючИЗначение.Значение + Выборка[КлючИЗначение.Ключ] * НоваяСтрокаСтавка.КоличествоСтавок;
						Иначе
							Если КлючИЗначение.Ключ = "ПФРСПревышения" Или КлючИЗначение.Ключ = "ВзносыПоЕдиномуТарифу" Тогда
								Продолжить;
							ИначеЕсли КлючИЗначение.Ключ = "ПФРДоПредельнойВеличины" Тогда
								Если ПараметрыРасчетаВзносов.БазаСтраховыхВзносовБезУчетаСтавки - ТекущееЗначениеБезУчетаСтавки > ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов Тогда
									ВзносыБезУчетаСтавки.ПФРСПревышения = ВзносыБезУчетаСтавки.ПФРСПревышения + ТекущееЗначениеБезУчетаСтавки / 100 * Выборка.СтавкаСПревышенияПредела;
								ИначеЕсли ПараметрыРасчетаВзносов.БазаСтраховыхВзносовБезУчетаСтавки > ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов Тогда
									ТекущееЗначениеПоказателяСПревышения = ПараметрыРасчетаВзносов.БазаСтраховыхВзносовБезУчетаСтавки - ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов;
									ТекущееЗначениеПоказателяДоПревышения = ТекущееЗначениеБезУчетаСтавки - ТекущееЗначениеПоказателяСПревышения;
									ВзносыБезУчетаСтавки.ПФРДоПредельнойВеличины = ВзносыБезУчетаСтавки.ПФРДоПредельнойВеличины + ТекущееЗначениеПоказателяДоПревышения / 100 * Выборка.СтавкаПФРДоПредельнойВеличины;
									ВзносыБезУчетаСтавки.ПФРСПревышения = ВзносыБезУчетаСтавки.ПФРСПревышения + ТекущееЗначениеПоказателяСПревышения / 100 * Выборка.СтавкаСПревышенияПредела;
								Иначе
									ВзносыБезУчетаСтавки.ПФРДоПредельнойВеличины = ВзносыБезУчетаСтавки.ПФРДоПредельнойВеличины + ТекущееЗначениеБезУчетаСтавки / 100 * Выборка.СтавкаПФРДоПредельнойВеличины;
								КонецЕсли;
								ВзносыБезУчетаСтавки.ВзносыПоЕдиномуТарифу = ВзносыБезУчетаСтавки.ВзносыПоЕдиномуТарифу + ВзносыБезУчетаСтавки.ПФРДоПредельнойВеличины + ВзносыБезУчетаСтавки.ПФРСПревышения;
								
								Если ПараметрыРасчетаВзносов.БазаСтраховыхВзносовСУчетомСтавки - ТекущееЗначениеСУчетомСтавки > ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов Тогда
									ВзносыСУчетомСтавки.ПФРСПревышения = ВзносыСУчетомСтавки.ПФРСПревышения + ТекущееЗначениеСУчетомСтавки / 100 * Выборка.СтавкаСПревышенияПредела;
								ИначеЕсли ПараметрыРасчетаВзносов.БазаСтраховыхВзносовСУчетомСтавки > ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов Тогда
									ТекущееЗначениеПоказателяСПревышения = ПараметрыРасчетаВзносов.БазаСтраховыхВзносовСУчетомСтавки - ПараметрыРасчетаВзносов.ПредельнаяВеличинаБазыСтраховыхВзносов;
									ТекущееЗначениеПоказателяДоПревышения = ТекущееЗначениеСУчетомСтавки - ТекущееЗначениеПоказателяСПревышения;
									ВзносыСУчетомСтавки.ПФРДоПредельнойВеличины = ВзносыСУчетомСтавки.ПФРДоПредельнойВеличины + ТекущееЗначениеПоказателяДоПревышения / 100 * Выборка.СтавкаПФРДоПредельнойВеличины;
									ВзносыСУчетомСтавки.ПФРСПревышения = ВзносыСУчетомСтавки.ПФРСПревышения + ТекущееЗначениеПоказателяСПревышения / 100 * Выборка.СтавкаСПревышенияПредела;
								Иначе
									ВзносыСУчетомСтавки.ПФРДоПредельнойВеличины = ВзносыСУчетомСтавки.ПФРДоПредельнойВеличины + ТекущееЗначениеСУчетомСтавки / 100 * Выборка.СтавкаПФРДоПредельнойВеличины;
								КонецЕсли;
								ВзносыСУчетомСтавки.ВзносыПоЕдиномуТарифу = ВзносыСУчетомСтавки.ВзносыПоЕдиномуТарифу + ВзносыСУчетомСтавки.ПФРДоПредельнойВеличины + ВзносыСУчетомСтавки.ПФРСПревышения;
							Иначе
								ВзносыБезУчетаСтавки[КлючИЗначение.Ключ] = КлючИЗначение.Значение + Выборка[КлючИЗначение.Ключ];
								ВзносыСУчетомСтавки[КлючИЗначение.Ключ] = КлючИЗначение.Значение + Выборка[КлючИЗначение.Ключ] * НоваяСтрокаСтавка.КоличествоСтавок;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		НоваяСтрокаПоказатель.Значение = ЗначениеСУчетомСтавки;
		НоваяСтрокаПоказатель.ЗначениеЗаполнения = ЗначениеБезУчетаСтавки;
		
		НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя] = НоваяСтрокаПоказатель.Значение;
		НоваяСтрока[СвойстваПоказателя.УникальноеИмяПоказателя + НомерМесяца] = НоваяСтрокаПоказатель.Значение;
		НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя + "Заполнения"] = НоваяСтрокаПоказатель.ЗначениеЗаполнения;
		НоваяСтрока[СтрШаблон("%1Заполнения%2", СвойстваПоказателя.УникальноеИмяПоказателя, НомерМесяца)] = НоваяСтрокаПоказатель.ЗначениеЗаполнения;
	КонецЦикла;
	Для Каждого СвойстваПоказателя Из ПоказателиСтраховыеВзносы Цикл
		НоваяСтрокаПоказатель = ДанныеКадровогоПлана.Показатели.Добавить();
		НоваяСтрокаПоказатель.Период = ВыборкаПериод.Период;
		НоваяСтрокаПоказатель.ИдентификаторСтроки = НоваяСтрока.ИдентификаторСтроки;
		НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
		НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
		ЗначениеСУчетомСтавки = 0;
		ЗначениеБезУчетаСтавки = 0;
		Для Каждого СтрокаВзносы Из СвойстваПоказателя.Показатель.СтраховыеВзносы Цикл
			ИмяВидаВзносов = ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаВзносы.ВидВзносов);
			ЗначениеСУчетомСтавки = ЗначениеСУчетомСтавки + ВзносыСУчетомСтавки[ИмяВидаВзносов];
			ЗначениеБезУчетаСтавки = ЗначениеБезУчетаСтавки + ВзносыБезУчетаСтавки[ИмяВидаВзносов];
		КонецЦикла;
		НоваяСтрокаПоказатель.Значение = ЗначениеСУчетомСтавки;
		НоваяСтрокаПоказатель.ЗначениеЗаполнения = ЗначениеБезУчетаСтавки;
		
		НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя] = НоваяСтрокаПоказатель.Значение;
		НоваяСтрока[СвойстваПоказателя.УникальноеИмяПоказателя + НомерМесяца] = НоваяСтрокаПоказатель.Значение;
		НоваяСтрокаСтавка[СвойстваПоказателя.УникальноеИмяПоказателя + "Заполнения"] = НоваяСтрокаПоказатель.ЗначениеЗаполнения;
		НоваяСтрока[СтрШаблон("%1Заполнения%2", СвойстваПоказателя.УникальноеИмяПоказателя, НомерМесяца)] = НоваяСтрокаПоказатель.ЗначениеЗаполнения;
	КонецЦикла;
	
КонецПроцедуры

Функция НоваяСтрокаВзносов()
	
	НоваяСтрокаВзносов = Новый Структура();
	Для Каждого ВидОперации Из КадровоеПланирование.ВидыОперацийПоЗарплатеВзносы() Цикл
		НоваяСтрокаВзносов.Вставить(ОбщегоНазначения.ИмяЗначенияПеречисления(ВидОперации), 0);
	КонецЦикла;
	
	Возврат НоваяСтрокаВзносов;
	
КонецФункции

Функция ТекущиеДанныеДляЗаполненияПоШтатнойРасстановке(МестоВСтруктуреПредприятия, НачалоПериода, ОкончаниеПериода, Периодичность, МассивПозиций, ПериодЗакрытия)
	
	УдалитьВТ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("ДатаОкончания", ОкончаниеПериода);

	Если МассивПозиций.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("Позиции", МассивПозиций); 
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	&ДатаОкончания КАК Период,
			|	ШтатноеРасписание.Ссылка КАК Позиция
			|ПОМЕСТИТЬ ВТПозиции
			|ИЗ
			|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|ГДЕ
			|	ШтатноеРасписание.Ссылка В (&Позиции)
			|	И ШтатноеРасписание.Утверждена
			|	И НЕ ШтатноеРасписание.Закрыта";
		Запрос.Выполнить();
		ОрганизационнаяСтруктура.СоздатьВТМестаПозицийВСтруктуреПредприятияПоВременнойТаблице(Запрос.МенеджерВременныхТаблиц);
		ИмяТаблицыПозицииПодразделений = "ВТМестаПозицийВСтруктуреПредприятия";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	&ДатаОкончания КАК Период,
			|	СтруктураПредприятия.Ссылка КАК Подразделение
			|ПОМЕСТИТЬ ВТСтруктураПредприятияОтбор
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия";
		Если ЗначениеЗаполнено(МестоВСтруктуреПредприятия) Тогда
			Запрос.Текст = Запрос.Текст +
				"
				|ГДЕ
				|	СтруктураПредприятия.Ссылка В ИЕРАРХИИ(&МестоВСтруктуреПредприятия)";
			Запрос.УстановитьПараметр("МестоВСтруктуреПредприятия", МестоВСтруктуреПредприятия);
		КонецЕсли;
		
		Запрос.Выполнить();
		УдалитьВТ.Добавить("ВТСтруктураПредприятияОтбор");
		
		ОрганизационнаяСтруктура.СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТСтруктураПредприятияОтбор");
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТПозиции.Позиция КАК Позиция,
			|	ВТПозиции.Подразделение КАК Подразделение
			|ПОМЕСТИТЬ ВТПодразделенияОтбор
			|ИЗ
			|	ВТПозицииПодразделений КАК ВТПозиции
			|ГДЕ
			|	ВТПозиции.Позиция.Утверждена
			|	И НЕ ВТПозиции.Позиция.Закрыта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТПодразделенияОтбор.Позиция КАК Позиция
			|ИЗ
			|	ВТПодразделенияОтбор КАК ВТПодразделенияОтбор";
		МассивПозиций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Позиция");
		ИмяТаблицыПозицииПодразделений = "ВТПодразделенияОтбор";
	КонецЕсли;	
	УдалитьВТ.Добавить(ИмяТаблицыПозицииПодразделений);
	
	УстановитьПривилегированныйРежим(Истина);
	// Получаем сотрудников, работавших в периоде на этих местах
	КадровоеПланирование.СоздатьВТПериодыРаботыСотрудников(
		Запрос.МенеджерВременныхТаблиц, ИмяТаблицыПозицииПодразделений, НачалоПериода, КонецМесяца(ОкончаниеПериода));
	УдалитьВТ.Добавить("ВТПериодыРаботыСотрудников");
	
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТПериоды(Запрос.МенеджерВременныхТаблиц, КонецГода(НачалоПериода),
		КонецГода(ОкончаниеПериода), "ГОД", , "ВТПериодыРасширенныхСведенийОДоходах", Истина);
	УчетСтраховыхВзносов.СформироватьВТОписаниеТарифов(НачалоПериода, ОкончаниеПериода, Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтраховыеВзносыПоФизическимЛицам.Сотрудник КАК Сотрудник,
		|	СтраховыеВзносыПоФизическимЛицам.Начисление КАК Начисление,
		|	НАЧАЛОПЕРИОДА(СтраховыеВзносыПоФизическимЛицам.Период, МЕСЯЦ) КАК Период,
		|	СтраховыеВзносыПоФизическимЛицам.Подразделение КАК Подразделение,
		|	СтраховыеВзносыПоФизическимЛицам.Организация КАК Организация,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРДоПредельнойВеличины) КАК ПФРДоПредельнойВеличины,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРСПревышения) КАК ПФРСПревышения,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРПоСуммарномуТарифу) КАК ПФРПоСуммарномуТарифу,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ФСС) КАК ФСС,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ФССНесчастныеСлучаи) КАК ФССНесчастныеСлучаи,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ФФОМС) КАК ФФОМС,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРНаДоплатуЛетчикам) КАК ПФРНаДоплатуЛетчикам,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРНаДоплатуШахтерам) КАК ПФРНаДоплатуШахтерам,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРСтраховая) КАК ПФРСтраховая,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРНакопительная) КАК ПФРНакопительная,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ТФОМС) КАК ТФОМС,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	СУММА(СтраховыеВзносыПоФизическимЛицам.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ПОМЕСТИТЬ ВТСтраховыеВзносыОбщие
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыПоФизическимЛицам КАК СтраховыеВзносыПоФизическимЛицам
		|ГДЕ
		|	СтраховыеВзносыПоФизическимЛицам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СтраховыеВзносыПоФизическимЛицам.Организация = &Организация
		|	И СтраховыеВзносыПоФизическимЛицам.Подразделение В ИЕРАРХИИ(&Подразделение)
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраховыеВзносыПоФизическимЛицам.Сотрудник,
		|	СтраховыеВзносыПоФизическимЛицам.Начисление,
		|	НАЧАЛОПЕРИОДА(СтраховыеВзносыПоФизическимЛицам.Период, МЕСЯЦ),
		|	СтраховыеВзносыПоФизическимЛицам.Подразделение,
		|	СтраховыеВзносыПоФизическимЛицам.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Сотрудник,
		|	Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачисленияУдержанияПоСотрудникам.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) КАК Период,
		|	НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК Начисление,
		|	НачисленияУдержанияПоСотрудникам.Подразделение КАК Подразделение,
		|	НачисленияУдержанияПоСотрудникам.Организация КАК Организация,
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТНачислениеЗарплаты
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ) <= &ПериодЗакрытия
		|			ИЛИ &НеОграничиватьПериодЗакрытия)
		|	И НачисленияУдержанияПоСотрудникам.Организация = &Организация
		|	И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)
		|	И НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияУдержанияПоСотрудникам.Сотрудник,
		|	НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ),
		|	НачисленияУдержанияПоСотрудникам.НачислениеУдержание,
		|	НачисленияУдержанияПоСотрудникам.Подразделение,
		|	НачисленияУдержанияПоСотрудникам.Организация
		|
		|ИМЕЮЩИЕ
		|	СУММА(НачисленияУдержанияПоСотрудникам.Сумма) <> 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	Сотрудник,
		|	Начисление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
		|	ПериодыРаботыСотрудников.Период КАК Период,
		|	НачислениеЗарплаты.Начисление КАК Начисление,
		|	НачислениеЗарплаты.Подразделение КАК Подразделение,
		|	НачислениеЗарплаты.Организация КАК Организация,
		|	НачислениеЗарплаты.Сумма КАК Сумма,
		|	ПериодыРаботыСотрудников.Позиция КАК ДолжностьПоШтатномуРасписанию,
		|	ПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавок,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРДоПредельнойВеличины, 0) КАК ПФРДоПредельнойВеличины,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРСПревышения, 0) КАК ПФРСПревышения,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРПоСуммарномуТарифу, 0) КАК ПФРПоСуммарномуТарифу,
		|	ЕСТЬNULL(СтраховыеВзносы.ФСС, 0) КАК ФСС,
		|	ЕСТЬNULL(СтраховыеВзносы.ФССНесчастныеСлучаи, 0) КАК ФССНесчастныеСлучаи,
		|	ЕСТЬNULL(СтраховыеВзносы.ФФОМС, 0) КАК ФФОМС,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРНаДоплатуЛетчикам, 0) КАК ПФРНаДоплатуЛетчикам,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРНаДоплатуШахтерам, 0) КАК ПФРНаДоплатуШахтерам,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРСтраховая, 0) КАК ПФРСтраховая,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРНакопительная, 0) КАК ПФРНакопительная,
		|	ЕСТЬNULL(СтраховыеВзносы.ТФОМС, 0) КАК ТФОМС,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка, 0) КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	ЕСТЬNULL(СтраховыеВзносы.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка, 0) КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ПОМЕСТИТЬ ВТФактическиеНачисленияИВзносыСотрудников
		|ИЗ
		|	ВТПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачислениеЗарплаты КАК НачислениеЗарплаты
		|		ПО ПериодыРаботыСотрудников.Сотрудник = НачислениеЗарплаты.Сотрудник
		|			И ПериодыРаботыСотрудников.Период = НачислениеЗарплаты.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтраховыеВзносыОбщие КАК СтраховыеВзносы
		|		ПО (НачислениеЗарплаты.Период = СтраховыеВзносы.Период)
		|			И (НачислениеЗарплаты.Сотрудник = СтраховыеВзносы.Сотрудник)
		|			И (НачислениеЗарплаты.Начисление = СтраховыеВзносы.Начисление)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ДолжностьПоШтатномуРасписанию,
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодЗакрытия", ПериодЗакрытия);	
	Запрос.УстановитьПараметр("НеОграничиватьПериодЗакрытия", Не ЗначениеЗаполнено(ПериодЗакрытия));	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	
	Организация = Неопределено;
	Подразделение = Неопределено;
	
	Если ЗначениеЗаполнено(МестоВСтруктуреПредприятия) Тогда
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МестоВСтруктуреПредприятия, "Источник");
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
			Подразделение = Организация;
			Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Владелец");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Организация = &Организация", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СтраховыеВзносыПоФизическимЛицам.Организация = &Организация", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НачисленияУдержанияПоСотрудникам.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СтраховыеВзносыПоФизическимЛицам.Подразделение В ИЕРАРХИИ(&Подразделение)", "");
	КонецЕсли;
	
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписание(ОкончаниеПериода, Организация, Подразделение, МассивПозиций);
	УправлениеШтатнымРасписанием.СоздатьВТШтатноеРасписание(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения);
	
	ПараметрыПостроения = УправлениеШтатнымРасписанием.ПараметрыПостроенияВТШтатноеРасписаниеПоТаблицеФильтра("ВТШтатноеРасписание");
	ПараметрыПостроения.ИмяПоляПериод = "Дата";
	УправлениеШтатнымРасписанием.СоздатьВТНачисленияШтатногоРасписания(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПостроения);
	
	КадровоеПланирование.ДополнитьТаблицуПлановыхНачисленийШтатногоРасписания(Запрос.МенеджерВременныхТаблиц);	
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПозицииШтатногоРасписания.Период КАК Период,
	|	ПозицииШтатногоРасписания.ПозицияШтатногоРасписания.Владелец.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТОтборОрганизацийДляАУСН
	|ИЗ
	|	ВТШтатноеРасписание КАК ПозицииШтатногоРасписания";

	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыРасширенный.ПараметрыПостроенияВТОрганизацииПрименяющиеАУСН("ВТОтборОрганизацийДляАУСН");
	ЗапросВТОрганизацииПрименяющиеАУСН = ЗарплатаКадрыРасширенный.ЗапросВТОрганизацииПрименяющиеАУСН(ПараметрыПостроения, "ВТОрганизацииАУСН");
	ЗапросВТОрганизацииПрименяющиеАУСН.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТОрганизацииПрименяющиеАУСН.Выполнить();
	
	ЗапросВТНачисленияНадбавкаЗаВредность = ЗарплатаКадрыРасширенный.ЗапросВТНачисленияНадбавкаЗаВредность("ВТОрганизацииАУСН");
	ЗапросВТНачисленияНадбавкаЗаВредность.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТНачисленияНадбавкаЗаВредность.Выполнить();

	ЗапросВТНачисленияРайонныйКоэффициент = ЗарплатаКадрыРасширенный.ЗапросВТНачисленияРайонныйКоэффициент("ВТОрганизацииАУСН");
	ЗапросВТНачисленияРайонныйКоэффициент.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТНачисленияРайонныйКоэффициент.Выполнить();

	ЗапросВТНачисленияСевернаяНадбавка = ЗарплатаКадрыРасширенный.ЗапросВТНачисленияСевернаяНадбавка("ВТОрганизацииАУСН");
	ЗапросВТНачисленияСевернаяНадбавка.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросВТНачисленияСевернаяНадбавка.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияШтатногоРасписания.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	НачисленияШтатногоРасписания.Начисление КАК Начисление,
		|	НачисленияШтатногоРасписания.Размер КАК Размер
		|ПОМЕСТИТЬ ВТНачисленияШтатногоРасписания
		|ИЗ
		|	ВТНачисленияПозицийШтатногоРасписания КАК НачисленияШтатногоРасписания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтатноеРасписание.ПозицияШтатногоРасписания,
		|	ЕСТЬNULL(НачисленияНадбавкаЗаВредность.Начисление, &ВРНадбавкаЗаВредность),
		|	ШтатноеРасписание.НадбавкаЗаВредностьРазмер
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияНадбавкаЗаВредность КАК НачисленияНадбавкаЗаВредность
		|		ПО ШтатноеРасписание.Период = НачисленияНадбавкаЗаВредность.Период
		|		И ШтатноеРасписание.ПозицияШтатногоРасписания.Владелец.ГоловнаяОрганизация = НачисленияНадбавкаЗаВредность.ГоловнаяОрганизация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтатноеРасписание.ПозицияШтатногоРасписания,
		|	ЕСТЬNULL(НачисленияРайонныйКоэффициент.Начисление, &ВРРайонныйКоэффициент),
		|	ШтатноеРасписание.РайонныйКоэффициентРазмер
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияРайонныйКоэффициент КАК НачисленияРайонныйКоэффициент
		|		ПО ШтатноеРасписание.Период = НачисленияРайонныйКоэффициент.Период
		|		И ШтатноеРасписание.ПозицияШтатногоРасписания.Владелец.ГоловнаяОрганизация = НачисленияРайонныйКоэффициент.ГоловнаяОрганизация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ШтатноеРасписание.ПозицияШтатногоРасписания,
		|	ЕСТЬNULL(НачисленияСевернаяНадбавка.Начисление, &ВРСевернаяНадбавка),
		|	ШтатноеРасписание.СевернаяНадбавкаРазмер
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияСевернаяНадбавка КАК НачисленияСевернаяНадбавка
		|		ПО ШтатноеРасписание.Период = НачисленияСевернаяНадбавка.Период
		|		И ШтатноеРасписание.ПозицияШтатногоРасписания.Владелец.ГоловнаяОрганизация = НачисленияСевернаяНадбавка.ГоловнаяОрганизация";

	Запрос.УстановитьПараметр("ВРНадбавкаЗаВредность", ЗарплатаКадрыРасширенныйПовтИсп.НачислениеНадбавкаЗаВредность(Ложь));
	Запрос.УстановитьПараметр("ВРРайонныйКоэффициент", ЗарплатаКадрыРасширенныйПовтИсп.НачислениеРайонныйКоэффициент(Ложь));
	Запрос.УстановитьПараметр("ВРСевернаяНадбавка", ЗарплатаКадрыРасширенныйПовтИсп.НачислениеСевернаяНадбавка(Ложь));
	
	Запрос.Выполнить();
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;
		
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(
			"ВТШтатноеРасписание",
			"Организация"),
		ПараметрыПостроения);
	
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ПараметрыПостроения.ВсеЗаписи = Истина;
	УчетСтраховыхВзносов.ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, НачалоПериода, Ложь);
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТШтатноеРасписание");
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"ПрименяемыеТарифыСтраховыхВзносов",
		Запрос.МенеджерВременныхТаблиц,
		Истина,
		ОписаниеФильтра,
		ПараметрыПостроения);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияШтатногоРасписания.Начисление,
		|	НачисленияШтатногоРасписания.Размер,
		|	НачисленияШтатногоРасписания.ПозицияШтатногоРасписания КАК ПозицияШтатногоРасписания,
		|	ЕСТЬNULL(РазмерыТарифныхСтавок.ПФР, 0) КАК СтавкаПФРДоПредельнойВеличины,
		|	ЕСТЬNULL(РазмерыТарифныхСтавок.СтавкаСПревышенияПредела, 0) КАК СтавкаСПревышенияПредела,
		|	0 КАК ПФРДоПредельнойВеличины,
		|	0 КАК ПФРСПревышения,
		|	0 КАК ПФРПоСуммарномуТарифу,
		|	НачисленияШтатногоРасписания.Размер / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ФСС, 0) КАК ФСС,
		|	НачисленияШтатногоРасписания.Размер / 100 * ЕСТЬNULL(СтавкаВзносаОтНесчастныхСлучаев.Ставка, 0) КАК
		|		ФССНесчастныеСлучаи,
		|	НачисленияШтатногоРасписания.Размер / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ФФОМС, 0) КАК ФФОМС,
		|	0 КАК ПФРНаДоплатуЛетчикам,
		|	0 КАК ПФРНаДоплатуШахтерам,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	0 КАК ПФРСтраховая,
		|	НачисленияШтатногоРасписания.Размер / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ПФРНакопительная, 0) КАК ПФРНакопительная,
		|	НачисленияШтатногоРасписания.Размер / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ТФОМС, 0) КАК ТФОМС,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ПОМЕСТИТЬ ВТНачисленияИВзносыШтатногоРасписания
		|ИЗ
		|	ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияШтатногоРасписания КАК НачисленияШтатногоРасписания
		|		ПО ШтатноеРасписание.ПозицияШтатногоРасписания = НачисленияШтатногоРасписания.ПозицияШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносов
		|		ПО ГОД(ШтатноеРасписание.Период) = ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период)
		|		И ВЫРАЗИТЬ(ШтатноеРасписание.Организация КАК
		|			Справочник.Организации).ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
		|		ПО ВЫБОР
		|			КОГДА ВЫРАЗИТЬ(ШтатноеРасписание.Подразделение КАК
		|				Справочник.ПодразделенияОрганизаций).ПрименяемыйЛьготныйТерриториальныйТариф = ЗНАЧЕНИЕ(Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка)
		|				ТОГДА ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа
		|			ИНАЧЕ ВЫРАЗИТЬ(ШтатноеРасписание.Подразделение КАК
		|				Справочник.ПодразделенияОрганизаций).ПрименяемыйЛьготныйТерриториальныйТариф
		|		КОНЕЦ = РазмерыТарифныхСтавок.ВидТарифа
		|		И (ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период) = РазмерыТарифныхСтавок.РасчетныйПериод)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних КАК СтавкаВзносаОтНесчастныхСлучаев
		|		ПО ГОД(ШтатноеРасписание.Период) = ГОД(СтавкаВзносаОтНесчастныхСлучаев.Период)
		|		И ШтатноеРасписание.Организация = СтавкаВзносаОтНесчастныхСлучаев.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПозицияШтатногоРасписания";
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПериодыРаботыСотрудников.ПериодРаботы КАК Период,
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТФильтрДляПлановыхНачисленийСотрудников
		|ИЗ
		|	ВТПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников";
	Запрос.Выполнить();
	
	КадровоеПланирование.СоздатьВТПлановыеНачисленияСотрудников(Запрос.МенеджерВременныхТаблиц,
		"ВТФильтрДляПлановыхНачисленийСотрудников");
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПериодыРаботыСотрудников.Период КАК Период,
		|	ПериодыРаботыСотрудников.Позиция КАК Позиция,
		|	ПериодыРаботыСотрудников.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
		|	ПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавок,
		|	ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
		|	ПериодыРаботыСотрудников.Организация КАК Организация,
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
		|	ПлановыеНачисленияСотрудников.Начисление КАК Начисление,
		|	ПлановыеНачисленияСотрудников.Сумма КАК Сумма,
		|	ЕСТЬNULL(РазмерыТарифныхСтавок.ПФР, 0) КАК СтавкаПФРДоПредельнойВеличины,
		|	ЕСТЬNULL(РазмерыТарифныхСтавок.СтавкаСПревышенияПредела, 0) КАК СтавкаСПревышенияПредела,
		|	0 КАК ПФРДоПредельнойВеличины,
		|	0 КАК ПФРСПревышения,
		|	0 КАК ПФРПоСуммарномуТарифу,
		|	ПлановыеНачисленияСотрудников.Сумма / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ФСС, 0) КАК ФСС,
		|	ПлановыеНачисленияСотрудников.Сумма / 100 * ЕСТЬNULL(СтавкаВзносаОтНесчастныхСлучаев.Ставка, 0) КАК
		|		ФССНесчастныеСлучаи,
		|	ПлановыеНачисленияСотрудников.Сумма / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ФФОМС, 0) КАК ФФОМС,
		|	0 КАК ПФРНаДоплатуЛетчикам,
		|	0 КАК ПФРНаДоплатуШахтерам,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	0 КАК ПФРСтраховая,
		|	ПлановыеНачисленияСотрудников.Сумма / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ПФРНакопительная, 0) КАК ПФРНакопительная,
		|	ПлановыеНачисленияСотрудников.Сумма / 100 * ЕСТЬNULL(РазмерыТарифныхСтавок.ТФОМС, 0) КАК ТФОМС,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	0 КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	0 КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ПОМЕСТИТЬ ВТПлановыеНачисленияИВзносыСотрудников
		|ИЗ
		|	ВТПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПлановыеНачисленияСотрудников КАК ПлановыеНачисленияСотрудников
		|		ПО ПериодыРаботыСотрудников.Сотрудник = ПлановыеНачисленияСотрудников.Сотрудник
		|		И ПериодыРаботыСотрудников.ПериодРаботы = ПлановыеНачисленияСотрудников.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрименяемыеТарифыСтраховыхВзносовСрезПоследних КАК ПрименяемыеТарифыСтраховыхВзносов
		|		ПО ГОД(ПлановыеНачисленияСотрудников.Период) = ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период)
		|		И ПлановыеНачисленияСотрудников.ГоловнаяОрганизация = ПрименяемыеТарифыСтраховыхВзносов.ГоловнаяОрганизация
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмерыТарифныхСтавок КАК РазмерыТарифныхСтавок
		|		ПО ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа = РазмерыТарифныхСтавок.ВидТарифа
		|		И ГОД(ПрименяемыеТарифыСтраховыхВзносов.Период) = РазмерыТарифныхСтавок.РасчетныйПериод
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаевСрезПоследних КАК СтавкаВзносаОтНесчастныхСлучаев
		|		ПО ГОД(ПериодыРаботыСотрудников.Период) = ГОД(СтавкаВзносаОтНесчастныхСлучаев.Период)
		|		И ПериодыРаботыСотрудников.Организация = СтавкаВзносаОтНесчастныхСлучаев.Организация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Позиция";
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоФактическиеНачисления,
		|	ИСТИНА КАК ЭтоНачисленияШтатногоРасписания,
		|	ПериодыРаботыСотрудников.Период КАК Период,
		|	ПериодыРаботыСотрудников.Позиция КАК Позиция,
		|	ПериодыРаботыСотрудников.ПозицияКадровогоПлана КАК ПозицияКадровогоПлана,
		|	ШтатноеРасписание.КоличествоСтавок КАК КоличествоСтавок,
		|	ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
		|	ПериодыРаботыСотрудников.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА ПериодыРаботыСотрудников.Сотрудник = НЕОПРЕДЕЛЕНО
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗависимаяВакансия,
		|	ПериодыРаботыСотрудников.СотрудникГруппировка КАК Сотрудник,
		|	ПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавокСотрудника,
		|	НачисленияШтатногоРасписания.Начисление КАК Начисление,
		|	НачисленияШтатногоРасписания.Размер КАК Размер,
		|	НачисленияШтатногоРасписания.СтавкаПФРДоПредельнойВеличины КАК СтавкаПФРДоПредельнойВеличины,
		|	НачисленияШтатногоРасписания.СтавкаСПревышенияПредела КАК СтавкаСПревышенияПредела,
		|	НачисленияШтатногоРасписания.ПФРДоПредельнойВеличины КАК ПФРДоПредельнойВеличины,
		|	НачисленияШтатногоРасписания.ПФРСПревышения КАК ПФРСПревышения,
		|	НачисленияШтатногоРасписания.ПФРДоПредельнойВеличины + НачисленияШтатногоРасписания.ПФРСПревышения КАК ВзносыПоЕдиномуТарифу,
		|	НачисленияШтатногоРасписания.ПФРПоСуммарномуТарифу КАК ПФРПоСуммарномуТарифу,
		|	НачисленияШтатногоРасписания.ФСС КАК ФСС,
		|	НачисленияШтатногоРасписания.ФССНесчастныеСлучаи КАК ФССНС,
		|	НачисленияШтатногоРасписания.ФФОМС КАК ФФОМС,
		|	НачисленияШтатногоРасписания.ПФРНаДоплатуЛетчикам КАК ПФРДополнительныйТарифЛЭ,
		|	НачисленияШтатногоРасписания.ПФРНаДоплатуШахтерам КАК ПФРДополнительныйТарифШахтеры,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	НачисленияШтатногоРасписания.ПФРСтраховая КАК ПФРСтраховаяЧасть,
		|	НачисленияШтатногоРасписания.ПФРНакопительная КАК ПФРНакопительнаяЧасть,
		|	НачисленияШтатногоРасписания.ТФОМС КАК ТФОМС,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка КАК ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	НачисленияШтатногоРасписания.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка КАК ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ИЗ
		|	ВТПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ПО ПериодыРаботыСотрудников.Позиция = ШтатноеРасписание.ПозицияШтатногоРасписания
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИВзносыШтатногоРасписания КАК НачисленияШтатногоРасписания
		|		ПО ПериодыРаботыСотрудников.Позиция = НачисленияШтатногоРасписания.ПозицияШтатногоРасписания
		|ГДЕ
		|	НЕ ПериодыРаботыСотрудников.Позиция ЕСТЬ NULL
		|	И НЕ (ПериодыРаботыСотрудников.Период, ПериодыРаботыСотрудников.Позиция, ПериодыРаботыСотрудников.Сотрудник) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Т.Период,
		|					Т.ДолжностьПоШтатномуРасписанию,
		|					Т.Сотрудник
		|				ИЗ
		|					ВТФактическиеНачисленияИВзносыСотрудников КАК Т
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Т.Период,
		|					Т.Позиция,
		|					Т.Сотрудник
		|				ИЗ
		|					ВТПлановыеНачисленияИВзносыСотрудников КАК Т)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ПлановыеНачисленияИВзносыСотрудников.Период,
		|	ПлановыеНачисленияИВзносыСотрудников.Позиция,
		|	ПлановыеНачисленияИВзносыСотрудников.ПозицияКадровогоПлана,
		|	ШтатноеРасписание.КоличествоСтавок,
		|	ПлановыеНачисленияИВзносыСотрудников.Подразделение,
		|	ПлановыеНачисленияИВзносыСотрудников.Организация,
		|	ЛОЖЬ,
		|	ПлановыеНачисленияИВзносыСотрудников.Сотрудник,
		|	ПлановыеНачисленияИВзносыСотрудников.КоличествоСтавок,
		|	ПлановыеНачисленияИВзносыСотрудников.Начисление,
		|	ПлановыеНачисленияИВзносыСотрудников.Сумма,
		|	ПлановыеНачисленияИВзносыСотрудников.СтавкаПФРДоПредельнойВеличины,
		|	ПлановыеНачисленияИВзносыСотрудников.СтавкаСПревышенияПредела,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРДоПредельнойВеличины,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРСПревышения,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРДоПредельнойВеличины + ПлановыеНачисленияИВзносыСотрудников.ПФРСПревышения,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРПоСуммарномуТарифу,
		|	ПлановыеНачисленияИВзносыСотрудников.ФСС,
		|	ПлановыеНачисленияИВзносыСотрудников.ФССНесчастныеСлучаи,
		|	ПлановыеНачисленияИВзносыСотрудников.ФФОМС,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРНаДоплатуЛетчикам,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРНаДоплатуШахтерам,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРСтраховая,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРНакопительная,
		|	ПлановыеНачисленияИВзносыСотрудников.ТФОМС,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	ПлановыеНачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ИЗ
		|	ВТПлановыеНачисленияИВзносыСотрудников КАК ПлановыеНачисленияИВзносыСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтатноеРасписание КАК ШтатноеРасписание
		|		ПО ПлановыеНачисленияИВзносыСотрудников.Позиция = ШтатноеРасписание.ПозицияШтатногоРасписания
		|ГДЕ
		|	НЕ (ПлановыеНачисленияИВзносыСотрудников.Период, ПлановыеНачисленияИВзносыСотрудников.Позиция, ПлановыеНачисленияИВзносыСотрудников.Сотрудник) В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					Т.Период,
		|					Т.ДолжностьПоШтатномуРасписанию,
		|					Т.Сотрудник
		|				ИЗ
		|					ВТФактическиеНачисленияИВзносыСотрудников КАК Т)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	НачисленияИВзносыСотрудников.Период,
		|	НачисленияИВзносыСотрудников.ДолжностьПоШтатномуРасписанию,
		|	ЕСТЬNULL(ПериодыРаботыСотрудников.ПозицияКадровогоПлана, ЗНАЧЕНИЕ(Справочник.ПозицииКадровогоПлана.ПустаяСсылка)),
		|	ЕСТЬNULL(ПериодыРаботыСотрудников.КоличествоСтавок, 0),
		|	НачисленияИВзносыСотрудников.Подразделение,
		|	НачисленияИВзносыСотрудников.Организация,
		|	ЛОЖЬ,
		|	НачисленияИВзносыСотрудников.Сотрудник,
		|	НачисленияИВзносыСотрудников.КоличествоСтавок,
		|	НачисленияИВзносыСотрудников.Начисление,
		|	НачисленияИВзносыСотрудников.Сумма,
		|	0,
		|	0,
		|	НачисленияИВзносыСотрудников.ПФРДоПредельнойВеличины,
		|	НачисленияИВзносыСотрудников.ПФРСПревышения,
		|	НачисленияИВзносыСотрудников.ПФРДоПредельнойВеличины + НачисленияИВзносыСотрудников.ПФРСПревышения,
		|	НачисленияИВзносыСотрудников.ПФРПоСуммарномуТарифу,
		|	НачисленияИВзносыСотрудников.ФСС,
		|	НачисленияИВзносыСотрудников.ФССНесчастныеСлучаи,
		|	НачисленияИВзносыСотрудников.ФФОМС,
		|	НачисленияИВзносыСотрудников.ПФРНаДоплатуЛетчикам,
		|	НачисленияИВзносыСотрудников.ПФРНаДоплатуШахтерам,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
		|	НачисленияИВзносыСотрудников.ПФРСтраховая,
		|	НачисленияИВзносыСотрудников.ПФРНакопительная,
		|	НачисленияИВзносыСотрудников.ТФОМС,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки,
		|	НачисленияИВзносыСотрудников.ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
		|ИЗ
		|	ВТФактическиеНачисленияИВзносыСотрудников КАК НачисленияИВзносыСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников
		|		ПО НачисленияИВзносыСотрудников.ДолжностьПоШтатномуРасписанию = ПериодыРаботыСотрудников.Позиция
		|			И НачисленияИВзносыСотрудников.Период = ПериодыРаботыСотрудников.Период
		|ГДЕ
		|	НЕ НачисленияИВзносыСотрудников.ДолжностьПоШтатномуРасписанию ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Позиция,
		|	ЗависимаяВакансия,
		|	Сотрудник УБЫВ,
		|	Период,
		|	Начисление
		|ИТОГИ
		|	МАКСИМУМ(ПозицияКадровогоПлана),
		|	МАКСИМУМ(КоличествоСтавок),
		|	МАКСИМУМ(КоличествоСтавокСотрудника)
		|ПО
		|	Позиция,
		|	ЗависимаяВакансия,
		|	Сотрудник,
		|	Период";
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция НоваяПозицияКадровогоПлана(ПозицияШтатногоРасписания, ДатаПолученияДанных)
	
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияШтатногоРасписания, "Должность");
	МестоВСтруктуреПредприятия = ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(ПозицияШтатногоРасписания,
		ДатаПолученияДанных);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПозицииКадровогоПлана.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПозицииКадровогоПлана КАК ПозицииКадровогоПлана
		|ГДЕ
		|	ПозицииКадровогоПлана.Подразделение = &МестоВСтруктуреПредприятия
		|	И ПозицииКадровогоПлана.Должность = &Должность";
	
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("МестоВСтруктуреПредприятия", МестоВСтруктуреПредприятия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПозицияКадровогоПлана = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ПозицияКадровогоПланаОбъект = Справочники.ПозицииКадровогоПлана.СоздатьЭлемент();		
		ПозицияКадровогоПланаОбъект.Наименование = НаименованиеПозицииКадровогоПлана(Должность, МестоВСтруктуреПредприятия);
		ПозицияКадровогоПланаОбъект.Должность = Должность;
		ПозицияКадровогоПланаОбъект.Подразделение = МестоВСтруктуреПредприятия;
		ПозицияКадровогоПланаОбъект.Записать();
		ПозицияКадровогоПлана = ПозицияКадровогоПланаОбъект.Ссылка;
	КонецЕсли;
	
	КадровоеПланирование.УстановитьСвязьПозиций(ПозицияШтатногоРасписания, ПозицияКадровогоПлана);
	
	Возврат ПозицияКадровогоПлана;
		
КонецФункции

Функция НаименованиеПозицииКадровогоПлана(Должность, МестоВСтруктуреПредприятия) 
	
	Шаблон = "%1";
	Если ЗначениеЗаполнено(МестоВСтруктуреПредприятия) Тогда
		Шаблон = Шаблон + " /%2/";
	КонецЕсли;
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, Должность, МестоВСтруктуреПредприятия);
	
КонецФункции

Функция КомпоновщикСхемы(Схема, ВосстанавливатьНастройки = Истина)
	
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема);
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(ИсточникДоступныхНастроек);
	Компоновщик.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	
	Если ВосстанавливатьНастройки Тогда
		Компоновщик.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	КонецЕсли;
	
	Возврат Компоновщик;
	
КонецФункции

Процедура ЗаполнитьКадровыйПланПоДаннымИзФайла(Форма, АдресЗагруженныхДанных) Экспорт
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ЗагруженныеДанные, "Сотрудник,Позиция");
	
	МесяцНачала = Форма.МесяцНачала;
	МесяцОкончания = Форма.МесяцОкончания;
	КоличествоМесяцев = МесяцОкончания - МесяцНачала + 1;
	ДатаНачала = ОбщегоНазначенияБЗК.ЗначениеРеквизитаПоПутиКДанным(Форма, "Объект.ПериодПланирования");
	ДатаОкончания = ДобавитьМесяц(ДатаНачала, МесяцОкончания - МесяцНачала);
	СвойстваПоказателей = Форма.СвойстваПоказателей;
	
	ПозицииКадровогоПлана = Форма.Объект.ПозицииКадровогоПлана;
	Ставки = Форма.Ставки;
	Показатели = Форма.Показатели;
	
	ПозицииКадровогоПлана.Очистить();
	Ставки.Очистить();
	Показатели.Очистить();
	
	Позиции = ЗагруженныеДанные.Скопировать();
	Позиции.Свернуть("Сотрудник, Позиция");
	
	ИдентификаторСтроки = 1;
	УникальныеИменаПоказателей = СвойстваПоказателей.Получить("УникальныеИменаПоказателей");
	
	Для Каждого Строка Из Позиции Цикл
		Если Не ЗначениеЗаполнено(Строка.Позиция) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ПозицииКадровогоПлана.Добавить();
		НоваяСтрока.Позиция = Строка.Позиция;
		НоваяСтрока.Сотрудник = Строка.Сотрудник;
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НайденныеСтроки = ЗагруженныеДанные.НайтиСтроки(Новый Структура("Сотрудник, Позиция", Строка.Сотрудник, Строка.Позиция));
		
		НачальныйПериод = Неопределено;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если НайденнаяСтрока.Период < ДатаНачала Или НайденнаяСтрока.Период > ДатаОкончания Тогда
				Продолжить;
			КонецЕсли;
			Если НачальныйПериод = Неопределено Или НачальныйПериод > НайденнаяСтрока.Период Тогда
				НачальныйПериод = НайденнаяСтрока.Период;
			ИначеЕсли НачальныйПериод = НайденнаяСтрока.Период Тогда
				НоваяСтрока = ПозицииКадровогоПлана.Добавить();
				НоваяСтрока.Позиция = Строка.Позиция;
				НоваяСтрока.Сотрудник = Строка.Сотрудник;
				ИдентификаторСтроки = ИдентификаторСтроки + 1;
				НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			КонецЕсли;
			НомерМесяца = Месяц(НайденнаяСтрока.Период);
			НоваяСтрокаСтавка = Ставки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтавка, НайденнаяСтрока);
			НоваяСтрокаСтавка.ИдентификаторСтроки = ИдентификаторСтроки;
			НоваяСтрока["КоличествоСтавок" + НомерМесяца] = НайденнаяСтрока.КоличествоСтавок;
			НомерПоказателя = 1;
			Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
				СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
				НоваяСтрокаПоказатель = Показатели.Добавить();
				НоваяСтрокаПоказатель.Период = НайденнаяСтрока.Период;
				НоваяСтрокаПоказатель.ИдентификаторСтроки = ИдентификаторСтроки;
				НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
				НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
				НоваяСтрокаПоказатель.Значение = НайденнаяСтрока["Показатель" + НомерПоказателя];
				НоваяСтрока[СвойстваПоказателя.УникальноеИмяПоказателя + НомерМесяца] = НоваяСтрокаПоказатель.Значение;
				НоваяСтрокаПоказатель.РеквизитДопУпорядочивания = НомерПоказателя;
				НомерПоказателя = НомерПоказателя + 1;
			КонецЦикла;
		КонецЦикла;
		
		ИдентификаторСтроки = ИдентификаторСтроки + 1;
	КонецЦикла;
	
	Если ПозицииКадровогоПлана.Количество() * КоличествоМесяцев > Ставки.Количество() Тогда
		Для Каждого Строка Из ПозицииКадровогоПлана Цикл
			НайденныйМесяц = 0;
			НайденныеСтроки = Ставки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", Строка.ИдентификаторСтроки));
			КоличествоИндексов = НайденныеСтроки.ВГраница();
			ВычестьИндексов = КоличествоИндексов;
			Для Сч = МесяцНачала По МесяцОкончания Цикл
				Если Сч > НайденныйМесяц И ВычестьИндексов >= 0 Тогда
					НайденныйМесяц = Месяц(НайденныеСтроки[КоличествоИндексов - ВычестьИндексов].Период);
					ВычестьИндексов = ВычестьИндексов - 1;
				КонецЕсли;
				Если Сч = НайденныйМесяц Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрокаСтавка = Ставки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСтавка, Строка);
				НоваяСтрокаСтавка.Период = ДобавитьМесяц(ДатаНачала, Сч - МесяцНачала);
				НомерПоказателя = 1;
				Для Каждого ИмяПоказателя Из УникальныеИменаПоказателей Цикл
					СвойстваПоказателя = СвойстваПоказателей.Получить(ИмяПоказателя);
					НоваяСтрокаПоказатель = Показатели.Добавить();
					НоваяСтрокаПоказатель.Период = НоваяСтрокаСтавка.Период;
					НоваяСтрокаПоказатель.ИдентификаторСтроки = НоваяСтрокаСтавка.ИдентификаторСтроки;
					НоваяСтрокаПоказатель.УникальноеИмяПоказателя = СвойстваПоказателя.УникальноеИмяПоказателя;
					НоваяСтрокаПоказатель.Показатель = СвойстваПоказателя.Показатель;
					НоваяСтрокаПоказатель.РеквизитДопУпорядочивания = НомерПоказателя;
					НомерПоказателя = НомерПоказателя + 1;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		Ставки.Сортировать("ИдентификаторСтроки, Период");
		Показатели.Сортировать("ИдентификаторСтроки, Период, РеквизитДопУпорядочивания");
	КонецЕсли;
	
	ЗаполнитьПоказателиВТаблицах(ПозицииКадровогоПлана, Ставки, Показатели, Форма.СвойстваПоказателей, МесяцНачала, МесяцОкончания);
	
КонецПроцедуры

// Таблицы данных о значениях показателей.
// 
// Параметры:
//  Ссылка - ДокументСсылка.КадровыйПлан - Ссылка на документ
// 
// Возвращаемое значение:
//  Структура - Таблицы данных о значениях показателей:
// * СведенияОСтавках - ТаблицаЗначений - 
// * СведенияОПоказателях - ТаблицаЗначений -
Функция ТаблицыДанныхОЗначенияхПоказателей(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", КадровоеПланирование.ПоказательКоличествоСтавок());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияПоказателейКадровыхПланов.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗначенияПоказателейКадровыхПланов.ПериодПоказателя КАК ПериодПоказателя,
	|	ЗначенияПоказателейКадровыхПланов.Показатель КАК Показатель,
	|	ЗначенияПоказателейКадровыхПланов.Значение КАК Значение,
	|	ЗначенияПоказателейКадровыхПланов.ЗначениеЗаполнения КАК ЗначениеЗаполнения
	|ПОМЕСТИТЬ ВТЗначенияПоказателейКадровыхПланов
	|ИЗ
	|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателейКадровыхПланов
	|ГДЕ
	|	ЗначенияПоказателейКадровыхПланов.КадровыйПлан = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияКоличестваСтавок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗначенияКоличестваСтавок.ПериодПоказателя КАК Период,
	|	ЗначенияКоличестваСтавок.Значение КАК КоличествоСтавок,
	|	ЗначенияКоличестваСтавок.ЗначениеЗаполнения КАК КоличествоСтавокЗаполнения
	|ИЗ
	|	ВТЗначенияПоказателейКадровыхПланов КАК ЗначенияКоличестваСтавок
	|ГДЕ
	|	ЗначенияКоличестваСтавок.Показатель = &ПоказательКоличествоСтавок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтроки,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПоказателей.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗначенияПоказателей.ПериодПоказателя КАК Период,
	|	ЗначенияПоказателей.Показатель КАК Показатель,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК УникальноеИмяПоказателя,
	|	ЗначенияПоказателей.Значение КАК Значение,
	|	ЗначенияПоказателей.ЗначениеЗаполнения КАК ЗначениеЗаполнения
	|ИЗ
	|	ВТЗначенияПоказателейКадровыхПланов КАК ЗначенияПоказателей
	|ГДЕ
	|	НЕ ЗначенияПоказателей.Показатель = &ПоказательКоличествоСтавок
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИдентификаторСтроки,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТЗначенияПоказателейКадровыхПланов";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗначенияПоказателей = Новый Структура;
	ЗначенияПоказателей.Вставить("СведенияОСтавках", РезультатыЗапроса[1].Выгрузить());
	ЗначенияПоказателей.Вставить("СведенияОПоказателях", РезультатыЗапроса[2].Выгрузить());
	
	ЗаполнитьУникальныеИменаПоказателей(ЗначенияПоказателей.СведенияОПоказателях);
	
	Возврат ЗначенияПоказателей;
	
КонецФункции

Процедура ЗаполнитьУникальныеИменаПоказателей(СведенияОПоказателях)
	
	ИменаПоказателей = Новый Соответствие;
	Для Каждого СтрокаПоказатель Из СведенияОПоказателях Цикл
		УникальноеИмяПоказателя = ИменаПоказателей.Получить(СтрокаПоказатель.Показатель);
		Если УникальноеИмяПоказателя = Неопределено Тогда
			УникальноеИмяПоказателя = КадровоеПланирование.УникальноеИмяПоказателя(СтрокаПоказатель.Показатель);
			ИменаПоказателей.Вставить(СтрокаПоказатель.Показатель, УникальноеИмяПоказателя);
		КонецЕсли;
		СтрокаПоказатель.УникальноеИмяПоказателя = УникальноеИмяПоказателя;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеСвойстваОЗначенияхПоказателей(ДополнительныеСвойстваДокумента) Экспорт
	ДополнительныеСвойстваДокумента.Вставить("СведенияОПоказателях", РегистрыСведений.ЗначенияПоказателейКадровыхПланов.СоздатьНаборЗаписей());
КонецПроцедуры

#Область ЗагрузкаДанныхИзФайла

Функция ВыгрузитьКолонку(ЗагружаемыеДанные, ИмяКолонки)
	
	Таблица = ЗагружаемыеДанные.Скопировать();
	Таблица.Свернуть(ИмяКолонки);
	
	Возврат Таблица.ВыгрузитьКолонку(ИмяКолонки);

КонецФункции

Процедура ЗаполнитьПериодИзСтрокиВДату(НоваяСтрока, СоответствиеСтрокДатам, СтрокаПериод)
	
	Период = СоответствиеСтрокДатам.Получить(СтрокаПериод);
	
	Если Период = Неопределено Тогда
		Период = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаПериод);
		СоответствиеСтрокДатам.Вставить(СтрокаПериод, Период);
	КонецЕсли;
	
	НоваяСтрока.Период = Период;

КонецПроцедуры

Процедура ПроверитьНеоднозначностьСотрудника(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	Если Не ПустаяСтрока(СтрокаТаблицы.Сотрудник) И Не ПустаяСтрока(СтрокаТаблицы.КодСотрудника) Тогда
		Отбор = Новый Структура("Сотрудник, КодСотрудника", СтрокаТаблицы.Сотрудник, СтрокаТаблицы.КодСотрудника);
		НоваяСтрока.Сотрудник = КэшДанныхЗагрузки.СоответствиеСотрудниковПоОтбору.Получить(Отбор);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Сотрудник) Тогда
			Строки = РезультатЗагрузки.ТаблицаСотрудникиКодыСотрудников.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.Сотрудник = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеСотрудниковПоОтбору.Вставить(Отбор, НоваяСтрока.Сотрудник);
				КэшДанныхЗагрузки.СоответствиеСотрудников.Вставить(СтрокаТаблицы.Сотрудник, НоваяСтрока.Сотрудник);
				КэшДанныхЗагрузки.СоответствиеКодовСотрудников.Вставить(СтрокаТаблицы.КодСотрудника, НоваяСтрока.Сотрудник);
				Возврат;
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "Сотрудник";
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаТаблицы.Сотрудник) И ПустаяСтрока(СтрокаТаблицы.КодСотрудника) Тогда
		НоваяСтрока.Сотрудник = КэшДанныхЗагрузки.СоответствиеСотрудников.Получить(СтрокаТаблицы.Сотрудник);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Сотрудник) Тогда
			Отбор = Новый Структура("Сотрудник", СтрокаТаблицы.Сотрудник);
			Строки = РезультатЗагрузки.ТаблицаСотрудники.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.Сотрудник = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеСотрудников.Вставить(СтрокаТаблицы.Сотрудник, НоваяСтрока.Сотрудник);
				Возврат;
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "Сотрудник";
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаТаблицы.КодСотрудника) Тогда
		НоваяСтрока.Сотрудник = КэшДанныхЗагрузки.СоответствиеКодовСотрудников.Получить(СтрокаТаблицы.КодСотрудника);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Сотрудник) Тогда
			Отбор = Новый Структура("КодСотрудника", СтрокаТаблицы.КодСотрудника);
			Строки = РезультатЗагрузки.ТаблицаКодыСотрудников.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.Сотрудник = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеКодовСотрудников.Вставить(СтрокаТаблицы.КодСотрудника, НоваяСтрока.Сотрудник);
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "Сотрудник";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки, СтруктурыСоответствуют)
	
	Если ПустаяСтрока(СтрокаТаблицы.КодПодразделения) Тогда
		Возврат;
	КонецЕсли;
	Если СтруктурыСоответствуют И Не ПустаяСтрока(СтрокаТаблицы.Организация) Тогда
		Отбор = Новый Структура("Организация, КодПодразделения", СтрокаТаблицы.Организация, СтрокаТаблицы.КодПодразделения);
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Получить(Отбор);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Строки = РезультатЗагрузки.ТаблицаОрганизацийКодыИсточников.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Вставить(Отбор, НоваяСтрока.Подразделение);
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	Иначе
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Получить(СтрокаТаблицы.КодПодразделения);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Отбор = Новый Структура("КодПодразделения", СтрокаТаблицы.КодПодразделения);
		Строки = РезультатЗагрузки.ТаблицаКодыПодразделений.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьПозиции(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
		Отбор = Новый Структура("Позиция, Подразделение", СтрокаТаблицы.Позиция, НоваяСтрока.Подразделение);
		НоваяСтрока.Позиция = КэшДанныхЗагрузки.СоответствиеПозицийПодразделений.Получить(Отбор);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Позиция) Тогда
			Строки = РезультатЗагрузки.ТаблицаПозицииПодразделения.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.Позиция = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеПозицийПодразделений.Вставить(Отбор, НоваяСтрока.Позиция);
				КэшДанныхЗагрузки.СоответствиеПозиций.Вставить(СтрокаТаблицы.Позиция, НоваяСтрока.Позиция);
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "Позиция";
			КонецЕсли;
		КонецЕсли;
	Иначе
		НоваяСтрока.Позиция = КэшДанныхЗагрузки.СоответствиеПозиций.Получить(СтрокаТаблицы.Позиция);
		Если Не ЗначениеЗаполнено(НоваяСтрока.Позиция) Тогда
			Отбор = Новый Структура("Позиция", СтрокаТаблицы.Позиция);
			Строки = РезультатЗагрузки.ТаблицаПозиции.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.Позиция = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеПозиций.Вставить(СтрокаТаблицы.Позиция, НоваяСтрока.Позиция);
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "Позиция";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПроиндексированныйРезультат(РезультатЗагрузки, ТаблицаВыгрузки, ИмяТаблицы, Колонки)
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаВыгрузки, Колонки);
	РезультатЗагрузки.Вставить(ИмяТаблицы, ТаблицаВыгрузки);
	
КонецПроцедуры

#КонецОбласти

Функция КоличествоПолностьюУчтенныхСтавок(СравниватьМинимум, ЗанятыеСтавкиПоМесяцамСотрудника, Знач КоличествоСтавокСотрудника = 0)
	
	Если СравниватьМинимум Тогда
		Для Каждого Ставка Из ЗанятыеСтавкиПоМесяцамСотрудника Цикл
			КоличествоСтавокСотрудника = Мин(КоличествоСтавокСотрудника, Ставка.Значение);
		КонецЦикла;
	Иначе
		Для Каждого Ставка Из ЗанятыеСтавкиПоМесяцамСотрудника Цикл
			КоличествоСтавокСотрудника = Макс(КоличествоСтавокСотрудника, Ставка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат КоличествоСтавокСотрудника;
	
КонецФункции

Функция НовыйПараметрыРасчетаВзносов(Знач ПредельнаяВеличинаБазыСтраховыхВзносов)
	
	ПараметрыРасчетаВзносов = Новый Структура;
	ПараметрыРасчетаВзносов.Вставить("БазаСтраховыхВзносовСУчетомСтавки", 0);
	ПараметрыРасчетаВзносов.Вставить("БазаСтраховыхВзносовБезУчетаСтавки", 0);
	ПараметрыРасчетаВзносов.Вставить("ПредельнаяВеличинаБазыСтраховыхВзносов", ПредельнаяВеличинаБазыСтраховыхВзносов);
	
	Возврат ПараметрыРасчетаВзносов;

КонецФункции

Функция НовыйЗанятыеСтавкиПоМесяцам(Знач МесяцНачала, Знач МесяцОкончания)
	
	ЗанятыеСтавкиПоМесяцам = Новый Соответствие;
	Для НомерМесяца = МесяцНачала По МесяцОкончания Цикл
		ЗанятыеСтавкиПоМесяцам.Вставить(НомерМесяца, 0);
	КонецЦикла;
	
	Возврат ЗанятыеСтавкиПоМесяцам;

КонецФункции

#КонецОбласти

#КонецЕсли