#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Действие") И ДанныеЗаполнения.Действие = "Исправить" Тогда
			ИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(ЭтотОбъект, ДанныеЗаполнения.Ссылка);
			ИсправленныйДокумент = ДанныеЗаполнения.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьСведенияОПоказателях();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ИсправлениеДокументовЗарплатаКадры.ПриПроведенииИсправления(Ссылка, Движения, РежимПроведения, Отказ,,, ЭтотОбъект, "ПериодПланирования");
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	КадровоеПланирование.СформироватьДвиженияПоПоказателямКадровогоПлана(Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИсправлениеДокументовЗарплатаКадры.ПроверитьЗаполнение(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, "ПериодическиеСведения", "НачалоПериода");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", КадровоеПланирование.ПоказательКоличествоСтавок());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыйПланПозиции.Ссылка КАК Ссылка,
		|	КадровыйПланПозиции.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КадровыйПланПозиции.Позиция КАК Позиция,
		|	КадровыйПланПозиции.Позиция.Подразделение КАК Подразделение,
		|	КадровыйПланПозиции.Сотрудник КАК Сотрудник,
		|	КадровыйПланПозиции.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыйПланПозиции.ЗависимаяВакансия КАК ЗависимаяВакансия
		|ПОМЕСТИТЬ ВТКадровыйПланПозиции
		|ИЗ
		|	Документ.КадровыйПлан.ПозицииКадровогоПлана КАК КадровыйПланПозиции
		|ГДЕ
		|	КадровыйПланПозиции.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйПланПоказатели.ПериодПоказателя КАК Период,
		|	КадровыйПланПоказатели.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КадровыйПланПоказатели.Показатель КАК Показатель,
		|	КадровыйПланПоказатели.Значение КАК Значение
		|ПОМЕСТИТЬ ВТКадровыйПланПоказатели
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК КадровыйПланПоказатели
		|ГДЕ
		|	КадровыйПланПоказатели.КадровыйПлан = &Ссылка
		|	И НЕ КадровыйПланПоказатели.Показатель = &ПоказательКоличествоСтавок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыйПланСтавки.ПериодПоказателя,
		|	КадровыйПланСтавки.ИдентификаторСтроки,
		|	&ПоказательКоличествоСтавок,
		|	КадровыйПланСтавки.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейКадровыхПланов КАК КадровыйПланСтавки
		|ГДЕ
		|	КадровыйПланСтавки.КадровыйПлан = &Ссылка
		|	И КадровыйПланСтавки.Показатель = &ПоказательКоличествоСтавок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИдентификаторСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументКадровыйПлан.Сценарий КАК Сценарий,
		|	КадровыйПланПозиции.Позиция КАК Позиция,
		|	КадровыйПланПозиции.Подразделение КАК Подразделение,
		|	КадровыйПланПозиции.Сотрудник КАК Сотрудник,
		|	КадровыйПланПозиции.ФизическоеЛицо КАК ФизическоеЛицо,
		|	КадровыйПланПозиции.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	КадровыйПланПозиции.ЗависимаяВакансия КАК ЗависимаяВакансия,
		|	КадровыйПланПоказатели.Период КАК Период,
		|	КадровыйПланПоказатели.Показатель КАК Показатель,
		|	КадровыйПланПоказатели.Значение КАК Значение
		|ИЗ
		|	Документ.КадровыйПлан КАК ДокументКадровыйПлан
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыйПланПозиции КАК КадровыйПланПозиции
		|		ПО (ДокументКадровыйПлан.Ссылка = &Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКадровыйПланПоказатели КАК КадровыйПланПоказатели
		|		ПО (КадровыйПланПоказатели.ИдентификаторСтроки = КадровыйПланПозиции.ИдентификаторСтроки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторСтроки,
		|	Период,
		|	Показатель";
	
	ПоказателиКадровогоПлана = Запрос.Выполнить().Выгрузить();
	
	Данные = Новый Структура("ПоказателиКадровогоПлана", ПоказателиКадровогоПлана);
	
	Возврат Данные;
	
КонецФункции

Процедура СохранитьСведенияОПоказателях()
	
	УстановитьПривилегированныйРежим(Истина);
	Если ДополнительныеСвойства.Свойство("СведенияОПоказателях") Тогда 
		ДополнительныеСвойства.СведенияОПоказателях.Отбор.КадровыйПлан.Установить(Ссылка);
		Для Каждого ЗаписьНабора Из ДополнительныеСвойства.СведенияОПоказателях Цикл 
			ЗаписьНабора.КадровыйПлан = Ссылка;
		КонецЦикла;
		ДополнительныеСвойства.СведенияОПоказателях.Записать();
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли