#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеДляОтражения = Новый Структура;
	ДанныеДляОтражения.Вставить("Зарплата", НачисленнаяЗарплата.Выгрузить());
	ДанныеДляОтражения.Вставить("СтраховыеВзносы", Взносы.Выгрузить());
	ДанныеДляОтражения.Вставить("УдержаннаяЗарплата", УдержаннаяЗарплата.Выгрузить());
	ДанныеДляОтражения.Вставить("Займы", Займы.Выгрузить());
	ДанныеДляОтражения.Вставить("Обучение", Обучение.Выгрузить());
	
	ОтражениеРасходовНаПерсонал.ЗарегистрироватьРасходыНаПерсонал(Движения, Отказ, ПериодРегистрации, Ссылка, ДанныеДляОтражения, Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли