#Область СлужебныйПрограммныйИнтерфейс

Процедура НормыВыдачиСИЗВыбор(Форма, Элемент, Поле, СтандартнаяОбработка) Экспорт
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "НормыВыдачиСИЗКомандаСИЗ" И ТекущиеДанные.Пометка Тогда
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("СИЗ", ТекущиеДанные.МассивСИЗ);
		ПараметрыОткрытия.Вставить("РабочееМесто", Форма.СсылкаНаОбъект);
		ПараметрыОткрытия.Вставить("НаименованиеРабочегоМеста", Форма.Объект.Наименование);
		ПараметрыОткрытия.Вставить("ТипНоменклатуры", ТекущиеДанные.ТипНоменклатуры);
		ПараметрыОткрытия.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр Или Элемент.ТолькоПросмотр);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("Подключаемый_УстановитьСИЗПослеЗакрытия", Форма);
		ОткрытьФорму("ОбщаяФорма.НормыВыдачиСредствИндивидуальнойЗащиты",
			ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

Процедура НормыВыдачиСИЗПометкаПриИзменении(Форма) Экспорт
	
	ТекущиеДанные = Форма.Элементы.НормыВыдачиСИЗ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.Пометка Тогда
		ТекущиеДанные.МассивСИЗ = Новый ФиксированныйМассив(Новый Массив);
		ТекущиеДанные.КомандаСИЗ = НСтр("ru = '< Не установлены >'");
	КонецЕсли;
	
КонецПроцедуры

Процедура НормыВыдачиСИЗСнятьФлажки(Форма, Команда) Экспорт
	
	Для Каждого ТекущаяСтрока Из Форма.НормыВыдачиСИЗ Цикл
		ТекущаяСтрока.Пометка = Ложь;
		ТекущаяСтрока.КомандаСИЗ = НСтр("ru = '< Не установлены >'");
	КонецЦикла;
	
КонецПроцедуры

Процедура НормыВыдачиСИЗУстановитьФлажки(Форма, Команда) Экспорт
	
	Для Каждого ТекущаяСтрока Из Форма.НормыВыдачиСИЗ Цикл
		ТекущаяСтрока.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

#Область СправочникДолжности

Процедура НормыВыдачиСИЗПриОкончанииРедактирования(Форма, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Подключаемый_ОбновитьПериодичностьВыдачиСИЗДолжности();
	
КонецПроцедуры

Процедура НормыВыдачиСИЗПослеУдаления(Форма, Элемент) Экспорт
	Форма.Подключаемый_ОбновитьПериодичностьВыдачиСИЗДолжности();
КонецПроцедуры

Процедура ДолжностиСкопироватьНормыВыдачи(Форма, Команда) Экспорт
	ПриВыполненииКомандыСкопироватьНормыВыдачи(Форма, Команда);
КонецПроцедуры

#КонецОбласти

// Новый параметры формы выбора СИЗ.
// 
// Возвращаемое значение:
//  Структура:
// * Организация - Неопределено
// * Подразделение - Неопределено
// * ДатаАктуальности - Дата
// * МножественныйВыбор - Булево
// * АдресПодобранныхСИЗ - Строка
// * Отбор - Структура:
//
Функция НовыеПараметрыОткрытияФормыПодбораСИЗ() Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Организация", Неопределено);
	ПараметрыОткрытия.Вставить("Подразделение", Неопределено);
	ПараметрыОткрытия.Вставить("ДатаАктуальности", '00010101');
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("АдресПодобранныхСИЗ", "");
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура);
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

// Открывает форму выбора справочника СредстваИндивидуальнойЗащиты с отбором только установленных в нормах выдачи рабочих мест.
//
// Параметры:
//	ВладелецФормы - Форма - или элемент формы, для которого открывается форма выбора.
//	ПараметрыФормы - см. НовыеПараметрыОткрытияФормыПодбораСИЗ
//
Процедура ВыбратьСИЗТребующиеВыдачиНаДатуПоПараметрамОткрытияФормыСписка(ВладелецФормы, ПараметрыФормы) Экспорт
	ОткрытьФормуПодбораСИЗ(ВладелецФормы, ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуПодбораСИЗ(ВладелецФормы, ПараметрыФормы)
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Не ПараметрыФормы.МножественныйВыбор);
	
	Если ЗначениеЗаполнено(ПараметрыФормы.Организация) Тогда
		ПараметрыФормы.Отбор.Вставить("ТекущаяОрганизация", ПараметрыФормы.Организация);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыФормы.Подразделение) Тогда
		ПараметрыФормы.Отбор.Вставить("ТекущееПодразделение", ПараметрыФормы.Подразделение);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СредстваИндивидуальнойЗащиты.Форма.ФормаПодбора", ПараметрыФормы, ВладелецФормы);
	
КонецПроцедуры

Процедура НачатьЗаполнениеИнформацииОСостоянииВыдачиПоСИЗ(СИЗ, Форма, ОписаниеОповещения) Экспорт
	
	ДлительнаяОперация = СредстваИндивидуальнойЗащитыВызовСервера.ДлительнаяОперацияЗаполненияИнформацииОСостоянииВыдачиПоСИЗ(
		СИЗ, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Заполнение информационной строки о состоянии выдачи СИЗ'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("СИЗ, ОписаниеОповещения");
	ДополнительныеПараметры.СИЗ = СИЗ;
	ДополнительныеПараметры.ОписаниеОповещения = ОписаниеОповещения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗавершитьЗаполнениеИнформацииОСостоянииВыдачи", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

Процедура ЗавершитьЗаполнениеИнформацииОСостоянииВыдачи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Неопределено);
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещения, Результат);
	
КонецПроцедуры

#Область СправочникДолжности

Процедура ПриВыполненииКомандыСкопироватьНормыВыдачи(Форма, Команда)
	
	Если Команда.Имя <> "СкопироватьНормыВыдачи" Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ИсключаяДолжность");
	ПараметрыФормы.ИсключаяДолжность = Форма.Параметры.Ключ;
	
	ПараметрыОповещения = Новый Структура(
		"Форма, 
		|Команда");
	ПараметрыОповещения.Форма = Форма;
	ПараметрыОповещения.Команда = Команда;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругойДолжностиПослеВыбора", ЭтотОбъект, ПараметрыОповещения);
	ОткрытьФорму("ОбщаяФорма.ВыборДолжностиСНормамиВыдачиСИЗ", ПараметрыФормы, Форма, , , , ОбработчикОповещения);
	
КонецПроцедуры

Процедура СкопироватьИзДругойДолжностиПослеВыбора(ДругаяДолжность, ДополнительныеПараметры) Экспорт
	
	Если ДругаяДолжность = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ДополнительныеПараметры.Вставить("ДругаяДолжность", ДругаяДолжность);
	
	ЕстьНормы = Ложь;
	Для Каждого НормаВыдачи Из Форма.НормыВыдачиСИЗ Цикл
		Если ЗначениеЗаполнено(НормаВыдачи.МассивСИЗ) Тогда
			ЕстьНормы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьНормы Тогда // Пустые нормы в должности
		НачатьКопированиеИзДругойДолжности(ДругаяДолжность, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Нормы выдачи средств индивидуальной защиты будут очищены перед копированием.
							|Продолжить?'");
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	ДополнительныеПараметры.Вставить("ДругаяДолжность", ДругаяДолжность);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("СкопироватьИзДругойДолжностиПослеВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура СкопироватьИзДругойДолжностиПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	НачатьКопированиеИзДругойДолжности(ДополнительныеПараметры.ДругаяДолжность, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура НачатьКопированиеИзДругойДолжности(ДругоеРабочееМесто, ДополнительныеПараметры)
	
	ПараметрыОповещения = Новый Структура("ИмяКоманды");
	ПараметрыОповещения.ИмяКоманды = ДополнительныеПараметры.Команда.Имя;
	
	ДополнительныеПараметры.Форма.Подключаемый_СкопироватьНормыВыдачиЗавершение(ДругоеРабочееМесто, ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
