#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Вакансия = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Вакансия");
	ЗаполнитьПодразделение(Вакансия, Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВакансияПриИзменении(Элемент)
	
	ЗаполнитьПодразделение(Вакансия, Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	Элементы.ДекорацияСтраницы.Заголовок = НСтр("ru = '2 из 2'");
	Элементы.Далее.Видимость = Ложь;
	Элементы.Назад.Видимость = Истина;
	Элементы.Готово.Видимость = Истина;
	Элементы.СтраницыНовыйКандидат.ТекущаяСтраница = Элементы.СтраницаПозиционирование;  
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Элементы.ДекорацияСтраницы.Заголовок = НСтр("ru = '1 из 2'");
	Элементы.Далее.Видимость = Истина;
	Элементы.Назад.Видимость = Ложь;
	Элементы.Готово.Видимость = Ложь;
	Элементы.СтраницыНовыйКандидат.ТекущаяСтраница = Элементы.СтраницаФИОКонтакты;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	ОткрытьФормуНовогоКандидата(); 
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоКандидата();
	
	ОписаниеРезюмеКандидата = ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата();
	
	ЧастиИмени = ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО);
	ОписаниеРезюмеКандидата.Фамилия = ЧастиИмени.Фамилия;
	ОписаниеРезюмеКандидата.Имя = ЧастиИмени.Имя;
	ОписаниеРезюмеКандидата.Отчество = ЧастиИмени.Отчество;
	
	ОписаниеРезюмеКандидата.Вакансия = Вакансия;
	ОписаниеРезюмеКандидата.Подразделение = Подразделение;
	ОписаниеРезюмеКандидата.ГруппаДоступаКандидата = ГруппаДоступа;
	ОписаниеРезюмеКандидата.СпособСозданияКандидата = ПредопределенноеЗначение("Перечисление.СпособыСозданияКандидата.РучнойВвод");
	ОписаниеРезюмеКандидата.КонтактнаяИнформация = Новый Массив;
	
	Если ЗначениеЗаполнено(Телефон) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ТипыКонтактнойИнформации.Телефон");
		Описание.Вид = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		Описание.Представление = Телефон;
		ОписаниеРезюмеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Почта) Тогда
		Описание = ОписаниеКонтактнойИнформации();
		Описание.Тип = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
		Описание.Вид = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		Описание.Представление = Почта;
		ОписаниеРезюмеКандидата.КонтактнаяИнформация.Добавить(Описание);
	КонецЕсли;
	
	ПодборПерсоналаКлиент.ОткрытьФормуНовогоКандидата(
		Новый Структура("Вакансия", Вакансия),
		Новый Структура("ДанныеКандидата", ОписаниеРезюмеКандидата));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПодразделение(Вакансия, Подразделение)
	
	Если ЗначениеЗаполнено(Вакансия) Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Вакансия, "Подразделение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеКонтактнойИнформации()
	Возврат Новый Структура("Тип, Вид, Представление");
КонецФункции

#КонецОбласти
