
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОсновноеРабочееМесто") Тогда
		ОсновноеРабочееМесто = Параметры.ОсновноеРабочееМесто;
		ПрежнееРабочееМесто = Параметры.ОсновноеРабочееМесто;
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаКомандаОК", "Видимость", Не Параметры.ТолькоПросмотр);
	КонецЕсли;
	
	АналогичныеРабочиеМеста.Очистить();
	Если ЗначениеЗаполнено(ОсновноеРабочееМесто) Тогда
		АналогичныеРабочиеМеста.Добавить(ОсновноеРабочееМесто, , Истина);
	КонецЕсли;
	Для Каждого АналогичноеМесто Из Параметры.АналогичныеМеста Цикл
		Если ОсновноеРабочееМесто = АналогичноеМесто Тогда
			Продолжить;
		КонецЕсли;
		АналогичныеРабочиеМеста.Добавить(АналогичноеМесто);
	КонецЦикла;
	
	РабочиеМеста.Очистить();
	Для Каждого РабочееМесто Из Параметры.РабочиеМеста Цикл
		Если АналогичныеРабочиеМеста.НайтиПоЗначению(РабочееМесто.РабочееМесто) = Неопределено Тогда
			РабочиеМеста.Добавить(РабочееМесто.РабочееМесто);
		КонецЕсли;
	КонецЦикла;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура АналогичныеРабочиеМестаПометкаПриИзменении(Элемент)
	
	ПриИзмененииОсновногоРабочегоМеста();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	МассивАналогичныхМест = Новый Массив();
	
	ПараметрЗакрытия = Новый Структура;
	Для Каждого АналогичноеМесто Из АналогичныеРабочиеМеста Цикл
		Если Не АналогичноеМесто.Пометка Тогда
			МассивАналогичныхМест.Добавить(АналогичноеМесто.Значение);
		КонецЕсли;
	КонецЦикла;
	
	МассивРабочихМест = РабочиеМеста.ВыгрузитьЗначения();
	Если МассивАналогичныхМест.Количество() = 0 И ЗначениеЗаполнено(ОсновноеРабочееМесто) Тогда
		МассивРабочихМест.Добавить(ОсновноеРабочееМесто);
	КонецЕсли;
	
	ПараметрЗакрытия.Вставить("АналогичныеМеста", МассивАналогичныхМест);
	ПараметрЗакрытия.Вставить("РабочиеМеста", МассивРабочихМест);
	ПараметрЗакрытия.Вставить("ОсновноеРабочееМесто", ОсновноеРабочееМесто);
	ПараметрЗакрытия.Вставить("ПрежнееРабочееМесто", ПрежнееРабочееМесто);
	
	Закрыть(ПараметрЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВправо(Команда)
	
	Для каждого ВыделеннаяСтрока Из Элементы.РабочиеМеста.ВыделенныеСтроки Цикл
		СтрокаТаблицы = РабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда 
			НовоеАналогичноеМесто = АналогичныеРабочиеМеста.Добавить(СтрокаТаблицы.Значение);
			РабочиеМеста.Удалить(СтрокаТаблицы);
			Если Не ЗначениеЗаполнено(ОсновноеРабочееМесто) Тогда
				ОсновноеРабочееМесто = НовоеАналогичноеМесто.Значение;
				НовоеАналогичноеМесто.Пометка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВлево(Команда)
	
	СбросОсновногоРабочегоМеста = Ложь;
	
	Для каждого ВыделеннаяСтрока Из Элементы.АналогичныеРабочиеМеста.ВыделенныеСтроки Цикл
		СтрокаТаблицы = АналогичныеРабочиеМеста.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаТаблицы <> Неопределено Тогда 
			СбросОсновногоРабочегоМеста = СбросОсновногоРабочегоМеста Или СтрокаТаблицы.Пометка;
			РабочиеМеста.Добавить(СтрокаТаблицы.Значение);
			АналогичныеРабочиеМеста.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если СбросОсновногоРабочегоМеста Тогда
		Если АналогичныеРабочиеМеста.Количество() > 0 Тогда
			АналогичныеРабочиеМеста[0].Пометка = Истина;
			ОсновноеРабочееМесто = АналогичныеРабочиеМеста[0].Значение;
		Иначе
			ОсновноеРабочееМесто = ПредопределенноеЗначение("Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	АналогичныеРабочиеМеста.СортироватьПоПредставлению();
	РабочиеМеста.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииОсновногоРабочегоМеста()
	
	АналогичныеРабочиеМеста.ЗаполнитьПометки(Ложь);
	
	Если Элементы.АналогичныеРабочиеМеста.ТекущаяСтрока <> Неопределено Тогда
		ТекущиеДанные = АналогичныеРабочиеМеста.НайтиПоИдентификатору(Элементы.АналогичныеРабочиеМеста.ТекущаяСтрока);
		
		Если ТекущиеДанные = Неопределено Тогда
			Элементы.АналогичныеРабочиеМеста.ТекущаяСтрока = Неопределено;
		Иначе
			ТекущиеДанные.Пометка = Истина;
			ОсновноеРабочееМесто = ТекущиеДанные.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

