
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ШаблоныПроцессов.Отбор, "ЭтапШаблонаПроцесса", Неопределено,,, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьШаблонов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ПроверкаИспользованияВШаблонахПроцессов", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыШаблоныПроцессов

&НаКлиенте
Процедура ШаблоныПроцессовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ШаблоныПроцессов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Поле = Элементы.ШаблоныПроцессов.ТекущийЭлемент;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ШаблонПроцесса) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ШаблонПроцесса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвязанныеШаблоны(Команда)
	
	ОтображениеСвязанныхШаблонов = Не ОтображениеСвязанныхШаблонов;
	УстановитьВидимостьШаблонов();
	ПроверкаИспользованияВШаблонахПроцессов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьШаблонов()
	
	Элементы.ФормаСвязанныеШаблоны.Пометка = ОтображениеСвязанныхШаблонов;
	Элементы.ШаблоныПроцессов.Видимость = ОтображениеСвязанныхШаблонов;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИспользованияВШаблонахПроцессов()
	
	Если ОтображениеСвязанныхШаблонов Тогда
	
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ШаблоныПроцессов.Отбор, "ЭтапШаблонаПроцесса", ПредопределенноеЗначение("Справочник.ЭтапыПроцессов.ПустаяСсылка"),,, Истина);
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ШаблоныПроцессов.Отбор, "ЭтапШаблонаПроцесса", ТекущиеДанные.Ссылка,,, Истина);
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

