
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		ТекстОшибки =  НСтр("ru = 'Недостаточно прав для завершения сеанса'");
		ПерейтиКШагуМастера(5);
		Возврат;
	КонецЕсли;
				
	ЗавершитьБезПредупреждения = Константы.ЗавершатьСеансыБезПредупрежденияПоУмолчаниюВМоделиСервиса.Получить();
	
	ПерейтиКШагуМастера(1);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗавершитьБезПредупрежденияПриИзменении(Элемент)
	
	Если ЗавершитьБезПредупреждения Тогда
		Элементы.Продолжить.Заголовок = ПредставлениеКнопкиДействияЗавершитьСейчас();
	Иначе
		Элементы.Продолжить.Заголовок = ПредставлениеКнопкиДействияЗавершитьЧерез();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// @skip-check module-unused-method - особенность реализации.
&НаКлиенте
Функция ПроверитьВводПароля()
	
	Если ПустаяСтрока(Пароль) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не указан пароль для доступа к сервису'"), ,
			"Пароль");	
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПроверитьПарольПользователя(Пароль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Указан неверный пароль для доступа к сервису.
				|Проверьте правильность ввода пароля'"), ,
			"Пароль");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// @skip-check module-unused-method - особенность реализации.
&НаКлиенте
Функция НачатьОтправкуПредупреждений()
			
	Если ЗавершитьБезПредупреждения 
		Или Не ОтправитьПредупрежденияНаСервере(Параметры.НомераСеансов, СообщениеПользователям) Тогда
		ПерейтиКШагуМастера(3);
		ПерейтиНаСледующийШаг();
		Возврат Ложь;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ПослеВыполненияОтправкиПредупрежденийПользователям", 60, Истина);

	Возврат Истина;
				
КонецФункции

&НаКлиенте
Процедура ПослеВыполненияОтправкиПредупрежденийПользователям() Экспорт
	ПерейтиНаСледующийШаг();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьПредупрежденияНаСервере(Знач НомераСеансов, Знач СообщениеПользователям)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОповещениеПользователю = Новый Структура();
	ОповещениеПользователю.Вставить(
		"ВидОповещения",
		"ПредупреждениеПриЗавершенииСеанса");
	
	НаименованиеПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Пользователи.ТекущийПользователь(),
		"Наименование");
	ОповещениеПользователю.Вставить("НаименованиеПользователя", НаименованиеПользователя);	 
	
	Если ЗначениеЗаполнено(СообщениеПользователям) Тогда
		ОповещениеПользователю.Вставить("Сообщение", СообщениеПользователям);	 
	КонецЕсли;
	
	ИменаИнтерактивныхПриложений = ОбщегоНазначенияБТССлужебный.ИменаИнтерактивныхПриложений();
		
	НомераСеансовИменаПользователей = Новый Соответствие();
	Для Каждого Сеанс Из ПолучитьСеансыИнформационнойБазы() Цикл
		
		Если ИменаИнтерактивныхПриложений.Найти(Сеанс.ИмяПриложения) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
				
		ПользовательСеанса = Сеанс.Пользователь;
		Если ПользовательСеанса = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ИмяПользователя = ПользовательСеанса.Имя;
		Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
			Продолжить;
		КонецЕсли;
		
		НомераСеансовИменаПользователей.Вставить(Сеанс.НомерСеанса, ИмяПользователя);
	
	КонецЦикла;
	
	ОбластьДанных = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();	
	ДоставляемыеОповещения = Новый Массив;	
		
	Для Каждого НомерСеанса Из НомераСеансов Цикл
		
		ИмяПользователя = НомераСеансовИменаПользователей.Получить(НомерСеанса);
		Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
			Продолжить
		КонецЕсли;
		
		ДоставляемоеОповещение = Новый Структура();
		ДоставляемоеОповещение.Вставить("ОбластьДанных", ОбластьДанных);
		ДоставляемоеОповещение.Вставить("ИмяПользователя", ИмяПользователя);	
		ДоставляемоеОповещение.Вставить("НомерСеанса", НомерСеанса);	
		ДоставляемоеОповещение.Вставить("ОповещениеПользователя", ОповещениеПользователю);
		
		ДоставляемыеОповещения.Добавить(ДоставляемоеОповещение);
				
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ДоставляемыеОповещения) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ОповещениеПользователейБТС.ДоставитьОповещения(ДоставляемыеОповещения);
	
	Возврат Истина;
	
КонецФункции

// @skip-check module-unused-method - особенность реализации.
&НаКлиенте
Функция НачатьЗавершениеСеансов()
	
	НезавершенныеСеансы = СписокНезавершенныхСеансов(Параметры.НомераСеансов);
	
	Если НезавершенныеСеансы.Количество() = 0 Тогда
		Закрыть(КодВозвратаДиалога.ОК);
		Возврат Ложь;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьЗавершениеСеансовНаСервере(
		НезавершенныеСеансы,
		Пароль,
		СообщениеПользователям);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеЗавершенияСеансов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеПриЗавершении, ПараметрыОжидания);

	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьЗавершениеСеансовНаСервере(Знач НомераСеансов, Знач Пароль, Знач СообщениеОтПользователя)
	
	ЧастиТекстаСообщенияПользователям = Новый Массив();
	
	НаименованиеПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		Пользователи.ТекущийПользователь(),
		"Наименование");
	ЧастиТекстаСообщенияПользователям.Добавить(СтрШаблон(НСтр("ru = 'Сеанс завершен
		|Пользователь завершивший сеанс: %1'"),
		НаименованиеПользователя));
		 
	Если ЗначениеЗаполнено(СообщениеОтПользователя) Тогда
		ЧастиТекстаСообщенияПользователям.Добавить(СтрШаблон(НСтр("ru = 'Сообщение от пользователя: %1'"), СообщениеОтПользователя));
	КонецЕсли;	
	СообщениеПользователям = СтрСоединить(ЧастиТекстаСообщенияПользователям, Символы.ПС); 
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Завершение сеансов'");

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"УдаленноеАдминистрированиеБТССлужебный.ЗавершитьСеансыОбластиДанных",
		НомераСеансов,
		Пароль,
		СообщениеПользователям);
		
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияСеансов(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат <> Неопределено И Результат.Статус = "Выполнено" Тогда
		
		Закрыть(КодВозвратаДиалога.ОК);
	
	Иначе
		
		Если Результат = Неопределено Тогда
			ПредставлениеОшибки = НСтр("ru = 'Задание отменено'");
		Иначе
			ПредставлениеОшибки = Результат.ПодробноеПредставлениеОшибки;
		КонецЕсли;
		
		ЗаписатьОшибку(
			НСтр("ru = 'Ошибка завершения сеанса'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
			ПредставлениеОшибки);
		
		ТекстОшибки = НСтр("ru = 'При попытке завершить сеансы произошла ошибка.
		|Проверьте правильность ввода пароля для доступа к сервису, попробуйте позже или обратитесь в службу поддержки сервиса'");
		
		ПерейтиКШагуМастера(5);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОшибку(ИмяСобытия, ТекстОшибки)
	// @skip-check module-nstr-camelcase - ошибка проверки
	ПолноеИмяСобытия = НСтр("ru = 'ЗавершениеСеансовВМоделиСервиса'", ОбщегоНазначения.КодОсновногоЯзыка()) + "." + ИмяСобытия;
	ЗаписьЖурналаРегистрации(ПолноеИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ПерейтиНаСледующийШаг();
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьОбработчикПереходаМеждуШагами()
	
	Результат = Истина;
	
	Если ЗначениеЗаполнено(ОбработчикПереходаСТекущегоШага) Тогда
		
		Результат = Вычислить(ОбработчикПереходаСТекущегоШага + "()");
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерейтиКШагуМастера(Знач Шаг)
	
	Сценарий = СценарийМастера();
	
	ОписаниеШага = Сценарий.Найти(Шаг, "НомерШага");
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ОписаниеШага.Страница];
	Элементы.Продолжить.Видимость = ОписаниеШага.ОтображатьКомандуПродолжить;
	Элементы.Продолжить.Заголовок = ОписаниеШага.НаименованиеКнопкиДействия;
	
	Если ОписаниеШага.ОтображатьКартинкуКнопкиДействия Тогда
		Элементы.Продолжить.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Иначе
		Элементы.Продолжить.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;
	
	ОбработчикПереходаСТекущегоШага = ОписаниеШага.Обработчик;
	ТекущийШаг = Шаг;
	
КонецПроцедуры

&НаСервере
Функция СценарийМастера()
	
	Результат = Новый ТаблицаЗначений();
	
	Результат.Колонки.Добавить("НомерШага", Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("Страница", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтображатьКомандуПродолжить", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Обработчик", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("НаименованиеКнопкиДействия", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ОтображатьКартинкуКнопкиДействия", Новый ОписаниеТипов("Булево"));
	
	// Ввод пароля
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.НомерШага = 1;
	НоваяСтрока.Страница = Элементы.СтраницаВводПароля.Имя;
	НоваяСтрока.ОтображатьКомандуПродолжить = Истина;
	НоваяСтрока.Обработчик = "ПроверитьВводПароля";
	НоваяСтрока.НаименованиеКнопкиДействия = НСтр("ru = 'Продолжить'");
	НоваяСтрока.ОтображатьКартинкуКнопкиДействия = Истина;
		
	// Оповещения пользователей
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.НомерШага = 2;
	НоваяСтрока.Страница = Элементы.СтраницаОповещенияПользователей.Имя;
	НоваяСтрока.ОтображатьКомандуПродолжить = Истина;
	НоваяСтрока.Обработчик = "НачатьОтправкуПредупреждений";
	НоваяСтрока.НаименованиеКнопкиДействия = ПредставлениеКнопкиДействияЗавершитьЧерез();
	НоваяСтрока.ОтображатьКартинкуКнопкиДействия = Ложь;
	
	// Ожидание оповещения пользователей
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.НомерШага = 3;
	НоваяСтрока.Страница = Элементы.СтраницаОжиданиеОповещенияПользователей.Имя;
	НоваяСтрока.ОтображатьКомандуПродолжить = Ложь;
	НоваяСтрока.Обработчик = "НачатьЗавершениеСеансов";
		
	// Ожидание завершения
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.НомерШага = 4;
	НоваяСтрока.Страница = Элементы.СтраницаОжиданиеЗавершенияСеансов.Имя;
	НоваяСтрока.ОтображатьКомандуПродолжить = Ложь;
	
	// Просмотр ошибки
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.НомерШага = 5;
	НоваяСтрока.Страница = Элементы.СтраницаОшибка.Имя;
	НоваяСтрока.ОтображатьКомандуПродолжить = Ложь;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиНаСледующийШаг()
	
	ТекущийШагДоВыполненияОбработчика = ТекущийШаг;
	
	Если Не ВыполнитьОбработчикПереходаМеждуШагами() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийШаг <> ТекущийШагДоВыполненияОбработчика Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиКШагуМастера(ТекущийШаг + 1);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеКнопкиДействияЗавершитьЧерез()
	Возврат НСтр("ru = 'Завершить через 1 минуту'");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеКнопкиДействияЗавершитьСейчас()
	Возврат НСтр("ru = 'Завершить немедленно'");
КонецФункции

&НаСервереБезКонтекста
Функция СписокНезавершенныхСеансов(Знач НомераСеансов)

	НезавершенныеСеансы = Новый Массив;
	
	СписокСеансов = ПолучитьСеансыИнформационнойБазы();
	Для Каждого СеансИБ Из СписокСеансов Цикл
		Если НомераСеансов.Найти(СеансИБ.НомерСеанса) <> Неопределено Тогда
			НезавершенныеСеансы.Добавить(СеансИБ.НомерСеанса);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НезавершенныеСеансы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПарольПользователя(Знач Пароль)
	
	Возврат РаботаВМоделиСервисаСлужебный.ПарольТекущегоПользователяСовпадаетССохраненным(Пароль);
	
КонецФункции

#КонецОбласти


