#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ПериодичностьВыдачиСИЗРабочихМест.СохранитьПрежнийНаборЗаписей(ЭтотОбъект, Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьОбновлениеВыдачиСИЗ(Замещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОбновлениеВыдачиСИЗ(Замещение)
	
	РегистрыСведений.ПериодичностьВыдачиСИЗРабочихМест.ЗаполнитьТаблицуОбновления(ЭтотОбъект, Замещение);
	СредстваИндивидуальнойЗащиты.ЗарегистрироватьОбновлениеВыдачиСИЗ(ДополнительныеСвойства.ТаблицаОбновлениеВыдачиСИЗ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли