#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение: 
//  Строка - Текст предупреждения об активных расширениях изменяющих структуру данных
Функция ТекстПредупрежденияОбАктивныхРасширенияхИзменяющихСтруктуруДанных() Экспорт
	
	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);
	
	АктивныеРасширенияИзменяющиеСтруктуруДанных = ОбщегоНазначенияБТССлужебный.АктивныеРасширенияИзменяющиеСтруктуруДанных();
	АктивныеРасширенияОбласти = Новый Массив;
	Для Каждого Расширение Из АктивныеРасширенияИзменяющиеСтруктуруДанных Цикл
		Если Расширение.ОбластьДействия = ОбластьДействияРасширенияКонфигурации.РазделениеДанных Тогда
			АктивныеРасширенияОбласти.Добавить(Расширение);
		КонецЕсли;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(АктивныеРасширенияОбласти) Тогда
		Возврат "";
	КонецЕсли;

	ЧастиТекстаПредупреждения = Новый Массив;
	ЧастиТекстаПредупреждения.Добавить(
		НСтр("ru = 'В приложении установлены и активны расширения конфигурации, изменяющие структуру данных:'"));

	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	
	Для Каждого Расширение Из АктивныеРасширенияОбласти Цикл
		ЧастиТекстаПредупреждения.Добавить("● ");
		ЧастиТекстаПредупреждения.Добавить(Расширение.Синоним);
		ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиТекстаПредупреждения);		
		
КонецФункции

// Добавляет запись в журнал регистрации.
//
// Параметры:
//  ПараметрыЗаписиЖурналаРегистрации - см. ОбщегоНазначенияБТССлужебныйКлиентСервер.НовыйПараметрыЗаписиЖурналаРегистрации
//
Процедура ДобавитьЗаписьЖурналаРегистрации(ПараметрыЗаписиЖурналаРегистрации) Экспорт
	
	УровеньЖР = ?(ПараметрыЗаписиЖурналаРегистрации.Ошибка, 
		УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(
		ПараметрыЗаписиЖурналаРегистрации.ИмяСобытия,
		УровеньЖР,
		ПараметрыЗаписиЖурналаРегистрации.Метаданные,
		ПараметрыЗаписиЖурналаРегистрации.Данные,
		ПараметрыЗаписиЖурналаРегистрации.Комментарий);
	
КонецПроцедуры
	
#КонецОбласти