#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Сотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(ФизическоеЛицо, Организация, ДатаСоздания);
		КонецЕсли;
		ДнейКомандировки = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДатаНачала, ДатаОкончания);
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Расходы) Тогда
			Расходы.Загрузить(ДанныеЗаполнения.Расходы);
		КонецЕсли;
		Если ЗначениеЗаполнено(ОтменяемаяЗаявка) Тогда
			ТипЗаявки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтменяемаяЗаявка, "ТипЗаявки");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() И ПометкаУдаления И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
		Если Не Пользователи.ЭтоПолноправныйПользователь(, , Ложь)
			И Не ДополнительныеСвойства.Свойство("РазрешенаПометкаУдаления") Тогда
			ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Пометка на удаление объектов ""%1"" не предусмотрена'"),
			Метаданные().Синоним);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	РезультатВыполненияЗаявки = Неопределено;
	Если ДополнительныеСвойства.Свойство("РезультатВыполненияЗаявки", РезультатВыполненияЗаявки) Тогда
		ЗаявкиСотрудников.ПередЗаписьюВыполняемойЗаявки(ЭтотОбъект, РезультатВыполненияЗаявки, Отказ);
	КонецЕсли;
	
	ПрежнийРезультатВыполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "РезультатВыполнения");
	ДополнительныеСвойства.Вставить("ПрежнийРезультатВыполнения", );
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийРезультатВыполнения = Неопределено;
	ДополнительныеСвойства.Свойство("ПрежнийРезультатВыполнения", ПрежнийРезультатВыполнения);
	Если РезультатВыполнения <> ПрежнийРезультатВыполнения Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеКомандировок") Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ОснованиеДокумента", Ссылка); 
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Бронирование.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.БронированиеБилетовПроживания КАК Бронирование
			|ГДЕ
			|	Бронирование.ОснованиеДокумента = &ОснованиеДокумента";
			ДокументыБронирования = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			Для каждого ЗаявкаНаБронирование Из ДокументыБронирования Цикл
				ЗаявкаНаБронированиеОбъект = ЗаявкаНаБронирование.ПолучитьОбъект();
				БронированиеКомандировокРасширенный.УстановитьСостояниеЗаявкиПодготовлена(ЗаявкаНаБронированиеОбъект);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли