#Область СлужебныеПроцедурыИФункции

Функция КлассификацияУсловийТруда() Экспорт

	КлассификацияУсловийТруда = Новый Соответствие;
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Опасный, НСтр("ru = 'Опасные условия труда (4 класс)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный4, НСтр("ru = 'Подкласс 3.4 (вредные условия труда 4 степени)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный3, НСтр("ru = 'Подкласс 3.3 (вредные условия труда 3 степени)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный2, НСтр("ru = 'Подкласс 3.2 (вредные условия труда 2 степени)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Вредный1, НСтр("ru = 'Подкласс 3.1 (вредные условия труда 1 степени)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Допустимый, НСтр("ru = 'Допустимые условия труда (2 класс)'"));
	КлассификацияУсловийТруда.Вставить(
		Перечисления.КлассыУсловийТрудаПоРезультатамСпециальнойОценки.Оптимальный, НСтр("ru = 'Оптимальные условия труда (1 класс)'"));
	
	Возврат КлассификацияУсловийТруда;

КонецФункции

#КонецОбласти