#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Синхронизация интерфейсных констант
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыДляНебольшихОрганизаций");
		Модуль.ПриУстановкеЗначенияИспользоватьКадровыйУчет(Значение);
	Иначе
		Модуль = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыРасширенныйСобытия");
		Модуль.ПриУстановкеЗначенияИспользоватьКадровыйУчет(Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
