#Область СлужебныеПроцедурыИФункции

// Возвращает параметры вызова rest-метода для чтения сведений медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPerson(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для чтения всех сведений медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonFull(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/full";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода POST для создания (create) 
// или PUT для изменения (update) сведений о медицинском работнике.
//
// Параметры:
//  PersonKey - Структура - Данные идентификации медработника для метода PUT (см. описание функции PersonKey).
//                          Для метода POST (create) PersonKey.oid оставлять в значении Неопределено.
//  PersonData - Структура - Данные медработника (см. описание функции PersonData).
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPerson(PersonKey, PersonData) Экспорт 
	
	ДокументыРаботника = "";
	Для ИндексДокумента = 0 По PersonData.documents.Количество()-1 Цикл
		ДанныеДокумента = PersonData.documents[ИндексДокумента];
		ЭлементыJSON = Новый Массив;
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "serial", ДанныеДокумента.serial, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "number", ДанныеДокумента.number, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "passDate", ДанныеДокумента.passDate, "ДатаUTC"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "passOrg", ДанныеДокумента.passOrg, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "codeOrg", ДанныеДокумента.codeOrg, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "documentId", ДанныеДокумента.documentId, "JSON"); 
		ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
		Если ИндексДокумента = 0 Тогда 
			ДокументыРаботника = ЗаписьJSON;
		Иначе 
			ДокументыРаботника = ДокументыРаботника + "," + Символы.ПС + ЗаписьJSON;
		КонецЕсли;
	КонецЦикла;	
	
	АдресаРаботника = "";
	Для ИндексАдреса = 0 По PersonData.addresses.Количество()-1 Цикл
		ДанныеАдреса = PersonData.addresses[ИндексАдреса];
		
		ЭлементыJSON = Новый Массив;
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "GARguid", ДанныеАдреса.address.GARguid, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "aoidArea", ДанныеАдреса.address.aoidArea, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "aoidStreet", ДанныеАдреса.address.aoidStreet, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "houseid", ДанныеАдреса.address.houseid, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "region", ДанныеАдреса.address.region, "Число"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "areaName", ДанныеАдреса.address.areaName, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "prefixArea", ДанныеАдреса.address.prefixArea, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "streetName", ДанныеАдреса.address.streetName, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "prefixStreet", ДанныеАдреса.address.prefixStreet, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "house", ДанныеАдреса.address.house, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "building", ДанныеАдреса.address.building, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "struct", ДанныеАдреса.address.struct, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "flat", ДанныеАдреса.address.flat, "Строка"); 
		ОбъектJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
		
		ЭлементыJSON = Новый Массив;
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "addressId", ДанныеАдреса.addressId, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "regDate", ДанныеАдреса.regDate, "ДатаUTC"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "addressTypeId", ДанныеАдреса.addressTypeId, "Число"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "address", ОбъектJSON, "JSON"); 
		ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
		
		Если ИндексАдреса = 0 Тогда 
			АдресаРаботника = ЗаписьJSON;
		Иначе 
			АдресаРаботника = АдресаРаботника + "," + Символы.ПС + ЗаписьJSON;
		КонецЕсли;
	КонецЦикла;	
			
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "mr", PersonData.mr, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "student", PersonData.student, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "lastName", PersonData.lastName, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "firstName", PersonData.firstName, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "patronymic", PersonData.patronymic, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "gender", ?(PersonData.gender=Перечисления.ПолФизическогоЛица.Женский, 2, 1), "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "birthDate", PersonData.birthDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "snils", PersonData.snils, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "inn", PersonData.inn, "Строка");
	
	ЭлементыКатегорииГражданства = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыКатегорииГражданства, "code", PersonData.citizenShipId.code, "JSON"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыКатегорииГражданства, "name", PersonData.citizenShipId.name, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "citizenShipId", "{" + СтрСоединить(ЭлементыКатегорииГражданства, ",") + "}", "JSON"); 
	
	Если PersonData.citizenShipId.code<>"1" Тогда 
		ЭлементыСтраныГражданства = Новый Массив;
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыСтраныГражданства, "code", PersonData.oksmId.code, "JSON"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыСтраныГражданства, "name", PersonData.oksmId.name, "Строка"); 
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "oksmId", "{" + СтрСоединить(ЭлементыСтраныГражданства, ",") + "}", "JSON"); 
	КонецЕсли;
	
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "militaryRelationId", PersonData.militaryRelationId, "JSON"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "phone", PersonData.phone, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "email", PersonData.email, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isDisabled", PersonData.isDisabled, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "disabledGroupId", PersonData.disabledGroupId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "disabledGroupName", PersonData.disabledGroupName, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "disabledDate", PersonData.disabledDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "covid19", PersonData.covid19, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "documents", "[" + ДокументыРаботника + "]", "JSON"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "addresses", "[" + АдресаРаботника + "]", "JSON"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.РазделМедрегистра = "person";
	Если PersonKey.oid=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey,,,Истина);
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	КонецЕсли;
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Конструктор структуры основных данных медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//
//      ...
//
//  	documents - Массив – Документы, удостоверяющие личность (см. Функция PersonDocumentData).
//  	addresses - Массив – Адреса (см. Функция PersonAddressData).
//
Функция PersonData() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("mr", Неопределено);
	Результат.Вставить("student", Неопределено);
	Результат.Вставить("lastName", Неопределено);
	Результат.Вставить("firstName", Неопределено);
	Результат.Вставить("patronymic", Неопределено);
	Результат.Вставить("gender", Неопределено);
	Результат.Вставить("birthDate", Неопределено);
	Результат.Вставить("snils", Неопределено);
	Результат.Вставить("inn", Неопределено);
	Результат.Вставить("citizenShipId", Новый Структура("code,name", Неопределено, Неопределено));
	Результат.Вставить("oksmId", Новый Структура("code,name", Неопределено, Неопределено));
	Результат.Вставить("militaryRelationId", Неопределено);
	Результат.Вставить("phone", Неопределено);
	Результат.Вставить("email", Неопределено);
	Результат.Вставить("isDisabled", Неопределено);
	Результат.Вставить("disabledGroupId", Неопределено);
	Результат.Вставить("disabledGroupName", Неопределено);
	Результат.Вставить("disabledDate", Неопределено);
	Результат.Вставить("covid19", Неопределено);
	Результат.Вставить("documents", Неопределено);
	Результат.Вставить("addresses", Неопределено);
	Возврат Результат;
	
КонецФункции

// *** Документ, удостоверяющий личность.
//serial	Строка	Нет	Серия документа, удостоверяющего личность		Числовое поле до 10 символов
//number	Строка	Да	Номер документа, удостоверяющего личность		Числовое поле до 20 символов
//passDate	Дата	Да	Дата выдачи документа, удостоверяющего личность		Дата в формате ГГГГ-ММ-ДД
//passOrg	Строка	Да	Организация выдачи документа, удостоверяющего личность		Текст до 200 символов
//codeOrg	Число	Нет	Код подразделения		
//documentId	Положительное число (unsigned int)	Да	Код документа, удостоверяющего личность	Справочник ФНСИ «Документы, удостоверяющие личность», OID 1.2.643.5.1.13.13.99.2.48	
Функция PersonDocumentData() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("serial", Неопределено);
	Результат.Вставить("number", Неопределено);
	Результат.Вставить("passDate", Неопределено);
	Результат.Вставить("passOrg", Неопределено);
	Результат.Вставить("codeOrg", Неопределено);
	Результат.Вставить("documentId", Неопределено);
	Возврат Результат;
	
КонецФункции

Функция PersonAddressData() Экспорт

	АдреснаяИнформация = Новый Структура;
	АдреснаяИнформация.Вставить("GARguid", Неопределено);
	АдреснаяИнформация.Вставить("aoidArea", Неопределено);
	АдреснаяИнформация.Вставить("aoidStreet", Неопределено);
	АдреснаяИнформация.Вставить("houseid", Неопределено);
	АдреснаяИнформация.Вставить("region", Неопределено);
	АдреснаяИнформация.Вставить("areaName", Неопределено);
	АдреснаяИнформация.Вставить("prefixArea", Неопределено);
	АдреснаяИнформация.Вставить("streetName", Неопределено);
	АдреснаяИнформация.Вставить("prefixStreet", Неопределено);
	АдреснаяИнформация.Вставить("house", Неопределено);
	АдреснаяИнформация.Вставить("building", Неопределено);
	АдреснаяИнформация.Вставить("struct", Неопределено);
	АдреснаяИнформация.Вставить("flat", Неопределено);
	
	Результат = Новый Структура;
	Результат.Вставить("addressId", Неопределено);
	Результат.Вставить("regDate", Неопределено);
	Результат.Вставить("addressTypeId", Неопределено);
	Результат.Вставить("address", АдреснаяИнформация);
	
	Возврат Результат;
	
КонецФункции

#Область ЛичноеДелоМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения личного дела медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonCard(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/card";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) или изменения данных личного дела медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonCardData - Структура - см. описание функции PersonCardData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonCard(PersonKey, PersonCardData, ПропуститьКлючMo = Ложь) Экспорт 
    
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "oid", PersonCardData.oid, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "organization", PersonCardData.organization, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nrPmuDepartId", PersonCardData.nrPmuDepartId, "Строка");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nrPmuDepartHospitalSubdivisionId", PersonCardData.nrPmuDepartHospitalSubdivisionId, "Строка");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "roomOid", PersonCardData.roomOid, "Строка");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "contractNumber", PersonCardData.contractNumber, "Строка");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "contractDate", PersonCardData.contractDate, "ДатаUTC");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "serviceNumber", PersonCardData.serviceNumber, "Строка");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "fedPositionId", PersonCardData.fedPositionId, "Число");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "seniority", PersonCardData.seniority, "Число");
	
	Если ТипЗнч(PersonCardData.services)=Тип("Массив") Тогда 
		МедицинскиеУслугиРаботника = Новый Массив;
		Для Каждого ДанныеМедицинскойУслуги Из PersonCardData.services Цикл
			ДополнительныеЭлементыJSON = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "code", ДанныеМедицинскойУслуги.code, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "name", ДанныеМедицинскойУслуги.name, "Строка"); 
			МедицинскиеУслугиРаботника.Добавить("{" + СтрСоединить(ДополнительныеЭлементыJSON, ",") + "}");
		КонецЦикла;	
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "services", "[" + СтрСоединить(МедицинскиеУслугиРаботника, ",") + "]", "JSON");
	КонецЕсли;
	
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "positionTypeId", PersonCardData.positionTypeId, "Число");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "postId", PersonCardData.postId, "Число");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "rate", PersonCardData.rate, "Число", 4);
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "beginDate", PersonCardData.beginDate, "ДатаUTC");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "endDate", PersonCardData.endDate, "ДатаUTC");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "endTypeId", PersonCardData.endTypeId, "Число");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "fireReasonId", PersonCardData.fireReasonId, "Число");
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "targeted", PersonCardData.targeted, "Булево");
	
	Если ТипЗнч(PersonCardData.temporaryDerelictions)=Тип("Массив") Тогда 
		ВременныеНеисполненияОбязанностейРаботника = Новый Массив;
		Для Каждого ДанныеВременногоНеисполнения Из PersonCardData.temporaryDerelictions Цикл
			ДополнительныеЭлементыJSON = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "reasonId", ДанныеВременногоНеисполнения.reasonId, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "beginDate", ДанныеВременногоНеисполнения.beginDate, "ДатаUTC"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "endDate", ДанныеВременногоНеисполнения.endDate, "ДатаUTC"); 
			ВременныеНеисполненияОбязанностейРаботника.Добавить("{" + СтрСоединить(ДополнительныеЭлементыJSON, ",") + "}");
		КонецЦикла;	
		МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "temporaryDerelictions", "[" + СтрСоединить(ВременныеНеисполненияОбязанностейРаботника, ",") + "]", "JSON");
	КонецЕсли;

	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	Если ПропуститьКлючMo Тогда 
		// Тут ситуация, когда добавляется первая запись ЛД, что означает, что все записи ЛД были удалены в ФРМР
		// и сохраненный в ИБ идентификатор уже всё равно не валиден. Его надо очистить, чтобы сработал метод POST.
	    PersonCardData.id = Неопределено;
	КонецЕсли;
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonCardData.id=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonCardData.id;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/card";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey, Истина, ПропуститьКлючMo) + "&lastName=" + PersonCardData.lastName;
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных личного дела медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	lastName - Строка – Фамилия медработника, необходимая для ключа запроса.
//  	oid - Строка – Идентификатор медицинской организации.
//  	id - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                        Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	organization - Строка – Наименование организации по ФРМО.
//  	nrPmuDepartId - Строка – Идентификатор подразделения по ФРМО.
//  	nrPmuDepartHospitalSubdivisionId - Строка – Идентификатор отделения по ФРМО.
//  	roomOid - Строка – Идентификатор кабинета по ФРМО.
//  	contractNumber - Строка – Номер трудового договора.
//  	contractDate - Дата(ISO8601) – Дата заключения трудового договора.
//  	serviceNumber - Строка – Табельный номер.
//  	fedPositionId - Число – Должность по классификатору 1.2.643.5.1.13.13.99.2.885.
//  	seniority - Число – Трудовой стаж (дней). Необязательный параметр.
//  	services - Массив – Оказываемые медицинские услуги (см. функцию PersonCardServices).
//  	positionTypeId - Число – Тип занятия должности по классификатору 1.2.643.5.1.13.13.99.2.357.
//  	postId - Число – Должность по классификатору 1.2.643.5.1.13.13.99.2.181.
//  	rate - Число(5,4) – Ставка.
//  	beginDate - Дата(ISO8601) – Дата начала.
//  	endDate - Дата(ISO8601) – Дата окончания.
//  	endTypeId - Число – Основание окончания по классификатору 1.2.643.5.1.13.13.99.2.282.
//  	fireReasonId - Число – Причина увольнения по классификатору 1.2.643.5.1.13.13.99.2.196.
//  	targeted - Булево – Целевая подготовка.
//  	temporaryDerelictions - Массив – Список временных неисполнений функциональных обязанностей (см. функцию PersonCardTemporaryDerelictions).
//
Функция PersonCardData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("lastName", Неопределено);
	Результат.Вставить("oid", Неопределено);
	Результат.Вставить("id", Неопределено);
	Результат.Вставить("organization", Неопределено);
	Результат.Вставить("nrPmuDepartId", Неопределено);
	Результат.Вставить("nrPmuDepartHospitalSubdivisionId", Неопределено);
	Результат.Вставить("roomOid", Неопределено);
	Результат.Вставить("contractNumber", Неопределено);
	Результат.Вставить("contractDate", Неопределено);
	Результат.Вставить("serviceNumber", Неопределено);
	Результат.Вставить("fedPositionId", Неопределено);
	Результат.Вставить("seniority", Неопределено);
	Результат.Вставить("services", Неопределено);
	Результат.Вставить("positionTypeId", Неопределено);
	Результат.Вставить("postId", Неопределено);
	Результат.Вставить("rate", Неопределено);
	Результат.Вставить("beginDate", Неопределено);
	Результат.Вставить("endDate", Неопределено);
	Результат.Вставить("endTypeId", Неопределено);
	Результат.Вставить("fireReasonId", Неопределено);
	Результат.Вставить("targeted", Неопределено);
	Результат.Вставить("temporaryDerelictions", Неопределено);
	Возврат Результат;
КонецФункции

// Конструктор структуры данных об оказываемых медицинских услугах медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	code - Число – Код по классификатору 1.2.643.5.1.13.13.99.2.319.
//  	name - Строка – Наименование. Необязательный параметр.
Функция PersonCardServices() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("code", Неопределено);
	Результат.Вставить("name", Неопределено);
	Возврат Результат;
КонецФункции

// Конструктор структуры данных о временных неисполнениях функциональных обязанностей медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	reasonId - Число – Причина неисполнения по классификатору 1.2.643.5.1.13.13.99.2.192.
//  	beginDate - Дата(ISO8601) – Дата начала неисполнения.
//  	endDate - Дата(ISO8601) – Дата окончания неисполнения.
Функция PersonCardTemporaryDerelictions() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("reasonId", Неопределено);
	Результат.Вставить("beginDate", Неопределено);
	Результат.Вставить("endDate", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОПрофессиональномОбразованииМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о профессиональном образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonProf(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/prof";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) или изменения сведений о профессиональном образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonProfData - Структура - см. описание функции PersonProfData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonProf(PersonKey, PersonProfData) Экспорт 
	
    
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isStudentEducation", PersonProfData.isStudentEducation, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isDuplicate", PersonProfData.isDuplicate, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "educPlace", PersonProfData.educPlace, "Число"); 
	
	ЭлементыВидОбразования = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыВидОбразования, "code", PersonProfData.educationTypeId.code, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "educationTypeId", "{" + СтрСоединить(ЭлементыВидОбразования, ",") + "}", "JSON"); 
	
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "beginYear", PersonProfData.beginYear, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "hasDiploma", PersonProfData.hasDiploma, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docSerial", PersonProfData.docSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docNumber", PersonProfData.docNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docDate", PersonProfData.docDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institutionId", PersonProfData.institutionId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specId", PersonProfData.specId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "oksmId", PersonProfData.oksmId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "unionRepublicId", PersonProfData.unionRepublicId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignInstitution", PersonProfData.foreignInstitution, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "hasForeignCert", PersonProfData.hasForeignCert, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertSerial", PersonProfData.foreignCertSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertNumber", PersonProfData.foreignCertNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertDate", PersonProfData.foreignCertDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "qualificationId", PersonProfData.qualificationId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isTargeted", PersonProfData.isTargeted, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "targetedRegionId", PersonProfData.targetedRegionId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "dutyMonthsPeriod", PersonProfData.dutyMonthsPeriod, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isTargetTerminated", PersonProfData.isTargetTerminated, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "terminationReasonId", PersonProfData.terminationReasonId, "Число"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonProfData.profId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonProfData.profId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/prof";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о профессиональном образовании медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	profId - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                            Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	institutionId - Строка – Образовательная организация (код классификатора 1.2.643.5.1.13.13.11.1519).
//  	docSerial - Строка(10) – Серия диплома.
//  	docNumber - Строка(20) – Номер диплома.
//  	docDate - Дата(ISO8601) – Дата выдачи диплома.
//
Функция PersonProfData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("isStudentEducation", Неопределено);
	Результат.Вставить("profId", Неопределено);
	Результат.Вставить("isDuplicate", Неопределено);
	Результат.Вставить("educPlace", Неопределено);
	Результат.Вставить("educationTypeId", Новый Структура("code,name", Неопределено, Неопределено));
	Результат.Вставить("beginYear", Неопределено);
	Результат.Вставить("hasDiploma", Неопределено);
	Результат.Вставить("docSerial", Неопределено);
	Результат.Вставить("docNumber", Неопределено);
	Результат.Вставить("docDate", Неопределено);
	Результат.Вставить("institutionId", Неопределено);
	Результат.Вставить("specId", Неопределено);
	Результат.Вставить("oksmId", Неопределено);
	Результат.Вставить("unionRepublicId", Неопределено);
	Результат.Вставить("foreignInstitution", Неопределено);
	Результат.Вставить("hasForeignCert", Неопределено);
	Результат.Вставить("foreignCertSerial", Неопределено);
	Результат.Вставить("foreignCertNumber", Неопределено);
	Результат.Вставить("foreignCertDate", Неопределено);
	Результат.Вставить("qualificationId", Неопределено);
	Результат.Вставить("isTargeted", Неопределено);
	Результат.Вставить("targetedRegionId", Неопределено);
	Результат.Вставить("dutyMonthsPeriod", Неопределено);
	Результат.Вставить("isTargetTerminated", Неопределено);
	Результат.Вставить("terminationReasonId", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОПослевузовскомОбразованииМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о послевузовском образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonPostgraduate(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/postgraduate";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) или изменения сведений о послевузовском образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonPostgraduateData - Структура - см. описание функции PersonPostgraduateData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData) Экспорт 
	
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isDuplicate", PersonPostgraduateData.isDuplicate, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "educPlace", PersonPostgraduateData.educPlace, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "educationStageId", PersonPostgraduateData.educationStageId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isStudying", PersonPostgraduateData.isStudying, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "beginYear", PersonPostgraduateData.beginYear, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docSerial", PersonPostgraduateData.docSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docNumber", PersonPostgraduateData.docNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docDate", PersonPostgraduateData.docDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institutionId", PersonPostgraduateData.institutionId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "academicDegreeId", PersonPostgraduateData.academicDegreeId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "scienceBranchId", PersonPostgraduateData.scienceBranchId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specId", PersonPostgraduateData.specId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "doctSpecId", PersonPostgraduateData.doctSpecId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isTargeted", PersonPostgraduateData.isTargeted, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "targetedRegionId", PersonPostgraduateData.targetedRegionId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "dutyMonthsPeriod", PersonPostgraduateData.dutyMonthsPeriod, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "isTargetTerminated", PersonPostgraduateData.isTargetTerminated, "Булево"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "terminationReasonId", PersonPostgraduateData.terminationReasonId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "oksmId", PersonPostgraduateData.oksmId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "unionRepublicId", PersonPostgraduateData.unionRepublicId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignInstitution", PersonPostgraduateData.foreignInstitution, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "hasForeignCert", PersonPostgraduateData.hasForeignCert, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertSerial", PersonPostgraduateData.foreignCertSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertNumber", PersonPostgraduateData.foreignCertNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "foreignCertDate", PersonPostgraduateData.foreignCertDate, "ДатаUTC"); 
	
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonPostgraduateData.postgraduateId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonPostgraduateData.postgraduateId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/postgraduate";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о послевузовском образовании медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	postgraduateId - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                            Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	isDuplicate - Булево – Истина – если документ является дубликатом. Ложь – если документ не является дубликатом.
//  	educPlace - Число – Место получения образования (0 – Россия/РСФСР, 1 – Республики СССР, 2 – иностранное государство).
//  	educationStageId - Число – Тип образования (код из классификатора 1.2.643.5.1.13.13.99.2.104).
//                                 1 Интернатура
//                                 2 Ординатура
//                                 3 Аспирантура
//                                 4 Докторантура
//                                 5 Соискательство
//  	isStudying - Булево – Учится по настоящее время.
//  	beginYear - Число – Год поступления.
//  	docSerial - Строка(6) – Серия диплома.
//  	docNumber - Строка(7) – Номер диплома.
//  	docDate - Дата(ISO8601) – Дата выдачи диплома.
//  	institutionId - Число – Образовательная организация (код из классификатора 1.2.643.5.1.13.13.11.1519).
//  	academicDegreeId - Число – Ученая степень (код из классификатора 1.2.643.5.1.13.13.11.1067).
//  	scienceBranchId - Число – Отрасль науки (код из классификатора 1.2.643.5.1.13.13.11.1068).
//  	specId - Число – Специальность для типов послевузовского образования «Интернатура» или «Ординатура» (код из классификатора 1.2.643.5.1.13.13.11.1066).
//  	doctSpecId - Число – Специальность для типов послевузовского образования «Аспирантура»/«Докторантура» (код из классификатора 1.2.643.5.1.13.13.99.2.220).
//  	isTargeted - Булево – Целевое обучение.
//  	targetedRegionId - Число – Заказчик целевого обучения (код из классификатора 1.2.643.5.1.13.13.99.2.206).
//  	dutyMonthsPeriod - Число – Срок исполнения обязательств в месяцах.
//  	isTargetTerminated - Булево – Расторгнуты ли обязательства по целевому обучению.
//  	terminationReasonId - Число – Причина расторжения целевых обязательств (код из классификатора 1.2.643.5.1.13.13.99.2.353).
//  	oksmId - Число – Страна (код из классификатора 1.2.643.5.1.13.2.1.1.63).
//  	unionRepublicId - Число – Союзная республика (код из классификатора 1.2.643.5.1.13.2.1.1.779).
//  	foreignInstitution - Строка(512) – Образовательная организация.
//  	hasForeignCert - Число – Наличие свидетельства о признании иностранного образования (0 – «Да», 1 – «Нет, но требуется», 2 – «Не требуется»).
//  	foreignCertSerial - Строка(2) – Серия бланка свидетельства о признании иностранного образования.
//  	foreignCertNumber - Строка(12) – Номер бланка свидетельства о признании иностранного образования.
//  	foreignCertDate - Дата(ISO8601) – Дата выдачи свидетельства.
//							
//
Функция PersonPostgraduateData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("postgraduateId", Неопределено);
	Результат.Вставить("isDuplicate", Неопределено);
	Результат.Вставить("educPlace", Неопределено);
	Результат.Вставить("educationStageId", Неопределено);
	Результат.Вставить("isStudying", Неопределено);
	Результат.Вставить("beginYear", Неопределено);
	Результат.Вставить("docSerial", Неопределено);
	Результат.Вставить("docNumber", Неопределено);
	Результат.Вставить("docDate", Неопределено);
	Результат.Вставить("institutionId", Неопределено);
	Результат.Вставить("academicDegreeId", Неопределено);
	Результат.Вставить("scienceBranchId", Неопределено);
	Результат.Вставить("specId", Неопределено);
	Результат.Вставить("doctSpecId", Неопределено);
	Результат.Вставить("isTargeted", Неопределено);
	Результат.Вставить("targetedRegionId", Неопределено);
	Результат.Вставить("dutyMonthsPeriod", Неопределено);
	Результат.Вставить("isTargetTerminated", Неопределено);
	Результат.Вставить("terminationReasonId", Неопределено);
	Результат.Вставить("oksmId", Неопределено);
	Результат.Вставить("unionRepublicId", Неопределено);
	Результат.Вставить("foreignInstitution", Неопределено);
	Результат.Вставить("hasForeignCert", Неопределено);
	Результат.Вставить("foreignCertSerial", Неопределено);
	Результат.Вставить("foreignCertNumber", Неопределено);
	Результат.Вставить("foreignCertDate", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОДополнительномПрофессиональномОбразованииМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о дополнительном профессиональном образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonExt(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/ext";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) или изменения сведений о 
// дополнительном профессиональном образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonPostgraduateData - Структура - см. описание функции PersonExtData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonExt(PersonKey, PersonExtData) Экспорт 
	
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "profEducationKindId", PersonExtData.profEducationKindId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institutionId", PersonExtData.institutionId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "hoursCount", PersonExtData.hoursCount, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "theme", PersonExtData.theme, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docSerial", PersonExtData.docSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docNumber", PersonExtData.docNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docDate", PersonExtData.docDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specId", PersonExtData.specId, "Число"); 
	
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonExtData.extId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonExtData.extId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/ext";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о дополнительном профессиональном образовании (ДПО) медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	extId - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                            Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	profEducationKindId - Число – Вид ДПО (код из классификатора 1.2.643.5.1.13.13.99.2.297).
//                                    1 Повышение квалификации
//                                    2 Стажировка
//                                    3 Профессиональная переподготовка
//  	institutionId - Число – Образовательная организация (код из классификатора 1.2.643.5.1.13.13.11.1519).
//  	hoursCount - Число – Количество часов.
//  	theme - Строка(256) – Тематика.
//  	docSerial - Строка(6) – Серия диплома.
//  	docNumber - Строка(7) – Номер диплома.
//  	docDate - Дата(ISO8601) – Дата выдачи диплома.
//  	specId - Число – Специальность (код из классификатора 1.2.643.5.1.13.13.11.1066).
//							
//
Функция PersonExtData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("extId", Неопределено);
	Результат.Вставить("profEducationKindId", Неопределено);
	Результат.Вставить("institutionId", Неопределено);
	Результат.Вставить("hoursCount", Неопределено);
	Результат.Вставить("theme", Неопределено);
	Результат.Вставить("docSerial", Неопределено);
	Результат.Вставить("docNumber", Неопределено);
	Результат.Вставить("docDate", Неопределено);
	Результат.Вставить("specId", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОСреднемОбщемОбразованииМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о среднем (общем) образовании медицинского работника.
// Подразумевается, что такое образование у человека только одно, т.к. возвращается не список, а единственный объект.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonCommon(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/common";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) или изменения сведений о среднем (общем) образовании медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonCommonData - Структура - см. описание функции PersonCommonData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonCommon(PersonKey, PersonCommonData) Экспорт 
	
	ПрофКурсыРаботника = Новый Массив;
	Если PersonCommonData.profCourseSet<>Неопределено Тогда 
		Для Каждого ДанныеПрофКурса Из PersonCommonData.profCourseSet Цикл
			ДополнительныеЭлементыJSON = Новый Массив;
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "profCourseId", ДанныеПрофКурса.profCourseId, "Число"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "profCourseName", ДанныеПрофКурса.profCourseName, "Строка"); 
			МедицинскиеРегистры.ДобавитьЭлементJSON(ДополнительныеЭлементыJSON, "docDate", ДанныеПрофКурса.docDate, "ДатаUTC"); 
			ПрофКурсыРаботника.Добавить("{" + СтрСоединить(ДополнительныеЭлементыJSON, ",") + "}");
		КонецЦикла;	
	КонецЕсли;
    
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institution", PersonCommonData.institution, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docSerial", PersonCommonData.docSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docNumber", PersonCommonData.docNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "docDate", PersonCommonData.docDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "profCourseSet", "[" + СтрСоединить(ПрофКурсыРаботника, ",") + "]", "JSON"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonCommonData.commonId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonCommonData.commonId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/common";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о среднем (общем) образовании медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	commonId - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                              Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	institution - Строка(512) – Образовательная организация.
//  	docSerial - Строка(5) – Серия аттестата.
//  	docNumber - Строка(14) – Номер аттестата.
//  	docDate - Дата(ISO8601) – Дата выдачи аттестата.
//  	profCourseSet - Массив – Профессиональные курсы (см. Функция PersonCommonProfCourse).
//                               Так как запись сведений о курсе не имеет идентификатора, 
//                               то при обновлении данных весь список переписывается целиком.
//
Функция PersonCommonData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("commonId", Неопределено);
	Результат.Вставить("institution", Неопределено);
	Результат.Вставить("docSerial", Неопределено);
	Результат.Вставить("docNumber", Неопределено);
	Результат.Вставить("docDate", Неопределено);
	Результат.Вставить("profCourseSet", Неопределено);
	Возврат Результат;
КонецФункции

// Конструктор структуры данных профессионального курса, пройденного медицинским работником.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	docDate - Дата(ISO8601) – Дата выдачи документа.
//  	profCourseId - Число – Профессия.
//  	                       Справочник НСИ «ФРМР. Профессиональные курсы», OID 1.2.643.5.1.13.13.99.2.177).
//  	profCourseName - Строка – Наименование профессии.
//  	                          Справочник НСИ «ФРМР. Профессиональные курсы», OID 1.2.643.5.1.13.13.99.2.177).
//
Функция PersonCommonProfCourse() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("profCourseId", Неопределено);
	Результат.Вставить("profCourseName", Неопределено);
	Результат.Вставить("docDate", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОСертификатахМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для создания (create) сведений о сертификате медицинского работника.
// Поскольку неизвестно, как сервис интерпретирует отсутствующие параметры данных, идентификатор параметра указывается всегда,
// даже если значение установлено в Неопределено - в этом случае в качестве значения используется пустая строка или пустой массив.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonCertData - Структура - см. описание функции PersonCertData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonCert(PersonKey, PersonCertData) Экспорт 
	
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institutionId", PersonCertData.institutionId, "JSON"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "institutionName", PersonCertData.institutionName, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "certSerial", PersonCertData.certSerial, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "certNumber", PersonCertData.certNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "examDate", PersonCertData.examDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "passDate", PersonCertData.passDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "endDate", PersonCertData.endDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specId", PersonCertData.specId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specName", PersonCertData.specName, "Строка"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonCertData.certId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonCertData.certId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/cert";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о сертификате медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	certId - Строка(36) – Идентификатор (GUID) записи блока данных, который возвращают методы GET (read) и POST (create). 
//                              Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	institutionId - Строка(6) – Код учебного заведения в классификаторе ФРМР.
//  	institutionName - Строка(150) – Наименование учебного заведения в классификаторе ФРМР.
//  	certSerial - Строка(6) – Серия сертификата.
//  	certNumber - Строка(13) – Номер сертификата.
//  	examDate - Дата(ISO8601) – Дата сдачи сертификационного экзамена.
//  	passDate - Дата(ISO8601) – Дата выдачи сертификата.
//  	endDate - Дата(ISO8601) – Дата окончания срока действия сертификата специалиста.
//  	specId - Число – Специальность (код из классификатора 1.2.643.5.1.13.13.11.1066).
//  	specName - Строка(150) – Наименование специальности в классификаторе ФРМР.
//
Функция PersonCertData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("certId", Неопределено);
	Результат.Вставить("institutionId", Неопределено);
	Результат.Вставить("institutionName", Неопределено);
	Результат.Вставить("certSerial", Неопределено);
	Результат.Вставить("certNumber", Неопределено);
	Результат.Вставить("examDate", Неопределено);
	Результат.Вставить("passDate", Неопределено);
	Результат.Вставить("endDate", Неопределено);
	Результат.Вставить("specId", Неопределено);
	Результат.Вставить("specName", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОНаградахМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о наградах медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonNomination(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/nomination";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) сведений о награде медицинского работника.
// Поскольку неизвестно, как сервис интерпретирует отсутствующие параметры данных, идентификатор параметра указывается всегда,
// даже если значение установлено в Неопределено - в этом случае в качестве значения используется пустая строка или пустой массив.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonCertData - Структура - см. описание функции PersonCertData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonNomination(PersonKey, PersonNominationData) Экспорт 
	
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nominationId", PersonNominationData.nominationId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nomNumber", PersonNominationData.nomNumber, "Строка"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "nomDate", PersonNominationData.nomDate, "ДатаUTC"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonNominationData.entityId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonNominationData.entityId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/nomination";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о награде медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	entityId - Число – Идентификатор записи блока данных, который возвращают методы GET (read) и POST (create). 
//                              Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	nominationId - Число – Награда (код из классификатора 1.2.643.5.1.13.13.99.2.44).
//  	nomNumber - Строка(20) – Номер.
//  	nomDate - Дата(ISO8601) – Дата.
//
Функция PersonNominationData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("entityId", Неопределено);
	Результат.Вставить("nominationId", Неопределено);
	Результат.Вставить("nomNumber", Неопределено);
	Результат.Вставить("nomDate", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область СведенияОКвалификацииМедицинскогоРаботника

// Возвращает параметры вызова rest-метода для чтения сведений о квалификации медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция GetPersonQualification(PersonKey) Экспорт 
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	ПараметрыВызоваМетода.Метод = "GET";
	ПараметрыВызоваМетода.РазделМедрегистра = "person/qualification";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	Возврат ПараметрыВызоваМетода;	      	
    
КонецФункции

// Возвращает параметры вызова rest-метода для создания (create) сведений о квалификации медицинского работника.
// Поскольку неизвестно, как сервис интерпретирует отсутствующие параметры данных, идентификатор параметра указывается всегда,
// даже если значение установлено в Неопределено - в этом случае в качестве значения используется пустая строка или пустой массив.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
//  PersonCertData - Структура - см. описание функции PersonCertData.
// 
// Возвращаемое значение:
//  Структура - см. описание функции МедицинскиеРегистры.ПараметрыВызоваМетода.
//
Функция PostPutPersonQualification(PersonKey, PersonQualificationData) Экспорт 
	
	ЭлементыJSON = Новый Массив;
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "qualifyCategoryId", PersonQualificationData.qualifyCategoryId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "beginDate", PersonQualificationData.beginDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "endDate", PersonQualificationData.endDate, "ДатаUTC"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "specId", PersonQualificationData.specId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "fedPostId", PersonQualificationData.fedPostId, "Число"); 
	МедицинскиеРегистры.ДобавитьЭлементJSON(ЭлементыJSON, "postId", PersonQualificationData.postId, "Число"); 
	ЗаписьJSON = "{" + СтрСоединить(ЭлементыJSON, ",") + "}";
	
	ПараметрыВызоваМетода = МедицинскиеРегистры.ПараметрыВызоваМетода();
	Если PersonQualificationData.qualificationId=Неопределено Тогда 
		ПараметрыВызоваМетода.Метод = "POST";
		PersonKey.entityId = Неопределено;
	Иначе 
		ПараметрыВызоваМетода.Метод = "PUT";
		PersonKey.entityId = PersonQualificationData.qualificationId;
	КонецЕсли;
	ПараметрыВызоваМетода.РазделМедрегистра = "person/qualification";
	ПараметрыВызоваМетода.Команда = ПараметрыВызоваМетода.РазделМедрегистра + "?" + PersonKeyUrl(PersonKey);
	ПараметрыВызоваМетода.Тело = ЗаписьJSON;
	
	Возврат ПараметрыВызоваМетода;	      	
	
КонецФункции

// Конструктор структуры данных о квалификации медицинского работника.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	qualificationId - Число – Идентификатор записи блока данных, который возвращают методы GET (read) и POST (create). 
//                              Для методов PUT (update) и DELETE этот идентификатор указывается как entityId в PersonKey.
//  	qualifyCategoryId - Число – Категория (код из классификатора 1.2.643.5.1.13.13.11.1494).
//  	beginDate - Дата(ISO8601) – Дата присвоения.
//  	endDate - Дата(ISO8601) – Дата окончания срока действия квалификационной категории.
//  	specId - Число – Специальность (код из классификатора 1.2.643.5.1.13.13.11.1066).
//  	fedPostId - Число – Должность по классификатору 1.2.643.5.1.13.13.99.2.885.
//  	postId - Число – Должность по классификатору 1.2.643.5.1.13.13.99.2.181.
//
Функция PersonQualificationData() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("qualificationId", Неопределено);
	Результат.Вставить("qualifyCategoryId", Неопределено);
	Результат.Вставить("beginDate", Неопределено);
	Результат.Вставить("endDate", Неопределено);
	Результат.Вставить("specId", Неопределено);
	Результат.Вставить("fedPostId", Неопределено);
	Результат.Вставить("postId", Неопределено);
	Возврат Результат;
КонецФункции

#КонецОбласти

// Конструктор структуры ключа, однозначно идентифицирующего медицинского работника.
// *** Подразумевается, что такое образование у человека только одно, т.к. метод GET возвращает не список, а единственный объект.
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	mo - Строка – Идентификатор организации.
//  	oid - Строка – OID Медицинского работника.
//  	snils - Строка(11) – СНИЛС.
//  	documentId - Число – Код документа, удостоверяющего личность.
//  	                     Справочник ФНСИ «Документы, удостоверяющие личность», OID 1.2.643.5.1.13.13.99.2.48.
//  	serial - Строка(10) – Серия документа, удостоверяющего личность.
//  	number - Строка(20) – Номер документа, удостоверяющего личность.
//  	passDate - Дата – Дата выдачи документа, удостоверяющего личность.
//  	entityId - Строка(36) – Идентификатор (GUID) записи блока специфических данных (об образовании, сертификате, 
//                              аккредитации и т.п.), которые необходимо изменить или удалить методами PUT (update)
//                              или DELETE. Для остальных методов оставлять в значении Неопределено.
//
Функция PersonKey() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("mo", Неопределено);
	Результат.Вставить("mr", Неопределено);
	Результат.Вставить("oid", Неопределено);
	Результат.Вставить("snils", Неопределено);
	Результат.Вставить("documentId", Неопределено);
	Результат.Вставить("serial", Неопределено);
	Результат.Вставить("number", Неопределено);
	Результат.Вставить("passDate", Неопределено);
	Результат.Вставить("entityId", Неопределено);
	Возврат Результат;
КонецФункции

// Формирует "командную" часть url запроса данных медицинского работника.
//
// Параметры:
//  PersonKey - Структура - см. описание функции PersonKey.
// 
// Возвращаемое значение:
//  Строка - часть url, содержащая пары &параметр=значение.
//
Функция PersonKeyUrl(PersonKey, ПропуститьКлючMr = Ложь, ПропуститьКлючMo = Ложь, ПропуститьСНИЛС = Ложь) Экспорт 
	
	ЭлементыКоманды = Новый Массив;
	Если Не ПропуститьКлючMo И PersonKey.mo <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("mo=" + PersonKey.mo);
	КонецЕсли;
	Если Не ПропуститьКлючMr И PersonKey.mr <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("mr=" + ?(PersonKey.mr, "true", "false"));
	КонецЕсли;
	Если PersonKey.oid <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("oid=" + PersonKey.oid);
	КонецЕсли;
	Если Не ПропуститьСНИЛС И PersonKey.snils <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("snils=" + PersonKey.snils);
	КонецЕсли; 
	documentId = ТегСоЗначениемИзЧислаИлиСтроки("documentId", PersonKey.documentId); 
	Если documentId <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить(documentId);
	КонецЕсли;
	Если PersonKey.serial <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("serial=" + PersonKey.serial);
	КонецЕсли;
	Если PersonKey.number <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("number=" + PersonKey.number);
	КонецЕсли;
	Если PersonKey.passDate <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить("passDate=" + Формат(PersonKey.passDate, "ДФ=гггг-ММ-дд"));
	КонецЕсли;
	entityId = ТегСоЗначениемИзЧислаИлиСтроки("entityId", PersonKey.entityId); 
	Если entityId <> Неопределено Тогда  
	    ЭлементыКоманды.Добавить(entityId);
	КонецЕсли;
	
	Возврат СтрСоединить(ЭлементыКоманды, "&");	      	
    
КонецФункции

Функция ТегСоЗначениемИзЧислаИлиСтроки(Тег, ЗначениеИдентификатора)
	Результат = Неопределено;
	Если ЗначениеИдентификатора<>Неопределено Тогда 
		Если ТипЗнч(ЗначениеИдентификатора)=Тип("Число") Тогда 
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2", Тег, Формат(ЗначениеИдентификатора, "ЧГ=0; ЧН="));
		ИначеЕсли ТипЗнч(ЗначениеИдентификатора)=Тип("Строка") Тогда 
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2", Тег, СокрЛП(ЗначениеИдентификатора));
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

