#Область ПрограммныйИнтерфейс

// Модуль предназначен для описания дополнительных серверных обработчиков, которые впоследствии могут быть указаны в шаблонах процессов.
// Дополнительные обработчики могут выполняться:
// - в одной транзакции с обработчиком выполнения этапа процесса (например, для выполнения связанной логики)
// - до транзакции с обработчиком выполнения этапа (например, для выполнения проверок).
//   В этом случае для выполнения обработчика с клиента делается вызов сервера.
// 
// Модуль обязательно должен содержать в неизменном виде процедуру ОписаниеДополнительныхОбработчиков и процедуру ВыполнитьДополнительныйОбработчик.
// 
// Объявление обработчиков производится в процедуре ОписаниеДополнительныхОбработчиков.
// Код обработчика должен быть описан в этом же модуле в виде отдельной неэкспортной процедуры, имя которой должно
// совпадать с идентификатором обработчика.
// Внимание! Обработчики, предполагающие групповую обработку объектов, инициируются с другим набором параметров. См. описание примеров процедур

// Позволяет дополнить массив МассивОбработчиков объявлениями дополнительных обработчиков из текущего модуля
// 
// Параметры:
//   МассивОбработчиков - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификтор обработчика, должен быть уникален.
//     * Представление - Строка - представление обработчика в формах.
//     * ГрупповаяОбработка - Булево - (необязательный) - признак выполнения обработчика для списка объектов.
//                            Применимо только для обработчиков, выполняемых до транзакции. Значение по умолчанию: Ложь.
//     * ОбъектыМетаданных - Строка - (необязательный) - имена объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора дополнительных обработчиков при настройке шаблонов процессов.
//                           Если свойство отсутствует или не заполнено, то обработчик будет доступен для выбора во всех шаблонах
//
// Пример: 
//   НовыйОбработчик = Новый Структура;
//   НовыйОбработчик.Вставить("Идентификатор", "РПД_КонтрольРасходовИУстановкаСтатусаПодготовлен");
//   НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Контроль расходов и установка статуса ""Подготовлен""'"));
//   НовыйОбработчик.Вставить("ОбъектыМетаданных", "Документ.ЗаявкаНаКассовыйРасход,
//                                                 |Документ.ЗаявкаНаКассовыйРасходСокращенная");
//   МассивОбработчиков.Добавить(НовыйОбработчик);
//   
//   НовыйОбработчик = Новый Структура;
//   НовыйОбработчик.Вставить("Идентификатор", "ПриветМир");
//   НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Вывод сообщения ""Hello world!""'"));
//   МассивОбработчиков.Добавить(НовыйОбработчик);
//
Процедура ОписаниеДополнительныхОбработчиков(МассивОбработчиков) Экспорт
	
	ЗарплатаКадры.ПриОпределенииОписанияДополнительныхОбработчиковПОД(МассивОбработчиков);
	
КонецПроцедуры

//Позволяет выполнить обработчик в безопасном режиме из текущего модуля
// 
// Параметры:
//     Идентификатор - Строка - строковый идентификтор обработчика, должен быть уникален.
//     Параметры - Структура - параметры выполнения дополнительного обработчика.
//
// Пример: 
//   УстановитьБезопасныйРежим(Истина);
//   Выполнить Идентификатор + "(Параметры)";
//
Процедура ВыполнитьДополнительныйОбработчик(Идентификатор, Параметры) Экспорт
	
   ПроцессыОбработкиДокументовЗарплата.ВыполнитьДополнительныйОбработчик(Идентификатор, Параметры);
	
КонецПроцедуры

////////////////////////////////////////////////////////////

// Пример процедуры дополнительного обработчика.
// Для использования необходимо в процедуре ОписаниеДополнительныхОбработчиков вставить объявление обработчика:
//
//   НовыйОбработчик = Новый Структура;
//   НовыйОбработчик.Вставить("Идентификатор", "ПриветМир");
//   НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Вывод сообщения ""Hello world!""'"));
//   МассивОбработчиков.Добавить(НовыйОбработчик);
//
// Код обработчика выполняется в одной транзакции с обработчиком выполнения этапа процесса
// либо в режиме вызова сервера до транзакции.
// 
// Параметры обработчика с параметром ГрупповаяОбработка = Ложь (по умолчанию):
//   Параметры - Структура - параметры обработчика.
//     * Источник - ДокументСсылка - для доступа к контексту документа. 
//     * Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - выполняемая задача
//     * ОтменаВыполнения - Булево - признак отмены выполнения задачи,
//                                   при использовании обработчика режиме вызова сервера до транзакции устанавливается в Ложь.
//     * Отказ - Булево - признак отказа от выполнения этапа. При установке значения Истина транзакция выполнения задачи по данному документу будет отменена
//     * ОписаниеОшибки - Строка - информация об ошибке, причинах отказа от выполнения этапа
//     * ПараметрыОповещения - Структура - если после успешного выполнения обработчика требуется выполнить оповещение на клиенте,
//                                         то в тексте обработчика необоходимо установить свойство ПараметрыОповещения с ключами:
//           * ИмяСобытия - Строка - Имя события. Может быть использовано для идентификации сообщений принимающими их формами.
//           * Параметры - Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//           * Источник - Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//     * ДополнительныеПараметры - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                  Параметр передается между обработчиками в контексте обрабатываемого документа Источник
//     * ДополнительныйКонтекст - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                  Параметр является глобальным для всех обработчиков, вызываемых в рамках одновременного выполнения нескольких задач (из формы списка задач)
//
// Параметры обработчика с параметром ГрупповаяОбработка = Истина (только для обработчиков, выполняемых до транзакции):
//   Параметры - Структура - параметры обработчика.
//     * НаборДанных - Массив - структуры со свойствами:
//       * Источник - ДокументСсылка - для доступа к контексту документа.
//       * Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - выполняемая задача
//       * Отказ - Булево - признак отказа от выполнения этапа. При установке значения Истина, выполнение задачи по данному документу отменяется
//       * ОписаниеОшибки - Строка - информация об ошибке, причинах отказа от выполнения этапа.
//       * ПараметрыОповещения - Структура - если после успешного выполнения обработчика требуется выполнить оповещение на клиенте,
//                                           то в тексте обработчика необоходимо установить свойство ПараметрыОповещения с ключами:
//             * ИмяСобытия - Строка - Имя события. Может быть использовано для идентификации сообщений принимающими их формами.
//             * Параметры - Произвольный - Параметр сообщения. Могут быть переданы любые необходимые данные.
//             * Источник - Произвольный - Источник события. Например, в качестве источника может быть указана другая форма.
//       * ДополнительныеПараметры - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                    Параметр передается между обработчиками в контексте обрабатываемого документа Источник
//     * Отказ - Булево - признак отказа от выполнения этапа. При установке значения Истина, выполнение задач по всем документам в наборе отменяется,
//                        независимо от значений параметра Отказ в каждом из элементов набора
//     * ОписаниеОшибки - Строка - информация об ошибке, причинах отказа от выполнения этапа. Указывается в причинах невыполнения всех документов набора
//     * ДополнительныйКонтекст - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                Параметр является глобальным для всех обработчиков, вызываемых в рамках одновременного выполнения нескольких задач (из формы списка задач)
//
//
//Процедура ПриветМир(Параметры)
//	
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Hello world!'"));
//	
//КонецПроцедуры

// Позволяет подготовить соответствие идентификаторов из МассивОбработчиков или МассивФункций, которые необходимо обновить 
// 
// Параметры:
//   ОбработчикиДляИзменения - Соответствие 
//     * Ключ - Строка - строковый идентификтор обработчика, в предыдущей версии до обновления, который нужно заменить.
//     * Значение - Строка -новый строковый идентификтор обработчика на который нужно произвести замену.
Процедура ПриОпределенииОбновляемыхИдентификаторовОбработчиков(ОбработчикиДляИзменения) Экспорт
	
КонецПроцедуры

#КонецОбласти
