
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭтапа = Параметры.ИдентификаторТекущегоЭтапа;
	ВладелецЭтапа = Параметры.ВладелецЭтапа;
	ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	
	Для Каждого Этап Из Параметры.Этапы Цикл
		
		ПодходитДляЗапуска = Истина;
		ПодходитДляПрерывания = Истина;
		Если Этап.Значение.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			ТекущийЭтапСтрокой = "№" + Этап.Значение.НомерЭтапа + " " + Этап.Значение.НаименованиеЭтапа;
			ШаблонТекущегоЭтапа = Этап.Значение.ШаблонЭтапа;
			Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Порядок выполнения этапа ""%1""'"),
				ТекущийЭтапСтрокой);
			// этап не может инициировать сам себя
			ПодходитДляЗапуска = Ложь;
			// групповой этап разрешено использовать для прерывания самого себя, когда одна задача может прервать параллельные
			ПодходитДляПрерывания = Этап.Значение.ЭтапВыполняетсяНесколькимиИсполнителями;
		КонецЕсли;
		
		Если ПодходитДляЗапуска Тогда
			НовыйЭтап = Этапы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭтап, Этап.Значение);
			НовыйЭтап.НеУдалять = Истина;
			НовыйЭтап.СписокРезультатовВыполнения = ПолучитьСписокУсловийРассмотрения(НовыйЭтап.ШаблонЭтапа);
			НовыйЭтап.СписокВыбораРезультатовВыполнения = СписокВыбораУсловийРассмотренияПоСпискуРезультатовВыполнения(
				НовыйЭтап.СписокРезультатовВыполнения, Этап.Значение.ЭтапВыполняетсяНесколькимиИсполнителями);
			Для Каждого Предшественник Из Параметры.Предшественники Цикл
				Если Предшественник.Значение.ИдентификаторПредшественника <> Этап.Значение.ИдентификаторЭтапа Тогда
					Продолжить;
				КонецЕсли;
				Если НовыйЭтап.Использовать Тогда
					НовыйЭтап = Этапы.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйЭтап, Этап.Значение);
					НовыйЭтап.СписокРезультатовВыполнения = ПолучитьСписокУсловийРассмотрения(НовыйЭтап.ШаблонЭтапа);
					НовыйЭтап.СписокВыбораРезультатовВыполнения = СписокВыбораУсловийРассмотренияПоСпискуРезультатовВыполнения(
						НовыйЭтап.СписокРезультатовВыполнения, Этап.Значение.ЭтапВыполняетсяНесколькимиИсполнителями);
				КонецЕсли;
				НовыйЭтап.Использовать = Истина;
				НовыйЭтап.УсловиеПерехода = Предшественник.Значение.УсловиеПерехода;
				НовыйЭтап.УсловиеРассмотрения = Предшественник.Значение.УсловиеРассмотрения;
				Если НЕ ЗначениеЗаполнено(НовыйЭтап.УсловиеРассмотрения) Тогда
					НовыйЭтап.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
				КонецЕсли;
				НовыйЭтап.ЛюбаяЗадачаПредшественника = Предшественник.Значение.ЛюбаяЗадачаПредшественника;
				// Поиск отсутствующих статусов
				НовыйЭтап.СтатусНеНайден = Истина;
				Для Каждого РезультатыВыполнения Из НовыйЭтап.СписокВыбораРезультатовВыполнения Цикл
					Если НовыйЭтап.УсловиеРассмотрения = РезультатыВыполнения.Значение.Статус
						И НовыйЭтап.ЛюбаяЗадачаПредшественника = РезультатыВыполнения.Значение.ЛюбаяЗадача Тогда
						НовыйЭтап.СтатусНеНайден = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НовыйЭтап.СтатусНеНайден Тогда
					НовыйЭтап.УсловиеРассмотренияПредставление = Строка(НовыйЭтап.УсловиеРассмотрения);
				Иначе
					НовыйЭтап.УсловиеРассмотренияПредставление = РезультатыВыполнения.Представление;
				КонецЕсли;
				НовыйЭтап.ОписаниеУсловия = ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(НовыйЭтап.УсловиеПерехода);
			КонецЦикла;
		КонецЕсли;
		
		Если ПодходитДляПрерывания Тогда
			НовыйЭтап = ЭтапыПрерывание.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭтап, Этап.Значение);
			НовыйЭтап.НеУдалять = Истина;
			НовыйЭтап.СписокРезультатовВыполнения = ПолучитьСписокУсловийРассмотрения(НовыйЭтап.ШаблонЭтапа);
			НовыйЭтап.СписокВыбораРезультатовВыполнения = СписокВыбораУсловийРассмотренияПоСпискуРезультатовВыполнения(
				НовыйЭтап.СписокРезультатовВыполнения, Этап.Значение.ЭтапВыполняетсяНесколькимиИсполнителями, ПодходитДляЗапуска);
			Для Каждого Предшественник Из Параметры.ПредшественникиПрерывания Цикл
				Если Предшественник.Значение.ИдентификаторПредшественника <> Этап.Значение.ИдентификаторЭтапа Тогда
					Продолжить;
				КонецЕсли;
				Если НовыйЭтап.Использовать Тогда
					НовыйЭтап = ЭтапыПрерывание.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйЭтап, Этап.Значение);
					НовыйЭтап.СписокРезультатовВыполнения = ПолучитьСписокУсловийРассмотрения(НовыйЭтап.ШаблонЭтапа);
					НовыйЭтап.СписокВыбораРезультатовВыполнения = СписокВыбораУсловийРассмотренияПоСпискуРезультатовВыполнения(
						НовыйЭтап.СписокРезультатовВыполнения, Этап.Значение.ЭтапВыполняетсяНесколькимиИсполнителями, ПодходитДляЗапуска);
				КонецЕсли;
				НовыйЭтап.Использовать = Истина;
				НовыйЭтап.УсловиеПерехода = Предшественник.Значение.УсловиеПерехода;
				НовыйЭтап.УсловиеРассмотрения = Предшественник.Значение.УсловиеРассмотрения;
				Если НЕ ЗначениеЗаполнено(НовыйЭтап.УсловиеРассмотрения) Тогда
					НовыйЭтап.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
				КонецЕсли;
				НовыйЭтап.ЛюбаяЗадачаПредшественника = Предшественник.Значение.ЛюбаяЗадачаПредшественника;
				// Поиск отсутствующих статусов
				НовыйЭтап.СтатусНеНайден = Истина;
				Для Каждого РезультатыВыполнения Из НовыйЭтап.СписокВыбораРезультатовВыполнения Цикл
					Если НовыйЭтап.УсловиеРассмотрения = РезультатыВыполнения.Значение.Статус
						И НовыйЭтап.ЛюбаяЗадачаПредшественника = РезультатыВыполнения.Значение.ЛюбаяЗадача Тогда
						НовыйЭтап.СтатусНеНайден = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НовыйЭтап.СтатусНеНайден Тогда
					НовыйЭтап.УсловиеРассмотренияПредставление = Строка(НовыйЭтап.УсловиеРассмотрения);
				Иначе
					НовыйЭтап.УсловиеРассмотренияПредставление = РезультатыВыполнения.Представление;
				КонецЕсли;
				НовыйЭтап.ОписаниеУсловия = ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(НовыйЭтап.УсловиеПерехода);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.ПредшественникиВариантИспользования) Тогда
		Если Лев(Параметры.ПредшественникиВариантИспользования,6) = "Старт," Тогда
			ПорядокИспользования = Сред(Параметры.ПредшественникиВариантИспользования,7);
			СтартовыйЭтап = Истина;
		Иначе
			ПорядокИспользования = Параметры.ПредшественникиВариантИспользования;
		КонецЕсли;
	Иначе
		ПорядокИспользования = "ВсеПредшественники";
		Для Каждого Строка Из Этапы Цикл
			Если Строка.Использовать Тогда
				ПорядокИспользования = "ВсеПредшественники";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НайденИспользуемыйПредшественник = Ложь;
	Для Каждого Строка Из Этапы Цикл
		Если Строка.Использовать Тогда
			НайденИспользуемыйПредшественник = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ НайденИспользуемыйПредшественник Тогда
		ПорядокИспользования = "ВсеПредшественники";
	КонецЕсли;
	
	ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске =
		Параметры.ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске;
	
	НеЗапрещатьОтменуВыполненияПриНаличииПрерванных =
		Параметры.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтартовыйЭтап", "Видимость", Параметры.ДоступнаОтметкаСтартовогоЭтапа);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске", "Видимость", Параметры.РолеваяАдресация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВыборЭтапаПроцесса"
		И ВыбранноеЗначение <> Неопределено Тогда
		
		Если Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСтарт Тогда
			СписокЭтапов = Этапы;
			ТаблицаЭтапы = Элементы.ОбъектЭтапы;
		ИначеЕсли Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Элементы.СтраницаПрерывание Тогда
			СписокЭтапов = ЭтапыПрерывание;
			ТаблицаЭтапы = Элементы.ОбъектЭтапыПрерывание;
		Иначе
			Возврат;
		КонецЕсли;
		
		КоличествоЭлементовКоллекции = СписокЭтапов.Количество();
		Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
			Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
			
			Этап = СписокЭтапов[Индекс];
			
			Если Этап.ИдентификаторЭтапа <> ВыбранноеЗначение.ИдентификаторЭтапа Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйЭтап = СписокЭтапов.Вставить(СписокЭтапов.Индекс(Этап) + 1);
			
			ЗаполнитьЗначенияСвойств(НовыйЭтап, Этап);
			
			НовыйЭтап.УсловиеПерехода = Неопределено;
			НовыйЭтап.ОписаниеУсловия = "";
			
			НовыйЭтап.НеУдалять = Ложь;
			
			ТаблицаЭтапы.ТекущаяСтрока = СписокЭтапов.Количество() - 1;
			
			Прервать;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОбъектЭтапы

&НаКлиенте
Процедура ОбъектЭтапыИспользоватьПриИзменении(Элемент)
	
	ТекущийЭтап = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	УстановитьДоступностьУсловияРассмотрения(ТекущийЭтап.СписокВыбораРезультатовВыполнения, Элементы.УсловиеРассмотрения);
	
	Если НЕ ТекущийЭтап.Использовать Тогда
		
		Элементы.УсловиеРассмотрения.ТолькоПросмотр = Истина;
		
		ТекущийЭтап.УсловиеРассмотрения = Неопределено;
		ТекущийЭтап.УсловиеПерехода = Неопределено;
		ТекущийЭтап.ИмяПредметаУсловия = Неопределено;
		ТекущийЭтап.ОписаниеУсловия = "";
		ТекущийЭтап.УсловиеРассмотренияПредставление = "";
		ТекущийЭтап.СтатусНеНайден = Ложь;
		ТекущийЭтап.ЛюбаяЗадачаПредшественника = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
		
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭтап.СписокВыбораРезультатовВыполнения.Количество() > 0 Тогда
		ТекущийЭтап.УсловиеРассмотрения = ТекущийЭтап.СписокВыбораРезультатовВыполнения[0].Значение.Статус;
	КонецЕсли;
	
	ТекущийЭтап.ОписаниеУсловия = "";
	
	Для Каждого ЭлементСпискаВыбора Из Элементы.УсловиеРассмотрения.СписокВыбора Цикл
		Если ЭлементСпискаВыбора.Значение.Статус = ТекущийЭтап.УсловиеРассмотрения
			И ЭлементСпискаВыбора.Значение.ЛюбаяЗадача = ТекущийЭтап.ЛюбаяЗадачаПредшественника Тогда
			ТекущийЭтап.УсловиеРассмотренияПредставление = ЭлементСпискаВыбора.Представление;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОбъектЭтапы.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПриАктивизацииСтроки(Элемент)
	
	ТекущийЭтап = Элементы.ОбъектЭтапы.ТекущиеДанные;
	Если ТекущийЭтап = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьУсловияРассмотрения(ТекущийЭтап.СписокВыбораРезультатовВыполнения, Элементы.УсловиеРассмотрения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалитьЭтап", "Доступность", НЕ ТекущийЭтап.НеУдалять);
	
	Если НЕ ТекущийЭтап.Использовать Тогда
		Элементы.УсловиеРассмотрения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущийЭтап = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	Если ТекущийЭтап.Использовать
		И ЗначениеЗаполнено(ИдентификаторДокумента)
		И Поле.Имя = "ОбъектЭтапыОписаниеУсловия" Тогда
		ПараметрыФормы = Новый Структура("ИдентификаторДокумента, НастройкиОтбора, ЗаголовокОкна, ВидНастройкиФункцийУсловий",
			ИдентификаторДокумента,
			ТекущийЭтап.УсловиеПерехода,
			НСтр("ru = 'Установка условия перехода'"),
			"НастройкиУсловийПерехода");
		ОткрытьФорму("ОбщаяФорма.НастройкаОтбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекущаяСтрока.УсловиеПерехода = ВыбранноеЗначение.НастройкиОтбора;
		ТекущаяСтрока.ОписаниеУсловия = ВыбранноеЗначение.ПредставлениеОтбора;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеРассмотренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	ТекущиеДанные.УсловиеРассмотрения = ВыбранноеЗначение.Статус;
	ТекущиеДанные.УсловиеРассмотренияПредставление = Строка(ТекущиеДанные.УсловиеРассмотрения);
	ТекущиеДанные.ЛюбаяЗадачаПредшественника = ВыбранноеЗначение.ЛюбаяЗадача;
	Для Каждого ЭлементСпискаВыбора Из Элементы.УсловиеРассмотрения.СписокВыбора Цикл
		Если ЭлементСпискаВыбора.Значение.Статус = ТекущиеДанные.УсловиеРассмотрения
			И ЭлементСпискаВыбора.Значение.ЛюбаяЗадача = ВыбранноеЗначение.ЛюбаяЗадача Тогда
			ТекущиеДанные.УсловиеРассмотренияПредставление = ЭлементСпискаВыбора.Представление;
			ТекущиеДанные.СтатусНеНайден = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОбъектЭтапы.ЗакончитьРедактированиеСтроки(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеРассмотренияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	ТекущиеДанные.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
	ТекущиеДанные.СтатусНеНайден = Ложь;
	ТекущиеДанные.ЛюбаяЗадачаПредшественника = Ложь;
	Для Каждого УсловиеРассмотрения Из Элементы.УсловиеРассмотрения.СписокВыбора Цикл
		Если УсловиеРассмотрения.Значение.Статус = ТекущиеДанные.УсловиеРассмотрения
			И УсловиеРассмотрения.Значение.ЛюбаяЗадача = ТекущиеДанные.ЛюбаяЗадачаПредшественника Тогда
			ТекущиеДанные.УсловиеРассмотренияПредставление = УсловиеРассмотрения.Представление;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ОбъектЭтапы.ТекущиеДанные;
	Отказ = ТекущиеДанные.НеУдалять;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОбъектЭтапыПрерывание

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеИспользоватьПриИзменении(Элемент)
	
	ТекущийЭтап = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	
	УстановитьДоступностьУсловияРассмотрения(ТекущийЭтап.СписокВыбораРезультатовВыполнения, Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения);
	
	Если НЕ ТекущийЭтап.Использовать Тогда
		
		Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения.ТолькоПросмотр = Истина;
		
		ТекущийЭтап.УсловиеРассмотрения = Неопределено;
		ТекущийЭтап.УсловиеПерехода = Неопределено;
		ТекущийЭтап.ИмяПредметаУсловия = Неопределено;
		ТекущийЭтап.ОписаниеУсловия = "";
		ТекущийЭтап.УсловиеРассмотренияПредставление = "";
		ТекущийЭтап.СтатусНеНайден = Ложь;
		ТекущийЭтап.ЛюбаяЗадачаПредшественника = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
		
		Возврат;
		
	КонецЕсли;
	
	Если ТекущийЭтап.СписокВыбораРезультатовВыполнения.Количество() > 1 Тогда
		ТекущийЭтап.УсловиеРассмотрения = ТекущийЭтап.СписокВыбораРезультатовВыполнения[0].Значение.Статус;
		ТекущийЭтап.ЛюбаяЗадачаПредшественника = ТекущийЭтап.СписокВыбораРезультатовВыполнения[0].Значение.ЛюбаяЗадача;
	Иначе
		ТекущийЭтап.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
	КонецЕсли;
	ТекущийЭтап.ОписаниеУсловия = "";
	
	Для Каждого ЭлементСпискаВыбора Из Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения.СписокВыбора Цикл
		Если ЭлементСпискаВыбора.Значение.Статус = ТекущийЭтап.УсловиеРассмотрения
			И ЭлементСпискаВыбора.Значение.ЛюбаяЗадача = ТекущийЭтап.ЛюбаяЗадачаПредшественника Тогда
			ТекущийЭтап.УсловиеРассмотренияПредставление = ЭлементСпискаВыбора.Представление;
		КонецЕсли;
	КонецЦикла;
	Элементы.ОбъектЭтапыПрерывание.ЗакончитьРедактированиеСтроки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеПриАктивизацииСтроки(Элемент)
	
	ТекущийЭтап = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	Если ТекущийЭтап = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьУсловияРассмотрения(ТекущийЭтап.СписокВыбораРезультатовВыполнения, Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалитьЭтапПрерывание", "Доступность", НЕ ТекущийЭтап.НеУдалять);
	
	Если НЕ ТекущийЭтап.Использовать Тогда
		Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтапыПрерывание.Получить(ВыбраннаяСтрока).Использовать
		И ЗначениеЗаполнено(ИдентификаторДокумента)
		И Поле.Имя = "ОбъектЭтапыПрерываниеОписаниеУсловия" Тогда
		ПараметрыФормы = Новый Структура("ИдентификаторДокумента, НастройкиОтбора, ЗаголовокОкна, ВидНастройкиФункцийУсловий",
			ИдентификаторДокумента, 
			ЭтапыПрерывание.Получить(ВыбраннаяСтрока).УсловиеПерехода,
			НСтр("ru = 'Установка условия перехода'"),
			"НастройкиУсловийПерехода");
		ОткрытьФорму("ОбщаяФорма.НастройкаОтбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекущаяСтрока.УсловиеПерехода = ВыбранноеЗначение.НастройкиОтбора;
		ТекущаяСтрока.ОписаниеУсловия = ВыбранноеЗначение.ПредставлениеОтбора;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловиеРассмотренияПрерываниеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	
	ТекущиеДанные.УсловиеРассмотрения = ВыбранноеЗначение.Статус;
	ТекущиеДанные.УсловиеРассмотренияПредставление = Строка(ТекущиеДанные.УсловиеРассмотрения);
	ТекущиеДанные.ЛюбаяЗадачаПредшественника = ВыбранноеЗначение.ЛюбаяЗадача;
	Для Каждого ЭлементСпискаВыбора Из Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения.СписокВыбора Цикл
		Если ЭлементСпискаВыбора.Значение.Статус = ТекущиеДанные.УсловиеРассмотрения
			И ЭлементСпискаВыбора.Значение.ЛюбаяЗадача = ВыбранноеЗначение.ЛюбаяЗадача Тогда
			ТекущиеДанные.УсловиеРассмотренияПредставление = ЭлементСпискаВыбора.Представление;
			ТекущиеДанные.СтатусНеНайден = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ОбъектЭтапыПрерывание.ЗакончитьРедактированиеСтроки(Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеУсловиеРассмотренияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	
	ТекущиеДанные.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
	ТекущиеДанные.СтатусНеНайден = Ложь;
	ТекущиеДанные.ЛюбаяЗадачаПредшественника = Ложь;
	Для Каждого УсловиеРассмотрения Из Элементы.ОбъектЭтапыПрерываниеУсловиеРассмотрения.СписокВыбора Цикл
		Если УсловиеРассмотрения.Значение.Статус = ТекущиеДанные.УсловиеРассмотрения
			И УсловиеРассмотрения.Значение.ЛюбаяЗадача = ТекущиеДанные.ЛюбаяЗадачаПредшественника Тогда
			ТекущиеДанные.УсловиеРассмотренияПредставление = УсловиеРассмотрения.Представление;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектЭтапыПрерываниеПередУдалением(Элемент, Отказ)
	ТекущиеДанные = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	Отказ = ТекущиеДанные.НеУдалять;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЭтап(Команда)
	
	ТекущиеДанные = Элементы.ОбъектЭтапы.ТекущиеДанные;
	
	ДоступныеЭтапы = Новый Массив;
	Для Каждого Этап Из Этапы Цикл
		ДоступныеЭтапы.Добавить(Этап.ИдентификаторЭтапа);
	КонецЦикла;
	
	ДоступныеЭтапы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДоступныеЭтапы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 				НСтр("ru = 'Выбор этапа'"));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 		Истина);
	ПараметрыФормы.Вставить("Шаблон", 					ВладелецЭтапа);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа",		ТекущиеДанные.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("ОграничитьСпискокЭтапов", 	Истина);
	ПараметрыФормы.Вставить("ДоступныеЭтапы", 			ДоступныеЭтапы);
	
	ОткрытьФорму("ОбщаяФорма.ВыборЭтапаПроцесса", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭтапПрерывание(Команда)
	
	ТекущиеДанные = Элементы.ОбъектЭтапыПрерывание.ТекущиеДанные;
	
	ДоступныеЭтапы = Новый Массив;
	Для Каждого Этап Из ЭтапыПрерывание Цикл
		ДоступныеЭтапы.Добавить(Этап.ИдентификаторЭтапа);
	КонецЦикла;
	
	ДоступныеЭтапы = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДоступныеЭтапы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 				НСтр("ru = 'Выбор этапа'"));
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", 		Истина);
	ПараметрыФормы.Вставить("Шаблон", 					ВладелецЭтапа);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа",		ТекущиеДанные.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("ОграничитьСпискокЭтапов", 	Истина);
	ПараметрыФормы.Вставить("ДоступныеЭтапы", 			ДоступныеЭтапы);
	
	ОткрытьФорму("ОбщаяФорма.ВыборЭтапаПроцесса", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОчиститьСообщения();
	
	// Для запуска по И не должно быть дублей инициирующих этапов
	Если ПорядокИспользования = "ВсеПредшественники" Тогда
		ИдентификаторЭтапаПредшественника = Неопределено;
		Для Каждого Этап Из Этапы Цикл
			Если НЕ Этап.Использовать Тогда
				Продолжить;
			КонецЕсли;
			Если ИдентификаторЭтапаПредшественника <> Этап.ИдентификаторЭтапа Тогда
				ИдентификаторЭтапаПредшественника = Этап.ИдентификаторЭтапа;
			Иначе
				ТекстСообщения = НСтр("ru = 'При старте этапа по И не должно быть дублей инициирующих этапов'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,"Этапы");
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Условия старта этапа не должны пересекаться
	
	СписокПредшественников = Новый СписокЗначений;
	Для Каждого Этап Из Этапы Цикл
		Если НЕ Этап.Использовать Тогда
			Продолжить;
		КонецЕсли;
		ДанныеПредшественника = Новый Структура;
		ДанныеПредшественника.Вставить("УсловиеПерехода", Этап.УсловиеПерехода);
		ДанныеПредшественника.Вставить("ОписаниеУсловия", Этап.ОписаниеУсловия);
		ДанныеПредшественника.Вставить("УсловиеРассмотрения", Этап.УсловиеРассмотрения);
		ДанныеПредшественника.Вставить("ИдентификаторПредшественника", Этап.ИдентификаторЭтапа);
		ДанныеПредшественника.Вставить("ЛюбаяЗадачаПредшественника", Этап.ЛюбаяЗадачаПредшественника);
		СписокПредшественников.Добавить(ДанныеПредшественника);
	КонецЦикла;
	
	Если СписокПредшественников.Количество() = 0
		И НЕ СтартовыйЭтап Тогда
		ТекстСообщения = НСтр("ru = 'Если этап не стартовый, необходимо отметить хотя бы одно действие'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,"Этапы");
		Возврат;
	КонецЕсли;
	
	СписокПредшественниковПрерывание = Новый СписокЗначений;
	Для Каждого Этап Из ЭтапыПрерывание Цикл
		Если НЕ Этап.Использовать Тогда
			Продолжить;
		КонецЕсли;
		ДанныеПредшественника = Новый Структура;
		ДанныеПредшественника.Вставить("УсловиеПерехода", Этап.УсловиеПерехода);
		ДанныеПредшественника.Вставить("ОписаниеУсловия", Этап.ОписаниеУсловия);
		ДанныеПредшественника.Вставить("УсловиеРассмотрения", Этап.УсловиеРассмотрения);
		ДанныеПредшественника.Вставить("ИдентификаторПредшественника", Этап.ИдентификаторЭтапа);
		ДанныеПредшественника.Вставить("ЛюбаяЗадачаПредшественника", Этап.ЛюбаяЗадачаПредшественника);
		СписокПредшественниковПрерывание.Добавить(ДанныеПредшественника);
	КонецЦикла;
	
	ДанныеВозврата = Новый Структура;
	Если СтартовыйЭтап Тогда
		ДанныеВозврата.Вставить("ПредшественникиВариантИспользования","Старт,"+ПорядокИспользования);
	Иначе
		ДанныеВозврата.Вставить("ПредшественникиВариантИспользования", ПорядокИспользования);
	КонецЕсли;
	
	ДанныеВозврата.Вставить("Предшественники", СписокПредшественников);
	ДанныеВозврата.Вставить("ПредшественникиПрерывание", СписокПредшественниковПрерывание);
	ДанныеВозврата.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа);
	ДанныеВозврата.Вставить("УдаленыНесуществующиеСтатусы", НЕ ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание));
	ДанныеВозврата.Вставить("ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске",
		ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске);
	ДанныеВозврата.Вставить("НеЗапрещатьОтменуВыполненияПриНаличииПрерванных",
		НеЗапрещатьОтменуВыполненияПриНаличииПрерванных);
	
	ДанныеВозврата.Вставить("ИмяНастройки", "НастройкаПорядкаВыполнения");
	
	ОповеститьОВыборе(ДанныеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьУсловияРассмотрения(СписокВыбораРезультатовВыполнения, ЭлементУсловиеРассмотрения)
	
	Если СписокВыбораРезультатовВыполнения.Количество() > 1 Тогда
		Если ЭлементУсловиеРассмотрения.ТолькоПросмотр Тогда
			ЭлементУсловиеРассмотрения.ТолькоПросмотр = Ложь;
		КонецЕсли;
	Иначе
		Если НЕ ЭлементУсловиеРассмотрения.ТолькоПросмотр Тогда
			ЭлементУсловиеРассмотрения.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементУсловиеРассмотрения.СписокВыбора.Очистить();
	Для Каждого ЭлементСпискаРезультатовВыполнения Из СписокВыбораРезультатовВыполнения Цикл
		ЭлементУсловиеРассмотрения.СписокВыбора.Добавить(ЭлементСпискаРезультатовВыполнения.Значение,
			ЭлементСпискаРезультатовВыполнения.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокУсловийРассмотрения(ШаблонЭтапа)
	
	СписокУсловий = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка КАК Ссылка,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК СтатусПослеВыполнения,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения.Наименование КАК СтатусПослеВыполненияНаименование
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка = &Ссылка
	|	И НЕ ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ШаблонЭтапа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокУсловий.Добавить(Выборка.СтатусПослеВыполнения, Выборка.СтатусПослеВыполненияНаименование);
	КонецЦикла;
	
	Возврат СписокУсловий;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокВыбораУсловийРассмотренияПоСпискуРезультатовВыполнения(СписокРезультатовВыполнения,
	ГрупповойЭтап = Ложь, РазрешеныВсеЗадачи = Истина)
	
	СписокВыбора = Новый СписокЗначений;
	
	Для Каждого ЭлементСпискаРезультатовВыполнения Из СписокРезультатовВыполнения Цикл
		Если РазрешеныВсеЗадачи Тогда
			СписокВыбора.Добавить(Новый Структура("Статус, ЛюбаяЗадача", ЭлементСпискаРезультатовВыполнения.Значение, Ложь),
				ЭлементСпискаРезультатовВыполнения.Представление + ?(ГрупповойЭтап, НСтр("ru = ' (все задачи)'"), ""));
		КонецЕсли;
		Если ГрупповойЭтап Тогда
			СписокВыбора.Добавить(Новый Структура("Статус, ЛюбаяЗадача", ЭлементСпискаРезультатовВыполнения.Значение, Истина),
				ЭлементСпискаРезультатовВыполнения.Представление + НСтр("ru = ' (любая задача)'"));
		КонецЕсли;
	КонецЦикла;
	
	Если РазрешеныВсеЗадачи Тогда
		СписокВыбора.Добавить(Новый Структура("Статус, ЛюбаяЗадача", ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка"), Ложь),
			НСтр("ru = 'Любой результат'") + ?(ГрупповойЭтап, НСтр("ru = ' (все задачи)'"), ""));
	КонецЕсли;
	Если ГрупповойЭтап Тогда
		СписокВыбора.Добавить(Новый Структура("Статус, ЛюбаяЗадача", ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка"), Истина),
			НСтр("ru = 'Любой результат'") + НСтр("ru = ' (любая задача)'"));
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВНастройкеЕстьОтсутствующиеСтатусы(Этапы, ЭтапыПрерывание)
	
	Для Каждого Этап Из Этапы Цикл
		Если Этап.СтатусНеНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Этап Из ЭтапыПрерывание Цикл
		Если Этап.СтатусНеНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
