#Область СлужебныйПрограммныйИнтерфейс

// Записывает статистику конфигурации по объектам подсистемы.
// 
// Параметры:
//  ИмяКонфигурации - Строка - Имя конфигурации (шапка статистики).
//  ИмяПодсистемы - Строка - Имя подсистемы.
//  СтатистикаПоОбъектам - Соответствие - Имя объекта (ключ), структура метрик (значение).
//  ВидСтатистики - Строка - Вид статистики конфигурации. см. ВидыСтатистики().
Процедура ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоОбъектам, ВидСтатистики) Экспорт
	
	Для Каждого Объект Из СтатистикаПоОбъектам Цикл
		Для Каждого Статистика Из Объект.Значение Цикл
			ИмяОперации = СтрШаблон("%1.%2.%3.%4.%5",
				ИмяКонфигурации, ИмяПодсистемы, Объект.Ключ, ВидСтатистики, Статистика.Ключ);
			ЦентрМониторинга.ЗаписатьСтатистикуОбъектаКонфигурации(ИмяОперации, Статистика.Значение)
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Дата начала сбора статистики.
// 
// Возвращаемое значение:
//  Дата - Начало отбора статистики
Функция НачалоПериодаСбораСтатистики() Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДлительностьСуток = ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах();
	НачалоОтбора = ТекущаяДата - (7 * ДлительностьСуток);
	
	Возврат НачалоОтбора;
	
КонецФункции

// Подсчет среднего на объект группировки.
// 
// Параметры:
//  Объектов - Число - Всего объектов.
//  Групп - Число - Всего объектов группировки.
// 
// Возвращаемое значение:
//  Число - Среднее значение
Функция ОбъектовВСреднем(Объектов, Групп) Экспорт
	
	Если Групп < 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Объектов / Групп;
	
КонецФункции

// Подсчет несмещенной оценки дисперсии.
// 
// Параметры:
//  Групп - Число - Всего объектов группировки.
//  ОбъектовПоГруппам - Массив - Распределение по объектам группировки.
//  ВСреднемНаГруппу - Число - Среднее на объект группировки.
// 
// Возвращаемое значение:
//  Число - Дисперсия
Функция Дисперсия(Групп, ОбъектовПоГруппам, ВСреднемНаГруппу) Экспорт
	
	Если Групп < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СуммаОтклонений = 0;
	Для Каждого Объектов Из ОбъектовПоГруппам Цикл
		СуммаОтклонений = СуммаОтклонений + Pow((Объектов - ВСреднемНаГруппу), 2);
	КонецЦикла;
	
	Дисперсия = Sqrt((СуммаОтклонений / (Групп - 1)));
	
	Возврат Дисперсия;
	
КонецФункции

// Стандартные показатели статистики по журналу документов.
// 
// Параметры:
//  Журнал - ОбъектМетаданных - Журнал документов.
//  НачалоОтбора - Дата - Начало отбора статистики.
// 
// Возвращаемое значение:
//  Соответствие - Стандартные показатели по документам журнала
Функция СтандартныеПоказателиПоЖурналу(Журнал, НачалоОтбора = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорСхемы = ОписаниеЗапроса.Операторы[0];
	
	ОператорСхемы.Источники.Добавить(Журнал.ПолноеИмя(), "Документ");
	
	ПолеТип = ОператорСхемы.ВыбираемыеПоля.Добавить("Документ.Тип", 0);
	ПолеОтветственный = ОператорСхемы.ВыбираемыеПоля.Добавить("Документ.Ответственный", 1);
	ПолеДокумент = ОператорСхемы.ВыбираемыеПоля.Добавить("Документ.Ссылка", 2);
	
	Колонка = ОписаниеЗапроса.Колонки.Найти(ПолеТип);
	Колонка.Псевдоним = "Тип";
	Колонка = ОписаниеЗапроса.Колонки.Найти(ПолеОтветственный);
	Колонка.Псевдоним = "Ответственных";
	Колонка = ОписаниеЗапроса.Колонки.Найти(ПолеДокумент);
	Колонка.Псевдоним = "Документов";
	
	Если НачалоОтбора <> Неопределено Тогда
		ОператорСхемы.Отбор.Добавить("Документ.Дата > &НачалоПериода");
		Запрос.УстановитьПараметр("НачалоПериода", НачалоОтбора);
		ОператорСхемы.Отбор.Добавить("Документ.Дата <= &КонецПериода");
		Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	КонецЕсли;
	ОператорСхемы.Отбор.Добавить("Документ.Проведен");
	ОператорСхемы.Отбор.Добавить("НЕ Документ.ПометкаУдаления");
	
	ОписаниеЗапроса.ВыраженияИтогов.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Ответственных)", "Ответственных");
	ОписаниеЗапроса.ВыраженияИтогов.Добавить("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Документов)", "Документов");
	
	ОписаниеЗапроса.КонтрольныеТочкиИтогов.Добавить("Тип");
	ОписаниеЗапроса.КонтрольныеТочкиИтогов.Добавить("Ответственных");
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Результат = РезультатЗапросаПоЖурналу(Запрос);
	
	Возврат Результат;
	
КонецФункции

// Стандартные показатели статистики по таблице.
// 
// Параметры:
//  Таблица - ОбъектМетаданных - Таблица сбора статистики.
//  ДанныеСтатистики - Структура - Данные для сбора статистики из таблицы.
//		- см. СборСтатистики.ДанныеСтатистики.
//  Родитель - Булево - Наличие родителя у таблицы..
// 
// Возвращаемое значение:
//  Соответствие - Стандартные показатели статистики по таблице
Функция СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Родитель = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорСхемы = ОписаниеЗапроса.Операторы[0];
	
	Если Родитель Тогда
		ПолноеИмяТаблицы = СтрШаблон("%1.%2", Таблица.Родитель().ПолноеИмя(), Таблица.Имя);
	Иначе
		ПолноеИмяТаблицы = Таблица.ПолноеИмя();
	КонецЕсли;
	ОператорСхемы.Источники.Добавить(ПолноеИмяТаблицы, "Таблица");
	
	ПолеОбъектов = ОператорСхемы.ВыбираемыеПоля.Добавить(
		СтрШаблон("КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Таблица.%1)", ДанныеСтатистики.ДанныеОбъекта.Объект.Имя), 0);
	Колонка = ОписаниеЗапроса.Колонки.Найти(ПолеОбъектов);
	Колонка.Псевдоним = "Объектов";
	ОписаниеЗапроса.ВыраженияИтогов.Добавить("СУММА(Объектов)", "Объектов");
	
	НомерКолонки = 1;
	Для Каждого ДанныеГруппировки Из ДанныеСтатистики.ДанныеГруппировок Цикл
		ПолеГруппировка = ОператорСхемы.ВыбираемыеПоля.Добавить(
			СтрШаблон("Таблица.%1", ДанныеГруппировки.Группировка.Имя), НомерКолонки);
		Колонка = ОписаниеЗапроса.Колонки.Найти(ПолеГруппировка);
		Колонка.Псевдоним = ДанныеГруппировки.Группировка.Имя;
		ОператорСхемы.Группировка.Добавить(СтрШаблон("Таблица.%1", ДанныеГруппировки.Группировка.Имя));
		ОписаниеЗапроса.КонтрольныеТочкиИтогов.Добавить(ДанныеГруппировки.Группировка.Имя);
		НомерКолонки = НомерКолонки + 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеСтатистики.ДанныеПериода.НачалоПериода) Тогда
		ОператорСхемы.Отбор.Добавить(СтрШаблон("Таблица.%1 > &НачалоПериода", ДанныеСтатистики.ДанныеПериода.Период.Имя));
		Запрос.УстановитьПараметр("НачалоПериода", ДанныеСтатистики.ДанныеПериода.НачалоПериода);
		ОператорСхемы.Отбор.Добавить(СтрШаблон("Таблица.%1 <= &КонецПериода", ДанныеСтатистики.ДанныеПериода.Период.Имя));
		Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если ДанныеСтатистики.ПроверкиОбъекта.Проведение Тогда
		ОператорСхемы.Отбор.Добавить("Таблица.Ссылка.Проведен");
	КонецЕсли;
	
	Если ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления Тогда
		ОператорСхемы.Отбор.Добавить("НЕ Таблица.Ссылка.ПометкаУдаления");
	КонецЕсли;
	
	Если ДанныеСтатистики.ПроверкиОбъекта.ВАрхиве Тогда
		ОператорСхемы.Отбор.Добавить("НЕ Таблица.Ссылка.ВАрхиве");
	КонецЕсли;
	
	Для Каждого ДополнительныйОтбор Из ДанныеСтатистики.ДополнительныеОтборы Цикл
		ОператорСхемы.Отбор.Добавить(СтрШаблон("Таблица.%1 %2 &%1",
			ДополнительныйОтбор.ИмяОтбора, ДополнительныйОтбор.ВидСравнения));
		Запрос.УстановитьПараметр(ДополнительныйОтбор.ИмяОтбора, ДополнительныйОтбор.ЗначениеОтбора);
	КонецЦикла;
	
	ОписаниеЗапроса.ОбщиеИтоги = Истина;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	Результат = РезультатЗапросаПоТаблице(Запрос, ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов, ДанныеСтатистики.ДанныеГруппировок);
	
	Возврат Результат;
	
КонецФункции

// Данные, которые задают правила сбора стандартных показателей из таблицы.
// 
// Возвращаемое значение:
//  Структура - Данные сбора статистики:
//		* ДанныеОбъекта 		- Структура:
//			** Объект 					- ОбъектМетаданных
//			** ПредставлениеОбъектов 	- Строка - Представление объекта в статистике
//		* ДанныеПериодаОтбора 	- Структура:
//			** Период 					- ОбъектМетаданных
//			** НачалоПериода 			- Дата
//		* ПроверкиОбъекта 		- Структура - Включение проверок объекта:
//			** Проведение 				- Булево
//			** ПометкаУдаления 			- Булево
//			** ВАрхиве 					- Булево
//		* ДанныеГруппировок 	- Массив
//		* ДополнительныеОтборы 	- Массив
Функция ДанныеСбораСтатистики() Экспорт
	
	ДанныеСтатистики = Новый Структура();
	ДанныеСтатистики.Вставить("ДанныеОбъекта", ДанныеОбъекта());
	ДанныеСтатистики.Вставить("ДанныеПериода", ДанныеПериода());
	ДанныеСтатистики.Вставить("ПроверкиОбъекта", ПроверкиОбъекта());
	ДанныеСтатистики.Вставить("ДанныеГруппировок", Новый Массив);
	ДанныеСтатистики.Вставить("ДополнительныеОтборы", Новый Массив);
	
	Возврат ДанныеСтатистики;
	
КонецФункции

// Данные группировки.
// 
// Возвращаемое значение:
//  Структура - Данные группировки:
//	* Группировка - ОбъектМетаданных
//	* ПредставлениеГруппировки - Строка - Представление группировки в статистике
//	* ПредставлениеОднойГруппы - Строка - Представление одной группы группировки в статистике
//	* Перечисление - Булево - Группировка является перечислением
//	* Предопределенные - Булево - Группировка имеет предопределенные объекты
Функция ДанныеГруппировки() Экспорт
	
	ДанныеГруппировки = Новый Структура();
	ДанныеГруппировки.Вставить("Группировка");
	ДанныеГруппировки.Вставить("ПредставлениеГруппировки");
	ДанныеГруппировки.Вставить("ПредставлениеОднойГруппы");
	ДанныеГруппировки.Вставить("Перечисление", Ложь);
	ДанныеГруппировки.Вставить("Предопределенные", Ложь);
	
	Возврат ДанныеГруппировки;
	
КонецФункции

// Дополнительный отбор.
// 
// Возвращаемое значение:
//  Структура - Дополнительный отбор:
//	* ИмяОтбора - Строка
//	* ЗначениеОтбора - Произвольный
//	* ВидСравнения - Строка
Функция ДополнительныйОтбор() Экспорт
	
	ДанныеОтбора = Новый Структура(
		"ИмяОтбора,
		|ЗначениеОтбора,
		|ВидСравнения");
	
	Возврат ДанныеОтбора;
	
КонецФункции

// Возвращает виды статистики.
// Накопительная - статистика по объекту за все время.
// Периодическая - статистика по объекту за определенный период.
// 
// Возвращаемое значение:
//  Структура - структура видов статистики.
//
Функция ВидыСтатистики() Экспорт
	
	ВидыСтатистики = Новый Структура();
	ВидыСтатистики.Вставить("Накопительная", "Накопительная");
	ВидыСтатистики.Вставить("Периодическая", "Периодическая");
	
	Возврат ВидыСтатистики;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// АПК:1297-выкл Статистика, не локализуется

Функция РезультатЗапросаПоЖурналу(Запрос)
	
	СтатистикаДокументов = Новый Соответствие;
	ВыборкаДокумента = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумента.Следующий() Цикл
		
		ПоказателиСтатистики = Новый Соответствие;
		ПоказателиСтатистики.Вставить("Документов", ВыборкаДокумента.Документов);
		ПоказателиСтатистики.Вставить("Ответственных", ВыборкаДокумента.Ответственных);
		
		ВСреднемНаОтветственного = ОбъектовВСреднем(ВыборкаДокумента.Документов, ВыборкаДокумента.Ответственных);
		Если ВСреднемНаОтветственного <> Неопределено Тогда
			ПоказателиСтатистики.Вставить("Документов в среднем(Ответственный)", ВСреднемНаОтветственного);
		КонецЕсли;
		
		ДокументовОтветственного = Новый Массив;
		ВыборкаОтветственного = ВыборкаДокумента.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОтветственного.Следующий() Цикл
			ДокументовОтветственного.Добавить(ВыборкаОтветственного.Документов);
		КонецЦикла;
		
		Дисперсия = Дисперсия(ВыборкаДокумента.Ответственных, ДокументовОтветственного, ВСреднемНаОтветственного);
		Если Дисперсия <> Неопределено Тогда
			ПоказателиСтатистики.Вставить("Дисперсия документов(Ответственный)", Дисперсия);
		КонецЕсли;
		
		СтатистикаДокументов.Вставить(Метаданные.НайтиПоТипу(ВыборкаДокумента.Тип).Синоним, ПоказателиСтатистики);
		
	КонецЦикла;
	
	Возврат СтатистикаДокументов;
	
КонецФункции

Функция РезультатЗапросаПоТаблице(Запрос, ПредставлениеОбъектов, ДанныеГруппировок)
	
	ПоказателиСтатистики = Новый Соответствие;
	ВыборкаВсего = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВсего.Следующий() Цикл
		ПоказателиСтатистики.Вставить(ПредставлениеОбъектов, ВыборкаВсего.Объектов);
		Для Каждого ДанныеГруппировки Из ДанныеГруппировок Цикл
			
			Если ДанныеГруппировки.ПредставлениеОднойГруппы <> Неопределено Тогда
				ПредставлениеОднойГруппы = ДанныеГруппировки.ПредставлениеОднойГруппы;
			Иначе
				ПредставлениеОднойГруппы = ДанныеГруппировки.Группировка.Синоним;
			КонецЕсли;
			
			Объектов = Новый Массив;
			Групп = 0;
			ВыборкаГруппировки = ВыборкаВсего.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, ДанныеГруппировки.Группировка.Имя);
			Пока ВыборкаГруппировки.Следующий() Цикл
				Объектов.Добавить(ВыборкаГруппировки.Объектов);
				Групп = Групп + 1;
				Если ДанныеГруппировки.Перечисление Тогда
					ПредставлениеПеречисления = Строка(ВыборкаГруппировки[ДанныеГруппировки.Группировка.Имя]);
					Если Не ЗначениеЗаполнено(ПредставлениеПеречисления) Тогда
						ПредставлениеПеречисления = СтрШаблон("Пустых %1", НРег(ДанныеГруппировки.ПредставлениеГруппировки));
					КонецЕсли;
					ПоказателиСтатистики.Вставить(ПредставлениеПеречисления, ВыборкаГруппировки.Объектов);
				КонецЕсли;
				Если ДанныеГруппировки.Предопределенные Тогда
					ТипЗначения = ТипЗнч(ВыборкаГруппировки[ДанныеГруппировки.Группировка.Имя]);
					ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
					Если ОбъектМетаданных <> Неопределено
						И ВыборкаГруппировки[ДанныеГруппировки.Группировка.Имя].Предопределенный Тогда
						ПоказателиСтатистики.Вставить(
							ВыборкаГруппировки[ДанныеГруппировки.Группировка.Имя].ИмяПредопределенныхДанных,
							ВыборкаГруппировки.Объектов);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ПоказателиСтатистики.Вставить(ДанныеГруппировки.ПредставлениеГруппировки, Групп);
			
			ВСреднем = ОбъектовВСреднем(ВыборкаВсего.Объектов, Групп);
			Если ВСреднем <> Неопределено Тогда
				ПоказателиСтатистики.Вставить(СтрШаблон("%1 в среднем(%2)", ПредставлениеОбъектов, ПредставлениеОднойГруппы), ВСреднем);
			КонецЕсли;
			
			Дисперсия = Дисперсия(Групп, Объектов, ВСреднем);
			Если Дисперсия <> Неопределено Тогда
				ПоказателиСтатистики.Вставить(СтрШаблон("Дисперсия %1(%2)", НРег(ПредставлениеОбъектов), ПредставлениеОднойГруппы), Дисперсия);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

Функция ДанныеОбъекта()
	
	ДанныеОбъекта = Новый Структура(
		"Объект,
		|ПредставлениеОбъектов");
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Функция ДанныеПериода()
	
	ДанныеПериода = Новый Структура(
		"Период,
		|НачалоПериода");
	
	Возврат ДанныеПериода;
	
КонецФункции

Функция ПроверкиОбъекта()
	
	ПроверкиОбъекта = Новый Структура();
	ПроверкиОбъекта.Вставить("Проведение", Ложь);
	ПроверкиОбъекта.Вставить("ПометкаУдаления", Ложь);
	ПроверкиОбъекта.Вставить("ВАрхиве", Ложь);
	
	Возврат ПроверкиОбъекта;
	
КонецФункции

#КонецОбласти