
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПользователейПараметр = Неопределено;
	Параметры.Свойство("СписокПользователей", СписокПользователейПараметр);
	Параметры.Свойство("Организация", Организация); 
	
	Если ЗначениеЗаполнено(СписокПользователейПараметр) Тогда
		СписокПользователей.ЗагрузитьЗначения(СписокПользователейПараметр);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СформироватьЛистОзнакомления(Команда)
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	
	УведомленияОбИспользованииПЭП = ШаблонУведомленияОбИспользованииПЭП(Организация,
		СписокПользователей.ВыгрузитьЗначения());
	
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("УведомленияОбИспользованииПЭП");
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, "УведомленияОбИспользованииПЭП"); 
	ОписаниеПечатнойФормы.ТабличныйДокумент = УведомленияОбИспользованииПЭП;
	
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблонУведомленияОбИспользованииПЭП(Организация, СписокПользователей)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	Макет = МодульУправлениеПечатью.МакетПечатнойФормы(
		СтрШаблон("Обработка.ПодготовкаДокументовПОД.ПФ_MXL_ШаблонУведомленияОбИспользованииПЭП_%1", 
			ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ДанныеОрганизации = Новый Структура;
	ПроцессыОбработкиДокументовПереопределяемый.ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации);
	
	ДанныеОрганизацииПараметры = ЗначенияПараметровШаблонаПоложенияОбИспользованииПЭП(ДанныеОрганизации);
	
	Попытка
		Область = Макет.ПолучитьОбласть("Уведомление");
		
		ДатаВступленияВСилу = Формат(ТекущаяДатаСеанса(), "ДЛФ=D");
		
		Для Каждого Пользователь Из СписокПользователей Цикл
			
			Если Не ЗначениеЗаполнено(Пользователь) Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеСотрудника = Новый Структура("ПолноеИмя, ОрганизацииИДолжности", "", Новый Соответствие);
			ПроцессыОбработкиДокументовПереопределяемый.ЗаполнитьСведенияОПользователе(Пользователь, ДанныеСотрудника);
			
			ЗначенияПараметров = Новый Структура;
			ЗначенияПараметров.Вставить("ФИОСотрудника", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(
				ДанныеСотрудника.ПолноеИмя));
			ЗначенияПараметров.Вставить("НаименованиеОрганизации", ДанныеОрганизацииПараметры.НаименованиеОрганизации);
			ЗначенияПараметров.Вставить("ДатаВступленияВСилу", ДатаВступленияВСилу);
			
			ЗаполнитьЗначенияСвойств(Область.Параметры, ЗначенияПараметров);
			
			ТабличныйДокумент.Вывести(Область);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось заполнить значения параметров шаблона положения об использовании простой ЭП причине:'")
			+ Символы.ПС
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияПараметровШаблонаПоложенияОбИспользованииПЭП(ДанныеОрганизации)
	
	НаименованиеОрганизации = "";
	
	ЗначениеСвойства = Неопределено;
	Если ДанныеОрганизации.Свойство("Наименование", ЗначениеСвойства)
		И ЗначениеЗаполнено(ЗначениеСвойства) Тогда;
		НаименованиеОрганизации = ЗначениеСвойства;
	КонецЕсли;
	
	ЧастиИмени = Новый Структура;
	ЧастиИмени.Вставить("Фамилия",  ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Фамилия", ""));
	ЧастиИмени.Вставить("Имя",      ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Имя", ""));
	ЧастиИмени.Вставить("Отчество", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Отчество", ""));
	
	РуководительФИО = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ЧастиИмени);
	
	ТекущаяДата = Формат(ТекущаяДатаСеанса(), "ДФ='дд.ММ.гггг'");
	
	ЗначенияПараметров = Новый Структура;
	ЗначенияПараметров.Вставить("НаименованиеОрганизации", НаименованиеОрганизации); 
	ЗначенияПараметров.Вставить("РуководительДолжность",
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеОрганизации, "Должность", ""));
	ЗначенияПараметров.Вставить("РуководительФИО", РуководительФИО);
	ЗначенияПараметров.Вставить("ТекущаяДата", ТекущаяДата);
	ЗначенияПараметров.Вставить("НазваниеКонфигурации", Метаданные.Представление());
	
	Возврат ЗначенияПараметров;
	
КонецФункции

#КонецОбласти
