
#Область ПрограммныйИнтерфейс

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ДоступныеОрганизацииПользователя
//
Процедура ПриПолученииДоступныхОрганизацийПользователя(Организации) Экспорт
	
	ЗарплатаКадры.ПриПолученииДоступныхОрганизацийПользователя(Организации);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветДанныеОтчетности
//
Процедура ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор) Экспорт
	
	ЗарплатаКадры.ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветЗаписатьСтатусОтчета
//
Процедура ПриПодготовкеОтветаЗаписатьСтатусОтчета(Результат, ПараметрыЗапроса) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ОтветЗаписатьСтатусКомментарийОтчета
//
Процедура ПриПодготовкеОтветаЗаписатьКомментарийОтчета(Результат, ПараметрыЗапроса) Экспорт
КонецПроцедуры

// Подробнееt
// См. СообщенияОтчетностиОблачныхПриложений.ПравилаПредставленияОтчетовИсполнители
//
Процедура ПриЗаполненииПравилПредставленияОтчетовИсполнители(ИсполнителиПравил) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ПодключитьНовыеПриложения
//
Процедура ПриПодключенииНовыхПриложений(ОшибкиПодключения, Параметры) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.НовыйПараметрыЗапросаЗаписиСтатусаКомментарияОтчета
//
Процедура ПриЗаполненииПараметровЗапросаЗаписиСтатусаКомментария(Параметры) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ЗапроситьДанныеОтчетнойКампании
//
Процедура ПриЗапросеДанныхОтчетнойКампании(Запрос, ДанныеПриложения, Параметры) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.ПолучитьОтветыНаЗапросы
//
Процедура ПриПолученииОтветовНаЗапросы(Результат, Запросы) Экспорт
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложений.НовыйЗапросыОблачнымПриложениям
//
Процедура ПриЗаполненииНовогоЗапросаОблачнымПриложениям(Запрос) Экспорт
КонецПроцедуры

#КонецОбласти