
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИмяЗамены = Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Метаданные().Синоним;
	
	АдресРасшифровкиИсправлений = Параметры.АдресРасшифровкиИсправлений;
	Если ПустаяСтрока(АдресРасшифровкиИсправлений) Тогда
		ДанныеИсправлений = Новый Структура("АдресРасшифровкиИсправлений,КоличествоЗаявлений,Дата,Организации",
			ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор), 0, ТекущаяДатаСеанса(), Новый Массив);
		ПрямыеВыплатыПособийСоциальногоСтрахования.ОбновитьДанныеИсправленийОплатДляВозмещенияВыплатРодителямДетейИнвалидов(ДанныеИсправлений);
		АдресРасшифровкиИсправлений = ДанныеИсправлений.АдресРасшифровкиИсправлений
	КонецЕсли;
	ТаблицаПересчета = ПолучитьИзВременногоХранилища(АдресРасшифровкиИсправлений);
	Для Каждого СтрокаТаблицы Из ТаблицаПересчета Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаЗаявлений.Добавить(), СтрокаТаблицы);
		Если СписокЗаявлений.НайтиПоЗначению(СтрокаТаблицы.Заявление) = Неопределено Тогда
			СписокЗаявлений.Добавить(СтрокаТаблицы.Заявление,
				СтрЗаменить(Строка(СтрокаТаблицы.Заявление), ИмяЗамены, ""), Истина);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СписокЗаявлений.Видимость = СписокЗаявлений.Количество() > 1;
	
	Заголовок = ?(Элементы.СписокЗаявлений.Видимость,
		НСтр("ru = 'Заявления к исправлению'"), Строка(СписокЗаявлений[0].Значение));
	Отбор = Новый Структура("Заявление", СписокЗаявлений[0].Значение);
	Элементы.ТаблицаЗаявлений.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
#Область УсловноеОформлениеФормы
	ОформлениеКД = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект,
		"ТаблицаЗаявленийСуммаПособияДо, ТаблицаЗаявленийСуммаПособияПосле");
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(
		ОформлениеКД, "ТаблицаЗаявлений.СуммаПособияДо", "<>", "ТаблицаЗаявлений.СуммаПособияПосле");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ОформлениеКД, "ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	ОформлениеКД = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтотОбъект,
		"ТаблицаЗаявленийСуммаВзносовДо, ТаблицаЗаявленийСуммаВзносовПосле");
	ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(
		ОформлениеКД, "ТаблицаЗаявлений.СуммаВзносовДо", "<>", "ТаблицаЗаявлений.СуммаВзносовПосле");
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ОформлениеКД, "ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗаявлений

&НаКлиенте
Процедура СписокЗаявленийПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокЗаявлений.ТекущиеДанные <> Неопределено Тогда
		Отбор = Новый Структура("Заявление", Элементы.СписокЗаявлений.ТекущиеДанные.Значение);
		Элементы.ТаблицаЗаявлений.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаявленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяПоля = СтрЗаменить(Поле.Имя, "ТаблицаЗаявлений", "");
	Если СтрНайти("Сотрудник,ДокументОснование,Ребенок", ИмяПоля) > 0 Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные[ИмяПоля]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Поле.Имя = "СписокЗаявленийЗначение" Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные["Значение"]);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Исправить(Команда)
	Данные = ДанныеПоЗаявлениям(СписокЗаявлений.ВыгрузитьЗначения());
	МаксимумОткрытыхФорм = 5;
	Счет = 0;
	Для Каждого Заявление Из СписокЗаявлений Цикл
		Если Счет > МаксимумОткрытыхФорм Тогда
			Прервать;
		КонецЕсли;
		Если Заявление.Пометка Тогда
			РеквизитыЗаявления = Данные[Заявление.Значение];
			Если РеквизитыЗаявления.ОтправлятьЧерезСЭДО И ЗначениеЗаполнено(РеквизитыЗаявления.ДатаОтправки)
				Или Не РеквизитыЗаявления.ОтправлятьЧерезСЭДО
				И РеквизитыЗаявления.СтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыЗаявленийИРеестровНаВыплатуПособий.ПринятФСС") Тогда
				ПараметрыФормы = Новый Структура("ЗначениеКопирования", Заявление.Значение);
				УникальностьФормы = Истина;
			Иначе
				ПараметрыФормы = Новый Структура("Ключ", Заявление.Значение);
				УникальностьФормы = Ложь;
			КонецЕсли;
			ОткрытьФорму("Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ФормаОбъекта", ПараметрыФормы, , УникальностьФормы);
			Счет = Счет + 1;
		КонецЕсли;
	КонецЦикла;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеПоЗаявлениям(МассивЗаявлений)
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивЗаявлений,
		"ДатаОтправки,ОтправлятьЧерезСЭДО,СтатусДокумента");
КонецФункции

#КонецОбласти
