#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнениеОтветственныхВПубликацияхВакансий");
	Методы.Вставить("СоздатьКандидатовПоДаннымОткликов");
	Методы.Вставить("КонтактыРекрутинговыхСайтовЗаполнитьВидРедактированияПоУмолчанию");
	Методы.Вставить("ВыполнитьПоискКандидатов", Истина);
	Методы.Вставить("ДанныеКандидатаССайта", Истина); 
	Методы.Вставить("ДоступныеДляПолученияКонтакты", Истина);
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Обработка.НастройкаДоступаКРекрутинговымСайтам";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПроверкиПодключения";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияФункции, ИмяПроцедуры, Сайты)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "Обработка.НастройкаДоступаКРекрутинговымСайтам";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияПодключения";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполненияФункции, ИмяПроцедуры, ПараметрыПодключения)";
	
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.РекрутинговыеСайтыВызовСервера";
	ИсключениеПроверки.ИмяПроцедуры       = "ДлительнаяОперацияЗагрузкиКлассификаторов";
	ИсключениеПроверки.ФрагментСодержания = "Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, Сайты)";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеИнтеграцииРекрутинговыхСайтов", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов");	
	
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.17.1";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("5460f494-0d67-11eb-a3ee-4cedfb950b0c");
	Обработчик.Процедура = "РекрутинговыеСайты.НачальноеЗаполнениеОтветственныхВПубликацияхВакансий";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Комментарий = НСтр("ru = 'Первоначальное заполнение ответственных за публикацию вакансий'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.27.6";
	Обработчик.Процедура = "РекрутинговыеСайты.СоздатьКандидатовПоДаннымОткликов";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("11b9294e-95bb-5438-a039-92ba90abd780");
	Обработчик.Комментарий = НСтр("ru = 'Перенос откликов из регистра в справочник'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.25";
	Обработчик.Процедура = "РегистрыСведений.ПубликацияВакансий.ПеренестиИдентификаторыПубликаций";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8137efbe-99f0-403c-9772-ff8bbf120bc7");
	Обработчик.Комментарий = НСтр("ru = 'Перенос идентификаторов публикаций из ресурса в измерение'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.37.30";
	Обработчик.Процедура = "РекрутинговыеСайты.КонтактыРекрутинговыхСайтовЗаполнитьВидРедактированияПоУмолчанию";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("c117c349-0d78-44ee-b5f7-1e1e3b79349f");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение обязательного реквизита видов контактной информации'");

КонецПроцедуры

Процедура ОчиститьНастройкиИнтеграцииРекрутинговыхСайтов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов");
		Блокировка.Заблокировать();
		
		Набор = РегистрыСведений.НастройкиИнтеграцииРекрутинговыхСайтов.СоздатьНаборЗаписей();
		Набор.Прочитать();
		
		Для Каждого Запись Из Набор Цикл
			Запись.Использовать = Ложь;
		КонецЦикла;
		
		Набор.Записать();
	Исключение
		ОтменитьТранзакцию();
		
		Описание = НСтр("ru = 'Не удалоось очистить настройки интеграции с рекрутинговыми сайтами.'");
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Очистка настроек интеграции с рекрутинговыми сайтами'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			Описание + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура НачальноеЗаполнениеОтветственныхВПубликацияхВакансий(ПараметрыОбновления = Неопределено) Экспорт
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	ЗаполненыОтветственныеВПубликацияхВакансий();
	
КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	Разрешения = Новый Массив;
	Для Каждого ОписаниеСайта Из АдресаРекрутинговыхСайтов() Цикл
		Разрешения.Добавить(
			РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса("HTTPS", ОписаниеСайта.Адрес, , 
				СтрШаблон(НСтр("ru = 'Веб-сервис доступа к вакансиям и кандидатам ""%1.""'"), ОписаниеСайта.Наименование)));
	КонецЦикла;
	ЗапросыРазрешений.Добавить(РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(Разрешения));
	
КонецПроцедуры

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ПолучениеОткликовСРекрутинговыхСайтов;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьИнтеграциюРекрутинговыхСайтов;
	Настройка.РаботаетСВнешнимиРесурсами = Истина;

	ЗагрузкаКандидатовИзИнтернета.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);

КонецПроцедуры

// Процедура регламентного задания ПолучениеОткликовСРекрутинговыхСайтов.
//
Процедура ПолучениеОткликовСРекрутинговыхСайтов() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ПолучениеОткликовСРекрутинговыхСайтов);
	ПолучитьВсеОтклики();
	
КонецПроцедуры

#Область ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ПолучениеОткликовСРекрутинговыхСайтов.Имя);
	ЗагрузкаКандидатовИзИнтернета.ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны);
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ПолучениеОткликовСРекрутинговыхСайтов.ИмяМетода);
	ЗагрузкаКандидатовИзИнтернета.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
КонецПроцедуры

#КонецОбласти

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ИспользуетсяИнтеграцияРекрутинговыхСайтов() Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(РекрутинговыеСайты);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат; // Модель сервиса.
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Вакансии) Тогда
		Возврат; // Нет прав.
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта("Справочник.Вакансии");
	Если Разделы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтборОткликов = Новый ОтборКомпоновкиДанных();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборОткликов, "Ответственный", Пользователи.АвторизованныйПользователь());
	ОткликиКандидатов = ПодборПерсонала.ОткликиКандидатов(ОтборОткликов.Элементы);
	
	КоличествоОткликов = ОткликиКандидатов.Количество();
	Если КоличествоОткликов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Раздел Из Разделы Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор	= "НеРассмотренныеОтклики";
		Дело.ЕстьДела		= Истина;
		Дело.Важное			= Истина;
		Дело.Владелец		= Раздел;
		Дело.Представление	= НСтр("ru = 'Есть не рассмотренные отклики'");
		Дело.Количество		= КоличествоОткликов;
		Дело.Форма			= "Справочник.Вакансии.Форма.ФормаСписка";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Возвращаемое значение:
//  Булево
Функция ИспользуетсяИнтеграцияРекрутинговыхСайтов() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюРекрутинговыхСайтов");
	
КонецФункции

// Возвращаемое значение:
//  Булево
Функция ДоступнаИнтеграцияРекрутинговыхСайтов() Экспорт
	
	Возврат ИспользуетсяИнтеграцияРекрутинговыхСайтов()
		И ПравоДоступа("Использование", Метаданные.Обработки.ПубликацияВакансийНаРекрутинговыхСайтах);
	
КонецФункции

Функция ИспользуемыеСайты() Экспорт

	Возврат Новый ФиксированныйМассив(РекрутинговыеСайтыВнутренний.ИспользуемыеСайты());

КонецФункции

Функция НастроенныеСайты(Пользователь = Неопределено) Экспорт

	НастроенныеСайты = Новый Массив();
	
	Если Не ИспользуетсяИнтеграцияРекрутинговыхСайтов() Тогда
		Возврат Новый ФиксированныйМассив(НастроенныеСайты);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.РекрутинговыйСайт КАК Сайт
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов КАК НастройкиИнтеграцииРекрутинговыхСайтов
	|ГДЕ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Пользователь = &Пользователь
	|	И НастройкиИнтеграцииРекрутинговыхСайтов.Использовать";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастроенныеСайты.Добавить(Выборка.Сайт);
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(НастроенныеСайты);

КонецФункции

Функция ПодключенныеСайты() Экспорт
	
	Результат = Новый Массив();
	
	Для Каждого КлючИЗначение Из ПроверитьПодключение(Неопределено, Ложь) Цикл
		Если КлючИЗначение.Значение.Подключен Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

Функция ДанныеСайтов(Сайты = Неопределено) Экспорт

	Возврат РекрутинговыеСайтыСлужебный.ДанныеСайтов(Сайты);

КонецФункции

// См. Обработки.МенеджерИнтеграцииСРекрутинговымиСайтами.НовыйМенеджер
Функция МенеджерРекрутинговыхСайтов(Сайты = Неопределено, Пользователь = Неопределено, ТолькоНастроенные = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.МенеджерРекрутинговыхСайтов(Сайты, Пользователь, ТолькоНастроенные);
	
КонецФункции

#Область Интерфейс

Функция ПроверитьПодключение(Сайты = Неопределено, Показыватьпредупреждение = Истина) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайты, Пользователи.ТекущийПользователь(), Ложь);
	
	Возврат Менеджер.ПроверитьПодключение(Показыватьпредупреждение);
	
КонецФункции

Функция Подключить(ПараметрыПодключения) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(
		ПараметрыПодключения.Сайт, Пользователи.ТекущийПользователь(), Ложь);
	
	Возврат Менеджер.Подключить(ПараметрыПодключения);
	
КонецФункции

Функция ЗагрузитьКлассификаторы(Сайты) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайты);
	
	Возврат Менеджер.ЗагрузитьКлассификаторы();
	
КонецФункции

// См. РекрутинговыеСайтыСлужебный.СохранитьКлассификаторы
Процедура СохранитьКлассификаторы(Классификаторы, ДанныеСайтов) Экспорт
	
	РекрутинговыеСайтыСлужебный.СохранитьКлассификаторы(Классификаторы, ДанныеСайтов);
	
КонецПроцедуры

Функция НайтиКандидатов(ПараметрыПроцедуры, УникальныйИдентификатор, АдресХранилища) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Поиск кандидатов'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
		"РекрутинговыеСайты.ВыполнитьПоискКандидатов",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	АдресХранилища = Результат.АдресРезультата;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьПоискКандидатов(Параметры) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Параметры.Сайты);
	
	Возврат Менеджер.НайтиКандидатов(Параметры);
	
КонецФункции

// Параметры:
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
//  Пользователь - Неопределено, СправочникСсылка.Пользователи -
//  БылиОшибки - Булево
// 
// Возвращаемое значение:
//  Неопределено, Массив Из СправочникСсылка.Вакансии -
Функция ВакансииССайта(Сайт, Пользователь = Неопределено, БылиОшибки = Ложь) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт, Пользователь);
	
	Возврат Менеджер.ВакансииССайта(Сайт, БылиОшибки);
	
КонецФункции

Функция ОпубликоватьВакансию(Вакансия, Сайт, Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	ДанныеСайта = Менеджер.ДанныеСайтов[Сайт];
	
	Если ДанныеСайта.ДоступнаМножественнаяПубликацияВакансии Тогда
		РегионыПубликации = РегионыДереваПубликацииВакансии(Дерево, ДанныеСайта);
		
		Для Каждого РегионПубликации Из РегионыПубликации Цикл
			ДанныеРегиона = Новый СписокЗначений();
			
			Для Каждого СтрокаДерева Из Дерево.Строки[0].Строки Цикл
				Если СтрокаДерева.Путь = ДанныеСайта.ИмяПоляИдентификатораРегионаВакансии Тогда
					ДанныеРегиона.Добавить(РегионПубликации.Значение, РегионПубликации.Представление);
					СтрокаДерева.ПубликацияВакансии = ДанныеРегиона;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Результат = ВыполнитьПубликациюВакансии(Менеджер, Вакансия, Сайт, Дерево, ДанныеРегиона);
			
			Если Не Результат.Успешно Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Результат = ВыполнитьПубликациюВакансии(Менеджер, Вакансия, Сайт, Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПрименитьТарифКВакансии(Сайт, Идентификатор, Тариф) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Результат = Менеджер.ПрименитьТарифКВакансии(Сайт, Идентификатор, Тариф);
	
	Возврат Результат;
	
КонецФункции

Функция ПовторноОпубликоватьВакансию(Вакансия, Сайт, Дерево, ИдентификаторВакансии) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	ДанныеСайта = Менеджер.ДанныеСайтов[Сайт];
	
	Результат = Менеджер.ПовторноОпубликоватьВакансию(Сайт, Дерево, Вакансия, ИдентификаторВакансии);
	
	Если Результат.Успешно Тогда
		ИдентификаторВакансии = Формат(ИдентификаторВакансии, "ЧГ=0");
		АдресПубликации = Менеджер.АдресВакансии(Сайт, ИдентификаторВакансии);
		
		ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
		ДанныеЗаписиПубликации.Вакансия = Вакансия;
		ДанныеЗаписиПубликации.Сайт = Сайт;
		ДанныеЗаписиПубликации.ИдентификаторВакансии = ИдентификаторВакансии;
		ДанныеЗаписиПубликации.Адрес = АдресПубликации;
		
		Если ДанныеСайта.ДоступнаМножественнаяПубликацияВакансии Тогда
			Для Каждого СтрокаДерева Из Дерево.Строки[0].Строки Цикл
				Если СтрокаДерева.Путь = ДанныеСайта.ИмяПоляИдентификатораРегионаВакансии Тогда
					ДанныеЗаписиПубликации.Регион = СтрокаДерева.ПубликацияВакансии[0].Представление;
					ДанныеЗаписиПубликации.ИдентификаторРегиона =
						СтрЗаменить(Строка(СтрокаДерева.ПубликацияВакансии[0].Значение), Символы.НПП, "");
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
		ЗаписьВРегистрДанныеПубликации(Вакансия, Сайт, Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьПубликациюВакансии(Вакансия, Сайт, Дерево) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Для Каждого Публикация Из ПубликацииВакансий(Вакансия, Сайт, Истина)[Вакансия] Цикл
		Результат = Менеджер.ОбновитьПубликациюВакансии(Сайт, Дерево, Публикация.Идентификатор);
		
		Если Результат.Успешно Тогда
			ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
			ДанныеЗаписиПубликации.Вакансия = Вакансия;
			ДанныеЗаписиПубликации.Сайт = Сайт;
			ДанныеЗаписиПубликации.ИдентификаторВакансии = Публикация.Идентификатор;
			
			ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
			ЗаписьВРегистрДанныеПубликации(Вакансия, Сайт, Дерево);
		Иначе
			Прервать
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СинхронизироватьСвойстваПубликацииВакансии(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	Успешно = Истина;
	
	ТекущиеСвойства = СвойстваПубликацииВакансии(Вакансия, Сайт, ИдентификаторВакансии);
	СвойстваНаСайте = СвойстваПубликацииВакансииНаСайте(Сайт, ИдентификаторВакансии);
	
	Если ЗначениеЗаполнено(СвойстваНаСайте) Тогда
		Если ТекущиеСвойства.Опубликована <> СвойстваНаСайте.Опубликована Тогда
			ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
			ДанныеЗаписиПубликации.Вакансия = Вакансия;
			ДанныеЗаписиПубликации.Сайт = Сайт;
			ДанныеЗаписиПубликации.ИдентификаторВакансии = ИдентификаторВакансии;
			ДанныеЗаписиПубликации.Адрес = ТекущиеСвойства.АдресПубликации;
			ДанныеЗаписиПубликации.Регион = ТекущиеСвойства.Регион;
			ДанныеЗаписиПубликации.ИдентификаторРегиона = ТекущиеСвойства.ИдентификаторРегиона;
			ДанныеЗаписиПубликации.СвойстваПубликации = СвойстваНаСайте;
			
			ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
		КонецЕсли;
	Иначе
		Успешно = Ложь;
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

Функция СвойстваПубликацииВакансии(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПубликацияВакансий.ДатаПубликации КАК ДатаПубликации,
	|	ПубликацияВакансий.ДатаОбновления КАК ДатаОбновления,
	|	ПубликацияВакансий.АдресПубликации КАК АдресПубликации,
	|	ПубликацияВакансий.Регион КАК Регион,
	|	ПубликацияВакансий.ИдентификаторРегиона КАК ИдентификаторРегиона,
	|	ПубликацияВакансий.ДатаСнятияСПубликации КАК ДатаСнятияСПубликации,
	|	ВЫБОР
	|		КОГДА ПубликацияВакансий.ДатаПубликации <> &ПустаяДата
	|		И ПубликацияВакансий.ДатаСнятияСПубликации = &ПустаяДата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Опубликована
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия = &Вакансия
	|	И ПубликацияВакансий.ИдентификаторВакансии = &ИдентификаторВакансии
	|	И ПубликацияВакансий.МестоПубликации = &Сайт";
	
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("Сайт", Сайт);
	Запрос.УстановитьПараметр("ИдентификаторВакансии", ИдентификаторВакансии);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СвойстваПубликации, Выборка);
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
//  ИдентификаторВакансии - Неопределено, Строка -
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция СнятьПубликациюВакансии(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	РезультатДействия = Менеджер.СнятьПубликациюВакансии(Сайт, ИдентификаторВакансии);
	
	Если РезультатДействия.Успешно Тогда
		ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт, ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат РезультатДействия;
	
КонецФункции

Процедура ПолучитьОтклики(Вакансия, Сайт, Пользователь = Неопределено) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт, Пользователь);
	
	Менеджер.ПолучитьОтклики(Сайт, Вакансия);

КонецПроцедуры

Функция ОтветственныйЗаПубликацию(Вакансия, Сайт) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПубликацияВакансий.Ответственный КАК Ответственный
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия = &Вакансия
	|	И ПубликацияВакансий.МестоПубликации = &МестоПубликации");
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	Запрос.УстановитьПараметр("МестоПубликации", Сайт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если ЗначениеЗаполнено(Выборка.Ответственный) Тогда
		Результат = Выборка.Ответственный;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПоляВакансии(Сайт, ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.ПоляВакансии(Сайт, ОбновлениеПубликации, ПовторнаяПубликация);
	
КонецФункции

Функция АдресВакансии(Сайт, ИдентификаторВакансии) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.АдресВакансии(Сайт, ИдентификаторВакансии);
	
КонецФункции

Функция СайтПоАдресуРезюме(АдресРезюме, Пользователь = Неопределено) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(, Пользователь, Ложь);
	
	Возврат Менеджер.СайтПоАдресуРезюме(АдресРезюме);
	
КонецФункции

Функция ДанныеКандидатаССайта(АдресРезюме, Пользователь = Неопределено) Экспорт
	
	ДанныеКандидата = Неопределено;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ИспользуемыеСайты = НастроенныеСайты(Пользователь);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ИспользуемыеСайты <> Неопределено И ИспользуемыеСайты.Количество() > 0,
		НСтр("ru = 'Не включено использование ни одного рекрутингового сайта.'"));
	
	Менеджер = МенеджерРекрутинговыхСайтов(, Пользователь, Ложь);
	
	ДанныеРезюмеПоАдресу = Менеджер.ДанныеРезюмеПоАдресу(АдресРезюме);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ИспользуемыеСайты.Найти(ДанныеРезюмеПоАдресу.Сайт) <> Неопределено,
		СтрШаблон(НСтр("ru = 'Адрес резюме с %1, но использование этого сайта не включено.
						|Проверьте подключение сайта в Персональных настройках.'"), ДанныеРезюмеПоАдресу.Сайт));
	
	Если ЗначениеЗаполнено(ДанныеРезюмеПоАдресу.ИдентификаторРезюме) Тогда
		Менеджер = МенеджерРекрутинговыхСайтов(ДанныеРезюмеПоАдресу.Сайт, Пользователь);
		ДанныеКандидата = Менеджер.ДанныеКандидатаССайта(ДанныеРезюмеПоАдресу.ИдентификаторРезюме);
	КонецЕсли;
	
	Возврат ДанныеКандидата;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  ПроверяемыеСайты - Неопределено, Массив Из СправочникСсылка.ИсточникиИнформацииОКандидатах -
//  ТолькоАктивные - Булево
// 
// Возвращаемое значение:
//  Массив Из СправочникСсылка.ИсточникиИнформацииОКандидатах
Функция СайтыСПубликациейВакансии(Вакансия, ПроверяемыеСайты = Неопределено, ТолькоАктивные = Ложь) Экспорт
	
	Результат = Новый Массив();
	
	СайтыСПубликациями = ПубликацииВакансий(Вакансия, ПроверяемыеСайты, ТолькоАктивные);
	
	Если СайтыСПубликациями.Количество() > 0 Тогда
		Для Каждого Публикация Из СайтыСПубликациями.Получить(Вакансия) Цикл
			Результат.Добавить(Публикация.Сайт);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПубликацииВакансий(Знач Вакансии, ПроверяемыеСайты = Неопределено, ТолькоАктивные = Ложь) Экспорт
	
	СайтыСПубликациямиВакансий = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(Вакансии) Тогда
		Возврат СайтыСПубликациямиВакансий;
	КонецЕсли;
	
	Если ТипЗнч(Вакансии) <> Тип("Массив") Тогда
		Вакансии = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вакансии);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПубликацияВакансий.Вакансия КАК Вакансия,
	|	ПубликацияВакансий.МестоПубликации КАК Сайт,
	|	ПубликацияВакансий.ИдентификаторВакансии КАК ИдентификаторВакансии
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|ГДЕ
	|	ПубликацияВакансий.Вакансия В(&Вакансия)
	|	И &УсловиеПоСайтам
	|	И &УсловиеПоПубликация
	|ИТОГИ ПО
	|	Вакансия";
	
	Если ЗначениеЗаполнено(ПроверяемыеСайты) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСайтам", "ПубликацияВакансий.МестоПубликации В (&Сайты)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоСайтам", "ИСТИНА");
	КонецЕсли;
	
	Если ТолькоАктивные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПубликация", "ПубликацияВакансий.ДатаСнятияСПубликации = ДАТАВРЕМЯ(1, 1, 1)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПубликация", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Вакансия", Вакансии);
	Запрос.УстановитьПараметр("Сайты", ПроверяемыеСайты);
	
	ВыборкаВакансий = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВакансий.Следующий() Цикл
		
		Публикации = Новый Массив();
		ВыборкаМестПубликации = ВыборкаВакансий.Выбрать();
		
		Пока ВыборкаМестПубликации.Следующий() Цикл
			Публикации.Добавить(Новый Структура("Сайт,Идентификатор",
				ВыборкаМестПубликации.Сайт, ВыборкаМестПубликации.ИдентификаторВакансии));
		КонецЦикла;
		
		СайтыСПубликациямиВакансий.Вставить(ВыборкаВакансий.Вакансия, Публикации);
		
	КонецЦикла;
	
	Возврат СайтыСПубликациямиВакансий;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
// 
// Возвращаемое значение:
//  Неопределено, Массив Из СправочникСсылка.ИсточникиИнформацииОКандидатах -
Функция СайтыСПубликациями(Вакансия) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ПубликацияВакансий.МестоПубликации КАК МестоПубликации
		|ИЗ
		|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
		|ГДЕ
		|	ПубликацияВакансий.Вакансия = &Вакансия");
	Запрос.УстановитьПараметр("Вакансия", Вакансия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("МестоПубликации");
	КонецЕсли;
	
КонецФункции

Процедура ДобавитьКомментарийПользователя(ДанныеКандидата, Пользователь, КомментарийПользователя, ДоступностьКомментария, 
	ДатаКомментария = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(КомментарийПользователя) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДатаКомментария = Неопределено Тогда
		ДатаКомментария = ТекущаяДатаСеанса();
	КонецЕсли;
	
	КомментарииТаблица = РекрутинговыеСайтыСлужебный.ТаблицаКомментарииКандидатов();
	
	НоваяСтрока = КомментарииТаблица.Добавить();
	НоваяСтрока.Период = ДатаКомментария;
	НоваяСтрока.Комментарий = КомментарийПользователя;
	НоваяСтрока.Пользователь = Пользователь;
	НоваяСтрока.ТолькоДляАвтора = ДоступностьКомментария = Перечисления.ДоступностьКомментарияКандидата.ТолькоДляАвтора;
	
	ДанныеКандидата.Комментарии.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НоваяСтрока));
	
КонецПроцедуры

Процедура ЗагрузитьКомментарииКандидата(Кандидат) Экспорт
	
	Если Не ИспользуетсяИнтеграцияРекрутинговыхСайтов() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиИнтеграцииРекрутинговыхСайтов) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРезюме = РекрутинговыеСайтыСлужебный.ДанныеРезюме(Кандидат);
	
	Если ДанныеРезюме.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Сайты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДанныеРезюме.ВыгрузитьКолонку("МестоПубликации"));
	
	Если ЗначениеЗаполнено(Сайты) Тогда
		Менеджер = МенеджерРекрутинговыхСайтов(Сайты);
		Менеджер.ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме);
	КонецЕсли;
	
КонецПроцедуры

Функция ДоступныеДляПолученияКонтакты(Сайт, АдресРезюме) Экспорт
	
	Результат = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	Если ДоступнаИнтеграцияРекрутинговыхСайтов() Тогда
		Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
		Результат = Менеджер.ДоступныеДляПолученияКонтакты(Сайт, АдресРезюме);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтактыРезюме(Сайт, АдресРезюме) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.КонтактыРезюме(Сайт, АдресРезюме);
	
КонецФункции

Функция ШаблоныСтраницСайтов(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Менеджер = МенеджерРекрутинговыхСайтов(, Пользователь);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Менеджер.ШаблоныСтраницСайтов();
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, Реквизит) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, Реквизит);
	
КонецФункции

Функция ВидыПолей(Сайт, ОбновлениеПубликации = Ложь) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.ВидыПолей(Сайт, ОбновлениеПубликации);
	
КонецФункции

Функция СписокЗначенийПоМассивуСтруктур(МассивСтруктур) Экспорт
	
	Список = Новый СписокЗначений;
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		Список.Добавить(ЭлементМассива.Значение, ЭлементМассива.Представление);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

Функция СписокВыбораПоКлассификатору(Сайт, Путь) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.СписокВыбораПоКлассификатору(Сайт, Путь);
	
КонецФункции

Процедура ЗаполнитьДеревоКлассификатора(Классификатор, Дерево, Сайты) Экспорт 
	
	Если Не ЗначениеЗаполнено(Классификатор) Тогда
		Возврат;
	КонецЕсли;
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайты);
	
	Менеджер.ЗаполнитьДеревоКлассификатора(Классификатор, Дерево);
	
КонецПроцедуры

Процедура ЗаписьВРегистрДанныеПубликацииВакансий(Вакансии, Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Дерево = Менеджер.ДеревоПубликацииВакансии(Сайт, Вакансии, Вакансия, ИдентификаторВакансии);
	
	Если Дерево <> Неопределено Тогда
		ЗаписьВРегистрДанныеПубликации(Вакансия, Сайт, Дерево);
	КонецЕсли;
	
КонецПроцедуры

// - См. РекрутинговыеСайтыСлужебный.ЗаписьВРегистрИнформацииОПубликации
Процедура ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации) Экспорт
	РекрутинговыеСайтыСлужебный.ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
КонецПроцедуры

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.ТекстВопросаПоКонтактногоДоступа
Функция ТекстВопросаПоКонтактногоДоступа(Сайт) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.ТекстВопросаПоКонтактногоДоступа(Сайт);
	
КонецФункции

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.БольшеНеЗадаватьВопросПоКонтактногоДоступа
Функция БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт);
	
КонецФункции

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа
Процедура СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Менеджер.СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт);
	
КонецПроцедуры

Функция ЭтоАдресРезюме(Адрес) Экспорт
	
	Менеджер = МенеджерРекрутинговыхСайтов();
	
	Возврат Менеджер.ЭтоАдресРезюме(Адрес);
	
КонецФункции

// Параметры:
//  РезультатВыбора - См. ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом
Процедура ОтправитьОбратнуюСвязьПоОтклику(РезультатВыбора) Экспорт
	
	// Отправим обратную связь
	ДанныеДляОтправки = РекрутинговыеСайтыСлужебный.ДанныеДляОтправкиОбратнойСвязи(РезультатВыбора);
	
	Менеджер = МенеджерРекрутинговыхСайтов(ДанныеДляОтправки.Сайт);
	
	Если Не Менеджер.ОтправитьОбратнуюСвязьПоОтклику(ДанныеДляОтправки) Тогда
		ВызватьИсключение(НСтр("ru = 'Не удалось отправить обратную связь по отклику. Подробности в журнале регистрации.'"));
	КонецЕсли;
	
	// Сохраним сообщение
	Взаимодействие = Документы.ЗапланированноеВзаимодействие.СоздатьДокумент();
	Взаимодействие.Дата = ТекущаяДатаСеанса();
	Взаимодействие.Автор = Пользователи.ТекущийПользователь();
	Взаимодействие.Ответственный = Взаимодействие.Автор;
	Взаимодействие.Описание = ДанныеДляОтправки.Сообщение;
	Взаимодействие.Тема = НСтр("ru = 'Обратная связь по отклику'");
	
	Взаимодействие.Записать();
	
	Взаимодействия.УстановитьПредмет(Взаимодействие.Ссылка, ДанныеДляОтправки.Кандидат);
	
КонецПроцедуры

#КонецОбласти

Функция СтруктураОтбораКандидатов() Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураОтбораКандидатов();
	
КонецФункции

Функция ОпубликованныеВакансииСИдентификаторами(Сайт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МестоПубликации", Сайт);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПубликацияВакансий.Вакансия КАК Вакансия,
	|	ПубликацияВакансий.ИдентификаторВакансии КАК ИдентификаторВакансии,
	|	Вакансии.Наименование КАК Наименование,
	|	Вакансии.Позиция КАК Позиция,
	|	Вакансии.Должность КАК Должность,
	|	Вакансии.Подразделение КАК Подразделение,
	|	Вакансии.ПрофильДолжности КАК ПрофильДолжности,
	|	Вакансии.ПредполагаемыйДоход КАК ПредполагаемыйДоход,
	|	Вакансии.Ответственный КАК Ответственный,
	|	Вакансии.Заявитель КАК Заявитель,
	|	Вакансии.ДатаОткрытия КАК ДатаОткрытия,
	|	Вакансии.ПланируемаяДатаЗакрытия КАК ПланируемаяДатаЗакрытия,
	|	ТекущиеСостоянияВакансий.Состояние КАК Состояние,
	|	ТекущиеСостоянияВакансий.Период КАК ДатаСостояния,
	|	Вакансии.Основание КАК Основание,
	|	Вакансии.Примечание КАК Примечание,
	|	Вакансии.СоответствуетПрофилюДолжности КАК СоответствуетПрофилюДолжности,
	|	Вакансии.Требования КАК Требования,
	|	Вакансии.Обязанности КАК Обязанности,
	|	Вакансии.Условия КАК Условия,
	|	Вакансии.Сложность КАК Сложность,
	|	Вакансии.Приоритет КАК Приоритет,
	|	Вакансии.ПричинаОткрытия КАК ПричинаОткрытия,
	|	Вакансии.СпособНабора КАК СпособНабора,
	|	Вакансии.НоваяПозиция КАК НоваяПозиция,
	|	Вакансии.УточнениеНаименования КАК УточнениеНаименования
	|ИЗ
	|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии КАК Вакансии
	|		ПО ПубликацияВакансий.Вакансия = Вакансии.Ссылка
	|			И (ПубликацияВакансий.МестоПубликации = &МестоПубликации)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияВакансий.СрезПоследних КАК ТекущиеСостоянияВакансий
	|		ПО (ТекущиеСостоянияВакансий.Вакансия = Вакансии.Ссылка)";
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает данные в РС ДанныеПубликацииРезюме.
// 
// Параметры:
//  МестоПубликации - СправочникСсылка.ИсточникиИнформацииОКандидатах.
//  ДанныеПубликацииРезюмеНаборЗаписей - РегистрСведенийНаборЗаписей.ДанныеПубликацииРезюме - Набор записей регистра.
//  СтруктураРезюме - Структура - Структура резюме, полученная с сайта. Состав структуры отличается в зависимости от источника.
//  Кандидат - СправочникСсылка.Кандидаты - Кандидат, чье резюме сохраняется в регистре.
//
Процедура ЗаполнитьДанныеПубликацииРезюмеНаборЗаписей(МестоПубликации, ДанныеПубликацииРезюмеНаборЗаписей, СтруктураРезюме, Кандидат) Экспорт
	
	ДанныеПубликацииРезюмеНаборЗаписей.Очистить();
	
	Для Каждого КлючИЗначение Из СтруктураРезюме Цикл
		Если КлючИЗначение.Значение = Неопределено 
			Или ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") 
			Или ТипЗнч(КлючИЗначение.Значение) = Тип("Картинка") Тогда
			Продолжить;
		Иначе
			НоваяЗапись = ДанныеПубликацииРезюмеНаборЗаписей.Добавить();
			НоваяЗапись.Кандидат = Кандидат;
			НоваяЗапись.МестоПубликации = МестоПубликации;
			НоваяЗапись.ПолеДанных = КлючИЗначение.Ключ;
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(КлючИЗначение.Значение)) Тогда
				НоваяЗапись.Значение = Строка(КлючИЗначение.Значение);
			Иначе
				НоваяЗапись.Значение = РекрутинговыеСайтыСлужебный.ЗаписьJSON(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписьВРегистрДанныеПубликации(Вакансия, Сайт, Дерево) Экспорт
	
	ПоляСТекстом = ПоляСТекстом(Сайт);
	ЕстьКолонкаСТекстом = Дерево.Колонки.Найти("ПубликацияВакансииТекст") <> Неопределено;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ДанныеПубликацииВакансий");
		ЭлементБлокировки.УстановитьЗначение("Вакансия", Вакансия);
		ЭлементБлокировки.УстановитьЗначение("МестоПубликации", Сайт);
		Блокировка.Заблокировать();
		
		ДанныеПубликацииВакансийНаборЗаписей = РегистрыСведений.ДанныеПубликацииВакансий.СоздатьНаборЗаписей();
		ДанныеПубликацииВакансийНаборЗаписей.Отбор.Вакансия.Установить(Вакансия);
		ДанныеПубликацииВакансийНаборЗаписей.Отбор.МестоПубликации.Установить(Сайт);
		
		Для Каждого СтрокаВакансии Из Дерево.Строки Цикл
			Если СтрокаВакансии.Показатель <> Вакансия Тогда 
				Продолжить;
			КонецЕсли;
			
			Для Каждого Поле Из СтрокаВакансии.Строки Цикл
				Если ЗначениеЗаполнено(Поле.ПубликацияВакансии) Тогда
					НоваяЗапись = ДанныеПубликацииВакансийНаборЗаписей.Добавить();
					НоваяЗапись.Вакансия = Вакансия;
					НоваяЗапись.МестоПубликации = Сайт;
					НоваяЗапись.ПолеДанных = Поле.Путь;
					
					Если ТипЗнч(Поле.ПубликацияВакансии) = Тип("СписокЗначений") Тогда
						ПолеJSON = ПредставлениеСпискаВВидеМассиваСтруктур(Поле.ПубликацияВакансии);
					Иначе
						ПолеJSON = ?(ЕстьКолонкаСТекстом И ПоляСТекстом.Найти(Поле.Путь) <> Неопределено,
							Поле.ПубликацияВакансииТекст,
							Поле.ПубликацияВакансии);
					КонецЕсли;
					
					НоваяЗапись.Значение = РекрутинговыеСайтыСлужебный.ЗаписьJSON(ПолеJSON);
				КонецЕсли;
				
				Для Каждого ПодчиненноеПоле Из Поле.Строки Цикл
					Если ЗначениеЗаполнено(ПодчиненноеПоле.ПубликацияВакансии) Тогда
						НоваяЗапись = ДанныеПубликацииВакансийНаборЗаписей.Добавить();
						НоваяЗапись.Вакансия = Вакансия;
						НоваяЗапись.МестоПубликации = Сайт;
						НоваяЗапись.ПолеДанных = ПодчиненноеПоле.Путь;
						
						Если ТипЗнч(ПодчиненноеПоле.ПубликацияВакансии) = Тип("СписокЗначений") Тогда
							ПолеJSON = ПредставлениеСпискаВВидеМассиваСтруктур(ПодчиненноеПоле.ПубликацияВакансии);
						Иначе
							ПолеJSON = ?(ЕстьКолонкаСТекстом И ПоляСТекстом.Найти(Поле.Путь) <> Неопределено,
								ПодчиненноеПоле.ПубликацияВакансииТекст,
								ПодчиненноеПоле.ПубликацияВакансии);
						КонецЕсли;
						
						НоваяЗапись.Значение = РекрутинговыеСайтыСлужебный.ЗаписьJSON(ПолеJSON);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ДанныеПубликацииВакансийНаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Описание = СтрШаблон(НСтр(
			"ru = 'Ошибка при записи данных публикации вакансии с сайта %1.
			|Не удалось заблокировать данные для изменения.'"), Сайт);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Запись данных публикации'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			Описание + Символы.ПС + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

Функция ЗагружаемыеРеквизитыВакансии() Экспорт
	
	Реквизиты = Новый Массив;
	
	Реквизиты.Добавить("Наименование");
	Реквизиты.Добавить("ПредполагаемыйДоход");
	Реквизиты.Добавить("ДатаОткрытия");
	Реквизиты.Добавить("ПланируемаяДатаЗакрытия");
	Реквизиты.Добавить("Условия");
	Реквизиты.Добавить("Требования");
	Реквизиты.Добавить("Обязанности");
	
	Возврат Реквизиты;
	
КонецФункции

Процедура СоздатьКандидатовПоДаннымОткликов(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	// Заполним идентификаторы резюме в откликах
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдалитьОткликиКандидатов.Вакансия КАК Вакансия,
		|	УдалитьОткликиКандидатов.НомерОтклика КАК НомерОтклика,
		|	УдалитьОткликиКандидатов.АдресРезюме КАК АдресРезюме
		|ИЗ
		|	РегистрСведений.УдалитьОткликиКандидатов КАК УдалитьОткликиКандидатов
		|ГДЕ
		|	(ВЫРАЗИТЬ(УдалитьОткликиКандидатов.ИдентификаторРезюме КАК СТРОКА(100))) = """"
		|	И (ВЫРАЗИТЬ(УдалитьОткликиКандидатов.АдресРезюме КАК СТРОКА(500))) <> """"
		|	И НЕ УдалитьОткликиКандидатов.Обработано";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Менеджер = МенеджерРекрутинговыхСайтов(, , Ложь);
	
	Пока Выборка.Следующий() Цикл
		ДанныеРезюмеПоАдресу = Менеджер.ДанныеРезюмеПоАдресу(Выборка.АдресРезюме);
		
		Запись = РегистрыСведений.УдалитьОткликиКандидатов.СоздатьМенеджерЗаписи();
		Запись.Вакансия = Выборка.Вакансия;
		Запись.НомерОтклика = Выборка.НомерОтклика;
		Запись.Прочитать();
		Запись.ИдентификаторРезюме = ДанныеРезюмеПоАдресу.ИдентификаторРезюме;
		Запись.Записать();
	КонецЦикла;
	
	// Получим таблицу с идентификаторами резюме
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Кандидаты.Вакансия КАК Вакансия,
	|	Кандидаты.Ссылка КАК Кандидат,
	|	Кандидаты.ИсточникИнформации КАК Источник,
	|	Кандидаты.АдресРезюме КАК АдресРезюме,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ИдентификаторРезюме
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|ГДЕ
	|	(ВЫРАЗИТЬ(Кандидаты.АдресРезюме КАК СТРОКА(100))) <> """"";
	
	РезюмеКандидатов = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаРезюме Из РезюмеКандидатов Цикл
		ДанныеРезюмеПоАдресу = Менеджер.ДанныеРезюмеПоАдресу(СтрокаРезюме.АдресРезюме);
		СтрокаРезюме.ИдентификаторРезюме = ДанныеРезюмеПоАдресу.ИдентификаторРезюме;
	КонецЦикла;
	
	// Запишем отклики
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РезюмеКандидатов.Вакансия КАК Вакансия,
		|	РезюмеКандидатов.Кандидат КАК Кандидат,
		|	РезюмеКандидатов.Источник КАК Источник,
		|	РезюмеКандидатов.АдресРезюме КАК АдресРезюме,
		|	РезюмеКандидатов.ИдентификаторРезюме КАК ИдентификаторРезюме
		|ПОМЕСТИТЬ ВТРезюме
		|ИЗ
		|	&РезюмеКандидатов КАК РезюмеКандидатов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1000
		|	УдалитьОткликиКандидатов.Вакансия КАК Вакансия,
		|	УдалитьОткликиКандидатов.НомерОтклика КАК НомерОтклика,
		|	УдалитьОткликиКандидатов.Фамилия КАК Фамилия,
		|	УдалитьОткликиКандидатов.Имя КАК Имя,
		|	УдалитьОткликиКандидатов.Отчество КАК Отчество,
		|	УдалитьОткликиКандидатов.ДатаРождения КАК ДатаРождения,
		|	УдалитьОткликиКандидатов.Адрес КАК Адрес,
		|	УдалитьОткликиКандидатов.Телефон КАК Телефон,
		|	УдалитьОткликиКандидатов.EMail КАК EMail,
		|	УдалитьОткликиКандидатов.Сообщение КАК Сообщение,
		|	УдалитьОткликиКандидатов.ФайлРезюме КАК ФайлРезюме,
		|	УдалитьОткликиКандидатов.Источник КАК Источник,
		|	УдалитьОткликиКандидатов.ДатаОтклика КАК ДатаОтклика,
		|	УдалитьОткликиКандидатов.ИдентификаторРезюме КАК ИдентификаторРезюме,
		|	УдалитьОткликиКандидатов.Рассмотрено КАК Рассмотрено,
		|	УдалитьОткликиКандидатов.АдресРезюме КАК АдресРезюме,
		|	ИСТИНА КАК ЭтоОбновление
		|ИЗ
		|	РегистрСведений.УдалитьОткликиКандидатов КАК УдалитьОткликиКандидатов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезюме КАК ВТРезюме
		|		ПО УдалитьОткликиКандидатов.Вакансия = ВТРезюме.Вакансия
		|			И УдалитьОткликиКандидатов.Источник = ВТРезюме.Источник
		|			И ((ВЫРАЗИТЬ(УдалитьОткликиКандидатов.ИдентификаторРезюме КАК СТРОКА(100))) <> """"
		|				И (ВЫРАЗИТЬ(УдалитьОткликиКандидатов.ИдентификаторРезюме КАК СТРОКА(100))) = (ВЫРАЗИТЬ(ВТРезюме.ИдентификаторРезюме КАК СТРОКА(100))))
		|ГДЕ
		|	НЕ УдалитьОткликиКандидатов.Обработано
		|	И ВТРезюме.Кандидат ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("РезюмеКандидатов", РезюмеКандидатов);
	
	ОписаниеДанных = Новый Массив;
	Описание = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(Метаданные.Справочники.Кандидаты);
	Описание.ПоляБлокировки.Очистить();
	ОписаниеДанных.Добавить(Описание);
	
	Если Не ОбновлениеИБ.НачатьОбновлениеДанных(ОписаниеДанных, ПараметрыОбновления) Тогда
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	Отклики = РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отклики.Добавить(), Выборка);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Отклики);
		
		Для каждого Отклик Из Отклики Цикл
			Запись = РегистрыСведений.УдалитьОткликиКандидатов.СоздатьМенеджерЗаписи();
			Запись.Вакансия = Отклик.Вакансия;
			Запись.НомерОтклика = Отклик.НомерОтклика;
			Запись.Прочитать();
			Запись.Обработано = Истина;
			Запись.Записать();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	
КонецПроцедуры

Процедура КонтактыРекрутинговыхСайтовЗаполнитьВидРедактированияПоУмолчанию(ПараметрыОбновления = Неопределено) Экспорт
	ОбновлениеИБ = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый;
	
	СуществующиеВиды = Новый Массив(); // Массив из СправочникСсылка.ВидыКонтактнойИнформации
	Для Каждого КлючИЗначение Из Перечисления.КонтактыРекрутинговыхСайтов.Идентификаторы() Цикл
		НайденныйВид =
			Справочники.ВидыКонтактнойИнформации.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючИЗначение.Значение));
			
		Если ОбщегоНазначения.СсылкаСуществует(НайденныйВид) Тогда
			СуществующиеВиды.Добавить(НайденныйВид);
		КонецЕсли;
	КонецЦикла;
	
	Если СуществующиеВиды.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИБ.ПродолжитьОбработчик(ПараметрыОбновления);
	
	Если Не ОбновлениеИБ.ПодготовитьОбновлениеДанных(
		ПараметрыОбновления, "Справочник.ВидыКонтактнойИнформации", "", "") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Вид Из СуществующиеВиды Цикл
		Объект = Вид.ПолучитьОбъект();
		
		Если Не ЗначениеЗаполнено(Объект.ВидРедактирования) Тогда
			Объект.ВидРедактирования = "ПолеВвода";
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИБ.ЗавершитьОбработчик(ПараметрыОбновления);
	ОбновлениеИБ.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
КонецПроцедуры

Функция ДоступнаОтправкаОбратнойСвязиПоОтклику(Кандидат) Экспорт
	
	Результат = Ложь;
	
	Если Не ИспользуетсяИнтеграцияРекрутинговыхСайтов() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиИнтеграцииРекрутинговыхСайтов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Сайт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ИсточникИнформации");
	
	Если НастроенныеСайты().Найти(Сайт) <> Неопределено Тогда
		Результат = РекрутинговыеСайтыСлужебный.ДанныеСайта(Сайт).ДоступнаОтправкаОбратнойСвязиПоОтклику;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РегионВакансииССайта(Вакансия, ДанныеСайта) Экспорт
	
	Результат = Новый СписокЗначений();
	
	ИдентификаторРегиона = Неопределено;
	Для Каждого ИмяПоля Из СтрРазделить(ДанныеСайта.ИмяПоляИдентификатораРегионаВакансии, ".") Цикл
		Если Не ЗначениеЗаполнено(ИдентификаторРегиона) Тогда
			ИдентификаторРегиона =
				РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(Вакансия, ИмяПоля);
		Иначе
			ИдентификаторРегиона =
				РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(ИдентификаторРегиона, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	Регион = Неопределено;
	Для Каждого ИмяПоля Из СтрРазделить(ДанныеСайта.ИмяПоляРегионаВакансии, ".") Цикл
		Если Не ЗначениеЗаполнено(Регион) Тогда
			Регион =
				РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(Вакансия, ИмяПоля);
		Иначе
			Регион =
				РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(Регион, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Добавить(ИдентификаторРегиона, Регион);
	
	Возврат Результат;
	
КонецФункции

Функция РегионыДереваПубликацииВакансии(Дерево, ДанныеСайта) Экспорт
	
	Результат = Новый СписокЗначений();
	
	Если ДанныеСайта.ДоступнаМножественнаяПубликацияВакансии Тогда
		Для Каждого СтрокаДерева Из Дерево.Строки[0].Строки Цикл
			Если СтрокаДерева.Путь = ДанныеСайта.ИмяПоляИдентификатораРегионаВакансии И
				ТипЗнч(СтрокаДерева.ПубликацияВакансии) = Тип("СписокЗначений") И
				СтрокаДерева.ПубликацияВакансии.Количество() > 0 Тогда
				
				Результат = СтрокаДерева.ПубликацияВакансии;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресаРекрутинговыхСайтов()
	
	АдресаСайтов = Новый Массив();
	
	РекрутинговыеСайтыВнутренний.ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов);
	
	Возврат АдресаСайтов;
	
КонецФункции

Функция ПоляСТекстом(Сайт)
	
	ПоляСТекстом = Новый Массив;
	ВидыПолей = ВидыПолей(Сайт);
	
	ПоляСМногострочнымВводом = ВидыПолей.СМногострочнымВводом;
	ПоляСТекстомВHTML = ВидыПолей.СТекстомВHTML;
	
	Если ЗначениеЗаполнено(ПоляСМногострочнымВводом) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСТекстом, ПоляСМногострочнымВводом);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоляСТекстомВHTML) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСТекстом, ПоляСТекстомВHTML);
	КонецЕсли;
	
	Возврат ПоляСТекстом;
	
КонецФункции

Функция ПредставлениеСпискаВВидеМассиваСтруктур(Список)
	
	МассивЗначений = Новый Массив;
	
	Для Каждого ЭлементСписка Из Список Цикл
		СтруктураЗначений = Новый Структура;
		СтруктураЗначений.Вставить("Значение", ЭлементСписка.Значение);
		СтруктураЗначений.Вставить("Представление", ЭлементСписка.Представление);
		
		МассивЗначений.Добавить(СтруктураЗначений);
	КонецЦикла;
	
	Возврат МассивЗначений;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
//  ИдентификаторВакансии - Строка
Процедура ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	СвойстваПубликации.ДатаСнятияСПубликации = ТекущаяДатаСеанса();
	
	ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
	ДанныеЗаписиПубликации.Вакансия = Вакансия;
	ДанныеЗаписиПубликации.Сайт = Сайт;
	ДанныеЗаписиПубликации.ИдентификаторВакансии = ИдентификаторВакансии;
	ДанныеЗаписиПубликации.СвойстваПубликации = СвойстваПубликации;
	
	ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
	
КонецПроцедуры

Функция ЗаполненыОтветственныеВПубликацияхВакансий()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Пользователь КАК Пользователь,
	|	НастройкиИнтеграцииРекрутинговыхСайтов.РекрутинговыйСайт КАК Сайт
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов КАК НастройкиИнтеграцииРекрутинговыхСайтов
	|ГДЕ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Использовать");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сайт", Новый ОписаниеТипов("СправочникСсылка.ИсточникиИнформацииОКандидатах"));
	Таблица.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	Таблица.Колонки.Добавить("ИдентификаторВакансии", Новый ОписаниеТипов("Строка"));
	
	ДанныеСайтов = ДанныеСайтов();
	
	БылиОшибки = Ложь;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Вакансии = ВакансииССайта(Выборка.Сайт, Выборка.Пользователь, БылиОшибки);
		Если Не ЗначениеЗаполнено(Вакансии) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСайта = ДанныеСайтов[Выборка.Сайт];
		
		Для Каждого Вакансия Из Вакансии Цикл
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Сайт = Выборка.Сайт;
			НоваяСтрока.Пользователь = Выборка.Пользователь;
			НоваяСтрока.ИдентификаторВакансии = 
				Формат(Вакансия[ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор], "ЧГ=0");
		КонецЦикла;
	КонецЦикла;
	
	Если Таблица.Количество() = 0 Тогда
		Возврат Не БылиОшибки;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПубликацияВакансий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Таблица;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ИдентификаторВакансии", "ИдентификаторВакансии");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("МестоПубликации", "Сайт");
		Блокировка.Заблокировать();
	
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Таблица.Сайт КАК Сайт,
		|	Таблица.Пользователь КАК Пользователь,
		|	Таблица.ИдентификаторВакансии КАК ИдентификаторВакансии
		|ПОМЕСТИТЬ ВТТаблица
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПубликацияВакансий.Вакансия КАК Вакансия,
		|	ПубликацияВакансий.МестоПубликации КАК МестоПубликации,
		|	ВТТаблица.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблица КАК ВТТаблица
		|		ПО ((ВЫРАЗИТЬ(ПубликацияВакансий.ИдентификаторВакансии КАК СТРОКА(100))) = (ВЫРАЗИТЬ(ВТТаблица.ИдентификаторВакансии КАК СТРОКА(100))))
		|			И ПубликацияВакансий.МестоПубликации = ВТТаблица.Сайт");
		Запрос.УстановитьПараметр("Таблица", Таблица);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ЗафиксироватьТранзакцию();
			Возврат Не БылиОшибки;
		КонецЕсли;
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ПубликацияВакансий.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Вакансия.Установить(Выборка.Вакансия);
			НаборЗаписей.Отбор.МестоПубликации.Установить(Выборка.МестоПубликации);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			НаборЗаписей[0].Ответственный = Выборка.Пользователь;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		Возврат Не БылиОшибки;
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Заполнение ответственных в публикациях вакансий'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПолучитьВсеОтклики()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Пользователь КАК Пользователь,
	|	НастройкиИнтеграцииРекрутинговыхСайтов.РекрутинговыйСайт КАК РекрутинговыйСайт
	|ПОМЕСТИТЬ ВТ_ПользователиСайты
	|ИЗ
	|	РегистрСведений.НастройкиИнтеграцииРекрутинговыхСайтов КАК НастройкиИнтеграцииРекрутинговыхСайтов
	|ГДЕ
	|	НастройкиИнтеграцииРекрутинговыхСайтов.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПользователиСайты.РекрутинговыйСайт КАК Сайт,
	|	ВТ_ПользователиСайты.Пользователь КАК Пользователь,
	|	ПубликацияВакансий.Вакансия КАК Вакансия,
	|	ПубликацияВакансий.Ответственный
	|ИЗ
	|	ВТ_ПользователиСайты КАК ВТ_ПользователиСайты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубликацияВакансий КАК ПубликацияВакансий
	|		ПО ВТ_ПользователиСайты.РекрутинговыйСайт = ПубликацияВакансий.МестоПубликации
	|		И ВТ_ПользователиСайты.Пользователь = ПубликацияВакансий.Ответственный
	|		И (ПубликацияВакансий.ДатаСнятияСПубликации = ДАТАВРЕМЯ(1, 1, 1))");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПолучитьОтклики(Выборка.Вакансия, Выборка.Сайт, Выборка.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

Функция СвойстваПубликацииВакансииНаСайте(Сайт, ИдентификаторВакансии)
	
	Менеджер = МенеджерРекрутинговыхСайтов(Сайт);
	
	Возврат Менеджер.СвойстваПубликацииВакансииНаСайте(Сайт, ИдентификаторВакансии);
	
КонецФункции

Функция ВыполнитьПубликациюВакансии(Менеджер, Вакансия, Сайт, Дерево, ДанныеРегиона = Неопределено)
	
	Результат = Менеджер.ОпубликоватьВакансию(Сайт, Дерево);
	
	ИдентификаторВакансии = Результат.ИдентификаторВакансии;
	
	Если ЗначениеЗаполнено(ИдентификаторВакансии) Тогда
		ИдентификаторВакансии = Формат(ИдентификаторВакансии, "ЧГ=0");
		
		АдресПубликации = Менеджер.АдресВакансии(Сайт, ИдентификаторВакансии);
		
		ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
		ДанныеЗаписиПубликации.Вакансия = Вакансия;
		ДанныеЗаписиПубликации.Сайт = Сайт;
		ДанныеЗаписиПубликации.ИдентификаторВакансии = ИдентификаторВакансии;
		ДанныеЗаписиПубликации.Адрес = АдресПубликации;
		
		Если ДанныеРегиона <> Неопределено Тогда
			ДанныеЗаписиПубликации.Регион = ДанныеРегиона[0].Представление;
			ДанныеЗаписиПубликации.ИдентификаторРегиона = 
				СтрЗаменить(Строка(ДанныеРегиона[0].Значение), Символы.НПП, "");
		КонецЕсли;
		
		ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
		ЗаписьВРегистрДанныеПубликации(Вакансия, Сайт, Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
