
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Код- Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция Подключить(Код) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	КодАвторизации = Код;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе
Функция ИнформацияОПользователе(Показыватьпредупреждение = Истина) Экспорт
	
	ИнформацияОПользователе = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/me");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОПользователеZarplata = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
	Иначе
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеИнформацияОПользователе(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Если Не ИнформацияОПользователеZarplata.is_employer Тогда
		ВызватьИсключение НСтр("ru = 'Аккаунт не является аккаунтом работодателя.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОПользователеZarplata.employer.id) Тогда
		ИнформацияОПользователе.ИдентификаторКомпании = ИнформацияОПользователеZarplata.employer.id;
		ИнформацияОПользователе.ИдентификаторПользователя = ИнформацияОПользователеZarplata.employer.manager_id;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОПользователеZarplata.personal_manager.first_name) Тогда
		ИнформацияОПользователе.ПерсональныйМенеджер.Имя = ИнформацияОПользователеZarplata.personal_manager.first_name;
		ИнформацияОПользователе.ПерсональныйМенеджер.Фамилия = ИнформацияОПользователеZarplata.personal_manager.last_name;
		ИнформацияОПользователе.ПерсональныйМенеджер.ЭлектроннаяПочта = ИнформацияОПользователеZarplata.personal_manager.email;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОПользователеZarplata.email) Тогда
		ИнформацияОПользователе.ИмяПользователя = ИнформацияОПользователеZarplata.email;
	КонецЕсли;
	
	Возврат ИнформацияОПользователе;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
// 
// Параметры:
//  Показыватьпредупреждение - Булево -
Функция ПроверитьПодключение(Показыватьпредупреждение = Истина) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен(Показыватьпредупреждение);
	КонецЕсли;
	
	Если Результат.Подключен Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  Неопределено, ФиксированнаяСтруктура -
Функция ЗагрузитьКлассификаторы() Экспорт
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы <> Неопределено Тогда
		КлассификаторыСайта = Новый Структура(Классификаторы);
		КлассификаторыСайта.Вставить("vacancy_properties", ВариантыПубликации());
		Возврат ОбщегоНазначения.ФиксированныеДанные(КлассификаторыСайта);
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	КлассификаторыZarplata = ЗагрузитьОбщиеКлассификаторы();
	
	Если Не ЗначениеЗаполнено(КлассификаторыZarplata) Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	КлассификаторПрофессиональныхРолей = ЗагрузитьКлассификаторПрофессиональныхРолей();
	КлассификаторРегионов = ЗагрузитьКлассификаторРегионов();
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	Если Не ЗначениеЗаполнено(ИнформацияОПользователе.ИмяПользователя) Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	ИдентификаторКомпании = ИнформацияОПользователе.ИдентификаторКомпании;
	
	Если ЗначениеЗаполнено(ИнформацияОПользователе.ИдентификаторКомпании) Тогда
		АдресаПользователя = ЗагрузитьАдресаПользователя(ИдентификаторКомпании);
		ДепартаментыПользователя = ЗагрузитьДепартаментыПользователя(ИдентификаторКомпании);
		МенеджерыПользователя = ЗагрузитьМенеджеровПользователя(ИдентификаторКомпании);
		ВариантыПубликации = ВариантыПубликации(ИнформацияОПользователе);
	Иначе
		РекрутинговыеСайтыСлужебный.СообщитьПользователю(
			НСтр("ru = 'Классификаторы пользователя (адреса, менеджеры, департаменты) не загружены.'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлассификаторПрофессиональныхРолей) Тогда
		КлассификаторыZarplata.Вставить("professional_roles",
			ОбщегоНазначения.ФиксированныеДанные(КлассификаторПрофессиональныхРолей));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлассификаторРегионов) Тогда
		КлассификаторыZarplata.Вставить("areas", ОбщегоНазначения.ФиксированныеДанные(КлассификаторРегионов));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресаПользователя) Тогда
		НовыйМассив = Новый Массив;
		
		Для Каждого ЭлементМассива Из АдресаПользователя Цикл
			НоваяСтруктура = СтруктураДанных();
			НоваяСтруктура.id = ЭлементМассива.id;
			НоваяСтруктура.name = ?(ЗначениеЗаполнено(ЭлементМассива.city), ЭлементМассива.city, "")
				+ ?(ЗначениеЗаполнено(ЭлементМассива.street), ", ", "") + ?(ЗначениеЗаполнено(ЭлементМассива.street), ЭлементМассива.street, "")
				+ ?(ЗначениеЗаполнено(ЭлементМассива.building), ", ", "") + ?(ЗначениеЗаполнено(ЭлементМассива.building), ЭлементМассива.building, "");
				
			Если Не ЗначениеЗаполнено(НоваяСтруктура.name)
				И ЗначениеЗаполнено(ЭлементМассива.raw) Тогда
				
				НоваяСтруктура.name = ЭлементМассива.raw;
			КонецЕсли;
				
			НоваяФиксированнаяСтруктура = Новый ФиксированнаяСтруктура(НоваяСтруктура);
			НовыйМассив.Добавить(НоваяФиксированнаяСтруктура);
		КонецЦикла;
		
		КлассификаторыZarplata.Вставить("addresses", Новый ФиксированныйМассив(НовыйМассив));
	КонецЕсли;

	Если ЗначениеЗаполнено(ВариантыПубликации) Тогда
		КлассификаторыZarplata.Вставить(
			"vacancy_properties", ОбщегоНазначения.ФиксированныеДанные(ВариантыПубликации));
	КонецЕсли;

	Если ЗначениеЗаполнено(МенеджерыПользователя) Тогда
		КлассификаторыZarplata.Вставить(
			"managers", ОбщегоНазначения.ФиксированныеДанные(МенеджерыПользователя));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДепартаментыПользователя) Тогда
		КлассификаторыZarplata.Вставить(
			"departments", ОбщегоНазначения.ФиксированныеДанные(ДепартаментыПользователя.items));
	КонецЕсли;
	
	Периоды = Новый Массив;
	Периоды.Добавить(СтруктураДанных(0, НСтр("ru = 'За все время'")));
	Периоды.Добавить(СтруктураДанных(1, НСтр("ru = 'За последние 24 часа'")));
	Периоды.Добавить(СтруктураДанных(3, НСтр("ru = 'За последние 3 дня'")));
	Периоды.Добавить(СтруктураДанных(7, НСтр("ru = 'За последнюю неделю'")));
	Периоды.Добавить(СтруктураДанных(14, НСтр("ru = 'За последние 2 недели'")));
	Периоды.Добавить(СтруктураДанных(30, НСтр("ru = 'За последний 1 месяц'")));
	Периоды.Добавить(СтруктураДанных(60, НСтр("ru = 'За последние 2 месяца'")));
	
	КлассификаторыZarplata.Вставить("periods", ОбщегоНазначения.ФиксированныеДанные(Периоды));
	
	КлассификаторыZarplataФикс = ОбщегоНазначения.ФиксированныеДанные(КлассификаторыZarplata);
	
	ТекущиеПараметры =
		РекрутинговыеСайтыСлужебный.СоответствиеПоФиксированномуСоответствию(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("КлассификаторыZarplata", КлассификаторыZarplataФикс);
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КлассификаторыZarplataФикс;
	
КонецФункции

// Найти кандидатов.
// 
// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений: см. Обработки.ПоискРезюмеВИнтернете.НайденныеКандидаты
//  СтруктураОтбора - Структура: см. РекрутинговыеСайтыСлужебный.СтруктураОтбораКандидатов
//  ПараметрыПоиска - Структура: см. РекрутинговыеСайтыСлужебный.НовыеПараметрыПоиска
Процедура НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	НомерСтраницы = ПараметрыПоиска.НомерСтраницы;
	ПолеСортировки = ПараметрыПоиска.ПолеСортировки;
	ВсегоКандидатов = ПараметрыПоиска.ВсегоКандидатов;
	
	СтрокаОтбора = СтрокаОтбора(СтруктураОтбора, НомерСтраницы);
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/resumes/?" + СтрокаОтбора);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоискаРезюме(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		РезультатПоискаРезюме = ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса);
		
		Если РезультатПоискаРезюме["items"] = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ВсегоКандидатов = РезультатПоискаРезюме["found"];
		ПараметрыПоиска.ВсегоКандидатов = Мин(Число(ВсегоКандидатов), 2000);
		
		ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Массив
Функция ПоляВакансии(ОбновлениеПубликации = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONНачалоМассива = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива();
	ТипЗначенияJSONНачалоОбъекта = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоОбъекта();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();
	ТипЗначенияJSONБулево = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONБулево();

	МассивПолей = Новый Массив;
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "name";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Внутренний код вакансии
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "code";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Код вакансии'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Специализация
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "professional_roles";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Специализация сотрудника'");
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_professional_roles = СтруктураПоля();
	СтруктураПоля_professional_roles.Путь = "id";
	СтруктураПоля_professional_roles.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_professional_roles.Описание = НСтр("ru = 'Специализация сотрудника'");
	СтруктураПоля_professional_roles.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_professional_roles);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Опыт работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "experience";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Опыт работы'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_experience = СтруктураПоля();
	СтруктураПоля_experience.Путь = "id";
	СтруктураПоля_experience.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_experience.Описание = НСтр("ru = 'Опыт работы'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_experience);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Тип занятости
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "employment_form";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Тип занятости'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_employment_form = СтруктураПоля();
	СтруктураПоля_employment_form.Путь = "id";
	СтруктураПоля_employment_form.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_employment_form.Описание = НСтр("ru = 'Тип занятости'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_employment_form);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Количество смен
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "fly_in_fly_out_duration";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Количество смен (вахта)'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_fly_in_fly_out_duration = СтруктураПоля();
	СтруктураПоля_fly_in_fly_out_duration.Путь = "id";
	СтруктураПоля_fly_in_fly_out_duration.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_fly_in_fly_out_duration.Описание = НСтр("ru = 'Количество смен (вахта)'");
	СтруктураПоля_fly_in_fly_out_duration.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_fly_in_fly_out_duration);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Формат работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "work_format";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Формат работы'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_work_format = СтруктураПоля();
	СтруктураПоля_work_format.Путь = "id";
	СтруктураПоля_work_format.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_work_format.Описание = НСтр("ru = 'Формат работы'");
	СтруктураПоля_work_format.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_work_format);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Трудовой договор
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "accept_labor_contract";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Трудовой договор'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Стажировка
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "internship";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Стажировка'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Договор ГПХ
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "civil_law_contracts";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Договор ГПХ'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_civil_law_contracts = СтруктураПоля();
	СтруктураПоля_civil_law_contracts.Путь = "id";
	СтруктураПоля_civil_law_contracts.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_civil_law_contracts.Описание = НСтр("ru = 'Договор ГПХ'");
	СтруктураПоля_civil_law_contracts.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_civil_law_contracts);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// График работы
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "work_schedule_by_days";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'График работы'");
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_work_schedule_by_days = СтруктураПоля();
	СтруктураПоля_work_schedule_by_days.Путь = "id";
	СтруктураПоля_work_schedule_by_days.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_work_schedule_by_days.Описание = НСтр("ru = 'График работы'");
	СтруктураПоля_work_schedule_by_days.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_work_schedule_by_days);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Рабочие часы в день
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "working_hours";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Рабочие часы в день'");
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_working_hours = СтруктураПоля();
	СтруктураПоля_working_hours.Путь = "id";
	СтруктураПоля_working_hours.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_working_hours.Описание = НСтр("ru = 'Рабочие часы в день'");
	СтруктураПоля_working_hours.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_working_hours);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Есть вечерние или ночные смены
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "night_shifts";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Есть вечерние или ночные смены'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Регион публикации
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "area";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Регион публикации'");
	Если ОбновлениеПубликации Тогда
		СтруктураПоля.Использование = Ложь;
	КонецЕсли;
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_area = СтруктураПоля();
	СтруктураПоля_area.Путь = "id";
	СтруктураПоля_area.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_area.Описание = НСтр("ru = 'Регион публикации'");
	СтруктураПоля_area.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_area);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Адрес
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "address";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Адрес'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_address = СтруктураПоля();
	СтруктураПоля_address.Путь = "id";
	СтруктураПоля_address.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля_address.Описание = НСтр("ru = 'Адрес'");
	СтруктураПоля_address.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_address);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Зарплата
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salary_range";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Зарплата'");
	
	ПодчиненныеЭлементы = Новый Массив;
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "from";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля_salary.Описание = НСтр("ru = 'Нижняя граница зарплаты'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "to";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля_salary.Описание = НСтр("ru = 'Верхняя граница зарплаты'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "currency";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля_salary.Описание = НСтр("ru = 'Валюта'");
	СтруктураПоля_salary.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "mode";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля_salary.Описание = НСтр("ru = 'Периодичность выплат'");
	СтруктураПоля_salary.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "frequency";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля_salary.Описание = НСтр("ru = 'Частота выплат'");
	СтруктураПоля_salary.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля_salary = СтруктураПоля();
	СтруктураПоля_salary.Путь = "gross";
	СтруктураПоля_salary.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля_salary.Описание = НСтр("ru = 'До вычета налогов'");
	СтруктураПоля_salary.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_salary);
	
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Описание
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "description";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание (не менее 200 символов)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Навыки
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "key_skills";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Навыки (не более 30)'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_key_skills = СтруктураПоля();
	СтруктураПоля_key_skills.Путь = "name";
	СтруктураПоля_key_skills.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_key_skills.Описание = НСтр("ru = 'Навык'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_key_skills);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Водительские права
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "driver_license_types";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Водительские права'");
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_driver_license_types = СтруктураПоля();
	СтруктураПоля_driver_license_types.Путь = "id";
	СтруктураПоля_driver_license_types.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_driver_license_types.Описание = НСтр("ru = 'Водительские права'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_driver_license_types);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Соискатели с инвалидностью
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "accept_handicapped";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Могут откликаться соискатели с инвалидностью'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Соискатели с неполным резюме
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "accept_incomplete_resumes";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Могут откликаться соискатели с неполным резюме'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Менеджер вакансии
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "manager";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Менеджер вакансии'");
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_manager = СтруктураПоля();
	СтруктураПоля_manager.Путь = "id";
	СтруктураПоля_manager.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_manager.Описание = НСтр("ru = 'Менеджер вакансии'");
	СтруктураПоля_manager.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_manager);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Вариант публикации
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "vacancy_properties";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Вариант публикации'");
	СтруктураПоля.Обязательное = Истина;
	
	ПодчиненныеЭлементы = Новый Массив;
	СтруктураПоля_vacancy_properties = СтруктураПоля();
	СтруктураПоля_vacancy_properties.Путь = "id";
	СтруктураПоля_vacancy_properties.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_vacancy_properties.Описание = НСтр("ru = 'Вариант публикации'");
	СтруктураПоля_vacancy_properties.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_vacancy_properties);
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Закрытая
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "closed_for_applicants";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Закрытая вакансия'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Требовать сопроводительное письмо
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "response_letter_required";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Требовать сопроводительное письмо'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Уведомлять о новых откликах
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "response_notifications";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Уведомлять о новых откликах'");
	МассивПолей.Добавить(СтруктураПоля);
	
	// Возможность переписки с кандидатами
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "allow_messages";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONБулево;
	СтруктураПоля.Описание = НСтр("ru = 'Возможность переписки с кандидатами'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	// Контактная информация
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "contacts";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоОбъекта;
	СтруктураПоля.Описание = НСтр("ru = 'Контактная информация'");
	
	ПодчиненныеЭлементы = Новый Массив;
	
	СтруктураПоля_contacts = СтруктураПоля();
	СтруктураПоля_contacts.Путь = "name";
	СтруктураПоля_contacts.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_contacts.Описание = НСтр("ru = 'Контактное лицо'");
	СтруктураПоля_contacts.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_contacts);
	
	СтруктураПоля_contacts = СтруктураПоля();
	СтруктураПоля_contacts.Путь = "email";
	СтруктураПоля_contacts.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля_contacts.Описание = НСтр("ru = 'Электронная почта'");
	СтруктураПоля_contacts.Обязательное = Истина;
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_contacts);
	
	СтруктураПоля_contacts = СтруктураПоля();
	СтруктураПоля_contacts.Путь = "phones";
	СтруктураПоля_contacts.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля_contacts.Описание = НСтр("ru = 'Телефон'");
	ПодчиненныеЭлементы.Добавить(СтруктураПоля_contacts);
	
	СтруктураПоля.ПодчиненныеЭлементы = ПодчиненныеЭлементы;
	МассивПолей.Добавить(СтруктураПоля);
	
	Возврат МассивПолей;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Строка
Функция АдресВакансии(ИдентификаторВакансии) Экспорт
	
	Возврат СтрШаблон("https://hr.zarplata.ru/vacancy/%1", ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	ИдентификаторРезюме = АдресРезюме;
	
	Разделитель = "/";
	ПозицияРазделителя =
		РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
	
	Пока ПозицияРазделителя > 0 Цикл
		ИдентификаторРезюме =
			Сред(ИдентификаторРезюме,
				ПозицияРазделителя + СтрДлина(Разделитель),
				СтрДлина(ИдентификаторРезюме) - ПозицияРазделителя);
		
		ПозицияРазделителя =
			РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
	КонецЦикла;
	
	Разделитель = "?";
	ПозицияРазделителя =
		РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
	Если ПозицияРазделителя <> 0 Тогда
		ИдентификаторРезюме = Лев(ИдентификаторРезюме, ПозицияРазделителя - СтрДлина(Разделитель));
	КонецЕсли;
	
	Возврат ИдентификаторРезюме;

КонецФункции

// Параметры:
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(СтруктураРезюме) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(СтруктураРезюме);
		
		ДанныеКандидата.Комментарии = ЗначениеСвойстваУзла(СтруктураРезюме, "Комментарии");
		ДанныеКандидата.ДанныеПубликации = СтруктураРезюме;
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	ЭлементКлассификатора = Неопределено;
	ИмяКлассификатора = "";
	
	ИменаСписковВыбора = РекрутинговыеСайтыСлужебный.ИменаСписковВыбора();
	Если ИмяСписка = ИменаСписковВыбора.Пол Тогда
		ИмяКлассификатора = "gender";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.УровеньОбразования Тогда
		ИмяКлассификатора = "education_level";
	ИначеЕсли ИмяСписка = ИменаСписковВыбора.ПериодРазмещения Тогда
		ИмяКлассификатора = "periods";
	Иначе
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	Классификаторы = КлассификаторыСайта();
	
	Классификатор = Классификаторы[ИмяКлассификатора];
	
	Если Не ЗначениеЗаполнено(Классификатор) Тогда
		Возврат ЭлементКлассификатора;
	КонецЕсли;
	
	// АПК:1297-выкл Значения классификаторов, не локализуются.
	СоответствиеЗамены = Новый Соответствие;
	СоответствиеЗамены.Вставить("среднее", "среднее общее");
	СоответствиеЗамены.Вставить("среднее специальное", "среднее профессиональное");
	СоответствиеЗамены.Вставить("неоконченное высшее", "неполное высшее");
	СоответствиеЗамены.Вставить("доктор наук", "докторантура");
	СоответствиеЗамены.Вставить("кандидат наук", "аспирантура");
	// АПК:1297-вкл
	
	Найдено = Ложь;
	Для Каждого Элемент Из Классификатор Цикл
		ЗначениеСравнения = НРег(СокрЛП(Элемент.name));
		
		ЗначениеЗамены = СоответствиеЗамены.Получить(ЗначениеСравнения);
		Если ЗначениеЗаполнено(ЗначениеЗамены) Тогда
			ЗначениеСравнения = ЗначениеЗамены;
		КонецЕсли;
		
		Если ЗначениеСравнения = НРег(Значение) Тогда
			Найдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Найдено Тогда
		ЭлементКлассификатора = Элемент.id;
	КонецЕсли;
	
	Возврат ЭлементКлассификатора;
	
КонецФункции

Функция ПоискДоступен() Экспорт
	
	Результат = Неопределено;
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	Если Не ЗначениеЗаполнено(ИнформацияОПользователе.ИмяПользователя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(
		СтрШаблон("/employers/%1/managers/%2/method_access",
		ИнформацияОПользователе.ИдентификаторКомпании, ИнформацияОПользователе.ИдентификаторПользователя));
		
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос, Ложь);
	
	Если РезультатЗапроса.Ошибка Тогда
		РекрутинговыеСайтыСлужебный.ЗарегистрироватьОшибкуОбращенияКРекрутинговомуСайту(РезультатЗапроса.ИнформацияОбОшибке);
		Возврат Результат;
	КонецЕсли;
	
	ПлатныеМетоды = ПрочитатьОтветПлатныеМетоды(РезультатЗапроса);
	
	Для Каждого Метод Из ПлатныеМетоды.items Цикл
		Если Метод.id = "2" Тогда
			Результат = Метод.access.has_access;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь) Экспорт
	
	ВакансииССайта = Новый Массив;
	
	Если Не УстановитьСоединение() Тогда
		БылиОшибки = Истина;
		Возврат ВакансииССайта;
	КонецЕсли;
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	ИдентификаторКомпании = ИнформацияОПользователе.ИдентификаторКомпании;
	ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
	
	Если Не ЗначениеЗаполнено(ИдентификаторКомпании) Или Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		БылиОшибки = Истина;
		Возврат ВакансииССайта;
	КонецЕсли;
	
	ЗагрузитьКлассификаторы();
	
	Для каждого РезультатЗапроса Из ВсеРезультатыЗапроса(
		СтрШаблон("employers/%1/vacancies/active?manager_id=%2", ИдентификаторКомпании, ИдентификаторПользователя)) Цикл
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			БылиОшибки = Истина;
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансий(Сайт, ЭтотОбъект, РезультатЗапроса);
		Иначе
			Вакансии = ПрочитатьОтветВакансииССайта(РезультатЗапроса);
			Для Каждого Вакансия Из ЗначениеСвойстваУзла(Вакансии, "items") Цикл
				Описание = ОписаниеПубликацииВакансии(Формат(ЗначениеСвойстваУзла(Вакансия, "id"), "ЧГ=0"));
				Если ЗначениеЗаполнено(Описание) Тогда
					ВакансииССайта.Добавить(Описание);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВакансииССайта;
	
КонецФункции

// Параметры:
//  Вакансия - См. ОписаниеПубликацииВакансии
//  Реквизит - Строка
// 
// Возвращаемое значение:
//  Произвольный
Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойстваУзла(Вакансия, "name")), ЗначениеСвойстваУзла(Вакансия, "name"), "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		Результат = ?(ЗначениеЗаполнено(ЗначениеСвойстваУзла(Вакансия, "salary", "to")), ЗначениеСвойстваУзла(Вакансия, "salary", "to"), 0);
	ИначеЕсли Реквизит = "ДатаОткрытия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.СтрокаВДату(ЗначениеСвойстваУзла(Вакансия, "created_at"));
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" Тогда
		Результат = ДобавитьМесяц(РекрутинговыеСайтыСлужебный.СтрокаВДату(ЗначениеСвойстваУзла(Вакансия, "created_at")), 1);
	ИначеЕсли Реквизит = "Требования" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Требования;
	ИначеЕсли Реквизит = "Обязанности" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Обязанности;
	ИначеЕсли Реквизит = "Условия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ОписаниеТребованийОбязанностейУсловий(
			ЗначениеСвойстваУзла(Вакансия, "description")).Условия;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "name")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "name";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "name");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "code")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "code";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "code");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "professional_roles")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "professional_roles.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ПрофессиональнаяРоль Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "professional_roles") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ПрофессиональнаяРоль, "id"),
				ЗначениеСвойстваУзла(ПрофессиональнаяРоль, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "experience.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		НовоеПоле.ПубликацияВакансии.Добавить(
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience", "id"),
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "experience", "name"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "employment_form")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "employment_form.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		НовоеПоле.ПубликацияВакансии.Добавить(
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "employment_form", "id"),
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "employment_form", "name"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "fly_in_fly_out_duration")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "fly_in_fly_out_duration.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ДлительностьВахты Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "fly_in_fly_out_duration") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ДлительностьВахты, "id"),
				ЗначениеСвойстваУзла(ДлительностьВахты, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work_format")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "work_format.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ДлительностьВахты Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work_format") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ДлительностьВахты, "id"),
				ЗначениеСвойстваУзла(ДлительностьВахты, "name"),
				Истина);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_labor_contract")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "accept_labor_contract";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_labor_contract");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "internship")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "internship";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "internship");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "civil_law_contracts")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "civil_law_contracts.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ДлительностьВахты Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "civil_law_contracts") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ДлительностьВахты, "id"),
				ЗначениеСвойстваУзла(ДлительностьВахты, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work_schedule_by_days")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "work_schedule_by_days.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ДлительностьВахты Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "work_schedule_by_days") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ДлительностьВахты, "id"),
				ЗначениеСвойстваУзла(ДлительностьВахты, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "working_hours")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "working_hours.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого ДлительностьВахты Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "working_hours") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(
				ЗначениеСвойстваУзла(ДлительностьВахты, "id"),
				ЗначениеСвойстваУзла(ДлительностьВахты, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "night_shifts")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "night_shifts";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "night_shifts");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "area")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "area.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		НовоеПоле.ПубликацияВакансии.Добавить(
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "area", "id"),
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "area", "name"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "address.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		ИдентификаторАдреса = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "address", "id");
		ПредставлениеАдреса = "";
		Для Каждого ЭлементКлассификатора Из КлассификаторыСайта().addresses Цикл
			Если ЭлементКлассификатора.id = ИдентификаторАдреса Тогда
				ПредставлениеАдреса = ЭлементКлассификатора.name;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии.Добавить(ИдентификаторАдреса, ПредставлениеАдреса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.from";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "from");
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.to";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "to");
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.currency";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		КодВалюты = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "currency");
		ПредставлениеВалюты = "";
		Для Каждого ЭлементКлассификатора Из КлассификаторыСайта().currency Цикл
			Если ЭлементКлассификатора.code = КодВалюты Тогда
				ПредставлениеВалюты = ЭлементКлассификатора.abbr;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии.Добавить(КодВалюты, ПредставлениеВалюты);
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.mode";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		НовоеПоле.ПубликацияВакансии.Добавить(
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "mode", "id"),
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "mode", "name"));
			
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.frequency";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		НовоеПоле.ПубликацияВакансии.Добавить(
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "frequency", "id"),
			ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "frequency", "name"));
			
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_range.gross";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "salary_range", "gross");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "description")) Тогда
		Описание = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "description");
		Описание = СтрЗаменить(Описание, "</ul> <strong>", "</ul><br /> <strong>");
		Описание = СтрЗаменить(Описание, "</li> <li>", "</li><li>");
		Описание = СтрЗаменить(Описание, "</li> </ul>", "</li></ul>");
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "description";
		НовоеПоле.ПубликацияВакансии = Описание;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "key_skills")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "key_skills.name";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого Навык Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "key_skills") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(ЗначениеСвойстваУзла(Навык, "name"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "driver_license_types")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "driver_license_types.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		Для Каждого Категория Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "driver_license_types") Цикл
			НовоеПоле.ПубликацияВакансии.Добавить(ЗначениеСвойстваУзла(Категория, "id"));
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_handicapped")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "accept_handicapped";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_handicapped");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_incomplete_resumes")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "accept_incomplete_resumes";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "accept_incomplete_resumes");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "manager")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "manager.id";
		НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
		
		ИдентификаторМенеджера = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "manager", "id");
		ПредставлениеМенеджера = "";
		Для Каждого ЭлементКлассификатора Из КлассификаторыСайта().managers Цикл
			Если ЭлементКлассификатора.id = ИдентификаторМенеджера Тогда
				ПредставлениеМенеджера = ЭлементКлассификатора.name;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии.Добавить(ИдентификаторМенеджера, ПредставлениеМенеджера);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "vacancy_properties")) Тогда
		ИдентификаторВарианта = "";
		Для Каждого Вариант Из ЗначениеСвойстваУзла(СтруктураВакансииССайта, "vacancy_properties", "properties") Цикл
			ИдентификаторВарианта = ЗначениеСвойстваУзла(Вариант, "property_type");
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ИдентификаторВарианта) Тогда
			НовоеПоле = НоваяСтрока.Строки.Добавить();
			НовоеПоле.Путь = "vacancy_properties.id";
			НовоеПоле.ПубликацияВакансии = Новый СписокЗначений();
			
			
			ПредставлениеВарианта = "";
			Для Каждого ЭлементКлассификатора Из КлассификаторыСайта().vacancy_properties Цикл
				Если ЭлементКлассификатора.id = ИдентификаторВарианта Тогда
					ПредставлениеВарианта = ЭлементКлассификатора.name;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			НовоеПоле.ПубликацияВакансии.Добавить(ИдентификаторВарианта, ПредставлениеВарианта);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "closed_for_applicants")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "closed_for_applicants";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "closed_for_applicants");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "response_letter_required")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "response_letter_required";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "response_letter_required");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "response_notifications")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "response_notifications";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "response_notifications");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "allow_messages")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "allow_messages";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "allow_messages");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contacts")) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "contacts.name";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contacts", "name");
		
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "contacts.email";
		НовоеПоле.ПубликацияВакансии = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "contacts", "email");
	КонецЕсли;
КонецПроцедуры

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Структура: См. РекрутинговыеСайтыСлужебный.НовыеВидыПолей
Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СОдиночнымВыборомИзДерева = ПоляВакансииСОдиночнымВыборомИзДерева();
	ВидыПолей.СМножественнымВыборомИзДерева = ПоляВакансииСМножественнымВыборомИзДерева();
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.СМножественнымВыборомИзСписка = ПоляВакансииСМножественнымВыборомИзСписка();
	ВидыПолей.НедоступныеДляРедактирования = ПоляВакансииНедоступныеДляРедактирования();
	ВидыПолей.СоСпискомБезКлассификатора = ПоляВакансииСоСпискомБезКлассификатора();
	ВидыПолей.СоСпециальнойФормойРедактированияСписка = ПоляВакансииСоСпециальнойФормойРедактированияСписка();
	ВидыПолей.СТекстомВHTML = ПоляВакансииСТекстомВHTML();
	
	Возврат ВидыПолей;
	
КонецФункции

// Параметры:
//  Путь - Строка
// 
// Возвращаемое значение:
//  СписокЗначений
Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Классификаторы = КлассификаторыСайта();
	Если Классификаторы = Неопределено Или Не Классификаторы.Свойство(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	МассивДанных = Классификаторы[Путь]; // Массив
	Если Путь = "currency" Тогда
		Для Каждого ЭлементМассива Из МассивДанных Цикл
			Если Не ЭлементМассива.in_use Тогда
				Продолжить;
			КонецЕсли;
			СписокВыбора.Добавить(ЭлементМассива.code, ЭлементМассива.abbr);
		КонецЦикла;
	Иначе
		Для Каждого ЭлементМассива Из МассивДанных Цикл
			СписокВыбора.Добавить(
				ЭлементМассива.id,
				?(ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭлементМассива, "name")),
					ЭлементМассива.name, ЭлементМассива.id));
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Запрос = НовыйHTTPЗапрос("/vacancies?with_professional_roles=true");
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 201 Тогда
		АдресВакансии = РезультатЗапроса.Ответ.Заголовки.Получить("Location");
		
		НомерВхожденияРазделителя = РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(АдресВакансии, "/", 2);
		ИдентификаторВакансии = Сред(АдресВакансии, НомерВхожденияРазделителя + 1, СтрДлина(АдресВакансии) - НомерВхожденияРазделителя);
		
		Результат.ИдентификаторВакансии = ИдентификаторВакансии;
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	Если Не ЗначениеЗаполнено(JSONОписаниеВакансии) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка чтения данных публикации на сайте %1.'"), Сайт);
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкой(ТекстСообщения, Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ОписаниеВакансии = ПарсерJSON(JSONОписаниеВакансии);
	
	ОписаниеВакансии_vacancy_properties = Неопределено;
	ОписаниеВакансии_manager = Неопределено;
	Если ОписаниеВакансии.Свойство("vacancy_properties") Тогда
		ОписаниеВакансии_vacancy_properties =
			Новый Структура("vacancy_properties", Новый Структура("properties", Новый Массив()));
		Для Каждого Свойство Из ОписаниеВакансии.vacancy_properties.properties Цикл
			ОписаниеВакансии_vacancy_properties.vacancy_properties.properties.Добавить(
				Новый Структура("property_type", Свойство.property_type));
		КонецЦикла;
		ОписаниеВакансии.Удалить("vacancy_properties");
	КонецЕсли;
	
	Если ОписаниеВакансии.Свойство("manager") Тогда
		ОписаниеВакансии_manager = Новый Структура("manager", ОписаниеВакансии.manager);
		ОписаниеВакансии.Удалить("manager");
	КонецЕсли;
	
	JSONОписаниеВакансии = РекрутинговыеСайтыСлужебный.ЗаписьJSON(ОписаниеВакансии);
	
	ТекстЗапроса = СтрШаблон("/vacancies/%1?with_professional_roles=true", ИдентификаторВакансии);
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Если ОписаниеВакансии_vacancy_properties <> Неопределено Тогда
		JSONОписаниеВакансии = РекрутинговыеСайтыСлужебный.ЗаписьJSON(ОписаниеВакансии_vacancy_properties);
		Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 204 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка обновления биллингового типа вакансии на сайте %1.'"), Сайт);
			Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкой(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если ОписаниеВакансии_manager <> Неопределено Тогда
		JSONОписаниеВакансии = РекрутинговыеСайтыСлужебный.ЗаписьJSON(ОписаниеВакансии_manager);
		Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 204 Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка обновления менеджера вакансии на сайте %1.'"), Сайт);
			Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкой(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	ИнформацияОПользователе = ИнформацияОПользователе();
	
	ИдентификаторКомпании = ИнформацияОПользователе.ИдентификаторКомпании;
	ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторПользователя;
	
	Если Не ЗначениеЗаполнено(ИдентификаторКомпании) 
		Или Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/employers/%1/vacancies/archived/%2", ИдентификаторКомпании, ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 204 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура: См. РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии
Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	Описание = ОписаниеПубликацииВакансии(ИдентификаторВакансии, Ложь);
	Если ЗначениеЗаполнено(Описание) Тогда
		СвойстваПубликации.Опубликована = Не ЗначениеСвойстваУзла(Описание, "archived");
		
		Если СвойстваПубликации.Опубликована Тогда
			СвойстваПубликации.ДатаПубликации = РекрутинговыеСайтыСлужебный.СтрокаВДату(ЗначениеСвойстваУзла(Описание, "published_at"));
			СвойстваПубликации.ДатаОбновления = РекрутинговыеСайтыСлужебный.СтрокаВДату(ЗначениеСвойстваУзла(Описание, "published_at"));
		Иначе
			Истекает = ЗначениеСвойстваУзла(Описание, "expires_at");
			Если ЗначениеЗаполнено(Истекает) Тогда
				СвойстваПубликации.ДатаСнятияСПубликации = 
					Мин(РекрутинговыеСайтыСлужебный.СтрокаВДату(ЗначениеСвойстваУзла(Описание, "expires_at")), ТекущаяДатаСеанса());
			Иначе
				СвойстваПубликации.ДатаСнятияСПубликации = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	Отклики = РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов();
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		Запрос = НовыйHTTPЗапрос("negotiations?vacancy_id=" + ИдентификаторВакансии);
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатЗапроса);
			Возврат;
		Иначе
			КоллекцииОткликов = ПрочитатьОтветКоллекцияОткликов(РезультатЗапроса);
		КонецЕсли;
		
		Для Каждого КоллекцияОткликов Из КоллекцииОткликов.collections Цикл
			Для каждого РезультатЗапроса Из
				ВсеРезультатыЗапроса("negotiations/" + КоллекцияОткликов.id + "?vacancy_id=" + ИдентификаторВакансии) Цикл
				
				Если РезультатЗапроса.КодСостояния <> 200 Тогда
					РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияРезюме(Сайт, ЭтотОбъект, РезультатЗапроса);
					Возврат;
				Иначе
					ОткликиССайта = ПрочитатьОтветОтклики(РезультатЗапроса);
					
					Для Каждого Отклик Из ЗначениеСвойстваУзла(ОткликиССайта, "items") Цикл
						Если Отклик = Неопределено 
							Или Отклик = "null" Тогда
							Продолжить;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Отклик, "resume")) Тогда
							Продолжить;
						КонецЕсли;
						
						ИдентификаторРезюме = ЗначениеСвойстваУзла(Отклик, "resume", "id");
						Если ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) = Неопределено Тогда
							НоваяЗапись = Отклики.Добавить();
							НоваяЗапись.Вакансия = Вакансия;
							НоваяЗапись.Фамилия = ЗначениеСвойстваУзла(Отклик, "resume", "last_name");
							НоваяЗапись.Имя = ЗначениеСвойстваУзла(Отклик, "resume", "first_name");
							НоваяЗапись.Отчество = ЗначениеСвойстваУзла(Отклик, "resume", "middle_name");
							НоваяЗапись.Источник = Сайт;
							НоваяЗапись.ДатаОтклика = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Отклик, "updated_at"));
							НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
							НоваяЗапись.Адрес = ЗначениеСвойстваУзла(Отклик, "resume", "area", "name");
							НоваяЗапись.АдресРезюме = ЗначениеСвойстваУзла(Отклик, "resume", "alternate_url");
							
							Если ЗначениеСвойстваУзла(Отклик, "resume", "can_view_full_info") = Истина Тогда
								Запрос = НовыйHTTPЗапрос("/resumes/" + ИдентификаторРезюме);
								
								РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
							
								Если РезультатЗапроса.КодСостояния = 200 Тогда
									
									Резюме = ПрочитатьОтветРезюмеССайта(РезультатЗапроса);
									
									КонтактнаяИнформация = КонтактнаяИнформацияРезюме(Резюме);
									
									Для Каждого КонтактнаяИнформацияСтрока Из КонтактнаяИнформация Цикл
									
										Если КонтактнаяИнформацияСтрока.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов") Тогда
											НоваяЗапись.Телефон = КонтактнаяИнформацияСтрока.Представление;
										КонецЕсли;
										
										Если КонтактнаяИнформацияСтрока.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов") Тогда
											НоваяЗапись.EMail = КонтактнаяИнформацияСтрока.Представление;
										КонецЕсли;
										
									КонецЦикла;
									
								КонецЕсли;
							КонецЕсли;
							
							Запрос = НовыйHTTPЗапрос("/negotiations/" + ЗначениеСвойстваУзла(Отклик, "id") + "/messages?with_text_only=true");
							
							РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
							
							Если РезультатЗапроса.КодСостояния = 200 Тогда
								
								Сообщения = ПрочитатьОтветСообщения(РезультатЗапроса);
								
								Для Каждого Сообщение Из Сообщения.Получить("items") Цикл
									
									Если ЗначениеСвойстваУзла(Сообщение, "author", "participant_type") = "applicant" Тогда
										
										НоваяЗапись.Сообщение = РекрутинговыеСайтыСлужебный.УдалитьЛишнееИзСтроки(ЗначениеСвойстваУзла(Сообщение, "text"));
										Прервать;
										
									КонецЕсли;
									
								КонецЦикла;
								
							КонецЕсли;
							
							ЗагруженныеОткликиВакансии.Добавить(ИдентификаторРезюме);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(Отклики, Пользователь);
	
КонецПроцедуры

// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
//  ДанныеРезюме - ТаблицаЗначений: см. РекрутинговыеСайтыСлужебный.ДанныеРезюме
Процедура ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме) Экспорт
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("МестоПубликации", Сайт);
	ОтборСтрок.Вставить("ИмяПоля", "owner");
	
	НайденныеСтроки = ДанныеРезюме.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СодержимоеПоляOwner = НайденныеСтроки[0].СодержимоеПоля;
	ИдентификаторКомпании = НайденныеСтроки[0].ИдентификаторПользователя;
	
	ПакетOwner = ПрочитатьПолеOwner(СодержимоеПоляOwner);
	АдресКомментариев = ПакетOwner.comments.url;
	
	Комментарии = КомментарииКандидата(АдресКомментариев, ИдентификаторКомпании, Кандидат);
	
	Если Комментарии <> Неопределено Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьТаблицуКомментариевКандидата(Комментарии, Кандидат, Сайт);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Классификатор - Строка
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  Булево
Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "professional_roles" Тогда
		Результат = ЗаполнитьДеревоПрофессиональныхРолей(Дерево);
	ИначеЕсли Классификатор = "areas" Или Классификатор = "areas_towns" Тогда
		Результат = ЗаполнитьДеревоРегионов(Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме
Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	ДоступностьКонтактов = ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	Попытка
		СтруктураРезюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
		ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме);
	Исключение
		ДоступностьКонтактов.КонтактыОткрыты = Ложь;
	КонецПопытки;
	
	Возврат ДоступностьКонтактов;
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме
Функция КонтактыРезюме(АдресРезюме) Экспорт
	
	КонтактыРезюме = РекрутинговыеСайтыСлужебный.НовыеКонтактыРезюме();
	
	Резюме = РезюмеСКонтактами(АдресРезюме);
	Если Не ЗначениеЗаполнено(Резюме) Тогда
		Возврат КонтактыРезюме;
	КонецЕсли;
	
	КонтактыРезюме.Фамилия	= ЗначениеСвойстваУзла(Резюме, "last_name");
	КонтактыРезюме.Имя		= ЗначениеСвойстваУзла(Резюме, "first_name");
	КонтактыРезюме.Отчество	= ЗначениеСвойстваУзла(Резюме, "middle_name");
	
	КонтактнаяИнформация = ЗначениеСвойстваУзла(Резюме, "contact");
	
	Если Не ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		Возврат КонтактыРезюме;
	КонецЕсли;
	
	Для Каждого ЭлементКИ Из КонтактнаяИнформация Цикл
		ТипКИ = ЗначениеСвойстваУзла(ЭлементКИ, "type", "id");
		
		Если ТипКИ = "cell" Тогда
			КонтактыРезюме.Телефон = ЗначениеСвойстваУзла(ЭлементКИ, "value", "formatted");
		ИначеЕсли ТипКИ = "email" Тогда
			КонтактыРезюме.ЭлектроннаяПочта = ЗначениеСвойстваУзла(ЭлементКИ, "value");
		КонецЕсли;
	КонецЦикла;
	
	Возврат КонтактыРезюме;
	
КонецФункции

// Параметры:
//  ДанныеДляОтправки - См. РекрутинговыеСайтыСлужебный.ДанныеДляОтправкиОбратнойСвязи
// 
// Возвращаемое значение:
//  Булево - Отправка прошла успешно
Функция ОтправитьОбратнуюСвязьПоОтклику(ДанныеДляОтправки) Экспорт
	
	Результат = Ложь;
	
	ИдентификаторыВакансии =
		РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(ДанныеДляОтправки.Вакансия, Сайт);
		
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		ТекстОшибки = НСтр("ru = 'Вакансия не опубликована.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		ТекстОшибки = НСтр("ru = 'Не настроен доступ к сайту.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось установить соединение с сайтом.'");
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
			Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки);
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		Запрос = НовыйHTTPЗапрос("negotiations?vacancy_id=" + ИдентификаторВакансии);
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			ТекстОшибки = НСтр("ru = 'Не удалось получить отклики.'");
			РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
				Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
			Возврат Результат;
		Иначе
			КоллекцииОткликов = ПрочитатьОтветКоллекцияОткликов(РезультатЗапроса);
		КонецЕсли;
		
		Действие = ?(ДанныеДляОтправки.Отклонить, "discard_by_employer", "interview");
		
		Для Каждого КоллекцияОткликов Из КоллекцииОткликов.states Цикл
			Для каждого РезультатЗапроса Из
				ВсеРезультатыЗапроса("negotiations/" + КоллекцияОткликов.id + "?vacancy_id=" + ИдентификаторВакансии) Цикл

				Если РезультатЗапроса.КодСостояния <> 200 Тогда
					ТекстОшибки = НСтр("ru = 'Не удалось получить отклики.'");
					РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
						Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
					Возврат Результат;
				Иначе
					ОткликиССайта = ПрочитатьОтветОтклики(РезультатЗапроса);
					
					Для Каждого Отклик Из ЗначениеСвойстваУзла(ОткликиССайта, "items") Цикл
						Если Отклик = Неопределено 
							Или Отклик = "null" Тогда
							Продолжить;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Отклик, "resume")) Тогда
							Продолжить;
						КонецЕсли;
						
						ИдентификаторРезюме = ЗначениеСвойстваУзла(Отклик, "resume", "id");
						
						Если СтрНайти(ДанныеДляОтправки.АдресРезюме, ИдентификаторРезюме) = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						Адрес = "";
						Метод = "";
						ДоступнаОтправкаСообщения = Ложь;
						Для каждого ДоступноеДействие Из ЗначениеСвойстваУзла(Отклик, "actions") Цикл
							Если ЗначениеСвойстваУзла(ДоступноеДействие, "id") = Действие Тогда
								Адрес = ЗначениеСвойстваУзла(ДоступноеДействие, "url");
								Метод = ЗначениеСвойстваУзла(ДоступноеДействие, "method");
								
								Для каждого Аргумент Из ЗначениеСвойстваУзла(ДоступноеДействие, "arguments") Цикл
									Если ЗначениеСвойстваУзла(Аргумент, "id") = "message" Тогда
										ДоступнаОтправкаСообщения = Истина;
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ЗначениеЗаполнено(Адрес) Тогда
							Запрос = НовыйHTTPЗапрос(СтрЗаменить(Адрес, СтрШаблон("https://%1/", ДанныеСайта.АдресЗапроса), ""));
							Запрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
							
							Сообщение = ДанныеДляОтправки.Сообщение;
							Тело = "";
							Если ДоступнаОтправкаСообщения Тогда
								Тело = СтрШаблон("message=%1", КодироватьСтроку(Сообщение, СпособКодированияСтроки.КодировкаURL));
							КонецЕсли;
							
							Запрос.УстановитьТелоИзСтроки(Тело);
							
							РезультатЗапроса = ВыполнитьHTTPЗапрос(Метод, Запрос);
							
							Если РезультатЗапроса.КодСостояния = 204 Тогда
								Результат = Истина;
								Прервать;
							Иначе
								ТекстОшибки = НСтр("ru = 'Не удалось отправить обратную связь.'");
								РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуОтправкиОбратнойСвязи(
									Сайт, ЭтотОбъект, ДанныеДляОтправки.Кандидат, ТекстОшибки, РезультатЗапроса);
								Возврат Результат;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
				Если Результат Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Результат Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

Функция ВсеРезультатыЗапроса(Адрес, НаСтранице = 50)
	
	Результат = Новый Массив();
	НомерСтраницы = 0;
	КоличествоРезультатов = НаСтранице + 1;
	
	Пока КоличествоРезультатов > НаСтранице Цикл
		АдресЗапроса = СтрШаблон("%1%2page=%3&per_page=%4",
			Адрес,
			?(СтрНайти(Адрес, "?") = 0, "?", "&"),
			НомерСтраницы,
			НаСтранице);
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, НовыйHTTPЗапрос(АдресЗапроса));
		Результат.Добавить(РезультатЗапроса);
		
		СтраницаОтвета = ПрочитатьМногостраничныйОтвет(РезультатЗапроса);
		
		КоличествоРезультатов = СтраницаОтвета["found"] - (НомерСтраницы * НаСтранице);
		НомерСтраницы = НомерСтраницы + 1;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Обновление - Булево
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
// Структура: см. РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров
Функция СтруктураМаркеров(Обновление = Ложь, Показыватьпредупреждение = Истина)
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляЗарплатаРу();
	Структура_token_uri = ОбщегоНазначенияКлиентСервер.СтруктураURI(ИдентификаторПриложения.token_uri);
	АдресАутентификации = Структура_token_uri.Хост;
	РесурсНаСервере = Структура_token_uri.ПутьНаСервере;
	Если Обновление Тогда
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"grant_type=refresh_token&refresh_token=%1",
					МаркерОбновления);
	Иначе
		СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"grant_type=authorization_code&client_id=%1&client_secret=%2&redirect_uri=%3&code=%4",
					ИдентификаторПриложения.client_id,
					ИдентификаторПриложения.client_secret,
					ИдентификаторПриложения.redirect_uri,
					КодАвторизации); 
	КонецЕсли;
	
	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресАутентификации, Истина);
	
	// Формируем общие заголовки.
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Запрос = Новый HTTPЗапрос(РесурсНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
	
	СтруктураМаркеров.МаркерДоступа = ОтветОбъект.access_token;
	СтруктураМаркеров.МаркерОбновления = ОтветОбъект.refresh_token;
	СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = ТекущаяДатаСеанса() + ОтветОбъект.expires_in;
	
	МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
	МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
	ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен(Показыватьпредупреждение = Истина)
	
	МаркерДействителен = ЗначениеЗаполнено(МаркерДоступа)
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	МаркерАктивен = Ложь;
		
	Если МаркерДействителен Тогда
		МаркерАктивен = СайтДоступен(Показыватьпредупреждение);
	КонецЕсли;
		
	Если Не МаркерАктивен И ЗначениеЗаполнено(МаркерОбновления) Тогда
		РезультатОбновления = ОбновитьМаркеры(Показыватьпредупреждение);
		МаркерДоступа = РезультатОбновления.МаркерДоступа;
		Если ЗначениеЗаполнено(РезультатОбновления.МаркерДоступа) Тогда
			МаркерАктивен = Истина;
			РезультатОбновления.Пользователь = Пользователь;
			РекрутинговыеСайтыСлужебный.СохранитьНастройкиАвторизации(РезультатОбновления);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МаркерАктивен;
	
КонецФункции

Функция СайтДоступен(Показыватьпредупреждение = Истина)
	
	Возврат ЗначениеЗаполнено(ИнформацияОПользователе(Показыватьпредупреждение).ИмяПользователя);
	
КонецФункции

Функция ОбновитьМаркеры(Показыватьпредупреждение = Истина)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	Результат.Сайт = Сайт;
	Результат.Пользователь = Пользователь;
	
	СтруктураМаркеров = СтруктураМаркеров(Истина, Показыватьпредупреждение);
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе= ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.МаркерОбновления = СтруктураМаркеров.МаркерОбновления;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

Функция АдресСервера()
	
	Возврат ДанныеСайта.АдресЗапроса;
	
КонецФункции

Функция АдресСайта()
	
	Возврат ДанныеСайта.ИмяСайта;
	
КонецФункции

Функция КлассификаторыСайта()
	
	Возврат ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("Классификаторы" + ДанныеСайта.Имя);
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * found - Число
//  * items - Массив из Структура:
//  ** id - Число
Функция ПрочитатьМногостраничныйОтвет(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * employer - Структура -:
//  ** id - Строка -
//  ** manager_id - Строка -
//  * personal_manager - Структура -:
//  ** first_name - Строка -
//  ** last_name - Строка -
//  ** email - Строка -
//  * email - Строка -
Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * publication_variants - Массив из Структура:
// ** appearance - Структура:
// *** description - Строка
// *** title - Строка
// ** available_publications_count - Число
// ** suitable_packages - Массив из Структура:
// *** count - Число
// ** vacancy_properties - Структура:
// *** required - Массив из Структура:
// **** property_type - Строка
Функция ПрочитатьОтветВариантыПубликации(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Соответствие
Функция ПрочитатьРезультатПоискаКандидатов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * access_token - Строка
//  * refresh_token - Строка
//  * expires_in - Число
Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * items - Массив из Структура:
// ** id - Строка
// ** access - Структура:
// *** has_access - Булево
Функция ПрочитатьОтветПлатныеМетоды(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * found - Число
//  * items - Массив из Структура:
//  ** id - Число
Функция ПрочитатьОтветВакансииССайта(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Соответствие
Функция ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
// Структура:
// * states - Массив из Структура:
// ** id - Строка
Функция ПрочитатьОтветКоллекцияОткликов(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * items - Массив из Структура:
// ** updated_at - Строка
// ** resume - Структура:
// *** id - Строка
// *** last_name - Строка
// *** first_name - Строка
// *** middle_name - Строка
// *** last_name - Строка
// *** alternate_url - Строка
// *** can_view_full_info - Булево
// *** area - Структура:
// **** name - Строка
Функция ПрочитатьОтветОтклики(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Соответствие
Функция ПрочитатьОтветРезюмеССайта(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Соответствие
Функция ПрочитатьОтветСообщения(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса, Истина);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * items - Массив из Структура:
// ** created_at - Строка
// ** access_type - Структура:
// *** id - Строка
// ** id - Строка
// ** text - Строка
// ** author - Структура:
// *** full_name - Строка
// ** is_mine - Булево
Функция ПрочитатьОтветКомментарииКандидата(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
// 
// Возвращаемое значение:
//  Структура:
// * errors - Массив из Структура:
// ** type - Строка
// ** value - Строка
Функция ПрочитатьОтветСОшибкой(СтрокаJSON)
	
	Возврат ПарсерJSON(СтрокаJSON);
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
// 
// Возвращаемое значение:
//  Структура:
// * comments - Структура:
// ** url - Строка
Функция ПрочитатьПолеOwner(СтрокаJSON)
	
	Возврат ПарсерJSON(СтрокаJSON);
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
//  ПрочитатьВСоответствие - Булево
// 
// Возвращаемое значение:
//  см. РекрутинговыеСайтыСлужебный.ПарсерJSON
Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь)
	
	Возврат РекрутинговыеСайтыСлужебный.ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	
КонецФункции

// Параметры:
//  КодСостояния - Число
//  ОписаниеОшибки - Строка
// 
// Возвращаемое значение:
//  Строка
Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Если СтрНайти(ОписаниеОшибки, "vacancy_not_found") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеНенайденнойВакансии();
	ИначеЕсли СтрНайти(ОписаниеОшибки, "not_enough_purchased_services") <> 0 Тогда
		УточненноеОписаниеОшибки =
			НСтр("ru = 'Публикация вакансий из программы доступна только при наличии оплаченного пакета услуг по размещению вакансий.
				|Пожалуйста, убедитесь что в личном кабинете компании на сайте есть активные оплаченные услуги по размещению вакансий, и повторите попытку.'");
	ИначеЕсли СтрНайти(ОписаниеОшибки, "invalid_grant") <> 0 Или СтрНайти(ОписаниеОшибки, "token not found") <> 0 Тогда
		УточненноеОписаниеОшибки = РекрутинговыеСайтыСлужебный.ОписаниеОшибкиАвторизации();
	ИначеЕсли СтрНайти(ОписаниеОшибки, "api_access_payment") <> 0 Тогда
		УточненноеОписаниеОшибки = ОписаниеНеоплаченногоПИ();
	Иначе
		ПолноеОписание = "";
		Ошибки = Новый Массив;
		
		Попытка
			ИнформацияОбОшибках = ПрочитатьОтветСОшибкой(ОписаниеОшибки);
		Исключение
			ПолноеОписание = НСтр("ru = 'Произошла неизвестная ошибка сервера zarplata.ru.'");
		КонецПопытки;
		
		Если Не ЗначениеЗаполнено(ПолноеОписание) Тогда
			Если ТипЗнч(ИнформацияОбОшибках) = Тип("Структура") 
				И ИнформацияОбОшибках.Свойство("errors") 
				И ЗначениеЗаполнено(ИнформацияОбОшибках.errors) Тогда
				
				Если ТипЗнч(ИнформацияОбОшибках.errors) = Тип("Массив") Тогда
					Ошибки = ИнформацияОбОшибках.errors;
				Иначе
					Ошибки.Добавить(ИнформацияОбОшибках.errors);
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого Ошибка Из Ошибки Цикл
				Если КодСостояния = 400 И Ошибка.type = "bad_json_data" Тогда
					Поле = РекрутинговыеСайтыСлужебный.ПредставлениеПоля(Сайт, ЭтотОбъект, Ошибка.value);
					ПолноеОписание =
						ПолноеОписание
						+ ?(ЗначениеЗаполнено(ПолноеОписание), Символы.ПС, "")
						+ РекрутинговыеСайтыСлужебный.ОписаниеНезаполненногоПоля(Поле);
				ИначеЕсли Ошибка.Свойство("value") И Ошибка.value = "bad_authorization" Тогда
					ПолноеОписание = 
						ПолноеОписание
						+ ?(ЗначениеЗаполнено(ПолноеОписание), Символы.ПС, "")
						+ РекрутинговыеСайтыСлужебный.ОписаниеОшибкиАвторизации();
				ИначеЕсли ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Ошибка, "type") = "negotiations" Тогда
					ОшибкаОбратнойСвязи = "";
					
					ЗначениеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Ошибка, "value");
					Если ЗначениеОшибки = "wrong_state" Тогда
						ОшибкаОбратнойСвязи = НСтр("ru = 'Действие невозможно из-за текущего состояния отклика.'");
					ИначеЕсли ЗначениеОшибки = "resume_not_found" Тогда
						ОшибкаОбратнойСвязи = НСтр("ru = 'Резюме из отклика было скрыто либо удалено соискателем.'");
					ИначеЕсли ЗначениеОшибки = "invalid_vacancy" Тогда
						ОшибкаОбратнойСвязи = НСтр("ru = 'Вакансия из отклика была архивирована либо скрыта.'");
					ИначеЕсли ЗначениеОшибки = "limit_exceeded" Тогда
						ОшибкаОбратнойСвязи = НСтр("ru = 'Превышен лимит менеджера на количество приглашений в сутки.'");
					Иначе
						ОшибкаОбратнойСвязи = Ошибка.value;
					КонецЕсли;
					
					ПолноеОписание =
						ПолноеОписание
						+ ?(ЗначениеЗаполнено(ПолноеОписание), Символы.ПС, "")
						+ ОшибкаОбратнойСвязи;
				ИначеЕсли Ошибка.Свойство("value") Тогда
					ПолноеОписание = ПолноеОписание + ?(ЗначениеЗаполнено(ПолноеОписание), Символы.ПС, "") + Ошибка.value;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		УточненноеОписаниеОшибки = ?(ЗначениеЗаполнено(ПолноеОписание), Символы.ПС + ПолноеОписание, ОписаниеОшибки);
	КонецЕсли;
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

// Возвращаемое значение:
// Структура
Функция ЗагрузитьОбщиеКлассификаторы()
	
	Классификаторы = Неопределено;
	
	Запрос = НовыйHTTPЗапрос("/dictionaries");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеЗагрузкиКлассификаторов(Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Классификаторы = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Возврат Классификаторы;
	
КонецФункции

Функция ЗагрузитьКлассификаторПрофессиональныхРолей()
	
	Классификатор = Неопределено;
	
	Запрос = НовыйHTTPЗапрос("/professional_roles");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки классификатора профессиональных ролей с сайта %1.'"), Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Классификатор = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Возврат Классификатор;
	
КонецФункции

Функция ЗагрузитьКлассификаторРегионов()
	
	Классификатор = Неопределено;
	
	Запрос = НовыйHTTPЗапрос("/areas");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки классификатора регионов с сайта %1.'"), Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		Классификатор = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Возврат Классификатор;
	
КонецФункции

// Параметры:
//  ИдентификаторКомпании - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Массив из Структура:
// * id - Число
// * city - Строка
// * street - Строка
// * building - Строка
// * name - Строка
// * raw - Строка
Функция ЗагрузитьАдресаПользователя(ИдентификаторКомпании)
	
	АдресаПользователя = Неопределено;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки адресов пользователя с сайта %1.'"), Сайт);
	АдресаПользователя = СправочникZarplata("/employers/" + ИдентификаторКомпании + "/addresses", ТекстСообщения);
	
	Возврат АдресаПользователя;
	
КонецФункции

// Параметры:
//  ИдентификаторКомпании - Строка
// 
// Возвращаемое значение:
//  Неопределено, Структура -
Функция ЗагрузитьМенеджеровПользователя(ИдентификаторКомпании)
	
	МенеджерыПользователя = Неопределено;
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки менеджеров пользователя с сайта %1.'"), Сайт);
	МенеджерыПользователя = СправочникZarplata("/employers/" + ИдентификаторКомпании + "/managers", ТекстСообщения);
	
	Возврат МенеджерыПользователя;
	
КонецФункции

// Параметры:
//  ИдентификаторКомпании - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура:
// * items - Массив из Строка
Функция ЗагрузитьДепартаментыПользователя(ИдентификаторКомпании)
	
	ДепартаментыПользователя = Неопределено;
	
	Запрос = НовыйHTTPЗапрос("/employers/" + ИдентификаторКомпании + "/departments");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки департаментов пользователя с сайта %1.'"), Сайт);
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		ДепартаментыПользователя = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	КонецЕсли;
	
	Возврат ДепартаментыПользователя;
	
КонецФункции

// Параметры:
//  ТекстЗапроса - Строка
//  ШаблонОшибки - Строка
// 
// Возвращаемое значение:
//  Неопределено, Структура, Массив -
Функция СправочникZarplata(ТекстЗапроса, ТекстСообщенияОбОшибке)
	
	ШаблонСтрокиПараметров = "page=%1&per_page=20";
	Если СтрНайти(ТекстЗапроса, "?") > 0 Тогда
		ШаблонСтрокиПараметров = "&" + ШаблонСтрокиПараметров;
	Иначе
		ШаблонСтрокиПараметров = "?" + ШаблонСтрокиПараметров;
	КонецЕсли;
	
	Результат = Неопределено;
	
	ОбъектJSON = ОбъектJSONСправочникаZarplata(ТекстЗапроса + СтрШаблон(ШаблонСтрокиПараметров, 0), ТекстСообщенияОбОшибке);
	Если ОбъектJSON = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбъектJSON.items;
	
	Если ОбъектJSON.Свойство("pages") Тогда
		КоличествоСтраниц = ОбъектJSON.pages - 1;
		Для НомерСтраницы = 1 По КоличествоСтраниц Цикл
			ОбъектJSON = ОбъектJSONСправочникаZarplata(ТекстЗапроса + СтрШаблон(ШаблонСтрокиПараметров, НомерСтраницы), ТекстСообщенияОбОшибке);
			Если ОбъектJSON = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, ОбъектJSON.items);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ТекстЗапроса - Строка
//  ШаблонОшибки - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура:
// * items - Структура:
// ** id - Строка
// ** manager_id - Строка
// ** first_name - Строка
// ** last_name - Строка
// ** email - Строка
// * email - Строка
// * pages - Число
Функция ОбъектJSONСправочникаZarplata(ТекстЗапроса, ТекстСообщенияОбОшибке)
	
	Результат = Неопределено;
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос, Ложь);
	
	Если РезультатЗапроса.Ошибка Тогда
		РекрутинговыеСайтыСлужебный.ЗарегистрироватьОшибкуОбращенияКРекрутинговомуСайту(РезультатЗапроса.ИнформацияОбОшибке, Ложь);
		Возврат Результат;
	КонецЕсли;
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщенияОбОшибке, Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПарсерJSON(РезультатЗапроса.ТелоОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

// Параметры:
//  id - Неопределено, Число -
//  name - Неопределено, Строка -
// 
// Возвращаемое значение:
//  Структура:
// * id - Неопределено, Число -
// * name - Неопределено, Строка -
Функция СтруктураДанных(id = Неопределено, name = Неопределено)
	
	Возврат Новый Структура("id, name", id, name);
	
КонецФункции

// Структура резюме с сайта.
// 
// Параметры:
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * Комментарии - См. МассивКомментариевКандидата
//  * Фото - Произвольный
Функция СтруктураРезюмеССайта(ИдентификаторРезюме)
	
	Резюме = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Резюме;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("/resumes/" + ИдентификаторРезюме);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 404 Тогда
		ВызватьИсключение НСтр("ru = 'Нет доступа. Пользователь скрыл или удалил это резюме.'");
	ИначеЕсли РезультатЗапроса.КодСостояния <> 200 Тогда
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстОшибкиПоОписанию(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Резюме = ПрочитатьОтветРезюмеССайта(РезультатЗапроса);
	
	ИнформацияПользователя = ИнформацияОПользователе();
	АдресКомментариев = ЗначениеСвойстваУзла(Резюме, "owner", "comments", "url");
	КомментарииКандидата = МассивКомментариевКандидата(АдресКомментариев, ИнформацияПользователя.ИдентификаторКомпании);
	
	Резюме.Вставить("Комментарии", КомментарииКандидата);
	
	АдресФото = ЗначениеСвойстваУзла(Резюме, "photo", "medium");
	Если ЗначениеЗаполнено(АдресФото) Тогда
		Резюме.Вставить("Фото", РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресФото));
	КонецЕсли;
	
	АдресФайлаРезюме = ЗначениеСвойстваУзла(Резюме, "download", "pdf", "url");
	Если ЗначениеЗаполнено(АдресФайлаРезюме) Тогда
		Запрос = НовыйHTTPЗапрос(СтрЗаменить(АдресФайлаРезюме, СтрШаблон("%1%2", "https://", АдресСервера()), ""));
		
		Адрес = РекрутинговыеСайтыСлужебный.СкачатьФайл(Соединение, Запрос);
		
		ФайлРезюме = ПодборПерсоналаКлиентСервер.ОписаниеФайлаРезюме();
		ФайлРезюме.Хранение = Адрес;
		
		Резюме.Вставить("ФайлРезюме", ФайлРезюме);
	КонецЕсли;
	
	Возврат Резюме;
	
КонецФункции

// Параметры:
//  АдресКомментариев - Строка
//  ИдентификаторКомпании - Строка
//  Кандидат - Неопределено, СправочникСсылка.Кандидаты -
// 
// Возвращаемое значение:
//  Массив из Структура - Массив комментариев кандидата
Функция МассивКомментариевКандидата(АдресКомментариев, ИдентификаторКомпании, Кандидат = Неопределено)
	
	КомментарииТаблица = КомментарииКандидата(АдресКомментариев, ИдентификаторКомпании, Кандидат);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(КомментарииТаблица);
	
КонецФункции

// Параметры:
//  АдресКомментариев - Строка
//  ИдентификаторКомпании - Строка
//  Кандидат - Неопределено, СправочникСсылка.Кандидаты -
// 
// Возвращаемое значение:
//  ТаблицаЗначений: см. РекрутинговыеСайтыСлужебный.ТаблицаКомментарииКандидатов
Функция КомментарииКандидата(АдресКомментариев, ИдентификаторКомпании, Кандидат = Неопределено)
	
	Комментарии = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	ЧастиАдреса = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(АдресКомментариев);
	ИдентификаторРезюме = ЧастиАдреса[ЧастиАдреса.ВГраница()];
	
	МестоПубликации = Сайт;
	
	ТекстЗапроса = "/applicant_comments/" + ИдентификаторРезюме;
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос, Ложь);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(
			НСтр("ru = 'Не удалось получить комментарии кандидата.'"), Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат Комментарии;
	ИначеЕсли РезультатЗапроса.Ошибка Тогда
		РекрутинговыеСайтыСлужебный.ЗарегистрироватьОшибкуОбращенияКРекрутинговомуСайту(РезультатЗапроса.ИнформацияОбОшибке, Ложь);
		Возврат Комментарии;
	КонецЕсли;
	
	Комментарии = РекрутинговыеСайтыСлужебный.ТаблицаКомментарииКандидатов();
	
	КоллекцияКомментариев = ПрочитатьОтветКомментарииКандидата(РезультатЗапроса);
	
	Для Каждого ОписаниеКомментария Из КоллекцияКомментариев.items Цикл
		НоваяСтрока = Комментарии.Добавить();
		НоваяСтрока.Период = ДатаПоСтроке(ОписаниеКомментария.created_at);
		Если ОписаниеКомментария.access_type.id = "owner" Тогда
			НоваяСтрока.ТолькоДляАвтора = Истина;
		КонецЕсли;
		НоваяСтрока.Идентификатор = ОписаниеКомментария.id;
		НоваяСтрока.Комментарий = ОписаниеКомментария.text;
		НоваяСтрока.Автор = ОписаниеКомментария.author.full_name;
		НоваяСтрока.ПринадлежитАвторизованномуПользователю = ОписаниеКомментария.is_mine;
		НоваяСтрока.МестоПубликации = МестоПубликации;
	КонецЦикла;
	
	Если Не РекрутинговыеСайтыСлужебный.ЕстьИзмененияКомментариев(Кандидат, МестоПубликации, Комментарии) Тогда
		Возврат Комментарии;
	КонецЕсли;
	
	ПодобратьПользователейПоАвторамКомментариев(Комментарии, ИдентификаторКомпании);
	
	Возврат Комментарии;
	
КонецФункции

// Параметры:
//  СтрокаJSON -  Строка
// 
// Возвращаемое значение:
//  Дата
Функция ДатаПоСтроке(СтрокаJSON)
	
	Возврат Дата(СтрЗаменить(Лев(СтрокаJSON, 10), "-", "") + СтрЗаменить(Сред(СтрокаJSON, 12, 8), ":", ""));
	
КонецФункции

Процедура ПодобратьПользователейПоАвторамКомментариев(Комментарии, ИдентификаторКомпании)
	
	ОтборСтрок = Новый Структура("ПринадлежитАвторизованномуПользователю", Ложь);
	
	НайденныеСтроки = Комментарии.НайтиСтроки(ОтборСтрок);
	Если НайденныеСтроки.Количество() = 0 Тогда
		// Все комментарии принадлежат текущему пользователю.
		Комментарии.ЗаполнитьЗначения(Пользователи.АвторизованныйПользователь(), "Пользователь");
		Возврат;
	КонецЕсли;
	
	АвторыКомментариев = ОбщегоНазначения.ВыгрузитьКолонку(НайденныеСтроки, "Автор", Истина);
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка загрузки менеджеров пользователя с сайта %1.'"), Сайт);
	МенеджерыПользователя = СправочникZarplata("/employers/" + ИдентификаторКомпании + "/managers", ТекстСообщения);
	
	АдресаАвторов = РекрутинговыеСайтыСлужебный.НоваяТаблицаАдресаАвторов();
	Если ЗначениеЗаполнено(МенеджерыПользователя) Тогда
		Для Каждого ОписаниеМенеджера Из МенеджерыПользователя Цикл
			Если АвторыКомментариев.Найти(ОписаниеМенеджера.name) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = АдресаАвторов.Добавить();
			НоваяСтрока.ИмяАвтора = ОписаниеМенеджера.name;
			НоваяСтрока.АдресПочты = ОписаниеМенеджера.email;
		КонецЦикла;
	КонецЕсли;
	
	ПользователиПоАвторам = РекрутинговыеСайтыСлужебный.ПользователиПоАвторам(АдресаАвторов);
	
	Для Каждого Строка Из Комментарии Цикл
		Если Строка.ПринадлежитАвторизованномуПользователю = Истина Тогда
			Строка.Пользователь = Пользователи.АвторизованныйПользователь();
			Продолжить;
		КонецЕсли;
		ПользовательАвтор = ПользователиПоАвторам[Строка.Автор]; // СправочникСсылка.Пользователи
		Если ПользовательАвтор <> Неопределено Тогда
			Строка.Пользователь = ПользовательАвтор;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  СтруктураРезюме - Структура: см. СтруктураРезюмеССайта
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата
Функция ДанныеКандидатаПоРезюме(СтруктураРезюме)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	ДатаРождения = ЗначениеСвойстваУзла(СтруктураРезюме, "birth_date");
	ДанныеКандидата.ДатаРождения = ?(ЗначениеЗаполнено(ДатаРождения), Дата(СтрЗаменить(ДатаРождения, "-", "")), Дата(1, 1, 1));
	
	ДанныеКандидата.Гражданство.Очистить();
	Для Каждого Гражданство Из ЗначениеСвойстваУзла(СтруктураРезюме, "citizenship") Цикл
		СтруктураГражданство = Новый Структура("Страна, Дата");
		СтруктураГражданство.Страна = ЗначениеСвойстваУзла(Гражданство, "name");
		ДанныеКандидата.Гражданство.Добавить(СтруктураГражданство);
	КонецЦикла;
	
	ДанныеКандидата.КонтактнаяИнформация = КонтактнаяИнформацияРезюме(СтруктураРезюме);

	ДанныеКандидата.Образование.Очистить();
	ЗаполнитьМассивОбразование(СтруктураРезюме, ДанныеКандидата.Образование);
	
	ДанныеКандидата.ТрудоваяДеятельность.Очистить();
	Для Каждого ТрудоваяДеятельность Из ЗначениеСвойстваУзла(СтруктураРезюме, "experience") Цикл
		Если ТрудоваяДеятельность = Неопределено 
			Или ТрудоваяДеятельность = "null" Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТД = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
		СтрокаТД.Компания = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "company");
		СтрокаТД.ДатаНачала = РекрутинговыеСайтыСлужебный.МесяцСтрокойВДату(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "start"));
		СтрокаТД.ДатаОкончания = РекрутинговыеСайтыСлужебный.МесяцСтрокойВДату(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "end"));
		СтрокаТД.Должность = ЗначениеСвойстваУзла(ТрудоваяДеятельность, "position"); 
		СтрокаТД.Обязанности = РекрутинговыеСайтыСлужебный.УдалитьЛишнееИзСтроки(ЗначениеСвойстваУзла(ТрудоваяДеятельность, "description"));
		СфераДеятельностиСтрокой = "";
		Для Каждого СфераДеятельности Из ЗначениеСвойстваУзла(ТрудоваяДеятельность, "industries") Цикл
			Если СфераДеятельности = Неопределено 
				Или СфераДеятельности = "null" Тогда
				Продолжить;
			КонецЕсли;
			Если ЗначениеЗаполнено(СфераДеятельностиСтрокой) Тогда
				СфераДеятельностиСтрокой = СфераДеятельностиСтрокой + ", ";
			КонецЕсли;
			СфераДеятельностиСтрокой = СфераДеятельностиСтрокой + ЗначениеСвойстваУзла(СфераДеятельности, "name");
		КонецЦикла;
		СтрокаТД.СфераДеятельностиКомпании = СфераДеятельностиСтрокой;
		ДанныеКандидата.ТрудоваяДеятельность.Добавить(СтрокаТД);
	КонецЦикла;
	
	ЗаполнитьДоступностьКонтактов(ДанныеКандидата.ДоступностьКонтактов, СтруктураРезюме);
	
	ДанныеКандидата.Фамилия = ЗначениеСвойстваУзла(СтруктураРезюме, "last_name");
	ДанныеКандидата.Имя = ЗначениеСвойстваУзла(СтруктураРезюме, "first_name");
	ДанныеКандидата.Отчество = ЗначениеСвойстваУзла(СтруктураРезюме, "middle_name");
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "gender")) Тогда
		Если ЗначениеСвойстваУзла(СтруктураРезюме, "gender", "id") = "male" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли ЗначениеСвойстваУзла(СтруктураРезюме, "gender", "id") = "female" Тогда
			ДанныеКандидата.Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "salary")) Тогда
		ДанныеКандидата.ОжидаемыйДоход = ЗначениеСвойстваУзла(СтруктураРезюме, "salary", "amount");
		ДанныеКандидата.ВалютаДохода =
			ПодборПерсонала.ВалютаПоСправочнику(ЗначениеСвойстваУзла(СтруктураРезюме, "salary", "currency"));
	КонецЕсли;
	
	ДанныеКандидата.ЗнаниеЯзыков.Очистить();
	Для Каждого ЗнаниеЯзыка Из ЗначениеСвойстваУзла(СтруктураРезюме, "language") Цикл
		СтруктураЗнаниеЯзыков = РекрутинговыеСайтыСлужебный.НовоеЗнаниеЯзыка();
		СтруктураЗнаниеЯзыков.Язык = ЗначениеСвойстваУзла(ЗнаниеЯзыка, "name");
		СтруктураЗнаниеЯзыков.СтепеньЗнанияЯзыкаКандидата = 
			СтепеньЗнанияЯзыкаПоИдентификатору(ЗначениеСвойстваУзла(ЗнаниеЯзыка, "level", "id"));
		ДанныеКандидата.ЗнаниеЯзыков.Добавить(СтруктураЗнаниеЯзыков);
	КонецЦикла;
	
	ДанныеКандидата.ИсточникИнформации = Сайт;
	ДанныеКандидата.АдресРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "alternate_url");
	ДанныеКандидата.Фото = ЗначениеСвойстваУзла(СтруктураРезюме, "Фото");
	ДанныеКандидата.Комментарии = СтруктураРезюме["Комментарии"];
	ДанныеКандидата.НазваниеРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "title");
	
	СтрокаОСебе = ЗначениеСвойстваУзла(СтруктураРезюме, "skills");
	Если ЗначениеЗаполнено(СтрокаОСебе) Тогда
		РекрутинговыеСайтыСлужебный.ЗаменитьУпрСимволы(СтрокаОСебе);
		ДанныеКандидата.ОСебе = СтрокаОСебе;
	КонецЕсли;
	
	ФайлРезюме = ЗначениеСвойстваУзла(СтруктураРезюме, "ФайлРезюме");
	Если ЗначениеЗаполнено(ФайлРезюме) И ЭтоАдресВременногоХранилища(ФайлРезюме.Хранение) Тогда
		ДвоичныеДанныеФайлаРезюме = ПолучитьИзВременногоХранилища(ФайлРезюме.Хранение);
		Если ДвоичныеДанныеФайлаРезюме <> Неопределено Тогда
			ФайлРезюме.ИмяФайла = СтрШаблон(
				НСтр("ru = 'Резюме %1 Зарплата.ру %2.pdf'"),
				ФизическиеЛицаКлиентСервер.ФамилияИнициалы(
					СтрШаблон("%1 %2 %3", ДанныеКандидата.Фамилия, ДанныеКандидата.Имя, ДанныеКандидата.Отчество)),
				Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yy;"));

			ВременноеИмяФайла = СтрШаблон("%1%2", КаталогВременныхФайлов(), ФайлРезюме.ИмяФайла);
			ДвоичныеДанныеФайлаРезюме.Записать(ВременноеИмяФайла);
			ФайлРезюме.ПолноеИмя = ВременноеИмяФайла;
			
			ДанныеКандидата.ФайлРезюме = ФайлРезюме;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеКандидата;
	
КонецФункции

Процедура ЗаполнитьМассивОбразование(СтруктураРезюме, МассивОбразование)
	
	ДанныеОбОбразовании = СтруктураРезюме.Получить("education");
	
	Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(ДанныеОбОбразовании, "level")) Тогда
		Возврат;
	КонецЕсли;
	
	УровеньОбразования = ВидОбразованияПоИдентификатору(ЗначениеСвойстваУзла(ДанныеОбОбразовании, "level", "id"));
	УровеньДопОбразования = Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование;
	ВидДополнительногоОбучения = Перечисления.ВидыПрофессиональнойПодготовки.ПовышениеКвалификации;
	
	Если УровеньОбразования = Справочники.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование Тогда
		
		Для Каждого Образование Из ДанныеОбОбразовании.Получить("elementary") Цикл
			
			Если Не ЗначениеЗаполнено(Образование) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
			СтруктураОбразование.УчебноеЗаведение = Образование.Получить("name");
			СтруктураОбразование.Окончание = Образование.Получить("year");
			СтруктураОбразование.ВидОбразования = УровеньОбразования;
			
			МассивОбразование.Добавить(СтруктураОбразование);
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Образование Из ДанныеОбОбразовании.Получить("primary") Цикл
			
			СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
			СтруктураОбразование.УчебноеЗаведение = Образование.Получить("name");
			СтруктураОбразование.Факультет = Образование.Получить("organization");
			СтруктураОбразование.Специальность = Образование.Получить("result");
			СтруктураОбразование.Окончание = Образование.Получить("year");
			СтруктураОбразование.ВидОбразования = УровеньОбразования;
			
			МассивОбразование.Добавить(СтруктураОбразование);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ДопОбразование Из ДанныеОбОбразовании.Получить("additional") Цикл
		
		Если Не ЗначениеЗаполнено(ДопОбразование) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		СтруктураОбразование.УчебноеЗаведение = ДопОбразование.Получить("organization");
		СтруктураОбразование.НаименованиеКурса = ДопОбразование.Получить("name");
		СтруктураОбразование.Окончание = ДопОбразование.Получить("year");
		СтруктураОбразование.Квалификация = ДопОбразование.Получить("result");
		СтруктураОбразование.ВидОбразования = УровеньДопОбразования;
		СтруктураОбразование.ВидДополнительногоОбучения = ВидДополнительногоОбучения;
		
		МассивОбразование.Добавить(СтруктураОбразование);
		
	КонецЦикла
	
КонецПроцедуры

// Параметры:
//  Узел - Структура
//  ИмяСвойства - Строка
//  ИмяСвойстваВторогоУровня - Неопределено, Строка -
//  ИмяСвойстваТретьегоУровня - Неопределено, Строка -
//  ЗначениеПоУмолчанию - Строка
// 
// Возвращаемое значение:
//  Строка, Массив, Произвольный -
Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

Процедура ЗаполнитьДоступностьКонтактов(ДоступностьКонтактов, СтруктураРезюме)
	
	Если ЗначениеСвойстваУзла(СтруктураРезюме, "can_view_full_info") <> Ложь Тогда
		Возврат;
	КонецЕсли;

	ДоступностьКонтактов.КонтактыОткрыты = Ложь;
	Если ЗначениеСвойстваУзла(СтруктураРезюме, "actions", "get_with_contact") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДоступностьКонтактов.КонтактыМожноОткрытьПоАдресу = ЗначениеСвойстваУзла(СтруктураРезюме, "actions", "get_with_contact", "url");
	Если ТипЗнч(ЗначениеСвойстваУзла(СтруктураРезюме, "hidden_fields",)) = Тип("Массив")
		И ЗначениеСвойстваУзла(СтруктураРезюме, "hidden_fields").Количество() > 0 Тогда
		ДоступностьКонтактов.СкрытыеКандидатомКонтакты = 
			ОбщегоНазначения.ВыгрузитьКолонку(ЗначениеСвойстваУзла(СтруктураРезюме, "hidden_fields"), "name");
	КонецЕсли;
	
КонецПроцедуры

Функция СтепеньЗнанияЯзыкаПоИдентификатору(Идентификатор)
	
	Если Идентификатор = "basic" Или СтрНайти(ВРег(Идентификатор), "A1") > 0 Тогда // базовые знания
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли СтрНайти(ВРег(Идентификатор), "A2") > 0 Тогда
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.A1;
	ИначеЕсли Идентификатор = "can_read" Или СтрНайти(ВРег(Идентификатор), "B1") > 0 Тогда // читаю профессиональную литературу
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B1;
	ИначеЕсли Идентификатор = "can_pass_interview" Или СтрНайти(ВРег(Идентификатор), "B2") > 0 Тогда  // могу проходить интервью
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.B2;
	ИначеЕсли Идентификатор = "fluent" Или СтрНайти(ВРег(Идентификатор), "C1") > 0 Тогда // свободно владею
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C1;
	ИначеЕсли Идентификатор = "native" Или Идентификатор = "l1" Или СтрНайти(ВРег(Идентификатор), "C2") > 0 Тогда // родной
		УровеньВладенияЯзыком = Перечисления.УровниВладенияЯзыком.C2;
	Иначе
		УровеньВладенияЯзыком = Неопределено;
	КонецЕсли;
	
	Если УровеньВладенияЯзыком = Неопределено Тогда
		СтепеньЗнанияЯзыка = Справочники.СтепениЗнанияЯзыкаКандидата.ПустаяСсылка();
	Иначе
		СтепеньЗнанияЯзыка = Справочники.СтепениЗнанияЯзыкаКандидата.СтепеньЗнанияЯзыкаПоУровнюВладения(
			УровеньВладенияЯзыком);
	КонецЕсли;
	
	Возврат СтепеньЗнанияЯзыка;
	
КонецФункции

// Параметры:
//  СтруктураОтбора - Структура
//  НомерСтраницы - Число
// 
// Возвращаемое значение:
// Строка
Функция СтрокаОтбора(СтруктураОтбора, НомерСтраницы)
	
	СтрокаОтбора = "";
	
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = КлючИЗначение.Значение;
		
		Если ТипЗнч(Значение) = Тип("Строка") Тогда
			Значение = Значение;
		ИначеЕсли ТипЗнч(Значение) = Тип("Число") Тогда
			Значение = Формат(Значение, "ЧГ=0");
		ИначеЕсли ТипЗнч(Значение) = Тип("Дата") Тогда
			Значение = Формат(Значение, "ДЛФ=Д");
		ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
			Если КлючИЗначение.Ключ = "ТолькоВНазвании" И Значение Тогда
				СтрокаОтбора = СтрокаОтбора + "text.logic=phrase&text.field=title&text.period=all_time&";
			ИначеЕсли КлючИЗначение.Ключ = "СкрыватьРезюмеБезЗарплаты" И Значение Тогда
				СтрокаОтбора = СтрокаОтбора + "label=only_with_salary&";
			КонецЕсли;
			Продолжить;
		ИначеЕсли ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
			
			Для Каждого ЭлементСписка Из Значение Цикл
				Идентификатор = "";
				
				Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
					Если Не ЭлементСписка.Значение.Свойство("IDZarplata", Идентификатор) Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					Идентификатор = ЭлементСписка.Значение;
				КонецЕсли;
				
				СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), Строка(Идентификатор));
			КонецЦикла;
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаОтбора = СтрокаОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1=%2&", СоответствиеПолейПоискаКандидатов().Получить(КлючИЗначение.Ключ), Значение);
		
	КонецЦикла;
	
	СтрокаОтбора = СтрокаОтбора + "order_by=relevance&per_page=50&page=" + НомерСтраницы;
	
	Возврат СтрокаОтбора;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Обновление - Булево
// 
// Возвращаемое значение:
//  Строка
Функция JSONОписаниеВакансии(Дерево, Обновление = Ложь)
	
	СтрокаJSON = "";
	
	СтруктураОписанияВакансии = СтруктураОписанияВакансии(Дерево, Обновление);
	СтрокаJSON = РекрутинговыеСайтыСлужебный.ЗаписьJSON(СтруктураОписанияВакансии);
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция СтруктураОписанияВакансии(Дерево, Обновление = Ложь)
	
	ПоляВакансии = Новый Структура;
	ПоляСТекстомВHTML = ПоляВакансииСТекстомВHTML();
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ТипЗнч(СтрокаДерева.Показатель) = Тип("СправочникСсылка.Вакансии") Тогда
			Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
				Если СтрокаДереваПодчиненная.ТипРеквизита = "Строка" Тогда
					Если Обновление 
						И Не СтрокаДереваПодчиненная.СтрокаИзменена Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) Тогда
						
						Если ПоляСТекстомВHTML.Найти(СтрокаДереваПодчиненная.Путь) <> Неопределено Тогда
							ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансииТекст;
						Иначе
							ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии;
						КонецЕсли;
						
						ПоляВакансии.Вставить(СтрокаДереваПодчиненная.Путь, ЗначениеПоля);
						
					КонецЕсли;
					
				ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = "Булево" Тогда
					Если Обновление 
						И Не СтрокаДереваПодчиненная.СтрокаИзменена Тогда
						Продолжить;
					КонецЕсли;
					
					ПоляВакансии.Вставить(СтрокаДереваПодчиненная.Путь, СтрокаДереваПодчиненная.ПубликацияВакансии);
					
				ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоОбъекта() Тогда
					НомерВхожденияТочки = РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(СтрокаДереваПодчиненная.Путь, ".");
					Если НомерВхожденияТочки > 0 Тогда
						Если Обновление 
							И Не СтрокаДереваПодчиненная.СтрокаИзменена Тогда
							Продолжить;
						КонецЕсли;
						
						ИмяОбъекта = Лев(СтрокаДереваПодчиненная.Путь, НомерВхожденияТочки - 1);
						РеквизитОбъекта = Сред(СтрокаДереваПодчиненная.Путь, НомерВхожденияТочки + 1, СтрДлина(СтрокаДереваПодчиненная.Путь) - НомерВхожденияТочки);
						
						СтруктураОбъекта = Новый Структура;
						Если ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("СписокЗначений") 
							И СтрокаДереваПодчиненная.ПубликацияВакансии.Количество() = 1 
							И ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии[0].Значение) Тогда
							
							Значение = СтрокаДереваПодчиненная.ПубликацияВакансии[0].Значение;
							Если СтрокаДереваПодчиненная.Путь = "vacancy_properties.id" Тогда
								Свойства = Новый Массив();
								Для Каждого Свойство Из СтрРазделить(Значение, ",") Цикл
									Свойства.Добавить(Новый Структура("property_type", Свойство));
								КонецЦикла;
								СтруктураОбъекта.Вставить("properties", Свойства);
							Иначе
								СтруктураОбъекта.Вставить(РеквизитОбъекта, Значение);
							КонецЕсли;
							
							ПоляВакансии.Вставить(ИмяОбъекта, СтруктураОбъекта);
						КонецЕсли;
						
					Иначе
						
						ИмяОбъекта = СтрокаДереваПодчиненная.Путь;
						
						СтруктураОбъекта = Новый Структура;
						ОбъектИзменен = Ложь;
						Для Каждого СтрокаОбъекта Из СтрокаДереваПодчиненная.Строки Цикл
							
							ОбъектИзменен = ОбъектИзменен Или СтрокаОбъекта.СтрокаИзменена;
							
							НомерВхожденияТочки = РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(СтрокаОбъекта.Путь, ".");
							Если НомерВхожденияТочки > 0 Тогда
								РеквизитОбъекта = Сред(СтрокаОбъекта.Путь, НомерВхожденияТочки + 1, СтрДлина(СтрокаОбъекта.Путь) - НомерВхожденияТочки);
							Иначе	
								РеквизитОбъекта = СтрокаОбъекта.Путь;
							КонецЕсли;
							
							Если ТипЗнч(СтрокаОбъекта.ПубликацияВакансии) = Тип("СписокЗначений") Тогда 
								Если СтрокаОбъекта.ПубликацияВакансии.Количество() = 1 
									И ЗначениеЗаполнено(СтрокаОбъекта.ПубликацияВакансии[0].Значение) Тогда
									
									Если ТипЗнч(СтрокаОбъекта.ПубликацияВакансии[0].Значение) = Тип("Структура") Тогда
										ЗначениеПубликации = СтрокаОбъекта.ПубликацияВакансии[0].Значение;
										Если СтрокаОбъекта.Путь = "contacts.phones" Тогда
											ЗначениеПубликации = РекрутинговыеСайтыСлужебный.НомерТелефонаИзЦифр(ЗначениеПубликации);
										КонецЕсли;
										
										МассивОбъектов = Новый Массив;
										МассивОбъектов.Добавить(ЗначениеПубликации);
										СтруктураОбъекта.Вставить(РеквизитОбъекта, МассивОбъектов);
										
									Иначе
										Если СтрокаОбъекта.Путь = "salary_range.mode"
											Или СтрокаОбъекта.Путь = "salary_range.frequency" Тогда
											
											Значение = Новый Структура("id", СтрокаОбъекта.ПубликацияВакансии[0].Значение);
											СтруктураОбъекта.Вставить(РеквизитОбъекта, Значение);
										Иначе
											СтруктураОбъекта.Вставить(РеквизитОбъекта, СтрокаОбъекта.ПубликацияВакансии[0].Значение);
										КонецЕсли;
									КонецЕсли;
									
								ИначеЕсли  СтрокаОбъекта.ПубликацияВакансии.Количество() > 1 Тогда
									
									МассивОбъектов = Новый Массив;
									Для Каждого ЭлементСписка Из СтрокаОбъекта.ПубликацияВакансии Цикл
										
										Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
											МассивОбъектов.Добавить(ЭлементСписка.Значение);
										КонецЕсли;
										
									КонецЦикла;
									
									СтруктураОбъекта.Вставить(РеквизитОбъекта, МассивОбъектов);
								КонецЕсли;
							Иначе
								СтруктураОбъекта.Вставить(РеквизитОбъекта, СтрокаОбъекта.ПубликацияВакансии);
							КонецЕсли;
							
						КонецЦикла;
						
						Если Обновление 
							И Не ОбъектИзменен Тогда
							Продолжить;
						КонецЕсли;
						
						ПоляВакансии.Вставить(ИмяОбъекта, СтруктураОбъекта);
						
					КонецЕсли;
					
				ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоМассива() Тогда
					Если Обновление
						И Не СтрокаДереваПодчиненная.СтрокаИзменена Тогда
						Продолжить;
					КонецЕсли;
					
					МассивЭлементов = Новый Массив;
					НомерВхожденияТочки = РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(СтрокаДереваПодчиненная.Путь, ".");
					Если НомерВхожденияТочки > 0 Тогда
						ИмяМассива = Лев(СтрокаДереваПодчиненная.Путь, НомерВхожденияТочки - 1);
						ИмяЭлементаМассива = Сред(СтрокаДереваПодчиненная.Путь, НомерВхожденияТочки + 1, СтрДлина(СтрокаДереваПодчиненная.Путь) - НомерВхожденияТочки);
						
						Если ТипЗнч(СтрокаДереваПодчиненная.ПубликацияВакансии) = Тип("СписокЗначений") 
							И СтрокаДереваПодчиненная.ПубликацияВакансии.Количество() > 0 Тогда
							
							Для Каждого ЭлементСписка Из СтрокаДереваПодчиненная.ПубликацияВакансии Цикл
								Если ЗначениеЗаполнено(ЭлементСписка.Значение) Тогда
									СтруктураЭлементаМассива = Новый Структура;
									СтруктураЭлементаМассива.Вставить(ИмяЭлементаМассива, ЭлементСписка.Значение);
									
									МассивЭлементов.Добавить(СтруктураЭлементаМассива);
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						
						ПоляВакансии.Вставить(ИмяМассива, МассивЭлементов);
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Не Обновление Тогда
				СтруктураИнформацииОРаботодателе = Новый Структура;
				СтруктураИнформацииОРаботодателе.Вставить("id", ИдентификаторПользователя);
				ПоляВакансии.Вставить("employer", СтруктураИнформацииОРаботодателе);
			КонецЕсли;
			
			Если Не Обновление Тогда
				СтруктураИнформацииОСайте = Новый Структура;
				СтруктураИнформацииОСайте.Вставить("id", "zarplata");
				ПоляВакансии.Вставить("site", СтруктураИнформацииОСайте);
			КонецЕсли;
			
			// Проверим заполнение
			Если ПоляВакансии.Свойство("employment_form") Тогда
				Если ПоляВакансии.employment_form <> "FLY_IN_FLY_OUT" Тогда
					Если ПоляВакансии.Свойство("fly_in_fly_out_duration") Тогда
						ПоляВакансии.fly_in_fly_out_duration = Неопределено;
					КонецЕсли;
				Иначе
					Если ПоляВакансии.Свойство("internship") Тогда
						ПоляВакансии.internship = Неопределено;
					КонецЕсли;
					
					Если ПоляВакансии.Свойство("work_format") Тогда
						ФорматыРаботы = Новый Массив();
						
						Для Каждого ФорматРаботы Из ПоляВакансии.work_format Цикл
							Если ФорматРаботы.id = "REMOTE" Или ФорматРаботы.id = "HYBRID" Тогда
								Продолжить;
							КонецЕсли;
							ФорматыРаботы.Добавить(ФорматРаботы);
						КонецЦикла;
						
						ПоляВакансии.work_format = ФорматыРаботы;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоляВакансии;
	
КонецФункции

#Область ПоляВакансии

Функция ПоляВакансииСМножественнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("area.id");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСОдиночнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("professional_roles.id");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСоСпискомБезКлассификатора()
	
	Поля = Новый Массив;
	Поля.Добавить("key_skills.name");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("employment_form.id");
	Поля.Добавить("site.id");
	Поля.Добавить("salary_range.currency");
	Поля.Добавить("salary_range.mode");
	Поля.Добавить("salary_range.frequency");
	Поля.Добавить("experience.id");
	Поля.Добавить("address.id");
	Поля.Добавить("manager.id");
	Поля.Добавить("department.id");
	Поля.Добавить("vacancy_properties.id");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСМножественнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("fly_in_fly_out_duration.id");
	Поля.Добавить("work_format.id");
	Поля.Добавить("civil_law_contracts.id");
	Поля.Добавить("work_schedule_by_days.id");
	Поля.Добавить("working_hours.id");
	Поля.Добавить("driver_license_types.id");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииНедоступныеДляРедактирования()
	
	Поля = Новый Массив;
	Поля.Добавить("salary_range");
	Поля.Добавить("address");
	Поля.Добавить("contacts"); 
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСТекстомВHTML()
	
	Поля = Новый Массив;
	Поля.Добавить("description");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСоСпециальнойФормойРедактированияСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("contacts.phones");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

Функция СоответствиеПолейПоискаКандидатов()
	
	СоответствиеПолейПоиска = Новый Соответствие;
	
	СоответствиеПолейПоиска.Вставить("КлючевоеСлово", "text");
	СоответствиеПолейПоиска.Вставить("ВозрастОт", "age_from");
	СоответствиеПолейПоиска.Вставить("ВозрастДо", "age_to");
	СоответствиеПолейПоиска.Вставить("Регион", "area");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыОт", "salary_from");
	СоответствиеПолейПоиска.Вставить("УровеньЗарплатыДо", "salary_to");
	СоответствиеПолейПоиска.Вставить("Пол", "gender");
	СоответствиеПолейПоиска.Вставить("УровеньОбразования", "education_level");
	СоответствиеПолейПоиска.Вставить("ПериодРазмещения", "period");
	
	Возврат СоответствиеПолейПоиска;
	
КонецФункции

Функция РезюмеСКонтактами(АдресРезюме)
	
	Результат = Неопределено;
	
	ИдентификаторРезюме = ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
	Попытка
		Резюме = СтруктураРезюмеССайта(ИдентификаторРезюме);
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(Резюме) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПолнаяИнформацияДоступна = Резюме["can_view_full_info"];
	Если ПолнаяИнформацияДоступна Тогда
		Результат = Резюме;
		Возврат Результат;
	КонецЕсли;
	
	Если Резюме["actions"]["get_with_contact"] = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Возврат Результат;
	КонецЕсли;
	
	СсылкаПолученияКонтактов = Резюме["actions"]["get_with_contact"]["url"];
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(СсылкаПолученияКонтактов);
	
	Запрос = НовыйHTTPЗапрос("/" + СтруктураURI.ПутьНаСервере);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Результат = ПарсерJSON(РезультатЗапроса.ТелоОтвета, Истина);

	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДеревоПрофессиональныхРолей(Дерево)
	
	Результат = Ложь;
	
	КлассификаторыZarplata = КлассификаторыСайта();
		
	Если КлассификаторыZarplata = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Категории = КлассификаторыZarplata.professional_roles.categories;
	
	Для Каждого Категория Из Категории Цикл
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Идентификатор = Категория.id;
		НоваяСтрока.Значение = Категория.name;
		
		Если ЗначениеЗаполнено(Категория.roles) И Категория.roles.Количество() > 0 Тогда
			Для Каждого Роль Из Категория.roles Цикл
				НоваяПодчиненнаяСтрока = НоваяСтрока.Строки.Добавить();
				НоваяПодчиненнаяСтрока.Идентификатор = Роль.id;
				НоваяПодчиненнаяСтрока.Значение = Роль.name;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДеревоРегионов(Дерево)
	
	Результат = Ложь;
	
	КлассификаторыZarplata = КлассификаторыСайта();
	
	Если КлассификаторыZarplata = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Страны = КлассификаторыZarplata.areas;
	
	Для Каждого Страна Из Страны Цикл
		
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Идентификатор = Страна.id;
		НоваяСтрока.Значение = Страна.name;
		
		Если Страна.areas.Количество() > 0 Тогда 
			
			Для Каждого Регион Из Страна.areas Цикл
				
				НоваяПодчиненнаяСтрока = НоваяСтрока.Строки.Добавить();
				НоваяПодчиненнаяСтрока.Идентификатор = Регион.id;
				НоваяПодчиненнаяСтрока.Значение = РекрутинговыеСайтыСлужебный.УдалитьУточнениеВСкобках(Регион.name);
				
				Если Регион.areas.Количество() > 0 Тогда
					
					Для Каждого Город Из Регион.areas Цикл
						
						НоваяПодчиненнаяСтрокаВторогоУровня = НоваяПодчиненнаяСтрока.Строки.Добавить();
						НоваяПодчиненнаяСтрокаВторогоУровня.Идентификатор = Город.id;
						НоваяПодчиненнаяСтрокаВторогоУровня.Значение = РекрутинговыеСайтыСлужебный.УдалитьУточнениеВСкобках(Город.name);
						
						Для Каждого Район Из Город.areas Цикл
							
							НоваяПодчиненнаяСтрокаТретьегоУровня = НоваяПодчиненнаяСтрокаВторогоУровня.Строки.Добавить();
							НоваяПодчиненнаяСтрокаТретьегоУровня.Идентификатор = Район.id;
							НоваяПодчиненнаяСтрокаТретьегоУровня.Значение = РекрутинговыеСайтыСлужебный.УдалитьУточнениеВСкобках(Район.name);
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеНеоплаченногоПИ()
	
	Возврат НСтр("ru = 'Не оплачена возможность выполнения платного метода.
			|Подробнее https://hr.zarplata.ru/price/zp-resume-access'");
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
//  СообщатьОбОшибке - Булево
// 
// Возвращаемое значение:
// - Неопределено
// - Соответствие
Функция ОписаниеПубликацииВакансии(ИдентификаторВакансии, СообщатьОбОшибке = Истина)
	
	ОписаниеПубликации = Неопределено;
	
	Если Не УстановитьСоединение() Тогда
		Возврат ОписаниеПубликации;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/vacancies/%1", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Если СообщатьОбОшибке Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
	Иначе
		ОписаниеПубликации = ПрочитатьОтветОписаниеПубликацииВакансии(РезультатЗапроса);
	КонецЕсли;
	
	Возврат ОписаниеПубликации;
	
КонецФункции

// Параметры:
//  СтруктураРезюме - Структура: см. ПрочитатьОтветРезюмеССайта
// 
// Возвращаемое значение:
//  Массив из Структура: см. РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации
Функция КонтактнаяИнформацияРезюме(СтруктураРезюме)
	
	МассивКИ = Новый Массив();
	МенеджерКонтактов = Перечисления.КонтактыРекрутинговыхСайтов;
	
	Для Каждого КонтактнаяИнформация Из ЗначениеСвойстваУзла(СтруктураРезюме, "contact") Цикл
		ОписаниеТипаКИ = ЗначениеСвойстваУзла(КонтактнаяИнформация, "type");
		Если ОписаниеТипаКИ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = ЗначениеСвойстваУзла(КонтактнаяИнформация, "contact_value");
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		Если ЗначениеСвойстваУзла(ОписаниеТипаКИ, "id") = "cell" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
			СтруктураКИ.Представление = Значение;
		ИначеЕсли ЗначениеСвойстваУзла(ОписаниеТипаКИ, "id") = "email" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
			СтруктураКИ.Представление = Значение;
		ИначеЕсли ЗначениеСвойстваУзла(ОписаниеТипаКИ, "id") = "whatsapp" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
			СтруктураКИ.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Whatsapp);
			СтруктураКИ.Представление = Значение;
		ИначеЕсли ЗначениеСвойстваУзла(ОписаниеТипаКИ, "id") = "max" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
			СтруктураКИ.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Max);
			СтруктураКИ.Представление = Значение;
		ИначеЕсли ЗначениеСвойстваУзла(ОписаниеТипаКИ, "id") = "telegram" Тогда
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
			СтруктураКИ.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Telegram);
			СтруктураКИ.Представление = Значение;
		Иначе
			СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
			СтруктураКИ.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Прочее);
			СтруктураКИ.Представление = СтрШаблон("%1: %2", ЗначениеСвойстваУзла(ОписаниеТипаКИ, "name"), Значение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураКИ.Вид) Тогда
			МассивКИ.Добавить(СтруктураКИ);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(СтруктураРезюме, "area")) Тогда
		СтруктураКИ = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		СтруктураКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		СтруктураКИ.Вид = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
		СтруктураКИ.Представление = ЗначениеСвойстваУзла(СтруктураРезюме, "area", "name");
		МассивКИ.Добавить(СтруктураКИ);
	КонецЕсли;
	
	Возврат МассивКИ;
	
КонецФункции

// Параметры:
//  ТаблицаНайденныхКандидатов - ТаблицаЗначений
//  РезультатПоискаРезюме - Соответствие
//  ПолеСортировки - Число
Процедура ДозаполнитьТаблицуРезюме(ТаблицаНайденныхКандидатов, РезультатПоискаРезюме, ПолеСортировки)
	
	Для Каждого Резюме Из РезультатПоискаРезюме["items"] Цикл
		
		Если Резюме = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаНайденныхКандидатов.Добавить();
		ФИО = "" + ЗначениеСвойстваУзла(Резюме, "last_name") + " " + ЗначениеСвойстваУзла(Резюме, "first_name") + " " + ЗначениеСвойстваУзла(Резюме, "middle_name");
		НоваяСтрока.НазваниеРезюме = ЗначениеСвойстваУзла(Резюме, "title");
		НоваяСтрока.ФИО = ?(ЗначениеЗаполнено(ФИО), ФИО, "-");
		НоваяСтрока.Регион = ЗначениеСвойстваУзла(Резюме, "area", "name", , "-");
		НоваяСтрока.ГдеНайден = Сайт;
		НоваяСтрока.УровеньЗарплаты = "" + ЗначениеСвойстваУзла(Резюме, "salary", "amount") + " " + ЗначениеСвойстваУзла(Резюме, "salary", "currency");
		Если Не ЗначениеЗаполнено(НоваяСтрока.УровеньЗарплаты) Тогда
			НоваяСтрока.УровеньЗарплаты = "-";
		КонецЕсли;
		Возраст = ЗначениеСвойстваУзла(Резюме, "age");
		Если ЗначениеЗаполнено(Возраст) Тогда
			НоваяСтрока.Возраст = Число(Возраст);
		Иначе
			НоваяСтрока.Возраст = "-";
		КонецЕсли;
		НоваяСтрока.ИдентификаторРезюме = ЗначениеСвойстваУзла(Резюме, "id");
		Если ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "created_at")) Тогда 
			НоваяСтрока.ДатаРазмещения = ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "created_at"));
		ИначеЕсли ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "updated_at")) Тогда
			НоваяСтрока.ДатаРазмещения = ДатаПоСтроке(ЗначениеСвойстваУзла(Резюме, "updated_at"));;
		КонецЕсли;
		НоваяСтрока.СсылкаНаРезюме = ЗначениеСвойстваУзла(Резюме, "alternate_url");
		МестаРаботы = ЗначениеСвойстваУзла(Резюме, "experience");
		Если ЗначениеЗаполнено(МестаРаботы) 
			И МестаРаботы.Количество() > 0 Тогда
			ПоследнееМестоРаботы = МестаРаботы[0];
			Если ПоследнееМестоРаботы = Неопределено 
				Или ПоследнееМестоРаботы = "null" Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока.ПоследнееМестоРаботы = СтрШаблон(НСтр("ru = '%1, %2 с %3 по %4'"),
				ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "company"),
				ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "position"),
				Формат(Дата(СтрЗаменить(ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "start"), "-", "")), "ДЛФ=Д"),
				?(ЗначениеЗаполнено(ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "end")),
					Формат(Дата(СтрЗаменить(ЗначениеСвойстваУзла(ПоследнееМестоРаботы, "end"), "-", "")), "ДЛФ=Д"),
					НСтр("ru = 'настоящее время'")));
		КонецЕсли;
		
		Пол = Неопределено;
		Если Не ЗначениеЗаполнено(ЗначениеСвойстваУзла(Резюме, "gender")) Тогда
			Пол = "-";
		ИначеЕсли ЗначениеСвойстваУзла(Резюме, "gender", "id") = "male" Тогда
			Пол = РекрутинговыеСайтыСлужебный.МужскойПол();
		ИначеЕсли ЗначениеСвойстваУзла(Резюме, "gender", "id") = "female" Тогда
			Пол = РекрутинговыеСайтыСлужебный.ЖенскийПол();
		КонецЕсли;
		
		НоваяСтрока.Пол = Пол; 
		НоваяСтрока.ПолеСортировки = ПолеСортировки;
		
		ПолеСортировки = ПолеСортировки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.ВидыОбразованияФизическихЛиц
Функция ВидОбразованияПоИдентификатору(Идентификатор)
	
	ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.ПустаяСсылка();
	
	Если Идентификатор = "higher" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразование;
	ИначеЕсли Идентификатор = "unfinished_higher" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.НеполноеВысшееОбразование;
	ИначеЕсли Идентификатор = "special_secondary" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование;
	ИначеЕсли Идентификатор = "secondary" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.СреднееПолноеОбщееОбразование;
	ИначеЕсли Идентификатор = "bachelor" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат;
	ИначеЕсли Идентификатор = "master" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура;
	ИначеЕсли Идентификатор = "candidate" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.АспирантураОрдинатураАдъюнктура;
	ИначеЕсли Идентификатор = "doctor" Тогда
		ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.Докторантура;
	КонецЕсли;

	Возврат ВидОбразования;
	
КонецФункции

// Возвращаемое значение:
//  Массив из Структура
Функция ВариантыПубликации(ИнформацияОПользователе = Неопределено)
	Результат = Новый Массив();
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ИнформацияОПользователе = Неопределено Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИнформацияОПользователе.ИмяПользователя) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ИдентификаторКомпании = ИнформацияОПользователе.ИдентификаторКомпании;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("/employers/%1/services/available_publications", ИдентификаторКомпании));
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Варианты = ПрочитатьОтветВариантыПубликации(РезультатЗапроса);
		Для Каждого Вариант Из Варианты.publication_variants Цикл
			Свойства = Новый Массив();
			Для Каждого Свойство Из Вариант.vacancy_properties.required Цикл
				Свойства.Добавить(Свойство.property_type);
			КонецЦикла;
			
			Значение = СтрСоединить(Свойства, ",");
			Представление = СтрШаблон("%1 (Доступно %2)", Вариант.appearance.title, Вариант.available_publications_count);
			
			Результат.Добавить(Новый Структура("id, name", Значение, Представление));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
