//@Strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. Видеособеседования.ДлительнаяОперацияСозданияВидеособеседования
Функция ДлительнаяОперацияСозданияВидеособеседования(Параметры, УникальныйИдентификатор) Экспорт
	
	Возврат Видеособеседования.ДлительнаяОперацияСозданияВидеособеседования(Параметры, УникальныйИдентификатор);
	
КонецФункции

// См. Видеособеседования.ДлительнаяОперацияОбновленияВидеособеседования
Функция ДлительнаяОперацияОбновленияВидеособеседования(Параметры, УникальныйИдентификатор) Экспорт
	
	Возврат Видеособеседования.ДлительнаяОперацияОбновленияВидеособеседования(Параметры, УникальныйИдентификатор);
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Идентификатор - Строка
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДлительнаяОперацияОтменыВидеоконференции(УчетнаяЗапись, Идентификатор, УникальныйИдентификатор) Экспорт
	
	ИмяПроцедуры = "Видеоконференции.УдалитьВидеоконференцию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, УчетнаяЗапись, Идентификатор);
	
КонецФункции

// См. Видеособеседования.ОтменитьВидеоконференцииПоКандидату
Процедура ОтменитьВидеоконференцииПоКандидату(Параметры) Экспорт
	
	Видеособеседования.ОтменитьВидеоконференцииПоКандидату(Параметры);
	
КонецПроцедуры

// См. Видеособеседования.ДанныеПересеченийВидеоконференций
Функция ДанныеПересеченийВидеоконференций(Параметры) Экспорт
	
	Возврат Видеособеседования.ДанныеПересеченийВидеоконференций(Параметры);
	
КонецФункции

// См. Видеособеседования.ПользовательЯвляетсяУчастником
Функция ПользовательЯвляетсяУчастником(Параметры, Пользователь = Неопределено) Экспорт
	
	Возврат Видеособеседования.ПользовательЯвляетсяУчастником(Параметры, Пользователь);
	
КонецФункции

// См. Видеособеседования.ДобавитьПользователяВУчастники
Процедура ДобавитьПользователяВУчастники(Параметры, Пользователь = Неопределено) Экспорт
	
	Видеособеседования.ДобавитьПользователяВУчастники(Параметры, Пользователь);
	
КонецПроцедуры

// См. Видеособеседования.ВидеоконференцииПоКандидату
Функция ВидеоконференцииПоКандидату(Параметры) Экспорт
	
	Возврат Видеособеседования.ВидеоконференцииПоКандидату(Параметры);
	
КонецФункции

#КонецОбласти