#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МестоположениеФормы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.МестоположениеФормы();
	МестоположениеФормы.Документооборот2 = Истина;
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения")
			И ПараметрыВыполненияКоманды.Источник.ИмяФормы = "Обработка.ИнтеграцияС1СДокументооборот.Форма.Задача" Тогда
		ВнешнийОбъект = Новый Структура;
		ВнешнийОбъект.Вставить("name", ПараметрыВыполненияКоманды.Источник.Процесс);
		ВнешнийОбъект.Вставить("ID", ПараметрыВыполненияКоманды.Источник.ПроцессID);
		ВнешнийОбъект.Вставить("type", ПараметрыВыполненияКоманды.Источник.ПроцессТип);
		ВнешнийОбъект.Вставить("presentation", ПараметрыВыполненияКоманды.Источник.ПроцессПредставление);
		ПараметрыФормы = Новый Структура("ВнешнийОбъект", ВнешнийОбъект);
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуБИД(
		МестоположениеФормы,
		"ВсеЗадачи",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти