#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если УдостоверенияСотрудников.Количество() = 0 Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'В документе нет строк для проведения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	Запрос.УстановитьПараметр("УдостоверенияСотрудников", УдостоверенияСотрудников.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдостоверенияСотрудников.НомерСтроки КАК НомерСтроки,
		|	УдостоверенияСотрудников.Сотрудник КАК Сотрудник,
		|	УдостоверенияСотрудников.СерияУдостоверения КАК СерияУдостоверения,
		|	УдостоверенияСотрудников.НомерУдостоверения КАК НомерУдостоверения,
		|	УдостоверенияСотрудников.ДатаВыдачи КАК ДатаВыдачи,
		|	УдостоверенияСотрудников.СрокДействия КАК СрокДействия,
		|	УдостоверенияСотрудников.ВыданоПоДоверенности КАК ВыданоПоДоверенности,
		|	УдостоверенияСотрудников.ДоверенноеЛицо КАК ДоверенноеЛицо
		|ПОМЕСТИТЬ ВТВыдачиУдостоверений
		|ИЗ
		|	&УдостоверенияСотрудников КАК УдостоверенияСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.Регистратор КАК Регистратор,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТУдостоверения
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Организация = &Организация
		|				И ВидУдостоверения = &ВидУдостоверения
		|				И Регистратор <> &Ссылка) КАК Удостоверения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыдачиУдостоверений.НомерСтроки) КАК КоличествоСтрок
		|ПОМЕСТИТЬ ВТЗадвоенныеСотрудники
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиУдостоверений.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыдачиУдостоверений.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыдачиУдостоверений.НомерСтроки) КАК КоличествоСтрок
		|ПОМЕСТИТЬ ВТЗадвоенныеНомераУдостоверений
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиУдостоверений.СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыдачиУдостоверений.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТПовторенияНомеровУдостоверений
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдостоверения КАК Удостоверения
		|		ПО ВыдачиУдостоверений.СерияУдостоверения = Удостоверения.СерияУдостоверения
		|			И ВыдачиУдостоверений.НомерУдостоверения = Удостоверения.НомерУдостоверения
		|ГДЕ
		|	НЕ Удостоверения.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТВыданныеУдостоверения
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТУдостоверения КАК Удостоверения
		|		ПО ВыдачиУдостоверений.Сотрудник = Удостоверения.Сотрудник
		|ГДЕ
		|	НЕ Удостоверения.Регистратор ЕСТЬ NULL
		|	И Удостоверения.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВыдачиУдостоверений.НомерСтроки) КАК НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	ИСТИНА КАК ДатаВыдачиБольшеСрокаДействия,
		|	ЛОЖЬ КАК НесколькоУдостоверенийОдногоВида,
		|	ЛОЖЬ КАК НесколькоУдостоверенийСОднимНомером,
		|	ЛОЖЬ КАК УдостоверениеВыдавалось,
		|	ЛОЖЬ КАК ЕстьВыданноеУдостоверение,
		|	ЛОЖЬ КАК НеЗаполненоДоверенноеЛицо,
		|	ЛОЖЬ КАК ЛишнееЗаполненноеДоверенноеЛицо
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ВыдачиУдостоверений.СрокДействия <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ВыдачиУдостоверений.ДатаВыдачи >= ВыдачиУдостоверений.СрокДействия
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиУдостоверений.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИНИМУМ(ВыдачиУдостоверений.НомерСтроки),
		|	ВыдачиУдостоверений.Сотрудник,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадвоенныеСотрудники КАК ЗадвоенныеСотрудники
		|		ПО ВыдачиУдостоверений.Сотрудник = ЗадвоенныеСотрудники.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиУдостоверений.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИНИМУМ(ВыдачиУдостоверений.НомерСтроки),
		|	ВыдачиУдостоверений.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадвоенныеНомераУдостоверений КАК ЗадвоенныеНомераУдостоверений
		|		ПО ВыдачиУдостоверений.НомерУдостоверения = ЗадвоенныеНомераУдостоверений.НомерУдостоверения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыдачиУдостоверений.Сотрудник
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПовторенияНомеровУдостоверений.НомерСтроки,
		|	ПовторенияНомеровУдостоверений.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	ВТПовторенияНомеровУдостоверений КАК ПовторенияНомеровУдостоверений
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыданныеУдостоверения.НомерСтроки,
		|	ВыданныеУдостоверения.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	ВТВыданныеУдостоверения КАК ВыданныеУдостоверения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|ГДЕ
		|	ВыдачиУдостоверений.ВыданоПоДоверенности
		|	И ВыдачиУдостоверений.ДоверенноеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|ГДЕ
		|	НЕ ВыдачиУдостоверений.ВыданоПоДоверенности
		|	И ВыдачиУдостоверений.ДоверенноеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = "";
			ТекстОшибки = "";
			Если Выборка.ДатаВыдачиБольшеСрокаДействия Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: дата выдачи должна быть меньше срока действия удостоверения.'");
			ИначеЕсли Выборка.НесколькоУдостоверенийОдногоВида Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: выдача нескольких удостоверений одного вида одному сотруднику невозможна.'");
			ИначеЕсли Выборка.НесколькоУдостоверенийСОднимНомером Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: выдача нескольких удостоверений с одним номером невозможна.'");
			ИначеЕсли Выборка.УдостоверениеВыдавалось Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: удостоверение с такой серией и номером уже выдавались в организации.'");
			ИначеЕсли Выборка.ЕстьВыданноеУдостоверение Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: удостоверение данного вида выдать невозможно, так как имеется выданное.'");
			ИначеЕсли Выборка.НеЗаполненоДоверенноеЛицо Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: не заполнено доверенное лицо.'");
			ИначеЕсли Выборка.ЛишнееЗаполненноеДоверенноеЛицо Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: указана выдача по доверенности, но не заполнено доверенное лицо.'");
			КонецЕсли;
		
			ТекстСообщения = ?(ПустаяСтрока(ТекстСообщения), "", ТекстСообщения +", ")
				+ НСтр("ru='" + ТекстОшибки + "'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Сотрудник);
				
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"Сотрудники[" + (Выборка.НомерСтроки) + "].Сотрудник",
				"Объект",
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		И ОбщегоНазначения.ЭтоДокумент(ДанныеЗаполнения.Метаданные()) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проведен, Организация");
		СписокКадровыхДанных = Удостоверения.СписокКадровыхДанных();
		
		Если Не ЗначенияРеквизитов.Проведен Тогда
			ВызватьИсключение НСтр("ru = 'Ввод на основании непроведенного документа невозможен.'");
		Иначе
			ДанныеСотрудников = Новый Массив;
			Сотрудники = Новый Массив;
			Организация = ЗначенияРеквизитов.Организация;
			
			// Основание - одиночный документ.
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Сотрудник") Тогда
				
				ДанныеСотрудника = Новый Структура(СписокКадровыхДанных);
				ЗаполнитьЗначенияСвойств(ДанныеСотрудника, ДанныеЗаполнения);
				ДанныеСотрудников.Добавить(ДанныеСотрудника);
				
				Сотрудники.Добавить(ДанныеЗаполнения.Сотрудник);
				
			// Основание - списочный документ.
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Сотрудники") Тогда
				
				Для каждого СтрокаДокумента Из ДанныеЗаполнения.Сотрудники Цикл
					ДанныеСотрудника = Новый Структура(СписокКадровыхДанных);
					ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаДокумента);
					ДанныеСотрудников.Добавить(ДанныеСотрудника);
					
					Сотрудники.Добавить(СтрокаДокумента.Сотрудник);
				КонецЦикла;
				
			КонецЕсли;
			
			КадровыеДанныеДляЗаполнения = Удостоверения.КадровыеДанныеДляЗаполнения(Сотрудники, СписокКадровыхДанных, ДанныеЗаполнения.Дата);
			
			Для каждого ДанныеСотрудника Из ДанныеСотрудников Цикл
				НоваяСтрока = УдостоверенияСотрудников.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
				НоваяСтрока.ДатаВыдачи = ДанныеЗаполнения.Дата;
				
				КадровыеДанныеДляЗаполненияМассив = СтрРазделить(СписокКадровыхДанных, ",", Ложь);
				Для каждого КадровоеДанное Из КадровыеДанныеДляЗаполненияМассив Цикл
					Если Не ЗначениеЗаполнено(НоваяСтрока[КадровоеДанное]) Тогда
						СтрокаКадровыхДанных = КадровыеДанныеДляЗаполнения.НайтиСтроки(Новый Структура("Сотрудник", ДанныеСотрудника.Сотрудник));
						Если СтрокаКадровыхДанных.Количество() > 0 Тогда
							НоваяСтрока[КадровоеДанное] = СтрокаКадровыхДанных[0][КадровоеДанное];
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыдачиУдостоверений.Ссылка.Дата КАК Период,
		|	ВыдачиУдостоверений.Ссылка КАК Регистратор,
		|	ВЫРАЗИТЬ(ВыдачиУдостоверений.Ссылка КАК Документ.ВыдачаУдостоверений).Организация КАК Организация,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	ВыдачиУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫРАЗИТЬ(ВыдачиУдостоверений.Ссылка КАК Документ.ВыдачаУдостоверений).ВидУдостоверения КАК ВидУдостоверения,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано) КАК СтатусУдостоверения,
		|	ВыдачиУдостоверений.ФИО КАК ФИО,
		|	ВыдачиУдостоверений.Должность КАК Должность,
		|	ВыдачиУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	ВыдачиУдостоверений.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачиУдостоверений.СрокДействия КАК СрокДействия,
		|	ВыдачиУдостоверений.Основание КАК Основание,
		|	ВыдачиУдостоверений.ВыданоПоДоверенности КАК ВыданоПоДоверенности,
		|	ВыдачиУдостоверений.ДоверенноеЛицо КАК ДоверенноеЛицо
		|ИЗ
		|	Документ.ВыдачаУдостоверений.УдостоверенияСотрудников КАК ВыдачиУдостоверений
		|ГДЕ
		|	ВыдачиУдостоверений.Ссылка = &Ссылка";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		МодульКлассныеЧиныРанги = ОбщегоНазначения.ОбщийМодуль("КлассныеЧиныРанги");
		МодульКлассныеЧиныРанги.ДополнитьЗапросПолямиКлассногоЧинаРангаДляУдостоверений(Запрос.Текст, "", "ВыдачиУдостоверений");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МодульВоинскиеСпециальныеЗвания = ОбщегоНазначения.ОбщийМодуль("ВоинскиеСпециальныеЗвания");
		МодульВоинскиеСпециальныеЗвания.ДополнитьЗапросПолямиВоинскогоСпециальногоЗванияДляУдостоверений(Запрос.Текст, "", "ВыдачиУдостоверений");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Движения.Удостоверения.Очистить();
		Движения.Удостоверения.Записывать = Истина;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.Удостоверения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыдачиУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	ВыдачиУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыдачиУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТВыдачиУдостоверений
		|ИЗ
		|	Документ.ВыдачаУдостоверений.УдостоверенияСотрудников КАК ВыдачиУдостоверений
		|ГДЕ
		|	ВыдачиУдостоверений.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВыдачиУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	ВыдачиУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Удостоверения.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И ВидУдостоверения = &ВидУдостоверения) КАК Удостоверения
		|		ПО ВыдачиУдостоверений.Сотрудник = Удостоверения.Сотрудник
		|			И ВыдачиУдостоверений.ФизическоеЛицо = Удостоверения.ФизическоеЛицо
		|			И ВыдачиУдостоверений.СерияУдостоверения = Удостоверения.СерияУдостоверения
		|			И ВыдачиУдостоверений.НомерУдостоверения = Удостоверения.НомерУдостоверения
		|			И (Удостоверения.СтатусУдостоверения <> ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'По сотруднику %1 удостоверение (серия ""%2"", № ""%3"") находится в статусе ""%4"", распроведение выдачи невозможно.'"),
				Выборка.Сотрудник,
				Выборка.СерияУдостоверения,
				Выборка.НомерУдостоверения,
				Выборка.СтатусУдостоверения);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"Сотрудники[" + (Выборка.НомерСтроки) + "].Сотрудник",
				"Объект",
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли