
#Область ПрограммныйИнтерфейс

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиентСервер.ЭтоДокументСЭДО
//
Процедура ПриОпределенииЭтоДокументСЭДО(Признак, Правило) Экспорт
	
	ЗарплатаКадрыКлиентСервер.ПриОпределенииЭтоДокументСЭДО(Признак, Правило);
	
КонецПроцедуры

// При определении имени формы проверки основного вида деятельности.
//
// Параметры:
//  ИмяФормы - Строка - имя открываемой формы
//
Процедура ПриОпределенииИмениФормыПроверкиОсновногоВидаДеятельности(ИмяФормы) Экспорт
КонецПроцедуры

// При определении имени формы продления сертификата электронной подписи.
//
// Параметры:
//  ИмяФормы - Строка - имя открываемой формы
//
Процедура ПриОпределенииИмениФормыПродлитьСертификатЭлектроннойПодписи(ИмяФормы) Экспорт
КонецПроцедуры

#КонецОбласти