#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Адаптация и увольнение";
	// АПК:1297-вкл
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Журнал = Метаданные.ЖурналыДокументов.РешенияПоКадровымИзменениям;
	СтатистикаПоДокументам = СборСтатистики.СтандартныеПоказателиПоЖурналу(Журнал, НачалоПериода);
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, СтатистикаПоДокументам, ВидСтатистики);
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Задания адаптации и увольнения", СтатистикаЗаданий(НачалоПериода));
	Статистика.Вставить("Программа Обучения(Решение о приеме на работу)", СтатистикаПрограммОбучения(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаЗаданий(НачалоПериода)
	
	Таблица = Метаданные.БизнесПроцессы.ЗаданиеАдаптацииУвольнения;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Заданий";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.СрокИсполнения;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Исполнитель;
	ДанныеГруппировки.ПредставлениеГруппировки = "Исполнителей";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Предмет;
	ДанныеГруппировки.ПредставлениеГруппировки = "Документов оснований";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДатаСеанса());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаданиеАдаптацииУвольнения.Ссылка) КАК Заданий
		|ИЗ
		|	БизнесПроцесс.ЗаданиеАдаптацииУвольнения КАК ЗаданиеАдаптацииУвольнения
		|ГДЕ
		|	ЗаданиеАдаптацииУвольнения.Выполнено = ИСТИНА
		|	И ЗаданиеАдаптацииУвольнения.СрокИсполнения > &НачалоПериода
		|	И ЗаданиеАдаптацииУвольнения.СрокИсполнения <= &КонецПериода";
	
	ВыполненныхЗаданий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заданий")[0];
	Заданий = ПоказателиСтатистики.Получить("Заданий");
	Если Заданий <> Неопределено Тогда
		ПоказателиСтатистики.Вставить("Процент выполненных заданий", (ВыполненныхЗаданий / Заданий) * 100);
	КонецЕсли;
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПрограммОбучения(НачалоПериода)
	
	Родитель = Метаданные.Документы.РешениеОПриемеНаРаботу;
	Таблица = Родитель.ТабличныеЧасти.ПрограммаОбучения;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Мероприятие;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Мероприятий";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Реквизиты.ДатаНачала;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Решение о приеме";
	ДанныеГруппировки.ПредставлениеГруппировки = "Решений о приеме";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти