#Область ПрограммныйИнтерфейс

// События, на которые могут подписаться другие библиотеки.
// 
// Возвращаемое значение:
//  Структура - имена событий, на которые могут быть подписаны библиотеки:
// * ПриДобавленииОбработчиковОбновленияБТС - Булево 
// * ПриЗаполненииИсключенийОчисткиДанныхИБ - Булево 
// * ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке - Булево 
// * ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке - Булево 
// * ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке - Булево 
// * ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки - Булево 
// * ПриРегистрацииОбработчиковВыгрузкиДанных - Булево 
// * ПриРегистрацииОбработчиковЗагрузкиДанных - Булево 
// * ПередВыгрузкойДанных - Булево
// * ПослеВыгрузкиДанных - Булево 
// * ПередЗагрузкойДанных - Булево 
// * ПослеЗагрузкиДанных - Булево 
// * ПриЗагрузкеПользователяИнформационнойБазы - Булево 
// * ПослеЗагрузкиПользователяИнформационнойБазы - Булево 
// * ПослеЗагрузкиПользователейИнформационнойБазы - Булево 
// * ПриЗаполненииТаблицыПараметровИБ - Булево 
// * ПриПолученииЗначенийПараметровИБ - Булево 
// * ПриУстановкеЗначенийПараметровИБ - Булево 
// * ПриОпределенииПсевдонимаПользователя - Булево 
// * ПриОпределенииИсключенийНеразделенныхДанных - Булево 
// * ПриОбновленииПараметровТекущейОбластиДанных - Булево 
// * ПриОпределенииОбработчиковКаналовСообщений - Булево 
// * РегистрацияИнтерфейсовПринимаемыхСообщений - Булево 
// * РегистрацияИнтерфейсовОтправляемыхСообщений - Булево 
// * ПриОпределенииВерсииИнтерфейсаКорреспондента - Булево 
// * ПриПолученииСпискаШаблонов - Булево 
// * ПриОпределенииПсевдонимовОбработчиков - Булево 
// * ПриОпределенииОбработчиковОшибок - Булево 
// * ПриОпределенииИспользованияРегламентныхЗаданий - Булево 
// * ПриОпределенииОбработчиковПоставляемыхДанных - Булево 
// * ПриФормированииСпискаУслуг - Булево 
Функция СобытияБТС() Экспорт

	События = Новый Структура;

	// БазоваяФункциональность
	События.Вставить("ПриДобавленииОбработчиковОбновленияБТС", Ложь);
	События.Вставить("ПриЗаполненииИсключенийОчисткиДанныхИБ", Ложь);

	// ВыгрузкаЗагрузкаДанных
	События.Вставить("ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке", Ложь);
	События.Вставить("ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки", Ложь);
	События.Вставить("ПриРегистрацииОбработчиковВыгрузкиДанных", Ложь);
	События.Вставить("ПриРегистрацииОбработчиковЗагрузкиДанных", Ложь);
	События.Вставить("ПередВыгрузкойДанных", Ложь);
	События.Вставить("ПослеВыгрузкиДанных", Ложь);
	События.Вставить("ПередЗагрузкойДанных", Ложь);
	События.Вставить("ПослеЗагрузкиДанных", Ложь);
	События.Вставить("ПриЗагрузкеПользователяИнформационнойБазы", Ложь);
	События.Вставить("ПослеЗагрузкиПользователяИнформационнойБазы", Ложь);
	События.Вставить("ПослеЗагрузкиПользователейИнформационнойБазы", Ложь);

	// ТехнологияСервиса_БазоваяФункциональность
	События.Вставить("ПриЗаполненииТаблицыПараметровИБ", Ложь);
	События.Вставить("ПриПолученииЗначенийПараметровИБ", Ложь);
	События.Вставить("ПриУстановкеЗначенийПараметровИБ", Ложь);
	События.Вставить("ПриОпределенииПсевдонимаПользователя", Ложь);
	События.Вставить("ПриОпределенииИсключенийНеразделенныхДанных", Ложь);
	События.Вставить("ПриОбновленииПараметровТекущейОбластиДанных", Ложь);

	// ТехнологияСервиса_ОбменСообщениями
	События.Вставить("ПриОпределенииОбработчиковКаналовСообщений", Ложь);
	События.Вставить("РегистрацияИнтерфейсовПринимаемыхСообщений", Ложь);
	События.Вставить("РегистрацияИнтерфейсовОтправляемыхСообщений", Ложь);
	События.Вставить("ПриОпределенииВерсииИнтерфейсаКорреспондента", Ложь);

	// ТехнологияСервиса_ОчередьЗаданий
	События.Вставить("ПриПолученииСпискаШаблонов", Ложь);
	События.Вставить("ПриОпределенииПсевдонимовОбработчиков", Ложь);
	События.Вставить("ПриОпределенииОбработчиковОшибок", Ложь);
	События.Вставить("ПриОпределенииИспользованияРегламентныхЗаданий", Ложь);

	// ТехнологияСервиса_ПоставляемыеДанные
	События.Вставить("ПриОпределенииОбработчиковПоставляемыхДанных", Ложь);

	// ТехнологияСервиса_УправлениеТарифами
	События.Вставить("ПриФормированииСпискаУслуг", Ложь);

	Возврат События;

КонецФункции

#Область ОбработчикиСобытийБСП
// Обработка программных событий, возникающих в подсистемах БСП.
// Только для вызовов из библиотеки БСП в БТС.

// Определяет события, на которые подписана эта библиотека.
//
// Параметры:
//  Подписки - Структура - Ключами свойств структуры являются имена событий, на которые
//           подписана эта библиотека.
//
Процедура ПриОпределенииПодписокНаСобытияБСП(Подписки) Экспорт

	// БазоваяФункциональность
	Подписки.ПриДобавленииОбработчиковУстановкиПараметровСеанса = Истина;
	Подписки.ПриДобавленииИсключенийПоискаСсылок = Истина;
	Подписки.ПриОтправкеДанныхГлавному = Истина;
	Подписки.ПриОтправкеДанныхПодчиненному = Истина;
	Подписки.ПриПолученииДанныхОтГлавного = Истина;
	Подписки.ПриПолученииДанныхОтПодчиненного = Истина;
	Подписки.ПриВключенииРазделенияПоОбластямДанных = Истина;
	Подписки.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов = Истина;
	Подписки.ПриДобавленииПараметровРаботыКлиентаПриЗапуске = Истина;
	Подписки.ПриДобавленииПараметровРаботыКлиента = Истина;
	Подписки.ПриДобавленииПодсистем = Истина;

	// ГрупповоеИзменениеОбъектов
	Подписки.ПриОпределенииОбъектовСРедактируемымиРеквизитами = Истина;

	// ЗагрузкаДанныхИзФайла
	Подписки.ПриОпределенииСправочниковДляЗагрузкиДанных = Истина;

	// ИнтерфейсOData
	Подписки.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData = Истина;

	// Пользователи
	Подписки.ПриЗавершенииОбработкиПользователяИБ = Истина;

	// ПрофилиБезопасности
	Подписки.ПриПроверкеВозможностиНастройкиПрофилейБезопасности = Истина;
	Подписки.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов = Истина;
	Подписки.ПриЗапросеСозданияПрофиляБезопасности = Истина;
	Подписки.ПриЗапросеУдаленияПрофиляБезопасности = Истина;
	Подписки.ПриПодключенииВнешнегоМодуля = Истина;

	// РегламентныеЗадания
	Подписки.ПриОпределенииНастроекРегламентныхЗаданий = Истина;
	
	// УправлениеДоступом
	Подписки.ПриЗаполненииПоставляемыхПрофилейГруппДоступа = Истина;

	Подписки.ПриПолученииПриоритетаОбновления = Истина;

	Подписки.ПередЗапускомПрограммы = Истина;
	
	Подписки.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод = Истина;

КонецПроцедуры

#Область БазоваяФункциональность

// См. ОбщегоНазначенияПереопределяемый.ПередЗапускомПрограммы
Процедура ПередЗапускомПрограммы() Экспорт

	ПроверитьВозможностьЗапускаПрограммы();

КонецПроцедуры

// См. ПодсистемыКонфигурацииПереопределяемый.ПриДобавленииПодсистем
// 
// Параметры:
// 	МодулиПодсистем - Массив из Строка - имена модулей.
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт

	МодулиПодсистем.Добавить("ОбновлениеИнформационнойБазыБТС");

КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт

	Обработчики.Вставить("МаркерыБезопасности", "ЭлектроннаяПодписьВМоделиСервиса.УстановкаПараметровСеанса");

КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииИсключенийПоискаСсылок
Процедура ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок);

КонецПроцедуры

// См. ПриОтправкеДанныхГлавному в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ОтправкаЭлемента - ОтправкаЭлементаДанных
//  Получатель - ПланОбменаСсылка
Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель);

КонецПроцедуры

// См. ПриОтправкеДанныхПодчиненному в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ОтправкаЭлемента - ОтправкаЭлементаДанных
//  СозданиеНачальногоОбраза - Булево
//  Получатель - ПланОбменаСсылка
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель);

КонецПроцедуры

// См. ПриПолученииДанныхОтГлавного в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ПолучениеЭлемента - ПолучениеЭлементаДанных
//  ОтправкаНазад - Булево
//  Отправитель - ПланОбменаСсылка
Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);

КонецПроцедуры

// См. ПриПолученииДанныхОтПодчиненного в синтаксис-помощнике
// 
// Параметры:
//  ЭлементДанных - Произвольный - объект базы данных
//  ПолучениеЭлемента - ПолучениеЭлементаДанных
//  ОтправкаНазад - Булево
//  Отправитель - ПланОбменаСсылка
Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт

	ДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);

КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт

	ОчередьЗаданийСлужебный.ПриВключенииРазделенияПоОбластямДанных();
	РаботаВМоделиСервисаСлужебный.ПриВключенииРазделенияПоОбластямДанных();
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов
// Параметры:
//  СтруктураПоддерживаемыхВерсий - Структура - в ключе указывается имя программного интерфейса,
//                                     а в значениях - массив строк с поддерживаемыми версиями этого интерфейса.
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЕсли;

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	УдаленноеАдминистрированиеБТССлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	ЭлектроннаяПодписьВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ПередачаДанных") Тогда
		МодульПередачаДанныхСлужебный = ОбщегоНазначения.ОбщийМодуль("ПередачаДанныхСлужебный");
		МодульПередачаДанныхСлужебный.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЕсли;

	ИнтерфейсыСообщенийВМоделиСервиса.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	ОбменСообщениямиВнутренний.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	МассивВерсий = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("1.0.0.1");
	СтруктураПоддерживаемыхВерсий.Вставить("ЗагрузкаДанныхВСуществующуюОбласть", МассивВерсий);
	
КонецПроцедуры

// См. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске
// Параметры:
//   Параметры - Структура - имена и значения параметров работы клиента при запуске, которые необходимо задать.
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	МиграцияПриложений.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	ВыгрузкаЗагрузкаДанныхСлужебный.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	ВидыПриложенийСлужебный.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	
КонецПроцедуры

// См. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента
// 
// Параметры:
//   Параметры - Структура - имена и значения параметров работы клиента при запуске, которые необходимо задать.
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт

	ЭлектроннаяПодписьВМоделиСервиса.ПриДобавленииПараметровРаботыКлиента(Параметры);
	ВидыПриложенийСлужебный.ПриДобавленииПараметровРаботыКлиента(Параметры);

КонецПроцедуры

#КонецОбласти

#Область ГрупповоеИзменениеОбъектов

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами
// 
// Параметры:
//  Объекты - Соответствие из КлючИЗначение
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт

	ОбменСообщениямиВнутренний.ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты);

КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзФайла

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных
// 
// Параметры:
//  ЗагружаемыеСправочники - ТаблицаЗначений
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт

	ОчередьЗаданийСлужебный.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	РаботаВМоделиСервисаСлужебный.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсOData

// См. ИнтеграцияПодсистемБСП.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData
// 
// Параметры:
//  Типы - Массив из ОбъектМетаданных - объекты метаданных, исключаемые из выгрузки и загрузки.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузкиOData(Типы) Экспорт
	
	ОписанияТипов = Новый Массив();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда

		МодульРаботаВБезопасномРежимеСлужебныйВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежимеСлужебныйВМоделиСервиса");
		МодульРаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);

		МодульРаботаВМоделиСервисаСлужебный = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервисаСлужебный");
		МодульРаботаВМоделиСервисаСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);

	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнтеграцияОбъектовОбластейДанных") Тогда
		МодульИнтеграцияОбъектовОбластейДанных = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияОбъектовОбластейДанных");
		МодульИнтеграцияОбъектовОбластейДанных.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОбменСообщениями") Тогда
		МодульОбменСообщениямиВнутренний = ОбщегоНазначения.ОбщийМодуль("ОбменСообщениямиВнутренний");
		МодульОбменСообщениямиВнутренний.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданий") Тогда
		МодульОчередьЗаданийСлужебный = ОбщегоНазначения.ОбщийМодуль("ОчередьЗаданийСлужебный");
		МодульОчередьЗаданийСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ВыгрузкаЗагрузкаДанных") Тогда
		МодульВыгрузкаЗагрузкаДанныхПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ВыгрузкаЗагрузкаДанныхПереопределяемый");
		МодульВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);
	КонецЕсли;
	
	РасширенияВМоделиСервисаСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(ОписанияТипов);

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		Типы,
		ВыгрузкаЗагрузкаДанныхСобытияСлужебный.ТипыИзОписанийТипов(ОписанияТипов));
	
КонецПроцедуры

#КонецОбласти

#Область Пользователи

// См. ПользователиСлужебныйВМоделиСервиса.ПриЗавершенииОбработкиПользователяИБ
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
Процедура ПриЗавершенииОбработкиПользователяИБ(Пользователь) Экспорт

	РаботаВМоделиСервисаПереопределяемый.УстановитьПраваПоУмолчанию(Пользователь);

КонецПроцедуры

#КонецОбласти

#Область ПрофилиБезопасности

// См. РаботаВБезопасномРежимеПереопределяемый.ПриПроверкеВозможностиНастройкиПрофилейБезопасности
Процедура ПриПроверкеВозможностиНастройкиПрофилейБезопасности(Отказ) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриПроверкеВозможностиНастройкиПрофилейБезопасности(Отказ);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов
Процедура ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов(Знач ПрограммныйМодуль, Знач Владелец,
	Знач РежимЗамещения, Знач ДобавляемыеРазрешения, Знач УдаляемыеРазрешения, СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеРазрешенийНаИспользованиеВнешнихРесурсов(
		ПрограммныйМодуль, Владелец, РежимЗамещения, ДобавляемыеРазрешения, УдаляемыеРазрешения, СтандартнаяОбработка,
		Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеСозданияПрофиляБезопасности
Процедура ПриЗапросеСозданияПрофиляБезопасности(Знач ПрограммныйМодуль, СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеСозданияПрофиляБезопасности(ПрограммныйМодуль,
		СтандартнаяОбработка, Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗапросеУдаленияПрофиляБезопасности
Процедура ПриЗапросеУдаленияПрофиляБезопасности(Знач ПрограммныйМодуль, СтандартнаяОбработка, Результат) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗапросеУдаленияПрофиляБезопасности(ПрограммныйМодуль,
		СтандартнаяОбработка, Результат);

КонецПроцедуры

// См. РаботаВБезопасномРежимеПереопределяемый.ПриПодключенииВнешнегоМодуля
Процедура ПриПодключенииВнешнегоМодуля(Знач ВнешнийМодуль, БезопасныйРежим) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриПодключенииВнешнегоМодуля(ВнешнийМодуль, БезопасныйРежим);

КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеВерсииИБ

// См. ИнтеграцияПодсистемБСП.ПриПолученииПриоритетаОбновления.
Процедура ПриПолученииПриоритетаОбновления(Приоритет) Экспорт

	ПриоритетОбработкаДанных = "ОбработкаДанных";

	Если Приоритет = ПриоритетОбработкаДанных Тогда
		Возврат;
	КонецЕсли;

	УстановитьОтключениеБезопасногоРежима(Истина);
	УстановитьПривилегированныйРежим(Истина);

	Если Не Константы.УстанавливатьПриоритетОбработкиДанныхВУказанномИнтервалеВремени.Получить() Тогда
		Возврат;
	КонецЕсли;

	ОписаниеТиповВремя = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Время);
	ТекущееУниверсальноеВремя = ОписаниеТиповВремя.ПривестиЗначение(ТекущаяУниверсальнаяДата());

	НачалоИнтервалаВремениПриоритетаОбработкиДанных = Константы.НачалоИнтервалаВремениПриоритетаОбработкиДанных.Получить();
	ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных = Константы.ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных.Получить();

	Если ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных > НачалоИнтервалаВремениПриоритетаОбработкиДанных Тогда
		Если ТекущееУниверсальноеВремя >= НачалоИнтервалаВремениПриоритетаОбработкиДанных И ТекущееУниверсальноеВремя
			<= ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных Тогда
			Приоритет = ПриоритетОбработкаДанных;
		КонецЕсли;
	Иначе
		Если ТекущееУниверсальноеВремя <= ОкончаниеИнтервалаВремениПриоритетаОбработкиДанных
			Или ТекущееУниверсальноеВремя >= НачалоИнтервалаВремениПриоритетаОбработкиДанных Тогда
			Приоритет = ПриоритетОбработкаДанных;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

// См. ОбщегоНазначенияПереопределяемый.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт

	// Установка вида приложения
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ВидыПриложенийСлужебный";
	ИсключениеПроверки.ИмяПроцедуры       = "ВыполнитьУстановкуВидаПриложения";
	ИсключениеПроверки.ФрагментСодержания = "ОбщегоНазначения.ВыполнитьМетодКонфигурации(СвойстваВида.Процедура, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(РезультатОбработки))";
	
	ИменаПроцедур = Новый Соответствие;
	ВидыПриложенийКонфигурации = ВидыПриложенийСервер.ВидыПриложенийКонфигурации();
	
	Для Каждого ВидыПриложенияКонфигурации Из ВидыПриложенийКонфигурации Цикл
		
		ИменаПроцедур.Вставить(ВидыПриложенияКонфигурации.Процедура);
		
	КонецЦикла;
	
	ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
	ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
	ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Обработчик установки вида приложения ""%1"".'");
	
	// Переход на вид приложения
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ВидыПриложенийСлужебный";
	ИсключениеПроверки.ИмяПроцедуры       = "ВыполнитьПереходНаВидПриложения";
	ИсключениеПроверки.ФрагментСодержания = "ОбщегоНазначения.ВыполнитьМетодКонфигурации(ОбработчикПерехода.Процедура)";
	
	ИменаПроцедур = Новый Соответствие;
	ОбработчикиПереходов = ВидыПриложенийСервер.ОбработчикиПереходов();
	
	Для Каждого ОбработчикПерехода Из ОбработчикиПереходов Цикл
		
		ИменаПроцедур.Вставить(ОбработчикПерехода.Процедура);
		
	КонецЦикла;
	
	ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
	ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
	ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Обработчик перехода вида приложения ""%1"".'");
	
	// Очередь заданий
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ОТ_ОчередьЗаданийСлужебный";
	ИсключениеПроверки.ИмяПроцедуры       = "ОТ_ВыполнитьМетодКонфигурации";
	ИсключениеПроверки.ФрагментСодержания = "ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИмяМетода, Параметры)";
	
	Если Метаданные.ОбщиеМодули.Найти("ОТ_ОчередьЗаданийСлужебныйПовтИсп") <> Неопределено Тогда
		
		МодульОчередьЗаданийСлужебныйПовтИсп = ОбщегоНазначения.ОбщийМодуль("ОТ_ОчередьЗаданийСлужебныйПовтИсп");
		МетодыКонфигурации = МодульОчередьЗаданийСлужебныйПовтИсп.СоответствиеИменМетодовПсевдонимам(Ложь);
		
	Иначе
		
		МетодыКонфигурации = Новый Соответствие;
		ПриОпределенииПсевдонимовОбработчиков(МетодыКонфигурации);
		ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков(МетодыКонфигурации);
		
	КонецЕсли;
	
	ИменаПроцедур = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из МетодыКонфигурации Цикл

		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			
			ИменаПроцедур.Вставить(КлючИЗначение.Значение);
			
		Иначе
			
			ИменаПроцедур.Вставить(КлючИЗначение.Ключ);
			
		КонецЕсли;

	КонецЦикла;
	
	ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
	ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
	ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Обработчик задания очереди ""%1"".'");
	
	// Инциденты ЦКК
	ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
	ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ОТ_ИнцидентыЦККСлужебный";
	ИсключениеПроверки.ИмяПроцедуры       = "ПроверитьАктуальностьОткрытыхИнцидентов";
	ИсключениеПроверки.ФрагментСодержания = "ОбщегоНазначения.ВыполнитьМетодКонфигурации(ОпределениеТипа.ПроцедураПроверки, ПараметрыПроцедуры)";
	
	ИменаПроцедур = Новый Соответствие;
	СписокТиповИнцидентов = Новый Соответствие();
	ИнцидентыЦККПереопределяемый.СписокТиповИнцидентовПереопределяемый(СписокТиповИнцидентов);
	
	Для Каждого ТипИнцидента Из СписокТиповИнцидентов Цикл
		
		ИменаПроцедур.Вставить(ТипИнцидента.Значение.ПроцедураПроверки);
		
	КонецЦикла;
	
	ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
	ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
	ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Процедура проверки инцидента ЦКК ""%1"".'");
	
	Если Метаданные.ОбщиеМодули.Найти("ОТ_ПрограммныйИнтерфейсБТСПовтИсп") <> Неопределено Тогда
		
		МодульПрограммныйИнтерфейсБТСПовтИсп = ОбщегоНазначения.ОбщийМодуль("ОТ_ПрограммныйИнтерфейсБТСПовтИсп");

		// Программный интерфейс БТС (описания)
		ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
		ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ОТ_ПрограммныйИнтерфейсБТСПовтИсп";
		ИсключениеПроверки.ИмяПроцедуры       = "ОписаниеМетодаИнтерфейса";
		ИсключениеПроверки.ФрагментСодержания = "Результат = ОбщегоНазначения.ВыполнитьМетодКонфигурации(ИнфоМетода.ФункцияОписания,, Истина)";
		
		ИменаПроцедур = Новый Соответствие;
		ВсеМетоды = МодульПрограммныйИнтерфейсБТСПовтИсп.МетодыИнтерфейса();
		
		Для Каждого ИнфоМетода Из ВсеМетоды Цикл
			
			ИменаПроцедур.Вставить(ИнфоМетода.Значение.ФункцияОписания);
			
		КонецЦикла;
		
		ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
		ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
		ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Функция описания программного интерфейса БТС ""%1"".'");
		
		// Программный интерфейс БТС (обработчики)
		ИсключениеПроверки = Настройки.ИсключенияПроверки.Добавить();
		ИсключениеПроверки.ПолноеИмяОбъекта   = "ОбщийМодуль.ОТ_ПрограммныйИнтерфейсБТС";
		ИсключениеПроверки.ИмяПроцедуры       = "ВыполнитьОбработчикМетодаИнтерфейса";
		ИсключениеПроверки.ФрагментСодержания = "РезультатВыполнения = ОбщегоНазначения.ВыполнитьМетодКонфигурации(Обработчик, Параметры, Истина)";
		
		ИменаПроцедур = Новый Соответствие;
		
		Для Каждого ИнфоМетода Из ВсеМетоды Цикл
			
			ОписаниеМетодаИнтерфейса = МодульПрограммныйИнтерфейсБТСПовтИсп.ОписаниеМетодаИнтерфейса(ИнфоМетода.Ключ);
			ИменаПроцедур.Вставить(ОписаниеМетодаИнтерфейса.Обработчик);
			
		КонецЦикла;
		
		ОписаниеОбработчика = Настройки.ОписаниеОбработчиков.Добавить();
		ОписаниеОбработчика.ИменаПроцедур = ИменаПроцедур;
		ОписаниеОбработчика.ЗаголовокОшибки = НСтр("ru = 'Обработчик программного интерфейса БТС ""%1"".'");
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область БазоваяФункциональность

// См. ОбновлениеИнформационнойБазыБТС.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновленияБТС(Обработчики) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБСП().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБИП().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияПлюс().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриДобавленииОбработчиковОбновленияБТС Тогда
		МодульИнтеграцияБЭД().ПриДобавленииОбработчиковОбновленияБТС(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриЗаполненииИсключенийОчисткиДанныхИБ
Процедура ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки) Экспорт
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБСП().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБИП().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииИсключенийОчисткиДанныхИБ Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ВыгрузкаЗагрузкаДанных

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке.Типы
Процедура ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке.Типы
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке.Типы
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Типы - Массив Из ОбъектМетаданных - исключаемые типы.
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт

	РаботаВМоделиСервисаСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	ОбменСообщениямиВнутренний.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	ОчередьЗаданийСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	РазмерПриложенийСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	РасширенияВМоделиСервисаСлужебный.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	ТаблицаОбработчиков - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриРегистрацииОбработчиковВыгрузкиДанных.ТаблицаОбработчиков
Процедура ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБСП().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБИП().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриРегистрацииОбработчиковВыгрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	ТаблицаОбработчиков - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриРегистрацииОбработчиковЗагрузкиДанных.ТаблицаОбработчиков
Процедура ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБСП().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБИП().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриРегистрацииОбработчиковЗагрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПередВыгрузкойДанных.Контейнер
Процедура ПередВыгрузкойДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБСП().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБИП().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияПлюс().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПередВыгрузкойДанных Тогда
		МодульИнтеграцияБЭД().ПередВыгрузкойДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеВыгрузкиДанных.Контейнер
Процедура ПослеВыгрузкиДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБСП().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБИП().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПослеВыгрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПослеВыгрузкиДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПередЗагрузкойДанных.Контейнер
Процедура ПередЗагрузкойДанных(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБСП().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБИП().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияПлюс().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПередЗагрузкойДанных Тогда
		МодульИнтеграцияБЭД().ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных.Контейнер
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт

	РаботаВМоделиСервисаСлужебный.ПослеЗагрузкиДанных(Контейнер);

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПослеЗагрузкиДанных Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиДанных(Контейнер);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Контейнер
//	Сериализация - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Сериализация
//	ПользовательИБ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.ПользовательИБ
//	Отказ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗагрузкеПользователяИнформационнойБазы.Отказ
Процедура ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗагрузкеПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПриЗагрузкеПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.Контейнер
//	Сериализация - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.Сериализация
//	ПользовательИБ - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователяИнформационнойБазы.ПользовательИБ
Процедура ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПослеЗагрузкиПользователяИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиПользователяИнформационнойБазы(Контейнер, Сериализация, ПользовательИБ);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//	Контейнер - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиПользователейИнформационнойБазы.Контейнер
Процедура ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБСП().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБИП().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияПлюс().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПослеЗагрузкиПользователейИнформационнойБазы Тогда
		МодульИнтеграцияБЭД().ПослеЗагрузкиПользователейИнформационнойБазы(Контейнер);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_БазоваяФункциональностьВМоделиСервиса

// См. РаботаВМоделиСервисаПереопределяемый.ПриЗаполненииТаблицыПараметровИБ.
Процедура ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров) Экспорт

	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	ЭлектроннаяПодписьВМоделиСервиса.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБСП().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБИП().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияПлюс().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриЗаполненииТаблицыПараметровИБ Тогда
		МодульИнтеграцияБЭД().ПриЗаполненииТаблицыПараметровИБ(ТаблицаПараметров);
	КонецЕсли;

КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриПолученииЗначенийПараметровИБ
Процедура ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров) Экспорт

	ЭлектроннаяПодписьВМоделиСервиса.ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриПолученииЗначенийПараметровИБ Тогда
		МодульИнтеграцияБСП().ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриПолученииЗначенийПараметровИБ Тогда
		МодульИнтеграцияБИП().ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриПолученииЗначенийПараметровИБ Тогда
		МодульИнтеграцияПлюс().ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриПолученииЗначенийПараметровИБ Тогда
		МодульИнтеграцияБЭД().ПриПолученииЗначенийПараметровИБ(ИменаПараметров, ЗначенияПараметров);
	КонецЕсли;
	
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриУстановкеЗначенийПараметровИБ
Процедура ПриУстановкеЗначенийПараметровИБ(Знач ЗначенияПараметров) Экспорт

	ЭлектроннаяПодписьВМоделиСервиса.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБСП().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБИП().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияПлюс().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриУстановкеЗначенийПараметровИБ Тогда
		МодульИнтеграцияБЭД().ПриУстановкеЗначенийПараметровИБ(ЗначенияПараметров);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//	ИдентификаторПользователя - см. РаботаВМоделиСервиса.ПсевдонимПользователяИнформационнойБазы.ИдентификаторПользователя
//	Псевдоним - Строка - назначаемый псевдоним (возвращаемый параметр).
Процедура ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБСП().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБИП().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияПлюс().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииПсевдонимаПользователя Тогда
		МодульИнтеграцияБЭД().ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	КонецЕсли;

КонецПроцедуры

// См. РаботаВМоделиСервисаСлужебный.ПриОпределенииИсключенийНеразделенныхДанных
// 
// Параметры:
//	Исключения - Массив Из ОбъектМетаданных - исключения.
//
Процедура ПриОпределенииИсключенийНеразделенныхДанных(Исключения) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБСП().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБИП().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияПлюс().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииИсключенийНеразделенныхДанных Тогда
		МодульИнтеграцияБЭД().ПриОпределенииИсключенийНеразделенныхДанных(Исключения);
	КонецЕсли;

	РаботаВМоделиСервисаСлужебный.ПриОпределенииИсключенийНеразделенныхДанных(Исключения);

КонецПроцедуры

Процедура ПриОбновленииПараметровТекущейОбластиДанных() Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБСП().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБИП().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияПлюс().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОбновленииПараметровТекущейОбластиДанных Тогда
		МодульИнтеграцияБЭД().ПриОбновленииПараметровТекущейОбластиДанных();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ОбменСообщениями

// @skip-check module-empty-method - особенность реализации.
// 
//  Параметры:
//	Обработчики - см. ОбменСообщениямиПереопределяемый.ПолучитьОбработчикиКаналовСообщений.Обработчики
//
Процедура ПриОпределенииОбработчиковКаналовСообщений(Обработчики) Экспорт
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковКаналовСообщений Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковКаналовСообщений(Обработчики);
	КонецЕсли;

КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ЗаполнитьОбработчикиПринимаемыхСообщений
Процедура РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	РаботаВБезопасномРежимеСлужебныйВМоделиСервиса.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	УдаленноеАдминистрированиеСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ОповещениеПользователейБТС") Тогда
		МодульОповещениеПользователейБТС = ОбщегоНазначения.ОбщийМодуль("ОповещениеПользователейБТС");
		МодульОповещениеПользователейБТС.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	ВидыПриложенийСлужебный.РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБСП().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБИП().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияПлюс().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().РегистрацияИнтерфейсовПринимаемыхСообщений Тогда
		МодульИнтеграцияБЭД().РегистрацияИнтерфейсовПринимаемыхСообщений(МассивОбработчиков);
	КонецЕсли;

КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ЗаполнитьОбработчикиОтправляемыхСообщений
Процедура РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	УдаленноеАдминистрированиеСлужебный.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);

	ВидыПриложенийСлужебный.РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБСП().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБИП().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияПлюс().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().РегистрацияИнтерфейсовОтправляемыхСообщений Тогда
		МодульИнтеграцияБЭД().РегистрацияИнтерфейсовОтправляемыхСообщений(МассивОбработчиков);
	КонецЕсли;

КонецПроцедуры

// См. ИнтерфейсыСообщенийВМоделиСервисаПереопределяемый.ПриОпределенииВерсииИнтерфейсаКорреспондента
Процедура ПриОпределенииВерсииИнтерфейсаКорреспондента(Знач ИнтерфейсСообщения, Знач ПараметрыПодключения,
	Знач ПредставлениеПолучателя, Результат) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриОпределенииВерсииИнтерфейсаКорреспондента(ИнтерфейсСообщения,
		ПараметрыПодключения, ПредставлениеПолучателя, Результат);

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБСП().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения, ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБИП().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения,	ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияПлюс().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения,	ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииВерсииИнтерфейсаКорреспондента Тогда
		МодульИнтеграцияБЭД().ПриОпределенииВерсииИнтерфейсаКорреспондента(
			ИнтерфейсСообщения, ПараметрыПодключения, ПредставлениеПолучателя, Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБСП().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБИП().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияПлюс().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриПолученииСпискаШаблонов Тогда
		МодульИнтеграцияБЭД().ПриПолученииСпискаШаблонов(ШаблоныЗаданий);
	КонецЕсли;

КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт

	ДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
		МодульМиграцияПриложений = ОбщегоНазначения.ОбщийМодуль("МиграцияПриложений");
		МодульМиграцияПриложений.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ТехнологияСервиса.АвтоматизацияПроцессов.РаспределенноеВыполнениеКоманд") Тогда
		МодульРаспределенноеВыполнениеКоманд = ОбщегоНазначения.ОбщийМодуль("РаспределенноеВыполнениеКоманд");
		МодульРаспределенноеВыполнениеКоманд.ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБСП().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБИП().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияПлюс().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииПсевдонимовОбработчиков Тогда
		МодульИнтеграцияБЭД().ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам);
	КонецЕсли;

КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииОбработчиковОшибок
Процедура ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковОшибок Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковОшибок(ОбработчикиОшибок);
	КонецЕсли;

КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииИспользованияРегламентныхЗаданий
// Параметры:
// 	ТаблицаИспользования - ТаблицаЗначений - описание:
//		* РегламентноеЗадание - Строка - имя регламентного задания.
//  	* Использование - Булево - признак использования.
//
Процедура ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБСП().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБИП().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияПлюс().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииИспользованияРегламентныхЗаданий Тогда
		МодульИнтеграцияБЭД().ПриОпределенииИспользованияРегламентныхЗаданий(ТаблицаИспользования);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область РаботаВМоделиСервиса_ПоставляемыеДанные

// См. ПоставляемыеДанныеПереопределяемый.ПолучитьОбработчикиПоставляемыхДанных
Процедура ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.ИнформационныйЦентр") Тогда
		МодульИнформационныйЦентрСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнформационныйЦентрСлужебный");
		МодульИнформационныйЦентрСлужебный.ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБСП().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБИП().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияПлюс().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриОпределенииОбработчиковПоставляемыхДанных Тогда
		МодульИнтеграцияБЭД().ПриОпределенииОбработчиковПоставляемыхДанных(Обработчики);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ТехнологияСервиса_УправлениеТарифами

Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБСП().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБСП().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБИП().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБИП().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;

	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиПлюс().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияПлюс().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;
	
	Если ИнтеграцияПодсистемБТССлужебныйПовтИсп.ПодпискиБЭД().ПриФормированииСпискаУслуг Тогда
		МодульИнтеграцияБЭД().ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПереопределениеВызовов

#Область БазоваяФункциональность

// См. ОбщегоНазначения.ИспользованиеРазделителяСеанса
// 
// Возвращаемое значение:
//	Булево - признак использования.
Функция ИспользованиеРазделителяСеанса() Экспорт

	Возврат ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульИнтеграцияБСП()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСП");
	
КонецФункции

Функция МодульИнтеграцияБИП()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБИП");
	
КонецФункции

Функция МодульИнтеграцияПлюс()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемПлюс");
	
КонецФункции

Функция МодульИнтеграцияБЭД()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБЭД");
	
КонецФункции

Процедура ПроверитьВозможностьЗапускаПрограммы()

	ВыполнятьПроверкуБлокировки = Не ОбщегоНазначения.РазделениеВключено()
		Или ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных();

	Если ВыполнятьПроверкуБлокировки И ПолучитьФункциональнуюОпцию("УстановленаМонопольнаяБлокировка") Тогда

		Задание = ПолучитьТекущийСеансИнформационнойБазы().ПолучитьФоновоеЗадание();
		ВозможенЗапускПрограммы = Задание <> Неопределено
			И РаботаВМоделиСервисаСлужебный.ИменаМетодовРазрешенныхКЗапуску().Найти(Задание.ИмяМетода) <> Неопределено;

		Если Не ВозможенЗапускПрограммы И ПолучитьСеансыИнформационнойБазы().Количество() = 1 Тогда
			РаботаВМоделиСервиса.СнятьМонопольнуюБлокировку(Истина);
			ВозможенЗапускПрограммы = Истина;
		КонецЕсли;

		Если Не ВозможенЗапускПрограммы Тогда
			ВызватьИсключение НСтр("ru = 'База данных заблокирована'");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти