#Область ОписаниеПеременных

&НаКлиенте
Перем ОбновитьИнтерфейс;

&НаКлиенте
Перем МожноЗакрытьФорму;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВызватьИсключение НСтр("ru = 'Интеграция с 1С:Аналитикой недоступна в файловом режиме работы. Запустите базу в клиент-серверном режиме.'");
	КонецЕсли;
	
	// Значения реквизитов формы
	СоставНабораКонстантФормы = СоставНабораКонстант(НаборКонстант);
	
	РежимРаботы = Новый Структура;
	РежимРаботы.Вставить("СоставНабораКонстантФормы", Новый ФиксированнаяСтруктура(СоставНабораКонстантФормы));
	РежимРаботы = Новый ФиксированнаяСтруктура(РежимРаботы);
	
	ОбновитьНастройкиОбновленияСвязанныхРеквизитов();
	
	АдресСервера = ИнтеграцияС1САналитикой.АдресСервера();
	АдресСервераСохраненный = АдресСервера;
	СерверСистемыАналитикиДоступен = УстановитьАдресСервераАналитики(АдресСервера);
	УстановитьВидимостьНедоступностиСервера1САналитики(ЭтотОбъект);
	
	УстановитьНадписьОбновитьИсточникиДанных1САналитики(ЭтотОбъект, ЕстьНеактуальныеЗаписиАналитикиДанных());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Обновление состояния элементов
	УстановитьДоступность();
	ПодключитьОбработчикОжидания("ПроверитьНаличиеНеактуальныхЗаписей1САналитики", 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьИнтерфейсПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если АдресСервераСохраненный <> АдресСервера И МожноЗакрытьФорму = Неопределено Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект),
			НСтр("ru='Адрес сервера системы аналитики изменен. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьИнтеграциюС1САналитикаПриИзменении(Элемент)
	
	Подключаемый_ПриИзмененииРеквизита(Элемент);
	
	Если СерверСистемыАналитикиДоступен И НаборКонстант.ИспользоватьИнтеграциюС1САналитикой Тогда
		ПодключитьОбработчикОжидания("УстановитьИОбновитьПанелиОтложенно", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.УстановитьАдрес.Доступность = (Текст <> АдресСервераСохраненный) Или Не СерверСистемыАналитикиДоступен;
КонецПроцедуры

&НаКлиенте
Процедура АдресСервераПриИзменении(Элемент)
	АдресСервераПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ИзменитьРасписание" Тогда
		СтандартнаяОбработка = Ложь;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогНастройкиРасписанияЗавершение", ЭтотОбъект);
		
		ДиалогНастройкиРасписания = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
		ДиалогНастройкиРасписания.Показать(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьАдрес(Команда)
	
	СерверСистемыАналитикиДоступен = УстановитьАдресСервераАналитики(АдресСервера);
	УстановитьВидимостьНедоступностиСервера1САналитики(ЭтотОбъект);
	Если СерверСистемыАналитикиДоступен Тогда
		АдресСервераСохраненный = АдресСервера;
		Элементы.УстановитьАдрес.Доступность = Ложь;
		ПодключитьОбработчикОжидания("УстановитьИОбновитьПанелиОтложенно", 1, Истина);
	Иначе
		ОповеститьОНедоступностиСервера();
	КонецЕсли;
	
	УстановитьДоступность();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодробноОСервисе(Команда)
	
	ИнформационнаяСсылка = "https://v8.1c.ru/platforma/1s-analitika/";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИнформационнаяСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДанныхНадписьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьОбновлениеИсточниковДанных1САналитики();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьОбновлениеИсточниковДанных1САналитики()
	
	ДлительнаяОперация = ОбновитьИсточникиДанных1САналитикиНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление источников данных 1С:Аналитики'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбновлениеИсточниковДанных1САналитикиЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИсточниковДанных1САналитикиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеНеактуальныхЗаписей1САналитики();
	
КонецПроцедуры 

&НаСервере
Функция ОбновитьИсточникиДанных1САналитикиНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление источников данных 1С:Аналитики'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"АналитикаДанных.ОбновитьИсточникиАналитикиДанныхДлительнаяОперация", Новый Структура, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаличиеНеактуальныхЗаписей1САналитики()
	
	ЕстьНеактуальныеЗаписи = ЕстьНеактуальныеЗаписиАналитикиДанных();
	УстановитьНадписьОбновитьИсточникиДанных1САналитики(ЭтотОбъект, ЕстьНеактуальныеЗаписи);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЕстьНеактуальныеЗаписиАналитикиДанных()
	Возврат АналитикаДанных.ЕстьНеактуальныеЗаписиАналитикиДанных();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьОбновитьИсточникиДанных1САналитики(Форма, ЕстьНеактуальныеЗаписи)
	
	Форма.Элементы.ОбновлениеДанныхГруппа.Видимость = ЕстьНеактуальныеЗаписи;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНедоступностиСервера1САналитики(Форма)
	
	Форма.Элементы.ГруппаСистемаАналитикиНедоступна.Видимость = Не Форма.СерверСистемыАналитикиДоступен;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогНастройкиРасписанияЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбновитьНастройкиОбновленияСвязанныхРеквизитов(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьИнтеграциюС1САналитикой" Или РеквизитПутьКДанным = "" Тогда
		ЗначениеКонстанты = НаборКонстант.ИспользоватьИнтеграциюС1САналитикой;
		УстановитьДоступностьИспользованияИнтеграции(ЗначениеКонстанты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИспользованияИнтеграции(Значение)
	
	Элементы.АдресСервера.Доступность = Значение;
	Элементы.ОписаниеНастройкиОбновления.Доступность = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина)
	
	Если ОбновлятьИнтерфейс Тогда
		#Если Не ВебКлиент Тогда
			ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
			ОбновитьИнтерфейс = Истина;
		#Иначе
			УстановитьДоступность();
		#КонецЕсли
	Иначе
		УстановитьДоступность();
	КонецЕсли;
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если КонстантаИмя <> "" Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	Если ОбновитьИнтерфейс = Истина Тогда
		ОбновитьИнтерфейс = Ложь;
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УстановитьАдресСервераАналитики(АдресСервера);
		МожноЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		МожноЗакрытьФорму = Истина;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиОбновленияСвязанныхРеквизитов(Расписание = Неопределено)
	
	Если Не ПравоДоступа("Администрирование", Метаданные) Тогда
		Элементы.ГруппаАвтообновление.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Задание = РегламентныеЗаданияСервер.Задание(Метаданные.РегламентныеЗадания.ОбновлениеАналитикиДанных);
	
	Если Расписание <> Неопределено Тогда
		Задание.Расписание = Расписание;
		Задание.Записать();
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = Задание.Расписание;
	
	МассивСтрок = Новый Массив;
	
	РасписаниеСтрокой = Строка(Задание.Расписание);
	Если Не СтрЗаканчиваетсяНа(РасписаниеСтрокой, ".") Тогда
		РасписаниеСтрокой = РасписаниеСтрокой + ".  ";
	Иначе
		РасписаниеСтрокой = РасписаниеСтрокой + "  ";
	КонецЕсли;
	МассивСтрок.Добавить(РасписаниеСтрокой);
	
	СтрокаСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Изменить расписание'"),,,, "ИзменитьРасписание");
	МассивСтрок.Добавить(СтрокаСсылки);
	
	ОписаниеНастройкиОбновления = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	Если КонстантаИмя = "ИспользоватьИнтеграциюС1САналитикой" Тогда
		ОбновитьНастройкиОбновленияСвязанныхРеквизитов();
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьАдресСервераАналитики(АдресСервера)

	Возврат ИнтеграцияС1САналитикой.УстановитьАдресСервера(АдресСервера);
	
КонецФункции

&НаКлиенте
Процедура ОповеститьОНедоступностиСервера()
	
	СообщениеОбОшибке = НСтр("ru = 'Сервер 1С:Аналитика не обнаружен.'");

	Если ЗначениеЗаполнено(АдресСервера) Тогда
		СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сервер 1С:Аналитика по адресу ""%1"" не обнаружен.'"), АдресСервера);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Поставляемые панели 1С:Аналитика'"),,
		СообщениеОбОшибке,
		БиблиотекаКартинок.ДиалогВосклицание);
	
КонецПроцедуры

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным, ПеречитыватьФорму = Истина)
	
	// Сохранение значений реквизитов, не связанных с константами напрямую (в отношении один-к-одному).
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	МассивЧастейРеквизитПутьКДанным = СтрРазделить(РеквизитПутьКДанным, ".");
	КонстантаИмя = "";
	Если МассивЧастейРеквизитПутьКДанным.Количество() = 2
			И НРег(МассивЧастейРеквизитПутьКДанным[0]) = НРег("НаборКонстант") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = МассивЧастейРеквизитПутьКДанным[1];
	КонецЕсли;
	
	// Сохранение значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СоставНабораКонстант(Набор)
	
	Результат = Новый Структура;
		
	Для Каждого МетаКонстанта Из Метаданные.Константы Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Набор, МетаКонстанта.Имя) Тогда
			Результат.Вставить(МетаКонстанта.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура УстановитьИОбновитьПанелиОтложенно()
	ИнтеграцияС1САналитикойКлиент.УстановитьИОбновитьПанели();
КонецПроцедуры

&НаСервере
Процедура АдресСервераПриИзмененииНаСервере()
	СерверСистемыАналитикиДоступен = УстановитьАдресСервераАналитики(АдресСервера);
	Элементы.ГруппаСистемаАналитикиНедоступна.Видимость = Не СерверСистемыАналитикиДоступен;
КонецПроцедуры

#КонецОбласти
