
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОрганизацияСсылка) Тогда
		Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"), Строка(Параметры.ОрганизацияСсылка), Заголовок);
	КонецЕсли;
	
	ПрограммыСтрахования.ЗагрузитьЗначения(Параметры.ПрограммыСтрахования);
	РасширенияПрограммСтрахования.ЗагрузитьЗначения(Параметры.РасширенияПрограммСтрахования);
	ДатаОткрепления = Параметры.ДатаОткрепления;
	СтраховаяПремия = Параметры.СтраховаяПремия;
	ПрекратитьУдержания = Параметры.ПрекратитьУдержания;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИзменитьПрограммыСтрахованияПриИзменении(Элемент)
	УстановитьДоступностьЭлемента(Элементы, "ПрограммыСтрахования", ИзменитьПрограммыСтрахования);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасширенияПрограммСтрахованияПриИзменении(Элемент)
	УстановитьДоступностьЭлемента(Элементы, "РасширенияПрограммСтрахования", ИзменитьРасширенияПрограммСтрахования);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуОткрепленияПриИзменении(Элемент)
	УстановитьДоступностьЭлемента(Элементы, "ДатаОткрепления", ИзменитьДатуОткрепления);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтраховуюПремиюПриИзменении(Элемент)
	УстановитьДоступностьЭлемента(Элементы, "СтраховаяПремия", ИзменитьСтраховуюПремию);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПрекращениеУдержанийПриИзменении(Элемент)
	УстановитьДоступностьЭлемента(Элементы, "ПрекратитьУдержания", ИзменитьПрекращениеУдержаний);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ИзменитьПрограммыСтрахования", ИзменитьПрограммыСтрахования);
	ПараметрыЗакрытия.Вставить("ИзменитьРасширенияПрограммСтрахования", ИзменитьРасширенияПрограммСтрахования);
	ПараметрыЗакрытия.Вставить("ИзменитьДатуОткрепления", ИзменитьДатуОткрепления);
	ПараметрыЗакрытия.Вставить("ИзменитьСтраховуюПремию", ИзменитьСтраховуюПремию);
	ПараметрыЗакрытия.Вставить("ИзменитьПрекращениеУдержаний", ИзменитьПрекращениеУдержаний);
	ПараметрыЗакрытия.Вставить("ПрограммыСтрахования", ПрограммыСтрахования.ВыгрузитьЗначения());
	ПараметрыЗакрытия.Вставить("РасширенияПрограммСтрахования", РасширенияПрограммСтрахования.ВыгрузитьЗначения());
	ПараметрыЗакрытия.Вставить("ДатаОткрепления", ДатаОткрепления);
	ПараметрыЗакрытия.Вставить("СтраховаяПремия", СтраховаяПремия);
	ПараметрыЗакрытия.Вставить("ПрекратитьУдержания", ПрекратитьУдержания);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлемента(Элементы, ИмяЭлемента, Значение)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлемента, "Доступность", Значение);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	УстановитьДоступностьЭлемента(Форма.Элементы, "ПрограммыСтрахования", Форма.ИзменитьПрограммыСтрахования);
	УстановитьДоступностьЭлемента(Форма.Элементы, "РасширенияПрограммСтрахования", Форма.ИзменитьРасширенияПрограммСтрахования);
	УстановитьДоступностьЭлемента(Форма.Элементы, "ДатаОткрепления", Форма.ИзменитьДатуОткрепления);
	УстановитьДоступностьЭлемента(Форма.Элементы, "СтраховаяПремия", Форма.ИзменитьСтраховуюПремию);
	УстановитьДоступностьЭлемента(Форма.Элементы, "ПрекратитьУдержания", Форма.ИзменитьПрекращениеУдержаний);
	
КонецПроцедуры

#КонецОбласти
