////////////////////////////////////////////////////////////////////////////////
// Подсистема "Синхронизация данных".
// Серверные процедуры, обслуживающие правила регистрации объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет заполнение соответствия зависимых данных от ведущих данных
// Зависимые данные не мигрируют по узлам, а пересчитываются по ведущим данным в каждом узле.
//
// Параметры:
//		ЗависимыеДанные - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные ведущих данных
//			* ЗависимыеМетаданные - ОбъектМетаданных - Метаданные зависимых данных
//
Процедура ЗаполнитьТаблицуЗависимыхДанных(ЗависимыеДанные) Экспорт
	
	ЗарплатаКадрыРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КадровыйУчетРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	РасчетЗарплатыРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	УчетСтраховыхВзносовРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	УчетНДФЛРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	ОтражениеЗарплатыВБухучетеРасширенный.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
		МодульРабочиеМестаОхраныТруда = ОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда");
		МодульРабочиеМестаОхраныТруда.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.ОбучениеПоОхранеТруда") Тогда
		МодульОбучениеПоОхранеТруда = ОбщегоНазначения.ОбщийМодуль("ОбучениеПоОхранеТруда");
		МодульОбучениеПоОхранеТруда.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СредстваИндивидуальнойЗащиты") Тогда
		МодульСредстваИндивидуальнойЗащиты = ОбщегоНазначения.ОбщийМодуль("СредстваИндивидуальнойЗащиты");
		МодульСредстваИндивидуальнойЗащиты.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ДистанционнаяРабота") Тогда
		МодульДистанционнаяРабота = ОбщегоНазначения.ОбщийМодуль("ДистанционнаяРабота");
		МодульДистанционнаяРабота.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
		МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
		МодульФинансовыйУчет.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АналитикаДанных") Тогда
		МодульАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("АналитикаДанных");
		МодульАналитикаДанных.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ОбразованияФизическихЛиц") Тогда
		МодульОбразованияФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ОбразованияФизическихЛиц");
		МодульОбразованияФизическихЛиц.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.СемейныеПоложенияФизическихЛиц") Тогда
		МодульСемейныеПоложенияФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("СемейныеПоложенияФизическихЛиц");
		МодульСемейныеПоложенияФизическихЛиц.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.СводныеДанныеФизическихЛиц") Тогда
		МодульСводныеДанныеФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("СводныеДанныеФизическихЛиц");
		МодульСводныеДанныеФизическихЛиц.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет заполнение списка объектов, при изменении которых требуется зарегистрировать изменение
// организации или структурного подразделения для сотрудников и физических лиц
//
// Параметры:
//		ДанныеРегистрации - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные объекта, при изменении которого
//					требуется изменение организации или структурного подразделения
//					сотрудника или физического лица
//
Процедура ЗаполнитьТаблицуДанныхРегистрации(ДанныеРегистрации) Экспорт
	
	КадровыйУчетРасширенный.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	ЗарплатаКадрыРасширенный.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетВоеннослужащих");
		МодульПодсистемы.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Подработки") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Подработки");
		МодульПодсистемы.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Дивиденды");
		МодульПодсистемы.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыеРешения") Тогда
		МодульКадровыеРешенияРасширенный = ОбщегоНазначения.ОбщийМодуль("КадровыеРешенияРасширенный");
		МодульКадровыеРешенияРасширенный.ПриЗаполненииТаблицыОбъектовРегистрирующихЗависимыеОбъекты(ДанныеРегистрации);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет начальное заполнение данных после создания узла РИБ.
// Вызывается в момент первого запуска подчиненного узла РИБ (в том числе АРМ).
//
// Параметры:
//  ПараметрыОбновления	 - Структура - используется при вызове из обработчика обновления.
//
Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзлаРИБ(ПараметрыОбновления = Неопределено) Экспорт
	
	ЗарплатаКадрыПериодическиеРегистрыРасширенный.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КадровыйУчетРасширенный.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	ПлановыеНачисленияСотрудников.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	УчетСтраховыхВзносовРасширенный.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла();
	УчетНДФЛРасширенный.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
		МодульРабочиеМестаОхраныТруда = ОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда");
		МодульРабочиеМестаОхраныТруда.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.МедицинскиеОсмотры") Тогда
		МодульМедицинскиеОсмотры = ОбщегоНазначения.ОбщийМодуль("МедицинскиеОсмотры");
		МодульМедицинскиеОсмотры.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.ОбучениеПоОхранеТруда") Тогда
		МодульОбучениеПоОхранеТруда = ОбщегоНазначения.ОбщийМодуль("ОбучениеПоОхранеТруда");
		МодульОбучениеПоОхранеТруда.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда.СредстваИндивидуальнойЗащиты") Тогда
		МодульСредстваИндивидуальнойЗащиты = ОбщегоНазначения.ОбщийМодуль("СредстваИндивидуальнойЗащиты");
		МодульСредстваИндивидуальнойЗащиты.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйУчет.ДистанционнаяРабота") Тогда
		МодульДистанционнаяРабота = ОбщегоНазначения.ОбщийМодуль("ДистанционнаяРабота");
		МодульДистанционнаяРабота.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
		МодульФинансовыйУчет = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчет");
		МодульФинансовыйУчет.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПоискФизическихЛиц") Тогда
		МодульПоискФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("ПоискФизическихЛиц");
		МодульПоискФизическихЛиц.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АналитикаДанных") Тогда
		МодульАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("АналитикаДанных");
		МодульАналитикаДанных.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ИмяОбъекта - Строка - полное имя объекта метаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ИмяОбъекта) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(ИмяОбъекта);
	
	СинхронизацияДанныхЗарплатаКадрыПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки,
		ОбъектМетаданных);
	Если Настройки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	СинхронизацияДанныхЗарплатаКадрыПриложения.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки,
		ОбъектМетаданных);
	Если Настройки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыБСП") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыБСП");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыБРО") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыБРО");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыШаблоныСообщений") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыШаблоныСообщений");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыВзаимодействия") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыВзаимодействия");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыУОПД") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыУОПД");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыРегламентированнаяОтчетностьЗаполнение") Тогда
		МодульПодсистемы =
			ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыРегламентированнаяОтчетностьЗаполнение");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыПриложения.СинхронизацияДанныхЗарплатаКадрыБИА") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("СинхронизацияДанныхЗарплатаКадрыБИА");
		МодульПодсистемы.ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных);
		Если Настройки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти