#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьФормуОрганизации(Форма) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФинансовыйУчет.ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ФинансовыйУчетПодразделений) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = "НастройкиФинансовогоУчета";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Финансовый учет'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	
	ГруппаФормы = Форма.Элементы.Найти("ГруппаНастройкиФинансовогоУчета");
	Если Форма.Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаФормы);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьКомандуФинансовыйУчетВФормеСотрудника(Форма) Экспорт
	
	Если Не ФинансовыйУчет.ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаКнопки = Форма.Элементы.Найти("ГруппаФинансовыйУчет");
	Если ГруппаКнопки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ФинансовыйУчетСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Команды.Найти("ФинансовыйУчет") = Неопределено Тогда
		КомандаФинансовыйУчет = Форма.Команды.Добавить("ФинансовыйУчет");
		КомандаФинансовыйУчет.Действие = "Подключаемый_ФинансовыйУчет";
		КомандаФинансовыйУчет.Заголовок = НСтр("ru = 'Финансовый учет'");
	КонецЕсли;
	
	// Добавляем кнопку
	Если Форма.Элементы.Найти("ФинансовыйУчет") = Неопределено Тогда
		ЭлементФинансовыйУчет = Форма.Элементы.Вставить("ФинансовыйУчет", Тип("КнопкаФормы"), ГруппаКнопки);
		ЭлементФинансовыйУчет.Вид = ВидКнопкиФормы.Гиперссылка;
		ЭлементФинансовыйУчет.ИмяКоманды = "ФинансовыйУчет"; 
	КонецЕсли;
	
КонецПроцедуры

#Область Подразделения

Процедура ДополнитьФормуПодразделения(Форма) Экспорт
	ДополнитьФормуОбъектаУчета(Форма, "ФинансовыйУчетПодразделений");
КонецПроцедуры

Процедура ФормаПодразделенияПриЧтенииНаСервере(Форма) Экспорт
	
	ДополнитьФормуПодразделения(Форма);
	ПрочитатьДанныеФинансовогоУчетаДляРедактированияВФорме(Форма);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПодразделения(Форма, Отказ) Экспорт
	ПроверитьЗаполнениеОбъектаУчета(Форма, Отказ);
КонецПроцедуры

Процедура ФормаПодразделенияПриЗаписиНаСервере(Форма, СсылкаНаОбъект, Отказ) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетПодразделенийНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма["ДоступноРедактированиеФинансовыйУчетПодразделений"] Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Параметры.Ключ = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
		Форма.ОбъектФинансовогоУчета = ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(Форма.СсылкаНаОбъект);
		
		ФинансовыйУчетПодразделенийПрежняя = Новый Структура(Форма["ФинансовыйУчетПодразделенийПрежняя"]);
		ФинансовыйУчетПодразделенийПрежняя.Подразделение = Форма.ОбъектФинансовогоУчета;
		Форма["ФинансовыйУчетПодразделенийПрежняя"] = Новый ФиксированнаяСтруктура(ФинансовыйУчетПодразделенийПрежняя);
		
		Для Каждого Запись Из Форма.ФинансовыйУчетПодразделенийНаборЗаписей Цикл
			Запись.Подразделение = Форма.ОбъектФинансовогоУчета;
		КонецЦикла;
		
		Форма["ФинансовыйУчетПодразделений"].Подразделение = Форма.ОбъектФинансовогоУчета;
	КонецЕсли;
	
	ЗаписатьДанныеСпособовОтражения(Форма);
	
КонецПроцедуры

Функция МассивЗаписейИсторииФинансовогоУчетаПодразделения(Форма) Экспорт
	Возврат МассивЗаписейИсторииФинансовогоУчета(Форма);
КонецФункции

#КонецОбласти

#Область ПозицииКадровогоПлана

Процедура ДополнитьФормуПозицииКадровогоПлана(Форма) Экспорт
	ДополнитьФормуОбъектаУчета(Форма, "ФинансовыйУчетПозицийКадровогоПлана")
КонецПроцедуры

Процедура ФормаПозицииКадровогоПланаПриЧтенииНаСервере(Форма) Экспорт
	
	ДополнитьФормуПозицииКадровогоПлана(Форма);
	ПрочитатьДанныеФинансовогоУчетаДляРедактированияВФорме(Форма, "ФинансовыйУчетПозицийКадровогоПлана", "Позиция");
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПозицииКадровогоПлана(Форма, Отказ) Экспорт
	ПроверитьЗаполнениеОбъектаУчета(Форма, Отказ, "ФинансовыйУчетПозицийКадровогоПлана", "Позиция");
КонецПроцедуры

Процедура ФормаПозицииКадровогоПланаПриЗаписиНаСервере(Форма, СсылкаНаОбъект, Отказ) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетПозицийКадровогоПланаНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма["ДоступноРедактированиеФинансовыйУчетПозицийКадровогоПлана"] Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеСпособовОтражения(Форма, "ФинансовыйУчетПозицийКадровогоПлана", "Позиция");
	
КонецПроцедуры

Функция МассивЗаписейИсторииФинансовогоУчетаПозицииКадровогоПлана(Форма) Экспорт
	Возврат МассивЗаписейИсторииФинансовогоУчета(Форма, "ФинансовыйУчетПозицийКадровогоПлана", "Позиция");
КонецФункции

#КонецОбласти

Процедура ФормаОрганизацииПриЗаписиНаСервере(Форма, СсылкаНаОбъект, Отказ) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетПодразделенийНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма["ДоступноРедактированиеФинансовыйУчетПодразделений"] Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеСпособовОтражения(Форма, , , "МестоВСтруктуреПредприятия");
	
КонецПроцедуры

Процедура СохранитьДанныеФормыСотрудникиФинансовыйУчет(Форма, ИмяФормы, Отказ) Экспорт
	
	Если Не ИмяФормы = "ОбщаяФорма.СотрудникиФинансовыйУчет" Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ФинансовыйУчетСотрудников) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФинансовыйУчет.ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеСпособовОтражения(Форма, "ФинансовыйУчетСотрудников", "Сотрудник", "СотрудникСсылка");
	
КонецПроцедуры

Функция МассивЗаписейИсторииФинансовогоУчета(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяИзмерения = "Подразделение", ИмяОбъектаУчета = "ОбъектФинансовогоУчета") Экспорт
	
	ЕстьВариантНастройки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетВариантНастройки");
	
	Если Не ЕстьВариантНастройки Или (Форма.ФинансовыйУчетВариантНастройки <> 2 И Форма.ФинансовыйУчетВариантНастройкиПрежняя <> 2) Тогда
		// Финансовый учет задан не распределением и прежнее значение задано не распределением.
		МассивЗаписей = РедактированиеПериодическихСведенийКлиентСервер.МассивЗаписейИстории(
			Форма, ИмяРегистра, Форма[ИмяОбъектаУчета]);
		Если ЕстьВариантНастройки Тогда
			Форма.ФинансовыйУчетВариантНастройкиПрежняя = Форма.ФинансовыйУчетВариантНастройки;
		КонецЕсли;
	Иначе
		Если Не Форма[ИмяРегистра + "НаборЗаписейПрочитан"] Тогда
			РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(Форма, ИмяРегистра, Форма[ИмяОбъектаУчета]);
		КонецЕсли;
		
		ПериодИзменен = (Форма[ИмяРегистра].Период <> Форма[ИмяРегистра + "Прежняя"].Период);
		
		РесурсыИзменены = Ложь;
		Если Форма.ФинансовыйУчетВариантНастройкиПрежняя <> Форма.ФинансовыйУчетВариантНастройки Тогда
			РесурсыИзменены = Истина;
		Иначе
			
			Если Форма.ФинансовыйУчетВариантНастройки <> 2 Тогда
				Для Каждого КлючЗначение Из Форма[ИмяРегистра + "Прежняя"] Цикл
					Если КлючЗначение.Ключ = "Период" Тогда
						Продолжить;
					КонецЕсли;
					Если КлючЗначение.Значение <> Форма[ИмяРегистра][КлючЗначение.Ключ] Тогда
						РесурсыИзменены = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ТаблицаИсходногоНабора = Форма[ИмяРегистра + "Распределение"].Выгрузить();
				ТаблицаНовогоНабора = ТаблицаИсходногоНабора.СкопироватьКолонки();
				Для каждого СтрокаНабора Из Форма[ИмяРегистра + "РаспределениеПрежняя"] Цикл
					ЗаполнитьЗначенияСвойств(ТаблицаНовогоНабора.Добавить(), СтрокаНабора);
				КонецЦикла;
				РесурсыИзменены = Не ОбщегоНазначения.КоллекцииИдентичны(ТаблицаИсходногоНабора, ТаблицаНовогоНабора);
			КонецЕсли;
			
		КонецЕсли;
		
		Если (ПериодИзменен И РесурсыИзменены) Тогда
			// Удалим из набора записи на новый период, если они там есть.
			Отбор = Новый Структура("Период", Форма[ИмяРегистра].Период);
			НайденныеСтроки = Форма[ИмяРегистра + "НаборЗаписей"].НайтиСтроки(Отбор);
			Для каждого СтрокаНабора Из НайденныеСтроки Цикл
				Форма[ИмяРегистра + "НаборЗаписей"].Удалить(СтрокаНабора);
			КонецЦикла;
		ИначеЕсли ПериодИзменен Тогда
			// Удалим запись с прежним периодом.
			Отбор = Новый Структура("Период", Форма[ИмяРегистра + "Прежняя"].Период);
			НайденныеСтроки = Форма[ИмяРегистра + "НаборЗаписей"].НайтиСтроки(Отбор);
			Для каждого СтрокаНабора Из НайденныеСтроки Цикл
				Форма[ИмяРегистра + "НаборЗаписей"].Удалить(СтрокаНабора);
			КонецЦикла;
		ИначеЕсли РесурсыИзменены Тогда
			// Удалим из набора записи с текущим периодом.
			Отбор = Новый Структура("Период", Форма[ИмяРегистра].Период);
			НайденныеСтроки = Форма[ИмяРегистра + "НаборЗаписей"].НайтиСтроки(Отбор);
			Для каждого СтрокаНабора Из НайденныеСтроки Цикл
				Форма[ИмяРегистра + "НаборЗаписей"].Удалить(СтрокаНабора);
			КонецЦикла;
		КонецЕсли;
		
		Если ПериодИзменен Или РесурсыИзменены Тогда
			Если Форма.ФинансовыйУчетВариантНастройки <> 2 Тогда
				НоваяСтрока = Форма[ИмяРегистра + "НаборЗаписей"].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Форма[ИмяРегистра]);
				НоваяСтрока[ИмяИзмерения] = Форма[ИмяОбъектаУчета];
			Иначе
				ИдентификаторСтроки = 0;
				Для каждого СтрокаНабор Из Форма[ИмяРегистра + "Распределение"] Цикл
					НоваяСтрока = Форма[ИмяРегистра + "НаборЗаписей"].Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабор);
					НоваяСтрока.Период = Форма[ИмяРегистра].Период;
					НоваяСтрока[ИмяИзмерения] = Форма[ИмяОбъектаУчета];
					НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
					ИдентификаторСтроки = ИдентификаторСтроки + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Форма[ИмяРегистра + "НаборЗаписей"].Сортировать("Период");
		
		СтруктураЗаписиСтрокой = "";
		НужнаЗапятая = Ложь;
		Для Каждого КлючЗначение Из Форма[ИмяРегистра + "Прежняя"] Цикл
			Если НужнаЗапятая Тогда
				СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + ",";
			КонецЕсли;
			СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + КлючЗначение.Ключ;
			НужнаЗапятая = Истина;
		КонецЦикла;
		
		ПоследняяЗапись = Форма[ИмяРегистра + "НаборЗаписей"][Форма[ИмяРегистра + "НаборЗаписей"].Количество() - 1];
		ПериодПоследнейЗаписи = ПоследняяЗапись.Период;
		
		Отбор = Новый Структура("Период",ПериодПоследнейЗаписи);
		ПоследнийНабор = Форма[ИмяРегистра + "НаборЗаписей"].НайтиСтроки(Отбор);
		КоличествоЗаписей = ПоследнийНабор.Количество();
		
		Если КоличествоЗаписей < 2 Тогда
			ЗаполнитьЗначенияСвойств(Форма[ИмяРегистра], ПоследняяЗапись);
			ПрежняяЗапись = Новый Структура(СтруктураЗаписиСтрокой);
			ЗаполнитьЗначенияСвойств(ПрежняяЗапись, Форма[ИмяРегистра]);
			Форма[ИмяРегистра + "Прежняя"] = Новый ФиксированнаяСтруктура(ПрежняяЗапись);
			Форма[ИмяРегистра + "РаспределениеПрежняя"] = Новый ФиксированныйМассив(Новый Массив);
		Иначе
			НоваяЗапись = Новый Структура(СтруктураЗаписиСтрокой);
			НоваяЗапись.Период = ПоследняяЗапись.Период;
			Форма[ИмяРегистра + "Прежняя"] = Новый ФиксированнаяСтруктура(НоваяЗапись);
			
			ПрежнийНабор = Новый Массив;
			Для каждого СтрокаНабора Из ПоследнийНабор Цикл
				СтруктураЗаписи = Новый Структура(СтруктураЗаписиСтрокой);
				ЗаполнитьЗначенияСвойств(СтруктураЗаписи, СтрокаНабора);
				ПрежняяЗапись = Новый ФиксированнаяСтруктура(СтруктураЗаписи);
				ПрежнийНабор.Добавить(ПрежняяЗапись);
			КонецЦикла;
			Форма[ИмяРегистра + "РаспределениеПрежняя"] = Новый ФиксированныйМассив(ПрежнийНабор);
		КонецЕсли;
		
		МассивЗаписей = Новый Массив();
		Для Каждого Строка Из Форма[ИмяРегистра + "НаборЗаписей"] Цикл
			НоваяСтрока = Новый Структура(СтруктураЗаписиСтрокой);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			МассивЗаписей.Добавить(НоваяСтрока);
		КонецЦикла;
		
		ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаУстановитьВариантНастройки(Форма, ИмяРегистра);
		Если Не ИмяРегистра = "ФинансовыйУчетСотрудников" Тогда
			ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивЗаписей;

КонецФункции

Процедура ДокументВыплатыРаботыУслугиДополнитьФорму(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьФинансовыйУчет") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементНастройкаФинансовогоУчета = Форма.Элементы.Найти("НастройкаФинансовогоУчета");
	Если ЭлементНастройкаФинансовогоУчета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("СпособОтраженияЗарплатыВФинансовомУчете");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить("СпособОтраженияЗарплатыВФинансовомУчете", Тип("ПолеФормы"),
			ЭлементНастройкаФинансовогоУчета);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.СпособОтраженияЗарплатыВФинансовомУчете";
		Элемент.Заголовок = НСтр("ru = 'Аналитика расходов'");
	КонецЕсли;
	
	Элемент = Форма.Элементы.Найти("МестоВСтруктуреПредприятия");
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Добавить("МестоВСтруктуреПредприятия", Тип("ПолеФормы"),
			ЭлементНастройкаФинансовогоУчета);
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ПутьКДанным = "Объект.МестоВСтруктуреПредприятия";
		Элемент.Заголовок = НСтр("ru = 'Место в стр-ре предприятия'");
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеОбучениеРазвитиеСотрудников(Форма) Экспорт
	
	ЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Применяется назначенный сотруднику по умолчанию>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветПустойГиперссылки);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "Объект.Сотрудники.СпособОтражения", Справочники.СпособыОтраженияВФинансовомУчете.ПустаяСсылка());
	ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СотрудникиСпособОтражения");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьФормуОбъектаУчета(Форма, ИмяРегистра)
	
	ТипОбъекта = ТипЗнч(Форма.Объект.Ссылка);
	
	Если ТипОбъекта = Тип("СправочникСсылка.ПодразделенияОрганизаций")
		И ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ФинансовыйУчет.ИспользоватьФинансовыйУчет() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений[ИмяРегистра]) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРеквизитыФинансовогоУчета(Форма, ИмяРегистра);
	СоздатьКомандыФинансовогоУчета(Форма, ИмяРегистра);
	СоздатьЭлементыФормыФинансовогоУчета(Форма, ИмяРегистра);
	
	ПрочитатьДополнительныеДанныеФинансовогоУчета(Форма, ТипОбъекта, ИмяРегистра);
	УстановитьСвойстваЭлементовФинансовогоУчета(Форма, ИмяРегистра);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОбъектаУчета(Форма, Отказ, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяОбъекта = "Подразделение")
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетВариантНастройки") Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ФинансовыйУчетВариантНастройки <> 2 Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	Синоним = МетаданныеРегистра.Синоним;
	Если ЗначениеЗаполнено(МетаданныеРегистра.ПредставлениеЗаписи) Тогда
		Синоним = МетаданныеРегистра.ПредставлениеЗаписи;
	КонецЕсли;
	
	Если Форма[ИмяРегистра + "Распределение"].Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1: не указано распределение по способам отражения.'"), Синоним);
		ПутьКРеквизитуФормы = ИмяРегистра + "Распределение";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ,	ПутьКРеквизитуФормы, , Отказ);
	Иначе
		ПроверяемыеПоля = Новый Массив;
		ПроверяемыеПоля.Добавить(МетаданныеРегистра.Ресурсы.СпособОтражения);
		ПроверяемыеПоля.Добавить(МетаданныеРегистра.Ресурсы.ДоляРаспределения);
		
		Для каждого Запись Из Форма[ИмяРегистра + "Распределение"] Цикл
			Для каждого ОписаниеПоля Из ПроверяемыеПоля Цикл
				Если Не ЗначениеЗаполнено(Запись[ОписаниеПоля.Имя]) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1: не заполнено поле ""%2"".'"),
						Синоним,
						?(ЗначениеЗаполнено(ОписаниеПоля.Синоним), ОписаниеПоля.Синоним, ОписаниеПоля.Имя));
					ПутьКРеквизитуФормы = ИмяРегистра + "Распределение";
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ПутьКРеквизитуФормы, , Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьРеквизитыФинансовогоУчета(Форма, ИмяРегистра)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетВариантНастройки") Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяТипа = "СправочникСсылка.СтруктураПредприятия";
	Если ИмяРегистра = "ФинансовыйУчетПозицийКадровогоПлана" Тогда
		ИмяТипа = "СправочникСсылка.ПозицииКадровогоПлана";
	КонецЕсли;
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОбъектФинансовогоУчета") Тогда
		НовыйРеквизит = Новый РеквизитФормы("ОбъектФинансовогоУчета", Новый ОписаниеТипов(ИмяТипа));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЕсли;
	
	НовыйРеквизит = Новый РеквизитФормы("ДоступенПросмотр" + ИмяРегистра, Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ДоступноРедактирование" + ИмяРегистра, Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ФинансовыйУчетВариантНастройки", Новый ОписаниеТипов("Число"), , , Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы("ФинансовыйУчетВариантНастройкиПрежняя", Новый ОписаниеТипов("Число"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра, Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи." + ИмяРегистра), , , Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "НаборЗаписей", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей." + ИмяРегистра));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "НаборЗаписейПрочитан", Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "НоваяЗапись", Новый ОписаниеТипов("Булево"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "ПериодСтрокой", Новый ОписаниеТипов("Строка"), , , Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "Прежняя", Новый ОписаниеТипов());
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "Распределение", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей." + ИмяРегистра), , , Истина);
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	НовыйРеквизит = Новый РеквизитФормы(ИмяРегистра + "РаспределениеПрежняя", Новый ОписаниеТипов());
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

КонецПроцедуры

Процедура СоздатьКомандыФинансовогоУчета(Форма, ИмяРегистра)

	Если Форма.Команды.Найти(ИмяРегистра + "История") = Неопределено Тогда
		КомандаИстория = Форма.Команды.Добавить(ИмяРегистра + "История");
		КомандаИстория.Действие = "Подключаемый_ФинансовыйУчетИстория";
		КомандаИстория.Заголовок = НСтр("ru = 'История изменения'");
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьЭлементыФормыФинансовогоУчета(Форма, ИмяРегистра)

	Элементы = Форма.Элементы;
	
	ГруппаФормы = Элементы.Найти("ФинансовыйУчетГруппа");
	Если ГруппаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФинансовыйУчетСтраницы = Элементы.Найти("ФинансовыйУчетСтраницы");
	Если ФинансовыйУчетСтраницы = Неопределено Тогда
		ФинансовыйУчетСтраницы = Форма.Элементы.Вставить("ФинансовыйУчетСтраницы", Тип("ГруппаФормы"), ГруппаФормы);
		ФинансовыйУчетСтраницы.Вид = ВидГруппыФормы.Страницы;
		ФинансовыйУчетСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	
	ПустаяСтраница = Элементы.Найти("ФинансовыйУчетПустаяСтраница");
	Если ПустаяСтраница = Неопределено Тогда
		ПустаяСтраница = Форма.Элементы.Вставить("ФинансовыйУчетПустаяСтраница",Тип("ГруппаФормы"), ФинансовыйУчетСтраницы);
		ПустаяСтраница.Вид = ВидГруппыФормы.Страница;
	КонецЕсли;
	
	Декорация = Элементы.Найти("ДекорацияФинансовыйУчет");
	Если Декорация = Неопределено Тогда
		Декорация = Форма.Элементы.Вставить("ДекорацияФинансовыйУчет", Тип("ДекорацияФормы"), ПустаяСтраница);
		Декорация.Вид = ВидДекорацииФормы.Надпись;
	КонецЕсли;
	
	ОдноЗначение = Элементы.Найти("ФинансовыйУчетОдноЗначение");
	Если ОдноЗначение = Неопределено Тогда
		ОдноЗначение = Форма.Элементы.Вставить("ФинансовыйУчетОдноЗначение", Тип("ГруппаФормы"), ФинансовыйУчетСтраницы, ПустаяСтраница);
		ОдноЗначение.Вид = ВидГруппыФормы.Страница;
	КонецЕсли;
	
	СпособОтражения = Элементы.Найти("СпособОтраженияВФинансовомУчете");
	Если СпособОтражения = Неопределено Тогда
		СпособОтражения = Форма.Элементы.Вставить("СпособОтраженияВФинансовомУчете", Тип("ПолеФормы"), ОдноЗначение);
		СпособОтражения.Вид = ВидПоляФормы.ПолеВвода;
		СпособОтражения.Заголовок = НСтр("ru = 'Способ отражения'");
		СпособОтражения.ПутьКДанным = ИмяРегистра + ".СпособОтражения";
		СпособОтражения.УстановитьДействие("ПриИзменении","Подключаемый_СпособОтраженияВФинансовомУчетеПриИзменении");
	КонецЕсли;
	
	Распределение = Элементы.Найти("ФинансовыйУчетРаспределение");
	Если Распределение = Неопределено Тогда
		Распределение = Форма.Элементы.Вставить("ФинансовыйУчетРаспределение", Тип("ГруппаФормы"), ФинансовыйУчетСтраницы, ОдноЗначение);
		Распределение.Вид = ВидГруппыФормы.Страница;
	КонецЕсли;
	
	ТаблицаРаспределения = Элементы.Найти(ИмяРегистра + "Распределение");
	Если ТаблицаРаспределения = Неопределено Тогда
		ТаблицаРаспределения = Форма.Элементы.Вставить(ИмяРегистра + "Распределение", Тип("ТаблицаФормы"), Распределение);
		ТаблицаРаспределения.ПутьКДанным = ИмяРегистра + "Распределение";
		ТаблицаРаспределения.АвтоВводНовойСтроки = Ложь;
		ТаблицаРаспределения.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ТаблицаРаспределения.РежимВыделения = РежимВыделенияТаблицы.Множественный;
		ТаблицаРаспределения.АвтоМаксимальнаяШирина = Ложь;
		ТаблицаРаспределения.МаксимальнаяШирина = 60;
		ТаблицаРаспределения.РастягиватьПоВертикали = Ложь;
		ТаблицаРаспределения.ВысотаВСтрокахТаблицы = 4;
		ТаблицаРаспределения.УстановитьДействие(
			"ПриОкончанииРедактирования", "Подключаемый_" + ИмяРегистра + "РаспределениеПриОкончанииРедактирования");
	КонецЕсли;
	
	ДоляРаспределения = Элементы.Найти(ИмяРегистра + "РаспределениеДоляРаспределения");
	Если ДоляРаспределения = Неопределено Тогда
		ДоляРаспределения = Форма.Элементы.Вставить(ИмяРегистра + "РаспределениеДоляРаспределения", Тип("ПолеФормы"), ТаблицаРаспределения);
		ДоляРаспределения.Вид = ВидПоляФормы.ПолеВвода;
		ДоляРаспределения.ПутьКДанным = ИмяРегистра + "Распределение.ДоляРаспределения";
	КонецЕсли;
	
	СпособОтражения = Элементы.Найти(ИмяРегистра + "РаспределениеСпособОтражения");
	Если СпособОтражения = Неопределено Тогда
		СпособОтражения = Форма.Элементы.Вставить(ИмяРегистра + "РаспределениеСпособОтражения", Тип("ПолеФормы"), ТаблицаРаспределения, ДоляРаспределения);
		СпособОтражения.Вид = ВидПоляФормы.ПолеВвода;
		СпособОтражения.ПутьКДанным = ИмяРегистра + "Распределение.СпособОтражения";
	КонецЕсли;
	
	Стратегия = Элементы.Найти("ГруппаФинансовыйУчетСтратегия");
	Если Стратегия = Неопределено Тогда
		Стратегия = Форма.Элементы.Вставить("ГруппаФинансовыйУчетСтратегия", Тип("ГруппаФормы"), ГруппаФормы, ФинансовыйУчетСтраницы);
		Стратегия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Стратегия.ОтображатьЗаголовок = Ложь;
		Стратегия.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;
	
	ВариантНастройки = Элементы.Найти("ФинансовыйУчетВариантНастройки");
	Если ВариантНастройки = Неопределено Тогда
		ВариантНастройки = Форма.Элементы.Вставить("ФинансовыйУчетВариантНастройки", Тип("ПолеФормы"), Стратегия);
		ВариантНастройки.Вид = ВидПоляФормы.ПолеПереключателя;
		ВариантНастройки.КоличествоКолонок = 1;
		ВариантНастройки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ВариантНастройки.ПутьКДанным = "ФинансовыйУчетВариантНастройки";
		ВариантНастройки.УстановитьДействие("ПриИзменении","Подключаемый_ФинансовыйУчетВариантПриИзменении");
		ВариантНастройки.СписокВыбора.Добавить(0, НСтр("ru = 'Отражается как задано для вышестоящего подразделения'"));
		ВариантНастройки.СписокВыбора.Добавить(1, НСтр("ru = 'Отражается указанным способом'"));
		ВариантНастройки.СписокВыбора.Добавить(2, НСтр("ru = 'Распределяется по способам отражения'"));
	КонецЕсли;
	
	ДатаИсторияГруппа = Элементы.Найти("ДатаИсторияФинансовогоУчетаГруппа");
	Если ДатаИсторияГруппа = Неопределено Тогда
		ДатаИсторияГруппа = Форма.Элементы.Вставить("ДатаИсторияФинансовогоУчетаГруппа", Тип("ГруппаФормы"), ГруппаФормы, Стратегия);
		ДатаИсторияГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ДатаИсторияГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ДатаИсторияГруппа.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	
	КнопкаИстория = Элементы.Найти(ИмяРегистра + "История");
	Если КнопкаИстория = Неопределено Тогда
		КнопкаИстория = Форма.Элементы.Вставить(ИмяРегистра + "История", Тип("КнопкаФормы"), ДатаИсторияГруппа);
		КнопкаИстория.Вид = ВидКнопкиФормы.Гиперссылка;
		КнопкаИстория.Высота = 1;
		КнопкаИстория.ИмяКоманды = ИмяРегистра + "История";
	КонецЕсли;
	
	ПериодСтрокой = Элементы.Найти(ИмяРегистра + "ПериодСтрокой");
	Если ПериодСтрокой = Неопределено Тогда
		ПериодСтрокой = Форма.Элементы.Вставить(ИмяРегистра + "ПериодСтрокой", Тип("ПолеФормы"), ДатаИсторияГруппа, КнопкаИстория);
		ПериодСтрокой.Вид = ВидПоляФормы.ПолеВвода;
		ПериодСтрокой.Заголовок = НСтр("ru = 'Заданный ниже учет действует с'");
		ПериодСтрокой.ПутьКДанным = ИмяРегистра + "ПериодСтрокой";
		ПериодСтрокой.КнопкаВыбора = Истина;
		ПериодСтрокой.КнопкаРегулирования = Истина;
		ПериодСтрокой.РастягиватьПоГоризонтали = Ложь;
		ПериодСтрокой.Ширина = 14;
		ПериодСтрокой.КартинкаКнопкиВыбора = БиблиотекаКартинок.ПолеВводаКалендарь;
		ПериодСтрокой.УстановитьДействие("ПриИзменении","Подключаемый_" + ИмяРегистра + "ПериодСтрокойПриИзменении");
		ПериодСтрокой.УстановитьДействие("НачалоВыбора","Подключаемый_" + ИмяРегистра + "ПериодСтрокойНачалоВыбора");
		ПериодСтрокой.УстановитьДействие("Регулирование","Подключаемый_" + ИмяРегистра + "ПериодСтрокойРегулирование");
		ПериодСтрокой.УстановитьДействие("АвтоПодбор","Подключаемый_" + ИмяРегистра + "ПериодСтрокойАвтоПодбор");
		ПериодСтрокой.УстановитьДействие("ОкончаниеВводаТекста","Подключаемый_" + ИмяРегистра + "ПериодСтрокойОкончаниеВводаТекста");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеФинансовогоУчета(Форма, ТипОбъекта, ИмяРегистра)
	
	Если ТипОбъекта = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		Форма.ОбъектФинансовогоУчета = ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(Форма.СсылкаНаОбъект);
	Иначе
		Форма.ОбъектФинансовогоУчета = Форма.СсылкаНаОбъект;
	КонецЕсли;
	Если Форма.Параметры.Ключ.Пустая() Тогда
		РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФорме(Форма, ИмяРегистра, Форма.ОбъектФинансовогоУчета);
		ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма);
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ИмяРегистра + "ПериодСтрокой",
			ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Форма["ДоступенПросмотр" + ИмяРегистра] = ПравоДоступа("Просмотр", Метаданные.РегистрыСведений[ИмяРегистра]);
	Форма["ДоступноРедактирование" + ИмяРегистра] = ПравоДоступа("Изменение", Метаданные.РегистрыСведений[ИмяРегистра]);
	
КонецПроцедуры

Процедура ЗаписатьДанныеСпособовОтражения(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяИзмерения = "Подразделение", ИмяОбъектаУчета = "ОбъектФинансовогоУчета")
	
	ДополнительныеСвойства = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "СозданиеНового") И Форма.СозданиеНового Тогда
		ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МенеджерЗаписи[ИмяИзмерения] = Форма[ИмяОбъектаУчета];
	МетаданныеРегистра = Метаданные.РегистрыСведений[ИмяРегистра];
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор[ИмяИзмерения].Установить(Форма[ИмяОбъектаУчета]);
	НаборЗаписей.Прочитать();
	ТаблицаИсходногоНабора = НаборЗаписей.Выгрузить();
	
	ТаблицаНовогоНабора = ТаблицаИсходногоНабора.СкопироватьКолонки();
	МассивЗаписей = МассивЗаписейИсторииФинансовогоУчета(Форма, ИмяРегистра, ИмяИзмерения, ИмяОбъектаУчета);
	Для каждого СтрокаНабора Из МассивЗаписей Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНовогоНабора.Добавить(), СтрокаНабора);
	КонецЦикла;
	Если ИмяРегистра = "ФинансовыйУчетПозицийКадровогоПлана" Тогда
		МенеджерЗаписи.Подразделение = Форма.Объект.Подразделение;
		ТаблицаНовогоНабора.ЗаполнитьЗначения(МенеджерЗаписи.Подразделение, "Подразделение");
	КонецЕсли;
	
	// Проверим необходимость записи нового набора.
	Если Не ОбщегоНазначения.КоллекцииИдентичны(ТаблицаИсходногоНабора, ТаблицаНовогоНабора) Тогда
		ТаблицаНовогоНабора.Сортировать("Период Убыв");
		Для Каждого СтрокаТаблицаНовогоНабора Из ТаблицаНовогоНабора Цикл
			ДополнительныеСвойстваДляЗаписи = ДополнительныеСвойства;
			
			СохранитьСтроку = Истина;
			СтрокаТаблицаИсходногоНабора = ТаблицаИсходногоНабора.Найти(СтрокаТаблицаНовогоНабора.Период, "Период");
			Если СтрокаТаблицаИсходногоНабора <> Неопределено Тогда
				Если ОбщегоНазначения.КоллекцииИдентичны(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицаНовогоНабора),
						ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицаИсходногоНабора)) Тогда
					СохранитьСтроку = Ложь;
				КонецЕсли;
				// Удалим строку из таблицы исходного набора.
				ТаблицаИсходногоНабора.Удалить(СтрокаТаблицаИсходногоНабора);
			Иначе
				Если ОбщегоНазначения.КоллекцииИдентичны(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицаНовогоНабора),
						ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра)) Тогда
					Если ДополнительныеСвойства = Неопределено Тогда
						ДополнительныеСвойстваДляЗаписи = Новый Структура;
					Иначе
						ДополнительныеСвойстваДляЗаписи = ОбщегоНазначения.СкопироватьРекурсивно(ДополнительныеСвойства);
					КонецЕсли;
					ДополнительныеСвойстваДляЗаписи.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
				КонецЕсли;
			КонецЕсли; 
			
			Если СохранитьСтроку Тогда
				СохранитьЗаписьНабораОбъектаФинансовогоУчета(ИмяРегистра, Форма[ИмяОбъектаУчета], ИмяИзмерения,
					СтрокаТаблицаНовогоНабора, ДополнительныеСвойстваДляЗаписи)
			КонецЕсли; 
		КонецЦикла;
		
		// Удалим "лишние" записи.
		Для каждого СтрокаТаблицаИсходногоНабора Из ТаблицаИсходногоНабора Цикл
			Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(СтрокаТаблицаИсходногоНабора.Период);
			Набор.Отбор[ИмяИзмерения].Установить(Форма[ИмяОбъектаУчета]);
			Если ИмяРегистра <> "ФинансовыйУчетСотрудников" Тогда
				Набор.Отбор.ИдентификаторСтроки.Установить(СтрокаТаблицаИсходногоНабора.ИдентификаторСтроки);
			КонецЕсли;
			Набор.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДанныеФинансовогоУчетаДляРедактированияВФорме(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяОбъекта = "Подразделение")
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ФинансовыйУчетВариантНастройки") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма["ДоступенПросмотр" + ИмяРегистра] Тогда
		Возврат;
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(Форма, ИмяРегистра, Форма.ОбъектФинансовогоУчета);
	
	Форма[ИмяРегистра + "Распределение"].Очистить();
	
	Период = Форма[ИмяРегистра].Период;
	Если ЗначениеЗаполнено(Период) Тогда
		НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор[ИмяОбъекта].Установить(Форма.ОбъектФинансовогоУчета);
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 1 Тогда
			Форма[ИмяРегистра + "Распределение"].Загрузить(НаборЗаписей.Выгрузить());
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗаписиСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого КлючЗначение Из Форма[ИмяРегистра + "Прежняя"] Цикл
		Если НужнаЗапятая Тогда
			СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + ",";
		КонецЕсли;
		СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + КлючЗначение.Ключ;
		НужнаЗапятая = Истина;
	КонецЦикла;
	
	ПрежнийНабор = Новый Массив;
	Для каждого СтрокаНабора Из Форма[ИмяРегистра + "Распределение"] Цикл
		СтруктураЗаписи = Новый Структура(СтруктураЗаписиСтрокой);
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, СтрокаНабора);
		ПрежняяЗапись = Новый ФиксированнаяСтруктура(СтруктураЗаписи);
		ПрежнийНабор.Добавить(ПрежняяЗапись);
	КонецЦикла;
	Форма[ИмяРегистра + "РаспределениеПрежняя"] = Новый ФиксированныйМассив(ПрежнийНабор);
	
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(Форма, ТекущаяДатаСеанса(), ИмяРегистра);
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаУстановитьВариантНастройки(Форма, ИмяРегистра);
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма);

КонецПроцедуры

Процедура СохранитьЗаписьНабораОбъектаФинансовогоУчета(ИмяРегистра, ОбъектФинансовогоУчета, ИмяОбъекта, Запись, ДополнительныеСвойства)
	
	Набор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	Набор.Отбор.Период.Установить(Запись.Период);
	Набор.Отбор[ИмяОбъекта].Установить(ОбъектФинансовогоУчета);
	Если ИмяРегистра <> "ФинансовыйУчетСотрудников" Тогда
		Набор.Отбор.ИдентификаторСтроки.Установить(Запись.ИдентификаторСтроки);
	КонецЕсли;
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		Для каждого ДополнительноеСвойство Из ДополнительныеСвойства Цикл
			Набор.ДополнительныеСвойства.Вставить(ДополнительноеСвойство.Ключ, ДополнительноеСвойство.Значение);
		КонецЦикла;
	КонецЕсли;
	
	НоваяЗапись = Набор.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
	
	Набор.Записать();
	
КонецПроцедуры 

Процедура УстановитьСвойстваЭлементовФинансовогоУчета(Форма, ИмяРегистра)
	
	Если Форма["ДоступенПросмотр" + ИмяРегистра] Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяРегистра + "ПериодСтрокой",
			"ТолькоПросмотр",
			Не Форма["ДоступноРедактирование" + ИмяРегистра]);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФинансовыйУчет",
		"Видимость",
		ПравоДоступа("Чтение", Метаданные.Справочники.СпособыОтраженияВФинансовомУчете));
	
КонецПроцедуры

#КонецОбласти