#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЧатботПоТокену(Токен) Экспорт
	
	ИспользуемыеЧатботы = Чатботы.ИспользуемыеЧатботы();
	Для Каждого Чатбот Из ИспользуемыеЧатботы Цикл
		ТокенЧатбота = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Чатбот, "Токен");
		Если ТокенЧатбота = Токен Тогда
			Возврат Чатбот;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Справочники.Чатботы.ПустаяСсылка();
	
КонецФункции

#КонецОбласти

#КонецЕсли