#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Если объект еще не заблокирован для изменений и есть права на изменение набора
	// попытаемся установить блокировку.
	Если Не ФинансовыйУчет.ДоступноИзменениеФинансовогоУчета(Параметры.ИмяРегистра) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ТолькоПросмотр Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы( Элементы, "ФормаКомандаОК", "Доступность", Ложь);
		Элементы.ФормаКомандаОтмена.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Период = Параметры.Период;
	
	Для каждого СтрокаТЗ Из Параметры.ТаблицаРаспределения Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаРаспределения.Добавить(), СтрокаТЗ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ТаблицаРаспределения.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не заполнено распределение'");
		Возврат;
	КонецЕсли;	
	
	ИменаКолонок = Новый Массив;
	ИменаКолонок.Добавить("СпособОтражения");
	ИменаКолонок.Добавить("ДоляРаспределения");
	
	ОписаниеКолонок = Новый Соответствие;
	РеквизитыТаблицы = ПолучитьРеквизиты("ТаблицаРаспределения");
	Для каждого РеквизитТаблицы Из РеквизитыТаблицы Цикл
		Если ИменаКолонок.Найти(РеквизитТаблицы.Имя) <> Неопределено Тогда
			ОписаниеКолонок.Вставить(РеквизитТаблицы.Имя, РеквизитТаблицы.Заголовок);
		КонецЕсли; 
	КонецЦикла;
	
	НомерСтроки = 0;
	Для каждого РаспределяемаяСтрока Из ТаблицаРаспределения Цикл
		Для каждого ОписаниеКолонки Из ОписаниеКолонок Цикл
			Если НЕ ЗначениеЗаполнено(РаспределяемаяСтрока[ОписаниеКолонки.Ключ]) Тогда
				ЗаголовокКолонки = ОписаниеКолонки.Значение;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Поле ""%1"" не заполнено'"), ЗаголовокКолонки);
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения, , "ТаблицаРаспределения[" + НомерСтроки + "]." + ОписаниеКолонки.Ключ, , Отказ);
			КонецЕсли;
		КонецЦикла;
		НомерСтроки = НомерСтроки + 1;	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Отказ = Ложь;
	ОповеститьОбИзменениях(Отказ);
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьОбИзменениях(Отказ)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		ИменаКолонок = "СпособОтражения,ДоляРаспределения";
		СтруктураВозврата = Новый Массив;
		Для каждого СтрокаРаспределениеРезультатов Из ТаблицаРаспределения Цикл
			ОписаниеСтроки = Новый Структура(ИменаКолонок);
			ЗаполнитьЗначенияСвойств(ОписаниеСтроки, СтрокаРаспределениеРезультатов);
			СтруктураВозврата.Добавить(ОписаниеСтроки);
		КонецЦикла; 
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Период", Период); 
		ПараметрыОповещения.Вставить("ТаблицаРаспределения", Новый ФиксированныйМассив(СтруктураВозврата));
		Оповестить("ИзмененоРаспределениеФинансовыйУчет", ПараметрыОповещения, ВладелецФормы);
		
		Модифицированность = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти