#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Проводит документ по учетам. Если в параметре ВидыУчетов передано Неопределено, то документ проводится по всем учетам.
// Процедура вызывается из обработки проведения и может вызываться из вне.
// 
// Параметры:
//  ДокументСсылка	- ДокументСсылка.Отпуск - Ссылка на документ
//  РежимПроведения - РежимПроведенияДокумента - Режим проведения документа (оперативный, неоперативный)
//  Отказ 			- Булево - Признак отказа от выполнения проведения
//  ВидыУчетов 		- Строка - Список видов учета, по которым необходимо провести документ. Если параметр пустой или Неопределено, то документ проведется по всем учетам
//  Движения 		- Коллекция движений документа - Передается только при вызове из обработки проведения документа
//  Объект			- ДокументОбъект.Отпуск - Передается только при вызове из обработки проведения документа
//  ДополнительныеПараметры - Структура - Дополнительные параметры, необходимые для проведения документа.
//
Процедура ПровестиПоУчетам(ДокументСсылка, РежимПроведения, Отказ, ВидыУчетов = Неопределено, Движения = Неопределено, Объект = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПровестиПоУчетам(ДокументСсылка, РежимПроведения, Отказ, ВидыУчетов, Движения, Объект, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Сторнирует документ по учетам. Используется подсистемой исправления документов.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений исправляющего документа в которую будут добавлены сторно стоки.
//  Регистратор				 - ДокументСсылка				 - Документ регистратор исправления (документ исправление).
//  ИсправленныйДокумент	 - ДокументСсылка				 - Исправленный документ движения которого будут сторнированы.
//  СтруктураВидовУчета		 - Структура					 - Виды учета, по которым будет выполнено сторнирование исправленного документа.
//  					Состав полей см. в ПроведениеСервер.СтруктураВидовУчета().
//  ДополнительныеПараметры	 - Структура					 - Структура со свойствами:
//  					* ИсправлениеВТекущемПериоде - Булево - Истина когда исправление выполняется в периоде регистрации исправленного документа.
//						* ОтменаДокумента - Булево - Истина когда исправление вызвано документом СторнированиеНачислений.
//  					* ПериодРегистрации	- Дата - Период регистрации документа регистратора исправления.
// 
// Возвращаемое значение:
//  Булево - "Истина" если сторнирование выполнено этой функцией, "Ложь" если специальной процедуры не предусмотрено.
//
Функция СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	МодульКонтракта().ДобавитьКомандыПечати(КомандыПечати);
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	МодульКонтракта().Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// ЗарплатаКадрыПодсистемы

// Формирует печатную форму. Вызывается из УправлениеПечатьюБЗК.Печать.
//
// Параметры:
//   КонтекстПечати - Структура - См. УправлениеПечатьюБЗК.КонтекстПечати.
//
Процедура ПриФормированииПечатнойФормы(КонтекстПечати) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПриФормированииПечатнойФормы(КонтекстПечати);
	КонецЕсли;
	
КонецПроцедуры

// Конец ЗарплатаКадрыПодсистемы

// Описание - возвращает описание разделов данных, которые содержит документ
// 
// Возвращаемое значение:
// 	Соответствие - описание разделов данных документов -
//	 *Ключ - Строка - имя раздела. Одно из значений структуры 
//		возвращаемой методом см. МногофункциональныеДокументыБЗККлиентСервер.РазделыДанных
//   *Значение - см. МногофункциональныеДокументыБЗККлиентСервер.НовыйОписаниеРазделаДанных - описание раздела
//
Функция ОписаниеРазделовДанных() Экспорт
	
	ОписаниеРазделовДанных = Новый Соответствие();
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульМногофункциональныеДокументыБЗККлиентСервер = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗККлиентСервер");
		ОписаниеРазделовДанных = МодульМногофункциональныеДокументыБЗККлиентСервер.ОписаниеРазделовДанных_Отпуск();
	КонецЕсли;
	
	Возврат ОписаниеРазделовДанных;
	
КонецФункции

// Описание - возвращает структуру со значениями по которым будут проверяться права на разделы документа
// 				 
// Параметры:
//  ДокументОбъект - ДокументОбъект.Отпуск, ДанныеФормыСтруктура - объект или данные формы, 
//					отображающие данные документа, для которого нужно получить данные
//
// Возвращаемое значение:
// 	Структура -  см. НовыйЗначенияДоступа - значения доступа по которым будут проверяться права на документ
//
Функция ЗначенияДоступа(ДокументОбъект) Экспорт
	
	ЗначенияДоступа = УправлениеДоступомБЗК.НовыйЗначенияДоступа();
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульМногофункциональныеДокументыБЗК = ОбщегоНазначения.ОбщийМодуль("МногофункциональныеДокументыБЗК");
		ЗначенияДоступа = МодульМногофункциональныеДокументыБЗК.ЗначенияДоступаПоСоставуДокумента(ДокументОбъект, ДокументОбъект.Организация);
	КонецЕсли;
	Возврат ЗначенияДоступа;
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ИсправитьДвиженияЗанятостьПозицийШтатногоРасписания");
	Методы.Вставить("ЗаполнитьДвиженияЗанятостьПозицийШтатногоРасписания");
	Методы.Вставить("ЗаполнитьДатыЗапрета");
	Методы.Вставить("ЗаполнитьДатуРасчетаДенежногоСодержания");
	Методы.Вставить("ЗаполнитьИсходныеДанныеПерерасчетов");
КонецПроцедуры

#КонецОбласти

Функция ПредварительнаяДатаОплатыОтпуска(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Если не Объект.ПредоставитьОсновнойОтпуск и не Объект.ПредоставитьДополнительныйОтпуск Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ДатаНачалаОтпуска = Объект.ДатаНачалаСобытия;
	
	ДатаОплатыОтпуска = Неопределено;
	
	ОтпускГосслужащего = Ложь;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "РасчетДенежногоСодержания") Тогда
		ОтпускГосслужащего = Объект.РасчетДенежногоСодержания;
	КонецЕсли;
	
	ДнейДоОтпуска = ?(ОтпускГосслужащего, 11, 4);
	
	Если ЗначениеЗаполнено(ДатаНачалаОтпуска) Тогда
		ДатаОплатыОтпуска = ДатаНачалаОтпуска - 86400 * ДнейДоОтпуска; 
	КонецЕсли; 
	
	Возврат ДатаОплатыОтпуска;
	
КонецФункции

Функция ПланируемаяДатыВыплатыОтпуска(ДатаНачалаСобытия, Организация) Экспорт
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат МодульКонтракта().ПланируемаяДатыВыплатыОтпуска(ДатаНачалаСобытия, Организация);
	КонецЕсли
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПриДобавленииОбработчиковОбновления(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаФизическоеЛицоВШапке();
КонецФункции

Процедура ЗаполнитьДниОтпускаАвансом(ДокументСсылка, ДанныеДляПроведения, Сторнирование = Ложь) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьДниОтпускаАвансом(ДокументСсылка, ДанныеДляПроведения, Сторнирование);
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеТаблицРазовыхНачислений() Экспорт 
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицРазовыхНачислений();
	КонецЕсли;
	
КонецФункции	

Функция СвойстваИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Реквизиты = Новый Структура;
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульИсправлениеДокументовЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ИсправлениеДокументовЗарплатаКадры");
		Реквизиты = МодульИсправлениеДокументовЗарплатаКадры.РеквизитыИсправляемогоРасчетногоДокумента();
		Реквизиты.Вставить("ДокументРассчитан");
		Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты);
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

Функция ПараметрыИсправляемогоДокумента(ДокументСсылка) Экспорт
	
	Реквизиты = Новый Структура;
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульИсправлениеДокументовЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ИсправлениеДокументовЗарплатаКадры");
		Реквизиты = МодульИсправлениеДокументовЗарплатаКадры.ПараметрыИсправляемогоДокумента(ДокументСсылка,
			СвойстваИсправляемогоДокумента(ДокументСсылка));
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции

Функция ПараметрыСторнируемогоДокумента(ДокументСсылка) Экспорт
	
	Параметры = Новый Структура;
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Параметры = МодульКонтракта().ПараметрыСторнируемогоДокумента(ДокументСсылка);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

#Область РассылкаДокументов

Процедура ДобавитьКомандыРассылки(Команды) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ДобавитьКомандыРассылки(Команды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрямыеВыплаты

// Возникает при заполнении документа ЗаявлениеСотрудникаНаВыплатуПособия на основании текущего документа.
Процедура ЗаполнитьЗаявлениеСотрудникаНаВыплатуПособияПоОснованию(Отпуск, Заявление, РеквизитыДокумента, ДанныеДляРасчетаСреднегоЗаработка) Экспорт
	ИменаРеквизитов =
	"Дата,
	|Номер,
	|Организация,
	|Сотрудник,
	|ИсправленныйДокумент,
	|НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	|ДатаНачалаПериодаОтсутствия,
	|ДатаОкончанияПериодаОтсутствия";
	РеквизитыОтпуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отпуск, ИменаРеквизитов);
	
	РеквизитыДокумента.Вставить("Организация",                       РеквизитыОтпуска.Организация);
	РеквизитыДокумента.Вставить("Сотрудник",                         РеквизитыОтпуска.Сотрудник);
	РеквизитыДокумента.Вставить("ДатаПредставленияПакетаДокументов", РеквизитыОтпуска.Дата);
	РеквизитыДокумента.Вставить("ДатаПриказаОПредоставленииОтпускаПоУходуЗаРебенком",  РеквизитыОтпуска.Дата);
	РеквизитыДокумента.Вставить("НомерПриказаОПредоставленииОтпускаПоУходуЗаРебенком", РеквизитыОтпуска.Номер);
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		РеквизитыДокумента.Вставить("ДатаНачалаОтпускаПоУходуЗаРебенком",
			РеквизитыОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск);
		РеквизитыДокумента.Вставить("ДатаОкончанияОтпускаПоУходуЗаРебенком", 
			РеквизитыОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск);
	Иначе
		РеквизитыДокумента.Вставить("ДатаНачалаОтпускаПоУходуЗаРебенком", РеквизитыОтпуска.ДатаНачалаПериодаОтсутствия);
		РеквизитыДокумента.Вставить("ДатаОкончанияОтпускаПоУходуЗаРебенком",
			РеквизитыОтпуска.ДатаОкончанияПериодаОтсутствия);
		Если ЗначениеЗаполнено(РеквизитыОтпуска.ИсправленныйДокумент) Тогда
			РеквизитыДокумента.Вставить("Перерасчет", Истина);
			РеквизитыДокумента.Вставить("КодПричиныПерерасчета", "01");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СЭДО

// Возникает при проверке заполнении документа ОтветНаЗапросФССДляРасчетаПособия.
Процедура ПриПолученииОсновныхСведенийОДокументеДляСЭДО(БольничныйСсылка, ДокументСЭДО, ОсновныеСведения) Экспорт
	ИменаРеквизитов = "Представление, Проведен, ДокументРассчитан, Рассчитал, Организация, Сотрудник, ФизическоеЛицо";
	Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(БольничныйСсылка, ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(ОсновныеСведения, Значения);
	ОсновныеСведения.ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Значения.Организация);
	ОсновныеСведения.Рассчитан = Значения.ДокументРассчитан;
	ОсновныеСведения.Утвержден = Значения.ДокументРассчитан И ЗначениеЗаполнено(Значения.Рассчитал);
КонецПроцедуры

// Возникает при заполнении документа ОтветНаЗапросФССДляРасчетаПособия на основании текущего документа.
Процедура ЗаполнитьОтветНаЗапросФССДляРасчетаПособия(Отпуск, ДокументСЭДО, Реквизиты, ДанныеДляРасчетаСреднегоЗаработка) Экспорт
	РеквизитыОтпуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отпуск, "Организация, Сотрудник, ДатаНачалаСобытия");
	Реквизиты.Вставить("Организация", РеквизитыОтпуска.Организация);
	Реквизиты.Вставить("Сотрудник", РеквизитыОтпуска.Сотрудник);
	Реквизиты.Вставить("ДатаНачалаСобытия", РеквизитыОтпуска.ДатаНачалаСобытия);
КонецПроцедуры

#КонецОбласти

Функция ОбъектЗаблокирован(СсылкаНаОбъект) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//  Параметры                  - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульКонтракта() Экспорт
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ДокументОтпускБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ДокументОтпускРасширенный");
	КонецЕсли;
	
КонецФункции

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры);
	КонецЕсли;
	
КонецФункции

Функция ДанныеДляПроведения(РеквизитыДляПроведения, СтруктураВидовУчета = Неопределено) Экспорт 
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеДляПроведения(РеквизитыДляПроведения, СтруктураВидовУчета);
	КонецЕсли;
	
КонецФункции

Функция РеквизитыДляПроведения(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отпуск.Ссылка КАК Ссылка,
	|	Отпуск.ДокументРассчитан КАК ДокументРассчитан,
	|	Отпуск.Организация КАК Организация,
	|	Отпуск.ПериодРегистрации КАК ПериодРегистрации,
	|	Отпуск.ПорядокВыплаты КАК ПорядокВыплаты,
	|	Отпуск.Дата КАК Дата,
	|	Отпуск.ПланируемаяДатаВыплаты КАК ПланируемаяДатаВыплаты,
	|	Отпуск.ДатаНачалаСобытия КАК ДатаНачалаСобытия,
	|	Отпуск.ПериодРасчетаСреднегоЗаработкаНачало КАК ПериодРасчетаСреднегоЗаработкаНачало,
	|	Отпуск.ПериодРасчетаСреднегоЗаработкаОкончание КАК ПериодРасчетаСреднегоЗаработкаОкончание,
	|	Отпуск.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Отпуск.ПредоставитьОтгул КАК ПредоставитьОтгул,
	|	Отпуск.ОсвобождатьСтавку КАК ОсвобождатьСтавку,
	|	Отпуск.Сотрудник КАК Сотрудник,
	|	Отпуск.ДатаНачалаПериодаОтсутствия КАК ДатаНачалаПериодаОтсутствия,
	|	Отпуск.ДатаОкончанияПериодаОтсутствия КАК ДатаОкончанияПериодаОтсутствия,
	|	Отпуск.ИсправленныйДокумент КАК ИсправленныйДокумент,
	|	Отпуск.ВидВремени КАК ВидВремени,
	|	Отпуск.Номер КАК Номер,
	|	Отпуск.ПредоставитьОсновнойОтпуск КАК ПредоставитьОсновнойОтпуск,
	|	Отпуск.ДатаНачалаОсновногоОтпуска КАК ДатаНачалаОсновногоОтпуска,
	|	Отпуск.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончанияОсновногоОтпуска,
	|	Отпуск.ПредоставитьДополнительныйОтпуск КАК ПредоставитьДополнительныйОтпуск,
	|	Отпуск.РасходДнейОтгула КАК РасходДнейОтгула,
	|	Отпуск.РасходЧасовОтгула КАК РасходЧасовОтгула,
	|	Отпуск.КоличествоДнейОтгула КАК КоличествоДнейОтгула,
	|	Отпуск.ВидРасчетаОтгул КАК ВидРасчетаОтгул,
	|	Отпуск.ДокументЗаполнения КАК ДокументЗаполнения,
	|	Отпуск.ДокументЗаполнения.Номер КАК НомерДокументаЗаполнения,
	|	Отпуск.ДокументЗаполнения.Дата КАК ДатаДокументаЗаполнения,
	|	Отпуск.ДоходПолученНаТерриторииРФ КАК ДоходПолученНаТерриторииРФ,
	|	Отпуск.РассчитатьЗарплату КАК РассчитатьЗарплату,
	|	Отпуск.НомерПервичногоДокумента КАК НомерПервичногоДокумента
	|ИЗ
	|	Документ.Отпуск КАК Отпуск
	|ГДЕ
	|	Отпуск.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.НомерСтроки КАК НомерСтроки,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.Территория КАК Территория,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.УсловияТруда КАК УсловияТруда,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.ДоляРаспределения КАК ДоляРаспределения,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.Результат КАК Результат,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.ИдентификаторСтрокиПоказателей КАК ИдентификаторСтрокиПоказателей,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.СуммаВычета КАК СуммаВычета,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.СкидкаПоВзносам КАК СкидкаПоВзносам,
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.РанееНачислено КАК РанееНачислено
	|ИЗ
	|	Документ.Отпуск.РаспределениеПоТерриториямУсловиямТруда КАК ОтпускРаспределениеПоТерриториямУсловиямТруда
	|ГДЕ
	|	ОтпускРаспределениеПоТерриториямУсловиямТруда.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускРаспределениеРезультатовНачислений.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОтпускРаспределениеРезультатовНачислений.Территория КАК Территория,
	|	ОтпускРаспределениеРезультатовНачислений.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ОтпускРаспределениеРезультатовНачислений.СтатьяРасходов КАК СтатьяРасходов,
	|	ОтпускРаспределениеРезультатовНачислений.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
	|	ОтпускРаспределениеРезультатовНачислений.ОблагаетсяЕНВД КАК ОблагаетсяЕНВД,
	|	СУММА(ОтпускРаспределениеРезультатовНачислений.Результат) КАК Результат,
	|	ОтпускРаспределениеРезультатовНачислений.ПодразделениеУчетаЗатрат КАК ПодразделениеУчетаЗатрат
	|ИЗ
	|	Документ.Отпуск.РаспределениеРезультатовНачислений КАК ОтпускРаспределениеРезультатовНачислений
	|ГДЕ
	|	ОтпускРаспределениеРезультатовНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтпускРаспределениеРезультатовНачислений.ПодразделениеУчетаЗатрат,
	|	ОтпускРаспределениеРезультатовНачислений.СтатьяРасходов,
	|	ОтпускРаспределениеРезультатовНачислений.СпособОтраженияЗарплатыВБухучете,
	|	ОтпускРаспределениеРезультатовНачислений.Территория,
	|	ОтпускРаспределениеРезультатовНачислений.ОблагаетсяЕНВД,
	|	ОтпускРаспределениеРезультатовНачислений.СтатьяФинансирования,
	|	ОтпускРаспределениеРезультатовНачислений.ИдентификаторСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускДополнительныеОтпуска.НомерСтроки КАК НомерСтроки,
	|	ОтпускДополнительныеОтпуска.ВидОтпуска КАК ВидОтпуска,
	|	ОтпускДополнительныеОтпуска.ВидРасчета КАК ВидРасчета,
	|	ОтпускДополнительныеОтпуска.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидВремени,
	|	ОтпускДополнительныеОтпуска.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск КАК НачалоПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	ОтпускДополнительныеОтпуска.КонецПериодаЗаКоторыйПредоставляетсяОтпуск КАК КонецПериодаЗаКоторыйПредоставляетсяОтпуск,
	|	ОтпускДополнительныеОтпуска.КоличествоДней КАК КоличествоДней,
	|	ОтпускДополнительныеОтпуска.ДатаНачала КАК ДатаНачала,
	|	ОтпускДополнительныеОтпуска.ДатаОкончания КАК ДатаОкончания,
	|	ОтпускДополнительныеОтпуска.КоличествоДнейКомпенсации КАК КоличествоДнейКомпенсации,
	|	ОтпускДополнительныеОтпуска.ВидРасчетаКомпенсации КАК ВидРасчетаКомпенсации,
	|	ОтпускДополнительныеОтпуска.Основание КАК Основание
	|ИЗ
	|	Документ.Отпуск.ДополнительныеОтпуска КАК ОтпускДополнительныеОтпуска
	|ГДЕ
	|	ОтпускДополнительныеОтпуска.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускНачисления.НомерСтроки КАК НомерСтроки,
	|	ОтпускНачисления.Начисление КАК Начисление,
	|	ОтпускНачисления.ДатаНачала КАК ДатаНачала,
	|	ОтпускНачисления.ДатаОкончания КАК ДатаОкончания,
	|	ОтпускНачисления.Результат КАК Результат,
	|	ОтпускНачисления.Подразделение КАК Подразделение,
	|	ОтпускНачисления.ВидЗанятости КАК ВидЗанятости,
	|	ОтпускНачисления.НормаДней КАК НормаДней,
	|	ОтпускНачисления.НормаЧасов КАК НормаЧасов,
	|	ОтпускНачисления.ОтработаноДней КАК ОтработаноДней,
	|	ОтпускНачисления.ОтработаноЧасов КАК ОтработаноЧасов,
	|	ОтпускНачисления.Сотрудник КАК Сотрудник,
	|	ОтпускНачисления.РасчетнаяБазаЗаЕдиницуНормыВремени КАК РасчетнаяБазаЗаЕдиницуНормыВремени,
	|	ОтпускНачисления.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтрокиВидаРасчета,
	|	ОтпускНачисления.ГрафикРаботы КАК ГрафикРаботы,
	|	ОтпускНачисления.ВидУчетаВремени КАК ВидУчетаВремени,
	|	ОтпускНачисления.ФиксСтрока КАК ФиксСтрока,
	|	ОтпускНачисления.ФиксЗаполнение КАК ФиксЗаполнение,
	|	ОтпускНачисления.ФиксРасчетВремени КАК ФиксРасчетВремени,
	|	ОтпускНачисления.ФиксРасчет КАК ФиксРасчет,
	|	ОтпускНачисления.ВремяВЧасах КАК ВремяВЧасах,
	|	ОтпускНачисления.ГрафикРаботыНорма КАК ГрафикРаботыНорма,
	|	ОтпускНачисления.ВремяВЦеломЗаПериод КАК ВремяВЦеломЗаПериод,
	|	ОтпускНачисления.ОбщийГрафик КАК ОбщийГрафик,
	|	ОтпускНачисления.ПериодРегистрацииВремени КАК ПериодРегистрацииВремени,
	|	ОтпускНачисления.ПериодРегистрацииНормыВремени КАК ПериодРегистрацииНормыВремени,
	|	ОтпускНачисления.СуммаВычета КАК СуммаВычета,
	|	ОтпускНачисления.КодВычета КАК КодВычета,
	|	ОтпускНачисления.УдалитьКодВычета КАК УдалитьКодВычета,
	|	ОтпускНачисления.ОплаченоДней КАК ОплаченоДней,
	|	ОтпускНачисления.ОплаченоЧасов КАК ОплаченоЧасов,
	|	ОтпускНачисления.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.Отпуск.Начисления КАК ОтпускНачисления
	|ГДЕ
	|	ОтпускНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтпускПериодыПриостановкиОтпуска.НомерСтроки КАК НомерСтроки,
	|	ОтпускПериодыПриостановкиОтпуска.ДатаНачалаПериода КАК ДатаНачалаПериода,
	|	ОтпускПериодыПриостановкиОтпуска.ДатаОкончанияПериода КАК ДатаОкончанияПериода,
	|	ОтпускПериодыПриостановкиОтпуска.КоличествоДнейПриостановки КАК КоличествоДнейПриостановки,
	|	ОтпускПериодыПриостановкиОтпуска.Причина КАК Причина
	|ИЗ
	|	Документ.Отпуск.ПериодыПриостановкиОтпуска КАК ОтпускПериодыПриостановкиОтпуска
	|ГДЕ
	|	ОтпускПериодыПриостановкиОтпуска.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результаты = Запрос.ВыполнитьПакет();
	
	РеквизитыДляПроведения = РеквизитыДляПроведенияПустаяСтруктура();
	
	ВыборкаРеквизиты = Результаты[0].Выбрать();
	Пока ВыборкаРеквизиты.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(РеквизитыДляПроведения, ВыборкаРеквизиты);
	КонецЦикла;
	
	РеквизитыДляПроведения.РаспределениеПоТерриториямУсловиямТруда = Результаты[1].Выгрузить();
	РеквизитыДляПроведения.РаспределениеРезультатовНачислений = Результаты[2].Выгрузить();
	РеквизитыДляПроведения.ДополнительныеОтпуска = Результаты[3].Выгрузить();
	РеквизитыДляПроведения.Начисления = Результаты[4].Выгрузить();
	РеквизитыДляПроведения.ПериодыПриостановкиОтпуска = Результаты[5].Выгрузить();

	СотрудникиДаты = Результаты[0].Выгрузить();
	СотрудникиДаты.Колонки.ДатаНачалаСобытия.Имя = "ДатаСобытия";
	РеквизитыДляПроведения.СотрудникиДаты = СотрудникиДаты;
	
	Возврат РеквизитыДляПроведения;
	
КонецФункции

Функция РеквизитыДляПроведенияПустаяСтруктура() Экспорт 
	
	РеквизитыДляПроведенияПустаяСтруктура = Новый Структура(
		"Ссылка,
		|ДокументРассчитан,
		|Организация,
		|ПериодРегистрации,
		|ПорядокВыплаты,
		|Дата,
		|ПланируемаяДатаВыплаты,
		|ДатаНачалаСобытия,
		|ПериодРасчетаСреднегоЗаработкаНачало,
		|ПериодРасчетаСреднегоЗаработкаОкончание,
		|ФизическоеЛицо,
		|ПредоставитьОтгул,
		|ОсвобождатьСтавку,
		|Сотрудник,
		|ДатаНачалаПериодаОтсутствия,
		|ДатаОкончанияПериодаОтсутствия,
		|ИсправленныйДокумент,
		|ВидВремени,
		|Номер,
		|ПредоставитьОсновнойОтпуск,
		|ДатаНачалаОсновногоОтпуска,
		|ДатаОкончанияОсновногоОтпуска,
		|ПредоставитьДополнительныйОтпуск, 
		|РасходДнейОтгула,
		|РасходЧасовОтгула,
		|КоличествоДнейОтгула,
		|ВидРасчетаОтгул,
		|ДополнительныеОтпуска,
		|Начисления,
		|РаспределениеПоТерриториямУсловиямТруда, 
		|ДокументЗаполнения,
		|НомерДокументаЗаполнения,
		|ДатаДокументаЗаполнения,
		|ДоходПолученНаТерриторииРФ,
		|РаспределениеРезультатовНачислений,
		|СотрудникиДаты,
		|РассчитатьЗарплату,
		|ПериодыПриостановкиОтпуска,
		|НомерПервичногоДокумента");
	
	Возврат РеквизитыДляПроведенияПустаяСтруктура;
	
КонецФункции

// Проверяет, что сотрудник, указанный в документе работает в период отсутствия.
//
// Параметры:
//		ДокументОбъект	- ДокументОбъект.Отпуск
//		Отказ			- Булево
//
Процедура ПроверитьРаботающих(ДокументОбъект, Отказ) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ПроверитьРаботающих(ДокументОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеСостоянийСотрудника(РеквизитыДляПроведения) Экспорт 
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеСостоянийСотрудника(РеквизитыДляПроведения);
	КонецЕсли;
	
КонецФункции

Функция ИсключитьИнтервалыИзПериодов(ИсходныйПериод, Интервалы) Экспорт
	
	ТекущийПериод = ИсходныйПериод;
	РезультирующиеПериоды = Новый Массив;
	
	Интервалы.Сортировать("ДатаНачалаПериода");
	
		Для Каждого Интервал Из Интервалы Цикл
			ПериодПересечения = ОбщегоНазначенияБЗК.ПериодПересеченияДвухИнтервалов(ТекущийПериод.ДатаНачалаПериода, 
				ТекущийПериод.ДатаОкончанияПериода,
				Интервал.ДатаНачалаПериода,
				Интервал.ДатаОкончанияПериода);
			Если ПериодПересечения = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТекущийПериод.ДатаНачалаПериода > ПериодПересечения.ДатаНачала
				И ТекущийПериод.ДатаОкончанияПериода < ПериодПересечения.ДатаОкончания Тогда
				ТекущийПериод = Неопределено;
				Прервать;
			КонецЕсли;
			Если ТекущийПериод.ДатаНачалаПериода <> ПериодПересечения.ДатаНачала Тогда
				НовыйПериод = Новый Структура;
				НовыйПериод.Вставить("ДатаНачалаПериода", ТекущийПериод.ДатаНачалаПериода);
				НовыйПериод.Вставить("ДатаОкончанияПериода", НачалоДня(ПериодПересечения.ДатаНачала) - 1);
				РезультирующиеПериоды.Добавить(НовыйПериод);
			КонецЕсли;
			Если ПериодПересечения.ДатаОкончания <> ТекущийПериод.ДатаОкончанияПериода Тогда
				ТекущийПериод.ДатаНачалаПериода = КонецДня(ПериодПересечения.ДатаОкончания) + 1;
			Иначе
				ТекущийПериод = Неопределено;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекущийПериод <> Неопределено Тогда 
			РезультирующиеПериоды.Добавить(ТекущийПериод);
		КонецЕсли;
			
	Возврат РезультирующиеПериоды;
	
КонецФункции

#Область ПечатьРасчетаСреднегоЗаработка

// Заполняет таблицу значений - параметры формирования печатной формы расчета среднего заработка.
//
// Параметры:
//	 МассивСсылок 		- массив, печатаемые документы.
//
Функция ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, ПоСтатьямФинансирования = Ложь, ИмяМакета = "") Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, ПоСтатьямФинансирования, ИмяМакета);
	КонецЕсли;
	
КонецФункции

// Заполняет таблицу значений - параметры формирования печатной формы расчета среднего заработка.
//
// Параметры:
//	 МассивСсылок 		- массив, печатаемые документы.
//
Функция ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка0504425(МассивСсылок) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеДокументовДляПечатиРасчетаСреднегоЗаработка0504425(МассивСсылок);
	КонецЕсли;
	
КонецФункции

// Заполняет таблицу значений - параметры формирования печатной формы расчета среднего заработка.
//
// Параметры:
//	 МассивСсылок 		- массив, печатаемые документы.
//   ДанныеДокумента 	- таблица значений, определяется в
//                      Обработки.ПечатьРасчетаСреднегоЗаработка.ДанныеДокументовРасчетаСреднегоЗаработка.
//   ИмяМакета          - строка, вариант печати расчета среднего заработка.
//
Процедура ЗаполнитьДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, ДанныеДокументов, ИмяМакета) Экспорт
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		МодульКонтракта().ЗаполнитьДанныеДокументовДляПечатиРасчетаСреднегоЗаработка(МассивСсылок, ДанныеДокументов, ИмяМакета);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру - описание документа для формирования печатной формы расчета среднего заработка.
//
// Параметры:
//   ОписаниеДокумента - структура, определяется в
//                       Обработки.ПечатьРасчетаСреднегоЗаработка.ОписаниеДокументаРассчитывающегоСреднийЗаработок.
//
Процедура ЗаполнитьОписаниеДокументаРассчитывающегоСреднийЗаработок(ОписаниеДокумента, ИмяМакета) Экспорт
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	ОписаниеДокумента.Вставить("ИмяДокумента", МетаданныеДокумента.Имя);
	ОписаниеДокумента.Вставить("СинонимДокумента", МетаданныеДокумента.Синоним);
КонецПроцедуры 

#КонецОбласти

#Область ПечатьПодробногоРасчетаНачислений

// Заполняет структуру - описание документа для формирования печатной формы подробного расчета начислений.
//
// Параметры:
//   ОписаниеДокумента - структура, определяется в Обработки.ПечатьРасчетаНачислений.ОписаниеДокументаРасчетаНачислений.
//
Процедура ЗаполнитьОписаниеДокументаРасчетаНачислений(ОписаниеДокумента) Экспорт
	КатегорииСпециализированногоНачисления = Новый Массив;
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Отгул);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодОтпуска);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеКомпенсацияОтпуска);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСДС);
	КатегорииСпециализированногоНачисления.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСДС);
	
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	
	ОписаниеДокумента.Вставить("ИмяДокумента", 								МетаданныеДокумента.Имя);
	ОписаниеДокумента.Вставить("СинонимДокумента", 							МетаданныеДокумента.Синоним);
	ОписаниеДокумента.Вставить("ЕстьРасчетСреднегоЗаработка", 				Истина);
	ОписаниеДокумента.Вставить("ЕстьРасчетСпециализированныхНачислений",	Истина);
	ОписаниеДокумента.Вставить("ЕстьРасчетЗарплаты", 						Истина);
	ОписаниеДокумента.Вставить("КатегорииСпециализированногоНачисления", 	КатегорииСпециализированногоНачисления);
	ОписаниеДокумента.Вставить("НазваниеСпециализированногоНачисления", 	НСтр("ru = 'Отпуск'"));
КонецПроцедуры 

// Заполняет таблицу значений - параметры формирования печатной формы подробного расчета начислений.
//
// Параметры:
//	 МассивСсылок 		- массив, печатаемые документы.
//   ДанныеДокумента 	- таблица значений, определяется в
//                      Обработки.ПечатьРасчетаНачислений.ДанныеДокументовДляПодробногоРасчетаНачислений.
//
Процедура ЗаполнитьДанныеДокументовДляПодробногоРасчетаНачислений(МассивСсылок, ДанныеДокументов) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьДанныеДокументовДляПодробногоРасчетаНачислений(МассивСсылок, ДанныеДокументов);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру с двумя таблицами "Начисления" и "Показатели".
// Данные в таблицах представлены в разрезе ссылки на документ.
// 	Параметры:
//		МассивСсылок - массив ссылок на документы у которых есть табличные части "Начисления" и "Показатели".
//		ИмяДокумента - Имя объекта метаданных (документа) для формирования запроса.
//
Функция НачисленияПоказателиДокументов(МассивСсылок) Экспорт 
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().НачисленияПоказателиДокументов(МассивСсылок);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПечатьСправкиДляОплатыОтпускаЧАЭС

Функция КоличествоОплачиваемыхДнейПоВидуОтпуска(МассивОтпусков, ВидОтпуска) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().КоличествоОплачиваемыхДнейПоВидуОтпуска(МассивОтпусков, ВидОтпуска);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Функция ДатаКомпенсацииОтпуска(ПланируемаяДатаВыплаты, ПериодРегистрации) Экспорт 
	
	ДатаКомпенсации = ?(ПланируемаяДатаВыплаты < ПериодРегистрации, ПериодРегистрации,
		?(ПланируемаяДатаВыплаты > КонецМесяца(ПериодРегистрации), НачалоДня(КонецМесяца(ПериодРегистрации)), ПланируемаяДатаВыплаты));
		
	Возврат ДатаКомпенсации;	
		
КонецФункции	

Функция ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок) Экспорт 	
	
	Возврат МодульКонтракта().ДанныеДляРегистрацииВУчетаСтажаПФР(МассивСсылок);
	
КонецФункции

Функция ПериодОтсутствия(ПериодыОтсутствий) Экспорт
	
	ПериодОтсутствия = Новый Структура("НачалоПериода,ОкончаниеПериода", '00010101', '00010101');
	
	Для каждого Период Из ПериодыОтсутствий Цикл
		Если ЗначениеЗаполнено(Период.НачалоПериода) Тогда
			Если НЕ ЗначениеЗаполнено(ПериодОтсутствия.НачалоПериода) Тогда
				ПериодОтсутствия.НачалоПериода = Период.НачалоПериода;
			Иначе
				ПериодОтсутствия.НачалоПериода = Мин(ПериодОтсутствия.НачалоПериода, Период.НачалоПериода);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Период.ОкончаниеПериода) Тогда
			ПериодОтсутствия.ОкончаниеПериода = Макс(ПериодОтсутствия.ОкончаниеПериода, Период.ОкончаниеПериода);
		КонецЕсли;	   
	КонецЦикла;
	
	Возврат ПериодОтсутствия;
	
КонецФункции

Функция ПериодыОтсутствий(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ПериодыОтсутствий(Объект);
	КонецЕсли;
	
КонецФункции

Функция ВидыОтпусковОбъекта(ТекущийОбъект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ВидыОтпусковОбъекта(ТекущийОбъект);
	КонецЕсли;
	
КонецФункции

// Функция возвращает структуру с описанием данного вида документа.
//
Функция ОписаниеДокумента() Экспорт 
	
	ОписаниеДокумента = Новый Структура;
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		ОписаниеДокумента = МодульКонтракта().ОписаниеДокумента();
	КонецЕсли;
	Возврат ОписаниеДокумента;
	
КонецФункции

Функция ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеДляБухучетаЗарплатыПервичныхДокументов(Объект);
	КонецЕсли;
	
КонецФункции

#Область ПараметрыВыбораНачислений

Функция ДополнительныеПараметрыВыбораНачислений(Документ, ПутьКРеквизиту) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДополнительныеПараметрыВыбораНачислений(Документ, ПутьКРеквизиту);
	КонецЕсли;
	
КонецФункции

Функция КатегорияНачисленияКомпенсацияОтпуска(Документ) Экспорт
	Если Документ.РасчетДенежногоСодержания Тогда
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеКомпенсацияОтпуска;
	Иначе
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска;
	КонецЕсли;
КонецФункции

Функция КатегорияНачисленияОтпуск(Документ) Экспорт
	Если Документ.РасчетДенежногоСодержания Тогда
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ДенежноеСодержаниеНаПериодОтпуска;
	Иначе
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска;
	КонецЕсли;
КонецФункции

Функция КатегорияНачисленияОтпускБезОплаты() Экспорт
	Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты;
КонецФункции

Функция КатегорияНачисленияЕдиновременнойВыплаты(Документ) Экспорт
	Если Документ.РасчетДенежногоСодержания Тогда
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ЕдиновременнаяВыплатаКОтпускуГосслужащего;
	Иначе
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ЕдиновременнаяВыплатаКОтпуску;
	КонецЕсли;
КонецФункции

Функция КатегорияНачисленияМатериальнойПомощи(Документ) Экспорт
	Если Документ.РасчетДенежногоСодержания Тогда
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощьПриОтпускеГосслужащего;
	Иначе
		Возврат Перечисления.КатегорииНачисленийИНеоплаченногоВремени.МатериальнаяПомощьПриОтпуске;
	КонецЕсли;
КонецФункции

#КонецОбласти

Процедура ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента) Экспорт
	
	ЗарплатаКадры.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента, "ДатаНачалаСобытия");
	
КонецПроцедуры

Процедура ЗаполнитьДатыЗапрета(ПараметрыОбновления) Экспорт
	
	ОбновлениеВыполнено = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Отпуск.Ссылка КАК Ссылка,
		|	Отпуск.Дата КАК Дата
		|ИЗ
		|	Документ.Отпуск КАК Отпуск
		|ГДЕ
		|	Отпуск.ДатаЗапрета = ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Отпуск.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбновлениеВыполнено = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, Выборка.Ссылка.Метаданные().ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			
			МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Выборка.Ссылка);
			МенеджерДокумента.ЗаполнитьДатуЗапретаРедактирования(ОбъектДокумента);
			
			ОбъектДокумента.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбновлениеВыполнено);
	
КонецПроцедуры

Процедура ЗаполнитьДатуРасчетаДенежногоСодержания(ПараметрыОбновления = Неопределено) Экспорт
	
	ОбновлениеВыполнено = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	Отпуск.Ссылка КАК Ссылка,
		|	Отпуск.ДатаНачалаСобытия КАК ДатаРасчетаДенежногоСодержания
		|ИЗ
		|	Документ.Отпуск КАК Отпуск
		|ГДЕ
		|	Отпуск.ДатаРасчетаДенежногоСодержания = ДАТАВРЕМЯ(1, 1, 1)
		|	И Отпуск.ДатаНачалаСобытия <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Отпуск.Дата УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбновлениеВыполнено = Ложь;
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(
				ПараметрыОбновления, Выборка.Ссылка.Метаданные().ПолноеИмя(), "Ссылка", Выборка.Ссылка) Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектДокумента.ДатаРасчетаДенежногоСодержания = Выборка.ДатаРасчетаДенежногоСодержания; 
						
			ОбъектДокумента.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектДокумента);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбновлениеВыполнено);
	
КонецПроцедуры

Процедура ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьИсходныеДанныеПерерасчетов(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

Функция КоличествоДнейОтпускаАвансом(КоличествоДнейОтпуска, ОстатокОтпуска) Экспорт
	
	Остаток = ?(ОстатокОтпуска = Неопределено, 0, ОстатокОтпуска);
	Возврат Мин(КоличествоДнейОтпуска, Макс(КоличествоДнейОтпуска - Остаток, 0));
	
КонецФункции

Функция ОстаткиВРазрезеВидовОтпусков(Сотрудник, ДатаНачалаСобытия, ИсключаемыеРегистраторы) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОстаткиВРазрезеВидовОтпусков(Сотрудник, ДатаНачалаСобытия, ИсключаемыеРегистраторы);
	КонецЕсли;
	
КонецФункции

Процедура ИсправитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления = Неопределено) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ИсправитьДвиженияЗанятостьПозицийШтатногоРасписания(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоДнейПриостановки(ДокументОбъект, СтрокаПериодов) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ЗаполнитьКоличествоДнейПриостановки(ДокументОбъект, СтрокаПериодов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеНовогоДокумента

Функция ДанныеНовогоДокумента() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ДанныеНовогоДокумента();
	КонецЕсли;
	
КонецФункции

Функция СоздатьНовыйДокумент(ДанныеНовогоДокумента) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СоздатьНовыйДокумент(ДанныеНовогоДокумента);
	КонецЕсли;
	
КонецФункции	

Процедура ЗаполнитьПериодРасчетаСреднегоЗаработка(Объект) Экспорт
	
	МодульКонтракта().ЗаполнитьПериодРасчетаСреднегоЗаработка(Объект);
	
КонецПроцедуры	
	
Функция ПериодРасчетаСреднегоЗаработкаИзменился(Объект, ПериодРасчетаСреднего) Экспорт
	Возврат НачалоМесяца(Объект.ПериодРасчетаСреднегоЗаработкаНачало) <> НачалоМесяца(ПериодРасчетаСреднего.ДатаНачала) 
	Или	НачалоМесяца(Объект.ПериодРасчетаСреднегоЗаработкаОкончание) <> НачалоМесяца(ПериодРасчетаСреднего.ДатаОкончания);	
КонецФункции	

Функция ТолькоКомпенсация(Объект) Экспорт
	
	Возврат Объект.ПредоставитьКомпенсациюОсновногоОтпуска И Не Объект.ПредоставитьОсновнойОтпуск И Не Объект.ПредоставитьДополнительныйОтпуск
		Или (Не Объект.ПредоставитьОсновнойОтпуск И Объект.ПредоставитьДополнительныйОтпуск 
		И Объект.ДополнительныеОтпуска.Итог("КоличествоДней") = 0 И Объект.ДополнительныеОтпуска.Итог("КоличествоДнейКомпенсации") > 0);
	
КонецФункции
	
Процедура ОбновитьДлительностьИнтервалов(Объект, ОтпускВРабочихДняхПоДоговору) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().ОбновитьДлительностьИнтервалов(Объект, ОтпускВРабочихДняхПоДоговору);
	КонецЕсли;
	
КонецПроцедуры
	
Функция РассчитатьОстаткиОтпусков(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().РассчитатьОстаткиОтпусков(Объект);
	КонецЕсли;
	
КонецФункции

Процедура УстановитьКоличествоДнейОтпускаАвансом(Объект, ОстатокОтпускаСотрудника) Экспорт	
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().УстановитьКоличествоДнейОтпускаАвансом(Объект, ОстатокОтпускаСотрудника);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКоличествоДнейОсновногоОтпускаАвансом(Объект, ОстатокОтпускаСотрудника) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().УстановитьКоличествоДнейОсновногоОтпускаАвансом(Объект, ОстатокОтпускаСотрудника);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКоличествоДнейДополнительногоОтпускаАвансом(СтрокаОтпуска, ОстатокОтпускаСотрудника, ЭтоЕжегодныйОтпуск) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().УстановитьКоличествоДнейДополнительногоОтпускаАвансом(СтрокаОтпуска, ОстатокОтпускаСотрудника, ЭтоЕжегодныйОтпуск);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДатуНачалаСобытия(Объект) Экспорт
	
	Объект.ДатаНачалаСобытия = Неопределено;
	
	Если Объект.ПредоставитьОсновнойОтпуск Тогда
		Если ЗначениеЗаполнено(Объект.ДатаНачалаОсновногоОтпуска) Тогда
			Объект.ДатаНачалаСобытия = Объект.ДатаНачалаОсновногоОтпуска;
		Иначе 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ПредоставитьДополнительныйОтпуск И Объект.ДополнительныеОтпуска.Количество() > 0 Тогда
		Для каждого ДополнительныйОтпуск Из Объект.ДополнительныеОтпуска Цикл
			Если ЗначениеЗаполнено(ДополнительныйОтпуск.ДатаНачала) Тогда 
				Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСобытия) Или Объект.ДатаНачалаСобытия > ДополнительныйОтпуск.ДатаНачала Тогда
					Объект.ДатаНачалаСобытия = ДополнительныйОтпуск.ДатаНачала;
				КонецЕсли; 
			ИначеЕсли ЗначениеЗаполнено(ДополнительныйОтпуск.КоличествоДнейКомпенсации) Тогда
				Продолжить;
			Иначе 
				Объект.ДатаНачалаСобытия = Неопределено;
				Возврат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСобытия) Тогда
		Если Объект.ПредоставитьКомпенсациюОсновногоОтпуска И ЗначениеЗаполнено(Объект.ИсправленныйДокумент) Тогда
			Объект.ДатаНачалаСобытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИсправленныйДокумент, "ДатаНачалаСобытия");
		ИначеЕсли ТолькоКомпенсация(Объект) Тогда
			ДатаВыплаты = ?(ЗначениеЗаполнено(Объект.ПланируемаяДатаВыплаты), Объект.ПланируемаяДатаВыплаты + 86400, Объект.Дата);
			Объект.ДатаНачалаСобытия = Документы.Отпуск.ДатаКомпенсацииОтпуска(ДатаВыплаты, Объект.ПериодРегистрации);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСобытия) Тогда
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Объект.Сотрудник, "ДатаПриема");
		Если КадровыеДанные.Количество() > 0 
			И ЗначениеЗаполнено(КадровыеДанные[0].ДатаПриема) 
			И НачалоМесяца(КадровыеДанные[0].ДатаПриема) = НачалоМесяца(Объект.ПериодРегистрации)
			И КадровыеДанные[0].ДатаПриема > Объект.ПериодРегистрации Тогда
			// Если сотрудник принят в месяце начисления, то установим дату начал события равной дате приема.
			Объект.ДатаНачалаСобытия = КадровыеДанные[0].ДатаПриема;
		Иначе
			// Если не смогли определить дату начала события и сотрудник работает не первый месяц, то установим датой начала
			// события начало месяца.
			Объект.ДатаНачалаСобытия = Объект.ПериодРегистрации;
		КонецЕсли;
	КонецЕсли;
		
	Объект.ДатаРасчетаДенежногоСодержания = Объект.ДатаНачалаСобытия;
КонецПроцедуры

Процедура УстановитьКоличествоДнейОсновногоОтпуска(Объект, ОтпускВРабочихДняхПоДоговору) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().УстановитьКоличествоДнейОсновногоОтпуска(Объект, ОтпускВРабочихДняхПоДоговору);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьОбщийПериодОтпуска(Объект) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		МодульКонтракта().УстановитьОбщийПериодОтпуска(Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеСотрудника(Документ) Экспорт
	Документ.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Сотрудник, "ФизическоеЛицо");
КонецПроцедуры
	
#КонецОбласти
	
#Область ЗаполнениеИРасчет	

Функция ОписаниеДокументаРасчета() Экспорт
	
	ОписаниеДокументаРасчета = Новый Структура;
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		ОписаниеДокументаРасчета = МодульКонтракта().ОписаниеДокументаРасчета();
	КонецЕсли;
	Возврат ОписаниеДокументаРасчета;
	
КонецФункции

Процедура ОчиститьРассчитанныеДанные(ДанныеОбъекта, ПерезаполнитьНачисления = Истина, ОчищатьДенежноеСодержание = Истина) Экспорт
	Если ПерезаполнитьНачисления Тогда
		ДанныеОбъекта.Начисления.Очистить();
		ДанныеОбъекта.НачисленияПерерасчет.Очистить();
		ДанныеОбъекта.НачисленияПерерасчетНулевыеСторно.Очистить();
		ДанныеОбъекта.РаспределениеПоТерриториямУсловиямТруда.Очистить();
		ДанныеОбъекта.РаспределениеРезультатовНачислений.Очистить();
		Если ОчищатьДенежноеСодержание Тогда
			ДанныеОбъекта.Показатели.Очистить();
		Иначе
			Показателей = ДанныеОбъекта.Показатели.Количество();
			Для Сч = 1 По Показателей Цикл
				СтрокаПоказателя = ДанныеОбъекта.Показатели[Показателей-Сч];
				Если ДанныеОбъекта.ДенежноеСодержание.Найти(СтрокаПоказателя.ИдентификаторСтрокиВидаРасчета,"ИдентификаторСтрокиВидаРасчета") = Неопределено Тогда
					ДанныеОбъекта.Показатели.Удалить(СтрокаПоказателя);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДанныеОбъекта.ПогашениеЗаймов.Очистить();
		ДанныеОбъекта.УправленческиеНачисления.Очистить();
	КонецЕсли;
	
	ДанныеОбъекта.Удержания.Очистить();
	ДанныеОбъекта.РаспределениеРезультатовУдержаний.Очистить();
	
	ДанныеОбъекта.НДФЛ.Очистить();
	ДанныеОбъекта.КорректировкиВыплаты.Очистить();
	ДанныеОбъекта.ПримененныеВычетыНаДетейИИмущественные.Очистить();
КонецПроцедуры

Функция НачальныйПериодРасчетаЗарплаты(ДанныеОбъекта) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().НачальныйПериодРасчетаЗарплаты(ДанныеОбъекта);
	КонецЕсли;
	
КонецФункции

Функция ПериодРасчетаЗарплатыДоНачалаОтпуска(ДанныеОбъекта, НачалоПериода = Неопределено) Экспорт
	
	Если Не ДанныеОбъекта.РассчитатьЗарплату Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если НачалоПериода = Неопределено Тогда
		НачалоПериода = НачальныйПериодРасчетаЗарплаты(ДанныеОбъекта).ДатаНачала;
	КонецЕсли;
	
	Если ДанныеОбъекта.ДатаНачалаСобытия <= НачалоПериода Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПериодВыявления = Новый СтандартныйПериод(
		НачалоПериода,
		Мин(КонецМесяца(НачалоПериода), НачалоДня(ДанныеОбъекта.ДатаНачалаСобытия) - 1));
	
	Возврат ПериодВыявления;
	
КонецФункции

Функция ОтпускНачинаетсяВСледующемМесяце(ДанныеДокумента, НачалоПериода) Экспорт
	
	Возврат ДанныеДокумента.ДатаНачалаСобытия > КонецМесяца(НачалоПериода);
	
КонецФункции

Функция СпособыРасчетаСреднегоЗаработка() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().СпособыРасчетаСреднегоЗаработка();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыНачислений() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыНачислений();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыПерерасчетов() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыПерерасчетов();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыПерерасчетовНулевыеСторно() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыПерерасчетовНулевыеСторно();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыУдержаний() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыУдержаний();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыНДФЛ() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыНДФЛ();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыПогашениеЗаймов() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыПогашениеЗаймов();
	КонецЕсли;
	
КонецФункции

Функция ОписаниеТаблицыКорректировкиВыплаты() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат МодульКонтракта().ОписаниеТаблицыКорректировкиВыплаты();
	КонецЕсли;
	
КонецФункции

Функция ПараметрыРасчета() Экспорт
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СохранятьИсправления", Истина);
	ПараметрыРасчета.Вставить("ПерезаполнитьНачисления", Истина);
	ПараметрыРасчета.Вставить("ОбновитьДанныеДляРасчетаСреднего", Ложь);
	ПараметрыРасчета.Вставить("ОбновитьРасчетДенежногоСодержания", Ложь);
	ПараметрыРасчета.Вставить("СкорректированСреднийЗаработок", Ложь);
	Возврат ПараметрыРасчета;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ДополнительнаяИнформация.Вставить("ТипДанныхОбъектаФормы", Метаданные.Документы.Отпуск);
	ЗарплатаКадры.ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
