#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Сотрудник") И ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник) Тогда
			ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения.Сотрудник);
		КонецЕсли;
	КонецЕсли;
		
	Документы.Отпуск.МодульКонтракта().ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.Отпуск.МодульКонтракта().ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения)
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Документы.Отпуск.МодульКонтракта().ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Документы.Отпуск.МодульКонтракта().ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Документы.Отпуск.ЗаполнитьДатуЗапретаРедактирования(ЭтотОбъект);
	
	Документы.Отпуск.МодульКонтракта().ПередЗаписью(ЭтотОбъект,Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Документы.Отпуск.МодульКонтракта().ПриЗаписи(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Документы.Отпуск.МодульКонтракта().ПриКопировании(ЭтотОбъект, ОбъектКопирования);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьФлажкиНаличияВидовОтпусков() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Документы.Отпуск.МодульКонтракта().ЗаполнитьФлажкиНаличияВидовОтпусков(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#Область ПроверкаЗаполненияДокумента

Функция ДокументГотовКРасчету(ВыводитьСообщения = Истина) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат Документы.Отпуск.МодульКонтракта().ДокументГотовКРасчету(ЭтотОбъект, ВыводитьСообщения);
	КонецЕсли;
	
КонецФункции

Функция РезультатПроверкиПересеченийПериодовОтсутствия() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат Документы.Отпуск.МодульКонтракта().РезультатПроверкиПересеченийПериодовОтсутствия(ЭтотОбъект);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеИРасчет	

Функция ПараметрыРасчета() Экспорт
	Возврат Документы.Отпуск.ПараметрыРасчета();
КонецФункции

Процедура Рассчитать(ПараметрыРасчета = Неопределено) Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Документы.Отпуск.МодульКонтракта().Рассчитать(ЭтотОбъект, ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

Функция НачатьНовуюТранзакцию() Экспорт 
	Если ТранзакцияАктивна() Тогда
		Возврат Ложь;
	Иначе
		НачатьТранзакцию();
		Возврат Истина;
	КонецЕсли;		
КонецФункции

Функция ДанныеДляВременнойРегистрацииНачислений() Экспорт
	
	Если ЗарплатаКадры.РасширенныйРежим() Тогда
		Возврат Документы.Отпуск.МодульКонтракта().ДанныеДляВременнойРегистрацииНачислений(ЭтотОбъект);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
