#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = Параметры.Дата;
	Сотрудник = Параметры.Сотрудник;
	ИдентификаторСтрокиСотрудника = Параметры.ИдентификаторСтрокиСотрудника;
	
	Если Параметры.ДанныеОВремени <> Неопределено Тогда
		
		ДанныеОВремени = ПолучитьИзВременногоХранилища(Параметры.ДанныеОВремени);
		ЗаполнитьДанныеОВремени(ДанныеОВремени);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура OK(Команда) 
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	РезультатыРедактирования = Новый Структура;
	РезультатыРедактирования.Вставить("Модифицированность", Модифицированность);
	РезультатыРедактирования.Вставить("Дата", Дата);
	РезультатыРедактирования.Вставить("ИдентификаторСтрокиСотрудника", ИдентификаторСтрокиСотрудника);
	РезультатыРедактирования.Вставить("ДанныеОВремени", ДанныеОВремениРезультатРедактирования());
	
	Модифицированность = Ложь;
	Закрыть(РезультатыРедактирования);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОВремени(ДанныеОВремени)
	
	Для Каждого Стр Из ДанныеОВремени Цикл
		
		НоваяСтрока = ДанныеОВремениПодробно.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.СуточныйВидВремени) Тогда
			НоваяСтрока.СуточныйВидВремени = Перечисления.ВидыВремениСуток.ДневноеВремя;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ДанныеОВремениРезультатРедактирования()
	
	Для Каждого Стр Из ДанныеОВремениПодробно Цикл
		Стр.Дата = Дата;
		Стр.ИдентификаторСтрокиСотрудника = ИдентификаторСтрокиСотрудника;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеОВремениПодробно.Выгрузить());
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВременнойИнтервалВДесятичныеЧасы(НачалоИнтервала, КонецИнтервала)
	
	ВремяНачала = НачалоИнтервала;
	ВремяОкончания = КонецИнтервала;
	
	Если ВремяНачала > ВремяОкончания Тогда
		ВремяОкончания = ВремяОкончания + 24 * 3600;
	КонецЕсли;
	
	Возврат (ВремяОкончания - ВремяНачала) / 3600;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтработаноЧасов()
	
	ТекущиеДанные = Элементы.ДанныеОВремениПодробно.ТекущиеДанные;
	ТекущиеДанные.ОтработаноЧасов = ВременнойИнтервалВДесятичныеЧасы(ТекущиеДанные.ВремяНачала, ТекущиеДанные.ВремяОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеОВремениПодробно

 &НаКлиенте
Процедура ДанныеОВремениПодробноВремяНачалаПриИзменении(Элемент)
	
	ОбновитьОтработаноЧасов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОВремениПодробноВремяОкончанияПриИзменении(Элемент)
	
	ОбновитьОтработаноЧасов();
	
КонецПроцедуры

#КонецОбласти