#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Характеристики персонала";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Характеристики персонала", СтатистикаХарактеристикПерсонала());
	Статистика.Вставить("Характеристики персонала(Действия сотрудников)", СтатистикаДействийСотрудников());
	Статистика.Вставить("Характеристики персонала(Компетенции персонала)", СтатистикаКомпетенцийПерсонала());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаХарактеристикПерсонала()
	
	Таблица = Метаданные.ПланыВидовХарактеристик.ХарактеристикиПерсонала;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Характеристик";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ВидХарактеристики;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов характеристик";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.ВАрхиве = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаДействийСотрудников()
	
	Родитель = Метаданные.Справочники.ДействияСотрудников;
	Таблица = Родитель.ТабличныеЧасти.ХарактеристикиПерсонала;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Характеристика;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Характеристик";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Действие сотрудников";
	ДанныеГруппировки.ПредставлениеГруппировки = "Действий сотрудников";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаКомпетенцийПерсонала()
	
	Родитель = Метаданные.Справочники.КомпетенцииПерсонала;
	Таблица = Родитель.ТабличныеЧасти.ХарактеристикиПерсонала;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Характеристика;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Характеристик";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Компетенция";
	ДанныеГруппировки.ПредставлениеГруппировки = "Компетенций";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.ВАрхиве = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти