#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл
		
		Если ЗначениеЗаполнено(ЗаписьРегистра.ДатаОтзыва)
			И ЗаписьРегистра.ДатаОтзыва <= ЗаписьРегистра.Период Тогда
			ТекстОшибки = НСтр("ru='Дата отзыва ключа должна быть больше даты выдачи'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеестрКлючейПростыхЭлектронныхПодписей.Период КАК ДатаВыдачи,
		|	РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва КАК ДатаОтзыва
		|ИЗ
		|	РегистрСведений.РеестрКлючейПростыхЭлектронныхПодписейПОД КАК РеестрКлючейПростыхЭлектронныхПодписей
		|ГДЕ
		|	РеестрКлючейПростыхЭлектронныхПодписей.Пользователь = &Пользователь
		|	И (РеестрКлючейПростыхЭлектронныхПодписей.Период > &НоваяДатаВыдачи
		|				И (&НоваяДатаОтзыва = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ &НоваяДатаОтзыва >= РеестрКлючейПростыхЭлектронныхПодписей.Период)
		|			ИЛИ РеестрКлючейПростыхЭлектронныхПодписей.Период < &НоваяДатаВыдачи
		|				И (РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ РеестрКлючейПростыхЭлектронныхПодписей.ДатаОтзыва >= &НоваяДатаВыдачи))";
		
		Запрос.УстановитьПараметр("Пользователь", ЗаписьРегистра.Пользователь);
		Запрос.УстановитьПараметр("НоваяДатаВыдачи", ЗаписьРегистра.Период);
		Запрос.УстановитьПараметр("НоваяДатаОтзыва", ЗаписьРегистра.ДатаОтзыва);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			ТекстОшибки = НСтр("ru='У пользователя уже есть активный ключ ПЭП в данном периоде'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
