//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  СтрокаДляПоиска - Строка
//  ИскомаяСтрока - Строка
//  НаправлениеПоискаЧисло - Число
// 
// Возвращаемое значение:
//  Число
Функция НайтиВСтроке(СтрокаДляПоиска, ИскомаяСтрока, НаправлениеПоискаЧисло = 1) Экспорт
	
	Направление = ?(НаправлениеПоискаЧисло = 1, НаправлениеПоиска.СНачала, НаправлениеПоиска.СКонца); // НаправлениеПоиска
	
	Возврат СтрНайти(СтрокаДляПоиска, ИскомаяСтрока, Направление);
	
КонецФункции

// Параметры:
//  ДанныеСайтов - См. РекрутинговыеСайтыСлужебный.ДанныеСайтов
//  ИмяРеквизитаФормы - Строка
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
// 
// Возвращаемое значение:
//  Строка - Имя реквизита
Функция ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт) Экспорт
	
	ДанныеСайта = ДанныеСайтов[Сайт]; // См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
	ИмяРеквизита = СтрШаблон("%1%2", ИмяРеквизитаФормы, ДанныеСайта.Имя);
	
	Возврат ИмяРеквизита;
	
КонецФункции

Функция УникальноеИмяРеквизита() Экспорт
	
	Возврат ЗарплатаКадрыРасширенныйКлиентСервер.УникальноеИмяРеквизита();
	
КонецФункции

// Параметры:
//  UrlРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция АдресРезюмеПоUrlРезюме(UrlРезюме) Экспорт
	
	ПозицияСимвола = НайтиВСтроке(UrlРезюме, "?");
	Если ПозицияСимвола > 0 Тогда
		Возврат Лев(UrlРезюме, ПозицияСимвола - 1);
	КонецЕсли;
	
	Возврат UrlРезюме;
	
КонецФункции

// Параметры:
//  ТекстHTML - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИзвлечьТекстИзHTML(Знач ТекстHTML) Экспорт
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "</p>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "</li>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br/>", Символы.ПС);
	ТекстHTML = СтрЗаменить(ТекстHTML, "<br />", Символы.ПС);
	
	Возврат СтроковыеФункцииКлиентСервер.ИзвлечьТекстИзHTML(ТекстHTML);
	
КонецФункции

#КонецОбласти
