
#Область ПрограммныйИнтерфейс

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиент.ВыполнитьДействие
//
Процедура ВыполнитьДействиеПодключение1СЭДО(ОписаниеДействия) Экспорт
КонецПроцедуры 

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиент.ВыполнитьДействие
//
Процедура ВыполнитьДействиеФинОтчетность(ОписаниеДействия) Экспорт
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиент.ВыполнитьКомандуСпискаЗадачМобильныйКлиент
//
Процедура ПриВыполненииКомандыСпискаЗадачМобильныйКлиент(ПараметрыКоманды) Экспорт
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиент.ОтметитьЗадачуКакВыполненную
//
Процедура ПроверитьОтметитьЗадачуКакВыполненную(ПараметрыКоманды, Форма, ТекстВопроса, ЗадатьВопрос) Экспорт
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераКлиент.РасшифроватьСообщения
//
Процедура ПроверитьРасшифроватьСообщения(Организация, НеРасшифровывать) Экспорт
КонецПроцедуры

// Обработчик команды "Открыть 1С:ФинОтчетность" формы СписокЗадач
//
Процедура Открыть1СФинОтчетность(Команда) Экспорт
КонецПроцедуры

#КонецОбласти
