#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)

	Если ЗарплатаКадры.БазовыйРежим() Тогда
		// Проверка значения свойства ОбменДанными.Загрузка отсутствует по причине того, что в расположенным ниже коде,
		// реализована логика, которая должна выполняться в том числе при установке этого свойства равным Истина.
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОтражениеЗарплатыВБухучетеБазовый");
		Модуль.ПриЗаписиКонстантыИспользоватьНачислениеЗарплаты(ЭтотОбъект);
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Значение = Ложь Тогда
		Если ЗарплатаКадры.БазовыйРежим() Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизацийСобытия");
			Модуль.ПриОтключенииНачисленияЗарплаты();
		КонецЕсли;
	КонецЕсли;
	
	// Синхронизация интерфейсных констант
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизацийСобытия");
		Модуль.ПриУстановкеЗначенияИспользоватьНачислениеЗарплаты(Значение);
	Иначе
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыРасширенныйСобытия");
		Модуль.ПриУстановкеЗначенияИспользоватьНачислениеЗарплаты(Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
