
#Область СлужебныеПроцедурыИФункции

Функция ДокументМенеджерОтменяющейЗаявки(ОтменяемаяЗаявка) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.ДокументМенеджерОтменяющейЗаявки(ОтменяемаяЗаявка);

КонецФункции

Функция ДокументМенеджерПоТипуОбъекта(ТипОбъекта, Объект) Экспорт
	
	Возврат ЗаявкиСотрудниковРасширенный.ДокументМенеджерПоТипуОбъекта(ТипОбъекта, Объект);

КонецФункции

Функция КоличествоДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.КоличествоДнейОтпуска(Сотрудник, ДатаНачала, ДатаОкончания);

КонецФункции

Процедура ЗаполнитьДанныеПоВидамОтпусков(Объект, ДанныеПоВидамОтпусков) Экспорт

	ЗаявкиСотрудниковРасширенный.ЗаполнитьДанныеПоВидамОтпусков(Объект, ДанныеПоВидамОтпусков);

КонецПроцедуры

Процедура УстановитьНовуюФотографию(Форма) Экспорт

	ЗаявкиСотрудниковРасширенный.УстановитьНовуюФотографию(Форма);

КонецПроцедуры

Процедура ЗаполнитьФайлыОтветаЗаявокДляВыгрузки(Заявки, ТипДанных, ТаблицаФайлов) Экспорт

	ЗаявкиСотрудниковРасширенный.ЗаполнитьФайлыОтветаЗаявокДляВыгрузки(Заявки, ТипДанных, ТаблицаФайлов);

КонецПроцедуры

Функция ВладелецЗаявкаСотрудника(Ссылки) Экспорт
	
	Возврат ЗаявкиСотрудниковРасширенный.ВладелецЗаявкаСотрудника(Ссылки);
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	ЗаявкиСотрудниковРасширенный.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Функция МестаПозицийВСтруктуреПредприятия(Позиции, ДатаПолученияДанных) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.МестаПозицийВСтруктуреПредприятия(Позиции, ДатаПолученияДанных);

КонецФункции

Функция ПодписанныеФайлыЗаявок() Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.ПодписанныеФайлыЗаявок();

КонецФункции

Функция ТипЗаявкаСотрудникаСправкаСМестаРаботы() Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.ТипЗаявкаСотрудникаСправкаСМестаРаботы();

КонецФункции

Функция ТипЗаявкаСотрудникаСправкаОстаткиОтпусков() Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.ТипЗаявкаСотрудникаСправкаОстаткиОтпусков();

КонецФункции

Функция ЗаявкаВыполненаАвтоматически(ЗаявкаОбъект) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.ЗаявкаВыполненаАвтоматически(ЗаявкаОбъект);

КонецФункции

Процедура СоздатьБронированиеБилетовПроживания(ЗаявкаОбъект, ДанныеДляБронирования) Экспорт

	ЗаявкиСотрудниковРасширенный.СоздатьБронированиеБилетовПроживания(ЗаявкаОбъект, ДанныеДляБронирования)

КонецПроцедуры

Процедура ДополнитьРолиИсполнителейЗадач(Роли) Экспорт

	ЗаявкиСотрудниковРасширенный.ДополнитьРолиИсполнителейЗадач(Роли);

КонецПроцедуры

Процедура УдалитьНедоступныеРолиИсполнителейЗадач(Роли) Экспорт

	ЗаявкиСотрудниковРасширенный.УдалитьНедоступныеРолиИсполнителейЗадач(Роли);

КонецПроцедуры

Процедура ПриНачальномЗаполненииРолейИсполнителей(КодыЯзыков, Элементы, ТабличныеЧасти, ОбъектАдресацииПодразделение) Экспорт

	ЗаявкиСотрудниковРасширенный.ПриНачальномЗаполненииРолейИсполнителей(КодыЯзыков, Элементы, ТабличныеЧасти, ОбъектАдресацииПодразделение)

КонецПроцедуры

Функция БанковскийСчетФизическогоЛица(Банк, НомерСчета, ФизическоеЛицо) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.БанковскийСчетФизическогоЛица(Банк, НомерСчета, ФизическоеЛицо);

КонецФункции

Функция СпособВыплатыЗарплатыЧерезБанкЗаполнен(Сотрудник, БанковскийСчет) Экспорт

	Возврат ЗаявкиСотрудниковРасширенный.СпособВыплатыЗарплатыЧерезБанкЗаполнен(Сотрудник, БанковскийСчет);

КонецФункции

#КонецОбласти