///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ИнтеграцияСБиблиотекойСтандартныхПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
//
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПоискВСервисе", Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбщиеМетоды

// Выводит на произвольную форму элементы панели Помощь.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  КоманднаяПанельТехПоддержка - КоманднаяПанель, Неопределено - командная панель формы, в которую
//    необходимо вывести подменю с кнопками обращения в тех поддержку. Если не задано, то подменю выводится в
//    основную командную панель формы Форма.КоманднаяПанель.
//  ГруппаПоиск - ГруппаФормы, Неопределено - группа, в которую необходимо вывести поле для поиска информации.
//    Если не задано, то выводится в начало формы.
//  ТиповаяФорма - Булево - Истина, если происходит работа через типовую форму БИП.
//
Процедура ПриСозданииНаСервереСлужебный(
		Форма,
		КоманднаяПанельТехПоддержка = Неопределено,
		ГруппаПоиск = Неопределено,
		ТиповаяФорма = Ложь) Экспорт
	
	ПараметрыБИП = НовыйПараметрыПодсистемы(ТиповаяФорма);
	ПроверитьПараметрыСтрокиПоиска(ПараметрыБИП.ПараметрыРаздела.ПараметрыПоиска, ТиповаяФорма);
	
	ПараметрыТехПоддержка = СоздатьКомандыПодменюТехПоддержка(
		Форма,
		ПараметрыБИП.ПараметрыРаздела,
		ПараметрыБИП.Команды);
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"БИП_ПанельПомощьПараметры",
			Новый ОписаниеТипов("Неопределено")));
	
	КоманднаяПанельТехПоддержкаФакт = ВывестиПодменюТехПоддержка(
		Форма,
		КоманднаяПанельТехПоддержка,
		ПараметрыТехПоддержка);
	
	ВывестиСтрокуПоиска(
		Форма,
		ПараметрыБИП,
		ГруппаПоиск,
		ТиповаяФорма,
		КоманднаяПанельТехПоддержкаФакт);

	Форма.ИзменитьРеквизиты(НовыеРеквизиты);
	Форма.БИП_ПанельПомощьПараметры = ПараметрыБИП;
	
КонецПроцедуры

// Формирует уникальный идентификатор, преобразует его в строку и заменяет в нем символ "-" на "_",
//  чтобы его можно использовать в именах реквизитов и элементов формы.
//  
// Возвращаемое значение:
//  Строка - идентификатор.
// 
Функция НовыйИдентификаторДляИмени() Экспорт
	
	УИД = Строка(Новый УникальныйИдентификатор());
	УИД = СтрЗаменить(УИД, "-", "_");
	
	Возврат УИД;
	
КонецФункции

// Определяет, сколько колонок для вывода прикладных карточек должно использоваться в зависимости от
// разрешения экрана по ширине.
// Примечание: учитывается только разрешение главного экрана, либо экрана на который выведено основное окно.
// Более подробно см. описание метода ПолучитьИнформациюЭкрановКлиента в синтакс-помощнике.
// 
// Количество колонок определяется по следующему алгоритму:
//   - до 1279 точек - 2 колонки.
//   - от 1280 до 1919 точек - 3 колонки.
//   - от 1920 точек - 4 колонки.
//
// Возвращаемое значение:
//  Число - количество колонок.
//
Функция КоличествоКолонокПоРазрешению() Экспорт
	
	ИнформацияЭкранов = ПолучитьИнформациюЭкрановКлиента();
	Если ИнформацияЭкранов = Неопределено Тогда
		Возврат 4;
	КонецЕсли;
	
	Если ИнформацияЭкранов[0].Ширина < 1280 Тогда
		Возврат 2;
	ИначеЕсли ИнформацияЭкранов[0].Ширина >= 1920 Тогда
		Возврат 4;
	Иначе
		Возврат 3;
	КонецЕсли;
	
КонецФункции

// Формирует размеры всех элементов формы панели помощь в зависимости от целевого количества
//  колонок типовых карточек.
// 
// Параметры:
//  КоличествоКолонок - Число - указывает, сколько колонок будет использоваться для вывода типовых карточек.
// 
// Возвращаемое значение:
//  Структура - размеры элементов формы:
//    * Карточка - Число - ширина прикладной карточки по умолчанию.
//    * ТекстКарточки - Число - максимальная ширина текста в карточке.
//    * КнопкаКарточки - Число - ширина кнопки карточки, если они выводятся в интерфейсе Такси.
//    * КнопкаИсточникиПоиска - Число - ширина кнопки выбора источника поиска.
//    * КнопкаПоиска - Число - ширина кнопки поиска.
//    * ИнтервалКарточек - ИнтервалМеждуЭлементамиФормы - интервал между карточками.
//    * ОбщаяШирина - Число - общая ширина всех выводимых элементов в интерфейсе 8.5.
//    * ОбщаяШиринаТакси - Число - общая ширина всех выводимых элементов в интерфейсе Такси.
//    * КоличествоПереключателей - Число - максимальное количество переключателей в виде точек, позволяющих
//        выполнить переход на произвольную страницу карусели. Если количество сообщений карусели превосходит
//        указанное значение, то эти кнопки не выводятся.
// 
Функция РазмерыЭлементов(КоличествоКолонок = 3) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Карточка", 23);
	Результат.Вставить("ТекстКарточки", 23);
	Результат.Вставить("КнопкаКарточки", 22);
	Результат.Вставить("КнопкаИсточникиПоиска", 4);
	Результат.Вставить("КнопкаПоиска", 9);
	Результат.Вставить("ИнтервалКарточек", ИнтервалМеждуЭлементамиФормы.Одинарный);
	
	Если КоличествоКолонок = 2 Тогда
		Результат.Вставить("ОбщаяШирина", 47);
		Результат.Вставить("ОбщаяШиринаТакси", 45);
		Результат.Вставить("КоличествоПереключателей", 15);
	ИначеЕсли КоличествоКолонок = 3 Тогда
		Результат.Вставить("ОбщаяШирина", 70);
		Результат.Вставить("ОбщаяШиринаТакси", 67);
		Результат.Вставить("КоличествоПереключателей", 20);
		Результат.Вставить("ИнтервалКарточек", ИнтервалМеждуЭлементамиФормы.Половинный);
	Иначе
		Результат.Вставить("ОбщаяШирина", 96);
		Результат.Вставить("ОбщаяШиринаТакси", 91);
		Результат.Вставить("КоличествоПереключателей", 25);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Карточки

// Выводит типовые карточки/кнопки на форму
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  ПараметрыВывода - см. НовыйПараметрыВыводаКарточек.
//  Документация - Строка - ссылка на документацию. Задается свойством Документация параметра Настройки
//    в методе ПанельПомощьПереопределяемый.ПриОпределенииНастроек.
//  ОтветыНаВопросы - Строка - ссылка на страницу с ответами на вопросы. Задается свойством
//    ОтветыНаВопросы параметра Настройки в методе ПанельПомощьПереопределяемый.ПриОпределенииНастроек.
// 
Процедура ВывестиТиповыеКарточки(Форма, ПараметрыВывода, Документация, ОтветыНаВопросы) Экспорт
	
	ПараметрыКарточки = ПанельПомощь.НовыйДанныеКарточек(
		"БИП_ОПрограмме",
		НСтр("ru = 'О программе'"),
		"",
		БиблиотекаКартинок.Информация,
		ЦветаПалитры.Оранжевый,
		НСтр("ru = 'Информация о программе'"));
	ВывестиКарточкуОбщий(
		Форма,
		ПараметрыКарточки,
		ПараметрыВывода);
	
	Если ЗначениеЗаполнено(Документация) Тогда
		ПараметрыКарточки = ПанельПомощь.НовыйДанныеКарточек(
			"БИП_Документация",
			НСтр("ru = 'Документация'"),
			Документация,
			БиблиотекаКартинок.ПанельПомощьДокументация,
			ЦветаПалитры.Голубой,
			НСтр("ru = 'Документация к программе'"));
		ВывестиКарточкуОбщий(
			Форма,
			ПараметрыКарточки,
			ПараметрыВывода);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтветыНаВопросы) Тогда
		ПараметрыКарточки = ПанельПомощь.НовыйДанныеКарточек(
			"БИП_ОтветыНаВопросы",
			НСтр("ru = 'Ответы на вопросы'"),
			ОтветыНаВопросы,
			БиблиотекаКартинок.ОтветыНаВопросы,
			ЦветаПалитры.Фиолетовый,
			НСтр("ru = 'Ответы на вопросы пользователей'"));
		ВывестиКарточкуОбщий(
			Форма,
			ПараметрыКарточки,
			ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

// Конструктор параметров, необходимых для вывода прикладных карточек/кнопок
//
//
// Параметры:
//   КоличествоКолонок - Число - количество колонок для размещения карточек.
//
// Возвращаемое значение:
//   Структура:
//     * ЭтоИнтерфейс85 - Булево - признак использования интерфейса 8.5.
//     * КоличествоКолонок - Число - количество колонок для размещения карточек.
//     * ТекущаяКолонка - Число - номер колонки в которую должна выводиться следующая карточка
//     * ШиринаКарточки - Число - ширина карточки. Используется при выводе в интерфейсе 8.5.
//     * ШиринаТекстаКарточки - Число - ширина текста карточки. Используется при выводе в интерфейсе 8.5.
//     * ШиринаКнопки - Число - ширина кнопки. Используется при выводе в интерфейсе Такси.
//     * РодительКарточки - ГруппаФормы, Неопределено - группа, в которую выводятся карточки.
//     * РодительТекущий - ГруппаФормы, Неопределено - группа, в которую нужно вывести текущую новую карточку/кнопку.
//     * ОписаниеКарточек - Соответствие Из КлючИЗначение - описание элементов выведенных элементов:
//       ** Ключ - Строка - имя созданной группы или кнопки.
//       ** Значение - Структура - описание параметров карточки:
//         *** Идентификатор - Строка - идентификатор карточки
//         *** Ссылка - Строка - ссылка для перехода, указанная в методе
//               ПанельПомощьПереопределяемый.ПриОпределенииНастроек
//     * УменьшитьТиповыеКарточки - Булево - Если Истина, то при выводе в нетиповую форму,
//       карточки будут иметь меньший размер. При выводе в типовую форму параметр игнорируется.
//     * ЭтоМобильныйКлиент - Булево - приложение работает в режиме мобильного клиента.
//
Функция НовыйПараметрыВыводаКарточек(КоличествоКолонок = 10) Экспорт
	
	РазмерыЭлементов = РазмерыЭлементов(КоличествоКолонок);
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("ЭтоИнтерфейс85", ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85());
	ПараметрыВывода.Вставить("КоличествоКолонок", КоличествоКолонок);
	ПараметрыВывода.Вставить("ТекущаяКолонка", 1);
	ПараметрыВывода.Вставить("ШиринаКарточки", РазмерыЭлементов.Карточка);
	ПараметрыВывода.Вставить("ШиринаТекстаКарточки", РазмерыЭлементов.ТекстКарточки);
	ПараметрыВывода.Вставить("ШиринаКнопки", РазмерыЭлементов.КнопкаКарточки);
	ПараметрыВывода.Вставить("РодительКарточки", Неопределено);
	ПараметрыВывода.Вставить("РодительТекущий", Неопределено);
	ПараметрыВывода.Вставить("ОписаниеКарточек", Новый Соответствие);
	ПараметрыВывода.Вставить("УменьшитьТиповыеКарточки", Ложь);
	ПараметрыВывода.Вставить("ЭтоМобильныйКлиент", ОбщегоНазначения.ЭтоМобильныйКлиент());

	Возврат ПараметрыВывода;
	
КонецФункции

// Выводит одну прикладную карточку/кнопку на форму
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  ПараметрыКарточки - см. ПанельПомощь.НовыйДанныеКарточек.
//  ПараметрыВывода - см. НовыйПараметрыВыводаКарточек.
// 
Процедура ВывестиКарточкуОбщий(Форма, ПараметрыКарточки, ПараметрыВывода) Экспорт
	
	РазмерыЭлементов = РазмерыЭлементов(ПараметрыВывода.КоличествоКолонок);
	
	Родитель = ПараметрыВывода.РодительТекущий;
	Если ПараметрыВывода.ТекущаяКолонка = 1 Или ПараметрыВывода.ЭтоМобильныйКлиент Тогда
		
		ИмяГруппы = "БИП_ГруппаКарточкиСтрока" + НовыйИдентификаторДляИмени();
		Родитель = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ПараметрыВывода.РодительКарточки);
		Родитель.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Родитель.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		Родитель.Отображение = ОтображениеОбычнойГруппы.Нет;
		Родитель.ОтображатьЗаголовок = Ложь;
		Родитель.РазрешитьИзменениеСостава = Ложь;
		Родитель.ГоризонтальныйИнтервал = РазмерыЭлементов.ИнтервалКарточек;
		Родитель.ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
		Родитель.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Лево;
		Родитель.РастягиватьПоГоризонтали = Истина;
		
		ПараметрыВывода.РодительТекущий = Родитель;
		
	КонецЕсли;
	
	Если ПараметрыВывода.ЭтоИнтерфейс85 Или ПараметрыВывода.ЭтоМобильныйКлиент Тогда
		ВывестиКарточку(Форма, ПараметрыКарточки, ПараметрыВывода)
	Иначе
		ВывестиКнопкуКарточки(Форма, ПараметрыКарточки, ПараметрыВывода);
	КонецЕсли;
	
	СледующаяКолонка = ПараметрыВывода.ТекущаяКолонка + 1;
	Если СледующаяКолонка > ПараметрыВывода.КоличествоКолонок Тогда
		ПараметрыВывода.ТекущаяКолонка = 1;
	Иначе
		ПараметрыВывода.ТекущаяКолонка = СледующаяКолонка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщиеМетоды

// Возвращает параметры раздела "Помощь".
//
// Возвращаемое значение:
//   Структура - набор параметров раздела "Помощь":
//    * Документация - Строка - URL ссылка на основную документацию по конфигурации.
//        Если не заполнено, то кнопка "Документация" не выводится.
//    * ИзвестныеОшибки - Строка - URL ссылка на страницу с описанием известных ошибок.
//        Значение по умолчанию https://bugboard.v8.1c.ru.
//        Если не заполнено, то кнопка "Известные ошибки" не выводится.
//    * ОтветыНаВопросы - Строка - URL ссылка на раздел конфигурации на странице https://its.1c.ru/db/answers1c.
//        Если не заполнено, то кнопка "Ответы на вопросы" не выводится.
//    * Пожелания - Структура - параметры для отправки пожеланий по улучшению программы:
//      ** ЛинияПоддержки - Строка - условное имя получателя сообщения, ссылка для перехода на страницу
//         отправки сообщения, ссылка для отправки почты, ссылка на объект конфигурации.
//         Если значение заполнено, то при нажатии на пункт меню "Техническая поддержка -> Предложить
//         идею по улучшению программы" оно передается в переопределямый метод
//         ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки, где может использоваться
//         собственный алгоритм отправки таких сообщений.
//         Если в переопределяемом методе не определен способ обработки данного значения, то оно используется
//         как имя получателя сообщения, отправляемого в тех. поддержку.
//       ** Тема - Строка - тема сообщения при стандартной отправке идеи в сервис.
//       ** Сообщение - Строка - текст сообщения при стандартной отправке идеи в сервис.
//    * Логотип - см. НовыйЛоготип.
//    * ПараметрыПоиска - см. НовыйПараметрыПоиска.
//    * ПрикладныеПараметры - Структура - информация, выводимая в карусель, область прикладных ссылок и ссылки
//        на соц. сети:
//      ** Карусель - Структура - настройки вывода карусели:
//         *** Сообщения - Массив Из см. ПанельПомощь.НовыйСообщениеКарусель.
//         *** ИнтервалАвтолистания - Число - периодичность автоматической смены информации в карусели в секундах.
//               Если не задано, то автолистания не происходит.
//               Если сообщение только одно, то параметр игнорируется.
//      ** ДанныеКарточек - Массив Из см. ПанельПомощь.НовыйДанныеКарточек.
//      ** ДанныеСоцСети - Массив Из см. ПанельПомощь.НоваяСсылкаСоцсети.
//    * СообщениеВТехПоддержку - Структура - параметры отправки сообщения в тех. поддержку.
//        Используются, если в конфигурацию внедрена подсистема
//        ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки.
//        Подробную информацию по заполнению полей смотрите в описании соответствующей подсистемы.
//        Параметры сообщения:
//      ** Отображать - Булево - признак отображения пункта меню. Если подсистема не внедрена, то установленное
//          здесь значение игнорируется и команда не выводится.
//          Значение по умолчанию - Истина.
//      ** ДанныеСообщения - см. СообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения.
//    * Используется1СКоннект - Булево - признак использования сервиса 1С:Коннект.
//    * ИдентификаторыДляЗапроса - Строка - служебный параметр. Содержит преобразованные в строку запроса
//        идентификаторы конфигурации.
// 
Функция ПараметрыРаздела()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Документация", "");
	Результат.Вставить("ИзвестныеОшибки", "");
	Результат.Вставить("ОтветыНаВопросы", "");
	
	Пожелания = Новый Структура;
	Пожелания.Вставить("ЛинияПоддержки", "");
	Пожелания.Вставить(
		"Тема",
		НСтр("ru = 'Хочу эти возможности в будущем'"));
	Пожелания.Вставить(
		"Сообщение",
		НСтр("ru = 'Опишите, каких возможностей не хватает в программе:
		|
		|
		|
		|
		|-------------------------------------------------------------------------------------
		|Спасибо, что помогаете развивать приложение.
		|Мы обязательно прочитаем письмо и рассмотрим ваше пожелание, но, вероятнее всего, на письмо не ответим.
		|Если есть вопрос по работе приложения, требующий ответа, то зарегистрируйте обращение на линию консультации.'"));
	
	Результат.Вставить("Пожелания", Пожелания);

	Результат.Вставить("Логотип", НовыйЛоготип());
	
	Результат.Вставить("ПараметрыПоиска", НовыйПараметрыПоиска());

	Карусель = Новый Структура(
		"Сообщения, ИнтервалАвтолистания",
		Новый Массив,
		0);
	ПрикладныеПараметры = Новый Структура(
		"Карусель, ДанныеКарточек, ДанныеСоцСети",
		Карусель,
		Новый Массив,
		Новый Массив);
	Результат.Вставить("ПрикладныеПараметры", ПрикладныеПараметры);

	ЕстьПодсистемаСообщенияВТехПоддержку = ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки");
	Если ЕстьПодсистемаСообщенияВТехПоддержку Тогда
		МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
		ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
	Иначе
		ДанныеСообщения = Неопределено;
	КонецЕсли;
	
	СообщениеВТехПоддержку = Новый Структура;
	СообщениеВТехПоддержку.Вставить("Отображать", ЕстьПодсистемаСообщенияВТехПоддержку);
	СообщениеВТехПоддержку.Вставить("ДанныеСообщения", ДанныеСообщения);
	Результат.Вставить("СообщениеВТехПоддержку", СообщениеВТехПоддержку);
	
	ИнтеграцияПодсистемБИП.ПриОпределенииНастроекПанельПомощь(Результат);
	ПанельПомощьПереопределяемый.ПриОпределенииНастроек(Результат);
	
	Если Не ЕстьПодсистемаСообщенияВТехПоддержку
		Или Не ЗначениеЗаполнено(Результат.СообщениеВТехПоддержку.ДанныеСообщения.Получатель) Тогда
		// Если подсистемы нет, или не указан получатель то не выводим даже если
		// в переопределяемом методе поставили Истина.
		Результат.СообщениеВТехПоддержку.Отображать = Ложь;
	КонецЕсли;
	
	Результат.Вставить("Используется1СКоннект", Ложь);
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтеграцияСКоннект")
		И Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда // 1С коннект работает только на win и linux
		МодульИнтеграцияСКоннект = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияСКоннект");
		Результат.Используется1СКоннект = МодульИнтеграцияСКоннект.НастройкиИнтеграции().ОтображатьКнопкуЗапуска;
	КонецЕсли;
	
	ОбработатьКартинки(Результат);
	
	Если ТипЗнч(Результат.ПараметрыПоиска.СтандартнаяОбработка) <> Тип("Булево") Тогда
		Если Результат.ПараметрыПоиска.СтандартнаяОбработка = "Истина"
			Или Результат.ПараметрыПоиска.СтандартнаяОбработка = "1"
			Или Результат.ПараметрыПоиска.СтандартнаяОбработка = 1 Тогда
			Результат.ПараметрыПоиска.СтандартнаяОбработка = Истина;
		Иначе
			Результат.ПараметрыПоиска.СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыСтрокиПоиска = Результат.ПараметрыПоиска.ПараметрыСтрокиПоиска;
	Если Результат.ПараметрыПоиска.СтандартнаяОбработка Тогда
		
		ПараметрыСтрокиПоиска.Представление = НСтр("ru = 'База знаний на 1С:ИТС'");
		ПараметрыСтрокиПоиска.Подсказка = НСтр("ru = 'Введите ключевые слова для поиска в базе знаний 1С:ИТС'");
		ПараметрыСтрокиПоиска.Картинка = БиблиотекаКартинок.ПанельПомощьЛоготипИТС;
	
	Иначе
		
		Если Не ЗначениеЗаполнено(ПараметрыСтрокиПоиска.Представление) Тогда
			ПараметрыСтрокиПоиска.Представление = НСтр("ru = 'База знаний'");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПараметрыСтрокиПоиска.Подсказка) Тогда
			ПараметрыСтрокиПоиска.Подсказка = НСтр("ru = 'Введите ключевые слова для поиска в базе знаний'");
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ОписаниеИсточника Из Результат.ПараметрыПоиска.ДополнительныеИсточники Цикл
		
		ОписаниеИсточника.Представление = 
			?(ЗначениеЗаполнено(ОписаниеИсточника.Представление),
				ОписаниеИсточника.Представление,
				ОписаниеИсточника.Идентификатор);
				
		ОписаниеИсточника.Подсказка = 
			?(ЗначениеЗаполнено(ОписаниеИсточника.Подсказка),
				ОписаниеИсточника.Подсказка,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Введите ключевые слова для поиска в %1'"),
					ОписаниеИсточника.Представление));
		
	КонецЦикла;
	
	ИдентификаторыДляЗапроса = Новый Массив;
	Для Каждого ИдентификаторКонфигурации Из Результат.ПараметрыПоиска.ИдентификаторыКонфигурации Цикл
		ИдентификаторыДляЗапроса.Добавить(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"attributes[conf][]=%1",
				КодироватьСтроку(
					ИдентификаторКонфигурации,
					СпособКодированияСтроки.КодировкаURL)));
	КонецЦикла;
	
	Результат.Вставить(
		"ИдентификаторыДляЗапроса",
		СтрСоединить(ИдентификаторыДляЗапроса, "&"));
	
	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 0);
	ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории = ТипЧисло.ПривестиЗначение(
		ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории);
	Если ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории < 0 Тогда
		ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет корректность заполнения значений картинок и их цвета
// 
// Параметры:
//  ПараметрыРаздела - см. ПараметрыРаздела.
// 
Процедура ОбработатьКартинки(ПараметрыРаздела)
	
	Ошибки = Новый Массив;
	
	ПараметрыРаздела.Логотип.Картинка = ЗначениеВКартинку(
		ПараметрыРаздела.Логотип.Картинка,
		"Логотип",
		Ошибки,
		Истина);
	
	ПараметрыРаздела.Логотип.Цвет = ЗначениеВЦвет(
		ПараметрыРаздела.Логотип.Цвет,
		"Логотип",
		Ошибки);
	
	ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.Картинка = ЗначениеВКартинку(
		ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.Картинка,
		"ПараметрыПоиска.ПараметрыСтрокиПоиска.Картинка",
		Ошибки);
	
	Для Каждого ОписаниеИсточника Из ПараметрыРаздела.ПараметрыПоиска.ДополнительныеИсточники Цикл
		ОписаниеИсточника.Картинка = ЗначениеВКартинку(
			ОписаниеИсточника.Картинка,
			"ПараметрыПоиска.ДополнительныеИсточники." + ОписаниеИсточника.Идентификатор,
			Ошибки);
	КонецЦикла;
	
	Для Каждого ДанныеСоцСети Из ПараметрыРаздела.ПрикладныеПараметры.ДанныеСоцСети Цикл
		ИдентификаторКартинки = "ПрикладныеПараметры.ДанныеСоцСети - " + ДанныеСоцСети.Ссылка;
		ДанныеСоцСети.Картинка = ЗначениеВКартинку(
			ДанныеСоцСети.Картинка,
			ИдентификаторКартинки,
			Ошибки,
			Истина);
		ДанныеСоцСети.ЦветКартинки = ЗначениеВЦвет(
			ДанныеСоцСети.ЦветКартинки,
			ИдентификаторКартинки,
			Ошибки);
	КонецЦикла;

	НомерПП = 0;
	ВариантыКартинок = СтрРазделить("ПоУмолчанию,Картинка2,Картинка4", ",");
	
	Для Каждого ДанныеКарусель Из ПараметрыРаздела.ПрикладныеПараметры.Карусель.Сообщения Цикл
		Если ДанныеКарусель.Картинки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ВариантКартинки Из ВариантыКартинок Цикл
			ДанныеКарусель.Картинки[ВариантКартинки] = ЗначениеВКартинку(
				ДанныеКарусель.Картинки[ВариантКартинки],
				XMLСтрока(НомерПП) + "_" + ВариантКартинки,
				Ошибки,
				Истина);
		КонецЦикла;
		НомерПП = НомерПП + 1;
	КонецЦикла;
	
	Для Каждого ДанныеКарточек Из ПараметрыРаздела.ПрикладныеПараметры.ДанныеКарточек Цикл
		ИдентификаторКартинки = "ПрикладныеПараметры.ДанныеКарточек." + ДанныеКарточек.Идентификатор;
		ДанныеКарточек.Картинка = ЗначениеВКартинку(
			ДанныеКарточек.Картинка,
			ИдентификаторКартинки,
			Ошибки);
		ДанныеКарточек.ЦветКартинки = ЗначениеВЦвет(
			ДанныеКарточек.ЦветКартинки,
			ИдентификаторКартинки,
			Ошибки);
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ЗаписатьИнформациюВЖурналРегистрации(
			СтрСоединить(Ошибки, Символы.ПС));
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команду на форму.
// Созданная команда привязывается к событию "Подключаемый_ПанельПомощьВыполнитьКоманду".
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма для добавления команды.
//  ИмяКоманды - Строка - имя команды.
//  Заголовок - Строка - заголовок команды.
//  Подсказка - Строка - всплывающая подсказка.
//  Картинка - Картинка, Строка, Неопределено - Картинка команды.
//  
// Возвращаемое значение:
//  КомандаФормы - созданная команда.
// 
Функция ДобавитьКоманду(
		Форма,
		ИмяКоманды,
		Заголовок,
		Подсказка = "",
		Картинка = Неопределено)
	
	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок = Заголовок;
	НоваяКоманда.Действие = "Подключаемый_ПанельПомощьВыполнитьКоманду";
	НоваяКоманда.Подсказка = Подсказка;
	Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
		НоваяКоманда.Картинка = Картинка;
	ИначеЕсли ТипЗнч(Картинка) = Тип("Строка") Тогда
		НоваяКоманда.Картинка = БиблиотекаКартинок[Картинка];
	КонецЕсли;
	
	Возврат НоваяКоманда;
	
КонецФункции

// Выполняет преобразование переданного значения в картинку:
//   # Если Значение имеет тип Картинка и это картинка из библиотеки, то оно возвращается без изменений.
//   # Если Значение имеет тип Картинка, это картинка НЕ из библиотеки и РасширенныеТипы = Ложь, то
//     значение очищается, добавляется ошибка.
//   # Если Значение имеет тип Картинка, это картинка НЕ из библиотеки и РасширенныеТипы = Истина, то
//     значение преобразуется к двоичным данным.
//   # Если Значение имеет тип Строка и РасширенныеТипы = Ложь, то выполняется поиск картинки в библиотеке картинок.
//   # Если Значение имеет тип Строка, РасширенныеТипы = Истина и в качестве значения задан адрес во временном
//     хранилище, то значение возвращается без изменений.
//   # Если Значение имеет тип Строка, РасширенныеТипы = Истина и в качестве значения задан НЕ адрес во временном
//     хранилище, то выполняется поиск картинки в библиотеке картинок.
//   # Если Значение имеет тип ДвоичныеДанные и РасширенныеТипы = Истина, то значение возвращается без
//     изменения.
//   # Если Значение имеет тип ДвоичныеДанные и РасширенныеТипы = Ложь, то возвращается пустая картинка;
//     в Ошибки заносится сообщение об ошибке.
// В случае ошибок, они заносятся в параметр Ошибки; в качестве результата возвращается пустая картинка.
// 
// Параметры:
//  Значение - Произвольный - значение, которое необходимо преобразовать.
//  Идентификатор - Строка - идентификатор картинки для ошибки.
//  Ошибки - Массив Из Строка - возникшие ошибки.
//  РасширенныеТипы - Булево - Если Истина, то картинка может задаваться через двоичные данные, адрес во временном
//    хранилище или произвольную картинку. Если Ложь, то картинка должна быть задана только из библиотеки картинок.
//  
// Возвращаемое значение:
//  Картинка, ДвоичныеДанные, Строка - результат преобразования.
// 
Функция ЗначениеВКартинку(
		Значение,
		Идентификатор,
		Ошибки,
		РасширенныеТипы = Ложь)
	
	ШаблонОшибки = НСтр("ru = 'Не удалось преобразовать переданное значение в картинку:
			|Идентификатор картинки: %1
			|Описание ошибки: %2'");
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Новый Картинка();
	ИначеЕсли ТипЗнч(Значение) = Тип("Картинка") Тогда
		Если Значение.Вид = ВидКартинки.Абсолютная Тогда
			Если РасширенныеТипы Тогда
				Попытка
					Возврат Значение.ПолучитьДвоичныеДанные(Истина);
				Исключение
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						ШаблонОшибки,
						Идентификатор,
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					Ошибки.Добавить(ТекстОшибки);
				КонецПопытки;
			Иначе
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибки,
					Идентификатор,
					НСтр("ru = 'Если значение имеет тип Картинка, то она должна быть получена из Библиотеки картинок'"));
				Ошибки.Добавить(ТекстОшибки);
			КонецЕсли;
		Иначе
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		ЭтоАдресВоВременномХранилище = ЭтоАдресВременногоХранилища(Значение);
		Если ЭтоАдресВоВременномХранилище Тогда
			Если РасширенныеТипы Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибки,
					Идентификатор,
					НСтр("ru = 'Для данного значения недопустимо использовать адрес во временном хранилище'"));
				Ошибки.Добавить(ТекстОшибки);
			Иначе
				Возврат Значение;
			КонецЕсли;
		Иначе
			Попытка
				Результат = БиблиотекаКартинок[Значение];
				Возврат Результат;
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					ШаблонОшибки,
					Идентификатор,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Ошибки.Добавить(ТекстОшибки);
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		Если РасширенныеТипы Тогда
			Возврат Значение;
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки,
				Идентификатор,
				НСтр("ru = 'Для данного значения не допустимо использовать картинку с типом ДвоичныеДанные'"));
			Ошибки.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Картинка();
	
КонецФункции

// Проверяет, что передано значение типа Цвет.
// Если передано значение любого другого типа, то возвращается Неопределено, а в параметр Ошибки добавляется
// информация об ошибке.
// 
// Параметры:
//  Значение - Произвольный - значение, которое необходимо преобразовать.
//  Идентификатор - Строка - идентификатор картинки для ошибки.
//  Ошибки - Массив Из Строка - возникшие ошибки.
//  
// Возвращаемое значение:
//  Неопределено, Цвет - результат преобразования.
// 
Функция ЗначениеВЦвет(
		Значение,
		Идентификатор,
		Ошибки)
	
	ШаблонОшибки = НСтр("ru = 'В качестве цвета картинки указано недопустимое значение:
			|Идентификатор картинки: %1
			|Переданное значение: %2'");
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	ИначеЕсли ТипЗнч(Значение) = Тип("Цвет") Тогда
		Возврат Значение;
	Иначе
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонОшибки,
			Идентификатор,
			Строка(Значение));
		Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПодменюТехПоддержка

// Создает команды для подменю технической поддержки.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//   ПараметрыРаздела - см. ПараметрыРаздела.
//   Команды - Соответствие Из КлючИЗначение - Коллекция команд для использования в алгоритмах:
//     * Ключ - Строка - имя созданной команды.
//     * Значение - Строка - тип команды.
//   УИД - Строка - Уникальный идентификатор для формирования имен команд.
//
// Возвращаемое значение:
//  Структура - параметры для создания элементов формы:
//    * ЕстьОсновные - Булево - есть команда для вывода в основную часть подменю.
//    * ЕстьДополнительные - Булево - есть команда для вывода в дополнительную часть подменю.
//    * Команды - Массив Из Структура - команды для вывода:
//      ** ИмяКоманды - Строка - имя команды.
//      ** ИмяГруппы - Строка - группа, в которую необходимо выводить команду.
//    * ИмяКомандыСправка - Строка - имя команды, открывающей содержание справки.
//
Функция СоздатьКомандыПодменюТехПоддержка(
		Форма,
		ПараметрыРаздела,
		Команды)
	
	УИД = НовыйИдентификаторДляИмени();
	
	Результат = Новый Структура();
	Результат.Вставить("ЕстьОсновные", Ложь);
	Результат.Вставить("ЕстьДополнительные", Ложь);
	Результат.Вставить("Команды", Новый Массив);
	Результат.Вставить("ИмяКомандыСправка", "");
	
	ИмяКоманды = "Справка_" + УИД;
	КомандаСправка = ДобавитьКоманду(
		Форма,
		"Справка_" + УИД,
		НСтр("ru = 'Справка'"),
		НСтр("ru = 'Оглавление справки'"),
		БиблиотекаКартинок.Справка);
	КомандаСправка.Отображение = ОтображениеКнопки.Текст;
	Результат.Вставить("ИмяКомандыСправка", ИмяКоманды);
	Команды.Вставить(
		ИмяКоманды,
		"Справка");
	
	Если ПараметрыРаздела.СообщениеВТехПоддержку.Отображать Тогда
		ИмяКоманды = "СообщениеВТехПоддержку_" + УИД;
		Команды.Вставить(
			ИмяКоманды,
			"СообщениеВТехПоддержку");
		ДобавитьКоманду(
			Форма,
			ИмяКоманды,
			НСтр("ru = 'Сообщение в службу поддержки'"),
			НСтр("ru = 'Отправка сообщения в службу технической поддержки'"),
			БиблиотекаКартинок.Конверт);
		
		Результат.ЕстьОсновные = Истина;
		Результат.Команды.Добавить(
			Новый Структура(
				"ИмяКоманды, ИмяГруппы",
				ИмяКоманды,
				"Основная"));
	КонецЕсли;
	
	Если ПараметрыРаздела.Используется1СКоннект Тогда
		ИмяКоманды = "Коннект_" + УИД;
		Команды.Вставить(
			ИмяКоманды,
			"Коннект");
		ДобавитьКоманду(
			Форма,
			ИмяКоманды,
			НСтр("ru = 'Связаться со специалистом (1С-Коннект)'"),
			НСтр("ru = 'Связаться со специалистом через приложение 1С-Коннект'"),
			БиблиотекаКартинок.СпециалистТехПоддержки);
		
		Результат.ЕстьОсновные = Истина;
		Результат.Команды.Добавить(
			Новый Структура(
				"ИмяКоманды, ИмяГруппы",
				ИмяКоманды,
				"Основная"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРаздела.Пожелания.ЛинияПоддержки) Тогда
		ИмяКоманды = "Пожелания_" + УИД;
		Команды.Вставить(
			ИмяКоманды,
			"Пожелания");
		ДобавитьКоманду(
			Форма,
			ИмяКоманды,
			НСтр("ru = 'Предложить идею'"),
			"",
			БиблиотекаКартинок.Лампочка);
			
		Результат.ЕстьОсновные = Истина;
		Результат.Команды.Добавить(
			Новый Структура(
				"ИмяКоманды, ИмяГруппы",
				ИмяКоманды,
				"Основная"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРаздела.ИзвестныеОшибки) Тогда
		ИмяКоманды = "ИзвестныеОшибки_" + УИД;
		Команды.Вставить(
			ИмяКоманды,
			"ИзвестныеОшибки");
		ДобавитьКоманду(
			Форма,
			ИмяКоманды,
			НСтр("ru = 'Известные проблемы'"),
			НСтр("ru = 'Перейти к списку известных проблем'"),
			БиблиотекаКартинок.ИзвестныеПроблемы);
			
		Результат.ЕстьДополнительные = Истина;
		Результат.Команды.Добавить(
			Новый Структура(
				"ИмяКоманды, ИмяГруппы",
				ИмяКоманды,
				"Дополнительная"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
	
// Создает подменю "Техническая поддержка" на командной панели формы при наличии доступных команд.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  КоманднаяПанельТехПоддержка - КоманднаяПанель - командная панель формы, в которую необходимо вывести
//    подменю с кнопками обращения в тех поддержку. Если не задано, то подменю выводится в
//    основную командную панель формы Форма.КоманднаяПанель.
//  ПараметрыТехПоддержка - см. СоздатьКомандыПодменюТехПоддержка.
// 
// Возвращаемое значение:
//  Неопределено, ГруппаФормы - командная панель формы, в которой создано подменю.
//                              Неопределено, если подменю не выводится.
//
Функция ВывестиПодменюТехПоддержка(
		Форма,
		КоманднаяПанельТехПоддержка,
		ПараметрыТехПоддержка)
	
	КоманднаяПанельРодитель = Неопределено;
	Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
		КоманднаяПанельРодитель = Форма.КоманднаяПанель;
	Иначе
		КоманднаяПанельРодитель = ?(
			КоманднаяПанельТехПоддержка = Неопределено,
			Форма.КоманднаяПанель,
			КоманднаяПанельТехПоддержка);
	КонецЕсли;
	
	Если ПараметрыТехПоддержка.ЕстьОсновные Или ПараметрыТехПоддержка.ЕстьДополнительные Тогда
		
		// Выводим подменю тех. поддержка, если есть хотя бы одна подчиненная команда.
		ПодменюТехПоддержка = Форма.Элементы.Добавить(
			"БИП_ПанельПомощьПодменюТехПоддержка",
			Тип("ГруппаФормы"),
			КоманднаяПанельРодитель);
		ПодменюТехПоддержка.Вид = ВидГруппыФормы.Подменю;
		ПодменюТехПоддержка.Заголовок = НСтр("ru = 'Техническая поддержка'");
		ПодменюТехПоддержка.РазрешитьИзменениеСостава = Ложь;
		ПодменюТехПоддержка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
		
		Если ПараметрыТехПоддержка.ЕстьОсновные Тогда
			ПодменюТехПоддержкаОсновные = Форма.Элементы.Добавить(
				"БИП_ПанельПомощьПодменюТехПоддержкаОсновные",
				Тип("ГруппаФормы"),
				ПодменюТехПоддержка);
			ПодменюТехПоддержкаОсновные.Вид = ВидГруппыФормы.ГруппаКнопок;
			ПодменюТехПоддержкаОсновные.РазрешитьИзменениеСостава = Ложь;
		КонецЕсли;
		
		Если ПараметрыТехПоддержка.ЕстьДополнительные Тогда
			ПодменюТехПоддержкаДополнительные = Форма.Элементы.Добавить(
				"БИП_ПанельПомощьПодменюТехПоддержкаДополнительные",
				Тип("ГруппаФормы"),
				ПодменюТехПоддержка);
			ПодменюТехПоддержкаДополнительные.Вид = ВидГруппыФормы.ГруппаКнопок;
			ПодменюТехПоддержкаДополнительные.РазрешитьИзменениеСостава = Ложь;
		КонецЕсли;
		
		Для Каждого ОписаниеКоманды Из ПараметрыТехПоддержка.Команды Цикл
			
			Родитель = ?(
				ОписаниеКоманды.ИмяГруппы = "Основная",
				ПодменюТехПоддержкаОсновные,
				ПодменюТехПоддержкаДополнительные);
			
			Кнопка = Форма.Элементы.Добавить(
				ОписаниеКоманды.ИмяКоманды,
				Тип("КнопкаФормы"),
				Родитель);
			Кнопка.ИмяКоманды = ОписаниеКоманды.ИмяКоманды;
			Кнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Кнопка = Форма.Элементы.Добавить(
		ПараметрыТехПоддержка.ИмяКомандыСправка,
		Тип("КнопкаФормы"),
		КоманднаяПанельРодитель);
	Кнопка.ИмяКоманды = ПараметрыТехПоддержка.ИмяКомандыСправка;
	Кнопка.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
	
	Возврат КоманднаяПанельРодитель;

КонецФункции

#КонецОбласти

#Область СтрокаПоиска

// Выводит на форму поле ввода строки поиска, кнопку запуска поиска и подменю выбора источника поиска.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  ПараметрыПанели - см. НовыйПараметрыПодсистемы.
//  ГруппаПоиск - ГруппаФормы, Неопределено - группа, в которую необходимо вывести поле для поиска информации.
//    Если не задано, то выводится в начало формы.
//  ТиповаяФорма - Булево - Истина, если происходит работа через типовую форму БИП.
//  ПодменюТехПоддержка - см. ВывестиПодменюТехПоддержка
// 
Процедура ВывестиСтрокуПоиска(
		Форма,
		ПараметрыПанели,
		ГруппаПоиск,
		ТиповаяФорма,
		ПодменюТехПоддержка)
	
	РазмерыЭлементов = РазмерыЭлементов();
	ПараметрыСтрокиПоиска = ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска;
	
	ОбщаяШирина = ПараметрыСтрокиПоиска.ШиринаПанели;
	РазмерПанелиПоиск = ОбщаяШирина - РазмерыЭлементов.КнопкаПоиска;
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	
	ПервыйЭлемент = Неопределено;
	Если ГруппаПоиск = Неопределено Тогда
		Родитель = Форма;
		ПодчиненныеЭлементы = Форма.ПодчиненныеЭлементы;
		Если ПодчиненныеЭлементы.Количество() > 0 Тогда
			ПервыйЭлемент = ПодчиненныеЭлементы[0];
			Если ПервыйЭлемент = ПодменюТехПоддержка Тогда
				// Если первым элементом выводится командная панель, в которую выведено подменю
				// тех. поддержка, то панель поиска располагается после нее.
				// Иначе - первым элементом на форме.
				Если ПодчиненныеЭлементы.Количество() > 1 Тогда
					ПервыйЭлемент = ПодчиненныеЭлементы[1];
				Иначе
					ПервыйЭлемент = Форма;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Родитель = ГруппаПоиск;
	КонецЕсли;
	
	ГруппаСтрокаПоискаИТиповыеКарточки = Форма.Элементы.Вставить(
		"БИП_ПанельПомощьГруппаСтрокаПоискаИТиповыеКнопки",
		Тип("ГруппаФормы"),
		Родитель,
		ПервыйЭлемент);
	ГруппаСтрокаПоискаИТиповыеКарточки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаПоискаИТиповыеКарточки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаСтрокаПоискаИТиповыеКарточки.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтрокаПоискаИТиповыеКарточки.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаПоискаИТиповыеКарточки.РазрешитьИзменениеСостава = Ложь;
	
	ГруппаСтрокаПоиска = Форма.Элементы.Добавить(
		"БИП_ПанельПомощьГруппаСтрокаПоиска",
		Тип("ГруппаФормы"),
		ГруппаСтрокаПоискаИТиповыеКарточки);
	ГруппаСтрокаПоиска.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСтрокаПоиска.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСтрокаПоиска.Заголовок = НСтр("ru = 'Строка поиска'");
	ГруппаСтрокаПоиска.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСтрокаПоиска.ОтображатьЗаголовок = Ложь;
	ГруппаСтрокаПоиска.РазрешитьИзменениеСостава = Ложь;
	
	Если ЭтоМобильныйКлиент Тогда
		ГруппаСтрокаПоиска.РастягиватьПоГоризонтали = Истина;
		ГруппаСтрокаПоиска.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	Иначе
		ГруппаСтрокаПоиска.Ширина = ОбщаяШирина;
	КонецЕсли;
	
	// Кнопка выбора источника поиска
	Если ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.ДополнительныеИсточники.Количество() > 0 Тогда
		
		ИмяКоманды = "БИП_ПанельПомощьВыборИсточникиПоиска";
		
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Заголовок = НСтр("ru = 'Источник поиска'");
		НоваяКоманда.Действие = "Подключаемый_ПанельПомощьВыполнитьКоманду";
		НоваяКоманда.Картинка = БиблиотекаКартинок.НайтиСтрелкаВниз;
		НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
		
		ПараметрыПанели.Команды.Вставить(ИмяКоманды, "ВыборИсточникаПоиска");
		
		НоваяКнопка = Форма.Элементы.Добавить(
			ИмяКоманды,
			Тип("КнопкаФормы"),
			ГруппаСтрокаПоиска);
		НоваяКнопка.ИмяКоманды = ИмяКоманды;
		
		НоваяКнопка.Ширина = РазмерыЭлементов.КнопкаИсточникиПоиска;
		
		РазмерПанелиПоиск = РазмерПанелиПоиск - РазмерыЭлементов.КнопкаИсточникиПоиска - 1;
		
	КонецЕсли;
	
	// Поле ввода строки поиска
	ДобавляемыеРеквизиты = Новый Массив;
	РеквизитСтрокаПоиска = Новый РеквизитФормы(
		"БИП_ПанельПомощьСтрокаПоиска",
		Новый ОписаниеТипов("Строка"));
	ДобавляемыеРеквизиты.Добавить(РеквизитСтрокаПоиска);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

	НовоеПоле = Форма.Элементы.Добавить(
		"БИП_ПанельПомощьСтрокаПоиска",
		Тип("ПолеФормы"),
		ГруппаСтрокаПоиска);
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "БИП_ПанельПомощьСтрокаПоиска";
	НовоеПоле.Заголовок = НСтр("ru = 'Строка поиска'");
	НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовоеПоле.КнопкаОчистки = Истина;
	
	Если ЭтоМобильныйКлиент Тогда
		НовоеПоле.РастягиватьПоГоризонтали = Истина;
	Иначе
		НовоеПоле.АвтоМаксимальнаяШирина = Ложь;
		НовоеПоле.МаксимальнаяШирина = РазмерПанелиПоиск;
	КонецЕсли;
	
	НовоеПоле.ПодсказкаВвода = ПараметрыСтрокиПоиска.Подсказка;
	НовоеПоле.Подсказка = ПараметрыСтрокиПоиска.Подсказка;
	НовоеПоле.Картинка = ПараметрыСтрокиПоиска.Картинка;
	
	Если ПараметрыПанели.ТекущийИсточник <> ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию() Тогда
		Для Каждого ОписаниеИсточника Из ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.ДополнительныеИсточники Цикл
			Если ОписаниеИсточника.Идентификатор = ПараметрыПанели.ТекущийИсточник Тогда
				НовоеПоле.ПодсказкаВвода = ОписаниеИсточника.Подсказка;
				НовоеПоле.Подсказка = ОписаниеИсточника.Подсказка;
				НовоеПоле.Картинка = ОписаниеИсточника.Картинка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ПараметрыПанели.ИсторияПоиска.Количество() Тогда
		НовоеПоле.КнопкаВыпадающегоСписка = Истина;
		НовоеПоле.СписокВыбора.ЗагрузитьЗначения(ПараметрыПанели.ИсторияПоиска);
	КонецЕсли;
	
	ПараметрыПанели.ТекущаяКартинка = НовоеПоле.Картинка;
	
	// Кнопка поиска
	ИмяКоманды = "БИП_ПанельПомощьПоиск";
		
	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок =  НСтр("ru = 'Найти'");
	НоваяКоманда.Действие = "Подключаемый_ПанельПомощьВыполнитьКоманду";
	НоваяКоманда.Отображение = ОтображениеКнопки.Текст;
	
	ПараметрыПанели.Команды.Вставить(ИмяКоманды, "Поиск");
	
	НоваяКнопка = Форма.Элементы.Добавить(
		ИмяКоманды,
		Тип("КнопкаФормы"),
		ГруппаСтрокаПоиска);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
	Если Не ТиповаяФорма Тогда
		
		ПараметрыТиповыхКарточек = ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.ПараметрыТиповыхКарточек;
		
		КоличествоКолонокПараметры = ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек;
		Если КоличествоКолонокПараметры > 0 Тогда
			ПараметрыВывода = НовыйПараметрыВыводаКарточек(КоличествоКолонокПараметры);
		Иначе
			ПараметрыВывода = НовыйПараметрыВыводаКарточек();
		КонецЕсли;
		ПараметрыВывода.УменьшитьТиповыеКарточки = ПараметрыТиповыхКарточек.УменьшитьТиповыеКарточки;
		ПараметрыВывода.РодительКарточки = ГруппаСтрокаПоискаИТиповыеКарточки;
		
		ВывестиТиповыеКарточки(
			Форма,
			ПараметрыВывода,
			ПараметрыПанели.ПараметрыРаздела.Документация,
			ПараметрыПанели.ПараметрыРаздела.ОтветыНаВопросы);
		
		Для Каждого КлючЗначение Из ПараметрыВывода.ОписаниеКарточек Цикл
			
			ПараметрыПанели.ТиповыеКарточки.Вставить(
				КлючЗначение.Ключ,
				КлючЗначение.Значение);
			
			ПараметрыПанели.Команды.Вставить(КлючЗначение.Ключ, "Карточка");
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Проверяет корректность указания некоторых параметров вывода строки поиска.
// 
// Параметры:
//  ПараметрыПоиска - см. НовыйПараметрыПоиска.
//  ТиповаяФорма - Булево - Истина, если происходит работа через типовую форму БИП.
// 
Процедура ПроверитьПараметрыСтрокиПоиска(ПараметрыПоиска, ТиповаяФорма)
	
	ПараметрыСтрокиПоиска = ПараметрыПоиска.ПараметрыСтрокиПоиска;
	ПараметрыТиповыхКарточек = ПараметрыПоиска.ПараметрыТиповыхКарточек;
	
	Если ТиповаяФорма Тогда
		ПараметрыСтрокиПоиска.ШиринаПанели = 0;
		ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек = 100;
	Иначе
		Если ТипЗнч(ПараметрыСтрокиПоиска.ШиринаПанели) <> Тип("Число") Тогда
			ПараметрыСтрокиПоиска.ШиринаПанели = 0;
		КонецЕсли;
		Если ТипЗнч(ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек) <> Тип("Число") Тогда
			ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек = 100;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек = 0 Тогда
		// вывод всех кнопок в одну строку
		ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек = 100;
	КонецЕсли;
	
	Если ПараметрыСтрокиПоиска.ШиринаПанели <= 0
		Или ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек < 0 Тогда
		
		КоличествоКолонок = КоличествоКолонокПоРазрешению();
		
		Если ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек < 0 Тогда
			ПараметрыТиповыхКарточек.КоличествоКолонокТиповыхКарточек = КоличествоКолонок;
		КонецЕсли;
		
		РазмерыЭлементов = РазмерыЭлементов(КоличествоКолонок);
		Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоИнтерфейс85() Тогда
			ПараметрыСтрокиПоиска.ШиринаПанели = РазмерыЭлементов.ОбщаяШирина;
		Иначе
			ПараметрыСтрокиПоиска.ШиринаПанели = РазмерыЭлементов.ОбщаяШиринаТакси;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Карточки

// Выводит одну прикладную карточку/кнопку на форму
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  ПараметрыКарточки - см. ПанельПомощь.НовыйДанныеКарточек.
//  ПараметрыВывода - см. НовыйПараметрыВыводаКарточек.
// 
Процедура ВывестиКарточку(Форма, ПараметрыКарточки, ПараметрыВывода)
	
	ШиринаКарточки = ПараметрыВывода.ШиринаКарточки;
	Если ПараметрыВывода.УменьшитьТиповыеКарточки Тогда
		ВысотаКарточки = 1;
		ШрифтКартинки = ШрифтыСтиля.ЗаголовокТретьегоУровня;
		ШиринаКарточки = ШиринаКарточки - 2;
	Иначе
		ВысотаКарточки = 2;
		Если ПараметрыВывода.ЭтоМобильныйКлиент Тогда
			ШрифтКартинки = ШрифтыСтиля.ЗаголовокВторогоУровня;
		Иначе
			ШрифтКартинки = ШрифтыСтиля.ЗаголовокПервогоУровня;
		КонецЕсли;
	КонецЕсли;
	
	ИмяГруппы = "БИП_ГруппаКарточка_" + НовыйИдентификаторДляИмени();
	НоваяКарточка = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ПараметрыВывода.РодительТекущий);
	НоваяКарточка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяКарточка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НоваяКарточка.Отображение = ОтображениеОбычнойГруппы.Нет;
	НоваяКарточка.ОтображатьЗаголовок = Ложь;
	НоваяКарточка.РазрешитьИзменениеСостава = Ложь;
	НоваяКарточка.ГоризонтальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Одинарный;
	НоваяКарточка.ОтображатьКакКарточку = Истина;
	НоваяКарточка.Гиперссылка = Истина;
	НоваяКарточка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	НоваяКарточка.УстановитьДействие("Нажатие", "Подключаемый_ПанельПомощьНажатиеЭлемента");
	
	Если ПараметрыВывода.ЭтоМобильныйКлиент Тогда
		НоваяКарточка.РастягиватьПоГоризонтали = Истина;
	Иначе
		НоваяКарточка.Высота = ВысотаКарточки;
		НоваяКарточка.Ширина = ШиринаКарточки;
		НоваяКарточка.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	Если ПараметрыКарточки.Картинка.Вид <> ВидКартинки.Пустая Тогда
		
		ИмяДекорации = "БИП_КартинкаКарточки_" + НовыйИдентификаторДляИмени();
		НоваяКартинка = Форма.Элементы.Добавить(
			ИмяДекорации,
			Тип("ДекорацияФормы"),
			НоваяКарточка);
		НоваяКартинка.Вид = ВидДекорацииФормы.Картинка;
		НоваяКартинка.Картинка = ПараметрыКарточки.Картинка;
		Если ПараметрыКарточки.ЦветКартинки <> Неопределено Тогда
			НоваяКартинка.ЦветКартинки = ПараметрыКарточки.ЦветКартинки;
		КонецЕсли;
		НоваяКартинка.Подсказка = ПараметрыКарточки.Подсказка;
		
		Если ПараметрыВывода.ЭтоМобильныйКлиент И Не ПараметрыВывода.ЭтоИнтерфейс85 Тогда
			НоваяКартинка.Высота = 2;
			НоваяКартинка.Ширина = 3;
			НоваяКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
		Иначе
			НоваяКартинка.Шрифт = ШрифтКартинки;
			НоваяКартинка.РазмерКартинки = РазмерКартинки.ПоРазмеруШрифта;
		КонецЕсли;
		НоваяКартинка.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
		
	КонецЕсли;
	
	ИмяДекорации = "БИП_ТекстКарточки_" + НовыйИдентификаторДляИмени();
	НоваяДекорация = Форма.Элементы.Добавить(
		ИмяДекорации,
		Тип("ДекорацияФормы"),
		НоваяКарточка);
	НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
	НоваяДекорация.Заголовок = ПараметрыКарточки.Заголовок;
	НоваяДекорация.Подсказка = ПараметрыКарточки.Подсказка;
	НоваяДекорация.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Центр;
	НоваяДекорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	НоваяДекорация.ВертикальноеПоложение = ВертикальноеПоложениеЭлемента.Центр;
	НоваяДекорация.РастягиватьПоГоризонтали = Истина;
	НоваяДекорация.АвтоМаксимальнаяШирина = Ложь;
	Если ПараметрыВывода.ЭтоМобильныйКлиент Тогда
		НоваяДекорация.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	КонецЕсли;
	
	ОписаниеКарточки = Новый Структура(
		"Идентификатор, Ссылка",
		ПараметрыКарточки.Идентификатор,
		ПараметрыКарточки.Ссылка);

	Если ПараметрыВывода.ЭтоМобильныйКлиент И Не ПараметрыВывода.ЭтоИнтерфейс85 Тогда
		НоваяДекорация.Гиперссылка = Истина;
		НоваяДекорация.УстановитьДействие("Нажатие", "Подключаемый_ПанельПомощьНажатиеЭлемента");
		ПараметрыВывода.ОписаниеКарточек.Вставить(ИмяДекорации, ОписаниеКарточки);
	Иначе
		НоваяДекорация.Высота = ВысотаКарточки;
		НоваяДекорация.МаксимальнаяШирина = ПараметрыВывода.ШиринаТекстаКарточки;
		НоваяДекорация.РастягиватьПоВертикали = Ложь;
		ПараметрыВывода.ОписаниеКарточек.Вставить(ИмяГруппы, ОписаниеКарточки);
	КонецЕсли;
	
КонецПроцедуры

// Выводит одну прикладную карточку/кнопку на форму
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  ПараметрыКарточки - см. ПанельПомощь.НовыйДанныеКарточек.
//  ПараметрыВывода - см. НовыйПараметрыВыводаКарточек.
// 
Процедура ВывестиКнопкуКарточки(Форма, ПараметрыКарточки, ПараметрыВывода)
	
	ИмяКоманды = "БИП_КнопкаКарточка_" + НовыйИдентификаторДляИмени();
	
	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Заголовок = ПараметрыКарточки.Заголовок;
	НоваяКоманда.Действие = "Подключаемый_ПанельПомощьВыполнитьКоманду";
	
	Кнопка = Форма.Элементы.Добавить(
		ИмяКоманды,
		Тип("КнопкаФормы"),
		ПараметрыВывода.РодительТекущий);
	Кнопка.ИмяКоманды = ИмяКоманды;
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
	Кнопка.Картинка = ПараметрыКарточки.Картинка;
	Кнопка.Ширина = ПараметрыВывода.ШиринаКнопки;
	
	Если ПараметрыВывода.УменьшитьТиповыеКарточки Тогда
		Кнопка.Высота = 1;
		Кнопка.Ширина = ПараметрыВывода.ШиринаКнопки - 5;
	Иначе
		Кнопка.Высота = 2;
		Кнопка.Ширина = ПараметрыВывода.ШиринаКнопки;
	КонецЕсли;
	
	ОписаниеКарточки = Новый Структура(
		"Идентификатор, Ссылка",
		ПараметрыКарточки.Идентификатор,
		ПараметрыКарточки.Ссылка);
	
	ПараметрыВывода.ОписаниеКарточек.Вставить(ИмяКоманды, ОписаниеКарточки);
	
КонецПроцедуры

#КонецОбласти

#Область ПоискВСервисе

// Выполняет поиск информации в сервисе.
// 
// Параметры:
//  КлючАПИ - Строка - идентификатор конфигурации в сервисе.
//  СтрокаПоиска - Строка - строка, которую необходимо найти.
//  НомерСтраницы - Число - номер страницы из результата поиска, которую необходимо вернуть.
//  
// Возвращаемое значение:
//  Структура - результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * РезультатПоиска - Неопределено, Соответствие Из КлючИЗначение - ответ от сервиса.
//        Неопределено, в случае ошибки.
//  
Функция ПоискВСервисе(КлючАПИ, СтрокаПоиска, НомерСтраницы) Экспорт
	
	Результат = НовыйРезультатОперации();
	Результат.Вставить("РезультатПоиска", Неопределено);
	
	АдресAPI = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"https://%1/db/search/api",
		ИнтернетПоддержкаПользователейКлиентСервер.ХостСервисовИнтернетПоддержки());
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("query", СтрокаПоиска);
	Если НомерСтраницы > 1 Тогда
		СтруктураЗапроса.Вставить("pageNum", НомерСтраницы);
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура();
	ПараметрыЗапроса.Вставить("id", Строка(Новый УникальныйИдентификатор()));
	ПараметрыЗапроса.Вставить("apiKey", КлючАПИ);
	ПараметрыЗапроса.Вставить("method", "search");
	ПараметрыЗапроса.Вставить("params", СтруктураЗапроса);
	
	ДанныеДляОбработки = ОбщегоНазначения.ЗначениеВJSON(ПараметрыЗапроса);
	
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		ДанныеДляОбработки,
		ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации());
	
	РезультатОперации = HTTP.POST(
		АдресAPI,
		ПараметрыЗапроса);
	
	Если Не ПустаяСтрока(РезультатОперации.КодОшибки) Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(РезультатОперации.КодСостояния);
		Если РезультатОперации.КодСостояния < 0 Тогда
			Результат.СообщениеОбОшибке = РезультатОперации.СообщениеОбОшибке;
		Иначе
			Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
				РезультатОперации.КодОшибки);
		КонецЕсли;
		
		Результат.ИнформацияОбОшибке = Новый ФорматированнаяСтрока(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось выполнить поиск в сервисе.
					|
					|%1
					|
					|Техническая информация об ошибке:
					|При получении информации сервис вернул ошибку.
					|URL: %2
					|Код ошибки: %3
					|Подробная информация:
					|%4'"),
				Строка(Результат.СообщениеОбОшибке),
				АдресAPI,
				Результат.КодОшибки,
				РезультатОперации.ИнформацияОбОшибке));
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(РезультатОперации.ИнформацияОбОшибке));
		
		Возврат Результат;
		
	КонецЕсли;
	
	ОбработатьОтветСервиса(РезультатОперации.Содержимое, Результат, АдресAPI);
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает ответ сервиса с результатом поиска информации
// 
// Параметры:
//  Содержимое - Строка - ответ сервиса.
//  Результат - см. ПоискВСервисе
//  АдресAPI - Строка - URL адрес запроса для вывода в журнал регистрации
// 
Процедура ОбработатьОтветСервиса(Содержимое, Результат, АдресAPI)
	
	Попытка
		
		ДанныеСервиса = ОбщегоНазначения.JSONВЗначение(Содержимое,, Истина);
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Результат.КодОшибки = "НеизвестнаяОшибка";
		Результат.СообщениеОбОшибке = НСтр("ru = 'Не удалось обработать ответ сервиса.'");
		
		Результат.ИнформацияОбОшибке = Новый ФорматированнаяСтрока(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось выполнить поиск в сервисе.
					|
					|%1.
					|
					|Техническая информация об ошибке:
					|URL: %2
					|Код ошибки: НеизвестнаяОшибка
					|Подробная информация:
					|%3'"),
				Результат.СообщениеОбОшибке,
				АдресAPI,
				ТекстОшибки));
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(Результат.ИнформацияОбОшибке));
		
		Возврат;
		
	КонецПопытки;
	
	Результат.РезультатПоиска = ДанныеСервиса.Получить("result");
	
	Ошибка = ДанныеСервиса.Получить("error");
	Если Ошибка <> Неопределено Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(Ошибка.Получить("code"));
		Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
				Результат.КодОшибки);
		
		Результат.ИнформацияОбОшибке = Новый ФорматированнаяСтрока(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось выполнить поиск в сервисе.
					|
					|%1
					|
					|Техническая информация об ошибке:
					|При получении информации сервис вернул ошибку.
					|URL: %2
					|Код ошибки: %3
					|Идентификатор ошибки: %4
					|Подробная информация:
					|%5'"),
				Строка(Результат.СообщениеОбОшибке),
				АдресAPI,
				Результат.КодОшибки,
				Ошибка.Получить("id"),
				Ошибка.Получить("message")));
		
		ЗаписатьИнформациюВЖурналРегистрации(
			Строка(Результат.ИнформацияОбОшибке));
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет по коду состояния тип ошибку сервиса.
//
// Параметры:
//  КодСостояния - Число - код состояния ответа сервиса.
//
// Возвращаемое значение:
//  Строка - код ошибки сервиса.
//
Функция ПереопределитьКодОшибкиСервиса(КодСостояния)
	
	Если КодСостояния = 200 Тогда
		Возврат "";
	ИначеЕсли КодСостояния = 400 Тогда
		Возврат КодОшибкиНеверныйФорматЗапроса();
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат КодОшибкиНеверныйЛогинИлиПароль();
	ИначеЕсли КодСостояния = 413 Тогда
		Возврат КодОшибкиПревышенМаксимальныйРазмерВложения();
	ИначеЕсли КодСостояния = 429 Тогда
		Возврат КодОшибкиПовторОтправкиЗапроса();
	ИначеЕсли КодСостояния = 503 Тогда
		Возврат КодОшибкиСервисВременноНеДоступен();
	ИначеЕсли КодСостояния = 500
		Или КодСостояния = 501
		Или КодСостояния = 502
		Или КодСостояния > 503 Тогда
		Возврат КодОшибкиНеизвестнаяОшибкаСервиса();
	ИначеЕсли КодСостояния <= 0 Тогда
		Возврат КодОшибкиОшибкаПодключения();
	Иначе
		Возврат КодОшибкиНеизвестнаяОшибка();
	КонецЕсли;
	
КонецФункции

// Определяет по коду ошибки сообщение пользователю.
//
// Параметры:
//  КодОшибки - Строка - ошибка сервиса см. процедуру ПереопределитьКодОшибкиСервиса.
//  ДополнительнаяИнформация - Неопределено, Строка - данные для дополнения сообщения, если КодОшибки
//    КодОшибкиПревышенМаксимальныйРазмерВложения или КодОшибкиОшибкаПодключения.
//
// Возвращаемое значение:
//  Строка - сообщение пользователю.
//
Функция ПереопределитьСообщениеПользователю(
		КодОшибки,
		ДополнительнаяИнформация = Неопределено)
	
	Если КодОшибки = "" Тогда
		Возврат "";
	ИначеЕсли КодОшибки = КодОшибкиНеверныйФорматЗапроса() Тогда
		Возврат НСтр("ru = 'Неверный набор параметров или формат запроса. Обратитесь к администратору.'");
	ИначеЕсли КодОшибки = КодОшибкиНеверныйЛогинИлиПароль() Тогда
		Возврат НСтр("ru = 'Ошибка авторизации на Портале 1С:ИТС.
			|Подробнее см. в журнале регистрации.'");
	ИначеЕсли КодОшибки = КодОшибкиПовторОтправкиЗапроса() Тогда
		Возврат НСтр("ru = 'Превышено количество попыток ввода отправки обращений. Повторите попытку позже.'");
	ИначеЕсли КодОшибки = КодОшибкиСервисВременноНеДоступен() Тогда
		Возврат НСтр("ru = 'Не удалось подключиться к сервису. Сервис временно недоступен.
			|Повторите попытку подключения позже.'");
	ИначеЕсли КодОшибки = КодОшибкиНеизвестнаяОшибкаСервиса() Тогда
		Возврат НСтр("ru = 'Не удалось подключиться к сервису. Сервис временно недоступен. Повторите попытку подключения позже.'");
	ИначеЕсли КодОшибки = КодОшибкиПревышенМаксимальныйРазмерВложения() Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Превышен максимально допустимый размер файла %1.'"),
					ДополнительнаяИнформация);
	ИначеЕсли КодОшибки = КодОшибкиОшибкаПодключения() Тогда
		Если ДополнительнаяИнформация <> Неопределено Тогда
			Возврат ДополнительнаяИнформация;
		Иначе
			Возврат НСтр("ru = 'Отсутствует доступ в сеть интернет по причине:
							|- компьютер не подключен к интернету;
							|- неполадки у интернет-провайдера;
							|- подключение к интернету блокирует межсетевой экран, 
							|  антивирусная программа или другое программное обеспечение.'");
		КонецЕсли;
	Иначе
		Возврат НСтр("ru = 'Неизвестная ошибка при подключении к сервису, повторите попытку позже.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Конструктор параметров, используемых подсистемой "Помощь".
// 
// Параметры:
//  ТиповаяФорма - Булево - Истина, если происходит работа с типовой формой БИП.
// 
// Возвращаемое значение:
//  Структура - параметры подсистемы:
//    * ПараметрыРаздела - см. ПараметрыРаздела.
//    * Команды - Соответствие Из КлючИЗначение - Коллекция команд для использования в алгоритмах:
//      ** Ключ - Строка - имя созданной команды.
//      ** Значение - Строка - тип команды.
//    * ТиповыеКарточки - Соответствие Из КлючИЗначение - описание элементов выведенных элементов:
//       ** Ключ - Строка - имя созданной группы или кнопки.
//       ** Значение - Структура - описание параметров карточки:
//         *** Идентификатор - Строка - идентификатор карточки
//         *** Ссылка - Строка - ссылка для перехода, указанная в методе
//               ПанельПомощьПереопределяемый.ПриОпределенииНастроек
//    * ТекущийИсточник - Строка - текущий источник поиска.
//    * ТекущаяКартинка - Картинка - картинка текущего варианта поиска.
//    * ТиповаяФорма - Булево - Истина, если происходит работа с типовой формой БИП.
//    * ТекущаяСтрокаПоиска - Строка - строка поиска, по которой выведена информация на форму.
//    * ИсторияПоиска - Массив Из Строка - история поиска текущего пользователя.
//    * ИспользуетсяИнформационныйЦентр - Булево - Истина, если в конфигурации используется
//      информационный центр.
//    * ЕстьСообщенияВСлужбуТехническойПоддержки - Булево - Истина, если в конфигурацию внедрена
//      подсистема ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки
//
Функция НовыйПараметрыПодсистемы(ТиповаяФорма = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("ПараметрыРаздела", ПараметрыРаздела());
	Результат.Вставить("Команды", Новый Соответствие);
	Результат.Вставить("ТиповыеКарточки", Новый Соответствие);
	Результат.Вставить("ТекущийИсточник", ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию());
	Результат.Вставить("ТекущаяКартинка", Новый Картинка());
	Результат.Вставить("ТиповаяФорма", ТиповаяФорма);
	Результат.Вставить("ТекущаяСтрокаПоиска", "");
	Результат.Вставить("ИсторияПоиска", Новый Массив);
	Результат.Вставить(
		"ИспользуетсяИнформационныйЦентр",
		ИнтернетПоддержкаПользователей.ИспользуетсяИнформационныйЦентр());
	Результат.Вставить(
		"ЕстьСообщенияВСлужбуТехническойПоддержки",
		ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки"));
	
	Настройки = ЗагрузитьНастройкиПользователяПанели("ИсторияПоиска");
	Если ТипЗнч(Настройки) = Тип("Массив") Тогда
		ДлинаИстории = Результат.ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории;
		Если ДлинаИстории > 0 Тогда
			Если Настройки.Количество() <= ДлинаИстории Тогда
				Результат.ИсторияПоиска = Настройки;
			Иначе
				Для Индекс = 0 По ДлинаИстории - 1 Цикл
					Результат.ИсторияПоиска.Добавить(Настройки[Индекс]);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Настройки = ЗагрузитьНастройкиПользователяПанели("ТекущийИсточник");
	Если Настройки <> Неопределено
		И Настройки <> ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию() Тогда
		Для Каждого ОписаниеИсточника Из Результат.ПараметрыРаздела.ПараметрыПоиска.ДополнительныеИсточники Цикл
			Если ОписаниеИсточника.Идентификатор = Настройки Тогда
				Результат.ТекущийИсточник = Настройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор параметров, используемых для
//  - определения параметров поиска;
//  - определения параметров строки поиска, выводимой на форму;
//  - определения параметров типовых карточек при выводе в нетиповую форму.
// 
// Возвращаемое значение:
//  Структура - параметры, используемые для поиска информации:
//    * КлючAPI - Строка - ключ API для выполнения поиска через сервис. Если не указан,
//           то при нажатии на кнопку Поиск будет выполнен переход на страницу сайта поиска.
//    * ИдентификаторыКонфигурации - Массив Из Строка - идентификаторы конфигурации, которые будут
//           использоваться при переходе на страницу https://its.1c.ru/db/morphmerged.
//           Могут быть не указаны, если нужен поиск по всей базе знаний.
//    * СтандартнаяОбработка - Булево - если Ложь, то поиск должен выполняться на стороннем сайте.
//           Поиск через сервис не выполняется, сразу открывается страница сайта, адрес которой формируется
//           в переопределяемом методе ПриОпределенииСтраницыПоиска. Значение по умолчанию - Истина.
//           Позволяет использовать подсистему в нетиповых конфигурациях.
//    * ПараметрыСтрокиПоиска - Структура - параметры строки поиска, выводимой на форму:
//      ** Представление - Строка - представление источника поиска, который используется по умолчанию,
//           если СтандартнаяОбработка = Ложь. Используется только в подменю выбора источника поиска.
//           Если нет дополнительных источников поиска, то может не заполняться.
//           Если не заполнено, то будет использоваться текст "База знаний".
//           Если СтандартнаяОбработка = Истина, то значение параметра игнорируется и всегда используется
//           значение "База знаний на 1С:ИТС".
//      ** Подсказка - Строка - подсказка ввода для строки поиска, которая будет использоваться по умолчанию,
//           если СтандартнаяОбработка = Ложь. Если не заполнено, то будет использоваться текст
//           "Введите ключевые слова для поиска в базе знаний".
//           Если СтандартнаяОбработка = Истина, то значение параметра игнорируется и всегда используется
//           значение "Введите ключевые слова для поиска в базе знаний 1С:ИТС".
//      ** Картинка - Строка, Картинка - Картинка для вывода в поле поиска, если СтандартнаяОбработка = Ложь.
//           При использовании типа Строка должно содержать имя картинки из Библиотеки картинок.
//           При использовании типа Картинка может использоваться только картинка из Библиотеки картинок.
//      ** КоличествоЗаписейВИстории - Число - количество записей в истории поиска. Значение заносится в историю
//           после выполнения поиска. Если значение меньше или равно 0, то история поиска не сохраняется.
//           Значение по умолчанию 15.
//      ** ШиринаПанели - Число - ширина группы с полем ввода и кнопкой поиска. При значении меньше или равном 0,
//           будет зависеть от разрешения экрана. Используется при выводе в нетиповую форму.
//           При выводе в типовую форму игнорируется; ширина зависит от разрешения экрана.ы
//           Значение по умолчанию 0.
//    * ДополнительныеИсточники - Массив Из см. ПанельПомощь.НовыйДополнительныеИсточники.
//    * ПараметрыТиповыхКарточек - Структура - параметры типовых карточек, при выводе в нетиповую форму:
//      ** КоличествоКолонокТиповыхКарточек - Число - если панель поиска выводится в нетиповую форму, то сразу
//           под ней будут выведены типовые кнопки "О программе", "Документация", "Справка" и "Ответы на вопросы".
//           Данный параметр определяет какое количество колонок должно использоваться.
//           Значение по умолчанию = 0 - выводятся в одну строку.
//           При указании любого отрицательного числа, количество будет определятся в зависимости
//           от разрешения экрана.
//           При выводе в типовую форму игнорируется, количество колонок зависит от разрешения экрана.
//       ** УменьшитьТиповыеКарточки - Булево - Если Истина, то при выводе в нетиповую форму,
//           карточки будут иметь меньшую высоту. При выводе в типовую форму параметр игнорируется.
Функция НовыйПараметрыПоиска()

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("КлючAPI", "");
	ПараметрыПоиска.Вставить("ИдентификаторыКонфигурации", Новый Массив);
	ПараметрыПоиска.Вставить("СтандартнаяОбработка", Истина);
	ПараметрыПоиска.Вставить("ДополнительныеИсточники", Новый Массив);
	
	ПараметрыСтрокиПоиска = Новый Структура;
	ПараметрыСтрокиПоиска.Вставить("Подсказка", "");
	ПараметрыСтрокиПоиска.Вставить("Картинка", "");
	ПараметрыСтрокиПоиска.Вставить("Представление", "");
	ПараметрыСтрокиПоиска.Вставить("КоличествоЗаписейВИстории", 15);
	ПараметрыСтрокиПоиска.Вставить("ШиринаПанели", 0);
	ПараметрыПоиска.Вставить("ПараметрыСтрокиПоиска", ПараметрыСтрокиПоиска);
	
	ПараметрыТиповыхКарточек = Новый Структура;
	ПараметрыТиповыхКарточек.Вставить("КоличествоКолонокТиповыхКарточек", 0);
	ПараметрыТиповыхКарточек.Вставить("УменьшитьТиповыеКарточки", Ложь);
	ПараметрыПоиска.Вставить("ПараметрыТиповыхКарточек", ПараметрыТиповыхКарточек);
	
	Возврат ПараметрыПоиска;
	
КонецФункции

// Конструктор описания логотипа.
// 
// Возвращаемое значение:
//  Структура - логотип или маскот, выводимый в правом нижнем углу:
//   * Картинка - Неопределено, Строка, Картинка, ДвоичныеДанные - информация о картинке, которая должна
//           выводится в область логотипа. При использовании типа Строка может содержать либо
//           имя картинки из Библиотеки картинок, либо адрес двоичных данных во временном хранилище.
//           Если не заполнена, то логотип не выводится.
//   * Подсказка - Строка - текст подсказки для логотипа.
//   * Цвет - Цвет, Неопределено - Цвет логотипа. Имеет значение только если логотип задается шаблонной
//           картинкой.
//   * Ссылка - Строка - Ссылка для перехода при щелчке по логотипу. Может быть не заполнено или
//           заполнено произвольной строкой, поскольку дополнительно обрабатывается в
//           методе ПриОбработкеНавигационнойСсылки.
Функция НовыйЛоготип()
	
	Логотип = Новый Структура;
	Логотип.Вставить("Картинка", Неопределено);
	Логотип.Вставить("Подсказка", "");
	Логотип.Вставить("Цвет", Неопределено);
	Логотип.Вставить("Ссылка", "");

	Возврат Логотип;
	
КонецФункции

// Создает описание результат операции в сервисе.
//
// Возвращаемое значение:
//  Структура - результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция НовыйРезультатОперации()
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("КодОшибки", "");
	РезультатОперации.Вставить("СообщениеОбОшибке", "");
	РезультатОперации.Вставить("ИнформацияОбОшибке", "");
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти

#Область Пожелания

// Выполняет отправку пожелания в сервис.
// 
// Параметры:
//  Получатель - Строка - служебный идентификатор получателя.
//  Тема - Строка - тема сообщения.
//  Сообщение - Строка - текст сообщения.
//
// Возвращаемое значение:
//  Структура - результат получения ссылки:
//   * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//   * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//   * URL - Строка - URL страницы отправки сообщения.
//
Функция ОтправитьПожеланияВСервис(Получатель, Тема, Сообщение) Экспорт
	
	// Сюда попадаем только если не используется Информационный центр и
	// есть подсистема СообщенияВСлужбуТехническойПоддержки.
	// Поэтому сразу отправляем сообщение, без дополнительных проверок.
	
	ПараметрыДанныхДляТехПоддержки = ПараметрыДанныхДляТехПоддержки();
	ПараметрыДанныхДляТехПоддержки.ДанныеРасширений = Ложь;
	ПараметрыДанныхДляТехПоддержки.СистемнаяИнформацияСервера = Ложь;
	ПараметрыДанныхДляТехПоддержки.СистемнаяИнформацияКлиента = Ложь;

	ДанныеДляТехПоддержки = ДанныеДляТехПоддержки(ПараметрыДанныхДляТехПоддержки);
	ДанныеДляТехПоддержки.НастройкиИнтернетПоддержки.Удалить("УстанавливатьРегистрационныйНомер");
	
	МодульСообщенияВСлужбуТехническойПоддержки = ОбщегоНазначения.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержки");
	
	ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержки.НовыйДанныеСообщенияИдея(
		Получатель,
		ДанныеДляТехПоддержки);
	ДанныеСообщения.Вставить("Тема", Тема);
	ДанныеСообщения.Вставить("Сообщение", Сообщение);
	
	Возврат МодульСообщенияВСлужбуТехническойПоддержки.ОтправитьИдеюВСервис(ДанныеСообщения);
	
КонецФункции

// Возвращает код ошибки "НеверныйФорматЗапроса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеверныйФорматЗапроса()
	
	Возврат "НеверныйФорматЗапроса";
	
КонецФункции

// Возвращает код ошибки "ПревышенМаксимальныйРазмерВложения".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиПревышенМаксимальныйРазмерВложения()
	
	Возврат "ПревышенМаксимальныйРазмерВложения";
	
КонецФункции

// Возвращает код ошибки "ПовторОтправкиЗапроса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиПовторОтправкиЗапроса()
	
	Возврат "ПовторОтправкиЗапроса";
	
КонецФункции

// Возвращает код ошибки "НеизвестнаяОшибка".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеизвестнаяОшибка()
	
	Возврат "НеизвестнаяОшибка";
	
КонецФункции

// Возвращает код ошибки "ОшибкаПодключения".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОшибкаПодключения()
	
	Возврат "ОшибкаПодключения";
	
КонецФункции

// Возвращает код ошибки "НеизвестнаяОшибкаСервиса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеизвестнаяОшибкаСервиса()
	
	Возврат "НеизвестнаяОшибкаСервиса";
	
КонецФункции

// Возвращает код ошибки "СервисВременноНеДоступен".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиСервисВременноНеДоступен()
	
	Возврат "СервисВременноНеДоступен";
	
КонецФункции

// Возвращает код ошибки "НеверныйЛогинИлиПароль".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеверныйЛогинИлиПароль()
	
	Возврат "НеверныйЛогинИлиПароль";
	
КонецФункции

#КонецОбласти

#Область ТехническаяИнформация

// Формирует параметры системы, которые могут понадобиться пользователю при обращении в тех. поддержку.
// 
// Параметры:
//  Параметры - см. ПараметрыДанныхДляТехПоддержки.
//            - Неопределено - использовать параметры по умолчанию.
// 
// Возвращаемое значение:
//  см. ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеТехническойИнформации.
// 
Функция ДанныеДляТехПоддержки(Параметры = Неопределено) Экспорт
	
	Эталон = ПараметрыДанныхДляТехПоддержки();
	Если Параметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Эталон, Параметры);
	КонецЕсли;
	
	Результат = ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеТехническойИнформации();
	
	Если Эталон.ОписаниеПрограммы Тогда
		Результат.Вставить(
			"ОписаниеПрограммы",
			ИнтернетПоддержкаПользователей.ОписаниеПрограммы());
	КонецЕсли;
	Если Эталон.ТекущаяСессия Тогда
		Результат.Вставить(
			"ТекущаяСессия",
			ИнтернетПоддержкаПользователей.ОписаниеТекущейСессии());
	КонецЕсли;
	Если Эталон.НастройкиИнтернетПоддержки Тогда
		НастройкиТехническойИнформации = ИнтернетПоддержкаПользователейКлиентСервер.НастройкиТехническойИнформации();
		Если Эталон.НастройкиТехническойИнформации <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НастройкиТехническойИнформации, Эталон.НастройкиТехническойИнформации);
		КонецЕсли;
		Результат.Вставить(
			"НастройкиИнтернетПоддержки",
			ИнтернетПоддержкаПользователей.НастройкиИнтернетПоддержки(
				НастройкиТехническойИнформации));
	КонецЕсли;
	Если Эталон.ИнтернетНастройки Тогда
		Результат.Вставить(
			"ИнтернетНастройки",
			ИнтернетПоддержкаПользователей.ИнтернетНастройки());
	КонецЕсли;
	Если Эталон.ДанныеРасширений Тогда
		Результат.Вставить("ДанныеРасширений", ДанныеРасширений());
	КонецЕсли;
	
	Если Эталон.СистемнаяИнформацияСервера Или Эталон.СистемнаяИнформацияКлиента Тогда
		Если Эталон.ДанныеСистемнойИнформации = Неопределено Тогда
			Эталон.ДанныеСистемнойИнформации = ТехническаяИнформацияСистемнаяИнформация();
		КонецЕсли;
		
		Если Эталон.СистемнаяИнформацияСервера Тогда
			Результат.Вставить(
				"СистемнаяИнформацияСервера",
				Эталон.ДанныеСистемнойИнформации.СистемнаяИнформацияСервера);
		КонецЕсли;
		Если Эталон.СистемнаяИнформацияКлиента Тогда
			Результат.Вставить(
				"СистемнаяИнформацияКлиента",
				Эталон.ДанныеСистемнойИнформации.СистемнаяИнформацияСервера);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Конструктор параметров метода ДанныеДляТехПоддержки.
// 
// Возвращаемое значение:
//  Структура - параметры получения данных о системе:
//   * ДанныеСистемнойИнформации - см. ТехническаяИнформацияСистемнаяИнформация.
//                               - Неопределено - данные системной информации должны быть получены внутри
//                                 метода ДанныеДляТехПоддержки.
//   * НастройкиТехническойИнформации - см. ИнтернетПоддержкаПользователейКлиентСервер.НастройкиТехническойИнформации.
//                                    - Неопределено - использовать значения по умолчанию.
//   * ОписаниеПрограммы - Булево - получать описание программы.
//   * ТекущаяСессия - Булево - получать описание текущей сессии.
//   * НастройкиИнтернетПоддержки - Булево - получать настройки интернет-поддержки.
//   * ИнтернетНастройки - Булево - получать интернет-настройки.
//   * СистемнаяИнформацияСервера - Булево - получать системную информацию сервера.
//   * СистемнаяИнформацияКлиента - Булево - получать системную информацию клиента.
//   * ДанныеРасширений - Булево - получать данные расширений.
// 
Функция ПараметрыДанныхДляТехПоддержки() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ДанныеСистемнойИнформации", Неопределено);
	Результат.Вставить("НастройкиТехническойИнформации", Неопределено);
	Результат.Вставить("ОписаниеПрограммы", Истина);
	Результат.Вставить("ТекущаяСессия", Истина);
	Результат.Вставить("НастройкиИнтернетПоддержки", Истина);
	Результат.Вставить("ИнтернетНастройки", Истина);
	Результат.Вставить("СистемнаяИнформацияСервера", Истина);
	Результат.Вставить("СистемнаяИнформацияКлиента", Истина);
	Результат.Вставить("ДанныеРасширений", Истина);
	
	Возврат Результат;
	
КонецФункции

// Получает системную информацию клиента и сервера.
// 
// Возвращаемое значение:
//  Структура - системная информация:
//   * СистемнаяИнформацияСервера - см. ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеСистемнойИнформации.
//   * СистемнаяИнформацияКлиента - см. ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеСистемнойИнформации.
// 
Функция ТехническаяИнформацияСистемнаяИнформация() Экспорт
	
	СистИнфоКлиент = ОбщегоНазначения.СистемнаяИнформацияКлиента();
	
	СистемнаяИнформацияКлиента =
		ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеСистемнойИнформации();
	СистемнаяИнформацияСервера =
		ИнтернетПоддержкаПользователейКлиентСервер.ОписаниеСистемнойИнформации();
	
	ЗаполнитьЗначенияСвойств(
		СистемнаяИнформацияСервера,
		Новый СистемнаяИнформация());
	
	Если СистИнфоКлиент <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(
			СистемнаяИнформацияКлиента,
			СистИнфоКлиент);
		СистемнаяИнформацияКлиента.ТипПлатформы =
			ОбщегоНазначенияКлиентСервер.ИмяТипаПлатформы(
				СистемнаяИнформацияКлиента.ТипПлатформы);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СистемнаяИнформацияСервера Цикл
		Если СистемнаяИнформацияСервера[КлючЗначение.Ключ] <> Неопределено Тогда
			СистемнаяИнформацияСервера[КлючЗначение.Ключ] = Строка(
				СистемнаяИнформацияСервера[КлючЗначение.Ключ]);
		КонецЕсли;
		Если СистемнаяИнформацияКлиента[КлючЗначение.Ключ] <> Неопределено Тогда
			СистемнаяИнформацияКлиента[КлючЗначение.Ключ] = Строка(
				СистемнаяИнформацияКлиента[КлючЗначение.Ключ]);
		КонецЕсли;
	КонецЦикла;
	
	СистемнаяИнформацияСервера.ТипПлатформы =
		ОбщегоНазначенияКлиентСервер.ИмяТипаПлатформы(
			СистемнаяИнформацияСервера.ТипПлатформы);
	
	Результат = Новый Структура(
		"СистемнаяИнформацияСервера, СистемнаяИнформацияКлиента",
		СистемнаяИнформацияСервера,
		СистемнаяИнформацияКлиента);

	Возврат Результат;

КонецФункции

// Получает данные расширений.
// 
// Возвращаемое значение:
//  Структура - данные расширений конфигурации:
//   * АвтоматическаяУстановкаПатчей - Булево - признак включения автоматической установки патчей.
//             - Неопределено - если в конфигурации отсутствует подсистема ПолучениеОбновленийПрограммы.
//   * Расширения - Массив Из см. НовыйРасширениеКонфигурации - описание всех расширений.
// 
Функция ДанныеРасширений()
	
	Результат = Новый Структура;
	
	Результат.Вставить("АвтоматическаяУстановкаПатчей", Неопределено);
	Результат.Вставить("Расширения", Новый Массив);
	
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	НазначениеИсправление = Метаданные.СвойстваОбъектов.НазначениеРасширенияКонфигурации.Исправление;
	ПреобразоватьВСтроку = СтрРазделить("ГлавныйУзел,Назначение,ОбластьДействия,УникальныйИдентификатор,ХешСумма", ",");
	Для Каждого Расширение Из Расширения Цикл
		НовыйЭлемент = НовыйРасширениеКонфигурации();
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Расширение);
		
		Для Каждого ИмяПоля Из ПреобразоватьВСтроку Цикл
			НовыйЭлемент[ИмяПоля] = Строка(НовыйЭлемент[ИмяПоля]);
		КонецЦикла;
		
		Если НовыйЭлемент.ЗащитаОтОпасныхДействий <> Неопределено Тогда
			НовоеЗначение = НовыйЭлемент.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях;
			НовыйЭлемент.ЗащитаОтОпасныхДействий = Новый Структура(
				"ПредупреждатьОбОпасныхДействиях",
				НовоеЗначение);
		КонецЕсли;
			
		Если НовыйЭлемент.ОсновныеРоли <> Неопределено Тогда
			ОсновныеРоли = Новый Массив;
			Для Каждого ОсновнаяРоль Из НовыйЭлемент.ОсновныеРоли Цикл
				ОсновныеРоли.Добавить(Строка(ОсновнаяРоль));
			КонецЦикла;
			НовыйЭлемент.ОсновныеРоли = ОсновныеРоли;
		КонецЕсли;
		
		НовыйЭлемент.ЭтоИсправление = (Расширение.Назначение = НазначениеИсправление)
			И СтрНачинаетсяС(Расширение.Имя, "EF");
		
		Результат.Расширения.Добавить(НовыйЭлемент);
		
	КонецЦикла;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПолучениеОбновленийПрограммы") Тогда
		МодульПолучениеОбновленийПрограммы = ОбщегоНазначения.ОбщийМодуль("ПолучениеОбновленийПрограммы");
		Результат.АвтоматическаяУстановкаПатчей = МодульПолучениеОбновленийПрограммы.АвтоматическаяЗагрузкаИсправленийВключена();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает пустое описание метаданные расширения конфигурации.
//
// Возвращаемое значение:
//   Структура - описание расширения:
//     * Активно - Булево - признак, что расширение активно.
//     * БезопасныйРежим - Булево - признак использования безопасного режима.
//     * Версия - Строка - версия расширения.
//     * ГлавныйУзел - Неопределено, Строка - узел распределенной информационной базы,
//        в котором создано данное расширение конфигурации.
//     * ЗащитаОтОпасныхДействий - Неопределено, ОписаниеЗащитыОтОпасныхДействий - использование защиты от
//         опасных действий.
//     * Имя - Строка - имя расширения.
//     * ИспользоватьОсновныеРолиДляВсехПользователей - Булево - признак использования основных ролей
//        для всех пользователей.
//     * ИспользуетсяВРаспределеннойИнформационнойБазе - Булево - признак использования в распределенной ИБ.
//     * Назначение - Строка - назначение расширения.
//     * ОбластьДействия - Строка, Неопределено - область действия расширения.
//     * ОсновныеРоли - Неопределено, Массив из Строка - список основных ролей.
//     * Синоним - Строка - Синоним имени расширения конфигурации.
//     * УникальныйИдентификатор - Строка - уникальный идентификатор расширения
//     * ХешСумма - Строка - Хеш-сумма расширения.
//     * ЭтоИсправление - Булево - признак, что это исправление.
//
Функция НовыйРасширениеКонфигурации()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Активно", Ложь);
	Результат.Вставить("БезопасныйРежим", Ложь);
	Результат.Вставить("Версия", "");
	Результат.Вставить("ГлавныйУзел", Неопределено);
	Результат.Вставить("ЗащитаОтОпасныхДействий", Неопределено);
	Результат.Вставить("Имя", "");
	Результат.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей", Ложь);
	Результат.Вставить("ИспользуетсяВРаспределеннойИнформационнойБазе", Ложь);
	Результат.Вставить("Назначение", "");
	Результат.Вставить("ОбластьДействия", Неопределено);
	Результат.Вставить("ОсновныеРоли", Неопределено);
	Результат.Вставить("Синоним", "");
	Результат.Вставить("УникальныйИдентификатор", "");
	Результат.Вставить("ХешСумма", "");
	Результат.Вставить("ЭтоИсправление", Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

// Добавляет запись в журнал регистрации.
//
// Параметры:
//  СообщениеОбОшибке - Строка - комментарий к записи журнала регистрации.
//  Ошибка - Булево - если Истина будет установлен уровень журнала регистрации "Ошибка".
//  Данные -  Неопределено, Произвольный - Данные, с которыми связано событие.
//    Рекомендуется указывать ссылки на объекты данных (элементы справочников, документы,
//    к которым относится событие).
//
Процедура ЗаписатьИнформациюВЖурналРегистрации(
		СообщениеОбОшибке,
		Ошибка = Истина,
		Данные = Неопределено) Экспорт
	
	УровеньЖР = ?(Ошибка, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурналаРегистрации(),
		УровеньЖР,
		,
		Данные,
		Лев(СообщениеОбОшибке, 5120));
	
КонецПроцедуры

// Возвращает имя события для журнала регистрации.
//
// Возвращаемое значение:
//  Строка - имя события.
//
Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Панель Помощь'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Сохраняет настройки пользователя, относящиеся к панели помощь, в хранилище системных настроек.
// 
// Параметры:
//  КлючНастроек - Строка - ключ сохраняемых настроек.
//  Настройки - Строка - значение сохраняемых настроек
//
Процедура СохранитьНастройкиПользователяПанели(КлючНастроек, Настройки) Экспорт
	
	КлючаОбъекта = "БИП_ФормаПомощь";
	ХранилищеСистемныхНастроек.Сохранить(КлючаОбъекта, КлючНастроек, Настройки);
	
КонецПроцедуры

// Загружает настройки пользователя, относящиеся к панели помощь, из хранилища системных настроек.
// 
// Параметры:
//  КлючНастроек - Строка - ключ сохраняемых настроек.
//  
// Возвращаемое значение:
//  Неопределено, Произвольный - значение сохраненных настроек.
//
Функция ЗагрузитьНастройкиПользователяПанели(КлючНастроек)
	
	КлючаОбъекта = "БИП_ФормаПомощь";
	Возврат ХранилищеСистемныхНастроек.Загрузить(КлючаОбъекта, КлючНастроек);
	
КонецФункции

#КонецОбласти

#КонецОбласти
