&НаКлиенте
Перем КонтекстЭДОКлиент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	ИспользуетсяОднаОрганизация = РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация();
	
	НастройкиУведомлений =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.НастройкиУведомленияОрганизаций("Все");
	Показывать = НастройкиУведомлений.Показывать;
	ВсеОрганизации = НастройкиУведомлений.ВсеОрганизации;
	ОбщегоНазначенияЭДКОКлиентСервер.СоответствиеВДанныеФормыКоллекцию(
		НастройкиУведомлений.Организации,
		НастройкиУведомленийОрганизаций,
		"Организация");
	
	ОрганизацииСОграничениемПрав = ?(КонтекстЭДОСервер = Неопределено, Новый Массив,
		КонтекстЭДОСервер.ОрганизацииСОграничениемПрав(Истина));
	ОрганизацииИспользующиеОбмен =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ОрганизацииИспользующиеОбмен();
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ПараметрыОтбора = Новый Структура("Организация", "Все");
	МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
	НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
		НастройкиУведомленийОрганизацииПоУмолчанию, МассивНастроек[0]);
	ПараметрыАнализа =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыАнализаУведомленийОрганизации();
	
	Для каждого СтрокаОрганизацийСОграничениемПрав Из ОрганизацииСОграничениемПрав Цикл
		ПараметрыОтбора = Новый Структура("Организация, ОтправкаОтчетности",
			СтрокаОрганизацийСОграничениемПрав.Ссылка, Истина);
		МассивСтрок = ОрганизацииИспользующиеОбмен.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Организация", СтрокаОрганизацийСОграничениемПрав.Ссылка);
		МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
		НастройкиУведомленийОрганизации = ?(МассивНастроек.Количество() = 0, Неопределено, МассивНастроек[0]);
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПроанализироватьУведомленияОрганизации(
			НастройкиУведомленийОрганизацииПоУмолчанию,
			НастройкиУведомленийВсехОрганизаций,
			НастройкиУведомленийОрганизации,
			ПараметрыАнализа);
		
		СтрокаОрганизации = Организации.Добавить();
		СтрокаОрганизации.Ссылка = МассивСтрок[0].Организация;
		СтрокаОрганизации.Пометка = ПараметрыАнализа.ЭтоВыбранная;
	КонецЦикла;
	
	Элементы.ГруппаОрганизации.Видимость = НЕ ИспользуетсяОднаОрганизация;
	
	УправлениеФормой(ЭтотОбъект);
	
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Инициализируем контекст формы - контейнера клиентских методов
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацииНажатие(Элемент)
	
	СписокОрганизаций = Новый СписокЗначений;
	Для каждого СтрокаОрганизации Из Организации Цикл
		СписокОрганизаций.Добавить(СтрокаОрганизации.Ссылка, Строка(СтрокаОрганизации.Ссылка), СтрокаОрганизации.Пометка);
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияОрганизацииНажатиеПослеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВсеОрганизации", ВсеОрганизации);
	ПараметрыФормы.Вставить("Организации", СписокОрганизаций);
	ОткрытьФорму(
		КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ВыборОрганизаций",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВидыУведомленийНажатие(Элемент)
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ПараметрыОтбора = Новый Структура("Организация", "Все");
	МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
	НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
		НастройкиУведомленийОрганизацииПоУмолчанию, МассивНастроек[0]);
	
	НастройкиУведомленийВсехОрганизацийСтруктура =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
		НастройкиУведомленийВсехОрганизацийСтруктура,
		НастройкиУведомленийВсехОрганизаций,
		НастройкиУведомленийОрганизацииПоУмолчанию);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияВидыУведомленийНажатиеПослеВыбора", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НастройкиУведомленийОрганизации", НастройкиУведомленийВсехОрганизацийСтруктура);
	ОткрытьФорму(
		КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ВыборВидовУведомлений",
		ПараметрыФормы,
		ЭтотОбъект,,,,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ЕстьНепомеченные = Истина;
	НастройкиУведомленийВсехОрганизаций =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Ложь);
	Если Показывать Тогда
		Если НЕ ВсеОрганизации Тогда
			ПараметрыОтбора = Новый Структура("Пометка", Истина);
			МассивПомеченныхОрганизаций = Организации.НайтиСтроки(ПараметрыОтбора);
			Если Организации.Количество() <> 0 И МассивПомеченныхОрганизаций.Количество() = 0 Тогда
				ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана ни одна организация'"));
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Организация", "Все");
		МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
		НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
			Неопределено, МассивНастроек[0]);
		ПараметрыАнализа =
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыАнализаУведомленийОрганизации();
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПроанализироватьУведомленияОрганизации(
			НастройкиУведомленийОрганизацииПоУмолчанию,
			НастройкиУведомленийВсехОрганизаций,
			НастройкиУведомленийВсехОрганизаций,
			ПараметрыАнализа);
		
		Если НЕ ПараметрыАнализа.ЭтоВыбранная Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбран ни один вид уведомления'"));
			Возврат;
		КонецЕсли;
		
		Если НастройкиУведомленийВсехОрганизаций = Неопределено Тогда
			НастройкиУведомленийВсехОрганизаций = НастройкиУведомленийОрганизацииПоУмолчанию;
		КонецЕсли;
		
		ЕстьНепомеченные = НЕ ВсеОрганизации И МассивПомеченныхОрганизаций.Количество() < Организации.Количество();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьИЗакрытьПослеВопросаОбОтключенииУведомлений", ЭтотОбъект);
	
	ПредупрежденияУведомлений =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации("");
	ПредупрежденияУведомлений.УведомлениеОСообщенияхТребующихРасшифровки =
		НСтр("ru = 'к несвоевременному получению информации о новых требованиях и результатах обработки госорганами'");
	ПредупрежденияУведомлений.УведомлениеПоИстекающимСертификатам =
		НСтр("ru = 'к несвоевременному информированию о необходимости переиздания сертификатов, из-за чего вы можете не успеть сдать отчетность в срок'");
	
	НаименованияУведомлений =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации("ВернутьНаименованияУведомлений");
	ОтключенныеДляВсех = "";
	ОтключенныеДляНекоторых = "";
	СначалаДляВсех = Неопределено;
	Для каждого КлючИЗначениеНастроек Из НастройкиУведомленийОрганизацииПоУмолчанию Цикл
		// поиск флага "УведомлениеОСообщенияхТребующихРасшифровки" и подобных
		Если СтрНачинаетсяС(КлючИЗначениеНастроек.Ключ, "Уведомление")
			И ТипЗнч(КлючИЗначениеНастроек.Значение) = Тип("Булево")
			И ЗначениеЗаполнено(ПредупрежденияУведомлений[КлючИЗначениеНастроек.Ключ]) Тогда
			
			Если НЕ НастройкиУведомленийВсехОрганизаций[КлючИЗначениеНастроек.Ключ] ИЛИ ЕстьНепомеченные Тогда
				ЭтоДляВсех = НЕ НастройкиУведомленийВсехОрганизаций[КлючИЗначениеНастроек.Ключ] ИЛИ ИспользуетсяОднаОрганизация;
				Если СначалаДляВсех = Неопределено Тогда
					СначалаДляВсех = ЭтоДляВсех;
				КонецЕсли;
				
				Если ЭтоДляВсех Тогда
					ОтключенныеДляВсех = ОтключенныеДляВсех + ?(ЗначениеЗаполнено(ОтключенныеДляВсех), ", ", "")
						+ ОбщегоНазначенияЭДКОКлиентСервер.ИзменитьРегистрПодстроки(НаименованияУведомлений[КлючИЗначениеНастроек.Ключ]);
					
				Иначе
					ОтключенныеДляНекоторых = ОтключенныеДляНекоторых + ?(ЗначениеЗаполнено(ОтключенныеДляНекоторых), ", ", "")
						+ ОбщегоНазначенияЭДКОКлиентСервер.ИзменитьРегистрПодстроки(НаименованияУведомлений[КлючИЗначениеНастроек.Ключ]);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТекстВидовУведомлений = "";
	ТекстПредупрежденийУведомлений = "";
	Если ЗначениеЗаполнено(ОтключенныеДляВсех) ИЛИ ЗначениеЗаполнено(ОтключенныеДляНекоторых) Тогда
		ШаблонВидовУведомлений = НСтр("ru = 'Для %1 отключены уведомления %2'");
		ВсехОрганизаций = ?(ИспользуетсяОднаОрганизация, НСтр("ru = 'организации'"), НСтр("ru = 'всех организаций'"));
		НекоторыхОрганизаций = НСтр("ru = 'некоторых организаций'");
		
		Для НомерПрохода = 1 По 2 Цикл
			ЭтоДляВсех = СначалаДляВсех = Истина И НомерПрохода = 1 ИЛИ СначалаДляВсех <> Истина И НомерПрохода <> 1;
			ОтключенныеУведомления = ?(ЭтоДляВсех, ОтключенныеДляВсех, ОтключенныеДляНекоторых);
			Если ЗначениеЗаполнено(ОтключенныеУведомления) Тогда
				ТекстПрохода = СтрШаблон(
					ШаблонВидовУведомлений,
					?(ЭтоДляВсех, ВсехОрганизаций, НекоторыхОрганизаций),
					?(ЭтоДляВсех, ОтключенныеДляВсех, ОтключенныеДляНекоторых));
				ТекстВидовУведомлений = ТекстВидовУведомлений + ?(ЗначениеЗаполнено(ТекстВидовУведомлений),
					", " + ОбщегоНазначенияЭДКОКлиентСервер.ИзменитьРегистрПодстроки(ТекстПрохода), ТекстПрохода);
			КонецЕсли;
		КонецЦикла;
		
		Для каждого КлючИЗначениеНастроек Из НастройкиУведомленийОрганизацииПоУмолчанию Цикл
			// поиск флага "УведомлениеОСообщенияхТребующихРасшифровки" и подобных
			Если СтрНачинаетсяС(КлючИЗначениеНастроек.Ключ, "Уведомление")
				И ТипЗнч(КлючИЗначениеНастроек.Значение) = Тип("Булево")
				И ЗначениеЗаполнено(ПредупрежденияУведомлений[КлючИЗначениеНастроек.Ключ])
				И (НЕ НастройкиУведомленийВсехОрганизаций[КлючИЗначениеНастроек.Ключ] ИЛИ ЕстьНепомеченные) Тогда
				
				ЭтоПервоеПредупреждение = НЕ ЗначениеЗаполнено(ТекстПредупрежденийУведомлений);
				ТекстПредупрежденийУведомлений = ТекстПредупрежденийУведомлений + ?(ЭтоПервоеПредупреждение, "", ", ")
					+ СтрШаблон(
						?(ЭтоПервоеПредупреждение, НСтр("ru = 'Это может привести %1'"), НСтр("ru = 'а также %1'")),
						ПредупрежденияУведомлений[КлючИЗначениеНастроек.Ключ])
						+ ?(КлючИЗначениеНастроек.Ключ = "УведомлениеОСообщенияхТребующихРасшифровки"
							И ЭтоПервоеПредупреждение И НЕ СначалаДляВсех И НЕ ИспользуетсяОднаОрганизация,
							" " + НСтр("ru = 'по этим организациям'"), "");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВидовУведомлений) Тогда
		ТекстВопроса = СтрШаблон(
			НСтр("ru = 'Внимание!
				|
				|%1.
				|%2.
				|
				|Сохранить настройки?'"),
			ТекстВидовУведомлений,
			ТекстПредупрежденийУведомлений);
		ПоказатьВопрос(
			ОписаниеОповещения,
			ТекстВопроса,
			РежимДиалогаВопрос.ДаНет,,
			КодВозвратаДиалога.Нет);
		
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ГруппаОрганизации.Доступность = Форма.Показывать;
	Форма.Элементы.ГруппаВидыУведомлений.Доступность = Форма.Показывать;
	
	ПараметрыОтбора = Новый Структура("Пометка", Истина);
	МассивНастроек = Форма.Организации.НайтиСтроки(ПараметрыОтбора);
	МассивОрганизаций = ОбщегоНазначенияЭДКОКлиентСервер.ВыгрузитьКлючСтруктуры(МассивНастроек, "Ссылка");
	
	Форма.Элементы.ДекорацияОрганизации.Заголовок =
		ОбщегоНазначенияЭДКОКлиентСервер.ПервыеЗначенияИЕщеКоличествоОставшихся(
			МассивОрганизаций,
			1,
			Форма.ВсеОрганизации);
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ПараметрыОтбора = Новый Структура("Организация", "Все");
	МассивНастроек = Форма.НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
	НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
		НастройкиУведомленийОрганизацииПоУмолчанию, МассивНастроек[0]);
	
	Форма.Элементы.ДекорацияВидыУведомлений.Заголовок =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.НастройкиУведомленийОрганизацииСтрокой(
			НастройкиУведомленийВсехОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	Если КонтекстЭДОКлиент = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	КолонкиНастроек = "";
	Для каждого КлючИЗначениеНастроек Из НастройкиУведомленийОрганизацииПоУмолчанию Цикл
		КолонкиНастроек = КолонкиНастроек + ?(ЗначениеЗаполнено(КолонкиНастроек), ", ", "") + КлючИЗначениеНастроек.Ключ;
	КонецЦикла;
	НастройкиУведомленийОрганизацийСоответствие = ОбщегоНазначенияЭДКОКлиентСервер.ДанныеФормыКоллекцияВСоответствие(
		НастройкиУведомленийОрганизаций,
		"Организация, " + КолонкиНастроек);
	НастройкиУведомлений = Новый Структура;
	НастройкиУведомлений.Вставить("Показывать", Показывать);
	НастройкиУведомлений.Вставить("ВсеОрганизации", ВсеОрганизации);
	НастройкиУведомлений.Вставить("Организации", НастройкиУведомленийОрганизацийСоответствие);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ДокументооборотСКонтролирующимиОрганами_НастройкиУведомлений",
		"", НастройкиУведомлений);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьПослеВопросаОбОтключенииУведомлений(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьНастройки();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОрганизацииНажатиеПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ВсеОрганизации = Результат.ВсеОрганизации;
	
	Организации.Очистить();
	Для каждого СтрокаРезультата Из Результат.Организации Цикл
		СтрокаОрганизации = Организации.Добавить();
		СтрокаОрганизации.Ссылка = СтрокаРезультата.Значение;
		СтрокаОрганизации.Пометка = СтрокаРезультата.Пометка;
	КонецЦикла;
	
	// удаление в настройках помеченных организаций и очистка непомеченных
	
	НастройкиУведомленийОрганизацииСОтключенными =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации();
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ПараметрыОтбора = Новый Структура("Организация", "Все");
	МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
	НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
		НастройкиУведомленийОрганизацииПоУмолчанию, МассивНастроек[0]);
	ПараметрыАнализа =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыАнализаУведомленийОрганизации();
	
	МассивУдаляемых = Новый Массив;
	Для каждого НастройкиУведомленийОрганизации Из НастройкиУведомленийОрганизаций Цикл
		Если НастройкиУведомленийОрганизации.Организация <> "Все" Тогда
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПроанализироватьУведомленияОрганизации(
				НастройкиУведомленийОрганизацииПоУмолчанию,
				НастройкиУведомленийВсехОрганизаций,
				НастройкиУведомленийОрганизации,
				ПараметрыАнализа);
			
			ПараметрыОтбора = Новый Структура("Ссылка", НастройкиУведомленийОрганизации.Организация);
			МассивНастроек = Организации.НайтиСтроки(ПараметрыОтбора);
			СтрокаОрганизаций = ?(МассивНастроек.Количество() = 0, Неопределено, МассивНастроек[0]);
			ПометкаСтрокиОрганизаций = (СтрокаОрганизаций = Неопределено ИЛИ СтрокаОрганизаций.Пометка);
			
			Если ПараметрыАнализа.ЭтоВыбранная И НЕ ПометкаСтрокиОрганизаций Тогда
				ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
					НастройкиУведомленийОрганизации,
					НастройкиУведомленийОрганизацииСОтключенными,
					НастройкиУведомленийОрганизацииПоУмолчанию);
				
			ИначеЕсли НЕ ПараметрыАнализа.ЭтоВыбранная И ПометкаСтрокиОрганизаций Тогда
				МассивУдаляемых.Добавить(НастройкиУведомленийОрганизации);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого СтрокаМассиваУдаляемых Из МассивУдаляемых Цикл
		НастройкиУведомленийОрганизаций.Удалить(СтрокаМассиваУдаляемых);
	КонецЦикла;
	
	// добавление в настройки непомеченных организаций
	
	ПараметрыОтбора = Новый Структура("Пометка", Ложь);
	МассивНепомеченныхОрганизаций = Организации.НайтиСтроки(ПараметрыОтбора);
	Для каждого СтрокаНепомеченнойОрганизации Из МассивНепомеченныхОрганизаций Цикл
		ПараметрыОтбора = Новый Структура("Организация", СтрокаНепомеченнойОрганизации.Ссылка);
		МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
		Если МассивНастроек.Количество() = 0 Тогда
			НастройкиУведомленийОрганизации = НастройкиУведомленийОрганизаций.Добавить();
			НастройкиУведомленийОрганизации.Организация = СтрокаНепомеченнойОрганизации.Ссылка;
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
				НастройкиУведомленийОрганизации,
				НастройкиУведомленийОрганизацииСОтключенными,
				НастройкиУведомленийОрганизацииПоУмолчанию);
		КонецЕсли;
	КонецЦикла;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВидыУведомленийНажатиеПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиУведомленийОрганизацииПоУмолчанию =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	ПараметрыОтбора = Новый Структура("Организация", "Все");
	МассивНастроек = НастройкиУведомленийОрганизаций.НайтиСтроки(ПараметрыОтбора);
	НастройкиУведомленийВсехОрганизаций = ?(МассивНастроек.Количество() = 0,
		Неопределено, МассивНастроек[0]);
	Если НастройкиУведомленийВсехОрганизаций = Неопределено Тогда
		НастройкиУведомленийВсехОрганизаций = НастройкиУведомленийОрганизаций.Добавить();
		НастройкиУведомленийВсехОрганизаций.Организация = "Все";
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
		НастройкиУведомленийВсехОрганизаций,
		Результат,
		НастройкиУведомленийОрганизацииПоУмолчанию);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере_85()
	
	ДокументооборотСКО.УбратьДвоеточияЗаголовков_85(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
