#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление(УсловноеОформление);
	
	ЗаполнитьЗначенияСвойств(Запись, Параметры);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Кандидаты, Параметры.Кандидаты, "Кандидат");
	Если Кандидаты.Количество() = 1 Тогда
		Запись.Кандидат = Кандидаты[0].Кандидат;
	КонецЕсли;
	
	ПодобратьЭтапРаботы();
	УстановитьСпособОценкиХарактеристик();
	ПодобратьДатуВремяНачала();
	
	УстановитьСвойстваЭлементовФормы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ВзаимодействияСписок, "Предмет", Запись.Кандидат);
	
	ПрочитатьНапоминание();
	
	ЗаполнитьШаблонПисьмаПоУмолчанию(ЭтотОбъект, ШаблонПисьмаКандидатам);
	ЗаполнитьШаблонSMSПоУмолчанию(ЭтотОбъект, ШаблонSMSКандидатам);
	
	ОтображатьСобытияВнешнихСистем = СинхронизацияКалендарей.ИспользуютсяВнешниеСистемыУчетаЗанятости();
	
	НастроитьЭлементыПланирования();
	
	ДобавитьТекущегоПользователяВУчастники();

	КопироватьКомментарий = Истина;
	
	ЗаполнитьКонтактыКандидатов();
	
	ИспользуютсяВидеоконференции = Видеоконференции.ИспользуютсяВидеоконференции();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСпискиВыбораВремени();
	ОтобразитьВыбранноеВремя();
	
	Если ИнтервалВремениНапоминания > 0 Тогда
		ИнтервалВремениСтрокой = РаботаСРабочимКалендаремКлиентСервер.ПредставлениеВремени(ИнтервалВремениНапоминания);
	КонецЕсли;
	
	СинхронизироватьКалендариПриОткрытии();
	ПоказатьПредупреждениеПриЭлектронномТестировании();
	ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	ОтобразитьВидеоконференцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Предмет") И Параметр.Предмет = Запись.Кандидат Тогда
		Элементы.ВзаимодействияСписок.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ТерриторииИПомещения" Тогда
		
		Отказ = ВозможноБронирование(Истина);
		
		Если Отказ Тогда
			Помещение = Неопределено;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.ЭтапРаботы) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Этап работы не указан.'"), , , "Запись.ЭтапРаботы", Отказ);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указана дата.'"), , , "Запись.Период", Отказ);
	КонецЕсли;
		
	Если ЗабронироватьПомещение И Не ЗначениеЗаполнено(Помещение) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указано помещение.'"), , , "Помещение", Отказ);
	КонецЕсли;
	
	Если ОтправитьОбратнуюСвязьПоОтклику И Не ЗначениеЗаполнено(ОбратнаяСвязьПоОткликуСообщение) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указано сообщение кандидату.'"), , , "ОбратнаяСвязьПоОткликуСообщение", Отказ);
	КонецЕсли;
	
	ПодборПерсонала.ПроверитьВозможностьУстановкиЭтапаРаботы(
		СоставКандидатовНаСервере(), Запись.ЭтапРаботы, Запись.Период, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Индекс = Участники.Количество() - 1;
	Пока Индекс >= 0 Цикл
		ИндексВыбранного = ВыбранноеЗначение.Найти(Участники[Индекс].Участник);
		Если ИндексВыбранного = Неопределено Тогда
			Участники.Удалить(Индекс);
		Иначе
			ВыбранноеЗначение.Удалить(ИндексВыбранного);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если ВыбранноеЗначение.Количество() > 0 Тогда
		Для Каждого НовыйУчастник Из ВыбранноеЗначение Цикл
			НоваяСтрока = Участники.Добавить();
			НоваяСтрока.Участник = НовыйУчастник;
			НоваяСтрока.СостояниеПриглашения =
				ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.НеОтправлено");
		КонецЦикла;
	КонецЕсли;
	
	Если ОтображатьСобытияВнешнихСистем Тогда
		ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	Иначе
		ИнициализироватьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если ДоступныЭлементыПланирования Тогда
		
		РаботаСРабочимКалендаремКлиентСервер.СкорректироватьДатуНачалаИОкончания(
			Запись.Период, Запись.ПериодОкончание, Ложь,
			НачальноеЗначениеДатаНачала, НачальноеЗначениеДатаОкончания);
		
	КонецЕсли;
	
	ПриИзмененииВремениПроведенияЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяПриИзменении(Элемент)
	
	РаботаСРабочимКалендаремКлиентСервер.СкорректироватьДатуНачалаИОкончания(
		Запись.Период, Запись.ПериодОкончание, Ложь,
		НачальноеЗначениеДатаНачала, НачальноеЗначениеДатаОкончания);
	
	ПриИзмененииВремениПроведенияЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Элемент.СписокВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СформироватьДанныеВыбораВремени(Текст, ДанныеВыбора, Запись.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВремяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Текст = "  :  " Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	СформироватьДанныеВыбораВремени(Текст, ДанныеВыбора, Запись.Период);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяПриИзменении(Элемент)
	
	РаботаСРабочимКалендаремКлиентСервер.СкорректироватьДатуНачалаИОкончания(
		Запись.Период, Запись.ПериодОкончание, Ложь,
		НачальноеЗначениеДатаНачала, НачальноеЗначениеДатаОкончания);
		
	ПриИзмененииВремениПроведенияЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Элемент.СписокВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СформироватьДанныеВыбораВремени(Текст, ДанныеВыбора, Запись.ПериодОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВремяОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если Текст = "  :  " Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	СформироватьДанныеВыбораВремени(Текст, ДанныеВыбора, Запись.ПериодОкончание);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПриИзменении(Элемент)
	УстановитьДоступностьВремениНапоминания(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	СкопироватьКомментарийЭтапа();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалНапоминанияСтрокойПриИзменении(Элемент)
	
	ИнтервалВремениНапоминания = НапоминанияПользователяКлиент.ПолучитьИнтервалВремениИзСтроки(ИнтервалВремениСтрокой);
	Если ИнтервалВремениНапоминания > 0 Тогда
		ИнтервалВремениСтрокой = РаботаСРабочимКалендаремКлиентСервер.ПредставлениеВремени(ИнтервалВремениНапоминания);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Интервал времени не определен'"), , "ИнтервалВремениСтрокой");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмоКандидатамПриИзменении(Элемент)
	УстановитьДоступностьШаблонаПисьмаКандидатам(ЭтаФорма);
	Элементы.КандидатыКандидатАдресЭП.Видимость = НаписатьПисьмоКандидатам;
	Если СпособОценки = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест") Тогда
		Элементы.ИнфоЭлектронноеТестированиеКандидатов.Видимость = НаписатьПисьмоКандидатам;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMSКандидатамПриИзменении(Элемент)
	УстановитьДоступностьШаблонаSMSКандидатам(ЭтаФорма);
	Элементы.КандидатыКандидатТелефон.Видимость = ОтправитьSMSКандидатам;
КонецПроцедуры

&НаКлиенте
Процедура ВзаимодействияСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ВзаимодействияСписок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ТекущиеДанные.Ссылка);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьКандидатовПриИзменении(Элемент)
	
	Если ОтклонитьКандидатов Тогда
		УтвердитьКандидатов = Ложь;
	КонецЕсли;
	
	УстановитьСвойстваПолейРешенияПоКандидатам(ЭтотОбъект);
	НастроитьПараметрыВыбораШаблоновСообщений(ЭтотОбъект);
	ЗаполнитьШаблонПисьмаПоУмолчанию(ЭтотОбъект, ШаблонПисьмаКандидатам);
	ЗаполнитьШаблонSMSПоУмолчанию(ЭтотОбъект, ШаблонSMSКандидатам);
	ОчиститьКомментарийРешения();
	СкопироватьКомментарийЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьКандидатовПриИзменении(Элемент)

	Если УтвердитьКандидатов Тогда
		ОтклонитьКандидатов = Ложь;
	КонецЕсли;
	
	УстановитьСвойстваПолейРешенияПоКандидатам(ЭтотОбъект);
	НастроитьПараметрыВыбораШаблоновСообщений(ЭтотОбъект);
	ЗаполнитьШаблонПисьмаПоУмолчанию(ЭтотОбъект, ШаблонПисьмаКандидатам);
	ЗаполнитьШаблонSMSПоУмолчанию(ЭтотОбъект, ШаблонSMSКандидатам);
	ОчиститьКомментарийРешения();
	СкопироватьКомментарийЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРешенияПриИзменении(Элемент)
	КопироватьКомментарий = КомментарийРешения = Запись.Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПисьмаКандидатамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона(
		"Письмо", 
		ВладелецШаблонов(ЭтотОбъект),
		Элементы.ШаблонПисьмаКандидатам.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ШаблонSMSКандидатамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьВыборШаблона(
		"СообщениеSMS", 
		ВладелецШаблонов(ЭтотОбъект),
		Элементы.ШаблонSMSКандидатам.Имя);
КонецПроцедуры

#Область БронированиеПомещений

&НаКлиенте
Процедура ЗабронироватьПомещениеПриИзменении(Элемент)
	
	Если Не ЗабронироватьПомещение Тогда
		Помещение = Неопределено;
	КонецЕсли;
	
	НастроитьГруппуЗабронироватьПомещение(ЭтотОбъект, Помещение, ЗабронироватьПомещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("КлючНазначенияИспользования", "ВыборПомещенияДляБрони");
	
	ОткрытьФорму("Справочник.ТерриторииИПомещения.Форма.ВыборПомещения", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПланировщика

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если (Конец - Начало) = (РазмерЯчейкиВремени * 60) Тогда
		Длительность = Запись.ПериодОкончание - Запись.Период;
		Запись.Период = Начало;
		Запись.ПериодОкончание = Запись.Период + Длительность;
	Иначе
		Запись.Период = Начало;
		Запись.ПериодОкончание = Конец;
	КонецЕсли;
	
	ПриИзмененииВремениПроведенияЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикВыбор(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	
	ОтменаРедактирования = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПриСменеТекущегоПериодаОтображения(Элемент, ТекущиеПериодыОтображения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланировщикПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВидеоконференцияПриИзменении(Элемент)
	
	Если Видеоконференция Тогда
		НастроенныеУчетныеЗаписи = ВидеоконференцииКлиент.НастроенныеУчетныеЗаписи();
		
		Если НастроенныеУчетныеЗаписи.Количество() = 1 Тогда
			Запись.УчетнаяЗаписьВидеоконференции = НастроенныеУчетныеЗаписи[0]; 
			Элементы.ЗаписьУчетнаяЗаписьВидеоконференции.СписокВыбора.ЗагрузитьЗначения(НастроенныеУчетныеЗаписи);
		ИначеЕсли НастроенныеУчетныеЗаписи.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Нет настроенных учетных записей видеоконференций. Обратитесь к администратору.'"));
		Иначе
			Элементы.ЗаписьУчетнаяЗаписьВидеоконференции.СписокВыбора.ЗагрузитьЗначения(НастроенныеУчетныеЗаписи);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьОтображениеВидеоконференции();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьУчетнаяЗаписьВидеоконференцииПриИзменении(Элемент)
	
	ОбновитьОтображениеВидеоконференции();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьУчетнаяЗаписьВидеоконференцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Запись.УчетнаяЗаписьВидеоконференции <> ВыбранноеЗначение И ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ИзменениеУчетнойЗаписиВидеоконференцииВопрос", 
			ЭтотОбъект, Новый Структура("НоваяУчетнаяЗапись", ВыбранноеЗначение));
			
		ПоказатьВопрос(Оповещение,
			НСтр("ru = 'Запланированная видеоконференция будет отменена и
						|текущие данные этапа будут записаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОбратнуюСвязьПоОткликуПриИзменении(Элемент)
	Элементы.ОбратнаяСвязьПоОткликуСообщение.Доступность = ОтправитьОбратнуюСвязьПоОтклику;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУчастники

&НаКлиенте
Процедура УчастникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		ВыбранноеЗначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	ОбработатьВыборУчастника(ВыбранноеЗначение);
	
	Если ОтображатьСобытияВнешнихСистем Тогда
		ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	Иначе
		ИнициализироватьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчастникиПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент = Элементы.УчастникиУчастник
		И Не Элемент.ТекущиеДанные = Неопределено Тогда
		
		Элемент.ТекущиеДанные.СостояниеПриглашения =
			ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.НеОтправлено");
			
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.УчастникиОбязательный Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьСобытияВнешнихСистем Тогда
		ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	Иначе
		ИнициализироватьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если ДоступныЭлементыПланирования И Участники.Количество() = 0 Тогда
		ТекстВопроса = НСтр("ru = 'Не указаны участники этапа, не будет отражена занятость. Продолжить?'");
		ОбработчикОповещения = Новый ОписаниеОповещения("ПроверитьЗаполнениеПослеВопросаПодтверждения", ЭтотОбъект);
		
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ПроверитьЗаполнениеПослеВопросаПодтверждения(КодВозвратаДиалога.ОК)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура НаписатьПисьмо(Команда)
	
	Если Не ИспользоватьШаблоныСообщений Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет("Документ.ЭлектронноеПисьмоИсходящее.ФормаОбъекта", Запись.Кандидат, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	НачатьФормированиеСообщенияПоШаблону("Письмо");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьSMS(Команда)
	
	Если Не ИспользоватьШаблоныСообщений Тогда
		ВзаимодействияКлиент.СоздатьВзаимодействиеИлиПредмет("Документ.СообщениеSMS.ФормаОбъекта", Запись.Кандидат, ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	НачатьФормированиеСообщенияПоШаблону("СообщениеSMS");
	
КонецПроцедуры

#Область РабочийКалендарь

&НаКлиенте
Процедура ПодобратьВремя(Команда)
	
	ПодобратьВремяКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область УчастникиЭтапаРаботы

&НаКлиенте
Процедура ЗаполнитьУчастников(Команда)
	
	ЗаполнитьУчастниковНаСервере(СоставКандидатов());
	
	Если ОтображатьСобытияВнешнихСистем Тогда
		ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	Иначе
		ИнициализироватьПланировщик();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьУчастников(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РасширенныйПодбор", Истина);
	ПараметрыФормы.Вставить("ПараметрыРасширеннойФормыПодбора", ПараметрыРасширеннойФормыПодбора());
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступностьУчастников(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.Период) Или Не ЗначениеЗаполнено(Запись.ПериодОкончание) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указана дата этапа.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения,
			,
			"Запись.Период");
		Возврат;
		
	КонецЕсли;
	
	Если Не УчастникиОпределены() Тогда
		Возврат;
	КонецЕсли;
	
	СоставУчастников = СоставУчастников();
	ИсключенияЗанятости = ИсключенияЗанятости();
	
	УчастникиДоступны = РаботаСРабочимКалендаремКлиент.ПроверитьДоступностьПользователей(
		СоставУчастников,
		Запись.Период,
		Запись.ПериодОкончание,
		Истина,
		ИсключенияЗанятости,
		Ложь,
		Неопределено,
		АдресТаблицыЗанятостиИзВнешнихСистем);
	
	Если УчастникиДоступны Тогда
		ТекстПредупреждения = НСтр("ru = 'Все участники доступны.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьДоступностьУчастниковЗавершение", ЭтотОбъект);
	РаботаСРабочимКалендаремКлиент.ОткрытьФормуЗанятостиПользователей(
		ОписаниеОповещения, СоставУчастников, Запись.Период, Запись.ПериодОкончание, ИсключенияЗанятости);
	
КонецПроцедуры

#КонецОбласти

#Область Видеоконференции

&НаКлиенте
Процедура ЗапланироватьВидеоконференцию(Команда)

	Если Не ЗначениеЗаполнено(Запись.УчетнаяЗаписьВидеоконференции) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Выберите учетную запись.'"), , "ЗаписьУчетнаяЗаписьВидеоконференции");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗапланироватьВидеоконференциюВопрос", ЭтотОбъект), 
			НСтр("ru = 'Текущие данные этапа будут записаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВидеоконференцию(Команда)

	Если ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтменитьВидеоконференциюВопрос", ЭтотОбъект),
			НСтр("ru = 'Видеоконференция будет отменена и
						|текущие данные этапа будут записаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСсылкуНаВидеоконференцию(Команда)
	
#Если Не ВебКлиент И Не МобильныйКлиент Тогда
	
	Попытка
		ОбъектЗапись = Новый COMОбъект("htmlfile");
		ОбъектЗапись.ParentWindow.ClipboardData.Setdata("Text", СсылкаНаВидеоконференцию);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Ссылка скопирована'"));
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Возникла ошибка при копировании в буфер обмена.
				|Скопируйте ссылку самостоятельно.'"));
		Элементы.СсылкаНаВидеоконференцию.Вид = ВидПоляФормы.ПолеВвода;
	КонецПопытки;
#Иначе
	Элементы.СсылкаНаВидеоконференцию.Видимость = Истина;
	Элементы.СкопироватьСсылкуВидеоконференции.Видимость = Ложь;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура НачатьВидеоконференцию(Команда)
	
	ВидеособеседованияКлиент.НачатьВидеособеседование(ПараметрыВидеособеседования());
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВВидеоконференцию(Команда)
	
	ВидеособеседованияКлиент.ПерейтиВВидеоконференцию(ПараметрыВидеособеседования());
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция РезультатВыбора()
	
	Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
	Результат.Кандидаты = Новый ФиксированныйМассив(СоставКандидатов());
	
	Результат.ЭтапРаботы.Этап = Запись.ЭтапРаботы;
	Результат.ЭтапРаботы.Состояние = Запись.СостояниеЭтапа;
	Результат.ЭтапРаботы.Комментарий = Запись.Комментарий;
	Результат.ЭтапРаботы.Период = Запись.Период;
	Результат.ЭтапРаботы.ШаблонАнкеты = Запись.ШаблонАнкеты;
	Результат.ЭтапРаботы.Организатор = ПользователиКлиент.ТекущийПользователь();
	Результат.Напоминание.Напоминать = Напомнить;
	Результат.Напоминание.Период = Запись.Период;
	Результат.Напоминание.ИнтервалВремени = ИнтервалВремениНапоминания;
	
	Если Не ОтклонитьКандидатов И Не УтвердитьКандидатов Тогда
		Если Не СпособОценки = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест") Тогда
			Результат.Письмо.Написать = НаписатьПисьмоКандидатам;
		КонецЕсли;
		Результат.Письмо.Шаблон = ШаблонПисьмаКандидатам;
		Результат.СообщениеSMS.Написать = ОтправитьSMSКандидатам;
		Результат.СообщениеSMS.Шаблон = ШаблонSMSКандидатам;
	КонецЕсли;
	
	Если ДоступныЭлементыПланирования Тогда
		Результат.Участники = СоставУчастников();
		Результат.ОбязательныеУчастники = СоставУчастников(Истина);
		Результат.ЭтапРаботы.ПериодОкончание = Запись.ПериодОкончание;
	КонецЕсли;
	
	Если ДоступноБронированиеПомещения Тогда
		Результат.ЭтапРаботы.Помещение = Помещение;
	КонецЕсли;
	
	Если ОтклонитьКандидатов Или УтвердитьКандидатов Тогда
		Результат.Решение.Кандидаты = Результат.Кандидаты;
		Результат.Решение.ПисьмоОтказ.Написать = НаписатьПисьмоКандидатам;
		Результат.Решение.ПисьмоОтказ.Шаблон = ШаблонПисьмаКандидатам;
		Результат.Решение.СообщениеSMSОтказ.Написать = ОтправитьSMSКандидатам;
		Результат.Решение.СообщениеSMSОтказ.Шаблон = ШаблонSMSКандидатам;
		Результат.Решение.Решение.ДатаРешения = Запись.Период;
		Результат.Решение.Решение.Комментарий = КомментарийРешения;
		Результат.Решение.ГруппаДоступа = ГруппаДоступа;
		Если ОтклонитьКандидатов Тогда
			Результат.Решение.Решение.Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Отклонено");
			Результат.Решение.Решение.Причина = ПричинаОтклонения;
		Иначе
			Результат.Решение.Решение.Решение = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано");
		КонецЕсли;
	КонецЕсли;
	
	Если Видеоконференция Тогда
		Результат.ЭтапРаботы.УчетнаяЗаписьВидеоконференции = Запись.УчетнаяЗаписьВидеоконференции;
		Результат.ЭтапРаботы.ИдентификаторВидеоконференции = Запись.ИдентификаторВидеоконференции;
		Результат.ЭтапРаботы.СсылкаНаВидеоконференцию = СсылкаНаВидеоконференцию;
		Результат.ЭтапРаботы.СсылкаНаВидеоконференциюДляКандидата = СсылкаНаВидеоконференциюДляКандидата;
	КонецЕсли;
	
	Если ОтправитьОбратнуюСвязьПоОтклику Тогда
		Результат.ОбратнаяСвязьПоОтклику.Отправить = Истина;
		Результат.ОбратнаяСвязьПоОтклику.Отклонить = ОтклонитьКандидатов;
		Результат.ОбратнаяСвязьПоОтклику.Сообщение = ОбратнаяСвязьПоОткликуСообщение;
	КонецЕсли;
	
	Результат.ГруппаДоступа = ГруппаДоступа;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	ЗаполнитьЗаголовок();
	УстановитьПодсказкуВводаКомментария();
	УстановитьВидимостьНапоминания();
	УстановитьЗаголовокДатыВремени();
	УстановитьВидимостьВзаимодействий();
	УстановитьВидимостьРешенияПоКандидатам();
	УстановитьВидимостьКонтактов();
	
	УстановитьДоступностьВремениНапоминания(ЭтотОбъект);
	
	Если Кандидаты.Количество() > 1 Тогда
		Элементы.КандидатыГруппа.Видимость = Истина;
		Элементы.ОбратнаяСвязьПоОткликуГруппа.Видимость = Ложь;
	Иначе
		Элементы.КандидатыГруппа.Видимость = Ложь;
		Элементы.ОбратнаяСвязьПоОткликуГруппа.Видимость =
			Запись.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
			И РекрутинговыеСайты.ДоступнаОтправкаОбратнойСвязиПоОтклику(Кандидаты[0].Кандидат);
	КонецЕсли;
	
	Если СпособОценки = Перечисления.СпособыОценкиХарактеристик.ЭлектронныйТест Тогда
		Элементы.РегистрацияУчастниковГруппа.Видимость = Ложь;
		Если Кандидаты.Количество() = 1 Тогда
			Элементы.ИнфоЭлектронноеТестированиеКандидата.Видимость = Истина;
		Иначе
			Элементы.ИнфоЭлектронноеТестированиеКандидатов.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьПараметрыВыбораШаблоновСообщений(ЭтотОбъект);
	УстановитьВидимостьНаписатьПоШаблонам();
	УстановитьДоступностьШаблонаПисьмаКандидатам(ЭтотОбъект);
	УстановитьДоступностьШаблонаSMSКандидатам(ЭтотОбъект);
	
	ИспользоватьШаблоныСообщений = ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений");
	
	КлючСохраненияПоложенияОкна = Строка(Запись.СостояниеЭтапа);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуВводаКомментария()
	
	ТекстПодсказки = "";
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		ТекстПодсказки = НСтр("ru = 'На что обратить внимание?'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
		ТекстПодсказки = НСтр("ru = 'Каким был результат?'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
		ТекстПодсказки = НСтр("ru = 'Почему этап был пропущен?'");
	КонецЕсли;
	
	Элементы.Комментарий.ПодсказкаВвода = ТекстПодсказки;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВзаимодействий()
	
	Если Не ПравоДоступа("Чтение", Метаданные.ЖурналыДокументов.Взаимодействия) Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПрочиеВзаимодействия") Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Кандидаты.Количество() = 1 Тогда
		Элементы.ВзаимодействияГруппа.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.ВзаимодействияГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНапоминания()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя") Тогда
		Элементы.НапомнитьГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЭтоПланированиеЭтапа(Запись) Тогда
		Элементы.НапомнитьГруппа.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.НапомнитьГруппа.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНаписатьПоШаблонам()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШаблоныСообщений") Тогда
		Элементы.СообщитьКандидатамГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.СообщитьКандидатамГруппа.Видимость = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРешенияПоКандидатам()
	
	Если ЭтоПланированиеЭтапа(Запись) Тогда
		Элементы.РешениеПоКандидатамГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Запись.ЭтапРаботы = Перечисления.ЭтапыРаботыСКандидатами.РассмотрениеОтклика
		И Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
		Элементы.РешениеПоКандидатамГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.РешениеПоКандидатамГруппа.Видимость = Истина;
	Элементы.УтвердитьГруппа.Видимость = СледующийЭтапЭтоУтверждение(СоставКандидатовНаСервере(), Запись.ЭтапРаботы);
	
	Элементы.ОтклонитьКандидатов.Заголовок = НСтр("ru = 'Отклонить кандидатов'");
	Элементы.УтвердитьКандидатов.Заголовок = НСтр("ru = 'Утвердить кандидатов'");
	Если Кандидаты.Количество() = 1 Тогда
		ВинительныйПадеж = ПодборПерсонала.СклонениеКандидата(Запись.Кандидат, 4);
		Элементы.ОтклонитьКандидатов.Заголовок = СтрШаблон(НСтр("ru = 'Отклонить %1'"), ВинительныйПадеж);
		Элементы.УтвердитьКандидатов.Заголовок = СтрШаблон(НСтр("ru = 'Утвердить, одобрить %1'"), ВинительныйПадеж);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПричинаОтклонения) Тогда
		ПричинаОтклонения = ПодборПерсонала.ПричинаОтклоненияКандидатаПоУмолчанию();
	КонецЕсли;
	
	УстановитьСвойстваПолейРешенияПоКандидатам(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СледующийЭтапЭтоУтверждение(Кандидаты, ЭтапРаботы)
	
	СледующиеЭтапы = ПодборПерсонала.СледующиеЭтапыРаботыСКандидатами(Кандидаты, ЭтапРаботы);
	Этапы = ОбщегоНазначения.ВыгрузитьКолонку(СледующиеЭтапы, "Значение", Истина);
	
	Возврат Этапы.Количество() = 1 И Этапы[0] = Перечисления.ЭтапыРаботыСКандидатами.Утверждение;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваПолейРешенияПоКандидатам(Форма)
	
	Элементы = Форма.Элементы;
	Элементы.ПричинаОтклонения.Доступность = Форма.ОтклонитьКандидатов;
	Элементы.КомментарийРешения.Доступность = Форма.ОтклонитьКандидатов Или Форма.УтвердитьКандидатов;
	Элементы.ГруппаДоступаГруппа.Доступность = Форма.УтвердитьКандидатов;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокДатыВремени()
	
	ЗаголовокДатыВремени = "";
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		ЗаголовокДатыВремени = НСтр("ru = 'Этап запланирован на'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
		ЗаголовокДатыВремени = НСтр("ru = 'Этап пройден'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
		ЗаголовокДатыВремени = НСтр("ru = 'Этап пропущен'");
	КонецЕсли;
	
	Элементы.ДатаНачала.Заголовок = ЗаголовокДатыВремени;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьВремениНапоминания(Форма)
	Форма.Элементы.ИнтервалНапоминанияСтрокой.Доступность = Форма.Напомнить;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовок()
	
	ШаблонТекста = "";
	ПараметрыШаблона = Новый Структура(
		"ЭтапРаботы,
		|КандидатВТворительномПадеже");
	ПараметрыШаблона.ЭтапРаботы = Строка(Запись.ЭтапРаботы); 
	
	Если Кандидаты.Количество() > 1 Тогда
		Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
			ШаблонТекста = НСтр("ru = 'Планируется [ЭтапРаботы]'");
		КонецЕсли;
		Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
			ШаблонТекста = НСтр("ru = 'Завершается [ЭтапРаботы]'");
		КонецЕсли;
		Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
			ШаблонТекста = НСтр("ru = 'Пропускается [ЭтапРаботы]'");
		КонецЕсли;
		Заголовок = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, ПараметрыШаблона);
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.СсылкаСуществует(Запись.Кандидат) Тогда
		Автозаголовок = Истина;
		Возврат;
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		ШаблонТекста = НСтр("ru = 'Планируется [ЭтапРаботы] с [КандидатВТворительномПадеже]'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пройден Тогда
		ШаблонТекста = НСтр("ru = 'Завершается [ЭтапРаботы] с [КандидатВТворительномПадеже]'");
	КонецЕсли;
	
	Если Запись.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Пропущен Тогда
		ШаблонТекста = НСтр("ru = 'Пропускается [ЭтапРаботы] [КандидатВТворительномПадеже]'");
	КонецЕсли;
	
	ПараметрыШаблона.КандидатВТворительномПадеже = ПодборПерсонала.СклонениеКандидата(Запись.Кандидат, 5);
	
	Заголовок = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, ПараметрыШаблона);
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьЭтапРаботы()
	
	Если ЗначениеЗаполнено(Запись.ЭтапРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ЭтапРаботы = ПодборПерсонала.ТекущийЭтапРаботыКандидатов(СоставКандидатовНаСервере());
	ОбщегоНазначенияКлиентСервер.Проверить(Не Перечисления.ЭтапыРаботыСКандидатами.ЭтоПредопределенный(Запись.ЭтапРаботы),
		СтрШаблон(НСтр("ru = 'Для этапа «%1» завершение не поддерживается.'"), Запись.ЭтапРаботы));
	
КонецПроцедуры

&НаСервере
Функция ТекущаяДатаЭтапа()
	
	// Если для всех кандидатов установлена одинаковая дата этапа, то подставляем именно ее.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", СоставКандидатовНаСервере());
	Запрос.УстановитьПараметр("ЭтапРаботы", Запись.ЭтапРаботы);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РаботаСКандидатами.Период КАК Период
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|ГДЕ
		|	РаботаСКандидатами.Кандидат В(&Кандидаты)
		|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|			ГДЕ
		|				РаботаСКандидатами.Кандидат В (&Кандидаты)
		|				И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы
		|			ИМЕЮЩИЕ
		|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РаботаСКандидатами.Период) = 1)";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Период;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеПослеВопросаПодтверждения(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ИзменилсяОрганизатор = 
		ЗначениеЗаполнено(Запись.Организатор) И Запись.Организатор <> ПользователиКлиент.ТекущийПользователь();
	ДополнительныеПараметры = Новый Структура("ИзменилсяОрганизатор", ИзменилсяОрганизатор);
	
	Если ИзменилсяОрганизатор И (ОтображатьСобытияВнешнихСистем ИЛИ ЗначениеЗаполнено(Запись.Бронь)) Тогда
		ТекстВопроса = НСтр("ru = 'Изменился организатор этапа. 
							|Прежние данные этапа будут удалены, и созданы новые. Продолжить?'");
		
		ОбработчикОповещения = 
			Новый ОписаниеОповещения(
				"ПроверитьЗаполнениеПослеВопросаИзмененияОрганизатора", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ПроверитьЗаполнениеПослеВопросаИзмененияОрганизатора(КодВозвратаДиалога.ОК, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОКЗавершение()
	
	Если Открыта() Тогда
		Если СпособОценки = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест")
			И НаписатьПисьмоКандидатам
			И Кандидаты.Количество() > 1 Тогда
			ДлительнаяОперация = ДлительнаяОперацияСозданиеВнешнихПользователей(УникальныйИдентификатор, Истина, ШаблонПисьмаКандидатам);
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗакрыватьФорму", Истина);
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатСозданияВнешнихПользователей", ЭтотОбъект, ДополнительныеПараметры);
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		Иначе
			Результат = РезультатВыбора();
			Закрыть(Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПослеВопросаИзмененияОрганизатора(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ИзменилсяОрганизатор = ДополнительныеПараметры.ИзменилсяОрганизатор;
	
	Если ЗначениеЗаполнено(Запись.Бронь) И ИзменилсяОрганизатор Тогда
		ОбработатьИзменениеОрганизатораДляПомещения();
	КонецЕсли; 
	
	Отказ = Ложь;
	ПроверитьВозможностьБронирования(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображатьСобытияВнешнихСистем И ИзменилсяОрганизатор Тогда
		ОбработатьИзменениеОрганизатораДляСинхронизации();
	КонецЕсли;
	
	ОбработатьВидеоконференциюПередЗакрытием();
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияСозданиеВнешнихПользователей(УникальныйИдентификатор, ОтправлятьПриглашение, ШаблонСообщения = Неопределено)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ЭлектронноеТестированиеКандидатов.СоздатьВнешнихПользователейИОтправитьПриглашение",
		Кандидаты.Выгрузить().ВыгрузитьКолонку("Кандидат"), ОтправлятьПриглашение, ШаблонСообщения);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатСозданияВнешнихПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ЗакрыватьФорму") Тогда
		Результат = РезультатВыбора();
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПланированиеЭтапа(Запись)
	
	Возврат Запись.СостояниеЭтапа = ПредопределенноеЗначение("Перечисление.СостоянияЭтаповРаботыСКандидатами.Запланирован");
	
КонецФункции

&НаСервере
Процедура НастроитьЭлементыПланирования()
	
	ДоступныЭлементыПланирования = ЭтоПланированиеЭтапа(Запись);
	ДоступноБронированиеПомещения = ДоступныЭлементыПланирования 
		И ПолучитьФункциональнуюОпцию("ИспользоватьБронированиеПомещений");
		
	Элементы.Участники.Шапка = ОтображатьСобытияВнешнихСистем;
	Элементы.УчастникиОбязательный.Видимость = ОтображатьСобытияВнешнихСистем;
	Элементы.УчастникиСостояниеПриглашения.Видимость = ОтображатьСобытияВнешнихСистем;
	
	ПрочитатьУчастников();
	
	Если ДоступныЭлементыПланирования Тогда
		ПрочитатьПлановыеДанныеЭтапа();
	КонецЕсли;
	
	Если Не ДоступныЭлементыПланирования Тогда
		
		Элементы.ДатаВремяОкончанияГруппа.Видимость = Ложь;
		Элементы.РегистрацияУчастниковГруппа.Видимость = Ложь;
		Элементы.ПланировщикГруппа.Видимость = Ложь;
		
		ВремяНачалаОтображения = НачалоДня(Запись.Период);
		ВремяОкончанияОтображения = КонецДня(Запись.Период);
		
	Иначе
		
		ПодобратьДатуВремяОкончания();
		
		НачальноеЗначениеДатаНачала = Запись.Период;
		НачальноеЗначениеДатаОкончания = Запись.ПериодОкончание;
		ОтображаемаяДата = НачалоДня(Запись.Период);
		
		ФонВыбранногоВремени = ЦветаСтиля.ФонВыбранногоВремени;
		
		ОтображатьВремяС  = РаботаСРабочимКалендарем.ПолучитьПерсональнуюНастройку("ОтображатьВремяС");
		ОтображатьВремяПо = РаботаСРабочимКалендарем.ПолучитьПерсональнуюНастройку("ОтображатьВремяПо");
		
		ВремяНачалаОтображения 		= Дата(1,1,1) + ОтображатьВремяС * 3600;
		ВремяОкончанияОтображения 	= Дата(1,1,1) + (24 - ОтображатьВремяПо) * 3600;
		
		РазмерЯчейкиВремени = 15;
		ДлительностьПоУмолчанию = 3600;
		
		ИнициализироватьПланировщик();
		
	КонецЕсли;
	
	Элементы.ЗабронироватьПомещениеГруппа.Видимость = ДоступноБронированиеПомещения;
	
	НастроитьГруппуЗабронироватьПомещение(ЭтотОбъект, Помещение, ЗабронироватьПомещение);
	НастроитьГруппуНапомнить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКомментарийРешения()

	Если Не ОтклонитьКандидатов И Не УтвердитьКандидатов Тогда
		КомментарийРешения = Неопределено;
		КопироватьКомментарий = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьКомментарийЭтапа()
	
	Если Не ОтклонитьКандидатов И Не УтвердитьКандидатов Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(КомментарийРешения) Тогда
		КомментарийРешения = Запись.Комментарий;
		КопироватьКомментарий = Истина;
		Возврат;
	КонецЕсли;

	Если КопироватьКомментарий Тогда
		КомментарийРешения = Запись.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКонтактов()
	Элементы.КандидатыКандидатАдресЭП.Видимость = НаписатьПисьмоКандидатам;
	Элементы.КандидатыКандидатТелефон.Видимость = ОтправитьSMSКандидатам;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактыКандидатов()
	
	Если Кандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ФизическиеЛицаКандидатов = Справочники.Кандидаты.ФизическиеЛицаКандидатов(
		Кандидаты.Выгрузить(, "Кандидат").ВыгрузитьКолонку("Кандидат"));
	ФизическиеЛица = ОбщегоНазначения.ВыгрузитьКолонку(
		ФизическиеЛицаКандидатов,
		"Значение", Истина);
	ДанныеФизическихЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(
		Истина,
		ФизическиеЛица,
		"ТелефонМобильныйПредставление, EMailПредставление");
		
	Если ДанныеФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Кандидаты Цикл
		ОтборСтрок = Новый Структура("ФизическоеЛицо", ФизическиеЛицаКандидатов.Получить(Строка.Кандидат));
		НайденныеСтроки = ДанныеФизическихЛиц.НайтиСтроки(ОтборСтрок);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Строка.КандидатТелефон = НайденныеСтроки[0].ТелефонМобильныйПредставление;
		Строка.КандидатАдресЭП = НайденныеСтроки[0].EMailПредставление;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСпособОценкиХарактеристик()

	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов") Тогда
		УстановитьЭлектронныйТест();
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Тогда
		УстановитьШаблонАнкеты();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеПриЭлектронномТестировании()
	
	Если СпособОценки = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест")
		И Не ОбщийКаталогНастроен Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Если тестирование планируется проводить в веб-клиенте,
			|требуется настроить общий каталог электронных курсов в панели «Управление персоналом» раздела «Настройки»
			|Обратитесь к администратору.'"));
	КонецЕсли;
	
КонецПроцедуры

#Область Напоминания

&НаСервере
Процедура ПрочитатьНапоминание()
	
	ИнтервалНапоминания = НапоминаниеНаСервере(Запись.Кандидат, Запись.Период);
	Если ИнтервалНапоминания = Неопределено Тогда
		Напомнить = Ложь;
		ИнтервалВремениНапоминания = 900;
		Возврат;
	КонецЕсли;
	
	Напомнить = Истина;
	ИнтервалВремениНапоминания = ИнтервалНапоминания;
	УстановитьДоступностьВремениНапоминания(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НапоминаниеНаСервере(Кандидат, ВремяСобытия)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("ВремяСобытия", ВремяСобытия);
	Запрос.УстановитьПараметр("Источник", Кандидат);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НапоминанияПользователя.ИнтервалВремениНапоминания
		|ИЗ
		|	РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
		|ГДЕ
		|	НапоминанияПользователя.Пользователь = &Пользователь
		|	И НапоминанияПользователя.ВремяСобытия = &ВремяСобытия
		|	И НапоминанияПользователя.Источник = &Источник";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИнтервалВремениНапоминания;
	КонецЕсли;
	
	// Напоминание на это время не было установлено.
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ШаблоныСообщений

&НаКлиенте
Процедура НачатьФормированиеСообщенияПоШаблону(ВидСообщения)
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЭтапРаботы", Запись.ЭтапРаботы);
	ДополнительныеПараметры.Вставить("ДатаВремя", Запись.Период);
	
	Если ИспользуютсяВидеоконференции Тогда
		ВидеособеседованияКлиент.ДополнитьШаблонСообщения(ДополнительныеПараметры,
			Запись.УчетнаяЗаписьВидеоконференции, СсылкаНаВидеоконференцию, СсылкаНаВидеоконференциюДляКандидата);
	КонецЕсли;
	
	ШаблоныСообщенийКлиент.СформироватьСообщение(
		Запись.Кандидат, 
		ВидСообщения, 
		Неопределено, 
		ВладелецШаблонов(ЭтотОбъект),
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаПисьмаКандидатам(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонПисьмаКандидатам.Доступность = Форма.НаписатьПисьмоКандидатам;
	Элементы.ШаблонПисьмаКандидатам.АвтоОтметкаНезаполненного = Форма.НаписатьПисьмоКандидатам;
	Элементы.ШаблонПисьмаКандидатам.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонПисьмаКандидатам);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьШаблонаSMSКандидатам(Форма)
	
	Элементы = Форма.Элементы;
	
	Элементы.ШаблонSMSКандидатам.Доступность = Форма.ОтправитьSMSКандидатам;
	Элементы.ШаблонSMSКандидатам.АвтоОтметкаНезаполненного = Форма.ОтправитьSMSКандидатам;
	Элементы.ШаблонSMSКандидатам.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Форма.ШаблонSMSКандидатам);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ШаблоныСообщенийКандидатов(Отбор)

	Шаблоны = ПодборПерсонала.ШаблоныСообщенийКандидатов(Отбор);
	Если Шаблоны.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Шаблоны[0].Ссылка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьШаблонПисьмаПоУмолчанию(Форма, Шаблон)
	
	Отбор = Новый Структура("ВладелецШаблона, ПредназначенДляЭлектронныхПисем");
	Отбор.ВладелецШаблона = ВладелецШаблонов(Форма);
	Отбор.ПредназначенДляЭлектронныхПисем = Истина;
	
	Шаблон = ШаблоныСообщенийКандидатов(Отбор);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьШаблонSMSПоУмолчанию(Форма, Шаблон)
	
	Отбор = Новый Структура("ВладелецШаблона, ПредназначенДляSMS");
	Отбор.ВладелецШаблона = ВладелецШаблонов(Форма);
	Отбор.ПредназначенДляSMS = Истина;
	
	Шаблон = ШаблоныСообщенийКандидатов(Отбор);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПараметрыВыбораШаблоновСообщений(Форма)
	
	ПредметКандидаты = Новый ПараметрВыбора("Отбор.ПолноеИмяТипаПараметраВводаНаОсновании", "Справочник.Кандидаты");
	Владелец = Новый ПараметрВыбора("Отбор.ВладелецШаблона", ВладелецШаблонов(Форма));

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(Владелец);
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПредназначенДляЭлектронныхПисем", Истина));
	Форма.Элементы.ШаблонПисьмаКандидатам.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(ПредметКандидаты);
	ПараметрыВыбора.Добавить(Владелец);
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПредназначенДляЭлектронныхПисем", Ложь));
	Форма.Элементы.ШаблонSMSКандидатам.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
		
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборШаблона(ВидСообщения, ВладелецШаблона, ИмяШаблона)
	
	ПараметрыВыбора = Новый Структура("ИмяШаблона");
	ПараметрыВыбора.ИмяШаблона = ИмяШаблона;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьВыборШаблона", ЭтотОбъект, ПараметрыВыбора);
	
	ШаблоныСообщенийКлиент.ВыбратьШаблон(
		ОписаниеОповещения, 
		ВидСообщения, 
		"Справочник.Кандидаты", 
		ВладелецШаблона);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборШаблона(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЭтотОбъект[ДополнительныеПараметры.ИмяШаблона] = Результат;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВладелецШаблонов(Форма)
	
	Если Форма.СпособОценки = ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест") Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ПриглашениеНаЭлектронноеТестирование");
	КонецЕсли;
	
	Если Форма.ОтклонитьКандидатов Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОтклонениеКандидата");
	КонецЕсли;

	Если Форма.УтвердитьКандидатов Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ОдобрениеКандидата");
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.ИспользованиеШаблоновСообщенийПриПодбореПерсонала.ИзменениеЭтапаРаботыСКандидатом");
			
КонецФункции

#КонецОбласти

#Область ВыборДатыВремени

&НаСервере
Процедура ПодобратьДатуВремяНачала()
	
	Если ЗначениеЗаполнено(Запись.Период) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДатаЭтапа = ТекущаяДатаЭтапа();
	Если ЗначениеЗаполнено(ТекущаяДатаЭтапа) Тогда
		Запись.Период = ТекущаяДатаЭтапа;
		Возврат;
	КонецЕсли;
	
	Запись.Период = НачалоЧаса(ТекущаяДатаСеанса() + 3600);
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьДатуВремяОкончания()
	
	Если ЗначениеЗаполнено(Запись.ПериодОкончание) Тогда
		Возврат;
	КонецЕсли;
	
	Запись.ПериодОкончание = Запись.Период + 3600;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииВремениПроведенияЭтапа()
	
	Если ДоступныЭлементыПланирования Тогда
		
		Если Запись.Период < ОтображаемаяДата ИЛИ Запись.Период > КонецДня(ОтображаемаяДата) Тогда
			ОтображаемаяДата = НачалоДня(Запись.Период);
			Если ОтображатьСобытияВнешнихСистем Тогда
				ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
			Иначе
				ИнициализироватьПланировщик();
			КонецЕсли;
		КонецЕсли;
		
		ОтобразитьВыбранноеВремя();
		
	КонецЕсли;
	
	ЗаполнитьСпискиВыбораВремени();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискиВыбораВремени()
	
	ЗаполнитьСписокВыбораДатаНачалаВремя();
	
	Если ДоступныЭлементыПланирования Тогда
		ЗаполнитьСписокВыбораДатаОкончанияВремя();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораДатаНачалаВремя()
	
	Элементы.ДатаНачалаВремя.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Запись.Период) Тогда 
		ТекДата = НачалоДня(Запись.Период);
	Иначе
		ТекДата = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса());
	КонецЕсли;
	
	ВремяНачалаЗаполнения = НачалоДня(ТекДата) + (ВремяНачалаОтображения - НачалоДня(ВремяНачалаОтображения));
	ВремяОкончанияЗаполнения = НачалоДня(ТекДата) + (ВремяОкончанияОтображения - НачалоДня(ВремяНачалаОтображения));
	
	Для Инд = 1 По 48 Цикл
		
		Если ТекДата >= ВремяНачалаЗаполнения И ТекДата < ВремяОкончанияЗаполнения Тогда
			
			Элементы.ДатаНачалаВремя.СписокВыбора.Добавить(ТекДата, Формат(ТекДата, "ДФ=ЧЧ:мм"));
			Если Запись.Период > ТекДата И Запись.Период < ТекДата + 1800 Тогда
				Элементы.ДатаНачалаВремя.СписокВыбора.Добавить(Запись.Период, Формат(Запись.Период, "ДФ=ЧЧ:мм"));
			КонецЕсли;
			
		КонецЕсли;
		
		ТекДата = ТекДата + 1800;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВыбораДатаОкончанияВремя()
	
	Элементы.ДатаОкончанияВремя.СписокВыбора.Очистить();
	
	ТекДата = РаботаСРабочимКалендаремКлиентСервер.КонецПолучаса(Запись.Период);
	Если Запись.ПериодОкончание > ТекДата - 1800 И Запись.ПериодОкончание < ТекДата Тогда
		Элементы.ДатаОкончанияВремя.СписокВыбора.Добавить(Запись.ПериодОкончание, Формат(Запись.ПериодОкончание, "ДФ=ЧЧ:мм"));
	КонецЕсли;
	
	ВремяНачалаЗаполнения = НачалоДня(ТекДата) + (ВремяНачалаОтображения - НачалоДня(ВремяНачалаОтображения));
	ВремяОкончанияЗаполнения = НачалоДня(ТекДата) + (ВремяОкончанияОтображения - НачалоДня(ВремяНачалаОтображения));
	
	Для Инд = 1 По 48 Цикл
		
		Если ТекДата > КонецДня(Запись.Период) Тогда
			Прервать;
		КонецЕсли;
		
		Если ТекДата > ВремяНачалаЗаполнения И ТекДата <= ВремяОкончанияЗаполнения И ТекДата > Запись.Период Тогда
			
			Элементы.ДатаОкончанияВремя.СписокВыбора.Добавить(ТекДата, Формат(ТекДата, "ДФ=ЧЧ:мм"));
			Если Запись.ПериодОкончание > ТекДата И Запись.ПериодОкончание < ТекДата + 1800 Тогда
				Элементы.ДатаОкончанияВремя.СписокВыбора.Добавить(Запись.ПериодОкончание, Формат(Запись.ПериодОкончание, "ДФ=ЧЧ:мм"));
			КонецЕсли;
			
		КонецЕсли;
		
		ТекДата = ТекДата + 1800;
		
	КонецЦикла;
	
	Элементы.ДатаОкончанияВремя.СписокВыбора.Добавить(ТекДата, "00:00");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьВыбранноеВремя()
	
	Если Не ДоступныЭлементыПланирования Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЭлементов = Планировщик.ИнтервалыФона.Количество();
	Для Инд = 1 По КоличествоЭлементов Цикл
		ИнтервалФона = Планировщик.ИнтервалыФона[КоличествоЭлементов - Инд];
		Если ИнтервалФона.Цвет = ФонВыбранногоВремени Тогда
			Планировщик.ИнтервалыФона.Удалить(ИнтервалФона);
		КонецЕсли;
	КонецЦикла;
	
	ИнтервалВыбранноеВремя = Планировщик.ИнтервалыФона.Добавить(Запись.Период, Запись.ПериодОкончание);
	ИнтервалВыбранноеВремя.Цвет = ФонВыбранногоВремени;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеВыбораВремени(ТекстВремя, ДанныеВыбора, Знач Дата = Неопределено, ИспользоватьТекущуюДату = Истина)
	
	// Формирует данные выбора времени для полей ввода времени.
	//
	// Параметры:
	//  ТекстВремя - Строка - Строковое представление времени в формате "ХХ:ХХ", где Х - число или пробел.
	//  ДанныеВыбора - СписокЗначений - Список значений, который будет использоваться при обработке выбора.
	//  СтандартнаяОбработка - Булево - Признак стандартной обработки. Если текст времени не заполнен,
	//                                  то не меняется. В остальных случаях устанавливается в Ложь.
	//  Дата - Дата - Дата, для которой формируются данные подбора. По умолчанию - без даты.
	//
	
	Если Не ЗначениеЗаполнено(ТекстВремя) Тогда
		Возврат;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		Дата = Дата(1,1,1);
	КонецЕсли;
	
	Если ИспользоватьТекущуюДату И Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;
	
	// Определение количества введенных символов времени и введенного времени
	Если Сред(ТекстВремя, 5, 1) <> " " Тогда
		КоличествоСимволовДаты = 4;
	ИначеЕсли Сред(ТекстВремя, 4, 1) <> " " Тогда
		КоличествоСимволовДаты = 3;
	ИначеЕсли Сред(ТекстВремя, 2, 1) <> " " Тогда
		КоличествоСимволовДаты = 2;
	ИначеЕсли Сред(ТекстВремя, 1, 1) <> " " Тогда
		КоличествоСимволовДаты = 1;
	Иначе
		КоличествоСимволовДаты = 0;
	КонецЕсли;
	
	ВведенноеВремя = ПреобразоватьТекстКДате(Дата, ТекстВремя);
	Если ВведенноеВремя = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение данных выбора
	ДанныеВыбора = Новый СписокЗначений;
	
	Если КоличествоСимволовДаты = 0 Тогда
		
		// Введено время 00:00. Включаем в данные выбора 00:00, 01:00, ... , 23:00.
		ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора, 3600, 24);
		
	ИначеЕсли КоличествоСимволовДаты = 1 Тогда
		
		Если Час(ВведенноеВремя) = 20 Тогда
			// Введено время 20:00. Включаем в данные выбора 20:00, 21:00, 22:00, 23:00.
			ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора, 3600, 4);
		Иначе
			// Введено время Х0:00. Включаем в данные выбора Х0:00, Х1:00, ... , Х9:00.
			ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора, 3600, 10);
		КонецЕсли;
		
	ИначеЕсли КоличествоСимволовДаты = 2 Тогда
		
		// Введено время ХХ:00. Включаем в данные выбора ХХ:00, ХХ:10, ... , ХХ:50.
		ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора, 600, 6);
		
	ИначеЕсли КоличествоСимволовДаты = 3 Тогда
		
		// Введено время ХХ:Х0. Включаем в данные выбора ХХ:Х0, ХХ:Х5.
		ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора, 300, 2);
		
	ИначеЕсли КоличествоСимволовДаты = 4 Тогда 
		
		// Введено время ХХ:ХХ. Включаем в данные выбора ХХ:ХХ.
		ДобавитьВДанныеВыбораВремя(ВведенноеВремя, ДанныеВыбора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВДанныеВыбораВремя(Знач Время, ДанныеВыбора, Период = 0, КоличествоПериодов = 1)
	
	Для НомерПериода = 1 По КоличествоПериодов Цикл
		ДанныеВыбора.Добавить(Время, Формат(Время, "ДФ=ЧЧ:мм; ДП=00:00"));
		Время = Время + Период;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьТекстКДате(Дата, Знач ТекстВремя)
	
	// Преобразует переданную к дате и время текстом к дате и времени
	
	ТекстВремя = СтрЗаменить(ТекстВремя, " ", "0");
	ДлинаТекстаВремени = СтрДлина(ТекстВремя);
	
	Если ДлинаТекстаВремени = 0 ИЛИ ДлинаТекстаВремени > 5 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПервыйСимвол = Сред(ТекстВремя, 1, 1);
	ТекстВремя = Сред(ТекстВремя, 2);
	
	ТекстВремяВФормате = Неопределено;
	
	Если КодСимвола(ПервыйСимвол) = КодСимвола("0") ИЛИ КодСимвола(ПервыйСимвол) = КодСимвола("1") Тогда
		
		ТекстВремяВФормате = ПервыйСимвол;
		ОбработатьВторойСимвол(ТекстВремя, ТекстВремяВФормате, Ложь);
		
	ИначеЕсли КодСимвола(ПервыйСимвол) = КодСимвола("2")Тогда
		
		ТекстВремяВФормате = ПервыйСимвол;
		ОбработатьВторойСимвол(ТекстВремя, ТекстВремяВФормате, Истина);
		
	ИначеЕсли КодСимвола(ПервыйСимвол) >= КодСимвола("3") И КодСимвола(ПервыйСимвол) <= КодСимвола("9") Тогда
		
		ТекстВремяВФормате = "0" + ПервыйСимвол;
		ОбработатьТретийСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли КодСимвола(ПервыйСимвол) = КодСимвола(":") Тогда
		
		ТекстВремяВФормате = "00";
		ОбработатьЧетвертыйСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ПервыйСимвол) Тогда
		
		ТекстВремяВФормате = "0000";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВремя) Тогда
		ТекстВремяВФормате = Неопределено;
	КонецЕсли;
	
	Если ТекстВремяВФормате = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстВремяВФормате = "00010101" + ТекстВремяВФормате + "00";
	Время = Дата(ТекстВремяВФормате);
	Результат = НачалоДня(Дата) + Час(Время) * 3600 + Минута(Время) * 60;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВторойСимвол(ТекстВремя, ТекстВремяВФормате, Ограничение)
	
	// Обрабатывает второй символ в текстовом времени. Если недопустимый символ то вернет Неопределено.
	
	ВторойСимвол = Сред(ТекстВремя, 1, 1);
	ТекстВремя = Сред(ТекстВремя, 2);
	
	Если КодСимвола(ВторойСимвол) >= КодСимвола("0") И КодСимвола(ВторойСимвол) <= КодСимвола("9") И НЕ Ограничение Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + ВторойСимвол;
		ОбработатьТретийСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли КодСимвола(ВторойСимвол) >= КодСимвола("0") И КодСимвола(ВторойСимвол) <= КодСимвола("3") И Ограничение Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + ВторойСимвол;
		ОбработатьТретийСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли КодСимвола(ВторойСимвол) = КодСимвола(":") Тогда
		
		ТекстВремяВФормате = "0" + ТекстВремяВФормате;
		ОбработатьЧетвертыйСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ВторойСимвол) Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "000";
		
	Иначе
		
		ТекстВремяВФормате = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТретийСимвол(ТекстВремя, ТекстВремяВФормате)
	
	// Обрабатывает третий символ в текстовом времени. Если недопустимый символ то вернет Неопределено.
	
	ТретийСимвол = Сред(ТекстВремя, 1, 1);
	ТекстВремя = Сред(ТекстВремя, 2);
	
	Если КодСимвола(ТретийСимвол) >= КодСимвола("0") И КодСимвола(ТретийСимвол) <= КодСимвола("5") Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + ТретийСимвол;
		ОбработатьПятыйСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли КодСимвола(ТретийСимвол) >= КодСимвола("6") И КодСимвола(ТретийСимвол) <= КодСимвола("9") Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "0" + ТретийСимвол;
		
	ИначеЕсли КодСимвола(ТретийСимвол) = КодСимвола(":") Тогда
		
		ОбработатьЧетвертыйСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТретийСимвол) Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "00";
		
	Иначе
		
		ТекстВремяВФормате = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЧетвертыйСимвол(ТекстВремя, ТекстВремяВФормате)
	
	// Обрабатывает четвертый символ в текстовом времени. Если недопустимый символ то вернет Неопределено.
	
	ЧетвертыйСимвол = Сред(ТекстВремя, 1, 1);
	ТекстВремя = Сред(ТекстВремя, 2);
	
	Если КодСимвола(ЧетвертыйСимвол) >= КодСимвола("0") И КодСимвола(ЧетвертыйСимвол) <= КодСимвола("5") Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + ЧетвертыйСимвол;
		ОбработатьПятыйСимвол(ТекстВремя, ТекстВремяВФормате);
		
	ИначеЕсли КодСимвола(ЧетвертыйСимвол) >= КодСимвола("6") И КодСимвола(ЧетвертыйСимвол) <= КодСимвола("9") Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "0" + ЧетвертыйСимвол;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ЧетвертыйСимвол) Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "00";
		
	Иначе
		
		ТекстВремяВФормате = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПятыйСимвол(ТекстВремя, ТекстВремяВФормате)
	
	// Обрабатывает пятый символ в текстовом времени. Если недопустимый символ то вернет Неопределено.
	
	ПятыйСимвол = Сред(ТекстВремя, 1, 1);
	ТекстВремя = Сред(ТекстВремя, 2);
	
	Если КодСимвола(ПятыйСимвол) >= КодСимвола("0") И КодСимвола(ПятыйСимвол) <= КодСимвола("9") Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + ПятыйСимвол;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ПятыйСимвол) Тогда
		
		ТекстВремяВФормате = ТекстВремяВФормате + "0";
		
	Иначе
		
		ТекстВремяВФормате = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РабочийКалендарь

&НаСервере
Функция ПолучитьОтображатьВремяПо()
	
	ЧасОкончания = Час(ВремяОкончанияОтображения);
	Если ЧасОкончания = 0 Тогда
		ЧасОкончания = 24;
	КонецЕсли;
	
	Возврат 24 - ЧасОкончания;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьГруппуЗабронироватьПомещение(Форма, Помещение, ЗабронироватьПомещение)
	
	Элементы = Форма.Элементы;
	
	Элементы.Помещение.АвтоОтметкаНезаполненного = ЗабронироватьПомещение;
	Элементы.Помещение.ОтметкаНезаполненного = ЗабронироватьПомещение 
		И Не ЗначениеЗаполнено(Помещение);
	
	Элементы.Помещение.Доступность = ЗабронироватьПомещение;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуНапомнить()
	
	Если Не ДоступныЭлементыПланирования Тогда
		Элементы.Переместить(Элементы.НапомнитьГруппа, Элементы.ДатаВремяГруппа, Элементы.ДатаВремяОкончанияГруппа);
	Иначе
		Элементы.Переместить(Элементы.НапомнитьГруппа, Элементы.ГруппаШапкаПравая, Элементы.ПланировщикГруппа);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПланировщик()
	
	Если Не ЗначениеЗаполнено(Запись.Период) Тогда
		Элементы.Планировщик.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.Планировщик.Доступность = Истина;
	
	НастройкиОтображения = РаботаСРабочимКалендарем.ПолучитьНастройкиОтображения();
	
	НастройкиОтображения.Пользователи.Очистить();
	
	Если Участники.Количество() = 0 Тогда
		НастройкиОтображения.Пользователи.Добавить(Пользователи.ТекущийПользователь());
	Иначе
		Для Каждого СтрокаУчастники Из Участники Цикл
			Если НастройкиОтображения.Пользователи.Найти(СтрокаУчастники.Участник) = Неопределено Тогда
				НастройкиОтображения.Пользователи.Добавить(СтрокаУчастники.Участник);
			КонецЕсли;
			Если СтрокаУчастники.СостояниеПриглашения = Неопределено Тогда
				СтрокаУчастники.СостояниеПриглашения = Перечисления.СостоянияПриглашений.НеОтправлено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НастройкиОтображения.ОтображаемаяДата = ОтображаемаяДата;
	НастройкиОтображения.ВыделенныеДаты.Очистить();
	НастройкиОтображения.ВыделенныеДаты.Добавить(ОтображаемаяДата);
	НастройкиОтображения.ОтображатьЗанятость = Истина;
	НастройкиОтображения.ОтображатьОбщуюЗанятость = Ложь;
	НастройкиОтображения.ОтображатьСобытия = Истина;
	НастройкиОтображения.ОтображатьСкрытыеЭлементы = Ложь;
	НастройкиОтображения.ПериодОтображения = Перечисления.ПериодОтображенияРабочегоКалендаря.День;
	НастройкиОтображения.НастройкаОтображениеВремениЭлементов = ОтображениеВремениЭлементовПланировщика.ВремяНачалаИКонца;
	НастройкиОтображения.РазмерЯчейкиВремени = РазмерЯчейкиВремени;
	НастройкиОтображения.ОтображатьВремяС = Час(ВремяНачалаОтображения);
	НастройкиОтображения.ОтображатьВремяПо = ПолучитьОтображатьВремяПо();
	НастройкиОтображения.ОтображатьСобытияВнешнихСистем = ОтображатьСобытияВнешнихСистем;
	НастройкиОтображения.АдресТаблицыЗанятостиИзВнешнихСистем = АдресТаблицыЗанятостиИзВнешнихСистем;
	
	ПредметыИсключений = СоставКандидатовНаСервере();
	ИсключенияЗанятости = ПолучитьИсключенияЗанятостиНаСервере(ПредметыИсключений);
	Если ЗначениеЗаполнено(ИсключенияЗанятости) Тогда
		НастройкиОтображения.ИсключенияЗанятости = ИсключенияЗанятости;
	КонецЕсли;
	
	РаботаСРабочимКалендарем.ОтобразитьКалендарь(Планировщик, НастройкиОтображения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВремяКлиент()
	
	Если Не УчастникиОпределены() Тогда
		Возврат;
	КонецЕсли;
	
	Мероприятие = Новый ФиксированнаяСтруктура("ДатаНачала, ДатаОкончания", Запись.Период, Запись.ПериодОкончание);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Мероприятие", Мероприятие);
	ПараметрыФормы.Вставить("УчастникиМероприятия", УсловияУчастияВМероприятии());
	ПараметрыФормы.Вставить("ИсключенияЗанятости", Новый ФиксированныйМассив(ИсключенияЗанятости()));
	ПараметрыФормы.Вставить("ОтображатьСобытияВнешнихСистем", ОтображатьСобытияВнешнихСистем);
	ПараметрыФормы.Вставить("АдресТаблицыЗанятостиИзВнешнихСистем", АдресТаблицыЗанятостиИзВнешнихСистем);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодобратьВремяКлиентЗавершение", ЭтотОбъект);
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	
	ОткрытьФорму("Справочник.ЗаписиРабочегоКалендаря.Форма.ВыборВремени", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьВремяКлиентЗавершение(Время, ДополнительныеПараметры) Экспорт
	
	Если Время = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Период = Время.ДатаНачала;
	Запись.ПериодОкончание = Время.ДатаОкончания;
	
	Если Запись.Период > Запись.ПериодОкончание Тогда
		Запись.ПериодОкончание = Запись.Период + 1 * ДлительностьПоУмолчанию;
	КонецЕсли;
	
	НачальноеЗначениеДатаНачала = Запись.Период;
	НачальноеЗначениеДатаОкончания = Запись.ПериодОкончание;
	
	// Включение добавленных во время подбора участников в участники мероприятия
	Для Каждого ДобавленныйУчастник Из Время.ДобавленныеУчастники Цикл
		
		ТекущаяСтрока = Элементы.Участники.ТекущаяСтрока;
		Индекс = Участники.Индекс(Участники.НайтиПоИдентификатору(ТекущаяСтрока));
		
		НоваяСтрока = Участники.Вставить(Индекс + 1);
		НоваяСтрока.Участник = ДобавленныйУчастник;
		
		Элементы.Участники.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
	КонецЦикла;
	
	ПриИзмененииВремениПроведенияЭтапа();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПлановыеДанныеЭтапа()
	
	ДанныеЭтапа = ПодборПерсонала.ДанныеЭтапаРаботыСКандидатами(Кандидаты[0].Кандидат, Запись.ЭтапРаботы);
	
	Если ДанныеЭтапа.Количество() > 0 Тогда
		
		Помещение = ДанныеЭтапа[0].Помещение;
		
		Если ЗначениеЗаполнено(Помещение) Тогда
			ЗабронироватьПомещение = Истина;
			Элементы.Помещение.АвтоОтметкаНезаполненного = Истина;
		КонецЕсли;
		
		Запись.ПериодОкончание = ДанныеЭтапа[0].ПериодОкончание;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область УчастникиЭтапаРаботы

&НаСервере
Процедура ПрочитатьУчастников()
	
	Участники.Загрузить(
		РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.ТаблицаУчастниковЭтапа(Запись.Кандидат, Запись.ЭтапРаботы));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастниковНаСервере(СоставКандидатов)
	
	Участники.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кандидаты", СоставКандидатов);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Кандидаты.Ссылка КАК Ссылка,
	|	Кандидаты.Ответственный КАК Ответственный,
	|	Кандидаты.Вакансия КАК Вакансия
	|ПОМЕСТИТЬ ВТКандидаты
	|ИЗ
	|	Справочник.Кандидаты КАК Кандидаты
	|ГДЕ
	|	Кандидаты.Ссылка В(&Кандидаты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вакансии.Заявитель КАК Ссылка
	|ИЗ
	|	ВТКандидаты КАК Кандидаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Вакансии КАК Вакансии
	|		ПО Кандидаты.Вакансия = Вакансии.Ссылка
	|			И (Вакансии.Заявитель <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Кандидаты.Ответственный
	|ИЗ
	|	ВТКандидаты КАК Кандидаты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Участник = Выборка.Ссылка;
		НоваяСтрока.СостояниеПриглашения = ПредопределенноеЗначение(
			"Перечисление.СостоянияПриглашений.НеОтправлено");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыРасширеннойФормыПодбора()
	
	ВыбранныеПользователи = Участники.Выгрузить().ВыгрузитьКолонку("Участник");
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор участников этапа'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен", 
							ЗаголовокФормыПодбора, ВыбранныеПользователи, Истина);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора);
	
	Возврат АдресХранилища;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьДоступностьУчастниковЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат Тогда
		ПодобратьВремяКлиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УчастникиОпределены()
	
	Если Участники.Количество() = 0 Тогда
		
		Определены = Ложь;
		ТекстСообщения = НСтр("ru = 'Не указаны участники этапа.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,"Участники");
		
	Иначе
		Определены = Истина;
	КонецЕсли;
	
	Возврат Определены;
	
КонецФункции

&НаКлиенте
Функция СоставУчастников(ТолькоОбязательные = Ложь)
	
	СоставУчастников = Новый Массив;
	Для Каждого Строка Из Участники Цикл
		Если ТолькоОбязательные И Не Строка.Обязательный Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.Участник) Тогда
			СоставУчастников.Добавить(Строка.Участник);
		КонецЕсли;
		
	КонецЦикла;
	
	СоставУчастников = ОбщегоНазначенияКлиентСервер.СвернутьМассив(СоставУчастников);
	
	Возврат СоставУчастников;
	
КонецФункции

&НаКлиенте
Функция СоставКандидатов()
	
	СоставКандидатов = Новый Массив;
	Для Каждого СтрокаТаблицы Из Кандидаты Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Кандидат) Тогда
			СоставКандидатов.Добавить(СтрокаТаблицы.Кандидат);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СоставКандидатов;
	
КонецФункции

&НаСервере
Функция СоставКандидатовНаСервере()
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(Кандидаты, "Кандидат")
	
КонецФункции

&НаКлиенте
Функция ИсключенияЗанятости()
	
	Возврат ПолучитьИсключенияЗанятостиНаСервере(СоставКандидатов());
	
КонецФункции

&НаСервере
Функция ПолучитьИсключенияЗанятостиНаСервере(ПредметыИсключений)
	
	ТаблицаИсключений = Справочники.ЗаписиРабочегоКалендаря.СвязанныеЗаписиКалендаря(ПредметыИсключений, Запись.ЭтапРаботы);
	Возврат ТаблицаИсключений.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Функция УсловияУчастияВМероприятии()
	
	УсловияУчастия = Новый Массив;
	Для Каждого Строка Из Участники Цикл
		Если ЗначениеЗаполнено(Строка.Участник)
			И ТипЗнч(Строка.Участник) = Тип("СправочникСсылка.Пользователи")Тогда 
			УсловияУчастия.Добавить(Новый Структура("Исполнитель, ЯвкаОбязательна", Строка.Участник, Истина));
		КонецЕсли;
	КонецЦикла;
	
	Возврат УсловияУчастия;
	
КонецФункции

#КонецОбласти

#Область БронированиеПомещений

&НаКлиенте
Процедура ПроверитьВозможностьБронирования(Отказ = Ложь)
	
	Если Не ДоступноБронированиеПомещения Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Помещение) Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Отказ = ВозможноБронирование();
	
КонецПроцедуры

&НаСервере
Функция ВозможноБронирование(ИзменилосьПомещение = Ложь)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	Если Не БронированиеПомещений.ВозможнаБроньПомещения(
				Помещение, 
				Запись.Период, 
				Запись.ПериодОкончание, 
				Пользователи.ТекущийПользователь(), 
				"",
				ТекстОшибки) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , , "Помещение", Отказ);
		
	КонецЕсли;
	
	Если Не Отказ 
		И Не БронированиеПомещенийБЗК.ВозможнаБроньПомещенияПоЭтапуРаботы(
		Помещение, 
		Запись.Период, 
		Запись.ПериодОкончание,
		Запись.ЭтапРаботы,
		СоставКандидатовНаСервере()) Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
	
		Если Не ИзменилосьПомещение Тогда
		
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			
			ПодборПерсонала.СоздатьВТДанныеЭтапаРаботыСКандидатами(
				Запрос.МенеджерВременныхТаблиц, Запись.Кандидат, Запись.ЭтапРаботы);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрежниеДанныеЭтапа.Кандидат КАК Кандидат,
			|	ПрежниеДанныеЭтапа.Помещение КАК Помещение
			|ИЗ
			|	ВТДанныеЭтапаРаботы КАК ПрежниеДанныеЭтапа";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ИзменилосьПомещение = Выборка.Помещение <> Помещение;
			КонецЦикла;
		
		КонецЕсли; 
		
		Если ИзменилосьПомещение 
			И Не СинхронизацияMSExchange.ВозможнаБроньПомещения(
			Помещение,
			Запись.Период,
			Запись.ПериодОкончание) Тогда
			
			ТекстОшибки = НСтр("ru = 'Помещение забронировано в Microsoft Exchange'");
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.ИдентификаторНазначения = УникальныйИдентификатор;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.ПутьКДанным = "Помещение";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
	
	КонецЕсли; 
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#Область Видеоконференции

&НаКлиенте
Функция ПараметрыВидеособеседования()
	
	ПараметрыПараметрыВидеособеседования = ВидеособеседованияКлиент.НовыеПараметрыВидеособеседования();
	
	ПараметрыПараметрыВидеособеседования.Кандидат = Запись.Кандидат;
	ПараметрыПараметрыВидеособеседования.Этап = Запись.ЭтапРаботы;
	ПараметрыПараметрыВидеособеседования.УчетнаяЗапись = Запись.УчетнаяЗаписьВидеоконференции;
	ПараметрыПараметрыВидеособеседования.Идентификатор = Запись.ИдентификаторВидеоконференции;
	ПараметрыПараметрыВидеособеседования.Ссылка = СсылкаНаВидеоконференцию;
	ПараметрыПараметрыВидеособеседования.СсылкаОрганизатора = СсылкаНаВидеоконференциюДляОрганизатора;
	ПараметрыПараметрыВидеособеседования.Начало = Запись.Период;
	ПараметрыПараметрыВидеособеседования.Окончание = Запись.ПериодОкончание;
	
	Для Каждого Строка Из Участники Цикл
		ПараметрыПараметрыВидеособеседования.Участники.Добавить(Строка.Участник);
	КонецЦикла;
	
	Возврат ПараметрыПараметрыВидеособеседования;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьВидеоконференцию()
	
	Если Не ИспользуютсяВидеоконференции Или Не ЭтоПланированиеЭтапа(Запись) Тогда
		Элементы.ВидеоконференцияГруппа.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Видеоконференция = ЗначениеЗаполнено(Запись.УчетнаяЗаписьВидеоконференции);
	
	Если Видеоконференция Тогда
		Элементы.ЗаписьУчетнаяЗаписьВидеоконференции.СписокВыбора.ЗагрузитьЗначения(
			ВидеоконференцииКлиент.НастроенныеУчетныеЗаписи());
		
		Если ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
			ОповещениеОЗавершении =
				Новый ОписаниеОповещения("ОбработатьСостояниеВидеоконференции", ЭтотОбъект);
			
			ДлительнаяОперация =
				ДлительнаяОперацияПолученияДанных(Запись.УчетнаяЗаписьВидеоконференции,
					Запись.ИдентификаторВидеоконференции, УникальныйИдентификатор);
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Получаем данные о видеоконференции.'");
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьОтображениеВидеоконференции();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияПолученияДанных(УчетнаяЗапись, Идентификатор, УникальныйИдентификатор)
	
	ИмяПроцедуры = "Видеоконференции.ДанныеВидеоконференции";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, УчетнаяЗапись, Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеВидеоконференции()
	
	Запланирована = ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции);
	ВыбранаУчетнаяЗапись = ЗначениеЗаполнено(Запись.УчетнаяЗаписьВидеоконференции);
	
	Если Видеоконференция И ВыбранаУчетнаяЗапись Тогда
		Если Не Запланирована Тогда
			Элементы.ВидеоконференцияОписание.Заголовок = НСтр("ru = 'Не запланирована'");
		КонецЕсли;
		
		ДанныеСервиса = ВидеоконференцииКлиент.ДанныеСервиса(Запись.УчетнаяЗаписьВидеоконференции);
		Кнопки = ДанныеСервиса.НастройкиОтображения.Кнопки;
		
		Элементы.НачатьВидеоконференцию.Видимость = Кнопки.Старт.Использование;
		Элементы.НачатьВидеоконференцию.Заголовок = Кнопки.Старт.Заголовок;
		Элементы.ПерейтиВВидеоконференцию.Видимость = Кнопки.Перейти.Использование;
		Элементы.ПерейтиВВидеоконференцию.Заголовок = Кнопки.Перейти.Заголовок;
		Элементы.ЗапланироватьВидеоконференцию.Заголовок = Кнопки.Запланировать.Заголовок;
		Элементы.ОтменитьВидеоконференцию.Заголовок = Кнопки.Отменить.Заголовок;
		
		Элементы.ВидеоконференцияКнопки.Доступность = Запланирована;
		#Если ВебКлиент Тогда
		Если ДанныеСервиса.ЭтоСистемаВзаимодействия Тогда
			Элементы.НачатьВидеоконференцию.Видимость = Ложь;
		КонецЕсли;
		#КонецЕсли
	Иначе
		Элементы.ВидеоконференцияКнопки.Доступность = ВыбранаУчетнаяЗапись;
	КонецЕсли;
	
	Элементы.ЗапланироватьВидеоконференцию.Доступность = ВыбранаУчетнаяЗапись И Не Запланирована;
	Элементы.ОтменитьВидеоконференцию.Доступность = Запланирована;
	
	Элементы.ВидеоконференцияОсновноеГруппа.Видимость = Видеоконференция;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьВидеоконференциюВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ЗакрыватьФорму = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЗакрыватьФорму", Ложь);
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДанныеСервиса = ВидеоконференцииКлиент.ДанныеСервиса(Запись.УчетнаяЗаписьВидеоконференции);
		
		Если ДанныеСервиса.ДоступноПланирование Тогда
			ДанныеОПересечениях =
				ВидеособеседованияКлиент.ДанныеПересеченийВидеоконференций(ПараметрыВидеособеседования());
			
			Если ДанныеОПересечениях.ЕстьПересечения Тогда
				ПоказатьПредупреждение(, ДанныеОПересечениях.Предупреждение);
			Иначе
				Оповещение = Новый ОписаниеОповещения("ОбработатьСостояниеВидеоконференции",
					ЭтотОбъект, Новый Структура("ЗакрыватьФорму", ЗакрыватьФорму));
				ВидеособеседованияКлиент.НачатьПланированиеВидеособеседования(
					ЭтотОбъект, ПараметрыВидеособеседования(), Оповещение);
			КонецЕсли;
		Иначе
			Оповещение = Новый ОписаниеОповещения("ОбработатьСостояниеВидеоконференции",
				ЭтотОбъект, Новый Структура("ЗакрыватьФорму", ЗакрыватьФорму));
			ВидеособеседованияКлиент.НачатьПланированиеВидеособеседования(
				ЭтотОбъект, ПараметрыВидеособеседования(), Оповещение);
		КонецЕсли;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет И ЗакрыватьФорму Тогда
		Запись.УчетнаяЗаписьВидеоконференции = Неопределено;
		Запись.ИдентификаторВидеоконференции = Неопределено;
		ОКЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВидеоконференциюВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НачатьОтменуВидеоконференции(
			ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЗакрыватьФорму", Ложь));
	Иначе
		Видеоконференция = Истина;
		ОбновитьОтображениеВидеоконференции();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеУчетнойЗаписиВидеоконференцииВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НачатьОтменуВидеоконференции(
			Ложь, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "НоваяУчетнаяЗапись"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОтменуВидеоконференции(ЗакрыватьФорму = Ложь, НоваяУчетнаяЗапись = Неопределено)
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		ОповещениеОЗавершении = 
			Новый ОписаниеОповещения("ОбработатьСостояниеВидеоконференции", 
				ЭтотОбъект, Новый Структура("ЗакрыватьФорму, НоваяУчетнаяЗапись", ЗакрыватьФорму, НоваяУчетнаяЗапись));
			
		ДлительнаяОперация = ДлительнаяОперацияОтменыВидеоконференции(
			Запись.УчетнаяЗаписьВидеоконференции, Запись.ИдентификаторВидеоконференции, УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Отменяем видеоконференцию.'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияОтменыВидеоконференции(УчетнаяЗапись, Идентификатор, УникальныйИдентификатор)
	
	ИмяПроцедуры = "Видеоконференции.УдалитьВидеоконференцию";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, УчетнаяЗапись, Идентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВидеоконференциюПередЗакрытием()
	
	Если Не Видеоконференция
		И ИспользуютсяВидеоконференции
		И ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ОтменитьВидеоконференциюВопрос", ЭтотОбъект, Новый Структура("ЗакрыватьФорму", Истина)),
			НСтр("ru = 'Запланированная ранее видеоконференция будет отменена. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	ИначеЕсли Видеоконференция И ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		ДанныеСервиса = ВидеоконференцииКлиент.ДанныеСервиса(Запись.УчетнаяЗаписьВидеоконференции);
		
		Оповещение = Новый ОписаниеОповещения(
			"ОбработатьСостояниеВидеоконференции", ЭтотОбъект, Новый Структура("ЗакрыватьФорму", Истина));
		
		ВидеособеседованияКлиент.НачатьОбновлениеВидеособеседования(
			ЭтотОбъект, ПараметрыВидеособеседования(), Оповещение);
	ИначеЕсли Видеоконференция
			И ЗначениеЗаполнено(Запись.УчетнаяЗаписьВидеоконференции)
			И Не ЗначениеЗаполнено(Запись.ИдентификаторВидеоконференции) Тогда
		Оповещение = Новый ОписаниеОповещения(
			"ЗапланироватьВидеоконференциюВопрос", ЭтотОбъект, Новый Структура("ЗакрыватьФорму", Истина));
		
		ПоказатьВопрос(Оповещение,
			НСтр("ru = 'Видеоконференция не запланирована. Хотите запланировать перед сохранением?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ОКЗавершение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСостояниеВидеоконференции(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		Видеоконференция = Ложь;
		ОбновитьОтображениеВидеоконференции();
		Возврат;
	ИначеЕсли Не ДлительнаяОперация.Статус = "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВидеоконференции = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
	
	Если Не ЗначениеЗаполнено(ДанныеВидеоконференции) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось авторизоваться в сервисе видеоконференций.'"));
		ОбновитьОтображениеВидеоконференции();
		Возврат;
	КонецЕсли;
	
	ТекстОповещения = "";
	СостояниеВидеоконференции = ВидеоконференцииКлиентСервер.СостояниеВидеоконференции();
	
	Если ДанныеВидеоконференции.Состояние = СостояниеВидеоконференции.Создана Тогда
		Запись.ИдентификаторВидеоконференции = ДанныеВидеоконференции.Идентификатор;
		
		СсылкаНаВидеоконференцию = ДанныеВидеоконференции.Ссылка;
		СсылкаНаВидеоконференциюДляКандидата = ДанныеВидеоконференции.СсылкаКандидата;
		СсылкаНаВидеоконференциюДляОрганизатора = ДанныеВидеоконференции.СсылкаОрганизатора;
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЗакрыватьФорму", Ложь) Тогда
			ОКЗавершение();
		Иначе
			СохранитьДанныеВидеоконференции(РезультатВыбора());
			Оповестить("ИзмененаВидеоконференция");
		КонецЕсли;
		
		ТекстОповещения = НСтр("ru = 'Видеоконференция запланирована'");
	ИначеЕсли ДанныеВидеоконференции.Состояние = СостояниеВидеоконференции.Активна Тогда
		СсылкаНаВидеоконференцию = ДанныеВидеоконференции.Ссылка;
		СсылкаНаВидеоконференциюДляКандидата = ДанныеВидеоконференции.СсылкаКандидата;
		СсылкаНаВидеоконференциюДляОрганизатора = ДанныеВидеоконференции.СсылкаОрганизатора;
		ТекстОповещения = НСтр("ru = 'Видеоконференция активна'");
	ИначеЕсли ДанныеВидеоконференции.Состояние = СостояниеВидеоконференции.Обновлена Тогда
		Запись.ИдентификаторВидеоконференции = ДанныеВидеоконференции.Идентификатор;
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЗакрыватьФорму", Ложь) Тогда
			ОКЗавершение();
		Иначе
			СсылкаНаВидеоконференцию = ДанныеВидеоконференции.Ссылка;
			СсылкаНаВидеоконференциюДляКандидата = ДанныеВидеоконференции.СсылкаКандидата;
			СсылкаНаВидеоконференциюДляОрганизатора = ДанныеВидеоконференции.СсылкаОрганизатора;
			СохранитьДанныеВидеоконференции(РезультатВыбора());
			Оповестить("ИзмененаВидеоконференция");
		КонецЕсли;
		
		ТекстОповещения = НСтр("ru = 'Видеоконференция обновлена'");
	ИначеЕсли ДанныеВидеоконференции.Состояние = СостояниеВидеоконференции.Отменена Тогда
		Запись.УчетнаяЗаписьВидеоконференции = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДополнительныеПараметры, "НоваяУчетнаяЗапись", Запись.УчетнаяЗаписьВидеоконференции);
		Запись.ИдентификаторВидеоконференции = Неопределено;
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ЗакрыватьФорму", Ложь) Тогда
			Видеоконференция = Ложь;
			ОКЗавершение();
		Иначе
			СохранитьДанныеВидеоконференции(РезультатВыбора());
			ВидеособеседованияКлиент.ОтменитьВидеоконференцииПоКандидату(ПараметрыВидеособеседования());
			Оповестить("ИзмененаВидеоконференция");
		КонецЕсли;
		
		ТекстОповещения = НСтр("ru = 'Видеоконференция отменена'");
	Иначе
		Запись.УчетнаяЗаписьВидеоконференции = Неопределено;
		Запись.ИдентификаторВидеоконференции = Неопределено;
		
		СохранитьДанныеВидеоконференции(РезультатВыбора());
		Оповестить("ИзмененаВидеоконференция");
		
		Видеоконференция = Ложь;
		
		ТекстОповещения = НСтр("ru = 'Видеоконференция не найдена'");
	КонецЕсли;
	
	Элементы.ВидеоконференцияОписание.Заголовок = ДанныеВидеоконференции.Описание;
	
	ПоказатьОповещениеПользователя(ТекстОповещения);
	
	ОбновитьОтображениеВидеоконференции();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеВидеоконференции(РезультатВыбора)
	
	ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СинхронизироватьКалендариПриОткрытии()

	Если Не ЭтоПланированиеЭтапа(Запись) Тогда
		Возврат;
	КонецЕсли;
	ДлительнаяОперация = ДлительнаяОперацияСинхронизации();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СинхронизироватьКалендариЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ФормаВладелец = ЭтаФорма;
	ПараметрыОжидания.ТекстСообщения = "Идет синхронизация календарей.";
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияСинхронизации()

	Возврат СинхронизацияКалендарей.ДлительнаяОперацияПередПланированиемЭтапа(УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ДобавитьТекущегоПользователяВУчастники()
	
	Если Не (ДоступныЭлементыПланирования И Участники.Количество() = 0) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапБылЗапланирован = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПодборПерсонала.СоздатьВТДанныеЭтапаРаботыСКандидатами(
		Запрос.МенеджерВременныхТаблиц, Запись.Кандидат, Запись.ЭтапРаботы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПрежниеДанныеЭтапа.Кандидат КАК Кандидат,
	|	ПрежниеДанныеЭтапа.Период КАК Период
	|ИЗ
	|	ВТДанныеЭтапаРаботы КАК ПрежниеДанныеЭтапа";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтапБылЗапланирован = Выборка.Период = Запись.Период;
	КонецЦикла;
	
	Если Не ЭтапБылЗапланирован Тогда
		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Участник = Пользователи.ТекущийПользователь();
		НоваяСтрока.СостояниеПриглашения = Перечисления.СостоянияПриглашений.НеОтправлено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборУчастника(Знач НовыеУчастники)
	
	Если Не ЗначениеЗаполнено(НовыеУчастники) Тогда
		Участники.Очистить();
		Возврат;
	КонецЕсли;
	
	Индекс = Участники.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Найден = НовыеУчастники.Найти(Участники[Индекс]);
		Если Найден = Неопределено Тогда
			Участники.Удалить(Индекс);
		Иначе
			НовыеУчастники.Удалить(Найден);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Для Каждого НовыйУчастник Из НовыеУчастники Цикл
		Если Не ТипЗнч(НовыйУчастник) = Тип("СправочникСсылка.Пользователи") Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Участники.Добавить();
		НоваяСтрока.Участник = НовыйУчастник;
		НоваяСтрока.СостояниеПриглашения = ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.НеОтправлено");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьКалендариЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуЗанятостиИзВнешнихСистем();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(УсловноеОформление)
	
	УсловноеОформление.Элементы.Очистить();
	
	УстановитьУсловноеОформлениеСостоянияПриглашений(УсловноеОформление,
		ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.Принято"),
		ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
		
	УстановитьУсловноеОформлениеСостоянияПриглашений(УсловноеОформление,
		ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.Отклонено"),
		ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);

	УстановитьУсловноеОформлениеСостоянияПриглашений(УсловноеОформление,
		ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.ПодВопросом"),
		ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);

	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформлениеСостоянияПриглашений(УсловноеОформление, СостояниеПриглашения, ЦветТекстаПоля)
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("УчастникиСостояниеПриглашения");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Участники.СостояниеПриглашения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = СостояниеПриглашения;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекстаПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуЗанятостиИзВнешнихСистем()
	
	Если Не ОтображатьСобытияВнешнихСистем Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоПланированиеЭтапа(Запись) Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияЗаполненияТаблицыЗанятости(
		УникальныйИдентификатор, СоставУчастников(), ОтображаемаяДата);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьТаблицуЗанятостиИзВнешнихСистемЗавершение", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ФормаВладелец = ЭтаФорма;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияЗаполненияТаблицыЗанятости(УникальныйИдентификатор, СоставУчастников, ОтображаемаяДата)
	
	Возврат СинхронизацияКалендарей.ДлительнаяОперацияПолученияТаблицыЗанятости(УникальныйИдентификатор,
		СоставУчастников, НачалоДня(ОтображаемаяДата), КонецДня(ОтображаемаяДата));
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицуЗанятостиИзВнешнихСистемЗавершение(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Если Результат.Статус = "Выполнено" Тогда
			АдресТаблицыЗанятостиИзВнешнихСистем = Результат.АдресРезультата;
			АктуализироватьСостояниеПриглашений();
		КонецЕсли;
	КонецЕсли;
	
	ИнициализироватьПланировщик();
	
КонецПроцедуры

&НаСервере
Функция АктуализироватьСостояниеПриглашений()
	
	СостоянияПриглашений = 
		РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.ТаблицаУчастниковЭтапа(Запись.Кандидат, Запись.ЭтапРаботы);
		
	Для Каждого Строка Из Участники Цикл
	
		Отбор = Новый Структура("Участник", Строка.Участник); 
		
		НайденныеСтроки = СостоянияПриглашений.НайтиСтроки(Отбор);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Строка.СостояниеПриглашения = НайденнаяСтрока.СостояниеПриглашения;
		КонецЦикла;  
	
	КонецЦикла; 
	
КонецФункции

&НаСервере
Процедура ОбработатьИзменениеОрганизатораДляПомещения()

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
	
		БроньОбъект = Запись.Бронь.ПолучитьОбъект();
		БроньОбъект.Заблокировать();
		
		БроньОбъект.Автор = Пользователи.ТекущийПользователь();
		БроньОбъект.Пользователь = БроньОбъект.Автор;
		БроньОбъект.ДополнительныеСвойства.Вставить("ИзменениеСвязаннойБрони");
		БроньОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	    ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось изменить бронь помещения для этапа.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеОрганизатораДляСинхронизации()
	
	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	Попытка
		ДанныеСвязанныхЗаписей = 
			Справочники.ЗаписиРабочегоКалендаря.СвязанныеЗаписиКалендаря(Запись.Кандидат, Запись.ЭтапРаботы);
		
		Для Каждого ДанныеЗаписи Из ДанныеСвязанныхЗаписей Цикл
			Справочники.ЗаписиРабочегоКалендаря.УдалитьСвязаннуюЗаписьКалендаря(ДанныеЗаписи.Ссылка);
		КонецЦикла; 
		
		РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.ЗаписатьУчастниковЭтапа(
			Запись.Кандидат, Запись.ЭтапРаботы, Неопределено);
			
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось актуализировать данные этапа. Отмените его и запланируйте заново.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЭлектронныйТест()
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Параметры.Кандидаты);
	Вакансии = ДанныеКандидатов.ВыгрузитьКолонку("Вакансия");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВакансииЭтапыРаботыСКандидатами.СпособОценкиХарактеристик КАК СпособОценкиХарактеристик
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка В (&Вакансии)
		|	И ВакансииЭтапыРаботыСКандидатами.ЭтапРаботы = &ЭтапРаботы";
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.УстановитьПараметр("ЭтапРаботы", Запись.ЭтапРаботы);
	ТаблицаСпособыОценки = Запрос.Выполнить().Выгрузить();
	ТаблицаСпособыОценки.Свернуть("СпособОценкиХарактеристик");
	Если ТаблицаСпособыОценки.Количество() = 1 Тогда
		ЭлектронныйТест = Перечисления.СпособыОценкиХарактеристик.ЭлектронныйТест;
		Если ТаблицаСпособыОценки[0].СпособОценкиХарактеристик = ЭлектронныйТест Тогда
			СпособОценки = ЭлектронныйТест;
			НастройкиЭлектронногоОбучения = ЭлектронноеОбучение.НастройкиЭлектронногоОбучения();
			ОбщийКаталогНастроен = НастройкиЭлектронногоОбучения.ОбщийКаталогНастроен;
			Если Кандидаты.Количество() > 1 Тогда
				НаписатьПисьмоКандидатам = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТаблицаСпособыОценки.Количество() > 1 Тогда 
		ТекстСообщения = НСтр("ru = 'У кандидатов выбраны разные инструменты оценки характеристик.
			|Запланировать следующий этап можно только для кандидатов, у которых указаны одинаковые инструменты оценки.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьШаблонАнкеты()
	
	Если ЗначениеЗаполнено(Запись.ШаблонАнкеты) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКандидатов = Справочники.Кандидаты.ДанныеКандидатов(Параметры.Кандидаты);
	Вакансии = ДанныеКандидатов.ВыгрузитьКолонку("Вакансия");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ВакансииЭтапыРаботыСКандидатами.ШаблонАнкеты КАК ШаблонАнкеты
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка В (&Вакансии)
		|	И ВакансииЭтапыРаботыСКандидатами.ЭтапРаботы = &ЭтапРаботы";
	Запрос.УстановитьПараметр("Вакансии", Вакансии);
	Запрос.УстановитьПараметр("ЭтапРаботы", Запись.ЭтапРаботы);
	ТаблицаШаблоновАнкеты = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаШаблоновАнкеты.Количество() = 1 Тогда
		Запись.ШаблонАнкеты = ТаблицаШаблоновАнкеты[0].ШаблонАнкеты;
	ИначеЕсли ТаблицаШаблоновАнкеты.Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'У кандидатов выбраны разные инструменты оценки характеристик.
			|Запланировать следующий этап можно только для кандидатов, у которых указаны одинаковые инструменты оценки.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти