
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбновлениеПериодическогоОбученияПоОхранеТруда.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбновлениеПериодическогоОбученияПоОхранеТруда.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#Область ОбменДанными

// Пересчитывает зависимые данные после загрузки сообщения обмена
//
// Параметры:
//		ЗависимыеДанные - ТаблицаЗначений:
//			* ВедущиеМетаданные - ОбъектМетаданных - Метаданные ведущих данных
//			* ЗависимыеМетаданные - ОбъектМетаданных - Метаданные текущего объекта
//			* ВедущиеДанные - Массив объектов, заполненный при загрузке сообщения обмена
//				по этим объектам требуется обновить зависимые данные
//
Процедура ОбновитьЗависимыеДанныеПослеЗагрузкиОбменаДанными(ЗависимыеДанные) Экспорт
	
	ТаблицаОбновления = ОбучениеПоОхранеТруда.НоваяТаблицаОбновлениеПериодическихОбучений();
	
	ФизическиеЛица = Новый Массив;
	Для Каждого СтрокаТаблицы Из ЗависимыеДанные Цикл
		Если СтрокаТаблицы.ВедущиеМетаданные = Метаданные.Справочники.ФизическиеЛица Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ФизическиеЛица, 
				ОбщегоНазначения.ВыгрузитьКолонку(СтрокаТаблицы.ВедущиеДанные, "Ссылка"), Истина);
			Продолжить;
		КонецЕсли;
		ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоРабочимМестамСотрудников(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоРезультатамОбученияПоОхранеТруда(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоРабочимМестамОхраныТруда(ТаблицаОбновления, СтрокаТаблицы);
		ЗаполнитьТаблицуОбновленияПоПрограммамОбученияСотрудниковПоОхранеТруда(ТаблицаОбновления, СтрокаТаблицы);
	КонецЦикла;
	
	ОбучениеПоОхранеТруда.ЗаполнитьТаблицуОбновленияПериодическихОбученийПоФизическимЛицам(ТаблицаОбновления, ФизическиеЛица);
	
	ОбучениеПоОхранеТруда.ЗарегистрироватьОбновлениеПериодическихОбучений(ТаблицаОбновления);
	ОбучениеПоОхранеТруда.ЗапуститьОбновлениеПериодическихОбученийПоОхранеТруда();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТаблицуОбновленияПоКадровойИстории(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.КадроваяИсторияСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОбучений, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоРабочимМестамСотрудников(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.РабочиеМестаСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОбучений, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоРезультатамОбученияПоОхранеТруда(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.РегистрыСведений.МедицинскиеОсмотры Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОбучений, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоРабочимМестамОхраныТруда(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.Справочники.ПрограммыОбученияСотрудниковПоОхранеТруда Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОбучений, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьТаблицуОбновленияПоПрограммамОбученияСотрудниковПоОхранеТруда(ТаблицаОбновления, СтрокаТаблицы)
	
	Если СтрокаТаблицы.ВедущиеМетаданные <> Метаданные.Справочники.ПрограммыОбученияСотрудниковПоОхранеТруда Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НаборЗаписей Из СтрокаТаблицы.ВедущиеДанные Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
			НаборЗаписей.ДополнительныеСвойства.ТаблицаОбновлениеПериодическихОбучений, ТаблицаОбновления);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
