////////////////////////////////////////////////////////////////////////////////
// Подсистема "РегламентированнаяОтчетность"
// Серверные процедуры, обслуживающие правила регистрации объектов.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	ВидОтбораПоОрганизациям = СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоОрганизациям;

	Если ОбъектМетаданных = Метаданные.Документы.РегламентированныйОтчет
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.АрхивДанныхРегламентированнойОтчетности Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов.Измерения.РегламентированныйОтчет,
			"РегламентированныеДанные");
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РегламентированныйОтчетПрисоединенныеФайлы 
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РегистрацииВНалоговомОргане Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоСвойствамПланаОбмена(Настройки, ВидОтбораПоОрганизациям,
			"Владелец");
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РегламентированныеОтчеты 
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СкрытыеРегламентированныеОтчеты
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ШаблоныПечатиМашиночитаемыхФорм
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РесурсыМеханизмаОнлайнСервисовРО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ШаблоныЭВФОтчетовСтатистики Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВидыОтправляемыхДокументов Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ВыгрузкаРегламентированныхОтчетов
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросНаИнформационноеОбслуживаниеСтрахователя
		Или ОбъектМетаданных = Метаданные.Документы.ПоясненияКДекларацииПоНДС
		Или ОбъектМетаданных = Метаданные.Документы.РегламентированныйОтчет
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОПолучателеДокументов
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиОбменаФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналОтчетовСтатусы
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НумераторПачекПФР
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СобытияКалендаряБухгалтера
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СчетчикиВыгрузок Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ВходящиеСообщенияСЭДОФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналЗапросовКСерверамФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналСобытийОбменаСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СоответствиеСообщенийСЭДОЗапросам Тогда
		
		Настройка = Настройки.Добавить();
		Настройка.ПриОбработкеПослеИзменения = Истина;
		Настройка.ПриОбработкеПередИзменением = Истина;
		Настройка.Модуль = СинхронизацияДанныхЗарплатаКадрыБРО;
		Настройка.ДополнительныеПараметры.Вставить("РазделыДанных", "РегламентированныеДанные");
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПередИзменением
Процедура ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта(Объект, Отказ, Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя);
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.ВходящиеСообщенияСЭДОФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналЗапросовКСерверамФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналСобытийОбменаСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СоответствиеСообщенийСЭДОЗапросам Тогда
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.СЭДО") Тогда
			МодульСЭДО = ОбщегоНазначения.ОбщийМодуль("СЭДОФСС");
			ОрганизацииСтрахователя = МодульСЭДО.ОрганизацииСтрахователя(Объект.Организация);
		Иначе
			ОрганизацииСтрахователя = Объект.Организация;
		КонецЕсли;
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоОрганизациям(Объект,
			ОрганизацииСтрахователя, Отказ, Параметры,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные, Истина);
		
	Иначе
		
		Сообщение = СтрШаблон(НСтр("ru = 'Для объекта вида %1 не реализован обработчик'"),
			ОбъектМетаданных.ПолноеИмя());
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Сообщение,
			"СинхронизацияДанныхЗарплатаКадрыБРО.ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта");
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПослеИзменения
Процедура ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта(Объект, Отказ, Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя);
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.ВходящиеСообщенияСЭДОФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналЗапросовКСерверамФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналСобытийОбменаСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СоответствиеСообщенийСЭДОЗапросам Тогда
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ПособияСоциальногоСтрахования.СЭДО") Тогда
			МодульСЭДО = ОбщегоНазначения.ОбщийМодуль("СЭДОФСС");
			ОрганизацииСтрахователя = МодульСЭДО.ОрганизацииСтрахователя(Объект.Организация);
		Иначе
			ОрганизацииСтрахователя = Объект.Организация;
		КонецЕсли;
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоОрганизациям(Объект,
			ОрганизацииСтрахователя, Отказ, Параметры,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные, Истина);
	
	Иначе
		
		Сообщение = СтрШаблон(НСтр("ru = 'Для объекта вида %1 не реализован обработчик'"),
			ОбъектМетаданных.ПолноеИмя());
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Сообщение,
			"СинхронизацияДанныхЗарплатаКадрыБРО.ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти