// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", РегистрыБЗК.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = ДополнительныеСвойства.ПрежнийНабор;
	ТаблицаОбновлениеВыдачиСИЗ = РегистрыБЗК.ИзменениеЗаписейНабора(ПрежнийНабор, ЭтотОбъект, Замещение);
	ТаблицаОбновлениеВыдачиСИЗ.Свернуть("ФизическоеЛицо, ГоловнаяОрганизация");
	СредстваИндивидуальнойЗащиты.ЗарегистрироватьОбновлениеВыдачиСИЗ(ТаблицаОбновлениеВыдачиСИЗ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли