#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверитьДублиПоказателей(Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДублиПоказателей(Отказ)
	
	ТаблицаДублейПоказателей = ПоказателиКадровогоПланирования.Выгрузить();
	ТаблицаДублейПоказателей.Колонки.Добавить("КоличествоВхождений", ОбщегоНазначения.ОписаниеТипаЧисло(7));
	ТаблицаДублейПоказателей.ЗаполнитьЗначения(1, "КоличествоВхождений");
	ТаблицаДублейПоказателей.Свернуть("Показатель", "КоличествоВхождений");
	
	УникальныеСтроки = ТаблицаДублейПоказателей.НайтиСтроки(Новый Структура("КоличествоВхождений", 1));
	Для Каждого Строка Из УникальныеСтроки Цикл
		ТаблицаДублейПоказателей.Удалить(Строка);
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Данный показатель уже был введено ранее'");
	Для Каждого СтрокаДубль Из ТаблицаДублейПоказателей Цикл
		НайденныеДублиСтрок = ПоказателиКадровогоПланирования.НайтиСтроки(Новый Структура("Показатель", СтрокаДубль.Показатель));
		Для Сч = 1 По СтрокаДубль.КоличествоВхождений - 1 Цикл
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ПоказателиКадровогоПланирования", НайденныеДублиСтрок[Сч].НомерСтроки, "Показатель");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, Поле, "Объект", Отказ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли