#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КнигаВыдачиУдостоверений");
	НастройкиВарианта.Описание = НСтр("ru = 'Книга выдачи удостоверений.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВнешниеНаборыДанных(КомпоновщикНастроек) Экспорт
	
	ТекстЗапроса = ТекстЗапросаКнигаВыдачиУдостоверений();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		МодульКлассныеЧиныРанги = ОбщегоНазначения.ОбщийМодуль("КлассныеЧиныРанги");
		МодульКлассныеЧиныРанги.ДополнитьЗапросПолямиКнигаВыдачиУдостоверений(СхемаЗапроса);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МодульВоинскиеСпециальныеЗвания = ОбщегоНазначения.ОбщийМодуль("ВоинскиеСпециальныеЗвания");
		МодульВоинскиеСпециальныеЗвания.ДополнитьЗапросПолямиКнигаВыдачиУдостоверений(СхемаЗапроса);
	КонецЕсли;
	
	// Получение настроек отчета.
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрПериодОтчета = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	ПараметрВидУдостоверения = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидУдостоверения"));
	ПараметрСотрудник = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сотрудник"));
	
	Если ПараметрПериодОтчета <> Неопределено Тогда
		ДатаНачала = ПараметрПериодОтчета.ДатаНачала;
		ДатаОкончания = ПараметрПериодОтчета.ДатаОкончания;
	Иначе
		ДатаОкончания = ТекущаяДатаСеанса();
		ДатаНачала = НачалоГода(ДатаОкончания);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала); 
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	// Установка отборов во внешний набор данных из настроек пользователя.
	ВТДляОтбора = Новый Структура;
	ВТДляОтбора.Вставить("ВТВыдачиУдостоверений", "Удостоверения");
	ВТДляОтбора.Вставить("ВТТекущийСтатусУдостоверений", "Удостоверения");
	
	Если ПараметрОрганизация <> Неопределено И ПараметрОрганизация.Использование Тогда
		Удостоверения.ДобавитьОтборЗапроса(СхемаЗапроса, ВТДляОтбора, "#ИмяТаблицы.Организация В (&Организация)"); 
		Запрос.УстановитьПараметр("Организация", ПараметрОрганизация.Значение);
	КонецЕсли;
	
	Если ПараметрСотрудник <> Неопределено И ПараметрСотрудник.Использование Тогда
		Удостоверения.ДобавитьОтборЗапроса(СхемаЗапроса, ВТДляОтбора, "#ИмяТаблицы.Сотрудник В (&Сотрудник)");
		Запрос.УстановитьПараметр("Сотрудник", ПараметрСотрудник.Значение);
	КонецЕсли;
	
	Если ПараметрВидУдостоверения <> Неопределено И ПараметрВидУдостоверения.Использование Тогда
		Удостоверения.ДобавитьОтборЗапроса(СхемаЗапроса, ВТДляОтбора, "#ИмяТаблицы.ВидУдостоверения В (&ВидУдостоверения)");
		Запрос.УстановитьПараметр("ВидУдостоверения", ПараметрВидУдостоверения.Значение);
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("КнигаВыдачиУдостоверений", Запрос.Выполнить().Выгрузить());
	
	Возврат ВнешниеНаборыДанных;
	
КонецФункции

Функция ТекстЗапросаКнигаВыдачиУдостоверений()
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Удостоверения.Период КАК Период,
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Удостоверения.Организация КАК Организация,
		|	Удостоверения.ВидУдостоверения КАК ВидУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.ДатаВыдачи КАК ДатаВыдачи,
		|	Удостоверения.СрокДействия КАК СрокДействия,
		|	Удостоверения.Должность КАК Должность
		|ПОМЕСТИТЬ ВТВыдачиУдостоверений
		|ИЗ
		|	РегистрСведений.Удостоверения КАК Удостоверения
		|ГДЕ
		|	Удостоверения.ДатаВыдачи МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ТИПЗНАЧЕНИЯ(Удостоверения.Регистратор) = ТИП(Документ.ВыдачаУдостоверений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Удостоверения.Период КАК ДатаПоследнегоСтатуса,
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Удостоверения.Организация КАК Организация,
		|	Удостоверения.ВидУдостоверения КАК ВидУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения
		|ПОМЕСТИТЬ ВТТекущийСтатусУдостоверений
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(&ДатаОкончания, ) КАК Удостоверения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВыдачиУдостоверений.Период КАК Период,
		|	ВыдачиУдостоверений.Сотрудник КАК Сотрудник,
		|	ВыдачиУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВыдачиУдостоверений.Организация КАК Организация,
		|	ВыдачиУдостоверений.ВидУдостоверения КАК ВидУдостоверения,
		|	ВыдачиУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВыдачиУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	ВыдачиУдостоверений.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыдачиУдостоверений.СрокДействия КАК СрокДействия,
		|	ВыдачиУдостоверений.Должность КАК Должность,
		|	ЕСТЬNULL(ТекущийСтатусУдостоверений.ДатаПоследнегоСтатуса, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоследнегоСтатуса,
		|	ЕСТЬNULL(ТекущийСтатусУдостоверений.СтатусУдостоверения, ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано)) КАК СтатусУдостоверения
		|ПОМЕСТИТЬ ВТРезультат
		|ИЗ
		|	ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТекущийСтатусУдостоверений КАК ТекущийСтатусУдостоверений
		|		ПО ВыдачиУдостоверений.Организация = ТекущийСтатусУдостоверений.Организация
		|			И ВыдачиУдостоверений.Сотрудник = ТекущийСтатусУдостоверений.Сотрудник
		|			И ВыдачиУдостоверений.ФизическоеЛицо = ТекущийСтатусУдостоверений.ФизическоеЛицо
		|			И ВыдачиУдостоверений.ВидУдостоверения = ТекущийСтатусУдостоверений.ВидУдостоверения
		|			И ВыдачиУдостоверений.СерияУдостоверения = ТекущийСтатусУдостоверений.СерияУдостоверения
		|			И ВыдачиУдостоверений.НомерУдостоверения = ТекущийСтатусУдостоверений.НомерУдостоверения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Результат.Период КАК Период,
		|	Результат.Сотрудник КАК Сотрудник,
		|	Результат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Результат.Организация КАК Организация,
		|	Результат.ВидУдостоверения КАК ВидУдостоверения,
		|	Результат.СерияУдостоверения КАК СерияУдостоверения,
		|	Результат.НомерУдостоверения КАК НомерУдостоверения,
		|	Результат.ДатаВыдачи КАК ДатаВыдачи,
		|	Результат.СрокДействия КАК СрокДействия,
		|	Результат.Должность КАК Должность,
		|	Результат.ДатаПоследнегоСтатуса КАК ДатаПоследнегоСтатуса,
		|	Результат.СтатусУдостоверения КАК СтатусУдостоверения,
		|	ВЫБОР
		|		КОГДА Результат.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Возвращено)
		|				ИЛИ Результат.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Испорчено)
		|			ТОГДА Результат.ДатаПоследнегоСтатуса
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ОтметкаОВозврате,
		|	ВЫБОР
		|		КОГДА Результат.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Утеряно)
		|				ИЛИ Результат.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Уничтожено)
		|			ТОГДА Результат.ДатаПоследнегоСтатуса
		|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
		|	КОНЕЦ КАК ОтметкаОбУничтоженииУтере
		|ИЗ
		|	ВТРезультат КАК Результат";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли