
#Область СлужебныйПрограммныйИнтерфейс

// Проверяет путь к каталогу программы работающей с PDF.
Процедура ПроверитьКаталогMuPDF() Экспорт
	
	ПолныйПуть = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
		ПодборПерсонала.УстановленныеНастройки().ПутьККаталогуMuPDF);
	
	ПраваАдминистратора = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиПодбораПерсонала);
	
	Если Не ЗначениеЗаполнено(ПолныйПуть) Тогда
		ТекстИсключения = НСтр("ru = 'Не заполнены настройки утилиты для работы с документами Adobe PDF (.pdf)'") + Символы.ПС;
		Если ПраваАдминистратора Тогда
			ТекстИсключения = ТекстИсключения + НСтр("ru = 'Для того, чтобы обеспечить извлечение содержимого файлов pdf,
				|1) Скачайте и установите на компьютере, где установлен сервер 1С:Предприятия, утилиту MuPDF (см. https://mupdf.com/downloads/),
				|2) Заполните путь к каталогу, в котором установлена MuPDF в настройках программы.'");
		Иначе
			ТекстИсключения = ТекстИсключения + НСтр("ru = 'Обратитесь к администратору'");
		КонецЕсли;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Файл = Новый Файл(ПолныйПуть + ?(ОбщегоНазначения.ЭтоWindowsСервер(), "mutool.exe", "mutool"));
	Если Не Файл.Существует() Тогда
		ТекстИсключения = НСтр("ru = 'В панели настроек для разбора резюме указан некорректный путь к утилите для работы с документами Adobe PDF (.pdf)'") + Символы.ПС;
		Если ПраваАдминистратора Тогда
			ТекстИсключения = ТекстИсключения + НСтр("ru = 'В указанном каталоге утилиты MuPDF отсутствует файл запуска'");
		Иначе
			ТекстИсключения = ТекстИсключения + НСтр("ru = 'Обратитесь к администратору'");
		КонецЕсли;
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает список вложений заданных форматов.
//
// Параметры: 
//  ВходящееПисьмо - ДокументСсылка.ЭлектронноеПисьмоВходящее.
//  ФильтрРасширений - Строка - строка со списком доступных форматов.
// 
// Возвращаемое значение:
//  СписокЗначений - список вложений.
//
Функция СписокВложений(ВходящееПисьмо, ФильтрРасширений) Экспорт
	
	Вложения = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(ВходящееПисьмо, Вложения);
	Расширения = СтрРазделить(НРег(ФильтрРасширений), ",", Ложь);
	
	Результат = Новый СписокЗначений;
	РазборРезюме.ЗаполнитьСписокВложений(Вложения, Расширения, Результат);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, есть ли у текущего пользователя право на массовую загрузку резюме из файлов.
// 
// Возвращаемое значение:
//  Булево - Истина, если это полноправный пользователь или ему доступна роль ИспользованиеЗагрузкиКандидатовИзФайлов.
//
Функция ЕстьПраваНаЗагрузкуКандидатовИзФайлов() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь(, Истина) 
				ИЛИ ПравоДоступа("Использование", Метаданные.Обработки.ЗагрузкаКандидатовИзФайлов);
	
КонецФункции

// Определяет использовать ли сервис семантического анализа.
// 
// Возвращаемое значение: 
//  Булево - Истина, если сервис семантического анализа используется.
//
Функция ИспользоватьСервисСемантическогоАнализа() Экспорт
		
	Возврат РазборРезюмеСемантическийАнализ.ИспользоватьСервисСемантическогоАнализа();
	
КонецФункции

// Устанавливает способ разбора резюме.
//
// Параметры:
//  СпособРазбораРезюме - Строка - см. РазборРезюмеКлиентСервер.СпособыРазбораРезюме().
//
Процедура УстановитьСпособРазбораРезюме(СпособРазбораРезюме) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ТекущиеПараметры = Новый Соответствие(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("СпособРазбораРезюме", СпособРазбораРезюме);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	
КонецПроцедуры

// Возвращает способ разбора резюме.
//
// Параметры:
//  СпособРазбораРезюме - Строка - см. РазборРезюмеКлиентСервер.СпособыРазбораРезюме().
//
Функция СпособРазбораРезюме() Экспорт
	
	Результат = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("СпособРазбораРезюме");
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	СпособРазбораРезюме = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПользователя", "СпособРазбораРезюме");
	
	Если СпособРазбораРезюме = Неопределено Тогда
		СпособРазбораРезюме = РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнешнийСервис;
	КонецЕсли;
	
	Возврат СпособРазбораРезюме;
	
КонецФункции

Функция ДлительнаяОперацияРазбораРезюме(ИдентификаторФормы, ХранениеФайлов, ДанныеФайловWord, СпособРазбораРезюме) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Разбор резюме'");
	
	Для Каждого ХранениеФайла Из ХранениеФайлов Цикл
		ХранениеФайла.Вставить("ДвоичныеДанные", ПолучитьИзВременногоХранилища(ХранениеФайла.Хранение));
	КонецЦикла;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"РазборРезюме.РезультатРазбораРезюме", ХранениеФайлов, ДанныеФайловWord, СпособРазбораРезюме);
	
КонецФункции

#КонецОбласти
