
#Область ПрограммныйИнтерфейс

Функция ВыполнитьВыгрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле() Экспорт
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	
	РегистрыСведений.НастройкаПодписиСсылочныхДанных.СохранитьНастройкиВФайл(ВременныйФайл);
	
	ДанныеФайла = Новый ДвоичныеДанные(ВременныйФайл);
	УдалитьФайлы(ВременныйФайл);
	
	Возврат ДанныеФайла;
	
КонецФункции

Процедура ВыполнитьЗагрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле(Параметры, АдресВХранилище) Экспорт
	
	Результат = РегистрыСведений.НастройкаПодписиСсылочныхДанных.ЗагрузитьНастройкиИзФайла(
		Параметры.УдалитьВсеСуществующие, Параметры.ДанныеФайла);
	
	СтруктураРезультата = Новый Структура("Результат", Результат);
	ПоместитьВоВременноеХранилище(СтруктураРезультата, АдресВХранилище);
	
КонецПроцедуры

Функция ВыполнитьВыгрузкуДополнительныхКолонокСписковЗадач(Колонки) Экспорт
	
	Возврат Справочники.ДополнительныеКолонкиСписковЗадач.СохранитьКолонкиВДвоичныеДанные(Колонки);
	
КонецФункции

Функция ВыполнитьПроверкуПодписанныхДанныхМногопоточно(Поток, Параметры) Экспорт
	
	ПроцессыОбработкиДокументов.ВыполнитьПроверкуПодписанныхДанныхМногопоточно(Поток, Параметры);
	
КонецФункции 

Процедура ВыполнитьЗадачи(Контекст, АдресРезультата = Неопределено) Экспорт
	
	ПроцессыОбработкиДокументов.ВыполнитьЗадачи(Контекст, АдресРезультата);
	
КонецПроцедуры 

#КонецОбласти

 // См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ВыполнитьВыгрузкуДополнительныхКолонокСписковЗадач", Истина);
	Методы.Вставить("ВыполнитьВыгрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле", Истина); 
	Методы.Вставить("ВыполнитьЗагрузкуНастроекХраненияСсылочныхДанныхВОбщемМодуле", Истина); 
	Методы.Вставить("ВыполнитьПроверкуПодписанныхДанныхМногопоточно", Истина); 
	Методы.Вставить("ВыполнитьЗадачи", Истина);
КонецПроцедуры

