#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	ДействияПередЗаписью();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	ДействияПриЗаписи();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заполнение

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	Возврат ЗаполнитьВторичныеДанные(); // В документе нет фиксируемых реквизитов.
КонецФункции

Функция ЗаполнитьВторичныеДанные() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Модифицирован = Ложь;
	
	Если ЗаполнитьДату() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьЗначениеАдреса("АдресПроживания") Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьЗначениеАдреса("АдресРегистрации") Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьФизическоеЛицо() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьГражданство() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьСотрудникаИОрганизацию() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьРебенка() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКартуМИР() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьСпособВыплатыПособия() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьИсправленныйДокумент() Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПервичныйДокумент() Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДатыОтправки() Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция ЗаполнитьДату() Экспорт
	Если ДатаСообщения <> Дата Тогда
		Дата = ДатаСообщения;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ЗаполнитьЗначениеАдреса(Префикс) Экспорт
	Если ЗначениеЗаполнено(ЭтотОбъект[Префикс + "ФИАСДом"]) Тогда
		Идентификатор = ЭтотОбъект[Префикс + "ФИАСДом"];
		ЭтоИдентификаторДома = Истина;
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект[Префикс + "ФИАСРО"]) Тогда
		Идентификатор = ЭтотОбъект[Префикс + "ФИАСРО"];
		ЭтоИдентификаторДома = Ложь;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	НовоеЗначение = Документы.ВходящийЗапросФССДляРасчетаПособия.НайтиАдресПоСведенияОЗастрахованномЛицеФСС(ЭтотОбъект,
		Префикс, Идентификатор, ЭтоИдентификаторДома);
	Если НовоеЗначение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ЭтотОбъект[Префикс], НовоеЗначение);
КонецФункции

Функция ЗаполнитьФизическоеЛицо()
	Если Не ЗначениеЗаполнено(СотрудникСНИЛС) Тогда
		Возврат Ложь;
	КонецЕсли;
	// В первую очередь используются данные больничного.
	СведенияОбЭЛН = СведенияОбЭЛН();
	Если СведенияОбЭЛН <> Неопределено
		И ЗначениеЗаполнено(СведенияОбЭЛН.Больничный)
		И ЗначениеЗаполнено(СведенияОбЭЛН.ФизическоеЛицо) Тогда
		РезультатПоиска = Новый Структура("ФизическоеЛицо, ТекстОшибки", СведенияОбЭЛН.ФизическоеЛицо, "");
	Иначе
		РезультатПоиска = ФизическиеЛицаЗарплатаКадры.ФизическоеЛицоПоСНИЛСИлиФИО(
			СотрудникСНИЛС,
			СотрудникФамилия,
			СотрудникИмя,
			СотрудникОтчество);
	КонецЕсли;
	ЕстьИзменения = Ложь;
	Если ЗначениеЗаполнено(РезультатПоиска.ФизическоеЛицо)
		И ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ФизическоеЛицо, РезультатПоиска.ФизическоеЛицо) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СотрудникТекстОшибкиПоиска,
			РезультатПоиска.ТекстОшибки) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьГражданство()
	Если Не ЗначениеЗаполнено(КодСтраныГражданства) Тогда
		Возврат Ложь;
	КонецЕсли;
	НовоеЗначение = Справочники.СтраныМира.НайтиПоКоду(КодСтраныГражданства);
	Если Не ЗначениеЗаполнено(НовоеЗначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СотрудникГражданство, НовоеЗначение);
КонецФункции

Функция ЗаполнитьСотрудникаИОрганизацию() Экспорт
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Ложь;
	КонецЕсли;
	// В первую очередь используются данные больничного.
	СведенияОбЭЛН = СведенияОбЭЛН();
	Если СведенияОбЭЛН <> Неопределено
		И ЗначениеЗаполнено(СведенияОбЭЛН.Больничный)
		И ЗначениеЗаполнено(СведенияОбЭЛН.Сотрудник) Тогда
		РезультатПоиска = СведенияОбЭЛН;
	Иначе
		РезультатПоиска = КадровыйУчет.КадровыеДанныеОсновногоСотрудникаФизическогоЛица(
			Страхователь,
			ФизическоеЛицо,
			"Организация",
			ДатаНачалаСобытия(СведенияОбЭЛН),
			Ложь);
		Если РезультатПоиска = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	ЕстьИзменения = Ложь;
	Если ЗначениеЗаполнено(РезультатПоиска.Организация)
		И ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(Организация, РезультатПоиска.Организация) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(РезультатПоиска.Сотрудник)
		И ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(Сотрудник, РезультатПоиска.Сотрудник) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьРебенка()
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) // Работник с таким СНИЛС не числится.
		Или Не ЗначениеЗаполнено(РебенокФамилия)
		Или Не ЗначениеЗаполнено(РебенокИмя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Родственники = СЭДОФСС.ПустаяТаблицаРодственников();
	
	Родственник = Родственники.Добавить();
	Родственник.Фамилия      = РебенокФамилия;
	Родственник.Имя          = РебенокИмя;
	Родственник.Отчество     = РебенокОтчество;
	Родственник.ДатаРождения = РебенокДатаРождения;
	Родственник.СНИЛС        = РебенокСНИЛС;
	Родственник.КодСвязи     = РебенокКодСвязи;
	
	СЭДОФСС.ЗаполнитьСсылкиРодственников(ФизическоеЛицо, Родственники);
	
	Если Не ЗначениеЗаполнено(Родственник.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(Ребенок, Родственник.Ссылка);
КонецФункции

Функция ЗаполнитьКартуМИР()
	НомерКартыМИР = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "НомерКартыМИР");
	Если Не ЗначениеЗаполнено(НомерКартыМИР) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Начало = СтрЗаменить(Лев(НомерКартыМИР, 6), "*", "");
	Окончание = СтрЗаменить(Прав(НомерКартыМИР, 4), "*", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БанковскиеКартыКонтрагентов.Ссылка КАК Ссылка,
	|	БанковскиеКартыКонтрагентов.Владелец КАК ФизическоеЛицо
	|ИЗ
	|	Справочник.БанковскиеКартыКонтрагентов КАК БанковскиеКартыКонтрагентов
	|ГДЕ
	|	БанковскиеКартыКонтрагентов.Код ПОДОБНО &Шаблон";
	Запрос.УстановитьПараметр("Шаблон", Начало + "%" + Окончание);
	
	УстановитьПривилегированныйРежим(Истина);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	СтрокаТаблицы = Таблица.Найти(ФизическоеЛицо, "ФизическоеЛицо");
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = Таблица.Найти(Справочники.ФизическиеЛица.ПустаяСсылка(), "ФизическоеЛицо");
		Если СтрокаТаблицы = Неопределено И Таблица.Количество() > 0 Тогда
			// Карта привязана к другому физлицу. Исключение не поднимается.
			// Во входящем запросе отображается пустой номер карты.
			// В ответе на запрос используется актуальный способ выплаты (не используется способ выплаты из входящего запроса).
			Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(КартаМИР, Неопределено);
		КонецЕсли;
	КонецЕсли;
	Если СтрокаТаблицы = Неопределено Тогда
		Свойства = Новый Структура("ЭтоНациональныйПлатежныйИнструмент", Истина);
		ОсновныеРеквизитыКарты = Справочники.БанковскиеКартыКонтрагентов.ОсновныеРеквизитыКарты();
		ОсновныеРеквизитыКарты.ОсновнойНомерДержателяКарты = НомерКартыМИР;
		НовоеЗначение = Справочники.БанковскиеКартыКонтрагентов.Добавить(
			ФизическоеЛицо,
			ОсновныеРеквизитыКарты,
			Свойства,
			Ложь);
	Иначе
		НовоеЗначение = СтрокаТаблицы.Ссылка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НовоеЗначение) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(КартаМИР, НовоеЗначение);
КонецФункции

Функция ЗаполнитьСпособВыплатыПособия()
	Если ЗначениеЗаполнено(БанкБИК) И ЗначениеЗаполнено(НомерСчета) Тогда
		НовоеЗначение = Перечисления.СпособыВыплатыПособия.ЧерезБанк;
	ИначеЕсли ЗначениеЗаполнено(КартаМИР)
		Или ЗначениеЗаполнено(ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "НомерКартыМИР")) Тогда
		НовоеЗначение = Перечисления.СпособыВыплатыПособия.НаКартуМИР;
	ИначеЕсли ЗначениеЗаполнено(ИнаяОрганизацияБИК) Тогда
		НовоеЗначение = Перечисления.СпособыВыплатыПособия.ИнаяОрганизация;
	ИначеЕсли ЗначениеЗаполнено(АдресПроживанияФИАСДом)
		Или ЗначениеЗаполнено(АдресПроживанияФИАСРО)
		Или ЗначениеЗаполнено(АдресПроживанияЗаПределамиРФ) Тогда
		НовоеЗначение = Перечисления.СпособыВыплатыПособия.ПочтовымПереводом;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СпособВыплатыПособия, НовоеЗначение);
КонецФункции

Функция ЗаполнитьИсправленныйДокумент()
	НовоеЗначение = Неопределено;
	Если ЗначениеЗаполнено(ИсправлениеНомерПроцесса) Тогда
		СведенияОПроцессе = СЭДОФСС.СведенияОПроцессе(ИсправлениеНомерПроцесса);
		Если ЗначениеЗаполнено(СведенияОПроцессе.ВходящийЗапрос) Тогда
			НовоеЗначение = СведенияОПроцессе.ВходящийЗапрос;
		КонецЕсли;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ИсправленныйДокумент, НовоеЗначение);
КонецФункции

Функция ЗаполнитьПервичныйДокумент()
	Возврат СЭДОФСС.ЗаполнитьПервичныйДокументДляРасчетаПособияФСС(ЭтотОбъект, Ложь);
КонецФункции

Функция ЗаполнитьДатыОтправки() Экспорт
	Если Обработан Тогда
		НовоеЗначение = '00010101';
	Иначе
		НовоеЗначение = Документы.ВходящийЗапросФССДляРасчетаПособия.МаксимальнаяДатаОтвета(ЭтотОбъект);
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(МаксимальнаяДатаОтвета, НовоеЗначение);
КонецФункции

#КонецОбласти

#Область СведенияОбЭЛН

Функция ДатаНачалаСобытия(СведенияОбЭЛН)
	Если СведенияОбЭЛН <> Неопределено И ЗначениеЗаполнено(СведенияОбЭЛН.ДатаНачалаСобытия) Тогда
		Возврат СведенияОбЭЛН.ДатаНачалаСобытия;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтпускПоУходуДатаНачала) Тогда
		Возврат ОтпускПоУходуДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(ОтпускПоУходуДата) Тогда
		Возврат ОтпускПоУходуДата;
	ИначеЕсли ЗначениеЗаполнено(ОплатаФССДатаНачала) Тогда
		Возврат ОплатаФССДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(РебенокДатаРождения) Тогда
		Возврат РебенокДатаРождения;
	ИначеЕсли ЗначениеЗаполнено(ДатаСообщения) Тогда
		Возврат ДатаСообщения;
	КонецЕсли;
	Возврат НачалоДня(Дата);
КонецФункции

Функция СведенияОбЭЛН() Экспорт
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Или Не ЗначениеЗаполнено(НомерЛН) Тогда
		Возврат Неопределено;
	КонецЕсли;
	СведенияОбЭЛН = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "СведенияОбЭЛН");
	Если СведенияОбЭЛН <> Неопределено
		И СведенияОбЭЛН.ГоловнаяОрганизация = ГоловнаяОрганизация
		И СведенияОбЭЛН.НомерЛисткаНетрудоспособности = НомерЛН Тогда
		Возврат СведенияОбЭЛН;
	КонецЕсли;
	СведенияОбЭЛН = РегистрыСведений.СведенияОбЭЛН.СведенияОбЭЛН(НомерЛН, ГоловнаяОрганизация);
	ДополнительныеСвойства.Вставить("СведенияОбЭЛН", СведенияОбЭЛН);
	Возврат СведенияОбЭЛН;
КонецФункции

#КонецОбласти

#Область ПередЗаписью

Процедура ДействияПередЗаписью() Экспорт
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоЗаписи", ЗначенияРеквизитовДоЗаписи());
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
	
	// Физлицо заполняется безусловно, т.к. определяет права.
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	ИначеЕсли ЗначениеЗаполнено(ФизическоеЛицо) И ЗначениеЗаполнено(Страхователь) Тогда
		УстановитьПривилегированныйРежим(Истина);
		КадровыеДанные = КадровыйУчет.КадровыеДанныеОсновногоСотрудникаФизическогоЛица(
			Страхователь,
			ФизическоеЛицо,
			"Сотрудник, Организация",
			ТекущаяДатаСеанса(),
			Ложь,
			СотрудникТекстОшибкиПоиска);
		УстановитьПривилегированныйРежим(Ложь);
		Если КадровыеДанные <> Неопределено Тогда
			Если ЗначениеЗаполнено(КадровыеДанные.Организация) Тогда
				Организация = КадровыеДанные.Организация;
			КонецЕсли;
			Сотрудник = КадровыеДанные.Сотрудник;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЗначенияРеквизитовДоЗаписи()
	ИменаРеквизитов = "ГоловнаяОрганизация, НомерЛН, Обработан, ФизическоеЛицо, ОтветНаЗапрос, НомерПроцесса,
	|ПометкаУдаления";
	ЭтоНовый = ЭтоНовый();
	Если ЭтоНовый Тогда
		ЗначенияРеквизитов = ОбщегоНазначенияБЗК.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	Иначе
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	КонецЕсли;
	ЗначенияРеквизитов.Вставить("ЭтоНовый", ЭтоНовый);
	Возврат ЗначенияРеквизитов;
КонецФункции

#КонецОбласти

#Область ПриЗаписи

Процедура ДействияПриЗаписи() Экспорт
	РегистрыСведений.СведенияОбЭЛН.ПриЗаписиВходящегоЗапроса(ЭтотОбъект);
	РегистрыСведений.СНИЛСВходящихСообщенийСЭДО.ОбновитьПоДокументу(
		Ссылка,
		Страхователь,
		ИдентификаторСообщения,
		СотрудникСНИЛС,
		ФизическоеЛицо,
		ДатаСообщения,
		СокрЛП(СотрудникФамилия + " " + СотрудникИмя + " " + СотрудникОтчество),
		100);
	Документы.УведомлениеОбОтсутствииОтветаСЭДО.ПриЗаписиВходящегоЗапроса(ЭтотОбъект);
	Если ЗначениеЗаполнено(ИсправлениеНомерПроцесса) И ЗначениеЗаполнено(ИсправленныйДокумент) Тогда
		ВходящийЗапросОбъект = ИсправленныйДокумент.ПолучитьОбъект();
		ВходящийЗапросОбъект.Обработан = Истина;
		СЭДОФСС.ЗаписатьДокумент(ВходящийЗапросОбъект, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли