
////////////////////////////////////////////////////////////////////////////////
// Отпуска клиент.
// Клиентские процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик подключаемой команды. Открывает форму обработки "Диаграмма отпусков"
//
// Параметры: 
//  МассивОбъектов - Массив - массив объектов взаимодействия. 
//  ДополнительныеПараметры - Структура - структура параметров команды.
//
Процедура ОткрытьДиаграммуОтпусковПодключаемый(МассивОбъектов, ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("Обработка.ДиаграммаОтпусков.Форма.Форма");
	
КонецПроцедуры

#КонецОбласти 
