#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует обработку синхронизации с Microsoft Exchange.
//
// Параметры:
//  Узел - ПланОбменаСсылка.СинхронизацияКалендарей - Узел пользователя.
//
// Возвращаемое значение:
//  ОбработкаОбъект.СинхронизацияMSExchange - Инициализрованная обработка.
//
Функция Инициализировать(Узел = Неопределено) Экспорт
	
	ОбработкаСинхронизации = Создать();
	ОбработкаСинхронизации.Инициализировать();
	
	Если ЗначениеЗаполнено(Узел) Тогда
		ОбработкаСинхронизации.УстановитьУзел(Узел);
	КонецЕсли;
	
	Возврат ОбработкаСинхронизации;
	
КонецФункции

#КонецОбласти

#КонецЕсли
