#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СхемаСообщения;
Перем СхемаТипы;
Перем КодОшибкиАвторизации;
Перем КодОшибкиРесурсНеНайден;
Перем КодОшибкиСериализацииXDTO;
Перем КодОшибкиРаботыСИнтернет;
Перем КодыИзвестныхОшибок;
Перем АварийныеКодыОшибок;
Перем HTTPСоединение;
Перем ПоддерживаемыеОтветы;
Перем Фабрика;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выполняет инициализацию обработки.
//
Процедура Инициализировать() Экспорт
	
	СхемаMessages = ПолучитьИмяВременногоФайла("xsd");
	СхемаTypes = ПолучитьИмяВременногоФайла("xsd");
	ПолучитьМакет("СхемаMessagesExchange2010SP2").Записать(СхемаMessages);
	ПолучитьМакет("СхемаTypesExchange2010SP2").Записать(СхемаTypes);
	Схемы = Новый Массив;
	Схемы.Добавить(СхемаMessages);
	Схемы.Добавить(СхемаTypes);
	Фабрика = СоздатьФабрикуXDTO(Схемы);
	УдалитьФайлы(СхемаMessages);
	УдалитьФайлы(СхемаTypes);
	
	СхемаСообщения = "http://schemas.microsoft.com/exchange/services/2006/messages";
	СхемаТипы = "http://schemas.microsoft.com/exchange/services/2006/types";
	
	КодОшибкиАвторизации = "{#00000401#}";
	КодОшибкиРесурсНеНайден = "{#00000404#}";
	КодОшибкиРаботыСИнтернет = "{#00000599#}";
	КодОшибкиСериализацииXDTO = "{#30153286#}";
	
	АварийныеКодыОшибок = Новый Массив;
	АварийныеКодыОшибок.Добавить(КодОшибкиСериализацииXDTO);
	
	КодыИзвестныхОшибок = Новый Массив;
	КодыИзвестныхОшибок.Добавить(КодОшибкиАвторизации);
	КодыИзвестныхОшибок.Добавить(КодОшибкиРесурсНеНайден);
	КодыИзвестныхОшибок.Добавить(КодОшибкиРаботыСИнтернет);
	
	ПоддерживаемыеОтветы = Новый Массив;
	ПоддерживаемыеОтветы.Добавить("CreateItemResponse");
	ПоддерживаемыеОтветы.Добавить("DeleteItemResponse");
	ПоддерживаемыеОтветы.Добавить("GetFolderResponse");
	ПоддерживаемыеОтветы.Добавить("GetItemResponse");
	ПоддерживаемыеОтветы.Добавить("SyncFolderItemsResponse");
	ПоддерживаемыеОтветы.Добавить("UpdateItemResponse");
	ПоддерживаемыеОтветы.Добавить("GetUserAvailabilityResponse");
	
КонецПроцедуры

// Устанавливает настройки обработки по указанному узлу.
//
Процедура УстановитьУзел(НовыйУзел) Экспорт
	
	Если Не ИспользоватьОлицетворение Тогда
		HTTPСоединение = Неопределено;
	КонецЕсли;
	Узел = НовыйУзел;
	НастройкиСинхронизации = РегистрыСведений.НастройкиСинхронизацииMSExchange.НастройкиСинхронизации(Узел);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиСинхронизации);
	
КонецПроцедуры

// Выполняет синхронизацию элементов.
//
// Параметры:
//  СостояниеСинхронизации - Строка - Текущее состояние синхронизации.
//
// Возвращаемое значение:
//  Структура - Данные синхронизации элементов.
//
Функция ДанныеСинхронизацииЭлементов(СостояниеСинхронизации = "") Экспорт
	
	Запрос = ЗапросСинхронизацияЭлементов(СостояниеСинхронизации);
	Ответ = ВыполнитьPOSTЗапрос(Запрос);
	ДанныеОтвета = Ответ.ResponseMessages.SyncFolderItemsResponseMessage[0];
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Получает данные элементов.
//
// Параметры:
//  Идентификаторы - Массив - Порция элементов.
// 
// Возвращаемое значение:
//  Структура - Данные порции элементов.
//
Функция ПолучитьЭлементы(Идентификаторы) Экспорт
	
	Запрос = ЗапросПолучитьПорциюЭлементов(Идентификаторы);
	Ответ = ВыполнитьPOSTЗапрос(Запрос);
	ДанныеОтвета = Ответ.ResponseMessages.GetItemResponseMessage;
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Выполняет создание элементов.
//
// Параметры:
//  ПорцияЭлементов - Массив - Порция элементов.
//  ОтправлятьПриглашения - Булево - Отправлять приглашения.
// 
// Возвращаемое значение:
//  Структура - Данные порции элементов.
//
Функция СоздатьЭлементы(ПорцияЭлементов, ОтправлятьПриглашения = Ложь) Экспорт
	
	Запрос = ЗапросСоздатьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения);
	Ответ = ВыполнитьPOSTЗапрос(Запрос);
	ДанныеОтвета = Ответ.ResponseMessages.CreateItemResponseMessage;
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Выполняет изменение элементов.
//
// Параметры:
//  ПорцияЭлементов - Массив - Порция элементов.
//  ОтправлятьПриглашения - Булево - Отправлять приглашения.
//  ОтправлятьВсем - Булево - Отправлять приглашения всем участникам.
// 
// Возвращаемое значение:
//  Структура - Данные порции элементов.
//
Функция ИзменитьЭлементы(ПорцияЭлементов, ОтправлятьПриглашения = Ложь, ОтправлятьВсем = Истина) Экспорт
	
	Запрос = ЗапросИзменитьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения, ОтправлятьВсем);
	Ответ = ВыполнитьPOSTЗапрос(Запрос);
	ДанныеОтвета = Ответ.ResponseMessages.UpdateItemResponseMessage;
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Выполняет удаление элементов.
//
// Параметры:
//  ПорцияЭлементов - Массив - Порция элементов.
//  ОтправлятьПриглашения - Булево - Отправлять приглашения.
// 
// Возвращаемое значение:
//  Структура - Данные порции элементов.
//
Функция УдалитьЭлементы(ПорцияЭлементов, ОтправлятьПриглашения = Ложь) Экспорт
	
	Запрос = ЗапросУдалитьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения);
	Ответ = ВыполнитьPOSTЗапрос(Запрос);
	ДанныеОтвета = Ответ.ResponseMessages.DeleteItemResponseMessage;
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Проверяет соединение с сервером.
//
// Параметры:
//  ТекстОшибки - Строка - Текст ошибки.
//
// Возвращаемое значение:
//  Булево - Есть соединение с сервером.
//
Функция ПроверитьСоединение(ТекстОшибки = "") Экспорт
	
	ЕстьСоединениеССервером = Ложь;
	
	Попытка
		Запрос = ЗапросПроверкаСоединения();
		Результат = ВыполнитьPOSTЗапрос(Запрос, Истина, Ложь);
		ЕстьСоединениеССервером = ОтветПроверкаСоединения(Результат);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрацииОшибка(ПодробноеПредставлениеОшибки);
		
		ТекстОшибки = ТекстОшибки(ИнформацияОбОшибке);
		
	КонецПопытки;
	
	Возврат ЕстьСоединениеССервером;
	
КонецФункции

// Формирует данные о доступности пользователей.
//
// Параметры:
//  ПочтовыеАдреса - Массив - Почтовые адреса, по которым нужно получить данные о доступности.
//  ДатаНачала - Дата - Дата начала периода получения данных о доступности.
//  ДатаОкончания - Дата - Дата окончания периода получения данных о доступности.
// 
// Возвращаемое значение:
//  Структура - Результат получения доступности.
//
Функция ДоступностьПользователей(ПочтовыеАдреса, ДатаНачала, ДатаОкончания) Экспорт
	
	Запрос = ЗапросДоступностьПользователей(ПочтовыеАдреса, ДатаНачала, ДатаОкончания);
	Результат = ВыполнитьPOSTЗапрос(Запрос);
	ДоступностьПользователей = ОтветДоступностьПользователей(Результат);
	
	Возврат ДоступностьПользователей;
	
КонецФункции

// Выполняет произвольный запрос к серверу.
//
// Параметры:
//  Запрос - Текст - Текст SOAP запроса.
// 
// Возвращаемое значение:
//  HTTPОтвет - Ответ на POST запрос.
//
Функция ВыполнитьПроизвольныйЗапрос(Запрос) Экспорт
	
	Результат = ВыполнитьPOSTЗапрос(Запрос, Ложь, Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеЧастейЗапроса

// Открывает запись SOAP запроса.
//
// Параметры:
//  ИмяОперации - Строка - Имя операции запроса.
// 
// Возвращаемое значение:
//  ЗаписьXML - Запись XML.
//
Функция ЗаписьЗапроса(ИмяОперации)
	
	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку("utf-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("Envelope", "http://schemas.xmlsoap.org/soap/envelope/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("soap", "http://schemas.xmlsoap.org/soap/envelope/");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("t", СхемаТипы);
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("m", СхемаСообщения);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Header", "http://schemas.xmlsoap.org/soap/envelope/");
	ЗаписьXML.ЗаписатьНачалоЭлемента("RequestServerVersion", СхемаТипы);
	ЗаписьXML.ЗаписатьАтрибут("Version", Строка(ВерсияСервера));
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "RequestServerVersion"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Header"
	ЗаписьXML.ЗаписатьНачалоЭлемента("Body", "http://schemas.xmlsoap.org/soap/envelope/");
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяОперации, СхемаСообщения);
	
	Возврат ЗаписьXML;
	
КонецФункции

// Закрывает запись SOAP запроса.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
// 
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция ЗаписьЗапросаЗакрыть(ЗаписьXML)
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяОперации"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Body"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Envelope"
	Запрос = ЗаписьXML.Закрыть();
	
	Возврат Запрос;
	
КонецФункции

// Записывает имя свойства элемента.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Свойство - Строка - Имя свойства.
//
Процедура ЗаписатьИмяСвойства(ЗаписьXML, Свойство);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("FieldURI", СхемаТипы);
	ЗаписьXML.ЗаписатьАтрибут("FieldURI", Свойство);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "FieldURI"
	
КонецПроцедуры

// Записывает форму списка свойства.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ИмяЭлемента - Строка - Имя элемента.
//  СписокСвойств - Строка - Список свойств.
//
Процедура ЗаписатьФормуСпискаСвойств(ЗаписьXML, ИмяЭлемента, СписокСвойств = Неопределено)
	
	Свойства = СтрРазделить(СписокСвойств, ";", Ложь);
	ЕстьСвойства = Свойства.Количество() <> 0;
	ЭтоФормаЭлемента = (ИмяЭлемента = "ItemShape");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента, СхемаСообщения);
	ЗаписьXML.ЗаписатьНачалоЭлемента("BaseShape", СхемаТипы);
	ЗаписьXML.ЗаписатьТекст("IdOnly");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "BaseShape"
	Если ЕстьСвойства Тогда
		Если ЭтоФормаЭлемента Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("BodyType", СхемаТипы);
			ЗаписьXML.ЗаписатьТекст("Text");
			ЗаписьXML.ЗаписатьКонецЭлемента(); // "BodyType"
		КонецЕсли;
		ЗаписьXML.ЗаписатьНачалоЭлемента("AdditionalProperties", СхемаТипы);
		Для Каждого Свойство Из Свойства Цикл
			ЗаписатьИмяСвойства(ЗаписьXML, Свойство);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "AdditionalProperties"
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяЭлемента"
	
КонецПроцедуры

// Записывает идентификаторы.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ИмяЭлемента - Строка - Имя элемента.
//  Идентификаторы - Массив, Строка - Массив идентификатор или строка предопредленной папки.
//
Процедура ЗаписатьИдентификаторы(ЗаписьXML, ИмяЭлемента, Идентификаторы)
	
	НесколькоЭлементов = ТипЗнч(Идентификаторы) = Тип("Массив");
	ТипЭлементаСтруктура = НесколькоЭлементов И Идентификаторы.Количество() <> 0
		И ТипЗнч(Идентификаторы[0]) = Тип("Структура");
		
	ТипЭлементаСоответствие = НесколькоЭлементов И Идентификаторы.Количество() <> 0
		И ТипЗнч(Идентификаторы[0]) = Тип("Соответствие");
		
	Если ТипЭлементаСтруктура И ИмяЭлемента = "ItemIds" Тогда
		ИмяИдентификатора = "OccurrenceItemId";
	ИначеЕсли ИмяЭлемента = "ItemIds" Тогда
		ИмяИдентификатора = "ItemId";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента, СхемаСообщения);
	Если НесколькоЭлементов Тогда
		Для Каждого Идентификатор Из Идентификаторы Цикл
			
			Если ТипЭлементаСоответствие Тогда
				
				НомерВхождения = Идентификатор["InstanceIndex"];
				ИмяИдентификатора = ?(НомерВхождения = Неопределено, "ItemId", "OccurrenceItemId");
			
				ЗаписатьИдентификатор(
					ЗаписьXML, 
					ИмяИдентификатора, 
					Идентификатор.Получить("Id"), 
					Идентификатор.Получить("ChangeKey"),
					НомерВхождения);
				
			ИначеЕсли ТипЭлементаСтруктура Тогда
				
				ЗаписатьИдентификатор(
					ЗаписьXML,
					ИмяИдентификатора,
					Идентификатор.ИдентификаторВладельца,
					Идентификатор.ОтпечатокОбъекта,
					Идентификатор.НомерВхождения);
					
			Иначе
				ЗаписатьИдентификатор(ЗаписьXML, ИмяИдентификатора, Идентификатор);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаписатьИдентификатор(ЗаписьXML, ИмяИдентификатора, Идентификаторы);
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяЭлемента"
	
КонецПроцедуры

// Записывает идентификаторы.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ИмяИдентификатора - Строка - Имя идентификатора.
//  Идентификаторы - Массив, Строка - Массив идентификатор или строка предопредленной папки.
//
Процедура ЗаписатьИдентификатор(ЗаписьXML, ИмяИдентификатора, Идентификатор, ВерсияДанных = Неопределено, НомерВхождения = Неопределено)
	
	ИмяСвойстваИдентификатора = ?(НомерВхождения = Неопределено, "Id", "RecurringMasterId");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяИдентификатора, СхемаТипы);
	ЗаписьXML.ЗаписатьАтрибут(ИмяСвойстваИдентификатора, XMLСтрока(Идентификатор));
	Если ЗначениеЗаполнено(ВерсияДанных) Тогда
		ЗаписьXML.ЗаписатьАтрибут("ChangeKey", XMLСтрока(ВерсияДанных));
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерВхождения) Тогда
		ЗаписьXML.ЗаписатьАтрибут("InstanceIndex", XMLСтрока(НомерВхождения));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяИдентификатора"
	
КонецПроцедуры

// Записывает значение.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Имя - Строка - Имя элемента.
//  Значение - Строка - Значение элемента.
//
Процедура ЗаписатьЗначениеMessages(ЗаписьXML, Имя, Значение)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя, СхемаСообщения);
	ЗаписьXML.ЗаписатьТекст(Значение);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Имя"
	
КонецПроцедуры

// Записывает значение.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Имя - Строка - Имя элемента.
//  Значение - Строка - Значение элемента.
//
Процедура ЗаписатьЗначениеTypes(ЗаписьXML, Имя, Значение, ИмяАтрибута = "", ЗначениеАтрибута = "")
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		XMLСтрока = ЗаписатьДатуJSON(Значение, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата);
	Иначе
		XMLСтрока = XMLСтрока(Значение);
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(Имя, СхемаТипы);
	Если ЗначениеЗаполнено(ИмяАтрибута) И ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
		ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, ЗначениеАтрибута);
	КонецЕсли;
	Если ЗначениеЗаполнено(XMLСтрока) Тогда
		ЗаписьXML.ЗаписатьТекст(XMLСтрока);
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Имя"
	
КонецПроцедуры

// Записывает состояние синхронизации.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  СостояниеСинхронизации - Строка - Состояние синхронизации.
//
Процедура ЗаписатьСостояниеСинхронизации(ЗаписьXML, СостояниеСинхронизации)
	
	Если ЗначениеЗаполнено(СостояниеСинхронизации) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SyncState", СхемаСообщения);
		ЗаписьXML.ЗаписатьТекст(СостояниеСинхронизации);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "SyncState"
	КонецЕсли;
	
КонецПроцедуры

// Записывает идентификаторы.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ИмяЭлемента - Строка - Имя элемента.
//
Процедура ЗаписатьИдентификаторПапкиКалендаря(ЗаписьXML, ИмяЭлемента)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента, СхемаСообщения);
	ЗаписатьИдентификатор(ЗаписьXML, "DistinguishedFolderId", "calendar");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяЭлемента"
	
КонецПроцедуры

// Записывает список свойств по умолчанию.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//
Процедура ЗаписатьСписокСвойствПоУмолчанию(ЗаписьXML)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ItemShape", СхемаСообщения);
	ЗаписьXML.ЗаписатьНачалоЭлемента("BaseShape", СхемаТипы);
	ЗаписьXML.ЗаписатьТекст("Default");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "BaseShape"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ИмяЭлемента"
	
КонецПроцедуры

// Записывает элементы.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ПорцияЭлементов - Массив - Порция элементов.
//
Процедура ЗаписатьЭлементы(ЗаписьXML, ПорцияЭлементов);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Items", СхемаСообщения);
	Для Каждого Элемент Из ПорцияЭлементов Цикл
		Если ТипЗнч(Элемент) = Тип("Структура") Тогда
			ЗаписатьЭлемент(ЗаписьXML, Элемент.Элемент);
		Иначе
			ЗаписатьЭлемент(ЗаписьXML, Элемент);
		КонецЕсли;
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Items"
	
КонецПроцедуры

// Записывает элемент.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Элемент - Соответствие - Элемент.
//
Процедура ЗаписатьЭлемент(ЗаписьXML, Элемент);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
	ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, "Subject");
	ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, "Start");
	ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, "End");
	ЗаписатьУчастниковЭлемента(ЗаписьXML, Элемент);
	ЗаписатьПомещенияЭлемента(ЗаписьXML, Элемент);
	ЗаписатьНастройкиПовторения(ЗаписьXML, Элемент);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	
КонецПроцедуры

Процедура ЗаписатьУчастниковЭлемента(ЗаписьXML, Элемент)
	
	ОбязательныеУчастники = Элемент.Получить("RequiredAttendees");
	НеОбязательныеУчастники = Элемент.Получить("OptionalAttendees");
	
	Если Не ЗначениеЗаполнено(ОбязательныеУчастники)
		И Не ЗначениеЗаполнено(НеОбязательныеУчастники) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЗначениеTypes(ЗаписьXML, "IsResponseRequested", Истина);
	Если ЗначениеЗаполнено(ОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("RequiredAttendees", СхемаТипы);
		Для Каждого Участник Из ОбязательныеУчастники Цикл
			ЗаписатьУчастника(ЗаписьXML, Участник);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "RequiredAttendees"
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НеОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("OptionalAttendees", СхемаТипы);
		Для Каждого Участник Из НеОбязательныеУчастники Цикл
			ЗаписатьУчастника(ЗаписьXML, Участник);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "OptionalAttendees"
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьПомещенияЭлемента(ЗаписьXML, Элемент)
		
	Помещения = Элемент.Получить("Resources");
	
	Если ЗначениеЗаполнено(Помещения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("Resources", СхемаТипы);
		Для Каждого Помещение Из Помещения Цикл
			ЗаписатьУчастника(ЗаписьXML, Помещение);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "Resources"
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьНастройкиПовторения(ЗаписьXML, Элемент)
		
	НастройкиПовторения = Элемент.Получить("Recurrence");
	
	Если ЗначениеЗаполнено(НастройкиПовторения) Тогда
		ЗаписатьНастройкиПовторенияПоСхеме(ЗаписьXML, НастройкиПовторения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьУчастника(ЗаписьXML, Участник)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Attendee", СхемаТипы);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Mailbox", СхемаТипы);
	ЗаписатьЗначениеTypes(ЗаписьXML, "EmailAddress", Участник);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Mailbox"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Attendee"

КонецПроцедуры

Процедура ЗаписатьНастройкиПовторенияПоСхеме(ЗаписьXML, НастройкиПовторения)
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Recurrence", СхемаТипы);
	
	Свойства = Фабрика.Тип(СхемаТипы, "RecurrenceType").Свойства;
	
	Для Каждого Свойство Из Свойства Цикл
		Значение = НастройкиПовторения[Свойство.Имя];
		Если ЗначениеЗаполнено(Значение) Тогда
			Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
				ЗаписьXML.ЗаписатьНачалоЭлемента(Свойство.Имя, СхемаТипы);
				СвойстваЭлемента = Свойство.Тип.Свойства;
				Для Каждого СвойствоЭлемента Из СвойстваЭлемента Цикл
					ЗначениеЭлемента = Значение[СвойствоЭлемента.Имя];
					Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
						ЗаписатьЗначениеTypes(ЗаписьXML, СвойствоЭлемента.Имя, ЗначениеЭлемента);					
					КонецЕсли; 
				КонецЦикла;
				ЗаписьXML.ЗаписатьКонецЭлемента(); // Свойство.Имя
			Иначе
				ЗаписатьЗначениеTypes(ЗаписьXML, Свойство.Имя, Значение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Recurrence"

КонецПроцедуры

// Записывает значение свойства элемента по имени, если оно передается.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Элемент - Соответствие - Элемент.
//  ИмяСвойства - Строка - Имя свойства элемента.
//
Процедура ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, ИмяСвойства)
	
	ЗначениеЭлемента = Элемент.Получить(ИмяСвойства);
	Если ЗначениеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЗначениеTypes(ЗаписьXML, ИмяСвойства, ЗначениеЭлемента);
	
КонецПроцедуры

// Записывает изменения элементов.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  ПорцияЭлементов - Массив - Порция элементов.
//
Процедура ЗаписатьИзмененияЭлементов(ЗаписьXML, ПорцияЭлементов);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ItemChanges", СхемаСообщения);
	Для Каждого Элемент Из ПорцияЭлементов Цикл
		ЗаписатьИзменениеЭлемента(ЗаписьXML, Элемент);
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ItemChanges"
	
КонецПроцедуры

// Записывает изменение элемента.
//
// Параметры:
//  ЗаписьXML - ЗаписьXML - Запись XML.
//  Элемент - Структура - Элемент
//
Процедура ЗаписатьИзменениеЭлемента(ЗаписьXML, Элемент);
	
	ИдентификаторЭлемента = Элемент.Получить("Id");
	Если ИдентификаторЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерВхождения = Элемент["InstanceIndex"];
	ИмяИдентификатора = ?(НомерВхождения = Неопределено, "ItemId", "OccurrenceItemId");
	ВерсияДанныхЭлемента = Элемент.Получить("ChangeKey");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ItemChange", СхемаТипы);
	ЗаписатьИдентификатор(ЗаписьXML, ИмяИдентификатора, ИдентификаторЭлемента, ВерсияДанныхЭлемента, НомерВхождения);
	ЗаписьXML.ЗаписатьНачалоЭлемента("Updates", СхемаТипы);
	ЗаписатьЗначениеИзмененияЭлемента(ЗаписьXML, Элемент, "item:Subject");
	ЗаписатьЗначениеИзмененияЭлемента(ЗаписьXML, Элемент, "calendar:Start");
	ЗаписатьЗначениеИзмененияЭлемента(ЗаписьXML, Элемент, "calendar:End");
	
	Если Элемент["ЭтоПриглашение"] = Неопределено Тогда
		ЗаписатьИзменениеУчастниковЭлемента(ЗаписьXML, Элемент);
		ЗаписатьИзменениеПомещенийЭлемента(ЗаписьXML, Элемент);
		ЗаписатьИзменениеНастроекПовторенияЭлемента(ЗаписьXML, Элемент);
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "Updates"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "ItemChange"
	
КонецПроцедуры

Процедура ЗаписатьИзменениеУчастниковЭлемента(ЗаписьXML, Элемент)
	
	ОбязательныеУчастники = Элемент.Получить("RequiredAttendees");
	НеОбязательныеУчастники = Элемент.Получить("OptionalAttendees");
	
	Если ЗначениеЗаполнено(ОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("DeleteItemField", СхемаТипы);
	КонецЕсли;
	
	ЗаписатьИмяСвойства(ЗаписьXML, "calendar:RequiredAttendees");
	Если ЗначениеЗаполнено(ОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
		ЗаписьXML.ЗаписатьНачалоЭлемента("RequiredAttendees", СхемаТипы);
		Для Каждого Участник Из ОбязательныеУчастники Цикл
			ЗаписатьУчастника(ЗаписьXML, Участник);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "RequiredAttendees"
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField" / DeleteItemField
	
	Если ЗначениеЗаполнено(НеОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("DeleteItemField", СхемаТипы);
	КонецЕсли;
	
	ЗаписатьИмяСвойства(ЗаписьXML, "calendar:OptionalAttendees");
	Если ЗначениеЗаполнено(НеОбязательныеУчастники) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
		ЗаписьXML.ЗаписатьНачалоЭлемента("OptionalAttendees", СхемаТипы);
		Для Каждого Участник Из НеОбязательныеУчастники Цикл
			ЗаписатьУчастника(ЗаписьXML, Участник);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "OptionalAttendees"
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField" / DeleteItemField
	
КонецПроцедуры

Процедура ЗаписатьИзменениеПомещенийЭлемента(ЗаписьXML, Элемент);
	
	Местоположение = Элемент.Получить("Location");
	Помещения = Элемент.Получить("Resources");
	
	Если ЗначениеЗаполнено(Местоположение) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("DeleteItemField", СхемаТипы);
	КонецЕсли;
	ЗаписатьИмяСвойства(ЗаписьXML, "calendar:Location");
	Если ЗначениеЗаполнено(Местоположение) Тогда 
		ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
		ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, "Location");
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField" / DeleteItemField
	
	Если ЗначениеЗаполнено(Помещения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("DeleteItemField", СхемаТипы);
	КонецЕсли;
	
	ЗаписатьИмяСвойства(ЗаписьXML, "calendar:Resources");
	Если ЗначениеЗаполнено(Помещения) Тогда
		ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Resources", СхемаТипы);
		Для Каждого Помещение Из Помещения Цикл
			ЗаписатьУчастника(ЗаписьXML, Помещение);
		КонецЦикла;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "Resources"
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField" / DeleteItemField
	
КонецПроцедуры

Процедура ЗаписатьИзменениеНастроекПовторенияЭлемента(ЗаписьXML, Элемент);
	
	Если Элемент.Получить("InstanceIndex") = Неопределено Тогда
		
		НастройкиПовторения = Элемент.Получить("Recurrence");
		Если ЗначениеЗаполнено(НастройкиПовторения) Тогда
			ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("DeleteItemField", СхемаТипы);
		КонецЕсли;
		
		ЗаписатьИмяСвойства(ЗаписьXML, "calendar:Recurrence");
		Если ЗначениеЗаполнено(НастройкиПовторения) Тогда 
			ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
			ЗаписатьНастройкиПовторенияПоСхеме(ЗаписьXML, НастройкиПовторения);
			ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
		КонецЕсли;
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField" / DeleteItemField
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьЗначениеИзмененияЭлемента(ЗаписьXML, Элемент, ПолноеИмяСвойства)
	
	ИмяСвойства = СтрРазделить(ПолноеИмяСвойства, ":")[1];
	
	ЗначениеЭлемента = Элемент.Получить(ИмяСвойства);
	Если ЗначениеЭлемента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("SetItemField", СхемаТипы);
	ЗаписатьИмяСвойства(ЗаписьXML, ПолноеИмяСвойства);
	ЗаписьXML.ЗаписатьНачалоЭлемента("CalendarItem", СхемаТипы);
	ЗаписатьЗначениеЭлемента(ЗаписьXML, Элемент, ИмяСвойства);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "CalendarItem"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "SetItemField"
	
КонецПроцедуры

// Формирует запрос получения доступности пользователей.
//
// Возвращаемое значение:
//  Строка - Запрос получения порции элементов.
//
Функция ЗапросДоступностьПользователей(ПочтовыеАдреса, ДатаНачала, ДатаОкончания)
	
	СмещениеСтандартногоВремениВМинутах = СмещениеСтандартногоВремени(ЧасовойПоясСеанса()) / 60;
	
	ЗаписьXML = ЗаписьЗапроса("GetUserAvailabilityRequest");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("TimeZone", СхемаТипы);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Bias", СмещениеСтандартногоВремениВМинутах);
	ЗаписьXML.ЗаписатьНачалоЭлемента("StandardTime", СхемаТипы);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Bias", 0);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Time", "02:00:00");
	ЗаписатьЗначениеTypes(ЗаписьXML, "DayOrder", 5);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Month", 10);
	ЗаписатьЗначениеTypes(ЗаписьXML, "DayOfWeek", "Sunday");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "StandardTime"
	ЗаписьXML.ЗаписатьНачалоЭлемента("DaylightTime", СхемаТипы);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Bias", 0);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Time", "02:00:00");
	ЗаписатьЗначениеTypes(ЗаписьXML, "DayOrder", 1);
	ЗаписатьЗначениеTypes(ЗаписьXML, "Month", 4);
	ЗаписатьЗначениеTypes(ЗаписьXML, "DayOfWeek", "Sunday");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "DaylightTime"
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "TimeZone"
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("MailboxDataArray", СхемаСообщения);
	Для Каждого ПочтовыйАдрес Из ПочтовыеАдреса Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("MailboxData", СхемаТипы);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Email", СхемаТипы);
		ЗаписатьЗначениеTypes(ЗаписьXML, "Address", ПочтовыйАдрес);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "Email"
		ЗаписатьЗначениеTypes(ЗаписьXML, "AttendeeType", "Required");
		ЗаписатьЗначениеTypes(ЗаписьXML, "ExcludeConflicts", Ложь);
		ЗаписьXML.ЗаписатьКонецЭлемента(); // "MailboxData"
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "MailboxDataArray"
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("FreeBusyViewOptions", СхемаТипы);
	ЗаписьXML.ЗаписатьНачалоЭлемента("TimeWindow", СхемаТипы);
	ЗаписатьЗначениеTypes(ЗаписьXML, "StartTime", ДатаНачала);
	ЗаписатьЗначениеTypes(ЗаписьXML, "EndTime", ДатаОкончания);
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "TimeWindow"
	ЗаписатьЗначениеTypes(ЗаписьXML, "RequestedView", "DetailedMerged"); //"MergedOnly");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // "FreeBusyViewOptions"
	
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросов

// Формирует запрос проверки автообнаружения.
//
// Возвращаемое значение:
//  Строка - Запрос проверки автообнаружения.
//
Функция ЗапросПроверкаСоединения()
	
	ЗаписьXML = ЗаписьЗапроса("GetFolder");
	ЗаписатьФормуСпискаСвойств(ЗаписьXML, "FolderShape");
	ЗаписатьИдентификаторПапкиКалендаря(ЗаписьXML, "FolderIds");
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

// Формирует запрос синхронизации элементов.
//
// Параметры:
//  СостояниеСинхронизации - Строка - Состояние синхронизации.
// 
// Возвращаемое значение:
//  Строка - Запрос синхронизации элементов.
//
Функция ЗапросСинхронизацияЭлементов(СостояниеСинхронизации = "")
	
	РазмерПорции = "500";
	
	ЗаписьXML = ЗаписьЗапроса("SyncFolderItems");
	ЗаписатьСписокСвойствПоУмолчанию(ЗаписьXML);
	ЗаписатьИдентификаторПапкиКалендаря(ЗаписьXML, "SyncFolderId");
	ЗаписатьСостояниеСинхронизации(ЗаписьXML, СостояниеСинхронизации);
	ЗаписатьЗначениеMessages(ЗаписьXML, "MaxChangesReturned", РазмерПорции);
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

// Формирует запрос получения порции элементов.
//
// Возвращаемое значение:
//  Строка - Запрос получения порции элементов.
//
Функция ЗапросПолучитьПорциюЭлементов(Идентификаторы)
	
	ЗаписьXML = ЗаписьЗапроса("GetItem");
	ЗаписатьФормуСпискаСвойств(ЗаписьXML, "ItemShape",
		"item:Subject;"
		+ "item:Body;"
		+ "calendar:UID;"
		+ "calendar:Start;"
		+ "calendar:End;"
		+ "calendar:IsAllDayEvent;"
		+ "calendar:LegacyFreeBusyStatus;"
		+ "calendar:CalendarItemType;"
		+ "calendar:Recurrence;"
		+ "calendar:ModifiedOccurrences;calendar:DeletedOccurrences;"
		+ "calendar:Location;"
		+ "calendar:RequiredAttendees;"
		+ "calendar:OptionalAttendees");
	ЗаписатьИдентификаторы(ЗаписьXML, "ItemIds", Идентификаторы);
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

// Формирует запрос создания порции элементов.
//
// Возвращаемое значение:
//  Строка - Запрос создания порции элементов.
//
Функция ЗапросСоздатьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения)
	
	SendMeetingInvitations = ?(ОтправлятьПриглашения, "SendToAllAndSaveCopy", "SendToNone");
	
	ЗаписьXML = ЗаписьЗапроса("CreateItem");
	ЗаписьXML.ЗаписатьАтрибут("SendMeetingInvitations", SendMeetingInvitations);
	ЗаписатьИдентификаторПапкиКалендаря(ЗаписьXML, "SavedItemFolderId");
	ЗаписатьЭлементы(ЗаписьXML, ПорцияЭлементов);
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

// Формирует запрос изменения порции элементов.
//
// Возвращаемое значение:
//  Строка - Запрос изменения порции элементов.
//
Функция ЗапросИзменитьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения, ОтправлятьВсем)
	
	Если Не ОтправлятьПриглашения Тогда
		SendMeetingInvitationsOrCancellations = "SendToNone";
	ИначеЕсли ОтправлятьПриглашения И ОтправлятьВсем Тогда
		SendMeetingInvitationsOrCancellations = "SendToAllAndSaveCopy";
	ИначеЕсли ОтправлятьПриглашения И Не ОтправлятьВсем Тогда
		SendMeetingInvitationsOrCancellations = "SendToChangedAndSaveCopy";
	КонецЕсли;
	
	ЗаписьXML = ЗаписьЗапроса("UpdateItem");
	ЗаписьXML.ЗаписатьАтрибут("MessageDisposition", "SendAndSaveCopy");
	ЗаписьXML.ЗаписатьАтрибут("ConflictResolution", "AlwaysOverwrite");
	ЗаписьXML.ЗаписатьАтрибут("SendMeetingInvitationsOrCancellations", SendMeetingInvitationsOrCancellations);
	ЗаписатьИдентификаторПапкиКалендаря(ЗаписьXML, "SavedItemFolderId");
	ЗаписатьИзмененияЭлементов(ЗаписьXML, ПорцияЭлементов);
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

// Формирует запрос удаления порции элементов.
//
// Возвращаемое значение:
//  Строка - Запрос удаления порции элементов.
//
Функция ЗапросУдалитьПорциюЭлементов(ПорцияЭлементов, ОтправлятьПриглашения)
	
	SendMeetingCancellations = ?(ОтправлятьПриглашения, "SendToAllAndSaveCopy", "SendToNone");
	
	ЗаписьXML = ЗаписьЗапроса("DeleteItem");
	ЗаписьXML.ЗаписатьАтрибут("DeleteType", "MoveToDeletedItems");
	ЗаписьXML.ЗаписатьАтрибут("SendMeetingCancellations", SendMeetingCancellations);
	ЗаписатьИдентификаторы(ЗаписьXML, "ItemIds", ПорцияЭлементов);
	Запрос = ЗаписьЗапросаЗакрыть(ЗаписьXML);
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти

#Область ОбработкаСоединения

// Получает прокси.
//
Функция Прокси()
	
	Протокол = ?(ИспользоватьЗащищенноеСоединение, "https", "http");
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси(Протокол);
	
	Возврат Прокси;
	
КонецФункции

// Устанавливает соединение.
//
Функция УстановитьСоединение(ВыполнятьПредварительнуюПроверкуСоединения)
	
	МаксимальноеКоличествоПопытокУстановкиСоединения = 10;
	НомерПопытки = 0;
	
	ВыполнитьПопыткуУстановкиСоединения = Истина;
	Пока ВыполнитьПопыткуУстановкиСоединения Цикл
		ВыполнитьПопыткуУстановкиСоединения = Ложь;
		НомерПопытки = НомерПопытки + 1;
		
		HTTPСоединение = Новый HTTPСоединение(
			Сервер,
			?(ЗначениеЗаполнено(Порт), Порт, Неопределено),
			?(ИспользоватьОлицетворение, "", ИмяПользователя),
			?(ИспользоватьОлицетворение, "", Пароль),
			Прокси(),
			Таймаут,
			?(ИспользоватьЗащищенноеСоединение, ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(), Неопределено),
			ИспользоватьАутентификациюОС);
		
		Если ВыполнятьПредварительнуюПроверкуСоединения Тогда
			Попытка
				Заголовки = Новый Соответствие;
				Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
				HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
				HTTPЗапрос.УстановитьТелоИзСтроки(ЗапросПроверкаСоединения(), КодировкаТекста.UTF8);
				Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
			Исключение
				Если МаксимальноеКоличествоПопытокУстановкиСоединения > НомерПопытки Тогда
					ВыполнитьПопыткуУстановкиСоединения = Истина;
				Иначе
					ВызватьИсключение;
				КонецЕсли;
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Сбрасывает соединение.
//
Функция СброситьСоединение()
	
	HTTPСоединение = Неопределено;
	
КонецФункции

#КонецОбласти

// Выполняет запись ошибки в журнал регистрации.
//
Процедура ЗаписьЖурналаРегистрацииОшибка(ТекстОшибки)
	
	СинхронизацияMSExchange.ЗаписьЖурналаРегистрацииОшибка(ТекстОшибки);
	
КонецПроцедуры

// Выполняет POST запрос к серверу Exchange.
//
// Параметры:
//  Запрос - Строка - Тело запроса.
//  СериализоватьОтвет - Булево - Выполнять XDTO сериализацию данных.
// 
// Возвращаемое значение:
//  HTTPОтвет - Результат запроса.
//
Функция ВыполнитьPOSTЗапрос(Запрос,
	СериализоватьОтвет = Истина,
	КэшироватьСоединение = Истина,
	ВыполнятьПредварительнуюПроверкуСоединения = Истина)
	
	// Подготовка запроса.
	Попытка
		
		Если Не КэшироватьСоединение Тогда
			СброситьСоединение();
		КонецЕсли;
		Если HTTPСоединение = Неопределено Тогда
			УстановитьСоединение(ВыполнятьПредварительнуюПроверкуСоединения);
		КонецЕсли;
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "text/xml; charset=utf-8");
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		HTTPЗапрос.УстановитьТелоИзСтроки(Запрос, КодировкаТекста.UTF8);
		
	Исключение
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка подготовки POST запроса: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрацииОшибка(ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	// Выполнение запроса.
	Попытка
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстЖурналаРегистрации = СтрШаблон(
			НСтр("ru = 'Ошибка выполнения POST запроса: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрацииОшибка(ТекстЖурналаРегистрации);
		
		ТекстОшибки = КодОшибкиРаботыСИнтернет + СтрШаблон(
			НСтр("ru = 'Ошибка выполнения POST запроса: %1'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	// Обработка ответа.
	Если СериализоватьОтвет Тогда
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Попытка
				
				ЭтоПоддерживаемоеСообщение = Ложь;
				
				СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
				ЧтениеXML=Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(СтрокаОтвета);
				Пока ЧтениеXML.Прочитать() Цикл
					Если ПоддерживаемыеОтветы.Найти(ЧтениеXML.ЛокальноеИмя) <> Неопределено Тогда
						Тип = Фабрика.Тип(СхемаСообщения, ЧтениеXML.ЛокальноеИмя + "Type");
						Ответ = Фабрика.ПрочитатьXML(ЧтениеXML, Тип);
						ЭтоПоддерживаемоеСообщение = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ЧтениеXML.Закрыть();
				
				Если Не ЭтоПоддерживаемоеСообщение Тогда
					ТекстОшибки = СтрШаблон(
						НСтр("ru = 'Ошибка выполнения POST запроса - ошибка разбора сообщения ответа.'",
							ОбщегоНазначения.КодОсновногоЯзыка()));
					ВызватьИсключение ТекстОшибки;
				КонецЕсли;
				
			Исключение
				ТекстИсключения = Новый Массив;
				ТекстИсключения.Добавить(КодОшибкиСериализацииXDTO + СтрШаблон(
					НСтр("ru = 'Ошибка выполнения POST запроса - ошибка сериализации XDTO: %1.'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
				ТекстИсключения.Добавить(">>>>>>>>>>>>>>");
				ТекстИсключения.Добавить(Запрос);
				ТекстИсключения.Добавить("<<<<<<<<<<<<<<");
				ТекстИсключения.Добавить(СтрокаОтвета);
				ТекстИсключения = СтрСоединить(ТекстИсключения, Символы.ПС);
				ВызватьИсключение ТекстИсключения;
			КонецПопытки
			
		Иначе
			
			ТекстИсключения = Неопределено;
			Если Ответ.КодСостояния = 401 Тогда
				ТекстИсключения = КодОшибкиАвторизации + НСтр("ru = 'Ошибка авторизации. Проверьте, корректно ли указаны имя пользователя и пароль.'");
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
				ТекстИсключения = КодОшибкиРесурсНеНайден + НСтр("ru = 'Ресурс не найден:
					|1. Проверьте, корректно ли указан сервер и адрес ресурса.
					|2. Проверьте, доступна ли пользователю Exchange работа с OWA и EWS.
					|3. Попробуйте зайти пользователем Exchange в OWA и повторите попытку.'");
			КонецЕсли;
			
			ТекстЖурналаРегистрации = Новый Массив;
			Если ЗначениеЗаполнено(ТекстИсключения) Тогда
				ТекстЖурналаРегистрации.Добавить(ТекстИсключения);
			КонецЕсли;
			ТекстЖурналаРегистрации.Добавить(СтрШаблон(
				НСтр("ru = 'Ошибка выполнения POST запроса - %1.'",
					ОбщегоНазначения.КодОсновногоЯзыка()),
					Ответ.КодСостояния));
			Попытка
				ТекстЖурналаРегистрации.Добавить(">>>>>>>>>>>>>>");
				ТекстЖурналаРегистрации.Добавить(Запрос);
				ТекстЖурналаРегистрации.Добавить("<<<<<<<<<<<<<<");
				ТекстЖурналаРегистрации.Добавить(Ответ.ПолучитьТелоКакСтроку());
			Исключение
				ТекстЖурналаРегистрации.Добавить(НСтр("ru = 'Не удалось получить подробности ошибки'",
					ОбщегоНазначения.КодОсновногоЯзыка())); 
			КонецПопытки;
			ТекстЖурналаРегистрации = СтрСоединить(ТекстЖурналаРегистрации, Символы.ПС);
			ЗаписьЖурналаРегистрацииОшибка(ТекстЖурналаРегистрации);
			
			Если Не ЗначениеЗаполнено(ТекстИсключения) Тогда
				ТекстИсключения = ТекстЖурналаРегистрации;
			КонецЕсли;
			
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

// Разбирает ответ на запрос проверки соединения с сервером.
//
// Параметры:
//  Ответ - Строка - Ответ на запрос проверки соединения.
// 
// Возвращаемое значение:
//  Булево - Есть соединение с сервером.
//
Функция ОтветПроверкаСоединения(Ответ)
	
	
	СообщениеОтвета = Ответ.ResponseMessages.GetFolderResponseMessage[0];
	Папка = ОпределитьПапку(СообщениеОтвета.Folders);
	ЕстьСоединениеССервером = ?(Папка <> Неопределено, Папка.FolderId.Id <> Неопределено, Ложь);
	
	Возврат ЕстьСоединениеССервером;
	
КонецФункции

// Определяет папку сообщения.
//
// Параметры:
//  Папки - ОбъектXDTO - Папки.
// 
// Возвращаемое значение:
//  ОбъектXDTO - Папка.
//
Функция ОпределитьПапку(Папки)
	
	Папка = Неопределено;
	Если Папки.CalendarFolder.Количество() <> 0 Тогда
		Папка = Папки.CalendarFolder[0];
	ИначеЕсли Папки.ContactsFolder.Количество() <> 0 Тогда
		Папка = Папки.ContactsFolder[0];
	ИначеЕсли Папки.Folder.Количество() <> 0 Тогда
		Папка = Папки.Folder[0];
	ИначеЕсли Папки.SearchFolder.Количество() <> 0 Тогда
		Папка = Папки.SearchFolder[0];
	ИначеЕсли Папки.TasksFolder.Количество() <> 0 Тогда
		Папка = Папки.TasksFolder[0];
	КонецЕсли;
	
	Возврат Папка;
	
КонецФункции

// Формирует текст ошибки.
Функция ТекстОшибки(ИнформацияОбОшибке)
	
	Перем КодИзвестнойОшибки;
	
	ЭтоИзвестнаяОшибка = Ложь;
	ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	Для Каждого КодИзвестнойОшибки Из КодыИзвестныхОшибок Цикл
		
		Если СтрНачинаетсяС(ТекстОшибки, КодИзвестнойОшибки) Тогда
			ЭтоИзвестнаяОшибка = Истина;
			ТекстОшибки = СтрЗаменить(ТекстОшибки, КодИзвестнойОшибки, "");
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЭтоИзвестнаяОшибка Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Разбирает ответ на запрос получения доступности пользователей.
//
// Параметры:
//  Ответ - Строка - Ответ на запрос получения порции элементов.
// 
// Возвращаемое значение:
//  Структура - Результат получения порции элементов.
//
Функция ОтветДоступностьПользователей(Ответ)
	
	ДоступностьПользователей = Новый Массив;
	
	Для Каждого ЭлементОтвета Из Ответ.FreeBusyResponseArray.FreeBusyResponse Цикл
		
		События = СинхронизацияКалендарей.НовоеОписаниеСобытийКалендаря();
		
		Если ЭлементОтвета.FreeBusyView.WorkingHours <> Неопределено Тогда // Это занятость помещения
		
			СмещениеПользователя = ЭлементОтвета.FreeBusyView.WorkingHours.TimeZone.Bias * 60;
			СмещениеСтандартногоВремени = СмещениеСтандартногоВремени(ЧасовойПоясСеанса());
			
			Смещение = 0;
			
			Если СмещениеПользователя < 0 Тогда
				Смещение = Смещение - СмещениеПользователя;
			Иначе	
			    Смещение = Смещение + СмещениеПользователя;
			КонецЕсли;
			
			Если СмещениеСтандартногоВремени < 0 Тогда
				Смещение = Смещение - СмещениеСтандартногоВремени;
			Иначе	
			    Смещение = Смещение + СмещениеСтандартногоВремени;
			КонецЕсли;
				
			Если ЭлементОтвета.FreeBusyView.CalendarEventArray <> Неопределено Тогда
			
				Для Каждого ЭлементЗанятости Из ЭлементОтвета.FreeBusyView.CalendarEventArray.CalendarEvent Цикл
			
					НоваяСтрока = События.Добавить();
					
					Если ЭлементЗанятости.CalendarEventDetails <> Неопределено Тогда
						НоваяСтрока.Наименование 	= ЭлементЗанятости.CalendarEventDetails.Subject;
						НоваяСтрока.Идентификатор   = ЭлементЗанятости.CalendarEventDetails.ID;
					КонецЕсли;
					
					НоваяСтрока.Описание 		= ЭлементЗанятости.BusyType;
					НоваяСтрока.ДатаНачала 		= ЭлементЗанятости.StartTime + Смещение;
					НоваяСтрока.ДатаОкончания 	= ЭлементЗанятости.EndTime + Смещение;
					
				КонецЦикла;
			
			КонецЕсли;
			
		
		КонецЕсли; 
		
		ДанныеДоступности = 
			Новый Структура("ДоступностьПодробно, ДоступностьСтрокой", 
							События,
							ЭлементОтвета.FreeBusyView.MergedFreeBusy); 
		
		ДоступностьПользователей.Добавить(ДанныеДоступности);
		
	КонецЦикла;
	
	Возврат ДоступностьПользователей;
	
КонецФункции

#КонецОбласти

#КонецЕсли