#Область СлужебныеПроцедурыИФункции

Функция НовоеОписаниеДокументаЗаявки() Экспорт
	
	ПоляОписания = 
	"ПроверятьСвязанныеЗаявки,
	|ДоступнаОтменаЗаявки,
	|ДокументыПоЗаявкеИмя,
	|ДокументыПоЗаявкеДокументИмя,
	|ВыводитьДокументыЗаявки,
	|ДоступноОтклонениеЗаявки,
	|ЭтоОтчетСотрудника";
	
	Описание = Новый Структура(ПоляОписания);
	
	Описание.ПроверятьСвязанныеЗаявки 	= Ложь;
	Описание.ДоступнаОтменаЗаявки 		= Ложь;
	Описание.ВыводитьДокументыЗаявки 	= Ложь;
	Описание.ДоступноОтклонениеЗаявки 	= Истина;
	Описание.ЭтоОтчетСотрудника 		= Ложь;
	
	Возврат Описание;

КонецФункции

#КонецОбласти