#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Количество() = 0 Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения = Ложь;
	
	ПланыОбменаРИБ = Новый Массив;
	
	ПланыОбменаПодсистемы = Новый Массив;
	ОбменДаннымиПереопределяемый.ПолучитьПланыОбмена(ПланыОбменаПодсистемы);
	
	Для Каждого МетаданныеПланаОбмена Из ПланыОбменаПодсистемы Цикл
		Если Не МетаданныеПланаОбмена.РаспределеннаяИнформационнаяБаза Тогда
			Продолжить;
		КонецЕсли;
		ПланыОбменаРИБ.Добавить(МетаданныеПланаОбмена.Имя);
	КонецЦикла;
	
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		
		СотрудникОбъект = ЗаписьНабора.Сотрудник.ПолучитьОбъект();
		Если СотрудникОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// При установки связи зарегистрируем изменения по физическому лицу
		Для Каждого ИмяПланаОбмена Из ПланыОбменаРИБ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "";
			Параметры = СинхронизацияДанныхЗарплатаКадрыСервер.ПараметрыОбработчикаПравилРегистрации(Запрос.Текст,
				Запрос.Параметры);
			Параметры.ИспользоватьКэш = Истина;
			Параметры.Вставить("ИмяПланаОбмена", ИмяПланаОбмена);
			СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоОрганизациям(
				СотрудникОбъект, ЗаписьНабора.Организация, Отказ, Параметры);
			
			Запрос.Текст = Параметры.ТекстЗапроса;
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "[УсловиеОтбораПоРеквизитуФлагу]", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СвойствоОбъекта_", "");
			Запрос.УстановитьПараметр(ИмяПланаОбмена + "ЭтотУзел", ПланыОбмена[ИмяПланаОбмена].ЭтотУзел());
			
			Если ПустаяСтрока(Запрос.Текст) Тогда
				Продолжить;
			КонецЕсли;
			Для Каждого Элемент Из Параметры.ПараметрыЗапроса Цикл
				Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;
			Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			Если Получатели.Количество() > 0 Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Получатели, ЗаписьНабора.Сотрудник);
				ОбновитьПовторноИспользуемыеЗначения = Истина;
				СинхронизацияДанныхЗарплатаКадрыСервер.ЗарегистрироватьСвязанныеРегистрыСведенийОбъекта(ИмяПланаОбмена,
					Отказ, ЗаписьНабора.Сотрудник, Ложь, Получатели);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ОбновитьПовторноИспользуемыеЗначения Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли