///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыОбновления;
		Элементы.ДекорацияОписаниеРезультата.Заголовок =
			НСтр("ru = 'Использование обработки недоступно при работе в модели сервиса.'");
		Элементы.ДекорацияКартинкаРезультат.Картинка   = БиблиотекаКартинок.Ошибка32;
		Элементы.КнопкаНазад.Видимость = Ложь;
		Элементы.КнопкаДалее.Видимость = Ложь;
	ИначеЕсли Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыОбновления;
		Элементы.ДекорацияОписаниеРезультата.Заголовок =
			НСтр("ru = 'Использование обработки доступно только для пользователей с полными правами.'");
		Элементы.ДекорацияКартинкаРезультат.Картинка   = БиблиотекаКартинок.Ошибка32;
		Элементы.КнопкаНазад.Видимость = Ложь;
		Элементы.КнопкаДалее.Видимость = Ложь;
	ИначеЕсли Не ОбщегоНазначения.ЭтоВебКлиент() Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыОбновления;
		Элементы.ДекорацияОписаниеРезультата.Заголовок =
			НСтр("ru = 'Использование обработки не доступно в веб-клиенте.'");
		Элементы.ДекорацияКартинкаРезультат.Картинка   = БиблиотекаКартинок.Ошибка32;
		Элементы.КнопкаНазад.Видимость = Ложь;
		Элементы.КнопкаДалее.Видимость = Ложь;
	Иначе
		УстановитьОтображениеЭлементовФормы(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлОбновленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр = НСтр("ru = 'Файл токенов'") + "(*.json)|*.json";
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ФайлОбновленияНачалоВыбораЗавершение",
		ЭтотОбъект);
	
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(
		ОписаниеОповещения,
		ДиалогВыбораФайла);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	#Если НЕ ВебКлиент Тогда
	
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.ОткрытьФайл(ФайлОбновления);
		Результат = ПрочитатьJSON(
			ЧтениеJSON,
			Ложь,
			"expirationTimestamp");
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыОбновления;
		
		Токены = Новый Соответствие;
		Попытка
			Для каждого ОписаниеТокена Из Результат.tokens Цикл
				ДанныеТокена = Новый Структура;
				ДанныеТокена.Вставить("Токен", ОписаниеТокена.tokenValue);
				ДанныеТокена.Вставить("ШтампИстечения", УниверсальноеВремя(ОписаниеТокена.expirationTimestamp));
				Токены.Вставить(ОписаниеТокена.serviceNick, ДанныеТокена);
			КонецЦикла;
		Исключение
			Элементы.ДекорацияОписаниеРезультата.Заголовок = ОбработкаОшибок.КраткоеПредставлениеОшибки(
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Элементы.ДекорацияКартинкаРезультат.Картинка = БиблиотекаКартинок.ВажноеСообщениеОшибка;			
			Возврат;
		КонецПопытки;
		
		ЗаписатьДанныеТокенов(Токены);
		
		УстановитьОтображениеЭлементовФормы(ЭтотОбъект);
		
	#Иначе
		ВызватьИсключение НСтр("ru = 'Использование обработки не доступно в веб-клиенте.'");
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборФайла;
	УстановитьОтображениеЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанныеТокенов(Знач Токены)
	
	УстановитьПривилегированныйРежим(Истина);
	Для каждого КлючЗначение Из Токены Цикл
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(
			ИнтернетПоддержкаПользователей.ИдентификаторПодсистемы(),
			КлючЗначение.Значение,
			КлючЗначение.Ключ);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Элементы.ДекорацияОписаниеРезультата.Заголовок = НСтр("ru = 'Токены успешно сохранены.'");
	ИнтернетПоддержкаПользователей.УстановитьСостояниеУспешно(
		Элементы.ДекорацияКартинкаРезультат.Картинка);

КонецПроцедуры

&НаКлиенте
Процедура ФайлОбновленияНачалоВыбораЗавершение(
		ВыбранныеФайлы,
		ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() <> 0 Тогда
		ФайлОбновления = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборФайла Тогда
		Элементы.КнопкаНазад.Видимость = Ложь;
		Элементы.КнопкаДалее.Видимость = Истина;
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРезультатыОбновления Тогда
		Элементы.КнопкаНазад.Видимость = Истина;
		Элементы.КнопкаДалее.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
