#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуДокументов(Параметры.ПервичныеДокументы);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = Новый Массив;
	Для Каждого ПараметрДокумент Из Параметры.ПервичныеДокументы Цикл
		ПараметрыРазмещения.Источники.Добавить(ПараметрДокумент.Предмет.Метаданные());
	КонецЦикла;
	ПараметрыРазмещения.Источники = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ПараметрыРазмещения.Источники);
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлектронныеДокументы

&НаКлиенте
Процедура ПервичныеДокументыПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКомандыКонецПроцедуры
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если Поле.Имя = "ПервичныеДокументыКомандаСформировать" Тогда
		
		КомандаПечати = КомандаПечатиПервичногоДокумента(ТекущиеДанные.ИдентификаторПечатнойФормы);
		Подключаемый_ВыполнитьКоманду(КомандаПечати);
		
	ИначеЕсли Поле.Имя = "ПервичныеДокументыКомандаПрикрепить" Тогда
		
		Меню = Новый СписокЗначений;
		Меню.Добавить("ИзКаталога", НСтр("ru='из каталога'"));
		Меню.Добавить("ИзПрисоединенныхФайлов", НСтр("ru='из присоединенных файлов'"));
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораВариантаПрикрепления", ЭтотОбъект), Меню, Элемент);
		
	ИначеЕсли Поле.Имя = "ПервичныеДокументыКомандаОткрыть" Тогда
		
		Если ЗначениеЗаполнено(ТекущиеДанные.АдресФайла) Тогда
			ПараметрыДокумента = Новый Структура;
			ПараметрыДокумента.Вставить("Заголовок", ТекущиеДанные.ИмяФайла);
			ПараметрыДокумента.Вставить("Данные", ТекущиеДанные.АдресФайла);
			ПроцессыОбработкиДокументовКлиент.ПоказатьТабличныйДокумент(Неопределено, ПараметрыДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ЗаполненныеДокументы = Новый Массив;
	
	Для Каждого ПрикладнойДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ПервичныйДокумент Из ПрикладнойДокумент.ПолучитьЭлементы() Цикл
			Если Не ЗначениеЗаполнено(ПервичныйДокумент.АдресФайла) Тогда
				ТекстСообщения = НСтр("ru='Прикреплены не все первичные документы'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
			ЗаполненныйДокумент = Новый Структура;
			ЗаполненныйДокумент.Вставить("Предмет", ПервичныйДокумент.Ссылка);
			ЗаполненныйДокумент.Вставить("ИдентификаторПечатнойФормы", ПервичныйДокумент.ИдентификаторПечатнойФормы);
			ЗаполненныйДокумент.Вставить("Шаблон", ПервичныйДокумент.Шаблон);
			ЗаполненныйДокумент.Вставить("ИдентификаторЭтапа", ПервичныйДокумент.ИдентификаторЭтапа);
			ЗаполненныйДокумент.Вставить("ИмяФайла", ПервичныйДокумент.ИмяФайла);
			ЗаполненныйДокумент.Вставить("Данные", ПервичныйДокумент.АдресФайла);
			ЗаполненныйДокумент.Вставить("ДанныеPDF", ПервичныйДокумент.АдресФайлаPDF);
			ЗаполненныеДокументы.Добавить(ЗаполненныйДокумент);
		КонецЦикла;
	КонецЦикла;
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ПервичныеДокументы", ЗаполненныеДокументы);
	
	Закрыть(ДанныеВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуДокументов(ПараметрДокументы)
	
	СтрокиДерева = ПервичныеДокументы.ПолучитьЭлементы();
	СтрокиДерева.Очистить();
	
	ТекущийПредмет = Неопределено;
	Для Каждого ПараметрДокумент Из ПараметрДокументы Цикл
		
		Если ТекущийПредмет <> ПараметрДокумент.Предмет Тогда
			
			ТекущийПредмет = ПараметрДокумент.Предмет;
			
			СтрокаПредмет = СтрокиДерева.Добавить();
			СтрокаПредмет.Ссылка = ПараметрДокумент.Предмет;
			СтрокаПредмет.ПредставлениеДокумента = Строка(ПараметрДокумент.Предмет);
			
			СтрокиПредмет = СтрокаПредмет.ПолучитьЭлементы();
			
		КонецЕсли;
		
		СтрокаПервичныйДокумент = СтрокиПредмет.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПервичныйДокумент, ПараметрДокумент);
		СтрокаПервичныйДокумент.Ссылка = ПараметрДокумент.Предмет;
		СтрокаПервичныйДокумент.ПредставлениеДокумента = ПараметрДокумент.ВидДокумента;
		СтрокаПервичныйДокумент.КомандаПрикрепить = НСтр("ru = 'Прикрепить'");
		СтрокаПервичныйДокумент.КомандаСформировать = НСтр("ru = 'Сформировать'");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция КомандаПечатиПервичногоДокумента(ИдентификаторПечатнойФормы)
	
	СтрокаПоиска = "__" + ИдентификаторПечатнойФормы;
	
	Для Каждого КомандаПечати Из ЭтотОбъект.Команды Цикл
		Если СтрЗаканчиваетсяНа(КомандаПечати.Имя, СтрокаПоиска) Тогда
			Возврат КомандаПечати;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПослеВыбораВариантаПрикрепления(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ИзКаталога" Тогда
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
		ПараметрыДиалога.Фильтр = НСтр("ru='Табличный документ '") + "(*.mxl)|*.mxl";
		
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ПервичныйДокументОкончаниеПомещенияФайла", ЭтотОбъект),
			,,, ПараметрыДиалога, ВладелецФормы.УникальныйИдентификатор);
		
	ИначеЕсли ВыбранныйЭлемент.Значение = "ИзПрисоединенныхФайлов" Тогда
		
		ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
		
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		
		МодульРаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(ТекущиеДанные.Ссылка, Элементы.ПервичныеДокументы, ,
			Новый ОписаниеОповещения("ПервичныйДокументОкончаниеВыбораФайла", ЭтотОбъект));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументОкончаниеПомещенияФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла <> Неопределено
		И Не ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
		ТекущиеДанные.ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		ТекущиеДанные.АдресФайла = ОписаниеПомещенногоФайла.Адрес;
		ТекущиеДанные.АдресФайлаPDF = АдресТабличногоДокументаPDF(
			ОписаниеПомещенногоФайла.Адрес, ВладелецФормы.УникальныйИдентификатор);
		ТекущиеДанные.КомандаОткрыть = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		ТекущиеДанные.КомандаПрикрепить = НСтр("ru = 'Заменить'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументОкончаниеВыбораФайла(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		Возврат;
	КонецЕсли;
	
	МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
	
	ДанныеФайла = МодульРаботаСФайламиКлиент.ДанныеФайла(
		ЗначениеВыбора, ВладелецФормы.УникальныйИдентификатор, Истина);
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	ТекущиеДанные.ИмяФайла = ДанныеФайла.ИмяФайла;
	ТекущиеДанные.АдресФайла = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
	ТекущиеДанные.АдресФайлаPDF = АдресТабличногоДокументаPDF(
		ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ВладелецФормы.УникальныйИдентификатор);
	ТекущиеДанные.КомандаОткрыть = ДанныеФайла.ИмяФайла;
	ТекущиеДанные.КомандаПрикрепить = НСтр("ru = 'Заменить'");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресТабличногоДокументаPDF(АдресТабличногоДокумента, УИДФормы)
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресТабличногоДокумента);
	ТабличныйДокумент = МодульУправлениеПечатью.ТабличныйДокументПоДвоичнымДанным(ДвоичныеДанные);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF_A_3);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, УИДФормы);
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.ПервичныеДокументы);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.ПервичныеДокументы);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.ПервичныеДокументы);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
