////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность 
//             электронного документооборота с контролирующими органами". 
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

Функция ТекстовоеПредставлениеРазмераФайла(РазмерВБайтах, Разрядность = 0) Экспорт
	
	Размер = 0;
	РазмерВКилобайтах = Окр(РазмерВБайтах / 1024, Разрядность);
	Если РазмерВБайтах < 1024 Тогда
		Размер = РазмерВБайтах;
		Шаблон = НСтр("ru = '%1 Б'");
	ИначеЕсли РазмерВКилобайтах < 1000 Тогда
		Размер = РазмерВКилобайтах;
		Шаблон = НСтр("ru = '%1 КБ'");
	Иначе
		Размер = Окр(РазмерВКилобайтах / 1024, Разрядность);
		Шаблон = НСтр("ru = '%1 МБ'");
	КонецЕсли;
	
	Возврат СтрШаблон(Шаблон, Размер);
	
КонецФункции

Функция ЗаменитьНечитаемыеСимволы(ИсходнаяСтрока, ЗаменятьНа = "_") Экспорт
	
	Возврат ОбщегоНазначенияЭДКОКлиентСерверПовтИсп.ЗаменитьНечитаемыеСимволы(ИсходнаяСтрока, ЗаменятьНа);
	
КонецФункции

Функция ЗаменитьЗапрещенныеСимволыВИмениФайла(ИсходнаяСтрока, ЗаменятьНа = "_") Экспорт
	
	Возврат ОбщегоНазначенияЭДКОКлиентСерверПовтИсп.ЗаменитьЗапрещенныеСимволыВИмениФайла(ИсходнаяСтрока, ЗаменятьНа);
	
КонецФункции

Функция НовыйИдентификатор() Экспорт
	
	Возврат НРег(СтрЗаменить(Новый УникальныйИдентификатор, "-", ""));
	
КонецФункции

Функция УникальнаяСтрока(ИсходнаяУникальнаяСтрока, МаксимальнаяДлина) Экспорт
	
	Результат = ЗаменитьЗапрещенныеСимволыВИмениФайла(ИсходнаяУникальнаяСтрока);
	
	Если СтрДлина(Результат) > МаксимальнаяДлина Тогда
		ЗавершающийИдентификатор = НовыйИдентификатор();
		ДлинаИдентификатора = СтрДлина(ЗавершающийИдентификатор);
		Возврат Лев(Результат, МаксимальнаяДлина - ДлинаИдентификатора) + ЗавершающийИдентификатор;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке) Экспорт
	
	Результат = ИнформацияОбОшибке;
	Если ИнформацияОбОшибке <> Неопределено Тогда
		Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
			Результат = ПолучитьИнформациюОбОшибке(ИнформацияОбОшибке.Причина);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриведеннаяВерсия(ПолнаяВерсия, КоличествоРазрядовВерсии) Экспорт
	
	Результат = "";
	КоличествоРазрядовРезультата = 0;
	
	РазрядыВерсии = СтрРазделить(ПолнаяВерсия, ".");
	Для каждого РазрядВерсии Из РазрядыВерсии Цикл
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(РазрядВерсии) Тогда
			Результат = Результат + ?(ЗначениеЗаполнено(Результат), ".", "") + РазрядВерсии;
			КоличествоРазрядовРезультата = КоличествоРазрядовРезультата + 1;
			Если КоличествоРазрядовРезультата >= КоличествоРазрядовВерсии Тогда
				Прервать;
			КонецЕсли;
			
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Пока КоличествоРазрядовРезультата < КоличествоРазрядовВерсии Цикл
			Результат = Результат + ".0";
			КоличествоРазрядовРезультата = КоличествоРазрядовРезультата + 1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПростоеСклонение(Знач Числ, Форма1, Форма2, Форма3) Экспорт
	
	Числ = ?(Числ < 0, -Числ, Числ) % 100;
	Числ1 = Числ % 10;
	Если (Числ > 10) И (Числ < 20) Тогда
		Возврат Форма3;
	КонецЕсли;
	Если (Числ1 > 1) И (Числ1 < 5) Тогда
		Возврат Форма2;
	КонецЕсли;
	Если (Числ1 = 1) Тогда 
		Возврат Форма1;
	КонецЕсли;
	
	Возврат Форма3;
	
КонецФункции

Функция ЭтоВерсия(СтрокаВерсии, КоличествоРазрядов = 4) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтрокаВерсии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЧастиВерсии = СтрРазделить(СтрокаВерсии, ".");
	Если ЧастиВерсии.Количество() <> КоличествоРазрядов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ЧастьВерсии Из ЧастиВерсии Цикл
		Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЧастьВерсии) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура СообщитьПользователю(ТекстСообщения, КлючДанных = Неопределено, Поле = "", ПутьКДанным = "") Экспорт
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		СчетчикЗапоминаниеОшибок = ДокументооборотСКОВызовСервера.ЗапоминаниеОшибок(,, Истина);
	#Иначе
		СчетчикЗапоминаниеОшибок = ДокументооборотСКОКлиент.ЗапоминаниеОшибок(,, Истина);
	#КонецЕсли
	
	Если СчетчикЗапоминаниеОшибок <> 0 Тогда
		ДлительнаяОтправкаКлиентСервер.ВывестиОшибку(ТекстСообщения);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, КлючДанных, Поле, ПутьКДанным);
	КонецЕсли;
	
КонецПроцедуры

Функция ВставитьВОбъект(ОбъектДляВставки, КлючИлиИндекс, Значение) Экспорт
	
	ОбъектДляВставки.Вставить(КлючИлиИндекс, Значение);
	Возврат ОбъектДляВставки;
	
КонецФункции

Функция ПервыйОбъект(ОбъектИлиОбъекты) Экспорт
	
	Возврат ?(ТипЗнч(ОбъектИлиОбъекты) = Тип("СписокXDTO") ИЛИ ТипЗнч(ОбъектИлиОбъекты) = Тип("Массив")
		ИЛИ ТипЗнч(ОбъектИлиОбъекты) = Тип("ФиксированныйМассив"), ОбъектИлиОбъекты[0], ОбъектИлиОбъекты);
	
КонецФункции

Функция ИсправитьРаскладку(СтрокаТекста) Экспорт
	
	РусскиеБуквы =
		"абвгде" + Символ(1105) + "жзийклмнопрстуфхцчшщъыьэюяАБВГДЕ" + Символ(1045) + "ЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ";
	РусскиеБуквыПриНевернойРаскладке = "f,dult`;pbqrkvyjghcnea[wxio]sm'.zF<DULT~:PBQRKVYJGHCNEA{WXIO}SM"">Z";
	
	Результат = "";
	Для НомерСимвола = 1 По СтрДлина(СтрокаТекста) Цикл
		СимволТекста = Сред(СтрокаТекста, НомерСимвола, 1);
		НомерБуквы = СтрНайти(РусскиеБуквыПриНевернойРаскладке, СимволТекста);
		Если НомерБуквы = 0 Тогда
			Результат = Результат + СимволТекста;
		Иначе
			Результат = Результат + Сред(РусскиеБуквы, НомерБуквы, 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокиДереваСПодчиненными(СтрокиДерева, ДополняемыеСтрокиДереваСПодчиненными = Неопределено) Экспорт
	
	Результат = ДополняемыеСтрокиДереваСПодчиненными;
	
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если ТипЗнч(СтрокаДерева) = Тип("ДанныеФормыЭлементДерева") Тогда
			ПодчиненныеСтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
			
		Иначе
			ДеревоВладелец = СтрокиДерева.Владелец();
			ИндексПустойКолонки = ДеревоВладелец.Колонки.Индекс("ПустаяДляПолучитьСтрокиДереваСПодчиненными");
			Если ИндексПустойКолонки = -1 Тогда
				ДеревоВладелец.Колонки.Добавить("ПустаяДляПолучитьСтрокиДереваСПодчиненными");
			КонецЕсли;
			ОтборПоПустой = Новый Структура("ПустаяДляПолучитьСтрокиДереваСПодчиненными", Неопределено);
			СтрокиСПодчиненными = СтрокиДерева.НайтиСтроки(ОтборПоПустой, Истина);
			ДеревоВладелец.Колонки.Удалить(ИндексПустойКолонки);
			Если ЗначениеЗаполнено(Результат) Тогда
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Результат, СтрокиСПодчиненными);
			Иначе
				Результат = СтрокиСПодчиненными;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Новый Массив;
		КонецЕсли;
		Результат.Добавить(СтрокаДерева);
		Результат = СтрокиДереваСПодчиненными(ПодчиненныеСтрокиДерева, Результат);
	КонецЦикла;
	
	Если Результат = Неопределено Тогда
		Результат = Новый Массив;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция ПервыеЗначенияИЕщеКоличествоОставшихся(
		МассивЗначений,
		МаксимальноеКоличествоПервых = 2,
		КоличествоВсехИлиФлагВсех = Неопределено) Экспорт
	
	КоличествоЗначений = ?(ЗначениеЗаполнено(МассивЗначений), МассивЗначений.Количество(), 0);
	
	Если КоличествоЗначений = 0 И КоличествоВсехИлиФлагВсех <> Истина Тогда
		Возврат ?(КоличествоВсехИлиФлагВсех = Неопределено, "", НСтр("ru = 'Выбрать'"));
		
	ИначеЕсли КоличествоВсехИлиФлагВсех <> Неопределено И КоличествоВсехИлиФлагВсех = Истина
		ИЛИ (ТипЗнч(КоличествоВсехИлиФлагВсех) = Тип("Число") И КоличествоЗначений >= КоличествоВсехИлиФлагВсех) Тогда
		Возврат НСтр("ru = 'Все'");
		
	ИначеЕсли МаксимальноеКоличествоПервых <= 0 Тогда
		Возврат Формат(КоличествоЗначений, "ЧДЦ=; ЧН=");
		
	ИначеЕсли КоличествоЗначений = 1 Тогда
		Возврат МассивЗначений[0];
		
	ИначеЕсли КоличествоЗначений = 2 И МаксимальноеКоличествоПервых >= 2 Тогда
		Возврат СтрШаблон(
			НСтр("ru = '%1 и %2'"),
			МассивЗначений[0],
			МассивЗначений[1]);
		
	Иначе
		КоличествоПервыхЗначений = ?(КоличествоЗначений <= МаксимальноеКоличествоПервых,
			КоличествоЗначений - 1, МаксимальноеКоличествоПервых);
		МассивПервыхЗначений = Новый Массив;
		Для ИндексМассива = 0 По КоличествоПервыхЗначений - 1 Цикл
			МассивПервыхЗначений.Добавить(МассивЗначений[ИндексМассива]);
		КонецЦикла;
		ПервыеЗначения = СтрСоединить(МассивПервыхЗначений, ", ");
		
		Если КоличествоЗначений <= МаксимальноеКоличествоПервых Тогда
			Возврат СтрШаблон(
				НСтр("ru = '%1 и %2'"),
				ПервыеЗначения,
				МассивЗначений[КоличествоЗначений - 1]);
			
		Иначе
			КоличествоОставшихсяЗначенийСтрокой = Формат(КоличествоЗначений - МаксимальноеКоличествоПервых, "ЧДЦ=; ЧН=");
			
			Возврат СтрШаблон(
				НСтр("ru = '%1 и еще %2'"),
				ПервыеЗначения,
				КоличествоОставшихсяЗначенийСтрокой);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция РазбитьПоСловам(ТекстСообщения, МаксимальнаяДлина = 110, МинимальнаяДлина = 73) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстСтроки", ТекстСообщения);
	Результат.Вставить("ОставшийсяТекст", "");
	
	Если СтрДлина(ТекстСообщения) > МаксимальнаяДлина Тогда
		НесокращаемыеРазделителиСлов = ",.!?:;-+*=)]}>|%&";
		РазделителиСлов = " " + Символы.ВК + Символы.ВТаб + Символы.НПП + Символы.ПС + Символы.ПФ + Символы.Таб
			+ НесокращаемыеРазделителиСлов;
		
		Результат.ТекстСтроки = Неопределено;
		Для ИндексПозиции = 0 По МаксимальнаяДлина - МинимальнаяДлина - 1 Цикл
			ПозицияСимвола = МаксимальнаяДлина - ИндексПозиции;
			СимволТекста = Сред(ТекстСообщения, ПозицияСимвола, 1);
			Если СтрНайти(РазделителиСлов, СимволТекста) <> 0 Тогда
				Если ПозицияСимвола = МаксимальнаяДлина Тогда
					СледующийСимволТекста = Сред(ТекстСообщения, ПозицияСимвола + 1, 1);
					Если СтрНайти(НесокращаемыеРазделителиСлов, СледующийСимволТекста) <> 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Результат.ТекстСтроки = Лев(ТекстСообщения, ПозицияСимвола);
				Результат.ТекстСтроки = СокрП(Результат.ТекстСтроки);
				Результат.ОставшийсяТекст = Сред(ТекстСообщения, ПозицияСимвола + 1);
				Результат.ОставшийсяТекст = СокрЛ(Результат.ОставшийсяТекст);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Результат.ТекстСтроки = Неопределено Тогда
			Результат.ТекстСтроки = Лев(ТекстСообщения, МаксимальнаяДлина);
			Результат.ТекстСтроки = СокрП(Результат.ТекстСтроки);
			Результат.ОставшийсяТекст = Сред(ТекстСообщения, МаксимальнаяДлина + 1);
			Результат.ОставшийсяТекст = СокрЛ(Результат.ОставшийсяТекст);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СоответствиеВДанныеФормыКоллекцию(Значение, Объект, ИмяКлюча) Экспорт
	
	Объект.Очистить();
	
	Если Значение <> Неопределено Тогда
		Для каждого КлючИЗначениеСоответствия Из Значение Цикл
			НоваяСтрока = Объект.Добавить();
			НоваяСтрока[ИмяКлюча] = КлючИЗначениеСоответствия.Ключ;
			Если КлючИЗначениеСоответствия.Значение <> Неопределено Тогда
				Для каждого КлючИЗначениеСтруктуры Из КлючИЗначениеСоответствия.Значение Цикл
					НоваяСтрока[КлючИЗначениеСтруктуры.Ключ] = КлючИЗначениеСтруктуры.Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ДанныеФормыКоллекцияВСоответствие(Объект, Колонки) Экспорт
	
	Результат = Новый Соответствие;
	
	Если Объект <> Неопределено Тогда
		МассивКолонок = СтрРазделить(Колонки, ",", Ложь);
		Если МассивКолонок.Количество() >= 2 Тогда
			Для ИндексКолонки = 0 По МассивКолонок.Количество() - 1 Цикл
				МассивКолонок[ИндексКолонки] = СокрЛП(МассивКолонок[ИндексКолонки]);
			КонецЦикла;
			ИмяКолонкиКлюча = МассивКолонок[0];
			МассивКолонок.Удалить(0);
			
			Для каждого ЭлементКоллекции Из Объект Цикл
				ЗначениеСоответствия = Новый Структура;
				Для каждого ИмяКолонки Из МассивКолонок Цикл
					ЗначениеСоответствия.Вставить(ИмяКолонки, ЭлементКоллекции[ИмяКолонки]);
				КонецЦикла;
				ИмяКлюча = ЭлементКоллекции[ИмяКолонкиКлюча];
				Результат[ИмяКлюча] = ЗначениеСоответствия;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьСписокЗначений(Приемник, Источник, Очистить = Истина) Экспорт
	
	Если Очистить Тогда
		Приемник.Очистить();
	КонецЕсли;
	
	Если Источник <> Неопределено Тогда
		Для каждого СтрокаИсточника Из Источник Цикл
			Приемник.Добавить(
				СтрокаИсточника.Значение,
				СтрокаИсточника.Представление,
				СтрокаИсточника.Пометка,
				СтрокаИсточника.Картинка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыгрузитьКлючСтруктуры(МассивСтруктур, Ключ) Экспорт
	
	Результат = Новый Массив;
	Если МассивСтруктур <> Неопределено И ЗначениеЗаполнено(Ключ) Тогда
		Для каждого СтрокаМассиваСтруктур Из МассивСтруктур Цикл
			Результат.Добавить(СтрокаМассиваСтруктур[Ключ]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьРегистрПодстроки(
		ИсходнаяСтрока,
		ИспользоватьВерхнийРегистр = Ложь,
		НачальныйНомер = 1,
		ЧислоСимволов = 1) Экспорт
	
	Если ИспользоватьВерхнийРегистр = Неопределено Тогда
		Результат = ИсходнаяСтрока;
		
	Иначе
		ИзменяемаяПодстрока = Сред(ИсходнаяСтрока, НачальныйНомер, ЧислоСимволов);
		Результат = Лев(ИсходнаяСтрока, НачальныйНомер - 1)
			+ ?(ИспользоватьВерхнийРегистр, ВРег(ИзменяемаяПодстрока), нрег(ИзменяемаяПодстрока))
			+ Сред(ИсходнаяСтрока, НачальныйНомер + ЧислоСимволов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти