
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора И Параметры.ЗакрыватьПриВыборе = Ложь Тогда
		Элементы.Список.МножественныйВыбор = Истина;
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АдресСпискаПодобранных") Тогда
		СписокПодобранных.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.АдресСпискаПодобранных));
	КонецЕсли;
	
	Если Параметры.Свойство("СтраховаяКомпания") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "СтраховаяКомпания", Параметры.СтраховаяКомпания);
	КонецЕсли;
	
	УстановитьСписокПодобранныхПрограмм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы
		И Элементы.Список.РежимВыбора
		И Элементы.Список.МножественныйВыбор
		И СписокПодобранных.Количество() > 0 Тогда
		
		Если ВыборПоменялся Тогда	
			Отказ = Истина;
			ЗадатьВопросОВыбореПодобранного();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Элементы.Список.РежимВыбора Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыборПоменялся = Истина;
		
		Если ТипЗнч(Значение) = Тип("Массив") Тогда
			СписокЗначений = Значение;
		Иначе
			СписокЗначений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Значение);
		КонецЕсли;
		
		Если СписокЗначений.Количество() > 0 Тогда
			
			Если Элементы.Список.МножественныйВыбор Тогда
				
				ОбновитьСписокПодобранных(СписокЗначений);
				Если СписокЗначений.Количество() > 1 Тогда
					Закрыть();
				КонецЕсли; 
				
			Иначе
				
				Если СписокПодобранных.НайтиПоЗначению(СписокЗначений[0]) = Неопределено Тогда
					ОповеститьОВыборе(СписокЗначений[0]);
				Иначе
					Закрыть();
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодтвердитьВыбор(Команда)
	
	ПодтвердитьВыборИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСписокПодобранныхПрограмм()
	
	ЭлементУсловногоОформления = Неопределено;
	Для каждого ЭлементОформления Из УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.Представление = НСтр("ru='Выделение подобранных'") Тогда
			ЭлементУсловногоОформления = ЭлементОформления;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементУсловногоОформления <> Неопределено Тогда
		ЭлементУсловногоОформления.Отбор.Элементы[0].ПравоеЗначение = СписокПодобранных;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокПодобранных(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		СписокЗначений = Значение;
	Иначе
		СписокЗначений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Значение);
	КонецЕсли;
	
	Для каждого ВыбранноеЗначение Из СписокЗначений Цикл
		НайденноеЗначение = СписокПодобранных.НайтиПоЗначению(ВыбранноеЗначение);
		Если НайденноеЗначение = Неопределено Тогда
			СписокПодобранных.Добавить(ВыбранноеЗначение);
		Иначе
			СписокПодобранных.Удалить(НайденноеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСписокПодобранныхПрограмм();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Выделяем группы
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Выделение подобранных'");
	
	Поля = Элемент.Поля.Элементы;
	Поля.Добавить().Поле = Новый ПолеКомпоновкиДанных("Список");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Ссылка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = Неопределено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОВыбореПодобранного()
	
	Оповещение = Новый ОписаниеОповещения("ЗадатьВопросОВыбореПодобранногоЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru='Выполнить выбор отобранных Программ медицинского страхования?'"), РежимДиалогаВопрос.ДаНетОтмена,);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросОВыбореПодобранногоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодтвердитьВыборИЗакрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		СписокПодобранных.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьВыборИЗакрыть()
	
	Оповестить("ПрограммыМедицинскогоСтрахованияОбработкаВыбораЗавершение", СписокПодобранных.ВыгрузитьЗначения());
	СписокПодобранных.Очистить();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
