#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуПримененияФорматов() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуПримененияФорматов();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2026_1";
	Стр.КНД = "1111059";
	Стр.ВерсияФормата = "5.02";
	
	Возврат Результат;
КонецФункции

Функция ДанноеУведомлениеДоступноДляОрганизации() Экспорт 
	Возврат Истина;
КонецФункции

Функция ДанноеУведомлениеДоступноДляИП() Экспорт 
	Возврат Ложь;
КонецФункции

Функция ПолучитьОсновнуюФорму() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьФормуПоУмолчанию() Экспорт 
	Возврат "";
КонецФункции

Функция ПолучитьТаблицуФорм() Экспорт 
	Результат = Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюТаблицуФормУведомления();
	
	Стр = Результат.Добавить();
	Стр.ИмяФормы = "Форма2026_1";
	Стр.ОписаниеФормы = "Форма дорожной карты по письму ФНС России от 08.12.2025 № ЕА-4-15/11056@ в формате 5.02";
	Стр.ДатаНачала = '20260901';
	Стр.ДатаКонца = '20991231';
	
	Возврат Результат;
КонецФункции

Функция ЭлектронноеПредставление(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт
	Если ИмяФормы = "Форма2026_1" Тогда
		Возврат ЭлектронноеПредставление_Форма2026_1(Объект, УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция СформироватьСписокЛистов(Объект) Экспорт
	Если Объект.ИмяФормы = "Форма2026_1" Тогда 
		Возврат СформироватьСписокЛистовФорма2026_1(Объект);
	КонецЕсли;
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу(Объект, ИмяФормы, УникальныйИдентификатор) Экспорт 
	Если ИмяФормы = "Форма2026_1" Тогда 
		Возврат ПроверитьДокументСВыводомВТаблицу_Форма2026_1(
			УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект), УникальныйИдентификатор);
	КонецЕсли;
КонецФункции

Функция ИдентификаторФайлаЭлектронногоПредставления(СведенияОтправки)
	Префикс = "UT_ZVREGETIL";
	Возврат Документы.УведомлениеОСпецрежимахНалогообложения.ИдентификаторФайлаЭлектронногоПредставления(Префикс, СведенияОтправки);
КонецФункции

Функция ПроверитьДокументСВыводомВТаблицу_Форма2026_1(Данные, УникальныйИдентификатор)
	ТаблицаОшибок = Новый СписокЗначений;
	УведомлениеОСпецрежимахНалогообложения.ПроверкаАктуальностиФормыПриВыгрузке(
		Данные.Объект.ИмяФормы, ТаблицаОшибок, ПолучитьТаблицуФорм());
	
	Титульная = Данные.ДанныеУведомления.Титульная;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКодаНО(Титульная.КодНО, ТаблицаОшибок, "Титульная");
	Если Не ЗначениеЗаполнено(Титульная.НаимОрг) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указано наименование организации", "Титульная", "НаимОрг"));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Титульная.ДАТА_ПОДПИСИ) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указана дата формирования документа", "Титульная", "ДАТА_ПОДПИСИ"));
	КонецЕсли;
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаИННКПП(Истина, Титульная, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаПодписантаНалоговойОтчетности(Данные, ТаблицаОшибок, "Титульная", Истина);
	Если Титульная.ПРИЗНАК_НП_ПОДВАЛ = "2" И Не ЗначениеЗаполнено(Титульная.НаимДок) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан документ подписанта", "Титульная", "НаимДок"));
	КонецЕсли;
	
	УведомлениеОСпецрежимахНалогообложения.ПроверитьАдресВМногостраничнойСтранице(ТаблицаОшибок, Данные.ДанныеУведомления.МестоНахож, "МестоНахож");
	УведомлениеОСпецрежимахНалогообложения.ПроверитьАдресВМногостраничнойСтранице(ТаблицаОшибок, Данные.ДанныеУведомления.АдрОсущ, "АдрОсущ");
	
	ВидДеят = Данные.ОТЧ.ПривестиЗначение(Титульная.ВидДеят);
	Если Не ЗначениеЗаполнено(Титульная.ВидДеят) Тогда 
		ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
			"Не указан код вида деятельности", "Титульная", "ВидДеят"));
	КонецЕсли;
	Если ВидДеят = 8 Тогда 
		СведСвидНефт = Данные.ДанныеУведомления.СведСвидНефт;
		Если Не ЗначениеЗаполнено(СведСвидНефт.РегНомНефт) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указан регистрационный номер свидетельства", "СведСвидНефт", "РегНомНефт"));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СведСвидНефт.ДатаСвидНефт) Тогда 
			ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
				"Не указана дата свидетельства", "СведСвидНефт", "ДатаСвидНефт"));
		КонецЕсли;
		УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКодаНО(СведСвидНефт.КодНОНефт, ТаблицаОшибок, "СведСвидНефт", "КодНОНефт");
	Иначе
		Если ВидДеят = 1 Тогда 
			ИмяТаблицы = "СведМощНеспирт";
		ИначеЕсли ВидДеят = 2 Тогда 
			ИмяТаблицы = "СведМощПарф";
		ИначеЕсли ВидДеят = 3 Тогда 
			ИмяТаблицы = "СведМощПарфМал";
		ИначеЕсли ВидДеят = 4 Тогда 
			ИмяТаблицы = "СведМощБыт";
		ИначеЕсли ВидДеят = 5 Тогда 
			ИмяТаблицы = "СведМощФарм";
		ИначеЕсли ВидДеят = 6 Тогда 
			ИмяТаблицы = "СведМощНепищ";
		ИначеЕсли ВидДеят = 7 Тогда 
			ИмяТаблицы = "СведМощКрас";
		Иначе
			ИмяТаблицы = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИмяТаблицы) Тогда 
			Если Не ЗначениеЗаполнено(Данные.ДанныеУведомления[ИмяТаблицы].ПоСост) Тогда 
				ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
					"Не указана дата", ИмяТаблицы, "ПоСост"));
			КонецЕсли;
			
			Для Каждого Стр Из Данные.ДанныеМногостраничныхРазделов["СведПодр" + Титульная.ВидДеят] Цикл 
				УведомлениеОСпецрежимахНалогообложенияСлужебный.ПроверкаКПП(Стр.Значение, ТаблицаОшибок, "СведПодр" + Титульная.ВидДеят, "КПП", Истина);
				УведомлениеОСпецрежимахНалогообложения.ПроверитьАдресВМногостраничнойСтранице(ТаблицаОшибок, Стр.Значение, "СведПодр" + Титульная.ВидДеят);
			КонецЦикла;
			
			Для Каждого Итер Из СтрРазделить("1,,2", ",", Истина) Цикл 
				ИмяМнг = ИмяТаблицы + "Мнг" + Итер;
				Если Данные.ДанныеДопСтрокБД.Свойство(ИмяМнг) Тогда 
					Таблица = Данные.ДанныеДопСтрокБД[ИмяМнг];
					ИмяКолонки = ?(Таблица.Колонки.Найти("РеквДокПроиз") = Неопределено, "РеквДокЭтил", "РеквДокПроиз");
					Инд = 0;
					Для Каждого Стр Из Таблица Цикл 
						Инд = Инд + 1;
						
						Если Не ЗначениеЗаполнено(Стр[ИмяКолонки]) Тогда 
							ТаблицаОшибок.Добавить(Документы.УведомлениеОСпецрежимахНалогообложения.ПолучитьПустуюСтруктуруНавигацииПоОшибкам(
								"Не указан документ", ИмяТаблицы, ИмяКолонки + "___" + Инд, Стр["УИД"]));
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УведомлениеОСпецрежимахНалогообложения.ПроверкаДатВУведомлении(Данные, ТаблицаОшибок);
	УведомлениеОСпецрежимахНалогообложения.ПолнаяПроверкаЗаполненныхПоказателейНаСоотвествиеСписку(
		"СпискиВыбора2026_1", "СхемаВыгрузкиФорма2026_1", Данные.Объект.ИмяОтчета, ТаблицаОшибок, Данные);
	Возврат ТаблицаОшибок;
КонецФункции

Функция ОсновныеСведенияЭлектронногоПредставления(Объект, УникальныйИдентификатор)
	ОсновныеСведения = Документы.УведомлениеОСпецрежимахНалогообложения.НачальнаяИнициализацияОбщихРеквизитовВыгрузки(Объект);
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	Возврат ОсновныеСведения;
КонецФункции

Процедура ДополнитьПараметры_Форма2026_1(ДанныеУведомления)
	Титульная = ДанныеУведомления.ДанныеУведомления.Титульная;
	
	Для Каждого Элт Из СтрРазделить("МестоНахож,АдрОсущ", ",") Цикл 
		ИмяТаблицы = Элт + "Здание";
		ДанныеУведомления.ДанныеДопСтрокБД.Вставить(ИмяТаблицы, Новый ТаблицаЗначений);
		ДанныеУведомления.ДанныеДопСтрокБД[ИмяТаблицы].Колонки.Добавить("Аддр_ЗданиеТип");
		ДанныеУведомления.ДанныеДопСтрокБД[ИмяТаблицы].Колонки.Добавить("Аддр_ЗданиеНомер");
		ЛистТек = ДанныеУведомления.ДанныеУведомления[Элт];
		Для Ит = 1 По 3 Цикл 
			НовСтр = ДанныеУведомления.ДанныеДопСтрокБД[ИмяТаблицы].Добавить();
			НовСтр.Аддр_ЗданиеТип = ЛистТек["Аддр_ЗданиеТип" + Ит];
			НовСтр.Аддр_ЗданиеНомер = ЛистТек["Аддр_ЗданиеНомер" + Ит];
		КонецЦикла;
	КонецЦикла;
	
	ДанныеУведомления.ДанныеДопСтрокБД.Вставить("СведПодрЗдание", Новый ТаблицаЗначений);
	СведПодрЗдание = ДанныеУведомления.ДанныеДопСтрокБД.СведПодрЗдание;
	СведПодрЗдание.Колонки.Добавить("УИД");
	СведПодрЗдание.Колонки.Добавить("Аддр_ЗданиеТип");
	СведПодрЗдание.Колонки.Добавить("Аддр_ЗданиеНомер");
	Для Инд = 1 По 7 Цикл 
		Для Каждого Стр Из ДанныеУведомления.ДанныеМногостраничныхРазделов["СведПодр" + Инд] Цикл 
			ЛистТек = Стр.Значение;
			Для Ит = 1 По 3 Цикл 
				НовСтр = СведПодрЗдание.Добавить();
				НовСтр.УИД = ЛистТек["УИД"];
				НовСтр.Аддр_ЗданиеТип = ЛистТек["Аддр_ЗданиеТип" + Ит];
				НовСтр.Аддр_ЗданиеНомер = ЛистТек["Аддр_ЗданиеНомер" + Ит];
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

Функция ЭлектронноеПредставление_Форма2026_1(Объект, УникальныйИдентификатор)
	СведенияЭлектронногоПредставления = УведомлениеОСпецрежимахНалогообложения.СведенияЭлектронногоПредставления();
	ДанныеУведомления = УведомлениеОСпецрежимахНалогообложения.ДанныеУведомленияДляВыгрузки(Объект);
	ДополнитьПараметры_Форма2026_1(ДанныеУведомления);
	Ошибки = ПроверитьДокументСВыводомВТаблицу_Форма2026_1(ДанныеУведомления, УникальныйИдентификатор);
	УведомлениеОСпецрежимахНалогообложения.СообщитьОшибкиПриПроверкеВыгрузки(Объект, Ошибки, ДанныеУведомления);
	
	ОсновныеСведения = ОсновныеСведенияЭлектронногоПредставления(Объект, УникальныйИдентификатор);
	ОсновныеСведения.Вставить("ВидДеят", ДанныеУведомления.ДанныеУведомления.Титульная.ВидДеят);
	
	СтруктураВыгрузки = Документы.УведомлениеОСпецрежимахНалогообложения.ИзвлечьСтруктуруXMLУведомления(Объект.ИмяОтчета, "СхемаВыгрузкиФорма2026_1");
	УведомлениеОСпецрежимахНалогообложения.ТиповоеЗаполнениеДанными(ДанныеУведомления, ОсновныеСведения, СтруктураВыгрузки);
	УведомлениеОСпецрежимахНалогообложения.ВыгрузитьДеревоВТаблицу(СтруктураВыгрузки, ОсновныеСведения, СведенияЭлектронногоПредставления);
	Возврат СведенияЭлектронногоПредставления;
КонецФункции

Функция СформироватьСписокЛистовФорма2026_1(Объект) Экспорт
	Возврат УведомлениеОСпецрежимахНалогообложения.ПечатьВСледующихВерсиях(Объект);
КонецФункции

#КонецОбласти

#КонецЕсли
