
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьНастройки();
	
	НастроитьОтображениеЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантИнтерфейсаПриИзменении(Элемент)

	ВыбранЛегкийВариантИнтерфейса = (ВариантИнтерфейса = ДоступныеДляВыбораВариантыИнтерфейсаЭДО().Легкий);
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	МодульИнтерфейсДокументовЭДОКлиент.ИзменитьВариантИнтерфейсаПользователя(ВыбранЛегкийВариантИнтерфейса);
	
	ВариантИнтерфейсаПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдалениеДокументыПриИзменении(Элемент)
	
	ПоказыватьПомеченныеНаУдалениеДокументыПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПредпросмотрДокументовПриИзменении(Элемент)
	
	ПоказыватьПредпросмотрДокументовПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьТрафикЭлектронныхДокументовПриИзменении(Элемент)
	
	ПоказыватьТрафикЭлектронныхДокументовПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборочныйОбменДокументамиПоОрганизациямПриИзменении(Элемент)

	МодульИнтерфейсДокументовЭДОВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОВызовСервера");

	МодульИнтерфейсДокументовЭДОВызовСервера.УстановитьОтправкуПолучениеСОтборомПоОрганизации(
		ВключенВыборочныйОбменДокументамиПоОрганизациям);
	Оповестить("УстановитьОтправкуПолучениеСОтборомПоОрганизации", ВключенВыборочныйОбменДокументамиПоОрганизациям);
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());

КонецПроцедуры

&НаКлиенте
Процедура ПакетноеОтображениеПриИзменении(Элемент)
	
	ПакетноеОтображениеПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьУсловныеОбозначенияПриИзменении(Элемент)
	
	ПоказыватьУсловныеОбозначенияПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияКИсполнениюПриИзменении(Элемент)
	
	РежимОтображенияПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияМоиДокументыПриИзменении(Элемент)
	
	РежимОтображенияПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтображенияВсеДокументыПриИзменении(Элемент)
	
	РежимОтображенияПриИзмененииНаСервере();
	
	МодульИнтерфейсДокументовЭДОКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиент");
	
	Оповестить(МодульИнтерфейсДокументовЭДОКлиент.ИмяСобытияИзмененияНастроекТекущихДелЭДО());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиЭлектроннойПодписиИШифрования(Команда)
	
	ЭлектроннаяПодписьКлиент.ОткрытьНастройкиЭлектроннойПодписиИШифрования();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройки()
	
	ЕстьОбменСКонтрагентами = ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСКонтрагентами");
	
	ДоступноИзменениеВариантаИнтерфейса = Ложь;
	Если ЕстьОбменСКонтрагентами Тогда
		ДоступноИзменениеВариантаИнтерфейса = Истина;
	КонецЕсли;
	
	ВыбранЛегкийВариантИнтерфейса = Ложь;
	Если ДоступноИзменениеВариантаИнтерфейса Тогда
		МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
		ВыбранЛегкийВариантИнтерфейса = МодульИнтерфейсДокументовЭДО.ВыбранЛегкийВариантИнтерфейса();
		ВариантИнтерфейса = ?(ВыбранЛегкийВариантИнтерфейса, 
			ДоступныеДляВыбораВариантыИнтерфейсаЭДО().Легкий, 
			ДоступныеДляВыбораВариантыИнтерфейсаЭДО().Расширенный);
	КонецЕсли;
	
	Если ЕстьОбменСКонтрагентами Тогда
		МодульИнтерфейсДокументовЭДОКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиентСервер");
		ПоказыватьПомеченныеНаУдалениеДокументы = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			МодульИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
			"ОтображатьУдаленные", Ложь);
		
		МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
		ИмяФормыТекущихДел = МодульИнтерфейсДокументовЭДО.ПутьКФормеТекущихДелЭДО();
		ПоказыватьПредпросмотрДокументов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(ИмяФормыТекущихДел, 
			"ПоказыватьОбластьПросмотра", Истина);

		ПоказыватьТрафикЭлектронныхДокументов =
			МодульИнтерфейсДокументовЭДО.ИспользуетсяПоказТрафикаЭлектронныхДокументов();
			
		МодульИнтерфейсДокументовЭДОВызовСервера = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДОВызовСервера");
		ВключенВыборочныйОбменДокументамиПоОрганизациям = 
			МодульИнтерфейсДокументовЭДОВызовСервера.ИспользуетсяОтправкаПолучениеСОтборомПоОрганизации() = Истина;
			
		РежимОтображенияФормыРасширенногоИнтерфейса = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ИмяФормыТекущихДел, "РежимОтображения", "ВсеДокументы");
		
		ПоказыватьСвязьДокументовВПакетыФормыРасширенногоИнтерфейса = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ИмяФормыТекущихДел, "ПакетноеОтображение", Истина);
		
		ПоказыватьУсловныеОбозначенияФормыРасширенногоИнтерфейса = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			ИмяФормыТекущихДел, "ПоказыватьОбластьЛегенды", Ложь);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьОтображениеЭлементовФормы()
	
	ЕстьПравоВыполненияОбмена = Ложь;
	Если ЕстьОбменСКонтрагентами Тогда
		МодульСинхронизацияЭДО = ОбщегоНазначения.ОбщийМодуль("СинхронизацияЭДО");
		ЕстьПравоВыполненияОбмена = МодульСинхронизацияЭДО.ЕстьПравоВыполненияОбмена();
	КонецЕсли;
	
	Элементы.ГруппаИнтерфейс.Видимость = ЕстьОбменСКонтрагентами;
	Элементы.ВыборочныйОбменДокументамиПоОрганизациям.Видимость = ЕстьПравоВыполненияОбмена;
	
	Элементы.ГруппаВариантИнтерфейса.Видимость = ДоступноИзменениеВариантаИнтерфейса;
	Элементы.ДекорацияОтступ3.Видимость = ДоступноИзменениеВариантаИнтерфейса;
	
	ЭтоИнтерфейс85 = ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5();
	
	Элементы.ПоказыватьТрафикЭлектронныхДокументов.Видимость =
		ВариантИнтерфейса = ДоступныеДляВыбораВариантыИнтерфейсаЭДО().Легкий;
		
	Если ЭтоИнтерфейс85 Тогда
		Элементы.ДекорацияНастройкиТекущихДелЭДО.Шрифт = ШрифтыСтиля.ЗаголовокВторогоУровня;
		Элементы.ДекорацияНастройкиТекущихДелЭДО.Заголовок = НСтр("ru = 'Настройки главного окна ЭДО:'");
	КонецЕсли;
	
	Элементы.ГруппаНастройкиФормыРасширенногоИнтерфейса.Видимость = ЭтоИнтерфейс85
		И ВариантИнтерфейса = ДоступныеДляВыбораВариантыИнтерфейсаЭДО().Расширенный;
		
	Элементы.РежимОтображенияМоиДокументы.Видимость = Ложь;
	
	// СтандартныеПодсистемы.ЭлектроннаяПодпись
	Элементы.НастройкиЭлектроннойПодписиИШифрования.Видимость =
		ПравоДоступа("СохранениеДанныхПользователя", Метаданные);
	// Конец СтандартныеПодсистемы.ЭлектроннаяПодпись
	
КонецПроцедуры

&НаСервере
Процедура ВариантИнтерфейсаПриИзмененииНаСервере()
	
	ЗаполнитьНастройки();
	
	НастроитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьПомеченныеНаУдалениеДокументыПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДОКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДОКлиентСервер");
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		МодульИнтерфейсДокументовЭДОКлиентСервер.КлючОбъектаНастроекИнтерфейсаЭДО(),
		"ОтображатьУдаленные", ПоказыватьПомеченныеНаУдалениеДокументы);
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьПредпросмотрДокументовПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
	
	ИмяФормыТекущихДел = МодульИнтерфейсДокументовЭДО.ПутьКФормеТекущихДелЭДО();
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормыТекущихДел,
		"ПоказыватьОбластьПросмотра", ПоказыватьПредпросмотрДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьТрафикЭлектронныхДокументовПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДОВызовСервера = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДОВызовСервера");
	
	МодульИнтерфейсДокументовЭДОВызовСервера.СохранитьИспользованиеПоказаТрафикаЭлектронныхДокументовПоУмолчанию(
		ПоказыватьТрафикЭлектронныхДокументов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДоступныеДляВыбораВариантыИнтерфейсаЭДО()
	ВариантыИнтерфейсаЭДО = Новый Структура;
	ВариантыИнтерфейсаЭДО.Вставить("Легкий", НСтр("ru = 'Легкий'"));
	ВариантыИнтерфейсаЭДО.Вставить("Расширенный", НСтр("ru = 'Расширенный'"));
	Возврат ВариантыИнтерфейсаЭДО;
КонецФункции

&НаСервере
Процедура ПакетноеОтображениеПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
	ИмяФормыТекущихДел = МодульИнтерфейсДокументовЭДО.ПутьКФормеТекущихДелЭДО();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормыТекущихДел, "ПакетноеОтображение",
		ПоказыватьСвязьДокументовВПакетыФормыРасширенногоИнтерфейса);
	
КонецПроцедуры

&НаСервере
Процедура ПоказыватьУсловныеОбозначенияПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
	ИмяФормыТекущихДел = МодульИнтерфейсДокументовЭДО.ПутьКФормеТекущихДелЭДО();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормыТекущихДел, "ПоказыватьОбластьЛегенды",
		ПоказыватьУсловныеОбозначенияФормыРасширенногоИнтерфейса);
	
КонецПроцедуры

&НаСервере
Процедура РежимОтображенияПриИзмененииНаСервере()
	
	МодульИнтерфейсДокументовЭДО = ОбщегоНазначения.ОбщийМодуль("ИнтерфейсДокументовЭДО");
	ИмяФормыТекущихДел = МодульИнтерфейсДокументовЭДО.ПутьКФормеТекущихДелЭДО();
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(ИмяФормыТекущихДел, "РежимОтображения",
		РежимОтображенияФормыРасширенногоИнтерфейса);
	
КонецПроцедуры

#КонецОбласти
