#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ

Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Взыскания.Наименование
		|ИЗ
		|	Справочник.Взыскания КАК Взыскания";
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	
	КлассификаторТаблица = ДанныеКлассификатора();
	
	Для каждого СтрокаКлассификатора Из КлассификаторТаблица Цикл
		Если ТаблицаСуществующих.Найти(СтрокаКлассификатора.Наименование, "Наименование") = Неопределено Тогда
			СправочникОбъект = Справочники.Взыскания.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора);
			СправочникОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеКлассификатора()
	
	КлассификаторТаблица = Новый ТаблицаЗначений;
	КлассификаторТаблица.Колонки.Добавить("Код");
	КлассификаторТаблица.Колонки.Добавить("Наименование");
	КлассификаторТаблица.Колонки.Добавить("ВидВзыскания");
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Прогул'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Систематические опоздания на работу'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Нарушение распорядка трудового дня'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Неподчинение действующим распоряжениям руководства фирмы'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Появление на работе в состоянии алкогольного, наркотического или иного токсического опьянения'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Разглашение коммерческой тайны или персональных данных другого работника'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Хищение чужого имущества, его растрата или хищение'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Нарушение требований охраны труда'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Предоставление подложных документов при заключении трудового договора'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Увольнение;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Отсутствие на работе или рабочем месте без уважительной причины'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Выговор;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Отказ без уважительной причины от выполнения трудовых обязанностей в связи с изменением в установленном порядке норм труда'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Выговор;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Отказ или уклонение без уважительных причин от медицинского освидетельствования'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Выговор;
	
	НоваяСтрокаКлассификатора = КлассификаторТаблица.Добавить();
	НоваяСтрокаКлассификатора.Наименование = НСтр("ru = 'Отказ от прохождения обязательного специального обучения и сдачи экзаменов по охране труда, технике безопасности и правилам эксплуатации'");
	НоваяСтрокаКлассификатора.ВидВзыскания = Перечисления.ВидВзыскания.Выговор;
	
	Возврат КлассификаторТаблица;
	
КонецФункции

#КонецОбласти

#КонецОбласти


#КонецЕсли