
#Область ОписаниеПеременных

&НаКлиенте
Перем ВнутренниеДанные, ОписаниеДанных, ТекущийСписокПредставлений, РежимВыбораДолжности;

&НаКлиенте
Перем ТребуетсяВводПароля, ПарольПроверенРанее, СохраняемоеЗначениеПароля;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Операция;
	
	ЭлементПредставлениеДанных = Элементы.ПредставлениеДанных;
	Если ЗначениеЗаполнено(Параметры.ЗаголовокДанных) Тогда
		ЭлементПредставлениеДанных.Заголовок = Параметры.ЗаголовокДанных;
	Иначе
		ЭлементПредставлениеДанных.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	ПредставлениеДанных = Параметры.ПредставлениеДанных;
	ЭлементПредставлениеДанных.Гиперссылка = Параметры.ПредставлениеДанныхОткрывается;
	
	Если Не ЗначениеЗаполнено(ПредставлениеДанных) Тогда
		ЭлементПредставлениеДанных.Видимость = Ложь;
	КонецЕсли;
	
	Пользователь = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВнутренниеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ОчиститьПеременныеФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеДанныхНажатие(Элемент, СтандартнаяОбработка)
	
	ЭлектроннаяПодписьСлужебныйКлиент.ПредставлениеДанныхНажатие(ЭтотОбъект,
		Элемент, СтандартнаяОбработка, ТекущийСписокПредставлений);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДолжностьСписок

&НаКлиенте
Процедура ДолжностьСписокПриАктивизацииСтроки(Элемент)
	
	Для Каждого ЭлементСписка Из ДолжностьСписок Цикл
		ЭлементСписка.Пометка = Ложь;
	КонецЦикла;
	
	ТекущиеДанные = Элементы.ДолжностьСписок.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ВыделенныйЭлемент = ДолжностьСписок.НайтиПоЗначению(ТекущиеДанные.Значение);
		Если ВыделенныйЭлемент <> Неопределено Тогда
			ВыделенныйЭлемент.Пометка = Истина;
		КонецЕсли;
		ДолжностьВыбор = ТекущиеДанные.Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подписать(Команда)
	
	Если РежимВыбораДолжности
		И Элементы.ДолжностьВыбор.СписокВыбора.Количество() > 0
		И НЕ ЗначениеЗаполнено(ДолжностьВыбор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать должность'"), , "ДолжностьВыбор");
		Возврат;
	КонецЕсли;

	СвойстваПользователя = СвойстваПользователяИБ(Пользователь);
	
	ПодписаниеУспешно = НЕ ТребуетсяВводПароля ИЛИ ПарольПроверенРанее ИЛИ ПарольПроверенУспешно(СвойстваПользователя.ИдентификаторПользователяИБ);
	
	Если НЕ ПодписаниеУспешно Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Указан неверный пароль'"), , "Пароль");
		Возврат;
	КонецЕсли;
		
	Для Каждого ЭлементДанных Из ОписаниеДанных.НаборДанных Цикл
		СвойстваПодписи = Новый Структура;
		СвойстваПодписи.Вставить("ДатаПодписи", ОбщегоНазначенияКлиент.ДатаСеанса());
		СвойстваПодписи.Вставить("ВладелецПодписи", ПолноеИмя);
		Если РежимВыбораДолжности Тогда
			Если ЗначениеЗаполнено(ДолжностьВыбор) Тогда
				СвойстваПодписи.Вставить("Организация", ДолжностьВыбор.Организация);
				СвойстваПодписи.Вставить("Должность", ДолжностьВыбор.Должность);
			Иначе
				СвойстваПодписи.Вставить("Организация", Организация);
				СвойстваПодписи.Вставить("Должность", "");
			КонецЕсли;
		ИначеЕсли ЭлементДанных.Владелец <> Неопределено Тогда
			ВладелецДанных = ЭлементДанных.Владелец;
			Если ТипЗнч(ЭлементДанных.Владелец) = Тип("ДокументСсылка.ФормулярПервичногоДокументаПОД")
				ИЛИ ТипЗнч(ЭлементДанных.Владелец) = Тип("ДокументСсылка.ПредставлениеФормуляраПервичногоДокументаПОД") Тогда
				ВладелецДанных = ЭлементДанных.Предмет;
			КонецЕсли;	
			СвойстваПодписи.Вставить("Организация",
				ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности[ВладелецДанных].Организация);
			СвойстваПодписи.Вставить("Должность",
				ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности[ВладелецДанных].Должность);
		Иначе
			СвойстваПодписи.Вставить("Организация",
				ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности[ЭлементДанных.Ссылка].Организация);
			СвойстваПодписи.Вставить("Должность",
				ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности[ЭлементДанных.Ссылка].Должность);
		КонецЕсли;
		СвойстваПодписи.Вставить("УстановившийПодпись", Пользователь);
		ЭлементДанных.Вставить("СвойстваПодписи", СвойстваПодписи);
	КонецЦикла;
	
	Если ТребуетсяВводПароля Тогда
		ИмяПараметра = "ПроцессыОбработкиДокументов.ПарольПростойЭлектроннойПодписиПроверен";
		ПараметрыПриложения.Вставить(ИмяПараметра, ЗапомнитьПароль);
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьОткрытие(Оповещение, КлиентскиеПараметры) Экспорт
	
	ОписаниеДанных = КлиентскиеПараметры.ОписаниеДанных;
	ТекущийСписокПредставлений = КлиентскиеПараметры.ТекущийСписокПредставлений;
	
	ВнутренниеДанные = Новый Соответствие;
	
	СвойстваПользователя = СвойстваПользователяИБ(Пользователь);
	ТребуетсяВводПароля = СвойстваПользователя.ТребуетсяВводПароля;
	СохраняемоеЗначениеПароля = СвойстваПользователя.СохраняемоеЗначениеПароля;
	
	ПарольПроверенРанее = Ложь;
	
	Если ТребуетсяВводПароля Тогда
		
		ИмяПараметра = "ПроцессыОбработкиДокументов.ПарольПростойЭлектроннойПодписиПроверен";
		Если ПараметрыПриложения[ИмяПараметра] <> Неопределено Тогда
			ПарольПроверенРанее = ПараметрыПриложения[ИмяПараметра];
		КонецЕсли;
		
		ЗапомнитьПароль = ПарольПроверенРанее;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Пароль", "ТолькоПросмотр", ПарольПроверенРанее);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЗапомнитьПароль", "ТолькоПросмотр", ПарольПроверенРанее);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Пароль", "Видимость", ТребуетсяВводПароля И НЕ ПарольПроверенРанее);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗапомнитьПароль", "Видимость", ТребуетсяВводПароля И НЕ ПарольПроверенРанее);
	
	ПолноеИмя = ОписаниеДанных.СведенияДляПростойПодписи.ПолноеИмя;
	
	РежимВыбораДолжности = Ложь;
	РежимВыбораСписок = Ложь;
	
	Для Каждого Сведение Из ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности Цикл
		Если ТипЗнч(Сведение.Значение) <> Тип("Массив") Тогда
			Прервать;
		КонецЕсли;
		РежимВыбораДолжности = Истина;
		Для Каждого ОрганизацияИДолжность Из Сведение.Значение Цикл
			Элементы.ДолжностьВыбор.СписокВыбора.Добавить(ОрганизацияИДолжность,
				ОрганизацияИДолжность.Должность + ", " + ОрганизацияИДолжность.Организация);
		КонецЦикла;
		Если Элементы.ДолжностьВыбор.СписокВыбора.Количество() = 1 Тогда
			ДолжностьВыбор = Элементы.ДолжностьВыбор.СписокВыбора[0].Значение;
		ИначеЕсли Элементы.ДолжностьВыбор.СписокВыбора.Количество() > 1 Тогда
			Для Каждого ЭлементВыбора Из Элементы.ДолжностьВыбор.СписокВыбора Цикл 
				ДолжностьСписок.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			КонецЦикла;
			РежимВыбораСписок = Истина;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	
	Если НЕ РежимВыбораДолжности Тогда
		Должности = Новый Массив;
		Для Каждого Сведение Из ОписаниеДанных.СведенияДляПростойПодписи.ОрганизацииИДолжности Цикл
			Должности.Добавить(Сведение.Значение.Должность);
		КонецЦикла;
		Должности = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Должности);
		Должность = СтрСоединить(Должности, "; ");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Должность", "Видимость", НЕ РежимВыбораДолжности);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДолжностьВыбор", "Видимость", РежимВыбораДолжности И НЕ РежимВыбораСписок);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДолжностьСписок", "Видимость", РежимВыбораСписок);
	
	Открыть();
	
	Если Не Открыта() Тогда
		ОчиститьПеременныеФормы();
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПеременныеФормы()
	
	ТекущийСписокПредставлений = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваПользователяИБ(Пользователь)
	
	Результат = Новый Структура("ТребуетсяВводПароля, СохраняемоеЗначениеПароля, ИдентификаторПользователяИБ", Ложь, "", "");
	
	ИдентификаторПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	Результат.ИдентификаторПользователяИБ = ИдентификаторПользователя;
	
	УстановитьПривилегированныйРежим(Истина);
	СвойстваПользователя = Пользователи.СвойстваПользователяИБ(ИдентификаторПользователя);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СвойстваПользователя <> Неопределено Тогда
		Результат.ТребуетсяВводПароля = СвойстваПользователя.АутентификацияСтандартная И СвойстваПользователя.ПарольУстановлен;
		Результат.СохраняемоеЗначениеПароля = СвойстваПользователя.СохраняемоеЗначениеПароля;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПарольПроверенУспешно(ИдентификаторПользователя)
	Результат = СтарыйПарольСовпадаетССохраненным(ИдентификаторПользователя);

	Возврат Результат;
КонецФункции

&НаСервере
Функция СтарыйПарольСовпадаетССохраненным(ИдентификаторПользователя)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = ПользователиСлужебный.СтарыйПарольСовпадаетССохраненным(
		Пароль, ИдентификаторПользователя);
		
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат Результат;
КонецФункции

#КонецОбласти
