
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Корректировка
	УстановитьКорректировкуИПР();
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтотОбъект, ЗначенияДляЗаполнения);
		ПриПолученииДанныхНаСервере();
		Если ЗначениеЗаполнено(Объект.Основание) И Не Параметры.Свойство("СкорректированныйИПР") Тогда
			ЗаполнитьПоДаннымОснования();
		КонецЕсли;
	КонецЕсли;
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьУсловноеОформление();
	УстановитьВидимостьОснования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	СвойствоНеПроверятьСтатус = "НеПроверятьСтатус";
	Если ПараметрыЗаписи.Свойство(СвойствоНеПроверятьСтатус) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ХарактеристикиПерсоналаФормы.ПеренестиХарактеристикиВТабличнуюЧасть(ТекущийОбъект.РазвиваемыеХарактеристики,
		Характеристики, ЗначенияХарактеристики);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИспользуютсяЦелиРазвития() Тогда
		ЗагрузитьЦелиМероприятия(ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПроверитьПериодыМероприятийПланаРазвития(Отказ, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбработатьОповещениеДокументаОбучения(ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "Запись_ИндивидуальныйПланРазвития" И Объект.Ссылка <> Источник Тогда
		УстановитьКорректировкуИПР();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьКорректировкуИПР();
	
	Если ИспользуютсяЦелиРазвития() И Объект.ИспользоватьПрогрессРазвития Тогда
		РегистрыСведений.ПрогрессОбученияСотрудников.ВнестиПрогрессОбучения(
			ТекущийОбъект.Ссылка, ТекущийОбъект.Владелец, ПолучитьИзВременногоХранилища(АдресПрогрессаМероприятий));
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РазвернутьДерево();
	
	Если ЗначениеЗаполнено(Объект.СкорректированныйИПР) Тогда
		ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ДополнитьХарактеристики();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборИзПодразделения = ОтборИзПодразделения(Объект.Подразделение);
	
	Если ОтборИзПодразделения.Свойство("Организация") И ЗначениеЗаполнено(ОтборИзПодразделения.Организация) Тогда
		Организация = ОтборИзПодразделения.Организация;
	Иначе
		Организация = Неопределено;
	КонецЕсли;
	Если ОтборИзПодразделения.Свойство("Подразделение") И ЗначениеЗаполнено(ОтборИзПодразделения.Подразделение) Тогда
		Подразделение = ОтборИзПодразделения.Подразделение;
	Иначе
		Подразделение = Неопределено;
	КонецЕсли;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.Владелец,
		Организация,
		Подразделение, Объект.ДатаНачала,
		Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаВыбораФизическогоЛица(ВыбранноеЗначение);
	ДополнитьХарактеристики();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Объект.Владелец = Неопределено;
	ДополнитьХарактеристики();
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	ЕстьЗаполненныеДанные = (Объект.Мероприятия.Количество() > 0
		Или Объект.ДействияСотрудников.Количество() > 0
		Или Объект.РазвиваемыеХарактеристики.Количество() > 0);
	
	Если ЕстьЗаполненныеДанные Тогда
		ТекстВопроса = НСтр("ru = 'Заполнить ИПР по данным основания?'");
		ОбработчикОповещенияОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымОснованияЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОбработчикОповещенияОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,
			НСтр("ru = 'Продолжить?'"));
	Иначе
		ЗаполнитьПоДаннымОснованияЗавершение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицыСтраницаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ЭтотОбъект.ПараметрыСвойств.Свойство(ТекущаяСтраница.Имя)
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Если Объект.Мероприятия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьПланОбученияПериодами();
	
КонецПроцедуры

&НаКлиенте
Процедура ЕстьНаставникПриИзменении(Элемент)
	ВключитьНаставника(ЭтотОбъект, Объект.ЕстьНаставник);
КонецПроцедуры

&НаКлиенте
Процедура ЕстьКураторПриИзменении(Элемент)
	ВключитьКуратора(ЭтотОбъект, Объект.ЕстьКуратор);
КонецПроцедуры

&НаКлиенте
Процедура НаставникОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		Объект.Наставник = ФизическоеЛицоСотрудника(ВыбранноеЗначение);
	Иначе
		Объект.Наставник = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаставникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элемент,,, Объект.ДатаНачала, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КураторОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		Объект.Куратор = ФизическоеЛицоСотрудника(ВыбранноеЗначение);
	Иначе
		Объект.Куратор = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КураторНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элемент,,, Объект.ДатаНачала, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрогрессПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПланРазвития.ТекущиеДанные;
	Если Параметры.Ключ.Пустая() Тогда
		ТекущиеДанные[Элемент.Имя] = ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка");
		ВызватьИсключение НСтр("ru = 'Внесение прогресса развития возможно только после записи ИПР.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные[Элемент.Имя]) Тогда
		ТаблицаЗначенийПрогресса = ТаблицаЗначенийПрогресса();
		Для Номер = 1 По Объект.ПродолжительностьПрогрессаРазвития Цикл
			ИмяПрогресса = "Прогресс" + Номер;
			ЗначениеПрогресса = ТекущиеДанные[ИмяПрогресса];
			Если ЗначениеПрогресса = ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка") Тогда
				Продолжить;
			КонецЕсли;
			Если Элемент.Имя = ИмяПрогресса  Тогда
				Если Номер = Объект.ПродолжительностьПрогрессаРазвития Тогда
					Прервать;
				КонецЕсли;
				ИмяПрогресса = "Прогресс" + (Номер + 1);
				ЗначениеПрогресса = ТекущиеДанные[ИмяПрогресса];
				Если ЗначениеПрогресса <> ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка")
					И ТаблицаЗначенийПрогресса.Получить(ТекущиеДанные[Элемент.Имя])
						> ТаблицаЗначенийПрогресса.Получить(ЗначениеПрогресса) Тогда
					ТекущиеДанные[Элемент.Имя] = ЗначениеПрогресса;
				КонецЕсли;
				Прервать;
			КонецЕсли;
			ПоследнийПрогрессМероприятия = ЗначениеПрогресса;
		КонецЦикла;
		Если ЗначениеЗаполнено(ПоследнийПрогрессМероприятия)
			И ТаблицаЗначенийПрогресса.Получить(ТекущиеДанные[Элемент.Имя])
			< ТаблицаЗначенийПрогресса.Получить(ПоследнийПрогрессМероприятия) Тогда
			ТекущиеДанные[Элемент.Имя] = ПоследнийПрогрессМероприятия;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПроцентВыполненияПланаРазвития();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрогрессНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	ЗначенияПрогрессаОбучения = ЗначенияПрогрессаОбученияНаСервере();
	Для Каждого Значение Из ЗначенияПрогрессаОбучения Цикл
		Элемент.СписокВыбора.Добавить(Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СкорректированныйИПР", Объект.Ссылка);
	ПараметрыФормы.Вставить("ЗначениеКопирования", Объект.Ссылка);
	
	ОткрытьФорму("Справочник.ИндивидуальныйПланРазвития.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаОткрытьНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СкорректированныйИПР)
		И Не ЗначениеЗаполнено(СкорректированныйИПР) Тогда
		СкорректированныйИПР = Объект.СкорректированныйИПР;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СкорректированныйИПР) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", СкорректированныйИПР);
	ОткрытьФорму("Справочник.ИндивидуальныйПланРазвития.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьПланаРазвитияПриИзменении(Элемент)
	
	Если Объект.Мероприятия.Количество() > 0
		И ПланРазвития.ПолучитьЭлементы().Количество() = 0
		И ВидимостьПланаРазвития Тогда
		ПоказатьВопросИспользованияПланаРазвития();
	Иначе
		УстановитьВидимостьПланаРазвития();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМероприятия

&НаКлиенте
Процедура МероприятияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьХарактеристикиМероприятия(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	ОткрытьДокументОбучение(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ДатаНачала = Объект.ДатаНачала;
		Элемент.ТекущиеДанные.ДатаОкончания = Объект.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРезультатОбучения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияМероприятиеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВторичныеДанныеОбученияНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
	ОчиститьРезультатыОбучения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияДатаНачалаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьРезультатыОбучения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияДатаОкончанияПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьРезультатыОбучения(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура МероприятияРезультатВыполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачатьРедактированиеРезультатаВыполнения(Элемент.ТекстРедактирования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристики

&НаКлиенте
Процедура ХарактеристикиТребуетсяОбучениеПриИзменении(Элемент)
	
	ХарактеристикиТребуетсяОбучениеПриИзмененииНаКлиенте();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоХарактеристик

&НаКлиенте
Процедура ДеревоХарактеристикТребуетсяОбучениеПриИзменении(Элемент)
	
	ХарактеристикиТребуетсяОбучениеПриИзмененииНаКлиенте();
	
	ТекущиеДанные = Элементы.ДеревоХарактеристик.ТекущиеДанные;
	Характеристика = ТекущиеДанные.Характеристика;
	ТребуетсяОбучение = ТекущиеДанные.ТребуетсяОбучение;
	
	УстановитьТребуетсяОбучениеВДереве(ДеревоХарактеристик.ПолучитьЭлементы(), Характеристика,
		ТребуетсяОбучение);
	УстановитьТребуетсяОбучениеДляХарактеристикиВТаблице(Характеристика, ТребуетсяОбучение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПланРазвития

&НаКлиенте
Процедура ПланРазвитияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "ПланРазвитияЦель" Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(Элементы.ПланРазвития.ТекущиеДанные.Мероприятие) Тогда
			ПараметрыФормы = Новый Структура("Ключ", Элементы.ПланРазвития.ТекущиеДанные.Мероприятие);
			ОткрытьФорму("Справочник.МероприятияОбученияРазвития.ФормаОбъекта", ПараметрыФормы);
		ИначеЕсли ЗначениеЗаполнено(Элементы.ПланРазвития.ТекущиеДанные.Цель) Тогда
			ПараметрыФормы = Новый Структура("Ключ", Элементы.ПланРазвития.ТекущиеДанные.Цель);
			ОткрытьФорму("Справочник.ЦелиРазвития.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ПланРазвитияОбучение"
		И ЗначениеЗаполнено(Элементы.ПланРазвития.ТекущиеДанные.Мероприятие) Тогда
		ОткрытьДокументОбучение(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРазвитияРезультатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачатьРедактированиеРезультатаВыполнения(Элемент.ТекстРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланРазвитияПослеУдаления(Элемент)
	ЗаполнитьПроцентВыполненияПланаРазвития();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИнтервал(Команда)
	
	ПараметрПериода = Новый СтандартныйПериод;
	ПараметрПериода.ДатаНачала = Объект.ДатаНачала;
	ПараметрПериода.ДатаОкончания = Объект.ДатаОкончания;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = ПараметрПериода;
	Диалог.Показать(Новый ОписаниеОповещения("РедактироватьПериодЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборПрограммыОбученияПоХарактеристикам(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресХарактеристикПерсонала", АдресХарактеристикПерсонала());
	СтруктураПараметров.Вставить("АдресПрограммыОбучения", АдресПрограммыОбучения());
	
	ОбучениеРазвитиеКлиент.ОткрытьФормуПодбораПрограммыОбучения(ЭтотОбъект,
		Новый Структура("ПараметрыФормыПодбора", СтруктураПараметров),
		Новый ОписаниеОповещения("ЗагрузитьПрограммуОбученияНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборХарактеристик(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ДобавлятьЗначенияХарактеристик", Истина);
	
	ХарактеристикиПерсоналаКлиент.ОткрытьФормуПодбораХарактеристик(ЭтотОбъект, ПараметрыПодбора,
		Новый ОписаниеОповещения("ДобавитьХарактеристикиПерсоналаНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЦелейРазвития(Команда)
	
	ПараметрыФормыПодбора = ПараметрыПодбораЦелейРазвития();
	Если Не ЗначениеЗаполнено(ПараметрыФормыПодбора) Тогда
		ТекстПредупреждения = НСтр("ru = 'Не отмечены характеристики, требующие развития.'");
		ПоказатьПредупреждение( , ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ОбучениеРазвитиеКлиент.ОткрытьФормуПодбораЦелейРазвития(ЭтотОбъект,
		Новый Структура("ПараметрыФормыПодбора", ПараметрыФормыПодбора),
		Новый ОписаниеОповещения("ЗагрузитьПрограммуОбученияНаКлиенте", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого СтрокаХарактеристика Из Характеристики Цикл
		СтрокаХарактеристика.ТребуетсяОбучение = Истина;
	КонецЦикла;
	УстановитьТребуетсяОбучениеВДереве(ДеревоХарактеристик.ПолучитьЭлементы(), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделитьВсе(Команда)
	
	Для Каждого СтрокаХарактеристика Из Характеристики Цикл
		СтрокаХарактеристика.ТребуетсяОбучение = Ложь;
	КонецЦикла;
	УстановитьТребуетсяОбучениеВДереве(ДеревоХарактеристик.ПолучитьЭлементы(), Ложь);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
	СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ПоКомпетенциям(Команда)
	
	Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка = Не Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка;
	ПоКомпетенциямНаСервере();
	РазвернутьУзлыДереваХарактеристик();

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРезультатОбучения(Команда)
	
	ТекущиеДанные = Элементы.ПланРазвития.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
	 Или Не ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ДокументыОбучения.Количество() <> 0 Тогда
		НачатьИзменениеДокументаОбучения(ТекущиеДанные);
	Иначе
		НачатьСозданиеДокументаОбучения(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультатОбучения(Команда)
	
	ТекущиеДанные = Элементы.ПланРазвития.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
	 Или Не ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ВыбранноеОбучение = Неопределено;
	ТекущиеДанные.Обучение = "";
	ТекущиеДанные.ДокументыОбучения = Новый СписокЗначений();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	// Использование целей развития
	ИспользоватьЦелиРазвитияСотрудников = ПолучитьФункциональнуюОпцию("ИспользоватьЦелиРазвитияСотрудников");
	ВидимостьПланаРазвития = (Объект.ЦелиРазвития.Количество() > 0) Или (Объект.Мероприятия.Количество() = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПрограммаОбученияСтраница", "Видимость", Не ИспользоватьЦелиРазвитияСотрудников Или Не ВидимостьПланаРазвития);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПланРазвитияСтраница", "Видимость", ИспользоватьЦелиРазвитияСотрудников И ВидимостьПланаРазвития);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПодборЦелейРазвития", "Видимость", ИспользоватьЦелиРазвитияСотрудников И ВидимостьПланаРазвития);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВидимостьПланаРазвития", "Видимость", ИспользоватьЦелиРазвитияСотрудников);
	
	УстановитьСвойстваЭлементовФормы();
	
	ОбучениеРазвитиеФормы.ЗаполнитьКэшХарактеристикиМероприятияПоХарактеристикам(КэшХарактеристикиМероприятия, 
		Объект.РазвиваемыеХарактеристики.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика"));
	
	ЗаполнитьВторичнуюТаблицуХарактеристики();
	ЗаполнитьВторичнуюИнформациюПланаОбучения(); 
	ЗаполнитьРезультатыОбучения();
	
	Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПользователя", ИмяНастройкиОтображенияПоКомпетенциям(), Ложь);
	УстановитьСвойстваЭлементовХарактеристикПерсонала();
	ЗаполнитьДеревоХарактеристик();
	
	ВключитьНаставника(ЭтотОбъект, Объект.ЕстьНаставник);
	ВключитьКуратора(ЭтотОбъект, Объект.ЕстьКуратор);
	
	ЧтениеПрогрессаОбученияСотрудников = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПрогрессОбученияСотрудников);
	ДобавлениеИзменениеПрогрессаОбученияСотрудников = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПрогрессОбученияСотрудников);
	Если Не Пользователи.ЭтоПолноправныйПользователь()
		И Не ЧтениеПрогрессаОбученияСотрудников 
		И Не ДобавлениеИзменениеПрогрессаОбученияСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Если ЧтениеПрогрессаОбученияСотрудников И Не ДобавлениеИзменениеПрогрессаОбученияСотрудников Тогда
		Элементы.ПланРазвитияПрогрессГруппа.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ИспользоватьОценкуПрохожденияИПР = ПолучитьФункциональнуюОпцию("ИспользоватьПрогрессОбучения");
	Если Не ИспользоватьОценкуПрохожденияИПР Тогда
		Объект.ИспользоватьПрогрессРазвития = Ложь;
	Иначе
		НастройкиОбученияРазвития = РегистрыСведений.НастройкиОбученияРазвития.ЗначенияНастроек();
		Если НастройкиОбученияРазвития.ИспользоватьПрогрессОбучения Тогда
			Объект.ИспользоватьПрогрессРазвития = НастройкиОбученияРазвития.ИспользоватьПрогрессОбучения;
			Объект.ПродолжительностьПрогрессаРазвития = НастройкиОбученияРазвития.ПродолжительностьПрогрессаОбучения;
			Объект.РазмерностьПродолжительностиПрогрессаРазвития =
				НастройкиОбученияРазвития.РазмерностьПродолжительностиПрогрессаОбучения;
		КонецЕсли;
		СоздатьИЗаполнитьРеквизитыПрогрессаОбучения();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентВыполненияПланаРазвития()
	
	ЧислоКолонок = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, "Объект.ПродолжительностьПрогрессаРазвития");
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Объект.ПрогрессВыполнения = 0;
	Для Сч = 1 По ЧислоКолонок Цикл
		ОбщийПрогресс = Новый Массив;
		Для Каждого СтрокаЦели Из Дерево.Строки Цикл
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбщийПрогресс,
				СтрокаЦели.Строки.ВыгрузитьКолонку("Прогресс" + Строка(Сч)));
		КонецЦикла;
		
		КоличествоМероприятий = 0;
		СуммаПрогресса = 0;
		ВыполнениеПланаРазвития = Истина;
		Для Каждого ЗначениеПрогресса Из ОбщийПрогресс Цикл
			Если ЗначениеПрогресса = Справочники.ЗначенияПрогрессаОбучения.ПустаяСсылка() Тогда
				ВыполнениеПланаРазвития = Ложь;
				Прервать;
			Иначе
				Прогресс = ЗначениеПрогресса.Прогресс;
			КонецЕсли;
			СуммаПрогресса = СуммаПрогресса + Прогресс;
			КоличествоМероприятий = КоличествоМероприятий + 1;
		КонецЦикла;
		Если ВыполнениеПланаРазвития И КоличествоМероприятий <> 0 Тогда
			ИтогПрогресса = СуммаПрогресса / КоличествоМероприятий;
			ЭтотОбъект["ИтогПрогресса" + Строка(Сч)] = Формат(ИтогПрогресса, "ЧДЦ=0;") + "%";
			Объект.ПрогрессВыполнения = ИтогПрогресса;
		Иначе
			ИтогПрогресса = 0;
			ЭтотОбъект["ИтогПрогресса" + Строка(Сч)] = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИЗаполнитьРеквизитыПрогрессаОбучения()
	
	ПараметрыПрогрессаОбучения = ОбучениеРазвитиеФормы.ПараметрыПрогрессаОбучения();
	ПараметрыПрогрессаОбучения.Группа = "ПланРазвитияПрогрессГруппа";
	ПараметрыПрогрессаОбучения.ЧислоКолонок = Объект.ПродолжительностьПрогрессаРазвития;
	ПараметрыПрогрессаОбучения.РасположениеРеквизитов = "ПланРазвития";
	ПараметрыПрогрессаОбучения.Источник = "ИПР";
	ПараметрыПрогрессаОбучения.Размерность = Объект.РазмерностьПродолжительностиПрогрессаРазвития;
	
	ОбучениеРазвитиеФормы.СоздатьРеквизитыПрогрессаОбучения(ЭтотОбъект, ПараметрыПрогрессаОбучения);
	
	УстановитьЗначенияПериодовПрогрессаРазвития();
	ЗаполнитьПроцентВыполненияПланаРазвития();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПериодовПрогрессаРазвития()
	
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Дерево.Строки.Очистить();
	
	РеквизитПланРазвития = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, "ПланРазвития");
	ПрогрессРазвития = РегистрыСведений.ПрогрессОбученияСотрудников.ПрогрессОбучения(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Владелец));
	
	Для Каждого Цель Из РеквизитПланРазвития.ПолучитьЭлементы() Цикл
		Мероприятия = Цель.ПолучитьЭлементы();
		Для Каждого Мероприятие Из Мероприятия Цикл
			ЕстьОбучение = Ложь;
			Если Мероприятие.ДокументыОбучения.Количество() <> 0 Тогда
				ЕстьОбучение = Истина;
				Обучение = Мероприятие.ДокументыОбучения[0].Значение;
			Иначе
				Отборы = Новый Структура;
				Отборы.Вставить("Мероприятие", Мероприятие.Мероприятие);
				ПрогрессМероприятия = ПрогрессРазвития.НайтиСтроки(Отборы);
				Если ПрогрессМероприятия.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Для Сч = 1 По ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, "Объект.ПродолжительностьПрогрессаРазвития") Цикл
				Отборы = Новый Структура;
				Если ЕстьОбучение Тогда
					Отборы.Вставить("РегистраторПрогресса", Обучение);
				Иначе
					Если Параметры.Ключ.Пустая() И ЗначениеЗаполнено(Объект.СкорректированныйИПР) Тогда
						РегистраторПрогресса = Объект.СкорректированныйИПР;
					Иначе
						РегистраторПрогресса = Объект.Ссылка;
					КонецЕсли;
					Отборы.Вставить("РегистраторПрогресса", РегистраторПрогресса);
					Отборы.Вставить("Мероприятие", Мероприятие.Мероприятие);
				КонецЕсли;
				Отборы.Вставить("НомерПериода", Сч);
				ПрогрессМероприятия = ПрогрессРазвития.НайтиСтроки(Отборы);
				Если ПрогрессМероприятия.Количество() = 0 Тогда
					Мероприятие["Прогресс" + Строка(Сч)] = Справочники.ЗначенияПрогрессаОбучения.ПустаяСсылка();
				Иначе
					Мероприятие["Прогресс" + Строка(Сч)] = ПрогрессМероприятия[0].Прогресс;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьХарактеристики()
	
	ДополнитьХарактеристикиОценками();
	ДополнитьХарактеристикиЦелевымУровнем();
	ДополнитьХарактеристикиДаннымиХарактеристикСотрудника();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичнуюТаблицуХарактеристики()
	
	ХарактеристикиПерсоналаФормы.ПрочитатьХарактеристикиВТаблицы(Объект.РазвиваемыеХарактеристики, Характеристики,
		ЗначенияХарактеристики);
	
	// загружаем цели, мероприятия
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Дерево.Строки.Очистить();
	
	Для Каждого Строка Из Объект.ЦелиРазвития Цикл
		СтрокаЦель = Дерево.Строки.Добавить();
		СтрокаЦель.Цель = Строка.Цель;
		НайденныеСтроки = Объект.Мероприятия.НайтиСтроки(Новый Структура("Цель", Строка.Цель));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокаМероприятие = СтрокаЦель.Строки.Добавить();
			СтрокаМероприятие.Мероприятие = НайденнаяСтрока.Мероприятие;
			СтрокаМероприятие.ДатаНачала = НайденнаяСтрока.ДатаНачала;
			СтрокаМероприятие.ДатаОкончания = НайденнаяСтрока.ДатаОкончания;
			СтрокаМероприятие.Ответственный = НайденнаяСтрока.Ответственный;
			СтрокаМероприятие.Результат = НайденнаяСтрока.РезультатВыполнения;
			СтрокаМероприятие.Обучение = НайденнаяСтрока.Обучение;
			Если ЗначениеЗаполнено(НайденнаяСтрока.ВыбранноеОбучение)
				И НайденнаяСтрока.ВыбранноеОбучение.Проведен
				И Не НайденнаяСтрока.ВыбранноеОбучение.ПометкаУдаления Тогда
				СтрокаМероприятие.ВыбранноеОбучение = НайденнаяСтрока.ВыбранноеОбучение;
				СтрокаМероприятие.Обучение = СтрШаблон(НСтр("ru = 'Обучение с %1 по %2'"), 
					Формат(НайденнаяСтрока.ВыбранноеОбучение.ДатаНачала, "ДЛФ=D;"), 
					Формат(НайденнаяСтрока.ВыбранноеОбучение.ДатаОкончания, "ДЛФ=D;"));
				СтрокаМероприятие.ДокументыОбучения = Новый СписокЗначений();
				СтрокаМероприятие.ДокументыОбучения.Добавить(НайденнаяСтрока.ВыбранноеОбучение);
			Иначе
				СтрокаМероприятие.ВыбранноеОбучение = Неопределено;
				СтрокаМероприятие.Обучение = "";
				СтрокаМероприятие.ДокументыОбучения = Новый СписокЗначений();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево,"ПланРазвития");
	
	Элементы.ПланРазвития.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	
	ДополнитьХарактеристики();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичнуюИнформациюПланаОбучения()
	
	ОбучениеРазвитиеФормы.ЗаполнитьСтрокиХарактеристикВТаблицеПрограммаОбучения(
		Объект.Мероприятия, Объект.РазвиваемыеХарактеристики, КэшХарактеристикиМероприятия);
	ОбучениеРазвитиеФормы.ЗаполнитьУчебныеЧасыПланаОбучения(ЭтотОбъект, , "Объект.Мероприятия");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатыОбучения(СтрокиТаблицы = Неопределено)
	
	Если Не РезультатыОбученияДоступны Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрокМероприятие = Новый Структура("Мероприятие, ДатаНачала, ДатаОкончания");
	ОтборСтрокВыбранноеОбучение = Новый Структура("ВыбранноеОбучение");
	Результаты = РезультатыОбучения(Объект.Владелец,
		Объект.Мероприятия.Выгрузить(СтрокиТаблицы, "Мероприятие, ДатаНачала, ДатаОкончания, ВыбранноеОбучение"));
	Обход = Обработки.ОбходКоллекции.НовыйОбход(Результаты);
	
	Если Не ВидимостьПланаРазвития Тогда
		Пока Обход.СледующийПоЗначениямПолей("ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан") Цикл
			ТекущиеДанные = Обход.ТекущиеДанные();
			ОтборСтрокМероприятие.Мероприятие = ТекущиеДанные.Мероприятие;
			ОтборСтрокМероприятие.ДатаНачала = ТекущиеДанные.ДатаНачалаПлан;
			ОтборСтрокМероприятие.ДатаОкончания = ТекущиеДанные.ДатаОкончанияПлан;
			НайденныеСтроки = Объект.Мероприятия.НайтиСтроки(ОтборСтрокМероприятие);
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ВыбранноеОбучение) Тогда
				ОтборСтрокВыбранноеОбучение.ВыбранноеОбучение = ТекущиеДанные.ВыбранноеОбучение;
				НайденныеСтрокиОбучения = Объект.Мероприятия.НайтиСтроки(ОтборСтрокВыбранноеОбучение);
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеСтроки, НайденныеСтрокиОбучения, Истина);
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокиРезультатов = Новый Массив;
			Пока Обход.Следующий() Цикл
				СтрокиРезультатов.Добавить(Обход.ТекущиеДанные());
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
				ЗаполнитьРезультатОбученияВСтроке(СтрокаТаблицы, СтрокиРезультатов);
			КонецЦикла;
		КонецЦикла;
	Иначе
		План = РеквизитФормыВЗначение("ПланРазвития");
		Цели = План.Строки;
		Пока Обход.СледующийПоЗначениямПолей("ФизическоеЛицо, Мероприятие, ДатаНачалаПлан, ДатаОкончанияПлан") Цикл
			ТекущиеДанные = Обход.ТекущиеДанные();
			ОтборСтрокМероприятие.Мероприятие = ТекущиеДанные.Мероприятие;
			ОтборСтрокМероприятие.ДатаНачала = ТекущиеДанные.ДатаНачалаПлан;
			ОтборСтрокМероприятие.ДатаОкончания = ТекущиеДанные.ДатаОкончанияПлан;
			
			НайденныеСтроки = Новый Массив;
			Для Каждого Цель Из Цели Цикл
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеСтроки,
					Цель.Строки.НайтиСтроки(ОтборСтрокМероприятие));
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ВыбранноеОбучение) Тогда
				ОтборСтрокВыбранноеОбучение.ВыбранноеОбучение = ТекущиеДанные.ВыбранноеОбучение;
				Для Каждого Цель Из Цели Цикл
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НайденныеСтроки,
						Цель.Строки.НайтиСтроки(ОтборСтрокВыбранноеОбучение));
				КонецЦикла;
			КонецЕсли;
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			СтрокиРезультатов = Новый Массив;
			Пока Обход.Следующий() Цикл
				СтрокиРезультатов.Добавить(Обход.ТекущиеДанные());
			КонецЦикла;
			
			Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
				ЗаполнитьРезультатОбученияВСтроке(СтрокаТаблицы, СтрокиРезультатов);
			КонецЦикла;
		КонецЦикла;
		ЗначениеВРеквизитФормы(План, "ПланРазвития");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатОбучения(ТекущиеДанные)
	
	Если Не РезультатыОбученияДоступны Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала)
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	Результаты = РезультатОбучения(Объект.Владелец, ТекущиеДанные.Мероприятие, ТекущиеДанные.ДатаНачала,
		ТекущиеДанные.ДатаОкончания, ТекущиеДанные.ВыбранноеОбучение);
		
	ЗаполнитьРезультатОбученияВСтроке(ТекущиеДанные, Результаты);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРезультатОбученияВСтроке(СтрокаТаблицы, РезультатыОбучения)
	
	СтрокаТаблицы.Обучение = ОбучениеРазвитиеКлиентСервер.ПредставлениеРезультатовОбучения(РезультатыОбучения);
	СтрокаТаблицы.ДокументыОбучения = Новый СписокЗначений();
	Для Каждого СтрокаРезультата Из РезультатыОбучения Цикл
		СтрокаТаблицы.ВыбранноеОбучение = СтрокаРезультата.ДокументОбучения;
		СтрокаТаблицы.ДокументыОбучения.Добавить(СтрокаРезультата.ДокументОбучения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатОбучения(ФизическоеЛицо, Мероприятие, ДатаНачала, ДатаОкончания, ВыбранноеОбучение)
	
	ПланМероприятий = ОбучениеРазвитие.НовыйПланМероприятий();
	НоваяСтрока = ПланМероприятий.Добавить();
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	НоваяСтрока.Мероприятие = Мероприятие;
	НоваяСтрока.ДатаНачала = ДатаНачала;
	НоваяСтрока.ДатаОкончания = ДатаОкончания;
	НоваяСтрока.ВыбранноеОбучение = ВыбранноеОбучение;
	
	РезультатыТаблица = РезультатыОбучения(ФизическоеЛицо, ПланМероприятий);
	
	Результаты = Новый Массив;
	Для Каждого СтрокаТаблицы Из РезультатыТаблица Цикл
		Результаты.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицы));
	КонецЦикла;
	
	Возврат Результаты;
	
КонецФункции

&НаСервереБезКонтекста
Функция РезультатыОбучения(ФизическоеЛицо, СтрокиТаблицы)
	
	ПланМероприятий = ОбучениеРазвитие.НовыйПланМероприятий();
	Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
		НоваяСтрока = ПланМероприятий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	КонецЦикла;
	
	Возврат ОбучениеРазвитие.РезультатыОбучения(ПланМероприятий);
	
КонецФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ЗаполнитьПоДаннымОснованияЗавершение(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДаннымОснования();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымОснования()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыйРезервДействияСотрудников.ДействиеСотрудника КАК ДействиеСотрудника
		|ИЗ
		|	Справочник.КадровыйРезерв.ДействияСотрудников КАК КадровыйРезервДействияСотрудников
		|ГДЕ
		|	КадровыйРезервДействияСотрудников.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйРезервХарактеристикиПерсонала.Характеристика КАК Характеристика,
		|	КадровыйРезервХарактеристикиПерсонала.Значение КАК Значение,
		|	ИСТИНА КАК ТребуетсяОбучение
		|ИЗ
		|	Справочник.КадровыйРезерв.ХарактеристикиПерсонала КАК КадровыйРезервХарактеристикиПерсонала
		|ГДЕ
		|	КадровыйРезервХарактеристикиПерсонала.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйРезерв.РазмерностьПродолжительностиПланаОбучения КАК РазмерностьПродолжительностиПланаОбучения
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Ссылка = &Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйРезервПрограммаОбучения.Мероприятие.ВидМероприятия КАК ВидМероприятия,
		|	КадровыйРезервПрограммаОбучения.Мероприятие КАК Мероприятие,
		|	КадровыйРезервПрограммаОбучения.Ответственный КАК Ответственный,
		|	КадровыйРезервПрограммаОбучения.Начало КАК Начало,
		|	КадровыйРезервПрограммаОбучения.Окончание КАК Окончание
		|ИЗ
		|	Справочник.КадровыйРезерв.ПрограммаОбучения КАК КадровыйРезервПрограммаОбучения
		|ГДЕ
		|	КадровыйРезервПрограммаОбучения.Ссылка = &Основание";
	
	Запрос.УстановитьПараметр("Основание", Объект.Основание);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатыДействия = РезультатыЗапроса[РезультатыЗапроса.Количество() - 4];
	РезультатыХарактеристики = РезультатыЗапроса[РезультатыЗапроса.Количество() - 3];
	РезультатыПараметрыПрограммы = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2];
	РезультатыПрограмма = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	// Действия.
	Объект.ДействияСотрудников.Загрузить(РезультатыДействия.Выгрузить());
	
	// План обучения.
	ПланОбученияТаблица = РезультатыПрограмма.Выгрузить();
	ПланОбучения.Загрузить(ПланОбученияТаблица);
	Объект.Мероприятия.Загрузить(ПланОбученияТаблица);
	
	// Характеристики.
	Объект.РазвиваемыеХарактеристики.Загрузить(РезультатыХарактеристики.Выгрузить());
	ЗаполнитьВторичнуюТаблицуХарактеристики();
	
	Если Объект.РазвиваемыеХарактеристики.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Характеристика КАК Характеристика,
			|	ПрофилиДолжностейХарактеристикиПерсонала.Значение КАК Значение
			|ИЗ
			|	Справочник.ПрофилиДолжностей.ХарактеристикиПерсонала КАК ПрофилиДолжностейХарактеристикиПерсонала
			|ГДЕ
			|	ПрофилиДолжностейХарактеристикиПерсонала.Ссылка = &ПрофильДолжности";
		Запрос.УстановитьПараметр("ПрофильДолжности", ПрофильДолжностиПозицииРезерва(Объект.Основание));
		Объект.РазвиваемыеХарактеристики.Загрузить(Запрос.Выполнить().Выгрузить());
		ЗаполнитьВторичнуюТаблицуХарактеристики();
	КонецЕсли;
	
	ВыборкаПараметры = РезультатыПараметрыПрограммы.Выбрать();
	ВыборкаПараметры.Следующий();
	РазмерностьПродолжительностиПланаОбучения = ВыборкаПараметры.РазмерностьПродолжительностиПланаОбучения;
	Если ПланОбучения.Количество() <> 0 Тогда
		ДополнитьПланОбученияПериодами();
	КонецЕсли;
	
	ОбучениеРазвитиеФормы.ЗаполнитьКэшХарактеристикиМероприятияПоХарактеристикам(КэшХарактеристикиМероприятия,
		Объект.ХарактеристикиСотрудника.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика"));
	
	ЗаполнитьВторичнуюИнформациюПланаОбучения();
	ЗаполнитьНаставникаКуратора();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаставникаКуратора()
	
	Объект.ЕстьНаставник = Ложь;
	Объект.ЕстьКуратор = Ложь;
	Объект.Наставник = Неопределено;
	Объект.Куратор = Неопределено;
	ДанныеРезервистаПоОснованию = РегистрыСведений.КадровыйРезерв.ДанныеРезервистаПоПозиции(
		Объект.Основание, Объект.Владелец);
	Если ДанныеРезервистаПоОснованию <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДанныеРезервистаПоОснованию.Наставник) Тогда
			Объект.ЕстьНаставник = Истина;
			Объект.Наставник = ДанныеРезервистаПоОснованию.Наставник;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеРезервистаПоОснованию.Куратор) Тогда
			Объект.ЕстьКуратор = Истина;
			Объект.Куратор = ДанныеРезервистаПоОснованию.Куратор;
		КонецЕсли;
	КонецЕсли;
	ВключитьНаставника(ЭтотОбъект, Объект.ЕстьНаставник);
	ВключитьКуратора(ЭтотОбъект, Объект.ЕстьКуратор);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьХарактеристикиДаннымиХарактеристикСотрудника()

	Для каждого СтрокаХарактеристик Из Характеристики Цикл
		НайденныеСтроки = Объект.ХарактеристикиСотрудника.НайтиСтроки(
			Новый Структура("Характеристика", СтрокаХарактеристик.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаХарактеристик.ЗначениеХарактеристикиСотрудника = НайденныеСтроки[0].Значение;
		СтрокаХарактеристик.БаллХарактеристикиСотрудника = НайденныеСтроки[0].БаллХарактеристики;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПрограммуОбученияНаКлиенте(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Элементы.ТаблицыСтраница.ТекущаяСтраница = Элементы.ПланРазвитияСтраница;
	ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры);
	Если Объект.ИспользоватьПрогрессРазвития Тогда
		СоздатьИЗаполнитьРеквизитыПрогрессаОбучения();
	КонецЕсли;
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ПланРазвития", , Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПрограммуОбученияНаСервере(Результат, ДополнительныеПараметры)
	
	Если Не ИспользоватьЦелиРазвитияСотрудников Или Не ВидимостьПланаРазвития Тогда
		ОбучениеРазвитиеФормы.ЗагрузитьПрограммуОбучения(ЭтотОбъект, Результат, "Объект.Мероприятия");
		ОбучениеРазвитиеФормы.ЗаполнитьКэшХарактеристикиМероприятияПоХарактеристикам(КэшХарактеристикиМероприятия, 
		Характеристики.Выгрузить(, "Характеристика").ВыгрузитьКолонку("Характеристика"));
		ОбучениеРазвитиеФормы.ЗаполнитьСтрокиХарактеристикВТаблицеПрограммаОбучения(
			Объект.Мероприятия, Характеристики, КэшХарактеристикиМероприятия);
		Возврат;
	КонецЕсли;
	
	ПодобранныеЦели = ПолучитьИзВременногоХранилища(Результат.АдресЦелейРазвития);
	ПодобранныеМероприятияЦелей = ПолучитьИзВременногоХранилища(Результат.АдресМероприятийЦелей);
	
	ДеревоСтарое = РеквизитФормыВЗначение("ПланРазвития");
	Дерево = ДеревоСтарое.Скопировать();
	Дерево.Строки.Очистить();
	
	Для Каждого ПодобраннаяЦель Из ПодобранныеЦели Цикл
		СтрокаЦель = Дерево.Строки.Добавить();
		СтрокаЦель.Цель = ПодобраннаяЦель;
		СтрокаЦельСтарая = ДеревоСтарое.Строки.Найти(ПодобраннаяЦель);
		НайденныеСтроки = ПодобранныеМероприятияЦелей.НайтиСтроки(Новый Структура("Цель", ПодобраннаяЦель));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			СтрокаМероприятие = СтрокаЦель.Строки.Добавить();
			СтрокаМероприятие.Мероприятие = НайденнаяСтрока.Мероприятие;
			СтрокаМероприятие.Ответственный = НайденнаяСтрока.Мероприятие.Ответственный;
			Если Не ЗначениеЗаполнено(СтрокаМероприятие.ДатаНачала) Тогда
				СтрокаМероприятие.ДатаНачала = Объект.ДатаНачала;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаМероприятие.ДатаОкончания) Тогда
				СтрокаМероприятие.ДатаОкончания = Объект.ДатаОкончания;
			КонецЕсли;
			Если СтрокаЦельСтарая = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаМероприятиеСтарая = СтрокаЦельСтарая.Строки.Найти(НайденнаяСтрока.Мероприятие);
			Если СтрокаМероприятиеСтарая <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(СтрокаМероприятие, СтрокаМероприятиеСтарая);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ПланРазвития");
	
КонецПроцедуры

&НаСервере
Функция АдресХарактеристикПерсонала()
	
	Возврат ПоместитьВоВременноеХранилище(Характеристики.Выгрузить(, "Характеристика,КартинкаВида,ТребуетсяОбучение"),
		УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция АдресРазвиваемыхХарактеристик(РазвиваемыеХарактеристики)
	
	Возврат ПоместитьВоВременноеХранилище(РазвиваемыеХарактеристики, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция АдресПрограммыОбучения()
	
	Если Не ИспользоватьЦелиРазвитияСотрудников Или Не ВидимостьПланаРазвития Тогда
		Возврат ПоместитьВоВременноеХранилище(Объект.Мероприятия.Выгрузить(, "Мероприятие,Ответственный"),
			УникальныйИдентификатор);
	КонецЕсли;
	
	МероприятияПланаРазвития = Новый Массив;
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Для Каждого СтрокаЦели Из Дерево.Строки Цикл
		Для Каждого СтрокаМероприятие Из СтрокаЦели.Строки Цикл
			МероприятиеПланаРазвития = Новый Структура("Мероприятие, Ответственный, Цель");
			МероприятиеПланаРазвития.Цель = СтрокаЦели.Цель;
			ЗаполнитьЗначенияСвойств(МероприятиеПланаРазвития, СтрокаМероприятие, "Мероприятие, Ответственный");
			МероприятияПланаРазвития.Добавить(МероприятиеПланаРазвития);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(МероприятияПланаРазвития, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция АдресЦелей()
	
	МассивЦелей = Новый Массив;
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Для Каждого СтрокаЦели Из Дерево.Строки Цикл
		МассивЦелей.Добавить(СтрокаЦели.Цель);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(МассивЦелей, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ХарактеристикиТребуетсяОбучениеПриИзмененииНаКлиенте()

	ХарактеристикиТребуетсяОбучениеПриИзмененииНаСервере();
	
	СтрокиСУдаленнымиМероприятиями = Новый Массив;
	Для каждого СтрокаМероприятия Из Объект.Мероприятия Цикл
		Если СтрокаМероприятия.СтрокаХарактеристикОчистилась Тогда
			СтрокиСУдаленнымиМероприятиями.Добавить(СтрокаМероприятия);
		КонецЕсли;
	КонецЦикла; 
	
	Если СтрокиСУдаленнымиМероприятиями.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("УдалитьВыбранноеМероприятиеЗавершение", ЭтотОбъект,
		Новый Структура("СтрокиСУдаленнымиМероприятиями", СтрокиСУдаленнымиМероприятиями));
	
	ТекстВопроса = ТекстВопросаУдаления(СтрокиСУдаленнымиМероприятиями);
	СписокКнопок = Новый СписокЗначений;
	СписокКнопок.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да, исключить'"));
	СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет, оставить'"));
	
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, СписокКнопок,, КодВозвратаДиалога.Да);
		
КонецПроцедуры

&НаКлиенте
Функция ТекстВопросаУдаления(СтрокиСУдаленнымиМероприятиями)

	Если СтрокиСУдаленнымиМероприятиями.Количество() = 1 Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не осталось характеристик, которое развивает мероприятие ""%1"".
								|Исключить его из программы обучения?'"),
			СтрокиСУдаленнымиМероприятиями[0].Мероприятие);
	Иначе
		ТекстМероприятий = "";
		Для каждого СтрокаУдаляемогоМероприятия Из СтрокиСУдаленнымиМероприятиями Цикл
			ТекстМероприятий = ТекстМероприятий + ?(ТекстМероприятий = "", "", ", ") + """"
				+ СтрокаУдаляемогоМероприятия.Мероприятие + """";
		КонецЦикла; 
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не осталось характеристик, которые развивают мероприятия ""%1"".
								|Исключить их из программы обучения?'"),
			ТекстМероприятий);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ХарактеристикиТребуетсяОбучениеПриИзмененииНаСервере()
	
	ОбучениеРазвитиеФормы.ЗаполнитьСтрокиХарактеристикВТаблицеПрограммаОбучения(Объект.Мероприятия, Характеристики,
		КэшХарактеристикиМероприятия, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранноеМероприятиеЗавершение(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеПараметры = Неопределено Или Не ДополнительныеПараметры.Свойство("СтрокиСУдаленнымиМероприятиями") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого УдаляемаяСтрока Из ДополнительныеПараметры.СтрокиСУдаленнымиМероприятиями Цикл
		Объект.Мероприятия.Удалить(УдаляемаяСтрока);
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеДанныеОбученияНаСервере(ИдентификаторТекущейСтроки)
	
	ОбучениеРазвитиеФормы.ЗаполнитьУчебныеЧасыПланаОбучения(ЭтотОбъект, ИдентификаторТекущейСтроки, "Объект.Мероприятия");
	ОбучениеРазвитиеФормы.ЗаполнитьОтветственногоВСтрокеПрограммыОбучения(ЭтотОбъект, ИдентификаторТекущейСтроки,
		"Объект.Мероприятия");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРедактированиеРезультатаВыполнения(ТекстРедактирования)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Новый ОписаниеОповещения("ЗавершитьРедактированиеРезультатаВыполнения", ЭтотОбъект, 
			Новый Структура("ИдентификаторСтроки", ?(ИспользоватьЦелиРазвитияСотрудников И ВидимостьПланаРазвития,
			Элементы.ПланРазвития.ТекущиеДанные.ПолучитьИдентификатор(),
			Элементы.Мероприятия.ТекущиеДанные.ПолучитьИдентификатор()))),
			ТекстРедактирования);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеРезультатаВыполнения(ВведенныйТекст, ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьЦелиРазвитияСотрудников И ВидимостьПланаРазвития Тогда
		ПланРазвития.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки).Результат = ВведенныйТекст;
	Иначе
		Объект.Мероприятия.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки).РезультатВыполнения =
			ВведенныйТекст;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьХарактеристикиМероприятия(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя <> Элементы.МероприятияСтрокаХарактеристик.Имя Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Мероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ключ", ТекущиеДанные.Мероприятие);
	СтруктураПараметров.Вставить("ОткрытьСписокХарактеристик", Истина);
	
	ОткрытьФорму("Справочник.МероприятияОбученияРазвития.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект,
		УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументОбучение(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле <> Элементы.ПланРазвитияОбучение
		И Поле <> Элементы.МероприятияОбучение Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РезультатыОбученияДоступны Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидимостьПланаРазвития Тогда
		ТекущиеДанные = Элементы.ПланРазвития.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыОбучения = ТекущиеДанные.ДокументыОбучения;
	
	Если ДокументыОбучения.Количество() = 0 Тогда
		СоздатьНовыйДокументОбучение(ТекущиеДанные);
	ИначеЕсли ДокументыОбучения.Количество() = 1 Тогда
		ОткрытьСуществующийДокументОбучение(ДокументыОбучения[0].Значение);
	Иначе
		ПоказатьВыборИзСписка(
			Новый ОписаниеОповещения("ЗавершитьВыборДокументаОбученияИзСписка", ЭтотОбъект), ДокументыОбучения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборДокументаОбученияИзСписка(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСуществующийДокументОбучение(ЭлементСписка.Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСуществующийДокументОбучение(ДокументОбучения)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ДокументОбучения);
	
	ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйДокументОбучение(СтрокаТаблицы)
	
	Если Не ВводОбученияДоступен Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Обучение пока не пройдено.'"));
		Возврат;
	КонецЕсли;
	
	НачатьСозданиеДокументаОбучения(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьИзменениеДокументаОбучения(СтрокаТаблицы)
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Обучение уже подобрано'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		НСтр("ru = 'Создать'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет,  	НСтр("ru = 'Выбрать'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
	
	ТекстВопроса = НСтр("ru = 'Обучение уже подобрано. Изменить текущий документ обучения?'");
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьСозданиеДокументаОбучения", ЭтотОбъект, Новый Структура("СтрокаТаблицы", СтрокаТаблицы)), 
		ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьСозданиеДокументаОбучения(СтрокаТаблицы)
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Обучение не пройдено'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	Кнопки = Новый СписокЗначений();
	Кнопки.Добавить(КодВозвратаДиалога.Да, 		НСтр("ru = 'Создать'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет,  	НСтр("ru = 'Выбрать'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, 	НСтр("ru = 'Отмена'"));
	
	ТекстВопроса = НСтр("ru = 'Обучение пока не пройдено. Необходимо ввести новый документ обучения или выбрать существующий'");
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьСозданиеДокументаОбучения", ЭтотОбъект, Новый Структура("СтрокаТаблицы", СтрокаТаблицы)), 
		ТекстВопроса, Кнопки, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСозданиеДокументаОбучения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если СвойствоСтруктуры(Ответ, "Значение") = КодВозвратаДиалога.Нет Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("Мероприятие", ДополнительныеПараметры.СтрокаТаблицы.Мероприятие);
		ПараметрыФормы.Вставить("ФизическоеЛицо", Объект.Владелец);
		ПараметрыФормы.Вставить("ДатаНачала", Объект.ДатаНачала);
		ПараметрыФормы.Вставить("ДатаОкончания", Объект.ДатаОкончания);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершитьВыборДокументаОбучения", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ОповещениеОЗакрытии);
	КонецЕсли;
	
	Если СвойствоСтруктуры(Ответ, "Значение") <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ДополнительныеПараметры.СтрокаТаблицы;
	
	КадровыеДанные = КадровыеДанные(Объект.Владелец, СтрокаТаблицы.ДатаНачала);
	
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("Мероприятие", СтрокаТаблицы.Мероприятие);
	ЗначенияЗаполнения.Вставить("ДатаНачала", СтрокаТаблицы.ДатаНачала);
	ЗначенияЗаполнения.Вставить("ДатаОкончания", СтрокаТаблицы.ДатаОкончания);
	ЗначенияЗаполнения.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(КадровыеДанные.Сотрудник));
	ЗначенияЗаполнения.Вставить("Подразделение", КадровыеДанные.МестоВСтруктуреПредприятия);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыборДокументаОбучения(ВыбранныйДокумент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.СтрокаТаблицы;
	ТекущиеДанные.ВыбранноеОбучение = ВыбранныйДокумент;
	ПериодВыбранногоДокумента = ПериодВыбранногоДокумента(ВыбранныйДокумент);
	
	ТекущиеДанные.Обучение = СтрШаблон(НСтр("ru = 'Обучение с %1 по %2'"), 
		Формат(ПериодВыбранногоДокумента.ДатаНачала, "ДЛФ=D;"), 
		Формат(ПериодВыбранногоДокумента.ДатаОкончания, "ДЛФ=D;"));
	
	ТекущиеДанные.ДокументыОбучения = Новый СписокЗначений();
	ТекущиеДанные.ДокументыОбучения.Добавить(ВыбранныйДокумент);
	
	УстановитьЗначенияПериодовПрогрессаРазвития();
	ЗаполнитьПроцентВыполненияПланаРазвития();
	ОчиститьПрогрессОбучения(ТекущиеДанные.Мероприятие);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодВыбранногоДокумента(ВыбранныйДокумент)
	
	ПериодВыбранногоДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбранныйДокумент, "ДатаНачала, ДатаОкончания");
	
	Возврат ПериодВыбранногоДокумента;
	
КонецФункции

&НаСервереБезКонтекста
Функция КадровыеДанные(ФизическоеЛицо, ДатаАктуальности)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.КадровыеДанные = "МестоВСтруктуреПредприятия";
	ПараметрыПолучения.СписокФизическихЛиц = ФизическоеЛицо;
	ПараметрыПолучения.НачалоПериода = ДатаАктуальности;
	ПараметрыПолучения.ОкончаниеПериода = ДатаАктуальности;
	
	КадровыеДанные = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	
	ОбщегоНазначенияКлиентСервер.Проверить(КадровыеДанные.Количество() > 0,
		СтрШаблон(НСтр("ru = 'Не удалось получить кадровые данные.
					|Возможно, %1 не принят на работу по состоянию на %2.'"),
				ФизическоеЛицо, Формат(ДатаАктуальности, "ДЛФ=D;")),
		Метаданные.Справочники.ИндивидуальныйПланРазвития.ПолноеИмя());
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(КадровыеДанные[0]);
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ПланРазвития.Обучение", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ПланРазвития.Цель", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПланРазвитияОбучение");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Обучение не пройдено>'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ПланРазвития.Результат", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ПланРазвития.Цель", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПланРазвитияРезультат");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Комментарий'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "Объект.Мероприятия.Обучение", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("МероприятияОбучение");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Обучение не пройдено>'"));

	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "Объект.Мероприятия.РезультатВыполнения", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("МероприятияРезультатВыполнения");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Комментарий'"));
	
	// Элемент оформления для таблицы ПланРазвития - если цель заполнена
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ПланРазвития.Цель", , ВидСравненияКомпоновкиДанных.Заполнено);
	Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("ПланРазвития");
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Элемент оформления для таблицы ПланРазвития - если обучение заполнено
	Если Объект.ИспользоватьПрогрессРазвития Тогда
		Элемент = УсловноеОформление.Элементы.Добавить();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Элемент.Отбор, "ПланРазвития.Обучение", , ВидСравненияКомпоновкиДанных.Заполнено);
		Для Номер = 1 По Объект.ПродолжительностьПрогрессаРазвития Цикл
			Элемент.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Прогресс" + Номер);
		КонецЦикла;
		Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультатыОбучения(СтрокаТаблицы)
	СтрокаТаблицы.Обучение = Неопределено;
	СтрокаТаблицы.ДокументыОбучения.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОповещениеДокументаОбучения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "Запись_ОбучениеРазвитиеСотрудников" Тогда
		Возврат;
	КонецЕсли;
	
	Если СвойствоСтруктуры(Параметр, "РежимЗаписи", РежимЗаписиДокумента.Запись) = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	Мероприятие = СвойствоСтруктуры(Параметр, "Мероприятие");
	Если Не ЗначениеЗаполнено(Мероприятие) Тогда
		Возврат;
	КонецЕсли;
	
	Если СвойствоСтруктуры(Параметр, "ДатаОкончания", Дата(1, 1, 1)) < Объект.ДатаНачала 
		Или СвойствоСтруктуры(Параметр, "ДатаНачала", Дата(1, 1, 1)) > Объект.ДатаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ИспользоватьПрогрессРазвития Тогда
		ОчиститьПрогрессОбучения(Мероприятие);
		УстановитьЗначенияПериодовПрогрессаРазвития();
	КонецЕсли;
	ЗаполнитьРезультатыОбученияПоМероприятию(Мероприятие);
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ПланРазвития");
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьПрогрессОбучения(Мероприятие)
	
	РегистрыСведений.ПрогрессОбученияСотрудников.ОчиститьПрогрессОбучения(
		Объект.Ссылка, Объект.Владелец, Мероприятие);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезультатыОбученияПоМероприятию(Мероприятие)
	
	НайденныеСтроки = Объект.Мероприятия.НайтиСтроки(Новый Структура("Мероприятие", Мероприятие));
	Если НайденныеСтроки.Количество() > 0 Тогда
		ЗаполнитьРезультатыОбучения(НайденныеСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
КонецФункции

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	РезультатыОбученияДоступны = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОбучениеСотрудников);
	ВводОбученияДоступен = ПравоДоступа("Чтение", Метаданные.Документы.ОбучениеРазвитиеСотрудников);
	
	Если Не РезультатыОбученияДоступны Тогда
		Элементы.МероприятияОбучение.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьТолькоПросмотрПланаРазвития();
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьПланОбученияПериодами()
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Возврат;
	КонецЕсли;
	
	ПланОбученияСДатами = ОбучениеРазвитие.ПрограммаОбученияПоДатам(Объект.ДатаНачала, ПланОбучения.Выгрузить(),
		РазмерностьПродолжительностиПланаОбучения);
		
	Для каждого СтрокаМероприятия Из Объект.Мероприятия Цикл
		НайденныеСтроки = ПланОбученияСДатами.НайтиСтроки(Новый Структура("Мероприятие", СтрокаМероприятия.Мероприятие));
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаМероприятия, НайденныеСтроки[0], "ДатаНачала, ДатаОкончания");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристикиПерсоналаНаКлиенте(НовыеХарактеристики, ДополнительныеПараметры = Неопределено) Экспорт
	
	ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры);
	ДополнитьХарактеристики();
	ДополнитьХарактеристикиПризнакомТребуетсяРазвитие(НовыеХарактеристики);
	ЗаполнитьДеревоХарактеристик();
	РазвернутьУзлыДереваХарактеристик();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьУзлыДереваХарактеристик()
	
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоХарактеристик");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикиПерсоналаНаСервере(НовыеХарактеристики, ДополнительныеПараметры)
	
	ХарактеристикиПерсоналаФормы.ДобавитьХарактеристикиВТабличнуюЧасть(ЭтотОбъект, НовыеХарактеристики,
		ДополнительныеПараметры);
		
КонецПроцедуры

&НаСервере
Процедура ДополнитьХарактеристикиОценками()
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ЧтениеОценок = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ОценкиОтветовОпросаПоКомпетенциям);
	Иначе
		ЧтениеОценок = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.РезультатыЭкспертнойОценкиПерсонала);
	КонецЕсли;
	
	Если Не ЧтениеОценок Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ЭкспертнаяОценкаПерсонала.ДополнитьХарактеристикиОценками(ЭтотОбъект);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьХарактеристикиЦелевымУровнем()
	
	Если Характеристики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Характеристики.Характеристика КАК Характеристика,
		|	Характеристики.Значение КАК Значение
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	&Характеристики КАК Характеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТХарактеристики.Характеристика КАК Характеристика,
		|	МИНИМУМ(ВТХарактеристики.Значение.ЧисловоеЗначение) КАК ЦелевойУровень
		|ИЗ
		|	ВТХарактеристики КАК ВТХарактеристики
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТХарактеристики.Характеристика";
	Запрос.УстановитьПараметр("Характеристики", ЗначенияХарактеристики.Выгрузить());
	
	ЦеловойУровень = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаХарактеристик Из Характеристики Цикл
		НайденныеСтроки = ЦеловойУровень.НайтиСтроки(
			Новый Структура("Характеристика", СтрокаХарактеристик.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаХарактеристик.ЦелевойУровень = НайденныеСтроки[0].ЦелевойУровень;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьХарактеристикиПризнакомТребуетсяРазвитие(НовыеХарактеристики)
	
	ХарактеристикиДляОбновления = Новый Массив;
	Для Каждого НоваяХарактеристика Из НовыеХарактеристики Цикл
		ХарактеристикиДляОбновления.Добавить(НоваяХарактеристика.Характеристика);
	КонецЦикла;
	
	Для Каждого СтрокаХарактеристик Из Характеристики Цикл
		Если ХарактеристикиДляОбновления.Найти(СтрокаХарактеристик.Характеристика) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаХарактеристик.Оценка = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаХарактеристик.ТребуетсяОбучение = ?(СтрокаХарактеристик.Оценка < СтрокаХарактеристик.ЦелевойУровень,
			Истина, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборИзПодразделения(Знач Подразделение)

	ОтборИзПодразделения = Новый Структура;
	Источник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Подразделение, "Источник");
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") Тогда
		ОтборИзПодразделения.Вставить("Организация", Источник);
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		ОтборИзПодразделения.Вставить("Подразделение", Источник);
		ОтборИзПодразделения.Вставить("Организация", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник,
			"ГоловнаяОрганизация"));
	КонецЕсли;
	
	Возврат ОтборИзПодразделения

КонецФункции

&НаСервере
Процедура ОбработкаВыбораФизическогоЛица(Знач ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		Объект.Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ФизическоеЛицо");
	Иначе
		Объект.Владелец = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПрофильДолжностиПозицииРезерва(ПозицияКадровогоРезерва)
	
	Если ПозицияКадровогоРезерва.Назначение = Перечисления.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва Тогда
		Возврат ПозицияКадровогоРезерва.ПрофильДолжности;
	Иначе
		ПрофильДолжностиМассив = ХарактеристикиПерсонала.ПрофильДолжностиПоПозицииШтатногоРасписания(ПозицияКадровогоРезерва.ПозицияШтатногоРасписания);
		Если ПрофильДолжностиМассив.Количество() > 0 Тогда
			Возврат ПрофильДолжностиМассив[0];
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РедактироватьПериодЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала = Результат.ДатаНачала;
	Объект.ДатаОкончания = Результат.ДатаОкончания;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяНастройкиОтображенияПоКомпетенциям()
	
	Возврат "ОтображениеПоКомпетенциямВИндивидуальномПланеРазвития";
	
КонецФункции

&НаСервере
Процедура ПоКомпетенциямНаСервере()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя", ИмяНастройкиОтображенияПоКомпетенциям(),
		Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка);
	
	УстановитьСвойстваЭлементовХарактеристикПерсонала();
	ЗаполнитьДеревоХарактеристик();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовХарактеристикПерсонала()

	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппХарактеристикПерсонала(ЭтотОбъект,
		Элементы.ХарактеристикиПерсоналаПоКомпетенциям);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоХарактеристик()

	Если Не Элементы.ХарактеристикиПерсоналаПоКомпетенциям.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиДерево = РеквизитФормыВЗначение("ДеревоХарактеристик");
	ХарактеристикиПерсоналаФормы.ЗаполнитьДеревоХарактеристикПоКомпетенциям(ДанныеДляЗаполненияДереваХарактеристик(),
		ХарактеристикиДерево);
	ЗначениеВРеквизитФормы(ХарактеристикиДерево, "ДеревоХарактеристик");
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляЗаполненияДереваХарактеристик()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаХарактеристик.Характеристика КАК Характеристика,
		|	ТаблицаХарактеристик.ВидХарактеристики КАК ВидХарактеристики,
		|	ТаблицаХарактеристик.ЗначенияСтрокой,
		|	ТаблицаХарактеристик.КартинкаВида КАК КартинкаВида,
		|	ТаблицаХарактеристик.Оценка КАК Оценка,
		|	ТаблицаХарактеристик.ПредыдущаяОценка КАК ПредыдущаяОценка,
		|	ТаблицаХарактеристик.ТребуетсяОбучение КАК ТребуетсяОбучение,
		|	ТаблицаХарактеристик.БаллХарактеристикиСотрудника КАК БаллХарактеристикиСотрудника,
		|	ТаблицаХарактеристик.ЗначениеХарактеристикиСотрудника КАК ЗначениеХарактеристикиСотрудника,
		|	ТаблицаХарактеристик.ЦелевойУровень КАК ЦелевойУровень
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	&ТаблицаХарактеристик КАК ТаблицаХарактеристик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка КАК Компетенция,
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТКомпетенции
		|ИЗ
		|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсоналаХарактеристикиПерсонала
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТХарактеристики КАК ВТХарактеристики
		|		ПО КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика = ВТХарактеристики.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКомпетенции.Компетенция КАК Компетенция,
		|	ВТХарактеристики.Характеристика КАК Характеристика,
		|	ВТХарактеристики.ВидХарактеристики КАК ВидХарактеристики,
		|	ВТХарактеристики.ЗначенияСтрокой КАК ЗначенияСтрокой,
		|	ВТХарактеристики.КартинкаВида КАК КартинкаВида,
		|	ВТХарактеристики.Оценка КАК Оценка,
		|	ВТХарактеристики.ПредыдущаяОценка КАК ПредыдущаяОценка,
		|	ВТХарактеристики.ТребуетсяОбучение КАК ТребуетсяОбучение,
		|	ВТХарактеристики.БаллХарактеристикиСотрудника КАК БаллХарактеристикиСотрудника,
		|	ВТХарактеристики.ЗначениеХарактеристикиСотрудника КАК ЗначениеХарактеристикиСотрудника,
		|	ВТХарактеристики.ЦелевойУровень КАК ЦелевойУровень
		|ИЗ
		|	ВТХарактеристики КАК ВТХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКомпетенции КАК ВТКомпетенции
		|		ПО ВТХарактеристики.Характеристика = ВТКомпетенции.Характеристика
		|ИТОГИ ПО
		|	Компетенция";
	Запрос.УстановитьПараметр("ТаблицаХарактеристик", Характеристики.Выгрузить());
	
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаКлиенте
Процедура УстановитьТребуетсяОбучениеВДереве(СтрокиДерева, ТребуетсяОбучение, Характеристика = Неопределено)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоКомпетенция Тогда
			УстановитьТребуетсяОбучениеВДереве(СтрокаДерева.ПолучитьЭлементы(), ТребуетсяОбучение, Характеристика);
		ИначеЕсли Характеристика = Неопределено Или СтрокаДерева.Характеристика = Характеристика Тогда
			СтрокаДерева.ТребуетсяОбучение = ТребуетсяОбучение;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребуетсяОбучениеДляХарактеристикиВТаблице(Характеристика, ТребуетсяОбучение)
	
	НайденныеСтроки = Характеристики.НайтиСтроки(Новый Структура("Характеристика", Характеристика));
	Если Не ЗначениеЗаполнено(НайденныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НайденнаяСтрока.ТребуетсяОбучение = ТребуетсяОбучение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Развернуть = Истина)

	Для каждого СтрокаДерева Из ДеревоХарактеристик.ПолучитьЭлементы() Цикл
		Элементы.ДеревоХарактеристик.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Развернуть);
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Процедура УстановитьТолькоПросмотрПланаРазвития()
	
	РазрешеноРедактированиеСтатуса = Справочники.СтатусыИндивидуальныхПлановРазвития.РазрешеноРедактированиеПланаРазвитияСЛюбымСтатусом();
	Если РазрешеноРедактированиеСтатуса Тогда
		ТолькоПросмотр = Ложь;
		Возврат;
	Иначе
		ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодборХарактеристик", "Доступность", Ложь);
	КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Справочник.СтатусыИндивидуальныхПлановРазвития.НаРассмотрении") Тогда
		ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Статус", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодборХарактеристик", "Доступность", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидимостьПланаРазвития", "ТолькоПросмотр", Ложь);
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Справочник.СтатусыИндивидуальныхПлановРазвития.Согласован") Тогда
		ТолькоПросмотр = Ложь;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапки", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ХарактеристикиПерсоналаСтраница", "ТолькоПросмотр", Истина); 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПрограммаОбученияСтраница", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияЦелиМероприятия", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МероприятияОткрытьПодборПрограммыОбученияПоХарактеристикам",
			"Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияДатаНачала", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияДатаОкончания", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияПериодыОценкиГруппа", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПодвала", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УстановитьИнтервал", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияПодборЦелейРазвития", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПодбор", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтметитьТребуетсяРазвитие", "Доступность", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвития", "ИзменятьСоставСтрок", Ложь);
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Справочник.СтатусыИндивидуальныхПлановРазвития.Остановлен") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировка", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаПередЗаписью(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВключитьНаставника(Форма, ЕстьНаставник)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Наставник", "Доступность", ЕстьНаставник);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ЗаключениеНаставника", "Видимость", ЕстьНаставник);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВключитьКуратора(Форма, ЕстьКуратор)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Куратор", "Доступность", ЕстьКуратор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ЗаключениеКуратора", "Видимость", ЕстьКуратор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФизическоеЛицоСотрудника(Сотрудник)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПроверитьПериодыМероприятийПланаРазвития(Отказ, Форма)
	
	Объект = Форма.Объект;
	ПланРазвития = Форма.ПланРазвития.ПолучитьЭлементы();
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Для Каждого Цель Из ПланРазвития Цикл
			Мероприятия = Цель.ПолучитьЭлементы();
			Для Каждого Мероприятие Из Мероприятия Цикл
				Если НЕ ЗначениеЗаполнено(Мероприятие.ДатаНачала)
					ИЛИ Мероприятие.ДатаНачала > Мероприятие.ДатаОкончания
					ИЛИ Мероприятие.ДатаНачала < Объект.ДатаНачала
					ИЛИ Мероприятие.ДатаНачала > Объект.ДатаОкончания Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период мероприятий.'"),,,, Отказ);
				ИначеЕсли НЕ ЗначениеЗаполнено(Мероприятие.ДатаОкончания)
					ИЛИ Мероприятие.ДатаОкончания < Объект.ДатаНачала
					ИЛИ Мероприятие.ДатаОкончания > Объект.ДатаОкончания Тогда
					ОбщегоНазначения.СообщитьПользователю(НСтр("ru ='Неверно заполнен период мероприятий.'"),,,, Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКорректировкуИПР()
	
	Если Параметры.Свойство("СкорректированныйИПР") И Параметры.Ключ.Пустая() Тогда
		Параметры.Свойство("СкорректированныйИПР", Объект.СкорректированныйИПР);
		Объект.Статус = Справочники.СтатусыИндивидуальныхПлановРазвития.НаРассмотрении;
		Элементы.Корректировка.Видимость = Ложь;
		Элементы.КорректировкаПодсказка.Заголовок = НСтр("ru = 'ИПР был ранее скорректирован'");
		Элементы.КорректировкаОткрыть.Видимость = Истина;
		Элементы.КорректировкаОткрыть.Заголовок = НСтр("ru = 'Открыть прошлый ИПР'");
		ТаблицыСкорректированногоИПР = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СкорректированныйИПР,
			"Мероприятия, РазвиваемыеХарактеристики");
		Объект.Мероприятия.Загрузить(ТаблицыСкорректированногоИПР.Мероприятия.Выгрузить());
		Объект.РазвиваемыеХарактеристики.Загрузить(ТаблицыСкорректированногоИПР.РазвиваемыеХарактеристики.Выгрузить());
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКорректировка", "Видимость", Ложь);
		Возврат;
	КонецЕсли;
	
	СкорректированныйИПР = СкорректированныйИПР(Объект.Ссылка);
	Если ЗначениеЗаполнено(СкорректированныйИПР) Тогда
		ЗапретитьРедактированиеСкорректированногоИПР(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Если Объект.Статус <> Справочники.СтатусыИндивидуальныхПлановРазвития.Согласован Тогда
		Элементы.ГруппаКорректировка.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаКорректировка.Видимость = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СкорректированныйИПР) Тогда
		Элементы.Корректировка.Видимость = Истина;
		Элементы.Корректировка.Заголовок = НСтр("ru = 'Скорректировать повторно'");
		Элементы.КорректировкаПодсказка.Заголовок = НСтр("ru = 'ИПР был ранее скорректирован'");
		Элементы.КорректировкаОткрыть.Видимость = Истина;
		Элементы.КорректировкаОткрыть.Заголовок = НСтр("ru = 'Открыть прошлый ИПР'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкорректированныйИПР(ИПР)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИПР", ИПР);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИндивидуальныйПланРазвития.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИндивидуальныйПланРазвития КАК ИндивидуальныйПланРазвития
		|ГДЕ
		|	ИндивидуальныйПланРазвития.СкорректированныйИПР = &ИПР
		|	И НЕ ИндивидуальныйПланРазвития.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗапретитьРедактированиеСкорректированногоИПР(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.КоманднаяПанель.Доступность = Ложь;
	Форма.Элементы.ГруппаКомандыХарактеристик.Доступность = Ложь;
	Форма.Элементы.ГруппаШапки.ТолькоПросмотр = Истина;
	Форма.Элементы.ТаблицыСтраница.ТолькоПросмотр = Истина;
	Форма.Элементы.ГруппаПодвала.ТолькоПросмотр = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УстановитьИнтервал", "Доступность", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвитияПодборЦелейРазвития", "Доступность", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КоманднаяПанельПланРазвития", "Доступность", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПланРазвития", "ИзменятьСоставСтрок", Ложь);
	
	Элементы.Корректировка.Видимость = Ложь;
	Элементы.КорректировкаПредупреждениеСтрока.Видимость = Истина;
	Элементы.КорректировкаПодсказка.Видимость = Ложь;
	Элементы.КорректировкаОткрыть.Видимость = Истина;
	Элементы.КорректировкаОткрыть.Заголовок = НСтр("ru = 'Открыть скорректированный ИПР'");
	
КонецПроцедуры

&НаСервере
Функция ПараметрыПодбораЦелейРазвития()

	ПараметрыПодбора = Новый Структура;
	РазвиваемыеХарактеристики = Характеристики.Выгрузить(Новый Структура("ТребуетсяОбучение", Истина),
		"Характеристика,КартинкаВида,ТребуетсяОбучение");
	Если РазвиваемыеХарактеристики.Количество() = 0 Тогда
		Возврат ПараметрыПодбора;
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("АдресХарактеристикПерсонала", АдресРазвиваемыхХарактеристик(РазвиваемыеХарактеристики));
	ПараметрыПодбора.Вставить("АдресЦелей", АдресЦелей());
	ПараметрыПодбора.Вставить("АдресПрограммыОбучения", АдресПрограммыОбучения());  
	
	Возврат ПараметрыПодбора;

КонецФункции

&НаСервере
Процедура ЗагрузитьЦелиМероприятия(ТекущийОбъект)
	
	// Загружаем цели и мероприятия в ТЧ
	ТекущийОбъект.ЦелиРазвития.Очистить();
	ТекущийОбъект.Мероприятия.Очистить();
	Если Объект.ИспользоватьПрогрессРазвития Тогда
		ПрогрессМероприятий = Новый Соответствие;
	КонецЕсли;
	Дерево = РеквизитФормыВЗначение("ПланРазвития");
	Если Не ТекущийОбъект.ИспользоватьПрогрессРазвития Тогда
		Для Каждого СтрокаЦели Из Дерево.Строки Цикл
			НоваяСтрокаЦель = ТекущийОбъект.ЦелиРазвития.Добавить();
			НоваяСтрокаЦель.Цель = СтрокаЦели.Цель;
			Для Каждого СтрокаМероприятия Из СтрокаЦели.Строки Цикл
				ДобавитьСтрокуМероприятия(ТекущийОбъект, СтрокаЦели, СтрокаМероприятия);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого СтрокаЦели Из Дерево.Строки Цикл
			НоваяСтрокаЦель = ТекущийОбъект.ЦелиРазвития.Добавить();
			НоваяСтрокаЦель.Цель = СтрокаЦели.Цель;
			Для Каждого СтрокаМероприятия Из СтрокаЦели.Строки Цикл
				ДобавитьСтрокуМероприятия(ТекущийОбъект, СтрокаЦели, СтрокаМероприятия);
				Если Объект.ИспользоватьПрогрессРазвития Тогда
					ДобавитьПрогрессМероприятия(ТекущийОбъект, СтрокаМероприятия, ПрогрессМероприятий);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если Объект.ИспользоватьПрогрессРазвития Тогда
			АдресПрогрессаМероприятий = ПоместитьВоВременноеХранилище(ПрогрессМероприятий);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьСтрокуМероприятия(ТекущийОбъект, СтрокаЦели, СтрокаМероприятия)
	
	НоваяСтрокаМероприятие = ТекущийОбъект.Мероприятия.Добавить();
	НоваяСтрокаМероприятие.Цель = СтрокаЦели.Цель;
	НоваяСтрокаМероприятие.Мероприятие = СтрокаМероприятия.Мероприятие;
	НоваяСтрокаМероприятие.ДатаНачала = СтрокаМероприятия.ДатаНачала;
	НоваяСтрокаМероприятие.ДатаОкончания = СтрокаМероприятия.ДатаОкончания;
	НоваяСтрокаМероприятие.Ответственный = СтрокаМероприятия.Ответственный;
	НоваяСтрокаМероприятие.РезультатВыполнения = СтрокаМероприятия.Результат;
	НоваяСтрокаМероприятие.Обучение = СтрокаМероприятия.Обучение;
	НоваяСтрокаМероприятие.ВыбранноеОбучение = СтрокаМероприятия.ВыбранноеОбучение;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПрогрессМероприятия(ТекущийОбъект, СтрокаМероприятия, ПрогрессМероприятий)
	
	ПрогрессМероприятия = Новый Соответствие;
	Для Номер = 1 По ТекущийОбъект.ПродолжительностьПрогрессаРазвития Цикл
		Прогресс = СтрокаМероприятия["Прогресс" + Номер];
		ПрогрессМероприятия.Вставить(Номер, Прогресс);
	КонецЦикла;
	ПрогрессМероприятий.Вставить(СтрокаМероприятия.Мероприятие, ПрогрессМероприятия);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЗначенийПрогресса()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПрогрессаОбучения.Ссылка КАК Сслыка,
		|	ЗначенияПрогрессаОбучения.Прогресс КАК Прогресс
		|ИЗ
		|	Справочник.ЗначенияПрогрессаОбучения КАК ЗначенияПрогрессаОбучения";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаЗначенийПрогресса = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ТаблицаЗначенийПрогресса.Вставить(Выборка.Сслыка, Выборка.Прогресс);
	КонецЦикла;
	
	Возврат ТаблицаЗначенийПрогресса;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьОснования(Форма)
	
	ЧтениеКадровогоРезерва = ПравоДоступа("Чтение", Метаданные.Справочники.КадровыйРезерв);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Основание", "Видимость", ЧтениеКадровогоРезерва);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияПрогрессаОбученияНаСервере()
	
	Возврат Справочники.ЗначенияПрогрессаОбучения.ЗначенияПрогрессаОбучения();
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВопросИспользованияПланаРазвития()
	
	Оповещение = Новый ОписаниеОповещения("ПоказатьВопросИспользованияПланаРазвитияЗавершение", ЭтотОбъект);
	
	ТекстВопроса = СтрШаблон(НСтр("ru = '%1. %2'"),
		"В индивидуальном плане развития заполнена программа обучения",
		"Переключение на план развития потребует повторного подбора мероприятий в рамках целей развития");
	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Продолжить'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Использование плана развития'");
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, КнопкиВопроса, ПараметрыВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросИспользованияПланаРазвитияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатВопроса) Или Не РезультатВопроса.Значение = КодВозвратаДиалога.Да Тогда
		ВидимостьПланаРазвития = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьПланаРазвития();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьПланаРазвития()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПрограммаОбученияСтраница", "Видимость", Не ВидимостьПланаРазвития);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПланРазвитияСтраница", "Видимость", ВидимостьПланаРазвития);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПодборЦелейРазвития", "Видимость", ВидимостьПланаРазвития);
	ЗаполнитьРезультатыОбучения();
	
КонецПроцедуры

&НаСервере
Функция ИспользуютсяЦелиРазвития()
	
	ИспользуютсяЦелиРазвития =
		ИспользоватьЦелиРазвитияСотрудников
		И ВидимостьПланаРазвития;
	
	Возврат ИспользуютсяЦелиРазвития;
	
КонецФункции

#КонецОбласти