
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает способы разбора резюме.
// 
// Возвращаемое значение:
//  Структура - структура способов разбора резюме.
//
Функция СпособыРазбораРезюме() Экспорт
	
	Способы = Новый Структура();
	Способы.Вставить("ВнутреннийРазбор", "ВнутреннийРазбор");
	Способы.Вставить("ВнешнийСервис", "ВнешнийСервис");
	Возврат Способы;
	
КонецФункции

// Источник информации по тексту резюме.
//
// Параметры:
//  ТекстРезюме	 - Строка - текст резюме.
// 
// Возвращаемое значение:
//  СправочникСсылка.ИсточникиИнформацииОКандидатах.
//
Функция ИсточникИнформацииПоТексту(ТекстРезюме) Экспорт
	
	ИсточникИнформации = Неопределено;
	
	ПерваяСтрока = СтрПолучитьСтроку(ТекстРезюме, 1);
	ПоследняяСтрока = СтрПолучитьСтроку(ТекстРезюме, СтрЧислоСтрок(ТекстРезюме));
	
	СтрокаПоиска = ПерваяСтрока + ПоследняяСтрока;
	
	Если СтрокаСодержитКлюч(СтрокаПоиска, "HeadHunter") Тогда
		ИсточникИнформации = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter");
	ИначеЕсли СтрокаСодержитКлюч(СтрокаПоиска, "SuperJob") Тогда
		ИсточникИнформации = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.SuperJob");
	ИначеЕсли СтрокаСодержитКлюч(СтрокаПоиска, "Rabota") Тогда
		ИсточникИнформации = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.РаботаРу");
	ИначеЕсли СтрокаСодержитКлюч(СтрокаПоиска, "RabotaMail") Тогда
		ИсточникИнформации = ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.RabotaMail");
	КонецЕсли;
	
	Возврат ИсточникИнформации;
	
КонецФункции

// Определяет по расширению, принадлежит ли файл семейству MS Word.
// 
// Параметры:
//  Расширение - Строка - расширение файла
// 
// Возвращаемое значение:
//  Булево - Истина, если это файл, семейства MS Word
//
Функция ЭтоФорматWord(Расширение) Экспорт
	Возврат РасширенияWord().Найти(ВРег(Расширение)) <> Неопределено;
КонецФункции

// Определяет по расширению, принадлежит ли файл семейству Adobe PDF.
// 
// Параметры:
//  Расширение - Строка - расширение файла
// 
// Возвращаемое значение:
//  Булево - Истина, если это файл, семейства Adobe PDF
//
Функция ЭтоФорматPDF(Расширение) Экспорт
	Возврат РасширенияPDF().Найти(ВРег(Расширение)) <> Неопределено;
КонецФункции

// Определяет по расширению, принадлежит ли файл семейству текстовых файлов.
// 
// Параметры:
//  Расширение - Строка - расширение файла
// 
// Возвращаемое значение:
//  Булево - Истина, если это файл, семейства текстовых файлов
//
Функция ЭтоФорматTXT(Расширение) Экспорт
	Возврат РасширенияTXT().Найти(ВРег(Расширение)) <> Неопределено;
КонецФункции

// Возвращает расширения семейства MS Word.
Функция РасширенияWord() Экспорт
	
	Расширения = Новый Массив;
	Расширения.Добавить("DOC");
	Расширения.Добавить("DOCX");
	Расширения.Добавить("RTF");
	Возврат Расширения;
	
КонецФункции

// Возвращает расширения семейства Adobe PDF.
Функция РасширенияPDF() Экспорт
	
	Расширения = Новый Массив;
	Расширения.Добавить("PDF");
	Возврат Расширения;
	
КонецФункции

// Возвращает расширение семейства текстовых файлов.
Функция РасширенияTXT() Экспорт
	
	Расширения = Новый Массив;
	Расширения.Добавить("TXT");
	Возврат Расширения;
	
КонецФункции

// Возвращает текст после нормализации.
Функция ТекстПослеНормализации(Текст) Экспорт
	
	Если Текст = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Текст) Тогда
		Текст = СтрЗаменить(Текст, Символ(11), "  ");
		Текст = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Текст);
	КонецЕсли;
	
	// Удаляем символы цитирования и пустые символы по краям строки.
	ТекстРезультата = Новый ТекстовыйДокумент;
	Для Индекс = 1 По СтрЧислоСтрок(Текст) Цикл
		
		Строка = СтрПолучитьСтроку(Текст, Индекс);
		Строка = СокрЛП(Строка);
		Пока КодСимвола(Строка) = КодСимвола(">") Цикл
			Строка = Сред(Строка, 2);
			Строка = СокрЛП(Строка);
			Если Не СтрЗаканчиваетсяНа(Строка, ".") Тогда
				Строка = Строка + ".";
			КонецЕсли;
		КонецЦикла;
		ТекстРезультата.ДобавитьСтроку(Строка);
		
	КонецЦикла;
	Текст = ТекстРезультата.ПолучитьТекст();
	Текст = СокрЛП(Текст);
	
	// Исправляем лишние переводы строки.
	ДлинаТекста = СтрДлина(Текст);
	ОбработатьТекст = Истина;
	Пока ОбработатьТекст Цикл
		// При нормализации используется "!", а не ".", во избежании появления лишних дат.
		Текст = СтрЗаменить(Текст, Символы.ПС + Символы.ПС + Символы.ПС, Символы.ПС + Символы.ПС);
		Текст = СтрЗаменить(Текст, "   ", " ");
		Текст = СтрЗаменить(Текст, "  ", " ");
		Текст = СтрЗаменить(Текст, " " + Символы.ПС, Символы.ПС);
		Текст = СтрЗаменить(Текст, "?.", "?");
		Текст = СтрЗаменить(Текст, "?!", "?");
		Текст = СтрЗаменить(Текст, "!.", "!");
		Текст = СтрЗаменить(Текст, "!!", "!");
		Текст = СтрЗаменить(Текст, ".!", ".");
		Текст = СтрЗаменить(Текст, "--", "-");
		Текст = СокрЛП(Текст);
		
		ОбработатьТекст = ДлинаТекста <> СтрДлина(Текст);
		ДлинаТекста = СтрДлина(Текст);
		
	КонецЦикла;
	
	// АПК:163-выкл.
	// Корректировка ё.
	Текст = СтрЗаменить(Текст, "Ё", "Е");
	Текст = СтрЗаменить(Текст, "ё", "е");
	// АПК:163-вкл.
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаСодержитКлюч(СтрокаПоиска, Ключ)
	
	Возврат СтрНайти(НРег(СтрокаПоиска), НРег(Ключ)) > 0;
	
КонецФункции

#КонецОбласти



