#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Параметры.АдресПараметровВХранилище) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// "Распаковываем" параметры
	ПараметрыРасчета = ПолучитьИзВременногоХранилища(Параметры.АдресПараметровВХранилище);
	
	ДесериализованныйОбъект = ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ПараметрыРасчета.СериализованныйОбъект);
	ЗначениеВДанныеФормы(ДесериализованныйОбъект, Объект);
	
	Элементы.ГруппаКнопокПросмотр.Видимость = ТолькоПросмотр;
	Элементы.ГруппаКнопокРедактирование.Видимость = НЕ ТолькоПросмотр;
	Если ТолькоПросмотр Тогда
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаОК.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	ЦветаСтиляПоясняющийТекст = ЦветаСтиля.ПоясняющийТекст;
	ЦветаСтиляПоясняющийОшибкуТекст = ЦветаСтиля.ПоясняющийОшибкуТекст;
	
	УстановитьИнфоНадпись(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИдентификаторВладельца = ВладелецФормы.УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		ВопросСохранитьИзменения();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаТаблицы Из Объект.СтатьиФинансирования Цикл
		Если СтрокаТаблицы.ПроцентРаспределения = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В строке %1 не заполнена колонка ""Процент распределения""'"),
				СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СтатьиФинансирования[" + Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ПроцентРаспределения", "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	СтатьиФинансированияИсходные = ОбщегоНазначения.ВыгрузитьКолонку(Объект.СтатьиФинансирования, "СтатьяФинансирования");
	СтатьиФинансированияСвернутые = ОбщегоНазначения.ВыгрузитьКолонку(Объект.СтатьиФинансирования, "СтатьяФинансирования", Истина);
	
	Если СтатьиФинансированияИсходные.Количество() <> СтатьиФинансированияСвернутые.Количество() Тогда
		Для Каждого ЗначениеМассива Из СтатьиФинансированияСвернутые Цикл
			МассивСтрок = Объект.СтатьиФинансирования.НайтиСтроки(Новый Структура("СтатьяФинансирования", ЗначениеМассива));
			Если МассивСтрок.Количество() > 1 Тогда
				ПереченьСтрок = "";
				Для Каждого СтрокаМассива Из МассивСтрок Цикл
					ПереченьСтрок = ПереченьСтрок + ?(ПереченьСтрок = "", "", ", ") + СтрокаМассива.НомерСтроки;
				КонецЦикла;
				Для Каждого СтрокаМассива Из МассивСтрок Цикл
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='В строках %1 дублируются значения в колонке ""Статья финансирования""'"),
						ПереченьСтрок);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "СтатьиФинансирования[" + Формат(СтрокаМассива.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СтатьяФинансирования", "Объект", Отказ);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РаспределеннаяСумма = Объект.СтатьиФинансирования.Итог("ПроцентРаспределения");
	ОстатокРаспределения = 100 - РаспределеннаяСумма;
	Если ОстатокРаспределения <> 0 Тогда
		ТекстСообщения = ТекстСообщенияРезультатаРаспределения(ОстатокРаспределения);
		ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			,
			"СтатьиФинансирования",
			"Объект",
			Отказ);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура OK(Команда) 
	
	Если НЕ Модифицированность ИЛИ ТолькоПросмотр Тогда
		Закрыть();
	Иначе
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		ПодготовитьФормуКПринятиюИзменений();
		Закрыть(АдресВХранилище);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтатьиФинансирования

&НаКлиенте
Процедура СтатьиФинансированияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьИнфоНадпись(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиФинансированияПослеУдаления(Элемент)
	
	УстановитьИнфоНадпись(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСообщенияРезультатаРаспределения(ОстатокРаспределения)
	
	Если ОстатокРаспределения = 0 Тогда
		ТекстСообщения = "";
	ИначеЕсли ОстатокРаспределения > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не распределено %1'"), Формат(ОстатокРаспределения, "ЧДЦ=2; ЧН=0,00"));
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Распределено больше на %1'"), Формат(- ОстатокРаспределения, "ЧДЦ=2; ЧН=0,00"));
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИнфоНадпись(Форма)
	
	РаспределеннаяСумма = Форма.Объект.СтатьиФинансирования.Итог("ПроцентРаспределения");
	ОстатокРаспределения = 100 - РаспределеннаяСумма;
	
	Форма.РезультатРаспределенияИнфоНадпись = ТекстСообщенияРезультатаРаспределения(ОстатокРаспределения);
	
	Если ОстатокРаспределения <> 0 Тогда
		Форма.Элементы.ПредупреждениеКартинка.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"РезультатРаспределенияИнфоНадпись",
			"ЦветТекста",
			Форма.ЦветаСтиляПоясняющийОшибкуТекст);
	Иначе
		Форма.Элементы.ПредупреждениеКартинка.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьИзменения()
	
	ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьИзмененияЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьИзмененияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		ПодготовитьФормуКПринятиюИзменений();
		Закрыть(АдресВХранилище);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуКПринятиюИзменений()
	
	АдресВХранилище = Документы.ПереносРезервовМеждуСтатьямиФинансирования.АдресПараметровВХранилище(РеквизитФормыВЗначение("Объект"),
		Новый Структура("УникальныйИдентификатор", ИдентификаторВладельца));
	
	Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти
