// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Открыть форму нового документа Решение о приеме на работу.
// 
// Параметры:
//  Кандидат - СправочникСсылка.Кандидаты
//  ЗначенияЗаполнения - Неопределено - Значения заполнения
Процедура ОткрытьФормуНовогоРешенияОПриемеНаРаботу(Кандидат, ЗначенияЗаполнения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура());
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Кандидат", Кандидат);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Конкурсы") Тогда
		МодульКонкурсыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КонкурсыКлиент");
		МодульКонкурсыКлиент.ВставитьЗначениеЗаполненияКонкурс(ПараметрыФормы, ЗначенияЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.РешениеОПриемеНаРаботу.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект, Кандидат);
	
КонецПроцедуры

// Открыть форму нового документа Решение о кадровом переводе.
// 
// Параметры:
//  Сотрудник - СправочникСсылка.Сотрудники
//  ЗначенияЗаполнения - Неопределено - Значения заполнения
Процедура ОткрытьФормуНовогоРешенияОКадровомПереводе(Сотрудник, ЗначенияЗаполнения = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура());
	ПараметрыФормы.ЗначенияЗаполнения.Вставить("Сотрудник", Сотрудник);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Конкурсы") Тогда
		МодульКонкурсыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КонкурсыКлиент");
		МодульКонкурсыКлиент.ВставитьЗначениеЗаполненияКонкурс(ПараметрыФормы, ЗначенияЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.РешениеОКадровомПереводе.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект, Сотрудник);
	
КонецПроцедуры

Процедура ОткрытьФормуВыбораКандидатаРешенияОПриемеНаРаботу(ПараметрыОткрытияФормы, Владелец) Экспорт

	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаВыбораКандидатаРешенияОПриемеНаРаботу", ПараметрыОткрытияФормы, Владелец, Истина);

КонецПроцедуры

#КонецОбласти