// Регистрация ЗУП от 23.06.2026 17:23:26
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает представление регистрации.
// Возвращаемое значение:
//  Строка.
Функция ИнформацияОПравилах() Экспорт

	Параметры = ПараметрыРегистрации();
	ШаблонТекста = НСтр("ru = 'Правила регистрации объектов этой информационной базы (%1 версия %2) от %3'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонТекста, 
		Параметры.СинонимКонфигурации, Параметры.ВерсияКонфигурации, Параметры.ДатаВремяСоздания);	
	
КонецФункции

// Возвращает ключевые параметры регистрации в виде структуры.
// Возвращаемое значение:
//  Структура.
Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Наименование = НСтр("ru = 'ЗУП'");
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ДатаВремяСоздания", Дата(2026,6,23,17,23,0));
	Результат.Вставить("ПланаОбмена", "СинхронизацияДанныхЧерезУниверсальныйФормат");
	Результат.Вставить("Конфигурация", "БЗКР");
	СинонимКонфигурации = "БЗКР 3.1.38";
	ТекстСинонимКонфигурации = НСтр("ru = '%1'");
	ТекстСинонимКонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСинонимКонфигурации, СинонимКонфигурации);
	Результат.Вставить("СинонимКонфигурации", ТекстСинонимКонфигурации);
	Результат.Вставить("ВерсияКонфигурации", "3.1.38.32");

	Возврат Результат;
КонецФункции

// Заполняет таблицу правил регистрации объектов.
//
// Параметры:
//  ПравилаРегистрацииОбъектов - ТаблицаЗначений - таблица значений, в которую добавляются правила
//  ИмяМенеджераРегистрации - Строка - Имя модуля менеджера правил регистрации объектов 
Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	Если ПравилаРегистрацииОбъектов.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ПравилаРегистрацииОбъектов.Колонки.Добавить("Идентификатор");
	КонецЕсли;
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыПеречислением(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ОтражениеЗарплатыВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ПлатежноеПоручение(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВБанк(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьПрочихДоходовВБанк(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьПрочихДоходовВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ВедомостьПрочихДоходовПеречислением(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ДепонированиеЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_РегламентированныйОтчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ОтражениеСтатистикиПерсоналаВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ИсполнительныйЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_РезервыПоОплатеТруда(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ОтражениеУдержанногоНДФЛВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыРаботСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ЗарплатныеПроекты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтруктураПредприятия(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_РегистрацииВНалоговомОргане(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ПодразделенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФизическиеЛица2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Резервы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтатьиФинансированияЗарплата(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Должности(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ШтатноеРасписание(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Должности2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов3(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ФИОФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ДокументыФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_НастройкиРасчетаРезервовОтпусков(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_КадроваяИсторияСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ВидыЗанятостиСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

// Обработчик события ПередОбработкой правила регистрации 
// Параметры:
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Справочник_Организации" Тогда 
		ПРО_Справочник_Организации_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Справочник_БанковскиеСчетаКонтрагентов3" Тогда 
		ПРО_Справочник_БанковскиеСчетаКонтрагентов3_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_ФИОФизическихЛиц" Тогда 
		ПРО_РегистрСведений_ФИОФизическихЛиц_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия" Тогда 
		ПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриОбработке правила регистрации
// Параметры:
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ТекстЗапроса - Строка - текст запроса для определения узлов получателей.
//  ПараметрыЗапроса - Структура - параметры запроса для определения узлов получателей.
//  ИспользоватьКэш - Булево - использование платформенного механизма повторно используемых значений.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта. 
//  ДополнительныеСвойства - Структура.
Процедура ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства) Экспорт
	Если ПРО.Идентификатор = "РегистрСведений_ДокументыФизическихЛиц" Тогда 
		ПРО_РегистрСведений_ДокументыФизическихЛиц_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПослеОбработки правила регистрации 
// Параметры:    
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Получатели - Массив - список узлов-получателей, на которых будет зарегистрирован объект.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Справочник_Сотрудники" Тогда 
		ПРО_Справочник_Сотрудники_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_ДокументыФизическихЛиц" Тогда 
		ПРО_РегистрСведений_ДокументыФизическихЛиц_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_КадроваяИсторияСотрудников" Тогда 
		ПРО_РегистрСведений_КадроваяИсторияСотрудников_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_ВидыЗанятостиСотрудников" Тогда 
		ПРО_РегистрСведений_ВидыЗанятостиСотрудников_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия" Тогда 
		ПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ВыполнитьПравилаРегистрацииДляОбъекта(Объект, ИмяПланаОбмена, Отправитель)
	ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Объект, ИмяПланаОбмена, Отправитель);
КонецПроцедуры

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
	Обработка = Обработки.ЗагрузкаПравилРегистрацииОбъектов.Создать();
	
	ПравилаXML = Новый ЧтениеXML;
	
	//ОтборПоСвойствамПланаОбмена
	ПравилоРегистрации.ОтборПоСвойствамПланаОбмена = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамПланаОбмена().Скопировать();
	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамПланаОбмена);
	ПравилаXML.Прочитать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамПланаОбмена);
	
	Обработка.Регистрация = Новый Структура("ИмяПланаОбмена", ПравилоРегистрации.ИмяПланаОбмена);
	Обработка.ПодготовитьПравилоРегистрацииПоСвойствамПланаОбмена(ПравилоРегистрации);
	
	//ОтборПоСвойствамОбъекта
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамОбъекта);
	ПравилаXML.Прочитать();
	
	ПравилоРегистрации.ОтборПоСвойствамОбъекта = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамОбъекта().Скопировать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамОбъекта);
КонецПроцедуры 

#Область Документ_ВедомостьНаВыплатуЗарплатыВКассу
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплатыВКассу";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплатыВКассу";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_4(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры

#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплатыРаздатчиком";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_4(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры

#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыПеречислением
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыПеречислением(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплатыПеречислением";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплатыПеречислением";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_4(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры

#КонецОбласти
#Область Документ_НачислениеОценочныхОбязательствПоОтпускам
Процедура ДобавитьПРО_Документ_НачислениеОценочныхОбязательствПоОтпускам(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_НачислениеОценочныхОбязательствПоОтпускам";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.НачислениеОценочныхОбязательствПоОтпускам";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_НачислениеОценочныхОбязательствПоОтпускам_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_НачислениеОценочныхОбязательствПоОтпускам_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРезервы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРезервы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ОтражениеЗарплатыВБухучете
Процедура ДобавитьПРО_Документ_ОтражениеЗарплатыВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ОтражениеЗарплатыВБухучете";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ОтражениеЗарплатыВБухучете";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ОтражениеЗарплатыВБухучете_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_ОтражениеЗарплатыВБухучете_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьБухучет</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьБухучет</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ПлатежноеПоручение
Процедура ДобавитьПРО_Документ_ПлатежноеПоручение(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ПлатежноеПоручение";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ПлатежноеПоручение";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ПлатежноеПоручение_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_ПлатежноеПоручение_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомостиКакЗаявки</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомостиКакЗаявки</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>true</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[Организации]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ВедомостьНаВыплатуЗарплатыВБанк
Процедура ДобавитьПРО_Документ_ВедомостьНаВыплатуЗарплатыВБанк(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьНаВыплатуЗарплатыВБанк";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьНаВыплатуЗарплатыВБанк";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьНаВыплатуЗарплатыВБанк_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_ВедомостьНаВыплатуЗарплатыВБанк_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомостиКакЗаявки</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>false</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомостиКакЗаявки</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВБанк
Процедура ДобавитьПРО_Документ_ВедомостьПрочихДоходовВБанк(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьПрочихДоходовВБанк";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьПрочихДоходовВБанк";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьПрочихДоходовВБанк_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Документ_ВедомостьПрочихДоходовВБанк_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомостиКакЗаявки</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>false</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомостиКакЗаявки</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовВКассу
Процедура ДобавитьПРО_Документ_ВедомостьПрочихДоходовВКассу(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьПрочихДоходовВКассу";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьПрочихДоходовВКассу";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьПрочихДоходовВКассу_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Документ_ВедомостьПрочихДоходовВКассу_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ВедомостьПрочихДоходовПеречислением
Процедура ДобавитьПРО_Документ_ВедомостьПрочихДоходовПеречислением(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВедомостьПрочихДоходовПеречислением";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВедомостьПрочихДоходовПеречислением";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ВедомостьПрочихДоходовПеречислением_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Документ_ВедомостьПрочихДоходовПеречислением_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ДепонированиеЗарплаты
Процедура ДобавитьПРО_Документ_ДепонированиеЗарплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ДепонированиеЗарплаты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ДепонированиеЗарплаты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_4(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Документ_РегламентированныйОтчет
Процедура ДобавитьПРО_Документ_РегламентированныйОтчет(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_РегламентированныйОтчет";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.РегламентированныйОтчет";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_РегламентированныйОтчет_ОтборПоСвойствамПланаОбмена(),
		Документ_РегламентированныйОтчет_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_РегламентированныйОтчет_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРегламентированныеОтчеты</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРегламентированныеОтчеты</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Документ_РегламентированныйОтчет_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчет4ФСС</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчет6НДФЛ</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчетРасчетПоСтраховымВзносам</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчет6_НДФЛ</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчетПерсонифицированныеСведенияОФизическихЛицах</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ИсточникОтчета</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>РегламентированныйОтчетЕФС1ОСС</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ИсточникОтчета</Наименование>
			|					<Тип>Строка</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Документ_ОтражениеСтатистикиПерсоналаВБухучете
Процедура ДобавитьПРО_Документ_ОтражениеСтатистикиПерсоналаВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ОтражениеСтатистикиПерсоналаВБухучете";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ОтражениеСтатистикиПерсоналаВБухучете";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ОтражениеСтатистикиПерсоналаВБухучете_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_ОтражениеСтатистикиПерсоналаВБухучете_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьСтатистикуПерсонала</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьСтатистикуПерсонала</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.8</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ИсполнительныйЛист
Процедура ДобавитьПРО_Документ_ИсполнительныйЛист(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ИсполнительныйЛист";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ИсполнительныйЛист";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

#КонецОбласти
#Область Документ_РезервыПоОплатеТруда
Процедура ДобавитьПРО_Документ_РезервыПоОплатеТруда(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_РезервыПоОплатеТруда";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.РезервыПоОплатеТруда";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_РезервыПоОплатеТруда_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_РезервыПоОплатеТруда_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРезервы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРезервы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_ОтражениеУдержанногоНДФЛВБухучете
Процедура ДобавитьПРО_Документ_ОтражениеУдержанногоНДФЛВБухучете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ОтражениеУдержанногоНДФЛВБухучете";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ОтражениеУдержанногоНДФЛВБухучете";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ОтражениеУдержанногоНДФЛВБухучете_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_ОтражениеУдержанногоНДФЛВБухучете_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьУдержанныйНДФЛ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьУдержанныйНДФЛ</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Контрагенты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Контрагенты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентов
Процедура ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчетаКонтрагентов";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчетаКонтрагентов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_2(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_СпособыОтраженияЗарплатыВБухУчете
Процедура ДобавитьПРО_Справочник_СпособыОтраженияЗарплатыВБухУчете(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СпособыОтраженияЗарплатыВБухУчете";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СпособыОтраженияЗарплатыВБухУчете";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_ВидыРаботСотрудников
Процедура ДобавитьПРО_Справочник_ВидыРаботСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыРаботСотрудников";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыРаботСотрудников";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ВидыРаботСотрудников_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_ВидыРаботСотрудников_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВидыРабот</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВидыРабот</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ЗарплатныеПроекты
Процедура ДобавитьПРО_Справочник_ЗарплатныеПроекты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ЗарплатныеПроекты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ЗарплатныеПроекты";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ЗарплатныеПроекты_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_ЗарплатныеПроекты_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомостиКакЗаявки</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомостиКакЗаявки</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>true</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[Организации]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_Пользователи
Процедура ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Пользователи";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Пользователи";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФизическиеЛица";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФизическиеЛица";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_СтруктураПредприятия
Процедура ДобавитьПРО_Справочник_СтруктураПредприятия(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтруктураПредприятия";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтруктураПредприятия";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_СтруктураПредприятия_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_СтруктураПредприятия_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьСтруктуруПредприятия</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьСтруктуруПредприятия</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_Организации
Процедура ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Организации";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Организации";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Организации_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_Организации_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Ссылка</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Свойство</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_Справочник_Организации_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Отказ = Объект.Предопределенный;
КонецПроцедуры
#КонецОбласти
#Область Справочник_РегистрацииВНалоговомОргане
Процедура ДобавитьПРО_Справочник_РегистрацииВНалоговомОргане(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_РегистрацииВНалоговомОргане";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.РегистрацииВНалоговомОргане";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_РегистрацииВНалоговомОргане_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_РегистрацииВНалоговомОргане_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРегистрацииНО</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРегистрацииНО</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Владелец</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Владелец</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Свойство</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ПодразделенияОрганизаций
Процедура ДобавитьПРО_Справочник_ПодразделенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ПодразделенияОрганизаций";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ПодразделенияОрганизаций";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_ФизическиеЛица2
Процедура ДобавитьПРО_Справочник_ФизическиеЛица2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФизическиеЛица2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФизическиеЛица";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_2(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Резервы
Процедура ДобавитьПРО_Справочник_Резервы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Резервы";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Резервы";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Резервы_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_Резервы_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРезервы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРезервы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_НастройкиРасчетаРезервовПоОплатеТруда
Процедура ДобавитьПРО_Справочник_НастройкиРасчетаРезервовПоОплатеТруда(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_НастройкиРасчетаРезервовПоОплатеТруда";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.НастройкиРасчетаРезервовПоОплатеТруда";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_НастройкиРасчетаРезервовПоОплатеТруда_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_НастройкиРасчетаРезервовПоОплатеТруда_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРезервы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРезервы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_СтатьиФинансированияЗарплата
Процедура ДобавитьПРО_Справочник_СтатьиФинансированияЗарплата(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтатьиФинансированияЗарплата";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтатьиФинансированияЗарплата";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Сотрудники
Процедура ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Сотрудники";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Сотрудники";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_3(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Процедура ПРО_Справочник_Сотрудники_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ОбменДаннымиУниверсальныйФормат.СотрудникиПослеОбработкиПравила(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели);
КонецПроцедуры
#КонецОбласти
#Область Справочник_Должности
Процедура ДобавитьПРО_Справочник_Должности(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Должности";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Должности";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Должности_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

Функция Справочник_Должности_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВсеДолжности</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>false</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВсеДолжности</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ШтатноеРасписание
Процедура ДобавитьПРО_Справочник_ШтатноеРасписание(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ШтатноеРасписание";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ШтатноеРасписание";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_3(),
		ОтборПоСвойствамОбъекта_3());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Должности2
Процедура ДобавитьПРО_Справочник_Должности2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Должности2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Должности";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Должности2_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Должности2_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВсеДолжности</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВсеДолжности</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентов2
Процедура ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчетаКонтрагентов2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчетаКонтрагентов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_БанковскиеСчетаКонтрагентов3
Процедура ДобавитьПРО_Справочник_БанковскиеСчетаКонтрагентов3(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчетаКонтрагентов3";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчетаКонтрагентов";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_БанковскиеСчетаКонтрагентов3_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_ФИОФизическихЛиц
Процедура ДобавитьПРО_РегистрСведений_ФИОФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ФИОФизическихЛиц";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ФИОФизическихЛиц";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		РегистрСведений_ФИОФизическихЛиц_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_ФИОФизическихЛиц_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>true</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>ФизическоеЛицо</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>ФизическоеЛицо</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Измерение</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[Организации]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>Организация</Наименование>
			|						<Тип>СправочникСсылка.Организации</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_РегистрСведений_ФИОФизическихЛиц_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Отказ = Истина;
	ФизическоеЛицо = Объект.Отбор.ФизическоеЛицо.Значение;
	
	Если Не Выгрузка
		И ОбщегоНазначения.СсылкаСуществует(ФизическоеЛицо) Тогда
		ФизическоеЛицоОбъект = ФизическоеЛицо.ПолучитьОбъект();
		Если Не ФизическоеЛицоОбъект.Предопределенный Тогда
			ВыполнитьПравилаРегистрацииДляОбъекта(ФизическоеЛицо.ПолучитьОбъект(), ПРО.ИмяПланаОбмена, Объект.ОбменДанными.Отправитель);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_ДокументыФизическихЛиц
Процедура ДобавитьПРО_РегистрСведений_ДокументыФизическихЛиц(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ДокументыФизическихЛиц";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ДокументыФизическихЛиц";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамПланаОбмена(),
		РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.0.beta</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.0</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.1</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВерсияФорматаОбмена</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>1.2</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВерсияФорматаОбмена</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция РегистрСведений_ДокументыФизическихЛиц_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Физлицо.ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Физлицо</Наименование>
			|				<Тип>СправочникСсылка.ФизическиеЛица</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидДокумента.ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидДокумента</Наименование>
			|				<Тип>СправочникСсылка.ВидыДокументовФизическихЛиц</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЯвляетсяДокументомУдостоверяющимЛичность</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЯвляетсяДокументомУдостоверяющимЛичность</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Ресурс</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

Процедура ПРО_РегистрСведений_ДокументыФизическихЛиц_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_РегистрСведений_ДокументыФизическихЛиц_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	Получатели.Очистить();
	
	Если Объект.Количество() > 0 Тогда
		
		ИмяКолонкиОбъектаВладелец = "Физлицо";
		
		МассивОбъектовВладельцев = Новый Массив;
		Для каждого ЗаписьНабора Из Объект Цикл
			
			Если МассивОбъектовВладельцев.Найти(ЗаписьНабора[ИмяКолонкиОбъектаВладелец]) <> Неопределено Тогда
				// Получатели для этого ОбъектаВладельца уже определены
				Продолжить;
			КонецЕсли;
			МассивОбъектовВладельцев.Добавить(ЗаписьНабора[ИмяКолонкиОбъектаВладелец]);
			
			ВладелецСсылка = ЗаписьНабора[ИмяКолонкиОбъектаВладелец];
			Если ЗначениеЗаполнено(ВладелецСсылка) Тогда
				
				ВладелецОбъект = ВладелецСсылка.ПолучитьОбъект();
				Если ВладелецОбъект <> Неопределено Тогда
					ПолучателиОбъектаВладельца = ОбменДаннымиСобытия.ОпределитьПолучателей(ВладелецОбъект, ПРО.ИмяПланаОбмена);
					Если ПолучателиОбъектаВладельца <> Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Получатели, ПолучателиОбъектаВладельца, Истина);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_НастройкиРасчетаРезервовОтпусков
Процедура ДобавитьПРО_РегистрСведений_НастройкиРасчетаРезервовОтпусков(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_НастройкиРасчетаРезервовОтпусков";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.НастройкиРасчетаРезервовОтпусков";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		РегистрСведений_НастройкиРасчетаРезервовОтпусков_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_НастройкиРасчетаРезервовОтпусков_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьРезервы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьРезервы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Измерение</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область РегистрСведений_КадроваяИсторияСотрудников
Процедура ДобавитьПРО_РегистрСведений_КадроваяИсторияСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_КадроваяИсторияСотрудников";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.КадроваяИсторияСотрудников";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_3(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_КадроваяИсторияСотрудников_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ОбменДаннымиУниверсальныйФормат.КадровыеДанныеПослеОбработкиПравила(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели);
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_ВидыЗанятостиСотрудников
Процедура ДобавитьПРО_РегистрСведений_ВидыЗанятостиСотрудников(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ВидыЗанятостиСотрудников";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ВидыЗанятостиСотрудников";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_3(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_ВидыЗанятостиСотрудников_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	ОбменДаннымиУниверсальныйФормат.КадровыеДанныеПослеОбработкиПравила(Отказ, Объект, ОбъектМетаданных, Выгрузка, Получатели);
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
Процедура ДобавитьПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_3(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Отказ = Истина;
КонецПроцедуры

Процедура ПРО_РегистрСведений_МестоПозицииШтатногоРасписанияВСтруктуреПредприятия_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	Получатели.Очистить();
	
	Если Объект.Количество() > 0 Тогда
		
		ИмяКолонки = "Позиция";
		МассивОбъектовВладельцев = Новый Массив;
		Для каждого ЗаписьНабора Из Объект Цикл
			
			Если МассивОбъектовВладельцев.Найти(ЗаписьНабора[ИмяКолонки]) <> Неопределено Тогда
				// Получатели для этого ОбъектаВладельца уже определены
				Продолжить;
			КонецЕсли;
			МассивОбъектовВладельцев.Добавить(ЗаписьНабора[ИмяКолонки]);
			
			ВладелецСсылка = ЗаписьНабора[ИмяКолонки];
			Если ЗначениеЗаполнено(ВладелецСсылка) Тогда
				
				ВладелецОбъект = ВладелецСсылка.ПолучитьОбъект();
				Если ВладелецОбъект <> Неопределено Тогда
					ПолучателиОбъектаВладельца = ОбменДаннымиСобытия.ОпределитьПолучателей(ВладелецОбъект, ПРО.ИмяПланаОбмена);
					Если ПолучателиОбъектаВладельца <> Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Получатели, ПолучателиОбъектаВладельца, Истина);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

Функция ОтборПоСвойствамОбъекта_1()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВводНачальныхДанных</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВводНачальныхДанных</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция ОтборПоСвойствамОбъекта_2()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция ОтборПоСвойствамОбъекта_3()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция ПустойОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта/>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_1()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВсехФизическихЛиц</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>false</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВсехФизическихЛиц</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_2()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВсехФизическихЛиц</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВсехФизическихЛиц</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_3()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьСотрудников</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьСотрудников</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_4()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ОтправлятьВедомости</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ОтправлятьВедомости</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ПустойОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена/>" ;
КонецФункции

#КонецОбласти
