
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.ЭтоСеансВнешнегоПользователя() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы(Отказ);
	ИнициализироватьСообщениеПользователю();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗакрытиеФормыЭлектронногоКурса" Тогда
		ИзучениеЭлектронногоКурса = Источник.ИзучениеЭлектронногоКурса;
		ИнициализироватьСообщениеПользователю();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура НачатьТестирование(Команда)
	
	ИзучениеЭлектронныхКурсовКлиент.ИзучитьЭлектронныйКурс(ЭлектронныйКурс, Вакансия, Учащийся, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеФормы(Отказ)
	
	ВнешнийПользователь = ВнешниеПользователи.ТекущийВнешнийПользователь();
	Если Не ЗначениеЗаполнено(ВнешнийПользователь) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Учащийся = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнешнийПользователь, "ОбъектАвторизации");
	МодульМенеджера = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Учащийся.Метаданные().ПолноеИмя());
	
	ДанныеДляЗаполнения = ЭлектронноеТестированиеКандидатов.НовыйДанныеДляФормыЭлектронногоТестированияКандидата();
	МодульМенеджера.ЗаполнитьДанныеДляЭлектронногоТестированияКандидата(ДанныеДляЗаполнения, Учащийся);
	
	Кандидат = ДанныеДляЗаполнения.Кандидат;
	ИмяОтчество = ДанныеДляЗаполнения.ИмяОтчество;
	
	Если Не ЗначениеЗаполнено(Кандидат) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат);
	Если ДанныеКандидата = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Вакансия = ДанныеКандидата.Вакансия;
	
	ЭтапРаботы = ПодборПерсонала.ТекущийЭтапРаботыКандидатов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Кандидат));
	
	Если Не ТекущийЭтапЗапланирован(Кандидат, ЭтапРаботы) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИзучениеЭлектронногоКурса(Отказ, ЭтапРаботы);
	
КонецПроцедуры

&НаСервере
Функция ТекущийЭтапЗапланирован(Кандидат, ЭтапРаботы)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РаботаСКандидатами.СостояниеЭтапа КАК СостояниеЭтапа
		|ИЗ
		|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
		|ГДЕ
		|	РаботаСКандидатами.Кандидат = &Кандидат
		|	И РаботаСКандидатами.ЭтапРаботы = &ЭтапРаботы";
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Если Выборка.СостояниеЭтапа = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИзучениеЭлектронногоКурса(Отказ, ЭтапРаботы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВакансииЭтапыРаботыСКандидатами.ШаблонАнкеты КАК ЭлектронныйКурс,
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка КАК Вакансия
		|ИЗ
		|	Справочник.Вакансии.ЭтапыРаботыСКандидатами КАК ВакансииЭтапыРаботыСКандидатами
		|ГДЕ
		|	ВакансииЭтапыРаботыСКандидатами.Ссылка В(&Вакансии)
		|	И ВакансииЭтапыРаботыСКандидатами.СпособОценкиХарактеристик = ЗНАЧЕНИЕ(Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест)
		|	И ВакансииЭтапыРаботыСКандидатами.ЭтапРаботы = &ЭтапРаботы";
	Запрос.УстановитьПараметр("Вакансии", Вакансия);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ЭлектронныйКурс = Выборка.ЭлектронныйКурс;
	
	ИзучениеЭлектронногоКурса = ИзучениеЭлектронныхКурсов.НайтиИзучениеПоКонтексту(ЭлектронныйКурс, Вакансия, Учащийся);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьСообщениеПользователю()
	
	ТестированиеЗавершено = ТестированиеПройдено();
	
	Элементы.НачатьТестирование.Видимость = Не ТестированиеЗавершено;
	
	// АПК:374-выкл. Восклицательный знак в заголовке декорации, а не сообщению пользователю.
	Если ТестированиеЗавершено Тогда
		Сообщение =  НСтр("ru = 'Тестирование завершено
			|
			|Благодарим за уделенное время!
			|О результатах рассмотрения сообщим дополнительно.'");
	Иначе
		Сообщение = СтрШаблон(НСтр("ru = '%1!
			|Чтобы подтвердить свои знания и навыки, пройдите, пожалуйста, тестирование.
			|
			|Желаем удачи!'"), ИмяОтчество);
	КонецЕсли;
	// АПК:374-вкл
	
	Элементы.СообщениеПриВходе.Заголовок = Сообщение;
	
КонецПроцедуры

&НаСервере
Функция ТестированиеПройдено()
	
	Если Не ЗначениеЗаполнено(ИзучениеЭлектронногоКурса) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Прогресс = ИзучениеЭлектронныхКурсов.ПрогрессИзучения(ИзучениеЭлектронногоКурса);
	Возврат ?(Прогресс = 100, Истина, Ложь);
	
КонецФункции

#КонецОбласти
