
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
		ЭтотОбъект,
		Параметры.НастройкиУведомленийОрганизации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	НастройкиУведомленийОрганизации =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ПараметрыУведомленийОрганизации(Истина);
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ЗаполнитьНастройкиУведомленийОрганизации(
		НастройкиУведомленийОрганизации,
		ЭтотОбъект);
	
	Закрыть(НастройкиУведомленийОрганизации);
	
КонецПроцедуры

#КонецОбласти
