// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	УстановитьВидимостьЗначений(ЭтотОбъект);
	УстановитьСвойстваПоляЗначение(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользуетсяДиапазонЗначенийПриИзменении(Элемент)
	
	Объект.ДиапазонЗначений = ИспользуетсяДиапазонЗначений = 1;
	УстановитьВидимостьЗначений(ЭтотОбъект);
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	
	УстановитьСвойстваПоляЗначение(ЭтотОбъект);
	ЗаполнитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НижнееЗначениеПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВерхнееЗначениеПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	Если Объект.ДиапазонЗначений Тогда
		ИспользуетсяДиапазонЗначений = 1;
	Иначе
		ИспользуетсяДиапазонЗначений = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЗначений(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаДиапазонЗначений", "Видимость", Форма.ИспользуетсяДиапазонЗначений = 1);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Значение", "Видимость", Форма.ИспользуетсяДиапазонЗначений = 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваПоляЗначение(Форма)
	
	АвтоОтметкаНезаполненного =
		Форма.Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.СредстваЗащитыОргановДыхания");
	ОтметкаНезаполненного = АвтоОтметкаНезаполненного И Не ЗначениеЗаполнено(Форма.Объект.Значение);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Значение", "АвтоОтметкаНезаполненного", АвтоОтметкаНезаполненного);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Значение", "ОтметкаНезаполненного", ОтметкаНезаполненного);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "НижнееЗначение", "АвтоОтметкаНезаполненного", АвтоОтметкаНезаполненного);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "НижнееЗначение", "ОтметкаНезаполненного", ОтметкаНезаполненного);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование()
	
	ЭтоСредстваЗащитыОргановДыхания =
		Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.СредстваЗащитыОргановДыхания");
	Если ИспользуетсяДиапазонЗначений = 1 И (ЗначениеЗаполнено(Объект.НижнееЗначение) Или ЭтоСредстваЗащитыОргановДыхания)
		И ЗначениеЗаполнено(Объект.ВерхнееЗначение) Тогда
		
		Объект.Наименование = Строка(Объект.НижнееЗначение) + " - " + Строка(Объект.ВерхнееЗначение);
	ИначеЕсли ИспользуетсяДиапазонЗначений = 0 И (ЗначениеЗаполнено(Объект.Значение) Или ЭтоСредстваЗащитыОргановДыхания) Тогда
		Объект.Наименование = Строка(Объект.Значение);
	Иначе
		Объект.Наименование = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
