
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСнятьПризнакОсновного(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		УстановитьСнятьПризнакОсновногоНаСервере(Элементы.Список.ТекущиеДанные.Ссылка, Элементы.Список.ТекущиеДанные.ОсновнойСчет);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСнятьПризнакОсновногоНаСервере(Контрагент, ОсновнойСчет)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.БазовыеСправочныеДанныеРасширенная") Тогда
		МодульОсновныеБанковскиеСчета = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.ОсновныеБанковскиеСчетаКонтрагентов");
		МодульОсновныеБанковскиеСчета.ЗаписатьОсновнойБанковскийСчет(Контрагент, Не ОсновнойСчет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
