////////////////////////////////////////////////////////////////////////////////
// Модуль содержит общие процедуры и функции для перехода на интерфейс 8.5.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция МасштабКлиентскогоПриложения() Экспорт
	
	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	Если НастройкиКлиентскогоПриложения = Неопределено Тогда
	    НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения();
	КонецЕсли;
	
	ВарМасштабаКлиентскогоПриложения = НастройкиКлиентскогоПриложения.ВариантМасштабаКлиентскогоПриложения;
	
	// "Авто" - В веб-клиенте масштаб отображения определяется автоматически в зависимости от размера монитора.
	Результат = "Авто";
	
	Если ВарМасштабаКлиентскогоПриложения = ВариантМасштабаКлиентскогоПриложения.Обычный Тогда
		Результат = "Обычный";
	ИначеЕсли ВарМасштабаКлиентскогоПриложения = ВариантМасштабаКлиентскогоПриложения.Компактный Тогда	
	    Результат = "Компактный";
	КонецЕсли;
	
	Если Результат = "Авто" Тогда
		
		ИмяКлиентскогоПриложения = ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения;
		ЭтоВебКлиент = (ИмяКлиентскогоПриложения = "WebClient");
		
		Если ЭтоВебКлиент Тогда
			
			ИнформацияЭкрановКлиента = ПолучитьИнформациюЭкрановКлиента();
			Если ИнформацияЭкрановКлиента <> Неопределено Тогда
			
				ОсновнойЭкран = ИнформацияЭкрановКлиента[0];
				Высота = ОсновнойЭкран.Высота;
				
				Если Высота >= 1024 Тогда
					Результат = "Обычный";
				Иначе
				    Результат = "Компактный";
				КонецЕсли;
				
			Иначе
			    // Фоновое задание.
				Результат = "Обычный";
			КонецЕсли;
			
		Иначе
			Результат = "Обычный";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти