///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выводит на произвольную форму элементы панели Помощь.
// Особенность вывода строки поиска:
//  - Если задано значение параметра ГруппаПоиск, то строка поиска и типовые карточки выводятся в нее.
//  - В интерфейсе Такси, если не задано значение параметра ГруппаПоиск и панель, указанная в параметре
//    КоманднаяПанельТехПоддержка, является первым элементом формы, то строка поиска выводится
//    сразу после этой панели.
//  - В остальных случаях, если значение параметра ГруппаПоиск не задано, то строка поиска и типовые
//    кнопки выводятся в самом начале формы.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которую необходимо вывести элементы управления.
//  КоманднаяПанельТехПоддержка - КоманднаяПанель, Неопределено - командная панель формы, в которую
//    необходимо вывести подменю с кнопками обращения в тех поддержку. Если не задано, то подменю выводится в
//    основную командную панель формы Форма.КоманднаяПанель.
//    Важно: в режиме интерфейса 8.5 значение параметра игнорируется и подменю всегда выводится в
//    командную панель формы.
//  ГруппаПоиск - ГруппаФормы, Неопределено - группа, в которую необходимо вывести поле для поиска информации
//    и типовые карточки ("О программе", "Документация" и "Ответы на вопросы").
//    Если не задано, то выводится в начало формы.
//
Процедура ПриСозданииНаСервере(
		Форма,
		КоманднаяПанельТехПоддержка = Неопределено,
		ГруппаПоиск = Неопределено) Экспорт
	
	ПанельПомощьСлужебный.ПриСозданииНаСервереСлужебный(
		Форма,
		КоманднаяПанельТехПоддержка,
		ГруппаПоиск);
	
КонецПроцедуры

// Создает и возвращает структуру, описывающую дополнительный источник поиска для панели помощи.
//
// Параметры:
//   Идентификатор - Строка - уникальный идентификатор варианта источника. 
//     Используется для определения варианта, который выбрал пользователь.
//     Передается в параметр Источник метода ПриОпределенииСтраницыПоиска.
//     Строка "ПоУмолчанию" является зарезервированной. Элемент с таким идентификатором будет проигнорирован.
//   Представление - Строка - наименование источника, отображаемое пользователю в списке для выбора.
//   Подсказка - Строка - текст подсказки для поля ввода, который будет отображаться после выбора
//     варианта. Если не задан, то в качестве подсказки будет использовано значение
//     "Введите ключевые слова для поиска в [Представление]".
//   Картинка - Строка, Картинка - Картинка для вывода в поле поиска, если СтандартнаяОбработка = Ложь.
//     При использовании типа Строка должно содержать имя картинки из Библиотеки картинок.
//     При использовании типа Картинка может использоваться только картинка из Библиотеки картинок.
//
// Возвращаемое значение:
//   Структура - описание дополнительного источника поиска:
//     * Идентификатор - Строка - уникальный идентификатор варианта источника. 
//         Используется для определения варианта, который выбрал пользователь.
//         Передается в параметр Источник метода ПриОпределенииСтраницыПоиска.
//         Строка "ПоУмолчанию" является зарезервированной. Элемент с таким идентификатором будет проигнорирован.
//     * Представление - Строка - наименование источника, отображаемое пользователю в списке для выбора.
//     * Подсказка - Строка - текст подсказки для поля ввода, который будет отображаться после выбора
//         варианта. Если не задан, то в качестве подсказки будет использовано значение
//         "Введите ключевые слова для поиска в [Представление]".
//     * Картинка - Строка, Картинка - Картинка для вывода в поле поиска.
//         При использовании типа Строка должно содержать имя картинки из Библиотеки картинок.
//         При использовании типа Картинка может использоваться только картинка из Библиотеки картинок.
//
Функция НовыйДополнительныеИсточники(
		Идентификатор,
		Представление = "",
		Подсказка = "",
		Картинка = "") Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("Представление", Представление);
	Результат.Вставить("Подсказка", Подсказка);
	Результат.Вставить("Картинка", Картинка);
	
	Возврат Результат;
	
КонецФункции

// Конструктор описания одного сообщения карусели.
//  Для вывода информации должны быть заданы поля Заголовок ИЛИ Текст ИЛИ Картинки.
//  Если ни одно из значений для определенного клиента не задано, то сообщение не выводится.
//  Если в параметрах Заголовок, Текст передано значение типа Строка, то
//  оно в любом случае преобразуется в форматированную строку. В связи с этим, в них допускается
//  указание тегов оформления, описанных в комментарии к методу СтроковыеФункции.ФорматированнаяСтрока.
//
// Параметры:
//  Заголовок - Строка, ФорматированнаяСтрока - первая строка текста; текст подсказки 
//    для кнопок перехода и для картинки.
//  Текст - Строка, ФорматированнаяСтрока - вторая строка текста.
//  СсылкаКартинки - Строка - Ссылка, по которой необходимо необходимо перейти при нажатии на картинку.
//  Картинки - Неопределено
//           - см. НовыйКартинкаСообщенияКарусели.
// 
// Возвращаемое значение:
//  Структура - данные баннера:
//    * Заголовок - Строка, ФорматированнаяСтрока - первая строка текста;
//        текст подсказки для кнопок перехода и для картинки.
//    * Текст - Строка, ФорматированнаяСтрока - вторая строка текста.
//    * СсылкаКартинки - Строка - Ссылка, по которой необходимо необходимо перейти при нажатии на картинку.
//    * Картинки - Неопределено
//               - см. НовыйКартинкаСообщенияКарусели.
//  
Функция НовыйСообщениеКарусель(
		Заголовок,
		Текст,
		СсылкаКартинки = "",
		Картинки = Неопределено) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Заголовок", Заголовок);
	Результат.Вставить("Текст", Текст);
	Результат.Вставить("СсылкаКартинки", СсылкаКартинки);
	Результат.Вставить("Картинки", Картинки);
	
	Возврат Результат;
	
КонецФункции

// Конструктор описания картинки, выводимой в сообщение карусели.
// Картинка выбирается в зависимости от того, сколько колонок используется для вывода
// прикладных кнопок.
// Если указана только картинка по умолчанию, то она используется для всех вариантов.
// Не рекомендуется использовать много картинок в карусели, поскольку все они загружаются в память.
// 
// Параметры:
//  ПоУмолчанию - Неопределено, Строка, Картинка, ДвоичныеДанные - используется, если прикладные
//                кнопки выводятся в 3 колонки, либо если нужная картинка не указана.
//  Картинка2 - Неопределено, Строка, Картинка, ДвоичныеДанные - используется если прикладные
//              кнопки выводятся в 2 колонки.
//  Картинка4 - Неопределено, Строка, Картинка, ДвоичныеДанные - используется если прикладные
//              кнопки выводятся в 4 колонки.
// 
// Возвращаемое значение:
//  Структура - доступные варианты картинок:
//    * ПоУмолчанию - Неопределено, Строка, Картинка, ДвоичныеДанные - используется если прикладные
//                    кнопки выводятся в 3 колонки, либо если нужная картинка не указана.
//                    При использовании типа Строка может содержать либо имя картинки из Библиотеки картинок,
//                    либо адрес двоичных данных во временном хранилище.
//                    Соотношение сторон картинки: Интерфейс 8.5 - 55:6; интерфейс Такси - 46:3.
//    * Картинка2 - Неопределено, Строка, Картинка, ДвоичныеДанные - используется если прикладные
//                  кнопки выводятся в 2 колонки.
//                  При использовании типа Строка может содержать либо имя картинки из Библиотеки картинок,
//                  либо адрес двоичных данных во временном хранилище.
//                  Соотношение сторон картинки: Интерфейс 8.5 - 13:2; интерфейс Такси - 10:1.
//    * Картинка4 - Неопределено, Строка, Картинка, ДвоичныеДанные - используется если прикладные
//                  кнопки выводятся в 4 колонки.
//                  При использовании типа Строка может содержать либо имя картинки из Библиотеки картинок,
//                  либо адрес двоичных данных во временном хранилище.
//                  Соотношение сторон картинки: Интерфейс 8.5 - 12:1; интерфейс Такси - 64:3.
// 
Функция НовыйКартинкаСообщенияКарусели(
		ПоУмолчанию,
		Картинка2 = Неопределено,
		Картинка4 = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ПоУмолчанию", ПоУмолчанию);
	Результат.Вставить("Картинка2", Неопределено);
	Результат.Вставить("Картинка4", Неопределено);
	
	Возврат Результат;
	
КонецФункции

// Конструктор описания одной карточки/кнопки в панели Помощь.
//
// Параметры:
//  Идентификатор - Строка - произвольный идентификатор кнопки.
//  Заголовок - Строка - текст, выводимый в карточку.
//  Ссылка - Строка - адрес для перехода при щелчке по карточке.
//    Может быть не задана. В этом случае, обработка нажатия на кнопку будет выполняться в
//    переопределяемом методе ПриОбработкеНавигационнойСсылки.
//  Картинка - Строка, Картинка - информация о картинке, которая должна использоваться для карточки.
//    При использовании типа Строка должно содержать имя картинки из Библиотеки картинок.
//    При использовании типа Картинка может использоваться только картинка из Библиотеки картинок.
//  ЦветКартинки - Цвет, Неопределено - цвет картинки.
//    Актуально только при использовании картинок с типом Шаблонная.
//  Подсказка - Строка - текст подсказки для карточки.
//
// Возвращаемое значение:
//  Структура - данные карточки:
//    * Идентификатор - Строка - произвольный идентификатор кнопки.
//    * Заголовок - Строка - текст, выводимый в карточку.
//    * Ссылка - Строка - адрес для перехода при щелчке по карточке.
//        Может быть не задана. В этом случае, обработка нажатия на кнопку будет выполняться в
//        переопределяемом методе ПриОбработкеНавигационнойСсылки.
//    * Картинка - Строка, Картинка, Неопределено - информация о картинке, которая должна использоваться для карточки.
//        При использовании типа Строка должно содержать имя картинки из Библиотеки картинок.
//        При использовании типа Картинка может использоваться только картинка из Библиотеки картинок.
//        Если не указано или задано с ошибками, то картинка не выводится.
//    * ЦветКартинки - Цвет, Неопределено - цвет картинки.
//       Актуально только при использовании картинок с типом Шаблонная.
//    * Подсказка - Строка - текст подсказки для карточки.
//    
Функция НовыйДанныеКарточек(
		Идентификатор,
		Заголовок,
		Ссылка,
		Картинка = Неопределено,		ЦветКартинки = Неопределено,
		Подсказка = "") Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Идентификатор", Идентификатор);
	Результат.Вставить("Заголовок", Заголовок);
	Результат.Вставить("Ссылка", Ссылка);
	Результат.Вставить("Картинка", Картинка);
	Результат.Вставить("ЦветКартинки", ЦветКартинки);
	Результат.Вставить("Подсказка", Подсказка);
	
	Возврат Результат;
	
КонецФункции

// Конструктор описания одной ссылки на соц. сети.
//
// Параметры:
//  Картинка - Строка, Картинка, ДвоичныеДанные - информация о картинке, которая должна
//    использоваться для кнопки соц. сети.
//    При использовании типа Строка может содержать либо имя картинки из Библиотеки картинок,
//    либо адрес двоичных данных во временном хранилище.
//    Если не заполнено, то кнопка не выводится.
//  Ссылка - Строка - адрес для перехода при щелчке по картинке. Обязательно для заполнения.
//    Если не заполнено, то кнопка не выводится.
//  ЦветКартинки - Цвет, Неопределено - цвет картинки.
//    Актуально только при использовании картинок с типом Шаблонная из Библиотеки картинок.
//  Подсказка - Строка - текст подсказки для картинки.
//
// Возвращаемое значение:
//  Структура - данные ссылки:
//    * Картинка - Строка, Картинка, ДвоичныеДанные - информация о картинке, которая должна
//        использоваться для кнопки соц. сети.
//        При использовании типа Строка может содержать либо имя картинки из Библиотеки картинок,
//        либо адрес двоичных данных во временном хранилище.
//        Если не заполнено, то кнопка не выводится.
//    * Ссылка - Строка - адрес для перехода при щелчке по картинке. Обязательно для заполнения.
//        Если не заполнено, то кнопка не выводится.
//    * ЦветКартинки - Цвет, Неопределено - цвет картинки.
//        Актуально только при использовании картинок с типом Шаблонная из Библиотеки картинок.
//    * Подсказка - Строка - текст подсказки для картинки.
//    
Функция НоваяСсылкаСоцсети(
		Картинка,
		Ссылка,
		ЦветКартинки = Неопределено,
		Подсказка = "") Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Картинка", Картинка);
	Результат.Вставить("Ссылка", Ссылка);
	Результат.Вставить("ЦветКартинки", ЦветКартинки);
	Результат.Вставить("Подсказка", Подсказка);

	Возврат Результат;

КонецФункции

#КонецОбласти
