#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Кандидат", "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

Функция ЗаполнитьКандидатов() Экспорт

	Если Метаданные.РегистрыСведений.АнкетыКандидатов.Реквизиты.Найти("УдалитьФизическоеЛицо") = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.АнкетыКандидатов.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1000
			|	АнкетыКандидатов.Вакансия,
			|	АнкетыКандидатов.ЭтапРаботыСКандидатом,
			|	АнкетыКандидатов.Кандидат,
			|	АнкетыКандидатов.Анкета,
			|	АнкетыКандидатов.УдалитьФизическоеЛицо,
			|	ЕСТЬNULL(ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата,
			|		ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)) КАК ЛичныеДанныеКандидата
			|ИЗ
			|	РегистрСведений.АнкетыКандидатов КАК АнкетыКандидатов
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
			|		ПО АнкетыКандидатов.УдалитьФизическоеЛицо = ФизическиеЛицаКандидатов.ФизическоеЛицо
			|ГДЕ
			|	АнкетыКандидатов.ЛичныеДанныеКандидата = ЗНАЧЕНИЕ(Справочник.ЛичныеДанныеКандидатов.ПустаяСсылка)
			|	И АнкетыКандидатов.УдалитьФизическоеЛицо <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		КоличествоОбработанныхЗаписей = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЛичныеДанныеКандидата) Тогда
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Вакансия.Установить(ВыборкаДетальныеЗаписи.Вакансия);
			НаборЗаписей.Отбор.ЭтапРаботыСКандидатом.Установить(ВыборкаДетальныеЗаписи.ЭтапРаботыСКандидатом);
			НаборЗаписей.Отбор.Кандидат.Установить(ВыборкаДетальныеЗаписи.Кандидат);
			НаборЗаписей.Прочитать();
			Для каждого ТекущаяЗапись Из НаборЗаписей Цикл
				ТекущаяЗапись.ЛичныеДанныеКандидата = ВыборкаДетальныеЗаписи.ЛичныеДанныеКандидата;
				КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + 1;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей, Истина);
			
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		
		Возврат КоличествоОбработанныхЗаписей = 0;
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Ошибка заполнения кандидатов в регистре Анкеты кандидатов'",
				ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.АнкетыКандидатов);
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли