#Область ПрограммныйИнтерфейс

Функция ПредставлениеИсполнителяЭтапа(Исполнитель, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации,
	ИмяРеквизитаОсновногоОбъектаАдресации = "", ИмяРеквизитаДополнительногоОбъектаАдресации = "") Экспорт
	
	Результат = Строка(Исполнитель);
	
	Если НЕ ПустаяСтрока(ИмяРеквизитаОсновногоОбъектаАдресации) Тогда
		Если Лев(ИмяРеквизитаОсновногоОбъектаАдресации, 1) = "*" Тогда
			Результат = Результат + ", доп. реквизит """ + Сред(ИмяРеквизитаОсновногоОбъектаАдресации, 2) + """";
		ИначеЕсли Строка(Исполнитель) = "(функция)" Тогда
			Результат = Результат + " """ + ИмяРеквизитаОсновногоОбъектаАдресации + """";
		Иначе
			Результат = Результат + ", реквизит """ + ИмяРеквизитаОсновногоОбъектаАдресации + """";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ОсновнойОбъектАдресации) Тогда
		Результат = Результат + ", " + Строка(ОсновнойОбъектАдресации);
	КонецЕсли;
	Если НЕ ПустаяСтрока(ИмяРеквизитаДополнительногоОбъектаАдресации) Тогда
		Если Лев(ИмяРеквизитаДополнительногоОбъектаАдресации, 1) = "*" Тогда
			Результат = Результат + ", доп. реквизит """ + Сред(ИмяРеквизитаДополнительногоОбъектаАдресации, 2) + """";
		Иначе
			Результат = Результат + ", реквизит """ + ИмяРеквизитаДополнительногоОбъектаАдресации + """";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ДополнительныйОбъектАдресации) Тогда
		Результат = Результат + ", " + Строка(ДополнительныйОбъектАдресации);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеСрокаВыполненияИнтервала(Параметры, ИспользуютсяГрафикиРаботы) Экспорт
	
	Представление = "";
	
	Если Параметры.СрокЗависитОтВремениНачала Тогда
		Представление = Представление + НСтр("ru='если этап начался до '") + Формат(Параметры.ВремяНачала, "ДФ=ЧЧ:мм; ДП=00:00") + НСтр("ru=', то '");
	КонецЕсли;
	
	ЗаполнитьПредставлениеСрокаВыполненияПоПоказателям(Представление, Параметры.СрокВыполненияЧасы, Параметры.СрокВыполненияДни,
		Параметры.СпособУказанияВремениОкончания, Параметры.ВремяОкончания, ИспользуютсяГрафикиРаботы);
	
	Если Параметры.СрокЗависитОтВремениНачала Тогда
		Представление = Представление + НСтр("ru='; если позже, то '");
		ЗаполнитьПредставлениеСрокаВыполненияПоПоказателям(Представление, Параметры.СрокВыполненияЧасыПосле, Параметры.СрокВыполненияДниПосле,
			Параметры.СпособУказанияВремениОкончанияПосле, Параметры.ВремяОкончанияПосле, ИспользуютсяГрафикиРаботы);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Процедура ПоказатьКнопкиПечатиРегламентированногоОтчета(Форма) Экспорт
	
	ПроцессыОбработкиДокументовКлиентСерверПереопределяемый.ПоказатьКнопкиПечатиРегламентированногоОтчета(Форма);
	
КонецПроцедуры

Функция ПредставлениеФормуляраПоСвойствам(Свойства, ЭтоНовый = Ложь) Экспорт

	Если ЗначениеЗаполнено(Свойства.НомерДокумента) И ЗначениеЗаполнено(Свойства.ДатаДокумента) Тогда
		Представление = СтрШаблон(НСтр("ru = '%1 № %2 от %3'"), Свойства.НаименованиеДокумента,
			Свойства.НомерДокумента, Формат(Свойства.ДатаДокумента, "ДЛФ=D;"));
	ИначеЕсли ЗначениеЗаполнено(Свойства.НомерДокумента) Тогда
		Представление = СтрШаблон(НСтр("ru = '%1 № %2'"), Свойства.НаименованиеДокумента,
			Свойства.НомерДокумента);
	ИначеЕсли ЗначениеЗаполнено(Свойства.ДатаДокумента) Тогда
		Представление = СтрШаблон(НСтр("ru = '%1 от %2'"), Свойства.НаименованиеДокумента,
			Формат(Свойства.ДатаДокумента, "ДЛФ=D;"));
	Иначе
		Представление = Строка(Свойства.НаименованиеДокумента);
	КонецЕсли;
	
	Если ЭтоНовый Тогда
		Представление = СтрШаблон(НСтр("ru = '%1 (Создание)'"), Представление);
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ДополнениеНаименованияФормуляра(КодВидаСведений) Экспорт
	Результат = "";	
	Если КодВидаСведений = 1 Тогда
		Результат = " (MXL)";	
	ИначеЕсли КодВидаСведений = 2 Тогда
		Результат = " (PDF)";	
	КонецЕсли;	

	Возврат Результат;
КонецФункции	

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает текстовое представление интервала времени, заданного в секундах.
//
// Параметры:
//
//  Время - Число - интервал времени в секундах.
//
// Возвращаемое значение:
//   Строка - представление интервала времени.
//
Функция ПредставлениеВремени(Знач Время, ВыводитьСекунды = Истина, СокращенныеЕдиницы = Истина) Экспорт
	
	Результат = "";
	
	Если Время = NULL Тогда
		Возврат Результат;
	КонецЕсли;
	
	Отрицательное = Ложь;
	
	// Представление единиц измерения времени в винительном падеже для количеств: 1, 2-4, 5-20.
	ПредставлениеЧасов = НСтр("ru = ';%1 час;;%1 часа;%1 часов;%1 часа'");
	ПредставлениеМинут = НСтр("ru = ';%1 минуту;;%1 минуты;%1 минут;%1 минуты'");
	ПредставлениеСекунд = НСтр("ru = ';%1 секунду;;%1 секунды;%1 секунд;%1 секунды'");
	
	Время = Число(Время);
	
	Если Время < 0 Тогда
		Время = - Время;
		Отрицательное = Истина;
	КонецЕсли;
	
	КоличествоЧасов = Цел(Время / 60 / 60);
	КоличествоМинут = Цел(Время / 60);
	КоличествоСекунд = Цел(Время);
	
	КоличествоСекунд = КоличествоСекунд - КоличествоМинут * 60;
	КоличествоМинут = КоличествоМинут - КоличествоЧасов * 60;
	
	Если Не ВыводитьСекунды Тогда
		КоличествоСекунд = 0;
	КонецЕсли;
	
	Если КоличествоЧасов > 0 Тогда
		Если СокращенныеЕдиницы Тогда
			Результат = Результат + КоличествоЧасов + НСтр("ru = ' ч '");
		Иначе
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеЧасов, КоличествоЧасов) + " ";
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоМинут > 0 Тогда
		Если СокращенныеЕдиницы Тогда
			Результат = Результат + КоличествоМинут + НСтр("ru = ' м '");
		Иначе
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеМинут, КоличествоМинут) + " ";
		КонецЕсли;
	КонецЕсли;
	
	Если КоличествоСекунд > 0 Тогда
		Если СокращенныеЕдиницы Тогда
			Результат = Результат + КоличествоСекунд + НСтр("ru = ' с '");
		Иначе
			Результат = Результат + СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(ПредставлениеСекунд, КоличествоСекунд) + " ";
		КонецЕсли;
	КонецЕсли;
	
	Если Отрицательное Тогда
		Результат = "- " + Результат;
	КонецЕсли;
	
	Возврат СокрП(Результат);
	
КонецФункции

// Возвращает уникальное имя файла, полученное от исходного добавлением порядкового номера.
// 
// Параметры:
//  ИсходноеИмяФайла - Строка - Имя файла.
//  ЭтоКаталог - Булево - Истина, если это каталог.
//  
//  Возвращаемое значение:
//   Строка - Уникальное имя файла.
//
Функция УникальноеИмяФайла(Знач ИсходноеИмяФайла, Знач ЭтоКаталог = Ложь) Экспорт
	
	ПозицияДляДополнения = СтрНайти(ИсходноеИмяФайла, ".", НаправлениеПоиска.СКонца);
	Если ПозицияДляДополнения = 0 Или ЭтоКаталог Тогда
		ПозицияДляДополнения = СтрДлина(ИсходноеИмяФайла) + 1;
	КонецЕсли;
	
	Счетчик = 0;
	Пока Истина Цикл
		
		ДополнениеИмени = ?(Счетчик = 0, "", СтрШаблон(" (%1)", Формат(Счетчик, "ЧГ=0;")));
		ИмяФайла = Лев(ИсходноеИмяФайла, ПозицияДляДополнения - 1) + ДополнениеИмени
			+ Сред(ИсходноеИмяФайла, ПозицияДляДополнения);

		Файл = Новый Файл(ИмяФайла);
		Если Не Файл.Существует() Тогда
			Прервать;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ИмяФайлаДанныхПоУмолчанию(ТекущиеДанные, ПредставлениеДокумента) Экспорт
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(
		"(" + ТекущиеДанные.НомерСтроки + ". " + ТекущиеДанные.НаименованиеЭтапа + ") "
		+ ПредставлениеДокумента
		+ ".xml");
	
КонецФункции

Функция ИмяФайлаПодписиПоУмолчанию(ТекущиеДанные, ПерсональныеНастройки) Экспорт
	
	ИмяФайлаПодписиБезРасширения = "(" + ТекущиеДанные.НомерСтроки + ". " + ТекущиеДанные.НаименованиеЭтапа + ") "
		+ ТекущиеДанные.КомуВыданСертификат;
	
	Если СтрДлина(ИмяФайлаПодписиБезРасширения) > 150 Тогда
		ИмяФайлаПодписиБезРасширения = ПроцессыОбработкиДокументовВызовСервера.СокращенноеИмяФайла(
			ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаПодписиБезРасширения), 150);
	КонецЕсли;
	
	ИмяФайлаПодписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2",
		ИмяФайлаПодписиБезРасширения, ПерсональныеНастройки.РасширениеДляФайловПодписи);
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаПодписи);
	
КонецФункции

Функция ИмяФайлаСертификатаПоУмолчанию(ТекущиеДанные) Экспорт
	
	ИмяФайлаСертификатаБезРасширения = ТекущиеДанные.КомуВыданСертификат;
	
	Если СтрДлина(ИмяФайлаСертификатаБезРасширения) > 150 Тогда
		ИмяФайлаСертификатаБезРасширения = ПроцессыОбработкиДокументовВызовСервера.СокращенноеИмяФайла(
			ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаСертификатаБезРасширения), 150);
	КонецЕсли;
	
	ИмяФайлаСертификата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2",
		ИмяФайлаСертификатаБезРасширения, "cer");
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаСертификата);
	
КонецФункции

Функция ИмяФайлаПодписиПервичногоДокументаПоУмолчанию(ДанныеФайла, ТекущиеДанные, ПерсональныеНастройки) Экспорт
	
	ИмяФайлаПодписиБезРасширения = ДанныеФайла.ИмяФайла + ", " + ТекущиеДанные.КомуВыданСертификат;
	
	Если СтрДлина(ИмяФайлаПодписиБезРасширения) > 150 Тогда
		ИмяФайлаПодписиБезРасширения = ПроцессыОбработкиДокументовВызовСервера.СокращенноеИмяФайла(
			ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаПодписиБезРасширения), 150);
	КонецЕсли;
	
	ИмяФайлаПодписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1.%2",
		ИмяФайлаПодписиБезРасширения, ПерсональныеНастройки.РасширениеДляФайловПодписи);
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаПодписи);
	
КонецФункции

Функция МассивВСоответствие(Массив) Экспорт
	
	Соответствие = Новый Соответствие;
	
	Для Каждого Элемент Из Массив Цикл
		Соответствие.Вставить(Элемент, Истина);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

Функция ПолучитьСтруктуруНастроекСвойствЭлементовСогласноЭтапу(Знач ТаблицаНастроек, Знач ИдентификаторЭтапа) Экспорт
	
	НедоступныеЭлементы = Новый Массив; 
	НевидимыеЭлементы = Новый Массив;
	ЭлементыСОтметкойНезаполненного = Новый Массив;
	СтартоваяСтраница = Новый Массив;

	Для Каждого ЭлементФормы Из ТаблицаНастроек Цикл
		
		Если ЭлементФормы.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда 
			
			Если ЭлементФормы.ЗапретДоступности Тогда
				НедоступныеЭлементы.Добавить(ЭлементФормы.ИмяЭлемента);
			КонецЕсли;	
			Если ЭлементФормы.ЗапретВидимости Тогда
				НевидимыеЭлементы.Добавить(ЭлементФормы.ИмяЭлемента);
			КонецЕсли;
			Если ЭлементФормы.ОтметкаНезаполненного Тогда
				ЭлементыСОтметкойНезаполненного.Добавить(ЭлементФормы.ИмяЭлемента);
			КонецЕсли;

			Если ЗначениеЗаполнено(ЭлементФормы.СтартоваяСтраница) Тогда
				СтартоваяСтраница.Добавить(ЭлементФормы.ИмяЭлемента);
				СтартоваяСтраница.Добавить(ЭлементФормы.СтартоваяСтраница);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураЭлементов = Новый Структура;
	СтруктураЭлементов.Вставить("НедоступныеЭлементы", НедоступныеЭлементы); 
	СтруктураЭлементов.Вставить("НевидимыеЭлементы", НевидимыеЭлементы); 
	СтруктураЭлементов.Вставить("ЭлементыСОтметкойНезаполненного", ЭлементыСОтметкойНезаполненного);
	СтруктураЭлементов.Вставить("СтартоваяСтраница", СтартоваяСтраница);

	 Возврат СтруктураЭлементов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредставлениеСрокаВыполненияПоПоказателям(Представление, СрокЧасы, СрокДни,
		СпособУказанияВремениОкончания, ВремяОкончанияДня, ИспользуютсяГрафикиРаботы)
	
	Если СрокЧасы = 0 И НЕ СпособУказанияВремениОкончания = 2 Тогда
		
		Представление = Представление + НСтр("ru='до'");
		
		Если СпособУказанияВремениОкончания = 0 Тогда
			Представление = Представление + НСтр("ru=' конца'");
		ИначеЕсли СпособУказанияВремениОкончания = 1 Тогда
			Представление = Представление + " " + Формат(ВремяОкончанияДня, "ДФ=ЧЧ:мм; ДП=00:00");
		КонецЕсли;
		
		Если СрокДни = 0 Тогда
			Представление = Представление + НСтр("ru=' текущего'");
		ИначеЕсли СрокДни = 1 Тогда
			Представление = Представление + НСтр("ru=' следующего'");
		ИначеЕсли СрокДни > 1 Тогда
			Представление = Представление + " " + Строка(СрокДни) + НСтр("ru='-го'");
		КонецЕсли;
		
		Если ИспользуютсяГрафикиРаботы Тогда
			Представление = Представление + НСтр("ru=' рабочего дня'");
		Иначе
			Представление = Представление + НСтр("ru=' дня'");
		КонецЕсли;
		
		Если СрокДни > 1 Тогда
			Представление = Представление + НСтр("ru=' (не считая текущего)'");
		КонецЕсли;
		
	Иначе
		
		Если СрокДни > 0 Тогда
			Если ИспользуютсяГрафикиРаботы Тогда
				ИсходнаяСтрока = ";%1 рабочий день;;%1 рабочих дня;%1 рабочих дней;%1 рабочих дня";
			Иначе
				ИсходнаяСтрока = ";%1 день;;%1 дня;%1 дней;%1 дня";
			КонецЕсли;
			Представление = Представление + СтрокаСЧислом(ИсходнаяСтрока,
															СрокДни,
															ВидЧисловогоЗначения.Количественное,
															"L=ru");
		КонецЕсли;
		
		Если СрокЧасы > 0 Тогда
			Если СрокДни > 0 Тогда
				Представление = Представление + НСтр("ru=' и '");
			КонецЕсли;
			Представление = Представление + СтрокаСЧислом(";%1 час;;%1 часа;%1 часов;%1 часа",
															СрокЧасы,
															ВидЧисловогоЗначения.Количественное,
															"L=ru");
		КонецЕсли;
		
		Если СрокДни = 0 И СрокЧасы = 0 Тогда
			Представление = Представление + НСтр("ru='не указан'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
