#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаЗаказа, "Объект.ДатаЗаказа", Отказ, НСтр("ru='Дата заказа'"), , , Ложь);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьСформированныеЗаказыНаВыдачуСИЗ(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьСформированныеЗаказыНаВыдачуСИЗ(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		ЗаписьНабора = Движения.СформированныеЗаказыНаВыдачуСИЗ.Добавить();
		ЗаписьНабора.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьНабора.Период = ?(ЗначениеЗаполнено(ДатаЗаказа), ДатаЗаказа, Дата);
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.ЗаказНаВыдачуСИЗ = Ссылка;
		ЗаполнитьЗначенияСвойств(ЗаписьНабора, СтрокаТаблицы);
		Движения.СформированныеЗаказыНаВыдачуСИЗ.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ЗаполнитьЗначенияПоУмолчанию();
	
	ДанныеЗаполнения.Свойство("ВключатьСИЗИстекающиеВТечениеМесяца", ВключатьСИЗИстекающиеВТечениеМесяца);
	Если ДанныеЗаполнения.Свойство("ФизическиеЛицаРабочиеМеста") Тогда
		ЗаполнитьСИЗТребующиеВыдачи(ДанныеЗаполнения.ФизическиеЛицаРабочиеМеста);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗТребующиеВыдачи(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста = "РабочееМесто", Сч = 1,
	ДобавлятьБезСИЗ = Ложь) Экспорт
	
	ОтмеченныеСИЗ = Неопределено;
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, ОтмеченныеСИЗ);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(ДатаЗаказа), ДатаЗаказа, ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
	Если ВключатьСИЗИстекающиеВТечениеМесяца Тогда
		ДатаАктуальности = ДобавитьМесяц(ДатаАктуальности, 1);
	КонецЕсли;
	
	ФизическиеЛицаКЗаполнению = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("ФизическоеЛицо");
	ЕстьОтмеченныеСИЗВТаблице = ТаблицаФизическиеЛицаРабочиеМеста.Колонки.Найти("ОтмеченныеСИЗ") <> Неопределено;
	Если ЕстьОтмеченныеСИЗВТаблице Тогда
		УдалитьИзДокументаЛишнихСотрудников(ФизическиеЛицаКЗаполнению);
	КонецЕсли;
	АнтропометрияФизическихЛиц = СредстваИндивидуальнойЗащиты.АнтропометрияФизическихЛиц(ФизическиеЛицаКЗаполнению);
	
	СИЗТребующиеВыдачи = СредстваИндивидуальнойЗащиты.СИЗКЗаказуНаВыдачу(
		ТаблицаФизическиеЛицаРабочиеМеста.Скопировать(), ДатаАктуальности, ОтмеченныеСИЗ);
	ТипыНоменклатурыСИЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		СИЗТребующиеВыдачи.ВыгрузитьКолонку("СИЗ"), "ТипНоменклатуры");
	
	РабочиеМестаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	РеквизитыРабочихМест = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РабочиеМестаСотрудников, "Подразделение,Должность");
	
	ФизическиеЛицаДокумента = РабочиеМеста.ВыгрузитьКолонку("ФизическоеЛицо");
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗСотрудникаКЗаполнению = СИЗСотрудникаКЗаполнению(ДанныеСИЗ, СИЗТребующиеВыдачи, ЕстьОтмеченныеСИЗВТаблице);
		СтрокаРабочееМесто = Неопределено;
		СИЗСотрудникаВДокументе = Новый Массив;
		ОбработатьРанееДобавленныхВДокументСотрудников(СтрокаРабочееМесто, ДанныеСИЗ.ФизическоеЛицо, ФизическиеЛицаДокумента,
			СИЗСотрудникаКЗаполнению, СИЗСотрудникаВДокументе);
		КоличествоСИЗ = СИЗСотрудникаКЗаполнению.Количество();
		Если КоличествоСИЗ = 0 И Не ДобавлятьБезСИЗ Тогда
			Если СтрокаРабочееМесто <> Неопределено И СИЗСотрудникаВДокументе.Количество() = 0 Тогда
				РабочиеМеста.Удалить(РабочиеМеста.Индекс(СтрокаРабочееМесто));
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Если СтрокаРабочееМесто = Неопределено Тогда
			СтрокаРабочееМесто = РабочиеМеста.Добавить();
			СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста = Сч;
			Сч = Сч + 1;
			СтрокаРабочееМесто.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
			СтрокаРабочееМесто.РабочееМесто = ДанныеСИЗ.РабочееМесто;
			ЗаполнитьЗначенияСвойств(СтрокаРабочееМесто, РеквизитыРабочихМест.Получить(СтрокаРабочееМесто.РабочееМесто));
		КонецЕсли;
		Если КоличествоСИЗ = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПоследниеВыдачиСИЗ = СредстваИндивидуальнойЗащиты.ПоследниеВыдачиСИЗПоНоменклатуре(
			СтрокаРабочееМесто.ФизическоеЛицо, Организация, ДатаАктуальности);
		Для Каждого НайденныйСИЗ Из СИЗСотрудникаКЗаполнению Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			АнтропометрияСотрудника = АнтропометрияФизическихЛиц.Получить(СтрокаРабочееМесто.ФизическоеЛицо);
			Если АнтропометрияСотрудника <> Неопределено Тогда
				НоваяСтрокаСИЗ.Размер = СредстваИндивидуальнойЗащиты.РазмерСотрудника(
					ТипыНоменклатурыСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ), АнтропометрияСотрудника);
			КонецЕсли;
			Если ПоследниеВыдачиСИЗ <> Неопределено Тогда
				ПоследняяВыдачаСИЗ = ПоследниеВыдачиСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ);
				Если ПоследняяВыдачаСИЗ <> Неопределено Тогда
					НоваяСтрокаСИЗ.ПоследняяВыдача = ПоследняяВыдачаСИЗ.Период;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьРанееДобавленныхВДокументСотрудников(СтрокаРабочееМесто, ФизическоеЛицо, ФизическиеЛицаДокумента, СИЗСотрудникаКЗаполнению, СИЗСотрудникаВДокументе)
	
	Если ФизическиеЛицаДокумента.Найти(ФизическоеЛицо) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаРабочееМесто = РабочиеМеста.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо))[0];
	СИЗСотрудникаВДокументе = НоменклатураСИЗ.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
	ЭлементыСИЗ = ОбщегоНазначения.ВыгрузитьКолонку(СИЗСотрудникаКЗаполнению, "СИЗ");
	ТекущийИндекс = СИЗСотрудникаВДокументе.ВГраница();
	Пока ТекущийИндекс >= 0 Цикл
		Если ЭлементыСИЗ.Найти(СИЗСотрудникаВДокументе[ТекущийИндекс].СИЗ) = Неопределено Тогда
			СИЗСотрудникаВДокументе.Удалить(ТекущийИндекс);
		КонецЕсли;
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	ЭлементыСИЗ = ОбщегоНазначения.ВыгрузитьКолонку(СИЗСотрудникаВДокументе, "СИЗ");
	ТекущийИндекс = СИЗСотрудникаКЗаполнению.ВГраница();
	Пока ТекущийИндекс >= 0 Цикл
		Если ЭлементыСИЗ.Найти(СИЗСотрудникаКЗаполнению[ТекущийИндекс].СИЗ) <> Неопределено Тогда
			СИЗСотрудникаКЗаполнению.Удалить(ТекущийИндекс);
		КонецЕсли;
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Функция СИЗСотрудникаКЗаполнению(ДанныеСИЗ, СИЗТребующиеВыдачи, ЕстьОтмеченныеСИЗВТаблице)
	
	Если ЕстьОтмеченныеСИЗВТаблице Тогда
		СИЗСотрудника = СИЗТребующиеВыдачи.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		СИЗСотрудникаКЗаполнению = Новый Массив;
		Для Каждого СтрокаСИЗСотрудника Из СИЗСотрудника Цикл
			Если ДанныеСИЗ.ОтмеченныеСИЗ.Найти(СтрокаСИЗСотрудника.СИЗ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СИЗСотрудникаКЗаполнению.Добавить(СтрокаСИЗСотрудника);
		КонецЦикла;
	Иначе
		СИЗСотрудникаКЗаполнению = СИЗТребующиеВыдачи.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
	КонецЕсли;
	
	Возврат СИЗСотрудникаКЗаполнению;
	
КонецФункции

Процедура УдалитьИзДокументаЛишнихСотрудников(ФизическиеЛица)
	
	ТекущийИндекс = РабочиеМеста.Количество() - 1;
	Пока ТекущийИндекс >= 0 Цикл
		Если ФизическиеЛица.Найти(РабочиеМеста[ТекущийИндекс].ФизическоеЛицо) = Неопределено Тогда
			СИЗСотрудникаВДокументе = НоменклатураСИЗ.НайтиСтроки(Новый Структура("ИдентификаторСтрокиРабочегоМеста",
				РабочиеМеста[ТекущийИндекс].ИдентификаторСтрокиРабочегоМеста));
			ТекущийИндексСИЗ = СИЗСотрудникаВДокументе.ВГраница();
			Пока ТекущийИндексСИЗ >= 0 Цикл
				СИЗСотрудникаВДокументе.Удалить(ТекущийИндексСИЗ);
				ТекущийИндексСИЗ = ТекущийИндексСИЗ - 1;
			КонецЦикла;
			РабочиеМеста.Удалить(ТекущийИндекс);
		КонецЕсли;
		ТекущийИндекс = ТекущийИндекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЗначенияПоУмолчанию()
	
	ЗначенияПоУмолчанию = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияПоУмолчанию);
	Ответственный = ЗначенияПоУмолчанию.Ответственный;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
			ЗаполнитьНормуВыдачи(НоваяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНормуВыдачи(Строка)
	
	Строка.НормаВыдачи = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
		Строка.КратностьВыдачи, Строка.ПериодичностьВыдачи, Строка.ЕдиницаПериодичностиВыдачи, , , Строка.СпособВыдачи);
	
	Если Строка.Дежурное Тогда
		Если Строка.НормаВыдачи = "" Тогда
			Строка.НормаВыдачи = НСтр("ru='Дежурное'");
		Иначе
			Строка.НормаВыдачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='%1 - дежурное'"), Строка.НормаВыдачи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли