
#Область ПрограммныйИнтерфейс

// Подробнее
// См. РегистрСведений.ЗадачиБухгалтера.Форма.ЗадачиВАрхиве.ОбработкаОповещения
//
// Изменяет значение отбора в динамическом списке.
// Поиск производится по представлению в элементах отборов верхнего уровня.
//
// Надо анализировать возвращаемое значение - и если вернется
//  Неопределено (т.е. отбор не установлен по причине того, что в списке
//  нет отбора по основной организации (он исправлен вручную и т.п.)), то не надо
//  присваивать Неопределено специальному полю "ОтборПоОрганизации" в форме списка.
//
// Параметры
//  Список         - ДинамическийСписок - список, в котором необходимо изменить значение отбора.
//  ИмяРеквизита   - Строка - имя поля-организации в динамическом списке.
//  ЗначениеОтбора - СправочникСсылка.Организации, СписокЗначений, Массив - значение отбора.
//
// Возвращаемое значение:
//   СправочникСсылка.Организации - Если отбор установлен, то вернет значение отбора.
//
Процедура ИзменитьОтборПоОсновнойОрганизации(Список, ИмяРеквизита = "Организация", Знач ЗначениеОтбора = Неопределено) Экспорт

	ЗарплатаКадрыКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, ИмяРеквизита, ЗначениеОтбора);
	
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.СписокВыбор
//
Процедура ОткрытьФормуПоСтрокеБухгалтерскаяОтчетность(Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.СписокВыбор
//
Процедура ОткрытьФормуПоСтрокеНалогНаПрибыль(Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.СписокВыбор
//
Процедура ПроверитьЭтоВидПодакцизныхТоваров(Признак, Тип) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.ОповеститьОбИзмененииНастроек
//
Процедура ОповеститьОбИзмененииНастроекНалогиОтчеты() Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадачНастройка.НалогиИОтчеты
//
Процедура ОткрытьСписокНалогиИОтчеты() Экспорт
	
	ЗарплатаКадрыКлиент.ОткрытьСписокНалогиИОтчеты();
	
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадачНастройка.НастройкаСинхронизацииСКалендаремGoogle
//
Процедура ОткрытьФормуНастройкиСинхронизацииСКалендаремGoogle() Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.ОбработкаНавигационнойСсылки
//
Процедура ПерейтиПоСсылкеБаннера(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка, Баннер, Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.ЗакрытьБаннерНажатие
//
Процедура ЗакрытьБаннер(Форма, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.ПредыдущийБаннерНажатие
//
Процедура УстановитьРежимОжиданияНаБаннере(Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.ТекстСостояниеЗагрузкиОбработкаНавигационнойСсылки
//
Процедура ОбработкаНавигационнойСсылкиБаннера(Форма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.Подключаемый_УстановитьСледующийБаннер
//
Процедура ЗаполнитьИнтервалПереключенияБаннеров(ИнтервалПереключенияБаннеров) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.УстановитьБаннер
//
Процедура ОпределитьНаличиеСертификатовЭлектроннойОтчетности(ОписаниеОповещения, ИННОрганизации) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.Подключаемый_АУСН
//
Процедура ВыполнитьОбменССервисомАУСН(Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяФорма.СписокЗадач.Подключаемый_АУСН
//
Процедура ВыполнитьОбменССервисомЛКАУСН(Форма) Экспорт
КонецПроцедуры

// Подробнее
// См. ОбщаяКоманда.СписокЗадач.ОбработкаКоманды
//
Процедура ОткрытьСписокЗадач() Экспорт
	
	ЗарплатаКадрыКлиент.ОткрытьСписокЗадач();
	
КонецПроцедуры

// Подробнее
// См. РегистрСведений.ЗадачиБухгалтера.Форма.ЗадачиВАрхиве.ПроверкаВыбораВСпискеЗадачиВАрхиве
//
Процедура ПроверкаВыбораВСпискеЗадачиВАрхиве(Форма, ВыборЗапрещен, ТекстПредупреждения) Экспорт
КонецПроцедуры

#КонецОбласти
