#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Т1
	|	ПО Т1.ФизическоеЛицо = Т.ФизическоеЛицо
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т.ФизическоеЛицо)
	|	ИЛИ ЭтоАвторизованныйПользователь(Т1.Ссылка)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Справка сотрудника.
// 
// Параметры:
//  ЗапросСправки - ДокументСсылка.ЗапросСправкиСотрудником, ДокументОбъект.ЗапросСправкиСотрудником - 
// 
// Возвращаемое значение:
//  см. СамообслуживаниеСотрудников.НовыйРезультатПолученияСправки
Функция ПечатнаяФормаСправки(ЗапросСправки) Экспорт
	
	Если ТипЗнч(ЗапросСправки) = Тип("ДокументСсылка.ЗапросСправкиСотрудником") Тогда
		РеквизитыСправки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗапросСправки, "ФизическоеЛицо, ВидСправки");
		ФизическоеЛицо = РеквизитыСправки.ФизическоеЛицо;
		ВидСправки = РеквизитыСправки.ВидСправки;
	Иначе
		ФизическоеЛицо = ЗапросСправки.ФизическоеЛицо;
		ВидСправки = ЗапросСправки.ВидСправки;
	КонецЕсли;
	
	ПечатнаяФормаСправки = Неопределено;
	
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Или Не ЗначениеЗаполнено(ВидСправки) Тогда
		Возврат ПечатнаяФормаСправки;
	КонецЕсли;
	
	ПараметрыПолученияСправок = СамообслуживаниеСотрудников.НовыеПараметрыПолученияСправок();
	НоваяСтрока = ПараметрыПолученияСправок.Добавить();
	НоваяСтрока.ИдентификаторЗапроса = 0;
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	НоваяСтрока.ВидСправки = ВидСправки;
	
	Результаты = СамообслуживаниеСотрудников.ПечатныеФормыПредоставляемыхСотрудникамСправок(
		ПараметрыПолученияСправок);
		
	Результат = Результаты.Найти(НоваяСтрока.ИдентификаторЗапроса, "ИдентификаторЗапроса").Результат;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
		Метаданные.Документы.ЗапросСправкиСотрудником.Реквизиты.ФизическоеЛицо, "УправленческиеДанные");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли