#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадрыРасширенный.ЗаполнитьНаборыПоФизическимЛицам(ЭтотОбъект, Таблица, "ФизическоеЛицо");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТребуетсяСформироватьСправкуАвтоматически(РежимЗаписи) Тогда
		УстановитьПривилегированныйРежим(Истина);
		СоздатьСправку();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ЗапросОбработан = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗапросОбработан Тогда
		Если Не Пользователи.РолиДоступны(Метаданные.Роли.СогласованиеЗапросовСправокСотрудником.Имя) Тогда
			ТекстСообщения = НСтр("ru = 'Недостаточно прав для записи запроса в состоянии «Обработан»'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает и сохраняет справку в присоединенном файле.
Процедура СоздатьСправку()
	
	Результат = Документы.ЗапросСправкиСотрудником.ПечатнаяФормаСправки(ЭтотОбъект);

	Если Не Результат.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПечатнаяФормаСправки = Результат.ТабличныйДокумент;
	
	Если ПечатнаяФормаСправки.ВысотаТаблицы = 0 Тогда
		Справка = Справочники.ЗапросСправкиСотрудникомПрисоединенныеФайлы.ПустаяСсылка();
	Иначе
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ВладелецФайлов = Ссылка;
		Иначе
			ВладелецФайлов = Документы.ЗапросСправкиСотрудником.ПолучитьСсылку();
			УстановитьСсылкуНового(ВладелецФайлов);
		КонецЕсли;
		
		СамообслуживаниеСотрудников.СохранитьТабличныйДокументВПрисоединенномФайле(ЭтотОбъект, ВладелецФайлов,
			ПечатнаяФормаСправки, "Справка", НСтр("ru = 'Справка'"), ЭДОБЗКВызовСервера.ТипФайлаЭлектронногоДокумента());
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуетсяСформироватьСправкуАвтоматически(РежимЗаписи)
	
	Возврат РежимЗаписи = РежимЗаписиДокумента.Проведение И Не СправкаСформирована()
		И СамообслуживаниеСотрудников.ФормироватьСправкуАвтоматически(ВидСправки);
	
КонецФункции

Функция СправкаСформирована()
	
	Возврат ЗначениеЗаполнено(Справка) И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справка, "ПометкаУдаления");
		
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли