
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументов.ИнициализироватьОтборКомпоновщикаНастроек(
		Параметры,, КомпоновщикНастроек, СхемаКомпоновкиДанных, УникальныйИдентификатор, Отказ);
	
	Элементы.ФормаКомандаОК.Видимость = Не ТолькоПросмотр;
	
	Если ЗначениеЗаполнено(Параметры.ЗаголовокОкна) Тогда
		Заголовок = Параметры.ЗаголовокОкна;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораДоступногоПоля" Тогда
		
		ТекущаяСтрока = КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(Элементы.НастройкаКомпоновкиНастройкиОтбор.ТекущаяСтрока);
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ВыбранноеЗначение.Поле);
			ТекущаяСтрока.ВидСравнения = ВыбранноеЗначение.ВидСравнения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Очистить(Команда)
	
	КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ЕстьНезаполненныеПоля(КомпоновщикНастроек.Настройки.Отбор) Тогда
		ТекстСообщения = НСтр("ru='В настройке есть незаполненные поля'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Модифицированность Тогда
		
		Модифицированность = Ложь;
		
		НастройкиОтбора = ?(КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() = 0, "",
			СериализоватьНастройкиКомпоновщика(КомпоновщикНастроек));
		
		Результат = Новый Структура;
		Результат.Вставить("НастройкиОтбора", НастройкиОтбора);
		Результат.Вставить("ПредставлениеОтбора", Строка(КомпоновщикНастроек.Настройки.Отбор));
		
		ОповеститьОВыборе(Результат);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СериализоватьНастройкиКомпоновщика(КомпоновщикНастроек)
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.Настройки);
	
КонецФункции

&НаКлиенте
Функция ЕстьНезаполненныеПоля(Отбор)
	
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Если ЕстьНезаполненныеПоля(ЭлементОтбора) Тогда
				Возврат Истина;
			КонецЕсли;
		Иначе
			Если Не ЗначениеЗаполнено(ЭлементОтбора.ЛевоеЗначение) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
