#Область СлужебныйПрограммныйИнтерфейс

// Обработчик ПриСозданииНаСервере для формы с оповещениями о загрузке кандидатов.
// 
// Параметры:
//  Форма - Форма
//  Отказ - Булево
Процедура ФормаСОповещениямиПриСозданииНаСервере(Форма, Отказ) Экспорт
	
	ДобавитьРеквизитыФормы(Форма);

	Если Не ЗагрузкаКандидатовИзИнтернетаСлужебный.ЗагрузкаКандидатовИзИнтернетаДоступна() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПроверкуЗагрузкиКандидатовИзИнтернета(Форма);
	ЗаполнитьЛоготипыСайтов(Форма);
	
КонецПроцедуры

Процедура ПерсональныеНастройкиПриСозданииНаСервере(Форма, Отказ) Экспорт
	Форма.Элементы.НастроитьРаботуРасширенияБраузера.Видимость = 
		ПолучитьФункциональнуюОпцию("ИспользоватьЗагрузкуКандидатовИзИнтернета");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПроверкуЗагрузкиКандидатовИзИнтернета(Форма)
	Форма.ПроверятьЗагрузкуКандидатовИзИнтернета = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюРекрутинговыхСайтов")
		И ЗагрузкаКандидатовИзИнтернета.ИспользуетсяЗагрузкаКандидатовИзИнтернета();
КонецПроцедуры

Процедура ДобавитьРеквизитыФормы(Форма)

	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ПроверятьЗагрузкуКандидатовИзИнтернета", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("СообщатьОНеЗагруженныхКандидатах", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ЛоготипыСайтов", Новый ОписаниеТипов()));
	
	ИменаСуществующихРеквизитов = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, ИменаСуществующихРеквизитов);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, ИменаСуществующихРеквизитов);
	
КонецПроцедуры

Процедура ЗаполнитьЛоготипыСайтов(Форма)

	Соответствие = Новый Соответствие();
	Для Каждого Сайт Из РекрутинговыеСайты.ШаблоныСтраницСайтов() Цикл
		Соответствие.Вставить(Сайт.Сайт, Сайт.Логотип);
	КонецЦикла;
	
	Соответствие.Вставить(Справочники.ИсточникиИнформацииОКандидатах.ПустаяСсылка(), Новый Картинка());
	
	Форма.ЛоготипыСайтов = Новый ФиксированноеСоответствие(Соответствие);
	
КонецПроцедуры

#КонецОбласти
