// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает новую структуру описания возвращаемых данных.
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//	Структура:
//	 * МодульМенеджер - ОбщийМодуль, СправочникиМенеджер, ОтчетыМенеджер - модуль менеджера получения данных.
//	 * Наименование - Строка - наименование возвращаемых данных.
//	 * Описание - Строка - подробное описание возвращаемых данных.
//	 * ТипыРезультата - Массив из Строка - типы возвращаемых данных.
//	 
Функция НовыйОписаниеВозвращаемыхДанных() Экспорт
КонецФункции

// Возвращает перечень доступных данных
// @skip-check module-empty-method - реализован в расширении fresh.
// 
// Возвращаемое значение:
//	Соответствие из КлючИЗначение - перечень доступных возвращаемых данных:
//	 * Ключ - Строка - идентификатор данных.
//	 * Значение - см. АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных
//	
Функция ДоступныеВозвращаемыеДанные() Экспорт
КонецФункции

#КонецОбласти
 
