#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЗначениеИзменено;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеИзменено = Значение <> Константы.ИспользоватьЭППриВыполненииЭтапов.Получить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеИзменено
		И Значение = Ложь Тогда
		Константы.ПроверятьИмеющиесяЭППриОчередномПодписании.Установить(Ложь);
		Если НЕ Константы.ИспользоватьПростыеЭППриВыполненииЭтапов.Получить() Тогда
			Константы.ПроверятьПодписанныеДанныеПриОчередномПодписании.Установить(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
