//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Сайты - Массив Из СправочникСсылка.ИсточникиИнформацииОКандидатах
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДлительнаяОперацияЗагрузкиКлассификаторов(Сайты, УникальныйИдентификатор) Экспорт

	ИмяПроцедуры = "РекрутинговыеСайты.ЗагрузитьКлассификаторы";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяПроцедуры, Сайты);

КонецФункции

// Параметры:
//  ИдентификаторФормы - УникальныйИдентификатор
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  См. ДлительныеОперации.ВыполнитьФункцию
Функция ДлительнаяОперацияЗагрузкиРезюме(ИдентификаторФормы, АдресРезюме) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка резюме с рекрутингового сайта'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"РекрутинговыеСайты.ДанныеКандидатаССайта", АдресРезюме);

КонецФункции

// См. РекрутинговыеСайтыСлужебный.СохранитьКлассификаторы
Процедура СохранитьКлассификаторы(Классификаторы, ДанныеСайтов) Экспорт
	
	РекрутинговыеСайты.СохранитьКлассификаторы(Классификаторы, ДанныеСайтов);
	
КонецПроцедуры

// Параметры:
//  Сайт - СправочникСсылка.ИсточникиИнформацииОКандидатах
// 
// Возвращаемое значение:
//  Неопределено, Массив Из СправочникСсылка.Вакансии -
Функция ВакансииССайта(Сайт) Экспорт
	
	Возврат РекрутинговыеСайты.ВакансииССайта(Сайт);
	
КонецФункции

// См. РекрутинговыеСайты.СнятьПубликациюВакансии
Функция СнятьПубликациюВакансии(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	Возврат РекрутинговыеСайты.СнятьПубликациюВакансии(Вакансия, Сайт, ИдентификаторВакансии);
	
КонецФункции

// См. РекрутинговыеСайты.СайтыСПубликациями
Функция СайтыСПубликациями(Вакансия) Экспорт
	
	Возврат РекрутинговыеСайты.СайтыСПубликациями(Вакансия);
	
КонецФункции

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.ПолучитьОтклики
Процедура ПолучитьОтклики(Вакансия, Сайт) Экспорт
	
	Пользователь = РекрутинговыеСайты.ОтветственныйЗаПубликацию(Вакансия, Сайт);
	
	РекрутинговыеСайты.ПолучитьОтклики(Вакансия, Сайт, Пользователь);
	
КонецПроцедуры

// См. РекрутинговыеСайты.ОтметитьПубликациюВакансииСнятой
Процедура ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт, ИдентификаторВакансии) Экспорт
	
	РекрутинговыеСайты.ОтметитьПубликациюВакансииСнятой(Вакансия, Сайт, ИдентификаторВакансии);
	
КонецПроцедуры

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.ТекстВопросаПоКонтактногоДоступа
Функция ТекстВопросаПоКонтактногоДоступа(Сайт) Экспорт
	
	Возврат РекрутинговыеСайты.ТекстВопросаПоКонтактногоДоступа(Сайт);
	
КонецФункции

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.БольшеНеЗадаватьВопросПоКонтактногоДоступа
Функция БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	Возврат РекрутинговыеСайты.БольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт);
	
КонецФункции

// См. ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами.СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа
Процедура СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт) Экспорт
	
	РекрутинговыеСайты.СохранитьБольшеНеЗадаватьВопросПоКонтактногоДоступа(Сайт);
	
КонецПроцедуры

#КонецОбласти
