////////////////////////////////////////////////////////////////////////////////
// Работа с цветом
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// RGBПо web цвету.
// 
// Параметры:
//  ПредставлениеWebЦвета - Цвет - Представление web цвета
// 
// Возвращаемое значение:
//  Неопределено, Структура - RGBПо web цвету:
// * Красный - Число - 
// * Зеленый - Число - 
// * Синий - Число - 
Функция RGBПоWebЦвету(ПредставлениеWebЦвета) Экспорт
	
	Макет = ПолучитьОбщийМакет("МакетОпределенияЦвета");
	
	// Получение английского варианта - "Aquamarine"
	НазваниеЦвета = Сред(ПредставлениеWebЦвета, СтрНайти(ПредставлениеWebЦвета, "(") + 1);
	НазваниеЦвета = Лев(НазваниеЦвета, СтрДлина(НазваниеЦвета) - 1);
	
	НазваниеОбласти = НазваниеОбластиWebЦветов(Истина);
	ОбластьЦветов = Макет.НайтиТекст(НазваниеЦвета, , Макет.Область(НазваниеОбласти), , Истина, , Истина);
	
	Если ОбластьЦветов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбластьСоответствияКрасный = Макет.Область(ОбластьЦветов.Верх, Макет.Область("RedWebЦвета").Лево);
	Если ОбластьСоответствияКрасный = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбластьСоответствияЗеленый = Макет.Область(ОбластьЦветов.Верх, Макет.Область("GreenWebЦвета").Лево);
	ОбластьСоответствияСиний = Макет.Область(ОбластьЦветов.Верх, Макет.Область("BlueWebЦвета").Лево);
	
	Результат = Новый Структура;
	Результат.Вставить("Красный", Число(ОбластьСоответствияКрасный.Текст));
	Результат.Вставить("Зеленый", Число(ОбластьСоответствияЗеленый.Текст));
	Результат.Вставить("Синий", Число(ОбластьСоответствияСиний.Текст));
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив, объектов Цвет, созданных на основе WebЦветов в макете МакетОпределенияЦвета
// 
// Возвращаемое значение:
//  Массив из Цвет
//
Функция ЦветаWebЦветов() Экспорт
	
	Макет = ПолучитьОбщийМакет("МакетОпределенияЦвета");
	
	ОбластьЦветов = Макет.ПолучитьОбласть("ОпределениеЦветов|RGBWebЦвета");
	
	Результат = Новый Массив;
	Для Индекс = 1 По ОбластьЦветов.ВысотаТаблицы Цикл
		
		Красный = Число(ОбластьЦветов.Область(СтрШаблон("R%1C1", Индекс)).Текст);
		Зеленый = Число(ОбластьЦветов.Область(СтрШаблон("R%1C2", Индекс)).Текст);
		Синий = Число(ОбластьЦветов.Область(СтрШаблон("R%1C3", Индекс)).Текст);
		//@skip-check new-color
		Результат.Добавить(Новый Цвет(Красный, Зеленый, Синий));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив с WebЦветами из общего макета МакетОпределенияЦвета
// 
// Возвращаемое значение:
//  Массив из Цвет
//
Функция ОсновныеЦвета() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить(Новый Цвет(255, 255, 255));
	Результат.Добавить(Новый Цвет(0, 0, 0));
	Результат.Добавить(Новый Цвет(255, 0, 0));
	Результат.Добавить(Новый Цвет(255, 127, 0));
	Результат.Добавить(Новый Цвет(255, 255, 0));
	Результат.Добавить(Новый Цвет(0, 255, 0));
	Результат.Добавить(Новый Цвет(0, 255, 255));
	Результат.Добавить(Новый Цвет(0, 0, 255));
	Результат.Добавить(Новый Цвет(127, 0, 255));
	Результат.Добавить(Новый Цвет(255, 0, 255));
	
	Возврат Результат;
	
КонецФункции

// Возвращает абсолютный цвет по принятому цвету
//
// Параметры:
//  Цвет - Цвет - цвет любого вида
// 
// Возвращаемое значение:
//  - Цвет - цвет с видом Абсолютный
//
Функция АбсолютныйЦвет(Цвет) Экспорт
	
	Если Цвет.Вид = ВидЦвета.Абсолютный Тогда
		Возврат Цвет;
	КонецЕсли;
	
	Поток = Новый ПотокВПамяти;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Область("R1C1").ЦветФона = Цвет;
	ТабличныйДокумент.Записать(Поток, ТипФайлаТабличногоДокумента.MXL7);
	ТабличныйДокумент.Прочитать(
	Поток.ЗакрытьИПолучитьДвоичныеДанные().ОткрытьПотокДляЧтения(),
	СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	Возврат ТабличныйДокумент.Область("R1C1").ЦветФона;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НазваниеОбластиWebЦветов(Английский = Ложь)
	
	Возврат СтрШаблон("ОпределениеЦветов|НазваниеWebЦвета%1", ?(Английский, "En", "Ru"));
	
КонецФункции

#КонецОбласти
