#Область ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовКлиент");
		МодульПроцессыОбработкиДокументовКлиент.ПослеНачалаРаботыСистемы();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область РаботаСФормами

Процедура ПередЗакрытием(Форма, Источник, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовКлиент");
		МодульПроцессыОбработкиДокументовКлиент.ПередЗакрытием(Форма, Источник, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьЗадачу(Форма, Команда, Источник) Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовКлиент");
		МодульПроцессыОбработкиДокументовКлиент.ВыполнитьЗадачу(Форма, Команда, Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомментарийНаправившегоОткрытие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовКлиент");
		МодульПроцессыОбработкиДокументовКлиент.КомментарийНаправившегоОткрытие(Форма, Элемент, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомментарийСледующемуНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		МодульПроцессыОбработкиДокументовКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовКлиент");
		МодульПроцессыОбработкиДокументовКлиент.КомментарийСледующемуНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#КонецОбласти
