
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстОбщегоЗапроса(ИсточникДанных, ТолькоРазрешенные) Экспорт
	
	Возврат МодульКонтракта().ПолучитьТекстОбщегоЗапроса(ИсточникДанных, ТолькоРазрешенные);
	
КонецФункции

Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Возврат КонтейнерТекстаЗапросаИПараметров(
		МодульКонтракта().ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров));
	
КонецФункции

Функция КонтейнерТекстаЗапросаИПараметров(Запрос)
	
	Если Запрос = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Контейнер = Новый Структура;
	Контейнер.Вставить("Текст", Запрос.Текст);
	Контейнер.Вставить("Параметры", ОбщегоНазначения.СкопироватьРекурсивно(Запрос.Параметры));
	
	Возврат Контейнер;
	
КонецФункции

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанныхБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбщиеНаборыДанныхРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
