#Область СлужебныеПроцедурыИФункции

Процедура ПослеПолученияДанныхНаСервере(Форма, ОписаниеТаблицыНДФЛ) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура РеквизитыВДанные(Форма, ТекущийОбъект, ОписаниеТаблицыНДФЛ) Экспорт 
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура РаспределитьПоИсточникамФинансирования(Объект) Экспорт 
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ДополнитьФормуДокумента(Форма) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

#КонецОбласти