#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Если Пользователи.РолиДоступны("ДобавлениеИзменениеОценочныхОбязательствЗарплатаКадры,ЧтениеОценочныхОбязательствЗарплатаКадры", , Ложь) Тогда
		
		СписокОперацийСКомандамиПечати = Новый СписокЗначений;
		СписокОперацийСКомандамиПечати.Добавить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Начисление);
		СписокОперацийСКомандамиПечати.Добавить(Перечисления.ВидыОперацийРезервовПоОплатеТруда.Инвентаризация);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Документ.РезервыПоОплатеТруда";
		КомандаПечати.Идентификатор = "ПФ_MXL_СправкаРасчетРезервовПоОплатеТруда";
		КомандаПечати.Представление = НСтр("ru = 'Справка-расчет'");
		КомандаПечати.Порядок = 20;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации", СписокОперацийСКомандамиПечати, ВидСравненияКомпоновкиДанных.ВСписке);
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Документ.РезервыПоОплатеТруда";
		КомандаПечати.Идентификатор = "ПФ_MXL_СправкаРасчетРезервовПоОплатеТрудаНУ";
		КомандаПечати.Представление = НСтр("ru = 'Справка-расчет (налоговый учет)'");
		КомандаПечати.Порядок = 30;
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.ДополнительныеПараметры.Вставить("ТребуетсяЧтениеБезОграничений", Истина);
		ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации", СписокОперацийСКомандамиПечати, ВидСравненияКомпоновкиДанных.ВСписке);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
