#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	ИдентификаторыСтрокРабочихМест = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из РабочиеМеста Цикл
		ИдентификаторыСтрокРабочихМест.Вставить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста, СтрокаТаблицы);
	КонецЦикла;
	ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Для Индекс = 0 По РабочиеМеста.Количество()-1 Цикл
		СтрокаРабочееМесто = РабочиеМеста.Получить(Индекс);
		СтрокиНоменклатурыРабочегоМеста = НоменклатураСИЗ.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиРабочегоМеста", СтрокаРабочееМесто.ИдентификаторСтрокиРабочегоМеста));
		
		Для Каждого СтрокаНоменклатураСИЗ Из СтрокиНоменклатурыРабочегоМеста Цикл
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"Номенклатура", НСтр("ru = 'номенклатура'"));
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"ДатаВыдачи", НСтр("ru = 'дата выдачи'"));
			ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ,
				"ДатаСледующейВыдачи", НСтр("ru = 'дата следующей выдачи'"));
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьВыдачиСИЗПоНоменклатуре(ГоловнаяОрганизация, ИдентификаторыСтрокРабочихМест)
	
	Для Каждого СтрокаТаблицы Из НоменклатураСИЗ Цикл
		ЗаписьНабора = Движения.ВыданныеСИЗ.Добавить();
		ЗаписьНабора.ВидДвижения = ВидДвиженияНакопления.Приход;
		ЗаписьНабора.Период = СтрокаТаблицы.ДатаВыдачи;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.ЕдиницаИзмерения = СтрокаТаблицы.ЕдиницаИзмерения;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ЗаписьНабора.ОснованиеВыдачи = Ссылка;
		ЗаписьНабора.Количество = СтрокаТаблицы.Количество;
		ЗаписьНабора.Дежурное = СтрокаТаблицы.Дежурное;
		Движения.ВыданныеСИЗ.Записывать = Истина;
		
		ЗаписьНабора = Движения.ВыдачиСИЗПоНоменклатуре.Добавить();
		ЗаписьНабора.Период = СтрокаТаблицы.ДатаВыдачи;
		СтрокаРабочееМесто = ИдентификаторыСтрокРабочихМест.Получить(СтрокаТаблицы.ИдентификаторСтрокиРабочегоМеста);
		ЗаписьНабора.ФизическоеЛицо = СтрокаРабочееМесто.ФизическоеЛицо;
		ЗаписьНабора.РабочееМесто = СтрокаРабочееМесто.РабочееМесто;
		ЗаписьНабора.ГоловнаяОрганизация = ГоловнаяОрганизация;
		ЗаписьНабора.СИЗ = СтрокаТаблицы.СИЗ;
		ЗаписьНабора.Номенклатура = СтрокаТаблицы.Номенклатура;
		ЗаписьНабора.ХарактеристикаНоменклатуры = СтрокаТаблицы.ХарактеристикаНоменклатуры;
		ЗаписьНабора.РезультатВыдачи = Перечисления.РезультатыВыдачиСИЗ.Выдано;
		ЗаписьНабора.ОснованиеВыдачи = Ссылка;
		ЗаписьНабора.ДокументВыдачи = Ссылка;
		ЗаписьНабора.ДатаСледующейВыдачи = СтрокаТаблицы.ДатаСледующейВыдачи;
		Движения.ВыдачиСИЗПоНоменклатуре.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗ(ИдентификаторыСИЗ) Экспорт
	
	НоменклатураСИЗ.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСИЗ = ИдентификаторыСИЗ.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСИЗ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСИЗ Из МассивСИЗ Цикл
			НоваяСтрока = НоменклатураСИЗ.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСИЗ);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСИЗТребующиеВыдачи(ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста = "РабочееМесто", Сч = 1, ДобавлятьБезСИЗ = Ложь) Экспорт
	
	ТаблицаФизическиеЛицаРабочиеМеста = СредстваИндивидуальнойЗащиты.ТаблицаФизическиеЛицаРабочиеМеста(
		ФизическиеЛицаРабочиеМеста, ИмяРабочегоМеста, , Истина);
	
	Если ТаблицаФизическиеЛицаРабочиеМеста.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаАктуальности = ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), КонецДня(ТекущаяДатаСеанса()));
	
	ФизическиеЛицаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("ФизическоеЛицо");
	АнтропометрияФизическихЛиц = СредстваИндивидуальнойЗащиты.АнтропометрияФизическихЛиц(ФизическиеЛицаСотрудников);
	
	СИЗТребующиеВыдачи = СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности);
	ТипыНоменклатурыСИЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СИЗТребующиеВыдачи.ВыгрузитьКолонку("СИЗ"), "ТипНоменклатуры");
	РабочиеМестаСотрудников = ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто");
	РеквизитыРабочихМест = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(РабочиеМестаСотрудников, "Подразделение,Должность");
	Для Каждого ДанныеСИЗ Из ТаблицаФизическиеЛицаРабочиеМеста Цикл
		СИЗРабочихМест = СИЗТребующиеВыдачи.НайтиСтроки(
			Новый Структура("РабочееМесто, ФизическоеЛицо", ДанныеСИЗ.РабочееМесто, ДанныеСИЗ.ФизическоеЛицо));
		КоличествоСИЗ = СИЗРабочихМест.Количество();
		Если КоличествоСИЗ = 0 И Не ДобавлятьБезСИЗ Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		Сч = Сч + 1;
		НоваяСтрока.ФизическоеЛицо = ДанныеСИЗ.ФизическоеЛицо;
		НоваяСтрока.РабочееМесто = ДанныеСИЗ.РабочееМесто;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РеквизитыРабочихМест.Получить(НоваяСтрока.РабочееМесто));
		Если КоличествоСИЗ = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого НайденныйСИЗ Из СИЗРабочихМест Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденныйСИЗ);
			НоваяСтрокаСИЗ.ДатаВыдачи = ДанныеСИЗ.ДатаВыдачи;
			АнтропометрияСотрудника = АнтропометрияФизическихЛиц.Получить(НоваяСтрока.ФизическоеЛицо);
			Если АнтропометрияСотрудника <> Неопределено Тогда
				НоваяСтрокаСИЗ.Размер = СредстваИндивидуальнойЗащиты.РазмерСотрудника(
					ТипыНоменклатурыСИЗ.Получить(НоваяСтрокаСИЗ.СИЗ), АнтропометрияСотрудника);
			КонецЕсли;
			
			ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
			ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, НоваяСтрокаСИЗ);
			ОписаниеПериодичности.Кратность = НоваяСтрокаСИЗ.КратностьВыдачи;
			ОписаниеПериодичности.Периодичность = НоваяСтрокаСИЗ.ПериодичностьВыдачи;
			ОписаниеПериодичности.ЕдиницаПериодичности = НоваяСтрокаСИЗ.ЕдиницаПериодичностиВыдачи;
			НоваяСтрокаСИЗ.ДатаСледующейВыдачи = СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(Дата, ОписаниеПериодичности);
			
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = НоваяСтрока.ИдентификаторСтрокиРабочегоМеста;
		КонецЦикла;
	КонецЦикла;
	
	СредстваИндивидуальнойЗащиты.ПодобратьПодходящуюНоменклатуру(НоменклатураСИЗ, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымИзФайла(АдресЗагруженныхДанных) Экспорт
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ЗагруженныеДанные, "ФизическоеЛицо");
	
	РабочиеМеста.Очистить();
	НоменклатураСИЗ.Очистить();
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ЗагруженныеДанные.ВыгрузитьКолонку("ФизическоеЛицо");
	ПараметрыПолучения.КадровыеДанные = "РабочееМестоОхраныТруда, Подразделение, Должность";
	
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолучения.Отборы,
		"РабочееМестоОхраныТруда", "<>", Неопределено);
	
	ПараметрыПолучения.Организация = Организация;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ПараметрыПолучения.Подразделение = Подразделение;
	КонецЕсли;
	ПараметрыПолучения.НачалоПериода = Дата;
	ПараметрыПолучения.ОкончаниеПериода = Дата;
	
	УстановитьПривилегированныйРежим(Истина);
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Сч = 1 По СотрудникиОрганизации.Количество() Цикл
		Строка = СотрудникиОрганизации[Сч - 1];
		НайденныеСтроки = ЗагруженныеДанные.НайтиСтроки(Новый Структура("ФизическоеЛицо", Строка.ФизическоеЛицо));
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = РабочиеМеста.Добавить();
		НоваяСтрока.РабочееМесто = Строка.РабочееМестоОхраныТруда;
		НоваяСтрока.Должность = Строка.Должность;
		НоваяСтрока.Подразделение = Строка.Подразделение;
		НоваяСтрока.ФизическоеЛицо = Строка.ФизическоеЛицо;
		НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = Сч;
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрокаСИЗ = НоменклатураСИЗ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСИЗ, НайденнаяСтрока);
			Если ЗначениеЗаполнено(НоваяСтрокаСИЗ.ЕдиницаПериодичностиВыдачи) Тогда
				НоваяСтрокаСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью;
			Иначе
				НоваяСтрокаСИЗ.СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса;
			КонецЕсли;
			НоваяСтрокаСИЗ.ИдентификаторСтрокиРабочегоМеста = НоваяСтрока.ИдентификаторСтрокиРабочегоМеста;
			ЗагруженныеДанные.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	Если ЗагруженныеДанные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ЗагруженныеДанные Цикл
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Строку со следующими данными не удалось добавить: Сотрудник ""%1"", СИЗ ""%2"", Номенклатура ""%3""'"),
			Строка.ФизическоеЛицо, Строка.СИЗ, Строка.Номенклатура);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, "Объект");
	КонецЦикла;
	
КонецПроцедуры

Функция СИЗТребующиеВыдачи(ТаблицаФизическиеЛицаРабочиеМеста, ДатаАктуальности)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ТаблицаФизическиеЛицаРабочиеМеста, "ВТФизическиеЛицаРабочиеМеста");
	
	СредстваИндивидуальнойЗащиты.СоздатьВТСИЗРабочегоМеста(
		МенеджерВременныхТаблиц, ТаблицаФизическиеЛицаРабочиеМеста.ВыгрузитьКолонку("РабочееМесто"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛицаРабочиеМеста.РабочееМесто КАК РабочееМесто,
		|	ФизическиеЛицаРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СИЗРабочегоМеста.СИЗ КАК СИЗ,
		|	СИЗРабочегоМеста.СпособВыдачи КАК СпособВыдачи,
		|	СИЗРабочегоМеста.Дежурное КАК Дежурное,
		|	СИЗРабочегоМеста.КратностьВыдачи КАК КратностьВыдачи,
		|	СИЗРабочегоМеста.ПериодичностьВыдачи КАК ПериодичностьВыдачи,
		|	СИЗРабочегоМеста.ЕдиницаПериодичностиВыдачи КАК ЕдиницаПериодичностиВыдачи,
		|	СИЗРабочегоМеста.Количество КАК Количество,
		|	СИЗРабочегоМеста.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТФизическиеЛицаРабочиеМеста КАК ФизическиеЛицаРабочиеМеста
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСИЗРабочегоМеста КАК СИЗРабочегоМеста
		|		ПО ФизическиеЛицаРабочиеМеста.РабочееМесто = СИЗРабочегоМеста.РабочееМесто
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо,
		|	РабочееМесто,
		|	СИЗ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПриПроверкеЗаполненияРеквизита(Отказ, СтрокаРабочееМесто, СтрокаНоменклатураСИЗ, ИмяПоля, Заголовок)
	
	Если ЗначениеЗаполнено(СтрокаНоменклатураСИЗ[ИмяПоля]) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сотруднику ""%1"" не установлена %2 для выдачи по СИЗ ""%3""'"),
		СтрокаРабочееМесто.ФизическоеЛицо, Заголовок, СтрокаНоменклатураСИЗ.СИЗ);
	Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РабочиеМеста", СтрокаРабочееМесто.НомерСтроки, "ФизическоеЛицо");
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, Поле, "Объект", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли