#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьУчебноеЗаведениеИзКемВыдан");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти 

Процедура ЗаполнитьУчебноеЗаведениеИзКемВыдан(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КлассификаторУчебноеЗаведениеСертификата", "1.2.643.5.1.13.13.11.1519");
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СертификатыПоСпециальностиФизическихЛиц.Специальность КАК Специальность,
	|	СертификатыПоСпециальностиФизическихЛиц.ДатаПолучения КАК ДатаПолучения,
	|	ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500)) КАК УдалитьКемВыдан,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчебныеЗаведенияПоПолномуНаименованию.Ссылка, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|			ТОГДА УчебныеЗаведенияПоПолномуНаименованию.Ссылка
	|		КОГДА ЕСТЬNULL(УчебныеЗаведенияПоНаименованию.Ссылка, ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|			ТОГДА УчебныеЗаведенияПоНаименованию.Ссылка
	|		КОГДА ЕСТЬNULL(ХарактеристикиУчебноеЗаведениеПоМедРегистру.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)
	|			ТОГДА ХарактеристикиУчебноеЗаведениеПоМедРегистру.Объект
	|	КОНЕЦ КАК УчебноеЗаведениеСсылка
	|ИЗ
	|	РегистрСведений.СертификатыПоСпециальностиФизическихЛиц КАК СертификатыПоСпециальностиФизическихЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеЗаведения КАК УчебныеЗаведенияПоПолномуНаименованию
	|		ПО ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500))) = УчебныеЗаведенияПоПолномуНаименованию.ПолноеНаименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчебныеЗаведения КАК УчебныеЗаведенияПоНаименованию
	|		ПО ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(150))) = УчебныеЗаведенияПоНаименованию.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУчебноеЗаведениеПоМедРегистру
	|		ПО (ХарактеристикиУчебноеЗаведениеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторУчебноеЗаведениеСертификата)
	|			И ((ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(500))) = ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаНаименование)
	|ГДЕ
	|	СертификатыПоСпециальностиФизическихЛиц.УчебноеЗаведение = ЗНАЧЕНИЕ(Справочник.УчебныеЗаведения.ПустаяСсылка)
	|	И (ВЫРАЗИТЬ(СертификатыПоСпециальностиФизическихЛиц.УдалитьКемВыдан КАК СТРОКА(1))) <> """"";
	
	Если ПараметрыОбновления = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", ""); 
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
	
	Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, "РегистрСведений.СертификатыПоСпециальностиФизическихЛиц", "", "") Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	ДобавленныеУчебныеЗаведения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл 
		НаборДляИзменения = РегистрыСведений.СертификатыПоСпециальностиФизическихЛиц.СоздатьНаборЗаписей();
		НаборДляИзменения.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборДляИзменения.Отбор.Специальность.Установить(Выборка.Специальность);
		НаборДляИзменения.Отбор.ДатаПолучения.Установить(Выборка.ДатаПолучения);
		НаборДляИзменения.Прочитать();
		ЗаписьДляИзменения = НаборДляИзменения[0];
		Если ЗначениеЗаполнено(Выборка.УчебноеЗаведениеСсылка) Тогда 
	        ЗаписьДляИзменения.УчебноеЗаведение = Выборка.УчебноеЗаведениеСсылка;
		Иначе
			НаименованиеУчебногоЗаведения = Выборка.УдалитьКемВыдан;
			УжеДобавленноеУчебноеЗаведение = ДобавленныеУчебныеЗаведения.Получить(НаименованиеУчебногоЗаведения);
			Если УжеДобавленноеУчебноеЗаведение = Неопределено Тогда
				НовоеУчебноеЗаведение = Справочники.УчебныеЗаведения.СоздатьЭлемент();
				НовоеУчебноеЗаведение.Наименование = НаименованиеУчебногоЗаведения;
				НовоеУчебноеЗаведение.ПолноеНаименование = НаименованиеУчебногоЗаведения;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НовоеУчебноеЗаведение);
				НовоеУчебноеЗаведениеСсылка = НовоеУчебноеЗаведение.Ссылка;
	        	ЗаписьДляИзменения.УчебноеЗаведение = НовоеУчебноеЗаведениеСсылка;
				ДобавленныеУчебныеЗаведения.Вставить(НаименованиеУчебногоЗаведения, НовоеУчебноеЗаведениеСсылка);
			Иначе 
	        	ЗаписьДляИзменения.УчебноеЗаведение = УжеДобавленноеУчебноеЗаведение;
			КонецЕсли;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборДляИзменения);
	КонецЦикла;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#КонецЕсли