#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает участников этапа работы с кандидатом.
//
// Параметры:
//	Кандидат			- СправочникСсылка.Кандидаты - кандидат, приглашенный на этап.
//	ЭтапРаботы			- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются участники.
//	ТолькоОбязательные	- Булево - если Истина, то возвращаются только обязательные участники, иначе - все.
//
// Возвращаемое значение:
//	Массив - коллекция ссылок типа СправочникСсылка.Пользователи.
//
Функция УчастникиЭтапа(Кандидат, ЭтапРаботы, ТолькоОбязательные = Ложь) Экспорт
	
	Участники = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчастникиЭтапаРаботыСКандидатом.Участник КАК Участник
	|ИЗ
	|	РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|ГДЕ
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат = &Кандидат
	|	И УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы = &ЭтапРаботы
	|	И &ТолькоОбязательные";
	
	УсловиеТолькоОбязательные = "ИСТИНА";
	
	Если ТолькоОбязательные Тогда
		УсловиеТолькоОбязательные = "УчастникиЭтапаРаботыСКандидатом.Обязательный"
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТолькоОбязательные", УсловиеТолькоОбязательные);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Участники = Результат.Выгрузить().ВыгрузитьКолонку("Участник");
	КонецЕсли;
	
	Возврат Участники;
	
КонецФункции

// Возвращает участников этапа работы с кандидатом.
//
// Параметры:
//	Кандидат	- СправочникСсылка.Кандидаты - кандидат, приглашенный на этап.
//	ЭтапРаботы	- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому запрашиваются участники.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица с колонками:
//		* Участник - СправочникСсылка.Пользователи.
//		* СостояниеПриглашения - ПеречислениеСсылка.СостоянияПриглашений.
//		* Обязательный - Булево.
//
Функция ТаблицаУчастниковЭтапа(Кандидат, ЭтапРаботы) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Кандидат", Кандидат);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЭтапРаботы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчастникиЭтапаРаботыСКандидатом.Участник КАК Участник,
	|	УчастникиЭтапаРаботыСКандидатом.СостояниеПриглашения КАК СостояниеПриглашения,
	|	УчастникиЭтапаРаботыСКандидатом.Обязательный КАК Обязательный
	|ИЗ
	|	РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|ГДЕ
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат = &Кандидат
	|	И УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы = &ЭтапРаботы";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Записывает участников этапа работы с кандидатом.
//
// Параметры:
//	Кандидат	- СправочникСсылка.Кандидаты - кандидат, приглашенный на этап.
//	ЭтапРаботы	- СправочникСсылка.ЭтапыРаботыСКандидатами - этап, по которому записываются участники.
//	Участники	- Массив - коллекция ссылок типа СправочникСсылка.Пользователи.
//	ОбязательныеУчастники	- Массив - коллекция ссылок типа СправочникСсылка.Пользователи.
//
Процедура ЗаписатьУчастниковЭтапа(Кандидат, ЭтапРаботы, Участники, Знач ОбязательныеУчастники = Неопределено) Экспорт
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УчастникиЭтапаРаботыСКандидатом");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Кандидат", Кандидат);
	ЭлементБлокировки.УстановитьЗначение("ЭтапРаботы", ЭтапРаботы);
	Блокировка.Заблокировать();

	НаборЗаписей = РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Кандидат.Установить(Кандидат);
	НаборЗаписей.Отбор.ЭтапРаботы.Установить(ЭтапРаботы);
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если Не ЗначениеЗаполнено(Участники) Тогда
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбязательныеУчастники) Тогда
		ОбязательныеУчастники = Новый Массив;
	КонецЕсли;
	
	ТекущиеУчастникиЭтапа = ТаблицаУчастниковЭтапа(Кандидат, ЭтапРаботы);
	Для Каждого Участник Из Участники Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Кандидат = Кандидат;
		НоваяЗапись.ЭтапРаботы = ЭтапРаботы;
		НоваяЗапись.Участник = Участник;
		НоваяЗапись.Обязательный = Не (ОбязательныеУчастники.Найти(Участник) = Неопределено);
		ДанныеУчастника = ТекущиеУчастникиЭтапа.Найти(Участник, "Участник");
		Если ДанныеУчастника = Неопределено Тогда
			НоваяЗапись.СостояниеПриглашения = Перечисления.СостоянияПриглашений.НеОтправлено;
		Иначе
			НоваяЗапись.СостояниеПриглашения = ДанныеУчастника.СостояниеПриглашения;
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Записывает состояние приглашений участников.
//
// Параметры:
//  Участники - Массив - коллекция структур, ключи которых соответсвуют данным регистра.
//
Процедура ЗаписатьСостоянияПриглашений(Участники) Экспорт
	
	Для Каждого Участник Из Участники Цикл
		Запись = РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Участник, "Кандидат, ЭтапРаботы, Участник");
		Запись.Прочитать();
		Если Запись.Выбран()
			И Запись.СостояниеПриглашения = Участник.СостояниеПриглашения
			И Запись.Обязательный = Участник.Обязательный Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, Участник, "СостояниеПриглашения, Обязательный");
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Кандидат",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
