
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуДанных();
	НастроитьЭлементыФормы();
	УстановитьУсловноеОформление();
	
	Если Не ЗначениеЗаполнено(Заголовок) Тогда
		Заголовок = НСтр("ru = 'Обработка данных'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ОбработкаНеисправностейБЭДКлиент.ИмяСобытияИсправлениеВидаОшибки()
		И ТипЗнч(Параметр) = Тип("Массив") Тогда
		Для каждого ЭлементМассива Из Параметр Цикл
			СтрокиТаблицы = ТаблицаДанных.НайтиСтроки(Новый Структура("Ссылка", ЭлементМассива));
			Для каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
				СтрокаТаблицы.Обработано = Истина;
			КонецЦикла;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ИмяКомандыОбработчикСобытияВыбор) Тогда
		ВыполнитьКоманду(Команды[ИмяКомандыОбработчикСобытияВыбор]);
	Иначе
		ОткрытьЭлементДанных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Если Не СтрокаТЗ.Обработано Тогда
			СтрокаТЗ.Флаг = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого СтрокаТЗ Из ТаблицаДанных Цикл
		
		Если Не СтрокаТЗ.Обработано Тогда
			СтрокаТЗ.Флаг = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Помощь(Команда)
	
	ТекстовыеСтроки = Новый Массив;
	Для каждого СтрокаТЗ Из ОписанияКоманд Цикл
		Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
			Текст = СтрШаблон(НСтр("ru = '%1 - %2'"),
				СтрокаТЗ.Заголовок, СтрокаТЗ.Подсказка);
			ТекстовыеСтроки.Добавить(Текст);
		Иначе
			Текст = СтрШаблон(НСтр("ru = '<span style=""font: ЖирныйШрифтБЭД"">%1</span> - %2'"),
				СтрокаТЗ.Заголовок, СтрокаТЗ.Подсказка);
			ТекстовыеСтроки.Добавить(Текст);		
		КонецЕсли;
	КонецЦикла;
	ФорматированнаяСтрока = СтроковыеФункцииКлиент.ФорматированнаяСтрока(СтрСоединить(ТекстовыеСтроки, Символы.ПС));
	ПоказатьПредупреждение(, ФорматированнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотреть(Команда)
	
	Если ЗначениеЗаполнено(ИмяКомандыПросмотреть) Тогда
		ВыполнитьКоманду(Команды[ИмяКомандыПросмотреть]);
	Иначе
		ОткрытьЭлементДанных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление() 
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДанных.Обработано");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДанныхФлаг");
	
	//
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.ПоясняющийТекстБЭД);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаДанных.Обработано");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДанныхПредставлениеДанных");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаДанныхСсылка");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопку(ОписаниеКоманды, ДобавлятьВКоманднуюПанель, ИмяКомандыФормы)
	
	Если ДобавлятьВКоманднуюПанель Тогда
		Родитель = Элементы.ТаблицаДанныхКоманднаяПанель;
		СоседнийЭлемент = Элементы.ГруппаВыбрать;
	Иначе
		Родитель = Элементы.ГруппаИсправить;
		СоседнийЭлемент = Неопределено;
	КонецЕсли;
	
	Кнопка = Элементы.Вставить(ИмяКомандыФормы, Тип("КнопкаФормы"), Родитель, СоседнийЭлемент);
	Кнопка.ИмяКоманды = ИмяКомандыФормы;
	Если ДобавлятьВКоманднуюПанель Тогда
		Кнопка.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикКоманды(Команда) 
	
	ВыполнитьКоманду(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЭлементДанных() 
	
	Если Элементы.ТаблицаДанных.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, Элементы.ТаблицаДанных.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

// Возвращаемое значение:
//  Массив Из Произвольный
&НаКлиенте
Функция ОтмеченныеДанные()
	НайденныеСтроки = ТаблицаДанных.НайтиСтроки(Новый Структура("Флаг, Обработано", Истина, Ложь));
	Ссылки = Новый Массив;
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		Ссылки.Добавить(СтрокаДанных.Ссылка);
	КонецЦикла;
	Возврат Ссылки;
КонецФункции

// Возвращаемое значение:
//  Массив Из Произвольный
&НаКлиенте
Функция ВыделенныеДанные()
	Ссылки = Новый Массив;
	Для Каждого Идентификатор Из Элементы.ТаблицаДанных.ВыделенныеСтроки Цикл
		Ссылки.Добавить(ТаблицаДанных.НайтиПоИдентификатору(Идентификатор).Ссылка);
	КонецЦикла;
	Возврат Ссылки;
КонецФункции

// Возвращаемое значение:
//  Массив Из Произвольный
&НаКлиенте
Функция ТекущаяСтрокаДанныхВМассиве()
	Ссылки = Новый Массив;
	ТекущиеДанные = Элементы.ТаблицаДанных.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Ссылки.Добавить(ТекущиеДанные.Ссылка);
	КонецЕсли;
	Возврат Ссылки;
КонецФункции

&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	ОписаниеКоманды = ОписанияКоманд.НайтиСтроки(Новый Структура("ИмяКомандыФормы", Команда.Имя))[0];
	РежимыИспользованияКоманд = ОбработкаНеисправностейБЭДКлиентСервер.РежимыИспользованияКомандФормыИсправленияОшибок();
	
	ДанныеДляВыполненияКоманды = Новый Массив;
	Если ОписаниеКоманды.РежимИспользования = РежимыИспользованияКоманд.ТекущаяСтрока Тогда
		ТекстОшибкиПустыхДанных = НСтр("ru = 'Для выполнения действия необходимо выделить строку'");
		ДанныеДляВыполненияКоманды = ТекущаяСтрокаДанныхВМассиве();
	ИначеЕсли ОписаниеКоманды.РежимИспользования = РежимыИспользованияКоманд.ВыделенныеСтроки Тогда
		ДанныеДляВыполненияКоманды = ВыделенныеДанные();
		ТекстОшибкиПустыхДанных = НСтр("ru = 'Для выполнения действия необходимо выделить строки'");
	ИначеЕсли ОписаниеКоманды.РежимИспользования = РежимыИспользованияКоманд.ОтмеченныеСтроки Тогда
		ДанныеДляВыполненияКоманды = ОтмеченныеДанные();
		ТекстОшибкиПустыхДанных = НСтр("ru = 'Для выполнения действия необходимо отметить нужные строки'");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДанныеДляВыполненияКоманды) Тогда
		Если ЗначениеЗаполнено(ТекстОшибкиПустыхДанных) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиПустыхДанных);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Обработчик = ОписаниеКоманды.Обработчик;
	ОбработкаНеисправностейБЭДКлиент.ВыполнитьОбработчикИсправленияОшибки(Обработчик,
		ДанныеДляВыполненияКоманды, ДополнительныеПараметрыОбработчиков[0].Значение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДанных()
	Данные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Данные", Новый Массив);
	ПараметрыПредставленияДанных = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПараметрыПредставленияДанных");
	Если ПараметрыПредставленияДанных <> Неопределено И ЗначениеЗаполнено(Данные) Тогда
		Если ПараметрыПредставленияДанных.ОбработчикПолученияПредставлений <> Неопределено Тогда
			ПредставленияДанных = ОбработкаНеисправностейБЭД.ПредставлениеДанныхВСписке(
				ПараметрыПредставленияДанных.ОбработчикПолученияПредставлений, Данные);
			Элементы.ТаблицаДанныхСсылка.Видимость = Ложь;
			Элементы.ТаблицаДанныхПредставлениеДанных.Видимость = Истина;
		КонецЕсли;
	Иначе 
		ОбрабатываемыеДанные = Новый Массив;
		ОтмеченныеСтроки = Элементы.ТаблицаДанных.ПолучитьСтрокиДляОбработки();
		Для Каждого ОтмеченнаяСтрока Из ОтмеченныеСтроки Цикл
			ДанныеСтроки = Элементы.ТаблицаДанных.ДанныеСтроки(ОтмеченнаяСтрока);
			Если Не ДанныеСтроки.Обработано Тогда
				ОбрабатываемыеДанные.Добавить(ДанныеСтроки.Ссылка);
			КонецЕсли;
		КонецЦикла;
		Если ОбрабатываемыеДанные.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	Для Каждого ЭлементМассива Из Данные Цикл
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Ссылка = ЭлементМассива;
		Если ПредставленияДанных <> Неопределено И ПредставленияДанных[ЭлементМассива] <> Неопределено Тогда
			НоваяСтрока.Ссылка = ПредставленияДанных[ЭлементМассива].Ссылка;
			НоваяСтрока.ПредставлениеДанных = ПредставленияДанных[ЭлементМассива].Представление;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Параметры:
//  ОписаниеКоманды - См. ОбработкаНеисправностейБЭДКлиент.НовоеОписаниеКомандыФормыИсправленияОшибок
// 
// Возвращаемое значение:
//  КомандаФормы
&НаСервере
Функция ДобавитьКоманду(ОписаниеКоманды)
	РежимыИспользованияКоманд = ОбработкаНеисправностейБЭДКлиентСервер.РежимыИспользованияКомандФормыИсправленияОшибок();
	НовоеОписаниеКоманды = ОписанияКоманд.Добавить();
	ЗаполнитьЗначенияСвойств(НовоеОписаниеКоманды, ОписаниеКоманды);
	Если ОписаниеКоманды.РежимИспользования = РежимыИспользованияКоманд.ОтмеченныеСтроки И Не ДоступнаОтметкаДанных Тогда
		НовоеОписаниеКоманды.РежимИспользования = РежимыИспользованияКоманд.ТекущаяСтрока;
	КонецЕсли;
	НайденоСвободноеИмя = Ложь;
	БазаИмениКоманды = СтрЗаменить(ОписаниеКоманды.Обработчик, ".", "_");
	Счетчик = 0;
	Пока Не НайденоСвободноеИмя Цикл
		Если Счетчик = 9 Тогда
			ИмяКоманды = БазаИмениКоманды;
		Иначе
			ИмяКоманды = СтрШаблон("%1_%2", БазаИмениКоманды, XMLСтрока(Счетчик));
		КонецЕсли;
		НайденоСвободноеИмя = Команды.Найти(ИмяКоманды) = Неопределено;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	НовоеОписаниеКоманды.ИмяКомандыФормы = ИмяКоманды;
	Команда = Команды.Добавить(НовоеОписаниеКоманды.ИмяКомандыФормы);
	Команда.Заголовок = ОписаниеКоманды.Заголовок;
	Команда.Действие = "Подключаемый_ОбработчикКоманды";
	Команда.ИспользуемаяТаблица = Элементы.ТаблицаДанных;
	Команда.ИспользованиеТекущейСтроки = ИспользованиеТекущейСтроки.Использует;
	Возврат Команда;
КонецФункции

// Параметры:
//  ОписаниеКоманды - См. ОбработкаНеисправностейБЭДКлиент.НовоеОписаниеКомандыФормыИсправленияОшибок
// 
// Возвращаемое значение:
//  КомандаФормы
&НаСервере
Функция НайтиДобавитьКоманду(ОписаниеКоманды)
	НайденныеОписания = ОписанияКоманд.НайтиСтроки(ОписаниеКоманды);
	Если Не ЗначениеЗаполнено(НайденныеОписания) Тогда
		Возврат ДобавитьКоманду(ОписаниеКоманды);
	КонецЕсли;
	Возврат Команды[НайденныеОписания[0].ИмяКомандыФормы];
КонецФункции

&НаСервере
Процедура НастроитьЭлементыФормы()
	ПараметрыИсправленияОшибок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ПараметрыИсправленияОшибок");
	Если ПараметрыИсправленияОшибок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыИсправленияОшибок.СкрытьКнопкуПросмотреть Тогда
		Элементы.ТаблицаДанныхПросмотреть.Видимость = Ложь;
	КонецЕсли;
	
	ДоступнаОтметкаДанных = ПараметрыИсправленияОшибок.МножественныйВыбор;
	Если ДоступнаОтметкаДанных Тогда
		Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
			Элементы.ТаблицаДанных.РежимВыделения = РежимВыделенияТаблицы.Множественный;	
		Иначе
			Элементы.ТаблицаДанныхФлаг.Видимость = Истина;
			Элементы.ГруппаВыбрать.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Заголовок = ПараметрыИсправленияОшибок.Заголовок;
	ДополнительныеПараметрыОбработчиков.Добавить(ПараметрыИсправленияОшибок.ДополнительныеПараметрыОбработчиков);
	
	Элементы.ТаблицаДокументовЗаглушка.Видимость = Ложь;
	ОднаКоманда = ПараметрыИсправленияОшибок.Команды.Количество() = 1;
	Элементы.ГруппаИсправить.Видимость = Не ОднаКоманда;
	ЕстьПодсказки = Ложь;
	Для Каждого Команда Из ПараметрыИсправленияОшибок.Команды Цикл
		КомандаФормы = НайтиДобавитьКоманду(Команда);
		ДобавитьКнопку(Команда, ОднаКоманда, КомандаФормы.Имя);
		Если ЗначениеЗаполнено(Команда.Подсказка) Тогда
			ЕстьПодсказки = Истина;
		КонецЕсли;
	КонецЦикла;
	Элементы.ТаблицаДанныхПомощь.Видимость = ЕстьПодсказки;
	
	ОбработчикСобытияВыбор = ПараметрыИсправленияОшибок.ОбработчикСобытияВыбор;
	Если ОбработчикСобытияВыбор <> Неопределено Тогда
		Команда = НайтиДобавитьКоманду(ОбработчикСобытияВыбор);
		ИмяКомандыОбработчикСобытияВыбор = Команда.Имя;
	КонецЕсли;
	
	ОбработчикКомандыПросмотреть = ПараметрыИсправленияОшибок.ОбработчикКомандыПросмотреть;
	Если ОбработчикКомандыПросмотреть <> Неопределено Тогда
		Команда = НайтиДобавитьКоманду(ОбработчикКомандыПросмотреть);
		ИмяКомандыПросмотреть = Команда.Имя;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти