
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДополнитьОписаниеДополнительнойФормыСотрудника(ОписаниеФормы, ИмяОткрываемойФормы, СтандартнаяОбработка) Экспорт
	
	Если ИмяОткрываемойФормы = "ОбщаяФорма.СотрудникиФинансовыйУчет" Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("СотрудникСсылка");
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("ДатаПриема");
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("Заголовок", "Сотрудник.Наименование");
		ОписаниеФормы.ДополнительныеДанные.Вставить("ФинансовыйУчетСотрудников");
		ОписаниеФормы.ДополнительныеДанные.Вставить("ФинансовыйУчетСотрудниковНаборЗаписей");
		ОписаниеФормы.ДополнительныеДанные.Вставить("ФинансовыйУчетСотрудниковНаборЗаписейПрочитан");
		ОписаниеФормы.ДополнительныеДанные.Вставить("ФинансовыйУчетСотрудниковНоваяЗапись");
		ОписаниеФормы.ДополнительныеДанные.Вставить("ФинансовыйУчетСотрудниковПрежняя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ФормаОбъектаУчетаУстановитьВариантНастройки(Форма, ИмяРегистра) Экспорт

	Если Форма[ИмяРегистра + "Распределение"].Количество() > 1 Тогда
		// в настройках указано распределение
		Форма.ФинансовыйУчетВариантНастройки = 2;
	ИначеЕсли Не ЗначениеЗаполнено(Форма[ИмяРегистра].СпособОтражения) Тогда
		// финансовый учет еще не задан
		Форма.ФинансовыйУчетВариантНастройки = 0;
	Иначе
		// задан финансовый учет на конкретную статью и счет
		Форма.ФинансовыйУчетВариантНастройки = 1;
	КонецЕсли;
	// запоминаем вариант настройки при открытии формы
	Форма.ФинансовыйУчетВариантНастройкиПрежняя = Форма.ФинансовыйУчетВариантНастройки;	

КонецПроцедуры

Процедура ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Если Форма.ФинансовыйУчетВариантНастройки = 0 Тогда
		Элементы.ФинансовыйУчетСтраницы.ТекущаяСтраница = Элементы.ФинансовыйУчетПустаяСтраница;
	ИначеЕсли Форма.ФинансовыйУчетВариантНастройки = 1 Тогда
		Элементы.ФинансовыйУчетСтраницы.ТекущаяСтраница = Элементы.ФинансовыйУчетОдноЗначение;
	Иначе
		Элементы.ФинансовыйУчетСтраницы.ТекущаяСтраница = Элементы.ФинансовыйУчетРаспределение;
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПолеСведенияОФинансовомУчетеПериод(Форма, ДатаСеанса, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяОбъектаУчета = "ОбъектФинансовогоУчета") Экспорт

	Если Форма.Элементы.Найти(ИмяРегистра + "ПериодСтрокой") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, ИмяРегистра, Форма[ИмяОбъектаУчета]);
	
	ДатаСоздания = '00010101';
	Если ИмяРегистра = "ФинансовыйУчетСотрудников" Тогда
		ДатаСоздания = Форма.ДатаПриема;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ДатаСоздания") Тогда
		ДатаСоздания = Форма.Объект.ДатаСоздания;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаСоздания) Тогда
		Период = НачалоМесяца(ДатаСоздания);
	Иначе
		Период = НачалоМесяца(ДатаСеанса);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма[ИмяРегистра].СпособОтражения)
		И Не ЗначениеЗаполнено(Форма[ИмяРегистра + "Прежняя"].Период) Тогда
		
		Если ЗначениеЗаполнено(Форма[ИмяРегистра].Период) Тогда
			Форма[ИмяРегистра].Период = '00010101';
		КонецЕсли; 
	Иначе
		Если Не ЗначениеЗаполнено(Форма[ИмяРегистра].Период) Тогда
			Форма[ИмяРегистра].Период = Период;
		КонецЕсли; 
	КонецЕсли;
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма, ИмяРегистра, Форма[ИмяОбъектаУчета]);
	
	Если ЗначениеЗаполнено(Форма[ИмяРегистра].Период) Тогда
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, ИмяРегистра + ".Период", ИмяРегистра + "ПериодСтрокой");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ИмяРегистра + "ПериодСтрокой",
			ЗарплатаКадрыКлиентСервер.ПолучитьПредставлениеМесяца(Период));
	КонецЕсли;
	
КонецПроцедуры

Функция ПредставлениеРаспределенияСтроки(РезультатРаспределения) Экспорт
	
	Если РезультатРаспределения = Неопределено Или РезультатРаспределения.Количество() = 0 Тогда
		Возврат НСтр("ru='Не задано'");
	КонецЕсли;
	
	ТекстРасшифровки = "";
	
	Для каждого СтрокаРаспределения Из РезультатРаспределения Цикл
		
		ПредставлениеСтроки = "";
		
		СпособОтражения = СокрЛП(СтрокаРаспределения.СпособОтражения);
		ПредставлениеСтроки = ПредставлениеСтроки + СпособОтражения + " | ";
		
		ДоляРаспределения = Формат(СтрокаРаспределения.ДоляРаспределения, "ЧЦ=14; ЧДЦ=3");
		ПредставлениеСтроки = ПредставлениеСтроки + ДоляРаспределения;
		
		ТекстРасшифровки = 
		?(ПустаяСтрока(ТекстРасшифровки), "", ТекстРасшифровки + Символы.ПС)
		+ ПредставлениеСтроки;
		
	КонецЦикла;
	
	Возврат ТекстРасшифровки;

КонецФункции

#КонецОбласти