#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Грейды";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Грейды", СтатистикаГрейдов());
	Статистика.Вставить("Грейды позиций", СтатистикаГрейдовПозиций());
	Статистика.Вставить("Грейды сотрудников", СтатистикаГрейдовСотрудников());
	Статистика.Вставить("Оценка позиций штатного расписания по критериям", СтатистикаПозицийШтатногоРасписания());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаГрейдов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Грейды.Ссылка) КАК Грейдов
		|ИЗ
		|	Справочник.Грейды КАК Грейды
		|ГДЕ
		|	Грейды.ВАрхиве = ЛОЖЬ
		|	И Грейды.ПометкаУдаления = ЛОЖЬ";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Грейдов", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Грейдов")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаГрейдовПозиций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрейдыПозиций.Позиция) КАК Позиций
		|ИЗ
		|	РегистрСведений.ГрейдыПозиций КАК ГрейдыПозиций
		|ГДЕ
		|	ГрейдыПозиций.Грейд <> ЗНАЧЕНИЕ(Справочник.Грейды.ПустаяСсылка)";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Позиций с грейдами", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Позиций")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаГрейдовСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрейдыСотрудников.Сотрудник) КАК Сотрудников
		|ИЗ
		|	РегистрСведений.ГрейдыСотрудников КАК ГрейдыСотрудников
		|ГДЕ
		|	ГрейдыСотрудников.Грейд <> ЗНАЧЕНИЕ(Справочник.Грейды.ПустаяСсылка)";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Сотрудников с грейдами", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудников")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПозицийШтатногоРасписания()
	
	Таблица = Метаданные.РегистрыСведений.ОценкаПозицийШтатногоРасписанияПоКритериям;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.Позиция;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Позиций";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.КритерийОценки;
	ДанныеГруппировки.ПредставлениеГруппировки = "Критериев оценки";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти