
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭтоРежимОблачной1СО = ДокументооборотСКОВызовСервера.ЭтоРежимОблачной1СО(); 
	ЭтоИнтерфейс85 = ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85();
	
	Если ЭтоИнтерфейс85 Тогда
		ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.КакНайтиНастройкиПодтверждения_85");
	ИначеЕсли ЭтоРежимОблачной1СО Тогда
		ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.КакНайтиНастройкиПодтвержденияО1СО");
	Иначе
		ОткрытьФорму("Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Форма.КакНайтиНастройкиПодтвержденияБРО");
	КонецЕсли;
	
КонецПроцедуры
