#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Узел) Тогда
		Пользователь = Запись.Узел.Пользователь;
		ПрочитатьПароль();
	КонецЕсли;
	
	Если Параметры.Свойство("Пользователь") Тогда
		Пользователь = Параметры.Пользователь;
		Элементы.Пользователь.Видимость = Ложь;
	КонецЕсли; 
	
	НастроенныеСерверы = Справочники.СерверыMSExchange.НастроенныеСерверыMSExchange();
		
	Если НастроенныеСерверы.Количество() = 1 Тогда
		Запись.СерверMSExchange = НастроенныеСерверы[0];
		Элементы.СерверMSExchange.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Запись"));
	ПроверяемыеРеквизиты.Добавить("Запись.СерверMSExchange");
	ПроверяемыеРеквизиты.Добавить("Запись.ИмяПользователя");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Узел) Тогда
		Возврат;
	КонецЕсли;
	
	ТипСинхронизации = Перечисления.ТипыСинхронизацииКалендарей.MSExchange;
	
	Узел = ПланыОбмена.СинхронизацияКалендарей.СсылкаНовогоУзла(Пользователь, ТипСинхронизации);
	
	ТекущийОбъект.Узел = Узел;
	
	Запись.Узел = Узел;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПароль();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СерверMSExchangeПриИзменении(Элемент)
	ИзменитьИмяПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПользователяПриИзменении(Элемент)
	Пароль = "";
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьПароль()
	
	УстановитьПривилегированныйРежим(Истина);
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Запись.Узел, "Пароль");
	УстановитьПривилегированныйРежим(Ложь);
	Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПароль()
	
	Если ПарольИзменен Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(Запись.Узел, Пароль, "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
		Пароль = ?(ЗначениеЗаполнено(Пароль), ЭтотОбъект.УникальныйИдентификатор, "");
		ПарольИзменен = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьИмяПользователя()
	
	Если ЗначениеЗаполнено(Запись.Узел) И ЗначениеЗаполнено(Запись.СерверMSExchange) Тогда
		Запись.ИмяПользователя = Справочники.СерверыMSExchange.АдресПочтовогоЯщикаПользователя(
			Запись.Узел.Пользователь, Запись.СерверMSExchange);
		Пароль = "";
		ПарольИзменен = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
