#Область ПрограммныйИнтерфейс

// Скачивает контейнер документа из 1С:Архива и сохраняет его на диск.
//
// Параметры:
//  Документ - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - документ.
//
Процедура СкачатьКонтейнерДокумента(Документ) Экспорт
	
	Заголовок = НСтр("ru = 'Выберите каталог для загрузки контейнера'");
	ДополнительныеПараметры = Новый Структура("Документ", Документ);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СкачатьКонтейнерДокументаПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет подключаемую команду интеграции с 1С:Архивом из формы объекта или списка.
//
// Параметры:
//   Команда - КомандаФормы - вызванная команда.
//   Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается команда.
//   Источник - ДанныеФормыСтруктура, ДанныеФормыКоллекция - данные, уточняющие параметр команды.
//
Процедура ВыполнитьПодключаемуюКоманду(Команда, Форма, Источник) Экспорт
	
	Ссылка = Неопределено;
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		Ссылка = Источник.Ссылка;
	Иначе
		Если Источник.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Ссылка = Неопределено;
		Если Не Источник.ТекущиеДанные.Свойство("Ссылка", Ссылка) Тогда
			Ссылка = Источник.ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыИсторияОбмена() Тогда
		ПоказатьИсториюОбмена(Ссылка);
	ИначеЕсли Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыПоказатьВсеДокументыБИА() Тогда
		ПоказатьВсеДокументыБИА(Ссылка);
	ИначеЕсли Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыОтправитьВ1САрхив() Тогда
		ОтправитьВ1САрхив(Ссылка, Форма, Команда);
	ИначеЕсли Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыОтменитьОтправкуВ1САрхив() Тогда
		ОтменитьОтправкуВ1САрхив(Ссылка, Форма, Команда);
	ИначеЕсли Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыОтозватьИз1САрхива() Тогда
		ОтозватьИз1САрхива(Ссылка, Форма, Команда);
	ИначеЕсли СтрНачинаетсяС(Команда.Имя, "СкачатьКонтейнерДокументаИз1САрхива") Тогда
		ДокументБИА = Неопределено;
		ИндексДокументаБИА = Число(СтрЗаменить(Команда.Имя, "СкачатьКонтейнерДокументаИз1САрхива", ""));
		Для Каждого Стр Из Форма.ТаблицаДокументовБИА Цикл
			Если Форма.ТаблицаДокументовБИА.Индекс(Стр) = ИндексДокументаБИА Тогда
				ДокументБИА = Стр.Документ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДокументБИА) Тогда
			СкачатьКонтейнерДокумента(ДокументБИА);
		КонецЕсли;
	ИначеЕсли Команда.Имя = ОбменСАрхивомКлиентСервер.ИмяКомандыЗакрытьИнформационныйБаннер() Тогда
		ЗакрытьИнформационныйБаннер(Ссылка, Форма, Команда);
	КонецЕсли;
	
КонецПроцедуры

// Обрабатывает событие "Нажатие" элемента формы, связанного с интеграцией с 1С:Архивом.
//
// Параметры:
//   Элемент - ПолеФормы - элемент формы.
//   Форма - ФормаКлиентскогоПриложения - форма.
//
Процедура Нажатие(Элемент, Форма) Экспорт
	
	ИмяЭлементаДокументБИА = ОбменСАрхивомКлиентСервер.ИмяЭлементаДокументБИА();
	НайденнаяПозиция = СтрНайти(Элемент.Имя, ИмяЭлементаДокументБИА) > 0;
	Если НайденнаяПозиция = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Индекс = Число(Сред(Элемент.Имя, СтрДлина(ИмяЭлементаДокументБИА) + 1));
	СтрокаДокумента = Форма.ТаблицаДокументовБИА[Индекс];
	ПоказатьЗначение(, СтрокаДокумента.Документ);
	
КонецПроцедуры

Асинх Процедура СкачатьКонтейнерДокументаПослеВыбораКаталога(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПапки = Результат;
	РазделительПути = ПолучитьРазделительПути();
	ИмяПапки = ИмяПапки + ?(Прав(ИмяПапки, 1) = РазделительПути, "", РазделительПути);
	
	Попытка
		ИмяКаталогаТестовое = ИмяПапки + "Test";
		СоздатьКаталогАсинх(ИмяКаталогаТестовое);
		УдалитьФайлыАсинх(ИмяКаталогаТестовое);
	Исключение
		ТекстОшибки = НСтр("ru = 'Недостаточно прав на запись файлов в выбранный каталог'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки;
	
	Состояние(НСтр("ru = 'Загрузка файла...'"));
	
	СведенияОФайле = ОбменСАрхивомВызовСервера.СкачатьКонтейнерДокумента(ДополнительныеПараметры.Документ);
	ПолноеИмяФайла = ИмяПапки + СведенияОФайле.Имя + "." + СведенияОФайле.Расширение;
	
	// Проверка на существование файла с таким именем.
	ДополнительныеПараметры.Вставить("АдресДвоичныхДанных", СведенияОФайле.АдресДвоичныхДанных);
	ДополнительныеПараметры.Вставить("ПолноеИмяФайла", ПолноеИмяФайла);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"СкачатьКонтейнерДокументаПослеВопросаОПерезаписи", ЭтотОбъект, ДополнительныеПараметры);
	НайденныеФайлы = Ждать НайтиФайлыАсинх(ПолноеИмяФайла);
	Если НайденныеФайлы.Количество() > 0 Тогда
		НайденныйФайл = НайденныеФайлы[0];
		ТекстВопроса = СтрШаблон(НСтр("ru = 'В папке назначения уже есть файл ""%1"". Заменить его?'"),
			НайденныйФайл.Имя);
		ВариантыОтвета = Новый СписокЗначений;
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Да);
		ВариантыОтвета.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, ВариантыОтвета,,
			КодВозвратаДиалога.Отмена, НСтр("ru = 'Замена файла'"));
	Иначе
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

Процедура СкачатьКонтейнерДокументаПослеВопросаОПерезаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДополнительныеПараметры.АдресДвоичныхДанных);
	ДвоичныеДанные.Записать(ПолноеИмяФайла);
	УдалитьИзВременногоХранилища(ДополнительныеПараметры.АдресДвоичныхДанных);
	
	Состояние();
	ПоказатьОповещениеПользователя(НСтр("ru = 'Файл сохранен'"),
		"file://" + ПолноеИмяФайла, ПолноеИмяФайла);
	
КонецПроцедуры	

Процедура ОтправитьВ1САрхив(Ссылка, Форма, Команда) Экспорт
	
	Если Форма.Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Документ должен быть записан'"));
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Будут подготовлены данные для выгрузки документа в 1С:Архив. Документ станет недоступным для редактирования. Продолжить?'");
	ЗаголовокВопроса = НСтр("ru = 'Выгрузка в 1С:Архив'");
	ДополнительныеПараметры = Новый Структура("Ссылка, Форма, Команда", Ссылка, Форма, Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПродолжитьВыполнениеКомандыПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,
		КодВозвратаДиалога.Нет, ЗаголовокВопроса);
	
КонецПроцедуры

Процедура ОтменитьОтправкуВ1САрхив(Ссылка, Форма, Команда) Экспорт
	
	Если Форма.Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Документ должен быть записан'"));
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Подготовленные данные для выгрузки в 1С:Архив будут удалены. Продолжить?'");
	ЗаголовокВопроса = НСтр("ru = 'Отмена выгрузки в 1С:Архив'");
	ДополнительныеПараметры = Новый Структура("Ссылка, Форма, Команда", Ссылка, Форма, Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПродолжитьВыполнениеКомандыПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,
		КодВозвратаДиалога.Нет, ЗаголовокВопроса);
	
КонецПроцедуры

Процедура ОтозватьИз1САрхива(Ссылка, Форма, Команда) Экспорт
	
	Если Форма.Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Документ должен быть записан'"));
		Возврат;
	КонецЕсли;
	
	ДанныеДляОтзыва = ОбменСАрхивомВызовСервера.ДанныеОДокументеДляОтзыва(Ссылка);
	СтатусПринят = ПредопределенноеЗначение("Перечисление.СтатусыОбменаС1САрхивом.ПринятВАрхив");
	ВысотаТекста = 11;
	Если ДанныеДляОтзыва.СтатусОбмена = СтатусПринят Тогда
		ТекстВопроса = НСтр("ru = 'Документ передан в 1С:Архив.
			|
			|• Перед выполнением отзыва рекомендуется скачать файлы из 1С:Архива
			|
			|• После отзыва нужно самостоятельно восстановить все данные, которые были удалены после передачи объекта в 1С:Архив
			|
			|• В базе 1С:Архива необходимо вручную выполнить команду отзыва документов, созданных на основании текущего объекта
			|
			|Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru = 'Документ отправлен в 1С:Архив.
			|После выполнении операции отправка будет отменена.
			|
			|В базе 1С:Архива необходимо будет вручную выполнить команду отзыва документов, созданных на основании текущего объекта.
			|
			|Продолжить операцию?'");
		ВысотаТекста = 6;
	КонецЕсли;
	
	ЗаголовокВопроса = НСтр("ru = 'Отзыв документа из 1С:Архива'");
	ДополнительныеПараметры = Новый Структура("Ссылка, Форма, Команда", Ссылка, Форма, Команда);
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПродолжитьВыполнениеКомандыПослеПодтверждения", ЭтотОбъект, ДополнительныеПараметры);
	
	ВариантыОтвета = Новый СписокЗначений;
	ВариантыОтвета.Добавить("Да", НСтр("ru = 'Продолжить'"));
	ВариантыОтвета.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокВопроса);
	ПараметрыФормы.Вставить("ТекстВопроса", ТекстВопроса);
	ПараметрыФормы.Вставить("СписокДоступныхВариантов", ВариантыОтвета);
	ПараметрыФормы.Вставить("ВариантОтветаПоУмолчанию", "Отмена");
	ПараметрыФормы.Вставить("ЗадержкаВремени", Новый Структура("Да", 9));
	ПараметрыФормы.Вставить("ВысотаТекста", ВысотаТекста);
	
	ОткрытьФорму("ОбщаяФорма.РасширенныйВопросБИА", ПараметрыФормы,,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтверждения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> "Да" И Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Истина;
	ОбменСАрхивомКлиентПереопределяемый.ПродолжитьВыполнениеКомандыПослеПодтверждения(
		ДополнительныеПараметры, СтандартнаяОбработка);
	Если СтандартнаяОбработка = Ложь Тогда
		ОповеститьОбИзменении(ДополнительныеПараметры.Ссылка);
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ДополнительныеПараметры.Удалить("Форма");
	Если ДополнительныеПараметры.Свойство("Команда") Тогда
		ДополнительныеПараметры.Вставить("ИмяКоманды", ДополнительныеПараметры.Команда.Имя);
		ДополнительныеПараметры.Удалить("Команда");
	КонецЕсли;
	Форма.Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(ДополнительныеПараметры);
	ОповеститьОбИзменении(ДополнительныеПараметры.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоказатьИсториюОбмена(Ссылка)
	
	ОбъектыИстории = ОбменСАрхивомВызовСервера.ОбъектыИсторииОбменаПоОбъекту(Ссылка);
	СписокОбъектов = Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ОбъектыИстории);
	ПараметрыФормыИстории = Новый Структура("ОбъектОбмена", СписокОбъектов);
	ОткрытьФорму("РегистрСведений.ИсторияОбменаС1САрхивом.ФормаСписка", ПараметрыФормыИстории, ЭтотОбъект);
	
КонецПроцедуры

Процедура ПоказатьВсеДокументыБИА(Ссылка)
	
	ОткрытьФорму("Справочник.ДокументыБИА.Форма.СписокДокументовПоОснованию",
		Новый Структура("Основание", Ссылка));
	
КонецПроцедуры

Процедура ЗакрытьИнформационныйБаннер(Ссылка, Форма, Команда) Экспорт
	
	ИмяГруппы = "ГруппаОбменС1САрхивом";
	ГруппаОбменС1САрхивом = Форма.Элементы.Найти(ИмяГруппы);
	Если ГруппаОбменС1САрхивом <> Неопределено Тогда
		ГруппаОбменС1САрхивом.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
