#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЗависимыеДанные;
Перем ДанныеРегистрации;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Параметры = СинхронизацияДанныхЗарплатаКадрыСервер.ПараметрыПриПолученииДанных();
	Параметры.ПланОбменаОбъект = ЭтотОбъект;
	Параметры.ЭлементДанных = ЭлементДанных;
	Параметры.ПолучениеЭлемента = ПолучениеЭлемента;
	Параметры.ОтправкаНазад = ОтправкаНазад;
	Параметры.ЗависимыеДанные = ЗависимыеДанные;
	Параметры.ДанныеРегистрации = ДанныеРегистрации;
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ПриПолученииДанныхОтПодчиненного(Параметры);
	
	ЗависимыеДанные = Параметры.ЗависимыеДанные;
	ДанныеРегистрации = Параметры.ДанныеРегистрации;
	ПолучениеЭлемента = Параметры.ПолучениеЭлемента;
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	
	Параметры = СинхронизацияДанныхЗарплатаКадрыСервер.ПараметрыПриПолученииДанных();
	Параметры.ПланОбменаОбъект = ЭтотОбъект;
	Параметры.ЭлементДанных = ЭлементДанных;
	Параметры.ПолучениеЭлемента = ПолучениеЭлемента;
	Параметры.ОтправкаНазад = ОтправкаНазад;
	Параметры.ЗависимыеДанные = ЗависимыеДанные;
	Параметры.ДанныеРегистрации = ДанныеРегистрации;
	
	СинхронизацияДанныхЗарплатаКадрыСервер.ПриПолученииДанныхОтГлавного(Параметры);
	
	ЗависимыеДанные = Параметры.ЗависимыеДанные;
	ДанныеРегистрации = Параметры.ДанныеРегистрации;
	ПолучениеЭлемента = Параметры.ПолучениеЭлемента;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	// Проверка значения свойства ОбменДанными.Загрузка отсутствует по причине того, что в расположенным ниже коде,
	// реализована логика, которая должна выполняться в том числе при установке этого свойства равным Истина
	// (на стороне кода, который выполняет попытку записи в данный план обмена).
	
	// Для плана обмена используется безопасное хранилище,
	// поэтому при удалении узла обмена необходимо также удалять соответствующую запись из хранилища
	// (в соответствии с документацией по подсистеме базовой функциональности).
	
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Если НЕ ИспользоватьОтборПоОрганизациям И Организации.Количество() <> 0 Тогда
			Организации.Очистить();
		ИначеЕсли Организации.Количество() = 0 И ИспользоватьОтборПоОрганизациям Тогда
			ИспользоватьОтборПоОрганизациям = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЭтотУзел Тогда
		
		Если ОбменДаннымиСервер.НадоВыполнитьОбработчикПослеЗагрузкиДанных(ЭтотОбъект, Ссылка) Тогда
			СинхронизацияДанныхЗарплатаКадрыСервер.ПослеЗагрузкиДанных(ЭтотОбъект, ЗависимыеДанные, ДанныеРегистрации);
		КонецЕсли;
		
	КонецЕсли;
	
	СинхронизацияДанныхЗарплатаКадрыСервер.УзелПланаОбменаРаспределеннойБазыПередЗаписью(ЭтотОбъект);
	
	// Выполняется после, т.к. АРМ записывается ОбменДанными.Загрузка = Истина
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ИспользоватьОтборПоОрганизациям И СинхронизироватьДанныеПоОрганизациям
		И Не ДополнительныеСвойства.ИспользуетсяОтборПоОрганизациям
		И Не СинхронизацияДанныхЗарплатаКадрыСервер.ОрганизацииФизическихЛицЗаполняются()
		И Не СинхронизацияДанныхЗарплатаКадрыСервер.ОрганизацииСотрудниковЗаполняются() Тогда
		
		ДополнительныеСвойства.Вставить("ЗарегистрироватьУтраченныхФизическихЛицОрганизаций", Истина);
		ДополнительныеСвойства.Вставить("ЗарегистрироватьПринадлежностьФизическихЛицОрганизаций", Истина);
		
		ДополнительныеСвойства.Вставить("ЗарегистрироватьУтраченныеОрганизацииСотрудников", Истина);
		ДополнительныеСвойства.Вставить("ЗарегистрироватьОрганизацииСотрудников", Истина);
		
	КонецЕсли;
	
	Если ИспользоватьОтборПоПодразделениям И СинхронизироватьДанныеПоПодразделениям
		И Не ДополнительныеСвойства.ИспользуетсяОтборПоПодразделениям
		И Не СинхронизацияДанныхЗарплатаКадрыСервер.ПодразделенияФизическихЛицЗаполняются()
		И Не СинхронизацияДанныхЗарплатаКадрыСервер.ПодразделенияСотрудниковЗаполняются() Тогда
		
		ДополнительныеСвойства.Вставить("ЗарегистрироватьУтраченныхФизическихЛицПодразделений", Истина);
		ДополнительныеСвойства.Вставить("ЗарегистрироватьПринадлежностьФизическихЛицПодразделений", Истина);
		
		ДополнительныеСвойства.Вставить("ЗарегистрироватьУтраченныеПодразделенияСотрудников", Истина);
		ДополнительныеСвойства.Вставить("ЗарегистрироватьПодразделенияСотрудников", Истина);
		
	КонецЕсли;
	
	СинхронизацияДанныхЗарплатаКадрыСервер.УзелПланаОбменаРаспределеннойБазыПриЗаписи(ЭтотОбъект);
	
	Если ДополнительныеСвойства.Свойство("ЗаписьИзФормы") И ДополнительныеСвойства.ЗаписьИзФормы Тогда
		// На форме обработчики запускаются в ПослеЗаписиНаСервере
	Иначе
		СинхронизацияДанныхЗарплатаКадры.ЗапуститьОтложеннуюОбработкуЗаполненияДанныхПоФизическимЛицам(ЭтотОбъект, Ложь);
		СинхронизацияДанныхЗарплатаКадры.ЗапуститьОтложеннуюОбработкуЗаполненияДанныхПоСотрудникам(ЭтотОбъект, Ложь);
	КонецЕсли;
	
	// /Выполняется после, т.к. АРМ записывается ОбменДанными.Загрузка = Истина
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет табличную часть РазделыДанных в соответствии с настройками узла.
Процедура ЗаполнитьТабличнуюЧастьРазделыДанных() Экспорт
	
	ИдентификаторыРазделовДанных = СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных();
	РазделыДанных.Очистить();
	НоваяСтрока = РазделыДанных.Добавить();
	НоваяСтрока.Идентификатор = ИдентификаторыРазделовДанных.ОбщиеДанные;
	Если СинхронизироватьДанныеПоОрганизациям Тогда
		НоваяСтрока = РазделыДанных.Добавить();
		НоваяСтрока.Идентификатор = ИдентификаторыРазделовДанных.РегламентированныеДанные;
	КонецЕсли;
	Если СинхронизироватьДанныеПоПодразделениям Тогда
		УправленческиеРазделыДанных =
			СинхронизацияДанныхЗарплатаКадрыСервер.РазделыДанных("УправленческиеДанные").ВыгрузитьКолонку(
			"Идентификатор");
		НоваяСтрока = РазделыДанных.Добавить();
		НоваяСтрока.Идентификатор = ИдентификаторыРазделовДанных.УправленческиеДанные;
		Для Каждого РазделДанных Из УправленческиеРазделыДанных Цикл
			НоваяСтрока = РазделыДанных.Добавить();
			НоваяСтрока.Идентификатор = РазделДанных;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ЗависимыеДанные = Неопределено;
ДанныеРегистрации = Неопределено;

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли