
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Роль = Параметры.РольИсполнителя;
	
	УстановитьТипыОбъектовАдресации();
	УстановитьСостояниеЭлементов();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗаданыТипыОсновногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации И ЗначениеЗаполнено(ТипыОсновногоОбъектаАдресации);
	ЗаданыТипыДополнительногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации И ЗначениеЗаполнено(ТипыДополнительногоОбъектаАдресации);
	
	Если ЗаданыТипыОсновногоОбъектаАдресации
		И СпособОпределенияОсновногоОбъектаАдерсации = 1
		И ПустаяСтрока(ИмяРеквизитаОсновногоОбъектаАдресации) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Поле ""Реквизит документа для основного объекта адресации"" не заполнено'"),,,
			"ИмяРеквизитаОсновногоОбъектаАдресации", Отказ);
		
	КонецЕсли;
	
	Если ЗаданыТипыДополнительногоОбъектаАдресации
		И СпособОпределенияДополнительногоОбъектаАдерсации = 1
		И ПустаяСтрока(ИмяРеквизитаДополнительногоОбъектаАдресации) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Поле ""Реквизит документа для дополнительного объекта адресации"" не заполнено'"),,,
			"ИмяРеквизитаДополнительногоОбъектаАдресации", Отказ);
		
	КонецЕсли;
	
	// При адресации по реквизиту табличной части документа, табличные части основного и дополнительного объекта адресации должны совпадать
	Если Параметры.ВыбиратьОбъектыАдресацииИзТабличнойЧасти
		И ЗаданыТипыОсновногоОбъектаАдресации
		И ЗаданыТипыДополнительногоОбъектаАдресации
		И СпособОпределенияОсновногоОбъектаАдерсации = 1
		И СпособОпределенияДополнительногоОбъектаАдерсации = 1
		И Лев(ИмяРеквизитаОсновногоОбъектаАдресации, 1) <> "*"
		И Лев(ИмяРеквизитаДополнительногоОбъектаАдресации, 1) <> "*"
		И СтрРазделить(ИмяРеквизитаОсновногоОбъектаАдресации, ".").Количество() = 2
		И СтрРазделить(ИмяРеквизитаДополнительногоОбъектаАдресации, ".").Количество() = 2 Тогда
		
		ТабличныеЧастиДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИдентификаторДокумента).ТабличныеЧасти;
		
		ТЧРеквизитаООА = СтрРазделить(ИмяРеквизитаОсновногоОбъектаАдресации, ".")[0];
		ТЧРеквизитаДОА = СтрРазделить(ИмяРеквизитаДополнительногоОбъектаАдресации, ".")[0];
		
		Если ТабличныеЧастиДокумента.Найти(ТЧРеквизитаООА) <> Неопределено
			И ТабличныеЧастиДокумента.Найти(ТЧРеквизитаДОА) <> Неопределено
			И ТЧРеквизитаООА <> ТЧРеквизитаДОА Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'При адресации по реквизитам табличных частей документа эти табличные части должны совпадать'"),,,
				"ИмяРеквизитаОсновногоОбъектаАдресации", Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользуетсяБезОбъектовАдресации Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаданыТипыОсновногоОбъектаАдресации
		И СпособОпределенияОсновногоОбъектаАдерсации = 0
		И НЕ ЗначениеЗаполнено(ОсновнойОбъектАдресации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено'"), Роль.ТипыОсновногоОбъектаАдресации.Наименование ),,,
			"ОсновнойОбъектАдресации", Отказ);
	ИначеЕсли ЗаданыТипыДополнительногоОбъектаАдресации
		И СпособОпределенияДополнительногоОбъектаАдерсации = 0
		И НЕ ЗначениеЗаполнено(ДополнительныйОбъектАдресации) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено'"), Роль.ТипыДополнительногоОбъектаАдресации.Наименование ),,, 
			"ДополнительныйОбъектАдресации", Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособОпределенияОсновногоОбъектаАдерсацииПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияДополнительногоОбъектаАдерсацииПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура OKВыполнить()
	
	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = ПараметрыЗакрытия();
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьТипыОбъектовАдресации()
	
	ТипыОсновногоОбъектаАдресации = Роль.ТипыОсновногоОбъектаАдресации.ТипЗначения;
	ТипыДополнительногоОбъектаАдресации = Роль.ТипыДополнительногоОбъектаАдресации.ТипЗначения;
	ИспользуетсяСОбъектамиАдресации = Роль.ИспользуетсяСОбъектамиАдресации;
	ИспользуетсяБезОбъектовАдресации = Роль.ИспользуетсяБезОбъектовАдресации;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеЭлементов()

	ЗаданыТипыОсновногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации
		И ЗначениеЗаполнено(ТипыОсновногоОбъектаАдресации);
	ЗаданыТипыДополнительногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации 
		И ЗначениеЗаполнено(ТипыДополнительногоОбъектаАдресации);
		
	ВозможнаАдресацияПоИменамРеквизитовДокумента = ЗначениеЗаполнено(Параметры.ИдентификаторДокумента);
	
	Элементы.СпособОпределенияОсновногоОбъектаАдерсации.Заголовок =
		НСтр("ru='Основной объект адресации'")
		+ ?(ЗаданыТипыОсновногоОбъектаАдресации," """+Роль.ТипыОсновногоОбъектаАдресации.Наименование+"""","")
		+ НСтр("ru=' определяется'");
	Элементы.СпособОпределенияОсновногоОбъектаАдерсации.Видимость = ЗаданыТипыОсновногоОбъектаАдресации ИЛИ Параметры.ОбязательнаяАдресацияПоИменамРеквизитов;
	
	Элементы.ОсновнойОбъектАдресации.Видимость = ЗаданыТипыОсновногоОбъектаАдресации;
	Элементы.ОсновнойОбъектАдресации.ОграничениеТипа = ТипыОсновногоОбъектаАдресации;
	
	Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.Видимость = ЗаданыТипыОсновногоОбъектаАдресации ИЛИ Параметры.ОбязательнаяАдресацияПоИменамРеквизитов;
	
	Элементы.СпособОпределенияДополнительногоОбъектаАдерсации.Заголовок =
		НСтр("ru='Дополнительный объект адресации'")
		+ ?(ЗаданыТипыДополнительногоОбъектаАдресации," """+Роль.ТипыДополнительногоОбъектаАдресации.Наименование+"""","")
		+ НСтр("ru=' определяется'");
	Элементы.СпособОпределенияДополнительногоОбъектаАдерсации.Видимость = ЗаданыТипыДополнительногоОбъектаАдресации ИЛИ Параметры.ОбязательнаяАдресацияПоИменамРеквизитов;
	
	Элементы.ДополнительныйОбъектАдресации.Видимость = ЗаданыТипыДополнительногоОбъектаАдресации;
	Элементы.ДополнительныйОбъектАдресации.ОграничениеТипа = ТипыДополнительногоОбъектаАдресации;
	
	Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.Видимость = ЗаданыТипыДополнительногоОбъектаАдресации ИЛИ Параметры.ОбязательнаяАдресацияПоИменамРеквизитов;
	
	Если ВозможнаАдресацияПоИменамРеквизитовДокумента
		И (ЗаданыТипыОсновногоОбъектаАдресации
			ИЛИ ЗаданыТипыДополнительногоОбъектаАдресации
			ИЛИ Параметры.ОбязательнаяАдресацияПоИменамРеквизитов) Тогда
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИдентификаторДокумента);
		Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
			
			Если ЗаданыТипыОсновногоОбъектаАдресации Тогда
				
				ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора,
					ТипыОсновногоОбъектаАдресации, Реквизит, , , 1);
				
			ИначеЕсли Параметры.ОбязательнаяАдресацияПоИменамРеквизитов Тогда
				Если ПустаяСтрока(Реквизит.Синоним) Тогда
					Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Имя);
				Иначе
					Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗаданыТипыДополнительногоОбъектаАдресации Тогда
				
				ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора,
					ТипыДополнительногоОбъектаАдресации, Реквизит, , , 1);
					
			ИначеЕсли Параметры.ОбязательнаяАдресацияПоИменамРеквизитов Тогда
				Если ПустаяСтрока(Реквизит.Синоним) Тогда
					Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Имя);
				Иначе
					Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Параметры.ВыбиратьОбъектыАдресацииИзТабличнойЧасти Тогда
			
			Для Каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
				
				ПредставлениеТЧ = ?(ПустаяСтрока(ТабличнаяЧасть.Синоним), ТабличнаяЧасть.Имя, ТабличнаяЧасть.Синоним);
				
				Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
					
					Если ЗаданыТипыОсновногоОбъектаАдресации Тогда
						
						ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора,
							ТипыОсновногоОбъектаАдресации, Реквизит, ТабличнаяЧасть.Имя, ПредставлениеТЧ, 1);
						
					ИначеЕсли Параметры.ОбязательнаяАдресацияПоИменамРеквизитов Тогда
						Если ПустаяСтрока(Реквизит.Синоним) Тогда
							Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Имя);
						Иначе
							Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
						КонецЕсли;
					КонецЕсли;
					
					Если ЗаданыТипыДополнительногоОбъектаАдресации Тогда
						
						ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора,
							ТипыДополнительногоОбъектаАдресации, Реквизит, ТабличнаяЧасть.Имя, ПредставлениеТЧ, 1);
						
					ИначеЕсли Параметры.ОбязательнаяАдресацияПоИменамРеквизитов Тогда
						Если ПустаяСтрока(Реквизит.Синоним) Тогда
							Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Имя);
						Иначе
							Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		// Дополнительные реквизиты
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
			МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
			ВладелецСвойств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ИдентификаторДокумента, "ЗначениеПустойСсылки");
			Если МодульУправлениеСвойствами.ИспользоватьДопРеквизиты(ВладелецСвойств) Тогда
				ДополнительныеРеквизиты = МодульУправлениеСвойствами.СвойстваОбъекта(ВладелецСвойств, Истина, Ложь);
				Для Каждого Реквизит Из ДополнительныеРеквизиты Цикл
					Если ЗаданыТипыОсновногоОбъектаАдресации Тогда
						Для Каждого ТипОсновногоОбъектаАдресации Из ТипыОсновногоОбъектаАдресации.Типы() Цикл
							Если Реквизит.ТипЗначения.СодержитТип(ТипОсновногоОбъектаАдресации) Тогда
								Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Добавить(
									"*"+Реквизит.ИдентификаторДляФормул, Реквизит.Заголовок + НСтр("ru = ' (доп. реквизит)'"));
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если ЗаданыТипыДополнительногоОбъектаАдресации Тогда
						Для Каждого ТипДополнительногоОбъектаАдресации Из ТипыДополнительногоОбъектаАдресации.Типы() Цикл
							Если Реквизит.ТипЗначения.СодержитТип(ТипДополнительногоОбъектаАдресации) Тогда
								Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Добавить(
									"*"+Реквизит.ИдентификаторДляФормул, Реквизит.Заголовок + НСтр("ru = ' (доп. реквизит)'"));
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		Элементы.СпособОпределенияОсновногоОбъектаАдерсации.Видимость = Ложь;
		Элементы.СпособОпределенияДополнительногоОбъектаАдерсации.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ВозможнаАдресацияПоИменамРеквизитовДокумента
		И Параметры.ОбязательнаяАдресацияПоИменамРеквизитов
		И НЕ ЗаданыТипыОсновногоОбъектаАдресации Тогда
		СпособОпределенияОсновногоОбъектаАдерсации = 1;
		Элементы.СпособОпределенияОсновногоОбъектаАдерсации.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если ВозможнаАдресацияПоИменамРеквизитовДокумента
		И Параметры.ОбязательнаяАдресацияПоИменамРеквизитов
		И НЕ ЗаданыТипыДополнительногоОбъектаАдресации Тогда
		СпособОпределенияДополнительногоОбъектаАдерсации = 1;
		Элементы.СпособОпределенияДополнительногоОбъектаАдерсации.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(СписокВыбора, ПодходящиеТипы, Реквизит,
	ПрефиксИмени = "", ПрефиксПредставления = "", ГлубинаПоиска = 0)
	
	ПрефиксИмениСТочкой = ?(ПустаяСтрока(ПрефиксИмени), "", ПрефиксИмени + ".");
	ПрефиксПредставленияСТочкой = ?(ПустаяСтрока(ПрефиксПредставления), "", ПрефиксПредставления + ".");
	
	Для Каждого ПодходящийТип Из ПодходящиеТипы.Типы() Цикл
		Если Реквизит.Тип.СодержитТип(ПодходящийТип) Тогда
			ПредставлениеРеквизита = ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
			СписокВыбора.Добавить(ПрефиксИмениСТочкой + Реквизит.Имя, ПрефиксПредставленияСТочкой + ПредставлениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Если ГлубинаПоиска = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеРеквизита = ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);
	
	Для Каждого ТипРеквизита Из Реквизит.Тип.Типы() Цикл
		Если НЕ ОбщегоНазначения.ЭтоСсылка(ТипРеквизита)
			ИЛИ НЕ ОбщегоНазначения.ВидОбъектаПоТипу(ТипРеквизита) = "Справочник" Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторОбъектаМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипРеквизита);
		МетаданныеРеквизита = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъектаМетаданных);
		Для Каждого РеквизитРеквизита Из МетаданныеРеквизита.Реквизиты Цикл
			
			ДополнитьСписокВыбораПодходящимиПоТипуИменамиРеквизитов(СписокВыбора, ПодходящиеТипы, РеквизитРеквизита,
				ПрефиксИмениСТочкой + Реквизит.Имя, ПрефиксПредставленияСТочкой + ПредставлениеРеквизита, ГлубинаПоиска - 1);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ЗаданыТипыОсновногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации
		И ЗначениеЗаполнено(ТипыОсновногоОбъектаАдресации);
	ЗаданыТипыДополнительногоОбъектаАдресации = ИспользуетсяСОбъектамиАдресации 
		И ЗначениеЗаполнено(ТипыДополнительногоОбъектаАдресации);
		
	Если ЗаданыТипыОсновногоОбъектаАдресации Тогда
		Элементы.ОсновнойОбъектАдресации.Видимость = СпособОпределенияОсновногоОбъектаАдерсации = 0;
		Элементы.ОсновнойОбъектАдресации.АвтоОтметкаНезаполненного = СпособОпределенияОсновногоОбъектаАдерсации = 0 И НЕ ИспользуетсяБезОбъектовАдресации;
		Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.Видимость = СпособОпределенияОсновногоОбъектаАдерсации = 1;
		Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.АвтоОтметкаНезаполненного = СпособОпределенияОсновногоОбъектаАдерсации = 1;
		Если СпособОпределенияОсновногоОбъектаАдерсации = 1 И Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора.Количество() = 1 Тогда
			ИмяРеквизитаОсновногоОбъектаАдресации = Элементы.ИмяРеквизитаОсновногоОбъектаАдресации.СписокВыбора[0].Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаданыТипыДополнительногоОбъектаАдресации Тогда
		Элементы.ДополнительныйОбъектАдресации.Видимость = СпособОпределенияДополнительногоОбъектаАдерсации = 0;
		Элементы.ДополнительныйОбъектАдресации.АвтоОтметкаНезаполненного = СпособОпределенияДополнительногоОбъектаАдерсации = 0 И НЕ ИспользуетсяБезОбъектовАдресации;
		Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.Видимость = СпособОпределенияДополнительногоОбъектаАдерсации = 1;
		Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.АвтоОтметкаНезаполненного = СпособОпределенияДополнительногоОбъектаАдерсации = 1;
		Если СпособОпределенияДополнительногоОбъектаАдерсации = 1 И Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора.Количество() = 1 Тогда
			ИмяРеквизитаДополнительногоОбъектаАдресации = Элементы.ИмяРеквизитаДополнительногоОбъектаАдресации.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗакрытия()
	
	Результат = Новый Структура;
	Результат.Вставить("РольИсполнителя", Роль);
	Результат.Вставить("ОсновнойОбъектАдресации", ОсновнойОбъектАдресации);
	Результат.Вставить("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	Результат.Вставить("ИмяРеквизитаОсновногоОбъектаАдресации", ИмяРеквизитаОсновногоОбъектаАдресации);
	Результат.Вставить("ИмяРеквизитаДополнительногоОбъектаАдресации", ИмяРеквизитаДополнительногоОбъектаАдресации);
	
	Если Результат.ОсновнойОбъектАдресации <> Неопределено И Результат.ОсновнойОбъектАдресации.Пустая() Тогда
		Результат.ОсновнойОбъектАдресации = Неопределено;
	КонецЕсли;
	
	Если Результат.ДополнительныйОбъектАдресации <> Неопределено И Результат.ДополнительныйОбъектАдресации.Пустая() Тогда
		Результат.ДополнительныйОбъектАдресации = Неопределено;
	КонецЕсли;
	
	Если СпособОпределенияОсновногоОбъектаАдерсации = 0 И НЕ ПустаяСтрока(ИмяРеквизитаОсновногоОбъектаАдресации) Тогда
		Результат.ИмяРеквизитаОсновногоОбъектаАдресации = "";
	КонецЕсли;
	
	Если СпособОпределенияДополнительногоОбъектаАдерсации = 0 И НЕ ПустаяСтрока(ИмяРеквизитаДополнительногоОбъектаАдресации) Тогда
		Результат.ИмяРеквизитаДополнительногоОбъектаАдресации = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
