#Область ПрограммныйИнтерфейс

// Вызывается при записи нового электронного курса в режиме редактирования.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - новый электронный курс.
//   КонтекстРедактирования - Произвольный - произвольные данные, переданные из внешней подсистемы
//                            в метод ИзучениеЭлектронныхКурсовКлиент.СоздатьЭлектронныйКурс.
//
Процедура ПриЗаписиНовогоЭлектронногоКурса(Знач ЭлектронныйКурс, Знач КонтекстРедактирования) Экспорт	
	
	
КонецПроцедуры

// Вызывается при окончании редактирования электронного курса,
// если пользователь не отказался от публикации изменений.
// Так же это событие вызывается при окончании копирования
// нередактируемых курсов SCORM.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Отредактированный электронный курс.
//   КонтекстРедактирования - Произвольный - произвольные данные, переданные из внешней подсистемы.
//
Процедура ПриОкончанииРедактированияЭлектронногоКурса(Знач ЭлектронныйКурс, Знач КонтекстРедактирования) Экспорт	
	
КонецПроцедуры

// Обработчик вызывается после загрузки курсов в базу.
//
// Параметры:
//   МассивЗагруженныхКурсов - Массив - массив ссылок типа СправочникСсылка.ЭлектронныеКурсы.
//
Процедура ПослеЗагрузкиЭлектронногоКурсаВБазу(Знач МассивЗагруженныхКурсов) Экспорт	
			
КонецПроцедуры

// Определяет доступные для создания типы электронных курсов.
// Вызывается при открытии формы списка электронных курсов.
//
// Параметры:
//   ТипыЭлектронныхКурсов - Массив - массив доступных типов курсов ПеречислениеСсылка.ТипыЭлектронныхКурсов.
//   СтандартнаяОбработка - Булево - при значении Истина можно определить свой набор типов курсов.
//
Процедура ПриОпределенииВариантаИнтерфейса(ТипыЭлектронныхКурсов, СтандартнаяОбработка) Экспорт
		
КонецПроцедуры

// Вызывается при установке или снятии пометки удаления курса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - курс, который удаляется или снимается с удаления.
//   ПометкаУдаления - Булево - пометка удаления.
//   КонтекстРедактирования - Произвольный - произвольные данные, переданные из внешней подсистемы.
//
Процедура ПриУстановкеСнятииПометкиУдаленияЭлектронногоКурса(Знач ЭлектронныйКурс, Знач ПометкаУдаления, Знач КонтекстРедактирования) Экспорт
			
КонецПроцедуры

// Вызывается при копировании электронного курса.
//
// Параметры:
//   НовыйЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - курс, созданный копированием.
//   СтарыйЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - скопированный курс.
//
Процедура ПриКопированииЭлектронногоКурса(Знач НовыйЭлектронныйКурс, Знач СтарыйЭлектронныйКурс) Экспорт	
	 	
КонецПроцедуры

// Вызывается при записи любого элемента курса, включая сам курс.
// Так как процедура вызывается при записи любого элемента курса,
// то следует внимательно относиться к вопросам производительности.
//
// Параметры:
//   СсылкаНаЭлемент - ЛюбаяСсылка - ссылка на элемент электронного курса.
//   КонтекстРедактирования - Произвольный - произвольные данные, переданные из внешней подсистемы.
//
Процедура ПриЗаписиЭлементаЭлектронногоКурса(Знач СсылкаНаЭлемент, Знач КонтекстРедактирования) Экспорт
	
		
	
КонецПроцедуры

// Определяет список доступных типов вопросов.
// Например:
//	СтандартнаяОбработка = Ложь;
//	ТипыТестовыхВопросов = Перечисления.ТипыТестовыхВопросов.ВсеТипы();
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - курс, в котором выполняется редактирование вопроса.
//   КонтекстРедактирования - Произвольный - произвольные данные, переданные из внешней подсистемы.
//   ТипыТестовыхВопросов - Массив - массив доступных типов вопросов ПеречислениеСсылка.ТипыТестовыхВопросов.
//   СтандартнаяОбработка - Булево - при значении Истина можно определить свой набор типов.
//
Процедура ПриОпределенииТиповТестовыхВопросов(ЭлектронныйКурс, КонтекстРедактирования, ТипыТестовыхВопросов, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти