#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда 
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Задолженности.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ПлановоеПогашениеЗадолженностиСотрудников;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗадолженностиСотрудников(Регистратор, Организация, ДатаАктуальности, Сотрудники = Неопределено, Автозаполнение = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Регистратор",		Регистратор);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	Запрос.УстановитьПараметр("ОтборПоСотрудникам",	ЗначениеЗаполнено(Сотрудники));
	Запрос.УстановитьПараметр("Сотрудники",			Сотрудники);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(&ДатаАктуальности, МЕСЯЦ) КАК Период,
		|	Остатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Остатки.Сотрудник КАК Сотрудник,
		|	Остатки.ДокументОснование КАК ДокументОснование,
		|	ЗНАЧЕНИЕ(Перечисление.СпособОграниченияВыплаты.Процентом) КАК СпособОграничения,
		|	-СУММА(Остатки.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗарплатаКВыплатеОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|		ЗарплатаКВыплатеОстатки.Сотрудник КАК Сотрудник,
		|		ЗарплатаКВыплатеОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|		ЗарплатаКВыплатеОстатки.ДокументОснование КАК ДокументОснование,
		|		ЗарплатаКВыплатеОстатки.СтатьяФинансирования КАК СтатьяФинансирования,
		|		ЗарплатаКВыплатеОстатки.СтатьяРасходов КАК СтатьяРасходов,
		|		ЗарплатаКВыплатеОстатки.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|		ЗарплатаКВыплатеОстатки.СуммаКВыплатеОстаток КАК Сумма
		|	ИЗ
		|		РегистрНакопления.ЗарплатаКВыплате.Остатки(
		|				&ДатаАктуальности,
		|				Организация = &Организация
		|					И &Автозаполнение) КАК ЗарплатаКВыплатеОстатки
		|	ГДЕ
		|		(НЕ &ОтборПоСотрудникам
		|				ИЛИ ЗарплатаКВыплатеОстатки.Сотрудник В (&Сотрудники))) КАК Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.ФизическоеЛицо,
		|	Остатки.Сотрудник,
		|	Остатки.ПериодВзаиморасчетов,
		|	Остатки.СтатьяФинансирования,
		|	Остатки.СтатьяРасходов,
		|	Остатки.ВидДоходаИсполнительногоПроизводства,
		|	Остатки.ДокументОснование
		|
		|ИМЕЮЩИЕ
		|	СУММА(Остатки.Сумма) < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВТОстатки.Сотрудник КАК Сотрудник,
		|	ВТОстатки.ДокументОснование КАК ДокументОснование,
		|	ВТОстатки.Сумма КАК Сумма,
		|	ЕСТЬNULL(УсловияВозвратаЗадолженности.СпособОграничения, ВТОстатки.СпособОграничения) КАК СпособОграничения,
		|	УсловияВозвратаЗадолженности.Размер КАК Размер
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияВозвратаЗадолженности КАК УсловияВозвратаЗадолженности
		|		ПО ВТОстатки.Период = УсловияВозвратаЗадолженности.Период
		|			И ВТОстатки.Сотрудник = УсловияВозвратаЗадолженности.Сотрудник
		|			И ВТОстатки.ДокументОснование = УсловияВозвратаЗадолженности.ДокументОснование
		|			И (УсловияВозвратаЗадолженности.Регистратор <> &Регистратор)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФизическоеЛицо";
	
	Если Автозаполнение Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Автозаполнение", "ТИПЗНАЧЕНИЯ(ДокументОснование) <> ТИП(Документ.НачислениеЗаПервуюПоловинуМесяца)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Автозаполнение", "ИСТИНА");
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли