#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Куратор) = Тип("СправочникСсылка.РолиИсполнителей") Тогда
		// СтандартныеПодсистемы.УправлениеДоступом
		УстановитьПривилегированныйРежим(Истина);
		ГруппаИсполнителейЗадачКуратора = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(
			Куратор, ОсновнойОбъектАдресацииКуратора, ДополнительныйОбъектАдресацииКуратора);
		УстановитьПривилегированныйРежим(Ложь);
		// Конец СтандартныеПодсистемы.УправлениеДоступом
	Иначе
		ГруппаИсполнителейЗадачКуратора = Справочники.ГруппыИсполнителейЗадач.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДействующиеРегламентныеИнтервалы.ИдентификаторНачальногоЭтапа КАК ИдентификаторНачальногоЭтапа
	|ИЗ
	|	РегистрСведений.ДействующиеРегламентныеИнтервалы КАК ДействующиеРегламентныеИнтервалы
	|ГДЕ
	|	ДействующиеРегламентныеИнтервалы.РегламентныйИнтервал = &РегламентныйИнтервал";
	
	Запрос.УстановитьПараметр("РегламентныйИнтервал", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()
		И (Выборка.ИдентификаторНачальногоЭтапа <> ИдентификаторНачальногоЭтапа
			ИЛИ ПометкаУдаления) Тогда
		
		// очистка предыдущей записи
		ПроцессыОбработкиДокументов.ОтменитьВводВДействиеРегламентногоИнтервала(
			Ссылка, Владелец, Выборка.ИдентификаторНачальногоЭтапа);
		
		Если Не ПометкаУдаления Тогда
			// запись с новым идентификатором начального этапа
			ПроцессыОбработкиДокументов.ВвестиРегламентныйИнтервалВДействие(
				Ссылка, Владелец, ИдентификаторНачальногоЭтапа);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИдентификаторПоддержки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли