///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем
// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗначенияЦелевыхПоказателейЭффективностиСотрудников");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Формирует таблицу значений целевых показателей эффективности сотрудников.'");
	НастройкиВарианта.Включен = Истина;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИтоговыеОценкиСотрудников");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Информация по итоговым оценкам полученным в результате расчета показателей эффективности за период.'");
	НастройкиВарианта.Включен = Истина;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КартаПоказателейЭффективностиФакт");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Карта фактических значений показателей эффективности по сотруднику за период.'"); 
	НастройкиВарианта.Включен = Истина;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "КартаПоказателейЭффективностиПлан");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Карта плановых значений показателей эффективности по сотруднику за период.'"); 
	НастройкиВарианта.Включен = Истина;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьКлючевыеПоказателиЭффективности");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
