///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КлючВарианта = ЗарплатаКадрыОтчеты.КлючВарианта(КомпоновщикНастроек);
	Если КлючВарианта <> "КартаПоказателейЭффективностиФакт"
		И КлючВарианта <> "КартаПоказателейЭффективностиПлан" Тогда
		
		ДокументРезультат.Очистить();
		
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
		
		ТаблицаОценок = ОценкиПоказателейСотрудников(НастройкиОтчета.ПараметрыДанных);
		
		Если КлючВарианта = "СводныйОтчетЗаПериод" Тогда
			ТаблицаОценок.Свернуть("Подразделение,Позиция,Сотрудник","УдельнаяОценкаПоказателя");
		КонецЕсли;
		
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("НаборДанных", ТаблицаОценок);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		
		ПроцессорВывода.НачатьВывод();
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Пока ЭлементРезультата <> Неопределено Цикл
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
			ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		КонецЦикла;
		ПроцессорВывода.ЗакончитьВывод();
		
	Иначе
	
		ДокументРезультат.Очистить();
		
		Данные = Новый ДеревоЗначений;
		НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
		Период = ЗначениеПараметра(НастройкиОтчета.ПараметрыДанных,("ПериодОтчета"));
		ВнешниеНаборыДанных = Новый Структура;
		ВнешниеНаборыДанных.Вставить("НаборДанных", ОценкиПоказателейСотрудников(НастройкиОтчета.ПараметрыДанных));
		МакетКомпоновки = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(СхемаКомпоновкиДанных, НастройкиОтчета);
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных, , Истина);

		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Данные);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		Для каждого СтрокаСотрудника Из Данные.Строки Цикл
			ВывестиКартыЦелевыхПоказателейПоСотрудникам(ДокументРезультат, СтрокаСотрудника, КлючВарианта, Период);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
КонецПроцедуры

Функция ОценкиПоказателейСотрудников(ПараметрыДанных)
	
	УдалитьВТ = Новый Массив;
	
	ДатаНачала = Дата('00010101');
	ДатаОкончания = Дата('00010101');
	ПериодОтчета = ЗначениеПараметра(ПараметрыДанных, "ПериодОтчета");
	Если ПериодОтчета <> Неопределено Тогда
		ДатаНачала = ПериодОтчета.ДатаНачала;
		ДатаОкончания = ПериодОтчета.ДатаОкончания;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	// Определяем список позиций.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДатаОкончания КАК Период,
	|	СтруктураПредприятия.Ссылка КАК Подразделение
	|ПОМЕСТИТЬ ВТПодразделенияОтбор
	|ИЗ
	|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &Подразделение = Неопределено
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ СтруктураПредприятия.Ссылка В ИЕРАРХИИ (&Подразделение)
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Подразделение", ЗначениеПараметра(ПараметрыДанных, "Подразделение"));
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Запрос.Выполнить();
	УдалитьВТ.Добавить("ВТПодразделенияОтбор");
	
	ОрганизационнаяСтруктура.СоздатьВТПозицииПодразделений(Запрос.МенеджерВременныхТаблиц, "ВТПодразделенияОтбор");
	УдалитьВТ.Добавить("ВТПозицииПодразделений");
	
	// Получаем сотрудников, работавших в периоде на этих местах
	КлючевыеПоказателиЭффективности.СоздатьВТПериодыРаботыСотрудниковПоСпискуПозиций(Запрос.МенеджерВременныхТаблиц, "ВТПозицииПодразделений", 
																					СтруктураПараметров(ПараметрыДанных));
	УдалитьВТ.Добавить("ВТПериодыРаботыСотрудников");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
	|	МИНИМУМ(ВТПериодыРаботыСотрудников.ДатаНачала) КАК Период,
	|	ВТПериодыРаботыСотрудников.Организация КАК Организация,
	|	ВТПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавок,
	|	ВТПериодыРаботыСотрудников.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТСгруппированныеПериоды
	|ИЗ
	|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
	|ГДЕ
	|	ВТПериодыРаботыСотрудников.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПериодыРаботыСотрудников.Сотрудник,
	|	ВТПериодыРаботыСотрудников.Позиция,
	|	ВТПериодыРаботыСотрудников.Организация,
	|	ВТПериодыРаботыСотрудников.КоличествоСтавок,
	|	ВТПериодыРаботыСотрудников.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Горизонт КАК Горизонт,
	|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
	|	ПериодыРаботыСотрудников.Период КАК Период,
	|	&ДатаНачала КАК ДатаНачала,
	|	&ДатаОкончания КАК ДатаОкончания,
	|	ПериодыРаботыСотрудников.Организация КАК Организация,
	|	ПериодыРаботыСотрудников.КоличествоСтавок КАК КоличествоСтавок,
	|	ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
	|	ПериодыРаботыСотрудников.Позиция КАК Позиция
	|ПОМЕСТИТЬ ВТСотрудникиОтбор
	|ИЗ
	|	ВТСгруппированныеПериоды КАК ПериодыРаботыСотрудников";
	
	Запрос.УстановитьПараметр("Горизонт",ЗначениеПараметра(ПараметрыДанных, "Горизонт"));
	Запрос.УстановитьПараметр("ДатаНачала",ДатаНачала);
	
	Запрос.Выполнить();
	
	УдалитьВТ.Добавить("ВТСгруппированныеПериоды");
	УдалитьВТ.Добавить("ВТСотрудникиОтбор");
	
	Таблица = ЗаполнитьТаблицаОценокПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОтбор");
	ЗарплатаКадры.УничтожитьВТ(Запрос.МенеджерВременныхТаблиц, УдалитьВТ);

	Возврат Таблица;
	
КонецФункции

Функция СтруктураПараметров(ПараметрыДанных)
	
	ДатаНачала = Дата('00010101');
	ПериодОтчета = ЗначениеПараметра(ПараметрыДанных, "ПериодОтчета");
	Если ПериодОтчета <> Неопределено Тогда
		ДатаНачала = ПериодОтчета.ДатаНачала;
	КонецЕсли;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Период", ДатаНачала);
	СтруктураПараметров.Вставить("Горизонт", ЗначениеПараметра(ПараметрыДанных, "Горизонт"));
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ВывестиКартыЦелевыхПоказателейПоСотрудникам(ДокументРезультат, Данные, КлючВарианта, Период)
	
	ДокументРезультат.КлючПараметровПечати = "ПараметрыПечати_КартаПоказателейЭффективности";
	ДокументРезультат.АвтоМасштаб = Истина;

	Если КлючВарианта = "КартаПоказателейЭффективностиФакт" Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.КартаЦелевыхПоказателейЭффективности.ПФ_MXL_КартаПоказателейЭффективности_Факт");
	ИначеЕсли КлючВарианта = "КартаПоказателейЭффективностиПлан" Тогда 
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.КартаЦелевыхПоказателейЭффективности.ПФ_MXL_КартаПоказателейЭффективности_План");
	КонецЕсли;
		
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрокаИтого = Макет.ПолучитьОбласть("СтрокаТаблицыИтого");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	
	Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.Период = Период;
	ОбластьЗаголовок.Параметры.Заполнить(Данные);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ДокументРезультат.Вывести(ОбластьШапкаТаблицы);
	
	НомерСтрокиНачало = ДокументРезультат.ВысотаТаблицы + 1;
	
	ОбластьСтрокаИтого.Параметры.УдельныйВесИтого = Формат(Данные.Строки.Итог("УдельныйВес"), "ЧЦ=15; ЧДЦ=2");
	Если КлючВарианта = "КартаПоказателейЭффективностиФакт" Тогда
		ОбластьСтрокаИтого.Параметры.УдельнаяОценкаИтого = Данные.Строки.Итог("УдельнаяОценкаПоказателя");
	КонецЕсли;
		
	ДокументРезультат.Вывести(ОбластьСтрокаИтого);
	НомерПП = 1;

	Для каждого ДанныеПоказателя Из Данные.Строки Цикл
		
		Для каждого РасчетПоказателя Из ДанныеПоказателя.Строки Цикл
			
			ОбластьСтрока.Параметры.Заполнить(РасчетПоказателя);
			ОбластьСтрока.Параметры.НомерПП = НомерПП;
			ОбластьСтрока.Параметры.УдельныйВес = Формат(РасчетПоказателя.УдельныйВес * 100,"ЧЦ=15; ЧДЦ=2");
			Если Не РасчетПоказателя.ТребуетсяВводПлана Тогда
				ОбластьСтрока.Параметры.ПланПоказателя = НСтр("ru = 'не требуется'");
			КонецЕсли;
			НомерПП = НомерПП + 1;
			
		КонецЦикла;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ДокументРезультат.Вывести(ОбластьПодвал);

КонецФункции

Функция ЗаполнитьТаблицаОценокПоказателейСотрудников(МенеджерВременныхТаблиц, ИмяОтбора)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	КлючевыеПоказателиЭффективности.СоздатьВТОценкиПоказателейСотрудников(Запрос.МенеджерВременныхТаблиц, ИмяОтбора);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	ОценкиПоказателейСотрудников.Позиция КАК Позиция,
		|	ОценкиПоказателейСотрудников.Показатель КАК Показатель,
		|	ОценкиПоказателейСотрудников.РегистраторНазначенияПоказателей КАК РегистраторПоказателя,
		|	ОценкиПоказателейСотрудников.ВладелецПоказателя КАК ВладелецПоказателя,
		|	ОценкиПоказателейСотрудников.Вес КАК Вес,
		|	ОценкиПоказателейСотрудников.УдельныйВес КАК УдельныйВес,
		|	ОценкиПоказателейСотрудников.ЗначениеПоказателя КАК ЗначениеПоказателя,
		|	ОценкиПоказателейСотрудников.ЗначениеОт КАК ЗначениеОт,
		|	ОценкиПоказателейСотрудников.ЗначениеДо КАК ЗначениеДо,
		|	ОценкиПоказателейСотрудников.ПлановоеЗначение КАК ПланПоказателя,
		|	ОценкиПоказателейСотрудников.ФактическоеЗначение КАК ФактПоказателя,
		|	ОценкиПоказателейСотрудников.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя КАК УдельнаяОценкаПоказателя,
		|	ОценкиПоказателейСотрудников.РегистраторПлановогоЗначения КАК РегистраторПлана,
		|	ОценкиПоказателейСотрудников.РегистраторФактическогоЗначения КАК РегистраторФакта,
		|	ВЫБОР
		|		КОГДА ОценкиПоказателейСотрудников.УдельнаяОценкаПоказателя ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Рассчитан,
		|	ВТСотрудникиОтбор.Подразделение КАК Подразделение,
		|	ВТСотрудникиОтбор.КоличествоСтавок КАК КоличествоСтавок,
		|	ВТСотрудникиОтбор.Организация КАК Организация,
		|	ОценкиПоказателейСотрудников.ТребуетсяВводПлана КАК ТребуетсяВводПлана
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ОценкиПоказателейСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудникиОтбор КАК ВТСотрудникиОтбор
		|		ПО ОценкиПоказателейСотрудников.Сотрудник = ВТСотрудникиОтбор.Сотрудник
		|			И ОценкиПоказателейСотрудников.Позиция = ВТСотрудникиОтбор.Позиция
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	Позиция,
		|	Показатель";
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
	
КонецФункции

Функция ЗначениеПараметра(ПараметрыДанных, ИмяПараметра)

	Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если Параметр <> Неопределено И Параметр.Использование Тогда
		Возврат Параметр.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли