#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьПодключаемыеХарактеристики");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс  

Функция ДоступнаВыгрузкаЗаработнойПлаты() Экспорт
	Настройки = ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Если Настройки.ИспользоватьПилотныйПроектПоЗП Тогда 
		Возврат ПравоДоступа("Чтение", Метаданные.РегистрыНакопления.НачисленияУдержанияПоСотрудникам); 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
КонецФункции

Процедура СоздатьДополнительныеРеквизитыМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, Префикс="") Экспорт
	
	МассивРеквизитов = Новый Массив;
	Сч = 0;
	Для Каждого ПодчиненныйКлассификатор из ПодчиненныеКлассификаторыМедрегистров Цикл
		ПодчиненныйКлассификатор.ИмяРеквизита = Префикс+"ПодчиненныйКлассификаторМедрегистра" + Формат(Сч,"ЧН=; ЧГ=");
		РеквизитПодчиненногоКлассификатора = Новый РеквизитФормы(ПодчиненныйКлассификатор.ИмяРеквизита, Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"),,ПодчиненныйКлассификатор.НаименованиеКлассификатора+?(ЗначениеЗаполнено(Префикс)," ("+Префикс+")",""));
		МассивРеквизитов.Добавить(РеквизитПодчиненногоКлассификатора);
		Сч = Сч + 1;
	КонецЦикла;

	МассивРеквизитов.Добавить(Новый РеквизитФормы("ДополнительныеРеквизитыМедицинскихРегистров", Новый ОписаниеТипов()));

	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, МассивРеквизитов, МассивИменРеквизитовФормы);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, ИмяГруппыРеквизитовМедицинскихРегистров = "РеквизитыМедицинскихРегистров") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	ПодчиненныеКлассификаторыМедрегистров = ПолучитьПодчиненныеКлассификаторы(ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,"Объект.Ссылка"));
	Если ПодчиненныеКлассификаторыМедрегистров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СоздатьДополнительныеРеквизитыМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров);
	ЗаполнитьДополнительныеРеквизитыМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров);
	СоздатьЭлементыРеквизитовМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, ИмяГруппыРеквизитовМедицинскихРегистров);
	
КонецПроцедуры

Процедура ДобавитьПодчиненныеХарактеристики(Форма, ИмяРеквизитаВладельца, ЗаданныеКласссификаторы, ИмяГруппыРеквизитовМедицинскихРегистров = "РеквизитыМедицинскихРегистров") Экспорт
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	ПодчиненныеКлассификаторыМедрегистров = ПолучитьПодчиненныеКлассификаторы(ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,"Объект."+ИмяРеквизитаВладельца), ЗаданныеКласссификаторы);
	Если ПодчиненныеКлассификаторыМедрегистров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СоздатьДополнительныеРеквизитыМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, ИмяРеквизитаВладельца);
	ЗаполнитьДополнительныеРеквизитыМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, ИмяРеквизитаВладельца);
	СоздатьЭлементыРеквизитовМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, ИмяГруппыРеквизитовМедицинскихРегистров, Истина);
	
КонецПроцедуры

Процедура ДополнитьФормуУслугами(Форма, ВладелецУслуг, ИмяГруппыРеквизитовМедицинскихРегистров = "РеквизитыМедицинскихРегистров", ЗаголовокДерева = "") Экспорт
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("СписокУслугФРМО",
							Новый ОписаниеТипов("ДеревоЗначений"),,
							СокрЛП(НСтр("ru = 'Услуги'")+?(ЗначениеЗаполнено(ЗаголовокДерева)," ("+ЗаголовокДерева+")",""))));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Услуга",
							Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"),
							"СписокУслугФРМО"));
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

	СоздатьЭлементСписокУслугВФорме(Форма,"СписокУслугФРМО",Форма.Элементы.Найти(ИмяГруппыРеквизитовМедицинскихРегистров),ЗначениеЗаполнено(ЗаголовокДерева));
	
	ОбновитьДеревоУслуг(Форма, ВладелецУслуг);
	
КонецПроцедуры

Процедура ОбновитьДеревоУслуг(Форма, ВладелецУслуг) Экспорт
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;

	СписокУслуг = ПолучитьСписокУслуг(ВладелецУслуг);
	Если СписокУслуг.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	ДеревоУслуг = ДеревоУслугПоСписку(СписокУслуг);

	ЗначениеВДанныеФормы(ДеревоУслуг,Форма.СписокУслугФРМО);

	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	Если МассивИменРеквизитовФормы.Найти("ДополнительныеРеквизитыМедицинскихРегистров") <> Неопределено Тогда
		Для Каждого ОписаниеРеквизита Из Форма.ДополнительныеРеквизитыМедицинскихРегистров Цикл
			Если ОписаниеРеквизита.КодКлассификатора = "1.2.643.5.1.13.13.99.2.319" Тогда
				ЭлементУправления = Форма.Элементы[ОписаниеРеквизита.ИмяРеквизита];
				ЭлементУправления.СписокВыбора.ЗагрузитьЗначения(СписокУслуг);
				ЭлементУправления.ИсторияВыбораПриВВоде = ИсторияВыбораПриВводе.НеИспользовать;
				//Форма.Элементы[ОписаниеРеквизита.ИмяРеквизита].СписокВыбора.РежимВыбораИзСписка = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область СправочникДолжности

Процедура ОбновитьСвязанныеХарактеристики(Форма, Должность, ИмяХарактеристики) Экспорт
	Характеристика = Форма[ИмяХарактеристики];
	id_181 = Характеристика.ОписаниеЭлемента.Найти("id_181","Поле");
	Если ЗначениеЗаполнено(id_181) Тогда
		Для Каждого ДополнительнаяХарактеристика из Форма.ДополнительныеРеквизитыМедицинскихРегистров Цикл
			Если ДополнительнаяХарактеристика.КодКлассификатора = "1.2.643.5.1.13.13.99.2.181" Тогда
				Характеристика_181 = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(id_181.Значение,Ложь, ,ДополнительнаяХарактеристика.Ссылка);
				Если ЗначениеЗаполнено(Характеристика_181) Тогда
					Форма[ДополнительнаяХарактеристика.ИмяРеквизита] = Характеристика_181;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция ЗапросОпределитьПолныеНаименованияУчебныхЗаведений(ПараметрыОбновления = Неопределено) Экспорт

	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КлассификаторУчебноеЗаведение", "1.2.643.5.1.13.13.11.1519");
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	УчебныеЗаведения.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ХарактеристикиУчебноеЗаведениеПоМедРегистру.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)
	|			ТОГДА ХарактеристикиУчебноеЗаведениеПоМедРегистру.ХарактеристикаНаименование
	|		ИНАЧЕ УчебныеЗаведения.Наименование
	|	КОНЕЦ КАК ПолноеНаименование
	|ИЗ
	|	Справочник.УчебныеЗаведения КАК УчебныеЗаведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиУчебноеЗаведениеПоМедРегистру
	|		ПО (ХарактеристикиУчебноеЗаведениеПоМедРегистру.ИдентификаторКлассификатора = &КлассификаторУчебноеЗаведение)
	|			И УчебныеЗаведения.Ссылка = ХарактеристикиУчебноеЗаведениеПоМедРегистру.Объект
	|ГДЕ
	|	УчебныеЗаведения.ПолноеНаименование = """"";
	
	Если ПараметрыОбновления = Неопределено Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 1000", ""); 
	КонецЕсли;

	Возврат Запрос;
		
КонецФункции

#КонецОбласти

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	Если МассивИменРеквизитовФормы.Найти("ДополнительныеРеквизитыМедицинскихРегистров") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбъектСсылка = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,"Объект.Ссылка");
	ДополнительныеРеквизитыМедицинскихРегистров = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
		Форма, "ДополнительныеРеквизитыМедицинскихРегистров");
	Для каждого ДополнительныйРеквизитМедицинскихРегистров Из ДополнительныеРеквизитыМедицинскихРегистров Цикл
		ЗначениеРекизита = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ДополнительныйРеквизитМедицинскихРегистров.ИмяРеквизита);
		СохранитьХарактеристикуОбъектаМедицинскогоРегистра(ОбъектСсылка, ДополнительныйРеквизитМедицинскихРегистров.Ссылка, ЗначениеРекизита);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементСписокУслугВФорме(Форма,ИмяРеквизита,ЭлементГруппа,ОтображатьЗаголовок=Ложь)
	Если Форма.Элементы.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭлементДерево = Форма.Элементы.Вставить(ИмяРеквизита, Тип("ТаблицаФормы"), ЭлементГруппа);
	ЭлементДерево.ПутьКДанным = ИмяРеквизита;
	ЭлементДерево.Отображение = ОтображениеТаблицы.Дерево;
	ЭлементДерево.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	ЭлементДерево.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	ЭлементДерево.ТолькоПросмотр = Истина;
	Если ОтображатьЗаголовок Тогда
		ЭлементДерево.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Добавить(ИмяРеквизита+"Услуга", Тип("ПолеФормы"), ЭлементДерево);
	Элемент.ПутьКДанным = ИмяРеквизита +".Услуга";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

Процедура СоздатьЭлементРеквизитаМедицинскогоРегистраВФорме(Форма, ОписаниеРеквизита, ЭлементГруппа, ТолькоПросмотр = Ложь) Экспорт

	Если Форма.Элементы.Найти(ОписаниеРеквизита.ИмяРеквизита) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Форма.Элементы.Вставить(ОписаниеРеквизита.ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппа);
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = ОписаниеРеквизита.ИмяРеквизита;
	
	Если ТолькоПросмотр Тогда
		Элемент.ТолькоПросмотр = ТолькоПросмотр;
	Иначе
		Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_РеквизитыМедицинскогоРегистраЭлементПриИзменении");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеРеквизита.Ссылка) Тогда
		НовыйПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", ОписаниеРеквизита.Ссылка);
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НовыйПараметрВыбора));
	КонецЕсли;
		
		
КонецПроцедуры

#Область ПоставляемыеДанные

// Вызывается при получении уведомления о новых данных.
// В теле следует проверить, необходимы ли эти данные приложению, 
// и если да - установить флажок Загружать.
// 
// Параметры:
//   Дескриптор   - ОбъектXDTO -  Дескриптор.
//   Загружать    - булево - возвращаемое.
//
Процедура ДоступныНовыеДанные(Знач Дескриптор, Загружать) Экспорт
	
	Если Дескриптор.DataType = "КлассификаторыМедРегистра" Тогда
		Загружать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается после вызова ДоступныНовыеДанные, позволяет разобрать данные.
//
// Параметры:
//   Дескриптор   - ОбъектXDTO - Дескриптор.
//   ПутьКФайлу   - строка - Полное имя извлеченного файла. Файл будет автоматически удален 
//                  после завершения процедуры.
//
Процедура ОбработатьНовыеДанные(Знач Дескриптор, Знач ПутьКФайлу) Экспорт
	
	Если Не Дескриптор.DataType = "КлассификаторыМедРегистра" Тогда
		Возврат;
	КонецЕсли;
		
	РазархивированныеДанные = РазархивироватьКлассификаторыМедРегистра(Дескриптор, ПутьКФайлу);
	ИменаКлассификаторов = РазархивированныеДанные.Выборка;
	
	Пока ИменаКлассификаторов.Следующий() Цикл
		ЗагрузитьКлассификаторМедРегистраПоИмени(ИменаКлассификаторов.Код, РазархивированныеДанные.Каталог);
	КонецЦикла;
		
КонецПроцедуры

// Вызывается при отмене обработки данных в случае сбоя.
//
// Параметры:
//   Дескриптор   - ОбъектXDTO - Дескриптор.
//
Процедура ОбработкаДанныхОтменена(Знач Дескриптор) Экспорт
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Останавливает выполнение кода на заданное время.
// Метод продублирован из ОбменДаннымиСервер.
//
// Параметры:
//  Секунд - Число - время ожидания в секундах.
//
Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("МедицинскиеРегистры.Пауза", Параметры);
		
	КонецЕсли;
		
	ФоновоеЗадание.ОжидатьЗавершенияВыполнения(Секунд);
	
КонецПроцедуры

Функция ЗаполнитьТаблицуУслуг(ТаблицаУслуг,Услуга)
	СтрокаУслуги = ТаблицаУслуг.Добавить();
	СтрокаУслуги.Услуга = Услуга;
	СтрокаУслуги.Родитель = Услуга.Родитель;
	Если ЗначениеЗаполнено(СтрокаУслуги.Родитель)Тогда
		ЗаполнитьТаблицуУслуг(ТаблицаУслуг,СтрокаУслуги.Родитель);
	КонецЕсли;
	
КонецФункции

Функция ДеревоУслугПоСписку(СписокУслуг) Экспорт
	ТаблицаУслуг = Новый ТаблицаЗначений();
	ТаблицаУслуг.Колонки.Добавить("Услуга",Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"));
	ТаблицаУслуг.Колонки.Добавить("Родитель",Новый ОписаниеТипов("СправочникСсылка.ЭлементыКлассификаторовФедеральныхМедрегистров"));

	Для Каждого Услуга Из СписокУслуг Цикл
		ЗаполнитьТаблицуУслуг(ТаблицаУслуг, Услуга);
	КонецЦикла;
	ТаблицаУслуг.Свернуть("Услуга, Родитель");
	ТаблицаУслуг.Сортировать("Родитель");
	ДеревоУслуг = ДеревоИзТаблицы(ТаблицаУслуг, "Услуга", "Родитель");
	
	Возврат ДеревоУслуг;
	
КонецФункции

Функция ДеревоИзТаблицы(ИсходнаяТаблица, КолонкаID, КолонкаParent)
	
	ДеревоРезультатов = Новый ДеревоЗначений; 
	Для Каждого Колонка Из ИсходнаяТаблица.Колонки Цикл
		Если Колонка.Имя = КолонкаParent Тогда
			Продолжить;
		КонецЕсли;
		ДеревоРезультатов.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		Если СтрокаРодитель = Неопределено Тогда
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
		Иначе
			СтрокаДерева = СтрокаРодитель.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);

	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		СтрокаДерева    = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаID], КолонкаID, Истина);
		
		Если СтрокаДерева = Неопределено Тогда
			
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);
			
		КонецЕсли; 
		
		Если Не СтрокаДерева.Родитель = СтрокаРодитель Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРодитель.Строки.Добавить(), СтрокаТаблицы);
			ДеревоРезультатов.Строки.Удалить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДеревоРезультатов;
	
КонецФункции

Функция ПолучитьСписокУслуг(ОбъектСсылка)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОказываемыеМедицинскиеУслуги.Услуга КАК Услуга
	|ИЗ
	|	РегистрСведений.ОказываемыеМедицинскиеУслуги КАК ОказываемыеМедицинскиеУслуги
	|ГДЕ
	|	ОказываемыеМедицинскиеУслуги.Объект = &ОбъектСсылка
	|";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");
КонецФункции

Процедура ЗаполнитьПодключаемыеХарактеристики(ПараметрыОбновления = Неопределено) Экспорт
		
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.ОбновитьПодключаемыеХарактеристики(
		ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры"), ПараметрыОбновления);
	
КонецПроцедуры

Процедура СохранитьХарактеристикуОбъектаМедицинскогоРегистра(ОбъектСсылка, Классификатор, Характеристика) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.Классификатор = Классификатор;
	МенеджерЗаписи.Характеристика = Характеристика;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура СоздатьЭлементыРеквизитовМедицинскихРегистров(Форма, ПодчиненныеКлассификаторыМедрегистров, ИмяГруппыРеквизитовМедицинскихРегистров, ТолькоПросмотр = Ложь)
		
	ЭлементГруппа = Форма.Элементы.Найти(ИмяГруппыРеквизитовМедицинскихРегистров);
	Если ЭлементГруппа = Неопределено Тогда
		ЭлементГруппа = Форма.Элементы.Добавить(ИмяГруппыРеквизитовМедицинскихРегистров, Тип("ГруппаФормы"));
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	Если ПодчиненныеКлассификаторыМедрегистров.Количество()>0 Тогда
		ЭлементГруппа.Заголовок = "Дополнительные реквизиты медицинских регистров";
		ЭлементГруппа.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
	Для каждого ОписаниеРеквизитаКлассификатора Из ПодчиненныеКлассификаторыМедрегистров Цикл
		СоздатьЭлементРеквизитаМедицинскогоРегистраВФорме(Форма, ОписаниеРеквизитаКлассификатора, ЭлементГруппа, ТолькоПросмотр);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеРеквизитыМедицинскихРегистров(Форма, ОписаниеДополнительныхРеквизитов, ИмяРеквизитаВладельца = "Ссылка")
	//ДополнительныеРеквизитыМедицинскихРегистров = Новый СписокЗначений();
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОписаниеДополнительныхРеквизитов", ОписаниеДополнительныхРеквизитов);
	Запрос.УстановитьПараметр("Ссылка",  ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма,"Объект."+ИмяРеквизитаВладельца));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОписаниеДополнительныхРеквизитов.ИмяРеквизита КАК ИмяРеквизита,
	|	ОписаниеДополнительныхРеквизитов.Ссылка КАК Классификатор,
	|	&Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОписаниеДополнительныхРеквизитов
	|ИЗ
	|	&ОписаниеДополнительныхРеквизитов КАК ОписаниеДополнительныхРеквизитов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОписаниеДополнительныхРеквизитов.ИмяРеквизита КАК ИмяРеквизита,
	|	ОписаниеДополнительныхРеквизитов.Классификатор КАК Классификатор,
	|	ЕСТЬNULL(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) КАК Значение
	|ИЗ
	|	ВТОписаниеДополнительныхРеквизитов КАК ОписаниеДополнительныхРеквизитов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров
	|		ПО (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор = ОписаниеДополнительныхРеквизитов.Классификатор)
	|			И (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект = ОписаниеДополнительныхРеквизитов.Ссылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(
				Форма,
				Выборка.ИмяРеквизита,
				Выборка.Значение);
			КонецЕсли;
	КонецЦикла;
	
	МассивОписанийДополнительныхРеквизитов = ОбщегоНазначения.ТаблицаЗначенийВМассив(ОписаниеДополнительныхРеквизитов);
	Если ЗначениеЗаполнено(Форма.ДополнительныеРеквизитыМедицинскихРегистров) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОписанийДополнительныхРеквизитов, Форма.ДополнительныеРеквизитыМедицинскихРегистров);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(
	Форма,
	"ДополнительныеРеквизитыМедицинскихРегистров",
	Новый ФиксированныйМассив(МассивОписанийДополнительныхРеквизитов));
	
КонецПроцедуры

Функция ПолучитьПодчиненныеКлассификаторы(ВладелецСсылка, ЗаданныеКласссификаторы = Неопределено)
	ИмяМД = ВладелецСсылка.Метаданные().имя;
	КлассификаторыФРМР = Справочники.КлассификаторыФедеральныхМедрегистров.ПолучитьСправочникиФРМРИзМакета();
	ПодчиненныеКлассификаторы = КлассификаторыФРМР.СкопироватьКолонки("КодКлассификатора,НаименованиеКлассификатора,Ссылка");
	ПодчиненныеКлассификаторы.Колонки.Добавить("ИмяРеквизита", Новый ОписаниеТипов("Строка"));
	Для Каждого КлассификаторФРМР из КлассификаторыФРМР Цикл
		Если НЕ ЗначениеЗаполнено(КлассификаторФРМР.Ссылка) Тогда
			Продолжить;
		ИначеЕсли СтрНайти(КлассификаторФРМР.ТипОбъектаМетаданных,ИмяМД) = 0 Тогда
			Продолжить;
		ИначеЕсли НЕ (ЗаданныеКласссификаторы = Неопределено)
			И ЗаданныеКласссификаторы.Найти(КлассификаторФРМР.КодКлассификатора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПодчиненныеКлассификаторы.Добавить(),КлассификаторФРМР);
	КонецЦикла;
	Возврат ПодчиненныеКлассификаторы;
КонецФункции

Функция ВызватьМетод(Организация, ТокенДоступа, ПараметрыВызова) Экспорт
	
	Настройки = ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	ПараметрыСервиса = ПараметрыСервиса(Настройки);
	
	Заголовки = Новый Соответствие;
	Если Настройки.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС Тогда
    	Заголовки.Вставить("Authorization", "Bearer " + ТокенДоступа); 
    ИначеЕсли Настройки.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.РегионСервис1С Тогда 
		ИдентификаторРегистрационныхДанных1СМедицинаРегион = ИдентификаторРегистрационныхДанных1СМедицинаРегион();
		УстановитьПривилегированныйРежим(Истина);
		Если Организация <> Неопределено Тогда 
			КлючДоступа1СМедицинаРегион = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторКлючаДоступа1СМедицинаРегион(Организация), "КлючДоступа");
			Если Не ПустаяСтрока(КлючДоступа1СМедицинаРегион) Тогда 
	    		Заголовки.Вставить("X-API-Key", КлючДоступа1СМедицинаРегион);
	   	 	КонецЕсли;
   	 	КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
   	Иначе 
		ИдентификаторРегистрационныхДанных1СМедицинаРегион = ИдентификаторРегистрационныхДанных1СМедицинаРегион();
		УстановитьПривилегированныйРежим(Истина);
		Логин1СМедицинаРегион = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторРегистрационныхДанных1СМедицинаРегион, "Логин");
		Если Не ПустаяСтрока(Логин1СМедицинаРегион) Тогда 
			ПараметрыСервиса.Логин = Логин1СМедицинаРегион;
			ПараметрыСервиса.Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторРегистрационныхДанных1СМедицинаРегион);
		КонецЕсли;
		Если Организация <> Неопределено Тогда 
			КлючДоступа1СМедицинаРегион = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ИдентификаторКлючаДоступа1СМедицинаРегион(Организация), "КлючДоступа");
			Если Не ПустаяСтрока(КлючДоступа1СМедицинаРегион) Тогда 
	    		Заголовки.Вставить("X-API-Key", КлючДоступа1СМедицинаРегион);
	   	 	КонецЕсли;
   	 	КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
    КонецЕсли;
    Заголовки.Вставить("Content-Type", "application/json");
	
    АдресРесурса = ПараметрыСервиса.ТочкаДоступа + "/" + ПараметрыВызова.Команда;
	HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Если ПараметрыВызова.Тело<>Неопределено Тогда 
		HTTPЗапрос.УстановитьТелоИзСтроки(ПараметрыВызова.Тело);
    КонецЕсли;
	
	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси(?(ПараметрыСервиса.ИспользоватьЗащищенноеСоединение, "https", "http"));
	КонецЕсли;
	
	Если ПараметрыСервиса.ИспользоватьЗащищенноеСоединение Тогда 
    	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		HTTPСоединение = Новый HTTPСоединение(ПараметрыСервиса.Адрес,ПараметрыСервиса.Порт,ПараметрыСервиса.Логин,ПараметрыСервиса.Пароль,ИнтернетПрокси,,ЗащищенноеСоединение);
	Иначе 
		HTTPСоединение = Новый HTTPСоединение(ПараметрыСервиса.Адрес,ПараметрыСервиса.Порт,ПараметрыСервиса.Логин,ПараметрыСервиса.Пароль,ИнтернетПрокси);
    КонецЕсли;
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод(ПараметрыВызова.Метод, HTTPЗапрос);
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	Контент = Неопределено;
	СообщениеОбОшибкеПользователю = Неопределено;
	Смещение = Неопределено;
	Ограничение = Неопределено;
	Количество = Неопределено;
	Если HTTPОтвет.КодСостояния < 400 Тогда 
		ДанныеОтвета = JSONВДанные(ТекстОтвета);
		ДанныеОтвета.Свойство("errorUserMessage", СообщениеОбОшибкеПользователю);
		ДанныеОтвета.Свойство("content", Контент);
		ДанныеОтвета.Свойство("offset", Смещение);
		ДанныеОтвета.Свойство("limit", Ограничение);
		ДанныеОтвета.Свойство("total", Количество);
		Если ЗначениеЗаполнено(СообщениеОбОшибкеПользователю) Тогда 
			СообщениеОбОшибкеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1", СообщениеОбОшибкеПользователю);
		КонецЕсли;
	Иначе 
		Попытка
			ДанныеОтвета = JSONВДанные(ТекстОтвета);
			ХарактерОшибки = Неопределено;
			СообщениеОбОшибкеСервиса = Неопределено;
			Если Не ДанныеОтвета.Свойство("reasonPhrase", ХарактерОшибки) Тогда 
				ДанныеОтвета.Свойство("error", ХарактерОшибки);
			КонецЕсли;
			Если Не ДанныеОтвета.Свойство("message", СообщениеОбОшибкеСервиса) Тогда
				ДанныеОтвета.Свойство("path", СообщениеОбОшибкеСервиса);
			КонецЕсли;
		Исключение
			ХарактерОшибки = НСтр("ru = 'Ошибка при выполнении запроса'");
			СообщениеОбОшибкеСервиса = ТекстОтвета;
		КонецПопытки;
		ШаблонСообщения = "(%1) %2: %3";
		СообщениеОбОшибкеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, HTTPОтвет.КодСостояния, ХарактерОшибки, СообщениеОбОшибкеСервиса);
	КонецЕсли;	
	
	Возврат Новый Структура("ТекстОтвета,КодСостояния,Контент,СообщениеОбОшибкеПользователю,Смещение,Ограничение,Количество,ТекстДляТехподдержки", 
			ТекстОтвета, HTTPОтвет.КодСостояния, Контент, СообщениеОбОшибкеПользователю, Смещение, Ограничение, Количество, 
			ТекстДляТехподдержки(ПараметрыСервиса, ПараметрыВызова, HTTPОтвет.КодСостояния, ТекстОтвета, ТокенДоступа));

КонецФункции

Функция ТекстДляТехподдержки(ПараметрыСервиса, ПараметрыВызова, КодСостояния, ТекстОтвета, ТокенДоступа = Неопределено)
	АдресРесурса = ПараметрыСервиса.Адрес + ПараметрыСервиса.ТочкаДоступа + "/";
	КомандаЗапроса = ПараметрыВызова.Команда;
	UrlЗапроса = ?(ПараметрыСервиса.ИспользоватьЗащищенноеСоединение, "https://", "http://") + АдресРесурса + КомандаЗапроса;
	ТекстДляТехподдержки = Символы.ПС + Символы.ПС +
			НСтр("ru = 'Запрос ('") +  ПараметрыВызова.Метод + "): " + UrlЗапроса + Символы.ПС + Символы.ПС + 
			НСтр("ru = 'Данные: '") +  ПараметрыВызова.Тело + Символы.ПС + Символы.ПС + 
			?(ТокенДоступа = Неопределено, "", НСтр("ru = 'Токен: '") + Символы.ПС + ТокенДоступа + Символы.ПС + Символы.ПС) +
			НСтр("ru = 'Ответ ('") + КодСостояния + "): " + ТекстОтвета;
	Возврат ТекстДляТехподдержки;
КонецФункции

// Параметры вызова метода
// 
// Возвращаемое значение:
//  Структура - параметры, необходимые для вызова метода сервиса REST.
//  	Метод - Строка - метод выполнения запроса ("GET", "PUT", "POST" и т.п.).
//  	Команда - Строка - часть url запроса с именем метода и некоторыми параметрами.
//  	Тело - Строка - Тело запроса в формате json.
//  	РазделМедрегистра - Строка - Имя метода для Команды (см. выше).
//
Функция ПараметрыВызоваМетода() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Метод", Неопределено);
	Результат.Вставить("Команда", Неопределено);
	Результат.Вставить("Тело", Неопределено);
	Результат.Вставить("РазделМедрегистра", Неопределено);
	Возврат Результат;
КонецФункции

Функция КадровыеДанныеСотрудника(СотрудникСсылка) Экспорт
	
	ИменаПолей = ИменаПолейТребуемыхКадровыхДанных();
	КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, СотрудникСсылка, ИменаПолей, ТекущаяДатаСеанса());
	Если КадровыеДанныеСотрудника <> Неопределено Тогда
		КадровыеДанные = Новый Структура(ИменаПолей);
		ЗаполнитьЗначенияСвойств(КадровыеДанные, КадровыеДанныеСотрудника);
		Возврат КадровыеДанные;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ИменаПолейТребуемыхКадровыхДанных() Экспорт
	Возврат
	"СтраховойНомерПФР,
	|ДокументВид,
	|ДокументСерия,
	|ДокументНомер,
	|ДокументДатаВыдачи";
КонецФункции

Функция МоментВыпуска() Экспорт
	
	Возврат УниверсальноеВремя(ТекущаяДатаСеанса()) - '19700101';
	
КонецФункции

Функция ДанныеСертификата(СертификатСсылка) Экспорт
	
	СертификатОбъект = СертификатСсылка.ПолучитьОбъект();
	АлгоритмПодписи = СертификатОбъект.Программа.АлгоритмПодписи;
	ДвоичныеДанныеСертификата = СертификатОбъект.ДанныеСертификата.Получить();
	
	Возврат Новый Структура("Алгоритм,Данные", АлгоритмПодписи, ДвоичныеДанныеСертификата);
	
КонецФункции

Функция ТолькоЦифры(ИсходнаяСтрока) Экспорт
	
	Результат = "";
	Цифры = "0123456789";
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	Для ИндексСимвола = 1 По ДлинаСтроки Цикл
		Символ = Сред(ИсходнаяСтрока, ИндексСимвола, 1);
		Если СтрНайти(Цифры, Символ)>0 Тогда 
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьЭлементJSON(ЭлементыJSON, ИмяJSON, ЗначениеИБ, ТипJSON, Точность = Неопределено, ИспользоватьNullЕслиНеопределено = Ложь) Экспорт
	
	ЗначениеJSON = Неопределено;
	
	Если ЗначениеИБ=Неопределено Тогда
		Если ИспользоватьNullЕслиНеопределено Тогда
			ЗначениеJSON = "null";
		КонецЕсли;
	Иначе 
		Если ТипЗнч(ЗначениеИБ)=Тип("Число") Тогда
			Если ТипJSON="Число" И Точность=Неопределено Тогда 
				ЗначениеJSON = Формат(ЗначениеИБ, "ЧГ=0; ЧН=");
			ИначеЕсли ТипJSON="Число" И Точность<>Неопределено Тогда 
				ЗначениеJSON = Формат(ЗначениеИБ, "ЧГ=0; ЧН=; ЧРД='.'; ЧДЦ=" + Формат(Точность, "ЧГ=0; ЧН="));
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Строка") Тогда 
			Если ТипJSON="Число" Тогда 
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="Дата" Тогда
				ЗначениеJSON = """" + СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ)) + """";
			ИначеЕсли ТипJSON="ДатаUTC" Тогда
				ЗначениеJSON = """" + СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ)) + """";
			ИначеЕсли ТипJSON="Булево" Тогда
				ЗначениеJSON = СокрЛП(БезопаснаяСтрокаJSON(ЗначениеИБ));
			ИначеЕсли ТипJSON="Строка" Тогда
				ЗначениеJSON = """" + БезопаснаяСтрокаJSON(ЗначениеИБ) + """";
			ИначеЕсли ТипJSON="JSON" Тогда 
				ЗначениеJSON = ЗначениеИБ;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Дата") Тогда 
			Если ТипJSON="Дата" Тогда 
				Если ЗначениеИБ=Дата('00010101') Тогда 
					ЗначениеJSON = """0001-01-01""";
				Иначе 
					ЗначениеJSON = """" + Формат(ЗначениеИБ, "ДФ=гггг-ММ-дд") + """";
				КонецЕсли;
			ИначеЕсли ТипJSON="ДатаUTC" Тогда
				Если ЗначениеИБ=Дата('00010101') Тогда 
					ЗначениеJSON = """0001-01-01T00:00:00Z"""; 
				Иначе 
					ЗначениеJSON = """" + Формат(ЗначениеИБ, "ДФ=гггг-ММ-ддTЧЧ:мм:ссZ") + """";
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ЗначениеИБ)=Тип("Булево") Тогда 
			Если ТипJSON="Булево" Тогда 
				ЗначениеJSON = ?(ЗначениеИБ, "true", "false");
			КонецЕсли;
		Иначе
			Если ТипJSON="Строка" Тогда
				ЗначениеJSON = """" + БезопаснаяСтрокаJSON(Строка(ЗначениеИБ)) + """";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеJSON<>Неопределено Тогда
		Шаблон = """%1"":%2";
		ЭлементыJSON.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ИмяJSON, ЗначениеJSON));
	КонецЕсли;
	
КонецПроцедуры

Функция БезопаснаяСтрокаJSON(ИсходнаяСтрока)
	БезопаснаяСтрока = СтрЗаменить(ИсходнаяСтрока, "\", "\\");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, """", "\""");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, "/", "\/");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ВК, "\r");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ПС, "\n");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.ПФ, "\f");
	БезопаснаяСтрока = СтрЗаменить(БезопаснаяСтрока, Символы.Таб, "\t");
	Возврат БезопаснаяСтрока;
КонецФункции 

Функция ВидыОбразованияПоРазделамФРМР() Экспорт

	Результат = Новый Структура("ВидыОбщегоОбразования,ВидыОбразованияДающиеСпециальность,ВидыПослевузовскогоОбразования,ВидыДополнительногоОбразования");
	
	Результат.ВидыОбщегоОбразования = Новый Массив;
	Результат.ВидыОбщегоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.СреднееОбщееОбразование);
	Результат.ВидыОбщегоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ОсновноеОбщееОбразование);
	
	Результат.ВидыОбразованияДающиеСпециальность = Новый Массив;
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразование);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеБакалавриат);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации);
	Результат.ВидыОбразованияДающиеСпециальность.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеСпециалитетМагистратура);
	
	Результат.ВидыПослевузовскогоОбразования = Новый Массив;
	Результат.ВидыПослевузовскогоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ВысшееОбразованиеПодготовкаКадровВысшейКвалификации);
	Результат.ВидыПослевузовскогоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ПослевузовскоеОбразование);
	
	Результат.ВидыДополнительногоОбразования = Новый Массив;
	Результат.ВидыДополнительногоОбразования.Добавить(Справочники.ВидыОбразованияФизическихЛиц.ДополнительноеПрофессиональноеОбразование);
	
	Возврат Результат;
	
КонецФункции 

Процедура ЗаписатьЛогИзмененияОбъекта(ОбъектСсылка, СтараяПометкаУдаления, НоваяПометкаУдаления)
	НаборДляЛогирования = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	НаборДляЛогирования.Отбор.Объект.Установить(ОбъектСсылка);
	НаборДляЛогирования.Прочитать();
	// Если набор пустой, значит объект ещё не выгружался.
	// Записывать момент изменения для ещё не выгруженного объекта не нужно: объект будет выгружен, поскольку
	// для него не удастся подобрать строку в регистре ИдентификаторыОбъектовДляФедеральныхМедрегистров.
	// А если вдруг его создали в ФРМР через веб-интерфейс, то пусть и удаляют там же.
	Если НаборДляЛогирования.Количество() > 0 Тогда
		ЗаписьДляЛогирования = НаборДляЛогирования[0];
		// Пометка на удаление объекта ИБ.
		Если НоваяПометкаУдаления И Не СтараяПометкаУдаления Тогда 
			ЗаписьДляЛогирования.МоментУдаления = ТекущаяДатаСеанса();
		// Восстановление помеченного на удаление объекта ИБ.	
		ИначеЕсли Не НоваяПометкаУдаления И СтараяПометкаУдаления Тогда 
			ЗаписьДляЛогирования.МоментУдаления = Дата('00010101');
		// Изменение объекта ИБ. И для помеченных на удаление тоже, так как если до удаления из ФРМР пометка удаления в ИБ
		// будет снята, то будет понятно, что объект изменился и его надо выгрузить.
		Иначе 
			ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
		КонецЕсли;
		НаборДляЛогирования.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура МедицинскиеРегистрыЛогированиеПередЗаписью(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтараяПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ПометкаУдаления");
	НоваяПометкаУдаления = Источник.ПометкаУдаления;
	Если ТипЗнч(Источник)=Тип("СправочникОбъект.ОбразованиеФизическихЛиц") Тогда 
		СтарыйВидОбразованиея = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидОбразования");
		// !!! Тут надо сравнить не сами виды образования, и их "группы", по которым образования делятся на разделы при выгрузке в ФРМР.
		Если СтарыйВидОбразованиея<>Источник.ВидОбразования Тогда 
			НаборДляЛогирования = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборДляЛогирования.Отбор.Объект.Установить(Источник.Ссылка);
			НаборДляЛогирования.Прочитать();
			Если НаборДляЛогирования.Количество()=0 Тогда
				// Ничего пока не выгружали и не меняли, значит удалять нечего.
				ЗаписьДляЛогирования = НаборДляЛогирования.Добавить();
				ЗаписьДляЛогирования.Объект = Источник.Ссылка;
				ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
				НаборДляЛогирования.Записать();
			Иначе  
				ЗаписьДляЛогирования = НаборДляЛогирования[0];
				Если ПустаяСтрока(ЗаписьДляЛогирования.Идентификатор) Тогда
					// Изменения уже были раньше, но ничего не выгружали, значит и удалять нечего.
					ЗаписьДляЛогирования.МоментИзменения = ТекущаяДатаСеанса();
					НаборДляЛогирования.Записать();
				Иначе 
					// В записи лога устанавливаем момент удаления для образования со старым видом.
					// Так как удаление происходит в самом начале выгрузки, эта запись будет удалена из РС лога,
					// а дальше при определении идентификатора или после создания записи в ФРМР будет снова
					// создана для этого же образования и конфликта не будет.
					ЗаписьДляЛогирования.МоментУдаления = ТекущаяДатаСеанса();
					НаборДляЛогирования.Записать();
				КонецЕсли;
			КонецЕсли;
		Иначе 
			ЗаписатьЛогИзмененияОбъекта(Источник.Ссылка, СтараяПометкаУдаления, НоваяПометкаУдаления);
		КонецЕсли;
	Иначе
		ЗаписатьЛогИзмененияОбъекта(Источник.Ссылка, СтараяПометкаУдаления, НоваяПометкаУдаления);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура МедицинскиеРегистрыЛогированиеНабораПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;

	Если Источник.Количество() = 0
		Или РегистрыБЗК.ЭтоУдалениеНабораЗаписей(Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	МоментСобытия = ТекущаяДатаСеанса();
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.СертификатыПоСпециальностиФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыСертификатовДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.

		ОтборНаборов = РегистрыБЗК.ОтборыЗаписейНабора(Источник, Замещение);
		
		ФизическоеЛицо = Неопределено;
		Специальность = Неопределено;
		ДатаПолучения = Неопределено;
		Для Каждого ОтборНабора Из ОтборНаборов Цикл
			ФизическоеЛицо = ОтборНабора["ФизическоеЛицо"];
			Специальность = ОтборНабора["Специальность"];
			ДатаПолучения = ОтборНабора["ДатаПолучения"];
		КонецЦикла;
		
		НаборЛог = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Специальность) Тогда 
			НаборЛог.Отбор.Специальность.Установить(Специальность);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаПолучения) Тогда 
			НаборЛог.Отбор.ДатаПолучения.Установить(ДатаПолучения);
		КонецЕсли;
		
		НаборЛог.Прочитать();
		
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		
		НаборЛог.Записать();
	
		Для Каждого СтрокаИсточника Из Источник Цикл 
			
			НаборЛог = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Специальность.Установить(СтрокаИсточника.Специальность);
			НаборЛог.Отбор.ДатаПолучения.Установить(СтрокаИсточника.ДатаПолучения);
			
			НаборЛог.Прочитать();
			
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Специальность = СтрокаИсточника.Специальность;
				ЗаписьДляЛогирования.ДатаПолучения = СтрокаИсточника.ДатаПолучения;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			
			НаборЛог.Записать();
			
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.НаградыФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыНаградДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.
		НаборЛог = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(Источник.Отбор.ФизическоеЛицо.Значение) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(Источник.Отбор.ФизическоеЛицо.Значение);
		КонецЕсли;
		НаборЛог.Прочитать();
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		НаборЛог.Записать();
		
		Для Каждого СтрокаИсточника Из Источник Цикл 
			НаборЛог = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Награда.Установить(СтрокаИсточника.Награда);
			НаборЛог.Отбор.ДатаПриказа.Установить(СтрокаИсточника.ДатаПриказа);
			НаборЛог.Отбор.НомерПриказа.Установить(СтрокаИсточника.НомерПриказа);
			НаборЛог.Прочитать();
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Награда = СтрокаИсточника.Награда;
				ЗаписьДляЛогирования.ДатаПриказа = СтрокаИсточника.ДатаПриказа;
				ЗаписьДляЛогирования.НомерПриказа = СтрокаИсточника.НомерПриказа;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			НаборЛог.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник)=Тип("РегистрСведенийНаборЗаписей.СпециальностиФизическихЛиц") Тогда 
		
		УстановитьПривилегированныйРежим(Истина); // Для чтения/записи РС ИдентификаторыКвалификацийДляФедеральныхМедрегистров.
		// Так как в случае с РС отдельных событий удаления строк нет, сначала помечаем все строки как удаленные,
		// а потом уже будем переделывать в измененные те из них, которые содержатся в наборе-источнике.
		НаборЛог = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
		Если ЗначениеЗаполнено(Источник.Отбор.ФизическоеЛицо.Значение) Тогда 
			НаборЛог.Отбор.ФизическоеЛицо.Установить(Источник.Отбор.ФизическоеЛицо.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.Специальность.Значение) Тогда 
			НаборЛог.Отбор.Специальность.Установить(Источник.Отбор.Специальность.Значение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Источник.Отбор.Период.Значение) Тогда 
			НаборЛог.Отбор.ДатаПрисвоения.Установить(Источник.Отбор.Период.Значение);
		КонецЕсли;
		НаборЛог.Прочитать();
		Для Каждого ЗаписьЛога Из НаборЛог Цикл
			ЗаписьЛога.МоментУдаления = МоментСобытия;
		КонецЦикла;
		НаборЛог.Записать();
		
		Для Каждого СтрокаИсточника Из Источник Цикл 
			НаборЛог = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЛог.Отбор.ФизическоеЛицо.Установить(СтрокаИсточника.ФизическоеЛицо);
			НаборЛог.Отбор.Специальность.Установить(СтрокаИсточника.Специальность);
			НаборЛог.Отбор.ДатаПрисвоения.Установить(СтрокаИсточника.Период);
			НаборЛог.Прочитать();
			Если НаборЛог.Количество() = 0 Тогда
				ЗаписьДляЛогирования = НаборЛог.Добавить();
				ЗаписьДляЛогирования.ФизическоеЛицо = СтрокаИсточника.ФизическоеЛицо;
				ЗаписьДляЛогирования.Специальность = СтрокаИсточника.Специальность;
				ЗаписьДляЛогирования.ДатаПрисвоения = СтрокаИсточника.Период;
			Иначе
				ЗаписьДляЛогирования = НаборЛог[0];
			КонецЕсли;
			ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
			ЗаписьДляЛогирования.МоментУдаления = Неопределено;
			НаборЛог.Записать();
		КонецЦикла;
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ДокументыФизическихЛиц") Тогда 
		
		// Регистрировать удаление строк РС нет необходимости, так как в данном случае запись идёт не в лог регистра,
		// а в лог объекта - физического лица (в РС ИдентификаторыОбъектовДляФедеральныхМедрегистров), поскольку документы 
		// не выгружаются отдельным методом сервиса ФРМР, а перезаписываются полностью как часть основных данных медработника.
		УстановитьПривилегированныйРежим(Истина);
		Для Каждого СтрокаИсточника Из Источник Цикл 
		    Если СтрокаИсточника.ЯвляетсяДокументомУдостоверяющимЛичность Тогда 
				ОбъектСсылка = СтрокаИсточника.Физлицо;
				Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
				Набор.Отбор.Объект.Установить(ОбъектСсылка);
				Набор.Прочитать();
				Если Набор.Количество() = 0 Тогда
					ЗаписьДляЛогирования = Набор.Добавить();
					ЗаписьДляЛогирования.Объект = ОбъектСсылка;
				Иначе
					ЗаписьДляЛогирования = Набор[0];
				КонецЕсли;
				ЗаписьДляЛогирования.МоментИзменения = МоментСобытия;
				Набор.Записать();
			КонецЕсли;
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьРегистрыИдентификации() Экспорт

	Набор = РегистрыСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();
	Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();
	Набор = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Записать();

КонецПроцедуры

Функция РазархивироватьКлассификаторыМедРегистра(Знач Дескриптор, Знач ПутьКФайлу) Экспорт

	// Разархивируем файл
	ПутьККаталогуНаСервере = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(ПутьККаталогуНаСервере);
	
	Попытка
		ЧтениеZIP = Новый ЧтениеZipФайла(ПутьКФайлу);
		ЧтениеZIP.ИзвлечьВсе(ПутьККаталогуНаСервере, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		ЧтениеZIP.Закрыть();
		// Конец Разархивируем файл
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "ВЫБРАТЬ
		|	КлассификаторыМедРегистра.Код КАК Код
		|ИЗ
		|	Справочник.КлассификаторыМедРегистра КАК КлассификаторыМедРегистра";
		
		Результат = Новый Структура("Выборка,Каталог", Запрос.Выполнить().Выбрать(), ПутьККаталогуНаСервере);
		
		Возврат Результат; 
		
	Исключение
		ФайловаяСистема.УдалитьВременныйФайл(ПутьККаталогуНаСервере);
		ВызватьИсключение;
	КонецПопытки;

КонецФункции

#Область Настройки

// Возвращает структуру для параметра ПараметрыСервиса функций, выполняющих запросы к веб-сервисам ЕГИСЗ.
// 
// Возвращаемое значение:
//   Структура:
//     * ИспользоватьЗащищенноеСоединение - булево - Если Истина, должно создаваться защищенное соединение.
//     * Адрес - Строка - базовая часть адреса веб-сервиса (группы веб-сервисов).
//         Например, "ips-test.rosminzdrav.ru" - адрес тестового контура ЕГИСЗ. По умолчанию, пустая строка.
//     * Порт - Число - номер порта веб-сервиса ЕГИСЗ.
//         При установке в 0, номер порта при обращении к сервису не указывается (используется порт по умолчанию).
//         Например, 8443 - адрес для запроса через нестандартный порт. По умолчанию, 0.
//     * ТочкаДоступа - Строка - часть адресной строки для вызова конкретного вызова веб-сервиса.
//         Например, "/57234d87b0838" - для вызова сервиса запросов к ФРМО. По умолчанию, пустая строка.
//
Функция ПараметрыСервиса(Настройки = Неопределено) Экспорт
	Если Настройки = Неопределено Тогда 
		Настройки = ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	КонецЕсли;
	Если Настройки.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС Тогда
		Результат = ПараметрыСервисаИзАдреса(Настройки.АдресСервиса);
	ИначеЕсли Настройки.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.РегионЛокальный Тогда
		Результат = ПараметрыСервисаИзАдреса(Настройки.АдресСервиса1СМедицинаРегион);
	ИначеЕсли Настройки.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.РегионСервис1С Тогда
		Результат = ПараметрыСервисаИзАдреса(Настройки.АдресСервиса1СЕГИСЗ); 
	Иначе
		Результат = Неопределено; 
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ПараметрыСервисаИзАдреса(АдресСервиса)
	
	Параметры = СоздатьПустыеПараметрыСервиса();
	
	ПозицияРазделителяПротокола = СтрНайти(АдресСервиса, "://");
	Если ПозицияРазделителяПротокола=0 Тогда 
		Параметры.ИспользоватьЗащищенноеСоединение = Истина;
		АдресБезПротокола = СокрЛП(АдресСервиса);
	Иначе 
		ИмяПротокола = СокрЛП(Сред(АдресСервиса, 1, ПозицияРазделителяПротокола - 1));
		Параметры.ИспользоватьЗащищенноеСоединение = ?(ВРег(ИмяПротокола)="HTTP", Ложь, Истина);
		АдресБезПротокола = СокрЛП(Сред(АдресСервиса, ПозицияРазделителяПротокола + 3));
	КонецЕсли;
	
	ЧастиАдреса = СтрРазделить(АдресБезПротокола, "@", Ложь);
	Если ЧастиАдреса.Количество()>1 Тогда 
		ЧастиАвторизации = СтрРазделить(ЧастиАдреса[0], ":", Ложь); 
	    Параметры.Логин = РаскодироватьСтроку(ЧастиАвторизации[0], СпособКодированияСтроки.URLВКодировкеURL);
		Если ЧастиАвторизации.Количество()>1 Тогда 
			Параметры.Пароль = РаскодироватьСтроку(ЧастиАвторизации[1], СпособКодированияСтроки.URLВКодировкеURL);
		КонецЕсли;
		АдресБезПротокола = ЧастиАдреса[1];
	КонецЕсли;

	ЧастиАдреса = СтрРазделить(АдресБезПротокола, "/", Ложь);
	Если ЧастиАдреса.Количество()=1 Тогда 
		Параметры.Адрес = ЧастиАдреса[0];
		Параметры.ТочкаДоступа = "";
	Иначе 
		Параметры.Адрес = ЧастиАдреса[0];
	    ЧастиАдреса[0] = "";
		Параметры.ТочкаДоступа = СтрСоединить(ЧастиАдреса, "/");
	КонецЕсли;
		
	ЧастиАдреса = СтрРазделить(АдресБезПротокола, ":", Ложь);
	Если ЧастиАдреса.Количество()>1 Тогда 
	    Параметры.Адрес = ЧастиАдреса[0];
		ЧастиАдреса = СтрРазделить(ЧастиАдреса[1], "/", Ложь);
		Параметры.Порт = Число(ЧастиАдреса[0]);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции 

Функция СоздатьПустыеПараметрыСервиса() Экспорт
	ПустыеПараметры = Новый Структура;
	ПустыеПараметры.Вставить("ИспользоватьЗащищенноеСоединение", Неопределено);
	ПустыеПараметры.Вставить("Адрес", Неопределено);
	ПустыеПараметры.Вставить("Порт", Неопределено);
	ПустыеПараметры.Вставить("ТочкаДоступа", Неопределено);
	ПустыеПараметры.Вставить("Логин", Неопределено);
	ПустыеПараметры.Вставить("Пароль", Неопределено);
	Возврат ПустыеПараметры;
КонецФункции 

Функция СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами() Экспорт
	ПустыеНастройки = Новый Структура;
	ПустыеНастройки.Вставить("СпособПодключения", Неопределено);
	ПустыеНастройки.Вставить("АдресСервиса", Неопределено);
	ПустыеНастройки.Вставить("АдресСервиса1СМедицинаРегион", Неопределено);
	ПустыеНастройки.Вставить("АдресСервиса1СЕГИСЗ", Неопределено);
	ПустыеНастройки.Вставить("ИспользоватьПилотныйПроектПоЗП", Неопределено);
	ПустыеНастройки.Вставить("ИспользоватьАвтосопоставление1СЕГИСЗ", Неопределено);
	Возврат ПустыеНастройки;
КонецФункции 

Функция НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами() Экспорт
	Результат = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Результат.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС;
	Результат.АдресСервиса = "ips.rosminzdrav.ru/13e078133bbb4";
	Результат.АдресСервиса1СМедицинаРегион = "";
	Результат.АдресСервиса1СЕГИСЗ = "cert.1cfresh.com/a/medreg-frmo-frmr";
	Результат.ИспользоватьПилотныйПроектПоЗП = Ложь;
	Результат.ИспользоватьАвтосопоставление1СЕГИСЗ = Ложь;
	Возврат Результат;
КонецФункции 

Функция ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами() Экспорт

	Набор = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Настройки = Набор.Добавить();
		НастройкиПоУмолчанию = НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
		ЗаполнитьЗначенияСвойств(Настройки, НастройкиПоУмолчанию);
		Набор.Записать();
	Иначе
		Настройки = Набор[0];
	КонецЕсли;
	
	Результат = СоздатьПустыеНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	Результат.СпособПодключения = Настройки.СпособПодключения;
	Результат.АдресСервиса = Настройки.АдресСервиса;
	Результат.АдресСервиса1СМедицинаРегион = Настройки.АдресСервиса1СМедицинаРегион;
	Результат.АдресСервиса1СЕГИСЗ = Настройки.АдресСервиса1СЕГИСЗ;
	Результат.ИспользоватьПилотныйПроектПоЗП = Настройки.ИспользоватьПилотныйПроектПоЗП;
	Результат.ИспользоватьАвтосопоставление1СЕГИСЗ = Настройки.ИспользоватьАвтосопоставление1СЕГИСЗ;
	Возврат Результат;

КонецФункции

Процедура СохранитьНастройкиВзаимодействияСФедеральнымиМедрегистрами(НастройкиВзаимодействияСФедеральнымиМедрегистрами) Экспорт

	Набор = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		Настройки = Набор.Добавить();
		НастройкиПоУмолчанию = НастройкиПоУмолчаниюВзаимодействияСФедеральнымиМедрегистрами();
		ЗаполнитьЗначенияСвойств(Настройки, НастройкиПоУмолчанию);
	Иначе
		Настройки = Набор[0];
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.СпособПодключения<>Неопределено Тогда 
		Настройки.СпособПодключения = НастройкиВзаимодействияСФедеральнымиМедрегистрами.СпособПодключения;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса<>Неопределено Тогда 
		Настройки.АдресСервиса = НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса1СМедицинаРегион<>Неопределено Тогда 
		Настройки.АдресСервиса1СМедицинаРегион = НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса1СМедицинаРегион;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса1СЕГИСЗ<>Неопределено Тогда 
		Настройки.АдресСервиса1СЕГИСЗ = НастройкиВзаимодействияСФедеральнымиМедрегистрами.АдресСервиса1СЕГИСЗ;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьПилотныйПроектПоЗП<>Неопределено Тогда 
		Настройки.ИспользоватьПилотныйПроектПоЗП = НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьПилотныйПроектПоЗП;
	КонецЕсли;
	Если НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьАвтосопоставление1СЕГИСЗ<>Неопределено Тогда 
		Настройки.ИспользоватьАвтосопоставление1СЕГИСЗ = НастройкиВзаимодействияСФедеральнымиМедрегистрами.ИспользоватьАвтосопоставление1СЕГИСЗ;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

Функция СоздатьПустыеНастройкиОрганизации() Экспорт
	ПустыеНастройки = Новый Структура;
	ПустыеНастройки.Вставить("Токен", Неопределено);
	ПустыеНастройки.Вставить("ИдентификаторИнформационнойСистемы", Неопределено);
	ПустыеНастройки.Вставить("ИдентификаторДляМедрегистров", Неопределено);
	ПустыеНастройки.Вставить("Сертификат", Неопределено);
	ПустыеНастройки.Вставить("ЗагружатьИз1СФНСИ", Неопределено);
	Возврат ПустыеНастройки;
КонецФункции 

Процедура СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации) Экспорт

	Набор = РегистрыСведений.СведенияОбОрганизацииДляМедРегистра.СоздатьНаборЗаписей();
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		ДополнительныеСведения = Набор.Добавить();
		ДополнительныеСведения.Организация = Организация;
	Иначе
		ДополнительныеСведения = Набор[0];
	КонецЕсли;
	Если НастройкиОрганизации.Токен<>Неопределено Тогда 
		ДополнительныеСведения.Токен = НастройкиОрганизации.Токен;
	КонецЕсли;
	Если НастройкиОрганизации.ИдентификаторДляМедрегистров<>Неопределено Тогда 
		ДополнительныеСведения.ИдентификаторДляМедрегистров = НастройкиОрганизации.ИдентификаторДляМедрегистров;
	КонецЕсли;
	Если НастройкиОрганизации.ИдентификаторИнформационнойСистемы<>Неопределено Тогда 
		ДополнительныеСведения.ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
	КонецЕсли;
	Если НастройкиОрганизации.Сертификат<>Неопределено Тогда 
		ДополнительныеСведения.Сертификат = НастройкиОрганизации.Сертификат;
	КонецЕсли;
	Если НастройкиОрганизации.ЗагружатьИз1СФНСИ<>Неопределено Тогда 
		ДополнительныеСведения.ЗагружатьИз1СФНСИ = НастройкиОрганизации.ЗагружатьИз1СФНСИ;
	КонецЕсли;
	Набор.Записать();

КонецПроцедуры

Функция ПолучитьНастройкиОрганизации(Организация) Экспорт
	
	НастройкиОрганизации = СоздатьПустыеНастройкиОрганизации();
	СведенияОбОрганизации = РегистрыСведений.СведенияОбОрганизацииДляМедРегистра.Выбрать(Новый Структура("Организация", Организация));
	Если СведенияОбОрганизации.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НастройкиОрганизации, СведенияОбОрганизации);
	КонецЕсли;
	
	Возврат НастройкиОрганизации;
	
КонецФункции 

#КонецОбласти

#Область ЗагрузкаКлассификаторовМедРегистра

// Процедура загружает из внешнего архива ZIP в Справочник.
//
// Параметры:
//    ПараметрыЗагрузки - Структура - параметры для загрузки.
//    АдресХранилища    - Строка    - адрес внутреннего хранилища.
//
Процедура ЗагрузитьКлассификаторыМедРегистраИзАрхива(ПараметрыЗагрузки, АдресХранилища) Экспорт
		
	КодыКлассификаторов   = ПараметрыЗагрузки[0];	// Массив кодов регионов для загрузки.
	ОписаниеФайлов = ПараметрыЗагрузки[1];	// Массив структур описаний переданных файлов.
	
	// Создаем Временные Файлы
	// Извлекаем файлы, все имена файлов - в верхнем регистре.
	РабочийКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(РабочийКаталог);
	
	Описание = ОписаниеФайлов[0];
	// Имена файлов должны быть всегда в верхнем  регистре.
	Файл = Новый Файл(Описание.Имя);
	ИмяФайла = РабочийКаталог + ВРег(Файл.Имя);
	
	Данные = ?(ТипЗнч(Описание.Хранение) = Тип("Строка"), ПолучитьИзВременногоХранилища(Описание.Хранение), Описание.Хранение);
	Данные.Записать(ИмяФайла);
	
	// Распаковываем, оригинал удалится вместе с рабочим каталогом.
	ЧтениеZIP = Новый ЧтениеZipФайла(ИмяФайла);
	ЧтениеZIP.ИзвлечьВсе(РабочийКаталог, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
	ЧтениеZIP.Закрыть();
	
	ЗагрузитьКлассификаторыМедРегистраИзФайловВСправочник(КодыКлассификаторов, РабочийКаталог);
	
	РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.УстановитьХарактеристикиОбъектовПоКодамКлассификаторов(КодыКлассификаторов);

КонецПроцедуры

// Процедура загружает из внешних файлов в Справочник.
//
// Параметры:
//    ПараметрыЗагрузки - Структура - параметры для загрузки.
//    АдресХранилища    - Строка    - адрес внутреннего хранилища.
//
Процедура ЗагрузитьКлассификаторыМедРегистраИзКаталога(ПараметрыЗагрузки, АдресХранилища) Экспорт
		
	КодыКлассификаторов   = ПараметрыЗагрузки[0];	// Массив кодов регионов для загрузки.
	ОписаниеФайлов = ПараметрыЗагрузки[1];	// Массив структур описаний переданных файлов.
	
	// Создаем Временные Файлы
	// Извлекаем файлы, все имена файлов - в верхнем регистре.
	РабочийКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
	СоздатьКаталог(РабочийКаталог);
		
	Для Каждого Описание Из ОписаниеФайлов Цикл
		// Имена файлов должны быть всегда в верхнем  регистре.
		Файл = Новый Файл(Описание.Имя);
		ИмяФайла = РабочийКаталог + ВРег(Файл.Имя);
		
		Данные = ?(ТипЗнч(Описание.Хранение) = Тип("Строка"), ПолучитьИзВременногоХранилища(Описание.Хранение), Описание.Хранение);
		Данные.Записать(ИмяФайла);
		
	КонецЦикла;
	
	ЗагрузитьКлассификаторыМедРегистраИзФайловВСправочник(КодыКлассификаторов, РабочийКаталог);
	
	РегистрыСведений.ХарактеристикиОбъектовПоМедРегистру.УстановитьХарактеристикиОбъектовПоКодамКлассификаторов(КодыКлассификаторов);
	
КонецПроцедуры

// Процедура загружает из внешних файлов в Справочник.
//
// Параметры:
//    ПараметрыЗагрузки - Структура - параметры для загрузки.
//    АдресХранилища    - Строка    - адрес внутреннего хранилища.
//
Процедура ЗагрузитьКлассификаторыМедРегистраИзФайловВСправочник(КодыКлассификаторов, РабочийКаталог) 
	
	СообщениеПользователю = "";
	ЕстьОшибки = Ложь;
	
	Попытка
		
		Для Каждого КодОбъекта Из КодыКлассификаторов Цикл
			
			ИмяФайла = РабочийКаталог + ИмяУзлаПоНаименованиюКлассификатора(КодОбъекта) + ".xml";
    	    Файл = Новый Файл(ИмяФайла);
			
			Если Не Файл.Существует() Тогда
				
				СообщениеПользователю = 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Файл не найден: %1.'"),
						Файл.Имя);
				
				ВызватьИсключение СообщениеПользователю; 
				
			КонецЕсли;
			
			ЗагрузитьКлассификаторМедРегистраПоИмени(КодОбъекта, РабочийКаталог);
			
		КонецЦикла;
		
	Исключение
		
		Информация = ИнформацияОбОшибке();
		СообщениеПользователю = ПодробноеПредставлениеОшибки(Информация);
		
		// Устанавливаем флаг для вызова исключения чтобы фоновое задание завершилось аварийно
		// и форма смогла обработать ошибку.
		ЕстьОшибки = Истина;
		
	КонецПопытки;
	
	// И чистим за собой
	Попытка
		УдалитьФайлы(РабочийКаталог);
	Исключение
		// Обработка не требуется, файлы будут удалены позднее.
	КонецПопытки;
	
	// Вызываем исключение чтобы фоновое задание завершилось аварийно
	// и форма смогла обработать ошибку.
	Если ЕстьОшибки Тогда
		
		ВызватьИсключение СообщениеПользователю;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ИмяУзлаПоНаименованиюКлассификатора(Наименование)
	
	Возврат СтрЗаменить(Наименование, "ArrayOf", "");
	
КонецФункции 

// Функция строит дерево значений из таблицы значений.
// Передаваемые параметры:
// ИсходнаяТаблица - таблица, которую следует преобразовать в дерево.
// 	* КолонкаID - строка - наименование колонки-идентификатора.
// 	* КолонкаParent - строка - наименование колонки-родителя.
// Возвращаемое значение
//   Дерево значений.
//
Функция ДеревоИзТаблицыЭлементов(ИсходнаяТаблица, КолонкаID="ID", КолонкаParent="Parent")
	
	ИсходнаяТаблица.Колонки.Добавить("ПолеСортировки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10) ) );
	Для Каждого строка Из ИсходнаяТаблица Цикл
		строка.ПолеСортировки = Прав("00000"+СокрЛП(Строка[КолонкаParent]), 5);
	КонецЦикла;
	
	ИсходнаяТаблица.Сортировать("ПолеСортировки Возр");
	ДеревоРезультатов = Новый ДеревоЗначений; 
	Для Каждого Колонка Из ИсходнаяТаблица.Колонки Цикл
		Если Колонка.Имя = КолонкаParent Тогда
			Продолжить;
		КонецЕсли;
		ДеревоРезультатов.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		Если СтрокаРодитель = Неопределено Тогда
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
		Иначе
			СтрокаДерева = СтрокаРодитель.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);

	КонецЦикла;
	
	// Еще раз пробежаться по таблице в ситуации когда Код родителя > кода элемента
	// тогда возможна ситуация с потерянными строками.
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		СтрокаДерева    = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаID], КолонкаID, Истина);
		
		Если СтрокаДерева = Неопределено Тогда
			
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);
			
		КонецЕсли; 
		
		Если Не СтрокаДерева.Родитель = СтрокаРодитель Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРодитель.Строки.Добавить(), СтрокаТаблицы);
			ДеревоРезультатов.Строки.Удалить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
   Возврат ДеревоРезультатов;
   
КонецФункции

Функция ОписаниеВозможныхПолейУзла()
	
	СтруктураКолонок = Новый Структура;	
	СтруктураКолонок.Вставить("ID"		,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	СтруктураКолонок.Вставить("Name"	,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254)));
	СтруктураКолонок.Вставить("Parent"	,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	СтруктураКолонок.Вставить("Order"	,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	СтруктураКолонок.Вставить("OUZ"		,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254)));
	СтруктураКолонок.Вставить("KLADR"	,Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(13)));
   
	Возврат СтруктураКолонок;
	
КонецФункции	

// Читает XML КлассификатораМедРегистра в ТаблицуЗначения.
//
Функция ДанныеФайлаXMLКлассификатораМедРегистра(ИмяКлассификатора, ПутьКДаннымНаСервере)
	
	ИмяСвойства = ИмяУзлаПоНаименованиюКлассификатора(ИмяКлассификатора);
	ФайлКлассификатора = ПутьКДаннымНаСервере + ИмяСвойства + ".xml";
	
	ОписанияПолей = ОписаниеВозможныхПолейУзла(); 
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлКлассификатора);
	
	ЧтениеXML.Прочитать();
	ИмяКлассификатораXML = ЧтениеXML.Имя;
	Если ЧтениеXML.Имя <> ИмяКлассификатора Тогда
		ЧтениеXML.Закрыть();
		Возврат -1;
	КонецЕсли;
	
	ДеревоXML = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
		
	УдалитьФайлы(ФайлКлассификатора);
	
	СвойстваОбъектаXDTO = ДеревоXML.Свойства();
	Если СвойстваОбъектаXDTO.Получить(ИмяСвойства) = Неопределено Тогда
		Возврат -1;
	КонецЕсли;
	
	СписокXDTO = ДеревоXML.ПолучитьСписок(ИмяСвойства);
	СвойстваОбъектаXDTO = СписокXDTO[0].Свойства();
	
	ДанныеФайлаXML = Новый ТаблицаЗначений;
	Для Каждого СвойствоСписка Из СвойстваОбъектаXDTO Цикл
		ИмяКолонки = СвойствоСписка.Имя;
		ТипКолонки = ОписанияПолей[ИмяКолонки];
		ДанныеФайлаXML.Колонки.Добавить(ИмяКолонки, ТипКолонки);
	КонецЦикла;
	
	Для Каждого ОбъектXDTO Из СписокXDTO Цикл
		ЗаполнитьЗначенияСвойств(ДанныеФайлаXML.Добавить(), ОбъектXDTO);
	КонецЦикла;
	
	Возврат ДанныеФайлаXML;

КонецФункции 

// Возвращает ссылку на элемент справочника.
//
Функция СохранитьЭлементСправочникЭлементыКлассификаторовМедРегистра(Данные, Владелец, Родитель, ЭтоГруппа)
	
	Если Данные.Наименование = Данные.НаименованиеЭлементаСправочника И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Возврат Данные.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		
		ОбъектСправочника = Данные.Ссылка.ПолучитьОбъект();
		
	ИначеЕсли ЭтоГруппа Тогда
		
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовМедРегистра.СоздатьГруппу();
		
	Иначе
		
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовМедРегистра.СоздатьЭлемент();
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектСправочника, Данные, "Код,Наименование");
	ОбъектСправочника.Родитель = Родитель;
	ОбъектСправочника.Владелец = Владелец;
	
	ОбъектСправочника.ОбменДанными.Загрузка = Истина;
	
	ОбъектСправочника.Записать();
	
	Возврат ОбъектСправочника.Ссылка;
	
КонецФункции

Процедура СохранитьИерархическиеДанныеСправочникЭлементыКлассификаторовМедРегистра(КоллекцияДанных, Владелец, Родитель)
	
	Для Каждого СтрокаДанных Из КоллекцияДанных Цикл
		
		ПодчиненныеСтроки = СтрокаДанных.Строки;
		ЭтоГруппа = ПодчиненныеСтроки.Количество()>0;
		
		Ссылка = СохранитьЭлементСправочникЭлементыКлассификаторовМедРегистра(СтрокаДанных, Владелец, Родитель, ЭтоГруппа);
		
		Если ЭтоГруппа Тогда
			
			СохранитьИерархическиеДанныеСправочникЭлементыКлассификаторовМедРегистра(ПодчиненныеСтроки, Владелец, Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Переносим значения из таблицы в Справочник.
Процедура СохранитьДанныеВСправочникЭлементыКлассификаторовМедРегистра(ТаблицаДанных, Владелец, Родитель, ЕстьИерархия)

	Запрос = Новый Запрос;
	
	Если ЕстьИерархия Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Таблица.ID КАК Код,
		|	Таблица.Name КАК Наименование,
		|	Таблица.Parent КАК Родитель
		|ПОМЕСТИТЬ ВТТаблица
		|ИЗ
		|	&ТЗ КАК Таблица";
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		|	Таблица.ID КАК Код,
		|	Таблица.Name КАК Наименование,
		|	ВЫРАЗИТЬ("""" КАК Строка(10)) КАК Родитель
		|ПОМЕСТИТЬ ВТТаблица
		|ИЗ
		|	&ТЗ КАК Таблица";
		
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Код,
	|	Таблица.Наименование,
	|	Таблица.Родитель,
	|	Таблица.КоличествоПодчиненных,
	|	ЕСТЬNULL(ЭлементыСправочника.Ссылка, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовМедРегистра.ПустаяСсылка)) КАК Ссылка,
	|	ЕСТЬNULL(ЭлементыСправочника.Наименование, ВЫРАЗИТЬ("""" КАК Строка(150))) КАК НаименованиеЭлементаСправочника
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Код КАК Код,
	|		Таблица.Наименование КАК Наименование,
	|		Таблица.Родитель КАК Родитель,
	|		КОЛИЧЕСТВО(ТаблицаПодчиненных.Код) КАК КоличествоПодчиненных
	|	ИЗ
	|		ВТТаблица КАК Таблица
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблица КАК ТаблицаПодчиненных
	|			ПО Таблица.Код = ТаблицаПодчиненных.Родитель
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Таблица.Код,
	|		Таблица.Наименование,
	|		Таблица.Родитель) КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовМедРегистра КАК ЭлементыСправочника
	|		ПО (ЭлементыСправочника.Владелец = &Владелец)
	|			И (ЭлементыСправочника.Код = Таблица.Код)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаДанных);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЕстьИерархия Тогда
		
		ДеревоЗначений = ДеревоИзТаблицыЭлементов(РезультатЗапроса.Выгрузить(), "Код", "Родитель");
		
		СохранитьИерархическиеДанныеСправочникЭлементыКлассификаторовМедРегистра(ДеревоЗначений.Строки, Владелец, Справочники.ЭлементыКлассификаторовМедРегистра.ПустаяСсылка());
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока выборка.Следующий() Цикл
			
			СохранитьЭлементСправочникЭлементыКлассификаторовМедРегистра(Выборка, Владелец, Родитель, Ложь);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Загружает Данные из xml в справочник "ЭлементыКлассификаторовМедРегистра".
//
Функция ЗагрузитьКлассификаторМедРегистраПоИмени(ИмяКлассификатора, ПутьКДаннымНаСервере)
	
	// Читаем xml
	ДанныеФайлаXML = ДанныеФайлаXMLКлассификатораМедРегистра(ИмяКлассификатора, ПутьКДаннымНаСервере);
	
	// Сохраняем значения
	ЕстьИерархия = ДанныеФайлаXML.Колонки.Найти("Parent") <> Неопределено;
	Родитель = Неопределено;
	Владелец = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.КлассификаторыМедРегистра." + ИмяКлассификатора);
	
	СохранитьДанныеВСправочникЭлементыКлассификаторовМедРегистра(ДанныеФайлаXML, Владелец, Родитель, ЕстьИерархия);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

Функция ИдентификаторРегистрационныхДанных1СМедицинаРегион() Экспорт
	
	Возврат "РегистрационныеДанные1СМедицинаРегион";
	
КонецФункции

Функция ИдентификаторКлючаДоступа1СМедицинаРегион(ОрганизацияСсылка) Экспорт
	
	Возврат "КлючДоступа1СМедицинаРегион-" + ОрганизацияСсылка.УникальныйИдентификатор();
	
КонецФункции

Функция JSONВДанные(СообщениеJSON) Экспорт
	
	Если Не ЗначениеЗаполнено(СообщениеJSON) Тогда
		Возврат Новый Структура;
	КонецЕсли;

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СообщениеJSON);
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти