#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяФормыНастройкиФинансовогоУчета() Экспорт
	
	Возврат "ОбщаяФорма.ОрганизацияФинансовыйУчет";
	
КонецФункции

Процедура ОткрытьФормуНастройкиФинансовогоУчета(ФормаВладелец, СотрудникСсылка) Экспорт
	
	ДополнительныеПараметры = Новый Структура("ФормаВладелец, ЗаписатьЭлемент", ФормаВладелец, Истина);
	Если ФормаВладелец.СозданиеНового И Не ЗначениеЗаполнено(ФормаВладелец.Сотрудник.Ссылка) Тогда
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Переход к сведениям о финансовом учете возможен только после записи данных.
				|Данные будут записаны.'");
		Оповещение = Новый ОписаниеОповещения("ФинансовыйУчетЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ДополнительныеПараметры.ЗаписатьЭлемент = Ложь;
		ФинансовыйУчетЗавершение(Неопределено, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ФинансовыйУчетОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник, ИмяОбъектаУчета = "ОбъектФинансовогоУчета") Экспорт
	
	Если Не (ИмяСобытия = "ОтредактированаИстория"
		И (Параметр.ИмяРегистра = "ФинансовыйУчетПодразделений" Или Параметр.ИмяРегистра = "ФинансовыйУчетПозицийКадровогоПлана"
			Или Параметр.ИмяРегистра = "ФинансовыйУчетСотрудников")
		И Форма[ИмяОбъектаУчета] = Источник) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если Не Форма[Параметр.ИмяРегистра + "НаборЗаписейПрочитан"] Тогда
		Возврат;
	КонецЕсли;
	
	РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(
		Форма, Форма[ИмяОбъектаУчета], ИмяСобытия, Параметр, Источник);
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(
		Форма, ОбщегоНазначенияКлиент.ДатаСеанса(), Параметр.ИмяРегистра, ИмяОбъектаУчета);
	ОбработатьОповещениеОбъектаУчета(Форма, Параметр.ИмяРегистра);
	
КонецПроцедуры

Процедура ОткрытьФормуСпискаСотрудниковРаботающихВПериодеПоПараметрам(
	Форма, ВладелецФормыВыбора, НачалоПериода, ОкончаниеПериода, МножественныйВыбор = Истина, ЭтоПодбор = Ложь) Экспорт
	
	Объект = Форма.Объект;
	ПараметрыОткрытия = Неопределено;
	ОрганизацияОтбор = Неопределено;
	ПодразделениеОтбор = Неопределено;
	АдресСотрудников = "";
	
	Если ЭтоПодбор Тогда
		АдресСотрудников = Форма.АдресСпискаПодобранныхСотрудников();
	КонецЕсли;
	
	Если Форма.СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц Тогда
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Отбор", Новый Структура);
			ПараметрыОткрытия.Отбор.Вставить("МестоВСтруктуреПредприятия",
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Подразделение));
		КонецЕсли;
	Иначе
		ОрганизацияОтбор = ?(Форма.ЭтоПодразделение, Неопределено, Форма.ИсточникПодразделенияПредприятия);
		ПодразделениеОтбор = ?(Форма.ЭтоПодразделение, Форма.ИсточникПодразделенияПредприятия, Неопределено);
	КонецЕсли;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихВПериодеПоПараметрамОткрытияФормыСписка(
		ВладелецФормыВыбора,
		ОрганизацияОтбор, 
		ПодразделениеОтбор,
		НачалоПериода, 
		ОкончаниеПериода,
		МножественныйВыбор, 
		АдресСотрудников,
		ПараметрыОткрытия);
	
КонецПроцедуры

#Область Подразделения

Процедура ПодразделенияОткрытьФормуРедактированияИстории(Форма) Экспорт
	ОткрытьФормуРедактированияИстории(Форма);
КонецПроцедуры

Процедура ПодразделенияПериодСтрокойПриИзменении(Форма) Экспорт
	ПериодСтрокойПриИзменении(Форма);
КонецПроцедуры

Процедура ПодразделенияПериодСтрокойНачалоВыбора(Форма) Экспорт
	ПериодСтрокойНачалоВыбора(Форма);
КонецПроцедуры

Процедура ПодразделенияПериодСтрокойРегулирование(Форма, Направление) Экспорт
	ПериодСтрокойРегулирование(Форма, Направление);
КонецПроцедуры

Процедура ПодразделенияВариантПриИзменении(Форма) Экспорт
	ВариантПриИзменении(Форма);
КонецПроцедуры

Процедура ПодразделенияРаспределениеПриОкончанииРедактирования(Форма) Экспорт
	РаспределениеПриОкончанииРедактирования(Форма);
КонецПроцедуры

Процедура ПодразделенияСпособОтраженияВФинансовомУчетеПриИзменении(Форма) Экспорт
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(Форма, ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область ПозицииКадровогоПлана

Процедура ПозицииКадровогоПланаОткрытьФормуРедактированияИстории(Форма) Экспорт
	ОткрытьФормуРедактированияИстории(Форма, "ФинансовыйУчетПозицийКадровогоПлана", "Позиция");
КонецПроцедуры

Процедура ПозицииКадровогоПланаПериодСтрокойПриИзменении(Форма) Экспорт
	ПериодСтрокойПриИзменении(Форма, "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ПозицииКадровогоПланаПериодСтрокойНачалоВыбора(Форма) Экспорт
	ПериодСтрокойНачалоВыбора(Форма, "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ПозицииКадровогоПланаПериодСтрокойРегулирование(Форма, Направление) Экспорт
	ПериодСтрокойРегулирование(Форма, Направление, "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ПозицииКадровогоПланаВариантПриИзменении(Форма) Экспорт
	ВариантПриИзменении(Форма, "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ПозицииКадровогоПланаРаспределениеПриОкончанииРедактирования(Форма) Экспорт
	РаспределениеПриОкончанииРедактирования(Форма, "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ПозицииКадровогоПланаСпособОтраженияВФинансовомУчетеПриИзменении(Форма) Экспорт
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(Форма, ОбщегоНазначенияКлиент.ДатаСеанса(), "ФинансовыйУчетПозицийКадровогоПлана");
КонецПроцедуры

Процедура ЗапроситьРежимИзмененияФинансовогоУчета(Форма, ДополнительныеПараметры) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,
		"ДоступноРедактированиеФинансовыйУчетПозицийКадровогоПлана") Тогда
		
		Форма.ЗаписатьНаКлиентеЗавершение(Ложь, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если Не Форма.ДоступноРедактированиеФинансовыйУчетПозицийКадровогоПлана Или Форма.ФинансовыйУчетВариантНастройки = 2 Тогда
		Форма.ЗаписатьНаКлиентеЗавершение(Ложь, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	Если Форма.ФинансовыйУчетВариантНастройки = 0 Тогда
		Форма.ФинансовыйУчетПозицийКадровогоПлана.СпособОтражения = "";
	КонецЕсли;
	
	Если Форма.ФинансовыйУчетВариантНастройкиПрежняя = 2 Тогда
		Форма.ЗаписатьНаКлиентеЗавершение(Ложь, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru =  'При редактировании Вы изменили финансовый учет для позиции кадрового плана. 
		|Если Вы просто исправили прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
		|Если финансовый учет позиции изменился с %1, нажмите ""Изменился финансовый учет""'"), 
	Формат(Форма.ФинансовыйУчетПозицийКадровогоПлана.Период, "ДФ='д ММММ гггг ""г""'"));
	ТекстКнопкиДа = НСтр("ru = 'Изменился финансовый учет'");
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНаКлиентеЗавершение", Форма, ДополнительныеПараметры);
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(
		Форма, "ФинансовыйУчетПозицийКадровогоПлана", ТекстВопроса, ТекстКнопкиДа, Ложь, Оповещение);
	
КонецПроцедуры

#КонецОбласти

Процедура ПериодСтрокойАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

Процедура ПериодСтрокойОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуРедактированияИстории(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений", ИмяИзмерения = "Подразделение")
	
	ПараметрыФормы = Новый Структура("МассивЗаписей,ВедущийОбъект,ТолькоПросмотр");
	ПараметрыФормы.МассивЗаписей = Форма.Подключаемый_МассивЗаписейИсторииФинансовогоУчета();
	ПараметрыФормы.ВедущийОбъект = Форма.ОбъектФинансовогоУчета;
	ПараметрыФормы.ТолькоПросмотр = Форма.ТолькоПросмотр;
	ПараметрыФормы.Вставить("ИмяРегистра", ИмяРегистра);
	ПараметрыФормы.Вставить("ИмяИзмерения", ИмяИзмерения);
	Если ИмяРегистра = "ФинансовыйУчетПозицийКадровогоПлана" Тогда
		ПараметрыФормы.Вставить("Подразделение", Форма.Объект.Подразделение);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.РедактированиеИсторииСРаспределениемФинансовыйУчет", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ПериодСтрокойПриИзменении(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений")
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(Форма, ИмяРегистра + ".Период", ИмяРегистра + "ПериодСтрокой", Форма.Модифицированность);
КонецПроцедуры

Процедура ПериодСтрокойНачалоВыбора(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений")
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(Форма, Форма, ИмяРегистра + ".Период", ИмяРегистра + "ПериодСтрокой");
КонецПроцедуры

Процедура ПериодСтрокойРегулирование(Форма, Направление, ИмяРегистра = "ФинансовыйУчетПодразделений")
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(Форма, ИмяРегистра + ".Период", ИмяРегистра + "ПериодСтрокой", Направление, Форма.Модифицированность);
КонецПроцедуры

Процедура ВариантПриИзменении(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений")
	
	СтруктураЗаписи = Новый Структура("СпособОтражения,ДоляРаспределения,ИдентификаторСтроки");
	Если Форма.ФинансовыйУчетВариантНастройки = 0 Тогда
		ЗаполнитьЗначенияСвойств(Форма[ИмяРегистра], СтруктураЗаписи);
		Форма[ИмяРегистра + "Распределение"].Очистить();
	ИначеЕсли Форма.ФинансовыйУчетВариантНастройки = 1 Тогда
		Форма[ИмяРегистра + "Распределение"].Очистить();
	Иначе
		ЗаполнитьЗначенияСвойств(Форма[ИмяРегистра], СтруктураЗаписи);
	КонецЕсли;
	
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма);
	
КонецПроцедуры

Процедура РаспределениеПриОкончанииРедактирования(Форма, ИмяРегистра = "ФинансовыйУчетПодразделений")
	
	Если Форма[ИмяРегистра + "Распределение"].Количество() > 0
		И Не ЗначениеЗаполнено(Форма[ИмяРегистра].Период) Тогда
		
		ЕстьДатаСоздания = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ДатаСоздания");
		Если ЕстьДатаСоздания И ЗначениеЗаполнено(Форма.Объект.ДатаСоздания) Тогда
			Форма[ИмяРегистра].Период = НачалоМесяца(Форма.Объект.ДатаСоздания);
		Иначе
			Форма[ИмяРегистра].Период = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
		КонецЕсли;
		
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(Форма, ИмяРегистра + ".Период", ИмяРегистра + "ПериодСтрокой");
	КонецЕсли;
	
КонецПроцедуры

Процедура ФинансовыйУчетЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ФормаВладелец = ДополнительныеПараметры.ФормаВладелец;
	
	Если ДополнительныеПараметры.ЗаписатьЭлемент И Не ФормаВладелец.Записать() Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникиКлиент.ОткрытьДополнительнуюФорму(
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы("ОбщаяФорма.СотрудникиФинансовыйУчет"), ФормаВладелец, Истина);
	
КонецПроцедуры

Процедура ОбработатьОповещениеОбъектаУчета(Форма, ИмяРегистра)
	
	Если ИмяРегистра = "ФинансовыйУчетСотрудников" Тогда
		Возврат;
	КонецЕсли;
	
	Форма[ИмяРегистра + "Распределение"].Очистить();
	Если Форма[ИмяРегистра + "НаборЗаписей"].Количество() > 0 Тогда
		ПоследняяЗапись = Форма[ИмяРегистра + "НаборЗаписей"][Форма[ИмяРегистра + "НаборЗаписей"].Количество()-1];
		Отбор = Новый Структура("Период", ПоследняяЗапись.Период);
		ПоследниеЗаписи = Форма[ИмяРегистра + "НаборЗаписей"].НайтиСтроки(Отбор);
		Если ПоследниеЗаписи.Количество() > 1 Тогда
			Для каждого ЗаписьНабора Из ПоследниеЗаписи Цикл
				ЗаполнитьЗначенияСвойств(Форма[ИмяРегистра + "Распределение"].Добавить(),ЗаписьНабора);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаУстановитьВариантНастройки(Форма, ИмяРегистра);
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(Форма);

КонецПроцедуры

#КонецОбласти