///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет обработку нажатия команд панели Помощь.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
//  Команда - Произвольный - сработавшая команда, либо элемент, вызвавший событие.
//  Обработано - Булево - служебный параметр, используется в типовой форме.
//    Будет установлено в Истина, если команда успешно обработана.
//
Процедура ВыполнитьКоманду(Форма, Команда, Обработано = Ложь) Экспорт

	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, Форма);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипКоманды = Эталон.БИП_ПанельПомощьПараметры.Команды.Получить(Команда.Имя);
	Если ТипКоманды = Неопределено Тогда
		
		Возврат;
		
	ИначеЕсли ТипКоманды = "СообщениеВТехПоддержку" Тогда
		
		СообщениеВТехПоддержку(Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела);
		Обработано = Истина;
		
	ИначеЕсли ТипКоманды = "Коннект" Тогда
		
		Коннект();
		Обработано = Истина;
		
	ИначеЕсли ТипКоманды = "Пожелания" Тогда
		
		Пожелания(Эталон.БИП_ПанельПомощьПараметры);
		Обработано = Истина;
		
	ИначеЕсли ТипКоманды = "ИзвестныеОшибки" Тогда
		
		ОткрытьНавигационнуюСсылкуСПереопределением(
			Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ИзвестныеОшибки,
			"ИзвестныеОшибки");
		Обработано = Истина;
		
	ИначеЕсли ТипКоманды = "Справка" Тогда
		
		ОткрытьСправку();
		Обработано = Истина;
	
	ИначеЕсли ТипКоманды = "ВыборИсточникаПоиска" Тогда
	
		ВыбратьИсточникПоиска(
			Форма,
			Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела,
			Эталон.БИП_ПанельПомощьПараметры.ТекущийИсточник);
		Обработано = Истина;
	
	ИначеЕсли ТипКоманды = "Поиск" Тогда
	
		ВыполнитьПоиск(Форма, Эталон.БИП_ПанельПомощьПараметры);
		Обработано = Истина;
	
	ИначеЕсли ТипКоманды = "Карточка" Тогда
		
		КарточкаНажатие(Форма, Команда, Обработано);
	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Передает указанную ссылку в метод ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки.
// Если ссылка не была там обработана, то она открывается как обычная навигационная ссылка, в зависимости
// от определенных условий:
//  - если это ссылка на ИТС, то открытие ссылки выполняется методом
//    ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта.
//  - в остальных случаях - методом ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку.
// Если Источник не заполнен, то ссылка открывается без передачи в переопределяемый метод.
// 
// Параметры:
//  НавигационнаяСсылка - Строка - ссылка, которую требуется открыть.
//  Источник - Строка - см. ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки.Источник
//  
Процедура ОткрытьНавигационнуюСсылкуСПереопределением(
		Знач НавигационнаяСсылка,
		Знач Источник = "") Экспорт

	СтандартнаяОбработка = Истина;
	Если ЗначениеЗаполнено(Источник) Тогда
		ИнтеграцияПодсистемБИПКлиент.ПриОбработкеНавигационнойСсылкиПанельПомощь(
			Источник,
			НавигационнаяСсылка,
			СтандартнаяОбработка);
		ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки(
			Источник,
			НавигационнаяСсылка,
			СтандартнаяОбработка);
	КонецЕсли;
	
	Если Источник = "Карточка" Тогда
		НавигационнаяСсылка = НавигационнаяСсылка.Ссылка;
	КонецЕсли;
	
	Если СтандартнаяОбработка Тогда
		Если ИнтернетПоддержкаПользователейКлиентСервер.ОткрытьСАвторизацией(НавигационнаяСсылка) Тогда
			ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(НавигационнаяСсылка);
		Иначе
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылка);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТехПоддержка

// Открывает страницу Портала 1С:ИТС для отправки сообщения в службу технической поддержки.
//
// Параметры:
//  ПараметрыРаздела - см. ПанельПомощьСлужебный.ПараметрыРаздела.
//
Процедура СообщениеВТехПоддержку(ПараметрыРаздела)
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СообщенияВСлужбуТехническойПоддержки") Тогда
		ВызватьИсключение НСтр("ru = 'Подсистема ""Сообщения в службу технической поддержки"" не включена в конфигурацию'");
	КонецЕсли;
	
	МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
	
	ДанныеСообщения = МодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
	ЗаполнитьЗначенияСвойств(ДанныеСообщения, ПараметрыРаздела.СообщениеВТехПоддержку.ДанныеСообщения);
	
	МодульСообщенияВСлужбуТехническойПоддержкиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
	МодульСообщенияВСлужбуТехническойПоддержкиКлиент.ОтправитьСообщение(ДанныеСообщения);
	
КонецПроцедуры

// Запускает 1С-Коннект
//
Процедура Коннект()
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтеграцияСКоннект") Тогда
		ВызватьИсключение НСтр("ru = 'Подсистема ""Интеграция с коннект"" не включена в конфигурацию'");
	КонецЕсли;
	
	МодульИнтеграцияСКоннектКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтеграцияСКоннектКлиент");
	МодульИнтеграцияСКоннектКлиент.СвязатьсяСоСпециалистом();
	
КонецПроцедуры

// Выполняет отправку пожеланий в тех. поддержку.
// 
// Параметры:
//  ПараметрыПодсистемы - см. ПанельПомощьСлужебный.НовыйПараметрыПодсистемы.
// 
Процедура Пожелания(ПараметрыПодсистемы)
	
	НавигационнаяСсылка = ПараметрыПодсистемы.ПараметрыРаздела.Пожелания.ЛинияПоддержки;
	
	СтандартнаяОбработка = Истина;
	ИнтеграцияПодсистемБИПКлиент.ПриОбработкеНавигационнойСсылкиПанельПомощь(
		"Пожелания",
		НавигационнаяСсылка,
		СтандартнаяОбработка);
	ПанельПомощьКлиентПереопределяемый.ПриОбработкеНавигационнойСсылки(
		"Пожелания",
		НавигационнаяСсылка,
		СтандартнаяОбработка);
	
	Если Не СтандартнаяОбработка
		Или Не ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНавигационнаяСсылка = СтрНачинаетсяС(НавигационнаяСсылка, "http:\\") > 0
		Или СтрНачинаетсяС(НавигационнаяСсылка, "https:\\")
		Или СтрНачинаетсяС(НавигационнаяСсылка, "mailto:")
		Или СтрНачинаетсяС(НавигационнаяСсылка, "e1cib/")
		Или СтрНачинаетсяС(НавигационнаяСсылка, "e1c:");

	Если ЭтоНавигационнаяСсылка Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(НавигационнаяСсылка);
		
	ИначеЕсли ПараметрыПодсистемы.ИспользуетсяИнформационныйЦентр Тогда
		
		// АПК: 271-выкл Проверка существования подсистемы при заполнении ПараметрыПодсистемы.ИспользуетсяИнформационныйЦентр
		МодульИнформационныйЦентрКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнформационныйЦентрКлиент");
		МодульИнформационныйЦентрКлиент.ОткрытьЦентрИдей();
		// АПК: 271-вкл
		
	ИначеЕсли ПараметрыПодсистемы.ЕстьСообщенияВСлужбуТехническойПоддержки Тогда
		
		РезультатОтправки = ПанельПомощьВызовСервера.ОтправитьПожеланияВСервис(
			НавигационнаяСсылка,
			ПараметрыПодсистемы.ПараметрыРаздела.Пожелания.Тема,
			ПараметрыПодсистемы.ПараметрыРаздела.Пожелания.Сообщение);
		
		Если ЗначениеЗаполнено(РезультатОтправки.КодОшибки) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'При отправке сообщения возникли ошибки:
				|
				|%1
				|
				|Подробности см. в журнале регистрации'"),
				РезультатОтправки.СообщениеОбОшибке);
			ПоказатьПредупреждение(
				Неопределено,
				ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(РезультатОтправки.URL) Тогда
			Возврат;
		КонецЕсли;
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			РезультатОтправки.URL);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Поиск

// Формируем всплывающее меню для выбора источника поиска
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
//  ПараметрыРаздела - см. ПанельПомощьСлужебный.ПараметрыРаздела.
//  ТекущийИсточник - Строка - идентификатор текущего источника поиска.
//
Процедура ВыбратьИсточникПоиска(Форма, ПараметрыРаздела, ТекущийИсточник)
	
	Оповещение = Новый ОписаниеОповещения(
		"ВыборИсточникаПоискаЗавершение",
		ЭтотОбъект,
		Форма);
	
	ИсточникПоУмолчанию = ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию();
	
	ДоступныеЗначения = Новый СписокЗначений;
	ДоступныеЗначения.Добавить(
			ИсточникПоУмолчанию,
			ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.Представление,
			ТекущийИсточник = ИсточникПоУмолчанию,
			ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.Картинка);
	
	Для Каждого ОписаниеИсточника Из ПараметрыРаздела.ПараметрыПоиска.ДополнительныеИсточники Цикл
		Если ОписаниеИсточника.Идентификатор = ИсточникПоУмолчанию Тогда
			Продолжить;
		КонецЕсли;

		ДоступныеЗначения.Добавить(
			ОписаниеИсточника.Идентификатор,
			ОписаниеИсточника.Представление,
			ТекущийИсточник = ОписаниеИсточника.Идентификатор,
			ОписаниеИсточника.Картинка);
		
	КонецЦикла;
	
	Если ДоступныеЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ПоказатьВыборИзМеню(
		Оповещение,
		ДоступныеЗначения);
	
КонецПроцедуры

// Обрабатывает выбор источника поиска.
// 
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений - выбранное значение.
//  Форма - ФормаКлиентскогоПриложения - форма, на которой производится выбор.
//
Процедура ВыборИсточникаПоискаЗавершение(ВыбранныйЭлемент, Форма) Экспорт

	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, Форма);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоиска = Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ПараметрыПоиска;
	
	Если ВыбранныйЭлемент.Значение = ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию() Тогда
		Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.ПодсказкаВвода = ПараметрыПоиска.ПараметрыСтрокиПоиска.Подсказка;
		Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.Картинка = ПараметрыПоиска.ПараметрыСтрокиПоиска.Картинка;
	Иначе
		ВариантНайден = Ложь;
		Для Каждого ОписаниеИсточника Из ПараметрыПоиска.ДополнительныеИсточники Цикл
			Если ОписаниеИсточника.Идентификатор <> ВыбранныйЭлемент.Значение Тогда
				Продолжить;
			КонецЕсли;
	
			Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.ПодсказкаВвода = ОписаниеИсточника.Подсказка;
			Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.Картинка = ОписаниеИсточника.Картинка;
			ВариантНайден = Истина;
			Прервать;
			
		КонецЦикла;
		
		Если Не ВариантНайден Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Эталон.БИП_ПанельПомощьПараметры.ТекущийИсточник = ВыбранныйЭлемент.Значение;
	Эталон.БИП_ПанельПомощьПараметры.ТекущаяКартинка = Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.Картинка;

КонецПроцедуры

// Выполняет поиск введенной строки на сайте ИТС либо переход на страницу поиска в браузере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
//  ПараметрыПанели - см. ПанельПомощьСлужебный.НовыйПараметрыПодсистемы.
// 
Процедура ВыполнитьПоиск(Форма, ПараметрыПанели)
	
	Если ПараметрыПанели.ТекущийИсточник = ПанельПомощьКлиентСервер.ИдентификаторИсточникаПоУмолчанию()
		И ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.СтандартнаяОбработка Тогда
		
		Если ПараметрыПанели.ТиповаяФорма
			И ЗначениеЗаполнено(ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.КлючAPI) Тогда
			ВыполнитьПоискВСервисе(Форма, ПараметрыПанели);
		Иначе
			ВыполнитьПоискНаИТС(
				Форма.БИП_ПанельПомощьСтрокаПоиска,
				ПараметрыПанели.ПараметрыРаздела.ИдентификаторыДляЗапроса);
		КонецЕсли;
		
	Иначе
		
		СсылкаПоискаИнформации = "";
		СтандартнаяОбработка = Истина;
		
		ИнтеграцияПодсистемБИПКлиент.ПриОпределенииСтраницыПоискаПанельПомощь(
			Форма,
			Форма.БИП_ПанельПомощьСтрокаПоиска,
			ПараметрыПанели.ТекущийИсточник,
			СсылкаПоискаИнформации,
			СтандартнаяОбработка);
		ПанельПомощьКлиентПереопределяемый.ПриОпределенииСтраницыПоиска(
			Форма,
			Форма.БИП_ПанельПомощьСтрокаПоиска,
			ПараметрыПанели.ТекущийИсточник,
			СсылкаПоискаИнформации,
			СтандартнаяОбработка);
			
		Если СтандартнаяОбработка Тогда
			Если ПустаяСтрока(СсылкаПоискаИнформации) Тогда
				ВызватьИсключение НСтр("ru = 'Не удалось определить URL страницы для перехода.'");
			КонецЕсли;
			ОткрытьНавигационнуюСсылкуСПереопределением(СсылкаПоискаИнформации);
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьИсториюПоиска(Форма, ПараметрыПанели);
	
КонецПроцедуры

// Выполняет поиск введенной строки через сервис, если в переопределяемом методе указан ключ API.
// Если ключ API не задан, то поиск выполняется методом ВыполнитьПоискНаИТС.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
//  ПараметрыПанели - см. ПанельПомощьСлужебный.НовыйПараметрыПодсистемы.
//  НомерСтраницы - Строка - номер страницы в результате поиска, которую нужно вывести
// 
Процедура ВыполнитьПоискВСервисе(Форма, ПараметрыПанели, НомерСтраницы = 0) Экспорт
	
	Если Не ЗначениеЗаполнено(ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.КлючAPI) Тогда
		ВыполнитьПоискНаИТС(
			Форма.БИП_ПанельПомощьСтрокаПоиска,
			ПараметрыПанели.ПараметрыРаздела.ИдентификаторыДляЗапроса);
		Возврат;
	КонецЕсли;

	СтрокаПоиска = "";
	Если НомерСтраницы = 0 Тогда
		СтрокаПоиска = Форма.БИП_ПанельПомощьСтрокаПоиска;
	Иначе
		СтрокаПоиска = ПараметрыПанели.ТекущаяСтрокаПоиска;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Укажите строку поиска'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыПанели.ТекущаяСтрокаПоиска = СтрокаПоиска;
	
	Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.Картинка = БиблиотекаКартинок.ДлительнаяОперация16;
	
	ДлительнаяОперация = ПанельПомощьВызовСервера.ОперацияВыполнитьПоискВСервисе(
		Форма.УникальныйИдентификатор,
		ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.КлючAPI,
		ПараметрыПанели.ТекущаяСтрокаПоиска,
		НомерСтраницы);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДополнительныеПараметры = Новый Структура("НомерСтраницы", НомерСтраницы);
	
	//@skip-check notify-description-to-server-procedure
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ПриЗавершенииПоиска",
		Форма,
		ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		ДлительнаяОперация,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

// Выполняет открытие страницы поиска на сайте ИТС.
// 
// Параметры:
//  СтрокаПоиска - Строка - строка, которую необходимо найти.
//  ИдентификаторыКонфигураций - Строка - идентификаторы конфигурации в формате строки запроса.
// 
Процедура ВыполнитьПоискНаИТС(СтрокаПоиска, ИдентификаторыКонфигураций)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Укажите строку поиска'"));
		Возврат;
	КонецЕсли;
	
	СсылкаПоискаИнформации = СтрокаПоискаНаИТС(СтрокаПоиска, ИдентификаторыКонфигураций);
	
	ИнтернетПоддержкаПользователейКлиент.ОткрытьСтраницуИнтегрированногоСайта(СсылкаПоискаИнформации);
	
КонецПроцедуры

// Формирует URL адрес для поиска на ИТС на основе текущих параметров панели Помощь.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой расположены элементы панели Помощь.
// 
// Возвращаемое значение:
//  Строка - URL адрес для перехода на страницу ИТС
// 
Функция ПолучитьСтрокуПоискаНаИТС(Форма) Экспорт
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, Форма);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат СтрокаПоискаНаИТС("", "");
	КонецЕсли;
	
	Возврат СтрокаПоискаНаИТС(
		Форма.БИП_ПанельПомощьСтрокаПоиска,
		Эталон.БИП_ПанельПомощьПараметры.ПараметрыРаздела.ИдентификаторыДляЗапроса);
	
КонецФункции

// Формирует URL адрес для поиска на ИТС.
// 
// Параметры:
//  СтрокаПоиска - Строка - строка, которую необходимо найти.
//  ИдентификаторыКонфигураций - Строка - идентификаторы конфигурации в формате строки запроса.
// 
// Возвращаемое значение:
//  Строка - URL адрес для перехода на страницу ИТС
// 
Функция СтрокаПоискаНаИТС(СтрокаПоиска, ИдентификаторыКонфигураций)
	
	Хост = ИнтернетПоддержкаПользователейКлиентСервер.ХостСервисовИнтернетПоддержки();

	Если ЗначениеЗаполнено(ИдентификаторыКонфигураций) Тогда
		ШаблонАдреса = "https://%1/db/morphmerged#search:its:%2?%3&attribute=conf";
	Иначе
		ШаблонАдреса = "https://%1/db/morphmerged#search:its:%2";
	КонецЕсли;
	
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонАдреса,
		Хост,
		ПанельПомощьВызовСервера.КодироватьURL(СтрокаПоиска),
		ИдентификаторыКонфигураций);
	
КонецФункции

// Устанавливает для поля поиска картинку текущего источника поиска.
// Вызывается после завершения длительной операции.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
// 
Процедура УстановитьКартинкуСтрокиПоиска(Форма) Экспорт
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, Форма);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.Картинка = Эталон.БИП_ПанельПомощьПараметры.ТекущаяКартинка;
	
КонецПроцедуры

// Выполняет сохранение введенного значения поиска в историю.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата кнопка.
//  ПараметрыПанели - см. ПанельПомощьСлужебный.НовыйПараметрыПодсистемы.
// 
Процедура ОбновитьИсториюПоиска(Форма, ПараметрыПанели)
	
	СтрокаПоиска = СокрЛП(Форма.БИП_ПанельПомощьСтрокаПоиска);
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	ПанельПомощьВызовСервера.СохранитьНастройкиПользователяПанели(
		"ТекущийИсточник",
		ПараметрыПанели.ТекущийИсточник);
		
	КоличествоВИстории = ПараметрыПанели.ПараметрыРаздела.ПараметрыПоиска.ПараметрыСтрокиПоиска.КоличествоЗаписейВИстории;
	Если КоличествоВИстории <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПоиска = СокрЛП(Форма.БИП_ПанельПомощьСтрокаПоиска);
	
	НоваяИстория = Новый Массив;
	НоваяИстория.Добавить(Форма.БИП_ПанельПомощьСтрокаПоиска);

	Если КоличествоВИстории > 1 Тогда
	
		Для Каждого ЭлементИстории Из Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.СписокВыбора Цикл
			Если ВРег(ЭлементИстории.Значение) = ВРег(СтрокаПоиска) Тогда
				Продолжить;
			КонецЕсли;
			НоваяИстория.Добавить(ЭлементИстории.Значение);
			Если НоваяИстория.Количество() >= КоличествоВИстории Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;

	Форма.Элементы.БИП_ПанельПомощьСтрокаПоиска.СписокВыбора.ЗагрузитьЗначения(НоваяИстория);
	
	ПанельПомощьВызовСервера.СохранитьНастройкиПользователяПанели(
		"ИсторияПоиска",
		НоваяИстория);
		
КонецПроцедуры

#КонецОбласти

#Область Карточки

// Выполняет обработку нажатия типовой карточки панели Помощь.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, на которой нажата карточка.
//  Элемент - Произвольный - элемент, инициировавший срабатывании события.
//  Обработано - Булево - служебный параметр, используется в типовой форме.
//    Будет установлено в Истина, если нажата типовая карточка.
//
Процедура КарточкаНажатие(Форма, Элемент, Обработано = Ложь) Экспорт
	
	Эталон = Новый Структура("БИП_ПанельПомощьПараметры", Неопределено);
	ЗаполнитьЗначенияСвойств(Эталон, Форма);
	Если Эталон.БИП_ПанельПомощьПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьНажатиеКарточки(
		Эталон.БИП_ПанельПомощьПараметры.ТиповыеКарточки,
		Элемент.Имя,
		Обработано);
	
КонецПроцедуры

Процедура ОбработатьНажатиеКарточки(ТиповыеКарточки, ИмяЭлемента, Обработано)
	
	ОписаниеКарточки = ТиповыеКарточки.Получить(ИмяЭлемента);
	Если ОписаниеКарточки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеКарточки.Идентификатор = "БИП_ОПрограмме" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ОПрограмме");
		Обработано = Истина;
		
	ИначеЕсли ОписаниеКарточки.Идентификатор = "БИП_ОтветыНаВопросы"
		Или ОписаниеКарточки.Идентификатор = "БИП_Документация" Тогда
		
		Источник = СтрЗаменить(ОписаниеКарточки.Идентификатор, "БИП_", "");
		ОткрытьНавигационнуюСсылкуСПереопределением(
			ОписаниеКарточки.Ссылка,
			Источник);
		Обработано = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

