
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	EMail = Параметры.EMail;
	Портал = Параметры.Портал;  
	
	ТекстФормы = Новый ФорматированнаяСтрока(
	НСтр("ru='Перед отправкой отчета необходимо зарегистрировать организацию на портале Росалкогольтабакконтроля '"),
	Новый ФорматированнаяСтрока(Портал, , , ,Портал + "/registration"),
	Символы.ПС,
	НСтр("ru='Чтобы программа произвела регистрацию на портале, укажите ниже адрес '"),
	НСтр("ru='электронный почты, на который будет выслана информация о регистрации.'")); 
	
	Элементы.ДекорацияИнформация.Заголовок = ТекстФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура Зарегистрироваться(Команда)
	
	Результат = Новый Структура("EMail, Портал");
	Результат.EMail = EMail;
	Результат.Портал = Портал;
	Закрыть(Результат);
	
КонецПроцедуры
