#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетУдостоверений") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.Удостоверения) Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(Удостоверения);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетУдостоверений") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.Удостоверения) Тогда
		Возврат;
	КонецЕсли;
	
	Раздел							= "Удостоверения";
	ПредставлениеЗаголовка			= НСтр("ru = 'Контроль удостоверений'");
	Представление					= НСтр("ru = 'Контроль удостоверений'");
	Подсказка						= НСтр("ru = 'Проконтролировать состояние удостоверений.'");
	
	ДелоЗаголовок					= ТекущиеДела.Добавить();
	ДелоЗаголовок.Идентификатор		= Раздел;
	ДелоЗаголовок.Важное			= Ложь;
	ДелоЗаголовок.Владелец			= Метаданные.Подсистемы.Найти("Кадры");
	ДелоЗаголовок.Представление		= ПредставлениеЗаголовка;
	ДелоЗаголовок.Подсказка			= ПредставлениеЗаголовка;
	ДелоЗаголовок.ЕстьДела			= Ложь;
	ДелоЗаголовок.Форма				= "Отчет.КонтрольУдостоверений.Форма";
	
	ПериодОтчета = ТекущаяДатаСеанса();

	ПараметрыФормы					= Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "КонтрольУдостоверений");
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Период, ТребуетсяКонтроль", ПериодОтчета, Истина));
	
	ДелоЗаголовок.ПараметрыФормы = ПараметрыФормы;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Если МодульТекущиеДелаСервер.ДелоОтключено(Раздел) Тогда
		Возврат;
	КонецЕсли;
	
	ТребуетсяКонтрольУдостоверений = ТребуетсяКонтрольУдостоверений(ПериодОтчета);
	
	Если ТребуетсяКонтрольУдостоверений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Организации = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ТребуетсяКонтрольУдостоверений.ВыгрузитьКолонку("Организация"));
	
	ДанныеОрганизаций = Новый Соответствие;
	
	Для Каждого Организация Из Организации Цикл
		Сотрудники = Новый Массив;
		СтрокиТЗ = ТребуетсяКонтрольУдостоверений.НайтиСтроки(Новый Структура("Организация", Организация));
		Для Каждого СтрокаТЗ Из СтрокиТЗ Цикл
			Сотрудники.Добавить(СтрокаТЗ.Сотрудник);
		КонецЦикла;
		ДанныеОрганизаций.Вставить(Организация, Сотрудники);
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ДанныеОрганизаций Цикл
		
		Организация = КлючИЗначение.Ключ;
		
		Дело				= ТекущиеДела.Добавить();
		Дело.Идентификатор	= "Удостоверения" + СтрЗаменить(Организация.УникальныйИдентификатор(), "-", "");
		Дело.ЕстьДела		= Истина;
		Дело.Важное			= Ложь;
		Дело.Владелец		= Раздел;
		Дело.Представление	= Представление + ", " + Строка(Организация);
		Дело.Количество		= Сотрудники.Количество();
		Дело.Подсказка		= Подсказка;
		Дело.Форма			= "Отчет.КонтрольУдостоверений.Форма";
		
		ПараметрыФормыПоОрганизации = Новый Структура;
		ПараметрыФормыПоОрганизации.Вставить("СформироватьПриОткрытии", Истина);
		ПараметрыФормыПоОрганизации.Вставить("КлючВарианта", "КонтрольУдостоверений");
		ПараметрыФормыПоОрганизации.Вставить("Отбор", Новый Структура("Период, Организация, ТребуетсяКонтроль", ПериодОтчета, Организация, Истина));
		
		Дело.ПараметрыФормы = ПараметрыФормыПоОрганизации;
		
		ДелоЗаголовок.ЕстьДела = Истина;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктУничтоженияУдостоверений", "Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратУтеряУдостоверений", "Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыдачаУдостоверений", "Дата","КадровыйУчет", "Организация");
	
КонецПроцедуры

Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.КонтрольУдостоверений);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.КнигаВыдачиУдостоверений);
	
КонецПроцедуры

#Область ОпределениеДоступностиДанных

Функция ДоступноИзменениеИспользованияУчетаУдостоверений() Экспорт
	
	Возврат ПравоДоступа("Изменение", Метаданные.Константы.ИспользоватьУчетУдостоверений);
	
КонецФункции

#КонецОбласти

#Область ПанельНастроекЗарплатаКадры

Процедура ПанельЗарплатаКадрыПрочитатьНастройки(Форма) Экспорт
	
	ИспользоватьУчетУдостоверений = Константы.ИспользоватьУчетУдостоверений.Получить();
	Форма.ИспользоватьУчетУдостоверений = ИспользоватьУчетУдостоверений;
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаполнитьНастройки(Форма, ПараметрыНастроек) Экспорт
	
	ПараметрыНастроек.ИспользоватьУчетУдостоверений = Форма.ИспользоватьУчетУдостоверений;
	
КонецПроцедуры

Процедура ПанельУправлениеПерсоналомЗаписатьНастройки(Параметры, ПараметрыНастроек) Экспорт
	
	Если ПараметрыНастроек.ИспользоватьУчетУдостоверений Тогда
		Константы.ИспользоватьУчетУдостоверений.Установить(Параметры.ИспользоватьУчетУдостоверений);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбслуживаниеНастроекПрограммы

Процедура ДобавитьПоказателиУдостоверений(ТаблицаПоказателей) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьУчетУдостоверений", 
		НСтр("ru='Использовать учет удостоверений.'"), "Кадровый учет", "", "Ложь", 3, 1, 7);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
		|Документ.АктУничтоженияУдостоверений.Чтение.ГруппыФизическихЛиц
		|Документ.АктУничтоженияУдостоверений.Чтение.Организации
		|Документ.АктУничтоженияУдостоверений.Изменение.ГруппыФизическихЛиц
		|Документ.АктУничтоженияУдостоверений.Изменение.Организации
		|Документ.ВозвратУтеряУдостоверений.Чтение.ГруппыФизическихЛиц
		|Документ.ВозвратУтеряУдостоверений.Чтение.Организации
		|Документ.ВозвратУтеряУдостоверений.Изменение.ГруппыФизическихЛиц
		|Документ.ВозвратУтеряУдостоверений.Изменение.Организации
		|Документ.ВыдачаУдостоверений.Чтение.ГруппыФизическихЛиц
		|Документ.ВыдачаУдостоверений.Чтение.Организации
		|Документ.ВыдачаУдостоверений.Изменение.ГруппыФизическихЛиц
		|Документ.ВыдачаУдостоверений.Изменение.Организации
		|Справочник.АктУничтоженияУдостоверенийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.АктУничтоженияУдостоверенийПрисоединенныеФайлы.Чтение.Организации
		|Справочник.АктУничтоженияУдостоверенийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.АктУничтоженияУдостоверенийПрисоединенныеФайлы.Изменение.Организации
		|Справочник.ВозвратУтеряУдостоверенийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ВозвратУтеряУдостоверенийПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ВозвратУтеряУдостоверенийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ВозвратУтеряУдостоверенийПрисоединенныеФайлы.Изменение.Организации
		|Справочник.ВыдачаУдостоверенийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
		|Справочник.ВыдачаУдостоверенийПрисоединенныеФайлы.Чтение.Организации
		|Справочник.ВыдачаУдостоверенийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
		|Справочник.ВыдачаУдостоверенийПрисоединенныеФайлы.Изменение.Организации
		|РегистрСведений.Удостоверения.Чтение.ГруппыФизическихЛиц
		|РегистрСведений.Удостоверения.Чтение.Организации
		|";
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.АктУничтоженияУдостоверений, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратУтеряУдостоверений, Истина);
	Списки.Вставить(Метаданные.Документы.ВыдачаУдостоверений, Истина);
	Списки.Вставить(Метаданные.Справочники.АктУничтоженияУдостоверенийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратУтеряУдостоверенийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыдачаУдостоверенийПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.Удостоверения, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "de4261e0-2b05-4615-a655-943a03d5251f", Метаданные.Документы.АктУничтоженияУдостоверений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "a55988d6-b714-4573-9765-d78273b3911e", Метаданные.Документы.ВозвратУтеряУдостоверений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c56596f3-6d83-4e37-bc66-b5f641b2219e", Метаданные.Документы.ВыдачаУдостоверений);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "6ee978e4-48aa-4aa1-80d8-6aca7b1634a9", Метаданные.Справочники.ВидыУдостоверений);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеКомиссии

Функция ДолжностьЧленаКомиссии(ЧленКомиссии, Организация, Дата) Экспорт
	
	ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ЧленКомиссии, Истина, Организация, Дата);
	Сотрудники = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, "ТекущаяДолжность", Дата);
	
	Если КадровыеДанные.Количество() > 0 Тогда
		ТекущаяДолжность = КадровыеДанные[0].ТекущаяДолжность;
		Если ЗначениеЗаполнено(ТекущаяДолжность) Тогда
			Возврат ТекущаяДолжность;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполненияКомиссии(ДокументОбъект, ПроверяемыеРеквизиты) Экспорт
	
	ОбработатьДублиСтрокВТабличнойЧасти(ДокументОбъект, "Комиссия", "ЧленКомиссии", Истина);
	
	КоличествоЧленовКомиссии = ДокументОбъект.Комиссия.Количество();
	
	Если КоличествоЧленовКомиссии = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнен состав комиссии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , "Объект");
	ИначеЕсли КоличествоЧленовКомиссии = 1 Тогда
		ТекстОшибки = НСтр("ru = 'Комиссия не может состоять из одного человека.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , "Объект");
	КонецЕсли;
	
	КоличествоПредседателей = 0;
	КоличествоЗаместителейПредседателя = 0;
	КоличествоСекретарей = 0;
	Для каждого СтрокаКомиссии Из ДокументОбъект.Комиссия Цикл
		Если СтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииПоУничтожениюУдостоверений.Председатель Тогда
			КоличествоПредседателей = КоличествоПредседателей + 1;
		ИначеЕсли СтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииПоУничтожениюУдостоверений.ЗаместительПредседателя Тогда
			КоличествоЗаместителейПредседателя = КоличествоЗаместителейПредседателя + 1;
		ИначеЕсли СтрокаКомиссии.РольВКомиссии = Перечисления.РолиЧленовКомиссииПоУничтожениюУдостоверений.Секретарь Тогда
			КоличествоСекретарей = КоличествоСекретарей + 1;
		КонецЕсли;
	КонецЦикла;
	Если КоличествоПредседателей > 1 Тогда
		ТекстОшибки = НСтр("ru = 'Председатель в комиссии должен быть один.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , "Объект");
	ИначеЕсли КоличествоПредседателей = 0 И КоличествоЗаместителейПредседателя = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не указан председатель комиссии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , "Объект");
	ИначеЕсли КоличествоСекретарей = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не указан секретарь комиссии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект, , "Объект");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДублиСтрокВТабличнойЧасти(Объект, ИмяТаблицы, ИмяПоля, СообщатьОДублях = Ложь, Отказ = Ложь) Экспорт
	
	ТаблицаПолей = Объект[ИмяТаблицы];
	Уникальные = Новый Соответствие;
	СообщениеОтправлено = Новый Соответствие;
	
	Индекс = 0;
	Пока Индекс < ТаблицаПолей.Количество() Цикл
		СтрокаТаблицы = ТаблицаПолей[Индекс];
		Если Уникальные[СтрокаТаблицы[ИмяПоля]] = Неопределено Тогда
			Уникальные.Вставить(СтрокаТаблицы[ИмяПоля], Истина);
			Индекс = Индекс + 1;
		Иначе
			Если СообщатьОДублях Тогда
				Если СообщениеОтправлено[СтрокаТаблицы[ИмяПоля]] = Неопределено Тогда
					ТекстОшибки = СтрШаблон( НСтр("ru = 'Сотрудник %1 выбран в комиссию дважды'"), СтрокаТаблицы.ЧленКомиссии);
					ОбщегоНазначения.СообщитьПользователю(
						ТекстОшибки,
						Объект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТаблицы, СтрокаТаблицы.НомерСтроки, "ЧленКомиссии"),
						,
						Отказ);
					СообщениеОтправлено.Вставить(СтрокаТаблицы[ИмяПоля], Истина);
				КонецЕсли;
				Индекс = Индекс + 1;
			Иначе
				ТаблицаПолей.Удалить(СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.АктУничтоженияУдостоверений);
	СписокОбъектов.Добавить(Документы.ВозвратУтеряУдостоверений);
	СписокОбъектов.Добавить(Документы.ВыдачаУдостоверений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.39.51";
	Обработчик.Процедура = "Справочники.ВидыУдостоверений.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("d907a982-8757-42ca-bdcc-5fa339164155");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение справочника Виды удостоверений.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.39.51";
	Обработчик.Процедура = "Справочники.ОснованияДляУдостоверений.НачальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.НачальноеЗаполнение = Истина;
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cca9d94c-69b3-4158-ac65-f415052d2005");
	Обработчик.Комментарий = НСтр("ru = 'Заполнение справочника Основания для удостоверений.'");
	
КонецПроцедуры

#КонецОбласти

#Область КадровыеДанныеДляЗаполнения

Функция СписокКадровыхДанных() Экспорт
	
	СписокКадровыхДанных = "Сотрудник,ФИО,ФизическоеЛицо,Должность";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		МодульКлассныеЧиныРанги = ОбщегоНазначения.ОбщийМодуль("КлассныеЧиныРанги");
		МодульКлассныеЧиныРанги.КадровыеДанныеКлассныйЧинРанг(СписокКадровыхДанных);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МодульВоинскиеСпециальныеЗвания = ОбщегоНазначения.ОбщийМодуль("ВоинскиеСпециальныеЗвания");
		МодульВоинскиеСпециальныеЗвания.КадровыеДанныеВоинскоеСпециальноеЗвание(СписокКадровыхДанных);
	КонецЕсли;
	
	Возврат СписокКадровыхДанных;
	
КонецФункции

Функция КадровыеДанныеДляЗаполнения(СписокСотрудников, СписокКадровыхДанных, ДатаПолученияДанных) Экспорт
	
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина,
		СписокСотрудников,
		СписокКадровыхДанных,
		ДатаПолученияДанных);
		
	Возврат КадровыеДанныеСотрудников;
	
КонецФункции

#КонецОбласти

#Область ПечатьЛичнойКарточкиТ2

Процедура ДополнитьСведенияУнифицированнойФормыТ2(ЧетвертаяСтраницаТ2ПродолжениеПараметры, ДатаАктуальности, Сотрудник) Экспорт
	
	ДополнительныеСведения = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", КонецДня(ДатаАктуальности));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(Удостоверения.ВидУдостоверения КАК Справочник.ВидыУдостоверений).Наименование КАК ВидУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Сотрудник = &Сотрудник
		|				И ВЫРАЗИТЬ(ВидУдостоверения КАК Справочник.ВидыУдостоверений).ОтражатьВТ2) КАК Удостоверения
		|ГДЕ
		|	Удостоверения.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано)";
	
	Результат = Запрос.Выполнить();
	НомерСтроки = 1;
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДополнительныеСведения = ДополнительныеСведения
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 серия %2 номер %3 от %4%5'"),
					Выборка.ВидУдостоверения,
					Выборка.СерияУдостоверения,
					Выборка.НомерУдостоверения,
					Формат(Выборка.ДатаВыдачи, "ДЛФ=D"),
					?(НомерСтроки = Выборка.Количество(), "", "; "));
					НомерСтроки = НомерСтроки + 1;
		КонецЦикла;
	КонецЕсли;
	
	ЧетвертаяСтраницаТ2ПродолжениеПараметры.Вставить("ДополнительныеСведения", ДополнительныеСведения);
	
КонецПроцедуры

#КонецОбласти

Функция ТребуетсяКонтрольУдостоверений(ПериодОтчета)
	
	Макет = Отчеты.КонтрольУдостоверений.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Макет));
	КомпоновщикНастроек.ЗагрузитьНастройки(Макет.ВариантыНастроек["КонтрольУдостоверений"].Настройки);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиОтчета.Структура.Очистить();
	НастройкиОтчета.Выбор.Элементы.Очистить();
	
	ПараметрПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрПериод <> Неопределено Тогда
		ПараметрПериод.Значение = ПериодОтчета;
		ПараметрПериод.Использование = Истина;
	КонецЕсли;
	
	ОтборКомпоновкиДанных = НастройкиОтчета.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборКомпоновкиДанных.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТребуетсяКонтроль");
	ОтборКомпоновкиДанных.ПравоеЗначение = Истина;
	ОтборКомпоновкиДанных.Использование = Истина;
	
	Группировка = НастройкиОтчета.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Группировка.ПоляГруппировки.Элементы.Очистить();
	Группировка.Выбор.Элементы.Очистить();
	Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	ОтчетыСервер.ДобавитьВыбранноеПоле(НастройкиОтчета.Выбор, "Организация");
	ОтчетыСервер.ДобавитьВыбранноеПоле(НастройкиОтчета.Выбор, "Сотрудник");
	
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаполнитьОбщиеИсточникиДанныхОтчета(Новый Структура("СхемаКомпоновкиДанных", Макет));
	
	МакетКомпоновкиДанных = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанныхДляКоллекцииЗначений(Макет, НастройкиОтчета);
	
	ВнешниеНаборыДанных = Отчеты.КонтрольУдостоверений.ВнешниеНаборыДанных(КомпоновщикНастроек);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеНаборыДанных,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ТребуетсяКонтрольУдостоверений = Новый ТаблицаЗначений;
	ТребуетсяКонтрольУдостоверений.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТребуетсяКонтрольУдостоверений.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ТребуетсяКонтрольУдостоверений.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
	Возврат ТребуетсяКонтрольУдостоверений;
	
КонецФункции

Процедура УдалитьПоляОтчета(СхемаКомпоновкиДанных, ТекущийКлючВарианта) Экспорт
	
	ПоляУдаления = Новый Массив;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		ПоляУдаления.Добавить("СменаУдостоверенияПриСменеКлассногоЧинаРанга");
		ПоляУдаления.Добавить("КлассныйЧинРанг");
		ПоляУдаления.Добавить("ТекущийКлассныйЧинРанг");
		ПоляУдаления.Добавить("СменаКлассногоЧинаРанга");
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		ПоляУдаления.Добавить("СменаУдостоверенияПриСменеВоинскогоСпециальногоЗвания");
		ПоляУдаления.Добавить("ВоинскоеСпециальноеЗвание");
		ПоляУдаления.Добавить("ТекущееВоинскоеСпециальноеЗвание");
		ПоляУдаления.Добавить("СменаВоинскогоСпециальногоЗвания"); 
	КонецЕсли;
	
	// Удаление полей из схемы компоновки данных.
	Для каждого Поле Из ПоляУдаления Цикл
		
		ПолеНабораДанныхСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.НаборыДанных[ТекущийКлючВарианта].Поля.Найти(Поле);
		Если ПолеНабораДанныхСхемыКомпоновкиДанных <> Неопределено Тогда
			СхемаКомпоновкиДанных.НаборыДанных[ТекущийКлючВарианта].Поля.Удалить(ПолеНабораДанныхСхемыКомпоновкиДанных);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОтборЗапроса(СхемаЗапроса, ВТДляОтбора, ЗначениеОтбора) Экспорт
	
	Для НомерЗапроса = 1 По СхемаЗапроса.ПакетЗапросов.Количество() Цикл
		ЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - НомерЗапроса];
		Если ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
			Если ЗначениеЗаполнено(ВТДляОтбора) И ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляПомещения) Тогда
				Если ВТДляОтбора.Свойство(ЗапросПакета.ТаблицаДляПомещения) Тогда
					ЗначениеОтбораКопия = СтрЗаменить(ЗначениеОтбора, "#ИмяТаблицы", ВТДляОтбора[ЗапросПакета.ТаблицаДляПомещения]);
					ЗапросПакета.Операторы[0].Отбор.Добавить(ЗначениеОтбораКопия);
				КонецЕсли;
			ИначеЕсли Не ЗначениеЗаполнено(ВТДляОтбора) И Не ЗначениеЗаполнено(ЗапросПакета.ТаблицаДляПомещения) Тогда
				ЗапросПакета.Операторы[0].Отбор.Добавить(ЗначениеОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти