#Область ОписаниеПеременных

&НаСервере
Перем КлючевоеСловоЗагрузилось;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьИнтеграциюРекрутинговыхСайтов = 
		РекрутинговыеСайты.ИспользуетсяИнтеграцияРекрутинговыхСайтов();
	
	ВосстановитьНастройки();
	
	Если ИспользоватьИнтеграциюРекрутинговыхСайтов Тогда
		РекрутинговыеСайтыФормы.ФормаПоискаКандидатовПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьОтображение();
	ИнициализироватьФильтры();
	УстановитьНадписьПолнотекстовогоПоиска();
	НастроитьФормуПоОбластиПоиска();
	
	Если Параметры.Свойство("КлючевоеСлово", Объект.КлючевоеСлово) Тогда
		КлючевоеСловоЗагрузилось = Истина;
	Иначе
		КлючевоеСловоЗагрузилось = Ложь;
	КонецЕсли;
	
	Если Сайты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОбщиеКлассификаторы();
	
	Параметры.Свойство("Вакансия", Вакансия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьКлассификаторы();
	
	НастройкаДоступностиЭлементовФормы();
	УстановитьЗаголовокНадписиРегион();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыНастройкиДоступаКСайтам" Тогда
		ЗаполнитьДанныеРекрутинговыхСайтов();
		СброситьФильтры();
		УстановитьЗаголовокНадписиРегион();
		НастройкаДоступностиЭлементовФормы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	СохранитьНастройки();
	Настройки.Вставить("Сайт", Сайты);
	
	Если Сайты <> Неопределено Тогда
		Для каждого Сайт Из Сайты Цикл
			ИмяРеквизита = СтрШаблон("ОбластьПоиска%1", ДанныеСайтов[Сайт].Имя);
			Настройки.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Сайты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КлючевоеСловоЗагрузилось Тогда
		Настройки.Удалить("Объект.КлючевоеСлово");
	КонецЕсли;
	
	СохраненныеСайты = Настройки.Получить("Сайт");
	Если СохраненныеСайты <> Неопределено Тогда 
		Если Не ОбщегоНазначения.КоллекцииИдентичны(Сайты, СохраненныеСайты) Тогда
			Для Каждого ЭлементОтбора Из Настройки Цикл
				Настройки.Удалить(ЭлементОтбора.Ключ);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Сайты <> Неопределено Тогда
		Для каждого Сайт Из Сайты Цикл
			ИмяРеквизита = СтрШаблон("ОбластьПоиска%1", ДанныеСайтов[Сайт].Имя);
			ЭтотОбъект[ИмяРеквизита] = Настройки[ИмяРеквизита];
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеФильтров(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегионНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Классификатор", "areas_towns");
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ВыбранныеСтроки", Объект.Регион);
	ПараметрыФормы.Вставить("ИспользуемыеСайты", Сайты);
	
	ИмяФормыОбработки = "Обработка.ПубликацияВакансийНаРекрутинговыхСайтах.Форма.ВыборИзДереваЗначений";
	
	Оповещение = Новый ОписаниеОповещения("РегионНачалоВыбораЗавершение", ЭтотОбъект);
	
	РекрутинговыеСайтыКлиент.ОткрытьФормуОбработки(ИмяФормыОбработки, ПараметрыФормы, ЭтотОбъект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГражданствоСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборГражданствоСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборГражданствоСписок, ИспользоватьГражданство,
			ЗаголовокОтборГражданство, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГражданствоСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборГражданствоСписок, ИспользоватьГражданство,
		ЗаголовокОтборГражданство, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗнаниеЯзыковСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(ЗнаниеЯзыковСписок,
		ИспользоватьЗнаниеЯзыков, ЗаголовокОтборЗнаниеЯзыков);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеВБракеСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(СостояниеВБракеСписок,
		ИспользоватьСостояниеВБраке, ЗаголовокОтборСостояниеВБраке);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУровеньОбразованияСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(УровеньОбразованияСписок,
		ИспользоватьУровеньОбразованияФизическогоЛица, ЗаголовокОтборУровеньОбразования);
КонецПроцедуры

&НаКлиенте
Процедура ОтборКомпетенцииСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(КомпетенцииСписок,
		ИспользоватьКомпетенции, ЗаголовокОтборКомпетенции);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчебноеЗаведениеСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборУчебноеЗаведениеСписок, ИспользоватьУчебноеЗаведение,
		ЗаголовокОтборУчебноеЗаведение, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчебноеЗаведениеСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборУчебноеЗаведениеСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборУчебноеЗаведениеСписок, ИспользоватьУчебноеЗаведение,
			ЗаголовокОтборУчебноеЗаведение, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПрофессияСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборПрофессияСписок, ИспользоватьПрофессию,
		ЗаголовокОтборПрофессия, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрофессияСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборПрофессияСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборПрофессияСписок, ИспользоватьПрофессию,
			ЗаголовокОтборПрофессия, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборСпециальностьСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборСпециальностьСписок, ИспользоватьСпециальность,
		ЗаголовокОтборСпециальность, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпециальностьСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборСпециальностьСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборСпециальностьСписок, ИспользоватьСпециальность,
			ЗаголовокОтборСпециальность, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрофильДолжностиСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборПрофильДолжностиСписок, ИспользоватьПрофильДолжности,
		ЗаголовокОтборПрофильДолжности, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрофильДолжностиСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборПрофильДолжностиСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборПрофильДолжностиСписок, ИспользоватьПрофильДолжности,
			ЗаголовокОтборПрофильДолжности, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПричинаОтклоненияСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(ПричинаОтклоненияСписок,
		ИспользоватьПричинаОтклонения, ЗаголовокОтборПричинаОтклонения);
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭтапРаботыСписокПометкаПриИзменении(Элемент)
	ПриИзмененииПометкиСписка(ЭтапРаботыСписок,
		ИспользоватьЭтапРаботы, ЗаголовокОтборЭтапРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйРекрутерСписокПриИзменении(Элемент)
	ЗаполнитьПредставлениеФильтра(ОтборОтветственныйРекрутерСписок, ИспользоватьОтветственныйРекрутер,
		ЗаголовокОтборОтветственныйРекрутер, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйРекрутеСписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			ОтборОтветственныйРекрутерСписок.Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ОтборОтветственныйРекрутерСписок, ИспользоватьОтветственныйРекрутер,
			ЗаголовокОтборОтветственныйРекрутер, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УровеньОбразованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоОдиночногоВыбораИзСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоОдиночногоВыбораИзСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРазмещенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачалоОдиночногоВыбораИзСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВозрастОтПриИзменении(Элемент)
	ИспользоватьВозрастДо = ИспользоватьВозрастОт;
	НастройкаДоступностиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУровеньЗарплатыОтПриИзменении(Элемент)
	ИспользоватьУровеньЗарплатыДо = ИспользоватьУровеньЗарплатыОт;
	НастройкаДоступностиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегионПриИзменении(Элемент)
	НастройкаДоступностиЭлементовФормы();
	Объект.Регион.Очистить();
	УстановитьЗаголовокНадписиРегион();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПолПриИзменении(Элемент)
	НастройкаДоступностиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьУровеньОбразованияПриИзменении(Элемент)
	НастройкаДоступностиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПериодРазмещенияПриИзменении(Элемент)
	НастройкаДоступностиЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СписокФильтрПриИзменении(Элемент)
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя, "СписокФильтр", "");
	ИспользоватьФильтр = "ИспользоватьФильтрСвойства" + ИмяРеквизита;
	ЗаголовокФильтра = "ЗаголовокФильтрСвойства" + ИмяРеквизита;
	
	ЗаполнитьПредставлениеФильтра(ЭтаФорма[ИмяРеквизита], ЭтаФорма[ИспользоватьФильтр],
		ЭтаФорма[ЗаголовокФильтра], Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИскатьНаСайтеПриИзменении(Элемент)
	
	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНайденныеКандидаты

&НаКлиенте
Процедура НайденныеКандидатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НайденныеКандидатыПостраничная.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "НайденныеКандидатыПостраничнаяСсылкаНаРезюме" Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Элемент.ТекущиеДанные.СсылкаНаРезюме);
		Возврат;
	КонецЕсли;
	
	РекрутинговыеСайтыКлиент.СоздатьКандидатаПоАдресуРезюме(
		ЭтотОбъект, ТекущиеДанные.СсылкаНаРезюме, Новый Структура("Вакансия", Вакансия));
	
КонецПроцедуры

&НаКлиенте
Процедура НайденныеКандидатыПостраничнаяПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НайденныеКандидатыПостраничнаяПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНайденныеФизическиеЛица

&НаКлиенте
Процедура НайденныеФизическиеЛицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.НайденныеКандидаты.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ФизическоеЛицо) Тогда
			ЗарплатаКадрыКлиент.ОткрытьФормуФизическогоЛицаДляРедактирования(ТекущиеДанные.ФизическоеЛицо,
				"ИсторияРаботы");
		Иначе
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Кандидат);
			ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаНайти(Команда)
	
	Если ОбластьПоиска = ОбластиПоиска().Внутри Тогда
		НайтиВнутри();
	ИначеЕсли ОбластьПоиска = ОбластиПоиска().ВИнтернете Тогда
		НайтиВИнтернете();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНастройки(Команда)
	
	ОчиститьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПоискаПриИзменении(Элемент)
	
	Если ОбластьПоиска = ОбластиПоиска().ВИнтернете Тогда
		ИскатьВИнтернете = Истина;
	Иначе
		ИскатьВИнтернете = Ложь;
	КонецЕсли;
	
	НастроитьФормуПоОбластиПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСледующиеКандидаты(Команда)
	
	Если Объект.НайденныеКандидаты.Количество() < РазмерСтраницы * (НомерСтраницы + 2) Тогда
		ВыполнитьПоискВИнтернете();
	Иначе
		ОтобразитьТекущуюСтраницу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПредыдущиеКандидаты(Команда)
	
	Если НомерСтраницы <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтраницы = НомерСтраницы - 1;
	ОтобразитьСтрокиПоНомеруСтраницы(НомерСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРасширенныйПоиск(Команда)
	
	Элементы.ГруппаОтбор.Видимость = Не Элементы.ГруппаОтбор.Видимость;
	Если Не Элементы.ГруппаОтбор.Видимость Тогда
		Элементы.КомандаРасширенныйПоиск.Заголовок = НСтр("ru = 'Показать расширенный поиск'");
	Иначе
		Элементы.КомандаРасширенныйПоиск.Заголовок = НСтр("ru = 'Скрыть расширенный поиск'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСправкаПоискОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("v8help://1cv8/QueryLanguageFullTextSearchInData");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПодборВСписокФильтра(Команда)
	
	ИмяРеквизита = СтрЗаменить(Команда.Имя, "КомандаПодбор", "");
	ТипЗначения = ЭтаФорма[ИмяРеквизита].ТипЗначения;
	
	ИмяФормыВыбора = ПолучитьИмяФормыВыбораПоТипу(ТипЗначения.Типы()[0]);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Список", ИмяРеквизита);
	Оповещение = Новый ОписаниеОповещения("ДобавитьСвойствоВСписокЗавершение", ЭтотОбъект, ПараметрыОповещения);
	
	ПараметрыФормы  = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ЭтаФорма["ЗначениеСвойства" + ИмяРеквизита]);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, , , , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьВСписокФильтра(Команда)
	
	ИмяРеквизита = СтрЗаменить(Команда.Имя, "КомандаДобавить", "");
	ЭтаФорма[ИмяРеквизита].Добавить();
	
	ИспользоватьФильтр = "ИспользоватьФильтрСвойства" + ИмяРеквизита;
	ЗаголовокФильтра = "ЗаголовокФильтрСвойства" + ИмяРеквизита;
	ЗаполнитьПредставлениеФильтра(ЭтаФорма[ИмяРеквизита], ЭтаФорма[ИспользоватьФильтр],
		ЭтаФорма[ЗаголовокФильтра], Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьЗначениеВТаблицеФильтра(Команда)
	
	ИмяРеквизита = СтрЗаменить(Команда.Имя, "КомандаУдалить", "");
	ТекущаяСтрока = Элементы["СписокФильтр" + ИмяРеквизита].ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыбраннаяСтрока = ЭтаФорма[ИмяРеквизита].НайтиПоИдентификатору(ТекущаяСтрока);
	ЭтаФорма[ИмяРеквизита].Удалить(ВыбраннаяСтрока);
	
	ИспользоватьФильтр = "ИспользоватьФильтрСвойства" + ИмяРеквизита;
	ЗаголовокФильтра = "ЗаголовокФильтрСвойства" + ИмяРеквизита;
	ЗаполнитьПредставлениеФильтра(ЭтаФорма[ИмяРеквизита], ЭтаФорма[ИспользоватьФильтр],
		ЭтаФорма[ЗаголовокФильтра], Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт)

	Возврат РекрутинговыеСайтыКлиентСервер.ИмяРеквизита(ДанныеСайтов, ИмяРеквизитаФормы, Сайт);

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеРекрутинговыхСайтов()
	
	Если ИспользоватьИнтеграциюРекрутинговыхСайтов Тогда
		МенеджерСайтов = РекрутинговыеСайты.МенеджерРекрутинговыхСайтов();
		Сайты = МенеджерСайтов.Сайты();
		ДанныеСайтов = МенеджерСайтов.ДанныеСайтов();
	КонецЕсли;
	
	ОбновитьОтображение();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение()
	
	Если Не ИспользоватьИнтеграциюРекрутинговыхСайтов Или Не ЗначениеЗаполнено(Сайты) Тогда
		ИскатьВИнтернете = Ложь;
		ОбластьПоиска = ОбластиПоиска().Внутри;
		Элементы.ОбластьПоиска.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из ДанныеСайтов Цикл
		Если Не КлючИЗначение.Значение.ДоступенПоискРезюме Тогда
			Продолжить;
		КонецЕсли;
		
		Сайт = КлючИЗначение.Ключ;
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ОбластьПоиска", Сайт);
		Элементы[ИмяРеквизита].Видимость = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификаторы()
	
	Если Не ИспользоватьИнтеграциюРекрутинговыхСайтов Тогда
		Элементы.ГруппаЗагрузкаКлассификаторов.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сайты) Тогда
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьКлассификаторыЗавершение", ЭтотОбъект);
		РекрутинговыеСайтыКлиент.НачатьЗагрузкуКлассификаторов(ЭтотОбъект, ОповещениеОЗавершении, Сайты);
	Иначе
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаКлассификаторыЗагружены;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификаторыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		Классификаторы = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого КлючИЗначение Из Классификаторы Цикл
			Если Классификаторы[КлючИЗначение.Ключ] = Неопределено Тогда
				Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
				Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок =
					НСтр("ru = 'Произошла ошибка загрузки классификаторов. Подробности в журнале регистрации'");
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		РекрутинговыеСайтыКлиент.СохранитьКлассификаторы(Классификаторы, ДанныеСайтов);
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаКлассификаторыЗагружены;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
		Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок =
			СтрШаблон(НСтр("ru = 'Произошла ошибка загрузки классификаторов: %1'"), Результат.КраткоеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Отменено" Тогда
		Элементы.ГруппаЗагрузкаКлассификаторов.ТекущаяСтраница = Элементы.ГруппаОшибкаЗагрузкиКлассификаторов;
		Элементы.НадписьОшибкаЗагрузкиКлассификаторов.Заголовок = 
			СтрШаблон(НСтр("ru = 'Загрузка классификаторов отменена. Обратитесь к администратору.'"));
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НайтиВнутри()
	
	ОчиститьСообщения();
	Если ПроверитьЗаполнение() Тогда
		НайденныеКандидаты.Очистить();
		НайтиФизическихЛиц();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВИнтернете()
	
	СайтыДляПоиска = СайтыДляПоиска();
	Если Не ЗначениеЗаполнено(СайтыДляПоиска) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны сайты для поиска.'"));
		Возврат;
	КонецЕсли;
	
	Если Не ЗаполненыВсеКритерииПоиска() Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтраницы = -1;
	РазмерСтраницы = 50;
	
	Для Каждого Сайт Из Сайты Цикл
		ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт)] = 0;
		ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "ЗагруженоКандидатов", Сайт)] = 0;
		ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт)] = 0;
	КонецЦикла;
	
	ВыполнитьПоискВИнтернете();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФильтры()
	
	УстановитьЗначенияПоУмолчанию();
	ИнициализироватьФильтрыПоИсточникам();
	ЗаполнитьПредставленияФильтров();
	ИнициализироватьФильтрыПоСвойствамОбъектов();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФильтрыПоИсточникам()
	
	ИнициализироватьФильтрПоИсточнику(Метаданные.Справочники.ЯзыкиНародовМира,
		ОтборЗнаниеЯзыковСписок, ЗнаниеЯзыковСписок);
	ИнициализироватьФильтрПоИсточнику(Метаданные.Справочники.СостояниеВБраке,
		ОтборСостояниеВБракеСписок, СостояниеВБракеСписок);
	ИнициализироватьФильтрПоИсточнику(Метаданные.Справочники.ВидыОбразованияФизическихЛиц,
		ОтборУровеньОбразованияСписок, УровеньОбразованияСписок);
	ИнициализироватьФильтрПоИсточнику(Метаданные.ПланыВидовХарактеристик.ХарактеристикиПерсонала,
		ОтборКомпетенцииСписок, КомпетенцииСписок);
	ИнициализироватьФильтрПоИсточнику(Метаданные.Справочники.ПричиныОтклоненияКандидатов,
		ОтборПричинаОтклоненияСписок, ПричинаОтклоненияСписок);
	ИнициализироватьФильтрПоИсточнику(Метаданные.Справочники.ЭтапыРаботыСКандидатами,
		ОтборЭтапРаботыСписок, ЭтапРаботыСписок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияФильтров()
	
	ЗаполнитьПредставлениеФильтра(ОтборГражданствоСписок, ИспользоватьГражданство,
		ЗаголовокОтборГражданство, Истина);
	ЗаполнитьПредставлениеФильтра(ЗнаниеЯзыковСписок, ИспользоватьЗнаниеЯзыков,
		ЗаголовокОтборЗнаниеЯзыков, Истина);
	ЗаполнитьПредставлениеФильтра(СостояниеВБракеСписок, ИспользоватьСостояниеВБраке,
		ЗаголовокОтборСостояниеВБраке, Истина);
	ЗаполнитьПредставлениеФильтра(УровеньОбразованияСписок, ИспользоватьУровеньОбразованияФизическогоЛица,
		ЗаголовокОтборУровеньОбразования, Истина);
	ЗаполнитьПредставлениеФильтра(ОтборУчебноеЗаведениеСписок, ИспользоватьУчебноеЗаведение,
		ЗаголовокОтборУчебноеЗаведение, Истина);
	ЗаполнитьПредставлениеФильтра(ОтборПрофессияСписок, ИспользоватьПрофессию,
		ЗаголовокОтборПрофессия, Истина);
	ЗаполнитьПредставлениеФильтра(ОтборСпециальностьСписок, ИспользоватьСпециальность,
		ЗаголовокОтборСпециальность, Истина);
	ЗаполнитьПредставлениеФильтра(ОтборПрофильДолжностиСписок, ИспользоватьПрофильДолжности,
		ЗаголовокОтборПрофильДолжности, Истина);
	ЗаполнитьПредставлениеФильтра(КомпетенцииСписок, ИспользоватьКомпетенции,
		ЗаголовокОтборКомпетенции, Истина);
	ЗаполнитьПредставлениеФильтра(ПричинаОтклоненияСписок, ИспользоватьПричинаОтклонения,
		ЗаголовокОтборПричинаОтклонения, Истина);
	ЗаполнитьПредставлениеФильтра(ЭтапРаботыСписок, ИспользоватьЭтапРаботы,
		ЗаголовокОтборЭтапРаботы, Истина);
	ЗаполнитьПредставлениеФильтра(ОтборОтветственныйРекрутерСписок, ИспользоватьОтветственныйРекрутер,
		ЗаголовокОтборОтветственныйРекрутер, Истина);

КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФильтрыПоСвойствамОбъектов()
	
	ВидыОбъектов = СтруктураВидыОбъектов();
	ЗаполнитьСвойстваОбъектов(ВидыОбъектов);
	
	ДобавляемыеРеквизиты = Новый Массив;
	СписочныеРеквизиты = Новый Структура;
	ЗначенияСвойствОбъектов = Новый Соответствие;
	Для Каждого ВидОбъекта Из ВидыОбъектов Цикл
		Для Каждого Свойство Из ВидОбъекта.Значение Цикл
			ТипЗначения = Свойство.ТипЗначения;
			Если ТипЗначения.Типы().Количество() = 1 Тогда
				Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ+ ПостфиксыПоТипамСвойств().ЧислоОт,
						ТипЗначения));
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ + ПостфиксыПоТипамСвойств().ЧислоДо,
						ТипЗначения));
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Дата")) Тогда
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ + ПостфиксыПоТипамСвойств().ДатаНачала,
						ТипЗначения));
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ + ПостфиксыПоТипамСвойств().ДатаОкончания,
						ТипЗначения));
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Строка"))
					Или ТипЗначения.СодержитТип(Тип("Булево")) Тогда
					ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ, ТипЗначения));
				Иначе
					ДобавитьРеквизитСписокЗначений(ДобавляемыеРеквизиты, Свойство, СписочныеРеквизиты, ТипЗначения, ВидОбъекта);
					ДобавитьРеквизитЗначениеСвойства(Свойство, ЗначенияСвойствОбъектов, ДобавляемыеРеквизиты, ВидОбъекта);
				КонецЕсли;
			Иначе
				ДобавитьРеквизитСписокЗначений(ДобавляемыеРеквизиты, Свойство, СписочныеРеквизиты, ТипЗначения, ВидОбъекта);
			КонецЕсли;
			ДобавитьРеквизитИспользоватьФильтр(Свойство, ДобавляемыеРеквизиты, ВидОбъекта.Ключ);
		КонецЦикла;
	КонецЦикла;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		Элементы.ГруппаДополнительныеРеквизитыИСведения.Видимость = Истина;
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		Для Каждого Реквизит Из СписочныеРеквизиты Цикл
			ЭтаФорма[Реквизит.Ключ].ТипЗначения = Реквизит.Значение;
		КонецЦикла;
		Для Каждого Свойство Из ЗначенияСвойствОбъектов Цикл
			ЭтаФорма["ЗначениеСвойства" + Свойство.Ключ.Имя + Свойство.Значение] = Свойство.Ключ;
		КонецЦикла;
		ВывестиРеквизитыСвойствОбъектовНаФорму(ВидыОбъектов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитЗначениеСвойства(Свойство, ЗначенияСвойствОбъектов, ДобавляемыеРеквизиты, ВидОбъекта)
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Свойство));
	ОписаниеТипаСвойства = Новый ОписаниеТипов(МассивТипов);
	ЗначенияСвойствОбъектов.Вставить(Свойство, ВидОбъекта.Ключ);
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЗначениеСвойства" + Свойство.Имя + ВидОбъекта.Ключ, ОписаниеТипаСвойства));
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитСписокЗначений(ДобавляемыеРеквизиты, Свойство, СписочныеРеквизиты, ТипЗначения, ВидОбъекта)
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + ВидОбъекта.Ключ, Новый ОписаниеТипов("СписокЗначений")));
	ДобавитьРеквизитЗаголовокФильтр(Свойство, ДобавляемыеРеквизиты, ВидОбъекта);
	СписочныеРеквизиты.Вставить(Свойство.Имя + ВидОбъекта.Ключ, ТипЗначения);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитИспользоватьФильтр(Свойство, ДобавляемыеРеквизиты, ВидОбъекта)
	
	ИмяРеквизита = "ИспользоватьФильтрСвойства" + Свойство.Имя + ВидОбъекта;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Булево")));
	ЭтаФорма["ИспользуемыеСвойства" + ВидОбъекта].Добавить(Свойство);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитЗаголовокФильтр(Свойство, ДобавляемыеРеквизиты, ВидОбъекта)
	
	ИмяРеквизита = "ЗаголовокФильтрСвойства" + Свойство.Имя + ВидОбъекта.Ключ;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка")));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваОбъектов(ВидыОбъектов)
	
	ВидыСвойств = Новый Массив;
	ВидыСвойств.Добавить("ДополнительныеРеквизиты");
	Если ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДополнительныеСведения) Тогда
		ВидыСвойств.Добавить("ДополнительныеСведения");
	КонецЕсли;
	
	Для Каждого ВидОбъекта Из ВидыОбъектов Цикл
		Для Каждого ВидСвойства Из ВидыСвойств Цикл
			СписокСвойств = УправлениеСвойствамиСлужебный.СписокСвойствДляВидаОбъектов("Справочник." + ВидОбъекта.Ключ, ВидСвойства);
			Если СписокСвойств <> Неопределено Тогда
				Для Каждого Элемент Из СписокСвойств Цикл
					ВидОбъекта.Значение.Добавить(Элемент.Свойство);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитыСвойствОбъектовНаФорму(ВидыОбъектов)
	
	Для Каждого ВидОбъекта Из ВидыОбъектов Цикл
		ИспользуемыеСвойства = ЭтаФорма["ИспользуемыеСвойства"+ВидОбъекта.Ключ];
		Для Каждого Свойство Из ИспользуемыеСвойства Цикл
			ИмяСвойства = Свойство.Значение.Имя + ВидОбъекта.Ключ;
			ЗаголовокРеквизита = Свойство.Значение.Заголовок;
			ТипЗначения = Свойство.Значение.ТипЗначения;
			
			ГруппаСвойство = Элементы.Добавить(
				"ГруппаСвойство" + ИмяСвойства,
				Тип("ГруппаФормы"),
				Элементы.ГруппаДополнительныеРеквизитыИСведения);
			ГруппаСвойство.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаСвойство.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаСвойство.ОтображатьЗаголовок = Ложь;
			ГруппаСвойство.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			ПолеИспользоватьФильтр = Элементы.Добавить("ПолеИспользоватьФильтрСвойства" + ИмяСвойства,
				Тип("ПолеФормы"),
				ГруппаСвойство);
			ПолеИспользоватьФильтр.Вид = ВидПоляФормы.ПолеФлажка;
			ПолеИспользоватьФильтр.Заголовок = ЗаголовокРеквизитаИспользоватьФильтр(ЗаголовокРеквизита, ВидОбъекта.Ключ);
			ПолеИспользоватьФильтр.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			ПолеИспользоватьФильтр.ПутьКДанным = "ИспользоватьФильтрСвойства" + ИмяСвойства;
			
			Если ТипЗначения.Типы().Количество() = 1 Тогда
				Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
					ВывестиРеквизитДляСвойстваЧисло(ИмяСвойства, ГруппаСвойство);
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Дата")) Тогда
					ВывестиРеквизитДляСвойстваДата(ИмяСвойства, ГруппаСвойство);
				ИначеЕсли ТипЗначения.СодержитТип(Тип("Строка"))
					Или ТипЗначения.СодержитТип(Тип("Булево")) Тогда
					ВывестиРеквизитДляСвойстваБулевоСтрока(ИмяСвойства, ГруппаСвойство, ЗаголовокРеквизита);
				Иначе
					ВывестиРеквизитСсылочныйТип(ИмяСвойства, ГруппаСвойство, ЗаголовокРеквизита, Ложь);
				КонецЕсли;
			Иначе
				ВывестиРеквизитСсылочныйТип(ИмяСвойства, ГруппаСвойство, ЗаголовокРеквизита, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитСсылочныйТип(ИмяСвойства, ГруппаСвойство, ЗаголовокРеквизита, СоставнойТип)
	
	ГруппаОтбор = Элементы.Добавить(
		"ГруппаОтбор" + ИмяСвойства,
		Тип("ГруппаФормы"),
		ГруппаСвойство);
	ГруппаОтбор.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаОтбор.Поведение = ПоведениеОбычнойГруппы.Всплывающая;
	ГруппаОтбор.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЗаголовокФильтра = "ЗаголовокФильтрСвойства" + ИмяСвойства;
	ЭтаФорма[ЗаголовокФильтра] = НСтр("ru = 'Заполнить'");
	ГруппаОтбор.ПутьКДаннымЗаголовка = ЗаголовокФильтра;
	ГруппаОтбор.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаКоманды = Элементы.Добавить(
		"ГруппаКоманды" + ИмяСвойства,
		Тип("ГруппаФормы"),
		ГруппаОтбор);
	ГруппаКоманды.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКоманды.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКоманды.ОтображатьЗаголовок = Ложь;
	
	СписокФильтр = Элементы.Добавить("СписокФильтр" + ИмяСвойства,
		Тип("ТаблицаФормы"),
		ГруппаОтбор);
	СписокФильтр.Заголовок = ЗаголовокРеквизита;
	СписокФильтр.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СписокФильтр.ПутьКДанным = ИмяСвойства;
	СписокФильтр.Отображение = ОтображениеТаблицы.Список;
	СписокФильтр.АвтоМаксимальнаяШирина = Ложь;
	СписокФильтр.МаксимальнаяШирина = 4;
	СписокФильтр.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	СписокФильтр.МаксимальнаяВысотаВСтрокахТаблицы = 12;
	СписокФильтр.РастягиватьПоГоризонтали = Ложь;
	СписокФильтр.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	СписокФильтр.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	СписокФильтр.АвтоВводНовойСтроки = Ложь;
	СписокФильтр.УстановитьДействие("ПриИзменении", "Подключаемый_СписокФильтрПриИзменении");
	
	ПолеЗначениеФильтр = Элементы.Добавить("СписокФильтр" + ИмяСвойства + "Значение",
		Тип("ПолеФормы"),
		СписокФильтр);
	ПолеЗначениеФильтр.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтр.ПутьКДанным = ИмяСвойства + ".Значение";
	
	Если СоставнойТип Тогда
		ИмяКомандыДобавить = "КомандаДобавить" + ИмяСвойства;
		КомандаДобавить = Команды.Добавить(ИмяКомандыДобавить);
		КомандаДобавить.Действие = "Подключаемый_ДобавитьВСписокФильтра";
		
		КнопкаДобавить = Элементы.Добавить(
			"КнопкаДобавить" + ИмяСвойства,
			Тип("КнопкаФормы"),
			ГруппаКоманды);
		КнопкаДобавить.ИмяКоманды = ИмяКомандыДобавить;
		КнопкаДобавить.Заголовок  = НСтр("ru = 'Добавить'");
	Иначе
		ИмяКомандыПодбор = "КомандаПодбор" + ИмяСвойства;
		КомандаПодбор = Команды.Добавить(ИмяКомандыПодбор);
		КомандаПодбор.Действие = "Подключаемый_ПодборВСписокФильтра";
		
		КнопкаПодбор = Элементы.Добавить(
			"КнопкаПодбор" + ИмяСвойства,
			Тип("КнопкаФормы"),
			ГруппаКоманды);
		КнопкаПодбор.ИмяКоманды = ИмяКомандыПодбор;
		КнопкаПодбор.Заголовок  = НСтр("ru = 'Подбор'");
	КонецЕсли;
	
	ИмяКомандыУдалить = "КомандаУдалить" + ИмяСвойства;
	КомандаУдалить = Команды.Добавить(ИмяКомандыУдалить);
	КомандаУдалить.Действие = "Подключаемый_УдалитьЗначениеВТаблицеФильтра";
	
	КнопкаУдалить = Элементы.Добавить(
		"КнопкаУдалить" + ИмяСвойства,
		Тип("КнопкаФормы"),
		ГруппаКоманды);
	КнопкаУдалить.ИмяКоманды = ИмяКомандыУдалить;
	КнопкаУдалить.Отображение = ОтображениеКнопки.Картинка;
	КнопкаУдалить.Картинка = БиблиотекаКартинок.Удалить;
	КнопкаУдалить.Ширина = 3;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитДляСвойстваБулевоСтрока(ИмяСвойства, ГруппаСвойство, ЗаголовокРеквизита)
	
	ПолеЗначениеФильтр = Элементы.Добавить("ПолеЗначениеФильтрСвойства" + ИмяСвойства,
		Тип("ПолеФормы"),
		ГруппаСвойство);
	ПолеЗначениеФильтр.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтр.Заголовок = ЗаголовокРеквизита;
	ПолеЗначениеФильтр.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеЗначениеФильтр.ПутьКДанным = ИмяСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитДляСвойстваДата(ИмяСвойства, ГруппаСвойство)
	
	ПолеЗначениеФильтрОт = Элементы.Добавить(СтрШаблон("%1%2%3", "ПолеЗначениеФильтрСвойства", ИмяСвойства, ПостфиксыПоТипамСвойств().ДатаНачала),
		Тип("ПолеФормы"),
		ГруппаСвойство);
	ПолеЗначениеФильтрОт.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтрОт.Заголовок = НСтр("ru = 'с'");
	ПолеЗначениеФильтрОт.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеЗначениеФильтрОт.ПутьКДанным = ИмяСвойства + ПостфиксыПоТипамСвойств().ДатаНачала;
	
	ПолеЗначениеФильтрДо = Элементы.Добавить("ПолеЗначениеФильтрСвойства" + ИмяСвойства + ПостфиксыПоТипамСвойств().ДатаОкончания,
		Тип("ПолеФормы"),
		ГруппаСвойство);
	ПолеЗначениеФильтрДо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтрДо.Заголовок = НСтр("ru = 'по'");
	ПолеЗначениеФильтрДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеЗначениеФильтрДо.ПутьКДанным = ИмяСвойства + ПостфиксыПоТипамСвойств().ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитДляСвойстваЧисло(ИмяСвойства, ГруппаСвойство)
	
	ПолеЗначениеФильтрОт = Элементы.Добавить("ПолеЗначениеФильтрСвойства" + ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоОт,
		Тип("ПолеФормы"),
		ГруппаСвойство);
	ПолеЗначениеФильтрОт.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтрОт.Заголовок = НСтр("ru = 'от'");
	ПолеЗначениеФильтрОт.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеЗначениеФильтрОт.ПутьКДанным = ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоОт;
	
	ПолеЗначениеФильтрДо = Элементы.Добавить("ПолеЗначениеФильтрСвойства" + ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоДо,
		Тип("ПолеФормы"),
		ГруппаСвойство);
	ПолеЗначениеФильтрДо.Вид = ВидПоляФормы.ПолеВвода;
	ПолеЗначениеФильтрДо.Заголовок = НСтр("ru = 'до'");
	ПолеЗначениеФильтрДо.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	ПолеЗначениеФильтрДо.ПутьКДанным = ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоДо;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФильтрПоИсточнику(Источник, ОтборСписок, СписокВыбранных)
	
	ПолноеИмя = Источник.ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Объекты.Ссылка КАК Ссылка
		|ИЗ
		|	ПолноеИмяОбъекта КАК Объекты
		|ГДЕ
		|	Объекты.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолноеИмяОбъекта", ПолноеИмя);
	МассивОбъектовСправочника = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ОтборСписок.ЗагрузитьЗначения(МассивОбъектовСправочника);
	
	КоличествоВыбранных = СписокВыбранных.Количество();
	Если КоличествоВыбранных = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Счетчик = 1 По КоличествоВыбранных Цикл
		ВыбранноеЗначение = СписокВыбранных[КоличествоВыбранных - Счетчик];
		НайденныйЭлемент = ОтборСписок.НайтиПоЗначению(ВыбранноеЗначение.Значение);
		Если НайденныйЭлемент = Неопределено Тогда
			СписокВыбранных.Удалить(ВыбранноеЗначение);
		Иначе
			НайденныйЭлемент.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РегионНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено 
		Или ВыбранныйЭлемент = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Регион = ВыбранныйЭлемент;
	
	УстановитьЗаголовокНадписиРегион();
	
КонецПроцедуры

&НаСервере 
Функция СписокВыбораНаСервере(ИмяСписка)
	
	СписокВыбора = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(Сайты) Тогда
		МенеджерСайтов = РекрутинговыеСайты. МенеджерРекрутинговыхСайтов(Сайты);
		СписокВыбора = МенеджерСайтов.ОбъединенныйСписокВыбораПоКлассификаторам(ИмяСписка);
	КонецЕсли;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура ВыборИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокВыбранныхЗначений = Новый СписокЗначений;
	СписокВыбранныхЗначений.Добавить(ВыбранныйЭлемент.Значение, ВыбранныйЭлемент.Представление);
	Объект[ДополнительныеПараметры.ИмяЭлемента] = СписокВыбранныхЗначений;
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоОдиночногоВыбораИзСписка(Элемент) 
	
	СписокВыбора = СписокВыбораНаСервере(Элемент.Имя);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлемента", Элемент.Имя);
	
	Оповещение  = Новый ОписаниеОповещения("ВыборИзСпискаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВыборИзСписка(Оповещение, СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиФизическихЛиц()
	
	ДлительнаяОперация = ДлительнаяОперацияПоискаФизическихЛиц(УникальныйИдентификатор, Объект.КлючевоеСлово);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатПоиска", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПоискаФизическихЛиц(УникальныйИдентификатор, КлючевоеСлово)
	
	ОтборыСКД = ОтборыДляСКД();
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ПоискРезюмеВИнтернете.ПоискКандидатов",
		КлючевоеСлово, ОтборыСКД);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатПоиска(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	ВывестиКандидатов(Результат.АдресРезультата);
	
	УстановитьНадписьПоискаКандидатов();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиКандидатов(АдресРезультата)
	
	Если АдресРезультата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивКандидатов = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если МассивКандидатов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из МассивКандидатов Цикл
		СтрокаТЗРезультата = НайденныеКандидаты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗРезультата, Строка);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ОтборыДляСКД()
	
	Отборы = Новый Структура;
	// ОбластиПоиска
	Отборы.Вставить("ОбластьПоискаКандидаты", ОбластьПоискаКандидаты);
	Отборы.Вставить("ОбластьПоискаСотрудники", ОбластьПоискаСотрудники);
	Отборы.Вставить("ОбластьПоискаУволенные", ОбластьПоискаУволенные);
	Отборы.Вставить("ОбластьПоискаКадровыйРезерв", ОбластьПоискаКадровыйРезерв);
	// Общее
	Отборы.Вставить("ПолФизическогоЛица", ПолФизическогоЛица);
	Отборы.Вставить("ИспользоватьВозраст", ИспользоватьВозраст);
	Отборы.Вставить("ВозрастФизическогоЛицаОт", ВозрастФизическогоЛицаОт);
	Отборы.Вставить("ВозрастФизическогоЛицаДо", ВозрастФизическогоЛицаДо);
	Отборы.Вставить("ИспользоватьГражданство", ИспользоватьГражданство);
	Отборы.Вставить("ОтборГражданствоСписок", ОтборГражданствоСписок);
	Отборы.Вставить("ИспользоватьЗнаниеЯзыков", ИспользоватьЗнаниеЯзыков);
	Отборы.Вставить("ЗнаниеЯзыковСписок", ЗнаниеЯзыковСписок);
	Отборы.Вставить("ИспользоватьСостояниеВБраке", ИспользоватьСостояниеВБраке);
	Отборы.Вставить("СостояниеВБракеСписок", СостояниеВБракеСписок);
	Отборы.Вставить("ИспользоватьОпытРаботы", ИспользоватьОпытРаботы);
	Отборы.Вставить("ОпытРаботы", ОпытРаботы);
	// Условия
	Отборы.Вставить("ИспользоватьУровеньЗарплатыФизическогоЛица", ИспользоватьУровеньЗарплатыФизическогоЛица);
	Отборы.Вставить("УровеньЗарплатыФизическогоЛицаОт", УровеньЗарплатыФизическогоЛицаОт);
	Отборы.Вставить("УровеньЗарплатыФизическогоЛицаДо", УровеньЗарплатыФизическогоЛицаДо);
	Отборы.Вставить("СкрыватьРезюмеФизическогоЛицаБезЗарплаты", СкрыватьРезюмеФизическогоЛицаБезЗарплаты);
	// Образование
	Отборы.Вставить("ИспользоватьУровеньОбразованияФизическогоЛица", ИспользоватьУровеньОбразованияФизическогоЛица);
	Отборы.Вставить("УровеньОбразованияСписок", УровеньОбразованияСписок);
	Отборы.Вставить("ИспользоватьУчебноеЗаведение", ИспользоватьУчебноеЗаведение);
	Отборы.Вставить("ОтборУчебноеЗаведениеСписок", ОтборУчебноеЗаведениеСписок);
	// Другое
	Отборы.Вставить("ИспользоватьПрофессию", ИспользоватьПрофессию);
	Отборы.Вставить("ОтборПрофессияСписок", ОтборПрофессияСписок);
	Отборы.Вставить("ИспользоватьСпециальность", ИспользоватьСпециальность);
	Отборы.Вставить("ОтборСпециальностьСписок", ОтборСпециальностьСписок);
	Отборы.Вставить("ИспользоватьПрофильДолжности", ИспользоватьПрофильДолжности);
	Отборы.Вставить("ОтборПрофильДолжностиСписок", ОтборПрофильДолжностиСписок);
	Отборы.Вставить("ИспользоватьКомпетенции", ИспользоватьКомпетенции);
	Отборы.Вставить("КомпетенцииСписок", КомпетенцииСписок);
	Отборы.Вставить("ИспользоватьПричинаОтклонения", ИспользоватьПричинаОтклонения);
	Отборы.Вставить("ПричинаОтклоненияСписок", ПричинаОтклоненияСписок);
	Отборы.Вставить("ИспользоватьЭтапРаботы", ИспользоватьЭтапРаботы);
	Отборы.Вставить("ЭтапРаботыСписок", ЭтапРаботыСписок);
	Отборы.Вставить("ИспользоватьОтветственныйРекрутер", ИспользоватьОтветственныйРекрутер);
	Отборы.Вставить("ОтборОтветственныйРекрутерСписок", ОтборОтветственныйРекрутерСписок);
	Отборы.Вставить("ИспользоватьРейтингКандидата", ИспользоватьРейтингКандидата);
	Отборы.Вставить("РейтингКандидатаОт", РейтингКандидатаОт);
	Отборы.Вставить("РейтингКандидатаДо", РейтингКандидатаДо);
	// Дополнительные реквизиты и сведения
	ДополнитьОтборыСвойствамиОбъектов(Отборы);
	
	Возврат Отборы;
	
КонецФункции

&НаСервере
Процедура ДополнитьОтборыСвойствамиОбъектов(Отборы)
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить("ФизическиеЛица");
	МассивОбъектов.Добавить("Кандидаты");
	МассивОбъектов.Добавить("Сотрудники");
	Отборы.Вставить("ВидыОбъектов", МассивОбъектов);
	
	Для Каждого ВидОбъекта Из МассивОбъектов Цикл
		Свойства = Новый Массив();
		Значения = Новый Структура();
		Для Каждого Свойство Из ЭтаФорма["ИспользуемыеСвойства"+ВидОбъекта] Цикл
			ИмяСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство.Значение, "Имя") + ВидОбъекта;
			Если ЭтаФорма["ИспользоватьФильтрСвойства" + ИмяСвойства] Тогда
				Свойства.Добавить(Свойство.Значение);
				ТипЗначения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Свойство.Значение, "ТипЗначения");
				Если ТипЗначения.Типы().Количество() = 1 Тогда
					Если ТипЗначения.СодержитТип(Тип("Дата")) Тогда
						ЗначенияСвойстваДата = Новый Структура();
						ЗначенияСвойстваДата.Вставить("С", ЭтаФорма[ИмяСвойства + ПостфиксыПоТипамСвойств().ДатаНачала]);
						ЗначенияСвойстваДата.Вставить("По", ЭтаФорма[ИмяСвойства + ПостфиксыПоТипамСвойств().ДатаОкончания]);
						Значения.Вставить(ИмяСвойства, ЗначенияСвойстваДата);
					ИначеЕсли ТипЗначения.СодержитТип(Тип("Число")) Тогда
						ЗначенияСвойстваЧисло = Новый Структура();
						ЗначенияСвойстваЧисло.Вставить("От", ЭтаФорма[ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоОт]);
						ЗначенияСвойстваЧисло.Вставить("До", ЭтаФорма[ИмяСвойства + ПостфиксыПоТипамСвойств().ЧислоДо]);
						Значения.Вставить(ИмяСвойства, ЗначенияСвойстваЧисло);
					Иначе
						Значения.Вставить(ИмяСвойства, ЭтаФорма[ИмяСвойства]);
					КонецЕсли;
				Иначе
					Значения.Вставить(ИмяСвойства, ЭтаФорма[ИмяСвойства]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Отборы.Вставить("Свойства" + ВидОбъекта, Свойства);
		Отборы.Вставить("Значения" + ВидОбъекта, Значения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СайтыДляПоиска()
	
	Результат = Новый Массив;
	
	Для Каждого Сайт Из Сайты Цикл
		Если ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "ОбластьПоиска", Сайт)] Тогда
			Результат.Добавить(Сайт);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СформироватьИнформационнуюНадпись(НомерСтраницы)
	
	ВсегоКандидатов = 0;
	
	Для Каждого Сайт Из Сайты Цикл
		ВсегоКандидатов = ВсегоКандидатов + ЭтотОбъект[ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт)];
	КонецЦикла;
	
	ИнформационнаяНадпись = СтрШаблон(НСтр("ru = 'Показаны кандидаты с %1 по %2 из %3'"),
		НомерСтраницы * 50 + 1,
		НомерСтраницы * 50 + Мин(50, НайденныеКандидатыПостраничная.Количество()),
		ВсегоКандидатов);
	
	Элементы.ИнформационнаяНадписьКоличествоКандидатов.Заголовок = ИнформационнаяНадпись;
	
КонецПроцедуры

&НаСервере
Функция ОтобразитьСтрокиПоНомеруСтраницы(НомерСтраницы)
	
	Результат = Ложь;
	
	НачальныйИндекс = 50 * НомерСтраницы;
	КонечныйИндекс = 50 * (НомерСтраницы + 1);
	
	Если НачальныйИндекс < Объект.НайденныеКандидаты.Количество() Тогда
		НайденныеКандидатыПостраничная.Очистить();
	Иначе
		Возврат Результат;
	КонецЕсли;
		
	Для Индекс = НачальныйИндекс По КонечныйИндекс - 1 Цикл
		
		Если Индекс >= Объект.НайденныеКандидаты.Количество() Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = НайденныеКандидатыПостраничная.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Объект.НайденныеКандидаты[Индекс]);
		
	КонецЦикла;
	
	СформироватьИнформационнуюНадпись(НомерСтраницы);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискВИнтернете()
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьПоискВИнтернетеЗавершение", ЭтотОбъект);
	
	ДлительнаяОперация = ДлительнаяОперацияПоискаКандидатов();
	
	Если ЗначениеЗаполнено(ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Ищем кандидатов.'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияПоискаКандидатов() Экспорт
	
	СтруктураОтбора = РекрутинговыеСайты.СтруктураОтбораКандидатов();
	Для Каждого КлючИЗначение Из СтруктураОтбора Цикл
		Если КлючИЗначение.Ключ = "ТолькоВНазвании"
			Или КлючИЗначение.Ключ = "СкрыватьРезюмеБезЗарплаты" Тогда
			СтруктураОтбора[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		Иначе
			Если ЭтаФорма["Использовать" + КлючИЗначение.Ключ] Тогда
				СтруктураОтбора[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СтруктураОтбора.КлючевоеСлово = Объект.КлючевоеСлово;
	
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("СтруктураОтбора", СтруктураОтбора);
	ПараметрыМетода.Вставить("Сайты", СайтыДляПоиска());
	ПараметрыМетода.Вставить("ТаблицаНайденныхКандидатов", Объект.НайденныеКандидаты.Выгрузить());
	
	Для Каждого Сайт Из Сайты Цикл
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт);
		ПараметрыМетода.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт);
		ПараметрыМетода.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ЗагруженоКандидатов", Сайт);
		ПараметрыМетода.Вставить(ИмяРеквизита, ЭтотОбъект[ИмяРеквизита]);
	КонецЦикла;
	
	ИмяМетода = "РекрутинговыеСайты.ВыполнитьПоискКандидатов";
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода, ПараметрыМетода);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПоискВИнтернетеЗавершение(ДлительнаяОперация, ДополнительныеПараметры = Неопределено) Экспорт

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, ДлительнаяОперация.КраткоеПредставлениеОшибки);
		Возврат;
	ИначеЕсли Не ДлительнаяОперация.Статус = "Выполнено" Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилища = ДлительнаяОперация.АдресРезультата;
	
	Если Не ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТаблицуНайденныхКандидатов();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуНайденныхКандидатов()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Объект.НайденныеКандидаты.Загрузить(Результат.ТаблицаНайденныхКандидатов);
	
	Для Каждого Сайт Из Сайты Цикл
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "НомерПорции", Сайт);
		ЭтотОбъект[ИмяРеквизита] = Результат[ИмяРеквизита];
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ВсегоКандидатов", Сайт);
		ЭтотОбъект[ИмяРеквизита] = Результат[ИмяРеквизита];
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ЗагруженоКандидатов", Сайт);
		ЭтотОбъект[ИмяРеквизита] = ЭтотОбъект[ИмяРеквизита] + Результат[ИмяРеквизита];
	КонецЦикла;
	
	ОтобразитьТекущуюСтраницу();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьТекущуюСтраницу()
		
	Если ОтобразитьСтрокиПоНомеруСтраницы(НомерСтраницы + 1) Тогда
		НомерСтраницы = НомерСтраницы + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаДоступностиЭлементовФормы()
	
	Элементы.ВозрастОт.Доступность = ИспользоватьВозрастОт;
	Элементы.ВозрастДо.Доступность = ИспользоватьВозрастДо;
	Элементы.Регион.Видимость = ИспользоватьРегион;
	Элементы.УровеньЗарплатыОт.Доступность = ИспользоватьУровеньЗарплатыОт;
	Элементы.СкрыватьРезюмеБезЗарплаты.Доступность = ИспользоватьУровеньЗарплатыОт;
	Элементы.УровеньЗарплатыДо.Доступность = ИспользоватьУровеньЗарплатыДо;
	Элементы.Пол.Доступность = ИспользоватьПол;
	Элементы.УровеньОбразования.Доступность = ИспользоватьУровеньОбразования;
	Элементы.ПериодРазмещения.Доступность = ИспользоватьПериодРазмещения;
	Элементы.НайденныеКандидатыПостраничнаяГдеНайден.Видимость = Сайты <> Неопределено И Сайты.Количество() > 1;
	
КонецПроцедуры

&НаСервере
Функция ЗаполненыВсеКритерииПоиска() 
	
	Отказ = Ложь;
	Ошибки = Неопределено;
	
	Если Не ЗначениеЗаполнено(Объект.КлючевоеСлово) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.КлючевоеСлово", НСтр("ru = 'Поле ""Ключевое слово"" не заполнено'"), "");
	КонецЕсли;
		
	Если ИспользоватьВозрастОт 
		И Не ЗначениеЗаполнено(Объект.ВозрастОт) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ВозрастОт", НСтр("ru = 'Поле ""Возраст от"" не заполнено'"), "");
	КонецЕсли;
	
	Если ИспользоватьВозрастДо 
		И Не ЗначениеЗаполнено(Объект.ВозрастДо) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ВозрастДо", НСтр("ru = 'Поле ""Возраст до"" не заполнено'"), "");
	КонецЕсли;
	
	Если ИспользоватьРегион 
		И Не ЗначениеЗаполнено(Объект.Регион) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Регион", НСтр("ru = 'Поле ""Город"" не заполнено'"), "");
	КонецЕсли;

	Если ИспользоватьУровеньЗарплатыОт 
		И Не ЗначениеЗаполнено(Объект.УровеньЗарплатыОт) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.УровеньЗарплатыОт", НСтр("ru = 'Поле ""Зарплата от"" не заполнено'"), "");
	КонецЕсли;
	
	Если ИспользоватьУровеньЗарплатыДо 
		И Не ЗначениеЗаполнено(Объект.УровеньЗарплатыДо) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.УровеньЗарплатыДо", НСтр("ru = 'Поле ""Зарплата до"" не заполнено'"), "");
	КонецЕсли;
	
	Если ИспользоватьПол 
		И Не ЗначениеЗаполнено(Объект.Пол) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.Пол", НСтр("ru = 'Поле ""Пол"" не заполнено'"), "");
	КонецЕсли;

	Если ИспользоватьУровеньОбразования 
		И Не ЗначениеЗаполнено(Объект.УровеньОбразования) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.УровеньОбразования", НСтр("ru = 'Поле ""Уровень образования"" не заполнено'"), "");
	КонецЕсли;

	Если ИспользоватьПериодРазмещения 
		И Не ЗначениеЗаполнено(Объект.ПериодРазмещения) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодРазмещения", НСтр("ru = 'Поле ""Период размещения"" не заполнено'"), "");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокНадписиРегион()
	
	Элементы.Регион.Заголовок = "";
	Если Объект.Регион.Количество() = 0 Тогда
		Элементы.Регион.Заголовок = НСтр("ru = 'Заполнить'");
	Иначе
		ЗаполнитьПредставлениеФильтра(Объект.Регион, Истина, Элементы.Регион.Заголовок, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоОбластиПоиска()
	
	Если ИскатьВИнтернете Тогда
		ОбластьПоиска = ОбластиПоиска().ВИнтернете;
		Элементы.КомандаНайти.Доступность = Истина;
		Элементы.КомандаНайтиДоп.Доступность = Истина;
	Иначе
		ОбластьПоиска = ОбластиПоиска().Внутри;
		Элементы.ГруппаЗагрузкаКлассификаторов.Видимость = Ложь;
		Элементы.НадписьПоиск.Видимость = ПолнотекстовыйПоискРазрешен;
		Элементы.НадписьПолнотекстовыйПоиск.Видимость = Не ПолнотекстовыйПоискРазрешен;
		Элементы.КомандаНайти.Доступность = ПолнотекстовыйПоискРазрешен;
		Элементы.КомандаНайтиДоп.Доступность = ПолнотекстовыйПоискРазрешен;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаРекрутинговыеСайты", "Видимость", ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВнутренняяБаза", "Видимость", Не ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТолькоВНазвании", "Видимость", ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНайденныеКандидатыВнутренние", "Видимость", Не ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНайденныеКандидаты", "Видимость", ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборКандидаты", "Видимость", ИскатьВИнтернете);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтборФизическиеЛица", "Видимость", Не ИскатьВИнтернете);

КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьПоискаКандидатов()
	
	Если НайденныеКандидаты.Количество() > 0 Тогда
		Элементы.ГруппаИнформация.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаИнформация.Видимость = Истина;
	НадписьПоискТекст = НСтр("ru = 'Никого не найдено, попробуйте расширить критерии поиска'");
	Элементы.НадписьПоиск.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(НадписьПоискТекст);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчанию()
	
	ОбластьПоискаКандидаты = Истина;
	ОбластьПоискаСотрудники = Истина;
	ОбластьПоискаУволенные = Истина;
	
	ЧтениеКадровыйРезерв = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.КадровыйРезерв);
	ОбластьПоискаКадровыйРезерв = ЧтениеКадровыйРезерв;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбластьПоискаКадровыйРезерв", "Видимость",
		ЧтениеКадровыйРезерв);

	ВозрастФизическогоЛицаОт = 18;
	ВозрастФизическогоЛицаДо = 65;
	ОпытРаботы = Обработки.ПоискРезюмеВИнтернете.ОпытРаботыФизическогоЛица().Более1Года;
	
КонецПроцедуры

&НаСервере
Процедура ИспользуемыеСайты()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюРекрутинговыхСайтов") Тогда
		ИскатьВИнтернете = Ложь;
		ОбластьПоиска = ОбластиПоиска().Внутри;
		Элементы.ОбластьПоиска.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Для Каждого Сайт Из Сайты Цикл
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "Разрешен", Сайт);
		ПоискРазрешен = Не (Сайты.Найти(Сайт) = Неопределено);
		ЭтотОбъект[ИмяРеквизита] = ПоискРазрешен;
		
		ИмяРеквизита = ИмяРеквизита(ДанныеСайтов, "ОбластьПоиска", Сайт);
		ЭтотОбъект[ИмяРеквизита] = ЭтотОбъект[ИмяРеквизита] И ПоискРазрешен;
		
		Элементы[ИмяРеквизита].Видимость = ПоискРазрешен;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьФильтры()
	
	Объект.Пол.Очистить();
	Объект.Регион.Очистить();
	Объект.УровеньОбразования.Очистить();
	Объект.ПериодРазмещения.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОбщиеКлассификаторы()
	
	Обработки.ПоискРезюмеВИнтернете.ЗагрузитьОбщиеСправочники();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Настройки = Новый Структура();
	Настройки.Вставить("ИскатьВИнтернете", ИскатьВИнтернете);
	//Общее
	Настройки.Вставить("ПолФизическогоЛица", ПолФизическогоЛица);
	Настройки.Вставить("ИспользоватьВозраст", ИспользоватьВозраст);
	Настройки.Вставить("ВозрастФизическогоЛицаОт", ВозрастФизическогоЛицаОт);
	Настройки.Вставить("ВозрастФизическогоЛицаДо", ВозрастФизическогоЛицаДо);
	Настройки.Вставить("ИспользоватьГражданство", ИспользоватьГражданство);
	Настройки.Вставить("ОтборГражданствоСписок", ОтборГражданствоСписок);
	Настройки.Вставить("ИспользоватьЗнаниеЯзыков", ИспользоватьЗнаниеЯзыков);
	Настройки.Вставить("ЗнаниеЯзыковСписок", ЗнаниеЯзыковСписок);
	Настройки.Вставить("ИспользоватьСостояниеВБраке", ИспользоватьСостояниеВБраке);
	Настройки.Вставить("СостояниеВБракеСписок", СостояниеВБракеСписок);
	Настройки.Вставить("ИспользоватьОпытРаботы", ИспользоватьОпытРаботы);
	Настройки.Вставить("ОпытРаботы", ОпытРаботы);
	//Условия
	Настройки.Вставить("ИспользоватьУровеньЗарплатыФизическогоЛица", ИспользоватьУровеньЗарплатыФизическогоЛица);
	Настройки.Вставить("УровеньЗарплатыФизическогоЛицаОт", УровеньЗарплатыФизическогоЛицаОт);
	Настройки.Вставить("УровеньЗарплатыФизическогоЛицаДо", УровеньЗарплатыФизическогоЛицаДо);
	Настройки.Вставить("СкрыватьРезюмеФизическогоЛицаБезЗарплаты", СкрыватьРезюмеФизическогоЛицаБезЗарплаты);
	//Образование
	Настройки.Вставить("ИспользоватьУровеньОбразованияФизическогоЛица", ИспользоватьУровеньОбразованияФизическогоЛица);
	Настройки.Вставить("УровеньОбразованияСписок", УровеньОбразованияСписок);
	Настройки.Вставить("ИспользоватьУчебноеЗаведение", ИспользоватьУчебноеЗаведение);
	Настройки.Вставить("ОтборУчебноеЗаведениеСписок", ОтборУчебноеЗаведениеСписок);
	//Другое
	Настройки.Вставить("ИспользоватьПрофессию", ИспользоватьПрофессию);
	Настройки.Вставить("ОтборПрофессияСписок", ОтборПрофессияСписок);
	Настройки.Вставить("ИспользоватьСпециальность", ИспользоватьСпециальность);
	Настройки.Вставить("ОтборСпециальностьСписок", ОтборСпециальностьСписок);
	Настройки.Вставить("ИспользоватьПрофильДолжности", ИспользоватьПрофильДолжности);
	Настройки.Вставить("ОтборПрофильДолжностиСписок", ОтборПрофильДолжностиСписок);
	Настройки.Вставить("ИспользоватьКомпетенции", ИспользоватьКомпетенции);
	Настройки.Вставить("КомпетенцииСписок", КомпетенцииСписок);	
	Настройки.Вставить("ИспользоватьПричинаОтклонения", ИспользоватьПричинаОтклонения);
	Настройки.Вставить("ПричинаОтклоненияСписок", ПричинаОтклоненияСписок);
	Настройки.Вставить("ИспользоватьЭтапРаботы", ИспользоватьЭтапРаботы);
	Настройки.Вставить("ЭтапРаботыСписок", ЭтапРаботыСписок);
	Настройки.Вставить("ИспользоватьОтветственныйРекрутер", ИспользоватьОтветственныйРекрутер);
	Настройки.Вставить("ОтборОтветственныйРекрутерСписок", ОтборОтветственныйРекрутерСписок);
	Настройки.Вставить("ИспользоватьРейтингКандидата", ИспользоватьРейтингКандидата);
	Настройки.Вставить("РейтингКандидатаОт", РейтингКандидатаОт);
	Настройки.Вставить("РейтингКандидатаДо", РейтингКандидатаДо);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработка.ПоискРезюмеВИнтернете", "Настройки", Настройки);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
		
	ЗначениеНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработка.ПоискРезюмеВИнтернете", "Настройки");
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначениеНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНадписьПолнотекстовогоПоиска()
	
	СостояниеПолнотекстовогоПоиска = ПолнотекстовыйПоискСервер.СостояниеПолнотекстовогоПоиска();
	
	Если СостояниеПолнотекстовогоПоиска = "ОшибкаНастройкиПоиска"
		Или СостояниеПолнотекстовогоПоиска = "ПоискЗапрещен" Тогда
		Элементы.КартинкаИнформация.Картинка = БиблиотекаКартинок.Предупреждение32;
		Если Пользователи.ЭтоПолноправныйПользователь(, Истина) Тогда
			СостояниеПоискаПредставление = НСтр("ru = 'Включить полнотекстовый поиск данных можно в панели «Общие настройки» раздела «Администрирование».'");
		Иначе
			СостояниеПоискаПредставление = НСтр("ru = 'Обратитесь к администратору.'");
		КонецЕсли;
		Элементы.НадписьПолнотекстовыйПоиск.Заголовок = Элементы.НадписьПолнотекстовыйПоиск.Заголовок + Символы.ПС
			+ СостояниеПоискаПредставление;
	ИначеЕсли СостояниеПолнотекстовогоПоиска = "ВыполняетсяОбновлениеИндекса"
		Или СостояниеПолнотекстовогоПоиска = "ВыполняетсяСлияниеИндекса"
		Или СостояниеПолнотекстовогоПоиска = "ТребуетсяОбновлениеИндекса" Тогда
		Элементы.НадписьПолнотекстовыйПоиск.Заголовок = СтрШаблон(НСтр("ru = '%1%2%3'"),
			НСтр("ru = 'Поиск резюме доступен, но результаты могут быть неточными'"),
			Символы.ПС,
			НСтр("ru = 'Дождитесь обновления индекса и повторите попытку.'"));
	Иначе
		ПолнотекстовыйПоискРазрешен = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СтруктураВидыОбъектов()
	
	ВидыОбъектов = Новый Структура;
	ВидыОбъектов.Вставить("ФизическиеЛица", Новый Массив());
	ВидыОбъектов.Вставить("Кандидаты", Новый Массив());
	ВидыОбъектов.Вставить("Сотрудники", Новый Массив());
	
	Возврат ВидыОбъектов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ОбластиПоиска()
	Возврат Новый Структура("Внутри, ВИнтернете", "Внутри", "ВИнтернете");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПостфиксыПоТипамСвойств()
	
	Постфиксы = Новый Структура;
	Постфиксы.Вставить("ДатаНачала", "С");
	Постфиксы.Вставить("ДатаОкончания", "По");
	Постфиксы.Вставить("ЧислоОт", "От");
	Постфиксы.Вставить("ЧислоДо", "До");
	
	Возврат Постфиксы;
	
КонецФункции

&НаСервере
Процедура ПроверитьЗаполнениеФильтров(Отказ)
	
	Если ОбластьПоискаКандидаты + ОбластьПоискаСотрудники + ОбластьПоискаУволенные
		+ ОбластьПоискаКадровыйРезерв = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указаны области поиска'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьГражданство И ОтборГражданствоСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено гражданство'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьЗнаниеЯзыков И ЗнаниеЯзыковСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено знание языков'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьСостояниеВБраке И СостояниеВБракеСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено состояние в браке'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьУровеньОбразованияФизическогоЛица И УровеньОбразованияСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен уровень образования'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьУчебноеЗаведение И ОтборУчебноеЗаведениеСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнено учебное заведение'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьПрофессию И ОтборПрофессияСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена профессия'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьСпециальность И ОтборСпециальностьСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена специальность'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьПрофильДолжности И ОтборПрофильДолжностиСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен профиль должности'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьКомпетенции И КомпетенцииСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнены компетенции'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьПричинаОтклонения И ПричинаОтклоненияСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнена причина отклонения'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьЭтапРаботы И ЭтапРаботыСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен этап работы'"), , , ,Отказ);
	КонецЕсли;
	
	Если ИспользоватьОтветственныйРекрутер И ОтборОтветственныйРекрутерСписок.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не заполнен ответственный рекрутер'"), , , ,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПометкиСписка(Список, ИспользоватьФильтр, ЗаголовокФильтра)
	ЗаполнитьСписокФильтра(Список);
	ЗаполнитьПредставлениеФильтра(Список, ИспользоватьФильтр, ЗаголовокФильтра, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокФильтра(Список)
	
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	ЗначениеФильтра = ТекущиеДанные.Значение;
	Если ТекущиеДанные.Пометка Тогда
		Список.Добавить(ТекущиеДанные.Значение);
	Иначе
		НайденноеЗначение = Список.НайтиПоЗначению(ЗначениеФильтра);
		Если НайденноеЗначение <> Неопределено Тогда
			Список.Удалить(НайденноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеФильтра(Список, ИспользоватьФильтр, ЗаголовокФильтра, ИнициализацияПриОткрытииФормы)
	
	ЗаголовокФильтра = "";
	ВыбранноеКоличество = Список.Количество();
	
	Если ВыбранноеКоличество = 0 Тогда
		ИспользоватьФильтр = Ложь;
		ЗаголовокФильтра = НСтр("ru = 'Заполнить'");
		Возврат;
	КонецЕсли;

	БольшойСписок = Ложь;
	Если Не ИнициализацияПриОткрытииФормы Тогда
		ИспользоватьФильтр = Истина;
	КонецЕсли;
	
	ДлинаЗаголовка = 20;
	Для Каждого Строка Из Список Цикл
		Если СтрДлина(ЗаголовокФильтра + Строка) > ДлинаЗаголовка Тогда
			БольшойСписок = Истина;
			Если Список.Индекс(Строка) = 0 Тогда
				ЗаголовокФильтра = СтрШаблон(НСтр("ru = 'выбрано %1'"), Строка(ВыбранноеКоличество));
			Иначе 
				ЗаголовокФильтра = СтрШаблон(НСтр("ru = '%1 и еще %2'"),
					Лев(ЗаголовокФильтра, СтрДлина(ЗаголовокФильтра) - 2),
					Строка(ВыбранноеКоличество - Список.Индекс(Строка)));
			КонецЕсли;
			Прервать;
		Иначе
			ЗаголовокФильтра = ЗаголовокФильтра + Строка + ", ";
		КонецЕсли;

	КонецЦикла;

	Если Не БольшойСписок Тогда
		ЗаголовокФильтра = Лев(ЗаголовокФильтра, СтрДлина(ЗаголовокФильтра) - 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиНаСервере()
	
	Если ИскатьВИнтернете Тогда
		ИспользоватьВозрастОт = Ложь;
		ИспользоватьВозрастДо = Ложь;
		Объект.ВозрастОт = 18;
		Объект.ВозрастДо = 65;
		ИспользоватьРегион = Ложь;
		ИспользоватьУровеньЗарплатыОт = Ложь;
		ИспользоватьУровеньЗарплатыДо = Ложь;
		Объект.УровеньЗарплатыОт = 0;
		Объект.УровеньЗарплатыДо = 0;
		Объект.СкрыватьРезюмеБезЗарплаты = Ложь;
		ИспользоватьПол = Ложь;
		Объект.Пол.Очистить();
		ИспользоватьУровеньОбразования = Ложь;
		Объект.УровеньОбразования.Очистить();
		ИспользоватьПериодРазмещения = Ложь;
		Объект.ПериодРазмещения.Очистить();
		
		НастройкаДоступностиЭлементовФормы();
		УстановитьЗаголовокНадписиРегион();
	Иначе
		//Общее
		ПолФизическогоЛица = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.ПустаяСсылка");
		ИспользоватьВозраст = Ложь;
		ВозрастФизическогоЛицаОт = 18;
		ВозрастФизическогоЛицаДо = 65;
		ИспользоватьГражданство = Ложь;
		ОтборГражданствоСписок.Очистить();
		ИспользоватьЗнаниеЯзыков = Ложь;
		ЗнаниеЯзыковСписок.Очистить();
		ИспользоватьСостояниеВБраке = Ложь;
		СостояниеВБракеСписок.Очистить();
		ИспользоватьОпытРаботы = Ложь;
		//Условия
		ИспользоватьУровеньЗарплатыФизическогоЛица = Ложь;
		УровеньЗарплатыФизическогоЛицаОт = 0;
		УровеньЗарплатыФизическогоЛицаДо = 0;
		СкрыватьРезюмеФизическогоЛицаБезЗарплаты = Ложь;
		//Образование
		ИспользоватьУровеньОбразованияФизическогоЛица = Ложь;
		УровеньОбразованияСписок.Очистить();
		ИспользоватьУчебноеЗаведение = Ложь;
		ОтборУчебноеЗаведениеСписок.Очистить();
		//Другое
		ИспользоватьПрофессию = Ложь;
		ОтборПрофессияСписок.Очистить();
		ИспользоватьСпециальность = Ложь;
		ОтборСпециальностьСписок.Очистить();
		ИспользоватьПрофильДолжности = Ложь;
		ОтборПрофильДолжностиСписок.Очистить();
		ИспользоватьКомпетенции = Ложь;
		КомпетенцииСписок.Очистить();
		ИспользоватьПричинаОтклонения = Ложь;
		ПричинаОтклоненияСписок.Очистить();
		ИспользоватьЭтапРаботы = Ложь;
		ЭтапРаботыСписок.Очистить();
		ИспользоватьОтветственныйРекрутер = Ложь;
		ОтборОтветственныйРекрутерСписок.Очистить();
		ИспользоватьРейтингКандидата = Ложь;
		РейтингКандидатаОт = 0;
		РейтингКандидатаДо = 0;
		
		ИнициализироватьФильтрыПоИсточникам();
		ЗаполнитьПредставленияФильтров();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФормыВыбораПоТипу(Тип)
	Возврат Метаданные.НайтиПоТипу(Тип).ПолноеИмя() + ".ФормаВыбора";
КонецФункции

&НаКлиенте
Процедура ДобавитьСвойствоВСписокЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ИмяРеквизита = ДополнительныеПараметры.Список;
		ИспользоватьФильтр = "ИспользоватьФильтрСвойства" + ИмяРеквизита;
		ЗаголовокФильтра = "ЗаголовокФильтрСвойства" + ИмяРеквизита;
		Для Каждого Значение Из Результат Цикл
			ЭтаФорма[ИмяРеквизита].Добавить(Значение);
		КонецЦикла;
		ЗаполнитьПредставлениеФильтра(ЭтаФорма[ИмяРеквизита], ЭтаФорма[ИспользоватьФильтр],
			ЭтаФорма[ЗаголовокФильтра], Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаголовокРеквизитаИспользоватьФильтр(ЗаголовокРеквизита, ВидОбъекта)
	
	ВидОбъектаФильтра = "";
	Для НомерСимвола = 1 По СтрДлина(ВидОбъекта) Цикл
		ТекущийСимвол = Сред(ВидОбъекта, НомерСимвола, 1);
		Если НРег(ТекущийСимвол) = ТекущийСимвол Тогда
			ВидОбъектаФильтра = ВидОбъектаФильтра + ТекущийСимвол;
		Иначе
			ВидОбъектаФильтра = ?(НомерСимвола = 1, НРег(ТекущийСимвол), ВидОбъектаФильтра +Символы.НПП + НРег(ТекущийСимвол));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрШаблон(НСтр("ru = '%1 (%2)'"), ЗаголовокРеквизита, ВидОбъектаФильтра);
	
КонецФункции

#КонецОбласти
