#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ОбщегоНазначения.ОбъектМетаданныхДоступенПоФункциональнымОпциям(Метаданные.Документы.ОтветНаЗапросРеквизитовДляВыплатыПособия) Тогда
		Элементы.СоздатьОтветНаЗапросРеквизитовДляВыплатыПособия.Видимость = Ложь;
		Элементы.СписокСоздатьОтветНаЗапросРеквизитовДляВыплатыПособия.Видимость = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияБЗК.НастроитьОформлениеПоляДата(ЭтотОбъект, Элементы.Дата);
	ОбщегоНазначенияБЗК.НастроитьОформлениеПоляДата(ЭтотОбъект, Элементы.ДатаСообщения);
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
		КлючНазначенияИспользования = "РежимВыбора";
		КлючСохраненияПоложенияОкна = КлючНазначенияИспользования;
		АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ГоловнаяОрганизация") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.ГоловнаяОрганизация) Тогда
			ГоловнаяОрганизация = Параметры.Отбор.ГоловнаяОрганизация;
		КонецЕсли;
		Параметры.Отбор.Удалить("ГоловнаяОрганизация");
	КонецЕсли;
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Организация) Тогда
			Организации.Добавить(Параметры.Отбор.Организация);
		КонецЕсли;
		Параметры.Отбор.Удалить("Организация");
	КонецЕсли;
	
	ОформлениеКД = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(Список, "ОсталосьДней");
	ЗапросыБЗК.ДобавитьОтбор(ОформлениеКД.Отбор, "ОсталосьДней", "<=", 2);
	ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ОформлениеКД, "ЦветТекста", ЦветаСтиля.ПоясняющийОшибкуТекст);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДатаСеанса", ТекущаяДатаСеанса());
	
	ЗаполнитьСписокТиповДокументов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
	ПоказыватьОрганизации = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийЗарплатаКадрыБазовая");
	Если ПоказыватьОрганизации Тогда
		ЗаполнитьСписокВыбораГоловныхОрганизаций();
		ПоказыватьГоловныеОрганизации = Элементы.ГоловнаяОрганизация.СписокВыбора.Количество() > 1;
	Иначе
		ПоказыватьГоловныеОрганизации = Ложь;
	КонецЕсли;
	Если Не ПоказыватьГоловныеОрганизации Тогда
		Элементы.ГоловнаяОрганизация.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБЗК.ЕстьСохраненныеНастройкиФормы(ЭтотОбъект) Тогда
		ПослеЗагрузкиВсехНастроекФормыНаСервере();
	КонецЕсли;
	
	СЭДОФСС.ПеренестиОтборыВПользовательскиеНастройки(ЭтотОбъект, Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	Настройки.Вставить("ВыбранныеФизлица", ФизическиеЛица.ВыгрузитьЗначения());
	Настройки.Вставить("ФизлицаДляВыбора", Элементы.ФизическиеЛица.СписокВыбора.ВыгрузитьЗначения());
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПослеЗагрузкиВсехНастроекФормыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеПолученияСообщенийОтФСС()
		Или ИмяСобытия = СЭДОФССКлиент.ИмяСобытияПослеОтправкиПодтвержденияПолучения() Тогда
		
		ПодключитьОбработчикОбновленияФормы();
		
	Иначе
		
		ЭлектронныйДокументооборотСФССКлиент.ОбработатьОповещенияИнформационнойПанелиБРО(
			ЭтотОбъект, ИмяСобытия, Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	Организации.Очистить();
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацииПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПодобратьФизлиц();
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛицаПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВРаботеПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	ТипыДокументовПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗапросСтатусовВыплатыПособия(Команда)
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ОтборСтрахователь = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "Страхователь");
	Если ОтборСтрахователь.Количество() = 1 Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ОтборСтрахователь[0].ИдентификаторПользовательскойНастройки);
		Если ЭлементОтбора <> Неопределено И ЭлементОтбора.Использование И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)Тогда
				ПараметрыФормы.ЗначенияЗаполнения = Новый Структура("Страхователь", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЕсли;
	ОткрытьФорму("Документ.ЗапросСтатусовВыплатыПособия.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтветНаЗапросРеквизитовДляВыплатыПособия(Команда)
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения");
	ОтборСтрахователь = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, "Страхователь");
	Если ОтборСтрахователь.Количество() = 1 Тогда
		ЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
			ОтборСтрахователь[0].ИдентификаторПользовательскойНастройки);
		Если ЭлементОтбора <> Неопределено И ЭлементОтбора.Использование И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЗначениеЗаполнено(ЭлементОтбора.ПравоеЗначение)Тогда
				ПараметрыФормы.ЗначенияЗаполнения = Новый Структура("Страхователь", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЕсли;
	ОткрытьФорму("Документ.ОтветНаЗапросРеквизитовДляВыплатыПособия.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область РасширениеСобытийФормы

&НаСервере
Процедура ПослеЗагрузкиВсехНастроекФормыНаСервере()
	Если ПоказыватьОрганизации
		И Не ЗначениеЗаполнено(КлючНазначенияИспользования)
		И Не ЗначениеЗаполнено(ГоловнаяОрганизация)
		И Организации.Количество() = 0 Тогда
		ГоловнаяОрганизация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	ЗаполнитьСписокВидовДокументов();
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ИнформационнаяПанельБРО

&НаСервере
Процедура ОбновитьИнформационнуюПанельБРО()
	СЭДОФСС.ОбновитьИнформационнуюПанельБРО(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ИнформационнаяПанельБРООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	ЭлектронныйДокументооборотСФССКлиент.ИнформационнаяПанельБРОНажатие(
		ЭтотОбъект,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Форма

&НаКлиенте
Процедура ПодключитьОбработчикОбновленияФормы()
	ОтключитьОбработчикОжидания("ОбновитьФормуНаКлиенте");
	ПодключитьОбработчикОжидания("ОбновитьФормуНаКлиенте", 0.2, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуНаКлиенте()
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораГоловныхОрганизаций()
	СписокВыбора = Элементы.ГоловнаяОрганизация.СписокВыбора;
	СписокВыбора.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Значение,
	|	Организации.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = Организации.ГоловнаяОрганизация";
	Таблица = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), СтрокаТаблицы);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму()
	ОбновитьЭлементыОрганизаций();
	ОбновитьЭлементыФизлиц();
	ОбновитьПараметрыСписка();
	ОбновитьИнформационнуюПанельБРО();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область Список

&НаСервере
Процедура ОбновитьПараметрыСписка()
	
	ОтборКД = Список.КомпоновщикНастроек.Настройки.Отбор;
	
	Если ПоказыватьГоловныеОрганизации Тогда
		Если ИдентификаторОтбораГоловнаяОрганизация = Неопределено Тогда
			ЭлементОтбораКД = Неопределено;
		Иначе
			ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораГоловнаяОрганизация);
		КонецЕсли;
		Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
			Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "ГоловнаяОрганизация") <> 0 Тогда
			ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "ГоловнаяОрганизация", "=", ГоловнаяОрганизация);
			ИдентификаторОтбораГоловнаяОрганизация = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
		КонецЕсли;
		ЭлементОтбораКД.Использование = ЗначениеЗаполнено(ГоловнаяОрганизация);
		ЭлементОтбораКД.ПравоеЗначение = ГоловнаяОрганизация;
		Элементы.СписокГоловнаяОрганизация.Видимость = Не ЭлементОтбораКД.Использование;
	КонецЕсли;
	
	Если ПоказыватьОрганизации Тогда
		Если ИдентификаторОтбораОрганизация = Неопределено Тогда
			ЭлементОтбораКД = Неопределено;
		Иначе
			ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораОрганизация);
		КонецЕсли;
		Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
			Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "Организация") <> 0 Тогда
			ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "Организация");
			ИдентификаторОтбораОрганизация = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
		КонецЕсли;
		Количество = Организации.Количество();
		ЭлементОтбораКД.Использование = Количество > 0;
		Если ЭлементОтбораКД.Использование Тогда
			ЭлементОтбораКД.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбораКД.ПравоеЗначение = Организации;
		КонецЕсли;
		Если Количество = 1 Тогда
			Элементы.СписокГоловнаяОрганизация.Видимость = Ложь;
		КонецЕсли;
		Элементы.СписокОрганизация.Видимость = Количество <> 1;
	КонецЕсли;
	
	Если ИдентификаторОтбораФизлица = Неопределено Тогда
		ЭлементОтбораКД = Неопределено;
	Иначе
		ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораФизлица);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
		Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "ФизическоеЛицо") <> 0 Тогда
		ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "ФизическоеЛицо");
		ИдентификаторОтбораФизлица = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
	КонецЕсли;
	Количество = ФизическиеЛица.Количество();
	ЭлементОтбораКД.Использование = Количество > 0;
	Если ЭлементОтбораКД.Использование Тогда
		ЭлементОтбораКД.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораКД.ПравоеЗначение = ФизическиеЛица;
	КонецЕсли;
	Элементы.СписокФизическоеЛицо.Видимость = Количество <> 1;
	
	Если ИдентификаторОтбораДокументыВРаботе = Неопределено Тогда
		ЭлементОтбораКД = Неопределено;
	Иначе
		ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораДокументыВРаботе);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
		Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "ВРаботе") <> 0 Тогда
		ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "ВРаботе", "=", Истина);
		ИдентификаторОтбораДокументыВРаботе = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
	КонецЕсли;
	ЭлементОтбораКД.Использование = ДокументыВРаботе;
	
	Если ИдентификаторОтбораТипыДокументов = Неопределено Тогда
		ЭлементОтбораКД = Неопределено;
	Иначе
		ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораТипыДокументов);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
		Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "ТипДокумента") <> 0 Тогда
		ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "ТипДокумента");
		ИдентификаторОтбораТипыДокументов = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
	КонецЕсли;
	Количество = ТипыДокументов.Количество();
	ЭлементОтбораКД.Использование = Количество > 0;
	Если ЭлементОтбораКД.Использование Тогда
		ЭлементОтбораКД.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораКД.ПравоеЗначение = ТипыДокументов;
	КонецЕсли;
	Элементы.СписокТипДокумента.Видимость = Количество <> 1;
	
	Если ИдентификаторОтбораВидыДокументов = Неопределено Тогда
		ЭлементОтбораКД = Неопределено;
	Иначе
		ЭлементОтбораКД = ОтборКД.ПолучитьОбъектПоИдентификатору(ИдентификаторОтбораВидыДокументов);
	КонецЕсли;
	Если ТипЗнч(ЭлементОтбораКД) <> Тип("ЭлементОтбораКомпоновкиДанных")
		Или СтрСравнить(ЭлементОтбораКД.ЛевоеЗначение, "Вид") <> 0 Тогда
		ЭлементОтбораКД = ЗапросыБЗК.ДобавитьНедоступныйОтбор(ОтборКД, "Вид");
		ИдентификаторОтбораВидыДокументов = ОтборКД.ПолучитьИдентификаторПоОбъекту(ЭлементОтбораКД);
	КонецЕсли;
	Количество = ВидыДокументов.Количество();
	ЭлементОтбораКД.Использование = Количество > 0;
	Если ЭлементОтбораКД.Использование Тогда
		ЭлементОтбораКД.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбораКД.ПравоеЗначение = ВидыДокументов;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Организации

&НаСервере
Процедура ОбновитьЭлементыОрганизаций()
	
	Если Не ПоказыватьОрганизации Тогда
		Возврат;
	КонецЕсли;
	
	СвязиПараметровВыбора = Новый Массив;
	Если ПоказыватьГоловныеОрганизации И ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.ГоловнаяОрганизация", "ГоловнаяОрганизация"));
	КонецЕсли;
	Элементы.Организации.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ФизическиеЛица

&НаСервере
Процедура ОбновитьЭлементыФизлиц()
	
	СвязиПараметровВыбора = Новый Массив;
	Если ПоказыватьОрганизации И Организации.Количество() > 0 Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Организации"));
	ИначеЕсли ПоказыватьГоловныеОрганизации И ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.ГоловнаяОрганизация", "ГоловнаяОрганизация"));
	КонецЕсли;
	Элементы.ФизическиеЛица.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьФизлиц()
	СтруктураОтбора = Новый Структура;
	Если ПоказыватьОрганизации И Организации.Количество() > 0 Тогда
		СтруктураОтбора.Вставить("Организация", Организации.ВыгрузитьЗначения());
	ИначеЕсли ПоказыватьГоловныеОрганизации И ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		СтруктураОтбора.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
	КонецЕсли;
	Обработчик = Новый ОписаниеОповещения("ПослеПодбораФизлиц", ЭтотОбъект);
	СписокВыбора = Элементы.ФизическиеЛица.СписокВыбора;
	СЭДОФССКлиент.НачатьПодборФизлиц(ЭтотОбъект, Обработчик, СтруктураОтбора, Истина, ФизическиеЛица, СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораФизлиц(РезультатВыбора, ПустойПараметр) Экспорт
	Если ТипЗнч(РезультатВыбора) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	ФизическиеЛица.Очистить();
	СписокВыбора = Элементы.ФизическиеЛица.СписокВыбора;
	СписокВыбора.Очистить();
	Для Каждого ЭлементСписка Из РезультатВыбора Цикл
		Если ЭлементСписка.Пометка Тогда
			ЗаполнитьЗначенияСвойств(ФизическиеЛица.Добавить(), ЭлементСписка);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СписокВыбора.Добавить(), ЭлементСписка);
	КонецЦикла;
	ОбновитьФорму();
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ТипыДокументовПриИзмененииНаСервере()
	ЗаполнитьСписокВидовДокументов();
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокТиповДокументов()
	СписокВыбора = Элементы.ТипыДокументов.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Тип("ДокументСсылка.УведомлениеОбОтсутствииОтветаСЭДО"), НСтр("ru = 'Уведомление об отсутствии ответа'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия"), НСтр("ru = 'Уведомление о статусе выплаты'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.УведомлениеОбИзмененииРасчетаПособия"), НСтр("ru = 'Уведомление об изменении расчета'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЗапросСтатусовВыплатыПособия"), НСтр("ru = 'Статусы выплаты пособия: Запрос'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.СтатусыВыплатыПособия"), НСтр("ru = 'Статусы выплаты пособия: Ответ СФР'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЗапросРеквизитовДляВыплатыПособия"), НСтр("ru = 'Реквизиты для выплаты пособия: Запрос от СФР'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ОтветНаЗапросРеквизитовДляВыплатыПособия"), НСтр("ru = 'Реквизиты для выплаты пособия: Ответ'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ЗапросНедостающихСведенийПособияСФР"), НСтр("ru = 'Недостающие сведения для назначения пособия'"));
	СписокВыбора.Добавить(Тип("ДокументСсылка.ИзвещениеФСС"), НСтр("ru = 'Извещение СФР'"));
	ФрагментыЗапросов = Новый Массив;
	ШаблонФрагмента = "КОГДА Шапка.Тип = ТИП(Документ.%1) ТОГДА %2";
	Для Каждого МетаданныеДокумента Из Метаданные.ЖурналыДокументов.УведомленияОВыплатеПособий.РегистрируемыеДокументы Цикл
		// Представление типа в отборе.
		ТипДокумента = Тип("ДокументСсылка." + МетаданныеДокумента.Имя);
		ЭлементСписка = СписокВыбора.НайтиПоЗначению(ТипДокумента);
		Если ЭлементСписка = Неопределено Тогда
			ЭлементСписка = СписокВыбора.Добавить(ТипДокумента, МетаданныеДокумента.Синоним);
		КонецЕсли;
		// Представление типа в списке.
		ОформлениеКД = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(Список, "ТипДокумента");
		ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ОформлениеКД, "ТипДокумента", "=", ЭлементСписка.Значение);
		ОбщегоНазначенияБЗК.УстановитьПараметрУсловногоОформления(ОформлениеКД, "Текст", ЭлементСписка.Представление);
		// Номер типа сообщения.
		ТипСообщения = Документы[МетаданныеДокумента.Имя].ТипСообщения(Неопределено);
		Если ТипСообщения <> Неопределено И ТипСообщения <> 0 Тогда
			ФрагментыЗапросов.Добавить(СтрШаблон(ШаблонФрагмента, МетаданныеДокумента.Имя, Формат(ТипСообщения, "ЧГ=")));
		КонецЕсли;
	КонецЦикла;
	СписокВыбора.СортироватьПоПредставлению();
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "КОГДА &УсловиеТипСообщения", СтрСоединить(ФрагментыЗапросов, Символы.ПС));
	Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, "ТОГДА &РезультатТипСообщения", "");
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВидовДокументов()
	СписокВыбора = Элементы.ВидыДокументов.СписокВыбора;
	СписокВыбора.Очистить();
	Если ТипыДокументов.Количество() = 0 Тогда
		ЕстьВидыУведомленийОбИзмененииРасчетаПособия = Истина;
		ЕстьВидыИзвещенийФСС = Истина;
		ЕстьСтатусыВыплатыПособия = Истина;
	Иначе
		ЕстьВидыУведомленийОбИзмененииРасчетаПособия = Ложь;
		ЕстьВидыИзвещенийФСС = Ложь;
		ЕстьСтатусыВыплатыПособия = Ложь;
		Для Каждого ТипДокумента Из ТипыДокументов.ВыгрузитьЗначения() Цикл
			Если ТипДокумента = Тип("ДокументСсылка.УведомлениеОбИзмененииРасчетаПособия") Тогда
				ЕстьВидыУведомленийОбИзмененииРасчетаПособия = Истина;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ИзвещениеФСС") Тогда
				ЕстьВидыИзвещенийФСС = Истина;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СтатусыВыплатыПособия")
				Или ТипДокумента = Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия") Тогда
				ЕстьСтатусыВыплатыПособия = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьВидыУведомленийОбИзмененииРасчетаПособия Тогда
		ДобавитьЗначенияПеречисления(СписокВыбора, Метаданные.Перечисления.ВидыУведомленийОбИзмененииРасчетаПособия);
	КонецЕсли;
	Если ЕстьВидыИзвещенийФСС Тогда
		ДобавитьЗначенияПеречисления(СписокВыбора, Метаданные.Перечисления.ВидыИзвещенийФСС);
	КонецЕсли;
	Если ЕстьСтатусыВыплатыПособия Тогда
		ДобавитьЗначенияПеречисления(СписокВыбора, Метаданные.Перечисления.СтатусыВыплатыПособия);
	КонецЕсли;
	СписокВыбора.СортироватьПоПредставлению();
	ЕстьВидыДокументов = (СписокВыбора.Количество() > 0);
	Элементы.ВидыДокументов.Видимость = ЕстьВидыДокументов;
	Элементы.СписокВид.Видимость = ЕстьВидыДокументов;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначенияПеречисления(СписокВыбора, МетаданныеПеречисления)
	МенеджерПеречисления = Перечисления[МетаданныеПеречисления.Имя];
	Для Каждого МетаданныеЗначенияПеречисления Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
		Ссылка = МенеджерПеречисления[МетаданныеЗначенияПеречисления.Имя];
		СписокВыбора.Добавить(Ссылка, МетаданныеЗначенияПеречисления.Синоним);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
