#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(УдостоверенияСотрудников.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Функция ВозвратыУтериУдостоверений(Организация, СписокСотрудников, ВидУдостоверения, Регистратор, ДатаАктуальности) Экспорт
	
	ВозвратыУтериУдостоверений = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.Регистратор КАК ДокументВозвратаУтериУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Регистратор <> &Регистратор
		|				И Сотрудник В (&СписокСотрудников)
		|				И Организация = &Организация
		|				И ВидУдостоверения = &ВидУдостоверения) КАК Удостоверения
		|ГДЕ
		|	Удостоверения.СтатусУдостоверения В (ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Возвращено), ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Утеряно), ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Испорчено))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеУдостоверения = Новый Структура("ДокументВозвратаУтериУдостоверения, СерияУдостоверения, НомерУдостоверения, ДатаВыдачи");
			ЗаполнитьЗначенияСвойств(ДанныеУдостоверения, Выборка);
			ВозвратыУтериУдостоверений.Вставить(Выборка.Сотрудник, ДанныеУдостоверения);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ВозвратыУтериУдостоверений;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли