#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если УдостоверенияСотрудников.Количество() = 0 Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'В документе нет строк для проведения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	Запрос.УстановитьПараметр("УдостоверенияСотрудников", УдостоверенияСотрудников.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдостоверенияСотрудников.НомерСтроки КАК НомерСтроки,
		|	УдостоверенияСотрудников.Сотрудник КАК Сотрудник,
		|	УдостоверенияСотрудников.ДокументВыдачиУдостоверения КАК ДокументВыдачиУдостоверения,
		|	УдостоверенияСотрудников.СерияУдостоверения КАК СерияУдостоверения,
		|	УдостоверенияСотрудников.НомерУдостоверения КАК НомерУдостоверения,
		|	УдостоверенияСотрудников.СтатусУдостоверения КАК СтатусУдостоверения,
		|	УдостоверенияСотрудников.ДатаВозвращенияУтраты КАК ДатаВозвращенияУтраты,
		|	УдостоверенияСотрудников.ПредоставленаСправкаИзОрганаВнутреннихДел КАК ПредоставленаСправкаИзОрганаВнутреннихДел
		|ПОМЕСТИТЬ ВТВозвратыУтериУдостоверений
		|ИЗ
		|	&УдостоверенияСотрудников КАК УдостоверенияСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.Регистратор КАК Регистратор,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТВыдачиУдостоверений
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Организация = &Организация
		|				И ВидУдостоверения = &ВидУдостоверения
		|				И Регистратор <> &Ссылка
		|				И СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано)) КАК Удостоверения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения КАК ДокументВыдачиУдостоверения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВозвратыУтериУдостоверений.НомерСтроки) КАК КоличествоСтрок
		|ПОМЕСТИТЬ ВТЗадвоенныеСотрудники
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения,
		|	ВозвратыУтериУдостоверений.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВозвратыУтериУдостоверений.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратыУтериУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения КАК ДокументВыдачиУдостоверения
		|ПОМЕСТИТЬ ВТДокументомВыдачиНеВыдан
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ПО ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения = ВыдачиУдостоверений.Регистратор
		|			И ВозвратыУтериУдостоверений.Сотрудник = ВыдачиУдостоверений.Сотрудник
		|			И ВозвратыУтериУдостоверений.СерияУдостоверения = ВыдачиУдостоверений.СерияУдостоверения
		|			И ВозвратыУтериУдостоверений.НомерУдостоверения = ВыдачиУдостоверений.НомерУдостоверения
		|ГДЕ
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения <> ЗНАЧЕНИЕ(Документ.ВыдачаУдостоверений.ПустаяСсылка)
		|	И ВыдачиУдостоверений.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратыУтериУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВыдачиУдостоверений.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТНеУказанДокументВыдачи
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВыдачиУдостоверений КАК ВыдачиУдостоверений
		|		ПО ВозвратыУтериУдостоверений.Сотрудник = ВыдачиУдостоверений.Сотрудник
		|			И ВозвратыУтериУдостоверений.СерияУдостоверения = ВыдачиУдостоверений.СерияУдостоверения
		|			И ВозвратыУтериУдостоверений.НомерУдостоверения = ВыдачиУдостоверений.НомерУдостоверения
		|ГДЕ
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения = ЗНАЧЕНИЕ(Документ.ВыдачаУдостоверений.ПустаяСсылка)
		|	И НЕ ВыдачиУдостоверений.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ВозвратыУтериУдостоверений.НомерСтроки) КАК НомерСтроки,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ЗадвоенныеСотрудники.ДокументВыдачиУдостоверения КАК Документ,
		|	ИСТИНА КАК ВозвратНесколькихУдостоверенийПоСотруднику,
		|	ЛОЖЬ КАК НеверныйСтатус,
		|	ЛОЖЬ КАК ДокументомВыдачиНеВыдан,
		|	ЛОЖЬ КАК НеУказанДокументВыдачи
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадвоенныеСотрудники КАК ЗадвоенныеСотрудники
		|		ПО ВозвратыУтериУдостоверений.Сотрудник = ЗадвоенныеСотрудники.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратыУтериУдостоверений.Сотрудник,
		|	ЗадвоенныеСотрудники.ДокументВыдачиУдостоверения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МИНИМУМ(ВозвратыУтериУдостоверений.НомерСтроки),
		|	ВозвратыУтериУдостоверений.Сотрудник,
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|ГДЕ
		|	(ВозвратыУтериУдостоверений.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Выдано)
		|			ИЛИ ВозвратыУтериУдостоверений.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Уничтожено))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратыУтериУдостоверений.Сотрудник,
		|	ВозвратыУтериУдостоверений.ДокументВыдачиУдостоверения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументомВыдачиНеВыдан.НомерСтроки,
		|	ДокументомВыдачиНеВыдан.Сотрудник,
		|	ДокументомВыдачиНеВыдан.ДокументВыдачиУдостоверения,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	ВТДокументомВыдачиНеВыдан КАК ДокументомВыдачиНеВыдан
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НеУказанДокументВыдачи.НомерСтроки,
		|	НеУказанДокументВыдачи.Сотрудник,
		|	НеУказанДокументВыдачи.Регистратор,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВТНеУказанДокументВыдачи КАК НеУказанДокументВыдачи
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = "";
			ТекстОшибки = "";
			Если Выборка.ВозвратНесколькихУдостоверенийПоСотруднику Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: возврат нескольких удостоверений по одному сотруднику и одному документу выдачи невозможна.'");
			ИначеЕсли Выборка.НеверныйСтатус Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: проведение документа со статусами Выдано/Уничтожено невозможно.'");
			ИначеЕсли Выборка.ДокументомВыдачиНеВыдан Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: указанным документом выдачи %2 удостоверение не было выдано.'");
			ИначеЕсли Выборка.НеУказанДокументВыдачи Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: удостоверение выдано документом %2, необходимо указать документ возврата.'");
			КонецЕсли;
			
			ТекстСообщения = ?(ПустаяСтрока(ТекстСообщения), "", ТекстСообщения +", ")
				+ НСтр("ru='" + ТекстОшибки + "'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Сотрудник,
				Выборка.Документ);
	
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"Сотрудники[" + (Выборка.НомерСтроки) + "].Сотрудник",
				"Объект",
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		И ОбщегоНазначения.ЭтоДокумент(ДанныеЗаполнения.Метаданные()) Тогда
		
		ИзВыдачиУдостоверения = Ложь;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыдачаУдостоверений") Тогда
			ИзВыдачиУдостоверения = Истина;
		КонецЕсли;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проведен, Организация");
		СписокКадровыхДанных = Удостоверения.СписокКадровыхДанных();
		
		Если Не ЗначенияРеквизитов.Проведен Тогда
			ВызватьИсключение НСтр("ru = 'Ввод на основании непроведенного документа невозможен.'");
		Иначе
			ДанныеСотрудников = Новый Массив;
			Сотрудники = Новый Массив;
			Организация = ЗначенияРеквизитов.Организация;
			Если ИзВыдачиУдостоверения Тогда
				ВидУдостоверения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидУдостоверения");
			КонецЕсли;
			
			ИмяТабличнойЧасти = "Сотрудники";
			Если ИзВыдачиУдостоверения Тогда
				ИмяТабличнойЧасти = "УдостоверенияСотрудников";
			КонецЕсли;
			
			// Основание - одиночный документ.
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Сотрудник") Тогда
				
				ДанныеСотрудника = Новый Структура(СписокКадровыхДанных);
				ЗаполнитьЗначенияСвойств(ДанныеСотрудника, ДанныеЗаполнения);
				ДанныеСотрудников.Добавить(ДанныеСотрудника);
				
				Сотрудники.Добавить(ДанныеЗаполнения.Сотрудник);
				
			// Основание - списочный документ.
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, ИмяТабличнойЧасти) Тогда
				
				Для каждого СтрокаДокумента Из ДанныеЗаполнения[ИмяТабличнойЧасти] Цикл
					ДанныеСотрудника = Новый Структура(СписокКадровыхДанных + ", СерияУдостоверения, НомерУдостоверения, ДатаВыдачи");
					ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаДокумента);
					ДанныеСотрудников.Добавить(ДанныеСотрудника);
					
					Сотрудники.Добавить(СтрокаДокумента.Сотрудник);
				КонецЦикла;
				
			КонецЕсли;
			
			ВыдачиУдостоверений = Документы.ВыдачаУдостоверений.ВыдачиУдостоверений(Организация, Сотрудники, ВидУдостоверения, Ссылка, ДанныеЗаполнения.Дата);
			КадровыеДанныеДляЗаполнения = Удостоверения.КадровыеДанныеДляЗаполнения(Сотрудники, СписокКадровыхДанных, ДанныеЗаполнения.Дата);
			
			Для каждого ДанныеСотрудника Из ДанныеСотрудников Цикл
				НоваяСтрока = УдостоверенияСотрудников.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
				
				НоваяСтрока.СтатусУдостоверения = ПредопределенноеЗначение("Перечисление.СтатусыУдостоверений.Возвращено");
				НоваяСтрока.ДатаВозвращенияУтраты = ДанныеЗаполнения.Дата;
				
				ДанныеУдостоверения = ВыдачиУдостоверений.Получить(ДанныеСотрудника.Сотрудник);
				Если ДанныеУдостоверения <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеУдостоверения);
				КонецЕсли;
				
				Если ИзВыдачиУдостоверения Тогда
					НоваяСтрока.ДокументВыдачиУдостоверения = ДанныеЗаполнения;
				Иначе
					КадровыеДанныеДляЗаполненияМассив = СтрРазделить(СписокКадровыхДанных, ",", Ложь);
					Для каждого КадровоеДанное Из КадровыеДанныеДляЗаполненияМассив Цикл
						Если Не ЗначениеЗаполнено(НоваяСтрока[КадровоеДанное]) Тогда
							СтрокаКадровыхДанных = КадровыеДанныеДляЗаполнения.НайтиСтроки(Новый Структура("Сотрудник", ДанныеСотрудника.Сотрудник));
							Если СтрокаКадровыхДанных.Количество() > 0 Тогда
								НоваяСтрока[КадровоеДанное] = СтрокаКадровыхДанных[0][КадровоеДанное];
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратыУтериУдостоверений.Ссылка.Дата КАК Период,
		|	ВозвратыУтериУдостоверений.Ссылка КАК Регистратор,
		|	ВЫРАЗИТЬ(ВозвратыУтериУдостоверений.Ссылка КАК Документ.ВозвратУтеряУдостоверений).Организация КАК Организация,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫРАЗИТЬ(ВозвратыУтериУдостоверений.Ссылка КАК Документ.ВозвратУтеряУдостоверений).ВидУдостоверения КАК ВидУдостоверения,
		|	ВозвратыУтериУдостоверений.СтатусУдостоверения КАК СтатусУдостоверения,
		|	ВозвратыУтериУдостоверений.ФИО КАК ФИО,
		|	ВозвратыУтериУдостоверений.Должность КАК Должность,
		|	ВозвратыУтериУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВозвратыУтериУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	ВозвратыУтериУдостоверений.ДатаВыдачи КАК ДатаВыдачи,
		|	ВозвратыУтериУдостоверений.ДатаВозвращенияУтраты КАК ДатаВозвращенияУтраты,
		|	ВозвратыУтериУдостоверений.Основание КАК Основание,
		|	ВозвратыУтериУдостоверений.ПредоставленаСправкаИзОрганаВнутреннихДел КАК ПредоставленаСправкаИзОрганаВнутреннихДел
		|ИЗ
		|	Документ.ВозвратУтеряУдостоверений.УдостоверенияСотрудников КАК ВозвратыУтериУдостоверений
		|ГДЕ
		|	ВозвратыУтериУдостоверений.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВозвратыУтериУдостоверений.НомерСтроки";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		МодульКлассныеЧиныРанги = ОбщегоНазначения.ОбщийМодуль("КлассныеЧиныРанги");
		МодульКлассныеЧиныРанги.ДополнитьЗапросПолямиКлассногоЧинаРангаДляУдостоверений(Запрос.Текст, "", "ВозвратыУтериУдостоверений");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МодульВоинскиеСпециальныеЗвания = ОбщегоНазначения.ОбщийМодуль("ВоинскиеСпециальныеЗвания");
		МодульВоинскиеСпециальныеЗвания.ДополнитьЗапросПолямиВоинскогоСпециальногоЗванияДляУдостоверений(Запрос.Текст, "", "ВозвратыУтериУдостоверений");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Движения.Удостоверения.Очистить();
		Движения.Удостоверения.Записывать = Истина;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.Удостоверения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратыУтериУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВозвратыУтериУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВозвратыУтериУдостоверений.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТВозвратыУтериУдостоверений
		|ИЗ
		|	Документ.ВозвратУтеряУдостоверений.УдостоверенияСотрудников КАК ВозвратыУтериУдостоверений
		|ГДЕ
		|	ВозвратыУтериУдостоверений.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратыУтериУдостоверений.НомерСтроки КАК НомерСтроки,
		|	ВозвратыУтериУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	ВозвратыУтериУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения
		|ИЗ
		|	ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Удостоверения.СрезПоследних(
		|				,
		|				Организация = &Организация
		|					И ВидУдостоверения = &ВидУдостоверения) КАК Удостоверения
		|		ПО ВозвратыУтериУдостоверений.Сотрудник = Удостоверения.Сотрудник
		|			И ВозвратыУтериУдостоверений.ФизическоеЛицо = Удостоверения.ФизическоеЛицо
		|			И ВозвратыУтериУдостоверений.СерияУдостоверения = Удостоверения.СерияУдостоверения
		|			И ВозвратыУтериУдостоверений.НомерУдостоверения = Удостоверения.НомерУдостоверения
		|			И (Удостоверения.СтатусУдостоверения = ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Уничтожено))
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'По сотруднику %1 удостоверение (серия ""%2"", № ""%3"") находится в статусе ""%4"", распроведение выдачи невозможно.'"),
				Выборка.Сотрудник,
				Выборка.СерияУдостоверения,
				Выборка.НомерУдостоверения,
				Выборка.СтатусУдостоверения);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"Сотрудники[" + (Выборка.НомерСтроки) + "].Сотрудник",
				"Объект",
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли