
#Область СлужебныеПроцедурыИФункции

Функция ПричинаОтклоненияКандидатаПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПричиныОтклоненияКандидатов.Ссылка
		|ИЗ
		|	Справочник.ПричиныОтклоненияКандидатов КАК ПричиныОтклоненияКандидатов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПричиныОтклоненияКандидатов.РеквизитДопУпорядочивания");
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// См. РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИКандидатовПоКИФизическихЛиц
Функция ВидыКИКандидатовПоКИФизическихЛиц() Экспорт
	
	Возврат РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИКандидатовПоКИФизическихЛиц();
	
КонецФункции

// См. РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИФизическихЛицПоКИКандидатов
Функция ВидыКИФизическихЛицПоКИКандидатов() Экспорт
	
	Возврат РегистрыСведений.НастройкаВидовКонтактнойИнформацииКандидатов.ВидыКИФизическихЛицПоКИКандидатов();
	
КонецФункции

#КонецОбласти
