
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заголовок", Заголовок);
	Параметры.Свойство("ОрганизацияСсылка", ОрганизацияСсылка);
	
	ПрочитатьДанные();
	
	Если ДоступенПросмотрФинансовыйУчетПодразделений Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ФинансовыйУчетПодразделенийПериодСтрокой",
			"ТолькоПросмотр",
			Не ДоступноРедактированиеФинансовыйУчетПодразделений);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ФинансовыйУчетКлиент.ФинансовыйУчетОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, "МестоВСтруктуреПредприятия");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаОповещенияСохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтотОбъект, "ФинансовыйУчетПодразделений", МестоВСтруктуреПредприятия, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#Область ФинансовыйУчетЗарплатыОрганизаций

&НаКлиенте
Процедура СпособОтраженияПриИзменении(Элемент)
	
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(
		ЭтотОбъект, ОбщегоНазначенияКлиент.ДатаСеанса(), "ФинансовыйУчетПодразделений", "МестоВСтруктуреПредприятия");
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетВариантПриИзменении(Элемент)
	ФинансовыйУчетКлиент.ПодразделенияВариантПриИзменении(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийПериодСтрокойПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.ВводМесяцаПриИзменении(ЭтотОбъект, "ФинансовыйУчетПодразделений.Период", "ФинансовыйУчетПодразделенийПериодСтрокой", Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗарплатаКадрыКлиент.ВводМесяцаНачалоВыбора(
		ЭтотОбъект,
		ЭтотОбъект,
		"ФинансовыйУчетПодразделений.Период",
		"ФинансовыйУчетПодразделенийПериодСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийПериодСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаРегулирование(ЭтотОбъект, "ФинансовыйУчетПодразделений.Период", "ФинансовыйУчетПодразделенийПериодСтрокой", Направление, Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийПериодСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаАвтоПодборТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийПериодСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	ЗарплатаКадрыКлиент.ВводМесяцаОкончаниеВводаТекста(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийРаспределениеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ФинансовыйУчетПодразделенийРаспределение.Количество() > 0 И Не ЗначениеЗаполнено(ФинансовыйУчетПодразделений.Период) Тогда
		ФинансовыйУчетПодразделений.Период = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());
		ЗарплатаКадрыКлиентСервер.ЗаполнитьМесяцПоДате(ЭтотОбъект, "ФинансовыйУчетПодразделений.Период", "ФинансовыйУчетПодразделенийПериодСтрокой");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФинансовыйУчетПодразделенийИстория(Команда)
	ОткрытьФормуРедактированияИсторииФинансовыйУчет();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьЗакрытьНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанные()
	
	УстановитьЗначенияПравДоступа();
	
	МестоВСтруктуреПредприятия = ОрганизационнаяСтруктура.ПодразделениеВСтруктуреПредприятия(ОрганизацияСсылка);
	
	ПрочитатьДанныеФинансовогоУчетаДляРедактированияВФорме();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеФинансовогоУчетаДляРедактированияВФорме()
	
	Если Не ДоступенПросмотрФинансовыйУчетПодразделений Тогда
		Возврат;
	КонецЕсли;
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(
		ЭтотОбъект, "ФинансовыйУчетПодразделений", МестоВСтруктуреПредприятия);
	
	ФинансовыйУчетПодразделенийРаспределение.Очистить();
		
	Период = ФинансовыйУчетПодразделений.Период;
	Если ЗначениеЗаполнено(Период) Тогда
		НаборЗаписей = РегистрыСведений.ФинансовыйУчетПодразделений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Подразделение.Установить(МестоВСтруктуреПредприятия);
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() > 1 Тогда
			ФинансовыйУчетПодразделенийРаспределение.Загрузить(НаборЗаписей.Выгрузить());
		КонецЕсли;
	КонецЕсли;
	
	СтруктураЗаписиСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого КлючЗначение Из ФинансовыйУчетПодразделенийПрежняя Цикл
		Если НужнаЗапятая Тогда
			СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + ",";
		КонецЕсли;
		СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + КлючЗначение.Ключ;
		НужнаЗапятая = Истина;
	КонецЦикла;
	
	ПрежнийНабор = Новый Массив;
	Для каждого СтрокаНабора Из ФинансовыйУчетПодразделенийРаспределение Цикл
		СтруктураЗаписи = Новый Структура(СтруктураЗаписиСтрокой);
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, СтрокаНабора);
		ПрежняяЗапись = Новый ФиксированнаяСтруктура(СтруктураЗаписи);
		ПрежнийНабор.Добавить(ПрежняяЗапись);
	КонецЦикла;
	ФинансовыйУчетПодразделенийРаспределениеПрежняя = Новый ФиксированныйМассив(ПрежнийНабор);
	
	ИмяРегистра = "ФинансовыйУчетПодразделений";
	ФинансовыйУчетКлиентСервер.ОбновитьПолеСведенияОФинансовомУчетеПериод(
		ЭтотОбъект, ТекущаяДатаСеанса(), ИмяРегистра, "МестоВСтруктуреПредприятия");
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаУстановитьВариантНастройки(ЭтотОбъект, ИмяРегистра);
	ФинансовыйУчетКлиентСервер.ФормаОбъектаУчетаОбновитьТекущуюСтраницу(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПравДоступа()
	
	ДоступенПросмотрФинансовыйУчетПодразделений = ПравоДоступа("Просмотр", Метаданные.РегистрыСведений.ФинансовыйУчетПодразделений);
	ДоступноРедактированиеФинансовыйУчетПодразделений = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ФинансовыйУчетПодразделений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияИсторииФинансовыйУчет()

	МассивЗаписей = МассивЗаписейИсторииФинансовогоУчета();
	
	ПараметрыФормы = Новый Структура("МассивЗаписей,ВедущийОбъект,ТолькоПросмотр", МассивЗаписей, МестоВСтруктуреПредприятия, ТолькоПросмотр);
	ПараметрыФормы.Вставить("ИмяРегистра", "ФинансовыйУчетПодразделений");
	ПараметрыФормы.Вставить("ИмяИзмерения", "Подразделение");
	ОткрытьФорму("ОбщаяФорма.РедактированиеИсторииСРаспределениемФинансовыйУчет", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция МассивЗаписейИсторииФинансовогоУчета()
	Возврат ФинансовыйУчетФормы.МассивЗаписейИсторииФинансовогоУчета(ЭтотОбъект, , , "МестоВСтруктуреПредприятия");
КонецФункции

#Область ОбслуживаниеЗаписи

&НаКлиенте
Процедура ОбработкаОповещенияСохранитьИЗакрыть(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗаписатьЗакрытьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрытьНаКлиенте(ОповещениеЗавершения = Неопределено) 

	ДополнительныеПараметры = Новый Структура("ОповещениеЗавершения", ОповещениеЗавершения);
	Оповещение = Новый ОписаниеОповещения("ЗаписатьНаКлиентеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстКнопкиДа = НСтр("ru = 'Изменился финансовый учет'");
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru =  'При редактировании изменился финансовый учет для организации.
					|Если просто исправлены прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
					|Если финансовый учет организации изменился с %1, нажмите ""Изменился финансовый учет""'"), 
		Формат(ФинансовыйУчетПодразделений.Период, НСтр("ru='ДФ=''д ММММ гггг ""г""'''")));
		
	РедактированиеПериодическихСведенийКлиент.ЗапроситьРежимИзмененияРегистра(ЭтотОбъект, "ФинансовыйУчетПодразделений", ТекстВопроса, ТекстКнопкиДа, Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиентеЗавершение(Отказ, ДополнительныеПараметры) Экспорт 

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения, Отказ);
	Иначе
		СохранитьДанныеНаСервере(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеНаСервере(Отказ)
	
	Если ПроверитьЗаполнение() Тогда
		ФинансовыйУчетФормы.ФормаОрганизацииПриЗаписиНаСервере(ЭтотОбъект, ОрганизацияСсылка, Отказ);
		Модифицированность = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ Тогда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


