#Область СлужебныеПроцедурыИФункции

Функция УдержанияПоРабочимМестам(РеквизитыДляПроведения) Экспорт 
	
	Возврат МодульКонтракта().УдержанияПоРабочимМестам(РеквизитыДляПроведения);
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Документ, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	МодульКонтракта().ОбработкаПроверкиЗаполнения(Документ, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ВозвратНДФЛБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ВозвратНДФЛРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
