////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтеграцияС1САрхивом"
// Серверные процедуры, обслуживающие правила регистрации объектов.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	ВидОтбораПоОрганизациям = СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоОрганизациям;

	Если ОбъектМетаданных = Метаданные.Справочники.ДокументыБИА Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
			Метаданные.Справочники.ДокументыБИА.Реквизиты.ОбъектОснование,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ДокументыБИАПрисоединенныеФайлы Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПакетыДокументовДля1САрхива Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, "Организация",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СотрудникиБИА Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
			Метаданные.Справочники.СотрудникиБИА.Реквизиты.ФизическоеЛицо,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДокументыОтправленныеВ1САрхив Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ДокументыОтправленныеВ1САрхив.Измерения.Документ,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.УдалитьИсторияОбменаС1САрхивом.Измерения.ОбъектДанных,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияОбменаС1САрхивом Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ИсторияОбменаС1САрхивом.Измерения.Объект,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.ОчередьОперацийСДокументамиДля1САрхива.Измерения.Объект,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СтатусыОбменаДокументовБИА Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки,
			Метаданные.РегистрыСведений.СтатусыОбменаДокументовБИА.Измерения.ДокументБИА,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти