#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МестоположениеФормы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.МестоположениеФормы();
	МестоположениеФормы.Документооборот2 = Истина;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ID", ПараметрыВыполненияКоманды.Источник.ID);
	ПараметрыФормы.Вставить("type", ПараметрыВыполненияКоманды.Источник.Тип);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуБИД(
		МестоположениеФормы,
		"ИсторияПереписки",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти