// @strict-types


#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ОписаниеТипаВладельцаЛичныхДанных, НеПоказыватьТипВладельцаЛичныхДанных",
		Новый ОписаниеТипов("СправочникСсылка.ЛичныеДанныеКандидатов") , Истина);
	ОткрытьФорму("Обработка.ОбъединениеДублейПерсональныхДанных.Форма", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, "ЛичныеДанныеКандидатов", ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти
