#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуДобавленияОрганизации(Параметры) Экспорт

КонецПроцедуры

// Открывает форму быстрого старта с выбором способа добавления организации
//
// Параметры:
//  Параметры - Структура - параметры открываемой формы
//
Процедура ОткрытьФормуБыстрогоСтартаСВыборомСпособаДобавленияОрганизации(Параметры) Экспорт

КонецПроцедуры

// Открывает форму результата загрузки организаций из другой информационной базы
//
// Параметры:
//  Параметры - Структура - параметры открываемой формы
//
Процедура ОткрытьФормуУспешнойЗагрузкиОрганизацийИзБазы(Параметры) Экспорт

КонецПроцедуры

Процедура ОткрытьФормуПрилинкованияИзБыстрогоСтарта() Экспорт

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
