#Область СлужебныйПрограммныйИнтерфейс

Функция РасширенияТекущейОбластиДанных() Экспорт

	Возврат Неопределено;

КонецФункции

Функция ЕстьУстановленныеРасширенияИзменяющиеСтруктуруДанных() Экспорт 
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьКаркасДляВерсииРасширения(ЗаписьПоставляемогоРасширения) Экспорт
	
	Возврат Неопределено;
		
КонецФункции

#Область ВыгрузкаЗагрузкаДанных

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
// 
// Параметры:
// 	Типы - См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
// 
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьИспользованиеПоставляемыхРасширенийВОбластяхДанных);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьРасширенияИзменяющиеСтруктуруДанныхОжидаемыеПользователем);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьОчередьРасширенийДляОповещений);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиКаталогаРасширенийВОбластяхДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти