///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при нажатии кнопки "Поиск", если в параметрах поиска задано значение
//  СтандартнаяОбработка = Ложь, либо если пользователь выбрал нетиповой поиск.
//  Может использоваться сторонними разработчиками в отраслевых и других нетиповых
//  конфигурациях, если они хотят реализовать свой собственный сайт для поиска информации,
//  а так же, если необходимо реализовать возможность поиска в сторонних поисковых системах.
//  Позволяет задать URL по которому должен быть выполнен переход.
//  Открытие указанного адреса выполняется через браузер по умолчанию.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма, в которой было выполнено нажатие кнопки "Найти".
//  СтрокаПоиска - Строка - строка поиска, которую ввел пользователь.
//  Источник - Строка - выбранный пользователем источник поиска. См. описание параметра
//    Настройки.ПараметрыПоиска.ДополнительныеИсточники метода ПриОпределенииНастроек.
//    Если пользователь выбрал вариант поиска по умолчанию, то в параметр передается
//    значение "Стандарт".
//  СсылкаПоискаИнформации - Строка - требуется заполнить адресом страницы, на который необходимо
//    выполнить переход. Если не задана, то пользователю будет выведено сообщение об ошибке.
//  СтандартнаяОбработка - Булево - признак необходимости выполнять стандартную обработку после
//    выхода из метода.
//
// Пример:
// 
//   Если Источник = "Яндекс" Тогда
//      СсылкаПоискаИнформации = "https://ya.ru/search/?text="
//         + СтрЗаменить(СтрокаПоиска, " ", "+");
//   ИначеЕсли Источник = "Гугл" Тогда
//      СсылкаПоискаИнформации = "https://www.google.com/search?q="
//         + СтрЗаменить(СтрокаПоиска, " ", "+");
//   КонецЕсли;
//
Процедура ПриОпределенииСтраницыПоиска(
		Форма,
		СтрокаПоиска,
		Источник,
		СсылкаПоискаИнформации,
		СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при нажатии на различные объекты панели.
// 
// Параметры:
//  Источник - Строка - источник вызова метода. Может принимать следующие значения:
//    "Карточка" - метод вызван при нажатии на прикладные кнопки.
//    "Карусель" - метод вызван при нажатии навигационной ссылки в сообщении карусели.
//    "Пожелания" - метод вызван нажатием кнопки "Тех.поддержка" -> "Предложите идею по улучшению программы"
//    "Логотип" - методы вызван нажатием на логотип.
//    "ИзвестныеОшибки" - метод вызван нажатием кнопки "Тех.поддержка" -> "Известные проблемы"
//    "Документация" - метод вызван нажатием типовой карточки "Документация".
//    "ОтветыНаВопросы" - метод вызван нажатием типовой карточки "Ответы на вопросы".
//    "СоцСети" - метод вызван нажатие ссылки на соц.сети.
//  Параметр - Строка - дополнительный параметр. Значение зависит от источника:
//    Для "Карточка" - структура, содержащая Идентификатор и Ссылка, указанные в методе ПриОпределенииНастроек.
//    Для "Карусель" - НавигационнаяСсылка.
//    Для "Пожелания" - значение свойства Пожелания.ЛинияПоддержки, указанное в методе ПриОпределенииНастроек.
//    Для "Логотип" - значение свойства Логотип.Ссылка, указанное в методе ПриОпределенииНастроек.
//    Для "ИзвестныеОшибки" - значение свойства ИзвестныеОшибки, указанное в методе ПриОпределенииНастроек.
//    Для "Документация" - значение свойства Документация, указанное в методе ПриОпределенииНастроек.
//    Для "ОтветыНаВопросы" - значение свойства ОтветыНаВопросы, указанное в методе ПриОпределенииНастроек.
//    Для "СоцСети" - значение ссылки на соц.сети, указанное в методе ПриОпределенииНастроек.
//  СтандартнаяОбработка - Булево - признак использования стандартной обработки.
//    Если действие обработано в данном методе, то необходимо установить значение Ложь, иначе
//    после выхода из метода будет дополнительно выполнена стандартная попытка перехода по ссылке.
// 
// Пример:
// 
//  В метод ПанельПомощьПереопределяемый.ПриОпределенииНастроек имеет следующий код:
//  
//   Процедура ПриОпределенииНастроек(Настройки) Экспорт
//      
//      ВерсияКонфигурации = ОбщиеМетоды.ПолучитьВерсию();
//      
//      Если ВерсияКонфигурации = "Версия1" Тогда
//        Настройки.Документация = "Документация";
//      Иначе
//        Настройки.Документация = "https:its.1c.ru/db/";
//      КонецЕсли;
//      
//      Если ВерсияКонфигурации = "Версия1" Тогда
//        Настройки.ИзвестныеОшибки = "ОшибкиВерсия1";
//      Иначе
//        Настройки.ИзвестныеОшибки = "ОшибкиВерсия2";
//      КонецЕсли;
//      
//      Настройки.ОтветыНаВопросы = "ОтветыНаВопросы";
//      
//      Если ВерсияКонфигурации = "Версия1" Тогда
//        Настройки.Пожелания.ЛинияПоддержки = "ПожеланияВерсия1";
//      Иначе
//        Настройки.Пожелания.ЛинияПоддержки = "ПожеланияВерсия2";
//      КонецЕсли;
//      
//      Настройки.Логотип.Картинка = БиблиотекаКартинок.Логотип;
//      Настройки.Логотип.Ссылка = "Логотип";
//      Настройки.Логотип.Цвет = ЦветаПалитры.ПервыйБрендовый;
//      
//      Настройки.ПрикладныеПараметры.Карусель.Сообщения.Добавить(
//        ПанельПомощь.НовыйСообщениеКарусель(
//          НСтр("ru = 'Как включить/отключить учет по договорам?'"),
//          НСтр("ru = '<a href=""КакВключитьОтключитьУчетПоДоговорам"">Настройки - Функциональность - Учет по договорам</a>'")));
//      Настройки.ПрикладныеПараметры.Карусель.Сообщения.Добавить(
//        ПанельПомощь.НовыйСообщениеКарусель(,, БиблиотекаКартинок.НовостиКарусель, "ВсеНовости"));
//      
//      НоваяКарточка = ПанельПомощь.НовыйДанныеКарточек(
//        "ЦентрИдей",
//        НСтр("ru = 'Центр идей'"),
//        "");
//      Настройки.ПрикладныеПараметры.ДанныеКарточек.Добавить(НоваяКарточка);
//      
//      Настройки.ПрикладныеПараметры.ДанныеСоцСети.Добавить(
//        ПанельПомощь.НоваяСсылкаСоцсети(
//          "_ДемоЛоготипВК",
//          ,
//          НСтр("ru = 'Страница ВКонтакте'"),
//          "https://vk.com/cn1"));
//      Настройки.ПрикладныеПараметры.ДанныеСоцСети.Добавить(
//        ПанельПомощь.НоваяСсылкаСоцсети(
//          "_ДемоЛоготипТелеграм",
//          ,
//          НСтр("ru = 'Канал в Телеграм'"),
//          "https://t.me/cn1"));
//      
//   КонецПроцедуры
// 
//  Проверка значений в текущем методе
//   
//   Процедура ПриОбработкеНавигационнойСсылки(Источник, Параметр, СтандартнаяОбработка) Экспорт
//      
//      Если Источник = "Документация" Тогда
//         Если Параметр = "ДокументацияВерсия1" Тогда
//            // Для ЭтоВерсия1 открываем встроенную справку.
//            СтандартнаяОбработка = Ложь;
//            ОткрытьСправку();
//         Иначе
//            // Для остальных версий ничего не делаем: будет
//            // выполнен переход по указанной ссылке "https://its.1c.ru/db/",
//            // поскольку СтандартнаяОбработка осталась в значении Истина.
//         КонецЕсли;
//      
//      ИначеЕсли Источник = "ИзвестныеОшибки" Тогда
//         СтандартнаяОбработка = Ложь;
//         Параметры = Новый Структура("Версия", Параметр);
//         ОткрытьФорму("ОбщаяФорма.СписокИзвестныхОшибок", ПараметрыФормы);
//      
//      ИначеЕсли Источник = "ОтветыНаВопросы" Тогда
//         СтандартнаяОбработка = Ложь;
//         ОткрытьФорму("ОбщаяФорма.ОтветыНаВопросы");
//      
//      ИначеЕсли Источник = "Пожелания" Тогда
//         СтандартнаяОбработка = Ложь;
//         Получатель = "";
//         Если Параметр = "ПожеланияВерсия1" Тогда
//            Получатель = "example_1@1c.com";
//         ИначеЕсли Параметр = "ПожеланияВерсия2" Тогда
//            Получатель = "example_2@1c.com";
//         КонецЕсли;
//         ОтправитьПожелание(Получатель);
//      
//      ИначеЕсли Источник = "Логотип" Тогда
//         СтандартнаяОбработка = Ложь;
//         ИнформационныйЦентрКлиент.ОткрытьОбсужденияНаФоруме();
//      
//      ИначеЕсли Источник = "Карусель" Тогда
//         Если Параметр = "КакВключитьОтключитьУчетПоДоговорам" Тогда
//            СтандартнаяОбработка = Ложь;
//            ПараметрыФормы = Новый Структура;
//            ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаУчетПоДоговорам");
//            ОткрытьФорму("Обработка.ФункциональностьПрограммы.Форма", ПараметрыФормы);
//         ИначеЕсли Параметр = "ВсеНовости" Тогда
//            СтандартнаяОбработка = Ложь;
//            ОткрытьФорму("Справочник.Новости.Форма.ФормаПросмотраНовостей",,, "");
//         КонецЕсли;
//      
//      ИначеЕсли Источник = "Карточка" Тогда
//         Если Параметр.Идентификатор = "ЦентрИдей" Тогда
//            СтандартнаяОбработка = Ложь;
//            ИнформационныйЦентрКлиент.ОткрытьЦентрИдей();
//         КонецЕсли;
//      
//      ИначеЕсли Источник = "СоцСети" Тогда
//         Если Параметр = "https://t.me/cn1" Тогда
//            СтандартнаяОбработка = Ложь;
//            ОбработкаОповещения = Новый ОписаниеОповещения("ОбработкаОтветаТелеграм", ЭтотОбъект);
//            ПоказатьВопрос(
//               ОбработкаОповещения,
//               НСтр("ru = 'Доступ к Телеграм может быть заблокирован. Хотите открыть канал в ВКонтакте?'")),
//               РежимДиалогаВопрос.ДаНетОтмена);
//         КонецЕсли;
//         // Другие ссылки будут открываются без дополнительной обработки.
//      КонецЕсли;
//   
//   КонецПроцедуры
//   
//   Процедура ОтправитьПожелание(Получатель)
//   
//      Текст = НСтр("ru = 'Опишите, каких возможностей вам не хватает в программе:'");
//      
//      ТекстПисьма = НСтр("ru = 'Опишите, каких возможностей вам не хватает в программе:'")
//         + Символы.ПС + Символы.ПС + Символы.ПС + Символы.ПС + Символы.ПС
//         + УправлениеНебольшойФирмойВызовСервера.СлужебнаяИнформацияДляПисьма();
//      
//      Получатель = Новый СписокЗначений;
//      Получатель.Добавить(Получатель);
//      
//      ПараметрыПисьма = Новый Структура;
//      ПараметрыПисьма.Вставить("Получатель", Получатель);
//      ПараметрыПисьма.Вставить("Тема", НСтр("ru = 'Хочу эти возможности в будущей версии'"));
//      ПараметрыПисьма.Вставить("Текст", ТекстПисьма);
//      
//      РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
//   
//   КонецПроцедуры
//   
//   Процедура ОбработкаОтветаТелеграм(Ответ, ДополнительныеПараметры)
//      
//      Если Ответ = КодВозвратаДиалога.Да Тогда
//         ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://vk.com/cn1");
//      ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
//         ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку("https://t.me/cn1");
//      КонецЕсли;
//      
//   КонецПроцедуры
// 
Процедура ПриОбработкеНавигационнойСсылки(Источник, Параметр, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

