
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РучныеЗадачиБухгалтера.Ссылка КАК Ссылка,
	|	РучныеЗадачиБухгалтера.Наименование КАК Наименование
	|ИЗ
	|	Справочник.РучныеЗадачиБухгалтера КАК РучныеЗадачиБухгалтера
	|
	|УПОРЯДОЧИТЬ ПО
	|	РучныеЗадачиБухгалтера.ДатаПоследнегоИспользования УБЫВ,
	|	РучныеЗадачиБухгалтера.Код УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.Задача) Тогда
		Для Каждого Строка Из Список Цикл
			Если Строка.Ссылка = Параметры.Задача Тогда
				Элементы.Список.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокНаименованиеПриИзменении(Элемент)
	
	СтрокаСписка = Элементы.Список.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(СтрокаСписка.Наименование) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаСписка.Ссылка) Тогда
		ПереименоватьЗадачу(СтрокаСписка.Ссылка, СтрокаСписка.Наименование);
		Возврат;
	КонецЕсли;
	
	НоваяЗадача = ДобавитьЗадачу(СтрокаСписка.Наименование);
	Если НоваяЗадача = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Возникла ошибка при добавлении задачи. Подробности записаны в Журнал регистрации.'"));
		Возврат;
	КонецЕсли;
	СтрокаСписка.Ссылка = НоваяЗадача;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		Закрыть( Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПереименоватьЗадачу(Задача, Наименование)
	
	Справочники.РучныеЗадачиБухгалтера.Переименовать(Задача, Наименование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДобавитьЗадачу(Наименование)
	
	Возврат Справочники.РучныеЗадачиБухгалтера.Добавить(Наименование);
	
КонецФункции

#КонецОбласти