#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок(ЗначениеРазрешено(Сотрудники.УчастникКадровогоРезерва, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьУчастниковКадровогоРезерва");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ИзменениеСтатусаГотовностиРезервистов;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ПолучитьДанныеДляПроведения(Ссылка)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзменениеСтатусаГотовностиРезервистов.Дата КАК Период,
		|	ИзменениеСтатусаРезервистовСотрудники.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ИзменениеСтатусаРезервистовСотрудники.ПозицияРезерва КАК ПозицияРезерва,
		|	ИзменениеСтатусаРезервистовСотрудники.Статус КАК Статус
		|ИЗ
		|	Документ.ИзменениеСтатусаГотовностиРезервистов.Сотрудники КАК ИзменениеСтатусаРезервистовСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеСтатусаГотовностиРезервистов КАК ИзменениеСтатусаГотовностиРезервистов
		|		ПО ИзменениеСтатусаРезервистовСотрудники.Ссылка = ИзменениеСтатусаГотовностиРезервистов.Ссылка
		|ГДЕ
		|	ИзменениеСтатусаГотовностиРезервистов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДанныеДляПроведения = Новый Структура;
	ДанныеДляПроведения.Вставить("ДвиженияСтатусыРезервистов", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;

КонецФункции	

#Область ОбработчикиОбновления

// Выполняет перенос данных из реквизита УдалитьФизическоеЛицо в УчастникКадровогоРезерва при обновлении.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ЗаполнитьУчастниковКадровогоРезерва(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
	
	Если Не ПараметрыОбновления.Свойство("ОбработанныеДокументы") Тогда
		ПараметрыОбновления.Вставить("ОбработанныеДокументы", Новый Массив);
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбработанныеДокументы", ПараметрыОбновления.ОбработанныеДокументы);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ИзменениеСтатусаГотовностиРезервистовСотрудники.Ссылка КАК Ссылка,
		|	ИзменениеСтатусаГотовностиРезервистовСотрудники.НомерСтроки,
		|	ИзменениеСтатусаГотовностиРезервистовСотрудники.УдалитьФизическоеЛицо КАК УдалитьФизическоеЛицо
		|ИЗ
		|	Документ.ИзменениеСтатусаГотовностиРезервистов.Сотрудники КАК ИзменениеСтатусаГотовностиРезервистовСотрудники
		|ГДЕ
		|	ИзменениеСтатусаГотовностиРезервистовСотрудники.УчастникКадровогоРезерва = НЕОПРЕДЕЛЕНО
		|	И НЕ ИзменениеСтатусаГотовностиРезервистовСотрудники.Ссылка В (&ОбработанныеДокументы)
		|ИТОГИ
		|ПО
		|	Ссылка";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.Документы.ИзменениеСтатусаГотовностиРезервистов.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработанныеДокументы", Новый Массив);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРегистратор.Следующий() Цикл
			ДокументОбъект = ВыборкаРегистратор.Ссылка.ПолучитьОбъект(); // ДокументОбъект.ИзменениеСтатусаГотовностиРезервистов
			Выборка = ВыборкаРегистратор.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаТабличнойЧасти = ДокументОбъект.Сотрудники[Выборка.НомерСтроки - 1];
				СтрокаТабличнойЧасти.УчастникКадровогоРезерва = СтрокаТабличнойЧасти.УдалитьФизическоеЛицо;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			ПараметрыОбновления.ОбработанныеДокументы.Добавить(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли