#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РасчетЗарплатыДляНебольшихОрганизацийСуществует = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций");
	Если Не РасчетЗарплатыДляНебольшихОрганизацийСуществует Тогда
		Если Значение Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя установить значение ИспользоватьБазовуюФункциональность'");
		КонецЕсли;
	КонецЕсли;
	
	РасширеннаяФункциональностьНедоступна = Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы");
	Если РасчетЗарплатыДляНебольшихОрганизацийСуществует И РасширеннаяФункциональностьНедоступна И Не Значение Тогда 
		ВызватьИсключение НСтр("ru = 'Нельзя сбросить значение ИспользоватьБазовуюФункциональность'");
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли