#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Подразделение)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Переопределяет параметры загрузки данных из файла.
//
// Параметры:
//  Параметры - Структура:
//   * ИмяМакетаСШаблоном - Строка - наименование макета. Например, "ЗагрузкаИзФайла".
//   * ИмяТабличнойЧасти - Строка - полное имя табличной части. Например, "Документ._ДемоСчетНаОплатуПокупателю.ТабличнаяЧасть.Товары"
//   * ОбязательныеКолонки - Массив из Строка - наименования обязательных для заполнения колонок.
//   * ТипДанныхКолонки - Соответствие из КлючИЗначение:
//      * Ключ - Строка - имя колонки;
//      * Значение - ОписаниеТипов - тип колонки загружаемых данных.
//   * ДополнительныеПараметры - Структура
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт
	
КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
// СписокНеоднозначностей содержит список неоднозначных значений, для которых в ИБ имеется несколько
// подходящих вариантов.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                                        находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки.
//       Остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                                        являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений:
//     * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность.
//     * Идентификатор - Число - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - Произвольный - любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаСопоставления = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	СтруктурыСоответствуют = ДополнительныеПараметры.СтруктурыСоответствуют;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСтатейРасходов", ВыгрузитьКолонку(ЗагружаемыеДанные, "СтатьяРасходов"));
	Запрос.УстановитьПараметр("МассивНаправленийДеятельности", ВыгрузитьКолонку(ЗагружаемыеДанные, "НаправлениеДеятельности"));
	Запрос.УстановитьПараметр("МассивКодовПодразделений", ВыгрузитьКолонку(ЗагружаемыеДанные, "КодПодразделения"));
	Запрос.УстановитьПараметр("МассивАналитикРасходов", ВыгрузитьКолонку(ЗагружаемыеДанные, "АналитикаРасходов"));
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиРасходов.Ссылка КАК Ссылка,
		|	СтатьиРасходов.Наименование КАК СтатьяРасходов
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|ГДЕ
		|	СтатьиРасходов.Наименование В (&МассивСтатейРасходов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаправленияДеятельности.Ссылка КАК Ссылка,
		|	НаправленияДеятельности.Наименование КАК НаправлениеДеятельности
		|ИЗ
		|	Справочник.НаправленияДеятельности КАК НаправленияДеятельности
		|ГДЕ
		|	НаправленияДеятельности.Наименование В (&МассивНаправленийДеятельности)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Проекты.Ссылка КАК Ссылка,
		|	Проекты.Наименование КАК АналитикаРасходов
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|ГДЕ
		|	Проекты.Наименование В (&МассивАналитикРасходов)";
	
	Если СтруктурыСоответствуют Тогда
		Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка,
			|	СтруктураПредприятия.КодИсточника КАК КодПодразделения,
			|	ПодразделенияОрганизаций.Владелец.Наименование КАК Организация
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
			|		ПО СтруктураПредприятия.Источник = ПодразделенияОрганизаций.Ссылка
			|ГДЕ
			|	СтруктураПредприятия.КодИсточника В (&МассивКодовПодразделений)";
	Иначе
		Запрос.Текст = Запрос.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка,
			|	СтруктураПредприятия.Код КАК КодПодразделения
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|ГДЕ
			|	СтруктураПредприятия.Код В (&МассивКодовПодразделений)";
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатЗагрузки = Новый Структура;
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[0].Выгрузить(), "ТаблицаСтатьиРасходов", "СтатьяРасходов");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[1].Выгрузить(), "ТаблицаНаправленийДеятельности", "НаправлениеДеятельности");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[2].Выгрузить(), "ТаблицаАналитикРасходов", "АналитикаРасходов");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[3].Выгрузить(), "ТаблицаКодыПодразделений", "КодПодразделения");
	
	КэшДанныхЗагрузки = Новый Структура;
	КэшДанныхЗагрузки.Вставить("СоответствиеСтрокДатам", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеСтатейРасходов", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеНаправленийДеятельности", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеАналитикРасходов", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеКодовПодразделений", Новый Соответствие);
	
	Если СтруктурыСоответствуют Тогда
		СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаКодыПодразделений.Скопировать(), "ТаблицаОрганизацийКодыИсточников", "Организация, КодПодразделения");
		КэшДанныхЗагрузки.Вставить("СоответствиеПодразделенийПоОтбору", Новый Соответствие);
	КонецЕсли;
	
	СоответствиеКатегорийРасходов = Новый Соответствие;
	Для каждого ЭлементПеречисления Из Метаданные.Перечисления.КатегорииРасходовНаПерсонал.ЗначенияПеречисления Цикл
		СоответствиеКатегорийРасходов.Вставить(ЭлементПеречисления.Синоним, Перечисления.КатегорииРасходовНаПерсонал[ЭлементПеречисления.Имя]);
	КонецЦикла;
	КэшДанныхЗагрузки.Вставить("СоответствиеКатегорийРасходов", СоответствиеКатегорийРасходов);
	
	ПустаяДата = Дата(1,1,1);
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		НоваяСтрока = ТаблицаСопоставления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Если НоваяСтрока.Период = ПустаяДата Тогда
			ЗаполнитьПериодИзСтрокиВДату(НоваяСтрока, КэшДанныхЗагрузки.СоответствиеСтрокДатам, СтрокаТаблицы.Период);
		КонецЕсли;
		НоваяСтрока.КатегорияРасходов = СоответствиеКатегорийРасходов.Получить(СтрокаТаблицы.КатегорияРасходов);
		ПроверитьНеоднозначностьЗначения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки.СоответствиеСтатейРасходов,
			СписокНеоднозначностей, РезультатЗагрузки.ТаблицаСтатьиРасходов, "СтатьяРасходов");
		ПроверитьНеоднозначностьЗначения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки.СоответствиеНаправленийДеятельности,
			СписокНеоднозначностей, РезультатЗагрузки.ТаблицаНаправленийДеятельности, "НаправлениеДеятельности");
		ПроверитьНеоднозначностьЗначения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки.СоответствиеАналитикРасходов,
			СписокНеоднозначностей, РезультатЗагрузки.ТаблицаАналитикРасходов, "АналитикаРасходов");
		ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки, СтруктурыСоответствуют);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   СписокНеоднозначностей    - Массив из СправочникСсылка._ДемоНоменклатура - массив для заполнения с неоднозначными данными.
//   ИмяКолонки                - Строка - имя колонки, в который возникла неоднозначность.
//   ЗагружаемыеЗначенияСтрока - Строка - загружаемые данные на основании которых возникла неоднозначность.
//   ДополнительныеПараметры   - Произвольный - любые дополнительные сведения.
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "СтатьяРасходов" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиРасходов.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
		|ГДЕ
		|	СтатьиРасходов.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.СтатьяРасходов);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);  
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Подразделение" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтруктураПредприятия.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
			|ГДЕ
			|	СтруктураПредприятия.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "АналитикаРасходов" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Проекты.Ссылка
			|ИЗ
			|	Справочник.Проекты КАК Проекты
			|ГДЕ
			|	Проекты.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.АналитикаРасходов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "НаправлениеДеятельности" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НаправленияДеятельности.Ссылка
			|ИЗ
			|	Справочник.НаправленияДеятельности КАК НаправленияДеятельности
			|ГДЕ
			|	НаправленияДеятельности.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.НаправлениеДеятельности);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ПланРасходовНаПерсонал;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоПодразделению(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ЗагрузкаДанныхИзФайла

Функция ВыгрузитьКолонку(ЗагружаемыеДанные, ИмяКолонки)
	
	Таблица = ЗагружаемыеДанные.Скопировать();
	Таблица.Свернуть(ИмяКолонки);
	
	Возврат Таблица.ВыгрузитьКолонку(ИмяКолонки);

КонецФункции

Процедура ЗаполнитьПериодИзСтрокиВДату(НоваяСтрока, СоответствиеСтрокДатам, СтрокаПериод)
	
	Период = СоответствиеСтрокДатам.Получить(СтрокаПериод);
	
	Если Период = Неопределено Тогда
		Период = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаПериод);
		СоответствиеСтрокДатам.Вставить(СтрокаПериод, Период);
	КонецЕсли;
	
	НоваяСтрока.Период = Период;

КонецПроцедуры

Процедура ПроверитьНеоднозначностьЗначения(НоваяСтрока, СтрокаТаблицы, СоответствиеЗначений, СписокНеоднозначностей, ТаблицаЗагрузки, ИмяКолонки)
	
	НоваяСтрока[ИмяКолонки] = СоответствиеЗначений.Получить(СтрокаТаблицы[ИмяКолонки]);
	Если ЗначениеЗаполнено(НоваяСтрока[ИмяКолонки]) Тогда
		Возврат;
	КонецЕсли;
	Отбор = Новый Структура(ИмяКолонки, СтрокаТаблицы[ИмяКолонки]);
	Строки = ТаблицаЗагрузки.НайтиСтроки(Отбор);
	Если Строки.Количество() = 1 Тогда 
		НоваяСтрока[ИмяКолонки] = Строки[0].Ссылка;
		СоответствиеЗначений.Вставить(СтрокаТаблицы[ИмяКолонки], НоваяСтрока[ИмяКолонки]);
	ИначеЕсли Строки.Количество() > 1 Тогда
		ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
		ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
		ЗаписьОНеоднозначности.Колонка = ИмяКолонки;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки, СтруктурыСоответствуют)
	
	Если ПустаяСтрока(СтрокаТаблицы.КодПодразделения) Тогда
		Возврат;
	КонецЕсли;
	Если СтруктурыСоответствуют И Не ПустаяСтрока(СтрокаТаблицы.Организация) Тогда
		Отбор = Новый Структура("Организация, КодПодразделения", СтрокаТаблицы.Организация, СтрокаТаблицы.КодПодразделения);
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Получить(Отбор);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Строки = РезультатЗагрузки.ТаблицаОрганизацийКодыИсточников.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Вставить(Отбор, НоваяСтрока.Подразделение);
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	Иначе
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Получить(СтрокаТаблицы.КодПодразделения);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Отбор = Новый Структура("КодПодразделения", СтрокаТаблицы.КодПодразделения);
		Строки = РезультатЗагрузки.ТаблицаКодыПодразделений.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПроиндексированныйРезультат(РезультатЗагрузки, ТаблицаВыгрузки, ИмяТаблицы, Колонки)
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаВыгрузки, Колонки);
	РезультатЗагрузки.Вставить(ИмяТаблицы, ТаблицаВыгрузки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли