#Область ПрограммныйИнтерфейс

// См. ЗадачиБухгалтераКлиентПереопределяемый.ИзменитьОтборПоОсновнойОрганизации
//
Процедура ИзменитьОтборПоОсновнойОрганизации(Список, ИмяРеквизита, ЗначениеОтбора) Экспорт

	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Если ТипЗнч(ЗначениеОтбора) <> Тип("СправочникСсылка.Организации")
			И ТипЗнч(ЗначениеОтбора) <> Тип("Массив")
			И ТипЗнч(ЗначениеОтбора) <> Тип("СписокЗначений") Тогда
			ЗначениеОтбора = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Массив")
		ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
	Иначе
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	ИспользованиеОтбора = ЗначениеЗаполнено(ЗначениеОтбора);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяРеквизита, ЗначениеОтбора, ВидСравненияОтбора, , ИспользованиеОтбора, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиКлиентПереопределяемый.ОткрытьНастройкуНалоговОтчетов
//
Процедура ОткрытьНастройкуНалоговОтчетов(Организация, ИсточникПерехода, ТекущаяЗакладка = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		ПараметрыОткрытия.Вставить("Организация", Организация);
	КонецЕсли;
	ОткрытьСписокНалогиИОтчеты(ПараметрыОткрытия);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераКлиентПереопределяемый.ОткрытьСписокНалогиИОтчеты
//
Процедура ОткрытьСписокНалогиИОтчеты(ПараметрыОткрытия = Неопределено) Экспорт
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура;
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.НалогиИОтчетыБЗК", ПараметрыОткрытия);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераКлиентПереопределяемый.ОткрытьСписокЗадач
//
Процедура ОткрытьСписокЗадач() Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбновитьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ОткрыватьВНовойЗакладке", Истина);
	
	ОткрытьФорму("ОбщаяФорма.СписокЗадач", ПараметрыФормы);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиКлиентПереопределяемый.ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели
//
Процедура ЗаполнитьПояснениеДляДокументаСЭДОНаБоковойПанели(Форма, ПараметрыОтчета) Экспорт
	
	Элементы = Форма.Элементы;
	Если ТипЗнч(ПараметрыОтчета.Правило) = Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия") Тогда
		Элементы.ДекорацияПанельОтчетИнформация.Заголовок =
			НСтр("ru='Запрос СФР о предоставлении сведений, необходимых для назначения пособия.'");
		Элементы.ДекорацияПанельОтчетИнформация.Видимость = Истина;
	ИначеЕсли ТипЗнч(ПараметрыОтчета.Правило) = Тип("ДокументСсылка.ИзвещениеФСС") Тогда
		Элементы.ДекорацияПанельОтчетИнформация.Заголовок =
			НСтр("ru='Извещение СФР о необходимости предоставить недостающие сведения, по ранее отправленным документам.'");
		Элементы.ДекорацияПанельОтчетИнформация.Видимость = Истина;
	ИначеЕсли ТипЗнч(ПараметрыОтчета.Правило) = Тип("ДокументСсылка.ОтказВВозмещенииВыплатРодителямДетейИнвалидов") Тогда
		Элементы.ДекорацияПанельОтчетИнформация.Заголовок =
			НСтр("ru='Отказ СФР по заявлению о возмещении выплат родителям детей инвалидов.'");
		Элементы.ДекорацияПанельОтчетИнформация.Видимость = Истина;
	ИначеЕсли ТипЗнч(ПараметрыОтчета.Правило) = Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия") Тогда
		Элементы.ДекорацияПанельОтчетИнформация.Заголовок =
			НСтр("ru='Уведомление об изменении статуса выплаты пособия.'");
		Элементы.ДекорацияПанельОтчетИнформация.Видимость = Истина;
	Иначе
		Элементы.ДекорацияПанельОтчетИнформация.Видимость = Ложь;
	КонецЕсли;
	
	ЗаполнитьБоковуюПанельДляЗадачПодготовкиДанных(Форма, ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьБоковуюПанельДляЗадачПодготовкиДанных(Форма, ПараметрыОтчета)
	
	Элементы = Форма.Элементы;
	Статус = Форма.ПараметрыДействияСОтчетом.Статус;
	СтатусыОтчета = Форма.СтатусыОтчета;
	Если ПараметрыОтчета.ИдентификаторЗадачи = "Подготовка_Данных_НДФЛ_Взносы" Тогда
		Если Статус = СтатусыОтчета.Просрочено Или Статус = СтатусыОтчета.ВРаботе Тогда
			Элементы.КнопкаПанельОткрытьОтчет.Заголовок = НСтр("ru='Подготовить данные'");
		ИначеЕсли Статус = СтатусыОтчета.Подготовлено Тогда
			Элементы.КнопкаПанельОткрытьОтчет.Заголовок = НСтр("ru='Открыть данные'");
		КонецЕсли;
		Элементы.КнопкаПанельОтметитьСдано.Заголовок = НСтр("ru='Отметить подготовлено'");
		Элементы.КнопкаПанельОтметитьНеТребуется.Заголовок = НСтр("ru='Не требуется подготавливать'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти