// Для работы с элементами формы используются методы общих модулей, например, "НастройкиУчетаНДФЛФормы", "НастройкиУчетаНДСФормы" и пр.
// Эти же методы вызываются из форм записей соответствующих регистров сведений, поэтому состав их элементов должен соответствовать
// общей форме "НалогиИОтчеты".

#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	Если Параметры.КонтекстныйВызов Тогда
		Элементы.Организация.ТолькоПросмотр      = Истина;
		Элементы.Организация.РежимВыбораИзСписка = Ложь;
		Элементы.Организация.КнопкаВыбора        = Ложь;
	КонецЕсли;
	
	ДоступныеОрганизации = Новый Массив;
	КалендарьБухгалтераПереопределяемый.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации);
	УстановитьПараметрыВыбораОрганизации(ЭтотОбъект, ДоступныеОрганизации);
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация = Параметры.Организация;
	Иначе
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьСведенияОбОрганизации(ЭтотОбъект);
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	
	ДатаИзменения = НачалоГода(ТекущаяДата);
	
	ПравоРедактированияНастроек =
		ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НалогиОтчеты)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВариантыПримененияТребованийЗаконодательства)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиСистемыНалогообложения);
			
	
	ВедетсяУчетЗарплаты  = Истина;

	Если ВедетсяУчетЗарплаты Тогда
		ПравоРедактированияНастроек = ЭтотОбъект.ПравоРедактированияНастроек
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев)
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиУчетаСтраховыхВзносов);
	КонецЕсли;
	
	ПричинаНедоступностиЗагрузкиСпискаСтатФорм = "";
	ДоступнаЗагрузкаФормИзСервиса = ЗадачиБухгалтераСтатистикаВызовСервера.ДоступнаЗагрузкаФормИзСервиса(ПричинаНедоступностиЗагрузкиСпискаСтатФорм);
	
	ИдентификаторФормыВладельца = Параметры.ИдентификаторФормыВладельца;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		УстановитьДоступностьВидимостьНастроек(Ложь, ЭтотОбъект);
	Иначе
		Если ДоступныеОрганизации.Найти(Организация) = Неопределено Тогда
			ОрганизацияНедоступна = Истина;
			УстановитьДоступностьВидимостьНастроек(Ложь, ЭтотОбъект);
			Возврат;
		Иначе
			ПодготовитьФормуНастройкиСписка(ЭтотОбъект);
			ПодготовитьФормуНаСервере(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяЗакладка) Тогда
		НайденныеЗакладки = ЭтотОбъект.Список.НайтиСтроки(Новый Структура("Идентификатор", Параметры.ТекущаяЗакладка));
		Если НайденныеЗакладки.Количество() <> 0 Тогда
			Элементы.Список.ТекущаяСтрока = НайденныеЗакладки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформление(ЭтотОбъект.УсловноеОформление);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОрганизацияНедоступна Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		ЭтоВебКлиент = Истина;
	#КонецЕсли
	Если ЭтоВебКлиент Тогда
		Интервал = ?(ЭтоВебКлиент, 1, 0.5);
		ПодключитьОбработчикОжидания("Подключаемый_ЗаполнитьСписокНастройкиНалоговОтчетов", Интервал, Истина);
	Иначе
		ЗаполнитьСписокНастройкиНалоговОтчетов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И ЗавершениеРаботы Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	// Не задаем вопрос о сохранении для подчиненных форм:
	// - подчиненная форма может быть не видна на экране в момент закрытия, тогда пользователю будет не ясно о чем вопрос
	// - модифицированность может быть и основного окна, тогда будет два одинаковых вопроса.
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
	Если Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаОжидание Тогда
		ОтменитьПостроениеСписка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ИмяСобытияЗаписьРегистраНастроек = (ИмяСобытия = "Запись_ПрименяемыеТарифыСтраховыхВзносов"
		ИЛИ ИмяСобытия = "Запись_СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
		ИЛИ ИмяСобытия = "Запись_НастройкиУчетаСтраховыхВзносов");
		
	Если ИмяСобытияЗаписьРегистраНастроек Тогда
		
		ИмяРаздела = СтрЗаменить(ИмяСобытия, "Запись_","");
		Если Параметр.Свойство("Организация") Тогда
			Если Параметр.Организация <> Организация Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если Параметр.Свойство("ГоловнаяОрганизация") Тогда
			Если Параметр.ГоловнаяОрганизация <> ГоловнаяОрганизация Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если Параметр.Свойство("Период") Тогда
			ПараметрыВыбора = ПараметрыВыбораПериодаНастройки(
				Параметр.Период,
				ИмяРаздела);
			Если ПараметрыВыбора.НачалоПериода < ЭтотОбъект[ИмяРаздела].Период
				Или (ПараметрыВыбора.НачалоПериода > ЭтотОбъект[ИмяРаздела].Период
					И ПараметрыВыбора.НачалоПериода >= ЭтотОбъект.ТекущаяДата) Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела);
			
	ИначеЕсли ИмяСобытия = "Запись_Организации" Тогда
		
		// При записи новой организации необходимо добавить ее в список доступных организаций.
		ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник);
		
	ИначеЕсли ИмяСобытия = "ЗакрытьФормуНалогиИОтчеты" И ИдентификаторФормыВладельца = Параметр Тогда
		ЗакрытьФормуНалогиИОтчеты = Истина;
		СнятьБлокировкуСРегистраНалогиОтчеты(Организация, ИдентификаторФормыВладельца);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВНастройкиОрганизации" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Ключ", Организация);
		ОткрытьФорму("Справочник.Организации.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПередСменойОрганизации", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ПрочитатьНастройкиОрганизации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // Незачем очищать
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяРегистра = ИмяРегистра(ТекущийЭлемент.Имя);
	
	ПараметрыВыбора = ПараметрыВыбораПериодаНастройки(
		ДатаИзменения,
		ИмяРегистра);
	
	Если ПараметрыВыбора.ИмяФормы <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФорму(
			СтрШаблон("ОбщаяФорма.%1", ПараметрыВыбора.ИмяФормы),
			ПараметрыВыбора,
			ЭтотОбъект, , , ,
			Новый ОписаниеОповещения("ПериодЗавершениеВыбора", ЭтотОбъект, ИмяРегистра),
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИзмененияСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Список.ТекущиеДанные.Служебный Тогда
		Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура("Служебный", Ложь);
		ПолныйСписок = Истина;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Идентификатор = ТекущиеДанные.Идентификатор;
	ИмяСтраницы   = "Страница_" + Идентификатор;
	
	Если ТекущиеДанные.Выделен Тогда
		ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
		СтрокаСпискаПоИдентификатору = Список.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаСпискаПоИдентификатору.Выделен = Ложь;
	КонецЕсли;
	
	Если Элементы.Найти(ИмяСтраницы) = Неопределено Тогда
		Заголовок_ = ?(ЗначениеЗаполнено(ТекущиеДанные.ПолноеНаименование), ТекущиеДанные.ПолноеНаименование, ТекущиеДанные.Наименование);
		Если ТекущиеДанные.ЕстьПодстроки Тогда
			ТекущаяСтраница = Элементы.Страница_Таблица;
		Иначе
			ТекущаяСтраница = Элементы.Страница_Флажок;
			Флажок = ТекущиеДанные.Включен;
			Элементы.Флажок.ТолькоПросмотр = НЕ ТекущиеДанные.ВключаетсяПользователем;
		КонецЕсли;
		Элементы.СписокПодчиненный.ОтборСтрок = Новый ФиксированнаяСтруктура("Родитель", ТекущиеДанные.Ссылка);
	Иначе
		ТекущаяСтраница = Элементы[ИмяСтраницы];
	КонецЕсли;
	
	Элементы.СтраницыНастроек.ТекущаяСтраница = ТекущаяСтраница;
	
	Если ИмяСтраницы = "Страница_СтатистическаяОтчетность" Тогда
		Элементы.СписокФормыСтатистики.ОтборСтрок = Новый ФиксированнаяСтруктура("Родитель, Включен", ТекущиеДанные.Ссылка, Истина);
		НачатьПолучениеСпискаСтатФормИзСервиса();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если Элементы.СписокПодчиненный.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСтрока = ДополнительныеПараметры.ВыбраннаяСтрока;
	
	РезультатДетальнойНастройки = РезультатЗакрытия;
	
	Если ТипЗнч(РезультатДетальнойНастройки) = Тип("Массив") Тогда
		ОбработатьРезультатДетальнойНастройки(ВыбраннаяСтрока, РезультатДетальнойНастройки);
	КонецЕсли;
	
	Строка = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СохранитьСписокНастройкиНалоговОтчетов(Строка);
	ОповеститьОбИзмененииНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПодчиненный

&НаКлиенте
Процедура Список_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Лев(Строка(Поле.Имя), 18) = "ДетальнаяНастройка" Тогда
		
		Строка = СписокПодчиненный.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если Строка = Неопределено Или Не Строка.ЕстьДетальнаяНастройка Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		Если Строка.Ключ <> "" Тогда
			Родитель = Список.НайтиСтроки(Новый Структура("Ссылка", Строка.Родитель));
			ПредметНастройки = Строка.Ключ;
			НалогОтчет = Родитель[0].Наименование + " (" + Строка.Наименование + ")";
		Иначе
			ПредметНастройки = Строка.Ссылка;
			НалогОтчет       = Строка.Родитель;
		КонецЕсли;
		ПараметрыФормы.Вставить("ПредметНастройки",                 ПредметНастройки);
		ПараметрыФормы.Вставить("НалогОтчет",                       НалогОтчет);
		ПараметрыФормы.Вставить("АдресЗначенияДетальнойНастройки",  АдресЗначенияДетальнойНастройки);
		ПараметрыФормы.Вставить("АдресПараметрыДетальнойНастройки", АдресПараметрыДетальнойНастройки);
		ПараметрыФормы.Вставить("ТолькоПросмотр",                   Элементы.СписокПодчиненный.ТолькоПросмотр);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ВыбраннаяСтрока",   ВыбраннаяСтрока);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("СписокВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("РегистрСведений.НалогиОтчеты.Форма.ДетальнаяНастройка", ПараметрыФормы,,,,,ОповещениеОЗакрытии);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодчиненныйВключенПриИзменении(Элемент)
	
	Строка = СписокПодчиненный.НайтиПоИдентификатору(Элементы.СписокПодчиненный.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Включен = Ложь;
	
	ОтборСтрок = Новый Структура("Родитель, Включен", Строка.Родитель, Истина);
	Строки = СписокПодчиненный.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		Включен = Истина
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Ссылка", Строка.Родитель);
	Строки = Список.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		Строки[0].Включен = Включен;
		СохранитьСписокНастройкиНалоговОтчетов(Строки[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовПанелей

#Область ОбработчикиПанели_СтраховыеВзносы

&НаКлиенте
Процедура СтраховыеВзносыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	ОтобразитьПериоды("СтраховыеВзносы");
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОтобразитьПериоды("СтраховыеВзносы");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчетаСтраховыхВзносовПриИзменении(Элемент)
	
	Если НЕ НастройкиУчетаСтраховыхВзносов.ИспользуютсяРаботыСДосрочнойПенсией Тогда
		НастройкиУчетаСтраховыхВзносов.ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда = Ложь;
	КонецЕсли;
	
	ЗаписатьИзмененияНепосредственно("НастройкиУчетаСтраховыхВзносов");
	ОбработатьИзменениеДополнительныеСтраховыеВзносы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаПрименяютсяЛьготныеТарифыВПодразделенияхНажатие(Элемент)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("РедактированиеЛьготныхТарифовЗавершение", ЭтотОбъект);
	СтруктураОтбор = Новый Структура("ГоловнаяОрганизация", ГоловнаяОрганизация);
	
	ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбор);
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(НастройкиКомпоновки.Отбор,
		"ПрименяемыйЛьготныйТерриториальныйТариф", 
		ВидСравненияКомпоновкиДанных.НеРавно, 
		ПредопределенноеЗначение("Справочник.ВидыТарифовСтраховыхВзносов.ПустаяСсылка"));
	ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиКомпоновки);

	ОткрытьФорму("Справочник.ПодразделенияОрганизаций.ФормаСписка", ПараметрыОткрытия, ЭтаФорма, , , , ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаДолжностиНажатие(Элемент)
	
	ОткрытьФорму("Справочник.Должности.ФормаСписка", Новый Структура("РежимВыбора", Ложь), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПанели_СтатистическаяОтчетность

&НаКлиенте
Процедура СписокФормыСтатистикиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ОповещениеПослеВыбора = Новый ОписаниеОповещения("СписокФормыСтатистикиПослеВыбора", ЭтотОбъект);
	АдресОписанияТаблицы = АдресОписанияВыбораФормСтатистики();
	
	СтруктураПараметров = Новый Структура("ОписаниеТаблицы", АдресОписанияТаблицы);
	СтруктураПараметров.Вставить("СтруктураДляПоиска", Новый Структура("Колонка1"));
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЗначенийИзТаблицыБРО", СтруктураПараметров, ЭтотОбъект,,,, ОповещениеПослеВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФормыСтатистикиПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Строка = СписокПодчиненный.НайтиПоИдентификатору(Элементы.СписокФормыСтатистики.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Включен = Ложь;
	Строка.ОтключенПользователем = ДоступнаЗагрузкаФормИзСервиса;
	Строка.ДобавленПользователем = Ложь;
	
	ОтборСтрок = Новый Структура("Родитель, Включен", Строка.Родитель, Истина);
	Строки = СписокПодчиненный.НайтиСтроки(ОтборСтрок);
	Включен = (Строки.Количество() > 0);
	
	ОтборСтрок = Новый Структура("Ссылка", Строка.Родитель);
	Строки = Список.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		Строки[0].Включен = Включен;
		СохранитьСписокНастройкиНалоговОтчетов(Строки[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПоДаннымРосстата(Команда)
	
	СтрокаЗадачи = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Отбор = Новый Структура("Родитель", СтрокаЗадачи.Ссылка);
	ЕстьИзменения = Ложь;
	
	Строки = СписокПодчиненный.НайтиСтроки(Отбор);
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.ПолученИзВнешнегоСервиса И Не Строка.Включен Тогда
			Строка.Включен = Истина;
			Строка.ОтключенПользователем = Ложь;
			Строка.ДобавленПользователем = Ложь;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
		Если Не Строка.ПолученИзВнешнегоСервиса И Строка.Включен Тогда
			Строка.Включен = Ложь;
			Строка.ОтключенПользователем = Ложь;
			Строка.ДобавленПользователем = Ложь;
			ЕстьИзменения = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ОтборСтрок = Новый Структура("Родитель, Включен", СтрокаЗадачи.Ссылка, Истина);
	Строки = СписокПодчиненный.НайтиСтроки(ОтборСтрок);
	СтрокаЗадачи.Включен = (Строки.Количество() > 0);
	
	Если ЕстьИзменения Тогда
		СохранитьСписокНастройкиНалоговОтчетов(СтрокаЗадачи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстБаннера_СтатистическаяОтчетностьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	Если НавигационнаяСсылкаФорматированнойСтроки = "ПодключитьИнтернетПоддержку" Тогда
		СтандартнаяОбработка = Ложь;
		ОповещениеПослеПодключения = Новый ОписаниеОповещения("ПослеПодключенияИнтернетПоддержки", ЭтотОбъект);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОповещениеПослеПодключения, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиВспомогательныхПанелей_Таблица_Флажок

&НаКлиенте
Процедура ФлажокПриИзменении(Элемент)
	
	Строка = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Строка.Включен = Флажок;
	
	СохранитьСписокНастройкиНалоговОтчетов(Строка);
	ОповеститьОбИзмененииНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеВключить(Команда)
	
	Строка = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Родитель", Строка.Ссылка);
	ПодчиненныеСтроки = СписокПодчиненный.НайтиСтроки(ОтборСтрок);
	Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		ПодчиненнаяСтрока.Включен = Истина;
	КонецЦикла;
	
	Строка = СписокПодчиненный.НайтиПоИдентификатору(Элементы.СписокПодчиненный.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Ссылка", Строка.Родитель);
	Строки = Список.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		Строки[0].Включен = Истина;
		СохранитьСписокНастройкиНалоговОтчетов(Строки[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеВыключить(Команда)
	
	Строка = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Родитель", Строка.Ссылка);
	ПодчиненныеСтроки = СписокПодчиненный.НайтиСтроки(ОтборСтрок);
	Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
		ПодчиненнаяСтрока.Включен = Ложь;
	КонецЦикла;
	
	Строка = СписокПодчиненный.НайтиПоИдентификатору(Элементы.СписокПодчиненный.ТекущаяСтрока);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура("Ссылка", Строка.Родитель);
	Строки = Список.НайтиСтроки(ОтборСтрок);
	Если Строки.Количество() > 0 Тогда
		Строки[0].Включен = Ложь;
		СохранитьСписокНастройкиНалоговОтчетов(Строки[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПанели_НДФЛ

&НаКлиенте
Процедура УчетнаяПолитикаПоНДФЛПриИзменении(Элемент)
	
	ЗаписатьИзмененияНепосредственно("УчетнаяПолитикаПоНДФЛ");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ИмяРегистра = ИмяРегистра(ТекущийЭлемент.Имя);
	Отбор = Новый Структура("Организация", Организация);
	Если ИмяРегистра = "СтраховыеВзносы" Тогда
		Отбор.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
		ОткрытьФорму("РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов.ФормаСписка", Новый Структура("Отбор, ВедущийОбъект, ТекущийПериод", Отбор, Организация, ТекущаяДата));
	Иначе
		ОткрытьФорму(СтрШаблон("РегистрСведений.%1.Форма.ФормаСписка", ИмяРегистра), Новый Структура("Отбор, ВедущийОбъект, ТекущийПериод", Отбор, Организация, ТекущаяДата));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура _ОК(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(ТекущийЭлемент.Имя, "ОК_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРегистра = ИмяРегистра(ТекущийЭлемент.Имя);
	
	ЗаписатьИзменения(ИмяРегистра);
	ОповеститьОбИзмененииНастроек(Истина);
	ОтобразитьИсторию(ИмяРегистра);
	
	Активизировать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЧтениеНастроекУчета

&НаКлиенте
Процедура Подключаемый_ЗаполнитьСписокНастройкиНалоговОтчетов()
	
	ЗаполнитьСписокНастройкиНалоговОтчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокНастройкиНалоговОтчетов()
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияПриОткрытии");
	
	Результат = ВыполнитьПолучениеДанныхНаСервере();
	
	Если Не Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища       = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияПриОткрытии", 0.5, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	Иначе
		ЗагрузитьРезультат();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьНастройкиОрганизации()
	
	ОткрытьСтраницуДлительнойОперации();

	ОрганизацияПриИзмененииНаСервере();
	
	Если Не ПустаяСтрока(РезультатБлокировки) Тогда
		ПоказатьПредупреждение( , РезультатБлокировки);
		РезультатБлокировки = "";
	Иначе
		Интервал = ?(ЭтоВебКлиент, 0.5, 0.1);
		ПодключитьОбработчикОжидания("Подключаемый_ЗаполнитьСписокНастройкиНалоговОтчетов", Интервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьУчетнуюПолитику(Форма)
	
	Если Форма.ВедетсяУчетЗарплаты Тогда
		МенеджерЗаписиПериодическогоРегистра("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", Форма.Организация,,,,Форма);
		МенеджерЗаписиПериодическогоРегистра("ПрименяемыеТарифыСтраховыхВзносов", Форма.ГоловнаяОрганизация, "ГоловнаяОрганизация",,,Форма);
		МенеджерЗаписиРегистра("НастройкиУчетаСтраховыхВзносов", Форма.Организация, Форма);
		МенеджерЗаписиРегистра("УчетнаяПолитикаПоНДФЛ", Форма.ГоловнаяОрганизация, Форма, "ГоловнаяОрганизация");
	КонецЕсли;
	
	ЗаполнитьСвязанныеРеквизиты(Форма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьИспользуемыеНастройки(Форма)
	
	// Поверхностное чтение, только чтобы узнать, что отображать
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Форма.Организация);
	Запрос.УстановитьПараметр("ТекущаяДата", Форма.ТекущаяДата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиОтчеты.НалогОтчет КАК Ссылка,
	|	НалогиОтчеты.НалогОтчет.Код КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_НалогиОтчеты
	|ИЗ
	|	РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
	|ГДЕ
	|	НалогиОтчеты.Организация = &Организация
	|	И НалогиОтчеты.НалогОтчет ССЫЛКА Справочник.ЗадачиБухгалтера
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НалогиОтчеты.НалогОтчет.Владелец,
	|	НалогиОтчеты.НалогОтчет.Владелец.Код
	|ИЗ
	|	РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
	|ГДЕ
	|	НалогиОтчеты.Организация = &Организация
	|	И НалогиОтчеты.НалогОтчет ССЫЛКА Справочник.ПравилаПредставленияОтчетовУплатыНалогов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачиБухгалтера.Код КАК Код,
	|	ЗадачиБухгалтера.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	НЕ ЗадачиБухгалтера.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_НалогиОтчеты.Ссылка
	|				ИЗ
	|					ВТ_НалогиОтчеты)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВариантыПримененияТребованийЗаконодательства.Организация КАК Организация,
	|	ВариантыПримененияТребованийЗаконодательства.Условие КАК Условие
	|ПОМЕСТИТЬ ВТ_Условия
	|ИЗ
	|	РегистрСведений.ВариантыПримененияТребованийЗаконодательства КАК ВариантыПримененияТребованийЗаконодательства
	|ГДЕ
	|	ВариантыПримененияТребованийЗаконодательства.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Ссылка КАК Правило,
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Условие КАК Условие
	|ПОМЕСТИТЬ ВТ_ПравилаУсловия
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК ПравилаПредставленияОтчетовУплатыНалоговУсловия
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалоговУсловия.Условие В
	|			(ВЫБРАТЬ
	|				ВТ_Условия.Условие КАК ВТ_Условия
	|			ИЗ
	|				ВТ_Условия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗадачиБухгалтера.Правило КАК Правило
	|ПОМЕСТИТЬ ВТ_Правила
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация = &Организация
	|	И ЗадачиБухгалтера.Правило ССЫЛКА Справочник.ПравилаПредставленияОтчетовУплатыНалогов
	|	И ЗадачиБухгалтера.Правило.Владелец В
	|			(ВЫБРАТЬ
	|				ВТ_Задачи.Ссылка
	|			ИЗ
	|				ВТ_Задачи)
	|	И ЗадачиБухгалтера.Правило В
	|			(ВЫБРАТЬ
	|				ВТ_ПравилаУсловия.Правило КАК ВТ_ПравилаУсловия
	|			ИЗ
	|				ВТ_ПравилаУсловия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиБухгалтера.Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Задачи.Код КАК Идентификатор,
	|	ВТ_Задачи.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_СписокЗадач
	|ИЗ
	|	ВТ_Правила КАК ВТ_Правила
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Задачи КАК ВТ_Задачи
	|		ПО ВТ_Правила.Правило.Владелец = ВТ_Задачи.Ссылка
	|ГДЕ
	|	(ГОД(ВТ_Правила.Правило.КонецДействия) >= ГОД(&ТекущаяДата)
	|			ИЛИ ВТ_Правила.Правило.КонецДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_НалогиОтчеты.Ссылка КАК Ссылка,
	|	ВТ_НалогиОтчеты.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_СписокНалоговОтчетов
	|ИЗ
	|	ВТ_НалогиОтчеты КАК ВТ_НалогиОтчеты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СписокЗадач.Ссылка,
	|	ВТ_СписокЗадач.Идентификатор
	|ИЗ
	|	ВТ_СписокЗадач КАК ВТ_СписокЗадач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_СписокНалоговОтчетов.Ссылка КАК Ссылка,
	|	ВТ_СписокНалоговОтчетов.Идентификатор КАК Идентификатор
	|ИЗ
	|	ВТ_СписокНалоговОтчетов КАК ВТ_СписокНалоговОтчетов";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивСтрок = Форма.Список.НайтиСтроки(Новый Структура("Идентификатор", Выборка.Идентификатор));
		Если МассивСтрок.Количество() <> 0 Тогда
			МассивСтрок[0].Ссылка                  = Выборка.Ссылка;
			Если НЕ МассивСтрок[0].Включен Тогда
				МассивСтрок[0].Включен = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СохранениеРезультатовРаботы

&НаКлиенте
Процедура ВопросПередСменойОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПрочитатьНастройкиОрганизации();
		УстановитьДоступностьСписка();
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			ИмяРаздела = Элементы.Список.ТекущиеДанные.Идентификатор;
			ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела);
		КонецЕсли;
		
		ОповеститьОбИзмененииНастроек(Истина);
		Модифицированность = Ложь;
		ПрочитатьНастройкиОрганизации();
		УстановитьДоступностьСписка();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Модифицированность = Ложь;
		Закрыть();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
			ИмяРаздела = Элементы.Список.ТекущиеДанные.Идентификатор;
			ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела);
		КонецЕсли;
		
		Модифицированность = Ложь;
		ОповеститьОбИзмененииНастроек(Истина);
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСписокНастройкиНалоговОтчетов(Настройка)
	
	СтруктураНастройки = Новый Структура("Наименование,Включен,
		|Ссылка,ВключаетсяПользователем,Ключ,Идентификатор,Служебный,
		|ЕстьПодстроки,Порядок,БылВключен,Недоступен");
		
	ЗаполнитьЗначенияСвойств(СтруктураНастройки, Настройка);
	
	ВыполнитьЗаписьДанныхНаСервере(СтруктураНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеДополнительныеСтраховыеВзносы()
	
	ОтобразитьРеквизитыЗависимыеОтТекущихНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения(ИмяРегистра)

	Если ИмяРегистра = "СтраховыеВзносы" Тогда
		Если ДатаИзменения = ПрименяемыеТарифыСтраховыхВзносов.Период Тогда
			МенеджерЗаписи = РеквизитФормыВЗначение("ПрименяемыеТарифыСтраховыхВзносов");
			Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.ДатаРегистрацииИзменений) Тогда
				МенеджерЗаписи.ДатаРегистрацииИзменений = МенеджерЗаписи.Период;
			КонецЕсли;
		Иначе
			МенеджерЗаписи = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПрименяемыеТарифыСтраховыхВзносов,,"Период");
			МенеджерЗаписи.Период = ДатаИзменения;
			МенеджерЗаписи.ДатаРегистрацииИзменений = НачалоМесяца(ДатаИзменения);
		КонецЕсли;
		МенеджерЗаписи.Записать(Истина);
		
		Если ДатаИзменения = СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период Тогда
			МенеджерЗаписи = РеквизитФормыВЗначение("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев");
		Иначе
			МенеджерЗаписи = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев,,"Период");
			МенеджерЗаписи.Период = ДатаИзменения;
		КонецЕсли;
		МенеджерЗаписи.Записать(Истина);
	Иначе
		ПараметрыВыбора = ПараметрыВыбораПериодаНастройки(ДатаИзменения, ИмяРегистра);
		Если ПараметрыВыбора.НачалоПериода = ЭтотОбъект[ИмяРегистра].Период Тогда
			МенеджерЗаписи = РеквизитФормыВЗначение(ИмяРегистра);
		Иначе
			МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЭтотОбъект[ИмяРегистра],,"Период");
			МенеджерЗаписи.Период = ПараметрыВыбора.НачалоПериода;
		КонецЕсли;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Если ДатаИзменения <= ТекущаяДата Тогда
		ПеречитатьНастройкиНаТекущуюДату(ИмяРегистра);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзмененияРазделаНаКлиенте(ИмяРаздела)

	ЗаписатьИзмененияРазделаНаСервере(ИмяРаздела);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияРазделаНаСервере(ИмяРаздела)
	
	Если ИмяРаздела = "СтраховыеВзносы" Тогда
		ИмяРегистра = "СтраховыеВзносы";
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаписатьИзменения(ИмяРегистра);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНепосредственно(ИмяРегистра)
	
	МенеджерЗаписи = РеквизитФормыВЗначение(ИмяРегистра);
	МенеджерЗаписи.Записать(Истина);
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеЛьготныхТарифовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ВедетсяУчетЗарплаты И ПравоРедактированияНастроек Тогда
		РедактированиеЛьготныхТарифовЗавершениеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РедактированиеЛьготныхТарифовЗавершениеНаСервере()
	
	МенеджерЗаписиРегистра("НастройкиУчетаСтраховыхВзносов", Организация, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МенеджерЗаписиРегистра(ИмяРегистра, ЗначениеОтбора, Форма, ИмяОтбора = "Организация")
	
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МенеджерЗаписи[ИмяОтбора] = ЗначениеОтбора;
	МенеджерЗаписи.Прочитать();
	Если Не МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи[ИмяОтбора] = ЗначениеОтбора;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, ИмяРегистра);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура МенеджерЗаписиПериодическогоРегистра(ИмяРегистра, ЗначениеОтбора, ИмяОтбора = "Организация", ПериодЗначений = Неопределено, Создавать = Истина, Форма) Экспорт
	
	Если ПериодЗначений = Неопределено Тогда
		ПериодЗначений = Форма.ТекущаяДата;
	КонецЕсли;
	
	КлючЗаписи = КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, ИмяОтбора, ЗначениеОтбора, ПериодЗначений);
	Если КлючЗаписи = Неопределено Тогда
		
		Если НЕ Форма.ПравоРедактированияНастроек Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ Создавать Тогда
			Возврат;
		КонецЕсли;
		
		Форма[ИмяРегистра].Период      = НачалоГода(Форма.ТекущаяДата);
		Форма[ИмяРегистра][ИмяОтбора]  = ЗначениеОтбора;
		МенеджерЗаписи = Форма.РеквизитФормыВЗначение(ИмяРегистра);
		МенеджерЗаписи.Записать(Истина);
	Иначе
		МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
		МенеджерЗаписи[ИмяОтбора] = КлючЗаписи[ИмяОтбора];
		МенеджерЗаписи.Период     = КлючЗаписи.Период;
		МенеджерЗаписи.Прочитать();
	КонецЕсли;
	Форма.ЗначениеВРеквизитФормы(МенеджерЗаписи, ИмяРегистра);
	
КонецПроцедуры

#КонецОбласти

#Область ДлительныеОперации

&НаКлиенте
Процедура ОткрытьСтраницуДлительнойОперации()
	
	Если ЭтоВебКлиент Тогда
		Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаОжидание;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПолучениеДанныхНаСервере()
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация",   Организация);
	ПараметрыЗаполнения.Вставить("Дерево",        СформироватьДеревоНастроек());
	ПараметрыЗаполнения.Вставить("ТекущийПериод", ТекущаяДата);
	ПараметрыЗаполнения.Вставить("ТолькоОтчеты",  Истина);
	
	НаименованиеЗадания = НСтр("ru = 'Настройка списка налогов и отчетов: получение данных'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"РегистрыСведений.НалогиОтчеты.ПодготовитьДанные", 
			ПараметрыЗаполнения, 
			НаименованиеЗадания);
			
	АдресХранилища = Результат.АдресХранилища;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияПриОткрытии()
	
	Попытка
		Если НЕ ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
			Возврат;
		КонецЕсли;
		Если ТипЗнч(ФормаДлительнойОперации) = Тип("ФормаКлиентскогоПриложения") Тогда
			Если ФормаДлительнойОперации.Открыта() 
				И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
				Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
					ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
					ЗагрузитьРезультат();
				Иначе
					ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
					ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗаданияПриОткрытии", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				ЗагрузитьРезультат();
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗаданияПриОткрытии", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияПриЗаписи()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				Модифицированность = Ложь;
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗаданияПриЗаписи", 
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗагрузитьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьРезультат();
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультат()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ЗагрузитьПодчиненныеСтроки(Результат.Дерево, ЭтотОбъект);
		
		АдресПараметрыДетальнойНастройки = ПоместитьВоВременноеХранилище(Результат.ПараметрыДетальнойНастройки, УникальныйИдентификатор);
		АдресЗначенияДетальнойНастройки  = ПоместитьВоВременноеХранилище(Результат.ЗначенияДетальнойНастройки, УникальныйИдентификатор);
		
		УстановитьДоступностьВидимостьНастроек(Истина, ЭтотОбъект);
		НастроитьЭлементыСостоянияЗагрузкиСтатистическихОтчетов(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПостроениеСписка()
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		
		МассивИдентификаторов = Новый Массив();
		МассивИдентификаторов.Добавить(ИдентификаторЗадания);
		ОтменитьВыполнениеЗаданий(МассивИдентификаторов);
		
	КонецЕсли;

	ИдентификаторЗадания = Неопределено;
	
	ЭтотОбъект.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьВыполнениеЗаданий(Знач МассивИдентификаторовЗаданий)

	Для Каждого ИдентификаторЗадания Из МассивИдентификаторовЗаданий Цикл
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьДеревоНастроек()
	
	МассивТиповЗадач = Новый Массив;
	МассивТиповЗадач.Добавить(Тип("СправочникСсылка.ЗадачиБухгалтера"));
	МассивТиповЗадач.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
	МассивТиповЗадач.Добавить(Тип("СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов"));
	
	МассивТиповРегистраций = Новый Массив;
	МассивТиповРегистраций.Добавить(Тип("СправочникСсылка.РегистрацииВНалоговомОргане"));
	
	ДеревоЗадач = Новый ДеревоЗначений;
	ДеревоЗадач.Колонки.Добавить("Наименование",                    ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДеревоЗадач.Колонки.Добавить("Включен",                         Новый ОписаниеТипов("Булево")); // задача или правило применяется
	ДеревоЗадач.Колонки.Добавить("ПолученИзВнешнегоСервиса",        Новый ОписаниеТипов("Булево")); // требуется по данным внешнего сервиса
	ДеревоЗадач.Колонки.Добавить("ОтключенПользователем",           Новый ОписаниеТипов("Булево")); // принудительно отключен пользователем
	ДеревоЗадач.Колонки.Добавить("ДобавленПользователем",           Новый ОписаниеТипов("Булево")); // расчетный показатель для отображения на форме
	ДеревоЗадач.Колонки.Добавить("ДетальнаяНастройкаПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДеревоЗадач.Колонки.Добавить("Ссылка",                          Новый ОписаниеТипов(Справочники.ПравилаПредставленияОтчетовУплатыНалогов.ОписаниеТипаУсловияПримененияТребованияЗаконодательства(), МассивТиповЗадач));
	ДеревоЗадач.Колонки.Добавить("РегистрацияВНалоговомОргане",     Новый ОписаниеТипов(МассивТиповРегистраций));
	ДеревоЗадач.Колонки.Добавить("ВключаетсяПользователем",         Новый ОписаниеТипов("Булево"));
	ДеревоЗадач.Колонки.Добавить("ЕстьДетальнаяНастройка",          Новый ОписаниеТипов("Булево"));
	ДеревоЗадач.Колонки.Добавить("НалогУплачиваетсяНаМестах",       Новый ОписаниеТипов("Булево"));
	ДеревоЗадач.Колонки.Добавить("Ключ",                            ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДеревоЗадач.Колонки.Добавить("Идентификатор",                   ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ДеревоЗадач.Колонки.Добавить("Порядок",                         ОбщегоНазначения.ОписаниеТипаЧисло(5));
	
	Возврат ДеревоЗадач;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьПодчиненныеСтроки(Дерево, Форма)
	
	Форма.СписокПодчиненный.Очистить();
	
	СкрытыеОтчеты        = 0;
	
	Для Каждого Строка Из Дерево.Строки Цикл
		Родитель             = Строка.Ссылка;
		ПодчиненныеСтроки    = Строка.Строки;
		Идентификатор        = Строка.Идентификатор;
		ЕстьПодстроки        = Ложь;
		Для Каждого ПодчиненнаяСтрока Из ПодчиненныеСтроки Цикл
			НоваяСтрока = Форма.СписокПодчиненный.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПодчиненнаяСтрока);
			НоваяСтрока.Родитель      = Родитель;
			НоваяСтрока.Идентификатор = Идентификатор;
			НоваяСтрока.ДобавленПользователем = НоваяСтрока.Включен И Не НоваяСтрока.ПолученИзВнешнегоСервиса;
			ЕстьПодстроки             = Истина;
			Если НЕ ПодчиненнаяСтрока.Включен Тогда
				СкрытыеОтчеты = СкрытыеОтчеты + 1;
			КонецЕсли;
		КонецЦикла;
		
		МассивСтрок = Форма.Список.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор));
		Если МассивСтрок.Количество() <> 0 Тогда
			МассивСтрок[0].ЕстьПодстроки           = ЕстьПодстроки;
			МассивСтрок[0].Ссылка                  = Строка.Ссылка;
			МассивСтрок[0].Ключ                    = Строка.Ключ;
			МассивСтрок[0].ВключаетсяПользователем = Строка.ВключаетсяПользователем;
			Если НЕ МассивСтрок[0].Включен Тогда
				МассивСтрок[0].Включен = Строка.Включен;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ПолныйСписок = СкрытыеОтчеты = 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОтрисовкаФормы

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма, ИмяРаздела = Неопределено)
	
	Элементы = Форма.Элементы;
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "СтраховыеВзносы" Тогда
		Элементы.СтраницыСтраховыеВзносыИстория.Видимость                            = Истина;
		Элементы.Группа_ПрименяемыеТарифыСтраховыхВзносов_НастройкиУчета.Видимость   = Истина;
		Элементы.ГруппаСтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Видимость        = Истина;
		Элементы.ГруппаНастройкиУчетаСтраховыхВзносов.Видимость                      = Истина;
		Элементы.ВидТарифа.ТолькоПросмотр                                            = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы(ИмяРаздела = Неопределено)
	
	УправлениеФормой(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПериоды(ИмяРаздела)
	
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Изменение"];
	
	УстановитьДоступностьСписка();
	
	УстановитьВидимостьЭлементовФормы(ИмяРаздела);
	
	ИмяЭлемента = СтрШаблон("ДатаИзмененияЧислом_%1", ИмяРаздела);
	Если Элементы.Найти(ИмяЭлемента) <> Неопределено И Элементы[ИмяЭлемента].Видимость Тогда
		ДатаИзменения = Дата(ДатаИзмененияЧислом, 1, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИсторию(ИмяРаздела)
	
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Периоды"];
	
	Модифицированность = Ложь;
	УстановитьДоступностьСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИзмененияИстории(Команда)
	
	Если СтрНайти(ТекущийЭлемент.Имя, "Отменить_") = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРаздела = ИмяРегистра(ТекущийЭлемент.Имя);
	Элементы["Страницы" + ИмяРаздела + "История"].ТекущаяСтраница = Элементы["Страница" + ИмяРаздела + "Периоды"];
	
	Модифицированность = Ложь;
	УстановитьДоступностьСписка();
	
	ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьСписка()
	
	СписокНедоступность         = Модифицированность;
	Элементы.Список.Доступность = НЕ СписокНедоступность;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьУсловноеОформление(УсловноеОформление)
	
	УсловноеОформление.Элементы.Очистить();
	
	//Оформление таблицы Список
	
	// ВсеОтчеты
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Наименование");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Служебный", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Действие");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Служебный", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Истина);
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Действие");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Служебный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Все настройки
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Наименование");
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Действие");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Список.Выделен", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ВажнаяНадписьШрифт);
	
	//Оформление таблицы СписокПодчиненный
	
	// ДетальнаяНастройкаПредставление
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДетальнаяНастройка_СписокПодчиненный");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СписокПодчиненный.ЕстьДетальнаяНастройка", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Редактирование
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Наименование");
	ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Действие");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"СписокНедоступность", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНастройкиСписка(Форма)
	
	Форма.Модифицированность = Ложь;
	Элементы = Форма.Элементы;
	
	Если Не ЗначениеЗаполнено(Форма.Организация) Тогда
		Элементы.Список.ТолькоПросмотр            = Истина;
		Элементы.СписокПодчиненный.ТолькоПросмотр = Истина;
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Форма.ПравоРедактированияНастроек Тогда
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Истина;
		Элементы.СписокПодчиненный.ТолькоПросмотр = Истина;
	Иначе
	
		Элементы.Список.ТолькоПросмотр            = Ложь;
		Элементы.СписокПодчиненный.ТолькоПросмотр = Ложь;
		Элементы.СтраницыНастроек.ТолькоПросмотр  = Ложь;
		
		// Так как изменяем данные разных записей в одной форме, 
		// то наложим пессимистическую объектную блокировку вручную - 
		// по специальному набору измерений, который никогда не будет записан в регистр.
		
		Форма.РезультатБлокировки = "";
		Попытка 
			ОписаниеКлюча = Новый Структура("Организация", Форма.Организация);
			УИД = Форма.УникальныйИдентификатор;
			// В Простом интерфейсе форма является подчиненной окну Организация и при обновлении интерфейса
			// может быть переоткрыта. При этом УникальныйИдентификатор формы меняется, но при закрытии формы
			// блокировка может быть отменена не сразу, что приводит к ошибке блокировки, поэтому используем 
			// идентификатор родительской формы
			Если Форма.ИнтерфейсТаксиПростой И ЗначениеЗаполнено(Форма.ИдентификаторФормыВладельца) Тогда
				УИД = Форма.ИдентификаторФормыВладельца;
			КонецЕсли;
			ЗаблокироватьДанныеДляРедактирования(
				РегистрыСведений.НалогиОтчеты.СоздатьКлючЗаписи(ОписаниеКлюча),
				, // Данные не хранятся в ИБ
				УИД); 
		Исключение
			Элементы.СтраницыНастроек.ТолькоПросмотр = Истина;
			РезультатБлокировки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьФормуНаСервере(Форма)
	
	ЭтоОбособленноеПодразделение = Форма.ГоловнаяОрганизация <> Форма.Организация;
	Форма.ТолькоПросмотр = ЭтоОбособленноеПодразделение;
	Форма.Элементы.ГруппаНастройкиУчетаСтраховыхВзносовДетальная.ТолькоПросмотр = ЭтоОбособленноеПодразделение;
	
	ПрочитатьИОписатьНастройкиУчета(Форма);
	
	ЗаполнитьЗначенияСвойств(Форма, ПредставленияДатыИзменения(Форма.ДатаИзменения, "НастройкиСистемыНалогообложения"));
	
	Форма.Элементы.СтраницыСтраховыеВзносыИстория.ТекущаяСтраница = Форма.Элементы.СтраницаСтраховыеВзносыПериоды;
	Форма.ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Организация, "ГоловнаяОрганизация");
	
	ОтобразитьРеквизитыЗависимыеОтТекущихНастроек(Форма);
	
	УправлениеФормой(Форма, Неопределено);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьЭлементыСостоянияЗагрузкиСтатистическихОтчетов(Форма)
	
	Элементы = Форма.Элементы;

	Элементы.ГруппаБаннер_СтатистическаяОтчетность_Страницы.ТекущаяСтраница = Элементы.ГруппаБаннер_СтатистическаяОтчетность_СтраницаБаннер;
	Элементы.СписокФормыСтатистики.Доступность = Истина;
	Элементы.ВключенПользователем_СписокФормыСтатистики.Видимость = Форма.ДоступнаЗагрузкаФормИзСервиса;
	
	ИдентификаторСтатистика = ЗадачиБухгалтераКлиентСервер.КодЗадачиСтатистика();
	ДатаЗагрузкиФормСтатистики = ЗадачиБухгалтераСтатистикаВызовСервера.ДатаПоследнейЗагрузкиСпискаФормСтатистики();
	Элементы.ВосстановитьПоДаннымРосстата.Видимость = Ложь;
	Элементы.Заголовок_ДатаАктуальности.Видимость = Ложь;
	
	ТекстБаннераСтатистическаяОтчетность = Новый Массив;
	ТекстБаннераСтатистическаяОтчетностьСостояние = Новый Массив;
	
	АдресИнтерактивногоСервисаРосстата = ЗадачиБухгалтераСтатистикаВызовСервера.АдресИнтерактивногоСервисаРосстата();
	
	Если Форма.ДоступнаЗагрузкаФормИзСервиса Тогда
		
		// ТекстБаннераСтатистическаяОтчетность
		ТекстБаннераСтатистическаяОтчетность.Добавить(СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(СтрШаблон(
			НСтр("ru='Перечень форм обновляется по данным <a href = ""%1"">сайта Росстата</a>.'"),
			АдресИнтерактивногоСервисаРосстата)));
		
		ТекстБаннераСтатистическаяОтчетность.Добавить(Символы.ПС);
		ТекстБаннераСтатистическаяОтчетность.Добавить(
			НСтр("ru='Поиск выполняется по ОКПО и ИНН, указанных в реквизитах организации.'"));
		
		Если ЗначениеЗаполнено(ДатаЗагрузкиФормСтатистики) Тогда
			Элементы.Заголовок_ДатаАктуальности.Видимость = Истина;
			Элементы.Заголовок_ДатаАктуальности.Заголовок = СтрШаблон(НСтр("ru='Данные по состоянию на %1'"), Формат(ДатаЗагрузкиФормСтатистики, "ДЛФ=D;"));
		КонецЕсли;
		
		// ТекстБаннераСтатистическаяОтчетностьСостояние
		Отбор = Новый Структура("Идентификатор, ПолученИзВнешнегоСервиса", ИдентификаторСтатистика, Истина);
		ПолученыИзВнешнегоСервиса = Форма.СписокПодчиненный.НайтиСтроки(Отбор);
		
		Если ПолученыИзВнешнегоСервиса.Количество() = 0 И ЗначениеЗаполнено(ДатаЗагрузкиФормСтатистики) Тогда
			ТекстБаннераСтатистическаяОтчетностьСостояние.Добавить(
				НСтр("ru='По данным ведомства, отчетность не требуется.'"));
		ИначеЕсли ПолученыИзВнешнегоСервиса.Количество() = 0 Тогда 
			ТекстБаннераСтатистическаяОтчетностьСостояние.Добавить(
				НСтр("ru='На данный момент сведения отсутствуют, но в скором времени они будут запрошены в ведомстве.'"));
		КонецЕсли;
		
		Отбор = Новый Структура("Идентификатор, Включен, ПолученИзВнешнегоСервиса", ИдентификаторСтатистика, Истина, Ложь);
		ВключеныПользователем = Форма.СписокПодчиненный.НайтиСтроки(Отбор);
		
		Отбор = Новый Структура("Идентификатор, Включен, ПолученИзВнешнегоСервиса", ИдентификаторСтатистика, Ложь, Истина);
		ОтключеныПользователем = Форма.СписокПодчиненный.НайтиСтроки(Отбор);
	
		Если ЗначениеЗаполнено(ДатаЗагрузкиФормСтатистики)
			 И (ВключеныПользователем.Количество() > 0 Или ОтключеныПользователем.Количество() > 0) Тогда
			Если ТекстБаннераСтатистическаяОтчетностьСостояние.Количество() > 0 Тогда
				ТекстБаннераСтатистическаяОтчетностьСостояние.Добавить(Символы.ПС);
			КонецЕсли;
			ТекстБаннераСтатистическаяОтчетностьСостояние.Добавить(НСтр("ru='Часть форм была добавлена или отключена вручную.'"));
			Элементы.ВосстановитьПоДаннымРосстата.Видимость = Форма.ПравоРедактированияНастроек;
		КонецЕсли;
	
	Иначе
		
		ТекстБаннераСтатистическаяОтчетность.Добавить(СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(СтрШаблон(
			НСтр("ru='Актуальный перечень форм можно узнать на <a href = ""%1"">сайте Росстата</a>.'"),
			АдресИнтерактивногоСервисаРосстата)));
		
		Если Форма.ПричинаНедоступностиЗагрузкиСпискаСтатФорм = "НеЗаполненыДанныеИнтернетПоддержки"
			 Или Форма.ПричинаНедоступностиЗагрузкиСпискаСтатФорм = "НеверныйЛогинИлиПароль" Тогда
		
			ТекстБаннераСтатистическаяОтчетностьСостояние.Добавить(СтроковыеФункцииКлиентСервер.ФорматированнаяСтрока(
				НСтр("ru='Чтобы данные ведомства загружались автоматически, <a href = ""ПодключитьИнтернетПоддержку"">подключите Интернет-поддержку</a>.'")));
		
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТекстБаннера_СтатистическаяОтчетность.Заголовок =
		Новый ФорматированнаяСтрока(ТекстБаннераСтатистическаяОтчетность);
	Элементы.ТекстБаннера_СтатистическаяОтчетность_Состояние.Заголовок =
		Новый ФорматированнаяСтрока(ТекстБаннераСтатистическаяОтчетностьСостояние);
	Элементы.ТекстБаннера_СтатистическаяОтчетность_Состояние.Видимость =
		(ТекстБаннераСтатистическаяОтчетностьСостояние.Количество() > 0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтобразитьРеквизитыЗависимыеОтТекущихНастроек(Форма)
	
	Элементы = Форма.Элементы;
	
	НастройкиУчетаСтраховыхВзносов = Форма.НастройкиУчетаСтраховыхВзносов;
	
	Элементы.ГиперссылкаДолжности.Доступность = НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудФармацевтов
		ИЛИ НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудЧленовЛетныхЭкипажей
		ИЛИ НастройкиУчетаСтраховыхВзносов.ИспользуетсяТрудШахтеров;
		
	Элементы.ПрименяютсяРезультатыСпециальнойОценкиУсловийТруда.Доступность
		= НастройкиУчетаСтраховыхВзносов.ИспользуютсяРаботыСДосрочнойПенсией;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура ПериодЗавершениеВыбора(РезультатВыбора, ИмяРегистра) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		ДатаИзменения = РезультатВыбора;
		ПараметрыДатыИзменения = ПредставленияДатыИзменения(ДатаИзменения, ИмяРегистра);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДатыИзменения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяРегистра(ИмяЭлемента)
	
	ПозицияРазделителя = СтрНайти(ИмяЭлемента, "_");
	Если ПозицияРазделителя = 0 Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не удалось определить имя регистра по имени элемента ""%1""'"),ИмяЭлемента );
	КонецЕсли;
	
	Возврат Сред(ИмяЭлемента, ПозицияРазделителя + 1);
	
КонецФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	РазблокироватьДанныеДляРедактирования(, УникальныйИдентификатор); // Все разблокируем
	
	ЗаполнитьСведенияОбОрганизации(ЭтотОбъект);
	
	Если ПустаяСтрока(РезультатБлокировки) Тогда
		ПодготовитьФормуНастройкиСписка(ЭтотОбъект);
	КонецЕсли;
	
	Параметры.Организация = Организация;
	
	ПодготовитьФормуНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииНастроек(ОбновитьЗадачи = Ложь)
	
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.НалогиОтчеты"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ВариантыПримененияТребованийЗаконодательства"));
	ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
	Оповестить(НСтр("ru = 'Обновить дерево отчетов'"), НСтр("ru = 'Обновить дерево отчетов'"), ЭтаФорма); // На языке регламентированной отчетности
	
	Если ОбновитьЗадачи Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ОбновитьИЗаполнитьРегулярныеЗадачи", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьИЗаполнитьРегулярныеЗадачи()
	
	ДлительнаяОперация = ОбновитьИЗаполнитьРегулярныеЗадачи(УникальныйИдентификатор, Организация);
	
	Если ДлительнаяОперация = Неопределено Тогда
		// Фоновое задание не запущено
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус <> "Ошибка" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление списка задач бухгалтера'");
		Обработчик = Новый ОписаниеОповещения("ОбновитьИЗаполнитьРегулярныеЗадачиЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьИЗаполнитьРегулярныеЗадачи(УникальныйИдентификатор, Организация)
	
	Возврат КалендарьБухгалтера.ЗапуститьЗаполнениеВФоне(УникальныйИдентификатор, Организация, Ложь, Ложь, Истина);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИЗаполнитьРегулярныеЗадачиЗавершение(ДлительнаяОперация, ДополнителныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция АдресОписанияВыбораФормСтатистики()
	
	СтрокаЗадачи = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	
	Отбор = Новый Структура("Родитель, Включен", СтрокаЗадачи.Ссылка, Ложь);
	ФормыСтатистикиНеВыбраны = СписокПодчиненный.НайтиСтроки(Отбор);
	
	ТаблицаСтатистики = Новый ТаблицаЗначений;
	ТаблицаСтатистики.Колонки.Добавить("Колонка1",,НСтр("ru = 'Форма статистики'"), 50);
		
	Для Каждого ФормаСтатистики Из ФормыСтатистикиНеВыбраны Цикл
		СтрокаФормы = ТаблицаСтатистики.Добавить();
		СтрокаФормы.Колонка1 = ФормаСтатистики.Ссылка;
	КонецЦикла;
		
	ОписаниеТаблицы = Новый Массив;
	ОписаниеТаблицы.Добавить(ТаблицаСтатистики);
	ОписаниеТаблицы.Добавить(НСтр("ru = 'Добавить напоминания по:'"));
	
	АдресОписанияТаблицы = ПоместитьВоВременноеХранилище(ОписаниеТаблицы, УникальныйИдентификатор);

	Возврат АдресОписанияТаблицы;
	
КонецФункции

&НаКлиенте
Процедура СписокФормыСтатистикиПослеВыбора(МассивФормСтатистики, Параметры) Экспорт
	
	Если МассивФормСтатистики = Неопределено Или МассивФормСтатистики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЗадачи = Список.НайтиПоИдентификатору(Элементы.Список.ТекущаяСтрока);
	Отбор = Новый Структура("Родитель, Наименование", СтрокаЗадачи.Ссылка, Неопределено);
	ЕстьИзменения = Ложь;
	
	Для Каждого ФормаСтатистики Из МассивФормСтатистики Цикл
		
		Отбор.Наименование = ФормаСтатистики.Значение;
		Строки = СписокПодчиненный.НайтиСтроки(Отбор);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Строки[0].Включен = Истина;
		Строки[0].ОтключенПользователем = Ложь;
		Строки[0].ДобавленПользователем = Не Строки[0].ПолученИзВнешнегоСервиса;
		
		СтрокаЗадачи.Включен = Истина;
		ЕстьИзменения = Истина;
		
	КонецЦикла;
	
	Если ЕстьИзменения Тогда
		СохранитьСписокНастройкиНалоговОтчетов(СтрокаЗадачи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаписьДанныхНаСервере(Настройка)
	
	КалендарьБухгалтера.ЗапланироватьОбновлениеЗадачБухгалтера();
	
	РезультатЧтения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(РезультатЧтения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РезультатЧтения.Дерево;
	НовоеДерево = Дерево.Скопировать();
	НовоеДерево.Строки.Очистить();
	
	СтруктураПоиска = Новый Структура("Идентификатор", Настройка.Идентификатор);
	МассивСтрок = Дерево.Строки.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтараяСтрока = МассивСтрок[0];
	НоваяСтрока = НовоеДерево.Строки.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтараяСтрока);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Настройка);
	//Перезаполняем дерево
	ЗаполнитьЗначенияСвойств(СтараяСтрока, НоваяСтрока);
	
	Если Настройка.ЕстьПодстроки Тогда
		Для Каждого Строка Из СтараяСтрока.Строки Цикл
			СтруктураПоиска = Новый Структура("Ссылка", Строка.Ссылка);
			МассивСтрок = СписокПодчиненный.НайтиСтроки(СтруктураПоиска);
			Если МассивСтрок.Количество() <> 0 Тогда
				ПодчиненнаяСтрока = НоваяСтрока.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрока, Строка);
				ЗаполнитьЗначенияСвойств(ПодчиненнаяСтрока, МассивСтрок[0]);
				//Перезаполняем дерево
				ЗаполнитьЗначенияСвойств(Строка, ПодчиненнаяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РезультатЧтения.Вставить("Дерево", Дерево);
	ПоместитьВоВременноеХранилище(РезультатЧтения, АдресХранилища);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация",                 Организация);
	ПараметрыЗаполнения.Вставить("Дерево",                      НовоеДерево);
	ПараметрыЗаполнения.Вставить("ПолноеДерево",                Дерево);
	ПараметрыЗаполнения.Вставить("ЗначенияДетальнойНастройки",  ПолучитьИзВременногоХранилища(АдресЗначенияДетальнойНастройки));
	ПараметрыЗаполнения.Вставить("ПараметрыДетальнойНастройки", ПолучитьИзВременногоХранилища(АдресПараметрыДетальнойНастройки));
	
	РегистрыСведений.НалогиОтчеты.ЗаписатьДанныеВыборочно(ПараметрыЗаполнения);
	
	Если Настройка.Идентификатор = ЗадачиБухгалтераКлиентСервер.КодЗадачиСтатистика() Тогда
		НастроитьЭлементыСостоянияЗагрузкиСтатистическихОтчетов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияИнтернетПоддержки(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
		
	НачатьПолучениеСпискаСтатФормИзСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеСпискаСтатФормИзСервиса()
	
	ДоступнаЗагрузкаФормИзСервиса = ЗадачиБухгалтераСтатистикаВызовСервера.ДоступнаЗагрузкаФормИзСервиса(ПричинаНедоступностиЗагрузкиСпискаСтатФорм);
	
	Если Не ДоступнаЗагрузкаФормИзСервиса Или Не ЗадачиБухгалтераСтатистикаВызовСервера.ПроверитьМинимальныйИнтервалОбращенияКСервису() Тогда
		// Только обновляем баннер и колонки списка стат форм
		НастроитьЭлементыСостоянияЗагрузкиСтатистическихОтчетов(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	// Показываем картинку ожидания вместо баннера
	Элементы.ГруппаБаннер_СтатистическаяОтчетность_Страницы.ТекущаяСтраница = Элементы.ГруппаБаннер_СтатистическаяОтчетность_СтраницаОжидание;
	// Блокируем таблицу стат отчетов
	Элементы.СписокФормыСтатистики.Доступность = Ложь;
	
	СведенияОДлительнойОперацииПолученияСтатФорм = ЗадачиБухгалтераСтатистикаВызовСервера.СведенияОДлительнойОперацииПолученияСтатФорм();
	
	Если ЗначениеЗаполнено(СведенияОДлительнойОперацииПолученияСтатФорм.ОжидатьЗавершение) Тогда
		// Фоновое задание уже было запущено.
		// Обновим список стат. отчетов через указанный интервал
		ПодключитьОбработчикОжидания(
			"Подключаемый_ЗаполнитьСписокНастройкиНалоговОтчетов",
			СведенияОДлительнойОперацииПолученияСтатФорм.ОжидатьЗавершение,
			Истина);
	ИначеЕсли ЗначениеЗаполнено(СведенияОДлительнойОперацииПолученияСтатФорм.ДлительнаяОперация) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещенияОЗавершении = Новый ОписаниеОповещения("ПолучениеСпискаСтатФормИзСервисаЗавершение", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			СведенияОДлительнойОперацииПолученияСтатФорм.ДлительнаяОперация,
			ОповещенияОЗавершении,
			ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСпискаСтатФормИзСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СведенияОДлительнойОперацииПолученияСтатФорм.ДлительнаяОперация = Неопределено; // Сбросим признак выполнения.
	
	Если Результат <> Неопределено И Результат.Статус = "Выполнено" Тогда
		ЗаполнитьСписокНастройкиНалоговОтчетов();
	Иначе
		НастроитьЭлементыСостоянияЗагрузкиСтатистическихОтчетов(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПараметрыВыбораОрганизации(Форма, ДоступныеОрганизации)
	
	Элементы = Форма.Элементы;
	
	ПараметрВыбораОтборПоОрганизации = Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеОрганизации);
	
	ПараметрыВыбораОрганизации = Новый Массив();
	ПараметрыВыбораОрганизации.Добавить(ПараметрВыбораОтборПоОрганизации);
	
	Элементы.Организация.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОрганизации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСведенияОбОрганизации(Форма)
	
	Если НЕ ЗначениеЗаполнено(Форма.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОрганизация = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Форма.Организация, "ГоловнаяОрганизация");
	Форма.ГоловнаяОрганизация = СведенияОрганизация.ГоловнаяОрганизация;
	Форма.ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Форма.Организация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьДоступностьВидимостьНастроек(ДоступностьВидимость, Форма)

	Элементы = Форма.Элементы;
	Если Форма.ОрганизацияНедоступна Тогда
		Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНедоступная;
	Иначе
		Если ДоступностьВидимость Тогда
			Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаНастройки;
		Иначе
			Элементы.ОбщиеСтраницыНастроек.ТекущаяСтраница = Элементы.ОбщаяСтраницаПустая;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыВыбораПериодаНастройки(Знач ДатаИзменения, ИмяРегистра, Тариф = Неопределено)
	
	Период = Новый Структура("НачалоПериода, КонецПериода, Значение, РежимВыбораПериода, ЗапрашиватьРежимВыбораПериодаУВладельца, ИмяФормы");
	
	Если ИмяРегистра = "СтраховыеВзносы" Тогда
		Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Месяц;
	Иначе
		Периодичность = Метаданные.РегистрыСведений[ИмяРегистра].ПериодичностьРегистраСведений;
	КонецЕсли;
	
	Если Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Год Тогда
		Период.НачалоПериода = НачалоГода(ДатаИзменения);
		Период.КонецПериода = КонецГода(ДатаИзменения);
		Период.РежимВыбораПериода = "Год";
	ИначеЕсли Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Квартал Тогда
		Период.НачалоПериода = НачалоКвартала(ДатаИзменения);
		Период.КонецПериода = КонецКвартала(ДатаИзменения);
		Период.РежимВыбораПериода = "Квартал";
	Иначе
		Период.НачалоПериода = НачалоМесяца(ДатаИзменения);
		Период.КонецПериода = КонецМесяца(ДатаИзменения);
		Период.РежимВыбораПериода = "Месяц";
	КонецЕсли;
	Период.Значение = Период.НачалоПериода;
	Период.ИмяФормы = "ВыборПериода";
	Период.ЗапрашиватьРежимВыбораПериодаУВладельца = Ложь;
	
	Возврат Период;
	
КонецФункции

&НаСервере
Процедура ПеречитатьНастройкиНаТекущуюДату(ИмяРаздела, Тариф = Неопределено)
	
	ДатаИзменения = НачалоГода(ТекущаяДата);
	ПараметрыДатыИзменения = ПредставленияДатыИзменения(ДатаИзменения, ИмяРаздела, Тариф);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДатыИзменения);
	
	ПрочитатьОтдельнуюНастройкуУчетнойПолитики(ИмяРаздела, ЭтотОбъект);
	УправлениеФормой(ЭтотОбъект, ИмяРаздела);
	
КонецПроцедуры

// Вызывается при получении оповещения о записи организации.
// Для новых организаций добавляет их ссылки в отбор параметра выбора, 
// чтобы они были доступны в списке на форме.
//
// Параметры:
//	Параметр - Неопределено, Структура - Параметр, полученный в ОбработкаОповещения().
//		Если имеет тип Структура и содержит ключ "ЭтоНовый", то такое оповещения будет обработано,
//		иначе проигнорировано.
//	Источник - СправочникСсылка.Организации - Ссылка на измененную организацию.
//
&НаСервере
Процедура ОбработкаОповещенияЗаписьОрганизации(Параметр, Источник)
	
	Если ТипЗнч(Параметр) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметр.Свойство("ЭтоНовый") 
		ИЛИ НЕ Параметр.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	// При записи новой организации добавим ее в список доступных для выбора организаций на форме.
	ДоступныеОрганизации = Новый Массив;
	ДоступныеОрганизации.Добавить(Источник);
	
	Если Элементы.Организация.ПараметрыВыбора.Количество() > 0 Тогда
		// В качестве значения параметра выбора указан фиксированный массив ссылок организаций, 
		// полученный из ОбщегоНазначенияБПВызовСервераПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю().
		// Копируем их в новый массив.
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеОрганизации, Элементы.Организация.ПараметрыВыбора[0].Значение);
	КонецЕсли;
	
	ФиксированныйМассивДоступныхОрганизаций = Новый ФиксированныйМассив(ДоступныеОрганизации);
	
	УстановитьПараметрыВыбораОрганизации(ЭтотОбъект, ДоступныеОрганизации);

КонецПроцедуры

&НаСервере
Процедура СнятьБлокировкуСРегистраНалогиОтчеты(Организация, УИД)
	
	ОписаниеКлюча = Новый Структура("Организация", Организация);
	РазблокироватьДанныеДляРедактирования(
		РегистрыСведений.НалогиОтчеты.СоздатьКлючЗаписи(ОписаниеКлюча),
		УИД);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатДетальнойНастройки(ИдентификаторСтроки, РезультатДетальнойНастройки)
	
	Строка = СписокПодчиненный.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Строка.Включен Тогда
		Строка.Включен     = Истина;
	КонецЕсли;
	
	ПараметрыДетальнойНастройки = ПолучитьИзВременногоХранилища(АдресПараметрыДетальнойНастройки);
	Если Строка.Ключ = "" Тогда
		ОписаниеПараметров = ПараметрыДетальнойНастройки[Строка.Ссылка];
	Иначе
		ОписаниеПараметров = ПараметрыДетальнойНастройки[Строка.Ключ];
	КонецЕсли;
	
	// Изменим значения во временном хранилище значений.
	ЗначенияДетальнойНастройки = ПолучитьИзВременногоХранилища(АдресЗначенияДетальнойНастройки);
	Если ЗначенияДетальнойНастройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Строка.Ключ = "" Тогда
		ЗначенияДетальнойНастройки.Вставить(Строка.Ссылка, РезультатДетальнойНастройки);
	Иначе
		ЗначенияДетальнойНастройки.Вставить(Строка.Ключ, РезультатДетальнойНастройки);
	КонецЕсли;
	АдресЗначенияДетальнойНастройки = ПоместитьВоВременноеХранилище(ЗначенияДетальнойНастройки, УникальныйИдентификатор);
	
	// Обновим представление детальной настройки
	Строка.ДетальнаяНастройкаПредставление = РегистрыСведений.НалогиОтчеты.ПредставлениеДетальнойНастройки(
		ОписаниеПараметров,
		РезультатДетальнойНастройки);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставленияДатыИзменения(ДатаИзменения, ИмяРегистра, Тариф = Неопределено)
	
	Представления = Новый Структура;
	
	ПараметрыВыбора = ПараметрыВыбораПериодаНастройки(ДатаИзменения, ИмяРегистра, Тариф);
	
	Представления.Вставить("ДатаИзмененияСтрокой", ПредставлениеПериода(
		ПараметрыВыбора.НачалоПериода, ПараметрыВыбора.КонецПериода, "ФП = Истина"));
	
	Представления.Вставить("ДатаИзмененияЧислом", Год(ДатаИзменения));
	
	Возврат Представления;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьОтдельнуюНастройкуУчетнойПолитики(ИмяРегистра, Форма)
	
	ОтборОрганизация = Новый Структура("Организация", Форма.Организация);
	
	Если ИмяРегистра = "ПрименяемыеТарифыСтраховыхВзносов" 
		ИЛИ ИмяРегистра = "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
		ИЛИ ИмяРегистра = "СтраховыеВзносы" Тогда
		МенеджерЗаписиПериодическогоРегистра("ПрименяемыеТарифыСтраховыхВзносов", Форма.ГоловнаяОрганизация, "ГоловнаяОрганизация",,,Форма);
		МенеджерЗаписиПериодическогоРегистра("СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", Форма.Организация,,,,Форма);
		МенеджерЗаписиРегистра("НастройкиУчетаСтраховыхВзносов", Форма.Организация, Форма);
	ИначеЕсли ИмяРегистра = "УчетнаяПолитикаПоНДФЛ" ИЛИ ИмяРегистра = "НастройкиУчетаСтраховыхВзносов" Тогда
		МенеджерЗаписиРегистра("УчетнаяПолитикаПоНДФЛ", Форма.ГоловнаяОрганизация, Форма, "ГоловнаяОрганизация");
		МенеджерЗаписиРегистра("НастройкиУчетаСтраховыхВзносов", Форма.Организация, Форма);
	Иначе
		МенеджерЗаписиПериодическогоРегистра(ИмяРегистра, Форма.Организация,,,,Форма);
	КонецЕсли;
	
	ЗаполнитьСвязанныеРеквизиты(Форма, ИмяРегистра);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСвязанныеРеквизиты(Форма, ИмяРаздела = Неопределено)
	
	Если ИмяРаздела = Неопределено ИЛИ ИмяРаздела = "СтраховыеВзносы" ИЛИ ИмяРаздела = "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев"
		ИЛИ ИмяРаздела = "ПрименяемыеТарифыСтраховыхВзносов" Тогда
		ВидТарифаПредставление = УчетСтраховыхВзносовКлиентСервер.ОписаниеВидаТарифа(Форма.ПрименяемыеТарифыСтраховыхВзносов.ВидТарифа);
		Если НЕ ЗначениеЗаполнено(ВидТарифаПредставление) Тогда
			ВидТарифаПредставление = НСтр("ru = 'Вид тарифа страховых взносов не указан'");
		КонецЕсли;
		Форма.Элементы.ВидТарифа.РасширеннаяПодсказка.Заголовок = ВидТарифаПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиДействующейУчетнойПолитики(ИмяРегистра, ИмяОтбора, ЗначениеОтбора, ПериодЗначений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",  ПериодЗначений);
	Запрос.УстановитьПараметр(ИмяОтбора, ЗначениеОтбора);
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Период КАК Период
	|ИЗ
	|	РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(&Период, Организация = &Организация) КАК СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев", ИмяРегистра);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Организация", ИмяОтбора);
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗначенияКлюча = Новый Структура;
		ЗначенияКлюча.Вставить(ИмяОтбора, ЗначениеОтбора);
		ЗначенияКлюча.Вставить("Период", Выборка.Период);
		
		Возврат РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(ЗначенияКлюча);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПрочитатьИОписатьНастройкиУчета(Форма)
	
	ПрочитатьУчетнуюПолитику(Форма);
	ОписатьНастройкиУчета(Форма, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОписатьНастройкиУчета(Форма, ПоказыватьСтатистическуюОтчетность)
	
	Список = Форма.Список;
	Список.Очистить();
	
	СкрытыеОтчеты = 0;
	
	Если Форма.ВедетсяУчетЗарплаты Тогда
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Наименование  = НСтр("ru = 'НДФЛ'");
		НоваяСтрока.Идентификатор = "НДФЛ_Агент";
		НоваяСтрока.Включен      = Форма.ЭтоЮрЛицо ИЛИ РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(Форма.Организация);
		НоваяСтрока.Порядок = 201;
		
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Наименование  = НСтр("ru = 'Страховые взносы'");
		НоваяСтрока.Идентификатор = "СтраховыеВзносы";
		НоваяСтрока.Включен      = Форма.ЭтоЮрЛицо ИЛИ РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(Форма.Организация);
		НоваяСтрока.Порядок = 202;
	КонецЕсли;
	
	НоваяСтрока = Список.Добавить();
	НоваяСтрока.Наименование  = НСтр("ru = 'Статистика'");
	НоваяСтрока.Идентификатор = "СтатистическаяОтчетность";
	НоваяСтрока.Включен      = ПоказыватьСтатистическуюОтчетность;
	НоваяСтрока.Порядок = 400;
	
	ПрочитатьИспользуемыеНастройки(Форма);
	
	Список.Сортировать("Включен Убыв, Порядок Возр");
	
	Для Каждого СтрокаСписка Из Список Цикл
		Если НЕ СтрокаСписка.Включен Тогда
			СкрытыеОтчеты = СкрытыеОтчеты + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если СкрытыеОтчеты <> 0 Тогда
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Наименование = СтрШаблон(НСтр("ru = 'Все налоги и отчеты (еще %1)'"), СкрытыеОтчеты);
		НоваяСтрока.Служебный    = Истина;
		НоваяСтрока.Включен      = Истина;
		
		Если Форма.Разворачивать Тогда
			Форма.Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура("Служебный", Ложь);
		Иначе
			Форма.Элементы.Список.ОтборСтрок = Новый ФиксированнаяСтруктура("Включен", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.ПолныйСписок = СкрытыеОтчеты = 0 И НЕ Форма.Разворачивать;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти