#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗарплатаКадрыРасширеннаяПодсистемыСуществует = ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы");
	Если Не ЗарплатаКадрыРасширеннаяПодсистемыСуществует Тогда
		Если Значение Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя установить значение ИспользоватьРасширеннуюФункциональность'");
		КонецЕсли;
	КонецЕсли;
	
	БазоваяФункциональностьНедоступна = Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций");
	Если ЗарплатаКадрыРасширеннаяПодсистемыСуществует И БазоваяФункциональностьНедоступна И Не Значение Тогда 
		ВызватьИсключение НСтр("ru = 'Нельзя сбросить значение ИспользоватьРасширеннуюФункциональность'");
	КонецЕсли;
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли