// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.ДоИзноса Тогда
		КратностьВыдачи = 1;
		ПериодичностьВыдачи = 3999;
		ЕдиницаПериодичностиВыдачи = Перечисления.Периодичность.Год;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособВыдачи = Перечисления.СпособыВыдачиСИЗ.СПериодичностью Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеРеквизиты = Новый Массив; //Массив Из Строка
	УдаляемыеРеквизиты.Добавить("КратностьВыдачи");
	УдаляемыеРеквизиты.Добавить("ПериодичностьВыдачи");
	УдаляемыеРеквизиты.Добавить("ЕдиницаПериодичностиВыдачи");
	
	Для каждого ИмяРеквизита Из УдаляемыеРеквизиты Цикл
		УдаляемыйРеквизит = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
		Если УдаляемыйРеквизит <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(УдаляемыйРеквизит);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоОписаниюДляЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ВидНоменклатуры) Или Не ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	МассивВидов = Новый Массив;
	Справочники.ВидыНоменклатуры.ДобавитьПредустановленныйВидНоменклатуры(МассивВидов, ТипНоменклатуры, Строка(ТипНоменклатуры));
	ВидНоменклатуры = МассивВидов[0]; //СправочникСсылка.ВидыНоменклатуры
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
