
#Если Не ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область Режимы

// Определяет, запущено ли приложение в интерфейсе Такси
// 
// Возвращаемое значение:
//  Булево - Истина, если приложение запущено в интерфейсе Такси
//           Ложь, в ином случае.
Функция ЭтоИнтерфейсТакси() Экспорт
	Возврат КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Такси;
КонецФункции

// Определяет, запущено ли приложение в интерфейсе 8.5
// 
// Возвращаемое значение:
//  Булево - Истина, если приложение запущено в интерфейсе 8.5
//           Ложь, в ином случае.
Функция ЭтоИнтерфейсВерсия8_5() Экспорт
	Возврат КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_5;
КонецФункции

#КонецОбласти

#Область Баннеры

// Метод-конструктор дополнительных параметров оформления баннера
// 
// Возвращаемое значение:
//  Структура - Дополнительные параметры оформления баннера:
//  * ЦветФона   - Цвет - Цвет фона баннера
//  * ЦветТекста - Цвет - Цвет текста баннера
Функция НовыеПараметрыОформленияБаннера() Экспорт
	
	Результат = Новый Структура;
	
	Цвета = ИнтерфейсПользователяБЭДКлиентСерверПовтИсп.Цвета();
	
	Результат.Вставить("ЦветФона"   , Цвета.Пустой);
	Результат.Вставить("ЦветТекста" , Цвета.ПоясняющийТекст);
	
	Возврат Результат;
	
КонецФункции

// Выполняет оформление красного баннера для разных режимов запуска платформы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать баннер
//  ИмяЭлементаФормы    - Строка                     - Имя группы формы, отображаемой в виде баннера
//  ПараметрыОформления - См. ИнтерфейсПользователяБЭДКлиентСервер.НовыеПараметрыОформленияБаннера
//                        - Неопределено - Параметры оформления по умолчанию
Процедура ОформитьБаннерОшибка(
	Знач Форма, 
	Знач ИмяЭлементаФормы, 
	Знач ПараметрыОформления = Неопределено) Экспорт
	
	ОформитьБаннер(Форма, ИмяЭлементаФормы, НастройкиБаннераОшибка(), ПараметрыОформления);
	
КонецПроцедуры

// Выполняет оформление желтого баннера для разных режимов запуска платформы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать баннер
//  ИмяЭлементаФормы    - Строка                     - Имя группы формы, отображаемой в виде баннера
//  ПараметрыОформления - См. ИнтерфейсПользователяБЭДКлиентСервер.НовыеПараметрыОформленияБаннера
//                        - Неопределено - Параметры оформления по умолчанию
Процедура ОформитьБаннерПредупреждение(
	Знач Форма, 
	Знач ИмяЭлементаФормы, 
	Знач ПараметрыОформления = Неопределено) Экспорт
	
	ОформитьБаннер(Форма, ИмяЭлементаФормы, НастройкиБаннераПредупреждение(), ПараметрыОформления);
	
КонецПроцедуры

// Выполняет оформление голубого баннера для разных режимов запуска платформы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать баннер
//  ИмяЭлементаФормы    - Строка                     - Имя группы формы, отображаемой в виде баннера
//  ПараметрыОформления - См. ИнтерфейсПользователяБЭДКлиентСервер.НовыеПараметрыОформленияБаннера
//                        - Неопределено - Параметры оформления по умолчанию
Процедура ОформитьБаннерИнформация(
	Знач Форма, 
	Знач ИмяЭлементаФормы, 
	Знач ПараметрыОформления = Неопределено) Экспорт
	
	ОформитьБаннер(Форма, ИмяЭлементаФормы, НастройкиБаннераИнформация(), ПараметрыОформления);
	
КонецПроцедуры

// Выполняет оформление зеленого баннера для разных режимов запуска платформы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать баннер
//  ИмяЭлементаФормы    - Строка                     - Имя группы формы, отображаемой в виде баннера
//  ПараметрыОформления - См. ИнтерфейсПользователяБЭДКлиентСервер.НовыеПараметрыОформленияБаннера
//                        - Неопределено - Параметры оформления по умолчанию
Процедура ОформитьБаннерУспех(
	Знач Форма, 
	Знач ИмяЭлементаФормы, 
	Знач ПараметрыОформления = Неопределено) Экспорт
	
	ОформитьБаннер(Форма, ИмяЭлементаФормы, НастройкиБаннераУспех(), ПараметрыОформления);
	
КонецПроцедуры

#КонецОбласти

#Область ОтображениеЭлементов

// Настраивает отображение элемента формы только для интерфейса 8.5
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать элемент формы
//  ИмяЭлементаФормы    - Строка                     - Имя элемента формы, который требуется адаптировать
Процедура Только85(Знач Форма, Знач ИмяЭлементаФормы) Экспорт
	Если Не ЭтоИнтерфейсВерсия8_5() Тогда
		СкрытьЭлементФормы(Форма, ИмяЭлементаФормы);
	КонецЕсли;
КонецПроцедуры

// Настраивает отображение элемента формы только для интерфейса Такси
//
// Параметры:
//  Форма            - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать элемент формы
//  ИмяЭлементаФормы - Строка                     - Имя элемента формы, который требуется адаптировать
Процедура ТолькоТакси(Знач Форма, Знач ИмяЭлементаФормы) Экспорт
	Если Не ЭтоИнтерфейсТакси() Тогда
		СкрытьЭлементФормы(Форма, ИмяЭлементаФормы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область КнопкаПоУмолчанию

// Настраивает отображение элемента формы только для интерфейса Такси
//
// Параметры:
//  Форма            - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать элемент формы
//  ИмяЭлементаФормы - Строка                     - Имя элемента формы, который требуется адаптировать
//  Использование    - Булево                     - Истина, если требуется кнопку оформить как кнопку по умолчанию
//                                                  Ложь, если требуется скрыть команду.
//
// Пример:
//  // Если ЭтоРежимВыбора:
//  //  - Делаем кнопку "ФормаВыбор" кнопкой по умолчанию
//  //  - Скрываем кнопку "ФормаЗагрузить"
//  // Если Не ЭтоРежимВыбора:
//  //  - Делаем кнопку "ФормаЗагрузить" кнопкой по умолчанию
//  //  - Скрываем кнопку "ФормаВыбор"
//  ИнтерфейсПользователяБЭДКлиентСервер.УстановитьКнопкуПоУмолчанию(
//       ЭтотОбъект,
//       Элементы.ФормаВыбор.Имя,
//       ЭтоРежимВыбора);
//  ИнтерфейсПользователяБЭДКлиентСервер.УстановитьКнопкуПоУмолчанию(
//       ЭтотОбъект,
//       Элементы.ФормаЗагрузить.Имя,
//       Не ЭтоРежимВыбора);
Процедура УстановитьКнопкуПоУмолчанию(Знач Форма, Знач ИмяЭлементаФормы, Знач Использование) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		ИмяЭлементаФормы,
		"Видимость",
		Использование);
		
	Если ЭтоИнтерфейсТакси() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяЭлементаФормы,
			"КнопкаПоУмолчанию",
			Использование);
	ИначеЕсли ЭтоИнтерфейсВерсия8_5() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			ИмяЭлементаФормы,
			"Важность",
			?(Использование, ВажностьКнопки.Главная, ВажностьКнопки.Обычная));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВидыБаннеров

// Метод-конструктор настроек оформления баннера
// 
// Возвращаемое значение:
//  Структура - Настройки оформления баннера
Функция НовыеНастройкиБаннера()
	
	Результат = Новый Структура;
	
	// На текущий момент дополнительных параметров не предусмотрено.
	// Задел на кастомизацию механизма.
	
	Возврат Результат;
	
КонецФункции

// Настройки красного баннера
//
// Возвращаемое значение:
//  См. НовыеНастройкиБаннера
Функция НастройкиБаннераОшибка()
	
	Результат = НовыеНастройкиБаннера();
	
	Возврат Результат;
	
КонецФункции

// Настройки желтого баннера
//
// Возвращаемое значение:
//  См. НовыеНастройкиБаннера
Функция НастройкиБаннераПредупреждение()
	
	Результат = НовыеНастройкиБаннера();
	
	Возврат Результат;
	
КонецФункции

// Настройки синего баннера
//
// Возвращаемое значение:
//  См. НовыеНастройкиБаннера
Функция НастройкиБаннераИнформация()
	
	Результат = НовыеНастройкиБаннера();
	
	Возврат Результат;
	
КонецФункции

// Настройки зеленого баннера
//
// Возвращаемое значение:
//  См. НовыеНастройкиБаннера
Функция НастройкиБаннераУспех()
	
	Результат = НовыеНастройкиБаннера();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Баннеры

// Выполняет оформление красного баннера для разных режимов запуска платформы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой требуется адаптировать баннер
//  ИмяЭлементаФормы    - Строка                     - Имя группы формы, отображаемой в виде баннера
//  НастройкиБаннера     - См. НовыеНастройкиБаннера
//  ПараметрыОформления - См. ИнтерфейсПользователяБЭДКлиентСервер.НовыеПараметрыОформленияБаннера
//                        - Неопределено - Параметры оформления по умолчанию
Процедура ОформитьБаннер(
	Форма, 
	Знач ИмяЭлементаФормы, 
	Знач НастройкиБаннера, 
	Знач ПараметрыОформления = Неопределено)
	
	Контекст = "ИнтерфейсПользователяБЭДКлиентСервер.ОформитьБаннер";
	
	Если ЭтоИнтерфейсВерсия8_5() Тогда
		// Считаем, что форма по умолчанию оформлена с ориентиром на интерфейс 8.5.
		// То есть модифицируем форму только для интерфейса Такси.
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОформления = Неопределено Тогда
		ПараметрыОформления = НовыеПараметрыОформленияБаннера();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, ИмяЭлементаФормы, "ЦветФона", ПараметрыОформления.ЦветФона);
	
	Баннер = Форма.Элементы.Найти(ИмяЭлементаФормы);
	
	Если Баннер = Неопределено Тогда
		Возврат; // Возможные модификации формы (например, из-за ролей)
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТипЗнч(Баннер) = Тип("ГруппаФормы"),
		СтрШаблон(
			НСтр("ru = 'Баннер формы ""%1"" должен иметь тип ""Группа Формы""'"),
			ИмяЭлементаФормы),
		Контекст);
	
	ПодчиненныеЭлементы = ПодчиненныеЭлементы(Баннер);
	
	Для каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
		Если ЭлементОбладаетСпециальнымОформлением(ПодчиненныйЭлемент) Тогда
			Продолжить; // Для некоторых элементов не требуется менять оформление
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, ПодчиненныйЭлемент.Имя, "ЦветТекста", ПараметрыОформления.ЦветТекста);
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоДекорацияГиперссылки(Знач ЭлементФормы)
	Возврат ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы")
		И ЭлементФормы.Вид = ВидДекорацииФормы.Надпись
		И ЭлементФормы.Гиперссылка;
КонецФункции

Функция ЭлементОбладаетСпециальнымОформлением(Знач ЭлементФормы)
	Возврат ЭтоДекорацияГиперссылки(ЭлементФормы);
КонецФункции

#КонецОбласти

#Область ВидимостьЭлементовФормы

// Скрывает элемент формы
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - Форма, на которой располагается скрываемый элемент
//  ИмяЭлементаФормы    - Строка                     - Имя элемента формы, который требуется скрыть
Процедура СкрытьЭлементФормы(Знач Форма, Знач ИмяЭлементаФормы)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, ИмяЭлементаФормы, "Видимость", Ложь);
КонецПроцедуры

#КонецОбласти

#Область ИерархияЭлементовФормы

Процедура ДобавитьПодчиненныеЭлементы(НакопленныеЭлементы, Знач ПодчиненныеЭлементы)
	
	Для каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ДобавитьПодчиненныеЭлементы(НакопленныеЭлементы, ПодчиненныйЭлемент.ПодчиненныеЭлементы);
		Иначе
			НакопленныеЭлементы.Добавить(ПодчиненныйЭлемент);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодчиненныеЭлементы(Знач ЭлементВладелец)
	
	Результат = Новый Массив;
	
	ДобавитьПодчиненныеЭлементы(Результат, ЭлементВладелец.ПодчиненныеЭлементы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
