
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РеестрВыданныхКлючейПЭП(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	ПараметрыФормы.Вставить("КлючВарианта", "РеестрВыданныхКлючейПростойЭлектроннойПодписи");
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "РеестрВыданныхКлючейПЭП");
	
	ОткрытьФорму("Отчет.РеестрКлючейПростыхЭлектронныхПодписейПОД.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрОтозванныхКлючейПЭП(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	ПараметрыФормы.Вставить("КлючВарианта", "РеестрОтозванныхКлючейПростойЭлектроннойПодписи");
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "РеестрОтозванныхКлючейПЭП");
	
	ОткрытьФорму("Отчет.РеестрКлючейПростыхЭлектронныхПодписейПОД.Форма", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьСоглашенияССотрудниками(Команда)
	
	СписокПользователей = Новый Массив;
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		ДанныеПользователя = Элементы.Список.ДанныеСтроки(СтрокаСписка);
		СписокПользователей.Добавить(ДанныеПользователя.Пользователь);
	КонецЦикла;
	
	ОформитьСоглашенияССотрудникамиАсинх(СписокПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПоложениеОбИспользованииПЭП(Команда)
	
	ОформитьПоложениеОбИспользованииПЭПАсинх();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФунции

&НаКлиенте
Асинх Процедура ОформитьСоглашенияССотрудникамиАсинх(СписокПользователей)
	
	Организация = Ждать ВвестиЗначениеАсинх(Организация, НСтр("ru = 'Выберите организацию'"));
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьФормуФормированияУведомленияОбИспользованииПЭП(
		Организация, СписокПользователей, ЭтотОбъект);
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура ОформитьПоложениеОбИспользованииПЭПАсинх()
	
	Организация = Ждать ВвестиЗначениеАсинх(Организация, НСтр("ru = 'Выберите организацию'"));
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьФормуФормированияПоложенияОбИспользованииПЭП(Организация, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
