#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьДекларируемоеИмущество
//
Процедура ОпределитьЕстьИмуществоПоКадастровойСтоимости(ЕстьИмуществоПоКадастровойСтоимости, Организация, НачалоПериода, КонецПериода) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьДекларируемоеИмущество
//
Процедура ОпределитьЕстьИмуществоПоСреднегодовойСтоимости(ЕстьИмуществоПоСреднегодовойСтоимости, Организация, НачалоПериода, КонецПериода) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.КатегорииПодчиненияЗемельныхУчастковПоВидамНалогов
//
Процедура ЗаполнитьКатегорииПодчиненияЗемельныхУчастковПоВидамНалогов(КатегорииПодчинения) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.КатегорииПодчиненияПатентовПоВидамНалогов
//
Процедура ЗаполнитьКатегорииПодчиненияПатентовПоВидамНалогов(КатегорииПодчинения) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьИмпортТоваровИзТаможенногоСоюза
//
Процедура ОпределитьЕстьИмпортТоваровИзТаможенногоСоюза(ЕстьИмпорт, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьЗаписиКнигиПродаж
//
Процедура ОпределитьЕстьЗаписиКнигиПродаж(ЕстьЗаписи, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьЗаписиКнигиПродажНалоговогоАгента
//
Процедура ОпределитьЕстьЗаписиКнигиПродажНалоговогоАгента(ЕстьЗаписи, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьИмуществоЕСГС
//
Процедура ОпределитьЕстьИмуществоЕСГС(ЕстьИмуществоЕСГС) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьОбъектыТорговогоСбора
//
Процедура ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период);
	
КонецПроцедуры 

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловияИсключенияПоТипуОрганизации
//
Процедура ОпределитьЭтоПлательщикНалогаНаПрибыль(ПлательщикНалогаНаПрибыль, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьИмущество
//
Процедура ОпределитьЕстьИмущество(ЕстьИмущество, Организация, НачалоПериода, КонецПериода) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьАкцизыИныеТовары
//
Процедура ОпределитьЕстьАкцизыИныеТовары(ЕстьАкцизыИныеТовары, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьАкцизыПоВидуТоваров
//
Процедура ОпределитьЕстьАкцизыПоВидуТоваров(ЕстьАкцизыПоВидуТоваров, Организация, Условие) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьАвансыПоАкцизам
//
Процедура ОпределитьЕстьАкцизыОбщийСрок(ЕстьАкцизыОбщийСрок, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьАвансыПоАкцизам
//
Процедура ОпределитьЕстьАкцизыЛьготныйСрок(ЕстьАкцизыЛьготныйСрок, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьАвансыПоАкцизам
//
Процедура ОпределитьЕстьАвансыПоАкцизам(ЕстьАвансыПоАкцизам, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьОстаткиИОборотыПоСчетуНДФЛ
//
Процедура ОпределитьЕстьОстаткиИОборотыПоСчетуНДФЛ(ЕстьОстаткиИОбороты, НачалоПериода, КонецПериода, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьНалогКУплатеПоДекларации3НДФЛ
//
Процедура ОпределитьЭтоПлательщикНДФЛ(ПлательщикНДФЛ, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьНалогКУплатеПоДекларации3НДФЛ
//
Процедура УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период) Экспорт
	
	ЗарплатаКадры.УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ОрганизацияЗарегистрированаТекущимДнем
//
Процедура УточнитьДатуРегистрацииОрганизации(ДатаРегистрации, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация) Экспорт
	
	ЗарплатаКадры.ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьКодОКОПФНекорректен(КодОКОПФНекорректен, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьЕстьЗадолженностьУчредителей(ЕстьЗадолженностьУчредителей, Организация, ТекущаяДата) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.ПрименяетсяАУСН
//
Процедура ОпределитьПрименяетсяАУСН(ПрименяетсяАУСН, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период) Экспорт

	ЗарплатаКадры.ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность) Экспорт
	
	ЗарплатаКадры.ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность) Экспорт
	
	ЗарплатаКадры.ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность);

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.СдаетсяОтчетностьСЗВ_СТАЖ
//
Процедура ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация) Экспорт
	
	ЗарплатаКадры.ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность) Экспорт
	
	ЗарплатаКадры.ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьСистемуНалогообложения(СистемаНалогообложенияСовпадает, Условие, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьПлательщикОтдельныхВидовНалогов(ПлательщикНалога, Условие, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьПорядокУплатыАвансовПоНалогуНаПрибыль(УсловиеВыполняется, Условие, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьВариантБухгалтерскойОтчетности(УсловиеВыполняется, Условие, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьЕстьТранспортныеСредства(ЕстьТранспортныеСредства, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьЕстьЗемельныеУчастки(ЕстьЗемельныеУчастки, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьЕстьЛьготыПоИмуществу(ЕстьЛьготыПоИмуществу, Организация, Период, Периодичность) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период) Экспорт

	ЗарплатаКадры.ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период) Экспорт
	
	ЗарплатаКадры.ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьУплачиватьДобровольныеВзносыВФСС(ДобровольныеВзносыВФСС, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьУпрощенныйЗачетФиксированныхСтраховыхВзносов(УпрощенныйЗачет, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия) Экспорт
	
	ЗарплатаКадры.ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьВозможнаСверкаНДСЗаПериод(ВозможнаСверкаНДСЗаПериод, Условие, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьВыставлениеСчетовФактурНеплательщикамиНДС(ВыставлениеСчетовФактурНеплательщикамиНДС, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода) Экспорт
	
	ЗарплатаКадры.ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьЭтоНекоммерческаяОрганизация(НекоммерческаяОрганизация, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьИспользуетсяОтчетностьВМинюст(УсловиеВыполняется, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьПрименяетсяУСНПатент(ПрименяетсяУСНПатент, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период) Экспорт
	
	ЗарплатаКадры.ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьЕстьВыплатыСотрудникамАУСН(ВыплатыСотрудникамАУСН, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНапоминатьОСменеОбъектаУСН(СменаОбъектаУСН, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНужноЗаявлениеОЗачетеВзносов(ЗаявлениеОЗачетеВзносов, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьУплачиваетсяВзносСДоходов(УплачиваетсяВзносСДоходов, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьЕжемесячныйПлатежНаЕНС(ЕжемесячныйПлатежНаЕНС, УсловияПримененияПравил, Организация, Период, Периодичность, ИспользуетсяТрудНаемныхРаботников) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьВыплатыИностраннымКонтрагентам(ВыплатыИностраннымКонтрагентам, Организация, НачалоПериода, КонецПериода) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов) Экспорт
	
	ЗарплатаКадры.ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов);
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьЕстьНастройкиУчетаНалогаНаПрибыль(ЕстьНастройкиУчетаНалогаНаПрибыль, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьВариантБухгалтерскойОтчетности(ВариантБухгалтерскойОтчетности, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.ОбновитьНастройкиУчетнойПолитики
//
Процедура ОпределитьВариантБухгалтерскойОтчетностиДействующейНастройки(Вариант, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьПорядокУплатыАвансовПоНалогуНаПрибыль(ПорядокУплаты, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.Настройка.ОбновитьНастройкиУчетаНалогаНаПрибыль
//
Процедура ОпределитьПорядокУплатыАвансовДействующейНастройки(Порядок, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата) Экспорт
	
	ЗарплатаКадры.ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьПлательщикТуристическогоНалога(ПлательщикТуристическогоНалога, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловияИсключенияПоТипуОрганизации
//
Процедура ДобавитьУсловияВидыПодакцизныхТоваров(УсловияИсключения) Экспорт
КонецПроцедуры

// Подробнее
// См. РегистрСведений.НалогиОтчеты.Форма.ДетальнаяНастройка.ПриСозданииНаСервере
//
Процедура ПроверитьЭтоВидПодакцизныхТоваровАлкогольнаяПродукция(Признак, Ссылка) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловияКоторымиПользовательУправляетНапрямую
//
Процедура ДополнитьУсловияКоторымиПользовательУправляетНапрямую(Условия) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловияЗадачаВключаетсяПользователем
//
Процедура ДополнитьУсловияЗадачаВключаетсяПользователем(Условия) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьУсловиеВыполняется(УсловиеВыполняется, Условие, Период, Периодичность, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется) Экспорт
	
	ЗарплатаКадры.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация) Экспорт
	
	ЗарплатаКадры.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьЗарегистрированУдержанныйАгентскийНДФЛ(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, ВтораяПоловинаМесяца) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНачисленыВзносыНаТравматизм(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНачисленыСтраховыеВзносы(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНачисленыСтраховыеВзносыЧленовЛетныхЭкипажейИлиШахтеров(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьНачисленыСтраховыеВзносыДобровольные(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьСтраховойСлучайВНиМ(УсловиеВыполняется, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьСтраховойСлучайБольничный(УсловиеВыполняется, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьДобровольныеПенсионныеВзносы(УсловиеВыполняется, Организация, Период) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьВыплатыСотрудникамАУСН(УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, ВтораяПоловинаМесяца) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ПроверитьЕстьГостиницы(ЕстьГостиницы, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательства.УсловиеВыполняется
//
Процедура ОпределитьДатуПереходаНаОСНО(ДатаПереходаНаОСНО, Организация, НачалоПериода, КонецПериода) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецЕсли
