////////////////////////////////////////////////////////////////////////////////
// Синхронизация Microsoft Exchange (вызов сервера)
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет проверку соединения учетной записи Exchange.
//
// Параметры:
//  Узел - ПланОбменаСсылка.СинхронизацияКалендарей - Узел пользователя Exchange.
//
// Возвращаемое значение:
//  Булево - Есть соединение с сервером.
//
Функция ПроверитьСоединение(Знач Узел) Экспорт
	
	Перем Результат;
	
	ОбработкаСинхронизация = Обработки.СинхронизацияMSExchange.Инициализировать(Узел);
	ОбработкаСинхронизация.ПроверитьСоединение(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти