////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицина".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. УправлениеШтатнымРасписанием.ОписаниеИсточниковСведенийОШтатномРасписании.
Процедура ДополнитьОписаниеИсточниковСведенийОШтатномРасписании(ОписаниеИсточников) Экспорт
	
	ДобавитьОписаниеСведенийДолжностиМедработника(ОписаниеИсточников);
	
КонецПроцедуры

// Добавляет в переданный отбор условие, ограничивающее выборку только медицинскими должности.
//
// Параметры:
//  Отбор - массив отборов.
//  ИмяКомандыЗаполнения	 - строка с именем команды заполнения (см. функцию ИмяКомандыЗаполненияПоВидуДолжности),
//  которое определяет необходимость установки отбора.
//
Процедура ДополнитьФильтрПоВидуДолжностейЗаполненияПозиций(ИмяКомандыЗаполнения, Отбор) Экспорт
	Если ИмяКомандыЗаполнения=ИмяКомандыЗаполненияПоВидуДолжности() Тогда 
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
				Отбор, "ЯвляетсяМедицинскойДолжностью", "=", Истина);
	КонецЕсли;
КонецПроцедуры

// Добавляет в переданный отбор условия, исключающие из выборки медицинские должности.
//
// Параметры:
//  Отбор - массив отборов.
//
Процедура ДополнитьФильтрПоПоОстальнымДолжностямЗаполненияПозиций(Отбор) Экспорт
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			Отбор, "ЯвляетсяМедицинскойДолжностью", "=", Ложь);
КонецПроцедуры

// Добавляет в массив команд заполнения данные команды для заполнения должностями медработников.
//
// Параметры:
//  КомандыЗаполнения - массив команд заполнения.
// 
// Возвращаемое значение:
//  Булево - Истина, если команда была добавлена.
//
Функция ДобавитьКомандуЗаполненияПоВидуДолжности(КомандыЗаполнения) Экспорт 
	
	Если РаботаВМедицинскомУчреждении() Тогда 
		КомандаЗаполнения = Новый Структура("Имя,Заголовок,Представление", 
											ИмяКомандыЗаполненияПоВидуДолжности(), 
											НСтр("ru = 'Заполнить позиции медработников'"),
											НСтр("ru = 'Заполнено позициями медработников'"));
		КомандыЗаполнения.Добавить(КомандаЗаполнения);
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗагрузкаКлассификаторов

Функция ВладелецТикета1СФНСИ() Экспорт
	Возврат "1C-FNSI";
КонецФункции

Функция ПолучитьТикетИПП(ВладелецТикета) Экспорт
    Результат = Новый Структура("Тикет,Ошибка", Неопределено, Неопределено);
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей"); 
		ИПППодключена = МодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		Если ИПППодключена Тогда
			СохраненныеДанные = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("ТикетИПП-" + ВладелецТикета, "Тикет,Момент");
			Если СохраненныеДанные = Неопределено Или 
					СохраненныеДанные.Тикет = Неопределено Или 
					СохраненныеДанные.Момент = Неопределено Или
					ТекущаяДатаСеанса() - СохраненныеДанные.Момент > 8*60*60 - 300 Тогда 
				РезультатЗапроса = МодульИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки(ВладелецТикета);
				Если РезультатЗапроса <> Неопределено И ЗначениеЗаполнено(РезультатЗапроса.Тикет) Тогда
					ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("ТикетИПП-" + ВладелецТикета, РезультатЗапроса.Тикет, "Тикет");
					ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("ТикетИПП-" + ВладелецТикета, ТекущаяДатаСеанса(), "Момент");
					Результат.Тикет = РезультатЗапроса.Тикет;
				Иначе 	
					Результат.Ошибка = НСтр("ru = 'Возможно, ваш уровень Интернет-поддержки пользователей не позволяет получать данные из 1С:ФНСИ.
					                              |Попробуйте отключить и снова подключить Интернет-поддержку пользователей.'");
				КонецЕсли;
			Иначе 
				Результат.Тикет = СохраненныеДанные.Тикет;
			КонецЕсли;
		Иначе 	
			Результат.Ошибка = НСтр("ru = 'Интернет-поддержка пользователей не подключена.'");
		КонецЕсли;
	Иначе 	
		Результат.Ошибка = НСтр("ru = 'Интернет-поддержка пользователей не поддерживается в конфигурации.'");
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ЗащитаПерсональныхДанных

// Процедура обеспечивает сбор сведений о хранении данных,
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации,
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	 ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияДляФРМР(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияДляФРМО(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияОРаботникахДляМедРегистра(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыКвалификацийДляФедеральныхМедрегистров(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыЛичныхДелДляФедеральныхМедрегистров(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыНаградДляФедеральныхМедрегистров(ТаблицаСведений);
	 ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыИдентификаторыСертификатовДляФедеральныхМедрегистров(ТаблицаСведений);
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных.
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхДляФРМР(ТаблицаСведений);
	ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхДляФРМО(ТаблицаСведений);
	ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхОРаботникахДляМедРегистра(ТаблицаСведений);
	ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений);
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальноеЗаполнениеИОбновлениеИБ

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
//
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.34";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("209fb775-f6a2-4d86-8436-b6f660bffc10");
	Обработчик.Процедура = "Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.ИсправитьНекорректныеКодыЭлементов";
	Обработчик.Комментарий = НСтр("ru = 'Исправляет неверно заполненные коды элементов некоторых классификаторов НСИ.'");
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.ОбщиеДанные = Ложь;  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.78";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Процедура = "МедицинскиеРегистры.ЗаполнитьПодключаемыеХарактеристики";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7901022c-469a-4dc4-96e4-d7d778e1dfd4");
	Обработчик.Комментарий = НСтр("ru = 'Обновление подключаемых характеристик медрегистра'");
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.79";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("658a58fe-04ff-409f-ad0a-b730f255a82c");
	Обработчик.Процедура = "Справочники.УчебныеЗаведения.ЗаполнитьПолноеНаименование";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита Полное наименование в справочнике Учебные заведения.'");
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.ОбщиеДанные = Ложь;  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.28.80";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a766be49-4bc6-4f53-91a1-9841072c3b39");
	Обработчик.Процедура = "РегистрыСведений.СертификатыПоСпециальностиФизическихЛиц.ЗаполнитьУчебноеЗаведениеИзКемВыдан";
	Обработчик.Комментарий = НСтр("ru = 'Заполнение реквизита Учебное заведение по данным реквизита Кем выдан из Сертификатов по специальности физических лиц.'");
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.ОбщиеДанные = Ложь;  
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.35.10";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f16977fa-6a88-4ad6-b6e6-002c2559ef2d");
	Обработчик.Процедура = "РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.ОбновитьПараметрыНастроекМедрегистров";
	Обработчик.Комментарий = НСтр("ru = 'Обновление настроек медрегистров.'");
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.НачальноеЗаполнение = Ложь;
	Обработчик.ОбщиеДанные = Ложь;  
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.ПриПолученииПредопределенныхНаборовСвойств(Наборы);
	КонецЕсли;
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf92-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.СведенияОРаботникахДляМедРегистра);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfbd-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.СведенияОШтатномРасписанииДляМедРегистра);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "4a6b9112-c35b-4f68-9744-4d4ce8d0fda9", Метаданные.Документы.СведенияДляФРМО);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "cff59589-07ed-4e01-8628-0a7d8b05a027", Метаданные.Документы.СведенияДляФРМР);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4cc-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.КлассификаторыМедРегистра);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "3dfefadd-24c2-4de2-b83c-2a8ebc7fbbaf", Метаданные.Справочники.КлассификаторыФедеральныхМедрегистров);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	КонецЕсли;
	
	// ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников
	Списки.Вставить(Метаданные.Документы.СведенияОРаботникахДляМедРегистра, Истина);
	Списки.Вставить(Метаданные.Документы.СведенияОШтатномРасписанииДляМедРегистра, Истина);
	Списки.Вставить(Метаданные.Документы.СведенияДляФРМО, Истина);
	Списки.Вставить(Метаданные.Документы.СведенияДляФРМР, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СведенияДляФедеральногоРегистраМедицинскихРаботников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СведенияОбОрганизацииДляМедРегистра, Истина);
	Списки.Вставить(Метаданные.Справочники.СведенияОРаботникахДляМедРегистраПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СведенияОШтатномРасписанииДляМедРегистраПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СведенияДляФРМОПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СведенияДляФРМРПрисоединенныеФайлы, Истина);
	// Конец ЗарплатаКадрыПриложения.Медицина.ФедеральныйРегистрМедицинскихРаботников
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОРаботникахДляМедРегистра",			"Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияОШтатномРасписанииДляМедРегистра",	"Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияДляФРМО",	"Дата", "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СведенияДляФРМР",	"Дата", "КадровыйУчет", "Организация");
	
КонецПроцедуры

#Область СправочникДолжности 

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма, ИмяГруппыДляВставки = "ГруппаМедицинскаяДолжность") Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СвойстваДолжностейМедицинскихРаботников", Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.СвойстваДолжностейМедицинскихРаботников"),,,Истина));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки); 
	ОписанияРесурсов = Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.Ресурсы;
	ПрефиксПутиКДанным = "СвойстваДолжностейМедицинскихРаботников";
	
	ДобавитьПолеВвода(Форма, ГруппаФормы, ОписанияРесурсов.Найти("ЯвляетсяМедицинскойДолжностью"), ПрефиксПутиКДанным);
	
	ДобавитьСпециальныеУсловияЗанятости(Форма, ИмяГруппыДляВставки);
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеДолжности(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников) Тогда
		Возврат;
	КонецЕсли;

	МенеджерЗаписи = РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Должность = Форма.Объект.Ссылка;
	МенеджерЗаписи.Прочитать();
	
	ЗначениеВДанныеФормы(МенеджерЗаписи, Форма.СвойстваДолжностейМедицинскихРаботников);
	
	ПрочитатьСпециальныеУсловияЗанятости(Форма, Форма.Объект.Ссылка);
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеДолжности(Форма, Ссылка) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СвойстваДолжностейМедицинскихРаботников) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СвойстваДолжностейМедицинскихРаботников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Должность.Установить(Ссылка);
	
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, Форма.СвойстваДолжностейМедицинскихРаботников);
	Запись.Должность = Ссылка;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.АвтоматическийРасчетСтажейФизическихЛиц") Тогда
		
		МодульАвтоматическийРасчетСтажейФизическихЛиц = ОбщегоНазначения.ОбщийМодуль("АвтоматическийРасчетСтажейФизическихЛиц");
		МодульАвтоматическийРасчетСтажейФизическихЛиц.УстановитьДополнительноеСвойствоПропуститьОбновлениеЗависимыхСтажей(НаборЗаписей.ДополнительныеСвойства);
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
	ЗаписатьСпециальныеУсловияЗанятости(Форма, Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СправочникШтатноеРасписание

Процедура ДополнитьФормуПозицииШтатногоРасписания(Форма, ИмяГруппыДляВставки = "ГруппаМедицина") Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
    ДобавитьСпециальныеУсловияЗанятости(Форма, ИмяГруппыДляВставки);
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеПозицииШтатногоРасписания(Форма) Экспорт
	
	ПрочитатьСпециальныеУсловияЗанятости(Форма, Форма.Объект.Ссылка);
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеДолжностиДляПозицииШтатногоРасписания(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьСпециальныеУсловияЗанятости(Форма, Форма.Объект.Должность);
	
	Для Каждого Строка Из Форма.СпециальныеУсловияЗанятости Цикл
		Строка.Должность = Форма.СсылкаНаОбъект;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеПозицииШтатногоРасписания(Форма, Позиция) Экспорт
	
	ЗаписатьСпециальныеУсловияЗанятости(Форма, Позиция);
	
КонецПроцедуры

#КонецОбласти

#Область СправочникПодразделенияОрганизаций 

Функция ОписаниеКлассификатораПодразделений() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Код", "1.2.643.5.1.13.13.99.2.114");
	Результат.Вставить("Наименование", "ФРМО. Справочник структурных подразделений");
	Результат.Вставить("ТипОбъектаМетаданных", "СправочникСсылка.ПодразделенияОрганизаций");
	Результат.Вставить("ПолеИдентификатор", "depart_oid");
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКлассификаторПодразделений(Создавать = Ложь) Экспорт
	
	ПараметрыКлассификатора = ОписаниеКлассификатораПодразделений();
	КлассификаторПодразделений = Справочники.КлассификаторыФедеральныхМедрегистров.ЭлементПоКоду(ПараметрыКлассификатора.Код);
	
	Если Создавать И Не ЗначениеЗаполнено(КлассификаторПодразделений) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОбъектСправочника = Справочники.КлассификаторыФедеральныхМедрегистров.СоздатьЭлемент();
		ОбъектСправочника.Код = ПараметрыКлассификатора.Код;
		ОбъектСправочника.ПолеИдентификатор = ПараметрыКлассификатора.ПолеИдентификатор;
		ОбъектСправочника.Наименование = ПараметрыКлассификатора.Наименование;
		ОбъектСправочника.Записать();
		КлассификаторПодразделений = ОбъектСправочника.Ссылка;
		
	КонецЕсли;
	
	Возврат КлассификаторПодразделений;
	
КонецФункции

Процедура ДополнитьФормуПодразделения(Форма, ИмяГруппыДляВставки = "ГруппаМедицина") Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
		
	ИменаРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, ИменаРеквизитовФормы);
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ХарактеристикаПодразделениеФРМО",
		Новый ОписаниеТипов("РегистрСведенийМенеджерЗаписи.ХарактеристикиОбъектовДляФедеральныхМедрегистров"),,,Истина));
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, ИменаРеквизитовФормы);
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки); 
	
	ОписанияРесурсов = Метаданные.РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.Ресурсы;
	ОписаниеРесурса = ОписанияРесурсов.Найти("Характеристика");
	
	Описание = Новый Структура();
	Описание.Вставить("Имя", ОписаниеРесурса.Имя);
	Описание.Вставить("Тип", ОписаниеРесурса.Тип);
	Описание.Вставить("Синоним", НСтр("ru='Подразделение ФРМО'"));
	Описание.Вставить("Подсказка", Неопределено);
	
	ПолеВвода = ДобавитьПолеВвода(Форма, ГруппаФормы, Описание, "ХарактеристикаПодразделениеФРМО");
	ПолеВвода.Ширина = 26;
	
	Описание = ОписаниеКлассификатораПодразделений();
	КлассификаторПодразделений = Справочники.КлассификаторыФедеральныхМедрегистров.ЭлементПоКоду(Описание.Код);
	
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.КодКлассификатора", Описание.Код));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", КлассификаторПодразделений));
	ПолеВвода.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
	СвязиПараметровВыбора = Новый Массив;
	СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Владелец"));
	ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
	Имя = "OIDПодразделения";
	ПолеНадписи = Форма.Элементы.Найти(Имя);
	Если ПолеНадписи = Неопределено Тогда
		ПолеНадписи = Форма.Элементы.Вставить(Имя, Тип("ПолеФормы"), ГруппаФормы);
		ПолеНадписи.ПутьКДанным = "ХарактеристикаПодразделениеФРМО.Характеристика.Код";
	КонецЕсли;
	ПолеНадписи.Вид = ВидПоляФормы.ПолеНадписи;
	ПолеНадписи.РастягиватьПоГоризонтали = Ложь;
	ПолеНадписи.Заголовок = "OID подразделения";
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеПодразделения(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров) Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторПодразделений = ПолучитьКлассификаторПодразделений();
	
	Если Не ЗначениеЗаполнено(КлассификаторПодразделений) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Форма.Объект.Ссылка;
	МенеджерЗаписи.Классификатор = КлассификаторПодразделений;
	МенеджерЗаписи.Прочитать();
	ЗначениеВДанныеФормы(МенеджерЗаписи, Форма.ХарактеристикаПодразделениеФРМО);
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеПодразделения(Форма, Ссылка) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров) Тогда
		Возврат;
	КонецЕсли;
	
	КлассификаторПодразделений = ПолучитьКлассификаторПодразделений();	
	
	Если Не ЗначениеЗаполнено(КлассификаторПодразделений) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	НаборЗаписей.Отбор.Классификатор.Установить(КлассификаторПодразделений);
	
	Если ЗначениеЗаполнено(Форма.ХарактеристикаПодразделениеФРМО.Характеристика) Тогда
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Форма.ХарактеристикаПодразделениеФРМО);
		Запись.Объект = Ссылка;
		Запись.Классификатор = КлассификаторПодразделений;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРеглотчетности

Процедура ПереопределитьЗапросПоОтраслевымУсловиям_ЕФС1(Запрос) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КадровыеДанные.Сотрудник КАК Сотрудник,
			|	КадровыеДанные.Должность КАК Должность,
			|	КадровыеДанные.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
			|	ЕСТЬNULL(СпециальныеУсловияЗанятостиПозиций.Код, ЕСТЬNULL(СпециальныеУсловияЗанятостиДолжностей.Код, ""0"")) КАК Код,
			|	ЕСТЬNULL(СпециальныеУсловияЗанятостиПозиций.Значение, ЕСТЬNULL(СпециальныеУсловияЗанятостиДолжностей.Значение, ""0"")) КАК Значение
			|ПОМЕСТИТЬ ВТОтраслевыеУсловия
			|ИЗ
			|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпециальныеУсловияЗанятостиДолжностей КАК СпециальныеУсловияЗанятостиДолжностей
			|		ПО КадровыеДанные.Должность = СпециальныеУсловияЗанятостиДолжностей.Должность
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпециальныеУсловияЗанятостиДолжностей КАК СпециальныеУсловияЗанятостиПозиций
			|		ПО КадровыеДанные.ДолжностьПоШтатномуРасписанию = СпециальныеУсловияЗанятостиПозиций.Должность
			|ГДЕ
			|	КадровыеДанные.Сотрудник = КадровыеДанные.ГоловнойСотрудник";
	Иначе
		Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КадровыеДанные.Сотрудник КАК Сотрудник,
			|	КадровыеДанные.Должность КАК Должность,
			|	ЕСТЬNULL(СпециальныеУсловияЗанятостиДолжностей.Код, ""0"") КАК Код,
			|	ЕСТЬNULL(СпециальныеУсловияЗанятостиДолжностей.Значение, ""0"") КАК Значение
			|ПОМЕСТИТЬ ВТОтраслевыеУсловия
			|ИЗ
			|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпециальныеУсловияЗанятостиДолжностей КАК СпециальныеУсловияЗанятостиДолжностей
			|		ПО КадровыеДанные.Должность = СпециальныеУсловияЗанятостиДолжностей.Должность
			|ГДЕ
			|	КадровыеДанные.Сотрудник = КадровыеДанные.ГоловнойСотрудник";
	КонецЕсли;
	
	Запрос.Текст = Текст;

КонецПроцедуры

Процедура ПереопределитьЗапросПоOID_ЕФС1(Запрос) Экспорт
	
	КлассификаторПодразделений = ПолучитьКлассификаторПодразделений();
	Если Не ЗначениеЗаполнено(КлассификаторПодразделений) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыеДанные.Подразделение КАК Подразделение,
		|	КадровыеДанные.Организация КАК Организация,
		|	ЕСТЬNULL(СведенияПоМедрегистру.Характеристика.Код, """") КАК OIDПодразделения,
		|	ЕСТЬNULL(ОписаниеЭлемента.Значение, """") КАК OIDОрганизации
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК СведенияПоМедрегистру
		|		ПО (СведенияПоМедрегистру.Объект = КадровыеДанные.Подразделение)
		|			И (СведенияПоМедрегистру.Классификатор = (&КлассификаторПодразделений))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ОписаниеЭлемента
		|		ПО (ОписаниеЭлемента.Ссылка = СведенияПоМедрегистру.Характеристика)
		|			И (ОписаниеЭлемента.Поле = ""mo_oid"")";
	
	Запрос.УстановитьПараметр("КлассификаторПодразделений", КлассификаторПодразделений);
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Параметры.ПараметрыПрограммы.ИспользоватьМедицинскоеУчреждение <> Константы.РаботаВМедицинскомУчреждении.Получить() Тогда
		Константы.РаботаВМедицинскомУчреждении.Установить(Параметры.ПараметрыПрограммы.ИспользоватьМедицинскоеУчреждение);
		Если Не Параметры.ПараметрыПрограммы.ИспользоватьМедицинскоеУчреждение Тогда 
			СброситьЗависимыеНастройкиЗарплатыМедицинскогоУчреждения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СброситьЗависимыеНастройкиЗарплатыМедицинскогоУчреждения()

	Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Установить(Ложь);
	Константы.ИспользоватьВыгрузкуВФедеральныеМедрегистры.Установить(Ложь);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		МодульТарификационнаяОтчетностьУчрежденийФМБА = ОбщегоНазначения.ОбщийМодуль("ТарификационнаяОтчетностьУчрежденийФМБА");
		МодульТарификационнаяОтчетностьУчрежденийФМБА.СброситьЗависимыеНастройкиЗарплатыМедицинскогоУчреждения();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.СброситьЗависимыеНастройкиЗарплатыМедицинскогоУчреждения();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АккредитацияСпециалистов") Тогда
		Константы.ИспользоватьАккредитациюСпециалистов.Установить(Ложь);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область НастройкаРасчетаЗарплаты

Процедура ДобавитьРеквизитыНастроекМедицинскойОрганизации(Форма) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаботаВМедицинскомУчреждении", Новый ОписаниеТипов("Булево"), , НСтр("ru='Работа в медицинском учреждении'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("РаботаВМедицинскомУчрежденииПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьВыгрузкуВФедеральныеМедрегистры", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать выгрузку в федеральный регистр медицинских работников (формат 2022 г.)'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьВыгрузкуВФедеральныеМедрегистрыПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать выгрузку в федеральный регистр медицинских работников (формат до 2017 г.)'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботниковПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьАккредитациюСпециалистов", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать аккредитацию специалистов'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьАккредитациюСпециалистовПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьДоступКНаркотическимСредствам", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать доступ к наркотическим средствам'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьДоступКНаркотическимСредствамПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА", Новый ОписаниеТипов("Булево"), , НСтр("ru='Использовать тарификационную отчетность учреждений ФМБА'")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБАПрежняя", Новый ОписаниеТипов("Булево"), , НСтр("ru=''")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
		
КонецПроцедуры

Процедура ДополнитьФормуНастроекКадровогоУчета(Форма) Экспорт
	
	Если Форма.Элементы.Найти("РаботаВМедицинскомУчреждении") = Неопределено Тогда
		
		ГруппаРабота = Форма.Элементы.ГруппаРаботаВМедицинскомУчреждении;
		ГруппаНастройки = Форма.Элементы.ГруппаНастройкиМедицинскогоУчреждения;
		
		ПолеФлажка = Форма.Элементы.Вставить("РаботаВМедицинскомУчреждении", Тип("ПолеФормы"), ГруппаРабота, ГруппаНастройки);
		ПолеФлажка.ПутьКДанным = "РаботаВМедицинскомУчреждении";
		ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_РаботаВМедицинскомУчрежденииПриИзменении");
		
		ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников", Тип("ПолеФормы"), ГруппаНастройки);
		ПолеФлажка.ПутьКДанным = "ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников";
		ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныеНастройкиМедицинскойОрганизацииПриИзменении");
		
		ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьВыгрузкуВФедеральныеМедрегистры", Тип("ПолеФормы"), ГруппаНастройки);
		ПолеФлажка.ПутьКДанным = "ИспользоватьВыгрузкуВФедеральныеМедрегистры";
		ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныеНастройкиМедицинскойОрганизацииПриИзменении");
		
		Если Форма.РаботаВБюджетномУчреждении И Форма.Элементы.Найти("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА") = Неопределено Тогда 
			
			ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА", Тип("ПолеФормы"), ГруппаНастройки);
			ПолеФлажка.ПутьКДанным = "ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА";
			ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
			ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныеНастройкиМедицинскойОрганизацииПриИзменении");
			
			ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьДоступКНаркотическимСредствам", Тип("ПолеФормы"), ГруппаНастройки);
			ПолеФлажка.ПутьКДанным = "ИспользоватьДоступКНаркотическимСредствам";
			ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
			ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныеНастройкиМедицинскойОрганизацииПриИзменении");
			
			ПолеФлажка = Форма.Элементы.Вставить("ИспользоватьАккредитациюСпециалистов", Тип("ПолеФормы"), ГруппаНастройки);
			ПолеФлажка.ПутьКДанным = "ИспользоватьАккредитациюСпециалистов";
			ПолеФлажка.Вид = ВидПоляФормы.ПолеФлажка;
			ПолеФлажка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			ПолеФлажка.УстановитьДействие("ПриИзменении", "Подключаемый_ДополнительныеНастройкиМедицинскойОрганизацииПриИзменении");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт
	
	Форма.РаботаВМедицинскомУчреждении = РаботаВМедицинскомУчреждении();
	Форма.РаботаВМедицинскомУчрежденииПрежняя = Форма.РаботаВМедицинскомУчреждении;
		
	Форма.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников = ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников");
	Форма.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботниковПрежняя = Форма.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников;
		
	Форма.ИспользоватьВыгрузкуВФедеральныеМедрегистры = ПолучитьФункциональнуюОпцию("ИспользоватьВыгрузкуВФедеральныеМедрегистры");
	Форма.ИспользоватьВыгрузкуВФедеральныеМедрегистрыПрежняя = Форма.ИспользоватьВыгрузкуВФедеральныеМедрегистры;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		МодульТарификационнаяОтчетностьУчрежденийФМБА = ОбщегоНазначения.ОбщийМодуль("ТарификационнаяОтчетностьУчрежденийФМБА");
		МодульТарификационнаяОтчетностьУчрежденийФМБА.НастройкиПрограммыВРеквизитыФормы(Форма);
	КонецЕсли;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.НастройкиПрограммыВРеквизитыФормы(Форма);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АккредитацияСпециалистов") Тогда
		Форма.ИспользоватьАккредитациюСпециалистов = ПолучитьФункциональнуюОпцию("ИспользоватьАккредитациюСпециалистов");
		Форма.ИспользоватьАккредитациюСпециалистовПрежняя = Форма.ИспользоватьАккредитациюСпециалистов;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДополнитьСтруктуруПараметровНастроек(СтруктураПараметров) Экспорт
	
	СтруктураПараметров.ПараметрыНастроек.Вставить("РаботаВМедицинскомУчреждении", Ложь);
	СтруктураПараметров.Вставить("РаботаВМедицинскомУчреждении");
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников");
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьВыгрузкуВФедеральныеМедрегистры", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьВыгрузкуВФедеральныеМедрегистры");
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА");
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьДоступКНаркотическимСредствам", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьДоступКНаркотическимСредствам");
	СтруктураПараметров.ПараметрыНастроек.Вставить("ИспользоватьАккредитациюСпециалистов", Ложь);
	СтруктураПараметров.Вставить("ИспользоватьАккредитациюСпециалистов");
	
КонецПроцедуры

Процедура ЗначенияСохраняемыхРеквизитовФормыНастройкаПрограммы(Форма, Параметры) Экспорт
	
	Параметры.РаботаВМедицинскомУчреждении = Форма.РаботаВМедицинскомУчреждении;  
	Параметры.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников = Форма.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников;  
	Параметры.ИспользоватьВыгрузкуВФедеральныеМедрегистры = Форма.ИспользоватьВыгрузкуВФедеральныеМедрегистры;  
	Параметры.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА = Форма.ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА;  
	Параметры.ИспользоватьДоступКНаркотическимСредствам = Форма.ИспользоватьДоступКНаркотическимСредствам;  
	Параметры.ИспользоватьАккредитациюСпециалистов = Форма.ИспользоватьАккредитациюСпециалистов;  
	
КонецПроцедуры

Процедура ЗаписатьНастройкиЗарплатыМедицинскогоУчреждения(НастройкиПриложения) Экспорт

	ПараметрыНастроек = НастройкиПриложения.ПараметрыНастроек;
	
	Если ПараметрыНастроек.РаботаВМедицинскомУчреждении Тогда
		Константы.РаботаВМедицинскомУчреждении.Установить(НастройкиПриложения.РаботаВМедицинскомУчреждении);
	КонецЕсли;
		
	Если ПараметрыНастроек.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников Тогда
		Константы.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников.Установить(НастройкиПриложения.ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников);
	КонецЕсли;
		
	Если ПараметрыНастроек.ИспользоватьВыгрузкуВФедеральныеМедрегистры Тогда
		Константы.ИспользоватьВыгрузкуВФедеральныеМедрегистры.Установить(НастройкиПриложения.ИспользоватьВыгрузкуВФедеральныеМедрегистры);
	КонецЕсли;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
		МодульТарификационнаяОтчетностьУчрежденийФМБА = ОбщегоНазначения.ОбщийМодуль("ТарификационнаяОтчетностьУчрежденийФМБА");
		МодульТарификационнаяОтчетностьУчрежденийФМБА.ЗаписатьНастройкиЗарплатыМедицинскогоУчреждения(НастройкиПриложения);
	КонецЕсли;
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.ЗаписатьНастройкиЗарплатыМедицинскогоУчреждения(НастройкиПриложения);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АккредитацияСпециалистов") Тогда
		Если ПараметрыНастроек.ИспользоватьАккредитациюСпециалистов Тогда
			Константы.ИспользоватьАккредитациюСпециалистов.Установить(НастройкиПриложения.ИспользоватьАккредитациюСпециалистов);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьПоказательОтчетаПоНастройкам(ТаблицаПоказателей) Экспорт
	
	Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "РаботаВМедицинскомУчреждении", 
		"Рассчитывается зарплата в медицинском учреждении", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 1);	
		
	Если ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда			
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
			Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА", 
				"Использовать тарификационную отчетность учреждений ФМБА", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 2);	
		КонецЕсли;
		Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьВыгрузкуВФедеральныйРегистрМедицинскихРаботников", 
			"Использовать выгрузку в федеральный регистр медицинских работников", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 3);	
		Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьВыгрузкуВФедеральныеМедрегистры", 
			"Использовать выгрузку в федеральные медрегистры (версия 2)", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 4);	
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
			Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьДоступКНаркотическимСредствам", 
				"Использовать доступ к наркотическим средствам", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 5);	
		КонецЕсли;
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АккредитацияСпециалистов") Тогда
			Отчеты.НастройкиПрограммыЗарплатаКадры.ДобавитьПоказатель(ТаблицаПоказателей, "Константы", "ИспользоватьАккредитациюСпециалистов", 
				"Использовать аккредитацию специалистов", "Расчет зарплаты", "Работа в медицинском учреждении", "Ложь", 4, 8, 6);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РаботаВМедицинскомУчреждении() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении");
	
КонецФункции

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, имеющие непредопределенные элементы.
	// В модуле менеджера таких объектов должна быть определена функция ПоляЕстественногоКлюча, 
	// составляющая массив полей для однозначной идентификации элемента.
	Типы.Добавить(Метаданные.Справочники.КлассификаторыМедРегистра);
	Типы.Добавить(Метаданные.Справочники.ЭлементыКлассификаторовМедРегистра);
	
КонецПроцедуры

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	
	НазначениеРолей.ТолькоДляПользователейСистемы.Добавить(Метаданные.Роли.НастройкаМедрегистраОбщиеДанные.Имя);

КонецПроцедуры

Функция ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапросаКомпоновки) Экспорт
	
	Запрос = Неопределено;
	
	Если ВРег(ИмяПредставления) = ВРег("СертификатыПоСпециальностиФизическихЛиц") Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо,
		|	СертификатыПоСпециальностиФизическихЛиц.Специальность,
		|	СертификатыПоСпециальностиФизическихЛиц.ДатаПолучения,
		|	СертификатыПоСпециальностиФизическихЛиц.ДействуетПо,
		|	СертификатыПоСпециальностиФизическихЛиц.Серия,
		|	СертификатыПоСпециальностиФизическихЛиц.Номер,
		|	СертификатыПоСпециальностиФизическихЛиц.УчебноеЗаведение,
		|	ВТСотрудники.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ Представления_СертификатыПоСпециальностиФизическихЛиц
		|ИЗ
		|	ВТОсновныеСотрудники КАК ВТСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СертификатыПоСпециальностиФизическихЛиц КАК СертификатыПоСпециальностиФизическихЛиц
		|		ПО ВТСотрудники.ФизическоеЛицо = СертификатыПоСпециальностиФизическихЛиц.ФизическоеЛицо";
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СведенияОбАккредитацияхСпециалистов") Тогда
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОбАккредитацияхСпециалистов.ФизическоеЛицо,
		|	СведенияОбАккредитацияхСпециалистов.Специальность,
		|	СведенияОбАккредитацияхСпециалистов.ДатаПротокола,
		|	СведенияОбАккредитацияхСпециалистов.ВидПроцедуры,
		|	СведенияОбАккредитацияхСпециалистов.ПрофессиональныйСтандарт,
		|	СведенияОбАккредитацияхСпециалистов.НомерПротокола,
		|	СведенияОбАккредитацияхСпециалистов.МестоПроведения,
		|	СведенияОбАккредитацияхСпециалистов.ДействуетДо,
		|	СведенияОбАккредитацияхСпециалистов.РегистрационныйНомерСвидетельства,
		|	СведенияОбАккредитацияхСпециалистов.ДатаВыдачиСвидетельства,
		|	СведенияОбАккредитацияхСпециалистов.УровеньОбразования,
		|	СведенияОбАккредитацияхСпециалистов.СпециальностьПоОбразованию,
		|	СведенияОбАккредитацияхСпециалистов.ВидДеятельности,
		|	ВТСотрудники.Сотрудник КАК Сотрудник,
		|	ВТСотрудники.Должность КАК Должность
		|ПОМЕСТИТЬ Представления_СведенияОбАккредитацияхСпециалистов
		|ИЗ
		|	ВТОсновныеСотрудники КАК ВТСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбАккредитацияхСпециалистов КАК СведенияОбАккредитацияхСпециалистов
		|		ПО ВТСотрудники.ФизическоеЛицо = СведенияОбАккредитацияхСпециалистов.ФизическоеЛицо";
	КонецЕсли;
	
	Возврат Запрос;	
	
КонецФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.СведенияОРаботникахДляМедРегистра);
	СписокОбъектов.Добавить(Документы.СведенияОШтатномРасписанииДляМедРегистра);
	СписокОбъектов.Добавить(Документы.СведенияДляФРМО);
	СписокОбъектов.Добавить(Документы.СведенияДляФРМР);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ДоступКНаркотическимСредствам") Тогда
		МодульДоступКНаркотическимСредствам = ОбщегоНазначения.ОбщийМодуль("ДоступКНаркотическимСредствам");
		МодульДоступКНаркотическимСредствам.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	
КонецПроцедуры

Функция НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета) 
	
	ОписаниеПоказателя = Справочники.ПоказателиРасчетаЗарплаты.ОписаниеПоказателя();
	ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = '% надб.'");
	ОписаниеПоказателя.ЗначениеРассчитываетсяАвтоматически = Ложь;
	ОписаниеПоказателя.Предопределенный = Ложь;
	ОписаниеПоказателя.СпособПримененияЗначений = Перечисления.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное;
	ОписаниеПоказателя.Точность = 2;
	ОписаниеПоказателя.НачальнаяНастройка = ПараметрыПланаВидовРасчета.НачальнаяНастройкаПрограммы;

	Возврат ОписаниеПоказателя;

КонецФункции

Процедура СоздатьПоказателиМедицинскихУчреждений(НастройкиРасчетаЗарплаты, ПараметрыПланаВидовРасчета) Экспорт 
	
	СоздаватьПоказатели = РаботаВМедицинскомУчреждении();
	
	ПоказателиРасчетаЗарплатыМенеджер = Справочники.ПоказателиРасчетаЗарплаты;

	ПараметрыПоказателей = ПараметрыПланаВидовРасчета.ПараметрыПоказателей;
	СозданныеЭлементы    = ПараметрыПланаВидовРасчета.СсылкиПоказателиРасчетаЗарплаты;
	
	Если СоздаватьПоказатели И НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку Тогда 
		
		// Процент надбавки за квалификационную категорию
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаКатегорию";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за квалификационную категорию'");
		ОписаниеПоказателя.Предопределенный = Истина;
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
	Иначе 
		ПоказателиРасчетаЗарплатыМенеджер.ОтключитьИспользованиеПредопределенногоЭлемента("ПроцентНадбавкиЗаКатегорию");
	КонецЕсли;
	
	Если СоздаватьПоказатели Тогда 
		
		// Процент надбавки за ученую степень
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаУченуюСтепень";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за ученую степень'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// Процент надбавки за почетное звание
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаПочетноеЗвание";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за почетное звание'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
				
		// Процент надбавки за классность и езду водителей
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентНадбавкиЗаЕзду";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент надбавки за классность и езду'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		// Понижающий процент к окладу
		ОписаниеПоказателя = НовоеОписаниеПоказателя(ПараметрыПланаВидовРасчета);
		ОписаниеПоказателя.Идентификатор = "ПроцентСниженияОклада";
		ОписаниеПоказателя.Наименование = НСтр("ru = 'Процент снижения оклада'");
		ОписаниеПоказателя.КраткоеНаименование = НСтр("ru = '% сниж.'");
		ПоказателиРасчетаЗарплатыМенеджер.ЗаписатьПоказатель(ОписаниеПоказателя, СозданныеЭлементы);
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина.ТарификационнаяОтчетностьУчрежденийФМБА") Тогда
			МодульТарификационнаяОтчетностьУчрежденийФМБА = ОбщегоНазначения.ОбщийМодуль("ТарификационнаяОтчетностьУчрежденийФМБА");
			МодульТарификационнаяОтчетностьУчрежденийФМБА.ОбновитьДанныеРегистраНастройкаПоказателейТарификацииМедРаботников();
		КонецЕсли;
	
	Иначе 
		
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаУченуюСтепень");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаПочетноеЗвание");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентНадбавкиЗаЕзду");
		ПоказателиРасчетаЗарплатыМенеджер.НачальнаяНастройкаОтключитьИспользованиеПоказателя(СозданныеЭлементы, "ПроцентСниженияОклада");
		
	КонецЕсли;

КонецПроцедуры

Функция НовоеОписаниеНачисления(СвойстваНачислений, ЗависимоеВторогоУровня = Ложь) 
	
	Категории = Новый Массив;
	Категории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);

	ВидыВремени = Новый Массив;
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ОтработанноеВПределахНормы);
	ВидыВремени.Добавить(Перечисления.ВидыРабочегоВремениСотрудников.ЧасовоеОтработанноеВПределахНормы);

	ОтборБазовых = Новый Структура;
	ОтборБазовых.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", Категории);
	ОтборБазовых.Вставить("ВидВремени", ВидыВремени);
	ОтборБазовых.Вставить("ТребуетсяРасчетБазы", ЗависимоеВторогоУровня);	

	Описание = ПланыВидовРасчета.Начисления.ОписаниеНачисления();
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.СвойстваПоКатегории	= СвойстваНачислений[Описание.КатегорияНачисленияИлиНеоплаченногоВремени];
	Описание.ВидВремени 			= Перечисления.ВидыРабочегоВремениСотрудников.ДополнительноОплачиваемоеВПределахНормы;
	Описание.ВидНачисленияДляНУ		= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.ОтборБазовых 			= ОтборБазовых;
	Описание.КлючевыеСвойства 		= "Ссылка";

	Возврат Описание;

КонецФункции

Процедура СоздатьНачисленияМедицинскихУчреждений(НастройкиРасчетаЗарплаты, КоллекторНачислений, СвойстваНачислений, ПараметрыПланаВидовРасчета) Экспорт 
	
	СоздаватьНачисления = РаботаВМедицинскомУчреждении();
	
	НачисленияМенеджер = ПланыВидовРасчета.Начисления;
	
	// Надбавка за квалификационную категорию (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаКвалификационнуюКатегориюПроцентом";
	
	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НККП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за квалификационную категорию'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Квалиф. категория'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаКатегорию / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаКатегорию");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления И НастройкиРасчетаЗарплаты.ИспользоватьКвалификационнуюНадбавку Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

	// Надбавка за ученую степень (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаУченуюСтепеньПроцентом";
	
	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НУСП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за ученую степень'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Ученая степень'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаУченуюСтепень / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаУченуюСтепень");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

	// Надбавка за почетное звание (процентом)
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаПочетноеЗваниеПроцентом";

	Описание = НовоеОписаниеНачисления(СвойстваНачислений);
	Описание.Код					= НСтр("ru = 'НПЗП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за почетное звание'");
	Описание.КраткоеНаименование 	= НСтр("ru = 'Почетное звание'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаПочетноеЗвание / 100";
	Описание.ЗапрашиваемыеПоказатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПроцентНадбавкиЗаПочетноеЗвание");
	Описание.СсылкаНаОбъект 		 = ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
				
	// Надбавка за классность и езду
	ИмяНачисленияПриНачальнойНастройке = "НадбавкаЗаЕзду";

	Описание = НовоеОписаниеНачисления(СвойстваНачислений, Истина);
	Описание.Код					= НСтр("ru = 'НКЕП'");
	Описание.Наименование			= НСтр("ru = 'Надбавка за классность и езду'");
	Описание.КраткоеНаименование	= НСтр("ru = 'Езда'");
	Описание.ФормулаРасчета 		= "РасчетнаяБаза * ПроцентНадбавкиЗаЕзду / 100";
	Описание.СсылкаНаОбъект 		= ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке];
	
	Если СоздаватьНачисления Тогда
		НачисленияМенеджер.СоздатьИзменитьНачисленияПоОписанию(КоллекторНачислений, Описание);
		ПараметрыПланаВидовРасчета.СсылкиНачисленийУдержаний[ИмяНачисленияПриНачальнойНастройке] = Описание.СсылкаНаОбъект;
	Иначе
		Описание.Вставить("Ссылка", Описание.СсылкаНаОбъект);
		НачисленияМенеджер.ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;

КонецПроцедуры

#Область События

Процедура ДокументыМедРегистраПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяДокумента = Источник.Метаданные().Имя;
	
	Если Не Источник.ПометкаУдаления Тогда
		
		Документы[ИмяДокумента].ОбработкаФормированияФайла(Источник);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодтверждениеКвалификацииМедицинскихРаботников

Функция ЭтоАттестацияМедицинскихРаботников(ВидАттестации) Экспорт
	Возврат ВидАттестации = ВидАттестацииМедицинскихРаботников();
КонецФункции 

Функция ВидАттестацииМедицинскихРаботников() Экспорт
	Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников");
КонецФункции

Процедура СоздатьВидАттестацииМедицинскихРаботников() Экспорт
	
	Если РаботаВМедицинскомУчреждении() Тогда
		
		ВидАттестацииСсылка = ВидАттестацииМедицинскихРаботников();
		
		Если ЗначениеЗаполнено(ВидАттестацииСсылка) Тогда
			ВидАттестации =  ВидАттестацииСсылка.ПолучитьОбъект();
		Иначе
			ВидАттестации = Справочники.ВидыАттестацийСотрудников.СоздатьЭлемент();
			ВидАттестации.ИмяПредопределенныхДанных = "ПодтверждениеКвалификацииМедицинскихРаботников";
		КонецЕсли;
		
		ВидАттестации.Наименование = НСтр("ru = 'Подтверждение квалификации медицинских работников'");
		ВидАттестации.ЭтоВнешняяАттестация = Истина;
		ВидАттестации.ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности;
		ВидАттестации.Периодичность = Перечисления.Периодичность.Год;
		ВидАттестации.КоличествоПериодов = 5;
		ВидАттестации.ИспользоватьОграничениеПоМаксимальномуВозрасту = Ложь;
		ВидАттестации.ИспользоватьОграничениеПоМинимальномуСрокуРаботы = Ложь;
		ВидАттестации.Записать();
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаОписанияАттестаций(ТекстЗапроса) Экспорт
	
	Если ВидАттестацииМедицинскихРаботников() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаОписанияАттестаций();
	
КонецПроцедуры

Процедура ДополнитьТекстЗапросаДолжностиВидовАттестаций(ТекстЗапроса) Экспорт
	
	Если ВидАттестацииМедицинскихРаботников() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + " ОБЪЕДИНИТЬ ВСЕ " + ТекстЗапросаДолжностиВидовАттестаций();
	
КонецПроцедуры

Функция АттестационныеЛистыСотрудников(ПриказыОбАттестации, ОбъектыПечати) Экспорт
	
	Возврат Обработки.ПечатьКадровыхПриказовМедицинскихОрганизаций.АттестационныеЛистыМедицинскихРаботников(ПриказыОбАттестации, ОбъектыПечати);

КонецФункции

Процедура ДобавитьКомандыПечатиПриказаОбАттестации(КомандыПечати) Экспорт
	Если РаботаВМедицинскомУчреждении() Тогда 
		ДобавитьКомандуПечатиОтчетаОПрофессиональнойДеятельности(КомандыПечати);
		ДобавитьКомандуПечатиЗаявленияОПодтвержденииКвалификации(КомандыПечати);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьКомандуПечатиОтчетаОПрофессиональнойДеятельности(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовМедицинскихОрганизаций";
	КомандаПечати.Идентификатор = "ПФ_MXL_ОтчетОПрофессиональнойДеятельности";
	КомандаПечати.Представление = НСтр("ru = 'Отчет о профессиональной деятельности (титульный лист)'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
КонецПроцедуры

Процедура ДобавитьКомандуПечатиЗаявленияОПодтвержденииКвалификации(КомандыПечати)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьКадровыхПриказовМедицинскихОрганизаций";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявлениеОПодтвержденииКвалификации";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на подтверждение квалификации по специальности'");
	КомандаПечати.СписокФорм = "ФормаДокумента";
КонецПроцедуры

Функция ТекстОписанияВидаАттестацииМедицинскихРаботников() Экспорт
	Возврат НСтр("ru = 'Аттестации подлежат все сотрудники, работающие на должностях, являющихся должностями медицинских работников.'");
КонецФункции 

#КонецОбласти

#Область СпециальныеУсловияЗанятости

Процедура ДобавитьСпециальныеУсловияЗанятости(Форма, ИмяГруппыДляВставки)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СпециальныеУсловияЗанятостиПредставление", Новый ОписаниеТипов("Строка")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СпециальныеУсловияЗанятости", Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СпециальныеУсловияЗанятостиДолжностей")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	ГруппаФормы = Форма.Элементы.Найти(ИмяГруппыДляВставки); 
	
	ИмяГруппы = "ГруппаСпециальныеУсловияЗанятости";
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	Если Группа = Неопределено Тогда
		Группа = Форма.Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаФормы);
	КонецЕсли;
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	Имя = "СпециальныеУсловияЗанятостиПредставление";
	ПолеНадписи = Форма.Элементы.Найти(Имя);
	Если ПолеНадписи = Неопределено Тогда
		ПолеНадписи = Форма.Элементы.Вставить(Имя, Тип("ПолеФормы"), Группа);
		ПолеНадписи.ПутьКДанным = "СпециальныеУсловияЗанятостиПредставление";
		ПолеНадписи.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеНадписи.РастягиватьПоГоризонтали = Истина;
		ПолеНадписи.Заголовок = НСтр("ru = 'Специальные условия занятости (медицина)'");
	КонецЕсли;
	
	ИмяКоманды = "СпециальныеУсловияЗанятостиИзменить";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
		НоваяКоманда.Действие = "Подключаемый_СпециальныеУсловияЗанятостиИзменить";
		НоваяКоманда.Заголовок = НСтр("ru = 'Изменить'");
	КонецЕсли;
	
	Имя = "СпециальныеУсловияЗанятостиИзменить";
	Кнопка = Форма.Элементы.Найти(Имя);
	Если Кнопка = Неопределено Тогда
		Кнопка = Форма.Элементы.Вставить(Имя, Тип("КнопкаФормы"), Группа);
		Кнопка.Вид = ВидКнопкиФормы.Гиперссылка;
		Кнопка.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьСпециальныеУсловияЗанятости(Форма, Должность)
	
	Если Не РаботаВМедицинскомУчреждении()
		Или Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.СпециальныеУсловияЗанятостиКоллекция(Должность);
	Форма.СпециальныеУсловияЗанятости.Загрузить(Набор);
	
	Форма.СпециальныеУсловияЗанятостиПредставление =
		РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.ПредставлениеКоллекцииЗаписей(Набор);
	
КонецПроцедуры

Процедура ЗаписатьСпециальныеУсловияЗанятости(Форма, Ссылка)
	
	Если Не РаботаВМедицинскомУчреждении()
		Или Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СпециальныеУсловияЗанятостиДолжностей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Должность.Установить(Ссылка);
	Для Каждого Строка Из Форма.СпециальныеУсловияЗанятости Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.Должность = Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

Функция ДобавитьПолеВвода(Форма, ГруппаФормы, ОписаниеСвойства, ПрефиксПутиКДанным = Неопределено, ВариантОтображениеПодсказки = Неопределено)
	
	ПолеВвода = Форма.Элементы.Найти(ОписаниеСвойства.Имя);
	
	Если НЕ ПолеВвода = Неопределено Тогда
		Возврат ПолеВвода;
	КонецЕсли;
	
	ПолеВвода 				= Форма.Элементы.Вставить(ОписаниеСвойства.Имя, Тип("ПолеФормы"), ГруппаФормы);
	ПолеВвода.ПутьКДанным 	= ?(ПрефиксПутиКДанным = Неопределено, "", ПрефиксПутиКДанным + ".") + ОписаниеСвойства.Имя;
	
	Если ОписаниеСвойства.Тип = Новый ОписаниеТипов("Булево") Тогда
		ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
		ПолеВвода.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Иначе
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	
	ПолеВвода.Заголовок = ОписаниеСвойства.Синоним;
	ПолеВвода.Подсказка = ОписаниеСвойства.Подсказка;
	
	Если НЕ ВариантОтображениеПодсказки = Неопределено Тогда
		ПолеВвода.ОтображениеПодсказки = ВариантОтображениеПодсказки;
	КонецЕсли;
	
	ПолеВвода.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	Возврат ПолеВвода;
	
КонецФункции

Функция ТекстЗапросаОписанияАттестаций()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыАттестацийСотрудников.Ссылка КАК ВидАттестации,
	|	ВидыАттестацийСотрудников.ТипАттестации,
	|	ВидыАттестацийСотрудников.ЭтоВнешняяАттестация,
	|	ВидыАттестацийСотрудников.Периодичность,
	|	ВидыАттестацийСотрудников.КоличествоПериодов,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМинимальномуВозрасту,
	|	ВидыАттестацийСотрудников.ВозрастДоКоторогоСотрудникНеПодлежитАттестации,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМаксимальномуВозрасту,
	|	ВидыАттестацийСотрудников.ВозрастПослеКоторогоСотрудникНеПодлежитАттестации,
	|	ВидыАттестацийСотрудников.ИспользоватьОграничениеПоМинимальномуСрокуРаботы,
	|	ВидыАттестацийСотрудников.ПериодичностьМинимальногоСрокаРаботы,
	|	ВидыАттестацийСотрудников.КоличествоПериодовМинимальногоСрокаРаботы,
	|	ВидыАттестацийСотрудников.АттестовыватьВсеДолжностиСпециальности,
	|	ИСТИНА КАК ОтборПоДолжности
	|ИЗ
	|	Справочник.ВидыАттестацийСотрудников КАК ВидыАттестацийСотрудников
	|ГДЕ
	|	ВидыАттестацийСотрудников.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДолжностиВидовАттестаций()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВидыАттестацийСотрудников.Ссылка КАК ВидАттестации,
	|	Должности.Ссылка КАК Должность
	|ИЗ
	|	Справочник.ВидыАттестацийСотрудников КАК ВидыАттестацийСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
	|			ПО Должности.Ссылка = СвойстваДолжностейМедицинскихРаботников.Должность
	|				И (СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью)
	|		ПО (ВидыАттестацийСотрудников.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыАттестацийСотрудников.ПодтверждениеКвалификацииМедицинскихРаботников))";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Свойства должностей медицинских работников

Функция ИмяФункциональнойОпцииПоИмениДанныхСотрудника(Знач ИмяПоля) Экспорт
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	Если ИмяПоляВВерхнемРегистре = ВРег("ЯвляетсяМедицинскойДолжностью") Тогда
		Возврат "РаботаВМедицинскомУчреждении";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ДобавитьТекстыЗапросовВТСвойстваДолжностейМедицинскихРаботников(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ИсточникиДанных) Экспорт
	
	СвойстваДолжностейМедицинскихРаботников = ИсточникиДанных.Получить("СвойстваДолжностейМедицинскихРаботников");
	Если СвойстваДолжностейМедицинскихРаботников = Истина Тогда
		
		ЧастиЗапроса = Новый Массив;
		ЧастиЗапроса.Добавить(Запрос.Текст);
		
		ЧастиЗапроса.Добавить(
			"	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
			|	ПО (КадроваяИсторияСотрудников.Должность = СвойстваДолжностейМедицинскихРаботников.Должность)}");
		
		Запрос.Текст = СтрСоединить(ЧастиЗапроса, Символы.ПС);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьПолеСвойствДолжностейМедицинскихРаботников(ИмяПоля, ТекстыОписанияПолей, ИсточникиДанных) Экспорт
	
	ДобавленоПолеСведений = Ложь;
	Если НеобходимыСвойстваДолжностейМедицинскихРаботников(ИмяПоля) Тогда
		
		ДобавленоПолеСведений = Истина;
		КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "СвойстваДолжностейМедицинскихРаботников");
		КадровыйУчет.ДобавитьВКоллекциюИмяКадровыхДанных(ИсточникиДанных, "БазовыеКадровыеДанныеСотрудников", "Должность");
		
		ПутьКДанным = ПутьКДаннымСвойствДолжностейМедицинскихРаботников(ИмяПоля);
		ТекстыОписанияПолей.Добавить(ПутьКДанным + " КАК " + ИмяПоля);
		
	КонецЕсли;
	
	Возврат ДобавленоПолеСведений;
	
КонецФункции

Функция НеобходимыСвойстваДолжностейМедицинскихРаботников(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	Если РаботаВМедицинскомУчреждении() Тогда
		Возврат ИмяПоляВВерхнемРегистре = ВРег("ЯвляетсяМедицинскойДолжностью");
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПутьКДаннымСвойствДолжностейМедицинскихРаботников(Знач ИмяПоля)
	
	ИмяПоляВВерхнемРегистре = ВРег(ИмяПоля);
	
	ПутьКДанным = "";
	
	Если ИмяПоляВВерхнемРегистре = ВРег("ЯвляетсяМедицинскойДолжностью") Тогда
		ПутьКДанным = "	ЕСТЬNULL(СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью, ЛОЖЬ)";
	КонецЕсли;
	
	Возврат ПутьКДанным;
	
КонецФункции

// Сведения о стаже

Функция НеобходимыСведенияОМедицинскомСтаже(Знач ИмяПоля) Экспорт
	
	ИмяПоля = ВРег(ИмяПоля);
	
	Возврат ИмяПоля = ВРег("МедицинскийСтажВид")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажПериодРегистрации")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажРазмерМесяцев")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажРазмерДней")
		ИЛИ ИмяПоля = ВРег("МедицинскийСтажДней")
		ИЛИ	ИмяПоля = ВРег("МедицинскийСтажМесяцев")
		ИЛИ	ИмяПоля = ВРег("МедицинскийСтажЛет");
		
КонецФункции

Функция ПутьКДаннымСведенийОСтаже(Знач ИмяПоля) Экспорт
	
	ИмяПоля = ВРег(ИмяПоля);
	
	ИмяТаблицы = КадровыйУчетРасширенный.ИмяТаблицыПоКатегорииСтажа(Перечисления.КатегорииСтажа.Медицинский);
	
	Если ИмяПоля = ВРег("МедицинскийСтажВид") Тогда
		Возврат ИмяТаблицы + ".ВидСтажа";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажПериодРегистрации") Тогда
		Возврат ИмяТаблицы + ".ПериодРегистрации";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажРазмерМесяцев") Тогда
		Возврат ИмяТаблицы + ".РазмерМесяцев";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажРазмерДней") Тогда
		Возврат ИмяТаблицы + ".РазмерДней";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажДней") Тогда
		Возврат ИмяТаблицы + ".Дней";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажМесяцев") Тогда
		Возврат ИмяТаблицы + ".Месяцев";
	ИначеЕсли ИмяПоля = ВРег("МедицинскийСтажЛет") Тогда
		Возврат ИмяТаблицы + ".Лет";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ОписаниеСтажаДляОпределенияКритериевПоискаСотрудников() Экспорт
	
	Возврат Новый Структура("КатегорияСтажа,Идентификатор", Перечисления.КатегорииСтажа.Медицинский, "МедицинскийСтаж");
	
КонецФункции

Процедура ДополнитьВидамиСтажаДолжностей(Должность, ВидыСтажаДолжностей) Экспорт
	
	Если РаботаВМедицинскомУчреждении() Тогда
		
		Запрос = Новый Запрос;
		
		Если ТипЗнч(Должность) = Тип("СправочникСсылка.ШтатноеРасписание") Тогда
			Запрос.УстановитьПараметр("Должность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность, "Должность"));
		Иначе
			Запрос.УстановитьПараметр("Должность", Должность);
		КонецЕсли;
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью КАК ЯвляетсяМедицинскойДолжностью
			|ИЗ
			|	РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
			|ГДЕ
			|	СвойстваДолжностейМедицинскихРаботников.Должность = &Должность
			|	И СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСтажаДолжностей, ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДолжностиСАвтоматическимУчетомПрерыванияСтажей() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СвойстваДолжностейМедицинскихРаботников.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
		|ГДЕ
		|	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностиФормы(Форма) Экспорт
	
	Если Не РаботаВМедицинскомУчреждении() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажейПоСвойствамДолжностей(Форма.СвойстваДолжностейМедицинскихРаботников);
	
КонецФункции

Функция ВидыСтажейПоСвойствамДолжностей(СвойствамДолжностей) Экспорт
	
	Если СвойствамДолжностей.ЯвляетсяМедицинскойДолжностью Тогда
		ВидыСтажаДолжностей = ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста();
	Иначе
		ВидыСтажаДолжностей = Новый Массив;
	КонецЕсли;
	
	Возврат ВидыСтажаДолжностей;
	
КонецФункции

Функция ВидыСтажейДолжностейСАвтоматическимПрерываниемРоста() Экспорт
	
	Возврат Справочники.ВидыСтажа.ВидыСтажаПоКатегории(Перечисления.КатегорииСтажа.Медицинский);
	
КонецФункции

Процедура ЗаполнитьПоляПредставленийКадровыхДанныхФизическихЛиц(ДополнительныеПоляПредставлений, ПутьКПолямЛичныхДанных, ИсключаемыеПоля) Экспорт
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "МедицинскийСтажЛет";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямЛичныхДанных + ".СведенияОСтажах.МедицинскийСтаж.Лет";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "МедицинскийСтажМесяцев";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямЛичныхДанных + ".СведенияОСтажах.МедицинскийСтаж.Месяцев";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
	
	ОписаниеПоля = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеДополнительногоПоляПредставлений();
	ОписаниеПоля.ИмяПоля = "МедицинскийСтажДней";
	ОписаниеПоля.ПустоеЗначениеНаЯзыкеЗапросов = "0";
	ОписаниеПоля.ПутьПоляСКД = ПутьКПолямЛичныхДанных + ".СведенияОСтажах.МедицинскийСтаж.Дней";
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьПолеПредставления(ДополнительныеПоляПредставлений, ОписаниеПоля, ИсключаемыеПоля);
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияДляФРМР(ТаблицаСведений)
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияДляФРМР";
	НовыеСведения.ПоляРегистрации	= СтрЗаменить(
		"Работники.ФизическоеЛицо,
		|ДокументыУдостоверяющиеЛичность.ФизическоеЛицо,
		|ЛичноеДело.ФизическоеЛицо,
		|ОбщееОбразование.ФизическоеЛицо,
		|ПрофессиональноеОбразование.ФизическоеЛицо,
		|ПослевузовскоеОбразование.ФизическоеЛицо,
		|ДополнительноеПрофессиональноеОбразование.ФизическоеЛицо,
		|Награды.ФизическоеЛицо,
		|Квалификация.ФизическоеЛицо,
		|Сертификаты.ФизическоеЛицо", Символы.ПС, "");
	НовыеСведения.ПоляДоступа		= "";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	ПоляДоступа = "";
	ПоляИсключаемыеИзПерсональныхДанных = "ФизическоеЛицо,";
	ТабличныеЧасти = Метаданные.Документы.СведенияДляФРМР.ТабличныеЧасти;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя+".";
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			
			ИмяРеквизита = Реквизит.Имя;
			Если СтрНайти(ПоляИсключаемыеИзПерсональныхДанных,ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			ПоляДоступа = ПоляДоступа + "," + ИмяТабличнойЧасти+ИмяРеквизита;
			
		КонецЦикла;
	КонецЦикла;
	
	ПоляДоступа = Сред(ПоляДоступа,2);
	НовыеСведения.ПоляДоступа = ПоляДоступа;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияДляФРМО(ТаблицаСведений)
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияДляФРМО";
	НовыеСведения.ПоляРегистрации	= "ДанныеНачислений.Сотрудник,ДанныеУдержаний.Сотрудник";
	НовыеСведения.ПоляДоступа		= "";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	ПоляДоступа = "";
	ПоляИсключаемыеИзПерсональныхДанных = "Сотрудник,Подразделение,ИдентификаторПодразделения,ИдентификаторОтделения,Должность,ФедеральнаяДолжностьФРМР,";
	ТабличныеЧасти = Метаданные.Документы.СведенияДляФРМО.ТабличныеЧасти;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя+".";
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			
			ИмяРеквизита = Реквизит.Имя;
			Если СтрНайти(ПоляИсключаемыеИзПерсональныхДанных,ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			ПоляДоступа = ПоляДоступа + "," + ИмяТабличнойЧасти+ИмяРеквизита;
			
		КонецЦикла;
	КонецЦикла;
	
	ПоляДоступа = Сред(ПоляДоступа,2);
	НовыеСведения.ПоляДоступа = ПоляДоступа;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхДокументаСведенияОРаботникахДляМедРегистра(ТаблицаСведений)
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияОРаботникахДляМедРегистра";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.ФизическоеЛицо,Образование.ФизическоеЛицо,Сертификаты.ФизическоеЛицо,Переподготовка.ФизическоеЛицо,ПовышениеКвалификации.ФизическоеЛицо,"
		+ "ПослевузовскоеОбразование.ФизическоеЛицо,КвалификационныеКатегории.ФизическоеЛицо,Награды.ФизическоеЛицо,ЛичноеДело.Сотрудник,Неявки.Сотрудник,Невыходы.Сотрудник,ФактическиОтработанноеВремя.Сотрудник";
	НовыеСведения.ПоляДоступа		= "";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	ПоляДоступа = "";
	ПоляИсключаемыеИзПерсональныхДанных = "Сотрудник,ФизическоеЛицо,";
	ТабличныеЧасти = Метаданные.Документы.СведенияОРаботникахДляМедРегистра.ТабличныеЧасти;
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя+".";
		Для Каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			
			ИмяРеквизита = Реквизит.Имя;
			Если СтрНайти(ПоляИсключаемыеИзПерсональныхДанных,ИмяРеквизита) Тогда
				Продолжить;
			КонецЕсли;
			ПоляДоступа = ПоляДоступа + "," + ИмяТабличнойЧасти+ИмяРеквизита;
			
		КонецЦикла;
	КонецЦикла;
	
	ПоляДоступа = Сред(ПоляДоступа,2);
	НовыеСведения.ПоляДоступа = ПоляДоступа;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СертификатыПоСпециальностиФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Специальность,ДатаПолучения,ДействуетПо,Серия,Номер,УчебноеЗаведение,УдалитьКемВыдан";
	НовыеСведения.ОбластьДанных		= "Образование";
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыКвалификацийДляФедеральныхМедрегистров(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Специальность,ДатаПрисвоения";
	НовыеСведения.ОбластьДанных		= "Профессия";
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыЛичныхДелДляФедеральныхМедрегистров(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "УИНОрганизации,ТабельныйНомер,ДатаНачалаЗаписи";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыНаградДляФедеральныхМедрегистров(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ИдентификаторыНаградДляФедеральныхМедрегистров";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Награда,ДатаПриказа,НомерПриказа";
	НовыеСведения.ОбластьДанных		= "Награды";
КонецПроцедуры

Процедура ЗаполнитьСведенияОПерсональныхДанныхРегистраСведенийИдентификаторыИдентификаторыСертификатовДляФедеральныхМедрегистров(ТаблицаСведений)
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Специальность,ДатаПолучения";
	НовыеСведения.ОбластьДанных		= "Образование";
КонецПроцедуры

Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхДляФРМР(ТаблицаСведений)
	
	МетаданныеОбъекта = Метаданные.Документы.СведенияДляФРМР;
	
	ТабличнаяЧастьРаботники = МетаданныеОбъекта.ТабличныеЧасти.Работники.Реквизиты;
	ТабличнаяЧастьДокументы = МетаданныеОбъекта.ТабличныеЧасти.ДокументыУдостоверяющиеЛичность.Реквизиты;
	ТабличнаяЧастьЛичноеДело = МетаданныеОбъекта.ТабличныеЧасти.ЛичноеДело.Реквизиты;
	ТабличнаяЧастьОбщееОбразование = МетаданныеОбъекта.ТабличныеЧасти.ОбщееОбразование.Реквизиты;
	ТабличнаяЧастьПрофессиональноеОбразование = МетаданныеОбъекта.ТабличныеЧасти.ПрофессиональноеОбразование.Реквизиты;
	ТабличнаяЧастьПослевузовскоеОбразование = МетаданныеОбъекта.ТабличныеЧасти.ПослевузовскоеОбразование.Реквизиты;
	ТабличнаяЧастьДополнительноеПрофессиональноеОбразование =
		МетаданныеОбъекта.ТабличныеЧасти.ДополнительноеПрофессиональноеОбразование.Реквизиты;
	ТабличнаяЧастьСертификаты = МетаданныеОбъекта.ТабличныеЧасти.Сертификаты.Реквизиты;
	ТабличнаяЧастьНаграды = МетаданныеОбъекта.ТабличныеЧасти.Награды.Реквизиты;
	ТабличнаяЧастьКвалификация = МетаданныеОбъекта.ТабличныеЧасти.Квалификация.Реквизиты;
	
	// ТабличнаяЧастьРаботники
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьРаботники.Фамилия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.Имя.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.Отчество.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТабличнаяЧастьРаботники.ДатаРождения.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ДатаМестоРождения";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ТабличнаяЧастьРаботники.СтраховойНомерПФР.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "СНИЛС";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТабличнаяЧастьРаботники.ИНН.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ИНН";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьРаботники.ОтношениеКВоинскойОбязанности.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.ОтношениеКВоинскойОбязанностиФРМР.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ВоинскийУчет";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьРаботники.НомерТелефона.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.НомерТелефонаПредставление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресЭлектроннойПочты.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресЭлектроннойПочтыПредставление.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьРаботники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресПостояннойРегистрацииПредставление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресПостояннойРегистрации.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресМестаПроживанияПредставление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.АдресМестаПроживания.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьРаботники.ДатаРегистрации.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	
	// ТабличнаяЧастьДокументы
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьДокументы.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьДокументы.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДокументы.Номер.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДокументы.ДатаВыдачи.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДокументы.КемВыдан.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДокументы.КодПодразделения.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ПаспортныеДанные";
	
	// ТабличнаяЧастьЛичноеДело
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьЛичноеДело.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТабличнаяЧастьЛичноеДело.Фамилия.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ФИО";
	
	// ТабличнаяЧастьОбщееОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьОбщееОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьОбщееОбразование.ОбразованиеРаботника.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбщееОбразование.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбщееОбразование.СерияАттестата.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбщееОбразование.НомерАттестата.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбщееОбразование.ДатаВыдачиАттестата.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьПрофессиональноеОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьПрофессиональноеОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ОбразованиеРаботника.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ВидОбразования.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ВидОбразованияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.УчебноеЗаведениеФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.Специальность.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.СпециальностьФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.КвалификацияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.Начало.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.Окончание.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.СерияДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.НомерДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ДатаВыдачиДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ЗаказчикЦелевогоОбученияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПрофессиональноеОбразование.ПричинаРасторженияФРМР.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьПослевузовскоеОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьПослевузовскоеОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ОбразованиеРаботника.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ВидОбразования.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ВидОбразованияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Начало.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Окончание.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.СерияДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.НомерДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ДатаВыдачиДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.УчебноеЗаведениеФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ЗаказчикЦелевогоОбученияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ПричинаРасторженияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.СпециальностьОрдинатурыФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.СпециальностьДокторантурыФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.УченаяСтепеньФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ОтрасльНаукиФРМР.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьДополнительноеПрофессиональноеОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.ОбразованиеРаботника.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.ВидОбразования.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.ВидОбразованияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.УчебноеЗаведениеФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.Специальность.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.СпециальностьФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.Тематика.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.СерияДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.НомерДиплома.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДополнительноеПрофессиональноеОбразование.ДатаВыдачиДиплома.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьСертификаты
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСертификаты.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСертификаты.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.УчебноеЗаведениеФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.Специальность.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.СпециальностьФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.ДатаПолучения.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.ДействуетПо.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.Номер.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьНаграды
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьНаграды.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьНаграды.Награда.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьНаграды.НаградаФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьНаграды.ДатаПриказа.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьНаграды.НомерПриказа.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Награды";
	
	// ТабличнаяЧастьКвалификация
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьКвалификация.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьКвалификация.РазрядКатегория.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьКвалификация.РазрядКатегорияФРМР.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьКвалификация.ДатаПрисвоения.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьКвалификация.ДатаОкончания.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьКвалификация.Специальность.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьКвалификация.СпециальностьФРМР.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Профессия";
	
КонецПроцедуры

Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхДляФРМО(ТаблицаСведений)
	
	МетаданныеОбъекта = Метаданные.Документы.СведенияДляФРМО;
	
	ТабличнаяЧастьДанныеНачислений = МетаданныеОбъекта.ТабличныеЧасти.ДанныеНачислений.Реквизиты;
	ТабличнаяЧастьДанныеУдержаний = МетаданныеОбъекта.ТабличныеЧасти.ДанныеУдержаний.Реквизиты;
	
	// ТабличнаяЧастьДанныеНачислений
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьДанныеНачислений.Сотрудник.ПолноеИмя();
	Поля = Новый Массив;
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.ИдентификаторЗанятости.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.ИдентификаторЛичногоДела.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.НазначениеНачисления.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.Начисление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.СуммаНачисления.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеНачислений.КФО.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
	
	// ТабличнаяЧастьДанныеУдержаний
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьДанныеУдержаний.Сотрудник.ПолноеИмя();
	Поля = Новый Массив;
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.ИдентификаторЗанятости.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.ИдентификаторЛичногоДела.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.НазначениеУдержания.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.Удержание.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.СуммаУдержания.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьДанныеУдержаний.КФО.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Доходы";
		
КонецПроцедуры

Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхОРаботникахДляМедРегистра(ТаблицаСведений)
	
	МетаданныеОбъекта = Метаданные.Документы.СведенияОРаботникахДляМедРегистра;
	
	ТабличнаяЧастьОбразование = МетаданныеОбъекта.ТабличныеЧасти.Образование.Реквизиты;
	ТабличнаяЧастьСотрудники = МетаданныеОбъекта.ТабличныеЧасти.Сотрудники.Реквизиты;
	ТабличнаяЧастьНаграды = МетаданныеОбъекта.ТабличныеЧасти.Награды.Реквизиты;
	ТабличнаяЧастьСертификаты = МетаданныеОбъекта.ТабличныеЧасти.Сертификаты.Реквизиты;
	ТабличнаяЧастьПереподготовка = МетаданныеОбъекта.ТабличныеЧасти.Переподготовка.Реквизиты;
	ТабличнаяЧастьПовышениеКвалификации = МетаданныеОбъекта.ТабличныеЧасти.ПовышениеКвалификации.Реквизиты;
	ТабличнаяЧастьПослевузовскоеОбразование = МетаданныеОбъекта.ТабличныеЧасти.ПослевузовскоеОбразование.Реквизиты;
	ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц = МетаданныеОбъекта.ТабличныеЧасти.УдалитьОбразованиеФизическихЛиц.Реквизиты;
	
	// ТабличнаяЧастьОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьОбразование.ГодОкончания.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбразование.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьОбразование.Номер.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьСотрудники
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСотрудники.Фамилия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.Имя.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.Отчество.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ФИО";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТабличнаяЧастьСотрудники.ДатаРождения.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ДатаМестоРождения";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ТабличнаяЧастьСотрудники.СтраховойНомерПФР.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "СНИЛС";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	НовыеСведения.Поля = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТабличнаяЧастьСотрудники.ИНН.ПолноеИмя());
	НовыеСведения.КатегорияДанных = "ИНН";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСотрудники.ДокументСерия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.ДокументНомер.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.ДокументДатаВыдачи.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.ДокументКемВыдан.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "ПаспортныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСотрудники.ТелефонПредставление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.Телефон.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "КонтактнаяИнформация";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСотрудники.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСотрудники.АдресПоПропискеПредставление.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСотрудники.АдресПоПрописке.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "МестоРегистрацииПроживания";
	
	// ТабличнаяЧастьНаграды
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьНаграды.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьНаграды.Наименование.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьНаграды.ДатаПриказа.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьНаграды.НомерПриказа.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Награды";
	
	// ТабличнаяЧастьСертификаты
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьСертификаты.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьСертификаты.ДатаПолучения.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьСертификаты.Номер.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьПереподготовка
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьПереподготовка.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьПереподготовка.ГодПрохождения.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПереподготовка.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПереподготовка.Номер.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьПовышениеКвалификации
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьПовышениеКвалификации.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьПовышениеКвалификации.НаименованиеКурса.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПовышениеКвалификации.ГодПрохождения.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПовышениеКвалификации.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПовышениеКвалификации.Номер.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПовышениеКвалификации.ДатаПолучения.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.Номер.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.НаименованиеКурса.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.Квалификация.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.ДатаВыдачи.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.Начало.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьУдалитьОбразованиеФизическихЛиц.Окончание.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
	// ТабличнаяЧастьПослевузовскоеОбразование
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = ТабличнаяЧастьПослевузовскоеОбразование.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Начало.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Окончание.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Серия.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.Номер.ПолноеИмя());
	Поля.Добавить(ТабличнаяЧастьПослевузовскоеОбразование.ДатаПолучения.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
КонецПроцедуры

Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанныхСертификатыПоСпециальностиФизическихЛиц(ТаблицаСведений)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СертификатыПоСпециальностиФизическихЛиц;
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект = МетаданныеОбъекта.ПолноеИмя();
	НовыеСведения.ПолеСубъект = МетаданныеОбъекта.Измерения.ФизическоеЛицо.ПолноеИмя();
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(МетаданныеОбъекта.Ресурсы.ДействуетПо.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.Серия.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.Номер.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.УчебноеЗаведение.ПолноеИмя());
	Поля.Добавить(МетаданныеОбъекта.Реквизиты.УдалитьКемВыдан.ПолноеИмя());
	НовыеСведения.Поля = Поля;
	НовыеСведения.КатегорияДанных = "Образование";
	
КонецПроцедуры

#Область НастройкиВариантовОтчетов

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СертификатыПоСпециальностиФизическихЛиц);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.РеестрыСтимулирующихВыплатМедицинскимИСоциальнымРаботникам);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АккредитацииСпециалистов);
		
КонецПроцедуры

#КонецОбласти

#Область ИсточникСведенийОШтатномРасписании

Процедура ДобавитьОписаниеСведенийДолжностиМедработника(ОписаниеИсточников)
	
	ИдентификаторИсточника = "РегистрСведенийСвойстваДолжностейМедицинскихРаботников";
	ОписаниеИсточника = УправлениеШтатнымРасписанием.ОписаниеИсточникаСведений(ОписаниеИсточников, ИдентификаторИсточника);
	
	ИмяДанныхШР = "ЯвляетсяМедицинскойДолжностью";
	ПутьКДаннымШР = "ЕСТЬNULL(" + ИдентификаторИсточника + "." + ИмяДанныхШР + ", ЛОЖЬ)";
	УправлениеШтатнымРасписанием.ДобавитьОписаниеСведенийШтатногоРасписания(ОписаниеИсточников, ИмяДанныхШР, ИдентификаторИсточника, ПутьКДаннымШР);
	
	Если ОписаниеИсточников.ЗначенияОпций.ИспользоватьИсториюИзмененияШтатногоРасписания Тогда
		
		ОписаниеИсточника.ТекстСоединений = "
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК РегистрСведенийСвойстваДолжностейМедицинскихРаботников
			|		ПО РегистрСведенийИсторияИспользованияШтатногоРасписания.ПозицияШтатногоРасписания.Должность = РегистрСведенийСвойстваДолжностейМедицинскихРаботников.Должность}";
		
	Иначе
		
		ОписаниеИсточника.ТекстСоединений = "
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК РегистрСведенийСвойстваДолжностейМедицинскихРаботников
			|		ПО СправочникШтатноеРасписание.Ссылка = РегистрСведенийСвойстваДолжностейМедицинскихРаботников.Должность}";
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяКомандыЗаполненияПоВидуДолжности()
	Возврат "ЗаполнитьПозицииМедработников";
КонецФункции

#КонецОбласти

#КонецОбласти