#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Охрана труда";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Рабочие места охраны труда", СтатистикаРабочихМестОхраныТруда());
	Статистика.Вставить("Рабочие места(Назначение рабочих мест сотрудникам)", СтатистикаРабочихМест());
	Статистика.Вставить("Сотрудники(Назначение рабочих мест сотрудникам)", СтатистикаСотрудников());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Назначение рабочих мест сотрудникам", СтатистикаНазначенийРабочихМестСотрудникам(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаРабочихМестОхраныТруда()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РабочиеМестаОхраныТруда.Ссылка) КАК РабочихМест
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаОхраныТруда
		|ГДЕ
		|	РабочиеМестаОхраныТруда.ВАрхиве = ЛОЖЬ
		|	И РабочиеМестаОхраныТруда.ПометкаУдаления = ЛОЖЬ";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Рабочих мест", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("РабочихМест")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаНазначенийРабочихМестСотрудникам(НачалоПериода)
	
	Таблица = Метаданные.Документы.НазначениеРабочихМестСотрудникам;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Назначений рабочих мест";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.СтандартныеРеквизиты.Дата;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Ответственный;
	ДанныеГруппировки.ПредставлениеГруппировки = "Ответственных";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.Подразделение;
	ДанныеГруппировки.ПредставлениеГруппировки = "Подразделений";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаРабочихМест()
	
	Родитель = Метаданные.Документы.НазначениеРабочихМестСотрудникам;
	Таблица = Родитель.ТабличныеЧасти.РабочиеМеста;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.РабочееМесто;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Рабочих мест";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Назначение рабочего места";
	ДанныеГруппировки.ПредставлениеГруппировки = "Назначений рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаСотрудников()
	
	Родитель = Метаданные.Документы.НазначениеРабочихМестСотрудникам;
	Таблица = Родитель.ТабличныеЧасти.Сотрудники;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Реквизиты.Сотрудник;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Сотрудников";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Родитель.СтандартныеРеквизиты.Ссылка;
	ДанныеГруппировки.ПредставлениеОднойГруппы = "Назначение рабочего места";
	ДанныеГруппировки.ПредставлениеГруппировки = "Назначений рабочих мест";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	ДанныеСтатистики.ПроверкиОбъекта.Проведение = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики, Истина);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти
