
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы(Параметры) Экспорт
	
	Если Параметры.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПриЗапуске = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если Не ПараметрыПриЗапуске.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаПрервана = Ложь;
	
	Если Не ПараметрыПриЗапуске.Свойство("ВыгрузкаЗагрузкаДанныхЗагрузкаПрервана", ЗагрузкаПрервана) Тогда
		 ЗагрузкаПрервана = ВыгрузкаЗагрузкаДанныхВызовСервера.ЗагрузкаПрервана(); 
	КонецЕсли;
	
	Если Не ЗагрузкаПрервана Тогда
		Возврат;
	КонецЕсли;
		
	Параметры.ИнтерактивнаяОбработка = Новый ОписаниеОповещения(
		"ПоказатьДиалогПрерваннойЗагрузкиПередНачаломРаботыСистемы",
		ЭтотОбъект);
	
КонецПроцедуры

Процедура ПоказатьДиалогПрерваннойЗагрузкиПриНеобходимости() Экспорт
	
	ЗагрузкаПрервана = ВыгрузкаЗагрузкаДанныхВызовСервера.ЗагрузкаПрервана();
	
	Если Не ЗагрузкаПрервана Тогда
		Возврат;	
	КонецЕсли;
	 
	ПоказатьДиалогПрерваннойЗагрузки();
		
КонецПроцедуры

Процедура ПоказатьДиалогПрерваннойЗагрузкиПередНачаломРаботыСистемы(Параметры, ДополнительныеПараметры) Экспорт
	
	ПоказатьДиалогПрерваннойЗагрузки();
	
КонецПроцедуры

Процедура ВопросОПрерваннойЗагрузкеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаДанныхИзСервиса",
		Новый Структура("ПрерванаПроцедураЗагрузки", Истина),,,,,,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПоказатьДиалогПрерваннойЗагрузки()

	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Процедура загрузки была прервана'");
		
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения(
		"ВопросОПрерваннойЗагрузкеЗавершение",
		ЭтотОбъект);

	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОписаниеОповещенияОЗавершении,
		НСтр("ru = 'Для продолжения нужно будет снова указать файл, из которого загружались данные.'"),
		РежимДиалогаВопрос.ОК,
		ПараметрыВопроса);
		
КонецПроцедуры

#КонецОбласти
