
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеПараметраВидКвоты = Неопределено;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Параметры.ДополнительныеПараметры.Свойство("ВидКвоты", ЗначениеПараметраВидКвоты) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, "Объект.ВидКвоты", ЗначениеПараметраВидКвоты);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтаФорма.Элементы, "ВидКвоты", "Доступность", Ложь);
	КонецЕсли;
	
КонецПроцедуры
