#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("УстановитьДопустимыйПерерывВРаботе");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	РазделыДанных = Новый Массив;
	РазделыДанных.Добавить("УправленческиеДанные");
	РазделыДанных.Добавить("ПодборПерсонала");
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНастройки(ДополнительныеНастройкиУправленияПерсоналом) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НаборЗаписей.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НаборЗаписей[0], ДополнительныеНастройкиУправленияПерсоналом);
	Если ОбновлениеИнформационнойБазы.ЭтоВызовИзОбработчикаОбновления() Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Иначе
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьНастройкиПоУмолчанию() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НаборЗаписей.Добавить();
	КонецЕсли;
	
	СтрокаНабора = НаборЗаписей[0];
	ЗаполнитьЗначенияСвойств(СтрокаНабора, НастройкиПоУмолчанию());
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура СброситьНастройки() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НаборЗаписей.Добавить();
	КонецЕсли;
	
	СтрокаНабора = НаборЗаписей[0];
	ЗаполнитьЗначенияСвойств(СтрокаНабора, НастройкиПоУмолчанию());
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ЗначенияНастроек() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ДополнительныеНастройкиУправленияПерсоналом.ДопустимыйПерерывВРаботе, 1) КАК ДопустимыйПерерывВРаботе,
		|	ЕСТЬNULL(ДополнительныеНастройкиУправленияПерсоналом.ЕдиницаИзмеренияДопустимогоПерерываВРаботе, ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)) КАК ЕдиницаИзмеренияДопустимогоПерерываВРаботе
		|ИЗ
		|	РегистрСведений.ДополнительныеНастройкиУправленияПерсоналом КАК ДополнительныеНастройкиУправленияПерсоналом";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МетаданныеРегистра = Метаданные.РегистрыСведений.ДополнительныеНастройкиУправленияПерсоналом;
		Возврат ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(МенеджерЗаписи, МетаданныеРегистра);
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура УстановитьДопустимыйПерерывВРаботе(ПараметрыОбновления) Экспорт
	
	Если ЗначениеЗаполнено(ЗначенияНастроек().ЕдиницаИзмеренияДопустимогоПерерываВРаботе) Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ДополнительныеНастройкиУправленияПерсоналом");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ДополнительныеНастройкиУправленияПерсоналом = ЗначенияНастроек();
		ЗаполнитьЗначенияСвойств(ДополнительныеНастройкиУправленияПерсоналом, НастройкиПоУмолчанию());
		УстановитьНастройки(ДополнительныеНастройкиУправленияПерсоналом);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление информационной базы.Не удалось зафиксировать транзакцию'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

Функция НастройкиПоУмолчанию()
	
	НастройкиПоУмолчанию = Новый Структура;
	НастройкиПоУмолчанию.Вставить("ДопустимыйПерерывВРаботе", 1);
	НастройкиПоУмолчанию.Вставить("ЕдиницаИзмеренияДопустимогоПерерываВРаботе", Перечисления.Периодичность.Месяц);
	
	Возврат НастройкиПоУмолчанию;
	
КонецФункции

#КонецОбласти

#КонецЕсли