
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	Элементы.ФорматированнаяСтрока.Заголовок = Параметры.ФорматированнаяСтрока;
	Если ЗначениеЗаполнено(Параметры.ЗаголовокКнопкиЗакрыть) Тогда
		Элементы.Закрыть.Заголовок = Параметры.ЗаголовокКнопкиЗакрыть;
	КонецЕсли;
	
	Если ИнтерфейсПользователяБЭДКлиентСервер.ЭтоИнтерфейсВерсия8_5() Тогда
		Элементы.Переместить(Элементы.Закрыть, КоманднаяПанель);
		Элементы.Закрыть.Видимость = Не СокрЛП(Элементы.Закрыть.Заголовок) = НСтр("ru='Закрыть'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФорматированнаяСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	Если СтрНачинаетсяС(НавигационнаяСсылка, "file://") Тогда
		СтандартнаяОбработка = Ложь;
		ПутьКФайлу = СтрЗаменить(НавигационнаяСсылка, "file://", "");
		ФайловаяСистемаКлиент.ОткрытьФайл(ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
