#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодключаемыеКомандыГруппа;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.РежимВыбора Тогда
		Если Параметры.МножественныйВыбор = Истина Тогда
			Элементы.Список.МножественныйВыбор = Истина;
			Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
			Элементы.ОтображениеПодобранныхГруппа.Видимость = Истина;
			ЗакрыватьПриВыборе = Ложь;
		Иначе
			Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		КонецЕсли;
	Иначе
		Элементы.Список.РежимВыбора = Ложь;
		Элементы.ОтображениеПодобранныхГруппа.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресПодобранных") Тогда
		ПодобранныеВсе.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.АдресПодобранных));
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
	Если Параметры.Свойство("ИсключаяКандидатовПоВакансии") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Вакансия", Параметры.ИсключаяКандидатовПоВакансии, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	ИспользоватьЭлектронноеИнтервью = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью");
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Пользователь", Пользователи.АвторизованныйПользователь());
	
	УстановитьУсловноеОформление();
	УстановитьВидимостьВакансий(Элементы.Вакансия);
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанных.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
	// СтандартныеПодсистемы.Свойства
	ПараметрыОтображенияМеток = УправлениеСвойствами.ПараметрыОтображенияМеток();
	ПараметрыОтображенияМеток.ИмяЭлементаДляРазмещенияМеток = "ГруппаМетки";
	ПараметрыОтображенияМеток.ИмяЭлементаДляРазмещенияЛегендыМеток = "ГруппаЛегендаМетки";
	ПараметрыОтображенияМеток.ОтборМеток = Истина;
	ПараметрыОтображенияМеток.ВидОбъектов = Метаданные.Справочники.ЛичныеДанныеКандидатов.ПолноеИмя();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыОтображенияМеток", ПараметрыОтображенияМеток);
	ДополнительныеПараметры.Вставить("ПроизвольныйОбъект", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Свойство("ЗадержавшиесяКандидаты") Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Параметры.ЗадержавшиесяКандидаты, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	ЗагрузкаКандидатовИзИнтернетаФормы.ФормаСОповещениямиПриСозданииНаСервере(ЭтотОбъект, Отказ);
	
	УстановитьИспользованиеОтбораПомеченныхНаУдаление(ЭтотОбъект, Список, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиПриОткрытии(ЭтотОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	ЗащитаПерсональныхДанныхКлиент.ОбработкаОповещенияФормыСписка(Элементы.Список, ИмяСобытия);
	// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных
	
	Если ИмяСобытия = "Проведение_Анкета" Тогда
		Элементы.Список.Обновить();
		СписокПриАктивизацииСтроки(Элементы.Список);
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьУсловноеОформление" Тогда
		УстановитьУсловноеОформление();
	КонецЕсли;
	
	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.РежимВыбора Или Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеСейчас.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	НачатьВопросОВыбореПодобранных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	ЗагрузкаКандидатовИзИнтернетаКлиент.ФормаСОповещениямиПриЗакрытии(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	Если Копирование Тогда
		ОткрытьФорму("Справочник.Кандидаты.ФормаОбъекта");
	Иначе
		ОткрытьФорму("Справочник.Кандидаты.Форма.МастерСозданияКандидата",,,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ИспользоватьЭлектронноеИнтервью Тогда
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные = Неопределено Тогда
			Элементы.ФормаПровестиИнтервью.Видимость = Ложь;
		Иначе
			ЭтапРаботы = ТекущиеДанные.ЭтапРаботы;
			Если ЗначениеЗаполнено(ЭтапРаботы) Тогда
				Элементы.ФормаПровестиИнтервью.Видимость = ЭлектронноеИнтервьюВызовСервера.ЕстьШаблон(ТекущиеДанные.Ссылка, ЭтапРаботы, ТекущиеДанные.Вакансия);
			Иначе
				Элементы.ФормаПровестиИнтервью.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ФормаПровестиИнтервью.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ПодборПерсоналаФормы.СписокКандидатовПриПолученииДанныхНаСервере(Настройки, Строки);
	
	ПодборПерсоналаФормы.ЗаполнитьОжидаемыйДоходВВалютеПоУмолчанию(Настройки, Строки);
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчетаБЗК.ПриПолученииДанныхНаСервере(Настройки, Строки);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриПолученииДанныхНаСервере(Настройки, Строки, "ЛичныеДанные");
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Значение.Количество() > 1 Или ВыбранныеСейчас.Количество() = 0 Тогда
		ДобавитьВПодобранные(Значение);
	КонецЕсли;

	ЗавершитьВыбор();
	
КонецПроцедуры

// СтандартныеПодсистемы.КонтрольВеденияУчета

&НаКлиенте
Процедура Подключаемый_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	КонтрольВеденияУчетаКлиент.ОткрытьОтчетПоПроблемамИзСписка(ЭтотОбъект, "Список", Поле, СтандартнаяОбработка);
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ДобавитьВПодобранные(ВыбраннаяСтрока);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеСейчас

&НаКлиенте
Процедура ВыбранныеСейчасПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеСейчасПередУдалением(Элемент, Отказ)
	
	Для Каждого ИдентификаторСтроки Из Элемент.ВыделенныеСтроки Цикл
		УдалитьИзСписка(ПодобранныеВсе, ВыбранныеСейчас.НайтиПоИдентификатору(ИдентификаторСтроки).Значение);
	КонецЦикла;
	
	УточнитьПодобранныеВУсловномОформлении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеСейчасПослеУдаления(Элемент)
	УточнитьПодобранныеВУсловномОформлении();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиИнтервью(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтапРаботы = ТекущиеДанные.ЭтапРаботы;
	Если Не ЗначениеЗаполнено(ЭтапРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеАнкеты = ЭлектронноеИнтервьюВызовСервера.ШаблонАнкеты(ТекущиеДанные.Ссылка, ЭтапРаботы, ТекущиеДанные.Вакансия);
	Если Не ЗначениеЗаполнено(ДанныеАнкеты.ШаблонАнкеты) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеАнкеты.Анкета) Или ДанныеАнкеты.ТолькоПросмотр Тогда
		ЭлектронноеИнтервьюКлиент.НачатьИнтервью(ТекущиеДанные.Ссылка, ЛичныеДанныеКандидата(ТекущиеДанные.Ссылка),
			ЭтапРаботы, ДанныеАнкеты.ШаблонАнкеты);
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоФормаЗаполнения", Истина);
	ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыФормы.Вставить("Ключ", ДанныеАнкеты.Анкета);
	ПараметрыФормы.Вставить("ВозможностьПредварительногоСохранения", Истина);
	ОткрытьФорму("Документ.Анкета.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПомеченныхНаУдаление(Команда)
	УстановитьИспользованиеОтбораПомеченныхНаУдаление(ЭтотОбъект, Список, Элементы.ПоказыватьПомеченныхНаУдаление.Пометка);
	Элементы.ПоказыватьПомеченныхНаУдаление.Пометка = Не Элементы.ПоказыватьПомеченныхНаУдаление.Пометка;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ЗащитаПерсональныхДанных

&НаКлиенте
Процедура Подключаемый_ПоказыватьСоСкрытымиПДн(Команда) 
	ЗащитаПерсональныхДанныхКлиент.ПоказыватьСоСкрытымиПДн(ЭтотОбъект, Список);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗащитаПерсональныхДанных

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ОбработчикОтбораПоМеткам(Команда)
	УправлениеСвойствамиКлиент.УстановитьОтборПоМетке(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьВидимостьЛегендыМеток(Команда)
    УстановитьВидимостьЛегендыМеток();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЛегендыМеток()
    УправлениеСвойствами.УстановитьВидимостьЛегендыМеток(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервереБезКонтекста
Функция ЛичныеДанныеКандидата(Кандидат)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ЛичныеДанные");
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьВидимостьВакансий(Вакансии)
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.Вакансии) Тогда
		Вакансии.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Справочники.Кандидаты.УстановитьУсловноеОформлениеСпискаКандидатов(Список);
	
	// Выделение подобранных.
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементОформления.Отбор, "Ссылка", ПодобранныеВсе.ВыгрузитьЗначения());
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	ЭлементОформления.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройкиВыделениеПодобранных();
	ЭлементОформления.Представление = НСтр("ru = 'Выделение подобранных'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторПользовательскойНастройкиВыделениеПодобранных()
	Возврат "ВыделениеПодобранных";
КонецФункции

&НаКлиенте
Процедура ДобавитьВПодобранные(Добавленные)
	
	Для Каждого Значение Из Добавленные Цикл
		Если Не ЕстьВПодобранных(Значение) Тогда
			ПодобранныеВсе.Добавить(Значение);
			ВыбранныеСейчас.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	УточнитьПодобранныеВУсловномОформлении();
	
КонецПроцедуры

&НаСервере
Процедура УточнитьПодобранныеВУсловномОформлении()
	
	Для Каждого ЭлементОформления Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.ИдентификаторПользовательскойНастройки 
			= ИдентификаторПользовательскойНастройкиВыделениеПодобранных() Тогда
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
				ЭлементОформления.Отбор, "Ссылка", , ПодобранныеВсе.ВыгрузитьЗначения());
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьВПодобранных(Значение)
	Возврат ПодобранныеВсе.НайтиПоЗначению(Значение) <> Неопределено;
КонецФункции

&НаКлиенте
Функция УдалитьИзСписка(Список, Значение)
	
	ЭлементСписка = Список.НайтиПоЗначению(Значение);
	Если ЭлементСписка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Список.Удалить(ЭлементСписка);
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НачатьВопросОВыбореПодобранных()
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Подбор кандидатов'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОВыбореВыбранных", ЭтотОбъект), 
		НСтр("ru = 'Выбрать подобранных кандидатов?'"), 
		РежимДиалогаВопрос.ДаНетОтмена,
		ПараметрыВопроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОВыбореВыбранных(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = КодВозвратаДиалога.Да Тогда
		ЗавершитьВыбор();
		Возврат;
	КонецЕсли;
	
	ВыбранныеСейчас.Очистить();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВыбор()
	
	РезультатВыбора = ВыбранныеСейчас.ВыгрузитьЗначения();
	ВыбранныеСейчас.Очистить();
	ОповеститьОВыборе(РезультатВыбора);
	Закрыть(РезультатВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов(Интервал) Экспорт
	ПодключитьОбработчикОжидания("ПроверитьЗагруженныхИзИнтернетаКандидатов", Интервал);
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОбработчикОжиданияПроверкиЗагруженныхКандидатов() Экспорт
	ОтключитьОбработчикОжидания("ПроверитьЗагруженныхИзИнтернетаКандидатов");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗагруженныхИзИнтернетаКандидатов()
	ЗагрузкаКандидатовИзИнтернетаКлиент.ПроверитьЗагруженныхИзИнтернетаКандидатов(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИспользованиеОтбораПомеченныхНаУдаление(Форма, Список, Использование)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, , , Использование);
КонецПроцедуры

#КонецОбласти