#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ПриЗаписиИсторииИзмененияМестаПозицииВСтруктуре(ЭтотОбъект,
		Отказ, Замещение);

	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Регистратор");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПредыдущийНабор.Позиция КАК Позиция,
	|	ПредыдущийНабор.Период КАК Период,
	|	NULL КАК Подразделение,
	|	NULL КАК Основание,
	|	ИСТИНА КАК УдалитьЗапись
	|ИЗ
	|	РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ПредыдущийНабор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|			ТекущийНабор
	|		ПО ПредыдущийНабор.Позиция = ТекущийНабор.ПозицияШтатногоРасписания
	|		И ПредыдущийНабор.Период = ТекущийНабор.Период
	|		И ПредыдущийНабор.Основание = ТекущийНабор.Регистратор
	|ГДЕ
	|	ПредыдущийНабор.Основание В (&Регистраторы)
	|	И ТекущийНабор.ПозицияШтатногоРасписания ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТекущийНабор.ПозицияШтатногоРасписания,
	|	ТекущийНабор.Период,
	|	ТекущийНабор.МестоВСтруктуреПредприятия,
	|	ТекущийНабор.Регистратор,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрСведений.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия КАК ТекущийНабор
	|ГДЕ
	|	ТекущийНабор.Регистратор В (&Регистраторы)";

	НачатьТранзакцию();
	Попытка

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(
				"РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
			ЭлементБлокировки.УстановитьЗначение("Позиция", Выборка.Позиция);
			ЭлементБлокировки.УстановитьЗначение("Период", Выборка.Период);
			Блокировка.Заблокировать();

			НаборЗаписей = РегистрыСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Позиция.Установить(Выборка.Позиция);
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период);

			Если Выборка.УдалитьЗапись Тогда
				НаборЗаписей.Записать();
				Продолжить;
			КонецЕсли;

			НоваяЗапись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);

			НаборЗаписей.Записать();

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();

		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(ОбработкаОшибок.СообщениеОбОшибкеДляПользователя(ИнформацияОбОшибке()));

	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли