
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокИнтервальныхРегистров();	
КонецПроцедуры

#КонецОбласти   

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьРегистры(Команда)
	ПерезаполнитьРегистрыНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерезаполнитьРегистрыНаСервере()

	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаРегистр Из СписокРегистровДляПерезаполнения Цикл
		
		Если Не СтрокаРегистр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений[СтрокаРегистр.Значение].СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		
		ИмяОсновногоРегистра = Лев(СтрокаРегистр.Значение, СтрДлина(СтрокаРегистр.Значение) - 12); 
		РегистрыСведений[ИмяОсновногоРегистра].ЗаполнитьИнтервальныйРегистр();
		
	КонецЦикла;	   
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокИнтервальныхРегистров()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрокаРегистр Из Метаданные["РегистрыСведений"] Цикл
		Если Прав(СтрокаРегистр.Имя, 12) = "Интервальный" Тогда
			СписокРегистровДляПерезаполнения.Добавить(СтрокаРегистр.Имя, СтрокаРегистр.Представление());
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

#КонецОбласти
