#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Ссылка") Тогда
		Параметры.Отбор.Вставить("Ссылка", КатегорииФинансовогоУчета());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значения перечисления, используемые в финансовом учете.
//
// Возвращаемое значение:
// 	Массив - элементы массива - ПеречислениеСсылка.КатегорииРасходовНаПерсонал. 
//
Функция КатегорииФинансовогоУчета() Экспорт

	Категории = Новый Массив;
	
	Категории.Добавить(Займы);
	Категории.Добавить(Зарплата);
	Категории.Добавить(Обучение);
	Категории.Добавить(СтраховыеВзносы);
	Категории.Добавить(УдержаннаяЗарплата);
	
	Возврат Категории;

КонецФункции

#КонецОбласти

#КонецЕсли