#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ЗаполнитьРеквизитыИзПотребителя.
Процедура ЗаполнитьРеквизитыОбъектаДокументооборота(Прокси, ОбъектXDTO, СсылкаНаПотребитель) Экспорт
	
	Если Не ТипЗнч(СсылкаНаПотребитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		
		Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMCorrespondent") Тогда
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаПотребитель,
				"ИНН, КПП, ЮридическоеФизическоеЛицо, КодПоОКПО, НаименованиеПолное");
			
			Если ЗначениеЗаполнено(Реквизиты.ИНН) Тогда
				ОбъектXDTO.inn = Реквизиты.ИНН;
			КонецЕсли;
			Если ЗначениеЗаполнено(Реквизиты.КПП) Тогда
				ОбъектXDTO.kpp = Реквизиты.КПП;
			КонецЕсли;
			Если ЗначениеЗаполнено(Реквизиты.КодПоОКПО) Тогда
				ОбъектXDTO.okpo = Реквизиты.КодПоОКПО;
			КонецЕсли;
			Если ЗначениеЗаполнено(Реквизиты.НаименованиеПолное) Тогда
				ОбъектXDTO.fullName = Реквизиты.НаименованиеПолное;
			КонецЕсли;
			
			ЗарплатаКадрыБазовый.ЗаполнитьРеквизитыОбъектаДокументооборота(
				Прокси,
				ОбъектXDTO.legalPrivatePerson,
				Реквизиты.ЮридическоеФизическоеЛицо);
			
		ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьТип(Прокси, ОбъектXDTO, "DMParty") Тогда
			
			ОбъектXDTO.correspondent = МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СоздатьОбъект(
				Прокси,
				"DMCorrespondent",
				СсылкаНаПотребитель);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO.
Процедура ПриОпределенииЗначенияРеквизитаПоОбъектуXDTO(Результат, ЗначениеЗаполнения, ТипРеквизита, ИмяРеквизита,
		ТипОбъекта, Объект, ЭтоДополнительноеСвойство, Свойство, ПараметрыВыбора) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		
		Если Не (ТипРеквизита = Тип("СправочникСсылка.Контрагенты")
				И ТипЗнч(ЗначениеЗаполнения) = Тип("ОбъектXDTO")
				И МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ЗначениеЗаполнения, "objectID")) Тогда
			Возврат;
		КонецЕсли;
		
		Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(ЗначениеЗаполнения, "correspondent") Тогда
			КонтрагентXDTO = ЗначениеЗаполнения.correspondent;
		Иначе
			КонтрагентXDTO = ЗначениеЗаполнения;
		КонецЕсли;
		
		МодульОбъектыИнтегрированныеС1СДокументооборотом = ОбщегоНазначения.ОбщийМодуль(
			"РегистрыСведений.ОбъектыИнтегрированныеС1СДокументооборотом");
		Результат = МодульОбъектыИнтегрированныеС1СДокументооборотом.СсылкаНаОбъектИСПоДаннымДокументооборота(
			КонтрагентXDTO.objectID.ID,
			КонтрагентXDTO.objectID.type,
			ТипРеквизита);
		
		Если Результат = Неопределено Тогда
			
			// Возможно, соответствия созданы синхронизацией данных и унаследовали идентификаторы.
			СсылкаПоИдентификатору = Справочники.Контрагенты.ПолучитьСсылку(
				Новый УникальныйИдентификатор(КонтрагентXDTO.objectID.ID));
			
			// Возможно исключение RLS.
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
				|	Ссылка
				|ИЗ
				|	Справочник.Контрагенты
				|ГДЕ
				|	Ссылка = &СсылкаПоИдентификатору");
			Запрос.УстановитьПараметр("СсылкаПоИдентификатору", СсылкаПоИдентификатору);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				// Контрагент найден.
				Результат = Выборка.Ссылка;
				
			ИначеЕсли МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(КонтрагентXDTO, "name")
					И КонтрагентXDTO.name <> "" Тогда
				
				// Продолжим поиск по ИНН/КПП.
				Наименование = КонтрагентXDTO.name;
				ИНН = "";
				КПП = "";
				
				Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(КонтрагентXDTO, "inn") Тогда
					ИНН = КонтрагентXDTO.inn;
				КонецЕсли;
				Если МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.СвойствоУстановлено(КонтрагентXDTO, "kpp") Тогда
					КПП = КонтрагентXDTO.kpp;
				КонецЕсли;
				
				Запрос = Новый Запрос(
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Контрагенты.Ссылка КАК Ссылка,
					|	0 КАК Приоритет
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	&ИНН <> """"
					|	И &КПП <> """"
					|	И Контрагенты.ИНН = &ИНН
					|	И Контрагенты.КПП = &КПП
					|	И НЕ Контрагенты.ПометкаУдаления
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Контрагенты.Ссылка,
					|	1
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	&ИНН <> """"
					|	И (&КПП = """"
					|			ИЛИ Контрагенты.КПП = """")
					|	И Контрагенты.ИНН = &ИНН
					|	И Контрагенты.Наименование = &Наименование
					|	И НЕ Контрагенты.ПометкаУдаления
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Контрагенты.Ссылка,
					|	2
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	&КПП <> """"
					|	И (&ИНН = """"
					|			ИЛИ Контрагенты.ИНН = """")
					|	И Контрагенты.КПП = &КПП
					|	И Контрагенты.Наименование = &Наименование
					|	И НЕ Контрагенты.ПометкаУдаления
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Контрагенты.Ссылка,
					|	3
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	&ИНН <> """"
					|	И (&КПП = """"
					|			ИЛИ Контрагенты.КПП = """")
					|	И Контрагенты.ИНН = &ИНН
					|	И НЕ Контрагенты.ПометкаУдаления
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	Контрагенты.Ссылка,
					|	4
					|ИЗ
					|	Справочник.Контрагенты КАК Контрагенты
					|ГДЕ
					|	(&ИНН = """"
					|			ИЛИ Контрагенты.ИНН = """")
					|	И (&КПП = """"
					|			ИЛИ Контрагенты.КПП = """")
					|	И Контрагенты.Наименование = &Наименование
					|	И НЕ Контрагенты.ПометкаУдаления
					|
					|УПОРЯДОЧИТЬ ПО
					|	Приоритет");
				Запрос.УстановитьПараметр("ИНН", ИНН);
				Запрос.УстановитьПараметр("КПП", КПП);
				Запрос.УстановитьПараметр("Наименование", Наименование);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					// Контрагент найден.
					Результат = Выборка.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ПриСозданииПоСсылке.
Процедура ПриСозданииПоСсылке(ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС) Экспорт
	
	Если Не ТипЗнч(ОбъектИС) = Тип("СправочникОбъект.Контрагенты") Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникXDTO = Неопределено;
	
	ИнтеграцияС1СДокументооборотБЗК.ПриСозданииЮрЛицаПоСсылке(
		ОбъектИС, ОбъектXDTO, ЗаполняемыйОбъектИС, ИсточникXDTO);
	
	ОбъектИС.КПП = ИсточникXDTO.kpp;
	
КонецПроцедуры

// См. ИнтеграцияС1СДокументооборотБазоваяФункциональностьПереопределяемый.ДополнитьСоответствиеТипов.
Процедура ДополнитьСоответствиеТипов(Таблица) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ДобавитьСтрокуСоответствияТипов(
			Таблица, "DMCorrespondent", Тип("СправочникСсылка.Контрагенты"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
