#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийПодсистемКонфигурации

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных.
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт // @skip-check module-empty-method
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
// 
// Параметры:
// 	Типы - См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
// 
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	// БазоваяФункциональность
	Типы.Добавить(Метаданные.Константы.УстановленаМонопольнаяБлокировка);
	
	// ВыгрузкаЗагрузкаДанных
	Типы.Добавить(Метаданные.Константы.ИнформацияОПроцедуреЗагрузки);
	Типы.Добавить(Метаданные.Константы.ПараметрыЗапускаИнтерактивнойПроцедурыЗагрузки);
	Типы.Добавить(Метаданные.РегистрыСведений.СостоянияВыгрузкиЗагрузкиОбластейДанных);
	Типы.Добавить(Метаданные.РегистрыСведений.ВыгрузкаЗагрузкаОбъектовМетаданных);
	
	// ВыгрузкаЗагрузкаОбластейДанных
	Типы.Добавить(Метаданные.РегистрыСведений.ЧастиВыгрузкиЗагрузкиОбластейДанных);
	
	// ПередачаДанных
	Типы.Добавить(Метаданные.РегистрыСведений.ВременныеИдентификаторыЗапросов);

	// ФайловоеВременноеХранилище
	Типы.Добавить(Метаданные.РегистрыСведений.ФайлыВременногоХранилища);
	
	ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки_МетаданныеКУдалению(Типы);
		
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	РаботаВМоделиСервисаПереопределяемый.ПриДобавленииОбработчиковОбновления(Обработчики);
	
КонецПроцедуры

// См. ИнтеграцияПодсистемБТС.ПриОпределенииИсключенийНеразделенныхДанных
// 
// Параметры:
//	Исключения - Массив Из ОбъектМетаданных - исключения.
//
Процедура ПриОпределенииИсключенийНеразделенныхДанных(Исключения) Экспорт
	
	Исключения.Добавить(Метаданные.РегистрыСведений.УдалитьДанныеОчищаемойОбласти);
	Исключения.Добавить(Метаданные.Константы.УдалитьТипыИнцидентовЦККАктуальны);
	
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных.
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
	
	РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных();
	
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных.
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт
	
	ПользователиСлужебный.ПослеЗагрузкиДанных(Контейнер);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеИтогамиИАгрегатами") Тогда
		
		ИмяМодуля = "УправлениеИтогамиИАгрегатамиСлужебный";
		МодульУправлениеИтогамиИАгрегатамиСлужебный = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
		МодульУправлениеИтогамиИАгрегатамиСлужебный.РассчитатьИтоги();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// См. РаботаВМоделиСервиса.РазделительОсновныхДанных
Функция РазделительОсновныхДанных() Экспорт
	
	Возврат Метаданные.ОбщиеРеквизиты.ОбластьДанныхОсновныеДанные.Имя;
	
КонецФункции

// См. РаботаВМоделиСервиса.РазделительВспомогательныхДанных
Функция РазделительВспомогательныхДанных() Экспорт
	
	Возврат Метаданные.ОбщиеРеквизиты.ОбластьДанныхВспомогательныеДанные.Имя;
	
КонецФункции

// См. РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных
Функция ДоступноИспользованиеРазделенныхДанных() Экспорт
	
	Если Не РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат РаботаВМоделиСервиса.ИспользованиеРазделителяСеанса();
	
КонецФункции

// См. РаботаВМоделиСервиса.ОбработатьИнформациюОбОшибкеWebСервиса
Процедура ОбработатьИнформациюОбОшибкеWebСервиса(Знач ИнформацияОбОшибке, Знач ИмяПодсистемы = "",
	Знач ИмяВебСервиса = "", Знач ИмяОперации = "") Экспорт
	
	Если ИнформацияОбОшибке = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяПодсистемы) Тогда
		ИмяПодсистемы = Метаданные.Подсистемы.ТехнологияСервиса.Имя;
	КонецЕсли;
	
	ИмяСобытия = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1.Ошибка вызова операции web-сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ИмяПодсистемы);
	
	ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка при вызове операции %1 веб-сервиса %2: %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ИмяОперации,
		ИмяВебСервиса,
		ИнформацияОбОшибке.DetailErrorDescription);
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстОшибки);
		
	ВызватьИсключение ИнформацияОбОшибке.BriefErrorDescription;
	
КонецПроцедуры

// См. РаботаВМоделиСервиса.ЗначениеРазделителяСеанса
Функция ЗначениеРазделителяСеанса() Экспорт
	
	Если НЕ РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Возврат 0;
	Иначе
		Если Не РаботаВМоделиСервиса.ИспользованиеРазделителяСеанса() Тогда
			ВызватьИсключение(НСтр("ru = 'Не установлено значение разделителя'"));
		КонецЕсли;
		
		// Получим значение разделителя текущей области данных.
		Возврат ПараметрыСеанса.ОбластьДанныхЗначение;
	КонецЕсли;
	
КонецФункции

// См. РаботаВМоделиСервиса.ИспользованиеРазделителяСеанса
Функция ИспользованиеРазделителяСеанса() Экспорт
	
	Возврат ПараметрыСеанса.ОбластьДанныхИспользование;
	
КонецФункции

// См. РаботаВМоделиСервиса.КонечнаяТочкаМенеджераСервисаНастроена
Функция КонечнаяТочкаМенеджераСервисаНастроена() Экспорт
	
	Результат = Ложь;
	
	КонечнаяТочка = РаботаВМоделиСервиса.КонечнаяТочкаМенеджераСервиса();
	Если ЗначениеЗаполнено(КонечнаяТочка) Тогда
		СтруктураНастроек = РегистрыСведений.НастройкиТранспортаОбменаСообщениями.НастройкиТранспортаWS(КонечнаяТочка);
		
		Результат = ЗначениеЗаполнено(СтруктураНастроек.WSИмяПользователя)
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. РаботаВМоделиСервиса.ПсевдонимПользователяИнформационнойБазы
Функция ПсевдонимПользователяИнформационнойБазы(Знач ИдентификаторПользователя) Экспорт
	
	Псевдоним = "";
	
	ИнтеграцияПодсистемБТС.ПриОпределенииПсевдонимаПользователя(ИдентификаторПользователя, Псевдоним);
	Возврат Псевдоним;
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяДокумента
Функция ЭтоПолноеИмяДокумента(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Документ", "Document");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяСправочника
Функция ЭтоПолноеИмяСправочника(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Справочник", "Catalog");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПеречисления
Функция ЭтоПолноеИмяПеречисления(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Перечисление", "Enum");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПланаОбмена
Функция ЭтоПолноеИмяПланаОбмена(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "ПланОбмена", "ExchangePlan");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовХарактеристик
Функция ЭтоПолноеИмяПланаВидовХарактеристик(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "ПланВидовХарактеристик", "ChartOfCharacteristicTypes");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяБизнесПроцесса
Функция ЭтоПолноеИмяБизнесПроцесса(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "БизнесПроцесс", "BusinessProcess");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяЗадачи
Функция ЭтоПолноеИмяЗадачи(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Задача", "Task");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПланаСчетов
Функция ЭтоПолноеИмяПланаСчетов(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "ПланСчетов", "ChartOfAccounts");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовРасчета
Функция ЭтоПолноеИмяПланаВидовРасчета(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "ПланВидовРасчета", "ChartOfCalculationTypes");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраСведений
Функция ЭтоПолноеИмяРегистраСведений(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "РегистрСведений", "InformationRegister");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраНакопления
Функция ЭтоПолноеИмяРегистраНакопления(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "РегистрНакопления", "AccumulationRegister");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраБухгалтерии
Функция ЭтоПолноеИмяРегистраБухгалтерии(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "РегистрБухгалтерии", "AccountingRegister");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраРасчета
Функция ЭтоПолноеИмяРегистраРасчета(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "РегистрРасчета", "CalculationRegister")
		И Не РаботаВМоделиСервиса.ЭтоПолноеИмяПерерасчета(ПолноеИмя);
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПерерасчета
Функция ЭтоПолноеИмяПерерасчета(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Перерасчет", "Recalculation", 2);
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяКонстанты
Функция ЭтоПолноеИмяКонстанты(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Константа", "Constant");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяЖурналаДокументов
Функция ЭтоПолноеИмяЖурналаДокументов(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "ЖурналДокументов", "DocumentJournal");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяПоследовательности
Функция ЭтоПолноеИмяПоследовательности(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "Последовательность", "Sequence");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегламентногоЗадания
Функция ЭтоПолноеИмяРегламентногоЗадания(Знач ПолноеИмя) Экспорт
	
	Возврат ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(ПолноеИмя, "РегламентноеЗадание", "ScheduledJob");
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяРегистра
Функция ЭтоПолноеИмяРегистра(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраСведений(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраНакопления(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраБухгалтерии(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяРегистраРасчета(ПолноеИмя);
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяОбъектаСсылочногоТипа
Функция ЭтоПолноеИмяОбъектаСсылочногоТипа(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервиса.ЭтоПолноеИмяСправочника(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяДокумента(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяБизнесПроцесса(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяЗадачи(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаСчетов(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаОбмена(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовХарактеристик(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовРасчета(ПолноеИмя);
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоПолноеИмяОбъектаСПредопределеннымиДанными
Функция ЭтоПолноеИмяОбъектаСПредопределеннымиДанными(Знач ПолноеИмя) Экспорт
	
	Возврат РаботаВМоделиСервиса.ЭтоПолноеИмяСправочника(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаСчетов(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовХарактеристик(ПолноеИмя)
		ИЛИ РаботаВМоделиСервиса.ЭтоПолноеИмяПланаВидовРасчета(ПолноеИмя);
	
КонецФункции

// См. РаботаВМоделиСервиса.ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы
Процедура ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы(Типы) Экспорт

	Типы.Добавить(Метаданные.Справочники.ИнформационныеСсылкиДляФорм);
	Типы.Добавить(Метаданные.Справочники.ОбщиеДанныеИнформационногоЦентра);
	Типы.Добавить(Метаданные.Справочники.ПолныеПутиКФормам);
	Типы.Добавить(Метаданные.Справочники.СообщенияОбластейДанных);
	Типы.Добавить(Метаданные.Справочники.СообщенияСистемы);
	Типы.Добавить(Метаданные.Справочники.ТипыИнформацииИнформационногоЦентра);
	
	ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы_МетаданныеКУдалению(Типы);
	
КонецПроцедуры

// См. РаботаВМоделиСервиса.СеансЗапущенБезРазделителей
Функция СеансЗапущенБезРазделителей() Экспорт
	
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().РазделениеДанных.Количество() = 0;
	
КонецФункции

// См. РаботаВМоделиСервиса.ЭтоРазделенныйОбъектМетаданных
Функция ЭтоРазделенныйОбъектМетаданных(Знач ОбъектМетаданных, Знач Разделитель = Неопределено) Экспорт
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") Тогда
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных;
	Иначе
		ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	КонецЕсли;
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.ЭтоРазделенныйОбъектМетаданных(ПолноеИмяОбъектаМетаданных, Разделитель);
	
КонецФункции

// См. РаботаВМоделиСервиса.СоздатьКлючЗаписиРегистраСведенийВспомогательныхДанных
Функция СоздатьКлючЗаписиРегистраСведенийВспомогательныхДанных(Знач Менеджер, Знач ЗначенияКлюча) Экспорт
	
	Ключ = Менеджер.СоздатьКлючЗаписи(ЗначенияКлюча);
	
	ОбластьДанных = Неопределено;
	Разделитель = РазделительВспомогательныхДанных();
	
	Если ЗначенияКлюча.Свойство(Разделитель, ОбластьДанных) Тогда
		
		Если Ключ[Разделитель] <> ОбластьДанных Тогда
			
			Объект = СериализаторXDTO.ЗаписатьXDTO(Ключ);
			Объект[Разделитель] = ОбластьДанных;
			Ключ = СериализаторXDTO.ПрочитатьXDTO(Объект);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ключ;
	
КонецФункции

Процедура УстановитьМонопольнуюБлокировку(ИспользоватьМногопоточность = Ложь) Экспорт
	
	Если ИспользоватьМногопоточность И ПолучитьФункциональнуюОпцию("УстановленаМонопольнаяБлокировка")
		Или Не ИспользоватьМногопоточность И МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не МонопольныйРежим() Тогда
		УстановитьМонопольныйРежим(Истина);
	КонецЕсли;
	
	Если ИспользоватьМногопоточность Тогда
		Константы.УстановленаМонопольнаяБлокировка.Установить(Истина);
		УстановитьМонопольныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура СнятьМонопольнуюБлокировку(ИспользоватьМногопоточность = Ложь) Экспорт
	
	Если ИспользоватьМногопоточность И Не ПолучитьФункциональнуюОпцию("УстановленаМонопольнаяБлокировка")
		Или Не ИспользоватьМногопоточность И Не МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьМногопоточность Тогда
		
		Константы.УстановленаМонопольнаяБлокировка.Установить(Ложь);
		
	Иначе
		
		Попытка
			УстановитьМонопольныйРежим(Ложь);
		Исключение
			
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось снять монопольную блокировку информационной базы.
					 |
					 |%1'"),
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Монопольная блокировка'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ТекстОшибки);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьДанныеОбласти(УдалятьРасширения = Истина, УдалятьТекущегоПользователя = Истина) Экспорт
	
	ОчиститьДанныеИнформационнойБазы(УдалятьРасширения, УдалятьТекущегоПользователя);
	
КонецПроцедуры

// Возвращает список полных имен всех объектов метаданных, использующихся в общем реквизите-разделителе,
//  имя которого передано в качестве значения параметра Разделитель, и значения свойств объекта метаданных,
//  которые могут потребоваться для дальнейшей его обработки в универсальных алгоритмах.
// Для последовательностей и журналов документов определяет разделенность по входящим документам: любому из.
//
// Параметры:
//  Разделитель - Строка - имя общего реквизита.
//
// Возвращаемое значение:
// ФиксированноеСоответствие из КлючИЗначение:
//  * Ключ - Строка - полное имя объекта метаданных,
//  * Значение - ФиксированнаяСтруктура:
//    ** Имя - Строка - имя объекта метаданных,
//    ** Разделитель - Строка - имя разделителя, которым разделен объект метаданных,
//    ** УсловноеРазделение - Строка - полное имя объекта метаданных, выступающего в качестве условия использования
//      разделения объекта метаданных данным разделителем.
//
Функция РазделенныеОбъектыМетаданных(Знач Разделитель) Экспорт
	
	Возврат РаботаВМоделиСервисаСлужебныйПовтИсп.РазделенныеОбъектыМетаданных(Разделитель);
	
КонецФункции

// Вызывает исключение при отсутствии подходящего расширения библиотеки технологии сервиса
//
Процедура ВызватьИсключениеОтсутствуетРасширениеБТС() Экспорт

	ВерсияРасширения = ТехнологияСервиса.ВерсияРасширенияБиблиотеки();
	Если ЗначениеЗаполнено(ВерсияРасширения) Тогда
		ТекстОшибки = СтрШаблон(НСтр(
		"ru = 'Невозможно выполнить операцию: текущая версия %1 расширения для работы в режиме сервиса
		|не подходит для работы с версией %2 библиотеки технологии сервиса'"), ВерсияРасширения,
			ТехнологияСервиса.ВерсияБиблиотеки());
	Иначе
		ТекстОшибки = НСтр(
		"ru = 'Невозможно выполнить операцию: не установлено расширение библиотеки технологии сервиса
		|для работы в режиме сервиса'");
	КонецЕсли;

	ЗаписьЖурналаРегистрации(НСтр("ru = 'Невозможно выполнить операцию'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);

КонецПроцедуры

Процедура ОчиститьДанныеОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, ОписаниеОбъектаМетаданных) Экспорт

	Если ЭтоПолноеИмяКонстанты(ПолноеИмяОбъектаМетаданных) Тогда

		ОбъектМетаданныхОбласти = Метаданные.Константы.Найти(ОписаниеОбъектаМетаданных.Имя);
		МенеджерЗначения = Константы[ОписаниеОбъектаМетаданных.Имя].СоздатьМенеджерЗначения();
		МенеджерЗначения.ОбменДанными.Загрузка = Истина;
		МенеджерЗначения.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		МенеджерЗначения.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
		МенеджерЗначения.Значение = ОбъектМетаданныхОбласти.Тип.ПривестиЗначение();
		МенеджерЗначения.Записать();

		ОтключитьИОчиститьИсториюДанных(ОбъектМетаданныхОбласти);
		
	ИначеЕсли ЭтоПолноеИмяОбъектаСсылочногоТипа(ПолноеИмяОбъектаМетаданных) Тогда
		
		ПараметрыОбъекта = НовыеПараметрыУдаляемогоОбъекта();
		ПараметрыОбъекта.ПоддерживаютсяПредопределенные = ЭтоПолноеИмяОбъектаСПредопределеннымиДанными(
			ПолноеИмяОбъектаМетаданных);
		
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
		Выборка = Менеджер.Выбрать();
		
		Пока Выборка.Следующий() Цикл

			УдаляемыйОбъект = Выборка.ПолучитьОбъект(); // СправочникОбъект
			Если ИсключитьОбъектИзОчистки(УдаляемыйОбъект, ПараметрыОбъекта) Тогда
				Продолжить;
			КонецЕсли;
			
			УдалитьОбъектДанных(УдаляемыйОбъект);

		КонецЦикла;
		
		ОбъектМетаданныхОбласти = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
		ОтключитьИОчиститьИсториюДанных(ОбъектМетаданныхОбласти);
		
	ИначеЕсли ЭтоПолноеИмяРегистра(ПолноеИмяОбъектаМетаданных) Или ЭтоПолноеИмяПерерасчета(ПолноеИмяОбъектаМетаданных)
		Или ЭтоПолноеИмяПоследовательности(ПолноеИмяОбъектаМетаданных) Тогда

		ЭтоРегистрНакопления = ЭтоПолноеИмяРегистраНакопления(ПолноеИмяОбъектаМетаданных);
		ЭтоРегистрБухгалтерии = ЭтоПолноеИмяРегистраБухгалтерии(ПолноеИмяОбъектаМетаданных);
		ЭтоРегистрСведений = ЭтоПолноеИмяРегистраСведений(ПолноеИмяОбъектаМетаданных);

		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъектаМетаданных); // РегистрНакопленияМенеджерИмяРегистраНакопления

		ЭтоНезависимыйРегистрСведений = Ложь;
		ПересчитатьИтоги = Ложь;

		Если ЭтоРегистрНакопления Тогда

			РегистрМетаданные = Метаданные.РегистрыНакопления.Найти(ОписаниеОбъектаМетаданных.Имя);

			Если РегистрМетаданные.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда

				Если Менеджер.ПолучитьМинимальныйПериодРассчитанныхИтогов() <> '00010101'
					Или Менеджер.ПолучитьМаксимальныйПериодРассчитанныхИтогов() <> КонецМесяца('00010101') Тогда

					Менеджер.УстановитьМинимальныйИМаксимальныйПериодыРассчитанныхИтогов('00010101', '00010101');

				КонецЕсли;

				Если Менеджер.ПолучитьИспользованиеТекущихИтогов() Тогда

					Менеджер.УстановитьИспользованиеТекущихИтогов(Ложь);

				КонецЕсли;

				Если Менеджер.ПолучитьИспользованиеИтогов() Тогда

					Менеджер.УстановитьИспользованиеИтогов(Ложь);

				КонецЕсли;
			
			ИначеЕсли РегистрМетаданные.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты Тогда 

				РежимАгрегатов = Менеджер.ПолучитьРежимАгрегатов();

				Если РежимАгрегатов И Менеджер.ПолучитьИспользованиеАгрегатов() Тогда
					
					Менеджер.УстановитьИспользованиеАгрегатов(Ложь);
					
				КонецЕсли;
			
				Если Не РежимАгрегатов И Менеджер.ПолучитьИспользованиеИтогов() Тогда

					Менеджер.УстановитьИспользованиеИтогов(Ложь);
					ПересчитатьИтоги = Истина;

				КонецЕсли;
			
			КонецЕсли;

		ИначеЕсли ЭтоРегистрБухгалтерии Тогда

			Если Менеджер.ПолучитьМинимальныйПериодРассчитанныхИтогов() <> '00010101'
				Или Менеджер.ПолучитьМаксимальныйПериодРассчитанныхИтогов() <> '00010101' Тогда

				Менеджер.УстановитьМинимальныйИМаксимальныйПериодыРассчитанныхИтогов('00010101', '00010101');

			КонецЕсли;

			Если Менеджер.ПолучитьИспользованиеТекущихИтогов() Тогда

				Менеджер.УстановитьИспользованиеТекущихИтогов(Ложь);

			КонецЕсли;

			Если Менеджер.ПолучитьИспользованиеИтогов() Тогда

				Менеджер.УстановитьИспользованиеИтогов(Ложь);

			КонецЕсли;

		ИначеЕсли ЭтоРегистрСведений Тогда

			РегистрМетаданные = Метаданные.РегистрыСведений.Найти(ОписаниеОбъектаМетаданных.Имя);

			Если РегистрМетаданные.РазрешитьИтогиСрезПервых Или РегистрМетаданные.РазрешитьИтогиСрезПоследних Тогда

				Если Менеджер.ПолучитьИспользованиеИтогов() Тогда

					Менеджер.УстановитьИспользованиеИтогов(Ложь);
					ПересчитатьИтоги = Истина;

				КонецЕсли;

			КонецЕсли;

			ЭтоНезависимыйРегистрСведений = (РегистрМетаданные.РежимЗаписи
				= Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый);

		КонецЕсли;

		Если ЭтоНезависимыйРегистрСведений Тогда

			НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
			НаборЗаписей.Записать();

		Иначе

			ПараметрыВыборки = ПараметрыВыборки(ПолноеИмяОбъектаМетаданных);
			ИмяПоляРегистратор = ПараметрыВыборки.ИмяПоляРегистратор;

			Запрос = Новый Запрос;
			Запрос.Текст = СтрЗаменить(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Т.Регистратор КАК Регистратор
				|ИЗ
				|	&Таблица КАК Т", "&Таблица", ПараметрыВыборки.Таблица);

			Если ИмяПоляРегистратор <> "Регистратор" Тогда

				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Регистратор", ИмяПоляРегистратор);

			КонецЕсли;

			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();

			Пока Выборка.Следующий() Цикл

				НаборЗаписей = Менеджер.СоздатьНаборЗаписей();
				ОтборРегистратор = НаборЗаписей.Отбор[ИмяПоляРегистратор]; // ЭлементОтбора
				ОтборРегистратор.Установить(Выборка[ИмяПоляРегистратор]);
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
				НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
				НаборЗаписей.Записать();

			КонецЦикла;

		КонецЕсли;
		
		Если ПересчитатьИтоги Тогда
			
			Если ЭтоРегистрНакопления
				И РегистрМетаданные.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Обороты
				И Менеджер.ПолучитьРежимАгрегатов() Тогда
				
				Менеджер.УстановитьИспользованиеАгрегатов(Истина);
				Менеджер.УстановитьИспользованиеАгрегатов(Ложь);
				
			Иначе
			
				Менеджер.УстановитьИспользованиеИтогов(Истина);
				Менеджер.УстановитьИспользованиеИтогов(Ложь);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоРегистрСведений Тогда
			ОтключитьИОчиститьИсториюДанных(РегистрМетаданные);
		КонецЕсли;

	ИначеЕсли ЭтоПолноеИмяРегламентногоЗадания(ПолноеИмяОбъектаМетаданных) Тогда

		ОбъектМетаданныхОбласти = Метаданные.РегламентныеЗадания.Найти(ОписаниеОбъектаМетаданных.Имя);
		Для Каждого РегламентноеЗадание Из РегламентныеЗадания.ПолучитьРегламентныеЗадания(
			Новый Структура("Метаданные", ОбъектМетаданныхОбласти)) Цикл
			Если РегламентноеЗадание.Предопределенное Тогда
				РегламентноеЗадание.Использование = Ложь;
				РегламентноеЗадание.Записать();
			Иначе
				РегламентноеЗадание.Удалить();
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;
КонецПроцедуры

//@skip-check module-empty-method
Процедура УдалитьРасширенияОбласти() Экспорт
КонецПроцедуры

Процедура УдалитьПользователейОбласти(УдалятьТекущегоПользователя = Истина) Экспорт
	
	ПервыйАдминистратор = Неопределено;
	ИмяТекущегоПользователяИБ = Неопределено;
	
	Если Не УдалятьТекущегоПользователя Тогда
		
		ИмяТекущегоПользователяИБ = ИмяПользователя();
		
		Если ПустаяСтрока(ИмяТекущегоПользователяИБ) Тогда
			ИмяТекущегоПользователяИБ = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ПользовательИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
		
		Если ПользовательИБ.Имя = ИмяТекущегоПользователяИБ Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПервыйАдминистратор = Неопределено
			И Пользователи.ЭтоПолноправныйПользователь(ПользовательИБ, Истина, Ложь)
			И ПользовательИБ.АутентификацияСтандартная Тогда
			
			// Отложим удаление администратора, чтобы на момент его удаления все остальные
			// пользователи информационной базы уже были удалены.
			ПервыйАдминистратор = ПользовательИБ;
			
		Иначе
			
			ПользовательИБ.Удалить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПервыйАдминистратор <> Неопределено Тогда
		
		ПервыйАдминистратор.Удалить();
		
	КонецЕсли;
	
КонецПроцедуры

// Установлен монопольный режим.
// 
// Возвращаемое значение:
//  Булево - Установлен монопольный режим
Функция УстановленМонопольныйРежим() Экспорт
	
	Возврат МонопольныйРежим()
		Или ПолучитьФункциональнуюОпцию("УстановленаМонопольнаяБлокировка");
	
КонецФункции

// Параметры выборки по полному имени объекта метаданных.
// 
// Параметры: 
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта метаданных.
// 
// Возвращаемое значение: 
//	Структура - параметры выборки:
//	 * Таблица - Строка - имя объекта метаданных.
//	 * ИмяПоляРегистратор - Строка - имя поля регистратора.
Функция ПараметрыВыборки(Знач ПолноеИмяОбъектаМетаданных) Экспорт
	
	Результат = Новый Структура("Таблица,ИмяПоляРегистратор");
	
	Если ЭтоПолноеИмяРегистра(ПолноеИмяОбъектаМетаданных)
			ИЛИ ЭтоПолноеИмяПоследовательности(ПолноеИмяОбъектаМетаданных) Тогда
		
		Результат.Таблица = ПолноеИмяОбъектаМетаданных;
		Результат.ИмяПоляРегистратор = "Регистратор";
		
	ИначеЕсли ЭтоПолноеИмяПерерасчета(ПолноеИмяОбъектаМетаданных) Тогда
		
		Подстроки = СтрРазделить(ПолноеИмяОбъектаМетаданных, ".");
		Результат.Таблица = Подстроки[0] + "." + Подстроки[1] + "." + Подстроки[3];
		Результат.ИмяПоляРегистратор = "ОбъектПерерасчета";
		
	Иначе
		
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Функция %1 не должна использоваться для объекта %2.'"),
			"ПараметрыВыборки",
			ПолноеИмяОбъектаМетаданных);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// См. РаботаВМоделиСервиса.ПолучитьВерсииИнтерфейсаМенеджераСервиса 
Функция ПолучитьВерсииИнтерфейсаМенеджераСервиса(ИмяИнтерфейса, ПараметрыПодключения = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(ПараметрыПодключения) Тогда
		АдресМенеджераСервиса = ПараметрыПодключения.Адрес;
		ПользовательМенеджераСервиса = ПараметрыПодключения.Пользователь;
		ПарольПользователяМенеджераСервиса = ПараметрыПодключения.Пароль;
	Иначе
		УстановитьОтключениеБезопасногоРежима(Истина);
		УстановитьПривилегированныйРежим(Истина);
		АдресМенеджераСервиса = РаботаВМоделиСервиса.ВнутреннийАдресМенеджераСервиса();
		ПользовательМенеджераСервиса = РаботаВМоделиСервиса.ИмяСлужебногоПользователяМенеджераСервиса();
		ПарольПользователяМенеджераСервиса = РаботаВМоделиСервиса.ПарольСлужебногоПользователяМенеджераСервиса();
		УстановитьПривилегированныйРежим(Ложь);
		УстановитьОтключениеБезопасногоРежима(Ложь);
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(АдресМенеджераСервиса) Тогда
		ВызватьИсключение НСтр("ru = 'Не заданы параметры подключения к менеджеру сервиса'")
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ПолучитьВерсииИнтерфейса(
		АдресМенеджераСервиса,
		ПользовательМенеджераСервиса,
		ПарольПользователяМенеджераСервиса,
		ИмяИнтерфейса);
	
КонецФункции

// См. РаботаВМоделиСервиса.НовыйПараметрыПодключенияКМенеджеруСервиса
Функция НовыйПараметрыПодключенияКМенеджеруСервиса(Адрес = "", Пользователь = "", Пароль = "") Экспорт
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("Адрес", Адрес);
	ПараметрыПодключения.Вставить("Пользователь", Пользователь);
	ПараметрыПодключения.Вставить("Пароль", Пароль);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

Функция МенеджерСервисаПоддерживаетОбновлениеВерсийПрограммныхИнтерфейсов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Сравнивает указанный пароль с ранее сохраненным паролем для текущего пользователя ИБ.
//
// Параметры:
//  Пароль - Строка - пароль, который нужно сравнить.
//
// Возвращаемое значение:
//  Булево - Истина, если пароль совпадает.
Функция ПарольТекущегоПользователяСовпадаетССохраненным(Знач Пароль) Экспорт
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Результат = ПроверитьСоответствиеПароляПользователяСохраняемомуЗначению(Пароль, ПользовательИБ);
	
	Возврат Результат; 
	
КонецФункции

#Область ПараметрыИБ

Функция ДобавитьКонстантуВТаблицуПараметровИБ(ТаблицаПараметров, Знач ИмяКонстанты, ВызыватьИсключение = Истина) Экспорт
	
	Если Не КонстантаМожетЯвлятьсяПараметромИБ(ИмяКонстанты) Тогда
		Если ВызыватьИсключение Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Константа %1 не может быть зарегистрирована в качестве параметра информационной базы'"),
				ИмяКонстанты);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	МетаданныеКонстанты = Метаданные.Константы[ИмяКонстанты]; // ОбъектМетаданныхКонстанта
	СтрокаПараметра = ТаблицаПараметров.Добавить();
	СтрокаПараметра.Имя = МетаданныеКонстанты.Имя;
	СтрокаПараметра.Описание = МетаданныеКонстанты.Синоним;
	// Конструктор используется для правильной сериализации определяемых типов констант
	СтрокаПараметра.Тип = Новый ОписаниеТипов(
		МетаданныеКонстанты.Тип.Типы(),
		МетаданныеКонстанты.Тип.КвалификаторыЧисла,
		МетаданныеКонстанты.Тип.КвалификаторыСтроки,
		МетаданныеКонстанты.Тип.КвалификаторыДаты); 
	СтрокаПараметра.ЗначениеПоУмолчанию = СтрокаПараметра.Тип.ПривестиЗначение(Неопределено);
	СтрокаПараметра.ДополнительнаяИнформация = ОбщегоНазначенияБТС.ПодсистемыОбъектаМетаданных(МетаданныеКонстанты);

	Возврат СтрокаПараметра;

КонецФункции

// Константа может являться параметром ИБ
// 
// Параметры:
//  ИмяКонстанты - Строка
// 
// Возвращаемое значение:
//  Булево
Функция КонстантаМожетЯвлятьсяПараметромИБ(ИмяКонстанты) Экспорт

	МетаданныеКонстанты = Метаданные.Константы.Найти(ИмяКонстанты);
	Если МетаданныеКонстанты = Неопределено
		Или РаботаВМоделиСервиса.ЭтоРазделенныйОбъектМетаданных(МетаданныеКонстанты.ПолноеИмя()) Тогда
		Возврат Ложь;
	КонецЕсли;

	ДопустимыеТипы = Новый ОписаниеТипов("Число, Строка, Дата, Булево");
	Для Каждого Тип Из МетаданныеКонстанты.Тип.Типы() Цикл
		Если Не ДопустимыеТипы.СодержитТип(Тип) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. ТехнологияСервиса.ПередОбновлениемИнформационнойБазы
Функция ПередОбновлениемИнформационнойБазы(ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	
	Если Не ОбщегоНазначения.РазделениеВключено() 
		Или РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
		
	РасширениеФреш = Неопределено;

	Для Каждого Расширение Из РасширенияКонфигурации.Получить(Новый Структура("Имя", "fresh"), ИсточникРасширенийКонфигурации.БазаДанных) Цикл
		
		РасширениеФреш = Расширение;
		Прервать;
		
	КонецЦикла;
	
	ДанныеПоставляемогоРасширенияФреш = ПолучитьОбщийМакет("fresh");
	УстановитьРасширениеФреш = Ложь;
	
	Если РасширениеФреш = Неопределено Тогда
		
		УстановитьРасширениеФреш = Истина;
		
	Иначе
		
		МетаданныеПоставляемогоРасширенияФреш = Новый ОбъектМетаданныхКонфигурация(ДанныеПоставляемогоРасширенияФреш);
		МетаданныеУстановленногоРасширенияФреш = Новый ОбъектМетаданныхКонфигурация(РасширениеФреш.ПолучитьДанные());
		
		Если Не РасширениеФреш.Активно
			Или РасширениеФреш.БезопасныйРежим
			Или РасширениеФреш.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях
			Или РасширениеФреш.ИспользоватьОсновныеРолиДляВсехПользователей
			Или ОбщегоНазначенияКлиентСервер.СравнитьВерсии(МетаданныеПоставляемогоРасширенияФреш.Версия, МетаданныеУстановленногоРасширенияФреш.Версия) > 0 Тогда
			
			РасширениеФреш.Удалить();
			УстановитьРасширениеФреш = Истина;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если УстановитьРасширениеФреш Тогда
				
		РасширениеФреш = РасширенияКонфигурации.Создать();
		
		СтруктураРеквизитовРасширения = Новый Структура();	
		СтруктураРеквизитовРасширения.Вставить("БезопасныйРежим", Ложь);
		ЗащитаОтОпасныхДействийНеПредупреждать = Новый ОписаниеЗащитыОтОпасныхДействий();
		ЗащитаОтОпасныхДействийНеПредупреждать.ПредупреждатьОбОпасныхДействиях = Ложь;
		СтруктураРеквизитовРасширения.Вставить("ЗащитаОтОпасныхДействий", ЗащитаОтОпасныхДействийНеПредупреждать);
		СтруктураРеквизитовРасширения.Вставить("ИспользоватьОсновныеРолиДляВсехПользователей", Ложь);	
		ЗаполнитьЗначенияСвойств(РасширениеФреш, СтруктураРеквизитовРасширения);

		РасширениеФреш.Записать(ДанныеПоставляемогоРасширенияФреш);
			
		ПараметрыОбновления = ОбновлениеИнформационнойБазыСлужебный.ПараметрыОбновления();
		ПараметрыОбновления.ВыполнятьОтложенныеОбработчики = ВыполнятьОтложенныеОбработчики;
			
		БлокировкаИБ = Новый Структура;
		БлокировкаИБ.Вставить("Установлена", Истина);
		БлокировкаИБ.Вставить("ОперативноеОбновление", Ложь);
		БлокировкаИБ.Вставить("РежимОтладки", Ложь);
		
		ПараметрыОбновления.УстановленнаяБлокировкаИБ = БлокировкаИБ;
	  	
		ПараметрыЗаданияОбновления = Новый Массив;
		ПараметрыЗаданияОбновления.Добавить(ПараметрыОбновления);
		
		УстановитьМонопольныйРежим(Истина);
		
		ДатаНачала = ТекущаяДатаСеанса();
		
		ЗаданиеОбновления = РасширенияКонфигурации.ВыполнитьФоновоеЗаданиеСРасширениямиБазыДанных(
			"ОбновлениеИнформационнойБазыБТС.ВыполнитьОбновлениеИнформационнойБазы", ПараметрыЗаданияОбновления);
		ЗаданиеОбновления = ЗаданиеОбновления.ОжидатьЗавершенияВыполнения();
		
		УстановитьМонопольныйРежим(Ложь);
		
		Если ЗаданиеОбновления.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			
			ВызватьИсключение ОбработкаОшибок.ПодробноеПредставлениеОшибки(ЗаданиеОбновления.ИнформацияОбОшибке);
			
		ИначеЕсли ЗаданиеОбновления.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			
			ВызватьИсключение НСтр("ru = 'Фоновое задание обновления информационной базы отменено'");
			
		КонецЕсли;	
		
		ДатаОкончания = ТекущаяДатаСеанса();
		ОбновлениеИнформационнойБазыСлужебный.ЗаписатьВремяВыполненияОбновления(ДатаНачала, ДатаОкончания);
	
		ОбновитьПовторноИспользуемыеЗначения();
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
			
КонецФункции

Функция ИменаМетодовРазрешенныхКЗапуску() Экспорт
	
	ИменаМетодов = Новый Массив();
	ИменаМетодов.Добавить(ВыгрузкаЗагрузкаДанныхСлужебный.ИмяМетодаВыгрузкиЗагрузкиДанныхВПотоке());
	
	Возврат ИменаМетодов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Функции определения типов объектов метаданных по полному имени объекта
// метаданных.

Функция ПроверкаТипаОбъектаМетаданныхПоПолномуИмени(Знач ПолноеИмя, Знач РусскаяЛокализация, Знач АнглийскаяЛокализация, Знач ПозицияПодстроки = 0)
	
	Подстроки = СтрРазделить(ПолноеИмя, ".");
	Если Подстроки.Количество() > ПозицияПодстроки Тогда
		ИмяТипа = Подстроки.Получить(ПозицияПодстроки);
		Возврат ИмяТипа = РусскаяЛокализация ИЛИ ИмяТипа = АнглийскаяЛокализация;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#Область ОчисткаДанных

Процедура ОчиститьДанныеИнформационнойБазы(УдалятьРасширения, УдалятьТекущегоПользователя = Истина)
	
	// Данные
	ОчиститьДанныеПоМоделиДанныхОбласти();
		
	// Пользователи
	УдалитьПользователейОбласти(УдалятьТекущегоПользователя);
		
	// Очистка истории.
	ОчиститьИсториюРаботыПользователей();
		
	// Настройки
	ОчиститьХранилищаНастроек();
		
	Если УдалятьРасширения Тогда
		// Расширения
		УдалитьРасширенияОбласти();
	КонецЕсли;	
	
КонецПроцедуры

Процедура УдалитьОбъектДанных(УдаляемыйОбъект)
	
	УдаляемыйОбъект.ОбменДанными.Загрузка = Истина;
	УдаляемыйОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
	УдаляемыйОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых");
	УдаляемыйОбъект.Удалить();

КонецПроцедуры

Функция ИсключитьОбъектИзОчистки(Объект, ПараметрыОбъекта)
	
	ИсключитьОбъект = Ложь;
	
	Если ПараметрыОбъекта.ПоддерживаютсяПредопределенные Тогда
		ИсключитьОбъект = Объект.Предопределенный;
	КонецЕсли;
	
	Возврат ИсключитьОбъект;
	
КонецФункции

Функция НовыеПараметрыУдаляемогоОбъекта()
	
	ПараметрыОбъекта = Новый Структура();
	ПараметрыОбъекта.Вставить("ПоддерживаютсяПредопределенные", Ложь);
	
	Возврат ПараметрыОбъекта;
	
КонецФункции

// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ОтключитьИОчиститьИсториюДанных(ОбъектМетаданных)
	
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Расширение = ОбъектМетаданных.РасширениеКонфигурации();
	
	Если Расширение <> Неопределено
		И Не РаботаВМоделиСервисаСлужебныйПовтИсп.РасширениеПоддерживаетИсториюДанных(Расширение.Имя) Тогда
		Возврат;
	КонецЕсли;
	
	ИсторияДанных.УдалитьВерсии(ОбъектМетаданных);
	
	НастройкиИстории = ИсторияДанных.ПолучитьНастройки(ОбъектМетаданных);
	Если НастройкиИстории <> Неопределено Тогда
		ИсторияДанных.УстановитьНастройки(ОбъектМетаданных, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьДанныеПоМоделиДанныхОбласти()
	
	МодельДанных = РаботаВМоделиСервиса.ПолучитьМодельДанныхОбласти();
	
	ИсключенияОчистки = Новый Массив();
	ИсключенияОчистки.Добавить(Метаданные.РегистрыСведений.ФайлыВременногоХранилища.ПолноеИмя());
	ИсключенияОчистки.Добавить(Метаданные.Константы.ИнформацияОПроцедуреЗагрузки.ПолноеИмя());
	ИсключенияОчистки.Добавить(Метаданные.Константы.ПараметрыЗапускаИнтерактивнойПроцедурыЗагрузки.ПолноеИмя());
	ИсключенияОчистки.Добавить(Метаданные.Константы.УстановленаМонопольнаяБлокировка.ПолноеИмя());
	
	ИнтеграцияПодсистемБТС.ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
	РаботаВМоделиСервисаПереопределяемый.ПриЗаполненииИсключенийОчисткиДанныхИБ(ИсключенияОчистки);
		
	Для Каждого ЭлементМодели Из МодельДанных Цикл
		
		ПолноеИмяОбъектаМетаданных = ЭлементМодели.Ключ;
		ОписаниеОбъектаМетаданных = ЭлементМодели.Значение; // ОбъектМетаданных
		
		Если ИсключенияОчистки.Найти(ПолноеИмяОбъектаМетаданных) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		РаботаВМоделиСервиса.ОчиститьДанныеОбъектаМетаданных(ПолноеИмяОбъектаМетаданных, ОписаниеОбъектаМетаданных);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьИсториюРаботыПользователей()
	
	ИсторияРаботыПользователя.ОчиститьВсе();
	
КонецПроцедуры

Процедура ОчиститьХранилищаНастроек()
	
	Хранилища = Новый Массив;
	Хранилища.Добавить(ХранилищеВариантовОтчетов);
	Хранилища.Добавить(ХранилищеНастроекДанныхФорм);
	Хранилища.Добавить(ХранилищеОбщихНастроек);
	Хранилища.Добавить(ХранилищеПользовательскихНастроекОтчетов);
	Хранилища.Добавить(ХранилищеСистемныхНастроек);
	Хранилища.Добавить(ХранилищеПользовательскихНастроекДинамическихСписков);
	
	Для Каждого Хранилище Из Хранилища Цикл
		
		Если ТипЗнч(Хранилище) <> Тип("СтандартноеХранилищеНастроекМенеджер") Тогда
			
			// Настройки будут удалены при очистке данных.
			Продолжить;
			
		КонецЕсли;
		
		Хранилище.Удалить(Неопределено, Неопределено, Неопределено);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки_МетаданныеКУдалению(Типы)
	
	// Константы
	Типы.Добавить(Метаданные.Константы.УдалитьТипыИнцидентовЦККАктуальны);
	Типы.Добавить(Метаданные.Константы.УдалитьКлючОбластиДанных);
	Типы.Добавить(Метаданные.Константы.УдалитьПредставлениеОбластиДанных);
	Типы.Добавить(Метаданные.Константы.УдалитьИспользоватьВыгрузкуВСводноеПриложение);
	Типы.Добавить(Метаданные.Константы.УдалитьИспользоватьКонтрольТарификации);
	Типы.Добавить(Метаданные.Константы.УдалитьВыполнитьРезервноеКопированиеОбластиДанных);
	Типы.Добавить(Метаданные.Константы.УдалитьДатаПоследнегоСтартаКлиентскогоСеанса);
	
	// РегистрыСведений
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьСведенияОПользователяхСервиса);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьОбластиДанных);	
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьСводныеПриложенияОчередьЗагрузки);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьСводныеПриложенияСостояниеЗагрузки);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьСводныеПриложенияСостояниеВыгрузки);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьФайлыОбластейДанных);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьДоступныеЛицензии);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьЗанятыеЛицензии);
	Типы.Добавить(Метаданные.РегистрыСведений.УдалитьСвойстваЗаданий);
	
	// Справочники
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы, Метаданные.Справочники.УдалитьУслугиСервиса, ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы, Метаданные.Справочники.УдалитьПоставщикиУслугСервиса, ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	
КонецПроцедуры

Процедура ПриЗаполненииТиповИсключаемыхИзПроверкиУстраненияПроблемы_МетаданныеКУдалению(Типы)

	Типы.Добавить(Метаданные.Справочники.УдалитьОбработчикиОчередиЗаданий);
	Типы.Добавить(Метаданные.Справочники.УдалитьОчередьЗаданий);
	Типы.Добавить(Метаданные.Справочники.УдалитьОчередьЗаданийУстаревший);
	Типы.Добавить(Метаданные.Справочники.УдалитьШаблоныЗаданийОчереди);
	Типы.Добавить(Метаданные.Справочники.УдалитьПоставляемыеДанные);
	Типы.Добавить(Метаданные.Справочники.УдалитьПоставляемыеРасширения);
	Типы.Добавить(Метаданные.Справочники.УдалитьВерсииПоставляемыхРасширений);
	Типы.Добавить(Метаданные.Справочники.УдалитьИсторияПроверкиИКорректировкиДанных);
	Типы.Добавить(Метаданные.Справочники.УдалитьУслугиСервиса);
	Типы.Добавить(Метаданные.Справочники.УдалитьПоставщикиУслугСервиса);
	Типы.Добавить(Метаданные.Справочники.УдалитьОповещенияПользователей);
	Типы.Добавить(Метаданные.Справочники.УдалитьИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы);
	
КонецПроцедуры

#КонецОбласти