// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Кадровый перевод при создании формы на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура КадровыйПереводПриСозданииФормыНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	ЗаполнитьФормуКадровогоПереводаНаОснованииРешенияОКадровомПереводе(Форма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить форму кадрового перевода на основании решения о кадровом переводе.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ЗаполнитьФормуКадровогоПереводаНаОснованииРешенияОКадровомПереводе(Форма)
	
	Если Не Форма.Параметры.Свойство("Ключ") Или Не Форма.Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание")) 
		<> Тип("ДокументСсылка.РешениеОКадровомПереводе") Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Параметры.ПереводВПодразделение = Форма.Объект.Подразделение;
	Форма.Параметры.ПереводНаПозицию = Форма.Объект.ДолжностьПоШтатномуРасписанию;
	Форма.Параметры.ПереводНаРабочееМесто = Форма.Объект.РабочееМесто;
	
КонецПроцедуры

#КонецОбласти