//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем Соединение; // HTTPСоединение

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Код - Строка
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция Подключить(Код) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	КодАвторизации = Код;
	
	СтруктураМаркеров = СтруктураМаркеров();
	
	Если ЗначениеЗаполнено(СтруктураМаркеров.МаркерДоступа) Тогда
		Результат.Подключен = Истина;
		
		ИнформацияОПользователе = ИнформацияОПользователе();
		
		Результат.МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
		Результат.ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
		
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
		Результат.ИдентификаторПользователя = ИнформацияОПользователе.ИдентификаторКомпании;
		Результат.КодАвторизации = КодАвторизации;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Показыватьпредупреждение- Булево
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе
Функция ИнформацияОПользователе(Показыватьпредупреждение = Истина) Экспорт
	
	ИнформацияОПользователе = РекрутинговыеСайтыСлужебный.НоваяИнформацияОПользователе();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("v1/integrations/users/me");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ИнформацияОПользователеХабр = ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса);
	Иначе
		Если Показыватьпредупреждение Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеИнформацияОПользователе(Сайт, ЭтотОбъект, РезультатЗапроса);
		КонецЕсли;
		
		Возврат ИнформацияОПользователе;
	КонецЕсли;
	
	ИнформацияОПользователе.ИмяПользователя = ИнформацияОПользователеХабр.email;
	ИнформацияОПользователе.ИдентификаторКомпании = ИнформацияОПользователеХабр.login;
	ИнформацияОПользователе.ИдентификаторПользователя = ИнформацияОПользователеХабр.login;
	
	Возврат ИнформацияОПользователе;
	
КонецФункции

// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
// 
// Параметры:
//  Показыватьпредупреждение - Булево -
Функция ПроверитьПодключение(Показыватьпредупреждение = Истина) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта();
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если ЗначениеЗаполнено(РеквизитыСайта) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
		Результат.Подключен = МаркерАктивен(Показыватьпредупреждение);
	КонецЕсли;
	
	Если Результат.Подключен Тогда
		ИнформацияОПользователе = ИнформацияОПользователе();
		Результат.ИмяПользователя = ИнформацияОПользователе.ИмяПользователя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращаемое значение:
//  ФиксированнаяСтруктура:
// * companies - Массив Из Структура: См. СтруктураДанных
// * cities - Структура: См. ЗагрузитьРегионы
// * specializations - Массив Из Структура: 
// ** Наименование - Строка -
// ** Специализации - Массив Из Структура: См. СтруктураДанных
// * currency - Массив Из Структура: См. СтруктураДанных
// * skills - Массив Из Структура: См. СтруктураДанных
// * remote - Массив Из Структура: См. СтруктураДанных
// * employment_type - Массив Из Структура: См. СтруктураДанных
// * placement_type - Массив Из Структура: См. СтруктураДанных
// * skip_placement - Массив Из Структура: См. СтруктураДанных
Функция ЗагрузитьКлассификаторы() Экспорт
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы <> Неопределено Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат Классификаторы;
	КонецЕсли;
	
	Компании = ЗагрузитьКомпанииПользователя();
	Регионы = ЗагрузитьРегионы();
	Специализации = ЗагрузитьСпециализации();
	Навыки = ЗагрузитьНавыки();
	Валюты = КлассификаторВалют();
	
	УдаленнаяРабота = Новый Массив();
	УдаленнаяРабота.Добавить(СтруктураДанных(0, НСтр("ru = 'Работа в офисе'")));
	УдаленнаяРабота.Добавить(СтруктураДанных(1, НСтр("ru = 'Удаленная работа'")));
	
	ТипЗанятости = Новый Массив();
	ТипЗанятости.Добавить(СтруктураДанных("full_time", НСтр("ru = 'Полная занятость'")));
	ТипЗанятости.Добавить(СтруктураДанных("part_time", НСтр("ru = 'Частичная занятость'")));
	
	ТипРазмещения = Новый Массив();
	ТипРазмещения.Добавить(СтруктураДанных(0, НСтр("ru = '«Стандарт»'")));
	ТипРазмещения.Добавить(СтруктураДанных(1, НСтр("ru = '«Стандарт плюс»'")));
	
	НеОплачиватьРазмещение = Новый Массив();
	НеОплачиватьРазмещение.Добавить(СтруктураДанных(0, НСтр("ru = 'Оплачивать'")));
	НеОплачиватьРазмещение.Добавить(СтруктураДанных(1, НСтр("ru = 'Не оплачивать'")));
	
	Классификаторы = Новый Структура();
	Классификаторы.Вставить("companies", Компании);
	Классификаторы.Вставить("cities", Регионы);
	Классификаторы.Вставить("specializations", Специализации);
	Классификаторы.Вставить("currency", Валюты);
	Классификаторы.Вставить("skills", Навыки);
	Классификаторы.Вставить("remote", УдаленнаяРабота);
	Классификаторы.Вставить("employment_type", ТипЗанятости);
	Классификаторы.Вставить("placement_type", ТипРазмещения);
	Классификаторы.Вставить("skip_placement", НеОплачиватьРазмещение);
	
	КлассификаторыФикс = ОбщегоНазначения.ФиксированныеДанные(Классификаторы);
	
	ТекущиеПараметры =
		РекрутинговыеСайтыСлужебный.СоответствиеПоФиксированномуСоответствию(ПараметрыСеанса.ПараметрыКлиентаНаСервере);
	ТекущиеПараметры.Вставить("Классификаторы" + ДанныеСайта().Имя, КлассификаторыФикс);
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(ТекущиеПараметры);
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат КлассификаторыФикс;
	
КонецФункции

Функция ВакансииССайта(БылиОшибки = Ложь, Архивные = Ложь) Экспорт
	
	Вакансии = НоваяКоллекцияВакансий();
	
	РезультатСОшибкой = РекрутинговыеСайтыСлужебный.НовыйРезультатЗапроса();
	
	ТекстЗапроса = СтрШаблон("v1/integrations/vacancies%1", ?(Архивные, "/archived", ""));
	
	ЗаполнитьКоллекциюПостраничногоОтвета(Вакансии, ТекстЗапроса, "vacancies", РезультатСОшибкой);
	
	Если РезультатСОшибкой.Ошибка Тогда
		БылиОшибки = Истина;
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияВакансий(Сайт, ЭтотОбъект, РезультатСОшибкой);
	КонецЕсли;
	
	Возврат Вакансии;
	
КонецФункции

// Параметры:
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  Строка - Строка
Функция АдресВакансии(Идентификатор) Экспорт
	
	Возврат СтрШаблон("%1vacancies/%2/", ДанныеСайта().ГлавнаяСтраница, Идентификатор);
	
КонецФункции

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ИдентификаторРезюмеПоАдресу(АдресРезюме) Экспорт
	
	ИдентификаторРезюме = АдресРезюме;
	
	Разделитель = "/";
	
	Пока РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель) > 0 Цикл
		НомерВхожденияРазделителя = 
			РекрутинговыеСайтыКлиентСервер.НайтиВСтроке(ИдентификаторРезюме, Разделитель);
		ИдентификаторРезюме = 
			Сред(ИдентификаторРезюме, 
				НомерВхожденияРазделителя + СтрДлина(Разделитель), 
				СтрДлина(ИдентификаторРезюме) - НомерВхожденияРазделителя);
	КонецЦикла;
	
	Возврат ИдентификаторРезюме;

КонецФункции

// Параметры:
//  ИдентификаторРезюме - Строка
// 
// Возвращаемое значение:
//  Структура
Функция ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме) Экспорт
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	РезюмеССайта = РезюмеССайта(ИдентификаторРезюме);
	
	Если ЗначениеЗаполнено(РезюмеССайта) Тогда
		ДанныеКандидата = ДанныеКандидатаПоРезюме(РезюмеССайта);
	Иначе
		ВызватьИсключение РекрутинговыеСайтыСлужебный.ТекстИсключенияПриОшибкеЗагрузкиРезюмеПоСсылке(Сайт);
	КонецЕсли;
	
	Возврат ДанныеКандидата;

КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОпубликоватьВакансию(Дерево) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево);
	
	Запрос = НовыйHTTPЗапрос("v1/integrations/vacancies");
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		ДанныеПубликации = ПрочитатьОтветПубликацияВакансии(РезультатЗапроса);
		Результат.ИдентификаторВакансии = Формат(ДанныеПубликации.vacancy.id, "ЧГ=;");
	Иначе
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойПубликацииВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии) Экспорт
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией();
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	JSONОписаниеВакансии = JSONОписаниеВакансии(Дерево, Истина);
	
	ТекстЗапроса = СтрШаблон("v1/integrations/vacancies/%1", ИдентификаторВакансии);
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	Запрос.УстановитьТелоИзСтроки(JSONОписаниеВакансии, , ИспользованиеByteOrderMark.НеИспользовать);
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Изменить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойОбновленияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Вакансия - СправочникСсылка.Вакансии
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ПовторноОпубликоватьВакансию(Дерево, Вакансия, ИдентификаторВакансии) Экспорт
	
	Результат = ИзменитьСтатусПубликацииВакансии(ИдентификаторВакансии);
	
	Если Результат.Успешно Тогда
		Результат = ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
		
		ДатаСеанса = ТекущаяДатаСеанса();
		
		СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
		СвойстваПубликации.Опубликована = Истина;
		СвойстваПубликации.ДатаПубликации = ДатаСеанса;
		СвойстваПубликации.ДатаОбновления = ДатаСеанса;
	Иначе
		Результат = СнятьПубликациюВакансии(ИдентификаторВакансии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция СнятьПубликациюВакансии(ИдентификаторВакансии) Экспорт
	
	Возврат ИзменитьСтатусПубликацииВакансии(ИдентификаторВакансии);
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
// - Неопределено
// - Структура: См. РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии
Функция СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии) Экспорт
	
	СвойстваПубликации = РекрутинговыеСайтыСлужебный.НовыеСвойстваПубликацииВакансии();
	
	Если Не УстановитьСоединение() Тогда
		Возврат СвойстваПубликации;
	КонецЕсли;
	
	ВакансииССайта = ВакансииССайта();
	
	Для Каждого ВакансияССайта Из ВакансииССайта Цикл
		Если Строка(ВакансияССайта.id) = ИдентификаторВакансии Тогда
			ОписаниеВакансии = ВакансияССайта;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ОписаниеВакансии) Тогда
		АрхивныеВакансииССайта = ВакансииССайта(Ложь, Истина);
		
		Для Каждого ВакансияССайта Из АрхивныеВакансииССайта Цикл
			Если ВакансияССайта.id = ИдентификаторВакансии Тогда
				ОписаниеВакансии = ВакансияССайта;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеВакансии) Тогда
		СвойстваПубликации.Опубликована = ОписаниеВакансии.published;
		
		СвойстваПубликации.ДатаПубликации =
			РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ОписаниеВакансии.published_at, Истина);
		СвойстваПубликации.ДатаОбновления = СвойстваПубликации.ДатаПубликации;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СвойстваПубликации;
	
КонецФункции

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Структура: см. РекрутинговыеСайтыСлужебный.НовыеВидыПолей
Функция ВидыПолей(ОбновлениеПубликации) Экспорт
	
	ВидыПолей = РекрутинговыеСайтыСлужебный.НовыеВидыПолей();
	
	ВидыПолей.СМножественнымВыборомИзДерева = ПоляВакансииСМножественнымВыборомИзДерева();
	ВидыПолей.СОдиночнымВыборомИзДерева = ПоляВакансииСОдиночнымВыборомИзДерева();
	ВидыПолей.СОдиночнымВыборомИзСписка = ПоляВакансииСОдиночнымВыборомИзСписка();
	ВидыПолей.СТекстомВHTML = ПоляВакансииСТекстомВHTML();
	
	Возврат ВидыПолей;
	
КонецФункции

// Параметры:
//  ИмяСписка - Строка
//  Значение - Строка
// 
// Возвращаемое значение:
//  Неопределено
Функция ЭлементКлассификатора(ИмяСписка, Значение) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

// Параметры:
//  Путь - Строка
// 
// Возвращаемое значение:
//  СписокЗначений Из Строка, Число
Функция СписокВыбораПоКлассификатору(Путь) Экспорт
	
	СписокВыбора = Новый СписокЗначений;
	
	Если Не ЗначениеЗаполнено(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Классификаторы = КлассификаторыСайта();
	Если Классификаторы = Неопределено Или Не Классификаторы.Свойство(Путь) Тогда
		Возврат СписокВыбора;
	КонецЕсли;
	
	Классификатор = Классификаторы[Путь]; // Массив Из Структура: См. СтруктураДанных
	Для Каждого ЭлементКлассификатора Из Классификатор Цикл
		СписокВыбора.Добавить(ЭлементКлассификатора.alias, ЭлементКлассификатора.name);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

// Параметры:
//  Вакансия - Структура
//  Реквизит - Строка
// 
// Возвращаемое значение:
//  Произвольный
Функция ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит) Экспорт
	
	Результат = Неопределено;
	
	Если Реквизит = "Наименование" Тогда
		Результат = ЗначениеСвойстваУзла(Вакансия, "title", , , "");
	ИначеЕсли Реквизит = "ПредполагаемыйДоход" Тогда
		Результат = ЗначениеСвойстваУзла(Вакансия, "expanded_salary", "to", , 0);
	ИначеЕсли Реквизит = "ДатаОткрытия" Тогда
		Результат = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "published_at"));
	ИначеЕсли Реквизит = "ПланируемаяДатаЗакрытия" Тогда
		Результат =
			ДобавитьМесяц(РекрутинговыеСайтыСлужебный.ДатаПоСтроке(ЗначениеСвойстваУзла(Вакансия, "published_at")), 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
//  Дерево - ДеревоЗначений: См. РекрутинговыеСайтыСлужебный.НовоеДеревоПубликацииВакансии
//  СтруктураВакансииССайта - Структура
Процедура ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	НоваяСтрока = Дерево.Строки.Добавить();
	НоваяСтрока.Показатель = Вакансия;
	
	ПредполагаемыйДоходОт = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "expanded_salary", "from");
	Если ЗначениеЗаполнено(ПредполагаемыйДоходОт) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_from";
		НовоеПоле.ПубликацияВакансии = ПредполагаемыйДоходОт;
	КонецЕсли;
	
	ПредполагаемыйДоходДо = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "expanded_salary", "to");
	Если ЗначениеЗаполнено(ПредполагаемыйДоходДо) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "salary_to";
		НовоеПоле.ПубликацияВакансии = ПредполагаемыйДоходДо;
	КонецЕсли;
	
	Валюта = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "expanded_salary", "currency");
	Если ЗначениеЗаполнено(Валюта) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "currency";
		
		СписокВалюта = Новый СписокЗначений();
		
		КлассификаторВалют = КлассификаторВалют();
		
		Представление = "";
		Для Каждого ЭлементКлассификатора Из КлассификаторВалют Цикл
			Если ЭлементКлассификатора.alias = Валюта Тогда
				Представление = ЭлементКлассификатора.name;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		СписокВалюта.Добавить(Валюта, Представление);
		НовоеПоле.ПубликацияВакансии = СписокВалюта;
	КонецЕсли;
	
	Компания = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "company");
	Если ЗначениеЗаполнено(Компания) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "company";
		
		СписокКомпания = Новый СписокЗначений();
		СписокКомпания.Добавить(ЗначениеСвойстваУзла(Компания, "alias_name"), ЗначениеСвойстваУзла(Компания, "name"));
		НовоеПоле.ПубликацияВакансии = СписокКомпания;
	КонецЕсли;
	
	Навыки = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "skills");
	Если ЗначениеЗаполнено(Навыки) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "skills";
		
		СписокНавыки = Новый СписокЗначений();
		
		Для Каждого Навык Из Навыки Цикл
			СписокНавыки.Добавить(ЗначениеСвойстваУзла(Навык, "value"), ЗначениеСвойстваУзла(Навык, "title"));
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии = СписокНавыки;
	КонецЕсли;
	
	Специализации = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "specializations");
	Если ЗначениеЗаполнено(Специализации) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "specialization_ids";
		
		СписокСпециализации= Новый СписокЗначений();
		
		Для Каждого Специализация Из Специализации Цикл
			СписокСпециализации.Добавить(
				ЗначениеСвойстваУзла(Специализация, "id"), ЗначениеСвойстваУзла(Специализация, "title", "ru"));
		КонецЦикла;
		
		НовоеПоле.ПубликацияВакансии = СписокСпециализации;
	КонецЕсли;
	
	Наименование = ЗначениеСвойстваУзла(СтруктураВакансииССайта, "title");
	Если ЗначениеЗаполнено(Наименование) Тогда
		НовоеПоле = НоваяСтрока.Строки.Добавить();
		НовоеПоле.Путь = "title";
		НовоеПоле.ПубликацияВакансии = Наименование;
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ОбновлениеПубликации - Булево
// 
// Возвращаемое значение:
//  Массив Из Структура: См. СтруктураПоля
Функция ПоляВакансии(ОбновлениеПубликации = Ложь) Экспорт
	
	ТипЗначенияJSONСтрока = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONСтрока();
	ТипЗначенияJSONЧисло = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONЧисло();
	ТипЗначенияJSONНачалоМассива = РекрутинговыеСайтыСлужебный.ТипЗначенияJSONНачалоМассива();

	МассивПолей = Новый Массив;
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "company";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Компания'");
	СтруктураПоля.Использование = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "title";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Название вакансии (макс. 80 символов)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salary_from";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Вознаграждение от'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "salary_to";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONЧисло;
	СтруктураПоля.Описание = НСтр("ru = 'Вознаграждение до'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "currency";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Валюта'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "city_id";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Город'");
	СтруктураПоля.Использование = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "remote";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Формат работы'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "employment_type";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Тип занятости'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "description";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Описание вакансии'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "bonuses";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Бонусы вакансии'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "instructions";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONСтрока;
	СтруктураПоля.Описание = НСтр("ru = 'Дополнительные инструкции'");
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "skills";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Навыки (от 1 до 10)'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "specialization_ids";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Специализация'");
	СтруктураПоля.Обязательное = Истина;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "placement_type";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Тип размещения'");
	СтруктураПоля.Использование = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	СтруктураПоля = СтруктураПоля();
	СтруктураПоля.Путь = "skip_placement";
	СтруктураПоля.ТипJSON = ТипЗначенияJSONНачалоМассива;
	СтруктураПоля.Описание = НСтр("ru = 'Не оплачивать размещение'");
	СтруктураПоля.Использование = Не ОбновлениеПубликации;
	МассивПолей.Добавить(СтруктураПоля);
	
	Возврат МассивПолей;
	
КонецФункции

// Параметры:
//  Классификатор - Строка
//  Дерево - ДеревоЗначений:
//  * Идентификатор - Строка, Число -
//  * Значение - Строка -
// 
// Возвращаемое значение:
//  Булево
Функция ЗаполнитьДеревоКлассификатора(Классификатор, Дерево) Экспорт
	
	Результат = Ложь;
	
	Если Классификатор = "cities" Тогда
		Результат = ЗаполнитьДеревоРегионов(Дерево);
	ИначеЕсли Классификатор = "skills" Тогда
		Результат = ЗаполнитьДеревоНавыков(Дерево);
	ИначеЕсли Классификатор = "specializations" Тогда
		Результат = ЗаполнитьДеревоСпециализаций(Дерево);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Вакансия - СправочникСсылка.Вакансии
Процедура ПолучитьОтклики(Вакансия) Экспорт
	
	ИдентификаторыВакансии = РекрутинговыеСайтыСлужебный.ИдентификаторыПубликацийВакансии(Вакансия, Сайт);
	
	Если Не ЗначениеЗаполнено(ИдентификаторыВакансии) Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОтсутствииПубликации(Сайт);
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьПодключение().Подключен Тогда
		РекрутинговыеСайтыСлужебный.ЗаписатьОшибкуПолученияОткликов(Сайт, Пользователь);
		Возврат;
	КонецЕсли;
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	ЗагруженныеОткликиВакансии = РекрутинговыеСайтыСлужебный.ЗагруженныеОткликиВакансии(Вакансия);
	НовыеОтклики = РекрутинговыеСайтыСлужебный.НоваяТаблицаОткликов();
	
	Для Каждого ИдентификаторВакансии Из ИдентификаторыВакансии Цикл
		Отклики = НоваяКоллекцияОткликов();
		ТекстЗапроса = СтрШаблон("v1/integrations/vacancies/%1/responses", ИдентификаторВакансии);
		РезультатСОшибкой = РекрутинговыеСайтыСлужебный.НовыйРезультатЗапроса();
		
		ЗаполнитьКоллекциюПостраничногоОтвета(Отклики, ТекстЗапроса, "responses", РезультатСОшибкой);
		
		Если РезультатСОшибкой.Ошибка Тогда
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеПолученияОткликов(Сайт, ЭтотОбъект, РезультатСОшибкой);
			Возврат;
		КонецЕсли;
		
		Для Каждого Отклик Из Отклики Цикл
			ИдентификаторРезюме = Отклик.user.login;
			
			Если ЗагруженныеОткликиВакансии.Найти(ИдентификаторРезюме) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеКандидата = ДанныеКандидата(Отклик.user.login);
			
			ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Отклик.user.name);
			
			НоваяЗапись = НовыеОтклики.Добавить();
			НоваяЗапись.Вакансия = Вакансия;
			НоваяЗапись.НомерОтклика = Отклик.id;
			НоваяЗапись.Фамилия = ФИО.Фамилия;
			НоваяЗапись.Имя = ФИО.Имя;
			НоваяЗапись.ДатаРождения = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(Отклик.user.birthday);
			НоваяЗапись.Отчество = ФИО.Отчество;
			НоваяЗапись.Телефон = ДанныеКандидата.Телефон;
			НоваяЗапись.EMail = ДанныеКандидата.EMail;
			НоваяЗапись.Источник = Сайт;
			НоваяЗапись.ДатаОтклика = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(Отклик.created_at);
			НоваяЗапись.ИдентификаторРезюме = ИдентификаторРезюме;
			НоваяЗапись.Адрес = СтрШаблон("%1, %2", Отклик.user.location.city, Отклик.user.location.country);
			НоваяЗапись.АдресРезюме = СтрШаблон("%1%2", ДанныеСайта().ГлавнаяСтраница, Отклик.user.login);
			НоваяЗапись.Сообщение = Отклик.body;
		КонецЦикла;
	КонецЦикла;
	
	РекрутинговыеСайтыСлужебный.ЗаписатьОтклики(НовыеОтклики, Пользователь);
	
КонецПроцедуры

// Параметры:
//  АдресРезюме - Строка
// 
// Возвращаемое значение:
//  Структура: См. ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме
Функция ДоступныеДляПолученияКонтакты(АдресРезюме) Экспорт
	
	Возврат ПодборПерсоналаКлиентСервер.ДоступностьКонтактовВРезюме();
	
КонецФункции

// Параметры:
//  КодСостояния - Число
//  ОписаниеОшибки - Строка
// 
// Возвращаемое значение:
//  Строка
Функция УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки) Экспорт
	
	УточненноеОписаниеОшибки = "";
	
	Возврат УточненноеОписаниеОшибки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыеДанныеСайта
Функция ДанныеСайта()
	
	Возврат ДанныеСайта;
	
КонецФункции

Функция УстановитьСоединение()
	
	Результат = Истина;
	
	Если Не ЗначениеЗаполнено(МаркерДоступа) Тогда
		Результат = Инициализировать();
	КонецЕсли;
	
	Если Соединение = Неопределено Тогда
		Соединение = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресСервера());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Инициализировать()
	
	РеквизитыСайта = РекрутинговыеСайтыСлужебный.РеквизитыСайта(Сайт, Пользователь);
	
	Если РеквизитыСайта = Неопределено Или Не ЗначениеЗаполнено(РеквизитыСайта.МаркерДоступа) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не настроена интеграция с %1.'"), АдресСайта());
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыСайта);
	
	Возврат МаркерАктивен();
	
КонецФункции

Функция МетодыЗапросов()
	
	Возврат РекрутинговыеСайтыСлужебный.МетодыЗапросов();
	
КонецФункции

Функция ВыполнитьHTTPЗапрос(Метод, Запрос, ВызыватьИсключение = Истина)
	
	Возврат РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение);
	
КонецФункции

// Возвращаемое значение:
// См. РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров
Функция СтруктураМаркеров()
	
	СтруктураМаркеров = РекрутинговыеСайтыСлужебный.НоваяСтруктураМаркеров();
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляХабрКарьера();
	Структура_token_uri = ОбщегоНазначенияКлиентСервер.СтруктураURI(ИдентификаторПриложения.token_uri);
	АдресАутентификации = Структура_token_uri.Хост;
	РесурсНаСервере = Структура_token_uri.ПутьНаСервере;
	
	СтрокаЗапроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		"grant_type=authorization_code&client_id=%1&client_secret=%2&redirect_uri=%3&code=%4",
		ИдентификаторПриложения.client_id,
		ИдентификаторПриложения.client_secret,
		ИдентификаторПриложения.redirect_uri,
		КодАвторизации); 
	
	СоединениеАутентификации = РекрутинговыеСайтыСлужебный.НовоеHTTPСоединение(АдресАутентификации, Истина);
	
	// Формируем общие заголовки.
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Запрос = Новый HTTPЗапрос(РесурсНаСервере, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
	
	РезультатЗапроса = РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос(
		СоединениеАутентификации, МетодыЗапросов().ОтправитьДляОбработки, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибкеАвторизации(Сайт, ЭтотОбъект, РезультатЗапроса);
		Возврат СтруктураМаркеров;
	КонецЕсли;
	
	ОтветОбъект = ПрочитатьОтветМаркерыДоступа(РезультатЗапроса);
	
	СтруктураМаркеров.МаркерДоступа = ОтветОбъект.access_token;
	СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа = Дата(3999, 12, 31);
	
	МаркерДоступа = СтруктураМаркеров.МаркерДоступа;
	ДатаОкончанияДействияМаркераДоступа = СтруктураМаркеров.ДатаОкончанияДействияМаркераДоступа;
	
	Возврат СтруктураМаркеров;
	
КонецФункции

Функция МаркерАктивен(Показыватьпредупреждение = Истина)
	
	МаркерДействителен = ЗначениеЗаполнено(МаркерДоступа) 
			И ДатаОкончанияДействияМаркераДоступа > ТекущаяДатаСеанса();
		
	МаркерАктивен = Ложь;
		
	Если МаркерДействителен Тогда
		МаркерАктивен = СайтДоступен(Показыватьпредупреждение);
	КонецЕсли;
		
	Возврат МаркерАктивен;
	
КонецФункции

Функция СайтДоступен(Показыватьпредупреждение = Истина)
	
	Возврат ЗначениеЗаполнено(ИнформацияОПользователе(Показыватьпредупреждение).ИмяПользователя);
	
КонецФункции

Функция НовыйHTTPЗапрос(ТекстЗапроса)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("User-Agent", ЗарплатаКадры.ИмяКлиентскогоПриложения());
	Заголовки.Вставить("Content-Type", "application/json");
	
	Если ЗначениеЗаполнено(МаркерДоступа) Тогда
		Заголовки.Вставить("Authorization", "Bearer " + МаркерДоступа);
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
	Возврат Запрос;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция АдресСервера()
	
	Возврат ДанныеСайта().АдресЗапроса;
	
КонецФункции

// Возвращаемое значение:
//  Строка
Функция АдресСайта()
	
	Возврат ДанныеСайта().ИмяСайта;
	
КонецФункции

// Параметры:
//  Коллекция - Массив из Структура
//  ТекстЗапроса - Строка
//  ИмяКоллекции - Строка
//  РезультатСОшибкой - Структура: См. РекрутинговыеСайтыСлужебный.НовыйРезультатЗапроса
Процедура ЗаполнитьКоллекциюПостраничногоОтвета(Коллекция, ТекстЗапроса, ИмяКоллекции, РезультатСОшибкой)
	
	Если Не УстановитьСоединение() Тогда
		Возврат;
	КонецЕсли;
	
	НомерСтраницы = 0;
	НаСтранице = 20;
	Всего = 1;
	
	Пока Всего > НаСтранице * НомерСтраницы Цикл
		Запрос = НовыйHTTPЗапрос(СтрШаблон("%1?page=%2", ТекстЗапроса, НомерСтраницы));
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			РезультатСОшибкой = РезультатЗапроса;
			Прервать;
		Иначе
			ПостраничныйОтвет = ПрочитатьПостраничныйОтвет(РезультатЗапроса);
			
			НаСтранице = ПостраничныйОтвет.pagination.per;
			Всего = ПостраничныйОтвет.pagination.total;
			
			КоллекцияССайта = ПостраничныйОтвет[ИмяКоллекции]; // Массив из Структура
			Для Каждого ЭлементКоллекции Из КоллекцияССайта Цикл
				Коллекция.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
		
		НомерСтраницы = НомерСтраницы + 1;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Логин - Строка
// 
// Возвращаемое значение:
//  Структура:
// * Телефон - Строка
// * EMail - Строка
Функция ДанныеКандидата(Логин)
	
	Результат = Новый Структура("Телефон, EMail", "", "");
	
	РезюмеССайта = РезюмеССайта(Логин);
	
	Если ЗначениеЗаполнено(РезюмеССайта) Тогда
		Если РезюмеССайта.contacts.phones.Количество() <> 0 Тогда
			Результат.Телефон = РезюмеССайта.contacts.phones[0].value;
		КонецЕсли;
		
		Если РезюмеССайта.contacts.emails.Количество() <> 0 Тогда
			Результат.EMail = РезюмеССайта.contacts.emails[0].value;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Логин - Строка
// 
// Возвращаемое значение:
//  Структура: См. ПрочитатьОтветДанныеКандидата
Функция РезюмеССайта(Логин)
	
	Результат = Новый Структура();
	
	Если Не УстановитьСоединение() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТекстЗапроса = СтрШаблон("v1/integrations/users/%1", Логин);
	
	Запрос = НовыйHTTPЗапрос(ТекстЗапроса);
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда
		Результат = ПрочитатьОтветДанныеКандидата(РезультатЗапроса);
	КонецЕсли;
	
	// АПК:1297-выкл Строка не видна пользователю
	Если СтрНайти(Результат.resume_headline, "Доступ ограничен") <> 0 Тогда
	// АПК:1297-вкл
		ВызватьИсключение СтрШаблон(НСтр("ru = '%1'"), Результат.resume_headline);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  РезюмеССайта - Структура: См. РезюмеССайта
// 
// Возвращаемое значение:
//  Структура: см. ПодборПерсоналаКлиентСервер.ОписаниеРезюмеКандидата
Функция ДанныеКандидатаПоРезюме(РезюмеССайта)
	
	ДанныеКандидата = Справочники.Кандидаты.СтруктураДанныхКандидата();
	
	ДанныеКандидата.ИсточникИнформации = Сайт;
	ДанныеКандидата.ДанныеПубликации = РезюмеССайта;
	
	// Адрес резюме
	ДанныеКандидата.АдресРезюме = СтрШаблон("%1%2", ДанныеСайта().ГлавнаяСтраница, РезюмеССайта.login);
	
	// ФИО
	ФИО = РезюмеССайта.full_name;
	Если ЗначениеЗаполнено(ФИО) Тогда
		ЗаполнитьЗначенияСвойств(ДанныеКандидата, ФизическиеЛицаКлиентСервер.ЧастиИмени(ФИО));
	КонецЕсли;
	
	// Ожидаемый доход
	ДанныеКандидата.ОжидаемыйДоход = РезюмеССайта.salary.from;
	ДанныеКандидата.ВалютаДохода = ПодборПерсонала.ВалютаПоСправочнику(РезюмеССайта.salary.currency);
	
	// О себе
	ДанныеКандидата.ОСебе = РекрутинговыеСайтыКлиентСервер.ИзвлечьТекстИзHTML(РезюмеССайта.about);
	
	// Дата рождения
	ДанныеКандидата.ДатаРождения = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(РезюмеССайта.birthday, Ложь);
	
	// Контактная информация
	ЗаполнитьКонтактнуюИнформациюКандидата(РезюмеССайта, ДанныеКандидата.КонтактнаяИнформация);
	
	// Образование
	ЗаполнитьОбразованиеКандидата(РезюмеССайта, ДанныеКандидата.Образование);
	
	// Трудовая деятельность
	МестаРаботы = РезюмеССайта.experiences;
	Если ЗначениеЗаполнено(МестаРаботы) Тогда
		Для Каждого МестоРаботы Из МестаРаботы Цикл
			ОпытРаботы = РекрутинговыеСайтыСлужебный.НовыйОпытРаботы();
			
			ОпытРаботы.Компания = МестоРаботы.company_name;
			ОпытРаботы.Должность = МестоРаботы.position;
			ОпытРаботы.Обязанности = МестоРаботы.description;
			
			ДатаНачала = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(МестоРаботы.start_date, Ложь);
			Если ЗначениеЗаполнено(ДатаНачала) Тогда
				ОпытРаботы.ДатаНачала = ДатаНачала;
			КонецЕсли;
			
			ДатаОкончания = РекрутинговыеСайтыСлужебный.ДатаПоСтроке(МестоРаботы.end_date, Ложь);
			Если ЗначениеЗаполнено(ДатаОкончания) Тогда
				ОпытРаботы.ДатаОкончания = ДатаОкончания;
			КонецЕсли;
			
			ДанныеКандидата.ТрудоваяДеятельность.Добавить(ОпытРаботы);
		КонецЦикла;
	КонецЕсли;
	
	// Гражданство
	СтранаГражданства = РезюмеССайта.location.country;
	Если ЗначениеЗаполнено(СтранаГражданства) Тогда
		ДанныеКандидата.Гражданство.Добавить(Новый Структура("Страна, Дата", СтранаГражданства, Дата(1, 1, 1)));
	КонецЕсли;
	
	// Фото
	ДанныеКандидата.Фото = ФотоКандидата(РезюмеССайта.avatar);
	
	// Название резюме
	ДанныеКандидата.НазваниеРезюме = РезюмеССайта.resume_headline;
	
	Возврат ДанныеКандидата;
	
КонецФункции

Функция ФотоКандидата(АдресКартинки)
	
	Возврат РекрутинговыеСайтыСлужебный.КартинкаПоАдресу(АдресКартинки);
	
КонецФункции

// Параметры:
//  РезюмеССайта - Структура: См. РезюмеССайта
//  КонтактнаяИнформацияКандидата - Массив Из См. РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации
Процедура ЗаполнитьКонтактнуюИнформациюКандидата(РезюмеССайта, КонтактнаяИнформацияКандидата)
	
	РегионРаботы = РезюмеССайта.location.city;
	Если ЗначениеЗаполнено(РегионРаботы) Тогда
		КонтактнаяИнформация = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
		КонтактнаяИнформация.Вид =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.АдресЛичныеДанныеКандидатов");
		КонтактнаяИнформация.Представление = СтрШаблон("%1, %2", РезюмеССайта.location.country, РегионРаботы);
		КонтактнаяИнформацияКандидата.Добавить(КонтактнаяИнформация);
	КонецЕсли;
	
	АдресаЭП = РезюмеССайта.contacts.emails;
	Для Каждого АдресЭП Из АдресаЭП Цикл
		КонтактнаяИнформация = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		КонтактнаяИнформация.Вид =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
		КонтактнаяИнформация.Представление = АдресЭП.value;
		КонтактнаяИнформацияКандидата.Добавить(КонтактнаяИнформация);
	КонецЦикла;
	
	Телефоны = РезюмеССайта.contacts.phones;
	Для Каждого Телефон Из Телефоны Цикл
		КонтактнаяИнформация = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
		КонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		КонтактнаяИнформация.Вид =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.ТелефонЛичныеДанныеКандидатов");
		КонтактнаяИнформация.Представление = Телефон.value;
		КонтактнаяИнформацияКандидата.Добавить(КонтактнаяИнформация);
	КонецЦикла;
	
	Мессенджеры = РезюмеССайта.contacts.messengers;
	Если Мессенджеры <> Неопределено Тогда
		Для Каждого Мессенджер Из Мессенджеры Цикл
			КонтактнаяИнформация = ДополнительнаяКонтактнаяИнформацияКандидата(Мессенджер);
			Если КонтактнаяИнформация <> Неопределено Тогда
				КонтактнаяИнформацияКандидата.Добавить(КонтактнаяИнформация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СайтыКандидата = РезюмеССайта.contacts.sites;
	Если СайтыКандидата <> Неопределено Тогда
		Для Каждого СайтКандидата Из СайтыКандидата Цикл
			КонтактнаяИнформация = ДополнительнаяКонтактнаяИнформацияКандидата(СайтКандидата);
			Если КонтактнаяИнформация <> Неопределено Тогда
				КонтактнаяИнформацияКандидата.Добавить(КонтактнаяИнформация);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнительнаяКонтактнаяИнформацияКандидата(ИнформацияОКонтакте)
	Значение = ИнформацияОКонтакте.value; // Строка
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = РекрутинговыеСайтыСлужебный.СтруктураКонтактнойИнформации();
	МенеджерКонтактов = Перечисления.КонтактыРекрутинговыхСайтов;
	Контакт = НРег(ИнформацияОКонтакте.type); // Строка
	
	Результат.Тип = Перечисления.ТипыКонтактнойИнформации.Другое;
	
	Если Контакт = "whatsapp" Тогда
		Результат.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Whatsapp);
		Результат.Представление = Значение;
	ИначеЕсли Контакт = "max" Тогда
		Результат.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Max);
		Результат.Представление = Значение;
	ИначеЕсли Контакт = "telegram" Тогда
		Результат.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Telegram);
		Результат.Представление = Значение;
	ИначеЕсли СтрНайти(Контакт, "other") <> 0 Тогда
		Результат.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Прочее);
		Результат.Представление = Значение;
	Иначе
		Результат.Вид = МенеджерКонтактов.ВидКонтактнойИнформации(МенеджерКонтактов.Прочее);
		Результат.Представление = СтрШаблон("%1: %2", Контакт, Значение);
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(Результат.Вид), Результат, Неопределено);
КонецФункции

// Параметры:
//  РезюмеССайта - Структура: См. РезюмеССайта
//  ОбразованиеКандидата - Массив Из См. Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица
Процедура ЗаполнитьОбразованиеКандидата(РезюмеССайта, ОбразованиеКандидата)
	
	СреднееОбразование = РезюмеССайта.college_educations;
	Для Каждого Образование Из СреднееОбразование Цикл
		НовоеОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		НовоеОбразование.УчебноеЗаведение = Образование.college_name;
		НовоеОбразование.Окончание = Год(РекрутинговыеСайтыСлужебный.ДатаПоСтроке(Образование.end_date, Ложь));
		НовоеОбразование.ВидОбразования =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.СреднееПрофессиональноеОбразование");
		
		ОбразованиеКандидата.Добавить(НовоеОбразование);
	КонецЦикла;
	
	ВысшееОбразование = РезюмеССайта.university_educations;
	Для Каждого Образование Из ВысшееОбразование Цикл
		НовоеОбразование = Справочники.ЛичныеДанныеКандидатов.НовоеОбразованиеДляФизическогоЛица();
		НовоеОбразование.УчебноеЗаведение = Образование.university_name;
		НовоеОбразование.Окончание = Год(РекрутинговыеСайтыСлужебный.ДатаПоСтроке(Образование.end_date, Ложь));
		НовоеОбразование.ВидОбразования =
			ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОбразованияФизическихЛиц.ВысшееОбразование");
		
		ОбразованиеКандидата.Добавить(НовоеОбразование);
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//  Массив из Структура:
// * id - Число
// * title - Строка
// * published_at - Строка
// * url - Строка
// * published - Булево
// * expanded_salary -Структура:
// ** to- Число
Функция НоваяКоллекцияВакансий()
	
	Возврат Новый Массив();
	
КонецФункции

// Возвращаемое значение:
//  Массив из Структура:
// * id - Число
// * vacancy_id - Число
// * created_at - Строка
// * body - Строка
// * user - Структура:
// ** name - Строка
// ** login - Строка
// ** birthday - Строка
// ** location - Структура:
// *** city - Строка
// *** country - Строка
Функция НоваяКоллекцияОткликов()
	
	Возврат Новый Массив();
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * login - Строка -
//  * email - Строка -
Функция ПрочитатьОтветИнформацияОПользователе(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * access_token - Строка
Функция ПрочитатьОтветМаркерыДоступа(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * pagination - Структура:
// ** total - Число
// ** page - Число
// ** per - Число
Функция ПрочитатьПостраничныйОтвет(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * companies - Массив из Структура:
// ** name - Строка
// ** alias_name - Строка
Функция ПрочитатьОтветКомпанииПользователя(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * cities - Массив из Структура:
// ** id - Число
// ** name - Строка
// ** country_name - Строка
// ** region_name - Строка
// ** alias_name - Строка
Функция ПрочитатьОтветРегионы(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * groups - Массив из Структура:
// ** id - Число
// ** title - Структура:
// *** ru - Строка
// *** en - Строка
// ** specializations - Массив Из Структура:
// *** id - Число
// *** title - Структура:
// **** ru - Строка
// **** en - Строка
Функция ПрочитатьОтветСпециализации(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * skills - Массив из Структура:
// ** title - Строка
// ** alias_name - Строка
Функция ПрочитатьОтветНавыки(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
//  * vacancy - Структура:
//  ** id - Число
Функция ПрочитатьОтветПубликацияВакансии(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - Структура: См. РекрутинговыеСайтыСлужебный.ВыполнитьHTTPЗапрос
// 
// Возвращаемое значение:
//  Структура:
// * login - Строка
// * full_name - Строка
// * resume_headline - Строка
// * salary - Структура:
// ** from - Число
// ** currency - Строка
// * about - Строка
// * birthday - Строка
// * contacts - Структура:
// ** emails - Массив Из Структура:
// *** type - Строка
// *** value - Строка
// ** phones - Массив Из Структура:
// *** type - Строка
// *** value - Строка
// ** messengers - Массив Из Структура:
// *** type - Строка
// *** value - Строка
// ** sites - Массив Из Структура:
// *** type - Строка
// *** value - Строка
// * experiences - Массив Из Структура:
// ** company_name - Строка
// ** position - Строка
// ** description - Строка
// ** start_date - Строка
// ** end_date - Строка
// * college_educations - Массив Из Структура:
// ** college_name - Строка
// ** end_date - Строка
// * university_educations - Массив Из Структура:
// ** university_name - Строка
// ** end_date - Строка
// * location - Структура:
// ** country - Строка
// ** city - Строка
// * avatar - Строка
Функция ПрочитатьОтветДанныеКандидата(РезультатЗапроса)
	
	РекрутинговыеСайтыСлужебный.ПрочитатьHTTPОтвет(РезультатЗапроса);
	
	Возврат РезультатЗапроса.ОтветОбъект;
	
КонецФункции

Функция СтруктураПоля()
	
	Возврат РекрутинговыеСайтыСлужебный.СтруктураПоля();
	
КонецФункции

// Параметры:
// alias - Неопределено, Строка, Число -
//  name - Неопределено, Строка -
// 
// Возвращаемое значение:
//  Структура:
// * alias - Неопределено, Строка, Число -
// * name - Неопределено, Строка -
Функция СтруктураДанных(alias = Неопределено, name = Неопределено)
	
	Возврат Новый Структура("alias, name", alias, name);
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений
//  Обновление - Булево
// 
// Возвращаемое значение:
//  Строка
Функция JSONОписаниеВакансии(Дерево, Обновление = Ложь)
	
	СтрокаJSON = "";
	
	СтруктураОписанияВакансии = СтруктураОписанияВакансии(Дерево, Обновление);
	СтрокаJSON = РекрутинговыеСайтыСлужебный.ЗаписьJSON(СтруктураОписанияВакансии);
	
	Возврат СтрокаJSON;
	
КонецФункции

// Параметры:
//  Дерево - ДеревоЗначений:
//  * Показатель - СправочникСсылка.Вакансии, Строка -
//  * ТипРеквизита - Строка -
//  * ПубликацияВакансии - СписокЗначений Из Строка, Булево, Строка, Число -
//  * Путь - Строка -
//  * ПубликацияВакансииТекст - Строка -
//  * СтрокаИзменена - Булево -
//  Обновление - Булево
// 
// Возвращаемое значение:
//  Структура
Функция СтруктураОписанияВакансии(Дерево, Обновление = Ложь)
	
	ПоляВакансии = Новый Структура;
	ПоляВакансии.Вставить("vacancy", Новый Структура());
	Вакансия = ПоляВакансии.vacancy;
	
	Вакансия.Вставить("members", ИмяПользователя);
	
	ПоляСТекстомВHTML = ПоляВакансииСТекстомВHTML();
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если ТипЗнч(СтрокаДерева.Показатель) <> Тип("СправочникСсылка.Вакансии") Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
			Если СтрокаДереваПодчиненная.ТипРеквизита = "Строка" Тогда
				Если ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) Тогда
					Если ПоляСТекстомВHTML.Найти(СтрокаДереваПодчиненная.Путь) <> Неопределено Тогда
						Вакансия.Вставить(
							СтрокаДереваПодчиненная.Путь, СтрокаДереваПодчиненная.ПубликацияВакансииТекст);
					Иначе
						Вакансия.Вставить(
							СтрокаДереваПодчиненная.Путь, СтрокаДереваПодчиненная.ПубликацияВакансии);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = "Число" Тогда
				Если ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии) Тогда
					Вакансия.Вставить(СтрокаДереваПодчиненная.Путь, СтрокаДереваПодчиненная.ПубликацияВакансии);
				КонецЕсли;
			ИначеЕсли СтрокаДереваПодчиненная.ТипРеквизита = РекрутинговыеСайтыСлужебный.ТипРеквизитаНачалоМассива() Тогда
				Если Не ЗначениеЗаполнено(СтрокаДереваПодчиненная.ПубликацияВакансии)
					Или (Обновление И Не СтрокаДереваПодчиненная.СтрокаИзменена) Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаДереваПодчиненная.ПубликацияВакансии.Количество() = 1 Тогда
					ЗначениеПоля = СтрокаДереваПодчиненная.ПубликацияВакансии[0].Значение;
				Иначе
					Значения = Новый Массив();
					Для Каждого ЭлементСписка Из СтрокаДереваПодчиненная.ПубликацияВакансии Цикл
						Значения.Добавить(ЭлементСписка.Значение);
					КонецЦикла;
					
					ЗначениеПоля = СтрСоединить(Значения, ",");
				КонецЕсли;
				
				Если СтрокаДереваПодчиненная.Путь = "placement_type" Тогда
					ПоляВакансии.Вставить(СтрокаДереваПодчиненная.Путь, ЗначениеПоля)
				ИначеЕсли СтрокаДереваПодчиненная.Путь = "skip_placement" И ЗначениеПоля = 0 Тогда
					Продолжить;
				Иначе
					Вакансия.Вставить(СтрокаДереваПодчиненная.Путь, ЗначениеПоля);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПоляВакансии;
	
КонецФункции

// Возвращаемое значение:
//  Массив Из Структура: См. СтруктураДанных
Функция ЗагрузитьКомпанииПользователя()
	
	Компании = Новый Массив();
	
	Если Не УстановитьСоединение() Тогда
		Возврат Компании;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("v1/integrations/companies/my");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить компании пользователя.'");
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		КомпанииПользователя = ПрочитатьОтветКомпанииПользователя(РезультатЗапроса).companies;
		Для Каждого КомпанияПользователя Из КомпанииПользователя Цикл
			Компании.Добавить(СтруктураДанных(КомпанияПользователя.alias_name, КомпанияПользователя.name));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Компании;
	
КонецФункции

// Возвращаемое значение:
//  Структура: См. КлассификаторРегионовПоТаблице
Функция ЗагрузитьРегионы()
	
	Регионы = Новый Структура();
	
	Если Не УстановитьСоединение() Тогда
		Возврат Регионы;
	КонецЕсли;
	
	ТаблицаРегионов = НоваяТаблицаРегионов();
	
	Страница = 0;
	НаСтранице = 999;
	ВОтвете = НаСтранице;
	
	Пока НаСтранице = ВОтвете Цикл
		Запрос = НовыйHTTPЗапрос(СтрШаблон("v1/integrations/cities?term=Россия&page=%1&per_page=%2", Страница, НаСтранице));
		
		РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
		
		Если РезультатЗапроса.КодСостояния <> 200 Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось загрузить классификатор городов.'");
			РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
			Прервать;
		Иначе
			РегионыСайта = ПрочитатьОтветРегионы(РезультатЗапроса).cities;
			Для Каждого Регион Из РегионыСайта Цикл
				НоваяСтрока = ТаблицаРегионов.Добавить();
				НоваяСтрока.Страна = Регион.country_name;
				НоваяСтрока.Регион = Регион.region_name;
				НоваяСтрока.Город = Регион.name;
				НоваяСтрока.Идентификатор = Регион.id;
			КонецЦикла;
		КонецЕсли;
		
		ВОтвете = РегионыСайта.Количество();
		Страница = Страница + 1;
	КонецЦикла;
	
	Регионы = КлассификаторРегионовПоТаблице(ТаблицаРегионов);
	
	Возврат Регионы;
	
КонецФункции

Функция НоваяТаблицаРегионов()
	
	ТаблицаРегионов = Новый ТаблицаЗначений();
	ТаблицаРегионов.Колонки.Добавить("Страна", Новый ОписаниеТипов("Строка"));
	ТаблицаРегионов.Колонки.Добавить("Регион", Новый ОписаниеТипов("Строка"));
	ТаблицаРегионов.Колонки.Добавить("Город", Новый ОписаниеТипов("Строка"));
	ТаблицаРегионов.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаРегионов;
	
КонецФункции

// Параметры:
//  ТаблицаРегионов - ТаблицаЗначений: См. НоваяТаблицаРегионов
// 
// Возвращаемое значение:
//  Структура:
// * Страны - Массив Из Структура:
// ** Наименование - Строка -
// ** Регионы - Массив Из Структура:
// *** Наименование - Строка -
// *** Города - Массив Из Структура:
// **** Наименование - Строка -
// **** Идентификатор - Число -
Функция КлассификаторРегионовПоТаблице(ТаблицаРегионов)
	
	КлассификаторРегионов = Новый Структура();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ТаблицаРегионов.Страна КАК СТРОКА(200)) КАК Страна,
	|	ВЫРАЗИТЬ(ТаблицаРегионов.Регион КАК СТРОКА(200)) КАК Регион,
	|	ВЫРАЗИТЬ(ТаблицаРегионов.Город КАК СТРОКА(200)) КАК Город,
	|	ТаблицаРегионов.Идентификатор
	|ПОМЕСТИТЬ Таблица
	|ИЗ
	|	&ТаблицаРегионов КАК ТаблицаРегионов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Страна КАК Страна,
	|	Таблица.Регион КАК Регион,
	|	Таблица.Город КАК Город,
	|	Таблица.Идентификатор
	|ИЗ
	|	Таблица КАК Таблица
	|
	|УПОРЯДОЧИТЬ ПО
	|
	|	Страна,
	|	Регион,
	|	Город
	|ИТОГИ
	|ПО
	|	Страна,
	|	Регион";
	
	Запрос.УстановитьПараметр("ТаблицаРегионов", ТаблицаРегионов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтрана = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Страны = Новый Массив();
	
	Пока ВыборкаСтрана.Следующий() Цикл
		Страна = Новый Структура();
		Страна.Вставить("Наименование", СокрЛП(ВыборкаСтрана.Страна));
		
		Регионы = Новый Массив();
		
		ВыборкаРегион = ВыборкаСтрана.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРегион.Следующий() Цикл
			Регион = Новый Структура();
			Регион.Вставить("Наименование", СокрЛП(ВыборкаРегион.Регион));
			
			Города = Новый Массив();
			
			ВыборкаГород = ВыборкаРегион.Выбрать();
			
			Пока ВыборкаГород.Следующий() Цикл
				Город = Новый Структура();
				Город.Вставить("Наименование", СокрЛП(ВыборкаГород.Город));
				Город.Вставить("Идентификатор", ВыборкаГород.Идентификатор);
				
				Города.Добавить(Город);
			КонецЦикла;
			
			Регион.Вставить("Города", Города);
			Регионы.Добавить(Регион);
		КонецЦикла;
		
		Страна.Вставить("Регионы", Регионы);
		Страны.Добавить(Страна);
	КонецЦикла;
	
	КлассификаторРегионов.Вставить("Страны", Страны);
	
	Возврат КлассификаторРегионов;
	
КонецФункции

// Возвращаемое значение:
//  Массив Из Структура:
// * Наименование - Строка -
// * Специализации - Массив Из Структура: См. СтруктураДанных
Функция ЗагрузитьСпециализации()
	
	ИерархияСпециализаций = Новый Массив();
	
	Если Не УстановитьСоединение() Тогда
		Возврат ИерархияСпециализаций;
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос("v1/integrations/specializations");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить классификатор специализаций.'");
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		ГруппыСпециализацийССайта = ПрочитатьОтветСпециализации(РезультатЗапроса).groups;
		Для Каждого ГруппаССайта Из ГруппыСпециализацийССайта Цикл
			Группа = Новый Структура();
			Группа.Вставить("Наименование", ГруппаССайта.title.ru);
			
			Специализации = Новый Массив();
			
			Для Каждого СпециализацияССайта Из ГруппаССайта.specializations Цикл
				Специализации.Добавить(СтруктураДанных(Строка(СпециализацияССайта.id), СпециализацияССайта.title.ru));
			КонецЦикла;
			
			Группа.Вставить("Специализации", Специализации);
			
			ИерархияСпециализаций.Добавить(Группа);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИерархияСпециализаций;
	
КонецФункции

// Возвращаемое значение:
//  Массив Из Структура: См. СтруктураДанных
Функция ЗагрузитьНавыки()
	
	Навыки = Новый Массив();
	
	Запрос = НовыйHTTPЗапрос("v1/integrations/skills/all?per_page=2000");
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Получить, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		ТекстСообщения = НСтр("ru = 'Не удалось загрузить классификатор навыков.'");
		РекрутинговыеСайтыСлужебный.СообщитьОбОшибке(ТекстСообщения, Сайт, ЭтотОбъект, РезультатЗапроса);
	Иначе
		НавыкиССайта = ПрочитатьОтветНавыки(РезультатЗапроса).skills;
		
		Для Каждого НавыкССайта Из НавыкиССайта Цикл
			Навыки.Добавить(СтруктураДанных(НавыкССайта.alias_name, НавыкССайта.title));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Навыки;
	
КонецФункции

// Возвращаемое значение:
//  Массив из Структура: См. СтруктураДанных
Функция КлассификаторВалют()
	
	КлассификаторВалют = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюты.Код,
	|	Валюты.Представление
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код В (&Коды)
	|	И НЕ Валюты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Коды", СтрРазделить("643,840,978,980,398", ","));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураДанных = СтруктураДанных();
		
		Если Выборка.Код = "643" Тогда
			СтруктураДанных.alias = "rur";
		ИначеЕсли Выборка.Код = "840" Тогда
			СтруктураДанных.alias = "usd";
		ИначеЕсли Выборка.Код = "978" Тогда
			СтруктураДанных.alias = "eur";
		ИначеЕсли Выборка.Код = "980" Тогда
			СтруктураДанных.alias = "uah";
		ИначеЕсли Выборка.Код = "398" Тогда
			СтруктураДанных.alias = "kzt";
		КонецЕсли;
		СтруктураДанных.name = Выборка.Представление;
		
		Если ЗначениеЗаполнено(СтруктураДанных.alias) Тогда
			КлассификаторВалют.Добавить(СтруктураДанных);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КлассификаторВалют;
	
КонецФункции

Функция ЗаполнитьДеревоРегионов(Дерево)
	
	Результат = Ложь;
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлассификаторРегионов = Классификаторы.cities; // См. ЗагрузитьРегионы
	
	Страны = КлассификаторРегионов.Страны;
	
	СтрокаРоссия = Дерево.Строки.Добавить();
	СтрокаРоссия.Значение = НСтр("ru = 'Россия'");
	СтрокаДругиеСтраны = Дерево.Строки.Добавить();
	СтрокаДругиеСтраны.Значение = НСтр("ru = 'Другие страны'");
	
	Для Каждого Страна Из Страны Цикл
		Если Страна.Наименование = "Россия" Тогда
			СтрокаСтрана = СтрокаРоссия;
		Иначе
			СтрокаСтрана = СтрокаДругиеСтраны.Строки.Добавить();
			СтрокаСтрана.Значение = Страна.Наименование;
		КонецЕсли;
		
		Для Каждого Регион Из Страна.Регионы Цикл
			СтрокаРегион = СтрокаСтрана.Строки.Добавить();
			СтрокаРегион.Значение = Регион.Наименование;
			
			Для Каждого Город Из Регион.Города Цикл
				СтрокаГород= СтрокаРегион.Строки.Добавить();
				СтрокаГород.Значение = Город.Наименование;
				СтрокаГород.Идентификатор = Город.Идентификатор;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДеревоНавыков(Дерево)
	
	Результат = Ложь;
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлассификаторНавыков = Классификаторы.skills;
	
	Для Каждого Навык Из КлассификаторНавыков Цикл
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.Значение = Навык.name;
		НоваяСтрока.Идентификатор = Навык.alias;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьДеревоСпециализаций(Дерево)
	
	Результат = Ложь;
	
	Классификаторы = КлассификаторыСайта();
	
	Если Классификаторы = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	КлассификаторСпециализаций = Классификаторы.specializations;
	
	Для Каждого ИерархияСпециализаций Из КлассификаторСпециализаций Цикл
		Родитель = Дерево.Строки.Добавить();
		Родитель.Значение = ИерархияСпециализаций.Наименование;
		
		Для Каждого Специализация Из ИерархияСпециализаций.Специализации Цикл
			НоваяСтрока = Родитель.Строки.Добавить();
			НоваяСтрока.Значение = Специализация.name;
			НоваяСтрока.Идентификатор = Специализация.alias;
		КонецЦикла;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("Значение", Истина);
	
	Результат = Истина;
	
	Возврат Результат;
	
КонецФункции

#Область ПоляВакансии

Функция ПоляВакансииСМножественнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("skills");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСОдиночнымВыборомИзДерева()
	
	Поля = Новый Массив;
	Поля.Добавить("city_id");
	Поля.Добавить("specialization_ids");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСОдиночнымВыборомИзСписка()
	
	Поля = Новый Массив;
	Поля.Добавить("company");
	Поля.Добавить("currency");
	Поля.Добавить("remote");
	Поля.Добавить("employment_type");
	Поля.Добавить("placement_type");
	Поля.Добавить("skip_placement");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

Функция ПоляВакансииСТекстомВHTML()
	
	Поля = Новый Массив;
	Поля.Добавить("description");
	Поля.Добавить("bonuses");
	Поля.Добавить("instructions");
	
	Возврат Новый ФиксированныйМассив(Поля);
	
КонецФункции

#КонецОбласти

// Возвращаемое значение:
//  Структура: См. ЗагрузитьКлассификаторы
Функция КлассификаторыСайта()
	
	Возврат ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("Классификаторы" + ДанныеСайта().Имя);
	
КонецФункции

// См. РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла
Функция ЗначениеСвойстваУзла(Узел, ИмяСвойства, ИмяСвойстваВторогоУровня = Неопределено, ИмяСвойстваТретьегоУровня = Неопределено, ЗначениеПоУмолчанию = "")
	
	Возврат РекрутинговыеСайтыСлужебный.ЗначениеСвойстваУзла(
				Узел, ИмяСвойства, ИмяСвойстваВторогоУровня, ИмяСвойстваТретьегоУровня, ЗначениеПоУмолчанию);
	
КонецФункции

// Параметры:
//  ИдентификаторВакансии - Строка
// 
// Возвращаемое значение:
//  См. РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией
Функция ИзменитьСтатусПубликацииВакансии(ИдентификаторВакансии)
	
	Результат = РекрутинговыеСайтыСлужебный.НовыйРезультатДействияСВакансией(ИдентификаторВакансии);
	
	Если Не УстановитьСоединение() Тогда
		Возврат РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект);
	КонецЕсли;
	
	Запрос = НовыйHTTPЗапрос(СтрШаблон("v1/integrations/vacancies/%1/toggle_published_state", ИдентификаторВакансии));
	
	РезультатЗапроса = ВыполнитьHTTPЗапрос(МетодыЗапросов().Записать, Запрос);
	
	Если РезультатЗапроса.КодСостояния <> 200 Тогда
		Результат = РекрутинговыеСайтыСлужебный.РезультатСОшибкойСнятияВакансии(Сайт, ЭтотОбъект, РезультатЗапроса);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
