#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнениеВремениДвиженийРегистраИРеквизитовДокументов");
	Методы.Вставить("НачальноеЗаполнениеВидовРезерва");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает доступность подсистемы кадрового резерва для пользователя по правам и интерфейсу.
// 
// Возвращаемое значение:
//  Булево
Функция КадровыйРезервДоступенПользователю() Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезерв") Тогда
		Возврат Ложь;
	Иначе
		Возврат ПравоДоступа("Чтение", Метаданные.Справочники.КадровыйРезерв);
	КонецЕсли;

КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Период - Дата - 
//	 * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
// 	 * ПозицияРезерва - СправочникСсылка.КадровыйРезерв
// 	 * Статус - ПеречислениеСсылка.СостоянияСогласования
// 	 * ВидРезерва - СправочникСсылка.ВидыКадровогоРезерва
// 	 * СтатусРезервиста - СправочникСсылка.СтатусыГотовностиРезервистов
// 	 * РольФизическогоЛица - ПеречислениеСсылка.РолиФизическихЛиц
// 	 * Наставник - СправочникСсылка.ФизическиеЛица
// 	 * Куратор - СправочникСсылка.ФизическиеЛица
Функция НоваяТаблицаКадровогоРезерваНаДату() Экспорт
	
	НоваяТаблица = Новый ТаблицаЗначений();
	НоваяТаблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	НоваяТаблица.Колонки.Добавить("УчастникКадровогоРезерва", Метаданные.ОпределяемыеТипы.УчастникКадровогоРезерва.Тип);
	НоваяТаблица.Колонки.Добавить("ПозицияРезерва", Новый ОписаниеТипов("СправочникСсылка.КадровыйРезерв"));
	НоваяТаблица.Колонки.Добавить("Статус", Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияСогласования"));
	НоваяТаблица.Колонки.Добавить("ВидРезерва", Новый ОписаниеТипов("СправочникСсылка.ВидыКадровогоРезерва"));
	НоваяТаблица.Колонки.Добавить("СтатусРезервиста", Новый ОписаниеТипов("СправочникСсылка.СтатусыГотовностиРезервистов"));
	НоваяТаблица.Колонки.Добавить("РольФизическогоЛица", Новый ОписаниеТипов("ПеречислениеСсылка.РолиФизическихЛиц"));
	НоваяТаблица.Колонки.Добавить("Наставник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	НоваяТаблица.Колонки.Добавить("Куратор", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	НоваяТаблица.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));

	Возврат НоваяТаблица;
	
КонецФункции

// Возвращаемое значение:
//  Структура - Новый отбор кадрового резерва на дату:
//   * УчастникиКадровогоРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
//   * Статусы - Массив из ПеречислениеСсылка.СостоянияСогласования
//   * ПозицияРезерва - СправочникСсылка.КадровыйРезерв
//   * ВидРезерва - СправочникСсылка.ВидыКадровогоРезерва
//   * ИсключаемыйРегистратор - ДокументСсылка,Неопределено
Функция НовыйОтборКадровогоРезерваНаДату() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("УчастникиКадровогоРезерва", Новый Массив);
	Отбор.Вставить("Статусы", Новый Массив);
	Отбор.Вставить("ПозицияРезерва", Справочники.КадровыйРезерв.ПустаяСсылка());
	Отбор.Вставить("ВидРезерва", Справочники.ВидыКадровогоРезерва.ПустаяСсылка());
	Отбор.Вставить("ИсключаемыйРегистратор", Неопределено);
	
	Возврат Отбор;
	
КонецФункции

// Возвращает состояние кадрового резерва на определенную дату.
// 
// Параметры:
//  Период - Дата - дата, на конец дня которой получаем состояние кадрового резерва.
//  Отбор - см. НовыйОтборКадровогоРезерваНаДату
// 
// Возвращаемое значение:
//   см. НоваяТаблицаКадровогоРезерваНаДату
Функция КадровыйРезервНаДату(Период, Отбор = Неопределено) Экспорт

	ДанныеРезерва = НоваяТаблицаКадровогоРезерваНаДату();
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат ДанныеРезерва;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВременнуюТаблицуРезервисты(МенеджерВременныхТаблиц, КонецДня(Период), Отбор);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТРезервисты.УчастникКадровогоРезерва
		|ИЗ
		|	ВТРезервисты КАК ВТРезервисты";
	СписокФизическихЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("УчастникКадровогоРезерва");
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.СписокФизическихЛиц = СписокФизическихЛиц;
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТСотрудникиОрганизации.Сотрудник) КАК КоличествоСотрудников,
		|	ВТСотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТПризнакСотрудников
		|ИЗ
		|	ВТСотрудникиОрганизации КАК ВТСотрудникиОрганизации
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиОрганизации.ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезервисты.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВЫБОР
		|		КОГДА ВТПризнакСотрудников.КоличествоСотрудников ЕСТЬ NULL
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РолиФизическихЛиц.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РолиФизическихЛиц.Сотрудник)
		|	КОНЕЦ КАК РольФизическогоЛица,
		|	ВТРезервисты.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТРезервисты.Статус КАК Статус,
		|	ВТРезервисты.ВидРезерва КАК ВидРезерва,
		|	ВТРезервисты.СтатусРезервиста КАК СтатусРезервиста,
		|	ВТРезервисты.Наставник КАК Наставник,
		|	ВТРезервисты.Период КАК Период,
		|	ВТРезервисты.Куратор КАК Куратор,
		|	ВЫБОР
		|		КОГДА ВТРезервисты.УчастникКадровогоРезерва ССЫЛКА Справочник.ФизическиеЛица
		|			ТОГДА ВТРезервисты.УчастникКадровогоРезерва
		|		ИНАЧЕ ФизическиеЛицаКандидатов.ФизическоеЛицо
		|	КОНЕЦ КАК ФизическоеЛицо
		|ИЗ
		|	ВТРезервисты КАК ВТРезервисты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПризнакСотрудников КАК ВТПризнакСотрудников
		|		ПО ВТРезервисты.УчастникКадровогоРезерва = ВТПризнакСотрудников.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФизическиеЛицаКандидатов КАК ФизическиеЛицаКандидатов
		|		ПО ВТРезервисты.УчастникКадровогоРезерва = ФизическиеЛицаКандидатов.ЛичныеДанныеКандидата";
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ДанныеРезерва);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		МодульПодборПерсонала.ПриЗаполненииКадровогоРезерваНаДату(ДанныеРезерва);
	КонецЕсли;
	
	Возврат ДанныеРезерва;

КонецФункции

// Параметры:
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//  Период - Дата
//  Статусы - Массив из ПеречислениеСсылка.СостоянияСогласования,Неопределено
// 
// Возвращаемое значение:
//   см. НоваяТаблицаКадровогоРезерваНаДату
Функция ПозицииРезерваПоУчастникуКадровогоРезерва(УчастникКадровогоРезерва, Период, Статусы = Неопределено) Экспорт
	
	Отбор = НовыйОтборКадровогоРезерваНаДату();
	Отбор.УчастникиКадровогоРезерва = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УчастникКадровогоРезерва);
	Если ЗначениеЗаполнено(Статусы) Тогда
		Отбор.Статусы = Статусы;
	КонецЕсли;
	
	ПозицииРезерва = КадровыйРезервНаДату(Период, Отбор);
	
	Возврат ПозицииРезерва;
	
КонецФункции

Функция СтатусыГотовностиРезервистов(Дата, ПозицияРезерва = Неопределено, УчастникКадровогоРезерва = Неопределено,
	ИсключаемыйРегистратор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыРезервистовСрезПоследних.ПозицияРезерва КАК ПозицияРезерва,
		|	СтатусыРезервистовСрезПоследних.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	СтатусыРезервистовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.СтатусыГотовностиРезервистов.СрезПоследних(
		|			&Дата,
		|			Регистратор <> &ИсключаемыйРегистратор
		|				И ПозицияРезерва В (&ПозицияРезерва)
		|				И УчастникКадровогоРезерва В (&УчастникКадровогоРезерва)) КАК СтатусыРезервистовСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПозицияРезерва", ПозицияРезерва);
	Запрос.УстановитьПараметр("УчастникКадровогоРезерва", УчастникКадровогоРезерва);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ИсключаемыйРегистратор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает состояние кадрового резерва на текущий момент
// 	(запрос происходит по "вторичному" регистру)
// 	
// Параметры:
//	Отбор - Структура:
//	 * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//	 * ПозицияРезерва - СправочникСсылка.КадровыйРезерв
//	 * Статус - ПеречислениеСсылка.СостоянияСогласования
//	 * ВидРезерва - СправочникСсылка.ВидыКадровогоРезерва.
//		
// Возвращаемое значение:
// 	ТаблицаЗначений:
//	 * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//	 * ПозицияРезерва - СправочникСсылка.КадровыйРезерв
//	 * Статус - ПеречислениеСсылка.СостоянияСогласования
//	 * ВидРезерва - СправочникСсылка.ВидыКадровогоРезерва.
Функция ТекущийРезерв(Отбор = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТКадровыйРезерв(Запрос.МенеджерВременныхТаблиц);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.Статус КАК Статус,
		|	КадровыйРезерв.ВидРезерва КАК ВидРезерва
		|ИЗ
		|	ВТКадровыйРезерв КАК КадровыйРезерв";
		
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		ТекстУсловия = " ГДЕ ";
		Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "Статус")) Тогда
			ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = " ГДЕ ", "", " И ") + "КадровыйРезерв.Статус В(&Статус)";
			Если ТипЗнч(Отбор.Статус) = Тип("Массив") Тогда
				Запрос.УстановитьПараметр("Статус", Отбор.Статус);
			Иначе
				Запрос.УстановитьПараметр("Статус", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор.Статус));
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "УчастникКадровогоРезерва")) Тогда
			ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = " ГДЕ ", "", " И ")
				+ "КадровыйРезерв.УчастникКадровогоРезерва В(&УчастникиКадровогоРезерва)";
			Если ТипЗнч(Отбор.ФизическоеЛицо) = Тип("Массив") Тогда
				Запрос.УстановитьПараметр("УчастникиКадровогоРезерва", Отбор.УчастникКадровогоРезерва);
			Иначе
				Запрос.УстановитьПараметр("УчастникиКадровогоРезерва", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					Отбор.УчастникКадровогоРезерва));
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ПозицияРезерва")) Тогда
			ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = " ГДЕ ", "", " И ")
				+ "КадровыйРезерв.ПозицияРезерва В(&ПозицияРезерва)";
			Если ТипЗнч(Отбор.ПозицияРезерва) = Тип("Массив") Тогда
				Запрос.УстановитьПараметр("ПозицияРезерва", Отбор.ПозицияРезерва);
			Иначе
				Запрос.УстановитьПараметр("ПозицияРезерва", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					Отбор.ПозицияРезерва));
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Отбор, "ВидРезерва")) Тогда
			ТекстУсловия = ТекстУсловия + ?(ТекстУсловия = " ГДЕ ", "", " И ") + "КадровыйРезерв.ВидРезерва В(&ВидРезерва)";
			Если ТипЗнч(Отбор.ВидРезерва) = Тип("Массив") Тогда
				Запрос.УстановитьПараметр("ВидРезерва", Отбор.ВидРезерва);
			Иначе
				Запрос.УстановитьПараметр("ВидРезерва", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор.ВидРезерва));
			КонецЕсли;
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + ТекстУсловия;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Определяет является ли позиция штатного расписания ключевой, то есть проассоциирована ли с ней однозначная позиция
// кадрового резерва.
// 
// Параметры:
//  ПозицияШтатногоРасписанияСсылка - СправочникСсылка.ШтатноеРасписание
// 
// Возвращаемое значение:
//  Булево
Функция ЭтоКлючеваяПозицияШтатногоРасписания(ПозицияШтатногоРасписанияСсылка) Экспорт
	
	СписокПозицийШР = ПодобратьПозицииРезерваПоПозицииШтатногоРасписания(ПозицияШтатногоРасписанияСсылка, Ложь);
	Возврат СписокПозицийШР.Количество() = 0;
	
КонецФункции

// Создает временную таблицу ВТКадровыйРезерв с описанием текущих статусов резервистов.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ТекущаяДата - Дата, Неопределено - 
Процедура СоздатьВТКадровыйРезерв(МенеджерВременныхТаблиц, ТекущаяДата = Неопределено) Экспорт
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВЫБОР
		|		КОГДА КадровыйРезерв.ДатаИсключения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА КадровыйРезерв.Статус
		|		ИНАЧЕ ВЫБОР
		|				КОГДА КадровыйРезерв.ДатаИсключения > &ТекущаяДата
		|					ТОГДА КадровыйРезерв.Статус
		|				ИНАЧЕ &СтатусИсключен
		|			КОНЕЦ
		|	КОНЕЦ КАК Статус,
		|	КадровыйРезерв.ВидРезерва КАК ВидРезерва,
		|	КадровыйРезерв.Рейтинг КАК Рейтинг,
		|	КадровыйРезерв.ДатаВключения КАК ДатаВключения,
		|	КадровыйРезерв.ДатаИсключения КАК ДатаИсключения,
		|	КадровыйРезерв.Статус КАК СтатусДоИсключения
		|ПОМЕСТИТЬ ВТКадровыйРезерв
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв";
	
	Запрос.УстановитьПараметр("СтатусИсключен", ПредопределенноеЗначение(
		"Перечисление.СостоянияСогласования.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#Область ДанныеДокументовДляПроведения

// Возвращает таблицу значений, соответствующую движениям документа по регистру сведений ИсторияКадровогоРезерва.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.КадровыйПеревод
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ДанныеКадровогоПереводаДляКадровогоРезерва(ДокументСсылка) Экспорт

	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КадровыйПеревод") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровыйПеревод.ДатаНачала КАК Период,
			|	КадровыйПеревод.ФизическоеЛицо КАК УчастникКадровогоРезерва,
			|	КадровыйПереводКадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
			|	КадровыйПереводКадровыйРезерв.ВидРезерва КАК ВидРезерва,
			|	ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка) КАК Статус,
			|	КадровыйПеревод.Ссылка КАК Основание
			|ИЗ
			|	Документ.КадровыйПеревод.КадровыйРезерв КАК КадровыйПереводКадровыйРезерв
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровыйПеревод КАК КадровыйПеревод
			|		ПО КадровыйПереводКадровыйРезерв.Ссылка = КадровыйПеревод.Ссылка
			|ГДЕ
			|	КадровыйПереводКадровыйРезерв.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Отклонить)
			|	И КадровыйПеревод.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	КадровыйПереводСпискомСотрудники.ДатаНачала КАК Период,
			|	КадровыйПереводСпискомСотрудники.ФизическоеЛицо КАК УчастникКадровогоРезерва,
			|	КадровыйПереводСпискомКадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
			|	КадровыйПереводСпискомКадровыйРезерв.ВидРезерва КАК ВидРезерва,
			|	ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка) КАК Статус,
			|	КадровыйПереводСпискомКадровыйРезерв.Ссылка КАК Основание
			|ИЗ
			|	Документ.КадровыйПереводСписком.КадровыйРезерв КАК КадровыйПереводСпискомКадровыйРезерв
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровыйПереводСписком.Сотрудники КАК КадровыйПереводСпискомСотрудники
			|		ПО КадровыйПереводСпискомКадровыйРезерв.Ссылка = КадровыйПереводСпискомСотрудники.Ссылка
			|			И КадровыйПереводСпискомКадровыйРезерв.ИдентификаторСтрокиСотрудника = КадровыйПереводСпискомСотрудники.ИдентификаторСтрокиСотрудника
			|ГДЕ
			|	КадровыйПереводСпискомКадровыйРезерв.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Отклонить)
			|	И КадровыйПереводСпискомСотрудники.Ссылка = &Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Параметры:
//  ДанныеДляПроведения - Структура
Процедура ДобавитьДанныеКадровогоРезерваДляРезультатовАттестацииСотрудников(ДанныеДляПроведения) Экспорт

	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДанныеДляПроведения.МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РешенияПоРезерву.Период,
	|	РешенияПоРезерву.Сотрудник.ФизическоеЛицо КАК УчастникКадровогоРезерва,
	|	РешенияПоРезерву.ПозицияРезерва,
	|	РешенияПоРезерву.ВидРезерва,
	|	&Включить КАК Статус,
	|	РешенияПоРезерву.Ссылка КАК Основание
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК РешенияПоРезерву
	|ГДЕ
	|	РешенияПоРезерву.РешениеКомиссии = &РекомендуетсяВКадровыйРезерв
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РешенияПоРезерву.Период,
	|	РешенияПоРезерву.Сотрудник.ФизическоеЛицо КАК УчастникКадровогоРезерва,
	|	РешенияПоРезерву.ПозицияРезерва,
	|	РешенияПоРезерву.ВидРезерва,
	|	РешенияПоРезерву.СтатусГотовности КАК Статус
	|ИЗ
	|	ВТРезультатыАттестацийСотрудников КАК РешенияПоРезерву
	|ГДЕ
	|	РешенияПоРезерву.РешениеКомиссии = &РекомендуетсяВКадровыйРезерв";
	
	Запрос.УстановитьПараметр("РекомендуетсяВКадровыйРезерв", ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.РешенияАттестационныхКомиссий.РекомендуетсяВКадровыйРезерв"));
	Запрос.УстановитьПараметр("Включить", ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	ДвиженияИсторииКадровогоРезерва = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2];
	ДвиженияСтатусыРезервистов = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1];
	
	ДвиженияДокумента = Новый Структура;
	ДвиженияДокумента.Вставить("ДвиженияИсторииКадровогоРезерва", ДвиженияИсторииКадровогоРезерва.Выгрузить());
	ДвиженияДокумента.Вставить("ДвиженияСтатусыРезервистов", ДвиженияСтатусыРезервистов.Выгрузить());
	ДанныеДляПроведения.Вставить("ДвиженияДокумента", ДвиженияДокумента);
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

КонецПроцедуры

// Возвращает таблицу значений, соответствующую движениям документа по регистру сведений ИсторияКадровогоРезерва.
// 
// Параметры:
//  ДокументСсылка - ДокументСсылка.Увольнение, ДокументСсылка.УвольнениеСписком -
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ДанныеУвольненияДляКадровогоРезерва(ДокументСсылка) Экспорт

	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Увольнение") Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Увольнение.ДатаУвольнения КАК Период,
			|	Увольнение.ФизическоеЛицо КАК УчастникКадровогоРезерва,
			|	УвольнениеКадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
			|	УвольнениеКадровыйРезерв.ВидРезерва КАК ВидРезерва,
			|	ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка) КАК Статус,
			|	УвольнениеКадровыйРезерв.Ссылка КАК Основание
			|ИЗ
			|	Документ.Увольнение.КадровыйРезерв КАК УвольнениеКадровыйРезерв
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Увольнение КАК Увольнение
			|		ПО УвольнениеКадровыйРезерв.Ссылка = Увольнение.Ссылка
			|ГДЕ
			|	УвольнениеКадровыйРезерв.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Отклонить)
			|	И Увольнение.Ссылка = &Ссылка";
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	УвольнениеСпискомСотрудники.ДатаУвольнения КАК Период,
			|	УвольнениеСпискомСотрудники.ФизическоеЛицо КАК УчастникКадровогоРезерва,
			|	УвольнениеСпискомКадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
			|	УвольнениеСпискомКадровыйРезерв.ВидРезерва КАК ВидРезерва,
			|	ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.ПустаяСсылка) КАК Статус,
			|	УвольнениеСпискомКадровыйРезерв.Ссылка КАК Основание
			|ИЗ
			|	Документ.УвольнениеСписком.КадровыйРезерв КАК УвольнениеСпискомКадровыйРезерв
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УвольнениеСписком.Сотрудники КАК УвольнениеСпискомСотрудники
			|		ПО УвольнениеСпискомКадровыйРезерв.Ссылка = УвольнениеСпискомСотрудники.Ссылка
			|			И УвольнениеСпискомКадровыйРезерв.ИдентификаторСтрокиСотрудника = УвольнениеСпискомСотрудники.ИдентификаторСтрокиСотрудника
			|ГДЕ
			|	УвольнениеСпискомКадровыйРезерв.Действие = ЗНАЧЕНИЕ(Перечисление.ДействияСКадровымиРезервистами.Отклонить)
			|	И УвольнениеСпискомСотрудники.Ссылка = &Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции

// Заполняет движения по регистру ИсторияКадровогоРезерва.
//
// Параметры:
//	Движения - КоллекцияДвижений - коллекция движений, которую необходимо заполнить
//	ДвиженияДокумента - Структура
//	ИмяСвойства - Строка
Процедура СформироватьДвиженияИсторииКадровогоРезерва(Движения, ДвиженияДокумента, ИмяСвойства) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДвиженияДокумента, ИмяСвойства) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КадровыйРезервДвижения = ДвиженияДокумента[ИмяСвойства];
	Если КадровыйРезервДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	Движения.ИсторияКадровогоРезерва.Записывать = Истина;
	Для Каждого СтрокаДанных Из КадровыйРезервДвижения Цикл
		НоваяСтрока = Движения.ИсторияКадровогоРезерва.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Период = НачалоДня(НоваяСтрока.Период) + ЗначениеВремениПоСтатусуРезерва(НоваяСтрока.Статус);
	КонецЦикла;
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет движения СтатусыРезервистов.
//
// Параметры:
//  Движения - КоллекцияДвижений - коллекция движений, в которой необходимо заполнить движения.
//	ДвиженияДокумента - Структура
//	ИмяСвойства - Строка
Процедура СформироватьДвиженияСтатусыГотовностиРезервистов(Движения, ДвиженияДокумента, ИмяСвойства) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("КадровыйРезерв.СформироватьДвиженияСтатусыГотовностиРезервистов",
		"ДвиженияДокумента", ДвиженияДокумента, Тип("Структура"), Новый Структура(ИмяСвойства, Тип("ТаблицаЗначений")));
	
	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	КадровыйРезервДвижения = ДвиженияДокумента[ИмяСвойства];
	Если КадровыйРезервДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.СтатусыГотовностиРезервистов.Записывать = Истина;
	Для Каждого СтрокаДанных Из КадровыйРезервДвижения Цикл
		НоваяСтрока = Движения.СтатусыГотовностиРезервистов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДанных);
		НоваяСтрока.Период = НачалоДня(НоваяСтрока.Период);
	КонецЦикла;
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРегистров

// Заполняет вторичный Регистр сведений КадровыйРезерв из источника - РегистрСведений.ИсторияКадровогоРезерва.
//
// Параметры:
//  Движения - РегистрСведенийНаборЗаписей - коллекция движений, в которой необходимо заполнить движения.
//  ТаблицаОтборов - ТаблицаЗначений
Процедура ЗаполнитьЗаписиКадровогоРезерва(Движения, ТаблицаОтборов) Экспорт
	
	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = РезультатЗапросаДляЗаполненияРегистраКадровыйРезерв(ТаблицаОтборов);
	
	Если РезультатЗапроса.Пустой() Тогда
		Для Каждого Строка Из ТаблицаОтборов Цикл
			НаборЗаписей = РегистрыСведений.КадровыйРезерв.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПозицияРезерва.Установить(Строка.ПозицияРезерва);
			НаборЗаписей.Отбор.УчастникКадровогоРезерва.Установить(Строка.УчастникКадровогоРезерва);
			НаборЗаписей.Записать();
		КонецЦикла;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.КадровыйРезерв.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПозицияРезерва.Установить(ВыборкаДетальныеЗаписи.ПозицияРезерва);
			НаборЗаписей.Отбор.УчастникКадровогоРезерва.Установить(ВыборкаДетальныеЗаписи.УчастникКадровогоРезерва);
			Если ВыборкаДетальныеЗаписи.Статус <> Null Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
			КонецЕсли;
			НаборЗаписей.Записать(Истина);
			НайденыеСтроки = ТаблицаОтборов.НайтиСтроки(
				Новый Структура("ПозицияРезерва, УчастникКадровогоРезерва", ВыборкаДетальныеЗаписи.ПозицияРезерва,
					ВыборкаДетальныеЗаписи.УчастникКадровогоРезерва));
			Для Каждого НайденнаяСтрока Из НайденыеСтроки Цикл
				ТаблицаОтборов.Удалить(НайденнаяСтрока);
			КонецЦикла;
		КонецЦикла;
		Для Каждого Строка Из ТаблицаОтборов Цикл
			НаборЗаписей = РегистрыСведений.КадровыйРезерв.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПозицияРезерва.Установить(Строка.ПозицияРезерва);
			НаборЗаписей.Отбор.УчастникКадровогоРезерва.Установить(Строка.УчастникКадровогоРезерва);
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Записывает в регистр сведений КадровыйРезерв рейтинг участника кадрового резерва
// 
// Параметры:
//  ПозицияРезерва - СправочникСсылка.КадровыйРезерв
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//  Рейтинг - Число
Процедура ПоставитьРейтинг(ПозицияРезерва, УчастникКадровогоРезерва, Рейтинг) Экспорт

	НадоВыключатьПривилегированныйРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.КадровыйРезерв.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ПозицияРезерва = ПозицияРезерва;
	МенеджерЗаписи.УчастникКадровогоРезерва = УчастникКадровогоРезерва;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Рейтинг = Рейтинг;
	МенеджерЗаписи.Записать(Истина);

	Если НадоВыключатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеПроцедурыИФункции

Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт

	// Раздел ОбучениеРазвитие
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаВключениеВКадровыйРезерв",				"ДатаВыдвижения",				"КадровыйРезерв", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВключениеВКадровыйРезерв",					 	"ДатаРассмотрения",				"КадровыйРезерв", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИсключениеИзКадровогоРезерва",					"ДатаИсключения",				"КадровыйРезерв", "Подразделение.Источник");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСтатусаГотовностиРезервистов",			"Дата",							"КадровыйРезерв", "Подразделение.Источник");
	
КонецПроцедуры

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "КадровыйРезерв.НачальноеЗаполнениеВидовРезерва";
	Обработчик.НачальноеЗаполнение = Истина;

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "КадровыйРезерв.ЗаполнениеВремениДвиженийРегистраИРеквизитовДокументов";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "Документы.ВключениеВКадровыйРезерв.ЗаполнитьУчастниковКадровогоРезерва";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ad4ba96e-e938-4ade-8e20-e9cabb4fce8f");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в документах ""Включение в кадровый резерв"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "Документы.ЗаявкаНаВключениеВКадровыйРезерв.ЗаполнитьУчастниковКадровогоРезерва";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("ecfcfff1-5a99-4172-881d-847e78b4653b");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в документах ""Заявка на включение в кадровый резерв"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "Документы.ИзменениеСтатусаГотовностиРезервистов.ЗаполнитьУчастниковКадровогоРезерва";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2bd4fe3f-7e8b-4cec-8616-aed6d8a8d3f7");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в документах ""Изменение статуса готовности резервистов"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "Документы.ИсключениеИзКадровогоРезерва.ЗаполнитьУчастниковКадровогоРезерва";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("93750058-a546-4c64-956f-b7ca92f808fc");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в документах ""Исключение из кадрового резерва"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "РегистрыСведений.ИсторияКадровогоРезерва.ВыполнитьПервоначальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("9ef69443-290c-46d9-af75-6b0695f8e654");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в регистре ""История кадрового резерва"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "РегистрыСведений.КадровыйРезерв.ВыполнитьПервоначальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("2bf38972-62f3-446c-a604-6fcc69140783");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в регистре ""Кадровый резерв"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.1";
	Обработчик.Процедура = "РегистрыСведений.СтатусыГотовностиРезервистов.ВыполнитьПервоначальноеЗаполнение";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("52d4ac4f-37ce-4e91-b7b2-89452fdd9dd8");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение участников кадрового резерва в регистре ""Статусы готовности резервистов"".'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.31.11";
	Обработчик.Процедура = "Документы.ВключениеВКадровыйРезерв.ЗаполнитьСтатусыГотовности";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("738d1edc-6650-4ae1-8825-ab6e94f5c4c3");
	Обработчик.Комментарий =
		НСтр("ru = 'Заполнение статусов готовности в документах ""Включение в кадровый резерв"".'");
		
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.38.33";
	Обработчик.Процедура = "РегистрыСведений.КадровыйРезерв.ИсправитьДатуОкончанияКадровогоРезерва";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("b0d3ea25-01cd-459a-9d14-713c661a9885");
	Обработчик.Комментарий =
		НСтр("ru = 'Исправление периода нахождения в кадровом резерве.'");
	
КонецПроцедуры

Процедура НачальноеЗаполнениеВидовРезерва() Экспорт 
	Справочники.ВидыКадровогоРезерва.НачальноеЗаполнение();
КонецПроцедуры

#КонецОбласти

// Проверяет заполнение реквизитов ПозицияРезерва и ВидРезерва в табличной части документа.
// 
// Параметры:
//  ДокументОбъект - ДокументОбъект
//  ИмяТабличнойЧасти - Строка
//  ПроверяемыеРеквизиты - Массив из Строка
//  Отказ - Булево
//  ПроверкаВнутриТЧ - Булево
Процедура ПроверитьЗаполнениеВидаРезерваВТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ПроверяемыеРеквизиты, Отказ,
	ПроверкаВнутриТЧ = Ложь) Экспорт

	Если Не КадровыйРезервДоступенПользователю() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, ИмяТабличнойЧасти + ".ПозицияРезерва");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, ИмяТабличнойЧасти + ".ВидРезерва");
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧастьДокумента = ДокументОбъект[ИмяТабличнойЧасти];
	
	Для каждого СтрокаТЧ Из ТабличнаяЧастьДокумента Цикл
		// Если проверка идет по условию других полей в строке - проверяем на это условие.
		Если ПроверкаВнутриТЧ Тогда
			Если СтрокаТЧ.РешениеКомиссии <> ОбщегоНазначения.ПредопределенныйЭлемент(
				"Справочник.РешенияАттестационныхКомиссий.РекомендуетсяВКадровыйРезерв") Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ПозицияРезерва) Тогда
				ТекстСообщения = НСтр("ru = 'Не заполнена позиция резерва'");
				Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИмяТабличнойЧасти + "[%1].ПозицияРезерва",
					ТабличнаяЧастьДокумента.Индекс(СтрокаТЧ));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект, Поле, , Отказ);
			КонецЕсли;
		КонецЕсли;
		
		// Если включен учет резерва по видам, то проверяем на заполнение и вид.
		Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам")
			И Не ЗначениеЗаполнено(СтрокаТЧ.ВидРезерва) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен вид резерва'");
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИмяТабличнойЧасти + "[%1].ВидРезерва",
				ТабличнаяЧастьДокумента.Индекс(СтрокаТЧ));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект, Поле , , Отказ);
		КонецЕсли;
	КонецЦикла; 
	
	Если ПроверкаВнутриТЧ Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, ИмяТабличнойЧасти + ".ПозицияРезерва");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, ИмяТабличнойЧасти + ".ВидРезерва");

КонецПроцедуры

// Возвращает список позиций кадрового резерва, соответствующих конкретной позиции штатного расписания.
// 
// Параметры:
//  ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
//  ВключатьГруппыДолжностей - Булево
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КадровыйРезерв
Функция ПодобратьПозицииРезерваПоПозицииШтатногоРасписания(ПозицияШтатногоРасписания,
	ВключатьГруппыДолжностей = Истина) Экспорт

	ПозицииРезерва = Новый Массив; // Массив из СправочникСсылка.КадровыйРезерв
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", ПозицияШтатногоРасписания);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КадровыйРезерв.Ссылка КАК ПозицияРезерва
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания)
		|	И КадровыйРезерв.ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания";
	
	Если ВключатьГруппыДолжностей Тогда
		Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияШтатногоРасписания, "Должность");
		Запрос.УстановитьПараметр("Должность", Должность);
		Запрос.Текст = Запрос.Текст +
		"
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КадровыйРезервДолжности.Ссылка
		|ИЗ
		|	Справочник.КадровыйРезерв.Должности КАК КадровыйРезервДолжности
		|ГДЕ
		|	КадровыйРезервДолжности.Ссылка.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва)
		|	И КадровыйРезервДолжности.Должность = &Должность";
		
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
			МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
			МодульКадровыйРезервГосслужащих.ДополнитьПозицииРезерваПоДолжности(ПозицииРезерва, Должность);
		КонецЕсли;
	КонецЕсли;
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПозицииРезерва,
		РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПозицияРезерва"), Истина);
	
	Возврат ПозицииРезерва;

КонецФункции

// Параметры:
//  ПозицияШтатногоРасписания - СправочникСсылка.ШтатноеРасписание
//  УстанавливатьПривилегированныйРежим - Булево
//  ДатаПолученияДанных - Дата - Дата на которую необходимо получить данные 
//  
// Возвращаемое значение:
//  Массив из СправочникСсылка.КадровыйРезерв
Функция ПозицииКадровогоРезерваСогласноПозицииШтатногоРасписания(ПозицияШтатногоРасписания,
	УстанавливатьПривилегированныйРежим = Ложь, ДатаПолученияДанных = '00010101') Экспорт
	
	ПозицииРезерва = Новый Массив; // Массив из СправочникСсылка.КадровыйРезерв
	
	МестоВСтруктуреПредприятия = ОрганизационнаяСтруктура.МестоПозицииВСтруктуреПредприятия(ПозицияШтатногоРасписания,
		ДатаПолученияДанных);
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПозицияШтатногоРасписания, "Должность");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезерв.Ссылка КАК ПозицияКадровогоРезерва
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.ВАрхиве = ЛОЖЬ
		|	И КадровыйРезерв.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА &ПозицияШтатногоРасписания <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
		|				ТОГДА КадровыйРезерв.ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КадровыйРезервДолжности.Ссылка
		|ИЗ
		|	Справочник.КадровыйРезерв.Должности КАК КадровыйРезервДолжности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КадровыйРезерв.Подразделения КАК КадровыйРезервПодразделения
		|		ПО КадровыйРезервДолжности.Ссылка = КадровыйРезервПодразделения.Ссылка
		|			И КадровыйРезервДолжности.Должность = КадровыйРезервПодразделения.Должность
		|ГДЕ
		|	КадровыйРезервДолжности.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И КадровыйРезервДолжности.Ссылка.ВАрхиве = ЛОЖЬ
		|	И КадровыйРезервДолжности.Должность = &Должность
		|	И ВЫБОР
		|			КОГДА КадровыйРезервПодразделения.Подразделение ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ КадровыйРезервПодразделения.Подразделение = &МестоВСтруктуреПредприятия
		|		КОНЕЦ";
	Запрос.УстановитьПараметр("Должность", Должность);
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", ПозицияШтатногоРасписания);
	Запрос.УстановитьПараметр("МестоВСтруктуреПредприятия", МестоВСтруктуреПредприятия);
	
	Если УстанавливатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПозицииРезерва,
		РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПозицияКадровогоРезерва"), Истина);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ДополнитьПозицииРезерваПоДолжности(ПозицииРезерва, Должность);
	КонецЕсли;
	
	Возврат ПозицииРезерва;
	
КонецФункции

// Параметры:
//  Должность - СправочникСсылка.Должности
//  УстанавливатьПривилегированныйРежим - Булево
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.КадровыйРезерв
Функция ПозицииКадровогоРезерваСогласноДолжности(Должность, УстанавливатьПривилегированныйРежим = Ложь) Экспорт
	
	ПозицииРезерва = Новый Массив; // Массив из СправочникСсылка.КадровыйРезерв
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КадровыйРезервДолжности.Ссылка КАК ПозицияРезерва
		|ИЗ
		|	Справочник.КадровыйРезерв.Должности КАК КадровыйРезервДолжности
		|ГДЕ
		|	КадровыйРезервДолжности.Должность = &Должность
		|	И КадровыйРезервДолжности.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И КадровыйРезервДолжности.Ссылка.ВАрхиве = ЛОЖЬ";
	Запрос.УстановитьПараметр("Должность", Должность);
	
	Если УстанавливатьПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПозицииРезерва,
		РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ПозицияРезерва"), Истина);
		
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ДополнитьПозицииРезерваПоДолжности(ПозицииРезерва, Должность);
	КонецЕсли;
	
	Возврат ПозицииРезерва;
	
КонецФункции

// Функция возвращает список уже введенных позиций кадрового резерва, соотнесенных с позицией штатного расписания.
// 
// Параметры:
//  НеУчитываяСсылку - СправочникСсылка.КадровыйРезерв
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ШтатноеРасписание
Функция СписокКлючевыхПозицийШтатногоРасписания(НеУчитываяСсылку) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НеУчитываяСсылку", НеУчитываяСсылку);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	КадровыйРезерв.ПозицияШтатногоРасписания
	|ИЗ
	|	Справочник.КадровыйРезерв КАК КадровыйРезерв
	|ГДЕ
	|	НЕ КадровыйРезерв.ВАрхиве
	|	И КадровыйРезерв.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания)
	|	И НЕ КадровыйРезерв.ПозицияШтатногоРасписания = ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|	И КадровыйРезерв.Ссылка <> &НеУчитываяСсылку";	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПозицияШтатногоРасписания");

КонецФункции

// Возвращает СправочникСсылка.КадровыйРезерв по строковому GUID
// 
// Параметры:
//  НавигационнаяСсылка - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.КадровыйРезерв
Функция ПолучитьПозициюРезерваПоСсылке(НавигационнаяСсылка) Экспорт
	Возврат Справочники.КадровыйРезерв.ПолучитьСсылку(Новый УникальныйИдентификатор(НавигационнаяСсылка));
КонецФункции

Процедура СоздатьРешениеАттестационныхКомиссийРекомендуетсяВКадровыйРезерв() Экспорт

	ОписаниеРешения = Справочники.РешенияАттестационныхКомиссий.ОписаниеРешения();
	ОписаниеРешения.ПредопределенныйЭлемент 	= Истина;
	ОписаниеРешения.ИмяПредопределенныхДанных 	= "РекомендуетсяВКадровыйРезерв";
	ОписаниеРешения.Наименование				= НСтр("ru = 'Рекомендуется в кадровый резерв'");
	ОписаниеРешения.РешениеКомиссии				= НСтр("ru = 'Рекомендуется в кадровый резерв'");
	Справочники.РешенияАттестационныхКомиссий.НовоеРешение(ОписаниеРешения);
	
КонецПроцедуры

// Функция дополняет описание профиля ролями для работы с подсистемой Кадровый резерв.
// 
// Параметры:
//  ОписаниеПрофиля - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа
Процедура ДополнитьОписаниеПрофиляКадровымРезервом(ОписаниеПрофиля) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.ДополнитьОписаниеПрофиля(ОписаниеПрофиля);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		МодульПодборПерсонала.ДополнитьОписаниеПрофиляПравамиНаЧтение(ОписаниеПрофиля);
		МодульПодборПерсонала.ДополнитьПрофильВидомДоступаПоГруппамКандидатов(ОписаниеПрофиля);
	КонецЕсли;
	
	МассивДобавляемыхРолей = Новый Массив;
	// Роли кадрового резерва.
	МассивДобавляемыхРолей.Добавить("ДобавлениеИзменениеКадровогоРезерва");
	МассивДобавляемыхРолей.Добавить("ДобавлениеИзменениеЗаявокНаВключениеВКадровыйРезерв");
	МассивДобавляемыхРолей.Добавить("НастройкаКадровогоРезерва");
	МассивДобавляемыхРолей.Добавить("ДобавлениеИзменениеСтатусовРезервистов");
	МассивДобавляемыхРолей.Добавить("ДобавлениеИзменениеОснованийКадровогоРезерва");
	МассивДобавляемыхРолей.Добавить("ПодсистемаКадровыйРезерв");

	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхЭлектронногоИнтервью",
		"ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеИнтервью");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Роли, МассивДобавляемыхРолей, Истина);
	
КонецПроцедуры

// Возвращаемое значение:
//  ТаблицаЗначений - Новая таблица данных резервистов:
// * ФИОПолные - Строка 
// * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
// * Организация - СправочникСсылка.Организации
// * Подразделение - СправочникСсылка.ПодразделенияОрганизаций
// * Должность - СправочникСсылка.Должности
// * РабочееМестоПериодРегистрации - Дата
// * МестоВСтруктуреПредприятия - СправочникСсылка.СтруктураПредприятия
// * ДополнительныеДанные - Структура
Функция НоваяТаблицаДанныхУчастниковКадровогоРезерва() Экспорт
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("УчастникКадровогоРезерва", Метаданные.ОпределяемыеТипы.УчастникКадровогоРезерва.Тип);
	ТаблицаДанных.Колонки.Добавить("ФИОПолные", Новый ОписаниеТипов("Строка"));
	ТаблицаДанных.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаДанных.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ТаблицаДанных.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.Должности"));
	ТаблицаДанных.Колонки.Добавить("РабочееМестоПериодРегистрации", Новый ОписаниеТипов("Дата"));
	ТаблицаДанных.Колонки.Добавить("МестоВСтруктуреПредприятия", Новый ОписаниеТипов(
		"СправочникСсылка.СтруктураПредприятия"));
	ТаблицаДанных.Колонки.Добавить("ДополнительныеДанные", Новый ОписаниеТипов("Структура"));

	Возврат ТаблицаДанных;
	
КонецФункции

// Параметры:
//  УчастникиКадровогоРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. НоваяТаблицаДанныхУчастниковКадровогоРезерва
Функция ДанныеУчастниковКадровогоРезерва(УчастникиКадровогоРезерва) Экспорт
	
	Данные = НоваяТаблицаДанныхУчастниковКадровогоРезерва();
	
	ФизическиеЛица = ОбщегоНазначения.СкопироватьРекурсивно(УчастникиКадровогоРезерва);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ФизическиеЛица,
		Тип("СправочникСсылка.ФизическиеЛица"));
	ДополнитьДанныеРезервистовДаннымиСотрудников(Данные, ФизическиеЛица);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		МодульПодборПерсонала.ДополнитьДанныеРезервистов(Данные, УчастникиКадровогоРезерва);
	КонецЕсли;
	
	Возврат Данные;
		
КонецФункции

// Параметры:
//  УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
// 
// Возвращаемое значение:
//  Структура,Неопределено:
//   * ФИОПолные - Строка 
//   * УчастникКадровогоРезерва - ОпределяемыйТип.УчастникКадровогоРезерва
//   * Организация - СправочникСсылка.Организации
//   * Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//   * Должность - СправочникСсылка.Должности
//   * РабочееМестоПериодРегистрации - Дата
//   * МестоВСтруктуреПредприятия - СправочникСсылка.СтруктураПредприятия
//   * ДополнительныеДанные - Структура
Функция ДанныеУчастникаКадровогоРезерва(УчастникКадровогоРезерва)Экспорт
	
	ТаблицаДанных = ДанныеУчастниковКадровогоРезерва(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		УчастникКадровогоРезерва));
		
	Если ЗначениеЗаполнено(ТаблицаДанных) Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанных[0]);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Параметры:
//  УчастникиКадровогоРезерва - Массив из ОпределяемыйТип.УчастникКадровогоРезерва
// 
// Возвращаемое значение:
//  см. КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц
Функция ФотографииУчастниковКадровогоРезерва(УчастникиКадровогоРезерва) Экспорт
	
	Фотографии = Новый Соответствие;
	
	ФизическиеЛица = ОбщегоНазначения.СкопироватьРекурсивно(УчастникиКадровогоРезерва);
	ОбщегоНазначенияБЗККлиентСервер.УдалитьВсеВхожденияКромеТипаИзМассива(ФизическиеЛица,
		Тип("СправочникСсылка.ФизическиеЛица"));
	
	Фотографии = КадровыйУчетРасширенный.АдресаФотографийФизическихЛиц(ФизическиеЛица);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ФотографииКандидатов = МодульПодборПерсонала.АдресаФотографийЛичныхДанныхКандидатов(УчастникиКадровогоРезерва);
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Фотографии, ФотографииКандидатов);
	КонецЕсли;
	
	Возврат Фотографии;
	
КонецФункции

// Возвращаемое значение:
//  ОписаниеТипов
Функция ОписаниеТиповУчастниковКадровогоРезерва() Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.УчастникКадровогоРезерва.Тип;
	
КонецФункции

Функция СтатусГотовностиРезервистовГотовКНазначению() Экспорт
	
	Возврат Справочники.СтатусыГотовностиРезервистов.ГотовКНазначению;
	
КонецФункции

Функция ПустойСтатусГотовностиРезервистов() Экспорт
	
	Возврат Справочники.СтатусыГотовностиРезервистов.ПустаяСсылка();
	
КонецФункции

Функция ПустаяПозицияКадровогоРезерва() Экспорт
	
	Возврат Справочники.КадровыйРезерв.ПустаяСсылка();
	
КонецФункции

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Справочники.КадровыйРезерв);
	СписокОбъектов.Добавить(Документы.ВключениеВКадровыйРезерв);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаВключениеВКадровыйРезерв);
	СписокОбъектов.Добавить(Документы.ИсключениеИзКадровогоРезерва);
	СписокОбъектов.Добавить(Документы.ИзменениеСтатусаГотовностиРезервистов);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf0a-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ВключениеВКадровыйРезерв);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbeef-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ЗаявкаНаВключениеВКадровыйРезерв);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfa1-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ИсключениеИзКадровогоРезерва);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "b9fc0abd-f472-45fc-b43c-15fd7b8ae14b", Метаданные.Документы.ИзменениеСтатусаГотовностиРезервистов);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbf0c-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.ВидыКадровогоРезерва);
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfdf-9802-11e9-80cd-4cedfb43b11a", Метаданные.Справочники.КадровыйРезерв);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ВключениеВКадровыйРезерв, Истина);
	Списки.Вставить(Метаданные.Справочники.ВключениеВКадровыйРезервПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВключениеВКадровыйРезерв, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаВключениеВКадровыйРезервПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ИсключениеИзКадровогоРезерва, Истина);
	Списки.Вставить(Метаданные.Справочники.ИсключениеИзКадровогоРезерваПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеСтатусаГотовностиРезервистов, Истина);
	Списки.Вставить(Метаданные.Справочники.ИзменениеСтатусаГотовностиРезервистовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КадровыйРезерв, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КадровыйРезерв, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатусыГотовностиРезервистов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсторияКадровогоРезерва, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КлючевыеДолжностиКадровогоРезерва, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ДокументыКадровогоРезерва, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПереносДанныхИзПрежнихПрограмм

Процедура КадровыйРезерв_ПослеЗагрузки(Объект, ОбъектНайден, ПараметрыОбъекта, Отказ) Экспорт
	
	Если Отказ Или Не ОбъектНайден Или ПараметрыОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",				ПараметрыОбъекта.Получить("Организация"));
	Запрос.УстановитьПараметр("Должность",					ПараметрыОбъекта.Получить("Должность"));
	Запрос.УстановитьПараметр("Подразделение",				ПараметрыОбъекта.Получить("Подразделение"));
	Запрос.УстановитьПараметр("ПодразделениеОрганизации",	ПараметрыОбъекта.Получить("ПодразделениеОрганизации"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""00010101"" КАК Период
	|ПОМЕСТИТЬ ВТПериоды";
	
	Запрос.Выполнить();
	
	ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра("ВТПериоды");
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", Запрос.МенеджерВременныхТаблиц, Истина, ОписаниеФильтра,
		ПараметрыПостроения, "ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия");
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ШтатноеРасписание.Ссылка КАК ПозицияШтатногоРасписания
	|ИЗ
	|	Справочник.ШтатноеРасписание КАК ШтатноеРасписание
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТМестоПозицииШтатногоРасписанияВСтруктуреПредприятия КАК МестоПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ПО ШтатноеРасписание.Ссылка = МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиция
	|ГДЕ
	|	ШтатноеРасписание.Должность = &Должность
	|	И ВЫБОР
	|			КОГДА &Подразделение = НЕОПРЕДЕЛЕНО
	|				ТОГДА ШтатноеРасписание.Владелец = &Организация
	|						И ШтатноеРасписание.Подразделение = &ПодразделениеОрганизации
	|			ИНАЧЕ МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение = &Подразделение
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.ПозицияШтатногоРасписания = Выборка.ПозицияШтатногоРасписания;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВключениеВКадровыйРезервПослеЗагрузки(Объект, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛицаОбъекта = Объект.Сотрудники.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
	ДокументКадровогоРезерваПослеЗагрузки(Объект, ФизическиеЛицаОбъекта);
	
КонецПроцедуры

Процедура ИсключениеИзКадровогоРезерваПослеЗагрузки(Объект, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛицаОбъекта = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.ФизическоеЛицо);
	ДокументКадровогоРезерваПослеЗагрузки(Объект, ФизическиеЛицаОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "КадровыйРезерв";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("09c29400-d682-4082-b491-8adcdd9aa19b");
	Раздел.Представление = НСтр("ru = 'Кадровый резерв'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
КонецПроцедуры

#Область НастройкиВариантовОтчетов

// Определяет разделы, в которых доступна панель отчетов.
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
// Описание:
//   В Разделы необходимо добавить метаданные тех разделов,
//   в которых размещены команды вызова панелей отчетов.
//
// Например:
//	Разделы.Добавить(Метаданные.Подсистемы.ИмяПодсистемы);
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	Если Разделы.НайтиПоЗначению(Метаданные.Подсистемы.ОбучениеИРазвитие) = Неопределено Тогда
		Разделы.Добавить(Метаданные.Подсистемы.ОбучениеИРазвитие, НСтр("ru = 'Отчеты по обучению и развитию'"));
	КонецЕсли;
	
КонецПроцедуры

// Содержит настройки размещения вариантов отчетов в панели отчетов.
// Описание см. ЗарплатаКадрыВариантыОтчетов.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.КадровыйРезервКлючевыхДолжностей);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.АнализКадровогоРезерва);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДлительностьПодготовкиРезервистов);
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.СоставКадровогоРезерва);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
		МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
		МодульКадровыйРезервГосслужащих.НастроитьВариантыОтчетов(Настройки);
	КонецЕсли;
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КадровыйРезервКлючевыхДолжностей, "КадровыйРезервКлючевыхДолжностей");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.КадровыйРезервКлючевыхДолжностей, "ГотовностьКадровогоРезерва");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.АнализКадровогоРезерва, "АнализКадровогоРезерва");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДлительностьПодготовкиРезервистов, "ДлительностьПодготовкиРезервистов");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СоставКадровогоРезерва, "ПозицииРезерва");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	
	Вариант = ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.СоставКадровогоРезерва, "ЦелевыеПозиции");
	Вариант.ФункциональныеОпции.Добавить("ИспользоватьКадровыйРезерв");
	Вариант.Включен = Не ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении");
	
КонецПроцедуры

// Возвращает таблицу позиций кадрового резерва, соответствующих переданным позициям штатного расписания.
// 
Функция ПозицииРезерваПоПозициямШтатногоРасписания(СписокПозиций, ВключатьГруппыДолжностей = Истина)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокПозиций", СписокПозиций);
	Запрос.УстановитьПараметр("ВключатьГруппыДолжностей", ВключатьГруппыДолжностей);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КадровыйРезерв.ПозицияШтатногоРасписания КАК Позиция,
		|	КадровыйРезерв.Ссылка КАК КадровыйРезерв
		|ИЗ
		|	Справочник.КадровыйРезерв КАК КадровыйРезерв
		|ГДЕ
		|	КадровыйРезерв.ПозицияШтатногоРасписания В (&СписокПозиций)
		|	И КадровыйРезерв.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияКадровогоРезерва.ПозицияШтатногоРасписания)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ШтатноеРасписание.Ссылка,
		|	КадровыйРезервДолжности.Ссылка
		|ИЗ
		|	Справочник.КадровыйРезерв.Должности КАК КадровыйРезервДолжности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтатноеРасписание КАК ШтатноеРасписание
		|		ПО КадровыйРезервДолжности.Должность = ШтатноеРасписание.Должность
		|		И (&ВключатьГруппыДолжностей)
		|		И (ШтатноеРасписание.Ссылка В (&СписокПозиций))
		|		И
		|			(КадровыйРезервДолжности.Ссылка.Назначение = ЗНАЧЕНИЕ(Перечисление.НазначенияКадровогоРезерва.ГруппаКадровогоРезерва))";
				   
	УстановитьПривилегированныйРежим(Истина);
	ПозицииРезерва = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПозицииРезерва;
	
КонецФункции

Функция СогласованныйРезервПозиций(СписокПозиций, ДатаАктуальности) Экспорт 
	
	ПозицииКадровогоРезерва = ПозицииРезерваПоПозициямШтатногоРасписания(СписокПозиций);
	
	Отбор = НовыйОтборКадровогоРезерваНаДату();
	Отбор.Статусы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
		
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКадровогоРезерва = КадровыйРезервНаДату(ДатаАктуальности, Отбор);
	УстановитьПривилегированныйРежим(Ложь);
		
	УникальныеФизическиеЛица = Новый Соответствие;
	СписокФизическихЛиц = Новый Массив;
	
	ФизическиеЛицаПозиций = Новый Соответствие;
	
	Для Каждого ДанныеФизическогоЛица Из ДанныеКадровогоРезерва Цикл 
		
		Если УникальныеФизическиеЛица[ДанныеФизическогоЛица.ФизическоеЛицо] = Неопределено Тогда 
			УникальныеФизическиеЛица.Вставить(ДанныеФизическогоЛица.ФизическоеЛицо, Истина);
			СписокФизическихЛиц.Добавить(ДанныеФизическогоЛица.ФизическоеЛицо);
		КонецЕсли;
		
		Отбор = Новый Структура("КадровыйРезерв", ДанныеФизическогоЛица.ПозицияРезерва);
		НайденныеПозиции = ПозицииКадровогоРезерва.НайтиСтроки(Отбор);
		
		Для Каждого ДанныеПозиции Из НайденныеПозиции Цикл 
			ФизическиеЛица = ФизическиеЛицаПозиций[ДанныеПозиции.Позиция];
			Если ФизическиеЛица = Неопределено Тогда 
				ФизическиеЛица = Новый Соответствие;
				ФизическиеЛицаПозиций.Вставить(ДанныеПозиции.Позиция, ФизическиеЛица);
			КонецЕсли;
			ФизическиеЛица.Вставить(ДанныеФизическогоЛица.ФизическоеЛицо, Истина);
		КонецЦикла;
		
	КонецЦикла;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, СписокФизическихЛиц, "ФИОПолные", ДатаАктуальности);
	
	КадровыйРезервПозиций = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ФизическиеЛицаПозиций Цикл 
		
		Позиция = КлючИЗначение.Ключ;
		ФизическиеЛица = КлючИЗначение.Значение;
		
		КадровыйРезервПозиции = Новый СписокЗначений;
		Для Каждого ДанныеФизическогоЛица Из ФизическиеЛица Цикл 
			КадровыеДанныеФизическогоЛица = КадровыеДанные.Найти(ДанныеФизическогоЛица.Ключ, "ФизическоеЛицо");
			Если КадровыеДанныеФизическогоЛица <> Неопределено Тогда 
				КадровыйРезервПозиции.Добавить(КадровыеДанныеФизическогоЛица.ФизическоеЛицо, КадровыеДанныеФизическогоЛица.ФИОПолные);
			КонецЕсли;
		КонецЦикла;
		
		КадровыйРезервПозиции.СортироватьПоПредставлению();
		КадровыйРезервПозиций.Вставить(Позиция, КадровыйРезервПозиции);
		
	КонецЦикла;
	
	Возврат КадровыйРезервПозиций;
	
КонецФункции

Функция ЗначениеВремениПоСтатусуРезерва(Статус) Экспорт 

	Если Статус = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается") Тогда
	    Возврат 20;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано") Тогда
		Возврат 40;
	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка") Тогда
		Возврат 60;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Процедура ЗаполнениеВремениДвиженийРегистраИРеквизитовДокументов() Экспорт

	// Движения регистра
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияКадровогоРезерва.Регистратор
		|ИЗ
		|	РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
		|ГДЕ
		|	ИсторияКадровогоРезерва.Период = НАЧАЛОПЕРИОДА(ИсторияКадровогоРезерва.Период, ДЕНЬ)";
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ИсторияКадровогоРезерва.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьНабора.Период = НачалоДня(ЗаписьНабора.Период) + ЗначениеВремениПоСтатусуРезерва(ЗаписьНабора.Статус);
		КонецЦикла;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
	КонецЦикла;
	
	// Документы.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаВключениеВКадровыйРезерв.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.ЗаявкаНаВключениеВКадровыйРезерв КАК ЗаявкаНаВключениеВКадровыйРезерв
		|ГДЕ
		|	ЗаявкаНаВключениеВКадровыйРезерв.ДатаВыдвижения = НАЧАЛОПЕРИОДА(ЗаявкаНаВключениеВКадровыйРезерв.ДатаВыдвижения, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВключениеВКадровыйРезерв.Ссылка
		|ИЗ
		|	Документ.ВключениеВКадровыйРезерв КАК ВключениеВКадровыйРезерв
		|ГДЕ
		|	ВключениеВКадровыйРезерв.ДатаРассмотрения = НАЧАЛОПЕРИОДА(ВключениеВКадровыйРезерв.ДатаРассмотрения, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсключениеИзКадровогоРезерва.Ссылка
		|ИЗ
		|	Документ.ИсключениеИзКадровогоРезерва КАК ИсключениеИзКадровогоРезерва
		|ГДЕ
		|	ИсключениеИзКадровогоРезерва.ДатаИсключения = НАЧАЛОПЕРИОДА(ИсключениеИзКадровогоРезерва.ДатаИсключения, ДЕНЬ)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Регистратор.ПолучитьОбъект();
		ДокументОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("НастройкиКадровогоРезерва", ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
			Форма.НастройкиКадровогоРезерва, Метаданные.РегистрыСведений.НастройкиКадровогоРезерва));
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("НастройкиКадровогоРезерва") Тогда
		ЗаполнитьЗначенияСвойств(Форма["НастройкиКадровогоРезерва"], СохраненныеНастройки["НастройкиКадровогоРезерва"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКадровогоРезерва.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиКадровогоРезерва);
	ЗаполнитьЗначенияСвойств(Форма.НастройкиКадровогоРезерва, НастройкиСтруктура);
	
КонецПроцедуры

Процедура ПолучитьНастройкиПрограммы(НастройкиПриложения) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКадровогоРезерва.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиКадровогоРезерва);
	НастройкиПриложения.Вставить("НастройкиКадровогоРезерва", НастройкиСтруктура);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиКадровогоРезерва.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиКадровогоРезерва);
	Настройки.Записать();
	
КонецПроцедуры

#КонецОбласти

Процедура ДокументКадровогоРезерваПослеЗагрузки(Объект, ФизическиеЛицаОбъекта)
	
	ОсновныеСотрудникиФизическихЛиц =
		КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ФизическиеЛицаОбъекта, Истина,, Объект.Дата);
		
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(
		Истина, ОсновныеСотрудникиФизическихЛиц.ВыгрузитьКолонку("Сотрудник"),
		"ДолжностьПоШтатномуРасписанию, МестоВСтруктуреПредприятия", Объект.Дата);
		
	Для Каждого ДанныеСотрудника Из КадровыеДанныеСотрудников Цикл
		Объект.Подразделение = ДанныеСотрудника.МестоВСтруктуреПредприятия;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  ТаблицаОтборов - ТаблицаЗначений
// 
// Возвращаемое значение:
//  РезультатЗапроса
Функция РезультатЗапросаДляЗаполненияРегистраКадровыйРезерв(ТаблицаОтборов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаОтборов.ПозицияРезерва КАК ПозицияРезерва,
		|	ТаблицаОтборов.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва
		|ПОМЕСТИТЬ ВТТаблицаОтборов
		|ИЗ
		|	&ТаблицаОтборов КАК ТаблицаОтборов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияКадровогоРезерва.ПозицияРезерва КАК ПозицияРезерва,
		|	ИсторияКадровогоРезерва.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ИсторияКадровогоРезерва.Статус КАК Статус,
		|	ИсторияКадровогоРезерва.ВидРезерва КАК ВидРезерва,
		|	ИсторияКадровогоРезерва.Период КАК ДатаВключения,
		|	ИсторияКадровогоРезерва.ДатаОкончания КАК ДатаИсключения,
		|	ИсторияКадровогоРезерва.Наставник КАК Наставник,
		|	ИсторияКадровогоРезерва.Куратор КАК Куратор,
		|	ИсторияКадровогоРезерва.Основание КАК Основание
		|ПОМЕСТИТЬ ВТДанныеРегистра
		|ИЗ
		|	РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтборов КАК ВТТаблицаОтборов
		|		ПО ИсторияКадровогоРезерва.ПозицияРезерва = ВТТаблицаОтборов.ПозицияРезерва
		|			И ИсторияКадровогоРезерва.УчастникКадровогоРезерва = ВТТаблицаОтборов.УчастникКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеРегистра.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТДанныеРегистра.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТДанныеРегистра.Статус КАК Статус,
		|	ВТДанныеРегистра.ВидРезерва КАК ВидРезерва,
		|	ВТДанныеРегистра.ДатаВключения КАК ДатаВключения,
		|	ВТДанныеРегистра.ДатаИсключения КАК ДатаИсключения,
		|	ВТДанныеРегистра.Наставник КАК Наставник,
		|	ВТДанныеРегистра.Куратор КАК Куратор,
		|	ВТДанныеРегистра.Основание КАК Основание
		|ПОМЕСТИТЬ ВТЗначащихСтатусов
		|ИЗ
		|	ВТДанныеРегистра КАК ВТДанныеРегистра
		|ГДЕ
		|	ВТДанныеРегистра.Статус В(&ЗначащиеСтатусы)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗначащихСтатусов.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТЗначащихСтатусов.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	МАКСИМУМ(ВТЗначащихСтатусов.ДатаВключения) КАК ДатаВключения
		|ПОМЕСТИТЬ ВТУказателиПоследнихЗначащихПериодов
		|ИЗ
		|	ВТЗначащихСтатусов КАК ВТЗначащихСтатусов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗначащихСтатусов.ПозицияРезерва,
		|	ВТЗначащихСтатусов.УчастникКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТУказателиПоследнихЗначащихПериодов.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТУказателиПоследнихЗначащихПериодов.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТЗначащихСтатусов.Статус КАК Статус,
		|	ВТЗначащихСтатусов.ВидРезерва КАК ВидРезерва,
		|	ВТУказателиПоследнихЗначащихПериодов.ДатаВключения КАК ДатаВключения,
		|	ВТЗначащихСтатусов.ДатаИсключения КАК ДатаИсключения,
		|	ВТЗначащихСтатусов.Наставник КАК Наставник,
		|	ВТЗначащихСтатусов.Куратор КАК Куратор,
		|	ВТЗначащихСтатусов.Основание КАК Основание
		|ПОМЕСТИТЬ ВТИтоговыеЗначащиеПериоды
		|ИЗ
		|	ВТУказателиПоследнихЗначащихПериодов КАК ВТУказателиПоследнихЗначащихПериодов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗначащихСтатусов КАК ВТЗначащихСтатусов
		|		ПО ВТУказателиПоследнихЗначащихПериодов.ПозицияРезерва = ВТЗначащихСтатусов.ПозицияРезерва
		|			И ВТУказателиПоследнихЗначащихПериодов.УчастникКадровогоРезерва = ВТЗначащихСтатусов.УчастникКадровогоРезерва
		|			И ВТУказателиПоследнихЗначащихПериодов.ДатаВключения = ВТЗначащихСтатусов.ДатаВключения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДанныеРегистра.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТДанныеРегистра.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТДанныеРегистра.Статус КАК Статус,
		|	ВТДанныеРегистра.ВидРезерва КАК ВидРезерва,
		|	ВТДанныеРегистра.ДатаВключения КАК ДатаИсключения,
		|	ВТДанныеРегистра.Основание КАК Основание
		|ПОМЕСТИТЬ ВТНеЗначащихСтатусов
		|ИЗ
		|	ВТДанныеРегистра КАК ВТДанныеРегистра
		|ГДЕ
		|	ВТДанныеРегистра.Статус В(&СтатусУволен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНеЗначащихСтатусов.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТНеЗначащихСтатусов.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	МАКСИМУМ(ВТНеЗначащихСтатусов.ДатаИсключения) КАК ДатаИсключения
		|ПОМЕСТИТЬ ВТУказателиПоследнихНеЗначащихПериодов
		|ИЗ
		|	ВТНеЗначащихСтатусов КАК ВТНеЗначащихСтатусов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНеЗначащихСтатусов.ПозицияРезерва,
		|	ВТНеЗначащихСтатусов.УчастникКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНеЗначащихСтатусов.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТНеЗначащихСтатусов.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТНеЗначащихСтатусов.Основание КАК Основание,
		|	ВТУказателиПоследнихНеЗначащихПериодов.ДатаИсключения КАК ДатаИсключения
		|ПОМЕСТИТЬ ВТИтоговыеНеЗначащиеСтатусы
		|ИЗ
		|	ВТНеЗначащихСтатусов КАК ВТНеЗначащихСтатусов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУказателиПоследнихНеЗначащихПериодов КАК ВТУказателиПоследнихНеЗначащихПериодов
		|		ПО ВТНеЗначащихСтатусов.ПозицияРезерва = ВТУказателиПоследнихНеЗначащихПериодов.ПозицияРезерва
		|			И ВТНеЗначащихСтатусов.УчастникКадровогоРезерва = ВТУказателиПоследнихНеЗначащихПериодов.УчастникКадровогоРезерва
		|			И ВТНеЗначащихСтатусов.ДатаИсключения = ВТУказателиПоследнихНеЗначащихПериодов.ДатаИсключения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КадровыйРезерв.ПозицияРезерва КАК ПозицияРезерва,
		|	КадровыйРезерв.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	КадровыйРезерв.Рейтинг КАК Рейтинг
		|ПОМЕСТИТЬ ВТРейтинг
		|ИЗ
		|	РегистрСведений.КадровыйРезерв КАК КадровыйРезерв
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтборов КАК ВТТаблицаОтборов
		|		ПО КадровыйРезерв.ПозицияРезерва = ВТТаблицаОтборов.ПозицияРезерва
		|			И КадровыйРезерв.УчастникКадровогоРезерва = ВТТаблицаОтборов.УчастникКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТИтоговыеЗначащиеПериоды.ПозицияРезерва КАК ПозицияРезерва,
		|	ВТИтоговыеЗначащиеПериоды.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ВТИтоговыеЗначащиеПериоды.Статус КАК Статус,
		|	ВТИтоговыеЗначащиеПериоды.ВидРезерва КАК ВидРезерва,
		|	ВТИтоговыеЗначащиеПериоды.ДатаВключения КАК ДатаВключения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ВТИтоговыеЗначащиеПериоды.ДатаИсключения
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТИтоговыеЗначащиеПериоды.ДатаИсключения = ДАТАВРЕМЯ(1, 1, 1)
		|						И ВТИтоговыеЗначащиеПериоды.ДатаВключения < ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения
		|					ТОГДА ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВТИтоговыеЗначащиеПериоды.ДатаИсключения > ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения
		|								И ВТИтоговыеЗначащиеПериоды.ДатаВключения < ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения
		|							ТОГДА ВТИтоговыеНеЗначащиеСтатусы.ДатаИсключения
		|						ИНАЧЕ ВТИтоговыеЗначащиеПериоды.ДатаИсключения
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ДатаИсключения,
		|	ЕСТЬNULL(ВТРейтинг.Рейтинг, 0) КАК Рейтинг,
		|	ВТИтоговыеЗначащиеПериоды.Наставник КАК Наставник,
		|	ВТИтоговыеЗначащиеПериоды.Куратор КАК Куратор,
		|	ВТИтоговыеЗначащиеПериоды.Основание КАК ОснованиеВключенияВРезерв,
		|	ЕСТЬNULL(ВТИтоговыеНеЗначащиеСтатусы.Основание, ЗНАЧЕНИЕ(Справочник.ОснованияКадровогоРезерва.ПустаяСсылка)) КАК ОснованиеИсключенияИзРезерва
		|ИЗ
		|	ВТИтоговыеЗначащиеПериоды КАК ВТИтоговыеЗначащиеПериоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтоговыеНеЗначащиеСтатусы КАК ВТИтоговыеНеЗначащиеСтатусы
		|		ПО ВТИтоговыеЗначащиеПериоды.ПозицияРезерва = ВТИтоговыеНеЗначащиеСтатусы.ПозицияРезерва
		|			И ВТИтоговыеЗначащиеПериоды.УчастникКадровогоРезерва = ВТИтоговыеНеЗначащиеСтатусы.УчастникКадровогоРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРейтинг КАК ВТРейтинг
		|		ПО ВТИтоговыеЗначащиеПериоды.ПозицияРезерва = ВТРейтинг.ПозицияРезерва
		|			И ВТИтоговыеЗначащиеПериоды.УчастникКадровогоРезерва = ВТРейтинг.УчастникКадровогоРезерва";
		
	Запрос.УстановитьПараметр("ТаблицаОтборов", ТаблицаОтборов);
	ЗначащиеСтатусы = Новый Массив;
	ЗначащиеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Рассматривается"));
	ЗначащиеСтатусы.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
	Запрос.УстановитьПараметр("ЗначащиеСтатусы", ЗначащиеСтатусы);
	Запрос.УстановитьПараметр("СтатусУволен", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ПредопределенноеЗначение("Перечисление.СостоянияСогласования.ПустаяСсылка")));
	
	Возврат Запрос.Выполнить();
		
КонецФункции

// См. КадровыйРезервСлужебный.ТипыУчастниковКадровогоРезерваДоступныхПоФункциональнымОпциям
Функция ТипыУчастниковКадровогоРезерваДоступныхПоФункциональнымОпциям() Экспорт
	
	Возврат КадровыйРезервПовтИсп.ТипыУчастниковКадровогоРезерваДоступныхПоФункциональнымОпциям();
	
КонецФункции

// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//  ДатаСреза - см. КадровыйРезервНаДату.Период
//  Отбор - см. НовыйОтборКадровогоРезерваНаДату
Процедура СоздатьВременнуюТаблицуРезервисты(МенеджерВременныхТаблиц, ДатаСреза, Отбор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтатусыРезервистовСрезПоследних.ПозицияРезерва КАК ПозицияРезерва,
		|	СтатусыРезервистовСрезПоследних.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	СтатусыРезервистовСрезПоследних.Статус КАК СтатусРезервиста
		|ПОМЕСТИТЬ ВТСтатусыРезервистов
		|ИЗ
		|	РегистрСведений.СтатусыГотовностиРезервистов.СрезПоследних(&ДатаСреза) КАК СтатусыРезервистовСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПозицияРезерва,
		|	УчастникКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияКадровогоРезерваСрезПоследних.УчастникКадровогоРезерва КАК УчастникКадровогоРезерва,
		|	ИсторияКадровогоРезерваСрезПоследних.ПозицияРезерва КАК ПозицияРезерва,
		|	ИсторияКадровогоРезерваСрезПоследних.Статус КАК Статус,
		|	ИсторияКадровогоРезерваСрезПоследних.ВидРезерва КАК ВидРезерва,
		|	ИсторияКадровогоРезерваСрезПоследних.Наставник КАК Наставник,
		|	ИсторияКадровогоРезерваСрезПоследних.Куратор КАК Куратор,
		|	ИсторияКадровогоРезерваСрезПоследних.Период КАК Период,
		|	ВТСтатусыРезервистов.СтатусРезервиста КАК СтатусРезервиста
		|ПОМЕСТИТЬ ВТРезервисты
		|ИЗ
		|	РегистрСведений.ИсторияКадровогоРезерва.СрезПоследних(&ДатаСреза, ДатаОкончания >= &ДатаСреза
		|	ИЛИ ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)) КАК ИсторияКадровогоРезерваСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыРезервистов КАК ВТСтатусыРезервистов
		|		ПО ИсторияКадровогоРезерваСрезПоследних.ПозицияРезерва = ВТСтатусыРезервистов.ПозицияРезерва
		|		И ИсторияКадровогоРезерваСрезПоследних.УчастникКадровогоРезерва = ВТСтатусыРезервистов.УчастникКадровогоРезерва
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	УчастникКадровогоРезерва";
	
	Если Отбор <> Неопределено Тогда
		СхемаЗапроса = Новый СхемаЗапроса();
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
		ПакетЗапросаСтатусыРезервистов = СхемаЗапроса.ПакетЗапросов[0];
		ОператорЗапросаСтатусыРезервистов = ПакетЗапросаСтатусыРезервистов.Операторы[0]; 
		СтатусыГотовностиРезервистовПараметры = ОператорЗапросаСтатусыРезервистов.Источники[0].Источник.Параметры;
		СтатусыГотовностиРезервистовОтбор = "";
		
		ПакетЗапросаРезервисты = СхемаЗапроса.ПакетЗапросов[1];
		ОператорЗапросаРезервисты = ПакетЗапросаРезервисты.Операторы[0]; 
		ИсторияКадровогоРезерваПараметры = ОператорЗапросаРезервисты.Источники[0].Источник.Параметры;
		ИсторияКадровогоРезерваОтбор = "(" + ИсторияКадровогоРезерваПараметры[1].Выражение + ")";
	
		// Отбор по измерениям регистра.
		Если ЗначениеЗаполнено(Отбор.УчастникиКадровогоРезерва) Тогда
			ТекстУсловия = "УчастникКадровогоРезерва В(&УчастникиКадровогоРезерва)";
			ИсторияКадровогоРезерваОтбор = ИсторияКадровогоРезерваОтбор	+ " И " + ТекстУсловия;
			СтатусыГотовностиРезервистовОтбор = СтатусыГотовностиРезервистовОтбор + ТекстУсловия;
			УстановитьПараметрЗначениеВМассиве(Запрос, "УчастникиКадровогоРезерва", Отбор.УчастникиКадровогоРезерва);
		КонецЕсли;
		Если ЗначениеЗаполнено(Отбор.ПозицияРезерва) Тогда
			ТекстУсловия = "ПозицияРезерва В(&ПозицияРезерва)";
			ИсторияКадровогоРезерваОтбор = ИсторияКадровогоРезерваОтбор + " И " + ТекстУсловия;
			СтатусыГотовностиРезервистовОтбор = СтатусыГотовностиРезервистовОтбор
				+ ?(ЗначениеЗаполнено(СтатусыГотовностиРезервистовОтбор), " И ", "") + ТекстУсловия;
			УстановитьПараметрЗначениеВМассиве(Запрос, "ПозицияРезерва", Отбор.ПозицияРезерва);
		КонецЕсли;
		Если ЗначениеЗаполнено(Отбор.ИсключаемыйРегистратор) Тогда
			ИсторияКадровогоРезерваОтбор = ИсторияКадровогоРезерваОтбор + " И Регистратор <> &Регистратор";
			Запрос.УстановитьПараметр("Регистратор", Отбор.ИсключаемыйРегистратор);
		КонецЕсли;
		СтатусыГотовностиРезервистовПараметры[1].Выражение = Новый ВыражениеСхемыЗапроса(СтатусыГотовностиРезервистовОтбор);
		ИсторияКадровогоРезерваПараметры[1].Выражение = Новый ВыражениеСхемыЗапроса(ИсторияКадровогоРезерваОтбор);
		
		// Отбор по ресурсам регистра.
		Если ЗначениеЗаполнено(Отбор.Статусы) Тогда
			ОператорЗапросаСтатусыРезервистов.Отбор.Добавить("СтатусыРезервистовСрезПоследних.Статус В(&Статусы)");
			ОператорЗапросаРезервисты.Отбор.Добавить("ИсторияКадровогоРезерваСрезПоследних.Статус В(&Статусы)");
			УстановитьПараметрЗначениеВМассиве(Запрос, "Статусы", Отбор.Статусы);
		КонецЕсли;
		Если ЗначениеЗаполнено(Отбор.ВидРезерва) Тогда
			ОператорЗапросаРезервисты.Отбор.Добавить("ВидРезерва В(&ВидРезерва)");
			УстановитьПараметрЗначениеВМассиве(Запрос, "ВидРезерва", Отбор.ВидРезерва);
		КонецЕсли;
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура УстановитьПараметрЗначениеВМассиве(Запрос, ИмяПараметра, ЗначениеПараметра)
	
	Если ТипЗнч(ЗначениеПараметра) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр(ИмяПараметра, ЗначениеПараметра);
	Иначе
		Запрос.УстановитьПараметр(ИмяПараметра, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗначениеПараметра));
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ДанныеУчастниковКадровогоРезерва - см. НоваяТаблицаДанныхУчастниковКадровогоРезерва
//  ФизическиеЛица - Массив из СправочникСсылка.ФизическиеЛица
Процедура ДополнитьДанныеРезервистовДаннымиСотрудников(ДанныеУчастниковКадровогоРезерва, ФизическиеЛица)
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.СписокФизическихЛиц = ФизическиеЛица;
	ПараметрыПолучения.ОкончаниеПериода = ТекущаяДатаСеанса();
	ПараметрыПолучения.КадровыеДанные =
		"ФИОПолные, Организация, Подразделение, Должность, РабочееМестоПериодРегистрации, МестоВСтруктуреПредприятия";
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	Для Каждого СтрокаТаблицы Из СотрудникиОрганизации Цикл
		НоваяСтрока = ДанныеУчастниковКадровогоРезерва.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока.УчастникКадровогоРезерва = СтрокаТаблицы.ФизическоеЛицо;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИспользованиеКадровогоРезерваПоВидам(КадровыйРезервПоВидамДоступен) Экспорт
	
	КадровыйРезервПоВидамДоступен = Ложь;
	
	Если КадровыйРезервДоступенПользователю() И ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам") Тогда
		
		КадровыйРезервПоВидамДоступен = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
