///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// Работает только если подсистема ИПП выключена из командного интерфейса.
// e1cib/command/Справочник.Новости.Команда.КомандаСписокНовостейПоЛентеНовостей.

// Важно, что подсистема ИнтернетПоддержкаПользователей должна быть включена в командный интерфейс (хотя может быть и не видна).
// Иначе будет ошибка при вызове этой команды.
// При изменении наименования подсистемы ИнтернетПоддержкаПользователей, необходимо изменить ссылки и здесь.
// НЕ работает, если подсистема ИПП выключена из командного интерфейса.
// e1cib/navigationpoint/ИнтернетПоддержкаПользователей/Справочник.Новости.Команда.КомандаСписокНовостейПоЛентеНовостей.

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОбработкаНовостейКлиент.ОткрытьСписокНовостейПоЛентеНовостей(
		ПараметрКоманды,
		ПараметрыВыполненияКоманды,
		"e1cib/command/Справочник.Новости.Команда.ОткрытьСписокНовостейПоЛентеНовостей");

	// Если команда - параметризуемая (настраивается в метаданных, реквизит "Группа"),
	//  то можно передать ей УИН (ссылку строкой, как это реализовано в ПолучитьНавигационнуюСсылку()) параметра команды.
	// Если ссылку на параметр команды получить через Ссылка.УникальныйИдентификатор(),
	//  то вместо ссылки (36 символов, 5 блоков букв и цифр через минус) вида А-Б-В-Г-Д,
	//  надо будет передать без минусов, блоки в таком порядке: ГДВБА.
	// https://its.1c.ru/db/v851doc#bookmark:dev:TI000001231
	// e1cib/command/Справочник.Новости.Команда.КомандаСписокНовостейПоЛентеНовостей?cmdprm={УИНСсылкиПараметраКоманды}
	// e1cib/command/Справочник.Новости.Команда.КомандаСписокНовостейПоЛентеНовостей?cmdprm={УИНСсылкиПараметраКоманды}&extdata={extdata}

КонецПроцедуры

#КонецОбласти
