#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	Если Параметры.МножественныйВыбор = Истина Тогда
		Элементы.Список.МножественныйВыбор = Истина;
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Множественный;
		ЗакрыватьПриВыборе = Ложь;
	Иначе
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресСпискаПодобранных") Тогда
		Подобранные.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.АдресСпискаПодобранных));
	КонецЕсли;
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
	ТекущийМесяц = ТекущаяДатаСеанса();
	ФорматнаяСтрока = НСтр("ru='ДФ=''ММММ"", ст.""'''");
	Элементы.КоличествоСтавокТекущее.Заголовок = Формат(ТекущийМесяц, ФорматнаяСтрока);
	Элементы.КоличествоСтавокПредыдущее.Заголовок = Формат(ДобавитьМесяц(ТекущийМесяц, -1), ФорматнаяСтрока);
	Элементы.КоличествоСтавокБудущее.Заголовок = Формат(ДобавитьМесяц(ТекущийМесяц, 1), ФорматнаяСтрока);
	
	// Выделение подобранных.
	КадровоеПланированиеФормы.УстановитьУсловноеОформлениеПодобранных(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		МодульОрганизационнаяСтруктура = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Если МодульОрганизационнаяСтруктура.ТребуетсяУсловноеОформлениеСтруктурыПредприятия() Тогда
			УправлениеШтатнымРасписаниемФормы.УстановитьУсловноеОформлениеСпискаПодразделений(ЭтотОбъект, "СтруктураПредприятия");
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидСпискаПозиций();
	УстановитьОтборСпискаПодразделений();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
		МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ПрофильДолжности",
			"Видимость",
			МодульПодборПерсонала.ЕстьДоступКПрофилямДолжностей());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.РежимВыбора Или Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	Если ВсеВыбранные.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	НачатьВопросОВыбореПодобранных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтруктураПредприятия

&НаКлиенте
Процедура СтруктураПредприятияПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоПодразделениюНаКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;

	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	ОбновитьПодобранные(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Не Элементы.Список.РежимВыбора Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Элементы.Список.МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Если Значение.Количество() > 1 Или ВсеВыбранные.Количество() = 0 Тогда
		ОбновитьПодобранные(Значение);
	КонецЕсли;

	ОповеститьОВыборе(ВсеВыбранные.ВыгрузитьЗначения());
	ВсеВыбранные.Очистить();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Строки[Строки.ПолучитьКлючи()[0]].Данные;
	Если Не ДанныеСтроки.Свойство("КоличествоСтавокПредыдущее")
		И Не ДанныеСтроки.Свойство("КоличествоСтавокТекущее")
		И Не ДанныеСтроки.Свойство("КоличествоСтавокБудущее") Тогда
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПозицииКОбновлению", ОбщегоНазначения.ВыгрузитьКолонку(Строки.ПолучитьКлючи(), "Ссылка"));
	Запрос.УстановитьПараметр("ТекущийМесяц", НачалоМесяца(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ПредыдущийМесяц", ДобавитьМесяц(Запрос.Параметры.ТекущийМесяц, -1));
	Запрос.УстановитьПараметр("БудущийМесяц", ДобавитьМесяц(Запрос.Параметры.ТекущийМесяц, 1));
	Запрос.УстановитьПараметр("ПоказательКоличествоСтавок", КадровоеПланирование.ПоказательКоличествоСтавок());
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПоказателиКадровогоПлана.Период, МЕСЯЦ) = &ПредыдущийМесяц
		|				ТОГДА ПоказателиКадровогоПлана.Значение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСтавокПредыдущее,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПоказателиКадровогоПлана.Период, МЕСЯЦ) = &ТекущийМесяц
		|				ТОГДА ПоказателиКадровогоПлана.Значение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСтавокТекущее,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПоказателиКадровогоПлана.Период, МЕСЯЦ) = &БудущийМесяц
		|				ТОГДА ПоказателиКадровогоПлана.Значение
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоСтавокБудущее,
		|	ПоказателиКадровогоПлана.Позиция КАК Позиция
		|ИЗ
		|	РегистрНакопления.ПоказателиКадровогоПлана КАК ПоказателиКадровогоПлана
		|ГДЕ
		|	ПоказателиКадровогоПлана.Период МЕЖДУ &ПредыдущийМесяц И КОНЕЦПЕРИОДА(&БудущийМесяц, МЕСЯЦ)
		|	И ПоказателиКадровогоПлана.Показатель = &ПоказательКоличествоСтавок
		|	И ПоказателиКадровогоПлана.Позиция В(&ПозицииКОбновлению)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиКадровогоПлана.Позиция";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Строки.Получить(Выборка.Позиция);
		ЗаполнитьЗначенияСвойств(Строка.Данные, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВидСпискаВсеПозиции(Команда)
	
	ВидВсеПозиции = Истина;
	УстановитьВидСпискаПозиций(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидСпискаПоПодразделениям(Команда)
	
	ВидВсеПозиции = Ложь;
	УстановитьВидСпискаПозиций(ЭтотОбъект);
	УстановитьОтборПоПодразделению(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПодобранные(Выбранные)
	
	Для Каждого Элемент Из Выбранные Цикл
		Если Не ЕстьВПодобранных(Элемент) Тогда
			Подобранные.Добавить(Элемент);
			ВсеВыбранные.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	УточнитьПодобранныеВУсловномОформлении();
	
КонецПроцедуры

&НаСервере
Процедура УточнитьПодобранныеВУсловномОформлении()
	
	Для Каждого ЭлементОформления Из Список.УсловноеОформление.Элементы Цикл
		Если ЭлементОформления.ИдентификаторПользовательскойНастройки =
			КадровоеПланированиеФормы.ИдентификаторПользовательскойНастройкиВыделениеПодобранных() Тогда
			ОбщегоНазначенияКлиентСервер.ИзменитьЭлементыОтбора(
				ЭлементОформления.Отбор, "Ссылка", , Подобранные.ВыгрузитьЗначения());
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьВПодобранных(ЭтапСсылка)
	Возврат Подобранные.НайтиПоЗначению(ЭтапСсылка) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура НачатьВопросОВыбореПодобранных()
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Подбор позиций'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		Новый ОписаниеОповещения("ЗавершитьВопросОВыбореВыбранных", ЭтотОбъект), 
		НСтр("ru = 'Выбрать подобранные позиции?'"), 
		РежимДиалогаВопрос.ДаНетОтмена,
		ПараметрыВопроса);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВопросОВыбореВыбранных(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Или Ответ.Значение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = КодВозвратаДиалога.Да Тогда
		ОповеститьОВыборе(ВсеВыбранные.ВыгрузитьЗначения());
	КонецЕсли;
	
	ВсеВыбранные.Очистить();
	Закрыть();
	
КонецПроцедуры

#Область ГруппировкаПоПодразделениям

&НаСервере
Процедура НастроитьВидСпискаПозиций()
	
	Если Параметры.РежимВыбора Тогда
		НастроитьВидСпискаПозицийВРежимеВыбора();
		Возврат;
	КонецЕсли;
	
	НастройкаВидВсеПозиции = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПозицииСписок", "ВидВсеПозиции");
	ВидВсеПозиции = НастройкаВидВсеПозиции;
	Если ВидВсеПозиции = Неопределено Тогда
		ВидВсеПозиции = Истина;
	КонецЕсли;
	
	УстановитьВидСпискаПозиций(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидСпискаПозицийВРежимеВыбора()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВидСпискаПодменю", "Видимость", Ложь);
	
	ВидВсеПозиции = Истина;
	УстановитьВидСпискаПозиций(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаПодразделений()
	
	Если ПолучитьФункциональнуюОпцию("СтруктураПредприятияНеСоответствуетСтруктуреЮридическихЛиц") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			СтруктураПредприятия.Отбор, "Источник", , ВидСравненияКомпоновкиДанных.НеЗаполнено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидСпискаПозиций(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СтруктураПредприятия", "Видимость", Не Форма.ВидВсеПозиции);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение", "Видимость", Форма.ВидВсеПозиции);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаВсеПозиции", "Пометка", Форма.ВидВсеПозиции);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидСпискаПоПодразделениям", "Пометка", Не Форма.ВидВсеПозиции);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоПодразделению(Форма)
	
	Если Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.ВидВсеПозиции Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Форма.Список, "Подразделение");
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Форма.Список.Отбор, "Подразделение", Форма.Элементы.СтруктураПредприятия.ТекущаяСтрока, ВидСравненияКомпоновкиДанных.ВИерархии);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПодразделениюНаКлиенте()
	УстановитьОтборПоПодразделению(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти