#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДанныеПоказателейПоСотрудникам(МенеджерВременныхТаблиц, ПараметрыОтчета) Экспорт
	
	УдалитьВТ = Новый Массив;
	
	ДатыПериода = Новый Структура("ДатаНачала, ДатаОкончания", 
			НачалоМесяца(ПараметрыОтчета.Период), КонецМесяца(ПараметрыОтчета.Период));
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективностиКлиентСервер = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективностиКлиентСервер");
		ДатыПериода = МодульКлючевыеПоказателиЭффективностиКлиентСервер.ДатыПериодаГоризонта(
			ПараметрыОтчета.Период, 
			ПараметрыОтчета.Горизонт);
	КонецЕсли;
	
	СоздатьВТПериодыРаботыСотрудников(МенеджерВременныхТаблиц, ПараметрыОтчета, ДатыПериода);
	СоздатьВТСотрудникиОтбор(МенеджерВременныхТаблиц, ПараметрыОтчета, ДатыПериода);
	УдалитьВТ.Добавить("ВТСотрудникиОтбор");
	
	Если ПараметрыОтчета.ИспользоватьЭффективность
		И ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		
		МодульКлючевыеПоказателиСотрудников = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективности");
		МодульКлючевыеПоказателиСотрудников.СоздатьВТОценкиПоказателейСотрудников(МенеджерВременныхТаблиц, "ВТСотрудникиОтбор");
		СоздатьВТОценкаЭффективности(МенеджерВременныхТаблиц, ПараметрыОтчета);
	Иначе
		СоздатьПустуюВТОценкаЭффективности(МенеджерВременныхТаблиц);
	КонецЕсли;
	
	Если ПараметрыОтчета.ИспользоватьПотенциал Тогда
		СоздатьВТОценкаПотенциала(МенеджерВременныхТаблиц, ПараметрыОтчета);
	Иначе
		СоздатьПустуюВТОценкаПотенциала(МенеджерВременныхТаблиц);
	КонецЕсли;
		
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьВТПодразделенияОтбор(МенеджерВременныхТаблиц, ПараметрыОтчета, ДатыПериода)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Период КАК Период,
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ПОМЕСТИТЬ ВТПодразделенияОтбор
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Ссылка В (&Подразделение)";
	
	Запрос.УстановитьПараметр("Период", ДатыПериода.ДатаОкончания);
	
	Если ПараметрыОтчета.ВключаяПодчиненныеПодразделения Тогда
		Запрос.Текст =СтрЗаменить(Запрос.Текст, "СтруктураПредприятия.Ссылка В (", "СтруктураПредприятия.Ссылка В ИЕРАРХИИ(");
	КонецЕсли;
	Запрос.УстановитьПараметр("Подразделение", ПараметрыОтчета.Подразделение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция СтруктураРеквизитовФормы(ПараметрыОтчета)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Период", ПараметрыОтчета.Период);
	СтруктураРеквизитов.Вставить("Горизонт", ПараметрыОтчета.Горизонт);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

Процедура СоздатьВТСотрудникиОтбор(МенеджерВременныхТаблиц, ПараметрыОтчета, СтруктураДат)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
		|	ВТПериодыРаботыСотрудников.Позиция КАК Позиция,
		|	МИНИМУМ(ВТПериодыРаботыСотрудников.ДатаНачала) КАК Период
		|ПОМЕСТИТЬ ВТСгруппированныеПериоды
		|ИЗ
		|	ВТПериодыРаботыСотрудников КАК ВТПериодыРаботыСотрудников
		|ГДЕ
		|	ВТПериодыРаботыСотрудников.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТПериодыРаботыСотрудников.Сотрудник,
		|	ВТПериодыРаботыСотрудников.Позиция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	&Горизонт КАК Горизонт,
		|	ПериодыРаботыСотрудников.Сотрудник КАК Сотрудник,
		|	ПериодыРаботыСотрудников.Период КАК Период,
		|	&ДатаНачала КАК ДатаНачала,
		|	&ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиОтбор
		|ИЗ
		|	ВТСгруппированныеПериоды КАК ПериодыРаботыСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСгруппированныеПериоды";
	
	Запрос.УстановитьПараметр("Горизонт", ПараметрыОтчета.Горизонт);
	Запрос.УстановитьПараметр("ДатаНачала", СтруктураДат.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", СтруктураДат.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОценкаПотенциала(МенеджерВременныхТаблиц, ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МероприятияОценки", ПараметрыОтчета.МероприятияОценки);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТСотрудникиОтбор.Сотрудник КАК Сотрудник,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям КАК ОпросПоКомпетенциям,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.Эксперт КАК Эксперт,
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|				ТОГДА ЗначенияХарактеристик.ЧисловоеЗначение
		|			ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Вопрос.ЭлементарныйВопрос.МаксимальноеЗначение
		|		КОНЕЦ) КАК МаксимальноеЗначение,
		|	ВЫБОР
		|		КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|			ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|		ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|	КОНЕЦ КАК Значение
		|ПОМЕСТИТЬ ВТОценкиПоОпросамКомпетенций
		|ИЗ
		|	ВТСотрудникиОтбор КАК ВТСотрудникиОтбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|			ПО ОценкиОтветовОпросаПоКомпетенциям.Значение.Владелец = ЗначенияХарактеристик.Владелец
		|		ПО ВТСотрудникиОтбор.Сотрудник.ФизическоеЛицо = ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.ИспользоватьВМатрицеТалантов
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям В(&МероприятияОценки)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСотрудникиОтбор.Сотрудник,
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям,
		|	ОценкиОтветовОпросаПоКомпетенциям.ФизическоеЛицо,
		|	ОценкиОтветовОпросаПоКомпетенциям.Эксперт,
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала,
		|	ВЫБОР
		|		КОГДА ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.СпособВыбораОтветаВОпросахПоКомпетенциям = ЗНАЧЕНИЕ(Перечисление.СпособыВыбораОтветовВОпросахПоКомпетенциям.ПоШкале)
		|			ТОГДА ОценкиОтветовОпросаПоКомпетенциям.Значение.ЧисловоеЗначение
		|		ИНАЧЕ ОценкиОтветовОпросаПоКомпетенциям.Оценка
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСотрудникиОтбор.Сотрудник КАК Сотрудник,
		|	ОценкиОтветовНаВопросыАнкет.Мероприятие КАК Мероприятие,
		|	ОценкиОтветовНаВопросыАнкет.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОценкиОтветовНаВопросыАнкет.Респондент КАК Респондент,
		|	ОценкиОтветовНаВопросыАнкет.ХарактеристикаПерсонала КАК ХарактеристикаПерсонала,
		|	ОценкиОтветовНаВопросыАнкет.Вопрос КАК Вопрос,
		|	ОценкиОтветовНаВопросыАнкет.Оценка КАК Оценка,
		|	МАКСИМУМ(ОценкиВариантовОтвета.ОценкаОтвета) КАК МаксимальноеЗначение
		|ПОМЕСТИТЬ ВТОценкиПоВопросамАнкеты
		|ИЗ
		|	ВТСотрудникиОтбор КАК ВТСотрудникиОтбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиОтветовНаВопросыАнкет КАК ОценкиОтветовНаВопросыАнкет
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиВариантовОтвета КАК ОценкиВариантовОтвета
		|			ПО ОценкиОтветовНаВопросыАнкет.ХарактеристикаПерсонала = ОценкиВариантовОтвета.ХарактеристикаПерсонала
		|				И ОценкиОтветовНаВопросыАнкет.Вопрос = ОценкиВариантовОтвета.Вопрос
		|		ПО ВТСотрудникиОтбор.Сотрудник.ФизическоеЛицо = ОценкиОтветовНаВопросыАнкет.ФизическоеЛицо
		|ГДЕ
		|	ОценкиОтветовНаВопросыАнкет.Мероприятие В(&МероприятияОценки)
		|	И ОценкиВариантовОтвета.ХарактеристикаПерсонала.ИспользоватьВМатрицеТалантов
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовНаВопросыАнкет.ФизическоеЛицо,
		|	ВТСотрудникиОтбор.Сотрудник,
		|	ОценкиОтветовНаВопросыАнкет.Респондент,
		|	ОценкиОтветовНаВопросыАнкет.Вопрос,
		|	ОценкиОтветовНаВопросыАнкет.Мероприятие,
		|	ОценкиОтветовНаВопросыАнкет.ХарактеристикаПерсонала,
		|	ОценкиОтветовНаВопросыАнкет.Оценка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОценкиПоОпросамКомпетенций.Сотрудник КАК Сотрудник,
		|	ВТОценкиПоОпросамКомпетенций.ХарактеристикаПерсонала КАК Показатель,
		|	(ВЫРАЗИТЬ(СУММА(ВТОценкиПоОпросамКомпетенций.Значение) / КОЛИЧЕСТВО(ВТОценкиПоОпросамКомпетенций.Сотрудник) КАК ЧИСЛО(15, 2))) / МАКСИМУМ(ВТОценкиПоОпросамКомпетенций.МаксимальноеЗначение) * 100 КАК Потенциал,
		|	ВТОценкиПоОпросамКомпетенций.ОпросПоКомпетенциям КАК Регистратор,
		|	СУММА(ВТОценкиПоОпросамКомпетенций.Значение) / КОЛИЧЕСТВО(ВТОценкиПоОпросамКомпетенций.Эксперт) КАК Значение,
		|	СУММА(ВТОценкиПоОпросамКомпетенций.Значение) / КОЛИЧЕСТВО(ВТОценкиПоОпросамКомпетенций.Эксперт) КАК Оценка,
		|	ЛОЖЬ КАК ЭтоЭффективность,
		|	ВТОценкиПоОпросамКомпетенций.МаксимальноеЗначение КАК МаксимальноеЗначение
		|ПОМЕСТИТЬ ВТОценкаПотенциала
		|ИЗ
		|	ВТОценкиПоОпросамКомпетенций КАК ВТОценкиПоОпросамКомпетенций
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкиПоОпросамКомпетенций.Сотрудник,
		|	ВТОценкиПоОпросамКомпетенций.ХарактеристикаПерсонала,
		|	ВТОценкиПоОпросамКомпетенций.ОпросПоКомпетенциям,
		|	ВТОценкиПоОпросамКомпетенций.МаксимальноеЗначение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТОценкиПоВопросамАнкеты.Сотрудник,
		|	ВТОценкиПоВопросамАнкеты.ХарактеристикаПерсонала,
		|	(ВЫРАЗИТЬ(СУММА(ВТОценкиПоВопросамАнкеты.Оценка) / КОЛИЧЕСТВО(ВТОценкиПоВопросамАнкеты.Сотрудник) КАК ЧИСЛО(15, 2))) / МАКСИМУМ(ВТОценкиПоВопросамАнкеты.МаксимальноеЗначение) * 100,
		|	ВТОценкиПоВопросамАнкеты.Мероприятие,
		|	СУММА(ВТОценкиПоВопросамАнкеты.Оценка) / КОЛИЧЕСТВО(ВТОценкиПоВопросамАнкеты.Респондент),
		|	СУММА(ВТОценкиПоВопросамАнкеты.Оценка) / КОЛИЧЕСТВО(ВТОценкиПоВопросамАнкеты.Респондент),
		|	ЛОЖЬ,
		|	ВТОценкиПоВопросамАнкеты.МаксимальноеЗначение
		|ИЗ
		|	ВТОценкиПоВопросамАнкеты КАК ВТОценкиПоВопросамАнкеты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОценкиПоВопросамАнкеты.Сотрудник,
		|	ВТОценкиПоВопросамАнкеты.ХарактеристикаПерсонала,
		|	ВТОценкиПоВопросамАнкеты.Мероприятие,
		|	ВТОценкиПоВопросамАнкеты.МаксимальноеЗначение";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТОценкаЭффективности(МенеджерВременныхТаблиц, ПараметрыОтчета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	ОценкиПоказателейСотрудников.Показатель КАК Показатель,
		|	ОценкиПоказателейСотрудников.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ОценкиПоказателейСотрудников.УдельныйВес КАК УдельныйВес,
		|	ВЫБОР
		|		КОГДА ОценкиПоказателейСотрудников.МаксимальнаяОценка = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОценкиПоказателейСотрудников.ОценкаПоказателя / ОценкиПоказателейСотрудников.МаксимальнаяОценка * 100
		|	КОНЕЦ КАК ОценкаПоказателяПроцент,
		|	ОценкиПоказателейСотрудников.Позиция КАК Позиция,
		|	ОценкиПоказателейСотрудников.РегистраторФактическогоЗначения КАК Регистратор,
		|	ОценкиПоказателейСотрудников.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ОценкиПоказателейСотрудников.МаксимальнаяОценка КАК МаксимальнаяОценка
		|ПОМЕСТИТЬ ОценкиПоказателейСОтобором
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ОценкиПоказателейСотрудников
		|ГДЕ
		|	ОценкиПоказателейСотрудников.Показатель.ИспользуетсяВМатрицеТалантов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОценкиПоказателейСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(ОценкиПоказателейСотрудников.УдельныйВес) КАК УдельныйВес
		|ПОМЕСТИТЬ ВесПоказателейСОтбором
		|ИЗ
		|	ВТОценкиПоказателейСотрудников КАК ОценкиПоказателейСотрудников
		|ГДЕ
		|	ОценкиПоказателейСотрудников.Показатель.ИспользуетсяВМатрицеТалантов
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиПоказателейСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОценкиПоказателейСОтобором.Сотрудник КАК Сотрудник,
		|	ОценкиПоказателейСОтобором.Показатель КАК Показатель,
		|	ВЫБОР
		|		КОГДА ВесПоказателейСОтбором.УдельныйВес = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОценкиПоказателейСОтобором.УдельныйВес / ВесПоказателейСОтбором.УдельныйВес
		|	КОНЕЦ КАК ВесПоказателя,
		|	ОценкиПоказателейСОтобором.ОценкаПоказателяПроцент КАК ОценкаПоказателяПроцент,
		|	ВЫБОР
		|		КОГДА ВесПоказателейСОтбором.УдельныйВес = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОценкиПоказателейСОтобором.ОценкаПоказателяПроцент * ОценкиПоказателейСОтобором.УдельныйВес / ВесПоказателейСОтбором.УдельныйВес
		|	КОНЕЦ КАК УдельнаяОценкаПоказателя,
		|	ОценкиПоказателейСОтобором.Позиция КАК Позиция,
		|	ОценкиПоказателейСОтобором.Регистратор КАК Регистратор,
		|	ОценкиПоказателейСОтобором.ФактическоеЗначение КАК ФактическоеЗначение,
		|	ОценкиПоказателейСОтобором.ОценкаПоказателя КАК ОценкаПоказателя,
		|	ОценкиПоказателейСОтобором.МаксимальнаяОценка КАК МаксимальнаяОценка
		|ПОМЕСТИТЬ ВТОценкаЭффективности
		|ИЗ
		|	ОценкиПоказателейСОтобором КАК ОценкиПоказателейСОтобором
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВесПоказателейСОтбором КАК ВесПоказателейСОтбором
		|		ПО ОценкиПоказателейСОтобором.Сотрудник = ВесПоказателейСОтбором.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОценкиПоказателейСОтобором
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВесПоказателейСОтбором";
	
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьВТПериодыРаботыСотрудников(МенеджерВременныхТаблиц, ПараметрыОтчета, ДатыПериода)
	
	УдалитьВТ = Новый Массив;
	
	СтруктураРеквизитовПериода = СтруктураРеквизитовФормы(ПараметрыОтчета);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Подразделение) Тогда
		СоздатьВТПодразделенияОтбор(МенеджерВременныхТаблиц, ПараметрыОтчета, ДатыПериода);
		УдалитьВТ.Добавить("ВТПодразделенияОтбор");
		ОрганизационнаяСтруктура.СоздатьВТПозицииПодразделений(МенеджерВременныхТаблиц, "ВТПодразделенияОтбор");
		УдалитьВТ.Добавить("ВТПозицииПодразделений");
		КадровыйУчетРасширенный.СоздатьВТПериодыРаботыСотрудниковПоСпискуПозиций(
			МенеджерВременныхТаблиц,
			"ВТПозицииПодразделений",
			ДатыПериода,
			ПараметрыОтчета.ФизическиеЛица);
	ИначеЕсли ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КлючевыеПоказателиЭффективности") Тогда
		МодульКлючевыеПоказателиЭффективности = ОбщегоНазначения.ОбщийМодуль("КлючевыеПоказателиЭффективности");
		МодульКлючевыеПоказателиЭффективности.СоздатьВТПериодыРаботыСотрудниковПоСпискуФизЛиц(
			МенеджерВременныхТаблиц,
			ПараметрыОтчета.ФизическиеЛица,
			СтруктураРеквизитовПериода);
	Иначе
		КадровыйУчетРасширенный.СоздатьВТПериодыРаботыСотрудниковПоСпискуФизЛиц(МенеджерВременныхТаблиц,
			ПараметрыОтчета.ФизическиеЛица,
			ДатыПериода);
	КонецЕсли;
	
	ЗарплатаКадры.УничтожитьВТ(МенеджерВременныхТаблиц, УдалитьВТ);

КонецПроцедуры

Функция СоздатьПустуюВТОценкаЭффективности(МенеджерВременныхТаблиц)
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ПустаяТаблица.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	ПустаяТаблица.Колонки.Добавить("Показатель", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"));
	ПустаяТаблица.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("СправочникСсылка.ОпросыПоКомпетенциям"));
	ПустаяТаблица.Колонки.Добавить("УдельнаяОценкаПоказателя", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("ОценкаПоказателяПроцент", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("ФактическоеЗначение", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("ОценкаПоказателя", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("МаксимальнаяОценка", Новый ОписаниеТипов("Число"));
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ПустаяТаблица, "ВТОценкаЭффективности");
	
	СоздатьПустуюВТ(МенеджерВременныхТаблиц, "ВТОценкиПоказателейСотрудников", 
		"ВладелецПоказателя", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	
КонецФункции

Функция СоздатьПустуюВТОценкаПотенциала(МенеджерВременныхТаблиц)
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ПустаяТаблица.Колонки.Добавить("Показатель", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"));
	ПустаяТаблица.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("СправочникСсылка.ОпросыПоКомпетенциям"));
	ПустаяТаблица.Колонки.Добавить("Значение", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("МаксимальноеЗначение", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("Потенциал", Новый ОписаниеТипов("Число"));
	ПустаяТаблица.Колонки.Добавить("Оценка", Новый ОписаниеТипов("Число"));
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ПустаяТаблица, "ВТОценкаПотенциала");
	
	СоздатьПустуюВТ(МенеджерВременныхТаблиц, "ВТОценкиПоОпросамКомпетенций", 
		"ОпросПоКомпетенциям", Новый ОписаниеТипов("СправочникСсылка.ОпросыПоКомпетенциям"));
	СоздатьПустуюВТ(МенеджерВременныхТаблиц, "ВТОценкиПоВопросамАнкеты", 
		"Мероприятие", Новый ОписаниеТипов("СправочникСсылка.МероприятияОценкиПерсонала"));
	
КонецФункции

Функция СоздатьПустуюВТ(МенеджерВременныхТаблиц, ИмяТаблицы, ИмяПоказателя, ТипПоказателя, ЧисловыеПоля = "")
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	ПустаяТаблица.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ПустаяТаблица.Колонки.Добавить(ИмяПоказателя, ТипПоказателя);
	
	Если Не ПустаяСтрока(ЧисловыеПоля) Тогда
		МассивПолей = СтрРазделить(ЧисловыеПоля, ",", Ложь);
		Для Каждого ИмяПоля Из МассивПолей Цикл
			ПустаяТаблица.Колонки.Добавить(ИмяПоля, Новый ОписаниеТипов("Число"));
		КонецЦикла;
	КонецЕсли;
	
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ПустаяТаблица, ИмяТаблицы);
	
КонецФункции

#КонецОбласти

#КонецЕсли
