#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	РазделыДанных = Новый Массив;
	РазделыДанных.Добавить("УправленческиеДанные");
	РазделыДанных.Добавить("ПодборПерсонала");
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли