#Область ПрограммныйИнтерфейс

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.ОтправлятьУведомления
//
Процедура ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадры.ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.ОтправлятьУведомленияСЭДО
//
Процедура ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте) Экспорт
	
	ЗарплатаКадры.ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.Получатель
//
Процедура ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадры.ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.АдресИнформационнойБазы
//
Процедура ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадры.ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.УстановитьОтправлятьУведомления
//
Процедура УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных) Экспорт
	
	ЗарплатаКадры.УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных);

КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочте.УстановитьПолучателя
//
Процедура УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	ЗарплатаКадры.УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище);
	
КонецПроцедуры

#КонецОбласти