
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ДанныеСтрокиТабличнойЧасти <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ДанныеСтрокиТабличнойЧасти);
	КонецЕсли;
	
	Элементы.ФормаУдалить.Видимость = Не Параметры.ЭтоНоваяЗапись;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ЗаполнитьЗначенияСвойств(Параметры.ДанныеСтрокиТабличнойЧасти, ЭтотОбъект);
	КонецЕсли;
	
	Закрыть(Параметры.ДанныеСтрокиТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьЗапись();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УдалитьЗапись()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЗаписьЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Запись будет удалена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаписьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть("УдалитьЗапись");
	
КонецПроцедуры

#КонецОбласти
