#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	ИсправленныйДокумент = ОбъектКопирования.Ссылка;
	ОтключитьПроверкиПроведения = Ложь;
	ХранилищеXML                = Неопределено;
	ДатаОтправки                = '00010101';
	ИдентификаторСообщения      = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание, ТекстЗаполнения, СтандартнаяОбработка)
	Если ОбъектЗафиксирован() Тогда
		Возврат;
	КонецЕсли;
	
	АвтозаполнениеПериодовОплаты = Истина;
	ЗаполнитьДату();
	ЗаполнитьТипСообщения();
	ЗаполнитьВерсиюСпецификации();
	
	СсылкаОснования = Основание;
	ПричинаНетрудоспособности = Неопределено;
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		Если Основание.Свойство("Действие")
			И Основание.Действие = "Исправить" И ЗарплатаКадры.РасширенныйРежим() Тогда
			МодульИсправлениеДокументовЗарплатаКадры = ОбщегоНазначения.ОбщийМодуль("ИсправлениеДокументовЗарплатаКадры");
			МодульИсправлениеДокументовЗарплатаКадры.СкопироватьДокумент(
				ЭтотОбъект,
				Основание.Ссылка,
				,
				,
				Основание);
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
			СсылкаОснования = ОбщегоНазначенияБЗК.ЗначениеСвойства(Основание, "Основание");
			Основание.Свойство("ПричинаНетрудоспособности", ПричинаНетрудоспособности);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаОснования) = Тип("СправочникСсылка.Сотрудники") Тогда
		Сотрудник = СсылкаОснования;
	ИначеЕсли ТипЗнч(СсылкаОснования) = Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия") Тогда
		ВходящийЗапрос = СсылкаОснования;
	ИначеЕсли Метаданные().Реквизиты.ПервичныйДокумент.Тип.СодержитТип(ТипЗнч(СсылкаОснования))
		И ЗначениеЗаполнено(СсылкаОснования) Тогда
		ПервичныйДокумент = СсылкаОснования;
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура("Ответственный");
	ЗарплатаКадры.ПолучитьЗначенияПоУмолчанию(ЗначенияДляЗаполнения);
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		КадровыеДанные = КадровыеДанныеСотрудника();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, КадровыеДанные);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ЗаполнитьПервичныеДанныеИзВходящегоЗапроса(Ложь);
		ПараметрыФиксации = Документы.ОтветНаЗапросФССДляРасчетаПособия.ПараметрыФиксацииВторичныхДанных();
		ДополнитьДаннымиВходящегоЗапроса(ПараметрыФиксации, Истина);
		ЗаполнитьДанныеОрганизации(ПараметрыФиксации);
		ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		ПараметрыФиксации = Документы.ОтветНаЗапросФССДляРасчетаПособия.ПараметрыФиксацииВторичныхДанных();
		ЗаполнитьДанныеИзПервичногоДокумента(ПараметрыФиксации, Ложь);
	КонецЕсли;
	ЗаполнитьДатуНачалаСобытия(Ложь);
	Если Не ЗначениеЗаполнено(ВидПособия) И ЗначениеЗаполнено(ПричинаНетрудоспособности) Тогда
		ВидПособия = Перечисления.ПособияНазначаемыеФСС.НайтиПоПричинеНетрудоспособности(ПричинаНетрудоспособности);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Если Не ЗначениеЗаполнено(ФизическоеЛицо) И ЗначениеЗаполнено(Сотрудник) Тогда
			ЗаполнитьКадровыеДанныеСотрудника(Ложь);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) И ЗначениеЗаполнено(Организация) Тогда
			ЗаполнитьДанныеОрганизации(Ложь);
		КонецЕсли;
		ЗаполнитьВходящийЗапросПоПервичнымДанным();
	КонецЕсли;
	
	ОбновитьВторичныеДанные();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Очистить();
	ПроверяемыеРеквизиты.Добавить("Дата");
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("НомерПроцесса");
	ПроверяемыеРеквизиты.Добавить("ВходящийЗапросИдентификатор");
	
	ПроверитьПервичныйДокумент(Отказ);
	Особенности = ОсобенностиВыгрузки();
	
	Если ОтказВНазначенииПособия Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ОтказВНазначенииПособияПричина");
		Если СтрДлина(ОтказВНазначенииПособияПричина) > 2000 Тогда
			Текст = НСтр("ru = 'Длина причины отказа не может превышать 2000 символов'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ОтказВНазначенииПособияПричина");
		КонецЕсли;
	Иначе
		ПроверяемыеРеквизиты.Добавить("ВидПособия");
		СведенияОВидеПособия = СЭДОФСС.СведенияОВидеПособия(ВидПособия);
		Если СведенияОВидеПособия.ЭтоОбычныйБольничный
			Или СведенияОВидеПособия.ЭтоНСПЗ Тогда
			ПроверитьСведенияОбЭЛН(Отказ);
			ПроверитьСведенияОСтрахователе(Отказ, Особенности);
			ПроверитьСведенияОЗастрахованномЛице(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьСпособВыплаты(Отказ, ПроверяемыеРеквизиты, Особенности);
			ПроверитьДанныеДляРасчета(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьПараметрыНазначения(Отказ, СведенияОВидеПособия, Особенности);
			ПроверитьДанныеНСПЗ(Отказ, СведенияОВидеПособия);
			ПроверитьИзвещение(Отказ);
		ИначеЕсли СведенияОВидеПособия.ЭтоБольничныйПоБиР Тогда
			ПроверитьСведенияОбЭЛН(Отказ);
			ПроверитьСведенияОСтрахователе(Отказ, Особенности);
			ПроверитьСведенияОЗастрахованномЛице(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьСпособВыплаты(Отказ, ПроверяемыеРеквизиты, Особенности);
			ПроверитьДанныеДляРасчета(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьПараметрыНазначения(Отказ, СведенияОВидеПособия, Особенности);
			ПроверитьСведенияОбОтпуске(Отказ);
			ПроверитьИзвещение(Отказ);
		ИначеЕсли СведенияОВидеПособия.ЭтоПособиеПриРождении Тогда
			ПроверитьСведенияОСтрахователе(Отказ, Особенности);
			ПроверитьСведенияОЗастрахованномЛице(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьСпособВыплаты(Отказ, ПроверяемыеРеквизиты, Особенности);
			ПроверитьДанныеДляРасчета(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьПараметрыНазначения(Отказ, СведенияОВидеПособия, Особенности);
			ПроверитьИнформациюОбУсыновленииОпеке(Отказ);
			ПроверитьИнформациюОПередачеНаВоспитание(Отказ);
			ПроверитьИнформациюОРебенкеПособияПриРождении(Отказ, Особенности);
			ПроверитьИнформациюОДругомРодителе(Отказ, Особенности);
			ПроверитьИзвещение(Отказ);
		ИначеЕсли СведенияОВидеПособия.ЭтоОтпускПоУходу Тогда
			ПроверитьСведенияОСтрахователе(Отказ, Особенности);
			ПроверитьСведенияОЗастрахованномЛице(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьСпособВыплаты(Отказ, ПроверяемыеРеквизиты, Особенности);
			ПроверитьДанныеДляРасчета(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности);
			ПроверитьПараметрыНазначения(Отказ, СведенияОВидеПособия, Особенности);
			ПроверитьИнформациюОбУсыновленииОпеке(Отказ);
			ПроверитьИнформациюОРебенкеОтпускаПоУходу(Отказ, Особенности);
			ПроверитьОснованияДляОтпускаПоУходу(Отказ);
			ПроверитьСправкуОНеполученииПособия(Отказ);
			ПроверитьИнформациюОРебенкеПособияПриРождении(Отказ, Особенности);
			ПроверитьИзвещение(Отказ);
			ПроверитьПрочиеСведенияОтпускаПоУходу(Отказ);
		КонецЕсли;
		Если Исправление Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИсправлениеКодПричины");
			Если ИсправлениеКодПричины = "6" Тогда
				ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "Примечание");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Перерасчет И Не Особенности.Версия_3 Тогда
		СЭДОФСС.ПроверитьИдентификаторРеестраПВСО(Отказ, ЭтотОбъект, "ПерерасчетИдентификаторСтрокиРеестра");
	КонецЕсли;
	Если Особенности.Версия_3 Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СоставительТелефон");
		Если ЗначениеЗаполнено(СоставительТелефон) И СтрДлина(СоставительТелефон) < 5 Тогда
			Текст = НСтр("ru = 'Для поля телефон установлена минимальная длина номера 5, проверьте корректность введенного номера телефона.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "СоставительТелефон");
		КонецЕсли;
		ПроверкиБЗК.ПроверитьЗаполнениеЭлектроннойПочтыОбъекта(Отказ, ЭтотОбъект, "СоставительЭлектроннаяПочта");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СоставительФамилия");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СоставительИмя");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение недостающих полей.
	ЗаполнитьДату();
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
	
	// Заполнение текста XML.
	ЭтоПроведение = (РежимЗаписи = РежимЗаписиДокумента.Проведение
		Или (Проведен И РежимЗаписи = РежимЗаписиДокумента.Запись));
	Если ЭтоПроведение Тогда
		ТекстXML = Документы.ОтветНаЗапросФССДляРасчетаПособия.ТекстXML(ЭтотОбъект);
	Иначе
		ТекстXML = "";
	КонецЕсли;
	ХранилищеXML = Новый ХранилищеЗначения(ТекстXML, Новый СжатиеДанных(9));
	
	// Чтение реквизитов "До записи" для проверки и подготовки сведений к процедуре ПриЗаписи.
	ЗначенияРеквизитовДоЗаписи = ЗначенияРеквизитовДоЗаписи();
	ДополнительныеСвойства.Вставить("ЗначенияРеквизитовДоЗаписи", ЗначенияРеквизитовДоЗаписи);
	
	// Проверка отсутствия критичных изменений в отправленном документе.
	Если ЗначениеЗаполнено(ИдентификаторСообщения)
		И ЗначениеЗаполнено(ЗначенияРеквизитовДоЗаписи.ФизическоеЛицо)
		И ЗначенияРеквизитовДоЗаписи.ФизическоеЛицо <> ФизическоеЛицо Тогда
		ВызватьИсключение НСтр("ru = 'Недопустимо изменять физическое лицо в отправленном документе.'");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	НаборРегистраций = РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий.ЗаполнитьПоДокументу(ЭтотОбъект);
	Документы.ВходящийЗапросФССДляРасчетаПособия.ПриЗаписиОтветаНаЗапрос(ЭтотОбъект);
	Документы.УведомлениеОбОтсутствииОтветаСЭДО.ПриЗаписиОтветаНаЗапрос(ЭтотОбъект, НаборРегистраций);
	РегистрыСведений.СведенияОбЭЛН.ПриЗаписиОтветаНаЗапрос(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОсобенностиВыгрузки(СброситьКэш = Ложь) Экспорт
	Перем Результат;
	Если Не СброситьКэш И ДополнительныеСвойства.Свойство("Особенности", Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	Результат = Документы.ОтветНаЗапросФССДляРасчетаПособия.ОсобенностиВыгрузки(ЭтотОбъект);
	ДополнительныеСвойства.Вставить("Особенности", Результат);
	Возврат Результат;
КонецФункции

#Область ПередЗаписью

Функция ЗначенияРеквизитовДоЗаписи() Экспорт
	ИменаРеквизитов = "Дата, НомерЛН, ГоловнаяОрганизация, ФизическоеЛицо, ПометкаУдаления, ВходящийЗапрос,
	|НомерПроцесса, Проведен, ДатаОтправки";
	ЭтоНовый = ЭтоНовый();
	Если ЭтоНовый Тогда
		Значения = ОбщегоНазначенияБЗК.ЗначенияСвойств(ЭтотОбъект, ИменаРеквизитов);
	Иначе
		Значения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ИменаРеквизитов);
	КонецЕсли;
	Значения.Вставить("ЭтоНовый", ЭтоНовый);
	Возврат Значения;
КонецФункции

#КонецОбласти

#Область ФиксацияВторичныхДанныхВДокументах

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Модифицирован = Ложь;
	
	Если ОбъектЗафиксирован() Тогда
		Возврат Модифицирован;
	КонецЕсли;
	
	Если ПараметрыФиксации = Неопределено Тогда
		ПараметрыФиксации = Документы.ОтветНаЗапросФССДляРасчетаПособия.ПараметрыФиксацииВторичныхДанных(ЭтотОбъект);
	КонецЕсли;
	
	ОрганизацияДо = Организация;
	
	ЗаполнитьДату();
	
	Если ЗаполнитьТипСообщения() Тогда
		Модифицирован = Истина;
		ПриИзмененииТипаСообщения();
	КонецЕсли;
	
	Если ЗаполнитьВерсиюСпецификации() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Особенности = ОсобенностиВыгрузки(Модифицирован);
	
	Если ЗаполнитьПервичныеДанныеИзВходящегоЗапроса(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПервичныйДокумент(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДатуНачалаСобытия(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПриоритеты(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьРасчетныеГодыИЗаработок(ПараметрыФиксации, Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеИзПервичногоДокумента(ПараметрыФиксации, Истина) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьДанныеОрганизации(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(Составитель) Или ОрганизацияДо <> Организация)
		И Особенности.Версия_2_34 И СЭДОФСС.ЗаполнитьПодписантов(ЭтотОбъект, ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если Особенности.Версия_2_34 И ЗаполнитьКадровыеДанныеСоставителя(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьИсключаемыеПериодыПримечание(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьРеквизитыДоговора(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКодСтраныГражданства(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьРазрешениеНаПроживание(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьСпособВыплатыПособия(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКонтактыФизическогоЛица(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКодыАдреса(ПараметрыФиксации, "АдресРегистрации", Ложь) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКодыАдреса(ПараметрыФиксации, "АдресПроживания", Истина) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКадровыеДанныеРебенка(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ДополнитьДаннымиВходящегоЗапроса(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПериодОплатыСФР(ПараметрыФиксации, Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПриостановлениеТД(ПараметрыФиксации, Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКатегориюСотрудника(Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьВидСтрахованияСотрудника(Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьСтатусНалогоплательщика(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьКодСтатусаНалогоплательщика(ПараметрыФиксации, Особенности) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПредставления(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция ОбъектЗафиксирован() Экспорт
	Возврат Документы.ОтветНаЗапросФССДляРасчетаПособия.ОбъектЗафиксирован(ЭтотОбъект);
КонецФункции

Функция ЗаполнитьПервичныеДанныеИзВходящегоЗапроса(ПараметрыФиксации) Экспорт
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыЗапроса = ДанныеВходящегоЗапроса();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ВходящийЗапросИдентификатор", РеквизитыЗапроса.ИдентификаторСообщения);
	Реквизиты.Вставить("НомерПроцесса",               РеквизитыЗапроса.НомерПроцесса);
	Реквизиты.Вставить("Организация",                 РеквизитыЗапроса.Организация);
	Реквизиты.Вставить("ИзвещениеФССНомер",           РеквизитыЗапроса.ИзвещениеФССНомер);
	Реквизиты.Вставить("ИзвещениеФССДата",            РеквизитыЗапроса.ИзвещениеФССДата);
	Реквизиты.Вставить("ВидПособия",                  РеквизитыЗапроса.ВидПособия);
	Реквизиты.Вставить("НомерЛН",                     РеквизитыЗапроса.НомерЛН);
	
	Если ЗначениеЗаполнено(РеквизитыЗапроса.Сотрудник) Тогда
		Реквизиты.Вставить("Сотрудник", РеквизитыЗапроса.Сотрудник);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыЗапроса.ФизическоеЛицо) И Не ЗначениеЗаполнено(Сотрудник) Тогда
		Реквизиты.Вставить("ФизическоеЛицо", РеквизитыЗапроса.ФизическоеЛицо);
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыЗапроса.Ребенок) Тогда
		Реквизиты.Вставить("Ребенок", РеквизитыЗапроса.Ребенок);
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьПервичныйДокумент(ПараметрыФиксации)
	ЕстьИзменения = СЭДОФСС.ЗаполнитьПервичныйДокументДляРасчетаПособияФСС(ЭтотОбъект, ПараметрыФиксации);
	Если ЕстьИзменения Тогда
		ДополнительныеСвойства.Удалить("РеквизитыПервичногоДокумента");
		ДополнительныеСвойства.Удалить("ДанныеЗаполняемыеИзПервичногоДокумента");
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьДанныеИзПервичногоДокумента(ПараметрыФиксации, УчитыватьФиксацию)
	Реквизиты = ДанныеЗаполняемыеИзПервичногоДокумента();
	Если Реквизиты = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Реквизиты = КоллекцииБЗК.СкопироватьСтруктуру(Реквизиты);
	
	ЕстьИзменения = Ложь;
	
	Если АвтозаполнениеПериодовОплаты И Реквизиты.Свойство("ИсключаемыеПериоды") Тогда
		ИсключаемыеПериодыДоИзменения = ИсключаемыеПериоды.Выгрузить();
		ИсключаемыеПериоды.Загрузить(Реквизиты.ИсключаемыеПериоды);
		ИсключаемыеПериоды.Сортировать("ДатаНачала, ДатаОкончания");
		// Определение наличия изменений в исключаемых периодах.
		Если Не ОбщегоНазначенияБЗК.ЗначенияСовпадают(ИсключаемыеПериодыДоИзменения, ИсключаемыеПериоды.Выгрузить()) Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	Реквизиты.Удалить("ИсключаемыеПериоды");
	
	Если АвтозаполнениеПериодовОплаты И Реквизиты.Свойство("ПериодыПростоя") Тогда
		ПериодыПростояДоИзменения = ПериодыПростоя.Выгрузить();
		ПериодыПростоя.Загрузить(Реквизиты.ПериодыПростоя);
		ПериодыПростоя.Сортировать("ДатаНачала, ДатаОкончания");
		Если Не ОбщегоНазначенияБЗК.ЗначенияСовпадают(ПериодыПростояДоИзменения, ПериодыПростоя.Выгрузить()) Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	Реквизиты.Удалить("ПериодыПростоя");
	
	Если АвтозаполнениеПериодовОплаты И Реквизиты.Свойство("ПриостановленияТрудовыхДоговоров") Тогда
		ДоИзменения = ПриостановленияТрудовыхДоговоров.Выгрузить();
		ПриостановленияТрудовыхДоговоров.Загрузить(Реквизиты.ПриостановленияТрудовыхДоговоров);
		ПриостановленияТрудовыхДоговоров.Сортировать("ДатаНачала, ДатаОкончания");
		Если Не ОбщегоНазначенияБЗК.ЗначенияСовпадают(ДоИзменения, ПриостановленияТрудовыхДоговоров.Выгрузить()) Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	Реквизиты.Удалить("ПриостановленияТрудовыхДоговоров");
	
	Если УчитыватьФиксацию Тогда
		Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "Ребенок")
			Или (Реквизиты.Свойство("Ребенок") И ЗначениеЗаполнено(Реквизиты.Ребенок)) Тогда
			КоллекцииБЗК.УдалитьКлючиСтруктуры(Реквизиты, ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации));
		КонецЕсли;
		Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации) Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	Иначе
		Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапкиБезУчетаФиксации(ЭтотОбъект, Реквизиты) Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Функция СведенияОбЭЛН() Экспорт
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Или Не ЗначениеЗаполнено(НомерЛН) Тогда
		Возврат Неопределено;
	КонецЕсли;
	СведенияОбЭЛН = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "СведенияОбЭЛН");
	Если СведенияОбЭЛН <> Неопределено
		И СведенияОбЭЛН.ГоловнаяОрганизация = ГоловнаяОрганизация
		И СведенияОбЭЛН.НомерЛисткаНетрудоспособности = НомерЛН Тогда
		Возврат СведенияОбЭЛН;
	КонецЕсли;
	СведенияОбЭЛН = РегистрыСведений.СведенияОбЭЛН.СведенияОбЭЛН(НомерЛН, ГоловнаяОрганизация);
	ДополнительныеСвойства.Вставить("СведенияОбЭЛН", СведенияОбЭЛН);
	Возврат СведенияОбЭЛН;
КонецФункции

Функция РеквизитыПервичногоДокумента()
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Реквизиты = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "РеквизитыПервичногоДокумента");
	Если Реквизиты <> Неопределено Тогда
		Возврат Реквизиты;
	КонецЕсли;
	Реквизиты = Новый Структура;
	
	ДанныеДляРасчетаСреднегоЗаработка = Неопределено;
	
	// Получение данных документа.
	МенеджерОснования = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПервичныйДокумент);
	МенеджерОснования.ЗаполнитьОтветНаЗапросФССДляРасчетаПособия(ПервичныйДокумент, ЭтотОбъект, Реквизиты, ДанныеДляРасчетаСреднегоЗаработка);
	
	// Получение данных среднего заработка.
	Если ДанныеДляРасчетаСреднегоЗаработка <> Неопределено Тогда
		ДополнитьРеквизитыПервичногоДокументаРеквизитамиСреднего(Реквизиты, ДанныеДляРасчетаСреднегоЗаработка);
	КонецЕсли;
	
	// Удаление неподходящих данных.
	Если Реквизиты.Свойство("ДоляВремени")
		И Не (ТипЗнч(Реквизиты.ДоляВремени) = Тип("Число")
			И Реквизиты.ДоляВремени > 0
			И Реквизиты.ДоляВремени <= 1) Тогда
		Реквизиты.Удалить("ДоляВремени");
	КонецЕсли;
	Если Реквизиты.Свойство("РайонныйКоэффициент")
		И Не (ТипЗнч(Реквизиты.РайонныйКоэффициент) = Тип("Число")
			И Реквизиты.РайонныйКоэффициент >= 1) Тогда
		Реквизиты.Удалить("РайонныйКоэффициент");
	КонецЕсли;
	Если Реквизиты.Свойство("ПричинаПредоставленияЛьготы")
		И Не (ТипЗнч(Реквизиты.ПричинаПредоставленияЛьготы) = Тип("ПеречислениеСсылка.ОснованияФинансированияПособияФедеральнымБюджетом")
			И ЗначениеЗаполнено(Реквизиты.ПричинаПредоставленияЛьготы)) Тогда
		Реквизиты.Удалить("ПричинаПредоставленияЛьготы");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РеквизитыПервичногоДокумента", Реквизиты);
	Возврат Реквизиты;
КонецФункции

Функция ДанныеЗаполняемыеИзПервичногоДокумента()
	Реквизиты = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "ДанныеЗаполняемыеИзПервичногоДокумента");
	Если Реквизиты <> Неопределено Тогда
		Возврат Реквизиты;
	КонецЕсли;
	РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента();
	Если РеквизитыПервичногоДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Реквизиты = КоллекцииБЗК.СкопироватьСтруктуру(РеквизитыПервичногоДокумента);
	Реквизиты.Удалить("НачалоВПериодПриостановленияТД");
	
	Особенности = ОсобенностиВыгрузки();
	Если Особенности.Версия_3 Тогда
		Реквизиты.Удалить("ПервыйРасчетныйГодВидЗаработка");
		Реквизиты.Удалить("ВторойРасчетныйГодВидЗаработка");
		Реквизиты.Удалить("ПервыйРасчетныйГод");
		Реквизиты.Удалить("ВторойРасчетныйГод");
		Реквизиты.Удалить("ПервыйРасчетныйГодЗаработок");
		Реквизиты.Удалить("ВторойРасчетныйГодЗаработок");
		Реквизиты.Удалить("ЗаменаЛетРасчетногоПериода");
	КонецЕсли;
	
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	Если ДанныеВходящегоЗапроса <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.Сотрудник) Тогда
			Реквизиты.Удалить("Сотрудник");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ФизическоеЛицо) Тогда
			Реквизиты.Удалить("ФизическоеЛицо");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ВидПособия) Тогда
			Реквизиты.Удалить("ВидПособия");
		КонецЕсли;
		ИзмененРасчетныйПериод = СтраховательИзменилРасчетныйПериод(ДанныеВходящегоЗапроса, РеквизитыПервичногоДокумента);
		
		// При изменении расчетного периода страхователь должен отправить исходный вид заработка и новые годы.
		// В ответ Фонд пришлет новый входящий запрос с новыми годами и новым видом заработка.
		Если ПриоритетУДанныхВходящегоЗапроса Или ИзмененРасчетныйПериод Или Особенности.Версия_2_41 Тогда
			Реквизиты.Удалить("ПервыйРасчетныйГодВидЗаработка");
			Реквизиты.Удалить("ВторойРасчетныйГодВидЗаработка");
		КонецЕсли;
		Если ПриоритетУДанныхВходящегоЗапроса
			И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ПервыйРасчетныйГод)
			И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ВторойРасчетныйГод) Тогда
			Реквизиты.Удалить("ПервыйРасчетныйГод");
			Реквизиты.Удалить("ВторойРасчетныйГод");
			Реквизиты.Удалить("ПервыйРасчетныйГодЗаработок");
			Реквизиты.Удалить("ВторойРасчетныйГодЗаработок");
			Реквизиты.Удалить("ЗаменаЛетРасчетногоПериода");
		КонецЕсли;
		Если ПриоритетУДанныхВходящегоЗапроса
			И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.КалендарныхДнейРасчетногоПериода) Тогда
			Реквизиты.Удалить("КалендарныхДнейРасчетногоПериода");
		КонецЕсли;
		Если ИспользоватьСтажИзВходящегоЗапроса(ДанныеВходящегоЗапроса) Тогда
			Реквизиты.Удалить("СтраховойСтажЛет");
			Реквизиты.Удалить("СтраховойСтажМесяцев");
			Реквизиты.Удалить("НестраховойСтажЛет");
			Реквизиты.Удалить("НестраховойСтажМесяцев");
		КонецЕсли;
		Если ИспользоватьУходЗаНесколькимиДетьмиИзВходящегоЗапроса(ДанныеВходящегоЗапроса) Тогда
			Реквизиты.Удалить("УходЗаНесколькимиДетьми");
			Реквизиты.Удалить("СреднемесячныйЗаработок");
		КонецЕсли;
		// Дату начала оплаты можно редактировать и она передается из больничного только в том случае,
		// если не совпадает со стадартной датой начала оплаты.
		Если ИспользоватьПериодОплатыСФРИзВходящегоЗапроса(ДанныеВходящегоЗапроса) Тогда
			Реквизиты.Удалить("ОплатаФССДатаОкончания");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Реквизиты.Удалить("ФизическоеЛицо");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ДанныеЗаполняемыеИзПервичногоДокумента", Реквизиты);
	Возврат Реквизиты;
КонецФункции

Процедура ДополнитьРеквизитыПервичногоДокументаРеквизитамиСреднего(Реквизиты, ДанныеДляРасчетаСреднегоЗаработка)
	
	ПараметрыРасчета      = ДанныеДляРасчетаСреднегоЗаработка.ПараметрыРасчета;
	ДанныеРасчетаСреднего = ДанныеДляРасчетаСреднегоЗаработка.ДанныеРасчетаСреднего;
	
	Реквизиты.Вставить("ДатаНачалаРасчетногоПериода",    ПараметрыРасчета.ПериодРасчетаСреднегоЗаработкаНачало);
	Реквизиты.Вставить("ДатаОкончанияРасчетногоПериода", ПараметрыРасчета.ПериодРасчетаСреднегоЗаработкаОкончание);
	Реквизиты.Вставить("ПервыйРасчетныйГод",             ПараметрыРасчета.РасчетныеГоды[0]);
	Реквизиты.Вставить("ВторойРасчетныйГод",             ПараметрыРасчета.РасчетныеГоды[1]);
	Реквизиты.Вставить("ЗаменаЛетРасчетногоПериода",     Ложь);
	Реквизиты.Вставить("ПервыйРасчетныйГодЗаработок",    0);
	Реквизиты.Вставить("ВторойРасчетныйГодЗаработок",    0);
	Реквизиты.Вставить("ДоляВремени", УчетПособийСоциальногоСтрахованияКлиентСервер.ДоляНеполногоВремени(ПараметрыРасчета));
	
	Если Реквизиты.ВидПособия = Перечисления.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком Тогда
		// Фонд может передать как "ВсеСтрахователи" так и "ВсеСтрахователиЗаТекущийПериодРаботы".
		// На расчет это не влияет, но если изменить, то вернется ошибка.
		// Поэтому для пособий по уходу вид заработка заполняется из входящего запроса.
	ИначеЕсли ЗарплатаКадры.БазовыйРежим() Тогда
		// В базовой реализации нет учета заработка других страхователей.
	Иначе
		Если ПараметрыРасчета.УчитыватьЗаработокПредыдущихСтрахователей Тогда
			ВидЗаработка = Перечисления.СпособыУчетаГодовогоЗаработкаСФР.ВсеСтрахователи;
		Иначе
			ВидЗаработка = Перечисления.СпособыУчетаГодовогоЗаработкаСФР.ТекущийСтрахователь;
		КонецЕсли;
		Реквизиты.Вставить("ПервыйРасчетныйГодВидЗаработка", ВидЗаработка);
		Реквизиты.Вставить("ВторойРасчетныйГодВидЗаработка", ВидЗаработка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыРасчета.ДатаНачалаСобытия) Тогда
		Реквизиты.Вставить("ДатаНачалаСобытия", ПараметрыРасчета.ДатаНачалаСобытия);
	КонецЕсли;
	
	Реквизиты.ЗаменаЛетРасчетногоПериода = СЭДОФСС.РасчетныеГодыИзменены(
		Реквизиты.ДатаНачалаСобытия,
		Реквизиты.ПервыйРасчетныйГод,
		Реквизиты.ВторойРасчетныйГод);
	
	Если Реквизиты.Свойство("УходЗаНесколькимиДетьми") Тогда
		Реквизиты.Вставить("СреднемесячныйЗаработок", 0);
		Если Реквизиты.УходЗаНесколькимиДетьми И Реквизиты.Свойство("СреднийДневнойЗаработок") Тогда
			СреднееКоличествоДнейВМесяце = УчетПособийСоциальногоСтрахованияКлиентСервер.СреднееКоличествоДнейВМесяцеФСС();
			Реквизиты.СреднемесячныйЗаработок = Реквизиты.СреднийДневнойЗаработок * Окр(СреднееКоличествоДнейВМесяце, 1);
		КонецЕсли;
		Реквизиты.Удалить("СреднийДневнойЗаработок");
	КонецЕсли;
	
	// Фонд сам учитыват дни приостановлеения ТД.
	ПараметрыРасчета.УчитыватьДниПриостановленияТД = Ложь;
	УчитываемыхДнейВКалендарныхГодах = УчетПособийСоциальногоСтрахованияКлиентСервер.УчитываемыхДнейВКалендарныхГодахФСС(
		ПараметрыРасчета,
		ДанныеРасчетаСреднего);
	Реквизиты.Вставить("КалендарныхДнейРасчетногоПериода", УчитываемыхДнейВКалендарныхГодах);
	
	СтрокаПоГоду = УчетПособийСоциальногоСтрахованияКлиентСервер.ЭлементКоллекцииПоОтбору(
		ДанныеРасчетаСреднего,
		Новый Структура("РасчетныйГод", Реквизиты.ПервыйРасчетныйГод));
	Если СтрокаПоГоду <> Неопределено Тогда
		Реквизиты.ПервыйРасчетныйГодЗаработок = УчетПособийСоциальногоСтрахованияКлиентСервер.УчитываемыйЗаработокФССПоГоду(
			ПараметрыРасчета,
			СтрокаПоГоду);
	КонецЕсли;
	
	СтрокаПоГоду = УчетПособийСоциальногоСтрахованияКлиентСервер.ЭлементКоллекцииПоОтбору(
		ДанныеРасчетаСреднего,
		Новый Структура("РасчетныйГод", Реквизиты.ВторойРасчетныйГод));
	Если СтрокаПоГоду <> Неопределено Тогда
		Реквизиты.ВторойРасчетныйГодЗаработок = УчетПособийСоциальногоСтрахованияКлиентСервер.УчитываемыйЗаработокФССПоГоду(
			ПараметрыРасчета,
			СтрокаПоГоду);
	КонецЕсли;
	
КонецПроцедуры

Функция СтраховательИзменилРасчетныйПериод(ДанныеВходящегоЗапроса, РеквизитыПервичногоДокумента) Экспорт
	Если ЕстьРасчетныеГоды(РеквизитыПервичногоДокумента) Тогда
		Возврат ДанныеВходящегоЗапроса.ПервыйРасчетныйГод <> РеквизитыПервичногоДокумента.ПервыйРасчетныйГод
			Или ДанныеВходящегоЗапроса.ВторойРасчетныйГод <> РеквизитыПервичногоДокумента.ВторойРасчетныйГод;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ИспользоватьСтажИзВходящегоЗапроса(ДанныеВходящегоЗапроса)
	Возврат ПриоритетУДанныхВходящегоЗапроса
		И (ЗначениеЗаполнено(ДанныеВходящегоЗапроса.СтраховойСтажЛет)
			Или ЗначениеЗаполнено(ДанныеВходящегоЗапроса.СтраховойСтажМесяцев)
			Или ЗначениеЗаполнено(ДанныеВходящегоЗапроса.НестраховойСтажЛет)
			Или ЗначениеЗаполнено(ДанныеВходящегоЗапроса.НестраховойСтажМесяцев));
КонецФункции

Функция ИспользоватьУходЗаНесколькимиДетьмиИзВходящегоЗапроса(ДанныеВходящегоЗапроса)
	Возврат ПриоритетУДанныхВходящегоЗапроса
		И (ДанныеВходящегоЗапроса.УходЗаНесколькимиДетьми
			И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.СреднемесячныйЗаработок));
КонецФункции

Функция ИспользоватьПериодОплатыСФРИзВходящегоЗапроса(ДанныеВходящегоЗапроса)
	Возврат ПриоритетУДанныхВходящегоЗапроса
		И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ОплатаФССДатаНачала)
		И ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ОплатаФССДатаОкончания);
КонецФункции

Функция ЗаполнитьДатуНачалаСобытия(ПараметрыФиксации)
	Реквизиты = Новый Структура("ДатаНачалаСобытия", ДатаНачалаСобытия());
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ДатаНачалаСобытия()
	Если ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		НайденнаяДата = ОбщегоНазначенияБЗК.ЗначениеСвойства(РеквизитыПервичногоДокумента(), "ДатаНачалаСобытия");
		Если ЗначениеЗаполнено(НайденнаяДата) Тогда
			Возврат НайденнаяДата;
		КонецЕсли;
	КонецЕсли;
	СведенияОбЭЛН = СведенияОбЭЛН();
	Если СведенияОбЭЛН <> Неопределено И ЗначениеЗаполнено(СведенияОбЭЛН.ДатаНачалаСобытия) Тогда
		Возврат СведенияОбЭЛН.ДатаНачалаСобытия;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
		Если ДанныеВходящегоЗапроса <> Неопределено Тогда
			Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ОтпускПоУходуДатаНачала) Тогда
				Возврат ДанныеВходящегоЗапроса.ОтпускПоУходуДатаНачала;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ОтпускПоУходуДата) Тогда
				Возврат ДанныеВходящегоЗапроса.ОтпускПоУходуДата;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ОплатаФССДатаНачала) Тогда
				Возврат ДанныеВходящегоЗапроса.ОплатаФССДатаНачала;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВходящегоЗапроса.РебенокДатаРождения) Тогда
				Возврат ДанныеВходящегоЗапроса.РебенокДатаРождения;
			ИначеЕсли ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ДатаСообщения) Тогда
				Возврат ДанныеВходящегоЗапроса.ДатаСообщения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтпускПоУходуДатаНачала) Тогда
		Возврат ОтпускПоУходуДатаНачала;
	ИначеЕсли ЗначениеЗаполнено(ОтпускПоУходуДата) Тогда
		Возврат ОтпускПоУходуДата;
	КонецЕсли;
	Возврат НачалоДня(Дата);
КонецФункции

Функция ЗаполнитьПриоритеты(ПараметрыФиксации)
	Реквизиты = Новый Структура("ПриоритетУДанныхВходящегоЗапроса");
	
	// Если есть только одна ссылка из двух - то приоритет у тех данных, по которым есть ссылка.
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитаШапки(ЭтотОбъект, "ПриоритетУДанныхВходящегоЗапроса");
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитаШапки(ЭтотОбъект, "ПриоритетУДанныхВходящегоЗапроса");
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Истина;
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	
	ДатаВходящегоЗапроса = ДанныеВходящегоЗапроса.ДатаСообщения;
	
	Если ЗначениеЗаполнено(ДатаНачалаСобытия) Тогда
		ДатаСобытия = ДатаНачалаСобытия;
	ИначеЕсли ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ДатаСобытия = ДатаВходящегоЗапроса;
	ИначеЕсли ЗначениеЗаполнено(Дата) Тогда
		ДатаСобытия = Дата;
	Иначе
		ДатаСобытия = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Дата когда законодательно появилась возможность запрашивать данные СФР для расчета пособий.
	ДатаНачалаИспользованияДанныхСФР = '20230101';
	// Ориентировочная дата когда во входящем запросе появился достаточный объем сведений для расчета пособий.
	ДатаНачалаИспользованияДанныхСФРДляРасчетаПособий = '20230601';
	
	Если ДатаСобытия < ДатаНачалаИспользованияДанныхСФР
		Или ДатаВходящегоЗапроса < ДатаНачалаИспользованияДанныхСФРДляРасчетаПособий Тогда
		// До 2023 года приоритет был у первичного документа.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ПервыйРасчетныйГодЗаработок)
		И Не ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ВторойРасчетныйГодЗаработок) Тогда
		// Во входящем запросе недостаточно данных.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	ИначеЕсли СтраховательИзменилРасчетныйПериод(ДанныеВходящегоЗапроса, РеквизитыПервичногоДокумента()) Тогда
		// Расчетный период должен совпадать у Фонда и страхователя.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Ложь;
	Иначе
		// Можно использовать данные входящего запроса.
		Реквизиты.ПриоритетУДанныхВходящегоЗапроса = Истина;
	КонецЕсли;
	
	ЕстьИзменения = ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	Если ЕстьИзменения Тогда
		ДополнительныеСвойства.Удалить("ДанныеЗаполняемыеИзПервичногоДокумента");
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьДанныеОрганизации(ПараметрыФиксации)
	// Головная организация заполняется безусловно, т.к. определяет права.
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Организация);
	
	Реквизиты = Новый Структура("Страхователь, РегистрационныйНомерСФР, НомерСтрахователяФСС, КодПодчиненностиФСС");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ИменаПолей = "РегНомерСФР, НомерСтрахователяФСС, КодПодчиненностиФСС";
		Сведения = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей, Дата);
		Реквизиты.Страхователь            = Сведения.Страхователь;
		Реквизиты.РегистрационныйНомерСФР = Сведения.РегНомерСФР;
		Реквизиты.НомерСтрахователяФСС    = Сведения.НомерСтрахователяФСС;
		Реквизиты.КодПодчиненностиФСС     = Сведения.КодПодчиненностиФСС;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКадровыеДанныеСоставителя(ПараметрыФиксации)
	Реквизиты = Новый Структура("СоставительФИО, СоставительТелефон, СоставительЭлектроннаяПочта,
		|СоставительФамилия, СоставительИмя, СоставительОтчество");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Составитель) Тогда
		ИменаПолей = "ФИО, Фамилия, Имя, Отчество, ТелефонРабочийПредставление, EMailПредставление";
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическогоЛица(Ложь, Составитель, ИменаПолей, ТекущаяДатаСеанса());
		Если КадровыеДанные <> Неопределено Тогда
			Реквизиты.СоставительФИО = КадровыеДанные.ФИО;
			Реквизиты.СоставительФамилия = КадровыеДанные.Фамилия;
			Реквизиты.СоставительИмя = КадровыеДанные.Имя;
			Реквизиты.СоставительОтчество = КадровыеДанные.Отчество;
			Реквизиты.СоставительТелефон = КадровыеДанные.ТелефонРабочийПредставление;
			Реквизиты.СоставительЭлектроннаяПочта = КадровыеДанные.EMailПредставление;
		КонецЕсли;
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(Реквизиты.СоставительТелефон)
			Или Не ЗначениеЗаполнено(Реквизиты.СоставительЭлектроннаяПочта))
		И ЗначениеЗаполнено(Организация) Тогда
		ИменаПолей = "ТелОрганизации, АдресЭлектроннойПочтыОрганизации";
		СведенияОбОрганизации = СЭДОФСС.СведенияОСтрахователе(Организация, ИменаПолей, ТекущаяДатаСеанса());
		Если Не ЗначениеЗаполнено(Реквизиты.СоставительТелефон) Тогда
			Реквизиты.СоставительТелефон = СведенияОбОрганизации.ТелОрганизации;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Реквизиты.СоставительЭлектроннаяПочта) Тогда
			Реквизиты.СоставительЭлектроннаяПочта = СведенияОбОрганизации.АдресЭлектроннойПочтыОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКадровыеДанныеСотрудника(ПараметрыФиксации)
	Реквизиты = Новый Структура(
	"СотрудникФамилия,
	|СотрудникИмя,
	|СотрудникОтчество,
	|СотрудникДатаРождения,
	|СотрудникГражданство,
	|СотрудникПол,
	|СотрудникСНИЛС,
	|СотрудникИНН,
	|ДоляВремени,
	|РайонныйКоэффициент,
	|УдостоверениеЛичностиВид,
	|УдостоверениеЛичностиСерия,
	|УдостоверениеЛичностиНомер,
	|УдостоверениеЛичностиДатаВыдачи,
	|УдостоверениеЛичностиКемВыдан,
	|УдостоверениеЛичностиСрокДействия,
	|ВнешнееСовместительство,
	|ПричинаПредоставленияЛьготы,
	|ОтношениеКОсобойЗоне,
	|ВидОсобойЗоны");
	ФизическоеЛицо = Неопределено; // Заполняется безусловно, т.к. определяет права.
	
	КадровыеДанные = КадровыеДанныеСотрудника();
	Если КадровыеДанные <> Неопределено Тогда
		ФизическоеЛицо = КадровыеДанные.ФизическоеЛицо; // Заполняется безусловно, т.к. определяет права.
		
		// ФИО, ИНН, СНИЛС, Дата рождения, Гражданство.
		Реквизиты.СотрудникФамилия      = КадровыеДанные.Фамилия;
		Реквизиты.СотрудникИмя          = КадровыеДанные.Имя;
		Реквизиты.СотрудникОтчество     = КадровыеДанные.Отчество;
		Реквизиты.СотрудникГражданство  = КадровыеДанные.Страна;
		Реквизиты.СотрудникДатаРождения = КадровыеДанные.ДатаРождения;
		Реквизиты.СотрудникПол          = КадровыеДанные.Пол;
		Реквизиты.СотрудникСНИЛС        = КадровыеДанные.СтраховойНомерПФР;
		Реквизиты.СотрудникИНН          = КадровыеДанные.ИНН;
		
		// Удостоверение личности.
		Реквизиты.УдостоверениеЛичностиВид          = КадровыеДанные.ДокументВид;
		Реквизиты.УдостоверениеЛичностиСерия        = СокрЛП(КадровыеДанные.ДокументСерия);
		Реквизиты.УдостоверениеЛичностиНомер        = СокрЛП(КадровыеДанные.ДокументНомер);
		Реквизиты.УдостоверениеЛичностиДатаВыдачи   = КадровыеДанные.ДокументДатаВыдачи;
		Реквизиты.УдостоверениеЛичностиКемВыдан     = КадровыеДанные.ДокументКемВыдан;
		Реквизиты.УдостоверениеЛичностиСрокДействия = КадровыеДанные.ДокументСрокДействия;
		
		// Место работы.
		Реквизиты.ВнешнееСовместительство = ЭтоВнешнееСовместительство(КадровыеДанные.ВидЗанятости);
		
		Если КадровыеДанные.Свойство("ДоляНеполногоРабочегоВремени") Тогда
			Реквизиты.ДоляВремени = УчетПособийСоциальногоСтрахования.ДоляНеполногоРабочегоВремени(
				КадровыеДанные.ДоляНеполногоРабочегоВремени);
		КонецЕсли;
		Если ЗначениеЗаполнено(КадровыеДанные.РайонныйКоэффициентРФ) Тогда
			Реквизиты.РайонныйКоэффициент = КадровыеДанные.РайонныйКоэффициентРФ;
		КонецЕсли;
		
		// Льготы.
		Если Реквизиты.Свойство("ПричинаПредоставленияЛьготы") Тогда
			Реквизиты.ПричинаПредоставленияЛьготы = КадровыеДанные.ЛьготаПриНачисленииПособий;
		КонецЕсли;
		Если Реквизиты.Свойство("ОтношениеКОсобойЗоне") Тогда
			Реквизиты.ОтношениеКОсобойЗоне = КадровыеДанные.ОтношениеКОсобойЗоне;
		КонецЕсли;
		Если Реквизиты.Свойство("ВидОсобойЗоны") Тогда
			Реквизиты.ВидОсобойЗоны = КадровыеДанные.ВидОсобойЗоны;
		КонецЕсли;
	КонецЕсли;
	
	Если Реквизиты.РайонныйКоэффициент = Неопределено И ЗначениеЗаполнено(Организация) Тогда
		Реквизиты.РайонныйКоэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "РайонныйКоэффициентРФ");
	КонецЕсли;
	
	Если Реквизиты.ДоляВремени = Неопределено Тогда
		Реквизиты.ДоляВремени = 1;
	Конецесли;
	
	// Удаление полей кадровых данных которые могут заполниться из учетного документа.
	РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента();
	Если РеквизитыПервичногоДокумента <> Неопределено Тогда
		Для Каждого КлючИЗначение Из Реквизиты Цикл
			Если РеквизитыПервичногоДокумента.Свойство(КлючИЗначение.Ключ) Тогда
				Реквизиты.Удалить(КлючИЗначение.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция КадровыеДанныеСотрудника()
	КадровыеДанныеСотрудника = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "КадровыеДанные");
	Если КадровыеДанныеСотрудника = Неопределено Тогда
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Возврат Неопределено;
		КонецЕсли;
		ДатаЗапроса = ?(ДополнительныеСвойства.Свойство("РеквизитыЗапроса"),
			ДополнительныеСвойства.РеквизитыЗапроса.Дата, ТекущаяДатаСеанса());
		ИменаПолей = Документы.ОтветНаЗапросФССДляРасчетаПособия.ИменаПолейТребуемыхКадровыхДанных();
		КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудника(Истина, Сотрудник, ИменаПолей, ДатаЗапроса);
		Если КадровыеДанныеСотрудника = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(КадровыеДанныеСотрудника) = Тип("Структура") Тогда
		Возврат КадровыеДанныеСотрудника;
	КонецЕсли;
	КадровыеДанные = КадровыеДанныеВСтруктуру(КадровыеДанныеСотрудника);
	ДополнительныеСвойства.Вставить("КадровыеДанные", КадровыеДанные);
	Возврат КадровыеДанные;
КонецФункции

Функция КадровыеДанныеВСтруктуру(КадровыеДанныеСотрудника)
	ИменаПолей = Документы.ОтветНаЗапросФССДляРасчетаПособия.ИменаПолейТребуемыхКадровыхДанных();
	КадровыеДанные = Новый Структура(ИменаПолей);
	ЗаполнитьЗначенияСвойств(КадровыеДанные, КадровыеДанныеСотрудника);
	Возврат КадровыеДанные;
КонецФункции

Функция ЗаполнитьКодСтраныГражданства(ПараметрыФиксации)
	Реквизиты = Новый Структура("КодСтраныГражданства");
	
	Если ЗначениеЗаполнено(СотрудникГражданство) Тогда
		Реквизиты.КодСтраныГражданства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникГражданство, "Код");
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьРазрешениеНаПроживание(ПараметрыФиксации)
	Реквизиты = Новый Структура("РазрешениеНаПроживаниеВид, РазрешениеНаПроживаниеСерия, РазрешениеНаПроживаниеНомер,
		|РазрешениеНаПроживаниеДатаВыдачи");
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) И СЭДОФСС.ПоказыватьРазрешениеНаПроживание(КодСтраныГражданства) Тогда
		РазрешениеНаПроживание = Документы.СведенияОЗастрахованномЛицеФСС.НайтиРазрешениеНаПроживание(
			ФизическоеЛицо,
			Дата,
			Документы.ОтветНаЗапросФССДляРасчетаПособия.КодыМВДРазрешенияНаПроживание());
		Реквизиты.РазрешениеНаПроживаниеВид          = РазрешениеНаПроживание.Вид;
		Реквизиты.РазрешениеНаПроживаниеСерия        = СокрЛП(РазрешениеНаПроживание.Серия);
		Реквизиты.РазрешениеНаПроживаниеНомер        = СокрЛП(РазрешениеНаПроживание.Номер);
		Реквизиты.РазрешениеНаПроживаниеДатаВыдачи   = РазрешениеНаПроживание.ДатаВыдачи;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЭтоВнешнееСовместительство(ВидЗанятости)
	Возврат ВидЗанятости = Перечисления.ВидыЗанятости.Совместительство;
КонецФункции

// Зависит от: ФизическоеЛицо, Сотрудник, ДатаНачалаСобытия, ВходящийЗапрос.
Функция ЗаполнитьРеквизитыДоговора(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ВидДоговораТрудовой")
		Или ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ВидДоговораГПХ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = ПустыеРеквизитыДоговора();
	
	КадровыеДанные = КадровыеДанныеСотрудника();
	Договор = СЭДОФСС.ДоговорФизлицаНаДатуСобытия(ГоловнаяОрганизация, ФизическоеЛицо, ДатаНачалаСобытия);
	ПрочиеДанные = ДанныеВходящегоЗапроса();
	РеквизитыДоговора = СЭДОФСС.РеквизитыДоговораСотрудника(КадровыеДанные, Договор, ДатаНачалаСобытия, ПрочиеДанные);
	
	ЗаполнитьЗначенияСвойств(Реквизиты, РеквизитыДоговора);
	Реквизиты.ТрудовойДоговорДатаНачала = РеквизитыДоговора.СрочныйДоговорДатаНачала;
	Реквизиты.ТрудовойДоговорДатаОкончания = РеквизитыДоговора.СрочныйДоговорДатаОкончания;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ПустыеРеквизитыДоговора()
	Возврат Новый Структура("ВидДоговораТрудовой, ВидДоговораГПХ, ДоговорГПХОблагаетсяВзносамиНС,
	|ТрудовойДоговорДатаНачала, ТрудовойДоговорДатаОкончания");
КонецФункции

Функция ЗаполнитьСпособВыплатыПособия(ПараметрыФиксации)
	// Получение сведений о способах выплаты.
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		НастройкиПрямыхВыплат = СпособыПрямыхВыплатФСС.НастройкиСотрудников(Организация, ФизическоеЛицо, Дата);
		СпособПрямыхвыплат    = НастройкиПрямыхВыплат.ТаблицаРезультат[0];
		СпособЗаполнен        = Не (СпособПрямыхвыплат.ОпределеноАвтоматически
			И СпособПрямыхвыплат.Значение = КадровыйУчет.ВидКонтактнойИнформацииАдресМестаПроживанияФизическогоЛица());
	Иначе
		НастройкиПрямыхВыплат = Неопределено;
		СпособПрямыхвыплат    = Неопределено;
		СпособЗаполнен        = Ложь;
	КонецЕсли;
	// Заполнение первичных сведений о способе выплаты.
	ЕстьИзменения = Ложь;
	РеквизитыСпособа = РеквизитыСпособаПрямыхвыплат(СпособПрямыхвыплат);
	Если РеквизитыСпособа.СпособВыплатыПособия = Неопределено Тогда
		СпособЗаполнен = Ложь;
	КонецЕсли;
	Если Не СпособЗаполнен И ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
		Если ВоВходящемЗапросеЗаполненСпособВыплаты(ДанныеВходящегоЗапроса) Тогда
			Если ДанныеВходящегоЗапроса.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ИнаяОрганизация Тогда
				РеквизитыСпособа.Вставить("ИнаяОрганизацияБИК");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияИНН");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияКБК");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияКПП");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияЛицевойСчетОрганизации");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияЛицевойСчетСотрудника");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияНаименование");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияНомерСчетаСтрахователя");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияРегистрационныйНомер");
				РеквизитыСпособа.Вставить("ИнаяОрганизацияРегистрационныйНомерСФР");
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(РеквизитыСпособа, ДанныеВходящегоЗапроса);
		КонецЕсли;
	КонецЕсли;
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыСпособа, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	// Заполнение банковских реквизитов.
	РеквизитыБанка = РеквизитыБанка(НастройкиПрямыхВыплат, СпособПрямыхвыплат);
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыБанка, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	Возврат ЕстьИзменения;
КонецФункции

Функция РеквизитыСпособаПрямыхвыплат(СпособПрямыхвыплат)
	РеквизитыСпособа = Новый Структура("СпособВыплатыПособия, КартаМИР, Банк, НомерСчета, АдресПроживанияВид");
	Если СпособПрямыхвыплат = Неопределено Тогда
		Возврат РеквизитыСпособа;
	КонецЕсли;
	
	ТипыСпособовПрямыхВыплат = СпособыПрямыхВыплатФСС.ТипыСпособовПрямыхВыплат();
	ТипСпособа = ТипыСпособовПрямыхВыплат.Найти(ТипЗнч(СпособПрямыхвыплат.Значение), "Тип");
	Если ТипСпособа = Неопределено Тогда
		Возврат РеквизитыСпособа;
	КонецЕсли;
	
	РеквизитыСпособа.СпособВыплатыПособия = ТипСпособа.СпособВыплатыПособия;
	Если РеквизитыСпособа.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.НаКартуМИР Тогда
		РеквизитыСпособа.КартаМИР           = СпособПрямыхвыплат.Значение;
	ИначеЕсли РеквизитыСпособа.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк Тогда
		РеквизитыСпособа.Банк               = СпособПрямыхвыплат.Банк;
		РеквизитыСпособа.НомерСчета         = СпособПрямыхвыплат.НомерСчета;
	Иначе
		РеквизитыСпособа.АдресПроживанияВид = СпособПрямыхвыплат.Значение;
	КонецЕсли;
	
	Возврат РеквизитыСпособа;
КонецФункции

Функция ВоВходящемЗапросеЗаполненСпособВыплаты(ДанныеВходящегоЗапроса)
	Если ДанныеВходящегоЗапроса.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.НаКартуМИР Тогда
		Возврат ЗначениеЗаполнено(ДанныеВходящегоЗапроса.КартаМИР);
	ИначеЕсли ДанныеВходящегоЗапроса.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк Тогда
		Возврат ЗначениеЗаполнено(ДанныеВходящегоЗапроса.НомерСчета);
	ИначеЕсли ДанныеВходящегоЗапроса.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ПочтовымПереводом Тогда
		Возврат ЗначениеЗаполнено(ДанныеВходящегоЗапроса.АдресПроживанияФИАСДом)
			Или ЗначениеЗаполнено(ДанныеВходящегоЗапроса.АдресПроживанияФИАСРО)
			Или ЗначениеЗаполнено(ДанныеВходящегоЗапроса.АдресПроживанияЗаПределамиРФ);
	ИначеЕсли СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ИнаяОрганизация Тогда
		Возврат ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ИнаяОрганизацияНомерСчетаСтрахователя);
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция РеквизитыБанка(НастройкиПрямыхВыплат, СпособПрямыхвыплат)
	РеквизитыБанка = Новый Структура("БанкНаименование, БанкБИК, БанкКоррСчет");
	Если Не ЗначениеЗаполнено(Банк) Тогда
		Возврат РеквизитыБанка;
	КонецЕсли;
	
	// Определение способа прямых выплат по выбранному банку.
	Если НастройкиПрямыхВыплат <> Неопределено
		И (СпособПрямыхвыплат = Неопределено Или Банк <> СпособПрямыхвыплат.Банк) Тогда
		Найденные = НастройкиПрямыхВыплат.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("Банк, ПометкаУдаления", Банк, Ложь));
		Если Найденные.Количество() = 0 Тогда
			Найденные = НастройкиПрямыхВыплат.БанковскиеРеквизиты.НайтиСтроки(Новый Структура("Банк", Банк));
		КонецЕсли;
		Если Найденные.Количество() = 0 Тогда
			СпособПрямыхвыплат = Неопределено;
		Иначе
			СпособПрямыхвыплат = Найденные[0];
		КонецЕсли;
	КонецЕсли;
	
	// Определение реквизитов банка.
	Если СпособПрямыхвыплат = Неопределено Тогда
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, "Наименование, Код, КоррСчет");
		РеквизитыБанка.БанкНаименование = Реквизиты.Наименование;
		РеквизитыБанка.БанкБИК          = Реквизиты.Код;
		РеквизитыБанка.БанкКоррСчет     = Реквизиты.КоррСчет;
	Иначе
		РеквизитыБанка.БанкНаименование = СпособПрямыхвыплат.НаименованиеБанка;
		РеквизитыБанка.БанкБИК          = СпособПрямыхвыплат.БИК;
		РеквизитыБанка.БанкКоррСчет     = СпособПрямыхвыплат.КоррСчет;
	КонецЕсли;
	
	Возврат РеквизитыБанка;
КонецФункции

Функция ЗаполнитьКонтактыФизическогоЛица(ПараметрыФиксации)
	Реквизиты = Новый Структура("АдресРегистрации, АдресПроживания, СотрудникТелефон");
	
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		АдресРегистрацииВид = КадровыйУчет.ВидКонтактнойИнформацииАдресПоПропискеФизическиеЛица();
		ТелефонДомашнийВид  = КадровыйУчет.ВидКонтактнойИнформацииТелефонДомашнийФизическиеЛица();
		ТелефонМобильныйВид = КадровыйУчет.ВидКонтактнойИнформацииТелефонМобильныйФизическиеЛица();
		
		ВидыКИ = Новый Массив;
		ВидыКИ.Добавить(АдресРегистрацииВид);
		Если ЗначениеЗаполнено(АдресПроживанияВид) Тогда
			ВидыКИ.Добавить(АдресПроживанияВид);
		КонецЕсли;
		ВидыКИ.Добавить(ТелефонДомашнийВид);
		ВидыКИ.Добавить(ТелефонМобильныйВид);
		
		ТаблицаКИ = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(ФизическоеЛицо, , ВидыКИ);
		
		СтрокаКИ = ТаблицаКИ.Найти(АдресРегистрацииВид, "Вид");
		Если СтрокаКИ <> Неопределено Тогда
			Реквизиты.АдресРегистрации = СтрокаКИ.Значение;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресПроживанияВид) Тогда
			СтрокаКИ = ТаблицаКИ.Найти(АдресПроживанияВид, "Вид");
			Если СтрокаКИ <> Неопределено Тогда
				Реквизиты.АдресПроживания = СтрокаКИ.Значение;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаКИ = ТаблицаКИ.Найти(ТелефонМобильныйВид, "Вид");
		Если СтрокаКИ <> Неопределено Тогда
			Реквизиты.СотрудникТелефон = СтрокаКИ.Значение;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Реквизиты.СотрудникТелефон) Тогда
			СтрокаКИ = ТаблицаКИ.Найти(ТелефонДомашнийВид, "Вид");
			Если СтрокаКИ <> Неопределено Тогда
				Реквизиты.СотрудникТелефон = СтрокаКИ.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации, Истина);
КонецФункции

Функция ЗаполнитьКодыАдреса(ПараметрыФиксации, ИмяПоляАдрес, ЕстьПолеСтроение)
	Суффиксы = "Индекс, Регион, Район, НаселенныйПункт, Улица, Дом, Корпус, Квартира, ФИАСДом, ФИАСРО, ЗаПределамиРФ";
	Если ЕстьПолеСтроение Тогда
		Суффиксы = Суффиксы + ", Строение";
	КонецЕсли;
	Массив = СтрРазделить(Суффиксы, ", ", Ложь);
	ИменаРеквизитов = ИмяПоляАдрес + СтрСоединить(Массив, ", " + ИмяПоляАдрес);
	Реквизиты = Новый Структура(ИменаРеквизитов);
	
	Адрес = ЭтотОбъект[ИмяПоляАдрес];
	Если Не ЗначениеЗаполнено(Адрес) Тогда
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("БезПредставлений",               Ложь);
	ДополнительныеПараметры.Вставить("КодыАдреса",                     Истина);
	ДополнительныеПараметры.Вставить("КодыКЛАДР",                      Ложь);
	ДополнительныеПараметры.Вставить("НаименованиеВключаетСокращение", Истина);
	ДополнительныеПараметры.Вставить("ПроверитьАдрес",                 Ложь);
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(Адрес, ДополнительныеПараметры);
	
	Если ЕстьПолеСтроение Тогда // Строение и сооружение - одно и то же.
		ИменаПолей = "Индекс, Регион, Район, НаселенныйПункт, Улица, Дом, Корпус, Строение, Участок, Квартира";
	Иначе
		ИменаПолей = "Индекс, Регион, Район, НаселенныйПункт, Улица, Дом, Корпус, Строение, Сооружение, Участок, Квартира";
	КонецЕсли;
	СтруктураАдреса = КонтактнаяИнформацияБЗК.СвернутьСведенияОбАдресе(СведенияОбАдресе, ИменаПолей);
	Если ЕстьПолеСтроение Тогда
		Если ЗначениеЗаполнено(СтруктураАдреса.Участок) Тогда
			Если Не ЗначениеЗаполнено(СтруктураАдреса.Строение) Тогда
				СтруктураАдреса.Строение = НСтр("ru = 'Участок'") + " " + СтруктураАдреса.Участок;
			Иначе
				СтруктураАдреса.Строение = СтрШаблон(НСтр("ru = '%1, уч. %2'"),
					СтруктураАдреса.Строение,
					СтруктураАдреса.Участок);
			КонецЕсли;
		КонецЕсли;
	Иначе
		СтруктураАдреса.Корпус = КонтактнаяИнформацияБЗК.ПредставлениеКорпусов(СтруктураАдреса, 30);
		СтруктураАдреса.Удалить("Строение");
	КонецЕсли;
	СтруктураАдреса.Удалить("Сооружение");
	СтруктураАдреса.Удалить("Участок");
	
	СтруктураАдреса.Вставить("ФИАСДом", Строка(СведенияОбАдресе.ИдентификаторДома));
	СтруктураАдреса.Вставить("ФИАСРО",  Строка(СведенияОбАдресе.ИдентификаторАдресногоОбъекта));
	Если Не ЗначениеЗаполнено(СтруктураАдреса.ФИАСДом)
		И СтруктураАдреса.ФИАСРО <> СведенияОбАдресе.ИдентификаторЗемельногоУчастка Тогда
		СтруктураАдреса.ФИАСДом = Строка(СведенияОбАдресе.ИдентификаторЗемельногоУчастка);
	КонецЕсли;
	
	Если СведенияОбАдресе.КодСтраны = "643" Тогда
		ЗаПределамиРФ = "";
	Иначе
		ЗаПределамиРФ = СведенияОбАдресе.Представление;
	КонецЕсли;
	СтруктураАдреса.Вставить("ЗаПределамиРФ", ЗаПределамиРФ);
	
	Для Каждого КлючИЗначение Из СтруктураАдреса Цикл
		Реквизиты[ИмяПоляАдрес + КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	КонецЦикла;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКадровыеДанныеРебенка(ПараметрыФиксации)
	Реквизиты = Новый Структура(ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации));
	
	Если ЗначениеЗаполнено(Ребенок) Тогда
		КадровыеДанныеРебенка = СЭДОФСС.КадровыеДанныеРодственника(Ребенок, Истина);
		Реквизиты.РебенокФамилия      = КадровыеДанныеРебенка.Фамилия;
		Реквизиты.РебенокИмя          = КадровыеДанныеРебенка.Имя;
		Реквизиты.РебенокОтчество     = КадровыеДанныеРебенка.Отчество;
		Реквизиты.РебенокДатаРождения = КадровыеДанныеРебенка.ДатаРождения;
		Реквизиты.РебенокСНИЛС        = КадровыеДанныеРебенка.СНИЛС;
		Реквизиты.РебенокКодСвязи     = КадровыеДанныеРебенка.КодСвязи;
		Реквизиты.РебенокПол          = КадровыеДанныеРебенка.Пол;
	ИначеЕсли ЗначениеЗаполнено(ПервичныйДокумент) Или ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьКодСтатусаНалогоплательщика(ПараметрыФиксации, Особенности)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "КодСтатусаНалогоплательщика") Тогда
		Возврат Ложь;
	КонецЕсли;
	НовоеЗначение = "";
	Если ЗначениеЗаполнено(СтатусНалогоплательщика) Тогда
		Если Особенности.Версия_3 Тогда
			КодЧислом = СЭДОФСС.КодСтатусаНалогоплательщикаЕЦП(СтатусНалогоплательщика);
		Иначе
			КодЧислом = СЭДОФСС.КодСтатусаНалогоплательщикаОСС(СтатусНалогоплательщика);
		КонецЕсли;
		НовоеЗначение = Формат(КодЧислом, "ЧН=");
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(КодСтатусаНалогоплательщика, НовоеЗначение);
КонецФункции

Функция ИменаРеквизитовЗаполняемыхИзРебенка(ПараметрыФиксации)
	ИменаПолей = ФиксацияВторичныхДанныхВДокументахКлиентСервер.ИменаПолейПоОснованиямЗаполнения(ПараметрыФиксации);
	Возврат СтрСоединить(ИменаПолей.Ребенок, ", ");
КонецФункции

Процедура ЗаполнитьВходящийЗапросПоПервичнымДанным()
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	ЕстьПервичныйДокумент = ЗначениеЗаполнено(ПервичныйДокумент);
	ЕстьНомерЛН           = ЗначениеЗаполнено(НомерЛН);
	Если Не ЕстьПервичныйДокумент И Не ЕстьНомерЛН Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВходящийЗапросФСС.Ссылка КАК Ссылка,
	|	ВходящийЗапросФСС.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ВходящийЗапросФССДляРасчетаПособия КАК ВходящийЗапросФСС
	|ГДЕ
	|	ВходящийЗапросФСС.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И ВходящийЗапросФСС.ФизическоеЛицо = &ФизическоеЛицо
	|	И ВходящийЗапросФСС.ПервичныйДокумент = &ПервичныйДокумент
	|	И ВходящийЗапросФСС.НомерЛН = &НомерЛН
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПометкаУдаления";
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	Если ЕстьПервичныйДокумент Тогда
		Запрос.УстановитьПараметр("ПервичныйДокумент", ПервичныйДокумент);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВходящийЗапросФСС.НомерЛН = &НомерЛН", "");
	ИначеЕсли ЕстьНомерЛН Тогда
		Запрос.УстановитьПараметр("НомерЛН", НомерЛН);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВходящийЗапросФСС.ПервичныйДокумент = &ПервичныйДокумент", "");
	Иначе
		Возврат;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВходящийЗапрос = Выборка.Ссылка;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьДату()
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьТипСообщения()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ТипСообщения") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СЭДОФСС.ПособияПоВНиМПереведеныНаЕЦП() Тогда
		НовоеЗначение = 10110;
	Иначе
		НовоеЗначение = 101;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ТипСообщения, НовоеЗначение);
КонецФункции

Процедура ПриИзмененииТипаСообщения()
	Если ТипСообщения = 10110 Тогда
		// Отмена фиксации реквизитов типа 101, которые не видны в 10110, но могут использоваться.
		Реквизиты =
		"ДатаНачалаСобытия,
		|ОплатаФССДатаНачала,
		|ОплатаФССДатаОкончания";
		ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитовШапки(ЭтотОбъект, Реквизиты);
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьВерсиюСпецификации()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ВерсияСпецификации") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если СЭДОФСС.ПособияПоВНиМПереведеныНаЕЦП() Тогда
		НовоеЗначение = "3.0";
	Иначе
		НовоеЗначение = "2.45";
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ВерсияСпецификации, НовоеЗначение);
КонецФункции

Функция ДополнитьДаннымиВходящегоЗапроса(ПараметрыФиксации, Принудительно = Ложь)
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	РеквизитыЗапроса = ДанныеВходящегоЗапроса();
	
	Особенности = ОсобенностиВыгрузки();
	
	ДанныеПервичногоДокумента = ?(Принудительно, Неопределено, ДанныеЗаполняемыеИзПервичногоДокумента());
	КадровыеДанные = ?(Принудительно, Неопределено, КадровыеДанныеСотрудника());
	РеквизитыДоговора = ?(Принудительно, Неопределено, ПустыеРеквизитыДоговора());
	
	УжеЗаполненныеДанные = ДанныеПервичногоДокумента;
	Если КадровыеДанные <> Неопределено Тогда
		Если УжеЗаполненныеДанные = Неопределено Тогда
			УжеЗаполненныеДанные = КадровыеДанные;
		Иначе
			Если УжеЗаполненныеДанные = ДанныеПервичногоДокумента Тогда
				УжеЗаполненныеДанные = КоллекцииБЗК.СкопироватьСтруктуру(УжеЗаполненныеДанные);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(УжеЗаполненныеДанные, КадровыеДанные, Ложь);
		КонецЕсли;
	КонецЕсли;
	Если РеквизитыДоговора <> Неопределено Тогда
		Если УжеЗаполненныеДанные = Неопределено Тогда
			УжеЗаполненныеДанные = РеквизитыДоговора;
		Иначе
			Если УжеЗаполненныеДанные = ДанныеПервичногоДокумента Тогда
				УжеЗаполненныеДанные = КоллекцииБЗК.СкопироватьСтруктуру(УжеЗаполненныеДанные);
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(УжеЗаполненныеДанные, РеквизитыДоговора, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	ИменаПолей = "АктВПроизвольнойФормеДатаВыдачи, АктВПроизвольнойФормеНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "АктН1ДатаВыдачи, АктН1Номер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "АктоваяЗаписьОРожденииДата, АктоваяЗаписьОРожденииНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "АктПЗДатаВыдачи";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ВидПособия";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ДоговорГПХОблагаетсяВзносамиНС";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ДругойРодительОтсутствует, СправкаОтДругогоРодителяНомер, СправкаОтДругогоРодителяДата";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ЗаменаПослеродовогоОтпускаДата, ЗаменаПослеродовогоОтпускаНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ИнойДокументОРожденииДатаВыдачи, ИнойДокументОРожденииСерияНомер, ИнойДокументОРожденииСерия, ИнойДокументОРожденииНомер";
	Заполнено = ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	Если Заполнено
		И ЗначениеЗаполнено(Реквизиты.ИнойДокументОРожденииСерияНомер)
		И Не ЗначениеЗаполнено(Реквизиты.ИнойДокументОРожденииСерия)
		И Не ЗначениеЗаполнено(Реквизиты.ИнойДокументОРожденииНомер) Тогда
		Реквизиты.ИнойДокументОРожденииНомер      = Реквизиты.ИнойДокументОРожденииСерияНомер;
		Реквизиты.ИнойДокументОРожденииСерияНомер = "";
	КонецЕсли;
	
	ИменаПолей = "НаличиеДокументовОРожденииПредыдущихДетей";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "НаличиеРешенияСудаОЛишенииПрав";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "НаличиеСвидетельстваОСмертиПредыдущихДетей";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ОтпускПоУходуДата, ОтпускПоУходуДатаНачала, ОтпускПоУходуДатаОкончания, ОтпускПоУходуНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ПередачаНаВоспитаниеДата, ПередачаНаВоспитаниеНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ПризнаниеСлучаяСтраховым";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	Если Не ЗначениеЗаполнено(Ребенок) Тогда
		ИменаПолей = "РебенокФамилия, РебенокИмя, РебенокОтчество";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
		ИменаПолей = "РебенокДатаРождения, РебенокСНИЛС, РебенокКодСвязи, РебенокОчередность, РебенокПол";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	КонецЕсли;
	
	ИменаПолей = "РешениеСудаНомер, РешениеСудаДатаВыдачи";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "УтратаТрудоспобности";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "СвидетельствоОРожденииДатаВыдачи, СвидетельствоОРожденииСерияНомер, СвидетельствоОРожденииСерия, СвидетельствоОРожденииНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "СправкаОНеполученииПособияОтМатериДатаВыдачи, СправкаОНеполученииПособияОтМатериНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "СправкаОНеполученииПособияОтОтцаДатаВыдачи, СправкаОНеполученииПособияОтОтцаНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "СправкаОНеполученииПособияПоДругомуМестуРаботыДатаВыдачи, СправкаОНеполученииПособияПоДругомуМестуРаботыНомер";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "СправкаОРожденииДатаВыдачи, СправкаОРожденииНомер, СправкаОРожденииФорма";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	Если ЗначениеЗаполнено(РеквизитыЗапроса.ДоляВремени)
		И (КадровыеДанные = Неопределено Или Не КадровыеДанные.Свойство("ДоляНеполногоРабочегоВремени")) Тогда
		ИменаПолей = "ДоляВремени";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	КонецЕсли;
	
	Если Не Особенности.Версия_3 Тогда
		
		ВидЗаработкаСовпадает = Ложь;
		ИменаПолей = "ПервыйРасчетныйГодВидЗаработка, ВторойРасчетныйГодВидЗаработка";
		Если ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные) Тогда
			ВидЗаработкаСовпадает = Истина;
		Иначе
			ВидЗаработкаСовпадает = 
				ЗначенияСвойстваСовпадают(РеквизитыЗапроса, УжеЗаполненныеДанные, "ПервыйРасчетныйГодВидЗаработка")
				И ЗначенияСвойстваСовпадают(РеквизитыЗапроса, УжеЗаполненныеДанные, "ВторойРасчетныйГодВидЗаработка");
		КонецЕсли;
		
		РасчетныеГодыСовпадают = Ложь;
		Если ЗначениеЗаполнено(РеквизитыЗапроса.ПервыйРасчетныйГод)
			И ЗначениеЗаполнено(РеквизитыЗапроса.ВторойРасчетныйГод) Тогда
			ИменаПолей = "ПервыйРасчетныйГод, ВторойРасчетныйГод, ЗаменаЛетРасчетногоПериода";
			Если ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные) Тогда
				РасчетныеГодыСовпадают = Истина;
			Иначе
				РасчетныеГодыСовпадают = 
					ЗначенияСвойстваСовпадают(РеквизитыЗапроса, УжеЗаполненныеДанные, "ПервыйРасчетныйГод")
					И ЗначенияСвойстваСовпадают(РеквизитыЗапроса, УжеЗаполненныеДанные, "ВторойРасчетныйГод");
			КонецЕсли;
		КонецЕсли;
		
		Если ВидЗаработкаСовпадает И РасчетныеГодыСовпадают Тогда
			ИменаПолей = "ПервыйРасчетныйГодЗаработок, ВторойРасчетныйГодЗаработок";
			ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЗапроса.СтраховойСтажЛет)
		Или ЗначениеЗаполнено(РеквизитыЗапроса.СтраховойСтажМесяцев)
		Или ЗначениеЗаполнено(РеквизитыЗапроса.НестраховойСтажЛет)
		Или ЗначениеЗаполнено(РеквизитыЗапроса.НестраховойСтажМесяцев) Тогда
		ИменаПолей = "СтраховойСтажЛет, СтраховойСтажМесяцев, НестраховойСтажЛет, НестраховойСтажМесяцев";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЗапроса.КалендарныхДнейРасчетногоПериода) Тогда
		ИменаПолей = "КалендарныхДнейРасчетногоПериода";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыЗапроса.СреднемесячныйЗаработок) Тогда
		ИменаПолей = "СреднемесячныйЗаработок";
		ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	КонецЕсли;
	
	ИменаПолей = "УсыновлениеОпекаТип, УсыновлениеОпекаНомер, УсыновлениеОпекаДата";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "УходЗаНесколькимиДетьми";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "Перерасчет, ПерерасчетИдентификаторСтрокиРеестра";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ЧислитсяУНесколькихСтрахователей, СоставСтрахователейЗаДваГода, МетодНазначенияИВыплатыПособия";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	ИменаПолей = "ВходящийСрокОтвета";
	ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные);
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ДополнитьСтруктуруДаннымиВходящегоЗапроса(Реквизиты, РеквизитыЗапроса, ИменаПолей, УжеЗаполненныеДанные = Неопределено)
	СтруктураСвойств = Новый Структура(ИменаПолей);
	// Возврат при наличи любого из реквизитов в уже заполненных данных.
	Если УжеЗаполненныеДанные <> Неопределено Тогда
		Для Каждого КлючИЗначение Из СтруктураСвойств Цикл
			Если УжеЗаполненныеДанные.Свойство(КлючИЗначение.Ключ) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Вставка с контролем наличия реквизита во входящем запросе.
	Для Каждого КлючИЗначение Из СтруктураСвойств Цикл
		Реквизиты.Вставить(КлючИЗначение.Ключ, РеквизитыЗапроса[КлючИЗначение.Ключ]);
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ДанныеВходящегоЗапроса()
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Возврат Неопределено;
	КонецЕсли;
	РеквизитыЗапроса = ОбщегоНазначенияБЗК.ЗначениеСвойства(ДополнительныеСвойства, "РеквизитыЗапроса");
	Если РеквизитыЗапроса <> Неопределено И РеквизитыЗапроса.Ссылка = ВходящийЗапрос Тогда
		Возврат РеквизитыЗапроса;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ * ИЗ Документ.ВходящийЗапросФССДляРасчетаПособия ГДЕ Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ВходящийЗапрос);
	РеквизитыЗапроса = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	ДополнительныеСвойства.Вставить("РеквизитыЗапроса", РеквизитыЗапроса);
	Возврат РеквизитыЗапроса;
КонецФункции

Функция ЗаполнитьПредставления(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "СправкаОНеполученииПособияПредставление") Тогда
		Возврат Ложь;
	КонецЕсли;
	Реквизиты = Новый Структура("СправкаОНеполученииПособияПредставление");
	Реквизиты.СправкаОНеполученииПособияПредставление = ПредставлениеСправокОНеполученииПособия();
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ПредставлениеСправокОНеполученииПособия()
	Представления = Новый Массив;
	
	НомерДата = СЭДОФСС.ПредставлениеНомераИДаты(
		СправкаОНеполученииПособияОтМатериНомер,
		СправкаОНеполученииПособияОтМатериДатаВыдачи);
	Если НомерДата <> "" Тогда
		Представления.Добавить(НСтр("ru = 'Справка о неполучении пособия от матери:'") +" "+ НомерДата);
	КонецЕсли;
	
	НомерДата = СЭДОФСС.ПредставлениеНомераИДаты(
		СправкаОНеполученииПособияОтОтцаНомер,
		СправкаОНеполученииПособияОтОтцаДатаВыдачи);
	Если НомерДата <> "" Тогда
		Представления.Добавить(НСтр("ru = 'Справка о неполучении пособия от отца:'") +" "+ НомерДата);
	КонецЕсли;
	
	НомерДата = СЭДОФСС.ПредставлениеНомераИДаты(
		СправкаОНеполученииПособияПоДругомуМестуРаботыНомер,
		СправкаОНеполученииПособияПоДругомуМестуРаботыДатаВыдачи);
	Если НомерДата <> "" Тогда
		Представления.Добавить(НСтр("ru = 'Справка о неполучении пособия по другому месту работы:'") +" "+ НомерДата);
	КонецЕсли;
	
	Если Представления.Количество() > 1 Тогда
		Возврат СтрСоединить(Представления, ";" + Символы.ПС) + ".";
	Иначе
		Возврат ""; // Не требуется выгружать в примечание, т.к. справка всего одна - она попадет в тег refNpay.
	КонецЕсли;
КонецФункции

Функция ЗначенияСвойстваСовпадают(ЛеваяКоллекция, ПраваяКоллекция, ИмяСвойства)
	Возврат ОбщегоНазначенияБЗК.ЗначениеСвойства(ЛеваяКоллекция, ИмяСвойства)
		= ОбщегоНазначенияБЗК.ЗначениеСвойства(ПраваяКоллекция, ИмяСвойства);
КонецФункции

Функция ЗаполнитьСтатусНалогоплательщика(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "СтатусНалогоплательщика") Тогда
		Возврат Ложь;
	КонецЕсли;
	Реквизиты = Новый Структура("СтатусНалогоплательщика");
	КадровыеДанные = КадровыеДанныеСотрудника();
	Если КадровыеДанные <> Неопределено И ЗначениеЗаполнено(КадровыеДанные.СтатусНалогоплательщика) Тогда
		Реквизиты.СтатусНалогоплательщика = КадровыеДанные.СтатусНалогоплательщика;
	Иначе
		РеквизитыЗапроса = ДанныеВходящегоЗапроса();
		Если РеквизитыЗапроса <> Неопределено И ЗначениеЗаполнено(РеквизитыЗапроса.КодСтатусаНалогоплательщика) Тогда
			Реквизиты.СтатусНалогоплательщика = СЭДОФСС.СтатусНалогоплательщика(РеквизитыЗапроса.КодСтатусаНалогоплательщика);
		КонецЕсли;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьПриостановлениеТД(ПараметрыФиксации, Особенности)
	Если Не Особенности.Версия_2_45 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВходящийЗапрос) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Табличная часть ПриостановленияТрудовыхДоговоров заполняется данными страхователя в процедуре
	// ЗаполнитьДанныеИзПервичногоДокумента, но с версии 2.45 используется только для заполнения полей
	// ПриостановлениеТДОснованиеНПА и ПриостановлениеТДПримечание.
	// А ПриостановлениеТДКалендарныхДней заполняется из входящего запроса.
	
	// Обновление НПА и календарных дней.
	Реквизиты = Новый Структура("ПриостановлениеТДОснованиеНПА, ПриостановлениеТДКалендарныхДней");
	ЗаполнитьЗначенияСвойств(Реквизиты, ДанныеВходящегоЗапроса());
	ОснованияНПА = КоллекцииБЗК.УникальныеЗначенияКолонки(ПриостановленияТрудовыхДоговоров, "ОснованиеНПА");
	ОснованияНПАКоличество = ОснованияНПА.Количество();
	Если Реквизиты.ПриостановлениеТДКалендарныхДней > 0 И ОснованияНПАКоличество > 0
		И (ОснованияНПАКоличество = 1 Или Не ЗначениеЗаполнено(Реквизиты.ПриостановлениеТДОснованиеНПА)) Тогда
		Реквизиты.ПриостановлениеТДОснованиеНПА = ОснованияНПА[ОснованияНПАКоличество - 1];
	КонецЕсли;
	ЕстьИзменения = ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	
	// Представление несоответствий.
	Реквизиты = Новый Структура("ПриостановлениеТДПримечание", "");
	
	КалендарныхДнейСтрахователя = ПриостановленияТрудовыхДоговоров.Итог("КалендарныхДней");
	Если ПриостановлениеТДКалендарныхДней <> КалендарныхДнейСтрахователя И КалендарныхДнейСтрахователя > 0 Тогда
		
		ОснованиеНПА = ?(ОснованияНПАКоличество = 1, ОснованияНПА[0], Неопределено);
		Если ОснованиеНПА = Перечисления.ОснованияПриостановленияТрудовыхДоговоровСФР.ТК_351_7 Тогда
			ШаблонЗаголовка = НСтр("ru = 'Просьба учесть %1 приостановления действия трудового договора в соответствии со статьей 351.7 ТК РФ, всего %2:'");
			ДобавлятьОснованиеНПАВКаждуюСтроку = Ложь;
		ИначеЕсли ОснованиеНПА = Перечисления.ОснованияПриостановленияТрудовыхДоговоровСФР.ФЗ_79_СТ_53_1 Тогда
			ШаблонЗаголовка = НСтр("ru = 'Просьба учесть %1 приостановления прохождения гос. гражданской службы (ст. 53.1 ФЗ от 27.07.04 года N 79-ФЗ), всего %2:'");
			ДобавлятьОснованиеНПАВКаждуюСтроку = Ложь;
		Иначе
			ШаблонЗаголовка = НСтр("ru = 'Просьба учесть %1 приостановления ТД, всего %2:'");
			ДобавлятьОснованиеНПАВКаждуюСтроку = Истина;
		КонецЕсли;
		
		РасчетныеГодыСовпадают = Истина;
		ПредставлениеПериодов = "";
		ПредыдущийГод = Неопределено;
		Для Каждого Период Из ПриостановленияТрудовыхДоговоров Цикл
			Если Не ОбщегоНазначенияБЗК.ПериодСоответствуетТребованиям(Период.ДатаНачала, Период.ДатаОкончания) Тогда
				Продолжить;
			КонецЕсли;
			Период.КалендарныхДней = ОбщегоНазначенияБЗК.КоличествоДнейВПериоде(Период.ДатаНачала, Период.ДатаОкончания);
			ГодНачала = Год(Период.ДатаНачала);
			Если ГодНачала <> ПервыйРасчетныйГод И ГодНачала <> ВторойРасчетныйГод Тогда
				РасчетныеГодыСовпадают = Ложь;
				Прервать; // Годы не совпадают с расчетным периодом, приостановления не актуальны.
			КонецЕсли;
			НаименованиеПериода = ЗарплатаКадрыКлиентСервер.ПредставлениеДней(Период.КалендарныхДней)
				+ " " + ОбщегоНазначенияБЗК.НаименованиеПериода(Период.ДатаНачала, Период.ДатаОкончания, Ложь);
			Если ДобавлятьОснованиеНПАВКаждуюСтроку Тогда
				ТипСтрокой = Перечисления.ОснованияПриостановленияТрудовыхДоговоровСФР.ЗначениеВСтрокуСЭДОXML(
					Период.ОснованиеНПА);
				НаименованиеПериода = НаименованиеПериода + " (" + ТипСтрокой + ")";
			КонецЕсли;
			Если ПредыдущийГод <> ГодНачала Тогда
				ПредставлениеПериодов = ?(ПредставлениеПериодов = "", "", ПредставлениеПериодов + Символы.ПС)
					+ СтрШаблон(НСтр("ru = 'за %1 год - %2'"), Формат(ГодНачала, "ЧГ="), НаименованиеПериода);
				ПредыдущийГод = ГодНачала;
			ИначеЕсли ДобавлятьОснованиеНПАВКаждуюСтроку Тогда
				ПредставлениеПериодов = ПредставлениеПериодов + "," + Символы.ПС + "  " + НаименованиеПериода;
			Иначе
				ПредставлениеПериодов = ПредставлениеПериодов + ", " + НаименованиеПериода;
			КонецЕсли;
		КонецЦикла;
		
		Если РасчетныеГодыСовпадают Тогда
			ПредставлениеПериод = ?(ПриостановленияТрудовыхДоговоров.Количество() > 1, НСтр("ru = 'периоды'"), НСтр("ru = 'период'"));
			ПредставлениеДней = ЗарплатаКадрыКлиентСервер.ПредставлениеДней(КалендарныхДнейСтрахователя);
			ЗаголовокДнейСтрахователя = СтрШаблон(ШаблонЗаголовка, ПредставлениеПериод, ПредставлениеДней);
			Реквизиты.ПриостановлениеТДПримечание = ЗаголовокДнейСтрахователя + Символы.ПС + ПредставлениеПериодов + ".";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Функция ЗаполнитьКатегориюСотрудника(Особенности)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "СотрудникКатегория") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Новая реализация (в формате сообщения 10110).
	Если Особенности.Версия_3 Тогда
		РеквизитыДокумента = РеквизитыПервичногоДокумента();
		РеквизитыЗапроса = ДанныеВходящегоЗапроса();
		КадровыеДанные = КадровыеДанныеСотрудника();
		НовоеЗначение = СЭДОФСС.КатегорияСотрудника(ЭтотОбъект, КадровыеДанные, РеквизитыДокумента, РеквизитыЗапроса);
		Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СотрудникКатегория, НовоеЗначение);
	КонецЕсли;
	
	// Старая реализация (в формате сообщения 101).
	ЗначениеПоУмолчанию = "INSURED";
	НовоеЗначение = ЗначениеПоУмолчанию;
	
	// Чтение категории из больничного.
	РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента();
	Если РеквизитыПервичногоДокумента <> Неопределено
		И РеквизитыПервичногоДокумента.Свойство("СотрудникКатегория")
		И ЗначениеЗаполнено(РеквизитыПервичногоДокумента.СотрудникКатегория) Тогда
		НовоеЗначение = РеквизитыПервичногоДокумента.СотрудникКатегория;
	КонецЕсли;
	
	// Чтение категории из входящего запроса.
	Если НовоеЗначение = ЗначениеПоУмолчанию Тогда
		РеквизитыЗапроса = ДанныеВходящегоЗапроса();
		Если РеквизитыЗапроса <> Неопределено И ЗначениеЗаполнено(РеквизитыЗапроса.СотрудникКатегория) Тогда
			НовоеЗначение = РеквизитыЗапроса.СотрудникКатегория;
		КонецЕсли;
	КонецЕсли;
	
	// Чтение флажка из учета приостановлений ТД.
	// В соответствии с пунктом 2 части 2 статьи 3 ФЗ от 29.12.2006 № 255-ФЗ.
	Если НовоеЗначение = ЗначениеПоУмолчанию
		И ЗначениеЗаполнено(НомерЛН)
		И ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоВременнойНетрудоспособности Тогда
		СведенияОбЭЛН = СведенияОбЭЛН();
		Если СведенияОбЭЛН <> Неопределено
			И СведенияОбЭЛН.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание Тогда
			Больничный = Новый Структура;
			Больничный.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
			Больничный.Вставить("ФизическоеЛицо", ФизическоеЛицо);
			Больничный.Вставить("ПериодРасчетаСреднегоЗаработкаПервыйГод", ПервыйРасчетныйГод);
			Больничный.Вставить("ПериодРасчетаСреднегоЗаработкаВторойГод", ВторойРасчетныйГод);
			Больничный.Вставить("ДатаНачалаСобытия", ДатаНачалаСобытия);
			ДанныеУчета = УчетПособийСоциальногоСтрахования.ДанныеУчетаПриостановленийТД(Больничный);
			Если ДанныеУчета.НачалоВПериодПриостановленияТД = Истина Тогда
				НовоеЗначение = "ENDOFMILITARY";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СотрудникКатегория, НовоеЗначение);
КонецФункции

Функция ЗаполнитьИсключаемыеПериодыПримечание(ПараметрыФиксации)
	Реквизиты = Новый Структура("ИсключаемыеПериодыПримечание,ИсключаемыеПериодыВыгружатьПримечание", "", Ложь);
	Если ИсключаемыеПериоды.Количество() = 0 Тогда
		Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
	КонецЕсли;
	
	Отбор = Новый Структура("Причина", Перечисления.ПричиныНеоплатыБольничных.ПределОплаты5МесяцевДляИнвалидов);
	ПределОплаты = ИсключаемыеПериоды.НайтиСтроки(Отбор);
	КоличествоСтрок = ПределОплаты.Количество();
	
	Если КоличествоСтрок > 0 И ЗначениеЗаполнено(Сотрудник) Тогда
		Представления = Новый Массив;
		ТекущаяДатаОкончания = Неопределено;
		Реквизиты.ИсключаемыеПериодыВыгружатьПримечание = Истина;
		КадровыеДанные = КадровыеДанныеСотрудника();
		ФорматДня = "ДФ=""д""";
		ФорматМесяц = "ДФ=""д ММММ""";
		Для Каждого Период Из ПределОплаты Цикл
			Если ТекущаяДатаОкончания <> Неопределено Тогда
				ФорматДаты = ?(ФорматДаты = ФорматМесяц Или Месяц(ТекущаяДатаОкончания) <> Месяц(Период.ДатаНачала),
					ФорматМесяц, ФорматДня);
				Представление = Представление + Формат(ТекущаяДатаОкончания, ФорматДаты);
				Представления.Добавить(Представление);
			КонецЕсли;
			КоличествоСтрок = КоличествоСтрок - 1;
			ФорматДаты = ?(Период.ДатаНачала = Период.ДатаОкончания
				Или Месяц(Период.ДатаНачала) = Месяц(Период.ДатаОкончания) Или КоличествоСтрок > 0,
					ФорматДня, ФорматМесяц);
			Если Период.ДатаНачала = Период.ДатаОкончания Тогда
				Представление = ?(КоличествоСтрок = 0, Формат(Период.ДатаОкончания, ФорматМесяц), "");
			Иначе
				Представление = ?(ТекущаяДатаОкончания = Неопределено, НСтр("ru = 'С '"), НСтр("ru = 'с '"))
					+ Формат(Период.ДатаНачала, ФорматДаты) + НСтр("ru = ' по '")
					+ ?(КоличествоСтрок = 0, Формат(Период.ДатаОкончания, ФорматМесяц), "");
			КонецЕсли;
			ТекущаяДатаОкончания = Период.ДатаОкончания;
		КонецЦикла;
		Представления.Добавить(Представление);
		ГруппаИнвалидности = ?(ЗначениеЗаполнено(КадровыеДанные.ИнвалидностьГруппаИнвалидности),
			Лев(Строка(КадровыеДанные.ИнвалидностьГруппаИнвалидности), 1) + НСтр("ru = '-ой группы инвалидности'"),
			НСтр("ru = 'инвалида'"));
		Реквизиты.ИсключаемыеПериодыПримечание = СтрСоединить(Представления, ", ")
			+ СтрШаблон(НСтр("ru = ' превышен предел оплаты 5 месяцев больничного у сотрудника %1.'"),
				ГруппаИнвалидности);
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

// Требует: ДатаНачалаСобытия, Ссылки документов.
Функция ЗаполнитьРасчетныеГодыИЗаработок(ПараметрыФиксации, Особенности)
	Если Не Особенности.Версия_3 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыГоды = Новый Структура("ПервыйРасчетныйГод, ВторойРасчетныйГод");
	РеквизитыФлажки = Новый Структура("ЗаменаЛетРасчетногоПериода, ЗаменаЛетВНовомПроцессе");
	РеквизитыЗаработок = Новый Структура("ПервыйРасчетныйГодЗаработок, ВторойРасчетныйГодЗаработок");
	ЕстьИзменения = Ложь;
	
	РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента();
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	
	ЕстьПервичныйДокумент = ЕстьРасчетныеГоды(РеквизитыПервичногоДокумента);
	ЕстьВходящийЗапрос = ЕстьРасчетныеГоды(ДанныеВходящегоЗапроса);
	
	// Заполнение расчетных лет.
	Если Не ЕстьПервичныйДокумент И Не ЕстьВходящийЗапрос Тогда
		Если ЗначениеЗаполнено(ДатаНачалаСобытия) Тогда
			ПериодСреднего = УчетПособийСоциальногоСтрахованияКлиентСервер.ПериодРасчетаСреднегоЗаработкаФСС(ДатаНачалаСобытия);
			РеквизитыГоды.ПервыйРасчетныйГод = Год(ПериодСреднего.ДатаНачала);
			РеквизитыГоды.ВторойРасчетныйГод = Год(ПериодСреднего.ДатаОкончания);
		КонецЕсли;
	ИначеЕсли ЕстьВходящийЗапрос И (Не ЕстьПервичныйДокумент Или ПриоритетУДанныхВходящегоЗапроса) Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыГоды, ДанныеВходящегоЗапроса);
		ЗаполнитьЗначенияСвойств(РеквизитыЗаработок, ДанныеВходящегоЗапроса);
	Иначе
		ЗаполнитьЗначенияСвойств(РеквизитыГоды, РеквизитыПервичногоДокумента);
		ЗаполнитьЗначенияСвойств(РеквизитыЗаработок, РеквизитыПервичногоДокумента);
	КонецЕсли;
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыГоды, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	// Заполнение флажков.
	РеквизитыФлажки.ЗаменаЛетРасчетногоПериода = СЭДОФСС.РасчетныеГодыИзменены(
		ДатаНачалаСобытия,
		ПервыйРасчетныйГод,
		ВторойРасчетныйГод);
	РеквизитыФлажки.ЗаменаЛетВНовомПроцессе = ЕстьВходящийЗапрос
		И (ПервыйРасчетныйГод <> ДанныеВходящегоЗапроса.ПервыйРасчетныйГод
			Или ВторойРасчетныйГод <> ДанныеВходящегоЗапроса.ВторойРасчетныйГод);
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыФлажки, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	// Заполнение заработка.
	Если ЗаменаЛетВНовомПроцессе Тогда // Сведения о заработке не отправляются, будет новый процесс.
		РеквизитыЗаработок.ПервыйРасчетныйГодЗаработок = 0;
		РеквизитыЗаработок.ВторойРасчетныйГодЗаработок = 0;
	КонецЕсли;
	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыЗаработок, ЭтотОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	// Вид заработка очищаетя, т.к. он не отправляется с 3й версии спецификации.
	Реквизиты = Новый Структура("ПервыйРасчетныйГодВидЗаработка, ВторойРасчетныйГодВидЗаработка");
	ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитовШапки(ЭтотОбъект, Реквизиты);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
	
	Возврат ЕстьИзменения;
КонецФункции

Функция ЕстьРасчетныеГоды(Данные)
	Если Данные = Неопределено Тогда
		Возврат Ложь;
	Иначе
		СтруктураПроверки = Новый Структура("ПервыйРасчетныйГод,ВторойРасчетныйГод");
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, Данные);
		Возврат ЗначениеЗаполнено(СтруктураПроверки.ПервыйРасчетныйГод)
			И ЗначениеЗаполнено(СтруктураПроверки.ВторойРасчетныйГод);
	КонецЕсли;
КонецФункции

// Требует: КодСтраныГражданства, КадровыеДанные.
Функция ЗаполнитьВидСтрахованияСотрудника(Особенности)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "СотрудникВидСтрахованияЕЦП") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Не Особенности.Версия_3 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КадровыеДанные = КадровыеДанныеСотрудника();
	ВидЗастрахованногоЛица = ОбщегоНазначенияБЗК.ЗначениеСвойства(КадровыеДанные, "ВидЗастрахованногоЛица");
	НовоеЗначение = СЭДОФСС.ВидСтрахованияСотрудника(ВидЗастрахованногоЛица, КодСтраныГражданства);
	
	Если НовоеЗначение = Неопределено Тогда
		РеквизитыЗапроса = ДанныеВходящегоЗапроса();
		Если РеквизитыЗапроса <> Неопределено И ЗначениеЗаполнено(РеквизитыЗапроса.СотрудникВидСтрахованияЕЦП) Тогда
			НовоеЗначение = РеквизитыЗапроса.СотрудникВидСтрахованияЕЦП;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(СотрудникВидСтрахованияЕЦП, НовоеЗначение);
КонецФункции

// Требует: ДатаНачалаСобытия, Ссылки документов, НомерЛН, ВидПособия, СотрудникКатегория, ОтпускПоУходуДатаНачала,
// ОтпускПоУходуДатаОкончания.
Функция ЗаполнитьПериодОплатыСФР(ПараметрыФиксации, Особенности)
	Реквизиты = Новый Структура("ОплатаФССДатаНачала, ОплатаФССДатаОкончания");
	
	РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента();
	Если РеквизитыПервичногоДокумента <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Реквизиты, РеквизитыПервичногоДокумента);
	КонецЕсли;
	ДатаНачалаЗаполнена = ЗначениеЗаполнено(Реквизиты.ОплатаФССДатаНачала);
	ДатаОкончанияЗаполнена = ЗначениеЗаполнено(Реквизиты.ОплатаФССДатаОкончания);
	
	Если Не ДатаНачалаЗаполнена Или Не ДатаОкончанияЗаполнена Тогда
		ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
		Если ДанныеВходящегоЗапроса <> Неопределено Тогда
			Если Не ДатаНачалаЗаполнена Тогда
				Реквизиты.ОплатаФССДатаНачала = ДанныеВходящегоЗапроса.ОплатаФССДатаНачала;
			КонецЕсли;
			Если Не ДатаОкончанияЗаполнена Тогда
				Реквизиты.ОплатаФССДатаОкончания = ДанныеВходящегоЗапроса.ОплатаФССДатаОкончания;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

#КонецОбласти

#Область ОбработкаПроверкиЗаполнения

Процедура ПроверитьПервичныйДокумент(Отказ)
	Если Не ЗначениеЗаполнено(ПервичныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	ОсновныеСведения = Новый Структура(
		"Представление, Проведен, Рассчитан, Утвержден, ГоловнаяОрганизация, Организация, Сотрудник, ФизическоеЛицо");
	
	// Получение данных документа.
	МенеджерОснования = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПервичныйДокумент);
	Попытка
		МенеджерОснования.ПриПолученииОсновныхСведенийОДокументеДляСЭДО(ПервичныйДокумент, ЭтотОбъект, ОсновныеСведения);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		УчетПособийСоциальногоСтрахования.СообщитьОКритичнойОшибкеОбработчикаСобытия(
			ПервичныйДокумент.Метаданные().ПолноеИмя()
			+ ".ПриПолученииОсновныхСведенийОДокументеДляСЭДО(ПервичныйДокумент, ЭтотОбъект, ОсновныеСведения)",
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
			Ссылка);
		Возврат;
	КонецПопытки;
	Если ОсновныеСведения.Представление = Неопределено Тогда
		ОсновныеСведения.Представление = Строка(ПервичныйДокумент);
	КонецЕсли;
	
	// Проверка проведения и других реквизитов первичного документа.
	Если ОсновныеСведения.Проведен = Ложь Тогда
		Текст = СтрШаблон(НСтр("ru = '%1 не проведен.'"), ОсновныеСведения.Представление);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервичныйДокумент");
	ИначеЕсли ОсновныеСведения.Рассчитан = Ложь Тогда
		Текст = СтрШаблон(НСтр("ru = '%1 не рассчитан.'"), ОсновныеСведения.Представление);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервичныйДокумент");
	ИначеЕсли ОсновныеСведения.Утвержден = Ложь Тогда
		Текст = СтрШаблон(НСтр("ru = '%1 не утвержден.'"), ОсновныеСведения.Представление);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервичныйДокумент");
	ИначеЕсли ЗначениеЗаполнено(ОсновныеСведения.ГоловнаяОрганизация)
		И ОсновныеСведения.ГоловнаяОрганизация <> ГоловнаяОрганизация Тогда
		Текст = СтрШаблон(НСтр("ru = 'В %1 указана другая головная организация - %2 (в ответе на запрос - %3).'"),
			ОсновныеСведения.Представление,
			ОсновныеСведения.ГоловнаяОрганизация,
			ГоловнаяОрганизация);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервичныйДокумент");
	ИначеЕсли ЗначениеЗаполнено(ОсновныеСведения.ФизическоеЛицо)
		И ОсновныеСведения.ФизическоеЛицо <> ФизическоеЛицо Тогда
		Текст = СтрШаблон(НСтр("ru = '%1 оформлен на другое физлицо - %2 (ответ на запрос - на %3).'"),
			ОсновныеСведения.Представление,
			ОсновныеСведения.ФизическоеЛицо,
			ФизическоеЛицо);
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервичныйДокумент");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСведенияОбЭЛН(Отказ)
	ПроверкиБЗК.ПроверитьНомерЛН(Отказ, ЭтотОбъект, "НомерЛН");
КонецПроцедуры

Процедура ПроверитьСведенияОСтрахователе(Отказ, Особенности)
	Если Особенности.Версия_2_41 Тогда
		ПроверитьНомерСтрахователяФСС    = Не Особенности.Версия_3 И ЗначениеЗаполнено(НомерСтрахователяФСС);
		ПроверитьРегистрационныйНомерСФР = ЗначениеЗаполнено(РегистрационныйНомерСФР) Или Не ПроверитьНомерСтрахователяФСС;
	Иначе
		ПроверитьНомерСтрахователяФСС    = Истина;
		ПроверитьРегистрационныйНомерСФР = Ложь;
	КонецЕсли;
	Если ПроверитьНомерСтрахователяФСС Тогда
		ПроверкиБЗК.ПроверитьРегистрационныйНомерФСС(Отказ, ЭтотОбъект, "НомерСтрахователяФСС");
	КонецЕсли;
	Если ПроверитьРегистрационныйНомерСФР Тогда
		ПроверкиБЗК.ПроверитьРегистрационныйНомерСФР(Отказ, ЭтотОбъект, "РегистрационныйНомерСФР");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьСведенияОЗастрахованномЛице(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности)
	ЭтоРезидент = (КодСтраныГражданства = "643");
	
	ПроверяемыеРеквизиты.Добавить("СотрудникФамилия");
	ПроверяемыеРеквизиты.Добавить("СотрудникИмя");
	ПроверяемыеРеквизиты.Добавить("СотрудникКатегория");
	
	// Категория застрахованного лица.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникКатегория");
	
	// СНИЛС.
	Если Не ЗначениеЗаполнено(СотрудникСНИЛС) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникСНИЛС");
	Иначе
		ТекстОшибки = "";
		Если Не РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(СотрудникСНИЛС, ТекстОшибки) Тогда
			Текст = НСтр("ru = 'Ошибка в СНИЛС %1: %2'");
			Текст = СтрШаблон(Текст, СотрудникСНИЛС, ТекстОшибки);
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "СотрудникСНИЛС");
		КонецЕсли;
	КонецЕсли;
	
	// ИНН.
	Если ЗначениеЗаполнено(СотрудникИНН) Тогда
		ТекстОшибки = "";
		Если Не РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(СотрудникИНН, Ложь, ТекстОшибки) Тогда
			Текст = НСтр("ru = 'Ошибка в ИНН %1: %2'");
			Текст = СтрШаблон(Текст, СотрудникИНН, ТекстОшибки);
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "СотрудникИНН");
		КонецЕсли;
	КонецЕсли;
	
	// Дата рождения.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникДатаРождения");
	Если Не Особенности.Версия_3 Тогда
		// ФИО, пол, код страны гражданства.
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникФамилия");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникИмя");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СотрудникПол");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "КодСтраныГражданства");
	КонецЕсли;
	
	// Код статуса налогоплательщика.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "КодСтатусаНалогоплательщика");
	
	// Адрес регистрации.
	Если Не Особенности.Версия_3 И ЗначениеЗаполнено(АдресРегистрацииФИАСДом)
		Или ЗначениеЗаполнено(АдресРегистрацииФИАСРО) Тогда
		ПроверитьАдрес(Отказ, "АдресРегистрации");
	КонецЕсли;
	Если Не Особенности.Версия_3 И Не ЭтоРезидент И Не ЗначениеЗаполнено(АдресРегистрации) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АдресРегистрацииЗаПределамиРФ");
	КонецЕсли;
	
	// Удостоверение личности.
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("Сотрудник",           "Сотрудник");
	ИменаРеквизитов.Вставить("ФизическоеЛицо",      "ФизическоеЛицо");
	ИменаРеквизитов.Вставить("ВидДокумента",        "УдостоверениеЛичностиВид");
	ИменаРеквизитов.Вставить("СерияДокумента",      "УдостоверениеЛичностиСерия");
	ИменаРеквизитов.Вставить("НомерДокумента",      "УдостоверениеЛичностиНомер");
	ИменаРеквизитов.Вставить("ДатаВыдачиДокумента", "УдостоверениеЛичностиДатаВыдачи");
	ИменаРеквизитов.Вставить("КемВыданДокумент",    "УдостоверениеЛичностиКемВыдан");
	ПрямыеВыплатыПособийСоциальногоСтрахования.ПроверитьДокументУдостоверяющийЛичность(Отказ, ЭтотОбъект, ИменаРеквизитов);
	
	СведенияОВидеДокумента = СЭДОФССПовтИсп.СведенияОВидеДокумента(УдостоверениеЛичностиВид);
	Если ЗначениеЗаполнено(УдостоверениеЛичностиВид) И Не ЗначениеЗаполнено(СведенияОВидеДокумента.КодМВД) Тогда
		Текст = НСтр("ru = 'Не заполнен код вида документа, удостоверяющего личность'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, УдостоверениеЛичностиВид, Текст, "КодМВД");
	КонецЕсли;
	Если ЗначениеЗаполнено(УдостоверениеЛичностиВид)
		И Не ЗначениеЗаполнено(УдостоверениеЛичностиСрокДействия)
		И Документы.СведенияОЗастрахованномЛицеФСС.ЭтоВременноеУдостоверениеЛичности(СведенияОВидеДокумента.КодМВД) Тогда
		Текст = НСтр("ru = 'Не заполнен срок действия документа, удостоверяющего личность'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "УдостоверениеЛичностиСрокДействия");
	ИначеЕсли ЗначениеЗаполнено(УдостоверениеЛичностиСрокДействия)
		И УдостоверениеЛичностиСрокДействия < ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()) Тогда
		Текст = НСтр("ru = 'Истек срок действия документа, удостоверяющего личность (%1)'");
		Текст = СтрШаблон(Текст, Формат(УдостоверениеЛичностиСрокДействия, "ДЛФ=D"));
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "УдостоверениеЛичностиСрокДействия");
	КонецЕсли;
	
	// Сведения о документах, подтверждающих постоянное или временное проживание (пребывание) на территории РФ
	// (для иностранных граждан и лиц без гражданства).
	ПроверитьРазрешениеНаПроживание(Отказ);
	
	// Срочный трудовой договор.
	Если (СведенияОВидеПособия.ЭтоОбычныйБольничный
		Или СведенияОВидеПособия.ЭтоНСПЗ
		Или СведенияОВидеПособия.ЭтоПособиеПриРождении) Тогда
		Если ЗначениеЗаполнено(ТрудовойДоговорДатаОкончания) Тогда
			ТекстОшибки = ПроверкиБЗККлиентСервер.ТекстОшибкиЗаполненияПериода(ТрудовойДоговорДатаНачала, ТрудовойДоговорДатаОкончания);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ТекстОшибки = СтрШаблон(ТекстОшибки, ?(ВидДоговораГПХ, НСтр("ru = 'договора ГПХ'"), НСтр("ru = 'срочного трудового договора'")));
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, ТекстОшибки, "ТрудовойДоговорДатаНачала");
			КонецЕсли;
		КонецЕсли;
		Если ВидДоговораГПХ И Не ЗначениеЗаполнено(ТрудовойДоговорДатаНачала) Тогда
			ТекстОшибки = НСтр("ru = 'Не заполнена дата начала договора ГПХ.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, ТекстОшибки, "ТрудовойДоговорДатаНачала");
		КонецЕсли;
		Если Не ВидДоговораГПХ И ЗначениеЗаполнено(ТрудовойДоговорДатаНачала) И ЗначениеЗаполнено(ТрудовойДоговорДатаОкончания) Тогда
			// Заболевание (травма) наступили в течение 30 календарных дней со дня прекращения работы
			ТрудовойДоговорДатаОкончанияПроверка = ТрудовойДоговорДатаОкончания + 30 * 86400;
			Если ДатаНачалаСобытия > ТрудовойДоговорДатаОкончанияПроверка Тогда
				Текст = НСтр("ru = 'Срочный трудовой договор закончился (%1) до начала страхового случая (%2)'");
				Текст = СтрШаблон(Текст, Формат(ТрудовойДоговорДатаОкончания, "ДЛФ=D"), Формат(ДатаНачалаСобытия, "ДЛФ=D"));
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ТрудовойДоговорДатаОкончания");
			КонецЕсли;
			Если Не СведенияОВидеПособия.ЭтоПособиеПриРождении
				И Не УчетПособийСоциальногоСтрахования.ИспользуетсяУсловиеИсчисления(ЭтотОбъект, "46")
				И ТрудовойДоговорДатаОкончания <= ДобавитьМесяц(ТрудовойДоговорДатаНачала, 6) Тогда
				Текст = НСтр("ru = 'ERR_PR_1007: При указании срочного трудового договора менее 6 месяцев необходимо заполнить условия исчисления: код 46'");
				ИмяРеквизита = ?(Не ЗначениеЗаполнено(УсловияИсчисленияКод1), "УсловияИсчисленияКод1",
							   ?(Не ЗначениеЗаполнено(УсловияИсчисленияКод2), "УсловияИсчисленияКод2", "УсловияИсчисленияКод3"));
				// Выводим предупреждение без отказа
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Неопределено, ЭтотОбъект, Текст, ИмяРеквизита);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СведенияОВидеПособия.ЭтоПособиеПриРождении Или СведенияОВидеПособия.ЭтоОтпускПоУходу Тогда
		ПроверяемыеРеквизиты.Добавить("РебенокКодСвязи");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСпособВыплаты(Отказ, ПроверяемыеРеквизиты, Особенности)
	
	Если СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ПочтовымПереводом Тогда
		ПроверитьАдрес(Отказ, "АдресПроживания");
	ИначеЕсли СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.НаКартуМИР Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "КартаМИР");
	ИначеЕсли СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк Тогда
		Если ЗначениеЗаполнено(БанкБИК) И ЗначениеЗаполнено(НомерСчета) Тогда
			РезультатПроверки = ПроверкиБЗК.РезультатПроверкиНомераСчета(НомерСчета, БанкБИК, БанкКоррСчет);
			Если Не РезультатПроверки.Успех Тогда
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, РезультатПроверки.Пояснение, "НомерСчета");
			КонецЕсли;
		Иначе
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "Банк");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "БанкБИК");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "НомерСчета");
		КонецЕсли;
		Если Не Особенности.Версия_3 Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "БанкНаименование");
		КонецЕсли;
	ИначеЕсли СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ИнаяОрганизация Тогда
		ПроверяемыеРеквизиты.Добавить("ИнаяОрганизацияНаименование");
		ПроверяемыеРеквизиты.Добавить("ИнаяОрганизацияНомерСчетаСтрахователя");
		Если СотрудникКатегория <> "PRISONER" И СотрудникКатегория <> "2" Тогда
			Текст = СтрШаблон(
				НСтр("ru = 'Способ выплаты пособия ""%1"" доступен только для застрахованных лиц осужденных к лишению свободы.'"),
				СпособВыплатыПособия);
			// По какой-то причине платформа не позиционирует сообщение на поле переключателя "СпособВыплатыПособия", 
			// поэтому сообщение привязывается к следующему за ним полю ввода "ИнаяОрганизацияНаименование".
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ИнаяОрганизацияНаименование");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеДляРасчета(Отказ, СведенияОВидеПособия, ПроверяемыеРеквизиты, Особенности)
	
	Если СведенияОВидеПособия.ЭтоОбычныйБольничный
		Или СведенияОВидеПособия.ЭтоНСПЗ
		Или СведенияОВидеПособия.ЭтоБольничныйПоБиР Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "КалендарныхДнейРасчетногоПериода");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПервыйРасчетныйГод");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ВторойРасчетныйГод");
	КонецЕсли;
	
	// Районный коэффициент.
	СЭДОФСС.ПроверитьРайонныйКоэффициент(Отказ, ЭтотОбъект, "РайонныйКоэффициент", Ложь);
	
	// ERR_PR_1029: Значение поля sumType недопустимо для редактирования.
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	Если Не Особенности.Версия_3 И ДанныеВходящегоЗапроса <> Неопределено Тогда
		Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ПервыйРасчетныйГодВидЗаработка)
			И ДанныеВходящегоЗапроса.ПервыйРасчетныйГодВидЗаработка <> ПервыйРасчетныйГодВидЗаработка Тогда
			Текст = НСтр("ru = 'Изменен вид заработка первого года по сравнению со входящим запросом.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПервыйРасчетныйГодВидЗаработка");
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеВходящегоЗапроса.ВторойРасчетныйГодВидЗаработка)
			И ДанныеВходящегоЗапроса.ВторойРасчетныйГодВидЗаработка <> ВторойРасчетныйГодВидЗаработка Тогда
			Текст = НСтр("ru = 'Изменен вид заработка второго года по сравнению со входящим запросом.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ВторойРасчетныйГодВидЗаработка");
		КонецЕсли;
	КонецЕсли;
	
	Если СведенияОВидеПособия.ЭтоОбычныйБольничный
		Или СведенияОВидеПособия.ЭтоНСПЗ Тогда
		
		Если Особенности.Версия_3 Тогда
			// Период освобождения от работы.
			ПроверитьПериодОсвобожденияОтРаботы(Отказ, ПроверяемыеРеквизиты);
		Иначе
			// Период за который начисляется пособие ФСС.
			ПроверитьПериодОплатыСФР(Отказ, ПроверяемыеРеквизиты);
		КонецЕсли;
		
		// Периоды за которые не начисляется пособие за счет ФСС.
		ПроверитьИсключаемыеПериоды(Отказ, ПроверяемыеРеквизиты, Особенности);
		
		// Периоды простоя.
		ПроверитьПериодыПростоя(Отказ, ПроверяемыеРеквизиты);
		
		// Приостановления трудовых договоров.
		Если Особенности.Версия_2_45 Тогда
			ПроверитьПриостановленияТД_2_45(Отказ, ПроверяемыеРеквизиты);
		Иначе
			ПроверитьПриостановленияТД_2_43(Отказ, ПроверяемыеРеквизиты);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПериодОсвобожденияОтРаботы(Отказ, ПроверяемыеРеквизиты)
	ПроверкиБЗК.ПроверитьПериод(
		Отказ,
		ЭтотОбъект,
		"ОтпускПоУходуДатаНачала",
		"ОтпускПоУходуДатаОкончания",
		НСтр("ru = 'освобождения от работы'"),
		Истина);
КонецПроцедуры

Процедура ПроверитьПериодОплатыСФР(Отказ, ПроверяемыеРеквизиты)
	Если Не ПроверкиБЗК.ПроверитьПериод(
		Отказ,
		ЭтотОбъект,
		"ОплатаФССДатаНачала",
		"ОплатаФССДатаОкончания",
		НСтр("ru = 'оплаты за счет СФР'"),
		Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	Если (СотрудникКатегория = "ENDOFMILITARY" Или СотрудникКатегория = "4")
		И ЗначениеЗаполнено(НомерЛН)
		И ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоВременнойНетрудоспособности Тогда
		СведенияОбЭЛН = РегистрыСведений.СведенияОбЭЛН.СведенияОбЭЛН(НомерЛН, ГоловнаяОрганизация);
		Если СведенияОбЭЛН <> Неопределено
			И СведенияОбЭЛН.ПричинаНетрудоспособности = Перечисления.ПричиныНетрудоспособности.ОбщееЗаболевание
			И ОплатаФССДатаНачала > СведенияОбЭЛН.ПериодНетрудоспособностиНачало Тогда
			ПредставлениеКатегории = НСтр("ru = 'Лицо, в период приостановления ТД после окончания военной службы'");
			Текст = НСтр("ru = 'Пособие %1 сотрудника с категорией ""%2"" (%3) оплачивается за счет СФР с 1го дня нетрудоспособности (%4)'");
			Текст = СтрШаблон(Текст,
				СведенияОбЭЛН.ПричинаНетрудоспособности,
				ПредставлениеКатегории,
				СотрудникКатегория,
				СведенияОбЭЛН.ПериодНетрудоспособностиНачало);
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ОплатаФССДатаНачала");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПараметрыНазначения(Отказ, СведенияОВидеПособия, Особенности)
	Если Не Особенности.Версия_2_34 Тогда
		Возврат;
	КонецЕсли;
	
	Если Особенности.Версия_3 Или Не Перерасчет Тогда
		
		Если Не Особенности.Версия_3 Или Не СведенияОВидеПособия.ЭтоПособиеПриРождении Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "МетодНазначенияИВыплатыПособия");
		КонецЕсли;
		
		// Из спецификации: Поле ВыборПодтвержденЗастрахованнымЛицом обязательно для заполнения
		// если застрахованное лицо трудоустроено по трудовому договору, занято у нескольких страхователей,
		// а также метод назначения пособия "По одному из страхователей по трудовому договору".
		Если СведенияОВидеПособия.ЭтоОбычныйБольничный
			Или СведенияОВидеПособия.ЭтоБольничныйПоБиР
			Или (Особенности.Версия_3 И СведенияОВидеПособия.ЭтоНСПЗ)
			Или (Не Особенности.Версия_3 И СведенияОВидеПособия.ЭтоОтпускПоУходу) Тогда
			Если Не ВыборПодтвержденЗастрахованнымЛицом
				И ВидДоговораТрудовой
				И ЧислитсяУНесколькихСтрахователей
				И (МетодНазначенияИВыплатыПособия = Перечисления.МетодыНазначенияИВыплатыПособийСФР.ПоОдномуСтрахователю
					Или МетодНазначенияИВыплатыПособия = Перечисления.МетодыНазначенияИВыплатыПособийСФР.ПоОдномуСтрахователюПоТД) Тогда
				Текст = НСтр("ru = 'Поскольку сотрудник числится у нескольких страхователей, то необходимо получить потверждение сотрудника на использование метода назначения пособия ""%1"" и включить соответствующий флажок'");
				Текст = СтрШаблон(Текст, МетодНазначенияИВыплатыПособия);
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ВыборПодтвержденЗастрахованнымЛицом");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СведенияОВидеПособия.ЭтоОбычныйБольничный
		Или СведенияОВидеПособия.ЭтоБольничныйПоБиР Тогда
		Если Не ВидДоговораТрудовой И Не ВидДоговораГПХ Тогда
			Текст = НСтр("ru = 'Не заполнен вид договора'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ВидДоговораТрудовой");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДанныеНСПЗ(Отказ, СведенияОВидеПособия)
	Если СведенияОВидеПособия.ЭтоНСПЗ Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПризнаниеСлучаяСтраховым");
	КонецЕсли;
	ЕстьАктН1 = ЗначениеЗаполнено(АктН1Номер) Или ЗначениеЗаполнено(АктН1ДатаВыдачи);
	Если ЕстьАктН1 Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктН1Номер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктН1ДатаВыдачи");
	КонецЕсли;
	ЕстьАктПФ = ЗначениеЗаполнено(АктВПроизвольнойФормеНомер) Или ЗначениеЗаполнено(АктВПроизвольнойФормеДатаВыдачи);
	Если ЕстьАктПФ Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктВПроизвольнойФормеНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктВПроизвольнойФормеДатаВыдачи");
	КонецЕсли;
	ЕстьРешениеСуда = ЗначениеЗаполнено(РешениеСудаНомер) Или ЗначениеЗаполнено(РешениеСудаДатаВыдачи);
	Если ЕстьРешениеСуда Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РешениеСудаНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РешениеСудаДатаВыдачи");
	КонецЕсли;
	Если СведенияОВидеПособия.ЭтоНСПЗ
		И Не ЕстьАктН1
		И Не ЕстьАктПФ
		И Не ЕстьРешениеСуда
		И Не ЗначениеЗаполнено(АктПЗДатаВыдачи) Тогда
		Текст = НСтр("ru = 'Требуется заполнить документы НС/ПЗ'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "АктН1Номер");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьИсключаемыеПериоды(Отказ, ПроверяемыеРеквизиты, Особенности)
	ПроверяемыеРеквизиты.Добавить("ИсключаемыеПериоды.ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ИсключаемыеПериоды.ДатаОкончания");
	ПроверятьДатыЗаСчетРаботодателя = Ложь;
	ЗаСчетРаботодателяДатаНачала = Неопределено;
	ЗаСчетРаботодателяДатаОкончания = Неопределено;
	Если Особенности.Версия_3
		И ЗначениеЗаполнено(НомерЛН)
		И ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоВременнойНетрудоспособности
		И ЗначениеЗаполнено(ДатаНачалаСобытия)
		И ЗначениеЗаполнено(ОтпускПоУходуДатаНачала) Тогда
		СведенияОбЭЛН = СведенияОбЭЛН();
		Если СведенияОбЭЛН <> Неопределено Тогда
			НачалоВПериодПриостановленияТД = (СотрудникКатегория = "4");
			КоличествоДнейЗаСчетРаботодателя = УчетПособийСоциальногоСтрахования.КоличествоДнейЗаСчетРаботодателя(
				ДатаНачалаСобытия, СведенияОбЭЛН.ПричинаНетрудоспособности, НачалоВПериодПриостановленияТД);
			Если КоличествоДнейЗаСчетРаботодателя > 0 Тогда
				ЗаСчетРаботодателяДатаНачала = Макс(ДатаНачалаСобытия, ОтпускПоУходуДатаНачала);
				ЗаСчетРаботодателяДатаОкончания = Мин(ДатаНачалаСобытия + 86400 * (КоличествоДнейЗаСчетРаботодателя-1),
					ОтпускПоУходуДатаОкончания);
				Если ЗаСчетРаботодателяДатаНачала <= ЗаСчетРаботодателяДатаОкончания Тогда
					ПроверятьДатыЗаСчетРаботодателя = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ИсключаемыйПериод Из ИсключаемыеПериоды Цикл
		ПериодКорректный = ПроверкиБЗК.ПроверитьПериодВСтрокеТаблицы(
			Отказ,
			ЭтотОбъект,
			"ИсключаемыеПериоды",
			ИсключаемыйПериод,
			"ДатаНачала",
			"ДатаОкончания",
			НСтр("ru = 'исключаемого периода'"));
		Если Не ПериодКорректный Тогда
			// Если периоды содержат ошибки, то не имеет смысла применять к ним еще более детальные требования.
			ПроверятьДатыЗаСчетРаботодателя = Ложь;
		ИначеЕсли ПроверятьДатыЗаСчетРаботодателя
			И ИсключаемыйПериод.ДатаНачала <= ЗаСчетРаботодателяДатаОкончания
			И ИсключаемыйПериод.ДатаОкончания >= ЗаСчетРаботодателяДатаНачала Тогда
			Если ИсключаемыйПериод.ДатаНачала <= ЗаСчетРаботодателяДатаНачала Тогда
				ЗаСчетРаботодателяДатаНачала = ИсключаемыйПериод.ДатаОкончания + 86400;
			КонецЕсли;
			Если ИсключаемыйПериод.ДатаОкончания >= ЗаСчетРаботодателяДатаОкончания Тогда
				ЗаСчетРаботодателяДатаОкончания = ИсключаемыйПериод.ДатаНачала - 86400;
			КонецЕсли;
			Если ЗаСчетРаботодателяДатаНачала > ЗаСчетРаботодателяДатаОкончания Тогда
				ПроверятьДатыЗаСчетРаботодателя = Ложь;
			КонецЕсли;
		КонецЕсли;
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаСтрокиТаблицы(
			Отказ,
			ЭтотОбъект,
			"ИсключаемыеПериоды",
			ИсключаемыйПериод,
			"Причина");
	КонецЦикла;
	
	Если ПроверятьДатыЗаСчетРаботодателя Тогда
		Текст = НСтр("ru = '[ERR_PR_1141] Необходимо указать исключаемый период с типом ""Оплата 3-х дней за счет страхователя""'");
		ПроверкиБЗК.СообщитьОбОшибкеЗаполненияРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИсключаемыеПериоды", Текст);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПериодыПростоя(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("ПериодыПростоя.ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ПериодыПростоя.ДатаОкончания");
	Для Каждого ПериодПростоя Из ПериодыПростоя Цикл
		ПроверкиБЗК.ПроверитьПериодВСтрокеТаблицы(
			Отказ,
			ЭтотОбъект,
			"ПериодыПростоя",
			ПериодПростоя,
			"ДатаНачала",
			"ДатаОкончания",
			НСтр("ru = 'периода простоя'"));
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаСтрокиТаблицы(
			Отказ,
			ЭтотОбъект,
			"ПериодыПростоя",
			ПериодПростоя,
			"СреднийЗаработок");
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПриостановленияТД_2_43(Отказ, ПроверяемыеРеквизиты)
	Для Каждого Период Из ПриостановленияТрудовыхДоговоров Цикл
		ПроверкиБЗК.ПроверитьПериодВСтрокеТаблицы(
			Отказ,
			ЭтотОбъект,
			"ПриостановленияТрудовыхДоговоров",
			Период,
			"ДатаНачала",
			"ДатаОкончания",
			НСтр("ru = 'приостановления трудового договора'"));
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаСтрокиТаблицы(
			Отказ,
			ЭтотОбъект,
			"ПриостановленияТрудовыхДоговоров",
			Период,
			"ОснованиеНПА");
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПриостановленияТД_2_45(Отказ, ПроверяемыеРеквизиты)
	ДанныеВходящегоЗапроса = ДанныеВходящегоЗапроса();
	Если ДанныеВходящегоЗапроса <> Неопределено
		И ПриостановлениеТДКалендарныхДней <> ДанныеВходящегоЗапроса.ПриостановлениеТДКалендарныхДней Тогда
		Текст = НСтр("ru = 'Изменено количество дней приостановления ТД по сравнению со входящим запросом.'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПриостановлениеТДКалендарныхДней");
	КонецЕсли;
	Если ЗначениеЗаполнено(ПриостановлениеТДПримечание)
		И Не ПриостановлениеТДВыгружатьПримечание Тогда
		Текст = НСтр("ru = 'Заполнено примечание к приостановлению ТД, но не включен флажок подтверждения.'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "ПриостановлениеТДВыгружатьПримечание");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьИзвещение(Отказ)
	Если ЗначениеЗаполнено(ИзвещениеФССДата) Или ЗначениеЗаполнено(ИзвещениеФССНомер) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИзвещениеФССДата");
		СЭДОФСС.ПроверитьНомерИзвещенияФСС(Отказ, ЭтотОбъект, "ИзвещениеФССНомер");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьСведенияОбОтпуске(Отказ)
	Если Не ЗначениеЗаполнено(ОтпускПоУходуНомер)
		И Не ЗначениеЗаполнено(ОтпускПоУходуДата)
		И Не ЗначениеЗаполнено(ОтпускПоУходуДатаНачала)
		И Не ЗначениеЗаполнено(ОтпускПоУходуДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ОтпускПоУходуНомер");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ОтпускПоУходуДата");
	ПроверкиБЗК.ПроверитьПериод(
		Отказ,
		ЭтотОбъект,
		"ОтпускПоУходуДатаНачала",
		"ОтпускПоУходуДатаОкончания",
		НСтр("ru = 'отпуска по уходу'"),
		Ложь);
КонецПроцедуры

Процедура ПроверитьИнформациюОбУсыновленииОпеке(Отказ)
	// Данные об усыновлении/опеке.
	Если Не ЗначениеЗаполнено(УсыновлениеОпекаТип)
		И Не ЗначениеЗаполнено(УсыновлениеОпекаНомер)
		И Не ЗначениеЗаполнено(УсыновлениеОпекаДата)
		И Не ЗначениеЗаполнено(ПередачаНаВоспитаниеНомер)
		И Не ЗначениеЗаполнено(ПередачаНаВоспитаниеДата) Тогда
		Возврат;
	КонецЕсли;
	// Тип, Номер, Дата выдачи.
	Если УсыновлениеОпекаТип = "2" Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "УсыновлениеОпекаНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "УсыновлениеОпекаДата");
	ИначеЕсли УсыновлениеОпекаТип = "1" Тогда
		Если ЗначениеЗаполнено(ПередачаНаВоспитаниеНомер) Или ЗначениеЗаполнено(ПередачаНаВоспитаниеДата) Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПередачаНаВоспитаниеНомер");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПередачаНаВоспитаниеДата");
		ИначеЕсли ЗначениеЗаполнено(УсыновлениеОпекаНомер) Или ЗначениеЗаполнено(УсыновлениеОпекаДата) Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "УсыновлениеОпекаНомер");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "УсыновлениеОпекаДата");
		Иначе
			Текст = НСтр("ru = 'Необходимо заполнить данные опеки или договор о передаче на воспитание в приемную семью.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "УсыновлениеОпекаНомер");
		КонецЕсли;
	Иначе
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "УсыновлениеОпекаТип");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьИнформациюОПередачеНаВоспитание(Отказ)
	// Документ о передаче в приемную семью.
	Если Не ЗначениеЗаполнено(ПередачаНаВоспитаниеДата)
		И Не ЗначениеЗаполнено(ПередачаНаВоспитаниеНомер) Тогда
		Возврат;
	КонецЕсли;
	// Номер, Дата выдачи документа о передаче в приемную семью.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПередачаНаВоспитаниеДата");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ПередачаНаВоспитаниеНомер");
КонецПроцедуры

Процедура ПроверитьИнформациюОРебенкеПособияПриРождении(Отказ, Особенности)
	// Данные о актовой записи ЗАГС.
	ЕстьАктоваяЗаписьЗАГС = (ЗначениеЗаполнено(АктоваяЗаписьОРожденииНомер)
		Или ЗначениеЗаполнено(АктоваяЗаписьОРожденииДата));
	Если ЕстьАктоваяЗаписьЗАГС Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктоваяЗаписьОРожденииНомер");
		Если Не ПустаяСтрока(АктоваяЗаписьОРожденииНомер) И СтрДлина(АктоваяЗаписьОРожденииНомер) <> 21 Тогда
			Текст = НСтр("ru = 'Для поля ""Актовая запись (реестровая запись) о рождении"" установлена длина номера 21, проверьте корректность введенного номера.'");
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "АктоваяЗаписьОРожденииНомер");
		КонецЕсли;
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктоваяЗаписьОРожденииДата");
	КонецЕсли;
	
	// Свидетельство о рождении.
	ЕстьСвидетельствоОРождении = ЗначениеЗаполнено(СвидетельствоОРожденииСерияНомер)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииСерия)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииНомер)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииДатаВыдачи);
	Если ЕстьСвидетельствоОРождении Тогда
		Если Не ЗначениеЗаполнено(СвидетельствоОРожденииСерияНомер) Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииСерия");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииНомер");
		КонецЕсли;
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииДатаВыдачи");
	КонецЕсли;
	
	// Справка о рождении.
	ЕстьСправкаОРождении = (ЗначениеЗаполнено(СправкаОРожденииФорма)
		Или ЗначениеЗаполнено(СправкаОРожденииНомер)
		Или ЗначениеЗаполнено(СправкаОРожденииДатаВыдачи));
	Если ЕстьСправкаОРождении Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОРожденииФорма");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОРожденииНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОРожденииДатаВыдачи");
	КонецЕсли;
	
	// Иной документ подтверждающий рождение ребенка.
	ЕстьИнойДокумент = (ЗначениеЗаполнено(ИнойДокументОРожденииСерия)
		Или ЗначениеЗаполнено(ИнойДокументОРожденииНомер)
		Или ЗначениеЗаполнено(ИнойДокументОРожденииДатаВыдачи));
	Если ЕстьИнойДокумент Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИнойДокументОРожденииНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИнойДокументОРожденииДатаВыдачи");
	КонецЕсли;
	
	// Должен быть хотя бы один документ о рождении.
	Если Не ЕстьАктоваяЗаписьЗАГС
		И Не ЕстьСвидетельствоОРождении
		И Не ЕстьСправкаОРождении
		И Не ЕстьИнойДокумент Тогда
		Текст = НСтр("ru = 'Требуется заполнить документ о рождении'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "СвидетельствоОРожденииСерия");
	КонецЕсли;
	
	// ФИО, СНИЛС, Дата рождения, пол ребенка.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокФамилия");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокИмя");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокДатаРождения");
	Если ЗначениеЗаполнено(РебенокСНИЛС) Или Не ЗначениеЗаполнено(РебенокПол) Тогда
		ПроверкиБЗК.ПроверитьСНИЛС(Отказ, ЭтотОбъект, "РебенокСНИЛС");
	КонецЕсли;
	Если Особенности.Версия_2_45 Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокПол");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИнформациюОДругомРодителе(Отказ, Особенности)
	
	// Справка от другого родителя о неполучении пособия.
	Если Не Особенности.Версия_3 И ЗначениеЗаполнено(СправкаОтДругогоРодителяНомер) Или ЗначениеЗаполнено(СправкаОтДругогоРодителяДата) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОтДругогоРодителяНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОтДругогоРодителяДата");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьИнформациюОРебенкеОтпускаПоУходу(Отказ, Особенности)
	// ФИО, СНИЛС, Дата рождения ребенка.
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокИмя");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокФамилия");
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокДатаРождения");
	// Обязательность СНИЛС определяется документом ИсходящееСообщениеОСтраховомСлучаеФСС.
	Если ЗначениеЗаполнено(РебенокСНИЛС) Тогда
		ПроверкиБЗК.ПроверитьСНИЛС(Отказ, ЭтотОбъект, "РебенокСНИЛС");
	КонецЕсли;
	Если Особенности.Версия_2_45 Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокПол");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьОснованияДляОтпускаПоУходу(Отказ)
	ПроверкиБЗК.ПроверитьПериод(
		Отказ,
		ЭтотОбъект,
		"ОтпускПоУходуДатаНачала",
		"ОтпускПоУходуДатаОкончания",
		НСтр("ru = 'отпуска по уходу'"));
	
	Если ЗначениеЗаполнено(ОтпускПоУходуНомер) <> ЗначениеЗаполнено(ОтпускПоУходуДата) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ОтпускПоУходуНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ОтпускПоУходуДата");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаменаПослеродовогоОтпускаНомер) <> ЗначениеЗаполнено(ЗаменаПослеродовогоОтпускаДата) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ЗаменаПослеродовогоОтпускаНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ЗаменаПослеродовогоОтпускаДата");
	КонецЕсли;
	
	// Свидетельство о рождении.
	ЕстьСвидетельствоОРождении = ЗначениеЗаполнено(СвидетельствоОРожденииСерия)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииНомер)
		Или ЗначениеЗаполнено(СвидетельствоОРожденииДатаВыдачи);
	Если ЕстьСвидетельствоОРождении Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииСерия");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СвидетельствоОРожденииДатаВыдачи");
	КонецЕсли;
	
	// Иной документ подтверждающий рождение ребенка.
	ЕстьИнойДокумент = (ЗначениеЗаполнено(ИнойДокументОРожденииСерия)
		Или ЗначениеЗаполнено(ИнойДокументОРожденииНомер)
		Или ЗначениеЗаполнено(ИнойДокументОРожденииДатаВыдачи));
	Если ЕстьИнойДокумент Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИнойДокументОРожденииНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "ИнойДокументОРожденииДатаВыдачи");
	КонецЕсли;
	
	// Данные о актовой записи ЗАГС.
	ЕстьАктоваяЗаписьЗАГС = (ЗначениеЗаполнено(АктоваяЗаписьОРожденииНомер)
		Или ЗначениеЗаполнено(АктоваяЗаписьОРожденииДата));
	Если ЕстьАктоваяЗаписьЗАГС Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктоваяЗаписьОРожденииНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "АктоваяЗаписьОРожденииДата");
	КонецЕсли;
	
	// Должен быть хотя бы один документ о рождении.
	Если Не ЕстьАктоваяЗаписьЗАГС
		И Не ЕстьСвидетельствоОРождении
		И Не ЕстьИнойДокумент Тогда
		Текст = НСтр("ru = 'Требуется заполнить документ о рождении'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "СвидетельствоОРожденииСерия");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСправкуОНеполученииПособия(Отказ)
	Если ЗначениеЗаполнено(СправкаОНеполученииПособияОтМатериНомер)
		<> ЗначениеЗаполнено(СправкаОНеполученииПособияОтМатериДатаВыдачи) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОНеполученииПособияОтМатериНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОНеполученииПособияОтМатериДатаВыдачи");
	КонецЕсли;
	Если ЗначениеЗаполнено(СправкаОНеполученииПособияОтОтцаНомер)
		<> ЗначениеЗаполнено(СправкаОНеполученииПособияОтОтцаДатаВыдачи) Тогда
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОНеполученииПособияОтОтцаНомер");
		ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "СправкаОНеполученииПособияОтОтцаДатаВыдачи");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПрочиеСведенияОтпускаПоУходу(Отказ)
	ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РебенокОчередность");
	Если РебенокОчередность > 1
		И Не НаличиеДокументовОРожденииПредыдущихДетей
		И Не НаличиеСвидетельстваОСмертиПредыдущихДетей Тогда
		Текст = НСтр("ru = 'Для второго и последующих детей должен быть включен один из флажков наличия документов на предыдущих детей.'");
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "НаличиеДокументовОРожденииПредыдущихДетей");
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьАдрес(Отказ, ИмяПоляАдрес)
	ТекстОшибки = ТекстОшибкиЗаполненияАдреса(ИмяПоляАдрес);
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Текст = Метаданные().Реквизиты[ИмяПоляАдрес].Представление() + ": " + ТекстОшибки;
		СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, ИмяПоляАдрес);
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьРазрешениеНаПроживание(Отказ)
	Если Не ПустаяСтрока(КодСтраныГражданства) И Не СЭДОФСС.ГражданствоРФ(КодСтраныГражданства) Тогда
		Если Не ЗначениеЗаполнено(РазрешениеНаПроживаниеВид) Тогда
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РазрешениеНаПроживаниеВид");
		Иначе
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РазрешениеНаПроживаниеНомер");
			ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РазрешениеНаПроживаниеДатаВыдачи");
			СведенияОВиде = СЭДОФСС.СведенияОВидеРазрешенияНаПроживание(РазрешениеНаПроживаниеВид);
			Если СведенияОВиде.ЭтоВНЖ Тогда
				ПроверкиБЗК.ПроверитьЗаполнениеРеквизитаОбъекта(Отказ, ЭтотОбъект, "РазрешениеНаПроживаниеСерия");
			КонецЕсли;
			Массив = Документы.ОтветНаЗапросФССДляРасчетаПособия.ДопустимыеКодыВидаРазрешенияНаПроживание();
			Если Массив.Найти(СведенияОВиде.КодМВД) = Неопределено Тогда
				Текст = НСтр("ru = 'Недопустимый вид разрешения на проживания: %1, Фонд допускает только следующие виды: %2'");
				Текст = СтрШаблон(Текст, СведенияОВиде.КодМВД, СтрСоединить(Массив, ", "));
				СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ЭтотОбъект, Текст, "РазрешениеНаПроживаниеВид");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ТекстОшибкиЗаполненияАдреса(ИмяПоляАдрес)
	ЗначениеАдреса = ЭтотОбъект[ИмяПоляАдрес];
	Если Не ЗначениеЗаполнено(ЗначениеАдреса) Тогда
		Возврат НСтр("ru = 'Адрес не заполнен'");
	КонецЕсли;
	
	ТекстыОшибок = Новый Массив;
	
	Индекс  = ЭтотОбъект[ИмяПоляАдрес + "Индекс"];
	ФИАСДом = ЭтотОбъект[ИмяПоляАдрес + "ФИАСДом"];
	ФИАСРО  = ЭтотОбъект[ИмяПоляАдрес + "ФИАСРО"];
	
	Если Не ЗначениеЗаполнено(Индекс) Тогда
		ТекстыОшибок.Добавить(НСтр("ru = 'Не заполнен индекс.'"));
	ИначеЕсли СтрДлина(Индекс) <> 6 Тогда
		ТекстыОшибок.Добавить(СтрШаблон(НСтр("ru = 'Индекс занимает %1 символов, ожидалось 6.'"), СтрДлина(Индекс)));
	Иначе
		ЛишниеСимволы = СтроковыеФункцииБЗККлиентСервер.УдалитьЦифрыИзСтроки(Индекс);
		Если Не ПустаяСтрока(ЛишниеСимволы) Тогда
			Если СтрДлина(ЛишниеСимволы) = 1 Тогда
				Текст = НСтр("ru = 'В индексе должны быть только цифры (%1 - не цифра).'");
			Иначе
				Текст = НСтр("ru = 'В индексе должны быть только цифры (%1 - не цифры).'");
			КонецЕсли;
			ТекстыОшибок.Добавить(СтрШаблон(Текст, ЛишниеСимволы));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФИАСДом) И Не ЗначениеЗаполнено(ФИАСРО) Тогда
		ТекстыОшибок.Добавить(НСтр("ru = 'Не заполнен идентификатор ФИАС.'"));
	КонецЕсли;
	
	Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
