#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееЗначение = Константы.ИнтеграцияС1САрхивом.Получить();
	ДополнительныеСвойства.Вставить("ЗначениеИзменено", Значение <> ПредыдущееЗначение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменСАрхивомПереопределяемый.ПриЗаписиКонстантыИнтеграцияС1САрхивом(ЭтотОбъект, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Если обмен был выключен и его включили, выполняется:
	// - регистрация к обмену всех объектов НСИ
	// - отправка сообщения о поддерживаемой версии формата.
	
	Если Значение <> Истина Или Не ДополнительныеСвойства.ЗначениеИзменено Тогда 
		Возврат;
	КонецЕсли;
	
	УзелАрхив = ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив();
	Для Каждого ЭлементСостава Из Метаданные.ПланыОбмена.ОбменНСИСАрхивом.Состав Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(УзелАрхив, ЭлементСостава.Метаданные);
	КонецЦикла;
	
	ОбменСАрхивом.СформироватьСообщениеОВерсииФормата();
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
