
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.МедицинскийОсмотр");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОсмотра", ВидОсмотра);
	
	ОткрытьФорму("Обработка.МедицинскиеОсмотры.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ВидОсмотра, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти