#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСотрудниковПоОрганизациям = Параметры.АдресСотрудниковПоОрганизациям;
	СотрудникиПоОрганизациям = ПолучитьИзВременногоХранилища(АдресСотрудниковПоОрганизациям);
	
	Для Каждого Элемент Из СотрудникиПоОрганизациям Цикл
		НоваяСтрока = ДеревоОрганизаций.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Организация = Элемент.Ключ;
		НоваяСтрока.Представление = Элемент.Ключ;
		ТекущийНомер = 0;
		Для Каждого Сотрудник Из Элемент.Значение Цикл
			НоваяПодчиненнаяСтрока = НоваяСтрока.ПолучитьЭлементы().Добавить();
			НоваяПодчиненнаяСтрока.Сотрудник = Сотрудник;
			ТекущийНомер = ТекущийНомер + 1;
			НоваяПодчиненнаяСтрока.Представление = СтрШаблон(НСтр("ru = '%1. %2'"), ТекущийНомер, Сотрудник);
			НоваяПодчиненнаяСтрока.ТолькоПросмотр = Истина;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьУсловноеОформление();
	УстановитьЗаголовкиЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоОрганизаций

&НаКлиенте
Процедура ДеревоОрганизацийПометкаПриИзменении(Элемент)
	
	УстановитьЗаголовкиЭлементовФормы(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьИлиСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьИлиСнятьФлажки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Если ВыбранныеОрганизации(ЭтотОбъект).Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрано ни одной организации.'"));
		Возврат;
	КонецЕсли;
	
	АдресВыбранныхОрганизаций = ЗаписатьВыбранныеВХранилище();
	Закрыть(АдресВыбранныхОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)

	Для Каждого Элемент Из ДеревоОрганизаций.ПолучитьЭлементы() Цикл 
		Элементы.ДеревоОрганизаций.Развернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
	
	Для Каждого Элемент Из ДеревоОрганизаций.ПолучитьЭлементы() Цикл 
		Элементы.ДеревоОрганизаций.Свернуть(Элемент.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиЭлементовФормы(Форма)

	КоличествоВыбранных = ВыбранныеОрганизации(Форма).Количество();
	ЗаголовокНадписи = НСтр("ru = 'Выбрано организаций: %1'");
	Форма.Элементы.НадписьВыбранныеОрганизации.Заголовок = СтрШаблон(ЗаголовокНадписи, КоличествоВыбранных);
	
	ШаблонКоманды = НСтр("ru = 'Создать документы %1'");
	ПояснениеККоличеству = ?(КоличествоВыбранных > 0, СтрШаблон("(%1)", КоличествоВыбранных), "");
	Форма.Элементы.СоздатьДокументы.Заголовок = СтрШаблон(ШаблонКоманды, ПояснениеККоличеству);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыбранныеОрганизации(Форма)
	
	МассивОрганизаций = Новый Массив;
	Для Каждого СтрокаОрганизация Из Форма.ДеревоОрганизаций.ПолучитьЭлементы() Цикл
		Если СтрокаОрганизация.Пометка Тогда
			МассивОрганизаций.Добавить(СтрокаОрганизация.Организация);
		КонецЕсли;
	КонецЦикла;
	Возврат МассивОрганизаций;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ДобавитьЭлементУсловногоОформления(Истина, "ДеревоОрганизацийПометка", "ТолькоПросмотр", Истина);
	ДобавитьЭлементУсловногоОформления(Ложь, "ДеревоОрганизацийПредставление", "Шрифт", ШрифтыСтиля.ЖирныйШрифтБЭД);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементУсловногоОформления(ЗначениеОтбора, ПолеОформления, ПараметрОформления, ЗначениеПараметра = Неопределено)
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоОрганизаций.ТолькоПросмотр");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ЗначениеОтбора;

	Если ЗначениеПараметра <> Неопределено Тогда
		Элемент.Оформление.УстановитьЗначениеПараметра(ПараметрОформления, ЗначениеПараметра);
	КонецЕсли;
	
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных(ПолеОформления);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаписатьВыбранныеВХранилище()
	
	ВыбранныеОрганизации = ВыбранныеОрганизации(ЭтотОбъект);
	Возврат ПоместитьВыбранныеОрганизацииВХранилище(ВыбранныеОрганизации);
	
КонецФункции

&НаСервере
Функция ПоместитьВыбранныеОрганизацииВХранилище(ВыбранныеОрганизации)
	
	Возврат ПоместитьВоВременноеХранилище(ВыбранныеОрганизации, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура УстановитьИлиСнятьФлажки(Пометка)
	
	Для Каждого Элемент Из ДеревоОрганизаций.ПолучитьЭлементы() Цикл
		Элемент.Пометка = Пометка;
	КонецЦикла;
	УстановитьЗаголовкиЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
