
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.УдалитьДублиПоказателей();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказателиКадровогоПланирования

&НаКлиенте
Процедура ПоказателиКадровогоПланированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Показатели = ВыбранноеЗначение;
	Иначе
		Показатели = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(Объект.ПоказателиКадровогоПланирования, Показатели, "Показатель");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранныхПоказателей());
	
	ОткрытьФорму("Справочник.ПоказателиКадровогоПланирования.Форма.ФормаСписка",
		ПараметрыФормы, Элементы.ПоказателиКадровогоПланирования);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает адрес во временном хранилище массива уже подобранных показателей.
&НаСервере
Функция АдресСпискаПодобранныхПоказателей()
	
	МассивПоказателей = Объект.ПоказателиКадровогоПланирования.Выгрузить(, "Показатель").ВыгрузитьКолонку("Показатель");
	
	Возврат ПоместитьВоВременноеХранилище(МассивПоказателей, УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	ДоступноРедактированиеПоказателей = ПравоДоступа("Редактирование", Метаданные.Справочники.ПоказателиКадровогоПланирования);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаПоказателиКадровогоПланирования",
		"ТолькоПросмотр",
		Не ДоступноРедактированиеПоказателей);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ПоказателиКадровогоПланированияПодбор",
		"Доступность",
		ДоступноРедактированиеПоказателей);
	
КонецПроцедуры	

#КонецОбласти

