#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция НеЗагруженные() Экспорт
	Возврат ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ОшибкаЗагрузки, 
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КонтактыЗакрыты,
		Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ЕстьОднофамильцы);
КонецФункции

Функция Зависшие() Экспорт
	
	Зависшие = Новый Массив();
	Зависшие.Добавить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.Зарегистрирован);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Зависшие, НеЗагруженные());
	
	Возврат Зависшие;
	
КонецФункции

Функция КартинкаПоСостоянию(Состояние) Экспорт
	
	Картинки = Новый Соответствие;
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ЕстьОднофамильцы, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаЕстьОднофамильцы);
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.КонтактыЗакрыты, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаКонтактыЗакрыты);
	Картинки.Вставить(Перечисления.СостоянияЗагрузкиКандидатовИзИнтернета.ОшибкаЗагрузки, 
		БиблиотекаКартинок.СостояниеЗагрузкиКандидатаИзИнтернетаОшибка);
	
	Возврат Картинки[Состояние];
	
КонецФункции

#КонецОбласти

#КонецЕсли