#Область ПрограммныйИнтерфейс

//Вызывается для проверки наличия подписи пользователя сотрудника
// 
// Параметры:
//   Документ - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   ИдентификаторПечатнойФормы - Строка - Идентификатор команды печати, соответствующей первичному документу
//   Сотрудник - Ссылка на элемент справочника "Сотрудники"
Функция НаличиеПодписиСотрудникаДляМакетаПечатнойФормыДокумента(Документ, ИдентификаторПечатнойФормы, Сотрудник) Экспорт
	Результат = Истина;
	
	Возврат Результат;
КонецФункции	

Процедура РежимФормированияИПодписанияФормуляров(ФункциональностьВключена) Экспорт

КонецПроцедуры	

// Вызывается в событии "ОбработкаЗаполнения" документа "ФормулярПервичногоДокументаПОД"
// 
// Параметры:
//   см. описание события ОбработкаЗаполнения
Процедура ФормулярЭлектронныйДокументОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается при заполнении наименования печатной формы по идентификатору печати
// 
// Параметры:
//   Предмет - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса обработки документа
//   ИдентификаторПечати - Строка - идентификатор печатной формы
//   Результат - Строка, значение наименования печатной формы по идентификатору печатной формы
//   
Процедура НаименованиеПечатнойФормыПоИдентификаторуПечати(Предмет, Шаблон, ИдентификаторПечати, Результат) Экспорт

КонецПроцедуры

// Вызывается в случае необходимости определить свой алгоритм формирования файла подписываемого формуляра
// 
// Параметры:
//   Предмет - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   ИдентификаторПечати - Строка - идентификатор печатной формы
//   Формат - Строка, идентификатор формата (MXL, PDF)
//   ВыводитьШтампыЭлектронныхПодписейПриПечати - Булево, признак, который определяет включать ли в файл штампы электронной подписи
//   Результат - ДвоичныеДанные, двоичные данные файла формуляра
//   
Процедура РезультатПечатиПредставленияДокумента(Предмет, ИдентификаторПечати, Формат, ВыводитьШтампыЭлектронныхПодписейПриПечати, Результат) Экспорт
	
КонецПроцедуры

// Вызывается при заполнении наименования первичного документа по идентификатору печати
// для структуры подписываемых данных этапа в формате XML для заполнения заголовочной описательной части
// 
// Параметры:
//   Предмет - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса обработки документа
//   ИдентификаторПечати - Строка - идентификатор печатной формы
//   Результат - Строка, значение наименования первичного документа по идентификатору печатной формы
//   
Процедура НаименованиеПервичногоДокументаПоИдентификаторуПечати(Предмет, Шаблон, ИдентификаторПечати, Результат) Экспорт

КонецПроцедуры

// Вызывается для формирования имени файла формуляра 
// 
// Параметры:
//   СведенияФормуляра - структура сведений о формуляре
//   
Функция НаименованиеФайлаФормуляра(СведенияФормуляра) Экспорт
	
КонецФункции	

// Вызывается для заполнения реквизитов документа учета 
// 
// Параметры:
//   ОбъектУчета - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   Результат - структура реквизитов документа учета
//   
Процедура ЗаполнитьРеквизитыДокументаУчета(ОбъектУчета, Результат) Экспорт
	
КонецПроцедуры

// Вызывается при заполнении структуры с подписываемых данных этапа в формате XML для заполнения заголовочной описательной части 
// 
// Параметры:
//   ОбъектУчета - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на предмет процесса обработки
//   Результат - структура данных результата
//   
Процедура ЗаполнитьЗначенияРеквизитовОбъектаУчета(ОбъектУчета, Результат) Экспорт
		
КонецПроцедуры

// Выполняется при заполнении дерева реквизитов при настройке зон ответственности этапа шаблона процесса.
// Допускается добавление в дерево новых элементов зон ответственности.
// Допускается удаление из дерева имеющихся элементов зон ответственности.
// Допускается расположение дополнительных элементов как на первом, так и втором уровнях.
// Имена новых элементов зон ответственности не должны совпадать с именами реквизитов объекта метаданных
//
// При заполнении представления элемента рекомендуется использовать формат: СинонимЭлемента [ИмяЭлемента],
// например "Сумма в валюте [СуммаВал]"
//
// Параметры:
//  Дерево - ДеревоЗначений - Двухуровневое дерево реквизитов. Колонки дерева:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит;
//                                      должен удовлетворять требованиям, предъявляемым к именованию переменных встроенного языка
//       * ИмяРеквизита - Строка - Идентификатор реквизита, должен удовлетворять требованиям, предъявляемым к именованию переменных встроенного языка
//       * Представление - Строка - Отображается на форме при настройке зон ответственности
//       * НомерКартинки - Число - Номер картинки из коллекции ПиктограммыЗонОтветственности
//
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор объекта метаданных
//
Процедура ПриЗаполненииДереваЗонОтветственности(Дерево, ИдентификаторДокумента) Экспорт
	
КонецПроцедуры

// Выполняется при инициализации формы объекта процесса обработки документов при ее открытии,
// принятии задачи к исполнению или выполнении задачи из формы объекта
// В процедуре можно дополнить массив БлокируемыеЭлементы, содержащий имена элементов формы, которые должны быть недоступны для изменения.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма объекта процесса обработки документов
//
//  НедоступныеРеквизиты - Массив - перечень недоступных реквизитов, полученный из шаблона процесса для текущего этапа, вида:
//       * [ИмяТабличнойЧасти].[ИмяРеквизита] - Строка - Имя табличной части и реквизита, если ИмяТабличнойЧасти не заполнено,
//                                                       то только элемент содержит только [ИмяРеквизита] (без точки)
//
//  ЗонаОтветственности - ТаблицаЗначений - перечень имен данных в зоне ответственности текущего этапа, колонки:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит
//       * ИмяРеквизита - Строка - Идентификатор реквизита
//
//  БлокируемыеЭлементы - Массив - коллекция имен реквизитов формы, которые будут недоступны для редактирования
//
Процедура УправлениеДоступностьюРеквизитовСогласноШаблону(Форма, НедоступныеРеквизиты, ЗонаОтветственности, БлокируемыеЭлементы) Экспорт
	
КонецПроцедуры

// Выполняется при получении данных объекта для включения в подписываемые электронной подписью данные либо при проверке электронной подписи.
// В процедуре имеется возможность описать алгоритмы получения данных для новых зон ответственности, описанных в процедуре
// ПриЗаполненииДереваЗонОтветственности, а также описать новые дополнительные данные для включения в состав подписываемых путем добавления
// новых элементов в массив ЗначенияРеквизитов, содержащий имена и значения данных для электронной подписи.
//
// Параметры:
//  Ссылка - ДокументСсылка - объект, данные которого необходимо получить
//
//  КонтролируемыеРеквизиты - ТаблицаЗначений - перечень имен данных для получения значений, колонки:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит
//       * ИмяРеквизита - Строка - Идентификатор реквизита
//       * Порядок - Число - Порядок этапа, в зону ответственности которого входит реквизит
//       * СоставСвойствРеквизита - Массив (необязательный) - Перечень реквизитов ссылочных данных для включения в подписываемые электронной подписью данные.
//                                                            Если колонка отсутствует, то настройки следует получить из параметра "НастройкаХранения"
//
//  НастройкаХранения - ТаблицаЗначений - (подготовка данных) текущая настройка подписи ссылочных данных, считанная из регистра сведений с колонками:
//       * ТипДанных - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Идентификатор ссылочных данных
//       * ИмяРеквизита - Строка - Идентификатор реквизита для включения в подписываемые данные
//                    - Неопределено - (проверка данных) если настройки хранения следует получить из колонки "СоставСвойствРеквизита" таблицы "КонтролируемыеРеквизиты"
//
//  ЗначенияРеквизитов - Массив - коллекция структур, содержащих ключи и значения данных для электронной подписи.
//                                Таблицу значений следует сохранять в массив структур, где каждый элемент соответствует строке табличной части
//                                и должен содержать свойство с именем "НомерСтроки"
//
//  Параметры - Произвольный - дополнительные параметры, заполненные при выполнении дополнительных обработчиков
//
//  СвойстваПодписи - Структура - свойства проверяемой электронной подписи:
//       * УстановившийПодпись - СправочникСсылка.Пользователи - пользователь, установивший подпись
//
//  ФайлыДляПодписи - Массив - список объектов типа ОпределяемыйТип.ПрисоединенныйФайл для подписи.
//                             Параметр может быть заполнен только при подготовке подписываемых данных (НастройкаХранения <> Неопределено)
//                             Используется в случае, если необходима выборочная подпись файлов.
//
Процедура ЗначенияРеквизитовОбъектаПоСоставу(Ссылка, КонтролируемыеРеквизиты, НастройкаХранения, ЗначенияРеквизитов,
		Параметры, СвойстваПодписи, ФайлыДляПодписи) Экспорт
	
КонецПроцедуры

// Выполняется при контроле недоступных для изменения данных перед записью объекта
// В процедуре необходимо описать алгоритм контроля данных, добавленных в переопределяемом методе
// ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности и не являющихся свойствами объекта
// После проверки необходимо удалить эти данные из таблицы ПроверяемыеРеквизиты
//
// Параметры:
//  Источник - ДокументОбъект - записываемый объект
//
//  Ссылка - ДокументСсылка - ссылка на сохраненный объект
//
//  ПроверяемыеРеквизиты - ТаблицаЗначений - перечень имен данных для контроля, колонки:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит
//       * ИмяРеквизита - Строка - Идентификатор реквизита
//
//  Параметры - Структура - параметры этапа, который необходимо выполнить:
//       * Состав соответствует струкутуре, возвращаемой методом ПроцессыОбработкиДокументов.ПараметрыТекущегоЭтапаПроцесса()
//
//  Отказ - Булево - если установить Истина, то происходит отказ от записи объекта
//
Процедура ПриКонтролеИзмененияРеквизитов(Источник, Ссылка, ПроверяемыеРеквизиты, Параметры, Отказ) Экспорт
	
КонецПроцедуры

// Выполняется при проверке заполнения обязательных реквизитов перед выполнением этапа
// В процедуре необходимо описать алгоритм проверки заполнения данных, добавленных в переопределяемом методе
// ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности и не являющихся свойствами объекта
// После проверки необходимо удалить эти данные из таблицы ПроверяемыеРеквизиты
//
// Параметры:
//  Параметры - Структура - параметры проверки
//       * Источник - ДокументСсылка - ссылка на объект, по которому инициировано выполнение задачи
//       * Шаблон - СправочникСсылка.ШаблоныПроцессов - ссылка на шаблон
//       * ИдентификаторЭтапа - УникальныйИдентификатор - уникальный идентификатор этапа шаблона
//       * Отказ - Булево - если установить Истина, то происходит отказ от записи объекта
//       * ОписаниеОшибки - Строка - описание ошибки, которое будет сохранено в данных невыполненной задачи
//       * Исполнитель - СправочникСсылка.Пользователи - исполнитель задачи
//       *             - Неопределено - испольнителем будет считаться текущий пользователь
//
//  ПроверяемыеРеквизиты - ТаблицаЗначений - перечень имен данных для контроля, колонки:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит
//       * ИмяРеквизита - Строка - Идентификатор реквизита
//
Процедура ПриПроверкеЗаполненияОбязательныхРеквизитов(Параметры, ПроверяемыеРеквизиты) Экспорт
	
КонецПроцедуры

// Выполняется при заполнении дерева первичных документов при настройке зон ответственности этапа шаблона процесса.
// Для подписи первичного документа и разделения его полей по зонам ответственности, в этой процедуре необходимо
// описать форматы первичных электронных документов
//
// Параметры:
//  Форматы - Структура - структура, где:
//   * Ключ - Строка - идентификатор команды печати первичного документа
//   * Значение - Формат - структура, описывающая состав полей первичного документа в виде перечня таблиц:
//     * Ключ - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит;
//         должен удовлетворять требованиям, предъявляемым к именованию переменных встроенного языка;
//         первичный документ может состоять из нескольких таблиц, включая основную обязательную таблицу с именем "Шапка",
//         содержащую описание реквизитов шапки документа и имена вложенных таблиц
//     * Знчение - ТаблицаЗначений - пустая таблица, колонки которой описывают поля первичного документа
//         типы колонок должны быть простыми, кроме колонок таблицы "Шапка", обозначающими вложенные таблицы -
//         у таких колонок должен быть тип "ТаблицаЗначений"
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор объекта метаданных
//
Процедура ПриЗаполненииФорматовПервичныхДокументов(Форматы, ИдентификаторДокумента) Экспорт

КонецПроцедуры

// Выполняется при получении данных первичного документа по ссылке
//
// Параметры:
//  Ссылка - Массив, ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на объект процесса обработки документов
//    или массив таких ссылок одного типа
//  ИдентификаторПечатнойФормы - - Строка - идентификатор команды печати первичного документа
//  Реквизиты - Соответствие - данные первичных документов, которые необходимо заполнить, где
//   Ключ - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - ссылка на объект процесса обработки документов
//   Значение - Структура - данные первичного документа, с перечнем таблиц, где
//    Ключ - Строка - имя таблицы, основная таблица должна называться "Шапка"
//    Значение - ТаблицаЗначений - таблица значений реквизитов
//
Процедура ЗаполнитьРеквизитыПоФорматуПервичногоДокумента(Ссылка, ИдентификаторПечатнойФормы, Реквизиты) Экспорт

КонецПроцедуры

// Выполняется при инициализации формы объекта процесса обработки документов.
// Вызов процедуры производится при создании/чтении/перечитывании объекта, при выполнении команд выполнения этапа
// или принятия к исполнению задачи из формы документа, когда производится переинициализация элементов и команд формы
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма объекта процесса обработки документов
//  Источник - ДанныеФормыСтруктура - Объект с полем "Ссылка".
//  Параметры - Структура - параметры этапа, который необходимо выполнить:
//       * Состав соответствует струкутуре, возвращаемой методом ПроцессыОбработкиДокументов.ПараметрыТекущегоЭтапаПроцесса()
//
Процедура ПриИнициализацииФормыДокумента(Форма, Источник, Параметры) Экспорт
	
КонецПроцедуры

// Выполняется при выполнении задачи по обработке документа в конце транзакции обработчика выполнения этапа,
// а также при прерывании выполнения задачи (см. реквизит задачи "Прервана")
// К моменту вызова процедуры задача уже записана, движения по регистрам библиотеки сделаны
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на выполненную задачу
//
Процедура ПриВыполненииЗадачи(Задача) Экспорт
	
КонецПроцедуры

// Выполняется при неуспешной попытке выполнить задачу по обработке документа в блоке обработки исключения
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую не удалось выполнить
//  Статус - СправочникСсылка.Статусы - ссылка на статус, который задача должна была установить
//  ИнформацияОбОшибке - ИнформацияОбОшибке - структурированная информация об исключении
//
Процедура ПриНеуспешномВыполненииЗадачи(Задача, Статус, ИнформацияОбОшибке) Экспорт
	
КонецПроцедуры

// Выполняется при определении возможности выполнения этапа пользователем.
// Если функция вернет Ложь, то после возврата будет выполнена стандартная проверка.
//
// Параметры:
//  Ссылка - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на объект процесса обработки документов
//  Параметры - Структура - параметры этапа, который необходимо выполнить:
//       * Состав соответствует струкутуре, возвращаемой методом ПроцессыОбработкиДокументов.ПараметрыТекущегоЭтапаПроцесса()
//  РеквизитыАдресации - Структура - реквизиты адресации:
//       * Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителей - исполнитель этапа.
//       * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации (для ролевой адресации)
//       * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации (для ролевой адресации)
//       * ИмяРеквизитаОсновногоОбъектаАдресации - Строка - имя реквизита документа, значение которого используется для основного объекта адресации
//       * ИмяРеквизитаДополнительногоОбъектаАдресации - Строка -имя реквизита документа, значение которого используется для дополнительного объекта адресации
//  Пользователь - СправочникСсылка.Пользователи - пользователь, которого необходимо проверить
//
Функция ПользовательМожетБытьИсполнителем(Ссылка, Параметры, РеквизитыАдресации, Пользователь) Экспорт
	
	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

// Выполняется при определении возможности принятия к исполнению задачи пользователем.
// В процедуре можно разрешить или запретить принятие к исполнению задачи.
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую необходимо принять к исполнению
//  Пользователь - СправочникСсылка.Пользователи - пользователь, которого необходимо проверить
//  Результат - Неопределено - после процедуры будет выполнена стандартная проверка
//              Истина - пользователю будет разрешено принять к исполнению задачу,
//                       стандартная проверка не будет выполнена
//              Строка - пользователю будет отказано в принятии к исполнению задачи,
//                       значение будет использовано для вывода причины отказа
//
Процедура ПриПроверкеПраваПринятияКИсполнениюЗадачи(Задача, Пользователь, Результат) Экспорт
	
КонецПроцедуры

// Выполняется при определении возможности отмены принятия к исполнению задачи пользователем.
// В процедуре можно разрешить или запретить отмену принятия к исполнению задачи.
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую необходимо отметить как непринятую к исполнению
//  Пользователь - СправочникСсылка.Пользователи - пользователь, которого необходимо проверить
//  Результат - Неопределено - после процедуры будет выполнена стандартная проверка:
//                             "отменить принятие к исполнению задачи может только тот пользователь, который ее принял к исполнению"
//              Истина - пользователю будет разрешено отменить принятие к исполнению задачи,
//                       стандартная проверка не будет выполнена
//              Строка - пользователю будет отказано в отмене принятия к исполнению задачи,
//                       значение будет использовано для вывода причины отказа
//
Процедура ПриПроверкеПраваОтменыПринятияКИсполнениюЗадачи(Задача, Пользователь, Результат) Экспорт
	
КонецПроцедуры

// Выполняется при определении возможности отмены выполнения задачи пользователем.
// В процедуре можно разрешить или запретить отмену выполнения задачи.
//
// Параметры:
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, выполнение которой будет отменено
//  Пользователь - СправочникСсылка.Пользователи - пользователь, которого необходимо проверить
//  Результат - Истина - пользователю будет разрешено отменить выполнение задачи,
//                       стандартная проверка не будет выполнена
//              Строка - пользователю будет отказано в отмене выполнения задачи,
//                       значение будет использовано для вывода причины отказа
//              (Другой тип / значение) - после процедуры будет выполнена стандартная проверка
//
Процедура ПриПроверкеПраваОтменыВыполненияЗадачи(Задача, Пользователь, Результат) Экспорт
	
КонецПроцедуры

// Выполняется при создании задачи по процессу.
// В процедуре можно переопределить реквизиты адресации создаваемой задачи.
//
// Параметры:
//  Параметры - Структура - параметры этапа, который необходимо запустить:
//       * Документ - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - ссылка на объект процесса обработки документов
//       * Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса документа
//       * ИдентификаторЭтапа - УникальныйИдентификатор - идентификатор запускаемого этапа шаблона процесса
//       * Этап - СправочникСсылка.ЭтапыПроцессов - запускаемый этап шаблона процесса
//  ПараметрыАдресации - Структура - параметры адресации из настроек шаблона процесса, с учетом групповых этапов:
//       * Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителей, Строка - исполнитель этапа.
//       * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации (для ролевой адресации)
//       * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации (для ролевой адресации)
//       * ИмяРеквизитаОсновногоОбъектаАдресации - Строка - имя реквизита документа, значение которого используется в качестве основного объекта адресации
//       * ИмяРеквизитаДополнительногоОбъектаАдресации - Строка - имя реквизита документа, значение которого используется в качестве дополнительного объекта адресации
//  РеквизитыАдресации - Структура - реквизиты адресации новой задачи:
//       * Исполнитель - СправочникСсылка.Пользователи - пользователь, которому будет назначена задача
//       * РольИсполнителя - СправочникСсылка.РолиИсполнителей - роль исполнителя, которому будет назначена задача
//       * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации
//       * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации
//  СтандартнаяОбработка - Булево - Если Истина, то после процедуры будет выполнено стандартное определение реквизитов адресации,
//                                  Если Ложь, то для задачи установятся реквизиты адресации из параметра РеквизитыАдресации
//
Процедура ПриОпределенииРеквизитовАдресации(Параметры, ПараметрыАдресации, РеквизитыАдресации, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при создании задачи по процессу непосредственно до записи задачи.
// В процедуре можно изменить реквизиты создаваемой задачи.
//
// Параметры:
//  Параметры - Структура - параметры этапа, который необходимо запустить:
//       * Состав соответствует структуре, возвращаемой методом ПроцессыОбработкиДокументов.ПараметрыТекущегоЭтапаПроцесса()
//  Задача - ЗадачаОбъект.ЗадачаПоОбработкеДокумента - создаваемая задача
//
Процедура ПриСозданииЗадачи(Параметры, Задача) Экспорт
	
КонецПроцедуры

// Выполняется после создания задачи по процессу.
//
// Параметры:
//  Параметры - Структура - параметры этапа, который был запущен:
//       * Состав соответствует структуре, возвращаемой методом ПроцессыОбработкиДокументов.ПараметрыТекущегоЭтапаПроцесса()
//  Задача - ЗадачаОбъект.ЗадачаПоОбработкеДокумента - созданная задача
//
Процедура ПослеСозданияЗадачи(Параметры, Задача) Экспорт
	
КонецПроцедуры

// Выполняется перед записью документа - предмета процесса обработки
// Вызывается из подписки на событие "ПроцессыОбработкиДокументовПередЗаписьюДокумента"
//
// Параметры:
//  Источник - ДокументОбъект - записываемый объект
//  Отказ, РежимЗаписи, РежимПроведения - см. описание процедуры "ПередЗаписью" модуля документа
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы этапа процесса.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма этапа процесса
Процедура ПриСозданииНаСервереФормыЭтапаПроцесса(Форма) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы шаблона процесса.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма шаблона процесса
//  Отказ - Булево - параметр Отказ стандартного события ПриСозданииНаСервере формы
Процедура ПриСозданииНаСервереФормыШаблонаПроцесса(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Выполняется при чтении на сервере формы шаблона процесса.
//
// Параметры:
//  Форма - УправляемаяФорма - форма шаблона процесса
//  ТекущийОбъект - СправочникОбъект - параметр ТекущийОбъект стандартного события ПриЧтенииНаСервере
Процедура ПриЧтенииНаСервереФормыШаблонаПроцесса(Форма, ТекущийОбъект) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы регламентного интервала.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма регламентного интервала
//  Отказ - Булево - параметр Отказ стандартного события ПриСозданииНаСервере формы
Процедура ПриСозданииНаСервереФормыРегламентногоИнтервала(Форма, Отказ) Экспорт
	
КонецПроцедуры

// Выполняется при чтении на сервере формы регламентного интервала.
//
// Параметры:
//  Форма - УправляемаяФорма - форма регламентного интервала
//  ТекущийОбъект - СправочникОбъект - параметр ТекущийОбъект стандартного события ПриЧтенииНаСервере
Процедура ПриЧтенииНаСервереФормыРегламентногоИнтервала(Форма, ТекущийОбъект) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы списка регламентных интервалов.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма шаблона процесса
Процедура ПриСозданииНаСервереФормыСпискаРегламентныхИнтервалов(Форма) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы регламентного интервала документа.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма шаблона процесса
Процедура ПриСозданииНаСервереФормыРегламентногоИнтервалаДокумента(Форма) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы нового документа
// В процедуре имеется возможность отказаться от стандартной обработки события
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма этапа процесса
//  Источник - ДокументОбъект - открываемый объект
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной (системной) обработки события
Процедура ПриСозданииНаСервереФормыНовогоДокумента(Форма, Источник, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Выполняется при создании на сервере формы настроек библиотеки.
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма настроек
Процедура ПриСозданииНаСервереФормыНастроек(Форма) Экспорт
	
КонецПроцедуры

// Выполняется в обработчике события ПередЗаписью задачи по обработке документа.
//
// Параметры:
//  Задача - ЗадачаОбъект.ЗадачаПоОбработкеДокумента - записываемая задача
//  ИсходныеРеквизиты - Структура - исходные (предыдущие) значения реквизитов задачи:
//       * Выполнена - Булево
//       * ПринятаКИсполнению - Булево
//       * ДатаПринятияКИсполнению - Дата
//  ДатаЗаписи - Дата - дата события записи
//  ДатаПоследнейОтменыВыполнения - Дата, Неопределено - рассчитанная ранее дата последней отмены выполнения задачи
//       либо Неопределено, если дата не рассчитывалась
//  ИнтервалыРабочегоВремени - ТаблицаЗначений, Неопределено - рассчитанная ранее таблица рабочего времени
//       (состав колонок описан в методе ПроцессыОбработкиДокументов.ПустаяТаблицаРабочегоВремени)
//       либо Неопределено, если таблица не рассчитывалась
//  Отказ - Булево - признак отказа от записи
//
Процедура ПередЗаписьюЗадачи(Задача, ИсходныеРеквизиты, ДатаЗаписи, ДатаПоследнейОтменыВыполнения, ИнтервалыРабочегоВремени, Отказ) Экспорт
	
КонецПроцедуры

// Выполняется при печати в начале вызова процедуры ПроцессыОбработкиДокументов.ПриПечати
// В процедуре имеется возможность отказаться от стандартной обработки события
//
// Параметры:
//  МассивОбъектов - Массив - список объектов, для которых была выполнена процедура Печать;
//  ПараметрыПечати - Структура - произвольные параметры, переданные при вызове команды печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - содержит табличные документы и дополнительную информацию;
//  ОбъектыПечати - СписокЗначений - соответствие между объектами и именами областей в табличных документах, где
//                                   значение - Объект, представление - имя области с объектом в табличных документах;
//  ПараметрыВывода - Структура - параметры, связанные с выводом табличных документов:
//   * ПараметрыОтправки - Структура - информация для заполнения письма при отправке печатной формы по электронной почте.
//                                     Содержит следующие поля (описание см. в общем модуле конфигурации
//                                     РаботаСПочтовымиСообщениямиКлиент в процедуре СоздатьНовоеПисьмо):
//    ** Получатель;
//    ** Тема,
//    ** Текст.
//  СтандартнаяОбработка - Булево - Признак выполнения стандартной обработки события
Процедура ПриПечати(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Позволяет дополнить массив МассивКоманд дополнительными командами, доступными для выполнения
// в общей форме "КарточкаПроцессаДокумента"
//
// Параметры:
//   МассивКоманд - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификтор команды, должен быть уникален.
//     * Представление - Строка - представление команды в интерфейсе.
//     * Серверная - Булево - (необязательный) - признак вызова контекстного серверного метода для выполнения команды.
//         - если Истина, то код обработчика должен быть описан в модуле ПроцессыОбработкиДокументовПереопределяемый
//         - если Ложь или не указан, то код обработчика должен быть описан в модуле ПроцессыОбработкиДокументовКлиентПереопределяемый
//     * Картинка - Картинка - (необязательный) - картинка команды
//
// Пример:
//   НоваяКоманда = Новый Структура;
//   НоваяКоманда.Вставить("Идентификатор", "ПереходКЗадаче");
//   НоваяКоманда.Вставить("Представление", НСтр("ru = 'Открыть задачу в форме списка'"));
//   МассивКоманд.Добавить(НоваяКоманда);
//   
//   НоваяКоманда = Новый Структура;
//   НоваяКоманда.Вставить("Идентификатор", "ЗаписатьДокумент");
//   НоваяКоманда.Вставить("Представление", НСтр("ru = 'Записать документ'"));
//   НоваяКоманда.Вставить("ТребуетсяВызовСервера", Истина);
//   МассивКоманд.Добавить(НоваяКоманда);
//
// Код обработчика команды должен быть описан в общем переопределяемом модуле ПроцессыОбработкиДокументовПереопределяемый
// или ПроцессыОбработкиДокументовКлиентПереопределяемый в зависимости от значения ключа "Серверная" в виде отдельной
// процедуры (на сервере - неэкспортная, на клиенте - экпортная), имя которой должно совпадать с идентификатором команды
// Параметры:
//   Форма - УправляемаяФорма - форма карточки этапа процесса
//
// Пример клиентской команды:
//   Процедура ПереходКЗадаче(Результат, Форма) Экспорт
//       
//       ОткрытьФорму("Задача.ЗадачаПоОбработкеДокумента.Форма.МоиЗадачи");
//       
//   КонецПроцедуры
// 
// Пример серверной команды:
//   Процедура ЗаписатьДокумент(Форма)
//       
//       ДокументОбъект = Форма.Параметры.ЗначениеОтбора.ПолучитьОбъект();
//       ДокументОбъект.Записать();
//       
//   КонецПроцедуры
Процедура ОписаниеДополнительныхКомандКарточкиПроцессаДокумента(МассивКоманд) Экспорт
	
КонецПроцедуры

// Позволяет изменить свойства элементов формы карточки процесса документа
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма карточки процесса документа
//
Процедура УстановитьСвойстваЭлементовКарточкиПроцессаДокумента(Форма) Экспорт
	
КонецПроцедуры

// Позволяет изменить длительность ожидания выполнения задачи, по прошествии которого
// задача и задачи из этой же пачки должны быть отмечены как невыполняемые
//
// Параметры:
//   ВремяОжиданияВыполненияЗадачи - Число - количество секунд ожидания выполнения задачи
//
Процедура ИзменитьВремяОжиданияВыполненияЗадачи(ВремяОжиданияВыполненияЗадачи) Экспорт
	
КонецПроцедуры

// Позволяет дополнить массив События дополнительными именованными событиями прикладной конфигурации,
// доступными для выбора в шаблонах процессов в качестве инициирующих выполнение этапов.
// Идентификатор события используются в качестве параметра метода ПроцессыОбработкиДокументов.ВыполнитьЗадачиПоСобытию
// 
// Параметры:
//   События - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификатор события, должен быть уникален.
//     * Представление - Строка - представление события в формах.
//     * Описание - Строка - описание события, имени кнопки формы.
//     * ОбъектыМетаданных - Строка - имена объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора идентификаторов в шаблонах процессов.
//
// Пример: 
//    Событие = Новый Структура;
//    Событие.Вставить("Идентификатор", "ОтправкаФайлов");
//    Событие.Вставить("Представление", НСтр("ru = 'Отправка файлов экспорта'"));
//    Событие.Вставить("Описание", НСтр("ru = 'Возникает при отправке файлов экспорта по кнопке ""Отправить файлы""'"));
//    Событие.Вставить("ОбъектыМетаданных", "Документ.ЗаданиеНаЭкспортДанныхВБанкиКС");
//    События.Добавить(Событие);
//
Процедура ОписаниеСобытийИнициирующихВыполнениеЭтапов(События) Экспорт
	
КонецПроцедуры

// Позволяет дополнить массив МассивФункций объявлениями дополнительных серверных функций из текущего модуля,
// которые впоследствии могут быть указаны в шаблонах процессов в настройке влияния на процессы.
// Дополнительные функции используются для поиска зависимых объектов по ссылке на влияющий объект,
// и могут понадобится, когда влияющий объект не содержит в своих метаданных прямых ссылок на зависимые объекты
// 
// Объявление функций производится в процедуре ОписаниеФункцийПоискаЗависимыхОбъектов.
// Код функции должен быть описан в этом же модуле в виде отдельной неэкспортной процедуры, имя которой должно
// совпадать с идентификатором функции. Функция должна возвращать массив ссылок на зависимые объекты либо пустой массив
// 
// Параметры:
//   МассивФункций - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификатор функции, должен быть уникален.
//     * Представление - Строка - представление функции в формах.
//     * ВлияющиеОбъектыМетаданных - Строка - имена влияющих объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора дополнительных функций при настройке влияний в шаблонах процессов.
//     * ЗависимыеОбъектыМетаданных - Строка - имена зависимых объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора дополнительных функций при настройке влияний в шаблонах процессов.
//
// Пример: 
//   НоваяФункция = Новый Структура;
//   НоваяФункция.Вставить("Идентификатор", "СчетаФактурыПолученныеДокументовПоступления");
//   НоваяФункция.Вставить("Представление", НСтр("ru = 'Счета-фактуры полученные'"));
//   НоваяФункция.Вставить("ВлияющиеОбъектыМетаданных", "Документ.ПоступлениеМЗ,
//   												|Документ.ПоступлениеОС");
//   НоваяФункция.Вставить("ЗависимыеОбъектыМетаданных", "Документ.СчетФактураПолученный");
//   МассивФункций.Добавить(НоваяФункция);
//
// Код функции должен быть описан в этом же модуле в виде отдельной неэкспортной процедуры, имя которой должно
// совпадать с идентификатором функции. Функция должна возвращать массив ссылок на зависимые объекты либо пустой массив
//
// Параметры функции:
//   Источник - ДокументСсылка - ссылка на влияющий объект.
//
// Пример:
//    Функция СчетаФактурыПолученныеДокументовПоступления(Источник)
//        
//        МассивСФ = Новый Массив;
//        
//        СФ = УчетНДС.НайтиПодчиненныйСчетФактуру(Источник, "СчетФактураПолученный");
//        
//        Если ЗначениеЗаполнено(СФ) Тогда
//            МассивСФ.Добавить(СФ);
//        КонецЕсли;
//        
//        Возврат МассивСФ;
//        
//    КонецФункции
//
Процедура ОписаниеФункцийПоискаЗависимыхОбъектов(МассивФункций) Экспорт
	
КонецПроцедуры

// Позволяет дополнить массив МассивФункций объявлениями дополнительных серверных функций из текущего модуля,
// которые впоследствии могут быть указаны в шаблонах процессов в качестве исполнителей этапов.
// Дополнительные функции используются для определения исполнителей этапа, и могут понадобится,
// когда исполнителей невозможно определить другим стандартным функционалом библиотеки
// 
// Объявление функций производится в процедуре ОписаниеФункцийОпределенияИсполнителейЭтапа.
// Код функции должен быть описан в этом же модуле в виде отдельной неэкспортной процедуры, имя которой должно
// совпадать с идентификатором функции. Функция должна возвращать массив структур с описанием исполнителей
// 
// Если функция будет выбрана для этапа, выполняющегося одним исполнителем, то в качестве исполнителя будет
// использоваться первый элемент массива (с индексом 0)
// 
// Параметры:
//   МассивФункций - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификтор функции, должен быть уникален.
//     * Представление - Строка - представление функции в формах.
//     * ОбъектыМетаданных - Строка - имена объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора дополнительных функций при выборе исполнителя этапа.
//
// Пример: 
//   НоваяФункция = Новый Структура;
//   НоваяФункция.Вставить("Идентификатор", "ЧленыКомиссии");
//   НоваяФункция.Вставить("Представление", НСтр("ru = 'Члены комиссии'"));
//   НоваяФункция.Вставить("ОбъектыМетаданных", "Документ.СписаниеВосстановлениеЗадолженностиПоДоходам");
//   
//   МассивФункций.Добавить(НоваяФункция);
//
// Код функции должен быть описан в этом же модуле в виде отдельной неэкспортной процедуры, имя которой должно
// совпадать с идентификатором функции. Функция должна возвращать массив структур с описанием исполнителей
//
// Параметры функции:
//   Источник - ДокументСсылка - ссылка на влияющий объект.
//
// Возвращаемое значение:
//   Массив структур с ключами:
//     * Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителей - исполнитель этапа.
//     * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации (для ролевой адресации)
//     * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации (для ролевой адресации)
//     * НеСоздаватьЗадачу - Булево - признак создания задачи исполнителю, имеет смысл устанавливать для групповых задач, когда некоторым
//                                    исполнителям не требуется создавать задачу, но они могуть позже созданы вручную куратором этапа
//   Строка - строка со значением "НеДобавлятьИсполнителей". Возвращается, если не требуется добавлять исполнителей этапа.
//     Использвание данного значения может привести к незапуску очередного этапа процесса и к незапланированному завершению процесса
//     обработки документа.
//
// Пример:
//    Функция ЧленыКомиссии(Источник)
//        
//        Исполнители = Новый Массив;
//        
//        Возврат Исполнители;
//        
//    КонецФункции
//
Процедура ОписаниеФункцийОпределенияИсполнителейЭтапа(МассивФункций) Экспорт
	
КонецПроцедуры

// Позволяет отказаться от стандартного функционала библиотеки по определению графика работы исполнителя,
// а также подготовить данные для последующего использования в процедурах
// ПроцессыОбработкиДокументовПереопределяемый.ДатаПоГрафику и ПроцессыОбработкиДокументовПереопределяемый.РасписаниеРаботыНаПериод
//
// Параметры:
//  РеквизитыАдресации - Структура - реквизиты адресации исполнителя этапа:
//       * Исполнитель - СправочникСсылка.Пользователи - пользователь, которому будет назначена задача
//       * РольИсполнителя - СправочникСсылка.РолиИсполнителей - роль исполнителя, которому будет назначена задача
//       * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации
//       * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации
//  ГрафикРаботы - Произвольный - параметр, который будет передан в процедуры
//                                ПроцессыОбработкиДокументовПереопределяемый.ДатаПоГрафику и
//                                ПроцессыОбработкиДокументовПереопределяемый.РасписаниеРаботыНаПериод
//  СтандартнаяОбработка - Булево - Признак выполнения стандартного определения графика работы исполнителя - из константы "ОсновнойГрафикРаботы".
//
Процедура ПриОпределенииГрафикаРаботыИсполнителя(РеквизитыАдресации, ГрафикРаботы, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Возвращает дату, которая отличается указанной даты на указанное количество рабочих дней и часов.
// Дата будет использоваться в качестве даты окончания в процедуре ПроцессыОбработкиДокументовПереопределяемый.РасписаниеРаботыНаПериод
//
// Параметры:
//	 ГрафикРаботы - Произвольный - параметр, заполненный в процедуре ПроцессыОбработкиДокументовПереопределяемый.ПриОпределенииГрафикаРаботыИсполнителя
//	 ДатаОт - Дата - дата, от которой нужно рассчитать количество дней.
//	 КоличествоДней - Число - количество дней, на которые нужно увеличить дату начала.
//	 КоличествоЧасов - Число - количество часов, на которые нужно увеличить дату начала.
//
// Возвращаемое значение:
//	 Дата - дата, увеличенная на количество рабочих дней и часов.
//
Функция ДатаПоГрафику(ГрафикРаботы, ДатаОт, КоличествоДней, КоличествоЧасов) Экспорт
	
	Возврат ДатаОт;
	
КонецФункции

// Позволяет указать расписание работы за указанный период, которое будет использоваться
// при расчете времени и сроков выполнения этапов процессов
//
// Параметры:
//  ГрафикРаботы       - Произвольный - параметр, заполненный в процедуре ПроцессыОбработкиДокументовПереопределяемый.ПриОпределенииГрафикаРаботыИсполнителя
//  ДатаНачала         - Дата - дата начала периода, за который нужно составить расписание.
//  ДатаОкончания      - Дата - дата окончания периода.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица рабочих дней с колонками:
//    * ДатаГрафика     - Дата (Дата) - дата в расписании.
//    * ВремяНачала     - Дата (Время) - время начала работы в день ДатаГрафика.
//    * ВремяОкончания  - Дата (Время) - время окончания работы в день ДатаГрафика.
//
Функция РасписаниеРаботыНаПериод(ГрафикРаботы, ДатаНачала, ДатаОкончания) Экспорт
	
	Возврат Новый ТаблицаЗначений;
	
КонецФункции

// Позволяет отказаться от стандартного функционала библиотеки по определению шаблона процесса для нового документа
// и указать свой шаблон
//
// Параметры:
//  Документ - ДанныеФормыСтруктура, ДокументОбъект, ДокументСсылка - новый документ
//  БезПроверкиУсловия - Булево - признак, надо ли отказаться от проверки условия использования шаблона
//                       при вызове из формы документа имеет значение Истина, из обработчика записи - Ложь
//  Результат - Структура - данные, которые необходимо заполнить в случае отказа от стандартного функционала
//       * Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон, который будет выбран для обработки документа
//       * Статус - СправочникСсылка.СтатусыДокументов - начальный статус документа согласно шаблону процесса
//       * ШаблонНеОпределен - Строка - описание ошибки, в случае, когда не удалось определить подходящий шаблон процесса
//                             Свойство не нужно добавлять, если заполнен Шаблон!
//  СтандартнаяОбработка - Булево - признак выполнения стандартного определения шаблона процесса.
//
Процедура ПриОпределенииШаблонаИСтатусаНовогоДокумента(Документ, БезПроверкиУсловия, Результат, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Позволяет отказаться от стандартного функционала библиотеки по определению регламентного интервала для запуска
// и указать свой регламентный интервал
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса документа
//  ИдентификаторНачальногоЭтапа - УникальныйИдентификатор - идентификатор запускаемого этапа шаблона процесса
//  СтандартнаяОбработка - Булево - признак выполнения стандартного определения регламентного интервала.
//
// Возвращаемое значение:
//   РегламентныйИнтервал - СправочникСсылка.РегламентныеИнтервалы - регламентный интервал для запуска.
//                          Будет запущен, если установлено СтандартнаяОбработка = Ложь
//
Функция РегламентныйИнтервалДляЗапуска(Шаблон, ИдентификаторНачальногоЭтапа, СтандартнаяОбработка) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПриСозданииНаСервереФормыНастроекРегламентированногоОтчета(Форма, Параметры) Экспорт
	
КонецПроцедуры

Процедура ПриИнициализацииФормыПечатиРегламентированныхОтчетов(Форма, ДеревоЛистов) Экспорт
	
КонецПроцедуры

Процедура ПриВыводеВыбранногоЛистаРегламентированногоОтчетаВТабличныйДокумент(Форма, АдресВоВременномХранилище, ТабличныйДокумент) Экспорт
	
КонецПроцедуры

// Позволяет заполнить список команд создания на основании для документа "Дополнительное задание".
// Код обработчиков заполнения следует описать в процедуре "ОбработкаЗаполненияНаОснованииДополнительногоЗадания" этого модуля
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - сформированные команды для вывода в подменю "Создать на основании"
//                                Описание колонок таблицы см. в описании параметра "КомандыСозданияНаОсновании" процедуры
//                                СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.
//                                Для колонок из группы "настройки обработчика" заполнить следует только колонку "Менеджер".
//
// Пример:
//    КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
//    КомандаСоздатьНаОсновании.Менеджер = "Документ.АвансовыйОтчет";
//    КомандаСоздатьНаОсновании.Представление = НСтр("ru = 'Авансовый отчет'");
//    КомандаСоздатьНаОсновании.РежимЗаписи = "Записывать";
//
// Пример обработчика заполнения:
//    Процедура ОбработкаЗаполненияНаОснованииДополнительногоЗадания(Источник, ДанныеЗаполнения) Экспорт
//        Если ТипЗнч(Источник) = Тип("ДокументОбъект.АвансовыйОтчет") Тогда
//            
//        КонецЕсли;
//    КонецПроцедуры
//
Процедура ОписаниеКомандСозданияНаОснованииДополнительногоЗадания(КомандыСозданияНаОсновании) Экспорт
	
КонецПроцедуры

// Параметры:
//  Источник - ДокументОбъект - создаваемый объект
//  ДанныеЗаполнения - ДокументСсылка.ДополнительноеЗадание - документ-основание
Процедура ОбработкаЗаполненияНаОснованииДополнительногоЗадания(Источник, ДанныеЗаполнения) Экспорт
	
КонецПроцедуры

// Заполняет сведения о физическом лице по переданному пользователю и перечню подписываемых объектов
// для заполнения свойств простой электронной подписи по каждому объекту.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь ИБ.
//  Сведения - Структура - данные пользователя:
//   * ПолноеИмя - Строка - полное имя физического лица пользователя, например "Иванов Иван Иванович".
//   * ОрганизацииИДолжности - Соответствие - данные пользователя по подписываемым объектам, где
//      Ключ - ДокументСсылка - подписываемый документ (уже заполнен),
//      Значение - Структура или Массив структур:
//       * Организация - ОпределяемыйТип.Организация - организация пользователя.
//       * Должность - Строка - занимаемая в организации должность.
//       Если вернуть массив структур, то в форме подписания простой ЭП будет доступен выбор пары "Организация - Должность"
//       Не допускается использование разных типов значений для разных элементов соответствия
//
Процедура ЗаполнитьСведенияОПользователе(Знач Пользователь, Сведения) Экспорт
	
	ПроцессыОбработкиДокументовЗарплата.ЗаполнитьСведенияОПользователе(Пользователь, Сведения);

КонецПроцедуры

// Позволяет добавить процедуры-обработчики обновления данных ИБ
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример:
//  Для добавления своей процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.РежимВыполнения     = "Оперативно";
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
КонецПроцедуры

// Выполняется перед записью присоединенного файла к документу - предмету процесса обработки
// Вызывается из подписки на событие "ПередЗаписьюПрисоединенногоФайлаПОД"
//
// Параметры:
//  Источник - ОпределяемыйТип.ПрисоединенныйФайлОбъект - записываемый файл
//  Отказ - Булево - признак отказа от записи файла
//  СтандартнаяОбработка - Булево - признак продолжения выполнения стандартной обработки события
//  Владелец - ЛюбаяСсылка - владелец файла - предмет процесса обработки документов, может быть изменен
//
Процедура ПередЗаписьюПрисоединенногоФайла(Источник, Отказ, СтандартнаяОбработка, Владелец) Экспорт
	
КонецПроцедуры

// Выполняется при подготовке файла данных при выгрузке шаблонов процессов в обработке Импорта / экспорта шаблонов процессов
// Позволяет дополнить xml-файл с выгружаемыми данными произвольной информацией, которая может быть прочитана при загрузке
// методом ПроцессыОбработкиДокументовПереопределяемый.ПриЗагрузкеШаблоновПроцессов
//
// Параметры:
//  ФайлДанных - ЗаписьXML - выгружаемые данные
//  ШаблоныПроцессов - Массив из СправочникСсылка.ШаблоныПроцессов - перечень выгружаемых шаблонов процессов
//
Процедура ПриВыгрузкеШаблоновПроцессов(ФайлДанных, ШаблоныПроцессов) Экспорт
	
КонецПроцедуры

// Выполняется при загрузке шаблонов процессов в обработке Импорта / экспорта шаблонов процессов
// Позволяет, в частности, обработать информацию, которая была добавлена
// методом ПроцессыОбработкиДокументовПереопределяемый.ПриВыгрузкеШаблоновПроцессов
//
// Параметры:
//  ТекстФайла - Строка - текстовое содержание xml-файла для загрузки
//  СоответствияОбъектов - Структура - сопоставленные объекты из файла и информационной базы-приемника:
//   * Ключ - Строка - имя соответствия, одно из значений: "СоответствиеШаблонов", "СоответствиеЭтапов",
//                     "СоответствиеСтатусов", "СоответствиеИнтервалов", "СоответствиеРолей"
//   * Значение - Соответствие:
//     * Ключ - Строка - идентификатор поддержки объекта из файла
//     * Значение - ЛюбаяСсылка - ссылка на сопоставленный объект в информационной базе-приемнике
//  ОбъектыДляЗагрузки - Структура - объекты, которые пользователь отметил для загрузки из файла:
//   * Ключ - Строка - имя соответствия, одно из значений: "ШаблоныДляЗагрузки", "ЭтапыДляЗагрузки",
//                     "СтатусыДляЗагрузки", "ИнтервалыДляЗагрузки", "РолиДляЗагрузки"
//   * Значение - Соответствие:
//     * Ключ - Строка - идентификатор поддержки объекта из файла
//     * Значение - Булево - всегда равно Истина
//
Процедура ПриЗагрузкеШаблоновПроцессов(ТекстФайла, СоответствияОбъектов, ОбъектыДляЗагрузки) Экспорт
	
КонецПроцедуры

// Процедура заполняет данные организации для заполнения положения и уведомления об использовании ПЭП
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация
//  ДанныеОрганизации - Структура - данные об организации:
//    * Регион - Строка - регион организации.
//    * Наименование - Строка - наименование организации.
//    * Фамилия - Строка - фамилия руководителя.
//    * Имя - Строка - имя руководителя.
//    * Отчество - Строка - отчество руководителя.
//    * Должность - Строка - должность руководителя.
//
Процедура ЗаполнитьРегистрационныеДанныеОрганизации(Организация, ДанныеОрганизации) Экспорт
	
КонецПроцедуры

// Выполняется при подготовке файлов первичных документов для подписания
//
// Параметры:
//  Документ - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - ссылка на учетный документ
//  КомандаПечати - СтрокаТаблицыЗначений - см. УправлениеПечатью.КомандыПечатиФормы
//  ПервичныйДокумент - Структура - данные подписываемых первичных документов
//       * Представление - Строка - представление первичного документа в окне подписания электронной подписью
//       * ВидДокумента - Строка - вид первичного документ, с которым он будет сохранен,
//                                 по умолчанию - представление команды печати
//       * ИмяФайла - Строка - имя файла mxl
//       * ИмяФайлаPDF - Строка - имя файла pdf
//
Процедура ПриПодготовкеДанныхПервичныхДокументов(Документ, КомандаПечати, ПервичныйДокумент) Экспорт
	
КонецПроцедуры

// Вызывается при создании первичного документа
// 
// Параметры:
//   Документ - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - учетный документ
//   ИдентификаторПечатнойФормы - Строка - идентификатор печатной формы (команды печати) первичного документа
//   РеквизитыУчетногоДокумента - Структура - параметры для последующего заполнения свойств документа
//    Вид - Строка
//    Номер - Строка
//    Дата - Дата
//    Организация - ОпределяемыйТип.Организация
//   СтандартнаяОбработка - Булево - Если Ложь, то не будет выполнено стандартное получение реквизитов
Процедура ПриЗаполненииРеквизитовПервичногоДокумента(Документ, ИдентификаторПечатнойФормы,
	РеквизитыПервичногоДокумента, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при создании документов БИА для последующей передачи в 1С:Архив, а именно при поиске вида документа БИА
// 
// Параметры:
//   ПараметрыВидаДокументаБИА - Структура - параметры для поиска вида первичного документа БИА
//    Предмет - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов
//    Представление - Строка
//    ИдентификаторПечатнойФормы - Строка
//    ИдентификаторОбъектаМетаданных - СправочникСсылка.ИдентификаторОбъектаМетаданных
Процедура ПриПоискеВидаДокументаБИА(ПараметрыВидаДокументаБИА) Экспорт
	
КонецПроцедуры

// Вызывается при создании задач по этапу, для проверки, существуют ли исполнители с заданными параметрами адресации
// 
// Параметры:
//   ИсполнительЭтапа - Массив - содержит значения Структура ИсполнительЭтапа - параметры определения исполнителей этапа
//   СтандартнаяОбработка - Булево - Если Ложь, то не будет выполнено стандартное получение реквизитов
Функция ПроверитьЗаданныхИсполнителейЭтапа(ИсполнителиЭтапа, СтандартнаяОбработка) Экспорт
	
	РезультатПроверки = Истина;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Вызывается при заполнении подписываемых данных этапа в формате XML для заполнения заголовочной описательной части
// 
// Параметры:
//   ДанныеДокументаДляПодписи - структура данных документа
//   Результат - структура данных результата
//
Процедура XMLДанныеОписанияПодписываемыхДокументов(ДанныеДокументаДляПодписи, Результат) Экспорт
	
КонецПроцедуры

// Вызывается для формирования структуры подписываемых данных этапа в формате XML для заполнения заголовочной описательной части
// 
// Параметры:
//   Результат - структура данных результата
//   
Процедура СтруктураРеквизитовОбъектаУчета(РеквизитыДокумента) Экспорт

КонецПроцедуры

// Вызывается для заполнения таблицы команд печати для исключения из сценариев обработки документов
//
// Параметры:
//  ТаблицаИсключений  - ТаблицаЗначений - таблица команд для исключения из ПОД
//                ** УчетныйДокумент    - ДокументСсылка - документ для которого применяется исключение.
//                ** ИдентификаторКомандыПечати - Строка - идентификатор команды.
//                ** ПричинаИсключенияКомандыПечати - Строка - текстовое сообщение для пользователя о причинах исключения из ПОД.
Процедура ПриЗаполненииТаблицыИсключенийПервичныхДокументов(ТаблицаИсключений) Экспорт

	//Пример
	 //НоваяСтрокаТаблицы=ТаблицаИсключений.Добавить();
	 //НоваяСтрокаТаблицы.УчетныйДокумент                = Документы.ПередачаОбъектовОС.ПустаяСсылка();
	 //НоваяСтрокаТаблицы.ИдентификаторКомандыПечати     = "ПечатьИнвКарточек61н";
	 //НоваяСтрокаТаблицы.СкрыватьКомандуПечати          = Ложь; 
	 //НоваяСтрокаТаблицы.ПричинаИсключенияКомандыПечати = НСтр("ru='Печатная форма предназначена для формирования бумажных документов. "+
	 //														"Для формирования формуляров первичных электронных документов ""Инвентарная карточка"" "+
	 //   													"необходимо использовать соответствующий отдельный шаблон процесса для документа вида ""Регистр учета"".'");
	
КонецПроцедуры

// Выполняется перед записью документа - предмета процесса обработки
// Вызывается из подписки на событие "ПроцессыОбработкиДокументовПередЗаписьюДокумента"
//
// Параметры:
//  Источник - ДокументОбъект - записываемый объект
//  Ссылка - ОпределяемыйТип.ПредметПроцессаОбработкиДокументов - Ссылка на объект процесса обработки документов
//  Отказ, РежимЗаписи, РежимПроведения - см. описание процедуры "ПередЗаписью" модуля документа
//  Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса документа
//  ПараметрыТекущегоЭтапа - Структура - параметры этапа
//  Отказ - Булево - признак отказа от записи файла
//
Процедура ДополнительныеПроверкиПередЗаписьюДокумента(Источник, Ссылка, РежимЗаписи, Шаблон, ПараметрыТекущегоЭтапа, Отказ) Экспорт
	
КонецПроцедуры

//Вызывается из УправлениеДоступностьюРеквизитовСогласноШаблону для учета особенностей блокировки команд документов учета прикладного решения
//
// Параметры:
//  Форма - УправляемаяФорма - Открываемая форма объекта процесса обработки документов
//
//  НедоступныеРеквизиты - Массив - перечень недоступных реквизитов, полученный из шаблона процесса для текущего этапа, вида:
//       * [ИмяТабличнойЧасти].[ИмяРеквизита] - Строка - Имя табличной части и реквизита, если ИмяТабличнойЧасти не заполнено,
//                                                       то только элемент содержит только [ИмяРеквизита] (без точки)
//
//  ЗонаОтветственности - ТаблицаЗначений - перечень имен данных в зоне ответственности текущего этапа, колонки:
//       * ИмяТабличнойЧасти - Строка - Идентификатор табличной части (коллекции), которой принадлежит реквизит
//       * ИмяРеквизита - Строка - Идентификатор реквизита
//
//  БлокируемыеЭлементы - Массив - коллекция имен реквизитов формы, которые будут недоступны для редактирования
//
Процедура ЗаблокироватьЭлементыКоманднйПанелиТабличнойЧасти(Форма, Знач НедоступныеРеквизиты, БлокируемыеЭлементы, Знач ЭлементФормы, Знач ИмяРеквизита)  Экспорт
	
КонецПроцедуры

// Возвращает дату, которая отличается указанной даты ДатаОт на количество дней,
// входящих в указанный график ГрафикРаботы.
//
// Параметры:
//  ГрафикРаботы	- СправочникСсылка.Календари - график, который необходимо использовать.
//  ДатаОт			- Дата - дата, от которой нужно рассчитать количество дней.
//  КоличествоДней	- Число - количество дней, на которые нужно увеличить дату начала ДатаОт.
//  ВызыватьИсключение - Булево - если Истина, вызывается исключение в случае незаполненного графика.
//  РасчётРегламентаПоРеквизиту - Булево - если Истина, то подсчёт происходит в обратном направлении времени.
//
// Возвращаемое значение:
//  Дата, Неопределено - дата, увеличенная на количество дней, входящих в график ГрафикРаботы.
//	                     Если график ГрафикРаботы не заполнен, и ВызыватьИсключение = Ложь, возвращается Неопределено.
Функция ПриОпределенииДатыПоГрафикуРаботы(ГрафикРаботы, ДатаОт, КоличествоДней, КоличествоЧасов) Экспорт
	
КонецФункции

// Подсчёт количества рабочих часов в дне для Графика работы.
//
// Параметры:
//	 ГрафикРаботы - СправочникСсылка - параметр, заполненный в процедуре ПроцессыОбработкиДокументовПереопределяемый.ПриОпределенииГрафикаРаботыИсполнителя
//	 Результат - Число - количество рабочих часов в дне.
// Пример:
//        Пятидневка  - Результат = 8;   
//        Шестидневка - Результат = 7; 
Процедура ПриОпределенииРабочихЧасовВДне(ГрафикРаботы, Результат) Экспорт
	
КонецПроцедуры

// Заполняет расписание работы для дат по периодам, включенных в указанные графики на указанный период.
// Если расписание на предпраздничный день не задано, то оно определяется так, как если бы этот день был бы рабочим.
//
// Параметры:
//  РасписаниеРаботы       - ТаблицаЗначений - для заполнения периодами работы в дне.
//  			*НомерДня       - Число  - номер дня в календарной неделе.
//  			*ВремяНачала    - Дата   - начало рабочего периода.
//  			*ВремяОкончания - Дата   - конец рабочего преиода.
//
// Возвращаемое значение:
// Заполненная таблица значений ТаблицаЗначений - РасписаниеРаботы.
Процедура ПриПолученииРасписанияРаботы(РасписаниеРаботы) Экспорт
	
КонецПроцедуры

// Формирует массив шаблонов процессов, для которых будет происходит проверка соответствия
//подписанных XML файлов через Хэш-Сумму файла 
//
// Параметры:
//  ШаблоныСПроверкойПодписиЧерезХэш - Массив - СправочникСсылка.ШаблоныПроцессов
//
Процедура ПриПолученииШаблоновПроверкиДанныхБольшогоОбъема(ШаблоныСПроверкойПодписиЧерезХэш) Экспорт
	 
КонецПроцедуры

//Размер подписанного XML файла в МегаБайтах, начиная с которого будет использоваться проверка
// соответствия файлов через Хэш-Сумму
// Параметры:
//  МинимальныйРазмерФайла - Число - размер файла в МБ
//
Процедура ПриПолученииРазмерФайлаПроверкиДанныхБольшогоОбъема(МинимальныйРазмерФайла) Экспорт
	
КонецПроцедуры	

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
//  ДокументыБИА - Заполняемое значение, массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
//  ВызовИсключенияПриОшибке - Булево, вызывается исключение при ошибке
//
Процедура СоздатьДокументыБИАДляДокументаУчетаЭД(СсылкаНаОбъектИсточник, ДокументыБИА, ВызовИсключенияПриОшибке = Истина) Экспорт
	
КонецПроцедуры	

// Выполняется при открытии настроек ответственности для этапа шаблона для определения переченя типов документов, для которых
// не доступен механизм управления свойствами элементов формы согласно шаблону
// Параметры:
//  СписокТиповДокументов	 - Массив	 - Массив типов документов
//
Процедура ПриПолученииОграниченийТиповДокументовУправленияСвойствамиФормы(СписокТиповДокументов) Экспорт

КонецПроцедуры

// Выполняется при инициализации формы объекта процесса обработки документов при ее открытии,
// можно описать не стандартный алгоритм управления свойствами элементов формы согласно шаблону
//
// Параметры:
//  Форма					 - УправляемаяФорма - Открываемая форма объекта процесса обработки документо 
//  НастройкиЭлементовФормы	 - ТаблицаЗначений	 - Таблица настроек элементов из табличной части УправлениеЭлементамиФормы шаблона
//  СтандартнаяОбработка	 - Булево - Если Истина, то после процедуры будет выполнено стандартное управление свойствами элементов,
//                                      Если Ложь, то значит был переопределен алгоритм управления свойствами 
//
Процедура УправлениеСвойствамиЭлементовФормыСогласноШаблону(Форма, НастройкиЭлементовФормы, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Позволяет дополнить массив МассивФункций объявлениями дополнительных серверных функций,
// которые впоследствии могут быть указаны в шаблонах процессов в качестве функций условий 
// для настроек использования шаблонов или условий перехода между этапами.
// Дополнительные функции условий используются для описания собственных алгоритмов,
// когда для построения условий недостаточно реквизитов учетного документа
// 
// Объявление функций производится в процедуре ОписаниеФункцийПредопределенныхУсловий.
// 
// Параметры:
//   МассивФункций - Массив - массив структур с ключами:
//     * Идентификатор - Строка - Строка - строковый идентификатор функции, должен соответствовать имени метода, 
//								  где описан алгоритм. Идентификатор должен быть уникален.
//     * Представление - Строка - представление функции в формах.
//     * РеквизитыИсточника – Строка –  перечень имен реквизитов документа, необходимых в функции для описания собственного алгоритма 
//     * Выражение – Строка – строковый указатель на модуль расположения экспортной функции
//     * ИсключитьИзНастроекИспользования – Булево – признак доступности выбора для настроек использования (не обязательный) 
//	   * ИсключитьИзУсловийПерехода – Булево – признак доступности выбора для настроек условий перехода (не обязательный) 
//     * ОбъектыМетаданных - Строка - имена объектов метаданных, в шаблонах для которых можно использовать функцию условия. 
//									  Объекты записываются в виде строки с разделителями "," и/или перевод строки.
//
// Пример: 
//   НоваяФункция = Новый Структура;
//   НоваяФункция.Вставить("Идентификатор", "ЗаполненРаздел1ИнвентаризационнаяОписьРасчетовСКонтрагентами");
//   НоваяФункция.Вставить("Представление", НСтр("ru = 'Для инвентаризационной описи расчетов с контрагентами (ф. 0510469) заполнен раздел 1'"));
//	 НоваяФункция.Вставить("Выражение", "ПроцессыОбработкиДокументовБГУ"); 
//	 НоваяФункция.Вставить("ИсключитьИзНастроекИспользования", Истина);
//	 НоваяФункция.Вставить("РеквизитыИсточника", "Ссылка");
//   НоваяФункция.Вставить("ОбъектыМетаданных", "Документ.ИнвентаризационнаяОписьРасчетовСКонтрагентами");
//   
//   МассивФункций.Добавить(НоваяФункция);
//
// Возвращаемое значение - Булево - результат условия.
//
// Пример:
//    Функция ЗаполненРаздел1ИнвентаризационнаяОписьРасчетовСКонтрагентами(ПараметрыИсточник1 = Неопределено)
//        
//        Возврат Истина;
//        
//    КонецФункции
//
Процедура ОписаниеФункцийПредопределенныхУсловий(МассивФункций) Экспорт
	
	
КонецПроцедуры


#Область ИнтеграцияСБЭД

Процедура ЗаполнитьРежимПоддержкиИнтеграцииСБЭД(ЕстьОбменЧерезБЭД) Экспорт

КонецПроцедуры

Процедура ЗаполнитьВсеВнешниеПроизвольныеЭлектронныеДокументыУчетногоДокумента(УчетныйДокумент, ПроизвольныеЭД) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьДоступностьВнешнегоЭДОПоПредмету(УчетныйДокумент, РезультатПроверки) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьЭлектронныеПодписиВнешнегоЭДСвязанногоСВнутреннимЭД(ФормулярЭД, Результат) Экспорт

КонецПроцедуры

Процедура ДобавитьШтампыЭлектронныхПодписейВнешнегоЭД(ТабличныйДокументЭД, ЭлектронныеПодписиВнешнегоЭД, Организация, ВыводитьДатуПодписи = Истина,
	ВыводитьШтампыТолькоКонтрагента = Истина) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//Позволяет выполнить команду из карточки процесса в безопасном режиме из текущего модуля
// 
// Параметры:
//     Идентификатор - Строка - строковый идентификтор команды, должен быть уникален.
//     Параметры - Структура - параметры команды карточки процессов.
//
// Пример: 
//   УстановитьБезопасныйРежим(Истина);
//   Выполнить Идентификатор + "(Параметры)";
//
Процедура ВыполнитьКомандуКарточкиПроцессаДокумента(Идентификатор, Параметры) Экспорт
	
КонецПроцедуры

//Позволяет вычислить зависимые объекты в безопасном режиме из текущего модуля
// 
// Параметры:
//     Идентификатор - Строка - строковый идентификтор метода, должен быть уникален.
//     Параметры - Структура - параметры метода.
//
// Пример: 
//   УстановитьБезопасныйРежим(Истина);
//   Выполнить Идентификатор + "(Параметры)";
//
Функция ЗависимыеОбъекты(Идентификатор, Параметры) Экспорт

КонецФункции

//Позволяет вычислить исполнителей этапа в безопасном режиме из текущего модуля
// 
// Параметры:
//     Идентификатор - Строка - строковый идентификтор функции адресации, должен быть уникален.
//     Параметры - Структура - параметры функции адресации.
//
// Пример: 
//   УстановитьБезопасныйРежим(Истина);
//   Выполнить Идентификатор + "(Параметры)";
//
Функция Исполнители(Идентификатор, Параметры) Экспорт
		
КонецФункции

Процедура УдалитьПодпись(Объект, ПорядковыйНомер, ИдентификаторФормы = Неопределено,
			ВерсияОбъекта = Неопределено, ЗаписанныйОбъект = Неопределено, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПодпись(Объект, Знач СвойстваПодписи, ИдентификаторФормы = Неопределено,
			ВерсияОбъекта = Неопределено, ЗаписанныйОбъект = Неопределено, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ОбновитьПодпись(Объект, Знач СвойстваПодписи, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Функция УстановленныеПодписи(Объект, СтандартнаяОбработка) Экспорт
	
	МассивЭлектронныхПодписей = Новый Массив;
	
	Возврат МассивЭлектронныхПодписей;
	
КонецФункции

Функция УстановленныеПодписиДляФормуляраПОД(Объект, СтандартнаяОбработка) Экспорт
	
	МассивЭлектронныхПодписей = Новый Массив;
	
	Возврат МассивЭлектронныхПодписей;
	
КонецФункции

Функция ШтампВизуализацииЭлектроннойПодписи(Сертификат, ДатаПодписи = Неопределено, ТекстОтметки = "",
			ЛоготипОрганизации = Неопределено, СведенияМЧД = Неопределено, СтандартнаяОбработка) Экспорт
	
	Возврат Новый ТабличныйДокумент;
	
КонецФункции

Процедура ПолучитьЭлектронныеПодписиДляПроверки(Документ, Шаблон, ИдентификаторЭтапа, МассивЭлектронныхПодписей) Экспорт
	
КонецПроцедуры

Процедура ДобавитьШтампыВТабличныйДокумент(Ссылка, Шаблон, ИмяМакета, Документ, ОписаниеШтампов, Размеры = Неопределено, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура НаименованиеОрганизацииВШтампеПЭП(НаименованиеОрганизации, Организация = Неопределено) Экспорт
	
	  
КонецПроцедуры

// Параметры:
//  ШаблонДокумента - СправочниСсылка.ШаблоныПроцессов - текущий шаблон зависимого документа
//  НайстрокаВлияния - Строка табличной части - строка табличной части "ВлияниеНаДругиеПроцессы" влияющего шаблона процесса
Функция ВыполненоАльтернативноеУсловиеДляЗависимогоШаблона(Знач ШаблонДокумента, НайстрокаВлияния) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Выполняется в транзакции выполнения задачи после ее записи, но до выполнения запуска и прерывания других задач
//
// Параметры:
//  Документ - ДокументСсылка - обрабатываемый документ
//  Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса обработки документа
//  ИдентификаторЭтапа - УникальныйИдентификатор - уникальный идентификатор этапа шаблона процесса
//  Статус - СправочникСсылка.СтатусыДокументов - результат выполнения текущей задачи
//  Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - выполненная задача
Процедура ПередЗапускомПрерываниемСледующихЭтапов(Документ, Шаблон, ИдентификаторЭтапа, Статус, Задача) Экспорт
	
КонецПроцедуры

Процедура УстановленныеПодписиДляШтампа(Документ, Шаблон, ИдентификаторКомандыПечати, ЭлектронныеПодписиРезультат) Экспорт
	
КонецПроцедуры

// Возвращает перечень свойств XML для подписи данных, которые могут содержать потенциально большой объем данных.
// Для элементов перечня сверка данных при подписи выполняется упрощенно, по общему соответствию, без разбора XML в структуру.
//
Функция ИменаСвойствXMLБольшогоОбъема() Экспорт
	
	// Массив содержит имена свойств.
	// Например: "РегистрУчета_ДанныеОтчета" - специальный реквизит "ДанныеОтчета" документа "РегистрУчета".
	ИменаСвойствXML = Новый Массив;
	
	Возврат ИменаСвойствXML;
	
КонецФункции

// Возвращает типы документов содержащие реквизиты больших объемов, например, данные табличных документов.
// Для элементов перечня сверка данных при подписи выполняется упрощенно, с возможностью исключить реквизиты полученные функцией ИменаСвойствXMLБольшогоОбъема.
//
Функция ТипыДокументовXMLБольшогоОбъема() Экспорт
	
	// Массив содержит типы документов с данными большого объема.
	// Например: Тип("ДокументСсылка.РегистрУчета").
	ТипыДокументовXMLБольшогоОбъема = Новый Массив;
	
	Возврат ТипыДокументовXMLБольшогоОбъема;
	
КонецФункции

// Возвращает необходимость отображения настроек обмена с личным кабинетом для базы данных.
// Механизм обмена с личным кабинетом используется в тестовом режиме, поэтому по умолчанию отображение настроек не выполняется.
//
Функция ВидимостьНастройкиОбменСЛичнымКабинетом() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// При рассылке уведомлений о состоянии задач может требоваться вывод специфической для конфигурации информации.
// Возвращает текст дополнительной информации, выводимый после наименования текущей задачи.
//
// Параметры:
//  ЗадачаСтруктура - Структура - задача, по которой выполняется отправка уведомления
Функция СформироватьДополнительноеПредставлениеЗадачи(Знач ЗадачаСтруктура) Экспорт
	
	ДополнительноеПредставлениеЗадачи = "";
	
	// Например: 
	// Для задачи требуется вывести значение поля "Организация" связанного документа.
	//
	//ДополнительноеПредставлениеЗадачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//	НСтр("ru = 'Организация: %1'"), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗадачаСтруктура.Предмет, "Организация"));
	
	Возврат ДополнительноеПредставлениеЗадачи;
	
КонецФункции

// Процедура - При получении формы видов присоединенных файлов, для открытия формы справочника,
//             который будет являться базовым для выбора наименования видов присоединяемых файлов
// Параметры:
//  ВыбраннаяФорма - Строка - для переопределения формы справочника, 
//							пример: "Справочник.ВидыПрисоединенныхФайлов.ФормаВыбора"
Процедура ПриПолученииФормыВидовПрисоединенныхФайлов(ВыбраннаяФорма) Экспорт
	
	
КонецПроцедуры

//Вызывается для проверки необходимости отображения даты подписания в штампе электронной подписи
//
// Параметры:
//  Параметры - Структура - со свойствами для получения даты подписания
//   
Функция ОтображатьДатуПодписанияВШтампе(Параметры) Экспорт
	
	Возврат Истина;
	
КонецФункции

//Выполняется при вызове формы выбора документа из обработки Запуск этапа процесса.
// В процедуре можно переопределить именя формы выбора.
//
// Параметры:
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор объекта метаданных
//  ИмяФормы - Строка - Имя формы выбора для учетного документа
Процедура ПриОпределенииФормыВыбораДляЗапускаЭтапаПроцесса(ИдентификаторДокумента, ИмяФормы) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеКомандыКарточкиПроцессаДокумента

#КонецОбласти

#Область ДополнительныеФункцииПоискаЗависимыхОбъектов

// Пример дополнительной функции поиска зависимых объектов.
// Для использования необходимо в процедуре ОписаниеФункцийПоискаЗависимыхОбъектов вставить объявление функции:
//
//   НоваяФункция = Новый Структура;
//   НоваяФункция.Вставить("Идентификатор", "СчетаФактурыПолученныеДокументовПоступления");
//   НоваяФункция.Вставить("Представление", НСтр("ru = 'Счета-фактуры полученные'"));
//   НоваяФункция.Вставить("ВлияющиеОбъектыМетаданных", "Документ.ПоступлениеМЗ,
//   												|Документ.ПоступлениеОС");
//   НоваяФункция.Вставить("ЗависимыеОбъектыМетаданных", "Документ.СчетФактураПолученный");
//   МассивФункций.Добавить(НоваяФункция);
//
// Код функции выполняется в одной транзакции с обработчиком выполнения этапа процесса
// 
// Параметры функции:
//   Источник - ДокументСсылка - ссылка на влияющий объект.
//
//Функция СчетаФактурыПолученныеДокументовПоступления(Источник)
//	
//	МассивСФ = Новый Массив;
//	
//	СФ = УчетНДС.НайтиПодчиненныйСчетФактуру(Источник, "СчетФактураПолученный");
//	Если ЗначениеЗаполнено(СФ) Тогда
//		МассивСФ.Добавить(СФ);
//	КонецЕсли;
//	
//	Возврат МассивСФ;
//	
//КонецФункции

#КонецОбласти

#Область ДополнительныеФункцииОпределенияИсполнителейЭтапа

// Пример дополнительной функции определения исполнителей этапа.
// Для использования необходимо в процедуре ОписаниеФункцийОпределенияИсполнителейЭтапа вставить объявление функции:
//
//   НоваяФункция = Новый Структура;
//   НоваяФункция.Вставить("Идентификатор", "ЧленыКомиссии");
//   НоваяФункция.Вставить("Представление", НСтр("ru = 'Члены комиссии'"));
//   НоваяФункция.Вставить("ОбъектыМетаданных", "Документ.СписаниеВосстановлениеЗадолженностиПоДоходам");
//   
//   МассивФункций.Добавить(НоваяФункция);
//
// Код функции выполняется при запуске очередного этапа процесса
// 
// Параметры функции:
//   Источник - ДокументСсылка - ссылка на влияющий объект
//            - ДанныеФормыСтруктура - влияющий объект, для случая вызова до первой записи документа.
//
// Возвращаемое значение:
//   Массив структур с ключами:
//     * Исполнитель - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителей - исполнитель этапа.
//     * ОсновнойОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - основной объект адресации (для ролевой адресации)
//     * ДополнительныйОбъектАдресации - Характеристика.ОбъектыАдресацииЗадач - дополнительный объект адресации (для ролевой адресации)
//     * НеСоздаватьЗадачу - Булево - признак создания задачи исполнителю, имеет смысл устанавливать для групповых задач, когда некоторым
//                                    исполнителям не требуется создавать задачу, но они могуть позже созданы вручную куратором этапа

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
