
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки,
		"МедицинскиеОсмотры");
КонецПроцедуры

#КонецОбласти

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотры.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.МедицинскиеОсмотры.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект, Замещение) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ТаблицаОбновлениеПериодическихОсмотров", МедицинскиеОсмотры.НоваяТаблицаОбновлениеПериодическихОсмотров());
	Объект.ДополнительныеСвойства.Вставить("ТаблицаБудущиеСобытияМедицинскиеОсмотры", МедицинскиеОсмотры.НоваяТаблицаБудущиеСобытияМедицинскиеОсмотры());
	ДополнитьТаблицыОбновления(Объект, Замещение);
	
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект, Замещение) Экспорт
	ДополнитьТаблицыОбновления(Объект, Замещение);
КонецПроцедуры

Процедура ДополнитьТаблицыОбновления(Объект, Замещение) Экспорт
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	Регистраторы = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(Объект, Замещение, "Регистратор");
	Если Регистраторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", Регистраторы);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеНабора.Период КАК ДатаСобытия,
		|	ДанныеНабора.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеНабора.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	РегистрСведений.МедицинскиеОсмотры КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.Регистратор В (&Регистраторы)";
	
	ДанныеНабора = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаНабора Из ДанныеНабора Цикл
		НоваяСтрока = Объект.ДополнительныеСвойства["ТаблицаОбновлениеПериодическихОсмотров"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
		Если ТекущаяДата >= СтрокаНабора.ДатаСобытия Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект.ДополнительныеСвойства["ТаблицаБудущиеСобытияМедицинскиеОсмотры"].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНабора);
	КонецЦикла;
	
	Объект.ДополнительныеСвойства["ТаблицаОбновлениеПериодическихОсмотров"].Свернуть("ФизическоеЛицо, ГоловнаяОрганизация");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
