#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Пользователь", Пользователи.АвторизованныйПользователь());
	УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Истина);
	УстановитьУсловноеОформление();
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(
		ЭтотОбъект, "Список.ДатаСостояния", Элементы.СписокДатаСостояния.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуНеЗагруженногоКандидата(Элементы.Список.ТекущиеДанные.Идентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьОтложенных(Команда)
	ТекущееСостояние = Не Элементы.СписокПоказыватьОтложенных.Пометка;
	УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Не ТекущееСостояние);
	Элементы.СписокПоказыватьОтложенных.Пометка = ТекущееСостояние;
	Элементы.СписокКонтекстноеМенюПоказыватьОтложенных.Пометка = ТекущееСостояние;
КонецПроцедуры

&НаКлиенте
Процедура Отложить(Команда)
	НачатьУстановкуПометкиОтложенаВыделенныхСтрок();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИспользованиеОтбораПоказыватьОтложенных(Список, Использование)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Отложена", Ложь, , , Использование);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНеЗагруженногоКандидата(Идентификатор)
	ОткрытьФорму("РегистрСведений.ЗагрузкаКандидатовИзИнтернета.Форма.НеЗагруженныйКандидат", 
		Новый Структура("Идентификатор", Идентификатор), ЭтотОбъект, Идентификатор);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Отложенных показывать серым цветом.
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Поля.Элементы.Добавить().Поле = Новый ПолеКомпоновкиДанных("Список");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементОформления.Отбор, "Список.Отложена", Истина);
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстПодобранногоЗначенияЦвет);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуПометкиОтложенаВыделенныхСтрок()

	Идентификаторы = Новый Массив;

	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		Идентификаторы.Добавить(Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока).Идентификатор);
	КонецЦикла;

	Если Идентификаторы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = ДлительнаяОперацияУстановкиПометкиОтложена(Идентификаторы, ЭтотОбъект.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Установка пометки Отложена'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
	ПараметрыОжидания.ОповещениеПользователя.Текст = НСтр("ru = 'Загрузки отложены'");
	ПараметрыОжидания.ОповещениеПользователя.Пояснение = 
		НСтр("ru = 'Теперь их можно увидеть по команде «Показывать отложенные»'");

	ДополнительныеПараметры = Новый Структура("ОтложенныеЗаписи", Элементы.Список.ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьУстановкуПометкиОтложенаВыделенныхСтрок", 
		ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьУстановкуПометкиОтложенаВыделенныхСтрок(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;

	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъектов(ДополнительныеПараметры.ОтложенныеЗаписи);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперацияУстановкиПометкиОтложена(ИдентификаторыЗагрузок, ИдентификаторФормы)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Установка пометки Отложена для загрузок кандидатов из Интернета'");
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"РегистрыСведений.ЗагрузкаКандидатовИзИнтернета.ОтложитьЗагрузкиКандидатов", ИдентификаторыЗагрузок);
	
КонецФункции

#КонецОбласти