#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
// Добавить сведения о файле обмена.
// 
// Параметры:
//  СведенияОФайлеОбмена - Структура - см. ОбменСАрхивом.НовыеСведенияОФайлеОбмена().
//  Направление - ПеречислениеСсылка.НаправленияОбменаС1САрхивом - направления обмена.
//
Процедура ДобавитьОбновитьФайлОбмена(СведенияОФайлеОбмена, Направление) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяФайла.Установить(СведенияОФайлеОбмена.ИмяФайлаОбмена);
		НаборЗаписей.Отбор.Направление.Установить(Направление);
		
		НаборЗаписей.Прочитать();
		
		ХешСуммаФайла = "";
		Если НаборЗаписей.Количество() > 0 Тогда
			ТекущаяЗапись = НаборЗаписей[0];
			ХешСуммаФайла = ТекущаяЗапись.ХешСумма;
		Иначе
			ТекущаяЗапись = НаборЗаписей.Добавить();
		КонецЕсли;
		
		ТекущаяЗапись.Состояние = Перечисления.СостоянияОбменаФайлами.Ожидание;
		ТекущаяЗапись.Направление = Направление;
		ТекущаяЗапись.ИмяФайла = СведенияОФайлеОбмена.ИмяФайлаОбмена;
		ТекущаяЗапись.ДатаСоздания = ТекущаяУниверсальнаяДата();
		ТекущаяЗапись.ДатаУстановкиСостояния = ТекущаяУниверсальнаяДата();
		ТекущаяЗапись.ВсегоЧастей = СведенияОФайлеОбмена.ВсегоЧастейФайлаОбмена;
		ТекущаяЗапись.ХешСумма = СведенияОФайлеОбмена.ХешСуммаФайлаОбмена;
		
		НаборЗаписей.Записать();
		
		Если ЗначениеЗаполнено(ХешСуммаФайла) И ХешСуммаФайла <> СведенияОФайлеОбмена.ХешСуммаФайлаОбмена Тогда
			РегистрыСведений.ДвоичныеДанныеФайловОбмена.УдалитьФайлыОбмена(СведенияОФайлеОбмена.ИмяФайлаОбмена,
				Направление);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Получает порцию файлов обмена из РС, если файл состоит из частей, соединяет их в один файл и выгружает
// во временную папку на сервере.
// 
// Параметры:
//  ВременнаяПапка - Строка - временная папка, в которую выгружаются файлы
//  ЛимитКоличестваФайлов - Число - предельное количество файлов для возвращаемой таблицы
// 
// Возвращаемое значение:
//  ТаблицаЗначений - найти файлы обмена:
// * Имя - Строка - имя файла с расширением
// * ПолноеИмяНаСервере - Строка - полный путь к файлу на сервере.
// * Состояние - ПеречислениеСсылка.СостоянияОбменаФайлами - состояние обмена файлами.
//
Функция ПорцияФайловДляЗагрузки(ВременнаяПапка, ЛимитКоличестваФайлов) Экспорт
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("Имя");
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяНаСервере");
	ТаблицаФайлов.Колонки.Добавить("Состояние");
	
	СостоянияОбменаФайлами = Новый Массив;
	СостоянияОбменаФайлами.Добавить(Перечисления.СостоянияОбменаФайлами.Ошибка);
	СостоянияОбменаФайлами.Добавить(Перечисления.СостоянияОбменаФайлами.Принят);
	
	Направление = Перечисления.НаправленияОбменаС1САрхивом.Получение;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФайлыОбмена.ИмяФайла КАК Имя
		|ИЗ
		|	РегистрСведений.ФайлыОбменаСАрхивом КАК ФайлыОбмена
		|ГДЕ
		|	ФайлыОбмена.Состояние В (&СостоянияОбменаФайлами)
		|	И ФайлыОбмена.Направление = &НаправлениеОбмена
		|	И ФайлыОбмена.КоличествоПопытокОбработки <= &КоличествоПопытокОбработки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Имя");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 1", "ВЫБРАТЬ ПЕРВЫЕ " + Формат(ЛимитКоличестваФайлов,
		"ЧГ=0"));
	Запрос.УстановитьПараметр("НаправлениеОбмена", Направление);
	Запрос.УстановитьПараметр("СостоянияОбменаФайлами", СостоянияОбменаФайлами);
	Запрос.УстановитьПараметр("КоличествоПопытокОбработки", 3);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ДанныеСообщения = РегистрыСведений.ДвоичныеДанныеФайловОбмена.ПолучитьДвоичныеДанныеЧастейФайла(
				Выборка.Имя, Направление);
			
			Если Не ЗначениеЗаполнено(ДанныеСообщения) Тогда
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при получении двоичных данных файла ""%1""'"),
					Выборка.Имя);
			КонецЕсли;
			
			ПолноеИмяФайлаОбмена = ВременнаяПапка + Выборка.Имя;
			ДанныеСообщения.Записать(ПолноеИмяФайлаОбмена);
			
			НоваяСтрока = ТаблицаФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ПолноеИмяНаСервере = ПолноеИмяФайлаОбмена;
		
		Исключение
			
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭтоЗагрузкаДанных = ?(Направление = Перечисления.НаправленияОбменаС1САрхивом.Получение, Истина, Ложь);
			Событие = ОбменСАрхивом.СобытиеДляЛога(Выборка.Имя, ЭтоЗагрузкаДанных);
			Событие.ТипСобытия = Перечисления.СобытияОбменаС1САрхивом.Ошибка;
			Событие.КраткоеОписание = СтрШаблон(
				НСтр("ru = 'Ошибка при получении файла ""%1"" или его частей'"), Выборка.Имя);
			Событие.ДополнительныеСведения = ПодробноеПредставлениеОшибки;
			ОбменСАрхивом.ЗаписатьВЛог(Событие);
		
			ЗафиксироватьНеудачнуюПопытку(Выборка.Имя, Направление, ПодробноеПредставлениеОшибки);
				
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаФайлов;
	
КонецФункции

// Получает файл обмена из РС для просмотра из Истории обмена.
// 
// Параметры:
//  ИмяФайла - Строка - имя файла для открытия из истории обмена
//  Направление - ПеречислениеСсылка.НаправленияОбменаС1САрхивом - направление обмена
//  ВременнаяПапка - Строка - временная папка, в которую выгружаются файлы
// 
// Возвращаемое значение:
//  ТаблицаЗначений - найти файл обмена:
// * Имя - Строка - имя файла с расширением.
// * ПолноеИмяНаСервере - Строка - полный путь к файлу на сервере.
//
Функция ПолучитьФайлОбменаДляИстории(ИмяФайла, Направление, ВременнаяПапка) Экспорт
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("Имя");
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмяНаСервере");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФайлыОбмена.ИмяФайла КАК Имя
		|ИЗ
		|	РегистрСведений.ФайлыОбменаСАрхивом КАК ФайлыОбмена
		|ГДЕ
		|	ФайлыОбмена.Направление = &НаправлениеОбмена
		|	И ФайлыОбмена.ИмяФайла = &ИмяФайла");
	Запрос.УстановитьПараметр("НаправлениеОбмена", Направление);
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			ДанныеСообщения = РегистрыСведений.ДвоичныеДанныеФайловОбмена.ПолучитьДвоичныеДанныеЧастейФайла(
				Выборка.Имя, Направление);
			
			Если Не ЗначениеЗаполнено(ДанныеСообщения) Тогда
				Продолжить;
			КонецЕсли;
			
			ПолноеИмяФайлаОбмена = ВременнаяПапка + Выборка.Имя;
			ДанныеСообщения.Записать(ПолноеИмяФайлаОбмена);
			
			НоваяСтрока = ТаблицаФайлов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.ПолноеИмяНаСервере = ПолноеИмяФайлаОбмена;
		
		Исключение
			
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЭтоЗагрузкаДанных = ?(Направление = Перечисления.НаправленияОбменаС1САрхивом.Получение, Истина, Ложь);
			Событие = ОбменСАрхивом.СобытиеДляЛога(Выборка.Имя, ЭтоЗагрузкаДанных);
			Событие.ТипСобытия = Перечисления.СобытияОбменаС1САрхивом.Ошибка;
			Событие.КраткоеОписание = СтрШаблон(
				НСтр("ru = 'Ошибка при получении файла ""%1"" или его частей'"), Выборка.Имя);
			Событие.ДополнительныеСведения = ПодробноеПредставлениеОшибки;
			ОбменСАрхивом.ЗаписатьВЛог(Событие);
				
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаФайлов;
	
КонецФункции

// Фиксирует информацию о неудачной попытке загрузки/выгрузки файла.
// 
// Параметры:
//  ИмяФайла - Строка - имя файла.
//  Направление - ПеречислениеСсылка.НаправленияОбменаС1САрхивом - направление обмена.
//  ТекстОшибки - Строка - текст ошибки.
//
Процедура ЗафиксироватьНеудачнуюПопытку(ИмяФайла, Направление, ТекстОшибки = "") Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Направление.Установить(Направление);
	НаборЗаписей.Отбор.ИмяФайла.Установить(ИмяФайла);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.КоличествоПопытокОбработки = Запись.КоличествоПопытокОбработки + 1;
		Запись.ТекстОшибки = ТекстОшибки;
		Запись.Состояние = Перечисления.СостоянияОбменаФайлами.Ошибка;
		Запись.ДатаУстановкиСостояния = ТекущаяУниверсальнаяДата();
	КонецЦикла;
		
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Устанавливает новое состояние файла обмена.
// 
// Параметры: 
//  ИмяФайла - Строка - имя файла обмена.
//  Направление - ПеречислениеСсылка.НаправленияОбменаС1САрхивом - направление обмена.
//  Состояние - ПеречислениеСсылка.СостоянияОбменаФайлами - новое состояние.
//
Процедура УстановитьСостояние(ИмяФайла, Направление, Состояние) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Направление.Установить(Направление);
	НаборЗаписей.Отбор.ИмяФайла.Установить(ИмяФайла);
	НаборЗаписей.Прочитать();
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.ТекстОшибки = "";
		Запись.Состояние = Состояние;
		Запись.ДатаУстановкиСостояния = ТекущаяУниверсальнаяДата();
	КонецЦикла;
		
	НаборЗаписей.Записать();

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
