#Область СлужебныйПрограммныйИнтерфейс

#Область ОткрытиеФорм

Процедура ОткрытьФормуМатериальнаяОтветственность(Форма, Организация, ФизическоеЛицо, ИзФормыСотрудника) Экспорт
	
	Отбор = Новый Структура("Организация, ФизическоеЛицо", Организация, ФизическоеЛицо);
	ПараметрыФормы = Новый Структура("ФизическоеЛицо, Отбор, ИзФормыСотрудника", ФизическоеЛицо, Отбор, ИзФормыСотрудника);
	ОткрытьФорму("РегистрСведений.МатериальноОтветственныеЛица.Форма.МатериальнаяОтветственность", ПараметрыФормы, Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкиЗаполнения

Процедура ПроверитьМатериальнуюОтветственность(Организация, Сотрудники, Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ПрошлиПроверкуМатериальнойОтветственности") Тогда
		Возврат;
	КонецЕсли;
	
	ФизическиеЛица = МатериальноОтветственныеЛицаВызовСервера.ФизическиеЛицаСотрудников(Сотрудники);
	МатериальнаяОтветственностьФизическихЛиц = МатериальноОтветственныеЛицаВызовСервера.ПроверкаМатериальнойОтветственностиФизическихЛиц(Организация, ФизическиеЛица, Истина);
	Если МатериальнаяОтветственностьФизическихЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Отказ = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("Отказ", Отказ);
	
	ТекстВопроса = "";
	Для Каждого МатериальноОтветственноеЛицо Из МатериальнаяОтветственностьФизическихЛиц Цикл
		ТекстВопроса = ТекстВопроса
			+ СтрШаблон(НСтр("ru='Сотрудник %1 является материально ответственным лицом, требуется контроль передачи материальных ценностей.'"), МатериальноОтветственноеЛицо.Ключ)
			+ Символы.ПС;
	КонецЦикла;
	ТекстВопроса = ТекстВопроса + НСтр("ru = 'Провести документ?'");
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьМатериальнуюОтветственностьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

Процедура ПроверитьМатериальнуюОтветственностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;
	ПараметрыЗаписи.Вставить("ПрошлиПроверкуМатериальнойОтветственности", Истина);
	
	Форма.Записать(ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти