#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ВидДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ВидДокумента = Параметры.ВидДокумента;
	
	Заголовок = СтрШаблон(НСтр("ru = '%1 (образец)'"), ВидДокумента);
	
	ЗаполнитьСотрудникаПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодготовитьОбразец();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ЗапомнитьСотрудникаПоУмолчанию(Сотрудник);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	ПодготовитьОбразец();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ДатаДокумента", ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрыОткрытия.Вставить("ВидДокумента", ВидДокумента);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыОткрытия.Вставить("ОтключитьОтборПоДатеПоследнегоДокумента", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборСотрудника", ЭтотОбъект);
	ОткрытьФорму("Справочник.ВидыДокументовЭДОБЗК.Форма.ФормаВыбораПубликуемыхСотрудников",ПараметрыОткрытия, ЭтотОбъект, Ложь, , , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСотрудника(ВыбранныеСотрудники, ДополнительныеПараметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеСотрудники) Тогда
		Сотрудник = ВыбранныеСотрудники[0].Сотрудник;
		ПодготовитьОбразец();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодготовитьОбразец()
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДлительнаяОперация = ПодготовитьОбразецНаСервере();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Оповещение = Новый ОписаниеОповещения("ПриЗавершенииПоискаНастроек", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	Иначе
		ОбразецДокументаВида = Новый ТабличныйДокумент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииПоискаНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда // Пользователь отменил задание.
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Возврат;
	КонецЕсли;
	
	ОбразецДокументаВида = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьОбразецНаСервере()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Справочники.ВидыДокументовЭДОБЗК.ОбразецДокумента",
		ВидДокумента, Сотрудник);
	
КонецФункции

&НаСервере
Процедура ЗапомнитьСотрудникаПоУмолчанию(СотрудникПоУмолчанию)
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
		"ВидыДокументовЭДОБЗК", "СотрудникДляПодготовкиОбразца", СотрудникПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСотрудникаПоУмолчанию()
	
	Сотрудник = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(
		"ВидыДокументовЭДОБЗК", "СотрудникДляПодготовкиОбразца");
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудника(
			Истина, Сотрудник, "ОформленПоТрудовомуДоговору,ДатаЗавершенияРаботы,ИмеетКабинетСотрудника", ТекущаяДатаСеанса());
		Если Не СотрудникСоответствуетТребованиямДляПодготовкиОбразца(КадровыеДанные) Тогда
			Сотрудник = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Сотрудник = ПервыйПубликуемыйСотрудник();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПервыйПубликуемыйСотрудник()
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.НачалоПериода = НачалоДня(ТекущаяДатаСеанса());
	ПараметрыПолучения.ОкончаниеПериода = КонецДня(ПараметрыПолучения.НачалоПериода);
	ПараметрыПолучения.КадровыеДанные = "ОформленПоТрудовомуДоговору,ДатаЗавершенияРаботы,ИмеетКабинетСотрудника";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолучения);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	СотрудникиОрганизации.ОформленПоТрудовомуДоговору КАК ОформленПоТрудовомуДоговору,
		|	СотрудникиОрганизации.ДатаЗавершенияРаботы КАК ДатаЗавершенияРаботы,
		|	СотрудникиОрганизации.ИмеетКабинетСотрудника КАК ИмеетКабинетСотрудника
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
		|ГДЕ
		|	СотрудникиОрганизации.ИмеетКабинетСотрудника
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если СотрудникСоответствуетТребованиямДляПодготовкиОбразца(Выборка) Тогда
			Возврат Выборка.Сотрудник;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СотрудникСоответствуетТребованиямДляПодготовкиОбразца(КадровыеДанные)
	Если КадровыеДанные <> Неопределено
		И КадровыеДанные.ОформленПоТрудовомуДоговору Тогда
		
		Если КадровыеДанные.ИмеетКабинетСотрудника
			И (Не ЗначениеЗаполнено(КадровыеДанные.ДатаЗавершенияРаботы)
				Или КадровыеДанные.ДатаЗавершенияРаботы < ТекущаяДатаСеанса()) Тогда
			
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

#КонецОбласти
