#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализКадровогоПлана");
	НастройкиВарианта.Описание = НСтр("ru = 'План-фактный анализ кадрового плана по ставкам и показателям.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализКадровогоПланаДиаграмма");
	НастройкиВарианта.Описание = НСтр("ru = 'Анализ сценариев кадрового плана по ставкам и показателям.'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли