////////////////////////////////////////////////////////////////////////////////
// Подсистема "Медицинское страхование"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция СтруктураИменТаблиц() Экспорт
	
	СтруктураИменТаблиц = Новый Структура;
	СтруктураИменТаблиц.Вставить("ИмяТаблицыСотрудники", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыПрограммыСтрахованияСотрудников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыРасширенийПрограммСтрахованияСотрудников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыРодственники", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыПрограммыСтрахованияРодственников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыРасширенийПрограммСтрахованияРодственников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыСведенияСотрудников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыСведенияРодственников", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыПоказатели", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыГрафикУдержаний", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыДанныеЗастрахованных", Неопределено);
	СтруктураИменТаблиц.Вставить("ИмяТаблицыКонтактнаяИнформацияЗастрахованных", Неопределено);
	
	Возврат СтруктураИменТаблиц;
	
КонецФункции

Процедура ПрикреплениеКПрограммамСтрахованияЗаполнить(Форма, СтруктураИменТаблиц, ЗаполнятьКонтактнуюИнформацию, ЗаполнятьПрограммыСтрахования, ЗаполнятьРасширенияСтрахования, Сотрудники = Неопределено, ИсключаемыйРегистратор = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	// Очистим данные
	МассивСотрудников = Новый Массив;
	ЗаполняемыеТаблицыСотрудников = Новый Массив;
	Если СтруктураИменТаблиц.ИмяТаблицыСотрудники <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыСведенияСотрудников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыСведенияСотрудников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыПоказатели <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПоказатели]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыГрафикУдержаний <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыГрафикУдержаний]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыДанныеЗастрахованных <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыДанныеЗастрахованных]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыКонтактнаяИнформацияЗастрахованных <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыКонтактнаяИнформацияЗастрахованных]);
	КонецЕсли;
	ЗаполняемыеТаблицыФизическихЛиц = Новый Массив;
	Если СтруктураИменТаблиц.ИмяТаблицыРодственники <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРодственники]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников <> Неопределено Тогда
		ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников]);
	КонецЕсли;
	Если СтруктураИменТаблиц.ИмяТаблицыСведенияРодственников <> Неопределено Тогда
		ЗаполняемыеТаблицыСотрудников.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыСведенияРодственников]);
	КонецЕсли;
	
	Если Сотрудники = Неопределено Тогда
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыСотрудников Цикл
			ЗаполняемаяТаблица.Очистить();
		КонецЦикла;
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
			ЗаполняемаяТаблица.Очистить();
		КонецЦикла;
	Иначе
		Если ТипЗнч(Сотрудники) = Тип("Массив") Тогда
			МассивСотрудников = Сотрудники;
		Иначе
			МассивСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудники);
		КонецЕсли;
		
		Для Каждого СотрудникМассива Из МассивСотрудников Цикл
			
			СтруктураОтбора = Новый Структура("Сотрудник", СотрудникМассива);
			Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыСотрудников Цикл
				НайденныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ЗаполняемаяТаблица.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			
			СтруктураОтбора = Новый Структура("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникМассива, "ФизическоеЛицо"));
			Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
				НайденныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ЗаполняемаяТаблица.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// Получим сведения по сотрудникам, не прикрепленных к программам страхования
	Если Не ЗначениеЗаполнено(Объект.ДоговорСтрахования) Тогда
		// Показываем только сводные сведения
		Возврат;
	КонецЕсли;
	
	ДанныеДоговора = Справочники.ДоговорыСтрахования.ДанныеДоговора(Объект.ДоговорСтрахования);
	Если ДанныеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачалаСтрахования = ДанныеДоговора.ДатаНачалаСтрахования;
	Объект.ДатаОкончанияСтрахования = ДанныеДоговора.ДатаОкончанияСтрахования;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("ДатаНачалаСтрахования", Объект.ДатаНачалаСтрахования);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса() + (Форма.СдвигДатыПрикрепления * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах()));
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключаемыйРегистратор = Неопределено, Документы.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПустаяСсылка(), ИсключаемыйРегистратор));
	
	КадровыеДанные = Новый Массив;
	КадровыеДанные.Добавить("Организация");
	КадровыеДанные.Добавить("ДатаПриема");
	КадровыеДанные.Добавить("Должность");
	КадровыеДанные.Добавить("Подразделение");
	КадровыеДанные.Добавить("ДатаРождения");
	КадровыеДанные.Добавить("Фамилия");
	КадровыеДанные.Добавить("Имя");
	КадровыеДанные.Добавить("Отчество");
	КадровыеДанные.Добавить("ОсновноеРабочееМестоВОрганизации");
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	Для Каждого Сведение Из ОтправляемыеДанные Цикл
		КадровыеДанные.Добавить(Сведение);
	КонецЦикла;
	
	Если МассивСотрудников.Количество() > 0 Тогда
		
		Запрос.УстановитьПараметр("Сотрудники", МассивСотрудников);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	&ДатаНачалаСтрахования КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиДляПерезаполнения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка В(&Сотрудники)";
		
		Запрос.Выполнить();
		
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиДляПерезаполнения");
		ЗарплатаКадры.ДополнитьКадровымиДаннымиНастройкиПорядкаСписка(КадровыеДанные);
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТСотрудникиОрганизации
		|ИЗ
		|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников";
		
		Запрос.Выполнить();
		
	Иначе
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Объект.Организация;
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ПараметрыПолученияСотрудников.Подразделение = Объект.Подразделение;
		КонецЕсли;
		ПараметрыПолученияСотрудников.НачалоПериода 	= Объект.ДатаНачалаСтрахования;
		ПараметрыПолученияСотрудников.ОкончаниеПериода	= Объект.ДатаОкончанияСтрахования;
		ПараметрыПолученияСотрудников.КадровыеДанные	= КадровыеДанные;
		
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			ПараметрыПолученияСотрудников.Отборы, "ДатаУвольнения", "=", Дата(1,1,1));
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
		
	КонецЕсли;
	
	Если Элементы.Найти("ГруппаСотрудников") = Неопределено Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	NULL КАК Сотрудник,
		|	NULL КАК ФизическоеЛицо,
		|	NULL КАК Группа
		|ПОМЕСТИТЬ ВТГруппыСотрудников";
		
		Запрос.Выполнить();
		
		Запрос.УстановитьПараметр("ГруппаСотрудников", Неопределено);
		Запрос.УстановитьПараметр("ОтборПоГруппеСотрудников", Ложь);
		
	Иначе
		
		Если ЗначениеЗаполнено(Форма.ГруппаСотрудников) Тогда
			Если МассивСотрудников.Количество() = 0 Тогда
				
				Запрос.Текст =
				"ВЫБРАТЬ
				|	СотрудникиОрганизации.Сотрудник КАК Сотрудник
				|ИЗ
				|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации";
				
				МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
				
			КонецЕсли;
			
			ГруппыСотрудников.СоздатьВТГруппыСотрудников(Запрос.МенеджерВременныхТаблиц, МассивСотрудников);
			Запрос.УстановитьПараметр("ГруппаСотрудников", Форма.ГруппаСотрудников);
			Запрос.УстановитьПараметр("ОтборПоГруппеСотрудников", ЗначениеЗаполнено(Форма.ГруппаСотрудников));
		Иначе
			
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 0
			|	NULL КАК Сотрудник,
			|	NULL КАК ФизическоеЛицо,
			|	NULL КАК Группа
			|ПОМЕСТИТЬ ВТГруппыСотрудников";
			
			Запрос.Выполнить();
			
			Запрос.УстановитьПараметр("ГруппаСотрудников", Неопределено);
			Запрос.УстановитьПараметр("ОтборПоГруппеСотрудников", Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПрограммыМедицинскогоСтрахования.Ссылка КАК ПрограммаСтрахования
		|ИЗ
		|	Справочник.ПрограммыМедицинскогоСтрахования КАК ПрограммыМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыСтрахования.ПрограммыМедицинскогоСтрахования КАК ДоговорыСтрахованияПрограммыМедицинскогоСтрахования
		|		ПО ПрограммыМедицинскогоСтрахования.Ссылка = ДоговорыСтрахованияПрограммыМедицинскогоСтрахования.Программа
		|ГДЕ
		|	ДоговорыСтрахованияПрограммыМедицинскогоСтрахования.Ссылка = &ДоговорСтрахования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РасширенияПрограммМедицинскогоСтрахования.Ссылка КАК РасширениеСтрахования
		|ИЗ
		|	Справочник.РасширенияПрограммМедицинскогоСтрахования КАК РасширенияПрограммМедицинскогоСтрахования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыСтрахования.РасширенияПрограммМедицинскогоСтрахования КАК ДоговорыСтрахованияРасширенияПрограммМедицинскогоСтрахования
		|		ПО РасширенияПрограммМедицинскогоСтрахования.Ссылка = ДоговорыСтрахованияРасширенияПрограммМедицинскогоСтрахования.РасширениеСтрахования
		|ГДЕ
		|	ДоговорыСтрахованияРасширенияПрограммМедицинскогоСтрахования.Ссылка = &ДоговорСтрахования";
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ПрограммыСтрахованияПоУмолчанию = РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("ПрограммаСтрахования");
	РасширенияСтрахованияПоУмолчанию = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("РасширениеСтрахования");
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА &ТекущаяДата > СотрудникиОрганизации.ДатаПриема
		|			ТОГДА &ТекущаяДата
		|		ИНАЧЕ СотрудникиОрганизации.ДатаПриема
		|	КОНЕЦ КАК ДатаНачала,
		|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиОрганизации.ОсновноеРабочееМестоВОрганизации КАК ОсновноеРабочееМестоВОрганизации,
		|	СотрудникиОрганизации.Сотрудник.Наименование КАК Наименование
		|ПОМЕСТИТЬ ВТСотрудникиНеПрикрепленные
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников.СрезПоследних(
		|				,
		|				Организация = &Организация И ДоговорСтрахования = &ДоговорСтрахования
		|					И ПрограммаСтрахования.СтраховаяКомпания = &СтраховаяКомпания) КАК ПрограммыМедицинскогоСтрахованияСотрудников
		|		ПО СотрудникиОрганизации.Организация = ПрограммыМедицинскогоСтрахованияСотрудников.Организация
		|			И СотрудникиОрганизации.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
		|			И (ПрограммыМедицинскогоСтрахованияСотрудников.ДействуетДо >= &ТекущаяДата)
		|			И (ПрограммыМедицинскогоСтрахованияСотрудников.Регистратор <> &ИсключаемыйРегистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
		|		ПО СотрудникиОрганизации.Сотрудник = ГруппыСотрудников.Сотрудник
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ПрограммыМедицинскогоСтрахованияСотрудников.Действует = ЛОЖЬ
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И (НЕ &ОтборПоГруппеСотрудников
		|			ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)
		|	И СотрудникиОрганизации.ОсновноеРабочееМестоВОрганизации = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
		|	ОтложенноеМедицинскоеСтрахованиеСотрудников.Комментарий КАК Комментарий
		|ПОМЕСТИТЬ ВТОтложенныеСотрудники
		|ИЗ
		|	ВТСотрудникиНеПрикрепленные КАК СотрудникиНеПрикрепленные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников КАК ОтложенноеМедицинскоеСтрахованиеСотрудников
		|		ПО СотрудникиНеПрикрепленные.Сотрудник = ОтложенноеМедицинскоеСтрахованиеСотрудников.Сотрудник
		|			И (ОтложенноеМедицинскоеСтрахованиеСотрудников.ДоговорСтрахования = &ДоговорСтрахования)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(МАКСИМУМ(МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка), ЗНАЧЕНИЕ(Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПустаяСсылка)) КАК ДокументПрикрепления
		|ПОМЕСТИТЬ ВТДокументыПрикрепленияПредварительно
		|ИЗ
		|	ВТСотрудникиНеПрикрепленные КАК СотрудникиНеПрикрепленные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК МедицинскоеСтрахованиеПрикреплениеСотрудники
		|		ПО СотрудникиНеПрикрепленные.Сотрудник = МедицинскоеСтрахованиеПрикреплениеСотрудники.Сотрудник
		|ГДЕ
		|	МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка.Проведен = ИСТИНА
		|	И МедицинскоеСтрахованиеПрикреплениеСотрудники.Ссылка.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиНеПрикрепленные.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
		|	СотрудникиНеПрикрепленные.ДокументПрикрепления <> ЗНАЧЕНИЕ(Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПустаяСсылка) КАК СотрудникПрикреплен
		|ПОМЕСТИТЬ ВТДокументыПрикрепленияПоОрганизации
		|ИЗ
		|	ВТДокументыПрикрепленияПредварительно КАК СотрудникиНеПрикрепленные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
		|	СотрудникиНеПрикрепленные.ДокументПрикрепления КАК ДокументПрикрепления
		|ПОМЕСТИТЬ ВТДокументыПрикрепления
		|ИЗ
		|	ВТДокументыПрикрепленияПредварительно КАК СотрудникиНеПрикрепленные
		|ГДЕ
		|	СотрудникиНеПрикрепленные.ДокументПрикрепления.СтраховаяКомпания = &СтраховаяКомпания
		|	И СотрудникиНеПрикрепленные.ДокументПрикрепления.ДоговорСтрахования = &ДоговорСтрахования
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник,
		|	СотрудникиНеПрикрепленные.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументыПрикрепления.ДокументПрикрепления КАК ДокументПрикрепления,
		|	ДокументыПрикрепленияПоОрганизации.СотрудникПрикреплен КАК СотрудникПрикреплен,
		|	ВЫБОР
		|		КОГДА ОтложенныеСотрудники.Сотрудник ЕСТЬ НЕ NULL 
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтложенныйСотрудник,
		|	ВЫБОР
		|		КОГДА &ДатаНачалаСтрахования > СотрудникиНеПрикрепленные.ДатаНачала
		|			ТОГДА &ДатаНачалаСтрахования
		|		ИНАЧЕ СотрудникиНеПрикрепленные.ДатаНачала
		|	КОНЕЦ КАК ДатаПрикрепления,
		|	ОтложенныеСотрудники.Комментарий КАК Комментарий
		|ИЗ
		|	ВТСотрудникиНеПрикрепленные КАК СотрудникиНеПрикрепленные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыПрикрепления КАК ДокументыПрикрепления
		|		ПО СотрудникиНеПрикрепленные.Сотрудник = ДокументыПрикрепления.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыПрикрепленияПоОрганизации КАК ДокументыПрикрепленияПоОрганизации
		|		ПО СотрудникиНеПрикрепленные.Сотрудник = ДокументыПрикрепленияПоОрганизации.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтложенныеСотрудники КАК ОтложенныеСотрудники
		|		ПО СотрудникиНеПрикрепленные.Сотрудник = ОтложенныеСотрудники.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникиНеПрикрепленные.Наименование";
	
	СтрокаКадровыхСведенийСотрудников = ",
	|";
	Для каждого КадровоеСведение Из КадровыеДанные Цикл
		СтрокаКадровыхСведенийСотрудников = СтрокаКадровыхСведенийСотрудников + "СотрудникиОрганизации." + КадровоеСведение + ",
		|";
	КонецЦикла;
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаКадровыхСведенийСотрудников, 2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо", "СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо" + СтрокаКадровыхСведенийСотрудников);
	
	СтрокаКадровыхСведенийСотрудников = ",
	|";
	Для каждого КадровоеСведение Из КадровыеДанные Цикл
		СтрокаКадровыхСведенийСотрудников = СтрокаКадровыхСведенийСотрудников + "СотрудникиНеПрикрепленные." + КадровоеСведение + ",
		|";
	КонецЦикла;
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(СтрокаКадровыхСведенийСотрудников, 2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОНЕЦ КАК ДатаПрикрепления", "КОНЕЦ КАК ДатаПрикрепления" + СтрокаКадровыхСведенийСотрудников);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ЗаполнятьКонтактнуюИнформацию Тогда
		ФизическиеЛица = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");
		ОтправляемаяКонтактнаяИнформацияТаблица = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
		ОтправляемаяКонтактнаяИнформация = ОтправляемаяКонтактнаяИнформацияТаблица.ВыгрузитьКолонку("Вид");
		Если ОтправляемаяКонтактнаяИнформация.Количество() > 0 Тогда
			КонтактнаяИнформацияСотрудников = КонтактнаяИнформацияБЗК.КонтактнаяИнформацияОбъектов(
				ФизическиеЛица, , ОтправляемаяКонтактнаяИнформация);
			КонецЕсли;
		ЗаполнятьДополнительныеРеквизитыИСведения = Ложь;
		Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны() Тогда
			ЗаполнятьДополнительныеРеквизитыИСведения = Истина;
			ОтправляемыеДопРеквизитыИСведенияТаблица = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(Объект.ДоговорСтрахования);
			Если ОтправляемыеДопРеквизитыИСведенияТаблица.Количество() > 0 Тогда
				ОтправляемыеДопРеквизитыИСведения = ОтправляемыеДопРеквизитыИСведенияТаблица.ВыгрузитьКолонку("Свойство");
				ЗначенияСвойств = УправлениеСвойствами.ЗначенияСвойств(ФизическиеЛица, , ,ОтправляемыеДопРеквизитыИСведения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
		Если Не ЗначениеЗаполнено(Сотрудники) И Выборка.ОтложенныйСотрудник И Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники].Выгрузить().Колонки.Найти("ПрикреплениеКПрограммеСтрахованияОтложено") = Неопределено Тогда
			// В документ отложенных сотрудников не заполняем, можем добавлять только вручную
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если ЗаполнятьПрограммыСтрахования Тогда
			Для Каждого Сведение Из ОтправляемыеДанные Цикл
				НоваяСтрока[Сведение+"ДоИзменения"] = НоваяСтрока[Сведение];
			КонецЦикла;
			НоваяСтрока.Фамилия = Выборка.Фамилия;
			НоваяСтрока.ФамилияДоИзменения = Выборка.Фамилия;
			НоваяСтрока.Имя = Выборка.Имя;
			НоваяСтрока.ИмяДоИзменения = Выборка.Имя;
			НоваяСтрока.Отчество = Выборка.Отчество;
			НоваяСтрока.ОтчествоДоИзменения = Выборка.Отчество;
		КонецЕсли;
		
		Если Не ЗаполнятьПрограммыСтрахования Тогда
			Если Выборка.ДатаПриема > Объект.ДатаНачалаСтрахования Тогда
				НоваяСтрока.Основание = СтрШаблон(НСтр("ru = 'Прием с %1 в %2, %3'"),
					Формат(Выборка.ДатаПриема, "ДЛФ=Д"),
					Строка(Выборка.Подразделение),
					Строка(Выборка.Должность));
			Иначе
				Если ЗначениеЗаполнено(Выборка.ДокументПрикрепления) Тогда
					НоваяСтрока.Основание = НСтр("ru = 'Продление договора страхования'");
				Иначе
					НоваяСтрока.Основание = НСтр("ru = 'Новый договор страхования'");
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Комментарий = Выборка.Комментарий;
		КонецЕсли;
		
		Если НоваяСтрока.Свойство("СтраховатьСотрудника") Тогда
			НоваяСтрока.СтраховатьСотрудника = Истина;
		КонецЕсли;
		
		Если ЗаполнятьКонтактнуюИнформацию Тогда
			Если ОтправляемаяКонтактнаяИнформация.Количество() > 0 Тогда
				СтруктураОтбора = Новый Структура("Объект", Выборка.ФизическоеЛицо);
				НайденныеСтроки = КонтактнаяИнформацияСотрудников.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
					НоваяСтрока[СтрокаДанных.Вид.ИдентификаторДляФормул] = СтрокаДанных.ЗначенияПолей;
					НоваяСтрока[СтрокаДанных.Вид.ИдентификаторДляФормул + "Представление"] = СтрокаДанных.Представление;
				КонецЦикла;
			КонецЕсли;
			
			Если ЗаполнятьДополнительныеРеквизитыИСведения Тогда
				Если ЗначенияСвойств <> Неопределено Тогда
					СтруктураОтбора = Новый Структура("ВладелецСвойств", Выборка.ФизическоеЛицо);
					НайденныеЗначенияСвойств = ЗначенияСвойств.НайтиСтроки(СтруктураОтбора);
					Для Каждого ЗначениеСвойства Из НайденныеЗначенияСвойств Цикл
						Если НоваяСтрока.Свойство(ЗначениеСвойства.ИмяСвойства) Тогда
							НоваяСтрока[ЗначениеСвойства.ИмяСвойства] = ЗначениеСвойства.Значение;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		Иначе
			НоваяСтрока.ПрикреплениеКПрограммеСтрахованияОтложено = Выборка.ОтложенныйСотрудник;
		КонецЕсли;
		
		Если ЗаполнятьПрограммыСтрахования Тогда
			МассивСтруктурПрограмм = Новый Массив;
			Для Каждого ПрограммаСтрахования Из ПрограммыСтрахованияПоУмолчанию Цикл
				Если Не ЗначениеЗаполнено(ПрограммаСтрахования) Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = НоваяСтрока.ДатаПрикрепления;
				ПараметрыРасчета.ДатаОкончания = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = НоваяСтрока.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = Форма.ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(ПрограммаСтрахования);
				
				СтруктураПрограммы = Новый Структура;
				СтруктураПрограммы.Вставить("ПрограммаСтрахования", ПрограммаСтрахования);
				СтруктураПрограммы.Вставить("ДатаНачала", ПараметрыРасчета.ДатаНачала);
				СтруктураПрограммы.Вставить("ДатаОкончания", ПараметрыРасчета.ДатаОкончания);
				СтруктураПрограммы.Вставить("СтраховаяПремия",  МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
				
				МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
			КонецЦикла;
			УстановитьПрограммыСтрахования(Форма.Объект, НоваяСтрока, "ПрограммыСтрахованияСотрудников", "Сотрудник", МассивСтруктурПрограмм);
		КонецЕсли;
		
		Если ЗаполнятьРасширенияСтрахования Тогда
			РасширенияСтрахования = Новый Массив;
			Для Каждого РасширениеСтрахования Из РасширенияСтрахованияПоУмолчанию Цикл
				Если Не ЗначениеЗаполнено(РасширениеСтрахования) Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
				ПараметрыРасчета.ДатаНачала = НоваяСтрока.ДатаПрикрепления;
				ПараметрыРасчета.ДатаОкончания = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
				ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
				ПараметрыРасчета.ДатаРождения = НоваяСтрока.ДатаРождения;
				ПараметрыРасчета.ШкалаВозрастов = Форма.ШкалаВозрастов;
				ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияСотрудника(РасширениеСтрахования);
				
				СтруктураРасширения = Новый Структура;
				СтруктураРасширения.Вставить("РасширениеСтрахования", РасширениеСтрахования);
				СтруктураРасширения.Вставить("ДатаНачала", ПараметрыРасчета.ДатаНачала);
				СтруктураРасширения.Вставить("ДатаОкончания", ПараметрыРасчета.ДатаОкончания);
				СтруктураРасширения.Вставить("СтраховаяПремия", МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета));
				
				РасширенияСтрахования.Добавить(СтруктураРасширения);
			КонецЦикла;
			УстановитьРасширенияСтрахования(Форма.Объект, НоваяСтрока, "РасширенияПрограммСтрахованияСотрудников", "Сотрудник", РасширенияСтрахования);	
		КонецЕсли;
	КонецЦикла;
	Если ЗаполнятьПрограммыСтрахования Или ЗаполнятьРасширенияСтрахования Тогда
		РассчитатьСтраховуюПремиюСотрудников(Форма.Объект, СтруктураИменТаблиц, Сотрудники);
	КонецЕсли;
	
	// Активизируем редактируемую строку
	Если ТипЗнч(Сотрудники) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		СтруктураОтбора = Новый Структура("Сотрудник", Сотрудники);
		НайденныеСтроки = Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники].НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Элементы[СтруктураИменТаблиц.ИмяТаблицыСотрудники].ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	Если ЗаполнятьПрограммыСтрахования Или ЗаполнятьРасширенияСтрахования Тогда
		ЗаполнитьНастройкиУдержанийПоСотрудникам(Объект, МассивСотрудников);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрикреплениеКПрограммамСтрахованияЗаполнитьРодственников(Форма, СтруктураИменТаблиц, ИсключаемыйДокумент = Неопределено, Сотрудники = Неопределено) Экспорт
	
	Объект = Форма.Объект;
	
	// Очистим данные
	ЗаполняемыеТаблицыФизическихЛиц = Новый Массив;
	ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРодственники]);
	ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников]);
	ЗаполняемыеТаблицыФизическихЛиц.Добавить(Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников]);
	
	Если Сотрудники = Неопределено Тогда
		Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
			ЗаполняемаяТаблица.Очистить();
		КонецЦикла;
		МассивСотрудников = Объект[СтруктураИменТаблиц.ИмяТаблицыСотрудники].Выгрузить().ВыгрузитьКолонку("Сотрудник");
	Иначе
		Если ТипЗнч(Сотрудники) = Тип("Массив") Тогда
			МассивСотрудников = Сотрудники;
		Иначе
			МассивСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудники);
		КонецЕсли;
		
		Для Каждого СотрудникМассива Из МассивСотрудников Цикл
			
			СтруктураОтбора = Новый Структура("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникМассива, "ФизическоеЛицо"));
			Для Каждого ЗаполняемаяТаблица Из ЗаполняемыеТаблицыФизическихЛиц Цикл
				НайденныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ЗаполняемаяТаблица.Удалить(НайденнаяСтрока);
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	// Получим сведения по родственникам, с учетом ранее введенных документов прикрепления.
	Если Не ЗначениеЗаполнено(Объект.ДоговорСтрахования) Тогда
		// Показываем только сводные сведения
		Возврат;
	КонецЕсли;
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(Объект.ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДоговорСтрахования", Объект.ДоговорСтрахования);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("ИсключаемыйДокумент", ИсключаемыйДокумент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивСотрудников)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	РодственникиФизическихЛиц.Наименование КАК Родственник,
	|	РодственникиФизическихЛиц.ДатаРождения КАК ДатаРождения,
	|	РодственникиФизическихЛиц.Ссылка КАК РодственникСсылка,
	|	РодственникиФизическихЛиц.СтепеньРодства КАК СтепеньРодства,
	|	РодственникиФизическихЛиц.СНИЛС КАК СНИЛС,
	|	РодственникиФизическихЛиц.Фамилия КАК Фамилия,
	|	РодственникиФизическихЛиц.Имя КАК Имя,
	|	РодственникиФизическихЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ ВТРодственники
	|ИЗ
	|	Справочник.РодственникиФизическихЛиц КАК РодственникиФизическихЛиц
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТФизическиеЛица КАК ФизическиеЛица
	|		ПО РодственникиФизическихЛиц.Владелец = ФизическиеЛица.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.Родственник КАК Родственник,
	|	МАКСИМУМ(МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка) КАК ДокументРодственника,
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка КАК РодственникСсылка
	|ПОМЕСТИТЬ ВТДокументыРодственников
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРодственники КАК Родственники
	|		ПО МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = Родственники.ФизическоеЛицо
	|			И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = Родственники.РодственникСсылка
	|			И (МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка <> &ИсключаемыйДокумент)
	|
	|СГРУППИРОВАТЬ ПО
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо,
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.Родственник,
	|	МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Родственники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Родственники.Родственник КАК Родственник,
	|	Родственники.ДатаРождения КАК ДатаРождения,
	|	СведенияРодственников.СведениеИмя КАК СведениеИмя,
	|	СведенияРодственников.СведениеЗначение КАК СведениеЗначение,
	|	Родственники.РодственникСсылка КАК РодственникСсылка,
	|	Родственники.СтепеньРодства КАК СтепеньРодства,
	|	Родственники.СНИЛС КАК СНИЛС,
	|	Родственники.Фамилия КАК Фамилия,
	|	Родственники.Имя КАК Имя,
	|	Родственники.Отчество КАК Отчество,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.Страна КАК Гражданство,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументПредставление КАК ДокументПредставление,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументВид КАК ДокументВид,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСерия КАК ДокументСерия,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументНомер КАК ДокументНомер,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	|	ОтправленныеДанныеЗастрахованныхСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения
	|ИЗ
	|	ВТРодственники КАК Родственники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРодственников КАК ДокументыРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = ДокументыРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ДокументыРодственников.РодственникСсылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ДокументыРодственников.ДокументРодственника
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.СведенияРодственников КАК СведенияРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = СведенияРодственников.Ссылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = СведенияРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = СведенияРодственников.РодственникСсылка
	|		ПО Родственники.ФизическоеЛицо = МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо
	|			И Родственники.РодственникСсылка = МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(
	|				,
	|				ДоговорСтрахования = &ДоговорСтрахования) КАК ОтправленныеДанныеЗастрахованныхСрезПоследних
	|		ПО Родственники.РодственникСсылка = ОтправленныеДанныеЗастрахованныхСрезПоследних.Застрахованный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Родственники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Родственники.Родственник КАК Родственник,
	|	ПрограммыСтрахованияРодственников.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	Родственники.РодственникСсылка КАК РодственникСсылка
	|ИЗ
	|	ВТРодственники КАК Родственники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРодственников КАК ДокументыРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = ДокументыРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ДокументыРодственников.РодственникСсылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ДокументыРодственников.ДокументРодственника
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ПрограммыСтрахованияРодственников КАК ПрограммыСтрахованияРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ПрограммыСтрахованияРодственников.Ссылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = ПрограммыСтрахованияРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ПрограммыСтрахованияРодственников.РодственникСсылка
	|		ПО Родственники.ФизическоеЛицо = МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо
	|			И Родственники.РодственникСсылка = МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка
	|ГДЕ
	|	ПрограммыСтрахованияРодственников.ПрограммаСтрахования ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Родственники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Родственники.Родственник КАК Родственник,
	|	РасширенияПрограммСтрахованияРодственников.РасширениеСтрахования КАК РасширениеСтрахования,
	|	Родственники.РодственникСсылка КАК РодственникСсылка
	|ИЗ
	|	ВТРодственники КАК Родственники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Родственники КАК МедицинскоеСтрахованиеПрикреплениеРодственники
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументыРодственников КАК ДокументыРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = ДокументыРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = ДокументыРодственников.РодственникСсылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = ДокументыРодственников.ДокументРодственника
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.РасширенияПрограммСтрахованияРодственников КАК РасширенияПрограммСтрахованияРодственников
	|			ПО МедицинскоеСтрахованиеПрикреплениеРодственники.Ссылка = РасширенияПрограммСтрахованияРодственников.Ссылка
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо = РасширенияПрограммСтрахованияРодственников.ФизическоеЛицо
	|				И МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка = РасширенияПрограммСтрахованияРодственников.РодственникСсылка
	|		ПО Родственники.ФизическоеЛицо = МедицинскоеСтрахованиеПрикреплениеРодственники.ФизическоеЛицо
	|			И Родственники.РодственникСсылка = МедицинскоеСтрахованиеПрикреплениеРодственники.РодственникСсылка
	|ГДЕ
	|	РасширенияПрограммСтрахованияРодственников.РасширениеСтрахования ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Застрахованный КАК Застрахованный,
	|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Вид КАК Вид,
	|	ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Представление КАК Представление
	|ИЗ
	|	ВТРодственники КАК ВТРодственники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтправленнаяКонтактнаяИнформацияЗастрахованных.СрезПоследних(
	|				,
	|				ДоговорСтрахования = &ДоговорСтрахования) КАК ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних
	|		ПО ВТРодственники.РодственникСсылка = ОтправленнаяКонтактнаяИнформацияЗастрахованныхСрезПоследних.Застрахованный";
	
	ТекущаяДатаНачала = ТекущаяДатаСеанса() + (Форма.СдвигДатыПрикрепления * ЗарплатаКадрыКлиентСервер.ДлительностьСутокВСекундах());
	
	Результат = Запрос.ВыполнитьПакет();
	
	МассивРодственников = Новый Массив;
	ВыборкаПрограммыСтрахования = Результат[4].Выбрать();
	Пока ВыборкаПрограммыСтрахования.Следующий() Цикл
		СтрокаПрограммыСтрахования = Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников].Добавить();
		СтрокаПрограммыСтрахования.ФизическоеЛицо = ВыборкаПрограммыСтрахования.ФизическоеЛицо;
		СтрокаПрограммыСтрахования.Родственник = ВыборкаПрограммыСтрахования.Родственник;
		СтрокаПрограммыСтрахования.РодственникСсылка = ВыборкаПрограммыСтрахования.РодственникСсылка;
		СтрокаПрограммыСтрахования.ПрограммаСтрахования = ВыборкаПрограммыСтрахования.ПрограммаСтрахования;
		Если МассивРодственников.Найти(ВыборкаПрограммыСтрахования.РодственникСсылка) = Неопределено Тогда
			МассивРодственников.Добавить(ВыборкаПрограммыСтрахования.РодственникСсылка);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаРасширенийПрограммСтрахования = Результат[5].Выбрать();
	Пока ВыборкаРасширенийПрограммСтрахования.Следующий() Цикл
		СтрокаРасширенияПрограммыСтрахования = Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников].Добавить();
		СтрокаРасширенияПрограммыСтрахования.ФизическоеЛицо = ВыборкаРасширенийПрограммСтрахования.ФизическоеЛицо;
		СтрокаРасширенияПрограммыСтрахования.Родственник = ВыборкаРасширенийПрограммСтрахования.Родственник;
		СтрокаРасширенияПрограммыСтрахования.РодственникСсылка = ВыборкаРасширенийПрограммСтрахования.РодственникСсылка;
		СтрокаРасширенияПрограммыСтрахования.РасширениеСтрахования = ВыборкаРасширенийПрограммСтрахования.РасширениеСтрахования;
		Если МассивРодственников.Найти(ВыборкаРасширенийПрограммСтрахования.РодственникСсылка) = Неопределено Тогда
			МассивРодственников.Добавить(ВыборкаРасширенийПрограммСтрахования.РодственникСсылка);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаСведения = Результат[3].Выбрать();
	ОтправленнаяКонтактнаяИнформация = Результат[6].Выгрузить();
	Пока ВыборкаСведения.СледующийПоЗначениюПоля("Родственник") Цикл
		СтрокаРодственника = Объект[СтруктураИменТаблиц.ИмяТаблицыРодственники].Добавить();
		СтрокаРодственника.ФизическоеЛицо = ВыборкаСведения.ФизическоеЛицо;
		СтрокаРодственника.РодственникСсылка = ВыборкаСведения.РодственникСсылка;
		
		СтрокаРодственника.Фамилия = ВыборкаСведения.Фамилия;
		СтрокаРодственника.ФамилияДоИзменения = ВыборкаСведения.Фамилия;
		СтрокаРодственника.Имя = ВыборкаСведения.Имя;
		СтрокаРодственника.ИмяДоИзменения = ВыборкаСведения.Имя;
		СтрокаРодственника.Отчество = ВыборкаСведения.Отчество;
		СтрокаРодственника.ОтчествоДоИзменения = ВыборкаСведения.Отчество;
		
		Если Объект.ДатаНачалаСтрахования > ТекущаяДатаНачала Тогда
			СтрокаРодственника.ДатаПрикрепления = Объект.ДатаНачалаСтрахования;
		Иначе
			СтрокаРодственника.ДатаПрикрепления = ТекущаяДатаНачала;
		КонецЕсли;
		СтрокаРодственника.ДатаОткрепления = Объект.ДатаОкончанияСтрахования;
		Если МассивРодственников.Найти(ВыборкаСведения.РодственникСсылка) = Неопределено Тогда
			МассивРодственников.Добавить(ВыборкаСведения.РодственникСсылка);
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено Тогда
			СтрокаРодственника.ДатаРождения = ВыборкаСведения.ДатаРождения;
			СтрокаРодственника.ДатаРожденияДоИзменения = ВыборкаСведения.ДатаРождения;
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("Пол") <> Неопределено Тогда
			ПолРодственника = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ПолПоЧастямФИО(ВыборкаСведения);
			СтрокаРодственника.Пол = ПолРодственника;
			СтрокаРодственника.ПолДоИзменения = ПолРодственника;
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("СтраховойНомерПФР") <> Неопределено Тогда
			СтрокаРодственника.СтраховойНомерПФР = ВыборкаСведения.СНИЛС;
			СтрокаРодственника.СтраховойНомерПФРДоИзменения = ВыборкаСведения.СНИЛС;
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("Страна") <> Неопределено Тогда
			СтрокаРодственника.Страна = ВыборкаСведения.Гражданство;
		КонецЕсли;
		
		Если ОтправляемыеДанные.Найти("ДокументПредставление") <> Неопределено Тогда
			СтрокаРодственника.ДокументПредставление = ВыборкаСведения.ДокументПредставление;
			СтрокаРодственника.ДокументВид = ВыборкаСведения.ДокументВид;
			СтрокаРодственника.ДокументСерия = ВыборкаСведения.ДокументСерия;
			СтрокаРодственника.ДокументНомер = ВыборкаСведения.ДокументНомер;
			СтрокаРодственника.ДокументДатаВыдачи = ВыборкаСведения.ДокументДатаВыдачи;
			СтрокаРодственника.ДокументСрокДействия = ВыборкаСведения.ДокументСрокДействия;
			СтрокаРодственника.ДокументКемВыдан = ВыборкаСведения.ДокументКемВыдан;
			СтрокаРодственника.ДокументКодПодразделения = ВыборкаСведения.ДокументКодПодразделения;
		КонецЕсли;
		
		ОтборСтрок = Новый Структура("Застрахованный", ВыборкаСведения.РодственникСсылка);
		ОтправленнаяКИ = ОтправленнаяКонтактнаяИнформация.НайтиСтроки(ОтборСтрок);
		Для Каждого НайденнаяСтрока Из ОтправленнаяКИ Цикл
			СтрокаРодственника[НайденнаяСтрока.Вид.ИдентификаторДляФормул+ "Представление"] = НайденнаяСтрока.Представление;
		КонецЦикла;
		
		МассивСтруктурПрограмм = Новый Массив;
		ОтборСтрок = Новый Структура("РодственникСсылка", ВыборкаСведения.РодственникСсылка);
		НайденныеСтроки = Объект[СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников].НайтиСтроки(ОтборСтрок);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
			ПараметрыРасчета.ДатаНачала = СтрокаРодственника.ДатаПрикрепления;
			ПараметрыРасчета.ДатаОкончания = СтрокаРодственника.ДатаОткрепления;
			ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
			ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
			ПараметрыРасчета.ДатаРождения = СтрокаРодственника.ДатаРождения;
			ПараметрыРасчета.ШкалаВозрастов = Форма.ШкалаВозрастовДляРодственников;
			ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(НайденнаяСтрока.ПрограммаСтрахования);
			НайденнаяСтрока.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
			
			СтруктураПрограммы = Новый Структура;
			СтруктураПрограммы.Вставить("ПрограммаСтрахования", НайденнаяСтрока.ПрограммаСтрахования);
			СтруктураПрограммы.Вставить("ДатаНачала", ПараметрыРасчета.ДатаНачала);
			СтруктураПрограммы.Вставить("ДатаОкончания", ПараметрыРасчета.ДатаНачала);
			СтруктураПрограммы.Вставить("СтраховаяПремия",  НайденнаяСтрока.СтраховаяПремия);
			МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
		КонецЦикла;
		УстановитьПрограммыСтрахования(Объект, СтрокаРодственника, СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников, "РодственникСсылка", МассивСтруктурПрограмм, "ФизическоеЛицо");
		
		РасширенияСтрахования = Новый Массив;
		ОтборСтрок = Новый Структура("РодственникСсылка", ВыборкаСведения.РодственникСсылка);
		НайденныеСтроки = Объект[СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников].НайтиСтроки(ОтборСтрок);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ПараметрыРасчета = МедицинскоеСтрахование.ПараметрыРасчетаСтраховойПремии();
			ПараметрыРасчета.ДатаНачала = СтрокаРодственника.ДатаПрикрепления;
			ПараметрыРасчета.ДатаОкончания = СтрокаРодственника.ДатаОткрепления;
			ПараметрыРасчета.ДатаНачалаСтрахования = Объект.ДатаНачалаСтрахования;
			ПараметрыРасчета.ДатаОкончанияСтрахования = Объект.ДатаОкончанияСтрахования;
			ПараметрыРасчета.ДатаРождения = СтрокаРодственника.ДатаРождения;
			ПараметрыРасчета.ШкалаВозрастов = Форма.ШкалаВозрастовДляРодственников;
			ПараметрыРасчета.СтраховаяПремияСтрахователя = МедицинскоеСтрахование.СтраховаяПремияРодственника(НайденнаяСтрока.РасширениеСтрахования);
			
			НайденнаяСтрока.СтраховаяПремия = МедицинскоеСтрахование.СтраховаяПремия(ПараметрыРасчета);
			СтруктураРасширения = Новый Структура;
			СтруктураРасширения.Вставить("РасширениеСтрахования", НайденнаяСтрока.РасширениеСтрахования);
			СтруктураРасширения.Вставить("ДатаНачала", ПараметрыРасчета.ДатаНачала);
			СтруктураРасширения.Вставить("ДатаОкончания", ПараметрыРасчета.ДатаНачала);
			СтруктураРасширения.Вставить("СтраховаяПремия",  НайденнаяСтрока.СтраховаяПремия);
			РасширенияСтрахования.Добавить(СтруктураРасширения);
		КонецЦикла;
		УстановитьРасширенияПрограммСтрахования(Объект, СтрокаРодственника, СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников, "РодственникСсылка", РасширенияСтрахования, "ФизическоеЛицо");
	КонецЦикла;
	
	РассчитатьСтраховуюПремиюРодственников(Объект, СтруктураИменТаблиц, МассивРодственников);
	
	ЗаполнитьНастройкиУдержанийПоРодственникам(Объект, МассивСотрудников);
	
КонецПроцедуры

Процедура РассчитатьСтраховуюПремиюСотрудников(Объект, СтруктураИменТаблиц, Сотрудники = Неопределено) Экспорт
	
	ИменаТаблиц = Новый Структура;
	ИменаТаблиц.Вставить("ИмяТаблицы", СтруктураИменТаблиц.ИмяТаблицыСотрудники);
	ИменаТаблиц.Вставить("ПрограммыСтрахования", СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников);
	ИменаТаблиц.Вставить("РасширенияПрограммСтрахования", СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников);
	
	РассчитатьСтраховуюПремию(Объект, ИменаТаблиц, "Сотрудник", Сотрудники);
	
КонецПроцедуры

Процедура РассчитатьСтраховуюПремиюРодственников(Объект, СтруктураИменТаблиц, Родственники = Неопределено) Экспорт
	
	ИменаТаблиц = Новый Структура;
	ИменаТаблиц.Вставить("ИмяТаблицы", СтруктураИменТаблиц.ИмяТаблицыРодственники);
	ИменаТаблиц.Вставить("ПрограммыСтрахования", СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияРодственников);
	ИменаТаблиц.Вставить("РасширенияПрограммСтрахования", СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияРодственников);
	
	РассчитатьСтраховуюПремию(Объект, ИменаТаблиц, "РодственникСсылка", Родственники);
	
КонецПроцедуры

Процедура УстановитьПрограммыСтрахования(Объект, ТекущиеДанные, ИмяТаблицы, ИмяПоля, ПрограммыСтрахования, ИмяПоляФизическогоЛица = Неопределено) Экспорт
	
	ТекущиеДанные.ПрограммыСтрахования = "";
	СтруктураОтбора = Новый Структура(ИмяПоля, ТекущиеДанные[ИмяПоля]);
	НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект[ИмяТаблицы].Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для каждого ЭлементМассива Из ПрограммыСтрахования Цикл
		НоваяСтрока = Объект[ИмяТаблицы].Добавить();
		НоваяСтрока[ИмяПоля] = ТекущиеДанные[ИмяПоля];
		Если ИмяПоляФизическогоЛица <> Неопределено Тогда
			НоваяСтрока[ИмяПоляФизическогоЛица] = ТекущиеДанные[ИмяПоляФизическогоЛица];
		КонецЕсли;
		НоваяСтрока.ПрограммаСтрахования = ЭлементМассива.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		ТекущиеДанные.ПрограммыСтрахования = ТекущиеДанные.ПрограммыСтрахования + ЭлементМассива.ПрограммаСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.ПрограммыСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.ПрограммыСтрахования, 2);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьРасширенияПрограммСтрахования(Объект, ТекущиеДанные, ИмяТаблицы, ИмяПоля, РасширенияПрограммСтрахования, ИмяПоляФизическогоЛица = Неопределено) Экспорт
	
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура(ИмяПоля, ТекущиеДанные[ИмяПоля]);
	НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект[ИмяТаблицы].Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для каждого ЭлементМассива Из РасширенияПрограммСтрахования Цикл
		НоваяСтрока = Объект[ИмяТаблицы].Добавить();
		НоваяСтрока[ИмяПоля] = ТекущиеДанные[ИмяПоля];
		Если ИмяПоляФизическогоЛица <> Неопределено Тогда
			НоваяСтрока[ИмяПоляФизическогоЛица] = ТекущиеДанные[ИмяПоляФизическогоЛица];
		КонецЕсли;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрикреплениеДополнитьФорму(Форма, ТаблицыСоСведениями, ДоговорСтрахования) Экспорт
	
	ОтправляемыеДанныеТаблица = МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(ДоговорСтрахования);
	ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
	ДатаРожденияВОтправляемыхДанных = ОтправляемыеДанные.Найти("ДатаРождения") <> Неопределено;
	
	ОтправляемаяКонтактнаяИнформацияТаблица = МедицинскоеСтрахование.ОтправляемаяКонтактнаяИнформацияВСтраховуюКомпанию(ДоговорСтрахования);
	ОтправляемаяКонтактнаяИнформация = ОтправляемаяКонтактнаяИнформацияТаблица.ВыгрузитьКолонку("Вид");

	ЗаполнятьДополнительныеРеквизитыИСведения = Ложь;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения") И УправлениеСвойствами.СвойстваДоступны() Тогда
		ЗаполнятьДополнительныеРеквизитыИСведения = Истина;
		ОтправляемыеДопРеквизитыИСведенияТаблица = МедицинскоеСтрахование.ОтправляемыеДополнительныеРеквизитыИСведенияВСтраховуюКомпанию(ДоговорСтрахования);
		ОтправляемыеДопРеквизитыИСведения = ОтправляемыеДопРеквизитыИСведенияТаблица.ВыгрузитьКолонку("Свойство");
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ПараметрыПередаваемыхСведений", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяЭлемента", Новый ОписаниеТипов("Строка"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяРеквизита", Новый ОписаниеТипов("Строка"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяТаблицы", Новый ОписаниеТипов("Строка"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВидКонтактнойИнформации", Новый ОписаниеТипов("СправочникСсылка.ВидыКонтактнойИнформации"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТипИнформации", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтактнойИнформации"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СпособПроверкиЗаполнения", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования"), "ПараметрыПередаваемыхСведений"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Представление", Новый ОписаниеТипов("Строка"), "ПараметрыПередаваемыхСведений"));
	
	Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
		НаименованиеТаблицы = ТаблицаСоСведениями.Ключ;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Фамилия", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ФамилияДоИзменения", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Имя", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяДоИзменения", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Отчество", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтчествоДоИзменения", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
		Если Не ДатаРожденияВОтправляемыхДанных Тогда
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаРождения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата), "Объект." + НаименованиеТаблицы, НСтр("ru = 'Дата рождения'")));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаРожденияДоИзменения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата), "Объект." + НаименованиеТаблицы));
		КонецЕсли;
	КонецЦикла;
	
	ОтправляемыеРеквизитыКДобавлению = Новый Массив;
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДобавленныеОтправляемыеРеквизиты", Новый ОписаниеТипов("ТаблицаЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИмяРеквизита", Новый ОписаниеТипов("Строка"), "ДобавленныеОтправляемыеРеквизиты"));	
	
	Для Каждого Сведение Из ОтправляемыеДанные Цикл
		Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
			НаименованиеТаблицы = ТаблицаСоСведениями.Ключ;
			ТипСведения = ТипыОтправляемыхДанных()[Сведение];
			ПредставлениеСведения = ПредставленияОтправляемыхДанных()[Сведение];
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Сведение, ТипСведения, "Объект." + НаименованиеТаблицы, ПредставлениеСведения));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Сведение + "ДоИзменения", ТипСведения, "Объект." + НаименованиеТаблицы, ПредставлениеСведения));
			
			Если ДатаРожденияВОтправляемыхДанных И Сведение = "ДатаРождения" Тогда
            	Продолжить;
			КонецЕсли;
			ПутьКРеквизиту = СтрШаблон("Объект.%1.%2", НаименованиеТаблицы, Сведение);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту + "ДоИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого КИ Из ОтправляемаяКонтактнаяИнформация Цикл
		Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
			НаименованиеТаблицы = ТаблицаСоСведениями.Ключ;
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КИ.ИдентификаторДляФормул, Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КИ.ИдентификаторДляФормул + "ДоИзменения", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КИ.ИдентификаторДляФормул + "Представление", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы, КИ.Наименование));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(КИ.ИдентификаторДляФормул + "ПредставлениеДоИзменения", Новый ОписаниеТипов("Строка"), "Объект." + НаименованиеТаблицы, КИ.Наименование));
			
			ПутьКРеквизиту = СтрШаблон("Объект.%1.%2", НаименованиеТаблицы, КИ.ИдентификаторДляФормул);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту + "ДоИзменения");
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту + "Представление");
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту + "ПредставлениеДоИзменения");
		КонецЦикла;
	КонецЦикла;
	
	Если ЗаполнятьДополнительныеРеквизитыИСведения Тогда
		Для Каждого Свойство Из ОтправляемыеДопРеквизитыИСведения Цикл
			НаименованиеТаблицы = "Сотрудники";
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя, Свойство.ТипЗначения, "Объект." + НаименованиеТаблицы, Свойство.Наименование));
			ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Свойство.Имя + "ДоИзменения", Свойство.ТипЗначения, "Объект." + НаименованиеТаблицы, Свойство.Наименование));
			
			ПутьКРеквизиту = СтрШаблон("Объект.%1.%2", НаименованиеТаблицы, Свойство.Имя);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту);
			ОтправляемыеРеквизитыКДобавлению.Добавить(ПутьКРеквизиту + "ДоИзменения");
		КонецЦикла;
	КонецЕсли;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
		ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы, "Объект." + ТаблицаСоСведениями.Ключ);
	КонецЦикла;
	
	УдаляемыеРеквизиты = Новый Массив;
	Если МассивИменРеквизитовФормы.Найти("ДобавленныеОтправляемыеРеквизиты") <> Неопределено Тогда
		Для Каждого СтрокаРеквизитКИ Из Форма.ДобавленныеОтправляемыеРеквизиты Цикл
			Если ОтправляемыеРеквизитыКДобавлению.Найти(СтрокаРеквизитКИ.ИмяРеквизита) = Неопределено Тогда
				УдаляемыеРеквизиты.Добавить(СтрокаРеквизитКИ.ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы, УдаляемыеРеквизиты);
	
	Форма.ДобавленныеОтправляемыеРеквизиты.Очистить();
	Для Каждого РеквизитОтправляемойКИ Из ОтправляемыеРеквизитыКДобавлению Цикл
		Форма.ДобавленныеОтправляемыеРеквизиты.Добавить().ИмяРеквизита = РеквизитОтправляемойКИ;
	КонецЦикла;
	
	Форма.ПараметрыПередаваемыхСведений.Очистить();
	Для Каждого СтрокаДанных Из ОтправляемыеДанныеТаблица Цикл
		Если Не ВидимостьНаФормеОтправляемыхДанных()[СтрокаДанных.Сведение] Тогда
			Продолжить;
		КонецЕсли;
		Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
			ИмяЭлемента = ТаблицаСоСведениями.Ключ + СтрокаДанных.Сведение;
			СтрокаПараметров = Форма.ПараметрыПередаваемыхСведений.Добавить();
			СтрокаПараметров.ИмяТаблицы = ТаблицаСоСведениями.Ключ;
			СтрокаПараметров.ИмяЭлемента = ИмяЭлемента;
			СтрокаПараметров.ИмяРеквизита = СтрокаДанных.Сведение;
			СтрокаПараметров.Представление = ПредставленияОтправляемыхДанных()[СтрокаДанных.Сведение];
			СтрокаПараметров.СпособПроверкиЗаполнения = СтрокаДанных.СпособПроверкиЗаполнения;
			Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				ГруппаЭлемента = Форма.Элементы.Найти(ТаблицаСоСведениями.Значение);
				Если ГруппаЭлемента = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Элемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
					Элемент.ПутьКДанным = "Объект." + ТаблицаСоСведениями.Ключ + "." + СтрокаДанных.Сведение;
					Если СтрокаДанных.Сведение = "ДатаРождения" Тогда
						Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_"+ ТаблицаСоСведениями.Ключ + "ДатаРожденияПриИзменении");
					ИначеЕсли СтрокаДанных.Сведение = "ДокументПредставление" Тогда
						Элемент.РедактированиеТекста = Ложь;
						Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_"+ ТаблицаСоСведениями.Ключ + "ДокументНачалоВыбора");
					КонецЕсли;
				Если Не СтрокаДанных.Сведение = "СтраховойНомерПФР" Тогда
					Элемент.КнопкаВыбора = Истина;
				КонецЕсли;
				Если СтрокаДанных.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.ВыдаватьОшибку Тогда
					Элемент.АвтоОтметкаНезаполненного = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаКИ Из ОтправляемаяКонтактнаяИнформацияТаблица Цикл
		Для каждого ТаблицаСоСведениями Из ТаблицыСоСведениями Цикл
			ИмяЭлемента = ТаблицаСоСведениями.Ключ + СтрокаКИ.Вид.ИдентификаторДляФормул;
			СтрокаПараметров = Форма.ПараметрыПередаваемыхСведений.Добавить();
			СтрокаПараметров.ИмяТаблицы = ТаблицаСоСведениями.Ключ;
			СтрокаПараметров.ИмяЭлемента = ИмяЭлемента;
			СтрокаПараметров.Представление = СтрокаКИ.Вид.Наименование;
			СтрокаПараметров.СпособПроверкиЗаполнения = СтрокаКИ.СпособПроверкиЗаполнения;
			Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				ГруппаЭлемента = Форма.Элементы.Найти(ТаблицаСоСведениями.Значение);
				Если ГруппаЭлемента = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Элемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
				Если СтрокаКИ.Вид.Тип <> Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					Элемент.КнопкаВыбора = Истина;
				КонецЕсли;
				Если СтрокаКИ.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.ВыдаватьОшибку Тогда
					Элемент.АвтоОтметкаНезаполненного = Истина;
				КонецЕсли;
				Элемент.ПутьКДанным = "Объект." + ТаблицаСоСведениями.Ключ + "." + СтрокаКИ.Вид.ИдентификаторДляФормул + "Представление";
				Если СтрокаКИ.Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес
					Или СтрокаКИ.Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
					Элемент.УстановитьДействие("НачалоВыбора", "Подключаемый_"+ ТаблицаСоСведениями.Ключ + "ЭлементНачалоВыбора");
					Элемент.РедактированиеТекста = Ложь;
				КонецЕсли;
				СтрокаПараметров.ВидКонтактнойИнформации = СтрокаКИ.Вид;
				СтрокаПараметров.ТипИнформации = СтрокаКИ.Вид.Тип;
				СтрокаПараметров.ИмяРеквизита = СтрокаКИ.Вид.ИдентификаторДляФормул;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗаполнятьДополнительныеРеквизитыИСведения Тогда
		Для Каждого Свойство Из ОтправляемыеДопРеквизитыИСведения Цикл
			ИмяЭлемента = "Сотрудники" + Свойство.Имя;
			Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				ГруппаЭлемента = Форма.Элементы.Найти("ГруппаСведенияСтрахованияСотрудника");
				Если ГруппаЭлемента = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Элемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
				Элемент.КнопкаВыбора = Истина;
				Элемент.ПутьКДанным = "Объект." + "Сотрудники" + "." + Свойство.Имя;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Объект = Форма.Объект;
	
	Для Каждого СтрокаПараметров Из Форма.ПараметрыПередаваемыхСведений Цикл
		Если СтрокаПараметров.СпособПроверкиЗаполнения = Перечисления.СпособыПроверкиЗаполненияПерсональныхДанныхМедицинскогоСтрахования.ВыдаватьОшибку Тогда
			Если СтрокаПараметров.ИмяТаблицы = "Сотрудники" Тогда
				Для Каждого СтрокаТаблицы Из Объект.Сотрудники Цикл
					Если ЗначениеЗаполнено(СтрокаПараметров.ВидКонтактнойИнформации) Тогда
						ИмяСведения = СтрокаПараметров.ИмяРеквизита + "Представление";
					Иначе
						ИмяСведения = СтрокаПараметров.ИмяРеквизита;
					КонецЕсли;
					ЗначениеСведения = СтрокаТаблицы[ИмяСведения];
					Если Не ЗначениеЗаполнено(ЗначениеСведения) Тогда
						ТекстСообщения = СтрШаблон(НСтр("ru = 'У сотрудника %1 не заполнено поле ""%2""'"), СтрокаТаблицы.Сотрудник, СтрокаПараметров.Представление);
						Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Объект.Сотрудники", СтрокаТаблицы.НомерСтроки, "Сотрудник");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Если СтрокаПараметров.ИмяТаблицы = "Родственники" Тогда
				Для Каждого СтрокаТаблицы Из Объект.Родственники Цикл
					Если ЗначениеЗаполнено(СтрокаПараметров.ВидКонтактнойИнформации) Тогда
						ИмяСведения = СтрокаПараметров.ИмяРеквизита + "Представление";
					Иначе
						ИмяСведения = СтрокаПараметров.ИмяРеквизита;
					КонецЕсли;
					ЗначениеСведения = СтрокаТаблицы[ИмяСведения];
					Если Не ЗначениеЗаполнено(ЗначениеСведения) Тогда
						Отбор = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
						ДанныеСотрудника = Объект.Сотрудники.НайтиСтроки(Отбор);
						ТекстСообщения = СтрШаблон(НСтр("ru = 'У родственника %1 не заполнено поле ""%2""'"), СтрокаТаблицы.РодственникСсылка, СтрокаПараметров.Представление);
						Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Объект.Сотрудники", ДанныеСотрудника[0].НомерСтроки, "Сотрудник");
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрикреплениеПрочитатьНастройки(Форма, ИзменятьПериодСтрахования) Экспорт
	
	Если ИзменятьПериодСтрахования Тогда
		Форма.Объект.ДатаНачалаСтрахования = Неопределено;
		Форма.Объект.ДатаОкончанияСтрахования = Неопределено;
	КонецЕсли;
	
	Форма.СдвигДатыПрикрепления = 0;
	Форма.ИспользуютсяРасширенияПрограмм = Ложь;
	Форма.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = Ложь;
	Форма.ИспользуетсяЧастичноеУдержание = Ложь;
	Форма.ШкалаВозрастов.Очистить();
	Форма.ШкалаВозрастовДляРодственников.Очистить();
	Форма.Получатели = Новый СписокЗначений;
	Форма.ГрафикУдержанийПоДоговору = Новый СписокЗначений;
	
	Договор = Форма.Объект.ДоговорСтрахования;
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = Справочники.ДоговорыСтрахования.ПараметрыПолученияДанныхДоговора();
	ПараметрыПолучения.ШкалаВозрастаДляСотрудников = Истина;
	ПараметрыПолучения.ШкалаВозрастаДляРодственников = Истина;
	ПараметрыПолучения.АдресаРассылки = Истина;
	ПараметрыПолучения.ГрафикУдержаний = Истина;
	
	ДанныеДоговора = Справочники.ДоговорыСтрахования.ДанныеДоговора(Договор, ПараметрыПолучения);
	Если ДанныеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.СдвигДатыПрикрепления = ДанныеДоговора.СдвигДатыПрикрепления;
	Форма.ИспользуютсяРасширенияПрограмм = ДанныеДоговора.ИспользуютсяРасширенияПрограмм;
	Форма.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = ДанныеДоговора.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
	
	Если ИзменятьПериодСтрахования Тогда
		Форма.Объект.ДатаНачалаСтрахования = ДанныеДоговора.ДатаНачалаСтрахования;
		Форма.Объект.ДатаОкончанияСтрахования = ДанныеДоговора.ДатаОкончанияСтрахования;
		Форма.Объект.Организация = ДанныеДоговора.Организация;
		Форма.Объект.СтраховаяКомпания = ДанныеДоговора.СтраховаяКомпания;
	КонецЕсли;
	
	ЗаполнитьШкалуВозрастов(Форма, ДанныеДоговора);
	
	Для Каждого АдресРассылки Из ДанныеДоговора.АдресаРассылки Цикл
		Форма.Получатели.Добавить(АдресРассылки.Email);
	КонецЦикла;
	
	// Настройки удержаний
	Если Не МедицинскоеСтрахование.ИспользуютсяУдержанияВМедицинскомСтрахованииСотрудников() Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ИспользуетсяЧастичноеУдержание = ДанныеДоговора.ПрименяетсяЧастичноеУдержание;
	Если ДанныеДоговора.СпособУдержания <> Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаГрафика Из ДанныеДоговора.ГрафикУдержаний Цикл
		Форма.ГрафикУдержанийПоДоговору.Добавить(СтрокаГрафика.МесяцУдержания);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОткреплениеПрочитатьНастройки(Форма) Экспорт
	
	Форма.Объект.ДатаНачалаСтрахования = Неопределено;
	Форма.Объект.ДатаОкончанияСтрахования = Неопределено;
	Форма.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = Ложь;
	Форма.ШкалаВозрастов.Очистить();
	Форма.ШкалаВозрастовДляРодственников.Очистить();
	Форма.Получатели = Новый СписокЗначений;
	
	Договор = Форма.Объект.ДоговорСтрахования;
	Если Не ЗначениеЗаполнено(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = Справочники.ДоговорыСтрахования.ПараметрыПолученияДанныхДоговора();
	ПараметрыПолучения.ШкалаВозрастаДляСотрудников = Истина;
	ПараметрыПолучения.ШкалаВозрастаДляРодственников = Истина;
	ПараметрыПолучения.АдресаРассылки = Истина;
	
	ДанныеДоговора = Справочники.ДоговорыСтрахования.ДанныеДоговора(Договор, ПараметрыПолучения);
	Если ДанныеДоговора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Объект.Организация = ДанныеДоговора.Организация;
	Форма.Объект.СтраховаяКомпания = ДанныеДоговора.СтраховаяКомпания;
	
	Форма.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком = ДанныеДоговора.ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком;
	Форма.Объект.ДатаНачалаСтрахования = ДанныеДоговора.ДатаНачалаСтрахования;
	Форма.Объект.ДатаОкончанияСтрахования = ДанныеДоговора.ДатаОкончанияСтрахования;
	
	ЗаполнитьШкалуВозрастов(Форма, ДанныеДоговора);
	
	Для Каждого АдресРассылки Из ДанныеДоговора.АдресаРассылки Цикл
		Форма.Получатели.Добавить(АдресРассылки.Email);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИзменениеДокументаУдостоверяющегоЛичностьИзФормыЗаписи(ТекущаяЗапись) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМедицинскоеСтрахованиеСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = ТекущаяЗапись.ФизЛицо;

	ТекущиеСтрахования = МедицинскоеСтрахование.ТекущиеСтрахованияФизическихЛиц(ФизическоеЛицо);
	Если ТекущиеСтрахования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущееСтрахование Из ТекущиеСтрахования Цикл
		ОтправляемыеДанныеТаблица =
			МедицинскоеСтрахование.ОтправляемыеДанныеВСтраховуюКомпанию(ТекущееСтрахование.ДоговорСтрахования);
		ОтправляемыеДанные = ОтправляемыеДанныеТаблица.ВыгрузитьКолонку("Сведение");
		Если ОтправляемыеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Если ОтправляемыеДанные.Найти("ДокументВид") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОтборСтруктура = Новый Структура("ДоговорСтрахования, Застрахованный",ТекущееСтрахование.ДоговорСтрахования, ФизическоеЛицо);
		ТаблицаОтправленныеДанные = РегистрыСведений.ОтправленныеДанныеЗастрахованных.СрезПоследних(, ОтборСтруктура);
		Если ТаблицаОтправленныеДанные.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтправленныеДанные = ТаблицаОтправленныеДанные[0];
		
		Если ТекущаяЗапись.ВидДокумента <> ОтправленныеДанные.ДокументВид Тогда
			Продолжить;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ПрежниеДанныеТаблица = КадровыйУчет.ДокументыФизическихЛиц(ФизическоеЛицо, Истина, ТекущаяЗапись.ВидДокумента);
		УстановитьПривилегированныйРежим(Ложь);
		Если ПрежниеДанныеТаблица.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПрежниеДанные = ПрежниеДанныеТаблица[0];
		
		ИзменилисьОтправленныеДанные = Ложь;
		ИзмениласьСерия = Ложь;
		Если ТекущаяЗапись.Серия <> ПрежниеДанные.Серия И ТекущаяЗапись.Серия <> ОтправленныеДанные.ДокументСерия Тогда
			ИзмениласьСерия = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяНомер = Ложь;
		Если ТекущаяЗапись.Номер <> ПрежниеДанные.Номер И ТекущаяЗапись.Номер <> ОтправленныеДанные.ДокументНомер Тогда
			ИзменилсяНомер = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзмениласьДатаВыдачи = Ложь;
		Если ТекущаяЗапись.ДатаВыдачи <> ПрежниеДанные.ДатаВыдачи И ТекущаяЗапись.ДатаВыдачи <> ОтправленныеДанные.ДокументДатаВыдачи Тогда
			ИзмениласьДатаВыдачи = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяСрокДействия = Ложь;
		Если ТекущаяЗапись.СрокДействия <> ПрежниеДанные.СрокДействия И ТекущаяЗапись.СрокДействия <> ОтправленныеДанные.ДокументСрокДействия Тогда
			ИзменилсяСрокДействия = Ложь;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКемВыдан = Ложь;
		Если ТекущаяЗапись.КемВыдан <> ПрежниеДанные.КемВыдан И ТекущаяЗапись.КемВыдан <> ОтправленныеДанные.ДокументКемВыдан Тогда
			ИзменилсяКемВыдан = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		ИзменилсяКодПодразделения = Ложь;
		Если ТекущаяЗапись.КодПодразделения <> ПрежниеДанные.КодПодразделения И ТекущаяЗапись.КодПодразделения <> ОтправленныеДанные.ДокументКодПодразделения Тогда
			ИзменилсяКодПодразделения = Истина;
			ИзменилисьОтправленныеДанные = Истина;
		КонецЕсли;
		
		Если Не ИзменилисьОтправленныеДанные Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ИзменениеОтправленныхДанныхЗастрахованных.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорСтрахования.Установить(ТекущееСтрахование.ДоговорСтрахования);
		НаборЗаписей.Отбор.Застрахованный.Установить(ФизическоеЛицо);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.ДоговорСтрахования = ТекущееСтрахование.ДоговорСтрахования;
			Запись.Застрахованный = ФизическоеЛицо;
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		
		Если ИзмениласьСерия  Тогда
			Запись.ДокументСерия = ТекущаяЗапись.Серия;
		КонецЕсли;
		Если ИзменилсяНомер  Тогда
			Запись.ДокументНомер = ТекущаяЗапись.Номер;
		КонецЕсли;
		Если ИзмениласьДатаВыдачи  Тогда
			Запись.ДокументДатаВыдачи = ТекущаяЗапись.ДатаВыдачи;
		КонецЕсли;
		Если ИзменилсяСрокДействия  Тогда
			Запись.ДокументСрокДействия = ТекущаяЗапись.СрокДействия;
		КонецЕсли;
		Если ИзменилсяКемВыдан  Тогда
			Запись.ДокументКемВыдан = ТекущаяЗапись.КемВыдан;
		КонецЕсли;
		Если ИзменилсяКодПодразделения  Тогда
			Запись.ДокументКодПодразделения = ТекущаяЗапись.КодПодразделения;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписей.Записать();
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьГрафикУдержаний(Объект, ДанныеСотрудника) Экспорт
	
	Отбор = Новый Структура("ФизическоеЛицо", ДанныеСотрудника.ФизическоеЛицо);
	ГрафикУдержаний = Объект.ГрафикУдержаний.НайтиСтроки(Отбор);
	
	КоличествоЗаписейВГрафике = ГрафикУдержаний.Количество();
	Если КоличествоЗаписейВГрафике = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеСотрудника.ЧастичноеУдержание Тогда
		СуммаУдержания = ДанныеСотрудника.СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = ДанныеСотрудника.ОбщаяСуммаУдержания;
	КонецЕсли;
	
	Если КоличествоЗаписейВГрафике = 1 Тогда
		СтрокаГрафика = ГрафикУдержаний[0];
		СтрокаГрафика.Представление = СтрШаблон(НСтр("ru = '%1, весь период'"), СтрокаГрафика.ДатаСтрокой);
		СтрокаГрафика.Сумма = СуммаУдержания;
		СтрокаГрафика.КоличествоДней = 0;
		Возврат;
	КонецЕсли;
	
	СуммыКРаспределению = Новый Массив;
	СтраховыеПремииЗастрахованных = СтраховыеПремииЗастрахованных(Объект, ДанныеСотрудника, СуммыКРаспределению, Отбор);
	
	СуммаВведеноПользователем = 0;
	ПервыйПроход = Истина;
	СчетчикВведенныхПользователем = 0;
	Для Каждого ДанныеЗастрахованного Из СтраховыеПремииЗастрахованных Цикл
		МесяцПрикрепления = НачалоМесяца(ДанныеЗастрахованного.ДатаНачала);
		МесяцОткрепления = НачалоМесяца(ДанныеЗастрахованного.ДатаОкончания);
		Счетчик = 0;
		СчетчикВнеПериода = 0;
		Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
			Если СтрокаГрафика.ВведеноПользователем Тогда
				Если ПервыйПроход Тогда
					СуммаВведеноПользователем = СуммаВведеноПользователем + СтрокаГрафика.Сумма;
					СчетчикВведенныхПользователем = СчетчикВведенныхПользователем + 1;
				КонецЕсли;
			Иначе
				Если ПервыйПроход Тогда
					СтрокаГрафика.Сумма = 0;
					СтрокаГрафика.КоличествоДней = 0;
				КонецЕсли;
				МесяцГрафика = НачалоМесяца(СтрокаГрафика.Дата);
				Если МесяцГрафика < МесяцПрикрепления Или МесяцГрафика > МесяцОткрепления Тогда
					ДанныеЗастрахованного.Коэффициенты.Добавить(0);
					Счетчик = Счетчик + 1;
					СчетчикВнеПериода = СчетчикВнеПериода + 1;
					Продолжить;
				ИначеЕсли Счетчик = КоличествоЗаписейВГрафике - 1 Тогда
					КонецПериодаСтрокиГрафика = ДанныеЗастрахованного.ДатаОкончания;
				Иначе
					КонецПериодаСтрокиГрафика = ?(МесяцГрафика = МесяцОткрепления,
						ДанныеЗастрахованного.ДатаОкончания, ГрафикУдержаний[Счетчик + 1].Дата - 1);
				КонецЕсли;
				НачалоПериодаСтрокиГрафика = ?(МесяцГрафика = МесяцПрикрепления,
					ДанныеЗастрахованного.ДатаНачала, СтрокаГрафика.Дата);
				ДнейВПериодеСтрокиГрафика = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(
					НачалоПериодаСтрокиГрафика, КонецПериодаСтрокиГрафика);
				ДанныеЗастрахованного.Коэффициенты.Добавить(ДнейВПериодеСтрокиГрафика);
			КонецЕсли;
			Счетчик = Счетчик + 1;
		КонецЦикла;
		Если СуммаВведеноПользователем > 0 Тогда
			Если Счетчик = СчетчикВнеПериода + СчетчикВведенныхПользователем Тогда
				ДанныеЗастрахованного.ВсяСуммаВведенаПользователем = Истина;
			КонецЕсли;
		КонецЕсли;
		ПервыйПроход = Ложь;
	КонецЦикла;
	
	Если СуммаВведеноПользователем = СуммаУдержания Тогда
		ПолучитьФактическиеУдержания(Объект, ДанныеСотрудника.Сотрудник, ДанныеСотрудника.Удержание, ГрафикУдержаний);
		Возврат;
	КонецЕсли;
	
	Если СуммаВведеноПользователем > 0 Тогда
		СуммыКРаспределению = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СуммаУдержания - СуммаВведеноПользователем, СуммыКРаспределению);
	
		ИндексСуммРаспределения = 0;
		ТребуетсяКорректировка = Ложь;
		Для Каждого ДанныеЗастрахованного Из СтраховыеПремииЗастрахованных Цикл
			Если Не ДанныеЗастрахованного.ВсяСуммаВведенаПользователем Тогда
				ИндексСуммРаспределения = ИндексСуммРаспределения + 1;
				Продолжить;
			КонецЕсли;
			СуммаУменьшения = Мин(СуммаВведеноПользователем, СуммыКРаспределению[ИндексСуммРаспределения]);
			СуммыКРаспределению[ИндексСуммРаспределения] = СуммыКРаспределению[ИндексСуммРаспределения] - СуммаУменьшения;
			ИндексСуммРаспределения = ИндексСуммРаспределения + 1;
			ТребуетсяКорректировка = Истина;
		КонецЦикла;
		Если ТребуетсяКорректировка Тогда
			СуммыКРаспределению = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
				СуммаУдержания - СуммаВведеноПользователем, СуммыКРаспределению);
		КонецЕсли;
	КонецЕсли;
	
	ИндексСуммРаспределения = 0;
	Для Каждого ДанныеЗастрахованного Из СтраховыеПремииЗастрахованных Цикл
		СуммыПоГрафику = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			?(ДанныеСотрудника.ЧастичноеУдержание,
				СуммыКРаспределению[ИндексСуммРаспределения] * ДанныеСотрудника.ПроцентЧастичногоУдержания / 100,
				СуммыКРаспределению[ИндексСуммРаспределения]),
				ДанныеЗастрахованного.Коэффициенты);
		ИндексСуммРаспределения = ИндексСуммРаспределения + 1;
		Индекс = 0;
		Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
			Если СтрокаГрафика.ВведеноПользователем Тогда
				СтрокаГрафика.КоличествоДней = 0;
				Продолжить;
			КонецЕсли;
			СтрокаГрафика.Сумма = СтрокаГрафика.Сумма + ?(СуммыПоГрафику = Неопределено, 0, СуммыПоГрафику[Индекс]);
			СтрокаГрафика.КоличествоДней = Макс(СтрокаГрафика.КоличествоДней, ДанныеЗастрахованного.Коэффициенты[Индекс]);
			СтрокаГрафика.Представление = 
				СтрШаблон(НСтр("ru = '%1, %2 дн.'"), СтрокаГрафика.ДатаСтрокой, СтрокаГрафика.КоличествоДней);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	
	ПолучитьФактическиеУдержания(Объект, ДанныеСотрудника.Сотрудник, ДанныеСотрудника.Удержание, ГрафикУдержаний);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НастройкиУдержаний(ДоговорСтрахования)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыСтрахования.Удержание КАК Удержание,
		|	ДоговорыСтрахования.СпособУдержания КАК СпособУдержания,
		|	ДоговорыСтрахования.УдерживатьЗаСотрудника КАК УдержаниеЗаСотрудника,
		|	ДоговорыСтрахования.УдерживатьЗаРодственников КАК УдержаниеЗаРодственников,
		|	ДоговорыСтрахования.ПрименяетсяЧастичноеУдержание КАК ПрименяетсяЧастичноеУдержание,
		|	ДоговорыСтрахования.ПроцентЧастичногоУдержания КАК ПроцентЧастичногоУдержания
		|ИЗ
		|	Справочник.ДоговорыСтрахования КАК ДоговорыСтрахования
		|ГДЕ
		|	ДоговорыСтрахования.Ссылка = &ДоговорСтрахования";
	Запрос.УстановитьПараметр("ДоговорСтрахования", ДоговорСтрахования);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции

Процедура ЗаполнитьГрафикУдержаний(ОбъектПрикрепление, МассивСотрудников, УдерживатьИзЗарплаты)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыСтрахованияГрафикУдержаний.МесяцУдержания КАК Дата
		|ИЗ
		|	Справочник.ДоговорыСтрахования.ГрафикУдержаний КАК ДоговорыСтрахованияГрафикУдержаний
		|ГДЕ
		|	ДоговорыСтрахованияГрафикУдержаний.Ссылка = &ДоговорСтрахования
		|	И ДоговорыСтрахованияГрафикУдержаний.МесяцУдержания >= &ДатаПрикрепления";
	Запрос.УстановитьПараметр("ДоговорСтрахования", ОбъектПрикрепление.ДоговорСтрахования);
	Запрос.УстановитьПараметр("ДатаПрикрепления", ОбъектПрикрепление.ДатаНачалаСтрахования);
	ГрафикУдержаний = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Дата");
	КоличествоЗаписейВГрафике = ГрафикУдержаний.Количество();
	Если КоличествоЗаписейВГрафике = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивКоэффициентов = Новый Массив;
	Счетчик = 0;
	Для Каждого ДатаГрафика Из ГрафикУдержаний Цикл
		Если Счетчик = КоличествоЗаписейВГрафике -1 Тогда
			КонецПериодаСтрокиГрафика = ОбъектПрикрепление.ДатаОкончанияСтрахования;
			ДнейВПериодеСтрокиГрафика = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДатаГрафика, КонецПериодаСтрокиГрафика);
		Иначе
			КонецПериодаСтрокиГрафика = ГрафикУдержаний[Счетчик + 1];
			ДнейВПериодеСтрокиГрафика = ЗарплатаКадрыКлиентСервер.ДнейВПериоде(ДатаГрафика, КонецПериодаСтрокиГрафика) - 1;
		КонецЕсли;
		МассивКоэффициентов.Добавить(ДнейВПериодеСтрокиГрафика);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Если МассивСотрудников.Количество() > 0 Тогда
		Для Каждого Сотрудник Из МассивСотрудников Цикл
			СтруктураОтбора = Новый Структура("Сотрудник", Сотрудник);
			НайденныеСтроки = ОбъектПрикрепление.Сотрудники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаСотрудника = НайденныеСтроки[0];
				
				СтруктураОтбора = Новый Структура("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
				НайденныеСтроки = ОбъектПрикрепление.ГрафикУдержаний.НайтиСтроки(СтруктураОтбора);
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					ОбъектПрикрепление.ГрафикУдержаний.Удалить(НайденнаяСтрока);
				КонецЦикла;
				ЗаполнитьГрафикПоСотруднику(ОбъектПрикрепление, ГрафикУдержаний, СтрокаСотрудника, УдерживатьИзЗарплаты, МассивКоэффициентов);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбъектПрикрепление.ГрафикУдержаний.Очистить();
		Для Каждого СтрокаСотрудника Из ОбъектПрикрепление.Сотрудники Цикл
			ЗаполнитьГрафикПоСотруднику(ОбъектПрикрепление, ГрафикУдержаний, СтрокаСотрудника, УдерживатьИзЗарплаты, МассивКоэффициентов);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьГрафикПоСотруднику(ОбъектПрикрепление, ГрафикУдержаний, СтрокаСотрудника, УдерживатьИзЗарплаты, МассивКоэффициентов)
	
	Если СтрокаСотрудника.ЧастичноеУдержание Тогда
		СуммаУдержания = СтрокаСотрудника.СуммаЧастичногоУдержания;
	Иначе
		СуммаУдержания = СтрокаСотрудника.ОбщаяСуммаУдержания;
	КонецЕсли;
	
	СуммыПоГрафику = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаУдержания, МассивКоэффициентов);
	Индекс = 0;
	Для Каждого График Из ГрафикУдержаний Цикл
		СтрокаГрафика = ОбъектПрикрепление.ГрафикУдержаний.Добавить();
		СтрокаГрафика.ФизическоеЛицо = СтрокаСотрудника.ФизическоеЛицо;
		СтрокаГрафика.Дата = График;
		СтрокаГрафика.ДатаСтрокой = Формат(График, "ДФ='ММММ гггг'");
		Если УдерживатьИзЗарплаты Тогда
			СтрокаГрафика.Сумма = ?(СуммыПоГрафику = Неопределено, 0, СуммыПоГрафику[Индекс]);
		Иначе
			СтрокаГрафика.Сумма = 0;
		КонецЕсли;
		СтрокаГрафика.КоличествоДней = МассивКоэффициентов[Индекс];
		СтрокаГрафика.Представление = СтрШаблон(НСтр("ru = '%1, %2 дн.'"), СтрокаГрафика.ДатаСтрокой, СтрокаГрафика.КоличествоДней);
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиУдержанийПоСотрудникам(ОбъектПрикрепление, МассивСотрудников)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = НастройкиУдержаний(ОбъектПрикрепление.ДоговорСтрахования);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Следующий();
	Удержание = Настройки.Удержание;
	СпособУдержания = Настройки.СпособУдержания;
	УдержаниеЗаСотрудника = Настройки.УдержаниеЗаСотрудника;
	ПрименяетсяЧастичноеУдержание = Настройки.ПрименяетсяЧастичноеУдержание;
	ПроцентЧастичногоУдержания = Настройки.ПроцентЧастичногоУдержания;
	
	Если МассивСотрудников.Количество() > 0 Тогда
		Для Каждого Сотрудник Из МассивСотрудников Цикл
			СтруктураОтбора = Новый Структура("Сотрудник", Сотрудник);
			НайденныеСтроки = ОбъектПрикрепление.Сотрудники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаСотрудника = НайденныеСтроки[0];
				СтрокаСотрудника.Удержание = Удержание;
				СтрокаСотрудника.СпособУдержания = СпособУдержания;
				СтрокаСотрудника.УдерживатьИзЗарплаты = УдержаниеЗаСотрудника;
				СтрокаСотрудника.ОбщаяСуммаУдержания = ?(УдержаниеЗаСотрудника, СтрокаСотрудника.СтраховаяПремия, 0);
				Если ПрименяетсяЧастичноеУдержание И ПроцентЧастичногоУдержания > 0 Тогда
					СтрокаСотрудника.ЧастичноеУдержание = ПрименяетсяЧастичноеУдержание;
					СтрокаСотрудника.ПроцентЧастичногоУдержания = ПроцентЧастичногоУдержания;
					СтрокаСотрудника.СуммаЧастичногоУдержания = Окр(СтрокаСотрудника.ОбщаяСуммаУдержания * ПроцентЧастичногоУдержания / 100, 2);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Сотрудник Из ОбъектПрикрепление.Сотрудники Цикл
			Сотрудник.Удержание = Удержание;
			Сотрудник.СпособУдержания = СпособУдержания;
			Сотрудник.УдерживатьИзЗарплаты = УдержаниеЗаСотрудника;
			Сотрудник.ОбщаяСуммаУдержания = ?(УдержаниеЗаСотрудника, Сотрудник.СтраховаяПремия, 0);
			Если ПрименяетсяЧастичноеУдержание И ПроцентЧастичногоУдержания > 0 Тогда
				Сотрудник.ЧастичноеУдержание = ПрименяетсяЧастичноеУдержание;
				Сотрудник.ПроцентЧастичногоУдержания = ПроцентЧастичногоУдержания;
				Сотрудник.СуммаЧастичногоУдержания = Окр(Сотрудник.ОбщаяСуммаУдержания * ПроцентЧастичногоУдержания / 100, 2);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СпособУдержания = Перечисления.СпособыУдержанияМедицинскогоСтрахованияСотрудников.ПоГрафику Тогда
		ЗаполнитьГрафикУдержаний(ОбъектПрикрепление, МассивСотрудников, УдержаниеЗаСотрудника);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНастройкиУдержанийПоРодственникам(ОбъектПрикрепление, МассивСотрудников)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУдержанияВМедицинскомСтрахованииСотрудников") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = НастройкиУдержаний(ОбъектПрикрепление.ДоговорСтрахования);
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Настройки.Следующий();
	
	Если МассивСотрудников.Количество() > 0 Тогда
		Для Каждого Сотрудник Из МассивСотрудников Цикл
			СтруктураОтбора = Новый Структура("ФизическоеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо"));
			НайденныеСтроки = ОбъектПрикрепление.Родственники.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() > 0 Тогда
				Для Каждого СтрокаРодственника Из НайденныеСтроки Цикл
					СтрокаРодственника.УдерживатьССотрудника = Настройки.УдержаниеЗаРодственников;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьСтраховуюПремию(Объект, ИменаТаблиц, ИмяПоля, Страхователи = Неопределено)
	
	Если Страхователи = Неопределено Тогда
		МассивСтрахователей = Объект[ИменаТаблиц.ИмяТаблицы].Выгрузить().ВыгрузитьКолонку(ИмяПоля);
	ИначеЕсли ТипЗнч(Страхователи) = Тип("Массив") Тогда
		МассивСтрахователей = Страхователи;
	Иначе
		МассивСтрахователей = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Страхователи);
	КонецЕсли;
	
	Для Каждого Страхователь Из МассивСтрахователей Цикл
		ПараметрыОтбора = Новый Структура(ИмяПоля, Страхователь);
		НайденныеСтроки = Объект[ИменаТаблиц.ИмяТаблицы].НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаСтрахователя Из НайденныеСтроки Цикл
			
			СтрокаСтрахователя.СтраховаяПремия = 0;
			
			НайденныеСтрокиПрограмм = Объект[ИменаТаблиц.ПрограммыСтрахования].НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаТаблицы Из НайденныеСтрокиПрограмм Цикл
				СтрокаСтрахователя.СтраховаяПремия = СтрокаСтрахователя.СтраховаяПремия + СтрокаТаблицы.СтраховаяПремия;
			КонецЦикла;
			НайденныеСтрокиРасширений = Объект[ИменаТаблиц.РасширенияПрограммСтрахования].НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаТаблицы Из НайденныеСтрокиРасширений Цикл
				СтрокаСтрахователя.СтраховаяПремия = СтрокаСтрахователя.СтраховаяПремия + СтрокаТаблицы.СтраховаяПремия;
			КонецЦикла;
			СтрокаСтрахователя.СтраховаяПремия = ?(СтрокаСтрахователя.СтраховаяПремия < 0, 0, СтрокаСтрахователя.СтраховаяПремия);
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьШкалуВозрастов(Форма, ДанныеДоговора)
	
	Для Каждого ТекСтрока Из ДанныеДоговора.ШкалаВозрастаДляСотрудников Цикл
		НоваяСтрока = Форма.ШкалаВозрастов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
	Для Каждого ТекСтрока Из ДанныеДоговора.ШкалаВозрастаДляРодственников Цикл
		НоваяСтрока = Форма.ШкалаВозрастовДляРодственников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ТипыОтправляемыхДанных()
	
	СтруктураТипов = Новый Структура;
	СтруктураТипов.Вставить("ДатаРождения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("СтраховойНомерПФР", ОбщегоНазначения.ОписаниеТипаСтрока(14));
	СтруктураТипов.Вставить("Пол", Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическогоЛица"));
	СтруктураТипов.Вставить("Страна", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	СтруктураТипов.Вставить("ДокументПредставление", ОбщегоНазначения.ОписаниеТипаСтрока(500));
	СтруктураТипов.Вставить("ДокументВид", Новый ОписаниеТипов("СправочникСсылка.ВидыДокументовФизическихЛиц"));
	СтруктураТипов.Вставить("ДокументСерия", ОбщегоНазначения.ОписаниеТипаСтрока(14));
	СтруктураТипов.Вставить("ДокументНомер", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	СтруктураТипов.Вставить("ДокументДатаВыдачи", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("ДокументСрокДействия", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	СтруктураТипов.Вставить("ДокументКемВыдан", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	СтруктураТипов.Вставить("ДокументКодПодразделения", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	
	Возврат СтруктураТипов;
	
КонецФункции

Функция ПредставленияОтправляемыхДанных()
	
	СтруктураПредставлений = Новый Структура;
	СтруктураПредставлений.Вставить("ДатаРождения", НСтр("ru = 'Дата рождения'"));
	СтруктураПредставлений.Вставить("СтраховойНомерПФР", НСтр("ru = 'СНИЛС'"));
	СтруктураПредставлений.Вставить("Пол", НСтр("ru = 'Пол'"));
	СтруктураПредставлений.Вставить("Страна", НСтр("ru = 'Гражданство'"));
	СтруктураПредставлений.Вставить("ДокументПредставление", НСтр("ru = 'Документ удостоверяющий личность'"));
	СтруктураПредставлений.Вставить("ДокументВид", НСтр("ru = 'Вид документа'"));
	СтруктураПредставлений.Вставить("ДокументСерия", НСтр("ru = 'Серия документа'"));
	СтруктураПредставлений.Вставить("ДокументНомер", НСтр("ru = 'Номер документа'"));
	СтруктураПредставлений.Вставить("ДокументДатаВыдачи", НСтр("ru = 'Дата выдачи документа'"));
	СтруктураПредставлений.Вставить("ДокументСрокДействия", НСтр("ru = 'Срок действия документа'"));
	СтруктураПредставлений.Вставить("ДокументКемВыдан", НСтр("ru = 'Кем выдан документ'"));
	СтруктураПредставлений.Вставить("ДокументКодПодразделения", НСтр("ru = 'Код подразделения'"));
	
	Возврат СтруктураПредставлений;
	
КонецФункции

Функция ВидимостьНаФормеОтправляемыхДанных()
	
	СтруктураВидимостьНаФорме = Новый Структура;
	СтруктураВидимостьНаФорме.Вставить("ДатаРождения", Истина);
	СтруктураВидимостьНаФорме.Вставить("СтраховойНомерПФР", Истина);
	СтруктураВидимостьНаФорме.Вставить("Пол", Истина);
	СтруктураВидимостьНаФорме.Вставить("Страна", Истина);
	СтруктураВидимостьНаФорме.Вставить("ДокументПредставление", Истина);
	СтруктураВидимостьНаФорме.Вставить("ДокументВид", Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументСерия",Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументНомер", Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументДатаВыдачи", Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументСрокДействия", Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументКемВыдан", Ложь);
	СтруктураВидимостьНаФорме.Вставить("ДокументКодПодразделения", Ложь);
	
	Возврат СтруктураВидимостьНаФорме;
	
КонецФункции

Процедура ПолучитьФактическиеУдержания(Объект, Сотрудник, Удержание, ГрафикУдержаний)
	
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		СтрокаГрафика.ФактическиУдержано = 0;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(Удержание) Тогда
		Возврат;
	КонецЕсли;
	
	УдержанияСотрудника = ОтражениеЗарплатыВУчете.ДанныеДляОтражениеВУчетеУдержаний(
		Объект.Организация, Объект.ДатаНачалаСтрахования, Объект.ДатаОкончанияСтрахования, Сотрудник);
	
	Для Каждого СтрокаУдержание Из УдержанияСотрудника Цикл
		СтрокаУдержание.ДатаНачала = НачалоМесяца(СтрокаУдержание.ДатаНачала);
	КонецЦикла;
	УдержанияСотрудника.Свернуть("ДатаНачала, Удержание, ДокументОснование", "Сумма");
	
	ФактическиеУдержанияСотрудника = УдержанияСотрудника.НайтиСтроки(Новый Структура("Удержание", Удержание));
	КоличествоФактическихУдержаний = ФактическиеУдержанияСотрудника.Количество();
	Если КоличествоФактическихУдержаний = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДляКорректировки = 0;
	Для Каждого СтрокаУдержание Из ФактическиеУдержанияСотрудника Цикл
		
		Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПрикреплениеКПрограммамМедицинскогоСтрахования") Тогда
			ДокументОснование = Объект.Ссылка;
		Иначе
			ДокументОснование = Объект.Основание;
		КонецЕсли;	
		
		Если СтрокаУдержание.ДокументОснование <> ДокументОснование Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаГрафикаФакт = Неопределено;
		Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
			Если СтрокаГрафика.Дата <> СтрокаУдержание.ДатаНачала Тогда
				Продолжить;
			КонецЕсли;
			СтрокаГрафикаФакт = СтрокаГрафика;
			Прервать;
		КонецЦикла;
		Если СтрокаГрафикаФакт = Неопределено Тогда
			СтрокаГрафикаФакт = Объект.ГрафикУдержаний.Добавить();
		КонецЕсли;
		СтрокаГрафикаФакт.Дата = СтрокаУдержание.ДатаНачала;
		СтрокаГрафикаФакт.ДатаСтрокой = Формат(СтрокаГрафика.Дата, НСтр("ru='ДФ=''ММММ гггг'''"));
		СтрокаГрафикаФакт.Представление = СтрШаблон(НСтр("ru = '%1, факт.'"), СтрокаГрафика.ДатаСтрокой);
		СтрокаГрафикаФакт.КоличествоДней = 0;
		СтрокаГрафикаФакт.ФактическиУдержано = СтрокаУдержание.Сумма;
		СтрокаГрафикаФакт.ВведеноПользователем = Ложь;
		СуммаДляКорректировки = СуммаДляКорректировки + СтрокаГрафикаФакт.ФактическиУдержано - СтрокаГрафикаФакт.Сумма;
		СтрокаГрафикаФакт.Сумма = СтрокаГрафикаФакт.ФактическиУдержано;
	КонецЦикла;
	
	Если СуммаДляКорректировки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СуммыКРаспределению = Новый Массив;
	ОбщаяСумма = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если СтрокаГрафика.ФактическиУдержано > 0 Или СтрокаГрафика.ВведеноПользователем Тогда
			Продолжить;
		КонецЕсли;
		ОбщаяСумма = ОбщаяСумма + СтрокаГрафика.Сумма;
		СуммыКРаспределению.Добавить(СтрокаГрафика.Сумма);
	КонецЦикла;
	
	Если ОбщаяСумма = 0 Тогда
		Возврат;
	ИначеЕсли СуммаДляКорректировки >= ОбщаяСумма Тогда
		Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
			Если СтрокаГрафика.ФактическиУдержано > 0 Или СтрокаГрафика.ВведеноПользователем Тогда
				Продолжить;
			КонецЕсли;
			СтрокаГрафика.Сумма = 0;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	СуммыКРаспределению = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
		ОбщаяСумма - СуммаДляКорректировки, СуммыКРаспределению);
	
	Индекс = 0;
	Для Каждого СтрокаГрафика Из ГрафикУдержаний Цикл
		Если СтрокаГрафика.ФактическиУдержано > 0 Или СтрокаГрафика.ВведеноПользователем Тогда
			Продолжить;
		КонецЕсли;
		СтрокаГрафика.Сумма = СуммыКРаспределению[Индекс];
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция СтраховыеПремииЗастрахованных(Объект, ДанныеСотрудника, СуммыКРаспределению, Знач ОтборПоФизическомуЛицу)
	
	СтраховыеПремииЗастрахованных = Новый Массив;
	
	Если ДанныеСотрудника.УдерживатьИзЗарплаты Тогда
		ОтборПоСотруднику = Новый Структура("Сотрудник", ДанныеСотрудника.Сотрудник);
		ИменаТаблиц = Новый Массив;
		ИменаТаблиц.Добавить("ПрограммыСтрахованияСотрудников");
		ИменаТаблиц.Добавить("РасширенияПрограммСтрахованияСотрудников");
		Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
			НастройкиПрограмм = Объект[ИмяТаблицы].НайтиСтроки(ОтборПоСотруднику);
			Для Каждого СведенияОПрограмме Из НастройкиПрограмм Цикл
				СтрокаРаспределениеСумм = НоваяСтрокаРаспределениеСумм();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределениеСумм, СведенияОПрограмме);
				СуммыКРаспределению.Добавить(СтрокаРаспределениеСумм.СтраховаяПремия);
				СтраховыеПремииЗастрахованных.Добавить(СтрокаРаспределениеСумм);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("ПрограммыСтрахованияРодственников");
	ИменаТаблиц.Добавить("РасширенияПрограммСтрахованияРодственников");
	
	НастройкиРодственников = Объект.Родственники.НайтиСтроки(ОтборПоФизическомуЛицу);
	ОтборПоФизическомуЛицу.Вставить("РодственникСсылка");
	Для Каждого Настройка Из НастройкиРодственников Цикл
		Если Не Настройка.УдерживатьССотрудника Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
			ОтборПоФизическомуЛицу.РодственникСсылка = Настройка.РодственникСсылка;
			НастройкиПрограмм = Объект[ИмяТаблицы].НайтиСтроки(ОтборПоФизическомуЛицу);
			Для Каждого СведенияОПрограмме Из НастройкиПрограмм Цикл
				СтрокаРаспределениеСумм = НоваяСтрокаРаспределениеСумм();
				ЗаполнитьЗначенияСвойств(СтрокаРаспределениеСумм, СведенияОПрограмме);
				СуммыКРаспределению.Добавить(СтрокаРаспределениеСумм.СтраховаяПремия);
				СтраховыеПремииЗастрахованных.Добавить(СтрокаРаспределениеСумм);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат СтраховыеПремииЗастрахованных;
	
КонецФункции

Функция НоваяСтрокаРаспределениеСумм()
	
	СтрокаРаспределениеСумм = Новый Структура;
	СтрокаРаспределениеСумм.Вставить("СтраховаяПремия", 0);
	СтрокаРаспределениеСумм.Вставить("ДатаНачала", '00010101');
	СтрокаРаспределениеСумм.Вставить("ДатаОкончания", '00010101');
	СтрокаРаспределениеСумм.Вставить("Коэффициенты", Новый Массив);
	СтрокаРаспределениеСумм.Вставить("ВсяСуммаВведенаПользователем", Ложь);
	
	Возврат СтрокаРаспределениеСумм;
	
КонецФункции

Процедура УдалитьСвязанныеССотрудникомДанные(Форма, Сотрудник, ФизическоеЛицо, ИдентификаторСтрокиВидаРасчета = Неопределено, ЭтоИзменениеУсловийСтрахования = Ложь, ЭтоОткрепление = Ложь) Экспорт
	
	// Удалим строки показателей
	Если Не ЭтоОткрепление Тогда
		
		// Показатели
		СтруктураОтбора = Новый Структура("ИдентификаторСтрокиВидаРасчета", ИдентификаторСтрокиВидаРасчета);
		УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, "Показатели");
		
		// Застрахованные
		// Само ФЛ Сотрудника
		СтруктураОтбора = Новый Структура("Застрахованный", ФизическоеЛицо);
		ИменаТаблицКОчистке = ИменаТаблицЗастрахованныхКОчистке();
		// Его родственники
		СтруктураОтбораРодственников = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
		Родственники = Форма.Объект.Родственники.НайтиСтроки(СтруктураОтбораРодственников);
		Для Каждого ИмяТЧ Из ИменаТаблицКОчистке Цикл
			УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, ИмяТЧ);
			Для Каждого СтрокаРодственника Из Родственники Цикл
				СтруктураОтбора.Застрахованный = СтрокаРодственника.РодственникСсылка;
				УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, ИмяТЧ);
			КонецЦикла;
		КонецЦикла;	
		
	КонецЕсли;	
	
	// Сотрудник
	СтруктураОтбора = Новый Структура("Сотрудник", Сотрудник);
	ИменаТаблицКОчистке = ИменаТаблицСотрудниковКОчистке(ЭтоИзменениеУсловийСтрахования, ЭтоОткрепление);
	Для Каждого ИмяТЧ Из ИменаТаблицКОчистке Цикл
		УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, ИмяТЧ);
	КонецЦикла;
	
	// ФизическоеЛицо
	СтруктураОтбора = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ИменаТаблицКОчистке = ИменаТаблицФизЛицКОчистке(ЭтоИзменениеУсловийСтрахования, ЭтоОткрепление);
	Для Каждого ИмяТЧ Из ИменаТаблицКОчистке Цикл
		УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, ИмяТЧ);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьСвязанныеССотрудникомДанныеИзТЧ(Форма, СтруктураОтбора, ИмяТЧ)
	
	НайденныеСтроки = Форма.Объект[ИмяТЧ].НайтиСтроки(СтруктураОтбора);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Форма.Объект[ИмяТЧ].Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ИменаТаблицСотрудниковКОчистке(ЭтоИзменениеУсловийСтрахования, ЭтоОткрепление)
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("ПрограммыСтрахованияСотрудников");
	ИменаТаблиц.Добавить("РасширенияПрограммСтрахованияСотрудников");
	Если Не ЭтоИзменениеУсловийСтрахования И НЕ ЭтоОткрепление Тогда
		ИменаТаблиц.Добавить("СведенияСотрудников");
	КонецЕсли;	
		
	Возврат ИменаТаблиц;
	
КонецФункции

Функция ИменаТаблицФизЛицКОчистке(ЭтоИзменениеУсловийСтрахования, ЭтоОткрепление)
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("Родственники");
	ИменаТаблиц.Добавить("ПрограммыСтрахованияРодственников");
	ИменаТаблиц.Добавить("РасширенияПрограммСтрахованияРодственников");
	Если Не ЭтоОткрепление Тогда
		ИменаТаблиц.Добавить("ГрафикУдержаний");
		Если Не ЭтоИзменениеУсловийСтрахования Тогда
			ИменаТаблиц.Добавить("СведенияРодственников");
		КонецЕсли;
	Иначе
		ИменаТаблиц.Добавить("Удержания");
	КонецЕсли;	
		
	Возврат ИменаТаблиц;
	
КонецФункции

Функция ИменаТаблицЗастрахованныхКОчистке()
	
	ИменаТаблиц = Новый Массив;
	ИменаТаблиц.Добавить("ДанныеЗастрахованных");
	ИменаТаблиц.Добавить("КонтактнаяИнформацияЗастрахованных");
	ИменаТаблиц.Добавить("ДополнительныеРеквизитыИСведенияЗастрахованных");
	
	Возврат ИменаТаблиц;
	
КонецФункции

Процедура УстановитьРасширенияСтрахования(Объект, ТекущиеДанные, ИмяТаблицы, ИмяПоля, РасширенияСтрахования, ИмяПоляФизическогоЛица = Неопределено)
	
	ТекущиеДанные.РасширенияПрограммСтрахования = "";
	СтруктураОтбора = Новый Структура(ИмяПоля, ТекущиеДанные[ИмяПоля]);
	НайденныеСтроки = Объект[ИмяТаблицы].НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		Объект[ИмяТаблицы].Удалить(СтрокаТаблицы);
	КонецЦикла;
	Для каждого ЭлементМассива Из РасширенияСтрахования Цикл
		НоваяСтрока = Объект[ИмяТаблицы].Добавить();
		НоваяСтрока[ИмяПоля] = ТекущиеДанные[ИмяПоля];
		Если ИмяПоляФизическогоЛица <> Неопределено Тогда
			НоваяСтрока[ИмяПоляФизическогоЛица] = ТекущиеДанные[ИмяПоляФизическогоЛица];
		КонецЕсли;
		НоваяСтрока.РасширениеСтрахования = ЭлементМассива.РасширениеСтрахования;
		НоваяСтрока.СтраховаяПремия = ЭлементМассива.СтраховаяПремия;
		НоваяСтрока.ДатаНачала = ЭлементМассива.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ЭлементМассива.ДатаОкончания;
		ТекущиеДанные.РасширенияПрограммСтрахования = ТекущиеДанные.РасширенияПрограммСтрахования + ЭлементМассива.РасширениеСтрахования + "; ";
	КонецЦикла;
	Если Не ПустаяСтрока(ТекущиеДанные.РасширенияПрограммСтрахования) Тогда
		СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекущиеДанные.РасширенияПрограммСтрахования, 2);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
