
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		СписокВыбранныхОрганизаций.Добавить(Параметры.Организация);
	КонецЕсли;
	
	Срок = Параметры.Срок;
	СрокДоИзменения = Срок;
	Правило = Параметры.Правило;
	ПоказыватьПодсказкуПодключенныеОрганизации = Параметры.ПоказыватьПодсказкуПодключенныеОрганизации;
	
	Для Каждого ЭлементСписка Из Параметры.ДоступныеОрганизации Цикл
		Элементы.СписокВыбранныхОрганизаций.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;
	
	Задача = Параметры.Задача;
	ЗадачаДоИзменения = Параметры.Задача;
	ЭтоДобавлениеНовойЗадачи = Не ЗначениеЗаполнено(Задача);
	
	Если ЭтоДобавлениеНовойЗадачи Тогда
		ПеренестиНаРабочийДень = 0;
	Иначе
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Наименование");
		ПараметрыПравила = Справочники.ПравилаРучныхЗадачБухгалтера.ПрочитатьПоСсылке(Правило);
		Периодичность = ПараметрыПравила.Периодичность;
		
		ПериодичностьДоИзменения = Периодичность;
		ПеренестиНаРабочийДень = ПараметрыПравила.ПеренестиНаРабочийДень;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоДобавлениеНовойЗадачи Тогда
		ЭтотОбъект.Заголовок = НСтр("ru = 'Новая задача'");
	Иначе
		ЭтотОбъект.Заголовок = Наименование;
		Элементы.ДекорацияИнформация.Видимость = Ложь;
		Элементы.СписокВыбранныхОрганизаций.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	ВывестиПодсказкуПоПериодичности();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокПриИзменении(Элемент)
	
	УправлениеФормой();
	ВывестиПодсказкуПоПериодичности();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ДанныеВыбора = ЗадачиПоНаименованию(Текст);
	
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Задача = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Организация = Неопределено;
	Если СписокВыбранныхОрганизаций.Количество() > 0 Тогда
		Организация = СписокВыбранныхОрганизаций[0].Значение;
	КонецЕсли;
	
	КалендарьОтчетностиКлиентПереопределяемый.ОткрытьНастройкуНалоговОтчетов(Организация, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Периодичность) Тогда
		ПеренестиНаРабочийДень = 0;
	КонецЕсли;
	
	УправлениеФормой();
	ВывестиПодсказкуПоПериодичности();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияФормы = Новый Структура("Задача", Задача);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВыбораЗадачи", ЭтотОбъект);
	ОткрытьФорму(
		"Справочник.РучныеЗадачиБухгалтера.Форма.ФормаПодбора",
		ПараметрыОткрытияФормы, , , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьСпособПереносаНаРабочийДень();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Наименование = СокрЛП(Наименование);
	
	Если Не ФормаЗаполненаКорректно() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Задача) И ЗадачаУжеСуществует() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = СохранитьНаСервере();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить(КалендарьОтчетностиКлиентСервер.ИмяСобытияОповещенияКалендаряОтчетности());
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СохранитьНаСервере()
	
	Если ЗначениеЗаполнено(Задача) Тогда
		Справочники.РучныеЗадачиБухгалтера.Переименовать(Задача, Наименование);
	Иначе
		Задача = Справочники.РучныеЗадачиБухгалтера.Добавить(Наименование);
		Если Задача = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Возникла ошибка при добавлении задачи. Подробности записаны в Журнал регистрации.'"));
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Задачи", Новый Массив);
	Результат.Вставить("ОшибкиЗаписи", Новый Массив);
	Результат.Вставить("ЭтоДобавлениеНовойЗадачи", ЭтоДобавлениеНовойЗадачи); 
	ПериодичностьНеПовторять = Перечисления.Периодичность.ПустаяСсылка();
	Результат.Вставить("ЭтоПериодическаяЗадача",
		Периодичность <> ПериодичностьНеПовторять Или ПериодичностьДоИзменения <> ПериодичностьНеПовторять);
	
	ДопСвойства = Новый Соответствие;
	ДопСвойства.Вставить("ОбновлятьЗаписиСпискаЗадач", Истина);
	
	Для Каждого ЭлементСписка Из СписокВыбранныхОрганизаций Цикл
		
		Настройка = НастройкаЗадачи();
		Настройка.Организация = ЭлементСписка.Значение;
		НастройкаПравила = ПравилоЗадачи();
		НастройкаПравила.Организация = ЭлементСписка.Значение;
		
		Если ЭтоДобавлениеНовойЗадачи Тогда
			
			ПравилоОрганизации = Справочники.ПравилаРучныхЗадачБухгалтера.Добавить(НастройкаПравила, ДопСвойства);
			Если Не ЗначениеЗаполнено(ПравилоОрганизации) Тогда
				Результат.ОшибкиЗаписи.Добавить(ЭлементСписка.Представление);
				Продолжить;
			КонецЕсли;
			Настройка.Правило = ПравилоОрганизации;
		Иначе
			Справочники.ПравилаРучныхЗадачБухгалтера.Изменить(НастройкаПравила, ДопСвойства);
		КонецЕсли;
		
		Результат.Задачи.Добавить(Настройка);
		
	КонецЦикла;
	
	Если ЭтоДобавлениеНовойЗадачи Тогда
		Справочники.РучныеЗадачиБухгалтера.ОбновитьДатуИспользования(Задача);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	ЭтоПериодическаяЗадача = ЗначениеЗаполнено(Периодичность);
	Элементы.ДекорацияПодсказкаПеренос.Видимость = ЭтоПериодическаяЗадача И ЗначениеЗаполнено(Срок);
	Элементы.СписокВыбранныхОрганизаций.ОтображениеПодсказки =
		?(ПоказыватьПодсказкуПодключенныеОрганизации, ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВыбораЗадачи(РезультатЗакрытия, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("СправочникСсылка.РучныеЗадачиБухгалтера") Тогда
		Задача = РезультатЗакрытия;
		Наименование = НаименованиеЗадачи(Задача);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеЗадачи(Задача)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "Наименование");
	
КонецФункции

&НаКлиенте
Функция ФормаЗаполненаКорректно()
	
	Успешно = Истина;
	Если СписокВыбранныхОрганизаций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнена организация'"), , "СписокВыбранныхОрганизаций");
		Успешно = Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнено наименование'"), , "Наименование");
		Успешно = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Срок) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен срок'"), , "Срок");
		Успешно = Ложь;
	КонецЕсли;
	
	Если ЭтоДобавлениеНовойЗадачи И ЗначениеЗаполнено(Срок) И Срок < НачалоДня(ТекущаяДатаПользователя()) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нельзя добавить задачу в прошлое время'"), , "Срок");
		Успешно = Ложь;
	КонецЕсли;
	
	Возврат Успешно;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекущаяДатаПользователя()
	
	Возврат ВыполнениеЗадачБухгалтера.ТекущаяДатаНаСервере();
	
КонецФункции

&НаСервере
Функция ЗадачаУжеСуществует()
	
	Для Каждого ЭлементСписка Из СписокВыбранныхОрганизаций Цикл
		ПараметрыПравила = Справочники.ПравилаРучныхЗадачБухгалтера.Прочитать(ЭлементСписка.Значение, Задача, Срок);
		ПравилоНайдено = ПараметрыПравила <> Неопределено;
		ЕстьТакаяЗадача = ЭтоДобавлениеНовойЗадачи И ПравилоНайдено;
		ПопыткаРедактированияДругойЗадачи = Не ЭтоДобавлениеНовойЗадачи И ПравилоНайдено И ПараметрыПравила.Ссылка <> Правило;
			
		Если ЕстьТакаяЗадача Или ПопыткаРедактированияДругойЗадачи Тогда
			Шаблон = НСтр("ru = 'По организации %1 уже существует такая задача'");
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(Шаблон, Строка(ЭлементСписка.Значение)), , "СписокВыбранныхОрганизаций");
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗадачиПоНаименованию(НачинаетсяНа)
	
	ВыбиратьЗаписей = 10;
	Возврат Справочники.РучныеЗадачиБухгалтера.ЗадачиПоНаименованию(НачинаетсяНа, ВыбиратьЗаписей);
	
КонецФункции

&НаСервере
Функция НастройкаЗадачи()
	
	Настройка = Новый Структура();
	Настройка.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Настройка.Вставить("ЗадачаДоИзменения", ЗадачаДоИзменения);
	Настройка.Вставить("Правило", Правило);
	Настройка.Вставить("СрокДоИзменения", СрокДоИзменения);
	Настройка.Вставить("Срок", Срок);
	
	Возврат Настройка;
	
КонецФункции

&НаСервере
Функция ПравилоЗадачи()
	
	ПравилоЗадачи = Справочники.ПравилаРучныхЗадачБухгалтера.НовыйПравилоЗадачи();
	ПравилоЗадачи.Ссылка = Правило;
	ПравилоЗадачи.Задача = Задача;
	ПравилоЗадачи.Срок = Срок;
	ПравилоЗадачи.Периодичность = Периодичность;
	ПравилоЗадачи.ПеренестиНаРабочийДень = ПеренестиНаРабочийДень;
	ПравилоЗадачи.ДатаАктуальности = СрокДоИзменения;
	
	Возврат ПравилоЗадачи;
	
КонецФункции

&НаКлиенте
Процедура ВывестиПодсказкуПоПериодичности()
	
	ТекстПодсказки = Нстр("ru='Задачу нужно выполнить только один раз.'");
	
	Если Не ЗначениеЗаполнено(Срок) Тогда
		Элементы.ДекорацияПодсказка.Заголовок = ТекстПодсказки;
		Возврат;
	КонецЕсли;
	
	ТребуетсяПояснениеПоследнийДеньМесяца = Ложь;
	ДеньМесяца = День(Срок);
	Если Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Неделя") Тогда
		ТекстПодсказки = Нстр("ru='Задача будет повторяться каждую неделю.'");
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Месяц") Тогда
		Шаблон = Нстр("ru='Задача будет повторяться каждое %1-ое число месяца.'");
		ТекстПодсказки = СтрШаблон(Шаблон, ДеньМесяца);
		ТребуетсяПояснениеПоследнийДеньМесяца = Истина;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Шаблон = Нстр("ru='Задача будет повторяться каждый квартал %1-го числа.'");
		ТекстПодсказки = СтрШаблон(Шаблон, ДеньМесяца);
		ТребуетсяПояснениеПоследнийДеньМесяца = Истина;
	ИначеЕсли Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Шаблон = Нстр("ru='Задача будет повторяться каждый год %1.'");
		ТекстПодсказки = СтрШаблон(Шаблон, Формат(Срок, "ДФ=dd.MM"));
	КонецЕсли;
	
	МинимальноеЧислоДнейВМесяце = 28;
	Если ТребуетсяПояснениеПоследнийДеньМесяца И День(Срок) > МинимальноеЧислоДнейВМесяце Тогда
		ТекстПодсказки = СтрШаблон(
			Нстр("ru='%1 Если в месяце меньше %2 дней, задача будет создана на последний день месяца.'"),
			ТекстПодсказки,
			ДеньМесяца);
	КонецЕсли;
	
	Элементы.ДекорацияПодсказка.Заголовок = ТекстПодсказки;
	
	Если Периодичность <> ПредопределенноеЗначение("Перечисление.Периодичность.ПустаяСсылка") Тогда
		ШаблонСтроки = "%1
			|<a href = ""link"">%2</a>.";
		ТекстПодсказки = Нстр("ru='Если задача выпадет на выходной или праздничный день, то перенос на другой день'");
		ТекстГиперссылки = Нстр("ru='Не будет выполняться'");
		
		Если ПеренестиНаРабочийДень = 1 Тогда
			ТекстПодсказки = Нстр("ru='Если задача выпадет на выходной или праздничный день, она будет перенесена'");
			ТекстГиперссылки = Нстр("ru='На следующий рабочий день'");
		ИначеЕсли ПеренестиНаРабочийДень = -1 Тогда
			ТекстПодсказки = Нстр("ru='Если задача выпадет на выходной или праздничный день, она будет перенесена'");
			ТекстГиперссылки = Нстр("ru='На предыдущий рабочий день'");
		КонецЕсли;
		
		Элементы.ДекорацияПодсказкаПеренос.Заголовок =
			СтроковыеФункцииКлиент.ФорматированнаяСтрока(ШаблонСтроки, ТекстПодсказки, ТекстГиперссылки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьСпособПереносаНаРабочийДень()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("ПереноситьНаСледующийДень", "На следующий рабочий день");
	СписокВыбора.Добавить("ПереноситьНаПредыдущийДень", "На предыдущий рабочий день");
	СписокВыбора.Добавить("НеПереносить", "Не переносить");
	
	РезультатВыбора = Ждать ВыбратьИзСпискаАсинх(СписокВыбора, Элементы.ДекорацияПодсказкаПеренос);
	
	Если РезультатВыбора <> Неопределено Тогда
		Если РезультатВыбора.Значение = "ПереноситьНаСледующийДень" Тогда
			ПеренестиНаРабочийДень = 1;
		ИначеЕсли РезультатВыбора.Значение = "ПереноситьНаПредыдущийДень" Тогда
			ПеренестиНаРабочийДень = -1;
		ИначеЕсли РезультатВыбора.Значение = "НеПереносить" Тогда
			ПеренестиНаРабочийДень = 0;
		КонецЕсли;
	КонецЕсли;
	
	ВывестиПодсказкуПоПериодичности();
	
КонецПроцедуры

#КонецОбласти