#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	ПроцессыНаграждения.СформироватьДвиженияДокументовНаграждения(Ссылка, Движения, ДанныеДляПроведения);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтейнерОшибок = Неопределено;

	ПретендентыКНаграждениюСвернуто = ПретендентыКНаграждению.Выгрузить();
	ПретендентыКНаграждениюСвернуто.Свернуть("Претендент,Награда");
	
	Если Не ПретендентыКНаграждению.Количество() = ПретендентыКНаграждениюСвернуто.Количество() Тогда
		
		Для Каждого УникальноеНаграждение Из ПретендентыКНаграждениюСвернуто Цикл
			
			НайденныеСтроки = ПретендентыКНаграждению.НайтиСтроки(Новый Структура("Претендент,Награда", УникальноеНаграждение.Претендент, УникальноеНаграждение.Награда));
			
			Если НайденныеСтроки.Количество() > 1 Тогда
				
				ТекстСообщения = НСтр("ru = 'Обнаружено дублирование строк по комбинации сотрудника / физического лица и награды'");
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(КонтейнерОшибок, "Объект.ПретендентыКНаграждению[%1].Претендент", ТекстСообщения, "",,, ПретендентыКНаграждению.Индекс(НайденныеСтроки[НайденныеСтроки.Количество()-1]));
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(КонтейнерОшибок, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
		Если ДанныеЗаполнения.Свойство("МассивСтрок") Тогда
			Для Каждого СтрокаПретендента Из ДанныеЗаполнения.МассивСтрок Цикл
				СтрокаДокумента = ЭтотОбъект.ПретендентыКНаграждению.Добавить();
				СтрокаДокумента.Претендент = СтрокаПретендента.Сотрудник;
			КонецЦикла;
			ЭтотОбъект.ПретендентыКНаграждению.Свернуть("Претендент");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НомерДокумента", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка.Номер, Истина, Истина));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПредставлениеКНаграде.Организация КАК Организация,
	|	ПредставлениеКНаградеПретенденты.Награда КАК Награда,
	|	ЗНАЧЕНИЕ(Перечисление.СтатусыПредставленияКНаградам.Рассматривается) КАК Статус,
	|	НАЧАЛОПЕРИОДА(ПредставлениеКНаграде.Дата, ДЕНЬ) КАК Период,
	|	&НомерДокумента КАК НомерДокумента,
	|	ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ПредставлениеКНаградеПретенденты.ПредставитьКНаграде КАК ПредставленКНаграде,
	|	ПредставлениеКНаграде.ДатаВручения КАК ДатаВручения
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ПретендентыКНаграждению КАК ПредставлениеКНаградеПретенденты
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеПретенденты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ФизическиеЛица КАК ПредставлениеКНаградеФизическиеЛица
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеФизическиеЛица.Ссылка
	|			И (ПредставлениеКНаградеПретенденты.Претендент = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо
	|				ИЛИ ВЫРАЗИТЬ(ПредставлениеКНаградеПретенденты.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо)
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПредставлениеКНаграде.Организация,
	|	ПредставлениеКНаградеПретенденты.Награда,
	|	ПредставлениеКНаградеПретенденты.Статус,
	|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ПредставлениеКНаградеПретенденты.ДатаУстановкиСтатуса, ДЕНЬ), СЕКУНДА, 1),
	|	&НомерДокумента,
	|	ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо,
	|	ПредставлениеКНаградеПретенденты.ПредставитьКНаграде,
	|	ПредставлениеКНаграде.ДатаВручения
	|ИЗ
	|	Документ.ПредставлениеКНаграде КАК ПредставлениеКНаграде
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ПретендентыКНаграждению КАК ПредставлениеКНаградеПретенденты
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеПретенденты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПредставлениеКНаграде.ФизическиеЛица КАК ПредставлениеКНаградеФизическиеЛица
	|		ПО ПредставлениеКНаграде.Ссылка = ПредставлениеКНаградеФизическиеЛица.Ссылка
	|			И (ПредставлениеКНаградеПретенденты.Претендент = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо
	|				ИЛИ ВЫРАЗИТЬ(ПредставлениеКНаградеПретенденты.Претендент КАК Справочник.Сотрудники).ФизическоеЛицо = ПредставлениеКНаградеФизическиеЛица.ФизическоеЛицо)
	|ГДЕ
	|	ПредставлениеКНаграде.Ссылка = &Ссылка
	|	И НЕ ПредставлениеКНаградеПретенденты.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПредставленияКНаградам.ПустаяСсылка)";
	
	ДанныеДляПроведения = Новый Структура; 
	ДанныеДляПроведения.Вставить("СтатусыПредставленийКНаградам", Запрос.Выполнить().Выгрузить());
	
	Возврат ДанныеДляПроведения;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
