
#Область ПрограммныйИнтерфейс

// Отмечает указанные задачи как принятые к исполнению.
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ПринятьЗадачиКИсполнению(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ПринятьЗадачиКИсполнению(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Задача ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может быть принята к исполнению по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Отмечает указанные задачи как не принятые к исполнению.
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ОтменитьПринятиеЗадачКИсполнению(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ОтменитьПринятиеЗадачКИсполнению(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Задача ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может быть отменена по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Очищает исполнителя для указанных задач при ролевой адресации
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ВернутьНаРольИсполнителя(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ВернутьНаРольИсполнителя(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Задача ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может быть возвращена на роль по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Устанавливает исполнителя для указанных задач с отметкой ручного назначения,
// а также отмечает эти задачи как принятые к исполнению.
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//  Исполнитель - СправочникСсылка.ВнешниеПользователи, СправочникСсылка.Пользователи - ссылка на назначаемого исполнителя.
//
Процедура НазначитьИсполнителя(Знач МассивЗадач, Исполнитель) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.НазначитьИсполнителя(МассивЗадач, Исполнитель, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Для задачи ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" исполнитель не может быть назначен по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Отменяет установку исполнителя для указанных задач,
// снимает отметку ручного назначения и принятия к исполнению.
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ОтменитьНазначениеИсполнителя(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ОтменитьНазначениеИсполнителя(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Для задачи ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может быть отменено назначение исполнителя по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Отменяет выполнение указанных задач, отмечает их как невыполненные,
// прерывает выполнение задач-последователей, если они еще не были выполнены или приняты с исполнению.
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ОтменитьВыполнениеЗадач(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ОтменитьВыполнениеЗадач(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Выполнение задачи ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может быть отменено по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Отмечает указанные задачи как не выполненные из-за ошибки, записывает описание ошибки.
//
// Параметры:
//  ЗадачиСОшибками - Массив - коллекция, где каждый элемент - Структура с полями:
//     * Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - ссылка на задачу, которую не удалось выполнить
//     * ОписаниеОшибки - Строка - описание ошибки при попытке выполнить задачу
//
Процедура ОтметитьНеУспешнуюПопыткуВыполненияЗадач(Знач ЗадачиСОшибками, СообщитьПользователю = Ложь, Комментарий = Неопределено) Экспорт
	
	Если ЗадачиСОшибками.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПроцессыОбработкиДокументовВызовСервера.ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОшибками, Комментарий);
	
	ПоказатьОповещениеОНеуспешномВыполненииЗадач(ЗадачиСОшибками, СообщитьПользователю);
	
	Оповестить("Запись_ЗадачаПоОбработкеДокумента");
	
КонецПроцедуры

// Показывает форму с описанием ошибок, из-за которых не были выполнены задачи
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ПоказатьИнформациюОбОшибках(Знач МассивЗадач) Экспорт
	
	НовыйМассивЗадач = Новый Массив;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) = Тип("Структура") Тогда
			НовыйМассивЗадач.Добавить(Задача.Задача);
		ИначеЕсли ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			НовыйМассивЗадач.Добавить(Задача);
		КонецЕсли;
	КонецЦикла;
	
	Если НовыйМассивЗадач.Количество() = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Задачи", НовыйМассивЗадач);
	ОткрытьФорму("Задача.ЗадачаПоОбработкеДокумента.Форма.Ошибки", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

// Снимает признак выполняемости задач, а также задач с тем же идентификатором пачки,
// и отменяет активные фоновые задания по выполнению указанных задач
//
// Параметры:
//  МассивЗадач - Массив - массив ссылок на задачи.
//
Процедура ПрерватьПроцессВыполненияЗадач(Знач МассивЗадач) Экспорт
	
	ЗадачиСОтказом = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ПрерватьПроцессВыполненияЗадач(МассивЗадач, ЗадачиСОтказом);
	
	Для Каждого ЗадачаСОтказом Из ЗадачиСОтказом Цикл
		ТекстСообщения = НСтр("ru = 'Выполнение задачи ""'")
							+ Строка(ЗадачаСОтказом.Задача)
							+ НСтр("ru = '"" не может прервано по причине: '")
							+ ЗадачаСОтказом.ПричинаОтказа;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЦикла;
	
	Если МассивЗадач.Количество() = 0 Тогда
		Если ЗадачиСОтказом.Количество() = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого Задача Из МассивЗадач Цикл
		Если ТипЗнч(Задача) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Оповестить("Запись_ЗадачаПоОбработкеДокумента");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик выполнения задачи по обработке документа.
//
// Параметры:
//   Форма - УправляемаяФорма - форма, из которой выполняется задача.
//   Команда - КомандаФормы - выполняемая команда.
//   Источник - ДанныеФормыСтруктура - объект с полем "Ссылка".
//
Процедура ВыполнитьЗадачу(Форма, Команда, Знач Источник) Экспорт

	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередНачаломВыполненияЗадачи(Форма, Команда, Источник, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;	
	
	Если Команда.Имя = "ПринятьКИсполнениюПроцессыОбработкиДокументов" Тогда
		Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение", Форма);
		ВыполнитьОбработкуОповещения(Оповещение, "ПринятьКИсполнениюПроцессыОбработкиДокументов");
		Оповестить("Запись_ЗадачаПоОбработкеДокумента");
		Если НЕ ПустаяСтрока(Форма.ПроцессыОбработкиДокументов_ТекстПредупреждения) Тогда
			ПоказатьПредупреждение(,Форма.ПроцессыОбработкиДокументов_ТекстПредупреждения);
		КонецЕсли;
		Возврат;
	ИначеЕсли Команда.Имя = "КомментарийСледующему" Тогда
		Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя = Истина;
		Возврат;
	ИначеЕсли Команда.Имя = "КарточкаПроцессаДокумента" Тогда
		ПараметрыФормы = Новый Структура("ЗначениеОтбора, ОткрытиеВОтдельномОкне", Источник.Ссылка, Истина);
		ОткрытьКарточкуПроцессаДокумента(ПараметрыФормы, Форма, Форма.КлючУникальности);
		Возврат;
	ИначеЕсли Команда.Имя = "ПоказатьКомментарийНаправившего" Тогда
		ПереключитьсяНаКомментарийНаправившего(Форма);
		Возврат;
	ИначеЕсли Команда.Имя = "ПоказатьКомментарийСледующему" Тогда
		ПереключитьсяНаКомментарийСледующему(Форма);
		Возврат;
	ИначеЕсли Команда.Имя = "ДекорацияПодходящийШаблон" Тогда
		Если Форма.Модифицированность Тогда
			Обработчик = Новый ОписаниеОповещения(
				"ПродолжитьИзменениеШаблонаПослеПодтвержденияЗаписи", ЭтотОбъект, Новый Структура("Форма", Форма));
			ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после записи данных.
				|Данные будут записаны.'");
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Иначе
			Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение", Форма);
			ВыполнитьОбработкуОповещения(Оповещение, "ИзменитьШаблонПроцесса");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Ссылка = Источник.Ссылка;
	Объект = Источник;
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Форма", Форма);
	ПараметрыКоманды.Вставить("Объект", Объект);
	ПараметрыКоманды.Вставить("УникальныйИдентификатор", Форма.УникальныйИдентификатор);
	ПараметрыКоманды.Вставить("Комментарий", Форма.ПроцессыОбработкиДокументов_КомментарийСледующему);
	ПараметрыКоманды.Вставить("ДополнительныйКонтекст", Неопределено);
	ПараметрыКоманды.Вставить("ТребуетсяВызовСервера", Ложь);
	ПараметрыКоманды.Вставить("ДанныеДляПодписи", Неопределено);
	ПараметрыКоманды.Вставить("ВывестиСообщениеОбОшибке", Истина);
	
	КомандыФормы = Форма.ПроцессыОбработкиДокументов_ТаблицаКоманд.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя));
	Если КомандыФормы.Количество() = 0 Тогда
		ИнформацияДляЖурнала = НСтр("ru='Количество строк таблицы ""ПроцессыОбработкиДокументов_ТаблицаКоманд"": '")
			+ Форма.ПроцессыОбработкиДокументов_ТаблицаКоманд.Количество();
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
			НСтр("ru = 'Процессы обработки документов.Выполнение этапа процесса'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка()),
			"Ошибка", ИнформацияДляЖурнала, , Истина);
		Если Ссылка.Пустая() ИЛИ Форма.Модифицированность Тогда
			ТекстСообщения = НСтр("ru='Не удалось выполнить команду.
				|Сохраните документ, перечитайте данные либо переоткройте форму заново и попробуйте выполнить команду еще раз.'");
		Иначе
			Форма.Прочитать();
			ТекстСообщения = НСтр("ru='Не удалось выполнить команду.
				|Данные перечитаны, попробуйте выполнить команду еще раз.'");
			ТекстПодсказки = Новый ФорматированнаяСтрока(
				НСтр("ru='(при многократном повторении ошибки переоткройте форму документа)'"), Новый Шрифт(,,,Истина));
			ТекстСообщения = Новый ФорматированнаяСтрока(ТекстСообщения, Символы.ПС, Символы.ПС, ТекстПодсказки);
		КонецЕсли;
		ПоказатьПредупреждение(, ТекстСообщения, 60);
		Возврат;
	ИначеЕсли НЕ Ссылка.Пустая() И НЕ Форма.Модифицированность
		И Форма.ПроцессыОбработкиДокументов_ШаблонВРегистре <> Форма.ПроцессыОбработкиДокументов_ТекущийШаблон Тогда
		// Отображаемый шаблон не соответствует сохраненному, требуется переинициализация формы
		Форма.Прочитать();
		ТекстСообщения = НСтр("ru='Не удалось выполнить команду.
			|Данные перечитаны, попробуйте выполнить команду еще раз.'");
		ПоказатьПредупреждение(, ТекстСообщения, 60);
		Возврат;
	КонецЕсли;
	
	КомандаФормы = КомандыФормы[0];
	
	ПараметрыКоманды.Вставить("Статус", КомандаФормы.Статус);
	ПараметрыКоманды.Вставить("Отрицательная", КомандаФормы.Отрицательная);
	ПараметрыКоманды.Вставить("ТребуетсяПростаяЭП", КомандаФормы.ТребуетсяПростаяЭП);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		ПараметрыКоманды.Вставить("ТребуетсяЭП", КомандаФормы.ТребуетсяЭП);
	Иначе
		ПараметрыКоманды.Вставить("ТребуетсяЭП", Ложь);
	КонецЕсли;
	
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаПредыдущихЭП",
		Форма.ПроцессыОбработкиДокументов_ПроверятьИмеющиесяЭППриОчередномПодписании
			И (ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП));
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаПодписанныхДанных",
		Форма.ПроцессыОбработкиДокументов_ПроверятьПодписанныеДанныеПриОчередномПодписании
			И (ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП));
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаНаличияКлючаПЭПВРеестре",
		Форма.ПроцессыОбработкиДокументов_ПроверятьНаличиеКлючаПЭПВРеестре И ПараметрыКоманды.ТребуетсяПростаяЭП);
	ПараметрыКоманды.Вставить("ИспользуетсяМногопоточнаяПроверка", Форма.ПроцессыОбработкиДокументов_ИспользоватьМногопоточнуюПроверку);
		
	Если ПараметрыКоманды.Отрицательная
		И НЕ ЗначениеЗаполнено(Форма.ПроцессыОбработкиДокументов_КомментарийСледующему)
		И НЕ Форма.ПроцессыОбработкиДокументов_НеЗаполнятьКомментарийПриОтрицательномРезультате Тогда
		ТекстСообщения = НСтр("ru='Для выполнения выбранного действия необходимо заполнить комментарий.'");
		ПереключитьсяНаКомментарийСледующему(Форма);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Ссылка, "ПроцессыОбработкиДокументов_КомментарийСледующему");
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() ИЛИ Форма.ПроцессыОбработкиДокументов_ТекущийШаблон <> Форма.ПроцессыОбработкиДокументов_ШаблонВРегистре Тогда
		ИдентификаторПачки = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор();
	Иначе
		Если Форма.ПроцессыОбработкиДокументов_ТекущаяЗадача.Пустая() Тогда
			Форма.ПроцессыОбработкиДокументов_ТекущаяЗадача = ПроцессыОбработкиДокументовВызовСервера.ЗадачаНовогоДокумента(
				Форма.ПроцессыОбработкиДокументов_ТекущийШаблон, Форма.ПроцессыОбработкиДокументов_ТекущийИдентификаторЭтапа, Ссылка);
		КонецЕсли;
		ИдентификаторПачки = ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиКакВыполняемые(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Форма.ПроцессыОбработкиДокументов_ТекущаяЗадача));
	КонецЕсли;
	
	ПараметрыКоманды.Вставить("ИдентификаторПачки", ИдентификаторПачки);
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Задача", Форма.ПроцессыОбработкиДокументов_ТекущаяЗадача);
	ДанныеДокумента.Вставить("Документ", Ссылка);
	ДанныеДокумента.Вставить("Шаблон", Форма.ПроцессыОбработкиДокументов_ТекущийШаблон);
	ДанныеДокумента.Вставить("ИдентификаторЭтапа", Форма.ПроцессыОбработкиДокументов_ТекущийИдентификаторЭтапа);
	ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитов",
		Форма.ПроцессыОбработкиДокументов_ТребуетсяПроверкаЗаполненностиРеквизитов);
	ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитовПервичныхДокументов",
		Форма.ПроцессыОбработкиДокументов_ТребуетсяПроверкаЗаполненностиРеквизитовПД);
	ДанныеДокумента.Вставить("НаличиеФайловОбязательно", КомандаФормы.НаличиеФайловОбязательно);
	ДанныеДокумента.Вставить("РасшифровкаОбязательныхПрисоединенныхФайлов", КомандаФормы.РасшифровкаОбязательныхПрисоединенныхФайлов);

	ДанныеДокумента.Вставить("ПодписыватьФайлыЭП", КомандаФормы.ПодписыватьФайлыЭП);
	ДанныеДокумента.Вставить("ОбособленнаяЗонаОтветственности", КомандаФормы.ОбособленнаяЗонаОтветственности);
	ДанныеДокумента.Вставить("ОбработчикДоТранзакции", КомандаФормы.ОбработчикДоТранзакции);
	ДанныеДокумента.Вставить("УсловиеВыполнения", КомандаФормы.УсловиеВыполнения);
	Если ДанныеДокумента.ТребуетсяПроверкаЗаполненностиРеквизитов И НЕ ПараметрыКоманды.Отрицательная
		ИЛИ ДанныеДокумента.ТребуетсяПроверкаЗаполненностиРеквизитовПервичныхДокументов И НЕ ПараметрыКоманды.Отрицательная
		ИЛИ ДанныеДокумента.НаличиеФайловОбязательно И НЕ ПараметрыКоманды.Отрицательная
		ИЛИ НЕ ПустаяСтрока(ДанныеДокумента.ОбработчикДоТранзакции)
		ИЛИ НЕ ПустаяСтрока(ДанныеДокумента.УсловиеВыполнения)
		ИЛИ ПараметрыКоманды.ТребуетсяЭП
		ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП Тогда
		ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
	КонецЕсли;
	ДанныеДокумента.Вставить("ОбработчикКлиентский", КомандаФормы.ОбработчикКлиентский);
	ДанныеДокумента.Вставить("ВыполненныеОбработчики", Новый Массив);
	Если НЕ ПустаяСтрока(ДанныеДокумента.ОбработчикКлиентский) Тогда
		ДанныеДокумента.Вставить("ОбработчикиВыполнены", Ложь);
	Иначе
		ДанныеДокумента.Вставить("ОбработчикиВыполнены", Истина);
	КонецЕсли;
	ДанныеДокумента.Вставить("ДополнительныеПараметры", Неопределено);
	ДанныеДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеДокумента);
	ПараметрыКоманды.Вставить("ДанныеДокументов", ДанныеДокументов);
	
	Если КомандаФормы.ПризнакПроведенности = Истина
		И (Форма.Модифицированность ИЛИ НЕ Источник.Проведен) Тогда
		ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после проведения документа.
							|Документ будет проведен.'");
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияПроведения", ЭтотОбъект, ПараметрыКоманды);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	Если КомандаФормы.ПризнакПроведенности = Ложь
		И Источник.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после отмены проведения документа.
							|Проведение документа будет отменено.'");
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияОтменыПроведения", ЭтотОбъект, ПараметрыКоманды);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	Если Ссылка.Пустая() ИЛИ Форма.Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после записи данных.
							|Данные будут записаны.'");
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияЗаписи", ЭтотОбъект, ПараметрыКоманды);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ПараметрыКоманды.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыКоманды.ТребуетсяВызовСервера Тогда
		Если ПараметрыКоманды.ИспользуетсяМногопоточнаяПроверка Тогда
			Результат = ПроцессыОбработкиДокументовВызовСервера.СуществуютЭлектронныеПодписииПредыдущихЭтапов(ПараметрыКоманды.ДанныеДокументов);
			Если Результат Тогда
				ВыполнитьПроверкуДанныхВМногопоточномРежиме(ПараметрыКоманды); 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ВыполнитьПроцедурыСВызовомСервера(ПараметрыКоманды);
	КонецЕсли;
	
	Если ПараметрыКоманды.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

// Обработчик выполнения задач по обработке документов.
//
// Параметры:
//   Форма - УправляемаяФорма - форма, из которой выполняется задача.
//   Команда - КомандаФормы - выполняемая команда.
//   Источник - ТаблицаФормы - список формы.
//
Процедура ВыполнитьЗадачи(Форма, Команда, Список) Экспорт
	
	ИдентификаторПачки = ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиКакВыполняемые(
							ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Список.ВыделенныеСтроки));
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Форма", Форма);
	ПараметрыКоманды.Вставить("УникальныйИдентификатор", Форма.УникальныйИдентификатор);
	ПараметрыКоманды.Вставить("ИдентификаторПачки", ИдентификаторПачки);
	ПараметрыКоманды.Вставить("НеЗаполнятьКомментарийПриОтрицательномРезультате",
		Форма.НеЗаполнятьКомментарийПриОтрицательномРезультате);
	ПараметрыКоманды.Вставить("Комментарий", Неопределено);
	ПараметрыКоманды.Вставить("ДополнительныйКонтекст", Неопределено);
	ПараметрыКоманды.Вставить("ДанныеДляПодписи", Неопределено);
	
	КомандаФормы = Форма.ТаблицаКоманд.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя))[0];
	
	ПараметрыКоманды.Вставить("Статус", КомандаФормы.Статус);
	ПараметрыКоманды.Вставить("Отрицательная", КомандаФормы.Отрицательная);
	ПараметрыКоманды.Вставить("ТребуетсяПростаяЭП", КомандаФормы.ТребуетсяПростаяЭП);
	ПараметрыКоманды.Вставить("ИспользуетсяМногопоточнаяПроверка", Форма.ИспользоватьМногопоточнуюПроверку);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяПодпись") Тогда
		ПараметрыКоманды.Вставить("ТребуетсяЭП", КомандаФормы.ТребуетсяЭП);
	Иначе
		ПараметрыКоманды.Вставить("ТребуетсяЭП", Ложь);
	КонецЕсли;
	
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаПредыдущихЭП",
		Форма.ПроверятьИмеющиесяЭППриОчередномПодписании
		И (ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП));
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаПодписанныхДанных",
		Форма.ПроверятьПодписанныеДанныеПриОчередномПодписании
		И (ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП));
	ПараметрыКоманды.Вставить("ТребуетсяПроверкаНаличияКлючаПЭПВРеестре",
		Форма.ПроверятьНаличиеКлючаПЭПВРеестре И ПараметрыКоманды.ТребуетсяПростаяЭП);
	ПараметрыКоманды.Вставить("ТребуетсяВызовСервера",
		ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП);
	
	ДокументыКоторыеДолжныБытьПроведены = Новый Массив;
	ДокументыКоторыеДолжныБытьНеПроведены = Новый Массив;
	
	ДанныеДокументов = Новый Массив;
	Для Каждого Задача Из Список.ВыделенныеСтроки Цикл
		
		Если ТипЗнч(Задача) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗадачи = Список.ДанныеСтроки(Задача);
		
		Если КомандаФормы.Этап <> ДанныеЗадачи.Этап Тогда
			
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
			
			ПоказатьПредупреждение(,НСтр("ru = 'Команда не может быть выполнена для указанного объекта.'"));
			
			Возврат;
			
		КонецЕсли;
		
		ДанныеДокумента = Новый Структура;
		ДанныеДокумента.Вставить("Задача", ДанныеЗадачи.Ссылка);
		ДанныеДокумента.Вставить("Документ", ДанныеЗадачи.Предмет);
		ДанныеДокумента.Вставить("Шаблон", ДанныеЗадачи.Шаблон);
		ДанныеДокумента.Вставить("ИдентификаторЭтапа", ДанныеЗадачи.ИдентификаторЭтапа);
		ДанныеДокумента.Вставить("РезультатВыполнения", ДанныеЗадачи.РезультатВыполнения);
		ДанныеДокумента.Вставить("ПризнакПроведенности", Неопределено);
		ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитов", Ложь);
		ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитовПервичныхДокументов", Ложь);
		ДанныеДокумента.Вставить("УсловиеВыполнения", "");
		ДанныеДокумента.Вставить("НаличиеФайловОбязательно", Ложь);
		ДанныеДокумента.Вставить("ПодписыватьФайлыЭП", Ложь);
		ДанныеДокумента.Вставить("ОбособленнаяЗонаОтветственности", Ложь);
		ДанныеДокумента.Вставить("ОбработчикДоТранзакции", "");
		ДанныеДокумента.Вставить("ОбработчикКлиентский", "");
		ДанныеДокумента.Вставить("ОбработчикиВыполнены", Истина);
		ДанныеДокумента.Вставить("ВыполненныеОбработчики", Новый Массив);
		ДанныеДокумента.Вставить("ДополнительныеПараметры", Неопределено);
		
		Для Каждого ДополнительныйОбработчик Из Форма.ОбработчикиЗадач Цикл
			Если ДополнительныйОбработчик.Шаблон = ДанныеЗадачи.Шаблон
				И ДополнительныйОбработчик.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И ДополнительныйОбработчик.Статус = ПараметрыКоманды.Статус Тогда
				
				Если НЕ ПустаяСтрока(ДополнительныйОбработчик.ОбработчикДоТранзакции) Тогда
					ДанныеДокумента.Вставить("ОбработчикДоТранзакции", ДополнительныйОбработчик.ОбработчикДоТранзакции);
					ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
				КонецЕсли;
				
				Если НЕ ПустаяСтрока(ДополнительныйОбработчик.ОбработчикКлиентский) Тогда
					ДанныеДокумента.Вставить("ОбработчикКлиентский", ДополнительныйОбработчик.ОбработчикКлиентский);
					ДанныеДокумента.Вставить("ОбработчикиВыполнены", Ложь);
				КонецЕсли;
				
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ДополнительныйОбработчик Из Форма.ЭтапыСПроверкойЗаполненностиРеквизитов Цикл
			Если ДополнительныйОбработчик.Шаблон = ДанныеЗадачи.Шаблон
				И ДополнительныйОбработчик.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И НЕ ПараметрыКоманды.Отрицательная Тогда
				ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитов", Истина);
				ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ДополнительныйОбработчик Из Форма.ЭтапыСПроверкойЗаполненностиРеквизитовПД Цикл
			Если ДополнительныйОбработчик.Шаблон = ДанныеЗадачи.Шаблон
				И ДополнительныйОбработчик.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И НЕ ПараметрыКоманды.Отрицательная Тогда
				ДанныеДокумента.Вставить("ТребуетсяПроверкаЗаполненностиРеквизитовПервичныхДокументов", Истина);
				ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТребованиеКПроведению Из Форма.ТребованияКПроведению Цикл
			Если ТребованиеКПроведению.Шаблон = ДанныеЗадачи.Шаблон
				И ТребованиеКПроведению.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И ТребованиеКПроведению.Статус = ПараметрыКоманды.Статус Тогда
				ДанныеДокумента.Вставить("ПризнакПроведенности", ТребованиеКПроведению.ПризнакПроведенности);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТребованиеКВыполнению Из Форма.ТребованияКВыполнению Цикл
			Если ТребованиеКВыполнению.Шаблон = ДанныеЗадачи.Шаблон
				И ТребованиеКВыполнению.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И ТребованиеКВыполнению.Статус = ПараметрыКоманды.Статус Тогда
				ДанныеДокумента.Вставить("УсловиеВыполнения", ТребованиеКВыполнению.УсловиеВыполнения);
				ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СвойстваЭтапов Из Форма.СвойстваЭтаповШаблонов Цикл
			Если СвойстваЭтапов.Шаблон = ДанныеЗадачи.Шаблон
				И СвойстваЭтапов.ИдентификаторЭтапа = ДанныеЗадачи.ИдентификаторЭтапа
				И НЕ ПараметрыКоманды.Отрицательная Тогда
				
				ДанныеДокумента.Вставить("НаличиеФайловОбязательно", СвойстваЭтапов.НаличиеФайловОбязательно);
				ДанныеДокумента.Вставить("РасшифровкаОбязательныхПрисоединенныхФайлов", СвойстваЭтапов.РасшифровкаОбязательныхПрисоединенныхФайлов);
				ДанныеДокумента.Вставить("ПодписыватьФайлыЭП", СвойстваЭтапов.ПодписыватьФайлыЭП);
				ДанныеДокумента.Вставить("ОбособленнаяЗонаОтветственности", СвойстваЭтапов.ОбособленнаяЗонаОтветственности);
				
				Если СвойстваЭтапов.НаличиеФайловОбязательно Тогда
					ПараметрыКоманды.ТребуетсяВызовСервера = Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		ДанныеДокументов.Добавить(ДанныеДокумента);
		
		Если ДанныеДокумента.ПризнакПроведенности = Истина Тогда
			ДокументыКоторыеДолжныБытьПроведены.Добавить(ДанныеЗадачи.Предмет);
		ИначеЕсли ДанныеДокумента.ПризнакПроведенности = Ложь Тогда
			ДокументыКоторыеДолжныБытьНеПроведены.Добавить(ДанныеЗадачи.Предмет);
		КонецЕсли;
		
	КонецЦикла;
	
	ПараметрыКоманды.Вставить("ДанныеДокументов", ДанныеДокументов);
	ПараметрыКоманды.Вставить("ВывестиСообщениеОбОшибке", ДанныеДокументов.Количество() = 1);
	ПараметрыКоманды.Вставить("КомментарийПоУмолчанию", ?(ДанныеДокументов.Количество() = 1, ДанныеДокументов[0].РезультатВыполнения, ""));
	
	Если ДокументыКоторыеДолжныБытьПроведены.Количество() > 0 Тогда
		МассивНепроведенных = ОбщегоНазначенияВызовСервера.ПроверитьПроведенностьДокументов(ДокументыКоторыеДолжныБытьПроведены);
		Если МассивНепроведенных.Количество() > 0 Тогда
			
			ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после проведения документов:'");
			Для Каждого Документ Из МассивНепроведенных Цикл
				ТекстВопроса = ТекстВопроса + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '
				|%1'"), Документ);
			КонецЦикла;
			ТекстВопроса = ТекстВопроса + НСтр("ru = '
										|Документы будут проведены.'");
			
			ПараметрыКоманды.Вставить("МассивДокументовДляПроведения", МассивНепроведенных);
			// Сразу в обработчик передадим массив документов, которые должны быть не проведены
			ПараметрыКоманды.Вставить("ДокументыКоторыеДолжныБытьНеПроведены", ДокументыКоторыеДолжныБытьНеПроведены);
			Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияПроведенияДокументов", ЭтотОбъект, ПараметрыКоманды);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ДокументыКоторыеДолжныБытьНеПроведены.Количество() > 0 Тогда
		МассивПроведенных = ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			ДокументыКоторыеДолжныБытьНеПроведены, ОбщегоНазначенияВызовСервера.ПроверитьПроведенностьДокументов(ДокументыКоторыеДолжныБытьНеПроведены));
		Если МассивПроведенных.Количество() > 0 Тогда
			
			ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после отмены проведения документов:'");
			Для Каждого Документ Из МассивПроведенных Цикл
				ТекстВопроса = ТекстВопроса + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '
				|%1'"), Документ);
			КонецЦикла;
			ТекстВопроса = ТекстВопроса + НСтр("ru = '
										|Будет отменено проведение документов.'");
			
			ПараметрыКоманды.Вставить("МассивДокументовДляОтменыПроведения", МассивПроведенных);
			Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияОтменыПроведенияДокументов", ЭтотОбъект, ПараметрыКоманды);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыКоманды.Отрицательная И НЕ ПараметрыКоманды.НеЗаполнятьКомментарийПриОтрицательномРезультате Тогда
		// Вывод окна с вводом комментария для отрицательного результата выполнения
		Подсказка = НСтр("ru = 'Заполните комментарий (причину)'");
		Оповещение = Новый ОписаниеОповещения("ПродолжитьПослеВводаКомментария", ЭтотОбъект, ПараметрыКоманды);
		ПоказатьВводСтроки(Оповещение, ПараметрыКоманды.КомментарийПоУмолчанию, Подсказка, 0, Истина);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыКоманды.ТребуетсяЭП ИЛИ ПараметрыКоманды.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ПараметрыКоманды.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыКоманды.ТребуетсяВызовСервера Тогда 
		Если ПараметрыКоманды.ИспользуетсяМногопоточнаяПроверка Тогда
			Результат = ПроцессыОбработкиДокументовВызовСервера.СуществуютЭлектронныеПодписииПредыдущихЭтапов(ПараметрыКоманды.ДанныеДокументов);
			Если Результат Тогда
				ВыполнитьПроверкуДанныхВМногопоточномРежиме(ПараметрыКоманды); 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ВыполнитьПроцедурыСВызовомСервера(ПараметрыКоманды);
	КонецЕсли;
	
	Если ПараметрыКоманды.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

// Процедура выгрузки графической схемы в файл
Процедура ВыгрузитьСхемуВФайл(ГрафическаяСхема) Экспорт
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения(
		"ВыгрузитьСхемуВФайлПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект, ГрафическаяСхема));
	
КонецПроцедуры

// Процедура перехода (открытия связанного элемента)
// по гиперссылке схемы
Процедура ОткрытьГиперссылкуЭлементаСхемы(ЭлементСхемы, ГиперссылкиЭлементовСхемы) Экспорт
	
	Если ТипЗнч(ЭлементСхемы) <> Тип("ЭлементГрафическойСхемыДекорация") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ГиперссылкиЭлементовСхемы) = Тип("Структура")
		И ГиперссылкиЭлементовСхемы.Свойство(ЭлементСхемы.Имя) Тогда
		
		Гиперссылка = ГиперссылкиЭлементовСхемы[ЭлементСхемы.Имя];
		Если ЗначениеЗаполнено(Гиперссылка) Тогда
			ПоказатьЗначение(,Гиперссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОписаниеДополнительныхОбработчиков() Экспорт
	
	МассивОбработчиков = Новый Массив;
	
	ПроцессыОбработкиДокументовКлиентОбработчикиПереопределяемый.ОписаниеДополнительныхОбработчиков(МассивОбработчиков);
	
	СвернутыйМассив = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОбработчиков);
	Если МассивОбработчиков.Количество() > СвернутыйМассив.Количество() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Обнаружено дублирование идентификаторов дополнительных клиентских обработчиков. Список обработчиков будет недоступен.'"));
		МассивОбработчиков.Очистить();
	КонецЕсли;
	
	Возврат МассивОбработчиков;
	
КонецФункции

Процедура ПоказатьТекстовыйДокумент(Результат, Параметры) Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Параметры.Текст);
	ТекстовыйДокумент.ТолькоПросмотр = Истина;
	ТекстовыйДокумент.Показать(Параметры.Заголовок);
	
КонецПроцедуры

Процедура ПоказатьТабличныйДокумент(Результат, Параметры) Экспорт
	
	ТабличныйДокумент = ПроцессыОбработкиДокументовВызовСервера.ТабличныйДокументПоДвоичнымДанным(Параметры.Данные);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьГруппировки = Ложь;
	ТабличныйДокумент.Показать(Параметры.Заголовок);
	
КонецПроцедуры

Процедура ПоказатьДокументPDF(Результат, Параметры) Экспорт
	
	ФайловаяСистемаКлиент.ОткрытьФайл(Параметры.Данные, , "pdf");
	
КонецПроцедуры

// Открывает форму выбора исполнителя.
//
// Параметры:
//  ЭлементИсполнитель     - ЭлементФормы - элемент формы, в которой выполняется выбора исполнителя,
//                           который будет указан как владелец формы выбора исполнителя.
//  РеквизитИсполнитель    - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителя
//                         - выбранное ранее значение исполнителя. Используется
//                           для установки текущей строки в форме выбора исполнителя.
//  ТолькоРоли             - Булево - Если Истина, то указывает что для выбора нужно
//                           использовать только роли (без пользователей).
//  ОткрытиеИзФормыШаблона - Булево - признак доступности выбора ролей, предусмотренных для шаблона процесса.
//  Заголовок              - Строка - Заголовок формы выбора, если не заполнено то используется "Выбор исполнителя этапа"
//  ИдентификаторДокумента - Идентификатор документа, для которого выполняется выбор исполнителя.
//  ПараметрыВыбораИсполнителя - Структра - параметры выбора исполнителя.
//
Процедура ВыбратьИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель, ТолькоРоли = Ложь, ОткрытиеИзФормыШаблона = Ложь,
	Заголовок = "", ИдентификаторДокумента = Неопределено, ПараметрыВыбораИсполнителя = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриВыбореИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель, ТолькоРоли,
		ОткрытиеИзФормыШаблона, Заголовок, ИдентификаторДокумента, СтандартнаяОбработка, ПараметрыВыбораИсполнителя);
	Если Не СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Исполнитель", 					РеквизитИсполнитель);
	ПараметрыФормы.Вставить("ТолькоРоли", 					ТолькоРоли);
	ПараметрыФормы.Вставить("ОткрытиеИзФормыШаблона", 		ОткрытиеИзФормыШаблона);
	ПараметрыФормы.Вставить("Заголовок", 					Заголовок);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", 		ИдентификаторДокумента);
	ПараметрыФормы.Вставить("ПараметрыВыбораИсполнителя", 	ПараметрыВыбораИсполнителя);
	
	ОткрытьФорму("ОбщаяФорма.ВыборИсполнителяЭтапа", ПараметрыФормы, ЭлементИсполнитель);
	
КонецПроцедуры

// Открывает для выбора справочник "Идентификаторы объектов метаданных" с установленным отбором "В списке".
// Вызывается из процедуры "ПриНачалеВыбораЗначения".
//
// Параметры:
//	Элемент - стандартный параметр обработчика события "ПриНачалеВыбораЗначения".
//	ДанныеВыбора - стандартный параметр обработчика события "ПриНачалеВыбораЗначения".
//	СтандартнаяОбработка - стандартный параметр обработчика события "ПриНачалеВыбораЗначения".
//	ПараметрыФормы - Неопределено или Структура - параметры формы выбора (например, ТекущаяСтрока).
//	ЗначениеОтбора - СписокЗначений - правое значение устанавливаемого отбора.
//					Переданная коллекция автоматически преобразуется к списку значений.
//
Процедура ОткрытьФормуВыбораТипаДокумента(Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыФормы, ЗначениеОтбора) Экспорт
	
	Если ПараметрыФормы = Неопределено Тогда
		Параметры = Новый Структура;
	Иначе
		Параметры = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыФормы);
	КонецЕсли;
	
	Если Параметры.Количество() = 0 И Не ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроек.Настройки.Отбор,
														"Ссылка",
														ЗначениеОтбора);
	
	Параметры.Вставить("ФиксированныеНастройки",	КомпоновщикНастроек.Настройки);
	Параметры.Вставить("РежимВыбора",				Истина);
	
	ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", Параметры, Элемент);
	
КонецПроцедуры

// Запускает обновляет реквизиты и команды на форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, на которой необходимо обновить реквизиты и команды.
//
Процедура ОбновитьРеквизитыПоШаблонуПроцесса(Форма) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение", Форма);
	ВыполнитьОбработкуОповещения(Оповещение, "ОбновитьРеквизитыПоШаблонуПроцесса");
	
КонецПроцедуры

// Обработчик события ПередЗакрытием формы объекта.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма, которая закрывается.
//   Источник - ДанныеФормыСтруктура - Объект с полем "Ссылка".
//   Отказ - Булево - одноименный параметр события ПередЗакрытием управляемой формы.
//   ЗавершениеРаботы - Булево - одноименный параметр события ПередЗакрытием управляемой формы.
//   ТекстПредупреждения - Строка - одноименный параметр события ПередЗакрытием управляемой формы.
//   СтандартнаяОбработка - Булево - одноименный параметр события ПередЗакрытием управляемой формы.
//
Процедура ПередЗакрытием(Форма, Знач Источник, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Экспорт
	
	Ссылка = Источник.Ссылка;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПроцессыОбработкиДокументов_ТекущаяЗадача") Тогда
		Если НЕ Форма.Модифицированность И Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя Тогда
			
			Отказ = Истина;
			
			Если ЗавершениеРаботы Тогда
				ТекстПредупреждения = "Данные были изменены. Все изменения будут потеряны.";
				Возврат;
			КонецЕсли;
			
			Если Ссылка.Пустая() Тогда
				ПараметрыОбработчика = Новый Структура;
				ПараметрыОбработчика.Вставить("Форма", Форма);
				ПараметрыОбработчика.Вставить("Источник", Источник);
				Обработчик = Новый ОписаниеОповещения("ПродолжитьПослеПодтвержденияЗаписиИЗакрытия", ЭтотОбъект, ПараметрыОбработчика);
				ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
				ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			Иначе
				Обработчик = Новый ОписаниеОповещения("ПродолжитьПослеПодтвержденияЗакрытия", ЭтотОбъект, Форма);
				ТекстВопроса = НСтр("ru = 'Сохранить комментарий задачи по обработке документа?'");
				ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму "Карточка процесса документа".
//
// Параметры:
//   ПараметрыФормы - Структура - одноименный параметр функции ОткрытьФорму.
//   Владелец - Форма или Элемент управления Формы - одноименный параметр функции ОткрытьФорму.
//   Уникальность - Произвольный - одноименный параметр функции ОткрытьФорму.
//   Окно - ОкноКлиентскогоПриложения - одноименный параметр функции ОткрытьФорму.
//
Процедура ОткрытьКарточкуПроцессаДокумента(Знач ПараметрыФормы = Неопределено, Знач Владелец = Неопределено, Знач Уникальность = Неопределено, Знач Окно = Неопределено) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.КарточкаПроцессаДокумента", ПараметрыФормы, Владелец, Уникальность, Окно);
	
КонецПроцедуры

Процедура КомментарийНаправившегоОткрытие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПозицияРазделителя = СтрНайти(Форма.ПроцессыОбработкиДокументов_КомментарийНаправившего, ":");
	Автор = Лев(Форма.ПроцессыОбработкиДокументов_КомментарийНаправившего, ПозицияРазделителя - 1);
	ОписаниеЗадачи = Сред(Форма.ПроцессыОбработкиДокументов_КомментарийНаправившего, ПозицияРазделителя + 2);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Автор", Автор);
	ПараметрыФормы.Вставить("ОписаниеЗадачи", ОписаниеЗадачи);
	
	ОткрытьФорму("ОбщаяФорма.ОписаниеЗадачи", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура КомментарийСледующемуНачалоВыбора(Форма, Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования,
																	Форма,
																	"ПроцессыОбработкиДокументов_КомментарийСледующему",
																	НСтр("ru='Комментарий для следующего исполнителя, описание выполнения задачи'"));
	
КонецПроцедуры

Процедура ПриОткрытииФормыПредварительногоПросмотраРегламентированногоОтчета(Форма, ПараметрыФормы) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриОткрытииФормыПредварительногоПросмотраРегламентированногоОтчета(
		Форма, ПараметрыФормы, СтандартнаяОбработка);
		
	Если СтандартнаяОбработка Тогда
		МодульРегламентированнаяОтчетностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РегламентированнаяОтчетностьКлиент");
		МодульРегламентированнаяОтчетностьКлиент.ВывестиНаПечатьИлиНаПредварительныйПросмотрФормуРегламентированногоОтчета(
			Форма, ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриСохраненииМодификацийВПечатнойФормеРегламентированногоОтчета(Форма, ТекущиеДанныеОтчета) Экспорт
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриСохраненииМодификацийВПечатнойФормеРегламентированногоОтчета(
		Форма, ТекущиеДанныеОтчета);
	
КонецПроцедуры

// Возвращает структуру, содержащую шаблон процесса и идентификатор этапа для переданной формы документа.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, из которой требуется получить данные шаблона процесса.
//
Функция ШаблонИИдентификаторЭтапаИзФормы(Форма) Экспорт
	
	ДанныеИзФормы = Новый Структура;
	ДанныеИзФормы.Вставить("ПроцессыОбработкиДокументов_ТекущийШаблон", Новый УникальныйИдентификатор());
	ДанныеИзФормы.Вставить("ПроцессыОбработкиДокументов_ТекущийИдентификаторЭтапа", Новый УникальныйИдентификатор());
	ЗаполнитьЗначенияСвойств(ДанныеИзФормы, Форма);
	
	Результат = Новый Структура;
	Результат.Вставить("Шаблон", ПредопределенноеЗначение("Справочник.ШаблоныПроцессов.ПустаяСсылка"));
	Результат.Вставить("Этап", Новый УникальныйИдентификатор);
	
	Если ТипЗнч(ДанныеИзФормы.ПроцессыОбработкиДокументов_ТекущийШаблон) <> Тип("УникальныйИдентификатор") Тогда
		Результат.Шаблон = ДанныеИзФормы.ПроцессыОбработкиДокументов_ТекущийШаблон;
		Результат.Этап = ДанныеИзФормы.ПроцессыОбработкиДокументов_ТекущийИдентификаторЭтапа;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПоказатьДокументИзПрисоединенногоФайла(Результат, Параметры) Экспорт

	Файл = Параметры.Ссылка;
	Если ЗначениеЗаполнено(Файл) Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(
			Файл, Неопределено, УникальныйИдентификатор);
		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьДокументФормуляра(Результат, Параметры) Экспорт

	ДокументФормуляра = Параметры.Формуляр;
	Если ЗначениеЗаполнено(ДокументФормуляра) Тогда
		ПараметрыФормы = Новый Структура("Ключ, СкрытьПрисоединенныеФайлы", ДокументФормуляра, Истина);
	Иначе
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ формуляра не найден.'"));
		Возврат;
	КонецЕсли;

	ФормаФормуляра = ОткрытьФорму("Документ.ФормулярПервичногоДокументаПОД.Форма.ФормаФормуляра", ПараметрыФормы);
	
КонецПроцедуры

#Область ИнтеграцияСБЭД

Процедура ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы) Экспорт
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры

Процедура ОткрытьТекущиеДелаЭДО() Экспорт

	ПроцессыОбработкиДокументовКлиентПереопределяемый.ОткрытьТекущиеДелаЭДО();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОжидатьЗавершениеВыполненияЗадач(Форма, ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ВыполнениеЗадачПоОбработкеДокументовПрогресс", Форма);
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПриЗавершенииВыполненияДлительнойОперации", Форма, ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Функция ПредставлениеСрокаВыполненияИнтервала(Параметры) Экспорт
	
	ИспользуютсяГрафикиРаботы = ПроцессыОбработкиДокументовКлиентПовтИсп.ИспользуютсяГрафикиРаботы();
	
	Возврат ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеСрокаВыполненияИнтервала(Параметры, ИспользуютсяГрафикиРаботы);
	
КонецФункции

Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	ПараметрыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	Если НЕ ПараметрыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если ПользователиКлиент.ЭтоСеансВнешнегоПользователя() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыКлиента.Свойство("ПроцессыОбработкиДокументов_ПоказыватьОповещенияОНовыхЗадачах")
		И ПараметрыКлиента.ПроцессыОбработкиДокументов_ПоказыватьОповещенияОНовыхЗадачах Тогда
		ПодключитьГлобальныйОбработчикОжидания("ПроцессыОбработкиДокументовВывестиОповещениеОНовыхЗадачах");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодключитьГлобальныйОбработчикОжидания(ИмяОбработчика, Интервал = 0) Экспорт
	ПодключитьОбработчикОжидания(ИмяОбработчика, ?(Интервал = 0, 0.3, Интервал * 60), Интервал = 0);
КонецПроцедуры

Процедура ВывестиОповещениеОНовыхЗадачах() Экспорт
	
	ИмяПараметра = "ПроцессыОбработкиДокументов.ДатаПредыдущегоОповещенияОНовыхЗадачах";
	ДатаПредыдущегоОповещения = ПараметрыПриложения[ИмяПараметра];
	
	ИнформацияОЗадачах = ПроцессыОбработкиДокументовВызовСервера.ИнформацияДляОповещенияОНовыхЗадачах(
		ДатаПредыдущегоОповещения);
	
	ПараметрыПриложения.Вставить(ИмяПараметра, ИнформацияОЗадачах.ТекущаяДата);
	
	Текст = "";
	Если ИнформацияОЗадачах.Всего > 0 Тогда
		Текст = Текст + НСтр("ru = 'всего: '") + Формат(ИнформацияОЗадачах.Всего, "ЧН=; ЧГ=");
		Если ИнформацияОЗадачах.Новые > 0 Тогда
			Текст = Текст + НСтр("ru = ' (новые: '") + Формат(ИнформацияОЗадачах.Новые, "ЧН=; ЧГ=") + ")";
		КонецЕсли;
		Текст = Текст + Символы.ПС + НСтр("ru = 'принято к исполнению: '") + Формат(ИнформацияОЗадачах.ПринятоКИсполнению, "ЧН=; ЧГ=");
		Если ИнформацияОЗадачах.Просроченные > 0 Тогда
			Текст = Текст + Символы.ПС + НСтр("ru = 'просроченные: '") + Формат(ИнформацияОЗадачах.Просроченные, "ЧН=; ЧГ=");
			Если ИнформацияОЗадачах.ПросроченныеНовые > 0 Тогда
				Текст = Текст + НСтр("ru = ' (новые: '") + Формат(ИнформацияОЗадачах.ПросроченныеНовые, "ЧН=; ЧГ=") + ")";
			КонецЕсли;
		КонецЕсли;
		Если ИнформацияОЗадачах.Срочные > 0 Тогда
			Текст = Текст + Символы.ПС + НСтр("ru = 'срочные: '") + Формат(ИнформацияОЗадачах.Срочные, "ЧН=; ЧГ=");
			Если ИнформацияОЗадачах.СрочныеНовые > 0 Тогда
				Текст = Текст + НСтр("ru = ' (новые: '") + Формат(ИнформацияОЗадачах.СрочныеНовые, "ЧН=; ЧГ=") + ")";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Текст) Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Задачи по обработке документов'"), , Текст);
	КонецЕсли;
	
	// Первый вызов делается однократно, после - периодически
	Если НЕ ЗначениеЗаполнено(ДатаПредыдущегоОповещения) Тогда
		ПодключитьГлобальныйОбработчикОжидания("ПроцессыОбработкиДокументовВывестиОповещениеОНовыхЗадачах",
			ИнформацияОЗадачах.ИнтервалЗапуска);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуФормированияУведомленияОбИспользованииПЭП(Организация, СписокПользователей,
	ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	ПараметрыОткрытияФормы.Вставить("СписокПользователей", СписокПользователей);
	
	ОткрытьФорму("Обработка.ПодготовкаДокументовПОД.Форма.ФормированиеУведомленияОбИспользованииПЭП",
		ПараметрыОткрытияФормы, ВладелецФормы, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуФормированияПоложенияОбИспользованииПЭП(Организация, ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	
	ОткрытьФорму("Обработка.ПодготовкаДокументовПОД.Форма.ФормированиеПоложенияОбИспользованииПЭП",
		ПараметрыОткрытияФормы, ВладелецФормы, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПродолжитьВыполнениеЗадач(Параметры, Отказ = Ложь, ОписаниеОшибки = "") Экспорт
	
	Если Отказ Тогда
		
		// При отказе выполнение всех задач в пачке прерывается
		
		Параметры.ОписаниеОшибки = ОписаниеОшибки;
		
		ЗадачиСОтказомВыполнения = Новый Массив;
		
		Для Индекс = 0 По Параметры.ДанныеДокументов.ВГраница() Цикл
			ДанныеДокумента = Параметры.ДанныеДокументов[Индекс];
			ЗадачаСОтказомВыполнения = Новый Структура;
			ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
			ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
			ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", Параметры.ОписаниеОшибки);
			ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения); 
			Если Не Параметры.Свойство("ОшибкаФоновогоЗадания") Тогда
				Параметры.ДанныеДокументов.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, Параметры.ВывестиСообщениеОбОшибке);
		
		Возврат;
		
	КонецЕсли;
	
	Если Параметры.ТребуетсяПроверкаПредыдущихЭП Тогда
		ПроверитьЭлектронныеПодписиНаКлиенте(Параметры);
	ИначеЕсли Параметры.ТребуетсяЭП ИЛИ Параметры.ТребуетсяПростаяЭП Тогда
		ПодписатьДанныеДокументов(Параметры);
	Иначе
		ПродолжитьВыполнениеЗадачи(Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеЗадачи(Параметры) Экспорт
	
	Если Параметры.Свойство("Отказ") И Параметры.Отказ Тогда
		
		Параметры.ОписаниеОшибки = НСтр("ru = 'В дополнительном клиентском обработчике был установлен отказ от выполнения этапа по причине:
									|'") + Параметры.ОписаниеОшибки;
		
		ЗадачиСОтказомВыполнения = Новый Массив;
		// задачи по документам с отказом в доп. обработчике далее не выполняются
		Для Индекс = 0 По Параметры.ДанныеДокументов.ВГраница() Цикл
			ДанныеДокумента = Параметры.ДанныеДокументов[Индекс];
			Если Параметры.Источник = ДанныеДокумента.Документ Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", Параметры.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				Параметры.ДанныеДокументов.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, Параметры.ВывестиСообщениеОбОшибке);
	КонецЕсли;
	
	Параметры.Вставить("Отказ", Ложь);
	Параметры.Вставить("ОписаниеОшибки", "");
	Для Каждого ДанныеДокумента Из Параметры.ДанныеДокументов Цикл
		// для выполненного обработчика по документу сохраним значение дополнительных параметров
		Если Параметры.Свойство("Источник") И Параметры.Источник = ДанныеДокумента.Документ Тогда
			ДанныеДокумента.ДополнительныеПараметры = Параметры.ДополнительныеПараметры;
		КонецЕсли;
		
		Если ДанныеДокумента.ОбработчикиВыполнены Тогда
			Продолжить;
		КонецЕсли;
		
		КлиентскиеОбработчики = СтрРазделить(ДанныеДокумента.ОбработчикКлиентский, ";");
		Для Каждого Обработчик Из КлиентскиеОбработчики Цикл
			Если ДанныеДокумента.ВыполненныеОбработчики.Найти(Обработчик) = Неопределено Тогда
				ДанныеДокумента.ВыполненныеОбработчики.Добавить(Обработчик);
				Если КлиентскиеОбработчики.Количество() = ДанныеДокумента.ВыполненныеОбработчики.Количество() Тогда
					// установка признака выполнения обработчиков по документу перед выполнением последнего их них
					ДанныеДокумента.ОбработчикиВыполнены = Истина;
				КонецЕсли;
				Параметры.Вставить("Источник", ДанныеДокумента.Документ);
				Параметры.Вставить("ДополнительныеПараметры", ДанныеДокумента.ДополнительныеПараметры);
				ПроцессыОбработкиДокументовКлиентОбработчикиПереопределяемый.ВыполнитьДополнительныйОбработчик(Обработчик, Параметры);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Параметры.Удалить("Отказ");
	Параметры.Удалить("ОписаниеОшибки");
	
	Если Параметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстЗадачи = Новый Структура;
	КонтекстЗадачи.Вставить("Статус", Параметры.Статус);
	КонтекстЗадачи.Вставить("ИдентификаторПачки", Параметры.ИдентификаторПачки);
	КонтекстЗадачи.Вставить("ДанныеДокументов", Параметры.ДанныеДокументов);
	КонтекстЗадачи.Вставить("Комментарий", Параметры.Комментарий);
	
	Если Параметры.Свойство("НаборДанных") Тогда
		Для Каждого Набор Из Параметры.НаборДанных Цикл
			Набор.Удалить("Представление");
		КонецЦикла;
		КонтекстЗадачи.Вставить("НаборДанных", Параметры.НаборДанных);
	КонецЕсли;
	
	КонтекстЗадачи.Вставить("ДополнительныйКонтекст", Параметры.ДополнительныйКонтекст);
	
	ОповещениеПослеВыполненияЗадачи = Новый ОписаниеОповещения("ПослеВыполненияЗадачи", ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение", Параметры.Форма, ОповещениеПослеВыполненияЗадачи);
	ВыполнитьОбработкуОповещения(Оповещение, КонтекстЗадачи);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияПроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ВыполняетсяЗаписьПоКнопкеВыполненияЭтапа = Истина;
	
	ШаблонДоЗаписи = ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ТекущийШаблон;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Попытка
		ДополнительныеПараметры.Форма.Записать(ПараметрыЗаписи);
	Исключение
		ПоказатьОповещениеПользователя(,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),БиблиотекаКартинок.Информация32);
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецПопытки;
	
	Если ДополнительныеПараметры.Объект.Ссылка.Пустая()
		ИЛИ ДополнительныеПараметры.Форма.Модифицированность
		ИЛИ НЕ ДополнительныеПараметры.Объект.Проведен Тогда
		Если НЕ ДополнительныеПараметры.ДанныеДокументов[0].Задача.Пустая() Тогда
			ЗадачаСОтказомВыполнения = Новый Структура;
			ЗадачаСОтказомВыполнения.Вставить("Задача", ДополнительныеПараметры.ДанныеДокументов[0].Задача);
			ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
			ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Не удалось провести '") + ДополнительныеПараметры.ДанныеДокументов[0].Документ);
			ОтметитьНеУспешнуюПопыткуВыполненияЗадач(
				ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗадачаСОтказомВыполнения), ДополнительныеПараметры.ВывестиСообщениеОбОшибке);
		КонецЕсли;
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	ИначеЕсли ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ШаблонВРегистре <> ШаблонДоЗаписи Тогда
		// Произошла смена шаблона, необходимо прекратить выполнение этапа
		ТекстСообщения = НСтр("ru = 'Шаблон процесса был изменен согласно условиям использования. Выполнение задачи отменено.'");
		ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
		// Требуется переинициализция формы
		ДополнительныеПараметры.Форма.Прочитать();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДокументЗаписан");
	
	// Если документ был новый либо произошла смена шаблона,
	// то необходимо в параметрах установить ссылку на документ и на новую задачу
	Если ДополнительныеПараметры.ДанныеДокументов[0].Документ.Пустая()
		ИЛИ ДополнительныеПараметры.ДанныеДокументов[0].Задача.Пустая() Тогда
		
		ДополнительныеПараметры.ДанныеДокументов[0].Документ = ДополнительныеПараметры.Объект.Ссылка;
		ДополнительныеПараметры.ДанныеДокументов[0].Задача = ПроцессыОбработкиДокументовВызовСервера.ЗадачаНовогоДокумента(
			ДополнительныеПараметры.ДанныеДокументов[0].Шаблон,
			ДополнительныеПараметры.ДанныеДокументов[0].ИдентификаторЭтапа,
			ДополнительныеПараметры.ДанныеДокументов[0].Документ);
		
		ИдентификаторПачки = ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиКакВыполняемые(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.ДанныеДокументов[0].Задача));
		ДополнительныеПараметры.Вставить("ИдентификаторПачки", ИдентификаторПачки);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДополнительныеПараметры.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяВызовСервера Тогда
		ВыполнитьПроцедурыСВызовомСервера(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияОтменыПроведения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ВыполняетсяЗаписьПоКнопкеВыполненияЭтапа = Истина;
	
	ШаблонДоЗаписи = ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ТекущийШаблон;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
	
	Попытка
		ДополнительныеПараметры.Форма.Записать(ПараметрыЗаписи);
	Исключение
		ПоказатьОповещениеПользователя(,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),БиблиотекаКартинок.Информация32);
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецПопытки;
	
	Если ДополнительныеПараметры.Объект.Ссылка.Пустая()
		ИЛИ ДополнительныеПараметры.Форма.Модифицированность
		ИЛИ ДополнительныеПараметры.Объект.Проведен Тогда
		ЗадачиСОтказомВыполнения = Новый Массив;
		ЗадачаСОтказомВыполнения = Новый Структура;
		ЗадачаСОтказомВыполнения.Вставить("Задача", ДополнительныеПараметры.ДанныеДокументов[0].Задача);
		ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
		ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", НСтр("ru = 'Не удалось отменить проведение '") + ДополнительныеПараметры.ДанныеДокументов[0].Документ);
		ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
		ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, ДополнительныеПараметры.ВывестиСообщениеОбОшибке);
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	ИначеЕсли ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ШаблонВРегистре <> ШаблонДоЗаписи Тогда
		// Произошла смена шаблона, необходимо прекратить выполнение этапа
		ТекстСообщения = НСтр("ru = 'Шаблон процесса был изменен согласно условиям использования. Выполнение задачи отменено.'");
		ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
		// Требуется переинициализция формы
		ДополнительныеПараметры.Форма.Прочитать();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДокументЗаписан");
	
	// Если документ был новый, то необходимо в параметрах установить ссылку
	Если ДополнительныеПараметры.ДанныеДокументов[0].Документ.Пустая() Тогда
		ДополнительныеПараметры.ДанныеДокументов[0].Документ = ДополнительныеПараметры.Объект.Ссылка;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДополнительныеПараметры.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяВызовСервера Тогда
		ВыполнитьПроцедурыСВызовомСервера(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияПроведенияДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ЗадачиСОтказомВыполнения = Новый Массив;
	
	ДополнительныеСвойства = Новый Структура("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиЗапущенногоПроцессаВыполнения", Истина);
	
	НепроведенныеДокументы = ПроцессыОбработкиДокументовВызовСервера.ПровестиДокументы(
		ДополнительныеПараметры.МассивДокументовДляПроведения, ДополнительныеСвойства);
	Для Каждого НепроведенныйДокумент Из НепроведенныеДокументы Цикл
		
		Если Лев(НепроведенныйДокумент.ОписаниеОшибки, 28) = НСтр("ru = 'Поля документа не заполнены.'") Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось провести ""%1""!
							|%2'"),
							НепроведенныйДокумент.Ссылка,
							НепроведенныйДокумент.ОписаниеОшибки);
		Иначе
			ТекстСообщения = НепроведенныйДокумент.ОписаниеОшибки;
		КонецЕсли;
		НепроведенныйДокумент.ОписаниеОшибки = ТекстСообщения;
		
		// задачи по не проведенным документам далее не выполняются
		Для Индекс = 0 По ДополнительныеПараметры.ДанныеДокументов.ВГраница() Цикл
			ДанныеДокумента = ДополнительныеПараметры.ДанныеДокументов[Индекс];
			Если ДанныеДокумента.Документ = НепроведенныйДокумент.Ссылка Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", НепроведенныйДокумент.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				ДополнительныеПараметры.ДанныеДокументов.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, ДополнительныеПараметры.ВывестиСообщениеОбОшибке);
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДокументыКоторыеДолжныБытьНеПроведены.Количество() > 0 Тогда
		МассивНепроведенных = ОбщегоНазначенияВызовСервера.ПроверитьПроведенностьДокументов(ДополнительныеПараметры.ДокументыКоторыеДолжныБытьНеПроведены);
		МассивПроведенных = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ДополнительныеПараметры.ДокументыКоторыеДолжныБытьНеПроведены, МассивНепроведенных);
		Если МассивПроведенных.Количество() > 0 Тогда
			
			ТекстВопроса = НСтр("ru = 'Выполнение действия возможно после отмены проведения документов:'");
			Для Каждого Документ Из МассивПроведенных Цикл
				ТекстВопроса = ТекстВопроса + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '
				|%1'"), Документ);
			КонецЦикла;
			ТекстВопроса = ТекстВопроса + НСтр("ru = '
										|Будет отменено проведение документов.'");
			
			ДополнительныеПараметры.Вставить("МассивДокументовДляОтменыПроведения", МассивПроведенных);
			Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтвержденияОтменыПроведенияДокументов", ЭтотОбъект, ДополнительныеПараметры);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Отрицательная И НЕ ДополнительныеПараметры.НеЗаполнятьКомментарийПриОтрицательномРезультате Тогда
		// Вывод окна с вводом комментария для отрицательного результата выполнения этапа
		Подсказка = НСтр("ru = 'Заполните комментарий (причину)'");
		Оповещение = Новый ОписаниеОповещения("ПродолжитьПослеВводаКомментария", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводСтроки(Оповещение, ДополнительныеПараметры.КомментарийПоУмолчанию, Подсказка, 0, Истина);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДополнительныеПараметры.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяВызовСервера Тогда
		ВыполнитьПроцедурыСВызовомСервера(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияОтменыПроведенияДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ЗадачиСОтказомВыполнения = Новый Массив;
	
	ДополнительныеСвойства = Новый Структура("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиЗапущенногоПроцессаВыполнения", Истина);
	
	ПроведенныеДокументы = ПроцессыОбработкиДокументовВызовСервера.ОтменитьПроведениеДокументов(
		ДополнительныеПараметры.МассивДокументовДляОтменыПроведения, ДополнительныеСвойства);
	Для Каждого ПроведенныйДокумент Из ПроведенныеДокументы Цикл
		
		// задачи по проведенным документам далее не выполняются
		Для Индекс = 0 По ДополнительныеПараметры.ДанныеДокументов.ВГраница() Цикл
			ДанныеДокумента = ДополнительныеПараметры.ДанныеДокументов[Индекс];
			Если ДанныеДокумента.Документ = ПроведенныйДокумент.Ссылка Тогда
				ЗадачаСОтказомВыполнения = Новый Структура;
				ЗадачаСОтказомВыполнения.Вставить("Задача", ДанныеДокумента.Задача);
				ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
				ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ПроведенныйДокумент.ОписаниеОшибки);
				ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
				ДополнительныеПараметры.ДанныеДокументов.Удалить(Индекс);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, ДополнительныеПараметры.ВывестиСообщениеОбОшибке);
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Отрицательная И НЕ ДополнительныеПараметры.НеЗаполнятьКомментарийПриОтрицательномРезультате Тогда
		// Вывод окна с вводом комментария для отрицательного результата выполнения этапа
		Подсказка = НСтр("ru = 'Заполните комментарий (причину)'");
		Оповещение = Новый ОписаниеОповещения("ПродолжитьПослеВводаКомментария", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВводСтроки(Оповещение, ДополнительныеПараметры.КомментарийПоУмолчанию, Подсказка, 0, Истина);
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДополнительныеПараметры.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяВызовСервера Тогда
		ВыполнитьПроцедурыСВызовомСервера(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеПодтвержденияЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ВыполняетсяЗаписьПоКнопкеВыполненияЭтапа = Истина;
	
	ШаблонДоЗаписи = ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ТекущийШаблон;
	
	Попытка
		ДополнительныеПараметры.Форма.Записать(Новый Структура);
	Исключение
		ПоказатьОповещениеПользователя(,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),БиблиотекаКартинок.Информация32);
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	КонецПопытки;
	
	Если ДополнительныеПараметры.Объект.Ссылка.Пустая() ИЛИ ДополнительныеПараметры.Форма.Модифицированность Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	ИначеЕсли ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ШаблонВРегистре <> ШаблонДоЗаписи Тогда
		// Произошла смена шаблона, необходимо прекратить выполнение этапа
		ТекстСообщения = НСтр("ru = 'Шаблон процесса был изменен согласно условиям использования. Выполнение задачи отменено.'");
		ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
		// Требуется переинициализция формы
		ДополнительныеПараметры.Форма.Прочитать();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДокументЗаписан");
	
	// Если документ был новый либо произошла смена шаблона,
	// то необходимо в параметрах установить ссылку на документ и на новую задачу
	Если ДополнительныеПараметры.ДанныеДокументов[0].Документ.Пустая()
		ИЛИ ДополнительныеПараметры.ДанныеДокументов[0].Задача.Пустая() Тогда
		
		ДополнительныеПараметры.ДанныеДокументов[0].Документ = ДополнительныеПараметры.Объект.Ссылка;
		ДополнительныеПараметры.ДанныеДокументов[0].Задача = ПроцессыОбработкиДокументовВызовСервера.ЗадачаНовогоДокумента(
			ДополнительныеПараметры.ДанныеДокументов[0].Шаблон,
			ДополнительныеПараметры.ДанныеДокументов[0].ИдентификаторЭтапа,
			ДополнительныеПараметры.ДанныеДокументов[0].Документ);
		
		ИдентификаторПачки = ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиКакВыполняемые(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеПараметры.ДанныеДокументов[0].Задача));
		ДополнительныеПараметры.Вставить("ИдентификаторПачки", ИдентификаторПачки);
		
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ОписаниеОшибки = "";
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(ДополнительныеПараметры.ДанныеДокументов, ОписаниеОшибки);
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТребуетсяВызовСервера Тогда
		ВыполнитьПроцедурыСВызовомСервера(ДополнительныеПараметры);
	КонецЕсли;
	
	Если ДополнительныеПараметры.ДанныеДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	СтандартнаяОбработка = Истина;
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеЗадач(ДополнительныеПараметры, Отказ, ОписаниеОшибки);
	
КонецПроцедуры

Процедура ПродолжитьВыполнениеКомандыПослеЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		
		Для Каждого ТекДанные Из Результат.НаборДанных Цикл
			Если Результат.Свойство("РезультатПроверкиМЧДДляПодписания") Тогда
				Если Результат.РезультатПроверкиМЧДДляПодписания <> Неопределено Тогда
					РезультатПроверкиПодписиПоМЧД = Новый Структура;
					РезультатПроверкиПодписиПоМЧД.Вставить("ТребуетсяПроверка", Истина);
					
					ТекДанные.СвойстваПодписи.Вставить("РезультатПроверкиПодписиПоМЧД", РезультатПроверкиПодписиПоМЧД);
					Если Результат.Свойство("ВыбраннаяДоверенность") Тогда
						ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("МашиночитаемаяДоверенность", Результат.ВыбраннаяДоверенность);
					КонецЕсли;
					ПротоколПроверки = Новый Соответствие;
					ПроверкаДоверенности = Новый Структура;
					ПроверкаПодписанта = Новый Структура;
					ПроверкаПолномочий = Новый Структура;
					ПроверкаДокумента = Новый Структура;
					
					Проверка = Новый Структура;
					Проверка.Вставить("Верна", Неопределено);
					Проверка.Вставить("ЗаголовокПроверки", "");
					Проверка.Вставить("ТекстПроверки", "");
					Проверка.Вставить("ДатаПроверки", Неопределено);
					Проверка.Вставить("РучнаяПроверка", Ложь);
					Проверка.Вставить("ДополнительныеДанные", Неопределено);
					
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаДоверенности") Тогда
						ПроверкаДоверенности = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаДоверенности;
					КонецЕсли;	
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаПодписанта") Тогда
						ПроверкаПодписанта = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаПодписанта;
					КонецЕсли;
						
					ПроверкаПолномочий = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаПолномочий.ЗаголовокПроверки = "Проверка полномочий";
					ПроверкаДокумента = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаДокумента.ЗаголовокПроверки = "Проверка документа";
					
					ПротоколПроверки.Вставить("ПроверкаДоверенности", ПроверкаДоверенности);
					ПротоколПроверки.Вставить("ПроверкаПодписанта", ПроверкаПодписанта);
					ПротоколПроверки.Вставить("ПроверкаПолномочий", ПроверкаПолномочий);
					ПротоколПроверки.Вставить("ПроверкаДокумента", ПроверкаДокумента);
					
					ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("ПротоколПроверки", ПротоколПроверки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ДополнительныеПараметры.Вставить("НаборДанных", Результат.НаборДанных);
		
		ПродолжитьВыполнениеЗадачи(ДополнительныеПараметры);
		
	Иначе
		
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ДополнительныеПараметры.ИдентификаторПачки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьПослеВводаКомментария(Текст, Параметры) Экспорт
	
	Если Текст = Неопределено Тогда
		
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(Параметры.ИдентификаторПачки);
		
	ИначеЕсли ПустаяСтрока(Текст) Тогда
		
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(Параметры.ИдентификаторПачки);
		
		ТекстСообщения = НСтр("ru='Для выполнения выбранного действия необходимо заполнить комментарий.'");
		ПоказатьОповещениеПользователя(,,ТекстСообщения,БиблиотекаКартинок.Информация32);
		
	Иначе
		
		Параметры.Вставить("Комментарий", Текст);
		
		Если Параметры.ТребуетсяЭП ИЛИ Параметры.ТребуетсяПростаяЭП Тогда
			ОписаниеОшибки = "";
			ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДокументов(Параметры.ДанныеДокументов, ОписаниеОшибки);
			Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
				ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(Параметры.ИдентификаторПачки);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.ТребуетсяВызовСервера Тогда
			ВыполнитьПроцедурыСВызовомСервера(Параметры);
		КонецЕсли;
		
		Если Параметры.ДанныеДокументов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Отказ = Ложь;
		ОписаниеОшибки = "";
		СтандартнаяОбработка = Истина;
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(Параметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
		Если НЕ СтандартнаяОбработка Тогда
			Возврат;
		КонецЕсли;
		
		ПродолжитьВыполнениеЗадач(Параметры, Отказ, ОписаниеОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьПослеПодтвержденияЗакрытия(Результат, Форма) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ПроцессыОбработкиДокументовВызовСервера.СохранитьКомментарийИсполнителяЗадачи(
			Форма.ПроцессыОбработкиДокументов_ТекущаяЗадача,
			Форма.ПроцессыОбработкиДокументов_КомментарийСледующему);
	КонецЕсли;
	
	Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя = Ложь;
	Форма.Закрыть();
	
КонецПроцедуры

Процедура ПродолжитьПослеПодтвержденияЗаписиИЗакрытия(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		
		ДополнительныеПараметры.Форма.Записать();
		
		Если ДополнительныеПараметры.Источник.Ссылка.Пустая() ИЛИ ДополнительныеПараметры.Форма.Модифицированность Тогда
			Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя = Ложь;
	ДополнительныеПараметры.Форма.Закрыть();
	
КонецПроцедуры

Процедура ВыполнитьПроцедурыСВызовомСервера(Параметры)
	
	ЗадачиСОтказомВыполнения = Новый Массив;
	
	ПроцессыОбработкиДокументовВызовСервера.ВыполнитьПроцедурыСВызовомСервера(
		Параметры.ДанныеДокументов,
		Параметры.ДополнительныйКонтекст,
		Параметры.ТребуетсяЭП,
		Параметры.ТребуетсяПростаяЭП,
		Параметры.ДанныеДляПодписи,
		Параметры.УникальныйИдентификатор,
		Параметры.ТребуетсяПроверкаПредыдущихЭП,
		Параметры.ТребуетсяПроверкаПодписанныхДанных,
		Параметры.ТребуетсяПроверкаНаличияКлючаПЭПВРеестре,
		ЗадачиСОтказомВыполнения);
	
	Для Каждого ДанныеДокумента Из Параметры.ДанныеДокументов Цикл
		
		Если ДанныеДокумента.Свойство("ПараметрыОповещения") Тогда
			Оповестить(ДанныеДокумента.ПараметрыОповещения.ИмяСобытия,
				ДанныеДокумента.ПараметрыОповещения.Параметры,
				ДанныеДокумента.ПараметрыОповещения.Источник);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗадачиСОтказомВыполнения.Количество() > 0
		И Параметры.Свойство("ДокументЗаписан")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры.Форма, "ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя")
		И Параметры.Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя Тогда
		
		Комментарий = Параметры.Комментарий;
		Параметры.Форма.ПроцессыОбработкиДокументов_ИзмененКомментарийИсполнителя = Ложь;
		
	КонецЕсли;
	
	ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ЗадачиСОтказомВыполнения, Параметры.ВывестиСообщениеОбОшибке, Комментарий);
	
КонецПроцедуры

Процедура ПодписатьДанныеДокументов(ПараметрыДляПодписи)
	
	Если ПараметрыДляПодписи.ДанныеДляПодписи = Неопределено Тогда
		ПараметрыДляПодписи.ДанныеДляПодписи = ПроцессыОбработкиДокументовВызовСервера.ДанныеДляПодписиМассивДокументов(
			ПараметрыДляПодписи.ДанныеДокументов, ПараметрыДляПодписи.УникальныйИдентификатор, ПараметрыДляПодписи.ТребуетсяЭП);
	КонецЕсли;
	
	ПродолжитьПодписаниеДанныхДокументов(ПараметрыДляПодписи);
	
КонецПроцедуры

Процедура ПослеФормированияПервичныхДокументовНаКлиенте(Результат, ПараметрыДляПодписи) Экспорт
	
	Если Результат = Неопределено Тогда
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ПараметрыДляПодписи.ИдентификаторПачки);
		Возврат;
	КонецЕсли;
	
	// Проверка совпадения файлов первичных документов с ранее подписанными
	ПроцессыОбработкиДокументовВызовСервера.ПроверитьСовпадениеФайловПервичныхДокументовСРанееПодписанными(
		Результат.ПервичныеДокументы, ПараметрыДляПодписи.УникальныйИдентификатор);
	
	Для Каждого ПервичныйДокумент Из Результат.ПервичныеДокументы Цикл
		Для Индекс = 0 По ПараметрыДляПодписи.ДанныеДляПодписи.НаборДанных.ВГраница() Цикл
			Данные = ПараметрыДляПодписи.ДанныеДляПодписи.НаборДанных[Индекс];
			Если ПервичныйДокумент.Предмет = Данные.Владелец
				И ПервичныйДокумент.ИдентификаторПечатнойФормы = Данные.ИдентификаторПечатнойФормы Тогда
				
				Данные.Вставить("Данные", ПервичныйДокумент.Данные);
				Данные.Вставить("ИмяФайла", ПервичныйДокумент.ИмяФайла);
				Данные.Вставить("Ссылка", ПервичныйДокумент.Файл);
				Данные.Вставить("ФорматПервичногоДокумента", "mxl");
				Данные.Вставить("Представление", Данные.ВидДокумента);
				
				ДанныеPDF = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Данные);
				ДанныеPDF.Данные = ПервичныйДокумент.ДанныеPDF;
				ДанныеPDF.ИмяФайла = Лев(ПервичныйДокумент.ИмяФайла, СтрДлина(ПервичныйДокумент.ИмяФайла) - 3) + "pdf";
				ДанныеPDF.Ссылка = ПервичныйДокумент.ФайлPDF;
				ДанныеPDF.ФорматПервичногоДокумента = "pdf";
				ДанныеPDF.Представление = Данные.ВидДокумента;
				
				ПараметрыДляПодписи.ДанныеДляПодписи.НаборДанных.Вставить(Индекс + 1, ДанныеPDF);
				
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПродолжитьПодписаниеДанныхДокументов(ПараметрыДляПодписи);
	
КонецПроцедуры

Процедура ПродолжитьПодписаниеДанныхДокументов(ПараметрыДляПодписи)

	ОдинДокумент = ПараметрыДляПодписи.ДанныеДокументов.Количество() = 1;
	
	Для Каждого Данные Из ПараметрыДляПодписи.ДанныеДляПодписи.НаборДанных Цикл
		
		Если Данные.Свойство("Формуляр") И ЗначениеЗаполнено(Данные.Формуляр) Тогда
			Если ТипЗнч(Данные.Формуляр) = Тип("ДокументСсылка.ФормулярПервичногоДокументаПОД") Тогда
				Представление = Данные.ВидДокумента;
				
				ПараметрыОбработчика = Новый Структура;
				ПараметрыОбработчика.Вставить("Текст", "");
				ПараметрыОбработчика.Вставить("Формуляр", Данные.Формуляр);
				ПараметрыОбработчика.Вставить("Заголовок", Представление);
				ПараметрыОбработчика.Вставить("ФорматПервичногоДокумента", Данные.ФорматПервичногоДокумента);
				
				ОбработчикОткрытияФайла = Новый ОписаниеОповещения("ПоказатьДокументФормуляра", ЭтотОбъект, ПараметрыОбработчика);
				
				Данные.Вставить("Представление", Новый Структура("Значение, Представление", ОбработчикОткрытияФайла, Представление));
					
			КонецЕсли;
		ИначеЕсли Данные.Свойство("Владелец") И Данные.Владелец = Неопределено Тогда
			
			Если ОдинДокумент Тогда
				Представление = НСтр("ru = 'Данные документа (XML)'");
			Иначе
				Представление = Строка(Данные.Ссылка) + НСтр("ru = ' (Данные документа)'");
			КонецЕсли;
			
			ПараметрыОбработчика = Новый Структура;
			ПараметрыОбработчика.Вставить("Текст", Данные.Представление);
			ПараметрыОбработчика.Вставить("Заголовок", Представление);
			
			ОбработчикОткрытияФайла = Новый ОписаниеОповещения("ПоказатьТекстовыйДокумент", ЭтотОбъект, ПараметрыОбработчика);
			
			Данные.Вставить("Представление", Новый Структура("Значение, Представление", ОбработчикОткрытияФайла, Представление));
			
			ПроцессыОбработкиДокументовКлиентПереопределяемый.ПриПодготовкеДанныхДляПодписиДокумента(
				Данные.Ссылка, Данные.Шаблон, Данные.ИдентификаторЭтапа, Данные);
		ИначеЕсли Данные.Свойство("Владелец") И ЗначениеЗаполнено(Данные.Ссылка) И ТипЗнч(Данные.Данные) = Тип("Строка") Тогда
			Представление = Данные.Представление;
			
			ПараметрыОбработчика = Новый Структура;
			ПараметрыОбработчика.Вставить("Заголовок", Представление);
			ПараметрыОбработчика.Вставить("Ссылка", Данные.Ссылка);
			
			ОбработчикОткрытияФайла = Новый ОписаниеОповещения("ПоказатьДокументИзПрисоединенногоФайла", ЭтотОбъект, ПараметрыОбработчика);
			Данные.Вставить("Представление", Новый Структура("Значение, Представление", ОбработчикОткрытияФайла, Представление));
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОдинДокумент Тогда
		Операция = "Подпись документа";
		ЗаголовокДанных = "Документ";
	Иначе
		Операция = "Подпись документов";
		ЗаголовокДанных = "Документы";
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных", ЗаголовокДанных);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	ОписаниеДанных.Вставить("НаборДанных", ПараметрыДляПодписи.ДанныеДляПодписи.НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора", ПараметрыДляПодписи.ДанныеДляПодписи.ПредставлениеНабора);
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Форма", ПараметрыДляПодписи.Форма);
	ПараметрыКоманды.Вставить("ИдентификаторПачки", ПараметрыДляПодписи.ИдентификаторПачки);
	ПараметрыКоманды.Вставить("Статус", ПараметрыДляПодписи.Статус);
	ПараметрыКоманды.Вставить("Комментарий", ПараметрыДляПодписи.Комментарий);
	ПараметрыКоманды.Вставить("ДополнительныйКонтекст", ПараметрыДляПодписи.ДополнительныйКонтекст);
	ПараметрыКоманды.Вставить("ДанныеДокументов", ПараметрыДляПодписи.ДанныеДокументов);
	ПараметрыКоманды.Вставить("ВывестиСообщениеОбОшибке", ПараметрыДляПодписи.ВывестиСообщениеОбОшибке);
	
	Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеЭлектроннойПодписи", ЭтотОбъект, ПараметрыКоманды);
	
	Если ПараметрыДляПодписи.ТребуетсяЭП Тогда
		ОписаниеДанных.Вставить("ОтборСертификатов", ПараметрыДляПодписи.ДанныеДляПодписи.МассивДоступныхСертификатов);
		Подписать(ОписаниеДанных, , Обработчик);
	ИначеЕсли ПараметрыДляПодписи.ТребуетсяПростаяЭП Тогда
		ОписаниеДанных.Вставить("СведенияДляПростойПодписи", ПараметрыДляПодписи.ДанныеДляПодписи.СведенияДляПростойПодписи);
		
		Отказ = Ложь;
		ПроверитьСведенияОДолжностиПодписантаПЭППОД(ОписаниеДанных, ПараметрыДляПодписи.ИдентификаторПачки, Отказ);
		Если Отказ Тогда
			Возврат;	
		КонецЕсли; 
		
		ПодписатьПростойПодписью(ОписаниеДанных, Обработчик); 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыполненияЗадачи(Контекст, ДополнительныеПараметры) Экспорт
	
	Если Контекст.Свойство("ЗадачиСОшибками") Тогда
		ПоказатьОповещениеОНеуспешномВыполненииЗадач(Контекст.ЗадачиСОшибками, Контекст.ДанныеДокументов.Количество() = 1);
	КонецЕсли;
	
	Если Контекст.Свойство("ПараметрыОповещения") Тогда
		Оповестить(Контекст.ПараметрыОповещения.ИмяСобытия,
					Контекст.ПараметрыОповещения.Параметры,
					Контекст.ПараметрыОповещения.Источник);
	КонецЕсли;
	
	ОповеститьДинамическиеСпискиДокументов(Контекст.ДанныеДокументов);
	
	Оповестить("Запись_ЗадачаПоОбработкеДокумента");
	
КонецПроцедуры

Процедура ПоказатьОповещениеОНеуспешномВыполненииЗадач(ЗадачиСОшибками, СообщитьПользователю = Ложь)
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось выполнить задач: %1'"),
					ЗадачиСОшибками.Количество());
	Пояснение = НСтр("ru = 'Нажмите для получения информации об ошибках'");
	ОповещениеПриНажатии = Новый ОписаниеОповещения("ПоказатьИнформациюОбОшибках", ЭтотОбъект, ЗадачиСОшибками);
	ПоказатьОповещениеПользователя(ТекстСообщения,
									ОповещениеПриНажатии,
									Пояснение,
									БиблиотекаКартинок.Предупреждение32,
									СтатусОповещенияПользователя.Важное);
									
	Если СообщитьПользователю Тогда
		Для Каждого ЗадачаСОшибками Из ЗадачиСОшибками Цикл
			Если ЗадачаСОшибками.Свойство("СообщениеДляВывода") Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(ЗадачаСОшибками.СообщениеДляВывода);
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(ЗадачаСОшибками.ОписаниеОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьДинамическиеСпискиДокументов(ДанныеДокументов)
	
	ОповещенныеТипы = Новый Соответствие;
	Для Каждого ДанныеДокумента Из ДанныеДокументов Цикл
		ТипДокумента = ТипЗнч(ДанныеДокумента.Документ);
		Если ОповещенныеТипы.Получить(ТипДокумента) = Неопределено Тогда
			ОповеститьОбИзменении(ТипДокумента);
			ОповещенныеТипы.Вставить(ТипДокумента, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЭлектронныеПодписиНаКлиенте(Параметры)
	
	ЗадачиСОтказомВыполнения = Новый Массив;
	
	// Для проверки используются данные подписей, полученные на сервере.
	МассивПодписейДляПроверки = Новый Массив;
	Для Каждого ДанныеДокумента Из Параметры.ДанныеДокументов Цикл
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеДокумента, "ЭлектронныеПодписи") Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПодписейДляПроверки, ДанныеДокумента.ЭлектронныеПодписи);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивПодписейДляПроверки.Количество() = 0 Тогда
		ПослеПроверкиЭлектронныхПодписейНаКлиенте(Параметры);
	Иначе
		ПараметрыОповещения = Новый Структура("МассивПодписейДляПроверки, ПроверяемыйИндекс, Параметры, ЗадачиСОтказомВыполнения",
												МассивПодписейДляПроверки, 0, Параметры, ЗадачиСОтказомВыполнения);
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиОчереднойПодписиНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
		ПроверитьПодпись(Оповещение, МассивПодписейДляПроверки[0].АдресДанных, МассивПодписейДляПроверки[0].АдресПодписи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеПроверкиОчереднойПодписиНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	МассивПодписейДляПроверки = ДополнительныеПараметры.МассивПодписейДляПроверки;
	ПроверяемыйИндекс = ДополнительныеПараметры.ПроверяемыйИндекс;
	
	Если ТипЗнч(Результат) = Тип("Булево") ИЛИ Результат = Неопределено Тогда
		// результат проверки положительный
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		ОписаниеОшибки = НСтр("ru = 'Электронная подпись для документа %1 неверна.
			|Причина: %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, МассивПодписейДляПроверки[ПроверяемыйИндекс].Документ, Результат);
	Иначе
		ОписаниеОшибки = НСтр("ru = 'Не удалось проверить подписи электронного документа.
			|Проверьте настройки криптографии или обратитесь к администратору.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		ЗадачаСОтказомВыполнения = Новый Структура;
		ЗадачаСОтказомВыполнения.Вставить("Задача", МассивПодписейДляПроверки[ПроверяемыйИндекс].Задача);
		ЗадачаСОтказомВыполнения.Вставить("ДатаПопытки", ОбщегоНазначенияКлиент.ДатаСеанса());
		ЗадачаСОтказомВыполнения.Вставить("ОписаниеОшибки", ОписаниеОшибки);
		ДополнительныеПараметры.ЗадачиСОтказомВыполнения.Добавить(ЗадачаСОтказомВыполнения);
		
		КоличествоЭлементовКоллекции = ДополнительныеПараметры.Параметры.ДанныеДокументов.Количество();
		Для ОбратныйИндекс = 1 По КоличествоЭлементовКоллекции Цикл
			Индекс = КоличествоЭлементовКоллекции - ОбратныйИндекс;
			ДанныеДокумента = ДополнительныеПараметры.Параметры.ДанныеДокументов[Индекс];
			Если МассивПодписейДляПроверки[ПроверяемыйИндекс].Документ = ДанныеДокумента.Документ Тогда
				ДополнительныеПараметры.Параметры.ДанныеДокументов.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПроверяемыйИндекс < МассивПодписейДляПроверки.ВГраница() Тогда
		ПараметрыОповещения = Новый Структура("МассивПодписейДляПроверки, ПроверяемыйИндекс, Параметры, ЗадачиСОтказомВыполнения",
			МассивПодписейДляПроверки, ПроверяемыйИндекс + 1, ДополнительныеПараметры.Параметры, ДополнительныеПараметры.ЗадачиСОтказомВыполнения);
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиОчереднойПодписиНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
		ПроверитьПодпись(Оповещение, МассивПодписейДляПроверки[ПроверяемыйИндекс + 1].АдресДанных, МассивПодписейДляПроверки[ПроверяемыйИндекс + 1].АдресПодписи);
	Иначе
		// все подписи проверены
		ОтметитьНеУспешнуюПопыткуВыполненияЗадач(ДополнительныеПараметры.ЗадачиСОтказомВыполнения, ДополнительныеПараметры.Параметры.ВывестиСообщениеОбОшибке);
		
		Если ДополнительныеПараметры.Параметры.ДанныеДокументов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ПослеПроверкиЭлектронныхПодписейНаКлиенте(ДополнительныеПараметры.Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеПроверкиЭлектронныхПодписейНаКлиенте(ДополнительныеПараметры)
	
	Если ДополнительныеПараметры.ТребуетсяЭП ИЛИ ДополнительныеПараметры.ТребуетсяПростаяЭП Тогда
		ПодписатьДанныеДокументов(ДополнительныеПараметры);
	Иначе
		ПродолжитьВыполнениеЗадачи(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьСхемуВФайлПослеПодключенияРасширенияРаботыСФайлами(Подключено, ГрафическаяСхема) Экспорт
	
	Если Не Подключено Тогда
		
		АдресГрафическойСхемы = ПроцессыОбработкиДокументовВызовСервера.АдресДанныхГрафическойСхемы(ГрафическаяСхема);
		
		ПолучитьФайл(АдресГрафическойСхемы, "untitled.grs");
		
	Иначе
		
		ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогСохраненияФайла.Фильтр = НСтр("ru = 'Графическая схема'") + " (*.grs)|*.grs";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииДиалогаВыбораФайла", ЭтотОбъект, ГрафическаяСхема);
		ДиалогСохраненияФайла.Показать(ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗавершенииДиалогаВыбораФайла(ВыбранныеФайлы, ГрафическаяСхема) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
	ЗаписатьГрафическуюСхемуИмяФайлаВыбрано(ПутьКФайлу, ГрафическаяСхема);
	
КонецПроцедуры

Процедура ЗаписатьГрафическуюСхемуИмяФайлаВыбрано(ПутьКФайлу, Знач ГрафическаяСхема)
	Если Не ПустаяСтрока(ПутьКФайлу) Тогда
		ГрафическаяСхема.НачатьЗапись(,ПутьКФайлу);
	КонецЕсли;
КонецПроцедуры

Процедура ПереключитьсяНаКомментарийНаправившего(Форма)
	Если НЕ Форма.Элементы.ГруппаКомментарииСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраницаКомментарийНаправившего Тогда
		Форма.Элементы.ГруппаКомментарииСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраницаКомментарийНаправившего;
	КонецЕсли;
КонецПроцедуры

Процедура ПереключитьсяНаКомментарийСледующему(Форма)
	Если НЕ Форма.Элементы.ГруппаКомментарииСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраницаКомментарийСледующему Тогда
		Форма.Элементы.ГруппаКомментарииСтраницы.ТекущаяСтраница = Форма.Элементы.ГруппаСтраницаКомментарийСледующему;
	КонецЕсли;
КонецПроцедуры

Процедура ПродолжитьИзменениеШаблонаПослеПодтвержденияЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Попытка
		ДополнительныеПараметры.Форма.Записать(Новый Структура);
	Исключение
		ПоказатьОповещениеПользователя(,,КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),БиблиотекаКартинок.Информация32);
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	КонецПопытки;
	
	Оповещение = Новый ОписаниеОповещения("Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение", ДополнительныеПараметры.Форма);
	ВыполнитьОбработкуОповещения(Оповещение, "ИзменитьШаблонПроцесса");
	
КонецПроцедуры

Процедура ВыполнитьПроверкуДанныхВМногопоточномРежиме(ПараметрыКоманды)
	Форма = ПараметрыКоманды.Форма;
	
	Задание = ПроцессыОбработкиДокументовВызовСервера.МногопоточнаПроверкаПодписанныхДанныхНаСервере(
	Форма.УникальныйИдентификатор, ПараметрыКоманды.ДанныеДокументов);
	
	ИдентификаторЗадания = Задание.ИдентификаторЗадания;
	
	НастройкиОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	НастройкиОжидания.ВыводитьОкноОжидания = Истина;
    НастройкиОжидания.Заголовок = НСтр("ru='Идёт процесс проверки подписанных данных'"); 
	
	Обработчик = Новый ОписаниеОповещения("ОбработатьРезультатМногопоточнойПроверкиДанных", 
										  ПроцессыОбработкиДокументовКлиент, ПараметрыКоманды);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Задание, Обработчик, НастройкиОжидания);	
	
КонецПроцедуры	   

Процедура ОбработатьРезультатМногопоточнойПроверкиДанных(Задание, ДополнительныеПараметры) Экспорт
	ПараметрыКоманды = ДополнительныеПараметры;
    ЕстьОтрицательныеРезультатыПроверки = Ложь;
	ТекстОшибки = "";
	
	Если Задание <> Неопределено И Задание.Статус = "Выполнено" Тогда
		
		РезультатВыполнения = ПолучитьИЗВременногоХранилища(Задание.АдресРезультата); 
		//нужно проверить все потоки на ошибки
		Для Каждого ПотокЗадание Из РезультатВыполнения Цикл
			
			РезультатТекущегоПотокаяПотока = РезультатВыполнения.Получить(ПотокЗадание.Ключ);	
			Если РезультатТекущегоПотокаяПотока.Статус = "Ошибка" Тогда
				ЕстьОтрицательныеРезультатыПроверки = Истина; 
				ТекстОшибки = РезультатТекущегоПотокаяПотока.КраткоеПредставлениеОшибки; 
				
			ИначеЕсли  РезультатТекущегоПотокаяПотока.Статус = "Выполнено" Тогда
				РезультатВыполненияПотока = ПолучитьИЗВременногоХранилища(РезультатТекущегоПотокаяПотока.АдресРезультата);
				
				Если ЗначениеЗаполнено(РезультатВыполненияПотока) Тогда
					
					ЕстьОтрицательныеРезультатыПроверки = Истина;
					ТекстОшибки = ТекстОшибки + РезультатВыполненияПотока; 
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		
		ЕстьОтрицательныеРезультатыПроверки = Истина; 
		ТекстОшибки = НСтр("ru='Произошла ошибка фонового задания при проверке подписанных данных большего объема. " +
							   "Повторите попытку позже или обратитесь к Администратору'");		
	КонецЕсли;	
	
	Если ЕстьОтрицательныеРезультатыПроверки Тогда
		
		Отказ = Истина;
		ОписаниеОшибки = ТекстОшибки;
		ПараметрыКоманды.Вставить("ОписаниеОшибки", "");
		ПараметрыКоманды.Вставить("ОшибкаФоновогоЗадания", Истина);
		СтандартнаяОбработка = Истина;
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
		Если НЕ СтандартнаяОбработка Тогда
			Возврат;
		КонецЕсли;

		ПродолжитьВыполнениеЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки); 

	Иначе		
		// если проверка прошла успешно, то не будем проверять подписанные данные при вызове сервера
		ПараметрыКоманды.ТребуетсяПроверкаПодписанныхДанных = Ложь;
		
		ВыполнитьПроцедурыСВызовомСервера(ПараметрыКоманды);
		
		Если ПараметрыКоманды.ДанныеДокументов.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;

		Отказ = Ложь;
		ОписаниеОшибки = "";
		СтандартнаяОбработка = Истина;
		ПроцессыОбработкиДокументовКлиентПереопределяемый.ПередВыполнениемЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки, СтандартнаяОбработка);
		Если НЕ СтандартнаяОбработка Тогда
			Возврат;
		КонецЕсли;

		ПродолжитьВыполнениеЗадач(ПараметрыКоманды, Отказ, ОписаниеОшибки);  
	
    КонецЕсли;
	
КонецПроцедуры  

// Получает из текстового описания интервал времени в минутах.
//
// Параметры:
//  СтрокаСоВременем - Строка - текстовое описание времени, где числа записаны цифрами,
//								а единицы измерения - строкой. 
//
// Возвращаемое значение:
//  Число - интервал времени в минутах.
// 
Функция ПолучитьИнтервалВремениИзСтроки(Знач СтрокаСоВременем) Экспорт
	
	Если ПустаяСтрока(СтрокаСоВременем) Тогда
		Возврат 0;
	КонецЕсли;
	
	СтрокаСоВременем = НРег(СтрокаСоВременем);
	СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, Символы.НПП," ");
	СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, ".",",");
	СтрокаСоВременем = СтрЗаменить(СтрокаСоВременем, "+","");
	
	ПодстрокаСЦифрами = "";
	ПодстрокаСБуквами = "";
	
	ПредыдущийСимволЭтоЦифра = Ложь;
	ЕстьДробнаяЧасть = Ложь;
	
	Результат = 0;
	Для Позиция = 1 По СтрДлина(СтрокаСоВременем) Цикл
		ТекущийКодСимвола = КодСимвола(СтрокаСоВременем,Позиция);
		Символ = Сред(СтрокаСоВременем,Позиция,1);
		Если (ТекущийКодСимвола >= КодСимвола("0") И ТекущийКодСимвола <= КодСимвола("9"))
			ИЛИ (Символ="," И ПредыдущийСимволЭтоЦифра И Не ЕстьДробнаяЧасть) Тогда
			Если Не ПустаяСтрока(ПодстрокаСБуквами) Тогда
				ПодстрокаСЦифрами = СтрЗаменить(ПодстрокаСЦифрами,",",".");
				Результат = Результат + ?(ПустаяСтрока(ПодстрокаСЦифрами), 1, Число(ПодстрокаСЦифрами))
					* ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами);
					
				ПодстрокаСЦифрами = "";
				ПодстрокаСБуквами = "";
				
				ПредыдущийСимволЭтоЦифра = Ложь;
				ЕстьДробнаяЧасть = Ложь;
			КонецЕсли;
			
			ПодстрокаСЦифрами = ПодстрокаСЦифрами + Сред(СтрокаСоВременем,Позиция,1);
			
			ПредыдущийСимволЭтоЦифра = Истина;
			Если Символ = "," Тогда
				ЕстьДробнаяЧасть = Истина;
			КонецЕсли;
		Иначе
			Если Символ = " " И ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами) = "0" Тогда
				ПодстрокаСБуквами = "";
			КонецЕсли;
			
			ПодстрокаСБуквами = ПодстрокаСБуквами + Сред(СтрокаСоВременем,Позиция,1);
			ПредыдущийСимволЭтоЦифра = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(ПодстрокаСБуквами) Тогда
		ПодстрокаСЦифрами = СтрЗаменить(ПодстрокаСЦифрами,",",".");
		Результат = Результат + ?(ПустаяСтрока(ПодстрокаСЦифрами), 1, Число(ПодстрокаСЦифрами))
			* ЗаменитьЕдиницуИзмеренияНаМножитель(ПодстрокаСБуквами);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Анализирует слово на предмет соответствия единице времени и, если соответствие установлено,
// возвращает количество минут, содержащееся в единице времени.
//
// Параметры:
//  Единица - Строка - анализируемое слово.
//
// Возвращаемое значение:
//  Число - количество минут в Единице. Если единица не определена или пустая, то возвращается 0.
//
Функция ЗаменитьЕдиницуИзмеренияНаМножитель(Знач Единица)
	
	Результат = 0;
	Единица = НРег(Единица);
	
	ДопустимыеСимволы = НСтр("ru = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'"); // АПК:163; АПК:1036 (см. 456:1.1) символы, которые может вводить пользователь.
	ПосторонниеСимволы = СтрСоединить(СтрРазделить(Единица, ДопустимыеСимволы, Ложь), "");
	Если ПосторонниеСимволы <> "" Тогда
		Единица = СтрСоединить(СтрРазделить(Единица, ПосторонниеСимволы, Ложь), "");
	КонецЕсли;
	
	СловоформыЧаса = СтрРазделить(НСтр("ru = 'час,ч'"), ",", Ложь);
	СловоформыМинуты = СтрРазделить(НСтр("ru = 'мин,м'"), ",", Ложь);
	
	ПервыеТриСимвола = Лев(Единица,3);
	Если СловоформыЧаса.Найти(ПервыеТриСимвола) <> Неопределено Тогда
		Результат = 60;
	ИначеЕсли СловоформыМинуты.Найти(ПервыеТриСимвола) <> Неопределено Тогда
		Результат = 1;
	КонецЕсли;
	
	Возврат Формат(Результат,"ЧН=0; ЧГ=0");
	
КонецФункции

#Область ЭлектроннаяПодпись

// См. ЭлектроннаяПодписьКлиент.Подписать
Процедура Подписать(ОписаниеДанных, Форма = Неопределено, ОбработкаРезультата = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.Подписать(ОписаниеДанных, Форма, ОбработкаРезультата, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		
		ПараметрыПодписания = МодульЭлектроннаяПодписьКлиент.НовыйТипПодписи();
		ПараметрыПодписания.ВыборДоверенности = Истина;
		
		МодульЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , ОбработкаРезультата, ПараметрыПодписания);
	КонецЕсли;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьКлиент.ПроверитьПодпись
Процедура ПроверитьПодпись(Оповещение, ИсходныеДанные, Подпись, МенеджерКриптографии = Неопределено, НаДату = Неопределено) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ПроверитьПодпись(
		Оповещение, ИсходныеДанные, Подпись, МенеджерКриптографии, НаДату, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		МодульЭлектроннаяПодписьКлиент.ПроверитьПодпись(Оповещение, ИсходныеДанные, Подпись, МенеджерКриптографии, НаДату, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьКлиент.ОткрытьПодпись
Процедура ОткрытьПодпись(ТекущиеДанные) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ОткрытьПодпись(ТекущиеДанные, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		МодульЭлектроннаяПодписьКлиент.ОткрытьПодпись(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

// См. ЭлектроннаяПодписьКлиент.СохранитьПодпись
Процедура СохранитьПодпись(АдресПодписи) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.СохранитьПодпись(АдресПодписи, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		МодульЭлектроннаяПодписьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ЭлектроннаяПодписьКлиент");
		МодульЭлектроннаяПодписьКлиент.СохранитьПодпись(АдресПодписи);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПростуюПодпись(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваПодписи = Новый Структура(
		"ВладелецПодписи, Организация, Должность, ДатаПодписи, УстановившийПодпись");
	
	ЗаполнитьЗначенияСвойств(СвойстваПодписи, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура("СвойстваПодписи", СвойстваПодписи);
	ОткрытьФорму("ОбщаяФорма.ПростаяЭлектроннаяПодпись", ПараметрыФормы);
	
КонецПроцедуры

Процедура ПодписатьПростойПодписью(ОписаниеДанных, ОбработкаРезультата = Неопределено) Экспорт
	
	КлиентскиеПараметры = Новый Структура;
	КлиентскиеПараметры.Вставить("ОписаниеДанных", ОписаниеДанных);
	КлиентскиеПараметры.Вставить("ОбработкаРезультата", ОбработкаРезультата);
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("СтандартноеЗавершение", ЭтотОбъект, КлиентскиеПараметры);
	
	СерверныеПараметры = Новый Структура;
	СерверныеПараметры.Вставить("Операция", НСтр("ru = 'Подписание данных'"));
	СерверныеПараметры.Вставить("ЗаголовокДанных", НСтр("ru = 'Данные'"));
	ЗаполнитьЗначенияСвойств(СерверныеПараметры, ОписаниеДанных);
	
	НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры);
	
	Контекст = Новый Структура;
	
	Форма = ОткрытьФорму("ОбщаяФорма.ПодписаниеДанныхПростойПодписью", СерверныеПараметры, , , , ,
		Новый ОписаниеОповещения("ОткрытьНовуюФормуОповещениеОЗакрытии", ЭтотОбъект, Контекст));
	
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ОбработкаЗавершения", ОбработкаЗавершения);
	Контекст.Вставить("КлиентскиеПараметры", КлиентскиеПараметры);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьНовуюФормуПродолжение", ЭтотОбъект, Контекст);
	
	Если КлиентскиеПараметры = Неопределено Тогда
		Форма.ПродолжитьОткрытие(Оповещение);
	Иначе
		Форма.ПродолжитьОткрытие(Оповещение, КлиентскиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры ОткрытьНовуюФорму.
Процедура ОткрытьНовуюФормуПродолжение(Результат, Контекст) Экспорт
	
	Если Контекст.Форма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст.ОбработкаЗавершения) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработкаЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры ОткрытьНовуюФорму.
Процедура ОткрытьНовуюФормуОповещениеОЗакрытии(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Контекст.ОбработкаЗавершения) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработкаЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
Процедура СтандартноеЗавершение(Успех, КлиентскиеПараметры) Экспорт
	
	КлиентскиеПараметры.ОписаниеДанных.Вставить("Успех", Успех = Истина);
	КлиентскиеПараметры.ОписаниеДанных.Вставить("Отказ", Успех = Неопределено);
	
	Если КлиентскиеПараметры.ОбработкаРезультата <> Неопределено Тогда
		
		ОбработкаРезультата = КлиентскиеПараметры.ОбработкаРезультата;
		КлиентскиеПараметры.ОбработкаРезультата = Неопределено;
		ВыполнитьОбработкуОповещения(ОбработкаРезультата, КлиентскиеПараметры.ОписаниеДанных);
		
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.
Процедура НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры)
	
	ОписаниеДанных = КлиентскиеПараметры.ОписаниеДанных;
	
	Если ОписаниеДанных.Свойство("СписокПредставлений") Тогда
		СписокПредставлений = ОписаниеДанных.СписокПредставлений;
	Иначе
		СписокПредставлений = Новый Массив;
		
		Если ОписаниеДанных.Свойство("Данные")
		 Или ОписаниеДанных.Свойство("Объект") Тогда
			
			ЗаполнитьСписокПредставлений(СписокПредставлений, ОписаниеДанных);
		Иначе
			Для каждого ЭлементДанных Из ОписаниеДанных.НаборДанных Цикл
				ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийСписокПредставлений = Новый СписокЗначений;
	
	Для каждого ЭлементСписка Из СписокПредставлений Цикл
		Если ТипЗнч(ЭлементСписка) = Тип("Строка") Тогда
			Представление = ЭлементСписка.Представление;
			Значение = Неопределено;
		ИначеЕсли ТипЗнч(ЭлементСписка) = Тип("Структура") Тогда
			Представление = ЭлементСписка.Представление;
			Значение = ЭлементСписка.Значение;
		Иначе // Ссылка
			Представление = "";
			Значение = ЭлементСписка.Значение;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементСписка.Представление) Тогда
			Представление = ЭлементСписка.Представление;
		Иначе
			Представление = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		ТекущийСписокПредставлений.Добавить(Значение, Представление);
	КонецЦикла;
	
	Если ТекущийСписокПредставлений.Количество() > 1 Тогда
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается", Истина);
		СерверныеПараметры.Вставить("ПредставлениеДанных", СтрЗаменить(
			ОписаниеДанных.ПредставлениеНабора, "%1", ОписаниеДанных.НаборДанных.Количество()));
	Иначе
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается",
			ТипЗнч(ТекущийСписокПредставлений[0].Значение) = Тип("ОписаниеОповещения")
			Или ЗначениеЗаполнено(ТекущийСписокПредставлений[0].Значение));
		
		СерверныеПараметры.Вставить("ПредставлениеДанных",
			ТекущийСписокПредставлений[0].Представление);
	КонецЕсли;
	
	КлиентскиеПараметры.Вставить("ТекущийСписокПредставлений", ТекущийСписокПредставлений);
	
КонецПроцедуры

// Только для внутреннего использования.
Процедура ПроверитьСведенияОДолжностиПодписантаПЭППОД(Знач ОписаниеДанных, Знач ИдентификаторПачки, Отказ)
	      
	ОписаниеОшибки = "";  
	
	Если НЕ ПроцессыОбработкиДокументовВызовСервера.ПолучитьКонстантуПроверятьСведенияОДолжностиПодписантаПЭППОД() Тогда
		Возврат;
	КонецЕсли;
	
	НаборДанных = ОписаниеДанных.НаборДанных;
	СведенияПодписи = ОписаниеДанных.СведенияДляПростойПодписи;
	
	МассивДолжностей = СведенияПодписи.ОрганизацииИДолжности[НаборДанных[0].Ссылка]; 			
	Если НЕ ЗначениеЗаполнено(СведенияПодписи.ПолноеИмя) Тогда
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Электронный документ не может быть подписан: для пользователя подписанта ""%1"" не определено физическое лицо.
		|Необходимо указать физическое лицо в справочнике ""Пользователи"" и повторить операцию.'"), ПользователиКлиентСервер.ТекущийПользователь());
		
		Отказ = Истина;
		
	ИначеЕсли МассивДолжностей.Количество() = 0 Тогда
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Электронный документ не может быть подписан: для сотрудника подписанта ""%1"" не определена должность.
		|Необходимо указать должность в справочнике ""Сотрудники"" и повторить операцию.'"), СведенияПодписи.ПолноеИмя);
		
		Отказ = Истина;   
		
	КонецЕсли;
	
	Если Отказ Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки); 
		ПроцессыОбработкиДокументовВызовСервера.ОтметитьЗадачиВПачкеКакНевыполняемые(ИдентификаторПачки);
		
	КонецЕсли;	
		
КонецПроцедуры

// Для процедуры НастроитьПредставлениеДанных.
Процедура ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных)
	
	ЭлементСписка = Новый Структура("Значение, Представление", Неопределено, "");
	СписокПредставлений.Добавить(ЭлементСписка);
	
	Если ЭлементДанных.Свойство("Представление")
	   И ТипЗнч(ЭлементДанных.Представление) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭлементСписка, ЭлементДанных.Представление);
		Возврат;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление")
	   И ТипЗнч(ЭлементДанных.Представление) <> Тип("Строка") Тогда
	
		ЭлементСписка.Значение = ЭлементДанных.Представление;
		
	ИначеЕсли ЭлементДанных.Свойство("Объект")
	        И ТипЗнч(ЭлементДанных.Объект) <> Тип("ОписаниеОповещения") Тогда
		
		ЭлементСписка.Значение = ЭлементДанных.Объект;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление") Тогда
		ЭлементСписка.Представление = ЭлементДанных.Представление;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
