#Область ОбработчикиСобытий

// Обработчик команды
//
// Параметры:
//   ПараметрКоманды - Произвольный
//   ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды:
//     * Источник - ФормаКлиентскогоПриложения:
//         ** Наименование - Строка
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МестоположениеФормы = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.МестоположениеФормы();
	МестоположениеФормы.БазоваяФункциональность = Истина;
	
	ПараметрыФормы = Новый Структура;
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		ПараметрыФормы.Вставить("ID", ПараметрыВыполненияКоманды.Источник.ID);
		ПараметрыФормы.Вставить("Наименование", ПараметрыВыполненияКоманды.Источник.Наименование);
		ПараметрыФормы.Вставить("ТекущаяВерсияID", ПараметрыВыполненияКоманды.Источник.ТекущаяВерсияID);
		ПараметрыФормы.Вставить("ВладелецФайла", ПараметрыВыполненияКоманды.Источник.ВладелецID);
	КонецЕсли;
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ОткрытьФормуБИД(
		МестоположениеФормы,
		"ВерсииФайла",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти