#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор <> Неопределено Тогда
		
		Если Параметры.Отбор.Свойство("ВидОперации")
			И (Параметры.Отбор.ВидОперации = Перечисления.ВидыОперацийРезервовПоОплатеТруда.Списание
				Или Параметры.Отбор.ВидОперации = Перечисления.ВидыОперацийРезервовПоОплатеТруда.Корректировка) Тогда
				
			СтандартнаяОбработка = Ложь;
			
			ДанныеВыбора = Новый СписокЗначений;
			Если Параметры.Отбор.ВидОперации = Перечисления.ВидыОперацийРезервовПоОплатеТруда.Списание Тогда
				ДанныеВыбора.Добавить(Списано);
				ДанныеВыбора.Добавить(Перенесено);
			ИначеЕсли Параметры.Отбор.ВидОперации = Перечисления.ВидыОперацийРезервовПоОплатеТруда.Корректировка Тогда
				ДанныеВыбора.Добавить(Начислено);
				ДанныеВыбора.Добавить(Перенесено);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
