#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СтатусВыгрузкиВАрхив =
		Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриВыгрузке Тогда
		Заголовок = НСтр("ru = 'Обнаружены ошибки при выгрузке в 1С:Архив'");
	ИначеЕсли Параметры.СтатусВыгрузкиВАрхив =
		Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриЗагрузкеВАрхив Тогда
		Заголовок = НСтр("ru = 'Обнаружены ошибки при загрузке в 1С:Архив'");
	ИначеЕсли Параметры.СтатусВыгрузкиВАрхив =
		Перечисления.СтатусыОбменаС1САрхивом.ОбнаруженыОшибкиПриПроверкеВАрхиве Тогда
		Заголовок = НСтр("ru = 'Обнаружены ошибки при проверке в 1С:Архиве'");
	КонецЕсли;
	
	РезультатПроверки = Параметры.РезультатПроверки;
	
КонецПроцедуры

#КонецОбласти