#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачала = Дата(1, 1, 1);
	ДатаОкончания = Дата(1, 1, 1);
	Для Каждого ДанныеОтпуска Из Отпуска Цикл 
		Если ЗначениеЗаполнено(ДанныеОтпуска.ДатаНачала) Тогда 
			ДатаНачала = ?(ЗначениеЗаполнено(ДатаНачала), Мин(ДатаНачала, ДанныеОтпуска.ДатаНачала), ДанныеОтпуска.ДатаНачала);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеОтпуска.ДатаОкончания) Тогда
			ДатаОкончания = ?(ЗначениеЗаполнено(ДатаОкончания), Макс(ДатаОкончания, ДанныеОтпуска.ДатаОкончания), ДанныеОтпуска.ДатаОкончания);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ТребуетсяПодписьУведомленияОНачалеОтпускаСоСтороныРаботодателя") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Или Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		СформироватьПечатнуюФормуУведомления();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьПечатнуюФормуУведомления()
	
	Если Не ЭтоНовый() И ЗначениеЗаполнено(ДокументКЭДОПечатнойФормы()) Тогда
		Возврат;			
	КонецЕсли;
	
	ПечатнаяФорма = Документы.УведомлениеОНачалеОтпуска.ПечатнаяФормаУведомлениеОНачалеОтпуска(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка),
		Новый СписокЗначений);
	ДанныеПечатнойФормы = ЭДОБЗКВызовСервера.ДобавитьПечатнуюФорму(
		ПечатнаяФорма,
		Ссылка,
		Документы.УведомлениеОНачалеОтпуска.ИдентификаторКомандыПечатиЗаявления(),
		НазваниеПечатнойФормыУведомление(),
		Организация,
		ФизическоеЛицо,
		,
		Истина);
	
КонецПроцедуры

Функция ДокументКЭДОПечатнойФормы()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументЭДОБЗК.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ДокументЭДОБЗК КАК ДокументЭДОБЗК
	               |ГДЕ
	               |	ДокументЭДОБЗК.ОснованиеДокумента = &ОснованиеДокумента
	               |	И ДокументЭДОБЗК.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ОснованиеДокумента", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

Функция НазваниеПечатнойФормыУведомление()
	
	ШаблонНазвания = НСтр("ru = '%1 Уведомление о начале отпуска %2 %3'");
	ФИО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФизическоеЛицо, "ФИО");
	ФамилияИнициалы = "";
	Попытка
		ФамилияИнициалы = ФизическиеЛицаЗарплатаКадрыКлиентСервер.ФамилияИнициалы(ФИО);
	Исключение
		ФамилияИнициалы = Строка(ФизическоеЛицо);
	КонецПопытки;
	
	Возврат СтрШаблон(ШаблонНазвания,
					  СокрЛП(ФамилияИнициалы),
					  СокрЛП(Формат(ДатаНачала, "ДЛФ=Д")),
					  СокрЛП(Формат(ДатаОкончания, "ДЛФ=Д")));
					  
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли