#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработкаПроверкиЗаполнения(ВидРасчетаОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	НепроверяемыеРеквизиты = Новый Массив;
	НепроверяемыеРеквизиты.Добавить("ВидОтпуска");
	НепроверяемыеРеквизиты.Добавить("СдвигБазовогоПериода");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ВидРасчетаОбъект, ОбъектКопирования) Экспорт
	ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее;
КонецПроцедуры

Процедура ПередЗаписью(ВидРасчетаОбъект, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ВидРасчетаОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка уникальности выбранного основного вида расчета в разрезе начислений по категории.
	Если Не ВидРасчетаОбъект.ПометкаУдаления
		И Не ВидРасчетаОбъект.ВАрхиве
		И ЗначениеЗаполнено(ВидРасчетаОбъект.ОсновнойВидРасчета)
		И (ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке
			Или ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени);
		Отбор.Вставить("ОсновнойВидРасчета", ВидРасчетаОбъект.ОсновнойВидРасчета);
		Отбор.Вставить("КатегорияДохода", ВидРасчетаОбъект.КатегорияДохода);
		Отбор.Вставить("ПометкаУдаления", Ложь);
		Отбор.Вставить("ВАрхиве", Ложь);
		Начисления = ПланыВидовРасчета.Начисления.НачисленияПоОтбору(Отбор);
		Если Начисления.Количество() > 0 И Начисления.Найти(ВидРасчетаОбъект.Ссылка) = Неопределено Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Начисление с назначением ""%1"" и основным видом расчета ""%2"" уже существует'"),
				ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени,
				ВидРасчетаОбъект.ОсновнойВидРасчета);
			СообщенияБЗК.СообщитьОбОшибкеВОбъекте(Отказ, ВидРасчетаОбъект, ТекстСообщения, "ОсновнойВидРасчета");
		КонецЕсли;
	КонецЕсли;	
	Если ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке
		Или ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке Тогда
		Если ЗначениеЗаполнено(ВидРасчетаОбъект.ОсновнойВидРасчета) Тогда
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидРасчетаОбъект.ОсновнойВидРасчета, "ВидОперацииПоЗарплате");
		ИначеЕсли Не ЗначениеЗаполнено(ВидРасчетаОбъект.ВидОперацииПоЗарплате) Тогда
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
		КонецЕсли;
	ИначеЕсли ВидРасчетаОбъект.ЯвляетсяДоходомВНатуральнойФорме И ВидРасчетаОбъект.ВидОперацииПоЗарплате <> Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход Тогда
		ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход;
	ИначеЕсли НЕ ВидРасчетаОбъект.ЯвляетсяДоходомВНатуральнойФорме И ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НатуральныйДоход Тогда
		Если ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя Тогда
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель;
		ИначеЕсли ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста
			Или ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодам Тогда
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС;
		ИначеЕсли ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание
			Или ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве Тогда
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС;
		Иначе
			ВидРасчетаОбъект.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
		КонецЕсли;
	КонецЕсли;
	
	ВидРасчетаОбъект.ЗачетОтработанногоВремени = Не ВидРасчетаОбъект.ЯвляетсяДоходомВНатуральнойФорме И
		(ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);
		
	Если Не ЗначениеЗаполнено(ВидРасчетаОбъект.КодДоходаНДФЛ) Тогда
		ВидРасчетаОбъект.КатегорияДохода = Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(ВидРасчетаОбъект.КатегорияДохода) Тогда
		ВидРасчетаОбъект.КатегорияДохода = УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(ВидРасчетаОбъект.КодДоходаНДФЛ);
	Иначе
		КодыИКатегорииНДФЛ = УчетФактическиПолученныхДоходов.СопоставлениеКодовИКатегорийДоходовНДФЛ(ВидРасчетаОбъект.КодДоходаНДФЛ);
		СтруктураПоиска = Новый Структура("КодДохода", ВидРасчетаОбъект.КодДоходаНДФЛ);
		Если ВидРасчетаОбъект.КодДоходаНДФЛ = ПредопределенноеЗначение("Справочник.ВидыДоходовНДФЛ.Код4800") Тогда
			СтруктураПоиска.Вставить("КатегорияНачисления", ВидРасчетаОбъект.КатегорияНачисленияИлиНеоплаченногоВремени);
		КонецЕсли;
		Если КодыИКатегорииНДФЛ.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			ВидРасчетаОбъект.КатегорияДохода = УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(ВидРасчетаОбъект.КодДоходаНДФЛ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(ВидРасчетаОбъект, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ВидРасчетаОбъект) И Не ВидРасчетаОбъект.ДополнительныеСвойства.Свойство("ИзменениеПланаВидовРасчетаПоНастройкам") Тогда
		Возврат;
	КонецЕсли;
	
	ВходитВБазуРКИСН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВидРасчетаОбъект.ДополнительныеСвойства, "ВходитВБазуРКИСН", Неопределено);
	Если ВходитВБазуРКИСН <> Неопределено Тогда
		ОбновитьБазуРасчетаРКиСН(ВидРасчетаОбъект.Ссылка, ВходитВБазуРКИСН);
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет план видов расчета т.н. псевдопредопределенными элементами, 
// идентифицируемыми из кода.
//
Процедура СоздатьНачисленияПоНастройкам(ПараметрыПланаВидовРасчета = Неопределено, НачальноеЗаполнение = Ложь, ТекущиеНастройки = Неопределено) Экспорт
	
	КодДоходаНДФЛ_2012 = ВидыДоходовНДФЛПоКоду("2012");
	КодДоходаНДФЛ_2013 = ВидыДоходовНДФЛПоКоду("2013");
	КодДоходаНДФЛ_2300 = ВидыДоходовНДФЛПоКоду("2300");
	
	// Безусловно создаем оклад
	Описание = ОписаниеНачисления();
	Описание.Код 							= НСтр("ru = 'ОКЛ'");
	Описание.Наименование 					= НСтр("ru = 'Оплата по окладу'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп1ст255;
	Описание.КодДоходаНДФЛ 					= Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	ЗаписатьНачисление(Описание);
	
	// Отпуск по беременности и родам.
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ОТБРР'");
	Описание.Наименование					= НСтр("ru = 'Отпуск по беременности и родам'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускПоБеременностиИРодам;
	Описание.ВидНачисленияДляНУ				= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();
	Описание.КодДоходаНДФЛ 					= Справочники.ВидыДоходовНДФЛ.ПустаяСсылка();
	Описание.КодДоходаСтраховыеВзносы 		= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС;
	Описание.КодДоходаСтраховыеВзносы2017	= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС;
	ЗаписатьНачисление(Описание);
	
	// Больничный при травме на производстве.
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'БЛТП'");
	Описание.Наименование					= НСтр("ru = 'Больничный при травме на производстве'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве;
	Описание.ВидНачисленияДляНУ				= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2300;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы 		= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС;
	ЗаписатьНачисление(Описание);
	
	// Больничный при профзаболевании.
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'БЛПЗ'");
	Описание.Наименование					= НСтр("ru = 'Больничный при профзаболевании'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2300;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС_НС;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФССНС;
	ЗаписатьНачисление(Описание);
	
	// Больничный
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'БЛН'");
	Описание.Наименование					= НСтр("ru = 'Больничный'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2300;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы 		= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС;
	Описание.КодДоходаСтраховыеВзносы2017	= Справочники.ВидыДоходовПоСтраховымВзносам.ПособияЗаСчетФСС;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюФСС;
	ЗаписатьНачисление(Описание);
	
	// Оплата больничных листов за счет работодателя.
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'БЛРДТ'");
	Описание.Наименование					= НСтр("ru = 'Больничный за счет работодателя'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп48ст266;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2300;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы 		= Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017	= Справочники.ВидыДоходовПоСтраховымВзносам.НеОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.РасходыПоСтрахованиюРаботодатель;
	ЗаписатьНачисление(Описание);
	
	// Оплата отпуска
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ОТ'");
	Описание.Наименование					= НСтр("ru = 'Отпуск основной'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп7ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2012;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск;
	ЗаписатьНачисление(Описание);
	
	// Компенсация отпуска
	СоздатьНачислениеКомпенсацияОтпуска();
	
	// Отсутствие по болезни
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ОБ'");
	Описание.Наименование					= НСтр("ru = 'Отсутствие по болезни'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.БолезньБезОплаты;
	Описание.ВидНачисленияДляНУ				= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.ПустаяСсылка();
	Описание.КодДоходаНДФЛ					= Неопределено;
	Описание.КодДоходаСтраховыеВзносы		= Неопределено;
	Описание.КодДоходаСтраховыеВзносы2017	= Неопределено;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	ЗаписатьНачисление(Описание);
	
	СоздатьНачислениеОтпускБезОплаты();
	
	// Премии
	СоздатьПремии();
	
	// Если используется РК и/или СН - создаем соответствующие виды начислений.
	СоздатьНачисленияРКиСН();
	
	//Доли РК и СН среднего заработка
	СоздатьНачисленияОплатыДолейРКиСН();
	
	
КонецПроцедуры

Процедура СоздатьНачислениеОтпускБезОплаты() Экспорт
	
	// Оплата отпуска
	Описание = ОписаниеНачисления();
	Описание.Код          = НСтр("ru = 'ОТПОЗ'");
	Описание.Наименование = НСтр("ru = 'Отпуск без оплаты согласно ТК РФ'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОтпускБезОплаты;
	
	НачисленияПоОписанию = НачисленияПоКатегории(Описание.КатегорияНачисленияИлиНеоплаченногоВремени);
	Если НачисленияПоОписанию.Количество() = 0 Тогда
		
		НачислениеОбъект = ПланыВидовРасчета.Начисления.СоздатьВидРасчета();
		ЗаполнитьЗначенияСвойств(НачислениеОбъект, Описание);
		НачислениеОбъект.КраткоеНаименование = НСтр("ru='Отп. без опл.'");
		НачислениеОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьНачисленияРКиСН(КоллекторНачислений = Неопределено, СвойстваНачислений = Неопределено) Экспорт
	
	ЗаписыватьНачисления = Ложь;
	Если КоллекторНачислений = Неопределено Тогда
		// Если метод используется отдельно от формирования плана видов расчета по настройкам, 
		// то запись начислений производится в нем, локально.
		КоллекторНачислений = Новый Соответствие;
		ЗаписыватьНачисления = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВостребованностьРКиСН = РасчетЗарплаты.ВостребованностьРКиСН();
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		ПрименяетсяАУСН = МодульРасчетЗарплатыДляНебольшихОрганизаций.ПрименяетсяАУСН();
	Иначе
		ПрименяетсяАУСН = Ложь;
	КонецЕсли;
	
	НачисленияВключаемыеВБазуРасчетаРКиСН = НачисленияВключаемыеВБазуРасчетаРКиСН();
	
	// Районный коэффициент
	Описание = ОписаниеНачисления();
	Описание.Код = НСтр("ru = 'РК'");
	Описание.Наименование = НСтр("ru = 'Районный коэффициент'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент;
	Описание.ВидНачисленияДляНУ = Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп11ст255;
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;
	Если ПрименяетсяАУСН Тогда
		Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
	Иначе
		Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
	КонецЕсли;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	
	Если ВостребованностьРКиСН.РайонныйКоэффициент Тогда
		ЗаписатьНачисление(Описание);
		НачисленияСсылки = НачисленияПоОписанию(Описание);
		Если ЗначениеЗаполнено(НачисленияСсылки) Тогда
			Для Каждого НачислениеСсылка Из НачисленияСсылки Цикл
				Если ЗначениеЗаполнено(НачислениеСсылка) Тогда
					НачислениеОбъект = НачислениеСсылка.ПолучитьОбъект();
					НачислениеОбъект.БазовыеВидыРасчета.Очистить();
					Для Каждого ВидРасчета Из НачисленияВключаемыеВБазуРасчетаРКиСН Цикл
						НоваяСтрока = НачислениеОбъект.БазовыеВидыРасчета.Добавить();
						НоваяСтрока.ВидРасчета = ВидРасчета;
					КонецЦикла;
					НачислениеОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
	
	// Северная надбавка
	Описание = ОписаниеНачисления();
	Описание.Код = НСтр("ru = 'СН'");
	Описание.Наименование = НСтр("ru = 'Северная надбавка'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка;
	Описание.ВидНачисленияДляНУ = Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп12ст255;
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;
	Если ПрименяетсяАУСН Тогда
		Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
	Иначе
		Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
	КонецЕсли;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	
	Если ВостребованностьРКиСН.СевернаяНадбавка Тогда
		ЗаписатьНачисление(Описание);
		НачисленияСсылки = НачисленияПоОписанию(Описание);
		Если ЗначениеЗаполнено(НачисленияСсылки) Тогда
			Для Каждого НачислениеСсылка Из НачисленияСсылки Цикл
				Если ЗначениеЗаполнено(НачислениеСсылка) Тогда
					НачислениеОбъект = НачислениеСсылка.ПолучитьОбъект();
					НачислениеОбъект.БазовыеВидыРасчета.Очистить();
					Для Каждого ВидРасчета Из НачисленияВключаемыеВБазуРасчетаРКиСН Цикл
						НоваяСтрока = НачислениеОбъект.БазовыеВидыРасчета.Добавить();
						НоваяСтрока.ВидРасчета = ВидРасчета;
					КонецЦикла;
					НачислениеОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Иначе
		ОтключитьИспользованиеНачисленийПоОписанию(КоллекторНачислений, Описание);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьВидДоходаИсполнительногоПроизводства() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСсылка", Перечисления.ВидыДоходовИсполнительногоПроизводства.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидДоходаИсполнительногоПроизводства = &ПустаяСсылка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;	
	
	Начисления = РезультатЗапроса.Выбрать();
	Пока Начисления.Следующий() Цикл
		Начисление = Начисления.Ссылка.ПолучитьОбъект();
		Начисление.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ЗарплатаВознаграждения;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Начисление);
	КонецЦикла	
	
КонецПроцедуры

Процедура СоздатьГодовуюПремию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодДоходаНДФЛ_2002 = ВидыДоходовНДФЛПоКоду("2002");
	КодНачисления = НСтр("ru = 'ПРГП'");
	
	//Ранее часть реквизитов отличалась - надо переназначить при необходимости
	Описание = ОписаниеНачисления();
	Описание.Код							= КодНачисления;
	Описание.Наименование					= НСтр("ru = 'Премия за год'");
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ, КатегорияНачисленияИлиНеоплаченногоВремени";
	НачисленияПоОписанию = НачисленияПоОписанию(Описание);
	Если НачисленияПоОписанию.Количество() > 0 Тогда
		НачислениеОбъект = НачисленияПоОписанию[0].ПолучитьОбъект();
		НачислениеОбъект.Код = НСтр("ru = 'нПРГП'");
		НачислениеОбъект.ВАрхиве = Истина;
		НачислениеОбъект.Записать();
	КонецЕсли;
	
	Описание = ОписаниеНачисления();
	Описание.Код							= КодНачисления;
	Описание.Наименование					= НСтр("ru = 'Премия за год (процентом)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 12;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СоздатьНачислениеКомпенсацияОтпуска() Экспорт
	
	КодДоходаНДФЛ_2013 = ВидыДоходовНДФЛПоКоду("2013");
	
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'КОТ'");
	Описание.Наименование					= НСтр("ru = 'Компенсация отпуска'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп8ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2013;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Ложь;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска;
	ЗаписатьНачисление(Описание);
		
КонецПроцедуры

Процедура ЗаполнитьВидДоходаИсполнительногоПроизводства2022() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПустаяСсылка", Перечисления.ВидыДоходовИсполнительногоПроизводства.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидДоходаИсполнительногоПроизводства2022 = &ПустаяСсылка";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат
	КонецЕсли;	
	
	Начисления = РезультатЗапроса.Выбрать();
	Пока Начисления.Следующий() Цикл
		Начисление = Начисления.Ссылка.ПолучитьОбъект();
		ВидДохода = Начисление.ВидДоходаИсполнительногоПроизводства;
		Если Начисление.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииНеоблагаемые Тогда
			ВидДохода = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииНеоблагаемыеПериодические;
		ИначеЕсли Начисление.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииОблагаемые Тогда
			ВидДохода = Перечисления.ВидыДоходовИсполнительногоПроизводства.КомпенсацииОблагаемыеПериодические;
		КонецЕсли;
		Начисление.ВидДоходаИсполнительногоПроизводства2022 = ВидДохода;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Начисление);
	КонецЦикла	
	
КонецПроцедуры

Процедура УточнитьКодДоходаНДФЛОтпускаАУСН() Экспорт
	
	КодДохода2000 = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	
	КодыНачислений = Новый Массив;
	КодыНачислений.Добавить("ОТ");
	КодыНачислений.Добавить("КОТ");
	
	КодыДоходовНДФЛ = Новый Массив;
	КодыДоходовНДФЛ.Добавить(ВидыДоходовНДФЛПоКоду("2012"));
	КодыДоходовНДФЛ.Добавить(ВидыДоходовНДФЛПоКоду("2013"));
	
	КатегорииНачислений = Новый Массив;
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска);
	КатегорииНачислений.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее);
	
	ВидыОперацийПоЗарплате = Новый Массив;
	ВидыОперацийПоЗарплате.Добавить(Перечисления.ВидыОперацийПоЗарплате.ЕжегодныйОтпуск);
	ВидыОперацийПоЗарплате.Добавить(Перечисления.ВидыОперацийПоЗарплате.КомпенсацияЕжегодногоОтпуска);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодыНачислений",         КодыНачислений);
	Запрос.УстановитьПараметр("КодыДоходовНДФЛ",        КодыДоходовНДФЛ);
	Запрос.УстановитьПараметр("КатегорииНачислений",    КатегорииНачислений);
	Запрос.УстановитьПараметр("ВидыОперацийПоЗарплате", ВидыОперацийПоЗарплате);
	Запрос.УстановитьПараметр("КодДоходаНДФЛАУСН",      КодДохода2000);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияАУСН.НачислениеАУСН КАК Ссылка
	|ИЗ
	|	РегистрСведений.НачисленияАУСН КАК НачисленияАУСН
	|ГДЕ
	|	НачисленияАУСН.НачислениеАУСН.Код В(&КодыНачислений)
	|	И НачисленияАУСН.НачислениеАУСН.КодДоходаНДФЛ В(&КодыДоходовНДФЛ)
	|	И НачисленияАУСН.НачислениеАУСН.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииНачислений)
	|	И НачисленияАУСН.НачислениеАУСН.ВидОперацииПоЗарплате В(&ВидыОперацийПоЗарплате)
	|	И НачисленияАУСН.НачислениеАУСН.КодДоходаНДФЛ <> &КодДоходаНДФЛАУСН";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачислениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		НачислениеОбъект.КодДоходаНДФЛ   = КодДохода2000;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НачислениеОбъект);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УточнитьКодДоходаНДФЛКатегориюОписаниеРКиСН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РайонныйКоэффициент",	Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп11ст255);
	Запрос.УстановитьПараметр("СевернаяНадбавка",		Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп12ст255);
	МассивОбработанныхКатегорий = Новый Массив;
	МассивОбработанныхКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН);
	МассивОбработанныхКатегорий.Добавить(Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки);
	Запрос.УстановитьПараметр("ОбработанныеКатегории",	МассивОбработанныхКатегорий);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Начисления.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КатегорияДоходаАУСН
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидНачисленияДляНУ = &РайонныйКоэффициент
	|	И НЕ Начисления.КатегорияДохода В (&ОбработанныеКатегории)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Начисления.КатегорияДохода = ЗНАЧЕНИЕ(Перечисление.КатегорииДоходовНДФЛ.ОплатаТрудаАУСН)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КатегорияДоходаАУСН
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ВидНачисленияДляНУ = &СевернаяНадбавка
	|	И НЕ Начисления.КатегорияДохода В (&ОбработанныеКатегории)";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРайонныйКоэфициент	= РезультатыЗапроса[0].Выбрать();
	ВыборкаСевернаяНадбавка		= РезультатыЗапроса[1].Выбрать();
	
	Пока ВыборкаРайонныйКоэфициент.Следующий() Цикл
		Начисление = ВыборкаРайонныйКоэфициент.Ссылка.ПолучитьОбъект();
		Если ВыборкаРайонныйКоэфициент.КатегорияДоходаАУСН Тогда
			Начисление.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
		Иначе
			Начисление.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
		КонецЕсли;
		Начисление.КодДоходаНДФЛ	= Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Начисление);
	КонецЦикла;
	Пока ВыборкаСевернаяНадбавка.Следующий() Цикл
		Начисление = ВыборкаСевернаяНадбавка.Ссылка.ПолучитьОбъект();
		Если ВыборкаСевернаяНадбавка.КатегорияДоходаАУСН Тогда
			Начисление.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
		Иначе
			Начисление.КатегорияДохода	= Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
		КонецЕсли;
		Начисление.КодДоходаНДФЛ	= Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Начисление);
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНачисленияОплатыДолейРКиСН(Категории = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Категории = Неопределено Тогда
		Категории = КатегорииНачисленийОплатПоСреднему();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	ВЫРАЗИТЬ(НачисленияУдержанияПоСотрудникам.НачислениеУдержание КАК ПланВидовРасчета.Начисления).КатегорияНачисленияИлиНеоплаченногоВремени = ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент)";
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ТребуетсяДоляСН = Не РезультатПакет[0].Пустой();
	ТребуетсяДоляРК = Не РезультатПакет[1].Пустой();
	
	ВостребованностьРКиСН = РасчетЗарплаты.ВостребованностьРКиСН();
	
	КатегорииАУСН = Перечисления.КатегорииДоходовНДФЛ.ДоходыАУСН();
	
	КодыКатегорийНачислений = Новый Соответствие;
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛиста, "БЛ");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоЛистаЗаСчетРаботодателя, "БЛР");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоНесчастныйСлучайНаПроизводстве, "БЛН");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаБольничногоПрофзаболевание, "БЛП");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаКомандировки, "КОМ");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаОтпуска, "ОТП");
	КодыКатегорийНачислений.Вставить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КомпенсацияОтпуска, "КОТ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Ссылка КАК ОсновнойВидРасчета,
		|	Начисления.Наименование КАК Наименование,
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени КАК КатегорияНачисленияИлиНеоплаченногоВремени,
		|	Начисления.ВидНачисленияДляНУ КАК ВидНачисленияДляНУ,
		|	Начисления.КодДоходаСтраховыеВзносы КАК КодДоходаСтраховыеВзносы,
		|	Начисления.КатегорияДохода КАК КатегорияДохода,
		|	Начисления.ЯвляетсяДоходомВНатуральнойФорме КАК ЯвляетсяДоходомВНатуральнойФорме,
		|	Начисления.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	Начисления.ОтношениеКЕНВД КАК ОтношениеКЕНВД,
		|	Начисления.КодДоходаСтраховыеВзносы2017 КАК КодДоходаСтраховыеВзносы2017,
		|	Начисления.ПорядокОпределенияМесяцаДоходаВВидеОплатыТруда КАК ПорядокОпределенияМесяцаДоходаВВидеОплатыТруда,
		|	Начисления.ВидДоходаИсполнительногоПроизводства КАК ВидДоходаИсполнительногоПроизводства,
		|	Начисления.ВидДоходаИсполнительногоПроизводства2022 КАК ВидДоходаИсполнительногоПроизводства2022,
		|	Начисления.СтрокаРаздела2Расчета6НДФЛ КАК СтрокаРаздела2Расчета6НДФЛ
		|ИЗ
		|	ПланВидовРасчета.Начисления КАК Начисления
		|ГДЕ
		|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииНачисленийИлиНеоплаченногоВремени)
		|	И НЕ Начисления.ПометкаУдаления
		|	И НЕ Начисления.ВАрхиве";
	
	Запрос.УстановитьПараметр("КатегорииНачисленийИлиНеоплаченногоВремени", Категории);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЭтоАУСН = КатегорииАУСН.Найти(Выборка.КатегорияДохода) <> Неопределено;
		// Доля районного коэффициента
		Описание = ОписаниеНачисления();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		Описание.Код = СтрШаблон(НСтр("ru = '%1РК'"), КодыКатегорийНачислений.Получить(Выборка.КатегорияНачисленияИлиНеоплаченногоВремени));        
		Описание.Наименование = СтрШаблон(НСтр("ru = '%1 (доля РК)'"), СокрЛП(Выборка.Наименование));
		Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке;
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;

		Если ЭтоАУСН Тогда
			Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
		Иначе
			Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
		КонецЕсли;
		Описание.КлючевыеСвойства = "ОсновнойВидРасчета";
		
		Если ВостребованностьРКиСН.РайонныйКоэффициент Или ТребуетсяДоляРК Тогда
			ЗаписатьНачисление(Описание);
		КонецЕсли;
		
		// Доля северной надбавки
		Описание = ОписаниеНачисления();
		ЗаполнитьЗначенияСвойств(Описание, Выборка);
		Описание.Код = СтрШаблон(НСтр("ru = '%1СН'"), КодыКатегорийНачислений.Получить(Выборка.КатегорияНачисленияИлиНеоплаченногоВремени));
		Описание.Наименование = СтрШаблон(НСтр("ru = '%1 (доля СН)'"), СокрЛП(Выборка.Наименование));
		Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ОплатаДолиСевернойНадбавкиВСреднемЗаработке;
		Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.РайонныеСеверныеНадбавки;
		Если ЭтоАУСН Тогда
			Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавкиАУСН;
		Иначе
			Описание.КатегорияДохода = Перечисления.КатегорииДоходовНДФЛ.РайонныеСеверныеНадбавки;
		КонецЕсли;
		Описание.КлючевыеСвойства = "ОсновнойВидРасчета";
		
		Если ВостребованностьРКиСН.СевернаяНадбавка Или ТребуетсяДоляСН Тогда
			ЗаписатьНачисление(Описание);
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СоздатьПрочиеПремии() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КодДоходаНДФЛ_2002 = ВидыДоходовНДФЛПоКоду("2002");
	КодДоходаНДФЛ_2003 = ВидыДоходовНДФЛПоКоду("2003");
	
	// Премии по результатам работа
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ПРГС'");
	Описание.Наименование					= НСтр("ru = 'Премия за год (суммой)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 12;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ПРКП'");
	Описание.Наименование					= НСтр("ru = 'Премия за квартал (процентом)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 3;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ПРКС'");
	Описание.Наименование					= НСтр("ru = 'Премия за квартал (суммой)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 3;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ПРРП'");
	Описание.Наименование					= НСтр("ru = 'Премия разовая (процентом)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 1;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	Описание = ОписаниеНачисления();
	Описание.Код							= НСтр("ru = 'ПРРС'");
	Описание.Наименование					= НСтр("ru = 'Премия разовая (суммой)'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.ВидНачисленияДляНУ 			= Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ 					= КодДоходаНДФЛ_2002;
	Описание.КатегорияДохода				= УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы	 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 	= Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН 				= Истина;
	Описание.ВидОперацииПоЗарплате 			= Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 1;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой;
	Описание.КлючевыеСвойства				= "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	// Премии за счет прибыли
	Описание = ОписаниеНачисления();
	Описание.Код                          = "ПРПР";
	Описание.Наименование                 = НСтр("ru = 'Премия за счет прибыли'");
	Описание.КатегорияНачисленияИлиНеоплаченногоВремени = Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия;
	Описание.ВидНачисленияДляНУ           = Перечисления.ВидыНачисленийОплатыТрудаДляНУ.пп2ст255;
	Описание.КодДоходаНДФЛ                = КодДоходаНДФЛ_2003;
	Описание.КатегорияДохода              = УчетНДФЛПовтИсп.КатегорияДоходаПоЕгоКоду(Описание.КодДоходаНДФЛ);
	Описание.КодДоходаСтраховыеВзносы     = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.КодДоходаСтраховыеВзносы2017 = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	Описание.ВходитВБазуРКИСН             = Ложь;
	Описание.ВидОперацииПоЗарплате        = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.КоличествоМесяцевБазовогоПериода = 0;
	Описание.СреднийЗаработокОбщий 			= Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать;
	Описание.КлючевыеСвойства             = "Код, Наименование, КодДоходаНДФЛ";
	ЗаписатьНачисление(Описание);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура СоздатьПремии() Экспорт
	
	СоздатьГодовуюПремию();
	СоздатьПрочиеПремии();

КонецПроцедуры

Функция НачисленияВключаемыеВБазуРасчетаРКиСН(УчитыватьКатегориюПрочее = Ложь) Экспорт
	
	// Автоматически в базу расчета РК и СН включаются начисления, соответствующие условиям:
	//   - категория начисления и неоплаченного времени не попадает в список оплат по среднему
	//   - в случае, если это Премия или КвартальнаяПремия, тогда СреднийЗаработокОбщий <> НеВключать
	
	КатегорииПремий = Новый Массив;
	КатегорииПремий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Премия);
	КатегорииПремий.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.КвартальнаяПремия);
	
	ОбслуживаемыеКатегории = Новый Массив;
	ОбслуживаемыеКатегории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.ПовременнаяОплатаТруда);
	Если УчитыватьКатегориюПрочее Тогда
		ОбслуживаемыеКатегории.Добавить(Перечисления.КатегорииНачисленийИНеоплаченногоВремени.Прочее);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОбслуживаемыеКатегории, КатегорииПремий);
	
	СреднийЗаработокОбщий = Новый Массив;
	СреднийЗаработокОбщий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПустаяСсылка());
	СреднийЗаработокОбщий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбслуживаемыеКатегории", ОбслуживаемыеКатегории);
	Запрос.УстановитьПараметр("КатегорииПремий", КатегорииПремий);
	Запрос.УстановитьПараметр("СреднийЗаработокОбщий", СреднийЗаработокОбщий);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияСреднийЗаработокОбщий.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Исключения
	|ИЗ
	|	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
	|ГДЕ
	|	НачисленияСреднийЗаработокОбщий.Значение В(&СреднийЗаработокОбщий)
	|	И НачисленияСреднийЗаработокОбщий.Ссылка.КатегорияНачисленияИлиНеоплаченногоВремени В(&КатегорииПремий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Начисления.Ссылка КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (&ОбслуживаемыеКатегории)
	|	И НЕ Начисления.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_Исключения.Ссылка
	|				ИЗ
	|					ВТ_Исключения)";
	
	МассивНачислений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРасчета");
	
	Возврат МассивНачислений;
	
КонецФункции

Функция НачисленияРКиСН() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.КатегорияНачисленияИлиНеоплаченногоВремени В (ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.РайонныйКоэффициент), ЗНАЧЕНИЕ(Перечисление.КатегорииНачисленийИНеоплаченногоВремени.СевернаяНадбавка))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ВходитВБазуРКИСН(ВидРасчета) Экспорт
	
	Начисления = НачисленияРКиСН();
	Если Не ЗначениеЗаполнено(Начисления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачисленияРКиСН", Начисления);
	Запрос.УстановитьПараметр("ВидРасчета", ВидРасчета);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачисленияБазовыеВидыРасчета.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	ПланВидовРасчета.Начисления.БазовыеВидыРасчета КАК НачисленияБазовыеВидыРасчета
	|ГДЕ
	|	НачисленияБазовыеВидыРасчета.Ссылка В(&НачисленияРКиСН)
	|	И НачисленияБазовыеВидыРасчета.ВидРасчета = &ВидРасчета";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ОбновитьБазуРасчетаРКиСН(ВидРасчета, Дополнять) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	Начисления = НачисленияРКиСН();
	Если Не ЗначениеЗаполнено(Начисления) Тогда
		Возврат;
	КонецЕсли;
	
	Если Начисления.Найти(ВидРасчета) <> Неопределено Тогда
		Дополнять = Ложь; // РК и СН не может входить в базу РК и СН
	КонецЕсли;
	
	Для Каждого Начисление Из Начисления Цикл
		НачислениеОбъект = Начисление.ПолучитьОбъект();
		СтрокаВидаРасчета = НачислениеОбъект.БазовыеВидыРасчета.Найти(ВидРасчета, "ВидРасчета");
		Если Дополнять И СтрокаВидаРасчета = Неопределено Тогда
			НоваяСтрока = НачислениеОбъект.БазовыеВидыРасчета.Добавить();
			НоваяСтрока.ВидРасчета = ВидРасчета;
			НачислениеОбъект.Записать();
		КонецЕсли;
		Если Не Дополнять И СтрокаВидаРасчета <> Неопределено Тогда
			НачислениеОбъект.БазовыеВидыРасчета.Удалить(НачислениеОбъект.БазовыеВидыРасчета.Индекс(СтрокаВидаРасчета));
			НачислениеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеНачислений(ВидыРасчета, СписокРеквизитов) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидыРасчета)
		Или Не ЗначениеЗаполнено(СписокРеквизитов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеНачислений = Новый Соответствие;
	Для Каждого ВидРасчета Из ВидыРасчета Цикл
		ДанныеНачислений.Вставить(ВидРасчета, ДанныеНачисления(ВидРасчета, СписокРеквизитов));
	КонецЦикла;
	
	Возврат ДанныеНачислений;
	
КонецФункции

Функция ДанныеНачисления(ВидРасчета, СписокРеквизитов) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидРасчета)
		Или Не ЗначениеЗаполнено(СписокРеквизитов) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИменаРеквизитов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СписокРеквизитов,,Истина, Истина);
	
	ПризнакПолучатьПризнакРКиСН = Ложь;
	ПризнакПолучатьПризнакРасчетаСреднего = Ложь;
	Реквизиты = "";
	Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
		Если ВРЕГ(ИмяРеквизита) = ВРЕГ("ВходитВБазуРКИСН") Тогда
			ПризнакПолучатьПризнакРКиСН = Истина;
		ИначеЕсли ВРЕГ(ИмяРеквизита) = ВРЕГ("СреднийЗаработокОбщий") Тогда
			ПризнакПолучатьПризнакРасчетаСреднего = Истина;
		Иначе
			Реквизиты = Реквизиты + "," + ИмяРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеНачисления = Новый Структура;
	Если ЗначениеЗаполнено(Реквизиты) Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ДанныеНачисления, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРасчета, Реквизиты));
	КонецЕсли;
	
	Если ПризнакПолучатьПризнакРКиСН Тогда
		ДанныеНачисления.Вставить("ВходитВБазуРКИСН", ВходитВБазуРКИСН(ВидРасчета));
	КонецЕсли;
	
	Если ПризнакПолучатьПризнакРасчетаСреднего Тогда
		СреднийЗаработокОбщий = Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПустаяСсылка();
		ТаблицаСреднийЗаработокОбщий = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидРасчета, "СреднийЗаработокОбщий");
		Если ТаблицаСреднийЗаработокОбщий.Количество() > 0 Тогда
			СреднийЗаработокОбщий = ТаблицаСреднийЗаработокОбщий[0].Значение;
		КонецЕсли;
		ДанныеНачисления.Вставить("СреднийЗаработокОбщий", СреднийЗаработокОбщий);
	КонецЕсли;
	
	Возврат ДанныеНачисления;
	
КонецФункции

Функция ВидыДоходовНДФЛПоКоду(КодДохода) Экспорт
	
	КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду(КодДохода);
	Если НЕ ЗначениеЗаполнено(КодДоходаНДФЛ) Тогда
		 
		Справочники.ВидыДоходовНДФЛ.СоздатьКодыДоходовНДФЛ();
		КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.НайтиПоКоду(КодДохода);
		
	КонецЕсли; 
	
	Возврат КодДоходаНДФЛ;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	// см. в т.ч. РасчетЗарплатыДляНебольшихОрганизаций.ЗарегистрироватьОбработчикиОбновления
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьНачисление(Описание, ПроверятьНаличиеНачислений = Истина)
	
	Если ПроверятьНаличиеНачислений Тогда
		НачисленияПоОписанию = НачисленияПоОписанию(Описание);
		Если НачисленияПоОписанию.Количество() > 0 Тогда
			// Если начисления по такому описанию уже существуют, 
			// надо проверить все ли они используются, если нет - нужно их «включить».
			КоллекторНачислений = Новый Соответствие;
			УстановитьИспользованиеНачислений(КоллекторНачислений, НачисленияПоОписанию, Истина);
			Возврат НачисленияПоОписанию;
		КонецЕсли;
	КонецЕсли;
	
	НачислениеОбъект = ПланыВидовРасчета.Начисления.СоздатьВидРасчета();
	
	ЗаполнитьЗначенияСвойств(НачислениеОбъект, Описание);
	
	НачислениеОбъект.СреднийЗаработокОбщий.Очистить();
	СреднийЗаработокОбщий = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "СреднийЗаработокОбщий", Неопределено);
	Если ЗначениеЗаполнено(СреднийЗаработокОбщий) Тогда
		НоваяСтрока = НачислениеОбъект.СреднийЗаработокОбщий.Добавить();
		НоваяСтрока.Значение = СреднийЗаработокОбщий;
		НоваяСтрока.ПорядокРасчета = Перечисления.ПорядокРасчетаСреднегоЗаработкаОбщий.Постановление2010;
		НоваяСтрока.Индексируется = Истина;
	КонецЕсли;
	
	ВходитВБазуРКИСН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Описание, "ВходитВБазуРКИСН", Неопределено);
	Если ВходитВБазуРКИСН <> Неопределено Тогда
		НачислениеОбъект.ДополнительныеСвойства.Вставить("ВходитВБазуРКИСН", ВходитВБазуРКИСН);
	КонецЕсли;
	
	НачислениеОбъект.Записать();
	
	Возврат ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НачислениеОбъект.Ссылка);
	
КонецФункции

// Возвращает категории начислений, из которых требуется выделять доли РК, СН
//
Функция КатегорииНачисленийОплатПоСреднему()
	
	Возврат ПланыВидовРасчета.Начисления.КатегорииНачисленийОплатПоСреднему();
	
КонецФункции

Функция ОписаниеНачисления()
	
	Описание = Новый Структура(
	"Код,
	|Наименование,
	|КатегорияНачисленияИлиНеоплаченногоВремени,
	|ВидНачисленияДляНУ,
	|КодДоходаНДФЛ,
	|КатегорияДохода,
	|КодДоходаСтраховыеВзносы,
	|КодДоходаСтраховыеВзносы2017,
	|ОтношениеКЕНВД,
	|КлючевыеСвойства,
	|СвойстваПоКатегории,
	|ВходитВБазуРКИСН,
	|ВидОперацииПоЗарплате,
	|ВидДоходаИсполнительногоПроизводства,
	|ВидДоходаИсполнительногоПроизводства2022,
	|ОсновнойВидРасчета,
	|СпособОтраженияЗарплатыВБухучете,
	|КоличествоМесяцевБазовогоПериода,
	|СреднийЗаработокОбщий");
	
	Описание.КлючевыеСвойства = "";
	Описание.ВидОперацииПоЗарплате = Перечисления.ВидыОперацийПоЗарплате.НачисленоДоход;
	Описание.ВидДоходаИсполнительногоПроизводства = Перечисления.ВидыДоходовИсполнительногоПроизводства.ЗарплатаВознаграждения;
	Описание.ВидДоходаИсполнительногоПроизводства2022 = Перечисления.ВидыДоходовИсполнительногоПроизводства.ЗарплатаВознаграждения;
	
	Возврат Описание;
	
КонецФункции

Функция НачисленияПоОписанию(Описание)
	
	Отбор = Новый Структура;
	
	// Если указаны, ключевые свойства используются для уточнения критериев отбора искомого начисления.
	Если ЗначениеЗаполнено(Описание.КлючевыеСвойства) Тогда
		Отбор = Новый Структура(Описание.КлючевыеСвойства);
		ЗаполнитьЗначенияСвойств(Отбор, Описание);
	КонецЕсли;
	
	Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", Описание.КатегорияНачисленияИлиНеоплаченногоВремени);
	
	Возврат ПланыВидовРасчета.Начисления.НачисленияПоОтбору(Отбор);
	
КонецФункции

Функция НачисленияПоКатегории(КатегорияНачисления, Отбор = Неопределено)
	
	Если Отбор = Неопределено Тогда
		Отбор = Новый Структура;
	КонецЕсли;
	Отбор.Вставить("КатегорияНачисленияИлиНеоплаченногоВремени", КатегорияНачисления);
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	Возврат  ПланыВидовРасчета.Начисления.НачисленияПоОтбору(Отбор, "РеквизитДопУпорядочивания");
	
КонецФункции

Процедура ОтключитьИспользованиеНачисленийПоОписанию(Коллектор, Описание)
	
	ПланыВидовРасчета.Начисления.ОтключитьИспользованиеНачисленийПоОписанию(Коллектор, Описание);
	
КонецПроцедуры

Процедура УстановитьИспользованиеНачислений(Коллектор, Начисления, Использование)
	
	ПланыВидовРасчета.Начисления.УстановитьИспользованиеНачислений(Коллектор, Начисления, Использование);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
