#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Сотрудник",
		"РегламентированныеДанные");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПередЗаписью(Объект, Замещение) Экспорт
	СохранитьПрежнийНаборЗаписей(Объект, Замещение);
КонецПроцедуры

Процедура ПодготовитьОбновлениеЗависимыхДанныхПриОбменеПриЗаписи(Объект, Замещение) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ЗаполнитьТаблицуОбновленияЗаработанныхПравНаОтпуска(Объект, Замещение);
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПрежнийНаборЗаписей(НаборЗаписей, Замещение) Экспорт
	
	Сотрудники = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписей, Замещение, "Сотрудник");
	Если Сотрудники.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = РегистрыБЗК.ЗаписиНабораИзБазыДанных(НаборЗаписей, Замещение);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПрежнийНабор", ПрежнийНабор);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли