//@Strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Структура:
// * Кандидат - СправочникСсылка.Кандидаты -
// * Этап - СправочникСсылка.ЭтапыРаботыСКандидатами -
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций -
// * Идентификатор - Строка -
// * Ссылка - Строка -
// * СсылкаОрганизатора - Строка -
// * Участники - Массив Из СправочникСсылка.Пользователи -
// * Начало - Дата -
// * Окончание - Дата -
Функция НовыеПараметрыВидеособеседования() Экспорт
	
	ПараметрыВидеособеседования = Новый Структура();
	ПараметрыВидеособеседования.Вставить("Кандидат",
		ПредопределенноеЗначение("Справочник.Кандидаты.ПустаяСсылка"));
	ПараметрыВидеособеседования.Вставить("Этап",
		ПредопределенноеЗначение("Справочник.ЭтапыРаботыСКандидатами.ПустаяСсылка"));
	ПараметрыВидеособеседования.Вставить("УчетнаяЗапись",
		ПредопределенноеЗначение("Справочник.УчетныеЗаписиВидеоконференций.ПустаяСсылка"));
	ПараметрыВидеособеседования.Вставить("Идентификатор", "");
	ПараметрыВидеособеседования.Вставить("Ссылка", "");
	ПараметрыВидеособеседования.Вставить("СсылкаОрганизатора", "");
	ПараметрыВидеособеседования.Вставить("Участники", Новый Массив());
	ПараметрыВидеособеседования.Вставить("Начало", Дата(1, 1, 1));
	ПараметрыВидеособеседования.Вставить("Окончание", Дата(1, 1, 1));
	
	Возврат ПараметрыВидеособеседования;
	
КонецФункции

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Параметры - См. НовыеПараметрыВидеособеседования
//  ОповещениеОЗавершении - ОписаниеОповещения
Процедура НачатьПланированиеВидеособеседования(Форма, Параметры, ОповещениеОЗавершении) Экспорт
	
	ДанныеСервиса = ВидеоконференцииКлиент.ДанныеСервиса(Параметры.УчетнаяЗапись);
	
	Если ДанныеСервиса.ДоступенЧат Тогда
		ЧатыПоКандидату = ВидеоконференцииПоКандидату(Параметры);
		
		Если ЧатыПоКандидату.Количество() <> 0 Тогда
			Параметры.Идентификатор = ЧатыПоКандидату[0];
			
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Использовать существующий'"));
			Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Создать новый'"));
			Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
			
			ПараметрыОповещения = Новый Структура(
				"Форма, Параметры, ОповещениеОЗавершении", Форма, Параметры, ОповещениеОЗавершении);
			
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"НачатьПланированиеВидеособеседованияВопрос", ВидеособеседованияКлиент, ПараметрыОповещения);
			
			СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
				ОписаниеОповещения, НСтр("ru = 'По этому кандидату уже существует чат.'"), Кнопки);
			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	НачатьПланированиеНовойВидеоконференции(Форма, Параметры, ОповещениеОЗавершении);
	
КонецПроцедуры

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Параметры - См. НовыеПараметрыВидеособеседования
//  ОповещениеОЗавершении - ОписаниеОповещения
Процедура НачатьОбновлениеВидеособеседования(Форма, Параметры, ОповещениеОЗавершении) Экспорт
	
	ДлительнаяОперация = ВидеособеседованияВызовСервера.ДлительнаяОперацияОбновленияВидеособеседования(
		Параметры, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновляем видеоконференцию.'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

// Параметры:
//  Параметры - См. НовыеПараметрыВидеособеседования
Процедура НачатьВидеособеседование(Параметры) Экспорт
	
	Если ПользовательЯвляетсяУчастником(Параметры) Тогда
		ВидеоконференцииКлиент.НачатьВидеоконференцию(
			Параметры.УчетнаяЗапись, Параметры.СсылкаОрганизатора, Параметры.Идентификатор);
	Иначе
		ЗадатьВопросДобавитьПользователя(Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  Параметры - См. НовыеПараметрыВидеособеседования
Процедура ПерейтиВВидеоконференцию(Параметры) Экспорт
	
	Если ПользовательЯвляетсяУчастником(Параметры) Тогда
		ВидеоконференцииКлиент.ПерейтиВВидеоконференцию(Параметры.Ссылка);
	Иначе
		ЗадатьВопросДобавитьПользователя(Параметры);
	КонецЕсли;
	
КонецПроцедуры

// См. Видеособеседования.ОтменитьВидеоконференцииПоКандидату
Процедура ОтменитьВидеоконференцииПоКандидату(Параметры) Экспорт
	
	ВидеособеседованияВызовСервера.ОтменитьВидеоконференцииПоКандидату(Параметры);
	
КонецПроцедуры

// См. Видеособеседования.ДанныеПересеченийВидеоконференций
Функция ДанныеПересеченийВидеоконференций(Параметры) Экспорт
	
	Возврат ВидеособеседованияВызовСервера.ДанныеПересеченийВидеоконференций(Параметры);
	
КонецФункции

// См. Видеособеседования.ВидеоконференцииПоКандидату
Функция ВидеоконференцииПоКандидату(Параметры) Экспорт
	
	Возврат ВидеособеседованияВызовСервера.ВидеоконференцииПоКандидату(Параметры);
	
КонецФункции

// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ДанныеЭтапа - РегистрСведенийЗапись.РаботаСКандидатами
Процедура ПриОтменеЭтапа(Форма, ДанныеЭтапа) Экспорт
	
	Параметры = НовыеПараметрыВидеособеседования();
	Параметры.УчетнаяЗапись = ДанныеЭтапа.УчетнаяЗаписьВидеоконференции;
	Параметры.Кандидат = ДанныеЭтапа.Кандидат;
	Параметры.Идентификатор = ДанныеЭтапа.ИдентификаторВидеоконференции;
	
	ВидеоконференцииПоКандидату = ВидеоконференцииПоКандидату(Параметры);
	
	Если ВидеоконференцииПоКандидату.Количество() = 1 Тогда
		ДлительнаяОперация = ДлительнаяОперацияОтменыВидеоконференции(
			Параметры.УчетнаяЗапись, Параметры.Идентификатор, Форма.УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Отменяем видеоконференцию.'");
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Неопределено, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

// Параметры:
//  ПараметрыШаблона - Структура
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Ссылка - Строка
//  СсылкаДляКандидата - Строка
Процедура ДополнитьШаблонСообщения(ПараметрыШаблона, УчетнаяЗапись, Ссылка, СсылкаДляКандидата) Экспорт
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ДанныеСервиса = ВидеоконференцииКлиент.ДанныеСервиса(УчетнаяЗапись);
		ПараметрыШаблона.Вставить("СсылкаНаВидеоконференцию", Ссылка);
		ПараметрыШаблона.Вставить("СсылкаНаВидеоконференциюДляКандидата", СсылкаДляКандидата);
		ПараметрыШаблона.Вставить("СервисВидеоконференции", ДанныеСервиса.Представление);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура НачатьПланированиеВидеособеседованияВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса.Значение = КодВозвратаДиалога.Да Тогда
		НачатьОбновлениеВидеособеседования(
			ДополнительныеПараметры.Форма,
			ДополнительныеПараметры.Параметры,
			ДополнительныеПараметры.ОповещениеОЗавершении);
	ИначеЕсли РезультатВопроса.Значение = КодВозвратаДиалога.Нет Тогда
		НачатьПланированиеНовойВидеоконференции(
			ДополнительныеПараметры.Форма,
			ДополнительныеПараметры.Параметры,
			ДополнительныеПараметры.ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПланированиеНовойВидеоконференции(Форма, Параметры, ОповещениеОЗавершении)
	
	ДлительнаяОперация = ВидеособеседованияВызовСервера.ДлительнаяОперацияСозданияВидеособеседования(
		Параметры, Форма.УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Создаем видеоконференцию.'");
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Функция ПользовательЯвляетсяУчастником(Параметры, Пользователь = Неопределено)
	
	Возврат ВидеособеседованияВызовСервера.ПользовательЯвляетсяУчастником(Параметры, Пользователь);
	
КонецФункции

Процедура ЗадатьВопросДобавитьПользователя(Параметры)
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения(
		"ДобавитьПользователяВопрос", ЭтотОбъект, Параметры);
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Стать участником'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(
		ОписаниеОповещенияВопрос, 
		НСтр("ru = 'Текущий пользователь не является участником видеоконференции.
		|Чтобы продолжить, текущему пользователю необходимо быть в списке участников.'"),
		Кнопки);
	
КонецПроцедуры

Процедура ДобавитьПользователяВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВопроса.Значение = КодВозвратаДиалога.ОК Тогда
		ВидеособеседованияВызовСервера.ДобавитьПользователяВУчастники(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Функция ДлительнаяОперацияОтменыВидеоконференции(УчетнаяЗапись, Идентификатор, УникальныйИдентификатор)
	
	Возврат ВидеособеседованияВызовСервера.ДлительнаяОперацияОтменыВидеоконференции(
		УчетнаяЗапись, Идентификатор, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти

