#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ГоловнаяОрганизация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки,
		"ОхранаТруда");
КонецПроцедуры

#КонецОбласти

#Область РегистрацияФизическихЛиц

Функция РеквизитГоловнаяОрганизация() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.Измерения.ГоловнаяОрганизация.Имя;
КонецФункции

Функция РеквизитФизическоеЛицо() Экспорт
	Возврат Метаданные.РегистрыСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки.Измерения.ФизическоеЛицо.Имя;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеСформированногоОбучения(Обучение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Обучение", Обучение);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОбученияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОбученияСотрудников.РабочееМесто КАК РабочееМесто,
		|	ОбученияСотрудников.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	ОбученияСотрудников.ПрограммаОбучения КАК ПрограммаОбучения,
		|	ОбученияСотрудников.Период КАК Период
		|ИЗ
		|	РегистрСведений.ОбученияСотрудниковОхранеТрудаОжидающиеПроверки КАК ОбученияСотрудников
		|ГДЕ
		|	ОбученияСотрудников.Обучение = &Обучение";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли