
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("НачальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Начальное заполнение видов происшествий.
Процедура НачальноеЗаполнение() Экспорт
	
	МассивКатегорийПоИнвалидам = Новый Массив;
	МассивКатегорийПоИнвалидам.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.ИнвалидыДети);
	МассивКатегорийПоИнвалидам.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.ИнвалидыСтаршеТрудоспособногоВозраста);
	МассивКатегорийПоИнвалидам.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.ИнвалидыТрудоспособные);
	МассивКатегорийПоИнвалидам.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.ИнвалидыТрудоспособныеНесовершеннолетние);
	
	МассивКатегорийПоМолодежи = Новый Массив;
	МассивКатегорийПоМолодежи.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.МолодежьВыпусникиВысшееОбразование);
	МассивКатегорийПоМолодежи.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.МолодежьВыпусникиНачальноеСреднееОбразование);
	МассивКатегорийПоМолодежи.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.МолодежьНесовершеннолетние);
	МассивКатегорийПоМолодежи.Добавить(Справочники.КатегорииСотрудниковТрудоустроенныхПоКвотам.МолодежьСироты);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКатегорийПоИнвалидам", МассивКатегорийПоИнвалидам);
	Запрос.УстановитьПараметр("МассивКатегорийПоМолодежи",  МассивКатегорийПоМолодежи);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КатегорииСотрудниковТрудоустроенныхПоКвотам.Ссылка КАК КатегорияКвоты,
	               |	ВЫБОР
	               |		КОГДА КатегорииСотрудниковТрудоустроенныхПоКвотам.Ссылка В (&МассивКатегорийПоИнвалидам)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.КвотаДляТрудоустройстваИнвалидов)
	               |		КОГДА КатегорииСотрудниковТрудоустроенныхПоКвотам.Ссылка В (&МассивКатегорийПоМолодежи)
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.КвотаДляТрудоустройстваМолодежи)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.ПустаяСсылка)
	               |	КОНЕЦ КАК ВидКвоты
	               |ИЗ
	               |	Справочник.КатегорииСотрудниковТрудоустроенныхПоКвотам КАК КатегорииСотрудниковТрудоустроенныхПоКвотам
	               |ГДЕ
	               |	КатегорииСотрудниковТрудоустроенныхПоКвотам.ВидКвоты = ЗНАЧЕНИЕ(Справочник.ВидыКвотДляТрудоустройства.ПустаяСсылка)
	               |	И КатегорииСотрудниковТрудоустроенныхПоКвотам.Предопределенный";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;     
	
	ВыборкаКатегорий = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаКатегорий.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаКатегорий.ВидКвоты) Тогда
			
			СправочникСсылка = ВыборкаКатегорий.КатегорияКвоты;
			СправочникОбъект =СправочникСсылка.ПолучитьОбъект(); 
			СправочникОбъект.ВидКвоты = ВыборкаКатегорий.ВидКвоты;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
