#Область СлужебныеПроцедурыИФункции

// См. ДолжностиБЗК.РеквизитыРедактируемыеВГрупповойОбработке.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеСведенияКлассификатора(ДолжностьОбъект, ДополнительныеСведения) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(ДолжностьОбъект, ПроверяемыеРеквизиты, Отказ) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаВвода");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ДатаИсключения");
	
КонецПроцедуры

Процедура ПередЗаписью(ДолжностьОбъект, Отказ) Экспорт
	
	// Базовая реализация отсутствует
	
КонецПроцедуры

#КонецОбласти
