#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Соответствие флага контроля проведения инструктажа пометке удаления.
	Если Не ЭтоНовый() И КонтролироватьПроведение И ПометкаУдаления Тогда
		ЗначенияРеквизитовДоЗаписи =
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления, КонтролироватьПроведение");
		Если Не ЗначенияРеквизитовДоЗаписи.ПометкаУдаления Тогда
			КонтролироватьПроведение = Ложь;
		ИначеЕсли Не ЗначенияРеквизитовДоЗаписи.КонтролироватьПроведение Тогда
			ПометкаУдаления = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ПроводитсяПовторно Тогда
		СтруктураПериода = Новый Структура("КоличествоРаз, КоличествоПериодов, Периодичность", КоличествоРаз, КоличествоПериодов, Периодичность);
		ПредставлениеПериода = ОхранаТруда.ПредставлениеПериодаПоСтруктуре(СтруктураПериода);
	Иначе
		ПредставлениеПериода = "Однократно";
		КоличествоРаз = 0;
		КоличествоПериодов = 0;
		Периодичность = Неопределено;
	КонецЕсли;
	
	ОбучениеПоОхранеТруда.ЗаполнитьРеквизитыТабличнойЧастиПоРабочимМестам(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли