#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ЗаполнитьНовыйОбъект();
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		ЗаполнитьПоПрофилюДолжности(ДанныеЗаполнения);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДанныеФормыСтруктура") Тогда
		ЗаполнитьПоДаннымФормы(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, 
		ПланируемаяДатаЗакрытия, "Объект.ПланируемаяДатаЗакрытия", Отказ, НСтр("ru = 'Дата закрытия'"), , , Ложь);
	
	ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты);
	ПроверитьЗаполнениеОписанияЗаявки(Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, нет ли зарегистрированных вакансий с параметрами заявки
	Если СпособНабора = Перечисления.СпособНабораПерсоналаНаВакансию.МассовыйНабор Тогда
		Если Справочники.Вакансии.ЕстьДругиеВакансииПоКомбинацииДолжностьПодразделение(Должность, Подразделение, Ссылка) Тогда
			ВызватьИсключение НСтр("ru = 'Существует вакансия с аналогичными должностью и подразделением.'");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьСостояниеСогласованияПоРежимуЗаписи(РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПрофилюДолжности(Профиль)
	
	ПрофильДолжности = Профиль;
	
	ПараметрыПолучения = Справочники.ПрофилиДолжностей.ПараметрыПолученияДанныхПрофиляДолжности();
	ПараметрыПолучения.ЭтапыРаботыСКандидатами = Истина;
	
	ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(Профиль, ПараметрыПолучения);
	
	// Попробуем подобрать позицию штатного расписания, если штатное расписание используется.
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьШтатноеРасписание") Тогда
		// Штатное расписание не используется, заполняем независимо от позиции подразделение и должность.
		Подразделение = ДанныеПрофиля.Подразделение;
	Иначе
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПозицииШтатногоРасписания.Ссылка,
			|	ПозицииШтатногоРасписания.Приоритет
			|ИЗ
			|	(ВЫБРАТЬ
			|		ШтатноеРасписание.Ссылка КАК Ссылка,
			|		1 КАК Приоритет
			|	ИЗ
			|		Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.СрезПоследних(, Позиция.Должность = &Должность) КАК МестоПозиции
			|			ПО (МестоПозиции.Позиция = ШтатноеРасписание.Ссылка)
			|				И (МестоПозиции.Подразделение = &Подразделение)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ШтатноеРасписание.Ссылка,
			|		2
			|	ИЗ
			|		Справочник.ШтатноеРасписание КАК ШтатноеРасписание
			|	ГДЕ
			|		ШтатноеРасписание.Должность = &Должность) КАК ПозицииШтатногоРасписания
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПозицииШтатногоРасписания.Приоритет";

		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Должность", ДанныеПрофиля.Должность);
		Запрос.УстановитьПараметр("Подразделение", ДанныеПрофиля.Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьПоПозицииШтатногоРасписания(Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеПрофиля.Свойство("ХарактеристикиПерсонала") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ХарактеристикиПерсонала, ХарактеристикиПерсонала);
	КонецЕсли;
	Если ДанныеПрофиля.Свойство("ДействияСотрудников") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ДействияСотрудников, ДействияСотрудников);
	КонецЕсли;
	
	Требования = ДанныеПрофиля.Требования;
	Обязанности = ДанныеПрофиля.Обязанности;
	Условия = ДанныеПрофиля.Условия;
	
	ЗарплатаОт = ДанныеПрофиля.ЗарплатаОт;
	ЗарплатаДо = ДанныеПрофиля.ЗарплатаДо;
	ВалютаЗарплаты = ДанныеПрофиля.ВалютаЗарплаты;
	ПериодичностьЗарплаты = ДанныеПрофиля.ПериодичностьЗарплаты;
	ТипЗанятости = ДанныеПрофиля.ТипЗанятости;
	РежимРаботы = ДанныеПрофиля.РежимРаботы;
	ИспытательныйСрок = ДанныеПрофиля.ИспытательныйСрок;
	
КонецПроцедуры

Процедура ЗаполнитьПоПозицииШтатногоРасписания(ПозицияШтатногоРасписания)
	
	Позиция = ПозицияШтатногоРасписания;
	
	ДанныеПозиции = Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(ПозицияШтатногоРасписания);
	
	Должность = ДанныеПозиции.Должность;
	Подразделение = ДанныеПозиции.МестоВСтруктуреПредприятия;
	ПредполагаемыйДоход = ДанныеПозиции.ФОТ;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПозиции(Отказ, ПроверяемыеРеквизиты)
	
	Если НазначениеНабора = Перечисления.НазначениеНабораПерсоналаНаВакансию.ДолжностьПодразделение Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Позиция");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДолжности(Отказ, ПроверяемыеРеквизиты)
	
	Если НоваяПозиция Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Должность");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОписанияЗаявки(Отказ, ПроверяемыеРеквизиты)
	
	Если СоответствуетПрофилюДолжности Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПрофильДолжности");
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Тогда
		ПроверяемыеРеквизиты.Добавить("ДействияСотрудников");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Требования");
		ПроверяемыеРеквизиты.Добавить("Обязанности");
		ПроверяемыеРеквизиты.Добавить("Условия");
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовыйОбъект() Экспорт
	
	Если Не Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ответственный, "ФизическоеЛицо");
	Если Не ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		Возврат;
	КонецЕсли;
	Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Период = ОбщегоНазначения.ТекущаяДатаПользователя();
	Сотрудник = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(ФизическоеЛицо, Организация, Период);
	ОтветственныйСобеседование = КадровыйУчет.ОсновнойСотрудникФизическогоЛица(ФизическоеЛицо, Организация, Период);
	
	Приоритет = ПредопределенноеЗначение("Перечисление.Приоритет.Средний");
	ДатаОткрытия = ТекущаяДатаСеанса();
	ПланируемаяДатаЗакрытия = ПодборПерсонала.ПланируемаяДатаЗакрытияПоУмолчанию(ДатаОткрытия);
	ВалютаЗарплаты = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	
КонецПроцедуры

Процедура УстановитьСостояниеСогласованияПоРежимуЗаписи(РежимЗаписи)

	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;

	Если Не Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СогласованиеВакансий.УстановитьСостояниеСогласования(Ссылка, Перечисления.СостоянияСогласования.Рассматривается);
	КонецЕсли;

	Если Проведен И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		СогласованиеВакансий.УстановитьСостояниеСогласования(Ссылка, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымФормы(Заявка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Заявка);
	Если ЭтоНовый() Тогда
		ЗаполнитьНовыйОбъект();
	КонецЕсли;
	
	Если Заявка.Свойство("ХарактеристикиПерсонала") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Заявка.ХарактеристикиПерсонала, ХарактеристикиПерсонала);
	КонецЕсли;
	
	Если Заявка.Свойство("ДействияСотрудников") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Заявка.ДействияСотрудников, ДействияСотрудников);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли