// @strict-types

#Область ПрограммныйИнтерфейс

// Установить и обновить на сервере 1С:Аналитика поставляемые панели.
Процедура УстановитьИОбновитьПанели() Экспорт

	ПанелиКУстановкеИОбновлению = 
		ИнтеграцияС1САналитикойВызовСервера.ПоставляемыеПанелиКонфигурацииКУстановкеИОбновлению();
		
	МинимальнаяВерсияАналитики = "";
	ТекущаяВерсияАналитикиАктуальна =
		ИнтеграцияС1САналитикойВызовСервера.ТекущаяВерсияАналитикиАктуальна(МинимальнаяВерсияАналитики);
		
	Если ПанелиКУстановкеИОбновлению["КУстановке"].Количество() = 0 
		И ПанелиКУстановкеИОбновлению["КОбновлению"].Количество() = 0 Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Отсутствуют поставляемые панели для установки или обновления в 1С:Аналитика.'"), 10, 
			НСтр("ru = 'Поставляемые панели 1С:Аналитика'"));
	ИначеЕсли Не ТекущаяВерсияАналитикиАктуальна Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Версия установленной системы 1С:Аналитика ниже чем минимально необходимая версия %1.
				|Для установки или обновления поставляемых панелей установите систему 1С:Аналитика подходящей версии.'"), МинимальнаяВерсияАналитики);	
		ПоказатьПредупреждение(, ТекстПредупреждения,, НСтр("ru = 'Минимальная версия 1С:Аналитика'"));
	Иначе
		ПараметрыВопроса = Новый Структура();
		ПараметрыВопроса.Вставить("ПанелиКУстановкеИОбновлению", ПанелиКУстановкеИОбновлению);
	
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПриПолученииОтветаНаВопросОПодтвержденииДействия", ЭтотОбъект, ПараметрыВопроса);
		
		ЗаголовокВопроса = НСтр("ru = 'Поставляемые панели 1С:Аналитика'");
		ТекстВопроса = НСтр("ru = 'Выполнить установку и обновление в 1С:Аналитика всех неустановленных или требующих обновления поставляемых панелей?'");
	
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Загрузить и обновить в 1С:Аналитика'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , Кнопки[0].Значение, ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Продолжение выполнения действий с поставляемыми панелями 
// на севере 1С:Аналитика после подтверждения пользователем.
// 
// Параметры:
//  Ответ - КодВозвратаДиалога - Ответ пользователя.
//  ДополнительныеПараметры 		- Структура - Дополнительные параметры:
//   * ПанелиКУстановкеИОбновлению - Структура - Макеты к установке и обновлению.
//
Процедура ПриПолученииОтветаНаВопросОПодтвержденииДействия(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьУстановкуИОбновлениеПанелей(ДополнительныеПараметры["ПанелиКУстановкеИОбновлению"]);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполнить установку и обновление панелей на сервере 1С:Аналитика.
// 
// Параметры:
//  ПанелиКУстановкеИОбновлению - См. ИнтеграцияС1САналитикой.ПоставляемыеПанелиКонфигурацииКУстановкеИОбновлению
//
Процедура ВыполнитьУстановкуИОбновлениеПанелей(ПанелиКУстановкеИОбновлению)

	УстановленныеПанели = Новый Массив;
	ОбновленныеПанели = Новый Массив;
	Ошибки = Неопределено;
	
	Если ПанелиКУстановкеИОбновлению.КУстановке.Количество() > 0 Тогда
		УстановленныеПанели = ИнтеграцияС1САналитикойВызовСервера.УстановитьОбновитьПоставляемыеПанели(
			ПанелиКУстановкеИОбновлению.КУстановке, Ошибки);
	КонецЕсли;
	
	Если ПанелиКУстановкеИОбновлению.КОбновлению.Количество() > 0 Тогда
		ОбновленныеПанели = ИнтеграцияС1САналитикойВызовСервера.УстановитьОбновитьПоставляемыеПанели(
			ПанелиКУстановкеИОбновлению.КОбновлению, Ошибки);
	КонецЕсли;
	
	Отказ = Ложь;
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если УстановленныеПанели.Количество() > 0
		ИЛИ ОбновленныеПанели.Количество() > 0 Тогда
		Оповестить("ОбновленСоставПанелейВАналитике");

		ПоказатьПредупреждение(,НСтр("ru = 'В состав панелей 1С:Аналитика включены поставляемые панели.
			|Для просмотра изменений, откройте 1С:Аналитика.'"), 10, НСтр("ru = 'Поставляемые панели 1С:Аналитика'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
