///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ИсходящийДокумент)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(ИсходящийДокумент)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьТипСообщенияРегистрации");
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// АПК:581-выкл. Методы могут вызываться из расширений.
// АПК:299-выкл. Методы могут вызываться из расширений.
// АПК:326-выкл. Методы поставляются комплектом и предназначены для совместного последовательного использования.
// АПК:325-выкл. Методы поставляются комплектом и предназначены для совместного последовательного использования.
// Транзакция открывается в методе НачатьЗаписьНабора, закрывается в ЗавершитьЗаписьНабора, отменяется в ОтменитьЗаписьНабора.

// Транзакционный вариант (с управляемой блокировкой) получения набора записей, соответствующего значениям измерений.
//
// Параметры:
//   ИсходящийДокумент - ДокументСсылка.ИсходящееСообщениеОСтраховомСлучаеФСС - Значение отбора по соответствующему измерению.
//
// Возвращаемое значение:
//   РегистрСведенийНаборЗаписей.РегистрацииОтветовНаЗапросыФССДляРасчетаПособия - Если удалось установить блокировку
//       и прочитать набор записей. При необходимости, открывает свою локальную транзакцию. Для закрытия транзакции
//       следует использовать одну из терминирующих процедур: ЗавершитьЗаписьНабора, либо ОтменитьЗаписьНабора.
//   Неопределено - Если не удалось установить блокировку и прочитать набор записей.
//       Вызывать процедуры ЗавершитьЗаписьНабора, ОтменитьЗаписьНабора не требуется,
//       поскольку если перед блокировкой функции потребовалось открыть локальную транзакцию,
//       то после неудачной блокировки локальная транзакция была отменена.
//
Функция НачатьЗаписьНабора(ИсходящийДокумент) Экспорт
	Если Не ЗначениеЗаполнено(ИсходящийДокумент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПолныеПраваИлиПривилегированныйРежим = Пользователи.ЭтоПолноправныйПользователь();
	Если Не ПолныеПраваИлиПривилегированныйРежим
		И Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Недостаточно прав для изменения регистра ""%1"".'"),
			Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.Представление());
	КонецЕсли;
	ЛокальнаяТранзакция = Не ТранзакцияАктивна();
	Если ЛокальнаяТранзакция Тогда
		НачатьТранзакцию();
	КонецЕсли;
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС");
		ЭлементБлокировки.УстановитьЗначение("ИсходящийДокумент", ИсходящийДокумент);
		Блокировка.Заблокировать();
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИсходящийДокумент.Установить(ИсходящийДокумент);
		НаборЗаписей.Прочитать();
		НаборЗаписей.ДополнительныеСвойства.Вставить("ЛокальнаяТранзакция", ЛокальнаяТранзакция);
	Исключение
		Если ЛокальнаяТранзакция Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось изменить регистрацию исходящего сообщения о стра для расчета пособия ФСС %1 по причине: %2'"),
			ИсходящийДокумент,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС,
			ИсходящийДокумент,
			ТекстСообщения);
		НаборЗаписей = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат НаборЗаписей;
КонецФункции

// Записывает набор и фиксирует локальную транзакцию, если она была открыта в функции НачатьЗаписьНабора.
//
// Параметры:
//   НаборЗаписей - РегистрСведенийНаборЗаписей.РегистрацииОтветовНаЗапросыФССДляРасчетаПособия
//
Процедура ЗавершитьЗаписьНабора(НаборЗаписей) Экспорт
	НаборЗаписей.Записать(Истина);
	ЛокальнаяТранзакция = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НаборЗаписей.ДополнительныеСвойства, "ЛокальнаяТранзакция");
	Если ЛокальнаяТранзакция = Истина Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
КонецПроцедуры

// Отменяет запись набора и отменяет локальную транзакцию, если она была открыта в функции НачатьЗаписьНабора.
//
// Параметры:
//   НаборЗаписей - РегистрСведенийНаборЗаписей.РегистрацииОтветовНаЗапросыФССДляРасчетаПособия
//
Процедура ОтменитьЗаписьНабора(НаборЗаписей) Экспорт
	ЛокальнаяТранзакция = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(НаборЗаписей.ДополнительныеСвойства, "ЛокальнаяТранзакция");
	Если ЛокальнаяТранзакция = Истина Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
КонецПроцедуры

// АПК:326-вкл.
// АПК:325-вкл.
// АПК:299-вкл.
// АПК:581-вкл.

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.38.91";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("f9ff397e-a3bc-4cec-b585-3f8ec19b078f");
	Обработчик.Процедура = "РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.ЗаполнитьТипСообщенияРегистрации";
	Обработчик.Комментарий = НСтр("ru = 'СЭДО ЕЦП: Заполнение типа сообщений в регистре ""Регистрации исходящих сообщений о страховых случаях СЭДО СФР"".'");
	
КонецПроцедуры

// Заполнение типа сообщений регистрации.
//
// Параметры:
//   ПараметрыОбновления - Структура - Параметры отложенного обновления.
//
Процедура ЗаполнитьТипСообщенияРегистрации(ПараметрыОбновления) Экспорт
	МетаданныеРегистра = Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС;
	СЭДОФСС.ЗаполнитьТипСообщенияРегистрации(ПараметрыОбновления, МетаданныеРегистра, 112);
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументу(ИсходящийДокументОбъект, РезультатОтправки = Неопределено) Экспорт
	// Регистрация является продолжением текущего документа.
	// Но если документ - новый, то поле "Ссылка" может быть не заполнено.
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = НачатьЗаписьНабора(ИсходящийДокументОбъект.Ссылка);
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	
	Запись.ИсходящийДокумент = ИсходящийДокументОбъект.Ссылка;
	Запись.ФизическоеЛицо    = ИсходящийДокументОбъект.ФизическоеЛицо;
	
	Если РезультатОтправки <> Неопределено Тогда
		Запись.Страхователь                = РезультатОтправки.Страхователь;
		Запись.ГоловнаяОрганизация         = РезультатОтправки.ГоловнаяОрганизация;
		Запись.ОтправленОператору          = РезультатОтправки.ОтправленоОператору;
		Запись.Доставлен                   = РезультатОтправки.ДоставленоФонду;
		Запись.ДатаОтправкиОператору       = РезультатОтправки.ДатаОтправкиОператору;
		Запись.ДатаОтправки                = РезультатОтправки.ДатаОтправкиФонду;
		Запись.ДоставкаТекстОшибки         = РезультатОтправки.ТекстОшибки;
		Запись.ДоставкаИдентификатор       = РезультатОтправки.ИдентификаторСообщения;
		Запись.ДоставкаИдентификаторПакета = РезультатОтправки.ИдентификаторПакета;
	КонецЕсли;
	
	ЗавершитьЗаписьНабора(Набор);
КонецПроцедуры

#Область СЭДО

Функция НайтиПоИдентификаторуСообщения(Страхователь, ИдентификаторСообщения, РезультатБРО) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Регистрация.ИсходящийДокумент КАК ИсходящийДокумент,
	|	Регистрация.Страхователь КАК Страхователь,
	|	Регистрация.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ИЗ
	|	РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС КАК Регистрация
	|ГДЕ
	|	Регистрация.ДоставкаИдентификатор = &ИдентификаторСообщения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистрация.ИсходящийДокумент,
	|	Регистрация.Страхователь,
	|	Регистрация.ГоловнаяОрганизация
	|ИЗ
	|	РегистрСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС КАК Регистрация
	|ГДЕ
	|	Регистрация.РегистрацияИдентификатор = &ИдентификаторСообщения";
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Таблица = Запрос.Выполнить().Выгрузить();
	Найденные = Таблица.Скопировать(Новый Структура("Страхователь", Страхователь));
	Если Найденные.Количество() = 0 Тогда
		ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Страхователь);
		Найденные = Таблица.Скопировать(Новый Структура("ГоловнаяОрганизация", ГоловнаяОрганизация));
		Если Найденные.Количество() = 0 Тогда
			Найденные = Таблица;
		КонецЕсли;
	КонецЕсли;
	Если Найденные.Количество() = 0 Тогда
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'По страхователю ""%1"" не найдена %2 с идентификатором сообщения ""%3""'"),
			Страхователь,
			Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС.ПредставлениеЗаписи,
			ИдентификаторСообщения);
		СЭДОФСС.ОшибкаОбработки(РезультатБРО, ТекстОшибки);
		РезультатБРО.Обработано = Истина; // Повторная обработка в этой ИБ не требуется.
	КонецЕсли;
	Возврат Найденные;
КонецФункции

Процедура ЗаполнитьПоРезультатуДоставки(ИсходящийДокумент, Сообщение) Экспорт
	Набор = НачатьЗаписьНабора(ИсходящийДокумент);
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		Запись.ИсходящийДокумент = ИсходящийДокумент;
	Иначе
		Запись = Набор[0];
	КонецЕсли;
	
	Запись.Доставлен           = Сообщение.ДоставленоФонду;
	Запись.ДатаОтправки        = Сообщение.ДатаОтправкиФонду;
	Запись.ДоставкаТекстОшибки = Сообщение.ТекстОшибки;
	
	ЗавершитьЗаписьНабора(Набор);
КонецПроцедуры

// Загружает ошибку логического контроля (тип 14) полученную в ответ на документ СЭДО 109.
Процедура ЗагрузитьОшибкуСообщения(ТипСообщения, Страхователь, ИдентификаторСообщения, ТекстОшибки, Результат) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таблица = НайтиПоИдентификаторуСообщения(Страхователь, ИдентификаторСообщения, Результат);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Набор = НачатьЗаписьНабора(СтрокаТаблицы.ИсходящийДокумент);
		Если Набор.Количество() = 0 Тогда
			ОтменитьЗаписьНабора(Набор);
			Продолжить;
		КонецЕсли;
		Запись = Набор[0];
		Если СтрНайти(Запись.ОшибкиЛогическогоКонтроля, ТекстОшибки) = 0 Тогда
			Если ПустаяСтрока(Запись.ОшибкиЛогическогоКонтроля) Тогда
				Запись.ОшибкиЛогическогоКонтроля = ТекстОшибки;
			Иначе
				Запись.ОшибкиЛогическогоКонтроля = Запись.ОшибкиЛогическогоКонтроля + Символы.ПС + Символы.ПС + ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		Запись.ЕстьОшибкиЛогическогоКонтроля = Истина;
		ЗавершитьЗаписьНабора(Набор);
	КонецЦикла;
КонецПроцедуры

// Загружает сообщение СЭДО 112, которое является ответом ФСС на сообщение 109.
Процедура ЗагрузитьСообщение(ТипСообщения, Страхователь, РегистрацияИдентификатор, ТекстXML, РезультатБРО, Кэш) Экспорт
	Если ТипСообщения = 112 Тогда
		ДанныеСообщения = ДанныеСообщения112(ТекстXML, РезультатБРО);
	ИначеЕсли ТипСообщения = 11210 Тогда
		ДанныеСообщения = ДанныеСообщения11210(ТекстXML, РезультатБРО);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неподдерживаемый тип сообщения: %1'"), ТипСообщения);
	КонецЕсли;
	Если ДанныеСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСообщения = СЭДОФСС.ДатаСообщения(РегистрацияИдентификатор, Кэш);
	ДоставкаИдентификатор = ДанныеСообщения.ДоставкаИдентификатор;
	РегистрацияДата = ДанныеСообщения.Дата;
	РегистрацияСтатус = ДанныеСообщения.Статус;
	РегистрацияНомерПроцесса = ДанныеСообщения.НомерПроцесса;
	РегистрацияПротокол = ДанныеСообщения.Протокол;
	РегистрацияВерсияСпецификации = ДанныеСообщения.ВерсияСпецификации;
	РегистрацияКодыОшибок = ДанныеСообщения.КодыОшибок;
	
	Если Не ЗначениеЗаполнено(РегистрацияДата) Тогда
		РегистрацияДата = ДатаСообщения;
	Иначе
		СЭДОФСС.ОбновитьДатуСообщения(РегистрацияДата, НачалоДня(РегистрацияДата), ДатаСообщения);
	КонецЕсли;
	
	СведенияОСтатусе = СведенияОСтатусеРегистрации(РегистрацияСтатус);
	Если Не ЗначениеЗаполнено(СведенияОСтатусе.Вес) Тогда
		РегистрацияПротокол = СокрЛП(СведенияОСтатусе.Расшифровка + Символы.ПС + Символы.ПС + РегистрацияПротокол);
		СЭДОФСС.ОшибкаОбработки(РезультатБРО, РегистрацияПротокол);
	КонецЕсли;
	
	ИсходящийДокумент = НайтиИсходящийДокумент(Страхователь, ДоставкаИдентификатор);
	Если Не ЗначениеЗаполнено(ИсходящийДокумент) Тогда
		ДокументПредставление = Метаданные.Документы.ИсходящееСообщениеОСтраховомСлучаеФСС.Представление();
		ТекстОшибки = НСтр("ru = 'Не удалось найти %1 с идентификатором ""%2""'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДокументПредставление, ДоставкаИдентификатор);
		ТекстОшибки = ТекстОшибки + Символы.ПС + Символы.ПС + НСтр("ru = 'Протокол:'") + Символы.ПС + РегистрацияПротокол;
		СЭДОФСС.ОшибкаОбработки(РезультатБРО, ТекстОшибки);
		РезультатБРО.Обработано = Истина; // Повторная обработка в этой ИБ не требуется.
		Возврат;
	КонецЕсли;
	
	Набор = НачатьЗаписьНабора(ИсходящийДокумент);
	Если Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ИсходящийДокумент);
		Запись.ИсходящийДокумент = ИсходящийДокумент;
	Иначе
		Запись = Набор[0];
		Если ЗначениеЗаполнено(Запись.РегистрацияСтатус)
			И РегистрацияИдентификатор <> Запись.РегистрацияИдентификатор Тогда
			СуществующийСтатус = СведенияОСтатусеРегистрации(Запись.РегистрацияСтатус);
			Если СведенияОСтатусе.Вес < СуществующийСтатус.Вес Тогда
				ОтменитьЗаписьНабора(Набор);
				Возврат; // Неактуальный (старый) статус.
			ИначеЕсли СведенияОСтатусе.Вес = СуществующийСтатус.Вес
				И РегистрацияДата < Запись.РегистрацияДата Тогда
				ОтменитьЗаписьНабора(Набор);
				Возврат; // Более старая регистрация.
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Запись.Зарегистрирован = СведенияОСтатусе.Зарегистрирован;
	Запись.РегистрацияДата = РегистрацияДата;
	Запись.РегистрацияСтатус = РегистрацияСтатус;
	Запись.РегистрацияПротокол = РегистрацияПротокол;
	Запись.РегистрацияИдентификатор = РегистрацияИдентификатор;
	Запись.РегистрацияТипСообщения = ТипСообщения;
	Запись.РегистрацияВерсияСпецификации = РегистрацияВерсияСпецификации;
	Запись.РегистрацияКодыОшибок = РегистрацияКодыОшибок;
	
	УстановитьЗначениеЕслиЗаполнено(Запись.РегистрацияНомерПроцесса, РегистрацияНомерПроцесса);
	
	ЗавершитьЗаписьНабора(Набор);
	
	РезультатБРО.Обработано = Истина;
КонецПроцедуры

Функция ДанныеСообщения112(ТекстXML, РезультатБРО)
	// Пример:
	//<n1:eventLifeResult xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:n1="urn:ru:fss:integration:types:information:EventLife:v01" responseOn="String" xsi:schemaLocation="urn:ru:fss:integration:types:information:EventLife:v01 EventLife.xsd">
	//	<n1:status>PROCESSED</n1:status>
	//</n1:eventLifeResult>
	
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	КореньDOM = СериализацияБЗК.НайтиУзелDOMПоИмени(СтруктураDOM, "eventLifeResult");
	Если КореньDOM = Неопределено Тогда
		КореньDOM = СериализацияБЗК.НайтиУзелDOM(СтруктураDOM, "//*[local-name() = 'status']/..");
	КонецЕсли;
	Если КореньDOM = Неопределено Тогда
		КореньDOM = СтруктураDOM.ДокументDOM;
	КонецЕсли;
	Если КореньDOM = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаУзла(РезультатБРО, "eventLifeResult");
		Возврат Неопределено;
	КонецЕсли;
	
	АтрибутыКорня = СериализацияБЗК.АтрибутыЭлементаDOM(КореньDOM, "responseOn");
	ДоставкаИдентификатор = АтрибутыКорня.responseOn;
	Если ДоставкаИдентификатор = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаАтрибута(РезультатБРО, "responseOn");
		Возврат Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(ДоставкаИдентификатор) Тогда
		СЭДОФСС.ЗаписатьОшибкуЗаполненностиАтрибута(РезультатБРО, "responseOn");
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыКорня = СериализацияБЗК.УзлыЭлементаDOM(КореньDOM, "socialAssistNum, status, errorList");
	
	КодыОшибок = Новый Массив;
	
	Результат = ПустыеДанныеСообщения();
	Результат.ДоставкаИдентификатор = ДоставкаИдентификатор;
	Результат.Статус = СериализацияБЗК.СтрокаИзXML(РеквизитыКорня.status);
	Результат.НомерПроцесса = СериализацияБЗК.ЧислоИзXML(РеквизитыКорня.socialAssistNum);
	Результат.Протокол = СЭДОФСС.ПредставлениеСпискаОшибокXML(РеквизитыКорня.errorList, , КодыОшибок);
	Результат.КодыОшибок = СтрСоединить(КоллекцииБЗК.СортироватьМассив(КодыОшибок), ",");
	
	Возврат Результат;
КонецФункции

Функция ДанныеСообщения11210(ТекстXML, РезультатБРО)
	СтруктураDOM = СериализацияБЗК.СтруктураDOM(ТекстXML);
	КореньDOM = СериализацияБЗК.НайтиУзелDOMПоИмени(СтруктураDOM, "eventLifeResult");
	Если КореньDOM = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаУзла(РезультатБРО, "eventLifeResult");
		Возврат Неопределено;
	КонецЕсли;
	
	АтрибутыКорня = СериализацияБЗК.АтрибутыЭлементаDOM(КореньDOM, "specVersion, responseOn, messageDateTime");
	// Номер версии спецификации для xml документа.
	РегистрацияВерсияСпецификации = СериализацияБЗК.СтрокаИзXML(АтрибутыКорня.specVersion);
	// Ссылка на транспортный идентификатор запроса (тип сообщения СЭДО №10910).
	ДоставкаИдентификатор = АтрибутыКорня.responseOn;
	// Дата и время формирования ответного сообщения на стороне СФР.
	РегистрацияДата = СериализацияБЗК.ДатаИзXML(АтрибутыКорня.messageDateTime);
	
	// Если идентификатор не заполнен, значит файл не соответствует схеме.
	Если ДоставкаИдентификатор = Неопределено Тогда
		СЭДОФСС.ЗаписатьОшибкуПоискаАтрибута(РезультатБРО, "responseOn");
		Возврат Неопределено;
	ИначеЕсли Не ЗначениеЗаполнено(ДоставкаИдентификатор) Тогда
		СЭДОФСС.ЗаписатьОшибкуЗаполненностиАтрибута(РезультатБРО, "responseOn");
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыКорня = СериализацияБЗК.УзлыЭлементаDOM(КореньDOM, "status, proactiveProcessNum, errorList, warnList");
	РегистрацияСтатус = СериализацияБЗК.СтрокаИзXML(РеквизитыКорня.status);
	РегистрацияНомерПроцесса = СериализацияБЗК.ЧислоИзXML(РеквизитыКорня.proactiveProcessNum);
	
	КодыОшибок = Новый Массив;
	// Информация об ошибках. Блок заполняется при статусе обработки "ERROR".
	ТекстыОшибок = СЭДОФСС.ПредставлениеСпискаОшибокXML(РеквизитыКорня.errorList, НСтр("ru = 'Ошибки'"), КодыОшибок);
	// Информация о предупреждениях форматно-логических контролей.
	ТекстыПредупреждений = СЭДОФСС.ПредставлениеСпискаОшибокXML(РеквизитыКорня.warnList, НСтр("ru = 'Предупреждения'"), КодыОшибок);
	
	Если ТекстыПредупреждений = "" Тогда
		РегистрацияПротокол = ТекстыОшибок;
	ИначеЕсли ТекстыОшибок = "" Тогда
		РегистрацияПротокол = ТекстыПредупреждений;
	Иначе
		РегистрацияПротокол = ТекстыОшибок + Символы.ПС + "----" + Символы.ПС + ТекстыПредупреждений;
	КонецЕсли;
	
	Результат = ПустыеДанныеСообщения();
	Результат.ВерсияСпецификации = РегистрацияВерсияСпецификации;
	Результат.ДоставкаИдентификатор = ДоставкаИдентификатор;
	Результат.Дата = РегистрацияДата;
	Результат.Статус = РегистрацияСтатус;
	Результат.НомерПроцесса = РегистрацияНомерПроцесса;
	Результат.Протокол = РегистрацияПротокол;
	Результат.КодыОшибок = СтрСоединить(КоллекцииБЗК.СортироватьМассив(КодыОшибок), ",");
	
	Возврат Результат;
КонецФункции

Функция ПустыеДанныеСообщения() Экспорт
	Возврат Новый Структура("ВерсияСпецификации, ДоставкаИдентификатор, Дата, Статус, НомерПроцесса,
		|Протокол, КодыОшибок");
КонецФункции

Процедура УстановитьЗначениеЕслиЗаполнено(ИзменяемоеЗначение, Значение)
	Если ЗначениеЗаполнено(Значение) Тогда
		ИзменяемоеЗначение = Значение;
	КонецЕсли;
КонецПроцедуры

Функция НайтиИсходящийДокумент(Страхователь, ИдентификаторСообщения)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НайденныйДокумент.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ИЗ
	|	Документ.ИсходящееСообщениеОСтраховомСлучаеФСС КАК НайденныйДокумент
	|ГДЕ
	|	НайденныйДокумент.ИдентификаторСообщения = &ИдентификаторСообщения
	|	И НайденныйДокумент.Страхователь = &Страхователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НайденныйДокумент.Ссылка,
	|	3
	|ИЗ
	|	Документ.ИсходящееСообщениеОСтраховомСлучаеФСС КАК НайденныйДокумент
	|ГДЕ
	|	НайденныйДокумент.ИдентификаторСообщения = &ИдентификаторСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Запрос.УстановитьПараметр("Страхователь", Страхователь);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция СведенияОСтатусеРегистрации(Статус) Экспорт
	Результат = Новый Структура("Вес, Зарегистрирован, Расшифровка");
	
	СтатусВРег = ВРег(СокрЛП(Статус));
	
	Если СтатусВРег = "RECEIVED" Тогда
		// Сообщение получено СФР, принято к обработке. Осуществляется проверка данных. Результат будет направлен дополнительно.
		Результат.Вес             = 1;
		Результат.Зарегистрирован = Истина;
		Результат.Расшифровка     = НСтр("ru = 'Принято Фондом'");
		
	ИначеЕсли СтатусВРег = "PROCESSED" Тогда
		// Сообщение успешно обработано.
		Результат.Вес             = 2;
		Результат.Зарегистрирован = Истина;
		Результат.Расшифровка     = НСтр("ru = 'Принято и успешно обработано Фондом'");
		
	ИначеЕсли СтатусВРег = "ERROR" Тогда
		// В процессе обработки сообщения были обнаружены ошибки форматно-логических контролей, блокирующие прием сообщения.
		Результат.Вес             = 3;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = НСтр("ru = 'Обнаружены ошибки, сообщение отклонено Фондом'");
		
	ИначеЕсли ЗначениеЗаполнено(Статус) Тогда
		Результат.Вес             = 0;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = СтрШаблон(НСтр("ru = 'Неизвестный статус: ""%1"". Несоответствие спецификации СЭДО: неизвестный ""status"" входящего сообщения типа 112.'"), Статус);
		
	Иначе
		Результат.Вес             = 0;
		Результат.Зарегистрирован = Ложь;
		Результат.Расшифровка     = НСтр("ru = 'Не заполнен статус регистрации. Несоответствие спецификации СЭДО: не заполнен ""status"" входящего сообщения типа 112.'");
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьСписокВыбораСтатусов(ПолеВвода, Статус) Экспорт
	СписокВыбора = ПолеВвода.СписокВыбора;
	Если СписокВыбора.Количество() = 0 Тогда
		Ключи = СтрРазделить("RECEIVED,PROCESSED,ERROR", ",");
		Для Каждого Ключ Из Ключи Цикл
			СведенияОСтатусе = СведенияОСтатусеРегистрации(Ключ);
			СписокВыбора.Добавить(Ключ, СведенияОСтатусе.Расшифровка + " (" + Ключ + ")");
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Статус) И СписокВыбора.НайтиПоЗначению(Статус) = Неопределено Тогда
		СведенияОСтатусе = СведенияОСтатусеРегистрации(Статус);
		СписокВыбора.Добавить(Статус, СведенияОСтатусе.Расшифровка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли