#Область ПрограммныйИнтерфейс

Функция ЭтоВыплатаЗарплаты(ДокументСсылка) Экспорт
	
	Возврат ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВБанк")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыВКассу")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыПеречислением")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплатыРаздатчиком");
		
КонецФункции

Функция НоваяТаблицаПлатежи() Экспорт
	
	ОписаниеТипаСумма = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Любой);
	
	Платежи = Новый ТаблицаЗначений;
	
	Платежи.Колонки.Добавить("ДатаПлатежа",           ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Платежи.Колонки.Добавить("Сумма",                 ОписаниеТипаСумма);
	Платежи.Колонки.Добавить("СуммаПлатежа",          ОбщегоНазначения.ОписаниеТипаСтрока(70));
	Платежи.Колонки.Добавить("Расшифровка",           ОбщегоНазначения.ОписаниеТипаСтрока(70));
	Платежи.Колонки.Добавить("НомерРаздела",          ОбщегоНазначения.ОписаниеТипаЧисло(1,, ДопустимыйЗнак.Неотрицательный));
	Платежи.Колонки.Добавить("Просрочен",             Новый ОписаниеТипов("Булево"));
	Платежи.Колонки.Добавить("Примечание",            ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Платежи.Колонки.Добавить("Организация",           Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Платежи.Колонки.Добавить("ЕстьПлатежныйДокумент", Новый ОписаниеТипов("Булево"));
	Платежи.Колонки.Добавить("ПлатежныйДокумент",     Новый ОписаниеТипов("ДокументСсылка.ПлатежноеПоручение"));
	Платежи.Колонки.Добавить("Документ");
	Платежи.Колонки.Добавить("ПараметрыКоманды");
	Платежи.Колонки.Добавить("РасшифровкаПлатежа");
	Платежи.Колонки.Добавить("Контрагент"); // Для группировки платежей в один день.
	
	Возврат Платежи;
	
КонецФункции

Функция ТаблицаСоответствияЗадачБухгалтера() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("ВидНалога", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыНалогов"));
	ТаблицаЗначений.Колонки.Добавить("КодЗадачи", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС, "НДС");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДС_ВвозимыеТовары, "КосвенныеНалогиТамСоюз");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_ФедеральныйБюджет,  "НалогНаПрибыль");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрибыль_РегиональныйБюджет, "НалогНаПрибыль");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрофессиональныйДоход, "НалогНаПрофессиональныйДоход");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородФедеральногоЗначения,              "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкруг,                         "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскойОкругСВнутригородскимДелением, "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_МуниципальныйОкруг,
		"ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ВнутригородскойОкруг,                   "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_МежселеннаяТерритория,                  "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_СельскоеПоселение,                      "ЗемельныйНалог");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЗемельныйНалог_ГородскоеПоселение,                     "ЗемельныйНалог");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ТранспортныйНалог, "ТранспортныйНалог");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ТорговыйСбор, "ТорговыйСбор");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмущество,     "НалогНаИмущество");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаИмуществоЕСГС, "НалогНаИмущество");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕНВД, "ЕНВД");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_Доходы,             "УСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_ДоходыМинусРасходы, "УСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.УСН_МинимальныйНалог,   "УСН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.АУСН, "АУСН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ИП,      "НДФЛ_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ФизЛицо, "НДФЛ_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ИП_НалоговаяБазаСвышеПредельнойВеличины,
		"НДФЛ_Предприниматель");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_ВнутригородскойРайон,                   "НалогПриПСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_МуниципальныйОкруг,
		"НалогПриПСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_ГородскойОкруг,                         "НалогПриПСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_ГородскойОкругСВнутригородскимДелением, "НалогПриПСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_ГородФедеральногоЗначения,              "НалогПриПСН");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ПСН_МуниципальныйРайон,                     "НалогПриПСН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕСХН, "ЕСХН");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_СтраховаяЧасть,      "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_НакопительнаяЧасть,  "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ПФР_Добровольные,        "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФФОМС,                   "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС,                     "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ФСС_НСиПЗ,               "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносыЕдиныйТариф,              "СтраховыеВзносы");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ОПС_ИностранныеРаботники, "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ОМС_ИностранныеРаботники, "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.СтраховыеВзносы_ОСС_ИностранныеРаботники, "СтраховыеВзносы");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ЛетныеЭкипажи,  "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_Шахтеры,        "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ВредныеУсловия, "СтраховыеВзносы");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ДополнительныеВзносы_ПФР_ТяжелыеУсловия, "СтраховыеВзносы");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_НакопительнаяЧасть,   "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_СтраховаяЧасть,       "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФФОМС,                    "СтраховыеВзносы_Предприниматель");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ФиксированныеВзносы_ФСС,                      "СтраховыеВзносы_Предприниматель");
	
	ДобавитьКодЗадачи(
		ТаблицаЗначений,
		Перечисления.ВидыНалогов.ФиксированныеВзносы_СтраховыеВзносыЕдиныйТариф,
		"СтраховыеВзносы_Предприниматель");

	ДобавитьКодЗадачи(
		ТаблицаЗначений,
		Перечисления.ВидыНалогов.ФиксированныеВзносы_ПФР_Добровольные,
		"СтраховыеВзносы_Предприниматель");
	
	ДобавитьКодЗадачи(
		ТаблицаЗначений,
		Перечисления.ВидыНалогов.ФиксированныеВзносы_СвышеПредела,
		"СтраховыеВзносы_Предприниматель");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ, "НДФЛ_Агент");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ, "Зарплата");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ, "НДФЛ_Агент_Уведомление");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины, "НДФЛ_Агент");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины, "Зарплата");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_ДоходыСвышеПредельнойВеличины, "НДФЛ_Агент_Уведомление");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_Дивиденды, "НДФЛ_Агент");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_Дивиденды, "Зарплата");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины, "Зарплата");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_Дивиденды, "НДФЛ_Агент_Уведомление");
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НДФЛ_Дивиденды_ДоходыСвышеПредельнойВеличины, "НДФЛ_Агент_Уведомление");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.НалогНаПрофессиональныйДоход, "НалогНаПрофессиональныйДоход");
	
	ДобавитьКодЗадачи(ТаблицаЗначений, Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж, "ЕдиныйНалоговыйСчет");
	
	Возврат ТаблицаЗначений;
	
КонецФункции

Процедура ЗаполнитьТаблицуСоответствияЗадачБухгалтераДляУведомлений(ВидыКодыНалогов) Экспорт
	
	ВидыКодыНалогов = ТаблицаСоответствияЗадачБухгалтера();
	
	КодыЗадачНеТребующихУведомлений = ВыполнениеЗадачБухгалтера.КодыЗадачПоНеобязательнымУведомлениям();
	
	// Среди задач есть такие, у которых добавлены подчиненные правила с действием Уведомление.
	// Но по ним сдавать уведомление не нужно. Поэтому исключим эти задачи из списка.
	КоличествоКодовНалогов = ВидыКодыНалогов.Количество();
	Для ИндексСКонца = 1 По КоличествоКодовНалогов Цикл
		ИндексСтроки = КоличествоКодовНалогов - ИндексСКонца;
		Если КодыЗадачНеТребующихУведомлений.Найти(ВидыКодыНалогов[ИндексСтроки].КодЗадачи) <> Неопределено Тогда
			ВидыКодыНалогов.Удалить(ИндексСтроки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьЭтоПравилоУплатыВзносовСДоходов
//
Процедура ПроверитьЭтоПравилоУплатыВзносовСДоходов(ЭтоПравилоУплатыВзносовСДоходов, Правило) Экспорт
	
	Если Не ЗначениеЗаполнено(Правило) Тогда
		Возврат;
	КонецЕсли;
	
	КодЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "Код");
	ЭтоПравилоУплатыВзносовСДоходов = (КодЗадачи = ВыполнениеЗадачБухгалтера.ИдентификаторПравилаСтраховыеВзносыИПСДоходов());
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизации
//
Процедура ЗаполнитьДоступныеОрганизации(ДоступныеОрганизации) Экспорт
	
	ДоступныеОрганизации.ЗагрузитьЗначения(ОрганизацииРазрешенныеПользователю());

КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДоступныеОрганизацииПоRLS
//
Процедура ЗаполнитьДоступныеОрганизацииПоRLS(ВсеОрганизации) Экспорт
	
	ВсеОрганизации = ОрганизацииРазрешенныеПользователю();

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииЗадачНовыхОрганизаций
//
Процедура ПриПолученииЗадачНовыхОрганизаций(ЗадачиОрганизаций) Экспорт
	
	НоваяЗадача = ЗадачиОрганизаций.Добавить();
	НоваяЗадача.Задача                    = Перечисления.ЗадачиНачалаРаботы.СписокНалоговОтчетов;
	НоваяЗадача.ОбособленноеПодразделение = Ложь;
	
	НоваяЗадача = ЗадачиОрганизаций.Добавить();
	НоваяЗадача.Задача                    = Перечисления.ЗадачиНачалаРаботы.СписокНалоговОтчетов;
	НоваяЗадача.ОбособленноеПодразделение = Истина;

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриПолученииТиповПравил
//
Процедура ПриПолученииТиповПравил(ТипыПравил) Экспорт
	
	ТипыПравил.Добавить(Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия"));
	ТипыПравил.Добавить(Тип("ДокументСсылка.ИзвещениеФСС"));
	ТипыПравил.Добавить(Тип("ДокументСсылка.ОтказВВозмещенииВыплатРодителямДетейИнвалидов"));
	ТипыПравил.Добавить(Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия"));
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ
//
Процедура СоздатьПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц, Организация, ОтборПравил) Экспорт
	
	Перем ОтборПоИмениЗадачи, ОтборПоДействию;
	
	ИдентификаторЗадачиЗарплата = "НДФЛ_Агент_Уплата";
	
	Если ТипЗнч(ОтборПравил) = Тип("Структура") Тогда
		ОтборПоИмениЗадачи = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборПравил, "ИмяЗадачи");
		ОтборПоДействию    = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОтборПравил, "Действие");
	КонецЕсли;
	
	Если (ЗначениеЗаполнено(ОтборПоИмениЗадачи) И ОтборПоИмениЗадачи <> ИдентификаторЗадачиЗарплата)
		ИЛИ (ЗначениеЗаполнено(ОтборПоДействию) И ОтборПоДействию <> Перечисления.ВидыДействийКалендаряБухгалтера.Зарплата) Тогда
		СоздатьПустоеПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИдентификаторЗадачи",                     ИдентификаторЗадачиЗарплата);
	Запрос.УстановитьПараметр("ИдентификаторПравилаЗарплата",            "НДФЛ_Уплата");
	Запрос.УстановитьПараметр("ИдентификаторПравилаАванс",               "Аванс");
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Правило,
	|	ВЫБОР
	|		КОГДА НастройкиЗарплатаКадры.ВыплачиватьЗарплатуВПоследнийДеньМесяца
	|			ТОГДА 0
	|		КОГДА НастройкиЗарплатаКадры.ДатаВыплатыЗарплатыНеПозжеЧем = 0
	|			ТОГДА 5
	|		ИНАЧЕ НастройкиЗарплатаКадры.ДатаВыплатыЗарплатыНеПозжеЧем
	|	КОНЕЦ КАК СрокДней,
	|	0 КАК СрокМесяцев
	|ПОМЕСТИТЬ ПравилоУплатыНДФЛНалоговымАгентом
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО ЗадачиБухгалтера.Ссылка = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЗарплатаКадрыРасширенная КАК НастройкиЗарплатаКадры
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЗадачиБухгалтера.Код = &ИдентификаторЗадачи
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Код = &ИдентификаторПравилаЗарплата
	|	И НастройкиЗарплатаКадры.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка,
	|	ВЫБОР
	|		КОГДА НастройкиЗарплатаКадры.ДатаВыплатыАвансаНеПозжеЧем = 0
	|			ТОГДА 20
	|		ИНАЧЕ НастройкиЗарплатаКадры.ДатаВыплатыАвансаНеПозжеЧем
	|	КОНЕЦ,
	|	-1
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ПО ЗадачиБухгалтера.Ссылка = ПравилаПредставленияОтчетовУплатыНалогов.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиЗарплатаКадрыРасширенная КАК НастройкиЗарплатаКадры
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЗадачиБухгалтера.Код = &ИдентификаторЗадачи
	|	И ПравилаПредставленияОтчетовУплатыНалогов.Код = &ИдентификаторПравилаАванс
	|	И НастройкиЗарплатаКадры.Организация = &Организация";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.СоздатьПравилаУплатыНалоговНаМестах
//
Процедура СоздатьПравилаУплатыНалоговНаМестах(МенеджерВременныхТаблиц, Организация, ИмяЗадачи = "", ТекущийПериод = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОсновнойНалоговыйОрган", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "РегистрацияВНалоговомОргане"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ПравилаПредставленияОтчетовУплатыНалогов.ПустаяСсылка) КАК Правило,
	|	ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка) КАК РегистрацияВНалоговомОргане,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодДействияПравила,
	|	ИСТИНА КАК Включено,
	|	0 КАК СрокМесяцев,
	|	0 КАК СрокДней,
	|	"""" КАК ОграничениеПериода
	|ПОМЕСТИТЬ ПравилаУплатыНалоговНаМестах
	|ГДЕ
	|	ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило,
	|	ПериодДействияПравила";
	Запрос.Выполнить();

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.УстановитьОтборПоОсновнойОрганизации
//
Процедура УстановитьОтборПоОсновнойОрганизации(Форма, ИмяСписка = "Список", ИмяРеквизита = "Организация", ЗначениеОтбора = Неопределено) Экспорт
	
	Если Не РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		
		Если Форма.Параметры.Свойство("Отбор") И Форма.Параметры.Отбор.Свойство(ИмяРеквизита) Тогда
			// Если значение отбора передается в параметрах формы - берем его оттуда, параметр при этом удаляем.
			ОсновнаяОрганизация = Форма.Параметры.Отбор[ИмяРеквизита];
			Форма.Параметры.Отбор.Удалить(ИмяРеквизита);
		ИначеЕсли ТипЗнч(ЗначениеОтбора) = Тип("СправочникСсылка.Организации") 
			ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") 
			ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("Массив") Тогда
			ОсновнаяОрганизация = ЗначениеОтбора;
		Иначе
			ОсновнаяОрганизация = РегламентированнаяОтчетность.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		КонецЕсли;
		
		Если ТипЗнч(ОсновнаяОрганизация) = Тип("СправочникСсылка.Организации") Тогда
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
		Иначе
			ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли;
		
		ИспользованиеОтбора = ЗначениеЗаполнено(ОсновнаяОрганизация);
		
		РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		
	Иначе
		
		ОсновнаяОрганизация = Справочники.Организации.ПустаяСсылка();
		ВидСравненияОтбора  = ВидСравненияКомпоновкиДанных.Равно;
		ИспользованиеОтбора = Ложь;
		РежимОтображения    = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Форма[ИмяСписка].КомпоновщикНастроек.Настройки.Отбор, ИмяРеквизита);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма[ИмяСписка], ИмяРеквизита, ОсновнаяОрганизация, ВидСравненияОтбора, , ИспользованиеОтбора, РежимОтображения);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьДанныеЗаполненияПриОднофирменномУчете
//
Процедура ДополнитьДанныеЗаполненияПриОднофирменномУчете(ДанныеЗаполнения, ИмяРеквизитаОрганизация) Экспорт
	
	Если Не РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация() Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ДанныеЗаполнения = Новый Структура;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство(ИмяРеквизитаОрганизация) Тогда
		ОрганизацияПоУмолчанию = РегламентированнаяОтчетность.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		ДанныеЗаполнения.Вставить(ИмяРеквизитаОрганизация, ОрганизацияПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПравоРедактированияНалогиОтчеты
//
Процедура ПроверитьПравоРедактированияНалогиОтчеты(Право) Экспорт
	
	Право = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НалогиОтчеты)
		И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВариантыПримененияТребованийЗаконодательства);
		
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДополнитьЗапросПриПолученииАктуальныхПравил
//
Процедура ДополнитьЗапросПриПолученииАктуальныхПравил(Запрос, ТекстЗапроса) Экспорт
	
	МассивДоступныхДействий = Новый Массив;
	ПолучитьДоступныеВидыДействийКалендаряБухгалтера(МассивДоступныхДействий);
	
	Запрос.УстановитьПараметр("МассивДоступныхДействий", МассивДоступныхДействий);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПереопределяемое", "Действие В (&МассивДоступныхДействий)");
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьКорректностьЗагружаемогоТребования
//
Процедура ПроверитьКорректностьЗагружаемогоТребования(Некорректное, КорректныеИдентификаторы, МассивДоступныхДействий, ИдентификаторЗадачи, ИдентификаторТребования, Действие) Экспорт
	
	Если МассивДоступныхДействий.Найти(Действие) = Неопределено Тогда
		Некорректное = Истина;
	ИначеЕсли Действие = Перечисления.ВидыДействийКалендаряБухгалтера.Отчет Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторТребования", ВРег(ИдентификаторТребования));
		Отбор.Вставить("ИдентификаторЗадачи",  ВРег(ИдентификаторЗадачи));
		КорректныеСтроки = КорректныеИдентификаторы.НайтиСтроки(Отбор);
		
		Если КорректныеСтроки.Количество() = 0 Тогда
			Некорректное = Истина;
		КонецЕсли;
	ИначеЕсли Действие = Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога Тогда
		Если ИдентификаторЗадачи <> "Подготовка_Данных_НДФЛ_Взносы" Тогда
			Некорректное = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадачНастройка
//
Процедура ПриСозданииНаСервереСписокЗадачНастройка(Форма) Экспорт
	
	Форма.Элементы.НалогиИОтчетыПодсказка.Заголовок = НСтр("ru = 'Настройте особенности специфических налогов и отчетов - это определяет состав задач организации'");
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриСозданииНаСервереСписокЗадач
//
Процедура ПриСозданииНаСервереСписокЗадач(Форма) Экспорт
	
	Форма.Элементы.Организация.Видимость =
		ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
		
	Форма.Элементы.ОрганизацияПредставление.Видимость =
		ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПроверитьПоддерживается1СФинОтчетность
//
Процедура ПроверитьПоддерживается1СФинОтчетность(Поддерживается1СФинОтчетность) Экспорт
	
	// Данная конфигурация не поддерживает 1С:ФинОтчетность
	Поддерживается1СФинОтчетность = Ложь;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ВосстановитьОтборСписка
//
Процедура ВосстановитьОтборСписка(Список, Настройки, ИмяОтбора) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Отборы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор, ИмяОтбора);
	
	Если Отборы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементОтбора = Отборы[0];
	ИдентификаторНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
	
	Для каждого ЭлементНастроек Из Настройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("ЭлементОтбораКомпоновкиДанных") 
			И ЭлементНастроек.ИдентификаторПользовательскойНастройки = ИдентификаторНастройки Тогда
			ЭлементНастроек.ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
			ЭлементНастроек.Использование  = ЭлементОтбора.Использование;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьУсловияПримененияПравил
//
Процедура ЗаполнитьУсловияПримененияПравил(Условия, Организация, НачалоПериода, КонецПериода) Экспорт
	
	Условия.Вставить("ИспользуетсяТрудНаемныхРаботников", ИспользуетсяТрудНаемныхРаботников(Организация));
	Условия.Вставить("КадровыеМероприятия", КадровыеМероприятияЗаПериод(Организация, НачалоПериода, КонецПериода));
	Условия.Вставить("ПериодыВыплатыЗарплаты", ПериодыВыплатыЗарплаты(Организация, НачалоПериода, КонецПериода));

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ДобавитьОформляемоеПоле
//
Процедура ДобавитьОформляемоеПоле(КоллекцияОформляемыхПолей, ИмяПоля) Экспорт
	
	ПолеЭлемента 		= КоллекцияОформляемыхПолей.Элементы.Добавить();
	ПолеЭлемента.Поле 	= Новый ПолеКомпоновкиДанных(ИмяПоля);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьСтруктуруИзРезультатаЗапроса
//
Процедура ПолучитьСтруктуруИзРезультатаЗапроса(СтруктураПараметров, РезультатЗапроса) Экспорт
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Для каждого КолонкаРезультата Из РезультатЗапроса.Колонки Цикл
		СтруктураПараметров.Вставить(КолонкаРезультата.Имя, Выборка[КолонкаРезультата.Имя]);
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьБаннерНаСервере
//
Процедура ПолучитьБаннерНаСервере(РезультатПолученияБаннера, СторонниеСертификаты, ПоказатьПредыдущий, Форма) Экспорт
	
	РезультатПолученияБаннера = Неопределено;
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьПравоВыполненияЗадачи
//
Процедура ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача) Экспорт
	
	Если ТипЗнч(Задача) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если Задача = Перечисления.ЗадачиНачалаРаботы.СписокНалоговОтчетов Тогда
			
			ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НалогиОтчеты);
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики Тогда
			
			ЕстьПраво = Ложь;
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.Подключение1СОтчетности Тогда
			
			ЕстьПраво = ПравоДоступа("Использование", Метаданные.Обработки.ОбщиеОбъектыРеглОтчетности);
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.Подключение1СЭДО Тогда
			
			ЕстьПраво = Ложь;
			Если Не ЕстьПраво Тогда
				
				ТекстСообщения = НСтр("ru = 'Недостаточно прав для настройки обмена электронными документами. Обратитесь к администратору.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.ОплатитьЗадолженностьПоНалогамВзносам Тогда
			
			ЕстьПраво = Ложь;
			
		ИначеЕсли Задача = Перечисления.ЗадачиНачалаРаботы.УказатьДатуПрекращенияДеятельности Тогда
			
			ЕстьПраво = Ложь;
			
		КонецЕсли;
			
	Иначе
		
		ЕстьПраво = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ЗадачиБухгалтера);
		
	КонецЕсли;
	
КонецПроцедуры 

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ЗаполнитьСобытияКалендаряБухгалтера
//
Процедура ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач) Экспорт
	
	ТаблицаСтатусовВыполненныхЗадач = Новый ТаблицаЗначений();
	ТаблицаСтатусовВыполненныхЗадач.Колонки.Добавить("Статус", Метаданные.РегистрыСведений.ЗадачиБухгалтера.Ресурсы.Статус.Тип);
	Для Каждого Статус Из ВыполнениеЗадачБухгалтера.СтатусыВыполненныхЗадач() Цикл
		ТаблицаСтатусовВыполненныхЗадач.Добавить().Статус = Статус;
	КонецЦикла;
	
	ДатаНачалаСобытий = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаСобытий",                      ДатаНачалаСобытий);
	Запрос.УстановитьПараметр("СписокОрганизаций",                      Организации);
	Запрос.УстановитьПараметр("СтатусыВыполненныхЗадач",                ТаблицаСтатусовВыполненныхЗадач);
	Запрос.УстановитьПараметр("ВыбиратьЗадачиОтчетностиИУплатыНалогов", ОтборЗадач.ЗадачиОтчетностиИУплатыНалогов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыВыполненныхЗадач.Статус КАК Статус
	|ПОМЕСТИТЬ СтатусыВыполненныхЗадач
	|ИЗ
	|	&СтатусыВыполненныхЗадач КАК СтатусыВыполненныхЗадач
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	ЗадачиБухгалтера.ПериодСобытия КАК ПериодСобытия,
	|	ЗадачиБухгалтера.ВАрхиве КАК ВАрхиве,
	|	ВЫБОР
	|		КОГДА СтатусыВыполненныхЗадач.Статус ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Выполнено,
	|	ЗадачиБухгалтера.Срок КАК Срок,
	|	ЗадачиБухгалтера.НаименованиеСокращенное КАК Наименование,
	|	ЗадачиБухгалтера.Наименование КАК НаименованиеПолное,
	|	ЗадачиБухгалтера.Организация КАК Организация,
	|	ЗадачиБухгалтера.ХешЗадачи КАК ХешЗадачи,
	|	ЗадачиБухгалтера.Действие КАК Действие
	|ПОМЕСТИТЬ ВТ_АктуальныеЗадачи
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатусыВыполненныхЗадач КАК СтатусыВыполненныхЗадач
	|		ПО (СтатусыВыполненныхЗадач.Статус = ЗадачиБухгалтера.Статус)
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
	|	И ЗадачиБухгалтера.Срок >= &ДатаНачалаСобытий
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_АктуальныеЗадачи.Организация КАК Организация,
	|	ВТ_АктуальныеЗадачи.Срок КАК Срок,
	|	ВТ_АктуальныеЗадачи.ХешЗадачи КАК ХешЗадачи,
	|	Требования.Владелец.Наименование КАК Наименование,
	|	ВТ_АктуальныеЗадачи.НаименованиеПолное КАК НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ДействиеПорядок,
	|	Требования.Владелец.Ссылка КАК Задача,
	|	ВТ_АктуальныеЗадачи.Выполнено КАК Выполнено,
	|	ВТ_АктуальныеЗадачи.ВАрхиве КАК ВАрхиве,
	|	Требования.ОтправкаОтчетаОграничена КАК ОтправкаОтчетаОграничена,
	|	ВТ_АктуальныеЗадачи.Действие КАК Действие
	|ИЗ
	|	ВТ_АктуальныеЗадачи КАК ВТ_АктуальныеЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ВТ_АктуальныеЗадачи.Правило = Требования.Ссылка
	|ГДЕ
	|	НЕ Требования.ПометкаУдаления
	|	И &ВыбиратьЗадачиОтчетностиИУплатыНалогов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Срок,
	|	Наименование,
	|	ДействиеПорядок
	|ИТОГИ
	|	МИНИМУМ(ДействиеПорядок),
	|	МИНИМУМ(Выполнено)
	|ПО
	|	Организация,
	|	Срок,
	|	Наименование";
	
	Результат = Запрос.Выполнить();
	
	ПодключенаОтправка = Неопределено; // эта проверка относительно затратная, поэтому выполним ее по месту и закешируем
	ТекстОграниченияОтправкиОтчета = ИнтерфейсыВзаимодействияБРОКлиентСервер.КраткоеПредставлениеОграниченияОтправкиОтчета();
	ТекстОграниченияОтправкиОтчета = СтрШаблон(
		НСтр("ru = 'Внимание! %1'"),
		ТекстОграниченияОтправкиОтчета);
	
	ВыборкаПоОрганизации = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
	Пока ВыборкаПоОрганизации.Следующий() Цикл
		
		СписокЗадач = КалендарьБухгалтера.НовыйСписокЗадач();
		
		ВыборкаПоСроку = ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Срок");
		Пока ВыборкаПоСроку.Следующий() Цикл
			
			ВыборкаПоЗадаче = ВыборкаПоСроку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Наименование");
			Пока ВыборкаПоЗадаче.Следующий() Цикл
				
				Задача = СписокЗадач.Добавить();
				НаименованиеЗадачи = ВРег(Лев(ВыборкаПоЗадаче.Наименование, 1)) + Сред(ВыборкаПоЗадаче.Наименование, 2);
				Задача.Наименование = НаименованиеЗадачи;
				Задача.ДатаЗадачи   = ВыборкаПоЗадаче.Срок;
				Задача.Выполнено    = ВыборкаПоЗадаче.Выполнено;
				
				Выборка = ВыборкаПоЗадаче.Выбрать(ОбходРезультатаЗапроса.Прямой);
				Пока Выборка.Следующий() Цикл
					
					ОписаниеПодзадачи = КалендарьБухгалтера.НовыйОписаниеПодзадачиСобытия();
					ОписаниеПодзадачи.Идентификатор = Выборка.ХешЗадачи;
					ОписаниеПодзадачи.Наименование = Выборка.НаименованиеПолное;
					ОписаниеПодзадачи.ВАрхиве = Выборка.ВАрхиве;
					ОписаниеПодзадачи.Выполнено = Выборка.Выполнено;
					
					Если Выборка.ОтправкаОтчетаОграничена Тогда
						
						Если ПодключенаОтправка = Неопределено Тогда
							ПодключенаОтправка = ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом();
						КонецЕсли;
						
						Если ПодключенаОтправка Тогда
							ОписаниеПодзадачи.Наименование =
								ОписаниеПодзадачи.Наименование + Символы.ПС + ТекстОграниченияОтправкиОтчета;
						КонецЕсли;
						
					КонецЕсли;
					
					Задача.Подзадачи.Добавить(ОписаниеПодзадачи);
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
		ЗадачиОрганизаций.Вставить(ВыборкаПоОрганизации.Организация, СписокЗадач);
		
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДанныеЗадачиБухгалтера
//
Процедура ПолучитьДанныеЗадачиБухгалтера(Данные, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера
//
Процедура ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач) Экспорт
	
	ДатаПросроченных = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПросроченных", ДатаПросроченных);
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("СтатусыВыполненныхЗадач", ВыполнениеЗадачБухгалтера.СтатусыВыполненныхЗадач());
	Запрос.УстановитьПараметр("ВыбиратьЗадачиОтчетностиИУплатыНалогов", ОтборЗадач.ЗадачиОтчетностиИУплатыНалогов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	ЗадачиБухгалтера.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ПросроченныеЗадачи
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&СписокОрганизаций)
	|	И НЕ ЗадачиБухгалтера.ВАрхиве
	|	И ЗадачиБухгалтера.Срок < &ДатаПросроченных
	|	И НЕ ЗадачиБухгалтера.Статус В (&СтатусыВыполненныхЗадач)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Правило
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПросроченныеЗадачи.Организация КАК Организация,
	|	КОЛИЧЕСТВО(ВТ_ПросроченныеЗадачи.Правило) КАК Количество
	|ИЗ
	|	ВТ_ПросроченныеЗадачи КАК ВТ_ПросроченныеЗадачи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ВТ_ПросроченныеЗадачи.Правило = Требования.Ссылка
	|ГДЕ
	|	НЕ Требования.ПометкаУдаления
	|	И &ВыбиратьЗадачиОтчетностиИУплатыНалогов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПросроченныеЗадачи.Организация";
	
	ТаблицаПросроченных = Запрос.Выполнить().Выгрузить();
	ТаблицаПросроченных.Свернуть("Организация", "Количество");
	
	Для Каждого СтрокаПросроченного Из ТаблицаПросроченных Цикл
		КоличествоПросроченных.Вставить(СтрокаПросроченного.Организация, СтрокаПросроченного.Количество);
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю
//
Процедура ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение, Пользователь) Экспорт
	
	ДоступныеОрганизации = ОрганизацииДанныеКоторыхДоступныПользователю("РегистрСведений.ЗадачиБухгалтера", ПравоНаИзменение, Пользователь);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуНачалаДеятельности
//
Процедура ПолучитьДатуНачалаДеятельности(Дата, Организация) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Дата = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -12));
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПереопределяемый.ПолучитьДатуПостановкиНаУчетНалогоплательщика
//
Процедура ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода) Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	Дата = НачалоМесяца(ДобавитьМесяц(ТекущаяДата, -12));
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииСтатусовЗадачПоДокументамСЭДО
//
Процедура ПриОпределенииСтатусовЗадачПоДокументамСЭДО(ТаблицаЗадач, ЗадачиСоСтатусами, Запрос) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Организация КАК Организация,
	|	Задачи.ПериодСобытия КАК ПериодСобытия,
	|	Задачи.Правило КАК Правило
	|ПОМЕСТИТЬ ЗадачиДокументыСЭДО
	|ИЗ
	|	&Задачи КАК Задачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗадачиДокументыСЭДО.Организация КАК Организация,
	|	ЗадачиДокументыСЭДО.ПериодСобытия КАК ПериодСобытия,
	|	ЗадачиДокументыСЭДО.Правило КАК Правило,
	|	ВЫБОР
	|		КОГДА ВходящийЗапросФССДляРасчетаПособия.Обработан
	|			ТОГДА &СтатусОтветОтправлен
	|		КОГДА НЕ ВходящийЗапросФССДляРасчетаПособия.Загружен
	|			ТОГДА &СтатусРасшифровать
	|		КОГДА ВходящийЗапросФССДляРасчетаПособия.Загружен
	|			ТОГДА &СтатусОтправьтеОтвет
	|		КОГДА ИзвещениеФСС.Обработано
	|			ТОГДА &СтатусОтветОтправлен
	|		КОГДА НЕ ИзвещениеФСС.Загружено
	|			ТОГДА &СтатусРасшифровать
	|		КОГДА ИзвещениеФСС.Загружено
	|				И (НЕ ИзвещениеФСС.ПодтверждениеПолученоФСС
	|					ИЛИ ИзвещениеФСС.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА &СтатусПодтвердитеПрием
	|		КОГДА ИзвещениеФСС.Загружено
	|			ТОГДА &СтатусОтправьтеОтвет
	|		КОГДА НЕ ОтказВВозмещенииВыплат.Загружен
	|			ТОГДА &СтатусРасшифровать
	|		КОГДА ОтказВВозмещенииВыплат.Загружен
	|				И (НЕ ОтказВВозмещенииВыплат.ПодтверждениеПолученоСФР
	|					ИЛИ ОтказВВозмещенииВыплат.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА &СтатусПодтвердитеПрием
	|		КОГДА ОтказВВозмещенииВыплат.Обработан
	|				ИЛИ ОтказВВозмещенииВыплат.Загружен
	|			ТОГДА &СтатусПриемПодтвержден
	|		КОГДА ОтказВВозмещенииВыплат.Загружен
	|			ТОГДА &СтатусОтправьтеОтвет
	|		КОГДА НЕ УведомлениеОСтатусеВыплатыПособия.Загружен
	|			ТОГДА &СтатусРасшифровать
	|		КОГДА УведомлениеОСтатусеВыплатыПособия.Загружен
	|				И (НЕ УведомлениеОСтатусеВыплатыПособия.ПодтверждениеПолученоСФР
	|					ИЛИ УведомлениеОСтатусеВыплатыПособия.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА &СтатусПодтвердитеПрием
	|		КОГДА УведомлениеОСтатусеВыплатыПособия.Обработан
	|				ИЛИ УведомлениеОСтатусеВыплатыПособия.Загружен
	|			ТОГДА &СтатусПриемПодтвержден
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Статус
	|ИЗ
	|	ЗадачиДокументыСЭДО КАК ЗадачиДокументыСЭДО
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВходящийЗапросФССДляРасчетаПособия КАК ВходящийЗапросФССДляРасчетаПособия
	|		ПО ЗадачиДокументыСЭДО.Правило = ВходящийЗапросФССДляРасчетаПособия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзвещениеФСС КАК ИзвещениеФСС
	|		ПО ЗадачиДокументыСЭДО.Правило = ИзвещениеФСС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов КАК ОтказВВозмещенииВыплат
	|		ПО ЗадачиДокументыСЭДО.Правило = ОтказВВозмещенииВыплат.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УведомлениеОСтатусеВыплатыПособия КАК УведомлениеОСтатусеВыплатыПособия
	|		ПО ЗадачиДокументыСЭДО.Правило = УведомлениеОСтатусеВыплатыПособия.Ссылка";
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьЭтоДокументСЗВ_ТД
//
Процедура ОпределитьЭтоДокументСЗВ_ТД(ЭтоДокументСЗВ_ТД, Документ) Экспорт
	
	ЭтоДокументСЗВ_ТД = (ТипЗнч(Документ) = Тип("ДокументСсылка.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД"));

КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриОпределенииТиповПравила
//
Процедура ПриОпределенииСпискаТиповПравила(СписокТипов) Экспорт
	
	СписокТипов.Добавить(Тип("ДокументСсылка.ВходящийЗапросФССДляРасчетаПособия"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ИзвещениеФСС"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ОтказВВозмещенииВыплатРодителямДетейИнвалидов"));
	СписокТипов.Добавить(Тип("ДокументСсылка.УведомлениеОСтатусеВыплатыПособия"));
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриУстановкеТекстаЗапросаДанныеПриложения
//
Процедура ПриУстановкеТекстаЗапросаДанныеПриложения(ТекстЗапроса) Экспорт
	
	ПодстрокаПоиска = "Расписание.Правило.Код КАК ИдентификаторПравила";
	ПодстрокаЗамены = "ВЫБОР
	|	КОГДА Расписание.Правило ССЫЛКА Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов
	|		ТОГДА Расписание.НаименованиеЗадачи
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ТранспортноеСообщение
	|		ТОГДА ""Транспортное сообщение""
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ВходящийЗапросФССДляРасчетаПособия
	|		ТОГДА ""ВходящийЗапросФССДляРасчетаПособия""
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ИзвещениеФСС
	|		ТОГДА ""ИзвещениеФСС""
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов
	|		ТОГДА ""ОтказВВозмещенииВыплатРодителямДетейИнвалидов""
	|	КОГДА Расписание.Правило ССЫЛКА Документ.УведомлениеОСтатусеВыплатыПособия
	|		ТОГДА ""УведомлениеОСтатусеВыплатыПособия""
	|	ИНАЧЕ Расписание.Правило.Код
	|КОНЕЦ КАК ИдентификаторПравила";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	ПодстрокаПоиска = "ЕСТЬNULL(Расписание.Правило.Владелец.Код, """") КАК КодНалога";
	ПодстрокаЗамены = "ВЫБОР
	|	КОГДА Расписание.Правило ССЫЛКА Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов
	|			ИЛИ Расписание.Правило ССЫЛКА Документ.ТранспортноеСообщение
	|		ТОГДА &КодНалогаТребованиеФНС
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ВходящийЗапросФССДляРасчетаПособия ТОГДА
	|		&КодЗадачиДокументСЭДО
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ИзвещениеФСС ТОГДА
	|		&КодЗадачиДокументСЭДО
	|	КОГДА Расписание.Правило ССЫЛКА Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов ТОГДА
	|		&КодЗадачиДокументСЭДО
	|	КОГДА Расписание.Правило ССЫЛКА Документ.УведомлениеОСтатусеВыплатыПособия ТОГДА
	|		&КодЗадачиДокументСЭДО
	|	ИНАЧЕ ЕСТЬNULL(Расписание.Правило.Владелец.Код, """")
	|КОНЕЦ КАК КодНалога";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
		
	ПодстрокаПоиска = 
	"ВЫБОР КОГДА ЗадачиБухгалтера.Статус = """" ТОГДА
	|			ЕСТЬNULL(ДанныеПлатежей.Статус, """")
	|		ИНАЧЕ
	|			ЗадачиБухгалтера.Статус
	|		КОНЕЦ";
	ПодстрокаЗамены = "ДанныеПлатежей.Статус";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
	ПодстрокаПоиска = "Расписание.Организация.КПП КАК КПП";
	ПодстрокаЗамены = """"" КАК КПП";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ПодстрокаПоиска, ПодстрокаЗамены);
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ПриЗаполненииНаименованияОрганизацииОблачногоПриложения
//
Процедура ПриЗаполненииНаименованияОрганизацииОблачногоПриложения(Организация, Наименование) Экспорт
	
	Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");

КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.УстановитьПараметрыВыводаКалендаряОтчетности
//
Процедура УстановитьПараметрыВыводаКалендаряОтчетности(ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ПравоНаВключениеОтчетов = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НалогиОтчеты);

КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьРасписаниеДокументыСЭДО
//
Процедура ЗаполнитьРасписаниеДокументыСЭДО(Запрос, Расписание) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВходящийЗапросФССДляРасчетаПособияНаименование КАК Наименование,
	|	&ВходящийЗапросФССДляРасчетаПособияНаименованиеСокращенное КАК НаименованиеСокращенное,
	|	ВходящийЗапросФССДляРасчетаПособия.Организация КАК Организация,
	|	ВходящийЗапросФССДляРасчетаПособия.Ссылка КАК Правило,
	|	ВходящийЗапросФССДляРасчетаПособия.Дата КАК ПериодСобытия,
	|	ВходящийЗапросФССДляРасчетаПособия.Дата КАК НачалоВыполнения,
	|	ВЫБОР
	|		КОГДА ВходящийЗапросФССДляРасчетаПособия.Обработан
	|			ТОГДА ЕСТЬNULL(ЗадачиБухгалтера.Срок, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ВходящийЗапросФССДляРасчетаПособия.МаксимальнаяДатаОтвета
	|	КОНЕЦ КАК Срок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО) КАК Действие,
	|	ИСТИНА КАК УчитыватьНерабочиеДни
	|ИЗ
	|	Документ.ВходящийЗапросФССДляРасчетаПособия КАК ВходящийЗапросФССДляРасчетаПособия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ПО ВходящийЗапросФССДляРасчетаПособия.Ссылка = ЗадачиБухгалтера.Правило
	|ГДЕ
	|	НЕ ВходящийЗапросФССДляРасчетаПособия.ПометкаУдаления
	|	И ВходящийЗапросФССДляРасчетаПособия.Страхователь = &Организация
	|	И ВЫБОР
	|			КОГДА ВходящийЗапросФССДляРасчетаПособия.Обработан
	|				ТОГДА ЕСТЬNULL(ЗадачиБухгалтера.Срок, ДАТАВРЕМЯ(1, 1, 1))
	|			КОГДА ВходящийЗапросФССДляРасчетаПособия.МаксимальнаяДатаОтвета = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ВходящийЗапросФССДляРасчетаПособия.Дата
	|			ИНАЧЕ ВходящийЗапросФССДляРасчетаПособия.МаксимальнаяДатаОтвета
	|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ИзвещениеФССНаименование,
	|	&ИзвещениеФССНаименованиеСокращенное,
	|	ИзвещениеФСС.Организация,
	|	ИзвещениеФСС.Ссылка,
	|	ИзвещениеФСС.Дата,
	|	ИзвещениеФСС.Дата,
	|	ВЫБОР
	|		КОГДА ИзвещениеФСС.Обработано
	|			ТОГДА ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|		КОГДА НЕ ИзвещениеФСС.Загружено
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ИзвещениеФСС.Загружено
	|				И (НЕ ИзвещениеФСС.ПодтверждениеПолученоФСС
	|					ИЛИ ИзвещениеФСС.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ИзвещениеФСС.МаксимальнаяДатаПодтверждения
	|		ИНАЧЕ ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.ИзвещениеФСС КАК ИзвещениеФСС
	|ГДЕ
	|	НЕ ИзвещениеФСС.ПометкаУдаления
	|	И ИзвещениеФСС.Организация = &Организация
	|	И ВЫБОР
	|			КОГДА ИзвещениеФСС.Обработано
	|				ТОГДА ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|			КОГДА НЕ ИзвещениеФСС.Загружено
	|				ТОГДА ИзвещениеФСС.Дата
	|			КОГДА ИзвещениеФСС.Загружено
	|					И (НЕ ИзвещениеФСС.ПодтверждениеПолученоФСС
	|						ИЛИ ИзвещениеФСС.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|				ТОГДА ИзвещениеФСС.МаксимальнаяДатаПодтверждения
	|			ИНАЧЕ ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&УведомлениеОСтатусеВыплатыПособияНаименование,
	|	&УведомлениеОСтатусеВыплатыПособияНаименованиеСокращенное,
	|	УведомлениеОСтатусеВыплатыПособия.Страхователь,
	|	УведомлениеОСтатусеВыплатыПособия.Ссылка,
	|	УведомлениеОСтатусеВыплатыПособия.Дата,
	|	УведомлениеОСтатусеВыплатыПособия.Дата,
	|	ВЫБОР
	|		КОГДА НЕ УведомлениеОСтатусеВыплатыПособия.Загружен
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ УведомлениеОСтатусеВыплатыПособия.МаксимальнаяДатаПодтверждения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.УведомлениеОСтатусеВыплатыПособия КАК УведомлениеОСтатусеВыплатыПособия
	|ГДЕ
	|	НЕ УведомлениеОСтатусеВыплатыПособия.ПометкаУдаления
	|	И УведомлениеОСтатусеВыплатыПособия.Страхователь = &Организация
	|	И ВЫБОР
	|			КОГДА НЕ УведомлениеОСтатусеВыплатыПособия.Загружен
	|				ТОГДА УведомлениеОСтатусеВыплатыПособия.Дата
	|			ИНАЧЕ УведомлениеОСтатусеВыплатыПособия.МаксимальнаяДатаПодтверждения
	|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОтказВВозмещенииВыплатРодителямДетейИнвалидовНаименование,
	|	&ОтказВВозмещенииВыплатРодителямДетейИнвалидовНаименованиеСокращенное,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Страхователь,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Ссылка,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Дата,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Загружен
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.МаксимальнаяДатаПодтверждения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов КАК ОтказВВозмещенииВыплатРодителямДетейИнвалидов
	|ГДЕ
	|	НЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.ПометкаУдаления
	|	И ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Страхователь = &Организация
	|	И ВЫБОР
	|			КОГДА НЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Загружен
	|				ТОГДА ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Дата
	|			ИНАЧЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.МаксимальнаяДатаПодтверждения
	|		КОНЕЦ МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодСобытия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Расписание.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		Если Не ЗначениеЗаполнено(Выборка.Срок) Тогда // Заполняем минимальной из всех возможных датой на ответ
			НоваяЗапись.Срок = СЭДОФСС.СледующийРабочийДень(Выборка.НачалоВыполнения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьЗаписьРасписанияДокументСЭДО
//
Процедура ЗаполнитьЗаписьРасписанияДокументСЭДО(Запрос, Расписание) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&ВходящийЗапросФССДляРасчетаПособияНаименование КАК Наименование,
	|	&ВходящийЗапросФССДляРасчетаПособияНаименованиеСокращенное КАК НаименованиеСокращенное,
	|	ВходящийЗапросФССДляРасчетаПособия.Организация КАК Организация,
	|	ВходящийЗапросФССДляРасчетаПособия.Ссылка КАК Правило,
	|	ВходящийЗапросФССДляРасчетаПособия.Дата КАК ПериодСобытия,
	|	ВходящийЗапросФССДляРасчетаПособия.Дата КАК НачалоВыполнения,
	|	ВЫБОР
	|		КОГДА ВходящийЗапросФССДляРасчетаПособия.Обработан
	|			ТОГДА ЕСТЬNULL(ЗадачиБухгалтера.Срок, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ВходящийЗапросФССДляРасчетаПособия.МаксимальнаяДатаОтвета
	|	КОНЕЦ КАК Срок,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО) КАК Действие,
	|	ИСТИНА КАК УчитыватьНерабочиеДни
	|ИЗ
	|	Документ.ВходящийЗапросФССДляРасчетаПособия КАК ВходящийЗапросФССДляРасчетаПособия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ПО ВходящийЗапросФССДляРасчетаПособия.Ссылка = ЗадачиБухгалтера.Правило
	|ГДЕ
	|	НЕ ВходящийЗапросФССДляРасчетаПособия.ПометкаУдаления
	|	И ВходящийЗапросФССДляРасчетаПособия.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ИзвещениеФССНаименование,
	|	&ИзвещениеФССНаименованиеСокращенное,
	|	ИзвещениеФСС.Организация,
	|	ИзвещениеФСС.Ссылка,
	|	ИзвещениеФСС.Дата,
	|	ИзвещениеФСС.Дата,
	|	ВЫБОР
	|		КОГДА ИзвещениеФСС.Обработано
	|			ТОГДА ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|		КОГДА НЕ ИзвещениеФСС.Загружено
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		КОГДА ИзвещениеФСС.Загружено
	|				И (НЕ ИзвещениеФСС.ПодтверждениеПолученоФСС
	|					ИЛИ ИзвещениеФСС.ДатаОтправкиПодтверждения = ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА ИзвещениеФСС.МаксимальнаяДатаПодтверждения
	|		ИНАЧЕ ИзвещениеФСС.МаксимальнаяДатаОтправкиРеестра
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.ИзвещениеФСС КАК ИзвещениеФСС
	|ГДЕ
	|	НЕ ИзвещениеФСС.ПометкаУдаления
	|	И ИзвещениеФСС.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&УведомлениеОСтатусеВыплатыПособияНаименование,
	|	&УведомлениеОСтатусеВыплатыПособияНаименованиеСокращенное,
	|	УведомлениеОСтатусеВыплатыПособия.Страхователь,
	|	УведомлениеОСтатусеВыплатыПособия.Ссылка,
	|	УведомлениеОСтатусеВыплатыПособия.Дата,
	|	УведомлениеОСтатусеВыплатыПособия.Дата,
	|	ВЫБОР
	|		КОГДА НЕ УведомлениеОСтатусеВыплатыПособия.Загружен
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ УведомлениеОСтатусеВыплатыПособия.МаксимальнаяДатаПодтверждения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.УведомлениеОСтатусеВыплатыПособия КАК УведомлениеОСтатусеВыплатыПособия
	|ГДЕ
	|	НЕ УведомлениеОСтатусеВыплатыПособия.ПометкаУдаления
	|	И УведомлениеОСтатусеВыплатыПособия.Ссылка = &ДокументСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ОтказВВозмещенииВыплатРодителямДетейИнвалидовНаименование,
	|	&ОтказВВозмещенииВыплатРодителямДетейИнвалидовНаименованиеСокращенное,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Страхователь,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Ссылка,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Дата,
	|	ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Дата,
	|	ВЫБОР
	|		КОГДА НЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Загружен
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.МаксимальнаяДатаПодтверждения
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО),
	|	ИСТИНА
	|ИЗ
	|	Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов КАК ОтказВВозмещенииВыплатРодителямДетейИнвалидов
	|ГДЕ
	|	НЕ ОтказВВозмещенииВыплатРодителямДетейИнвалидов.ПометкаУдаления
	|	И ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Ссылка = &ДокументСсылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Расписание.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		Если Не ЗначениеЗаполнено(Выборка.Срок) Тогда // Заполняем минимальной из всех возможных датой на ответ
			НоваяЗапись.Срок = СЭДОФСС.СледующийРабочийДень(Выборка.НачалоВыполнения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииЗапросаИзменений
//
Процедура ПриОпределенииЗапросаИзменений(Запрос) Экспорт
	
	НеТипПравилаСЭДО = "НЕ ЗадачиБухгалтера.Правило ССЫЛКА Документ.ВходящийЗапросФССДляРасчетаПособия
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Документ.ИзвещениеФСС
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Документ.УведомлениеОСтатусеВыплатыПособия";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НеТипПравилаСЭДО", НеТипПравилаСЭДО);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ВТЗадачиПоКадровымМероприятиям
//
Процедура ВТЗадачиПоКадровымМероприятиям(Запрос, ИмяТаблицы) Экспорт
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задачи.Индекс КАК Индекс,
	|	Задачи.СложноеУсловиеПроверки КАК СложноеУсловиеПроверки,
	|	Задачи.УсловиеПроверки КАК УсловиеПроверки,
	|	Задачи.Периодичность КАК Периодичность,
	|	Задачи.ДатаОкончания КАК ДатаОкончания,
	|	Задачи.Организация КАК Организация,
	|	Задачи.ПериодСобытия КАК ПериодСобытия,
	|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия,
	|	МероприятияТрудовойДеятельности.ДатаДокументаОснования КАК ДатаМероприятия
	|ПОМЕСТИТЬ МероприятияТрудовойДеятельности
	|ИЗ
	|	ЗадачиСИсключениями КАК Задачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|		ПО Задачи.Организация = МероприятияТрудовойДеятельности.Организация
	|			И (НАЧАЛОПЕРИОДА(Задачи.ПериодСобытия, ДЕНЬ) = НАЧАЛОПЕРИОДА(МероприятияТрудовойДеятельности.ДатаДокументаОснования, ДЕНЬ))
	|ГДЕ
	|	МероприятияТрудовойДеятельности.ВидМероприятия В (ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.Прием), ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийТрудовойДеятельности.Увольнение))
	|	И Задачи.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МероприятияТрудовойДеятельности.Организация КАК Организация,
	|	МероприятияТрудовойДеятельности.ДатаМероприятия КАК ДатаМероприятия,
	|	МероприятияТрудовойДеятельностиПереданные.Регистратор КАК Регистратор,
	|	МероприятияТрудовойДеятельности.Индекс КАК Индекс,
	|	МероприятияТрудовойДеятельности.СложноеУсловиеПроверки КАК СложноеУсловиеПроверки,
	|	МероприятияТрудовойДеятельности.УсловиеПроверки КАК УсловиеПроверки,
	|	МероприятияТрудовойДеятельности.Периодичность КАК Периодичность,
	|	МероприятияТрудовойДеятельности.ДатаОкончания КАК ДатаОкончания,
	|	МероприятияТрудовойДеятельности.ПериодСобытия КАК ПериодСобытия
	|ПОМЕСТИТЬ ПереданныеКадровыеМероприятия
	|ИЗ
	|	МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
	|		ПО МероприятияТрудовойДеятельности.ИдМероприятия = МероприятияТрудовойДеятельностиПереданные.ИдМероприятия
	|ГДЕ
	|	НЕ МероприятияТрудовойДеятельностиПереданные.Отменено
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереданныеКадровыеМероприятия.Индекс КАК Индекс,
	|	ПереданныеКадровыеМероприятия.СложноеУсловиеПроверки КАК СложноеУсловиеПроверки,
	|	ПереданныеКадровыеМероприятия.УсловиеПроверки КАК УсловиеПроверки,
	|	ЖурналОтчетовСтатусы.Ссылка КАК Ссылка,
	|	ЖурналОтчетовСтатусы.Статус КАК Статус,
	|	ЖурналОтчетовСтатусы.СостояниеСдачиОтчетности КАК СостояниеСдачиОтчетности,
	|	ЖурналОтчетовСтатусы.ДатаОкончания КАК ДатаОкончания,
	|	ПереданныеКадровыеМероприятия.ПериодСобытия КАК ПериодСобытия,
	|	ПереданныеКадровыеМероприятия.Периодичность КАК Периодичность,
	|	ЖурналОтчетовСтатусы.ВариантОтчета КАК ВариантОтчета
	|ПОМЕСТИТЬ ВТ_ЖурналОтчетовСтатусы
	|ИЗ
	|	РегистрСведений.ЖурналОтчетовСтатусы КАК ЖурналОтчетовСтатусы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПереданныеКадровыеМероприятия КАК ПереданныеКадровыеМероприятия
	|		ПО ЖурналОтчетовСтатусы.Организация = ПереданныеКадровыеМероприятия.Организация
	|			И ЖурналОтчетовСтатусы.Ссылка = ПереданныеКадровыеМероприятия.Регистратор
	|ГДЕ
	|	НЕ ЖурналОтчетовСтатусы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ МероприятияТрудовойДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПереданныеКадровыеМероприятия";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ЖурналОтчетовСтатусы", ИмяТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры

// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.ПриИзмененииСтатусаОтправкиДокумента.
Функция ПриИзмененииСтатусаОтправкиДокумента(Ссылка, СтатусОтправки) Экспорт
	
	ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиОтчета(Ссылка, СтатусОтправки);
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ОписиИсходящихДокументовВНалоговыеОрганы") Тогда
		Основание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Основание");
		Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда
			ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС(Основание);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Подробнее
// См. ЭлектронныйДокументооборотСКонтролирующимиОрганамиПереопределяемый.ПриИзмененииРучногоСтатуса
//
Процедура ПриИзмененииРучногоСтатуса(Ссылка, Статус) Экспорт
	
	ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачиПодготовкиОтчета(Ссылка, Статус);
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПолученииДоступныхОрганизацийПользователя
//
Процедура ПриПолученииДоступныхОрганизацийПользователя(Организации) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	Организации.Наименование КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	ЕСТЬNULL(РегистрацииВНалоговомОргане.КПП, """") КАК КПП
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|		ПО Организации.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеОрганизации = Новый Структура("Наименование, Идентификатор, ИНН, КПП",
			Выборка.Наименование,
			XMLСтрока(Выборка.Организация.УникальныйИдентификатор()),
			Выборка.ИНН,
			Выборка.КПП);
		Организации.Добавить(ДанныеОрганизации);
	КонецЦикла;
	
КонецПроцедуры

// Подробнее
// См. СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодготовкеОтветаДанныеОтчетности
//
Процедура ПриПодготовкеОтветаДанныеОтчетности(Ответ, Отбор) Экспорт

	ДатаНачала = Отбор.Период.Начало;
	ДатаКонца = Отбор.Период.Конец;
	
	ПоследнийДеньПредыдущегоМесяца = НачалоДня(НачалоМесяца(ДатаНачала) - 1);
	ПредпоследнийДеньПоследнегоМесяца = НачалоДня(НачалоДня(КонецМесяца(ДатаКонца)) - 1);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",  ПоследнийДеньПредыдущегоМесяца);
	Запрос.УстановитьПараметр("ДатаКонца",   ПредпоследнийДеньПоследнегоМесяца);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.Наименование КАК Наименование,
	|	Организации.ИНН КАК ИНН,
	|	ЕСТЬNULL(РегистрацииВНалоговомОргане.КПП, """") КАК КПП
	|ПОМЕСТИТЬ ДоступныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|		ПО Организации.РегистрацияВНалоговомОргане = РегистрацииВНалоговомОргане.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналОтчетовСтатусы.Организация КАК Организация,
	|	ДоступныеОрганизации.Наименование КАК НаименованиеОрганизации,
	|	ДоступныеОрганизации.ИНН КАК ИНН,
	|	ДоступныеОрганизации.КПП КАК КПП,
	|	ЖурналОтчетовСтатусы.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(РегламентированныйОтчет.ИсточникОтчета, НЕОПРЕДЕЛЕНО) КАК ИсточникОтчета,
	|	ЖурналОтчетовСтатусы.Статус КАК Статус,
	|	ЖурналОтчетовСтатусы.ДатаОкончания КАК КонецПериода
	|ИЗ
	|	РегистрСведений.ЖурналОтчетовСтатусы КАК ЖурналОтчетовСтатусы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегламентированныйОтчет КАК РегламентированныйОтчет
	|		ПО ЖурналОтчетовСтатусы.Ссылка = РегламентированныйОтчет.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеОрганизации КАК ДоступныеОрганизации
	|		ПО ЖурналОтчетовСтатусы.Организация = ДоступныеОрганизации.Ссылка
	|ГДЕ
	|	ЖурналОтчетовСтатусы.Организация В
	|			(ВЫБРАТЬ
	|				ДоступныеОрганизации.Ссылка
	|			ИЗ
	|				ДоступныеОрганизации)
	|	И ЖурналОтчетовСтатусы.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаКонца
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(250);
	ТипДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	СтатусыОтчетности = Новый ТаблицаЗначений();
	СтатусыОтчетности.Колонки.Добавить("ВидПриложения", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("ИдентификаторОрганизации", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("НаименованиеОрганизации", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("ИНН", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("КПП", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("ИдентификаторПравила", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("КонецПериода", ТипДата);
	СтатусыОтчетности.Колонки.Добавить("Статус", ТипСтрока);
	СтатусыОтчетности.Колонки.Добавить("НавигационнаяСсылка", ТипСтрока);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ИсточникОтчета) Тогда
			Имя = Выборка.ИсточникОтчета;
		Иначе
			Имя = Выборка.Ссылка.Метаданные().Имя;
		КонецЕсли;
		
		Если Отбор.ИдентификаторыОтчетов.Найти(Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СтатусыОтчетности.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ИдентификаторОрганизации = XMLСтрока(Выборка.Организация.УникальныйИдентификатор());
		НоваяСтрока.ИдентификаторПравила = Имя;
		НоваяСтрока.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Выборка.Ссылка);
		НоваяСтрока.ВидПриложения = "Зарплата и управление персоналом";
	КонецЦикла;
	
	Ответ = ОбщегоНазначения.ТаблицаЗначенийВМассив(СтатусыОтчетности);
	
КонецПроцедуры

// См. ДокументооборотСКОПереопределяемый.ОбновитьИЗаполнитьТребованияФНС.
Процедура ОбновитьИЗаполнитьТребованияФНС(Организация, Дата) Экспорт
	
	РегистрыСведений.ЗадачиБухгалтера.ОбновитьИЗаполнитьТребованияФНС(Организация, Дата);

КонецПроцедуры

// См. ДокументооборотСКОПереопределяемый.ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС.
Процедура ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС(Ссылка) Экспорт
	
	ВыполнениеЗадачБухгалтера.ЗарегистрироватьИзменениеСтатусаЗадачТребованиеФНС(Ссылка);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьДоступныеВидыДействийКалендаряБухгалтера.
Процедура ПолучитьДоступныеВидыДействийКалендаряБухгалтера(МассивДоступныхДействий) Экспорт
	
	МассивДоступныхДействий.Добавить(Перечисления.ВидыДействийКалендаряБухгалтера.Отчет);
	МассивДоступныхДействий.Добавить(Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога);
	МассивДоступныхДействий.Добавить(Перечисления.ВидыДействийКалендаряБухгалтера.Зарплата);
	МассивДоступныхДействий.Добавить(Перечисления.ВидыДействийКалендаряБухгалтера.ТребованиеФНС);
	МассивДоступныхДействий.Добавить(Перечисления.ВидыДействийКалендаряБухгалтера.ДокументСЭДО);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныеИдентификаторыТребованийОтчетов.
Процедура ЗаполнитьКорректныеИдентификаторыТребованийОтчетов(ИдентификаторыТребований) Экспорт
	
	СписокОтчетов = РегламентированнаяОтчетностьПереопределяемый.ПолучитьСписокРегламентированныхОтчетов();
	
	ИдентификаторыРеглОтчеты = ВыполнениеЗадачБухгалтера.СоответствияПравилИФормОтчетов();
	ИдентификаторыДокументы = ВыполнениеЗадачБухгалтера.ИдентификаторыПравилВыполняющихсяНеРеглОтчетами();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокОтчетов", СписокОтчетов);
	Запрос.УстановитьПараметр("ИдентификаторыРеглОтчеты", ИдентификаторыРеглОтчеты);
	Запрос.УстановитьПараметр("ИдентификаторыДокументы", ИдентификаторыДокументы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыТребований.ФормаОтчета КАК ФормаОтчета,
	|	ИдентификаторыТребований.ИдентификаторПравила КАК ИдентификаторПравила,
	|	ИдентификаторыТребований.ИдентификаторЗадачи КАК ИдентификаторЗадачи
	|ПОМЕСТИТЬ ИдентификаторыРеглОтчеты
	|ИЗ
	|	&ИдентификаторыРеглОтчеты КАК ИдентификаторыТребований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВРЕГ(ИдентификаторыТребований.ИдентификаторПравила) КАК ИдентификаторПравила,
	|	ВРЕГ(ИдентификаторыТребований.ИдентификаторЗадачи) КАК ИдентификаторЗадачи
	|ПОМЕСТИТЬ ИдентификаторыДокументы
	|ИЗ
	|	&ИдентификаторыДокументы КАК ИдентификаторыТребований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИдентификаторыТребований.ИдентификаторПравила КАК ИдентификаторТребования,
	|	ИдентификаторыТребований.ИдентификаторЗадачи КАК ИдентификаторЗадачи
	|ИЗ
	|	ИдентификаторыРеглОтчеты КАК ИдентификаторыТребований
	|ГДЕ
	|	ИдентификаторыТребований.ФормаОтчета В(&СписокОтчетов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИдентификаторыТребований.ИдентификаторПравила,
	|	ИдентификаторыТребований.ИдентификаторЗадачи
	|ИЗ
	|	ИдентификаторыДокументы КАК ИдентификаторыТребований";
	ИдентификаторыТребований = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПолучитьПравилаИсключения.
Процедура ПолучитьПравилаИсключения(МенеджерВременныхТаблиц) Экспорт
	
	ИдентификаторыТребований = Новый ТаблицаЗначений;
	ЗаполнитьКорректныеИдентификаторыТребованийОтчетов(ИдентификаторыТребований);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ИдентификаторыТребований", ИдентификаторыТребований);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыТребований.ИдентификаторТребования КАК ИдентификаторТребования,
	|	ИдентификаторыТребований.ИдентификаторЗадачи КАК ИдентификаторЗадачи
	|ПОМЕСТИТЬ ИдентификаторыТребований
	|ИЗ
	|	&ИдентификаторыТребований КАК ИдентификаторыТребований
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ПравилаИсключения
	|ИЗ
	|	Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК ПравилаПредставленияОтчетовУплатыНалогов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИдентификаторыТребований КАК ИдентификаторыТребований
	|		ПО (ИдентификаторыТребований.ИдентификаторЗадачи = ПравилаПредставленияОтчетовУплатыНалогов.Владелец.Код)
	|			И (ИдентификаторыТребований.ИдентификаторТребования = ПравилаПредставленияОтчетовУплатыНалогов.Код)
	|ГДЕ
	|	ПравилаПредставленияОтчетовУплатыНалогов.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Отчет)
	|	И ИдентификаторыТребований.ИдентификаторТребования ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИдентификаторыТребований";
	Запрос.Выполнить();
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ДополнитьПредопределенныеПравила.
Процедура ДополнитьПредопределенныеПравила(Правила, ВерсияПравил) Экспорт
	
	Чтение = Новый ЧтениеXML;
	Макет = ПолучитьОбщийМакет("ТребованияНормативныхДокументовДополнительные");
	Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
	ОбъектПравил = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ОбъектПравил.ВерсияФормата, "3.0.2.0") >= 0 Тогда
		Возврат; // Неподдерживаемая версия правил
	КонецЕсли;
	ВерсияПравил = ОбъектПравил.ВерсияПравил;
	
	ТекущаяВерсияПравил = Константы.ВерсияПравилПредставленияОтчетовУплатыНалоговБЗК.Получить();
	
	Если ЗначениеЗаполнено(ТекущаяВерсияПравил) И ТекущаяВерсияПравил >= ВерсияПравил Тогда
		// В базе классификатор уже обновлен
		Возврат;
	КонецЕсли;
	
	Справочники.ЗадачиБухгалтера.ДобавитьПравилаВТаблицу(ОбъектПравил, Правила);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов.
Процедура УстановитьВерсиюДополнительныхПравилПредставленияОтчетовУплатыНалогов(ВерсияДополнительныхПравил) Экспорт
	
	Константы.ВерсияПравилПредставленияОтчетовУплатыНалоговБЗК.Установить(ВерсияДополнительныхПравил);
	
КонецПроцедуры

// См. ЗадачиБухгалтераПереопределяемый.ПриОпределенииТекстаЗапросаСпискаЗадач.
Процедура ПриОпределенииТекстаЗапросаСпискаЗадач(СписокЗадач) Экспорт
	
	СписокЗадач.ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Требования.Владелец.Код = ""НДФЛ_Агент_Уплата""
	|			ТОГДА ""Зарплата""
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Отчет)
	|			ТОГДА ""Отчет""
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|			ТОГДА ""Уплата налога""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипЗадачи,
	|	ЗадачиБухгалтера.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.Наименование, """") КАК ОрганизацияНаименование,
	|	ЗадачиБухгалтера.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ЗадачиБухгалтера.ПериодСобытия КАК ПериодСобытия,
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	Требования.Код КАК ИдентификаторПравила,
	|	Требования.Владелец КАК Задача,
	|	Требования.Владелец.Код КАК ИдентификаторЗадачи,
	|	ЕСТЬNULL(Требования.Владелец.РеквизитДопУпорядочивания, 0) КАК РегулярнаяЗадачаПорядок,
	|	ВЫБОР
	|		КОГДА ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ТребованиеФНС)
	|		КОГДА ТранспортноеСообщение.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ТребованиеФНС)
	|		КОГДА ЗадачиБухгалтера.Правило ССЫЛКА Документ.ВходящийЗапросФССДляРасчетаПособия
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО)
	|		КОГДА ЗадачиБухгалтера.Правило ССЫЛКА Документ.ИзвещениеФСС
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО)
	|		КОГДА ЗадачиБухгалтера.Правило ССЫЛКА Документ.ОтказВВозмещенииВыплатРодителямДетейИнвалидов
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО)
	|		КОГДА ЗадачиБухгалтера.Правило ССЫЛКА Документ.УведомлениеОСтатусеВыплатыПособия
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО)
	|		ИНАЧЕ ЕСТЬNULL(Требования.Действие, ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ПустаяСсылка))
	|	КОНЕЦ КАК Действие,
	|	ЕСТЬNULL(Требования.ОтправкаОтчетаОграничена, ЛОЖЬ) КАК ОтправкаОтчетаОграничена,
	|	ВЫБОР
	|		КОГДА &Подключена1СОтчетность
	|				И Требования.ОтправкаОтчетаОграничена = ИСТИНА
	|			ТОГДА 8
	|		КОГДА ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 10
	|		КОГДА ТранспортноеСообщение.Ссылка ЕСТЬ НЕ NULL 
	|			ТОГДА 10
	|		КОГДА ЗадачиБухгалтера.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.ДокументСЭДО)
	|			ТОГДА 10
	|		КОГДА Требования.Действие ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Отчет)
	|			ТОГДА 2
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|				ИЛИ Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.РегулярныйПлатеж)
	|			ТОГДА 3
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Зарплата)
	|			ТОГДА 7
	|		КОГДА Требования.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Уведомление)
	|			ТОГДА 9
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КартинкаЗадачи,
	|	ЕСТЬNULL(Требования.Действие.Порядок, 0) КАК ДействиеПорядок,
	|	ЕСТЬNULL(Требования.РеквизитДопУпорядочивания, 0) КАК ПравилоПорядок,
	|	ЕСТЬNULL(Требования.ЕстьИнформацияНаИТС, ЛОЖЬ) КАК ЕстьИнформацияНаИТС,
	|	ЗадачиБухгалтера.Срок КАК Срок,
	|	ВЫБОР
	|		КОГДА ЗадачиБухгалтера.НачальныйСрок > &ТекущаяДата
	|				И НЕ ЗадачиБухгалтера.СтатусУстановленВручную
	|			ТОГДА ЗадачиБухгалтера.НачальныйСрок
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК НачальныйСрок,
	|	ВЫБОР
	|		КОГДА Требования.Ссылка ЕСТЬ NULL
	|				И ТранспортноеСообщение.Ссылка ЕСТЬ NULL
	|				И ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка ЕСТЬ NULL
	|			ТОГДА 999
	|		ИНАЧЕ РАЗНОСТЬДАТ(&ТекущаяДата, ЗадачиБухгалтера.Срок, ДЕНЬ)
	|	КОНЕЦ КАК ОсталосьДней,
	|	ЗадачиБухгалтера.НачалоВыполнения КАК НачалоВыполнения,
	|	ЗадачиБухгалтера.Наименование КАК Наименование,
	|	ЗадачиБухгалтера.Периодичность КАК Периодичность,
	|	ЕСТЬNULL(ЗадачиНачалаРаботы.Порядок, 0) КАК ЗадачиНачалаРаботыПорядок,
	|	ЛОЖЬ КАК ПлановаяПроверка,
	|	0 КАК ЗавершитьЗадачу,
	|	ВЫБОР
	|		КОГДА ЗадачиБухгалтера.СтатусУстановленВручную
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК РучнойСтатусКартинка,
	|	ЕСТЬNULL(ЗадачиБухгалтера.СтатусУстановленВручную, ЛОЖЬ) КАК СтатусУстановленВручную,
	|	ЕСТЬNULL(ЗадачиБухгалтера.Комментарий, """") КАК Комментарий,
	|	ЕСТЬNULL(ЗадачиБухгалтера.ПользовательУстановившийСтатус.Представление, """") КАК ПользовательУстановившийСтатус,
	|	ЗадачиБухгалтера.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ЗадачиБухгалтера.Правило = Требования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ЗадачиНачалаРаботы КАК ЗадачиНачалаРаботы
	|		ПО ЗадачиБухгалтера.Правило = ЗадачиНачалаРаботы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов КАК ДокументыРеализацииПолномочийНалоговыхОрганов
	|		ПО ЗадачиБухгалтера.Правило = ДокументыРеализацииПолномочийНалоговыхОрганов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортноеСообщение КАК ТранспортноеСообщение
	|		ПО ЗадачиБухгалтера.Правило = ТранспортноеСообщение.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗадачиБухгалтера.Организация = Организации.Ссылка
	|ГДЕ
	|	НЕ ЗадачиБухгалтера.ВАрхиве
	|	И НЕ ЕСТЬNULL(Требования.ВыполняетсяЕдинымПомощником, ЛОЖЬ)
	|{ГДЕ
	|	(ЕСТЬNULL(ЗадачиНачалаРаботы.Ссылка, ЗНАЧЕНИЕ(Перечисление.ЗадачиНачалаРаботы.ПустаяСсылка))) КАК ЗадачаНачалаРаботы}";
	
КонецПроцедуры

// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействия.
Процедура ПриОпределенииОписанияДействия(ОписаниеДействия, Событие) Экспорт
	
	Если ТипЗнч(Событие.Правило) = Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтера.ОписаниеДействияТребованияФНС(Событие)
		
	ИначеЕсли ВыполнениеЗадачБухгалтераКлиентСервер.ЭтоДокументСЭДО(Событие.Правило) Тогда
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтера.ОписаниеДействияДокументСЭДО(Событие);
		
	Иначе
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтера.ОписаниеДействияНалоговыйПлатеж(Событие);
		
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов
//
Процедура ПриОпределенииОписанияДействияФормированиеПлатежныхПорученийНаУплатуНалогов(Событие, ОписаниеДействия) Экспорт
	
	ПериодОтчета = Новый СтандартныйПериод(НачалоМесяца(Событие.ПериодСобытия), КонецМесяца(Событие.ПериодСобытия));
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация, Период", Событие.Организация, ПериодОтчета));
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

	Правило = Событие.Правило;
	ПолноеИмяПравила = Справочники.ПравилаПредставленияОтчетовУплатыНалогов.ПолноеИмяПравила(Правило);
	
	Если ПолноеИмяПравила = "Подготовка_Данных_НДФЛ_Взносы.2023_ПодготовкаДанныхСтраховыеВзносыДопВзносыТравм" Тогда
		//ОтражениеЗарплатыВБухучете
		ПараметрыФормы.Вставить("КлючВарианта",     "ОтражениеВБухучете");
		ОписаниеДействия.Вставить("ИмяФормы",       "Отчет.ДанныеДляОтраженияРасчетовЗарплатыВБухучете.Форма");
		ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
	Иначе
		//ОтражениеУдержанногоНДФЛВБухучете
		ПараметрыФормы.Вставить("КлючВарианта",     "ОтражениеУдержанногоНДФЛВБухучетеПоСтатьям");
		ОписаниеДействия.Вставить("ИмяФормы",       "Отчет.ДанныеДляОтраженияУдержанногоНДФЛВБухучете.Форма");
		ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ
//
Процедура ПриОпределенииОписанияДействияВыплатаЗарплатыИУплатаНДФЛ(Событие, Аванс, ОписаниеДействия) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",          Событие.Организация);
	ПараметрыФормы.Вставить("МесяцНачисления",      НачалоМесяца(Событие.ПериодСобытия));
	ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
	
	ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.РасчетЗарплаты.Форма.Форма");
	ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные
//
Процедура ПриОпределенииОписанияДействияСведенияЭТКЕжемесячные(Событие, ОписаниеДействия) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация",       Событие.Организация);
	Отбор.Вставить("ПериодСобытия",     Событие.ПериодСобытия);
	Отбор.Вставить("ПометкаУдаления",   Ложь);
	Отбор.Вставить("ПериодичностьДень", Событие.Периодичность = Перечисления.Периодичность.День);
	
	Если Событие.ИдентификаторЗадачи = "ТрудовыеКнижки" Тогда
		ЗаписиТрудовыхКнижек = НайтиЗаписиТрудовыхКнижек(Отбор);
		Если ЗаписиТрудовыхКнижек.Количество() = 0 Или ЕстьНедооформленныеЗаписиТрудовыхКнижек(Отбор) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация",                Событие.Организация);
			ПараметрыФормы.Вставить("ОкончаниеПериодаЗаполнения", Событие.Срок);
			ПараметрыФормы.Вставить("ДатаСобытия",                Событие.Срок);
			ОписаниеДействия.Вставить("ИмяФормы",       "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаОбъекта");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
		ИначеЕсли ЗаписиТрудовыхКнижек.Количество() > 1 Тогда
			ОписаниеДействия.Вставить("ИмяФормы",       "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаСписка");
			ОписаниеДействия.Вставить("ПараметрыФормы", Новый Структура("Отбор", Отбор));
		ИначеЕсли ЗаписиТрудовыхКнижек.Количество() = 1 Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ЗаписиТрудовыхКнижек[0].Ссылка);
			ОписаниеДействия.Вставить("ИмяФормы",       "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаОбъекта");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
		КонецЕсли;
	Иначе
		ОписаниеДействия.Вставить("ИмяФормы",       "Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.ФормаСписка");
		ОписаниеДействия.Вставить("ПараметрыФормы", Новый Структура("Отбор", Отбор));
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПолучитьСвязанныеЗадачиВыплатыЗарплаты
//
Процедура ПолучитьСвязанныеЗадачиВыплатыЗарплаты(ТаблицаЗадач, РеквизитыДокумента, ПравилоВыплатыЗарплатыАванс) Экспорт

	ДокументОбрабатывается = ЭтоВыплатаЗарплаты(РеквизитыДокумента.Ссылка);
	
	Если Не ДокументОбрабатывается Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",        РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("ПравилоАванс",       ПравилоВыплатыЗарплатыАванс);
	Запрос.УстановитьПараметр("СпособВыплатыАванс", Справочники.СпособыВыплатыЗарплаты.Аванс());
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.ПлатежнаяВедомость) Тогда
		
		Запрос.УстановитьПараметр("Ведомость", РеквизитыДокумента.ПлатежнаяВедомость);
		
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачиБухгалтера.Организация КАК Организация,
		|	ЗадачиБухгалтера.Правило КАК Правило,
		|	ЗадачиБухгалтера.ПериодСобытия КАК ПериодСобытия,
		|	ЗадачиБухгалтера.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	ЗадачиБухгалтера.Действие КАК Действие
		|ИЗ
		|	Документ.%Ведомость% КАК ВедомостьНаВыплатуЗарплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
		|		ПО ВедомостьНаВыплатуЗарплаты.Организация = ЗадачиБухгалтера.Организация
		|			И КОНЕЦПЕРИОДА(ВедомостьНаВыплатуЗарплаты.ПериодРегистрации, МЕСЯЦ) = КОНЕЦПЕРИОДА(ЗадачиБухгалтера.ПериодСобытия, МЕСЯЦ)
		|			И &УсловиеАванс
		|			И (ЗадачиБухгалтера.Правило ССЫЛКА Справочник.ПравилаПредставленияОтчетовУплатыНалогов)
		|			И (ЗадачиБухгалтера.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.Зарплата))
		|ГДЕ
		|	ВедомостьНаВыплатуЗарплаты.Ссылка = &Ведомость";
		
		ВедомостьМетаданные = РеквизитыДокумента.ПлатежнаяВедомость.Метаданные();
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Ведомость%", ВедомостьМетаданные.Имя);
		Если ВедомостьМетаданные.Реквизиты.Найти("СпособВыплаты") <> Неопределено Тогда
			
			ТекстЗамены = "(ВЫБОР
			|				КОГДА ВедомостьНаВыплатуЗарплаты.СпособВыплаты = &СпособВыплатыАванс
			|					ТОГДА ЗадачиБухгалтера.Правило = &ПравилоАванс
			|				ИНАЧЕ ЗадачиБухгалтера.Правило <> &ПравилоАванс
			|			КОНЕЦ)";
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеАванс", ТекстЗамены);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеАванс", "ИСТИНА");
		КонецЕсли;
		
		ТаблицаЗадач = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьСсылкиНаРеглОтчеты
//
Процедура ЗаполнитьСсылкиНаРеглОтчеты(ПараметрыРеглОтчетов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПараметрыРеглОтчетов", ПараметрыРеглОтчетов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыРеглОтчетов.Индекс КАК Индекс,
	|	ПараметрыРеглОтчетов.ИсточникОтчета КАК ИсточникОтчета,
	|	ПараметрыРеглОтчетов.Организация КАК Организация,
	|	ПараметрыРеглОтчетов.ДатаОкончания КАК ДатаОкончания,
	|	ПараметрыРеглОтчетов.ПериодСобытия КАК ПериодСобытия,
	|	ВЫРАЗИТЬ(ПараметрыРеглОтчетов.РегистрацияВНалоговомОргане КАК Справочник.РегистрацииВНалоговомОргане) КАК РегистрацияВНалоговомОргане,
	|	ПараметрыРеглОтчетов.Правило КАК Правило
	|ПОМЕСТИТЬ ПараметрыРеглОтчетов
	|ИЗ
	|	&ПараметрыРеглОтчетов КАК ПараметрыРеглОтчетов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ИсточникОтчета,
	|	ПериодСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыРеглОтчетов.Индекс КАК Индекс,
	|	УведомлениеОСпецрежимахНО.Ссылка КАК Ссылка,
	|	0 КАК Вид,
	|	УведомлениеОСпецрежимахНО.Дата КАК ДатаОтчета,
	|	УведомлениеОСпецрежимахНО.ДатаПодписи КАК Дата,
	|	ПараметрыРеглОтчетов.ИсточникОтчета КАК ИсточникОтчета,
	|	ПараметрыРеглОтчетов.Организация КАК Организация,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
	|	ПараметрыРеглОтчетов.ПериодСобытия КАК ПериодСобытия,
	|	ПараметрыРеглОтчетов.ДатаОкончания КАК ДатаОкончания,
	|	ПараметрыРеглОтчетов.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	УведомлениеОСпецрежимахНО.ИмяФормы КАК ВыбраннаяФорма,
	|	ПараметрыРеглОтчетов.Правило КАК Правило,
	|	ЕСТЬNULL(ЖурналУведомленийСтатусы.СтатусОтправки, """""""") КАК Статус,
	|	ЕСТЬNULL(ЖурналУведомленийСтатусы.СостояниеСдачиОтчетности, ЗНАЧЕНИЕ(Перечисление.СостояниеСдачиОтчетности.ПустаяСсылка)) КАК СостояниеСдачиОтчетности,
	|	ЕСТЬNULL(ЖурналУведомленийСтатусы.Наименование, """") КАК НаименованиеОтчета,
	|	"""" КАК ФинансовыйПериод,
	|	0 КАК ВариантОтчета,
	|	ЕСТЬNULL(ЖурналУведомленийСтатусы.ПредставлениеКонтролирующегоОргана, """") КАК ПредставлениеКонтролирующегоОргана,
	|	ЕСТЬNULL(ЖурналУведомленийСтатусы.Комментарий, """") КАК Комментарий
	|ПОМЕСТИТЬ ВТ_Ссылки
	|ИЗ
	|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыРеглОтчетов КАК ПараметрыРеглОтчетов
	|		ПО УведомлениеОСпецрежимахНО.Организация = ПараметрыРеглОтчетов.Организация
	|			И УведомлениеОСпецрежимахНО.ИмяОтчета = ПараметрыРеглОтчетов.ИсточникОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы КАК ЖурналУведомленийСтатусы
	|		ПО УведомлениеОСпецрежимахНО.Организация = ЖурналУведомленийСтатусы.Организация
	|			И УведомлениеОСпецрежимахНО.Ссылка = ЖурналУведомленийСтатусы.Ссылка
	|			И (ЖурналУведомленийСтатусы.СтраницаЖурнала = ЗНАЧЕНИЕ(Перечисление.СтраницыЖурналаОтчетность.Уведомления))
	|ГДЕ
	|	НЕ УведомлениеОСпецрежимахНО.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Ссылки.Индекс КАК Индекс,
	|	ВТ_Ссылки.Ссылка КАК Ссылка,
	|	ВТ_Ссылки.Вид КАК Вид,
	|	ВТ_Ссылки.ДатаОтчета КАК ДатаОтчета,
	|	ВТ_Ссылки.Дата КАК Дата,
	|	ВТ_Ссылки.ИсточникОтчета КАК ИсточникОтчета,
	|	ВТ_Ссылки.Организация КАК Организация,
	|	ВТ_Ссылки.ДатаНачала КАК ДатаНачала,
	|	ВТ_Ссылки.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_Ссылки.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВТ_Ссылки.ВыбраннаяФорма КАК ВыбраннаяФорма,
	|	ВТ_Ссылки.Статус КАК Статус,
	|	ВТ_Ссылки.СостояниеСдачиОтчетности КАК СостояниеСдачиОтчетности,
	|	ВТ_Ссылки.НаименованиеОтчета КАК НаименованиеОтчета,
	|	ВТ_Ссылки.ФинансовыйПериод КАК ФинансовыйПериод,
	|	ВТ_Ссылки.ВариантОтчета КАК ВариантОтчета,
	|	ВТ_Ссылки.ПредставлениеКонтролирующегоОргана КАК ПредставлениеКонтролирующегоОргана,
	|	ВТ_Ссылки.Комментарий КАК Комментарий
	|ИЗ
	|	ВТ_Ссылки КАК ВТ_Ссылки
	|УПОРЯДОЧИТЬ ПО
	|	Индекс,
	|	ДатаОтчета УБЫВ,
	|	Вид УБЫВ";
	
	ПараметрыРеглОтчетов.Колонки.Добавить("Документы", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	МетаданныеЖурналОтчетовСтатусы = Метаданные.РегистрыСведений.ЖурналОтчетовСтатусы;
	
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Ссылка", МетаданныеЖурналОтчетовСтатусы.Измерения.Ссылка.Тип);
	ТаблицаДокументы.Колонки.Добавить("Дата",   ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументы.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка"));
	ТаблицаДокументы.Колонки.Добавить("СостояниеСдачиОтчетности",
		Новый ОписаниеТипов("ПеречислениеСсылка.СостояниеСдачиОтчетности"));
	ТаблицаДокументы.Колонки.Добавить("ДатаНачала",         ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументы.Колонки.Добавить("ДатаОкончания",      ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаДокументы.Колонки.Добавить("НаименованиеОтчета", МетаданныеЖурналОтчетовСтатусы.Реквизиты.НаименованиеОтчета.Тип);
	ТаблицаДокументы.Колонки.Добавить("ФинансовыйПериод",   МетаданныеЖурналОтчетовСтатусы.Реквизиты.ФинансовыйПериод.Тип);
	ТаблицаДокументы.Колонки.Добавить("ВариантОтчета",      МетаданныеЖурналОтчетовСтатусы.Реквизиты.ВариантОтчета.Тип);
	ТаблицаДокументы.Колонки.Добавить("РегистрацияВНалоговомОргане",        Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ТаблицаДокументы.Колонки.Добавить("ПредставлениеКонтролирующегоОргана", МетаданныеЖурналОтчетовСтатусы.Реквизиты.ПредставлениеКонтролирующегоОргана.Тип);
	ТаблицаДокументы.Колонки.Добавить("Комментарий",                        МетаданныеЖурналОтчетовСтатусы.Реквизиты.Комментарий.Тип);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Поиск = Новый Структура("Индекс");
	
	Для каждого ПараметрыРеглОтчета Из ПараметрыРеглОтчетов Цикл
		
		ПолноеИмяПравила = СтрШаблон("%1.%2", ПараметрыРеглОтчета.ИдентификаторЗадачи, ПараметрыРеглОтчета.ИдентификаторПравила);
		ЭтоПравилоТринадцатогоНДФЛ = ВыполнениеЗадачБухгалтера.ЭтоПравилоТринадцатогоНДФЛ(ПолноеИмяПравила);
		
		ПараметрыРеглОтчета.Документы = ТаблицаДокументы.СкопироватьКолонки();
		Поиск.Индекс = ПараметрыРеглОтчета.Индекс;
		
		Выборка.Сбросить();
		Пока Выборка.НайтиСледующий(Поиск) Цикл
			Если ЭтоПравилоТринадцатогоНДФЛ Тогда
				Продолжить;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ПараметрыРеглОтчета.Документы.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииПризнакаДокументВыполняетЗадачу
//
Процедура ПриОпределенииПризнакаДокументВыполняетЗадачу(ДокументВыполняетЗадачу, ДокументОбъект) Экспорт
	
	ДокументВыполняетЗадачу = ЭтоВыплатаЗарплаты(ДокументОбъект.Ссылка);
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ОпределитьРеквизитыПлатежаПоДаннымДокумента
//
Процедура ОпределитьРеквизитыПлатежаПоДаннымДокумента(РеквизитыПлатежа, ДокументСсылка) Экспорт
	
	ДокументМетаданные = ДокументСсылка.Метаданные();
	
	Если Не ЭтоВыплатаЗарплаты(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументУплаты.Ссылка КАК Ссылка,
	|	""%Ведомость%"" КАК ВидДокумента,
	|	ДокументУплаты.Дата КАК Дата,
	|	ДокументУплаты.Организация КАК Организация,
	|	ДокументУплаты.Ссылка КАК ПлатежнаяВедомость
	|ИЗ
	|	Документ.%Ведомость% КАК ДокументУплаты
	|ГДЕ
	|	ДокументУплаты.Ссылка = &Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Ведомость%", ДокументМетаданные.Имя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыПлатежа, Выборка);
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.УстановитьТекстЗапросаРеспондентыРосстата
//
Процедура УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организации.ГоловнаяОрганизация КАК ГоловнаяОрганизация
	|ПОМЕСТИТЬ ОрганизацииСПодразделениями
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПодразделенияОрганизаций.Владелец
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
	|ГДЕ
	|	ПодразделенияОрганизаций.ОбособленноеПодразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	Организации.КодПоОКПО КАК ОКПО,
	|	Организации.ИНН КАК ИНН,
	|	НЕ ОрганизацииСПодразделениями.ГоловнаяОрганизация ЕСТЬ NULL КАК ЕстьОбособленныеПодразделения
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрганизацииСПодразделениями КАК ОрганизацииСПодразделениями
	|		ПО Организации.Ссылка = ОрганизацииСПодразделениями.ГоловнаяОрганизация
	|ГДЕ
	|	(Организации.ИНН <> """"
	|	ИЛИ Организации.КодПоОКПО <> """")
	|	И НЕ Организации.ОбособленноеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка,
	|	Организации.КодПоОКПО,
	|	Организации.ИНН,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.КодПоОКПО <> """"
	|	И Организации.ОбособленноеПодразделение
	|	И Организации.КодПоОКПО <> Организации.ГоловнаяОрганизация.КодПоОКПО";
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистикаПереопределяемый.ОпределитьОрганизациюПоРеспонденту
//
Процедура ОпределитьОрганизациюПоРеспонденту(Организация, Респондент)Экспорт

	Если Респондент.is_branch Тогда
		Организация = Справочники.Организации.НайтиПоРеквизиту("КодПоОКПО", СокрЛП(Респондент.OKPO));
	ИначеЕсли ЗначениеЗаполнено(Респондент.INN) Тогда
		Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", СокрЛП(Респондент.INN));
	ИначеЕсли ЗначениеЗаполнено(Респондент.OKPO) Тогда
		Организация = Справочники.Организации.НайтиПоРеквизиту("КодПоОКПО", СокрЛП(Респондент.OKPO));
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетРайонныйКоэффициент
//
Процедура ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период) Экспорт
	
	ПараметрыВыполнения = Новый Структура("Организация", Организация);
	
	ПрименятьРайонныйКоэффициент = (ПолучитьФункциональнуюОпцию("ПрименятьРайонныйКоэффициент", ПараметрыВыполнения)
		Или ПолучитьФункциональнуюОпцию("ПрименятьРайонныйКоэффициентВПодразделениях", ПараметрыВыполнения));

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетСевернуюНадбавку
//
Процедура ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период) Экспорт
	
	ПараметрыВыполнения = Новый Структура("Организация", Организация);
	
	ПрименятьСевернуюНадбавку = (ПолучитьФункциональнуюОпцию("ПрименятьСевернуюНадбавку", ПараметрыВыполнения)
		Или ПолучитьФункциональнуюОпцию("ПрименятьСевернуюНадбавкуВПодразделениях", ПараметрыВыполнения));
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияРаботаетВСельскойМестности
//
Процедура ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Истина
	|Из
	|	РегистрСведений.ТерриториальныеУсловияПФР.СрезПоследних(&Период, СтруктурнаяЕдиница = &Организация) КАК Регистр
	|где
	|	Регистр.ТерриториальныеУсловияПФР = &Территория");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Территория", Справочники.ТерриториальныеУсловияПФР.СЕЛО);
	
	РаботаетВСельскойМестности = Не Запрос.Выполнить().Пустой();
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДоговорыПодряда
//
Процедура ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНачисленияПоДоговорам") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Документ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ДоговорРаботыУслуги КАК Документ
		|ГДЕ
		|	Документ.Проведен
		|	И Документ.Организация = &Организация
		|	И Документ.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода");
		
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Если Периодичность = Перечисления.Периодичность.Год Тогда
			Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период));
			Запрос.УстановитьПараметр("КонецПериода", КонецГода(Период));
		Иначе
			Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
			Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
		КонецЕсли;
		
		ДоговорыПодряда = Не Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДокументыОтпускаБезСодержания
//
Процедура ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтпускБезСохраненияОплаты КАК Документ
	|ГДЕ
	|	Документ.Проведен
	|	И Документ.Организация = &Организация
	|	И Документ.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Период));
		Запрос.УстановитьПараметр("КонецПериода", КонецГода(Период));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
		Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Период));
	КонецЕсли;
	
	ОтпускаБезСодержания = Не Запрос.Выполнить().Пустой();

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьСотрудники_ЧАЭС
//
Процедура ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, Период) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Справочник.Ссылка
	|Из
	|	Справочник.ФизическиеЛица КАК Справочник
	|Где
	|	НЕ Справочник.ПометкаУдаления
	|	И Справочник.ЛьготаПриНачисленииПособий = &Льгота");
	
	Запрос.УстановитьПараметр("Льгота", Перечисления.ОснованияФинансированияПособияФедеральнымБюджетом.Чернобыль);
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолученияСотрудниковОрганизаций = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудниковОрганизаций.Организация = Организация;
	ПараметрыПолученияСотрудниковОрганизаций.КадровыеДанные = "ТабельныйНомер,Должность,ДатаПриема";
	ПараметрыПолученияСотрудниковОрганизаций.НачалоПериода = НачалоГода(Период);
	ПараметрыПолученияСотрудниковОрганизаций.ОкончаниеПериода = КонецДня(Период);
	ПараметрыПолученияСотрудниковОрганизаций.СписокФизическихЛиц = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	ПараметрыПолученияСотрудниковОрганизаций.РаботникиПоДоговорамГПХ = Ложь;
	
	КадровыеДанныеФизЛиц = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудниковОрганизаций);
	
	Сотрудники_ЧАЭС = КадровыеДанныеФизЛиц.Количество() > 0;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьИспользуетсяТрудНаемныхРаботников
//
Процедура ОпределитьИспользуетсяТрудНаемныхРаботников(Признак, УсловияПримененияПравил, Организация) Экспорт

	Признак = УсловияПримененияПравил.Получить("ИспользуетсяТрудНаемныхРаботников");
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплачиваетсяЗарплата
//
Процедура ОпределитьВыплачиваетсяЗарплата(Признак, УсловияПримененияПравил, Организация, Период) Экспорт
	
	ПериодыВыплатыЗарплаты = УсловияПримененияПравил.Получить("ПериодыВыплатыЗарплаты");
	Признак = ПериодыВыплатыЗарплаты.Найти(Период) <> Неопределено;

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированыКадровыеМероприятия
//
 Процедура ОпределитьЗарегистрированыКадровыеМероприятия(Признак, УсловияПримененияПравил, Организация, Период, Периодичность) Экспорт
	
	УсловияПоиска = Новый Структура;
	УсловияПоиска.Вставить("Период", Период);
	УсловияПоиска.Вставить("Периодичность", Периодичность);
	КадровыеМероприятия = УсловияПримененияПравил.Получить("КадровыеМероприятия");
	Признак = КадровыеМероприятия.НайтиСтроки(УсловияПоиска).Количество() > 0;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ПроверитьСведенияОДоходахНДФЛ(ЕстьДоходы, Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СведенияОДоходахНДФЛОбороты.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахНДФЛ.Обороты(&НачалоПериода, &КонецПериода, , Организация = &Организация) КАК СведенияОДоходахНДФЛОбороты";
	
	ЕстьДоходы = Не Запрос.Выполнить().Пустой();
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ
//
Процедура ОпределитьПлательщикЕНП(ПлательщикЕНП, Организация, Период) Экспорт
	
	ДатаПерехода = УчетНДФЛ.ДатаЗакона263ФЗ();
	Если Период >= ДатаПерехода Тогда
		ПлательщикЕНП = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикТорговогоСбора
//
Процедура ОпределитьЭтоПлательщикТорговогоСбора(ПлательщикТорговогоСбора, Организация, Период) Экспорт

	ПлательщикТорговогоСбора = ИнтерфейсыВзаимодействияБРО.ПлательщикТорговогоСбора(Период, Период, Организация);
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьНалогКУплатеПоДекларации3НДФЛ
//
Процедура УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период) Экспорт
	
	ЕстьНалог = Ложь;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала
//
Процедура ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация) Экспорт
	
	ЭтоОбособленноеПодразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОбособленноеПодразделение");
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносов(Плательщик, Организация, Период) Экспорт

	Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		Плательщик = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период) Экспорт
	
	Если Условие = УсловияПримененияТребованийЗаконодательства.УсловиеФиксированныеСтраховыеВзносы_Год() Тогда
		УсловиеВыполняется = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.УсловиеВыполняется
//
Процедура ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(Плательщик, Организация, Период, ДатаЗакрытия) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	Если Не РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		Плательщик = Истина;
	КонецЕсли;
		
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьНалогиПорядокКоторыхУстанавливаетсяНаМестах(СписокНалогов) Экспорт
	
	Налоги = КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Налоги", Налоги);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачиБухгалтера.Ссылка
	|ИЗ
	|	Справочник.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Код В(&Налоги)";
	СписокНалогов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

// Подробнее
// См. РегистрыСведений.НалогиОтчеты.ПодготовитьДанные
//
Процедура ОпределитьПорядокУплатыРегиональныхМестныхНалогов(ПорядокУплаты, Организация, ТекущаяДата) Экспорт
	
	ПорядокУплаты.Колонки.Добавить("Период",                      Новый ОписаниеТипов("Дата"));
	ПорядокУплаты.Колонки.Добавить("Налог",                       Новый ОписаниеТипов("СправочникСсылка.ЗадачиБухгалтера"));
	ПорядокУплаты.Колонки.Добавить("РегистрацияВНалоговомОргане", Новый ОписаниеТипов("СправочникСсылка.РегистрацииВНалоговомОргане"));
	ПорядокУплаты.Колонки.Добавить("Описание",                    Новый ОписаниеТипов("Строка"));

КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме
//
Процедура ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется) Экспорт
	
	УсловиеВыполняется = Истина;
	
КонецПроцедуры

// Подробнее
// См. УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам
//
Процедура ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(УсловиеВыполняется, Организация) Экспорт
	
	Параметры = Новый Структура("Организация", Организация);
	УсловиеВыполняется = ПолучитьФункциональнуюОпцию("ИспользуетсяТрудШахтеров", Параметры) 
		Или ПолучитьФункциональнуюОпцию("ИспользуетсяТрудЧленовЛетныхЭкипажей", Параметры);
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомления
//
Процедура ОпределитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОтправлятьУведомления = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецДанныхВХранилище, "ОтправлятьУведомленияПоЭлектроннойПочте");
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьОтправлятьУведомленияСЭДО
//
Процедура ОпределитьОтправлятьУведомленияСЭДО(ОтправлятьУведомления, ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ОтправлятьУведомления = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		ВладелецДанныхВХранилище, ОтправлятьУведомленияСЭДОПоЭлектроннойПочте);
		
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ОпределитьПолучателя
//
Процедура ОпределитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Получатель = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецДанныхВХранилище, "Получатель");
	
	Если Получатель = Неопределено Тогда
		Получатель = "";
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.ЗаполнитьАдресИнформационнойБазы
//
Процедура ЗаполнитьАдресИнформационнойБазы(АдресИнформационнойБазы, ВладелецДанныхВХранилище) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		АдресИнформационнойБазы = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			ВладелецДанныхВХранилище, "АдресИнформационнойБазы");
		УстановитьПривилегированныйРежим(Ложь);

		Если АдресИнформационнойБазы = Неопределено Тогда
			АдресИнформационнойБазы = "";
		КонецЕсли;
	Иначе
		АдресИнформационнойБазы = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();
		Если ПустаяСтрока(АдресИнформационнойБазы) Тогда
			АдресИнформационнойБазы = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВЛокальнойСети();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьОтправлятьУведомления
//
Процедура УстановитьОтправлятьУведомления(ОтправлятьУведомления, ВладелецДанныхВХранилище, КлючДанных) Экспорт
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецДанныхВХранилище,
		ОтправлятьУведомления, КлючДанных);
		
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецДанныхВХранилище, 
			ПолучитьНавигационнуюСсылкуИнформационнойБазы(), "АдресИнформационнойБазы");
	КонецЕсли;

КонецПроцедуры

// Подробнее
// См. СписокЗадачУведомленияПоЭлектроннойПочтеПереопределяемый.УстановитьПолучателя
//
Процедура УстановитьПолучателя(Получатель, ВладелецДанныхВХранилище) Экспорт
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецДанныхВХранилище,
		Получатель, "Получатель");
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя
//
Процедура ПриПолученииПравилПредоставленияОтчетаУплатыНДФЛПредпринимателя(Правила, Организация, Период) Экспорт
	
	Правила.Вставить("Отчет", "2013_ИП_Декларация");
	Правила.Вставить("Уплата", "2013_ИП_Налог");
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление
//
Процедура ПриОпределенииОписанияДействияНалоговыйПлатежОтчетУведомление(ОписаниеДействия, Правило, Событие, ПолноеИмяПравила) Экспорт
	
	ОписаниеДействия = ВыполнениеЗадачБухгалтера.ОписаниеДействияДекларация(Правило, Событие.ПериодСобытия, Событие.Организация, Событие.РегистрацияВНалоговомОргане);
	Если ОписаниеДействия = Неопределено Тогда
		ОписаниеДействия = Новый Структура;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриОпределенииЗадачСвязанныхСОтчетом
//
Процедура ПриОпределенииЗадачСвязанныхСОтчетом(ЗадачиСвязанныеСОтчетом, Документ, СвойстваОтчета, ИсточникОтчета) Экспорт
	
	Если ИсточникОтчета = "РегламентированныйОтчетПрибыль" Тогда
		ЗадачиСвязанныеСОтчетом = Неопределено;
	КонецЕсли;
	
	Если ИсточникОтчета = "РегламентированноеУведомлениеИсчисленныеСуммыНалогов" Тогда
		
		ЗадачиСвязанныеСОтчетом = ВыполнениеЗадачБухгалтера.ЗадачиДляУведомления(Документ, СвойстваОтчета); 
		
	ИначеЕсли ИсточникОтчета = "РегламентированноеУведомлениеЗачетНалога" Тогда
		
		ЗадачиСвязанныеСОтчетом = ВыполнениеЗадачБухгалтера.ЗадачиДляЗаявленияОЗачетеНалога(Документ, СвойстваОтчета);
		
	Иначе
		ЗадачиСвязанныеСОтчетом = ВыполнениеЗадачБухгалтера.ЗадачиДляОтчета(Документ, СвойстваОтчета);
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ПриПолученииОтбораНалоговыеОрганы
//
Процедура ПриПолученииОтбораНалоговыеОрганы(ОтборНалоговыеОрганы, Организация, КодНалоговогоОргана) Экспорт
	
	РегистрацияВНалоговомОргане = Справочники.Организации.РегистрацияВНалоговомОргане(Организация);
	
	ОтборНалоговыеОрганы.Добавить(Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка());
	ОтборНалоговыеОрганы.Добавить(РегистрацияВНалоговомОргане);

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.УдалитьНеЗаполненныеЭлементыМассива
//
Процедура УдалитьНеЗаполненныеЭлементыМассива(МассивЭлементов) Экспорт
	
	Колво = МассивЭлементов.Количество();
	Для н=1 По Колво Цикл
		Если НЕ ЗначениеЗаполнено(МассивЭлементов[Колво-н]) Тогда
			МассивЭлементов.Удалить(Колво-н);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.ЗаполнитьДоступныеОрганизацииДляОтбора
//
Процедура ЗаполнитьДоступныеОрганизацииДляОтбора(Результат, Организация, ПравоНаИзменение) Экспорт
	
	ДоступныеОрганизации = ОрганизацииДанныеКоторыхДоступныПользователю("РегистрСведений.ЗадачиБухгалтера", ПравоНаИзменение);
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Результат = ДоступныеОрганизации;
		
	ИначеЕсли ДоступныеОрганизации.Найти(Организация) <> Неопределено Тогда
		
		Результат = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
		
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераПереопределяемый.РегулярныеПлатежи
//
Процедура ПриОпределенииНоваяТаблицаПлатежи(ТаблицаПлатежи, ТаблицаЗадач) Экспорт
	
	ТаблицаПлатежи = НоваяТаблицаПлатежи();
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ЗаполнитьКорректныйПериодВводаДокументов
//
Процедура ЗаполнитьКорректныйПериодВводаДокументов(КорректныйПериод) Экспорт
	
	// Контролируем ошибку на один разряд. Например, 0017 вместо 2017; 2071 вместо 2017.
	// Допустимым считаем ввод документов на 9 лет в будущем. Например, в 2020 году разрешаем
	// вводить даты в интервале с января 2000 по декабрь 2029.
	
	КонецКорректногоПериода = ДобавитьМесяц(КонецГода(ТекущаяДатаСеанса()), 9 * 12);
	
	КорректныйПериод.Вставить("НачалоКорректногоПериода", Дата(2000, 01, 01));
	КорректныйПериод.Вставить("КонецКорректногоПериода",  КонецКорректногоПериода);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьИмяЗадачиБухгалтера
//
Процедура ПолучитьИмяЗадачиБухгалтера(ИмяЗадачи, ВидНалога, Организация, Период) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидНалога) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСоответствияЗадачБухгалтера = ТаблицаСоответствияЗадачБухгалтера();
	НайденнаяСтрока = ТаблицаСоответствияЗадачБухгалтера.Найти(ВидНалога, "ВидНалога");
	
	Если НайденнаяСтрока = Неопределено Тогда
		ИмяЗадачи = "";
	Иначе
		ИмяЗадачи = НайденнаяСтрока.КодЗадачи;
	КонецЕсли;
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераПереопределяемый.ПолучитьОсобыеСрокиСверкиИмущественныхНалогов
//
Процедура ПолучитьОсобыеСрокиСверкиИмущественныхНалогов(ОсобыеСрокиСверки, Организация) Экспорт

	ОсобыеСрокиСверки = Новый ТаблицаЗначений;
	ОсобыеСрокиСверки.Колонки.Добавить("Налог", ОбщегоНазначения.ОписаниеТипаСтрока(50)); // идентификатор задачи в списке задач
	ОсобыеСрокиСверки.Колонки.Добавить("ПериодСобытия", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ОсобыеСрокиСверки.Колонки.Добавить("КодНалоговогоОргана", ОбщегоНазначения.ОписаниеТипаСтрока(4));
	ОсобыеСрокиСверки.Колонки.Добавить("Срок", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));

	ОсобыеСрокиСверки.Индексы.Добавить("Налог, ПериодСобытия, КодНалоговогоОргана");

КонецПроцедуры

// Подробнее
// См. ВыполнениеЗадачБухгалтераВызовСервера.ИмяФормыНалогиОтчеты
//
Процедура ПриОпределенииИмениФормыНалогиОтчеты(ИмяФормы) Экспорт
	
	ИмяФормы = "ОбщаяФорма.НалогиИОтчетыБЗК";
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.КалендарьОтчетностиПриСозданииНаСервере
//
Процедура КалендарьОтчетностиПриСозданииНаСервере(Форма, Параметры, Отказ, СтандартнаяОбработка) Экспорт
	
	Элементы = Форма.Элементы;
	
	Форма.ПоУведомлениямЕНС = Ложь;
	Элементы.ГруппаПоУведомлениямЕНС.Видимость = Ложь;
	
	Элементы.КнопкаПоказатьКонтекстныеНовости.Видимость = Ложь;
	
КонецПроцедуры

// Подробнее
// См. КалендарьОтчетностиПереопределяемый.ЗаполнитьДанныеПлатежей
//
Процедура ЗаполнитьДанныеПлатежей(ДанныеПлатежей, Параметры) Экспорт
	
	Если Не Параметры.ПоНалоговымПлатежам Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПоЗадачамУплатаНалогов = Новый Запрос;
	ЗапросПоЗадачамУплатаНалогов.УстановитьПараметр("Организации", Параметры.Организации);
	ЗапросПоЗадачамУплатаНалогов.УстановитьПараметр("ДатаНачала",  Параметры.ДатаНачала);
	ЗапросПоЗадачамУплатаНалогов.УстановитьПараметр("ДатаКонца",   Параметры.ДатаКонца);
	
	ЗапросПоЗадачамУплатаНалогов.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиБухгалтера.Организация КАК Организация,
	|	ЗадачиБухгалтера.Правило КАК Правило,
	|	ЗадачиБухгалтера.Срок КАК Срок,
	|	ЗадачиБухгалтера.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	ЗадачиБухгалтера.Организация В(&Организации)
	|	И ЗадачиБухгалтера.Действие = ЗНАЧЕНИЕ(Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога)
	|	И ЗадачиБухгалтера.Срок МЕЖДУ &ДатаНачала И &ДатаКонца";
	
	Выборка = ЗапросПоЗадачамУплатаНалогов.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтатусыОтчета = КалендарьОтчетностиКлиентСервер.СтатусыОтчета();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Срок >= Параметры.НаДату Тогда
			НоваяСтрока = ДанныеПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Если Выборка.Статус = "" Тогда
				НоваяСтрока.Статус = СтатусыОтчета.ВРаботе;
				НоваяСтрока.ЕстьЗадолженность = Истина;
			Иначе
				НоваяСтрока.Статус = СтатусыОтчета.Подготовлено;
			КонецЕсли;
		Иначе
			НоваяСтрока = ДанныеПлатежей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			Если Выборка.Статус = "" Тогда
				НоваяСтрока.Статус = СтатусыОтчета.Просрочено;
				НоваяСтрока.ЕстьЗадолженность = Истина;
			Иначе
				НоваяСтрока.Статус = СтатусыОтчета.Подготовлено;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, имеющие непредопределенные элементы.
	// В модуле менеджера таких объектов должна быть определена функция ПоляЕстественногоКлюча, 
	// составляющая массив полей для однозначной идентификации элемента.
	
	Типы.Добавить(Метаданные.Справочники.ЗадачиБухгалтера);
	Типы.Добавить(Метаданные.Справочники.ПравилаПредставленияОтчетовУплатыНалогов);
	
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	ЗадачиБухгалтераСтатистика.ЗарегистрироватьМетодОчередиЗаданий(СоответствиеИменПсевдонимам);
	
КонецПроцедуры

// См. РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	ЗадачиБухгалтераСтатистика.ПриОпределенииНастроекРегламентныхЗаданий(Настройки);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриДобавленииКлассификаторов.
Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Справочники.ЗадачиБухгалтера.ПриДобавленииКлассификаторов(Классификаторы);
	
КонецПроцедуры

// См. РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора.
Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры = Неопределено) Экспорт
	
	Справочники.ЗадачиБухгалтера.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьПраваНаПодготовкуИОтправкуРегламентированнойОтчетности(ОписаниеПрофиля) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(
		ОписаниеПрофиля,
		"ДоступКВнешнемуИнтерфейсуОтчетнойКампанииЗапросы",
		"РегламентированнаяОтчетность.ЗадачиБухгалтера.СообщенияОблачныхПриложений");
	
	КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодыНалоговПорядокКоторыхУстанавливаетсяНаМестах()
	
	Налоги = Новый Массив;
	Налоги.Добавить(ЗадачиБухгалтераКлиентСервер.КодЗадачиНалогНаИмущество());
	Налоги.Добавить(ЗадачиБухгалтераКлиентСервер.КодЗадачиЗемельныйНалог());
	Налоги.Добавить(ЗадачиБухгалтераКлиентСервер.КодЗадачиТранспортныйНалог());
	
	Возврат Налоги;
	
КонецФункции

Процедура ДобавитьКодЗадачи(ТаблицаЗначений, ВидНалога, КодЗадачи)
	
	НоваяСтрока = ТаблицаЗначений.Добавить();
	НоваяСтрока.ВидНалога = ВидНалога;
	НоваяСтрока.КодЗадачи = КодЗадачи;
	
КонецПроцедуры

Процедура СоздатьПустоеПравилоВыплатаЗарплатыУплатаНДФЛ(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.ПравилаПредставленияОтчетовУплатыНалогов.ПустаяСсылка) КАК Правило,
	|	0 КАК СрокДней,
	|	0 КАК СрокМесяцев
	|ПОМЕСТИТЬ ПравилоУплатыНДФЛНалоговымАгентом
	|ГДЕ
	|	ЛОЖЬ";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Функция КадровыеМероприятияЗаПериод(Организация, НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(КонецПериода));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(КадровыеМероприятия.Период, ДЕНЬ) КАК Период,
	|	КадровыеМероприятия.Периодичность КАК Периодичность
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА ПриемНаРаботу.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ПриемНаРаботу.Дата
	|			КОГДА ПриемНаРаботу.ДатаВторогоДокументаОснования > ПриемНаРаботу.Дата
	|				ТОГДА ПриемНаРаботу.Дата
	|			ИНАЧЕ ПриемНаРаботу.ДатаВторогоДокументаОснования
	|		КОНЕЦ КАК Период,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День) КАК Периодичность
	|	ИЗ
	|		Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА ПриемНаРаботу.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ПриемНаРаботу.Дата
	|				КОГДА ПриемНаРаботу.ДатаВторогоДокументаОснования > ПриемНаРаботу.Дата
	|					ТОГДА ПриемНаРаботу.Дата
	|				ИНАЧЕ ПриемНаРаботу.ДатаВторогоДокументаОснования
	|			КОНЕЦ МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ПриемНаРаботу.Организация = &Организация
	|		И ПриемНаРаботу.ОтразитьВТрудовойКнижке
	|		И ПриемНаРаботу.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Увольнение.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА Увольнение.Дата
	|			КОГДА Увольнение.ДатаВторогоДокументаОснования > Увольнение.Дата
	|				ТОГДА Увольнение.Дата
	|			ИНАЧЕ Увольнение.ДатаВторогоДокументаОснования
	|		КОНЕЦ,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	ИЗ
	|		Документ.Увольнение КАК Увольнение
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА Увольнение.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА Увольнение.Дата
	|				КОГДА Увольнение.ДатаВторогоДокументаОснования > Увольнение.Дата
	|					ТОГДА Увольнение.Дата
	|				ИНАЧЕ Увольнение.ДатаВторогоДокументаОснования
	|			КОНЕЦ МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И Увольнение.Организация = &Организация
	|		И Увольнение.ОтразитьВТрудовойКнижке
	|		И Увольнение.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТекущиеКадровыеДанныеСотрудников.ДатаПриема,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	ИЗ
	|		РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|	ГДЕ
	|		ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|		И ТекущиеКадровыеДанныеСотрудников.ДатаПриема МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	ИЗ
	|		РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|	ГДЕ
	|		ТекущиеКадровыеДанныеСотрудников.ОформленПоТрудовомуДоговору
	|		И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорРаботыУслуги.Дата,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	ИЗ
	|		Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
	|	ГДЕ
	|		ДоговорРаботыУслуги.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ДоговорРаботыУслуги.Организация = &Организация
	|		И ДоговорРаботыУслуги.ОтразитьТрудовуюДеятельность
	|		И ДоговорРаботыУслуги.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДоговорРаботыУслуги.ДатаОкончания,
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	ИЗ
	|		Документ.ДоговорРаботыУслуги КАК ДоговорРаботыУслуги
	|	ГДЕ
	|		ДоговорРаботыУслуги.ДатаОкончания МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ДоговорРаботыУслуги.Организация = &Организация
	|		И ДоговорРаботыУслуги.ОтразитьТрудовуюДеятельность
	|		И ДоговорРаботыУслуги.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Дата, МЕСЯЦ),
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|	ИЗ
	|		Документ.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности КАК ЗаявленияОПредоставленииСведенийОТрудовойДеятельности
	|	ГДЕ
	|		ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Организация = &Организация
	|		И ЗаявленияОПредоставленииСведенийОТрудовойДеятельности.Проведен
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НАЧАЛОПЕРИОДА(ВЫБОР
	|				КОГДА КадровыйПеревод.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КадровыйПеревод.Дата
	|				КОГДА КадровыйПеревод.ДатаВторогоДокументаОснования > КадровыйПеревод.Дата
	|					ТОГДА КадровыйПеревод.Дата
	|				ИНАЧЕ КадровыйПеревод.ДатаВторогоДокументаОснования
	|			КОНЕЦ, МЕСЯЦ),
	|		ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|	ИЗ
	|		Документ.КадровыйПеревод КАК КадровыйПеревод
	|	ГДЕ
	|		ВЫБОР
	|				КОГДА КадровыйПеревод.ДатаВторогоДокументаОснования = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КадровыйПеревод.Дата
	|				КОГДА КадровыйПеревод.ДатаВторогоДокументаОснования > КадровыйПеревод.Дата
	|					ТОГДА КадровыйПеревод.Дата
	|				ИНАЧЕ КадровыйПеревод.ДатаВторогоДокументаОснования
	|			КОНЕЦ МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|		И КадровыйПеревод.Организация = &Организация
	|		И КадровыйПеревод.ОтразитьВТрудовойКнижке
	|		И КадровыйПеревод.Проведен) КАК КадровыеМероприятия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Период,Периодичность");
	Возврат Результат;
	
КонецФункции

Функция ИспользуетсяТрудНаемныхРаботников(Организация)
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		Возврат Истина;
	Иначе
		Возврат РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(Организация);
	КонецЕсли;
	
КонецФункции

Функция ПериодыВыплатыЗарплаты(Организация, НачалоПериода, КонецПериода)
	
	Результат = Новый Массив;
	
	Если Не ИспользуетсяТрудНаемныхРаботников(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыПолучения = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолучения.Организация = Организация;
	ПараметрыПолучения.КадровыеДанные = "Организация,ДатаПриема,ДатаУвольнения";
	ПараметрыПолучения.ОтбиратьПоГоловнойОрганизации = Ложь;
	ПараметрыПолучения.НачалоПериода = НачалоПериода;
	ПараметрыПолучения.ОкончаниеПериода = КонецПериода;
	ПараметрыПолучения.Отборы = Неопределено;
	ПараметрыПолучения.РаботникиПоДоговорамГПХ = Истина;
	
	СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолучения);
	
	Если СотрудникиОрганизации.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СотрудникиОрганизации", СотрудникиОрганизации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", НачалоДня(КонецПериода));
	
	// Метод КадровыйУчет.СотрудникиОрганизации() не возвращает даты начала и окончания работы
	// по договорам ГПХ. Эти данные следует выбрать отдельно.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	СотрудникиОрганизации.ДатаПриема КАК ДатаПриема,
	|	СотрудникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВсеСотрудники
	|ИЗ
	|	&СотрудникиОрганизации КАК СотрудникиОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	СотрудникиОрганизации.ДатаПриема КАК ДатаПриема,
	|	СотрудникиОрганизации.ДатаУвольнения КАК ДатаУвольнения
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	ВсеСотрудники КАК СотрудникиОрганизации
	|ГДЕ
	|	СотрудникиОрганизации.ДатаПриема > ДАТАВРЕМЯ(1, 1, 1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыГПХ.Сотрудник,
	|	ДоговорыГПХ.ДатаНачала,
	|	ДоговорыГПХ.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера КАК ДоговорыГПХ
	|ГДЕ
	|	ДоговорыГПХ.ДатаНачала <= &КонецПериода
	|	И ДоговорыГПХ.ДатаОкончания >= &НачалоПериода
	|	И ДоговорыГПХ.Организация = &Организация
	|	И ДоговорыГПХ.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВсеСотрудники.Сотрудник
	|			ИЗ
	|				ВсеСотрудники)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтпускБезСохраненияОплаты.Сотрудник КАК Сотрудник,
	|	ОтпускБезСохраненияОплаты.ДатаНачала КАК ДатаНачала,
	|	ОтпускБезСохраненияОплаты.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ОтпускБезСохраненияОплаты
	|ИЗ
	|	Документ.ОтпускБезСохраненияОплаты КАК ОтпускБезСохраненияОплаты
	|ГДЕ
	|	ОтпускБезСохраненияОплаты.Проведен
	|	И ОтпускБезСохраненияОплаты.ДатаНачала <= &КонецПериода
	|	И ОтпускБезСохраненияОплаты.ДатаОкончания >= &НачалоПериода
	|	И ОтпускБезСохраненияОплаты.Организация = &Организация
	|	И ОтпускБезСохраненияОплаты.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВсеСотрудники.Сотрудник
	|			ИЗ
	|				ВсеСотрудники)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ДатаПриема КАК ДатаПриема,
	|	Сотрудники.ДатаУвольнения КАК ДатаУвольнения,
	|	ЕСТЬNULL(ОтпускБезСохраненияОплаты.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачалаОтпуска,
	|	ЕСТЬNULL(ОтпускБезСохраненияОплаты.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончанияОтпуска
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|		ПОЛНОЕ СОЕДИНЕНИЕ ОтпускБезСохраненияОплаты КАК ОтпускБезСохраненияОплаты
	|		ПО Сотрудники.Сотрудник = ОтпускБезСохраненияОплаты.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ДатаПриема";
	
	ДанныеСотрудников = Запрос.Выполнить().Выгрузить();
	
	НачалоТекущегоПериода = НачалоПериода;
	ПустаяДата = Дата(1,1,1);
	Пока НачалоТекущегоПериода < КонецПериода Цикл
		КонецТекущегоПериода = КонецМесяца(НачалоТекущегоПериода);
		Для Каждого Строка Из ДанныеСотрудников Цикл
			Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда
				Продолжить;
			КонецЕсли;
			
			СотрудникРаботает = Ложь;
			ОтсутствуетУвольнение = Строка.ДатаУвольнения = ПустаяДата;
			
			Если ОтсутствуетУвольнение Тогда
				// Сотрудник после трудоустройства не увольнялся.
				Если Строка.ДатаПриема <= КонецТекущегоПериода Тогда
					СотрудникРаботает = Истина;
				КонецЕсли;
			ИначеЕсли Макс(Строка.ДатаПриема, НачалоТекущегоПериода) <= Мин(Строка.ДатаУвольнения, КонецТекущегоПериода) Тогда
				// Сотрудник уволился позже проверяемого периода.
				СотрудникРаботает = Истина;
			КонецЕсли;
			
			Если СотрудникРаботает И Строка.ДатаНачалаОтпуска > ПустаяДата Тогда
				// Отпуск без сохранения заработной платы.
				Если Строка.ДатаНачалаОтпуска <= НачалоТекущегоПериода И Строка.ДатаОкончанияОтпуска >= КонецТекущегоПериода Тогда
					СотрудникРаботает = Ложь;
				КонецЕсли;
			КонецЕсли;
			
			Если СотрудникРаботает Тогда
				Результат.Добавить(НачалоТекущегоПериода);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		НачалоТекущегоПериода = НачалоМесяца(ДобавитьМесяц(НачалоТекущегоПериода, 1));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОрганизацииРазрешенныеПользователю(Пользователь = Неопределено)
	
	Возврат ЗарплатаКадрыПовтИсп.ОрганизацииРазрешенныеПользователю(Пользователь);
	
КонецФункции

Функция ОрганизацииДанныеКоторыхДоступныПользователю(ИмяОбъектаДанных, ПравоНаИзменение = Ложь, Пользователь = Неопределено)
	
	Возврат ЗарплатаКадрыПовтИсп.ОрганизацииДанныеКоторыхДоступныПользователю(ИмяОбъектаДанных, ПравоНаИзменение, Пользователь);
	
КонецФункции

Функция НайтиЗаписиТрудовыхКнижек(Отбор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодСобытия",              Отбор.ПериодСобытия);
	Запрос.УстановитьПараметр("ПериодичностьДень",          Отбор.ПериодичностьДень);
	Запрос.УстановитьПараметр("МероприятияПриемУвольнение", МероприятияПриемУвольнение());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия
	|ПОМЕСТИТЬ МероприятияТрудовойДеятельности
	|ИЗ
	|	РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПериодичностьДень
	|				ТОГДА МероприятияТрудовойДеятельности.ВидМероприятия В (&МероприятияПриемУвольнение)
	|						И НАЧАЛОПЕРИОДА(МероприятияТрудовойДеятельности.ДатаДокументаОснования, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ПериодСобытия, ДЕНЬ)
	|			ИНАЧЕ НЕ МероприятияТрудовойДеятельности.ВидМероприятия В (&МероприятияПриемУвольнение)
	|						И НАЧАЛОПЕРИОДА(МероприятияТрудовойДеятельности.ДатаДокументаОснования, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодСобытия, МЕСЯЦ)
	|		КОНЕЦ
	|	И МероприятияТрудовойДеятельности.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МероприятияТрудовойДеятельностиПереданные.Регистратор КАК Регистратор,
	|	МероприятияТрудовойДеятельностиПереданные.Регистратор.Дата КАК РегистраторДата
	|ПОМЕСТИТЬ ПереданныеКадровыеМероприятия
	|ИЗ
	|	МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
	|		ПО МероприятияТрудовойДеятельности.ИдМероприятия = МероприятияТрудовойДеятельностиПереданные.ИдМероприятия
	|ГДЕ
	|	НЕ МероприятияТрудовойДеятельностиПереданные.Отменено
	|	И МероприятияТрудовойДеятельностиПереданные.Организация = &Организация
	|	И ТИПЗНАЧЕНИЯ(МероприятияТрудовойДеятельностиПереданные.Регистратор) = ТИП(Документ.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПереданныеКадровыеМероприятия.Регистратор КАК Ссылка,
	|	ПереданныеКадровыеМероприятия.РегистраторДата КАК Дата
	|ИЗ
	|	ПереданныеКадровыеМероприятия КАК ПереданныеКадровыеМероприятия
	|
	|СГРУППИРОВАТЬ ПО
	|	ПереданныеКадровыеМероприятия.Регистратор,
	|	ПереданныеКадровыеМероприятия.РегистраторДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПереданныеКадровыеМероприятия.РегистраторДата УБЫВ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЕстьНедооформленныеЗаписиТрудовыхКнижек(Отбор)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",                Отбор.Организация);
	Запрос.УстановитьПараметр("ПериодСобытия",              Отбор.ПериодСобытия);
	Запрос.УстановитьПараметр("ПериодичностьДень",          Отбор.ПериодичностьДень);
	Запрос.УстановитьПараметр("МероприятияПриемУвольнение", МероприятияПриемУвольнение());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия
	|ПОМЕСТИТЬ МероприятияТрудовойДеятельности
	|ИЗ
	|	РегистрСведений.МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ПериодичностьДень
	|				ТОГДА МероприятияТрудовойДеятельности.ВидМероприятия В (&МероприятияПриемУвольнение)
	|						И НАЧАЛОПЕРИОДА(МероприятияТрудовойДеятельности.ДатаДокументаОснования, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ПериодСобытия, ДЕНЬ)
	|			ИНАЧЕ НЕ МероприятияТрудовойДеятельности.ВидМероприятия В (&МероприятияПриемУвольнение)
	|					И НАЧАЛОПЕРИОДА(МероприятияТрудовойДеятельности.ДатаДокументаОснования, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&ПериодСобытия, МЕСЯЦ)
	|		КОНЕЦ
	|	И МероприятияТрудовойДеятельности.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МероприятияТрудовойДеятельности.ИдМероприятия КАК ИдМероприятия
	|ИЗ
	|	МероприятияТрудовойДеятельности КАК МероприятияТрудовойДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МероприятияТрудовойДеятельностиПереданные КАК МероприятияТрудовойДеятельностиПереданные
	|		ПО МероприятияТрудовойДеятельности.ИдМероприятия = МероприятияТрудовойДеятельностиПереданные.ИдМероприятия
	|ГДЕ
	|	МероприятияТрудовойДеятельностиПереданные.Регистратор ЕСТЬ NULL";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Функция МероприятияПриемУвольнение()
	
	МероприятияПриемУвольнение = Новый Массив;
	МероприятияПриемУвольнение.Добавить(Перечисления.ВидыМероприятийТрудовойДеятельности.Прием);
	МероприятияПриемУвольнение.Добавить(Перечисления.ВидыМероприятийТрудовойДеятельности.Увольнение);
	МероприятияПриемУвольнение.Добавить(Перечисления.ВидыМероприятийТрудовойДеятельности.НачалоДоговораГПХ);
	МероприятияПриемУвольнение.Добавить(Перечисления.ВидыМероприятийТрудовойДеятельности.ОкончаниеДоговораГПХ);
	
	Возврат МероприятияПриемУвольнение;
	
КонецФункции

#КонецОбласти