#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		СпособПроведенияОсмотра = 1;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидОсмотра",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования"));
	
	УстановитьВидимость(ЭтотОбъект);
	УстановитьЗаголовки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВАрхиве Тогда
		МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПодтвержденияСоответствия(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	Иначе
		МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ВАрхиве Тогда
		ОхранаТруда.ОбработатьДублиСтрокВТабличнойЧасти(ТекущийОбъект, "СоответствующиеВредныеФакторы", "ВредныйФактор");
	ИначеЕсли ТекущийОбъект.СоответствующиеВредныеФакторы.Количество() > 0 Тогда
		ТекущийОбъект.СоответствующиеВредныеФакторы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиВредногоФактора();
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Объект"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОсмотраПриИзменении(Элемент)
	УстановитьЗаголовки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроводитсяОднократноПриИзменении(Элемент)
	
	УстановитьВидимостьПериодичности(ЭтотОбъект);
	СпособПроведенияОсмотраПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВАрхивеПриИзменении(Элемент)
	УстановитьВидимостьСоответствия(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	ЗакрыватьПослеЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНеЗакрывать(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	
	МедицинскиеОсмотрыФормы.ПрочитатьОписаниеПериодичностиВредногоФактораВидаРабот(ЭтотОбъект, ТекущийОбъект);	
	
	Если ТекущийОбъект.Однократно Тогда
		СпособПроведенияОсмотра = 0;
	Иначе
		СпособПроведенияОсмотра = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменениеПериодичностиФактораВидаРаботПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("ПроверятьПериодичность", Истина);
	Если Результат.БольшеНеЗадаватьЭтотВопрос Тогда
		Объект.СоответствиеПодтверждено = Истина;
	КонецЕсли;
	
	МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтотОбъект, Истина, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Записать(Новый Структура("ПроверятьПериодичность", Ложь));
	
КонецПроцедуры

&НаСервере
Процедура СпособПроведенияОсмотраПриИзменении()
	
	Объект.Однократно = СпособПроведенияОсмотра = 0;
	
	Если Объект.Однократно Тогда
		Объект.КратностьОсмотра = Неопределено;
		Объект.ПериодичностьОсмотра = Неопределено;
		Объект.ЕдиницаПериодичностиОсмотра = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	
	УстановитьВидимостьПериодичности(Форма);
	УстановитьВидимостьСоответствия(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПериодичности(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ПериодичностьОсмотровГруппа", "Видимость", Форма.СпособПроведенияОсмотра = 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСоответствия(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СоответствующиеАктуальныеВредныеФакторыГруппа", "Видимость", Форма.Объект.ВАрхиве);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовки(Форма)
	
	Если Форма.Объект.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.МедицинскийОсмотр") Тогда
		Форма.Элементы.СоответствующиеАктуальныеВредныеФакторыГруппа.Заголовок =
			НСтр("ru = 'Соответствующие вредные факторы (виды работ) из приказа № 29н'");
		Форма.Элементы.ВАрхиве.Заголовок =
			НСтр("ru = 'Вредный фактор (вид деятельности) больше не используется'");
	ИначеЕсли Форма.Объект.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование") Тогда
		Форма.Элементы.СоответствующиеАктуальныеВредныеФакторыГруппа.Заголовок =
			НСтр("ru = 'Соответствующие вредные факторы из приказа от 20.05.2022 № 342н'");
		Форма.Элементы.ВАрхиве.Заголовок =
			НСтр("ru = 'Вредный фактор (вид деятельности) устарел (постановление от 23.09.2002 № 695)'");
	КонецЕсли;
	
КонецПроцедуры

#Область ДлительнаяОперация

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСКлиента() Экспорт
	
	ДлительнаяОперация = НачатьЗаписьДлительнойОперацией();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаписьДлительнойОперацией", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаписьДлительнойОперацией()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеОбъекта = ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запись архивного вредного фактора (вида деятельности)'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВыполнитьЗаписьОбъекта", ДанныеОбъекта);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаписьДлительнойОперацией(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ЗаписьПослеВыполненияДлительнойОперацииНаСервере(Результат.АдресРезультата);
	
	ОповеститьОЗаписиВредногоФактора();
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьПослеВыполненияДлительнойОперацииНаСервере(АдресРезультата)
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(АдресРезультата);
	ПрочитатьДанныеОбъектаВФорму(ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПрочитатьДанныеОбъектаВФорму(ТекущийОбъект)
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗаписиВредногоФактора()
	Оповестить("Запись_ВредныйФактор", Объект.Ссылка, ВладелецФормы);
КонецПроцедуры

#КонецОбласти
