#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(УдостоверенияСотрудников.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Акт уничтожения удостоверений
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
	КомандаПечати.МенеджерПечати = "Документ.АктУничтоженияУдостоверений";
	КомандаПечати.Идентификатор = "ПФ_MXL_АктУничтоженияУдостоверений";
	КомандаПечати.Представление = НСтр("ru = 'Акт уничтожения удостоверений'");
	КомандаПечати.Порядок = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктУничтоженияУдостоверений") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы(
			"Документ.АктУничтоженияУдостоверений.ПФ_MXL_АктУничтоженияУдостоверений");
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктУничтоженияУдостоверений",
			НСтр("ru = 'Акт уничтожения удостоверений'"),
			ПечатьАктаУничтоженияУдостоверения(МассивОбъектов, ОбъектыПечати, Макет), ,
			"Документ.АктУничтоженияУдостоверений.ПФ_MXL_АктУничтоженияУдостоверений");
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьАктаУничтоженияУдостоверения(МассивОбъектов, ОбъектыПечати, Макет)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктУничтоженияУдостоверений";
	
	ДанныеПечатиОбъектов = ДанныеПечатиДокументов(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ДанныеПечатиОбъектов Цикл
		
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйДокумент = Ложь;
		КонецЕсли;
		
		ДанныеДокумента = ДанныеПечати.Значение;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ШапкаПодписьЧленКомиссии = Макет.ПолучитьОбласть("ШапкаПодписьЧленКомиссии");
		ОбластьТекст1 = Макет.ПолучитьОбласть("ОбластьТекст1");
		ТаблицаШапка = Макет.ПолучитьОбласть("ТаблицаШапка");
		ТаблицаСтрока = Макет.ПолучитьОбласть("ТаблицаСтрока");
		ОбластьТекст2 = Макет.ПолучитьОбласть("ОбластьТекст2");
		ПодписьПредседатель = Макет.ПолучитьОбласть("ПодписьПредседатель");
		ПодписьЧленКомиссии = Макет.ПолучитьОбласть("ПодписьЧленКомиссии");
		ПодписьЧленКомиссииПродолжение = Макет.ПолучитьОбласть("ПодписьЧленКомиссииПродолжение");
		ОбластьТекст3 = Макет.ПолучитьОбласть("ОбластьТекст3");
		ОбластьТекст4 = Макет.ПолучитьОбласть("ОбластьТекст4");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		
		// Шапка
		Шапка.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(Шапка);
		
		// Подписи членов комиссии в шапке документа
		Для каждого ЧленКомиссии Из ДанныеДокумента.МассивЧленовКомиссии Цикл
			ШапкаПодписьЧленКомиссии.Параметры.Заполнить(ЧленКомиссии);
			ТабличныйДокумент.Вывести(ШапкаПодписьЧленКомиссии);
		КонецЦикла;
		
		// Текст акта уничтожения удостоверения 1
		ОбластьТекст1.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьТекст1);
		
		// Шапка таблицы удостоверений
		ТаблицаШапка.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ТаблицаШапка);
		
		// Строка таблицы удостоверений
		НомерСтроки = 1;
		Для каждого Удостоверение Из ДанныеДокумента.МассивУдостоверений.ДанныеУдостоверений Цикл
			ТаблицаСтрока.Параметры.Заполнить(Удостоверение); 
			ТаблицаСтрока.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			ТабличныйДокумент.Вывести(ТаблицаСтрока);
		КонецЦикла;
		
		// Текст акта уничтожения удостоверения 2
		ОбластьТекст2.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьТекст2);
		
		// Подпись преседателя комиссии
		ПодписьПредседатель.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ПодписьПредседатель);
		
		// Подписи членов комисии
		ВывестиПодписиЧленовКомиссии(ДанныеДокумента.МассивЧленовКомиссии, ПодписьЧленКомиссии, ПодписьЧленКомиссииПродолжение, ТабличныйДокумент);
		
		// Текст акта уничтожения удостоверения 3
		ОбластьТекст3.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьТекст3);
		
		// Подпись преседателя комиссии
		ПодписьПредседатель.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ПодписьПредседатель);
		
		// Подписи членов комисии
		ВывестиПодписиЧленовКомиссии(ДанныеДокумента.МассивЧленовКомиссии, ПодписьЧленКомиссии, ПодписьЧленКомиссииПродолжение, ТабличныйДокумент);
		
		// Текст акта уничтожения удостоверения 4
		ОбластьТекст4.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(ОбластьТекст4);
		
		// Подвал
		Подвал.Параметры.Заполнить(ДанныеДокумента);
		ТабличныйДокумент.Вывести(Подвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Значение.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеПечатиДокументов(МассивОбъектов)
	
	ДанныеПечатиОбъектов = Новый Соответствие;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц  = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктУничтоженияУдостоверений.Ссылка КАК Ссылка,
		|	АктУничтоженияУдостоверений.Дата КАК ДатаАкта,
		|	АктУничтоженияУдостоверений.Номер КАК НомерАкта,
		|	АктУничтоженияУдостоверений.Организация КАК Организация,
		|	ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК НаименованиеОрганизации,
		|	АктУничтоженияУдостоверений.ВидУдостоверения КАК ВидУдостоверения,
		|	ЕСТЬNULL(ВидыУдостоверений.НаименованиеПолное, """") КАК НаименованиеПолноеВидаУдостоверения,
		|	АктУничтоженияУдостоверений.ДатаПриказа КАК ДатаПриказа,
		|	АктУничтоженияУдостоверений.НомерПриказа КАК НомерПриказа,
		|	АктУничтоженияУдостоверений.СпособУничтожения КАК СпособУничтожения,
		|	АктУничтоженияУдостоверений.Руководитель КАК Руководитель,
		|	АктУничтоженияУдостоверений.ДолжностьРуководителя КАК ДолжностьРуководителя,
		|	АктУничтоженияУдостоверений.Ответственный КАК Ответственный
		|ПОМЕСТИТЬ ВТДанныеДокументов
		|ИЗ
		|	Документ.АктУничтоженияУдостоверений КАК АктУничтоженияУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО АктУничтоженияУдостоверений.Организация = Организации.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыУдостоверений КАК ВидыУдостоверений
		|		ПО АктУничтоженияУдостоверений.ВидУдостоверения = ВидыУдостоверений.Ссылка
		|ГДЕ
		|	АктУничтоженияУдостоверений.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.Ссылка КАК Ссылка,
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.Сотрудник КАК Сотрудник,
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.ФИО КАК ФИОСотрудника,
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.СерияУдостоверения КАК Серия,
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.НомерУдостоверения КАК Номер,
		|	АктУничтоженияУдостоверенийУдостоверенияСотрудников.Примечание КАК Примечание
		|ПОМЕСТИТЬ ВТУдостоверения
		|ИЗ
		|	Документ.АктУничтоженияУдостоверений.УдостоверенияСотрудников КАК АктУничтоженияУдостоверенийУдостоверенияСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО АктУничтоженияУдостоверенийУдостоверенияСотрудников.Ссылка = ДанныеДокументов.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктУничтоженияУдостоверенийКомиссия.Ссылка КАК Ссылка,
		|	ДанныеДокументов.ДатаАкта КАК Период,
		|	АктУничтоженияУдостоверенийКомиссия.ЧленКомиссии КАК ЧленКомиссии,
		|	АктУничтоженияУдостоверенийКомиссия.Должность КАК Должность,
		|	АктУничтоженияУдостоверенийКомиссия.РольВКомиссии КАК РольВКомиссии
		|ПОМЕСТИТЬ ВТКомиссия
		|ИЗ
		|	Документ.АктУничтоженияУдостоверений.Комиссия КАК АктУничтоженияУдостоверенийКомиссия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДанныеДокументов КАК ДанныеДокументов
		|		ПО АктУничтоженияУдостоверенийКомиссия.Ссылка = ДанныеДокументов.Ссылка";
	
	Запрос.Выполнить();
	
	ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеФизическихЛиц(Запрос.МенеджерВременныхТаблиц, "ВТКомиссия", "ЧленКомиссии, Период");
	КадровыйУчет.СоздатьВТКадровыеДанныеФизическихЛиц(ОписательВременныхТаблиц, Истина, "ИОФамилия, Пол");
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Комиссия.Ссылка КАК Ссылка,
		|	Комиссия.ЧленКомиссии КАК ЧленКомиссии,
		|	Комиссия.Должность КАК Должность,
		|	ЕСТЬNULL(Должности.Наименование, Комиссия.Должность) КАК ДолжностьНаименование,
		|	Комиссия.РольВКомиссии КАК РольВКомиссии,
		|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.ИОФамилия, Комиссия.ЧленКомиссии) КАК ИОФамилия,
		|	ЕСТЬNULL(КадровыеДанныеФизическихЛиц.Пол, НЕОПРЕДЕЛЕНО) КАК Пол
		|ПОМЕСТИТЬ ВТЧленыКомиссии
		|ИЗ
		|	ВТКомиссия КАК Комиссия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеФизическихЛиц КАК КадровыеДанныеФизическихЛиц
		|		ПО Комиссия.ЧленКомиссии = КадровыеДанныеФизическихЛиц.ФизическоеЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		|		ПО Комиссия.Должность = Должности.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТКадровыеДанныеФизическихЛиц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТКомиссия";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТДанныеДокументов КАК ДанныеДокументов
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокументов.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		
		ДанныеПечати = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
		ДанныеПечати.Вставить("ДатаАкта", Формат(ДанныеПечати.ДатаАкта, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("НомерАкта", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.НомерАкта, Истина, Истина));
		ДанныеПечати.Вставить("ДатаПриказа", Формат(ДанныеПечати.ДатаПриказа, "ДЛФ=ДД"));
		ДанныеПечати.Вставить("НомерПриказа", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.НомерПриказа, Истина, Истина));
		
		ДанныеПечати.Вставить("ВидУдостоверенияРодительныйПадеж",
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеПечати.НаименованиеПолноеВидаУдостоверения), 2));
			
		ДанныеПечати.Вставить("СпособУничтожения",
			СклонениеПредставленийОбъектов.ПросклонятьПредставление(НРег(ДанныеПечати.СпособУничтожения), 2));
		
		ДанныеПечати.Вставить("Город", "");
		ДанныеПечати.Вставить("ИОФамилияРуководителя", "");
		ДанныеПечати.Вставить("ПолРуководителя", "");
		ДанныеПечати.Вставить("ИОФамилияОтветственного", "");
		ДанныеПечати.Вставить("ДолжностьПредседателяКомиссии", "");
		ДанныеПечати.Вставить("ИОФамилияПредседателяКомиссии", "");
		ДанныеПечати.Вставить("МассивЧленовКомиссии", Новый Массив);
		ДанныеПечати.Вставить("МассивУдостоверений", Новый Массив);
		ДанныеПечати.Вставить("ВидУдостоверенияСклонениеПоЧислу", "");
		
		Если ЗначениеЗаполнено(Выборка.Организация) Тогда
			ДанныеОрганизаций = ЗарплатаКадрыОтчеты.ДанныеОрганизаций(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.Организация), Выборка.ДатаАкта);
			ДанныеОрганизации = ДанныеОрганизаций.Найти(Выборка.Организация, "Организация");
			Если ДанныеОрганизации <> Неопределено Тогда
				ДанныеПечати.Вставить("Город", ДанныеОрганизации.ГородФактическогоАдреса);
			КонецЕсли;
		КонецЕсли;
		
		// ФИО руководителя.
		КадровыеДанные = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ДанныеПечати.Руководитель, "ИОФамилия, Пол", ДанныеПечати.ДатаАкта);
		Для каждого СтрокаКадровыхДанных Из КадровыеДанные Цикл
			ДанныеПечати.Вставить("ИОФамилияРуководителя", СтрокаКадровыхДанных.ИОФамилия);
			ДанныеПечати.Вставить("ПолРуководителя", СтрокаКадровыхДанных.Пол);
		КонецЦикла;
		
		// Заполнение соответствия.
		ДанныеПечатиОбъектов.Вставить(Выборка.Ссылка, ДанныеПечати);
		
	КонецЦикла;
	
	// Данные удостоверений к уничтожению.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Удостоверения.Ссылка КАК Ссылка,
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.ФИОСотрудника КАК ФИОСотрудника,
		|	Удостоверения.Серия КАК Серия,
		|	Удостоверения.Номер КАК Номер,
		|	Удостоверения.Примечание КАК Примечание
		|ИЗ
		|	ВТУдостоверения КАК Удостоверения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Удостоверения.Ссылка";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивУдостоверений = Новый Структура("ДанныеУдостоверений", ОбщегоНазначения.ТаблицаЗначенийВМассив(Результат.Выгрузить()));
		
		ДанныеПечати.Вставить("МассивУдостоверений", МассивУдостоверений);
		
		ВидУдостоверенияСклонениеПоЧислу = ПолучитьСклоненияСтрокиПоЧислу(
			НРег(ДанныеПечати.НаименованиеПолноеВидаУдостоверения),
			МассивУдостоверений.Количество(),
			"",
			"ЧС=Количественное",
			"ПД=Именительный; ПЧ=ЧислоПрописью");
			
		Если ВидУдостоверенияСклонениеПоЧислу.Количество() > 0 Тогда
			ДанныеПечати.Вставить("ВидУдостоверенияСклонениеПоЧислу", Нрег(ВидУдостоверенияСклонениеПоЧислу[0]));
		КонецЕсли;
	КонецЦикла;
	
	// Данные комиссии по уничтожению.
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЧленыКомиссии.Ссылка КАК Ссылка,
		|	ЧленыКомиссии.ЧленКомиссии КАК ЧленКомиссии,
		|	ЧленыКомиссии.Должность КАК Должность,
		|	ЧленыКомиссии.Пол КАК Пол,
		|	ЧленыКомиссии.ДолжностьНаименование КАК ДолжностьНаименование,
		|	ЧленыКомиссии.РольВКомиссии КАК РольВКомиссии,
		|	ЧленыКомиссии.ИОФамилия КАК ИОФамилия
		|ИЗ
		|	ВТЧленыКомиссии КАК ЧленыКомиссии
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЧленыКомиссии.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Ссылка") Цикл
		ДанныеПечати = ДанныеПечатиОбъектов.Получить(Выборка.Ссылка);
		Если ДанныеПечати = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивЧленовКомиссии = Новый Массив;
		Пока Выборка.Следующий() Цикл
			ДанныеЧленовКомиссии = Новый Структура("ДолжностьЧленаКомиссии, ИОФамилияЧленаКомиссии");
			Если Выборка.РольВКомиссии = Перечисления.РолиЧленовКомиссииПоУничтожениюУдостоверений.Председатель Тогда
				ДанныеПечати.Вставить("ДолжностьПредседателяКомиссии", НРег(Выборка.ДолжностьНаименование));
				ДанныеПечати.Вставить("ИОФамилияПредседателяКомиссии", Выборка.ИОФамилия);
			Иначе
				ДанныеЧленовКомиссии.ДолжностьЧленаКомиссии = НРег(Выборка.ДолжностьНаименование);
				ДанныеЧленовКомиссии.ИОФамилияЧленаКомиссии = Выборка.ИОФамилия;
				МассивЧленовКомиссии.Добавить(ДанныеЧленовКомиссии);
			КонецЕсли;
			Если Выборка.РольВКомиссии = Перечисления.РолиЧленовКомиссииПоУничтожениюУдостоверений.Секретарь Тогда
				ДанныеПечати.Вставить("ИОФамилияОтветственного", Выборка.ИОФамилия);
			КонецЕсли;
		КонецЦикла;
		
		ДанныеПечати.Вставить("МассивЧленовКомиссии", МассивЧленовКомиссии);
	КонецЦикла;
	
	Возврат ДанныеПечатиОбъектов;
	
КонецФункции

Процедура ВывестиПодписиЧленовКомиссии(МассивЧленовКомиссии, ПодписьЧленКомиссии, ПодписьЧленКомиссииПродолжение, ТабличныйДокумент)
	
	НомерСтроки = 1;
	Для каждого ЧленКомиссии Из МассивЧленовКомиссии Цикл
		Если НомерСтроки = 1 Тогда
			ПодписьЧленКомиссии.Параметры.Заполнить(ЧленКомиссии);
			ТабличныйДокумент.Вывести(ПодписьЧленКомиссии);
		Иначе
			ПодписьЧленКомиссииПродолжение.Параметры.Заполнить(ЧленКомиссии);
			ТабличныйДокумент.Вывести(ПодписьЧленКомиссииПродолжение);
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

Функция УдостоверенияКУничтожению(Организация, ВидУдостоверения, Регистратор, ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения",	ВидУдостоверения);
	Запрос.УстановитьПараметр("Регистратор",		Регистратор);
	Запрос.УстановитьПараметр("ДатаАктуальности",	ДатаАктуальности);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.Регистратор КАК ДокументВозвратаУтериУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения,
		|	Удостоверения.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Регистратор <> &Регистратор
		|				И Организация = &Организация
		|				И ВидУдостоверения = &ВидУдостоверения) КАК Удостоверения
		|ГДЕ
		|	Удостоверения.СтатусУдостоверения В (ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Возвращено), ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Испорчено))";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли