#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если УдостоверенияСотрудников.Количество() = 0 Тогда
		
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'В документе нет строк для проведения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
		
	КонецЕсли;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаПриказа, "Объект.ДатаПриказа", Отказ, НСтр("ru='Дата приказа'"), , , Ложь);
	
	Удостоверения.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, ПроверяемыеРеквизиты);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидУдостоверения", ВидУдостоверения);
	Запрос.УстановитьПараметр("УдостоверенияСотрудников", УдостоверенияСотрудников.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УдостоверенияСотрудников.НомерСтроки КАК НомерСтроки,
		|	УдостоверенияСотрудников.Сотрудник КАК Сотрудник,
		|	УдостоверенияСотрудников.ДокументВозвратаУтериУдостоверения КАК ДокументВозвратаУтериУдостоверения,
		|	УдостоверенияСотрудников.СерияУдостоверения КАК СерияУдостоверения,
		|	УдостоверенияСотрудников.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТУничтоженияУдостоверений
		|ИЗ
		|	&УдостоверенияСотрудников КАК УдостоверенияСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Удостоверения.Сотрудник КАК Сотрудник,
		|	Удостоверения.Регистратор КАК Регистратор,
		|	Удостоверения.СтатусУдостоверения КАК СтатусУдостоверения,
		|	Удостоверения.СерияУдостоверения КАК СерияУдостоверения,
		|	Удостоверения.НомерУдостоверения КАК НомерУдостоверения
		|ПОМЕСТИТЬ ВТВозвратыУтериУдостоверений
		|ИЗ
		|	РегистрСведений.Удостоверения.СрезПоследних(
		|			&ДатаАктуальности,
		|			Организация = &Организация
		|				И ВидУдостоверения = &ВидУдостоверения
		|				И Регистратор <> &Ссылка
		|				И СтатусУдостоверения В (ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Возвращено), ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Испорчено))) КАК Удостоверения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УничтоженияУдостоверений.Сотрудник КАК Сотрудник,
		|	УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения КАК ДокументВозвратаУтериУдостоверения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УничтоженияУдостоверений.НомерСтроки) КАК КоличествоСтрок
		|ПОМЕСТИТЬ ВТЗадвоенныеСотрудники
		|ИЗ
		|	ВТУничтоженияУдостоверений КАК УничтоженияУдостоверений
		|
		|СГРУППИРОВАТЬ ПО
		|	УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения,
		|	УничтоженияУдостоверений.Сотрудник
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УничтоженияУдостоверений.НомерСтроки) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УничтоженияУдостоверений.НомерСтроки КАК НомерСтроки,
		|	УничтоженияУдостоверений.Сотрудник КАК Сотрудник,
		|	УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения КАК ДокументВозвратаУтериУдостоверения
		|ПОМЕСТИТЬ ВТДокументомВозвратаНеВозвращен
		|ИЗ
		|	ВТУничтоженияУдостоверений КАК УничтоженияУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ПО УничтоженияУдостоверений.Сотрудник = ВозвратыУтериУдостоверений.Сотрудник
		|			И УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения = ВозвратыУтериУдостоверений.Регистратор
		|			И УничтоженияУдостоверений.СерияУдостоверения = ВозвратыУтериУдостоверений.СерияУдостоверения
		|			И УничтоженияУдостоверений.НомерУдостоверения = ВозвратыУтериУдостоверений.НомерУдостоверения
		|ГДЕ
		|	УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения <> ЗНАЧЕНИЕ(Документ.ВозвратУтеряУдостоверений.ПустаяСсылка)
		|	И ВозвратыУтериУдостоверений.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УничтоженияУдостоверений.НомерСтроки КАК НомерСтроки,
		|	УничтоженияУдостоверений.Сотрудник КАК Сотрудник,
		|	ВозвратыУтериУдостоверений.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТНеУказанДокументВозврата
		|ИЗ
		|	ВТУничтоженияУдостоверений КАК УничтоженияУдостоверений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВозвратыУтериУдостоверений КАК ВозвратыУтериУдостоверений
		|		ПО УничтоженияУдостоверений.Сотрудник = ВозвратыУтериУдостоверений.Сотрудник
		|			И УничтоженияУдостоверений.СерияУдостоверения = ВозвратыУтериУдостоверений.СерияУдостоверения
		|			И УничтоженияУдостоверений.НомерУдостоверения = ВозвратыУтериУдостоверений.НомерУдостоверения
		|ГДЕ
		|	УничтоженияУдостоверений.ДокументВозвратаУтериУдостоверения = ЗНАЧЕНИЕ(Документ.ВозвратУтеряУдостоверений.ПустаяСсылка)
		|	И НЕ ВозвратыУтериУдостоверений.Регистратор ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(УничтоженияУдостоверений.НомерСтроки) КАК НомерСтроки,
		|	УничтоженияУдостоверений.Сотрудник КАК Сотрудник,
		|	ЗадвоенныеСотрудники.ДокументВозвратаУтериУдостоверения КАК Документ,
		|	ИСТИНА КАК НесколькоУдостоверений,
		|	ЛОЖЬ КАК ДокументомВозвратаНеВозвращен,
		|	ЛОЖЬ КАК НеУказанДокументВозврата
		|ИЗ
		|	ВТУничтоженияУдостоверений КАК УничтоженияУдостоверений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗадвоенныеСотрудники КАК ЗадвоенныеСотрудники
		|		ПО УничтоженияУдостоверений.Сотрудник = ЗадвоенныеСотрудники.Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	УничтоженияУдостоверений.Сотрудник,
		|	ЗадвоенныеСотрудники.ДокументВозвратаУтериУдостоверения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДокументомВозвратаНеВозвращен.НомерСтроки,
		|	ДокументомВозвратаНеВозвращен.Сотрудник,
		|	ДокументомВозвратаНеВозвращен.ДокументВозвратаУтериУдостоверения,
		|	ЛОЖЬ,
		|	ИСТИНА,
		|	ЛОЖЬ
		|ИЗ
		|	ВТДокументомВозвратаНеВозвращен КАК ДокументомВозвратаНеВозвращен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НеУказанДокументВозврата.НомерСтроки,
		|	НеУказанДокументВозврата.Сотрудник,
		|	НеУказанДокументВозврата.Регистратор,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ИСТИНА
		|ИЗ
		|	ВТНеУказанДокументВозврата КАК НеУказанДокументВозврата
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = "";
			ТекстОшибки = "";
			Если Выборка.НесколькоУдостоверений Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: уничтожение нескольких удостоверений по одному сотруднику и одному документу возврата невозможно.'");
			ИначеЕсли Выборка.ДокументомВозвратаНеВозвращен Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: указанным документом возврата %2 удостоверение не было возвращено.'");
			ИначеЕсли Выборка.НеУказанДокументВозврата Тогда
				ТекстОшибки = НСтр("ru='По сотруднику %1: удостоверение возвращено документом %2, необходимо указать документ возврата.'");
			КонецЕсли;
			
			ТекстСообщения = ?(ПустаяСтрока(ТекстСообщения), "", ТекстСообщения +", ")
				+ НСтр("ru='" + ТекстОшибки + "'");
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения,
				Выборка.Сотрудник,
				Выборка.Документ);
				
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				,
				"Сотрудники[" + (Выборка.НомерСтроки) + "].Сотрудник",
				"Объект",
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) <> Тип("Структура")
		И ОбщегоНазначения.ЭтоДокумент(ДанныеЗаполнения.Метаданные()) Тогда
		
		ИзВозвратаУтериУдостоверений = Ложь;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратУтеряУдостоверений") Тогда
			ИзВозвратаУтериУдостоверений = Истина;
		КонецЕсли;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Проведен, Организация");
		СписокКадровыхДанных = Удостоверения.СписокКадровыхДанных();
		
		Если Не ЗначенияРеквизитов.Проведен Тогда
			ВызватьИсключение НСтр("ru = 'Ввод на основании непроведенного документа невозможен.'");
		Иначе
			ДанныеСотрудников = Новый Массив;
			Организация = ЗначенияРеквизитов.Организация;
			Если ИзВозвратаУтериУдостоверений Тогда
				ВидУдостоверения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ВидУдостоверения");
			КонецЕсли;
			ДатаПриказа = ДанныеЗаполнения.Дата;
			
			ИмяТабличнойЧасти = "Сотрудники";
			Если ИзВозвратаУтериУдостоверений Тогда
				ИмяТабличнойЧасти = "УдостоверенияСотрудников";
			КонецЕсли;
			
			// Основание - одиночный документ.
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Сотрудник") Тогда
				
				ДанныеСотрудника = Новый Структура(СписокКадровыхДанных);
				ЗаполнитьЗначенияСвойств(ДанныеСотрудника, ДанныеЗаполнения);
				ДанныеСотрудников.Добавить(ДанныеСотрудника);
				
			// Основание - списочный документ.
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, ИмяТабличнойЧасти) Тогда
				
				Для каждого СтрокаДокумента Из ДанныеЗаполнения[ИмяТабличнойЧасти] Цикл
					ДанныеСотрудника = Новый Структура(СписокКадровыхДанных + ", СерияУдостоверения, НомерУдостоверения, ДатаВыдачи");
					ЗаполнитьЗначенияСвойств(ДанныеСотрудника, СтрокаДокумента);
					ДанныеСотрудников.Добавить(ДанныеСотрудника);
				КонецЦикла;
				
			КонецЕсли;
			
			Для каждого ДанныеСотрудника Из ДанныеСотрудников Цикл
				НоваяСтрока = УдостоверенияСотрудников.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
				
				Если ИзВозвратаУтериУдостоверений Тогда
					НоваяСтрока.ДокументВозвратаУтериУдостоверения = ДанныеЗаполнения;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктыУничтоженияУдостоверений.Ссылка.Дата КАК Период,
		|	АктыУничтоженияУдостоверений.Ссылка КАК Регистратор,
		|	ВЫРАЗИТЬ(АктыУничтоженияУдостоверений.Ссылка КАК Документ.АктУничтоженияУдостоверений).Организация КАК Организация,
		|	АктыУничтоженияУдостоверений.Сотрудник КАК Сотрудник,
		|	АктыУничтоженияУдостоверений.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫРАЗИТЬ(АктыУничтоженияУдостоверений.Ссылка КАК Документ.АктУничтоженияУдостоверений).ВидУдостоверения КАК ВидУдостоверения,
		|	ЗНАЧЕНИЕ(Перечисление.СтатусыУдостоверений.Уничтожено) КАК СтатусУдостоверения,
		|	АктыУничтоженияУдостоверений.ФИО КАК ФИО,
		|	АктыУничтоженияУдостоверений.Должность КАК Должность,
		|	АктыУничтоженияУдостоверений.СерияУдостоверения КАК СерияУдостоверения,
		|	АктыУничтоженияУдостоверений.НомерУдостоверения КАК НомерУдостоверения,
		|	АктыУничтоженияУдостоверений.ДатаВыдачи КАК ДатаВыдачи,
		|	АктыУничтоженияУдостоверений.Основание КАК Основание
		|ИЗ
		|	Документ.АктУничтоженияУдостоверений.УдостоверенияСотрудников КАК АктыУничтоженияУдостоверений
		|ГДЕ
		|	АктыУничтоженияУдостоверений.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	АктыУничтоженияУдостоверений.НомерСтроки";
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.КлассныеЧиныРанги") Тогда
		МодульКлассныеЧиныРанги = ОбщегоНазначения.ОбщийМодуль("КлассныеЧиныРанги");
		МодульКлассныеЧиныРанги.ДополнитьЗапросПолямиКлассногоЧинаРангаДляУдостоверений(Запрос.Текст, "", "АктыУничтоженияУдостоверений");
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба.ВоинскиеСпециальныеЗвания") Тогда
		МодульВоинскиеСпециальныеЗвания = ОбщегоНазначения.ОбщийМодуль("ВоинскиеСпециальныеЗвания");
		МодульВоинскиеСпециальныеЗвания.ДополнитьЗапросПолямиВоинскогоСпециальногоЗванияДляУдостоверений(Запрос.Текст, "", "АктыУничтоженияУдостоверений");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Движения.Удостоверения.Очистить();
		Движения.Удостоверения.Записывать = Истина;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.Удостоверения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли