#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОписаниеУсловий

Функция ПредставлениеУсловия(Условие) Экспорт
	
	Если Условие = УсловиеФизическиеЛица() Тогда
		Возврат НСтр("ru='Физические лица'");
		
	ИначеЕсли Условие = УсловиеЮридическиеЛица() Тогда
		Возврат НСтр("ru='Юридические лица'");
		
	ИначеЕсли Условие = УсловиеГоловнаяОрганизация() Тогда
		Возврат НСтр("ru='Головная организация'");
		
	ИначеЕсли Условие = УсловиеЕстьСотрудники() Тогда
		Возврат НСтр("ru='Есть сотрудники'");
		
	ИначеЕсли Условие = УсловиеСтраховыеВзносыСотрудников() Тогда
		Возврат НСтр("ru='Дополнительные страховые взносы сотрудников'");
		
	ИначеЕсли Условие = УсловиеОбщаяСистемаНалогообложения() Тогда
		Возврат НСтр("ru='Общая система налогообложения'");
		
	ИначеЕсли Условие = УсловиеУпрощеннаяСистемаНалогообложения() Тогда
		Возврат НСтр("ru='Упрощенная система налогообложения'");
		
	ИначеЕсли Условие = УсловиеПлательщикиНДС() Тогда
		Возврат НСтр("ru='Плательщики НДС'");
		
	ИначеЕсли Условие = УсловиеПлательщикиЕНВД() Тогда
		Возврат НСтр("ru='Плательщики ЕНВД'");
		
	ИначеЕсли Условие = УсловиеПлательщикиТорговогоСбора() Тогда
		Возврат НСтр("ru='Плательщики торгового сбора'");
		
	ИначеЕсли Условие = УсловиеЕстьЗемельныеУчастки() Тогда
		Возврат НСтр("ru='Есть земельные участки'");
		
	ИначеЕсли Условие = УсловиеЕстьТранспортныеСредства() Тогда
		Возврат НСтр("ru='Есть транспортные средства'");
		
	ИначеЕсли Условие = УсловиеЕстьИмущество() Тогда
		Возврат НСтр("ru='Есть имущество'");
		
	ИначеЕсли Условие = УсловиеБухгалтерскаяОтчетностьОбщаяФорма() Тогда
		Возврат НСтр("ru='Бухгалтерская отчетность общая форма'");
		
	ИначеЕсли Условие = УсловиеБухгалтерскаяОтчетностьМалыеПредприятия() Тогда
		Возврат НСтр("ru='Бухгалтерская отчетность малые предприятия'");
		
	ИначеЕсли Условие = УсловиеБухгалтерскаяОтчетностьНекоммерческиеОрганизации() Тогда
		Возврат НСтр("ru='Бухгалтерская отчетность некоммерческие организации'");
		
	ИначеЕсли Условие = УсловиеБухгалтерскаяОтчетностьСоциальноОриентированные() Тогда
		Возврат НСтр("ru='Бухгалтерская отчетность социально ориентированные'");
		
	ИначеЕсли Условие = УсловиеНалогНаПрибыльАвансыЕжеквартально() Тогда
		Возврат НСтр("ru='Налог на прибыль авансы ежеквартально'");
		
	ИначеЕсли Условие = УсловиеНалогНаПрибыльАвансыЕжемесячно() Тогда
		Возврат НСтр("ru='Налог на прибыль авансы ежемесячно'");
		
	ИначеЕсли Условие = УсловиеНалогНаПрибыльАвансыПоФактическойПрибыли() Тогда
		Возврат НСтр("ru='Налог на прибыль авансы по фактической прибыли'");
		
	ИначеЕсли Условие = УсловиеАкцизыОбщаяФорма() Тогда
		Возврат НСтр("ru='Акцизы общая форма'");
		
	ИначеЕсли Условие = УсловиеАкцизыОбщийСрок() Тогда
		Возврат НСтр("ru='Акцизы общий срок'");
		
	ИначеЕсли Условие = УсловиеАкцизыФормаАлкоголь() Тогда
		Возврат НСтр("ru='Акцизы форма алкоголь'");
		
	ИначеЕсли Условие = УсловиеАкцизыФормаТабак() Тогда
		Возврат НСтр("ru='Акцизы форма табак'");
		
	ИначеЕсли Условие = УсловиеАкцизыЛьготныйСрок() Тогда
		Возврат НСтр("ru='Акцизы льготный срок'");
		
	ИначеЕсли Условие = УсловиеАвансыПоАкцизам() Тогда
		Возврат НСтр("ru='Авансы по акцизам'");
		
	ИначеЕсли Условие = УсловиеРозничнаяПродажаАлкоголя() Тогда
		Возврат НСтр("ru='Розничная продажа алкогольной и спиртосодержащей продукции'");
		
	ИначеЕсли Условие = УсловиеОптоваяТорговляАлкоголем() Тогда
		Возврат НСтр("ru='Оптовая поставка спирта, алкогольной или спиртосодержащей продукции'");
		
	ИначеЕсли Условие = УсловиеПроизводствоАлгоколя() Тогда
		Возврат НСтр("ru='Производство спирта, алкогольной или спиртосодержащей продукции'");
		
	ИначеЕсли Условие = УсловиеПеревозкаАлкоголя() Тогда
		Возврат НСтр("ru='Специализированная перевозка спирта, алкогольной или спиртосодержащей продукции'");
		
	ИначеЕсли Условие = УсловиеЗадачаВыбранаПользователем() Тогда
		Возврат НСтр("ru='Задача выбрана пользователем'");
		
	ИначеЕсли Условие = УсловиеПравилоВыбраноПользователем() Тогда
		Возврат НСтр("ru='Правило выбрано пользователем'");
		
	ИначеЕсли Условие = УсловиеФиксированныеСтраховыеВзносы_Год() Тогда
		Возврат НСтр("ru='Периодичность уплаты фиксированных страховых взносов - год'");
		
	ИначеЕсли Условие = УсловиеФиксированныеСтраховыеВзносы_Квартал() Тогда
		Возврат НСтр("ru='Периодичность уплаты фиксированных страховых взносов - квартал'");
		
	ИначеЕсли Условие = УсловиеФиксированныеСтраховыеВзносы_Месяц() Тогда
		Возврат НСтр("ru='Периодичность уплаты фиксированных страховых взносов - месяц'");
		
	ИначеЕсли Условие = УсловиеОтчетностьПФРвЭлектронномВиде() Тогда
		Возврат НСтр("ru='Отчетность в ПФР представляется в электронном виде'");
		
	ИначеЕсли Условие = УсловиеОтчетностьПФРнаБумажномНосителе() Тогда
		Возврат НСтр("ru='Отчетность в ПФР представляется на бумажном носителе'");
		
	ИначеЕсли Условие = УсловиеОтчетностьФССвЭлектронномВиде() Тогда
		Возврат НСтр("ru='Отчетность в ФСС представляется в электронном виде'");
		
	ИначеЕсли Условие = УсловиеОтчетностьФССнаБумажномНосителе() Тогда
		Возврат НСтр("ru='Отчетность в ФСС представляется на бумажном носителе'");
		
	ИначеЕсли Условие = УсловиеИмпортТоваровТаможенныйСоюз() Тогда
		Возврат НСтр("ru='Импорт товаров из стран таможенного союза'");
		
	ИначеЕсли Условие = УсловиеРозничнаяПродажаПива() Тогда
		Возврат НСтр("ru='Розничная продажа пива и пивных напитков'");
		
	ИначеЕсли Условие = УсловиеСверкаДанныхНДС() Тогда
		Возврат НСтр("ru='Сверка данных НДС'");
		
	ИначеЕсли Условие = УсловиеЖурналСчетовФактур() Тогда
		Возврат НСтр("ru='Журнал счетов фактур'");
		
	ИначеЕсли Условие = УсловиеРегистрацияНовойОрганизации() Тогда
		Возврат НСтр("ru='Регистрация новой организации'");
		
	ИначеЕсли Условие = УсловиеОтчетностьНалоговогоАгентаПоНДФЛ() Тогда
		Возврат НСтр("ru='Отчетность налогового агента по НДФЛ'");
		
	ИначеЕсли Условие = УсловиеВыставлениеСчетовФактурНеплательщикамиНДС() Тогда
		Возврат НСтр("ru='Выставление счетов-фактур неплательщиками НДС'");
		
	ИначеЕсли Условие = УсловиеЕстьНалогКУплатеПоДекларации3НДФЛ() Тогда
		Возврат НСтр("ru='Есть налог к уплате по декларации 3-НДФЛ'");
		
	ИначеЕсли Условие = УсловиеНалогНаПрофессиональныйДоход() Тогда
		Возврат НСтр("ru='Налог на профессиональный доход'");
		
	ИначеЕсли Условие = УсловиеПлательщикиФиксированныхСтраховыхВзносов() Тогда
		Возврат НСтр("ru='Плательщики фиксированных страховых взносов'");
		
	ИначеЕсли Условие = УсловиеВыплачиваетсяЗарплата() Тогда
		Возврат НСтр("ru='Выплачивается зарплата'");
		
	ИначеЕсли Условие = УсловиеЕстьЛьготыПоТранспортномуЗемельномуНалогу() Тогда
		Возврат НСтр("ru='Есть льготы по транспортному и (или) земельному налогу'");
		
	ИначеЕсли Условие = УсловиеРегистрируютсяКадровыеМероприятия() Тогда
		Возврат НСтр("ru='Регистрируются кадровые мероприятия'");
		
	ИначеЕсли Условие = УсловиеНекоммерческиеОрганизации() Тогда
		Возврат НСтр("ru='Некоммерческие организации'");
		
	ИначеЕсли Условие = УсловиеАкцизыФормаНефтяноеСырье() Тогда
		Возврат НСтр("ru='Акцизы форма нефтяное сырье'");
		
	ИначеЕсли Условие = УсловиеПереходНаУСН() Тогда
		Возврат НСтр("ru='Переход на УСН'");
		
	ИначеЕсли Условие = УсловиеПереходНаПатент() Тогда
		Возврат НСтр("ru='Переход на патент'");
		
	ИначеЕсли Условие = УсловиеАУСН() Тогда
		Возврат НСтр("ru='Автоматизированная УСН'");
		
	ИначеЕсли Условие = УсловиеЕстьЗадолженностьУчредителей() Тогда
		Возврат НСтр("ru='Есть задолженность учредителей'");
		
	ИначеЕсли Условие = УсловиеОрганизацияЗарегистрированаТекущимДнем() Тогда
		Возврат НСтр("ru='Организация зарегистрирована текущим днем'");
		
	ИначеЕсли Условие = УсловиеДобровольныеВзносыВФСС() Тогда
		Возврат НСтр("ru='Добровольные взносы в ФСС'");
		
	ИначеЕсли Условие = УсловиеКлассическийПорядокУчетаНалогов() Тогда
		Возврат НСтр("ru='Классический порядок учета налогов'");
		
	ИначеЕсли Условие = УсловиеСдаетсяОтчетностьСЗВ_М() Тогда
		Возврат НСтр("ru='Сдается отчетность СЗВ-М'");
		
	ИначеЕсли Условие = УсловиеСдаетсяОтчетностьСЗВ_Стаж() Тогда
		Возврат НСтр("ru='Сдается отчетность СЗВ-СТАЖ'");
		
	ИначеЕсли Условие = УсловиеПлательщикЕНП() Тогда
		Возврат НСтр("ru='Плательщик единого налогового платежа'");
		
	ИначеЕсли Условие = УсловиеВыставлениеСчетовФактурНалоговогоАгентаНеплательщикамиНДС() Тогда
		Возврат НСтр("ru='Выставление счетов фактур налогового агента неплательщиками НДС'");
		
	ИначеЕсли Условие = УсловиеПереходНаЕНП() Тогда
		Возврат НСтр("ru='Переход на ЕНП'");
		
	ИначеЕсли Условие = УсловиеСменаОбъектаУСН() Тогда
		Возврат НСтр("ru='Смена объекта УСН'");
		
	ИначеЕсли Условие = УсловиеЗаявлениеОЗачетеВзносов() Тогда
		Возврат НСтр("ru='Заявление о зачете средств на ЕНП в счет уплаты взносов'");
		
	ИначеЕсли Условие = УсловиеНеЗаполненаДатаЗакрытия() Тогда
		Возврат НСтр("ru='Не заполнена дата закрытия'");
		
	ИначеЕсли Условие = УсловиеПлательщикиФиксированныхСтраховыхВзносовНаДатуЗакрытия() Тогда
		Возврат НСтр("ru='Плательщики фиксированных страховых взносов на дату закрытия'");
		
	ИначеЕсли Условие = УсловиеЗаполненаДатаЗакрытия() Тогда
		Возврат НСтр("ru='Заполнена дата закрытия'");
		
	ИначеЕсли Условие = УпрощенныйЗачетФиксированныхСтраховыхВзносов() Тогда
		Возврат НСтр("ru='Упрощенный зачет фиксированных страховых взносов'");
		
	ИначеЕсли Условие = УсловиеТринадцатыйПериодНДФЛ() Тогда
		Возврат НСтр("ru='НДФЛ удержанный с 23.12 по 31.12'");
		
	ИначеЕсли Условие = УсловиеЕжемесячныйПлатежНаЕНС() Тогда
		Возврат НСтр("ru='Ежемесячный платеж на ЕНС'");
		
	ИначеЕсли Условие = УсловиеПроизводилисьВыплатыИностраннымКонтрагентам() Тогда
		Возврат НСтр("ru='Производились выплаты иностранным контрагентам'");
		
	ИначеЕсли Условие = УсловиеИспользуетсяТрудЧленовЛетныхЭкипажейИлиШахтеров() Тогда
		Возврат НСтр("ru='Начисляются дополнительные страховые взносы (летные экипажи, шахтеры)'");
		
	ИначеЕсли Условие = УсловиеСтраховойСлучайВНиМ() Тогда
		Возврат НСтр("ru='Страхование на случай временной нетрудоспособности и в связи с материнством'");
		
	ИначеЕсли Условие = УсловиеСтраховойСлучайБольничный() Тогда
		Возврат НСтр("ru='Страхование на случай временной нетрудоспособности'");
		
	ИначеЕсли Условие = УсловиеЕстьГостиницы() Тогда
		Возврат НСтр("ru='Есть гостиницы'");
		
	Иначе
		Возврат Условие;
		
	КонецЕсли;
	
КонецФункции

Функция УсловиеФизическиеЛица() Экспорт
	
	Возврат "ФизическиеЛица";
	
КонецФункции

Функция УсловиеЮридическиеЛица() Экспорт
	
	Возврат "ЮридическиеЛица";
	
КонецФункции

Функция УсловиеГоловнаяОрганизация() Экспорт
	
	Возврат "ГоловнаяОрганизация";
	
КонецФункции

Функция УсловиеОбщаяСистемаНалогообложения() Экспорт
	
	Возврат "ОбщаяСистемаНалогообложения";
	
КонецФункции

Функция УсловиеУпрощеннаяСистемаНалогообложения() Экспорт
	
	Возврат "УпрощеннаяСистемаНалогообложения";
	
КонецФункции

Функция УсловиеАУСН() Экспорт
	
	Возврат "АУСН";
	
КонецФункции

Функция УсловиеПлательщикиНДС() Экспорт
	
	Возврат "ПлательщикиНДС";
	
КонецФункции

Функция УсловиеПлательщикиНДСНаУСН() Экспорт
	
	Возврат "ПлательщикиНДСНаУСН";
	
КонецФункции

Функция УсловиеПлательщикиЕНВД() Экспорт
	
	Возврат "ПлательщикиЕНВД";
	
КонецФункции

Функция УсловиеЕстьСотрудники() Экспорт
	
	Возврат "ЕстьСотрудники";
	
КонецФункции

Функция УсловиеСтраховыеВзносыСотрудников() Экспорт
	
	Возврат "СтраховыеВзносыСотрудников";
	
КонецФункции

Функция УсловиеПлательщикиТорговогоСбора() Экспорт
	
	Возврат "ПлательщикиТорговогоСбора";
	
КонецФункции

Функция УсловиеЕстьЗемельныеУчастки() Экспорт
	
	Возврат "ЕстьЗемельныеУчастки";
	
КонецФункции

Функция УсловиеЕстьТранспортныеСредства() Экспорт
	
	Возврат "ЕстьТранспортныеСредства";
	
КонецФункции

Функция УсловиеЕстьИмущество() Экспорт
	
	Возврат "ЕстьИмущество";
	
КонецФункции

Функция УсловиеЕстьДекларируемоеИмущество() Экспорт
	
	Возврат "ЕстьДекларируемоеИмущество";
	
КонецФункции

Функция УсловиеЕстьОблагаемоеНедекларируемоеИмущество() Экспорт
	
	Возврат "ЕстьОблагаемоеНедекларируемоеИмущество";
	
КонецФункции

Функция УсловиеБухгалтерскаяОтчетностьОбщаяФорма() Экспорт
	
	Возврат "БухгалтерскаяОтчетностьОбщаяФорма";
	
КонецФункции

Функция УсловиеБухгалтерскаяОтчетностьМалыеПредприятия() Экспорт
	
	Возврат "БухгалтерскаяОтчетностьМалыеПредприятия";
	
КонецФункции

Функция УсловиеБухгалтерскаяОтчетностьНекоммерческиеОрганизации() Экспорт
	
	Возврат "БухгалтерскаяОтчетностьНекоммерческиеОрганизации";
	
КонецФункции

Функция УсловиеБухгалтерскаяОтчетностьСоциальноОриентированные() Экспорт
	
	Возврат "БухгалтерскаяОтчетностьСоциальноОриентированные";
	
КонецФункции

Функция УсловиеНалогНаПрибыльАвансыЕжеквартально() Экспорт
	
	Возврат "НалогНаПрибыльАвансыЕжеквартально";
	
КонецФункции

Функция УсловиеНалогНаПрибыльАвансыЕжемесячно() Экспорт
	
	Возврат "НалогНаПрибыльАвансыЕжемесячно";
	
КонецФункции

Функция УсловиеНалогНаПрибыльАвансыПоФактическойПрибыли() Экспорт
	
	Возврат "НалогНаПрибыльАвансыПоФактическойПрибыли";
	
КонецФункции

Функция УсловиеАкцизыОбщаяФорма() Экспорт
	
	Возврат "АкцизыОбщаяФорма";
	
КонецФункции

Функция УсловиеАкцизыОбщийСрок() Экспорт
	
	Возврат "АкцизыОбщийСрок";
	
КонецФункции

Функция УсловиеАкцизыФормаАлкоголь() Экспорт
	
	Возврат "АкцизыФормаАлкоголь";
	
КонецФункции

Функция УсловиеАкцизыФормаТабак() Экспорт
	
	Возврат "АкцизыФормаТабак";
	
КонецФункции

Функция УсловиеАкцизыЛьготныйСрок() Экспорт
	
	Возврат "АкцизыЛьготныйСрок";
	
КонецФункции

Функция УсловиеАвансыПоАкцизам() Экспорт
	
	Возврат "АвансыПоАкцизам";
	
КонецФункции

Функция УсловиеРозничнаяПродажаАлкоголя() Экспорт
	
	Возврат "РозничнаяПродажаАлкоголя";
	
КонецФункции

Функция УсловиеОптоваяТорговляАлкоголем() Экспорт
	
	Возврат "ОптоваяТорговляАлкоголем";
	
КонецФункции

Функция УсловиеПроизводствоАлгоколя() Экспорт
	
	Возврат "ПроизводствоАлгоколя";
	
КонецФункции

Функция УсловиеПеревозкаАлкоголя() Экспорт
	
	Возврат "ПеревозкаАлкоголя";
	
КонецФункции

Функция УсловиеЗадачаВыбранаПользователем() Экспорт
	
	Возврат "ЗадачаВыбранаПользователем";
	
КонецФункции

Функция УсловиеПравилоВыбраноПользователем() Экспорт
	
	Возврат "ПравилоВыбраноПользователем";
	
КонецФункции

Функция УсловиеФиксированныеСтраховыеВзносы_Год() Экспорт
	
	Возврат "ФиксированныеСтраховыеВзносы_Год";
	
КонецФункции

Функция УсловиеФиксированныеСтраховыеВзносы_Квартал() Экспорт
	
	Возврат "ФиксированныеСтраховыеВзносы_Квартал";
	
КонецФункции

Функция УсловиеФиксированныеСтраховыеВзносы_Месяц() Экспорт
	
	Возврат "ФиксированныеСтраховыеВзносы_Месяц";
	
КонецФункции

Функция УсловиеОтчетностьПФРвЭлектронномВиде() Экспорт
	
	Возврат "ОтчетностьПФРвЭлектронномВиде";
	
КонецФункции

Функция УсловиеОтчетностьПФРнаБумажномНосителе() Экспорт
	
	Возврат "ОтчетностьПФРнаБумажномНосителе";
	
КонецФункции

Функция УсловиеОтчетностьФССвЭлектронномВиде() Экспорт
	
	Возврат "ОтчетностьФССвЭлектронномВиде";
	
КонецФункции

Функция УсловиеОтчетностьФССнаБумажномНосителе() Экспорт
	
	Возврат "ОтчетностьФССнаБумажномНосителе";
	
КонецФункции

Функция УсловиеИмпортТоваровТаможенныйСоюз() Экспорт
	
	Возврат "ИмпортТоваровТаможенныйСоюз";
	
КонецФункции

Функция УсловиеРозничнаяПродажаПива() Экспорт
	
	Возврат "РозничнаяПродажаПива";
	
КонецФункции

Функция УсловиеСверкаДанныхНДС() Экспорт
	
	Возврат "СверкаДанныхНДС";
	
КонецФункции

Функция УсловиеЖурналСчетовФактур() Экспорт
	
	Возврат "ЖурналСчетовФактур";
	
КонецФункции

Функция УсловиеРегистрацияНовойОрганизации() Экспорт
	
	Возврат "РегистрацияНовойОрганизации";
	
КонецФункции

Функция УсловиеОтчетностьНалоговогоАгентаПоНДФЛ() Экспорт
	
	Возврат "ОтчетностьНалоговогоАгентаПоНДФЛ";
	
КонецФункции

Функция УсловиеВыставлениеСчетовФактурНеплательщикамиНДС() Экспорт
	
	Возврат "ВыставлениеСчетовФактурНеплательщикамиНДС";
	
КонецФункции

Функция УсловиеЕстьНалогКУплатеПоДекларации3НДФЛ() Экспорт
	
	Возврат "ЕстьНалогКУплатеПоДекларации3НДФЛ";
	
КонецФункции

Функция УсловиеНалогНаПрофессиональныйДоход() Экспорт
	
	Возврат "НалогНаПрофессиональныйДоход";
	
КонецФункции

Функция УсловиеПлательщикиФиксированныхСтраховыхВзносов() Экспорт
	
	Возврат "ПлательщикиФиксированныхСтраховыхВзносов";
	
КонецФункции

Функция УсловиеВыплачиваетсяЗарплата() Экспорт
	
	Возврат "ВыплачиваетсяЗарплата";
	
КонецФункции

Функция УсловиеЗарегистрированУдержанныйАгентскийНДФЛ() Экспорт
	
	Возврат "ЗарегистрированУдержанныйАгентскийНДФЛ";
	
КонецФункции

Функция УсловиеЗарегистрированУдержанныйАгентскийНДФЛКонецМесяца() Экспорт
	
	Возврат "ЗарегистрированУдержанныйАгентскийНДФЛКонецМесяца";
	
КонецФункции

Функция УсловиеНачисленыВзносыНаТравматизм() Экспорт
	
	Возврат "НачисленыВзносыНаТравматизм";
	
КонецФункции

Функция УсловиеНачисленыСтраховыеВзносы() Экспорт
	
	Возврат "НачисленыСтраховыеВзносы";
	
КонецФункции

Функция УсловиеНачисленыСтраховыеВзносыЧленовЛетныхЭкипажейИлиШахтеров() Экспорт
	
	Возврат "НачисленыСтраховыеВзносыЧленовЛетныхЭкипажейИлиШахтеров";
	
КонецФункции

Функция УсловиеНачисленыНачисленыСтраховыеВзносыДобровольные() Экспорт
	
	Возврат "НачисленыСтраховыеВзносыДобровольные";
	
КонецФункции

Функция УсловиеЕстьЛьготыПоТранспортномуЗемельномуНалогу() Экспорт
	
	Возврат "ЕстьЛьготыПоТранспортномуЗемельномуНалогу";
	
КонецФункции

Функция УсловиеРегистрируютсяКадровыеМероприятия() Экспорт
	
	Возврат "РегистрируютсяКадровыеМероприятия";
	
КонецФункции

Функция УсловиеНекоммерческиеОрганизации() Экспорт
	
	Возврат "НекоммерческиеОрганизации";
	
КонецФункции

Функция УсловиеАкцизыФормаНефтяноеСырье() Экспорт
	
	Возврат "АкцизыФормаНефтяноеСырье";
	
КонецФункции

Функция УсловиеПереходНаУСН() Экспорт
	
	Возврат "ПереходНаУСН";
	
КонецФункции

Функция УсловиеПереходНаПатент() Экспорт
	
	Возврат "ПереходНаПатент";
	
КонецФункции

Функция УсловиеЕстьЗадолженностьУчредителей() Экспорт
	
	Возврат "ЕстьЗадолженностьУчредителей";
	
КонецФункции

Функция УсловиеОрганизацияЗарегистрированаТекущимДнем() Экспорт
	
	Возврат "ОрганизацияЗарегистрированаТекущимДнем";
	
КонецФункции

Функция УсловиеДобровольныеВзносыВФСС() Экспорт
	
	Возврат "ДобровольныеВзносыВФСС";
	
КонецФункции

Функция УсловиеКлассическийПорядокУчетаНалогов() Экспорт
	
	Возврат "КлассическийПорядокУчетаНалогов";
	
КонецФункции

Функция УсловиеСдаетсяОтчетностьСЗВ_М() Экспорт
	
	Возврат "СдаетсяОтчетностьСЗВ_М";
	
КонецФункции

Функция УсловиеСдаетсяОтчетностьСЗВ_Стаж() Экспорт
	
	Возврат "СдаетсяОтчетностьСЗВ_Стаж";
	
КонецФункции

Функция УсловиеПлательщикЕНП() Экспорт
	
	Возврат "ПлательщикЕНП";
	
КонецФункции

Функция УсловиеВыставлениеСчетовФактурНалоговогоАгентаНеплательщикамиНДС() Экспорт
	
	Возврат "ВыставлениеСчетовФактурНалоговогоАгентаНеплательщикамиНДС";
	
КонецФункции

Функция УсловиеПереходНаЕНП() Экспорт
	
	Возврат "ПереходНаЕНП";
	
КонецФункции

Функция УсловиеПлательщикЕСХН() Экспорт
	
	Возврат "ПлательщикЕСХН";
	
КонецФункции

Функция УсловиеПлательщикНДПИ() Экспорт
	
	Возврат "ПлательщикНДПИ";
	
КонецФункции

Функция УсловиеПлательщикНалогаНаИгорныйБизнес() Экспорт
	
	Возврат "ПлательщикНалогаНаИгорныйБизнес";
	
КонецФункции

Функция УсловиеПлательщикВодногоНалога() Экспорт
	
	Возврат "ПлательщикВодногоНалога";
	
КонецФункции

Функция УсловиеПлательщикиВзносовСДоходов() Экспорт
	
	Возврат "ПлательщикиВзносовСДоходов";
	
КонецФункции

Функция УсловиеСменаОбъектаУСН() Экспорт
	
	Возврат "СменаОбъектаУСН";
	
КонецФункции

Функция УсловиеЗаявлениеОЗачетеВзносов() Экспорт
	
	Возврат "ЗаявлениеОЗачетеВзносов";
	
КонецФункции

Функция УсловиеОформленыПлатежныеПорученияНаВыплатыСотрудникамАУСН()
	
	Возврат "ОформленыПлатежныеПорученияНаВыплатыСотрудникамАУСН";
	
КонецФункции

Функция УсловиеНеЗаполненаДатаЗакрытия()
	
	Возврат "НеЗаполненаДатаЗакрытия";
	
КонецФункции

Функция УсловиеПлательщикиФиксированныхСтраховыхВзносовНаДатуЗакрытия()
	
	Возврат "ПлательщикиФиксированныхСтраховыхВзносовНаДатуЗакрытия";
	
КонецФункции

Функция УсловиеЗаполненаДатаЗакрытия()
	
	Возврат "ЗаполненаДатаЗакрытия";
	
КонецФункции

Функция УпрощенныйЗачетФиксированныхСтраховыхВзносов()
	
	Возврат "УпрощенныйЗачетФиксированныхСтраховыхВзносов";
	
КонецФункции

Функция УсловиеТринадцатыйПериодНДФЛ() Экспорт
	
	Возврат "ТринадцатыйПериодНДФЛ";
	
КонецФункции

Функция УсловиеЕжемесячныйПлатежНаЕНС() Экспорт
	
	Возврат "ЕжемесячныйПлатежНаЕНС";
	
КонецФункции

Функция УсловиеПроизводилисьВыплатыИностраннымКонтрагентам() Экспорт
	
	Возврат "ПроизводилисьВыплатыИностраннымКонтрагентам";
	
КонецФункции

Функция УсловиеИспользуетсяТрудЧленовЛетныхЭкипажейИлиШахтеров() Экспорт
	
	Возврат "ИспользуетсяТрудЧленовЛетныхЭкипажейИлиШахтеров";
	
КонецФункции

Функция УсловиеУчетЗарплатыИКадровВЭтойПрограмме() Экспорт
	
	Возврат "УчетЗарплатыИКадровВЭтойПрограмме";
	
КонецФункции

Функция УсловиеСтраховойСлучайВНиМ() Экспорт
	
	Возврат "СтраховойСлучайВНиМ";
	
КонецФункции

Функция УсловиеСтраховойСлучайБольничный() Экспорт
	
	Возврат "СтраховойСлучайБольничный";
	
КонецФункции

Функция УсловиеДобровольныеПенсионныеВзносы() Экспорт
	
	Возврат "ДобровольныеПенсионныеВзносы";
	
КонецФункции

Функция УсловиеИспользуетсяОтчетностьВМинюст() Экспорт
	
	Возврат "ИспользуетсяОтчетностьВМинюст";
	
КонецФункции

Функция УсловиеОформленыВыплатыСотрудникамАУСН() Экспорт
	
	Возврат "ОформленыВыплатыСотрудникамАУСН";
	
КонецФункции

Функция УсловиеОформленыВыплатыСотрудникамАУСНКонецМесяца() Экспорт
	
	Возврат "ОформленыВыплатыСотрудникамАУСНКонецМесяца";
	
КонецФункции

Функция УсловиеОформленыВыплатыСотрудникамАУСНКонецГода() Экспорт
	
	Возврат "ОформленыВыплатыСотрудникамАУСНКонецГода";
	
КонецФункции

Функция УсловиеПлательщикТуристическогоНалога() Экспорт
	
	Возврат "ПлательщикТуристическогоНалога";
	
КонецФункции

Функция УсловиеЕстьГостиницы() Экспорт
	
	Возврат "ЕстьГостиницы";
	
КонецФункции

#КонецОбласти

Функция УсловияПоВозрастаниюСложности() Экспорт
	
	ПорядокУсловий = Новый Массив; 
	ПорядокУсловий.Добавить(УсловиеФизическиеЛица());
	ПорядокУсловий.Добавить(УсловиеЮридическиеЛица());
	ПорядокУсловий.Добавить(УсловиеОбщаяСистемаНалогообложения());
	ПорядокУсловий.Добавить(УсловиеУпрощеннаяСистемаНалогообложения());
	ПорядокУсловий.Добавить(УсловиеАУСН());
	ПорядокУсловий.Добавить(УсловиеПлательщикиНДС());
	ПорядокУсловий.Добавить(УсловиеПлательщикиЕНВД());
	
	// Все остальные считаем сложными
	
	Возврат ПорядокУсловий;
	
КонецФункции

Функция ПроверитьУсловия(УсловияПримененияПравил, Знач УсловияДляПроверки, Период, Периодичность, Организация, ВыполненныеУсловия = Неопределено) Экспорт
	
	ВыполненныеУсловия = Новый Массив;
	
	Если УсловияДляПроверки.Количество() = 0 Тогда
		Возврат Неопределено; // Все условия выполнены
	КонецЕсли;
	
	Для Каждого Условие Из УсловияДляПроверки Цикл
		
		Если УсловиеВыполняется(УсловияПримененияПравил, Условие, Период, Периодичность, Организация) Тогда
			ВыполненныеУсловия.Добавить(Условие);
		Иначе
			Возврат Условие;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено; // Все условия выполнены
	
КонецФункции

Функция УсловиеВыполняется(УсловияПримененияПравил, Условие, Период, Периодичность, Организация) Экспорт
	
	// При отсутствии описания условия проверки не проводим.
	// Такое условие не может быть выполнено.
	Если ПустаяСтрока(Условие) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	УсловиеВыполняется = Ложь;
	
	// ЮридическиеЛица, ФизическиеЛица, ЭтоГоловнаяОрганизация
	Если Условие = УсловиеФизическиеЛица() Тогда
		Возврат Не УсловияПримененияПравил.Получить("ЭтоЮридическоеЛицо");
	ИначеЕсли Условие = УсловиеЮридическиеЛица() Тогда
		Возврат УсловияПримененияПравил.Получить("ЭтоЮридическоеЛицо");
	ИначеЕсли Условие = УсловиеГоловнаяОрганизация() Тогда
		Возврат УсловияПримененияПравил.Получить("ЭтоГоловнаяОрганизация");
	КонецЕсли;
	
	// ЕстьСотрудники
	ИспользуетсяТрудНаемныхРаботников = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьИспользуетсяТрудНаемныхРаботников(
		ИспользуетсяТрудНаемныхРаботников, УсловияПримененияПравил, Организация);
	
	Если Условие = УсловиеЕстьСотрудники() Тогда
		Возврат ИспользуетсяТрудНаемныхРаботников;
	КонецЕсли;
	
	Если Условие = УсловиеВыплачиваетсяЗарплата() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплачиваетсяЗарплата(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеРегистрируютсяКадровыеМероприятия() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированыКадровыеМероприятия(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеИспользуетсяТрудЧленовЛетныхЭкипажейИлиШахтеров() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисляютсяДополнительныеВзносыЧленамЛетныхЭкипажейИлиШахтерам(
			УсловиеВыполняется, Организация);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеЗарегистрированУдержанныйАгентскийНДФЛ() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированУдержанныйАгентскийНДФЛ(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Ложь);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеЗарегистрированУдержанныйАгентскийНДФЛКонецМесяца() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЗарегистрированУдержанныйАгентскийНДФЛ(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Истина);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеНачисленыВзносыНаТравматизм() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисленыВзносыНаТравматизм(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеНачисленыСтраховыеВзносы() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисленыСтраховыеВзносы(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеНачисленыСтраховыеВзносыЧленовЛетныхЭкипажейИлиШахтеров() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисленыСтраховыеВзносыЧленовЛетныхЭкипажейИлиШахтеров(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеНачисленыНачисленыСтраховыеВзносыДобровольные() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНачисленыСтраховыеВзносыДобровольные(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// СистемаНалогообложения
	СистемаНалогообложения = РегламентированнаяОтчетностьПереопределяемый.СистемаНалогообложения(Организация, Период);
	Если Условие = УсловиеАУСН() Тогда
		Возврат ПрименяетсяАУСН(Организация, Период, Периодичность);
	ИначеЕсли Условие = УсловиеОбщаяСистемаНалогообложения() Или Условие = УсловиеУпрощеннаяСистемаНалогообложения() Или Условие = УсловиеНалогНаПрофессиональныйДоход() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСистемуНалогообложения(УсловиеВыполняется, Условие, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеПлательщикЕНП() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПлательщикЕНП(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеКлассическийПорядокУчетаНалогов() Тогда
		Возврат Не (ПрименяетсяАУСН(Организация, Период, Периодичность)
			И ПрименяетсяАУСН(Организация, ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период), Периодичность));
	КонецЕсли; 
	
	// Отдельные виды налогов
	Если Условие = УсловиеПлательщикиЕНВД() Или Условие = УсловиеПлательщикиНДС() Или Условие = УсловиеПлательщикиНДСНаУСН() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьПлательщикОтдельныхВидовНалогов(УсловиеВыполняется, Условие, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// Порядок уплаты авансов по налогу на прибыль
	Если Условие = УсловиеНалогНаПрибыльАвансыЕжеквартально() Или Условие = УсловиеНалогНаПрибыльАвансыЕжемесячно() Или Условие = УсловиеНалогНаПрибыльАвансыПоФактическойПрибыли() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьПорядокУплатыАвансовПоНалогуНаПрибыль(УсловиеВыполняется, Условие, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// Вариант бухгалтерской отчетности
	Если Условие = УсловиеБухгалтерскаяОтчетностьМалыеПредприятия() Или Условие = УсловиеБухгалтерскаяОтчетностьНекоммерческиеОрганизации()
		Или Условие = УсловиеБухгалтерскаяОтчетностьОбщаяФорма() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьВариантБухгалтерскойОтчетности(УсловиеВыполняется, Условие, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// Виды имущества
	Если Условие = УсловиеЕстьИмущество() Тогда
		Возврат ЕстьИмущество(Период, Периодичность, Организация);
	ИначеЕсли Условие = УсловиеЕстьДекларируемоеИмущество() Тогда
		Возврат ЕстьДекларируемоеИмущество(Период, Периодичность, Организация);
	ИначеЕсли Условие = УсловиеЕстьОблагаемоеНедекларируемоеИмущество() Тогда
		Возврат ЕстьОблагаемоеНедекларируемоеИмущество(Период, Периодичность, Организация);
	ИначеЕсли Условие = УсловиеЕстьТранспортныеСредства() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьЕстьТранспортныеСредства(УсловиеВыполняется, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	ИначеЕсли Условие = УсловиеЕстьЗемельныеУчастки() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьЕстьЗемельныеУчастки(УсловиеВыполняется, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// Льготы по имущественным налогам
	Если Условие = УсловиеЕстьЛьготыПоТранспортномуЗемельномуНалогу() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьЕстьЛьготыПоИмуществу(УсловиеВыполняется, Организация, Период, Периодичность);
		Возврат УсловиеВыполняется;
	КонецЕсли;
		
	// Акцизы
	Если Условие = УсловиеАкцизыОбщаяФорма() Тогда
		Возврат ЕстьАкцизыИныеТовары(Организация);
	ИначеЕсли Условие = УсловиеАкцизыФормаАлкоголь() Или Условие = УсловиеАкцизыФормаТабак() Или Условие = УсловиеАкцизыФормаНефтяноеСырье() Тогда
		Возврат ЕстьАкцизыПоВидуТоваров(Организация, Условие);
	ИначеЕсли Условие = УсловиеАкцизыОбщийСрок() Тогда
		Возврат ЕстьАкцизыОбщийСрок(Организация);
	ИначеЕсли Условие = УсловиеАкцизыЛьготныйСрок() Тогда
		Возврат ЕстьАкцизыЛьготныйСрок(Организация);
	ИначеЕсли Условие = УсловиеАвансыПоАкцизам() Тогда
		Возврат ЕстьАвансыПоАкцизам(Организация);
	КонецЕсли;
	
	// Фиксированные страховые взносы
	Если Условие = УсловиеПлательщикиФиксированныхСтраховыхВзносов() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьПлательщикФиксированныхВзносов(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеФиксированныеСтраховыеВзносы_Квартал() Или Условие = УсловиеФиксированныеСтраховыеВзносы_Год() 
		Или Условие = УсловиеФиксированныеСтраховыеВзносы_Месяц() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьПорядокУплатыФиксированныхСтраховыхВзносов(УсловиеВыполняется, Условие, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеДобровольныеВзносыВФСС() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьУплачиватьДобровольныеВзносыВФСС(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	ДатаЗакрытияОрганизации = КалендарьБухгалтераПовтИсп.ДатаЗакрытияОрганизации(Организация);
	Если Условие = УсловиеНеЗаполненаДатаЗакрытия() Тогда
		ПериодЗадачи = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		Возврат Не ЗначениеЗаполнено(ДатаЗакрытияОрганизации) Или ПериодЗадачи < ДатаЗакрытияОрганизации;
	КонецЕсли;
	
	Если Условие = УсловиеЗаполненаДатаЗакрытия() Тогда
		Если Не ЗначениеЗаполнено(ДатаЗакрытияОрганизации) Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат НачалоГода(Период) = НачалоГода(ДатаЗакрытияОрганизации);
	КонецЕсли;
	
	Если Условие = УпрощенныйЗачетФиксированныхСтраховыхВзносов() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьУпрощенныйЗачетФиксированныхСтраховыхВзносов(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
		
	Если Условие = УсловиеПлательщикиФиксированныхСтраховыхВзносовНаДатуЗакрытия() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьПлательщикФиксированныхВзносовНаДатуЗакрытия(УсловиеВыполняется, Организация, Период, ДатаЗакрытияОрганизации);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	// Представление отчетов в электронном виде
	Если Условие = УсловиеОтчетностьПФРвЭлектронномВиде() Тогда
		Возврат ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(
			Организация, 
			Перечисления.ТипыКонтролирующихОрганов.ПФР);
	ИначеЕсли Условие = УсловиеОтчетностьПФРнаБумажномНосителе() Тогда
		Возврат Не ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(
			Организация, 
			Перечисления.ТипыКонтролирующихОрганов.ПФР);
	ИначеЕсли Условие = УсловиеОтчетностьФССвЭлектронномВиде() Тогда
		Возврат ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(
			Организация, 
			Перечисления.ТипыКонтролирующихОрганов.ФСС);
	ИначеЕсли Условие = УсловиеОтчетностьФССнаБумажномНосителе() Тогда
		Возврат Не ИнтерфейсыВзаимодействияБРО.ПодключенДокументооборотСКонтролирующимОрганом(
			Организация, 
			Перечисления.ТипыКонтролирующихОрганов.ФСС);
	КонецЕсли;
	
	// Косвенные налоги при импорте товаров из таможенного союза
	Если Условие = УсловиеИмпортТоваровТаможенныйСоюз() Тогда
		Возврат ЕстьИмпортТоваровИзТаможенногоСоюза(Период, Периодичность, Организация);
	КонецЕсли; 
	
	Если Условие = УсловиеПлательщикиТорговогоСбора() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикТорговогоСбора(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеСверкаДанныхНДС() Или Условие = УсловиеЖурналСчетовФактур() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьВозможнаСверкаНДСЗаПериод(УсловиеВыполняется, Условие, Период, Периодичность, Организация);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеВыставлениеСчетовФактурНеплательщикамиНДС() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьВыставлениеСчетовФактурНеплательщикамиНДС(
			УсловиеВыполняется, Период, Периодичность, Организация);
		
		Возврат УсловиеВыполняется И ЕстьЗаписиКнигиПродаж(Период, Периодичность, Организация);
		
	КонецЕсли;
	
	Если Условие = УсловиеВыставлениеСчетовФактурНалоговогоАгентаНеплательщикамиНДС() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьВыставлениеСчетовФактурНеплательщикамиНДС(
			УсловиеВыполняется, Период, Периодичность, Организация);
			
		Возврат УсловиеВыполняется И ЕстьЗаписиКнигиПродажНалоговогоАгента(Период, Периодичность, Организация);
		
	КонецЕсли;
	
	// Наличие отчетности при исполнении обязанности налогового агента по НДФЛ.
	Если Условие = УсловиеОтчетностьНалоговогоАгентаПоНДФЛ() Тогда
		
		// В качестве анализируемого периода используем текущий и предыдущий налоговый период, 
		// чтобы если сейчас начало января и за текущий год еще ничего не начислялось и не оплачивалось,
		// то были учтены данные прошлого года.
		НачалоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, Период);
		НачалоПредыдущегоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, НачалоПериода - 1);
		КонецПериода  = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьСведенияОДоходахНДФЛ(УсловиеВыполняется, Организация, НачалоПредыдущегоПериода, КонецПериода);
		
		Возврат ЕстьОстаткиИОборотыПоСчетуНДФЛ(НачалоПредыдущегоПериода, КонецПериода, Организация)
			Или УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеЕстьНалогКУплатеПоДекларации3НДФЛ() Тогда
		Возврат ЕстьНалогКУплатеПоДекларации3НДФЛ(Организация, Период);
	КонецЕсли;
	
	// Регистрация новой организации.
	Если Условие = УсловиеРегистрацияНовойОрганизации() Тогда
		Возврат ОрганизацияСозданаВТекущемМесяце(Организация, Период);
	КонецЕсли;
	
	Если Условие = УсловиеНекоммерческиеОрганизации() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьЭтоНекоммерческаяОрганизация(УсловиеВыполняется, Организация);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеИспользуетсяОтчетностьВМинюст() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьИспользуетсяОтчетностьВМинюст(УсловиеВыполняется, Организация);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеПереходНаУСН() Тогда
		
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		
		ПрименяетсяУСНвТекущемПериоде = РегламентированнаяОтчетность.ПрименяетсяУСН(Организация, КонецПериода);
		ПрименяетсяУСНвСледующемПериоде = РегламентированнаяОтчетность.ПрименяетсяУСН(
			Организация, КонецДня(КонецПериода) + 1);
		
		Возврат ПрименяетсяУСНвСледующемПериоде = Истина
			И ПрименяетсяУСНвТекущемПериоде <> ПрименяетсяУСНвСледующемПериоде;
		
	КонецЕсли;
	
	Если Условие = УсловиеПереходНаПатент() Тогда
		
		КонецПериода  = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		
		ПрименяетсяПатентВТекущемПериоде = Ложь;
		ПрименяетсяПатентВСледующемПериоде = Ложь;
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПрименяетсяУСНПатент(ПрименяетсяПатентВТекущемПериоде, Организация, КонецПериода);
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПрименяетсяУСНПатент(ПрименяетсяПатентВСледующемПериоде, Организация, КонецГода(КонецПериода) + 1);
		
		Возврат ПрименяетсяПатентВСледующемПериоде = Истина
			И ПрименяетсяПатентВТекущемПериоде <> ПрименяетсяПатентВСледующемПериоде;
		
	КонецЕсли;
		
	Если Условие = УсловиеПереходНаЕНП() Тогда
		
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		
		ПрименяетсяЕНПвТекущемПериоде = Ложь;
		ПрименяетсяЕНПвСледующемПериоде = Ложь;
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПлательщикЕНП(ПрименяетсяЕНПвТекущемПериоде, Организация, КонецПериода);
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПлательщикЕНП(ПрименяетсяЕНПвСледующемПериоде, Организация, КонецДня(КонецПериода) + 1);
		
		Возврат ПрименяетсяЕНПвСледующемПериоде = Истина
				И ПрименяетсяЕНПвТекущемПериоде <> ПрименяетсяЕНПвСледующемПериоде;
		
	КонецЕсли;
		
	Если Условие = УсловиеЕстьЗадолженностьУчредителей() Тогда 
		Возврат ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала(Организация);
	КонецЕсли;
	
	// Проверяется, что организация зарегистрирована текущем днем
	// Актуально только для задач с периодичностью "День"
	Если Условие = УсловиеОрганизацияЗарегистрированаТекущимДнем() Тогда 
		Возврат ОрганизацияЗарегистрированаТекущимДнем(Организация, Период);
	КонецЕсли;
	
	// Федеральный закон от 25.02.2022 № 18-ФЗ
	// В общем случае отчетность по форме СЗВ-М сдается организациями и ИП, если есть сотрудники,
	// кроме случая для организаций и ИП на АУСН. В данном случае СЗВ-М необходимо сдавать только, если:
	//  - есть исполнители по договорам ГПХ, авторского заказа;
	//  - другие лица, которые работают не по трудовому договору.
	Если Условие = УсловиеСдаетсяОтчетностьСЗВ_М() Тогда
		
		Если Не ПрименяетсяАУСН(Организация, Период, Периодичность) Тогда
			Возврат ИспользуетсяТрудНаемныхРаботников;
		Иначе
			УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДоговорыПодряда(УсловиеВыполняется, Организация, Период, Периодичность);
	
			Возврат ИспользуетсяТрудНаемныхРаботников И УсловиеВыполняется;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Условие = УсловиеОформленыПлатежныеПорученияНаВыплатыСотрудникамАУСН() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьВыплатыСотрудникамАУСН(УсловиеВыполняется, Организация, Период);
		
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	// Федеральный закон от 25.02.2022 № 18-ФЗ
	// В общем случае отчетность по форме СЗВ-СТАЖ сдается организациями и ИП, если есть сотрудники,
	// кроме случая для организаций и ИП на АУСН.
	Если Условие = УсловиеСдаетсяОтчетностьСЗВ_Стаж() Тогда
		
		Если Не ПрименяетсяАУСН(Организация, Период, Периодичность) Тогда
			Возврат ИспользуетсяТрудНаемныхРаботников;
		Иначе
			Возврат ИспользуетсяТрудНаемныхРаботников
				И СдаетсяОтчетностьСЗВ_СТАЖ(Организация, Период, Периодичность);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверяется, что организация сменила объект УСН
	Если Условие = УсловиеСменаОбъектаУСН() Тогда
		// Нужно вернуть ложь если задача должна быть в графике.
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНапоминатьОСменеОбъектаУСН(УсловиеВыполняется, Организация);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеЗаявлениеОЗачетеВзносов() Тогда
		// Заявление ИП подает для резерва денег на ЕНС для УСН доходы-расходы и ОСНО только в 2023 г.
		// С 2024 г. в расчете налога можно зачесть суммы взноса до срока списания
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьНужноЗаявлениеОЗачетеВзносов(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеБухгалтерскаяОтчетностьСоциальноОриентированные() Тогда
		// Условие устарело. Для некоммерческих организаций используется Бухгалтерия НКО.
		Возврат Ложь;
	КонецЕсли;
	
	Если Условие = УсловиеПлательщикиВзносовСДоходов() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУплачиваетсяВзносСДоходов(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если УсловияКоторымиПользовательУправляетНапрямую().Найти(Условие) <> Неопределено Тогда
		// Эти условия включаются пользователем вручную напрямую, их проверка выполняется отдельно
		Возврат Ложь;
	КонецЕсли;
	
	Если УсловияЗадачаВключаетсяПользователем().Найти(Условие) <> Неопределено Тогда
		Возврат ЗадачаПоУсловиюВключенаПользователем(УсловияПримененияПравил, Условие);
	КонецЕсли;
	
	Если Условие = УсловиеТринадцатыйПериодНДФЛ() Тогда
		Возврат Месяц(Период) = 12;
	КонецЕсли;
	
	Если Условие = УсловиеЕжемесячныйПлатежНаЕНС() Тогда
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕжемесячныйПлатежНаЕНС(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Периодичность, ИспользуетсяТрудНаемныхРаботников);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеПроизводилисьВыплатыИностраннымКонтрагентам() Тогда
	
		НачалоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, Период);
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплатыИностраннымКонтрагентам(УсловиеВыполняется, 
			Организация, НачалоПериода, КонецПериода);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеУчетЗарплатыИКадровВЭтойПрограмме() Тогда
	
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУчетЗарплатыИКадровВЭтойПрограмме(УсловиеВыполняется);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеСтраховойСлучайВНиМ() Тогда
	
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьСтраховойСлучайВНиМ(
			УсловиеВыполняется,
			Организация,
			Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеСтраховойСлучайБольничный() Тогда
	
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьСтраховойСлучайБольничный(
			УсловиеВыполняется,
			Организация,
			Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеДобровольныеПенсионныеВзносы() Тогда
	
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьДобровольныеПенсионныеВзносы(
			УсловиеВыполняется,
			Организация,
			Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	Если Условие = УсловиеОформленыВыплатыСотрудникамАУСН() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплатыСотрудникамАУСН(
			УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Ложь);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеОформленыВыплатыСотрудникамАУСНКонецМесяца() Тогда
		УсловиеВыполняется = (Месяц(Период) <> 12);
		Если УсловиеВыполняется Тогда
			УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплатыСотрудникамАУСН(
				УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Истина);
		КонецЕсли;
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеОформленыВыплатыСотрудникамАУСНКонецГода() Тогда
		УсловиеВыполняется = (Месяц(Период) = 12);
		Если УсловиеВыполняется Тогда
			УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьВыплатыСотрудникамАУСН(
				УсловиеВыполняется, УсловияПримененияПравил, Организация, Период, Истина);
		КонецЕсли;
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	Если Условие = УсловиеПлательщикТуристическогоНалога() Тогда
				
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПлательщикТуристическогоНалога(УсловиеВыполняется, Организация, Период);
		Возврат УсловиеВыполняется;
		
	КонецЕсли;
	
	// Гостиницы
	Если Условие = УсловиеЕстьГостиницы() Тогда
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ПроверитьЕстьГостиницы(УсловиеВыполняется, Организация);
		Возврат УсловиеВыполняется;
	КонецЕсли;
	
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьУсловиеВыполняется(УсловиеВыполняется, Условие, Период, Периодичность, Организация);
	Возврат УсловиеВыполняется;
	
КонецФункции

Функция НепериодическиеУсловия() Экспорт
	
	Условия = Новый Соответствие;
	
	Условия.Вставить(УсловиеАкцизыОбщаяФорма(),   Истина);
	Условия.Вставить(УсловиеАкцизыФормаТабак(),   Истина);
	Условия.Вставить(УсловиеАкцизыОбщийСрок(),    Истина);
	Условия.Вставить(УсловиеАкцизыЛьготныйСрок(), Истина);
	Условия.Вставить(УсловиеАвансыПоАкцизам(),    Истина);
	Условия.Вставить(УсловиеЮридическиеЛица(),    Истина);
	Условия.Вставить(УсловиеФизическиеЛица(),     Истина);
	Условия.Вставить(УсловиеЕстьЗадолженностьУчредителей(), Истина);
	
	Возврат Условия;
	
КонецФункции

Функция ЕстьИмуществоЕСГС() Экспорт
	
	ЕстьИмуществоЕСГС = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмуществоЕСГС(ЕстьИмуществоЕСГС);
	Возврат ЕстьИмуществоЕСГС;
	
КонецФункции

Функция ЕстьДекларируемоеИмущество(Знач Период, Периодичность, Организация) Экспорт
	
	Если ТипЗнч(Период) = Тип("Структура") Тогда
		НачалоПериода = Период.НачалоПериода;
		КонецПериода = Период.КонецПериода;
	Иначе
		НачалоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, Период);
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
	КонецЕсли;
	
	ПлательщикНалогаНаПрибыль = Ложь;
	ЕстьИмуществоПоКадастровойСтоимости = Ложь;
	ЕстьИмуществоПоСреднегодовойСтоимости = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикНалогаНаПрибыль(ПлательщикНалогаНаПрибыль, Организация, НачалоПериода); 
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмуществоПоКадастровойСтоимости(ЕстьИмуществоПоКадастровойСтоимости,
		Организация, НачалоПериода, КонецПериода);
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмуществоПоСреднегодовойСтоимости(ЕстьИмуществоПоСреднегодовойСтоимости,
		Организация, НачалоПериода, КонецПериода);
	
	Если ИнтерфейсыВзаимодействияБРО.ЭтоИностраннаяОрганизацияПоИНН(Организация)
		 И ЕстьИмуществоПоКадастровойСтоимости Тогда
		Возврат Истина;
	ИначеЕсли Не ПлательщикНалогаНаПрибыль Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЕстьИмуществоПоСреднегодовойСтоимости;
	
КонецФункции

Функция ЕстьОблагаемоеНедекларируемоеИмущество(Знач Период, Периодичность, Организация) Экспорт
	
	Если ТипЗнч(Период) = Тип("Структура") Тогда
		НачалоПериода = Период.НачалоПериода;
		КонецПериода = Период.КонецПериода;
	Иначе
		НачалоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, Период);
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
	КонецЕсли;
	
	ЕстьИмуществоПоКадастровойСтоимости = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмуществоПоКадастровойСтоимости(ЕстьИмуществоПоКадастровойСтоимости,
		Организация, НачалоПериода, КонецПериода);
	
	Если Не ИнтерфейсыВзаимодействияБРО.ЭтоИностраннаяОрганизацияПоИНН(Организация)
		 И ЕстьИмуществоПоКадастровойСтоимости Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция КатегорииПодчиненияЗемельныхУчастковПоВидамНалогов() Экспорт
	
	КатегорииПодчинения = Новый Массив;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЗаполнитьКатегорииПодчиненияЗемельныхУчастковПоВидамНалогов(КатегорииПодчинения);
	
	Возврат КатегорииПодчинения;
	
КонецФункции

Функция КатегорииПодчиненияПатентовПоВидамНалогов() Экспорт
	
	КатегорииПодчинения = Новый Массив;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ЗаполнитьКатегорииПодчиненияПатентовПоВидамНалогов(КатегорииПодчинения);
	
	Возврат КатегорииПодчинения;
	
КонецФункции

Функция ЕстьИмпортТоваровИзТаможенногоСоюза(Период = Неопределено, Периодичность = Неопределено, Организация = Неопределено) Экспорт
	
	ЕстьИмпорт = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмпортТоваровИзТаможенногоСоюза(ЕстьИмпорт, Период, Периодичность, Организация);
	Возврат ЕстьИмпорт;
	
КонецФункции

Функция ЕстьЗаписиКнигиПродаж(Период = Неопределено, Периодичность = Неопределено, Организация = Неопределено) Экспорт
	
	ЕстьЗаписи = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьЗаписиКнигиПродаж(ЕстьЗаписи, Период, Периодичность, Организация);
	Возврат ЕстьЗаписи;
	
КонецФункции 

Функция ЕстьЗаписиКнигиПродажНалоговогоАгента(Период = Неопределено, Периодичность = Неопределено, Организация = Неопределено) Экспорт
	
	ЕстьЗаписи = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьЗаписиКнигиПродажНалоговогоАгента(ЕстьЗаписи, Период, Периодичность, Организация);
	Возврат ЕстьЗаписи;
	
КонецФункции

Функция УсловияИсключенияПоТипуОрганизации(Организация, Период = Неопределено) Экспорт
	
	УсловияИсключения = Новый Массив; 
	
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	ПлательщикНДФЛ = Ложь;
	ПлательщикНалогаНаПрибыль = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикНДФЛ(ПлательщикНДФЛ, Организация, Период);
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикНалогаНаПрибыль(ПлательщикНалогаНаПрибыль, Организация, Период);
	
	Если Не ЭтоЮрЛицо Тогда
		
		УсловияИсключения.Добавить(УсловиеЮридическиеЛица());
		
		Если НЕ РегламентированнаяОтчетность.ИПИспользуетТрудНаемныхРаботников(Организация) Тогда
			УсловияИсключения.Добавить(УсловиеЕстьСотрудники());
			УсловияИсключения.Добавить(УсловиеСтраховыеВзносыСотрудников());
		КонецЕсли;
		
		УсловияИсключения.Добавить(УсловиеРозничнаяПродажаАлкоголя());
		УсловияИсключения.Добавить(УсловиеОптоваяТорговляАлкоголем());
		УсловияИсключения.Добавить(УсловиеПроизводствоАлгоколя());
		УсловияИсключения.Добавить(УсловиеПеревозкаАлкоголя());
		
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.ДобавитьУсловияВидыПодакцизныхТоваров(УсловияИсключения);
		
		УсловияИсключения.Добавить(УсловиеЕстьЗадолженностьУчредителей());
		
	Иначе
		УсловияИсключения.Добавить(УсловиеФизическиеЛица());
	КонецЕсли;
	
	Если Период <> Неопределено Тогда
		Если РегламентированнаяОтчетность.ПрименяетсяУСН(Организация, Период) Тогда
			УсловияИсключения.Добавить(УсловиеОбщаяСистемаНалогообложения());
		КонецЕсли;
		Если ПлательщикНалогаНаПрибыль ИЛИ ПлательщикНДФЛ Тогда
			УсловияИсключения.Добавить(УсловиеУпрощеннаяСистемаНалогообложения());
		КонецЕсли;
		Если РегламентированнаяОтчетность.ЭтоПлательщикЕНВД(Организация, Неопределено, Период) = Ложь Тогда
			УсловияИсключения.Добавить(УсловиеПлательщикиЕНВД());
		КонецЕсли;
	КонецЕсли;
	
	Возврат УсловияИсключения;
	
КонецФункции

Функция ЗадачиВключенныеПользователем(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Условия", УсловияЗадачаВключаетсяПользователем());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   ПравилаПредставленияОтчетовУплатыНалогов.Ссылка.Владелец КАК Задача,
	|   ПравилаПредставленияОтчетовУплатыНалогов.Условие КАК Условие
	|ПОМЕСТИТЬ ЗадачаПоУсловию
	|ИЗ
	|   Справочник.ПравилаПредставленияОтчетовУплатыНалогов.Условия КАК ПравилаПредставленияОтчетовУплатыНалогов
	|ГДЕ
	|   ПравилаПредставленияОтчетовУплатыНалогов.Условие В(&Условия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   ВЫРАЗИТЬ(НалогиОтчеты.НалогОтчет КАК Справочник.ЗадачиБухгалтера) КАК Задача,
	|   ЗадачаПоУсловию.Условие КАК Условие
	|ИЗ
	|   РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
	|       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадачаПоУсловию КАК ЗадачаПоУсловию
	|       ПО ((ВЫРАЗИТЬ(НалогиОтчеты.НалогОтчет КАК Справочник.ЗадачиБухгалтера)) = ЗадачаПоУсловию.Задача)
	|ГДЕ
	|   НалогиОтчеты.Организация = &Организация";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Условие");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьИмущество(Знач Период, Периодичность, Организация)
	
	Если ТипЗнч(Период) = Тип("Структура") Тогда
		НачалоПериода = Период.НачалоПериода;
		КонецПериода = Период.КонецПериода;
	Иначе
		НачалоПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.НачалоПериода(Периодичность, Период);
		КонецПериода = ИнтерфейсыВзаимодействияБРОКлиентСервер.КонецПериода(Периодичность, Период);
		Период = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, КонецПериода);
	КонецЕсли;
	
	ЕстьИмущество = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьИмущество(ЕстьИмущество, Организация, НачалоПериода, КонецПериода);
	Возврат ЕстьИмущество;
	
КонецФункции

Функция ЕстьАкцизыИныеТовары(Организация)
	
	ЕстьАкцизыИныеТовары = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьАкцизыИныеТовары(ЕстьАкцизыИныеТовары, Организация);
	Возврат ЕстьАкцизыИныеТовары;
	
КонецФункции

Функция ЕстьАкцизыПоВидуТоваров(Организация, Условие)
	
	ЕстьАкцизыПоВидуТоваров = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьАкцизыПоВидуТоваров(ЕстьАкцизыПоВидуТоваров, Организация, Условие);
	Возврат ЕстьАкцизыПоВидуТоваров;
	
КонецФункции

Функция ЕстьАкцизыОбщийСрок(Организация)
	
	ЕстьАкцизыОбщийСрок = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьАкцизыОбщийСрок(ЕстьАкцизыОбщийСрок, Организация);
	Возврат ЕстьАкцизыОбщийСрок;
	
КонецФункции

Функция ЕстьАкцизыЛьготныйСрок(Организация)
	
	ЕстьАкцизыЛьготныйСрок = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьАкцизыЛьготныйСрок(ЕстьАкцизыЛьготныйСрок, Организация);
	Возврат ЕстьАкцизыЛьготныйСрок;
	
КонецФункции

Функция ЕстьАвансыПоАкцизам(Организация)
	
	ЕстьАвансыПоАкцизам = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьАвансыПоАкцизам(ЕстьАвансыПоАкцизам, Организация);
	Возврат ЕстьАвансыПоАкцизам;
	
КонецФункции

Функция ЕстьОстаткиИОборотыПоСчетуНДФЛ(НачалоПериода, КонецПериода, Организация)
	
	ЕстьОстаткиИОбороты = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьОстаткиИОборотыПоСчетуНДФЛ(ЕстьОстаткиИОбороты, НачалоПериода, КонецПериода, Организация);
	Возврат ЕстьОстаткиИОбороты;
	
КонецФункции

Функция ОрганизацияСозданаВТекущемМесяце(Организация, Период)
	
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	ДатаРегистрации = Неопределено;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.УточнитьДатуРегистрацииОрганизации(ДатаРегистрации, Организация);

	// Проверяем только юридические лица.
	Если Не ЭтоЮрЛицо Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Для организаций, зарегистрированных в декабре, считаем, что они подают отчетность в сроки предоставления годовых форм.
	// Поэтому для них отдельной задачи создавать не требуется.
	// При этом, явных разъяснений, сдавать отчет или нет при регистрации в декабре 2020 года, не опубликовано. 
	// Считаем, что лучше напомнить и подготовить отчет.
	ПоследнийГодДействияОтчета = 2020;
	Если Месяц(ДатаРегистрации) = 12
		И Год(ДатаРегистрации) < ПоследнийГодДействияОтчета Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НачалоМесяца(Период) = НачалоМесяца(ДатаРегистрации) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ЕстьНалогКУплатеПоДекларации3НДФЛ(Организация, Период)
	
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	ПлательщикНДФЛ = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоПлательщикНДФЛ(ПлательщикНДФЛ, Организация, Период);
	
	// Юридические лица не сдают 3-НДФЛ.
	Если ЭтоЮрЛицо Тогда
		Возврат Ложь;
	ИначеЕсли ПлательщикНДФЛ Тогда
		// Для ИП на ОСНО всегда отображается задача уплаты НДФЛ.
		Возврат Истина;
	Иначе
		// Для остальных ИП показываем только если пользователь явно включил напоминание о сдаче декларации.
		Правило = Справочники.ПравилаПредставленияОтчетовУплатыНалогов.НайтиПоИдентификатору("НДФЛ_Предприниматель", "2013_ИП_Декларация");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Правило", Правило);
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Результат
		|ИЗ
		|	РегистрСведений.НалогиОтчеты КАК НалогиОтчеты
		|ГДЕ
		|	НалогиОтчеты.Организация = &Организация
		|	И НалогиОтчеты.НалогОтчет = &Правило";
		
		ЕстьНалог = Не Запрос.Выполнить().Пустой();
		УсловияПримененияТребованийЗаконодательстваПереопределяемый.УточнитьЕстьНалогКУплатеПоДекларации3НДФЛ(ЕстьНалог, Организация, Период);
		Возврат ЕстьНалог;
	КонецЕсли;
	
КонецФункции

Функция ОрганизацияЗарегистрированаТекущимДнем(Организация, Период)

	ДатаРегистрации = НачалоДня(ТекущаяДатаСеанса());
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.УточнитьДатуРегистрацииОрганизации(ДатаРегистрации, Организация);
	
	Если Период = ДатаРегистрации Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ЕстьЗадолженностьУчредителейПоОплатеУставногоКапитала(Организация)
	
	ЭтоЮрЛицо = РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация);
	ЭтоОбособленноеПодразделение = Ложь;
	КодОКОПФНекорректен = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЭтоОбособленноеПодразделение(ЭтоОбособленноеПодразделение, Организация); 
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьКодОКОПФНекорректен(КодОКОПФНекорректен, Организация);
	
	Если Не ЭтоЮрЛицо Или ЭтоОбособленноеПодразделение Или КодОКОПФНекорректен Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	
	ЕстьЗадолженностьУчредителей = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьЗадолженностьУчредителей(ЕстьЗадолженностьУчредителей, Организация, ТекущаяДата);
	
	Возврат ЕстьЗадолженностьУчредителей;
	
КонецФункции

Функция ПрименяетсяАУСН(Организация, Период, Периодичность)
	
	ПрименяетсяАУСН = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьПрименяетсяАУСН(ПрименяетсяАУСН, Организация, Период, Периодичность);
	
	Возврат ПрименяетсяАУСН;
	
КонецФункции

Функция СдаетсяОтчетностьСЗВ_СТАЖ(Организация, Период, Периодичность)
	
	// Федеральный закон от 25.02.2022 № 18-ФЗ
	// В общем случае отчетность по форме СЗВ-СТАЖ сдается организациями и ИП, если есть сотрудники,
	// кроме случая для организаций и ИП на АУСН. В данном случае СЗВ-СТАЖ необходимо сдавать только, если:
	//  - есть сотрудники-ликвидаторы аварии на ЧАЭС;
	//  - есть работающие в районах Крайнего Севера и приравненных к ним местностях;
	//  - есть работающие в сельском хозяйстве; 
	//  - есть сотрудники, находящиеся в отпуске по уходу за ребенком от 1,5 до 3 лет; (нет возможности проверить в ИБ)
	//  - есть работающие в навигационный период на водном транспорте или в сезонных отраслях промышленности; (нет возможности проверить в ИБ)
	//  - есть находящиеся в отпуске без содержания;
	//  - есть исполнители по договорам ГПХ, авторского заказа;
	//  - другие лица, которые работают не по трудовому договору.
	
	ПараметрыВыполнения = Новый Структура("Организация", Организация);
	
	ПрименятьРайонныйКоэффициент = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетРайонныйКоэффициент(ПрименятьРайонныйКоэффициент, Организация, Период);
	Если ПрименятьРайонныйКоэффициент Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПрименятьСевернуюНадбавку = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияПрименяетСевернуюНадбавку(ПрименятьСевернуюНадбавку, Организация, Период);
	Если ПрименятьСевернуюНадбавку Тогда
		Возврат Истина;
	КонецЕсли;
	
	РаботаетВСельскойМестности = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьОрганизацияРаботаетВСельскойМестности(РаботаетВСельскойМестности, Организация, Период);
	Если РаботаетВСельскойМестности Тогда
		Возврат Истина;
	КонецЕсли;
	
	ДоговорыПодряда = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДоговорыПодряда(ДоговорыПодряда, Организация, Период, Периодичность);
	Если ДоговорыПодряда Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОтпускаБезСодержания = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьДокументыОтпускаБезСодержания(ОтпускаБезСодержания, Организация, Период, Периодичность);
	Если ОтпускаБезСодержания Тогда
		Возврат Истина;
	КонецЕсли;
	
	Сотрудники_ЧАЭС = Ложь;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ОпределитьЕстьСотрудники_ЧАЭС(Сотрудники_ЧАЭС, Организация, КонецГода(Период));
	Если Сотрудники_ЧАЭС Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция УсловияКоторымиПользовательУправляетНапрямую()
	
	// Эти условия пользователь устанавливает напрямую в настройках. 
	// Настройки хранятся в РегистрСведений.ВариантыПримененияТребованийЗаконодательства
	УсловияКоторымиПользовательУправляетНапрямую = Новый Массив;
	УсловияКоторымиПользовательУправляетНапрямую.Добавить(УсловиеСтраховыеВзносыСотрудников());
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ДополнитьУсловияКоторымиПользовательУправляетНапрямую(УсловияКоторымиПользовательУправляетНапрямую);
	Возврат УсловияКоторымиПользовательУправляетНапрямую;
	
КонецФункции

Функция УсловияЗадачаВключаетсяПользователем() Экспорт
	
	УсловияЗадачаВключаетсяПользователем = Новый Массив;
	УсловияПримененияТребованийЗаконодательстваПереопределяемый.ДополнитьУсловияЗадачаВключаетсяПользователем(УсловияЗадачаВключаетсяПользователем);
	Возврат Новый ФиксированныйМассив(УсловияЗадачаВключаетсяПользователем);
	
КонецФункции

Функция ЗадачаПоУсловиюВключенаПользователем(УсловияПримененияПравил, Условие)
	
	ЗадачиВключенныеПользователем = УсловияПримененияПравил.Получить("ЗадачиВключенныеПользователем");
	Возврат ЗадачиВключенныеПользователем.Найти(Условие) <> Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
