
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет запись в регистр.
//
// Параметры:
//  Документ - ОпределяемыйТип.СсылкаНаИнтегрируемыйОбъектБИА - объект, переданный в 1С:Архив.
//  Уничтожен - Булево - Признак уничтоженного объекта.
//
Процедура Добавить(Документ, Уничтожен = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при записи в документы, отправленные в 1С:Архив: ОбъектДанных не заполнен'");
	КонецЕсли;		

	Запись = СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Уничтожен = Уничтожен;
	Запись.Записать();
	
КонецПроцедуры 

// Удаляет запись по Документу.
//
// Параметры:
//  Документ - ОпределяемыеТипы.СсылкаНаИнтегрируемыйОбъектБИА - документ, запись по которому необходимо удалить.
//
Процедура Удалить(Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка при удалении документа, отправленного в 1С:Архив: ОбъектДанных не заполнен'");
	КонецЕсли;
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Документ);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

