#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем УдаляемыеРаботники;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыКадровыхСобытийУвольнение = Перечисления.ВидыКадровыхСобытий.Увольнение;
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗапрашиваемыеЗначения = Новый Структура;
		ЗапрашиваемыеЗначения.Вставить("Организация", "Объект.Организация");
		ЗапрашиваемыеЗначения.Вставить("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗапрашиваемыеЗначения);
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	НастройкиМедрегистров = МедицинскиеРегистры.ПолучитьНастройкиВзаимодействияСФедеральнымиМедрегистрами();
	ИспользоватьТокен = (НастройкиМедрегистров.СпособПодключения = Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС);
	ЗаполнитьНастройкиОрганизацииНаСервере();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Сертификат", "Видимость", ИспользоватьТокен); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Пароль", "Видимость", ИспользоватьТокен); 

	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьТекущиеПозицииРаботников();
	// Предыдущая строка меняет только несохраняемые данные, поэтому модифицированность
	// надо сбросить обратно, чтобы правильно устанавливалась доступность выгрузки.
	Модифицированность = Ложь;
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия="ОбновленаХарактеристикаОбъектаДляФедеральныхМедрегистровИзСведенийДляФРМР" Тогда 
		ОбновитьХарактеристикуОбъекта(Параметр.ОбъектСсылка, Параметр.ХарактеристикаСсылка, Параметр.ИмяРеквизита, Параметр.ИмяРеквизитаФРМР);
		ОбновитьСвязанныеХарактеристики(Параметр.ОбъектСсылка, Параметр.ХарактеристикаСсылка, Параметр.ИмяРеквизита, Параметр.ИмяРеквизитаФРМР);
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьХарактеристикуОбъекта(ОбъектСсылка, ХарактеристикаСсылка, ИмяРеквизита, ИмяРеквизитаФРМР)

	МедицинскиеРегистры.СохранитьХарактеристикуОбъектаМедицинскогоРегистра(ОбъектСсылка, ХарактеристикаСсылка.Владелец, ХарактеристикаСсылка);
	ОбновитьВсеВхожденияХарактеристики(ОбъектСсылка, ХарактеристикаСсылка, ИмяРеквизита, ИмяРеквизитаФРМР);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсеВхожденияХарактеристики(ОбъектСсылка, ХарактеристикаСсылка, ИмяРеквизита, ИмяРеквизитаФРМР)
	
	СтруктураОтбора = Новый Структура(ИмяРеквизита, ОбъектСсылка);
	ВсеСтрокиДляОбновления = Новый Массив; 
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.СтраныМира") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.Работники.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;
	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ВидыДокументовФизическихЛиц") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ДокументыУдостоверяющиеЛичность.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ВидыОбразованияФизическихЛиц") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПослевузовскоеОбразование.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("ПеречислениеСсылка.ВидыПрофессиональнойПодготовки") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ОбразованиеФизическихЛиц") Тогда 
		Если ИмяРеквизитаФРМР = "КвалификацияФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
		ИначеЕсли ИмяРеквизитаФРМР = "ЗаказчикЦелевогоОбученияФРМР" Или ИмяРеквизитаФРМР = "ПричинаРасторженияФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПослевузовскоеОбразование.НайтиСтроки(СтруктураОтбора));
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.УчебныеЗаведения") Тогда 
		Если ИмяРеквизитаФРМР = "СтранаМираФРМР" Или ИмяРеквизитаФРМР = "РеспубликаСССРФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПослевузовскоеОбразование.НайтиСтроки(СтруктураОтбора));
		ИначеЕсли ИмяРеквизитаФРМР = "УчебноеЗаведениеФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПослевузовскоеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.Сертификаты.НайтиСтроки(СтруктураОтбора));
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.КлассификаторСпециальностейПоОбразованию") Тогда 
		Если ИмяРеквизитаФРМР = "СпециальностьОрдинатурыФРМР" Или ИмяРеквизитаФРМР = "СпециальностьДокторантурыФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПослевузовскоеОбразование.НайтиСтроки(СтруктураОтбора));
		ИначеЕсли ИмяРеквизитаФРМР = "СпециальностьФРМР" Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ДополнительноеПрофессиональноеОбразование.НайтиСтроки(СтруктураОтбора));
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.Сертификаты.НайтиСтроки(СтруктураОтбора));
		КонецЕсли;
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.Должности") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ЛичноеДело.НайтиСтроки(СтруктураОтбора));
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.Квалификация.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("ПеречислениеСсылка.ВидыЗанятости") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ЛичноеДело.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("ПеречислениеСсылка.ВидыКадровыхСобытий") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ЛичноеДело.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Если ТипЗнч(ОбъектСсылка) = Тип("СправочникСсылка.ОснованияУвольнения") Тогда 
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСтрокиДляОбновления, Объект.ЛичноеДело.НайтиСтроки(СтруктураОтбора));
	КонецЕсли;

	Для Каждого СтрокаДляОбновления Из ВсеСтрокиДляОбновления Цикл
		СтрокаДляОбновления[ИмяРеквизитаФРМР] = ХарактеристикаСсылка;
		Модифицированность = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСвязанныеХарактеристики(ОбъектСсылка, ХарактеристикаСсылка, ИмяРеквизита, ИмяРеквизитаФРМР)
	id_181 = ХарактеристикаСсылка.ОписаниеЭлемента.Найти("id_181", "Поле");
	Если ЗначениеЗаполнено(id_181) Тогда
		Владелец = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду("1.2.643.5.1.13.13.99.2.181", Истина);
		ЭлементКлассификатора = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.НайтиПоКоду(id_181.Значение, Ложь, , Владелец);
		Если ЗначениеЗаполнено(Владелец) И ЗначениеЗаполнено(ЭлементКлассификатора) Тогда
			ОбновитьХарактеристикуОбъекта(ОбъектСсылка, ЭлементКлассификатора, "Должность", "МедицинскаяДолжностьФРМР");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
	ЗаполнитьНастройкиОрганизацииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗарплатаКадрыКлиент.КлючевыеРеквизитыЗаполненияФормыОчиститьТаблицы(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СертификатПриИзменении(Элемент)
	СертификатПриИзмененииНаСервере(Объект.Организация, Сертификат);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура РаботникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗаполнитьНаКлиенте(ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПередУдалением(Элемент, Отказ)
	
	УдаляемыеРаботники = Новый Массив;
	УдаляемыеСтроки = Элемент.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из УдаляемыеСтроки Цикл
		СтрокаРаботник = Объект.Работники.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если СтрокаРаботник <> Неопределено Тогда 
			УдаляемыеРаботники.Добавить(СтрокаРаботник.ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиПослеУдаления(Элемент)
	
	Для Каждого ФизическоеЛицо Из УдаляемыеРаботники Цикл
		СтрокиРаботников = Объект.Работники.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
		Если СтрокиРаботников.Количество() = 0 Тогда
			УдалитьСтрокиРаботника("ДокументыУдостоверяющиеЛичность", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ЛичноеДело", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ОбщееОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ПрофессиональноеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ПослевузовскоеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("ДополнительноеПрофессиональноеОбразование", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Сертификаты", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Награды", "ФизическоеЛицо", ФизическоеЛицо);
			УдалитьСтрокиРаботника("Квалификация", "ФизическоеЛицо", ФизическоеЛицо);
		КонецЕсли;
	КонецЦикла;
	УдаляемыеРаботники.Очистить();
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя="РаботникиФизическоеЛицо" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Ключ", ТекущиеДанные.ФизическоеЛицо);
		ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыОткрытия);
		
	Иначе 
		
		СтандартнаяОбработка = Ложь;
		СведенияМедицинскогоРаботника(Команды.Найти("СведенияМедицинскогоРаботника"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СведенияМедицинскогоРаботника(Команда)
	
	ТекущиеДанные = Элементы.Работники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийРаботник 	= ТекущиеДанные.ФизическоеЛицо;
	НовыйАдресХранилища = ДанныеМедицинскогоРаботника(ТекущийРаботник);
	
	ПараметрыРедактированияМедРаботника = Новый Структура;
	ПараметрыРедактированияМедРаботника.Вставить("Дата",	Объект.Дата);
	ПараметрыРедактированияМедРаботника.Вставить("Ссылка",	Объект.Ссылка);
	ПараметрыРедактированияМедРаботника.Вставить("ФизическоеЛицо", ТекущийРаботник);
	ПараметрыРедактированияМедРаботника.Вставить("Организация", Объект.Организация);
	ПараметрыРедактированияМедРаботника.Вставить("АдресХранилища", НовыйАдресХранилища);
	ПараметрыРедактированияМедРаботника.Вставить("НомерСтрокиРаботника", Элементы.Работники.ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("СведенияМедицинскогоРаботникаЗавершение", ЭтотОбъект, ПараметрыРедактированияМедРаботника);
	ОткрытьФорму("Документ.СведенияДляФРМР.Форма.ФормаСотрудника", ПараметрыРедактированияМедРаботника, ЭтаФорма, , , ,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СведенияМедицинскогоРаботникаЗавершение(РезультатОткрытияФормы, ПараметрыОповещения) Экспорт

	Если ПустаяСтрока(РезультатОткрытияФормы) Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьОтредактированныеДанныеРаботника(РезультатОткрытияФормы, ПараметрыОповещения.ФизическоеЛицо);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Асинх Процедура Очистить(Команда)
	
		ТекстВопроса = НСтр("ru = 'Все строки документа будут удалены. 
	                         |Очистить данные?'"); 
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда 
			Возврат;
		КонецЕсли;
		
		Объект.Работники.Очистить();
		Объект.ДокументыУдостоверяющиеЛичность.Очистить();
		Объект.ЛичноеДело.Очистить();
		Объект.ОбщееОбразование.Очистить();
		Объект.ПрофессиональноеОбразование.Очистить();
		Объект.ПослевузовскоеОбразование.Очистить();
		Объект.ДополнительноеПрофессиональноеОбразование.Очистить();
		Объект.Сертификаты.Очистить();
		Объект.Награды.Очистить();
		Объект.Квалификация.Очистить();
		
		ОбновитьВидимостьДоступность();
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура Заполнить(Команда)
	
	Если Объект.Работники.Количество() = 0 Тогда
		ЗаполнитьНаКлиенте();
		Возврат;
	КонецЕсли;
	
	// Если есть строки, то необходимо выяснить как именно заполнять: 
	// полным перезаполнением или обновлением.
	ТекстВопроса = НСтр("ru = 'Обновить данные работников 
							|или перезаполнить документ?'");
						 
	КнопкиОтвета = Новый СписокЗначений;
	КнопкиОтвета.Добавить("Заполнить", НСтр("ru = 'Заполнить'"));
	КнопкиОтвета.Добавить("Обновить", НСтр("ru = 'Обновить'"));
	КнопкиОтвета.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	Результат = Ждать ВопросАсинх(ТекстВопроса, КнопкиОтвета, , "Заполнить", НСтр("ru = 'Заполнение документа'"));
	Если Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = "Заполнить" Тогда
		ЗаполнитьНаКлиенте();
	ИначеЕсли Результат = "Обновить" Тогда
		СписокРаботников = Новый Массив;
		Для Каждого Работник Из Объект.Работники Цикл
			СписокРаботников.Добавить(Работник.ФизическоеЛицо);
		КонецЦикла;
		ЗаполнитьНаКлиенте(СписокРаботников);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	
	СтруктураОтбора = Новый Структура("ДатаПримененияОтбора", Объект.Дата);
	ПараметрыОткрытияФормы.Вставить("Отбор", СтруктураОтбора);
	
	КадровыйУчетКлиент.ВыбратьФизическихЛицОрганизации(
		Элементы.Работники, 
		Объект.Организация, 
		Истина, 
		, 
		АдресСпискаПодобранныхРаботников(), 
		, 
		ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФРМР(Команда)
	ОчиститьСообщения();
	ВыгрузитьВФРМРНаКлиенте();
	ОтправитьСопоставления(Объект.Организация);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// Подключение универсальных механизмов.
&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	// КлючевыеРеквизитыЗаполненияФормы	
	ОписаниеКлючевыхРеквизитов = Неопределено;
	ТаблицыОчищаемыеПриИзменении = Неопределено;
	ЗарплатаКадры.КлючевыеРеквизитыЗаполненияФормыЗаполнитьПредупреждения(ЭтотОбъект, ОписаниеКлючевыхРеквизитов);
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтотОбъект, , ОписаниеКлючевыхРеквизитов, ТаблицыОчищаемыеПриИзменении);
	// КлючевыеРеквизитыЗаполненияФормы
	
	ОбновитьВидимостьДоступность();
	ЗаполнитьТекущиеПозицииРаботников();
	
КонецПроцедуры

#Область ЗаполнениеДокумента

&НаКлиенте
Процедура ЗаполнитьНаКлиенте(Знач СписокРаботников = Неопределено)

	Результат = РезультатЗаполненияВДлительнойОперации(СписокРаботников);
	Если Результат.ЗаданиеВыполнено Тогда
		ОповеститьОбИзменении(Объект.Ссылка);
	Иначе
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища		 = Результат.АдресХранилища;
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция РезультатЗаполненияВДлительнойОперации(Знач СписокРаботников = Неопределено)
	
	ПараметрыЗаполнения = Новый Структура("ДанныеДляЗаполнения,Ссылка,Организация,ДатаАктуальности,СписокРаботников");
	ПараметрыЗаполнения.ДанныеДляЗаполнения = Новый Структура("Работники,ДокументыУдостоверяющиеЛичность,ЛичноеДело,ОбщееОбразование,ПрофессиональноеОбразование,ПослевузовскоеОбразование,ДополнительноеПрофессиональноеОбразование,Сертификаты,Награды,Квалификация");
	ПараметрыЗаполнения.Ссылка = Объект.Ссылка;
	ПараметрыЗаполнения.Организация = Объект.Организация;
	ПараметрыЗаполнения.ДатаАктуальности = Объект.Дата;
	ПараметрыЗаполнения.СписокРаботников = СписокРаботников;
	
	НаименованиеЗадания = НСтр("ru = 'Заполнение документа ""Сведения о медицинских работниках для ФРМР""'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Документы.СведенияДляФРМР.ПодготовитьДанныеДляЗаполнения",
		ПараметрыЗаполнения,
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗаполнениеПослеВыполненияДлительнойОперации();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				ЗаполнениеПослеВыполненияДлительнойОперации();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал,
					Истина);
			КонецЕсли;
				
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
		СообщенияПользователю = СообщенияФоновогоЗадания(ИдентификаторЗадания);
		Если СообщенияПользователю <> Неопределено Тогда
			Для Каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ВызватьИсключение;
		
	КонецПопытки;
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаСервереБезКонтекста
Функция СообщенияФоновогоЗадания(ИдентификаторЗадания)
	
	СообщенияПользователю = Новый Массив;
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю();
	КонецЕсли;
	
	Возврат СообщенияПользователю;
	
КонецФункции

&НаСервере
Процедура ЗаполнениеПослеВыполненияДлительнойОперации()
	
	Документы.СведенияДляФРМР.ЗаполнитьИзХранилища(ЭтотОбъект.Объект, АдресХранилища);
	ЗаполнитьТекущиеПозицииРаботников();
	ЗарплатаКадрыКлиентСервер.КлючевыеРеквизитыЗаполненияФормыУстановитьОтображениеПредупреждения(ЭтаФорма);
	Модифицированность = Истина;
	ОбновитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СертификатПриИзмененииНаСервере(Организация, Сертификат = Неопределено)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОрганизации = МедицинскиеРегистры.СоздатьПустыеНастройкиОрганизации();
	НастройкиОрганизации.Сертификат = Сертификат;
	
	МедицинскиеРегистры.СохранитьНастройкиОрганизации(Организация, НастройкиОрганизации);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОрганизацииНаСервере()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Если ИспользоватьТокен Тогда
			Сертификат = НастройкиОрганизации.Сертификат;
			ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьНастройкиОрганизацииНаКлиенте()
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		НастройкиОрганизации = ПрочитатьНастройкиОрганизации(Объект.Организация);
		Объект.УИНОрганизации = НастройкиОрганизации.ИдентификаторДляМедрегистров;
		Если ИспользоватьТокен Тогда
			Сертификат = НастройкиОрганизации.Сертификат;
			ИдентификаторИнформационнойСистемы = НастройкиОрганизации.ИдентификаторИнформационнойСистемы;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПрочитатьНастройкиОрганизации(Организация)
	Возврат МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация)
КонецФункции 

#КонецОбласти

#Область Редактирования

&НаКлиенте
Процедура УдалитьСтрокиРаботника(ИмяТабличнойЧасти, ИмяПоля, Работник)

	УдаляемыеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(Новый Структура(ИмяПоля, Работник));
	Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
		Объект[ИмяТабличнойЧасти].Удалить(УдаляемаяСтрока);
	КонецЦикла;	

КонецПроцедуры 

&НаСервере
Функция АдресСпискаПодобранныхРаботников()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.Работники.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьОтредактированныеДанныеРаботника(АдресХранилища, ФизическоеЛицо)

	Если Не ПустаяСтрока(АдресХранилища) Тогда
		Документы.СведенияДляФРМР.ОчиститьДанныеРаботника(Объект, ФизическоеЛицо, Истина);
		Документы.СведенияДляФРМР.ЗагрузитьОтредактированныеДанныеИзХранилища(Объект, АдресХранилища);
		Модифицированность = Истина;
		ОбновитьВидимостьДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеПозицииРаботников()

	СтатусыВыгрузкиРаботников = Документы.СведенияДляФРМР.СтатусыВыгрузкиРаботников(Объект.Ссылка, Объект.УИНОрганизации);
	
	Для Каждого Работник Из Объект.Работники Цикл 
		СтатусВыгрузки = СтатусыВыгрузкиРаботников.Получить(Работник.ФизическоеЛицо);
		Если СтатусВыгрузки=Неопределено Тогда
			Работник.СтадияВыгрузки = 0;
		Иначе  
			Работник.СтадияВыгрузки = ?(СтатусВыгрузки.ВыгрузкаНеобходима, 1, 0);
			Работник.Идентификатор = СтатусВыгрузки.Идентификатор;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДанныеМедицинскогоРаботника(ФизическоеЛицо)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыМедРаботника = Новый Структура;
	ДанныеДляЗаполнения = Новый Структура;
	СтруктураОтбораФизЛицо = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);	

	ДанныеДляЗаполнения.Вставить("Работники", ДокументОбъект.Работники.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ДокументыУдостоверяющиеЛичность", ДокументОбъект.ДокументыУдостоверяющиеЛичность.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ЛичноеДело", ДокументОбъект.ЛичноеДело.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ОбщееОбразование", ДокументОбъект.ОбщееОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ПрофессиональноеОбразование", ДокументОбъект.ПрофессиональноеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ПослевузовскоеОбразование", ДокументОбъект.ПослевузовскоеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("ДополнительноеПрофессиональноеОбразование", ДокументОбъект.ДополнительноеПрофессиональноеОбразование.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Сертификаты", ДокументОбъект.Сертификаты.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Награды", ДокументОбъект.Награды.Выгрузить(СтруктураОтбораФизЛицо));
	ДанныеДляЗаполнения.Вставить("Квалификация", ДокументОбъект.Квалификация.Выгрузить(СтруктураОтбораФизЛицо));
	
	ПараметрыМедРаботника.Вставить("ДанныеДляЗаполнения", ДанныеДляЗаполнения); 

	Возврат ПоместитьВоВременноеХранилище(ПараметрыМедРаботника);

КонецФункции

#КонецОбласти

#Область Выгрузка

&НаКлиенте
Процедура ВыгрузитьВФРМРНаКлиенте() 
	
	Если Модифицированность Тогда
		Если Не Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ПараметрыСервиса = ПараметрыСервиса();
	
	Для Каждого РаботникДляВыгрузки Из Объект.Работники Цикл
		
		Если Не РаботникДляВыгрузки.ЯвляетсяМедработником Тогда 
			Продолжить;
		КонецЕсли;
		
		ДанныеДляВыгрузки = ДанныеДляВыгрузки(Объект.Ссылка, Объект.УИНОрганизации, РаботникДляВыгрузки.ФизическоеЛицо);
		
		Если ДанныеДляВыгрузки.Работники.Количество() <> 1 Тогда 
			Продолжить;
		КонецЕсли;
		
		Работник = ДанныеДляВыгрузки.Работники[0];
		СНИЛС = МедицинскиеРегистрыКлиент.ТолькоЦифры(Работник.СтраховойНомерПФР);
		
#Область ПодборИдентификаторовФРМР
		
		ОбщиеДанныеВыгружены = Ложь;
		ПерваяЗаписьЛичногоДелаВыгружена = Ложь;

		PersonKey = PersonKey();
	    PersonKey.mo = Объект.УИНОрганизации;
	    PersonKey.mr = Работник.ЯвляетсяМедработником;
		PersonKey.snils = СНИЛС;
		
		РезультатПолучения = ПолучитьПолныеДанныеМедработника(PersonKey, ДанныеДляВыгрузки, ПараметрыСервиса, Работник, РаботникДляВыгрузки);

		Если РезультатПолучения.СообщениеОбОшибкеПользователю="Медицинский работник не найден" Тогда 
			// Сначала попробуем добавить МР путем отправки общих данных. Поскольку PersonKey.oid пока ещё установлен в Неопределено, сработает метод POST.
			ОбщиеДанныеВыгружены = Истина;
            ОтветСервиса = ОтправитьОбщиеДанные(PersonKey, ОбщиеДанныеВыгружены, ДанныеДляВыгрузки, ПараметрыСервиса, Работник);
			Если ОтветСервиса.СообщениеОбОшибкеПользователю="Указанный сотрудник уже существует" Тогда
				// Это значит, что МР в ФРМР уже есть, но нет ни одной записи ЛД в МО, от которой выполняется запрос.
				Если ДанныеДляВыгрузки.ЛичноеДело.Количество()>0 Тогда 
					ПерваяЗаписьЛичногоДелаВыгружена = Истина;
					ОтветСервиса = ОтправитьЗаписьЛичногоДела(PersonKey, ПерваяЗаписьЛичногоДелаВыгружена, ДанныеДляВыгрузки.ЛичноеДело[0], ПараметрыСервиса, Работник, Истина);
					Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
						// Вероятно, какие-то проблемы с первой записью ЛД МР в ИБ. Нет никакого смысла пытаться что-то делать с этим МР, пока это не будет исправлено.
						СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Неудачная попытка добавления первой записи личного дела медработника %1: %2%3'"), 
								Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
						ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
								СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
						Продолжить;
					КонецЕсли;	
					// Пауза после добавления первой записи ЛД необходима, чтобы отработали все последующие запросы. 
					// Без паузы они завершатся с ошибкой "Медработник не найден", как и при добавлении МР, ещё не существующего в ФРМР.
					Пауза(5);
				Иначе
					// Если в ЛД пусто, то нет никакого смысла пытаться что-то делать с этим МР.
					Продолжить;
				КонецЕсли;	
			ИначеЕсли ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
				// Вероятно, какие-то проблемы с общими данными МР в ИБ. Нет никакого смысла пытаться что-то делать с этим МР, пока его данные не будут исправлены.
				СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Неудачная попытка добавления медработника %1: %2%3'"), 
						Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
				Продолжить;
			КонецЕсли;	
		ИначеЕсли РезультатПолучения.СообщениеОбОшибкеПользователю<>Неопределено Тогда
			СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Получение подробных данных медработника %1: %2%3'"), 
					Работник.ФизическоеЛицо, РезультатПолучения.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
			Продолжить;
		КонецЕсли; 
		
#КонецОбласти
#Область ПроведениеВыгрузкиВФРМР

		ВыгрузкаПроизводилась = Ложь;
		ВыгрузкаВыполнена = Истина;
		
		// Основные данные работника.
		Если ОбщиеДанныеВыгружены Тогда
			ВыгрузкаПроизводилась = Истина;
		Иначе 
			Если ВыгрузкаНеобходима(Работник.МоментВыгрузки, Работник.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
	            ОтветСервиса = ОтправитьОбщиеДанные(PersonKey, ВыгрузкаВыполнена, ДанныеДляВыгрузки, ПараметрыСервиса, Работник);
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка базовых данных медработника %1: %2%3'"), Работник.ФизическоеЛицо, 
							ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Общее образование.
		Для Каждого ТекущееОбразование Из ДанныеДляВыгрузки.ОбщееОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonCommonData = ПодготовитьДанныеОбщегоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonCommon(PersonKey, PersonCommonData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка основного (общего) образования медработника %1: %2%3'");
				ОбразованиеВыгружено = ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, 
						Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке, РаботникДляВыгрузки.НомерСтроки);
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОбразованиеВыгружено;
			КонецЕсли;
		КонецЦикла;
		
		// Профессиональное образование.
		Для Каждого ТекущееОбразование Из ДанныеДляВыгрузки.ПрофессиональноеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonProfData = ПодготовитьДанныеПрофессиональногоОбразования(Работник, ТекущееОбразование);
				ПараметрыВызова = PostPutPersonProf(PersonKey, PersonProfData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка профессионального образования медработника %1: %2%3'");
				ОбразованиеВыгружено = ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, 
						Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке, РаботникДляВыгрузки.НомерСтроки);
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОбразованиеВыгружено;
			КонецЕсли;
		КонецЦикла;
		
		// Послевузовское образование.
		Для Каждого ТекущееОбразование Из ДанныеДляВыгрузки.ПослевузовскоеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonPostgraduateData = ПодготовитьДанныеПослевузовскогоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка послевузовского образования медработника %1: %2%3'");
				ОбразованиеВыгружено = ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, 
						Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке, РаботникДляВыгрузки.НомерСтроки);
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОбразованиеВыгружено;
			КонецЕсли;
		КонецЦикла;
		
		// Дополнительное профессиональное образование.
		Для Каждого ТекущееОбразование Из ДанныеДляВыгрузки.ДополнительноеПрофессиональноеОбразование Цикл
			Если ВыгрузкаНеобходима(ТекущееОбразование.МоментВыгрузки, ТекущееОбразование.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonExtData = ПодготовитьДанныеДополнительногоПрофессиональногоОбразования(ТекущееОбразование);
				ПараметрыВызова = PostPutPersonExt(PersonKey, PersonExtData);
				ШаблонСообщенияОбОшибке = НСтр("ru = 'Выгрузка дополнительного профессионального образования медработника %1: %2%3'");
				ОбразованиеВыгружено = ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, 
						Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке, РаботникДляВыгрузки.НомерСтроки);
				ВыгрузкаВыполнена = ВыгрузкаВыполнена И ОбразованиеВыгружено;
			КонецЕсли;
		КонецЦикла;
		
		// Сертификаты.
		Для Каждого СертификатРаботника Из ДанныеДляВыгрузки.Сертификаты Цикл
			Если ВыгрузкаНеобходима(СертификатРаботника.МоментВыгрузки, СертификатРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonCertData = ПодготовитьДанныеСертификата(СертификатРаботника);
				ПараметрыВызова = PostPutPersonCert(PersonKey, PersonCertData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							СертификатРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							СертификатРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатРаботника.Специальность, 
									СертификатРаботника.ДатаПолучения, СертификатРаботника.Идентификатор, СертификатРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						СертификатРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатРаботника.Специальность, 
								СертификатРаботника.ДатаПолучения, СертификатРаботника.Идентификатор, СертификатРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка сертификата медработника %1: %2%3'"), 
							Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Награды.
		Для Каждого НаградаРаботника Из ДанныеДляВыгрузки.Награды Цикл
			Если ВыгрузкаНеобходима(НаградаРаботника.МоментВыгрузки, НаградаРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonNominationData = ПодготовитьДанныеНаграды(НаградаРаботника);
				ПараметрыВызова = PostPutPersonNomination(PersonKey, PersonNominationData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							НаградаРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							НаградаРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаРаботника.Награда, НаградаРаботника.ДатаПриказа, 
									НаградаРаботника.НомерПриказа, НаградаРаботника.Идентификатор, НаградаРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						НаградаРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаРаботника.Награда, НаградаРаботника.ДатаПриказа, 
								НаградаРаботника.НомерПриказа, НаградаРаботника.Идентификатор, НаградаРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка награды медработника %1: %2%3'"), 
							Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
							СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Квалификация.
		Для Каждого КвалификацияРаботника Из ДанныеДляВыгрузки.Квалификация Цикл
			Если ВыгрузкаНеобходима(КвалификацияРаботника.МоментВыгрузки, КвалификацияРаботника.МоментИзменения) Тогда
				ВыгрузкаПроизводилась = Истина;
				PersonQualificationData = ПодготовитьДанныеКвалификации(КвалификацияРаботника);
				ПараметрыВызова = PostPutPersonQualification(PersonKey, PersonQualificationData);
				ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
				ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
				Если ОтветСервиса.КодСостояния<400 Тогда 
					Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
						ПрисвоенныйИдентификатор = Неопределено;
						ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
						Если ПрисвоенныйИдентификатор<>Неопределено Тогда
							КвалификацияРаботника.Идентификатор = ПрисвоенныйИдентификатор;
							КвалификацияРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
							ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияРаботника.ДатаПрисвоения, КвалификацияРаботника.Специальность, 
									КвалификацияРаботника.Идентификатор, КвалификацияРаботника.МоментВыгрузки)
						Иначе 
							ВыгрузкаВыполнена = Ложь;
						КонецЕсли;
					ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
						КвалификацияРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
						ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияРаботника.ДатаПрисвоения, КвалификацияРаботника.Специальность, 
								КвалификацияРаботника.Идентификатор, КвалификацияРаботника.МоментВыгрузки)
					Иначе 
						ВыгрузкаВыполнена = Ложь;
					КонецЕсли;
				Иначе 
					ВыгрузкаВыполнена = Ложь;
				КонецЕсли;
				Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
					СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка квалификации медработника %1: %2%3'"), 
							Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
					ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Личное дело.
		НачальнаяЗаписьЛД = 0;
		Если ПерваяЗаписьЛичногоДелаВыгружена Тогда 
			ВыгрузкаПроизводилась = Истина;
			НачальнаяЗаписьЛД = 1;
		КонецЕсли;
		Для ИндексЗаписиЛД = НачальнаяЗаписьЛД По ДанныеДляВыгрузки.ЛичноеДело.Количество() - 1 Цикл
			ЛичноеДелоРаботника = ДанныеДляВыгрузки.ЛичноеДело[ИндексЗаписиЛД];
			// Личное дело - это единственный раздел, по которому нет надежного логирования изменений,
			// поэтому нет проверки на необходимость выгрузки. Все записи выгружаются каждый раз.
			ВыгрузкаПроизводилась = Истина;
			ОтветСервиса = ОтправитьЗаписьЛичногоДела(PersonKey, ВыгрузкаВыполнена, ЛичноеДелоРаботника, ПараметрыСервиса, Работник);
			Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
				СообщениеОбОшибкеПользователю = СтрШаблон(НСтр("ru = 'Выгрузка личного дела медработника %1: %2%3'"), 
						Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", РаботникДляВыгрузки.НомерСтроки-1));
			КонецЕсли;
		КонецЦикла;
		
		Если ВыгрузкаПроизводилась Тогда
			РаботникДляВыгрузки.СтадияВыгрузки = ?(ВыгрузкаВыполнена, 2, 3);
		КонецЕсли;
		
#КонецОбласти
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ОтправитьЗаписьЛичногоДела(PersonKey, ВыгрузкаВыполнена, ЛичноеДелоРаботника, ПараметрыСервиса, Работник, ДляПрикрепленияРаботника = Ложь)  
	
	PersonCardData = ПодготовитьДанныеЛичногоДела(ЛичноеДелоРаботника);
	ПараметрыВызова = PostPutPersonCard(PersonKey, PersonCardData, ДляПрикрепленияРаботника);
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
			ПрисвоенныйИдентификатор = Неопределено;
			ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
			Если ПрисвоенныйИдентификатор<>Неопределено Тогда
				ЛичноеДелоРаботника.Идентификатор = ПрисвоенныйИдентификатор;
				ЛичноеДелоРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
				ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоРаботника.ТабельныйНомер, 
						ЛичноеДелоРаботника.ДатаНачалаЗаписи, ЛичноеДелоРаботника.Идентификатор, ЛичноеДелоРаботника.МоментВыгрузки)
			Иначе 
				ВыгрузкаВыполнена = Ложь;
			КонецЕсли;
		ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
			ЛичноеДелоРаботника.МоментВыгрузки = МоментВыгрузкиНаСервере();
			ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоРаботника.ТабельныйНомер, 
					ЛичноеДелоРаботника.ДатаНачалаЗаписи, ЛичноеДелоРаботника.Идентификатор, ЛичноеДелоРаботника.МоментВыгрузки)
		Иначе 
			ВыгрузкаВыполнена = Ложь;
		КонецЕсли;
	Иначе 
		ВыгрузкаВыполнена = Ложь;
	КонецЕсли;
	
	Возврат ОтветСервиса;

КонецФункции 
	
&НаКлиенте
Функция ОтправитьОбщиеДанные(PersonKey, ВыгрузкаВыполнена, ДанныеДляВыгрузки, ПараметрыСервиса, Работник)
	
	PersonData = ПодготовитьОбщиеДанныеРаботника(Работник, ДанныеДляВыгрузки.ДокументыУдостоверяющиеЛичность);
	ПараметрыВызова = PostPutPerson(PersonKey, PersonData);
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
			ПрисвоенныйИдентификатор = Неопределено;
			ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
			Если ПрисвоенныйИдентификатор<>Неопределено Тогда
				PersonKey.oid = ПрисвоенныйИдентификатор;
				PersonKey.snils = Неопределено;
				Работник.Идентификатор = ПрисвоенныйИдентификатор;
				Работник.МоментВыгрузки = МоментВыгрузкиНаСервере();
				ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, Работник.Идентификатор, Работник.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра); 
				// Пауза после добавления медработника необходима, чтобы отработали все последующие запросы. 
				// Без паузы они завершатся с ошибкой "Медработник не найден".
				Пауза(5);
			Иначе 
				ВыгрузкаВыполнена = Ложь;
			КонецЕсли;
		ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
			Работник.МоментВыгрузки = МоментВыгрузкиНаСервере();
			ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, Работник.Идентификатор, Работник.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
		Иначе 
			ВыгрузкаВыполнена = Ложь;
		КонецЕсли;
	Иначе 
		ВыгрузкаВыполнена = Ложь;
	КонецЕсли; 
	
	Возврат ОтветСервиса;

КонецФункции 

&НаКлиенте
Функция ПолучитьПолныеДанныеМедработника(PersonKey, ДанныеДляВыгрузки, ПараметрыСервиса, Работник, РаботникДляВыгрузки)
	
	ПараметрыВызова = GetPersonFull(PersonKey);
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ОтветСервиса.Контент<>Неопределено Тогда
			ПрисвоенныйИдентификатор = Неопределено;
			ОтветСервиса.Контент.Свойство("oid", ПрисвоенныйИдентификатор);
			Если ПрисвоенныйИдентификатор<>Неопределено Тогда   
				Работник.Идентификатор = ПрисвоенныйИдентификатор;
				ЗаписатьРезультатВыгрузки(Работник.ФизическоеЛицо, ПрисвоенныйИдентификатор, Неопределено, Неопределено);
				PersonKey.oid = ПрисвоенныйИдентификатор;
				PersonKey.snils = Неопределено;
				// Тут заполнение идентификаторов в ТЧ.
				Если ДанныеДляВыгрузки.ЛичноеДело.Количество()>0 Тогда 
					РазделЛичноеДело = Неопределено;
					Если ОтветСервиса.Контент.Свойство("personCard", РазделЛичноеДело) Тогда
						Если РазделЛичноеДело<>Неопределено Тогда 
							// Записей личного дела может быть несколько. Нужно подбирать по табельному номеру и дате начала.
							Для Каждого ЛичноеДелоФРМР Из РазделЛичноеДело Цикл
								ОрганизацияЛичногоДелаФРМР = Неопределено;
								ИдентификаторЛичногоДелаФРМР = Неопределено;
								ТабельныйНомерЛичногоДелаФРМР = Неопределено;
								ДатаНачалаЗаписиЛичногоДелаФРМР = Неопределено;
								Если ЛичноеДелоФРМР.Свойство("oid", ОрганизацияЛичногоДелаФРМР) 
									И ЛичноеДелоФРМР.Свойство("id", ИдентификаторЛичногоДелаФРМР) 
									И ЛичноеДелоФРМР.Свойство("serviceNumber", ТабельныйНомерЛичногоДелаФРМР) 
									И ЛичноеДелоФРМР.Свойство("beginDate", ДатаНачалаЗаписиЛичногоДелаФРМР) Тогда
									Для Каждого ЛичноеДелоИБ Из ДанныеДляВыгрузки.ЛичноеДело Цикл
										Если Объект.УИНОрганизации=ОрганизацияЛичногоДелаФРМР 
											И ЛичноеДелоИБ.ТабельныйНомер=ТабельныйНомерЛичногоДелаФРМР 
											И ЛичноеДелоИБ.ДатаНачалаЗаписи=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаНачалаЗаписиЛичногоДелаФРМР) Тогда 
											ЛичноеДелоИБ.Идентификатор = ИдентификаторЛичногоДелаФРМР;
											ЗаписатьРезультатВыгрузкиЛичногоДела(Работник.ФизическоеЛицо, Объект.УИНОрганизации, ЛичноеДелоИБ.ТабельныйНомер, 
											ЛичноеДелоИБ.ДатаНачалаЗаписи, ЛичноеДелоИБ.Идентификатор, ЛичноеДелоИБ.МоментВыгрузки);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Например, в ФРМР они были удалены вручную или произошла смена площадки, а очистку идентификаторов сделать забыли. 
							// Их надо выявить и сбросить идентификатор.
							// Иначе вместо добавления будет запускаться обновление, что приведёт к ошибке "... не найден".
							Для Каждого ЛичноеДелоИБ Из ДанныеДляВыгрузки.ЛичноеДело Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого ЛичноеДелоФРМР Из РазделЛичноеДело Цикл
									ИдентификаторЛичногоДелаФРМР = Неопределено;
									Если ЛичноеДелоФРМР.Свойство("id", ИдентификаторЛичногоДелаФРМР) Тогда 
										Если ИдентификаторЛичногоДелаФРМР = ЛичноеДелоИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									ЛичноеДелоИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.ОбщееОбразование.Количество()>0 Тогда 
					РазделОбразование = Неопределено;
					Если ОтветСервиса.Контент.Свойство("educationCommon", РазделОбразование) Тогда
						Если РазделОбразование<>Неопределено Тогда 
							// Общее образование может быть только одно. Поэтому получили не массив, а простой объект json.
							ПрисвоенныйИдентификаторРазделОбщееОбразование = Неопределено;
							Если РазделОбразование.Свойство("commonId", ПрисвоенныйИдентификаторРазделОбщееОбразование) Тогда
								// Так как значение только одно, никаких подборов/поисков не нужно.
								СтрокаОбщееОбразование = ДанныеДляВыгрузки.ОбщееОбразование[0];
								СтрокаОбщееОбразование.Идентификатор = ПрисвоенныйИдентификаторРазделОбщееОбразование;
								ЗаписатьРезультатВыгрузки(СтрокаОбщееОбразование.ОбразованиеРаботника, СтрокаОбщееОбразование.Идентификатор, 
										Неопределено, Неопределено);
							Иначе	
								// Если общего образования нет, на всякий случай сбросим идентификатор в ИБ, 
								// чтобы сработал запрос на добавление, а не на изменение.
								СтрокаОбщееОбразование.Идентификатор = Неопределено;
							КонецЕсли;
						Иначе	
							// Обычно, если общего образования нет, то и соответствующего объекта json нет.
							СтрокаОбщееОбразование.Идентификатор = Неопределено;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.ПрофессиональноеОбразование.Количество()>0 Тогда 
					РазделОбразование = Неопределено;
					Если ОтветСервиса.Контент.Свойство("educationProf", РазделОбразование) Тогда
						Если РазделОбразование<>Неопределено Тогда 
							// Профессиональных образований может быть несколько. Подбирать по дате диплома.
							Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
								ИдентификаторФРМР = Неопределено;
								Обучающийся = Неопределено;
								ДатаДипломаФРМР = Неопределено;
								ДатаСвидетельстваФРМР = Неопределено;
								Если ОбразованиеФРМР.Свойство("profId", ИдентификаторФРМР) 
									И ОбразованиеФРМР.Свойство("isStudentEducation", Обучающийся)
									И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)
									Или ОбразованиеФРМР.Свойство("foreignCertDate", ДатаСвидетельстваФРМР)) Тогда
									Если Не Обучающийся Тогда
										Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ПрофессиональноеОбразование Цикл
											Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР)
														Или ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаСвидетельстваФРМР) Тогда 
												ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
												ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
														Неопределено, Неопределено);
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ПрофессиональноеОбразование Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл
									ИдентификаторФРМР = Неопределено;
									Если ОбразованиеФРМР.Свойство("profId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = ОбразованиеИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									ОбразованиеИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.ПослевузовскоеОбразование.Количество()>0 Тогда 
					РазделОбразование = Неопределено;
					Если ОтветСервиса.Контент.Свойство("educationPostgraduate", РазделОбразование) Тогда
						Если РазделОбразование<>Неопределено Тогда 
							// Послевузовских образований может быть несколько. Подбирать по дате диплома.
							Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
								ИдентификаторФРМР = Неопределено;
								Обучающийся = Неопределено;
								ДатаДипломаФРМР = Неопределено;
								ДатаСвидетельстваФРМР = Неопределено;
								Если ОбразованиеФРМР.Свойство("postgraduateId", ИдентификаторФРМР) 
									И ОбразованиеФРМР.Свойство("isStudying", Обучающийся)
									И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)
									Или ОбразованиеФРМР.Свойство("foreignCertDate", ДатаСвидетельстваФРМР)) Тогда
									Если Не Обучающийся Тогда
										Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ПослевузовскоеОбразование Цикл
											Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР)
														Или ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаСвидетельстваФРМР) Тогда 
												ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
												ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
														Неопределено, Неопределено);
											КонецЕсли;
										КонецЦикла;
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ПослевузовскоеОбразование Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл
									ИдентификаторФРМР = Неопределено;
									Если ОбразованиеФРМР.Свойство("postgraduateId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = ОбразованиеИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									ОбразованиеИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.ДополнительноеПрофессиональноеОбразование.Количество()>0 Тогда 
					РазделОбразование = Неопределено;
					Если ОтветСервиса.Контент.Свойство("educationExt", РазделОбразование) Тогда
						Если РазделОбразование<>Неопределено Тогда 
							// Дополнительных профессиональных образований может быть несколько. Подбирать по дате диплома.
							Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл 
								ИдентификаторФРМР = Неопределено;
								ДатаДипломаФРМР = Неопределено;
								Если ОбразованиеФРМР.Свойство("extId", ИдентификаторФРМР) 
									И (ОбразованиеФРМР.Свойство("docDate", ДатаДипломаФРМР)) Тогда
									Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ДополнительноеПрофессиональноеОбразование Цикл
										Если ОбразованиеИБ.ДатаВыдачиДиплома=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаДипломаФРМР) Тогда 
											ОбразованиеИБ.Идентификатор = ИдентификаторФРМР;
											ЗаписатьРезультатВыгрузки(ОбразованиеИБ.ОбразованиеРаботника, ОбразованиеИБ.Идентификатор, 
													Неопределено, Неопределено);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого ОбразованиеИБ Из ДанныеДляВыгрузки.ДополнительноеПрофессиональноеОбразование Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого ОбразованиеФРМР Из РазделОбразование Цикл
									ИдентификаторФРМР = Неопределено;
									Если ОбразованиеФРМР.Свойство("extId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = ОбразованиеИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									ОбразованиеИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.Сертификаты.Количество()>0 Тогда 
					РазделСертификаты = Неопределено;
					Если ОтветСервиса.Контент.Свойство("educationCert", РазделСертификаты) Тогда
						Если РазделСертификаты<>Неопределено Тогда 
							// Сертификатов может быть несколько. Нужно подбирать по специальности и дате получения.  
							Для Каждого СертификатФРМР Из РазделСертификаты Цикл 
								ИдентификаторСертификатаФРМР = Неопределено;
								ДатаПолученияСертификатаФРМР = Неопределено;
								СпециальностьКодСертификатаФРМР = Неопределено;
								Если СертификатФРМР.Свойство("certId", ИдентификаторСертификатаФРМР) 
									И СертификатФРМР.Свойство("examDate", ДатаПолученияСертификатаФРМР) 
									И СертификатФРМР.Свойство("specId", СпециальностьКодСертификатаФРМР) Тогда
									Для Каждого СертификатИБ Из ДанныеДляВыгрузки.Сертификаты Цикл
										Если СертификатИБ.СпециальностьКод=Формат(СпециальностьКодСертификатаФРМР, "ЧГ=0") 
													И СертификатИБ.ДатаПолучения=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаПолученияСертификатаФРМР) Тогда 
											СертификатИБ.Идентификатор = ИдентификаторСертификатаФРМР;
											ЗаписатьРезультатВыгрузкиСертификата(Работник.ФизическоеЛицо, СертификатИБ.Специальность, 
													СертификатИБ.ДатаПолучения, СертификатИБ.Идентификатор, СертификатИБ.МоментВыгрузки);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого СертификатИБ Из ДанныеДляВыгрузки.Сертификаты Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого СертификатФРМР Из РазделСертификаты Цикл
									ИдентификаторФРМР = Неопределено;
									Если СертификатФРМР.Свойство("certId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = СертификатИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									СертификатИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.Награды.Количество()>0 Тогда 
					РазделНаграды = Неопределено;
					Если ОтветСервиса.Контент.Свойство("personNomination", РазделНаграды) Тогда
						Если РазделНаграды<>Неопределено Тогда 
							// Наград может быть несколько. Нужно подбирать по награде, номеру и дате.
							Для Каждого НаградаФРМР Из РазделНаграды Цикл 
								ИдентификаторНаградыФРМР = Неопределено;
								КодНаградыФРМР = Неопределено;
								ДатаНаградыФРМР = Неопределено;
								НомерНаградыФРМР = Неопределено;
								Если НаградаФРМР.Свойство("entityId", ИдентификаторНаградыФРМР) 
									И НаградаФРМР.Свойство("nomNumber", НомерНаградыФРМР) 
									И НаградаФРМР.Свойство("nomDate", ДатаНаградыФРМР) 
									И НаградаФРМР.Свойство("nominationId", КодНаградыФРМР) Тогда
									Для Каждого НаградаИБ Из ДанныеДляВыгрузки.Награды Цикл
										Если НаградаИБ.НаградаКод=Формат(КодНаградыФРМР, "ЧГ=0") 
													И НаградаИБ.НомерПриказа=НомерНаградыФРМР 
													И НаградаИБ.ДатаПриказа=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаНаградыФРМР) Тогда 
											НаградаИБ.Идентификатор = ИдентификаторНаградыФРМР;
											ЗаписатьРезультатВыгрузкиНаграды(Работник.ФизическоеЛицо, НаградаИБ.Награда, НаградаИБ.ДатаПриказа, 
													НаградаИБ.НомерПриказа, НаградаИБ.Идентификатор, НаградаИБ.МоментВыгрузки);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого НаградаИБ Из ДанныеДляВыгрузки.Награды Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого НаградаФРМР Из РазделНаграды Цикл
									ИдентификаторФРМР = Неопределено;
									Если НаградаФРМР.Свойство("entityId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = НаградаИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									НаградаИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если ДанныеДляВыгрузки.Квалификация.Количество()>0 Тогда 
					РазделКвалификация = Неопределено;
					Если ОтветСервиса.Контент.Свойство("personQualification", РазделКвалификация) Тогда
						Если РазделКвалификация<>Неопределено Тогда 
							// Квалификаций может быть несколько. Нужно подбирать по дате присвоения квалификационной категории, по специальности или по должности.
							// В отличие от ФРМР, в ИБ квалификация устанавливается только для специальности (не для должности), поэтому в каждой записи ИБ специальность
							// заполнена, однако при подготовке данных для выгрузки должность также подбирается в запросе и выгружается в ФРМР для немедицинских должностей.
							// Поэтому, строку в ИБ необходимо подобрать и по должности (если специальность не заполнена), 
							// однако результат будет всё равно залогирован по специальности.
							Для Каждого КвалификацияФРМР Из РазделКвалификация Цикл 
								ИдентификаторКвалификацииФРМР = Неопределено;
								ДатаПрисвоенияФРМР = Неопределено;
								КодСпециальностиФРМР = Неопределено;
								КодДолжностиПоФедСправочникуФРМР = Неопределено;
								КодДолжностиФРМР = Неопределено;
								Если КвалификацияФРМР.Свойство("qualificationId", ИдентификаторКвалификацииФРМР) 
									И КвалификацияФРМР.Свойство("beginDate", ДатаПрисвоенияФРМР) Тогда
									УказанКодСпециальностиФРМР = КвалификацияФРМР.Свойство("specId", КодСпециальностиФРМР) И КодСпециальностиФРМР<>Неопределено;
									УказанКодДолжностиПоФедСправочникуФРМР = КвалификацияФРМР.Свойство("fedPostId", КодДолжностиПоФедСправочникуФРМР) 
									И КодДолжностиПоФедСправочникуФРМР<>Неопределено;
									УказанКодДолжностиФРМР = КвалификацияФРМР.Свойство("postId", КодДолжностиФРМР) И КодДолжностиФРМР<>Неопределено;
									Для Каждого КвалификацияИБ Из ДанныеДляВыгрузки.Квалификация Цикл
										Если ДанныеКвалификацийСовпадают(КвалификацияИБ, ДатаПрисвоенияФРМР, КодДолжностиПоФедСправочникуФРМР, КодДолжностиФРМР, КодСпециальностиФРМР, 
												УказанКодДолжностиПоФедСправочникуФРМР, УказанКодДолжностиФРМР, УказанКодСпециальностиФРМР) Тогда
											КвалификацияИБ.Идентификатор = ИдентификаторКвалификацииФРМР;
											ЗаписатьРезультатВыгрузкиКвалификации(Работник.ФизическоеЛицо, КвалификацияИБ.ДатаПрисвоения, КвалификацияИБ.Специальность, 
													КвалификацияИБ.Идентификатор, КвалификацияИБ.МоментВыгрузки);
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
							// В ИБ могут остаться записи с идентификаторами, которым нет соответствия в ФРМР.
							// Их надо выявить и сбросить идентификатор. Подробнее см. выше в разделе ЛД.
							Для Каждого КвалификацияИБ Из ДанныеДляВыгрузки.Квалификация Цикл
								ЗаписьНайдена = Ложь;
								Для Каждого КвалификацияФРМР Из РазделКвалификация Цикл
									ИдентификаторФРМР = Неопределено;
									Если КвалификацияФРМР.Свойство("entityId", ИдентификаторФРМР) Тогда 
										Если ИдентификаторФРМР = КвалификацияИБ.Идентификатор Тогда 
											ЗаписьНайдена = Истина; 
											Прервать;
										КонецЕсли;
									КонецЕсли;
								КонецЦикла;
								Если Не ЗаписьНайдена Тогда 
									КвалификацияИБ.Идентификатор = Неопределено;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ОтветСервиса;

КонецФункции

&НаСервереБезКонтекста
Процедура ОтправитьСопоставления(Организация)
	МедицинскиеРегистры1СЕГИСЗ.ОтправитьСопоставления(Организация);
КонецПроцедуры

&НаКлиенте
Функция ДанныеКвалификацийСовпадают(Знач КвалификацияИБ, Знач ДатаПрисвоенияФРМР, Знач КодДолжностиПоФедСправочникуФРМР, Знач КодДолжностиФРМР, 
	Знач КодСпециальностиФРМР, Знач УказанКодДолжностиПоФедСправочникуФРМР, Знач УказанКодДолжностиФРМР, Знач УказанКодСпециальностиФРМР)
	
	Возврат КвалификацияИБ.ДатаПрисвоения=МедицинскиеРегистрыКлиент.ДатаИзUTC(ДатаПрисвоенияФРМР)
	И (Не УказанКодСпециальностиФРМР Или КвалификацияИБ.СпециальностьКод=Формат(КодСпециальностиФРМР, "ЧГ=0")) 
	И ((Не УказанКодДолжностиПоФедСправочникуФРМР Или КвалификацияИБ.ДолжностьПоФедСправочникуКод=Формат(КодДолжностиПоФедСправочникуФРМР, "ЧГ=0")) 
		Или (Не УказанКодДолжностиФРМР Или КвалификацияИБ.ДолжностьКод=Формат(КодДолжностиФРМР, "ЧГ=0")));

КонецФункции

&НаКлиенте
Функция ПодготовитьОбщиеДанныеРаботника(Работник, ДанныеДокументовУдостоверяющихЛичность)
	
	PersonData = PersonData();
	PersonData.mr = Работник.ЯвляетсяМедработником;
	PersonData.student = Ложь;
	PersonData.lastName = НеопределеноЕслиПустаяСтрока(Работник.Фамилия);
	PersonData.firstName = НеопределеноЕслиПустаяСтрока(Работник.Имя);
	PersonData.patronymic = НеопределеноЕслиПустаяСтрока(Работник.Отчество);
	PersonData.gender = Работник.Пол;
	PersonData.birthDate = НеопределеноЕслиНеЗаполнено(Работник.ДатаРождения);
	PersonData.snils = НеопределеноЕслиПустаяСтрока(МедицинскиеРегистрыКлиент.ТолькоЦифры(Работник.СтраховойНомерПФР));
	PersonData.inn = НеопределеноЕслиПустаяСтрока(Работник.ИНН);
	PersonData.citizenShipId.code = НеопределеноЕслиПустаяСтрока(Работник.ГражданствоКод);
	PersonData.oksmId.code = НеопределеноЕслиПустаяСтрока(Работник.СтранаКод);
	PersonData.militaryRelationId = НеопределеноЕслиПустаяСтрока(Работник.ОтношениеКВоинскойОбязанностиКод);
	PersonData.phone = НомерТелефонаЦифрами(Работник.НомерТелефона);
	PersonData.email = НеопределеноЕслиПустаяСтрока(Работник.АдресЭлектроннойПочтыПредставление);
	PersonData.isDisabled = Неопределено;
	PersonData.disabledGroupId = Неопределено;
	PersonData.disabledGroupName = Неопределено;
	PersonData.disabledDate = Неопределено;
	PersonData.covid19 = Неопределено;
	PersonData.documents = Новый Массив;
	PersonData.addresses = Новый Массив;
	
	Для Каждого ДокументМедработника Из ДанныеДокументовУдостоверяющихЛичность Цикл 
		PersonDocumentData = PersonDocumentData();
		PersonDocumentData.serial = НеопределеноЕслиПустаяСтрока(МедицинскиеРегистрыКлиент.ТолькоЦифры(ДокументМедработника.Серия));
		PersonDocumentData.number = НеопределеноЕслиПустаяСтрока(ДокументМедработника.Номер);
		PersonDocumentData.passDate = НеопределеноЕслиНеЗаполнено(ДокументМедработника.ДатаВыдачи);
		PersonDocumentData.passOrg = НеопределеноЕслиПустаяСтрока(ДокументМедработника.КемВыдан);
		PersonDocumentData.codeOrg = НеопределеноЕслиПустаяСтрока(ДокументМедработника.КодПодразделения);
		PersonDocumentData.documentId = НеопределеноЕслиПустаяСтрока(ДокументМедработника.ВидДокументаКод);
		PersonData.documents.Добавить(PersonDocumentData);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Работник.АдресПостояннойРегистрации) Тогда
		ДанныеАдреса = АдреснаяИнформация(1, Работник.ДатаРегистрации, Работник.АдресПостояннойРегистрации);
		PersonData.addresses.Добавить(ДанныеАдреса);
	КонецЕсли;
	Если ЗначениеЗаполнено(Работник.АдресМестаПроживания) Тогда 
		ДанныеАдреса = АдреснаяИнформация(2, Работник.ДатаРегистрации, Работник.АдресМестаПроживания);
		PersonData.addresses.Добавить(ДанныеАдреса);
	КонецЕсли;
	Возврат PersonData;

КонецФункции

&НаКлиенте
Функция НеопределеноЕслиНеЗаполнено(ЗащищаемоеЗначение)
    Возврат ?(ЗначениеЗаполнено(ЗащищаемоеЗначение), ЗащищаемоеЗначение, Неопределено);
КонецФункции

&НаКлиенте
Функция НеопределеноЕслиПустаяСтрока(ЗащищаемоеЗначение)
    Возврат ?(ПустаяСтрока(ЗащищаемоеЗначение), Неопределено, ЗащищаемоеЗначение);
КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеЛичногоДела(ЛичноеДелоРаботника)
	
	PersonCardData = PersonCardData();
	PersonCardData.id = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.Идентификатор);
	PersonCardData.lastName = НеопределеноЕслиПустаяСтрока(ЛичноеДелоРаботника.Фамилия);
	PersonCardData.oid = НеопределеноЕслиПустаяСтрока(Объект.УИНОрганизации);
	PersonCardData.organization = НеопределеноЕслиПустаяСтрока(Объект.Организация);
	PersonCardData.nrPmuDepartId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ИдентификаторПодразделения);
	Если ЛичноеДелоРаботника.ТипПодразделенияКод="2" Тогда 
		PersonCardData.nrPmuDepartHospitalSubdivisionId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета);
	ИначеЕсли ЛичноеДелоРаботника.ТипПодразделенияКод="1"
		Или ЛичноеДелоРаботника.ТипПодразделенияКод="3"
		Или ЛичноеДелоРаботника.ТипПодразделенияКод="4" Тогда
		PersonCardData.roomOid = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ИдентификаторОтделенияИлиКабинета);
	КонецЕсли;
	PersonCardData.contractNumber = ЛичноеДелоРаботника.ТрудовойДоговорНомер;
	PersonCardData.contractDate = ЛичноеДелоРаботника.ТрудовойДоговорДата;
	PersonCardData.serviceNumber = ЛичноеДелоРаботника.ТабельныйНомер;
	PersonCardData.fedPositionId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ФедеральнаяДолжностьКод);
	PersonCardData.seniority = Неопределено;
	PersonCardData.services = Новый Массив;
	Если Не ПустаяСтрока(ЛичноеДелоРаботника.ОказываемаяМедУслугаКод) Тогда 
		НоваяМедУслуга = PersonCardServices();
		НоваяМедУслуга.code = ЛичноеДелоРаботника.ОказываемаяМедУслугаКод;
		PersonCardData.services.Добавить(НоваяМедУслуга);
	КонецЕсли;
	PersonCardData.positionTypeId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ТипЗанятияДолжностиКод);
	PersonCardData.postId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.МедицинскаяДолжностьКод);
	PersonCardData.rate = ЛичноеДелоРаботника.КоличествоСтавок;
	PersonCardData.beginDate = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ДатаНачалаЗаписи);
	PersonCardData.endDate = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ДатаОкончанияЗаписи);
	Если ЗначениеЗаполнено(ЛичноеДелоРаботника.ВидСобытияОкончания) Тогда 
		PersonCardData.endTypeId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ВидСобытияОкончанияКод);
		Если ЛичноеДелоРаботника.ВидСобытияОкончания=ВидыКадровыхСобытийУвольнение Тогда 
			PersonCardData.fireReasonId = НеопределеноЕслиНеЗаполнено(ЛичноеДелоРаботника.ПричинаУвольненияКод);
		КонецЕсли;
	КонецЕсли;
	PersonCardData.targeted = ЛичноеДелоРаботника.ЦелеваяПодготовка;
	PersonCardData.temporaryDerelictions = Неопределено;
	Возврат PersonCardData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеСертификата(СертификатРаботника)
	
	PersonCertData = PersonCertData();
	PersonCertData.certId = НеопределеноЕслиПустаяСтрока(СертификатРаботника.Идентификатор);
	PersonCertData.institutionId = НеопределеноЕслиПустаяСтрока(СертификатРаботника.УчебноеЗаведениеКод);
	PersonCertData.certSerial = НеопределеноЕслиПустаяСтрока(СертификатРаботника.Серия);
	PersonCertData.certNumber = НеопределеноЕслиПустаяСтрока(СертификатРаботника.Номер);
	PersonCertData.examDate = НеопределеноЕслиНеЗаполнено(СертификатРаботника.ДатаПолучения);
	PersonCertData.passDate = Неопределено;
	PersonCertData.endDate = НеопределеноЕслиНеЗаполнено(СертификатРаботника.ДействуетПо);
	PersonCertData.specId = НеопределеноЕслиПустаяСтрока(СертификатРаботника.СпециальностьКод);
	Возврат PersonCertData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеНаграды(НаградаРаботника)
	
	PersonNominationData = PersonNominationData();
	PersonNominationData.entityId = НеопределеноЕслиПустаяСтрока(НаградаРаботника.Идентификатор);
	PersonNominationData.nominationId = НеопределеноЕслиПустаяСтрока(НаградаРаботника.НаградаКод);
	PersonNominationData.nomDate = НеопределеноЕслиНеЗаполнено(НаградаРаботника.ДатаПриказа);
	PersonNominationData.nomNumber = НеопределеноЕслиПустаяСтрока(НаградаРаботника.НомерПриказа);
	Возврат PersonNominationData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеКвалификации(КвалификацияРаботника)
	
	PersonQualificationData = PersonQualificationData();
	PersonQualificationData.qualificationId = НеопределеноЕслиПустаяСтрока(КвалификацияРаботника.Идентификатор);
	PersonQualificationData.qualifyCategoryId = НеопределеноЕслиПустаяСтрока(КвалификацияРаботника.РазрядКатегорияКод);
	PersonQualificationData.beginDate = НеопределеноЕслиНеЗаполнено(КвалификацияРаботника.ДатаПрисвоения);
	PersonQualificationData.endDate = НеопределеноЕслиНеЗаполнено(КвалификацияРаботника.ДатаОкончания);
	Если КвалификацияРаботника.ЯвляетсяМедицинскойДолжностью Тогда 
		PersonQualificationData.specId = НеопределеноЕслиПустаяСтрока(КвалификацияРаботника.СпециальностьКод);
		PersonQualificationData.fedPostId = Неопределено;
		PersonQualificationData.postId = Неопределено;
	Иначе 
		PersonQualificationData.specId = Неопределено;
		PersonQualificationData.fedPostId = НеопределеноЕслиПустаяСтрока(КвалификацияРаботника.ФедеральнаяДолжностьКод);
		PersonQualificationData.postId = НеопределеноЕслиПустаяСтрока(КвалификацияРаботника.МедицинскаяДолжностьКод);
	КонецЕсли;
	Возврат PersonQualificationData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеОбщегоОбразования(ТекущееОбразование)
	
	PersonCommonData = PersonCommonData();
	PersonCommonData.commonId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.Идентификатор);
	PersonCommonData.institution = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ОбразовательнаяОрганизация);
	PersonCommonData.docSerial = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СерияАттестата);
	PersonCommonData.docNumber = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.НомерАттестата);
	PersonCommonData.docDate = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.ДатаВыдачиАттестата);
	PersonCommonData.profCourseSet = Неопределено;
	Возврат PersonCommonData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеПрофессиональногоОбразования(Работник, ТекущееОбразование)
	
	PersonProfData = PersonProfData();
	PersonProfData.profId = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.Идентификатор);
	PersonProfData.isStudentEducation = Ложь;
	Если Не Работник.ЯвляетсяМедработником Тогда 
		PersonProfData.hasDiploma = Истина;
	КонецЕсли;
	PersonProfData.isDuplicate = Ложь;
	PersonProfData.beginYear = ?(ЗначениеЗаполнено(ТекущееОбразование.Начало), Год(ТекущееОбразование.Начало), Неопределено);
	PersonProfData.docSerial = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СерияДиплома);
	PersonProfData.docNumber = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.НомерДиплома);
	PersonProfData.docDate = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.ДатаВыдачиДиплома);
	PersonProfData.educationTypeId.code = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ВидОбразованияКод);
	PersonProfData.specId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СпециальностьКод);
	PersonProfData.qualificationId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.КвалификацияКод);
	Если ТекущееОбразование.ЗаПределамиРФ Тогда
		PersonProfData.foreignInstitution = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ОбразовательнаяОрганизация);
		Если Не ПустаяСтрока(ТекущееОбразование.РеспубликаСССРКод) И ПустаяСтрока(ТекущееОбразование.СтранаМираКод) Тогда 
			PersonProfData.educPlace = 1;
			PersonProfData.unionRepublicId = ТекущееОбразование.РеспубликаСССРКод;
		Иначе 
			PersonProfData.educPlace = 2;
			PersonProfData.oksmId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СтранаМираКод);
			PersonProfData.hasForeignCert = 2;
		КонецЕсли;
	Иначе 
		PersonProfData.educPlace = 0;
		PersonProfData.institutionId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.УчебноеЗаведениеКод);
		PersonProfData.isTargeted = ЗначениеЗаполнено(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
		Если PersonProfData.isTargeted Тогда
			PersonProfData.targetedRegionId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
			PersonProfData.dutyMonthsPeriod = РазмерПериода(ТекущееОбразование.Начало, ТекущееОбразование.Окончание);
			PersonProfData.isTargetTerminated = ЗначениеЗаполнено(ТекущееОбразование.ПричинаРасторженияКод);
			Если PersonProfData.isTargetTerminated Тогда 
				PersonProfData.terminationReasonId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ПричинаРасторженияКод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат PersonProfData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеДополнительногоПрофессиональногоОбразования(ТекущееОбразование)
	
	PersonExtData = PersonExtData();
	PersonExtData.extId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.Идентификатор);
	PersonExtData.profEducationKindId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ВидОбразованияКод);
	PersonExtData.institutionId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.УчебноеЗаведениеКод);
	PersonExtData.hoursCount = ТекущееОбразование.КоличествоЧасов;
	PersonExtData.theme = ТекущееОбразование.Тематика;
	PersonExtData.docSerial = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СерияДиплома);
	PersonExtData.docNumber = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.НомерДиплома);
	PersonExtData.docDate = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.ДатаВыдачиДиплома);
	PersonExtData.specId = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.СпециальностьКод);
	Возврат PersonExtData;

КонецФункции

&НаКлиенте
Функция ПодготовитьДанныеПослевузовскогоОбразования(ТекущееОбразование)
	
	PersonPostgraduateData = PersonPostgraduateData();
	PersonPostgraduateData.postgraduateId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.Идентификатор);
	PersonPostgraduateData.isDuplicate = Ложь;
	PersonPostgraduateData.educationStageId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ВидОбразованияКод);
	PersonPostgraduateData.isStudying = Ложь;
	PersonPostgraduateData.beginYear = ?(ЗначениеЗаполнено(ТекущееОбразование.Начало), Год(ТекущееОбразование.Начало), Неопределено);
	PersonPostgraduateData.docSerial = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СерияДиплома);
	PersonPostgraduateData.docNumber = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.НомерДиплома);
	PersonPostgraduateData.docDate = НеопределеноЕслиНеЗаполнено(ТекущееОбразование.ДатаВыдачиДиплома);
	PersonPostgraduateData.academicDegreeId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.УченаяСтепеньКод);
	PersonPostgraduateData.scienceBranchId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ОтрасльНаукиКод);
	Если PersonPostgraduateData.educationStageId = "1" Или PersonPostgraduateData.educationStageId = "2" Тогда 
		PersonPostgraduateData.specId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СпециальностьОрдинатурыКод);
	КонецЕсли;
	Если PersonPostgraduateData.educationStageId = "3" Или PersonPostgraduateData.educationStageId = "4" Тогда 
		PersonPostgraduateData.doctSpecId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СпециальностьДокторантурыКод);
	КонецЕсли;
	Если ТекущееОбразование.ЗаПределамиРФ Тогда
		PersonPostgraduateData.foreignInstitution = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ОбразовательнаяОрганизация);
		Если Не ПустаяСтрока(ТекущееОбразование.РеспубликаСССРКод) И ПустаяСтрока(ТекущееОбразование.СтранаМираКод) Тогда 
			PersonPostgraduateData.educPlace = 1;
			PersonPostgraduateData.unionRepublicId = ТекущееОбразование.РеспубликаСССРКод;
		Иначе 
			PersonPostgraduateData.educPlace = 2;
			PersonPostgraduateData.oksmId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.СтранаМираКод);
			PersonPostgraduateData.hasForeignCert = 2;
		КонецЕсли;
	Иначе 
		PersonPostgraduateData.educPlace = 0;
		PersonPostgraduateData.institutionId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.УчебноеЗаведениеКод);
		Если PersonPostgraduateData.educationStageId <> "3" И PersonPostgraduateData.educationStageId <> "4" И PersonPostgraduateData.educationStageId <> "5" Тогда 
			PersonPostgraduateData.isTargeted = ЗначениеЗаполнено(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
			Если PersonPostgraduateData.isTargeted Тогда
				PersonPostgraduateData.targetedRegionId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ЗаказчикЦелевогоОбученияКод);
				PersonPostgraduateData.dutyMonthsPeriod = РазмерПериода(ТекущееОбразование.Начало, ТекущееОбразование.Окончание);
				PersonPostgraduateData.isTargetTerminated = ЗначениеЗаполнено(ТекущееОбразование.ПричинаРасторженияКод);
				Если PersonPostgraduateData.isTargetTerminated Тогда 
					PersonPostgraduateData.terminationReasonId = НеопределеноЕслиПустаяСтрока(ТекущееОбразование.ПричинаРасторженияКод);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат PersonPostgraduateData;

КонецФункции

&НаКлиенте
Функция ОтправитьЗапросИОбработатьРезультатДляОбразования(ПараметрыВызова, ПараметрыСервиса, Работник, ТекущееОбразование, ШаблонСообщенияОбОшибке, НомерСтроки)
	
	ВыгрузкаВыполнена = Истина;
	ТокенДоступа = ТокенДоступа(ПараметрыСервиса);
	ОтветСервиса = ВызватьМетод(Объект.Организация, ТокенДоступа, ПараметрыВызова);
	Если ОтветСервиса.КодСостояния<400 Тогда 
		Если ПараметрыВызова.Метод = "POST" И ОтветСервиса.Контент<>Неопределено Тогда 
			ПрисвоенныйИдентификатор = Неопределено;
			ОтветСервиса.Контент.Свойство("entityId", ПрисвоенныйИдентификатор);
			Если ПрисвоенныйИдентификатор<>Неопределено Тогда
				ТекущееОбразование.Идентификатор = ПрисвоенныйИдентификатор;
				ТекущееОбразование.МоментВыгрузки = МоментВыгрузкиНаСервере();
				ЗаписатьРезультатВыгрузки(ТекущееОбразование.ОбразованиеРаботника, ТекущееОбразование.Идентификатор, ТекущееОбразование.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
			Иначе 
				ВыгрузкаВыполнена = Ложь;
			КонецЕсли;
		ИначеЕсли ПараметрыВызова.Метод = "PUT" И ОтветСервиса.СообщениеОбОшибкеПользователю=Неопределено Тогда
			ТекущееОбразование.МоментВыгрузки = МоментВыгрузкиНаСервере();
			ЗаписатьРезультатВыгрузки(ТекущееОбразование.ОбразованиеРаботника, ТекущееОбразование.Идентификатор, ТекущееОбразование.МоментВыгрузки, ПараметрыВызова.РазделМедрегистра);
		Иначе 
			ВыгрузкаВыполнена = Ложь;
		КонецЕсли;
	Иначе 
		ВыгрузкаВыполнена = Ложь;
	КонецЕсли;
	Если ОтветСервиса.СообщениеОбОшибкеПользователю<>Неопределено Тогда
		СообщениеОбОшибкеПользователю = СтрШаблон(ШаблонСообщенияОбОшибке, Работник.ФизическоеЛицо, ОтветСервиса.СообщениеОбОшибкеПользователю, ОтветСервиса.ТекстДляТехподдержки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОбОшибкеПользователю, , 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Объект.Работники[%1].ФизическоеЛицо", НомерСтроки-1));
	КонецЕсли;
	
	Возврат ВыгрузкаВыполнена;

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДляВыгрузки(ДокументВыгрузки, УИНОрганизации, Работник)
	Возврат Документы.СведенияДляФРМР.ДанныеДляВыгрузки(ДокументВыгрузки, УИНОрганизации, Работник);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыгрузкаНеобходима(МоментВыгрузки, МоментИзменения)
	
	ВыгрузкаНеПроводилась = МоментВыгрузки=Неопределено Или МоментВыгрузки=Дата('00010101');
	ЕстьИзменения = МоментВыгрузки<=МоментИзменения;
	Возврат ВыгрузкаНеПроводилась Или ЕстьИзменения;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузки(ОбъектСсылка, Идентификатор, МоментВыгрузки, РазделМедрегистра)
	
	Набор = РегистрыСведений.ИдентификаторыОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(ОбъектСсылка);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.Объект = ОбъектСсылка;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	Если МоментВыгрузки<>Неопределено Тогда 
		РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	КонецЕсли;
	Если РазделМедрегистра<>Неопределено Тогда 
		РезультатВыгрузки.РазделМедрегистра = РазделМедрегистра;
	КонецЕсли;
	Набор.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиЛичногоДела(ФизическоеЛицо, УИНОрганизации, ТабельныйНомер, 
											   ДатаНачалаЗаписи, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыЛичныхДелДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.УИНОрганизации.Установить(УИНОрганизации);
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.ТабельныйНомер.Установить(ТабельныйНомер);
	Набор.Отбор.ДатаНачалаЗаписи.Установить(ДатаНачалаЗаписи);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.УИНОрганизации = УИНОрганизации;
		РезультатВыгрузки.ТабельныйНомер = ТабельныйНомер;
		РезультатВыгрузки.ДатаНачалаЗаписи = ДатаНачалаЗаписи;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиСертификата(ФизическоеЛицо, Специальность, ДатаПолучения, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыСертификатовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.Специальность.Установить(Специальность);
	Набор.Отбор.ДатаПолучения.Установить(ДатаПолучения);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.Специальность = Специальность;
		РезультатВыгрузки.ДатаПолучения = ДатаПолучения;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиНаграды(ФизическоеЛицо, Награда, ДатаПриказа, НомерПриказа, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыНаградДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.Награда.Установить(Награда);
	Набор.Отбор.ДатаПриказа.Установить(ДатаПриказа);
	Набор.Отбор.НомерПриказа.Установить(НомерПриказа);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.Награда = Награда;
		РезультатВыгрузки.ДатаПриказа = ДатаПриказа;
		РезультатВыгрузки.НомерПриказа = НомерПриказа;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Процедура ЗаписатьРезультатВыгрузкиКвалификации(ФизическоеЛицо, ДатаПрисвоения, Специальность, Идентификатор, МоментВыгрузки);
												
	Набор = РегистрыСведений.ИдентификаторыКвалификацийДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
	Набор.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	Набор.Отбор.ДатаПрисвоения.Установить(ДатаПрисвоения);
	Набор.Отбор.Специальность.Установить(Специальность);
	Набор.Прочитать();
	Если Набор.Количество() = 0 Тогда
		РезультатВыгрузки = Набор.Добавить();
		РезультатВыгрузки.ФизическоеЛицо = ФизическоеЛицо;
		РезультатВыгрузки.ДатаПрисвоения = ДатаПрисвоения;
		РезультатВыгрузки.Специальность = Специальность;
	Иначе
		РезультатВыгрузки = Набор[0];
	КонецЕсли;
	РезультатВыгрузки.Идентификатор = Идентификатор;
	РезультатВыгрузки.МоментВыгрузки = МоментВыгрузки;
	Набор.Записать();
	
КонецПроцедуры
												
&НаСервереБезКонтекста
Функция МоментВыгрузкиНаСервере()
	Возврат ТекущаяДатаСеанса();
КонецФункции

&НаСервереБезКонтекста
Функция РазмерПериода(ДатаНачала, ДатаОкончания)
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда 
		РазмерПериода = ОбщегоНазначенияБЗК.РазмерПериода(ДатаНачала, ДатаОкончания);
		Возврат РазмерПериода.Лет * 12 + РазмерПериода.Месяцев + ?(РазмерПериода.Дней=0, 0, 1);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ОбновитьВидимостьДоступность()
	Элементы.ФормаВыгрузитьВФРМР.Доступность = Объект.Проведен И Не Модифицированность;
КонецПроцедуры

&НаКлиенте
Функция ТокенДоступа(ПараметрыСервиса)
	Если ИспользоватьТокен Тогда 
		АдресСервиса = ?(ПараметрыСервиса.ИспользоватьЗащищенноеСоединение, "https://", "http://") + ПараметрыСервиса.Адрес + ПараметрыСервиса.ТочкаДоступа;
		Возврат МедицинскиеРегистрыКлиент.ТокенДоступа(ДанныеСертификата(Сертификат), Пароль, АдресСервиса, МоментВыпуска(), ИдентификаторИнформационнойСистемы);
	Иначе 
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Процедура Пауза(Секунд)
	МедицинскиеРегистры.Пауза(Секунд);
КонецПроцедуры

&НаСервереБезКонтекста
Функция МоментВыпуска() Экспорт
	Возврат МедицинскиеРегистры.МоментВыпуска();
КонецФункции

&НаСервереБезКонтекста
Функция НомерТелефонаЦифрами(НомерТелефонаJSON)
	Если ЗначениеЗаполнено(НомерТелефонаJSON) Тогда 
		ДанныеНомераТелефона = МедицинскиеРегистры.JSONВДанные(НомерТелефонаJSON);
		Если ТипЗнч(ДанныеНомераТелефона) = Тип("Структура") И ДанныеНомераТелефона.Свойство("value") Тогда 
			ПолныйНомер = МедицинскиеРегистры.ТолькоЦифры(ДанныеНомераТелефона.value);
			Возврат Прав(ПолныйНомер, 10);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция АдреснаяИнформация(ТипАдреса, ДатаРегистрации, АдреснаяИнформацияJSON)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("БезПредставлений",               Истина);
	ДополнительныеПараметры.Вставить("КодыАдреса",                     Истина);
	ДополнительныеПараметры.Вставить("КодыКЛАДР",                      Ложь);
	ДополнительныеПараметры.Вставить("НаименованиеВключаетСокращение", Ложь);
	ДополнительныеПараметры.Вставить("ПроверитьАдрес",                 Ложь);
	СведенияОбАдресе = РаботаСАдресами.СведенияОбАдресе(АдреснаяИнформацияJSON, ДополнительныеПараметры);
	
	PersonAddressData = МедицинскиеРегистрыФРМР.PersonAddressData();
	Если ДатаРегистрации<>Неопределено Тогда 
		PersonAddressData.regDate = ДатаРегистрации;
	КонецЕсли;
	PersonAddressData.addressTypeId = ТипАдреса;
	PersonAddressData.address.GARguid = ?(ПустаяСтрока(СведенияОбАдресе.ИдентификаторДома), СведенияОбАдресе.ИдентификаторАдресногоОбъекта, СведенияОбАдресе.ИдентификаторДома);
	Если ЗначениеЗаполнено(СведенияОбАдресе.Идентификаторы.ГородИдентификатор) Тогда 
		PersonAddressData.address.aoidArea = СведенияОбАдресе.Идентификаторы.ГородИдентификатор;
		PersonAddressData.address.areaName = СведенияОбАдресе.Город;
		PersonAddressData.address.prefixArea = СведенияОбАдресе.ГородТипКраткий;
	Иначе 
		PersonAddressData.address.aoidArea = СведенияОбАдресе.Идентификаторы.НаселенныйПунктИдентификатор;
		PersonAddressData.address.areaName = СведенияОбАдресе.НаселенныйПункт;
		PersonAddressData.address.prefixArea = СведенияОбАдресе.НаселенныйПунктТипКраткий;
	КонецЕсли;
	PersonAddressData.address.aoidStreet = СведенияОбАдресе.Идентификаторы.УлицаИдентификатор;
	PersonAddressData.address.houseid = СведенияОбАдресе.ИдентификаторДома;
	PersonAddressData.address.region = Формат(Число(СведенияОбАдресе.КодРегиона), "ЧГ=0"); // Избавимся от лидирующего нуля.
	PersonAddressData.address.streetName = СведенияОбАдресе.Улица;
	PersonAddressData.address.prefixStreet = СведенияОбАдресе.УлицаТипКраткий;
	PersonAddressData.address.house = СведенияОбАдресе.Здание.Номер;
	
	PersonAddressData.address.building = Неопределено;
	PersonAddressData.address.struct = Неопределено;
	PersonAddressData.address.flat = Неопределено;
	Если ТипЗнч(СведенияОбАдресе.Корпуса) = Тип("Массив") И СведенияОбАдресе.Корпуса.Количество() > 0 Тогда 
		ТипКорпуса = Неопределено;
		НомерКорпуса = Неопределено;
		НомерСтроения = Неопределено;
		Корпус = СведенияОбАдресе.Корпуса[0];
		Если ТипЗнч(Корпус) = Тип("Структура") И Корпус.Свойство("ТипКорпуса", ТипКорпуса) Тогда  
			Если ТипКорпуса = "Корпус" И Корпус.Свойство("Номер", НомерКорпуса) Тогда 
				PersonAddressData.address.building = НомерКорпуса;
			КонецЕсли;
			Если ТипКорпуса = "Строение" И Корпус.Свойство("Номер", НомерСтроения) Тогда 
				PersonAddressData.address.struct = НомерСтроения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Если ТипЗнч(СведенияОбАдресе.Помещения) = Тип("Массив") И СведенияОбАдресе.Помещения.Количество() > 0 Тогда 
		ТипПомещения = Неопределено;
		НомерКвартиры = Неопределено;
		Помещение = СведенияОбАдресе.Помещения[0];
		Если ТипЗнч(Помещение) = Тип("Структура") И Помещение.Свойство("ТипПомещения", ТипПомещения) Тогда  
			Если ТипПомещения = "Квартира" И Помещение.Свойство("Номер", НомерКвартиры) Тогда 
				PersonAddressData.address.flat = НомерКвартиры;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат PersonAddressData;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеСертификата(СертификатСсылка)
	Возврат МедицинскиеРегистры.ДанныеСертификата(СертификатСсылка);
КонецФункции

&НаСервереБезКонтекста
Функция ВызватьМетод(Организация, ТокенДоступа, ПараметрыВызова)
	Возврат МедицинскиеРегистры.ВызватьМетод(Организация, ТокенДоступа, ПараметрыВызова);
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыСервиса()
	Возврат МедицинскиеРегистры.ПараметрыСервиса();
КонецФункции

&НаСервереБезКонтекста
Функция PersonKey()
	Возврат МедицинскиеРегистрыФРМР.PersonKey();
КонецФункции

&НаСервереБезКонтекста
Функция PersonData()
	Возврат МедицинскиеРегистрыФРМР.PersonData();
КонецФункции

&НаСервереБезКонтекста
Функция GetPersonFull(PersonKey) 
	Возврат МедицинскиеРегистрыФРМР.GetPersonFull(PersonKey);
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPerson(PersonKey, PersonData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPerson(PersonKey, PersonData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonDocumentData()
	Возврат МедицинскиеРегистрыФРМР.PersonDocumentData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCommon(PersonKey, PersonCommonData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCommon(PersonKey, PersonCommonData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCommonData()
	Возврат МедицинскиеРегистрыФРМР.PersonCommonData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonProf(PersonKey, PersonProfData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonProf(PersonKey, PersonProfData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonProfData()
	Возврат МедицинскиеРегистрыФРМР.PersonProfData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonPostgraduate(PersonKey, PersonPostgraduateData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonPostgraduateData()
	Возврат МедицинскиеРегистрыФРМР.PersonPostgraduateData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonExt(PersonKey, PersonExtData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonExt(PersonKey, PersonExtData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonExtData()
	Возврат МедицинскиеРегистрыФРМР.PersonExtData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCert(PersonKey, PersonCertData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCert(PersonKey, PersonCertData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCertData()
	Возврат МедицинскиеРегистрыФРМР.PersonCertData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonNomination(PersonKey, PersonNominationData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonNomination(PersonKey, PersonNominationData);
КонецФункции

&НаСервереБезКонтекста
Функция PersonNominationData()
	Возврат МедицинскиеРегистрыФРМР.PersonNominationData();
КонецФункции

&НаСервереБезКонтекста
Функция PersonQualificationData()
	Возврат МедицинскиеРегистрыФРМР.PersonQualificationData();
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonQualification(PersonKey, PersonQualificationData) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonQualification(PersonKey, PersonQualificationData);
КонецФункции

&НаСервереБезКонтекста
Функция PostPutPersonCard(PersonKey, PersonCardData, ПропуститьКлючMo = Ложь) 
	Возврат МедицинскиеРегистрыФРМР.PostPutPersonCard(PersonKey, PersonCardData, ПропуститьКлючMo);
КонецФункции

&НаСервереБезКонтекста
Функция PersonCardData()
	Возврат МедицинскиеРегистрыФРМР.PersonCardData();
КонецФункции

&НаСервереБезКонтекста
Функция PersonCardServices()
	Возврат МедицинскиеРегистрыФРМР.PersonCardServices();
КонецФункции

#КонецОбласти

#Область КлючевыеРеквизитыЗаполненияФормы

// Функция возвращает описание таблиц формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыТаблицыОчищаемыеПриИзменении() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Объект.Работники");
	Массив.Добавить("Объект.ДокументыУдостоверяющиеЛичность");
	Массив.Добавить("Объект.ЛичноеДело");
	Массив.Добавить("Объект.ОбщееОбразование");
	Массив.Добавить("Объект.ПрофессиональноеОбразование");
	Массив.Добавить("Объект.ПослевузовскоеОбразование");
	Массив.Добавить("Объект.ДополнительноеПрофессиональноеОбразование");
	Массив.Добавить("Объект.Сертификаты");
	Массив.Добавить("Объект.Награды");
	Массив.Добавить("Объект.Квалификация");
	
	Возврат Массив;
	
КонецФункции 

// Функция возвращает массив реквизитов формы подключенных к механизму ключевых реквизитов формы.
&НаСервере
Функция КлючевыеРеквизитыЗаполненияФормыОписаниеКлючевыхРеквизитов() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Организация", НСтр("ru = 'организации'")));
	Массив.Добавить(Новый Структура("ЭлементФормы, Представление", "Дата",        НСтр("ru = 'даты документа'")));
	
	Возврат Массив
	
КонецФункции

#КонецОбласти

#КонецОбласти



