
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПочта = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями");
	
	УстановитьПривилегированныйРежим(Истина);
	РегламентноеЗадание = ПроцессыОбработкиДокументов.НайтиРегламентноеЗадание("УведомлениеОНовыхЗадачахПоОбработкеДокументов");
	Если ЕстьПочта И РегламентноеЗадание <> Неопределено Тогда
		УведомлениеИсполнителейОНовыхЗадачахИспользование = РегламентноеЗадание.Использование;
		Если ТипЗнч(РегламентноеЗадание) = Тип("РегламентноеЗадание") Тогда
			УведомлениеИсполнителейОНовыхЗадачахРасписание = РегламентноеЗадание.Расписание;
		Иначе
			УведомлениеИсполнителейОНовыхЗадачахРасписание = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РегламентноеЗадание.Шаблон, "Расписание").Получить();
		КонецЕсли;
	Иначе
		Элементы.УведомлениеИсполнителей.Видимость = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	// Механизм обмена с личным кабинетом работает в тестовом режиме, поэтому его использование включается в переопределяемом модуле.
	Элементы.ИспользоватьОбменСЛичнымКабинетом.Видимость = ПроцессыОбработкиДокументовПереопределяемый.ВидимостьНастройкиОбменСЛичнымКабинетом();
	
	// Обновление состояния элементов
	УстановитьДоступность();
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриСозданииНаСервереФормыНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НаборКонстант.СрокНапоминанияМинуты > 0 Тогда
		СрокНапоминанияСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеВремени(
			НаборКонстант.СрокНапоминанияМинуты * 60, Ложь, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_НаборКонстант"
		И (Источник = "ИспользоватьЭлектронныеПодписи"
			ИЛИ Источник = "ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента") Тогда
		ПеречитатьДанныеИУстановитьДоступность();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьЭППриВыполненииЭтаповПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПростыеЭППриВыполненииЭтаповПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполнятьКомментарийПриОтрицательномРезультатеПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьНаличиеИсполнителейПередЗапускомЭтапаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьНесколькоШаблоновДляОдногоТипаДокументаПриИзменении(Элемент)
	Если НЕ НаборКонстант.ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента И ЕстьТипыДокументовСНесколькимиШаблонами() Тогда
		ПоказатьПредупреждение(,НСтр("ru= 'Для отключения опции необходимо оставить по одному шаблону для каждого типа документа.'"));
		НаборКонстант.ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента = Истина;
	Иначе
		Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьЗаписьДокументаБезШаблонаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеДокументаДоПринятияКИсполнениюПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьИмеющиесяЭППриОчередномПодписанииПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьПодписанныеДанныеПриОчередномПодписанииПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьНаличиеКлючаПЭПВРеестреПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодписыватьПрисоединенныеФайлыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодписьФайловНастраиваетсяВШаблонеПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
	
	Если НЕ НаборКонстант.ПодписьФайловНастраиваетсяВШаблоне Тогда
		Возврат;
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(Истина, "Установить");
	Кнопки.Добавить(Ложь, "Сбросить");
	Кнопки.Добавить("", "Не изменять");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеОтветаНаВопросОбИзмененииПризнакаПодписиФайловВШаблонах",
		ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'Как следует заполнить признак ""Подписывать файлы"" во всех текущих шаблонах?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , "");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеИнтервалыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура НапоминатьОПриближенииСрокаВыполненияЗадачПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьГрафикиРаботыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойГрафикРаботыПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СрокНапоминанияСтрокойПриИзменении(Элемент)
	НаборКонстант.СрокНапоминанияМинуты = ПроцессыОбработкиДокументовКлиент.ПолучитьИнтервалВремениИзСтроки(СрокНапоминанияСтрокой);
	Если НаборКонстант.СрокНапоминанияМинуты > 0 Тогда
		СрокНапоминанияСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеВремени(
			НаборКонстант.СрокНапоминанияМинуты * 60, Ложь, Ложь);
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Срок напоминания не определен'"), , "СрокНапоминанияСтрокой");
	КонецЕсли;
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеИсполнителейОНовыхЗадачахИспользованиеПриИзменении(Элемент)
	ЗаписатьРегламентноеЗаданиеУведомлениеОНовыхЗадачах(
		УведомлениеИсполнителейОНовыхЗадачахИспользование, УведомлениеИсполнителейОНовыхЗадачахРасписание);
КонецПроцедуры

&НаКлиенте
Процедура УведомлениеИсполнителейОНовыхЗадачахРасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если УведомлениеИсполнителейОНовыхЗадачахРасписание = Неопределено Тогда
		УведомлениеИсполнителейОНовыхЗадачахРасписание = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(УведомлениеИсполнителейОНовыхЗадачахРасписание);
	Оповещение = Новый ОписаниеОповещения("РегламентноеЗаданиеПредставлениеНажатиеЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьДатуПодписанияВШтампеВизуализацииПЭППОДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьСведенияОДолжностиПодписантаПЭППОДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменСЛичнымКабинетомПриИзменении(Элемент)
		Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьИсполнителямОтменуВыполненныхЭтаповПОДПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРеквизитыДокументовДляРасчетаСроковОбработкиПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Ложь); 
	Если НаборКонстант.ИспользоватьРеквизитыДокументовДляРасчетаСроковОбработки Тогда
		Если Не НаборКонстант.ИспользоватьГрафикиРаботы
			ИЛИ Не ЗначениеЗаполнено(НаборКонстант.ОсновнойГрафикРаботы) Тогда
			ПолеФормы = ?(НаборКонстант.ИспользоватьГрафикиРаботы, "НаборКонстант.ОсновнойГрафикРаботы", "НаборКонстант.ИспользоватьГрафикиРаботы"); 
			ТекстСообщения = НСтр("ru='Для корректного учёта рабочих периодов необходимо использовать график работы'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, ПолеФормы); 
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтменятьПроведениеДокументаПриОтменеВыполненияЭтапаПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Ложь, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроверкуПодписываемыхДанныхЧерезХэшПриИзменении(Элемент)
	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ХранитьПодписанныеДанныеВТомахПриИзменении(Элемент)

	Подключаемый_ПриИзмененииРеквизита(Элемент, Истина, Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПодписиСсылочныхДанных(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаПодписиСсылочныхДанных.Форма.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПравНазначенияИсполнителей(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаПравНазначенияИсполнителей.Форма.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИспользованияШаблонов(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаИспользованияШаблонов.Форма.НастройкаИспользованияШаблонов",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПередачиПравИсполнителей(Команда)
	ОткрытьФорму("РегистрСведений.НастройкаПередачиПравИсполнителей.Форма.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеКолонкиСписковЗадач(Команда)
	ОткрытьФорму("Справочник.ДополнительныеКолонкиСписковЗадач.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РеестрКлючейПЭП(Команда)
	ОткрытьФорму("РегистрСведений.РеестрКлючейПростыхЭлектронныхПодписейПОД.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияУведомленийПоРолям(Команда)
	ОткрытьФорму("РегистрСведений.ИсключенияУведомленийПоРолямИсполнителей.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИсключенияУведомленийПоПользователям(Команда)
	ОткрытьФорму("РегистрСведений.ИсключенияУведомленийПоПользователям.ФормаСписка",,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОтображенияДатыПодписанияПереопределяемый(Команда)
	
	ПроцессыОбработкиДокументовКлиентПереопределяемый.ДополнительныеНастройкиОтображенияДатыПодписания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПереносПодписанныхДанныхВПрисоединенныеФайлы(Команда)
	
	ОткрытьФорму("Обработка.ПомощникПереносаПодписанныхДанныхXMLВПрисоединенныеФайлы.Форма.Форма",,ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизита(Элемент, ОбновлятьИнтерфейс = Истина, Оповестить = Ложь)
	
	КонстантаИмя = ПриИзмененииРеквизитаСервер(Элемент.Имя);
	
	Если ОбновлятьИнтерфейс Тогда
		#Если НЕ ВебКлиент Тогда
		ПодключитьОбработчикОжидания("ОбновитьИнтерфейсПрограммы", 1, Истина);
		#КонецЕсли
	КонецЕсли;
	
	Если КонстантаИмя <> "" И Оповестить Тогда
		Оповестить("Запись_НаборКонстант", Новый Структура, КонстантаИмя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнтерфейсПрограммы()
	
	ОбщегоНазначенияКлиент.ОбновитьИнтерфейсПрограммы();
	
КонецПроцедуры

&НаСервере
Функция ПриИзмененииРеквизитаСервер(ИмяЭлемента)
	
	РеквизитПутьКДанным = Элементы[ИмяЭлемента].ПутьКДанным;
	
	КонстантаИмя = СохранитьЗначениеРеквизита(РеквизитПутьКДанным);
	
	УстановитьДоступность(РеквизитПутьКДанным);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Функция СохранитьЗначениеРеквизита(РеквизитПутьКДанным)
	
	Если РеквизитПутьКДанным = "" Тогда
		Возврат "";
	КонецЕсли;
	
	// Определение имени константы.
	КонстантаИмя = "";
	Если НРег(Лев(РеквизитПутьКДанным, 14)) = НРег("НаборКонстант.") Тогда
		// Если путь к данным реквизита указан через "НаборКонстант".
		КонстантаИмя = Сред(РеквизитПутьКДанным, 15);
	ИначеЕсли РеквизитПутьКДанным = "СрокНапоминанияСтрокой" Тогда
		КонстантаИмя = "СрокНапоминанияМинуты";
	Иначе
		// Определение имени и запись значения реквизита в соответствующей константе из "НаборКонстант".
		// Используется для тех реквизитов формы, которые связаны с константами напрямую (в отношении один-к-одному).
	КонецЕсли;
	
	// Сохранения значения константы.
	Если КонстантаИмя <> "" Тогда
		КонстантаМенеджер = Константы[КонстантаИмя];
		КонстантаЗначение = НаборКонстант[КонстантаИмя];
		
		Если КонстантаМенеджер.Получить() <> КонстантаЗначение Тогда
			КонстантаМенеджер.Установить(КонстантаЗначение);
		КонецЕсли;
		
		Если (КонстантаИмя = "ИспользоватьЭППриВыполненииЭтапов"
				ИЛИ КонстантаИмя = "ИспользоватьПростыеЭППриВыполненииЭтапов")
				И КонстантаЗначение = Ложь Тогда
			ЭтотОбъект.Прочитать();
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонстантаИмя;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступность(РеквизитПутьКДанным = "")
	
	ТекущийПользовательПолноправный = Пользователи.ЭтоПолноправныйПользователь();
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьЭППриВыполненииЭтапов"
		ИЛИ РеквизитПутьКДанным = "НаборКонстант.ИспользоватьПростыеЭППриВыполненииЭтапов"
		ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ДоступностьНастроекУсиленнаяЭП = НаборКонстант.ИспользоватьЭлектронныеПодписи И НаборКонстант.ИспользоватьЭППриВыполненииЭтапов;
		ДоступностьНастроекПростаяЭП = НаборКонстант.ИспользоватьПростыеЭППриВыполненииЭтапов;
		
		ДоступностьНастроекВсехЭП = ДоступностьНастроекУсиленнаяЭП ИЛИ ДоступностьНастроекПростаяЭП;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ИспользоватьЭППриВыполненииЭтапов", "Доступность", НаборКонстант.ИспользоватьЭлектронныеПодписи);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "НастройкаПодписиСсылочныхДанных", "Доступность", ДоступностьНастроекВсехЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПодписыватьПрисоединенныеФайлы", "Доступность", ДоступностьНастроекУсиленнаяЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПодписьФайловНастраиваетсяВШаблоне", "Доступность",
			НаборКонстант.ПодписыватьПрисоединенныеФайлы И Элементы.ПодписыватьПрисоединенныеФайлы.Доступность);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭлектроннаяПодписьЗаголовокПроверки", "Доступность", ДоступностьНастроекВсехЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПроверятьИмеющиесяЭППриОчередномПодписании", "Доступность", ДоступностьНастроекУсиленнаяЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПроверятьПодписанныеДанныеПриОчередномПодписании", "Доступность", ДоступностьНастроекВсехЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "РеестрКлючейПЭП", "Доступность", ДоступностьНастроекПростаяЭП);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПроверятьНаличиеКлючаПЭПВРеестре", "Доступность", ДоступностьНастроекПростаяЭП);
		
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ПодписыватьПрисоединенныеФайлы" ИЛИ РеквизитПутьКДанным = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ПодписьФайловНастраиваетсяВШаблоне", "Доступность",
			НаборКонстант.ПодписыватьПрисоединенныеФайлы И Элементы.ПодписыватьПрисоединенныеФайлы.Доступность);
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента" ИЛИ РеквизитПутьКДанным = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "РазрешитьЗаписьДокументаБезШаблона", "Доступность",
			НаборКонстант.ИспользоватьНесколькоШаблоновДляОдногоТипаДокумента);
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.НапоминатьОПриближенииСрокаВыполненияЗадач" ИЛИ РеквизитПутьКДанным = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "СрокНапоминанияСтрокой", "Доступность",
			НаборКонстант.НапоминатьОПриближенииСрокаВыполненияЗадач И ТекущийПользовательПолноправный);
	КонецЕсли;
	
	Если РеквизитПутьКДанным = "НаборКонстант.ИспользоватьГрафикиРаботы" ИЛИ РеквизитПутьКДанным = "" Тогда
		
		ЕстьПодсистемаГрафикиРаботы = ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ГрафикиРаботы"); 
		Если Не ЕстьПодсистемаГрафикиРаботы Тогда
			 ГрафикРаботы = Неопределено;
			 ПроцессыОбработкиДокументовПереопределяемый.ПриОпределенииГрафикаРаботыИсполнителя(Неопределено, ГрафикРаботы, Ложь);
			 
			 Если ГрафикРаботы <> Неопределено Тогда
				Текст = НСтр("ru='В переопределяемых методах описан график работы ""%1"" как основной график'"); 
				ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст,
										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГрафикРаботы, "Наименование"));
										
				РасписаниеРаботы = Новый ТаблицаЗначений;						
				ПроцессыОбработкиДокументовПереопределяемый.ПриПолученииРасписанияРаботы(РасписаниеРаботы);						
				Если РасписаниеРаботы.Количество() > 0 Тогда
					
					НайденныеСтроки = РасписаниеРаботы.НайтиСтроки(Новый Структура("НомерДня",1));
					Если НайденныеСтроки <> Неопределено Тогда  
						ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + "Расписание:"+ Символы.ПС;
						Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
							
							ТекстЗаголовка = ТекстЗаголовка + "С "+ Формат(НайденнаяСтрока.ВремяНачала, "ДЛФ=T")
												+ " по " + Формат(НайденнаяСтрока.ВремяОкончания, "ДЛФ=T")
												+ Символы.ПС;
							
						КонецЦикла;	
						
					КонецЕсли;	
					
				КонецЕсли;						
				Элементы.ИнформацияОбОтсутствииПодсистемыГрафики.Заголовок = ТекстЗаголовка;						
			КонецЕсли;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОтсутствиеПодсистемыГрафики", "Видимость", НЕ ЕстьПодсистемаГрафикиРаботы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОсновнойГрафикРаботы", "Видимость", ЕстьПодсистемаГрафикиРаботы И НаборКонстант.ИспользоватьГрафикиРаботы);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ОсновнойГрафикРаботы", "Доступность", НаборКонстант.ИспользоватьГрафикиРаботы);
		
	КонецЕсли;
	
	Если Элементы.УведомлениеИсполнителей.Видимость
		И (РеквизитПутьКДанным = "УведомлениеИсполнителейОНовыхЗадачахРасписание" Или РеквизитПутьКДанным = "") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УведомлениеИсполнителейОНовыхЗадачахИспользование", "Доступность",
			ТекущийПользовательПолноправный);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ГруппаИсключенияУведомлений", "Видимость",
			УведомлениеИсполнителейОНовыхЗадачахИспользование);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "УведомлениеИсполнителейОНовыхЗадачахРасписание", "Доступность",
			УведомлениеИсполнителейОНовыхЗадачахИспользование И НЕ ОбщегоНазначения.РазделениеВключено() И ТекущийПользовательПолноправный);
			
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы
		(Элементы, "ПереносПодписанныхДанныхВПрисоединенныеФайлы", "Доступность", ТекущийПользовательПолноправный);

	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьДанныеИУстановитьДоступность()
	ЭтотОбъект.Прочитать();
	УстановитьДоступность();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьТипыДокументовСНесколькимиШаблонами()
	
	Возврат ПроцессыОбработкиДокументов.ЕстьТипыДокументовСНесколькимиШаблонами();
	
КонецФункции

&НаКлиенте
Процедура РегламентноеЗаданиеПредставлениеНажатиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УведомлениеИсполнителейОНовыхЗадачахРасписание = Расписание;
	УведомлениеИсполнителейОНовыхЗадачахИспользование = Истина;
	
	ЗаписатьРегламентноеЗаданиеУведомлениеОНовыхЗадачах(
		УведомлениеИсполнителейОНовыхЗадачахИспользование, УведомлениеИсполнителейОНовыхЗадачахРасписание);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегламентноеЗаданиеУведомлениеОНовыхЗадачах(Использование, Расписание)
	
	ПроцессыОбработкиДокументов.ЗаписатьРегламентноеЗадание(
		"УведомлениеОНовыхЗадачахПоОбработкеДокументов", Использование, Расписание);
	
	УстановитьДоступность("УведомлениеИсполнителейОНовыхЗадачахРасписание");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииПризнакаПодписиФайловВШаблонах(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Истина И Результат <> Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитПодписыватьФайлыЭПВШаблонах(Результат);
	
	ПоказатьОповещениеПользователя(НСтр("ru = 'Обработка шаблонов завершена'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитПодписыватьФайлыЭПВШаблонах(Значение)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.ТребуетсяЭП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШаблоныПроцессовЭтапы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|		ПО ШаблоныПроцессовЭтапы.Этап = ЭтапыПроцессовРезультатыВыполнения.Ссылка
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.ТребуетсяЭП
	|	И ШаблоныПроцессовЭтапы.ПодписыватьФайлыЭП <> &ПодписыватьФайлыЭП";
	
	Запрос.УстановитьПараметр("ПодписыватьФайлыЭП", Значение);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ЭтапыСЭП = Новый Соответствие;
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭтапыСЭП.Вставить(Выборка.Ссылка, Истина);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ШаблоныПроцессов");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого Этап Из ШаблонОбъект.Этапы Цикл
				Если ЭтапыСЭП.Получить(Этап.Этап) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				Этап.ПодписыватьФайлыЭП = Значение;
			КонецЦикла;
			
			Если ШаблонОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ШаблонОбъект);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
