#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ЗагрузкаКандидатовИзИнтернета.Имя);
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ЗагрузкаКандидатовИзИнтернета.ИмяМетода);
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

// См. процедуру РегламентныеЗаданияПереопределяемый.ПриОпределенииНастроекРегламентныхЗаданий.
//
Процедура ПриОпределенииНастроекРегламентныхЗаданий(Настройки) Экспорт
	
	Настройка = Настройки.Добавить();
	Настройка.РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЗагрузкаКандидатовИзИнтернета;
	Настройка.ФункциональнаяОпция = Метаданные.ФункциональныеОпции.ИспользоватьЗагрузкуКандидатовИзИнтернета;
	Настройка.ОбращаетсяКВнешнимРесурсам = Истина;
	
КонецПроцедуры

#КонецОбласти

// ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала

// Добавляет в описание профиля необходимые роли для загрузки кандидатов из Интернета.
// 
// Параметры:
//  ОписаниеПрофиля - Массив - Описание профиля доступа.
//
Процедура ДополнитьОписаниеПрофиля(ОписаниеПрофиля) Экспорт
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, 
		"ИспользованиеЗагрузкиКандидатовИзИнтернета", "ЗарплатаКадрыКорпоративнаяПодсистемы.ИнтеграцияРекрутинговыхСайтов");
КонецПроцедуры

// Конец ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	Списки.Вставить(Метаданные.РегистрыСведений.ДоступДляЗагрузкиКандидатовИзИнтернета, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗагрузкаКандидатовИзИнтернета, Истина);
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьКандидатовИзИнтернета", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт 
	ОписанияПрофилей.Добавить(
		ЗагрузкаКандидатовИзИнтернетаСлужебный.ОписаниеПрофиляИспользованиеЗагрузкиКандидатовИзИнтернета());
КонецПроцедуры

Функция ПользовательПоТокену(Токен) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.ПользовательПоТокену(Токен);
КонецФункции

Функция ОткрытыеВакансииПользователяJSON(Пользователь) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.ОткрытыеВакансииПользователяJSON(Пользователь);
КонецФункции

Функция КандидатыПоURLJSON(URLРезюме) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.КандидатыПоURLJSON(URLРезюме);
КонецФункции

Функция ИспользуемыеСайтыПользователяJSON(Пользователь) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.ИспользуемыеСайтыПользователяJSON(Пользователь);
КонецФункции

Функция ГруппыДоступаКандидатовJSON(Пользователь) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.ГруппыДоступаКандидатовJSON(Пользователь);
КонецФункции

Функция НастройкиПрограммыJSON() Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.НастройкиПрограммыJSON();
КонецФункции

Функция СписокОперацийЗагрузкиJSON(Пользователь) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.СписокОперацийЗагрузкиJSON(Пользователь);
КонецФункции

Функция СоздатьОперациюЗагрузкиКандидата(Пользователь, ДанныеКандидата, СостояниеСписка) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.НоваяОперацияЗагрузкиJSON(
		Пользователь, ДанныеКандидата, СостояниеСписка);
КонецФункции

Функция ЗависшиеОперацииЗагрузкиПоUrlJSON(URLРезюме) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаПовтИсп.ЗависшиеОперацииЗагрузкиПоUrlJSON(URLРезюме);
КонецФункции

Функция ОперацияЗагрузкиКандидатаJSON(ИдентификаторЗагрузки) Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.ОперацияЗагрузкиКандидатаJSON(ИдентификаторЗагрузки);
КонецФункции

Функция ВидыОшибок() Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.ВидыОшибок();
КонецФункции

Процедура ЗагрузитьКандидатовИзИнтернета(Пользователь = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЗагрузкаКандидатовИзИнтернетаСлужебный.ЗагрузитьКандидатовИзИнтернета(Пользователь);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ИспользуетсяЗагрузкаКандидатовИзИнтернета() Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.ИспользуетсяЗагрузкаКандидатовИзИнтернета();
КонецФункции

Функция НовыеЗагрузкиКандидатовИзИнтернета() Экспорт
	Возврат ЗагрузкаКандидатовИзИнтернетаСлужебный.НовыеЗагрузкиКандидатовИзИнтернета();
КонецФункции

#КонецОбласти