
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Контроль использования ссылок на неразделенные данные в разделенных.
Процедура КонтрольИспользованияСсылокНаНеразделенныеДанныеВРазделенных() Экспорт
	
	ВыгрузкаЗагрузкаНеразделенныхДанныхСлужебный.КонтрольИспользованияСсылокНаНеразделенныеДанныеВРазделенных();
	
КонецПроцедуры

// Контроль заполнения полей естественного ключа для неразделенных объектов.
Процедура КонтрольЗаполненияПолейЕстественногоКлючаДляНеразделенныхОбъектов() Экспорт
	
	ВыгрузкаЗагрузкаНеразделенныхДанныхСлужебный.КонтрольЗаполненияПолейЕстественногоКлючаДляНеразделенныхОбъектов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
