
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИдентификаторПоддержкиСтрокой = Объект.ИдентификаторПоддержки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой)
		И ИдентификаторПоддержкиСтрокой <> Строка(ТекущийОбъект.ИдентификаторПоддержки) Тогда
		ТекущийОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой) Тогда
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Введен некорректный уникальный идентификатор'"),,
				"ИдентификаторПоддержкиСтрокой",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
