////////////////////////////////////////////////////////////////////////////////
// Подсистема "Шаблоны сообщений"
// Серверные процедуры, обслуживающие правила регистрации объектов.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСеансПовтИсп.НастройкиОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	Если ОбъектМетаданных = Метаданные.Справочники.ШаблоныСообщенийПрисоединенныеФайлы Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ШаблоныСообщений Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти