
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		// Начальное заполнение
		ЗначенияДляЗаполнения = Новый Структура("Ответственный", "Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере();
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ФинансовыйУчет") Тогда
		МодульФинансовыйУчетФормы = ОбщегоНазначения.ОбщийМодуль("ФинансовыйУчетФормы");
		МодульФинансовыйУчетФормы.УстановитьУсловноеОформлениеОбучениеРазвитиеСотрудников(ЭтотОбъект);
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец ПроцессыОбработкиДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов
	
	Если Объект.ПрогрессОбучения Тогда
		Сотрудники = ПолучитьИзВременногоХранилища(АдресПрогресса);
		Для Каждого Сотрудник Из Сотрудники Цикл
			ПрогрессМероприятия = Новый Соответствие;
			Для Номер = 1 По Объект.ПродолжительностьПрогрессаОбучения Цикл
				Прогресс = Сотрудник["Прогресс" + Номер];
				ПрогрессМероприятия.Вставить(Номер, Прогресс);
			КонецЦикла;
			ПрогрессМероприятий = Новый Соответствие;
			ПрогрессМероприятий.Вставить(Объект.Мероприятие, ПрогрессМероприятия);
			РегистрыСведений.ПрогрессОбученияСотрудников.ВнестиПрогрессОбучения(
				Объект.Ссылка, Сотрудник.ФизическоеЛицо, ПрогрессМероприятий);
		КонецЦикла;
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОповещения = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ПараметрыЗаписи);
	ПараметрыОповещения.Вставить("Мероприятие", Объект.Мероприятие);
	ПараметрыОповещения.Вставить("ДатаНачала", Объект.ДатаНачала);
	ПараметрыОповещения.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ОбщегоНазначенияКлиент.ОповеститьОбИзмененииОбъекта(Объект.Ссылка, ПараметрыОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ОбучениеРазвитиеСотрудников") Тогда
		Объект.ПервичныйЭтапОбучения = ВыбранноеЗначение;
		ЗаполнитьРеквизитЭтоСледующийЭтапОбучения(ЭтаФорма);
		ЗаполнитьРеквизитыФормыПоПервичномуМероприятию();
		УстановитьНадписьПервичныйЭтапОбучения(ЭтаФорма);
		УстановитьВторичныеРеквизитыФормыПоМероприятию();
		УстановитьСвойстваЭлементовФормы(ЭтаФорма);
	Иначе
		// подбор из плана обучения
		ЗаполнитьПоОснованиюНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	События = СписокСобытийДляДокументовОтсутствий();
	
	Если События.Найти(ИмяСобытия) <> Неопределено Тогда
		УстановитьСвойстваЭлементовКоманд(ЭтотОбъект);
		ЗаполнитьДокументОтсутствия(Параметр);
	ИначеЕсли ИмяСобытия = "ЗаписанСправочникОбразованиеФизическихЛиц" Тогда
		ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
	ИначеЕсли ИмяСобытия = "ПодобранНовыйСотрудникИзПланаОбучения" И Источник = ЭтотОбъект Тогда
		ПодобратьСотрудниковИзПланаЗавершение(Параметр);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("СправочникСсылка.ОбразованиеФизическихЛиц") Тогда
		ЗаписатьДанныеОснованияДляОбразования(НовыйОбъект, Объект.Ссылка);
		ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КонецЕсли;	
	// Конец ПроцессыОбработкиДокументов

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность = ОбщегоНазначения.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональность");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(
			ЭтотОбъект,
			ТекущийОбъект,
			ПараметрыЗаписи);
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
	Если Объект.ПрогрессОбучения Тогда
		АдресПрогресса = ПоместитьВоВременноеХранилище(Объект.Сотрудники.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МероприятиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Мероприятие) И РеквизитыКЗаполнениюЗаняты("ВыборМероприятия") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("МероприятиеПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,
			НСтр("ru = 'Заполнить документ на основании данных мероприятия? Существующие данные будут утеряны.'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		МероприятиеПриИзмененииНаСервере();
	КонецЕсли;
	
	УстановитьВидимостьДокументаОтсутствия(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаНаОбучениеРазвитие") Тогда
		ОткрытьФорму("Документ.ЗаявкаНаОбучениеРазвитие.ФормаОбъекта", Новый Структура("Ключ", Объект.Основание));
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ПубликацияМероприятияОбученияРазвития") Тогда
		ОткрытьФорму("Документ.ПубликацияМероприятияОбученияРазвития.ФормаОбъекта", Новый Структура("Ключ", Объект.Основание));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеОбученияПриИзменении(Элемент)
	
	Если Не ПродолжениеОбучения Тогда
		ОчиститьПервичныйЭтапОбучения();
	КонецЕсли;
	
	УстановитьСвойстваЭлементовКоманд(ЭтотОбъект);
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПервичныйЭтапОбученияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не ЭтоСледующийЭтапОбучения Тогда
		// Открываем форму выбора
		ПараметрыФормы = Новый Структура("РежимВыбора, СкрыватьСсылку, ТолькоПервичныеЭтапыОбучения", Истина, Объект.Ссылка, Истина);
		Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
			ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Мероприятие) Тогда
			ПараметрыФормы.Вставить("Мероприятие", Объект.Мероприятие);
		КонецЕсли;
		ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", Объект.ПервичныйЭтапОбучения);
		ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаЗачетаПриИзменении(Элемент)
	
	ФормаЗачета = Объект.ФормаЗачета;
	УстановитьВидимостьРеквизитовОценкиОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	ПроверитьВозможностьУдаленияСтрокиСотрудника(ТекущиеДанные, Отказ);
	
	Если Не Отказ Тогда
		УдалитьЗаписиПоДокументамОтсутствияСПроверкой(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)

	ПроверитьВозможностьИзмененияПериодаОбучения();

КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПроверитьВозможностьИзмененияПериодаОбучения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьИзмененияПериодаОбучения()
	
	Если Не ОбучениеРазвитиеВызовСервера.ЗначениеРеквизитаОбъекта(Объект.Мероприятие, "ОбучениеСОтрывомОтПроизводства") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Ключ.Пустая() Тогда
		ЕстьДокументыОтсутствия = ОбучениеРазвитиеВызовСервера.ЕстьДокументыОтсутствияПоОбучению(Объект.Ссылка);
	
		Если ЕстьДокументыОтсутствия Тогда
			ТекстСообщения = НСтр("ru = 'Для данного обучения уже созданы документы отсутствия.
			|Изменить даты в документах отсутствия необходимо будет вручную. Продолжить?'");
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("СохраненныеЗначенияРеквизитов", СохраненныеЗначенияРеквизитов);
			Оповещение = Новый ОписаниеОповещения("ПроверитьВозможностьИзмененияПериодаОбученияЗавершение", ЭтотОбъект, ПараметрыОповещения);
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьИзмененияПериодаОбученияЗавершение(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		СохраненныеЗначения = Параметры.СохраненныеЗначенияРеквизитов;
		Объект.ДатаНачала = СохраненныеЗначения.ДатаНачала;
		Объект.ДатаОкончания = СохраненныеЗначения.ДатаОкончания;
		Возврат;
	КонецЕсли;
	
	СохранитьЗначенияРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоХарактеристик

&НаКлиенте
Процедура ДеревоХарактеристикВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ХарактеристикиПерсоналаКлиент.ХарактеристикиВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыХарактеристикиПерсонала

&НаКлиенте
Процедура ХарактеристикиПерсоналаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ХарактеристикиПерсоналаКлиент.ХарактеристикиВыбор(Элемент.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДобавленыСотрудники = Ложь;
	Для Каждого ВыбранныйСотрудник Из ВыбранноеЗначение Цикл
		Если Объект.Сотрудники.НайтиСтроки(Новый Структура("Сотрудник", ВыбранныйСотрудник)).Количество() = 0 Тогда
			НовыйСотрудник = Объект.Сотрудники.Добавить();
			НовыйСотрудник.Сотрудник = ВыбранныйСотрудник;
			ДобавленыСотрудники = Истина;
		КонецЕсли;
	КонецЦикла; 

	Если ДобавленыСотрудники Тогда
		ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
		РассчитатьСуммуРасходов();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.СотрудникиСтрокаСвидетельства Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекущиеДанные.Свидетельство) Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Свидетельство);
			ОткрытьФорму("Справочник.ОбразованиеФизическихЛиц.ФормаОбъекта",ПараметрыФормы);
		Иначе
			ВвестиСвидетельствоКлиент();
		КонецЕсли;
	ИначеЕсли Поле = Элементы.СотрудникиДокументОтсутствия Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтсутствия) Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ДокументОтсутствия);
			Имя = ПолучитьИмяДокумента(ТекущиеДанные.ДокументОтсутствия);
			ОткрытьФорму(СтрШаблон("Документ.%1.ФормаОбъекта", Имя), ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Поле = Элементы.СотрудникиСотрудник Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) И (ЗначениеЗаполнено(ТекущиеДанные.ДокументОтсутствия) 
			Или ЗначениеЗаполнено(ТекущиеДанные.Свидетельство)) Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Сотрудник);
			ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяДокумента(ДокументСсылка)
	
	Возврат ДокументСсылка.Метаданные().Имя;

КонецФункции

&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.СтрокаСвидетельства = НСтр("ru = 'Ввести результаты'");
		Элемент.ТекущиеДанные.Свидетельство = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ОбразованиеФизическихЛиц.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		РассчитатьСуммуРасходов();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПослеУдаления(Элемент)
	РассчитатьСуммуРасходов();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ФизическоеЛицо = ФизическоеЛицоСотрудника(ТекущиеДанные.Сотрудник);
	ЗаполнитьСвидетельствоВСтрокеСотрудника(ЭтаФорма, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	НастройкиФормыВыбора = Новый НастройкиКомпоновкиДанных;
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		НастройкиФормыВыбора.Отбор,
		"ДатаУвольнения",
		ВидСравненияКомпоновкиДанных.Равно,
		'00010101');
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиФормыВыбора);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранныхСотрудников", АдресСпискаПодобранныхСотрудников());
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура РасходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуРасходов();

КонецПроцедуры

&НаКлиенте
Процедура РасходыПослеУдаления(Элемент)
	РассчитатьСуммуРасходов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль(
			"ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент");
		МодульИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(
			Команда,
			ЭтотОбъект,
			Объект);
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.Сотрудники,,,,,АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПубликации(Команда)
	
	Если РеквизитыКЗаполнениюЗаняты("ЗаполнитьИзПубликации") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьИзПубликацииЗавершение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,
			НСтр("ru = 'Заполнить документ на основании данных публикации? Существующие данные будут утеряны.'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьИзПубликацииНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтпуск(Команда)
	
	СоздатьДокумент("Отпуск", "ОтпускаСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКомандировку(Команда)
		
	СоздатьДокумент("Командировка", "КомандировкиСотрудников");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОтсутствие(Команда)

	СоздатьДокумент("ОплатаПоСреднемуЗаработку", "ОплатаПоСреднемуЗаработкуСписком");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеЭтапыОбучения(Команда)
	
	Если Не ПродолжениеОбучения Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Отбор.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ЭтапыОбучения", Объект.ПервичныйЭтапОбучения);
	
	ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.ФормаСписка", ПараметрыФормы, Объект.ПервичныйЭтапОбучения, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоКомпетенциям(Команда)
	
	Элементы.ПоКомпетенциям.Пометка = НЕ Элементы.ПоКомпетенциям.Пометка;
	
	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппКомандВКоманднойПанелиХарактеристик(ЭтаФорма, Элементы.ПоКомпетенциям);
	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппХарактеристикПерсонала(ЭтаФорма, Элементы.ПоКомпетенциям);
	
	ЗаполнитьДеревоХарактеристикНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудниковИзПлана(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("АдресСпискаПодобранныхСотрудников", АдресСпискаПодобранныхСотрудников());
	ПараметрыФормы.Вставить("Мероприятие", Объект.Мероприятие);
	ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	ПараметрыФормы.Вставить("ИсключаемыйРегистратор", Объект.Ссылка);
	ПараметрыФормы.Вставить("ДатаАктуальности", Объект.ДатаОкончания);
	
	ОткрытьФорму("Документ.ОбучениеРазвитиеСотрудников.Форма.ПодборИзЗапланированногоОбучения",
		ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект)
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплата");
		МодульПроцессыОбработкиДокументовЗарплата.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ПроцессыОбработкиДокументов
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ПроцессыОбработкиДокументовЗарплата") Тогда	
		МодульПроцессыОбработкиДокументовЗарплата = ОбщегоНазначенияКлиент.ОбщийМодуль("ПроцессыОбработкиДокументовЗарплатаКлиент");
		МодульПроцессыОбработкиДокументовЗарплата.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;		
	// Конец ПроцессыОбработкиДокументов
КонецПроцедуры

#КонецОбласти

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	ХарактеристикиПерсоналаФормы.ЗагрузитьРежимОтображенияПоКомпетенциям("ОтображениеПоКомпетенциямОбучениеРазвитиеСотрудников", Элементы.ПоКомпетенциям);
	
	УстановитьВторичныеРеквизитыФормыПоМероприятию();
	ЗаполнитьДополнительныеРеквизитыФормы();
	
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	УстановитьСвойстваЭлементовКоманд(ЭтотОбъект);
	ОбучениеРазвитиеФормы.УстановитьВидимостьКомандСозданияДокументов(ЭтотОбъект);
	
	УстановитьРасшифровкуСуммыРасходов(ЭтотОбъект);
	
	ЧтениеПрогрессаОбученияСотрудников = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПрогрессОбученияСотрудников);
	ДобавлениеИзменениеПрогрессаОбученияСотрудников = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ПрогрессОбученияСотрудников);
	Если Не Пользователи.ЭтоПолноправныйПользователь()
		И Не ЧтениеПрогрессаОбученияСотрудников 
		И Не ДобавлениеИзменениеПрогрессаОбученияСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	Если ЧтениеПрогрессаОбученияСотрудников И Не ДобавлениеИзменениеПрогрессаОбученияСотрудников Тогда
		Элементы.СотрудникиПрогрессОбученияГруппа.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ИспользоватьОценкуПрохожденияИПР = ПолучитьФункциональнуюОпцию("ИспользоватьПрогрессОбучения");
	Если Не ИспользоватьОценкуПрохожденияИПР Тогда
		Объект.ПрогрессОбучения = Ложь;
	Иначе
		НастройкиОбученияРазвития = РегистрыСведений.НастройкиОбученияРазвития.ЗначенияНастроек();
		Если НастройкиОбученияРазвития.ИспользоватьПрогрессОбучения Тогда
			Объект.ПрогрессОбучения = НастройкиОбученияРазвития.ИспользоватьПрогрессОбучения;
			Объект.ПродолжительностьПрогрессаОбучения = НастройкиОбученияРазвития.ПродолжительностьПрогрессаОбучения;
			Объект.РазмерностьПродолжительностиПрогрессаОбучения =
				НастройкиОбученияРазвития.РазмерностьПродолжительностиПрогрессаОбучения;
		КонецЕсли;
		СоздатьИЗаполнитьРеквизитыПрогрессаОбучения();
	КонецЕсли;
	
	УстановитьВидимостьДокументаОтсутствия(ЭтотОбъект);
	
	ЗаполнитьДокументОтсутствия(ЭтотОбъект);
	СохранитьЗначенияРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СохранитьЗначенияРеквизитов(Форма)
	
	НовыеЗначения = Новый Структура;
	НовыеЗначения.Вставить("ДатаНачала", Форма.Объект.ДатаНачала);
	НовыеЗначения.Вставить("ДатаОкончания", Форма.Объект.ДатаОкончания);
	
	Форма.СохраненныеЗначенияРеквизитов = Новый ФиксированнаяСтруктура(НовыеЗначения);

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СотрудникиСтрокаСвидетельства.Имя);
	ПолеЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сотрудники.Свидетельство");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборЭлемента.Использование = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Ввести результаты'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СотрудникиДокументОтсутствия.Имя);
	ПолеЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сотрудники.ДокументОтсутствия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ОтборЭлемента.Использование = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Документ отсутствия не введен'"));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СотрудникиСотрудник.Имя);
	ПолеЭлемента.Использование = Истина;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сотрудники.Сотрудник");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.Использование = Истина;

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаОтбора.Использование = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сотрудники.ДокументОтсутствия");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.Использование = Истина;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Сотрудники.Свидетельство");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	ОтборЭлемента.Использование = Истина;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыФормыПоПервичномуМероприятию()
	
	Если РеквизитыКЗаполнениюЗаняты("ВыборМногоэтапногоОбучения") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("МногоэтапноеОбучениеВыборЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,
			НСтр("ru = 'Заполнить документ на основании данных выбранного этапа? Существующие данные будут утеряны.'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		МногоэтапноеОбучениеВыборЗавершение(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПервичныйЭтапОбучения()
	
	Объект.ПервичныйЭтапОбучения = Объект.Ссылка;
	ЗаполнитьРеквизитЭтоСледующийЭтапОбучения(ЭтотОбъект);
	
	УстановитьНадписьПервичныйЭтапОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура МногоэтапноеОбучениеВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		// Заполняем весь документ на основании выбранного этапа.
		ЗаполнитьПоОснованиюНаСервере(Объект.ПервичныйЭтапОбучения);
	Иначе
		// Заполняем только некоторые реквизиты.
		ЗаполнитьПодразделениеМероприятиеПоОснованиюНаСервере();
	КонецЕсли;
	
	Модифицированность = Истина;
	
	УстановитьВторичныеРеквизитыФормыПоМероприятию();
	
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	УстановитьСвойстваЭлементовКоманд(ЭтотОбъект);
	 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПубликацииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзПубликацииНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзПубликацииНаКлиенте()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ПоказыватьЗакрытыеПубликации", Истина);
	ПараметрыФормы.Вставить("НаДату", Объект.Дата);
	
	Если ЗначениеЗаполнено(Объект.Мероприятие) Тогда
		ПараметрыФормы.Вставить("Мероприятие", Объект.Мероприятие);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПубликации", ЭтотОбъект);
	ОткрытьФорму("Документ.ПубликацияМероприятияОбученияРазвития.ФормаСписка", ПараметрыФормы, ЭтотОбъект, , , ,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятиеПриИзмененииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли; 
	
	МероприятиеПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВвестиСвидетельствоКлиент()
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Свидетельство) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокументаОбучения = ДанныеМероприятия(Объект.Мероприятие);
	ДанныеДокументаОбучения.Вставить("ФизическоеЛицо", Элементы.Сотрудники.ТекущиеДанные.ФизическоеЛицо);
	ДанныеДокументаОбучения.Вставить("НаименованиеКурса", Объект.Мероприятие);
	
	Если ЭтоСледующийЭтапОбучения Тогда
		ДанныеДокументаОбучения.Вставить("Начало", ДатаНачалаПервичногоОбучения(Объект.ПервичныйЭтапОбучения));
	Иначе	
		ДанныеДокументаОбучения.Вставить("Начало", Объект.ДатаНачала);
	КонецЕсли;
	
	ДанныеДокументаОбучения.Вставить("Окончание", Объект.ДатаОкончания);
	ДанныеДокументаОбучения.Вставить("КоличествоЧасов", Объект.КоличествоУчебныхЧасов);
	ТекстОснования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Пр. № %1 от %2'"), ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер), Формат(Объект.Дата,"ДЛФ=D"));
	ДанныеДокументаОбучения.Вставить("Основание", ТекстОснования);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеДокументаОбучения", ДанныеДокументаОбучения);
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Ввести свидетельство возможно только после записи данных.
				|Данные будут записаны.'");
				
		Оповещение = Новый ОписаниеОповещения("ВвестиСвидетельствоКлиентЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ВвестиСвидетельствоКлиентЗавершение(Неопределено, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиСвидетельствоКлиентЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Попытка
		Записать();
		Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
			Возврат;
		КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru='Не удалось записать свидетельство.'") + ИнформацияОбОшибке().Описание);
			Возврат;
		КонецПопытки;
	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокументаОбучения = ДополнительныеПараметры.ДанныеДокументаОбучения;
	
	Основание = Новый Структура;
	Основание.Вставить("Ссылка", Объект.Ссылка);
	Основание.Вставить("Действие", "ЗаполнитьИзОбучения");
	Основание.Вставить("ДанныеДокументаОбучения", ДанныеДокументаОбучения);
	
	ПараметрыФормы = Новый Структура("Основание", Основание);
	
	ОткрытьФорму("Справочник.ОбразованиеФизическихЛиц.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#Область УстановкаСвойствЭлементовФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовФормы(Форма)

	ЗаполнятьКонтрагента = Ложь;
	Если Форма.ВнешнееОбучение Тогда
		ЗаполнятьКонтрагента = Истина;
	КонецЕсли;
	
	ЗаполнятьПреподавателя = Ложь;
	Если Не Форма.ВнешнееОбучение И Не Форма.ЭлектронныйКурс Тогда
		ЗаполнятьПреподавателя = Истина;
	КонецЕсли;
	
	ЗаполнятьМестоПроведения = Ложь;
	Если Не Форма.ЭлектронныйКурс Тогда
		ЗаполнятьМестоПроведения = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Контрагент",
		"Видимость",
		ЗаполнятьКонтрагента);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Преподаватель",
		"Видимость",
		ЗаполнятьПреподавателя);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"МестоПроведения",
		"Видимость",
		ЗаполнятьМестоПроведения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Контрагент",
		"Доступность",
		Форма.ВнешнееОбучение);
		
	// Многоэтапное обучение.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Подразделение",
		"Доступность",
		Не Форма.ПродолжениеОбучения);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Мероприятие",
		"Доступность",
		Не Форма.ПродолжениеОбучения);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НадписьПервичныйЭтапОбучения",
		"Видимость",
		Форма.ПродолжениеОбучения);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"Преподаватель",
		"Заголовок",
		НаименованиеПреподавателя(Форма.Объект.Мероприятие));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиОценка",
		"Заголовок",
		Форма.ФормаЗачета);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаДокументОбучениеРазвитиеСотрудниковСоздатьНаОсновании",
		"Заголовок",
		НСтр("ru = 'Продолжение обучения'"));
		
	УстановитьВидимостьРеквизитовОценкиОбучения(Форма);
		
	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппКомандВКоманднойПанелиХарактеристик(Форма, Форма.Элементы.ПоКомпетенциям);
	ХарактеристикиПерсоналаКлиентСервер.УстановитьВидимостьГруппХарактеристикПерсонала(Форма, Форма.Элементы.ПоКомпетенциям);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитовОценкиОбучения(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиОценка",
		"Видимость",
		ЗначениеЗаполнено(Форма.ФормаЗачета));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиКомментарийКОценке",
		"Видимость",
		ЗначениеЗаполнено(Форма.ФормаЗачета));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиОценка",
		"Заголовок",
		Форма.ФормаЗачета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДокументаОтсутствия(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"СотрудникиДокументОтсутствия",
		"Видимость",
		Форма.МероприятиеСОтрывомОтПроизводства);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовКоманд(Форма)

	НастройкиРасчетаЗарплаты = НастройкиРасчетаЗарплатыСервер();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаСоздатьКомандировку",
		"Доступность",
		НастройкиРасчетаЗарплаты.ИспользоватьОплатуКомандировок
		И Форма.МероприятиеСОтрывомОтПроизводства);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаСоздатьОтпуск",
		"Доступность",
		НастройкиРасчетаЗарплаты.ИспользоватьОтпускаУчебные
		И Форма.МероприятиеСОтрывомОтПроизводства);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаСоздатьОтсутствие",
		"Доступность",
		Форма.МероприятиеСОтрывомОтПроизводства);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ФормаПоказатьВсеЭтапыОбучения",
		"Видимость",
		Форма.ЭтоСледующийЭтапОбучения);
		
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция НастройкиРасчетаЗарплатыСервер()
	Возврат РасчетЗарплатыРасширенный.НастройкиРасчетаЗарплаты();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьОснования(Форма)

	Если ЗначениеЗаполнено(Форма.Объект.Основание) Тогда
		Форма.НадписьОснование = Форма.Объект.Основание;
	Иначе
		Форма.НадписьОснование = НСтр("ru = '<без основания>'");
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"НадписьОснование",
		"Видимость",
		ЗначениеЗаполнено(Форма.Объект.Основание));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьПервичныйЭтапОбучения(Форма)

	Если Форма.ПродолжениеОбучения Тогда
		Форма.НадписьПервичныйЭтапОбучения = Форма.Объект.ПервичныйЭтапОбучения;
	Иначе
		Форма.НадписьПервичныйЭтапОбучения = НСтр("ru = 'Выбрать первичный этап'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПубликации(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьПоОснованиюНаСервере(РезультатВыбора);
	УстановитьВторичныеРеквизитыФормыПоМероприятию();
	УстановитьСвойстваЭлементовФормы(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Сотрудники.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыФормы()

	ЗаполнитьРеквизитПродолжениеОбучения(ЭтотОбъект);
	ЗаполнитьРеквизитЭтоСледующийЭтапОбучения(ЭтотОбъект);
	
	ЗаполнитьВторичныеРеквизитыТаблицыСотрудники();
	
	УстановитьНадписьОснования(ЭтотОбъект);
	УстановитьНадписьПервичныйЭтапОбучения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитПродолжениеОбучения(Форма)
	Форма.ПродолжениеОбучения = ЗначениеЗаполнено(Форма.Объект.ПервичныйЭтапОбучения) 
		И (Форма.Объект.ПервичныйЭтапОбучения <> Форма.Объект.Ссылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитЭтоСледующийЭтапОбучения(Форма)
	Форма.ЭтоСледующийЭтапОбучения = ЗначениеЗаполнено(Форма.Объект.ПервичныйЭтапОбучения) 
		И (Форма.Объект.ПервичныйЭтапОбучения <> Форма.Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВторичныеРеквизитыТаблицыСотрудники()

	ЗаполнитьТаблицуСвидетельств();
	
	Для Каждого СтрокаСотрудника Из Объект.Сотрудники Цикл
		СтрокаСотрудника.ФизическоеЛицо = ФизическоеЛицоСотрудника(СтрокаСотрудника.Сотрудник);
		ЗаполнитьСвидетельствоВСтрокеСотрудника(ЭтотОбъект, СтрокаСотрудника);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументОтсутствия(Параметр)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник КАК Сотрудник,
		|	ОтсутствияНаОснованииОбучения.ДокументОтсутствия КАК ДокументОтсутствия
		|ИЗ
		|	Документ.ОбучениеРазвитиеСотрудников.Сотрудники КАК ОбучениеРазвитиеСотрудниковСотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтсутствияНаОснованииОбучения КАК ОтсутствияНаОснованииОбучения
		|		ПО ОбучениеРазвитиеСотрудниковСотрудники.Сотрудник = ОтсутствияНаОснованииОбучения.Сотрудник
		|			И (ОтсутствияНаОснованииОбучения.ДокументОснование = &Ссылка)
		|ГДЕ
		|	ОбучениеРазвитиеСотрудниковСотрудники.Ссылка = &Ссылка
		|	И НЕ ОтсутствияНаОснованииОбучения.ДокументОтсутствия.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	ТаблицаОтсутствий = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСотрудник Из Объект.Сотрудники Цикл
		Отбор = Новый Структура("Сотрудник", СтрокаСотрудник.Сотрудник);
		НайденныеСтроки = ТаблицаОтсутствий.НайтиСтроки(Отбор);
		СтрокаСотрудник.ДокументОтсутствия =
			?(НайденныеСтроки.Количество() > 0, НайденныеСтроки[0].ДокументОтсутствия, Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьУдаленияСтрокиСотрудника(ТекущиеДанные, Отказ)
	
	ПроверитьУдалениеСтрокиПоРеквизиту(
		ТекущиеДанные,
		"ДокументОтсутствия",
		НСтр("ru = 'Сотруднику %1 уже оформлен документ %2.
		|Для удаления этой строки необходимо удалить сотрудника из документа отсутствия или отменить отсутствие.'"),
		Отказ);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ПроверитьУдалениеСтрокиПоРеквизиту(
		ТекущиеДанные,
		"Свидетельство",
		НСтр("ru = 'Сотруднику %1 уже оформлено свидетельство %2.
		|Для удаления этой строки необходимо удалить свидетельство.'"),
		Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьУдалениеСтрокиПоРеквизиту(ТекущиеДанные, ИмяРеквизита, ШаблонСообщения, Отказ)
	
	ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
	
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		Если Не ЕстьДругиеСтрокиССотрудником(
				ТекущиеДанные.Сотрудник,
				ИмяРеквизита,
				ЗначениеРеквизита) Тогда
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущиеДанные.Сотрудник, ЗначениеРеквизита);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЕстьДругиеСтрокиССотрудником(Сотрудник, ИмяРеквизита, ЗначениеРеквизита)
	
	Отбор = Новый Структура("Сотрудник, " + ИмяРеквизита, Сотрудник, ЗначениеРеквизита);
	НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Отбор); 
	
	Если НайденныеСтроки.Количество() > 1 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УдалитьЗаписиПоДокументамОтсутствияСПроверкой(ТекущиеДанные)
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДокументОтсутствия) Тогда
		Если Не ЕстьДругиеСтрокиССотрудником(
				ТекущиеДанные.Сотрудник,
				"ДокументОтсутствия",
				ТекущиеДанные.ДокументОтсутствия) Тогда
			УдалитьЗаписиПоДокументамОтсутствия(Объект.Ссылка, ТекущиеДанные.Сотрудник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиПоДокументамОтсутствия(Документ, Сотрудник)
	
	РегистрыСведений.ОтсутствияНаОснованииОбучения.УдалитьЗаписиПоОтсутствиямСотрудника(Документ, Сотрудник);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФизическоеЛицоСотрудника(Сотрудник)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСвидетельств()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументОснованиеОбразованиеФизическихЛиц.ОбъектСсылка.Владелец КАК ФизическоеЛицо,
		|	ДокументОснованиеОбразованиеФизическихЛиц.ОбъектСсылка КАК Свидетельство
		|ПОМЕСТИТЬ ВТСвидетельства
		|ИЗ
		|	РегистрСведений.ОбразованиеФизическихЛицОснования КАК ДокументОснованиеОбразованиеФизическихЛиц
		|ГДЕ
		|	ДокументОснованиеОбразованиеФизическихЛиц.Обучение = &ДокументСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСвидетельства.ФизическоеЛицо,
		|	ВТСвидетельства.Свидетельство,
		|	ОбразованиеФизическихЛиц.ВидДокумента,
		|	ОбразованиеФизическихЛиц.Серия,
		|	ОбразованиеФизическихЛиц.Номер,
		|	ОбразованиеФизическихЛиц.ДатаВыдачи
		|ИЗ
		|	ВТСвидетельства КАК ВТСвидетельства
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбразованиеФизическихЛиц КАК ОбразованиеФизическихЛиц
		|		ПО ВТСвидетельства.Свидетельство = ОбразованиеФизическихЛиц.Ссылка";
	ТаблицаСвидетельств.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура МероприятиеПриИзмененииНаСервере()
	ЗаполнитьПоОснованиюНаСервере(Объект.Мероприятие);
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОснованиюНаСервере(ДанныеЗаполнения)

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	
	ПриПолученииДанныхНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодразделениеМероприятиеПоОснованиюНаСервере();

	ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ПервичныйЭтапОбучения,"Подразделение, Мероприятие");
	ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения, "Подразделение, Мероприятие");
	ЗаполнитьДополнительныеРеквизитыФормы();

КонецПроцедуры

&НаКлиенте
// Проверяет наличие данных в реквизитах, предназначенных для заполнения.
Функция РеквизитыКЗаполнениюЗаняты(Режим)

	Если Режим = "ПодобратьИзПлана" Тогда
	 
		Возврат ЗначениеЗаполнено(Объект.ДатаНачала)
			ИЛИ ЗначениеЗаполнено(Объект.ДатаОкончания)
			ИЛИ ЗначениеЗаполнено(Объект.КоличествоУчебныхЧасов)
			ИЛИ Объект.Сотрудники.Количество() > 0
			ИЛИ Объект.Расходы.Количество() > 0;
			
	ИначеЕсли Режим = "ЗаполнитьИзПубликации" Тогда
		
		Возврат ЗначениеЗаполнено(Объект.ДатаНачала)
			ИЛИ ЗначениеЗаполнено(Объект.ДатаОкончания)
			ИЛИ ЗначениеЗаполнено(Объект.КоличествоУчебныхЧасов)
			ИЛИ ЗначениеЗаполнено(Объект.Преподаватель)
			ИЛИ ЗначениеЗаполнено(Объект.Контрагент)
			ИЛИ ЗначениеЗаполнено(Объект.МестоПроведения)
			ИЛИ Объект.Сотрудники.Количество() > 0
			ИЛИ Объект.Расходы.Количество() > 0;
			
	ИначеЕсли Режим = "ВыборМногоэтапногоОбучения" Тогда
		
		Возврат ЗначениеЗаполнено(Объект.Преподаватель)
			ИЛИ ЗначениеЗаполнено(Объект.Контрагент)
			ИЛИ ЗначениеЗаполнено(Объект.МестоПроведения)
			ИЛИ Объект.Сотрудники.Количество() > 0;
			
	ИначеЕсли Режим = "ВыборМероприятия" Тогда
		
		Возврат ЗначениеЗаполнено(Объект.КоличествоУчебныхЧасов)
			ИЛИ ЗначениеЗаполнено(Объект.Преподаватель)
			ИЛИ ЗначениеЗаполнено(Объект.Контрагент)
			ИЛИ ЗначениеЗаполнено(Объект.МестоПроведения);
			
	КонецЕсли;
	
КонецФункции
 
&НаСервереБезКонтекста
Функция ДанныеМероприятия(Мероприятие)

	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ВидМероприятия");
	ИменаРеквизитов.Добавить("УчебноеЗаведение");
	ИменаРеквизитов.Добавить("ВидДокументаОбОбразовании");
	ИменаРеквизитов.Добавить("ПрисваиваемаяСпециальность");
	ИменаРеквизитов.Добавить("Квалификация");
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Мероприятие, ИменаРеквизитов);
	
КонецФункции

// Устанавливает реквизиты формы в зависимости от выбранного мероприятия.
//
&НаСервере
Процедура УстановитьВторичныеРеквизитыФормыПоМероприятию()
	
	УстановитьПризнакиМероприятияВФорме();
	УстановитьИнфоНадписьМероприятия();
	
	ХарактеристикиПерсоналаФормы.ЗаполнитьВторичнуюТаблицуХарактеристикИзМероприятия(ХарактеристикиПерсонала, Объект.Мероприятие);
	ХарактеристикиПерсоналаФормы.ЗаполнитьКартинкуИВидХарактеристикиТаблицыХарактеристик(ХарактеристикиПерсонала);
	ЗаполнитьДеревоХарактеристикНаСервере();
	
	УстановитьВидимостьРеквизитовОценкиОбучения(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакиМероприятияВФорме()

	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("УчебноеЗаведение");
	ИменаРеквизитов.Добавить("СпособПроведения");
	ИменаРеквизитов.Добавить("ФормаЗачета");
	ИменаРеквизитов.Добавить("ОбучениеСОтрывомОтПроизводства");
	
	РеквизитыМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Мероприятие, ИменаРеквизитов);
	
	ВнешнееОбучение = Ложь;
	Если РеквизитыМероприятия.СпособПроведения = Перечисления.СпособыПроведенияМероприятийОбученияРазвития.ВнешнееМероприятие Тогда
		ВнешнееОбучение = Истина;
	КонецЕсли;
	
	ЭлектронныйКурс = Ложь;
	Если РеквизитыМероприятия.СпособПроведения = Перечисления.СпособыПроведенияМероприятийОбученияРазвития.ЭлектронныйКурс Тогда
		ЭлектронныйКурс = Истина;
	КонецЕсли;
	
	МероприятиеУчебноеЗаведение = РеквизитыМероприятия.УчебноеЗаведение;
	МероприятиеСОтрывомОтПроизводства = РеквизитыМероприятия.ОбучениеСОтрывомОтПроизводства;
	Если Не ЗначениеЗаполнено(Объект.ФормаЗачета) Тогда
		ФормаЗачета = РеквизитыМероприятия.ФормаЗачета;
		Объект.ФормаЗачета = ФормаЗачета;
	Иначе
		ФормаЗачета = Объект.ФормаЗачета;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИнфоНадписьМероприятия()
	ИнфоНадписьМероприятия = ОбучениеРазвитие.ИнфоНадписьМероприятия(Объект.Мероприятие, ТипЗнч(Объект.Ссылка));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатаНачалаПервичногоОбучения(ПервичныйЭтапОбучения)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПервичныйЭтапОбучения, "ДатаНачала");
КонецФункции

&НаСервереБезКонтекста
Функция НаименованиеПреподавателя(Мероприятие)
	Возврат ОбучениеРазвитие.НаименованиеПреподавателяПоВидуМероприятия(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Мероприятие, "ВидМероприятия"));
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеОснованияДляОбразования(ОбъектСсылка, Обучение);
	
	ОбучениеРазвитие.ЗаписатьОбразованиеФизическихЛицОснования(ОбъектСсылка, Обучение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(ИмяДокумента, ИмяДокументаСписок)

	ОбучениеРазвитиеКлиент.СоздатьПриказ(ЭтотОбъект, ИмяДокумента, ИмяДокументаСписок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоХарактеристикНаСервере()

	ХарактеристикиПерсоналаФормы.СохранитьРежимОтображенияПоКомпетенциям("ОтображениеПоКомпетенциямОбучениеРазвитиеСотрудников", Элементы.ПоКомпетенциям);
	
	Если Не Элементы.ПоКомпетенциям.Пометка Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиДерево = РеквизитФормыВЗначение("ДеревоХарактеристик");
	ХарактеристикиПерсоналаФормы.ЗаполнитьДеревоХарактеристик(ХарактеристикиПерсонала, ХарактеристикиДерево);
	ЗначениеВРеквизитФормы(ХарактеристикиДерево, "ДеревоХарактеристик");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьСвидетельствоВСтрокеСотрудника(Форма, ТекущаяСтрока)

	НайденныеСтроки = Форма.ТаблицаСвидетельств.НайтиСтроки(Новый Структура("ФизическоеЛицо", ТекущаяСтрока.ФизическоеЛицо));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ТекущаяСтрока.Свидетельство = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ОбразованиеФизическихЛиц.ПустаяСсылка");
	Иначе
		ТекущаяСтрока.Свидетельство = НайденныеСтроки[0].Свидетельство;
		ТекущаяСтрока.СтрокаСвидетельства = ТекстСтрокиСвидетельства(НайденныеСтроки[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстСтрокиСвидетельства(ДанныеСвидетельства)

	// Собрали сводный номер.
	Если ЗначениеЗаполнено(ДанныеСвидетельства.Серия)
		И ЗначениеЗаполнено(ДанныеСвидетельства.Номер) Тогда
		СертификатСводныйНомер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1-%2", ДанныеСвидетельства.Серия, ДанныеСвидетельства.Номер);
	Иначе
		СертификатСводныйНомер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 %2", ДанныеСвидетельства.Серия, ДанныеСвидетельства.Номер);
		СертификатСводныйНомер = СокрЛП(СертификатСводныйНомер);
	КонецЕсли;

	// Собрали представление номера и даты.
	Если Не ЗначениеЗаполнено(ДанныеСвидетельства.ДатаВыдачи)
		И Не ЗначениеЗаполнено(СертификатСводныйНомер) Тогда
		СертификатНомерДата = НСтр("ru = '<номер и дата не заполнены>'");
	ИначеЕсли Не ЗначениеЗаполнено(ДанныеСвидетельства.ДатаВыдачи) Тогда
		СертификатНомерДата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '№%1 <дата не заполнена>'"),
			СертификатСводныйНомер);
	ИначеЕсли Не ЗначениеЗаполнено(СертификатСводныйНомер) Тогда
		СертификатНомерДата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '<номер не заполнен> от %1'"),
			Формат(ДанныеСвидетельства.ДатаВыдачи,"ДЛФ=D"));
	Иначе
		СертификатНомерДата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '№%1 от %2'"),
			СертификатСводныйНомер,
			Формат(ДанныеСвидетельства.ДатаВыдачи,"ДЛФ=D"));
	КонецЕсли;
		
	// Собрали окончательную строку.
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1 %2'"),
			ДанныеСвидетельства.ВидДокумента,
			СертификатНомерДата);

КонецФункции

&НаКлиенте
Процедура ПодобратьСотрудниковИзПланаЗавершение(Сотрудники)

	Если Сотрудники = Неопределено Или ТипЗнч(Сотрудники) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Строка Из Сотрудники Цикл
		Для каждого СтрокаСоответствие Из Строка Цикл
			Объект.Сотрудники.Добавить()["Сотрудник"] = СтрокаСоответствие.Ключ;
		КонецЦикла;
	КонецЦикла;

	РассчитатьСуммуРасходов(Сотрудники);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуРасходов(МассивСотрудников = Неопределено) 
	
	Если МассивСотрудников <> Неопределено Тогда
		Для каждого ЭлементМассива Из МассивСотрудников Цикл
			Для каждого Соответствие Из ЭлементМассива Цикл
				СуммаОбученияНаОдного = ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(
				Объект.СтоимостьМероприятия,Объект.СпособОпределенияСтоимости,1);
				Если Соответствие.Значение > СуммаОбученияНаОдного Тогда
					НоваяСтрока = Объект.Расходы.Добавить();
					НоваяСтрока.Сумма = Соответствие.Значение - СуммаОбученияНаОдного;
					НоваяСтрока.Примечание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Прочие расходы по %1'"),
					Строка(Соответствие.Ключ));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Объект.СуммаРасходов = ОбучениеРазвитиеКлиентСервер.СуммаРасходовНаОбучение(
		ОбучениеРазвитиеКлиентСервер.СтоимостьМероприятия(
			Объект.СтоимостьМероприятия, Объект.СпособОпределенияСтоимости, Объект.Сотрудники.Количество()), 
		Объект.Расходы);
	УстановитьРасшифровкуСуммыРасходов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРасшифровкуСуммыРасходов(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;

	СуммаКратнаСотрудникам = 
		Объект.СпособОпределенияСтоимости = ПредопределенноеЗначение("Перечисление.СпособыРасчетаСуммыРасходовНаПерсонал.СуммаКратнаКоличествуСотрудников");
	
	Элементы.КоличествоСотрудниковГруппа.Видимость = СуммаКратнаСотрудникам;
	Элементы.ПрочиеРасходыИтогГруппа.Видимость = Объект.Расходы.Итог("Сумма") > 0;
	Элементы.РасшифровкаСуммыРасходовГруппа.Видимость = СуммаКратнаСотрудникам Или Объект.Расходы.Итог("Сумма") > 0;

КонецПроцедуры

&НаКлиенте
Функция СписокСобытийДляДокументовОтсутствий()

	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить("ЗаписанДокументОтпуск");
	МассивСобытий.Добавить("ЗаписанДокументОтпускаСотрудников");
	МассивСобытий.Добавить("Запись_Командировка");
	МассивСобытий.Добавить("ЗаписьДокументаКомандировкиСотрудников");
	МассивСобытий.Добавить("Запись_ОплатаПоСреднемуЗаработку");
	МассивСобытий.Добавить("Запись_ОплатаПоСреднемуЗаработкуСписком");
	МассивСобытий.Добавить("Закрытие_ОтпускаСотрудников");
	МассивСобытий.Добавить("Закрытие_Отпуск");
	МассивСобытий.Добавить("Закрытие_Командировка");
	МассивСобытий.Добавить("Закрытие_КомандировкиСотрудников");
	МассивСобытий.Добавить("Закрытие_ОплатаПоСреднемуЗаработку");
	МассивСобытий.Добавить("Закрытие_ОплатаПоСреднемуЗаработкуСписком");
	
	Возврат МассивСобытий;

КонецФункции

&НаСервере
Процедура СоздатьИЗаполнитьРеквизитыПрогрессаОбучения()
	
	ПараметрыПрогрессаОбучения = ОбучениеРазвитиеФормы.ПараметрыПрогрессаОбучения();
	ПараметрыПрогрессаОбучения.Группа = "СотрудникиПрогрессОбученияГруппа";
	ПараметрыПрогрессаОбучения.ЧислоКолонок = Объект.ПродолжительностьПрогрессаОбучения;
	ПараметрыПрогрессаОбучения.РасположениеРеквизитов = "Объект.Сотрудники";
	ПараметрыПрогрессаОбучения.Источник = "Обучение";
	ПараметрыПрогрессаОбучения.Размерность = Объект.РазмерностьПродолжительностиПрогрессаОбучения;
	
	ОбучениеРазвитиеФормы.СоздатьРеквизитыПрогрессаОбучения(ЭтотОбъект, ПараметрыПрогрессаОбучения);
	
	УстановитьЗначенияПериодовПрогрессаОбучения();
	ЗаполнитьПроцентВыполненияПланаРазвития();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПериодовПрогрессаОбучения()
	
	ПрогрессОбучения = РегистрыСведений.ПрогрессОбученияСотрудников.ПрогрессОбучения(
		Объект.Сотрудники.Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо"),
		Объект.Ссылка);
	
	Для Каждого Сотрудник Из Объект.Сотрудники Цикл
		Отборы = Новый Структура;
		Отборы.Вставить("Сотрудник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник.Сотрудник, "ФизическоеЛицо"));
		ПрогрессОбученияПоСотруднику = ПрогрессОбучения.НайтиСтроки(Отборы);
		Если ПрогрессОбученияПоСотруднику.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Для Сч = 1 По ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, "Объект.ПродолжительностьПрогрессаОбучения") Цикл
			Отборы = Новый Структура;
			Отборы.Вставить("Сотрудник", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник.Сотрудник, "ФизическоеЛицо"));
			Отборы.Вставить("НомерПериода", Сч);
			Прогресс = ПрогрессОбучения.НайтиСтроки(Отборы);
			Если Прогресс.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			Сотрудник["Прогресс" + Строка(Сч)] = Прогресс[0].Прогресс;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроцентВыполненияПланаРазвития()
	
	ЧислоКолонок = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(ЭтотОбъект, "Объект.ПродолжительностьПрогрессаОбучения");
	Для Сч = 1 По ЧислоКолонок Цикл
		ОбщийПрогресс = Новый Массив;
		Для Каждого Сотрудник Из Объект.Сотрудники Цикл
			ОбщийПрогресс.Добавить(Сотрудник["Прогресс" + Строка(Сч)]);
		КонецЦикла;
		
		КоличествоМероприятий = 0;
		СуммаПрогресса = 0;
		ВыполнениеПланаРазвития = Истина;
		Для Каждого ЗначениеПрогресса Из ОбщийПрогресс Цикл
			Если ЗначениеПрогресса = ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка") Тогда
				ВыполнениеПланаРазвития = Ложь;
				Прервать;
			ИначеЕсли Не ЗначениеЗаполнено(ЗначениеПрогресса) Тогда
				Прогресс = 0;
			Иначе
				Прогресс = ЗначениеПрогресса.Прогресс;
			КонецЕсли;
			СуммаПрогресса = СуммаПрогресса + Прогресс;
			КоличествоМероприятий = КоличествоМероприятий + 1;
		КонецЦикла;
		Если ВыполнениеПланаРазвития И КоличествоМероприятий <> 0 Тогда
			ИтогПрогресса = СуммаПрогресса / КоличествоМероприятий;
			ЭтотОбъект["ИтогПрогресса" + Строка(Сч)] = Формат(ИтогПрогресса, "ЧДЦ=0;") + "%";
		Иначе
			ЭтотОбъект["ИтогПрогресса" + Строка(Сч)] = "";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрогрессПриИзменении(Элемент)
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.Сотрудники.ТекущиеДанные[Элемент.Имя] = ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка");
		ВызватьИсключение НСтр("ru = 'Внесение прогресса обучения возможно только после записи документа.'");
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные[Элемент.Имя]) Тогда
		ТаблицаЗначенийПрогресса = ТаблицаЗначенийПрогресса();
		Для Номер = 1 По Объект.ПродолжительностьПрогрессаОбучения Цикл
			ИмяПрогресса = "Прогресс" + Номер;
			ЗначениеПрогресса = ТекущиеДанные[ИмяПрогресса];
			Если ЗначениеПрогресса = ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка") Тогда
				Продолжить;
			КонецЕсли;
			Если Элемент.Имя = ИмяПрогресса  Тогда
				Если Номер = Объект.ПродолжительностьПрогрессаОбучения Тогда
					Прервать;
				КонецЕсли;
				ИмяПрогресса = "Прогресс" + (Номер + 1);
				ЗначениеПрогресса = ТекущиеДанные[ИмяПрогресса];
				Если ЗначениеПрогресса <> ПредопределенноеЗначение("Справочник.ЗначенияПрогрессаОбучения.ПустаяСсылка")
					И ТаблицаЗначенийПрогресса.Получить(ТекущиеДанные[Элемент.Имя])
						> ТаблицаЗначенийПрогресса.Получить(ЗначениеПрогресса) Тогда
					ТекущиеДанные[Элемент.Имя] = ЗначениеПрогресса;
				КонецЕсли;
				Прервать;
			КонецЕсли;
			ПоследнийПрогрессМероприятия = ЗначениеПрогресса;
		КонецЦикла;
		Если ЗначениеЗаполнено(ПоследнийПрогрессМероприятия)
			И ТаблицаЗначенийПрогресса.Получить(ТекущиеДанные[Элемент.Имя])
			< ТаблицаЗначенийПрогресса.Получить(ПоследнийПрогрессМероприятия) Тогда
			ТекущиеДанные[Элемент.Имя] = ПоследнийПрогрессМероприятия;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПроцентВыполненияПланаРазвития();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрогрессНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить();
	ЗначенияПрогрессаОбучения = ЗначенияПрогрессаОбученияНаСервере();
	Для Каждого Значение Из ЗначенияПрогрессаОбучения Цикл
		Элемент.СписокВыбора.Добавить(Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЗначенийПрогресса()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПрогрессаОбучения.Ссылка КАК Сслыка,
		|	ЗначенияПрогрессаОбучения.Прогресс КАК Прогресс
		|ИЗ
		|	Справочник.ЗначенияПрогрессаОбучения КАК ЗначенияПрогрессаОбучения";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ТаблицаЗначенийПрогресса = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ТаблицаЗначенийПрогресса.Вставить(Выборка.Сслыка, Выборка.Прогресс);
	КонецЦикла;
	
	Возврат ТаблицаЗначенийПрогресса;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначенияПрогрессаОбученияНаСервере()
	
	Возврат Справочники.ЗначенияПрогрессаОбучения.ЗначенияПрогрессаОбучения();
	
КонецФункции

#КонецОбласти 