#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЭтоАвторизованныйПользователь(Пользователь)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьТокен(Токен) Экспорт

	НаборЗаписей = РегистрыСведений.ДоступДляЗагрузкиКандидатовИзИнтернета.СоздатьНаборЗаписей();

	СтрокаНабора = НаборЗаписей.Добавить();
	СтрокаНабора.Пользователь = Пользователи.АвторизованныйПользователь();
	СтрокаНабора.ТокенДоступа = Токен;
	СтрокаНабора.ДатаТокена = ТекущаяДатаСеанса();

	НаборЗаписей.Отбор.Пользователь.Установить(СтрокаНабора.Пользователь);

	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция Токен() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Пользователь", Пользователи.АвторизованныйПользователь());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доступ.ТокенДоступа КАК ТокенДоступа,
		|	Доступ.ДатаТокена КАК ДатаТокена
		|ИЗ
		|	РегистрСведений.ДоступДляЗагрузкиКандидатовИзИнтернета КАК Доступ
		|ГДЕ
		|	Доступ.Пользователь = &Пользователь";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	
КонецФункции

Функция ПользовательПоТокену(Токен) Экспорт

	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Токен", Токен);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Доступ.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.ДоступДляЗагрузкиКандидатовИзИнтернета КАК Доступ
		|ГДЕ
		|	Доступ.ТокенДоступа = &Токен";

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Пользователь;
	
КонецФункции

#КонецОбласти

#КонецЕсли