////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетРасширенныйКлиент: методы кадрового учета, работающие на стороне клиента.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Открывает форму редактирования стажей сотрудника.
//
// Параметры:
//  ПараметрыФормы - Структура - См. функцию ПараметрыФормыРедактированияСтажей().
//  Обработчик - ОписаниеОповещения - Описание процедуры, вызываемой при окончании редактировании стажей с параметрами.
//     * РезультатРедактированияСтажей - Неопределено, КодВозвратаДиалога, Структура - 
//           Результат редактирования стажей.
//           При успешном окончании редактирования процедура будет вызвана с параметром типа "Структура" с полями:
//               ** Сотрудник - СправочникСсылка.Сотрудники
//               ** ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//               ** ДанныеСтажей - ДанныеФормыКоллекция
//           При отказе от редактирования процедура будет вызвана с параметром типа "Неопределено" или "КодВозвратаДиалога".
//           Пример чтения результатов процедуры см. в форме документа БольничныйЛист.
//     * ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта ОписаниеОповещения.
//
Процедура ОткрытьФормуРедактированияСтажей(ПараметрыФормы, Обработчик) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ВводСтажаСотрудников", ПараметрыФормы, , , , , Обработчик);
	
КонецПроцедуры

// Возвращает параметры, необходимые для процедуры ОткрытьФормуРедактированияСтажей.
//
// Возвращаемое значение:
//   Структура - Параметры, необходимые для вызова процедуры ОткрытьФормуРедактированияСтажей.
//       * ТолькоПросмотр - Булево - Признак возможности редактирования отображаемых данных.
//       * Сотрудник - СправочникСсылка.Сотрудники - Необязательный, если передан параметр "ФизическоеЛицо".
//       * ФизическоеЛицо - СправочникСсылка.ФизическиеЛица - Необязательный, если передан параметр "Сотрудник".
//       * ДатаСведений - Дата
//       * ВидыСтажа - Массив из СправочникСсылка.ВидыСтажа
//       * ДанныеСтажей - Соответствие - Данные стажей сотрудника.
//           * Ключ - СправочникСсылка.ВидыСтажа
//           * Значение - Структура - См. ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже().
//       * Записывать - Булево - Если Истина, данные о стаже будут записаны при закрытии формы.
//       * НеобязательныеВидыСтажа - ФиксированноеСоответствие - стажи, заполнение которых необязательно.
//           Для этих стажей будет выведен флажок, разрешающий редактирование данных стажа.
//           Эти виды стажа должны также быть перечислены в параметре ВидыСтажа.
//       * ЗаголовокФормы - Строка - Заголовок формы ввода стажей.
//
Функция ПараметрыФормыРедактированияСтажей() Экспорт
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", Ложь);
	ПараметрыОткрытия.Вставить("Сотрудник", Неопределено);
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", Неопределено);
	ПараметрыОткрытия.Вставить("ДатаСведений", Неопределено);
	ПараметрыОткрытия.Вставить("ВидыСтажа", Неопределено);
	ПараметрыОткрытия.Вставить("ДанныеСтажей", Неопределено);
	ПараметрыОткрытия.Вставить("Записывать", Истина);
	ПараметрыОткрытия.Вставить("НеобязательныеВидыСтажа", Неопределено);
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", Неопределено);
	Возврат ПараметрыОткрытия;
КонецФункции

// Открывает форму для объединения дублей из формы похожих физических лиц.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ОбъединитьДубли(Форма) Экспорт
	
	Форма.ВладелецФормы.Модифицированность = Ложь;
	Форма.ВладелецФормы.Закрыть();
	
	ПараметрыОткрытия = Новый Структура;
	
	Дубли = Новый СписокЗначений();
	Для Каждого ТекущаяСтрока Из Форма.Однофамильцы Цикл
		Дубли.Добавить(ТекущаяСтрока.ПохожийЧеловек);
	КонецЦикла;
	Если ЗначениеЗаполнено(Форма.Параметры.СсылкаНаОригинал) Тогда
		Дубли.Добавить(Форма.Параметры.СсылкаНаОригинал);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Дубли", Дубли);
	
	ОписаниеТипаВладельцаЛичныхДанных = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		ТипЗнч(Дубли.Получить(0).Значение)));
	ПараметрыОткрытия.Вставить("ОписаниеТипаВладельцаЛичныхДанных", ОписаниеТипаВладельцаЛичныхДанных);

	ПараметрыОткрытия.Вставить("НеПоказыватьТипВладельцаЛичныхДанных", Истина);
	
	ОткрытьФорму("Обработка.ОбъединениеДублейПерсональныхДанных.Форма", ПараметрыОткрытия, , , , , , );
	
КонецПроцедуры

// Определяет доступность объединения дублей персональных данных на клиенте.
// 
// Возвращаемое значение:
//  Булево
Функция ДоступноОбъединениеДублейПерсональныхДанных() Экспорт
	
	Возврат КадровыйУчетРасширенныйВызовСервера.ДоступноОбъединениеДублейПерсональныхДанных();

КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать КадровыйУчетРасширенныйКлиент.ОткрытьФормуРедактированияСтажей.
// Открывает форму редактирования стажей сотрудника.
//
// Параметры:
//		Форма			- ФормаКлиентскогоПриложения
//		Сотрудник		- СправочникСсылка.Сотрудники
//		ДатаСведений	- Дата
//		ВидыСтажа		- Массив ссылок на элементы справочника ВидыСтажа.
//		ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица, передается если известно.
//		ДанныеСтажей	- Соответствие - Данные стажей сотрудника.
//   						* Ключ - Вид стажа;
//   						* Значение - Структура, сформированная методом ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже().
//		Записывать 		- Булево - Если Истина, данные о стаже будут записаны при закрытии формы.
//		НеобязательныеВидыСтажа	- Фиксированное соответствие - стажи, заполнение которых необязательно. Для этих стажей будет
//                                                             выведен флажок, разрешающий редактирование данных стажа. Эти
//                                                             виды стажа должны также быть перечислены в параметре ВидыСтажа.
//   						* Ключ - Вид стажа;
//   						* Значение - Строка, заголовок флажка.
//
Процедура ОткрытьФормуРедактированияСтажейСотрудника(Форма, Сотрудник, ДатаСведений, ВидыСтажа, ФизическоеЛицо = Неопределено, ДанныеСтажей = Неопределено, Записывать = Истина, НеобязательныеВидыСтажа = Неопределено) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", Форма.ТолькоПросмотр);
	ПараметрыОткрытия.Вставить("Сотрудник", Сотрудник);
	ПараметрыОткрытия.Вставить("ДатаСведений", ДатаСведений);
	ПараметрыОткрытия.Вставить("ВидыСтажа", ВидыСтажа);
	ПараметрыОткрытия.Вставить("ДанныеСтажей", ДанныеСтажей);
	ПараметрыОткрытия.Вставить("Записывать", Записывать);
	ПараметрыОткрытия.Вставить("НеобязательныеВидыСтажа", НеобязательныеВидыСтажа);
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		ПараметрыОткрытия.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ВводСтажаСотрудников", ПараметрыОткрытия, Форма);
	
КонецПроцедуры

// Устарела см. процедуру КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка.
//
Процедура ВыбратьСотрудниковРаботающихНаДату(ВладелецФормыВыбора, Организация = Неопределено, Подразделение = Неопределено, ДатаПримененияОтбора = '00010101', МножественныйВыбор = Истина, АдресСпискаПодобранныхСотрудников = "", СтруктураОтбора = Неопределено) Экспорт
	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(ВладелецФормыВыбора, Организация, Подразделение, ДатаПримененияОтбора, МножественныйВыбор, АдресСпискаПодобранныхСотрудников, ПараметрыОткрытия);
	
КонецПроцедуры

// Устарела см. процедуру КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихВПериодеПоПараметрамОткрытияФормыСписка.
//
Процедура ВыбратьСотрудниковРаботающихВПериоде(ВладелецФормыВыбора, Организация = Неопределено, Подразделение = Неопределено, НачалоПериодаПримененияОтбора = '00010101', ОкончаниеПериодаПримененияОтбора = '00010101', МножественныйВыбор = Истина, АдресСпискаПодобранныхСотрудников = "", СтруктураОтбора = Неопределено) Экспорт
	
	Если СтруктураОтбора = Неопределено Тогда
		СтруктураОтбора = Новый Структура;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбора);
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихВПериодеПоПараметрамОткрытияФормыСписка(ВладелецФормыВыбора, Организация, Подразделение, НачалоПериодаПримененияОтбора, ОкончаниеПериодаПримененияОтбора, МножественныйВыбор, АдресСпискаПодобранныхСотрудников, ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПередЗаписьюКадровогоДокументаВФорме(Форма, Объект, ПараметрыЗаписи, ОповещениеЗавершения = Неопределено, ЗакрытьПослеЗаписи = Истина) Экспорт 
	
	Перем РезультатыПроверки;
	
	ОчиститьСообщения();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
	ДополнительныеПараметры.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", ЗакрытьПослеЗаписи);
	
	ИспользуетсяШтатноеРасписание = Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьШтатноеРасписание");
	Если ИспользуетсяШтатноеРасписание
		И Форма.ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДанныеОЗанятыхПозициях = Форма.ПолучитьДанныеОЗанятыхПозициях();
		Если НЕ Форма.ПроверкаПередЗаписьюНаСервере(РезультатыПроверки, ДанныеОЗанятыхПозициях) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДанныеОЗанятыхПозициях", ДанныеОЗанятыхПозициях);
			ПараметрыФормы.Вставить("ПроверкаПередЗаписью", Истина);
			ПараметрыФормы.Вставить("ПроверяемыйРегистратор", Объект.Ссылка);
			ПараметрыФормы.Вставить("РезультатыПроверки", РезультатыПроверки);
			
			Оповещение = Новый ОписаниеОповещения("ПередЗаписьюКадровогоДокументаВФормеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.ПроверкаСоответствияШтатномуРасписанию", ПараметрыФормы, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			
			СтруктураПроверки = Новый Структура("ВыбранноеДействие", Истина);
			ПередЗаписьюКадровогоДокументаВФормеЗавершение(СтруктураПроверки, ДополнительныеПараметры);
			
		КонецЕсли;
		
	ИначеЕсли Не ИспользуетсяШтатноеРасписание 
		И ОбщегоНазначенияКлиент.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.Грейды") Тогда
		
		ДанныеОЗанятыхПозициях = Форма.ПолучитьДанныеОЗанятыхПозициях();
		Если НЕ Форма.ПроверкаПередЗаписьюНаСервере(РезультатыПроверки, ДанныеОЗанятыхПозициях) Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДанныеОЗанятыхПозициях", ДанныеОЗанятыхПозициях);
			ПараметрыФормы.Вставить("ПроверкаПередЗаписью", Истина);
			ПараметрыФормы.Вставить("ПроверяемыйРегистратор", Объект.Ссылка);
			ПараметрыФормы.Вставить("РезультатыПроверки", РезультатыПроверки);
			ПараметрыФормы.Вставить("ПроверкаСоответствияГрейдам", Истина);
			
			Оповещение = Новый ОписаниеОповещения("ПередЗаписьюКадровогоДокументаВФормеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОткрытьФорму("ОбщаяФорма.ПроверкаСоответствияШтатномуРасписанию", ПараметрыФормы, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе 
			
			СтруктураПроверки = Новый Структура("ВыбранноеДействие", Истина);
			ПередЗаписьюКадровогоДокументаВФормеЗавершение(СтруктураПроверки, ДополнительныеПараметры);
			
		КонецЕсли;
		
	Иначе 
		
		СтруктураПроверки = Новый Структура("ВыбранноеДействие", Истина);
		ПередЗаписьюКадровогоДокументаВФормеЗавершение(СтруктураПроверки, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюКадровогоДокументаВФормеЗавершение(СтруктураПроверки, ДополнительныеПараметры) Экспорт 

	Если СтруктураПроверки = Неопределено Или СтруктураПроверки.ВыбранноеДействие = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;
	ПараметрыЗаписи.Вставить("ПроверкаПередЗаписьюВыполнена", Истина);
	ПараметрыЗаписи.Вставить("ЗакрытьПослеЗаписи", ДополнительныеПараметры.ЗакрытьПослеЗаписи);
	
	Если Форма.Записать(ПараметрыЗаписи) Тогда
		Если ДополнительныеПараметры.ОповещениеЗавершения <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеЗавершения, ПараметрыЗаписи);
		ИначеЕсли ДополнительныеПараметры.ЗакрытьПослеЗаписи Тогда 
			Форма.Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписьВФормеДокументаУвольнение(Форма, ПараметрыЗаписи, ЗакрытьПослеЗаписи) Экспорт
	
	ПараметрыЗаписи.Вставить("ПроверкаПередЗаписьюВыполнена", Истина);
	Если Форма.Записать(ПараметрыЗаписи) И ЗакрытьПослеЗаписи И Не Форма.ЖдатьЗакрытияФормыУведомления Тогда 
		Форма.Закрыть();
	ИначеЕсли ЗакрытьПослеЗаписи Тогда
		Форма.ЖдатьЗакрытияФормыУведомления = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаСоответствиеШтатномуРасписанию(Форма, Объект, ИсправленныйДокумент = Неопределено) Экспорт 
	
	ДанныеОЗанятыхПозициях = Форма.ПолучитьДанныеОЗанятыхПозициях();
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДанныеОЗанятыхПозициях", ДанныеОЗанятыхПозициях);
	ПараметрыФормы.Вставить("ПроверкаПередЗаписью", Ложь);
	ПараметрыФормы.Вставить("ПроверяемыйРегистратор", Объект.Ссылка);
	
	Если ИсправленныйДокумент <> Неопределено Тогда
		ПараметрыФормы.Вставить("ИсправленныйДокумент", ИсправленныйДокумент);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьНаСоответствиеШтатномуРасписаниюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ПроверкаСоответствияШтатномуРасписанию", ПараметрыФормы, Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПроверитьНаСоответствиеШтатномуРасписаниюЗавершение(СтруктураПроверки, ДополнительныеПараметры) Экспорт 
	
	Форма = ДополнительныеПараметры.Форма;
	
	Если СтруктураПроверки <> Неопределено И СтруктураПроверки.ВыбранноеДействие = "ОК" Тогда
		УправлениеШтатнымРасписаниемКлиент.ОбработатьРезультатыПроверки(Форма, СтруктураПроверки.АдресРезультатаПроверки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПараметрыОтбораПоФункциональнойОпцииВыполнятьРасчетЗарплатыПоПодразделениям(Форма, ПараметрыОткрытия) Экспорт
	
	Если Форма.ПолучитьФункциональнуюОпциюФормы("ВыполнятьРасчетЗарплатыПоПодразделениям") Тогда
		
		Если ПараметрыОткрытия = Неопределено Тогда
			ПараметрыОткрытия = Новый Структура;
		КонецЕсли; 
		
		ПараметрыОткрытия.Вставить("УчитыватьОтборПоПодразделению", Истина);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	Если Не ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыРаботыКлиента.ПоказатьОписаниеИзмененийСистемы И ПараметрыРаботыКлиента.ВосстановитьПрисоединенныеФайлы Тогда
		ОткрытьФорму("Обработка.ИсправлениеПроблемыСПрисоединеннымиФайлами.Форма.Форма");
	КонецЕсли;
	
	// Установка состава форм рабочего стола по умолчанию
	Если ПараметрыРаботыКлиента.ТребуетсяУстановитьРабочийСтолПользователя Тогда
		ТребуетсяОбновлениеИнтерфейса = КадровыйУчетРасширенныйВызовСервера.УстановленРабочийСтолПользователя();
		Если ТребуетсяОбновлениеИнтерфейса Тогда
			ОбновитьИнтерфейс();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОтсутствияПоДругимМестамРаботы

Процедура ОформитьОтсутствиеПоСовместителю(Форма, ИмяКоманды) Экспорт
	ВсегоСотрудников = Форма.ДругиеСотрудникиФизическогоЛица.Количество();
	Объект = Форма.Объект;
	
	Если ВсегоСотрудников = 1 Тогда
		Для Каждого Данные Из Форма.ДругиеСотрудникиФизическогоЛица Цикл
			ОткрытьФормуНовогоОтсутствияСовместителя(Данные.Ключ, Данные.Значение.Организация, ИмяКоманды, Форма);
		КонецЦикла;
	ИначеЕсли ВсегоСотрудников > 1 Тогда
		ДополнительныеПараметры = Новый Структура("ИмяКоманды,Форма", ИмяКоманды, Форма);
		Оповещение = Новый ОписаниеОповещения("ВыборСотрудниковФизическогоЛицаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		Отборы = Новый Структура("ФизическоеЛицо", Объект.ФизическоеЛицо);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
		ПараметрыФормы.Вставить("АдресСпискаПодобранныхСотрудников",
			КадровыйУчетРасширенныйВызовСервера.АдресСпискаПодобранныхСотрудников(Объект.Сотрудник, Форма.УникальныйИдентификатор));
		ПараметрыФормы.Вставить("Отбор", Отборы);
		
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Форма, , , , Оповещение);
	КонецЕсли;
КонецПроцедуры

Процедура ВыборСотрудниковФизическогоЛицаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Сотрудник Из Результат Цикл
		КадровыеДанные = ДополнительныеПараметры.Форма.ДругиеСотрудникиФизическогоЛица.Получить(Сотрудник);
		Если КадровыеДанные <> Неопределено Тогда
			ОткрытьФормуНовогоОтсутствияСовместителя(Сотрудник, КадровыеДанные.Организация, ДополнительныеПараметры.ИмяКоманды, ДополнительныеПараметры.Форма);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОткрытьФормуНовогоОтсутствияСовместителя(Совместитель, ОрганизацияСовместителя, ИмяКоманды, Форма)
	ИмяДокумента = "";
	Объект = Форма.Объект;
	ОснованиеОтпуск = Ложь;
	ОснованиеКомандировка = Ложь;
	ОснованиеОтпускаБезОплаты = Ложь;
	ОснованиеОплатаДнейУходаЗаДетьмиИнвалидами = Ложь;
	
	Если СтрНайти(Форма.ИмяФормы, "Командировка") > 0 Тогда
		ОснованиеКомандировка = Истина;
		НачалоПериода = ?(Объект.ВнутрисменнаяКомандировка, Объект.ДатаКомандировки, Объект.ДатаНачала);
		ОкончаниеПериода = ?(Объект.ВнутрисменнаяКомандировка, Объект.ДатаКомандировки, Объект.ДатаОкончания);
	ИначеЕсли СтрНайти(Форма.ИмяФормы, "ОплатаДнейУходаЗаДетьмиИнвалидами") > 0 Тогда
		ОснованиеОплатаДнейУходаЗаДетьмиИнвалидами = Истина;
		НачалоПериода = Объект.ДатаНачала;
		ОкончаниеПериода = Объект.ДатаОкончания;
	ИначеЕсли СтрНайти(Форма.ИмяФормы, "ОтпускБезСохраненияОплаты") > 0 Тогда
		ОснованиеОтпускаБезОплаты = Истина;
		НачалоПериода = ?(Объект.ОтсутствиеВТечениеЧастиСмены, Объект.ДатаОтсутствия, Объект.ДатаНачала);
		ОкончаниеПериода = ?(Объект.ОтсутствиеВТечениеЧастиСмены, Объект.ДатаОтсутствия, Объект.ДатаОкончания);
	ИначеЕсли СтрНайти(Форма.ИмяФормы, "Отпуск") > 0 Тогда
		ОснованиеОтпуск = Истина;
		ИменаРеквизитов = "ПредоставитьОсновнойОтпуск,ДатаНачалаОсновногоОтпуска,ДатаОкончанияОсновногоОтпуска,ПредоставитьОтгул,
			|Сотрудник,НачалоПериода,КоличествоДнейОтгула";
		Данные = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(Данные, Объект);
		ИменаРеквизитовТЧ = "ДатаНачала,ДатаОкончания";
		Данные.Вставить("ДополнительныеОтпуска", ОбщегоНазначенияБЗККлиентСервер.КоллекцияВМассив(Объект.ДополнительныеОтпуска, ИменаРеквизитовТЧ));
		ПериодОтсутствия = КадровыйУчетРасширенныйВызовСервера.ПериодОтсутствия(Объект);
		НачалоПериода = ПериодОтсутствия.НачалоПериода;
		ОкончаниеПериода = ПериодОтсутствия.ОкончаниеПериода;
	Иначе
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", ОрганизацияСовместителя);
	ДанныеЗаполнения.Вставить("Сотрудник", Совместитель);
	ДанныеЗаполнения.Вставить("ФизическоеЛицо", Объект.ФизическоеЛицо);
	ДанныеЗаполнения.Вставить("ДатаНачала", НачалоПериода);
	ДанныеЗаполнения.Вставить("ДатаОкончания", ОкончаниеПериода);
	
	Если ИмяКоманды = "ОформитьКомандировкуСовместителю" Тогда
		ИмяДокумента = "Командировка";
		ДанныеЗаполнения.Вставить("ЗаполнитьПоПараметрамЗаполнения", Истина);
		Если ОснованиеКомандировка Тогда
			ДанныеЗаполнения.Вставить("ОтсутствиеВТечениеЧастиСмены", Объект.ВнутрисменнаяКомандировка);
			ДанныеЗаполнения.Вставить("ДатаОтсутствия", Объект.ДатаКомандировки);
			ДанныеЗаполнения.Вставить("ЧасовОтпуска", Объект.ОплачиватьЧасов);
			ДанныеЗаполнения.Вставить("МестоНазначения", Объект.МестоНазначения);
			ДанныеЗаполнения.Вставить("ОрганизацияНазначения", Объект.ОрганизацияНазначения);
			ДанныеЗаполнения.Вставить("КомандировкаЗаСчетСредств", Объект.КомандировкаЗаСчетСредств);
			ДанныеЗаполнения.Вставить("ДнейВПути", Объект.ДнейВПути);
			ДанныеЗаполнения.Вставить("Цель", Объект.Цель);
		ИначеЕсли ОснованиеОтпускаБезОплаты Тогда
			ДанныеЗаполнения.Вставить("ОтсутствиеВТечениеЧастиСмены", Объект.ОтсутствиеВТечениеЧастиСмены);
			ДанныеЗаполнения.Вставить("ДатаОтсутствия", Объект.ДатаОтсутствия);
			ДанныеЗаполнения.Вставить("ЧасовОтпуска", Объект.ЧасовОтпуска);
		КонецЕсли;
	ИначеЕсли ИмяКоманды = "ОформитьОплатаДнейУходаЗаДетьмиИнвалидамиСовместителю" Тогда
		ИмяДокумента = "ОплатаДнейУходаЗаДетьмиИнвалидами";
		ДанныеЗаполнения.Вставить("Действие", "ЗаполнитьПоПараметрамЗаполнения");
		ДанныеЗаполнения.Вставить("ДатаНачалаСобытия", НачалоПериода);
		Если ОснованиеОплатаДнейУходаЗаДетьмиИнвалидами Тогда
			ДниУхода = ОбщегоНазначенияБЗККлиентСервер.КоллекцияВМассив(Объект.ДниУхода, "Дата");
			ДанныеЗаполнения.Вставить("Ребенок", Объект.Ребенок);
		Иначе
			ДниУхода = Новый Массив;
			Если ОбщегоНазначенияБЗККлиентСервер.ПериодСоответствуетТребованиям(НачалоПериода, ОкончаниеПериода) Тогда
				ТекущийДень = НачалоДня(НачалоПериода);
				Пока ТекущийДень <= ОкончаниеПериода Цикл
					ДниУхода.Добавить(Новый Структура("Дата", ТекущийДень));
					ТекущийДень = ТекущийДень + 86400;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ДниУхода", ДниУхода);
	ИначеЕсли ИмяКоманды = "ОформитьОтпускСовместителю" Тогда
		ИмяДокумента = "Отпуск";
		ДанныеОтпусков = Новый Массив();
		Если ОснованиеОтпуск Тогда
			Если Объект.ПредоставитьОсновнойОтпуск Тогда
				НоваяСтрокаОтпуска = ДанныеЗаполненияСтроки();
				НоваяСтрокаОтпуска.ВидОтпуска = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
				НоваяСтрокаОтпуска.ДатаНачала = Объект.ДатаНачалаОсновногоОтпуска;
				НоваяСтрокаОтпуска.ДатаОкончания = Объект.ДатаОкончанияОсновногоОтпуска;
				НоваяСтрокаОтпуска.КоличествоДней = Объект.КоличествоДнейОсновногоОтпуска;
				НоваяСтрокаОтпуска.КоличествоДнейКомпенсации = Объект.КоличествоДнейКомпенсацииОсновногоОтпуска;
				ДанныеОтпусков.Добавить(НоваяСтрокаОтпуска);
			КонецЕсли;
			Если Объект.ПредоставитьДополнительныйОтпуск Тогда
				Для каждого Строка Из Объект.ДополнительныеОтпуска Цикл
					НоваяСтрокаОтпуска = ДанныеЗаполненияСтроки();
					НоваяСтрокаОтпуска.ВидОтпуска = Строка.ВидОтпуска;
					НоваяСтрокаОтпуска.ДатаНачала = Строка.ДатаНачала;
					НоваяСтрокаОтпуска.ДатаОкончания = Строка.ДатаОкончания;
					НоваяСтрокаОтпуска.КоличествоДней = Строка.КоличествоДней;
					НоваяСтрокаОтпуска.КоличествоДнейКомпенсации = Строка.КоличествоДнейКомпенсации;
					ДанныеОтпусков.Добавить(НоваяСтрокаОтпуска);
				КонецЦикла;
			КонецЕсли;
		Иначе
			НоваяСтрокаОтпуска = ДанныеЗаполненияСтроки();
			НоваяСтрокаОтпуска.ВидОтпуска = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
			НоваяСтрокаОтпуска.ДатаНачала = НачалоПериода;
			НоваяСтрокаОтпуска.ДатаОкончания = Объект.ДатаОкончания;
			КоличествоДнейОтпуска = КадровыйУчетРасширенныйВызовСервера.КоличествоДнейПоВидуОтпуска(Совместитель,
				ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"), НачалоПериода, Объект.ДатаОкончания);
			НоваяСтрокаОтпуска.КоличествоДней = КоличествоДнейОтпуска;
		КонецЕсли;
		ДанныеОтпусков.Добавить(НоваяСтрокаОтпуска);
		ДанныеЗаполнения.Вставить("Ссылка", Неопределено);
		ДанныеЗаполнения.Вставить("ДанныеОтпусков", ДанныеОтпусков);
		ДанныеЗаполнения.Вставить("Действие", "Заполнить");
	ИначеЕсли ИмяКоманды = "ОформитьОтпускБезОплатыСовместителю" Тогда
		ИмяДокумента = "ОтпускБезСохраненияОплаты";
		ДанныеЗаполнения.Вставить("Действие", "Заполнить");
		Если ОснованиеКомандировка Тогда
			ДанныеЗаполнения.Вставить("ОтсутствиеВТечениеЧастиСмены", Объект.ВнутрисменнаяКомандировка);
			ДанныеЗаполнения.Вставить("ДатаОтсутствия", Объект.ДатаКомандировки);
			ДанныеЗаполнения.Вставить("ЧасовОтпуска", Объект.ОплачиватьЧасов);
		КонецЕсли;
		Если ОснованиеОтпускаБезОплаты Тогда
			ДанныеЗаполнения.Вставить("ОтсутствиеВТечениеЧастиСмены", Объект.ОтсутствиеВТечениеЧастиСмены);
			ДанныеЗаполнения.Вставить("ДатаОтсутствия", Объект.ДатаОтсутствия);
			ДанныеЗаполнения.Вставить("ЧасовОтпуска", Объект.ЧасовОтпуска);
			ДанныеЗаполнения.Вставить("ВидОтпуска", Объект.ВидОтпуска);
			ДанныеЗаполнения.Вставить("Основание", Объект.Основание);
		КонецЕсли;
	Иначе
		// Команда не определена
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Основание", ДанныеЗаполнения);
	ОткрытьФорму("Документ." + ИмяДокумента + ".ФормаОбъекта", ПараметрыФормы, Форма, Истина);
КонецПроцедуры

Функция ДанныеЗаполненияСтроки()
	СтруктураОтпуска = Новый Структура;
	СтруктураОтпуска.Вставить("ВидОтпуска");
	СтруктураОтпуска.Вставить("ДатаНачала");
	СтруктураОтпуска.Вставить("ДатаОкончания");
	СтруктураОтпуска.Вставить("КоличествоДней");
	СтруктураОтпуска.Вставить("КоличествоДнейКомпенсации", 0);
	СтруктураОтпуска.Вставить("НачалоПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	СтруктураОтпуска.Вставить("КонецПериодаЗаКоторыйПредоставляетсяОтпуск", '00010101');
	СтруктураОтпуска.Вставить("Основание", "");
	СтруктураОтпуска.Вставить("ВидОтпускаПрежний", Неопределено);
	СтруктураОтпуска.Вставить("ИндексСтрокиДокумента", Неопределено);
	
	Возврат СтруктураОтпуска;
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать КадровыйУчетРасширенныйКлиент.ОткрытьФормуРедактированияСтажей.
// Открывает форму редактирования стажей физического лица.
//
// Параметры:
//		Форма			- ФормаКлиентскогоПриложения
//		ФизическоеЛицо		- СправочникСсылка.ФизическиеЛица
//		ДатаСведений	- Дата
//		ВидыСтажа		- Массив ссылок на элементы справочника ВидыСтажа.
//		ДанныеСтажей	- Соответствие - Данные стажей сотрудника.
//   						* Ключ - Вид стажа;
//   						* Значение - Структура, сформированная методом ЗарплатаКадрыРасширенныйКлиентСервер.СведенияОСтаже().
//		ЗаголовокФормы	- Строка, произвольный заголовок формы ввода стажей.
//
Процедура ОткрытьФормуРедактированияСтажейФизическогоЛица(Форма, ФизическоеЛицо, ДатаСведений, ВидыСтажа, ДанныеСтажей, ЗаголовокФормы = "") Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ПараметрыОткрытия.Вставить("ДатаСведений", ДатаСведений);
	ПараметрыОткрытия.Вставить("ВидыСтажа", ВидыСтажа);
	ПараметрыОткрытия.Вставить("ДанныеСтажей", ДанныеСтажей);
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", ЗаголовокФормы);
	
	ОткрытьФорму("ОбщаяФорма.ВводСтажаСотрудников", ПараметрыОткрытия, Форма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
