#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийБСП

// См. ИнтеграцияПодсистемБТСКлиент.ПриОпределенииПодписокНаСобытияБСП
Процедура ПриОпределенииПодписокНаСобытияБСП(Подписки) Экспорт
	
	// БазоваяФункциональность
	Подписки.ПередНачаломРаботыСистемы = Истина;
	Подписки.ПриНачалеРаботыСистемы = Истина;
	
	// ЗавершениеРаботыПользователей
	Подписки.ПриЗавершенииСеансов = Истина;
	
	// ПрофилиБезопасности
	Подписки.ПриПодтвержденииЗапросовНаИспользованиеВнешнихРесурсов = Истина;
	
КонецПроцедуры

#Область БазоваяФункциональность

// См. ИнтеграцияПодсистемБТСКлиент.ПередНачаломРаботыСистемы
Процедура ПередНачаломРаботыСистемы(Параметры) Экспорт
	
	Параметры.Модули.Вставить(0, ВыгрузкаЗагрузкаДанныхКлиент);
	
КонецПроцедуры

// См. ИнтеграцияПодсистемБТСКлиент.ПриНачалеРаботыСистемы
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	
	Параметры.Модули.Добавить(МиграцияПриложенийКлиент);
	
КонецПроцедуры

#КонецОбласти

#Область ЗавершениеРаботыПользователей

// См. ИнтеграцияПодсистемБТСКлиент.ПриЗавершенииСеансов
Процедура ПриЗавершенииСеансов(ФормаВладелец, Знач НомераСеансов, СтандартнаяОбработка, Знач ОповещениеПослеЗавершенияСеанса = Неопределено) Экспорт
	
	УдаленноеАдминистрированиеБТСКлиент.ПриЗавершенииСеансов(ФормаВладелец, НомераСеансов, СтандартнаяОбработка, ОповещениеПослеЗавершенияСеанса);
	
КонецПроцедуры

#КонецОбласти

#Область ПрофилиБезопасности

// См. ИнтеграцияПодсистемБТСКлиент.ПриПодтвержденииЗапросовНаИспользованиеВнешнихРесурсов
Процедура ПриПодтвержденииЗапросовНаИспользованиеВнешнихРесурсов(Знач ИдентификаторыЗапросов, ФормаВладелец, ОповещениеОЗакрытии, СтандартнаяОбработка) Экспорт

	НастройкаРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервисаКлиент.ПриПодтвержденииЗапросовНаИспользованиеВнешнихРесурсов(
		ИдентификаторыЗапросов, ФормаВладелец, ОповещениеОЗакрытии, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти