////////////////////////////////////////////////////////////////////////////////
//	Общие серверные процедуры для синхронизации с MS Exchange
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт

	Если ОбщегоНазначения.РазделениеВключено()
		И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	НовыеРазрешения = Новый Массив;
	МодульРаботаВБезопасномРежиме = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СерверыMSExchange.Порт,
	|	СерверыMSExchange.Сервер,
	|	СерверыMSExchange.ИспользоватьЗащищенноеСоединение
	|ИЗ
	|	Справочник.СерверыMSExchange КАК СерверыMSExchange
	|ГДЕ
	|	НЕ СерверыMSExchange.ПометкаУдаления";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Разрешение = МодульРаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
			?(Выборка.ИспользоватьЗащищенноеСоединение, "HTTPS","HTTP"),
			Выборка.Сервер,
			Выборка.Порт,
			НСтр("ru = 'Сервер MS Exchange для синхронизации'"));
		НовыеРазрешения.Добавить(Разрешение);
	
		ЗапросыРазрешений.Добавить(МодульРаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	КонецЦикла;
	
КонецПроцедуры

// Возвращает таблицу занятости из MS Exchange.
//
// Параметры:
//  МассивПользователей - Массив из элементов с типом СправочникСсылка.Пользователи.
//  ДатаНачала 			- Дата - Дата начала интервала.
//  ДатаОкончания 		- Дата - Дата окончания интервала.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - см. РаботаСРабочимКалендарем.СформироватьТаблицуЗанятости.
//
Функция ТаблицаЗанятости(МассивПользователей, ДатаНачала, ДатаОкончания) Экспорт
	
	ТаблицаЗанятости = РаботаСРабочимКалендарем.СформироватьТаблицуЗанятости();
	
	ДоступностьПользователей =
		ДоступностьПользователей(МассивПользователей, ДатаНачала, ДатаОкончания);
		
	ТипСинхронизации = ПредопределенноеЗначение("Перечисление.ТипыСинхронизацииКалендарей.MSExchange");
	
	Для Каждого Пользователь Из МассивПользователей Цикл
		ДанныеДоступностиПользователя = ДоступностьПользователей[Пользователь];
		Если ДанныеДоступностиПользователя = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Разные варианты анализа занятости
		Если ДанныеДоступностиПользователя.ДоступностьПодробно.Количество() <> 0 Тогда
			События = ДанныеДоступностиПользователя.ДоступностьПодробно;
			
			Узел = ПланыОбмена.СинхронизацияКалендарей.УзелПользователя(Пользователь, ТипСинхронизации);
			
			ПохожиеЗаписи = СинхронизацияКалендарей.ПохожиеСвязанныеЗаписиКалендаря(События, Узел, Пользователь, Истина);
		
			Для Каждого ЭлементДоступности Из ДанныеДоступностиПользователя.ДоступностьПодробно Цикл
				Отбор = Новый Структура("ДатаНачала, ДатаОкончания");
				
				ЗаполнитьЗначенияСвойств(Отбор, ЭлементДоступности);
				
				НайденныеСтроки = ПохожиеЗаписи.НайтиСтроки(Отбор);
				
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ТаблицаЗанятости.Добавить();
					НоваяСтрока.Пользователь = Пользователь;
					НоваяСтрока.ДатаНачала = ЭлементДоступности.ДатаНачала;
					НоваяСтрока.ДатаОкончания = ЭлементДоступности.ДатаОкончания;
					
					ТекущаяЗанятость = СостояниеПоОписанию(ЭлементДоступности.Описание);
					
					НоваяСтрока.Занят = ТекущаяЗанятость;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ЗначениеЗаполнено(ДанныеДоступностиПользователя.ДоступностьСтрокой) Тогда
			ДоступностьПользователя = ДанныеДоступностиПользователя.ДоступностьСтрокой;
			
			ТекущаяСтрокаДоступности = Неопределено;
			ТекущаяДатаЗанятости = НачалоЧаса(ДатаНачала);
			ШагДаты = 30 * 60;
			Для ИндексСимвола = 1 По СтрДлина(ДоступностьПользователя) Цикл
				
				ТекущийСимвол = Символ(КодСимвола(ДоступностьПользователя, ИндексСимвола));
				
				ТекущаяЗанятость = СостояниеПоОписанию(ТекущийСимвол, Истина);
				
				Если ТекущаяСтрокаДоступности = Неопределено Или ТекущаяСтрокаДоступности.Занят <> ТекущаяЗанятость Тогда
					ТекущаяСтрокаДоступности = ТаблицаЗанятости.Добавить();
					ТекущаяСтрокаДоступности.Пользователь = Пользователь;
					ТекущаяСтрокаДоступности.ДатаНачала = ТекущаяДатаЗанятости;
					ТекущаяСтрокаДоступности.ДатаОкончания = ТекущаяДатаЗанятости + ШагДаты;
					ТекущаяСтрокаДоступности.Занят = ТекущаяЗанятость;
				ИначеЕсли ТекущаяСтрокаДоступности.Занят = ТекущаяЗанятость Тогда
					ТекущаяСтрокаДоступности.ДатаОкончания = ТекущаяДатаЗанятости + ШагДаты;
				КонецЕсли;
				
				ТекущаяДатаЗанятости = ТекущаяДатаЗанятости + ШагДаты;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаЗанятости;
	
КонецФункции

// Устанавливает видимость элемента формы в соответствии с настройками.
//
// Параметры:
//  Элемент - ГруппаФормы - элемент формы, для которого устанавливается видимость.
//
Процедура УстановитьВидимостьЭлементаФормы(Элемент) Экспорт
	
	Видимость = Ложь;
	
	Если ЕстьДоступКСинхронизацииMSExchange() Тогда
		НастроенныеСерверы = Справочники.СерверыMSExchange.НастроенныеСерверыMSExchange();
		Видимость = НастроенныеСерверы.Количество() > 0;
	КонецЕсли;
	
	Элемент.Видимость = Видимость;
	
КонецПроцедуры

Процедура ЗагрузитьДанныеКалендаря(ОписаниеКалендаря, ДатаНачала, ДатаОкончания) Экспорт
	
	ОбработкаСинхронизации = ОбработкаСинхронизации(ОписаниеКалендаря.Узел);
	ЗаполнитьСобытияКалендаря(ОбработкаСинхронизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

Процедура ВыгрузитьДанныеКалендаря(ОписаниеКалендаря) Экспорт
	
	ПорцияУдаления = Новый Массив;
	ПорцияИзменения = Новый Массив;
	ПорцияСоздания = Новый Массив;
	УдалитьИзменения = Новый Массив;
	
	ЗаполнитьНастройкиПовторения(ОписаниеКалендаря.События);
	ЗаполнитьДанныеВхождений(ОписаниеКалендаря.События);
	
	Для Каждого Событие Из ОписаниеКалендаря.События Цикл
		Если Событие.ПометкаУдаления И Не ЗначениеЗаполнено(Событие.Идентификатор) Тогда
			УдалитьИзменения.Добавить(Событие.Ссылка);
		ИначеЕсли Событие.ПометкаУдаления Тогда
			ДобавитьСобытиеВПорцию(ПорцияУдаления, Событие);
		ИначеЕсли ЗначениеЗаполнено(Событие.Идентификатор)
				  Или ЗначениеЗаполнено(Событие.ИдентификаторВладельца)Тогда
			ДобавитьСобытиеВПорцию(ПорцияИзменения, Событие);
		Иначе
			ДобавитьСобытиеВПорцию(ПорцияСоздания, Событие);
		КонецЕсли;
	КонецЦикла;
	
	УдалитьРегистрациюИзмененийУзла(ОписаниеКалендаря.Узел, УдалитьИзменения);
	
	Если Не ЗначениеЗаполнено(ПорцияУдаления)
		И Не ЗначениеЗаполнено(ПорцияИзменения)
		И Не ЗначениеЗаполнено(ПорцияСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаСинхронизации = ОбработкаСинхронизации(ОписаниеКалендаря.Узел);
	
	Если ЗначениеЗаполнено(ПорцияИзменения) Тогда
		ДанныеОтвета = ОбработкаСинхронизации.ИзменитьЭлементы(ПорцияИзменения, Истина, Истина);
		ОбработатьВыгруженныеСобытия(
			ОписаниеКалендаря, ПорцияИзменения, ДанныеОтвета, НСтр("ru = 'Изменение'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПорцияУдаления) Тогда
		ДанныеОтвета = ОбработкаСинхронизации.УдалитьЭлементы(ПорцияУдаления, Истина);
		ОбработатьВыгруженныеСобытия(
			ОписаниеКалендаря, ПорцияУдаления, ДанныеОтвета, НСтр("ru = 'Удаление'"), Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПорцияСоздания) Тогда
		ДанныеОтвета = ОбработкаСинхронизации.СоздатьЭлементы(ПорцияСоздания, Истина);
		ОбработатьВыгруженныеСобытия(
			ОписаниеКалендаря, ПорцияСоздания, ДанныеОтвета, НСтр("ru = 'Создание'"));
	КонецЕсли;

КонецПроцедуры

// Возвращает событие журнала регистрации.
//
// Возвращаемое значение:
//  Строка - Событие журнала регистрации.
//
Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Синхронизация календарей.MSExchange'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Выполняет запись ошибки в журнал регистрации.
//
Процедура ЗаписьЖурналаРегистрацииОшибка(ТекстОшибки) Экспорт
	
	ЗаписьЖурналаРегистрации(
		СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,,,
		ТекстОшибки);
	
КонецПроцедуры

Процедура ЗагрузитьСостоянияПриглашений(Узел, События) Экспорт
	
	Если Не ЗначениеЗаполнено(События) Тогда
		Возврат;
	КонецЕсли;

	ТекущиеУчастникиСобытий = УчастникиСобытий(События);
	НовыеУчастникиСобытий = ТекущиеУчастникиСобытий.СкопироватьКолонки(
		"Кандидат, ЭтапРаботы, Участник, СостояниеПриглашения, Обязательный");
	
	Если Не ЗначениеЗаполнено(ТекущиеУчастникиСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	Идентификаторы = События.ВыгрузитьКолонку("Идентификатор");
	ОбработкаСинхронизации = ОбработкаСинхронизации(Узел);
	СообщенияОтвета = ОбработкаСинхронизации.ПолучитьЭлементы(Идентификаторы);
	Для Каждого Сообщение Из СообщенияОтвета Цикл
		Если ЭтоСообщениеСОшибкой(Сообщение, НСтр("ru = 'Получение'")) Тогда
			Продолжить;
		КонецЕсли;
		
		СобытиеКалендаря = Сообщение.Items.CalendarItem[0];
		ИдентификаторСобытия = СобытиеКалендаря.ItemId.Id;
		
		ОбязательныеУчастники = Новый Массив;
		Если Не СобытиеКалендаря.RequiredAttendees = Неопределено Тогда
			ОбязательныеУчастники = СобытиеКалендаря.RequiredAttendees.Attendee;
		КонецЕсли;
		
		НеОбязательныеУчастники = Новый Массив;
		Если Не СобытиеКалендаря.OptionalAttendees = Неопределено Тогда
			НеОбязательныеУчастники = СобытиеКалендаря.OptionalAttendees.Attendee;
		КонецЕсли;
		
		Для Каждого Участник Из ОбязательныеУчастники Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Идентификатор", ИдентификаторСобытия);
			Отбор.Вставить("АдресЭлектроннойПочты", НРег(Участник.Mailbox.EmailAddress));
			
			НайденныеСтроки = ТекущиеУчастникиСобытий.НайтиСтроки(Отбор);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НоваяСтрока = НовыеУчастникиСобытий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
				
				Если НайденнаяСтрока.ЭтоАвтор Тогда
					НоваяСтрока.СостояниеПриглашения = Перечисления.СостоянияПриглашений.Принято;
				Иначе
					НоваяСтрока.СостояниеПриглашения = СостояниеПриглашения(Участник.ResponseType);
				КонецЕсли;
				
				НоваяСтрока.Обязательный = Истина;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого Участник Из НеОбязательныеУчастники Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Идентификатор", ИдентификаторСобытия);
			Отбор.Вставить("АдресЭлектроннойПочты", НРег(Участник.Mailbox.EmailAddress));
			
			НайденныеСтроки = ТекущиеУчастникиСобытий.НайтиСтроки(Отбор);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НоваяСтрока = НовыеУчастникиСобытий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
				Если НайденнаяСтрока.ЭтоАвтор Тогда
					НоваяСтрока.СостояниеПриглашения = Перечисления.СостоянияПриглашений.Принято;
				Иначе
					НоваяСтрока.СостояниеПриглашения = СостояниеПриглашения(Участник.ResponseType);
				КонецЕсли;
				
				НоваяСтрока.Обязательный = Ложь;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Если Не ЗначениеЗаполнено(НовыеУчастникиСобытий) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.ЗаписатьСостоянияПриглашений(НовыеУчастникиСобытий);
	
КонецПроцедуры

// Формирует таблицу доступности пользователей Microsoft Exchange.
Функция ДоступностьПользователей(МассивПользователей, Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаНачала = НачалоЧаса(ДатаНачала);
	ДатаОкончания = КонецЧаса(ДатаОкончания) + 1;
	
	ДоступностьПользователей = Новый Соответствие;
	
	ОбработкаСинхронизация = Инициализировать(Пользователи.ТекущийПользователь());
	Если ОбработкаСинхронизация = Неопределено Тогда
		Возврат ДоступностьПользователей;
	КонецЕсли;
	
	ТаблицаАдресов = Справочники.СерверыMSExchange.ТаблицаАдресовЭлектроннойПочтыПользователей(
		МассивПользователей, ОбработкаСинхронизация.СерверMSExchange.ВидКонтактнойИнформацииПользователей);

	ПочтовыеАдреса = ТаблицаАдресов.ВыгрузитьКолонку("АдресЭлектроннойПочты");
	
	Если ПочтовыеАдреса.Количество() <> 0 Тогда
		
		Попытка
			ДоступностьПользователейExchange = ОбработкаСинхронизация.ДоступностьПользователей(
				ПочтовыеАдреса,
				ДатаНачала,
				ДатаОкончания);
			ИндексПользователя = 0;
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрацииОшибка(ПодробноеПредставлениеОшибки);
			
			Возврат ДоступностьПользователей;
			
		КонецПопытки;
		
		Для Каждого ДоступностьПользователяExchange Из ДоступностьПользователейExchange Цикл
			
			Если Не ЗначениеЗаполнено(ДоступностьПользователяExchange) Тогда
				ИндексПользователя = ИндексПользователя + 1;
				Продолжить;
			КонецЕсли;
			
			СтрокаАдреса = ТаблицаАдресов.Найти(ПочтовыеАдреса[ИндексПользователя], "АдресЭлектроннойПочты");
			ИндексПользователя = ИндексПользователя + 1;
			Если СтрокаАдреса = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДоступностьПользователей.Вставить(СтрокаАдреса.Пользователь, ДоступностьПользователяExchange);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДоступностьПользователей;
	
КонецФункции

// Выполняет инициализацию обработки синхронизации с Microsoft Exchange.
Функция Инициализировать(Пользователь, ТекстОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюMSExchange") Тогда
		ТекстОшибки = НСтр("ru = 'Синхронизация с Microsoft Exchange Server отключена.'");
		Возврат Неопределено;
	КонецЕсли;
	
	УзелПользователя = ПланыОбмена.СинхронизацияКалендарей.УзелПользователя(
		Пользователь, Перечисления.ТипыСинхронизацииКалендарей.MSExchange);
	Если Не ЗначениеЗаполнено(УзелПользователя) Тогда
		ТекстОшибки = НСтр("ru = 'Для пользователя не настроена учетная запись Microsoft Exchange Server.'");
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработкаСинхронизация = ОбработкаСинхронизации(УзелПользователя);
	Если Не ОбработкаСинхронизация.ПроверитьСоединение() Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось установить соединение с Microsoft Exchange Server.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбработкаСинхронизация;
	
КонецФункции

Функция УчастникиСобытий(ЗаписиКалендаря) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗаписиКалендаря.Узел КАК ПланОбмена.СинхронизацияКалендарей) КАК Узел,
	|	ВЫРАЗИТЬ(ЗаписиКалендаря.Ссылка КАК Справочник.ЗаписиРабочегоКалендаря) КАК Ссылка,
	|	ЗаписиКалендаря.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ЗаписиКалендаря
	|ИЗ
	|	&ЗаписиКалендаря КАК ЗаписиКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКалендаря.Узел КАК Узел,
	|	НастройкиСинхронизацииMSExchange.СерверMSExchange.ВидКонтактнойИнформацииПользователей КАК ВидКИ,
	|	ВТ_ЗаписиКалендаря.Ссылка КАК Ссылка,
	|	ВТ_ЗаписиКалендаря.Идентификатор КАК Идентификатор,
	|	УчастникиЭтапаРаботыСКандидатом.Обязательный КАК Обязательный,
	|	УчастникиЭтапаРаботыСКандидатом.Участник КАК Участник,
	|	УчастникиЭтапаРаботыСКандидатом.Участник.ФизическоеЛицо КАК УчастникФЛ,
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат КАК Кандидат,
	|	УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы КАК ЭтапРаботы,
	|	УчастникиЭтапаРаботыСКандидатом.СостояниеПриглашения КАК СостояниеПриглашения,
	|	ВТ_ЗаписиКалендаря.Ссылка.Автор = УчастникиЭтапаРаботыСКандидатом.Участник КАК ЭтоАвтор
	|ИЗ
	|	ВТ_ЗаписиКалендаря КАК ВТ_ЗаписиКалендаря
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСинхронизацииMSExchange КАК НастройкиСинхронизацииMSExchange
	|		ПО ВТ_ЗаписиКалендаря.Узел = НастройкиСинхронизацииMSExchange.Узел
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|		ПО ВТ_ЗаписиКалендаря.Ссылка.Предмет = УчастникиЭтапаРаботыСКандидатом.Кандидат
	|			И ВТ_ЗаписиКалендаря.Ссылка.СвязанныйПредмет = УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы
	|			И (НЕ УчастникиЭтапаРаботыСКандидатом.Участник.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))");
	Запрос.УстановитьПараметр("ЗаписиКалендаря", ЗаписиКалендаря);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = РезультатЗапроса.Выгрузить();
	Результат.Колонки.Добавить("АдресЭлектроннойПочты", Новый ОписаниеТипов("Строка"));
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыКИ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("ВидКИ"));
	УчастникиФЛ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.ВыгрузитьКолонку("УчастникФЛ"));
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(УчастникиФЛ,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, ВидыКИ);
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", СтрокаРезультата.УчастникФЛ);
		Отбор.Вставить("Вид", СтрокаРезультата.ВидКИ);
		
		Строки = ТаблицаКИ.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(Строки) Тогда
			СтрокаРезультата.АдресЭлектроннойПочты = НРег(Строки[0].Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПомещенияСобытий(ЗаписиКалендаря) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЗаписиКалендаря.Узел КАК ПланОбмена.СинхронизацияКалендарей) КАК Узел,
	|	ВЫРАЗИТЬ(ЗаписиКалендаря.Ссылка КАК Справочник.ЗаписиРабочегоКалендаря) КАК Ссылка,
	|	ЗаписиКалендаря.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_ЗаписиКалендаря
	|ИЗ
	|	&ЗаписиКалендаря КАК ЗаписиКалендаря
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаписиКалендаря.Узел КАК Узел,
	|	НастройкиСинхронизацииMSExchange.СерверMSExchange.ВидКонтактнойИнформацииПомещений КАК ВидКИ,
	|	ВТ_ЗаписиКалендаря.Ссылка КАК Ссылка,
	|	ВТ_ЗаписиКалендаря.Идентификатор КАК Идентификатор,
	|	РаботаСКандидатами.Бронь.Помещение КАК Помещение
	|ИЗ
	|	ВТ_ЗаписиКалендаря КАК ВТ_ЗаписиКалендаря
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСинхронизацииMSExchange КАК НастройкиСинхронизацииMSExchange
	|		ПО ВТ_ЗаписиКалендаря.Узел = НастройкиСинхронизацииMSExchange.Узел
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|		ПО ВТ_ЗаписиКалендаря.Ссылка.Предмет = РаботаСКандидатами.Кандидат
	|			И ВТ_ЗаписиКалендаря.Ссылка.СвязанныйПредмет = РаботаСКандидатами.ЭтапРаботы
	|			И (НЕ РаботаСКандидатами.Бронь = ЗНАЧЕНИЕ(Документ.Бронь.ПустаяСсылка))");
	Запрос.УстановитьПараметр("ЗаписиКалендаря", ЗаписиКалендаря);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	
	Выгрузка = РезультатЗапроса.Выгрузить();
	Выгрузка.Колонки.Добавить("АдресЭлектроннойПочты", Новый ОписаниеТипов("Строка"));
	
	Результат.Вставить("Помещения", Выгрузка);
	
	ВидыКИ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.Помещения.ВыгрузитьКолонку("ВидКИ"));
	Помещения = ОбщегоНазначенияКлиентСервер.СвернутьМассив(Результат.Помещения.ВыгрузитьКолонку("Помещение"));
	
	Результат.Вставить("Местоположение", Помещения[0].Наименование);
	
	ТаблицаКИ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Помещения,
		Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, ВидыКИ);
	
	Для Каждого СтрокаРезультата Из Результат.Помещения Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Объект", СтрокаРезультата.Помещение);
		Отбор.Вставить("Вид", СтрокаРезультата.ВидКИ);
		
		Строки = ТаблицаКИ.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(Строки) Тогда
			СтрокаРезультата.АдресЭлектроннойПочты = НРег(Строки[0].Представление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВозможнаБроньПомещения(Помещение, ДатаНачала, ДатаОкончания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюMSExchange") Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбработкаСинхронизации = Инициализировать(Пользователи.ТекущийПользователь());
	Если ОбработкаСинхронизации = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидКИ = ОбработкаСинхронизации.СерверMSExchange.ВидКонтактнойИнформацииПомещений;
	
	ТаблицаКИ = Справочники.СерверыMSExchange.ТаблицаАдресовЭлектроннойПочты(Помещение, ВидКИ);
	
	Если Не ЗначениеЗаполнено(ТаблицаКИ) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
	
		ДоступностьПомещенийExchange = ОбработкаСинхронизации.ДоступностьПользователей(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаКИ[0].АдресЭлектроннойПочты), ДатаНачала, ДатаОкончания);
	
	Исключение
	
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрацииОшибка(ПодробноеПредставлениеОшибки);
	
		Возврат Результат;
	
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДоступностьПомещенийExchange) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ДоступностьПомещения = ДоступностьПомещенийExchange[0].ДоступностьСтрокой;
	Для ИндексСимвола = 1 По СтрДлина(ДоступностьПомещения) Цикл
		ТекущийСимвол = Символ(КодСимвола(ДоступностьПомещения, ИндексСимвола));
		Если Не ТекущийСимвол = "0" Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТекстЭлементаПланировщика(Текст) Экспорт
	
	Возврат СтрШаблон(НСтр("ru = 'MS Exchange: %1'"), Текст);
	
КонецФункции

Функция ДоступностьПомещений(Помещения, ДатаНачала, ДатаОкончания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Доступность = Новый Соответствие;
	
	ОбработкаСинхронизации = Инициализировать(Пользователи.ТекущийПользователь());
	Если ОбработкаСинхронизации = Неопределено Тогда
		Возврат Доступность;
	КонецЕсли;
	
	ВидКонтактнойИнформации = ОбработкаСинхронизации.СерверMSExchange.ВидКонтактнойИнформацииПомещений;
	КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Помещения,
		ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"),
		ВидКонтактнойИнформации);
		
	Доступность = ДоступностьПолучателей(ОбработкаСинхронизации, КонтактнаяИнформация,
		НачалоЧаса(ДатаНачала), КонецЧаса(ДатаОкончания) + 1);
	
	Возврат Доступность;
	
КонецФункции

Процедура УстановитьСостояниеПриглашенийПриУдаленииСобытия(ЗаписьКалендаря) Экспорт
	
	Если Не ЗаписьКалендаря.Связанная
		И Не ЗаписьКалендаря.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат КАК Кандидат,
	|	УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы КАК ЭтапРаботы,
	|	УчастникиЭтапаРаботыСКандидатом.Участник КАК Участник,
	|	УчастникиЭтапаРаботыСКандидатом.СостояниеПриглашения КАК СостояниеПриглашения,
	|	УчастникиЭтапаРаботыСКандидатом.Обязательный КАК Обязательный
	|ИЗ
	|	РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|ГДЕ
	|	УчастникиЭтапаРаботыСКандидатом.Кандидат = &Кандидат
	|	И УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы = &ЭтапРаботы");
	Запрос.УстановитьПараметр("Кандидат", ЗаписьКалендаря.Предмет);
	Запрос.УстановитьПараметр("ЭтапРаботы", ЗаписьКалендаря.СвязанныйПредмет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.УчастникиЭтапаРаботыСКандидатом.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.СостояниеПриглашения = ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.НеОтправлено");
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьВходящиеСобытияОрганизатора(События) Экспорт

	Для Каждого Событие Из События Цикл
		// Отменим связанные этапы работы с кандидатами
		Если Событие.ПометкаУдаления Тогда
			Результат = ПодборПерсоналаКлиентСервер.РезультатУстановкиЭтапаРаботыСКандидатом();
			Результат.Кандидаты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Событие.Кандидат);
			Результат.ЭтапРаботы.Этап = Событие.ЭтапРаботы;
			Результат.ЭтапРаботы.Состояние = Неопределено;
			Результат.ЭтапРаботы.Период = Событие.ПериодЗаписи;
			
			ПодборПерсонала.УстановитьСостояниеЭтапаРаботыКандидатов(Результат);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДанныеПовторяющихсяСобытий(ДанныеПовторяющихсяСобытий, События, Узел) Экспорт

	ОбработкаСинхронизации = ОбработкаСинхронизации(Узел);
	
	Идентификаторы = Новый Массив;
	ИдентификаторыИзмененныхВхождений = Новый Массив;
	ВхожденияСВладельцем = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ДанныеПовторяющихсяСобытий Цикл
		Идентификаторы.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	СообщенияОтвета = ОбработкаСинхронизации.ПолучитьЭлементы(Идентификаторы);
	
	Для Каждого Сообщение Из СообщенияОтвета Цикл
		Если ЭтоСообщениеСОшибкой(Сообщение, НСтр("ru = 'Получение'")) Тогда
			Продолжить;
		КонецЕсли;
		
		СобытиеКалендаря = Сообщение.Items.CalendarItem[0];
		ИдентификаторСобытия = СобытиеКалендаря.ItemId.Id;
		
		ДанныеПовторения = ДанныеПовторяющегосяСобытия(СобытиеКалендаря.Recurrence);
		
		// Получим идентификаторы измененных вхождений
		Если СобытиеКалендаря.ModifiedOccurrences <> Неопределено Тогда
			Для Каждого Изменение Из СобытиеКалендаря.ModifiedOccurrences.Occurrence Цикл
				ИдентификаторыИзмененныхВхождений.Добавить(Изменение.ItemId.Id);
				ВхожденияСВладельцем.Вставить(Изменение.ItemId.Id, ИдентификаторСобытия);
			КонецЦикла; 
		КонецЕсли;
		
		// Получим идентификаторы удаленных вхождений
		Если СобытиеКалендаря.DeletedOccurrences <> Неопределено Тогда
			Для Каждого Изменение Из СобытиеКалендаря.DeletedOccurrences.DeletedOccurrence Цикл
				ДанныеПовторения.УдаленныеВхождения.Добавить(НачалоДня(Изменение.Start));
			КонецЦикла; 
		КонецЕсли;
		
		ДанныеПовторяющихсяСобытий.Вставить(ИдентификаторСобытия, ДанныеПовторения);
	КонецЦикла;
	
	// Получим данные измененных вхождений
	Если ИдентификаторыИзмененныхВхождений.Количество() <> 0 Тогда
		СообщенияОтвета = ОбработкаСинхронизации.ПолучитьЭлементы(ИдентификаторыИзмененныхВхождений);
	
		Для Каждого Сообщение Из СообщенияОтвета Цикл
			Если ЭтоСообщениеСОшибкой(Сообщение, НСтр("ru = 'Получение'")) Тогда
				Продолжить;
			КонецЕсли;
			
			СобытиеКалендаря = Сообщение.Items.CalendarItem[0];
			ИдентификаторСобытия = СобытиеКалендаря.ItemId.Id;
			
			Если СобытиеКалендаря = Неопределено Тогда
				Возврат;
			КонецЕсли;
			
			НовоеСобытие = События.Добавить();
			НовоеСобытие.Идентификатор = ИдентификаторСобытия;
			НовоеСобытие.ОтпечатокОбъекта = СобытиеКалендаря.ItemId.ChangeKey;
			НовоеСобытие.Наименование = СобытиеКалендаря.Subject;
			НовоеСобытие.Описание = НовоеСобытие.Наименование;
			НовоеСобытие.ДатаНачала = СобытиеКалендаря.Start;
			НовоеСобытие.ДатаОкончания = СобытиеКалендаря.End;
			
			ИдентификаторВладельца = ВхожденияСВладельцем[ИдентификаторСобытия];
			ДанныеПовторяющихсяСобытий[ИдентификаторВладельца].ИзмененныеВхождения.Добавить(ИдентификаторСобытия);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает состояние занятости по строковому описанию.
//
// Параметры:
//	СостояниеСтрокой	- Строка - строковое описание занятости.
//	Сокращенное			- Булево - признак, определяющий в каком виде предоставлено строковое описание.
//
// Возвращаемое значение:
//	ПеречислениеСсылка.СостоянияЗанятости - значение перечисления, соответствующее строковому описанию.
//
Функция СостояниеПоОписанию(СостояниеСтрокой, Сокращенное = Ложь)

	Состояние = Перечисления.СостоянияЗанятости.НетДанных;
	
	Если Сокращенное Тогда
		Если СостояниеСтрокой = "0" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Доступен;
		ИначеЕсли СостояниеСтрокой = "1" Тогда
			Состояние = Перечисления.СостоянияЗанятости.ПодВопросом;
		ИначеЕсли СостояниеСтрокой = "2" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Занят;
		ИначеЕсли СостояниеСтрокой = "3" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Отсутствует;
		Иначе // 4
			Состояние = Перечисления.СостоянияЗанятости.НетДанных;
		КонецЕсли;
	Иначе
		Если СостояниеСтрокой = "Free" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Доступен;
		ИначеЕсли СостояниеСтрокой = "Tentative" Тогда
			Состояние = Перечисления.СостоянияЗанятости.ПодВопросом;
		ИначеЕсли СостояниеСтрокой = "Busy" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Занят;
		ИначеЕсли СостояниеСтрокой = "OOF" Тогда
			Состояние = Перечисления.СостоянияЗанятости.Отсутствует;
		Иначе // NoData
			Состояние = Перечисления.СостоянияЗанятости.НетДанных;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

Функция ДоступностьПолучателей(ОбработкаСинхронизации, КонтактнаяИнформация, ДатаНачала, ДатаОкончания)
	
	Доступность = Новый Соответствие;
	
	ПочтовыеАдреса = КонтактнаяИнформация.ВыгрузитьКолонку("Представление");
	Если ПочтовыеАдреса.Количество() = 0 Тогда
		Возврат Доступность;
	КонецЕсли;
	
	Попытка
		ДоступностьПолучателейExchange = ОбработкаСинхронизации.ДоступностьПользователей(
			ПочтовыеАдреса,
			ДатаНачала,
			ДатаОкончания);
	
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ЗаписьЖурналаРегистрацииОшибка(ПодробноеПредставлениеОшибки);
		
		Возврат Доступность;
		
	КонецПопытки;
	
	ИндексПолучателя = 0;
	
	Для Каждого ДоступностьПолучателя Из ДоступностьПолучателейExchange Цикл
		
		Если Не ЗначениеЗаполнено(ДоступностьПолучателя) Тогда
			ИндексПолучателя = ИндексПолучателя + 1;
			Продолжить;
		КонецЕсли;
		
		СтрокаАдреса = КонтактнаяИнформация.Найти(ПочтовыеАдреса[ИндексПолучателя], "Представление");
		ИндексПолучателя = ИндексПолучателя + 1;
		Если СтрокаАдреса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Доступность.Вставить(СтрокаАдреса.Объект, ДоступностьПолучателя);
		
	КонецЦикла;
	
	Возврат Доступность;

КонецФункции

Функция ОбработкаСинхронизации(Узел)
	
	ОбработкаСинхронизации = Обработки.СинхронизацияMSExchange.Инициализировать(Узел);
	
	Возврат ОбработкаСинхронизации;

КонецФункции

Процедура ЗаполнитьСобытияКалендаря(ОбработкаСинхронизации, ОписаниеКалендаря, ДатаНачала, ДатаОкончания)
	
	ДанныеСинхронизации = ДанныеСинхронизацииЭлементов(ОбработкаСинхронизации, ОписаниеКалендаря.ТокенСинхронизации);
	
	УстановитьДатыПоУмолчанию(ДатаНачала, ДатаОкончания);
	
	Для Каждого Изменение Из ДанныеСинхронизации.Changes.Create Цикл
		ОбработатьИзменениеСобытия(ОписаниеКалендаря.События, Изменение, ДатаНачала, ДатаОкончания);
	КонецЦикла;
	
	Для Каждого Изменение Из ДанныеСинхронизации.Changes.Update Цикл
		ОбработатьИзменениеСобытия(ОписаниеКалендаря.События, Изменение, ДатаНачала, ДатаОкончания);
	КонецЦикла;

	Для Каждого Изменение Из ДанныеСинхронизации.Changes.Delete Цикл
		ОбработатьИзменениеСобытия(ОписаниеКалендаря.События, Изменение, ДатаНачала, ДатаОкончания, Истина);
	КонецЦикла;
	
	ОписаниеКалендаря.ТокенСинхронизации = ДанныеСинхронизации.SyncState;
	
КонецПроцедуры

Функция ДанныеСинхронизацииЭлементов(ОбработкаСинхронизации, ТокенСинхронизации)
	
	ДанныеСинхронизации = ОбработкаСинхронизации.ДанныеСинхронизацииЭлементов(ТокенСинхронизации);
	
	Если НРег(ДанныеСинхронизации.ResponseClass) = НРег("Error")
		И НРег(ДанныеСинхронизации.ResponseCode) = НРег("ErrorInvalidSyncStateData") Тогда
		ДанныеСинхронизации = ОбработкаСинхронизации.ДанныеСинхронизацииЭлементов();
	КонецЕсли;
	
	Если НРег(ДанныеСинхронизации.ResponseClass) <> НРег("Success") Тогда
		ВызватьИсключение ДанныеСинхронизации.ResponseCode;
	КонецЕсли;
	
	Возврат ДанныеСинхронизации;
	
КонецФункции

Процедура ОбработатьИзменениеСобытия(События, Изменение, ДатаНачала, ДатаОкончания, ЭтоУдаление = Ложь)
	
	Если ЭтоУдаление Тогда
		НовоеСобытие = События.Добавить();
		НовоеСобытие.Идентификатор = Изменение.ItemId.Id;
		НовоеСобытие.ПометкаУдаления = Истина;
		Возврат;
	КонецЕсли;
	
	СобытиеКалендаря = Изменение.CalendarItem;
	
	Если СобытиеКалендаря = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Повторяющееся = НРег(СобытиеКалендаря.CalendarItemType) = НРег("RecurringMaster");
	
	Если Не Повторяющееся 
		 И Не (СобытиеКалендаря.Start > ДатаНачала И СобытиеКалендаря.Start < ДатаОкончания) Тогда
		Возврат;
	КонецЕсли;
	
	НовоеСобытие = События.Добавить();
	НовоеСобытие.ПометкаУдаления = СобытиеКалендаря.IsCancelled;
	НовоеСобытие.Идентификатор = СобытиеКалендаря.ItemId.Id;
	НовоеСобытие.ОтпечатокОбъекта = СобытиеКалендаря.ItemId.ChangeKey;
	НовоеСобытие.Наименование = СобытиеКалендаря.Subject;
	НовоеСобытие.Описание = НовоеСобытие.Наименование;
	НовоеСобытие.ДатаНачала = СобытиеКалендаря.Start;
	НовоеСобытие.ДатаОкончания = СобытиеКалендаря.End;
	НовоеСобытие.Повторяющееся = Повторяющееся;
	
КонецПроцедуры

Процедура УстановитьДатыПоУмолчанию(ДатаНачала, ДатаОкончания)
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ДобавитьМесяц(ДатаНачала, 12);
	КонецЕсли
	
КонецПроцедуры

Процедура ДобавитьСобытиеВПорцию(Порция, Событие)
	
	Идентификатор = ?(ЗначениеЗаполнено(Событие.ИдентификаторВладельца), 
					  Событие.ИдентификаторВладельца, 
					  Событие.Идентификатор);
					  
	ОтпечатокОбъекта = ?(ЗначениеЗаполнено(Событие.ОтпечатокВладельца), 
					  	 Событие.ОтпечатокВладельца, 
					  	 Событие.ОтпечатокОбъекта);
	
	ЭлементПорции = Новый Соответствие;
	ЭлементПорции.Вставить("Ссылка", Событие.Ссылка);
	ЭлементПорции.Вставить("Id", Идентификатор);
	ЭлементПорции.Вставить("ChangeKey", ОтпечатокОбъекта);
	
	Если Событие.Связанное
		 И Не ЗначениеЗаполнено(Событие.ОбязательныеУчастники) 
		 И Не ЗначениеЗаполнено(Событие.НеОбязательныеУчастники) Тогда
		ЭлементПорции.Вставить("ЭтоПриглашение", Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Событие.ИдентификаторВладельца) Тогда
		ЭлементПорции.Вставить("InstanceIndex", Событие.НомерВхождения);
	КонецЕсли;
	
	Если Не Событие.ПометкаУдаления Тогда
		ЭлементПорции.Вставить("Start", Событие.ДатаНачала);
		ЭлементПорции.Вставить("End", Событие.ДатаОкончания);
		ЭлементПорции.Вставить("Subject", Событие.Наименование);
		ЭлементПорции.Вставить("RequiredAttendees", Событие.ОбязательныеУчастники);
		ЭлементПорции.Вставить("OptionalAttendees", Событие.НеОбязательныеУчастники);
		ЭлементПорции.Вставить("Resources", Событие.Помещения);
		ЭлементПорции.Вставить("Location", Событие.Местоположение);
		ЭлементПорции.Вставить("Recurrence", Событие.НастройкиПовторения);
	КонецЕсли;
	
	Порция.Добавить(ЭлементПорции);
	
КонецПроцедуры

Процедура УдалитьРегистрациюИзмененийУзла(Узел, Изменения)
	
	Если Не ЗначениеЗаполнено(Изменения) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗаписьСообщения используется только для управления нумерацией сообщений и блокировки узла.
	ЗаписьСообщения = ПланыОбмена.СоздатьЗаписьСообщения();
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ЗаписьСообщения.НачатьЗапись(ЗаписьXML, Узел);
	
	ПланыОбмена.ВыбратьИзменения(Узел, ЗаписьСообщения.НомерСообщения, Изменения);
	НомерСообщения = ЗаписьСообщения.НомерСообщения;
	ЗаписьСообщения.ЗакончитьЗапись();
	ПланыОбмена.УдалитьРегистрациюИзменений(Узел, НомерСообщения);
	
КонецПроцедуры

Процедура ОбработатьВыгруженныеСобытия(ОписаниеКалендаря, Порция, ЭлементыОтвета, Операция, ЭтоУдаление = Ложь)
	
	Изменения = Новый Массив;
	
	Индекс = 0;
	Для Каждого Событие Из Порция Цикл
		ЭлементОтвета = ЭлементыОтвета[Индекс];
		Индекс = Индекс + 1;
		
		Изменения.Добавить(Событие["Ссылка"]);
		
		Если ЭлементОтвета.ResponseCode = "ErrorCalendarOccurrenceIsDeletedFromRecurrence" Тогда
			// Исключение для удаления вхождений.
			Продолжить;
		КонецЕсли;
		
		Если ЭтоСообщениеСОшибкой(ЭлементОтвета, Операция, Событие["Ссылка"]) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоУдаление Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКалендаря = ЭлементОтвета.Items.CalendarItem[0];

		МенеджерЗаписи = РегистрыСведений.ЗаписиСинхронизацииКалендарей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаписьРабочегоКалендаря	= Событие["Ссылка"];
		МенеджерЗаписи.Узел						= ОписаниеКалендаря.Узел;
		МенеджерЗаписи.ИдентификаторКалендаря	= ОписаниеКалендаря.Идентификатор;
		МенеджерЗаписи.Идентификатор			= ЭлементКалендаря.ItemId.Id;
		МенеджерЗаписи.ОтпечатокОбъекта			= ЭлементКалендаря.ItemId.ChangeKey;
		МенеджерЗаписи.БезОписания				= ОписаниеКалендаря.БезОписания;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	УдалитьРегистрациюИзмененийУзла(ОписаниеКалендаря.Узел, Изменения);
	
КонецПроцедуры

Функция ЭтоСообщениеСОшибкой(Сообщение, Операция, Ссылка = Неопределено)
	
	ЭтоОшибка = Не (НРег(Сообщение.ResponseClass) = НРег("Success"));

	Если ЭтоОшибка Тогда
		ТекстОшибки = ?(Ссылка = Неопределено, "", СтрШаблон(НСтр("ru = 'Код записи календаря: %1'"), Ссылка.Код));
		
		ТекстОшибки = СтрШаблон(НСтр(
		"ru = 'Операция: %1
		|Код ошибки (ResponseCode): %2
		|Описание (MessageText): %3'"), Операция, Сообщение.ResponseCode, Сообщение.MessageText);
		
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ЗаписиРабочегоКалендаря,
			?(Ссылка = Неопределено, Справочники.ЗаписиРабочегоКалендаря.ПустаяСсылка(), Ссылка),
			ТекстОшибки);
	КонецЕсли;

	Возврат ЭтоОшибка;
	
КонецФункции

Функция СостояниеПриглашения(ТипОтвета)
	
	Результат = Перечисления.СостоянияПриглашений.НеОтправлено;
	
	Если ТипОтвета = "Accept" Или ТипОтвета = "Organizer" Тогда
		Результат = Перечисления.СостоянияПриглашений.Принято;
	ИначеЕсли ТипОтвета = "Decline" Тогда
		Результат = Перечисления.СостоянияПриглашений.Отклонено;
	ИначеЕсли ТипОтвета = "Tentative" Тогда
		Результат = Перечисления.СостоянияПриглашений.ПодВопросом;
	Иначе // Unknown, NoResponseReceived
		Результат = Перечисления.СостоянияПриглашений.Отправлено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КоличествоОтклоненныхПриглашений()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаботаСКандидатами.Кандидат КАК Кандидат,
	|	РаботаСКандидатами.ЭтапРаботы КАК ЭтапРаботы
	|ИЗ
	|	РегистрСведений.РаботаСКандидатами КАК РаботаСКандидатами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиЭтапаРаботыСКандидатом КАК УчастникиЭтапаРаботыСКандидатом
	|		ПО (УчастникиЭтапаРаботыСКандидатом.Обязательный)
	|			И (УчастникиЭтапаРаботыСКандидатом.СостояниеПриглашения = &СостояниеПриглашения)
	|			И РаботаСКандидатами.Кандидат = УчастникиЭтапаРаботыСКандидатом.Кандидат
	|			И РаботаСКандидатами.ЭтапРаботы = УчастникиЭтапаРаботыСКандидатом.ЭтапРаботы
	|			И (РаботаСКандидатами.Период > &ТекущаяДата)
	|			И (РаботаСКандидатами.Кандидат.Ответственный = &Ответственный)");
	Запрос.УстановитьПараметр("СостояниеПриглашения",
		ПредопределенноеЗначение("Перечисление.СостоянияПриглашений.Отклонено"));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Ответственный", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().Количество();
	
КонецФункции

Функция ДанныеПовторяющегосяСобытия(ДанныеПовторения)

	// Данные по умолчанию
	ЧастотаПовторения = 			Перечисления.ЧастотаПовторения.ПустаяСсылка();
	ИнтервалПовторения = 			0;
	ПравилоОкончанияПовторения = 	Перечисления.ПравилаОкончанияПовторения.Никогда;
	ПовторениеКоличествоПовторов = 	0;
	ДатаОкончанияПовторения = 		Дата(1,1,1);
	ПовторениеПоДнямМесяца = 		0;
	ПовторениеПоДнямНеделиВМесяце = Неопределено;
	ПовторениеПоМесяцам = 			0;
	КоличествоПовторов = 			0;
	
	ПовторениеПоДнямНедели = Новый Соответствие;
	ПовторениеПоДнямНедели.Вставить(1, Ложь);
	ПовторениеПоДнямНедели.Вставить(2, Ложь);
	ПовторениеПоДнямНедели.Вставить(3, Ложь);
	ПовторениеПоДнямНедели.Вставить(4, Ложь);
	ПовторениеПоДнямНедели.Вставить(5, Ложь);
	ПовторениеПоДнямНедели.Вставить(6, Ложь);
	ПовторениеПоДнямНедели.Вставить(7, Ложь);
	
	СоответствияДанных = СоответствияДанныхПовторения(Истина);
	
	// Заполнение настроек повторения
	Если ДанныеПовторения.RelativeYearlyRecurrence <> Неопределено Тогда
		// Не обрабатываем
	ИначеЕсли ДанныеПовторения.AbsoluteYearlyRecurrence <> Неопределено Тогда
		Данные = ДанныеПовторения.AbsoluteYearlyRecurrence;
		
		ЧастотаПовторения 		= Перечисления.ЧастотаПовторения.Ежегодно;
		ПовторениеПоДнямМесяца 	= Данные.DayOfMonth;
		ПовторениеПоМесяцам 	= СоответствияДанных.Месяцы[Данные.Month];
	ИначеЕсли ДанныеПовторения.RelativeMonthlyRecurrence <> Неопределено Тогда
		Данные = ДанныеПовторения.RelativeMonthlyRecurrence;
		
		ЧастотаПовторения 	= Перечисления.ЧастотаПовторения.Ежемесячно;
		ИнтервалПовторения 	= Данные.Interval;
		
		ПовторениеПоДнямНеделиВМесяце = 
			Новый Структура("ДеньНедели, НомерВхождения",
							СоответствияДанных.ДниНедели[Данные.DaysOfWeek],
							СоответствияДанных.Вхождения[Данные.DayOfWeekIndex]);
	ИначеЕсли ДанныеПовторения.AbsoluteMonthlyRecurrence <> Неопределено Тогда
		Данные = ДанныеПовторения.AbsoluteMonthlyRecurrence;
		
		ЧастотаПовторения 		= Перечисления.ЧастотаПовторения.Ежемесячно;
		ПовторениеПоДнямМесяца 	= Данные.DayOfMonth;
		ИнтервалПовторения 		= Данные.Interval;
	ИначеЕсли ДанныеПовторения.WeeklyRecurrence <> Неопределено Тогда
		Данные = ДанныеПовторения.WeeklyRecurrence;
		
		ЧастотаПовторения 		= Перечисления.ЧастотаПовторения.Еженедельно;
		ИнтервалПовторения 		= Данные.Interval;
		
		Для Каждого DayOfWeek Из Данные.DaysOfWeek Цикл
			ПовторениеПоДнямНедели.Вставить(СоответствияДанных.ДниНедели[DayOfWeek], Истина);
		КонецЦикла; 
	ИначеЕсли ДанныеПовторения.DailyRecurrence <> Неопределено Тогда
		Данные = ДанныеПовторения.DailyRecurrence;
		
		ЧастотаПовторения 		= Перечисления.ЧастотаПовторения.Ежедневно;
		ИнтервалПовторения 		= Данные.Interval;
	КонецЕсли; 
	
	Если ДанныеПовторения.EndDateRecurrence <> Неопределено Тогда
		ПравилоОкончанияПовторения 	= Перечисления.ПравилаОкончанияПовторения.ДоДаты;
		ДатаОкончанияПовторения 	= ДанныеПовторения.EndDateRecurrence.EndDate;
	ИначеЕсли ДанныеПовторения.NumberedRecurrence <> Неопределено Тогда
		ПравилоОкончанияПовторения 	= Перечисления.ПравилаОкончанияПовторения.ПослеЧислаПовторов;
		КоличествоПовторов 			= ДанныеПовторения.NumberedRecurrence.NumberOfOccurrences;
	КонецЕсли; 
	
	Результат = РаботаСРабочимКалендаремКлиентСервер.НовыеНастройкиПовторения(
					ЧастотаПовторения, ИнтервалПовторения, ПравилоОкончанияПовторения,
					КоличествоПовторов, ДатаОкончанияПовторения, ПовторениеПоДнямНедели,
					ПовторениеПоДнямМесяца, ПовторениеПоДнямНеделиВМесяце, ПовторениеПоМесяцам);
					
	Результат.Вставить("ИзмененныеВхождения", Новый Массив);
	Результат.Вставить("УдаленныеВхождения", Новый Массив);
	
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьНастройкиПовторения(События)

	ПовторяющиесяСобытия = Новый Массив;
	
	Для Каждого Событие Из События Цикл
		Если Событие.Повторяющееся И ЗначениеЗаполнено(Событие.Ссылка) Тогда
			ПовторяющиесяСобытия.Добавить(Событие.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ПовторяющиесяСобытия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствияДанных = СоответствияДанныхПовторения(Ложь);
	НастройкиПовторения = РаботаСРабочимКалендарем.НастройкиПовторенияЗаписейКалендаря(ПовторяющиесяСобытия);
	
	Для Каждого Событие Из События Цикл
		
		Если Не Событие.Повторяющееся Или Не ЗначениеЗаполнено(Событие.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Настройка = НастройкиПовторения[Событие.Ссылка];
		
		// Заранее преобразуем дату к нужному виду
		Настройка.ДатаНачалаПовторения 		= Формат(Настройка.ДатаНачалаПовторения, "ДФ=yyyy-MM-dd");
		Настройка.ДатаОкончанияПовторения 	= Формат(Настройка.ДатаОкончанияПовторения, "ДФ=yyyy-MM-dd");
		
		НастройкиExchange = Новый Соответствие;
		
		// Настройки повторения
		Если Настройка.ЧастотаПовторения = Перечисления.ЧастотаПовторения.Ежегодно Тогда
			Если ЗначениеЗаполнено(Настройка.ПовторениеПоДнямМесяца)
				 И ЗначениеЗаполнено(Настройка.ПовторениеПоМесяцам) Тогда
				НастройкаExchange = Новый Соответствие;
				НастройкаExchange.Вставить("DayOfMonth", Настройка.ПовторениеПоДнямМесяца);
				НастройкаExchange.Вставить("Month", СоответствияДанных.Месяцы[Настройка.ПовторениеПоМесяцам]);
		
				НастройкиExchange.Вставить("AbsoluteYearlyRecurrence", НастройкаExchange);
			КонецЕсли;
			// RelativeYearlyRecurrence не обрабатываем
		ИначеЕсли Настройка.ЧастотаПовторения = Перечисления.ЧастотаПовторения.Ежемесячно
				  И ЗначениеЗаполнено(Настройка.ИнтервалПовторения) Тогда
			Если Настройка.ПовторениеПоДням.Количество() <> 0 Тогда
				НастройкаExchange = Новый Соответствие;
				НастройкаExchange.Вставить("Interval", Настройка.ИнтервалПовторения);
				НастройкаExchange.Вставить("DaysOfWeek", 
										   СоответствияДанных.ДниНедели[Настройка.ПовторениеПоДням[0].ДеньНедели]);
				НастройкаExchange.Вставить("DayOfWeekIndex", 
										   СоответствияДанных.Вхождения[Настройка.ПовторениеПоДням[0].НомерВхождения]);
				
				НастройкиExchange.Вставить("RelativeMonthlyRecurrence", НастройкаExchange);
			ИначеЕсли ЗначениеЗаполнено(Настройка.ПовторениеПоДнямМесяца) Тогда
				НастройкаExchange = Новый Соответствие;
				НастройкаExchange.Вставить("Interval", Настройка.ИнтервалПовторения);
				НастройкаExchange.Вставить("DayOfMonth", Настройка.ПовторениеПоДнямМесяца);
				
				НастройкиExchange.Вставить("AbsoluteMonthlyRecurrence", НастройкаExchange);
			КонецЕсли;
		ИначеЕсли Настройка.ЧастотаПовторения = Перечисления.ЧастотаПовторения.Еженедельно Тогда
			НастройкаExchange = Новый Соответствие;
			НастройкаExchange.Вставить("Interval", Настройка.ИнтервалПовторения);
			
			ДниНедели = Новый Массив;
			
			Для Каждого Строка Из Настройка.ПовторениеПоДням Цикл
				ДниНедели.Добавить(СоответствияДанных.ДниНедели[Строка.ДеньНедели]);
			КонецЦикла;
			
			НастройкаExchange.Вставить("DaysOfWeek", СтрСоединить(ДниНедели, " "));
			
			НастройкиExchange.Вставить("WeeklyRecurrence", НастройкаExchange);
		ИначеЕсли Настройка.ЧастотаПовторения = Перечисления.ЧастотаПовторения.Ежедневно Тогда
			НастройкаExchange = Новый Соответствие;
			НастройкаExchange.Вставить("Interval", Настройка.ИнтервалПовторения);
			
			НастройкиExchange.Вставить("DailyRecurrence", НастройкаExchange);
		КонецЕсли;
		
		// Окончание повторения
		Если Настройка.ПравилоОкончанияПовторения = Перечисления.ПравилаОкончанияПовторения.Никогда Тогда
			НастройкаExchange = Новый Соответствие;
			НастройкаExchange.Вставить("StartDate", Настройка.ДатаНачалаПовторения);
			
			НастройкиExchange.Вставить("NoEndRecurrence", НастройкаExchange);
		ИначеЕсли Настройка.ПравилоОкончанияПовторения = Перечисления.ПравилаОкончанияПовторения.ДоДаты Тогда
			НастройкаExchange = Новый Соответствие;
			НастройкаExchange.Вставить("StartDate", Настройка.ДатаНачалаПовторения);
			НастройкаExchange.Вставить("EndDate", Настройка.ДатаОкончанияПовторения);
			
			НастройкиExchange.Вставить("EndDateRecurrence", НастройкаExchange);
		ИначеЕсли Настройка.ПравилоОкончанияПовторения = Перечисления.ПравилаОкончанияПовторения.ПослеЧислаПовторов Тогда
			НастройкаExchange = Новый Соответствие;
			НастройкаExchange.Вставить("StartDate", Настройка.ДатаНачалаПовторения);
			НастройкаExchange.Вставить("NumberOfOccurrences", Настройка.КоличествоПовторов);
			
			НастройкиExchange.Вставить("NumberedRecurrence", НастройкаExchange);
		КонецЕсли;
		
		Событие.НастройкиПовторения = НастройкиExchange;
	КонецЦикла;
	
КонецПроцедуры

Функция СоответствияДанныхПовторения(Чтение)

	ДниНедели = Новый Соответствие;
	Вхождения = Новый Соответствие;
	Месяцы = Новый Соответствие;
	
	Если Чтение Тогда
		ДниНедели.Вставить("Monday", 1);
		ДниНедели.Вставить("Tuesday", 2);
		ДниНедели.Вставить("Wednesday", 3);
		ДниНедели.Вставить("Thursday", 4);
		ДниНедели.Вставить("Friday", 5);
		ДниНедели.Вставить("Saturday", 6);
		ДниНедели.Вставить("Sunday", 7);
		
		Вхождения.Вставить("First", 1);
		Вхождения.Вставить("Second", 2);
		Вхождения.Вставить("Third", 3);
		Вхождения.Вставить("Fourth", 4);
		Вхождения.Вставить("Last", -1);
		
		Месяцы.Вставить("January", 1);
		Месяцы.Вставить("February", 2);
		Месяцы.Вставить("March", 3);
		Месяцы.Вставить("April", 4);
		Месяцы.Вставить("May", 5);
		Месяцы.Вставить("June", 6);
		Месяцы.Вставить("July", 7);
		Месяцы.Вставить("August", 8);
		Месяцы.Вставить("September", 9);
		Месяцы.Вставить("October", 10);
		Месяцы.Вставить("November", 11);
		Месяцы.Вставить("December", 12);
	Иначе
		ДниНедели.Вставить(1, "Monday");
		ДниНедели.Вставить(2, "Tuesday");
		ДниНедели.Вставить(3, "Wednesday");
		ДниНедели.Вставить(4, "Thursday");
		ДниНедели.Вставить(5, "Friday");
		ДниНедели.Вставить(6, "Saturday");
		ДниНедели.Вставить(7, "Sunday");
		
		Вхождения.Вставить(1, "First");
		Вхождения.Вставить(2, "Second");
		Вхождения.Вставить(3, "Third");
		Вхождения.Вставить(4, "Fourth");
		Вхождения.Вставить(-1, "Last");
		
		Месяцы.Вставить(1, "January");
		Месяцы.Вставить(2, "February");
		Месяцы.Вставить(3, "March");
		Месяцы.Вставить(4, "April");
		Месяцы.Вставить(5, "May");
		Месяцы.Вставить(6, "June");
		Месяцы.Вставить(7, "July");
		Месяцы.Вставить(8, "August");
		Месяцы.Вставить(9, "September");
		Месяцы.Вставить(10, "October");
		Месяцы.Вставить(11, "November");
		Месяцы.Вставить(12, "December");
	КонецЕсли;
	
	Возврат Новый Структура("ДниНедели, Вхождения, Месяцы", ДниНедели, Вхождения, Месяцы);

КонецФункции

Процедура ЗаполнитьДанныеВхождений(События)

	ИсключенияПовторения = Новый Массив;
	
	Для Каждого Событие Из События Цикл
		Если ЗначениеЗаполнено(Событие.ИдентификаторВладельца)
			 И ЗначениеЗаполнено(Событие.Владелец)
			 И ЗначениеЗаполнено(Событие.ДатаИсключения) Тогда
			НомерВхождения = 0;
			
			Владелец = Событие.Владелец.ПолучитьОбъект();
			
			НомерВхождения = Владелец.НомерВхождения(Событие.ДатаИсключения);
			
			Событие.НомерВхождения = НомерВхождения;
			
			Если Событие.УдалениеИсключенияПовторения Тогда
				Событие.ПометкаУдаления = Истина;
				Событие.ОтпечатокВладельца = "";
				Событие.ОтпечатокОбъекта = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьДоступКСинхронизацииMSExchange()
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюMSExchange")
			И ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиСинхронизацииMSExchange)
			И ПравоДоступа("Чтение", Метаданные.Справочники.СерверыMSExchange);
	
КонецФункции

#Область ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриОпределенииОбработчиковТекущихДел(Обработчики) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюMSExchange") Тогда
		Возврат;
	КонецЕсли;
	
	Обработчики.Добавить(СинхронизацияMSExchange);
	
КонецПроцедуры

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат; // Модель сервиса.
	КонецЕсли;

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюMSExchange") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЕстьДоступКСинхронизацииMSExchange() Тогда
		Возврат;
	КонецЕсли;
	
	МодульТекущиеДелаСервер = ОбщегоНазначения.ОбщийМодуль("ТекущиеДелаСервер");
	Разделы = МодульТекущиеДелаСервер.РазделыДляОбъекта("Справочник.Кандидаты");
	Если Разделы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПриглашений = КоличествоОтклоненныхПриглашений();
	Если КоличествоПриглашений = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Раздел Из Разделы Цикл
		Дело = ТекущиеДела.Добавить();
		Дело.Идентификатор	= "ОтклоненныеПриглашения";
		Дело.ЕстьДела		= Истина;
		Дело.Важное			= Истина;
		Дело.Владелец		= Раздел;
		Дело.Представление	= НСтр("ru = 'Есть отклоненные приглашения на прохождение этапа'");
		Дело.Количество		= КоличествоПриглашений;
		Дело.Форма			= "РегистрСведений.РаботаСКандидатами.Форма.СостояниеПриглашений";
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
