
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если Параметры.Ключ.Пустая() Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	
	ПолучитьЦветаЭтапа();
	УстановитьСвойстваЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьЦветаЭтапа();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьУсловноеОформление");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуПриИзменении(Элемент)
	
	УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуКакВНастройкахПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКандидатовНаЗадержкуКакВКарточкеПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовПриИзменении(Элемент)
	
	УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовКакВНастройкахПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонятьЗадержавшихсяКандидатовКакВКарточкеПриИзменении(Элемент)
	
	ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветТекстаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветТекста);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработчикОповещенияЦветФонаВыборНажатие", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("Цвет", ЦветФона);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораЦветаКорпоративная", ПараметрыОткрытияФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	СброситьЦветТекста();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	СброситьЦветФона();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОчиститьЦвет(Команда)
	
	Модифицированность = Истина;
	СброситьЦветТекста();
	СброситьЦветФона();
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе");
	ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе");
	Если Не ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе И Не ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		Элементы.ГруппаЗадержкаНаЭтапеКандидатов.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПроверятьКандидатовНаЗадержку.Видимость = ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе;
		Элементы.ГруппаОтклонятьЗадержавшихсяКандидатов.Видимость = ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе;
		НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	КонецЕсли;
	
	Если ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		ДнейДоСообщения = НастройкиПодбораПерсонала.ДнейДоСообщения;
		УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(ЭтотОбъект, ТекущийОбъект);
		ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(ЭтотОбъект, ТекущийОбъект)
	КонецЕсли;
	Если ОтклонятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		ДнейДоОтклонения = НастройкиПодбораПерсонала.ДнейДоОтклонения;
		УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект, ТекущийОбъект);
		ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовФормы()
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.ЭтапыРаботыСКандидатами) Тогда
		Элементы.ФормаОчиститьЦвет.Видимость = Ложь;
		Элементы.ЦветТекста.ТолькоПросмотр = Истина;
		Элементы.ЦветФона.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПолучитьЦветаЭтапа()
	
	Если Параметры.Ключ.Пустая() Тогда
		ЦветТекста = WebЦвета.Черный;
		ЦветФона = WebЦвета.Белый;
		Возврат;
	КонецЕсли;
	
	ЦветаЭтапа = РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.
		ЦветаЭтаповРаботыСКандидатами(Объект.Ссылка);
	
	ЦветТекста = ЦветаЭтапа.ЦветТекста;
	ЦветФона = ЦветаЭтапа.ЦветФона;
	
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	Элементы.Наименование.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветТекста()
	
	ЦветТекста = WebЦвета.Черный;
	Элементы.Наименование.ЦветТекста = ЦветТекста;
	
КонецПроцедуры

&НаСервере
Процедура СброситьЦветФона()
	
	ЦветФона = WebЦвета.Белый;
	Элементы.Наименование.ЦветФона = ЦветФона;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветТекстаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЦветТекста = ПолученныйЦвет;
	Элементы.Наименование.ЦветТекста = ПолученныйЦвет;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОповещенияЦветФонаВыборНажатие(ПолученныйЦвет, ДополнительныеПараметры) Экспорт
	
	Если ПолученныйЦвет = Неопределено Или ПолученныйЦвет = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ЦветФона = ПолученныйЦвет;
	Элементы.Наименование.ЦветФона = ПолученныйЦвет;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦветаЭтапа()
	
	РегистрыСведений.ЦветаЭтаповРаботыСКандидатами.ЗаписатьЦвета(Объект.Ссылка, ЦветТекста, ЦветФона);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСпособаПроверкиКандидатовНаЗадержку(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаСпособПроверкиКандидатовНаЗадержку",
		"Доступность",
		Объект.ПроверятьКандидатовНаЗадержку = Истина);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьФормуПоСпособуПроверкиКандидатовНаЗадержку(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ДнейДоСообщенияНаЭтапе",
		"ТолькоПросмотр",
		Объект.СпособПроверкиКандидатовНаЗадержку <>
			ПредопределенноеЗначение("Перечисление.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе"));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваСпособаОтклоненияЗадержавшихсяКандидатов(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ГруппаСпособОтклоненияЗадержавшихсяКандидатов",
		"Доступность",
		Объект.ОтклонятьЗадержавшихсяКандидатов = Истина);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьФормуПоСпособуОтклоненияЗадержавшихсяКандидатов(Форма, Объект = Неопределено)
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ДнейДоОтклоненияНаЭтапе",
		"ТолькоПросмотр",
		Объект.СпособОтклоненияЗадержавшихсяКандидатов <>
			ПредопределенноеЗначение("Перечисление.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе"));
		
КонецПроцедуры

#КонецОбласти
