#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВладелецПароляFTPСервера = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИнтеграцияС1САрхивомПользовательFTP);
	ВладелецПароляВебСервиса = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИмяПользователя1САрхива);
	УстановитьПривилегированныйРежим(Истина);
	ПарольПользователяFTPСервера = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецПароляFTPСервера);
	ПарольПользователяВебСервиса = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВладелецПароляВебСервиса);
	УстановитьПривилегированныйРежим(Ложь);
	
	СписокВыбора = Элементы.ВерсияФорматаОбменаПоддерживаемая1САрхивом.СписокВыбора;
	СписокВыбора.Очистить();
	ДоступныеЗначения = ОбменСАрхивом.ВерсииФорматаДоступные();
	Для Каждого Эл Из ДоступныеЗначения Цикл
		СписокВыбора.Добавить(Эл.Значение, Эл.Представление);
	КонецЦикла;
	ТекущееЗначениеФормата = НаборКонстант.ВерсияФорматаОбменаПоддерживаемая1САрхивом;
	Если ЗначениеЗаполнено(ТекущееЗначениеФормата)
			И СписокВыбора.НайтиПоЗначению(ТекущееЗначениеФормата) = Неопределено Тогда
		ПредставлениеВерсии = ОбменСАрхивом.ПредставлениеВерсииФормата(ТекущееЗначениеФормата);
		СписокВыбора.Вставить(0, ТекущееЗначениеФормата, ПредставлениеВерсии);
	КонецЕсли;
	
	УстановитьОформлениеПолейНастроек();
	
	// Временно недоступная функциональность.
	Элементы.АдресПубликацииРасширеннаяПодсказка.Заголовок = НСтр(
		"ru = 'Используется для скачивания контейнера документов, переданных в 1С:Архив.'");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ВладелецПароляFTPСервера = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИнтеграцияС1САрхивомПользовательFTP);
	ВладелецПароляВебСервиса = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
		Метаданные.Константы.ИмяПользователя1САрхива);
	УстановитьПривилегированныйРежим(Истина);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецПароляFTPСервера, ПарольПользователяFTPСервера);
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецПароляВебСервиса, ПарольПользователяВебСервиса);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НаборКонстант.ИнтеграцияС1САрхивом Тогда
		ПроверитьНастройки(, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнтеграцияС1САрхивомПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТранспортаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытаНастройкаПубликации = Ложь;
	ПараметрыФормы = Новый Структура("ОткрытаНастройкаПубликации, Настройки",
		ОткрытаНастройкаПубликации, НастройкиТранспорта());
	ЗавершениеНастройки = Новый ОписаниеОповещения("ЗавершениеНастройки", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.НастройкаИнтеграцииС1САрхивом.Форма.НастройкаТранспортаИнтеграцииС1САрхивом",
		ПараметрыФормы, ЭтотОбъект,,,, ЗавершениеНастройки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидТранспортаОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОчиститьВидТранспорта();
	УстановитьОформлениеПолейНастроек();

КонецПроцедуры

&НаКлиенте
Процедура АдресПубликации1САрхиваНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытаНастройкаПубликации = Истина;
	ПараметрыФормы = Новый Структура("ОткрытаНастройкаПубликации, Настройки",
		ОткрытаНастройкаПубликации, НастройкиТранспорта());
	ЗавершениеНастройки = Новый ОписаниеОповещения("ЗавершениеНастройки", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.НастройкаИнтеграцииС1САрхивом.Форма.НастройкаТранспортаИнтеграцииС1САрхивом",
		ПараметрыФормы, ЭтотОбъект,,,, ЗавершениеНастройки, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПубликации1САрхиваОчистка(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ОчиститьНастройкиВебСервера();
	УстановитьОформлениеПолейНастроек();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.ГруппаОсновное.Доступность = НаборКонстант.ИнтеграцияС1САрхивом;
	Элементы.ГруппаНастроек.Доступность = НаборКонстант.ИнтеграцияС1САрхивом;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройки(ТекстПредупреждения = "", Отказ = Ложь)
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта) Тогда
		ТекстОшибки = НСтр("ru = 'Не выбран ни один из способов обмена'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "ВидТранспорта", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомКодБазы) Тогда
		ТекстОшибки = НСтр("ru = 'Не указан код базы'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКодБазы", Отказ);
	КонецЕсли;
	
	ВидыТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом;
	
	Если НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.HTTP Тогда
		
		ЕстьНезаполненныеНастройки = Ложь;
		Если Не ЗначениеЗаполнено(НаборКонстант.АдресПубликации1САрхива) Тогда
			ЕстьНезаполненныеНастройки = Истина;
			ТекстОшибки = НСтр("ru = 'Не указан адрес публикации'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.АдресПубликации1САрхива", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаборКонстант.ИмяПользователя1САрхива) Тогда
			ЕстьНезаполненныеНастройки = Истина;
			ТекстОшибки = НСтр("ru = 'Не указано имя пользователя'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИмяПользователя1САрхива", Отказ);
		КонецЕсли;
		
		Если ЕстьНезаполненныеНастройки Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			АдресПубликации = НаборКонстант.АдресПубликации1САрхива;
			ИмяПользователя = НаборКонстант.ИмяПользователя1САрхива;
			Таймаут = 10;
			ИнтернетПрокси = Неопределено;
			ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
			Определение = Новый WSОпределения(АдресПубликации + "/ws/ArchiveDocuments.1cws?wsdl",
				ИмяПользователя, ПарольПользователяВебСервиса, ИнтернетПрокси, Таймаут, ЗащищенноеСоединение);
			Прокси = Новый WSПрокси(Определение, "http://www.1c.ru/docmng", "ArchiveDocuments", "ArchiveDocumentsSoap",
				ИнтернетПрокси, Таймаут);
			ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
		Исключение
			ТекстОшибки = НСтр("ru = 'Подключение не выполнено. Проверьте адрес, имя пользователя и пароль.'")
				+ Символы.ПС + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.АдресПубликации1САрхива", Отказ);
		КонецПопытки;

	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.ОбщийКаталог Тогда
		
		ЕстьОшибкиКаталогаОбмена = Ложь;
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ЭтоСерверWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
			Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
		
		КаталогИнтеграции = НаборКонстант.ИнтеграцияС1САрхивомКаталог;
		Если Не ЗначениеЗаполнено(КаталогИнтеграции) Тогда
			ЕстьОшибкиКаталогаОбмена = Истина;
			ТекстОшибки = НСтр("ru = 'Не указан каталог обмена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
		ИначеЕсли ЭтоСерверWindows 
			И (Лев(КаталогИнтеграции, 2) <> "\\"
				Или СтрНайти(КаталогИнтеграции, ":") <> 0) Тогда
			ЕстьОшибкиКаталогаОбмена = Истина;
			ТекстОшибки = НСтр("ru = 'Каталог обмена должен быть указан в формате UNC (\\Servername\Resource).'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
		КонецЕсли;
		
		Если Не ЕстьОшибкиКаталогаОбмена Тогда
			КаталогИнтеграцииФайл = Новый Файл(КаталогИнтеграции);
			Если Не КаталогИнтеграцииФайл.Существует() Тогда
				ТекстОшибки = НСтр("ru = 'Каталог не обнаружен'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
			Иначе
				ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.FTPСервер Тогда
		
		ПараметрыFTP = ОбменСАрхивомТранспорт.НовыеПараметрыПодключенияFTP();
		ПараметрыFTP.КаталогFTP = НаборКонстант.ИнтеграцияС1САрхивомАдресFTP;
		ПараметрыFTP.Логин = НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP;
		ПараметрыFTP.Пароль = ПарольПользователяFTPСервера;
		ПараметрыFTP.Порт = НаборКонстант.ИнтеграцияС1САрхивомПортFTP;
		ПараметрыFTP.ПассивноеСоединение = НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP;
		
		ТекстОшибки = ОбменСАрхивомТранспорт.ПроверитьОбменЧерезFTP(ПараметрыFTP);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомАдресFTP", Отказ);
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
		КонецЕсли;
		
	Иначе
		
		ТекстОшибки = НСтр("ru = 'Настройте один из способов обмена'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьВидТранспорта()
	
	НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНастройкиВебСервера()
	
	НаборКонстант.АдресПубликации1САрхива = "";
	НаборКонстант.ИмяПользователя1САрхива = "";
	ПарольПользователяВебСервиса = "";
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОформлениеПолейНастроек()
	
	СтрокаНеНастроено = "";
	ВидТранспорта = СтрокаНеНастроено;
	Элементы.ВидТранспорта.Картинка = Новый Картинка;
	
	Если ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта) Тогда
		Адрес = СтрокаНеНастроено;
		Если НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог Тогда
			Элементы.ВидТранспорта.Картинка = БиблиотекаКартинок.Папка;
			Адрес = НаборКонстант.ИнтеграцияС1САрхивомКаталог;
			ВидТранспорта = СтрШаблон(
				НСтр("ru = ' %1: %2'"), Строка(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта), Адрес);
		ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер Тогда
			Элементы.ВидТранспорта.Картинка = БиблиотекаКартинок.ТранспортFTP;
			Адрес = НаборКонстант.ИнтеграцияС1САрхивомАдресFTP;
			ВидТранспорта = СтрШаблон(
				НСтр("ru = ' %1: %2'"), Строка(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта), Адрес);
		ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом.HTTP Тогда
			Элементы.ВидТранспорта.Картинка = БиблиотекаКартинок.ТранспортHTTP;
			Адрес = НаборКонстант.АдресПубликации1САрхива;
			ВидТранспорта = Строка(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта);
		КонецЕсли;
	КонецЕсли;
		
	АдресПубликации = СтрокаНеНастроено;
	Если ЗначениеЗаполнено(НаборКонстант.АдресПубликации1САрхива) Тогда
		АдресПубликации = Строка(НаборКонстант.АдресПубликации1САрхива);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НастройкиТранспорта()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВидТранспорта", НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта);
	Настройки.Вставить("Каталог", НаборКонстант.ИнтеграцияС1САрхивомКаталог);
	Настройки.Вставить("АдресFTP", НаборКонстант.ИнтеграцияС1САрхивомАдресFTP);
	Настройки.Вставить("ПользовательFTP", НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP);
	Настройки.Вставить("ПортFTP", НаборКонстант.ИнтеграцияС1САрхивомПортFTP);
	Настройки.Вставить("ПассивныйРежимFTP", НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP);
	Настройки.Вставить("АдресHTTP", НаборКонстант.АдресПубликации1САрхива);
	Настройки.Вставить("ПользовательHTTP", НаборКонстант.ИмяПользователя1САрхива);
	Настройки.Вставить("ПарольFTP", ПарольПользователяFTPСервера);
	Настройки.Вставить("ПарольHTTP", ПарольПользователяВебСервиса);
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеНастройки(Настройки, ДополнительныеПараметры) Экспорт
	
	Если Настройки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Настройки.ВидТранспорта;
	НаборКонстант.ИнтеграцияС1САрхивомКаталог = Настройки.Каталог;
	НаборКонстант.ИнтеграцияС1САрхивомАдресFTP = Настройки.АдресFTP;
	НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP = Настройки.ПользовательFTP;
	НаборКонстант.ИнтеграцияС1САрхивомПортFTP = Настройки.ПортFTP;
	НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP = Настройки.ПассивныйРежимFTP;
	НаборКонстант.АдресПубликации1САрхива = Настройки.АдресHTTP;
	НаборКонстант.ИмяПользователя1САрхива = Настройки.ПользовательHTTP;
	ПарольПользователяFTPСервера = Настройки.ПарольFTP;
	ПарольПользователяВебСервиса = Настройки.ПарольHTTP;
	Модифицированность = Истина;
	УстановитьОформлениеПолейНастроек();
	
КонецПроцедуры

#КонецОбласти
