//@strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Отправить очередную порцию данных на сервер.
// 
// Параметры:
//  ИмяФайлаНаСервере - Строка - Имя файла на сервере
//  ДанныеФайла - ДвоичныеДанные - Двоичные данные файла
//  Начало - Число - Начало записи данных файла
Процедура ОтправитьОчереднуюПорцию(ИмяФайлаНаСервере, ДанныеФайла, Начало) Экспорт
	
	ФайлыБТССлужебный.ОтправитьОчереднуюПорцию(ИмяФайлаНаСервере, ДанныеФайла, Начало);
	
КонецПроцедуры

// Проверить, что для возможности загрузки в сервис подходит версия программного интерфейса менеджера сервиса и включена
// аутентификация токеном доступа
//
// Возвращаемое значение:
//  Булево
Функция ДоступнаЗагрузкаВСервис() Экспорт
	
	Возврат ПрограммныйИнтерфейсСервиса.ВерсияExtAPIМенеджераСервиса() >= 27
		И РаботаВМоделиСервиса.АутентификацияТокеномДоступаВнутреннихВызововПрограммногоИнтерфейса();
	
КонецФункции

#КонецОбласти
