#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ДоговорРаботыУслуги);
	
КонецПроцедуры

#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "d42dbfe6-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ДоговорРаботыУслуги);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Справочники.ДоговорРаботыУслугиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ДоговорРаботыУслуги, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОплаченныеДоговоры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПлановыеНачисленияПоДоговорам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УсловияДоговораГПХ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.НачисленияПоДоговорамГПХ, Истина);
	
КонецПроцедуры

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных.
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание = Описание + "
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.Организации
	|Документ.ДоговорРаботыУслуги.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Чтение.Организации
	|Документ.ДоговорРаботыУслуги.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Изменение.Организации";
	
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзменения

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	ДатыЗапретаИзменения.ДобавитьСтроку(
		ИсточникиДанных,
		"Документ.ДоговорРаботыУслуги",
		"ДатаЗапрета",
		"Зарплата",
		"Организация");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
