// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Подписки БСС.
// 
// Возвращаемое значение:
//  См. ИнтеграцияПодсистемБЭД.СобытияБЭД
Функция ПодпискиБСС() Экспорт
	
	Подписки = ИнтеграцияПодсистемБЭД.СобытияБЭД();
	
	//@skip-check bsl-legacy-check-string-literal - ДемоБЭД не содержит БСС
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СервисСверкиРасчетов") Тогда
		Возврат Подписки; // Конфигурация не содержит БСС
	ИначеЕсли Метаданные.ОбщиеМодули.Найти("ИнтеграцияПодсистемБСС") = Неопределено Тогда
		Возврат Подписки; // Версия БСС не поддерживает интеграцию подсистем
	КонецЕсли;
	
	//@skip-check bsl-legacy-check-string-literal - ДемоБЭД не содержит БСС
	МодульИнтеграцияПодсистемБТС = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСС");
	
	//@skip-check dynamic-access-method-not-found - ДемоБЭД не содержит БСС
	МодульИнтеграцияПодсистемБТС.ПриОпределенииПодписокНаСобытияБЭД(Подписки);
	Возврат Подписки;
	
КонецФункции

#КонецОбласти
