// @strict-types

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Синхронизация данных".
// Серверные процедуры, обслуживающие правила регистрации объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// Заполняет настройки обработчиков правил регистрации для объекта метаданных.
// 
// Параметры:
//  Настройки - см. СинхронизацияДанныхЗарплатаКадрыСервер.НоваяТаблицаНастроекОбработчиковПравилРегистрации
//  ОбъектМетаданных - ОбъектМетаданных
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки, ОбъектМетаданных) Экспорт

	Если ПриЗаполненииНастроекЗарплатаКадрыПриложенияБронированиеКомандировок(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыВыплаты(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыКадровыйУчет(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПриложенияОтражениеЗарплатыВБухгалтерскомУчете(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыПерсонифицированныйУчет(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыПособияСоциальногоСтрахования(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПриложенияРасчетЗарплаты(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПриложенияУчетВзносовДокументы(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетНДФЛ(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетНДФЛДокументы(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетСтраховыхВзносов(Настройки, ОбъектМетаданных)
		Или ПриЗаполненииНастроекЗарплатаКадрыПриложенияФизическиеЛица(Настройки, ОбъектМетаданных) Тогда
			
		Возврат;
		
	// ЗарплатаКадрыПодсистемы
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СпособыОкругленияПриРасчетеЗарплаты
		Или ОбъектМетаданных = Метаданные.Справочники.СтатьиРасходовЗарплата
		Или ОбъектМетаданных = Метаданные.Справочники.СтатьиФинансированияЗарплата
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДополнительныеНастройкиЗарплатаКадры
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЗначенияСтроковыхРеквизитов
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.МакетыКомпоновкиДанных Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияРегистрацийВНалоговомОргане Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "СтруктурнаяЕдиница",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиЗарплатаКадры Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СоставДокументовЗарплатаКадры
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ФизическиеЛицаДокументов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументФизическогоЛица",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РегистрацииВОрганеСтатистики Тогда
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоСвойствамПланаОбмена(Настройки,
			СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоОрганизациям,
			"Владелец");
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИспользованиеРегистрацийВОрганеСтатистики Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "СтруктурнаяЕдиница",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	// ЗарплатаКадрыПодсистемы.БанковскиеКарты
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.БанковскиеКартыКонтрагентов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляПодчиненногоСправочника(Настройки,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
			
	// ЗарплатаКадрыПодсистемы.ДоговорыГПХ
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОплаченныеДоговоры
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеНачисленияПоДоговорам
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.УсловияДоговораГПХ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.НачисленияПоДоговорамГПХ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	// ЗарплатаКадрыПодсистемы.ЭДОБЗК
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ДокументЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЗапланированныеДействияСФайламиДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КомментарииФайловДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПодписанныеПечатныеФормы
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПодписиДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.Документы.СогласиеНаПрисоединениеКЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КомментарииФайловДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДокументыЭДОБЗККПересчетуСостояний
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РезультатыПубликацииДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияДокументовЭДОБЗК
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЭлектронныеПодписиЭДОБЗК
		Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	// ЗарплатаКадрыПодсистемы.ПодписиДокументов
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОснованияПолномочийОтветственныхЛиц Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	// ЗарплатаКадрыПодсистемы.Сотрудники
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Сотрудники Тогда

		Настройка = Настройки.Добавить();
		Настройка.ПриОбработкеПослеИзменения = Истина;
		Настройка.ПриОбработкеПередИзменением = Истина;
		Настройка.Модуль = СинхронизацияДанныхЗарплатаКадрыПодсистемы;
		
	// ЗарплатаКадрыПодсистемы.УчетНачисленнойЗарплаты
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыНакопления.НачисленияУдержанияПоСотрудникам
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ОтработанноеВремяПоСотрудникам
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.НачисленияУдержанияПоСотрудникамАвансом
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ОтработанноеВремяПоСотрудникамАвансом Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	// ЗарплатаКадрыПодсистемы.ФизическиеЛица
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛица Тогда

		Настройка = Настройки.Добавить();
		Настройка.ПриОбработкеПослеИзменения = Истина;
		Настройка.ПриОбработкеПередИзменением = Истина;
		Настройка.ПослеОбработки = Истина;
		Настройка.Модуль = СинхронизацияДанныхЗарплатаКадрыПодсистемы;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПередИзменением
Процедура ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта(Объект, Отказ, Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя);
	
	Если ОбъектМетаданных = Метаданные.Справочники.Сотрудники Тогда
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоСотруднику(Объект, Объект, Отказ,
			Параметры);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛица Тогда
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоФизическимЛицам(Объект, Объект,
			Отказ, Параметры);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОтчитывающиесяПоВзносамОрганизации Тогда
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоГоловнымОрганизациям(
			Объект, Объект.ОтчитывающаясяОрганизация, Отказ, Параметры,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные, Истина);
			
	Иначе
		
		Сообщение = СтрШаблон(НСтр("ru = 'Для объекта вида %1 не реализован обработчик.'"),
			ОбъектМетаданных.ПолноеИмя());
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Сообщение,
			"СинхронизацияДанныхЗарплатаКадрыПодсистемы.ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта");
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПослеИзменения
Процедура ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта(Объект, Отказ, Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя);
	
	Если ОбъектМетаданных = Метаданные.Справочники.Сотрудники Тогда
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоСотруднику(Объект, Объект, Отказ,
			Параметры);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛица Тогда
		
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоФизическимЛицам(Объект, Объект,
			Отказ, Параметры);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОтчитывающиесяПоВзносамОрганизации Тогда
	
		СинхронизацияДанныхЗарплатаКадрыСервер.ОграничитьРегистрациюОбъектаОтборомПоГоловнымОрганизациям(
			Объект, Объект.ОтчитывающаясяОрганизация, Отказ, Параметры,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные, Истина);
			
	Иначе
		
		Сообщение = СтрШаблон(НСтр("ru = 'Для объекта вида %1 не реализован обработчик.'"),
			ОбъектМетаданных.ПолноеИмя());
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Сообщение,
			"СинхронизацияДанныхЗарплатаКадрыПодсистемы.ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта");
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПослеОбработки
Процедура ПослеОбработкиПравилаРегистрации(Объект, Отказ, Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя);
	
	Если ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛица Тогда

		СинхронизацияДанныхБЗКПравилаОбъектыСПрисоединеннымиФайлами.ПослеОбработкиПравилаРегистрации(Объект, Отказ,
			Параметры);
	
	Иначе
		
		Сообщение = СтрШаблон(НСтр("ru = 'Для объекта вида %1 не реализован обработчик.'"),
			ОбъектМетаданных.ПолноеИмя());
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, Сообщение,
			"СинхронизацияДанныхЗарплатаКадрыПодсистемы.ПослеОбработкиПравилаРегистрации");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПриложенияФизическиеЛица(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛицаПрисоединенныеФайлы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДокументыФизическихЛиц Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Физлицо");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОбИнвалидностиФизическихЛиц Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо");
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПриложенияУчетВзносовДокументы(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.АктПроверкиСтраховыхВзносов
		Или ОбъектМетаданных = Метаданные.Документы.ПерерасчетСтраховыхВзносов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПриложенияРасчетЗарплаты(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.МинимальнаяОплатаТрудаРФ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиРасчетаЗарплаты
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеАвансыИнтервальный
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеНачисленияИнтервальный Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеАвансы
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеНачисления
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПлановыеУдержания Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПриложенияОтражениеЗарплатыВБухгалтерскомУчете(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.БухучетЗарплатыОрганизаций
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОВзносахВПФР Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.БухучетДоговоровГПХ Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПриложенияБронированиеКомандировок(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.ИзмененияФизическихЛицБронированияКомандировок
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ФизическиеЛицаБронированияКомандировок Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().УправленческиеДанные);
			
		ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиСистемыБронированияКомандировок
			Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиКонтактнойИнформацииФизическихЛицБронированияКомандировок Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().УправленческиеДанные);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПодразделенияБронированияКомандировок Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Подразделение",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().УправленческиеДанные);
	
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыВыплаты(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы
		Или ОбъектМетаданных = 
			Метаданные.Справочники.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы Тогда
					
			ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ЗарплатныеПроекты
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СпособыВыплатыЗарплаты Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВБанк
		Или ОбъектМетаданных = Метаданные.Документы.ВедомостьНаВыплатуЗарплатыВКассу
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников
		Или ОбъектМетаданных = Метаданные.Документы.ПодтверждениеЗачисленияЗарплаты
		Или ОбъектМетаданных = Метаданные.Документы.ПодтверждениеОткрытияЛицевыхСчетовСотрудников Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОплатаВедомостейНаВыплатуЗарплаты
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.БухгалтерскиеВзаиморасчетыССотрудниками
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ВзаиморасчетыССотрудниками
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ЗарплатаКВыплате
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ЗарплатаКВыплатеАвансом Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПлатежныеДокументыПеречисленияЗарплаты Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Ведомость",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.РеквизитыПлатежныхДокументовПеречисленияЗарплаты Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ПлатежныйДокумент",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияДокументовЗачисленияЗарплаты Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументЗачисленияЗарплаты",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияДокументовОткрытияЛицевыхСчетов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументОткрытияЛицевыхСчетов",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыКадровыйУчет(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных =
		Метаданные.Справочники.ЗаявленияОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельностиПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РегистрацияТрудовойДеятельностиПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.СведенияОТрудовойДеятельностиРаботникаСТД_РПрисоединенныеФайлы Тогда
		
			ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ТрудовыеФункции
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ИдентификаторыДокументовНаРаботаРоссии
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиЭлектронныхТрудовыхКнижек
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПредставленияОснованийУвольнения Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЗаявленияОПредоставленииСведенийОТрудовойДеятельности
		Или ОбъектМетаданных = Метаданные.Документы.ОтзывЗаявленийОПредоставленииСведенийОТрудовойДеятельности
		Или ОбъектМетаданных = Метаданные.Документы.РегистрацияТрудовойДеятельности
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОТрудовойДеятельностиРаботникаСТД_Р Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ВидыЗанятостиСотрудников
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ТекущиеКадровыеДанныеСотрудников Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Сотрудник");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ГражданствоФизическихЛиц
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ФИОФизическихЛиц Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗаявленияОВеденииТрудовыхКнижек
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЗаявленияОВеденииТрудовыхКнижекОтозванные
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЗаявленияОВеденииТрудовыхКнижекПереданные
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.МероприятияТрудовойДеятельности
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.МероприятияТрудовойДеятельностиПереданные
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.КадроваяИсторияСотрудников Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки,
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().ОбщиеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.МероприятияТрудовойДеятельностиПрочие Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Организация",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ТекущаяТарифнаяСтавкаСотрудников Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Сотрудник",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыПерсонифицированныйУчет(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.КомплектыОтчетностиПерсУчетаПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОписьОДВ_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОписьПачекСЗВ_6ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовАДВ_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовАДВ_2ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовАДВ_3ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовДСВ_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСЗВ_6_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСЗВ_6_3ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСЗВ_6_4ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСЗВ_КПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСПВ_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаДокументовСПВ_2ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПачкаРазделов6РасчетаРСВ_1ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РеестрДСВ_3ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РеестрСЗВ_6_2ПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияОЗастрахованныхЛицахСЗВ_МПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТДПрисоединенныеФайлы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК
		Или ОбъектМетаданных = Метаданные.Справочники.ЗамещениеГосударственныхМуниципальныхДолжностейПФР
		Или ОбъектМетаданных = Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсии
		Или ОбъектМетаданных = Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК
		Или ОбъектМетаданных = Метаданные.Справочники.ОснованияИсчисляемогоСтраховогоСтажа
		Или ОбъектМетаданных = Метаданные.Справочники.ОсобыеУсловияТрудаДляСЗВКПФР
		Или ОбъектМетаданных = Метаданные.Справочники.ОсобыеУсловияТрудаПФР
		Или ОбъектМетаданных = Метаданные.Справочники.ПараметрыИсчисляемогоСтраховогоСтажа
		Или ОбъектМетаданных = Метаданные.Справочники.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДатыВступленияВСилуНА
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДопустимыеСочетанияКодовГруппСтажа
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиПроверкиОтчетностиПерсУчета Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.КомплектыОтчетностиПерсУчета
		Или ОбъектМетаданных = Метаданные.Документы.ВедомостьУплатыАДВ_11
		Или ОбъектМетаданных = Метаданные.Документы.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР
		Или ОбъектМетаданных = Метаданные.Документы.ОписьОДВ_1
		Или ОбъектМетаданных = Метаданные.Документы.ОписьПачекСЗВ_6
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовАДВ_1
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовАДВ_2
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовАДВ_3
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовДСВ_1
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСЗВ_6_1
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСЗВ_6_3
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСЗВ_6_4
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСЗВ_К
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСПВ_1
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаДокументовСПВ_2
		Или ОбъектМетаданных = Метаданные.Документы.ПачкаРазделов6РасчетаРСВ_1
		Или ОбъектМетаданных = Метаданные.Документы.РеестрДСВ_3
		Или ОбъектМетаданных = Метаданные.Документы.РеестрСЗВ_6_2
		Или ОбъектМетаданных = Метаданные.Документы.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОЗастрахованныхЛицахСЗВ_М
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных =
		Метаданные.РегистрыСведений.ЗаписиОСтажеСведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументОснование",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияРегистрацийВОрганеПФР
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КорректирующиеФормыРСВ_1 Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПараметрыПериодовСтажаПФР
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПериодыСтажаПФР Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПодразделенияЗаПределамиРФ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "Подразделение",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ТерриториальныеУсловияДополнительныеПФР
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ТерриториальныеУсловияПФР Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "СтруктурнаяЕдиница",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыНакопления.СтраховыеВзносыПереданныеВПФР Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыПособияСоциальногоСтрахования(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.ВозмещениеБольничныхВЧастиФБПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ДополнительныеСведенияДляОплатыОтпускаСФРПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗапросСреднегоЗаработкаСЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗапросНедостающихСведенийПособияСФРПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ИзвещениеФССПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ИсходящееСообщениеОСтраховомСлучаеФССПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.НесоответствиеСведенийОЗастрахованномЛицеСЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ВходящийЗапросФССДляРасчетаПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ДанныеСФРДляРасчетаПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОтветНаЗапросРеквизитовДляВыплатыПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОтветНаЗапросФССДляРасчетаПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ОтказВВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияДляОплатыОтпускаСФРПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияОЗастрахованномЛицеФССПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СреднийЗаработокСЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОбОтсутствииОтветаСЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОСтатусеВыплатыПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЗапросСтатусовВыплатыПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СтатусыВыплатыПособияПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОбИзмененииРасчетаПособияПрисоединенныеФайлы Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ВозмещениеБольничныхВЧастиФБ
		Или ОбъектМетаданных = Метаданные.Справочники.МедицинскиеОрганизации
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты
		 Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЗапросРеквизитовДляВыплатыПособия
		Или ОбъектМетаданных = Метаданные.Документы.ДополнительныеСведенияДляОплатыОтпускаСФР
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросСреднегоЗаработкаСЭДО
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявлениеВФССОВозмещенииРасходовНаПогребение
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявлениеСотрудникаНаВыплатуПособия
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросНедостающихСведенийПособияСФР
		Или ОбъектМетаданных = Метаданные.Документы.ИзвещениеФСС
		Или ОбъектМетаданных = Метаданные.Документы.ИсходящаяСправкаОЗаработкеДляРасчетаПособий
		Или ОбъектМетаданных = Метаданные.Документы.ИсходящееСообщениеОСтраховомСлучаеФСС
		Или ОбъектМетаданных = Метаданные.Документы.ОписьЗаявленийСотрудниковНаВыплатуПособий
		Или ОбъектМетаданных = Метаданные.Документы.РеестрДанныхЭЛНЗаполняемыхРаботодателем
		Или ОбъектМетаданных = Метаданные.Документы.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий
		Или ОбъектМетаданных = Метаданные.Документы.ОтветНаЗапросРеквизитовДляВыплатыПособия
		Или ОбъектМетаданных = Метаданные.Документы.ОтветНаЗапросФССДляРасчетаПособия
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОЗастрахованномЛицеФСС
		Или ОбъектМетаданных = Метаданные.Документы.СведенияДляОплатыОтпускаСФР
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиУчетаПособийСоциальногоСтрахования
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиПрямыхВыплатФССОрганизаций Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиПрямыхВыплатФСССотрудников
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиПрямыхВыплатФСССотрудниковПодробности
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьОбработкиКадровыхДанныхФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЗастрахованныеЛицаСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииЗапросовСреднегоЗаработкаСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииИсходящихСообщенийОСтраховыхСлучаяхФСС
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииОтветовНаЗапросыРеквизитовДляВыплатыПособий
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииСведенийДляОплатыОтпускаСФР
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииУведомленийОПрекращенииОтпускаПоУходуЗаРебенком
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СНИЛСВходящихСообщенийСЭДО
		Или ОбъектМетаданных = Метаданные.Документы.ВходящийЗапросФССДляРасчетаПособия
		Или ОбъектМетаданных = Метаданные.Документы.ДанныеСФРДляРасчетаПособия
		Или ОбъектМетаданных = Метаданные.Документы.НесоответствиеСведенийОЗастрахованномЛицеСЭДО
		Или ОбъектМетаданных = Метаданные.Документы.СреднийЗаработокСЭДО
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОбОтсутствииОтветаСЭДО
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОСтатусеВыплатыПособия
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОбИзмененииРасчетаПособия
		Или ОбъектМетаданных = Метаданные.Документы.ЗапросСтатусовВыплатыПособия
		Или ОбъектМетаданных = Метаданные.Документы.СтатусыВыплатыПособия Тогда
		
		ИменаРеквизитов = Новый Структура("ГоловнаяОрганизация, ФизическоеЛицо", "ГоловнаяОрганизация", "ФизическоеЛицо");
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки, , ИменаРеквизитов);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.РегистрацияСведенийОЗастрахованномЛицеФСС Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
			Метаданные.Документы.РегистрацияСведенийОЗастрахованномЛицеФСС.Реквизиты.ДокументОснование,
			"РегламентированныеДанные");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ОтказВВозмещенииВыплатРодителямДетейИнвалидов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОграниченияПоРеквизиту(Настройки,
			Метаданные.Документы.ОтказВВозмещенииВыплатРодителямДетейИнвалидов.Реквизиты.ВходящееЗаявление,
			"РегламентированныеДанные");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииЗапросовСтатусовВыплатыПособий
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РегистрацииЗаявленийОВозмещенииВыплатРодителямДетейИнвалидов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, 
			"Страхователь",
			"РегламентированныеДанные");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОбЭЛН Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, 
			"Организация",
			"РегламентированныеДанные");
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СреднийЗаработокОбщийСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СреднийЗаработокСтрахователейСЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ПособияПоСоциальномуСтрахованию
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ПособияПоУходуЗаРебенком Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетНДФЛ(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.РегистрыСведений.ВычетыПоДоходамНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РазмерВычетовНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РедактируемыеРеквизитыКодаДоходаНДФЛ 
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РедактируемыеРеквизитыВидаВычетаНДФЛ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ОперацияНалоговогоУчетаПоНДФЛ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ВычетыПредыдущегоМестаРаботыНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДокументыУчтенныеПриРасчетеНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДоходыПредыдущегоМестаРаботыНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПрименениеСтандартныхВычетовПоНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.РеквизитыУведомленияИФНСНаЗачетАвансовыхПлатежей
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.АвансовыеПлатежиИностранцевПоНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ИмущественныеВычетыНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.НДФЛКПеречислению
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.НДФЛПеречисленный
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.СведенияОДоходахНДФЛ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СтандартныеВычетыНаДетейНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СтандартныеВычетыФизическихЛицНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.УчетнаяПолитикаПоНДФЛ Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ГоловнаяОрганизация",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетНДФЛДокументы(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ВозвратНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных =
			Метаданные.Справочники.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПерерасчетНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СведенияОДоходахСотрудникаДляСоцВыплатПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СправкаНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ЕжегодныеСтандартныеВычетыПрисоединенныеФайлы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.АвансовыйПлатежИностранцаПоНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ВозвратНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ПерерасчетНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ПрекращениеСтандартныхВычетовНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.СведенияОДоходахСотрудникаДляСоцВыплат
		Или ОбъектМетаданных = Метаданные.Документы.СправкаНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.СправкиНДФЛДляПередачиВНалоговыйОрган
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ
		Или ОбъектМетаданных = Метаданные.Документы.ЕжегодныеСтандартныеВычеты Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СправкиНДФЛДляИФНССведенияОВычетах
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СправкиНДФЛДляИФНССведенияОДоходах Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ДокументОснование",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПриЗаполненииНастроекЗарплатаКадрыПодсистемыУчетСтраховыхВзносов(Настройки, ОбъектМетаданных)
	
	Результат = Истина;
	
	Если ОбъектМетаданных = Метаданные.Справочники.ВидыДоходовПоСтраховымВзносам
		Или ОбъектМетаданных = Метаданные.Справочники.СамостоятельныеКлассификационныеЕдиницы
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КлассыУсловийТрудаПоДолжностям
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПредельнаяВеличинаБазыСтраховыхВзносов
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СтраховыеВзносыСкидкиКДоходам
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ТарифыСтраховыхВзносов Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.РегистрацияОблагаемойБазыРуководителяПрисоединенныеФайлы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляСправочникаПрисоединенныхФайлов(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ОперацияУчетаПоСтраховымВзносам
		Или ОбъектМетаданных = Метаданные.Документы.РегистрацияОблагаемойБазыРуководителя Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.ИсчисленныеСтраховыеВзносы
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.СведенияОДоходахСтраховыеВзносы Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСГоловнойОрганизациейИФизическимЛицом(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСамостоятельныхКлассификационныхЕдиниц Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "СтруктурнаяЕдиница",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных =
		Метаданные.РегистрыСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиУчетаСтраховыхВзносов
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев Тогда
			
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ГоловнаяОрганизация",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СтатусыЗастрахованныхФизическихЛиц Тогда
		
		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо",
			СинхронизацияДанныхЗарплатаКадрыСервер.ИдентификаторыРазделовДанных().РегламентированныеДанные);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыНакопления.РасчетыСФондамиПоСтраховымВзносам
		Или ОбъектМетаданных = Метаданные.РегистрыНакопления.СтраховыеВзносыПоФизическимЛицам Тогда

		ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОтчитывающиесяПоВзносамОрганизации Тогда

		Настройка = Настройки.Добавить();
		Настройка.ПриОбработкеПослеИзменения = Истина;
		Настройка.ПриОбработкеПередИзменением = Истина;
		Настройка.Модуль = СинхронизацияДанныхЗарплатаКадрыПодсистемы;
		
	Иначе
		
		Результат = Ложь;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
