#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПередИзменением
Процедура ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта(Объект, Отказ, Параметры) Экспорт

	Если Отказ Или Параметры.НеИзменятьТекстЗапроса Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПроцедуры = "СинхронизацияДанныхБЗКОтборПоСвойствамОбъекта.ПриОбработкеПравилаРегистрацииПередИзменениемОбъекта";
	ПроверитьПараметры(Параметры, ИмяПроцедуры);

	СвойстваОбъекта = СтруктураСвойствОбъекта(Параметры.ДополнительныеПараметры.СвойстваОбъекта, ИмяПроцедуры);
	Если ОбщегоНазначения.ЭтоРегистр(Метаданные.НайтиПоПолномуИмени(Параметры.ПРО.ОбъектМетаданныхИмя)) Тогда
		ЗаполнитьЗначенияСвойств(СвойстваОбъекта, Объект);
	Иначе
		СвойстваОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка,
			ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(СвойстваОбъекта));
	КонецЕсли;
	ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, СвойстваОбъекта);
	
КонецПроцедуры

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчикаПриОбработкеПослеИзменения
Процедура ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта(Объект, Отказ, Параметры) Экспорт
	
	Если Отказ Или Параметры.НеИзменятьТекстЗапроса Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПроцедуры = "СинхронизацияДанныхБЗКОтборПоСвойствамОбъекта.ПриОбработкеПравилаРегистрацииПослеИзмененияОбъекта";
	ПроверитьПараметры(Параметры, ИмяПроцедуры);
	
	СвойстваОбъекта = СтруктураСвойствОбъекта(Параметры.ДополнительныеПараметры.СвойстваОбъекта, ИмяПроцедуры);
	ЗаполнитьЗначенияСвойств(СвойстваОбъекта, Объект);
	ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, СвойстваОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПараметры(Параметры, ИмяПроцедуры)
	
	ТекстОшибки = НСтр("ru = 'В параметре Параметры.ДополнительныеПараметры отсутствует свойство ""СвойстваОбъекта""'");
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.ДополнительныеПараметры.Свойство("СвойстваОбъекта"), ТекстОшибки,
		СтрШаблон(НСтр("ru = '%1'"), ИмяПроцедуры));
	
	ТекстОшибки =
		НСтр("ru = 'В параметре Параметры.ДополнительныеПараметры отсутствует свойство ""ВидОтбора""'");
	ОбщегоНазначенияКлиентСервер.Проверить(Параметры.ДополнительныеПараметры.Свойство("ВидОтбора"), ТекстОшибки,
		СтрШаблон(НСтр("ru = '%1'"), ИмяПроцедуры));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(ИмяПроцедуры, "Параметры.ДополнительныеПараметры.СвойстваОбъекта",
		Параметры.ДополнительныеПараметры.СвойстваОбъекта, Новый ОписаниеТипов("Массив,Строка"));
		
КонецПроцедуры

Функция СтруктураСвойствОбъекта(ПараметрСвойстваОбъекта, ИмяПроцедуры)
	
	СвойстваОбъекта = Новый Структура;
	Если ТипЗнч(ПараметрСвойстваОбъекта) = Тип("Массив") Тогда
		Для Каждого СвойствоОбъекта Из ПараметрСвойстваОбъекта Цикл
			Если ТипЗнч(СвойствоОбъекта) = Тип("Строка") Тогда
				СвойстваОбъекта.Вставить(СвойствоОбъекта);
			ИначеЕсли ТипЗнч(СвойствоОбъекта) = Тип("ОбъектМетаданных") Тогда
				СвойстваОбъекта.Вставить(СвойствоОбъекта.Имя);
			Иначе
				ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Некорректное значение %1 в параметре Параметры.ДополнительныеПараметры.СвойстваОбъекта'"),
					СвойствоОбъекта);
				ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки, ИмяПроцедуры);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ПараметрСвойстваОбъекта) = Тип("Строка") Тогда
		СвойстваОбъекта.Вставить(ПараметрСвойстваОбъекта);
	Иначе
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Некорректное значение %1 параметра Параметры.ДополнительныеПараметры.СвойстваОбъекта'"),
			ПараметрСвойстваОбъекта);
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки, ИмяПроцедуры);
	КонецЕсли;
	
	Возврат СвойстваОбъекта;
	
КонецФункции

#Область ДополнениеЗапроса

Процедура ПриОбработкеПравилаРегистрации(Объект, Отказ, Параметры, СвойстваОбъекта)

	ИмяПроцедуры = "СинхронизацияДанныхБЗКОтборПоСвойствамПланаОбмена.ПриОбработкеПравилаРегистрации";
	
	ВидОтбора = Параметры.ДополнительныеПараметры.ВидОтбора;
	
	ОбязательныеУсловия = "[ОбязательныеУсловия]";
	НовыйТекстЗапроса = СтрЗаменить(Параметры.ТекстЗапроса, ОбязательныеУсловия, "");
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(НовыйТекстЗапроса);
	
	Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	
	ПараметрыОтбора = ПараметрыОтбора(Объект, Параметры, Ложь);
	ПараметрыОтбора.Оператор = Оператор;
	ПараметрыОтбора.СвойстваОбъекта = СвойстваОбъекта;
	
	Если ВидОтбора = СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоОрганизациям Тогда
		ПараметрыОтбора.СвойствоПланаОбмена = "Организации";
		ПараметрыОтбора.ТекстШаблонаОтбора = ТекстШаблонаОтбора("ИспользоватьОтборПоОрганизациям", "Организация",
			СвойстваОбъекта);
		ДобавитьОтбор(ПараметрыОтбора);
	ИначеЕсли ВидОтбора = СинхронизацияДанныхЗарплатаКадрыСервер.ВидыОтборовРИБ().ПоПодразделениям Тогда
		ПараметрыОтбора.СвойствоПланаОбмена = "Подразделения";
		ПараметрыОтбора.ТекстШаблонаОтбора = ТекстШаблонаОтбора("ИспользоватьОтборПоПодразделениям", "Подразделение",
			СвойстваОбъекта);
		ДобавитьОтбор(ПараметрыОтбора);
	Иначе
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Неизвестное значение %1 параметра Параметры.ДополнительныеПараметры.ВидОтбора'"), ВидОтбора);
		ОбщегоНазначенияКлиентСервер.Проверить(Ложь, ТекстОшибки, ИмяПроцедуры);
	КонецЕсли;
	
	Если ПараметрыОтбора.ЗапросИзменен Тогда
		ОтборИстина = Оператор.Отбор.Найти("Истина");
		Если Не ПустаяСтрока(ОтборИстина) Тогда
			Оператор.Отбор.Удалить(Оператор.Отбор.Индекс(ОтборИстина));
		КонецЕсли;
		НовыйТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		НовыйТекстЗапроса = НовыйТекстЗапроса + Символы.ПС + "[ОбязательныеУсловия]";
		Параметры.ТекстЗапроса = НовыйТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыОтбора(Объект, Параметры, ЗапросИзменен)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Объект", Объект);
	ПараметрыОтбора.Вставить("Параметры", Параметры);
	ПараметрыОтбора.Вставить("ЗапросИзменен", ЗапросИзменен);
	ПараметрыОтбора.Вставить("Оператор", Неопределено);
	ПараметрыОтбора.Вставить("СвойствоПланаОбмена", "");
	ПараметрыОтбора.Вставить("СвойстваОбъекта", "");
	ПараметрыОтбора.Вставить("ТекстШаблонаОтбора", "");
	
	Возврат ПараметрыОтбора;
	
КонецФункции

Функция ТекстШаблонаОтбора(ИмяРеквизитаИспользоватьОтбор, ИмяРеквизитаОтбора, СвойстваОбъекта)

	ТекстШаблона = "ПланОбменаОсновнаяТаблица." + ИмяРеквизитаИспользоватьОтбор + " = Ложь";
	Для Каждого СвойствоОбъекта Из СвойстваОбъекта Цикл
		ТекстШаблона = ТекстШаблона + " ИЛИ %1." + ИмяРеквизитаОтбора + " = &СвойствоОбъекта_" + СвойствоОбъекта.Ключ; 
	КонецЦикла;
	
	ТекстШаблона = "(" + ТекстШаблона + ")";
	
	Возврат ТекстШаблона;
	
КонецФункции

Процедура ДобавитьОтбор(ПараметрыОтбора)
	
	ИмяПланаОбмена = ПараметрыОтбора.Параметры.ПРО.ИмяПланаОбмена;
	Оператор = ПараметрыОтбора.Оператор;
	
	ПсевдонимТаблицыОтбора = СтрШаблон("%1%2", ИмяПланаОбмена, ПараметрыОтбора.СвойствоПланаОбмена);
	ИсточникОтбора = Оператор.Источники.НайтиПоПсевдониму(ПсевдонимТаблицыОтбора);
	Если ИсточникОтбора = Неопределено Тогда
		ИсточникОтбора = Оператор.Источники.Добавить(СтрШаблон("ПланОбмена.%1.%2", ИмяПланаОбмена,
			ПараметрыОтбора.СвойствоПланаОбмена), ПсевдонимТаблицыОтбора);
		ИсточникОтбора.Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
		ПараметрыОтбора.ЗапросИзменен = Истина;
	КонецЕсли;

	ТекстОтбора = СтрШаблон(ПараметрыОтбора.ТекстШаблонаОтбора, ПсевдонимТаблицыОтбора);
	Отбор = Оператор.Отбор.Найти(ТекстОтбора);
	Если ПустаяСтрока(Отбор) Тогда
		Оператор.Отбор.Добавить(ТекстОтбора);
		ПараметрыОтбора.ЗапросИзменен = Истина;
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыОтбора.Параметры.ПараметрыЗапроса;
	Для Каждого СвойствоОбъекта Из ПараметрыОтбора.СвойстваОбъекта Цикл
		Если Не ПараметрыЗапроса.Свойство(СвойствоОбъекта.Ключ) Тогда
			ПараметрыЗапроса.Вставить(СвойствоОбъекта.Ключ, СвойствоОбъекта.Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
