#Область ПрограммныйИнтерфейс

// Вызывается при открытии формы выбора исполнителя.
//  Позволяет переопределить стандартную форму выбора.
//
// Параметры:
//  ЭлементИсполнитель     - ЭлементФормы - элемент формы, в которой выполняется выбора исполнителя,
//                                который будет указан как владелец формы выбора исполнителя.
//  РеквизитИсполнитель    - СправочникСсылка.Пользователи, СправочникСсылка.РолиИсполнителя
//                         - выбранное ранее значение исполнителя. Используется
//                                для установки текущей строки в форме выбора исполнителя.
//  ТолькоРоли             - Булево - Если Истина, то указывает что для выбора нужно
//                                использовать только роли (без пользователей).
//  ОткрытиеИзФормыШаблона - Булево - Если Истина, то указывает, что выбор осуществляется из формы настройки шаблона
//  Заголовок              - Строка - Заголовок формы выбора, если не заполнено то используется "Выбор исполнителя этапа"
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Неопределено - идентификатор объекта метаданных,
//                                заполняется при выборе исполнителя из форм, содержащих в контексте тип документа
//  СтандартнаяОбработка   - Булево - Если Ложь, то не требуется выводить стандартную форму выбора исполнителя.
//  ПараметрыВыбораИсполнителя - Структура - прочие параметры
//    * ЭтапВыполняетсяНесколькимиИсполнителями - Булево - Признак этапа, выполняемого несколькими исполнителями (групповой этап)
//    * ЭтоВыборИзСпискаИсполнителей - Булево - Истина, если форма открывается из такой же формы из списка исполнителей
//    * ИдентификаторЭтапаКуратора - УникальныйИдентификатор - иденитификатор этапа куратора (для группового этапа)
//    * Исполнители - Массив - Список структур с описанием исполнителей группового этапа
//    * ДоступныеЭтапыКуратора - Массив - Список структур с описанием доступных для выбора этапов кураторов для группового этапа
//
Процедура ПриВыбореИсполнителя(ЭлементИсполнитель, РеквизитИсполнитель, ТолькоРоли, ОткрытиеИзФормыШаблона, Заголовок,
	ИдентификаторДокумента, СтандартнаяОбработка, ПараметрыВыбораИсполнителя) Экспорт
	
КонецПроцедуры

// Вызывается после подготовки данных для электронной подписи документа, но перед вызовом окна подписания
// Позволяет, в частности, переопределить представление подписываемых данных при интерактивном нажатии на гиперссылку в окне подписания
//
// Параметры:
//  Ссылка - ДокументСсылка - ссылка на подписываемый объект
//
//  Шаблон - СправочникСсылка.ШаблоныПроцессов - ссылка на шаблон процесса, согласно которому обрабатывается документ
//
//  ИдентификаторЭтапа - УникальныйИдентификатор - идентификатор этапа шаблона, на котором производится подпись
//
//  ДанныеДляПодписи - Структура - данные для подписи
//       * Данные - адрес временного хранилища с подписываемыми данными
//       * Представление - Ссылка, Строка, Структура - (необязательный)
//                         Структура содержит свойства:
//                              * Значение      - Ссылка, ОписаниеОповещения - для открытия.
//                              * Представление - Строка - представление значения.
//
Процедура ПриПодготовкеДанныхДляПодписиДокумента(Ссылка, Шаблон, ИдентификаторЭтапа, ДанныеДляПодписи) Экспорт
	
КонецПроцедуры

Процедура ПриОткрытииФормыПредварительногоПросмотраРегламентированногоОтчета(Форма, ПараметрыФормы, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПриСохраненииМодификацийВПечатнойФормеРегламентированногоОтчета(Форма, ТекущиеДанныеОтчета) Экспорт
	
КонецПроцедуры

// Вызывается при выполнении задач до начала транзакции и до вызова окна подписания электронной подписью.
// Позволяет приостановить выполнение задач, например, для осуществления асинхронных вызовов, а затем продолжить.
//
// Параметры:
//   Параметры - Структура - служебный параметр со свойствами
//     * Статус - СправочникСсылка.СтатусыДокументов - выбранный результат выполнения задач
//     * Форма - УправляемаяФорма - для доступа к контексту формы
//                  Передается форма списка задач либо форма документа, в зависимости от точки вызова (места нажатия на кнопку выполнения этапа)
//     * ДополнительныйКонтекст - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                  Параметр является глобальным для всех обработчиков, вызываемых в рамках одновременного выполнения нескольких задач (из формы списка задач)
//     * ДанныеДокументов - Массив - список объектов типа Структура со свойствами:
//       * Документ - ДокументСсылка - документ, задача которого выполняется.
//       * Задача - ЗадачаСсылка.ЗадачаПоОбработкеДокумента - выполняемая задача.
//       * Шаблон - СправочникСсылка.ШаблоныПроцессов - шаблон процесса, согласно которому обрабатывается документ
//       * ИдентификаторЭтапа - УникальныйИдентификатор - идентификатор этапа шаблона, задача которого выполняется
//       * ДополнительныеПараметры - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                    Параметр передается между обработчиками в контексте обрабатываемого документа Документ
//       * <остальные свойства> - другие свойства служебные
//     * <остальные свойства> - другие свойства служебные
//   СтандартнаяОбработка - Булево - признак продолжения стандартного выполнения задачи,
//                    следует установить в Ложь при наличии асинхронных вызовов
//   Отказ - Булево - признак отказа от дальнейшего выполнения задач
//   ОписаниеОшибки - Строка -  информация об ошибке, причинах отказа от выполнения задач
//
// ВНИМАНИЕ!
// Если СтандартнаяОбработка = Ложь, то при окончании выполнения кода обработчика необходимо вызвать процедуру
// ПроцессыОбработкиДокументовКлиент.ПродолжитьВыполнениеЗадач(Параметры, Отказ, ОписаниеОшибки) с параметрами:
//   Параметры - Структура - первый входящий параметр процедуры
//   Отказ - Булево - (необязательный) признак отказа от дальнейшего выполнения задач
//   ОписаниеОшибки - Строка - (необязательный) информация об ошибке, причинах отказа от выполнения задач
//
Процедура ПередВыполнениемЗадач(Параметры, Отказ, ОписаниеОшибки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается перед началом выполнения задач
//
// Параметры:
//   Форма - УправляемаяФорма - форма, из которой выполняется задача.
//   Команда - КомандаФормы - выполняемая команда.
//   Источник - ДанныеФормыСтруктура - объект с полем "Ссылка".
//   СтандартнаяОбработка - Булево - признак продолжения стандартного выполнения задачи
Процедура ПередНачаломВыполненияЗадачи(Форма, Команда, Знач Источник, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#Область ИнтеграцияСБЭД

Процедура ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы) Экспорт

КонецПроцедуры	

Процедура ОткрытьТекущиеДелаЭДО() Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыполнитьКомандуКарточкиПроцессаДокумента(Идентификатор, Параметры) Экспорт
	
	Обработчик = Новый ОписаниеОповещения(Идентификатор, ЭтотОбъект, Параметры);
	
	ВыполнитьОбработкуОповещения(Обработчик);
	
КонецПроцедуры

Процедура ПриПодготовкеДанныхДокументов(ДанныеДокументов, ОписаниеОшибки = "") Экспорт
	
КонецПроцедуры

Процедура Подписать(ОписаниеДанных, Форма = Неопределено, ОбработкаРезультата = Неопределено, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ПроверитьПодпись(Оповещение, ИсходныеДанные, Подпись, МенеджерКриптографии = Неопределено, НаДату = Неопределено, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ОткрытьПодпись(ТекущиеДанные, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СохранитьПодпись(АдресПодписи, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Вызывается из формы настроек процессов обработки документов.
Процедура ДополнительныеНастройкиОтображенияДатыПодписания() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеКомандыКарточкиПроцессаДокумента

#КонецОбласти
