#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьПризнакВыплачиваетсяФСССуществующихДокументов(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтпускПоУходуЗаРебенком.Ссылка
	|ИЗ
	|	Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДатыПередачиВыплатыПособий КАК ВТДатыПередачиВыплатыПособий
	|		ПО ОтпускПоУходуЗаРебенком.Организация = ВТДатыПередачиВыплатыПособий.Организация
	|			И (ВТДатыПередачиВыплатыПособий.Дата МЕЖДУ ОтпускПоУходуЗаРебенком.ДатаНачала И ОтпускПоУходуЗаРебенком.ДатаОкончания)
	|			И (ОтпускПоУходуЗаРебенком.ПособиеВыплачиваетсяФСС = ЛОЖЬ)";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Документ = Выборка.Ссылка.ПолучитьОбъект();
			Документ.ОбменДанными.Загрузка = Истина;
			
			Документ.ПособиеВыплачиваетсяФСС = Истина;
			
			Документ.Записать(РежимЗаписиДокумента.Запись);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий

Процедура ПриОпределенииЗапросаРеестраПрямыхВыплатПоПервичнымДокументам(Запрос, Объект, ТаблицаОснований) Экспорт
	
	Если Объект.ВидРеестра = Перечисления.ВидыРеестровСведенийНеобходимыхДляНазначенияИВыплатыПособий.ЕжемесячныеПособияПоУходуЗаРебенком Тогда
		ПриОпределенииЗапросаРеестраПрямыхВыплатПоОтпускамПоУходу(Запрос, ТаблицаОснований);
		
	Иначе
		ПрямыеВыплатыПособийСоциальногоСтрахованияБазовый.ПриОпределенииЗапросаРеестраПрямыхВыплатПоПервичнымДокументам(Запрос, Объект, ТаблицаОснований);
		
		Если Объект.ВидРеестра = Перечисления.ВидыРеестровСведенийНеобходимыхДляНазначенияИВыплатыПособий.ПособияПоНетрудоспособности Тогда
			СхемаЗапроса = Новый СхемаЗапроса;
			СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
			ПоследнийЗапрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
			Оператор = ПоследнийЗапрос.Операторы[0];
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажЛет");
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажМесяцев");
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажДней");
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажРасширенныйЛет");
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажРасширенныйМесяцев");
			Оператор.ВыбираемыеПоля.Добавить("БольничныйЛист.СтажРасширенныйДней");
			Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииФиксируемыхРеквизитовРеестраПрямыхВыплат(ФиксируемыеРеквизиты) Экспорт
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.Путь               = "СведенияНеобходимыеДляНазначенияПособий";
	Шаблон.РеквизитСтроки      = Истина;
	Шаблон.ОснованиеЗаполнения = "ПервичныйДокумент";
	Шаблон.ИмяГруппы           = "ПособияПоНетрудоспособности_Стаж";
	Шаблон.ФиксацияГруппы      = Истина;
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажЛет");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажМесяцев");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажДней");
	
	Шаблон.ИмяГруппы           = "ПособияПоНетрудоспособности_СтажРасширенный";
	Шаблон.ФиксацияГруппы      = Истина;
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажРасширенныйЛет");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажРасширенныйМесяцев");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтажРасширенныйДней");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.Путь                = "СведенияНеобходимыеДляНазначенияПособий";
	Шаблон.РеквизитСтроки      = Истина;
	Шаблон.ОснованиеЗаполнения = "ПервичныйДокумент";
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаРебенкаВыплачиваетсяПособие");
	
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.Путь                = "СведенияНеобходимыеДляНазначенияПособий";
	Шаблон.РеквизитСтроки      = Истина;
	Шаблон.ИмяГруппы           = "ЕжемесячныеПособияПоУходуЗаРебенком";
	Шаблон.ОснованиеЗаполнения = "ПервичныйДокумент";
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОчередностьРожденияРебенка");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаименованиеПодтверждающегоДокумента");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаличиеРешенияСудаОЛишенииПрав");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФинансированиеФедеральнымБюджетом");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОдновременныйУходЗаНесколькимиДетьми");
КонецПроцедуры

#КонецОбласти

#Область ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов

Функция ОбновитьДанныеЗаявленияОВыплатахРодителямДетейИнвалидов(ДокументОбъект, ПараметрыФиксации) Экспорт
	Если ДокументОбъект.Оплаты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("Заполнение") Тогда
		ЕстьИзменения = Ложь;
	Иначе
		Таблица = ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов(ДокументОбъект, Истина);
		Если Таблица = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		Отбор = Новый Структура("ЭтоРасшифровка", Ложь);
		ВторичныеДанные = Таблица.Скопировать(Отбор);
		Отбор.ЭтоРасшифровка = Истина;
		ТаблицаРасшифровок = Таблица.Скопировать(Отбор);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, ВторичныеДанные, "ВТВторичныеДанные", Истина);
		
		ЕстьИзменения = ФиксацияВторичныхДанныхВДокументах.ОбновитьВторичныеДанные(
			МенеджерВременныхТаблиц,
			ДокументОбъект,
			"Оплаты",
			"ВТВторичныеДанные",
			ПараметрыФиксации);
		Если ТаблицаРасшифровок.Количество() > 0 Тогда
			СтрокиРасшифровки = ДокументОбъект.Оплаты.НайтиСтроки(Отбор);
			Для Каждого НайденнаяСтрока Из СтрокиРасшифровки Цикл
				ОтборДобавленныхРасшифровок = Новый Структура("Месяц,ФизическоеЛицо,ДокументОснование");
				ЗаполнитьЗначенияСвойств(ОтборДобавленныхРасшифровок, НайденнаяСтрока);
				СтрокиРасшифровки = ТаблицаРасшифровок.НайтиСтроки(ОтборДобавленныхРасшифровок);
				Если СтрокиРасшифровки.Количество() = 0 Тогда
					// Удалим отсутствующую строку расшифровки.
					ДокументОбъект.Оплаты.Удалить(НайденнаяСтрока);
				Иначе
					// Обновим данные расшифровок.
					ЗаполнитьЗначенияСвойств(НайденнаяСтрока, СтрокиРасшифровки[0]);
					ТаблицаРасшифровок.Удалить(СтрокиРасшифровки[0]);
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтрокаРасшифровки Из ТаблицаРасшифровок Цикл
				ОтборДобавленныхРасшифровок = Новый Структура("Месяц,ФизическоеЛицо");
				ЗаполнитьЗначенияСвойств(ОтборДобавленныхРасшифровок, СтрокаРасшифровки);
				ОтборДобавленныхРасшифровок.Вставить("ДокументОснование",
					Документы.ОплатаДнейУходаЗаДетьмиИнвалидами.ПустаяСсылка());
				НайденныеСтроки = ДокументОбъект.Оплаты.НайтиСтроки(ОтборДобавленныхРасшифровок);
				Если НайденныеСтроки.Количество() > 0 Тогда
					МаксИндекс = 0;
					Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						МаксИндекс = Макс(МаксИндекс, ДокументОбъект.Оплаты.Индекс(НайденнаяСтрока));
					КонецЦикла;
					ЗаполнитьЗначенияСвойств(ДокументОбъект.Оплаты.Вставить(МаксИндекс + 1), СтрокаРасшифровки);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Процедура ОбработкаЗаполненияЗаявленияОВыплатахРодителямДетейИнвалидов(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	Если Не МногофункциональныеДокументыБЗК.ЕстьПравоНаРаздел("Редактирование", "НачисленнаяЗарплата") Тогда
		Возврат;
	КонецЕсли;
	ДокументОбъект.Оплаты.Очистить();
	ДокументОбъект.ФиксацияИзменений.Очистить();
	Таблица = ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов(ДокументОбъект);
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДокументОбъект.Оплаты.Загрузить(Таблица);
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ИсправленныйДокумент) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним фиксированные данные из исправляемого документа.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ЗаявлениеОплаты
		|ГДЕ
		|	ЗаявлениеОплаты.ИдентификаторСтрокиФикс > 0
		|	И ЗаявлениеОплаты.Ссылка = &ИсправленныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ФиксацияИзменений КАК ЗаявлениеФиксацияИзменений
		|ГДЕ
		|	ЗаявлениеФиксацияИзменений.Ссылка = &ИсправленныйДокумент";
	Запрос.УстановитьПараметр("ИсправленныйДокумент", ДокументОбъект.ИсправленныйДокумент);
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаИзмененныхСтрок = Пакет[0].Выбрать();
	ВыборкаИменРеквизитов= Пакет[1].Выбрать();
	ОтборСтрок = Новый Структура("ФизическоеЛицо,Месяц,Ребенок,Документоснование");
	ОтборРеквизитов = Новый Структура("ИдентификаторСтроки");
	Пока ВыборкаИзмененныхСтрок.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрок, ВыборкаИзмененныхСтрок);
		СтрокиОплаты = ДокументОбъект.Оплаты.НайтиСтроки(ОтборСтрок);
		Если СтрокиОплаты.Количество() = 1 Тогда
			ВыборкаИменРеквизитов.Сбросить();
			ОтборРеквизитов.ИдентификаторСтроки = ВыборкаИзмененныхСтрок.ИдентификаторСтрокиФикс;
			СтрокиОплаты[0].ИдентификаторСтрокиФикс = ВыборкаИзмененныхСтрок.ИдентификаторСтрокиФикс;
			Пока ВыборкаИменРеквизитов.НайтиСледующий(ОтборРеквизитов) Цикл
				СтрокиОплаты[0][ВыборкаИменРеквизитов.ИмяРеквизита] = ВыборкаИзмененныхСтрок[ВыборкаИменРеквизитов.ИмяРеквизита];
				ЗаполнитьЗначенияСвойств(ДокументОбъект.ФиксацияИзменений.Добавить(), ВыборкаИменРеквизитов);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьДанныеИсправленийОплатДляВозмещенияВыплатРодителямДетейИнвалидов(СтруктураПараметров) Экспорт
	Если Не МногофункциональныеДокументыБЗК.ЕстьПравоНаРаздел("Редактирование", "НачисленнаяЗарплата") Тогда
		Возврат;
	КонецЕсли;
	ДатаФорм2024 = Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ДатаФорм2024();
	Если ПустаяСтрока(СтруктураПараметров.АдресРасшифровкиИсправлений) Или СтруктураПараметров.Дата < ДатаФорм2024 Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитОтбора = "Заявление";
	НачалоПериода = НачалоГода(СтруктураПараметров.Дата);
	ПустаяСсылка = Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоПериода, -12));
	Запрос.УстановитьПараметр("КонецПериода", КонецГода(НачалоПериода));
	Запрос.УстановитьПараметр("Организации", СтруктураПараметров.Организации);
	Запрос.УстановитьПараметр("Ссылка", ПустаяСсылка);
	Запрос.УстановитьПараметр("ВсеМесяцы", ТаблицаМесяцев(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаФорм2024", ДатаФорм2024);
	Запрос.УстановитьПараметр("ИсправленныйДокумент", Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка());
	Запрос.УстановитьПараметр("ФильтрДокумента", Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка());
	Запрос.Текст = ТекстЗапросаОплат() + ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов() + ТекстЗапросаПоискаИсправленияОплат();
	
	Если СтруктураПараметров.Организации.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Оплаты.Организация В(&Организации)", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (Пособия.Организация В (&Организации))", "");
	КонецЕсли;
	
	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	
	Если ИтоговаяТаблица.Количество() > 0 Тогда
		ЗаявленияКИсправлению = ИтоговаяТаблица.Скопировать(, "Заявление");
		ЗаявленияКИсправлению.Свернуть("Заявление");
		СтруктураПараметров.КоличествоЗаявлений = ЗаявленияКИсправлению.Количество();
	Иначе
		СтруктураПараметров.КоличествоЗаявлений = 0;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ИтоговаяТаблица, СтруктураПараметров.АдресРасшифровкиИсправлений);
КонецПроцедуры

#КонецОбласти

#Область СведенияДляОплатыОтпускаСФР

Функция ОбновитьДанныеСреднегоЗаработкаДляОплатыОтпускаСФР(ДокументОбъект, ПараметрыФиксации) Экспорт
	ЕстьИзменения = Ложь;
	Если ДокументОбъект.Отпуск.Пустая() Тогда
		Возврат ЕстьИзменения;
	КонецЕсли;
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("Заполнение") Тогда
		ЗаполнитьДанныеСреднегоЗаработкаДляОплатыОтпускаСФР(ДокументОбъект, ПараметрыФиксации);
		ЕстьИзменения = Истина;
		Возврат ЕстьИзменения;
	КонецЕсли;
	
	Данные = ДанныеСведенийДляОплатыОтпускаСФР(ДокументОбъект);

	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(МенеджерВременныхТаблиц, Данные.СреднийЗаработок, "ВТВторичныеДанные", Истина);
	ЕстьИзменения = ФиксацияВторичныхДанныхВДокументах.ОбновитьВторичныеДанные(
		МенеджерВременныхТаблиц, ДокументОбъект, "СреднийЗаработок", "ВТВторичныеДанные", ПараметрыФиксации);
	Данные.Удалить("СреднийЗаработок");

	Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Данные, ДокументОбъект, ПараметрыФиксации) Тогда
		ЕстьИзменения = Истина;
	КонецЕсли;
	
	Возврат ЕстьИзменения;
КонецФункции

Процедура ЗаполнитьДанныеСреднегоЗаработкаДляОплатыОтпускаСФР(ДокументОбъект, ПараметрыФиксации) Экспорт
	ДокументОбъект.СреднийЗаработок.Очистить();
	ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюРеквизитовШапки(ДокументОбъект,
		"СуммаПремии,СуммаКВыплате,СреднийДневнойЗаработок,ЗаработокВключаяПремию");
	ФиксацияВторичныхДанныхВДокументах.ОтменитьФиксациюТабличнойЧасти(ДокументОбъект, "СреднийЗаработок");
	Данные = ДанныеСведенийДляОплатыОтпускаСФР(ДокументОбъект);
	ДокументОбъект.СреднийЗаработок.Загрузить(Данные.СреднийЗаработок);
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Данные, , "СреднийЗаработок");
КонецПроцедуры

#КонецОбласти

Процедура ПриОпределенииСвойствПособийФСС(ВидПособияФСС, ПервичныйДокумент, Результат, СтандартнаяОбработка) Экспорт
	
	ОпределитьПоТипу = Не ЗначениеЗаполнено(ВидПособияФСС) И ЗначениеЗаполнено(ПервичныйДокумент);
	
	Если ?(ОпределитьПоТипу,
			ТипЗнч(ПервичныйДокумент) = Тип("ДокументСсылка.ОтпускПоУходуЗаРебенком"),
			ВидПособияФСС = Перечисления.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Результат.ЗаголовокПоля = НСтр("ru = 'Отпуск по уходу'");
		Результат.ОписаниеТипов = Новый ОписаниеТипов("ДокументСсылка.ОтпускПоУходуЗаРебенком");
		Результат.ОтбиратьПоСотруднику = Ложь;
		Результат.ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПособиеВыплачиваетсяФСС", Истина));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов

Функция ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов(Документ, ОбновитьДанные = Ложь)
	ИспользуетсяФорма2024 = (Документ.Дата >= Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ДатаФорм2024());
	Если ИспользуетсяФорма2024 Тогда // Поле "Год" видно и требуется заполнить.
		Возврат ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов_2024(Документ, ОбновитьДанные);
	Иначе
		Возврат ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов_2022(Документ);
	КонецЕсли;
КонецФункции

Функция ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов_2022(Документ)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Документ.Организация);
	Запрос.УстановитьПараметр("Ссылка",      Документ.Ссылка);
	
	// Получаются данные документов ОплатаДнейУходаЗаДетьмиИнвалидами
	// по которым еще не было документов ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов,
	// либо которые выбраны в текущем документе ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаШапка.Ссылка КАК Ссылка,
	|	ОплатаШапка.Сотрудник КАК Сотрудник,
	|	ОплатаШапка.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОплатаШапка.ПериодРегистрации КАК ПериодРегистрации,
	|	ОплатаШапка.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
	|	ОплатаШапка.СохраняемоеДенежноеСодержание КАК СохраняемоеДенежноеСодержание,
	|	ОплатаШапка.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
	|	ОплатаШапка.СреднийЗаработок КАК СреднийЗаработок,
	|	ОплатаШапка.Начислено КАК Начислено,
	|	ОплатаШапка.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК ОплатаШапка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ЗаявленияОплат
	|		ПО ОплатаШапка.Ссылка = ЗаявленияОплат.ДокументОснование
	|ГДЕ
	|	ОплатаШапка.Организация = &Организация
	|	И ЕСТЬNULL(ЗаявленияОплат.Ссылка, &Ссылка) = &Ссылка
	|	И ОплатаШапка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументы.Ссылка КАК Ссылка,
	|	ВТДокументы.Сотрудник КАК Сотрудник,
	|	ВТДокументы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТДокументы.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
	|	ОплатаНачисления.ДатаНачала КАК ДатаНачала,
	|	ОплатаНачисления.НормаДней КАК НормаДней,
	|	НАЧАЛОПЕРИОДА(ОплатаНачисления.ДатаНачала, МЕСЯЦ) КАК Месяц,
	|	СУММА(ОплатаНачисления.Результат) КАК Начислено,
	|	СУММА(ОплатаНачисления.ОтработаноДней) КАК ОтработаноДней
	|ПОМЕСТИТЬ ВТНачисления
	|ИЗ
	|	ВТДокументы КАК ВТДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Начисления КАК ОплатаНачисления
	|		ПО ВТДокументы.Ссылка = ОплатаНачисления.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументы.Ссылка,
	|	ВТДокументы.Сотрудник,
	|	ВТДокументы.ФизическоеЛицо,
	|	ВТДокументы.РасчетДенежногоСодержания,
	|	ОплатаНачисления.ДатаНачала,
	|	ОплатаНачисления.НормаДней,
	|	НАЧАЛОПЕРИОДА(ОплатаНачисления.ДатаНачала, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисления.Ссылка КАК Ссылка,
	|	ВТНачисления.НормаДней КАК НормаДней
	|ПОМЕСТИТЬ ВТНормыДнейДенежногоСодержания
	|ИЗ
	|	ВТНачисления КАК ВТНачисления
	|ГДЕ
	|	ВТНачисления.РасчетДенежногоСодержания
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисления.Ссылка,
	|	ВТНачисления.НормаДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисления.Ссылка КАК Ссылка,
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНачисления.Месяц КАК Месяц,
	|	ВТНачисления.ДатаНачала КАК ДатаНачала,
	|	СУММА(ВТНачисления.Начислено) КАК Начислено,
	|	СУММА(ВТНачисления.ОтработаноДней) КАК ОтработаноДней
	|ПОМЕСТИТЬ ВТНачисленияПоДатамНачала
	|ИЗ
	|	ВТНачисления КАК ВТНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисления.Ссылка,
	|	ВТНачисления.Сотрудник,
	|	ВТНачисления.ФизическоеЛицо,
	|	ВТНачисления.Месяц,
	|	ВТНачисления.ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисления.Ссылка КАК Ссылка,
	|	ВТНачисления.Сотрудник КАК Сотрудник,
	|	ВТНачисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНачисления.Месяц КАК Месяц,
	|	СУММА(ВТНачисления.Начислено) КАК Начислено,
	|	СУММА(ВТНачисления.ОтработаноДней) КАК ОтработаноДней
	|ПОМЕСТИТЬ ВТНачисленияПоМесяцам
	|ИЗ
	|	ВТНачисления КАК ВТНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисления.Ссылка,
	|	ВТНачисления.Сотрудник,
	|	ВТНачисления.ФизическоеЛицо,
	|	ВТНачисления.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНачисленияПоДатамНачала.Ссылка КАК Ссылка,
	|	ВТНачисленияПоДатамНачала.Сотрудник КАК Сотрудник,
	|	ВТНачисленияПоДатамНачала.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТНачисленияПоДатамНачала.Месяц КАК Месяц,
	|	СУММА(ВЫБОР
	|			КОГДА Пособия.СуммаВсего ЕСТЬ NULL
	|				ТОГДА 0
	|			КОГДА Пособия.Сторно
	|				ТОГДА -Пособия.СуммаВсего
	|			ИНАЧЕ Пособия.СуммаВсего
	|		КОНЕЦ) КАК СуммаВзносовДоступная
	|ПОМЕСТИТЬ втСуммыВзносовДоступные
	|ИЗ
	|	ВТНачисленияПоДатамНачала КАК ВТНачисленияПоДатамНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПособияПоСоциальномуСтрахованию КАК Пособия
	|		ПО ВТНачисленияПоДатамНачала.ФизическоеЛицо = Пособия.ФизическоеЛицо
	|			И ВТНачисленияПоДатамНачала.ДатаНачала = Пособия.ДатаСтраховогоСлучая
	|			И (Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ПереченьПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами))
	|			И (Пособия.Организация = &Организация)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНачисленияПоДатамНачала.Ссылка,
	|	ВТНачисленияПоДатамНачала.Сотрудник,
	|	ВТНачисленияПоДатамНачала.ФизическоеЛицо,
	|	ВТНачисленияПоДатамНачала.Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументы.Ссылка КАК Ссылка,
	|	ВТДокументы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, МЕСЯЦ) КАК Месяц,
	|	СУММА(ОплатыДругихЗаявлений.СуммаВзносов) КАК СуммаВзносовУчтенная
	|ПОМЕСТИТЬ втСуммыВзносовУчтенные
	|ИЗ
	|	ВТДокументы КАК ВТДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ОплатыДругихЗаявлений
	|		ПО ВТДокументы.Ссылка = ОплатыДругихЗаявлений.ДокументОснование
	|			И ВТДокументы.Сотрудник = ОплатыДругихЗаявлений.Сотрудник
	|			И (ОплатыДругихЗаявлений.Ссылка.Проведен)
	|			И (ОплатыДругихЗаявлений.Ссылка <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТДокументы.Ссылка,
	|	ВТДокументы.ФизическоеЛицо,
	|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументы.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА ВТДокументы.РасчетДенежногоСодержания
	|				И ЕСТЬNULL(ВТНормыДнейДенежногоСодержания.НормаДней, 0) > 0
	|			ТОГДА ВТДокументы.СохраняемоеДенежноеСодержание / ВТНормыДнейДенежногоСодержания.НормаДней
	|		КОГДА ВТДокументы.СреднедневнойЗаработок > 0
	|			ТОГДА ВТДокументы.СреднедневнойЗаработок
	|		ИНАЧЕ ВТДокументы.СреднийЗаработок
	|	КОНЕЦ КАК СреднедневнойЗаработок,
	|	ВТНачисленияПоМесяцам.Начислено КАК СуммаПособия,
	|	ВЫБОР
	|		КОГДА СуммыВзносовДоступные.СуммаВзносовДоступная >= ЕСТЬNULL(СуммыВзносовУчтенные.СуммаВзносовУчтенная, 0)
	|			ТОГДА СуммыВзносовДоступные.СуммаВзносовДоступная - ЕСТЬNULL(СуммыВзносовУчтенные.СуммаВзносовУчтенная, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВзносов,
	|	ВТДокументы.Ссылка КАК ДокументОснование,
	|	1 КАК КоличествоСтраниц,
	|	ВТНачисленияПоМесяцам.ОтработаноДней КАК КоличествоДней,
	|	ЛОЖЬ КАК ЭтоРасшифровка,
	|	СуммыВзносовДоступные.Месяц КАК Месяц
	|ИЗ
	|	ВТДокументы КАК ВТДокументы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНачисленияПоМесяцам КАК ВТНачисленияПоМесяцам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСуммыВзносовДоступные КАК СуммыВзносовДоступные
	|			ПО ВТНачисленияПоМесяцам.Ссылка = СуммыВзносовДоступные.Ссылка
	|				И ВТНачисленияПоМесяцам.Месяц = СуммыВзносовДоступные.Месяц
	|			ЛЕВОЕ СОЕДИНЕНИЕ втСуммыВзносовУчтенные КАК СуммыВзносовУчтенные
	|			ПО ВТНачисленияПоМесяцам.Ссылка = СуммыВзносовУчтенные.Ссылка
	|				И ВТНачисленияПоМесяцам.Месяц = СуммыВзносовУчтенные.Месяц
	|		ПО ВТДокументы.Ссылка = ВТНачисленияПоМесяцам.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНормыДнейДенежногоСодержания КАК ВТНормыДнейДенежногоСодержания
	|		ПО ВТДокументы.Ссылка = ВТНормыДнейДенежногоСодержания.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Месяц,
	|	Сотрудник";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТаблицаОплатДляВозмещенияВыплатРодителямДетейИнвалидов_2024(Документ, ОбновитьДанные = Ложь)
	ИтоговаяТаблица = Неопределено;
	Если Документ.Год < 2000 Тогда
		Возврат ИтоговаяТаблица;
	КонецЕсли;
	
	НачалоПериода = Дата(Документ.Год, 1, 1);
	Исправление = ЗначениеЗаполнено(Документ.ИсправленныйДокумент);
	Ссылка = ?(ЗначениеЗаполнено(Документ.Ссылка), Документ.Ссылка, Документ.ПолучитьСсылкуНового());
	ДатаФорм2024 = Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ДатаФорм2024();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецГода(НачалоПериода));
	Запрос.УстановитьПараметр("Организации",   ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ.Организация));
	Запрос.УстановитьПараметр("Ссылка",        Ссылка);
	Запрос.УстановитьПараметр("ВсеМесяцы",     ТаблицаМесяцев(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаФорм2024",  ДатаФорм2024);
	Запрос.УстановитьПараметр("ИсправленныйДокумент", Документ.ИсправленныйДокумент);
	Запрос.УстановитьПараметр("ФильтрДокумента",
		?(ОбновитьДанные И Не Документ.Ссылка.Пустая(), Ссылка, Документ.ИсправленныйДокумент));
	// 1. Установить фильтр по исправлению - см. таблицы ФильтрИсправления, ВсеОплатыВключаяСторнированные, ВсеДругиеОплаты.
	// 2. Получить все Оплаты за год - см. таблицы Оплаты (шапка) и НачисленияОплат (таблица начислений).
	// 3. Получить взносы - см. таблицы ВзносыДоступные и ВзносыУчтенные.
	// 4. Получить дни ухода - см. таблицы ДниОплаты, ДниОплатыПоДокументам, НеСгруппированныеДниУхода, ДниУходаПоМесяцам.
	// 5. Свести данные в одну таблицу - см. таблицу ВсеОстаткиОплат.
	// 6. Получить новые оплаты - см. таблицу НовыеОплаты.
	// 7. Если таблица НовыеОплаты содержит данные выполняем заполнение нового документа
	//   или обновление данных - см. ТекстЗапросаЗаполненияЗаявления().
	// 7.1 Получить накопленные дни - см. таблицы с ФлагНакопленияДней по ИтогНакопленныеДни.
	// 7.2 Получить общие данные по совместителям - см. таблицы СуммаПособийПоСовместителям, ОбщиеСтрокиСовместителей.
	// 7.3 Получить приказ для строки совместителей - см. таблицы ДокументыЗаПериодПоСовместителям,
	//   ПоследнийДокументМесяцаПоСовместителям.
	// 7.4 Свести данные в одну таблицу и упорядочить - см итоговая таблица запроса ТекстЗапросаЗаполненияЗаявления().
	// 8 Если таблица НовыеОплаты пустая выполнить поиск исправлений - см. ТекстЗапросаПоискаИсправленияОплат(),
	//   если найдены исправления выбрать первое заявления и заполнить заявления см. ТекстЗапросаЗаполненияЗаявления().
	// 8 Если это Исправление выполнить заполнение заявления - см. ТекстЗапросаЗаполненияЗаявления().
	//   - см. ТекстЗапросаЗаполненияЗаявления().
	
	Запрос.Текст = ТекстЗапросаОплат();
	Если Исправление Или ОбновитьДанные Тогда
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + ТекстЗапросаЗаполненияЗаявления();
	Иначе
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	НовыеОплаты.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	НовыеОплаты КАК НовыеОплаты";
		РезультатПоНовымОплатам = Запрос.Выполнить();
		Если РезультатПоНовымОплатам.Пустой() Тогда
			Запрос.Текст = ТекстЗапросаПоискаИсправленияОплат();
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Возврат ИтоговаяТаблица;
			КонецЕсли;
		Иначе
			Запрос.Текст = ТекстЗапросаЗаполненияЗаявления();
			ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
			УставитьНомерНаПечатьДокументаОплаты(ИтоговаяТаблица);
			Возврат ИтоговаяТаблица;
		КонецЕсли;
		
		// Выберем первое заявление на исправление для автозаполнения.
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.Заявление) Тогда
				Запрос.УстановитьПараметр("ИсправленныйДокумент", Выборка.Заявление);
				Документ.ИсправленныйДокумент = Выборка.Заявление;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = ТекстЗапросаЗаполненияЗаявления();
	КонецЕсли;

	ИтоговаяТаблица = Запрос.Выполнить().Выгрузить();
	УставитьНомерНаПечатьДокументаОплаты(ИтоговаяТаблица);
	
	Возврат ИтоговаяТаблица;
КонецФункции

// Текст запроса, собирает все оплаты и отправленные данные в СФР за год.
//
// Возвращаемое значение:
//    Строка - текст запроса.
//
Функция ТекстЗапросаОплат()
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ребенок КАК Ребенок
		|ПОМЕСТИТЬ ФильтрДокумента
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты
		|ГДЕ
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ссылка = &ФильтрДокумента
		|	И ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СуммаПособия > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.Ссылка КАК Ссылка,
		|	Оплаты.Сотрудник КАК Сотрудник,
		|	Оплаты.Ребенок КАК Ребенок,
		|	Оплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Оплаты.ПериодРегистрации КАК ПериодРегистрации,
		|	Оплаты.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
		|	Оплаты.СохраняемоеДенежноеСодержание КАК СохраняемоеДенежноеСодержание,
		|	Оплаты.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	Оплаты.СреднийЗаработок КАК СреднийЗаработок,
		|	Оплаты.Начислено КАК Начислено,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	МАКСИМУМ(НЕ ИсправлениеОплаты.Ссылка ЕСТЬ NULL) КАК Исправлена,
		|	МАКСИМУМ(НЕ СторнированиеОплаты.Ссылка ЕСТЬ NULL) КАК Сторнирована,
		|	Оплаты.ЭтоСреднечасовойЗаработок КАК ЭтоСреднечасовойЗаработок
		|ПОМЕСТИТЬ ВсеОплатыВключаяСторнированные
		|ИЗ
		|	Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК Оплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК ИсправлениеОплаты
		|		ПО Оплаты.Ссылка = ИсправлениеОплаты.ИсправленныйДокумент
		|			И (ИсправлениеОплаты.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СторнированиеНачислений КАК СторнированиеОплаты
		|		ПО Оплаты.Ссылка = СторнированиеОплаты.СторнируемыйДокумент
		|			И (СторнированиеОплаты.Проведен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ФильтрДокумента КАК ФильтрДокумента
		|		ПО Оплаты.ФизическоеЛицо = ФильтрДокумента.ФизическоеЛицо
		|			И Оплаты.Ребенок = ФильтрДокумента.Ребенок
		|ГДЕ
		|	Оплаты.ДатаНачала <= &КонецПериода
		|	И Оплаты.ДатаОкончания >= &НачалоПериода
		|	И Оплаты.Организация В(&Организации)
		|	И Оплаты.Проведен
		|	И ВЫБОР
		|			КОГДА &ФильтрДокумента = ЗНАЧЕНИЕ(Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ФильтрДокумента.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплаты.Ссылка,
		|	Оплаты.Сотрудник,
		|	Оплаты.Ребенок,
		|	Оплаты.ФизическоеЛицо,
		|	Оплаты.ПериодРегистрации,
		|	Оплаты.РасчетДенежногоСодержания,
		|	Оплаты.СохраняемоеДенежноеСодержание,
		|	Оплаты.СреднедневнойЗаработок,
		|	Оплаты.СреднийЗаработок,
		|	Оплаты.Начислено,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод,
		|	Оплаты.ЭтоСреднечасовойЗаработок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.Ссылка КАК Ссылка,
		|	Оплаты.Сотрудник КАК Сотрудник,
		|	Оплаты.Ребенок КАК Ребенок,
		|	Оплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Оплаты.ПериодРегистрации КАК ПериодРегистрации,
		|	Оплаты.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
		|	Оплаты.СохраняемоеДенежноеСодержание КАК СохраняемоеДенежноеСодержание,
		|	Оплаты.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	Оплаты.СреднийЗаработок КАК СреднийЗаработок,
		|	Оплаты.Начислено КАК Начислено,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	Оплаты.ЭтоСреднечасовойЗаработок КАК ЭтоСреднечасовойЗаработок
		|ПОМЕСТИТЬ Оплаты
		|ИЗ
		|	ВсеОплатыВключаяСторнированные КАК Оплаты
		|ГДЕ
		|	НЕ Оплаты.Исправлена
		|	И НЕ Оплаты.Сторнирована
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Оплаты.Ссылка КАК Ссылка,
		|	Оплаты.Сотрудник КАК Сотрудник,
		|	Оплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Оплаты.Ребенок КАК Ребенок,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	Оплаты.РасчетДенежногоСодержания КАК РасчетДенежногоСодержания,
		|	НачисленияОплат.ДатаНачала КАК ДатаНачала,
		|	НачисленияОплат.НормаДней КАК НормаДней,
		|	НАЧАЛОПЕРИОДА(НачисленияОплат.ДатаНачала, МЕСЯЦ) КАК Месяц,
		|	СУММА(НачисленияОплат.Результат) КАК Начислено,
		|	СУММА(НачисленияОплат.ОплаченоДней) КАК ОплаченоДней,
		|	СУММА(НачисленияОплат.ОплаченоЧасов) КАК ОплаченоЧасов
		|ПОМЕСТИТЬ НачисленияОплат
		|ИЗ
		|	Оплаты КАК Оплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Начисления КАК НачисленияОплат
		|		ПО Оплаты.Ссылка = НачисленияОплат.Ссылка
		|			И (НачисленияОплат.ДатаНачала >= &НачалоПериода)
		|			И (НачисленияОплат.ДатаНачала <= &КонецПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	Оплаты.Ссылка,
		|	Оплаты.Сотрудник,
		|	Оплаты.ФизическоеЛицо,
		|	Оплаты.Ребенок,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод,
		|	Оплаты.РасчетДенежногоСодержания,
		|	НачисленияОплат.ДатаНачала,
		|	НачисленияОплат.НормаДней,
		|	НАЧАЛОПЕРИОДА(НачисленияОплат.ДатаНачала, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеМесяцы.Месяц КАК Месяц
		|ПОМЕСТИТЬ ВсеМесяцы
		|ИЗ
		|	&ВсеМесяцы КАК ВсеМесяцы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияОплат.Ссылка КАК Ссылка,
		|	НачисленияОплат.Сотрудник КАК Сотрудник,
		|	НачисленияОплат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияОплат.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	НачисленияОплат.Месяц КАК Месяц,
		|	СУММА(НачисленияОплат.Начислено) КАК Начислено,
		|	СУММА(НачисленияОплат.ОплаченоДней) КАК ОплаченоДней,
		|	СУММА(НачисленияОплат.ОплаченоЧасов) КАК ОплаченоЧасов
		|ПОМЕСТИТЬ НачисленияПоМесяцам
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияОплат.Ссылка,
		|	НачисленияОплат.Сотрудник,
		|	НачисленияОплат.ФизическоеЛицо,
		|	НачисленияОплат.ИспользоватьОстатокДнейЗаГод,
		|	НачисленияОплат.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(НачисленияОплат.Ссылка) КАК Ссылка,
		|	НачисленияОплат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияОплат.Месяц КАК Месяц,
		|	НачисленияОплат.ДатаНачала КАК ДатаНачала,
		|	НачисленияОплат.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ МаксСсылкиПоДатамНачала
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияОплат.ФизическоеЛицо,
		|	НачисленияОплат.Месяц,
		|	НачисленияОплат.ДатаНачала,
		|	НачисленияОплат.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксСсылкиПоДатамНачала.Ссылка КАК Ссылка,
		|	МаксСсылкиПоДатамНачала.Месяц КАК Месяц,
		|	СУММА(ВЫБОР
		|			КОГДА Пособия.СуммаВсего ЕСТЬ NULL
		|				ТОГДА 0
		|			КОГДА Пособия.Сторно
		|				ТОГДА -Пособия.СуммаВсего
		|			ИНАЧЕ Пособия.СуммаВсего
		|		КОНЕЦ) КАК СуммаВзносовДоступная
		|ПОМЕСТИТЬ ВзносыДоступные
		|ИЗ
		|	МаксСсылкиПоДатамНачала КАК МаксСсылкиПоДатамНачала
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПособияПоСоциальномуСтрахованию КАК Пособия
		|		ПО МаксСсылкиПоДатамНачала.ФизическоеЛицо = Пособия.ФизическоеЛицо
		|			И МаксСсылкиПоДатамНачала.ДатаНачала = Пособия.ДатаСтраховогоСлучая
		|			И (Пособия.ВидПособияСоциальногоСтрахования = ЗНАЧЕНИЕ(Перечисление.ПереченьПособийСоциальногоСтрахования.СтраховыеВзносыПоДопВыходнымПоУходуЗаДетьмиИнвалидами))
		|			И (Пособия.Организация В (&Организации))
		|
		|СГРУППИРОВАТЬ ПО
		|	МаксСсылкиПоДатамНачала.Ссылка,
		|	МаксСсылкиПоДатамНачала.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ Сотрудники
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО НачисленияОплат.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Ссылка,
		|	Сотрудники.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияОплат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НАЧАЛОПЕРИОДА(ОплатаДниУхода.Дата, МЕСЯЦ) КАК Месяц,
		|	НачисленияОплат.Ребенок КАК Ребенок,
		|	ОплатаДниУхода.Дата КАК Дата,
		|	НачисленияОплат.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	НачисленияОплат.Ссылка КАК ДокументОплаты,
		|	СУММА(НачисленияОплат.ОплаченоЧасов) КАК ОплаченоЧасов,
		|	СУММА(НачисленияОплат.ОплаченоДней) КАК ОплаченоДней
		|ПОМЕСТИТЬ ДниОплаты
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ДниУхода КАК ОплатаДниУхода
		|		ПО НачисленияОплат.Ссылка = ОплатаДниУхода.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(ОплатаДниУхода.Дата, МЕСЯЦ),
		|	НачисленияОплат.Ребенок,
		|	ОплатаДниУхода.Дата,
		|	НачисленияОплат.ИспользоватьОстатокДнейЗаГод,
		|	НачисленияОплат.Ссылка,
		|	НачисленияОплат.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДниОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДниОплаты.Месяц КАК Месяц,
		|	ДниОплаты.Ребенок КАК Ребенок,
		|	ДниОплаты.ДокументОплаты КАК ДокументОплаты,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДниОплаты.Дата) КАК КоличествоДней,
		|	ДниОплаты.ОплаченоЧасов КАК ОплаченоЧасов,
		|	ДниОплаты.ОплаченоДней КАК ОплаченоДней
		|ПОМЕСТИТЬ ДниОплатыПоДокументам
		|ИЗ
		|	ДниОплаты КАК ДниОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ДниОплаты.ФизическоеЛицо,
		|	ДниОплаты.Месяц,
		|	ДниОплаты.Ребенок,
		|	ДниОплаты.ДокументОплаты,
		|	ДниОплаты.ОплаченоЧасов,
		|	ДниОплаты.ОплаченоДней
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДниОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДниОплаты.Месяц КАК Месяц,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДниОплаты.Дата) КАК КоличествоДней,
		|	0 КАК КоличесвтоДнейЗаГод,
		|	МАКСИМУМ(ДниОплаты.ОплаченоЧасов) КАК ОплаченоЧасов,
		|	МАКСИМУМ(ДниОплаты.ОплаченоДней) КАК ОплаченоДней,
		|	0 КАК ОплаченоЧасовГод,
		|	0 КАК ОплаченоДнейГод
		|ПОМЕСТИТЬ НеСгруппированныеДниУхода
		|ИЗ
		|	ДниОплаты КАК ДниОплаты
		|ГДЕ
		|	НЕ ДниОплаты.ИспользоватьОстатокДнейЗаГод
		|
		|СГРУППИРОВАТЬ ПО
		|	ДниОплаты.ФизическоеЛицо,
		|	ДниОплаты.Месяц
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДниОплаты.ФизическоеЛицо,
		|	ДниОплаты.Месяц,
		|	0,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДниОплаты.Дата),
		|	0,
		|	0,
		|	МАКСИМУМ(ДниОплаты.ОплаченоЧасов),
		|	МАКСИМУМ(ДниОплаты.ОплаченоДней)
		|ИЗ
		|	ДниОплаты КАК ДниОплаты
		|ГДЕ
		|	ДниОплаты.ИспользоватьОстатокДнейЗаГод
		|
		|СГРУППИРОВАТЬ ПО
		|	ДниОплаты.ФизическоеЛицо,
		|	ДниОплаты.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеСгруппированныеДниУхода.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НеСгруппированныеДниУхода.Месяц КАК Месяц,
		|	СУММА(НеСгруппированныеДниУхода.КоличествоДней) КАК КоличествоДней,
		|	СУММА(НеСгруппированныеДниУхода.КоличесвтоДнейЗаГод) КАК КоличествоДнейЗаГод,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НеСгруппированныеДниУхода.ОплаченоДней > 0
		|				ТОГДА ВЫБОР
		|						КОГДА НеСгруппированныеДниУхода.ОплаченоЧасов / НеСгруппированныеДниУхода.ОплаченоДней > 8
		|							ТОГДА 8
		|						ИНАЧЕ НеСгруппированныеДниУхода.ОплаченоЧасов / НеСгруппированныеДниУхода.ОплаченоДней
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЧасовВДень,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НеСгруппированныеДниУхода.ОплаченоДнейГод > 0
		|				ТОГДА ВЫБОР
		|						КОГДА НеСгруппированныеДниУхода.ОплаченоЧасовГод / НеСгруппированныеДниУхода.ОплаченоДнейГод > 8
		|							ТОГДА 8
		|						ИНАЧЕ НеСгруппированныеДниУхода.ОплаченоЧасовГод / НеСгруппированныеДниУхода.ОплаченоДнейГод
		|					КОНЕЦ
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЧасовВДеньГод
		|ПОМЕСТИТЬ ДниУходаПоМесяцам
		|ИЗ
		|	НеСгруппированныеДниУхода КАК НеСгруппированныеДниУхода
		|
		|СГРУППИРОВАТЬ ПО
		|	НеСгруппированныеДниУхода.ФизическоеЛицо,
		|	НеСгруппированныеДниУхода.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДругиеЗаявления.Ссылка КАК Ссылка,
		|	ДругиеЗаявления.Дата КАК Дата,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОплатыДругихЗаявлений.ДокументОснование КАК ДокументОснование,
		|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, МЕСЯЦ) КАК Месяц,
		|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, ГОД) КАК Год,
		|	ОплатыДругихЗаявлений.СуммаПособия КАК СуммаПособия,
		|	ОплатыДругихЗаявлений.СуммаВзносов КАК СуммаВзносов,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОплатыДругихЗаявлений.КоличествоДней
		|	КОНЕЦ КАК КоличествоДней,
		|	ОплатыДругихЗаявлений.КоличествоЧасовЗаМесяц КАК КоличествоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОплатыДругихЗаявлений.СреднедневнойЗаработок
		|	КОНЕЦ КАК СреднедневнойЗаработок,
		|	ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц КАК НакопленоДнейЗаМесяц,
		|	ОплатыДругихЗаявлений.НакопленоЧасовЗаМесяц КАК НакопленоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА ОплатыДругихЗаявлений.КоличествоДней
		|		ИНАЧЕ ОплатыДругихЗаявлений.КоличествоДнейЗаГод
		|	КОНЕЦ КАК КоличествоДнейЗаГод,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА ОплатыДругихЗаявлений.СреднедневнойЗаработок
		|		ИНАЧЕ ОплатыДругихЗаявлений.СреднедневнойЗаработокЗаГод
		|	КОНЕЦ КАК СреднедневнойЗаработокЗаГод,
		|	ОплатыДругихЗаявлений.КоличествоЧасовЗаГод КАК КоличествоЧасовЗаГод,
		|	ОплатыДругихЗаявлений.Ребенок КАК Ребенок,
		|	ОплатыДругихЗаявлений.ЭтоРасшифровка КАК ЭтоРасшифровка,
		|	ОплатыДругихЗаявлений.ИдентификаторСтрокиФикс КАК ИдентификаторСтрокиФикс
		|ПОМЕСТИТЬ ВсеДругиеОплаты
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ОплатыДругихЗаявлений
		|			ЛЕВОЕ СОЕДИНЕНИЕ ФильтрДокумента КАК ФильтрДокумента
		|			ПО ОплатыДругихЗаявлений.ФизическоеЛицо = ФильтрДокумента.ФизическоеЛицо
		|				И ОплатыДругихЗаявлений.Ребенок = ФильтрДокумента.Ребенок
		|		ПО Сотрудники.Сотрудник = ОплатыДругихЗаявлений.Сотрудник
		|			И (ОплатыДругихЗаявлений.Месяц >= &НачалоПериода)
		|			И (ОплатыДругихЗаявлений.Месяц <= &КонецПериода)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов КАК ДругиеЗаявления
		|		ПО (ОплатыДругихЗаявлений.Ссылка = ДругиеЗаявления.Ссылка)
		|			И (ДругиеЗаявления.Проведен)
		|			И (ДругиеЗаявления.Ссылка <> &Ссылка)
		|			И (НЕ ДругиеЗаявления.Исправлен)
		|			И (ДругиеЗаявления.СтатусДокумента <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявленийИРеестровНаВыплатуПособий.НеПринятФСС))
		|			И (ДругиеЗаявления.СтатусДокумента <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявленийИРеестровНаВыплатуПособий.Аннулирован))
		|			И (ДругиеЗаявления.Ссылка <> &ИсправленныйДокумент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОплатыВключаяСторнированные КАК ШапкаОснования
		|		ПО (ОплатыДругихЗаявлений.ДокументОснование = ШапкаОснования.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ФильтрДокумента = ЗНАЧЕНИЕ(Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ФильтрДокумента.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|		КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДругиеЗаявления.Ссылка,
		|	ДругиеЗаявления.Дата,
		|	Сотрудники.Сотрудник,
		|	Сотрудники.ФизическоеЛицо,
		|	ОплатыДругихЗаявлений.ДокументОснование,
		|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, МЕСЯЦ),
		|	НАЧАЛОПЕРИОДА(ОплатыДругихЗаявлений.Месяц, ГОД),
		|	ОплатыДругихЗаявлений.СуммаПособия,
		|	ОплатыДругихЗаявлений.СуммаВзносов,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОплатыДругихЗаявлений.КоличествоДней
		|	КОНЕЦ,
		|	ОплатыДругихЗаявлений.КоличествоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА 0
		|		ИНАЧЕ ОплатыДругихЗаявлений.СреднедневнойЗаработок
		|	КОНЕЦ,
		|	ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц,
		|	ОплатыДругихЗаявлений.НакопленоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА ОплатыДругихЗаявлений.КоличествоДней
		|		ИНАЧЕ ОплатыДругихЗаявлений.КоличествоДнейЗаГод
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ДругиеЗаявления.Дата < &ДатаФорм2024
		|				И ЕСТЬNULL(ШапкаОснования.ИспользоватьОстатокДнейЗаГод, ЛОЖЬ)
		|				И ОплатыДругихЗаявлений.КоличествоДнейЗаГод = 0
		|				И ОплатыДругихЗаявлений.НакопленоДнейЗаМесяц = 0
		|			ТОГДА ОплатыДругихЗаявлений.СреднедневнойЗаработок
		|		ИНАЧЕ ОплатыДругихЗаявлений.СреднедневнойЗаработокЗаГод
		|	КОНЕЦ,
		|	ОплатыДругихЗаявлений.КоличествоЧасовЗаГод,
		|	ОплатыДругихЗаявлений.Ребенок,
		|	ОплатыДругихЗаявлений.ЭтоРасшифровка,
		|	ОплатыДругихЗаявлений.ИдентификаторСтрокиФикс
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ОплатыДругихЗаявлений
		|			ЛЕВОЕ СОЕДИНЕНИЕ ФильтрДокумента КАК ФильтрИсправления
		|			ПО ОплатыДругихЗаявлений.ФизическоеЛицо = ФильтрИсправления.ФизическоеЛицо
		|				И ОплатыДругихЗаявлений.Ребенок = ФильтрИсправления.Ребенок
		|		ПО Сотрудники.Сотрудник = ОплатыДругихЗаявлений.Сотрудник
		|			И (ОплатыДругихЗаявлений.Месяц >= &НачалоПериода)
		|			И (ОплатыДругихЗаявлений.Месяц <= &КонецПериода)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов КАК ДругиеЗаявления
		|		ПО (ОплатыДругихЗаявлений.Ссылка = ДругиеЗаявления.Ссылка)
		|			И (ДругиеЗаявления.Проведен)
		|			И (ДругиеЗаявления.Ссылка = &ИсправленныйДокумент)
		|			И (ДругиеЗаявления.Исправлен)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОплатыВключаяСторнированные КАК ШапкаОснования
		|		ПО (ОплатыДругихЗаявлений.ДокументОснование = ШапкаОснования.Ссылка)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ФильтрДокумента = ЗНАЧЕНИЕ(Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ФильтрИсправления.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДругиеОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц КАК Месяц,
		|	ВсеДругиеОплаты.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(ВсеДругиеОплаты.КоличествоДнейЗаГод > 0) КАК ИспользованОстаток
		|ПОМЕСТИТЬ ОбработанныеДокументы
		|ИЗ
		|	ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК ОплатаДнейУходаЗаДетьмиИнвалидами
		|		ПО ВсеДругиеОплаты.ДокументОснование = ОплатаДнейУходаЗаДетьмиИнвалидами.ИсправленныйДокумент
		|			И (ОплатаДнейУходаЗаДетьмиИнвалидами.Проведен)
		|ГДЕ
		|	ВсеДругиеОплаты.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ПустаяСсылка)
		|	И ОплатаДнейУходаЗаДетьмиИнвалидами.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДругиеОплаты.ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц,
		|	ВсеДругиеОплаты.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеДругиеОплаты.ДокументОснование КАК ДокументОснование,
		|	ВсеДругиеОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц КАК Месяц,
		|	СУММА(ВсеДругиеОплаты.СуммаВзносов) КАК СуммаВзносовУчтенная
		|ПОМЕСТИТЬ ВзносыУчтенные
		|ИЗ
		|	ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДругиеОплаты.ДокументОснование,
		|	ВсеДругиеОплаты.ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияОплат.Ссылка КАК Ссылка,
		|	МАКСИМУМ(НачисленияОплат.НормаДней) КАК НормаДней
		|ПОМЕСТИТЬ НормыДнейДС
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|ГДЕ
		|	НачисленияОплат.РасчетДенежногоСодержания
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияОплат.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	1 КАК КоличествоСтраниц,
		|	Оплаты.Ссылка КАК ДокументОснование,
		|	Оплаты.Сотрудник КАК Сотрудник,
		|	Оплаты.Ребенок КАК Ребенок,
		|	Оплаты.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	НачисленияПоМесяцам.Месяц КАК Месяц,
		|	ВзносыДоступные.СуммаВзносовДоступная > ЕСТЬNULL(ВзносыУчтенные.СуммаВзносовУчтенная, 0) КАК ИзмененаСуммаВзносов,
		|	ВЫБОР
		|		КОГДА Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		КОГДА Оплаты.РасчетДенежногоСодержания
		|				И ЕСТЬNULL(НормыДнейДС.НормаДней, 0) > 0
		|			ТОГДА Оплаты.СохраняемоеДенежноеСодержание / НормыДнейДС.НормаДней
		|		КОГДА НачисленияПоМесяцам.Начислено > 0
		|				И ДниОплатыПоДокументам.КоличествоДней > 0
		|			ТОГДА НачисленияПоМесяцам.Начислено / ДниОплатыПоДокументам.КоличествоДней
		|		КОГДА Оплаты.СреднедневнойЗаработок > 0
		|			ТОГДА Оплаты.СреднедневнойЗаработок
		|		ИНАЧЕ Оплаты.СреднийЗаработок
		|	КОНЕЦ КАК СреднедневнойЗаработок,
		|	ВЫБОР
		|		КОГДА НЕ Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		КОГДА Оплаты.РасчетДенежногоСодержания
		|				И ЕСТЬNULL(НормыДнейДС.НормаДней, 0) > 0
		|			ТОГДА Оплаты.СохраняемоеДенежноеСодержание / НормыДнейДС.НормаДней
		|		КОГДА НачисленияПоМесяцам.Начислено > 0
		|				И ЕСТЬNULL(ДниОплатыПоДокументам.КоличествоДней, НачисленияПоМесяцам.ОплаченоДней) > 0
		|			ТОГДА НачисленияПоМесяцам.Начислено / ДниОплатыПоДокументам.КоличествоДней
		|		КОГДА Оплаты.СреднедневнойЗаработок > 0
		|			ТОГДА Оплаты.СреднедневнойЗаработок
		|		ИНАЧЕ Оплаты.СреднийЗаработок
		|	КОНЕЦ КАК СреднедневнойЗаработокЗаГод,
		|	НачисленияПоМесяцам.Начислено КАК СуммаПособия,
		|	ВзносыДоступные.СуммаВзносовДоступная КАК СуммаВзносовДоступная,
		|	ЕСТЬNULL(ВзносыУчтенные.СуммаВзносовУчтенная, 0) КАК СуммаВзносовУчтенная,
		|	ВЫБОР
		|		КОГДА Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ ДниОплатыПоДокументам.КоличествоДней
		|	КОНЕЦ КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		КОГДА ДниОплатыПоДокументам.КоличествоДней <> НачисленияПоМесяцам.ОплаченоДней
		|				И НачисленияПоМесяцам.ОплаченоДней > 0
		|			ТОГДА ОКР(НачисленияПоМесяцам.ОплаченоЧасов / НачисленияПоМесяцам.ОплаченоДней * ДниОплатыПоДокументам.КоличествоДней)
		|		ИНАЧЕ НачисленияПоМесяцам.ОплаченоЧасов
		|	КОНЕЦ КАК КоличествоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ДниОплатыПоДокументам.КоличествоДней
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДнейЗаГод,
		|	ВЫБОР
		|		КОГДА Оплаты.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ВЫБОР
		|					КОГДА ДниОплатыПоДокументам.КоличествоДней <> НачисленияПоМесяцам.ОплаченоДней
		|							И НачисленияПоМесяцам.ОплаченоДней > 0
		|						ТОГДА ОКР(НачисленияПоМесяцам.ОплаченоЧасов / НачисленияПоМесяцам.ОплаченоДней * ДниОплатыПоДокументам.КоличествоДней)
		|					ИНАЧЕ НачисленияПоМесяцам.ОплаченоЧасов
		|				КОНЕЦ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЧасовЗаГод,
		|	Оплаты.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ НесгруппированныеОстаткиОплат
		|ИЗ
		|	Оплаты КАК Оплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НачисленияПоМесяцам КАК НачисленияПоМесяцам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВзносыДоступные КАК ВзносыДоступные
		|			ПО НачисленияПоМесяцам.Ссылка = ВзносыДоступные.Ссылка
		|				И НачисленияПоМесяцам.Месяц = ВзносыДоступные.Месяц
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВзносыУчтенные КАК ВзносыУчтенные
		|			ПО НачисленияПоМесяцам.Ссылка = ВзносыУчтенные.ДокументОснование
		|				И НачисленияПоМесяцам.Месяц = ВзносыУчтенные.Месяц
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДниОплатыПоДокументам КАК ДниОплатыПоДокументам
		|			ПО НачисленияПоМесяцам.Ссылка = ДниОплатыПоДокументам.ДокументОплаты
		|				И НачисленияПоМесяцам.Месяц = ДниОплатыПоДокументам.Месяц
		|		ПО Оплаты.Ссылка = НачисленияПоМесяцам.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ НормыДнейДС КАК НормыДнейДС
		|		ПО Оплаты.Ссылка = НормыДнейДС.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(НесгруппированныеОстаткиОплат.КоличествоСтраниц) КАК КоличествоСтраниц,
		|	НесгруппированныеОстаткиОплат.ДокументОснование КАК ДокументОснование,
		|	НесгруппированныеОстаткиОплат.Сотрудник КАК Сотрудник,
		|	НесгруппированныеОстаткиОплат.Ребенок КАК Ребенок,
		|	НесгруппированныеОстаткиОплат.Месяц КАК Месяц,
		|	МАКСИМУМ(НесгруппированныеОстаткиОплат.ИзмененаСуммаВзносов) КАК ИзмененаСуммаВзносов,
		|	МАКСИМУМ(НесгруппированныеОстаткиОплат.ИспользоватьОстатокДнейЗаГод) КАК ИспользоватьОстатокДнейЗаГод,
		|	МАКСИМУМ(ОКР(НесгруппированныеОстаткиОплат.СреднедневнойЗаработок, 2)) КАК СреднедневнойЗаработок,
		|	МАКСИМУМ(ОКР(НесгруппированныеОстаткиОплат.СреднедневнойЗаработокЗаГод, 2)) КАК СреднедневнойЗаработокЗаГод,
		|	МАКСИМУМ(НесгруппированныеОстаткиОплат.СуммаПособия) КАК СуммаПособия,
		|	МАКСИМУМ(НесгруппированныеОстаткиОплат.СуммаВзносовДоступная) КАК СуммаВзносовДоступная,
		|	МАКСИМУМ(НесгруппированныеОстаткиОплат.СуммаВзносовУчтенная) КАК СуммаВзносовУчтенная,
		|	СУММА(НесгруппированныеОстаткиОплат.КоличествоДней) КАК КоличествоДней,
		|	СУММА(НесгруппированныеОстаткиОплат.КоличествоЧасовЗаМесяц) КАК КоличествоЧасовЗаМесяц,
		|	СУММА(НесгруппированныеОстаткиОплат.КоличествоДнейЗаГод) КАК КоличествоДнейЗаГод,
		|	СУММА(НесгруппированныеОстаткиОплат.КоличествоЧасовЗаГод) КАК КоличествоЧасовЗаГод,
		|	НесгруппированныеОстаткиОплат.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВсеОстаткиОплат
		|ИЗ
		|	НесгруппированныеОстаткиОплат КАК НесгруппированныеОстаткиОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	НесгруппированныеОстаткиОплат.ДокументОснование,
		|	НесгруппированныеОстаткиОплат.Сотрудник,
		|	НесгруппированныеОстаткиОплат.Ребенок,
		|	НесгруппированныеОстаткиОплат.Месяц,
		|	НесгруппированныеОстаткиОплат.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.КоличествоСтраниц
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоСтраниц,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.ДокументОснование
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмИинвалидами.ПустаяСсылка)
		|	КОНЕЦ КАК ДокументОснование,
		|	ВсеОстаткиОплат.Сотрудник КАК Сотрудник,
		|	ВсеОстаткиОплат.Ребенок КАК Ребенок,
		|	ВсеОстаткиОплат.Месяц КАК Месяц,
		|	ВсеОстаткиОплат.ИзмененаСуммаВзносов КАК ИзмененаСуммаВзносов,
		|	ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.СреднедневнойЗаработок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СреднедневнойЗаработок,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.СреднедневнойЗаработокЗаГод
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СреднедневнойЗаработокЗаГод,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.СуммаПособия
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПособия,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|				ИЛИ ВсеОстаткиОплат.ИзмененаСуммаВзносов
		|			ТОГДА ВсеОстаткиОплат.СуммаВзносовДоступная
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаВзносов,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.КоличествоДней
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.КоличествоЧасовЗаМесяц
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.КоличествоДнейЗаГод
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДнейЗаГод,
		|	ВЫБОР
		|		КОГДА ОбработанныеДокументы.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА ВсеОстаткиОплат.КоличествоЧасовЗаГод
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЧасовЗаГод,
		|	ВсеОстаткиОплат.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ НовыеОплаты
		|ИЗ
		|	ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОбработанныеДокументы КАК ОбработанныеДокументы
		|		ПО ВсеОстаткиОплат.ФизическоеЛицо = ОбработанныеДокументы.ФизическоеЛицо
		|			И ВсеОстаткиОплат.Месяц = ОбработанныеДокументы.Месяц
		|			И ВсеОстаткиОплат.ДокументОснование = ОбработанныеДокументы.ДокументОснование
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОбработанныеДокументы.ДокументОснование ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод
		|					И НЕ ОбработанныеДокументы.ИспользованОстаток
		|		КОНЕЦ";
	
	Возврат Текст;
КонецФункции

// Текст запроса, заполняет исправление и новые заявления, формирует общие строки по совместителям и накопленные дни.
// Работает по принципу отбора - новые оплаты или данные оплат по ключевым полям (ФизическоеЛицо, Месяц, Ребенок)
// из исправленного заявления.
//
// Возвращаемое значение:
//    Строка - текст запроса.
//
Функция ТекстЗапросаЗаполненияЗаявления()
	Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НовыеОплаты.КоличествоСтраниц КАК КоличествоСтраниц,
		|	НовыеОплаты.ДокументОснование КАК ДокументОснование,
		|	НовыеОплаты.Сотрудник КАК Сотрудник,
		|	НовыеОплаты.Ребенок КАК Ребенок,
		|	НовыеОплаты.Месяц КАК Месяц,
		|	НовыеОплаты.ИзмененаСуммаВзносов КАК ИзмененаСуммаВзносов,
		|	НовыеОплаты.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	НовыеОплаты.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	НовыеОплаты.СреднедневнойЗаработокЗаГод КАК СреднедневнойЗаработокЗаГод,
		|	НовыеОплаты.СуммаПособия КАК СуммаПособия,
		|	НовыеОплаты.СуммаВзносов КАК СуммаВзносов,
		|	НовыеОплаты.КоличествоДней КАК КоличествоДней,
		|	НовыеОплаты.КоличествоЧасовЗаМесяц КАК КоличествоЧасовЗаМесяц,
		|	НовыеОплаты.КоличествоДнейЗаГод КАК КоличествоДнейЗаГод,
		|	НовыеОплаты.КоличествоЧасовЗаГод КАК КоличествоЧасовЗаГод,
		|	НовыеОплаты.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ОплатыКЗаполнению
		|ИЗ
		|	НовыеОплаты КАК НовыеОплаты
		|ГДЕ
		|	&ИсправленныйДокумент = ЗНАЧЕНИЕ(Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеОстаткиОплат.КоличествоСтраниц,
		|	ВсеОстаткиОплат.ДокументОснование,
		|	ВсеОстаткиОплат.Сотрудник,
		|	ВсеОстаткиОплат.Ребенок,
		|	ВсеОстаткиОплат.Месяц,
		|	ВсеОстаткиОплат.ИзмененаСуммаВзносов,
		|	ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод,
		|	ВсеОстаткиОплат.СреднедневнойЗаработок,
		|	ВсеОстаткиОплат.СреднедневнойЗаработокЗаГод,
		|	ВсеОстаткиОплат.СуммаПособия,
		|	ВсеОстаткиОплат.СуммаВзносовДоступная,
		|	ВсеОстаткиОплат.КоличествоДней,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаМесяц,
		|	ВсеОстаткиОплат.КоличествоДнейЗаГод,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаГод,
		|	ВсеОстаткиОплат.ФизическоеЛицо
		|ИЗ
		|	ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты
		|		ПО ВсеОстаткиОплат.ФизическоеЛицо = ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ФизическоеЛицо
		|			И ВсеОстаткиОплат.Месяц = ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Месяц
		|			И ВсеОстаткиОплат.Ребенок = ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ребенок
		|			И (ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СуммаПособия > 0)
		|ГДЕ
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ссылка = &ИсправленныйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеОстаткиОплат.Сотрудник КАК Сотрудник,
		|	&КонецПериода КАК Период
		|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
		|	ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПриема,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости
		|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
		|ИЗ
		|	ВТСотрудники КАК ВТСотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыКЗаполнению.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОплатыКЗаполнению.Месяц КАК Месяц
		|ПОМЕСТИТЬ ФизическиеЛицаСовместителей
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатыКЗаполнению.ФизическоеЛицо,
		|	ОплатыКЗаполнению.Месяц
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОплатыКЗаполнению.Сотрудник) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыКЗаполнению.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МАКСИМУМ(ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод) КАК ИспользоватьОстатокДнейЗаГод
		|ПОМЕСТИТЬ ФлагНакопленияДней
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатыКЗаполнению.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	МАКСИМУМ(ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод) = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НачисленияОплат.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(НачисленияОплат.ДатаНачала) КАК ДатаНачала,
		|	НачисленияОплат.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ МаксДатыНачалаЗаГод
		|ИЗ
		|	НачисленияОплат КАК НачисленияОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияОплат.Сотрудник,
		|	НачисленияОплат.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МаксДатыНачалаЗаГод.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеМесяцы.Месяц КАК Месяц,
		|	ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмИинвалидами.ПустаяСсылка) КАК ДокументОснование,
		|	4 - ЕСТЬNULL(ДниУходаПоМесяцам.КоличествоДней, 0) КАК НакопленоДней,
		|	32 - ОКР(ЕСТЬNULL(ДниУходаПоМесяцам.КоличествоДней * ДниУходаПоМесяцам.ЧасовВДень, 0)) КАК НакопленоЧасов
		|ПОМЕСТИТЬ НакопленныеДниЗаМесяц
		|ИЗ
		|	ВсеМесяцы КАК ВсеМесяцы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксДатыНачалаЗаГод КАК МаксДатыНачалаЗаГод
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|			ПО МаксДатыНачалаЗаГод.ФизическоеЛицо = ОплатыКЗаполнению.ФизическоеЛицо
		|		ПО ВсеМесяцы.Месяц <= МаксДатыНачалаЗаГод.ДатаНачала
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДниУходаПоМесяцам КАК ДниУходаПоМесяцам
		|		ПО ВсеМесяцы.Месяц = ДниУходаПоМесяцам.Месяц
		|			И (МаксДатыНачалаЗаГод.ФизическоеЛицо = ДниУходаПоМесяцам.ФизическоеЛицо)
		|ГДЕ
		|	4 - ЕСТЬNULL(ДниУходаПоМесяцам.КоличествоДней, 0) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредставленияКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	МИНИМУМ(ПредставленияКадровыеДанныеСотрудников.ДатаПриема) КАК ДАТАПРИЕМА,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА ПредставленияКадровыеДанныеСотрудников.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
		|				ТОГДА 1
		|			КОГДА ПредставленияКадровыеДанныеСотрудников.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|				ТОГДА 2
		|			ИНАЧЕ 3
		|		КОНЕЦ) КАК ВидЗанятостиПриоритет
		|ПОМЕСТИТЬ ФильтрПоСотрудникам
		|ИЗ
		|	ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ПредставленияКадровыеДанныеСотрудников.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПредставленияКадровыеДанныеСотрудников.Период КАК Период,
		|	ПредставленияКадровыеДанныеСотрудников.Сотрудник КАК Сотрудник,
		|	ПредставленияКадровыеДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ПредставленияКадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ПредставленияКадровыеДанныеСотрудников.ДатаПриема КАК ДАТАПРИЕМА
		|ПОМЕСТИТЬ ОсновныеСотрудники
		|ИЗ
		|	ПредставленияКадровыеДанныеСотрудников КАК ПредставленияКадровыеДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФильтрПоСотрудникам КАК ФильтрПоСотрудникам
		|		ПО (ФильтрПоСотрудникам.ФизическоеЛицо = ПредставленияКадровыеДанныеСотрудников.ФизическоеЛицо)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ФильтрПоСотрудникам.ВидЗанятостиПриоритет = 1
		|				ТОГДА ПредставленияКадровыеДанныеСотрудников.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы)
		|			КОГДА ФильтрПоСотрудникам.ВидЗанятостиПриоритет = 2
		|				ТОГДА ПредставленияКадровыеДанныеСотрудников.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.Совместительство)
		|			ИНАЧЕ ПредставленияКадровыеДанныеСотрудников.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ВнутреннееСовместительство)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакопленныеДниЗаМесяц.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НакопленныеДниЗаМесяц.Месяц КАК Месяц,
		|	НакопленныеДниЗаМесяц.ДокументОснование КАК ДокументОснование,
		|	НакопленныеДниЗаМесяц.НакопленоДней КАК НакопленоДней,
		|	ВЫБОР
		|		КОГДА НакопленныеДниЗаМесяц.НакопленоЧасов > НакопленныеДниЗаМесяц.НакопленоДней * 8
		|			ТОГДА НакопленныеДниЗаМесяц.НакопленоДней * 8
		|		ИНАЧЕ НакопленныеДниЗаМесяц.НакопленоЧасов
		|	КОНЕЦ КАК НакопленоЧасов,
		|	ОсновныеСотрудники.Сотрудник КАК Сотрудник,
		|	ОсновныеСотрудники.ВидЗанятости КАК ВидЗанятости
		|ПОМЕСТИТЬ НакопленныеДниОсновныеСотрудники
		|ИЗ
		|	НакопленныеДниЗаМесяц КАК НакопленныеДниЗаМесяц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОсновныеСотрудники КАК ОсновныеСотрудники
		|		ПО НакопленныеДниЗаМесяц.ФизическоеЛицо = ОсновныеСотрудники.ФизическоеЛицо
		|			И (НАЧАЛОПЕРИОДА(ОсновныеСотрудники.ДАТАПРИЕМА, МЕСЯЦ) <= НакопленныеДниЗаМесяц.Месяц)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФлагНакопленияДней КАК ФлагНакопленияДней
		|		ПО НакопленныеДниЗаМесяц.ФизическоеЛицо = ФлагНакопленияДней.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НакопленныеДни.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НакопленныеДни.Месяц КАК Месяц,
		|	ВЫБОР
		|		КОГДА НакопленныеДни.ВсегоДней <= 24
		|			ТОГДА НакопленныеДни.НакопленоДней
		|		ИНАЧЕ НакопленныеДни.НакопленоДней - (НакопленныеДни.ВсегоДней - 24)
		|	КОНЕЦ КАК НакопленоДней,
		|	ВЫБОР
		|		КОГДА НакопленныеДни.ВсегоДней <= 24
		|				ИЛИ НакопленныеДни.НакопленоДней = 0
		|			ТОГДА НакопленныеДни.НакопленоЧасов
		|		ИНАЧЕ НакопленныеДни.НакопленоЧасов - ОКР(НакопленныеДни.НакопленоЧасов / НакопленныеДни.НакопленоЧасов * (НакопленныеДни.ВсегоДней - 24), 0)
		|	КОНЕЦ КАК НакопленоЧасов,
		|	НакопленныеДни.ВсегоДней КАК ВсегоДней,
		|	НакопленныеДни.Сотрудник КАК Сотрудник,
		|	НакопленныеДни.ВидЗанятости КАК ВидЗанятости,
		|	НакопленныеДни.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ИтогНакопленныеДни
		|ИЗ
		|	(ВЫБРАТЬ
		|		НакопленныеДниОсновныеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|		НакопленныеДниОсновныеСотрудники.Месяц КАК Месяц,
		|		НакопленныеДниОсновныеСотрудники.ДокументОснование КАК ДокументОснование,
		|		НакопленныеДниОсновныеСотрудники.НакопленоДней КАК НакопленоДней,
		|		НакопленныеДниОсновныеСотрудники.НакопленоЧасов КАК НакопленоЧасов,
		|		НакопленныеДниОсновныеСотрудники.Сотрудник КАК Сотрудник,
		|		НакопленныеДниОсновныеСотрудники.ВидЗанятости КАК ВидЗанятости,
		|		СУММА(НакопленныеДниОсновныеСотрудникиНакопление.НакопленоДней) КАК ВсегоДней
		|	ИЗ
		|		НакопленныеДниОсновныеСотрудники КАК НакопленныеДниОсновныеСотрудники
		|			ЛЕВОЕ СОЕДИНЕНИЕ НакопленныеДниОсновныеСотрудники КАК НакопленныеДниОсновныеСотрудникиНакопление
		|			ПО НакопленныеДниОсновныеСотрудники.ФизическоеЛицо = НакопленныеДниОсновныеСотрудникиНакопление.ФизическоеЛицо
		|				И НакопленныеДниОсновныеСотрудники.Месяц >= НакопленныеДниОсновныеСотрудникиНакопление.Месяц
		|	
		|	СГРУППИРОВАТЬ ПО
		|		НакопленныеДниОсновныеСотрудники.ФизическоеЛицо,
		|		НакопленныеДниОсновныеСотрудники.Месяц,
		|		НакопленныеДниОсновныеСотрудники.ДокументОснование,
		|		НакопленныеДниОсновныеСотрудники.НакопленоДней,
		|		НакопленныеДниОсновныеСотрудники.НакопленоЧасов,
		|		НакопленныеДниОсновныеСотрудники.Сотрудник,
		|		НакопленныеДниОсновныеСотрудники.ВидЗанятости) КАК НакопленныеДни
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НакопленныеДни.ВсегоДней <= 24
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ НакопленныеДни.НакопленоДней > НакопленныеДни.ВсегоДней - 24
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыКЗаполнению.КоличествоСтраниц КАК КоличествоСтраниц,
		|	ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмИинвалидами.ПустаяСсылка) КАК ДокументОснование,
		|	ОплатыКЗаполнению.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОплатыКЗаполнению.Месяц КАК Месяц,
		|	СУММА(ОплатыКЗаполнению.СуммаПособия) КАК СуммаПособия,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ ДниУходаПоМесяцам.КоличествоДней
		|	КОНЕЦ КАК КоличествоДней,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(ДниУходаПоМесяцам.КоличествоДней * ДниУходаПоМесяцам.ЧасовВДень)
		|	КОНЕЦ КАК КоличествоЧасовЗаМесяц,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ДниУходаПоМесяцам.КоличествоДнейЗаГод
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоДнейЗаГод,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ОКР(ДниУходаПоМесяцам.КоличествоДнейЗаГод * ДниУходаПоМесяцам.ЧасовВДеньГод)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоЧасовЗаГод,
		|	ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	ЕСТЬNULL(ОсновныеСотрудники.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)) КАК Сотрудник,
		|	ЕСТЬNULL(ОсновныеСотрудники.ВидЗанятости, ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка)) КАК ВидЗанятости,
		|	СУММА(ОплатыКЗаполнению.СуммаВзносов) КАК СуммаВзносов
		|ПОМЕСТИТЬ СуммаПособийПоСовместителям
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФизическиеЛицаСовместителей КАК ФизическиеЛицаСовместителей
		|		ПО ОплатыКЗаполнению.ФизическоеЛицо = ФизическиеЛицаСовместителей.ФизическоеЛицо
		|			И ОплатыКЗаполнению.Месяц = ФизическиеЛицаСовместителей.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДниУходаПоМесяцам КАК ДниУходаПоМесяцам
		|		ПО ОплатыКЗаполнению.ФизическоеЛицо = ДниУходаПоМесяцам.ФизическоеЛицо
		|			И ОплатыКЗаполнению.Месяц = ДниУходаПоМесяцам.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОсновныеСотрудники КАК ОсновныеСотрудники
		|		ПО ОплатыКЗаполнению.ФизическоеЛицо = ОсновныеСотрудники.ФизическоеЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатыКЗаполнению.КоличествоСтраниц,
		|	ОплатыКЗаполнению.ФизическоеЛицо,
		|	ОплатыКЗаполнению.Месяц,
		|	ЕСТЬNULL(ОсновныеСотрудники.Сотрудник, ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)),
		|	ЕСТЬNULL(ОсновныеСотрудники.ВидЗанятости, ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ДниУходаПоМесяцам.КоличествоДнейЗаГод
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА ОКР(ДниУходаПоМесяцам.КоличествоДнейЗаГод * ДниУходаПоМесяцам.ЧасовВДеньГод)
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ ДниУходаПоМесяцам.КоличествоДней
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ ОКР(ДниУходаПоМесяцам.КоличествоДней * ДниУходаПоМесяцам.ЧасовВДень)
		|	КОНЕЦ,
		|	ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммаПособийПоСовместителям.КоличествоСтраниц КАК КоличествоСтраниц,
		|	СуммаПособийПоСовместителям.ДокументОснование КАК ДокументОснование,
		|	СуммаПособийПоСовместителям.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СуммаПособийПоСовместителям.Месяц КАК Месяц,
		|	СУММА(СуммаПособийПоСовместителям.СуммаПособия) КАК СуммаПособия,
		|	МАКСИМУМ(СуммаПособийПоСовместителям.КоличествоДней) КАК КоличествоДней,
		|	МАКСИМУМ(СуммаПособийПоСовместителям.КоличествоЧасовЗаМесяц) КАК КоличествоЧасовЗаМесяц,
		|	МАКСИМУМ(СуммаПособийПоСовместителям.КоличествоДнейЗаГод) КАК КоличествоДнейЗаГод,
		|	МАКСИМУМ(СуммаПособийПоСовместителям.КоличествоЧасовЗаГод) КАК КоличествоЧасовЗаГод,
		|	МАКСИМУМ(СуммаПособийПоСовместителям.ИспользоватьОстатокДнейЗаГод) КАК ИспользоватьОстатокДнейЗаГод,
		|	СуммаПособийПоСовместителям.Сотрудник КАК Сотрудник,
		|	СуммаПособийПоСовместителям.ВидЗанятости КАК ВидЗанятости,
		|	СУММА(СуммаПособийПоСовместителям.СуммаВзносов) КАК СуммаВзносов,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ СуммаПособийПоСовместителям.ИспользоватьОстатокДнейЗаГод
		|					И СуммаПособийПоСовместителям.КоличествоДней > 0
		|				ТОГДА ОКР(СуммаПособийПоСовместителям.СуммаПособия / СуммаПособийПоСовместителям.КоличествоДней, 4)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СреднедневнойЗаработок,
		|	СУММА(ВЫБОР
		|			КОГДА СуммаПособийПоСовместителям.ИспользоватьОстатокДнейЗаГод
		|					И СуммаПособийПоСовместителям.КоличествоДнейЗаГод > 0
		|				ТОГДА ОКР(СуммаПособийПоСовместителям.СуммаПособия / СуммаПособийПоСовместителям.КоличествоДнейЗаГод, 4)
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СреднедневнойЗаработокЗаГод
		|ПОМЕСТИТЬ ОбщиеСтрокиСовместителей
		|ИЗ
		|	СуммаПособийПоСовместителям КАК СуммаПособийПоСовместителям
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммаПособийПоСовместителям.КоличествоСтраниц,
		|	СуммаПособийПоСовместителям.ДокументОснование,
		|	СуммаПособийПоСовместителям.ФизическоеЛицо,
		|	СуммаПособийПоСовместителям.Месяц,
		|	СуммаПособийПоСовместителям.Сотрудник,
		|	СуммаПособийПоСовместителям.ВидЗанятости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатыКЗаполнению.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОплатыКЗаполнению.Месяц КАК Месяц,
		|	ОплатыКЗаполнению.Сотрудник КАК Сотрудник,
		|	ОплатаДнейУходаЗаДетьмиИнвалидами.Ссылка КАК Ссылка,
		|	ОплатаДнейУходаЗаДетьмиИнвалидами.ДатаНачала КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.НомерПервичногоДокумента = """"
		|			ТОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.Номер
		|		ИНАЧЕ ОплатаДнейУходаЗаДетьмиИнвалидами.НомерПервичногоДокумента
		|	КОНЕЦ КАК НомерПриказа,
		|	ВЫБОР
		|		КОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.Дата
		|		ИНАЧЕ ОплатаДнейУходаЗаДетьмиИнвалидами.ДатаПервичногоДокумента
		|	КОНЕЦ КАК ДатаПриказа,
		|	ОплатыКЗаполнению.Ребенок КАК Ребенок
		|ПОМЕСТИТЬ ДокументыЗаПериод
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК ОплатаДнейУходаЗаДетьмиИнвалидами
		|		ПО ОплатыКЗаполнению.ДокументОснование = ОплатаДнейУходаЗаДетьмиИнвалидами.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументыЗаПериод.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДокументыЗаПериод.Месяц КАК Месяц,
		|	ДокументыЗаПериод.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДокументыЗаПериод.ДатаНачала) КАК ДатаНачала
		|ПОМЕСТИТЬ ПоследнийДокументМесяца
		|ИЗ
		|	ДокументыЗаПериод КАК ДокументыЗаПериод
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументыЗаПериод.ФизическоеЛицо,
		|	ДокументыЗаПериод.Месяц,
		|	ДокументыЗаПериод.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОплатыКЗаполнению.Ребенок КАК Ребенок,
		|	ОплатыКЗаполнению.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ РебенокОсновногоСотрудника
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОсновныеСотрудники КАК ОсновныеСотрудники
		|		ПО ОплатыКЗаполнению.Сотрудник = ОсновныеСотрудники.Сотрудник
		|			И (ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОплатыКЗаполнению.КоличествоСтраниц КАК КоличествоСтраниц,
		|	ОплатыКЗаполнению.ДокументОснование КАК ДокументОснование,
		|	ОплатыКЗаполнению.Сотрудник КАК Сотрудник,
		|	ОплатыКЗаполнению.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОплатыКЗаполнению.Ребенок КАК Ребенок,
		|	ОплатыКЗаполнению.Месяц КАК Месяц,
		|	ОплатыКЗаполнению.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	ОплатыКЗаполнению.СреднедневнойЗаработокЗаГод КАК СреднедневнойЗаработокЗаГод,
		|	ОплатыКЗаполнению.СуммаПособия КАК СуммаПособия,
		|	ОплатыКЗаполнению.СуммаВзносов КАК СуммаВзносов,
		|	ОплатыКЗаполнению.КоличествоДней КАК КоличествоДней,
		|	ОплатыКЗаполнению.КоличествоЧасовЗаМесяц КАК КоличествоЧасовЗаМесяц,
		|	ОплатыКЗаполнению.КоличествоДнейЗаГод КАК КоличествоДнейЗаГод,
		|	ОплатыКЗаполнению.КоличествоЧасовЗаГод КАК КоличествоЧасовЗаГод,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|				ИЛИ ОбщиеСтрокиСовместителей.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|				ИЛИ ИтогНакопленныеДни.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ИтогНакопленныеДни.НакопленоДней
		|	КОНЕЦ КАК НакопленоДнейЗаМесяц,
		|	ВЫБОР
		|		КОГДА ОплатыКЗаполнению.ИспользоватьОстатокДнейЗаГод
		|				ИЛИ ОбщиеСтрокиСовместителей.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|				ИЛИ ИтогНакопленныеДни.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ИтогНакопленныеДни.НакопленоЧасов > ИтогНакопленныеДни.НакопленоДней * 8
		|			ТОГДА ИтогНакопленныеДни.НакопленоДней * 8
		|		ИНАЧЕ ИтогНакопленныеДни.НакопленоЧасов
		|	КОНЕЦ КАК НакопленоЧасовЗаМесяц,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	ОбщиеСтрокиСовместителей.ФизическоеЛицо ЕСТЬ НЕ NULL  КАК ЭтоРасшифровка,
		|	ВЫБОР
		|		КОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.НомерПервичногоДокумента = """"
		|			ТОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.Номер
		|		ИНАЧЕ ОплатаДнейУходаЗаДетьмиИнвалидами.НомерПервичногоДокумента
		|	КОНЕЦ КАК ПриказНомер,
		|	ВЫБОР
		|		КОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ОплатаДнейУходаЗаДетьмиИнвалидами.Дата
		|		ИНАЧЕ ОплатаДнейУходаЗаДетьмиИнвалидами.ДатаПервичногоДокумента
		|	КОНЕЦ КАК ПриказДата,
		|	ФизическиеЛица.Фамилия КАК СотрудникФамилия,
		|	ФизическиеЛица.Имя КАК СотрудникИмя,
		|	ФизическиеЛица.Отчество КАК СотрудникОтчество
		|ИЗ
		|	ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПредставленияКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|			ПО КадровыеДанныеСотрудников.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ПО ОплатыКЗаполнению.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаДнейУходаЗаДетьмиИнвалидами КАК ОплатаДнейУходаЗаДетьмиИнвалидами
		|		ПО ОплатыКЗаполнению.ДокументОснование = ОплатаДнейУходаЗаДетьмиИнвалидами.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщиеСтрокиСовместителей КАК ОбщиеСтрокиСовместителей
		|		ПО ОплатыКЗаполнению.ФизическоеЛицо = ОбщиеСтрокиСовместителей.ФизическоеЛицо
		|			И ОплатыКЗаполнению.Месяц = ОбщиеСтрокиСовместителей.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЗаПериод КАК ДокументыЗаПериод
		|			ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийДокументМесяца КАК ПоследнийДокументМесяца
		|				ЛЕВОЕ СОЕДИНЕНИЕ ИтогНакопленныеДни КАК ИтогНакопленныеДни
		|				ПО ПоследнийДокументМесяца.Месяц = ИтогНакопленныеДни.Месяц
		|					И ПоследнийДокументМесяца.ФизическоеЛицо = ИтогНакопленныеДни.ФизическоеЛицо
		|					И ПоследнийДокументМесяца.Сотрудник = ИтогНакопленныеДни.Сотрудник
		|			ПО ДокументыЗаПериод.Месяц = ПоследнийДокументМесяца.Месяц
		|				И ДокументыЗаПериод.Сотрудник = ПоследнийДокументМесяца.Сотрудник
		|				И ДокументыЗаПериод.ДатаНачала = ПоследнийДокументМесяца.ДатаНачала
		|		ПО ОплатыКЗаполнению.Месяц = ДокументыЗаПериод.Месяц
		|			И ОплатыКЗаполнению.Сотрудник = ДокументыЗаПериод.Сотрудник
		|			И ОплатыКЗаполнению.ДокументОснование = ДокументыЗаПериод.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбщиеСтрокиСовместителей.КоличествоСтраниц,
		|	ОбщиеСтрокиСовместителей.ДокументОснование,
		|	ОбщиеСтрокиСовместителей.Сотрудник,
		|	ОбщиеСтрокиСовместителей.ФизическоеЛицо,
		|	ДокументыЗаПериод.Ребенок,
		|	ОбщиеСтрокиСовместителей.Месяц,
		|	ОбщиеСтрокиСовместителей.СреднедневнойЗаработок,
		|	ОбщиеСтрокиСовместителей.СреднедневнойЗаработокЗаГод,
		|	ОбщиеСтрокиСовместителей.СуммаПособия,
		|	ОбщиеСтрокиСовместителей.СуммаВзносов,
		|	ОбщиеСтрокиСовместителей.КоличествоДней,
		|	ОбщиеСтрокиСовместителей.КоличествоЧасовЗаМесяц,
		|	ОбщиеСтрокиСовместителей.КоличествоДнейЗаГод,
		|	ОбщиеСтрокиСовместителей.КоличествоЧасовЗаГод,
		|	ВЫБОР
		|		КОГДА ОбщиеСтрокиСовместителей.КоличествоДнейЗаГод > 0
		|				ИЛИ ИтогНакопленныеДни.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ИтогНакопленныеДни.НакопленоДней
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ОбщиеСтрокиСовместителей.КоличествоДнейЗаГод > 0
		|				ИЛИ ИтогНакопленныеДни.ФизическоеЛицо ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА ИтогНакопленныеДни.НакопленоЧасов > ИтогНакопленныеДни.НакопленоДней * 8
		|			ТОГДА ИтогНакопленныеДни.НакопленоДней * 8
		|		ИНАЧЕ ИтогНакопленныеДни.НакопленоЧасов
		|	КОНЕЦ,
		|	ОбщиеСтрокиСовместителей.ВидЗанятости,
		|	ЛОЖЬ,
		|	ДокументыЗаПериод.НомерПриказа,
		|	ДокументыЗаПериод.ДатаПриказа,
		|	ФизическиеЛица.Фамилия,
		|	ФизическиеЛица.Имя,
		|	ФизическиеЛица.Отчество
		|ИЗ
		|	ОбщиеСтрокиСовместителей КАК ОбщиеСтрокиСовместителей
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследнийДокументМесяца КАК ПоследнийДокументМесяцаПоСовместителям
		|			ЛЕВОЕ СОЕДИНЕНИЕ ДокументыЗаПериод КАК ДокументыЗаПериод
		|				ЛЕВОЕ СОЕДИНЕНИЕ ИтогНакопленныеДни КАК ИтогНакопленныеДни
		|				ПО ДокументыЗаПериод.Месяц = ИтогНакопленныеДни.Месяц
		|					И ДокументыЗаПериод.ФизическоеЛицо = ИтогНакопленныеДни.ФизическоеЛицо
		|					И ДокументыЗаПериод.Сотрудник = ИтогНакопленныеДни.Сотрудник
		|			ПО ПоследнийДокументМесяцаПоСовместителям.ФизическоеЛицо = ДокументыЗаПериод.ФизическоеЛицо
		|				И ПоследнийДокументМесяцаПоСовместителям.Месяц = ДокументыЗаПериод.Месяц
		|				И ПоследнийДокументМесяцаПоСовместителям.Сотрудник = ДокументыЗаПериод.Сотрудник
		|				И ПоследнийДокументМесяцаПоСовместителям.ДатаНачала = ДокументыЗаПериод.ДатаНачала
		|		ПО ОбщиеСтрокиСовместителей.ФизическоеЛицо = ПоследнийДокументМесяцаПоСовместителям.ФизическоеЛицо
		|			И ОбщиеСтрокиСовместителей.Месяц = ПоследнийДокументМесяцаПоСовместителям.Месяц
		|			И (ПоследнийДокументМесяцаПоСовместителям.Сотрудник = ОбщиеСтрокиСовместителей.Сотрудник)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ОбщиеСтрокиСовместителей.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	0,
		|	ИтогНакопленныеДни.ДокументОснование,
		|	ИтогНакопленныеДни.Сотрудник,
		|	ИтогНакопленныеДни.ФизическоеЛицо,
		|	РебенокОсновногоСотрудника.Ребенок,
		|	ИтогНакопленныеДни.Месяц,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ИтогНакопленныеДни.НакопленоДней,
		|	ИтогНакопленныеДни.НакопленоЧасов,
		|	ИтогНакопленныеДни.ВидЗанятости,
		|	ЛОЖЬ,
		|	"""",
		|	ДАТАВРЕМЯ(1, 1, 1),
		|	ФизическиеЛица.Фамилия,
		|	ФизическиеЛица.Имя,
		|	ФизическиеЛица.Отчество
		|ИЗ
		|	ИтогНакопленныеДни КАК ИтогНакопленныеДни
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыКЗаполнению КАК ОплатыКЗаполнению
		|		ПО ИтогНакопленныеДни.ФизическоеЛицо = ОплатыКЗаполнению.ФизическоеЛицо
		|			И ИтогНакопленныеДни.Месяц = ОплатыКЗаполнению.Месяц
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО ИтогНакопленныеДни.ФизическоеЛицо = ФизическиеЛица.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РебенокОсновногоСотрудника КАК РебенокОсновногоСотрудника
		|		ПО ИтогНакопленныеДни.Сотрудник = РебенокОсновногоСотрудника.Сотрудник
		|ГДЕ
		|	ОплатыКЗаполнению.ФизическоеЛицо ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.КоличествоСтраниц,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ДокументОснование,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Сотрудник,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ФизическоеЛицо,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ребенок,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Месяц,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СреднедневнойЗаработок,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СреднедневнойЗаработокЗаГод,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СуммаПособия,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СуммаВзносов,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.КоличествоДней,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.КоличествоЧасовЗаМесяц,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.КоличествоДнейЗаГод,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.КоличествоЧасовЗаГод,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.НакопленоДнейЗаМесяц,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.НакопленоЧасовЗаМесяц,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ВидЗанятости,
		|	ЛОЖЬ,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ПриказНомер,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ПриказДата,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СотрудникФамилия,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СотрудникИмя,
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СотрудникОтчество
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Оплаты КАК ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|		ПО ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.ФизическоеЛицо = ВсеОстаткиОплат.ФизическоеЛицо
		|			И ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Месяц = ВсеОстаткиОплат.Месяц
		|ГДЕ
		|	ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.Ссылка = &ИсправленныйДокумент
		|	И ВсеОстаткиОплат.ФизическоеЛицо ЕСТЬ NULL
		|	И ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовОплаты.СуммаПособия > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	СотрудникФамилия,
		|	СотрудникИмя,
		|	СотрудникОтчество,
		|	Месяц,
		|	ЭтоРасшифровка,
		|	ВидЗанятости,
		|	Сотрудник,
		|	ДокументОснование,
		|	КоличествоДней";
	ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросыКПредставлениямВиртуальныхТаблиц(Текст);
	Возврат Текст;
КонецФункции

// Текст запроса, выполняет поиск исправлений - расхождения по сумме взносов или пособия без учета ручных изменений.
// Используется в списке заявлений, текущих делах и при автозаполнении если нет новых оплат.
//
// Возвращаемое значение:
//    Строка - текст запроса.
//
Функция ТекстЗапросаПоискаИсправленияОплат()
	Текст =
		"ВЫБРАТЬ
		|	СУММА(ВсеДругиеОплаты.СуммаПособия) КАК СуммаПособияЗаявление,
		|	СУММА(ВсеДругиеОплаты.СуммаВзносов) КАК СуммаВзносовЗаявление,
		|	ВсеДругиеОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц КАК Месяц,
		|	ВсеДругиеОплаты.Ребенок КАК Ребенок
		|ПОМЕСТИТЬ ОтправленныеОплаты
		|ИЗ
		|	ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|ГДЕ
		|	НЕ ВсеДругиеОплаты.ЭтоРасшифровка
		|	И НЕ(ВсеДругиеОплаты.СуммаПособия = 0
		|				И ВсеДругиеОплаты.СуммаВзносов = 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеДругиеОплаты.ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц,
		|	ВсеДругиеОплаты.Ребенок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеОстаткиОплат.Ребенок КАК Ребенок,
		|	ВсеОстаткиОплат.Месяц КАК Месяц,
		|	СУММА(ВсеОстаткиОплат.СуммаПособия) КАК СуммаПособия,
		|	СУММА(ВсеОстаткиОплат.СуммаВзносовДоступная) КАК СуммаВзносов,
		|	ВсеОстаткиОплат.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВведенныеОплаты
		|ИЗ
		|	ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеОстаткиОплат.Ребенок,
		|	ВсеОстаткиОплат.Месяц,
		|	ВсеОстаткиОплат.ФизическоеЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеОстаткиОплат.КоличествоСтраниц КАК КоличествоСтраниц,
		|	ВсеОстаткиОплат.ДокументОснование КАК ДокументОснование,
		|	ВсеОстаткиОплат.Сотрудник КАК Сотрудник,
		|	ВсеОстаткиОплат.Ребенок КАК Ребенок,
		|	ВсеОстаткиОплат.Месяц КАК Месяц,
		|	ВсеОстаткиОплат.ИзмененаСуммаВзносов КАК ИзмененаСуммаВзносов,
		|	ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	ВсеОстаткиОплат.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	ВсеОстаткиОплат.СреднедневнойЗаработокЗаГод КАК СреднедневнойЗаработокЗаГод,
		|	ВсеОстаткиОплат.СуммаПособия КАК СуммаПособия,
		|	ВсеОстаткиОплат.СуммаВзносовДоступная КАК СуммаВзносовДоступная,
		|	ВсеОстаткиОплат.СуммаВзносовУчтенная КАК СуммаВзносовУчтенная,
		|	ВсеОстаткиОплат.КоличествоДней КАК КоличествоДней,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаМесяц КАК КоличествоЧасовЗаМесяц,
		|	ВсеОстаткиОплат.КоличествоДнейЗаГод КАК КоличествоДнейЗаГод,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаГод КАК КоличествоЧасовЗаГод,
		|	ВсеОстаткиОплат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДругиеОплаты.Ссылка КАК Заявление
		|ПОМЕСТИТЬ НовыеИсправленияОплат
		|ИЗ
		|	ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|		ПО ВсеОстаткиОплат.Сотрудник = ВсеДругиеОплаты.Сотрудник
		|			И ВсеОстаткиОплат.Месяц = ВсеДругиеОплаты.Месяц
		|			И ВсеОстаткиОплат.Ребенок = ВсеДругиеОплаты.Ребенок
		|			И (ВсеДругиеОплаты.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмИинвалидами.ПустаяСсылка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеДругиеОплаты КАК ВсеДругиеОплатыПоДокументам
		|		ПО ВсеОстаткиОплат.Сотрудник = ВсеДругиеОплатыПоДокументам.Сотрудник
		|			И ВсеОстаткиОплат.Месяц = ВсеДругиеОплатыПоДокументам.Месяц
		|			И ВсеОстаткиОплат.Ребенок = ВсеДругиеОплатыПоДокументам.Ребенок
		|			И ВсеОстаткиОплат.ДокументОснование = ВсеДругиеОплатыПоДокументам.ДокументОснование
		|			И (ВсеДругиеОплаты.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмИинвалидами.ПустаяСсылка))
		|ГДЕ
		|	ВсеДругиеОплаты.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|	И ВсеДругиеОплатыПоДокументам.ДокументОснование ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВведенныеОплаты.Ребенок КАК Ребенок,
		|	ВведенныеОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВведенныеОплаты.Месяц КАК Месяц,
		|	ВведенныеОплаты.СуммаПособия КАК СуммаПособия,
		|	ВведенныеОплаты.СуммаВзносов КАК СуммаВзносов,
		|	ОтправленныеОплаты.СуммаПособияЗаявление КАК СуммаПособияЗаявление,
		|	ОтправленныеОплаты.СуммаВзносовЗаявление КАК СуммаВзносовЗаявление,
		|	ВведенныеОплаты.СуммаПособия <> ОтправленныеОплаты.СуммаПособияЗаявление КАК ИзмененоПособие,
		|	ВведенныеОплаты.СуммаВзносов <> ОтправленныеОплаты.СуммаВзносовЗаявление КАК ИзмененыВзносы
		|ПОМЕСТИТЬ Расхождение
		|ИЗ
		|	ВведенныеОплаты КАК ВведенныеОплаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтправленныеОплаты КАК ОтправленныеОплаты
		|		ПО ВведенныеОплаты.ФизическоеЛицо = ОтправленныеОплаты.ФизическоеЛицо
		|			И ВведенныеОплаты.Месяц = ОтправленныеОплаты.Месяц
		|			И (ОтправленныеОплаты.Ребенок = ВведенныеОплаты.Ребенок)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеОплаты КАК НовыеОплаты
		|		ПО ВведенныеОплаты.Месяц = НовыеОплаты.Месяц
		|			И ВведенныеОплаты.ФизическоеЛицо = НовыеОплаты.ФизическоеЛицо
		|ГДЕ
		|	НЕ(ВведенныеОплаты.СуммаВзносов = ОтправленныеОплаты.СуммаВзносовЗаявление
		|				И ВведенныеОплаты.СуммаПособия = ОтправленныеОплаты.СуммаПособияЗаявление)
		|	И НовыеОплаты.ФизическоеЛицо ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеДругиеОплаты.Ссылка КАК Заявление,
		|	ВсеДругиеОплаты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеДругиеОплаты.Месяц КАК Месяц,
		|	ВсеДругиеОплаты.Ребенок КАК Ребенок,
		|	ЗаявлениеФиксацияИзмененийПособия.Ссылка ЕСТЬ НЕ NULL  КАК ФиксацияПособия,
		|	ЗаявлениеФиксацияИзмененийВзносов.Ссылка ЕСТЬ НЕ NULL  КАК ФиксацияВзносов,
		|	НовыеИсправленияОплат.ФизическоеЛицо ЕСТЬ НЕ NULL  КАК НовыйДокументИсправления,
		|	Расхождение.ИзмененоПособие КАК ИзмененоПособие,
		|	Расхождение.ИзмененыВзносы КАК ИзмененыВзносы,
		|	ВсеДругиеОплаты.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ЗаявленияКИсправлению
		|ИЗ
		|	Расхождение КАК Расхождение
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ФиксацияИзменений КАК ЗаявлениеФиксацияИзмененийПособия
		|			ПО ВсеДругиеОплаты.Ссылка = ЗаявлениеФиксацияИзмененийПособия.Ссылка
		|				И ВсеДругиеОплаты.ИдентификаторСтрокиФикс = ЗаявлениеФиксацияИзмененийПособия.ИдентификаторСтроки
		|				И ((ВЫРАЗИТЬ(ЗаявлениеФиксацияИзмененийПособия.ИмяРеквизита КАК СТРОКА(50))) = ""СуммаПособия"")
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.ФиксацияИзменений КАК ЗаявлениеФиксацияИзмененийВзносов
		|			ПО ВсеДругиеОплаты.Ссылка = ЗаявлениеФиксацияИзмененийВзносов.Ссылка
		|				И ВсеДругиеОплаты.ИдентификаторСтрокиФикс = ЗаявлениеФиксацияИзмененийВзносов.ИдентификаторСтроки
		|				И ((ВЫРАЗИТЬ(ЗаявлениеФиксацияИзмененийВзносов.ИмяРеквизита КАК СТРОКА(50))) = ""СуммаВзносов"")
		|		ПО (ВсеДругиеОплаты.ФизическоеЛицо = Расхождение.ФизическоеЛицо)
		|			И (ВсеДругиеОплаты.Месяц = Расхождение.Месяц)
		|			И (ВсеДругиеОплаты.Ребенок = Расхождение.Ребенок)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НовыеИсправленияОплат КАК НовыеИсправленияОплат
		|		ПО Расхождение.ФизическоеЛицо = НовыеИсправленияОплат.ФизическоеЛицо
		|			И Расхождение.Месяц = НовыеИсправленияОплат.Месяц
		|			И Расхождение.Ребенок = НовыеИсправленияОплат.Ребенок
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НовыеИсправленияОплат.ФизическоеЛицо ЕСТЬ НЕ NULL 
		|				ТОГДА ИСТИНА
		|			КОГДА ЗаявлениеФиксацияИзмененийПособия.Ссылка ЕСТЬ NULL
		|					И Расхождение.ИзмененоПособие
		|				ТОГДА ИСТИНА
		|			КОГДА ЗаявлениеФиксацияИзмененийВзносов.Ссылка ЕСТЬ NULL
		|					И Расхождение.ИзмененыВзносы
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеОстаткиОплат.КоличествоСтраниц КАК КоличествоСтраниц,
		|	ВсеОстаткиОплат.ДокументОснование КАК ДокументОснование,
		|	ВсеОстаткиОплат.Сотрудник КАК Сотрудник,
		|	ВсеОстаткиОплат.Ребенок КАК Ребенок,
		|	ВсеОстаткиОплат.Месяц КАК Месяц,
		|	ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод КАК ИспользоватьОстатокДнейЗаГод,
		|	ВсеОстаткиОплат.СреднедневнойЗаработок КАК СреднедневнойЗаработок,
		|	ВсеОстаткиОплат.СреднедневнойЗаработокЗаГод КАК СреднедневнойЗаработокЗаГод,
		|	ВсеОстаткиОплат.СуммаПособия КАК СуммаПособия,
		|	ВсеОстаткиОплат.СуммаВзносовДоступная КАК СуммаВзносов,
		|	ВсеОстаткиОплат.КоличествоДней КАК КоличествоДней,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаМесяц КАК КоличествоЧасовЗаМесяц,
		|	ВсеОстаткиОплат.КоличествоДнейЗаГод КАК КоличествоДнейЗаГод,
		|	ВсеОстаткиОплат.КоличествоЧасовЗаГод КАК КоличествоЧасовЗаГод,
		|	ВЫБОР
		|		КОГДА ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ 4 - ВсеОстаткиОплат.КоличествоДней
		|	КОНЕЦ КАК НакопленоДнейЗаМесяц,
		|	ВЫБОР
		|		КОГДА ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод
		|			ТОГДА 0
		|		ИНАЧЕ 32 - ВсеОстаткиОплат.КоличествоЧасовЗаМесяц
		|	КОНЕЦ КАК НакопленоЧасовЗаМесяц,
		|	ВсеОстаткиОплат.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЗаявленияКИсправлению.ФиксацияПособия КАК ФиксацияПособия,
		|	ЗаявленияКИсправлению.ФиксацияВзносов КАК ФиксацияВзносов,
		|	ЗаявленияКИсправлению.НовыйДокументИсправления КАК НовыйДокументИсправления,
		|	ЗаявленияКИсправлению.ИзмененоПособие КАК ИзмененоПособие,
		|	ЗаявленияКИсправлению.ИзмененыВзносы КАК ИзмененыВзносы,
		|	ЗаявленияКИсправлению.Заявление КАК Заявление,
		|	ЕСТЬNULL(ВсеДругиеОплаты.СуммаПособия, 0) КАК СуммаПособияДо,
		|	ЕСТЬNULL(ВсеДругиеОплаты.СуммаВзносов, 0) КАК СуммаВзносовДо
		|ПОМЕСТИТЬ СтрокиИсправления
		|ИЗ
		|	ЗаявленияКИсправлению КАК ЗаявленияКИсправлению
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОстаткиОплат КАК ВсеОстаткиОплат
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВсеДругиеОплаты КАК ВсеДругиеОплаты
		|			ПО ВсеОстаткиОплат.Сотрудник = ВсеДругиеОплаты.Сотрудник
		|				И ВсеОстаткиОплат.Месяц = ВсеДругиеОплаты.Месяц
		|				И ВсеОстаткиОплат.Ребенок = ВсеДругиеОплаты.Ребенок
		|				И (ВсеДругиеОплаты.ДокументОснование <> ЗНАЧЕНИЕ(Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.ПустаяСсылка))
		|				И (ВсеДругиеОплаты.ДокументОснование = ВсеОстаткиОплат.ДокументОснование)
		|				И (ВЫБОР
		|					КОГДА ВсеОстаткиОплат.ИспользоватьОстатокДнейЗаГод
		|						ТОГДА ВсеДругиеОплаты.КоличествоДнейЗаГод > 0
		|					ИНАЧЕ ВсеДругиеОплаты.КоличествоДней > 0
		|				КОНЕЦ)
		|		ПО ЗаявленияКИсправлению.ФизическоеЛицо = ВсеОстаткиОплат.ФизическоеЛицо
		|			И ЗаявленияКИсправлению.Месяц = ВсеОстаткиОплат.Месяц
		|			И ЗаявленияКИсправлению.ДокументОснование = ВсеОстаткиОплат.ДокументОснование
		|ГДЕ
		|	НЕ(ВсеОстаткиОплат.СуммаПособия = ВсеДругиеОплаты.СуммаПособия
		|				И ВсеОстаткиОплат.СуммаВзносовДоступная = ВсеДругиеОплаты.СуммаВзносов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиИсправления.Сотрудник КАК Сотрудник,
		|	СтрокиИсправления.Ребенок КАК Ребенок,
		|	СтрокиИсправления.Месяц КАК Месяц,
		|	СтрокиИсправления.ДокументОснование КАК ДокументОснование,
		|	СтрокиИсправления.СуммаПособия КАК СуммаПособияПосле,
		|	СтрокиИсправления.СуммаВзносов КАК СуммаВзносовПосле,
		|	СтрокиИсправления.СуммаПособияДо КАК СуммаПособияДо,
		|	СтрокиИсправления.СуммаВзносовДо КАК СуммаВзносовДо,
		|	СтрокиИсправления.Заявление КАК Заявление
		|ИЗ
		|	СтрокиИсправления КАК СтрокиИсправления";
	
	Возврат Текст;
КонецФункции

Процедура УставитьНомерНаПечатьДокументаОплаты(ИтоговаяТаблица)
	Для Каждого СтрокаТЗ Из ИтоговаяТаблица Цикл
		Если ЗначениеЗаполнено(СтрокаТЗ.ПриказНомер) Тогда
			СтрокаТЗ.ПриказНомер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СтрокаТЗ.ПриказНомер);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ТаблицаМесяцев(НачалоПериода)
	ВсеМесяцы = Новый ТаблицаЗначений;
	ВсеМесяцы.Колонки.Добавить("Месяц", Новый ОписаниеТипов("Дата"));
	Для НомерМесяца = 1 По 12 Цикл
		ВсеМесяцы.Добавить().Месяц = Дата(Год(НачалоПериода), НомерМесяца, 1);
	КонецЦикла;
	Возврат ВсеМесяцы;
КонецФункции

#КонецОбласти

#Область ДанныеСведенийДляОплатыОтпускаСФР

Функция ДанныеСведенийДляОплатыОтпускаСФР(Документ)
	РеквизитыОтпуска = ОбщегоНазначенияБЗК.ЗначениеСвойства(Документ.ДополнительныеСвойства, "РеквизитыОтпуска");
	Если РеквизитыОтпуска = Неопределено Тогда
		РеквизитыОтпуска = Документ.ДанныеОтпуска();
	КонецЕсли;

	Реквизиты = Новый Структура("СуммаПремии");
	СреднийЗаработок = Документ.СреднийЗаработок.Выгрузить();
	СреднийЗаработок.Очистить();
	ПремияВсего = 0;
	
	ВидыПремий = Новый Массив;
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяПроцентом);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияГодоваяФиксированнойСуммой);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияПроцентом);
	ВидыПремий.Добавить(Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ПремияФиксированнойСуммой);
	
	ТаблицыДанныхОСреднем = УчетСреднегоЗаработка.ТаблицыДанныхОСреднемЗаработке("Отпуск",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ.Отпуск));
	ДанныеОНачислениях	= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОНачислениях"], "Ссылка", Документ.Отпуск);
	ДанныеОВремени		= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОВремени"], "Ссылка", Документ.Отпуск);
	ДанныеОбИндексации	= УчетСреднегоЗаработка.ТаблицаОтобраннаяПоПолю(ТаблицыДанныхОСреднем["ДанныеОбИндексации"], "Ссылка", Документ.Отпуск);
	
	МассивОтпусков = ВидыОтпусковОбъекта(РеквизитыОтпуска);
	Если ОстаткиОтпусков.СодержатсяТолькоОтпускаПоРабочимДням(
		МассивОтпусков, РеквизитыОтпуска.Сотрудник, РеквизитыОтпуска.ДатаНачалаСобытия) Тогда
		СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоШестидневке;
	Иначе
		СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпускаПоКалендарнымДням;
	КонецЕсли;
	
	ДополнительныеПараметры = УчетСреднегоЗаработкаКлиентСервер.ДополнительныеПараметрыРасчетаСреднегоЗаработка();
	ДополнительныеПараметры.Индексации = ДанныеОбИндексации;
	ДополнительныеПараметры.ДатаНачалаСобытия = РеквизитыОтпуска.ДатаНачалаСобытия;
	ДополнительныеПараметры.НачалоПериода = РеквизитыОтпуска.ПериодРасчетаСреднегоЗаработкаНачало;
	ДополнительныеПараметры.ОкончаниеПериода = РеквизитыОтпуска.ПериодРасчетаСреднегоЗаработкаОкончание;
	ДополнительныеПараметры.ПоСтатьямФинансирования = Ложь;
	ДополнительныеПараметры.СпособРасчетаОтпуска = СпособРасчета;

	ДанныеРасчетаСреднего = УчетСреднегоЗаработкаКлиентСервер.ДанныеДляРасчетаСреднегоЗаработка(
		ДанныеОНачислениях, ДанныеОВремени, ДополнительныеПараметры);
		
	Для Каждого ДанныеЗаработка Из ДанныеРасчетаСреднего.Заработок Цикл 
		Если ВидыПремий.Найти(ДанныеЗаработка.СоставнаяЧасть) <> Неопределено Тогда 
			ПремияВсего = ПремияВсего + ДанныеЗаработка.Учтено;
		КонецЕсли;
		Если ДанныеЗаработка.СоставнаяЧасть = Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.ОбщийЗаработок Тогда
			Если ДанныеЗаработка.Учтено = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаСредний = СреднийЗаработок.Найти(ДанныеЗаработка.Месяц, "Период");
			Если СтрокаСредний = Неопределено Тогда 
				СтрокаСредний = СреднийЗаработок.Добавить();
			КонецЕсли;
			СтрокаСредний.Период = ДанныеЗаработка.Месяц;
			СтрокаСредний.СуммаВыплат = СтрокаСредний.СуммаВыплат + ДанныеЗаработка.Учтено;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДанныеВремени Из ДанныеРасчетаСреднего.ОтработанноеВремя Цикл
		Если ДанныеВремени.Учтено = 0 Тогда
				Продолжить;
			КонецЕсли;
		СтрокаСредний = СреднийЗаработок.Найти(ДанныеВремени.Месяц, "Период");
		Если СтрокаСредний = Неопределено Тогда 
			СтрокаСредний = СреднийЗаработок.Добавить();
		КонецЕсли;
		СтрокаСредний.Период = ДанныеВремени.Месяц;
		СтрокаСредний.КалендарныхДней = ДанныеВремени.Учтено;
	КонецЦикла;
	
	СреднийЗаработок.Сортировать("Период");
	Реквизиты.Вставить("СреднийЗаработок", СреднийЗаработок);
	
	Реквизиты.СуммаПремии = ПремияВсего;
	
	Возврат Реквизиты;
КонецФункции

Функция ВидыОтпусковОбъекта(РеквизитыОтпуска)
	МассивВидовОтпусков = Новый Массив;
	Если РеквизитыОтпуска.ПредоставитьОсновнойОтпуск Или РеквизитыОтпуска.ПредоставитьКомпенсациюОсновногоОтпуска Тогда
		МассивВидовОтпусков.Добавить(ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной"));
	КонецЕсли;
	Если РеквизитыОтпуска.ПредоставитьДополнительныйОтпуск Тогда
		МассивДополнительныхОтпусков = РеквизитыОтпуска.ДополнительныеОтпуска.ВыгрузитьКолонку("ВидОтпуска");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивВидовОтпусков, МассивДополнительныхОтпусков, Истина);
	КонецЕсли;
	
	Возврат МассивВидовОтпусков;
КонецФункции

#КонецОбласти

#Область ЗаявлениеВФССОВозмещенииРасходовНаПогребение

Функция ДанныеЗаполненияЗаявленияВФССОВозмещенииРасходовНаПогребение(Организация, Ссылка, ЕдиновременноеПособие) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЗначениеЗаполнено(ЕдиновременноеПособие) Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
		|ГДЕ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка = &ДокументОснование";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИспользованныеОплаты.ДокументОснование КАК Ссылка
		|ПОМЕСТИТЬ ВТИспользованныеОплаты
		|ИЗ
		|	Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Оплаты КАК ИспользованныеОплаты
		|ГДЕ
		|	ИспользованныеОплаты.Ссылка.Организация = &Организация
		|	И ИспользованныеОплаты.Ссылка <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользованныеОплаты КАК ВТИспользованныеОплаты
		|		ПО ЕдиновременноеПособиеЗаСчетФСС.Ссылка = ВТИспользованныеОплаты.Ссылка
		|ГДЕ
		|	ЕдиновременноеПособиеЗаСчетФСС.Организация = &Организация
		|	И ЕдиновременноеПособиеЗаСчетФСС.ВидПособия = ЗНАЧЕНИЕ(Перечисление.ПереченьПособийСоциальногоСтрахования.ВСвязиСоСмертью)
		|	И ВТИспользованныеОплаты.Ссылка ЕСТЬ NULL
		|	И ЕдиновременноеПособиеЗаСчетФСС.ПометкаУдаления = ЛОЖЬ
		|	И ЕдиновременноеПособиеЗаСчетФСС.Проведен = ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|;
	|";
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ЕдиновременноеПособиеЗаСчетФСС.ФизическоеЛицо,
	|	ЕдиновременноеПособиеЗаСчетФСС.Начислено КАК РазмерПособия,
	|	ЕдиновременноеПособиеЗаСчетФСС.Ссылка КАК ДокументОснование,
	|	1 КАК КоличествоСтраниц
	|ИЗ
	|	Документ.ЕдиновременноеПособиеЗаСчетФСС КАК ЕдиновременноеПособиеЗаСчетФСС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДокументы КАК ВТДокументы
	|		ПО ЕдиновременноеПособиеЗаСчетФСС.Ссылка = ВТДокументы.Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ЕдиновременноеПособие);
	
	Возврат Запрос.Выполнить();
КонецФункции

Функция ОписаниеФиксацииРеквизитовЗаявленияВФССОВозмещенииРасходовНаПогребение() Экспорт
	ФиксируемыеРеквизиты = Новый Соответствие;
	
	// Реквизиты организации.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы           = "Организация";
	Шаблон.ОснованиеЗаполнения = "Организация";
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаименованиеТерриториальногоОрганаФСС");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "РегистрационныйНомерФСС");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДополнительныйКодФСС");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КодПодчиненностиФСС");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ИНН");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КПП");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "АдресОрганизации");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "АдресЭлектроннойПочтыОрганизации");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТелефонСоставителя");
	
	// Роль подписанта Руководитель.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ОснованиеЗаполнения      = "Организация";
	Шаблон.ИмяГруппы                = "Руководитель";
	Шаблон.ФиксацияГруппы           = Истина;
	Шаблон.ОтображатьПредупреждение = Ложь;
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Руководитель");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДолжностьРуководителя");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОснованиеПодписиРуководителя");
	
	// Реквизиты документа-основания.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.ОписаниеФиксируемогоРеквизита();
	Шаблон.ИмяГруппы           = "Оплаты";
	Шаблон.ОснованиеЗаполнения = "ДокументОснование";
	Шаблон.РеквизитСтроки      = Истина;
	Шаблон.Путь                = "Оплаты";
	
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФизическоеЛицо");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "РазмерПособия");
	ФиксацияВторичныхДанныхВДокументах.ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КоличествоСтраниц");
	
	Возврат Новый ФиксированноеСоответствие(ФиксируемыеРеквизиты);
КонецФункции

Функция ИспользуетсяЗаполнениеЗаявленияВФССОВозмещенииРасходовНаПогребение() Экспорт
	Возврат Истина;
КонецФункции

#КонецОбласти

#Область ЗаявлениеСотрудникаНаВыплатуПособия

Функция БанковскиеРеквизитыСотрудникаДляВыплатыЗарплаты(Дата, Организация, Сотрудник, ФизическоеЛицо) Экспорт
	Результат = Новый Структура("Банк, НомерСчета");
	
	СведенияОМестеВыплаты = ВзаиморасчетыССотрудникамиРасширенный.МестоВыплатыЗарплатыСотрудника(Сотрудник, ФизическоеЛицо);
	Если Не СведенияОМестеВыплаты.Выбран() Тогда
		СведенияОМестеВыплаты = ВзаиморасчетыССотрудникамиРасширенный.МестоВыплатыЗарплатыОрганизации(Организация);
	КонецЕсли;
	
	// Вид - ПеречислениеСсылка.ВидыМестВыплатыЗарплаты.
	// МестоВыплаты - СправочникСсылка.ФизическиеЛица, СправочникСсылка.Кассы,
	//                СправочникСсылка.БанковскиеСчетаКонтрагентов, СправочникСсылка.ЗарплатныеПроекты.
	
	Если СведенияОМестеВыплаты.Вид = Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект Тогда
		
		ТаблицаЛицевыхСчетов = ОбменСБанкамиПоЗарплатнымПроектам.ЛицевыеСчетаСотрудников(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник),
			Истина,
			Организация,
			Дата,
			СведенияОМестеВыплаты.МестоВыплаты);
		
		Если ТаблицаЛицевыхСчетов.Количество() > 0 Тогда
			ТаблицаЛицевыхСчетов.Сортировать("МесяцОткрытия Убыв");
			Результат.Банк       = ТаблицаЛицевыхСчетов[0].Банк;
			Результат.НомерСчета = ТаблицаЛицевыхСчетов[0].НомерЛицевогоСчета;
		КонецЕсли;
		
	ИначеЕсли СведенияОМестеВыплаты.Вид = Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет
		И ТипЗнч(СведенияОМестеВыплаты.МестоВыплаты) = Тип("СправочникСсылка.БанковскиеСчетаКонтрагентов")
		И ЗначениеЗаполнено(СведенияОМестеВыплаты.МестоВыплаты) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СведенияОМестеВыплаты.МестоВыплаты, "Банк, НомерСчета", Истина);
		ЗаполнитьЗначенияСвойств(Результат, ЗначенияРеквизитов);
		
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция РайонныйКоэффициентРФПодразделенияОрганизацииДляЗаявленияСотрудникаНаВыплатуПособия(Организация, Подразделение = Неопределено) Экспорт
	
	Если Подразделение = Неопределено Тогда
		Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка()
	КонецЕсли;
	
	// Размер районного коэффициента, установленного для организации
	РайонныйКоэффициентРФПодразделенияОрганизации = 1;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Подразделение.РайонныйКоэффициентРФ > 1
	|			ТОГДА Подразделение.РайонныйКоэффициентРФ
	|		КОГДА Организации.РайонныйКоэффициентРФ > 1
	|			ТОГДА Организации.РайонныйКоэффициентРФ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК РайонныйКоэффициентРФОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодразделенияОрганизаций КАК Подразделение
	|		ПО Организации.Ссылка = Подразделение.Владелец
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|	И (&Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ИЛИ Подразделение.Ссылка = &Подразделение)";
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		РайонныйКоэффициентРФПодразделенияОрганизации = Выборка.РайонныйКоэффициентРФОрганизации;
	КонецЕсли;
	
	Возврат РайонныйКоэффициентРФПодразделенияОрганизации
	
КонецФункции

Процедура ПометитьЗаявлениеНаУдаление(ЗаявлениеСсылка) Экспорт
	ЗаявлениеОбъект = ЗаявлениеСсылка.ПолучитьОбъект();
	ЗаявлениеОбъект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

Процедура ДобавитьКомандыПечатиЗаявленияСотрудникаНаВыплатуПособия(КомандыПечати) Экспорт
	
	// Печать заявления о выплате пособия.
	Если ПравоДоступа("Использование", Метаданные.Обработки.ПечатьПрямыеВыплатыПособийСоциальногоСтрахованияФСС) Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик     = "УправлениеПечатьюБЗККлиент.ВыполнитьКомандуПечати";
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьПрямыеВыплатыПособийСоциальногоСтрахованияФСС";
		КомандаПечати.Идентификатор  = "СправкаПоРасчетуСуммыДоплатыПособия";
		КомандаПечати.Представление  = НСтр("ru = 'Справка по расчету суммы доплаты пособия'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОбновленииВторичныхДанныхЗаявления(ЗаявлениеОбъект, ПараметрыФиксации, Модифицирован) Экспорт
	
	РеквизитыДокумента = Новый Структура("ИзвещениеИзФССНомер, ИзвещениеИзФССДата");
	Если (ЗначениеЗаполнено(ЗаявлениеОбъект.Ссылка) Или ЗначениеЗаполнено(ЗаявлениеОбъект.ДокументОснование))
		И Не ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЗаявлениеОбъект, РеквизитыДокумента) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Извещение.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Извещение.ИсходящееЗаявление = &Ссылка
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет,
		|	Извещение.ВходящийНомер КАК ВходящийНомер,
		|	Извещение.ВходящаяДата КАК ВходящаяДата
		|ИЗ
		|	Документ.ИзвещениеФСС КАК Извещение
		|ГДЕ
		|	(Извещение.ИсходящееЗаявление = &Ссылка
		|			ИЛИ Извещение.ИсходящийПервичныйДокумент = &ДокументОснование)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		Если ЗначениеЗаполнено(ЗаявлениеОбъект.Ссылка) Тогда
			Запрос.УстановитьПараметр("Ссылка", ЗаявлениеОбъект.Ссылка);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Извещение.ИсходящееЗаявление = &Ссылка", "ЛОЖЬ");
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗаявлениеОбъект.ДокументОснование) Тогда
			Запрос.УстановитьПараметр("ДокументОснование", ЗаявлениеОбъект.ДокументОснование);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Извещение.ИсходящийПервичныйДокумент = &ДокументОснование", "ЛОЖЬ");
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РеквизитыДокумента.ИзвещениеИзФССДата  = Выборка.ВходящаяДата;
			РеквизитыДокумента.ИзвещениеИзФССНомер = Формат(Выборка.ВходящийНомер, "ЧГ="); // АПК:456 Не локализуется.
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыДокумента.ИзвещениеИзФССДата = Неопределено
		И ЗначениеЗаполнено(ЗаявлениеОбъект.ИсправленныйДокумент) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Извещение.ВходящийНомер КАК ВходящийНомер,
		|	Извещение.ВходящаяДата КАК ВходящаяДата
		|ИЗ
		|	Документ.ЗапросНедостающихСведенийПособияСФР КАК Извещение
		|ГДЕ
		|	Извещение.ВходящееЗаявление = &ИсправленныйДокумент";
		Запрос.УстановитьПараметр("ИсправленныйДокумент", ЗаявлениеОбъект.ИсправленныйДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РеквизитыДокумента.ИзвещениеИзФССДата  = Выборка.ВходящаяДата;
			РеквизитыДокумента.ИзвещениеИзФССНомер = Выборка.ВходящийНомер;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыДокумента.ИзвещениеИзФССДата = Неопределено
		И ЗначениеЗаполнено(ЗаявлениеОбъект.НомерЛисткаНетрудоспособности)
		И ЗначениеЗаполнено(ЗаявлениеОбъект.ФизическоеЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Извещение.ВходящийНомер КАК ВходящийНомер,
		|	Извещение.ВходящаяДата КАК ВходящаяДата
		|ИЗ
		|	Документ.ЗапросНедостающихСведенийПособияСФР КАК Извещение
		|ГДЕ
		|	Извещение.ФизическоеЛицо = &ФизическоеЛицо
		|	И Извещение.НомерЛН = &НомерЛН";
		Запрос.УстановитьПараметр("ФизическоеЛицо", ЗаявлениеОбъект.ФизическоеЛицо);
		Запрос.УстановитьПараметр("НомерЛН", ЗаявлениеОбъект.НомерЛисткаНетрудоспособности);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РеквизитыДокумента.ИзвещениеИзФССДата  = Выборка.ВходящаяДата;
			РеквизитыДокумента.ИзвещениеИзФССНомер = Выборка.ВходящийНомер;
		КонецЦикла;
	КонецЕсли;
	
	Если РеквизитыДокумента.ИзвещениеИзФССДата <> Неопределено Тогда
		Если ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(РеквизитыДокумента, ЗаявлениеОбъект, ПараметрыФиксации) Тогда
			Модифицирован = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриОбновленииФормыЗаявления(Форма) Экспорт
	
	ЗаголовокНадписи = "";
	ЗаявлениеОбъект = Форма.Объект;
	Если ЗначениеЗаполнено(ЗаявлениеОбъект.ИзвещениеИзФССНомер)
		И ЗначениеЗаполнено(ЗаявлениеОбъект.ИзвещениеИзФССДата) Тогда
		Извещение = Документы.ЗапросНедостающихСведенийПособияСФР.НайтиПоВходящемуНомеруДате(ЗаявлениеОбъект.ИзвещениеИзФССНомер,
			ЗаявлениеОбъект.ИзвещениеИзФССДата);
		Если Извещение <> Неопределено Тогда
			Адрес = ПолучитьНавигационнуюСсылку(Извещение.Ссылка);
			ЗаголовокНадписи = СтроковыеФункции.ФорматированнаяСтрока(
				СтрШаблон("<a href=""%1"">%2</a>", Адрес, Извещение.Представление));
		КонецЕсли;
	КонецЕсли;
	Форма.Элементы.ИзвещениеИзФСССсылка.Заголовок = ЗаголовокНадписи;
	
КонецПроцедуры

#КонецОбласти

#Область РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий

Процедура ПриОпределенииЗапросаРеестраПрямыхВыплатПоОтпускамПоУходу(Запрос, ТаблицаОснований)
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОтпускПоУходуЗаРебенкомДанныеОДетях.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КОЛИЧЕСТВО(ОтпускПоУходуЗаРебенкомДанныеОДетях.Имя) > 1
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОдновременныйУходЗаНесколькимиДетьми
	|ПОМЕСТИТЬ МногодетныеДокументы
	|ИЗ
	|	ВТЗаявления КАК ВТЗаявления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком.ДанныеОДетях КАК ОтпускПоУходуЗаРебенкомДанныеОДетях
	|		ПО ВТЗаявления.ДокументОснование = ОтпускПоУходуЗаРебенкомДанныеОДетях.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтпускПоУходуЗаРебенкомДанныеОДетях.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаявления.Заявление КАК Заявление,
	|	ВТЗаявления.Сотрудник КАК Сотрудник,
	|	ВТЗаявления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ДатаРожденияРебенка КАК ДатаРожденияРебенка,
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ФамилияРебенка КАК ФамилияРебенка,
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ИмяРебенка КАК ИмяРебенка,
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ОтчествоРебенка КАК ОтчествоРебенка,
	|	ВТЗаявления.ПервичныйДокумент КАК ПервичныйДокумент,
	|	ОтпускПоУходуЗаРебенкомДанныеОДетях.Очередность КАК ОчередностьРожденияРебенка,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаСвидетельстваОРождении = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВидыПодтверждающихДокументовОтпускаПоУходу.СвидетельствоОРождении)
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаРешенияОбОпеке = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВидыПодтверждающихДокументовОтпускаПоУходу.РешениеОбУстановленииОпеки)
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаИногоДокументаПодтверждающегоРождение = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.ВидыПодтверждающихДокументовОтпускаПоУходу.ИнойДокументПодтверждающийРождениеРебенка)
	|				КОНЕЦ
	|		ИНАЧЕ ОтпускПоУходуЗаРебенкомДанныеОДетях.ВидПодтверждающегоДокумента
	|	КОНЕЦ КАК ВидПодтверждающегоДокумента,
	|	ОтпускПоУходуЗаРебенкомДанныеОДетях.НаименованиеПодтверждающегоДокумента КАК НаименованиеПодтверждающегоДокумента,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаСвидетельстваОРождении = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.ДатаСвидетельстваОРождении
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаРешенияОбОпеке = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.ДатаРешенияОбОпеке
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаИногоДокументаПодтверждающегоРождение = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.ДатаИногоДокументаПодтверждающегоРождение
	|				КОНЕЦ
	|		ИНАЧЕ ОтпускПоУходуЗаРебенкомДанныеОДетях.ДатаДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаСвидетельстваОРождении = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.СерияСвидетельстваОРождении
	|				КОНЕЦ
	|		ИНАЧЕ ОтпускПоУходуЗаРебенкомДанныеОДетях.СерияДокумента
	|	КОНЕЦ КАК СерияДокумента,
	|	ВЫБОР
	|		КОГДА ОтпускПоУходуЗаРебенком.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаСвидетельстваОРождении = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.НомерСвидетельстваОРождении
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаРешенияОбОпеке = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.НомерРешенияОбОпеке
	|					КОГДА НЕ ЗаявлениеСотрудникаНаВыплатуПособия.ДатаИногоДокументаПодтверждающегоРождение = ДАТАВРЕМЯ(1, 1, 1)
	|						ТОГДА ЗаявлениеСотрудникаНаВыплатуПособия.НомерИногоДокументаПодтверждающегоРождение
	|				КОНЕЦ
	|		ИНАЧЕ ОтпускПоУходуЗаРебенкомДанныеОДетях.НомерДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ОтпускПоУходуЗаРебенкомДанныеОДетях.НаличиеРешенияСудаОЛишенииПрав КАК НаличиеРешенияСудаОЛишенииПрав,
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ФинансированиеФедеральнымБюджетом КАК ФинансированиеФедеральнымБюджетом,
	|	МногодетныеДокументы.ОдновременныйУходЗаНесколькимиДетьми КАК ОдновременныйУходЗаНесколькимиДетьми,
	|	ВТЗаявления.ДатаПредставленияПакетаДокументов КАК ДатаПредставленияПакетаДокументов,
	|	ВТЗаявления.ИзвещениеИзФССНомер КАК ИзвещениеИзФССНомер,
	|	ВТЗаявления.ИзвещениеИзФССДата КАК ИзвещениеИзФССДата,
	|	ВЫБОР
	|		КОГДА ВТЗаявления.ИзвещениеИзФССНомер <> """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИзвещениеИзФССИспользование
	|ИЗ
	|	ВТЗаявления КАК ВТЗаявления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудникаНаВыплатуПособия
	|		ПО ВТЗаявления.Заявление = ЗаявлениеСотрудникаНаВыплатуПособия.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком.ДанныеОДетях КАК ОтпускПоУходуЗаРебенкомДанныеОДетях
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком
	|			ПО ОтпускПоУходуЗаРебенкомДанныеОДетях.Ссылка = ОтпускПоУходуЗаРебенком.Ссылка
	|		ПО ВТЗаявления.ДокументОснование = ОтпускПоУходуЗаРебенкомДанныеОДетях.Ссылка
	|			И ВТЗаявления.ИдентификаторСтрокиОснования = ОтпускПоУходуЗаРебенкомДанныеОДетях.ИдентификаторСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ МногодетныеДокументы КАК МногодетныеДокументы
	|		ПО ВТЗаявления.ДокументОснование = МногодетныеДокументы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРанееПринятыеРеестры КАК ВТРанееПринятыеРеестры
	|		ПО ВТЗаявления.Заявление = ВТРанееПринятыеРеестры.Заявление";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
