// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, "ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

// Параметры:
//  ГруппыДоступа - Массив из СправочникСсылка.ГруппыДоступаКандидатов
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Ссылка - СправочникСсылка.ГруппыДоступаКандидатов
//   * Наименование - Строка
Функция ДанныеГруппДоступа(ГруппыДоступа) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ГруппыДоступа", ГруппыДоступа);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка КАК Ссылка,
		|	ГруппыДоступа.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ГруппыДоступаКандидатов КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Ссылка В (&ГруппыДоступа)";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Параметры:
//  Пользователь -СправочникСсылка.Пользователи, Неопределено - 
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.ГруппыДоступаКандидатов
Функция ГруппыДоступаПользователя(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыДоступаКандидатов КАК ГруппыДоступа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не УправлениеДоступом.ПроизводительныйВариант() И Пользователь <> Пользователи.АвторизованныйПользователь() Тогда
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;

	ГруппыДоступа = Новый Массив;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ГруппаДоступа = Выборка.Ссылка; // СправочникСсылка.ГруппыДоступаКандидатов
		Если УправлениеДоступом.ЧтениеРазрешено(ГруппаДоступа, Пользователь) Тогда
			ГруппыДоступа.Добавить(ГруппаДоступа);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ГруппыДоступа;
	
КонецФункции

#КонецОбласти

#КонецЕсли
