
#Область ПрограммныйИнтерфейс

// Заполняет из таблицы характеристик персонала две связанные таблицы с характеристиками персонала и их значениями.
//
// Параметры:
//  ХарактеристикиПерсоналаОбъект	- ТабличнаяЧасть - таблица характеристик персонала, по которой заполняются другие таблицы.
//  ТаблицаХарактеристик			- ДанныеФормыКоллекция - таблица, которая заполняется характеристиками персонала.
//  ТаблицаЗначений					- ДанныеФормыКоллекция - таблица, которая заполняется значениями характеристик персонала.
//
Процедура ПрочитатьХарактеристикиВТаблицы(ХарактеристикиПерсоналаОбъект, ТаблицаХарактеристик, ТаблицаЗначений) Экспорт
	
	ТаблицаХарактеристик.Очистить();
	ТаблицаЗначений.Очистить();
	
	ТЗХарактеристик = ХарактеристикиПерсоналаОбъект.Выгрузить();
	СвернутьТаблицуЗначенийХарактеристик(ТЗХарактеристик);
	
	ЕстьИдентификаторСтроки = ТЗХарактеристик.Колонки.Найти("ИдентификаторСтрокиПозиции") <> Неопределено;
	Для Каждого ТекущаяСтрока Из ТЗХарактеристик Цикл
		
		НоваяСтрока = ТаблицаХарактеристик.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
		// Заполним значения характеристики.
		СтруктураОтбора = Новый Структура("Характеристика", ТекущаяСтрока.Характеристика);
		Если ЕстьИдентификаторСтроки Тогда
			СтруктураОтбора.Вставить("ИдентификаторСтрокиПозиции", ТекущаяСтрока.ИдентификаторСтрокиПозиции);
		КонецЕсли;
		СтрокиЗначений = ХарактеристикиПерсоналаОбъект.НайтиСтроки(СтруктураОтбора);
		Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
			НоваяСтрокаЗначения = ТаблицаЗначений.Добавить();
			НоваяСтрокаЗначения.Характеристика = ТекущаяСтрока.Характеристика;
			УстановитьСвойствоРеквизита(НоваяСтрокаЗначения, СтрокаЗначения, "Значение");
			УстановитьСвойствоРеквизита(НоваяСтрокаЗначения, СтрокаЗначения, "ВесЗначения");
			УстановитьСвойствоРеквизита(НоваяСтрокаЗначения, СтрокаЗначения, "ИдентификаторСтрокиПозиции");
		КонецЦикла;
		
		// Заполним ЗначенияСтрокой
		Если НоваяСтрока.Свойство("ЗначенияСтрокой") Тогда
			НоваяСтрока.ЗначенияСтрокой = ХарактеристикиПерсоналаКлиентСервер.ЗначенияСтрокой(ТаблицаЗначений, ТекущаяСтрока.Характеристика);
		КонецЕсли;
		
	КонецЦикла;	
	
	ЗаполнитьКартинкуИВидХарактеристикиТаблицыХарактеристик(ТаблицаХарактеристик);
	
КонецПроцедуры

// Переносит характеристики персонала и их значения из таблиц форм в табличную часть объектов.
//
// Параметры:
//  ТабличнаяЧастьОбъекта	- ТабличнаяЧасть - табличная часть ХарактеристикиПерсонала справочника или документа.
//  Характеристики			- ДанныеФормыКоллекция - таблица с характеристиками персонала.
//  ЗначенияХарактеристики 	- ДанныеФормыКоллекция - таблица со значениями характеристик персонала.
//
Процедура ПеренестиХарактеристикиВТабличнуюЧасть(ТабличнаяЧастьОбъекта, Характеристики, ЗначенияХарактеристики) Экспорт
	
	ТабличнаяЧастьОбъекта.Очистить();
	ЕстьИдентификаторСтроки = Характеристики.Выгрузить().Колонки.Найти("ИдентификаторСтрокиПозиции") <> Неопределено;
	Для Каждого СтрокаХарактеристик Из Характеристики Цикл
		СтруктураОтбора = Новый Структура("Характеристика", СтрокаХарактеристик.Характеристика);
		Если ЕстьИдентификаторСтроки Тогда
			СтруктураОтбора.Вставить("ИдентификаторСтрокиПозиции", СтрокаХарактеристик.ИдентификаторСтрокиПозиции);
		КонецЕсли;
		СтрокиЗначений = ЗначенияХарактеристики.НайтиСтроки(СтруктураОтбора);
		Если СтрокиЗначений.Количество() = 0 Тогда
			НоваяСтрока = ТабличнаяЧастьОбъекта.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаХарактеристик);
		Иначе
			Для Каждого СтрокаЗначения Из СтрокиЗначений Цикл
				НоваяСтрока = ТабличнаяЧастьОбъекта.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаХарактеристик);
				УстановитьСвойствоРеквизита(НоваяСтрока, СтрокаЗначения, "Значение");
				УстановитьСвойствоРеквизита(НоваяСтрока, СтрокаЗначения, "ВесЗначения");
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизиты "КартинкаВида" и "ВидХарактеристики" в строках переданной таблицы.
//
// Параметры:
//  ТаблицаХарактеристик	- ДанныеФормыКоллекция - таблица с характеристиками персонала.
//  ТаблицаЗначений 		- ДанныеФормыКоллекция - таблица со значениями характеристик персонала.
//
Процедура ЗаполнитьКартинкуИВидХарактеристикиТаблицыХарактеристик(ТаблицаХарактеристик, ТаблицаЗначений = Неопределено) Экспорт

	ЗаполнитьВторичныеРеквизитыТаблицыХарактеристик("ВидХарактеристики,КартинкаВида", ТаблицаХарактеристик, ТаблицаЗначений);

КонецПроцедуры

// Заполняет вторичные реквизиты в строках переданной таблицы
//
// Параметры:
//	СтрокаПолей 			- Строка - содержит имена реквизитов, которые необходимо заполнить.
//  ТаблицаХарактеристик	- ДанныеФормыКоллекция - таблица с характеристиками персонала.
//  ТаблицаЗначений			- ДанныеФормыКоллекция - таблица со значениями характеристик персонала.
//
// Пример:
//	ЗаполнитьВторичныеРеквизитыТаблицыХарактеристик("ВидХарактеристики,КартинкаВида", ТаблицаХарактеристик, ТаблицаЗначений)
//
Процедура ЗаполнитьВторичныеРеквизитыТаблицыХарактеристик(СтрокаПолей, ТаблицаХарактеристик, ТаблицаЗначений = Неопределено) Экспорт

	МассивПолей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрокаПолей, ",");
	
	Если МассивПолей.Найти("ВидХарактеристики") <> Неопределено  Тогда
		МассивХарактеристик = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаХарактеристик, "Характеристика");
		СоответствиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивХарактеристик, "ВидХарактеристики");
	КонецЕсли;
	
	Для каждого СтрокаХарактеристики Из ТаблицаХарактеристик Цикл
		Если МассивПолей.Найти("ВидХарактеристики") <> Неопределено Тогда
			СтрокаХарактеристики.ВидХарактеристики = СоответствиеХарактеристик[СтрокаХарактеристики.Характеристика];
			Если МассивПолей.Найти("КартинкаВида") <> Неопределено Тогда
				СтрокаХарактеристики.КартинкаВида = ХарактеристикиПерсонала.КартинкаВидаХарактеристики(СтрокаХарактеристики.ВидХарактеристики);
			КонецЕсли;
		КонецЕсли;
		Если МассивПолей.Найти("ЗначенияСтрокой") <> Неопределено Тогда
			СтрокаХарактеристики.ЗначенияСтрокой = ХарактеристикиПерсоналаКлиентСервер.ЗначенияСтрокой(ТаблицаЗначений, СтрокаХарактеристики.Характеристика);
		КонецЕсли;
	КонецЦикла; 	

КонецПроцедуры

// Добавляет выбранные характеристики в табличные части.
// Вызывается после завершения добавления или подбора характеристик.
//
// Параметры:
//	Форма								- Форма - форма, в которую добавляются характеристики.
//  НовыеХарактеристики					- Массив структур - добавляемые характеристики со значениями.
//  ДополнительныеПараметры				- Структура.
//	ИмяРеквизитаТаблицыХарактеристик	- Строка - имя реквизита формы, содержащего таблицу характеристик.
//	ИмяРеквизитаТаблицыЗначений			- Строка - имя реквизита формы, содержащего таблицу значений характеристик.
//	СтруктураЗначенийПоУмолчанию		- Структура - значения заполнения для новой строки характеристик.
//
Процедура ДобавитьХарактеристикиВТабличнуюЧасть(Форма, НовыеХарактеристики, ДополнительныеПараметры, ИмяРеквизитаТаблицыХарактеристик = "Характеристики") Экспорт 
	
	ИмяРеквизитаТаблицыЗначений = "ЗначенияХарактеристики";
	ДобавлятьЗначенияХарактеристик = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "ДобавлятьЗначенияХарактеристик", Ложь);
	СтруктураЗначенийПоУмолчанию = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеПараметры, "СтруктураЗначенийПоУмолчанию");
	
	ТаблицаХарактеристик = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ИмяРеквизитаТаблицыХарактеристик);
	
	Если ДобавлятьЗначенияХарактеристик Тогда
		Если НовыеХарактеристики.Количество() > 0 Тогда
			Форма.Модифицированность = Истина;
			ТаблицаЗначений = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ИмяРеквизитаТаблицыЗначений);
			ДобавитьХарактеристикиСоЗначениями(ТаблицаХарактеристик, ТаблицаЗначений, НовыеХарактеристики);
		КонецЕсли;
	Иначе
		ДобавитьХарактеристики(Форма, ТаблицаХарактеристик, НовыеХарактеристики, СтруктураЗначенийПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

// Добавляет характеристики персонала и их значения в таблицы.
//
// Параметры:
//  Форма - Форма - форма, в которую добавляются характеристики.
//  ТаблицаХарактеристик - ДанныеФормыКоллекция - таблица, в которую добавляются характеристики персонала.
//  НовыеХарактеристики - Массив,
//		- либо массив характеристик персонала.
//		- либо массив структур со свойствами добавляемых строк характеристик персонала.
//  СтруктураЗначенийПоУмолчанию - Структура - структура со значениями реквизитов строки по умолчанию.
//
Процедура ДобавитьХарактеристики(Форма, ТаблицаХарактеристик, НовыеХарактеристики, СтруктураЗначенийПоУмолчанию) Экспорт
	
	ЕстьНовыеЗначения = Ложь;
	
	Для Каждого ТекущаяСтрока Из НовыеХарактеристики Цикл
		Если ТипЗнч(ТекущаяСтрока) = Тип("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала") Тогда
			Характеристика = ТекущаяСтрока;
		Иначе
			Характеристика = ТекущаяСтрока.Характеристика
		КонецЕсли;
		НайденныеСтроки = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("Характеристика", Характеристика));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТаблицаХарактеристик.Добавить();
		Если СтруктураЗначенийПоУмолчанию <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураЗначенийПоУмолчанию);
		КонецЕсли;
		НоваяСтрока.Характеристика = Характеристика;
		ЕстьНовыеЗначения = Истина;
	КонецЦикла;
	
	Если ЕстьНовыеЗначения Тогда
		Форма.Модифицированность = Истина;
		ЗаполнитьКартинкуИВидХарактеристикиТаблицыХарактеристик(ТаблицаХарактеристик);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет характеристики персонала и их значения в таблицы.
//
// Параметры:
//  ТаблицаХарактеристик	- ДанныеФормыКоллекция - таблица, в которую добавляются характеристики персонала.
//  ТаблицаЗначений			- ДанныеФормыКоллекция - таблица, в которую добавляются значения характеристик персонала.
//  НовыеХарактеристики		- Массив - массив структур со свойствами добавляемых строк характеристик персонала.
//
Процедура ДобавитьХарактеристикиСоЗначениями(ТаблицаХарактеристик, ТаблицаЗначений, НовыеХарактеристики) Экспорт
	
	ТЗТаблицыХарактеристик = ТаблицаХарактеристик.Выгрузить().СкопироватьКолонки();
	ТЗТаблицыЗначений = ТаблицаЗначений.Выгрузить().СкопироватьКолонки();
	
	ЕстьВесЗначения = (ТЗТаблицыЗначений.Колонки.Найти("ВесЗначения") <> Неопределено);
	ЕстьВес = (ТЗТаблицыХарактеристик.Колонки.Найти("Вес") <> Неопределено);
	ЕстьТребуетсяПроверка = (ТЗТаблицыХарактеристик.Колонки.Найти("ТребуетсяПроверка") <> Неопределено);
	ЕстьТребуетсяОбучение = (ТЗТаблицыХарактеристик.Колонки.Найти("ТребуетсяОбучение") <> Неопределено);
	
	// Заполняем промежуточную ТЗТаблицыХарактеристик и ТаблицаЗначений.
	Для каждого ТекущаяСтрока Из НовыеХарактеристики Цикл
		НоваяСтрока = ТЗТаблицыХарактеристик.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока); 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Характеристика", ТекущаяСтрока.Характеристика);
		СтруктураПоиска.Вставить("Значение", ТекущаяСтрока.Значение);
		НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
		
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Добавляем значение.
			ЗаполнитьЗначенияСвойств(ТаблицаЗначений.Добавить(), ТекущаяСтрока);
		Иначе
			// Инкрементируем вес, в случае его наличия в строке.
			Если ЕстьВесЗначения Тогда
				НайденныеСтроки[0].ВесЗначения = НайденныеСтроки[0].ВесЗначения + ТекущаяСтрока.ВесЗначения;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	СвернутьТаблицуЗначенийХарактеристик(ТЗТаблицыХарактеристик);
	
	Для Каждого ТекущаяСтрока Из ТЗТаблицыХарактеристик Цикл
		НайденныеСтроки = ТаблицаХарактеристик.НайтиСтроки(Новый Структура("Характеристика", ТекущаяСтрока.Характеристика));
		Если НайденныеСтроки.Количество() = 0 Тогда
			// Добавляем характеристику.
			ЗаполнитьЗначенияСвойств(ТаблицаХарактеристик.Добавить(), ТекущаяСтрока);
		Иначе
			Если ЕстьВес Тогда
				НайденныеСтроки[0].Вес = НайденныеСтроки[0].Вес + ТекущаяСтрока.Вес;
			КонецЕсли;
			Если ЕстьТребуетсяПроверка Тогда
				НайденныеСтроки[0].ТребуетсяПроверка = НайденныеСтроки[0].ТребуетсяПроверка ИЛИ ТекущаяСтрока.ТребуетсяПроверка;
			КонецЕсли;
			Если ЕстьТребуетсяОбучение Тогда
				НайденныеСтроки[0].ТребуетсяОбучение = НайденныеСтроки[0].ТребуетсяОбучение ИЛИ ТекущаяСтрока.ТребуетсяОбучение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьВторичныеРеквизитыТаблицыХарактеристик("ВидХарактеристики,КартинкаВида,ЗначенияСтрокой", ТаблицаХарактеристик, ТаблицаЗначений);
	
КонецПроцедуры

// Заполняет дерево характеристик с группировкой по компетенциям.
//
// Параметры:
//  ТаблицаХарактеристик	- ДанныеФормыКоллекция - таблица, содержащая характеристики.
//  ДеревоХарактеристик 	- ДанныеФормыКоллекция - формируемое дерево значений.
//  СоЗначениями			- Булево - признак необходимости учитывать значения характеристик.
//
Процедура ЗаполнитьДеревоХарактеристик(ТаблицаХарактеристик, ДеревоХарактеристик, СоЗначениями = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаХарактеристик.Характеристика КАК Характеристика,
		|	ТаблицаХарактеристик.ВидХарактеристики КАК ВидХарактеристики,
		|	&ЗначенияСтрокой КАК ЗначенияСтрокой,
		|	ТаблицаХарактеристик.КартинкаВида КАК КартинкаВида
		|ПОМЕСТИТЬ ВТХарактеристики
		|ИЗ
		|	&ТаблицаХарактеристик КАК ТаблицаХарактеристик
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Ссылка КАК Компетенция,
		|	КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТКомпетенции
		|ИЗ
		|	Справочник.КомпетенцииПерсонала.ХарактеристикиПерсонала КАК КомпетенцииПерсоналаХарактеристикиПерсонала
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТХарактеристики КАК ВТХарактеристики
		|		ПО КомпетенцииПерсоналаХарактеристикиПерсонала.Характеристика = ВТХарактеристики.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТКомпетенции.Компетенция КАК Компетенция,
		|	ВТХарактеристики.Характеристика КАК Характеристика,
		|	ВТХарактеристики.ВидХарактеристики КАК ВидХарактеристики,
		|	ВТХарактеристики.ЗначенияСтрокой КАК ЗначенияСтрокой,
		|	ВТХарактеристики.КартинкаВида КАК КартинкаВида
		|ИЗ
		|	ВТХарактеристики КАК ВТХарактеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКомпетенции КАК ВТКомпетенции
		|		ПО ВТХарактеристики.Характеристика = ВТКомпетенции.Характеристика
		|ИТОГИ ПО
		|	Компетенция";
	Запрос.УстановитьПараметр("ТаблицаХарактеристик", ТаблицаХарактеристик.Выгрузить());
	
	Если СоЗначениями Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗначенияСтрокой", "ТаблицаХарактеристик.ЗначенияСтрокой");
	Иначе
		Запрос.УстановитьПараметр("ЗначенияСтрокой", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗаполнитьДеревоХарактеристикПоКомпетенциям(РезультатЗапроса, ДеревоХарактеристик);
	
КонецПроцедуры

// Проверяет заполненность значений характеристик в табличных частях форм.
//	Форма должна иметь реквизиты "Характеристики" и "ЗначенияХарактеристики" с типом "табличная часть".
//
// Параметры:
//  Форма 					- Управляемая форма.
//  Отказ 					- Булево - отказ от записи.
//  ПроверяемыеРеквизиты	- Массив - массив проверяемых реквизитов.
//
Процедура ОбработкаПроверкиЗаполненияТабличныхЧастейХарактеристик(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт

	Ошибки = Неопределено;
	
	Если Форма.Характеристики.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаХарактеристик Из Форма.Характеристики Цикл
		СтрокиЗначений = Форма.ЗначенияХарактеристики.НайтиСтроки(Новый Структура("Характеристика", СтрокаХарактеристик.Характеристика));
		Если СтрокиЗначений.Количество() = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Укажите требуемые значения для характеристики ""%1""'"), 
				Строка(СтрокаХарактеристик.Характеристика));
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки,
				"Характеристики[%1].ЗначенияСтрокой",
				ТекстСообщения,
				"",
				Форма.Характеристики.Индекс(СтрокаХарактеристик));
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);

КонецПроцедуры

// Проверяет заполненность значений анкеты или теста, если выбран способ оценки в табличных частях форм.
//	Форма должна иметь реквизиты "Объект.ЭтапыРаботыСКандидатами" с типом "табличная часть".
//
// Параметры:
//  Форма					- Форма - форма, в которой выполняется проверка
//  Отказ 					- Булево - отказ от записи.
//  ПроверяемыеРеквизиты	- Массив - массив проверяемых реквизитов.
//
Процедура ОбработкаПроверкиЗаполненияТабличныхЧастейЭтаповРабот(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт

	Ошибки = Неопределено;
	ЭтапыРаботы = Форма.Объект.ЭтапыРаботыСКандидатами;
	
	Если ЭтапыРаботы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Этап Из ЭтапыРаботы Цикл
		Если ЗначениеЗаполнено(Этап.СпособОценкиХарактеристик) И Не ЗначениеЗаполнено(Этап.ШаблонАнкеты) Тогда
			Если Этап.СпособОценкиХарактеристик = Перечисления.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью Тогда
				ТекстСообщения = НСтр("ru = 'На этапе %1 не указана анкета'");
			ИначеЕсли Этап.СпособОценкиХарактеристик = Перечисления.СпособыОценкиХарактеристик.ЭлектронныйТест Тогда
				ТекстСообщения = НСтр("ru = 'На этапе %1 не указан тест'");
			КонецЕсли;
			ТекстОшибки = СтрШаблон(ТекстСообщения, Этап.ЭтапРаботы);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				Ошибки,
				"Объект.ЭтапыРаботыСКандидатами[%1].ШаблонАнкеты",
				ТекстОшибки,
				"",
				ЭтапыРаботы.Индекс(Этап));
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

// Заполняет вторичную таблицу характеристик характеристиками, содержащимися в мероприятии обучения и развития.
//
// Параметры:
//  ТаблицаХарактеристик	- ДанныеФормыКоллекция - таблица с характеристиками персонала.
//  МероприятиеСсылка		- МероприятияОбученияРазвитияСсылка - мероприятие обучения и развития.
//
Процедура ЗаполнитьВторичнуюТаблицуХарактеристикИзМероприятия(ТаблицаХарактеристик, МероприятиеСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МероприятияОбученияРазвитияХарактеристикиПерсонала.Характеристика КАК Характеристика
		|ИЗ
		|	Справочник.МероприятияОбученияРазвития.ХарактеристикиПерсонала КАК МероприятияОбученияРазвитияХарактеристикиПерсонала
		|ГДЕ
		|	МероприятияОбученияРазвитияХарактеристикиПерсонала.Ссылка = &МероприятиеСсылка";
	Запрос.УстановитьПараметр("МероприятиеСсылка", МероприятиеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаХарактеристик.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

// Устанавливается ограничение типа в зависимости от способа оценки характеристик
// 
// Параметры:
//  Форма			- Форма - форма, в которой устанавливаются свойства
Процедура УстановитьСвойстваЭлементовОценкиХарактеристик(Форма) Экспорт

	Элементы = Форма.Элементы;
	
	// Доступен один инструмент оценки
	Если Форма.ИспользоватьЭлектронноеИнтервью И Не Форма.ИспользоватьЭлектронноеТестирование
		Или Не Форма.ИспользоватьЭлектронноеИнтервью И Форма.ИспользоватьЭлектронноеТестирование Тогда
		Форма.ИспользуетсяОдинИнструментОценки = Истина;
		Если Форма.ИспользоватьЭлектронноеИнтервью Тогда
			Элементы.ЭтапыРаботыСКандидатамиШаблонАнкеты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ШаблоныАнкет");
		Иначе
			Элементы.ЭтапыРаботыСКандидатамиШаблонАнкеты.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы");
		КонецЕсли;
	КонецЕсли;
	Элементы.ЭтапыРаботыСКандидатамиСпособОценкиХарактеристик.Видимость = Не Форма.ИспользуетсяОдинИнструментОценки;
	
КонецПроцедуры

// Заполняет дерево характеристик с группировкой по компетенциям.
// 
// Параметры:
//  РезультатЗапроса - РезультатЗапроса - результат запроса с данными для заполнения дерева характеристик.
//  ДеревоХарактеристик - ДанныеФормыКоллекция - заполняемое дерево характеристик.
Процедура ЗаполнитьДеревоХарактеристикПоКомпетенциям(РезультатЗапроса, ДеревоХарактеристик) Экспорт

	ДеревоХарактеристик.Строки.Очистить();
	
	ВыборкаКомпетенций = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока ВыборкаКомпетенций.Следующий() Цикл
		Если ВыборкаКомпетенций.Компетенция = Null Тогда
			СтрокаКомпетенций = ДеревоХарактеристик;
		Иначе
			СтрокаКомпетенций = ДеревоХарактеристик.Строки.Добавить();
			СтрокаКомпетенций.Характеристика = ВыборкаКомпетенций.Компетенция;
			СтрокаКомпетенций.ЭтоКомпетенция = Истина;
			СтрокаКомпетенций.КартинкаВида = 10;
		КонецЕсли;
		
		ВыборкаХарактеристик = ВыборкаКомпетенций.Выбрать();
		Пока ВыборкаХарактеристик.Следующий() Цикл
			СтрокаХарактеристик = СтрокаКомпетенций.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаХарактеристик, ВыборкаХарактеристик);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Сохраняет в настройках пользователя нажатость кнопки "По компетенциям"
//
Процедура СохранитьРежимОтображенияПоКомпетенциям(ИмяНастроек, ЭлементКнопка) Экспорт
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастройкиПользователя", ИмяНастроек, ЭлементКнопка.Пометка);
КонецПроцедуры

// Загружает из настроек пользователя нажатость кнопки "По компетенциям"
//
Процедура ЗагрузитьРежимОтображенияПоКомпетенциям(ИмяНастроек, ЭлементКнопка) Экспорт
	ЭлементКнопка.Пометка = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователя", ИмяНастроек, Ложь);
КонецПроцедуры

#Область ШтатноеРасписание

Процедура ДополнитьФормуШтатногоРасписания(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы")
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДействияПозицийШтатногоРасписания)
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ХарактеристикиПерсоналаПозицийШтатногоРасписания)  Тогда
		
		Возврат;
	КонецЕсли;
	
	ДополнитьФормуШтатногоРасписанияДействиямиИХарактеристиками(Форма);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеДобавитьХарактеристикиИзДействийНаСервере(Форма, МассивДобавленныхДействий) Экспорт
	
	ДобавляемыеХарактеристики = ХарактеристикиПерсонала.МассивСтруктурХарактеристикСоЗначениямиИзДействий(МассивДобавленныхДействий);
	ДобавитьХарактеристикиСоЗначениями(Форма.Характеристики, Форма.ЗначенияХарактеристики, ДобавляемыеХарактеристики);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеЗаполнитьДействияХарактеристикиИзПрофиляНаСервере(Форма, ПрофильДолжности = Неопределено, ИдентификаторСтрокиПозиции = Неопределено, ОбновитьХарактеристики = Истина) Экспорт

	Если ПрофильДолжности = Неопределено И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПрофильДолжности") Тогда
		ПрофильДолжности = Форма.ПрофильДолжности;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ПрофильДолжности) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = Справочники.ПрофилиДолжностей.ПараметрыПолученияДанныхПрофиляДолжности();
	ПараметрыПолучения.ДействияСотрудников = Истина;
	ПараметрыПолучения.ХарактеристикиПерсонала = Истина;
	
	ДанныеПрофиля = Справочники.ПрофилиДолжностей.ДанныеПрофиляДолжности(ПрофильДолжности, ПараметрыПолучения);
	
	Если Форма.ДействияСотрудников.Выгрузить().Колонки.Найти("ИдентификаторСтрокиПозиции") = Неопределено Тогда
		Форма.ДействияСотрудников.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ДействияСотрудников, Форма.ДействияСотрудников);
		
		Форма.ХарактеристикиПерсонала.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеПрофиля.ХарактеристикиПерсонала, Форма.ХарактеристикиПерсонала);	
	Иначе
		СтруктураОтбора = Новый Структура("ИдентификаторСтрокиПозиции", ИдентификаторСтрокиПозиции);
		
		УдаляемыеСтроки = Форма.ДействияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Форма.ДействияСотрудников.Удалить(Форма.ДействияСотрудников.Индекс(УдаляемаяСтрока));
		КонецЦикла;
		Для Каждого СтрокаТаблицыПрофиля Из ДанныеПрофиля.ДействияСотрудников Цикл
			НоваяСтрока = Форма.ДействияСотрудников.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыПрофиля);
			НоваяСтрока.ИдентификаторСтрокиПозиции = ИдентификаторСтрокиПозиции;
		КонецЦикла;
		
		УдаляемыеСтроки = Форма.ХарактеристикиПерсонала.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Форма.ХарактеристикиПерсонала.Удалить(Форма.ХарактеристикиПерсонала.Индекс(УдаляемаяСтрока));
		КонецЦикла;
		Для Каждого СтрокаТаблицыПрофиля Из ДанныеПрофиля.ХарактеристикиПерсонала Цикл
			НоваяСтрока = Форма.ХарактеристикиПерсонала.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыПрофиля);
			НоваяСтрока.ИдентификаторСтрокиПозиции = ИдентификаторСтрокиПозиции;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбновитьХарактеристики Тогда
		ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	КонецЕсли;
	
КонецПроцедуры

Процедура ШтатноеРасписаниеДобавитьХарактеристикиВТабличнуюЧасть(Форма, НовыеХарактеристики, ДополнительныеПараметры) Экспорт
	ДобавитьХарактеристикиВТабличнуюЧасть(Форма, НовыеХарактеристики, ДополнительныеПараметры);
КонецПроцедуры

Процедура ПроверитьЗаполнениеПозицииШтатногоРасписания(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Характеристики") Тогда
		Возврат;
	КонецЕсли;
	
	ОбработкаПроверкиЗаполненияТабличныхЧастейХарактеристик(Форма, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеПередЗаписьюНаСервере(Форма) Экспорт

	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Характеристики") Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиХарактеристикиВТабличнуюЧасть(
		Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

Процедура ШтатноеРасписаниеПриЗаписиНаСервере(Форма) Экспорт

	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Характеристики") Тогда
		Возврат;
	КонецЕсли;
	
	ХарактеристикиПерсонала.ЗаписатьДанныеДействийХарактеристикШтатногоРасписания(Форма);
	
КонецПроцедуры

Процедура ПриПолученииВнешнихДанныхПозицииШтатногоРасписания(Форма, ДанныеПозиции) Экспорт
	
	Если Форма.Элементы.Найти("ПрофильДолжности") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ПрофильДолжности = ДанныеПозиции.ПрофильДолжности;
	Форма.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = ДанныеПозиции.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло;
	
	ХарактеристикиПерсоналаКлиентСервер.ШтатноеРасписаниеУстановитьДоступностьЭлементовДействийХарактеристик(Форма);
	
	Форма.ХарактеристикиПерсонала.Очистить();
	Если Не ДанныеПозиции.ХарактеристикиПерсонала = Неопределено Тогда
		Для каждого ОписаниеХарактеристик Из ДанныеПозиции.ХарактеристикиПерсонала Цикл
			ЗаполнитьЗначенияСвойств(Форма.ХарактеристикиПерсонала.Добавить(), ОписаниеХарактеристик);
		КонецЦикла;
	КонецЕсли;
	
	Форма.ДействияСотрудников.Очистить();	
	Если Не ДанныеПозиции.ДействияСотрудников = Неопределено Тогда
		Для каждого ОписаниеДействий Из ДанныеПозиции.ДействияСотрудников Цикл
			ЗаполнитьЗначенияСвойств(Форма.ДействияСотрудников.Добавить(), ОписаниеДействий);
		КонецЦикла;
	КонецЕсли;
	
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

Процедура ПриПолученииДанныхПозицииШтатногоРасписания(Форма, ПозицияСсылка) Экспорт
	
	Если Форма.Элементы.Найти("ПрофильДолжности") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПрочитатьДанныеДействийХарактеристикШтатногоРасписания(Форма, ПозицияСсылка);
	
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
	ХарактеристикиПерсоналаКлиентСервер.ШтатноеРасписаниеУстановитьДоступностьЭлементовДействийХарактеристик(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыИзмененияШтатноеРасписание

Процедура ДополнитьФормуДокументовИзмененияШтатногоРасписания(Форма, ПутьКТаблицеПозиций = "Объект.Позиции") Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы")
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ДействияПозицийШтатногоРасписания)
		ИЛИ Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ХарактеристикиПерсоналаПозицийШтатногоРасписания)  Тогда
		
		Возврат;
	КонецЕсли;

	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ХарактеристикиПерсонала") Тогда
		СоздатьРеквизитПрофиляДолжности(Форма, ПутьКТаблицеПозиций);
		СоздатьРеквизитыДействий(Форма, Истина, ПутьКТаблицеПозиций);
		СоздатьРеквизитыХарактеристикПерсонала(Форма, Истина);
	КонецЕсли;
	
	Позиции = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКТаблицеПозиций);
	Если Позиции.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьНастройкиДействийХарактеристикДокументовИзмененияШтатногоРасписания(Форма, Позиции);
	
	Форма.ДействияСотрудников.Очистить();
	Форма.ХарактеристикиПерсонала.Очистить();
	
	Для каждого СтрокаПозиции Из Позиции Цикл
		Если СтрокаПозиции.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = 0 Тогда
			Продолжить;
		КонецЕсли;
		ШтатноеРасписаниеЗаполнитьДействияХарактеристикиИзПрофиляНаСервере(Форма, СтрокаПозиции.ПрофильДолжности, СтрокаПозиции.ИдентификаторСтрокиПозиции, Ложь)
	КонецЦикла;
	
	ПрочитатьДанныеПозицийДокументовИзмененияШтатногоРасписания(Форма.ДействияСотрудников, Форма.ХарактеристикиПерсонала, Позиции);
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

Процедура ПрочитатьДанныеПозицииВФорму(Форма, Объект, НовыеДанныеПозиции) Экспорт
	
	Если Не НовыеДанныеПозиции.Свойство("ПрофильДолжности") Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого ИдентификаторВыделеннойСтроки Из Форма.Элементы.Позиции.ВыделенныеСтроки Цикл
		ВыделеннаяСтрока = Объект.Позиции.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		СтруктураОтбора = Новый Структура("ИдентификаторСтрокиПозиции", ВыделеннаяСтрока.ИдентификаторСтрокиПозиции);
		
		УдаляемыеСтроки = Форма.ХарактеристикиПерсонала.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Форма.ХарактеристикиПерсонала.Удалить(Форма.ХарактеристикиПерсонала.Индекс(УдаляемаяСтрока));
		КонецЦикла;
		
		УдаляемыеСтроки = Форма.ДействияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для Каждого УдаляемаяСтрока Из УдаляемыеСтроки Цикл
			Форма.ДействияСотрудников.Удалить(Форма.ДействияСотрудников.Индекс(УдаляемаяСтрока));
		КонецЦикла;
	КонецЦикла;
	
	ДанныеТекущейПозиции = Объект.Позиции.НайтиПоИдентификатору(Форма.ИдентификаторРедактируемойСтроки);
	
	Для каждого ОписаниеХарактеристики Из НовыеДанныеПозиции.ХарактеристикиПерсонала Цикл
		НоваяСтрокаХарактеристик = Форма.ХарактеристикиПерсонала.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаХарактеристик, ОписаниеХарактеристики);
		НоваяСтрокаХарактеристик.ИдентификаторСтрокиПозиции = ДанныеТекущейПозиции.ИдентификаторСтрокиПозиции;
	КонецЦикла;
	
	Для каждого ОписаниеДействий Из НовыеДанныеПозиции.ДействияСотрудников Цикл
		НоваяСтрокаДействий = Форма.ДействияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДействий, ОписаниеДействий);
		НоваяСтрокаДействий.ИдентификаторСтрокиПозиции = ДанныеТекущейПозиции.ИдентификаторСтрокиПозиции;
	КонецЦикла;
	
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

Процедура ЗаполнитьТекущиеДанныеПозиции(Форма, ТекущиеДанные) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ХарактеристикиПерсонала") Тогда
		Возврат;
	КонецЕсли;
		
	ДанныеТекущейПозиции = Новый Структура;
	ХарактеристикиПерсонала.ДополнитьДанныеПозицииШтатногоРасписания(ДанныеТекущейПозиции, ТекущиеДанные.Позиция);
	
	Если ДанныеТекущейПозиции.СоответствуютПрофилюДолжности Тогда
		ШтатноеРасписаниеЗаполнитьДействияХарактеристикиИзПрофиляНаСервере(Форма, ДанныеТекущейПозиции.ПрофильДолжности, ТекущиеДанные.ИдентификаторСтрокиПозиции, Ложь)
	КонецЕсли;
	
	ТекущиеДанные.ПрофильДолжности = ДанныеТекущейПозиции.ПрофильДолжности;
	ТекущиеДанные.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = ДанныеТекущейПозиции.СоответствуютПрофилюДолжности;
	
	Позиции = Новый ТаблицаЗначений;
	Позиции.Колонки.Добавить("Позиция", Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание"));
	Позиции.Колонки.Добавить("ИдентификаторСтрокиПозиции", ОбщегоНазначения.ОписаниеТипаЧисло(5));
	Позиции.Колонки.Добавить("ПрофильДолжности", Новый ОписаниеТипов("СправочникСсылка.ПрофилиДолжностей"));
	Позиции.Колонки.Добавить("ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ЗаполнитьЗначенияСвойств(Позиции.Добавить(), ТекущиеДанные);
	
	ПрочитатьДанныеПозицийДокументовИзмененияШтатногоРасписания(Форма.ДействияСотрудников, Форма.ХарактеристикиПерсонала, Позиции);
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

Процедура ПриКопированииДанныхПозиции(Форма, ИдентификаторСтрокиПозицииИсточника, ИдентификаторСтрокиТекущейПозиции) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ХарактеристикиПерсонала") Тогда
		Возврат;
	КонецЕсли;
		
	ИсходныеСтроки = Форма.ДействияСотрудников.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПозиции", ИдентификаторСтрокиПозицииИсточника));
	Для Каждого ИсходнаяСтрока Из ИсходныеСтроки Цикл
		НоваяСтрока = Форма.ДействияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
		НоваяСтрока.ИдентификаторСтрокиПозиции = ИдентификаторСтрокиТекущейПозиции;
	КонецЦикла;
	
	ИсходныеСтроки = Форма.ХарактеристикиПерсонала.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПозиции", ИдентификаторСтрокиПозицииИсточника));
	Для Каждого ИсходнаяСтрока Из ИсходныеСтроки Цикл
		НоваяСтрока = Форма.ХарактеристикиПерсонала.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ИсходнаяСтрока);
		НоваяСтрока.ИдентификаторСтрокиПозиции = ИдентификаторСтрокиТекущейПозиции;
	КонецЦикла;
	
	ПрочитатьХарактеристикиВТаблицы(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	
КонецПроцедуры

#КонецОбласти

Процедура ПоместитьХарактеристикиПерсоналаВОписаниеПозиции(Форма, ОписаниеПозиции, ДанныеПозиции = Неопределено) Экспорт
	
	Если Не ОписаниеПозиции.Свойство("ПрофильДолжности") Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиХарактеристикиВТабличнуюЧасть(Форма.ХарактеристикиПерсонала, Форма.Характеристики, Форма.ЗначенияХарактеристики);
	ОписаниеПозиции.ХарактеристикиПерсонала = Форма.ХарактеристикиПерсонала.Выгрузить();
	ОписаниеПозиции.ДействияСотрудников = Форма.ДействияСотрудников.Выгрузить();
	Если ДанныеПозиции = Неопределено Тогда
		ОписаниеПозиции.ПрофильДолжности = Форма.ПрофильДолжности;
		ОписаниеПозиции.ПрофильИзменен = Истина;
		ОписаниеПозиции.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = Форма.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло;
	Иначе
		ОписаниеПозиции.ХарактеристикиПерсонала.Очистить();
		ОписаниеПозиции.ДействияСотрудников.Очистить();
		СтруктураОтбора = Новый Структура("ИдентификаторСтрокиПозиции", ДанныеПозиции.ИдентификаторСтрокиПозиции);
		НайденныеСтроки = Форма.ХарактеристикиПерсонала.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ОписаниеПозиции.ХарактеристикиПерсонала.Добавить(), НайденнаяСтрока);
		КонецЦикла;
		НайденныеСтроки = Форма.ДействияСотрудников.НайтиСтроки(СтруктураОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ЗаполнитьЗначенияСвойств(ОписаниеПозиции.ДействияСотрудников.Добавить(), НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеСведенияОХарактеристикахПозиций(Форма, ТекущийОбъект, ПутьКТаблицеПозиций = "Объект.Позиции") Экспорт
		
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ХарактеристикиПерсонала") Тогда
		Возврат;
	КонецЕсли;
	
	Позиции = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, ПутьКТаблицеПозиций);
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТПозицииШтатногоРасписания(Позиции, Запрос.МенеджерВременныхТаблиц); 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.Позиция КАК ПозицияШтатногоРасписания,
		|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	ПозицииШтатногоРасписания.ПрофильДолжности КАК ПрофильДолжности,
		|	ПозицииШтатногоРасписания.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло КАК ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло
		|ИЗ
		|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	СведенияОПрофилях = РезультатЗапроса.Выгрузить();
	
	Если СведенияОПрофилях.Количество() > 0 Тогда
		СведенияОХарактеристиках = Новый Структура;
		СведенияОХарактеристиках.Вставить("СведенияОПрофилях", СведенияОПрофилях);
		СведенияОХарактеристиках.Вставить("ХарактеристикиПерсонала", Форма.ХарактеристикиПерсонала.Выгрузить());
		СведенияОХарактеристиках.Вставить("ДействияСотрудников", Форма.ДействияСотрудников.Выгрузить());
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СведенияОХарактеристиках", СведенияОХарактеристиках);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюТарифныхСтавокШтатногоРасписания(Форма, Позиции) Экспорт
	
	ДанныеОбъекта = Новый Структура("ДополнительныеСвойства", Новый Структура);
	ДобавитьДополнительныеСведенияОХарактеристикахПозиций(Форма, ДанныеОбъекта, "Позиции");
	
	ХарактеристикиПерсонала.ЗаписатьСведенияОХарактеристиках(Позиции, ДанныеОбъекта.ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвойствоРеквизита(Приемник, Источник, ИмяРеквизита)

	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Приемник, ИмяРеквизита)
		ИЛИ НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Источник, ИмяРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Приемник, Источник, ИмяРеквизита);
	
КонецПроцедуры

Процедура СвернутьТаблицуЗначенийХарактеристик(ТЗХарактеристик)

	СтрокаПолей = "Характеристика";
	
	Если ТЗХарактеристик.Колонки.Найти("Вес") <> Неопределено Тогда
		СтрокаПолей = СтрокаПолей + ", Вес";
	КонецЕсли;
	Если ТЗХарактеристик.Колонки.Найти("ТребуетсяПроверка") <> Неопределено Тогда
		СтрокаПолей = СтрокаПолей + ", ТребуетсяПроверка";
	КонецЕсли;
	Если ТЗХарактеристик.Колонки.Найти("ТребуетсяОбучение") <> Неопределено Тогда
		СтрокаПолей = СтрокаПолей + ", ТребуетсяОбучение";
	КонецЕсли;
	Если ТЗХарактеристик.Колонки.Найти("ИдентификаторСтрокиПозиции") <> Неопределено Тогда
		СтрокаПолей = СтрокаПолей + ", ИдентификаторСтрокиПозиции";
	КонецЕсли;
	
	ТЗХарактеристик.Свернуть(СтрокаПолей);

КонецПроцедуры

#Область ШтатноеРасписание

Процедура ДополнитьФормуШтатногоРасписанияДействиямиИХарактеристиками(Форма)

	СоздатьРеквизитПрофиляДолжности(Форма);
	
	СоздатьРеквизитыДействий(Форма);
	СоздатьРеквизитыХарактеристикПерсонала(Форма);
	СоздатьКомандыХарактеристикПерсонала(Форма);
	
	СоздатьЭлементПрофильДолжности(Форма);
	СоздатьЭлементыФормыДействийИХарактеристикПерсонала(Форма);
	
КонецПроцедуры

Процедура СоздатьРеквизитПрофиляДолжности(Форма, Путь = "")

	ДобавляемыеРеквизиты = Новый Массив;
	
	// ПрофильДолжности
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ПрофильДолжности",
			Новый ОписаниеТипов("СправочникСсылка.ПрофилиДолжностей"),
			Путь,
			НСтр("ru = 'Профиль должности'"),
			Истина));
	
	Если Не ПустаяСтрока(Путь) Тогда
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("ПрофильИзменен",
								Новый ОписаниеТипов("Булево"),
								Путь,
								НСтр("ru = 'Профиль изменен'")));
	КонецЕсли;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

КонецПроцедуры

Процедура СоздатьРеквизитыХарактеристикПерсонала(Форма, ТребуетсяИдентификатор = Ложь)

	ДобавляемыеРеквизиты = Новый Массив;
	
	// ХарактеристикиПерсонала
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ХарактеристикиПерсонала",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru = 'Характеристики персонала'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Характеристика",
							Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Характеристика'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Значение",
							Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристик"),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Значение'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Вес",
							ОбщегоНазначения.ОписаниеТипаЧисло(5,0),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Вес'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ВесЗначения",
							ОбщегоНазначения.ОписаниеТипаЧисло(5,0),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Вес значения'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ТребуетсяПроверка",
							Новый ОписаниеТипов("Булево"),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Требуется проверка'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ТребуетсяОбучение",
							Новый ОписаниеТипов("Булево"),
							"ХарактеристикиПерсонала",
							НСтр("ru = 'Требуется обучение'")));
	
	// Характеристики
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Характеристики",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru = 'Характеристики'"),
							Истина));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Характеристика",
							Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"),
							"Характеристики",
							НСтр("ru = 'Характеристика'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Вес",
							ОбщегоНазначения.ОписаниеТипаЧисло(5,0),
							"Характеристики",
							НСтр("ru = 'Вес'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ТребуетсяПроверка",
							Новый ОписаниеТипов("Булево"),
							"Характеристики",
							НСтр("ru = 'Требуется проверка'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ТребуетсяОбучение",
							Новый ОписаниеТипов("Булево"),
							"Характеристики",
							НСтр("ru = 'Требуется обучение'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ВидХарактеристики",
							Новый ОписаниеТипов("ПеречислениеСсылка.ВидыХарактеристикПерсонала"),
							"Характеристики",
							НСтр("ru = 'Вид характеристики'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ЗначенияСтрокой",
							ОбщегоНазначения.ОписаниеТипаСтрока(0),
							"Характеристики",
							НСтр("ru = 'Значения строкой'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("КартинкаВида",
							ОбщегоНазначения.ОписаниеТипаЧисло(5,0),
							"Характеристики",
							НСтр("ru = 'Картинка вида'")));
	
	// ЗначенияХарактеристики
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ЗначенияХарактеристики",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru = 'Значения характеристики'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Характеристика",
							Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ХарактеристикиПерсонала"),
							"ЗначенияХарактеристики",
							НСтр("ru = 'Характеристика'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("Значение",
							Новый ОписаниеТипов("СправочникСсылка.ЗначенияХарактеристик"),
							"ЗначенияХарактеристики",
							НСтр("ru = 'Значение'")));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ВесЗначения",
							ОбщегоНазначения.ОписаниеТипаЧисло(5,0),
							"ЗначенияХарактеристики",
							НСтр("ru = 'Вес значения'")));
	
	Если ТребуетсяИдентификатор Тогда
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("ИдентификаторСтрокиПозиции",
								ОбщегоНазначения.ОписаниеТипаЧисло(15),
								"ХарактеристикиПерсонала",
								НСтр("ru = 'Идентификатор строки позиции'")));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("ИдентификаторСтрокиПозиции",
								ОбщегоНазначения.ОписаниеТипаЧисло(15),
								"Характеристики",
								НСтр("ru = 'Идентификатор строки позиции'")));
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("ИдентификаторСтрокиПозиции",
								ОбщегоНазначения.ОписаниеТипаЧисло(15),
								"ЗначенияХарактеристики",
								НСтр("ru = 'Идентификатор строки позиции'")));
	КонецЕсли;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

КонецПроцедуры

Процедура СоздатьКомандыХарактеристикПерсонала(Форма)

	Если Форма.Команды.Найти("ПодобратьХарактеристики") = Неопределено Тогда
		// Добавляем команду формы
		КомандаПодбораХарактеристик = Форма.Команды.Добавить("ПодобратьХарактеристики");
		КомандаПодбораХарактеристик.Действие = "Подключаемый_ПодобратьХарактеристики";
		КомандаПодбораХарактеристик.Заголовок = НСтр("ru = 'Подбор'");
	КонецЕсли;

КонецПроцедуры

Процедура СоздатьРеквизитыДействий(Форма, ТребуетсяИдентификатор = Ложь, Путь = "")

	ДобавляемыеРеквизиты = Новый Массив;
	
	// Тумблер
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло",
							ОбщегоНазначения.ОписаниеТипаЧисло(1,0),
							Путь,
							НСтр("ru = 'Действия характеристики соответствуют профилю должности'"),
							Истина));
	
	// Действия
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ДействияСотрудников",
							Новый ОписаниеТипов("ТаблицаЗначений"),,
							НСтр("ru = 'Действия сотрудников'"),
							Истина));
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы("ДействиеСотрудника",
							Новый ОписаниеТипов("СправочникСсылка.ДействияСотрудников"),
							"ДействияСотрудников",
							НСтр("ru = 'Действие сотрудника'")));
	Если ТребуетсяИдентификатор Тогда
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы("ИдентификаторСтрокиПозиции",
				ОбщегоНазначения.ОписаниеТипаЧисло(15),
				"ДействияСотрудников",
				НСтр("ru = 'Идентификатор строки позиции'"),
				Истина));
	КонецЕсли;
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

КонецПроцедуры

Процедура СоздатьЭлементПрофильДолжности(Форма)

	Элементы = Форма.Элементы;
	
	ГруппаФормы = Элементы.Найти("ПрофильДолжностиГруппа");
	Если ГруппаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Найти("ПрофильДолжности") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеФормы = Элементы.Добавить("ПрофильДолжности", Тип("ПолеФормы"), ГруппаФормы);
	ПолеФормы.ПутьКДанным = "ПрофильДолжности";
	ПолеФормы.Вид = ВидПоляФормы.ПолеВвода;
	
	СвязиПараметровВыбора = Новый Массив;
	СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Должность", "Объект.Должность", РежимИзмененияСвязанногоЗначения.НеИзменять));
	ПолеФормы.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
	ПолеФормы.УстановитьДействие("ПриИзменении", "Подключаемый_ПрофильДолжностиПриИзменении");
	
КонецПроцедуры

Процедура СоздатьЭлементыФормыДействийИХарактеристикПерсонала(Форма)

	Элементы = Форма.Элементы;
	
	ГруппаФормы = Элементы.Найти("ТребованияКХарактеристикамГруппа");
	Если ГруппаФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло
	ЭлементТумблер = Элементы.Найти("ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло");
	Если ЭлементТумблер = Неопределено Тогда
		ЭлементТумблер = Элементы.Добавить("ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло", Тип("ПолеФормы"), ГруппаФормы);
		ЭлементТумблер.ПутьКДанным = "ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло";
		ЭлементТумблер.Вид = ВидПоляФормы.ПолеПереключателя;
		ЭлементТумблер.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементТумблер.ВидПереключателя = ВидПереключателя.Тумблер;
		ЭлементТумблер.СписокВыбора.Добавить(0, НСтр("ru = 'Произвольные'"));
		ЭлементТумблер.СписокВыбора.Добавить(1, НСтр("ru = 'Из профиля'"));
		ЭлементТумблер.УстановитьДействие("ПриИзменении", "Подключаемый_ДействияХарактеристикиСоответствуютПрофилюДолжностиЧислоПриИзменении");
	КонецЕсли;
	
	// ДействияХарактеристикиГруппа
	ДействияХарактеристикиГруппа = Элементы.Найти("ДействияХарактеристикиГруппа");
	Если ДействияХарактеристикиГруппа = Неопределено Тогда
		ДействияХарактеристикиГруппа = Элементы.Добавить("ДействияХарактеристикиГруппа", Тип("ГруппаФормы"), ГруппаФормы);
		ДействияХарактеристикиГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ДействияХарактеристикиГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ДействияХарактеристикиГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ДействияХарактеристикиГруппа.ОтображатьЗаголовок = Ложь;
	КонецЕсли;
	
	// ДействияСотрудниковГруппа
	ДействияСотрудниковГруппа = Элементы.Найти("ДействияСотрудниковГруппа");
	Если ДействияСотрудниковГруппа = Неопределено Тогда
		ДействияСотрудниковГруппа = Элементы.Добавить("ДействияСотрудниковГруппа", Тип("ГруппаФормы"), ДействияХарактеристикиГруппа);
		ДействияСотрудниковГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ДействияСотрудниковГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ДействияСотрудниковГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ДействияСотрудниковГруппа.Заголовок = НСтр("ru = 'Функции'");
		ДействияСотрудниковГруппа.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	// ХарактеристикиГруппа
	ХарактеристикиГруппа = Элементы.Найти("ХарактеристикиГруппа");
	Если ХарактеристикиГруппа = Неопределено Тогда
		ХарактеристикиГруппа = Элементы.Добавить("ХарактеристикиГруппа", Тип("ГруппаФормы"), ДействияХарактеристикиГруппа);
		ХарактеристикиГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ХарактеристикиГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ХарактеристикиГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ХарактеристикиГруппа.Заголовок = НСтр("ru = 'Характеристики'");
		ХарактеристикиГруппа.ОтображатьЗаголовок = Истина;
	КонецЕсли;
	
	//ДействияСотрудников
	ДействияСотрудников = Элементы.Найти("ДействияСотрудников");
	Если ДействияСотрудников = Неопределено Тогда
		ДействияСотрудников = Элементы.Добавить("ДействияСотрудников", Тип("ТаблицаФормы"), ДействияСотрудниковГруппа);
		ДействияСотрудников.ПутьКДанным = "ДействияСотрудников";
		ДействияСотрудников.Отображение = ОтображениеТаблицы.Список;
		ДействияСотрудников.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Функции, которые должны выполнять сотрудники, работающие на этой позиции.'");
		ДействияСотрудников.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ДействияСотрудников.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
		ДействияСотрудников.Шапка = Ложь;
		// Обработчики
		ДействияСотрудников.УстановитьДействие("Выбор", "Подключаемый_ДействияВыбор");
		ДействияСотрудников.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ДействияПередНачаломДобавления");
		ДействияСотрудников.УстановитьДействие("ПередУдалением", "Подключаемый_ДействияПередУдалением");
		ДействияСотрудников.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ДействияОбработкаВыбора");
	КонецЕсли;
	Если Элементы.Найти("ДействияСотрудниковДействиеСотрудника") = Неопределено Тогда
		ПолеДействиеСотрудника = Элементы.Добавить("ДействияСотрудниковДействиеСотрудника", Тип("ПолеФормы"), ДействияСотрудников);
		ПолеДействиеСотрудника.ПутьКДанным = "ДействияСотрудников.ДействиеСотрудника";
	КонецЕсли;
	
	// Характеристики
	ТаблицаХарактеристики = Элементы.Найти("Характеристики");
	Если ТаблицаХарактеристики = Неопределено Тогда
		ТаблицаХарактеристики = Элементы.Добавить("Характеристики", Тип("ТаблицаФормы"), ХарактеристикиГруппа);
		ТаблицаХарактеристики.ПутьКДанным = "Характеристики";
		ТаблицаХарактеристики.Отображение = ОтображениеТаблицы.Список;
		ТаблицаХарактеристики.ПутьКДаннымКартинкиСтроки = "Характеристики.КартинкаВида";
		ТаблицаХарактеристики.КартинкаСтрок = БиблиотекаКартинок.КоллекцияВидыХарактеристик;
		ТаблицаХарактеристики.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'Требования к характеристикам сотрудников, работающих на этой позиции.'");
		ТаблицаХарактеристики.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
		ТаблицаХарактеристики.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
		// Обработчики
		ТаблицаХарактеристики.УстановитьДействие("Выбор", "Подключаемый_ХарактеристикиВыбор");
		ТаблицаХарактеристики.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ХарактеристикиПередНачаломДобавления");
		ТаблицаХарактеристики.УстановитьДействие("ПередУдалением", "Подключаемый_ХарактеристикиПередУдалением");
	КонецЕсли;
	Если Элементы.Найти("ХарактеристикиХарактеристика") = Неопределено Тогда
		ПолеТаблицы = Элементы.Добавить("ХарактеристикиХарактеристика", Тип("ПолеФормы"), ТаблицаХарактеристики);
		ПолеТаблицы.ПутьКДанным = "Характеристики.Характеристика";
	КонецЕсли;
	Если Элементы.Найти("ХарактеристикиЗначение") = Неопределено Тогда
		ПолеТаблицы = Элементы.Добавить("ХарактеристикиЗначение", Тип("ПолеФормы"), ТаблицаХарактеристики);
		ПолеТаблицы.ПутьКДанным = "Характеристики.ЗначенияСтрокой";
		ПолеТаблицы.Заголовок = НСтр("ru = 'Значение'");
	КонецЕсли;
	Если Элементы.Найти("ХарактеристикиВес") = Неопределено Тогда
		ПолеТаблицы = Элементы.Добавить("ХарактеристикиВес", Тип("ПолеФормы"), ТаблицаХарактеристики);
		ПолеТаблицы.ПутьКДанным = "Характеристики.Вес";
	КонецЕсли;
	Если Элементы.Найти("ХарактеристикиТребуетсяПроверка") = Неопределено Тогда
		ПолеТаблицы = Элементы.Добавить("ХарактеристикиТребуетсяПроверка", Тип("ПолеФормы"), ТаблицаХарактеристики);
		ПолеТаблицы.Заголовок = НСтр("ru = 'Проверка'");
		ПолеТаблицы.ПутьКДанным = "Характеристики.ТребуетсяПроверка";
		ПолеТаблицы.Вид = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;
	Если Элементы.Найти("ХарактеристикиТребуетсяОбучение") = Неопределено Тогда
		ПолеТаблицы = Элементы.Добавить("ХарактеристикиТребуетсяОбучение", Тип("ПолеФормы"), ТаблицаХарактеристики);
		ПолеТаблицы.Заголовок = НСтр("ru = 'Обучение'");
		ПолеТаблицы.ПутьКДанным = "Характеристики.ТребуетсяОбучение";
		ПолеТаблицы.Вид = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;
	
	// Команда подбора
	Если Форма.Элементы.Найти("ХарактеристикиПерсоналаПодобратьХарактеристики") = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить("ХарактеристикиПерсоналаПодобратьХарактеристики", Тип("КнопкаФормы"), ТаблицаХарактеристики.КоманднаяПанель);
		Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		Элемент.ИмяКоманды = "ПодобратьХарактеристики"; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДанныеДействийХарактеристикШтатногоРасписания(Форма, ПозицияСсылка)

	ПрочитатьНастройкиДействийХарактеристикШтатногоРасписания(Форма, ПозицияСсылка);
	ПрочитатьДействияПозицииШтатногоРасписания(Форма, ПозицияСсылка);
	ПрочитатьХарактеристикиПозицииШтатногоРасписания(Форма, ПозицияСсылка);

КонецПроцедуры

Процедура ПрочитатьНастройкиДействийХарактеристикШтатногоРасписания(Форма, ПозицияСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиДействийХарактеристикШтатногоРасписания.ПрофильДолжности КАК ПрофильДолжности,
		|	ВЫБОР
		|		КОГДА НастройкиДействийХарактеристикШтатногоРасписания.СоответствуютПрофилюДолжности = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло
		|ИЗ
		|	РегистрСведений.НастройкиДействийХарактеристикШтатногоРасписания КАК НастройкиДействийХарактеристикШтатногоРасписания
		|ГДЕ
		|	НастройкиДействийХарактеристикШтатногоРасписания.ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания";
	
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", ПозицияСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Форма, Выборка);

КонецПроцедуры

Процедура ПрочитатьДействияПозицииШтатногоРасписания(Форма, ПозицияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДействияПозицийШтатногоРасписания.ДействиеСотрудника КАК ДействиеСотрудника
		|ИЗ
		|	РегистрСведений.ДействияПозицийШтатногоРасписания КАК ДействияПозицийШтатногоРасписания
		|ГДЕ
		|	ДействияПозицийШтатногоРасписания.ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания";
	
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", ПозицияСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Форма.ДействияСотрудников.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура ПрочитатьХарактеристикиПозицииШтатногоРасписания(Форма, ПозицияСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ХарактеристикаПерсонала КАК Характеристика,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.Значение КАК Значение,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.Вес КАК Вес,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ТребуетсяПроверка КАК ТребуетсяПроверка,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ТребуетсяОбучение КАК ТребуетсяОбучение,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ВесЗначения КАК ВесЗначения
		|ИЗ
		|	РегистрСведений.ХарактеристикиПерсоналаПозицийШтатногоРасписания КАК ХарактеристикиПерсоналаПозицийШтатногоРасписания
		|ГДЕ
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ПозицияШтатногоРасписания = &ПозицияШтатногоРасписания";
	
	Запрос.УстановитьПараметр("ПозицияШтатногоРасписания", ПозицияСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Форма.ХарактеристикиПерсонала.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыИзмененияШтатноеРасписание

Процедура ПрочитатьНастройкиДействийХарактеристикДокументовИзмененияШтатногоРасписания(Форма, Позиции)
	
	ИдентификаторыСтрокПозиций = Новый Соответствие;
	Для каждого СтрокаПозиции Из Позиции Цикл
		Если ЗначениеЗаполнено(СтрокаПозиции.ПрофильДолжности) Или Не ЗначениеЗаполнено(СтрокаПозиции.Позиция) Тогда
			Продолжить;
		КонецЕсли;
		ИдентификаторыСтрокПозиций.Вставить(СтрокаПозиции.ИдентификаторСтрокиПозиции, СтрокаПозиции);
	КонецЦикла;
	
	Если ИдентификаторыСтрокПозиций.Количество() > 0 Тогда			
		Запрос = Новый Запрос;	
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		СоздатьВТПозицииШтатногоРасписания(Позиции, Запрос.МенеджерВременныхТаблиц); 
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
			|	НастройкиДействийХарактеристикШтатногоРасписания.ПрофильДолжности КАК ПрофильДолжности,
			|	ВЫБОР
			|		КОГДА НастройкиДействийХарактеристикШтатногоРасписания.СоответствуютПрофилюДолжности = ИСТИНА
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло
			|ИЗ
			|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиДействийХарактеристикШтатногоРасписания КАК НастройкиДействийХарактеристикШтатногоРасписания
			|		ПО ПозицииШтатногоРасписания.Позиция = НастройкиДействийХарактеристикШтатногоРасписания.ПозицияШтатногоРасписания";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатЗапроса = Запрос.Выполнить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			СтрокаПозиции = ИдентификаторыСтрокПозиций.Получить(Выборка.ИдентификаторСтрокиПозиции);
			Если СтрокаПозиции = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтрокаПозиции.ПрофильДолжности = Выборка.ПрофильДолжности;
			СтрокаПозиции.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = Выборка.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование") Тогда
		МодульКадровоеПланированиеФормы = ОбщегоНазначения.ОбщийМодуль("КадровоеПланированиеФормы");
		МодульКадровоеПланированиеФормы.ЗаполнитьДокументПоДаннымЗаполнения(Форма, Позиции);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьДанныеПозицийДокументовИзмененияШтатногоРасписания(ДействияСотрудников, ХарактеристикиПерсонала, Позиции)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СоздатьВТПозицииШтатногоРасписания(Позиции, Запрос.МенеджерВременныхТаблиц);
	
	ПрочитатьДействияПозицийДокументовИзмененияШтатногоРасписания(Запрос, ДействияСотрудников, Позиции);
	ПрочитатьХарактеристикиПозицийДокументовИзмененияШтатногоРасписания(Запрос, ХарактеристикиПерсонала, Позиции);
	
КонецПроцедуры

Процедура ПрочитатьДействияПозицийДокументовИзмененияШтатногоРасписания(Запрос, ДействияСотрудников, Позиции)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	ДействияПозицийШтатногоРасписания.ДействиеСотрудника КАК ДействиеСотрудника
		|ИЗ
		|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДействияПозицийШтатногоРасписания КАК ДействияПозицийШтатногоРасписания
		|		ПО ПозицииШтатногоРасписания.Позиция = ДействияПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|			И (ПозицииШтатногоРасписания.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = 0)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ДействияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрочитатьХарактеристикиПозицийДокументовИзмененияШтатногоРасписания(Запрос, ХарактеристикиПерсонала, Позиции)
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ХарактеристикаПерсонала КАК Характеристика,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.Значение КАК Значение,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.Вес КАК Вес,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ТребуетсяПроверка КАК ТребуетсяПроверка,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ТребуетсяОбучение КАК ТребуетсяОбучение,
		|	ХарактеристикиПерсоналаПозицийШтатногоРасписания.ВесЗначения КАК ВесЗначения
		|ИЗ
		|	ВТПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиПерсоналаПозицийШтатногоРасписания КАК ХарактеристикиПерсоналаПозицийШтатногоРасписания
		|		ПО ПозицииШтатногоРасписания.Позиция = ХарактеристикиПерсоналаПозицийШтатногоРасписания.ПозицияШтатногоРасписания
		|			И (ПозицииШтатногоРасписания.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло = 0)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ХарактеристикиПерсонала.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура СоздатьВТПозицииШтатногоРасписания(Позиции, МенеджерВременныхТаблиц)
	
	Запрос = ЗапросВТПозицииШтатногоРасписания(Позиции);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры	

Функция ЗапросВТПозицииШтатногоРасписания(Позиции)
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Позиции) = Тип("ТаблицаЗначений") Тогда 
		ПозицииТаблица = Позиции;
	Иначе
		ПозицииТаблица = Позиции.Выгрузить();
	КонецЕсли;
	Запрос.УстановитьПараметр("ПозицииШтатногоРасписания", ПозицииТаблица);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииШтатногоРасписания.Позиция КАК Позиция,
		|	ПозицииШтатногоРасписания.ИдентификаторСтрокиПозиции КАК ИдентификаторСтрокиПозиции,
		|	ПозицииШтатногоРасписания.ПрофильДолжности КАК ПрофильДолжности,
		|	ПозицииШтатногоРасписания.ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло КАК ДействияХарактеристикиСоответствуютПрофилюДолжностиЧисло
		|ПОМЕСТИТЬ ВТПозицииШтатногоРасписания
		|ИЗ
		|	&ПозицииШтатногоРасписания КАК ПозицииШтатногоРасписания";
		
	Возврат Запрос;
	
КонецФункции

#КонецОбласти