#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("СформироватьРассылкуСШаблономПредстоящегоСобеседованияПисьмо");
	Методы.Вставить("ОбновитьШаблонПредстоящегоОбучения");
	Методы.Вставить("ОбновитьШаблонИстеченияСрокаАнкетирования");
	Методы.Вставить("СформироватьРассылкиСШаблонамиПоздравлений");
	Методы.Вставить("ОбновитьШаблонУтвержденногоОтпуска");
	Методы.Вставить("ОбновитьШаблонПриближающегосяОтпуска");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет формирование шаблонов поздравлений с рассылками уведомлений
//
Процедура СформироватьРассылкиСШаблонамиПоздравлений(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ДниРождения");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Поздравление с днем рождения (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСДнемРождения(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСДнемРождения(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Поздравление с юбилеем.
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеем(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеем(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Поздравление с юбилеем (благодарность).
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеемБлагодарность(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеемБлагодарность(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ГодовщиныРаботыВКомпании");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Годовщины работы в компании (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСГодовщинойРаботы(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСГодовщинойРаботы(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
		// Юбилеи работы в компании.
		ШаблонПоздравления = ШаблонПоздравленияСЮбилеемРаботы(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСЮбилеемРаботы(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ПервыйРабочийДень");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Поздравление с первым рабочим днем (письмо).
		ШаблонПоздравления = ШаблонПоздравленияСПервымРабочимДнем(ВидУведомления);
		Если ШаблонПоздравления <> Неопределено Тогда
			СформироватьРассылкуПоздравленияСПервымРабочимДнем(ВидУведомления, ШаблонПоздравления);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет формирование шаблона предстоящего собеседования с рассылкой уведомления
//
Процедура СформироватьРассылкуСШаблономПредстоящегоСобеседованияПисьмо(ПараметрыОбновления = Неопределено) Экспорт
	
	ВидУведомления = УведомленияСервер.ВидУведомленияПоИмени("ЭтапРаботыСКандидатом");
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда
		
		// Приглашение на собеседование (письмо).
		ШаблонПриглашения = ШаблонПредстоящегоСобеседования(ВидУведомления);
		Если ШаблонПриглашения <> Неопределено Тогда
			СформироватьРассылкуПредстоящегоСобеседования(ВидУведомления, ШаблонПриглашения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона истичения срока анкетирования
//
Процедура ОбновитьШаблонИстеченияСрокаАнкетирования(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Истекает срок опроса'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ИстечениеСрокаАнкетирования");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона приближающегося отпуска по графику
//
Процедура ОбновитьШаблонПриближающегосяОтпуска(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru = 'Уведомление о приближающемся отпуске'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Приближается ваш отпуск'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПриближающийсяОтпуск");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона утвержденной заявки на отпуск
//
Процедура ОбновитьШаблонУтвержденногоОтпуска(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Уведомление об утверждении заявки на отпуск'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Заявление на отпуск согласовано'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("УтвержденныйОтпуск");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет обновление шаблона предстоящего обучения
//
Процедура ОбновитьШаблонПредстоящегоОбучения(ПараметрыОбновления = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ШаблоныСообщений");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Ложь);
		ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(НСтр("ru='Уведомление о предстоящем обучении'"), Истина);
		Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
			ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
			ШаблонОбъект.ТемаПисьма = НСтр("ru='Напоминание об обучении'");
			ШаблонОбъект.ТипТекстаПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
			ШаблонОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПредстоящееОбучение");
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонОбъект, Ложь, Ложь);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Поздравления

Процедура СформироватьРассылкуПоздравленияСДнемРождения(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с днем рождения (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.НеВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеем(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с юбилеем'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 5;
	СтрокаОтбора.ВидСравнения = ВидСравнения.Меньше;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеемБлагодарность(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Поздравление сотрудников с юбилеем (благодарность)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "Возраст";
	СтрокаОтбора.ПравоеЗначение = ВозрастЮбиляров();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Возраст'");
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 5;
	СтрокаОтбора.ВидСравнения = ВидСравнения.БольшеИлиРавно;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСГодовщинойРаботы(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Годовщины работы в компании (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = 1;
	СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("Число");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСЮбилеемРаботы(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Юбилеи работы в компании'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	НастройкиОтборов = НастройкиОтборовРассылки();
	
	СтрокаОтбора = НастройкиОтборов.Добавить();
	СтрокаОтбора.ЛевоеЗначение = "ОтработаноЛет";
	СтрокаОтбора.ПравоеЗначение = ЮбилейныеСрокиРаботыВКомпании();
	СтрокаОтбора.ВидСравнения = ВидСравнения.ВСписке;
	СтрокаОтбора.Использование = Истина;
	СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СписокЗначений");
	СтрокаОтбора.Представление = НСтр("ru='Отработано лет'");
	
	РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Процедура СформироватьРассылкуПоздравленияСПервымРабочимДнем(ВидУведомления, ШаблонПоздравления)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Первый рабочий день (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ПослеСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ВремяОтправки = Дата('00010101090000');
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПоздравления;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Функция ШаблонПоздравленияСДнемРождения(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с днем рождения (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С днем рождения!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ДеньРождения");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеем(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с юбилеем'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С юбилеем!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("Юбилей");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеемБлагодарность(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Поздравление с юбилеем (благодарность)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'Благодарность в день юбилея!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ЮбилейБлагодарность");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСГодовщинойРаботы(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Годовщины работы в компании (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С годовщиной!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ГодовщинаРаботыВКомпании");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСЮбилеемРаботы(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Юбилеи работы в компании'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С юбилеем работы в компании!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ЮбилейРаботыВКомпании");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ШаблонПоздравленияСПервымРабочимДнем(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Первый рабочий день (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.ФизическиеЛица.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.ФизическиеЛица.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'С первым рабочим днем!'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПервыйРабочийДень");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Ложь, Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ВозрастЮбиляров()
	
	ВозрастЮбиляров = Новый СписокЗначений;
	ВозрастЮбиляров.Добавить(45);
	ВозрастЮбиляров.Добавить(50);
	ВозрастЮбиляров.Добавить(55);
	ВозрастЮбиляров.Добавить(60);
	ВозрастЮбиляров.Добавить(65);
	ВозрастЮбиляров.Добавить(70);
	ВозрастЮбиляров.Добавить(75);
	
	Возврат ВозрастЮбиляров;
	
КонецФункции

Функция ЮбилейныеСрокиРаботыВКомпании()
	
	ЮбилейныеСроки = Новый СписокЗначений;
	ЮбилейныеСроки.Добавить(5);
	ЮбилейныеСроки.Добавить(10);
	ЮбилейныеСроки.Добавить(15);
	ЮбилейныеСроки.Добавить(20);
	ЮбилейныеСроки.Добавить(25);
	ЮбилейныеСроки.Добавить(30);
	ЮбилейныеСроки.Добавить(35);
	ЮбилейныеСроки.Добавить(40);
	ЮбилейныеСроки.Добавить(45);
	ЮбилейныеСроки.Добавить(50);
	ЮбилейныеСроки.Добавить(55);
	ЮбилейныеСроки.Добавить(60);
	
	Возврат ЮбилейныеСроки;
	
КонецФункции

#КонецОбласти

Процедура СформироватьРассылкуПредстоящегоСобеседования(ВидУведомления, ШаблонПриглашения)
	
	РассылкаОбъект = Справочники.РассылкиУведомлений.СоздатьЭлемент();
	РассылкаОбъект.ВидУведомления = ВидУведомления;
	РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
	РассылкаОбъект.Наименование = НСтр("ru='Уведомление о предстоящем собеседовании (письмо)'");
	РассылкаОбъект.СпособОпределенияМоментаУведомления = Перечисления.СпособыОпределенияМоментаУведомления.ДоСобытия;
	РассылкаОбъект.ЕдиницаИзмеренияИнтервалаУведомления = Перечисления.ЕдиницыИзмеренияИнтервалаУведомлений.Час;
	РассылкаОбъект.УчетнаяЗаписьЭлектроннойПочты = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	РассылкаОбъект.ИнтервалУведомления = 3;
	
	СтрокаПолучателя = РассылкаОбъект.ПолучателиУведомленийДинамические.Добавить();
	СтрокаПолучателя.Получатель = "Предмет";
	СтрокаПолучателя.ВидКонтактнойИнформации = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыКонтактнойИнформации.EMailЛичныеДанныеКандидатов");
	СтрокаПолучателя.ШаблонСообщения = ШаблонПриглашения;
	
	ЭтапСобеседование = Справочники.ЭтапыРаботыСКандидатами.НайтиПоНаименованию("Собеседование");
	Если ЗначениеЗаполнено(ЭтапСобеседование) Тогда
		НастройкиОтборов = НастройкиОтборовРассылки();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЭтапРаботы";
		СтрокаОтбора.ПравоеЗначение = ЭтапСобеседование;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ЭтапыРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Этап работы'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "СостояниеЭтапа";
		СтрокаОтбора.ПравоеЗначение = Перечисления.СостоянияЭтаповРаботыСКандидатами.Запланирован;
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.Использование = Истина;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("ПеречислениеСсылка.СостоянияЭтаповРаботыСКандидатами");
		СтрокаОтбора.Представление = НСтр("ru='Состояние этапа'");
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелеваяПозиция";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ШтатноеРасписание");
		СтрокаОтбора.Представление = НСтр("ru='Целевая позиция'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		СтрокаОтбора = НастройкиОтборов.Добавить();
		СтрокаОтбора.ЛевоеЗначение = "ЦелевоеПодразделение";
		СтрокаОтбора.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбора.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия");
		СтрокаОтбора.Представление = НСтр("ru='Целевое подразделение'");
		СтрокаОтбора.ПравоеЗначение 	= СтрокаОтбора.ОписаниеТипов.ПривестиЗначение();
		
		РассылкаОбъект.Отбор = Новый ХранилищеЗначения(НастройкиОтборов);
		
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(РассылкаОбъект, Ложь, Ложь);
	
КонецПроцедуры

Функция ШаблонПредстоящегоСобеседования(ВидУведомления)
	
	ИмяШаблона = НСтр("ru = 'Уведомление о предстоящем собеседовании (письмо)'");
	ШаблонСсылка = Справочники.ШаблоныСообщений.НайтиПоНаименованию(ИмяШаблона, Истина);
	Если ЗначениеЗаполнено(ШаблонСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// АПК:374-выкл. Восклицательный знак в тексте письма, а не сообщению пользователю.
	ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
	ПараметрыШаблона.ПолноеИмяТипаНазначения = Метаданные.Справочники.Кандидаты.ПолноеИмя();
	ПараметрыШаблона.Назначение = Метаданные.Справочники.Кандидаты.Синоним;
	ПараметрыШаблона.ТипШаблона = "Письмо";
	ПараметрыШаблона.ФорматПисьма = Перечисления.СпособыРедактированияЭлектронныхПисем.HTML;
	ПараметрыШаблона.Тема = НСтр("ru = 'Напоминание о собеседовании'");
	ПараметрыШаблона.ВладелецШаблона = ВидУведомления;
	// АПК:374-вкл
	
	НачатьТранзакцию();
	
	Попытка
		ШаблонПоздравления = ШаблоныСообщений.СоздатьШаблон(ИмяШаблона, ПараметрыШаблона);
		ШаблонПоздравленияОбъект = ШаблонПоздравления.ПолучитьОбъект();
		ШаблонПоздравленияОбъект.ТекстШаблонаПисьмаHTML = ТекстШаблонаИзМакета("ПредстоящееСобеседование");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ШаблонПоздравленияОбъект, Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ШаблонПоздравления = Неопределено;
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ШаблонПоздравления;
	
КонецФункции

Функция ТекстШаблонаИзМакета(ИмяМакета)
	
	Макет = Обработки.МакетыШаблоновСообщений.ПолучитьМакет(ИмяМакета);
	Возврат Макет.ПолучитьТекст();
	
КонецФункции

Функция НастройкиОтборовРассылки()
	
	НастройкиОтборов = Новый ТаблицаЗначений;
	НастройкиОтборов.Колонки.Добавить("ЛевоеЗначение");
	НастройкиОтборов.Колонки.Добавить("ВидСравнения");
	НастройкиОтборов.Колонки.Добавить("ПравоеЗначение");
	НастройкиОтборов.Колонки.Добавить("Использование");
	НастройкиОтборов.Колонки.Добавить("ОписаниеТипов");
	НастройкиОтборов.Колонки.Добавить("Представление");
	
	Возврат НастройкиОтборов;
	
КонецФункции

#КонецОбласти

#КонецЕсли