#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Наставник") И ЗначениеЗаполнено(ДанныеЗаполнения.Наставник) Тогда
			ДанныеЗаполнения = ДанныеЗаполнения.Наставник;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		ЗарплатаКадры.ЗаполнитьПоОснованиюСотрудником(ЭтотОбъект, ДанныеЗаполнения);
		Наставник = ДанныеЗаполнения;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Проведение документа
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ЗарплатаКадрыРасширенный.ИнициализироватьОтложеннуюРегистрациюВторичныхДанныхПоДвижениямДокумента(Движения);
	
	ДанныеДляПроведения = ПолучитьДанныеДляПроведения();
	
	Если Утверждено И НазначитьДоплату Тогда
		
		ЗарплатаКадрыРасширенный.УстановитьВремяРегистрацииДокумента(Движения, ДанныеДляПроведения.СотрудникиДаты, Ссылка);
		
		СтруктураПлановыхНачислений = Новый Структура;
		СтруктураПлановыхНачислений.Вставить("ДанныеОПлановыхНачислениях", ДанныеДляПроведения.ПлановыеНачисления);
		СтруктураПлановыхНачислений.Вставить("ЗначенияПоказателей", ДанныеДляПроведения.ЗначенияПоказателей);
		
		РасчетЗарплаты.СформироватьДвиженияПлановыхНачислений(ЭтотОбъект, Движения, СтруктураПлановыхНачислений);
		
		ОтражениеЗарплатыВБухучетеРасширенный.СформироватьДвиженияБухучетСотрудников(
		ЭтотОбъект, Движения, ДанныеДляПроведения.НастройкиБухучета);
		
	КонецЕсли;
	
	Наставничество.СформироватьДвиженияНаставничества(Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Перем ТекстСообщения;
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	ДатаИзменения = ДатаНачала;
	
	Если ДатаНачала > ДатаОкончания	И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания не может быть меньше даты назначения'"), ЭтотОбъект, "ДатаОкончания", , Отказ);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	КадровыеДанныеГоловногоСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Наставник, "ОформленПоТрудовомуДоговору, ДатаУвольнения", ДатаНачала);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если КадровыеДанныеГоловногоСотрудника.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(КадровыеДанныеГоловногоСотрудника[0].ДатаУвольнения)
			И КадровыеДанныеГоловногоСотрудника[0].ДатаУвольнения <= ДатаНачала Тогда
			
			ТекстСообщения = НСтр("ru='Сотрудник уволен'") + " " + Формат(КадровыеДанныеГоловногоСотрудника[0].ДатаУвольнения, "ДЛФ=D") + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Сотрудник", , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Утверждено Тогда
		
		РасчетЗарплатыРасширенный.ПроверитьМножественностьОплатыВремениРаботникВШапке(ДатаИзменения, Наставник, Начисления, Ссылка, Отказ, Перечисления.ДействияСНачислениямиИУдержаниями.Утвердить);
	КонецЕсли;
	
	ЗарплатаКадрыРасширенный.ПроверитьПериодРегистратораНачисленийУдержаний(ДатаНачала, ДатаОкончания, ЭтотОбъект, "ДатаОкончания", Отказ);
	
	Если Не Наставничество.ДублиОтсутствуют(ЭтотОбъект, ТекстСообщения) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Наставляемый", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКУдалениюПроведения(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Документы.НазначениеНаставника.ЗаполнитьДатуЗапретаРедактирования(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбменДанными

Функция СовместноРегистрируемыеОбъекты() Экспорт
	Возврат ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(Наставник, Наставляемый);
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ДанныеДляПроведения = Новый Структура;
	
	Если Утверждено И НазначитьДоплату Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеНаставника.ДатаНачала КАК ДатаСобытия,
		|	ВЫБОР
		|		КОГДА НазначениеНаставника.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НазначениеНаставника.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ НазначениеНаставника.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо,
		|	НазначениеНаставника.Наставник КАК Сотрудник,
		|	НазначениеНаставникаНачисления.Начисление КАК Начисление,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(НазначениеНаставникаНачисления.Начисление КАК ПланВидовРасчета.Начисления).ПоддерживаетНесколькоПлановыхНачислений
		|			ТОГДА НазначениеНаставникаНачисления.ДокументОснование
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументОснование,
		|	ИСТИНА КАК Используется,
		|	ВЫБОР
		|		КОГДА НазначениеНаставника.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ИспользуетсяПоОкончании,
		|	ВЫРАЗИТЬ(НазначениеНаставника.Наставник КАК Справочник.Сотрудники).ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВЫРАЗИТЬ(НазначениеНаставника.Наставник КАК Справочник.Сотрудники).ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	НазначениеНаставникаНачисления.Размер КАК Размер
		|ИЗ
		|	Документ.НазначениеНаставника.Начисления КАК НазначениеНаставникаНачисления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеНаставника КАК НазначениеНаставника
		|		ПО НазначениеНаставникаНачисления.Ссылка = НазначениеНаставника.Ссылка
		|ГДЕ
		|	НазначениеНаставника.Ссылка = &Ссылка
		|	И НазначениеНаставника.НазначитьДоплату";
		
		ПлановыеНачисления = Запрос.Выполнить().Выгрузить();
		ДанныеДляПроведения.Вставить("ПлановыеНачисления", ПлановыеНачисления);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеНаставникаПоказатели.Ссылка.ДатаНачала КАК ДатаСобытия,
		|	НазначениеНаставникаПоказатели.Ссылка.Организация КАК Организация,
		|	НазначениеНаставникаПоказатели.Ссылка.Наставник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НазначениеНаставникаПоказатели.Ссылка.Наставник КАК Сотрудник,
		|	НазначениеНаставникаПоказатели.Показатель КАК Показатель,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(НазначениеНаставника.Начисление КАК ПланВидовРасчета.Начисления).ПоддерживаетНесколькоПлановыхНачислений
		|			ТОГДА НазначениеНаставника.Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДокументОснование,
		|	НазначениеНаставникаПоказатели.Значение КАК Значение,
		|	ВЫБОР
		|		КОГДА НазначениеНаставникаПоказатели.Ссылка.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НазначениеНаставникаПоказатели.Ссылка.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ НазначениеНаставникаПоказатели.Ссылка.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо
		|ПОМЕСТИТЬ ВТВсеПоказатели
		|ИЗ
		|	Документ.НазначениеНаставника.Показатели КАК НазначениеНаставникаПоказатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НазначениеНаставника КАК НазначениеНаставника
		|		ПО НазначениеНаставникаПоказатели.Ссылка = НазначениеНаставника.Ссылка
		|ГДЕ
		|	НазначениеНаставника.Ссылка = &Ссылка
		|	И НазначениеНаставника.НазначитьДоплату
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВсеПоказатели.ДатаСобытия КАК ДатаСобытия,
		|	ВсеПоказатели.Организация КАК Организация,
		|	ВсеПоказатели.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВсеПоказатели.Сотрудник КАК Сотрудник,
		|	ВсеПоказатели.Показатель КАК Показатель,
		|	ВсеПоказатели.ДокументОснование КАК ДокументОснование,
		|	МАКСИМУМ(ВсеПоказатели.Значение) КАК Значение,
		|	ВсеПоказатели.ДействуетДо КАК ДействуетДо
		|ИЗ
		|	ВТВсеПоказатели КАК ВсеПоказатели
		|
		|СГРУППИРОВАТЬ ПО
		|	ВсеПоказатели.ДатаСобытия,
		|	ВсеПоказатели.Организация,
		|	ВсеПоказатели.ФизическоеЛицо,
		|	ВсеПоказатели.Сотрудник,
		|	ВсеПоказатели.Показатель,
		|	ВсеПоказатели.ДокументОснование,
		|	ВсеПоказатели.ДействуетДо";
		
		ЗначенияПоказателей = Запрос.Выполнить().Выгрузить();
		ДанныеДляПроведения.Вставить("ЗначенияПоказателей", ЗначенияПоказателей);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеНаставника.ДатаНачала КАК ДатаСобытия,
		|	НазначениеНаставника.Наставник КАК Сотрудник,
		|	НазначениеНаставника.Наставник.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НазначениеНаставника.СовокупнаяТарифнаяСтавка КАК Значение,
		|	ВЫБОР
		|		КОГДА НазначениеНаставника.СовокупнаяТарифнаяСтавка = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыТарифныхСтавок.ПустаяСсылка)
		|		ИНАЧЕ НазначениеНаставника.ВидТарифнойСтавки
		|	КОНЕЦ КАК ВидТарифнойСтавки,
		|	ВЫБОР
		|		КОГДА НазначениеНаставника.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НазначениеНаставника.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ НазначениеНаставника.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо
		|ИЗ
		|	Документ.НазначениеНаставника КАК НазначениеНаставника
		|ГДЕ
		|	НазначениеНаставника.Ссылка = &Ссылка
		|	И НазначениеНаставника.НазначитьДоплату";
		
		ДанныеСовокупныхТарифныхСтавок = Запрос.Выполнить().Выгрузить();
		ДанныеДляПроведения.Вставить("ДанныеСовокупныхТарифныхСтавок", ДанныеСовокупныхТарифныхСтавок);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеНаставника.ДатаНачала КАК Период,
		|	НазначениеНаставника.Наставник КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА НазначениеНаставника.ДатаОкончания > ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДОБАВИТЬКДАТЕ(НазначениеНаставника.ДатаОкончания, ДЕНЬ, 1)
		|		ИНАЧЕ НазначениеНаставника.ДатаОкончания
		|	КОНЕЦ КАК ДействуетДо,
		|	НазначениеНаставника.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НазначениеНаставника.СпособОтраженияЗарплатыВБухучете КАК СпособОтраженияЗарплатыВБухучете,
		|	НазначениеНаставника.ОтношениеКЕНВД КАК ОтношениеКЕНВД
		|ИЗ
		|	Документ.НазначениеНаставника КАК НазначениеНаставника
		|ГДЕ
		|	НазначениеНаставника.Ссылка = &Ссылка
		|	И НазначениеНаставника.НазначитьДоплату";
		Выборка = Запрос.Выполнить().Выбрать();
		НастройкиБухучета = ОтражениеЗарплатыВБухучетеРасширенный.НоваяТаблицаНастройкиБухучетаЗаплатыСотрудников();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.СтатьяФинансирования) Или ЗначениеЗаполнено(Выборка.СпособОтраженияЗарплатыВБухучете) Или ЗначениеЗаполнено(Выборка.ОтношениеКЕНВД) Тогда
				ЗаполнитьЗначенияСвойств(НастройкиБухучета.Добавить(), Выборка);
			КонецЕсли;
		КонецЦикла;
		ДанныеДляПроведения.Вставить("НастройкиБухучета", НастройкиБухучета);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	НазначениеНаставника.ДатаНачала КАК ДатаСобытия,
		|	НазначениеНаставника.Наставник КАК Сотрудник
		|ИЗ
		|	Документ.НазначениеНаставника КАК НазначениеНаставника
		|ГДЕ
		|	НазначениеНаставника.Ссылка = &Ссылка
		|	И НазначениеНаставника.НазначитьДоплату";
		
		СотрудникиДаты = Запрос.Выполнить().Выгрузить();
		ДанныеДляПроведения.Вставить("СотрудникиДаты", СотрудникиДаты);
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(НазначениеНаставника.ДатаНачала, ДЕНЬ) КАК Период,
	|	НазначениеНаставника.Организация КАК Организация,
	|	НазначениеНаставника.Наставник КАК Наставник,
	|	НазначениеНаставника.Наставляемый КАК Наставляемый,
	|	ИСТИНА КАК Назначен,
	|	НазначениеНаставника.ДатаНачала КАК ДатаНачала,
	|	НазначениеНаставника.ДатаОкончания КАК ДатаОкончания,
	|	НазначениеНаставника.Ссылка КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(НазначениеНаставника.Наставник) = ТИП(Справочник.ФизическиеЛица)
	|			ТОГДА НазначениеНаставника.Наставник
	|		ИНАЧЕ ВЫРАЗИТЬ(НазначениеНаставника.Наставник КАК Справочник.Сотрудники).ФизическоеЛицо
	|	КОНЕЦ КАК ФизическоеЛицо
	|ИЗ
	|	Документ.НазначениеНаставника КАК НазначениеНаставника
	|ГДЕ
	|	НазначениеНаставника.Ссылка = &Ссылка";
	ДанныеДляПроведения.Вставить("Наставничество", Запрос.Выполнить().Выгрузить());

	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли