#Область ПрограммныйИнтерфейс

// Генерирует код узла плана обмена для заданной области данных.
// @skip-check module-empty-method - особенность реализации.
//
// Параметры:
//   НомерОбласти - Число - Значение разделителя. 
//
// Возвращаемое значение:
//   Строка - Код узла плана обмена для заданной области. 
//
Функция КодУзлаПланаОбменаВСервисе(Знач НомерОбласти) Экспорт
КонецФункции

// @skip-check module-empty-method - особенность реализации.
// 
// Возвращаемое значение:
//	Строка - наименование события.
//
Функция СобытиеЖурналаРегистрацииУдаленноеАдминистрированиеУстановитьПараметры() Экспорт
КонецФункции

#КонецОбласти