
#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Параметры: 
//  АннотироватьСсылочныеТипы - Булево
//  УчитыватьРасширениеДанных - Булево
// 
// Возвращаемое значение:
//  см. СхемаКонфигурацииСлужебный.ДвоичныеДанныеСхемы
Функция ДвоичныеДанныеСхемы(АннотироватьСсылочныеТипы = Ложь, УчитыватьРасширениеДанных = Истина) Экспорт
	
	Возврат СхемаКонфигурацииСлужебный.ДвоичныеДанныеСхемы(АннотироватьСсылочныеТипы, УчитыватьРасширениеДанных);

КонецФункции

#КонецОбласти

#КонецОбласти
