#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Синхронизация календарей";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Синхронизация календарей", СтатистикаСинхронизацииКалендарей());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаСинхронизацииКалендарей()
	
	Таблица = Метаданные.ПланыОбмена.СинхронизацияКалендарей;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.СтандартныеРеквизиты.Ссылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Синхронизаций";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ТипСинхронизации;
	ДанныеГруппировки.ПредставлениеГруппировки = "Типов синхронизации";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДополнительныеОтборы = Новый Массив;
	
	ДополнительныйОтбор = СборСтатистики.ДополнительныйОтбор();
	ДополнительныйОтбор.ИмяОтбора = "Включен";
	ДополнительныйОтбор.ЗначениеОтбора = Истина;
	ДополнительныйОтбор.ВидСравнения = "=";
	ДополнительныеОтборы.Добавить(ДополнительныйОтбор);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	ДанныеСтатистики.ДополнительныеОтборы = ДополнительныеОтборы;
	ДанныеСтатистики.ПроверкиОбъекта.ПометкаУдаления = Истина;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти

