#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// АдаптацияИнтерфейса
	АдаптироватьИнтерфейс();
	// Конец АдаптацияИнтерфейса
	
	ПредельноеКоличество =
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПредельноеКоличествоПопытокОтправкиСообщенияОбмена();
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.ТипСообщения = "Информация";
	ПараметрыСообщения.Сообщение = СтрШаблон(
		НСтр("ru = 'Максимальное количество попыток отправки сообщения равно %1. При достижении этого количества система не будет предпринимать новых попыток отправки. В такой ситуации нужно устранить ошибку отправки, затем либо удалить сообщение из очереди, либо сбросить счетчик попыток отправки.'"),
		ПредельноеКоличество);
	ПараметрыСообщения.КраткоеПредставление = СтрШаблон(
		НСтр("ru = 'Макс. количество попыток равно %1'"),
		ПредельноеКоличество);
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Идентификатор.Имя);
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаСоздания.Имя);
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.КоличествоПопытокОтправки.Имя);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоПопытокОтправки");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение = ПредельноеКоличество;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаПалитры.Красный);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
		СтандартнаяОбработка = Неопределено)
	
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(
		ЭтотОбъект,
		ЭлементИлиКоманда,
		НавигационнаяСсылка,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоИдентификаторуПриИзменении(Элемент)
	
	Идентификатор = Неопределено;
	
	Если ЗначениеЗаполнено(ПоИдентификатору) Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПоИдентификатору) Тогда
			Идентификатор = Новый УникальныйИдентификатор(ПоИдентификатору);
		Иначе
			ТекстОшибки = СтрШаблон(НСтр("ru = '""%1"" не является уникальным идентификатором'"), ПоИдентификатору);
			ПоказатьПредупреждение(, ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Идентификатор = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Идентификатор",
			Неопределено,
			ВидСравненияКомпоновкиДанных.Равно,,
			Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"Идентификатор",
			Идентификатор,
			ВидСравненияКомпоновкиДанных.Равно,,
			Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СброситьСчетчикПопытокОтправки(Знач Команда)
	
	СтрокиДляОбработки = Элементы.Список.ПолучитьСтрокиДляОбработки();
	
	КоличествоСообщений = СтрокиДляОбработки.Количество();
	
	Если КоличествоСообщений = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одного сообщения.'"));
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтрШаблон(
		НСтр("ru = 'Сбросить счетчик попыток отправки для %1?'"),
		СклоненияСтрокиПоЧислу(НСтр("ru = 'сообщение'"), КоличествоСообщений, "ЧС=Количественное", "ПД=Родительный"));
	Ответ = Ждать ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ПоказатьВопросДаНетАсинх(ТекстВопроса);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СброситьСчетчикПопытокОтправкиНаСервере(СтрокиДляОбработки);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АдаптацияИнтерфейса

&НаСервере
Процедура АдаптироватьИнтерфейс()
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Элементы.ГруппаКоманднаяПанель.Видимость = Истина;
		Элементы.ФормаОбновить.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// Очищает количество попыток отправки для выбранных сообщений.
//
// Параметры:
//   СписокВыбранныхСообщений - Массив из РегистрСведенийКлючЗаписи.ОчередьСообщенийВ1СДокументооборот
//
&НаСервере
Процедура СброситьСчетчикПопытокОтправкиНаСервере(Знач СписокВыбранныхСообщений)
	
	Для Каждого Сообщение Из СписокВыбранныхСообщений Цикл
		Запись = РегистрыСведений.ОчередьСообщенийВ1СДокументооборот.СоздатьМенеджерЗаписи();
		Запись.МоментВремени = Сообщение.МоментВремени;
		Запись.Идентификатор = Сообщение.Идентификатор;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.КоличествоПопытокОтправки = 0;
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СклоненияСтрокиПоЧислу(Знач СклоняемаяСтрока, Знач Число, Знач ОписаниеСтроки, Знач ФорматнаяСтрока)
	
	Склонения = ПолучитьСклоненияСтрокиПоЧислу(СклоняемаяСтрока, Число,, ОписаниеСтроки, ФорматнаяСтрока);
	
	Если Склонения.Количество() = 1 Тогда
		Возврат Склонения[0];
	Иначе
		Возврат Склонения;
	КонецЕсли;
	
КонецФункции

#КонецОбласти