#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДисциплинарноеВзыскание") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьПоДокументуОснованию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = Документы.СнятиеДисциплинарногоВзыскания.ПолучитьДанныеДляПроведения(Ссылка);
	
	ДисциплинарныеВзыскания.СформироватьДвиженияДисциплинарногоВзыскания(Движения, ДанныеДляПроведения.ДвиженияДисциплинарногоВзыскания);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Сотрудники.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("Организация", Организация);
		ЗарплатаКадры.СоздатьВТПоТаблицеЗначений(Запрос.МенеджерВременныхТаблиц, Сотрудники.Выгрузить(), "ВТСнимаемыеВзыскания");
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Организация КАК Организация,
		|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
		|	СнимаемыеВзыскания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СнимаемыеВзыскания.Взыскание КАК Взыскание,
		|	СнимаемыеВзыскания.ДатаНачала КАК ДатаНачала,
		|	СнимаемыеВзыскания.ДатаСнятия КАК Период
		|ПОМЕСТИТЬ ВТИзмеренияДаты
		|ИЗ
		|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания";
		Запрос.Выполнить();
		
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
			|	СнимаемыеВзыскания.Взыскание КАК Взыскание
			|ИЗ
			|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание.Сотрудники КАК СотрудникиОснования
			|		ПО (СотрудникиОснования.Ссылка = &ДокументОснование)
			|			И СнимаемыеВзыскания.Сотрудник = СотрудникиОснования.Сотрудник
			|			И СнимаемыеВзыскания.Взыскание = СотрудникиОснования.Взыскание
			|ГДЕ
			|	СотрудникиОснования.Сотрудник ЕСТЬ NULL";
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru='Сотрудник %1 с взысканием %2 отсутствует в документе-основании %3'"),
						Выборка.Сотрудник, Выборка.Взыскание, ДокументОснование),
						Ссылка,,"Объект", Отказ);
						
			КонецЦикла;
		КонецЕсли;
		
		СоздатьВТСведенияОДисциплинарныхВзысканиях(Ссылка,Запрос.МенеджерВременныхТаблиц);
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СнимаемыеВзыскания.Сотрудник КАК Сотрудник,
			|	СнимаемыеВзыскания.ДатаСнятия КАК ДатаСнятия,
			|	СнимаемыеВзыскания.Взыскание КАК Взыскание
			|ИЗ
			|	ВТСнимаемыеВзыскания КАК СнимаемыеВзыскания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДисциплинарныхВзысканиях КАК Взыскания
			|		ПО СнимаемыеВзыскания.Сотрудник = Взыскания.Сотрудник
			|			И СнимаемыеВзыскания.Взыскание = Взыскания.Взыскание
			|			И СнимаемыеВзыскания.ДатаНачала = Взыскания.ДатаНачала
			|ГДЕ
			|	Взыскания.ДатаОкончания ЕСТЬ NULL";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru='Для сотрудника %1 нет действующего взыскания %2 на %3'"),
					Выборка.Сотрудник, Выборка.Взыскание, Формат(Выборка.ДатаСнятия, "ДЛФ=DD")),
					Ссылка,,"Объект", Отказ);
					
			
		КонецЦикла;
	
	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Список сотрудников на снятие взыскания не может быть пустым'"), , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТСведенияОДисциплинарныхВзысканиях(ИсключаемыйРегистратор,МенеджерВременныхТаблиц,ТаблицаФильтра = "ВТИзмеренияДаты")
	ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "Регистратор", "<>", ИсключаемыйРегистратор);
	ЗарплатаКадрыОбщиеНаборыДанных.СоздатьВТИмяРегистраСрезПоследних("СведенияОДисциплинарныхВзысканиях", МенеджерВременныхТаблиц, Истина,
		ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ТаблицаФильтра, "Организация,Сотрудник,Взыскание,ДатаНачала"), ПараметрыПостроения,"ВТСведенияОДисциплинарныхВзысканиях");
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуОснованию() Экспорт
	
	ДанныеОснования = ДанныеДокументаОснования();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОснования);
	Сотрудники.Очистить();
	
	Для каждого ДанныеСотрудника Из ДанныеОснования.Сотрудники Цикл
		Приемник = Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(Приемник, ДанныеСотрудника);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеДокументаОснования()
	
	ДанныеОснования = Новый Структура("Организация,ДатаСобытия,Сотрудники",Справочники.Организации.ПустаяСсылка(),Дата(1,1,1),Новый Массив());
	ДанныеОснования.ДатаСобытия = ?(ЗначениеЗаполнено(ДатаСобытия), ДатаСобытия, ТекущаяДата());

	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ДанныеОснования.Организация = ДокументОснование.Организация;
		
		Запрос = Новый Запрос();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
		Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
		Запрос.УстановитьПараметр("ДатаАктуальности",ДанныеОснования.ДатаСобытия);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДисциплинарноеВзыскание.Организация КАК Организация,
		|	ДисциплинарноеВзысканиеСотрудники.Ссылка КАК Ссылка,
		|	ДисциплинарноеВзысканиеСотрудники.Сотрудник КАК Сотрудник,
		|	ДисциплинарноеВзысканиеСотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДисциплинарноеВзысканиеСотрудники.Взыскание КАК Взыскание,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаНачала КАК ДатаНачала,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаОкончания КАК ДатаОкончания,
		|	ДисциплинарноеВзысканиеСотрудники.ДатаОкончания КАК Период
		|ПОМЕСТИТЬ ВТСотрудникиОснования
		|ИЗ
		|	Документ.ДисциплинарноеВзыскание.Сотрудники КАК ДисциплинарноеВзысканиеСотрудники
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДисциплинарноеВзыскание КАК ДисциплинарноеВзыскание
		|		ПО ДисциплинарноеВзысканиеСотрудники.Ссылка = ДисциплинарноеВзыскание.Ссылка
		|ГДЕ
		|	ДисциплинарноеВзысканиеСотрудники.Ссылка = &Ссылка";
		Запрос.Выполнить();
		
		СоздатьВТСведенияОДисциплинарныхВзысканиях(ДокументОснование,Запрос.МенеджерВременныхТаблиц,"ВТСотрудникиОснования");
		
		КадровыеДанные = "ДатаУвольнения";
		ОписательВременныхТаблиц = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудникиОснования");
		КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВременныхТаблиц, Истина, КадровыеДанные);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиОснования.Сотрудник КАК Сотрудник,
		|	СотрудникиОснования.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиОснования.Взыскание КАК Взыскание,
		|	СотрудникиОснования.ДатаНачала КАК ДатаНачала,
		|	&ДатаАктуальности КАК ДатаСнятия
		|ИЗ
		|	ВТСотрудникиОснования КАК СотрудникиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО СотрудникиОснования.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСведенияОДисциплинарныхВзысканиях КАК Взыскания
		|		ПО СотрудникиОснования.Сотрудник = Взыскания.Сотрудник
		|			И СотрудникиОснования.ФизическоеЛицо = Взыскания.ФизическоеЛицо
		|			И СотрудникиОснования.Взыскание = Взыскания.Взыскание
		|			И СотрудникиОснования.ДатаНачала = Взыскания.ДатаНачала
		|ГДЕ
		|	Взыскания.ДатаОкончания ЕСТЬ NULL
		|	И (КадровыеДанныеСотрудников.ДатаУвольнения >= &ДатаАктуальности
		|			ИЛИ КадровыеДанныеСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеСотрудника = Новый Структура("Сотрудник, ФизическоеЛицо, Взыскание, ДатаНачала, ДатаСнятия");
			ЗаполнитьЗначенияСвойств(ДанныеСотрудника, Выборка);
			ДанныеОснования.Сотрудники.Добавить(ДанныеСотрудника);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДанныеОснования;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли