#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сторнирует документ по учетам. Используется подсистемой исправления документов.
//
// Параметры:
//  Движения				 - КоллекцияДвижений, Структура	 - Коллекция движений исправляющего документа в которую будут добавлены сторно стоки.
//  Регистратор				 - ДокументСсылка				 - Документ регистратор исправления (документ исправление).
//  ИсправленныйДокумент	 - ДокументСсылка				 - Исправленный документ движения которого будут сторнированы.
//  СтруктураВидовУчета		 - Структура					 - Виды учета, по которым будет выполнено сторнирование исправленного документа.
//  					Состав полей см. в ПроведениеСервер.СтруктураВидовУчета().
//  ДополнительныеПараметры	 - Структура					 - Структура со свойствами:
//  					* ИсправлениеВТекущемПериоде - Булево - Истина когда исправление выполняется в периоде регистрации исправленного документа.
//						* ОтменаДокумента - Булево - Истина когда исправление вызвано документом СторнированиеНачислений.
//  					* ПериодРегистрации	- Дата - Период регистрации документа регистратора исправления.
// 
// Возвращаемое значение:
//  Булево - "Истина" если сторнирование выполнено этой функцией, "Ложь" если специальной процедуры не предусмотрено.
//
Функция СторнироватьПоУчетам(Движения, Регистратор, ИсправленныйДокумент, СтруктураВидовУчета, ДополнительныеПараметры) Экспорт
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(Удержания.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки);
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ОграничениеВзысканий;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

Функция ПараметрыСторнируемогоДокумента(ДокументСсылка) Экспорт
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("ПериодРегистрации", "МесяцНачисления");
	Реквизиты.Вставить("Организация");
	Свойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты);
	Свойства.Вставить("Ссылка", ДокументСсылка);
	
	Параметры = ИсправлениеДокументовЗарплатаКадры.ПараметрыСторнируемогоДокумента(ДокументСсылка, Свойства);
		
	Параметры.НачисленияСДатойНачала = Ложь;
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

Функция ДобавитьКомандыСозданияДокументов(КомандыСозданияДокументов, ДополнительныеПараметры) Экспорт
	
	ЗарплатаКадрыРасширенный.ДобавитьВКоллекциюКомандуСозданияДокументаПоМетаданнымДокумента(
		КомандыСозданияДокументов, Метаданные.Документы.ОграничениеВзысканий);
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ДанныеДляПроведения

Процедура ДанныеУдержанийПоСотрудникам(Ссылка, ДанныеДляПроведения) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Удержания.Ссылка КАК ДокументСсылка,
		|	Удержания.Ссылка.Организация.ГоловнаяОрганизация КАК Организация,
		|	Удержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Удержания.Сотрудник КАК Сотрудник,
		|	Удержания.Удержание КАК Удержание,
		|	Удержания.Удержание.КатегорияУдержания КАК КатегорияУдержания,
		|	Удержания.Результат - Удержания.Рассчитано КАК Сумма,
		|	Удержания.Результат - Удержания.Рассчитано КАК Результат,
		|	Удержания.ДокументОснование КАК ДокументОснование,
		|	Удержания.Получатель КАК Получатель,
		|	Удержания.ПлатежныйАгент КАК ПлатежныйАгент,
		|	ВЫБОР
		|		КОГДА Удержания.Удержание.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ИсполнительныйЛист)
		|			ТОГДА Удержания.Получатель
		|		КОГДА Удержания.Удержание.КатегорияУдержания = ЗНАЧЕНИЕ(Перечисление.КатегорииУдержаний.ВознаграждениеПлатежногоАгента)
		|			ТОГДА Удержания.ПлатежныйАгент
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	КОНЕЦ КАК Контрагент,
		|	НАЧАЛОПЕРИОДА(Удержания.ДатаНачала, МЕСЯЦ) КАК ПериодДействия,
		|	Удержания.ДатаНачала КАК ДатаНачала,
		|	Удержания.ДатаОкончания КАК ДатаОкончания,
		|	Удержания.ИдентификаторСтрокиВидаРасчета КАК ИдентификаторСтроки,
		|	ВЫБОР
		|		КОГДА Удержания.Рассчитано = 0
		|			ТОГДА 0
		|		ИНАЧЕ (Удержания.Результат - Удержания.Рассчитано) / Удержания.Рассчитано
		|	КОНЕЦ КАК Коэффициент,
		|	ИСТИНА КАК ОграничениеВзыскания,
		|	ИСТИНА КАК ФиксСторно
		|ИЗ
		|	Документ.ОграничениеВзысканий.Удержания КАК Удержания
		|ГДЕ
		|	Удержания.Ссылка = &Ссылка
		|	И Удержания.Результат <> Удержания.Рассчитано";
	ДанныеДляПроведения.Удержания = Запрос.Выполнить().Выгрузить();
	
	ОграниченияВзысканий = ДанныеДляПроведения.Удержания.Скопировать(,
		"ФизическоеЛицо,
		|Удержание,
		|КатегорияУдержания,
		|Сумма,
		|ДокументОснование,
		|Получатель,
		|ПлатежныйАгент,
		|Контрагент,
		|ПериодДействия,
		|ДатаНачала,
		|ДатаОкончания,
		|ИдентификаторСтроки,
		|ОграничениеВзыскания");
	ОграниченияВзысканий.Колонки.Удержание.Имя = "ВидУдержания";
	ОграниченияВзысканий.Колонки.Добавить(
		"Сотрудник", 
		Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ОграниченияВзысканий.Колонки.Добавить(
		"Подразделение",
		Новый ОписаниеТипов("СправочникСсылка.ПодразделенияОрганизаций"));
	ОграниченияВзысканий.Колонки.Добавить(
		"СтатьяФинансирования", 
		Новый ОписаниеТипов("СправочникСсылка.СтатьиФинансированияЗарплата"));
	ОграниченияВзысканий.Колонки.Добавить(
		"СтатьяРасходов",
		Новый ОписаниеТипов("СправочникСсылка.СтатьиРасходовЗарплата"));
	ОграниченияВзысканий.Колонки.Добавить(
		"ПервичныйРегистратор",
		Новый ОписаниеТипов(Метаданные.ОпределяемыеТипы.РегистраторыБухучетНачисленияУдержанияПоСотрудникам.Тип));
		
	ДанныеДляПроведения.УдержанияПоСотрудникам =
		ОтражениеЗарплатыВУчетеРасширенный.ОграниченияВзысканийПоРабочимМестамИСтатьям(
			ДанныеДляПроведения.Организация, ДанныеДляПроведения.МесяцНачисления, ОграниченияВзысканий, Ссылка);
			
	ДанныеДляПроведения.УдержанияПоСотрудникам.Колонки.Добавить(
		"ВидДоходаИсполнительногоПроизводства", 
		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДоходовИсполнительногоПроизводства"));
	ДанныеДляПроведения.УдержанияПоСотрудникам.ЗаполнитьЗначения(
		Перечисления.ВидыДоходовИсполнительногоПроизводства.ЗарплатаВознаграждения,
		"ВидДоходаИсполнительногоПроизводства");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли