#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Уведомления";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	// АПК:1297-выкл Статистика, не локализуется
	Статистика.Вставить("Рассылки уведомлений", СтатистикаРассылокУведомлений());
	// АПК:1297-вкл
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
	НачалоПериода = СборСтатистики.НачалоПериодаСбораСтатистики();
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Периодическая;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Уведомления", СтатистикаУведомлений(НачалоПериода));
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаРассылокУведомлений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РассылкиУведомлений.Ссылка) КАК Рассылок,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АктивныеРассылкиУведомлений.Ссылка) КАК АктивныхРассылок
		|ИЗ
		|	Справочник.РассылкиУведомлений КАК РассылкиУведомлений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РассылкиУведомлений КАК АктивныеРассылкиУведомлений
		|		ПО РассылкиУведомлений.Ссылка = АктивныеРассылкиУведомлений.Ссылка
		|			И (АктивныеРассылкиУведомлений.Подготовлена = ИСТИНА)
		|ГДЕ
		|	РассылкиУведомлений.ПометкаУдаления = ЛОЖЬ";
	
	ТаблицаРассылок = Запрос.Выполнить().Выгрузить();
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Рассылок", ТаблицаРассылок.ВыгрузитьКолонку("Рассылок")[0]);
	ПоказателиСтатистики.Вставить("Активных рассылок", ТаблицаРассылок.ВыгрузитьКолонку("АктивныхРассылок")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаУведомлений(НачалоПериода)
	
	Таблица = Метаданные.РегистрыСведений.Уведомления;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.Рассылка;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Рассылок";
	
	ДанныеСтатистики.ДанныеПериода.Период = Таблица.Измерения.ДатаСобытия;
	ДанныеСтатистики.ДанныеПериода.НачалоПериода = НачалоПериода;
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Ресурсы.Состояние;
	ДанныеГруппировки.ПредставлениеГруппировки = "Состояний";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Реквизиты.ВидТранспорта;
	ДанныеГруппировки.ПредставлениеГруппировки = "Видов транспорта";
	ДанныеГруппировки.Перечисление = Истина;
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти