#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата(); // АПК:143 Для фильтрации событий в журнале регистрации требуется дата сервера.
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	МенеджерРегистра = РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий;
	МенеджерРегистра.ПриЗаписиДокументаУведомлениеОбОтсутствииОтвета(ЭтотОбъект);
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МенеджерРегистра = РегистрыСведений.РегистрацииОтветовНаЗапросыФССДляРасчетаПособий;
	МенеджерРегистра.УдалитьСсылкиНаУведомлениеОбОтсутствииОтвета(Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФиксацияВторичныхДанныхВДокументах

Функция ОбновитьВторичныеДанные(ПараметрыФиксации = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Модифицирован = Ложь;
	
	Если Не Загружен Или ОбъектЗафиксирован() Тогда
		Возврат Модифицирован;
	КонецЕсли;
	
	Если ПараметрыФиксации = Неопределено Тогда
		ПараметрыФиксации = Менеджер().ПараметрыФиксацииВторичныхДанных();
	КонецЕсли;
	
	Если ЗаполнитьВходящийЗапрос(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьПодтверждениеПолучения(ПараметрыФиксации) Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьМаксимальнуюДатуПодтвержденияПолучения() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьФизическоеЛицо() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьОрганизацию() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Если ЗаполнитьФлажокОбработан() Тогда
		Модифицирован = Истина;
	КонецЕсли;
	
	Возврат Модифицирован;
КонецФункции

Функция Менеджер()
	Возврат Документы.УведомлениеОбОтсутствииОтветаСЭДО;
КонецФункции

Функция ОбъектЗафиксирован() Экспорт
	Возврат Менеджер().ОбъектЗафиксирован(ЭтотОбъект);
КонецФункции

Функция ЗаполнитьВходящийЗапрос(ПараметрыФиксации)
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ВходящийЗапрос") Тогда
		Возврат Ложь;
	КонецЕсли;
	СведенияОПроцессе = СведенияОПроцессе();
	НовоеЗначение = ?(СведенияОПроцессе = Неопределено, Неопределено, СведенияОПроцессе.ВходящийЗапрос);
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ВходящийЗапрос, НовоеЗначение);
КонецФункции

Функция ЗаполнитьПодтверждениеПолучения(ПараметрыФиксации) Экспорт
	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты = Новый Структура("ДатаОтправкиПодтверждения, ПодтверждениеПолученоСФР");
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитыШапкиЗафиксированы(ЭтотОбъект, Реквизиты) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Подтверждение = СЭДОФСС.СостояниеПодтверждения(Страхователь, ИдентификаторСообщения, ДатаОтправкиПодтверждения);
	Если Подтверждение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Реквизиты.ДатаОтправкиПодтверждения = Подтверждение.ДатаОтправки;
	Реквизиты.ПодтверждениеПолученоСФР  = Подтверждение.Доставлено;
	
	Возврат ФиксацияВторичныхДанныхВДокументах.ОбновитьДанныеШапки(Реквизиты, ЭтотОбъект, ПараметрыФиксации);
КонецФункции

Функция ЗаполнитьМаксимальнуюДатуПодтвержденияПолучения()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "МаксимальнаяДатаПодтверждения") Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаСообщения) Тогда
		НовоеЗначение = СЭДОФСС.СледующийРабочийДень(ДатаСообщения, 1);
	Иначе
		НовоеЗначение = Неопределено;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(МаксимальнаяДатаПодтверждения, НовоеЗначение);
КонецФункции

Функция ЗаполнитьФизическоеЛицо()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "ФизическоеЛицо") Тогда
		Возврат Ложь;
	КонецЕсли;
	СведенияОПроцессе = СведенияОПроцессе();
	НовоеЗначение = ?(СведенияОПроцессе = Неопределено, Неопределено, СведенияОПроцессе.ФизическоеЛицо);
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(ФизическоеЛицо, НовоеЗначение);
КонецФункции

Функция ЗаполнитьОрганизацию()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "Организация") Тогда
		Возврат Ложь;
	КонецЕсли;
	СведенияОПроцессе = СведенияОПроцессе();
	Если СведенияОПроцессе <> Неопределено И ЗначениеЗаполнено(СведенияОПроцессе.Организация) Тогда
		НовоеЗначение = СведенияОПроцессе.Организация;
	Иначе
		НовоеЗначение = Страхователь;
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(Организация, НовоеЗначение);
КонецФункции

Функция ЗаполнитьФлажокОбработан()
	Если ФиксацияВторичныхДанныхВДокументах.РеквизитШапкиЗафиксирован(ЭтотОбъект, "Обработан") Тогда
		Возврат Ложь;
	КонецЕсли;
	// Документ обработан если с даты формирования документа были успешно отправленные ответы на запрос.
	СведенияОПроцессе = СведенияОПроцессе();
	Если СведенияОПроцессе = Неопределено Тогда
		НовоеЗначение = Ложь; // Нет ответа на запрос.
	ИначеЕсли ?(ЗначениеЗаполнено(СведенияОПроцессе.РегистрацияДата),
			// Ответ на запрос доставлен СФР ранее чем уведомление.
			ДатаСообщения > СведенияОПроцессе.РегистрацияДата,
			// Ответ на запрос не отправлен или отправлен более чем за сутки до уведомления.
			ЗначениеЗаполнено(СведенияОПроцессе.ДатаОтправки)
			И ДатаСообщения > СведенияОПроцессе.ДатаОтправки + 86400) Тогда
		НовоеЗначение = Ложь; // Неактуальный ответ на запрос.
	Иначе
		НовоеЗначение = (СведенияОПроцессе.Состояние = Перечисления.СостоянияДокументаСЭДОФСС.Отправлен
			Или СведенияОПроцессе.Состояние = Перечисления.СостоянияДокументаСЭДОФСС.ОтправленОператору
			Или СведенияОПроцессе.Состояние = Перечисления.СостоянияДокументаСЭДОФСС.Принят);
	КонецЕсли;
	Возврат ФиксацияВторичныхДанныхВДокументах.ИзменитьЗначениеРеквизита(Обработан, НовоеЗначение);
КонецФункции

Функция СведенияОПроцессе()
	СведенияОПроцессе = Неопределено;
	Если ДополнительныеСвойства.Свойство("СведенияОПроцессе", СведенияОПроцессе) Тогда
		Возврат СведенияОПроцессе;
	КонецЕсли;
	СведенияОПроцессе = СЭДОФСС.СведенияОПроцессе(НомерПроцесса);
	ДополнительныеСвойства.Вставить("СведенияОПроцессе", СведенияОПроцессе);
	Возврат СведенияОПроцессе;
КонецФункции

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли