#Область ПрограммныйИнтерфейс

// Переопределяет стандартное поведение при поиске переопределяемых представлений, запросов наборов данных СКД.
// 
// Параметры:
//  Запрос                     - Запроса, Неопределено, в этом параметре возвращается переопределенный запрос представления
//  ТекстЗапроса               - Строка, содержит текст переопределяемого запроса
//  ТекстыОпределенныхЗапросов - Соответсвие, содержит тексты ранее обработанных запросов набора данных
//                                 * Ключ - Строка, имя создаваемой временной таблицы
//                                 * Значение - Строка, текст запроса
//  СтандартнаяОбработка - Булево
//
Процедура ПриПолученииЗапросаПоПредставлению(Запрос, ТекстЗапроса, ТекстыОпределенныхЗапросов, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

#КонецОбласти