
#Область ПрограммныйИнтерфейс

// Возвращает список приложений в облаке, доступных пользователю сервиса.
// 
// Возвращаемое значение:
//   ТаблицаЗначений - см. ПрограммныйИнтерфейсСервиса.Приложения()
//
Функция ДоступныеПриложения() Экспорт
	
	Результат = Неопределено;
	МодульПрограммныйИнтерфейсСервиса = ОбщегоНазначения.ОбщийМодуль("ПрограммныйИнтерфейсСервиса");
	Абоненты = МодульПрограммныйИнтерфейсСервиса.Абоненты();
	КодЭтогоПриложения = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();
	
	Для Каждого Абонент Из Абоненты Цикл
		
		СвойстваОтвета = Неопределено;
		Приложения = МодульПрограммныйИнтерфейсСервиса.ПриложенияАбонента(Абонент.Код, Ложь, СвойстваОтвета);
		Если ЗначениеЗаполнено(СвойстваОтвета.Сообщение) Тогда
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,,
				СвойстваОтвета.Сообщение);
		КонецЕсли;
		Если Приложения = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Приложения.СкопироватьКолонки();
		КонецЕсли;
		Для Каждого Приложение Из Приложения Цикл
			
			Если Приложение.СостояниеПриложения <> Перечисления.СостоянияПриложений.Используется
				Или Приложение.Код = КодЭтогоПриложения Тогда
				
				Продолжить;
			КонецЕсли;
			
			// Получение доступных приложений выполняется синхронно, поэтому для большей отзывчивости интерфейса
			// возможность работы приложений с календарем отчетности на этом шаге не проверяется.
			// Проверка будет выполнена позже в методе ПодключитьНовыеПриложения(), который уже выполняется асинхронно.
			
			НоваяСтрока = Результат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Приложение);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

// Возвращает список организаций, данные по которым доступны пользователю.
// 
// Возвращаемое значение:
//   Массив элементов типа Структура.
//     *Наименование - Строка - Наименование организации,
//     *Идентификатор - Строка - ГУИД элемента справочника,
//     *ИНН - Строка - ИНН организации,
//     *КПП - Строка - КПП организации,
//
Функция ДоступныеОрганизацииПользователя() Экспорт
	
	Результат = Новый Массив;
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПолученииДоступныхОрганизацийПользователя(Результат);
	
	Возврат Результат;
КонецФункции

// Запрашивает у другого облачного приложения данные отчетной кампании.
// 
// Параметры:
//   ДанныеПриложения - Структура
//      *Ссылка - СправочникСсылка.ОблачныеПриложения - экземпляр приложения, которому направляется запрос
//      *Вид - Перечисление.
//   Параметры - Структура
//      *ДатаНачала - Дата - период, начиная с которого необходимо запросить данные
//      *ДатаКонца - Дата - конечный период, по который требуется запросить данные
//      *СобытияКалендаря - Строка - отбор по виду отчетов (все отчеты" или "только уведомления ЕНС").
//                                   Устарело. Следует использовать ПоОтчетам, ПоТребованиямФНС, ПоУведомлениямЕНС.
//      *ПоОтчетам - Булево - отбор по виду отчетов
//      *ПоТребованиямФНС - Булево - отбор по виду отчетов
//      *ПоУведомлениямЕНС - Булево - отбор по виду отчетов
//
// Возвращаемое значение:
//   см. возращаемые значения метода СообщенияОблачныхПриложений.ЗапроситьДанныеПриложения
//
Функция ЗапроситьДанныеОтчетнойКампании(ДанныеПриложения, Параметры) Экспорт
	
	Результат = Неопределено;
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриЗапросеДанныхОтчетнойКампании(
		Результат, ДанныеПриложения, Параметры);
	
	Возврат Результат;
	
КонецФункции

// Отправляет другому облачному приложению запрос синхронного получения данных.
// Следует выполнять синхронно только те запросы, на обработку которых приложению
// понадобится заведомо мало времени. "Тяжелые" запросы данных следует выполнять асинхронно.
// 
// Параметры:
//   ТипЗапроса - Строка - вид запрашиваемых данных.
//   Приложение - СправочникСсылка.ОблачныеПриложения - экземпляр приложения, которому направляется запрос
//   Параметры - Структура - см. КалендарьОтчетностиКлиентСервер.НовыйПараметрыЗапросаИзмененияОтчета()
//               Неопределено - если не требуется каких-либо дополнительных параметров
//
// Возвращаемое значение:
//   см. возращаемые значения метода СообщенияОблачныхПриложений.ЗапроситьДанныеПриложения
//
Функция ЗапроситьСинхронно(ТипЗапроса, Приложение, Параметры = Неопределено) Экспорт
	
	ПараметрыЗапроса = Неопределено;
	Если ТипЗапроса = ТипЗапросаСписокОрганизаций() Тогда
		ПараметрыЗапроса = НовыйПараметрыЗапросаСпискаОрганизаций();
		
	ИначеЕсли ТипЗапроса = ТипЗапросаЗаписатьСтатусОтчета()
		Или ТипЗапроса = ТипЗапросаЗаписатьКомментарийОтчета() Тогда
		
		ПараметрыЗапроса = НовыйПараметрыЗапросаЗаписиСтатусаКомментарияОтчета(ТипЗапроса);
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса.ПараметрыОтчета, Параметры);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = СообщенияОблачныхПриложений.ЗапроситьДанныеПриложения(
		Приложение,
		ИмяПрикладногоМеханизма(),
		ПараметрыЗапроса);
		
	Возврат Запрос;
	
КонецФункции

// Получает ответы от подключенных приложений, которым был ранее отправлен запрос
// на получение данных.
//
// Параметры:
//  Запросы - ТаблицаЗначений - отправленные ранее запросы другим облачным приложениям,
//            см. НовыйЗапросыОблачнымПриложениям().
//
// Возвращаемое значение:
//   Структура - 
//      *Ответы - ТаблицаЗначений
//         **Приложение - СправочникСсылка.ОблачныеПриложения - приложение, от которого получен ответ
//         **Данные - Строка- ответы приложений в виде строки JSON,
//      *ОжидающиеЗапросы - ТаблицаЗначений - запросы, по которым не удалось получить ответ,
//                          см. НовыйЗапросыОблачнымПриложениям()
//      *ОшибкиПриложений - Массив - список приложений, получение данных от которых более невозможно,
//                        опрашивать повторно их не следует.
//
Функция ПолучитьОтветыНаЗапросы(Запросы) Экспорт
	
	Результат = Неопределено;
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПолученииОтветовНаЗапросы(Результат, Запросы);
	
	Возврат Результат;
	
КонецФункции

// Подтверждает получение данных от другого облачного приложения по отправленному ранее запросу.
//
// Параметры:
//   Приложение - СправочникСсылка.ОблачныеПриложения - экземпляр приложения, которому был отправлен запрос.
//   ИдентификаторЗапроса - Строка - идентификатор запроса, полученный методом
//                                   СообщенияОблачныхПриложений.ЗапроситьДанныеПриложения()
//
Процедура ОтметитьДанныеПолучены(Приложение, ИдентификаторЗапроса) Экспорт
	
	СообщенияОблачныхПриложений.ОтметитьДанныеПолучены(
		Приложение,
		ИмяПрикладногоМеханизма(),
		ИдентификаторЗапроса);
		
КонецПроцедуры

// Подключает новые приложения пользователя к календарю отчетности.
// Метод выполняется асинхронно (в фоновом задании).
// 
// Параметры:
//   Параметры - Структура - см. НовыйПараметрыПодключенияПриложений().
//
// Возвращаемое значение:
//   ОшибкиПодключения - Массив - наименования приложений, которые не удалось подключить.
//
Функция ПодключитьНовыеПриложения(Параметры) Экспорт
	
	ОшибкиПодключения = Новый Массив;
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодключенииНовыхПриложений(ОшибкиПодключения, Параметры);
	
	Возврат ОшибкиПодключения;
	
КонецФункции

// Возвращает таблицу правил предоставления и имен исполнителей отчетов
//
// Возвращаемое значение:
//   ТаблицаЗначений
//        *ИмяПравила   - имя правила
//        *ИмяИсточника - имя метаданных отчета
//
Функция ПравилаПредставленияОтчетовИсполнители() Экспорт
	
	ИсполнителиПравил = Новый ТаблицаЗначений;
	ИсполнителиПравил.Колонки.Добавить("ИмяПравила",   ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ИсполнителиПравил.Колонки.Добавить("ИмяИсточника", ОбщегоНазначения.ОписаниеТипаСтрока(200));
	
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриЗаполненииПравилПредставленияОтчетовИсполнители(ИсполнителиПравил);
	
	Возврат ИсполнителиПравил;
	
КонецФункции

// Возвращает ответ на запрос данных отчетности от облачного приложения.
// 
// Параметры:
//   Параметры - Структура - см. ОтборЗапросаДанныхОтчетности()
//
// Возвращаемое значение:
//   Структура
//      *ТипЗапроса - Строка - см. ТипЗапросаДанныеОтчетности()
//      *Ответ - Структура, см. КалендарьОтчетности.НовыйДанныеОтчетности(),
//
Функция ОтветДанныеОтчетности(Отбор) Экспорт
	
	Данные = Новый Массив;
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодготовкеОтветаДанныеОтчетности(Данные, Отбор);
	
	ДанныеОтвета = НовыйОтветДанныеОтчетности();
	ДанныеОтвета.Ответ = Данные;
	Возврат ДанныеОтвета;
	
КонецФункции

// Возвращает ответ на запрос списка организаций от облачного приложения.
// 
// Параметры:
//   Параметры - Структура - см. ОтборЗапросаДанныхОтчетности()
//
// Возвращаемое значение:
//   Структура
//      *ТипЗапроса - Строка - см. ТипЗапросаСписокОрганизаций()
//      *Ответ - Структура, см. КалендарьОтчетности.НовыйДанныеОтчетности(),
//
Функция ОтветСписокОрганизаций() Экспорт
	
	ДанныеОтвета = НовыйОтветСписокОрганизаций();
	ДанныеОтвета.Ответ = ДоступныеОрганизацииПользователя();
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Возвращает ответ на запрос установки ручного статуса отчета.
// 
// Параметры:
//   Параметры - Структура - см. ОтборЗапросаДанныхОтчетности()
//
// Возвращаемое значение:
//   Структура
//      *ТипЗапроса - Строка - см. ТипЗапросаЗаписатьСтатусОтчета()
//      *Ответ - Структура, см. НовыйОтветЗаписиСтатусаОтчета(),
//
Функция ОтветЗаписатьСтатусОтчета(Параметры) Экспорт
	
	Ответ = НовыйОтветЗаписиСтатусаОтчета();
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодготовкеОтветаЗаписатьСтатусОтчета(Ответ, Параметры);
	
	Возврат Ответ;

КонецФункции

// Возвращает ответ на запрос записи комментария к отчету.
// 
// Параметры:
//   Параметры - Структура - см. ОтборЗапросаДанныхОтчетности()
//
// Возвращаемое значение:
//   Структура
//      *ТипЗапроса - Строка - см. ТипЗапросаЗаписатьКомментарийОтчета()
//      *Ответ - Структура, см. НовыйОтветЗаписиКомментарияОтчета(),
//
Функция ОтветЗаписатьКомментарийОтчета(Параметры) Экспорт
	
	Ответ = НовыйОтветЗаписиКомментарияОтчета();
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриПодготовкеОтветаЗаписатьКомментарийОтчета(Ответ, Параметры);
	
	Возврат Ответ;

КонецФункции

// Возвращает ответ на запрос подключения приложения.
// 
// Возвращаемое значение:
//   Структура
//      *ТипЗапроса - Строка - см. ТипЗапросаПодключитьОблачноеПриложение()
//      *Ответ - Структура, см. НовыйДанныеПодключенияПриложения(),
//
Функция ОтветПодключитьОблачноеПриложение() Экспорт
	
	ДанныеПодключения = НовыйДанныеПодключенияПриложения();
	ДанныеПодключения.ИдентификаторПриложения = СообщенияОблачныхПриложений.ИдентификаторЭтогоПриложения();
	ДанныеПодключения.ДоступныеОрганизации = ДоступныеОрганизацииПользователя();
	
	ДанныеОтвета = НовыйОтветПодключитьОблачноеПриложение();
	ДанныеОтвета.Ответ = ДанныеПодключения;
	
	Возврат ДанныеОтвета;
	
КонецФункции

// Конструктор нового запроса данных отчетности от облачных приложений
//
// Возвращаемое значение:
//   Структура
//
Функция НовыйПараметрыЗапросаДанныхОтчетности() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТипЗапроса", ТипЗапросаДанныеОтчетности());
	Параметры.Вставить("Отбор", ОтборЗапросаДанныхОтчетности());
	
	Возврат Параметры;
	
КонецФункции

// Возвращает параметры запуска фонового задания для подключения новых приложений.
//
// Возвращаемое значение:
//   - Структура:
//     * Пользователь - СправочникСсылка.Пользователи - пользователь, подключающий новые приложения.
//     * ПриложенияПользователя - ТаблицаЗначений - см. ПрограммныйИнтерфейсСервиса.Приложения()
//
Функция НовыйПараметрыПодключенияПриложений() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("Пользователь", Справочники.Пользователи.ПустаяСсылка());
	Параметры.Вставить("ПриложенияПользователя");
	
	Возврат Параметры;
	
КонецФункции

// Конструктор данных для асинхронного опроса облачных приложений.
//
// Возвращаемое значение:
//   - ТаблицаЗначений:
//     * Приложение - СправочникСсылка.ОблачныеПриложения
//     * ИдентификаторЗапроса - Строка
//     * ТипЗапроса - Строка
//
Функция НовыйЗапросыОблачнымПриложениям() Экспорт
	
	Запросы = Новый ТаблицаЗначений;
	
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриЗаполненииНовогоЗапросаОблачнымПриложениям(Запросы);
	
	Возврат Запросы;
КонецФункции

// Обрабатывает запрос на получение данных отчетности.
// 
// Параметры:
//   Параметры - Структура - см. СообщенияОтчетностиОблачныхПриложений.ОтборЗапросаДанныхОтчетности()
//
// Возвращаемое значение:
//   ИдентификаторЗапроса - Строка - идентификатор запроса
//
Функция ОбработатьЗапросДанныеОтчетностиВФоне(Параметры) Экспорт
	
	ИдентификаторЗапроса = Новый УникальныйИдентификатор();
	
	// Запускаем фоновую обработку запроса.
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"СообщенияОтчетностиОблачныхПриложений.ОбработатьЗапросДанныеОтчетности",
		ИдентификаторЗапроса,
		Параметры);
	
	Возврат XMLСтрока(ИдентификаторЗапроса);
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ПодключитьНовыеПриложения", Истина);
	Методы.Вставить("ЗапроситьСинхронно", Истина);
	Методы.Вставить("ОбработатьЗапросДанныеОтчетности", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьЗапросДанныеОтчетности(ИдентификаторЗапроса, Параметры) Экспорт
	
	Ответ = СообщенияОтчетностиОблачныхПриложений.ОтветДанныеОтчетности(Параметры);
	РегистрыСведений.ВременноеХранилище.Добавить(ИдентификаторЗапроса, Ответ);
	
КонецПроцедуры

Функция ТипЗапросаДанныеОтчетности() Экспорт
	
	Возврат "ДанныеОтчетности";
	
КонецФункции

Функция ТипЗапросаСписокОрганизаций() Экспорт
	
	Возврат "СписокОрганизаций";
	
КонецФункции

Функция ТипЗапросаЗаписатьСтатусОтчета() Экспорт
	
	Возврат "СтатусОтчета";
	
КонецФункции

Функция ТипЗапросаЗаписатьКомментарийОтчета() Экспорт
	
	Возврат "КомментарийОтчета";
	
КонецФункции

Функция ТипЗапросаПодключитьОблачноеПриложение() Экспорт
	
	Возврат "ПодключитьОблачноеПриложение";
	
КонецФункции

Функция ИмяПрикладногоМеханизма() Экспорт
	
	Возврат "reporting_cycles";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОтборЗапросаДанныхОтчетности()
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИсключитьОрганизации", Новый Массив);
	Отбор.Вставить("ИдентификаторыОтчетов", Новый Массив);
	Отбор.Вставить("ПоОтчетам", Ложь);
	Отбор.Вставить("ПоТребованиямФНС", Ложь);
	Отбор.Вставить("ПоУведомлениямЕНС", Ложь);
	Отбор.Вставить("ПоНалоговымПлатежам", Ложь);
	Отбор.Вставить("ПоДокументамСЭДО", Ложь);
	Отбор.Вставить("ПоЗарплате", Ложь);
	ОтборПериод = Новый Структура("Начало,Конец", '0001-01-01', '0001-01-01');
	Отбор.Вставить("Период", ОтборПериод);
	
	Возврат Отбор;
	
КонецФункции

Функция НовыйОтветДанныеОтчетности()
	
	ТипЗапроса = ТипЗапросаДанныеОтчетности();
	Возврат Новый Структура("ТипЗапроса, Ответ", ТипЗапроса, Неопределено);
	
КонецФункции

Функция НовыйОтветСписокОрганизаций()
	
	ТипЗапроса = ТипЗапросаСписокОрганизаций();
	Возврат Новый Структура("ТипЗапроса, Ответ", ТипЗапроса, Неопределено);
	
КонецФункции

Функция НовыйОтветЗаписиСтатусаОтчета()
	
	Результат = Новый Структура("Записан, Причина, СтатусОтчета", Ложь, "", "");
	ТипЗапроса = ТипЗапросаЗаписатьСтатусОтчета();
	Возврат Новый Структура("ТипЗапроса, Ответ", ТипЗапроса, Результат);
	
КонецФункции

Функция НовыйОтветЗаписиКомментарияОтчета()
	
	Результат = Новый Структура("Записан, Причина", Ложь, "");
	ТипЗапроса = ТипЗапросаЗаписатьКомментарийОтчета();
	Возврат Новый Структура("ТипЗапроса, Ответ", ТипЗапроса, Результат);
	
КонецФункции

Функция НовыйОтветПодключитьОблачноеПриложение()
	
	ТипЗапроса = ТипЗапросаПодключитьОблачноеПриложение();
	Возврат Новый Структура("ТипЗапроса, Ответ", ТипЗапроса, Неопределено);
	
КонецФункции

Функция НовыйПараметрыЗапросаСпискаОрганизаций()
	
	// Режим совместимости.
	// ВыполнитьСинхронно и ИдентификаторПриложения требуется только на время переходного периода.
	Возврат Новый Структура("ТипЗапроса, ВыполнитьСинхронно, ИдентификаторПриложения",
		ТипЗапросаСписокОрганизаций(),
		Истина,
		СообщенияОблачныхПриложений.ИдентификаторЭтогоПриложения());
	
КонецФункции

Функция НовыйПараметрыЗапросаЗаписиСтатусаКомментарияОтчета(ТипЗапроса)
	
	Параметры = Новый Структура;
	Параметры.Вставить("ТипЗапроса", ТипЗапроса);
	Параметры.Вставить("ИдентификаторПриложения", СообщенияОблачныхПриложений.ИдентификаторЭтогоПриложения());
	Параметры.Вставить("ПараметрыОтчета", Новый Структура);
	Параметры.Вставить("ВыполнитьСинхронно", Истина);
	
	СообщенияОтчетностиОблачныхПриложенийПереопределяемый.ПриЗаполненииПараметровЗапросаЗаписиСтатусаКомментария(Параметры);
	
	Возврат Параметры;
КонецФункции

Функция НовыйДанныеПодключенияПриложения()
	
	ДанныеПодключения = Новый Структура;
	ДанныеПодключения.Вставить("ИдентификаторПриложения", "");
	ДанныеПодключения.Вставить("ДоступныеОрганизации", Новый Массив);
	
	Возврат ДанныеПодключения;
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Сообщения отчетности облачных приложений'");
	
КонецФункции

#КонецОбласти