#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Состояние Из Параметры.Состояния Цикл
		Если ТипЗнч(Состояние.Значение) <> Тип("Строка") Тогда
			НовСтр = ТаблицаСостояний.Добавить();
			НовСтр.Состояние = Состояние.Представление;
			НовСтр.СостояниеID = Состояние.Значение.ID;
			НовСтр.СостояниеТип = Состояние.Значение.Тип;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаСостояний Цикл
		Если ТипЗнч(Параметры.ТекущиеДанныеЗначение) = Тип("СписокЗначений") Тогда
			Для Каждого Элемент Из Параметры.ТекущиеДанныеЗначение Цикл
				Если Элемент.Значение.ID = Строка.СостояниеID
						И Элемент.Значение.Тип = Строка.СостояниеТип Тогда
					Строка.Пометка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Параметры.ТекущиеДанныеЗначениеID = Строка.СостояниеID
				И Параметры.ТекущиеДанныеЗначениеТип = Строка.СостояниеТип Тогда
			Строка.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаСостояний

&НаКлиенте
Процедура ТаблицаСостоянийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСостоянийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	// Вернем СписокЗначений.
	СписокВыбораСостояний = Новый СписокЗначений;
	
	Для Каждого Строка Из ТаблицаСостояний Цикл
		Если Строка.Пометка Тогда
			Значение = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеСсылочногоОбъектаДО(
				Строка.СостояниеID,
				Строка.СостояниеТип,
				Строка.Состояние);
			СписокВыбораСостояний.Добавить(Значение, Значение.Наименование);
		КонецЕсли;
	КонецЦикла;
	
	Если СписокВыбораСостояний.Количество() = 1 Тогда
		ОповеститьОВыборе(СписокВыбораСостояний[0].Значение);
	Иначе
		ОповеститьОВыборе(СписокВыбораСостояний); // Если 0 - тоже здесь.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для Каждого Строка Из ТаблицаСостояний Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из ТаблицаСостояний Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти