#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Кандидат = ПараметрКоманды; // СправочникСсылка.Кандидаты
	
	ОбщегоНазначенияКлиентСервер.Проверить(Не Кандидат.Пустая(),
		НСтр("ru = 'Оформление документа возможно только после записи данных.'"));
	
	ДанныеКандидата = ДанныеКандидатаНаСервере(Кандидат);
	
	ОбщегоНазначенияКлиентСервер.Проверить(ЗначениеЗаполнено(ДанныеКандидата.ФизическоеЛицо),
		НСтр("ru = 'Не найдено связанное с кандидатом физическое лицо. Направление на медосмотр невозможно.'"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Кандидат, ФизическоеЛицо",
		Кандидат, ДанныеКандидата.ФизическоеЛицо));
	ОткрытьФорму("Документ.НаправлениеНаМедицинскийОсмотр.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДанныеКандидатаНаСервере(Кандидат)
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеКандидата = Справочники.Кандидаты.ДанныеКандидата(Кандидат);
	
	Возврат ДанныеКандидата;
	
КонецФункции

#КонецОбласти