
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Компания") Тогда
		Компания = Параметры.Компания;
	КонецЕсли;
	
	Если Параметры.Свойство("СфераДеятельностиКомпании") Тогда
		СфераДеятельностиКомпании = Параметры.СфераДеятельностиКомпании;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Ок(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Компания", Компания);
	Результат.Вставить("СфераДеятельностиКомпании", СфераДеятельностиКомпании);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти