#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступныеРеквизиты.Добавить("Документ", НСтр("ru = 'Документ'"), Истина);
	ДоступныеРеквизиты.Добавить("Статус", НСтр("ru = 'Статус'"), Истина);
	ДоступныеРеквизиты.Добавить("ТипДокумента", НСтр("ru = 'Тип документа'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеКолонкиСписковЗадач.Ссылка КАК Ссылка,
	|	ДополнительныеКолонкиСписковЗадач.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ДополнительныеКолонкиСписковЗадач КАК ДополнительныеКолонкиСписковЗадач";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДоступныеРеквизиты.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Документы", Параметры.ВыбранныеДокументы);
	ПараметрыПечати.Вставить("Колонки", ДоступныеРеквизиты);
	
	ПечатнаяФорма = СформироватьРеестрЭлектронныхДокументов(ПараметрыПечати);
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ПечатнаяФорма.ИмяМакета);
	
	ОписаниеПечатнойФормы = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ПечатнаяФорма.ИмяМакета);
	ОписаниеПечатнойФормы.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
	ОписаниеПечатнойФормы.СинонимМакета = ПечатнаяФорма.СинонимМакета;
	
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СформироватьРеестрЭлектронныхДокументов(ПараметрыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_РеестрДокументовПОД";
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	Макет = МодульУправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РеестрДокументовПОД");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ДатаСоставления = Формат(ТекущаяДатаСеанса(), "ДЛФ=DT");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ОбластьШапкаНомер = Макет.ПолучитьОбласть("Шапка|Номер");
	ТабличныйДокумент.Вывести(ОбластьШапкаНомер);
	
	ЕстьКолонкаСтатус = Ложь;
	
	ДополнительныеКолонки = Новый Массив;
	
	ОбластьШапкаКолонка = Макет.ПолучитьОбласть("Шапка|Колонка");
	Для Каждого Колонка Из ПараметрыПечати.Колонки Цикл
		Если Не Колонка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Колонка.Значение) = Тип("СправочникСсылка.ДополнительныеКолонкиСписковЗадач") Тогда
			ДополнительныеКолонки.Добавить(Колонка.Значение);
		ИначеЕсли Колонка.Значение = "Статус" Тогда
			ЕстьКолонкаСтатус = Истина;
		КонецЕсли;
		ОбластьШапкаКолонка.Параметры.ЗаголовокКолонки = Колонка.Представление;
		ТабличныйДокумент.Присоединить(ОбластьШапкаКолонка);
	КонецЦикла;
	
	СвойстваДокументов = Новый Соответствие;
	Для Каждого Документ Из ПараметрыПечати.Документы Цикл
		СвойстваДокументов.Вставить(Документ, Новый Соответствие);
		СвойстваДокументов[Документ].Вставить("Документ", Документ);
		СвойстваДокументов[Документ].Вставить("ТипДокумента", ТипЗнч(Документ));
	КонецЦикла;
	
	СтатусыДокументов = Новый Соответствие;
	
	Если ЕстьКолонкаСтатус Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущиеСтатусыДокументов.Предмет КАК Предмет,
		|	ТекущиеСтатусыДокументов.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.ТекущиеСтатусыДокументов КАК ТекущиеСтатусыДокументов
		|ГДЕ
		|	ТекущиеСтатусыДокументов.Предмет В(&Предметы)";
		Запрос.УстановитьПараметр("Предметы", ПараметрыПечати.Документы);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СвойстваДокументов[Выборка.Предмет].Вставить("Статус", Выборка.Статус);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеКолонки.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗначенияДополнительныхКолонокЗадач.Колонка КАК Колонка,
		|	ЗначенияДополнительныхКолонокЗадач.Предмет КАК Предмет,
		|	ЗначенияДополнительныхКолонокЗадач.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхКолонокЗадач КАК ЗначенияДополнительныхКолонокЗадач
		|ГДЕ
		|	ЗначенияДополнительныхКолонокЗадач.Предмет В(&Предметы)
		|	И ЗначенияДополнительныхКолонокЗадач.Колонка В(&Колонки)";
		Запрос.УстановитьПараметр("Предметы", ПараметрыПечати.Документы);
		Запрос.УстановитьПараметр("Колонки", ДополнительныеКолонки);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СвойстваДокументов[Выборка.Предмет].Вставить(Выборка.Колонка, Выборка.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьСтрокаНомер = Макет.ПолучитьОбласть("Строка|Номер");
	ОбластьСтрокаКолонка = Макет.ПолучитьОбласть("Строка|Колонка");
	
	НомерСтроки = 1;
	
	Для Каждого Документ Из ПараметрыПечати.Документы Цикл
		
		ОбластьСтрокаНомер.Параметры.НомерСтроки = НомерСтроки;
		ТабличныйДокумент.Вывести(ОбластьСтрокаНомер);
		
		ДанныеДокумента = СвойстваДокументов[Документ];
		
		Для Каждого Колонка Из ПараметрыПечати.Колонки Цикл
			Если Не Колонка.Пометка Тогда
				Продолжить;
			КонецЕсли;
			ОбластьСтрокаКолонка.Параметры.ЗначениеКолонки = ДанныеДокумента[Колонка.Значение];
			ТабличныйДокумент.Присоединить(ОбластьСтрокаКолонка);
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	ПечатнаяФорма = Новый Структура;
	ПечатнаяФорма.Вставить("ИмяМакета", "РеестрДокументов");
	ПечатнаяФорма.Вставить("СинонимМакета", НСтр("ru = 'Реестр документов'"));
	ПечатнаяФорма.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	
	Возврат ПечатнаяФорма;
	
КонецФункции

#КонецОбласти
