// @strict-types

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Обработка программных событий, возникающих в подсистемах БСП.
// Только для вызовов из библиотеки БСП в БЭД.

// @skip-check property-return-type
// Определяет события, на которые подписана эта библиотека.
// 
// Параметры:
//  Подписки - см. ИнтеграцияПодсистемБСП.СобытияБСП.
//
Процедура ПриОпределенииПодписокНаСобытияБСП(Подписки) Экспорт

	// ВнешниеКомпоненты
	Подписки.ПриОпределенииИспользуемыхВнешнихКомпонент = Истина;

	Подписки.ПриПериодическомПолученииДанныхКлиентаНаСервере = Истина;

	Подписки.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод = Истина;
	
КонецПроцедуры

// Обработка программных событий, возникающих в подсистемах БТС.
// Только для вызовов из библиотеки БТС в БЭД.

// Определяет события, на которые подписана эта библиотека.
// 
// Параметры:
//  Подписки - см. ИнтеграцияПодсистемБТС.СобытияБТС.
//
Процедура ПриОпределенииПодписокНаСобытияБТС(Подписки) Экспорт

	Подписки.ПриРегистрацииОбработчиковВыгрузкиДанных = Истина;

	Подписки.ПриРегистрацииОбработчиковЗагрузкиДанных = Истина;

	Подписки.ПередЗагрузкойДанных = Истина;

КонецПроцедуры

#Область БазоваяФункциональность

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента.
//
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСКонтрагентами.Подключение1сТакском") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("Подключение1СТакскомБЭД");
		МодульПодсистемы.ПриДобавленииПараметровРаботыКлиента(Параметры);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтеграцияПодсистемБСП.ПриОпределенииИспользуемыхВнешнихКомпонент.
Процедура ПриОпределенииИспользуемыхВнешнихКомпонент(Компоненты) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСБанками") Тогда
		МодульОбменСБанкамиСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбменСБанкамиСлужебный");
		МодульОбменСБанкамиСлужебный.ПриОпределенииИспользуемыхВнешнихКомпонент(Компоненты);
	КонецЕсли;

КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере
Процедура ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСКонтрагентами") Тогда
		МодульПодсистемы = ОбщегоНазначения.ОбщийМодуль("ОбменСКонтрагентамиИнтеграцияСобытия");
		МодульПодсистемы.ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты);
	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияПодсистемБТС.ПередЗагрузкойДанных.
Процедура ПередЗагрузкойДанных(Контейнер) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСБанками") Тогда
		МодульОбменСБанкамиСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбменСБанкамиСлужебный");
		МодульОбменСБанкамиСлужебный.ПередЗагрузкойДанных(Контейнер);
	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияПодсистемБТС.ПриРегистрацииОбработчиковВыгрузкиДанных.
Процедура ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСБанками") Тогда
		МодульОбменСБанкамиСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбменСБанкамиСлужебный");
		МодульОбменСБанкамиСлужебный.ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

КонецПроцедуры

// См. ИнтеграцияПодсистемБТС.ПриРегистрацииОбработчиковЗагрузкиДанных.
Процедура ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСБанками") Тогда
		МодульОбменСБанкамиСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбменСБанкамиСлужебный");
		МодульОбменСБанкамиСлужебный.ПриРегистрацииОбработчиковЗагрузкиДанных(ТаблицаОбработчиков);
	КонецЕсли;

КонецПроцедуры

#Область Подписки

// Определяет события, на которые могут подписаться другие библиотеки.
// 
// Возвращаемое значение:
//  Структура - События БЭД:
//   * БизнесСеть - Структура - События подсистемы БизнесСеть БЭД:
//    ** ПриРегистрацииКонтрагентов              - Булево - Событие получения сведений о новых контрагентах
//                                                          в сервисе 1С:Бизнес-сеть.
//    ** ПриИзмененииИдентификаторовКонтрагентов - Булево - Событие изменения идентификатора контрагентов
//                                                          в сервисе 1С:Бизнес-сеть.
//    ** ПриИзмененииИдентификаторовОрганизаций  - Булево - Событие изменения идентификатора организаций
//                                                          в сервисе 1С:Бизнес-сеть.
Функция СобытияБЭД() Экспорт

	События = Новый Структура;
	
	// БизнесСеть
	СобытияБизнесСеть = Новый Структура;
	СобытияБизнесСеть.Вставить("ПриРегистрацииКонтрагентов", Ложь);
	СобытияБизнесСеть.Вставить("ПриИзмененииИдентификаторовКонтрагентов", Ложь);
	СобытияБизнесСеть.Вставить("ПриИзмененииИдентификаторовОрганизаций", Ложь);
	
	События.Вставить("БизнесСеть", СобытияБизнесСеть);

	Возврат События;

КонецФункции

#КонецОбласти

#Область События

#Область БизнесСеть

// См. БизнесСетьСлужебный.ПриРегистрацииКонтрагентов
Процедура ПриРегистрацииКонтрагентов(Знач Контрагенты) Экспорт
	
	Если ПодпискиБСС().БизнесСеть.ПриРегистрацииКонтрагентов Тогда
		//@skip-check bsl-legacy-check-string-literal - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСС");
		//@skip-check dynamic-access-method-not-found - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС.ПриРегистрацииКонтрагентов(Контрагенты);
	КонецЕсли;
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовКонтрагентов
Процедура ПриИзмененииИдентификаторовКонтрагентов(Знач Контрагенты) Экспорт
	
	Если ПодпискиБСС().БизнесСеть.ПриИзмененииИдентификаторовКонтрагентов Тогда
		//@skip-check bsl-legacy-check-string-literal - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСС");
		//@skip-check dynamic-access-method-not-found - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС.ПриИзмененииИдентификаторовКонтрагентов(Контрагенты);
	КонецЕсли;
	
КонецПроцедуры

// См. БизнесСетьСлужебный.ПриИзмененииИдентификаторовОрганизаций
Процедура ПриИзмененииИдентификаторовОрганизаций(Знач Организации) Экспорт
	
	Если ПодпискиБСС().БизнесСеть.ПриИзмененииИдентификаторовКонтрагентов Тогда
		//@skip-check bsl-legacy-check-string-literal - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБСС");
		//@skip-check dynamic-access-method-not-found - ДемоБЭД не содержит БСС
		МодульИнтеграцияПодсистемБТС.ПриИзмененииИдентификаторовОрганизаций(Организации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Подписки

// См. ИнтеграцияПодсистемБЭДСлужебный.ПодпискиБСС
Функция ПодпискиБСС()
	Возврат ИнтеграцияПодсистемБЭДПовтИсп.ПодпискиБСС();
КонецФункции

#КонецОбласти

// См. ИнтеграцияПодсистемБСП.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод.
Процедура ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСБанками") Тогда
		МодульОбменСБанкамиСлужебный = ОбщегоНазначения.ОбщийМодуль("ОбменСБанкамиСлужебный");
		МодульОбменСБанкамиСлужебный.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки);
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.СервисДоставки") Тогда
		МодульСервисДоставки = ОбщегоНазначения.ОбщийМодуль("СервисДоставки");
		МодульСервисДоставки.ПриНастройкеПроверкиМетодовВызываемыхКакПроизвольныйКод(Настройки);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти