#Область СлужебныйПрограммныйИнтерфейс

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Возврат МодульКонтракта().РеквизитыРедактируемыеВГрупповойОбработке();
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	МодульКонтракта().ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьДополнительныеСведенияКлассификатора(ДолжностьОбъект, ДополнительныеСведения) Экспорт
	
	МодульКонтракта().ЗаполнитьДополнительныеСведенияКлассификатора(ДолжностьОбъект, ДополнительныеСведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(ДолжностьОбъект, ПроверяемыеРеквизиты, Отказ) Экспорт
	
	 МодульКонтракта().ОбработкаПроверкиЗаполнения(ДолжностьОбъект, ПроверяемыеРеквизиты, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(ДолжностьОбъект, Отказ) Экспорт
	
	МодульКонтракта().ПередЗаписью(ДолжностьОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ПереопределяемыеМетодыКонтракта

Функция МодульКонтракта()
	
	Если ЗарплатаКадры.БазовыйРежим() Тогда
		Возврат ОбщегоНазначения.ОбщийМодуль("ДолжностиБЗКБазовый");
	Иначе
		Возврат ОбщегоНазначения.ОбщийМодуль("ДолжностиБЗКРасширенный");
	КонецЕсли;
	
КонецФункции

#КонецОбласти
