////////////////////////////////////////////////////////////////////////////////
// Отражение расходов на персонал.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура предназначена для формирования движений по расходам на персонал.
//
// Параметры:
//  Движения			 - КоллекцияДвижений - коллекция движений документа,
//  Отказ				 - Булево			 - признак отказа от проведения документа,
//  ПериодРегистрации	 - Дата				 - месяц, зарплата которого отражается в учете,
//  ДанныеДляОтражения	 - Структура		 - Таблицы значений с данными, которые
//  		могут использоваться для формирования движений по финансовому учету.
//  		При вызове процедуры ДанныеДляОтражения может содержать
//  		одно или несколько полей с приведенными ниже именами, т.е.
//  		Необходимо проверять наличие того или иного элемента структуры.
//  Подразделение		 - СправочникСсылка.СтруктураПредприятия.
//
Процедура ЗарегистрироватьРасходыНаПерсонал(Движения, Отказ, ПериодРегистрации, ДанныеДляОтражения, Подразделение) Экспорт
	
КонецПроцедуры

// Определяет возможность выполнения операции отражения расходов на персонал,
//  осуществляемой документом «Отражение расходов на персонал»,
//  одним экземпляром документа по всем подразделениям.
//
// Параметры:
//  Доступность	 - Булево	 - Истина, если операция одним документом по всем подразделениям доступна, Ложь - в противном случае.
//
Процедура ЗаполнитьДоступностьОтраженияРасходовНаПерсоналОднимДокументомПоВсемПодразделениям(Доступность) Экспорт
	
КонецПроцедуры

#КонецОбласти
