///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП".
// ОбщийМодуль.ИнтернетПоддержкаПользователейСервис.
//
// Серверные процедуры переводов аутентификации Интернет-поддержки пользователей:
//  - получение и отзыв мастер токена;
//  - запрос тикета и токенов аутентификации;
//  - проверка логина и пароля Интернет-поддержки пользователей.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ВызовОперацииПолученияМастерТокена

////////////////////////////////////////////////////////////////////////////////
// Вызов операции POST /rest/public/program-1c/isl/auth-tokens/master/generate

// Выполняет создание нового мастер токена.
//
// Параметры:
//  Логин - Строка - логин пользователя на Портале 1С:ИТС.
//  Пароль - Строка - пароль пользователя на Портале 1С:ИТС.
//  Тикет - Строка - тикет полученный на Портале 1С:ИТС.
//  ИдентификаторКлиента - Строка - текущий идентификатор клиента.
//  Сценарий - Строка - сценарий выполнения запроса.
//  Капча - Строка, Неопределено - капча, которую должен ввести пользователь в случае
//    блокировки частого получения мастер токена.
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * МастерТокен - Строка - созданный мастер токен;
//    * КапчаBase64 - Строка - картинка капчи в формате base64.
//       Картинка капчи может быть возвращена в случае получения ошибки
//       "ПревышеноКоличествоПопыток".
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ОшибкаАутентификации" - неверный логин или пароль или параметры
//          подключения к участнику СБП;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция ОперацияМастерТокен(
		Логин,
		Пароль,
		Тикет,
		ИдентификаторКлиента,
		Сценарий,
		Капча = Неопределено) Экспорт
	
	Результат = ИнтернетПоддержкаПользователейКлиентСервер.НовыйРезультатПодключения();
	Результат.Вставить("ОбновитьИдентификатор", Ложь);
	Результат.Вставить("МастерТокен", Неопределено);
	
	Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации(Сценарий);
	URLОперации = URLОперацииСервиса("/program-1c/isl/auth-tokens/master/generate");
	
	ТелоЗапроса = master_generate(
			Логин,
			Пароль,
			Тикет,
			ИдентификаторКлиента,
			Капча);
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		ТелоЗапроса,
		Заголовки);
	
	РезультатОтправки = HTTP.POST(
		URLОперации,
		ПараметрыЗапроса);
	
	Если Не ПустаяСтрока(РезультатОтправки.КодОшибки) Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(
			РезультатОтправки.КодСостояния);
		Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
			Результат.КодОшибки,
			РезультатОтправки.КодСостояния);
		
		Если Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиПревышеноКоличествоПопыток()
			Или Результат.КодОшибки = КодОшибкиКонфликт()Тогда
			
			ДанныеОтвета = ПрочитатьДанные_master_generate(
				РезультатОтправки.Содержимое);
			Если ДанныеОтвета.type = "TOKEN_GENERATION_BLOCKED" Тогда
				Результат.КапчаBase64 = ДанныеОтвета.data.captchaChallengeImage;
			ИначеЕсли ДанныеОтвета.type = "TOKEN_ALREADY_EXISTS" Тогда
				Результат.ОбновитьИдентификатор = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать мастер токен.
				|
				|%1
				|
				|%2'"),
			Результат.СообщениеОбОшибке,
			ТехническаяИнформацияОбОшибке(
				URLОперации,
				РезультатОтправки.КодОшибки,
				Заголовки,
				РезультатОтправки.ИнформацияОбОшибке));
		
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияОбОшибке,
			Неопределено,
			Истина);
		
		Возврат Результат;
		
	КонецЕсли;
	
	ДанныеОтвета = ПрочитатьДанные_master_generate(
		РезультатОтправки.Содержимое);
	Результат.МастерТокен = ДанныеОтвета.tokenValue;
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры запроса для операции
// /rest/public/program-1c/isl/auth-tokens/master/generate.
//
Функция master_generate(
		Логин,
		Пароль,
		Тикет,
		ИдентификаторКлиента,
		Капча)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("login");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Логин);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("password");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Пароль);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("ticket");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Тикет);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("infoBaseId");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("clientId");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ИдентификаторКлиента);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("clientTitle");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ИнтернетПоддержкаПользователей.ЗаголовокКлиентскогоПриложения());
	
	Если ЗначениеЗаполнено(Капча) Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("captchaResponse");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Капча);
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();

КонецФункции

// Чтение ответа операции /rest/public/program-1c/isl/auth-tokens/master/generate.
//
Функция ПрочитатьДанные_master_generate(ТелоJSON)
	
	// Ответ сервиса:
	//  tokenValue - созданные мастер токен;
	// 
	//  {
	//    "tokenValue": "string"
	//  }
	
	ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Получен мастер токен'"),
		Неопределено,
		Ложь);
	
	ЧтениеОтвета = Новый ЧтениеJSON;
	ЧтениеОтвета.УстановитьСтроку(ТелоJSON);
	Результат = ПрочитатьJSON(ЧтениеОтвета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВызовОперацииОтзываМастерТокена

////////////////////////////////////////////////////////////////////////////////
// Вызов операции POST /rest/public/program-1c/isl/auth-tokens/master/revoke

// Выполняет отзыв существующего мастер токена.
//
// Параметры:
//  МастерТокен - Строка - мастер токен пользователя на Портале 1С:ИТС.
//  Сценарий - Строка - сценарий выполнения запроса.
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция ОперацияОтозватьМастерТокен(
		МастерТокен,
		Сценарий) Экспорт
	
	Результат = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке",
		"",
		"",
		"");
	
	Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации(Сценарий);
	URLОперации = URLОперацииСервиса("/program-1c/isl/auth-tokens/master/revoke");
	
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		master_revoke(
			МастерТокен),
		Заголовки);
	
	РезультатОтправки = HTTP.POST(
		URLОперации,
		ПараметрыЗапроса);
	
	Если Не ПустаяСтрока(РезультатОтправки.КодОшибки) Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(
			РезультатОтправки.КодСостояния);
		Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
			Результат.КодОшибки,
			РезультатОтправки.КодСостояния);
		
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось отозвать мастер токен.
				|
				|%1
				|
				|%2'"),
			Результат.СообщениеОбОшибке,
			ТехническаяИнформацияОбОшибке(
				URLОперации,
				РезультатОтправки.КодОшибки,
				Заголовки,
				РезультатОтправки.ИнформацияОбОшибке));
		
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияОбОшибке,
			Неопределено,
			Истина);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры запроса для операции
// /rest/public/program-1c/isl/auth-tokens/master/revoke.
//
Функция master_revoke(МастерТокен)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("masterTokenValue");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(МастерТокен);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();

КонецФункции

#КонецОбласти

#Область ВызовОперацииПолученияТокенаАутентификации

////////////////////////////////////////////////////////////////////////////////
// Вызов операции POST /rest/public/program-1c/isl/auth-tokens/services/{serviceNick}/generate

// Выполняет создание нового токена сервиса.
//
// Параметры:
//  МастерТокен - Строка - мастер токен пользователя на Портале 1С:ИТС.
//  ИдентификаторСервиса - Строка - идентификатор сервиса на Портале 1С:ИТС.
//  Сценарий - Строка - сценарий выполнения запроса.
//  Бессрочный - Булево - признак получения бессрочного токена.
//  ДополнительныеПараметры - Соответствие - описывает дополнительные параметры:
//    * Ключ - Строка - имя дополнительного свойства
//    * Значение - Строка, Число, Неопределено, Массив - значение дополнительного свойства
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * Токен - Строка - созданный токен сервиса.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ОшибкаАутентификации" - неверный логин или пароль или параметры
//          подключения к участнику СБП;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция ОперацияТокенАутентификации(
		МастерТокен,
		ИдентификаторСервиса,
		Сценарий,
		Бессрочный,
		ДополнительныеПараметры) Экспорт
	
	Результат = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке,
		|Токен,
		|ШтампИстечения,
		|Бессрочный",
		"",
		"",
		"",
		Неопределено,
		Ложь);
	
	Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации(
		Сценарий);
	URLОперации = URLОперацииСервиса(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"/program-1c/isl/auth-tokens/services/%1/generate",
			ИдентификаторСервиса));
	
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		services_generate(
			МастерТокен,
			Бессрочный,
			ДополнительныеПараметры),
		Заголовки);
	
	РезультатОтправки = HTTP.POST(
		URLОперации,
		ПараметрыЗапроса);
	
	Если Не ПустаяСтрока(РезультатОтправки.КодОшибки) Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(
			РезультатОтправки.КодСостояния);
		Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
			Результат.КодОшибки,
			РезультатОтправки.КодСостояния);
		
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать токен сервиса.
				|
				|%1
				|
				|%2'"),
			Результат.СообщениеОбОшибке,
			ТехническаяИнформацияОбОшибке(
				URLОперации,
				РезультатОтправки.КодОшибки,
				Заголовки,
				РезультатОтправки.ИнформацияОбОшибке));
		
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияОбОшибке,
			Неопределено,
			Истина);
		
		Возврат Результат;
		
	КонецЕсли;
	
	ДанныеОтвета = ПрочитатьДанные_services_generate(
		РезультатОтправки.Содержимое);
	
	Результат.Токен = ДанныеОтвета.tokenValue;
	Результат.Бессрочный = Бессрочный;
	
	Если Не Бессрочный Тогда
		Результат.ШтампИстечения = УниверсальноеВремя(ДанныеОтвета.expirationTimestamp);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры запроса для операции
// /rest/public/program-1c/isl/auth-tokens/services/{serviceNick}/generate.
//
Функция services_generate(
	МастерТокен,
	Бессрочный,
	ДополнительныеПараметры)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("masterTokenValue");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(МастерТокен);
	
	Если Бессрочный Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("perpetual");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры) Тогда
		
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("additionalData");
		ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
		
		Для Каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
			ЗаписьДанныхСообщения.ЗаписатьИмяСвойства(ДополнительныйПараметр.Ключ);
			ЗаписьДанныхСообщения.ЗаписатьЗначение(ДополнительныйПараметр.Значение);
		КонецЦикла;
		
		ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
		
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

// Чтение ответа операции /rest/public/program-1c/isl/auth-tokens/services/{serviceNick}/generate.
//
Функция ПрочитатьДанные_services_generate(ТелоJSON)
	
	// Ответ сервиса:
	//  tokenValue - созданный токен сервиса;
	// 
	//  {
	//    "tokenValue": "string"
	//  }
	
	ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Получен мастер токен'"),
		Неопределено,
		Ложь);
	
	ЧтениеОтвета = Новый ЧтениеJSON;
	ЧтениеОтвета.УстановитьСтроку(ТелоJSON);
	Результат = ПрочитатьJSON(ЧтениеОтвета, , "expirationTimestamp");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВызовОперацииПолученияТокенаИнтегрированногоСайта

////////////////////////////////////////////////////////////////////////////////
// Вызов операции POST /rest/public/program-1c/isl/auth-tokens/integrated-sites/generate

// Выполняет создание нового токена для перехода на интегрированный сайт.
//
// Параметры:
//  МастерТокен - Строка, Неопределено - мастер токен пользователя на Портале 1С:ИТС.
//  Тикет - Строка, Неопределено - тикет аутентификации на Портале 1С:ИТС.
//  URL - Строка - URL интегрированного сайта.
//
// Возвращаемое значение:
//  Структура - результат создания мастер токена:
//    * Токен - Строка - созданный токен сервиса.
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - создание нового заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "ОшибкаАутентификации" - неверный логин или пароль или параметры
//          подключения к участнику СБП;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//        - "НеизвестнаяОшибка" - при получении информации возникла
//          неизвестная (не обрабатываемая) ошибка;
//        - "СервисВременноНеДоступен" - на сервере ведутся регламентные работы;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//
Функция ОперацияТокенИнтегрированногоСайта(
		МастерТокен,
		Тикет,
		URL) Экспорт
	
	Результат = Новый Структура("
		|КодОшибки,
		|СообщениеОбОшибке,
		|Токен",
		"",
		"",
		"");
	
	Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации();
	URLОперации = URLОперацииСервиса(
		"/program-1c/isl/auth-tokens/integrated-sites/generate");
	
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		integrated_sites_generate(
			МастерТокен,
			Тикет,
			URL),
		Заголовки);
	
	РезультатОтправки = HTTP.POST(
		URLОперации,
		ПараметрыЗапроса);
	
	Если Не ПустаяСтрока(РезультатОтправки.КодОшибки) Тогда
		
		Результат.КодОшибки = ПереопределитьКодОшибкиСервиса(
			РезультатОтправки.КодСостояния);
		Результат.СообщениеОбОшибке = ПереопределитьСообщениеПользователю(
			Результат.КодОшибки,
			РезультатОтправки.КодСостояния);
		
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось создать токен для перехода на интегрированный сайт.
				|
				|%1
				|
				|%2'"),
			Результат.СообщениеОбОшибке,
			ТехническаяИнформацияОбОшибке(
				URLОперации,
				РезультатОтправки.КодОшибки,
				Заголовки,
				РезультатОтправки.ИнформацияОбОшибке));
		
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияОбОшибке,
			Неопределено,
			Истина);
		
		Возврат Результат;
		
	КонецЕсли;
	
	ДанныеОтвета = ПрочитатьДанные_integrated_sites_generate(
		РезультатОтправки.Содержимое);
	Результат.Токен = КодироватьСтроку(
		ДанныеОтвета.tokenValue,
		СпособКодированияСтроки.КодировкаURL);
	
	Возврат Результат;
	
КонецФункции

// Формирует параметры запроса для операции
// /rest/public/program-1c/isl/auth-tokens/integrated-sites/generate.
//
Функция integrated_sites_generate(
		МастерТокен,
		Тикет,
		URL)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("masterTokenValue");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(МастерТокен);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("ticket");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Тикет);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("targetSitePageUrl");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(URL);
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

// Чтение ответа операции/rest/public/program-1c/isl/auth-tokens/integrated-sites/generate.
//
Функция ПрочитатьДанные_integrated_sites_generate(ТелоJSON)
	
	// Ответ сервиса:
	//  tokenValue - созданный токен сервиса;
	// 
	//  {
	//    "tokenValue": "string"
	//  }
	
	ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
		НСтр("ru = 'Получен мастер токен'"),
		Неопределено,
		Ложь);
	
	ЧтениеОтвета = Новый ЧтениеJSON;
	ЧтениеОтвета.УстановитьСтроку(ТелоJSON);
	Результат = ПрочитатьJSON(ЧтениеОтвета);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВызовОперацииПолученияТикетаАутентификации

////////////////////////////////////////////////////////////////////////////////
// Вызов операции POST /rest/public/ticket/get

// Внутренняя функция для получения тикетов аутентификации.
//
// Параметры:
//  ВладелецТикета - Строка - произвольное имя сервиса, для которого
//      выполняется аутентификация пользователя. Это же имя должно
//      использоваться при вызове операции https://login.1c.ru/rest/private/ticket/check;
//      Не допускается незаполненное значение параметра.
//  Аутентификация - Структура - описание параметров аутентификации:
//    * Логин - Строка - логин Интернет-поддержки.
//    * Пароль - Строка - пароль Интернет-поддержки.
//    * МастерТокен - Строка - полученные мастер токен.
//
// Возвращаемое значение:
//  Структура - результат получения тикета. Поля структуры:
//        * Тикет - Строка - полученный тикет аутентификации. Если при получении
//          тикета произошла ошибка (неверный логин или пароль или другая ошибка),
//          значение поля - пустая строка.
//        * КодОшибки - Строка - строковый код возникшей ошибки, который
//          может быть обработан вызывающим функционалом:
//              - <Пустая строка> - получение тикета выполнено успешно;
//              - "НеверныйЛогинИлиПароль" - неверный логин или пароль;
//              - "ПревышеноКоличествоПопыток" - превышено количество попыток
//                 получения тикета с некорректным логином и паролем;
//              - "ОшибкаПодключения" - ошибка при подключении к сервису;
//              - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//              - "НеизвестнаяОшибка" - при получении тикета возникла
//                 неизвестная (не обрабатываемая) ошибка;
//        * СообщениеОбОшибке - Строка - краткое описание ошибки, которое
//          может быть отображено пользователю;
//        * ИнформацияОбОшибке - Строка - подробное описание ошибки, которое
//          может быть записано в журнал регистрации.
//
Функция ОперацияТикетАутентификации(
		Знач ВладелецТикета,
		Аутентификация) Экспорт
	
	Результат = ИнтернетПоддержкаПользователей.НовыйРезультатПолученияТикета();
	URLСервиса = URLОперацииСервиса("/ticket/get");
	Заголовки = ИнтернетПоддержкаПользователей.НовыйЗаголовкиВызоваОперации();
	
	ПараметрыЗапроса = HTTP.НовыйПараметрыЗапроса(
		ticket_get(
			Аутентификация.Логин,
			Аутентификация.Пароль,
			Аутентификация.МастерТокен,
			ВладелецТикета),
		Заголовки);
	
	РезультатОперации = HTTP.POST(
		URLСервиса,
		ПараметрыЗапроса);
	
	// Обработка ответа выполняется не стандартным способом для соблюдения
	// обратной совместимости.
	Если РезультатОперации.КодСостояния = 200 Тогда
		
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(РезультатОперации.Содержимое);
			ОтветОбъект = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Результат.Тикет = ОтветОбъект.ticket;
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Результат.КодОшибки = "ОшибкаСервиса";
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось получить тикет аутентификации в сервисе %1.
					|Некорректный ответ сервиса.
					|Ошибка при обработке ответа сервиса:
					|%2
					|Код состояния: %3;
					|Тело ответа: %4'"),
				URLСервиса,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
				РезультатОперации.КодСостояния,
				Лев(РезультатОперации.Содержимое, 5120));
			ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
				Результат.ИнформацияОбОшибке);
			Результат.СообщениеОбОшибке =
				НСтр("ru = 'Ошибка аутентификации в сервисе.
					|Подробнее см. в журнале регистрации.'");
			
		КонецПопытки;
		
	ИначеЕсли РезультатОперации.КодСостояния = 403 Тогда
		
		Результат.КодОшибки = "НеверныйЛогинИлиПароль"; // Обратная совместимость.
		Результат.СообщениеОбОшибке  = НСтр("ru = 'Неверный логин или пароль.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
	ИначеЕсли РезультатОперации.КодСостояния = 429 Тогда
		
		Результат.КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиПревышеноКоличествоПопыток();
		Результат.СообщениеОбОшибке = НСтр("ru = 'Превышено количество попыток аутентификации.
			|Повторите попытку позже.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
	ИначеЕсли РезультатОперации.КодСостояния = 500 Тогда
		
		Результат.КодОшибки = "ОшибкаСервиса";
		Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить тикет аутентификации в сервисе %1.
				|Внутренняя ошибка сервиса.
				|Код состояния: %2;
				|Тело ответа: %3'"),
			URLСервиса,
			РезультатОперации.КодСостояния,
			Лев(РезультатОперации.Содержимое, 5120));
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			Результат.ИнформацияОбОшибке);
		
		Результат.СообщениеОбОшибке =
			НСтр("ru = 'Ошибка аутентификации. Внутренняя ошибка сервиса.
				|Подробнее см. в журнале регистрации.'");
		
	ИначеЕсли РезультатОперации.КодСостояния = 0 Тогда
		
		Результат.КодОшибки = КодОшибкиОшибкаПодключения();
		Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить тикет аутентификации в сервисе %1.
				|%2'"),
			URLСервиса,
			РезультатОперации.ИнформацияОбОшибке);
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			Результат.ИнформацияОбОшибке);
		Результат.СообщениеОбОшибке = НСтр("ru = 'Ошибка подключения к сервису.
			|Подробнее см. в журнале регистрации.'");
		
	ИначеЕсли РезультатОперации.КодСостояния < 0 Тогда
		
		Результат.КодОшибки = КодОшибкиОшибкаПодключения();
		Результат.ИнформацияОбОшибке = РезультатОперации.ИнформацияОбОшибке;
		Результат.СообщениеОбОшибке = РезультатОперации.СообщениеОбОшибке;
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			Результат.ИнформацияОбОшибке);
		
	Иначе
		
		Результат.КодОшибки = КодОшибкиНеизвестнаяОшибка();
		Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось получить тикет аутентификации в сервисе %1.
				|Неизвестный код состояния ответа сервиса.
				|Код состояния: %2;
				|Тело ответа: %3'"),
			URLСервиса,
			РезультатОперации.КодСостояния,
			Лев(РезультатОперации.Содержимое, 5120));
		ИнтернетПоддержкаПользователей.ЗаписатьИнформациюВЖурналРегистрации(
			Результат.ИнформацияОбОшибке);
		Результат.СообщениеОбОшибке =
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка аутентификации в сервисе (%1).
					|Подробнее см. в журнале регистрации.'"),
				РезультатОперации.КодСостояния);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует тело запроса на получение тикета аутентификации.
//
// Параметры:
//  Логин - Строка - логин пользователя Интернет-поддержки;
//  Пароль - Строка - пароль пользователя Интернет-поддержки.
//  ВладелецТикета - Строка - произвольное имя сервиса, для которого
//      выполняется аутентификация пользователя. Это же имя должно
//      использоваться при вызове операции https://login.1c.ru/rest/private/ticket/check;
//      Не допускается незаполненное значение параметра.
//  МастерТокен - Строка - мастер токен аутентифицирующий пользователя.
//
// Возвращаемое значение:
//  Строка - тело запроса
//
Функция ticket_get(Логин, Пароль, МастерТокен, ВладелецТикета)
	
	ЗаписьДанныхСообщения = Новый ЗаписьJSON;
	ЗаписьДанныхСообщения.УстановитьСтроку();
	ЗаписьДанныхСообщения.ЗаписатьНачалоОбъекта();
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("login");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Логин);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("password");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(Пароль);
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("serviceNick");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ВладелецТикета);
	
	Если ЗначениеЗаполнено(МастерТокен) Тогда
		ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("islMasterToken");
		ЗаписьДанныхСообщения.ЗаписатьЗначение(МастерТокен);
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьКонецОбъекта();
	
	Возврат ЗаписьДанныхСообщения.Закрыть();
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыФункции

// Определяет URL для вызова сервиса Системы быстрых платежей.
//
// Параметры:
//  Операция - Строка - путь к ресурсу;
//  ИдентификаторURL - Строка - идентификатор сценария в URL.
//
// Возвращаемое значение:
//  Строка - URL операции.
//
Функция URLОперацииСервиса(Операция)
	
	Возврат "https://"
		+ ИнтернетПоддержкаПользователейКлиентСервер.ХостСервисаLogin(
			ИнтернетПоддержкаПользователей.ДоменРасположенияСерверовИПП())
		+ "/rest/public"
		+ Операция;
	
КонецФункции

// Формирует представление технической информации об ошибке.
//
// Параметры:
//  URLОперации - Строка - URL метода сервиса;
//  КодОшибки - Строка - код ошибки сервиса;
//  Заголовки - Соответствие Из КлючИЗначение - заголовки запроса;
//  ИнформацияОбОшибке - Строка - подробная информация об ошибке.
//
// Возвращаемое значение:
//  Строка - техническая информация об ошибке.
//
Функция ТехническаяИнформацияОбОшибке(
		URLОперации,
		КодОшибки,
		Заголовки,
		ИнформацияОбОшибке) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Техническая информация об ошибке:
				|URL: %1
				|Код ошибки: %2
				|X-Correlation-ID: %3
				|Подробная информация:
				|%4'"),
			URLОперации,
			КодОшибки,
			Заголовки.Получить("X-Correlation-ID"),
			ИнформацияОбОшибке);
	
КонецФункции

#КонецОбласти

#Область ОбработкаОшибок

// Возвращает код ошибки "ОшибкаПодключения".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОшибкаПодключения()
	
	Возврат "ОшибкаПодключения";
	
КонецФункции

// Возвращает код ошибки "НеизвестнаяОшибка".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеизвестнаяОшибка()
	
	Возврат "НеизвестнаяОшибка";
	
КонецФункции

// Возвращает код ошибки "НеверныйФорматЗапроса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиНеверныйФорматЗапроса()
	
	Возврат "НеверныйФорматЗапроса";
	
КонецФункции

// Возвращает код ошибки "ОшибкаСервиса".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОшибкаСервиса()
	
	Возврат "ОшибкаСервиса";
	
КонецФункции

// Возвращает код ошибки "СервисВременноНеДоступен".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиСервисВременноНеДоступен()
	
	Возврат "СервисВременноНеДоступен";
	
КонецФункции

// Возвращает код ошибки "БлокировкаСервисовИПП".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиБлокировкаСервисовИПП()
	
	Возврат "БлокировкаСервисовИПП";
	
КонецФункции

// Возвращает код ошибки "ОтсутствуетДоступКСервису".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиОтсутствуетДоступКСервису()
	
	Возврат "ОтсутствуетДоступКСервису";
	
КонецФункции

// Возвращает код ошибки "Конфликт".
//
// Возвращаемое значение:
//  Строка - код ошибки.
//
Функция КодОшибкиКонфликт()
	
	Возврат "Конфликт";
	
КонецФункции

// Определяет по коду состояния и коду ошибки сервиса тип ошибки для потребителей.
//
// Параметры:
//  КодСостояния - Число - код состояния ответа сервиса;
//
// Возвращаемое значение:
//  Строка - код ошибки сервиса.
//
Функция ПереопределитьКодОшибкиСервиса(КодСостояния)
	
	Если КодСостояния = 200 Тогда
		Возврат "";
	ИначеЕсли КодСостояния = 400
		Или КодСостояния = 404
		Или КодСостояния = 422 Тогда
		Возврат КодОшибкиНеверныйФорматЗапроса();
	ИначеЕсли КодСостояния = 401 Тогда
		Возврат ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации();
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат КодОшибкиОтсутствуетДоступКСервису();
	ИначеЕсли КодСостояния = 409 Тогда
		Возврат КодОшибкиКонфликт();
	ИначеЕсли КодСостояния = 429 Тогда
		Возврат ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиПревышеноКоличествоПопыток();
	ИначеЕсли КодСостояния = 503 Тогда
		Возврат КодОшибкиСервисВременноНеДоступен();
	ИначеЕсли КодСостояния >= 500 Тогда
		Возврат КодОшибкиОшибкаСервиса();
	ИначеЕсли КодСостояния = 0 Тогда
		Возврат КодОшибкиОшибкаПодключения();
	ИначеЕсли КодСостояния = -1
		Или КодСостояния = -2 Тогда
		Возврат КодОшибкиБлокировкаСервисовИПП();
	Иначе
		Возврат КодОшибкиНеизвестнаяОшибка();
	КонецЕсли;
	
КонецФункции

// Определяет по коду ошибки сообщение пользователю.
//
// Параметры:
//  КодОшибки - Строка - ошибка сервиса см. функцию ПереопределитьКодОшибкиСервиса.
//  КодСостояния - Число - код ответа сервиса.
//
// Возвращаемое значение:
//  Строка - сообщение пользователю.
//
Функция ПереопределитьСообщениеПользователю(
		КодОшибки,
		КодСостояния = 0) Экспорт
	
	Если КодСостояния = -1 Тогда
		Возврат ОбщегоНазначения.ЗапрещенДоступКИнтернетСервисамТекстСообщения();
	ИначеЕсли КодСостояния = -2 Тогда
		Возврат ИнтернетПоддержкаПользователей.ЗапрещенДоступКИнтернетПоддержкеТекст();
	КонецЕсли;
	
	Если КодОшибки = КодОшибкиНеверныйФорматЗапроса() Тогда
		Возврат НСтр("ru = 'Неверный набор параметров или формат запроса. Обратитесь к администратору.'");
	КонецЕсли;
	
	Если КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиАутентификации()
		Или КодОшибки = КодОшибкиОтсутствуетДоступКСервису() Тогда
			Возврат НСтр("ru = 'Ошибка аутентификации. Проверьте правильность ввода параметров аутентификации.'");
	КонецЕсли;
	
	Если КодОшибки = ИнтернетПоддержкаПользователейКлиентСервер.КодОшибкиПревышеноКоличествоПопыток() Тогда
		Возврат НСтр("ru = 'Превышено количество попыток аутентификации. Повторите попытку позже.'");
	КонецЕсли;
	
	Если КодОшибки = КодОшибкиСервисВременноНеДоступен() Тогда
		Возврат НСтр("ru = 'Не удалось подключиться к сервису Портала 1С:ИТС. Сервис временно недоступен.
			|Повторите попытку подключения позже.'");
	КонецЕсли;
	
	Если КодОшибки = КодОшибкиОшибкаСервиса() Тогда
		Возврат НСтр("ru = 'Ошибка работы с сервисом. Повторите попытку подключения позже.'");
	ИначеЕсли КодОшибки = "ОшибкаПодключения" Тогда
		Возврат НСтр("ru = 'Не удалось подключиться к Порталу 1С:ИТС. Обратитесь к администратору.'");
	Иначе
		Возврат НСтр("ru = 'Неизвестная ошибка при подключении к сервису.'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти
