
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеИнтервью") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.АнкетаЭлектронногоИнтервью"));
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеТестированиеКандидатов") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СпособыОценкиХарактеристик.ЭлектронныйТест"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли