
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект", Объект);
	Параметры.Свойство("ЭтапРаботы", ЭтапРаботы);
	
	УстановитьОтборыДинамическогоСписка();
	
	ТекстОбъект = "";
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Вакансии") Тогда
		ТекстОбъект = НСтр("ru = 'вакансии'");
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПрофилиДолжностей") Тогда
		ТекстОбъект = НСтр("ru = 'профиля должности'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		Заголовок = СтрШаблон(НСтр("ru = 'Выбор теста для %1 %2 на этапе %3'"), ТекстОбъект, Объект, ЭтапРаботы);
	Иначе
		Заголовок = СтрШаблон(НСтр("ru = 'Выбор теста для %1 на этапе %2'"), ТекстОбъект, ЭтапРаботы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбратьИЗакрыть();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьИЗакрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборыДинамическогоСписка()

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список,
		"ВладелецЭлектронногоКурса",
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.ЭтапыРаботыСКандидатами")),
		Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураВыбора = Новый Структура;
		СтруктураВыбора.Вставить("ИнструментОценки", ТекущиеДанные.Ссылка);
		Закрыть(СтруктураВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
