
#Область ОписаниеПеременных

&НаКлиенте
Перем ИдентификаторДокументаПрежнееЗначение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументов.ЗаполнитьСписокДоступныхИдентификаторов(СписокДоступныхИдентификаторов);
	
	Элементы.ИдентификаторДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", СписокДоступныхИдентификаторов)));
	
	ГиперссылкиЭлементовСхемы = Новый Структура;
	
	ЗаполнитьСписокПодключаемыхОбработчиков();
	
	ЗаполнитьСписокИнициирующихСобытий();
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ОбновитьВычисляемыеПоля();
	КонецЕсли;
	
	УстановитьРежимРедактированияСхемы(Элементы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЭтапыФлажокПодписыватьФайлыЭП",
		"Видимость",
		Константы.ПодписыватьПрисоединенныеФайлы.Получить()
		И Константы.ПодписьФайловНастраиваетсяВШаблоне.Получить());
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ЭтапыФлажокОбменСЛичнымКабинетом",
		"Видимость",
		Константы.ИспользоватьОбменСЛичнымКабинетомПОД.Получить());
		
	ФормированиеФормуляровВключено = ПроцессыОбработкиДокументов.ВключенаПоддержкаФормированияИПодписанияФормуляров();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаЭДОСКонтрагентами",
		"Видимость",
		ПроцессыОбработкиДокументов.ПоддерживаетсяИнтеграцияСБЭД() И ФормированиеФормуляровВключено);
		
	ПроцессыОбработкиДокументовПереопределяемый.ПриСозданииНаСервереФормыШаблонаПроцесса(ЭтотОбъект, Отказ);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьСписокРеквизитовДляРасчетаСроковОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИдентификаторПоддержкиСтрокой = Объект.ИдентификаторПоддержки;
	
	ОбновитьВычисляемыеПоля();
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриЧтенииНаСервереФормыШаблонаПроцесса(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьЭтапаПроцесса" Тогда
		
		ЗаполнитьРеквизитыЭтапов(Объект.Этапы, СтатусыЭтапов);
		
		ЗаполнитьПризнакиОтстутвующихСтатусов(Объект, СтатусыЭтапов);
		
		ВычислитьНомераКартинок(Объект.Этапы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСписокПоключаемыхКлиентскихОбработчиков();
	
	ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
	ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
	
	ИдентификаторДокументаПрежнееЗначение = Объект.ИдентификаторДокумента;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Для шаблона процесса не выбран тип документа. Запись шаблона невозможна.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеОшибочноДоступныхРеквизитов(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеЗапущенныхПроцессовИУдаленныхЭтапов(Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой)
		И ИдентификаторПоддержкиСтрокой <> Строка(ТекущийОбъект.ИдентификаторПоддержки) Тогда
		ТекущийОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
	КонецЕсли;  

	Если Константы.ИспользоватьРеквизитыДокументовДляРасчетаСроковОбработки.Получить()
		И ТекущийОбъект.ИспользоватьРеквизитДляРасчетаСроковОбработки 
		И НЕ ЗначениеЗаполнено(ТекущийОбъект.РеквизитДляРасчетаСроковОбработки) Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить реквизит документа для расчета сроков обработки,
								|относительно которого будет рассчитываться предельный срок выполнения'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,"Объект.РеквизитДляРасчетаСроковОбработки");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ВычислитьОписаниеПредшественников(Объект);
	ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне);
	ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
	ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
	ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект);
	ВычислитьНомераКартинок(Объект.Этапы);
	
	Оповестить("Запись_ШаблонПроцесса");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьВычисляемыеПоляЭтапов(Объект.Этапы, Объект.ИсполнителиГрупповыхЭтапов);
	ЗаполнитьОписаниеУсловий();
	ЗаполнитьРеквизитТребуетсяПроведение(Объект);
	ЗаполнитьРеквизитыЭтапов(Объект.Этапы, СтатусыЭтапов);
	ЗаполнитьПризнакиОтстутвующихСтатусов(Объект, СтатусыЭтапов);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ИдентификаторПоддержкиСтрокой) Тогда
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержкиСтрокой) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Введен некорректный уникальный идентификатор'"),,
				"ИдентификаторПоддержкиСтрокой",, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьФормуВыбораТипаДокумента(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Объект.ИдентификаторДокумента), СписокДоступныхИдентификаторов);
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении(Элемент)
	
	Если Объект.ИдентификаторДокумента = ИдентификаторДокументаПрежнееЗначение Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторДокументаПрежнееЗначение) Тогда
		ТекстСообщения = НСтр("ru='При изменении типа документа будут очищены данные, связанные с реквизитами документа:
			|ответственность, доступность, влияние на другие процессы, доп. условия старта и прерывания этапов.
			|
			|Продолжить и изменить тип документа?'");
			
		ОписаниеОповещения = Новый ОписаниеОповещения("ИдентификаторДокументаПриИзменении_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 30);
	Иначе
		ИдентификаторДокументаПрежнееЗначение = Объект.ИдентификаторДокумента;
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитовДляРасчетаСроковОбработки();

КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		Объект.ОтветственностьЗаРеквизиты.Очистить();
		Объект.ИзменениеРеквизитовЭтапов.Очистить();
		Объект.ОбязательныеРеквизиты.Очистить();
		Объект.НедоступныеРеквизиты.Очистить();
		Объект.ВлияниеНаДругиеПроцессы.Очистить();
		
		Для Каждого СтрокаПредшественник Из Объект.ПредшественникиЭтапов Цикл
			СтрокаПредшественник.УсловиеПерехода = "";
		КонецЦикла;
		Для Каждого СтрокаПрерывание Из Объект.ПрерываниеЭтапов Цикл
			СтрокаПрерывание.УсловиеПерехода = "";
		КонецЦикла;
		
		ПроверитьДопустимостьФункцийПоЭтапам();
		
		ВычислитьОписаниеПредшественников(Объект);
		ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне);
		ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
		ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
		ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект);
		ВычислитьНомераКартинок(Объект.Этапы);
		
		ИдентификаторДокументаПрежнееЗначение = Объект.ИдентификаторДокумента;
		
		ЕстьОтстутствующиеВМетаданныхРеквизиты = Ложь;
		
	Иначе
		Объект.ИдентификаторДокумента = ИдентификаторДокументаПрежнееЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаШаблонаВыбор(Элемент)
	
	ПроцессыОбработкиДокументовКлиент.ОткрытьГиперссылкуЭлементаСхемы(Элемент.ТекущийЭлемент, ГиперссылкиЭлементовСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования,
																	ЭтотОбъект,
																	"Объект.Описание",
																	"Описание шаблона процесса");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРеквизитДляРасчетаСроковОбработкиПриИзменении(Элемент)
	ЕстьЗаписьЧасовДнейДляРегламента = Ложь;
	Для Каждого СтрокаЭтап из Объект.Этапы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЭтап.СрокиОбработкиПоРеквизитуДни) Тогда
			ЕстьЗаписьЧасовДнейДляРегламента = Истина;
			Прервать;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЭтап.СрокиОбработкиПоРеквизитуЧасы) Тогда
			ЕстьЗаписьЧасовДнейДляРегламента = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьЗаписьЧасовДнейДляРегламента Тогда
		Оповещение   = Новый ОписаниеОповещения("ОтветНаВопросОчисткаСроковОбработкиПоРеквизиту", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Существуют заполненные данные для расчета сроков обработки
									|по реквизиту. Произвести очистку?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("Очистить", НСтр("ru = 'Очистить'"));
		Кнопки.Добавить("Отмена", НСтр("ru = 'Отмена'"));
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.КнопкаПоУмолчанию = "Очистить";
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, ТекстВопроса, Кнопки, ПараметрыВопроса);	
	Иначе
		Объект.РеквизитДляРасчетаСроковОбработки = "";
		ВидимостьСрокиОбработкиПоРеквизиту = ?(Объект.ИспользоватьРеквизитДляРасчетаСроковОбработки, Истина, Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "РеквизитДляРасчетаСроковОбработки", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуДни", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуЧасы", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура РеквизитДляРасчетаСроковОбработкиОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
		Объект.РеквизитДляРасчетаСроковОбработки = ВыбранноеЗначение;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Этапы

&НаКлиенте
Процедура ЭтапыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторТекущегоЭтапа = Новый УникальныйИдентификатор;
	Элементы.Этапы.ТекущиеДанные.ИдентификаторЭтапа = ИдентификаторТекущегоЭтапа;
	Элементы.Этапы.ТекущиеДанные.ПредшественникиВариантИспользования = "ОдинИзПредшественников";
	
	Если Объект.Этапы.Количество() = 1 Тогда
		// Если добавляется первое действие, то его предшественник - старт процесса
		Элементы.Этапы.ТекущиеДанные.ПредшественникиВариантИспользования =
			"Старт,"+Элементы.Этапы.ТекущиеДанные.ПредшественникиВариантИспользования;
	ИначеЕсли Объект.Этапы.Количество() > 1 Тогда
		// В предшественники записывается действие, расположенной в таблице действий перед добавленным действием.
		КоличествоЭтапов = Объект.Этапы.Количество();
		НоваяСтрокаПредшественникиЭтапов = Объект.ПредшественникиЭтапов.Добавить();
		НоваяСтрокаПредшественникиЭтапов.ИдентификаторПредшественника = 
			Объект.Этапы[КоличествоЭтапов - 2].ИдентификаторЭтапа;
		НоваяСтрокаПредшественникиЭтапов.ИдентификаторПоследователя = ИдентификаторТекущегоЭтапа;
		НоваяСтрокаПредшественникиЭтапов.УсловиеРассмотрения = 
			ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка");
		
	КонецЕсли;
	
	Элементы.Этапы.ТекущиеДанные.ТребуетсяПроведение = Неопределено;
	Элементы.Этапы.ТекущиеДанные.ЗапретитьПроведениеОтменуПроведения = Ложь;
	Элементы.Этапы.ТекущиеДанные.ЗапретитьПерепроведение = Ложь;
	Элементы.Этапы.ТекущиеДанные.ВключатьВШтампВизуализацииЭП = Ложь;
	Элементы.Этапы.ТекущиеДанные.ИдентификаторыКомандПечатиСоШтампом = "";
	Элементы.Этапы.ТекущиеДанные.ОбособленнаяЗонаОтветственности = Ложь;
	
	ВычислитьОписаниеПредшественников(Объект);
	ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне);
	ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
	ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
	ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект);
	ВычислитьНомераКартинок(Объект.Этапы);
	
	ЗаполнитьВычисляемыеПоляЭтапов(Элементы.Этапы.ТекущиеДанные, Объект.ИсполнителиГрупповыхЭтапов);
	
	ЗаполнитьПорядокЭтаповШаблона();
	
	ЗаполнитьНедоступностьРеквизитовПоУмолчанию(Элементы.Этапы.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока И ОтменаРедактирования Тогда
		УдалитьСтрокиСвязанныхТабличныхЧастей(Элемент.ВыделенныеСтроки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ИдентификаторТекущегоЭтапа = Элемент.ТекущиеДанные.ИдентификаторЭтапа;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПередУдалением(Элемент, Отказ)
	УдалитьСтрокиСвязанныхТабличныхЧастей(Элемент.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПослеУдаления(Элемент)
	ЗаполнитьПорядокЭтаповШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Настройки предшествеников.
	Если Поле.Имя = "ЭтапыПредшественникиЭтапаСтрокой" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиПредшественниковЭтапа(Объект, Элемент.ТекущиеДанные, Элемент);
		
	// Настройки ответственности.
	ИначеЕсли Поле.Имя = "ЭтапыОтветственностьСтрокой" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокОтветственность" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаОтветственность";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыОбособленнаяЗонаОтветственности" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаОтветственность";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокПервичныеДокументы" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПервичныеДокументы";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокТребованияКПроведению" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПроведение";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокОтменаПроведения" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПроведение";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокТребованияКВыполнению" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаВыполение";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокЗапрещеноДобавлениеФайлов" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПрисоединенныеФайлы";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокЗапрещеноИзменениеФайлов" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПрисоединенныеФайлы";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокОбязательноНаличиеФайлов" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПрисоединенныеФайлы";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокПодписыватьФайлыЭП" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаПрисоединенныеФайлы";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
	ИначеЕсли Поле.Имя = "ЭтапыФлажокОбменСЛичнымКабинетом" Тогда
		СтандартнаяОбработка = Ложь;
		СтартоваяСтраницаФормы = "СтраницаОбменСЛичнымКабинетом";
		ОткрытьФормуНастройкиОтветственности(Объект, Элемент.ТекущиеДанные, Элемент, СтартоваяСтраницаФормы);
		
	//Настройки обработчиков.
	ИначеЕсли Поле.Имя = "ЭтапыОбработчикиСтрокой" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиДополнительныхОбработчиков(Объект, Элемент.ТекущиеДанные, Элемент);
	
	//Настройки влияния на другие процессы.
	ИначеЕсли Поле.Имя = "ЭтапыВлияниеНаПроцессыСтрокой" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуНастройкиВлиянияНаДругиеПроцессы(Объект, Элемент.ТекущиеДанные, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	ДанныеЭтапа = Элемент.ТекущиеДанные;
	
	Если ВыбранноеЗначение.ИмяНастройки = "НастройкаПорядкаВыполнения" Тогда
		
		ДанныеЭтапа.ПредшественникиВариантИспользования = ВыбранноеЗначение.ПредшественникиВариантИспользования;
		
		УстановитьПредшественниковЭтапа(Объект.ПредшественникиЭтапов, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.Предшественники);
		
		ВычислитьОписаниеПредшественников(Объект, ДанныеЭтапа);
		
		УстановитьПредшественниковЭтапа(Объект.ПрерываниеЭтапов, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.ПредшественникиПрерывание);
		
		ДанныеЭтапа.ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске =
			ВыбранноеЗначение.ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске;
		
		ДанныеЭтапа.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных =
			ВыбранноеЗначение.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных;
		
		ЗаполнитьПорядокЭтаповШаблона();
		
		Если ВыбранноеЗначение.УдаленыНесуществующиеСтатусы Тогда
			ДанныеЭтапа.ЕстьОтсутствующиеСтатусыВПорядкеВыполнения = Ложь;
		КонецЕсли;
		
	ИначеЕсли ВыбранноеЗначение.ИмяНастройки = "НастройкаОграниченийДоступа" Тогда
		
		ДанныеЭтапа.ЗапретитьПроведениеОтменуПроведения = ВыбранноеЗначение.ЗапретитьПроведениеОтменуПроведения;
		ДанныеЭтапа.ЗапретитьПерепроведение = ВыбранноеЗначение.ЗапретитьПерепроведение;
		ДанныеЭтапа.ВключатьВШтампВизуализацииЭП = ВыбранноеЗначение.ВключатьВШтампВизуализацииЭП;
		ДанныеЭтапа.ИдентификаторыКомандПечатиСоШтампом = ВыбранноеЗначение.ИдентификаторыКомандПечатиСоШтампом;
		ДанныеЭтапа.ЗапрещеноДобавлениеФайлов = ВыбранноеЗначение.ЗапрещеноДобавлениеФайлов;
		ДанныеЭтапа.ЗапрещеноИзменениеФайлов = ВыбранноеЗначение.ЗапрещеноИзменениеФайлов;
		ДанныеЭтапа.ОбособленнаяЗонаОтветственности = ВыбранноеЗначение.ОбособленнаяЗонаОтветственности;
		ДанныеЭтапа.НаличиеФайловОбязательно = ВыбранноеЗначение.НаличиеФайловОбязательно; 
		ДанныеЭтапа.РасшифровкаОбязательныхПрисоединенныхФайлов = ?(ДанныеЭтапа.НаличиеФайловОбязательно,
																	ВыбранноеЗначение.РасшифровкаОбязательныхПрисоединенныхФайлов, "");
		ДанныеЭтапа.ПодписыватьФайлыЭП = ВыбранноеЗначение.ПодписыватьФайлыЭП;
		ДанныеЭтапа.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа = ВыбранноеЗначение.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа;
		ДанныеЭтапа.ОбменСЛичнымКабинетом = ВыбранноеЗначение.ОбменСЛичнымКабинетом;
		ДанныеЭтапа.КодыНастройкиФормированияИПодписанияФормуляров = ВыбранноеЗначение.КодыНастройкиФормированияИПодписанияФормуляров; 
		ДанныеЭтапа.ФлажокФормированиеФормуляров = ВыбранноеЗначение.ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа;
		
		УстановитьТребованияКПроведению(Объект, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.ТребованияКПроведению);
		ЗаполнитьРеквизитТребуетсяПроведение(Объект);
		
		УстановитьТребованияКВыполнению(Объект, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.ТребованияКВыполнению);
		
		УстановитьОграниченияДоступа(Объект,
			ДанныеЭтапа.ИдентификаторЭтапа,
			ВыбранноеЗначение.ОтмеченныеРеквизитыОтветственность,
			ВыбранноеЗначение.ОтмеченныеРеквизитыИзменение,
			ВыбранноеЗначение.ОтмеченныеОбязательныеРеквизиты,
			ВыбранноеЗначение.ОтмеченныеНедоступныеРеквизиты);
		
		УстановитьОграниченияДоступаПервичныеДокументы(Объект,
			ДанныеЭтапа.ИдентификаторЭтапа,
			ВыбранноеЗначение.ПервичныеДокументыОтветственность,
			ВыбранноеЗначение.ПервичныеДокументыНедоступность,
			ВыбранноеЗначение.ПервичныеДокументыОбязательность);
		
		Если ВыбранноеЗначение.УдалитьНесуществующиеРеквизиты Тогда
			УдалитьНесуществующиеРеквизитыНаСервере();
			ЕстьОтстутствующиеВМетаданныхРеквизиты = Ложь;
		КонецЕсли;
		
		Если ВыбранноеЗначение.УдаленыНесуществующиеСтатусы Тогда
			ДанныеЭтапа.ЕстьОтсутствующиеСтатусыВНастройкеПроведения = Ложь;
			ДанныеЭтапа.ЕстьОтсутствующиеСтатусыВНастройкеВыполнения = Ложь;
		КонецЕсли;
		
		ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне);
		ВычислитьНомераКартинок(Объект.Этапы);

		СохранитьНастройкиСвойствЭлементовФормы(ВыбранноеЗначение, ДанныеЭтапа.ИдентификаторЭтапа);	
		
	ИначеЕсли ВыбранноеЗначение.ИмяНастройки = "НастройкаДополнительныхОбработчиков" Тогда
		
		УстановитьДополнительныеОбработчики(Объект, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.ДопОбработчики);
		
		ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
		
		УстановитьИнициирующиеСобытия(Объект, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.События);
		
		ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
		
		Если ВыбранноеЗначение.УдаленыНесуществующиеСтатусы Тогда
			ДанныеЭтапа.ЕстьОтсутствующиеСтатусыВДопОбработчиках = Ложь;
		КонецЕсли;
		
	ИначеЕсли ВыбранноеЗначение.ИмяНастройки = "НастройкаВлиянияНаДругиеПроцессы" Тогда
		
		УстановитьВлияниеНаДругиеПроцессы(Объект, ДанныеЭтапа.ИдентификаторЭтапа, ВыбранноеЗначение.ВлияниеНаДругиеПроцессы);
		
		ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект);
		
		Если ВыбранноеЗначение.УдаленыНесуществующиеСтатусы Тогда
			ДанныеЭтапа.ЕстьОтсутствующиеСтатусыВНастройкеВлияния = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыПриИзменении(Элемент)
	ВычислитьОписаниеПредшественников(Объект);
	ЗаполнитьВычисляемыеПоляЭтапов(Объект.Этапы, Объект.ИсполнителиГрупповыхЭтапов);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	ПараметрыВыбораИсполнителя = Новый Структура;
	ПараметрыВыбораИсполнителя.Вставить("ЭтапВыполняетсяНесколькимиИсполнителями", ТекущиеДанные.ЭтапВыполняетсяНесколькимиИсполнителями);
	ПараметрыВыбораИсполнителя.Вставить("ЭтоВыборИзСпискаИсполнителей", Ложь);
	
	РезультатИсполнители = Новый Массив;
	Для Каждого Исполнитель Из Объект.ИсполнителиГрупповыхЭтапов Цикл
		Если Исполнитель.ИдентификаторЭтапа <> ТекущиеДанные.ИдентификаторЭтапа Тогда
			Продолжить;
		КонецЕсли;
		РезультатИсполнитель = Новый Структура;
		РезультатИсполнитель.Вставить("Исполнитель", Исполнитель.Исполнитель);
		РезультатИсполнитель.Вставить("ОсновнойОбъектАдресации", Исполнитель.ОсновнойОбъектАдресации);
		РезультатИсполнитель.Вставить("ДополнительныйОбъектАдресации", Исполнитель.ДополнительныйОбъектАдресации);
		РезультатИсполнитель.Вставить("ИмяРеквизитаОсновногоОбъектаАдресации", Исполнитель.ИмяРеквизитаОсновногоОбъектаАдресации);
		РезультатИсполнитель.Вставить("ИмяРеквизитаДополнительногоОбъектаАдресации", Исполнитель.ИмяРеквизитаДополнительногоОбъектаАдресации);
		РезультатИсполнители.Добавить(РезультатИсполнитель);
	КонецЦикла;
	
	ПараметрыВыбораИсполнителя.Вставить("ИдентификаторЭтапаКуратора", ТекущиеДанные.ИдентификаторЭтапаКуратора);
	
	ПараметрыВыбораИсполнителя.Вставить("Исполнители", РезультатИсполнители);
	
	НедоступныеКураторы = Новый Соответствие;
	Для Каждого Этап Из Объект.Этапы Цикл
		// Текущий этап не может курировать сам себя
		Если Этап.ИдентификаторЭтапа = ТекущиеДанные.ИдентификаторЭтапа Тогда
			НедоступныеКураторы.Вставить(Этап.ИдентификаторЭтапа, Истина);
		// Один этап не может курировать несколько других
		ИначеЕсли ЗначениеЗаполнено(Этап.ИдентификаторЭтапаКуратора) Тогда
			НедоступныеКураторы.Вставить(Этап.ИдентификаторЭтапаКуратора, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Кураторы = Новый Массив;
	Для Каждого Этап Из Объект.Этапы Цикл
		Если НедоступныеКураторы.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Куратор = Новый Структура;
		Куратор.Вставить("НомерЭтапа", Этап.НомерСтроки);
		Куратор.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
		Куратор.Вставить("Этап", Этап.Этап);
		Куратор.Вставить("Исполнитель", Этап.Исполнитель);
		Кураторы.Добавить(Куратор);
	КонецЦикла;
	
	ПараметрыВыбораИсполнителя.Вставить("ДоступныеЭтапыКуратора", Кураторы);
	
	ПроцессыОбработкиДокументовКлиент.ВыбратьИсполнителя(
		Элемент, ТекущиеДанные.Исполнитель, , Истина, , Объект.ИдентификаторДокумента, ПараметрыВыбораИсполнителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	ОчиститьИсполнителяЭтапа(ТекущиеДанные);
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Если ВыбранноеЗначение.Свойство("ЭтапВыполняетсяНесколькимиИсполнителями") Тогда
			ТекущиеДанные.ЭтапВыполняетсяНесколькимиИсполнителями = Истина;
			ТекущиеДанные.ИдентификаторЭтапаКуратора = ВыбранноеЗначение.ИдентификаторЭтапаКуратора;
			Для Каждого Исполнитель Из ВыбранноеЗначение.Исполнители Цикл
				ИсполнительГрупповогоЭтапа = Объект.ИсполнителиГрупповыхЭтапов.Добавить();
				ЗаполнитьЗначенияСвойств(ИсполнительГрупповогоЭтапа, Исполнитель);
				ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа = ТекущиеДанные.ИдентификаторЭтапа;
			КонецЦикла;
		Иначе
			ТекущиеДанные.Исполнитель = ВыбранноеЗначение.РольИсполнителя;
			ТекущиеДанные.ОсновнойОбъектАдресации = ВыбранноеЗначение.ОсновнойОбъектАдресации;
			ТекущиеДанные.ДополнительныйОбъектАдресации = ВыбранноеЗначение.ДополнительныйОбъектАдресации;
			ТекущиеДанные.ИмяРеквизитаОсновногоОбъектаАдресации = ВыбранноеЗначение.ИмяРеквизитаОсновногоОбъектаАдресации;
			ТекущиеДанные.ИмяРеквизитаДополнительногоОбъектаАдресации = ВыбранноеЗначение.ИмяРеквизитаДополнительногоОбъектаАдресации;
		КонецЕсли;
		Модифицированность = Истина;
	Иначе
		ТекущиеДанные.Исполнитель = ВыбранноеЗначение;
	КонецЕсли;
	
	ЗаполнитьПредставлениеИсполнителя(ТекущиеДанные, Объект.ИсполнителиГрупповыхЭтапов);
	
	// Если был сброшен флаг группового выполнения, то необходимо сбросить флаг "ЛюбаяЗадачаПредшественника"
	// в таблицах "ПредшественникиЭтапов" и "ПрерываниеЭтапов"
	Если НЕ ТекущиеДанные.ЭтапВыполняетсяНесколькимиИсполнителями Тогда
		Для Каждого ПредшественникиЭтапов Из Объект.ПредшественникиЭтапов Цикл
			Если ПредшественникиЭтапов.ИдентификаторПредшественника = ТекущиеДанные.ИдентификаторЭтапа
				И ПредшественникиЭтапов.ЛюбаяЗадачаПредшественника Тогда
				ПредшественникиЭтапов.ЛюбаяЗадачаПредшественника = Ложь;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ПрерываниеЭтапов Из Объект.ПрерываниеЭтапов Цикл
			Если ПрерываниеЭтапов.ИдентификаторПредшественника = ТекущиеДанные.ИдентификаторЭтапа
				И ПрерываниеЭтапов.ЛюбаяЗадачаПредшественника Тогда
				ПрерываниеЭтапов.ЛюбаяЗадачаПредшественника = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполнительЭтапаСтрокойОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	ОчиститьИсполнителяЭтапа(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыИсполнительЭтапаСтрокойОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	ПоказатьЗначение(, ТекущиеДанные.Исполнитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыЭтапПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Этап) Тогда
		ЗаполнитьРеквизитыЭтапов(Объект.Этапы, СтатусыЭтапов);
		Если НЕ ТекущиеДанные.ТребуетсяЭП И НЕ ТекущиеДанные.ТребуетсяПростаяЭП Тогда
			ТекущиеДанные.ВключатьВШтампВизуализацииЭП = Ложь;
		КонецЕсли;
		ЗаполнитьПризнакиОтстутвующихСтатусов(Объект, СтатусыЭтапов);
	Иначе
		ТекущиеДанные.ТребуетсяЭП = Ложь;
		ТекущиеДанные.ТребуетсяПростаяЭП = Ложь;
		ТекущиеДанные.ВключатьВШтампВизуализацииЭП = Ложь;
		ТекущиеДанные.ЕстьСкрытыеРезультаты = Ложь;
	КонецЕсли;
	
	ВычислитьНомераКартинок(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСхему(Команда)
	СформироватьСхемуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСхемуВФайл(Команда)
	ПроцессыОбработкиДокументовКлиент.ВыгрузитьСхемуВФайл(СхемаШаблона);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеСхемы(Команда)
	Элементы.РедактированиеСхемы.Пометка = НЕ Элементы.РедактированиеСхемы.Пометка;
	УстановитьРежимРедактированияСхемы(Элементы);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьИспользование(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Шаблон", Объект.Ссылка);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", Объект.ИдентификаторДокумента);
	
	ОткрытьФорму("РегистрСведений.НастройкаИспользованияШаблонов.Форма.НастройкаИспользованияШаблонов", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьПорядокЭтаповШаблона()
	
	Для Каждого Этап Из Объект.Этапы Цикл
		Этап.Порядок = 99;
		Если Лев(Этап.ПредшественникиВариантИспользования,6) = "Старт," Тогда
			Этап.Порядок = 0;
		КонецЕсли;
	КонецЦикла;
	
	ТекущийПорядок = 0;
	ПоследнееКоличествоСНеПрисвоеннымПорядком = 0;
	ТекущееКоличествоСНеПрисвоеннымПорядком = 99;
	Пока ТекущееКоличествоСНеПрисвоеннымПорядком <> ПоследнееКоличествоСНеПрисвоеннымПорядком Цикл
		ТекущееКоличествоСНеПрисвоеннымПорядком = ПоследнееКоличествоСНеПрисвоеннымПорядком;
		ПоследнееКоличествоСНеПрисвоеннымПорядком = 0;
		Для Каждого Этап Из Объект.Этапы Цикл
			Если Этап.Порядок <> 99 Тогда
				Продолжить;
			КонецЕсли;
			Предшественники = Объект.ПредшественникиЭтапов.НайтиСтроки(Новый Структура("ИдентификаторПоследователя", Этап.ИдентификаторЭтапа));
			МаксимальныйПорядокПредшественника = Неопределено;
			Для Каждого Предшественник Из Предшественники Цикл
				ДанныеПредшественника = Объект.Этапы.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", Предшественник.ИдентификаторПредшественника));
				Если ДанныеПредшественника[0].Порядок = 99 Тогда
					// Если у одного из предшественников еще не заполнен порядок, то этапу на этой итерации порядок не присваивается
					Прервать;
				КонецЕсли;
				// Вычисляем максимальный порядок среди предшественников
				Если МаксимальныйПорядокПредшественника = Неопределено Тогда
					МаксимальныйПорядокПредшественника = ДанныеПредшественника[0].Порядок;
				Иначе
					МаксимальныйПорядокПредшественника = Макс(МаксимальныйПорядокПредшественника, ДанныеПредшественника[0].Порядок);
				КонецЕсли;
			КонецЦикла;
			Если МаксимальныйПорядокПредшественника <> Неопределено Тогда
				Этап.Порядок = МаксимальныйПорядокПредшественника + 1;
			КонецЕсли;
			Если Этап.Порядок = 99 Тогда
				ПоследнееКоличествоСНеПрисвоеннымПорядком = ПоследнееКоличествоСНеПрисвоеннымПорядком + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиСвязанныхТабличныхЧастей(ВыделенныеСтроки)
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		Строка = Объект.Этапы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Строка = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторПоследователя", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ПредшественникиЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ПредшественникиЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторПредшественника", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ПредшественникиЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ПредшественникиЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторПоследователя", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ПрерываниеЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ПрерываниеЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторПредшественника", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ПрерываниеЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ПрерываниеЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ОтветственностьЗаРеквизиты.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ОтветственностьЗаРеквизиты.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ИзменениеРеквизитовЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ИзменениеРеквизитовЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.НедоступныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.НедоступныеРеквизиты.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ДополнительныеОбработчики.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ДополнительныеОбработчики.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ВлияниеНаДругиеПроцессы.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ВлияниеНаДругиеПроцессы.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ИнициирующиеСобытия.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ИнициирующиеСобытия.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.ИсполнителиГрупповыхЭтапов.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			Объект.ИсполнителиГрупповыхЭтапов.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапаКуратора", Строка.ИдентификаторЭтапа);
		МассивКУдалению = Объект.Этапы.НайтиСтроки(ПараметрыОтбора);
		Для Каждого СтрокаКУдалению Из МассивКУдалению Цикл
			СтрокаКУдалению.ИдентификаторЭтапаКуратора = "";
			ТекстСообщения = НСтр("ru = 'Очищен этап куратора в этапе '") + СтрокаКУдалению.НомерСтроки + ". " + Строка(СтрокаКУдалению.Этап);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиПредшественниковЭтапа(Знач Объект, ДанныеЭтапа, Элемент) Экспорт
	
	ДоступнаОтметкаСтартовогоЭтапа = Истина;
	ВсеЭтапы = Новый СписокЗначений;
	Для Каждого Этап Из Объект.Этапы Цикл
		ДанныеОдногоЭтапа = Новый Структура;
		ДанныеОдногоЭтапа.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
		ДанныеОдногоЭтапа.Вставить("НаименованиеЭтапа", Этап.НаименованиеЭтапа);
		ДанныеОдногоЭтапа.Вставить("НомерЭтапа", ПолучитьПредставлениеЭтапа(Объект, Этап.ИдентификаторЭтапа));
		ДанныеОдногоЭтапа.Вставить("ШаблонЭтапа", Этап.Этап);
		ДанныеОдногоЭтапа.Вставить("ЭтапВыполняетсяНесколькимиИсполнителями", Этап.ЭтапВыполняетсяНесколькимиИсполнителями);
		ВсеЭтапы.Добавить(ДанныеОдногоЭтапа);
		Если Лев(Этап.ПредшественникиВариантИспользования, 6) = "Старт,"
			И Этап.ИдентификаторЭтапа <> ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДоступнаОтметкаСтартовогоЭтапа = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ПредшественникиЭтапа = Новый СписокЗначений;
	Для Каждого Предшественник Из Объект.ПредшественникиЭтапов Цикл
		Если Предшественник.ИдентификаторПоследователя = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеПредшественника = Новый Структура;
			ДанныеПредшественника.Вставить("ИдентификаторПредшественника", Предшественник.ИдентификаторПредшественника);
			ДанныеПредшественника.Вставить("УсловиеПерехода", Предшественник.УсловиеПерехода);
			ДанныеПредшественника.Вставить("УсловиеРассмотрения", Предшественник.УсловиеРассмотрения);
			ДанныеПредшественника.Вставить("ЛюбаяЗадачаПредшественника", Предшественник.ЛюбаяЗадачаПредшественника);
			ДанныеПредшественника.Вставить("ОписаниеУсловия", Предшественник.ОписаниеУсловия);
			ПредшественникиЭтапа.Добавить(ДанныеПредшественника);
		КонецЕсли;
	КонецЦикла;
	
	ПредшественникиПрерыванияЭтапа = Новый СписокЗначений;
	Для Каждого Предшественник Из Объект.ПрерываниеЭтапов Цикл
		Если Предшественник.ИдентификаторПоследователя = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеПредшественника = Новый Структура;
			ДанныеПредшественника.Вставить("ИдентификаторПредшественника", Предшественник.ИдентификаторПредшественника);
			ДанныеПредшественника.Вставить("УсловиеПерехода", Предшественник.УсловиеПерехода);
			ДанныеПредшественника.Вставить("УсловиеРассмотрения", Предшественник.УсловиеРассмотрения);
			ДанныеПредшественника.Вставить("ЛюбаяЗадачаПредшественника", Предшественник.ЛюбаяЗадачаПредшественника);
			ПредшественникиПрерыванияЭтапа.Добавить(ДанныеПредшественника);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Этапы", ВсеЭтапы);
	ПараметрыФормы.Вставить("Предшественники", ПредшественникиЭтапа);
	ПараметрыФормы.Вставить("ПредшественникиВариантИспользования", ДанныеЭтапа.ПредшественникиВариантИспользования);
	ПараметрыФормы.Вставить("ПредшественникиПрерывания", ПредшественникиПрерыванияЭтапа);
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", ДанныеЭтапа.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("ВладелецЭтапа", Объект.Ссылка);
	ПараметрыФормы.Вставить("ДоступнаОтметкаСтартовогоЭтапа", ДоступнаОтметкаСтартовогоЭтапа);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", Объект.ИдентификаторДокумента);
	ПараметрыФормы.Вставить("РолеваяАдресация", ТипЗнч(ДанныеЭтапа.Исполнитель) = Тип("СправочникСсылка.РолиИсполнителей"));
	ПараметрыФормы.Вставить("ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске",
		ДанныеЭтапа.ОтправлятьПредыдущемуИсполнителюПриПовторномЗапуске);
	ПараметрыФормы.Вставить("НеЗапрещатьОтменуВыполненияПриНаличииПрерванных",
		ДанныеЭтапа.НеЗапрещатьОтменуВыполненияПриНаличииПрерванных);
	
	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.НастройкаПредшественниковЭтапа", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтветственности(Знач Объект, ДанныеЭтапа, Элемент, СтартоваяСтраницаФормы = "") Экспорт
	
	Предшественники = Новый Соответствие;
	Для Каждого Этап Из Объект.Этапы Цикл
		Если Этап.Порядок < ДанныеЭтапа.Порядок Тогда
			Предшественники.Вставить(Этап.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	НесвязанныеЭтапы = ЭтапыНеИмеющиеОбщегоМаршрутаСЭтапом(ДанныеЭтапа.ИдентификаторЭтапа);
	
	ОтмеченныеРеквизитыОтветственность = Новый СписокЗначений;
	НедоступныеРеквизитыОтветственность = Новый СписокЗначений;
	НедоступныеРеквизитыДоступность = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.ОтветственностьЗаРеквизиты Цикл
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
		ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ОтмеченныеРеквизитыОтветственность.Добавить(ДанныеРеквизита);
		Иначе
			Если НесвязанныеЭтапы.Получить(ОтмеченныйРеквизит.ИдентификаторЭтапа) = Неопределено Тогда
				НедоступныеРеквизитыОтветственность.Добавить(ДанныеРеквизита);
			КонецЕсли;
			Если Предшественники.Получить(ОтмеченныйРеквизит.ИдентификаторЭтапа) <> Неопределено Тогда
				НедоступныеРеквизитыДоступность.Добавить(ДанныеРеквизита);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОтмеченныеРеквизитыИзменение = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.ИзменениеРеквизитовЭтапов Цикл
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеРеквизита = Новый Структура;
			ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
			ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
			ОтмеченныеРеквизитыИзменение.Добавить(ДанныеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ОтмеченныеНедоступныеРеквизиты = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.НедоступныеРеквизиты Цикл
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеРеквизита = Новый Структура;
			ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
			ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
			ОтмеченныеНедоступныеРеквизиты.Добавить(ДанныеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ОтмеченныеОбязательныеРеквизиты = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.ОбязательныеРеквизиты Цикл
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеРеквизита = Новый Структура;
			ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
			ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
			ОтмеченныеОбязательныеРеквизиты.Добавить(ДанныеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ПервичныеДокументыОтветственность = Новый СписокЗначений;
	НедоступныеПервичныеДокументыОтветственность = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.ОтветственностьПервичныеДокументы Цикл
		ДанныеРеквизита = Новый Структура;
		ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ОтмеченныйРеквизит.ИдентификаторПечатнойФормы);
		ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
		ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ПервичныеДокументыОтветственность.Добавить(ДанныеРеквизита);
		Иначе
			Если НесвязанныеЭтапы.Получить(ОтмеченныйРеквизит.ИдентификаторЭтапа) = Неопределено Тогда
				НедоступныеПервичныеДокументыОтветственность.Добавить(ДанныеРеквизита);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПервичныеДокументыНедоступность = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.НедоступностьПервичныеДокументы Цикл
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеРеквизита = Новый Структура;
			ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ОтмеченныйРеквизит.ИдентификаторПечатнойФормы);
			ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
			ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
			ПервичныеДокументыНедоступность.Добавить(ДанныеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ПервичныеДокументыОбязательность = Новый СписокЗначений;
	Для Каждого ОтмеченныйРеквизит Из Объект.ОбязательностьПервичныеДокументы Цикл
		Если ОтмеченныйРеквизит.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеРеквизита = Новый Структура;
			ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ОтмеченныйРеквизит.ИдентификаторПечатнойФормы);
			ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ОтмеченныйРеквизит.ИмяТабличнойЧасти);
			ДанныеРеквизита.Вставить("ИмяРеквизита", ОтмеченныйРеквизит.ИмяРеквизита);
			ПервичныеДокументыОбязательность.Добавить(ДанныеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	ТребованияКПроведению = Новый СписокЗначений;
	Для Каждого ТребованиеКПроведению Из Объект.ТребованияКПроведению Цикл
		Если ТребованиеКПроведению.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеПроведения = Новый Структура;
			ДанныеПроведения.Вставить("Статус", ТребованиеКПроведению.Статус);
			ДанныеПроведения.Вставить("ПризнакПроведенности", ТребованиеКПроведению.ПризнакПроведенности);
			ТребованияКПроведению.Добавить(ДанныеПроведения);
		КонецЕсли;
	КонецЦикла;
	
	ТребованияКВыполнению = Новый СписокЗначений;
	Для Каждого ТребованиеКВыполнению Из Объект.ТребованияКВыполнению Цикл
		Если ТребованиеКВыполнению.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеПроведения = Новый Структура;
			ДанныеПроведения.Вставить("Статус", ТребованиеКВыполнению.Статус);
			ДанныеПроведения.Вставить("УсловиеВыполнения", ТребованиеКВыполнению.УсловиеВыполнения);
			ТребованияКВыполнению.Добавить(ДанныеПроведения);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаНастроекСвойствЭлементовФормы = Объект.УправлениеЭлементамиФормы;
	СтруктураНастроекСвойствЭлементов = ПроцессыОбработкиДокументовКлиентСервер.ПолучитьСтруктуруНастроекСвойствЭлементовСогласноЭтапу(
		ТаблицаНастроекСвойствЭлементовФормы, ДанныеЭтапа.ИдентификаторЭтапа);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", ДанныеЭтапа.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("НаименованиеТекущегоЭтапа", ДанныеЭтапа.НаименованиеЭтапа);
	ПараметрыФормы.Вставить("НомерТекущегоЭтапа", ПолучитьПредставлениеЭтапа(Объект, ДанныеЭтапа.ИдентификаторЭтапа));
	ПараметрыФормы.Вставить("ЗапретитьПроведениеОтменуПроведения", ДанныеЭтапа.ЗапретитьПроведениеОтменуПроведения);
	ПараметрыФормы.Вставить("ЗапретитьПерепроведение", ДанныеЭтапа.ЗапретитьПерепроведение);
	ПараметрыФормы.Вставить("ТребуетсяЭП", ДанныеЭтапа.ТребуетсяЭП ИЛИ ДанныеЭтапа.ТребуетсяПростаяЭП);
	ПараметрыФормы.Вставить("ВключатьВШтампВизуализацииЭП", ДанныеЭтапа.ВключатьВШтампВизуализацииЭП);
	ПараметрыФормы.Вставить("ИдентификаторыКомандПечатиСоШтампом", ДанныеЭтапа.ИдентификаторыКомандПечатиСоШтампом);
	ПараметрыФормы.Вставить("ОбособленнаяЗонаОтветственности", ДанныеЭтапа.ОбособленнаяЗонаОтветственности);
	ПараметрыФормы.Вставить("ТекущийЭтап", ДанныеЭтапа.Этап);
	ПараметрыФормы.Вставить("ЗапрещеноДобавлениеФайлов", ДанныеЭтапа.ЗапрещеноДобавлениеФайлов);
	ПараметрыФормы.Вставить("ЗапрещеноИзменениеФайлов", ДанныеЭтапа.ЗапрещеноИзменениеФайлов);
	ПараметрыФормы.Вставить("НаличиеФайловОбязательно", ДанныеЭтапа.НаличиеФайловОбязательно);
	ПараметрыФормы.Вставить("РасшифровкаОбязательныхПрисоединенныхФайлов", ДанныеЭтапа.РасшифровкаОбязательныхПрисоединенныхФайлов);

	ПараметрыФормы.Вставить("ПодписыватьФайлыЭП", ДанныеЭтапа.ПодписыватьФайлыЭП);
	ПараметрыФормы.Вставить("ОбменСЛичнымКабинетом", ДанныеЭтапа.ОбменСЛичнымКабинетом);
	ПараметрыФормы.Вставить("КодыНастройкиФормированияИПодписанияФормуляров", ДанныеЭтапа.КодыНастройкиФормированияИПодписанияФормуляров);
	
	ПараметрыФормы.Вставить("ВладелецЭтапа", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВладелецЭтапаОбъект", Объект);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", Объект.ИдентификаторДокумента);
	
	ПараметрыФормы.Вставить("ОтмеченныеРеквизитыОтветственность", ОтмеченныеРеквизитыОтветственность);
	ПараметрыФормы.Вставить("НедоступныеРеквизитыОтветственность", НедоступныеРеквизитыОтветственность);
	ПараметрыФормы.Вставить("НедоступныеРеквизитыДоступность", НедоступныеРеквизитыДоступность);
	ПараметрыФормы.Вставить("ОтмеченныеРеквизитыИзменение", ОтмеченныеРеквизитыИзменение);
	ПараметрыФормы.Вставить("ОтмеченныеНедоступныеРеквизиты", ОтмеченныеНедоступныеРеквизиты);
	ПараметрыФормы.Вставить("ОтмеченныеОбязательныеРеквизиты", ОтмеченныеОбязательныеРеквизиты);
	
	ПараметрыФормы.Вставить("ПервичныеДокументыОтветственность", ПервичныеДокументыОтветственность);
	ПараметрыФормы.Вставить("НедоступныеПервичныеДокументыОтветственность", НедоступныеПервичныеДокументыОтветственность);
	ПараметрыФормы.Вставить("ПервичныеДокументыНедоступность", ПервичныеДокументыНедоступность);
	ПараметрыФормы.Вставить("ПервичныеДокументыОбязательность", ПервичныеДокументыОбязательность);
	
	ПараметрыФормы.Вставить("ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа", ДанныеЭтапа.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа);
	
	ПараметрыФормы.Вставить("ТребованияКПроведению", ТребованияКПроведению);
	ПараметрыФормы.Вставить("ТребованияКВыполнению", ТребованияКВыполнению);
	
	ПараметрыФормы.Вставить("СтартоваяСтраницаФормы", СтартоваяСтраницаФормы);
	
	ПараметрыФормы.Вставить("НедоступныеЭлементы", СтруктураНастроекСвойствЭлементов.НедоступныеЭлементы); 
	ПараметрыФормы.Вставить("НевидимыеЭлементы", СтруктураНастроекСвойствЭлементов.НевидимыеЭлементы); 
	ПараметрыФормы.Вставить("ЭлементыСОтметкойНезаполненного", СтруктураНастроекСвойствЭлементов.ЭлементыСОтметкойНезаполненного);
    ПараметрыФормы.Вставить("СтартоваяСтраница", СтруктураНастроекСвойствЭлементов.СтартоваяСтраница);
	
	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.НастройкаОтветственностиПоЭтапам", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиДополнительныхОбработчиков(Знач Объект, ДанныеЭтапа, Элемент) Экспорт
	
	ДопОбработчики = Новый Массив;
	Для Каждого ДопОбработчик Из Объект.ДополнительныеОбработчики Цикл
		Если ДопОбработчик.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеОбработчика = Новый Структура;
			ДанныеОбработчика.Вставить("Статус", ДопОбработчик.Статус);
			ДанныеОбработчика.Вставить("Обработчик", ДопОбработчик.Обработчик);
			ДанныеОбработчика.Вставить("ОбработчикДоТранзакции", ДопОбработчик.ОбработчикДоТранзакции);
			ДанныеОбработчика.Вставить("ОбработчикКлиентский", ДопОбработчик.ОбработчикКлиентский);
			ДопОбработчики.Добавить(ДанныеОбработчика);
		КонецЕсли;
	КонецЦикла;
	
	События = Новый Массив;
	Для Каждого Событие Из Объект.ИнициирующиеСобытия Цикл
		Если Событие.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеСобытия = Новый Структура;
			ДанныеСобытия.Вставить("Статус", Событие.Статус);
			ДанныеСобытия.Вставить("Событие", Событие.Событие);
			События.Добавить(ДанныеСобытия);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", 	ДанныеЭтапа.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("НаименованиеТекущегоЭтапа", 	ДанныеЭтапа.НаименованиеЭтапа);
	ПараметрыФормы.Вставить("НомерТекущегоЭтапа", 			ПолучитьПредставлениеЭтапа(Объект, ДанныеЭтапа.ИдентификаторЭтапа));
	ПараметрыФормы.Вставить("ТекущийЭтап", 					ДанныеЭтапа.Этап);
	ПараметрыФормы.Вставить("ВладелецЭтапа", 				Объект.Ссылка);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", 		Объект.ИдентификаторДокумента);
	ПараметрыФормы.Вставить("ДопОбработчики", 				ДопОбработчики);
	ПараметрыФормы.Вставить("События", 						События);
	
	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.НастройкаДополнительныхОбработчиков", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиВлиянияНаДругиеПроцессы(Знач Объект, ДанныеЭтапа, Элемент) Экспорт
	
	ВлияниеНаДругиеПроцессы = Новый СписокЗначений;
	Для Каждого Влияние Из Объект.ВлияниеНаДругиеПроцессы Цикл
		Если Влияние.ИдентификаторЭтапа = ДанныеЭтапа.ИдентификаторЭтапа Тогда
			ДанныеВлияния = Новый Структура;
			ДанныеВлияния.Вставить("Статус", 								Влияние.Статус);
			ДанныеВлияния.Вставить("ЗависимыйШаблон", 						Влияние.ЗависимыйШаблон);
			ДанныеВлияния.Вставить("ИдентификаторЭтапаЗависимогоШаблона", 	Влияние.ИдентификаторЭтапаЗависимогоШаблона);
			ДанныеВлияния.Вставить("УстанавливаемыйСтатус", 				Влияние.УстанавливаемыйСтатус);
			ДанныеВлияния.Вставить("СвязьСОбъектом", 						Влияние.СвязьСОбъектом);
			ВлияниеНаДругиеПроцессы.Добавить(ДанныеВлияния);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторТекущегоЭтапа", 	ДанныеЭтапа.ИдентификаторЭтапа);
	ПараметрыФормы.Вставить("НаименованиеТекущегоЭтапа", 	ДанныеЭтапа.НаименованиеЭтапа);
	ПараметрыФормы.Вставить("НомерТекущегоЭтапа", 			ПолучитьПредставлениеЭтапа(Объект, ДанныеЭтапа.ИдентификаторЭтапа));
	ПараметрыФормы.Вставить("ТекущийЭтап", 					ДанныеЭтапа.Этап);
	ПараметрыФормы.Вставить("ВладелецЭтапа", 				Объект.Ссылка);
	ПараметрыФормы.Вставить("ИдентификаторДокумента", 		Объект.ИдентификаторДокумента);
	ПараметрыФормы.Вставить("ВлияниеНаДругиеПроцессы", 		ВлияниеНаДругиеПроцессы);
	
	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.НастройкаВлиянияНаДругиеПроцессы", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеЭтапа(Знач Объект, ИдентификаторЭтапа)
	
	ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", ИдентификаторЭтапа);
	МассивНайденных = Объект.Этапы.НайтиСтроки(ПараметрыОтбора);
	Если МассивНайденных.Количество() > 0 Тогда
		НайденныйЭтап = МассивНайденных[0];
		Возврат Строка(Объект.Этапы.Индекс(НайденныйЭтап) + 1);
	КонецЕсли;
	Возврат "";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьВычисляемыеПоляЭтапов(ЭтапЭтапы, ИсполнителиГрупповыхЭтапов) Экспорт
	
	Если ТипЗнч(ЭтапЭтапы) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		МассивЭтапов = Новый Массив;
		МассивЭтапов.Добавить(ЭтапЭтапы);
	Иначе
		МассивЭтапов = ЭтапЭтапы;
	КонецЕсли;
	
	Для Каждого Этап Из МассивЭтапов Цикл
		
		Этап.НаименованиеЭтапа = Строка(Этап.Этап);
		
		ЗаполнитьПредставлениеИсполнителя(Этап, ИсполнителиГрупповыхЭтапов);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВлияниеНаДругиеПроцессы(Знач Объект, ИдентификаторЭтапа, ВлияниеНаДругиеПроцессы)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ВлияниеНаДругиеПроцессы Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ВлияниеНаДругиеПроцессы.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого Влияние Из ВлияниеНаДругиеПроцессы Цикл
		НоваяСтрока = Объект.ВлияниеНаДругиеПроцессы.Добавить();
		НоваяСтрока.ИдентификаторЭтапа = ИдентификаторЭтапа;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Влияние.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДополнительныеОбработчики(Знач Объект, ИдентификаторЭтапа, ДополнительныеОбработчики)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ДополнительныеОбработчики Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ДополнительныеОбработчики.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ДопОбработчик Из ДополнительныеОбработчики Цикл
		НоваяСтрока = Объект.ДополнительныеОбработчики.Добавить();
		НоваяСтрока.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НоваяСтрока.Статус = ДопОбработчик.Статус;
		НоваяСтрока.Обработчик = ДопОбработчик.Обработчик;
		НоваяСтрока.ОбработчикДоТранзакции = ДопОбработчик.ОбработчикДоТранзакции;
		НоваяСтрока.ОбработчикКлиентский = ДопОбработчик.ОбработчикКлиентский;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнициирующиеСобытия(Знач Объект, ИдентификаторЭтапа, События)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ИнициирующиеСобытия Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ИнициирующиеСобытия.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого Событие Из События Цикл
		НоваяСтрока = Объект.ИнициирующиеСобытия.Добавить();
		НоваяСтрока.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НоваяСтрока.Статус = Событие.Статус;
		НоваяСтрока.Событие = Событие.Событие;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребованияКПроведению(Знач Объект, ИдентификаторЭтапа, ТребованияКПроведению)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ТребованияКПроведению Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ТребованияКПроведению.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ТребованиеКПроведению Из ТребованияКПроведению Цикл
		НоваяСтрока = Объект.ТребованияКПроведению.Добавить();
		НоваяСтрока.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НоваяСтрока.Статус = ТребованиеКПроведению.Значение.Статус;
		НоваяСтрока.ПризнакПроведенности = ТребованиеКПроведению.Значение.ПризнакПроведенности;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТребованияКВыполнению(Знач Объект, ИдентификаторЭтапа, ТребованияКВыполнению)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ТребованияКВыполнению Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ТребованияКВыполнению.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ТребованиеКВыполнению Из ТребованияКВыполнению Цикл
		НоваяСтрока = Объект.ТребованияКВыполнению.Добавить();
		НоваяСтрока.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НоваяСтрока.Статус = ТребованиеКВыполнению.Значение.Статус;
		НоваяСтрока.УсловиеВыполнения = ТребованиеКВыполнению.Значение.УсловиеВыполнения;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграниченияДоступа(Знач Объект, ИдентификаторЭтапа, ОтмеченныеРеквизитыОтветственность,
	ОтмеченныеРеквизитыИзменение, ОтмеченныеОбязательныеРеквизиты, ОтмеченныеНедоступныеРеквизиты)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ОтветственностьЗаРеквизиты Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ОтветственностьЗаРеквизиты.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеРеквизитыОтветственность Цикл
		НовыйРеквизит = Объект.ОтветственностьЗаРеквизиты.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ИзменениеРеквизитовЭтапов Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ИзменениеРеквизитовЭтапов.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеРеквизитыИзменение Цикл
		НовыйРеквизит = Объект.ИзменениеРеквизитовЭтапов.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.НедоступныеРеквизиты Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.НедоступныеРеквизиты.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеНедоступныеРеквизиты Цикл
		НовыйРеквизит = Объект.НедоступныеРеквизиты.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ОбязательныеРеквизиты Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ОбязательныеРеквизиты.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеОбязательныеРеквизиты Цикл
		НовыйРеквизит = Объект.ОбязательныеРеквизиты.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграниченияДоступаПервичныеДокументы(Знач Объект, ИдентификаторЭтапа,
	ПервичныеДокументыОтветственность, ПервичныеДокументыНедоступность, ПервичныеДокументыОбязательность)
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ОтветственностьПервичныеДокументы Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ОтветственностьПервичныеДокументы.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыОтветственность Цикл
		НовыйРеквизит = Объект.ОтветственностьПервичныеДокументы.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИдентификаторПечатнойФормы = ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.НедоступностьПервичныеДокументы Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.НедоступностьПервичныеДокументы.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыНедоступность Цикл
		НовыйРеквизит = Объект.НедоступностьПервичныеДокументы.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИдентификаторПечатнойФормы = ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ОбязательностьПервичныеДокументы Цикл
		Если Элемент.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ОбязательностьПервичныеДокументы.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыОбязательность Цикл
		НовыйРеквизит = Объект.ОбязательностьПервичныеДокументы.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = ИдентификаторЭтапа;
		НовыйРеквизит.ИдентификаторПечатнойФормы = ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы;
		НовыйРеквизит.ИмяТабличнойЧасти = ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = ОтмеченныйРеквизит.Значение.ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредшественниковЭтапа(ОбъектПредшественникиЭтапов, ИдентификаторЭтапа, СписокПредшественников)
	
	УдалитьВсехПредшественниковЭтапа(ОбъектПредшественникиЭтапов, ИдентификаторЭтапа);
	
	Для Каждого Предшественник Из СписокПредшественников Цикл
		НовыйПредшественник = ОбъектПредшественникиЭтапов.Добавить();
		НовыйПредшественник.ИдентификаторПоследователя = ИдентификаторЭтапа;
		НовыйПредшественник.ИдентификаторПредшественника = Предшественник.Значение.ИдентификаторПредшественника;
		НовыйПредшественник.УсловиеПерехода = Предшественник.Значение.УсловиеПерехода;
		НовыйПредшественник.УсловиеРассмотрения = Предшественник.Значение.УсловиеРассмотрения;
		НовыйПредшественник.ОписаниеУсловия = Предшественник.Значение.ОписаниеУсловия;
		НовыйПредшественник.ЛюбаяЗадачаПредшественника = Предшественник.Значение.ЛюбаяЗадачаПредшественника;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехПредшественниковЭтапа(ОбъектПредшественникиЭтапов, ИдентификаторЭтапа)
	
	Пока УЭтапаЕстьПредшественники(ОбъектПредшественникиЭтапов, ИдентификаторЭтапа) Цикл
		Для Каждого Предшественник Из ОбъектПредшественникиЭтапов Цикл
			Если Предшественник.ИдентификаторПоследователя = ИдентификаторЭтапа Тогда
				ОбъектПредшественникиЭтапов.Удалить(Предшественник);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция УЭтапаЕстьПредшественники(ОбъектПредшественникиЭтапов, ИдентификаторЭтапа)
	
	Для каждого Предшественник Из ОбъектПредшественникиЭтапов Цикл
		Если Предшественник.ИдентификаторПоследователя = ИдентификаторЭтапа Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеПредшественников(Объект, Этап = Неопределено)
	
	Если Этап = Неопределено Тогда
		Для Каждого ЭтапОбъекта Из Объект.Этапы Цикл
			ВычислитьОписаниеПредшественниковЭтапа(Объект, ЭтапОбъекта);
		КонецЦикла;
	Иначе
		ВычислитьОписаниеПредшественниковЭтапа(Объект, Этап);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеПредшественниковЭтапа(Объект, ЭтапОбъекта)
	
	ИдентификаторЭтапа = ЭтапОбъекта.ИдентификаторЭтапа;
	СтрокаРезультат = "";
	СтрокаСвязка = " " + НСтр("ru = 'и'") + " ";
	Если СтрНайти(ЭтапОбъекта.ПредшественникиВариантИспользования,"ОдинИзПредшественников" ) > 0 Тогда
		СтрокаСвязка = " " + НСтр("ru = 'или'") + " ";
	КонецЕсли;
	Для Каждого Предшественник Из Объект.ПредшественникиЭтапов Цикл
		Если Предшественник.ИдентификаторПоследователя = ИдентификаторЭтапа Тогда
			СтрокаПростоеУсловие = "";
			Если Предшественник.ИдентификаторПредшественника <> Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
				
				Для Каждого ЭтапПредшественник Из Объект.Этапы Цикл
					Если ЭтапПредшественник.ИдентификаторЭтапа = Предшественник.ИдентификаторПредшественника Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Предшественник.УсловиеРассмотрения = ПредопределенноеЗначение("Справочник.СтатусыДокументов.ПустаяСсылка") Тогда
					СтрокаПростоеУсловие = НСтр("ru = 'После завершения '");
				Иначе
					СтрокаПростоеУсловие = НСтр("ru = 'Если ""'")+Предшественник.УсловиеРассмотрения+НСтр("ru = '"" после '");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
				СтрокаРезультат = СтрокаРезультат + СтрокаСвязка + СтрокаПростоеУсловие + ПолучитьПредставлениеЭтапа(Объект, Предшественник.ИдентификаторПредшественника);
			Иначе
				СтрокаРезультат = СтрокаПростоеУсловие + ПолучитьПредставлениеЭтапа(Объект, Предшественник.ИдентификаторПредшественника);
			КонецЕсли;
			Если ЗначениеЗаполнено(Предшественник.УсловиеПерехода) И НЕ ПустаяСтрока(Предшественник.ОписаниеУсловия) Тогда
				СтрокаРезультат = СтрокаРезультат + НСтр("ru = ', если '") + Предшественник.ОписаниеУсловия + ",";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// удаление последней запятой, если она есть
	Если СтрЗаканчиваетсяНа(СтрокаРезультат,",") Тогда
		СтрокаРезультат = Лев(СтрокаРезультат,СтрДлина(СтрокаРезультат)-1);
	КонецЕсли;
	
	Если Лев(ЭтапОбъекта.ПредшественникиВариантИспользования,6) = "Старт," Тогда
		Если ЗначениеЗаполнено(СтрокаРезультат) Тогда
			СтрокаРезультат = "Стартовый этап, а также " + СтрокаРезультат;
		Иначе
			СтрокаРезультат = "Стартовый этап";
		КонецЕсли;
	КонецЕсли;
	
	ЭтапОбъекта.ПредшественникиЭтапаСтрокой = СтрокаРезультат;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне)
	
	Для Каждого Этап Из Объект.Этапы Цикл
		
		// Ответственность за реквизиты.
		Для Каждого ДоступностьРеквизитовЭтапа Из Объект.ОтветственностьЗаРеквизиты Цикл
			Если Этап.ИдентификаторЭтапа = ДоступностьРеквизитовЭтапа.ИдентификаторЭтапа Тогда
				Этап.ФлажокОтветственность = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Этап.ФлажокПервичныеДокументы = Этап.ВключатьВШтампВизуализацииЭП;
		Этап.ФлажокФормированиеФормуляров = ЗначениеЗаполнено(Этап.КодыНастройкиФормированияИПодписанияФормуляров);
		
		Для Каждого ТребованияКПроведениюЭтапа Из Объект.ТребованияКПроведению Цикл
			Если Этап.ИдентификаторЭтапа = ТребованияКПроведениюЭтапа.ИдентификаторЭтапа Тогда
				Этап.ФлажокТребованияКПроведению = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Этап.ФлажокОтменаПроведения = Этап.ЗапретитьПроведениеОтменуПроведения ИЛИ Этап.ЗапретитьПерепроведение;
		
		// Требования к выполнению.
		Для Каждого ТребованияКВыполнениюЭтапа Из Объект.ТребованияКВыполнению Цикл
			Если Этап.ИдентификаторЭтапа = ТребованияКВыполнениюЭтапа.ИдентификаторЭтапа 
				И ЗначениеЗаполнено(ТребованияКВыполнениюЭтапа.УсловиеВыполнения) Тогда
				Этап.ФлажокТребованияКВыполнению = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Этап.ФлажокЗапрещеноДобавлениеФайлов = Этап.ЗапрещеноДобавлениеФайлов;
		Этап.ФлажокЗапрещеноИзменениеФайлов = Этап.ЗапрещеноИзменениеФайлов;
		Этап.ФлажокОбязательноНаличиеФайлов = Этап.НаличиеФайловОбязательно;
		Этап.ФлажокПодписыватьФайлыЭП = Этап.ПодписыватьФайлыЭП;
		Этап.ФлажокОбменСЛичнымКабинетом = Этап.ОбменСЛичнымКабинетом;
		
		Этап.ОтветственностьСтрокой = "Настроить";
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков)
	
	Для Каждого Этап Из Объект.Этапы Цикл
		Этап.ЕстьНенайденныеОбработчики = Ложь;
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
		МассивСтрок = Объект.ДополнительныеОбработчики.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаРезультат = "";
			Для к = 0 По МассивСтрок.Количество()-1 Цикл
				Для Каждого Обработчик Из СтрРазделить(МассивСтрок[к].ОбработчикКлиентский, ";", Ложь) Цикл
					ЭлементСписка = СписокПодключаемыхКлиентскихОбработчиков.НайтиПоЗначению(Обработчик);
					Если ЭлементСписка <> Неопределено Тогда
						СтрокаРезультат = СтрокаРезультат + ЭлементСписка.Представление+"; ";
					Иначе
						СтрокаРезультат = СтрокаРезультат + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не найден клиентский обработчик с ID ""%1""; '"), Обработчик);
						Этап.ЕстьНенайденныеОбработчики = Истина;
					КонецЕсли;
				КонецЦикла;
				Для Каждого Обработчик Из СтрРазделить(МассивСтрок[к].ОбработчикДоТранзакции, ";", Ложь) Цикл
					ЭлементСписка = СписокПодключаемыхОбработчиков.НайтиПоЗначению(Обработчик);
					Если ЭлементСписка <> Неопределено Тогда
						СтрокаРезультат = СтрокаРезультат + ЭлементСписка.Представление+"; ";
					Иначе
						СтрокаРезультат = СтрокаРезультат + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не найден обработчик с ID ""%1""; '"), Обработчик);
						Этап.ЕстьНенайденныеОбработчики = Истина;
					КонецЕсли;
				КонецЦикла;
				Для Каждого Обработчик Из СтрРазделить(МассивСтрок[к].Обработчик, ";", Ложь) Цикл
					ЭлементСписка = СписокПодключаемыхОбработчиков.НайтиПоЗначению(Обработчик);
					Если ЭлементСписка <> Неопределено Тогда
						СтрокаРезультат = СтрокаРезультат + ЭлементСписка.Представление+"; ";
					Иначе
						СтрокаРезультат = СтрокаРезультат + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							НСтр("ru = 'Не найден обработчик с ID ""%1""; '"), Обработчик);
						Этап.ЕстьНенайденныеОбработчики = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			СтрокаРезультат = Лев(СтрокаРезультат, СтрДлина(СтрокаРезультат)-2);
		Иначе
			СтрокаРезультат = "Не используются";
		КонецЕсли;
		Этап.ОбработчикиСтрокой = СтрокаРезультат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий)
	
	Для Каждого Этап Из Объект.Этапы Цикл
		Этап.ЕстьНенайденныеСобытия = Ложь;
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
		МассивСтрок = Объект.ИнициирующиеСобытия.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаРезультат = "";
			Для к = 0 По МассивСтрок.Количество()-1 Цикл
				Если Не ПустаяСтрока(МассивСтрок[к].Событие) Тогда
					ЭлементСписка = СписокИнициирующихСобытий.НайтиПоЗначению(МассивСтрок[к].Событие);
					Если ЭлементСписка <> Неопределено Тогда
						СтрокаРезультат = СтрокаРезультат + ЭлементСписка.Представление+"; ";
					Иначе
						СтрокаРезультат = СтрокаРезультат + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
															НСтр("ru = 'Не найдено инициирующее событие с ID ""%1""; '"),
															МассивСтрок[к].Событие);
						Этап.ЕстьНенайденныеСобытия = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			СтрокаРезультат = Лев(СтрокаРезультат, СтрДлина(СтрокаРезультат)-2);
		Иначе
			СтрокаРезультат = "Не используются";
		КонецЕсли;
		Этап.ОбработчикиСтрокой = Этап.ОбработчикиСтрокой + " / " + СтрокаРезультат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект)
	
	Для Каждого Этап Из Объект.Этапы Цикл
		ПараметрыОтбора = Новый Структура("ИдентификаторЭтапа",Этап.ИдентификаторЭтапа);
		МассивСтрок = Объект.ВлияниеНаДругиеПроцессы.НайтиСтроки(ПараметрыОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			МассивВыведенныхШаблонов = Новый Массив; // для исключения дублирования
			СтрокаРезультат = "";
			Для к = 0 По МассивСтрок.Количество()-1 Цикл
				Если МассивВыведенныхШаблонов.Найти(МассивСтрок[к].ЗависимыйШаблон) = Неопределено Тогда
					МассивВыведенныхШаблонов.Добавить(МассивСтрок[к].ЗависимыйШаблон);
					СтрокаРезультат = СтрокаРезультат + МассивСтрок[к].ЗависимыйШаблон+"; ";
				КонецЕсли;
			КонецЦикла;
			СтрокаРезультат = Лев(СтрокаРезультат,СтрДлина(СтрокаРезультат)-2);
		Иначе
			СтрокаРезультат = "Не установлено";
		КонецЕсли;
		Этап.ВлияниеНаПроцессыСтрокой = СтрокаРезультат;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьНомераКартинок(ЭтапЭтапы)
	
	Если ТипЗнч(ЭтапЭтапы) = Тип("ДанныеФормыЭлементКоллекции") Тогда
		МассивЭтапов = Новый Массив;
		МассивЭтапов.Добавить(ЭтапЭтапы);
	Иначе
		МассивЭтапов = ЭтапЭтапы;
	КонецЕсли;
	
	Для Каждого Этап Из МассивЭтапов Цикл
		Если Этап.ВключатьВШтампВизуализацииЭП Тогда
			Если Этап.ТребуетсяЭП Тогда
				Этап.КартинкаЭП = 2;
			ИначеЕсли Этап.ТребуетсяПростаяЭП Тогда
				Этап.КартинкаЭП = 4;
			КонецЕсли;
		ИначеЕсли Этап.ТребуетсяЭП Тогда
			Этап.КартинкаЭП = 1;
		ИначеЕсли Этап.ТребуетсяПростаяЭП Тогда
			Этап.КартинкаЭП = 3;
		Иначе
			Этап.КартинкаЭП = 0;
		КонецЕсли;
		Если Этап.ЗапретитьПроведениеОтменуПроведения Тогда
			Этап.КартинкаПроведение = 3;
		ИначеЕсли Этап.ТребуетсяПроведение = Ложь Тогда
			Этап.КартинкаПроведение = 2;
		ИначеЕсли Этап.ТребуетсяПроведение = Истина Тогда
			Этап.КартинкаПроведение = 1;
		Иначе
			Этап.КартинкаПроведение = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьНаличиеОтсутствующихРеквизитов(Объект)
	
	ЕстьОтстутствующиеВМетаданныхРеквизиты = Справочники.ШаблоныПроцессов.ПроверитьУдалитьНесуществующиеРеквизиты(Объект, "Проверка");
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьОписаниеУсловий() Экспорт
	
	Для Каждого Этап Из Объект.ПредшественникиЭтапов Цикл
		Этап.ОписаниеУсловия = ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(Этап.УсловиеПерехода);
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПодключаемыхОбработчиков()
	
	ОписаниеОбработчиков = ПроцессыОбработкиДокументов.ОписаниеДополнительныхОбработчиков();
	Для Каждого ОписаниеОбработчика Из ОписаниеОбработчиков Цикл
		Если ОписаниеОбработчика.Свойство("ГрупповаяОбработка") И ОписаниеОбработчика.ГрупповаяОбработка Тогда
			ОписаниеОбработчика.Представление = ОписаниеОбработчика.Представление + НСтр("ru = ' (гр.)'");
		КонецЕсли;
		СписокПодключаемыхОбработчиков.Добавить(ОписаниеОбработчика.Идентификатор, ОписаниеОбработчика.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокПоключаемыхКлиентскихОбработчиков()
	
	ОписаниеОбработчиков = ПроцессыОбработкиДокументовКлиент.ОписаниеДополнительныхОбработчиков();
	Для Каждого ОписаниеОбработчика Из ОписаниеОбработчиков Цикл
		СписокПодключаемыхКлиентскихОбработчиков.Добавить(ОписаниеОбработчика.Идентификатор, ОписаниеОбработчика.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИнициирующихСобытий()
	
	ОписаниеСобытий = ПроцессыОбработкиДокументов.ОписаниеСобытийИнициирующихВыполнениеЭтапов();
	Для Каждого ОписаниеСобытия Из ОписаниеСобытий Цикл
		СписокИнициирующихСобытий.Добавить(ОписаниеСобытия.Идентификатор, ОписаниеСобытия.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыЭтапов(ЭтапЭтапы, СтатусыЭтапов)
	
	ЭтапыДляЗапроса = Новый Массив;
	Для Каждого Этап Из ЭтапЭтапы Цикл
		ЭтапыДляЗапроса.Добавить(Этап.Этап);
	КонецЦикла;
	МассивЭлементовКоллекции = ЭтапЭтапы;
	
	СвойстваИСтатусыЭтапов = СвойстваИСтатусыЭтапов(ЭтапыДляЗапроса);
	
	СвойстваЭтапов = СвойстваИСтатусыЭтапов.СвойстваЭтапов;
	
	Для Каждого ЭлементКоллекции Из МассивЭлементовКоллекции Цикл
		
		СвойстваЭтапа = СвойстваЭтапов.Получить(ЭлементКоллекции.Этап);
		
		Если СвойстваЭтапа = Неопределено Тогда
			ЭлементКоллекции.ТребуетсяЭП = Ложь;
			ЭлементКоллекции.ТребуетсяПростаяЭП = Ложь;
			ЭлементКоллекции.ЕстьСкрытыеРезультаты = Ложь;
		Иначе
			ЭлементКоллекции.ТребуетсяЭП = СвойстваЭтапа.ТребуетсяЭП;
			ЭлементКоллекции.ТребуетсяПростаяЭП = СвойстваЭтапа.ТребуетсяПростаяЭП;
			ЭлементКоллекции.ЕстьСкрытыеРезультаты = СвойстваЭтапа.ЕстьСкрытыеРезультаты;
		КонецЕсли;
		
	КонецЦикла;
	
	СтатусыЭтапов = Новый ФиксированноеСоответствие(СвойстваИСтатусыЭтапов.СтатусыЭтапов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитТребуетсяПроведение(Объект)
	
	Для Каждого Этап Из Объект.Этапы Цикл
		ТребуетсяПроведение = Неопределено;
		Для Каждого ТребованиеКПроведению Из Объект.ТребованияКПроведению Цикл
			Если Этап.ИдентификаторЭтапа = ТребованиеКПроведению.ИдентификаторЭтапа Тогда
				Если ТребуетсяПроведение = Неопределено Тогда
					ТребуетсяПроведение = ТребованиеКПроведению.ПризнакПроведенности;
				Иначе
					ТребуетсяПроведение = ТребованиеКПроведению.ПризнакПроведенности ИЛИ ТребуетсяПроведение;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Этап.ТребуетсяПроведение = ТребуетсяПроведение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойстваИСтатусыЭтапов(Этапы)
	
	СвойстваЭтапов = Новый Соответствие;
	СтатусыЭтапов = Новый Соответствие;
	
	Результат = Новый Структура("СвойстваЭтапов, СтатусыЭтапов", СвойстваЭтапов, СтатусыЭтапов);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка КАК Этап,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Статус,
	|	ЭтапыПроцессовРезультатыВыполнения.ТребуетсяЭП КАК ТребуетсяЭП,
	|	ЭтапыПроцессовРезультатыВыполнения.ТребуетсяПростаяЭП КАК ТребуетсяПростаяЭП,
	|	ЭтапыПроцессовРезультатыВыполнения.Скрытый КАК ЕстьСкрытыеРезультаты
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка В(&Ссылка)
	|ИТОГИ
	|	МАКСИМУМ(ТребуетсяЭП),
	|	МАКСИМУМ(ТребуетсяПростаяЭП),
	|	МАКСИМУМ(ЕстьСкрытыеРезультаты)
	|ПО
	|	Этап";
	Запрос.УстановитьПараметр("Ссылка", Этапы);
	
	ВыборкаЭтапы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Этап");
	Пока ВыборкаЭтапы.Следующий() Цикл
		
		СвойстваЭтапов.Вставить(ВыборкаЭтапы.Этап,
			Новый Структура("ТребуетсяЭП, ТребуетсяПростаяЭП, ЕстьСкрытыеРезультаты",
				ВыборкаЭтапы.ТребуетсяЭП, ВыборкаЭтапы.ТребуетсяПростаяЭП, ВыборкаЭтапы.ЕстьСкрытыеРезультаты));
		
		Выборка = ВыборкаЭтапы.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтатусыЭтапа = СтатусыЭтапов.Получить(Выборка.Этап);
			Если СтатусыЭтапа = Неопределено Тогда
				СтатусыЭтапа = Новый Соответствие;
			КонецЕсли;
			СтатусыЭтапа.Вставить(Выборка.Статус, Истина);
			СтатусыЭтапов.Вставить(Выборка.Этап, СтатусыЭтапа);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьВычисляемыеПоля()
	
	ПодписьФайловНастраиваетсяВШаблоне = Константы.ПодписыватьПрисоединенныеФайлы.Получить() И
		Константы.ПодписьФайловНастраиваетсяВШаблоне.Получить();
	
	ЗаполнитьВычисляемыеПоляЭтапов(Объект.Этапы, Объект.ИсполнителиГрупповыхЭтапов);
	
	ЗаполнитьОписаниеУсловий();
	
	ЗаполнитьРеквизитыЭтапов(Объект.Этапы, СтатусыЭтапов);
	ЗаполнитьРеквизитТребуетсяПроведение(Объект);
	
	ЗаполнитьПризнакиОтстутвующихСтатусов(Объект, СтатусыЭтапов);
	
	ВычислитьОписаниеПредшественников(Объект);
	ВычислитьОписаниеОграниченийДоступа(Объект, ПодписьФайловНастраиваетсяВШаблоне);
	ВычислитьОписаниеДополнительныхОбработчиков(Объект, СписокПодключаемыхОбработчиков, СписокПодключаемыхКлиентскихОбработчиков);
	ВычислитьОписаниеИнициирующихСобытий(Объект, СписокИнициирующихСобытий);
	ВычислитьОписаниеВлиянияНаДругиеПроцессы(Объект);
	ВычислитьНаличиеОтсутствующихРеквизитов(Объект);
	ВычислитьНомераКартинок(Объект.Этапы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПризнакиОтстутвующихСтатусов(Объект, СтатусыЭтапов)
	
	ИдентификаторыЭтапов = Новый Соответствие;
	
	Для Каждого Этап Из Объект.Этапы Цикл
		ИдентификаторыЭтапов.Вставить(Этап.ИдентификаторЭтапа, Этап.Этап);
		Этап.ЕстьОтсутствующиеСтатусыВПорядкеВыполнения = Ложь;
		Этап.ЕстьОтсутствующиеСтатусыВНастройкеПроведения = Ложь;
		Этап.ЕстьОтсутствующиеСтатусыВНастройкеВыполнения = Ложь;
		Этап.ЕстьОтсутствующиеСтатусыВНастройкеВлияния = Ложь;
		Этап.ЕстьОтсутствующиеСтатусыВДопОбработчиках = Ложь;
	КонецЦикла;
	
	ЭтапыСОтсутствующимиСтатусамиВПорядкеВыполнения = Новый Соответствие;
	ЭтапыСОтсутствующимиСтатусамиВПНастройкеПроведения = Новый Соответствие;
	ЭтапыСОтсутствующимиСтатусамиВПНастройкеВыполнения = Новый Соответствие;
	ЭтапыСОтсутствующимиСтатусамиВПНастройкеВлияния = Новый Соответствие;
	ЭтапыСОтсутствующимиСтатусамиВДопОбработчиках = Новый Соответствие;
	
	Для Каждого ПредшественникЭтапа Из Объект.ПредшественникиЭтапов Цикл
		Если НЕ ЗначениеЗаполнено(ПредшественникЭтапа.УсловиеРассмотрения) Тогда
			Продолжить;
		КонецЕсли;
		Этап = ИдентификаторыЭтапов[ПредшественникЭтапа.ИдентификаторПредшественника];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(ПредшественникЭтапа.УсловиеРассмотрения) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВПорядкеВыполнения.Вставить(ПредшественникЭтапа.ИдентификаторПоследователя, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Проведение Из Объект.ТребованияКПроведению Цикл
		Этап = ИдентификаторыЭтапов[Проведение.ИдентификаторЭтапа];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(Проведение.Статус) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВПНастройкеПроведения.Вставить(Проведение.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Выполнение Из Объект.ТребованияКВыполнению Цикл
		Этап = ИдентификаторыЭтапов[Выполнение.ИдентификаторЭтапа];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(Выполнение.Статус) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВПНастройкеВыполнения.Вставить(Выполнение.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Влияние Из Объект.ВлияниеНаДругиеПроцессы Цикл
		Этап = ИдентификаторыЭтапов[Влияние.ИдентификаторЭтапа];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(Влияние.Статус) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВПНастройкеВлияния.Вставить(Влияние.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДополнительныйОбработчик Из Объект.ДополнительныеОбработчики Цикл
		Этап = ИдентификаторыЭтапов[ДополнительныйОбработчик.ИдентификаторЭтапа];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(ДополнительныйОбработчик.Статус) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВДопОбработчиках.Вставить(ДополнительныйОбработчик.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ИнициирующееСобытие Из Объект.ИнициирующиеСобытия Цикл
		Этап = ИдентификаторыЭтапов[ИнициирующееСобытие.ИдентификаторЭтапа];
		Если Этап = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если СтатусыЭтапов[Этап].Получить(ИнициирующееСобытие.Статус) = Неопределено Тогда
			ЭтапыСОтсутствующимиСтатусамиВДопОбработчиках.Вставить(ИнициирующееСобытие.ИдентификаторЭтапа, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Этап Из Объект.Этапы Цикл
		Если ЭтапыСОтсутствующимиСтатусамиВПорядкеВыполнения.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Этап.ЕстьОтсутствующиеСтатусыВПорядкеВыполнения = Истина;
		КонецЕсли;
		Если ЭтапыСОтсутствующимиСтатусамиВПНастройкеПроведения.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Этап.ЕстьОтсутствующиеСтатусыВНастройкеПроведения = Истина;
		КонецЕсли;
		Если ЭтапыСОтсутствующимиСтатусамиВПНастройкеВыполнения.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Этап.ЕстьОтсутствующиеСтатусыВНастройкеВыполнения = Истина;
		КонецЕсли;
		Если ЭтапыСОтсутствующимиСтатусамиВПНастройкеВлияния.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Этап.ЕстьОтсутствующиеСтатусыВНастройкеВлияния = Истина;
		КонецЕсли;
		Если ЭтапыСОтсутствующимиСтатусамиВДопОбработчиках.Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
			Этап.ЕстьОтсутствующиеСтатусыВДопОбработчиках = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСхемуНаСервере()
	
	СхемаШаблона = ПроцессыОбработкиДокументов.СформироватьГрафическуюСхему(Объект, ГиперссылкиЭлементовСхемы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеОшибочноДоступныхРеквизитов(Отказ)
	
	// проверка на наличие доступных реквизитов на более поздних этапах, чем была установлена ответственность
	ОшибочноДоступныеРеквизиты = Новый Массив;
	
	НесвязанныеЭтапы = ВсеНесвязанныеЭтапыШаблона();
	
	Для Каждого ОтветственностьЗаРеквизит Из Объект.ОтветственностьЗаРеквизиты Цикл
		
		ДанныеЭтапа = Объект.Этапы.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", ОтветственностьЗаРеквизит.ИдентификаторЭтапа));
		ПорядокОтветственности = ДанныеЭтапа[0].Порядок;
		
		Для Каждого Этап Из Объект.Этапы Цикл
			
			Если Этап.Порядок < ПорядокОтветственности
				ИЛИ ОтветственностьЗаРеквизит.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа Тогда
				Продолжить;
			КонецЕсли;
			
			// Если этап не связан по маршруту с текущим, то для них допускается доступность одних и тех же реквизитов
			Если НесвязанныеЭтапы[ОтветственностьЗаРеквизит.ИдентификаторЭтапа].Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
			ПараметрыОтбора.Вставить("ИмяТабличнойЧасти", ОтветственностьЗаРеквизит.ИмяТабличнойЧасти);
			ПараметрыОтбора.Вставить("ИмяРеквизита", ОтветственностьЗаРеквизит.ИмяРеквизита);
			Строки = Объект.НедоступныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
			
			Если Строки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыДоступногоРеквизита = Новый Структура;
			ПараметрыДоступногоРеквизита.Вставить("НомерЭтапа", Этап.НомерСтроки);
			ПараметрыДоступногоРеквизита.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
			ПараметрыДоступногоРеквизита.Вставить("Этап", Этап.Этап);
			ПараметрыДоступногоРеквизита.Вставить("ИмяТабличнойЧасти", ОтветственностьЗаРеквизит.ИмяТабличнойЧасти);
			ПараметрыДоступногоРеквизита.Вставить("ИмяРеквизита", ОтветственностьЗаРеквизит.ИмяРеквизита);
			
			ОшибочноДоступныеРеквизиты.Добавить(ПараметрыДоступногоРеквизита);
			
		КонецЦикла;
	КонецЦикла;
	
	// проверка на наличие доступных реквизитов первичных документов на более поздних этапах, чем была установлена ответственность
	ОшибочноДоступныеРеквизитыПД = Новый Массив;
	
	НесвязанныеЭтапы = ВсеНесвязанныеЭтапыШаблона();
	
	Для Каждого ОтветственностьЗаРеквизит Из Объект.ОтветственностьПервичныеДокументы Цикл
		
		ДанныеЭтапа = Объект.Этапы.НайтиСтроки(Новый Структура("ИдентификаторЭтапа", ОтветственностьЗаРеквизит.ИдентификаторЭтапа));
		ПорядокОтветственности = ДанныеЭтапа[0].Порядок;
		
		Для Каждого Этап Из Объект.Этапы Цикл
			
			Если Этап.Порядок < ПорядокОтветственности
				ИЛИ ОтветственностьЗаРеквизит.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа Тогда
				Продолжить;
			КонецЕсли;
			
			// Если этап не связан по маршруту с текущим, то для них допускается доступность одних и тех же реквизитов
			Если НесвязанныеЭтапы[ОтветственностьЗаРеквизит.ИдентификаторЭтапа].Получить(Этап.ИдентификаторЭтапа) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
			ПараметрыОтбора.Вставить("ИдентификаторПечатнойФормы", ОтветственностьЗаРеквизит.ИдентификаторПечатнойФормы);
			ПараметрыОтбора.Вставить("ИмяТабличнойЧасти", ОтветственностьЗаРеквизит.ИмяТабличнойЧасти);
			ПараметрыОтбора.Вставить("ИмяРеквизита", ОтветственностьЗаРеквизит.ИмяРеквизита);
			Строки = Объект.НедоступностьПервичныеДокументы.НайтиСтроки(ПараметрыОтбора);
			
			Если Строки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыДоступногоРеквизита = Новый Структура;
			ПараметрыДоступногоРеквизита.Вставить("НомерЭтапа", Этап.НомерСтроки);
			ПараметрыДоступногоРеквизита.Вставить("ИдентификаторЭтапа", Этап.ИдентификаторЭтапа);
			ПараметрыДоступногоРеквизита.Вставить("Этап", Этап.Этап);
			ПараметрыДоступногоРеквизита.Вставить("ИдентификаторПечатнойФормы", ОтветственностьЗаРеквизит.ИдентификаторПечатнойФормы);
			ПараметрыДоступногоРеквизита.Вставить("ИмяТабличнойЧасти", ОтветственностьЗаРеквизит.ИмяТабличнойЧасти);
			ПараметрыДоступногоРеквизита.Вставить("ИмяРеквизита", ОтветственностьЗаРеквизит.ИмяРеквизита);
			
			ОшибочноДоступныеРеквизитыПД.Добавить(ПараметрыДоступногоРеквизита);
			
		КонецЦикла;
	КонецЦикла;
	
	Если ОшибочноДоступныеРеквизиты.Количество() = 0 И ОшибочноДоступныеРеквизитыПД.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Показать реквизиты'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	
	Если ОшибочноДоступныеРеквизиты.Количество() > 0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросОбИсправленииДоступности",
			ЭтотОбъект,
			ОшибочноДоступныеРеквизиты);
		
		ТекстВопроса = НСтр("ru = 'Запись шаблона не возможна.
			|В шаблоне есть реквизиты, которые доступны для изменения на более поздних этапах, чем установлена ответственность.
			|Снять признаки редактирования/изменения для таких реквизитов автоматически и продолжить запись?'");
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросОбИсправленииДоступностиПД",
			ЭтотОбъект,
			ОшибочноДоступныеРеквизитыПД);
		
		ТекстВопроса = НСтр("ru = 'Запись шаблона не возможна.
			|В шаблоне есть реквизиты первичных документов, которые доступны для изменения на более поздних этапах, чем установлена ответственность.
			|Снять признаки редактирования/изменения для таких реквизитов автоматически и продолжить запись?'");
		
	КонецЕсли;
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИсправленииДоступности(Результат, ОшибочноДоступныеРеквизиты) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого ОшибочноДоступныйРеквизит Из ОшибочноДоступныеРеквизиты Цикл
			ЗаполнитьЗначенияСвойств(Объект.НедоступныеРеквизиты.Добавить(), ОшибочноДоступныйРеквизит)
		КонецЦикла;
		
		Записать();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Для Каждого ОшибочноДоступныйРеквизит Из ОшибочноДоступныеРеквизиты Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для реквизита ""%1%2"" требуется снять возможность изменения на этапе ""%3.%4""'"),
				?(ПустаяСтрока(ОшибочноДоступныйРеквизит.ИмяТабличнойЧасти), "", ОшибочноДоступныйРеквизит.ИмяТабличнойЧасти + "."),
				ОшибочноДоступныйРеквизит.ИмяРеквизита,
				ОшибочноДоступныйРеквизит.НомерЭтапа,
				ОшибочноДоступныйРеквизит.Этап);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИсправленииДоступностиПД(Результат, ОшибочноДоступныеРеквизиты) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого ОшибочноДоступныйРеквизит Из ОшибочноДоступныеРеквизиты Цикл
			ЗаполнитьЗначенияСвойств(Объект.НедоступностьПервичныеДокументы.Добавить(), ОшибочноДоступныйРеквизит)
		КонецЦикла;
		
		Записать();
		
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		
		Для Каждого ОшибочноДоступныйРеквизит Из ОшибочноДоступныеРеквизиты Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для реквизита ""%1%2"" первичного документа ""%3"" требуется снять возможность изменения на этапе ""%4.%5""'"),
				?(ПустаяСтрока(ОшибочноДоступныйРеквизит.ИмяТабличнойЧасти), "", ОшибочноДоступныйРеквизит.ИмяТабличнойЧасти + "."),
				ОшибочноДоступныйРеквизит.ИмяРеквизита,
				ОшибочноДоступныйРеквизит.ИдентификаторПечатнойФормы,
				ОшибочноДоступныйРеквизит.НомерЭтапа,
				ОшибочноДоступныйРеквизит.Этап);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеЗапущенныхПроцессовИУдаленныхЭтапов(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЗаписьРазрешена")
		ИЛИ НЕ Модифицированность
		ИЛИ Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеИдентификаторы = Новый Соответствие;
	Для Каждого Этап Из Объект.Этапы Цикл
		ТекущиеИдентификаторы.Вставить(Этап.ИдентификаторЭтапа, Истина);
	КонецЦикла;
	
	ЕстьУдаленныеЭтапы = Ложь;
	Для Каждого ИдентификаторИзБД Из ИдентификаторыЭтаповШаблонаПроцесса(Объект.Ссылка) Цикл
		Если ТекущиеИдентификаторы[ИдентификаторИзБД] = Неопределено Тогда
			ЕстьУдаленныеЭтапы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЕстьУдаленныеЭтапы Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьЗапущенныеБизнесПроцессыПоШаблону(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПослеОтветаНаВопросОЗаписиСУдаленнымиЭтапами",
		ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru = 'В шаблоне процесса были удалены этапы.
		|Запись шаблона может привести к неработоспособности уже запущенных процессов обработки документов.
		|Продолжить запись?'");
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторыЭтаповШаблонаПроцесса(ШаблонСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа КАК ИдентификаторЭтапа
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", ШаблонСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторЭтапа");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьЗапущенныеБизнесПроцессыПоШаблону(ШаблонСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ТекущиеСтатусыДокументов КАК ТекущиеСтатусыДокументов
	|ГДЕ
	|	ТекущиеСтатусыДокументов.Шаблон = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", ШаблонСсылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписиСУдаленнымиЭтапами(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПараметрыЗаписи = Новый Структура("ЗаписьРазрешена");
		Записать(ПараметрыЗаписи);
		
		//Если ДополнительныеПараметры.ЗакрытьФорму Тогда
		//	Закрыть();
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНедоступностьРеквизитовПоУмолчанию(СтрокаЭтапа)
	
	Для Каждого Ответственность Из Объект.ОтветственностьЗаРеквизиты Цикл
		НовыйРеквизит = Объект.НедоступныеРеквизиты.Добавить();
		НовыйРеквизит.ИдентификаторЭтапа = СтрокаЭтапа.ИдентификаторЭтапа;
		НовыйРеквизит.ИмяТабличнойЧасти = Ответственность.ИмяТабличнойЧасти;
		НовыйРеквизит.ИмяРеквизита = Ответственность.ИмяРеквизита;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьНесуществующиеРеквизитыНаСервере()
	Справочники.ШаблоныПроцессов.ПроверитьУдалитьНесуществующиеРеквизиты(Объект, "Удаление");
КонецПроцедуры

&НаСервере
Функция ЭтапыНеИмеющиеОбщегоМаршрутаСЭтапом(ИдентификаторЭтапа)
	
	Возврат Справочники.ШаблоныПроцессов.ЭтапыНеИмеющиеОбщегоМаршрутаСЭтапом(Объект, ИдентификаторЭтапа);
	
КонецФункции

&НаСервере
Функция ВсеНесвязанныеЭтапыШаблона()
	
	Возврат Справочники.ШаблоныПроцессов.ВсеНесвязанныеЭтапыШаблона(Объект);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеИсполнителя(ТекущиеДанные, ИсполнителиГрупповыхЭтапов)
	
	Если ТекущиеДанные.ЭтапВыполняетсяНесколькимиИсполнителями Тогда
		ИсполнителиЭтапаСтрокой = Новый Массив;
		Для Каждого Исполнитель Из ИсполнителиГрупповыхЭтапов Цикл
			Если Исполнитель.ИдентификаторЭтапа <> ТекущиеДанные.ИдентификаторЭтапа Тогда
				Продолжить;
			КонецЕсли;
			ИсполнителиЭтапаСтрокой.Добавить(ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
				Исполнитель.Исполнитель,
				Исполнитель.ОсновнойОбъектАдресации,
				Исполнитель.ДополнительныйОбъектАдресации,
				Исполнитель.ИмяРеквизитаОсновногоОбъектаАдресации,
				Исполнитель.ИмяРеквизитаДополнительногоОбъектаАдресации));
		КонецЦикла;
		ТекущиеДанные.ИсполнительЭтапаСтрокой = НСтр("ru = 'Параллельно: '") + СтрСоединить(ИсполнителиЭтапаСтрокой, "; ");
	Иначе
		ТекущиеДанные.ИсполнительЭтапаСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
			ТекущиеДанные.Исполнитель,
			ТекущиеДанные.ОсновнойОбъектАдресации,
			ТекущиеДанные.ДополнительныйОбъектАдресации,
			ТекущиеДанные.ИмяРеквизитаОсновногоОбъектаАдресации,
			ТекущиеДанные.ИмяРеквизитаДополнительногоОбъектаАдресации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРежимРедактированияСхемы(Элементы)
	
	Элементы.СхемаШаблона.Редактирование = Элементы.РедактированиеСхемы.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсполнителяЭтапа(ТекущиеДанные)
	
	ТекущиеДанные.Исполнитель = "";
	ТекущиеДанные.ОсновнойОбъектАдресации = "";
	ТекущиеДанные.ДополнительныйОбъектАдресации = "";
	ТекущиеДанные.ИмяРеквизитаОсновногоОбъектаАдресации = "";
	ТекущиеДанные.ИмяРеквизитаДополнительногоОбъектаАдресации = "";
	
	ТекущиеДанные.ЭтапВыполняетсяНесколькимиИсполнителями = Ложь;
	ТекущиеДанные.ИдентификаторЭтапаКуратора = "";
	
	МассивЭлементовКУдалению = Новый Массив;
	Для Каждого Элемент Из Объект.ИсполнителиГрупповыхЭтапов Цикл
		Если Элемент.ИдентификаторЭтапа = ТекущиеДанные.ИдентификаторЭтапа Тогда
			МассивЭлементовКУдалению.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из МассивЭлементовКУдалению Цикл
		Объект.ИсполнителиГрупповыхЭтапов.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьФункцийПоЭтапам()
	
	Если Объект.Этапы.Количество() > 0 Тогда
		ДоступныеФункции = ПолучитьФункцииИсполнителей();
		
		Для Каждого СтрокаЭтапа Из Объект.Этапы Цикл
			Если СтрокаЭтапа.ЭтапВыполняетсяНесколькимиИсполнителями Тогда
				Для Каждого ИсполнительГрупповогоЭтапа Из Объект.ИсполнителиГрупповыхЭтапов Цикл
					Если ИсполнительГрупповогоЭтапа.ИдентификаторЭтапа = СтрокаЭтапа.ИдентификаторЭтапа 
						И ИсполнительГрупповогоЭтапа.Исполнитель = "(функция)" ИЛИ СтрокаЭтапа.Исполнитель = Неопределено Тогда
							Если НЕ ЗначениеЗаполнено(ДоступныеФункции) 
								ИЛИ НЕ ЗначениеЗаполнено(ИсполнительГрупповогоЭтапа.ИмяРеквизитаОсновногоОбъектаАдресации)
								ИЛИ ДоступныеФункции.Найти(ИсполнительГрупповогоЭтапа.ИмяРеквизитаОсновногоОбъектаАдресации) = Неопределено Тогда
								
								ОчиститьИсполнителяЭтапа(СтрокаЭтапа);
								ЗаполнитьПредставлениеИсполнителя(СтрокаЭтапа, Объект.ИсполнителиГрупповыхЭтапов);
								Прервать;
							КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли СтрокаЭтапа.Исполнитель = "(функция)" ИЛИ СтрокаЭтапа.Исполнитель = Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(ДоступныеФункции) 
					ИЛИ НЕ ЗначениеЗаполнено(СтрокаЭтапа.ИмяРеквизитаОсновногоОбъектаАдресации)
					ИЛИ ДоступныеФункции.Найти(СтрокаЭтапа.ИмяРеквизитаОсновногоОбъектаАдресации) = Неопределено Тогда
					
					ОчиститьИсполнителяЭтапа(СтрокаЭтапа);
					ЗаполнитьПредставлениеИсполнителя(СтрокаЭтапа, Объект.ИсполнителиГрупповыхЭтапов);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФункцииИсполнителей()
	
	ИмяИдентификатораДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИдентификаторДокумента, "ПолноеИмя");
	
	ОписаниеФункций = ПроцессыОбработкиДокументов.ОписаниеФункцийОпределенияИсполнителейЭтапа();
	
	ДоступныеФункции = Новый Массив;
	
	Для Каждого ОписаниеФункции Из ОписаниеФункций Цикл
		ИменаВлияющихОбъектовМетаданных = СтрРазделить(ОписаниеФункции.ОбъектыМетаданных, "," + Символы.ПС, Ложь);
		Если НЕ ИменаВлияющихОбъектовМетаданных.Найти(ИмяИдентификатораДокумента) = Неопределено Тогда
			ДоступныеФункции.Добавить(ОписаниеФункции.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДоступныеФункции;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОтветНаВопросОчисткаСроковОбработкиПоРеквизиту(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ОтветНаВопрос = Результат.Значение;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда 
		ОтветНаВопрос = Результат;
	Иначе 
		Объект.ИспользоватьРеквизитДляРасчетаСроковОбработки = Истина;
	КонецЕсли;
	
	Если ОтветНаВопрос = "Очистить" Тогда
		
		 Для Каждого СтрокаЭтап из Объект.Этапы Цикл
			
			Если ЗначениеЗаполнено(СтрокаЭтап.СрокиОбработкиПоРеквизитуДни) Тогда
				СтрокаЭтап.СрокиОбработкиПоРеквизитуДни = 0;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаЭтап.СрокиОбработкиПоРеквизитуЧасы) Тогда
				СтрокаЭтап.СрокиОбработкиПоРеквизитуЧасы = 0;
			КонецЕсли;
			
		КонецЦикла;
		
		Объект.РеквизитДляРасчетаСроковОбработки = "";
		ВидимостьСрокиОбработкиПоРеквизиту = ?(Объект.ИспользоватьРеквизитДляРасчетаСроковОбработки, Истина, Ложь);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуДни", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуЧасы", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);
		
    ИначеЕсли  ОтветНаВопрос = "Отмена" Тогда

		Объект.ИспользоватьРеквизитДляРасчетаСроковОбработки = Истина;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокРеквизитовДляРасчетаСроковОбработки()
	
	Если Константы.ИспользоватьРеквизитыДокументовДляРасчетаСроковОбработки.Получить() 
		И ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		
		ИдентификаторДокумента = Объект.ИдентификаторДокумента;
		ТипДата = Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
		ТипДатаВремя = Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		
		СписокВыбораВВидеМасива = Новый Массив; 
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
		Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл 
			
			Если Реквизит.Тип = ТипДата Или Реквизит.Тип=ТипДатаВремя Тогда
				Если Не СтрНайти(Реквизит.Имя,"Удалить",,1) > 0 Тогда 
					СписокВыбораВВидеМасива.Добавить(Реквизит.Имя);
					Элементы.РеквизитДляРасчетаСроковОбработки.СписокВыбора.Добавить(Реквизит.Имя, 
																			Реквизит.Синоним + " ["+Реквизит.Имя+"]");
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
		ВидимостьСрокиОбработкиПоРеквизиту = ?(Объект.ИспользоватьРеквизитДляРасчетаСроковОбработки, Истина, Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "РеквизитДляРасчетаСроковОбработки", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту); 
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуДни", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);
	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЭтапыСрокиОбработкиПоРеквизитуЧасы", "Видимость", ВидимостьСрокиОбработкиПоРеквизиту);

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСвойствЭлементовФормы(СтруктураЭлементов, ИдентификаторЭтапа)
	МассивЭлементов = Новый Массив;
	МассивСтраницаРодитель = Новый Массив;
	ЗначениеСтраницыПоУмолчанию = Неопределено;

	//удаление всех элементов текущего этапа
	КоличествоЭлементов = Объект.УправлениеЭлементамиФормы.Количество() - 1;
	ИндексСтроки = КоличествоЭлементов;
	Для Счетчик = 0 по КоличествоЭлементов Цикл
		Запись = Объект.УправлениеЭлементамиФормы.Получить(ИндексСтроки);
		Если Запись.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			Объект.УправлениеЭлементамиФормы.Удалить(Запись);
		КонецЕсли;
		ИндексСтроки = ИндексСтроки - 1;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтруктураЭлементов.СтартоваяСтраница) 
		И СтруктураЭлементов.СтартоваяСтраница.Количество() = 2  Тогда
		МассивСтраницаРодитель.Добавить(СтруктураЭлементов.СтартоваяСтраница[0]);
		ЗначениеСтраницыПоУмолчанию = СтруктураЭлементов.СтартоваяСтраница[1];
	КонецЕсли;
	
	МассивНедоступныхЭлементов = СтруктураЭлементов.НедоступныеЭлементы; 
	МассивНевидимыхЭлементов = СтруктураЭлементов.НевидимыеЭлементы;
	МассивЭлементовСОтметкойНезаполненного = СтруктураЭлементов.ЭлементыСОтметкойНезаполненного;
	

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЭлементов, МассивНедоступныхЭлементов, Истина); 
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЭлементов, МассивНевидимыхЭлементов, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЭлементов, МассивЭлементовСОтметкойНезаполненного, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивЭлементов, МассивСтраницаРодитель, Истина);

	Для Каждого СохраняемыйЭлемент Из МассивЭлементов Цикл
		
		Отбор = Новый Структура("ИдентификаторЭтапа, ИмяЭлемента", ИдентификаторЭтапа, СохраняемыйЭлемент);
		НайденныеСтроки = Объект.УправлениеЭлементамиФормы.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НовыйЭлемент = Объект.УправлениеЭлементамиФормы.Добавить();
			НовыйЭлемент.ИмяЭлемента = СохраняемыйЭлемент;
			НовыйЭлемент.ИдентификаторЭтапа = ИдентификаторЭтапа;
			
		Иначе
			НовыйЭлемент = НайденныеСтроки[0];
		КонецЕсли;
		
		НовыйЭлемент.ЗапретДоступности = МассивНедоступныхЭлементов.Найти(СохраняемыйЭлемент) <> Неопределено;
		НовыйЭлемент.ЗапретВидимости = МассивНевидимыхЭлементов.Найти(СохраняемыйЭлемент) <> Неопределено;
		НовыйЭлемент.ОтметкаНезаполненного = МассивЭлементовСОтметкойНезаполненного.Найти(СохраняемыйЭлемент) <> Неопределено;
		Если МассивСтраницаРодитель.Найти(СохраняемыйЭлемент) <> Неопределено 
			И ЗначениеЗаполнено(ЗначениеСтраницыПоУмолчанию) Тогда
			НовыйЭлемент.СтартоваяСтраница = ЗначениеСтраницыПоУмолчанию;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
