// @strict-types

#Область СлужебныеПроцедурыИФункции

// Госорган по имени типа.
// 
// Параметры:
//  ИмяТипа - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ГосорганПоИмениТипа(ИмяТипа) Экспорт
	
	Результат = "";
	
	Если ИмяТипа = "ДокументОбъект.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.РеестрДанныхЭЛНЗаполняемыхРаботодателем" Тогда
		Результат = "ФСС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий" Тогда
		Результат = "ФСС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ЗаявлениеСотрудникаНаВыплатуПособия" Тогда
		Результат = "ФСС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.СведенияОЗастрахованныхЛицахСЗВ_М" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов" Тогда
		Результат = "ФСС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.СведенияДляИсчисленияДоплатыКПенсииСЗВ_ДСО" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.РеестрДСВ_3" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ОписьОДВ_1" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.СведенияОДоходахСотрудникаДляСоцВыплат" Тогда
		Результат = "ФНС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ" Тогда
		Результат = "ФНС";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ПачкаДокументовАДВ_1" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ПачкаДокументовАДВ_2" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ПачкаДокументовАДВ_3" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ПачкаДокументовДСВ_1" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.ПачкаДокументовСЗВ_К" Тогда
		Результат = "ПФР";
	ИначеЕсли ИмяТипа = "ДокументОбъект.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ" Тогда
		Результат = "ПФР";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
