#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Записывает ключи доступа к сервису семантического анализа в регистр.
// 
// Параметры:
//  КлючиДоступа - РегистрСведенийМенеджерЗаписи.КлючиДоступаСервисаСемантическогоАнализа - КлючиДоступа.
Процедура УстановитьКлючиДоступа(КлючиДоступа) Экспорт
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.КлючиДоступаСервисаСемантическогоАнализа");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НаборЗаписей.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НаборЗаписей[0], КлючиДоступа);
		НаборЗаписей.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает ключи доступа к сервису семантического анализа.
// 
// Возвращаемое значение:
//  РегистрСведенийМенеджерЗаписи.КлючиДоступаСервисаСемантическогоАнализа - Ключи доступа.
Функция КлючиДоступа() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.ИдентификаторПриложения, """") КАК ИдентификаторПриложения,
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.КлючДоступа, """") КАК КлючДоступа,
		|	ЕСТЬNULL(КлючиДоступаСервисаСемантическогоАнализа.КлючИзменения, """") КАК КлючИзменения
		|ИЗ
		|	РегистрСведений.КлючиДоступаСервисаСемантическогоАнализа КАК КлючиДоступаСервисаСемантическогоАнализа";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.СоздатьМенеджерЗаписи();
	Иначе
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли