
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтоПодразделенияФРМО() Тогда
		НастроитьКакПодразделенияФРМО();
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЭлементыКлассификатора, "Владелец", Объект.Ссылка);
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "ЭлементыКлассификатора");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоПодразделенияФРМО()
	
	Описание = Медицина.ОписаниеКлассификатораПодразделений();
	Возврат Объект.Код = Описание.Код;
	
КонецФункции

Процедура НастроитьКакПодразделенияФРМО()
		
	ЗначенияДляЗаполнения = Новый Структура("Организация", "Организация");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	Справочники.КлассификаторыФедеральныхМедрегистров.УстановитьОтборПоOIDОрганизации(ЭлементыКлассификатора, Организация);
	
КонецПроцедуры

#КонецОбласти
