#Область ПрограммныйИнтерфейс

// Модуль предназначен для описания дополнительных обработчиков, которые впоследствии могут быть указаны в шаблонах процессов.
// Дополнительные обработчики выполняются на клиенте до начала транзакции обработчика выполнения этапа процесса.
// 
// Модуль обязательно должен содержать в неизменном виде процедуру ОписаниеДополнительныхОбработчиков и процедуру ВыполнитьДополнительныйОбработчик.
// 
// Объявление обработчиков производится в процедуре ОписаниеДополнительныхОбработчиков.
// Код обработчика должен быть описан в этом модуле в виде отдельной экспортной процедуры, имя которой должно
// совпадать с идентификатором обработчика.
// Обработчик должен содержать 2 входящих параметра, пример имен: "Результат" и "Параметры"
// 
// ВНИМАНИЕ! При окончании выполнения кода обработчика необходимо вызвать процедуру продолжения выполнения задачи
// ПроцессыОбработкиДокументовКлиент.ПродолжитьВыполнениеЗадачи(Параметры),
// где в качестве параметра необходимо передать второй входящий параметр обработчика
// При отсутствии данной процедуры выполнение этапа будет прервано, этап будет не выполнен.

// Позволяет дополнить массив МассивОбработчиков объявлениями дополнительных обработчиков из текущего модуля
// 
// Параметры:
//   МассивОбработчиков - Массив - массив структур с ключами:
//     * Идентификатор - Строка - строковый идентификтор обработчика, должен быть уникален.
//     * Представление - Строка - представление обработчика в формах.
//     * ОбъектыМетаданных - Строка - (необязательный) - имена объектов метаданных, которые можно использовать в функции Метаданные.НайтиПоПолномуИмени(),
//                           записанные в виде строки с разделителями "," и/или перевод строки.
//                           Используется для ограничения списка выбора дополнительных обработчиков при настройке шаблонов процессов.
//                           Если свойство отсутствует или не заполнено, то обработчик будет доступен для выбора во всех шаблонах
//
// Пример: 
//   
//   НовыйОбработчик = Новый Структура;
//   НовыйОбработчик.Вставить("Идентификатор", "СообщитьНазваниеДокумента");
//   НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Сообщить название документа'"));
//   НовыйОбработчик.Вставить("ОбъектыМетаданных", "Документ.ЗаявкаНаКассовыйРасход,
//                                                 |Документ.ЗаявкаНаКассовыйРасходСокращенная");
//   МассивОбработчиков.Добавить(НовыйОбработчик);
//
Процедура ОписаниеДополнительныхОбработчиков(МассивОбработчиков) Экспорт
	
	//НовыйОбработчик = Новый Структура;
	//НовыйОбработчик.Вставить("Идентификатор", "СообщитьНазваниеДокумента");
	//НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Сообщить название документа'"));
	//НовыйОбработчик.Вставить("ОбъектыМетаданных", "Документ.ЗаявкаНаКассовыйРасход,
	//											|Документ.ЗаявкаНаКассовыйРасходСокращенная");
	//
	//МассивОбработчиков.Добавить(НовыйОбработчик);
	
КонецПроцедуры

Процедура ВыполнитьДополнительныйОбработчик(Идентификатор, Параметры) Экспорт
	
	Обработчик = Новый ОписаниеОповещения(Идентификатор, ЭтотОбъект, Параметры);
	
	ВыполнитьОбработкуОповещения(Обработчик);
	
КонецПроцедуры

////////////////////////////////////////////////////////////

// Пример процедуры дополнительного обработчика.
// Для использования необходимо в процедуре ОписаниеДополнительныхОбработчиков вставить объявление обработчика:
//
//   НовыйОбработчик = Новый Структура;
//   НовыйОбработчик.Вставить("Идентификатор", "СообщитьНазваниеДокумента");
//   НовыйОбработчик.Вставить("Представление", НСтр("ru = 'Сообщить название документа'"));
//   МассивОбработчиков.Добавить(НовыйОбработчик);
//
// Код обработчика выполняется на клиенте до начала транзакции обработчика выполнения этапа процесса.
// Параметры:
//   Результат - Не определено - служебный параметр.
//   Параметры - Структура - служебный параметр.
//     * Источник - ДокументСсылка - для доступа к контексту документа
//     * Форма - УправляемаяФорма - для доступа к контексту формы
//                  Передается форма списка задач либо форма документа, в зависимости от точки вызова (места нажатия на кнопку выполнения этапа)
//     * Отказ - Булево - признак отказа от выполнения этапа. При установке значения Ложь транзакция выполнения задачи не будет запущена
//     * ОписаниеОшибки - Строка - информация об ошибке, причинах отказа от выполнения этапа
//     * ДополнительныеПараметры - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                  Параметр передается между обработчиками в контексте обрабатываемого документа Источник
//     * ДополнительныйКонтекст - Произвольный - параметр, доступный для использования в дополнительных обработчиках выполнения задачи по этапу.
//                  Параметр является глобальным для всех обработчиков, вызываемых в рамках одновременного выполнения нескольких задач (из формы списка задач)
//     * <остальные свойства> - другие свойства служебные и не должны редактироваться
//
Процедура СообщитьНазваниеДокумента(Результат, Параметры) Экспорт
	
	ДокументСсылка = Параметры.Источник;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(ДокументСсылка));
	
	ПроцессыОбработкиДокументовКлиент.ПродолжитьВыполнениеЗадачи(Параметры);
	
КонецПроцедуры

#КонецОбласти
