
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭтапа = Параметры.ИдентификаторТекущегоЭтапа;
	ВладелецЭтапа = Параметры.ВладелецЭтапа;
	ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	
	ТекущийЭтапСтрокой = "№" + Параметры.НомерТекущегоЭтапа + " " + Параметры.НаименованиеТекущегоЭтапа;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Настройка ответственности для этапа ""%1""'"),
		ТекущийЭтапСтрокой);
	
	ЗапретитьПроведениеОтменуПроведения = Параметры.ЗапретитьПроведениеОтменуПроведения;
	ЗапретитьПерепроведение = Параметры.ЗапретитьПерепроведение;
	ВключатьВШтампВизуализацииЭП = Параметры.ВключатьВШтампВизуализацииЭП;
	ОбособленнаяЗонаОтветственности = Параметры.ОбособленнаяЗонаОтветственности;
	
	ИдентификаторыКомандПечатиСоШтампом = Параметры.ИдентификаторыКомандПечатиСоШтампом;
	ВсеФормы = ПустаяСтрока(ИдентификаторыКомандПечатиСоШтампом) И ВключатьВШтампВизуализацииЭП;

	КодыНастройкиФормированияИПодписанияФормуляров = Параметры.КодыНастройкиФормированияИПодписанияФормуляров;

	ЗапрещеноДобавлениеФайлов = Параметры.ЗапрещеноДобавлениеФайлов;
	ЗапрещеноИзменениеФайлов = Параметры.ЗапрещеноИзменениеФайлов;
	НаличиеФайловОбязательно = Параметры.НаличиеФайловОбязательно;
	ПодписыватьФайлыЭП = Параметры.ПодписыватьФайлыЭП;

	ФормированиеФормуляровВключено = ПроцессыОбработкиДокументов.ВключенаПоддержкаФормированияИПодписанияФормуляров();
	
	ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа = Параметры.ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа;
	
	ЕстьЗамечанияКИнтеграцииМеханизмаФормированияФормуляров = ЕстьЗамечанияКИнтеграцииМеханизмаФормированияФормуляров();
	
	ОбменСЛичнымКабинетом = Параметры.ОбменСЛичнымКабинетом;
	
	ЗаполнитьДеревоРеквизитов(Параметры.ВладелецЭтапаОбъект);
	
	ОтметитьРеквизитыСогласноСписку(
		Параметры.ОтмеченныеРеквизитыОтветственность,
		Параметры.ОтмеченныеРеквизитыИзменение,
		Параметры.НедоступныеРеквизитыОтветственность,
		Параметры.НедоступныеРеквизитыДоступность,
		Параметры.ОтмеченныеОбязательныеРеквизиты,
		Параметры.ОтмеченныеНедоступныеРеквизиты);
	
	ЗаполнитьПервичныеДокументы(Параметры.ВладелецЭтапаОбъект);
	
	ОтметитьПервичныеДокументыСогласноСписку(
		Параметры.ПервичныеДокументыОтветственность,
		Параметры.НедоступныеПервичныеДокументыОтветственность,
		Параметры.ПервичныеДокументыНедоступность,
		Параметры.ПервичныеДокументыОбязательность);
		
	РасшифровкаОбязательныхПрисоединенныхФайлов = Параметры.РасшифровкаОбязательныхПрисоединенныхФайлов;
	
	РасшифровкаПрисоединенныхФайлов.ЗагрузитьЗначения(СтрРазделить(РасшифровкаОбязательныхПрисоединенныхФайлов, ";", Ложь));
	
	ПроцессыОбработкиДокументов.ПриПолученииФормыВидовПрисоединенныхФайлов(НаименованиеФормыВыбораВидовПрисоединенныхФайлов);
	
	ВидимостьГруппыЭП = ?(Параметры.ТребуетсяЭП, Истина, Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПервичныеДокументыНастройкаФормированияИПодписанияФормуляра",
		"Видимость",
		ФормированиеФормуляровВключено);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаЭП",
		"Видимость",
		ВидимостьГруппыЭП);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаПервичныеДокументы",
		"Видимость",
		ВидимостьГруппыЭП);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтстутствующиеРеквизиты",
		"Видимость",
		Справочники.ШаблоныПроцессов.ПроверитьУдалитьНесуществующиеРеквизиты(Параметры.ВладелецЭтапаОбъект));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПодписыватьФайлыЭП",
		"Видимость",
		ВидимостьГруппыЭП
		И Константы.ПодписыватьПрисоединенныеФайлы.Получить()
		И Константы.ПодписьФайловНастраиваетсяВШаблоне.Получить());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"СтраницаОбменСЛичнымКабинетом",
		"Видимость",
		Константы.ИспользоватьОбменСЛичнымКабинетомПОД.Получить());
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ПредставлениеПечатныхФорм",
		"Доступность",
		ВключатьВШтампВизуализацииЭП);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
										Элементы,
										"РасшифровкаПрисоединенныхФайлов",
										"Видимость",
										НаличиеФайловОбязательно);
	
	ЗаполнитьТаблицуРезультатовВыполнения();
	
	Если ЗначениеЗаполнено(Параметры.СтартоваяСтраницаФормы) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[Параметры.СтартоваяСтраницаФормы];
	КонецЕсли; 
	
	ЗаполнитьНастройкиУправленияСвойствамиЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФлагамиДереваРеквизитов("Все");
	УправлениеФлагамиДереваПервичныхДокументов("Все");
	
	УправлениеДоступностьюЭлементовФормы();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы1", "Видимость", ВНастройкеЕстьОтсутствующиеСтатусы());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ИмяФормыНастроекСвойствЭлементов = "Справочник.ШаблоныПроцессов.Форма.НастройкаСвойствЭлементовПоЭтапам";
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникВыбора, "ИмяФормы")
		И ИсточникВыбора.ИмяФормы = ИмяФормыНастроекСвойствЭлементов Тогда
		
		НедоступныеЭлементы.ЗагрузитьЗначения(ВыбранноеЗначение.НедоступныеЭлементы); 
		НевидимыеЭлементы.ЗагрузитьЗначения(ВыбранноеЗначение.НевидимыеЭлементы); 
		ЭлементыСОтметкойНезаполненного.ЗагрузитьЗначения(ВыбранноеЗначение.ЭлементыСОтметкойНезаполненного);
		СтартоваяСтраница.ЗагрузитьЗначения(ВыбранноеЗначение.СтартоваяСтраница);
		
	Иначе
		
		ИдентификаторыКомандПечатиСоШтампом = ВыбранноеЗначение.ИдентификаторыКомандПечатиСоШтампом;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗапретитьПроведениеОтменуПроведенияПриИзменении(Элемент)
	
	//Если ЗапретитьПроведениеОтменуПроведения Тогда
	//	Для Каждого ТекущиеДанные Из РезультатыВыполнения Цикл
	//		ТекущиеДанные.ТребованиеКПроведению = 0;
	//		ТекущиеДанные.ПредставлениеТребованиеКПроведению =
	//			Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.НайтиПоЗначению(ТекущиеДанные.ТребованиеКПроведению).Представление;
	//	КонецЦикла;
	//КонецЕсли;
	
	ЗапретитьПерепроведение = ЗапретитьПроведениеОтменуПроведения;
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьПерепроведениеПриИзменении(Элемент)
	УправлениеДоступностьюЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВключатьВШтампВизуализацииЭППриИзменении(Элемент)
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеФормыПриИзменении(Элемент)
	
	Если ВсеФормы Тогда
		Для Каждого ПервичныйДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
			ПервичныйДокумент.Пометка = ?(ПервичныйДокумент.НеИспользуется, Ложь, Истина);
		КонецЦикла;
	КонецЕсли;
	
	УправлениеДоступностьюЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РеквизитыДокумента

&НаКлиенте
Процедура РеквизитыПометкаПриИзменении(Элемент)
	УправлениеФлагамиДереваРеквизитов("Ответственность");
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПометкаДоступностьПриИзменении(Элемент)
	УправлениеФлагамиДереваРеквизитов("Доступность");
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПометкаИзменениеПриИзменении(Элемент)
	УправлениеФлагамиДереваРеквизитов("Изменение");
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПометкаОбязательныйПриИзменении(Элемент)
	УправлениеФлагамиДереваРеквизитов("Обязательность");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПервичныеДокументы

&НаКлиенте
Процедура ПервичныеДокументыПометкаОтветственностьПриИзменении(Элемент)
	УправлениеФлагамиДереваПервичныхДокументов("Ответственность");
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПометкаИзменениеПриИзменении(Элемент)
	УправлениеФлагамиДереваПервичныхДокументов("Изменение");
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПометкаОбязательныйПриИзменении(Элемент)
	УправлениеФлагамиДереваПервичныхДокументов("Обязательность");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РезультатыВыполнения

&НаКлиенте
Процедура РезультатыВыполненияПредставлениеТребованиеКПроведениюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РезультатыВыполнения.ТекущиеДанные;
	ТекущиеДанные.ТребованиеКПроведению = ТекущиеДанные.ПредставлениеТребованиеКПроведению;
	
	ТекущиеДанные.ПредставлениеТребованиеКПроведению =
		Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.НайтиПоЗначению(ТекущиеДанные.ТребованиеКПроведению).Представление;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РезультатыВыполнения1

&НаКлиенте
Процедура РезультатыВыполнения1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РезультатыВыполнения1ПредставлениеУсловияВыполнения" Тогда
		ПараметрыФормы = Новый Структура("ИдентификаторДокумента, НастройкиОтбора, ЗаголовокОкна",
			ИдентификаторДокумента,
			РезультатыВыполнения.Получить(ВыбраннаяСтрока).УсловиеВыполнения,
			НСтр("ru = 'Установка условия выполнения'"));
		ОткрытьФорму("ОбщаяФорма.НастройкаОтбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыполнения1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.РезультатыВыполнения1.ТекущиеДанные;
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекущаяСтрока.УсловиеВыполнения = ВыбранноеЗначение.НастройкиОтбора;
		ТекущаяСтрока.ПредставлениеУсловияВыполнения = ВыбранноеЗначение.ПредставлениеОтбора;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОчиститьСообщения();
	
	ОтмеченныеРеквизитыОтветственность = Новый СписокЗначений;
	ОтмеченныеРеквизитыИзменение = Новый СписокЗначений;
	ОтмеченныеОбязательныеРеквизиты = Новый СписокЗначений;
	ОтмеченныеНедоступныеРеквизиты = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		Если НЕ ТекСтрока.Представление = "Реквизиты шапки" Тогда
			Если ТекСтрока.ПометкаОтветственность = 1 Тогда
				ДанныеРеквизита = Новый Структура;
				ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
				ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
				ОтмеченныеРеквизитыОтветственность.Добавить(ДанныеРеквизита);
			КонецЕсли;
			Если ТекСтрока.ПометкаДоступность = 0 Тогда
				Если ТекСтрока.ПометкаИзменение = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
					ОтмеченныеРеквизитыИзменение.Добавить(ДанныеРеквизита);
				Иначе
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
					ОтмеченныеНедоступныеРеквизиты.Добавить(ДанныеРеквизита);
				КонецЕсли;
			КонецЕсли;
			Если ТекСтрока.ПометкаОбязательный = 1 Тогда
				ДанныеРеквизита = Новый Структура;
				ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
				ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
				ОтмеченныеОбязательныеРеквизиты.Добавить(ДанныеРеквизита);
			КонецЕсли;
		КонецЕсли;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ПометкаОтветственность = 1 Тогда
				ДанныеРеквизита = Новый Структура;
				ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
				ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
				ОтмеченныеРеквизитыОтветственность.Добавить(ДанныеРеквизита);
			КонецЕсли;
			Если ТекПодстрока.ПометкаДоступность = 0 Тогда
				Если ТекПодстрока.ПометкаИзменение = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
					ОтмеченныеРеквизитыИзменение.Добавить(ДанныеРеквизита);
				Иначе
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
					ОтмеченныеНедоступныеРеквизиты.Добавить(ДанныеРеквизита);
				КонецЕсли;
			КонецЕсли;
			Если ТекПодстрока.ПометкаОбязательный = 1 Тогда
				ДанныеРеквизита = Новый Структура;
				ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
				ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
				ОтмеченныеОбязательныеРеквизиты.Добавить(ДанныеРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПервичныеДокументыОтветственность = Новый СписокЗначений;
	ПервичныеДокументыНедоступность = Новый СписокЗначений;
	ПервичныеДокументыОбязательность = Новый СписокЗначений;
	
	Для Каждого ПервичныйДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
		Для Каждого ТекСтрока Из ПервичныйДокумент.ПолучитьЭлементы() Цикл
			Если ТекСтрока.ИмяТабличнойЧасти = "" Тогда
				Если ТекСтрока.ПометкаОтветственность = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекСтрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
					ПервичныеДокументыОтветственность.Добавить(ДанныеРеквизита);
				КонецЕсли;
				Если ТекСтрока.ПометкаИзменение = 0 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекСтрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
					ПервичныеДокументыНедоступность.Добавить(ДанныеРеквизита);
				КонецЕсли;
				Если ТекСтрока.ПометкаОбязательный = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекСтрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекСтрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекСтрока.ИмяРеквизита);
					ПервичныеДокументыОбязательность.Добавить(ДанныеРеквизита);
				КонецЕсли;
				Продолжить;
			КонецЕсли;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ТекПодстрока.ПометкаОтветственность = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекПодстрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
					ПервичныеДокументыОтветственность.Добавить(ДанныеРеквизита);
				КонецЕсли;
				Если ТекПодстрока.ПометкаИзменение = 0 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекПодстрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
					ПервичныеДокументыНедоступность.Добавить(ДанныеРеквизита);
				КонецЕсли;
				Если ТекПодстрока.ПометкаОбязательный = 1 Тогда
					ДанныеРеквизита = Новый Структура;
					ДанныеРеквизита.Вставить("ИдентификаторПечатнойФормы", ТекПодстрока.Идентификатор);
					ДанныеРеквизита.Вставить("ИмяТабличнойЧасти", ТекПодстрока.ИмяТабличнойЧасти);
					ДанныеРеквизита.Вставить("ИмяРеквизита", ТекПодстрока.ИмяРеквизита);
					ПервичныеДокументыОбязательность.Добавить(ДанныеРеквизита);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТребованияКПроведению = Новый СписокЗначений;
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		Если РезультатВыполнения.ТребованиеКПроведению <> 0 Тогда
			ДанныеПроведения = Новый Структура;
			ДанныеПроведения.Вставить("Статус", РезультатВыполнения.Статус);
			ДанныеПроведения.Вставить("ПризнакПроведенности", ?(РезультатВыполнения.ТребованиеКПроведению = 1, Истина, Ложь));
			ТребованияКПроведению.Добавить(ДанныеПроведения);
		КонецЕсли;
	КонецЦикла;
	
	ТребованияКВыполнению = Новый СписокЗначений;
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		Если РезультатВыполнения.УсловиеВыполнения <> "" Тогда
			ДанныеВыполнения = Новый Структура;
			ДанныеВыполнения.Вставить("Статус", РезультатВыполнения.Статус);
			ДанныеВыполнения.Вставить("УсловиеВыполнения", РезультатВыполнения.УсловиеВыполнения);
			ТребованияКВыполнению.Добавить(ДанныеВыполнения);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьОшибкиНастроекФормуляров = Ложь; 
    ОшибкаФормуляраОбязательностьПроведения = "";

	Если ВключатьВШтампВизуализацииЭП И НЕ ВсеФормы Тогда
		ОтмеченныеФормы = Новый Массив;
		Для Каждого ПечатнаяФорма Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
			Если ПечатнаяФорма.Пометка Тогда
				ОтмеченныеФормы.Добавить(ПечатнаяФорма.Идентификатор);
			КонецЕсли;
		КонецЦикла;
		Если ОтмеченныеФормы.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Необходимо отметить хотя бы один первичный документ'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ВсеФормы");
			Возврат;
		КонецЕсли;
		ИдентификаторыКомандПечатиСоШтампом = СтрСоединить(ОтмеченныеФормы, ",");
		
		НастройкиФормированияИПодписанияФормуляров = Новый Массив;
		ПустыеНастройкаФормированияИПодписанияФормуляров = Новый Массив;
		Для Каждого ПечатнаяФорма Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
			Если ПечатнаяФорма.Пометка Тогда 
				
				 КодНастройкиФормированияИПодписанияФормуляров = ПроцессыОбработкиДокументовВызовСервера.КодНастройкиФормированияИПодписанияФормуляров(
																	ПечатнаяФорма.НастройкаФормированияИПодписанияФормуляра);
				
				НастройкиФормированияИПодписанияФормуляров.Добавить(КодНастройкиФормированияИПодписанияФормуляров);
				
				Если КодНастройкиФормированияИПодписанияФормуляров = "0" Тогда
					 ПустыеНастройкаФормированияИПодписанияФормуляров.Добавить(ПечатнаяФорма.Представление);
				КонецЕсли; 
				
				Если ПечатнаяФорма.ПроверкаПроведенияПередПечатью 
					И ЗначениеЗаполнено(ПечатнаяФорма.НастройкаФормированияИПодписанияФормуляра) Тогда
					
					ЭтапыСТребованиемЭП = "";
					Для Каждого ЭлементРезультатаВыполнения Из РезультатыВыполнения Цикл
						Если ЭлементРезультатаВыполнения.ТребуетсяЭП И 
							(ЭлементРезультатаВыполнения.ТребованиеКПроведению = 0 ИЛИ ЭлементРезультатаВыполнения.ТребованиеКПроведению = -1) Тогда
							 ЭтапыСТребованиемЭП = ЭтапыСТребованиемЭП + "-" + ЭлементРезультатаВыполнения.ПредставлениеРезультатаИСтатус + Символы.ПС ;
						КонецЕсли;	
							
					КонецЦикла;	
					
					Если ЗначениеЗаполнено(ЭтапыСТребованиемЭП) Тогда
						ШаблонСообщения = НСтр("ru='Для формирования формуляра первичного документа ""%1"" указана обязательность проведения документа. " +
						"На вкладке ""Требования к проведению"" для всех этапов с электнонной подписью должна быть выставлена настройка ""Должен быть проведен"". " +
						"Необходимо установить корректную настройку для следующих этапов: 
						|%2'");  
					 	ОшибкаФормуляраОбязательностьПроведения = ОшибкаФормуляраОбязательностьПроведения + 
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
					 		ПечатнаяФорма.Представление, ЭтапыСТребованиемЭП);
				 	КонецЕсли;																	
					
				КонецЕсли; 
				 
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ОшибкаФормуляраОбязательностьПроведения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОшибкаФормуляраОбязательностьПроведения,,,,ЕстьОшибкиНастроекФормуляров);
        КонецЕсли;
		
		КодыНастройкиФормированияИПодписанияФормуляров = СтрСоединить(НастройкиФормированияИПодписанияФормуляров, ",");
		КоличествоНастроекФормуляров = НастройкиФормированияИПодписанияФормуляров.Количество();
		КоличествоПустыхНастроекФормуляров = ПустыеНастройкаФормированияИПодписанияФормуляров.Количество();
		
		Если КоличествоНастроекФормуляров > 0 Тогда
			ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа = Истина;
			
			// коды настроек формуляров нулевые
			Если КоличествоПустыхНастроекФормуляров  > 0 И (КоличествоНастроекФормуляров = КоличествоПустыхНастроекФормуляров) Тогда
		    	КодыНастройкиФормированияИПодписанияФормуляров = "";
				ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа = Ложь;
			// есть не заполненные настройки формуляров	
			ИначеЕсли КоличествоПустыхНастроекФормуляров  > 0 И Не (КоличествоНастроекФормуляров = КоличествоПустыхНастроекФормуляров) Тогда
				ТекстСообщения = "";
				
				Для Каждого ПустаяНастройкаФормуляров Из ПустыеНастройкаФормированияИПодписанияФормуляров Цикл
					 ШаблонСообщения = НСтр("ru='Для первичного документа ""%1"" не указана настройка формирования и подписания формуляров %2'");  
					 ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
					 																	ПустаяНастройкаФормуляров, Символы.ПС);
				КонецЦикла;
																					
				 Если ЗначениеЗаполнено(ТекстСообщения) Тогда
				 	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,,ЕстьОшибкиНастроекФормуляров);
				 КонецЕсли;
			 КонецЕсли;
		Иначе	 
			ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа = Ложь;
		КонецЕсли;	
		
	ИначеЕсли Не ВключатьВШтампВизуализацииЭП Тогда
	      ИдентификаторыКомандПечатиСоШтампом = "";
		  КодыНастройкиФормированияИПодписанияФормуляров = "";	
	КонецЕсли;
	  
	ПереченьПрисоединенныхФайлов = ?(НаличиеФайловОбязательно И (РасшифровкаПрисоединенныхФайлов.Количество() > 0), 
									СтрСоединить(РасшифровкаПрисоединенныхФайлов.ВыгрузитьЗначения(), ";"),
									""); 
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ЗапретитьПроведениеОтменуПроведения", ЗапретитьПроведениеОтменуПроведения);
	ДанныеВозврата.Вставить("ЗапретитьПерепроведение", ЗапретитьПерепроведение);
	ДанныеВозврата.Вставить("ВключатьВШтампВизуализацииЭП", ВключатьВШтампВизуализацииЭП);
	ДанныеВозврата.Вставить("ИдентификаторыКомандПечатиСоШтампом", ИдентификаторыКомандПечатиСоШтампом);
	ДанныеВозврата.Вставить("ОбособленнаяЗонаОтветственности", ОбособленнаяЗонаОтветственности);
	ДанныеВозврата.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа);
	ДанныеВозврата.Вставить("ОтмеченныеРеквизитыОтветственность", ОтмеченныеРеквизитыОтветственность);
	ДанныеВозврата.Вставить("ОтмеченныеРеквизитыИзменение", ОтмеченныеРеквизитыИзменение);
	ДанныеВозврата.Вставить("ОтмеченныеОбязательныеРеквизиты", ОтмеченныеОбязательныеРеквизиты);
	ДанныеВозврата.Вставить("ОтмеченныеНедоступныеРеквизиты", ОтмеченныеНедоступныеРеквизиты);
	ДанныеВозврата.Вставить("ПервичныеДокументыОтветственность", ПервичныеДокументыОтветственность);
	ДанныеВозврата.Вставить("ПервичныеДокументыНедоступность", ПервичныеДокументыНедоступность);
	ДанныеВозврата.Вставить("ПервичныеДокументыОбязательность", ПервичныеДокументыОбязательность);
	ДанныеВозврата.Вставить("УдалитьНесуществующиеРеквизиты", УдаленыНесуществующиеРеквизиты);
	ДанныеВозврата.Вставить("ТребованияКПроведению", ТребованияКПроведению);
	ДанныеВозврата.Вставить("ТребованияКВыполнению", ТребованияКВыполнению);
	ДанныеВозврата.Вставить("УдаленыНесуществующиеСтатусы", НЕ ВНастройкеЕстьОтсутствующиеСтатусы());
	ДанныеВозврата.Вставить("ЗапрещеноДобавлениеФайлов", ЗапрещеноДобавлениеФайлов);
	ДанныеВозврата.Вставить("ЗапрещеноИзменениеФайлов", ЗапрещеноИзменениеФайлов);
	ДанныеВозврата.Вставить("НаличиеФайловОбязательно", НаличиеФайловОбязательно); 
	ДанныеВозврата.Вставить("РасшифровкаОбязательныхПрисоединенныхФайлов", ПереченьПрисоединенныхФайлов);
	ДанныеВозврата.Вставить("ПодписыватьФайлыЭП", ПодписыватьФайлыЭП);
	ДанныеВозврата.Вставить("ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа", ЗапрещеноИсполнителюОтменятьВыполнениеЭтапа);
	ДанныеВозврата.Вставить("ОбменСЛичнымКабинетом", ОбменСЛичнымКабинетом);
	ДанныеВозврата.Вставить("КодыНастройкиФормированияИПодписанияФормуляров", КодыНастройкиФормированияИПодписанияФормуляров);
	ДанныеВозврата.Вставить("ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа", ЕстьНастройкиФормированияИПодписанияФормуляровЭтапа);
	ДанныеВозврата.Вставить("НедоступныеЭлементы", НедоступныеЭлементы.ВыгрузитьЗначения()); 
	ДанныеВозврата.Вставить("НевидимыеЭлементы", НевидимыеЭлементы.ВыгрузитьЗначения()); 
	ДанныеВозврата.Вставить("ЭлементыСОтметкойНезаполненного", ЭлементыСОтметкойНезаполненного.ВыгрузитьЗначения());
	ДанныеВозврата.Вставить("СтартоваяСтраница", СтартоваяСтраница.ВыгрузитьЗначения());
	ДанныеВозврата.Вставить("ИмяНастройки", "НастройкаОграниченийДоступа");
	
	Если Не ЕстьОшибкиНастроекФормуляров Тогда
		ОповеститьОВыборе(ДанныеВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтветственность(Команда)
	УстановитьПометкиОтветственность(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьОтветственность(Команда)
	УстановитьПометкиОтветственность(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРедактирование(Команда)
	УстановитьПометкиРедактирование(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРедактирование(Команда)
	УстановитьПометкиРедактирование(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьИзменение(Команда)
	УстановитьПометкиИзменение(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьИзменение(Команда)
	УстановитьПометкиИзменение(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОбязательность(Команда)
	УстановитьПометкиОбязательность(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьОбязательность(Команда)
	УстановитьПометкиОбязательность(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтсутствующиеРеквизиты(Команда)
	
	МассивСтрокКУдалению = Новый Массив;
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		МассивПодстрокКУдалению = Новый Массив;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ОтсутствуетВМетаданных Тогда
				МассивПодстрокКУдалению.Добавить(ТекПодстрока);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаКУдалению Из МассивПодстрокКУдалению Цикл
			ТекСтрока.ПолучитьЭлементы().Удалить(СтрокаКУдалению);
		КонецЦикла;
		Если ТекСтрока.ОтсутствуетВМетаданных Тогда
			МассивСтрокКУдалению.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаКУдалению Из МассивСтрокКУдалению Цикл
		РеквизитыДокумента.ПолучитьЭлементы().Удалить(СтрокаКУдалению);
	КонецЦикла;
	
	УдаленыНесуществующиеРеквизиты = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтстутствующиеРеквизиты",
		"Видимость",
		НЕ УдаленыНесуществующиеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтсутствующиеРеквизиты(Команда)
	
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		Если ТекСтрока.ОтсутствуетВМетаданных Тогда
			Если ПустаяСтрока(ТекСтрока.ИмяРеквизита) Тогда
				ИмяЭлемента = ТекСтрока.ИмяТабличнойЧасти;
			ИначеЕсли ПустаяСтрока(ТекСтрока.ИмяТабличнойЧасти) Тогда
				ИмяЭлемента = ТекСтрока.ИмяРеквизита;
			Иначе
				ИмяЭлемента = ТекСтрока.ИмяТабличнойЧасти+"."+ТекСтрока.ИмяРеквизита;
			КонецЕсли;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В метаданных документа отсутствует реквизит ""%1""'"),
				ИмяЭлемента);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ОтсутствуетВМетаданных Тогда
				Если ПустаяСтрока(ТекПодстрока.ИмяРеквизита) Тогда
					ИмяЭлемента = ТекПодстрока.ИмяТабличнойЧасти;
				ИначеЕсли ПустаяСтрока(ТекПодстрока.ИмяТабличнойЧасти) Тогда
					ИмяЭлемента = ТекПодстрока.ИмяРеквизита;
				Иначе
					ИмяЭлемента = ТекПодстрока.ИмяТабличнойЧасти+"."+ТекПодстрока.ИмяРеквизита;
				КонецЕсли;
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'В метаданных документа отсутствует реквизит ""%1""'"),
					ИмяЭлемента);
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтсутствующиеСтатусы(Команда)
	
	ЭлементыКУдалению = Новый Массив;
	Для Каждого РезультатВыполнения Из РезультатыВыполнения Цикл
		Если РезультатВыполнения.СтатусНеНайден Тогда
			ЭлементыКУдалению.Добавить(РезультатВыполнения);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементКУдалению Из ЭлементыКУдалению Цикл
		РезультатыВыполнения.Удалить(ЭлементКУдалению);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы", "Видимость", Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаОтстутствующиеСтатусы1", "Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыОтметитьВсе(Команда)
	
	Для Каждого ПервичныйДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
		Если Не ПервичныйДокумент.НеИспользуется Тогда
			ПервичныйДокумент.Пометка = 1;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыСнятьОтметкуВсех(Команда)
	
	Для Каждого ПервичныйДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
		ПервичныйДокумент.Пометка = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыНастройкаФормированияИПодписанияФормуляраОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ЕстьЗамечанияКИнтеграцииМеханизмаФормированияФормуляров Тогда
		ТекстСообщения = НСтр("ru = 'Внимание! Механизм формирования и подписания формуляров не настроен на уровне прикладного решения. 
			|Необходимо обратиться к разработчикам для выпуска версии с поддержкой этого механизма.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ВыбранноеЗначение = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныеДокументыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	
	Если ТекущиеДанные.Пометка = 1 И ТекущиеДанные.НеИспользуется Тогда
		ТекущиеДанные.Пометка = 0;
		
		МассивФорматныхСтрок = Новый Массив;	
		ТекстПодсказкиЗаголовок = НСтр("ru='Данную форму первичного документа запрещено использовать в сценариях подсистемы ""Процессы обработки документов"".'");
		
		ОтформатированныйТекстПодсказкиЗаголовок = ВыделитьСтрокуПолужирнымПоРазделителю(ТекстПодсказкиЗаголовок, """");
		МассивФорматныхСтрок.Добавить(ОтформатированныйТекстПодсказкиЗаголовок);
		МассивФорматныхСтрок.Добавить(Символы.ПС);
		МассивФорматныхСтрок.Добавить(Символы.ПС);
		
		ТекстПодсказкиПричиныНеИспользования = ТекущиеДанные.ПричинаНеИспользования;
		ОтформатированныйТекстПодсказкиПричиныНеИспользования = ВыделитьСтрокуПолужирнымПоРазделителю(ТекстПодсказкиПричиныНеИспользования, """");
		МассивФорматныхСтрок.Добавить(ОтформатированныйТекстПодсказкиПричиныНеИспользования);
		
		ТекстПодсказки = Новый ФорматированнаяСтрока(МассивФорматныхСтрок);
		ПоказатьПредупреждение(Новый ОписаниеОповещения(), ТекстПодсказки);
		
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура РасшифровкаПрисоединенныхФайловЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(НаименованиеФормыВыбораВидовПрисоединенныхФайлов) Тогда
		ОткрытьФорму(НаименованиеФормыВыбораВидовПрисоединенныхФайлов,,Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбязательноНаличиеФайловПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
										Элементы,
										"РасшифровкаПрисоединенныхФайлов",
										"Видимость",
										НаличиеФайловОбязательно);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаСвойствЭлементовФормыДокумента(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторДокумента", ИдентификаторДокумента);
	ПараметрыФормы.Вставить("НедоступныеЭлементы", НедоступныеЭлементы.ВыгрузитьЗначения()); 
	ПараметрыФормы.Вставить("НевидимыеЭлементы", НевидимыеЭлементы.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("ЭлементыСОтметкойНезаполненного", ЭлементыСОтметкойНезаполненного.ВыгрузитьЗначения()); 
	ПараметрыФормы.Вставить("СтартоваяСтраница", СтартоваяСтраница.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("ТекущийШаблон", ВладелецЭтапа);
	ПараметрыФормы.Вставить("ИдентификаторЭтапа", ИдентификаторЭтапа); 
	ПараметрыФормы.Вставить("ТекущийЭтапСтрокой", ТекущийЭтапСтрокой); 

	ОткрытьФорму("Справочник.ШаблоныПроцессов.Форма.НастройкаСвойствЭлементовПоЭтапам", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоРеквизитов(ДокументОбъект)
	
	Если НЕ ОбщегоНазначения.СсылкаСуществует(ИдентификаторДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокумента");
	
	ПроцессыОбработкиДокументов.ЗаполнитьДеревоРеквизитовПоИдентификатору(Дерево, ИдентификаторДокумента);
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности(Дерево, ИдентификаторДокумента);
	
	// Дополнение дерева реквизитов по данным других этапов объекта
	МассивТЧ = Новый Массив;
	МассивТЧ.Добавить("ОтветственностьЗаРеквизиты");
	МассивТЧ.Добавить("ИзменениеРеквизитовЭтапов");
	МассивТЧ.Добавить("ОбязательныеРеквизиты");
	МассивТЧ.Добавить("НедоступныеРеквизиты");
	
	Для Каждого ТЧ Из МассивТЧ Цикл
		Для Каждого Элемент Из ДокументОбъект[ТЧ] Цикл
			Отбор = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита", Элемент.ИмяТабличнойЧасти, Элемент.ИмяРеквизита);
			Если Дерево.Строки.НайтиСтроки(Отбор, Истина).Количество() = 0 Тогда
				ДобавитьОтсутствующийВМетаданныхРеквизит(Дерево, Элемент.ИмяТабличнойЧасти, Элемент.ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокумента");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервичныеДокументы(ДокументОбъект)
	
	Если НЕ ОбщегоНазначения.СсылкаСуществует(ИдентификаторДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ПервичныеДокументы");
	
	ЗаполнитьДеревоПервичныхДокументовПоИдентификатору(Дерево, ИдентификаторДокумента);
	
	ЗаполнитьФорматыПервичныхДокументов(Дерево, ИдентификаторДокумента);
	
	ЗначениеВРеквизитФормы(Дерево, "ПервичныеДокументы");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьРеквизитыСогласноСписку(ОтмеченныеРеквизитыОтветственность, ОтмеченныеРеквизитыИзменение,
	НедоступныеРеквизитыОтветственность, НедоступныеРеквизитыДоступность,
	ОтмеченныеОбязательныеРеквизиты, ОтмеченныеНедоступныеРеквизиты)
	
	ЗанятыеРеквизиты = Новый Массив;
	
	Дерево = РеквизитФормыВЗначение("РеквизитыДокумента");
	СтрокиДерева = Дерево.Строки;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеРеквизитыОтветственность Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаОтветственность = 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеРеквизитыИзменение Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаИзменение = 1;
			ЗанятыеРеквизиты.Добавить(СтрокаДерева.ИмяТабличнойЧасти+"."+СтрокаДерева.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из НедоступныеРеквизитыОтветственность Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ЗапрещеноРедактированиеОтветственности = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из НедоступныеРеквизитыДоступность Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеНедоступныеРеквизиты Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаДоступность = 0;
			СтрокаДерева.ПометкаИзменение = 0;
			ЗанятыеРеквизиты.Добавить(СтрокаДерева.ИмяТабличнойЧасти+"."+СтрокаДерева.ИмяРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	// все незанятые реквизиты должны быть доступны для редактирования
	Для Каждого Строка Из СтрокиДерева Цикл
		Если Строка.Представление <> "Реквизиты шапки"
			И ЗанятыеРеквизиты.Найти(Строка.ИмяТабличнойЧасти+"."+Строка.ИмяРеквизита) = Неопределено Тогда
			Строка.ПометкаДоступность = 1;
			Строка.ПометкаИзменение = 1;
			Строка.ЗапрещеноРедактированиеИзменения = Истина;
		КонецЕсли;
		Для Каждого Подстрока Из Строка.Строки Цикл
			Если ЗанятыеРеквизиты.Найти(Подстрока.ИмяТабличнойЧасти+"."+Подстрока.ИмяРеквизита) = Неопределено Тогда
				Подстрока.ПометкаДоступность = 1;
				Подстрока.ПометкаИзменение = 1;
				Подстрока.ЗапрещеноРедактированиеИзменения = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ОтмеченныеОбязательныеРеквизиты Цикл
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти,ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаОбязательный = 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "РеквизитыДокумента");
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьПервичныеДокументыСогласноСписку(ПервичныеДокументыОтветственность,
	НедоступныеПервичныеДокументыОтветственность, ПервичныеДокументыНедоступность, ПервичныеДокументыОбязательность)
	
	Дерево = РеквизитФормыВЗначение("ПервичныеДокументы");
	СтрокиДерева = Дерево.Строки;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыОтветственность Цикл
		ПараметрыОтбора = Новый Структура("Идентификатор, ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы,
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаОтветственность = 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из НедоступныеПервичныеДокументыОтветственность Цикл
		ПараметрыОтбора = Новый Структура("Идентификатор, ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы,
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ЗапрещеноРедактированиеОтветственности = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыНедоступность Цикл
		ПараметрыОтбора = Новый Структура("Идентификатор, ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы,
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаИзменение = 0;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОтмеченныйРеквизит Из ПервичныеДокументыОбязательность Цикл
		ПараметрыОтбора = Новый Структура("Идентификатор, ИмяТабличнойЧасти, ИмяРеквизита",
			ОтмеченныйРеквизит.Значение.ИдентификаторПечатнойФормы,
			ОтмеченныйРеквизит.Значение.ИмяТабличнойЧасти,
			ОтмеченныйРеквизит.Значение.ИмяРеквизита);
		НайденныеСтроки = СтрокиДерева.НайтиСтроки(ПараметрыОтбора, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаДерева = НайденныеСтроки[0];
			СтрокаДерева.ПометкаОбязательный = 1;
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ПервичныеДокументы");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьОтсутствующийВМетаданныхРеквизит(Дерево, ИмяТабличнойЧасти, ИмяРеквизита)
	
	Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
		// Это реквизит шапки либо элемент, добавленный методом
		// ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = "";
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
		НоваяСтрока.Представление = ИмяРеквизита;
		НоваяСтрока.НомерКартинки = 4;
	ИначеЕсли ПустаяСтрока(ИмяРеквизита) Тогда
		// Это табличная часть либо элемент, добавленный методом
		// ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности
		НоваяСтрока = Дерево.Строки.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ИмяРеквизита = "";
		НоваяСтрока.Представление = ИмяТабличнойЧасти;
		НоваяСтрока.НомерКартинки = 5;
	Иначе
		// Это реквизит табличной части либо элемент, добавленный методом
		// ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииДереваЗонОтветственности
		ПараметрыОтбора = Новый Структура("ИмяТабличнойЧасти, ИмяРеквизита",
										ИмяТабличнойЧасти,
										"");
		НайденныеСтроки = Дерево.Строки.НайтиСтроки(ПараметрыОтбора,Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Родитель = НайденныеСтроки[0];
		Иначе
			Родитель = Дерево.Строки.Добавить();
			Родитель.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
			Родитель.ИмяРеквизита = "";
			Родитель.Представление = ИмяТабличнойЧасти;
			Родитель.НомерКартинки = 5;
			Родитель.ОтсутствуетВМетаданных = Истина;
		КонецЕсли;
		НоваяСтрока = Родитель.Строки.Добавить();
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТабличнойЧасти;
		НоваяСтрока.ИмяРеквизита = ИмяРеквизита;
		НоваяСтрока.Представление = ИмяРеквизита;
		НоваяСтрока.НомерКартинки = 4;
	КонецЕсли;
	
	НоваяСтрока.ОтсутствуетВМетаданных = Истина;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПометкиОтветственность(ТекЗначение)
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		Если НЕ ТекСтрока.ЗапрещеноРедактированиеОтветственности Тогда
			ТекСтрока.ПометкаОтветственность = ТекЗначение;
		КонецЕсли;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если НЕ ТекПодстрока.ЗапрещеноРедактированиеОтветственности Тогда
				ТекПодстрока.ПометкаОтветственность = ТекЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиРедактирование(ТекЗначение)
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		ТекСтрока.ПометкаДоступность = ТекЗначение;
		ТекСтрока.ПометкаИзменение = ТекСтрока.ПометкаДоступность;
		ТекСтрока.ЗапрещеноРедактированиеИзменения = ТекСтрока.ПометкаДоступность = 1;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			ТекПодстрока.ПометкаДоступность = ТекЗначение;
			ТекПодстрока.ПометкаИзменение = ТекПодстрока.ПометкаДоступность;
			ТекПодстрока.ЗапрещеноРедактированиеИзменения = ТекПодстрока.ПометкаДоступность = 1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиИзменение(ТекЗначение)
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		Если ТекСтрока.ЗапрещеноРедактированиеИзменения Тогда
			Продолжить;
		КонецЕсли;
		ТекСтрока.ПометкаИзменение = ТекЗначение;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			Если ТекПодстрока.ЗапрещеноРедактированиеИзменения Тогда
				Продолжить;
			КонецЕсли;
			ТекПодстрока.ПометкаИзменение = ТекЗначение;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиОбязательность(ТекЗначение)
	Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
		ТекСтрока.ПометкаОбязательный = ТекЗначение;
		Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
			ТекПодстрока.ПометкаОбязательный = ТекЗначение;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваРеквизитов(Параметр)
	
	Если Параметр = "Все" Тогда
		
		Для Каждого ТекСтрока Из РеквизитыДокумента.ПолучитьЭлементы() Цикл
			Если НЕ ТекСтрока.Представление = "Реквизиты шапки" Тогда
				Продолжить;
			КонецЕсли;
			
			ЗначениеФлагаГруппыОтветственность = Неопределено;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ТекПодстрока.ЗапрещеноРедактированиеОтветственности Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеФлагаГруппыОтветственность = Неопределено Тогда
					ЗначениеФлагаГруппыОтветственность = ТекПодстрока.ПометкаОтветственность;
				ИначеЕсли ЗначениеФлагаГруппыОтветственность <> ТекПодстрока.ПометкаОтветственность Тогда
					ЗначениеФлагаГруппыОтветственность = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.ПометкаОтветственность = ЗначениеФлагаГруппыОтветственность;
			ТекСтрока.ЗапрещеноРедактированиеОтветственности = ЗначениеФлагаГруппыОтветственность = Неопределено;
			
			ЗначениеФлагаГруппыДоступность = Неопределено;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ЗначениеФлагаГруппыДоступность = Неопределено Тогда
					ЗначениеФлагаГруппыДоступность = ТекПодстрока.ПометкаДоступность;
				ИначеЕсли ЗначениеФлагаГруппыДоступность <> ТекПодстрока.ПометкаДоступность Тогда
					ЗначениеФлагаГруппыДоступность = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.ПометкаДоступность = ЗначениеФлагаГруппыДоступность;
			
			ЗначениеФлагаГруппыИзменение = Неопределено;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ЗначениеФлагаГруппыИзменение = Неопределено Тогда
					ЗначениеФлагаГруппыИзменение = ТекПодстрока.ПометкаИзменение;
				ИначеЕсли ЗначениеФлагаГруппыИзменение <> ТекПодстрока.ПометкаИзменение Тогда
					ЗначениеФлагаГруппыИзменение = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.ПометкаИзменение = ЗначениеФлагаГруппыИзменение;
			
			ЗначениеФлагаГруппыОбязательность = Неопределено;
			Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
				Если ЗначениеФлагаГруппыОбязательность = Неопределено Тогда
					ЗначениеФлагаГруппыОбязательность = ТекПодстрока.ПометкаОбязательный;
				ИначеЕсли ЗначениеФлагаГруппыОбязательность <> ТекПодстрока.ПометкаОбязательный Тогда
					ЗначениеФлагаГруппыОбязательность = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ТекСтрока.ПометкаОбязательный = ЗначениеФлагаГруппыОбязательность;
			
		КонецЦикла;
		
	ИначеЕсли Параметр = "Ответственность" Тогда
		
		ТекущиеДанные = Элементы.РеквизитыДокумента.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаОтветственность = 2 Тогда
			ТекущиеДанные.ПометкаОтветственность = 0;
		КонецЕсли;
		
		ЗначениеФлага = ТекущиеДанные.ПометкаОтветственность;
		
		Если ЗначениеФлага = 1 Тогда
			ТекущиеДанные.ПометкаДоступность = 1;
			ТекущиеДанные.ПометкаИзменение = 1;
			ТекущиеДанные.ЗапрещеноРедактированиеИзменения = 1;
		КонецЕсли;
		
		ИзменениеДоступности = Истина;
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		// Если флаг изменен у группы, то надо аналогично изменить флаг у подчиненных элементов.
		Если Родитель = Неопределено Тогда
			Если ТекущиеДанные.Представление = "Реквизиты шапки" Тогда
				Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
					Если Элемент.ЗапрещеноРедактированиеОтветственности Тогда
						Продолжить;
					КонецЕсли;
					
					Элемент.ПометкаОтветственность = ЗначениеФлага;
					
					Если ЗначениеФлага = 1 Тогда
						Элемент.ПометкаДоступность = 1;
						
						Элемент.ПометкаИзменение = 1;
						Элемент.ЗапрещеноРедактированиеИзменения = 1;
					КонецЕсли;
					
				КонецЦикла;
			ИначеЕсли ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
				ИзменениеДоступности = Ложь;
				
				ПараметрыДляОбработки = Новый Структура;
				ПараметрыДляОбработки.Вставить("ЭлементыДляОбработки", ТекущиеДанные.ПолучитьЭлементы());
				ПараметрыДляОбработки.Вставить("ЗначениеФлага", ЗначениеФлага);
				
				Оповещение = Новый ОписаниеОповещения("УправлениеФлагамиДереваРеквизитовОтветственностьЗавершение", ЭтотОбъект, ПараметрыДляОбработки);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменить пометку ""Ответственность"" у подчиненных элементов?'"), РежимДиалогаВопрос.ДаНет);	
			КонецЕсли;
		ИначеЕсли Родитель.Представление = "Реквизиты шапки" Тогда
			// Если изменен флаг внутри группы, и в этой группе имеются элементы с отличными флагами, то
			// группе надо установить значение флага "Не определено" (2).
			ЗначениеФлагаГруппы = ЗначениеФлага;
			Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
				Если Элемент.ЗапрещеноРедактированиеОтветственности Тогда
					Продолжить;
				КонецЕсли;
				Если Элемент.ПометкаОтветственность <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппы = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.ПометкаОтветственность = ЗначениеФлагаГруппы;
		КонецЕсли;
		
		Если ИзменениеДоступности Тогда
			УправлениеФлагамиДереваРеквизитов("Доступность");
		КонецЕсли;	
		
	ИначеЕсли Параметр = "Доступность" Тогда
		
		ТекущиеДанные = Элементы.РеквизитыДокумента.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаДоступность = 2 Тогда
			ТекущиеДанные.ПометкаДоступность = 0;
		КонецЕсли;
		
		ТекущиеДанные.ПометкаИзменение = ТекущиеДанные.ПометкаДоступность;
		ТекущиеДанные.ЗапрещеноРедактированиеИзменения = ТекущиеДанные.ПометкаДоступность = 1;
		
		ЗначениеФлага = ТекущиеДанные.ПометкаДоступность;
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		// Если флаг изменен у группы, то надо аналогично изменить флаг у подчиненных элементов.
		Если Родитель = Неопределено Тогда
			Если ТекущиеДанные.Представление = "Реквизиты шапки" Тогда
				Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
					Элемент.ПометкаДоступность = ЗначениеФлага;
					
					Элемент.ПометкаИзменение = Элемент.ПометкаДоступность;
					Элемент.ЗапрещеноРедактированиеИзменения = Элемент.ПометкаДоступность = 1;
					
				КонецЦикла;
			ИначеЕсли ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
				ПараметрыДляОбработки = Новый Структура;
				ПараметрыДляОбработки.Вставить("ЭлементыДляОбработки", ТекущиеДанные.ПолучитьЭлементы());
				ПараметрыДляОбработки.Вставить("ЗначениеФлага", ЗначениеФлага);
				
				Оповещение = Новый ОписаниеОповещения("УправлениеФлагамиДереваРеквизитовДоступностьЗавершение", ЭтотОбъект, ПараметрыДляОбработки);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменить пометку ""Редактирование"" у подчиненных элементов?'"), РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		ИначеЕсли Родитель.Представление = "Реквизиты шапки" Тогда
			// Если изменен флаг внутри группы, и в этой группе имеются элементы с отличными флагами, то
			// группе надо установить значение флага "Не определено" (2).
			ЗначениеФлагаГруппы = ЗначениеФлага;
			ЗначениеФлагаГруппыИзменение = ЗначениеФлага;
			Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
				Если Элемент.ПометкаДоступность <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппы = 2;
				КонецЕсли;
				Если Элемент.ПометкаИзменение <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппыИзменение = 2;
				КонецЕсли;
				Если ЗначениеФлагаГруппы = 2 И ЗначениеФлагаГруппыИзменение = 2 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.ПометкаДоступность = ЗначениеФлагаГруппы;
			Родитель.ПометкаИзменение = ЗначениеФлагаГруппыИзменение;
			Родитель.ЗапрещеноРедактированиеИзменения = Родитель.ПометкаДоступность <> 0;
		КонецЕсли;
		
	ИначеЕсли Параметр = "Изменение" Тогда
		
		ТекущиеДанные = Элементы.РеквизитыДокумента.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаИзменение = 2 Тогда
			ТекущиеДанные.ПометкаИзменение = 0;
		КонецЕсли;
		
		ЗначениеФлага = ТекущиеДанные.ПометкаИзменение;
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		// Если флаг изменен у группы, то надо аналогично изменить флаг у подчиненных элементов.
		Если Родитель = Неопределено Тогда
			Если ТекущиеДанные.Представление = "Реквизиты шапки" Тогда
				Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
					Если Элемент.ЗапрещеноРедактированиеИзменения Тогда
						Продолжить;
					КонецЕсли;
					Элемент.ПометкаИзменение = ЗначениеФлага;
				КонецЦикла;
			ИначеЕсли ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
				ПараметрыДляОбработки = Новый Структура;
				ПараметрыДляОбработки.Вставить("ЭлементыДляОбработки", ТекущиеДанные.ПолучитьЭлементы());
				ПараметрыДляОбработки.Вставить("ЗначениеФлага", ЗначениеФлага);
				
				Оповещение = Новый ОписаниеОповещения("УправлениеФлагамиДереваРеквизитовИзменениеЗавершение", ЭтотОбъект, ПараметрыДляОбработки);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменить пометку ""Изменение"" у подчиненных элементов?'"), РежимДиалогаВопрос.ДаНет);	
			КонецЕсли;
			
		ИначеЕсли Родитель.Представление = "Реквизиты шапки" Тогда
			// Если изменен флаг внутри группы, и в этой группе имеются элементы с отличными флагами, то
			// группе надо установить значение флага "Не определено" (2).
			ЗначениеФлагаГруппы = ЗначениеФлага;
			Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
				Если Элемент.ПометкаИзменение <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппы = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.ПометкаИзменение = ЗначениеФлагаГруппы;
		КонецЕсли;
		
	ИначеЕсли Параметр = "Обязательность" Тогда
		
		ТекущиеДанные = Элементы.РеквизитыДокумента.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаОбязательный = 2 Тогда
			ТекущиеДанные.ПометкаОбязательный = 0;
		КонецЕсли;
		
		ЗначениеФлага = ТекущиеДанные.ПометкаОбязательный;
		
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		// Если флаг изменен у группы, то надо аналогично изменить флаг у подчиненных элементов.
		Если Родитель = Неопределено Тогда
			Если ТекущиеДанные.Представление = "Реквизиты шапки" Тогда
				Для Каждого Элемент Из ТекущиеДанные.ПолучитьЭлементы() Цикл
					Элемент.ПометкаОбязательный = ЗначениеФлага;
				КонецЦикла;
			ИначеЕсли ТекущиеДанные.ПолучитьЭлементы().Количество() > 0 Тогда
				ПараметрыДляОбработки = Новый Структура;
				ПараметрыДляОбработки.Вставить("ЭлементыДляОбработки", ТекущиеДанные.ПолучитьЭлементы());
				ПараметрыДляОбработки.Вставить("ЗначениеФлага", ЗначениеФлага);
				
				Оповещение = Новый ОписаниеОповещения("УправлениеФлагамиДереваРеквизитовОбязательностьЗавершение", ЭтотОбъект, ПараметрыДляОбработки);
				ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменить пометку ""Обязательность"" у подчиненных элементов?'"), РежимДиалогаВопрос.ДаНет);	
			КонецЕсли;
		ИначеЕсли Родитель.Представление = "Реквизиты шапки" Тогда
			// Если изменен флаг внутри группы, и в этой группе имеются элементы с отличными флагами, то
			// группе надо установить значение флага "Не определено" (2).
			ЗначениеФлагаГруппы = ЗначениеФлага;
			Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
				Если Элемент.ПометкаОбязательный <> ЗначениеФлага Тогда
					ЗначениеФлагаГруппы = 2;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Родитель.ПометкаОбязательный = ЗначениеФлагаГруппы;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваПервичныхДокументов(Параметр)
	
	Если Параметр = "Все" Тогда
		
		Для Каждого ПервичныйДокумент Из ПервичныеДокументы.ПолучитьЭлементы() Цикл
			
			ЗначениеФлагаГруппыОтветственность = Неопределено;
			Для Каждого ТекСтрока Из ПервичныйДокумент.ПолучитьЭлементы() Цикл
				Если ТекСтрока.ИмяТабличнойЧасти = "" Тогда
					Если ТекСтрока.ЗапрещеноРедактированиеОтветственности Тогда
						Продолжить;
					КонецЕсли;
					Если ЗначениеФлагаГруппыОтветственность = Неопределено Тогда
						ЗначениеФлагаГруппыОтветственность = ТекСтрока.ПометкаОтветственность;
					ИначеЕсли ЗначениеФлагаГруппыОтветственность <> ТекСтрока.ПометкаОтветственность Тогда
						ЗначениеФлагаГруппыОтветственность = 2;
					КонецЕсли;
				Иначе
					ЗначениеФлагаГруппыОтветственностьТЧ = Неопределено;
					Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
						Если ТекПодстрока.ЗапрещеноРедактированиеОтветственности Тогда
							Продолжить;
						КонецЕсли;
						Если ЗначениеФлагаГруппыОтветственностьТЧ = Неопределено Тогда
							ЗначениеФлагаГруппыОтветственностьТЧ = ТекПодстрока.ПометкаОтветственность;
						ИначеЕсли ЗначениеФлагаГруппыОтветственностьТЧ <> ТекПодстрока.ПометкаОтветственность Тогда
							ЗначениеФлагаГруппыОтветственностьТЧ = 2;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					ТекСтрока.ПометкаОтветственность = ЗначениеФлагаГруппыОтветственностьТЧ;
					ТекСтрока.ЗапрещеноРедактированиеОтветственности = ЗначениеФлагаГруппыОтветственностьТЧ = Неопределено;
					Если ЗначениеФлагаГруппыОтветственностьТЧ <> Неопределено
						И ЗначениеФлагаГруппыОтветственность <> ЗначениеФлагаГруппыОтветственностьТЧ Тогда
						ЗначениеФлагаГруппыОтветственность = 2;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ПервичныйДокумент.ПометкаОтветственность = ЗначениеФлагаГруппыОтветственность;
			ПервичныйДокумент.ЗапрещеноРедактированиеОтветственности = ЗначениеФлагаГруппыОтветственность = Неопределено;
			
			ЗначениеФлагаГруппыИзменение = Неопределено;
			Для Каждого ТекСтрока Из ПервичныйДокумент.ПолучитьЭлементы() Цикл
				Если ТекСтрока.ИмяТабличнойЧасти = "" Тогда
					Если ЗначениеФлагаГруппыИзменение = Неопределено Тогда
						ЗначениеФлагаГруппыИзменение = ТекСтрока.ПометкаИзменение;
					ИначеЕсли ЗначениеФлагаГруппыИзменение <> ТекСтрока.ПометкаИзменение Тогда
						ЗначениеФлагаГруппыИзменение = 2;
					КонецЕсли;
				Иначе
					ЗначениеФлагаГруппыИзменениеТЧ = Неопределено;
					Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
						Если ЗначениеФлагаГруппыИзменениеТЧ = Неопределено Тогда
							ЗначениеФлагаГруппыИзменениеТЧ = ТекПодстрока.ПометкаИзменение;
						ИначеЕсли ЗначениеФлагаГруппыИзменениеТЧ <> ТекПодстрока.ПометкаИзменение Тогда
							ЗначениеФлагаГруппыИзменениеТЧ = 2;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					ТекСтрока.ПометкаИзменение = ЗначениеФлагаГруппыИзменениеТЧ;
					Если ЗначениеФлагаГруппыИзменениеТЧ <> Неопределено
						И ЗначениеФлагаГруппыИзменение <> ЗначениеФлагаГруппыИзменениеТЧ Тогда
						ЗначениеФлагаГруппыИзменение = 2;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ПервичныйДокумент.ПометкаИзменение = ЗначениеФлагаГруппыИзменение;
			
			ЗначениеФлагаГруппыОбязательность = Неопределено;
			Для Каждого ТекСтрока Из ПервичныйДокумент.ПолучитьЭлементы() Цикл
				Если ТекСтрока.ИмяТабличнойЧасти = "" Тогда
					Если ЗначениеФлагаГруппыОбязательность = Неопределено Тогда
						ЗначениеФлагаГруппыОбязательность = ТекСтрока.ПометкаОбязательный;
					ИначеЕсли ЗначениеФлагаГруппыОбязательность <> ТекСтрока.ПометкаОбязательный Тогда
						ЗначениеФлагаГруппыОбязательность = 2;
					КонецЕсли;
				Иначе
					ЗначениеФлагаГруппыОбязательностьТЧ = Неопределено;
					Для Каждого ТекПодстрока Из ТекСтрока.ПолучитьЭлементы() Цикл
						Если ЗначениеФлагаГруппыОбязательностьТЧ = Неопределено Тогда
							ЗначениеФлагаГруппыОбязательностьТЧ = ТекПодстрока.ПометкаОбязательный;
						ИначеЕсли ЗначениеФлагаГруппыОбязательностьТЧ <> ТекПодстрока.ПометкаОбязательный Тогда
							ЗначениеФлагаГруппыОбязательностьТЧ = 2;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					ТекСтрока.ПометкаОбязательный = ЗначениеФлагаГруппыОбязательностьТЧ;
					Если ЗначениеФлагаГруппыОбязательностьТЧ <> Неопределено
						И ЗначениеФлагаГруппыОбязательность <> ЗначениеФлагаГруппыОбязательностьТЧ Тогда
						ЗначениеФлагаГруппыОбязательность = 2;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			ПервичныйДокумент.ПометкаОбязательный = ЗначениеФлагаГруппыОбязательность;
			
		КонецЦикла;
		
	ИначеЕсли Параметр = "Ответственность" Тогда
		
		ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаОтветственность = 2 Тогда
			ТекущиеДанные.ПометкаОтветственность = 0;
		КонецЕсли;
		
		УстановитьОтветственностьПодчиненныхРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаОтветственность);
		УстановитьОтветственностьРодителейРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаОтветственность);
		
		УправлениеФлагамиДереваПервичныхДокументов("Изменение");
		
	ИначеЕсли Параметр = "Изменение" Тогда
		
		ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаИзменение = 2 Тогда
			ТекущиеДанные.ПометкаИзменение = 0;
		КонецЕсли;
		
		УстановитьИзменениеПодчиненныхРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаИзменение);
		УстановитьИзменениеРодителейРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаИзменение);
		
	ИначеЕсли Параметр = "Обязательность" Тогда
		
		ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
		
		Если ТекущиеДанные.ПометкаОбязательный = 2 Тогда
			ТекущиеДанные.ПометкаОбязательный = 0;
		КонецЕсли;
		
		УстановитьОбязательностьПодчиненныхРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаОбязательный);
		УстановитьОбязательностьРодителейРекурсивно(ТекущиеДанные, ТекущиеДанные.ПометкаОбязательный);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюЭлементовФормы()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗапретитьПерепроведение", "ТолькоПросмотр", НЕ ЗапретитьПроведениеОтменуПроведения);
	
	ЗачеркнутьПерепроведение = ЗапретитьПроведениеОтменуПроведения И НЕ ЗапретитьПерепроведение;
	Элементы.ГруппаВТомЧислеПроведение.ТекущаяСтраница =
		?(ЗачеркнутьПерепроведение, Элементы.ГруппаДекорацияЗачеркнутая, Элементы.ГруппаДекорацияНезачеркнутая);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ВсеФормы", "Доступность", ВключатьВШтампВизуализацииЭП);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПервичныеДокументы", "ТолькоПросмотр", НЕ ВключатьВШтампВизуализацииЭП);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПервичныеДокументыОтметитьВсе", "Доступность", ВключатьВШтампВизуализацииЭП И НЕ ВсеФормы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ПервичныеДокументыСнятьОтметкуВсех", "Доступность", ВключатьВШтампВизуализацииЭП И НЕ ВсеФормы);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРезультатовВыполнения()
	
	Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.Добавить(0, НСтр("ru = 'Не предъявляется'"));
	Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.Добавить(1, НСтр("ru = 'Должен быть проведен'"));
	Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.Добавить(-1, НСтр("ru = 'Должен быть не проведен'"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыПроцессовРезультатыВыполнения.ПредставлениеРезультата КАК ПредставлениеРезультата,
	|	ЭтапыПроцессовРезультатыВыполнения.СтатусПослеВыполнения КАК Статус,
	|	0 КАК ТребованиеКПроведению, 
	|	ВЫБОР
	|	КОГДА ЭтапыПроцессовРезультатыВыполнения.ТребуетсяЭП
	|			ИЛИ ЭтапыПроцессовРезультатыВыполнения.ТребуетсяПростаяЭП
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ТребуетсяЭП,
	|	"""" КАК УсловиеВыполнения
	|ИЗ
	|	Справочник.ЭтапыПроцессов.РезультатыВыполнения КАК ЭтапыПроцессовРезультатыВыполнения
	|ГДЕ
	|	ЭтапыПроцессовРезультатыВыполнения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Параметры.ТекущийЭтап);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыВыполнения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ПредставлениеРезультатаИСтатус = Выборка.ПредставлениеРезультата+" ("+Выборка.Статус+")";
		НоваяСтрока.ПредставлениеТребованиеКПроведению =
			Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.НайтиПоЗначению(
				НоваяСтрока.ТребованиеКПроведению).Представление;
	КонецЦикла;
	
	Для Каждого ТребованиеКПроведению Из Параметры.ТребованияКПроведению Цикл
		ПараметрыОтбора = Новый Структура("Статус", ТребованиеКПроведению.Значение.Статус);
		НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			РезультатВыполнения = НайденныеСтроки[0];
		Иначе
			РезультатВыполнения = РезультатыВыполнения.Добавить();
			РезультатВыполнения.Статус = ТребованиеКПроведению.Значение.Статус;
			РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ТребованиеКПроведению.Значение.Статус;
			РезультатВыполнения.СтатусНеНайден = Истина;
		КонецЕсли;
		РезультатВыполнения.ТребованиеКПроведению = ?(ТребованиеКПроведению.Значение.ПризнакПроведенности, 1, -1);
		РезультатВыполнения.ПредставлениеТребованиеКПроведению =
			Элементы.РезультатыВыполненияПредставлениеТребованиеКПроведению.СписокВыбора.НайтиПоЗначению(
				РезультатВыполнения.ТребованиеКПроведению).Представление;
	КонецЦикла;
	
	Для Каждого ТребованиеКВыполнению Из Параметры.ТребованияКВыполнению Цикл
		ПараметрыОтбора = Новый Структура("Статус", ТребованиеКВыполнению.Значение.Статус);
		НайденныеСтроки = РезультатыВыполнения.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			РезультатВыполнения = НайденныеСтроки[0];
		Иначе
			РезультатВыполнения = РезультатыВыполнения.Добавить();
			РезультатВыполнения.Статус = ТребованиеКВыполнению.Значение.Статус;
			РезультатВыполнения.ПредставлениеРезультатаИСтатус = НСтр("ru = 'Отстуствует статус: '") + ТребованиеКВыполнению.Значение.Статус;
			РезультатВыполнения.СтатусНеНайден = Истина;
		КонецЕсли;
		РезультатВыполнения.УсловиеВыполнения = ТребованиеКВыполнению.Значение.УсловиеВыполнения;
		РезультатВыполнения.ПредставлениеУсловияВыполнения =
			ПроцессыОбработкиДокументов.ПредставлениеОтбораКомпоновщикаНастроек(РезультатВыполнения.УсловиеВыполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ВНастройкеЕстьОтсутствующиеСтатусы()
	
	Для Каждого Результат Из РезультатыВыполнения Цикл
		Если Результат.СтатусНеНайден Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоПервичныхДокументовПоИдентификатору(Дерево, ИдентификаторДокумента)
	
	Если НЕ ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		Возврат;
	КонецЕсли;
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	ИдентификаторДокумента = Параметры.ИдентификаторДокумента;
	ИдентификаторыКомандПечатиСоШтампом = Параметры.ИдентификаторыКомандПечатиСоШтампом;
	
	ВсеФормы = ПустаяСтрока(ИдентификаторыКомандПечатиСоШтампом) И ВключатьВШтампВизуализацииЭП;
	
	ИдентификаторыКомандПечати = СтрРазделить(ИдентификаторыКомандПечатиСоШтампом, ",", Ложь);
	
	КодыНастройкиФормированияИПодписанияФормуляровПоИдентификаторам = СтрРазделить(КодыНастройкиФормированияИПодписанияФормуляров, ",", Ложь);
	ИдентификаторыПФНастройкиФормированияИПодписанияФормуляровПоИдентификаторам = СтрРазделить(ИдентификаторыКомандПечатиСоШтампом, ",", Ложь);
	
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	
	ИсточникиКомандПечати = МодульУправлениеПечатью.ИсточникиКомандПечати();
	Если ИсточникиКомандПечати.Найти(ОбъектМетаданных) = Неопределено Тогда
		КомандыПечати = Новый Массив;
	Иначе
		КомандыПечати = МодульУправлениеПечатью.КомандыПечатиОбъекта(ОбъектМетаданных);
	КонецЕсли;
	
	 ТаблицаКомандПечатиИсключений = ПроцессыОбработкиДокументов.ПодготовитьТаблицуИсключенийПервичныхДокументов();
	 ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииТаблицыИсключенийПервичныхДокументов(ТаблицаКомандПечатиИсключений);

	 Для Каждого КомандаПечати Из КомандыПечати Цикл
		 
	    КомандаПечатиНеИспользуется = Ложь;
		ЗначениеПустойСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента, "ЗначениеПустойСсылки");
		СтруктураОтбора = Новый Структура;  
		СтруктураОтбора.Вставить("УчетныйДокумент", ЗначениеПустойСсылки);  
		СтруктураОтбора.Вставить("ИдентификаторКомандыПечати", КомандаПечати.Идентификатор);  
		
		КомандаПечатиИсключение = ТаблицаКомандПечатиИсключений.НайтиСтроки(СтруктураОтбора);
		
		Если КомандаПечатиИсключение.Количество() > 0  Тогда
			Если КомандаПечатиИсключение[0].СкрыватьКомандуПечати Тогда
				 
				ИндексКомандыПечати = ИдентификаторыКомандПечати.Найти(КомандаПечати.Идентификатор);
				
				Если НЕ (ВсеФормы ИЛИ ИндексКомандыПечати <> Неопределено) Тогда
					
					// удаляем из списка команд печати
					Если ИндексКомандыПечати <> Неопределено Тогда
						ИдентификаторыКомандПечати.Удалить(ИндексКомандыПечати);
					КонецЕсли;
					
					// не выводим на форму совсем
					Продолжить;
				Иначе	
					 КомандаПечатиНеИспользуется = Истина;
				КонецЕсли;	
				
			Иначе
				КомандаПечатиНеИспользуется = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		// для внешних печатных форм добавляем уникальный идентификатор
		Если КомандаПечати.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
			КомандаПечати.Идентификатор = КомандаПечати.Идентификатор + КомандаПечати.УникальныйИдентификатор;
		КонецЕсли;
		
		НоваяКоманда = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКоманда, КомандаПечати);
		
		НоваяКоманда.НомерКартинки = 0;
		
		ИндексКомандыПечати = ИдентификаторыКомандПечати.Найти(КомандаПечати.Идентификатор);
		
		Если ВсеФормы ИЛИ ИндексКомандыПечати <> Неопределено Тогда
			НоваяКоманда.Пометка = Истина;
		КонецЕсли;   
		
		Если КомандаПечатиНеИспользуется Тогда
			 НоваяКоманда.НеИспользуется = Истина; 
 			 НоваяКоманда.ПричинаНеИспользования = КомандаПечатиИсключение[0].ПричинаИсключенияКомандыПечати;
		КонецЕсли;
		
		Если ИндексКомандыПечати <> Неопределено Тогда
			ИдентификаторыКомандПечати.Удалить(ИндексКомандыПечати);
		КонецЕсли;
		
		Если КодыНастройкиФормированияИПодписанияФормуляровПоИдентификаторам.Количество() > 0 Тогда
			ИндексПФ = ИдентификаторыПФНастройкиФормированияИПодписанияФормуляровПоИдентификаторам.Найти(КомандаПечати.Идентификатор);
			Если ИндексПФ <> Неопределено Тогда
				КодНастройкиДляФормуляра = КодыНастройкиФормированияИПодписанияФормуляровПоИдентификаторам[ИндексПФ];
				НоваяКоманда.НастройкаФормированияИПодписанияФормуляра = ПроцессыОбработкиДокументовВызовСервера.ЗначениеНастройкиФормированияИПодписанияФормуляров(
					КодНастройкиДляФормуляра);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	// Оставшиеся в массиве команды не найдены в списке команд объекта
	Для Каждого ИдентификаторКомандыПечати Из ИдентификаторыКомандПечати Цикл
		НоваяКоманда = Дерево.Строки.Добавить();
		НоваяКоманда.Пометка = Истина;
		НоваяКоманда.Идентификатор = ИдентификаторКомандыПечати;
		НоваяКоманда.Представление = ИдентификаторКомандыПечати;
		НоваяКоманда.Отсутствует = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФорматыПервичныхДокументов(Дерево, ИдентификаторДокумента)
	
	ТипТаблицаЗначений = Новый ОписаниеТипов("ТаблицаЗначений");
	
	ФорматыПервичныхДокументов = Новый Структура;
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриЗаполненииФорматовПервичныхДокументов(
		ФорматыПервичныхДокументов, ИдентификаторДокумента);
	
	Для Каждого Формат Из ФорматыПервичныхДокументов Цикл
		
		Идентификатор = Формат.Ключ;
		Реквизиты = Формат.Значение;
		
		СтрокаПервичногоДокумента = Неопределено;
		Для Каждого СтрокаДерева Из Дерево.Строки Цикл
			Если СтрокаДерева.Идентификатор = Идентификатор Тогда
				СтрокаПервичногоДокумента = СтрокаДерева;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаПервичногоДокумента = Неопределено Тогда
			СтрокаПервичногоДокумента = Дерево.Строки.Добавить();
			СтрокаПервичногоДокумента.Пометка = Ложь;
			СтрокаПервичногоДокумента.Идентификатор = Идентификатор;
			СтрокаПервичногоДокумента.Представление = Идентификатор;
			СтрокаПервичногоДокумента.Отсутствует = Истина;
		КонецЕсли;
		
		СтрокаПервичногоДокумента.ЕстьФормат = Истина;
		
		Для Каждого Реквизит Из Реквизиты["Шапка"].Колонки Цикл
			НоваяСтрока = СтрокаПервичногоДокумента.Строки.Добавить();
			НоваяСтрока.Идентификатор = Идентификатор;
			НоваяСтрока.Представление = ?(ЗначениеЗаполнено(Реквизит.Заголовок), Реквизит.Заголовок, Реквизит.Имя);
			Если Реквизит.ТипЗначения <> ТипТаблицаЗначений Тогда
				НоваяСтрока.ИмяРеквизита = Реквизит.Имя;
				НоваяСтрока.НомерКартинки = 1;
				НоваяСтрока.ПометкаИзменение = 1; // по умолчанию все реквизиты доступны
			Иначе
				НоваяСтрока.ИмяТабличнойЧасти = Реквизит.Имя;
				НоваяСтрока.НомерКартинки = 2;
				Для Каждого СтрокаТЧ Из Реквизиты[Реквизит.Имя].Колонки Цикл
					НоваяСтрокаТЧ = НоваяСтрока.Строки.Добавить();
					НоваяСтрокаТЧ.Идентификатор = Идентификатор;
					НоваяСтрокаТЧ.ИмяТабличнойЧасти = НоваяСтрока.ИмяТабличнойЧасти;
					НоваяСтрокаТЧ.ИмяРеквизита = СтрокаТЧ.Имя;
					НоваяСтрокаТЧ.Представление = ?(ЗначениеЗаполнено(СтрокаТЧ.Заголовок), СтрокаТЧ.Заголовок, СтрокаТЧ.Имя);;
					НоваяСтрокаТЧ.НомерКартинки = 1;
					НоваяСтрокаТЧ.ПометкаИзменение = 1; // по умолчанию все реквизиты доступны
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственностьПодчиненныхРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	Если СтрокаДерева.ЗапрещеноРедактированиеОтветственности Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева.ПометкаОтветственность = ЗначениеФлага;
	Если ЗначениеФлага = 1 Тогда
		СтрокаДерева.ПометкаИзменение = 1;
	КонецЕсли;
	
	Для Каждого Элемент Из СтрокаДерева.ПолучитьЭлементы() Цикл
		УстановитьОтветственностьПодчиненныхРекурсивно(Элемент, ЗначениеФлага)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтветственностьРодителейРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФлагаГруппы = ЗначениеФлага;
	Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
		Если Элемент.ЗапрещеноРедактированиеОтветственности Тогда
			Продолжить;
		КонецЕсли;
		Если Элемент.ПометкаОтветственность <> ЗначениеФлага Тогда
			ЗначениеФлагаГруппы = 2;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Родитель.ПометкаОтветственность = ЗначениеФлагаГруппы;
	
	УстановитьОтветственностьРодителейРекурсивно(Родитель, ЗначениеФлага);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзменениеПодчиненныхРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	Если СтрокаДерева.ЗапрещеноРедактированиеОтветственности Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаДерева.ПометкаИзменение = ЗначениеФлага;
	
	Для Каждого Элемент Из СтрокаДерева.ПолучитьЭлементы() Цикл
		УстановитьИзменениеПодчиненныхРекурсивно(Элемент, ЗначениеФлага)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзменениеРодителейРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФлагаГруппы = ЗначениеФлага;
	Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
		Если Элемент.ЗапрещеноРедактированиеОтветственности Тогда
			Продолжить;
		КонецЕсли;
		Если Элемент.ПометкаИзменение <> ЗначениеФлага Тогда
			ЗначениеФлагаГруппы = 2;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Родитель.ПометкаИзменение = ЗначениеФлагаГруппы;
	
	УстановитьИзменениеРодителейРекурсивно(Родитель, ЗначениеФлага);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьПодчиненныхРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	СтрокаДерева.ПометкаОбязательный = ЗначениеФлага;
	
	Для Каждого Элемент Из СтрокаДерева.ПолучитьЭлементы() Цикл
		УстановитьОбязательностьПодчиненныхРекурсивно(Элемент, ЗначениеФлага)
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбязательностьРодителейРекурсивно(СтрокаДерева, ЗначениеФлага)
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеФлагаГруппы = ЗначениеФлага;
	Для Каждого Элемент Из Родитель.ПолучитьЭлементы() Цикл
		Если Элемент.ПометкаОбязательный <> ЗначениеФлага Тогда
			ЗначениеФлагаГруппы = 2;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Родитель.ПометкаОбязательный = ЗначениеФлагаГруппы;
	
	УстановитьОбязательностьРодителейРекурсивно(Родитель, ЗначениеФлага);
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваРеквизитовОтветственностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ДополнительныеПараметры.ЭлементыДляОбработки Цикл
		Если Элемент.ЗапрещеноРедактированиеОтветственности Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент.ПометкаОтветственность = ДополнительныеПараметры.ЗначениеФлага;
		
		Если ДополнительныеПараметры.ЗначениеФлага = 1 Тогда
			Элемент.ПометкаДоступность = 1;
			Элемент.ПометкаИзменение = 1;
			Элемент.ЗапрещеноРедактированиеИзменения = 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваРеквизитовДоступностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ДополнительныеПараметры.ЭлементыДляОбработки Цикл
		Элемент.ПометкаДоступность = ДополнительныеПараметры.ЗначениеФлага;
		
		Элемент.ПометкаИзменение = Элемент.ПометкаДоступность;
		Элемент.ЗапрещеноРедактированиеИзменения = Элемент.ПометкаДоступность = 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваРеквизитовИзменениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ДополнительныеПараметры.ЭлементыДляОбработки Цикл
		Если Элемент.ЗапрещеноРедактированиеИзменения Тогда
			Продолжить;
		КонецЕсли;
		Элемент.ПометкаИзменение = ДополнительныеПараметры.ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФлагамиДереваРеквизитовОбязательностьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ДополнительныеПараметры.ЭлементыДляОбработки Цикл
		Элемент.ПометкаОбязательный = ДополнительныеПараметры.ЗначениеФлага;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗамечанияКИнтеграцииМеханизмаФормированияФормуляров()
	Результат = Ложь;
	
	ПроверяемыйДокумент = Документы.ФормулярПервичногоДокументаПОД.ПустаяСсылка();
	Если НЕ Метаданные.ОпределяемыеТипы.ВладелецПрисоединенныхФайлов.Тип.СодержитТип(ТипЗнч(ПроверяемыйДокумент)) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если НЕ Метаданные.ОпределяемыеТипы.ПолеРегистраКлючейДоступаКРегистрам.Тип.СодержитТип(ТипЗнч(ПроверяемыйДокумент)) Тогда
		Результат = Истина;
	КонецЕсли;
	
	ПроверяемыйСправочник = Справочники.ФормулярПервичногоДокументаПОДПрисоединенныеФайлы.ПустаяСсылка();
	Если НЕ Метаданные.ОпределяемыеТипы.ПодписанныйОбъект.Тип.СодержитТип(ТипЗнч(ПроверяемыйСправочник)) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если НЕ Метаданные.ОпределяемыеТипы.ПрисоединенныйФайл.Тип.СодержитТип(ТипЗнч(ПроверяемыйСправочник)) Тогда
		Результат = Истина;
	КонецЕсли;
	
    Возврат Результат;
КонецФункции	

&НаКлиенте
// Выделяет полужирным строку по разделителю.
//
// Параметры:
//  Текст  - Строка - текст, в котором нужно сделать форматное выделение.
//  Разделитель - Строка - разделитель, внутри которой будет выделение.
//  
// Возвращаемое значение:
//  ФорматированнаяСтрока - с полужирным выделением между разделителей.
//
Функция ВыделитьСтрокуПолужирнымПоРазделителю(Текст, Разделитель)
	   МассивФорматныхСтрок = Новый Массив;
	
	   МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст, Разделитель);
	   
	   Для Каждого ПодСтрока Из МассивПодстрок Цикл
	         ИндексСтроки=МассивПодстрок.Найти(ПодСтрока);
			 			 
			 Если ИндексСтроки%2 Тогда
				  МассивФорматныхСтрок.Добавить(Новый ФорматированнаяСтрока(Разделитель + ПодСтрока + Разделитель, Новый Шрифт(,,Истина)));
			  Иначе
				  МассивФорматныхСтрок.Добавить(Новый ФорматированнаяСтрока(ПодСтрока, Новый Шрифт(,, Ложь)));
			  КонецЕсли;	
			  
		КонецЦикла;	
		
		
		Возврат Новый ФорматированнаяСтрока(МассивФорматныхСтрок);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкиУправленияСвойствамиЭлементовФормы()
	
	ПереченьТиповОграниченийДокументов = Новый Массив;
	ПроцессыОбработкиДокументовПереопределяемый.ПриПолученииОграниченийТиповДокументовУправленияСвойствамиФормы(
		ПереченьТиповОграниченийДокументов); 
	
	ПустаяСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента, "ЗначениеПустойСсылки");
	УправлениеСвойствамиФормыВозможно = ПереченьТиповОграниченийДокументов.Найти(ТипЗнч(ПустаяСсылка)) = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"НастройкаСвойствЭлементовФормыДокумента",
	"Видимость",
	УправлениеСвойствамиФормыВозможно);
	
	Если Не УправлениеСвойствамиФормыВозможно Тогда
		Возврат;
	КонецЕсли;	
	
	Если Параметры.Свойство("НедоступныеЭлементы")
		И Параметры.НедоступныеЭлементы.Количество() > 0 Тогда
		НедоступныеЭлементы.ЗагрузитьЗначения(Параметры.НедоступныеЭлементы);
	КонецЕсли;
	
	Если Параметры.Свойство("НевидимыеЭлементы")
		И Параметры.НевидимыеЭлементы.Количество() > 0 Тогда
		НевидимыеЭлементы.ЗагрузитьЗначения(Параметры.НевидимыеЭлементы);
	КонецЕсли; 
	
	Если Параметры.Свойство("ЭлементыСОтметкойНезаполненного")
		И Параметры.НевидимыеЭлементы.Количество() > 0 Тогда
		ЭлементыСОтметкойНезаполненного.ЗагрузитьЗначения(Параметры.ЭлементыСОтметкойНезаполненного);
	КонецЕсли;
	
	Если Параметры.Свойство("СтартоваяСтраница")
		И Параметры.СтартоваяСтраница.Количество() = 2 Тогда
		СтартоваяСтраница.ЗагрузитьЗначения(Параметры.СтартоваяСтраница);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти