
#Область СлужебныеПроцедурыИФункции

#Область Общее

// Перемещает элемент вверх или вниз в таблице
//
Процедура ПереместитьЭлемент(Направление, Таблица) Экспорт
	
	Если Таблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаЭлемент = Таблица.ТекущиеДанные.Ссылка;
	
	РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ПереместитьЭлемент(Направление, СсылкаНаЭлемент);
	
	Таблица.Обновить();
	
КонецПроцедуры

Функция ДиалогВыбораФайлаПоТипу(Знач ТипФайла, Знач Заголовок, Знач ИмяТипа) Экспорт
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = Заголовок;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;	
	ДиалогВыбораФайла.ПредварительныйПросмотр = Истина;
	
	Если ТипФайла <> Неопределено Тогда
		
		Если ТипЗнч(ТипФайла) <> Тип("Массив") Тогда
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипФайла);
		Иначе
			МассивТипов = ТипФайла;
		КонецЕсли;
		
		СписокРасширений = "";
		
		Для каждого ТипФайла Из МассивТипов Цикл
			
			Если ТипЗнч(ТипФайла) = Тип("ПеречислениеСсылка.ТипыЭлементовЭлектронныхРесурсов") Тогда
				РасширенияФайла = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.СоответствиеРасширенияИТипаЭлементаРесурса(ТипФайла);
				РасширенияФайлов = Новый Массив;
				Для каждого РасширениеФайла Из РасширенияФайла Цикл			
					Если РасширенияФайлов.Найти(РасширениеФайла) = Неопределено Тогда
						РасширенияФайлов.Добавить(РасширениеФайла);
					КонецЕсли;			
				КонецЦикла;	
				Для каждого Элемент Из РасширенияФайлов Цикл		
					Расширение = СтрЗаменить(Элемент.Ключ, "_", ".");			
					СписокРасширений = СписокРасширений + "*" + Расширение + ";"; 			
				КонецЦикла;				
			ИначеЕсли ТипЗнч(ТипФайла) = Тип("Строка") Тогда
				СписокРасширений = СписокРасширений + "*." + ТипФайла + ";"; 		
			Иначе
				ВызватьИсключение НСтр("ru = 'Неизвестный тип файла'");	
			КонецЕсли;
				
		КонецЦикла;				
			
		СписокРасширений = Лев(СписокРасширений, СтрДлина(СписокРасширений)-1);		
		ДиалогВыбораФайла.Фильтр = ИмяТипа + " ("+СписокРасширений+")|"+СписокРасширений+"";			
		
	КонецЕсли;
		
	Возврат ДиалогВыбораФайла;
	
КонецФункции

Функция РаскодироватьПутьКФайлуДляMacИLinux(Знач СтрокаДляРаскодировки, ПутьКФайлуСкриптаURL, ФайлыДляУдаления)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	
	Если ПутьКФайлуСкриптаURL = Неопределено Тогда
		
		ПутьКФайлуСкриптаURL = ПолучитьИмяВременногоФайла(".py");
		ФайлыДляУдаления.Добавить(ПутьКФайлуСкриптаURL);
		Текст = Новый ЗаписьТекста(ПутьКФайлуСкриптаURL, КодировкаТекста.UTF8);
		Текст.ЗаписатьСтроку("import urllib, sys;
		|print urllib.unquote(str(sys.argv[1]));");
		Текст.Закрыть();
		
		РезультатТестовойКонвертации = РаскодироватьПутьКФайлуДляMacИLinux("%21", ПутьКФайлуСкриптаURL, ФайлыДляУдаления); // Рекурсия
		
		Если РезультатТестовойКонвертации <> "!" Тогда
		 	ВызватьИсключение НСтр("ru = 'Для работы с гиперссылками в системе должен быть установлен python с пакетом urllib'");
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();	
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;	
	
	РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("python " + ПутьКФайлуСкриптаURL + " '" + СтрокаДляРаскодировки + "'", ПараметрыЗапускаПрограммы);
	Возврат СокрЛП(РезультатЗапуска.ПотокВывода);	
	
	#КонецЕсли

КонецФункции

Функция ЗакодироватьПутьКФайлуДляMacИLinux(Знач СтрокаДляКодирования, ПутьКФайлуСкриптаURLC, ФайлыДляУдаления)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	
	Если ПутьКФайлуСкриптаURLC = Неопределено Тогда
		
		ПутьКФайлуСкриптаURLC = ПолучитьИмяВременногоФайла(".py");
		ФайлыДляУдаления.Добавить(ПутьКФайлуСкриптаURLC);
		Текст = Новый ЗаписьТекста(ПутьКФайлуСкриптаURLC, КодировкаТекста.UTF8);
		Текст.ЗаписатьСтроку("import urllib, sys;
		|print urllib.quote(str(sys.argv[1]));");
		Текст.Закрыть();
		
		РезультатТестовойКонвертации = РаскодироватьПутьКФайлуДляMacИLinux("!", ПутьКФайлуСкриптаURLC, ФайлыДляУдаления); // Рекурсия
		
		Если РезультатТестовойКонвертации <> "%21" Тогда
		 	ВызватьИсключение НСтр("ru = 'Для работы с гиперссылками в системе должен быть установлен python с пакетом urllib'");
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();	
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;	
	
	РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("python " + ПутьКФайлуСкриптаURLC + " '" + СтрокаДляКодирования + "'", ПараметрыЗапускаПрограммы);
	Возврат СокрЛП(РезультатЗапуска.ПотокВывода);	
	
	#КонецЕсли

КонецФункции

Функция ПриложениеMSOfficeДоступно(ПриложениеCOM) Экспорт
	
	Если ПриложениеCOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Попытка
		ВерсияПриложения = ПриложениеCOM.Version;
	Исключение
		ВерсияПриложения = Неопределено;
		// Обработка исключения не требуется
	КонецПопытки;
	
	Если ВерсияПриложения = Неопределено Тогда
		
		ЗакрытьПриложениеMSOffice(ПриложениеCOM);
		
	КонецЕсли;
	
	Возврат ?(ВерсияПриложения = Неопределено, Ложь, Истина);
	
КонецФункции

Процедура ЗакрытьПриложениеMSOffice(ПриложениеCOM, ИнформацияОбОшибке = Неопределено, ЗавершениеРаботы = Ложь) Экспорт
	
	Если ПриложениеCOM <> Неопределено Тогда
		
		Попытка			
			ПриложениеCOM.Quit(0);
		Исключение
			// Не требуется
		КонецПопытки;
		
	КонецЕсли;		
	
	ПриложениеCOM = Неопределено;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		
		Если НЕ ЗавершениеРаботы Тогда
			
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
				НСтр("ru = 'Электронное обучение'"),
				"Ошибка",
				ИнформацияОбОшибке,
				,
				Истина
			);
			
		КонецЕсли;
			
		ВызватьИсключение (НСтр("ru = 'Ошибка при открытии файла.'") + Символы.ПС + ИнформацияОбОшибке);		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПриложениеOpenOfficeДоступно(ПриложениеCOM)
	
	Если ПриложениеCOM = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Попытка
		ПриложениеCOM.Desktop.Title = "V8SDO";
		ИмяПриложения = ПриложениеCOM.Desktop.Title;
	Исключение
		ИмяПриложения = Неопределено;
		// Обработка исключения не требуется
	КонецПопытки;
	
	Если ИмяПриложения = Неопределено Тогда		
		ЗакрытьПриложениеOpenOffice(ПриложениеCOM);		
	КонецЕсли;
	
	Возврат ?(ИмяПриложения = Неопределено, Ложь, Истина);	
	
КонецФункции

Процедура ЗакрытьПриложениеOpenOffice(ПриложениеCOM, ИнформацияОбОшибке = Неопределено) Экспорт
	
	Если ПриложениеCOM <> Неопределено Тогда
		Попытка			
			ПриложениеCOM.Desktop.terminate();
		Исключение
			ЭлектронноеОбучениеСлужебныйКлиент.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), "ПриложениеCOM.Desktop.terminate()");
		КонецПопытки;		
	КонецЕсли;		
	
	ПриложениеCOM = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область Документы

// Ярлыки и ссылки

Процедура РазместитьЯрлыкиНаЭлементыСодержания(НавигационноеДерево, Приложение, ЭлементСодержанияДокумента, РодительскийЭлементСодержания, Форма)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами Word используйте тонкий клиент'");
	
	#Иначе
	
	ДанныеРабочегоКаталога = Приложение.РабочийКаталог;
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		
		ПриложениеShell = Неопределено;
		
		Попытка
			ПриложениеShell = Новый COMObject("WScript.Shell");
		Исключение
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ЭлектронноеОбучениеСлужебныйКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), "Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение НСтр("ru = 'Невозможно создать объект WScript.Shell'");
		КонецПопытки;
		
		ЗаписьТекстаСкрипта = Новый ЗаписьТекста(ДанныеРабочегоКаталога.Путь + "showItem.vbs", КодировкаТекста.ANSI);
		
		ЗаголовокКлиентскогоПриложения = "";
		ОкнаКлиентскогоПриложения = ПолучитьОкна();
		Для Каждого ОкноКлиентскогоПриложения Из ОкнаКлиентскогоПриложения Цикл
			Если ОкноКлиентскогоПриложения.Основное Тогда
				ЗаголовокКлиентскогоПриложения = ОкноКлиентскогоПриложения.Заголовок;
			КонецЕсли;
	    КонецЦикла;
		
		ТекстСкрипта = "'Скрипт открывает гиперссылку внутри 1С
			|Sub Main()
			|Set fs = CreateObject(""Scripting.FileSystemObject"")
			|Set txt = fs.CreateTextFile(WScript.Arguments(1) + ""item.txt"", True)
			|txt.WriteLine(WScript.Arguments(0))		
			|txt.Close		
			|Set Shell = CreateObject(""WScript.shell"")
			|Shell.AppActivate("""+ЗаголовокКлиентскогоПриложения+""")				
		 	|End Sub 
		 	|call Main
			|";
		
		ЗаписьТекстаСкрипта.ЗаписатьСтроку(ТекстСкрипта);
		ЗаписьТекстаСкрипта.Закрыть();		
		
		// Запоминаем путь к файлу за которым будем следить в Подключаемый_ОжиданиеОткрытияЭлементаПоСсылкеДокумента
		
		ПутьККаталогуСФайломОжидания = ДанныеРабочегоКаталога.Путь;
		Форма.ПутьКФайлуОжиданияОткрытияГиперссылки = ПутьККаталогуСФайломОжидания + "item.txt";
		
	Иначе
		
		// Запоминаем путь к файлу за которым будем следить в Подключаемый_ОжиданиеОткрытияЭлементаПоСсылкеДокумента
		
		ПутьККаталогуСФайломОжидания = КаталогВременныхФайлов();
		ПутьККаталогуСФайломОжидания = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуСФайломОжидания);
		
		Форма.ПутьКФайлуОжиданияОткрытияГиперссылки = ПутьККаталогуСФайломОжидания + "open-e1clink.txt";
		
	КонецЕсли;
		
	ДанныеРабочегоКаталога.Ярлыки = Новый Соответствие;	
	ЗаписатьЯрлыкНаЭлементСодержания(НавигационноеДерево.ПолучитьЭлементы()[0].ПолучитьЭлементы(), ДанныеРабочегоКаталога.Документ, ЭлементСодержанияДокумента, РодительскийЭлементСодержания, 0, Приложение, ПриложениеShell, ПутьККаталогуСФайломОжидания);	
	ПриложениеShell = Неопределено;	
	Форма.ПодключитьОбработчикОжидания("Подключаемый_ОжиданиеОткрытияЭлементаПоСсылкеДокумента", 1, Ложь);	
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ПрекратитьСледитьЗаОткрытиемЯрлыков(Форма)
	
	Форма.ОтключитьОбработчикОжидания("Подключаемый_ОжиданиеОткрытияЭлементаПоСсылкеДокумента");
	Форма.ПутьКФайлуОжиданияОткрытияГиперссылки = "";
	
КонецПроцедуры

Процедура ЗаписатьЯрлыкНаЭлементСодержания(СтрокиДереваЭлементов, ПутьКТекущемуКаталогу, ЭлементСодержанияДокумента, РодительскийЭлементСодержания, УровеньВложенности, Приложение, ПриложениеShell, ПутьККаталогуСФайломОжидания)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	
	Для каждого Строка Из СтрокиДереваЭлементов Цикл		
		
		Если НЕ ЗначениеЗаполнено(Строка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.ЭтоГруппа Тогда			
			
			ПутьКНовомуКаталогу = ПутьКТекущемуКаталогу + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка.Наименование, "_");			
			ПутьКНовомуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКНовомуКаталогу);			
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКНовомуКаталогу);
			ПутьКНовомуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКНовомуКаталогу);
			
			Если Строка.Ссылка = РодительскийЭлементСодержания Тогда
				Приложение.РабочийКаталог.Документ = ПутьКНовомуКаталогу;
				Приложение.РабочийКаталог.УровеньВложенностиДокумента = УровеньВложенности + 1;  // Относительно каталога курса
			КонецЕсли;			
			
			ЗаписатьЯрлыкНаЭлементСодержания(Строка.ПолучитьЭлементы(), ПутьКНовомуКаталогу, ЭлементСодержанияДокумента, РодительскийЭлементСодержания, УровеньВложенности + 1, Приложение, ПриложениеShell, ПутьККаталогуСФайломОжидания);
			
		Иначе
			
			Если ЭлементСодержанияДокумента = Строка.Ссылка Тогда
				Продолжить;
			КонецЕсли;
			
			
			Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
				ОтносительныйПуть = "";
				Для Индекс = 0 По УровеньВложенности Цикл
					ОтносительныйПуть = ОтносительныйПуть + "..\";
				КонецЦикла;				
				ПутьКФайлуЯрлыка = ПутьКТекущемуКаталогу + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка.Наименование, "_") + ".lnk";
				ПутьКФайлуЯрлыка = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлуЯрлыка);
				Ярлык = ПриложениеShell.CreateShortcut(ПутьКФайлуЯрлыка);
				Ярлык.TargetPath = "%windir%\system32\wscript.exe";
				Ярлык.Arguments =  ОтносительныйПуть + "showItem.vbs " + """" + Строка(Строка.Ссылка.УникальныйИдентификатор()) + """ """ + ОтносительныйПуть + """";
				Ярлык.WorkingDirectory = ПутьКТекущемуКаталогу;
				Ярлык.Save();				
			КонецЕсли;			
			
			Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент()Тогда
				ПутьКФайлуЯрлыка = ПутьКТекущемуКаталогу + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка.Наименование, "_") + ".e1clink";
				ПутьКФайлуЯрлыка = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлуЯрлыка);
				Текст = Новый ЗаписьТекста(ПутьКФайлуЯрлыка, КодировкаТекста.UTF8);
				Текст.ЗаписатьСтроку(Строка(Строка.Ссылка.УникальныйИдентификатор()));
				Текст.Закрыть();				
			КонецЕсли;
			
			Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
				ПутьКФайлуЯрлыка = ПутьКТекущемуКаталогу + ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка.Наименование, "_") + ".app";
				ПутьКФайлуЯрлыка = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьКФайлуЯрлыка);
				ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьКФайлуЯрлыка);
				ФайлАрхива = Новый ЧтениеZIPФайла(Приложение.Скрытое + "linkTemplate/Contents.zip");
				ФайлАрхива.ИзвлечьВсе(ПутьКФайлуЯрлыка + "/", РежимВосстановленияПутейФайловZIP.Восстанавливать); 
				ФайлАрхива.Закрыть();
				СтруктураИмениФайлаЯрлыка = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлуЯрлыка, Ложь);
				ПолноеИмяФайлаИнформации = СтруктураИмениФайлаЯрлыка.Путь + "." + СтруктураИмениФайлаЯрлыка.ИмяБезРасширения + ".e1cinfo";
				ЗаписьФайлаИнформации = Новый ЗаписьТекста(ПолноеИмяФайлаИнформации, "UTF-8");
				ЗаписьФайлаИнформации.ЗаписатьСтроку(Строка(Строка.Ссылка.УникальныйИдентификатор()));
				ЗаписьФайлаИнформации.ЗаписатьСтроку(ПутьККаталогуСФайломОжидания);
				ЗаписьФайлаИнформации.ЗаписатьСтроку(" ");
				ЗаписьФайлаИнформации.Закрыть();					
			КонецЕсли;
			
			Приложение.РабочийКаталог.Ярлыки.Вставить(ПутьКФайлуЯрлыка, Строка.Ссылка); // Запоминаем соответствие между файлом и элементом содержания
			
		КонецЕсли;		
	
	КонецЦикла;
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ЗарегистрироватьЯрлыкиДляLinux(ПриложениеOpenOffice) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ТекстСкрипта = "#! /bin/sh
	|
	|echo '<?xml version=""1.0"" encoding=""UTF-8""?>
	|<mime-info xmlns=""http://www.freedesktop.org/standards/shared-mime-info"">
	|  <mime-type type=""application/e1clink"">
	|    <comment>1C Education file link</comment>
	|    <glob pattern=""*.e1clink""/>
	|  </mime-type>
	|</mime-info>' > /usr/share/mime/packages/e1clink.xml
    |
	|sudo update-mime-database /usr/share/mime
	|
	|echo ""# Это приложение необходимо для открытия ссылок в конфигурации
	|# 1С:Электронное обучение. При открытии файла с расширением e1clink
	|# создается текстовый файл, который видит конфигурация и открывает
	|# нужный элемент электронного курса.
	|[Desktop Entry]
	|Version=1.0
	|Type=Application
	|Terminal=false
	|Exec=bash -c 'cat %U > /tmp/open-e1clink.txt'
	|Categories=Office;Finance;
	|Name[ru_RU]=1С:СДО - служебные гиперссылки
	|Name=1C:LMS - internal hyperlinks
	|Icon=1cestart
	|NoDisplay=true"" > /usr/share/applications/e1clink.desktop
	|
	|xdg-mime default /usr/share/applications/e1clink.desktop application/e1clink
	|";
	
	ПутьККаталогуВременныхФайлов = КаталогВременныхФайлов();
	ПутьККаталогуВременныхФайлов = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуВременныхФайлов);

	Если ПутьККаталогуВременныхФайлов <> "/tmp/" Тогда
		ТекстСкрипта = СтрЗаменить(ТекстСкрипта, "/tmp/", ПутьККаталогуВременныхФайлов);
	КонецЕсли;	
	
	ПутьКФайлуСкрипта = ПолучитьИмяВременногоФайла(".sh");
	ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуСкрипта, ТекстСкрипта);
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();	
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;

	РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("pkexec --user root sh " + ПутьКФайлуСкрипта, ПараметрыЗапускаПрограммы);

	Если РезультатЗапуска.КодВозврата = 0 Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Настройка успешно выполнена'"));
		Если ПриложениеOpenOffice <> Неопределено Тогда
			ПриложениеOpenOffice.РаботаСЯрлыками.НастроенПереходПоЯрлыкам = Истина;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'В процессе настройки произошла неизвестная ошибка'"));
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

// Работа с документами Word

Функция ЕстьПоддержкаИнтерактивнойРаботыWord() Экспорт
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие; // Глобальная переменная
	КонецЕсли;	

	ИмяПараметра = "ЭлектронныеРесурсы.ЕстьПоддержкаДокументовWord";
	
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
	
		ЕстьПоддержка = Ложь;
		
		#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда

		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент()
			ИЛИ ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда					
			ЕстьПоддержка = Истина;			
		КонецЕсли;	
			
		#КонецЕсли	
			
		ПараметрыПриложения.Вставить(ИмяПараметра, ЕстьПоддержка);
		
	Иначе
		
		ЕстьПоддержка = ПараметрыПриложения[ИмяПараметра];	
		
	КонецЕсли;
	
	Возврат ЕстьПоддержка;
	
КонецФункции

Процедура ИнициализироватьПриложениеWord(Приложение, НаименованиеКурса = Неопределено, ПутьКРабочемуКаталогуПользователя = Неопределено) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами MS Office используйте тонкий клиент'");
	
	#Иначе

	// Инициализируем приложение
	//
	
	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов в Linux используйте формат OpenOffice.'"));
		Возврат;
	КонецЕсли;	
	
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("Пользовательское, Скрытое, Версия, Документ, РабочийКаталог, ПропуститьЗапись");
	КонецЕсли;
	
	// Свойства Пользовательское и Скрытое для Windows хранят COM объекты Word, а
	// для macOS Пользовательское хранит имя приложения Word, а Скрытое путь к каталогу со скриптами.	
	
	Приложение.ПропуститьЗапись = Ложь;
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
	
		Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское)
			ИЛИ НЕ ПриложениеMSOfficeДоступно(Приложение.Скрытое) Тогда		
			
			Приложение.Пользовательское = ПриложениеMSWord(Приложение.Пользовательское); 
			Приложение.Скрытое = ПриложениеMSWord(Приложение.Скрытое);
			
			Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское)
				ИЛИ НЕ ПриложениеMSOfficeДоступно(Приложение.Скрытое) Тогда
				
				Приложение = Неопределено;		
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов Word требуется установить MS Office на этот компьютер'"));
				Возврат;
				
			КонецЕсли;
			
			Приложение.Скрытое.Visible = Ложь;
			
		КонецЕсли;		
		
		Если Приложение.Версия = Неопределено Тогда
			Приложение.Версия = Число(ЭлектронноеОбучениеСлужебныйКлиентСервер.СтрокаВебРазделить(Приложение.Пользовательское.Version, ".")[0]);	
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент()
		И Приложение.Пользовательское = Неопределено Тогда
		
		// Распаковываем архив со скриптами для macOS
		
		ДвоичныеДанныеАрхиваСоСкриптами = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДвоичныеДанныеПрограммы("КомпонентаКонвертерДокументовДляMac");
		
		ПутьКВременномуФайлуАрхиваСоСкриптами = ПолучитьИмяВременногоФайла("zip");
		ДвоичныеДанныеАрхиваСоСкриптами.Записать(ПутьКВременномуФайлуАрхиваСоСкриптами);		
		
		Приложение.Скрытое = ПолучитьИмяВременногоФайла("");
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(Приложение.Скрытое);	
		Приложение.Скрытое = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(Приложение.Скрытое);			
				
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКВременномуФайлуАрхиваСоСкриптами);
		ФайлАрхива.ИзвлечьВсе(Приложение.Скрытое, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 
		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКВременномуФайлуАрхиваСоСкриптами);
		
		// Проверяем установлена ли программа Word
		
		ПутьКФайлуПрограммыПоискаWord = Приложение.Скрытое + "getWordAppName.scpt";
		ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
		ИмяПрограммы = ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыПоискаWord + """", ПараметрыЗапускаПрограммы).ПотокВывода;
		ИмяПрограммы = СокрЛП(ИмяПрограммы);
		
		Если НЕ СтрЗаканчиваетсяНа(ИмяПрограммы, ".app") Тогда
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов doc и docx требуется установить Microsoft Word на этот компьютер'"));
			Возврат;
		КонецЕсли;		
		
		Приложение.Пользовательское = ИмяПрограммы;
		
	КонецЕсли;
	
	// Рабочий каталог
	//
	
	РабочийКаталог = Новый Структура("Путь, Документ, Копия, ФайлДляСохранения, ЭтоВременный, ИмяФайла, Ярлыки, УровеньВложенностиДокумента, ИмяКаталогаКурса");		
	
	// Примечание: параметры Документ и Копия хранят пути к каталогам для размещения
	// документов, а не пути к документам.
	
	РабочийКаталог.ИмяФайла = ""; // Заполним ниже после открытия/создания документа			
	РабочийКаталог.Ярлыки = Новый Соответствие; // Заполняется при создании ярлыков рядом с документом
	РабочийКаталог.УровеньВложенностиДокумента = 0; // Заполняется при создании ярлыков		
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда	
		
		Если ПутьКРабочемуКаталогуПользователя = Неопределено Тогда
		
			// Рабочий каталог
			
			РабочийКаталог.Путь = ПолучитьИмяВременногоФайла("");
			РабочийКаталог.ЭтоВременный = Истина;
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Путь);	
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);				
			
			// Путь для сохранения документа
				
			ИмяКаталогаДокумента = ?(НЕ ЗначениеЗаполнено(НаименованиеКурса), "Course", ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеКурса, "_"));
			РабочийКаталог.ИмяКаталогаКурса = ИмяКаталогаДокумента;
			РабочийКаталог.Документ = РабочийКаталог.Путь + ИмяКаталогаДокумента;	
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Документ);	
			РабочийКаталог.Документ = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Документ);			
			
		Иначе
			
			РабочийКаталог.ЭтоВременный = Ложь;
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(
				ПутьКРабочемуКаталогуПользователя);
			РабочийКаталог.Документ = РабочийКаталог.Путь;
			
		КонецЕсли;
			
		// Путь для хранения копии документа
		
		РабочийКаталог.Копия = ПолучитьИмяВременногоФайла("");	
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Копия);			
		РабочийКаталог.Копия = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Копия);		
				
	КонецЕсли;		
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
		
		Если ПутьКРабочемуКаталогуПользователя = Неопределено Тогда
		
			// Путь для работы с документами в каталоге Office,
			// так как в macOS запрещены не интерактивные операции вне
			// рабочих каталогов приложений.
			
			ПутьККаталогуOffice = КаталогДокументов() + "Library/Group Containers/UBF8T346G9.Office";
			КаталогOffice = Новый Файл(ПутьККаталогуOffice);
			
			Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(КаталогOffice) Тогда
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Каталог ""%1"" не найден'"), ПутьККаталогуOffice);	
			КонецЕсли;		
			
			// Рабочий каталог
			
			РабочийКаталог.Путь = ПутьККаталогуOffice + "/v8CourseDocuments";
			РабочийКаталог.ЭтоВременный = Истина;
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Путь);	
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);				
			
			// Путь для сохранения документа
				
			ИмяКаталогаДокумента = ?(НЕ ЗначениеЗаполнено(НаименованиеКурса), "Course", ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеКурса, "_"));
			РабочийКаталог.ИмяКаталогаКурса = ИмяКаталогаДокумента;
			РабочийКаталог.Документ = РабочийКаталог.Путь + ИмяКаталогаДокумента;	
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Документ);	
			РабочийКаталог.Документ = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Документ);			
			
		Иначе
			
			РабочийКаталог.ЭтоВременный = Ложь;
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(
				ПутьКРабочемуКаталогуПользователя);
			РабочийКаталог.Документ = РабочийКаталог.Путь;
			
		КонецЕсли;
			
		РабочийКаталог.Копия = ПутьККаталогуOffice + "/v8DocToHTMLConverter";
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Копия);	
		РабочийКаталог.Копия = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Копия);			
				
	КонецЕсли;			
	
	Приложение.РабочийКаталог = РабочийКаталог;

	#КонецЕсли
	
КонецПроцедуры

Процедура СформироватьДокументWordДляСохраненияВБазе(ПараметрыЗагрузки = Неопределено) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	// Делаем проверки
	//
	
	Если ПараметрыЗагрузки = Неопределено
		ИЛИ	НЕ ПараметрыЗагрузки.Свойство("Приложение")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("УникальныйИдентификатор")
		ИЛИ НЕ ПараметрыЗагрузки.Свойство("ПутьКДокументу") Тогда
		
		ВызватьИсключение НСтр("ru = 'Отсутствуют обязательные параметры загрузки документа'")
		
	КонецЕсли;
		
	ФайлДокумента = Новый Файл(ПараметрыЗагрузки.ПутьКДокументу);
	
	Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлДокумента) Тогда
		ВызватьИсключение НСтр("ru = 'Файл не найден:'") + ПараметрыЗагрузки.ПутьКДокументу
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ПутьКФайлуДокумента    = ПараметрыЗагрузки.ПутьКДокументу;	
	ПутьККаталогуДокумента = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлДокумента.Путь);
	
	Если ПараметрыЗагрузки.Свойство("ФайлыДляУдаления") Тогда
		ФайлыДляУдаления = ПараметрыЗагрузки.ФайлыДляУдаления;
	Иначе
		ФайлыДляУдаления = Новый Массив;
	КонецЕсли;
	
	ФайлыДляСохранения = Новый Массив(); // Файлы, которые реально будут сохранены в базе	
	ДокументДляСохранения = Неопределено; // Будет определен ниже	
	
	// Формируем HTML вариант документа
	//	
	
	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Загрузка документов Word в среде Linux не поддерживается.
		|Используйте LibreOffice и файлы в формате odt.'");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
		
		// Очищаем каталог конвертера
		//
		
		ПолноеИмяКаталогаКонвертера = ЭлектронноеОбучениеСлужебныйКлиентСервер.УдалитьКонечныйРазделительПути(ПараметрыЗагрузки.ПутьККаталогуКопииДокумента);
		ФайлыДляУдаления.Добавить(ПолноеИмяКаталогаКонвертера);
		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПолноеИмяКаталогаКонвертера);
		
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПолноеИмяКаталогаКонвертера);
		
		ПолноеИмяКаталогаHTMLКонвертера = ПолноеИмяКаталогаКонвертера + "/html";
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПолноеИмяКаталогаHTMLКонвертера);
		
		// Копируем документ в каталог конвертера	
		//
		
		ПутьКДокументуВКаталогеКонвертации = ПолноеИмяКаталогаКонвертера + "/document" + ФайлДокумента.Расширение;
		
		Попытка
			ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ПараметрыЗагрузки.ПутьКДокументу, ПутьКДокументуВКаталогеКонвертации);
		Исключение;
			ВызватьИсключение НСтр("ru = 'Невозможно скопировать документ.
			|Возможно, он открыт в другой программе.
			|Закройте все программы, которые работают с документом.'");
		КонецПопытки;
		
		ДокументДляСохранения = Новый Файл(ПутьКДокументуВКаталогеКонвертации); // Будет сохранена копия документа в базе
		// с измененными гиперссылками.
		
		// Обрабатываем гиперссылки
		//
	
		Если ПараметрыЗагрузки <> Неопределено
			И ПараметрыЗагрузки.Свойство("Ярлыки")
			И ПараметрыЗагрузки.Ярлыки.Количество() > 0 Тогда
			
			ЗаменитьГиперссылкиВСохраняемомДокументеWordНаMac(ПутьКДокументуВКаталогеКонвертации, ПараметрыЗагрузки);	
			
		КонецЕсли;
		
		// Запускаем конвертацию
		//
		
		ПутьКФайлуПрограммыКонвертации = ПараметрыЗагрузки.Приложение + "/convertDocToHTML.scpt";
		ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
		ОтветПрограммы = ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыКонвертации + """", ПараметрыЗапускаПрограммы).ПотокВывода;
		ОтветПрограммы = СокрЛП(ОтветПрограммы);		
		
		Если ОтветПрограммы <> "true" Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось сохранить документ в HTML.
			|Попробуйте завершить приложение Microsoft Word (Правой кнопкой мыши -> Завершить)
			|и попробовать сохранить изменения снова.'");
		КонецЕсли;
		
		ФайлHTML = Новый Файл(РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПутьКФайлуЗапускаДокумента(ПолноеИмяКаталогаHTMLКонвертера));							
		ФайлHTMLДополнения = Новый Файл(ПолноеИмяКаталогаHTMLКонвертера + "/" + ФайлHTML.ИмяБезРасширения + ".fld");	
		
	КонецЕсли;					
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда	
		
		ДокументДляСохранения = ФайлДокумента; // Сохраняем тот документ, который конвертируем в HTML.
		
		ПриложениеWord = ПараметрыЗагрузки.Приложение;
		
		Попытка
			ДокументКакHTML = ПриложениеWord.Documents.Open(ПутьКФайлуДокумента,,,Ложь);
		Исключение				
			// Записываем ошибку в журнал
			ЗакрытьПриложениеMSOffice(ПриложениеWord, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
			// Исключение не создаем, так как оно будет вызвано в ЗакрытьCOMПриложение
			Возврат;
		КонецПопытки;

		// Обрабатываем гиперссылки
		//		
		
		Если ПараметрыЗагрузки <> Неопределено
			И ПараметрыЗагрузки.Свойство("Ярлыки")
			И ПараметрыЗагрузки.Ярлыки.Количество() > 0 Тогда
			
			Для каждого Гиперссылка Из ДокументКакHTML.Hyperlinks Цикл
				// Делаем это до записи HTML, чтобы в сохраненном документе были гиперссылки вида sdo1c?...
				ПутьКФайлуЯрлыка = ПараметрыЗагрузки.ПутьККаталогуОригинальногоДокумента + Гиперссылка.Address;
				ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "/", "\");
				ФайлЯрлыка = Новый Файл(ПутьКФайлуЯрлыка);
				ЭлементСодержания = ПараметрыЗагрузки.Ярлыки.Получить(ФайлЯрлыка.ПолноеИмя);		
				Если ЭлементСодержания <> Неопределено Тогда
					// Это внутренняя гиперссылка				
					Гиперссылка.Address = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПрефиксВнутреннейГиперссылкиДокумента()
					+ "?item=" + Строка(ЭлементСодержания.УникальныйИдентификатор());
					ПараметрыЗагрузки.ВнутренниеГиперссылки.Вставить(Гиперссылка.Address, ЭлементСодержания);  // Для последующего сохранения в базу
				Иначе
					// Все остальные ссылки считаем внешними
					Гиперссылка.Target = "_blank"; 
				КонецЕсли;		
			КонецЦикла;
			
			ДокументКакHTML.Save();
			
		КонецЕсли;	
		
		ДокументКакHTML.WebOptions.AllowPNG = Истина;
		ДокументКакHTML.WebOptions.Encoding = 65001;
		ДокументКакHTML.WebOptions.BrowserLevel = 2;
		ДокументКакHTML.WebOptions.OptimizeForBrowser = Истина;
		ДокументКакHTML.WebOptions.RelyOnCSS = Истина;
		
		ФайлHTML = Новый Файл(РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПутьКФайлуЗапускаДокумента(ПутьККаталогуДокумента));				
		ФайлыДляУдаления.Добавить(ФайлHTML.ПолноеИмя);	
		ДокументКакHTML.SaveAs(ФайлHTML.ПолноеИмя, 10,,,Ложь,,,,,,,65001); // wdFormatFilteredHTML, UTF-8		
		ФайлHTMLДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + ".files");
		
		Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLДополнения) Тогда		
			ФайлыДляУдаления.Добавить(ФайлHTMLДополнения.ПолноеИмя);	
		КонецЕсли;	
		
			
		ДокументКакHTML.Save();	
		
		// Обрабатываем дополнительные файлы страницы (картинки в этих файлах)
		//
						
		Если ПараметрыЗагрузки <> Неопределено 
			И ПараметрыЗагрузки.Свойство("НастройкиКартинок") 
			И ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLДополнения) Тогда
			
			ПриложениеShell = Новый COMОбъект("shell.application");
			
			// Ищем все картинки в оригинальном каталоге.
			// Каждая картинка будет основой для серии картинок.
			// Серия картинок может содержать одну и более картинок.
			// Сейчас серия может содержать максимум две картинки - оригинальная и в формате PNG.
			
			СерииКартинокФайлы = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ФайлHTMLДополнения.ПолноеИмя, "image*.*", Ложь);		
			
			Для каждого ФайлКартинки Из СерииКартинокФайлы Цикл
				
				НоваяСерияКартинок = Новый Структура("Имя, Картинки", ФайлКартинки.ИмяБезРасширения, Новый Массив());			
				ДобавитьКартинкуWordВСерию(НоваяСерияКартинок.Картинки, ФайлКартинки, ПриложениеShell);			
				ПараметрыЗагрузки.НастройкиКартинок.СерииКартинок.Добавить(НоваяСерияКартинок);
				
			КонецЦикла;
			
			// Ищем картинки PNG
			Попытка		
				ДокументКакHTMLПолный = ПриложениеWord.Documents.Open(ПутьКФайлуДокумента,,,Ложь);
			Исключение				
				ЗакрытьПриложениеMSOffice(ПриложениеWord, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ЭлектронноеОбучениеСлужебныйКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), "Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
			
			ДокументКакHTMLПолный.WebOptions.AllowPNG = Истина;
			ДокументКакHTMLПолный.WebOptions.Encoding = 65001;
			ДокументКакHTMLПолный.WebOptions.BrowserLevel = 2;
			ДокументКакHTMLПолный.WebOptions.OptimizeForBrowser = Истина;
			ДокументКакHTMLПолный.WebOptions.RelyOnCSS = Истина;
			
			ФайлHTMLПолный = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_full.html");
			
			ФайлыДляУдаления.Добавить(ФайлHTMLПолный.ПолноеИмя);
			
			ДокументКакHTMLПолный.SaveAs(ФайлHTMLПолный.ПолноеИмя, 8,,,Ложь,,,,,,,65001); //wdFormatHTML, UTF-8
			
			ДокументКакHTMLПолный.Close();
			
			ФайлHTMLПолныйДополнения = Новый Файл(ПутьККаталогуДокумента + ФайлHTML.ИмяБезРасширения + "_full.files");
			
			Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLПолныйДополнения) Тогда
				
				ФайлыДляУдаления.Добавить(ФайлHTMLПолныйДополнения.ПолноеИмя);
				
				КартинкиСтандартные = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ФайлHTMLДополнения.ПолноеИмя, "image*.*", Ложь);
				КартинкиИсходные    = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ФайлHTMLПолныйДополнения.ПолноеИмя, "image*.*", Ложь);
				
				Если КартинкиСтандартные.Количество() = КартинкиИсходные.Количество() Тогда // Картинки не будут перепутаны
					
					// Копируем исходные картинки
					
					Для каждого СтандартныйФайл Из КартинкиСтандартные Цикл
						
						// Ищем исходный файл
						
						ИсходныйФайлСтандартного = Неопределено;
						
						Для каждого ИсходныйФайл Из КартинкиИсходные Цикл
							Если ИсходныйФайл.ИмяБезРасширения = СтандартныйФайл.ИмяБезРасширения Тогда
								ИсходныйФайлСтандартного = ИсходныйФайл;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Если ИсходныйФайлСтандартного = Неопределено Тогда
							Продолжить;
						КонецЕсли;
						
						НовыйДополнительныйФайл = Новый Файл(ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлHTMLДополнения.ПолноеИмя) + ИсходныйФайлСтандартного.ИмяБезРасширения + "_src" + ИсходныйФайлСтандартного.Расширение);
							
						ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ИсходныйФайлСтандартного.ПолноеИмя, НовыйДополнительныйФайл.ПолноеИмя);
							
						// Добавляем новую картинку PNG в серию
							
						ТекСерияКартинок = Неопределено;
						
						Для каждого Строка Из ПараметрыЗагрузки.НастройкиКартинок.СерииКартинок Цикл
						
							Если Строка.Имя = СтандартныйФайл.ИмяБезРасширения Тогда
								ТекСерияКартинок = Строка;
								Прервать;
							КонецЕсли;
						
						КонецЦикла;
						
						Если ТекСерияКартинок <> Неопределено Тогда
							ДобавитьКартинкуWordВСерию(ТекСерияКартинок.Картинки, НовыйДополнительныйФайл, ПриложениеShell);	
						КонецЕсли;
					
					КонецЦикла;
					
				КонецЕсли;			
				
			КонецЕсли;		
							
		КонецЕсли; // Обработка доп. файлов
		
		// Закрываем документ
		//
		
		ДокументКакHTML.Close();	
		
	КонецЕсли;
		
	// Получаем данные для индексирования
	//
	
	Если ПараметрыЗагрузки.Свойство("ТекстовыеДанныеДляИндексирования") Тогда
		
		Извлечение = Новый ИзвлечениеТекста(ФайлHTML.ПолноеИмя);
		
		ТекстФайла = "";
		
		Попытка			
			ТекстФайла = Извлечение.ПолучитьТекст();			
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Произошла ошибка при извлечении текста из файла: %1'"), ФайлHTML.ПолноеИмя);
			ЭлектронноеОбучениеСлужебныйКлиент.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		КонецПопытки;
		
		ПараметрыЗагрузки.ТекстовыеДанныеДляИндексирования = ТекстФайла;
		
	КонецЕсли;	
	
	// Копируем получившийся HTML в один каталог
	//
	
	КаталогДляСохраненияHTML = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(КаталогДляСохраненияHTML);	
	ФайлыДляУдаления.Добавить(КаталогДляСохраненияHTML);
	
	КаталогДляСохраненияHTML = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохраненияHTML);	

	Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTML) Тогда
		ВызватьИсключение НСтр("ru = 'Файл HTML не найден'");
	КонецЕсли;
	
	ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ФайлHTML.ПолноеИмя, КаталогДляСохраненияHTML + ФайлHTML.Имя);
	
	Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLДополнения) Тогда
		
		КаталогДляСохраненияДопФайлов = КаталогДляСохраненияHTML + ФайлHTMLДополнения.Имя;
		
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(КаталогДляСохраненияДопФайлов);
		
		КаталогДляСохраненияДопФайлов = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДляСохраненияДопФайлов);
		
		ДопФайлы = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(ФайлHTMLДополнения.ПолноеИмя, "*", Ложь);
		
		Для каждого ДопФайл Из ДопФайлы Цикл		
			ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ДопФайл.ПолноеИмя, КаталогДляСохраненияДопФайлов + ДопФайл.Имя);				
		КонецЦикла;
		
	КонецЕсли;
	
	// Упаковываем HTML каталог
    //	
	
	ПутьКАрхивуZIP = ПолучитьИмяВременногоФайла("zip");
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКАрхивуZIP,,,МетодСжатияZIP.Копирование);							
	ФайлZIP.Добавить(КаталогДляСохраненияHTML + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();		

	ФайлыДляУдаления.Добавить(ПутьКАрхивуZIP);
	ФайлыДляСохранения.Добавить(Новый Файл(ПутьКАрхивуZIP));
	
	// Помещаем файл в хранилище на сервере	
	//
	
	ФайлыДляСохранения.Добавить(ДокументДляСохранения);	
	ПараметрыЗагрузки.СтруктураФайлов.Добавить(ЭлектронноеОбучениеСлужебныйКлиентСервер.НовоеОписаниеФайла(ФайлДокумента, ПараметрыЗагрузки.КонтекстФайла));	
	Для каждого ФайлДляСохранения Из ФайлыДляСохранения Цикл		
		ПараметрыЗагрузки.ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлДляСохранения.ПолноеИмя));
	КонецЦикла;	
	ПоместитьФайлы(ПараметрыЗагрузки.ПередаваемыеФайлы, ПараметрыЗагрузки.ПереданныеФайлы,, Ложь, ПараметрыЗагрузки.УникальныйИдентификатор);
		
	// Удаляем старые файлы
	//
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
КонецПроцедуры

Функция ПриложениеMSWord(ПриложениеWord)	
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	Если НЕ ПриложениеMSOfficeДоступно(ПриложениеWord) Тогда

		Попытка
			ПриложениеWord = Новый COMObject("Word.Application");
			ПриложениеWord.Visible = Ложь;
			ПриложениеWord.WordBasic.DisableAutoMacros(1);
		Исключение
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ЭлектронноеОбучениеСлужебныйКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), "Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПриложениеWord = Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ПриложениеWord;
	
	#КонецЕсли
	
КонецФункции

Процедура ОткрытьДокументWord(Приложение, ВладелецФормы, Форма, Скрытно, МестоХраненияДокументаВБазе, СвойстваЭлементаКурса) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	// Инициализируем работу с приложением Word (если это уже не сделано)
	//
		
	ИнициализироватьПриложениеWord(Приложение, Строка(Форма.НаименованиеКурса));	
	
	Если Приложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РабочийКаталог = Приложение.РабочийКаталог;
	
	// Создаем ярлыки для создания гиперссылок
	//
	
	ЭлементСодержания = ?(СвойстваЭлементаКурса <> Неопределено, СвойстваЭлементаКурса.ЭлементСодержания, Неопределено);
	РодительскийЭлементСодержания = ?(СвойстваЭлементаКурса <> Неопределено, СвойстваЭлементаКурса.РодительскийЭлементСодержания, Неопределено);
	РазместитьЯрлыкиНаЭлементыСодержания(Форма.НавигационноеДерево, Приложение, ЭлементСодержания, РодительскийЭлементСодержания, Форма);
	
	// Получаем файл из базы
	//
	
	ПолныйПутьКДокументу = Неопределено;
	Если МестоХраненияДокументаВБазе <> Неопределено Тогда
		ПолныйПутьКДокументу = РабочийКаталог.Документ + СвойстваЭлементаКурса.ИмяФайла;
		ПолучитьФайл(МестоХраненияДокументаВБазе, ПолныйПутьКДокументу, Ложь);
	КонецЕсли;
	
	// Открываем документ
	//	
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда		
				
		Если МестоХраненияДокументаВБазе = Неопределено Тогда
			
			ПутьКШаблонуНовогоДокумента = Приложение.РабочийКаталог.Путь + "newDocument.docx";
			ФайлШаблонаНовогоДокумента = Новый Файл(ПутьКШаблонуНовогоДокумента);
			
			Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлШаблонаНовогоДокумента) Тогда
				ПутьКФайлуПрограммыСозданияДокумента = Приложение.Скрытое + "createNewDocument.scpt";
				ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
				ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;					
				ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыСозданияДокумента + """", ПараметрыЗапускаПрограммы);
	 		КонецЕсли;
			
			Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлШаблонаНовогоДокумента) Тогда
				ВызватьИсключение НСтр("ru = 'Невозможно создать новый документ'");
			КонецЕсли;
			
			Если СвойстваЭлементаКурса = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СвойстваЭлементаКурса.Наименование) Тогда
				НаименованиеФайла = НСтр("ru = 'Документ'");
			Иначе
				НаименованиеФайла = СвойстваЭлементаКурса.Наименование;
			КонецЕсли;
			
			РабочийКаталог.ИмяФайла = НаименованиеФайла + ".docx";			
			ПолныйПутьКДокументу = РабочийКаталог.Документ + РабочийКаталог.ИмяФайла;
			ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ФайлШаблонаНовогоДокумента.ПолноеИмя, ПолныйПутьКДокументу);
			
		Иначе
			
			РабочийКаталог.ИмяФайла = СвойстваЭлементаКурса.ИмяФайла;
			ЗаменитьГиперссылкиВОткрываемомДокументеWordНаMac(ПолныйПутьКДокументу, СвойстваЭлементаКурса, Приложение);
			
		КонецЕсли;
		
		ФайловаяСистемаКлиент.ОткрытьФайл(ПолныйПутьКДокументу);
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
	
		Если НЕ ДокументWordДоступен(Приложение) Тогда
		
			ДобавитьОбработчик Приложение.Пользовательское.Quit, Форма.ВнешнийОбработчик_ПриЗакрытииПриложенияWord;
			ДобавитьОбработчик Приложение.Пользовательское.DocumentBeforeSave, Форма.ВнешнийОбработчик_ПриЗаписиДокументаWord;	
			ДобавитьОбработчик Приложение.Пользовательское.DocumentBeforeClose, Форма.ВнешнийОбработчик_ПриЗакрытииДокументаWord;
			
			СвойстваШаблона = Неопределено;	
				
			Если МестоХраненияДокументаВБазе = Неопределено Тогда // Нет файла для открытия			
							
				Если СвойстваШаблона = Неопределено Тогда		
					Приложение.Документ = Приложение.Пользовательское.Documents.Add();
				Иначе
					Приложение.Документ = Приложение.Пользовательское.Documents.Add(СвойстваШаблона.ПутьКФайлу);
				КонецЕсли;	
				
				Если СвойстваЭлементаКурса = Неопределено ИЛИ НЕ ЗначениеЗаполнено(СвойстваЭлементаКурса.Наименование) Тогда
					НаименованиеФайла = НСтр("ru = 'Документ'");
				Иначе
					НаименованиеФайла = СвойстваЭлементаКурса.Наименование;
				КонецЕсли;

				Приложение.ПропуститьЗапись = Истина;
				
				Если Приложение.Версия < 12 Тогда
					
					Если Приложение.Версия < 11 Тогда					
						Приложение.Документ.SaveAs2000(РабочийКаталог.Документ + НаименованиеФайла + ".doc", 0,,,Ложь);					
					Иначе					
						Приложение.Документ.SaveAs(РабочийКаталог.Документ + НаименованиеФайла + ".doc", 0,,,Ложь);					
					КонецЕсли;
					
				Иначе				
					Приложение.Документ.SaveAs(РабочийКаталог.Документ + НаименованиеФайла, 16,,, Ложь);				
				КонецЕсли;		
				
			Иначе
				
				Попытка
					Приложение.Документ = Приложение.Пользовательское.Documents.Open(ПолныйПутьКДокументу,,,Ложь);
				Исключение				
					// Записываем в журнал ошибку
					ЗакрытьПриложениеMSOffice(Приложение.Пользовательское, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					// Ошибку не показываем
					Возврат;
				КонецПопытки;			
				
				// Изменяем гиперссылки
				
				РанееЗаписанныеГиперссылки = СвойстваЭлементаКурса.ВнутренниеГиперссылки;
				ПутьККаталогуОригинальногоДокумента = Приложение.РабочийКаталог.Документ;
				
				Для каждого Гиперссылка Из Приложение.Документ.Hyperlinks Цикл				
					
					ЭлементСодержания = РанееЗаписанныеГиперссылки.Получить(Гиперссылка.Address);
					
					Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
						Продолжить; // Это внешняя гиперссылка
					КонецЕсли;
					
					ПутьКФайлуЯрлыка = ПутьККаталогуОригинальногоДокумента + Гиперссылка.Address;
					ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "/", "\");
					ФайлЯрлыка = Новый Файл(ПутьКФайлуЯрлыка);
					
					Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлЯрлыка) Тогда
						Продолжить; // Файл существует, все хорошо
					КонецЕсли;
					
					ПутьКНовомуЯрлыку = Неопределено;
					
					Для каждого ЭлементСоответствия Из Приложение.РабочийКаталог.Ярлыки Цикл				
						Если ЭлементСоответствия.Значение = ЭлементСодержания Тогда
							ПутьКНовомуЯрлыку = ЭлементСоответствия.Ключ;
							Прервать;
						КонецЕсли;				
					КонецЦикла;
					
					Если ПутьКНовомуЯрлыку = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					УровеньВложенностиДокумента = Приложение.РабочийКаталог.УровеньВложенностиДокумента; // Относительно папки курса
					ПутьКЯрлыкуОтносительноКаталогаКурса = Сред(ПутьКНовомуЯрлыку, СтрДлина(Приложение.РабочийКаталог.Путь + Приложение.РабочийКаталог.ИмяКаталогаКурса) + 2);
					
					НовыйАдрес = "";
					
					Индекс = 0;
					Пока Индекс < УровеньВложенностиДокумента Цикл
						НовыйАдрес = НовыйАдрес + "..\";
						Индекс = Индекс + 1;
					КонецЦикла;
					
					НовыйАдрес = НовыйАдрес + ПутьКЯрлыкуОтносительноКаталогаКурса;
					
					Гиперссылка.Address = НовыйАдрес;				
							
				КонецЦикла;			
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(РабочийКаталог.ИмяФайла) Тогда
				РабочийКаталог.ИмяФайла = Приложение.Документ.Name;
			КонецЕсли;
			
		КонецЕсли;
		
		// Определяем видимость приложения
		//
		
		Если Скрытно Тогда		
			Приложение.Пользовательское.Visible = Ложь;		
		Иначе				
			Приложение.Пользовательское.Visible = Истина;		
			Приложение.Пользовательское.WindowState = 2;
			Приложение.Пользовательское.WindowState = 1;			
		КонецЕсли;			
		
	КонецЕсли;	
	
	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Работа с документами MS Word в Linux не поддерживается'");		
	КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры

Функция ЕстьОткрытыеДокументыWord(Приложение) Экспорт
	
	Возврат ?(
	
		Приложение <> Неопределено
		И Приложение.Пользовательское <> Неопределено
		И ПриложениеMSOfficeДоступно(Приложение.Пользовательское)
		И Приложение.Пользовательское.Documents.Count > 0
		
		, Истина, Ложь);
		
		
КонецФункции

Процедура ПриЗакрытииФормыДокументаWord(Приложение, УдалятьCOMПриложенияПриЗакрытии, Форма, ЗавершениеРаботы = Ложь) Экспорт
	
	ПрекратитьСледитьЗаОткрытиемЯрлыков(Форма);
	
	Если Приложение <> Неопределено Тогда
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			
			Если Приложение.Пользовательское <> Неопределено Тогда
				
				Попытка
					УдалитьОбработчик Приложение.Пользовательское.Quit, Форма.ПриЗакрытииВнешнегоПриложения;	
					УдалитьОбработчик Приложение.Пользовательское.DocumentBeforeSave, Форма.ПриЗаписиДокумента;	
					УдалитьОбработчик Приложение.Пользовательское.DocumentBeforeClose, Форма.ПриЗакрытииДокумента;	
				Исключение
					// Обработка исключения не требуется
				КонецПопытки;
				
				Если Приложение.Документ <> Неопределено Тогда
				
					Попытка
						Приложение.Документ.Close(0);
					Исключение	
						// Обработка исключения не требуется
					КонецПопытки;
					
				КонецЕсли;		
				
				Если УдалятьCOMПриложенияПриЗакрытии Тогда
					
					Если НЕ ЕстьОткрытыеДокументыWord(Приложение) Тогда
						// Нельзя удалять приложение, если есть открытые документы,
						// так как они могут не сохраниться.
						ЗакрытьПриложениеMSOffice(Приложение.Пользовательское,,ЗавершениеРаботы);
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;
				
			Если Приложение.Скрытое <> Неопределено
				И УдалятьCOMПриложенияПриЗакрытии Тогда
				
				ЗакрытьПриложениеMSOffice(Приложение.Скрытое,,ЗавершениеРаботы);

			КонецЕсли;		
			
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
			
			Если ЗначениеЗаполнено(Приложение.Скрытое) Тогда
				// Закрываем и записываем все открытые документы
				ПутьКФайлуПрограммыЗакрытияДокументов = Приложение.Скрытое + "closeDocuments.scpt";
				ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
				ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;					
				ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыЗакрытияДокументов + """", ПараметрыЗапускаПрограммы);
				// Удаляем временный каталог со скриптами
				ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(Приложение.Скрытое, ЗавершениеРаботы);
				Приложение.Скрытое = Неопределено;
				Приложение.Пользовательское = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		РабочийКаталог = Приложение.РабочийКаталог;
		
		Если РабочийКаталог <> Неопределено Тогда
			
			Если РабочийКаталог.ЭтоВременный Тогда
			
				Если ЗначениеЗаполнено(РабочийКаталог.Путь) Тогда					
					ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(РабочийКаталог.Путь, ЗавершениеРаботы);
				КонецЕсли;
			
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РабочийКаталог.Копия) Тогда 				
				ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(РабочийКаталог.Копия, ЗавершениеРаботы); // Удаляем каталог с копией файла (всегда)
			КонецЕсли;
			
			Приложение.РабочийКаталог = Неопределено;
			
		КонецЕсли;	
		
		Если УдалятьCOMПриложенияПриЗакрытии Тогда
			Приложение = Неопределено;
		КонецЕсли;		
		
	КонецЕсли;			
	
КонецПроцедуры

Функция ДокументWordДоступен(Приложение) Экспорт
	
	Если Приложение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Приложение.Документ = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ПриложениеMSOfficeДоступно(Приложение.Скрытое) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяДокумента = Неопределено;
	
	Попытка
		ИмяДокумента = Приложение.Документ.Name;
	Исключение
		Приложение.Документ = Неопределено;
		// Обработка исключения не требуется
	КонецПопытки;
	
	Возврат ?(ИмяДокумента = Неопределено, Ложь, Истина);
	
КонецФункции

Функция ДокументWordМодифицирован(Приложение) Экспорт
	
	Если НЕ ДокументWordДоступен(Приложение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Приложение.Документ.Saved Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция НовоеОписаниеКартинокДокументаWord(ВариантЗагрузкиКартинок = Неопределено) Экспорт
	Возврат Новый Структура("ВариантЗагрузкиКартинок, СерииКартинок", ?(ВариантЗагрузкиКартинок = Неопределено, ПредопределенноеЗначение("Перечисление.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.УвеличиватьСтандартные"),  ВариантЗагрузкиКартинок), Новый Массив()); // Информация о картинках, содержащихся в документе
КонецФункции

Процедура ДобавитьКартинкуWordВСерию(МассивКартинокСерии, ФайлКартинки, ПриложениеShell)
	
	ОбъектКаталога = ПриложениеShell.NameSpace(ФайлКартинки.Путь);
	ОбъектЭлемента   = ОбъектКаталога.ParseName(ФайлКартинки.Имя) ;

	МассивКартинокСерии.Добавить(Новый Структура("Имя, РазмерКартинки, РазмерФайла", ФайлКартинки.Имя, ОбъектЭлемента.ExtendedProperty("Dimensions"), ФайлКартинки.Размер()));
	
КонецПроцедуры

Процедура ЗаменитьГиперссылкиВСохраняемомДокументеWordНаMac(ПутьКДокументу, ПараметрыЗагрузки)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
	
	ВызватьИсключение НСтр("ru = 'Для работы с документами Word используйте тонкий клиент'");
		
	#Иначе
		
	ФайлыДляУдаления = Новый Массив;
	
	// Создаем временный каталог
	//
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	//
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКДокументу);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть(); 				
	
	// Получаем все гиперссылки из файла
	//
	
	РазделительСсылок = ";";
	XSLШаблонСтрока = "
	|<xsl:stylesheet
	|	version=""1.0""
	|	xmlns:xsl=""http://www.w3.org/1999/XSL/Transform""
	|	xmlns:r=""http://schemas.openxmlformats.org/package/2006/relationships""> 
	|<xsl:output method=""text"" />
	|<xsl:template match=""/"">
	|	<xsl:for-each select=""/r:Relationships/r:Relationship""><xsl:value-of select=""@Target"" />
	|	<xsl:if test=""position() != last()"">"+РазделительСсылок+"</xsl:if>
	|	</xsl:for-each>
	|</xsl:template>
	|</xsl:stylesheet>	
	|";
	
	ФайлСГиперссылками = Новый Файл(ПутьККаталогуРаспаковки + "word/_rels/document.xml.rels");	
	
	Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлСГиперссылками) Тогда
		Возврат; // Нет гиперссылок	
	КонецЕсли;
	
	ПутьКФайлуСкриптаURL = Неопределено;
	
	ЧтениеТекста = Новый ЧтениеТекста(ФайлСГиперссылками.ПолноеИмя, КодировкаТекста.UTF8);
	XMLСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ПреобразованиеXSLT = Новый ПреобразованиеXSL;
	ПреобразованиеXSLT.ЗагрузитьИзСтроки(XSLШаблонСтрока);
	
	ВсеГиперссылкиСтрока = ПреобразованиеXSLT.ПреобразоватьИзСтроки(XMLСтрока);
	ВсеГиперссылкиМассив = СтрРазделить(ВсеГиперссылкиСтрока, РазделительСсылок, Истина);	

	СоответствиеАдресовДляЗамены = Новый Соответствие;
	СписокДлинАдресов = Новый СписокЗначений;
	
	Для каждого АдресГиперссылки Из ВсеГиперссылкиМассив Цикл						
		ПутьКФайлуЯрлыка = ПараметрыЗагрузки.ПутьККаталогуОригинальногоДокумента + АдресГиперссылки;
		ПутьКФайлуЯрлыка = РаскодироватьПутьКФайлуДляMacИLinux(ПутьКФайлуЯрлыка, ПутьКФайлуСкриптаURL, ФайлыДляУдаления);
		// Исправляем bug Word, когда ошибочно используется композиция символов вместо одного символа.
		// Например, заменяем композицию символов [1080, 774] (и + ушки) на символ 1081 (й)
		ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "й", "й");
		ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "Й", "Й");
		ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "ё", "ё");
		ПутьКФайлуЯрлыка = СтрЗаменить(ПутьКФайлуЯрлыка, "Ё", "Ё");
		ФайлЯрлыка = Новый Файл(ПутьКФайлуЯрлыка);
		ПутьКФайлуЯрлыка = ФайлЯрлыка.ПолноеИмя;	
		Если СтрНачинаетсяС(ПутьКФайлуЯрлыка, "/private/var/")
			И СтрНачинаетсяС(ПутьККаталогуРаспаковки, "/var/") Тогда
			ПутьКФайлуЯрлыка = Сред(ПутьКФайлуЯрлыка, СтрДлина("/private")+1);
		КонецЕсли;		
		ЭлементСодержания = ПараметрыЗагрузки.Ярлыки.Получить(ПутьКФайлуЯрлыка);		
		Если ЭлементСодержания <> Неопределено Тогда // Это внутренняя гиперссылка			
			ВнутреннийАдресГиперссылки = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПрефиксВнутреннейГиперссылкиДокумента()
			+ "?item=" + Строка(ЭлементСодержания.УникальныйИдентификатор());
			ПараметрыЗагрузки.ВнутренниеГиперссылки.Вставить(ВнутреннийАдресГиперссылки, ЭлементСодержания);  // Для последующего сохранения в базу
			СоответствиеАдресовДляЗамены.Вставить(АдресГиперссылки, ВнутреннийАдресГиперссылки);
			СписокДлинАдресов.Добавить(СтрДлина(АдресГиперссылки), АдресГиперссылки);
		КонецЕсли;
	КонецЦикла;
	
	// Следует заменять сначала самые длинные пути, а потом короткие,
	// чтобы исключить ситуацию, когда короткая строка будет заменена
	// еще и как часть длинного пути.
	СписокДлинАдресов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Для каждого ЭлементСписка Из СписокДлинАдресов Цикл
		АдресГиперссылки = ЭлементСписка.Представление;
		ВнутреннийАдресГиперссылки = СоответствиеАдресовДляЗамены.Получить(АдресГиперссылки);
		XMLСтрока = СтрЗаменить(XMLСтрока, АдресГиперссылки, ВнутреннийАдресГиперссылки);		
	КонецЦикла;
	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ФайлСГиперссылками.ПолноеИмя, XMLСтрока);
	
	// Упаковываем новый архив
	//
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКДокументу);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
	
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ЗаменитьГиперссылкиВОткрываемомДокументеWordНаMac(ПутьКДокументу, СвойстваЭлементаКурса, Приложение)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами Word используйте тонкий клиент'");
		
	#Иначе
		
	// Делаем проверки
	//
	
	Если ТипЗнч(СвойстваЭлементаКурса.ВнутренниеГиперссылки) <> Тип("Соответствие")
		ИЛИ СвойстваЭлементаКурса.ВнутренниеГиперссылки.Количество() = 0 Тогда
		
		Возврат; // Нет гиперссылок
		
	КонецЕсли;
	
	ФайлыДляУдаления = Новый Массив;

	// Создаем временный каталог
	//
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	//
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКДокументу);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть(); 				

	
	// Читаем document.xml.rels
	//
	
	ПутьКФайлуСГиперссылками = ПутьККаталогуРаспаковки + "word/_rels/document.xml.rels"; 
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуСГиперссылками, КодировкаТекста.UTF8);
	СодержимоеДокументаСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	// Заменяем гиперссылки
	//
	
	ПутьККаталогуОригинальногоДокумента = Приложение.РабочийКаталог.Документ;
	ПутьКФайлуСкриптаURLC = Неопределено;
	
	Для каждого ЭлементСоответствияГиперссылка Из СвойстваЭлементаКурса.ВнутренниеГиперссылки Цикл
		
		ТекущийАдресГиперссылки = ЭлементСоответствияГиперссылка.Ключ;
		ЭлементСодержания = ЭлементСоответствияГиперссылка.Значение;
		
		ПутьКНовомуЯрлыку = Неопределено;
		
		Для каждого ЭлементСоответствияЯрлык Из Приложение.РабочийКаталог.Ярлыки Цикл				
			Если ЭлементСоответствияЯрлык.Значение = ЭлементСодержания Тогда
				ПутьКНовомуЯрлыку = ЭлементСоответствияЯрлык.Ключ;
				Прервать;
			КонецЕсли;				
		КонецЦикла;
		
		Если ПутьКНовомуЯрлыку = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УровеньВложенностиДокумента = Приложение.РабочийКаталог.УровеньВложенностиДокумента; // Относительно папки курса
		ПутьКЯрлыкуОтносительноКаталогаКурса = Сред(ПутьКНовомуЯрлыку, СтрДлина(Приложение.РабочийКаталог.Путь + Приложение.РабочийКаталог.ИмяКаталогаКурса) + 2);
		НовыйАдрес = "";
		
		Индекс = 0;
		Пока Индекс < УровеньВложенностиДокумента Цикл
			НовыйАдрес = НовыйАдрес + "../";
			Индекс = Индекс + 1;
		КонецЦикла;
		
		НовыйАдрес = НовыйАдрес + ПутьКЯрлыкуОтносительноКаталогаКурса;
		
		СодержимоеДокументаСтрока = СтрЗаменить(СодержимоеДокументаСтрока, ТекущийАдресГиперссылки, НовыйАдрес);
		
	КонецЦикла;
	
	// Записываем новый файл document.xml.rels
	//
	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуСГиперссылками, СодержимоеДокументаСтрока);
	
	// Упаковываем новый архив
	//
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКДокументу);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
	
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
	
КонецПроцедуры

// Работа с документами OpenOffice

Функция ИнициализироватьПриложениеWriter(Приложение, НаименованиеКурса = Неопределено, ПутьКРабочемуКаталогуПользователя = Неопределено) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
	
	#Иначе
	
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("ПутьКПриложению, РабочийКаталог, РаботаСЯрлыками");
	КонецЕсли;

	ФайлыДляУдаления = Новый Массив;
	
	// Путь к приложению
	//
	
	Если Приложение.ПутьКПриложению = Неопределено Тогда
	
		ПутьКOpenOffice = Неопределено;
		
		Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда					
			
			Попытка
				ОболочкаShell = Новый COMОбъект("Wscript.Shell");	
				ИмяПрограммы = ОболочкаShell.RegRead("HKEY_LOCAL_MACHINE\SOFTWARE\Classes\.odt\");
				КомандаСозданияДокумента = ОболочкаShell.RegRead("HKEY_CLASSES_ROOT\"+ИмяПрограммы+"\shell\new\command\");
			Исключение
				КомандаСозданияДокумента = Неопределено;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(КомандаСозданияДокумента) Тогда
				
				ПозицияФайлаЗапуска = СтрНайти(КомандаСозданияДокумента, "soffice.exe");
				
				Если ПозицияФайлаЗапуска > 0 Тогда
					ПутьКOpenOffice = Сред(КомандаСозданияДокумента, 2, ПозицияФайлаЗапуска + СтрДлина("soffice.exe") - 2);
					ПутьКOpenOffice = """" + ПутьКOpenOffice + """";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;	
		
		Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
			
			// Распаковываем архив со скриптами для macOS
			
			ДвоичныеДанныеАрхиваСоСкриптами = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДвоичныеДанныеПрограммы("КомпонентаКонвертерДокументовДляMac");
			
			ПутьКВременномуФайлуАрхиваСоСкриптами = ПолучитьИмяВременногоФайла("zip");
			ДвоичныеДанныеАрхиваСоСкриптами.Записать(ПутьКВременномуФайлуАрхиваСоСкриптами);		
			
			ВременныйКаталогСоСкриптами = ПолучитьИмяВременногоФайла("");
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ВременныйКаталогСоСкриптами);	
			ВременныйКаталогСоСкриптами = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ВременныйКаталогСоСкриптами);			
					
			ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКВременномуФайлуАрхиваСоСкриптами);
			ФайлАрхива.ИзвлечьВсе(ВременныйКаталогСоСкриптами, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
			ФайлАрхива.Закрыть(); 
			
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКВременномуФайлуАрхиваСоСкриптами);
			
			// Проверяем установлена ли программа LibreOffice
			
			ПутьКФайлуПрограммыПоискаLibreOffice = ВременныйКаталогСоСкриптами + "getLibreOfficeAppName.scpt";
			ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
			ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
			ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
			ИмяПрограммы = ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыПоискаLibreOffice + """", ПараметрыЗапускаПрограммы).ПотокВывода;
			ИмяПрограммы = СокрЛП(ИмяПрограммы);
			
			Если НЕ СтрЗаканчиваетсяНа(ИмяПрограммы, ".app") Тогда
				Приложение = Неопределено;		
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов odp требуется установить LibreOffice c модулем Writer на этот компьютер'"));
				Возврат Приложение;
			КонецЕсли;		
			
			ПутьКOpenOffice = "/Applications/"+ИмяПрограммы+"/Contents/MacOS/soffice";
			
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ВременныйКаталогСоСкриптами);
			
		КонецЕсли;					
		
		Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент()
			И ЭлектронноеОбучениеСлужебныйКлиент.КомандаLinuxДоступна("soffice") Тогда						
			ПутьКOpenOffice = "soffice";			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПутьКOpenOffice) Тогда			
			Приложение.ПутьКПриложению = ПутьКOpenOffice;				
		Иначе		
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов ODT требуется установить OpenOffice на этот компьютер'"));
			Возврат Приложение;
		КонецЕсли;		
		
	КонецЕсли;		
	
	// Настройки для работы с ярлыками
	//
	
	Если Приложение.РаботаСЯрлыками = Неопределено Тогда
		
		Приложение.РаботаСЯрлыками = Новый Структура("Доступно, НастроенПереходПоЯрлыкам, ПутиКФайламИзбранного", Ложь, Ложь, Неопределено);
	    Приложение.РаботаСЯрлыками.ПутиКФайламИзбранного = Новый Массив;
		
		Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент()
			И ЭлектронноеОбучениеСлужебныйКлиент.КомандаLinuxДоступна("xdg-mime") 
			И ЭлектронноеОбучениеСлужебныйКлиент.КомандаLinuxДоступна("pkexec") Тогда			
			
			ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
			ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
			ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
			ПутьКДомашнемуКаталогу = ФайловаяСистемаКлиент.ЗапуститьПрограмму("echo ~/", ПараметрыЗапускаПрограммы).ПотокВывода;
			ПутьКДомашнемуКаталогу = СокрЛП(ПутьКДомашнемуКаталогу);
			ПутьКДомашнемуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКДомашнемуКаталогу);
			
			МассивВозможныхПутейКФайлуИзбранного = Новый Массив;
			МассивВозможныхПутейКФайлуИзбранного.Добавить(ПутьКДомашнемуКаталогу + ".gtk-bookmarks");
			МассивВозможныхПутейКФайлуИзбранного.Добавить(ПутьКДомашнемуКаталогу + ".config/gtk-3.0/bookmarks");
			
			Для каждого ВозможныйПутьКФайлуИзбранного Из МассивВозможныхПутейКФайлуИзбранного Цикл
			
				ФайлИзбранного = Новый Файл(ВозможныйПутьКФайлуИзбранного);
				Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлИзбранного) Тогда
					Приложение.РаботаСЯрлыками.ПутиКФайламИзбранного.Добавить(ФайлИзбранного.ПолноеИмя);
					Приложение.РаботаСЯрлыками.Доступно = Истина;
				КонецЕсли;					
			
			КонецЦикла;				
			
			Если Приложение.РаботаСЯрлыками.Доступно Тогда
				
				ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
				ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
				ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;			
				РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму("xdg-mime query default application/e1clink", ПараметрыЗапускаПрограммы);

				Если РезультатЗапуска.КодВозврата = 0
					И ЗначениеЗаполнено(РезультатЗапуска.ПотокВывода)
					И СтрНайти(РезультатЗапуска.ПотокВывода, "e1clink.desktop") > 0 Тогда
					
					ФайлПриложенияE1clink = Новый Файл("/usr/share/applications/e1clink.desktop");
					
					Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлПриложенияE1clink) Тогда					
						Приложение.РаботаСЯрлыками.НастроенПереходПоЯрлыкам = Истина;
					КонецЕсли;
					
				КонецЕсли;									
				
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Рабочий каталог
	//
	
	Если Приложение.РабочийКаталог = Неопределено Тогда		
	
		РабочийКаталог = Новый Структура("Путь, Документ, Копия, ЭтоВременный, Ярлыки, УровеньВложенностиДокумента, ИмяКаталогаКурса");
		
		Если ПутьКРабочемуКаталогуПользователя = Неопределено Тогда
		
			РабочийКаталог.Путь = ПолучитьИмяВременногоФайла("");
			РабочийКаталог.ЭтоВременный = Истина;
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Путь);	
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);
			
			ИмяКаталогаДокумента = ?(НЕ ЗначениеЗаполнено(НаименованиеКурса), "Course", ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(НаименованиеКурса, "_"));
			
			РабочийКаталог.ИмяКаталогаКурса = ИмяКаталогаДокумента;
			
			РабочийКаталог.Документ = РабочийКаталог.Путь + ИмяКаталогаДокумента;
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Документ);	
			РабочийКаталог.Документ = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Документ);
			
		Иначе
			
			РабочийКаталог.ЭтоВременный = Ложь;
			РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(
				ПутьКРабочемуКаталогуПользователя);
			РабочийКаталог.Документ = РабочийКаталог.Путь;			
			
		КонецЕсли;
			
		РабочийКаталог.Копия = ПолучитьИмяВременногоФайла("");	
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Копия);			
		РабочийКаталог.Копия = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Копия);				
		
		РабочийКаталог.Ярлыки = Новый Соответствие; // Заполняется при создании ярлыков рядом с документом
		РабочийКаталог.УровеньВложенностиДокумента = 0; // Заполняется при создании ярлыков
		
		Приложение.РабочийКаталог = РабочийКаталог;		
		
		// Записываем в избранное каталог документа для Linux
		
		Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент()
			И Приложение.РаботаСЯрлыками.Доступно Тогда
						
			ПутьККаталогуВременныхФайлов = КаталогВременныхФайлов();
			ПутьККаталогуВременныхФайлов = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуВременныхФайлов);
			
			ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
			ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
			
			ПутьКФайлуСкриптаURLC = Неопределено;
			Для каждого ПутьКФайлуИзбранного Из Приложение.РаботаСЯрлыками.ПутиКФайламИзбранного Цикл
				
				// Удаляем старые записи
				
				СтрокаКоманды = "sed -i '/v8_/d' " + ПутьКФайлуИзбранного;
				РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);			
				Если РезультатЗапуска.КодВозврата <> 0 Тогда
					ПоказатьПредупреждение(,НСтр("ru = 'Произошла неизвестная ошибка при удалении элемента из файла избранного'"));
				КонецЕсли;
				
				// Добавляем новые
				
				НовыйПутьКИзбранному = ЭлектронноеОбучениеСлужебныйКлиентСервер.УдалитьКонечныйРазделительПути(РабочийКаталог.Документ);
				НовыйПутьКИзбранному = "file://" + ЗакодироватьПутьКФайлуДляMacИLinux(НовыйПутьКИзбранному, ПутьКФайлуСкриптаURLC, ФайлыДляУдаления);  
				СтрокаКоманды = "echo """ + НовыйПутьКИзбранному + """ >> " + ПутьКФайлуИзбранного;			
				РезультатЗапуска = ФайловаяСистемаКлиент.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);			
				Если РезультатЗапуска.КодВозврата <> 0 Тогда
					ВызватьИсключение НСтр("ru = 'Произошла неизвестная ошибка при добавлении элемента в файл избранного'");
				КонецЕсли;				
			
			КонецЦикла;			
					
		КонецЕсли;
		
	КонецЕсли;
	
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;		
	
	Возврат Приложение;
	
	#КонецЕсли
	
	
КонецФункции

Процедура СформироватьДокументWriterДляСохраненияВБазе(ПараметрыЗагрузки = Неопределено) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
		
	#Иначе
		
	// Делаем проверки
	//
		
	ФайлДокумента = Новый Файл(ПараметрыЗагрузки.ПутьКДокументу);
	
	Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлДокумента) Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файл не найден: %1'"), ПараметрыЗагрузки.ПутьКДокументу);
	КонецЕсли;
	
	// Получаем переменные
	//
	
	ПутьКФайлуДокумента    = ПараметрыЗагрузки.ПутьКДокументу;	
	ПутьККаталогуДокумента = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ФайлДокумента.Путь);
	ФайлыДляУдаления       = Новый Массив;	
	ФайлыДляСохранения     = Новый Массив(); // Файлы, которые реально будут сохранены в базе
	
	// Формируем HTML вариант документа
	//
	
	// Заменяем гиперссылки
	
	Если ПараметрыЗагрузки <> Неопределено
		И ПараметрыЗагрузки.Свойство("Ярлыки")
		И ПараметрыЗагрузки.Ярлыки.Количество() > 0 Тогда
		
		ЗаменитьГиперссылкиВСохраняемомДокументеWriter(ФайлДокумента.ПолноеИмя, ПараметрыЗагрузки);	
		
	КонецЕсли;	
	
	// Копируем файл во временный каталог
	
	ПутьККаталогуКопииДокумента = ПолучитьИмяВременногоФайла("");
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуКопииДокумента);
	ФайлыДляУдаления.Добавить(ПутьККаталогуКопииДокумента);
	ПутьККаталогуКопииДокумента = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуКопииДокумента);
	ПутьККопииФайла = ПутьККаталогуКопииДокумента + "document" + ФайлДокумента.Расширение;
	ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ФайлДокумента.ПолноеИмя, ПутьККопииФайла);
	
	// Создаем каталог для помещения HTML
	
	ПутьККаталогуHTML = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуHTML);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуHTML);
	ПутьККаталогуHTML = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуHTML);	
	
	// Конвертируем документ в HTML
	
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыКонвертации = " --convert-to html """+ ПутьККопииФайла +""" --outdir """+ ПутьККаталогуHTML +""" --headless";
	Результат = ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПараметрыЗагрузки.ПутьКПриложению + ПараметрыКонвертации, ПараметрыЗапускаПрограммы);
	ПутьКФайлуHTMLОригинал = ПутьККаталогуHTML + "document.html";
		
	ДатаОкончанияОжидания = ТекущаяДата() + 5;
	ФайлHTMLОригинал = Новый Файл(ПутьКФайлуHTMLОригинал);
	Пока ДатаОкончанияОжидания > ТекущаяДата() Цикл			
		Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLОригинал) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлHTMLОригинал) Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка конвертации документа OpenOffice: файл html не найден'");
	КонецЕсли;	

	// Обрабатываем HTML
	
	ПутьКФайлуHTML = ПутьККаталогуHTML + "index.html";
	ФайлHTML = Новый Файл(ПутьКФайлуHTML);
	
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.ОткрытьФайл(ПутьКФайлуHTMLОригинал);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	
	Гиперссылки = ДокументHTML.ПолучитьЭлементыПоИмени("a");

	Для каждого ЭлементВебСсылки Из Гиперссылки Цикл		
		ЭлементВебСсылки.Цель = "_blank";
	КонецЦикла;		

	ЧтениеHTML.Закрыть();
	
	ЗаписьHTML = Новый ЗаписьHTML;
	ЗаписьHTML.УстановитьСтроку();
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументHTML, ЗаписьHTML); 
	HTMLСтрока = ЗаписьHTML.Закрыть();
	
	HTMLСтрока = СтрЗаменить(HTMLСтрока, "<li></li>", "<li/>");
	HTMLСтрока = СтрЗаменить(HTMLСтрока, "windows-1251", "UTF-8");
	HTMLСтрока = СтрЗаменить(HTMLСтрока, "src=""../", "src=""");
	
	Текст = Новый ЗаписьТекста(ПутьКФайлуHTML, КодировкаТекста.UTF8);
	Текст.ЗаписатьСтроку(HTMLСтрока);
	Текст.Закрыть();
	
	ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлуHTMLОригинал);
	
	// Получаем данные для индексирования
	//	
	
	Если ПараметрыЗагрузки.Свойство("ТекстовыеДанныеДляИндексирования") Тогда
		
		Извлечение = Новый ИзвлечениеТекста(ФайлHTML.ПолноеИмя);
		
		ТекстФайла = "";
		
		Попытка			
			ТекстФайла = Извлечение.ПолучитьТекст();			
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Произошла ошибка при извлечении текста из файла: %1'"), ФайлHTML.ПолноеИмя);
			ЭлектронноеОбучениеСлужебныйКлиент.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);
		КонецПопытки;
		
		ПараметрыЗагрузки.ТекстовыеДанныеДляИндексирования = ТекстФайла;
		
	КонецЕсли;	
	
	// Упаковываем HTML каталог
	//	
	
	ПутьКАрхивуZIP = ПолучитьИмяВременногоФайла("zip");
	ФайлыДляУдаления.Добавить(ПутьКАрхивуZIP);
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКАрхивуZIP,,,МетодСжатияZIP.Копирование);							
	ФайлZIP.Добавить(ПутьККаталогуHTML + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();		
	
	ФайлыДляСохранения.Добавить(Новый Файл(ПутьКАрхивуZIP));
	
	// Помещаем файл в хранилище на сервере	
	//
	
	ФайлыДляСохранения.Добавить(ФайлДокумента);	
	ПараметрыЗагрузки.СтруктураФайлов.Добавить(ЭлектронноеОбучениеСлужебныйКлиентСервер.НовоеОписаниеФайла(ФайлДокумента, ПараметрыЗагрузки.КонтекстФайла));	
	Для каждого ФайлДляСохранения Из ФайлыДляСохранения Цикл		
		ПараметрыЗагрузки.ПередаваемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ФайлДляСохранения.ПолноеИмя));
	КонецЦикла;	
	Попытка
		ПоместитьФайлы(ПараметрыЗагрузки.ПередаваемыеФайлы, ПараметрыЗагрузки.ПереданныеФайлы,, Ложь, ПараметрыЗагрузки.УникальныйИдентификатор);
	Исключение
		ВызватьИсключение НСтр("ru = 'Ошибка совместного доступа к файлу. Возможно, файл открыт в другой программе.'");
	КонецПопытки;
		
	// Удаляем старые файлы
	//
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ОткрытьДокументWriter(Приложение, МестоХраненияДокументаВБазе, ИмяФайла, СвойстваЭлементаКурса, Форма) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
		
	#Иначе
		
	ИнициализироватьПриложениеWriter(Приложение, Строка(Форма.НаименованиеКурса));
	
	Если Приложение = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Приложение.РаботаСЯрлыками.Доступно Тогда
		РазместитьЯрлыкиНаЭлементыСодержания(Форма.НавигационноеДерево, Приложение, СвойстваЭлементаКурса.ЭлементСодержания, СвойстваЭлементаКурса.РодительскийЭлементСодержания, Форма);	
	КонецЕсли;	
	
	ПутьКДокументу = Приложение.РабочийКаталог.Документ + ИмяФайла;	
	
	ПолучитьФайл(МестоХраненияДокументаВБазе, ПутьКДокументу, Ложь);
	
	ЗаменитьГиперссылкиВОткрываемомДокументеWriter(ПутьКДокументу, СвойстваЭлементаКурса, Приложение);
	
	ФайловаяСистемаКлиент.ОткрытьФайл(ПутьКДокументу);
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ПриЗакрытииФормыДокументаWriter(Приложение, Форма, ЗавершениеРаботы = Ложь) Экспорт
	
	ПрекратитьСледитьЗаОткрытиемЯрлыков(Форма);
	
	Если Приложение <> Неопределено Тогда
		
		РабочийКаталог = Приложение.РабочийКаталог;
		
		Если РабочийКаталог <> Неопределено И РабочийКаталог.ЭтоВременный И ЗначениеЗаполнено(РабочийКаталог.Путь) Тогда
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(РабочийКаталог.Путь, ЗавершениеРаботы);
		КонецЕсли;			
		
		Если РабочийКаталог <> Неопределено И ЗначениеЗаполнено(РабочийКаталог.Копия) Тогда 				
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(РабочийКаталог.Копия, ЗавершениеРаботы); // Удаляем каталог с копией файла (всегда)
		КонецЕсли;		
		
		Приложение.РабочийКаталог = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменитьГиперссылкиВСохраняемомДокументеWriter(ПутьКДокументу, ПараметрыЗагрузки)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
		
	#Иначе
		
	Если НЕ ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Работа с гиперссылками в OpenOffice поддерживается только в Linux'");
	КонецЕсли;		
		
	ФайлыДляУдаления = Новый Массив;
	
	// Создаем временный каталог
	//
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	//
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКДокументу);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть(); 				
	
	// Читаем content.xml
	//
	
	ПутьКФайлуContent = ПутьККаталогуРаспаковки + "content.xml"; 
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуContent, КодировкаТекста.UTF8);
	СодержимоеДокументаСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	// Проверяем, есть ли хоть одна гиперссылка
	//
	
	Маркер = "<text:a";
	Если СтрНайти(СодержимоеДокументаСтрока, Маркер) = 0 Тогда
		Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	// Размещаем скрипт для конвертации адресов ссылок
	//
		
	ПутьКФайлуСкриптаURL = Неопределено;
	
	// Находим в цикле все ссылки
	//
	
	СоответствиеАдресовДляЗамены = Новый Соответствие;
	СписокДлинАдресов = Новый СписокЗначений;
	
	КоличествоСсылок = 0;
	
	НачалоПоиска = 1;
	Пока Истина Цикл		
		
		НомерМаркера = СтрНайти(СодержимоеДокументаСтрока, Маркер, , НачалоПоиска);
		
		Если НомерМаркера = 0 Тогда
			Прервать;
		КонецЕсли;
		
		КоличествоСсылок = КоличествоСсылок + 1;
		МаркерНачалаАдреса = "xlink:href=""";
		НомерНачалоСсылки = СтрНайти(СодержимоеДокументаСтрока, МаркерНачалаАдреса,, НомерМаркера) 
			+ СтрДлина(МаркерНачалаАдреса);
		
		МаркерКонцаСсылки = """";
		НомерКонцаСсылки = СтрНайти(СодержимоеДокументаСтрока, МаркерКонцаСсылки,, НомерНачалоСсылки);
		
		НачалоПоиска = НомерКонцаСсылки + 1;		
		АдресСсылкиСтрокаОригинал = Сред(СодержимоеДокументаСтрока, НомерНачалоСсылки, НомерКонцаСсылки - НомерНачалоСсылки);
		
		АдресСсылкиСтрока = РаскодироватьПутьКФайлуДляMacИLinux(АдресСсылкиСтрокаОригинал, ПутьКФайлуСкриптаURL, ФайлыДляУдаления);
		ПротоколFile = "file://";
		
		Если СтрНачинаетсяС(АдресСсылкиСтрока, ПротоколFile) Тогда
			АдресСсылкиСтрока = Сред(АдресСсылкиСтрока, СтрДлина(ПротоколFile) + 1);
		КонецЕсли;
		
		МассивПутейДляПроверки = Новый Массив;
		
		Если СтрНачинаетсяС(АдресСсылкиСтрока, "../") Тогда 
			МассивПутейДляПроверки.Добавить(ПараметрыЗагрузки.ПутьККаталогуОригинальногоДокумента + Сред(АдресСсылкиСтрока, СтрДлина("../") + 1));
			МассивПутейДляПроверки.Добавить(ПараметрыЗагрузки.ПутьККаталогуОригинальногоДокумента + Сред(АдресСсылкиСтрока, СтрДлина("../../") + 1));
		КонецЕсли;
		
		МассивПутейДляПроверки.Добавить(ПараметрыЗагрузки.ПутьККаталогуОригинальногоДокумента + АдресСсылкиСтрока);
		
		ЗаменаВыполнена = Ложь;
		Для каждого ПутьКФайлуЯрлыка Из МассивПутейДляПроверки Цикл
		
			ФайлЯрлыка = Новый Файл(ПутьКФайлуЯрлыка);			
			Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(ФайлЯрлыка) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементСодержания = ПараметрыЗагрузки.Ярлыки.Получить(ПутьКФайлуЯрлыка);
			Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
				ЭлементСодержания = ПараметрыЗагрузки.Ярлыки.Получить(ФайлЯрлыка.ПолноеИмя);
			КонецЕсли;			
			Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйАдресГиперссылки = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПрефиксВнутреннейГиперссылкиДокумента()
			+ "?item=" + Строка(ЭлементСодержания.УникальныйИдентификатор());
			СоответствиеАдресовДляЗамены.Вставить(АдресСсылкиСтрокаОригинал, НовыйАдресГиперссылки);
			СписокДлинАдресов.Добавить(СтрДлина(АдресСсылкиСтрокаОригинал), АдресСсылкиСтрокаОригинал);			
			ПараметрыЗагрузки.ВнутренниеГиперссылки.Вставить(НовыйАдресГиперссылки, ЭлементСодержания);  // Для последующего сохранения в базу
			
			ЗаменаВыполнена = Истина;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Следует заменять сначала самые длинные пути, а потом короткие,
	// чтобы исключить ситуацию, когда короткая строка будет заменена
	// еще и как часть длинного пути.
	СписокДлинАдресов.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Для каждого ЭлементСписка Из СписокДлинАдресов Цикл
		АдресГиперссылки = ЭлементСписка.Представление;
		ВнутреннийАдресГиперссылки = СоответствиеАдресовДляЗамены.Получить(АдресГиперссылки);
		СодержимоеДокументаСтрока = СтрЗаменить(СодержимоеДокументаСтрока, АдресГиперссылки, ВнутреннийАдресГиперссылки);		
	КонецЦикла;	
	
	// Записываем новый файл content.xml
	//
	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуContent, СодержимоеДокументаСтрока);
	
	// Упаковываем новый архив
	//
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКДокументу);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
	
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
КонецПроцедуры

Процедура ЗаменитьГиперссылкиВОткрываемомДокументеWriter(ПутьКДокументу, СвойстваЭлементаКурса, Приложение)
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
		
	#Иначе
		
	// Делаем проверки
	//
	
	Если ТипЗнч(СвойстваЭлементаКурса.ВнутренниеГиперссылки) <> Тип("Соответствие")
		ИЛИ СвойстваЭлементаКурса.ВнутренниеГиперссылки.Количество() = 0 Тогда
		
		Возврат; // Нет гиперссылок
		
	КонецЕсли;
		
	Если НЕ ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Работа с гиперссылками в OpenOffice поддерживается только в Linux'");
	КонецЕсли;
	
	ФайлыДляУдаления = Новый Массив;
		
	// Создаем временный каталог
	//
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	//
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКДокументу);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть(); 				
	
	// Читаем content.xml
	//
	
	ПутьКФайлуContent = ПутьККаталогуРаспаковки + "content.xml"; 
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуContent, КодировкаТекста.UTF8);
	СодержимоеДокументаСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	// Заменяем гиперссылки
	//
	
	ПутьККаталогуОригинальногоДокумента = Приложение.РабочийКаталог.Документ;
	ПутьКФайлуСкриптаURLC = Неопределено;

	Для каждого ЭлементСоответствияГиперссылка Из СвойстваЭлементаКурса.ВнутренниеГиперссылки Цикл
		
		ТекущийАдресГиперссылки = ЭлементСоответствияГиперссылка.Ключ;
		ЭлементСодержания = ЭлементСоответствияГиперссылка.Значение;
		
		ПутьКНовомуЯрлыку = Неопределено;
		
		Для каждого ЭлементСоответствияЯрлык Из Приложение.РабочийКаталог.Ярлыки Цикл				
			Если ЭлементСоответствияЯрлык.Значение = ЭлементСодержания Тогда
				ПутьКНовомуЯрлыку = ЭлементСоответствияЯрлык.Ключ;
				Прервать;
			КонецЕсли;				
		КонецЦикла;
		
		Если ПутьКНовомуЯрлыку = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УровеньВложенностиДокумента = Приложение.РабочийКаталог.УровеньВложенностиДокумента; // Относительно папки курса
		ПутьКЯрлыкуОтносительноКаталогаКурса = Сред(ПутьКНовомуЯрлыку, СтрДлина(Приложение.РабочийКаталог.Путь + Приложение.РабочийКаталог.ИмяКаталогаКурса) + 2);
		
		НовыйАдрес = "";
		
		Индекс = 0;
		Пока Индекс < УровеньВложенностиДокумента Цикл
			НовыйАдрес = НовыйАдрес + "../";
			Индекс = Индекс + 1;
		КонецЦикла;
		
		НовыйАдрес = "../" + НовыйАдрес + ПутьКЯрлыкуОтносительноКаталогаКурса;
		НовыйАдрес = ЗакодироватьПутьКФайлуДляMacИLinux(НовыйАдрес, ПутьКФайлуСкриптаURLC, ФайлыДляУдаления);
		
		СодержимоеДокументаСтрока = СтрЗаменить(СодержимоеДокументаСтрока, ТекущийАдресГиперссылки, НовыйАдрес);
		
	КонецЦикла;
	
	// Записываем новый файл content.xml
	//
	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуContent, СодержимоеДокументаСтрока);
	
	// Упаковываем новый архив
	//
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКДокументу);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
	
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	#КонецЕсли
	
	
КонецПроцедуры

#КонецОбласти

#Область Презентации

// Работа с презентациями PowerPoint

Функция ПриложениеPowerPoint(ПриложениеPPT)
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	Если НЕ ПриложениеMSOfficeДоступно(ПриложениеPPT) Тогда

		Попытка
			ПриложениеPPT = Новый COMObject("PowerPoint.Application");
			ПриложениеPPT.AutomationSecurity = 3; // msoAutomationSecurityForceDisable = 3
		Исключение
			ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ЭлектронноеОбучениеСлужебныйКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), "Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ПриложениеPPT = Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ПриложениеPPT;
	
	#КонецЕсли
	
КонецФункции

Процедура ИнициализироватьПриложениеPowerPoint(Приложение) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами MS Office используйте тонкий клиент'");
	
	#Иначе
	
	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов в Linux используйте файлы odp.'"));
		Возврат;
	КонецЕсли;	

	// Инициализируем приложение
	//
	
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("Пользовательское, Скрытое, Версия, ХранениеВБазе, ХранениеНаДиске, ХранениеНаДискеКопия, Презентация, ВыйтиИзРежимаРедактированияПослеЗаписи, РабочийКаталог");
	КонецЕсли;
	
	Приложение.ВыйтиИзРежимаРедактированияПослеЗаписи = Ложь;
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
	
		Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское) Тогда		
			Приложение.Пользовательское = ПриложениеPowerPoint(Приложение.Пользовательское);
		КонецЕсли;	
		
		Если НЕ ПриложениеMSOfficeДоступно(Приложение.Скрытое) Тогда		
			Приложение.Скрытое = ПриложениеPowerPoint(Приложение.Скрытое);
		КонецЕсли;		
		
		Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское)
			ИЛИ НЕ ПриложениеMSOfficeДоступно(Приложение.Скрытое) Тогда		
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки презентаций PowerPoint требуется установить MS Office на этот компьютер'"));
			Возврат;		
		КонецЕсли;
		
		Если Приложение.Версия = Неопределено Тогда
			Приложение.Версия = Число(ЭлектронноеОбучениеСлужебныйКлиентСервер.СтрокаВебРазделить(Приложение.Пользовательское.Version, ".")[0]);
		КонецЕсли;
		
		Если ТипЗнч(Приложение.Версия) <> Тип("Число")
			ИЛИ Приложение.Версия < 12 Тогда
			
			ВызватьИсключение НСтр("ru = 'Для работы с презентациями PowerPoint на компьютере должен быть установлен MS Office 2007 или выше'")
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент()
		И (Приложение.Скрытое = Неопределено
		ИЛИ Приложение.Пользовательское = Неопределено) Тогда
		
		// Распаковываем архив со скриптами для macOS
		
		ДвоичныеДанныеАрхиваСоСкриптами = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДвоичныеДанныеПрограммы("КомпонентаКонвертерПрезентацийДляMac");
		
		ПутьКВременномуФайлуАрхиваСоСкриптами = ПолучитьИмяВременногоФайла("zip");
		ДвоичныеДанныеАрхиваСоСкриптами.Записать(ПутьКВременномуФайлуАрхиваСоСкриптами);		
		
		Приложение.Скрытое = ПолучитьИмяВременногоФайла("");
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(Приложение.Скрытое);	
		Приложение.Скрытое = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(Приложение.Скрытое);			
				
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКВременномуФайлуАрхиваСоСкриптами);
		ФайлАрхива.ИзвлечьВсе(Приложение.Скрытое, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 
		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКВременномуФайлуАрхиваСоСкриптами);
		
		// Проверяем установлена ли программа PowerPoint
		
		ПутьКФайлуПрограммыПоискаPowerPoint = Приложение.Скрытое + "getPowerPointAppName.scpt";
		ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
		ИмяПрограммы = ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыПоискаPowerPoint + """", ПараметрыЗапускаПрограммы).ПотокВывода;
		ИмяПрограммы = СокрЛП(ИмяПрограммы);
		
		Если НЕ СтрЗаканчиваетсяНа(ИмяПрограммы, ".app") Тогда
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки презентаций требуется установить Microsoft PowerPoint на этот компьютер'"));
			Возврат;
		КонецЕсли;		
		
		Приложение.Пользовательское = ИмяПрограммы;
		
	КонецЕсли;
	
	// Рабочий каталог
	//
	
	РабочийКаталог = Новый Структура("Путь, ЭтоВременный");		
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент() Тогда
		
		ПутьККаталогуPowerPoint = 
		ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогДокументов())
		+ "Library/Containers/com.microsoft.Powerpoint/Data/Documents";
		
		КаталогPowerPoint = Новый Файл(ПутьККаталогуPowerPoint);
		
		Если НЕ ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(КаталогPowerPoint) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Каталог ""%1"" не найден'"), ПутьККаталогуPowerPoint);	
		КонецЕсли;		
		
		// Рабочий каталог
		
		РабочийКаталог.Путь = ПутьККаталогуPowerPoint + "/v8PresentationToImagesConverter";
		
		РабочийКаталогФайл = Новый Файл(РабочийКаталог.Путь);
		Если ЭлектронноеОбучениеСлужебныйКлиентСервер.ФайлСуществует(РабочийКаталогФайл) Тогда
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(РабочийКаталог.Путь);
		КонецЕсли;
		
		РабочийКаталог.ЭтоВременный = Истина;
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Путь);	
		РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);						
		
		ПолноеИмяКаталогаСКартинками = РабочийКаталог.Путь + "images";
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПолноеИмяКаталогаСКартинками);

		
	КонецЕсли;			
	
	Приложение.РабочийКаталог = РабочийКаталог;
	
	#КонецЕсли
	
КонецПроцедуры

Функция ПрезентацияPowerPointДоступна(Приложение) Экспорт
	
	Если Приложение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Приложение.Презентация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеMSOfficeДоступно(Приложение.Пользовательское) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяПрезентации = Неопределено;
	
	Попытка
		ИмяПрезентации = Приложение.Презентация.Name;
	Исключение
		Приложение.Презентация = Неопределено;
		// Обработка исключения не требуется
	КонецПопытки;
	
	Возврат ?(ИмяПрезентации = Неопределено, Ложь, Истина);
	
КонецФункции

Функция ПрезентацияPowerPointМодифицирована(Приложение) Экспорт
	
	Если НЕ ПрезентацияPowerPointДоступна(Приложение) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Приложение.Презентация.Saved Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЕстьОткрытыеПрезентацииPowerPoint(Приложение) Экспорт
	
	Возврат ?(
	
		Приложение <> Неопределено
		И Приложение.Пользовательское <> Неопределено
		И ПриложениеMSOfficeДоступно(Приложение.Пользовательское)
		И Приложение.Пользовательское.Presentations.Count > 0
		
		, Истина, Ложь);
		
		
КонецФункции

// Работа с презентациями  OpenOffice

Функция ПриложениеImpress() Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с презентациями OpenOffice используйте тонкий клиент'");
	
	#Иначе
	
	Попытка
		ServiceManager = Новый COMObject("com.sun.star.ServiceManager");
		Desktop = ServiceManager.createInstance("com.sun.star.frame.Desktop");
		DispatchHelper = ServiceManager.createInstance("com.sun.star.frame.DispatchHelper");
		Broadcaster = ServiceManager.createInstance("com.sun.star.frame.GlobalEventBroadcaster"); 
	Исключение
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ЭлектронноеОбучениеСлужебныйКлиентСервер.СобытиеЖурналаРегистрацииЭлектронныхКурсов(), "Ошибка", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Новый Структура("ServiceManager, Desktop, DispatchHelper, Broadcaster", ServiceManager, Desktop, DispatchHelper, Broadcaster);
	
	#КонецЕсли
	
КонецФункции

Процедура ИнициализироватьПриложениеImpress(Приложение) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с презентациями OpenOffice используйте тонкий клиент'");
	
	#Иначе
		
	// Приложение
	//
		
	Если Приложение = Неопределено Тогда
		Приложение = Новый Структура("Пользовательское, Скрытое, Презентация, РабочийКаталог, ХранениеВБазе, ХранениеНаДиске, ХранениеНаДискеКопия");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		
		Если НЕ ПриложениеOpenOfficeДоступно(Приложение.Пользовательское) Тогда
			Приложение.Пользовательское = ПриложениеImpress();
		КонецЕсли;
		
		Если НЕ ПриложениеOpenOfficeДоступно(Приложение.Скрытое) Тогда
			Приложение.Скрытое = ПриложениеImpress();
		КонецЕсли;
		
		Если НЕ ПриложениеOpenOfficeДоступно(Приложение.Пользовательское)
			ИЛИ НЕ ПриложениеOpenOfficeДоступно(Приложение.Скрытое) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки презентаций ODP требуется установить LibreOffice на этот компьютер'"));
			Приложение = Неопределено;
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;			
	
	Если ОбщегоНазначенияКлиент.ЭтоOSXКлиент()
		И (Приложение.Скрытое = Неопределено 
		ИЛИ Приложение.Пользовательское = Неопределено) Тогда
		
		// Распаковываем архив со скриптами для macOS
		
		ДвоичныеДанныеАрхиваСоСкриптами = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДвоичныеДанныеПрограммы("КомпонентаКонвертерПрезентацийДляMac");
		
		ПутьКВременномуФайлуАрхиваСоСкриптами = ПолучитьИмяВременногоФайла("zip");
		ДвоичныеДанныеАрхиваСоСкриптами.Записать(ПутьКВременномуФайлуАрхиваСоСкриптами);		
		
		Приложение.Скрытое = ПолучитьИмяВременногоФайла("");
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(Приложение.Скрытое);	
		Приложение.Скрытое = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(Приложение.Скрытое);			
				
		ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКВременномуФайлуАрхиваСоСкриптами);
		ФайлАрхива.ИзвлечьВсе(Приложение.Скрытое, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
		ФайлАрхива.Закрыть(); 
		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКВременномуФайлуАрхиваСоСкриптами);
		
		// Проверяем установлена ли программа LibreOffice
		
		ПутьКФайлуПрограммыПоискаLibreOffice = Приложение.Скрытое + "getLibreOfficeAppName.scpt";
		ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();			
		ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
		ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;							
		ИмяПрограммы = ФайловаяСистемаКлиент.ЗапуститьПрограмму("osascript """ + ПутьКФайлуПрограммыПоискаLibreOffice + """", ПараметрыЗапускаПрограммы).ПотокВывода;
		ИмяПрограммы = СокрЛП(ИмяПрограммы);
		
		Если НЕ СтрЗаканчиваетсяНа(ИмяПрограммы, ".app") Тогда
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки презентаций требуется установить LibreOffice c модулем Impress на этот компьютер'"));
			Возврат;
		КонецЕсли;		
		
		Приложение.Пользовательское = "/Applications/"+ИмяПрограммы+"/Contents/MacOS/soffice";
		
	КонецЕсли;	
	
	
	Если ОбщегоНазначенияКлиент.ЭтоLinuxКлиент() 
		И (Приложение.Скрытое = Неопределено 
		ИЛИ Приложение.Пользовательское = Неопределено) Тогда
		
		Если ЭлектронноеОбучениеСлужебныйКлиент.КомандаLinuxДоступна("soffice")  Тогда			
			Приложение.Скрытое = "soffice";				
		Иначе		
			Приложение = Неопределено;		
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для загрузки документов ODP требуется установить OpenOffice на этот компьютер'"));
			Возврат;
		КонецЕсли;	
		
		Приложение.Пользовательское = Приложение.Скрытое;
		
	КонецЕсли;	

	
	// Рабочий каталог
	//
		
	Если Приложение.РабочийКаталог = Неопределено Тогда
		
		РабочийКаталог = Новый Структура("Путь, ЭтоВременный");
			
		РабочийКаталог.Путь = ПолучитьИмяВременногоФайла("");
		РабочийКаталог.ЭтоВременный = Истина;
		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(РабочийКаталог.Путь);	
		РабочийКаталог.Путь = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(РабочийКаталог.Путь);
		
		Приложение.РабочийКаталог = РабочийКаталог;
		
	КонецЕсли;	
	
	#КонецЕсли
	
КонецПроцедуры

Функция ПрезентацияImpressДоступна(Приложение) Экспорт
	
	Если Приложение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если Приложение.Презентация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ПриложениеOpenOfficeДоступно(Приложение.Пользовательское) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмяПрезентации = Неопределено;
	
	Попытка
		ИмяПрезентации = Приложение.Презентация.Location;
	Исключение
		Приложение.Презентация = Неопределено;
		// Обработка исключения не требуется
	КонецПопытки;
	
	Возврат ?(ИмяПрезентации = Неопределено, Ложь, Истина);
	
КонецФункции

Функция ПараметрыВФорматеOpenOffice(Приложение, СтруктураПараметров) Экспорт
	
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
		
	ПараметрыOpenOffice = Новый COMSafeArray("VT_VARIANT", СтруктураПараметров.Количество());
	
	НомерПараметра = 0;
	Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
		
		Свойства = Приложение.ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
		Свойства.Name = ЭлементСтруктуры.Ключ;
		Свойства.Value = ЭлементСтруктуры.Значение;
		
		ПараметрыOpenOffice.SetValue(НомерПараметра, Свойства);	
		
		НомерПараметра = НомерПараметра + 1;
		
	КонецЦикла;
	
	Возврат ПараметрыOpenOffice;	
	
	#КонецЕсли
	
КонецФункции

Функция ПутьКФайлуВФорматеOpenOffice(ПолныйПутьКФайлу) Экспорт
	
	Возврат "file:///" + СтрЗаменить(ПолныйПутьКФайлу, "\", "/");
	
КонецФункции

Функция УстановитьИменаСлайдовВПрезентацииImpress(ПутьКПрезентации) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
		
	#Иначе
		
	ФайлыДляУдаления = Новый Массив;
	
	// Создаем временный каталог
	//
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);	
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	//
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКПрезентации);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть(); 				
	
	// Читаем content.xml
	//
	
	ПутьКФайлуContent = ПутьККаталогуРаспаковки + "content.xml"; 
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуContent, КодировкаТекста.UTF8);
	СодержимоеДокументаСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();	
		
	// Устанавливаем идентификаторы слайдов
	//
	
	Маркер = "<draw:page draw:name=""";
	ИдентификаторыСлайдов = Новый Массив;	
	НачалоПоиска = 1;
	КоличествоЗамен = 0;
	
	Пока Истина Цикл		
		
		НомерМаркера = СтрНайти(СодержимоеДокументаСтрока, Маркер, , НачалоПоиска);
		
		Если НомерМаркера = 0 Тогда
			Прервать;
		КонецЕсли;
		
		НомерНачалаПараметра = НомерМаркера + СтрДлина(Маркер);
		НомерКонцаПараметра = СтрНайти(СодержимоеДокументаСтрока, """",, НомерНачалаПараметра);		
		ИмяСлайда = Сред(СодержимоеДокументаСтрока, НомерНачалаПараметра, НомерКонцаПараметра - НомерНачалаПараметра);
		
		Если НЕ СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИмяСлайда) Тогда
			
			ИмяСлайда = Строка(Новый УникальныйИдентификатор());

			СодержимоеДокументаСтрока = Сред(СодержимоеДокументаСтрока, 1, НомерНачалаПараметра - 1) 
			+ ИмяСлайда
			+ Сред(СодержимоеДокументаСтрока, НомерКонцаПараметра);

		КонецЕсли;
		
		ИдентификаторыСлайдов.Добавить(ИмяСлайда);
		КоличествоЗамен = КоличествоЗамен + 1;
		НачалоПоиска = НомерКонцаПараметра + 1;
		
	КонецЦикла;
	
	Если КоличествоЗамен > 0 Тогда
		
		// Записываем новый файл content.xml
		//
		
		ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуContent, СодержимоеДокументаСтрока);
		
	КонецЕсли;
		
	// Упаковываем новый архив
	//
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКПрезентации);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
		
	// Удаляем временные файлы
	//	
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл		
		ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ПутьКФайлу);
	КонецЦикла;	
	
	// Завершаем
	//
	
	Возврат ИдентификаторыСлайдов;
	
	#КонецЕсли
	
КонецФункции

Процедура ПреобразоватьПервыйСлайдImpressВКартинку(ПриложениеImpress, ПутьКФайлуПрезентацииКурса, ПутьКаталогуСКартинками, ИдентификаторПервогоСлайда) Экспорт
	
	#Если Клиент Тогда
	
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
		ВызватьИсключение НСтр("ru = 'Процедура не может быть запущена в ОС Windows'");
	КонецЕсли;
	
	#КонецЕсли

	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
	
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
	
	#Иначе
	
	// Определяем переменные
	
	ФайлыДляУдаления = Новый Массив;
	ПутьКВременномуКаталогу = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ПутьКВременномуКаталогу);
	ФайлыДляУдаления.Добавить(ПутьКВременномуКаталогу);
	ПутьКВременномуКаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКВременномуКаталогу);
	
	// Конвертируем первый слайд в картинку 
	
	#Если Клиент Тогда
	ПараметрыЗапускаПрограммы = ФайловаяСистемаКлиент.ПараметрыЗапускаПрограммы();
	#Иначе
	ПараметрыЗапускаПрограммы = ФайловаяСистема.ПараметрыЗапускаПрограммы();
	#КонецЕсли
	
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыКонвертации = " --convert-to png """+ ПутьКФайлуПрезентацииКурса +""" --outdir """+ ПутьКВременномуКаталогу +""" --headless";
	
	#Если Клиент Тогда
	Результат = ФайловаяСистемаКлиент.ЗапуститьПрограмму(ПриложениеImpress.Пользовательское + ПараметрыКонвертации, ПараметрыЗапускаПрограммы);
	#Иначе
	Результат = ФайловаяСистема.ЗапуститьПрограмму(ПриложениеImpress.Пользовательское + ПараметрыКонвертации, ПараметрыЗапускаПрограммы);
	#КонецЕсли
	
	Если Результат.КодВозврата <> 0 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка конвертации презентации Impress: %1'"), Результат.ПотокВывода);
	КонецЕсли;
	
	СтруктураФайлаПрезентации = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлуПрезентацииКурса);
	ПутьКФайлуPNG = ПутьКВременномуКаталогу + СтруктураФайлаПрезентации.ИмяБезРасширения + ".png";
	ДатаОкончанияОжидания = ТекущаяДата() + 5;
	ФайлPNG = Новый Файл(ПутьКФайлуPNG);
	Пока ДатаОкончанияОжидания > ТекущаяДата() Цикл
		Если ФайлPNG.Существует() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ФайлPNG.Существует() Тогда
		ВызватьИсключение НСтр("ru = 'Ошибка конвертации презентации Impress: файл png не найден'");
	КонецЕсли;
	
	// Копируем файл в итоговый каталог и переименовываем
	
	ИтоговыйПутьКФайлуКартинки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКаталогуСКартинками);
	ИтоговыйПутьКФайлуКартинки = ИтоговыйПутьКФайлуКартинки + ИдентификаторПервогоСлайда + ".png";
	ЭлектронноеОбучениеСлужебныйКлиент.СкопироватьФайл(ПутьКФайлуPNG, ИтоговыйПутьКФайлуКартинки);
	
	// Удаляем временные файлы
	
	УдалитьВременныеФайлы(ФайлыДляУдаления);
	
	#КонецЕсли
	
КонецПроцедуры

Процедура УдалитьСлайдВПрезентацииImpress(ПутьКПрезентации, МассивИдентификаторовСлайдов) Экспорт	
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
	
	ВызватьИсключение НСтр("ru = 'Для работы с документами OpenOffice используйте тонкий клиент'");
	
	#Иначе
	
	Если МассивИдентификаторовСлайдов = Неопределено
		ИЛИ МассивИдентификаторовСлайдов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ФайлыДляУдаления = Новый Массив;
	
	// Создаем временный каталог
	
	ПутьККаталогуРаспаковки = ПолучитьИмяВременногоФайла("");
	ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуРаспаковки);
	ФайлыДляУдаления.Добавить(ПутьККаталогуРаспаковки);
	
	ПутьККаталогуРаспаковки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРаспаковки);	
	
	// Распаковываем ZIP
	
	ФайлАрхива = Новый ЧтениеZIPФайла(ПутьКПрезентации);
	ФайлАрхива.ИзвлечьВсе(ПутьККаталогуРаспаковки, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть();
	
	// Читаем content.xml
	
	СодержимоеДокументаСтрока = ФайлContentВСтроку(ПутьККаталогуРаспаковки);
	
	// Удаляем слайды	
	
	КоличествоУдаленных = УдалитьСлайдыВФайлеContentПрезентации(СодержимоеДокументаСтрока, МассивИдентификаторовСлайдов);
	
	// Записываем новый файл content.xml
	
	Если КоличествоУдаленных > 0 Тогда
		ПутьКФайлуContent = ПутьККаталогуРаспаковки + "content.xml"; 
		ЭлектронноеОбучениеСлужебныйКлиентСервер.ЗаписатьТекстовыйФайлUTF8БезBOM(ПутьКФайлуContent, СодержимоеДокументаСтрока);
	КонецЕсли;
	
	// Упаковываем новый архив
	
	ФайлZIP = Новый ЗаписьZipФайла(ПутьКПрезентации);
	ФайлZIP.Добавить(ПутьККаталогуРаспаковки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути,  РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ФайлZIP.Записать();
	
	// Удаляем временные файлы
	
	УдалитьВременныеФайлы(ФайлыДляУдаления)
	
	#КонецЕсли
	
КонецПроцедуры

Функция ФайлContentВСтроку(ПутьККаталогуРаспаковки) Экспорт
	
	ПутьКФайлуContent = ПутьККаталогуРаспаковки + "content.xml"; 
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуContent, КодировкаТекста.UTF8);
	СодержимоеДокументаСтрока = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат СодержимоеДокументаСтрока;
	
КонецФункции

Функция УдалитьСлайдыВФайлеContentПрезентации(СодержимоеДокументаСтрока, МассивИдентификаторовСлайдов) Экспорт
	
	КоличествоУдаленных = 0;
	
	Для каждого ИдентификаторСлайда Из МассивИдентификаторовСлайдов Цикл
	
		МаркерНачала = "<draw:page draw:name=""" + СокрЛП(ИдентификаторСлайда) + """";
		МаркерКонца  = "</draw:page>";
	
		НомерМаркераНачала = СтрНайти(СодержимоеДокументаСтрока, МаркерНачала);
		
		Если НомерМаркераНачала = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомерМаркераКонца = СтрНайти(СодержимоеДокументаСтрока, МаркерКонца,, НомерМаркераНачала);
		НомерКонцаСлайда = НомерМаркераКонца + СтрДлина(МаркерКонца) - 1;
		
		СодержимоеДокументаСтрока = Лев(СодержимоеДокументаСтрока, НомерМаркераНачала - 1) + Сред(СодержимоеДокументаСтрока, НомерКонцаСлайда + 1);
			
		КоличествоУдаленных = КоличествоУдаленных + 1;
	
	КонецЦикла;
	
	Возврат КоличествоУдаленных;
	
КонецФункции

// Общее

Процедура ПоместитьФайлыВХранилище(СписокФайлов, СписокРазмещенныхФайлов, УникальныйИдентификатор) Экспорт
	
	#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
		
	ВызватьИсключение НСтр("ru = 'Возможность недоступна в веб-клиенте.'");
		
	#Иначе
		
	Если СписокФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Файл Из СписокФайлов Цикл
		ДвоичныеДанные = Новый ДвоичныеДанные(Файл.Имя);
		ОписаниеПереданногоФайла = Новый Структура("Имя, Хранение");
		ОписаниеПереданногоФайла.Имя = Файл.Имя;
		ОписаниеПереданногоФайла.Хранение = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
		СписокРазмещенныхФайлов.Добавить(ОписаниеПереданногоФайла);
	КонецЦикла;
	
	#КонецЕсли
	
КонецПроцедуры

Процедура УдалитьВременныеФайлы(ФайлыДляУдаления)
	
	Для каждого ПутьКФайлу Из ФайлыДляУдаления Цикл
			
		Попытка
			УдалитьФайлы(ПутьКФайлу);
		Исключение
			
			#Если Клиент Тогда
			ЭлектронноеОбучениеСлужебныйКлиент.ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
				|%1 по причине: %2'"), ПутьКФайлу, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()))
			);
			#Иначе
			ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось удалить временный файл
				|%1 по причине: %2'"), ПутьКФайлу, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()))
			);
			#КонецЕсли
		
		КонецПопытки;
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область ПубликацияЗагрузкаИВыгрузка

Функция ВыгрузитьНаДиск(Знач ЭлектронныеКурсы, Знач ФорматВыгрузки, Знач ПутьККаталогуВыгрузокНаКлиенте = Неопределено, Знач УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	#Если ВебКлиент Тогда
		Возврат РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ВыгрузитьНаДиск(ЭлектронныеКурсы, ФорматВыгрузки);
	#Иначе 
		РезультатПубликаций = Новый Структура("АдресВоВременномХранилище, Успешно, Сообщение, ПутьККаталогуВыгрузки, ВыгруженныеЭлектронныеКурсы, ИмяФайлаПакета");	
		РезультатПубликаций.Успешно = Ложь;
		РезультатПубликаций.ВыгруженныеЭлектронныеКурсы = Новый Массив;
		
		// Делаем проверки
		//
		
		Если ЭлектронныеКурсы.Количество() = 0 Тогда
			РезультатПубликаций.Сообщение = НСтр("ru = 'Электронные курсы для выгрузки не заданы'");
			Возврат Новый ФиксированнаяСтруктура(РезультатПубликаций);
		КонецЕсли;
		
		// Формируем и проверяем каталог для выгрузок
		//
		
		Если ЗначениеЗаполнено(ПутьККаталогуВыгрузокНаКлиенте) Тогда
			ПутьККаталогуВыгрузок = ПутьККаталогуВыгрузокНаКлиенте;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПутьККаталогуВыгрузок) Тогда
			РезультатПубликаций.Сообщение = НСтр("ru = 'Путь к каталогу выгрузки не задан'");
			Возврат РезультатПубликаций;		
		КонецЕсли;
		
		КаталогВыгрузок = Новый Файл(ПутьККаталогуВыгрузок);
		
		Если НЕ КаталогВыгрузок.Существует() ИЛИ НЕ КаталогВыгрузок.ЭтоКаталог() Тогда
			РезультатПубликаций.Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Каталог %1 не существует'"), ПутьККаталогуВыгрузок);
			Возврат РезультатПубликаций;		
		КонецЕсли;
		
		ПутьККаталогуВыгрузок = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуВыгрузок);
		
		// Создаем каталог текущей выгрузки
		//
		
		ИмяКаталогаВыгрузки = НСтр("ru = 'Выгрузки курсов'");
		
		Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.HTML") Тогда
			ИмяКаталогаВыгрузки = НСтр("ru = 'Пакеты HTML курсов'");
		КонецЕсли;
		
		Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM") Тогда
			ИмяКаталогаВыгрузки = НСтр("ru = 'Пакеты SCORM курсов'");
		КонецЕсли;
		
		Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.ПолнаяКопия") Тогда
			ИмяКаталогаВыгрузки = НСтр("ru = 'Полные выгрузки курсов'");
		КонецЕсли;	
		
		ПутьККаталогуВыгрузки = ПутьККаталогуВыгрузок + ИмяКаталогаВыгрузки;
		ПутьККаталогуВыгрузки = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьККаталогуВыгрузки);
		ПутьККаталогуВыгрузки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуВыгрузки);

		ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуВыгрузки);	
			
		// Выгружаем файлы в каталог
		//
		
		ОписаниеТипаВсеСсылки = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ОписаниеТипаВсеСсылки();
		Для каждого ЭлектронныйКурс Из ЭлектронныеКурсы Цикл
			
			// Получаем переменные
			
			ДанныеКурса = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДанныеКурса(ЭлектронныйКурс);
			//ДанныеКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйКурс, "Наименование, ДатаИзменения, НомерРедакции, НомерВерсии, Тип");
			НаименованиеКурсаДляЗаписиНаДиск = СокрЛП(ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ДанныеКурса.Наименование, "_"));
			
			// Делаем проверки
			
			Если ДанныеКурса.Тип = ПредопределенноеЗначение("Перечисление.ТипыЭлектронныхКурсов.SCORM")
				И (ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.HTML")
				ИЛИ ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM")) Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'SCORM курс ""%1"" не может быть выгружен в формате HTML или SCORM.
				|Используйте оригинальный пакет курса.'"), ДанныеКурса.Наименование); 
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
				Продолжить;
				
			КонецЕсли;
			
			// Создаем каталог с данными курса
			
			ПутьККаталогуЭлектронногоКурса = ЭлектронноеОбучениеСлужебныйКлиентСервер.УникальноеИмяФайла(ПутьККаталогуВыгрузки + НаименованиеКурсаДляЗаписиНаДиск);
			ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуЭлектронногоКурса);			
			ПутьККаталогуЭлектронногоКурса = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуЭлектронногоКурса);
			
			// HTML
			
			Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.HTML")
				ИЛИ ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM") Тогда
				
				// Выгружаем данные курса
				
				ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ВыполнитьНачальноеЗаполнениеКаталогаЭлектронныхКурсов(ПутьККаталогуЭлектронногоКурса);
				ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ВыгрузитьДанныеПубликацииВКаталогРесурсов(ПутьККаталогуЭлектронногоКурса, ЭлектронныйКурс,, УникальныйИдентификаторФормы);
				
				// Подключаем настройки окружения
				
				ПутьКФайлуНастроекОкружения = ПутьККаталогуЭлектронногоКурса + "settings/env.js";
				
				ЧтениеТекстаФНО = Новый ЧтениеТекста(ПутьКФайлуНастроекОкружения, КодировкаТекста.UTF8);
				ТекстФайлаНастроек = ЧтениеТекстаФНО.Прочитать();
				ЧтениеТекстаФНО.Закрыть();
				
				СтруктураНастроек = Новый Структура("api, data");
				СтруктураНастроек.api = Новый Структура("name, mode");
				СтруктураНастроек.data = Новый Структура("storage, container");
				
				СтруктураНастроек.api.name = ?(ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM"), "scorm", "local");
				СтруктураНастроек.api.mode = "auto";
				СтруктураНастроек.data.storage = Строка(ЭлектронныйКурс.УникальныйИдентификатор());
				СтруктураНастроек.data.container = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ИмяКонтейнераСДаннымиКурса(ЭлектронныйКурс, Неопределено);
				
				ТекстНастроек = "var courseSettings = " + РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДанныеВJSON(СтруктураНастроек) + ";";
				
				ЗаписьТекстаФНО = Новый ЗаписьТекста(ПутьКФайлуНастроекОкружения);
				ЗаписьТекстаФНО.Записать(ТекстНастроек + ТекстФайлаНастроек);
				ЗаписьТекстаФНО.Закрыть();				
				
			КонецЕсли;		
			
			// SCORM
			
			Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.SCORM") Тогда
				
				// Создаем манифест SCORM
				
				КороткийКодКурса = СтрЗаменить(Строка(ЭлектронныйКурс.УникальныйИдентификатор()), "-", "");
				
				XMLМанифестSCORMXDTO = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.МанифестSCORMXDTO(ЭлектронныйКурс, ДанныеКурса, КороткийКодКурса, ПутьККаталогуЭлектронногоКурса);
				ПутьКФайлуМанифестаSCORM = ПутьККаталогуЭлектронногоКурса + "imsmanifest.xml";
				
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(XMLМанифестSCORMXDTO);
				МанифестSCORMXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
				
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьXML.ОткрытьФайл(ПутьКФайлуМанифестаSCORM);
				
				ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, МанифестSCORMXDTO, "manifest");
				
				ЗаписьXML.Закрыть();
				
				// Заменяем префикс пространства имен "http://www.adlnet.org/xsd/adlcp_v1p3"
				
				ТекстовыйДокументМанифеста = ЭлектронноеОбучениеСлужебныйКлиентСервер.ПрочитатьТекстовыйДокумент(ПутьКФайлуМанифестаSCORM);						
				ТекстМанифеста = ТекстовыйДокументМанифеста.ПолучитьТекст();
				
				НомерСимволаПИ = Найти(ТекстМанифеста, "=""http://www.adlnet.org/xsd/adlcp_v1p3""");
				
				Если НомерСимволаПИ > 0 Тогда
					
					СтрокаЛевее = "";
					adlcpПрефикс = "";
					
					НомерСимвола = НомерСимволаПИ -1 ;
					
					Пока НомерСимвола > 0 Цикл
						
						СтрокаЛевее = Сред(ТекстМанифеста, НомерСимвола, 1) + СтрокаЛевее;
						
						Если Найти(СтрокаЛевее, "xmlns:") > 0 Тогда						
							adlcpПрефикс = Сред(ТекстМанифеста, НомерСимвола + 6, НомерСимволаПИ - (НомерСимвола + 6));						
							Прервать;						
						КонецЕсли;
						
						НомерСимвола = НомерСимвола - 1;
						
					КонецЦикла;
					
					ТекстМанифеста = СтрЗаменить(ТекстМанифеста, "xmlns:" + adlcpПрефикс + "=", "xmlns:adlcp=");
					ТекстМанифеста = СтрЗаменить(ТекстМанифеста, adlcpПрефикс + ":", "adlcp:");
					
				КонецЕсли;
				
				ТекстовыйДокументМанифеста.УстановитьТекст(ТекстМанифеста);
				ТекстовыйДокументМанифеста.Записать(ПутьКФайлуМанифестаSCORM,  КодировкаТекста.UTF8);
				
				// Упаковываем пакет в zip
				
				ИмяАрхива = ПутьККаталогуВыгрузки + НаименованиеКурсаДляЗаписиНаДиск + ".zip";						
				Архиватор = Новый ЗаписьZipФайла(ИмяАрхива);
					
				Архиватор.Добавить(ПутьККаталогуЭлектронногоКурса + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
				Архиватор.Записать();
				
				УдалитьФайлы(ПутьККаталогуЭлектронногоКурса);
				
			КонецЕсли;
			
			// Полная копия
			
			Если ФорматВыгрузки = ПредопределенноеЗначение("Перечисление.ФорматыВыгрузкиЭлектронныхКурсов.ПолнаяКопия") Тогда
				
				// Создаем каталог elements
				
				ПутьККаталогуЭлементовЭлектронногоКурса = ПутьККаталогуЭлектронногоКурса + "elements";
				ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуЭлементовЭлектронногоКурса);	
				ПутьККаталогуЭлементовЭлектронногоКурса = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуЭлементовЭлектронногоКурса);
				
				// Создаем каталог files
				
				ПутьККаталогуФайловЭлектронногоКурса = ПутьККаталогуЭлектронногоКурса + "files";
				ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ПутьККаталогуФайловЭлектронногоКурса);	
				ПутьККаталогуФайловЭлектронногоКурса = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуФайловЭлектронногоКурса);
				
				// Выгружаем элементы курса
				
				ВсеЭлементыКурса = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ВсеСсылкиЭлементаСправочника(ЭлектронныйКурс, Истина, Истина); // Не учитываем помеченные на удаление
				
				ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьВМассивУникальноеЗначение(ВсеЭлементыКурса, ЭлектронныйКурс, Истина); // Добавляем сам курс ко всем элементам			
				ВсеГруппыХранения = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ВсеГруппыЭлектронногоКурса(ЭлектронныйКурс);
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеЭлементыКурса, ВсеГруппыХранения, Истина); 
				
				ТипыЭлементов = Новый Соответствие;
				
				ВыгруженныеЭлементы = Новый Массив;
				
				Для каждого СсылкаНаЭлементКурса Из ВсеЭлементыКурса Цикл
					
					ТипЭлементаКурса = ТипЗнч(СсылкаНаЭлементКурса);
					ТипЭлементаКурсаНастройки = ТипыЭлементов[ТипЭлементаКурса];
						
					Если ТипЭлементаКурсаНастройки = Неопределено Тогда
						
						ТипыЭлементов.Вставить(ТипЭлементаКурса, ОписаниеТипаЭлемента());
						ТипЭлементаКурсаНастройки = ТипыЭлементов[ТипЭлементаКурса];
						ТипЭлементаКурсаНастройки.ИдентификаторОбъектаМетаданных = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ИдентификаторОбъектаМетаданных(ТипЭлементаКурса);
						ТипЭлементаКурсаНастройки.ПутьККаталогу = ПутьККаталогуЭлементовЭлектронногоКурса + ТипЭлементаКурсаНастройки.ИдентификаторОбъектаМетаданных;
						
						ЭлектронноеОбучениеСлужебныйКлиентСервер.НовыйКаталог(ТипЭлементаКурсаНастройки.ПутьККаталогу);
						ТипЭлементаКурсаНастройки.ПутьККаталогу = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ТипЭлементаКурсаНастройки.ПутьККаталогу);
					КонецЕсли;
					
					ПутьКФайлуЭлемента = ТипЭлементаКурсаНастройки.ПутьККаталогу + Строка(СсылкаНаЭлементКурса.УникальныйИдентификатор()) + ".json";
					
					ЗаписьJSON = Новый ЗаписьJSON;
					ЗаписьJSON.ОткрытьФайл(ПутьКФайлуЭлемента);				
					СтруктураЭлемента = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ЭлементКурсаВСтруктуру(СсылкаНаЭлементКурса, ОписаниеТипаВсеСсылки);
					ЗаписатьJSON(ЗаписьJSON, СтруктураЭлемента);
					ЗаписьJSON.Закрыть();					
					
					ДанныеВыгруженногоЭлементы = ОписаниеВыгруженногоЭлементы();
					//НоваяСтрока = ТаблицаВыгруженныхЭлементов.Добавить();
					ДанныеВыгруженногоЭлементы.ПутьКФайлуЭлемента = ПутьКФайлуЭлемента;
					ДанныеВыгруженногоЭлементы.ОтносительныйПутьКФайлуЭлемента = Сред(ДанныеВыгруженногоЭлементы.ПутьКФайлуЭлемента, СтрДлина(ПутьККаталогуЭлектронногоКурса)+1);
					ДанныеВыгруженногоЭлементы.ЭтоГруппаДляХраненияЭлементов = ?(ВсеГруппыХранения.Найти(СсылкаНаЭлементКурса) = Неопределено, Ложь, Истина);
					
					Если ТипЭлементаКурса = Тип("СправочникСсылка.ЭлементыЭлектронныхРесурсовПрисоединенныеФайлы") Тогда					
						
						//ВладелецФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлементКурса, "ВладелецФайла");
						ДвоичныеДанныеФайла = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ДвоичныеДанныеФайла(СсылкаНаЭлементКурса);
						ПутьКВыгружаемомуФайлу = ПутьККаталогуФайловЭлектронногоКурса + ОбщегоНазначенияКлиентСервер.ПолучитьИмяСРасширением(Строка(СсылкаНаЭлементКурса.УникальныйИдентификатор()), СтруктураЭлемента.Расширение);
						ДвоичныеДанныеФайла.Записать(ПутьКВыгружаемомуФайлу);
						
						ДанныеВыгруженногоЭлементы.ЭтоФайл = Истина;
						ДанныеВыгруженногоЭлементы.ПутьКФайлу = ПутьКВыгружаемомуФайлу;
						ДанныеВыгруженногоЭлементы.ОтносительныйПутьКФайлу = Сред(ДанныеВыгруженногоЭлементы.ПутьКФайлу, СтрДлина(ПутьККаталогуЭлектронногоКурса)+1);
						
					Иначе
						
						ДанныеВыгруженногоЭлементы.ЭтоФайл = Ложь;
						
					КонецЕсли;
					
					ВыгруженныеЭлементы.Добавить(ДанныеВыгруженногоЭлементы);
					
				КонецЦикла;
				
				// Создаем файл манифеста
				
				СтруктураМанифеста = РазработкаЭлектронныхКурсовСлужебныйВызовСервера.СтруктураМанифеста(ЭлектронныйКурс, ДанныеКурса, ВыгруженныеЭлементы, ОписаниеТипаВсеСсылки);
				
				ПутьКФайлуМанифеста = ПутьККаталогуЭлектронногоКурса + "v8course.json";
				
				ЗаписьJSON = Новый ЗаписьJSON;
				ЗаписьJSON.ОткрытьФайл(ПутьКФайлуМанифеста);
				ЗаписатьJSON(ЗаписьJSON, СтруктураМанифеста);
				ЗаписьJSON.Закрыть();
				
			КонецЕсли;
			
			РезультатПубликаций.ВыгруженныеЭлектронныеКурсы.Добавить(ЭлектронныйКурс);
			
		КонецЦикла;
		
		Если РезультатПубликаций.ВыгруженныеЭлектронныеКурсы.Количество() = 0 Тогда
			РезультатПубликаций.Сообщение = НСтр("ru = 'Курсы не выгружены'");
			Возврат Новый ФиксированнаяСтруктура(РезультатПубликаций);
		КонецЕсли;	
		
		// Возвращаем результат
		//
		
		Если ЗначениеЗаполнено(ПутьККаталогуВыгрузокНаКлиенте) Тогда
			
			РезультатПубликаций.ПутьККаталогуВыгрузки = ПутьККаталогуВыгрузки;
			
		Иначе
			
			ИмяАрхива = ПолучитьИмяВременногоФайла(".zip");
			
			Архиватор = Новый ЗаписьZipФайла(ИмяАрхива);
			
			Архиватор.Добавить(ПутьККаталогуВыгрузки + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
			Архиватор.Записать();
			
			ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ИмяАрхива);
			РезультатПубликаций.АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеАрхива, УникальныйИдентификаторФормы);
			
			ЭлектронноеОбучениеСлужебныйКлиент.УдалитьВременныйФайл(ИмяАрхива);
			
			РезультатПубликаций.ИмяФайлаПакета = ИзучениеЭлектронныхКурсовСлужебныйКлиентСервер.ИмяКаталогаЭлектронныхКурсов() + "_" + Формат(ТекущаяДата(), "ДФ=yyyy_MM_dd");
			
		КонецЕсли;
		
		РезультатПубликаций.Успешно = Истина;	
		Возврат Новый ФиксированнаяСтруктура(РезультатПубликаций);
	#КонецЕсли
	
КонецФункции

Функция ОписаниеВыгруженногоЭлементы()
	
	ВыгруженныйЭлемент = Новый Структура; 
	ВыгруженныйЭлемент.Вставить("ПутьКФайлуЭлемента");
	ВыгруженныйЭлемент.Вставить("ОтносительныйПутьКФайлуЭлемента");
	ВыгруженныйЭлемент.Вставить("ЭтоГруппаДляХраненияЭлементов");
	ВыгруженныйЭлемент.Вставить("ЭтоФайл");
	ВыгруженныйЭлемент.Вставить("ПутьКФайлу");
	ВыгруженныйЭлемент.Вставить("ОтносительныйПутьКФайлу");
	ВыгруженныйЭлемент.Вставить("ПутьКФайлуЭлемента");
	
	Возврат ВыгруженныйЭлемент;
	
КонецФункции

Функция ОписаниеТипаЭлемента()
	
	Возврат Новый Структура("ИдентификаторОбъектаМетаданных, ПутьККаталогу");
	
КонецФункции

Функция ЗагрузитьВБазуПолныйПакет(Знач ПутьКФайлуМанифеста, ИдентификаторФормы) Экспорт
	
	#Если ВебКлиент Тогда
		ВызватьИсключение НСтр("ru = 'Для загрузки курса из папки используйте тонкий клиент'");
	#Иначе
		// Читаем манифест
		Чтение = Новый ЧтениеJSON;
		Чтение.ОткрытьФайл(ПутьКФайлуМанифеста);
		СтруктураМанифеста = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		
		ПутьККаталогуВыгрузки = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлуМанифеста).Путь;
		ПутьККаталогуВыгрузки = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуВыгрузки);
		
		Элементы = Новый Массив;
		Для каждого СвойстваЭлемента Из СтруктураМанифеста.Elements Цикл
			// Читаем структуру элемента в файле
			Чтение = Новый ЧтениеJSON;
			Чтение.ОткрытьФайл(ПутьККаталогуВыгрузки + СвойстваЭлемента.Element);
			СтруктураЭлемента = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
					
			Элементы.Добавить(СтруктураЭлемента);
			//Элементы.Вставить(СвойстваЭлемента.Element, ДанныеФайла);
			
		КонецЦикла;
		
		Файлы = Новый Массив;
		Для каждого СвойстваФайла Из СтруктураМанифеста.Files Цикл
				
			// Читаем структуру элемента
				
			Чтение = Новый ЧтениеJSON;
			Чтение.ОткрытьФайл(ПутьККаталогуВыгрузки + СвойстваФайла.Element);
			СтруктураЭлемента = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
			
			ПолныйПутьКФайлу = ПутьККаталогуВыгрузки + СвойстваФайла.File;
			АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолныйПутьКФайлу));
			
			ДанныеФайла = Новый Структура("Свойства, АдресВоВременномХранилище", СтруктураЭлемента, АдресФайлаВоВременномХранилище);
			Файлы.Добавить(ДанныеФайла);
		КонецЦикла;
		
		ГруппыЭлементов = Новый Массив;
		Для каждого СвойстваГруппы Из СтруктураМанифеста.ElementsFolders Цикл
				
			// Читаем структуру элемента
				
			Чтение = Новый ЧтениеJSON;
			Чтение.ОткрытьФайл(ПутьККаталогуВыгрузки + СвойстваГруппы.Element);
			СтруктураЭлемента = ПрочитатьJSON(Чтение);
			Чтение.Закрыть();
			
			ГруппыЭлементов.Добавить(СтруктураЭлемента);
		КонецЦикла;
		
		Возврат РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ЗагрузитьВБазуПолныйПакет(
			СтруктураМанифеста, Элементы, Файлы, ГруппыЭлементов, ИдентификаторФормы);
	#КонецЕсли
	
КонецФункции

Функция ЗагрузитьВБазуПакетSCORM(Знач ПутьКФайлуМанифеста, ИдентификаторФормы) Экспорт
	
	ФайлМанифеста = Новый Файл(ПутьКФайлуМанифеста);

	Если НЕ ФайлМанифеста.Существует() Тогда
		ВызватьИсключение  СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Файл %1 не найден'"), ПутьКФайлуМанифеста);
	КонецЕсли;

	КаталогПакета = Новый Файл(ФайлМанифеста.Путь);
	ПутьККаталогуПакета = ФайлМанифеста.Путь;
	ПутьККаталогуПакета = ЭлектронноеОбучениеСлужебныйКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуПакета);

	// Читаем манифест
	//
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлуМанифеста);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
	СписокФайлов = Новый Массив; // Линейный список файлов для последующего помещения в базу
	СтруктураФайлов = Новый Массив; // Массив файлов с учетом иерархии каталогов
	ОтсортированныеФайлы = Новый Массив; // Файлы на диске, которые надо загрузить
	
	ФайлыВКаталогеПакета = ЭлектронноеОбучениеСлужебныйКлиентСервер.ИскатьФайлы(КаталогПакета.ПолноеИмя, "*", Ложь);
		
	Для каждого ФайлПакетаВКорне Из ФайлыВКаталогеПакета Цикл
		ОтсортированныеФайлы.Добавить(ФайлПакетаВКорне);
	КонецЦикла;
	
	ЭлектронноеОбучениеСлужебныйКлиентСервер.СформироватьОписаниеФайлов(ОтсортированныеФайлы, СтруктураФайлов, СписокФайлов, Ложь, "");
	
	СвойстваФайла = РазработкаЭлектронныхКурсовСлужебныйКлиентСервер.ПустаяСтруктураСвойствЗагружаемогоФайла();
	СвойстваФайла.Имя = КаталогПакета.Имя;
	СвойстваФайла.Расширение = "";
	СвойстваФайла.ЭтоКаталог = Истина;
	СвойстваФайла.Преобразовать = Ложь;
	СвойстваФайла.СтруктураФайлов = СтруктураФайлов;
	СвойстваФайла.СписокФайлов = СписокФайлов;
	
	Возврат РазработкаЭлектронныхКурсовСлужебныйВызовСервера.ЗагрузитьВБазуПакетSCORMИзХранилища(
		АдресХранилища, ИдентификаторФормы, СвойстваФайла, ФайлМанифеста.ПолучитьВремяИзменения());
		
КонецФункции

#КонецОбласти

#КонецОбласти
