#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторОбращения = Параметры.ИдентификаторОбращения;
	Если Параметры.Свойство("КодПользователя") 
		И ЗначениеЗаполнено(Параметры.КодПользователя) Тогда
		КодПользователя = Параметры.КодПользователя;
	Иначе
		КодПользователя = ИнформационныйЦентрСервер.КодПользователяДляДоступа();
	КонецЕсли;
	ТекущаяСтраница = 1;
	Рассмотрено = Ложь;
	
	ЗаполнитьСодержаниеОбращения();
	ЗаполнитьПерепискуПоОбращению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтправкаСообщенияВСлужбуПоддержки" Или ИмяСобытия = "ПросмотреноВзаимодействиеПоОбращению" Тогда 
		ТекущаяСтраница = 1;
		СписокВзаимодействий.Очистить();
		ПодключитьОбработчикОжидания("ЗаполнитьПерепискуПоОбращениюКлиент", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВзаимодействийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	ИнформационныйЦентрКлиент.ОткрытьВзаимодействиеВСлужбуПоддержки(ИдентификаторОбращения, 
		ТекущиеДанные.Идентификатор, ТекущиеДанные.Тип, ТекущиеДанные.Входящее, ТекущиеДанные.Просмотрено, КодПользователя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	ИнформационныйЦентрКлиент.ОткрытьФормуОтправкиСообщенияВСлужбуПоддержки(
		Ложь, ИдентификаторОбращения, КодПользователя);
	
КонецПроцедуры

&НаКлиенте
Процедура Рассмотрено(Команда)
	
	ИндексСтроки = Элементы.СписокВзаимодействий.ТекущаяСтрока;
	
	РассмотреноНаСервере(ИндексСтроки);
	
	Если Рассмотрено Тогда 
		Оповестить("ПросмотреноВзаимодействиеПоОбращению");
	КонецЕсли;
	
	Рассмотрено = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЕще(Команда)

	ТекущаяСтраница = ТекущаяСтраница + 1;
	ЗаполнитьПерепискуПоОбращению();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСодержаниеОбращения()
	
	Попытка
		
		ДанныеПоОбращению = ПолучитьДанныеПоОбращению();
		ЗаполнитьСодержание(ДанныеПоОбращению);
		
	Исключение
		
		ТекстОшибки = ИнформационныйЦентрСлужебный.ПодробныйТекстОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнформационныйЦентрСервер.ПолучитьИмяСобытияДляЖурналаРегистрации(), 
		                         УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ТекстВывода = ИнформационныйЦентрСервер.ТекстВыводаИнформацииОбОшибкеВСлужбеПоддержки();
		
		ВызватьИсключение ТекстВывода;
		
	КонецПопытки;
	
КонецПроцедуры

// Получить данные по обращению.
// 
// Возвращаемое значение:
//  ОбъектXDTO 
&НаСервере
Функция ПолучитьДанныеПоОбращению()
	
	WSПрокси = ИнформационныйЦентрСервер.ПолучитьПроксиСлужбыПоддержки();
	
	Результат = WSПрокси.getIncident(КодПользователя, Строка(ИдентификаторОбращения));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСодержание(ДанныеПоОбращению)
	
	ЭтотОбъект.Заголовок = СтрШаблон(НСтр("ru='Взаимодействия по обращению %1 (%2)'"), 
		ДанныеПоОбращению.Name,
		ДанныеПоОбращению.Number);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПерепискуПоОбращениюКлиент()
	
	ЗаполнитьПерепискуПоОбращению();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПерепискуПоОбращению()
	
	Попытка
		
		ДанныеПоПереписке = ПолучитьДанныеПоПереписке();
		ЗаполнитьПереписку(ДанныеПоПереписке);
		
	Исключение
		
		ТекстОшибки = ИнформационныйЦентрСлужебный.ПодробныйТекстОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИнформационныйЦентрСервер.ПолучитьИмяСобытияДляЖурналаРегистрации(), 
		                         УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		ТекстВывода = ИнформационныйЦентрСервер.ТекстВыводаИнформацииОбОшибкеВСлужбеПоддержки();
		
		ВызватьИсключение ТекстВывода;
		
	КонецПопытки;
	
КонецПроцедуры

// Получить данные по переписке.
// 
// Возвращаемое значение:
//  ОбъектXDTO
&НаСервере
Функция ПолучитьДанныеПоПереписке()
	
	WSПрокси = ИнформационныйЦентрСервер.ПолучитьПроксиСлужбыПоддержки();
	
	Результат = WSПрокси.getInteractions(КодПользователя, Строка(ИдентификаторОбращения), 
		ТекущаяСтраница);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПереписку(ДанныеПоПереписке)
	
	Для Каждого ЭлементВзаимодействия Из ДанныеПоПереписке.Interactions Цикл
		 
		ИдентификаторЭлемента = Новый УникальныйИдентификатор(ЭлементВзаимодействия.Id);
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Идентификатор", ИдентификаторЭлемента);
		НайденныеСтрокиПоИдентификатору = СписокВзаимодействий.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтрокиПоИдентификатору.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеВзаимодействие = СписокВзаимодействий.Добавить();
		НовоеВзаимодействие.Идентификатор = Новый УникальныйИдентификатор(ЭлементВзаимодействия.Id);
		НовоеВзаимодействие.Тема = ЭлементВзаимодействия.Name;
		НовоеВзаимодействие.Описание = ?(ПустаяСтрока(ЭлементВзаимодействия.Description), 
			?(ЗначениеЗаполнено(ЭлементВзаимодействия.Name),
				ЭлементВзаимодействия.Name,
				НСтр("ru = '<Без текста>'")), 
			ЭлементВзаимодействия.Description);
		НовоеВзаимодействие.Дата = ЭлементВзаимодействия.Date;
		НовоеВзаимодействие.НомерКартинки = ИнформационныйЦентрСервер.НомерКартинкиПоВзаимодействию(
			ЭлементВзаимодействия.Type, ЭлементВзаимодействия.Incoming, ЭлементВзаимодействия.Viewed);
		НовоеВзаимодействие.КартинкаВложения = 
			?(ЭлементВзаимодействия.IsFiles, БиблиотекаКартинок.Скрепка, Неопределено);
		НовоеВзаимодействие.ПояснениеККартинке = 
			?(ЭлементВзаимодействия.Incoming, НСтр("ru = 'Вх.'"), НСтр("ru = 'Исх.'"));
		НовоеВзаимодействие.Входящее = ЭлементВзаимодействия.Incoming;
		НовоеВзаимодействие.Тип = ЭлементВзаимодействия.Type;
		НовоеВзаимодействие.Просмотрено = ЭлементВзаимодействия.Viewed;
		
	КонецЦикла;
	
	ЗаполнитьПодвал(ДанныеПоПереписке);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодвал(ДанныеПоПереписке)
	
	ЕстьСтраницыПосле = ДанныеПоПереписке.IsStill;
	Элементы.ПоказатьЕще.Видимость = ЕстьСтраницыПосле;
	
КонецПроцедуры

&НаСервере
Процедура РассмотреноНаСервере(ИндексСтроки)
	
	WSПрокси = ИнформационныйЦентрСервер.ПолучитьПроксиСлужбыПоддержки();
	
	Фабрика = WSПрокси.ФабрикаXDTO;
	
	ТипСписокВзаимодействий = 
		Фабрика.Тип("http://www.1c.ru/1cFresh/InformationCenter/SupportServiceData/1.0.0.1", "ListInteraction");
	СписокВзаимодействийXDTO = Фабрика.Создать(ТипСписокВзаимодействий);
		 
	НайденнаяСтрока = СписокВзаимодействий.НайтиПоИдентификатору(ИндексСтроки);
	
	Если НайденнаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если НайденнаяСтрока.Просмотрено Тогда 
		Возврат;
	КонецЕсли;
	
	Рассмотрено = Истина;
	
	ВзаимодействиеXDTO = СформироватьВзаимодействиеXDTO(НайденнаяСтрока, Фабрика);
	Обработки.ИнформационныйЦентр.ДобавитьЗначениеВСписокXDTO(
		СписокВзаимодействийXDTO, "Interactions", ВзаимодействиеXDTO);
	
	WSПрокси.setInteractionsViewed(КодПользователя, СписокВзаимодействийXDTO);
	
КонецПроцедуры

&НаСервере
Функция СформироватьВзаимодействиеXDTO(НайденнаяСтрока, Фабрика)
	
	ТипВзаимодействия = 
		Фабрика.Тип("http://www.1c.ru/1cFresh/InformationCenter/SupportServiceData/1.0.0.1", "Interaction");
	Взаимодействие = Фабрика.Создать(ТипВзаимодействия);
	
	Взаимодействие.Id = Строка(НайденнаяСтрока.Идентификатор);
	Взаимодействие.Type = НайденнаяСтрока.Тип;
	Взаимодействие.Incoming = НайденнаяСтрока.Входящее;
	
	Возврат Взаимодействие;
	
КонецФункции

#КонецОбласти