#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(УчастникКадровогоРезерва)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ВыполнитьПервоначальноеЗаполнение");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОбновления

// Выполняет первоначальное заполнение при обновлении.
// Данные переносятся из регистра УдалитьИсторияКадровогоРезерва.
// Измерение УчастникКадровогоРезерва заполняется данными из измерения ФизическоеЛицо.
// 
// Параметры:
//  ПараметрыОбновления - Структура
Процедура ВыполнитьПервоначальноеЗаполнение(ПараметрыОбновления) Экспорт

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
		"ОбработкаЗавершена", Ложь);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИсторияКадровогоРезерва.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТОбработанныеРегистраторы
		|ИЗ
		|	РегистрСведений.ИсторияКадровогоРезерва КАК ИсторияКадровогоРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	УдалитьИсторияКадровогоРезерва.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТРегистраторыДляОбработки
		|ИЗ
		|	РегистрСведений.УдалитьИсторияКадровогоРезерва КАК УдалитьИсторияКадровогоРезерва
		|ГДЕ
		|	НЕ ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТОбработанныеРегистраторы КАК ВТОбработанныеРегистраторы
		|		ГДЕ
		|			ВТОбработанныеРегистраторы.Регистратор = УдалитьИсторияКадровогоРезерва.Регистратор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдалитьИсторияКадровогоРезерва.Период КАК Период,
		|	УдалитьИсторияКадровогоРезерва.Регистратор КАК Регистратор,
		|	УдалитьИсторияКадровогоРезерва.НомерСтроки КАК НомерСтроки,
		|	УдалитьИсторияКадровогоРезерва.Активность КАК Активность,
		|	УдалитьИсторияКадровогоРезерва.ПозицияРезерва КАК ПозицияРезерва,
		|	УдалитьИсторияКадровогоРезерва.ФизическоеЛицо КАК ФизическоеЛицо,
		|	УдалитьИсторияКадровогоРезерва.Статус КАК Статус,
		|	УдалитьИсторияКадровогоРезерва.ВидРезерва КАК ВидРезерва,
		|	УдалитьИсторияКадровогоРезерва.ДатаОкончания КАК ДатаОкончания,
		|	УдалитьИсторияКадровогоРезерва.Наставник КАК Наставник,
		|	УдалитьИсторияКадровогоРезерва.Куратор КАК Куратор
		|ИЗ
		|	РегистрСведений.УдалитьИсторияКадровогоРезерва КАК УдалитьИсторияКадровогоРезерва
		|ГДЕ
		|	ИСТИНА В
		|		(ВЫБРАТЬ ПЕРВЫЕ 1
		|			ИСТИНА
		|		ИЗ
		|			ВТРегистраторыДляОбработки КАК ВТРегистраторыДляОбработки
		|		ГДЕ
		|			ВТРегистраторыДляОбработки.Регистратор = УдалитьИсторияКадровогоРезерва.Регистратор)
		|ИТОГИ
		|ПО
		|	Регистратор";

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.УдалитьИсторияКадровогоРезерва.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.ИсторияКадровогоРезерва.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления,
				"ОбработкаЗавершена", Истина);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		
		ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРегистратор.Следующий() Цикл
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
			Выборка = ВыборкаРегистратор.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
				НоваяЗапись.УчастникКадровогоРезерва = Выборка.ФизическоеЛицо;
			КонецЦикла;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(НаборЗаписей);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли