#Область ОписаниеПеременных

&НаКлиенте
Перем КонтекстЭДОКлиент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	
	Если Параметры.Свойство("ВызовПоКнопкеЗаполнить") Тогда
		ЭтоВызовПоКнопкеЗаполнить = Истина;
		Элементы.ФлагБольшеНеПоказывать.Заголовок = НСтр("ru='Напомнить через 1 мес.'");
		Элементы.КнопкаПродолжитьБезПодключения.Видимость = Истина;
	Иначе
		ПоказыватьКнопки = Параметры.Свойство("ПоказыватьКнопки") И Параметры.ПоказыватьКнопки;
		Элементы.ФлагБольшеНеПоказывать.Видимость = ПоказыватьКнопки;
		Элементы.ФлагБольшеНеПоказывать.Заголовок = НСтр("ru='Больше не показывать'");
		Элементы.КнопкаПродолжитьБезПодключения.Видимость = Ложь;
		Если ПоказыватьКнопки Тогда
			ПроверитьОтказалисьЛиОтПоказа(Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Показываем только один раз за сеанс.
	Если ПоказыватьКнопки
		ИЛИ ЭтоВызовПоКнопкеЗаполнить Тогда
		Если ПараметрыПриложения["БРО.БольшеНеПоказыватьПредложениеОформитьЗаявлениеНаПодключение"] = Истина Тогда
			Отказ = Истина;
			Возврат;
		Иначе
			ПараметрыПриложения["БРО.БольшеНеПоказыватьПредложениеОформитьЗаявлениеНаПодключение"] = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ФлагБольшеНеПоказывать.Видимость И ФлагБольшеНеПоказывать Тогда 
		СохранитьЗначениеБольшеНеПоказыватьНаСервере(Истина, ЭтоВызовПоКнопкеЗаполнить, Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = ЭлектронныйДокументооборотСФССКлиент.ИмяСобытияУспешнойОтправкиЗаявленияНаПодключение()
		ИЛИ ИмяСобытия = ЭлектронныйДокументооборотСФССКлиент.ИмяСобытияУспешнойОбработкиЗаявленияНаПодключение()
		И ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаявлениеАбонентаСпецоператораСвязи") Тогда
		
		ОрганизацияЗаявления = ЭлектронныйДокументооборотСФССВызовСервера.ОрганизацияЗаявленияНаПодключение1СО(Источник);
		
		Если ОрганизацияЗаявления = Организация Тогда
			ПодключитьОбработчикОжидания("Подключаемый_ЗакрытьФорму", 0.1, Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключить(Команда)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(Организация, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Если ЭтотОбъект.Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьБезПодключения(Команда)
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗакрытьФорму", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьОтказалисьЛиОтПоказа(Отказ)
	
	БольшеНеПоказывать 	= ХранилищеОбщихНастроек.Загрузить(
		"Обработка.ОбщиеОбъектыРеглОтчетности", 
		"НеПоказыватьПредложениеОформитьЗаявлениеНаПодключение");
	
	Если БольшеНеПоказывать = Истина Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ВремяПоследнегоНапоминания 	= ХранилищеОбщихНастроек.Загрузить(
		"Обработка.ОбщиеОбъектыРеглОтчетности", 
		"ВремяПоследнегоНапоминания");
	
	Если ВремяПоследнегоНапоминания <> Неопределено 
		И ВремяПоследнегоНапоминания + 4 * 60 * 60 > ТекущаяДатаСеанса() Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СохранитьЗначениеБольшеНеПоказыватьНаСервере(Знач БольшеНеПоказывать, Знач ЭтоВызовПоКнопкеЗаполнить, Знач Организация)
	
	Если ЭтоВызовПоКнопкеЗаполнить Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.СохранитьОтказОтПоказаБаннераДляОрганизации(
			Организация);
	Иначе
		ХранилищеОбщихНастроек.Сохранить(
			"Обработка.ОбщиеОбъектыРеглОтчетности", 
			"НеПоказыватьПредложениеОформитьЗаявлениеНаПодключение", 
			БольшеНеПоказывать);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	
КонецПроцедуры

#КонецОбласти
