#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриИзмененииЗначения(НовоеЗначение) Экспорт
	
	Если Не РаботаВМоделиСервиса.РазделениеВключено() Тогда
		
		Если НовоеЗначение Тогда
			РегистрыСведений.ПлюсНастройки.ВключитьИспользование();
		Иначе
			РегистрыСведений.ПлюсНастройки.ВыключитьИспользование();
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ИспользуемыеОбластиДанных = РаботаВМоделиСервиса.ИспользуемыеОбластиДанных();
	
	Если ТипЗнч(ИспользуемыеОбластиДанных) = Тип("Массив") Тогда
			
		Если ИспользуемыеОбластиДанных.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаИспользуемыеОбластиДанных = Новый ТаблицаЗначений();
		ТаблицаИспользуемыеОбластиДанных.Колонки.Добавить("ОбластьДанных", Новый ОписаниеТипов("Число"));
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицуИзМассива(
			ТаблицаИспользуемыеОбластиДанных, ИспользуемыеОбластиДанных, "ОбластьДанных");
	Иначе
		
		Если ИспользуемыеОбластиДанных.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаИспользуемыеОбластиДанных = ИспользуемыеОбластиДанных.Выгрузить();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИспользуемыеОбластиДанных", ТаблицаИспользуемыеОбластиДанных);
	Запрос.УстановитьПараметр("НовоеЗначение", НовоеЗначение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИспользуемыеОбластиДанных.ОбластьДанных КАК ОбластьДанных
	|ПОМЕСТИТЬ ВТ_ИспользуемыеОбластиДанных
	|ИЗ
	|	&ИспользуемыеОбластиДанных КАК ИспользуемыеОбластиДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемыеОбластиДанных.ОбластьДанных КАК ОбластьДанных
	|ИЗ
	|	ВТ_ИспользуемыеОбластиДанных КАК ИспользуемыеОбластиДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлюсНастройки КАК Настройка1СПлюс
	|		ПО ИспользуемыеОбластиДанных.ОбластьДанных = Настройка1СПлюс.ОбластьДанныхВспомогательныеДанные
	|ГДЕ
	|	ЕСТЬNULL(Настройка1СПлюс.СервисИспользуется, НЕОПРЕДЕЛЕНО) <> &НовоеЗначение";
	РезультатЗапросаОбласти = Запрос.Выполнить();
	Если РезультатЗапросаОбласти.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРазделенныйСеанс = РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных();

	Выборка = РезультатЗапросаОбласти.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ТекущийКодОбластиДанных = Выборка.ОбластьДанных;
		
		Если Не ЭтоРазделенныйСеанс  Тогда
			РаботаВМоделиСервиса.ВойтиВОбластьДанных(ТекущийКодОбластиДанных);
		КонецЕсли;
		
		Блокировка = Новый БлокировкаДанных;
		
		Блокировка.Добавить("Константа.ПлюсСервисДоступенДляИспользования");
		
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПлюсНастройки");
		ЭлементБлокировки.УстановитьЗначение("ОбластьДанныхВспомогательныеДанные", ТекущийКодОбластиДанных);
		
		НачатьТранзакцию();
		Попытка

			Блокировка.Заблокировать();
		
			Если НовоеЗначение Тогда
				РегистрыСведений.ПлюсНастройки.ВключитьИспользование();
			Иначе
				РегистрыСведений.ПлюсНастройки.ВыключитьИспользование();
			КонецЕсли;
				
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			Если РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных() Тогда
				РаботаВМоделиСервиса.ВыйтиИзОбластиДанных();
			КонецЕсли;
			
			ВызватьИсключение;
		КонецПопытки;
			
		Если Не ЭтоРазделенныйСеанс Тогда
			РаботаВМоделиСервиса.ВыйтиИзОбластиДанных();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли