#Область СлужебныйПрограммныйИнтерфейс

// Установка настроек оплаты сервиса.
// 
// Параметры:
//  КодАбонента - число - код абонента-владельца учетной системы.
// 
Процедура УстановитьНастройкиОплатыСервиса(КодАбонента) Экспорт
	
	РезультатОбработки = НовыйРезультатОбработки();
	
	Попытка
		ОплатаСервисаПереопределяемый.ПриУстановкеНастроекОплатыСервиса(КодАбонента, РезультатОбработки);
		Если РезультатОбработки.Ошибка Тогда
			ВызватьИсключение РезультатОбработки.Сообщение;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = СобытиеЖурналаРегистрации(НСтр("ru = 'Установка настроек оплаты сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Ошибка при установке настроек оплаты сервиса по причине:
					   |%1
					   |См. подробности в журнале регистрации приложения биллинга.'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
		
	Если ОплатаСервиса.ПоддерживаетсяЗагрузкаТарифов() Тогда
		ОплатаСервиса.ЗагрузитьТарифыСервиса()
	КонецЕсли;
	
КонецПроцедуры

// Удаление настроек оплаты сервиса.
//
// Параметры:
//  КодАбонента - число - код абонента-владельца учетной системы.
//
Процедура УдалитьНастройкиОплатыСервиса(КодАбонента) Экспорт
	
	РезультатОбработки = НовыйРезультатОбработки();
	
	Попытка
		ОплатаСервисаПереопределяемый.ПриУдаленииНастроекОплатыСервиса(КодАбонента, РезультатОбработки);
		Если РезультатОбработки.Ошибка Тогда
			ВызватьИсключение РезультатОбработки.Сообщение;
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = СобытиеЖурналаРегистрации(НСтр("ru = 'Удаление настроек оплаты сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Ошибка при удалении настроек оплаты сервиса по причине:
					   |%1
					   |См. подробности в журнале регистрации приложения биллинга.'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

// Обработчик фонового задания подготовки счета на оплату.
//
// Параметры:
//  ДанныеЗапроса - см. ОплатаСервиса.ДанныеЗапросаСчетаНаОплату
//
Процедура ПодготовитьСчетНаОплату(ДанныеЗапроса) Экспорт
	
	Попытка	
		ИдентификаторСчета = Новый УникальныйИдентификатор(ДанныеЗапроса.ИдентификаторСчета);
		
		// Создание счета на оплату по данным запроса.
		РезультатОбработки = НовыйРезультатОбработки();
		СчетНаОплату = СоздатьСчетНаОплату(ДанныеЗапроса, РезультатОбработки);
		Если РезультатОбработки.Ошибка Тогда
			Данные = ОплатаСервиса.ШаблонДанныхОтвета(ОплатаСервиса.КодВозвратаОшибкаДанных(), РезультатОбработки.Сообщение);
			ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
			Возврат;
		КонецЕсли; 
		
		// Получение печатной формы счета на оплату.
		РезультатОбработки = НовыйРезультатОбработки();
		ПечатнаяФорма = ПечатнаяФормаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки);
		Если Не ПечатнаяФорма = Неопределено Тогда
			Поток = Новый ПотокВПамяти;
			ПечатнаяФорма.Записать(Поток, ТипФайлаТабличногоДокумента.MXL);
			ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
			УстановитьОтключениеБезопасногоРежима(Истина);
			ПоместитьФайлВСчет(ИдентификаторСчета, ДвоичныеДанные, "bill.mxl");
			УстановитьОтключениеБезопасногоРежима(Ложь);
		ИначеЕсли РезультатОбработки.Ошибка Тогда
			Данные = ОплатаСервиса.ШаблонДанныхОтвета(ОплатаСервиса.КодВозвратаОшибкаДанных(), РезультатОбработки.Сообщение);
			ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
			Возврат;
		КонецЕсли;
		
		// Получение двоичных данных счета на оплату.
		РезультатОбработки = НовыйРезультатОбработки();
		ДанныеСчета = ДанныеСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки);
		Если Не ДанныеСчета = Неопределено Тогда
			УстановитьОтключениеБезопасногоРежима(Истина);
			ПоместитьФайлВСчет(ИдентификаторСчета, ДанныеСчета, "bill.zip");
			УстановитьОтключениеБезопасногоРежима(Ложь);
		ИначеЕсли РезультатОбработки.Ошибка Тогда
			Данные = ОплатаСервиса.ШаблонДанныхОтвета(ОплатаСервиса.КодВозвратаОшибкаДанных(), РезультатОбработки.Сообщение);
			ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
			Возврат;
		КонецЕсли;
		
		Если ПечатнаяФорма = Неопределено И ДанныеСчета = Неопределено Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Не заданы или не возвращают данных переопределяемые методы %1 и %2.'"),
				"ОплатаСервисаПереопределяемый.ПриПолученииПечатнойФормыСчетаНаОплату",
				"ОплатаСервисаПереопределяемый.ПриПолученииДанныхСчетаНаОплату");
		КонецЕсли;
			
		РезультатОбработки = НовыйРезультатОбработки();
		ПлатежнаяСсылка = ПлатежнаяСсылкаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки);
		Если РезультатОбработки.Ошибка Тогда
			Данные = ОплатаСервиса.ШаблонДанныхОтвета(ОплатаСервиса.КодВозвратаОшибкаДанных(), РезультатОбработки.Сообщение);
			ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
			Возврат;
		КонецЕсли;
		
		Данные = ОплатаСервиса.ШаблонДанныхОтвета();
		Данные.Вставить("payment_link", ПлатежнаяСсылка);
		
		ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ИмяСобытия = СобытиеЖурналаРегистрации(НСтр("ru = 'Подготовка счета на оплату'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		Данные = ОплатаСервиса.ШаблонДанныхОтвета(ОплатаСервиса.КодВозвратаВнутренняяОшибка(), ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		ОплатаСервиса.ОтправитьОтветВУчетнуюСистемуБиллинга(ИдентификаторСчета, Данные);
		
	КонецПопытки;
	
КонецПроцедуры

// Преобразует переданное значение в JSON-строку.
//
// Параметры:
//  Данные - Структура - данные.
// 
// Возвращаемое значение:
//  Строка - строка в формате JSON.
//
Функция СтрокаJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные,, "ПреобразованиеДанныхJSON", ОплатаСервисаСлужебный);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Преобразует строку JSON в структуру.
//
// Параметры:
//	Строка - Строка - строка в формате JSON
//	ИменаСвойствСоЗначениямиДата - Массив из Строка - имена свойств для преобразования в значения типа Дата.
// 
// Возвращаемое значение:
//	Структура - данные из переданной строки.
Функция ДанныеJSON(Строка, ИменаСвойствСоЗначениямиДата = Неопределено) Экспорт
	
	Если ПустаяСтрока(Строка) Тогда
		Возврат Новый Структура;
	КонецЕсли; 
	
	Если ИменаСвойствСоЗначениямиДата = Неопределено Тогда
		ИменаСвойствСоЗначениямиДата = Новый Массив;
	КонецЕсли; 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Если ИменаСвойствСоЗначениямиДата.Количество() = 0 Тогда
		Ответ = ПрочитатьJSON(ЧтениеJSON); 
	Иначе
		Ответ = ПрочитатьJSON(ЧтениеJSON, , , , 
			"ВосстановлениеЗначенияДата", ОплатаСервисаСлужебный, ,
			ИменаСвойствСоЗначениямиДата);
	КонецЕсли;
	
	Возврат Ответ; // @skip-check constructor-function-return-section
	
КонецФункции

// Cм. метод глобального контекста - ЗаписатьJSON, параметр ИмяФункцииПреобразования.
// 
// Параметры:
//  Свойство - Строка
//  Значение - Произвольный
//  ДополнительныеПараметры - Произвольный
//  Отказ - Булево
// 
// Возвращаемое значение:
//  Строка - Преобразование данных JSON
Функция ПреобразованиеДанныхJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Если ТипЗнч(Значение) = Тип("Null") Тогда
		Отказ = Истина;
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Значение)) Тогда
		Возврат Строка(Значение.УникальныйИдентификатор());
	ИначеЕсли ТипЗнч(Значение) = Тип("УникальныйИдентификатор") Тогда
		Возврат Строка(Значение);
	КонецЕсли;
	
КонецФункции

// Обработчик восстановления значения типа Дата при чтении JSON-строки.
// 
// Параметры:
//  Свойство - Строка - имя свойства объекта.
//  Значение - Строка, Число - значение, полученное из JSON-строки.
//  ДополнительныеПараметры - Произвольный - дополнительные параметры обработчика.
// 
// Возвращаемое значение:
//  Дата - восстановленное значение даты.
Функция ВосстановлениеЗначенияДата(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	// Проверка стандартных значений 2018-01-01T00:00:00, 2018-01-01T00:00:00Z, 2018-01-01T00:00:00+0000
	Если СтрДлина(Значение) <= 24 И Сред(Значение, 5, 1) = "-" И Сред(Значение, 8, 1) = "-" И Сред(Значение, 11, 1) = "T" Тогда
		Возврат XMLЗначение(Тип("Дата"), Значение);
	КонецЕсли; 
	
	// Восстановление даты в формате дд.ММ.гггг
	ЧастиЗначенияДаты = СтрРазделить(Значение, ".");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[1]), Число(ЧастиЗначенияДаты[0]));
	КонецЕсли;
	
	// Восстановление даты в формате ММ/дд/гггг
	ЧастиЗначенияДаты = СтрРазделить(Значение, "/");
	Если ЧастиЗначенияДаты.Количество() >= 3 Тогда
		Возврат Дата(Число(ЧастиЗначенияДаты[2]), Число(ЧастиЗначенияДаты[0]), Число(ЧастиЗначенияДаты[1]));
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Переименования полей запроса.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка
//   * Значение - см. ПрограммныйИнтерфейсСервисаСлужебный.ОписаниеКолонки
Функция ПереименованияПолейЗапроса() Экспорт
	
	Служебный = ПрограммныйИнтерфейсСервисаСлужебный;
	Переименования = Новый Соответствие;
	Переименования.Вставить("id", Служебный.ОписаниеКолонки("ИдентификаторСчета", Новый ОписаниеТипов("УникальныйИдентификатор")));
	Переименования.Вставить("seller_id", Служебный.ОписаниеКолонки("КодПродавца", ОбщегоНазначения.ОписаниеТипаЧисло(12)));
	Переименования.Вставить("seller_name", Служебный.ОписаниеКолонки("НаименованиеПродавца", ОбщегоНазначения.ОписаниеТипаСтрока(64)));
	Переименования.Вставить("seller_public_id", Служебный.ОписаниеКолонки("ПубличныйИдентификаторПродавца", ОбщегоНазначения.ОписаниеТипаСтрока(36)));
	Переименования.Вставить("seller_email", Служебный.ОписаниеКолонки("ПочтаПродавца", Новый ОписаниеТипов("Строка")));
	Переименования.Вставить("client_id", Служебный.ОписаниеКолонки("КодПокупателя", ОбщегоНазначения.ОписаниеТипаЧисло(12)));
	Переименования.Вставить("client_name", Служебный.ОписаниеКолонки("НаименованиеПокупателя", ОбщегоНазначения.ОписаниеТипаСтрока(64)));
	Переименования.Вставить("client_public_id", Служебный.ОписаниеКолонки("ПубличныйИдентификаторПокупателя", ОбщегоНазначения.ОписаниеТипаСтрока(36)));
	Переименования.Вставить("client_email", Служебный.ОписаниеКолонки("ПочтаПокупателя", ОбщегоНазначения.ОписаниеТипаСтрока(500)));
	Переименования.Вставить("client_phone", Служебный.ОписаниеКолонки("ТелефонПокупателя", ОбщегоНазначения.ОписаниеТипаСтрока(500)));
	Переименования.Вставить("client_info", Служебный.ОписаниеКолонки("ДополнительнаяИнформация", Новый ОписаниеТипов("Строка")));
	Переименования.Вставить("renewal", Служебный.ОписаниеКолонки("Продление", Новый ОписаниеТипов("Булево")));
	Переименования.Вставить("payment_link", Служебный.ОписаниеКолонки("ПлатежнаяСсылка", ОбщегоНазначения.ОписаниеТипаСтрока(1024)));
	Переименования.Вставить("total_cost", Служебный.ОписаниеКолонки("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(31, 2, ДопустимыйЗнак.Неотрицательный)));
	Переименования.Вставить("tariffs", "Тарифы");
	Переименования.Вставить("services", "Услуги");
	
	Возврат Переименования;
	
КонецФункции

Процедура ЛогироватьHTTPЗапрос(Запрос, Ответ, ДвоичныеДанные = Ложь) Экспорт
	
	Описание = ОписаниеЗапроса(Запрос, ДвоичныеДанные) + Символы.ПС + "---" + Символы.ПС + ОписаниеОтвета(Ответ, ДвоичныеДанные);
	ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации(НСтр("ru = 'HTTP-запрос'")), УровеньЖурналаРегистрации.Информация,
		Метаданные.HTTPСервисы.Биллинг, , Описание);
	
КонецПроцедуры

// Добавить заголовки данных.
// 
// Параметры:
//  Ответ - HTTPСервисОтвет
Процедура ДобавитьЗаголовкиДанных(Ответ) Экспорт
	
	Заголовки = Ответ.Заголовки;
	
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Accept-Charset", "utf-8");
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Cache-Control", "no-cache");
	
КонецПроцедуры

// Владелец пароля авторизации в учетной системе.
// 
// Возвращаемое значение:
//  Строка
Функция ВладелецПароляАвторизацииВУчетнойСистеме() Экспорт
	
	Возврат Метаданные.Константы.ИмяПользователяУчетнойСистемы.ПолноеИмя();
	
КонецФункции

// Событие журнала регистрации.
// 
// Параметры:
//  Уточнение - Строка
// 
// Возвращаемое значение:
//  Строка
Функция СобытиеЖурналаРегистрации(Уточнение) Экспорт

	Возврат СтрШаблон("%1.%2", НСтр("ru = 'Оплата сервиса'", ОбщегоНазначения.КодОсновногоЯзыка()), Уточнение);

КонецФункции

// Новый результат обработки.
// 
// Возвращаемое значение:
//  Структура:
// * Ошибка - Булево 
// * Сообщение - Строка 
Функция НовыйРезультатОбработки() Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("Ошибка", Ложь);
	РезультатОбработки.Вставить("Сообщение", "");
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСчетНаОплату(ДанныеЗапроса, РезультатОбработки)

	СчетНаОплату = Неопределено;
	
	ОплатаСервисаПереопределяемый.ПриСозданииСчетаНаОплату(
		ДанныеЗапроса, СчетНаОплату, РезультатОбработки);
		
	Возврат СчетНаОплату;

КонецФункции

Функция ПечатнаяФормаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки)
	
	ПечатнаяФорма = Неопределено; // ТабличныйДокумент
	
	ОплатаСервисаПереопределяемый.ПриПолученииПечатнойФормыСчетаНаОплату(
		ДанныеЗапроса, СчетНаОплату, ПечатнаяФорма, РезультатОбработки);
		
	Возврат ПечатнаяФорма;
	
КонецФункции

Функция ДанныеСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки)
	
	Данные = Неопределено;
	
	ОплатаСервисаПереопределяемый.ПриПолученииДанныхСчетаНаОплату(
		ДанныеЗапроса, СчетНаОплату, Данные, РезультатОбработки);
		
	Возврат Данные;
	
КонецФункции

Функция ПлатежнаяСсылкаСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки)
	
	ПлатежнаяСсылка = "";
	
	ОплатаСервисаПереопределяемый.ПриПолученииПлатежнойСсылки(
			ДанныеЗапроса, СчетНаОплату, ПлатежнаяСсылка, РезультатОбработки);	
	
	Возврат ПлатежнаяСсылка;
	
КонецФункции
 
// @unavailable-in-safemode
Функция ПоместитьФайлВСчет(ИдентификаторСчета, ДвоичныеДанные, ИмяФайла)
	
	ПараметрыТокена = ПрограммныйИнтерфейсСервиса.НовыйПараметрыПолученияТалонаНаЗагрузкуФайла();
	ПараметрыТокена.ИдентификаторСчета = ИдентификаторСчета;
	ПараметрыТокена.Размер = ДвоичныеДанные.Размер();
	ПараметрыТокена.ИмяФайла = ИмяФайла;
	ДанныеТокена = ПрограммныйИнтерфейсСервиса.СчетНаОплатуФайлыТалонНаЗагрузку(ПараметрыТокена);
	Адрес = СтрШаблон("hs/dt/upload/%1", ДанныеТокена.ТалонНаЗагрузкуФайла);
	УстановитьПривилегированныйРежим(Истина);
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		АдресСервиса = РаботаВМоделиСервиса.ВнутреннийАдресМенеджераСервиса();
	Иначе
		АдресСервиса = ПрограммныйИнтерфейсСервисаСлужебный.АдресСервисаИзЛокальнойБазы();
	КонецЕсли;
	
	ПолныйАдрес = СтрШаблон("%1/%2", АдресСервиса, Адрес);
	ДанныеСервера = ОбщегоНазначенияКлиентСервер.СтруктураURI(ПолныйАдрес);
	
	Если РаботаВМоделиСервиса.РазделениеВключено() Тогда
		Соединение = РаботаВМоделиСервисаБТС.СоединениеСМенеджеромСервиса(ДанныеСервера);
	Иначе
		Соединение = ПрограммныйИнтерфейсСервисаСлужебный.СоединениеСМенеджеромСервисаИзЛокальнойБазы(ДанныеСервера);
	КонецЕсли; 
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = ДанныеСервера.ПутьНаСервере;
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанные);
	ЗапросHTTP.Заголовки.Вставить("IBSession", "start");
	ЗапросHTTP.Заголовки.Вставить("Content-Range", 
		СтрШаблон("bytes 0-%1/%2", Формат(ПараметрыТокена.Размер - 1, "ЧГ=0"), 
		Формат(ПараметрыТокена.Размер, "ЧГ=0")));
	
	Ответ = Соединение.ВызватьHTTPМетод("PUT", ЗапросHTTP);
	
	Если Ответ.КодСостояния = 500 Тогда
		Для Счетчик = 1 По 3 Цикл
			ВызватьПаузу(Счетчик * 3000);
			Ответ = Соединение.ВызватьHTTPМетод("PUT", ЗапросHTTP);
			Если Не Ответ.КодСостояния = 201 Тогда
				Прервать;
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	
	Если Не Ответ.КодСостояния = 201 Тогда
		ЛогироватьHTTPЗапрос(ЗапросHTTP, Ответ, Истина);
		Если Ответ.КодСостояния = 500 Тогда
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка 500 при помещении файла в счет на оплату %1 по причине: %2'"),
				ИдентификаторСчета, Ответ.ПолучитьТелоКакСтроку());
			ВызватьИсключение ТекстОшибки;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#Область Логирование

Функция БазовыйURL(HTTPСервисЗапрос)
	
	БазовыйURL = HTTPСервисЗапрос.Заголовки.Получить("X-Forwarded-Path");
	Если БазовыйURL = Неопределено Тогда
		Возврат НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL);
	Иначе
		ЧастиАдреса = СтрРазделить(НормализоватьАдрес(HTTPСервисЗапрос.БазовыйURL), "/", Ложь);
		Возврат ЧастиАдреса[0] + "//" + ЧастиАдреса[1] + БазовыйURL;
	КонецЕсли;
	
КонецФункции

Функция НормализоватьАдрес(Адрес)
	
	ЧастиАдреса = СтрРазделить(Адрес, "/", Ложь);
	
	Протокол = СокрЛП(ЧастиАдреса[0]) + "//";
	ЧастиАдреса.Удалить(0);
	
	ЧастиИмени = СтрРазделить(СокрЛП(ЧастиАдреса[0]), ":");
	ЧастиАдреса.Удалить(0);
	ИмяСервера = ЧастиИмени[0];
	ПортСервера = ?(ЧастиИмени.Количество() = 1, "", СокрЛП(ЧастиИмени[1]));
	Если Протокол = "http://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "80", "", ":" + ПортСервера);
	ИначеЕсли Протокол = "https://" Тогда
		ПортСервера = ?(ПустаяСтрока(ПортСервера) Или ПортСервера = "443", "", ":" + ПортСервера);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестный протокол: %1'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), Протокол);
	КонецЕсли;
	
	Путь = "/" + СтрСоединить(ЧастиАдреса, "/");
	
	Возврат Протокол + ИмяСервера + ПортСервера + Путь;
	
КонецФункции

Функция ОписаниеЗапроса(Запрос, ДвоичныеДанные = Ложь)
	
	ПараметрыЗапроса = Неопределено;
	Если ТипЗнч(Запрос) = Тип("HTTPСервисЗапрос") Тогда
		Если Запрос.ПараметрыЗапроса.Количество() Тогда
			ПараметрыЗапроса = Новый Массив;
			Для Каждого КлючИЗначение Из Запрос.ПараметрыЗапроса Цикл
				ПараметрыЗапроса.Добавить(КлючИЗначение.Ключ + "=" + КодироватьСтроку(
					КлючИЗначение.Значение, СпособКодированияСтроки.КодировкаURL));
			КонецЦикла;
			ПараметрыЗапроса = "?" + СтрСоединить(ПараметрыЗапроса, "&");
		КонецЕсли;
		Адрес = Запрос.HTTPМетод + " " + БазовыйURL(Запрос) + Запрос.ОтносительныйURL + ПараметрыЗапроса;
	Иначе
		Адрес = Запрос.АдресРесурса;
	КонецЕсли;
	
	Заголовки = Новый Массив;
	Звездочки = "***";
	Для Каждого Заголовок  Из Запрос.Заголовки Цикл
		КлючЗаголовка = Заголовок.Ключ;
		ЗначениеЗаголовка = Заголовок.Значение;
		// Для заголовка Authorization скрываем значение пароля.
		Если НРег(КлючЗаголовка) = "authorization" И Не ПустаяСтрока(ЗначениеЗаголовка) Тогда
			ЧастиЗначения = СтрРазделить(ЗначениеЗаголовка, " ");
			Если ЧастиЗначения.Количество() = 1 Тогда
				ЧастиЗначения[0] = Звездочки;
			ИначеЕсли НРег(ЧастиЗначения[0]) = "basic" Тогда
				Попытка
					ЛогинПароль = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(ЧастиЗначения[1]));
					ЧастиЛогинПароль = СтрРазделить(ЛогинПароль, ":");
					Если ЧастиЛогинПароль.Количество() >= 2 Тогда
						ЧастиЛогинПароль[1] = Звездочки;
						ЧастиЗначения[1] = СтрСоединить(ЧастиЛогинПароль, ":");
					Иначе
						ЧастиЗначения[1] = Звездочки;
					КонецЕсли;
				Исключение
					ЧастиЗначения[1] = Звездочки;
				КонецПопытки;
			Иначе
				ЧастиЗначения[1] = Звездочки;
			КонецЕсли;
			ЗначениеЗаголовка = СтрСоединить(ЧастиЗначения, " ");
		КонецЕсли;
		Заголовки.Добавить(СтрШаблон("%1: %2", КлючЗаголовка, ЗначениеЗаголовка));
	КонецЦикла;
	
	Если ДвоичныеДанные Тогда
		ТелоЗапроса = ПолучитьBase64СтрокуИзДвоичныхДанных(Запрос.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	КонецЕсли; 
	
	Если СтрДлина(ТелоЗапроса) > 1000 Тогда
		ТелоЗапроса = СтрШаблон(НСтр("ru = '%1...'"), Лев(ТелоЗапроса, 1000));
	КонецЕсли; 
	
	Возврат СтрШаблон(
		"%1
		|%2
		|
		|%3", Адрес, 
		СтрСоединить(Заголовки, Символы.ПС), ТелоЗапроса);
	
КонецФункции

Функция ОписаниеОтвета(Ответ, ДвоичныеДанные = Ложь)
	
	Заголовки = Новый Массив;
	Для Каждого Заголовок  Из Ответ.Заголовки Цикл
		Заголовки.Добавить(СтрШаблон("%1: %2", Заголовок.Ключ, Заголовок.Значение));
	КонецЦикла; 
	
	Если ТипЗнч(Ответ) = Тип("HTTPСервисОтвет") Тогда
		КодСостояния = СтрШаблон("%1 %2", Ответ.КодСостояния, Ответ.Причина);
	Иначе
		КодСостояния = Ответ.КодСостояния
	КонецЕсли; 
	
	Если ДвоичныеДанные Тогда
		ТелоОтвета = ПолучитьBase64СтрокуИзДвоичныхДанных(Ответ.ПолучитьТелоКакДвоичныеДанные());
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли; 

	Если СтрДлина(ТелоОтвета) > 1000 Тогда
		ТелоОтвета = СтрШаблон(НСтр("ru = '%1...'"), Лев(ТелоОтвета, 1000));
	КонецЕсли; 
	
	
	Возврат СтрШаблон(
		"%1
		|%2
		|
		|%3", 
		КодСостояния,
		СтрСоединить(Заголовки, Символы.ПС), Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

#КонецОбласти

#КонецОбласти
