#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить(
		"ТаблицаОбновлениеПериодическихОбучений", ОбучениеПоОхранеТруда.НоваяТаблицаОбновлениеПериодическихОбучений());
	ДополнительныеСвойства.Вставить(
		"ТаблицаБудущиеСобытияОбучениеПоОхранеТруда", ОбучениеПоОхранеТруда.НоваяТаблицаБудущиеСобытияОбучениеПоОхранеТруда());
	
	РегистрыСведений.ПроверкиЗнанияТребованийОхраныТрудаСотрудников.ДополнитьТаблицыОбновления(ЭтотОбъект, Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ПроверкиЗнанияТребованийОхраныТрудаСотрудников.ДополнитьТаблицыОбновления(ЭтотОбъект, Замещение);
	
	ОбучениеПоОхранеТруда.ЗарегистрироватьОбновлениеПериодическихОбучений(
		ДополнительныеСвойства["ТаблицаОбновлениеПериодическихОбучений"]);
	ОбучениеПоОхранеТруда.ЗарегистрироватьБудущиеСобытияОбучениеПоОхранеТруда(
		ДополнительныеСвойства["ТаблицаБудущиеСобытияОбучениеПоОхранеТруда"]);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли