
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ВызватьИсключение НСтр("ru='Интерактивное создание документа не поддерживается.'");
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, ПараметрОповещения, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, ПараметрОповещения) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиПодключаемыхКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаКлиенте
Процедура ЗаявкаВыполнена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОтклонена(Команда)
	
	РезультатВыполненияЗаявки = ПредопределенноеЗначение("Перечисление.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена");
	ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТиповойОтвет(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ВыбратьТиповойОтвет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСрокИсполнения(Команда)
	
	ЗаявкиСотрудниковФормыКлиент.ИзменитьСрокИсполнения(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиПодсистем

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область ЗавершениеЗаявки

&НаКлиенте
Процедура ВыполнитьЗаявкуНаКлиенте(РезультатВыполненияЗаявки)

	Если ЗаявкиСотрудниковФормыКлиент.ЗаявкаГотоваКВыполнению(ЭтаФорма, РезультатВыполненияЗаявки, ОписаниеДокумента()) Тогда
		ЗаявкиСотрудниковФормыКлиент.НачатьВыполнениеКомандыЗаявкаВыполнена(ЭтаФорма, РезультатВыполненияЗаявки, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция РезультатЗаписиВыполненияЗаявки(РезультатВыполненияЗаявки) Экспорт

	Возврат РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки);

КонецФункции

&НаСервере
Функция РезультатЗаписиВыполненияЗаявкиНаСервере(РезультатВыполненияЗаявки) Экспорт
	
	Возврат ЗаявкиСотрудников.РезультатЗаписиВыполненияЗаявки(ЭтаФорма, РезультатВыполненияЗаявки, ОписаниеДокумента());
	
КонецФункции

&НаКлиенте
Процедура ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаявкиСотрудниковФормыКлиент.ОбработчикЗавершенияЗаписиВыполненияЗаявки(Результат, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область ФайлыТабличнойЧасти

&НаСервере
Процедура ЗаполнитьПрисоединенныеФайлыЗатрат() 
	
	ФайлыРасходов = ПрисоединенныеФайлыРасходов();
	
	Для каждого СтрокаРасходы Из Объект.Расходы Цикл
		Если ЗначениеЗаполнено(СтрокаРасходы.ИдентификаторСтроки) Тогда
			ФайлыСтроки = ФайлыРасходов[СтрокаРасходы.ИдентификаторСтроки]; 
			Если ЗначениеЗаполнено(ФайлыСтроки) Тогда
				СтрокаРасходы.Файлы.ЗагрузитьЗначения(ФайлыСтроки);
				Если ФайлыСтроки.Количество() = 1 Тогда
					ФайлыПредставление = Строка(ФайлыСтроки[0]);
				Иначе
					ФайлыПредставление = ПредставлениеКоличестваФайлов(ФайлыСтроки.Количество());
				КонецЕсли;
				СтрокаРасходы.ФайлыПредставление = ФайлыПредставление;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция ПредставлениеКоличестваФайлов(КоличествоФайлов) Экспорт
	Возврат СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru=';%1 файл;;%1 файла;%1 файлов;'"), КоличествоФайлов); 
КонецФункции

&НаСервере
Функция ПрисоединенныеФайлыРасходов() 
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Файлы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Файлы.Ссылка КАК СсылкаНаФайл
	|ИЗ
	|	Справочник.РасходыВКомандировкеКабинетСотрудникаПрисоединенныеФайлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ Файлы.ПометкаУдаления
	|ИТОГИ ПО
	|	ИдентификаторСтроки";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаИдентификаторСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаИдентификаторСтроки.Следующий() Цикл 
		ВыборкаФайл = ВыборкаИдентификаторСтроки.Выбрать();
		ФайлыСтроки = Новый Массив;
		Пока ВыборкаФайл.Следующий() Цикл
			ФайлыСтроки.Добавить(ВыборкаФайл.СсылкаНаФайл);
		КонецЦикла;
		Результат.Вставить(ВыборкаИдентификаторСтроки.ИдентификаторСтроки, ФайлыСтроки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РасходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РасходыФайлыПредставление" Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Расходы.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Или ТекущиеДанные.Файлы.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Файлы.Количество() = 1 Тогда
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(ТекущиеДанные.Файлы[0].Значение, УникальныйИдентификатор);
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Ложь);
		Иначе
			
			ТекстЗаголовка = НСтр("ru = 'Файлы'");
			
			ПараметрыОткрытия = Новый Структура("ТекстЗаголовка,ПрисоединенныеФайлы");
			ПараметрыОткрытия.ТекстЗаголовка 		= ТекстЗаголовка;
			ПараметрыОткрытия.ПрисоединенныеФайлы 	= ТекущиеДанные.Файлы;
			
			ОткрытьФорму("Документ.РасходыВКомандировкеКабинетСотрудника.Форма.ФормаВыбораФайлов",
				ПараметрыОткрытия, ЭтаФорма, Истина,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДокумента()

	Описание = ЗаявкиСотрудниковКлиентСервер.НовоеОписаниеДокументаЗаявки();
	Описание.ДоступнаОтменаЗаявки 	= Истина;
	Описание.ЭтоОтчетСотрудника 	= Истина;
	Возврат Описание;

КонецФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ЗаявкиСотрудниковФормы.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, ОписаниеДокумента());
	ЗаявкаНаКомандировку = ЗаявкаНаКомандировку(ТекущийОбъект.ИдентификаторЗаявкиНаКомандировку);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ЗаявкаНаКомандировку", "Видимость", ЗначениеЗаполнено(ЗаявкаНаКомандировку));
	
	// Состояние заявки.
	Если Объект.Выполнена Тогда
		Если Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена Тогда
			ЗаголовокСостояниеЗаявки = НСтр("ru = 'Отчет принят'");
		ИначеЕсли Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Аннулирована Тогда
			ЗаголовокСостояниеЗаявки = НСтр("ru = 'Отчет аннулирован'");
		Иначе
			ЗаголовокСостояниеЗаявки = НСтр("ru = 'Отчет отклонен, описание причины см в сообщении сотруднику'");
		КонецЕсли;
	Иначе
		ЗаголовокСостояниеЗаявки = НСтр("ru = 'Отчет не обработан'");
	КонецЕсли;
	Элементы.ДекорацияСостояниеЗаявки.Заголовок = ЗаголовокСостояниеЗаявки;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЗаявкаВыполнена", "Видимость", Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияОтклонена", "Видимость", Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Отклонена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияАннулирована", "Видимость", Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Аннулирована);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияНаВыполнении", "Видимость", Не Объект.Выполнена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНаВыполнении", "Видимость", Не Объект.Выполнена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаИсполнение", "Видимость", Объект.Выполнена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"АвторПоручения", "Видимость", ЗначениеЗаполнено(АвторПоручения));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДокументЭДОБЗК", "Видимость", ЗначениеЗаполнено(ДокументЭДОБЗК));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИдентификаторЭлектронногоДокумента", "Видимость", ЗначениеЗаполнено(Объект.ИдентификаторЭлектронногоДокумента)); 
	
	ФормаЗаблокирована = Объект.Выполнена Или ЗначениеЗаполнено(ОтменяющаяЗаявка);
	
	// Установка доступности формы.
	ТолькоПросмотр = ФормаЗаблокирована;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтраницыФормы", "ТолькоПросмотр", ФормаЗаблокирована);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаКомандыВыполнения", "Доступность", Не ФормаЗаблокирована);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаКомандыВыполненияЗаявки", "Доступность", Не ФормаЗаблокирована);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВыбратьТиповойОтвет", "Доступность", Не ФормаЗаблокирована);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИзменитьСрокИсполнения", "Доступность", Не ФормаЗаблокирована);
	
	// Если заявка отменяет другую.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаОтменяемаяЗаявка", "Видимость", ЗначениеЗаполнено(Объект.ОтменяемаяЗаявка));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаРасходы", "Видимость", Не Объект.ВариантИсправления = Перечисления.ВариантыИсправленияЗаявокКабинетСотрудника.Отмена);
	
	Если ЗначениеЗаполнено(ОтменяющаяЗаявка) Тогда
		Если Объект.РезультатВыполнения = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Аннулирована
			Или РезультатВыполненияОтменяющейЗаявки = Перечисления.РезультатыВыполненияЗаявокКабинетСотрудника.Выполнена Тогда
			ЗаголовокОтменаЗаявки = НСтр("ru = 'Отменена по заявке'");
		Иначе
			ЗаголовокОтменаЗаявки = НСтр("ru = 'Зарегистрирована отмена этого отчета'");
		КонецЕсли;
		Элементы.ДекорацияНадписьОтменена.Заголовок = ЗаголовокОтменаЗаявки;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеОтменены", "Видимость", ЗначениеЗаполнено(ОтменяющаяЗаявка));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасходыВалюта", "Видимость", Объект.ЕстьРасходыВВалюте);
	ЗаполнитьПрисоединенныеФайлыЗатрат();
	
КонецПроцедуры

&НаСервере
Функция ЗаявкаНаКомандировку(ИдентификаторЗаявкиНаКомандировку)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЗаявки", ИдентификаторЗаявкиНаКомандировку); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаКомандировка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявкаКомандировкаКабинетСотрудника КАК ЗаявкаКомандировка
	|ГДЕ
	|	ЗаявкаКомандировка.ИдентификаторЗаявки = &ИдентификаторЗаявки";
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если ЗначениеЗаполнено(Данные) Тогда
		Возврат Данные[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти



