#Область СлужебныеПроцедурыИФункции

Процедура ВыполнитьДействияПриЗаписиЗаданияАдаптацииУвольнения(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не АдаптацияУвольнение.ИспользуетсяАдаптацияУвольнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Задание", Источник.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаданияАдаптацииУвольнения.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.УдалитьЗаданияАдаптацииУвольнения КАК ЗаданияАдаптацииУвольнения
		|ГДЕ
		|	ЗаданияАдаптацииУвольнения.Задание = &Задание";
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не Результат.Пустой() И Не Источник.ДополнительныеСвойства.Свойство("ПометкаОснованияЗадачАдаптацииУвольнения") Тогда
		ТекстСообщения = НСтр("ru = '""Пометка на удаление"" заданий адаптации и увольнения выполняется при пометке основания заданий.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Источник.Ссылка, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДействияПриЗаписиЗадачиАдаптацииУвольнения(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не АдаптацияУвольнение.ИспользуетсяАдаптацияУвольнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Выполнена
		Или Источник.ПометкаУдаления
		Или Не ЗначениеЗаполнено(Источник.Предмет) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Предмет);
	Запрос.УстановитьПараметр("Задание", Источник.БизнесПроцесс);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданияАдаптацииУвольнения.ДокументОснование КАК ДокументОснование,
		|	ЗаданияАдаптацииУвольнения.Мероприятие КАК Мероприятие,
		|	ЗаданияАдаптацииУвольнения.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.УдалитьЗаданияАдаптацииУвольнения КАК ЗаданияАдаптацииУвольнения
		|ГДЕ
		|	ЗаданияАдаптацииУвольнения.ДокументОснование = &ДокументОснование
		|	И ЗаданияАдаптацииУвольнения.Задание = &Задание
		|	И ЗаданияАдаптацииУвольнения.ЗадачаИсполнителя = ЗНАЧЕНИЕ(Задача.ЗадачаИсполнителя.ПустаяСсылка)";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.УдалитьЗаданияАдаптацииУвольнения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументОснование.Установить(Выборка.ДокументОснование);
		НаборЗаписей.Отбор.Мероприятие.Установить(Выборка.Мероприятие);
		НаборЗаписей.Отбор.ФизическоеЛицо.Установить(Выборка.ФизическоеЛицо);
		НаборЗаписей.Прочитать();
		НаборЗаписей[0].ЗадачаИсполнителя = Источник.Ссылка;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗадачуПослеПрохожденияОпросаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не АдаптацияУвольнение.ИспользуетсяАдаптацияУвольнение() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗадачаИсполнителяЗадачиПоИсполнителю.Ссылка КАК Ссылка
	|ИЗ
	|	Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю(
	|			&Исполнитель,
	|			БизнесПроцесс.Опрос = &Опрос
	|				И НЕ Выполнена
	|				И НЕ ПометкаУдаления) КАК ЗадачаИсполнителяЗадачиПоИсполнителю");
	Запрос.УстановитьПараметр("Опрос", Источник.Опрос);
	Запрос.УстановитьПараметр("Исполнитель", Источник.Респондент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Задача.ЗадачаИсполнителя");
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			БизнесПроцессыИЗадачиВызовСервера.ВыполнитьЗадачу(Выборка.Ссылка);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка выполнения связанной с анкетой задачи: %1'"), ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти