
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыНастройки = ПараметрыНастройки(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Организация, Резерв, НачалоПериода, КонецПериода, КонтекстныйВызов",
		ПараметрыНастройки.Организация, ПараметрыНастройки.Резерв, ПараметрыНастройки.НачалоПериода, ПараметрыНастройки.КонецПериода, Истина);
	ОткрытьФорму("РегистрСведений.БухучетРезервовПоОплатеТруда.Форма.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыНастройки(НастройкаСсылка)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаСсылка, "Организация, Резерв, НачалоПериода, КонецПериода");
	
КонецФункции
