// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", РегистрыБЗК.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = ДополнительныеСвойства.ПрежнийНабор;
	ТаблицаСформированныеЗаказыНаВыдачуСИЗ = РегистрыБЗК.ИзменениеЗаписейНабора(ПрежнийНабор, ЭтотОбъект, Замещение);
	ТаблицаСформированныеЗаказыНаВыдачуСИЗ.Свернуть("ФизическоеЛицо, РабочееМесто, ГоловнаяОрганизация");
	СредстваИндивидуальнойЗащиты.ЗарегистрироватьОбновлениеВыдачиСИЗ(ТаблицаСформированныеЗаказыНаВыдачуСИЗ, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли