// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//   Форма - см. Справочник.ПрограммыОбученияСотрудниковПоОхранеТруда.Форма.ФормаЭлемента
Процедура РазвернутьДеревоЗначений(Форма) Экспорт
	
	Для Каждого СтрокаДереваРабочихМест Из Форма.РабочиеМеста.ПолучитьЭлементы() Цикл
		Форма.Элементы.РабочиеМеста.Развернуть(СтрокаДереваРабочихМест.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

// Упорядочивает выделенные строки в убывающем порядке.
//
// Параметры:
//   ВыделенныеСтроки - Массив Из Число - список строк для упорядочивания
//
// Возвращаемое значение:
//   Массив - упорядоченные строки в убывающем порядке
Функция УпорядоченныеСтрокиКУдалению(ВыделенныеСтроки) Экспорт
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ВыделенныеСтроки);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Возврат Список.ВыгрузитьЗначения();
	
КонецФункции

#КонецОбласти
