
#Область СлужебныйПрограммныйИнтерфейс

// Сбрасывает ключи доступа к сервису семантического анализа.
Процедура СброситьКлючиДоступаСервиса() Экспорт
	
	КлючиДоступа = РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.КлючиДоступа();
	КлючиДоступа.КлючДоступа = "";
	КлючиДоступа.КлючИзменения = "";
	РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.УстановитьКлючиДоступа(КлючиДоступа);
	
КонецПроцедуры

// Устанавливает видимость использования сервиса семантического анализа.
// 
// Параметры:
//  Элемент - ЭлементФормы - элемент формы или группа формы.
Процедура УстановитьВидимостьЭлементаФормы(Элемент) Экспорт
	
	Элемент.Видимость = ИспользоватьСервисСемантическогоАнализа();
	
КонецПроцедуры

// Определяет использовать ли сервис семантического анализа.
// 
// Возвращаемое значение: 
//  Булево - Истина, если сервис семантического анализа используется.
//
Функция ИспользоватьСервисСемантическогоАнализа() Экспорт
	
	ИспользоватьСервисСемантическогоАнализа =
		ПодборПерсонала.УстановленныеНастройки().ИспользоватьСервисСемантическогоАнализа;
		
	Возврат ИспользоватьСервисСемантическогоАнализа;
	
КонецФункции

// Запрос к сервису семантического анализа
//
// Параметры:
//  ТекстыРезюме - Массив - массив содержащий тексты резюме.
// 
// Возвращаемое значение:
//  Результат - Структура - см. ОписаниеРезультатаЗапросаКСервису().
//
Функция ЗапросКСервису(ТекстыРезюме) Экспорт
	
	Результат = ОписаниеРезультатаЗапросаКСервису();
	КоличествоРезюме = ТекстыРезюме.Количество();
	
	Попытка
		Соединение = HTTPСоединениеССервисом(КоличествоРезюме);
	Исключение
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = НСтр("ru = 'Невозможно соединиться с сервисом семантического анализа.'");
		Возврат Результат;
	КонецПопытки;
	
	КлючиДоступа = РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.КлючиДоступа();
	Если Не ЗначениеЗаполнено(КлючиДоступа.КлючДоступа) Тогда
		ПолучитьКлючиДоступа(Результат, КлючиДоступа, Соединение);
		Если ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	КлючДоступа = КлючиДоступа.КлючДоступа;
	
	Попытка
		ТелоЗапроса = РезюмеВJSON(ТекстыРезюме, КоличествоРезюме);
	Исключение
		Результат.ОписаниеОшибки = НСтр("ru = 'Невозможно сформировать текст резюме для сервиса семантического анализа.'");
		Возврат Результат;
	КонецПопытки;
	
	Заголовки = ЗаголовкиHTTPЗапроса(КлючДоступа);
	
	Попытка
		Ответ = HTTPЗапросКСервисуОтправить(Соединение, АдресРесурса(КоличествоРезюме), Заголовки, ТелоЗапроса);
	Исключение
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = ТекстОшибкиПолученияОтветаОтСервиса();
		Возврат Результат;
	КонецПопытки;
	
	Если Ответ.КодСостояния <> 202 Тогда
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = ТекстОшибкиОграниченияДоступаКСервису();
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Идентификатор = ДанныеИзJSON(Ответ);
	Исключение
		Результат.ОписаниеОшибки = ТекстОшибкиЧтенияДанныхОтСервиса();
		Возврат Результат;
	КонецПопытки;
	
	ПолучитьРезультатРаботыСервиса(Результат, Соединение, Идентификатор, Заголовки);
	
	Возврат Результат;
	
КонецФункции

// Заполнение структуры резюме результатами запроса к сервису семантического анализа
//
// Параметры:
//  Данные - Соответствие - соответствие с сущностями(ents) и фактами(facts).
//  ДанныеКандидатов - Структура - структура данных кандидатов.
//  ТекстыРезюме - Массив - массив содержащий тексты резюме.
//
Процедура ПрочитатьРезультатЗапроса(Данные, ДанныеКандидатов) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
		ЗаполнитьДанныеКандидатов(Данные, ДанныеКандидатов[0]);
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("Массив") Тогда
		НомерТекста = 0;
		Для Каждого ЭлементЗапроса Из Данные Цикл
			ЗаполнитьДанныеКандидатов(ЭлементЗапроса, ДанныеКандидатов[НомерТекста]);
			НомерТекста = НомерТекста + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПолучитьКлючиДоступа(Результат, КлючиДоступа, Соединение)
	
	Тикет = ТикетДляСервисаСемантическогоАнализа();
	Если Тикет = Неопределено Тогда
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = НСтр("ru = 'Интернет-поддержка пользователей недоступна.'");
		Возврат;
	КонецЕсли;
	
	Попытка
		ТелоЗапроса = ТикетВJSON(Тикет, КлючиДоступа.ИдентификаторПриложения);
	Исключение
		Результат.ОписаниеОшибки = ТекстОшибкиПолученияКлючаДоступа();
		Возврат;
	КонецПопытки;
	
	Заголовки = ЗаголовкиHTTPЗапроса();
	
	Попытка
		Ответ = HTTPЗапросКСервисуОтправить(Соединение, АдресРегистрацииПриложения(), Заголовки, ТелоЗапроса);
	Исключение
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = ТекстОшибкиПолученияКлючаДоступа();
		Возврат;
	КонецПопытки;
	
	Если Ответ.КодСостояния <> 200 Тогда
		Результат.ОшибкаСервиса = Истина;
		Результат.ОписаниеОшибки = ТекстОшибкиОграниченияДоступаКСервису();
		Возврат;
	КонецЕсли;
	
	Попытка
		Данные = ДанныеИзJSON(Ответ);
		КлючиДоступа.КлючДоступа = Данные.Получить("access_token");
		КлючиДоступа.КлючИзменения = Данные.Получить("refresh_token");
		КлючиДоступа.ИдентификаторПриложения = Данные.Получить("application_uuid");
		РегистрыСведений.КлючиДоступаСервисаСемантическогоАнализа.УстановитьКлючиДоступа(КлючиДоступа);
	Исключение
		Результат.ОписаниеОшибки = ТекстОшибкиПолученияКлючаДоступа();
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура ПрочитатьСущности(Сущности, Резюме)
	
	Если Сущности.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КонтактнаяИнформация = Новый Массив;
	ЗнаниеЯзыков = Новый Массив;
	СостояниеВБраке = Новый Массив;
	Гражданство = Новый Массив;
	ИспользуемыеСущности = ИспользуемыеСущности();
	Резюме.ВалютаДохода = ЗарплатаКадры.ВалютаУчетаЗаработнойПлаты();
	Резюме.ПериодичностьДохода = Перечисления.ПериодичностьОжидаемогоДоходаКандидатов.Месяц;
	
	Для Каждого Сущность Из Сущности Цикл
		Если ИспользуемыеСущности.Найти(Сущность["type"]) = Неопределено Тогда
			Продолжить;
		ИначеЕсли Сущность["type"] = "$ФИО" Тогда
			Если ЗначениеЗаполнено(Резюме.Фамилия) Тогда
				Продолжить;
			КонецЕсли;
			ФИО = Сущность["spec"]["$sys_persons"]["spec"];
			Резюме.Фамилия = ФИО["surname"];
			Резюме.Имя = ФИО["name"];
			Резюме.Отчество = ФИО["patronym"];
		ИначеЕсли Сущность["type"] = "$Ожидаемый_доход" Тогда
			Доход = Сущность["spec"]["$sys_money"]["spec"];
			Резюме.ОжидаемыйДоход = Число(Доход["amount"]);
			Резюме.ВалютаДохода = ВалютаПоЗнаку(Доход["currency"]);
		ИначеЕсли Сущность["type"] = "$Телефон" Тогда
			Если СтрДлина(Сущность["asis"]) < 10 Тогда
				Продолжить;
			КонецЕсли;
			ОписаниеКонтактнойИнформации = ОписаниеКонтактнойИнформации();
			ОписаниеКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			ОписаниеКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица;
			ОписаниеКонтактнойИнформации.Представление = Сущность["asis"];
			КонтактнаяИнформация.Добавить(ОписаниеКонтактнойИнформации);
		ИначеЕсли Сущность["type"] = "$АдресЭлПочты" Тогда
			ОписаниеКонтактнойИнформации = ОписаниеКонтактнойИнформации();
			ОписаниеКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			ОписаниеКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица;
			ОписаниеКонтактнойИнформации.Представление = Сущность["asis"];
			КонтактнаяИнформация.Добавить(ОписаниеКонтактнойИнформации);
		ИначеЕсли Сущность["type"] = "$МестоЖительства" Тогда
			ОписаниеКонтактнойИнформации = ОписаниеКонтактнойИнформации();
			ОписаниеКонтактнойИнформации.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			ОписаниеКонтактнойИнформации.Вид = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
			ОписаниеКонтактнойИнформации.Представление = Сущность["spec"].Получить("$sys_loc+")["asis"];
			КонтактнаяИнформация.Добавить(ОписаниеКонтактнойИнформации);
		ИначеЕсли Сущность["type"] = "$ДатаРождения" Тогда
			ДатаРожденияСтрока = Сущность["norm"]["$Дата"]["$sys_date"];
			ДатаРожденияСтрока = СтрЗаменить(ДатаРожденияСтрока , "-", "");
			Резюме.ДатаРождения = Дата(ДатаРожденияСтрока);
		ИначеЕсли Сущность["type"] = "$Пол" Тогда
			Резюме.Пол = Сущность["asis"];
		ИначеЕсли Сущность["type"] = "$СемейноеПоложение" Тогда
			СоответствиеСемейногоПоложения = РазборРезюме.СписокСоответствийСемейноеПоложение();
			СостояниеВБраке.Добавить(Новый Структура("СостояниеВБраке, Дата",
				СоответствиеСемейногоПоложения.Получить(НРег(Сущность["asis"]))));
		ИначеЕсли Сущность["type"] = "$Гражданство" Тогда
			Гражданство.Добавить(Новый Структура("Страна, Дата", Строка(Сущность["norm"]["$sys_loc"])));
		ИначеЕсли Сущность["type"] = "$ЯзыкКанд" Тогда
			ОписаниеЗнанияЯзыков = ОписаниеЗнанияЯзыков();
			ОписаниеЗнанияЯзыков.Язык = Сущность["norm"]["$Язык"]["$КонкретныйЯзык"];
			ОписаниеЗнанияЯзыков.СтепеньЗнанияЯзыка = СтепеньЗнанияЯзыка(Сущность["norm"]["$УровеньВладенияЯзыком"]);
			ОписаниеЗнанияЯзыков.Содержание = Сущность["asis"];
			ЗнаниеЯзыков.Добавить(ОписаниеЗнанияЯзыков);
		ИначеЕсли Сущность["type"] = "$Язык" Тогда
			ОписаниеЗнанияЯзыков = ОписаниеЗнанияЯзыков();
			ОписаниеЗнанияЯзыков.Язык = Сущность["norm"]["$КонкретныйЯзык"];
			ОписаниеЗнанияЯзыков.СтепеньЗнанияЯзыка = Справочники.СтепениЗнанияЯзыка.НайтиПоКоду(1);
			ОписаниеЗнанияЯзыков.Содержание = Сущность["asis"];
			ЗнаниеЯзыков.Добавить(ОписаниеЗнанияЯзыков);
		КонецЕсли;
	КонецЦикла;
	
	Резюме.КонтактнаяИнформация = КонтактнаяИнформация;
	Резюме.ЗнаниеЯзыков = ЗнаниеЯзыков;
	Резюме.СостояниеВБраке = СостояниеВБраке;
	Резюме.Гражданство = Гражданство;
	
КонецПроцедуры

Процедура ПрочитатьФакты(Факты, Резюме)
	
	Если Факты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОпытРаботы = Новый Массив;
	Образование = Новый Массив;
	
	Для Каждого Факт Из Факты Цикл
		Если Факт["type"] = "@РаботаОпыт2" Тогда
			ОписаниеОпытаРаботы = ОписаниеОпытаРаботы();
			ОписаниеОпытаРаботы.Период = Факт["$ПериодРаботы"][0]["asis"];
			Если Факт["$ПериодРаботы"][0]["norm"]["$sys_interval"][0] = Неопределено Тогда
				ОписаниеОпытаРаботы.ДатаНачала = 
					Факт["$ПериодРаботы"][0]["norm"]["$sys_interval"].Получить("start").Получить("date");
			Иначе
				ОписаниеОпытаРаботы.ДатаНачала = Факт["$ПериодРаботы"][0]["norm"]["$sys_interval"][0]["start"].Получить("date");
				ОписаниеОпытаРаботы.ДатаОкончания = Факт["$ПериодРаботы"][0]["norm"]["$sys_interval"][1]["start"].Получить("date");
			КонецЕсли;
			ОписаниеОпытаРаботы.Организация = Факт["$Организация"][0]["asis"]; 
			ОписаниеОпытаРаботы.Обязанности = Факт["free_strings"];
			ОпытРаботы.Добавить(ОписаниеОпытаРаботы);
		ИначеЕсли Факт["type"] = "@Образование" Тогда
			ОписаниеОбразования = ОписаниеОбразования();
			ОписаниеОбразования.ВидОбразования =
				Справочники.ВидыОбразованияФизическихЛиц.НайтиПоНаименованию(Факт["$УровеньОбразования"][0]["asis"]);
			ОписаниеОбразования.Окончание =
				РазборРезюме.СтрокаКакЧисло(Факт["$ДатаОкончания"][0]["spec"].Получить("$sys_interval")["asis"]);
			ОписаниеОбразования.УчебноеЗаведение = Факт["$ВУЗ"][0]["norm"].Получить("$sys_org");
			Если ТипЗнч(Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")) = Тип("Строка") Тогда
				ОписаниеОбразования.Факультет = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any");
			Иначе
				ОписаниеОбразования.Факультет = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")[0];
				ОписаниеОбразования.Специальность = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")[1];
			КонецЕсли;
			Образование.Добавить(ОписаниеОбразования);
		ИначеЕсли Факт["type"] = "@Образование2" Тогда
			ОписаниеОбразования = ОписаниеОбразования();
			ОписаниеОбразования.УчебноеЗаведение = Факт["$ОбразованиеПолное"][0]["norm"].Получить("$sys_org");
			ОписаниеОбразования.ВидОбразования = Справочники.ВидыОбразованияФизическихЛиц.НайтиПоНаименованию(
				Факт["$ОбразованиеПолное"][0]["norm"].Получить("$УровеньОбразования"));
			Если Факт["$ОбразованиеПолное"][0]["norm"].Получить("$sys_interval") <> Неопределено Тогда
				ОписаниеОбразования.Окончание =
					РазборРезюме.СтрокаКакЧисло(Факт["$ОбразованиеПолное"][0]["spec"].Получить("$sys_interval")["asis"]);
			ИначеЕсли Факт["$ОбразованиеПолное"][0]["norm"].Получить("$sys_number") <> Неопределено Тогда
				ОписаниеОбразования.Окончание = Число(Факт["$ОбразованиеПолное"][0]["norm"].Получить("$sys_number"));
			КонецЕсли;
			Образование.Добавить(ОписаниеОбразования);
		ИначеЕсли Факт["type"] = "@Образование3" Тогда
			ОписаниеОбразования = ОписаниеОбразования();
			ОписаниеОбразования.УчебноеЗаведение = Факт["$Организация"][0]["asis"];
			Если ТипЗнч(Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")) = Тип("Строка") Тогда
				ОписаниеОбразования.Факультет = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any");
			Иначе
				ОписаниеОбразования.Факультет = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")[0];
				ОписаниеОбразования.Специальность = Факт["$ФакультетИСпециальность"][0]["norm"].Получить("$sys_any")[1];
			КонецЕсли;
			Образование.Добавить(ОписаниеОбразования);
		Иначе
			ОписаниеОбразования = ОписаниеОбразования();
		КонецЕсли;
	КонецЦикла;
	
	Резюме.ТрудоваяДеятельность = ОпытРаботы;
	Резюме.Образование = Образование;
	
КонецПроцедуры

Процедура ПолучитьРезультатРаботыСервиса(Результат, Соединение, Идентификатор, Заголовки)
	
	ПараметрыОжидания = ПараметрыОжидания();
	ОжидатьРезультатРаботыСервиса = Истина;
	ТекущийПрогресс = 0;
	
	Пока ОжидатьРезультатРаботыСервиса Цикл
		Попытка
			Ответ = HTTPЗапросКСервисуПолучить(Соединение, АдресРезультатаРаботыСервиса(Идентификатор), Заголовки);
		Исключение
			Результат.ОшибкаСервиса = Истина;
			Результат.ОписаниеОшибки = ТекстОшибкиПолученияОтветаОтСервиса();
			Возврат;
		КонецПопытки;
		
		Если Ответ.КодСостояния = 200 Тогда
			ОжидатьРезультатРаботыСервиса = Ложь;
			Прервать;
		КонецЕсли;
		
		Если Ответ.КодСостояния <> 202 Тогда
			Результат.ОшибкаСервиса = Истина;
			Результат.ОписаниеОшибки = ТекстОшибкиПолученияОтветаОтСервиса();
			Возврат;
		КонецЕсли;
		
		УвеличитьТекущийПрогресс(ТекущийПрогресс);
		ДлительныеОперации.СообщитьПрогресс(ТекущийПрогресс, НСтр("ru = 'Получение результата работы сервиса'"));
		
		ОбщегоНазначенияБТС.Пауза(ПараметрыОжидания.ТекущееВремяОжидания);
		УвеличитьТекущееВремяОжидания(ПараметрыОжидания)
	КонецЦикла;
	
	Попытка
		ДанныеИзJSON = ДанныеИзJSON(Ответ);
		Результат.Данные = ДанныеИзJSON["result"];
	Исключение
		Результат.ОписаниеОшибки = ТекстОшибкиЧтенияДанныхОтСервиса();
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеКандидатов(ЭлементЗапроса, ДанныеКандидата)
	
	Сущности = ЭлементЗапроса.Получить("ents");
	ПрочитатьСущности(Сущности, ДанныеКандидата);
	
	Факты = ЭлементЗапроса.Получить("facts");
	ПрочитатьФакты(Факты, ДанныеКандидата);
	
КонецПроцедуры

Процедура УвеличитьТекущееВремяОжидания(ПараметрыОжидания)
	
	ПараметрыОжидания.ТекущееВремяОжидания =
		ПараметрыОжидания.ТекущееВремяОжидания * ПараметрыОжидания.КоэффициентУвеличенияВремениОжидания;
	
КонецПроцедуры

Процедура УвеличитьТекущийПрогресс(ТекущийПрогресс)
	
	МаксимальныйПрогресс = 100;
	ПрогрессНаОбработкуРезультата = 4;
	
	ТекущийПрогресс = Окр(ТекущийПрогресс + ((МаксимальныйПрогресс - ТекущийПрогресс) / ПрогрессНаОбработкуРезультата - 1));
	
КонецПроцедуры

Функция ТикетДляСервисаСемантическогоАнализа()
	
	ДанныеЗаполнены = Ложь;
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтернетПоддержкаПользователей = ОбщегоНазначения.ОбщийМодуль("ИнтернетПоддержкаПользователей");
		ДанныеЗаполнены = МодульИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
	КонецЕсли;
	
	Если Не ДанныеЗаполнены Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		УстановитьПривилегированныйРежим(Истина);
		СтруктураТикета = МодульИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки(Тариф());
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураТикета.КодОшибки) Тогда
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, СтруктураТикета.ИнформацияОбОшибке);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураТикета.Тикет;
	 
КонецФункции

Функция АдресРесурса(КоличествоРезюме)
	
	Если КоличествоРезюме > 1 Тогда
		Возврат "/parse_cv/process_several_texts?async=1";
	Иначе
		Возврат "/parse_cv/get_multi_facts_and_entities?async=1";
	КонецЕсли;
	
КонецФункции

Функция АдресРегистрацииПриложения()
	Возврат "/api/v1/auth/auth_by_its";
КонецФункции

Функция АдресРезультатаРаботыСервиса(UUID)
	Возврат СтрШаблон("/parse_cv/result/%1", UUID);
КонецФункции

Функция ИспользуемыеСущности()
	
	ИспользуемыеСущности = Новый Массив();
	ИспользуемыеСущности.Добавить("$ФИО");
	ИспользуемыеСущности.Добавить("$Ожидаемый_доход");
	ИспользуемыеСущности.Добавить("$Телефон");
	ИспользуемыеСущности.Добавить("$АдресЭлПочты");
	ИспользуемыеСущности.Добавить("$МестоЖительства");
	ИспользуемыеСущности.Добавить("$ДатаРождения");
	ИспользуемыеСущности.Добавить("$СемейноеПоложение");
	ИспользуемыеСущности.Добавить("$Гражданство");
	ИспользуемыеСущности.Добавить("$ЯзыкКанд");
	ИспользуемыеСущности.Добавить("$Язык");
	
	Возврат ИспользуемыеСущности;
	
КонецФункции

Функция ТикетВJSON(Тикет, ИдентификаторПриложения)
	
	ОбъектЗаписи = Новый Структура;
	ОбъектЗаписи.Вставить("ticket", Тикет);
	ОбъектЗаписи.Вставить("tariff", Тариф());
	
	Если ЗначениеЗаполнено(ИдентификаторПриложения) Тогда
		ОбъектЗаписи.Вставить("application_uuid", ИдентификаторПриложения);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("application_name", Метаданные.Имя);
	ДополнительныеПараметры.Вставить("application_version", Метаданные.Версия);
	
	ОбъектЗаписи.Вставить("scope", ДополнительныеПараметры);
	
	Возврат ЗаписьJSON(ОбъектЗаписи);
	
КонецФункции

Функция РезюмеВJSON(ТекстаРезюме, КоличествоРезюме)
	
	Если КоличествоРезюме > 1 Тогда
		ОбъектЗаписи = Новый Массив;
		ОбъектЗаписи.Добавить(ТекстаРезюме);
	Иначе
		ОбъектЗаписи = ТекстаРезюме[0];
	КонецЕсли;
	
	Возврат ЗаписьJSON(ОбъектЗаписи);
	
КонецФункции

Функция ЗаписьJSON(ОбъектЗаписи)
	
	ТелоЗапросаJSON = Неопределено;
	
	СтрокаJSON = Новый ЗаписьJSON;
	СтрокаJSON.УстановитьСтроку();
	Попытка
		ЗаписатьJSON(СтрокаJSON, ОбъектЗаписи);
		ТелоЗапросаJSON = СтрокаJSON.Закрыть();
	Исключение
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат ТелоЗапросаJSON;
	
КонецФункции

Функция HTTPСоединениеССервисом(КоличествоРезюме)
	
	Соединение = Неопределено;
	Прокси = Неопределено;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		Прокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	КонецЕсли;
	
	Таймаут = 600 * КоличествоРезюме;
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	
	Попытка
		Соединение = Новый HTTPСоединение("tagger.1c.ai",,,, Прокси, Таймаут, ЗащищенноеСоединение);
	Исключение
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции

Функция HTTPЗапросКСервисуПолучить(Соединение, Адрес, Заголовки)
	
	Ответ = Неопределено;
		
	HTTPЗапрос = Новый HTTPЗапрос(Адрес, Заголовки);
	
	Попытка
		Ответ = Соединение.Получить(HTTPЗапрос);
	Исключение
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция HTTPЗапросКСервисуОтправить(Соединение, Адрес, Заголовки, ТелоЗапроса)
	
	Ответ = Неопределено;
		
	HTTPЗапрос = Новый HTTPЗапрос(Адрес, Заголовки);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ЗаголовкиHTTPЗапроса(КлючДоступа = Неопределено)
	
	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Charset", "utf-8");
	Если КлючДоступа <> Неопределено Тогда
		Заголовки.Вставить("X-AUTH-APP", КлючДоступа);
	КонецЕсли;
	
	Возврат Заголовки;
	
КонецФункции

Функция ДанныеИзJSON(Ответ)
	
	Данные = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	Попытка
		Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
	Исключение
		ИмяСобытия = НСтр("ru = 'Разбор резюме.Сервис семантического анализа'", ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Данные;
	
КонецФункции

Функция ОписаниеРезультатаЗапросаКСервису()
	
	Описание = Новый Структура();
	Описание.Вставить("Данные", Неопределено);
	Описание.Вставить("ОшибкаСервиса", Ложь);
	Описание.Вставить("ОписаниеОшибки", "");
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеКонтактнойИнформации()
	
	Описание = Новый Структура(
		"Тип,
		|Вид,
		|Представление");
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеЗнанияЯзыков()
	
	Описание = Новый Структура(
		"Язык,
		|СтепеньЗнанияЯзыка,
		|Содержание");
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеОпытаРаботы()
	
	Описание = Новый Структура(
		"Период,
		|ДатаНачала,
		|ДатаОкончания,
		|Организация,
		|Должность,
		|Обязанности,
		|СфераДеятельностиКомпании");
	
	Возврат Описание;
	
КонецФункции

Функция ОписаниеОбразования()
	
	Описание = Новый Структура(
		"ВидОбразования,
		|Окончание,
		|УчебноеЗаведение,
		|Специальность,
		|Факультет");
	
	Возврат Описание;
	
КонецФункции

Функция СтепеньЗнанияЯзыка(СтепеньЗнания)
	
	Результат = Справочники.СтепениЗнанияЯзыка.НайтиПоКоду(1);
	СтепеньЗнания = НРег(СокрЛП(СтепеньЗнания));
	
	Если ХорошаяСтепеньЗнанияЯзыка().Найти(СтепеньЗнания) <> Неопределено Тогда
		Результат = Справочники.СтепениЗнанияЯзыка.НайтиПоКоду(2);
	КонецЕсли;
	
	Если ОтличнаяСтепеньЗнанияЯзыка().Найти(СтепеньЗнания) <> Неопределено Тогда
		Результат = Справочники.СтепениЗнанияЯзыка.НайтиПоКоду(3);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ХорошаяСтепеньЗнанияЯзыка()
	
	СтепеньЗнания = Новый Массив();
	СтепеньЗнания.Добавить("intermediate");
	СтепеньЗнания.Добавить("uper-intermediate");
	СтепеньЗнания.Добавить("средний");
	СтепеньЗнания.Добавить("разговорный");
	СтепеньЗнания.Добавить("могу проходить интервью");
	СтепеньЗнания.Добавить("b2");
	СтепеньЗнания.Добавить("b1");
	
	Возврат СтепеньЗнания;
	
КонецФункции

Функция ОтличнаяСтепеньЗнанияЯзыка()
	
	СтепеньЗнания = Новый Массив();
	СтепеньЗнания.Добавить("advanced");
	СтепеньЗнания.Добавить("proficiency");
	СтепеньЗнания.Добавить("fluency");
	СтепеньЗнания.Добавить("родной");
	СтепеньЗнания.Добавить("свободно владею");
	СтепеньЗнания.Добавить("в совершенстве");
	СтепеньЗнания.Добавить("продвинутый");
	СтепеньЗнания.Добавить("c2");
	СтепеньЗнания.Добавить("c1");
	
	Возврат СтепеньЗнания;
	
КонецФункции

Функция ВалютаПоЗнаку(ЗнакВалюты)
	
	Если ЗнакВалюты = "$" Тогда
		КодВалюты = "840";
	ИначеЕсли ЗнакВалюты = "€" Тогда
		КодВалюты = "978";
	Иначе
		КодВалюты = "643";
	КонецЕсли;
	
	Валюта = Справочники.Валюты.НайтиПоКоду(КодВалюты);
	
	Возврат Валюта;
	
КонецФункции

Функция Тариф()
	Возврат "TAGGER_CV_PARSING";
КонецФункции

Функция ПараметрыОжидания()
	
	ПараметрыОжидания = Новый Структура;
	ПараметрыОжидания.Вставить("ТекущееВремяОжидания", 1);
	ПараметрыОжидания.Вставить("КоэффициентУвеличенияВремениОжидания", 1.4);
	
	Возврат ПараметрыОжидания;
	
КонецФункции

Функция ТекстОшибкиПолученияКлючаДоступа()
	Возврат НСтр("ru = 'Не удалось получить ключ доступа для сервиса семантического анализа.'");
КонецФункции

Функция ТекстОшибкиПолученияОтветаОтСервиса()
	Возврат НСтр("ru = 'Невозможно получить ответ от сервиса семантического анализа.'");
КонецФункции

Функция ТекстОшибкиЧтенияДанныхОтСервиса()
	Возврат НСтр("ru = 'Невозможно прочитать данные, полученные от сервиса семантического анализа.'");
КонецФункции

Функция ТекстОшибкиОграниченияДоступаКСервису()
	Возврат НСтр("ru = 'Доступ к сервису семантического анализа ограничен.'");
КонецФункции

#КонецОбласти