#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОткрытаНастройкаПубликации") Тогда
		ОткрытаНастройкаПубликации = Параметры.ОткрытаНастройкаПубликации;
	КонецЕсли;
	
	Если Параметры.Свойство("Настройки") Тогда
		Настройки = Параметры.Настройки;
		НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = Настройки.ВидТранспорта;
		НаборКонстант.ИнтеграцияС1САрхивомКаталог = Настройки.Каталог;
		НаборКонстант.ИнтеграцияС1САрхивомАдресFTP = Настройки.АдресFTP;
		НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP = Настройки.ПользовательFTP;
		НаборКонстант.ИнтеграцияС1САрхивомПортFTP = Настройки.ПортFTP;
		НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP = Настройки.ПассивныйРежимFTP;
		НаборКонстант.АдресПубликации1САрхива = Настройки.АдресHTTP;
		НаборКонстант.ИмяПользователя1САрхива = Настройки.ПользовательHTTP;
		ПарольПользователяFTPСервера = Настройки.ПарольFTP;
		ПарольПользователяВебСервиса = Настройки.ПарольHTTP;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомПортFTP) Тогда
		НаборКонстант.ИнтеграцияС1САрхивомПортFTP = 21;
		НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP = Истина;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЭтоСерверWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
	Если ЭтоСерверWindows Тогда
		Элементы.ИнтеграцияС1САрхивомКаталог.ПодсказкаВвода = "\\Servername\ExchangeFolder\";
	Иначе
		Элементы.ИнтеграцияС1САрхивомКаталог.ПодсказкаВвода = "/mnt/ExchangeFolder/";
	КонецЕсли;
	
	// Временно недоступная функциональность.
	Элементы.ГруппаHTTPКарточка.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьНастройки(, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьНастроек(ОткрытаНастройкаПубликации);
	УстановитьЗаголовок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИнтеграцияС1САрхивомКаталогОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомКаталог) Тогда
		ФайловаяСистемаКлиент.ОткрытьПроводник(НаборКонстант.ИнтеграцияС1САрхивомКаталог);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтеграцияС1САрхивомКаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИнтеграцияС1САрхивомКаталогПродолжениеВыбора", ЭтотОбъект);
	ФайловаяСистемаКлиент.ВыбратьКаталог(ОписаниеОповещения, НСтр("ru = 'Выберите каталог'"),
		НаборКонстант.ИнтеграцияС1САрхивомКаталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбщийCетевойКаталогКартинкаНажатие(Элемент)
	
	НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог");
	
КонецПроцедуры

&НаКлиенте
Процедура FTPСерверКартинкаНажатие(Элемент)
	
	НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер");
	
КонецПроцедуры

&НаКлиенте
Процедура HTTPКартинкаНажатие(Элемент)
	
	НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.HTTP");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаДалее(Команда)

	Если Не ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта) Тогда
		ТекстОшибки = НСтр("ru = 'Выберите один из способов обмена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,,, "Объект.ВидТранспорта");
		Возврат;
	КонецЕсли;
	
	УстановитьВидимостьНастроек(Истина);
	УстановитьЗаголовок();

КонецПроцедуры

&НаКлиенте
Процедура КомандаНазад(Команда)
	
	УстановитьВидимостьНастроек(Ложь);
	УстановитьЗаголовок();

КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(НастройкиТранспорта());
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ТекстПредупреждения = "";
	ПроверитьНастройки(ТекстПредупреждения);
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция НастройкиТранспорта()
	
	Настройки = Новый Структура;
	Настройки.Вставить("ВидТранспорта", НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта);
	Настройки.Вставить("Каталог", НаборКонстант.ИнтеграцияС1САрхивомКаталог);
	Настройки.Вставить("АдресFTP", НаборКонстант.ИнтеграцияС1САрхивомАдресFTP);
	Настройки.Вставить("ПользовательFTP", НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP);
	Настройки.Вставить("ПортFTP", НаборКонстант.ИнтеграцияС1САрхивомПортFTP);
	Настройки.Вставить("ПассивныйРежимFTP", НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP);
	Настройки.Вставить("АдресHTTP", НаборКонстант.АдресПубликации1САрхива);
	Настройки.Вставить("ПользовательHTTP", НаборКонстант.ИмяПользователя1САрхива);
	Настройки.Вставить("ПарольFTP", ПарольПользователяFTPСервера);
	Настройки.Вставить("ПарольHTTP", ПарольПользователяВебСервиса);
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьНастроек(ВидимостьГруппыНастроек)
	
	ВидыТранспортаКаталог = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог");
	ВидыТранспортаFTP = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер");
	ВидыТранспортаHTTP = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.HTTP");
	
	Элементы.ГруппаТранспорт.Видимость = Не ВидимостьГруппыНастроек;
	Элементы.ГруппаНастроекТранспорта.Видимость = ВидимостьГруппыНастроек;
	
	Если ВидимостьГруппыНастроек Тогда
		
		Элементы.ГруппаПараметрыКаталога.Видимость =
			НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаКаталог И Не ОткрытаНастройкаПубликации;
		Элементы.ГруппаПараметрыПодключенияFTP.Видимость =
			НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаFTP И Не ОткрытаНастройкаПубликации;
		Элементы.ГруппаПараметрыHTTP.Видимость =
			НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаHTTP Или ОткрытаНастройкаПубликации;
		
		Элементы.ПроверитьПодключение.Видимость = Не Элементы.ГруппаПараметрыКаталога.Видимость;
		Элементы.Отступ.Видимость = Элементы.ГруппаПараметрыКаталога.Видимость;
		
	КонецЕсли;
			
	Если Элементы.ГруппаТранспорт.Видимость Тогда
		Элементы.КомандаДалее.КнопкаПоУмолчанию = Истина;
	ИначеЕсли Элементы.ГруппаНастроекТранспорта.Видимость Тогда
		Элементы.КомандаГотовоНастройки.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
	Элементы.КомандаНазад.Видимость = Не ОткрытаНастройкаПубликации;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовок()
	
	ВидыТранспортаКаталог = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.ОбщийКаталог");
	ВидыТранспортаFTP = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.FTPСервер");
	ВидыТранспортаHTTP = ПредопределенноеЗначение("Перечисление.ВидыТранспортаДляОбменаС1САрхивом.HTTP");
	
	Если ОткрытаНастройкаПубликации Тогда
		Заголовок = НСтр("ru = 'Публикация 1С:Архива'");
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаКаталог Тогда
		Заголовок = НСтр("ru = 'Общий сетевой каталог'");
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаFTP Тогда
		Заголовок = НСтр("ru = 'Каталог на FTP-сервере'");
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспортаHTTP Тогда
		Заголовок = НСтр("ru = 'HTTP-сервис'");
	Иначе
		Заголовок = НСтр("ru = 'Не выбран вид транспорта обмена'");
	КонецЕсли;
	
	Если Элементы.ГруппаТранспорт.Видимость Тогда
		Заголовок = НСтр("ru = 'Вид транспорта'");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройки(ТекстПредупреждения = "", Отказ = Ложь)
	
	Если Не ЗначениеЗаполнено(НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта) Тогда
		ТекстОшибки = НСтр("ru = 'Не выбран ни один из способов обмена'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "ВидТранспорта", Отказ);
	КонецЕсли;
	
	ВидыТранспорта = Перечисления.ВидыТранспортаДляОбменаС1САрхивом;
	
	Если ОткрытаНастройкаПубликации Или НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.HTTP Тогда
		
		ЕстьНезаполненныеНастройки = Ложь;
		Если Не ЗначениеЗаполнено(НаборКонстант.АдресПубликации1САрхива) Тогда
			ЕстьНезаполненныеНастройки = Истина;
			ТекстОшибки = НСтр("ru = 'Не указан адрес публикации'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.АдресПубликации1САрхива", Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаборКонстант.ИмяПользователя1САрхива) Тогда
			ЕстьНезаполненныеНастройки = Истина;
			ТекстОшибки = НСтр("ru = 'Не указано имя пользователя'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИмяПользователя1САрхива", Отказ);
		КонецЕсли;
		
		Если ЕстьНезаполненныеНастройки Тогда
			Возврат;
		КонецЕсли;
		
		Попытка
			АдресПубликации = НаборКонстант.АдресПубликации1САрхива;
			ИмяПользователя = НаборКонстант.ИмяПользователя1САрхива;
			Таймаут = 10;
			ИнтернетПрокси = Неопределено;
			Определение = Новый WSОпределения(АдресПубликации + "/ws/ArchiveDocuments.1cws?wsdl",
				ИмяПользователя, ПарольПользователяВебСервиса, ИнтернетПрокси, Таймаут);
			Прокси = Новый WSПрокси(Определение, "http://www.1c.ru/docmng", "ArchiveDocuments", "ArchiveDocumentsSoap",
				ИнтернетПрокси, Таймаут);
			ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
		Исключение
			ТекстОшибки = НСтр("ru = 'Подключение не выполнено. Проверьте адрес, имя пользователя и пароль.'")
				+ Символы.ПС + Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.АдресПубликации1САрхива", Отказ);
		КонецПопытки;
		
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.ОбщийКаталог Тогда
		
		ЕстьОшибкиКаталогаОбмена = Ложь;
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ЭтоСерверWindows = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 
			Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64;
		
		КаталогИнтеграции = НаборКонстант.ИнтеграцияС1САрхивомКаталог;
		Если Не ЗначениеЗаполнено(КаталогИнтеграции) Тогда
			ЕстьОшибкиКаталогаОбмена = Истина;
			ТекстОшибки = НСтр("ru = 'Не указан каталог обмена.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
		ИначеЕсли ЭтоСерверWindows 
			И (Лев(КаталогИнтеграции, 2) <> "\\"
				Или СтрНайти(КаталогИнтеграции, ":") <> 0) Тогда
			ЕстьОшибкиКаталогаОбмена = Истина;
			ТекстОшибки = НСтр("ru = 'Каталог обмена должен быть указан в формате UNC (\\Servername\Resource).'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
		КонецЕсли;
		
		Если Не ЕстьОшибкиКаталогаОбмена Тогда
			КаталогИнтеграцииФайл = Новый Файл(КаталогИнтеграции);
			Если Не КаталогИнтеграцииФайл.Существует() Тогда
				ТекстОшибки = НСтр("ru = 'Каталог не обнаружен'");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомКаталог", Отказ);
			Иначе
				ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта = ВидыТранспорта.FTPСервер Тогда
		
		ПараметрыFTP = ОбменСАрхивомТранспорт.НовыеПараметрыПодключенияFTP();
		ПараметрыFTP.КаталогFTP = НаборКонстант.ИнтеграцияС1САрхивомАдресFTP;
		ПараметрыFTP.Логин = НаборКонстант.ИнтеграцияС1САрхивомПользовательFTP;
		ПараметрыFTP.Пароль = ПарольПользователяFTPСервера;
		ПараметрыFTP.Порт = НаборКонстант.ИнтеграцияС1САрхивомПортFTP;
		ПараметрыFTP.ПассивноеСоединение = НаборКонстант.ИнтеграцияС1САрхивомПассивныйРежимFTP;
		
		ТекстОшибки = ОбменСАрхивомТранспорт.ПроверитьОбменЧерезFTP(ПараметрыFTP);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомАдресFTP", Отказ);
		Иначе
			ТекстПредупреждения = НСтр("ru = 'Подключение выполнено'");
		КонецЕсли;
		
	Иначе	
		
		ТекстОшибки = НСтр("ru = 'Настройте один из способов обмена'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,, "НаборКонстант.ИнтеграцияС1САрхивомВидТранспорта", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтеграцияС1САрхивомКаталогПродолжениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПапки = Результат;
	РазделительПути = ПолучитьРазделительПути();
	ИмяПапки = ИмяПапки + ?(Прав(ИмяПапки, 1) = РазделительПути, "", РазделительПути);
	
	НаборКонстант.ИнтеграцияС1САрхивомКаталог = ИмяПапки;
	
КонецПроцедуры

#КонецОбласти
