#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИндивидуальнаяОценка");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Отчет отображает индивидуальные результаты сотрудника в результате проведения опроса по компетенциям (для HR)'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ИндивидуальнаяОценкаДляСотрудника");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Отчет отображает индивидуальные результаты сотрудника в результате проведения опроса по компетенциям (для сотрудника)'");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыОпросаПоКомпетенциям");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Отчет отображает результат группового опроса по компетенциям.'");

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти
	
#КонецЕсли