
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик формирования строки наименования позиции штатного расписания.
//
Процедура ПриЗаполненииНаименованияПозицииШтатногоРасписания(Форма, СтандартнаяОбработка) Экспорт
	
	Если Форма.Элементы.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение) Тогда
		// Если управленческое подразделение не заполнено, сохраняем прежний порядок именования позиции.
		Возврат;
	КонецЕсли;
	
	Если Не Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Объект = Форма.Объект; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация", Объект.Владелец);
	ДополнительныеПараметры.Вставить("МестоВСтруктуреПредприятия", Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение);
	
	НаименованиеПозицииШтатногоРасписания = УправлениеШтатнымРасписаниемКлиентСервер.НаименованиеПозицииШтатногоРасписания(
		Объект.Подразделение, 
		Объект.Должность, 
		ДополнительныеПараметры);
	
	Объект.Наименование = НаименованиеПозицииШтатногоРасписания.Наименование;
	Объект.НаименованиеПолное = НаименованиеПозицииШтатногоРасписания.НаименованиеПолное;

КонецПроцедуры

Процедура ОбработкаОповещенияФормыМестоПозицииВСтруктуреПредприятия(Форма, ИмяСобытия, Параметр, Источник) Экспорт

	Элемент = Форма.Элементы.Найти("МестоВСтруктуреПредприятия");
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ИмяСобытия = "ОтредактированаИстория" И Параметр.ИмяРегистра = "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
		И Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятияНаборЗаписейПрочитан Тогда

		ПозицияСсылка = ?(Форма.ВнешниеДанные, Форма.РедактируемаяПозиция,
			Форма.СсылкаНаОбъект);

		РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(Форма, ПозицияСсылка, ИмяСобытия,
			Параметр, Источник);
		РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма,
			"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПозицияСсылка);

		ЗначениеВладелец = Форма.ВладелецФормы;
		ЗначениеЗакрыватьПриВыборе = Форма.ЗакрыватьПриВыборе;
		
		Форма.ВладелецФормы = Элемент;
		Форма.ЗакрыватьПриВыборе = Ложь;
		Форма.ОповеститьОВыборе(Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятия.Подразделение);
		
		Форма.ВладелецФормы = ЗначениеВладелец;
		Форма.ЗакрыватьПриВыборе = ЗначениеЗакрыватьПриВыборе;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаОповещенияФормыСпискаМестоПозицииВСтруктуреПредприятия(Форма, ИмяСобытия, Параметр, Источник) Экспорт

	Если Форма.Элементы.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ИмяСобытия = "ОтредактированаИстория" И Параметр.ИмяРегистра = "МестоПозицииШтатногоРасписанияВСтруктуреПредприятия"
		И Форма.МестоПозицииШтатногоРасписанияВСтруктуреПредприятияНаборЗаписейПрочитан Тогда

		ПозицияСсылка = ?(Форма.ВнешниеДанные, Форма.РедактируемаяПозиция,
			Форма.СсылкаНаОбъект);

		РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(Форма, ПозицияСсылка, ИмяСобытия,
			Параметр, Источник);
		РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(Форма,
			"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПозицияСсылка);

	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьИсториюИзмененияМестаПозицииВСтруктуреПредприятия(Форма, ПозицияСсылка) Экспорт

	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию(
		"МестоПозицииШтатногоРасписанияВСтруктуреПредприятия", ПозицияСсылка, Форма,
		Форма.ТолькоПросмотр
		Или Не Форма.Доступность
		Или Форма.РедактированиеМестаВСтруктуреПредприятияЗапрещено);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыбратьУправленческуюПозициюИзСписка(Форма, АдресСпискаПодобранных) Экспорт 
	
	УправленческаяОрганизация = ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("Владелец", УправленческаяОрганизация);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбор);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("СкрытьПанельВводаДокументов", Истина);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранных);
	
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаВыбора", ПараметрыОткрытия, Форма.Элементы.Позиции);
	
КонецПроцедуры

Процедура СписокСотрудниковПоОрганизационнойСтруктуре(Форма) Экспорт
	
	ЭлементыФормаПоОрганизационнойСтруктуре = Форма.Элементы.Найти("ФормаПоОрганизационнойСтруктуре");
	Если ЭлементыФормаПоОрганизационнойСтруктуре <> Неопределено
		И Не ЭлементыФормаПоОрганизационнойСтруктуре.Пометка Тогда
		
		ЭлементыФормаПоОрганизационнойСтруктуре.Пометка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьСписокОрганизационнойСтруктуры(Форма) Экспорт
	
	ЭлементыФормаПоОрганизационнойСтруктуре = Форма.Элементы.Найти("ФормаПоОрганизационнойСтруктуре");
	Если ЭлементыФормаПоОрганизационнойСтруктуре <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКонтекстноеМенюРежимПросмотра",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКонтекстноеМенюРежимПросмотра",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКонтекстноеМенюДерево",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКонтекстноеМенюИерархическийСписок",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКонтекстноеМенюСписок",
			"Видимость",
			Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы,
			"ОрганизационнаяСтруктураКоманднаяПанель",
			"Видимость",
			Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СписокСотрудниковОрганизационнаяСтруктураПриАктивизацииСтроки(Форма) Экспорт
	
	ЭлементыФормаПоОрганизационнойСтруктуре = Форма.Элементы.Найти("ФормаПоОрганизационнойСтруктуре");
	Если ЭлементыФормаПоОрганизационнойСтруктуре <> Неопределено Тогда
		
		Если ЭлементыФормаПоОрганизационнойСтруктуре.Пометка
			И Форма.Элементы.ОрганизационнаяСтруктура.ВыделенныеСтроки.Количество() > 0 Тогда
			
			ОтборПоОрганизационнойСтруктуре = Неопределено;
			ОтборыПоОрганизационнойСтруктуре = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
				Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				,
				"ОтборПоОрганизационнойСтруктуре");
			
			Если ОтборыПоОрганизационнойСтруктуре.Количество() > 0 Тогда
				
				ОтборПоОрганизационнойСтруктуре = ОтборыПоОрганизационнойСтруктуре[0];
				ОтборПоОрганизационнойСтруктуре.Элементы.Очистить();
				
			Иначе
				
				ОтборПоОрганизационнойСтруктуре = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
					Форма.Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы, "ОтборПоОрганизационнойСтруктуре", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
				
			КонецЕсли;
			
			ВыделенныеОрганизационныеСтруктуры = Новый Массив;
			Для каждого ВыделеннаяСтрока Из Форма.Элементы.ОрганизационнаяСтруктура.ВыделенныеСтроки Цикл
				ВыделенныеОрганизационныеСтруктуры.Добавить(ВыделеннаяСтрока);
			КонецЦикла;
			
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				ОтборПоОрганизационнойСтруктуре, "МестоВСтруктуреПредприятия", ВыделенныеОрганизационныеСтруктуры, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии);
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(
				Форма.Список, , "ОтборПоОрганизационнойСтруктуре");
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
