////////////////////////////////////////////////////////////////////////////////
// ПрограммныйИнтерфейсСервиса: выполнение штатных функций МС прикладным кодом
// через внешний API 
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Возвращает свойства версии программного интерфейса менеджера сервиса.
// 
// Возвращаемое значение:
//  Структура - свойства версии внешнего программного интерфейса:
//   * Версия - Число - номер версии внешнего программного интерфейса.
//   * ВерсияМенеджераСервиса - Строка - номер версии менеджера сервиса.
//   * ЧасовойПоясМенеджераСервиса - Строка - часовой пояс менеджера сервиса.
//   * ВнешнийАдресМенеджераСервиса - Строка
//
Функция СвойстваВерсииИнтерфейса() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваВерсииИнтерфейса();

КонецФункции

// Возвращает действующий токен доступа пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - если не указан, используется текущий пользователь.
//  ВызыватьИсключениеПриОшибке - Булево - по умолчанию = Истина
//  СвойстваОтвета - Структура - возвращаемый параметр:
//   * Ошибка - Булево - ошибка при получении токена
//   * Сообщение - Строка - сообщение об ошибке.
//   * ВремяЖизни - Дата - Срок действия токена.
// 
// Возвращаемое значение:
//  Строка - токен доступа.
//  
Функция ДействующийТокенДоступа(Пользователь = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	СвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДействующийТокенДоступа(Пользователь, ВызыватьИсключениеПриОшибке,
		СвойстваОтвета);

КонецФункции

// Получает новый токен доступа пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - если не указан, используется текущий пользователь.
//  ВызыватьИсключениеПриОшибке - Булево
// 
// Возвращаемое значение:
//  Структура - данные нового токена доступа:
//   * ТокенДоступа - Строка - если токен получен успешно
//                  - Неопределено - если при получении токена произошла ошибка
//   * ВремяЖизни - Дата - время жизни токена доступа
//   * Ошибка - Булево - ошибка при получении токена
//   * Сообщение - Строка - сообщение об ошибке 
Функция НовыйТокенДоступа(Пользователь = Неопределено, ВызыватьИсключениеПриОшибке = Истина) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйТокенДоступа(Пользователь, ВызыватьИсключениеПриОшибке);

КонецФункции

// Версия http сервиса ExtAPI менеджера сервиса, полученная через механизм версий интерфейсов БСП.
// 
// Возвращаемое значение:
//  Число, Неопределено - Версия ExtAPI. Неопределено возвращается в случае, когда подключение к Менеджеру сервиса не настроено
Функция ВерсияExtAPIМенеджераСервиса() Экспорт
	
	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ВерсияExtAPIМенеджераСервиса();
		
КонецФункции

// Возвращает часовой пояс менеджера сервиса.
// 
// Возвращаемое значение:
//  Строка - часовой пояс менеджера сервиса.
//
Функция ЧасовойПоясМенеджераСервиса() Экспорт
	
	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ЧасовойПоясМенеджераСервиса();
	
КонецФункции

// Возвращает внешний адрес менеджера сервиса
// 
// Возвращаемое значение:
//  Строка - внешний адрес менеджера сервиса.
//
Функция ВнешнийАдресМенеджераСервиса() Экспорт
	
	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ВнешнийАдресМенеджераСервиса();
	
КонецФункции

#Область Account

// Возвращает список абонентов текущего пользователя.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список абонентов:
//    * Наименование - Строка - наименование абонента
//    * Код - Число - код абонента
//    * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роль текущего пользователя абонента.
//
Функция Абоненты() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.Абоненты();

КонецФункции

// Возвращает дополнительные сведения (реквизиты и свойства) абонента этого приложения.
// Реализует метод внешнего программного интерфейса - account/attached_info.
// 
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - дополнительные реквизиты и свойства абонента:
//   * ПубличныйИдентификатор - Строка - публичный идентификатор абонента
//   * Реквизиты - ТаблицаЗначений - дополнительные реквизиты абонента:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения 
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//   * Свойства - ТаблицаЗначений - дополнительные свойства абонента:
//     ** Ключ - Строка - имя дополнительного свойства
//     ** Тип - Строка - тип значения
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного свойства
//
Функция ДополнительныеСведенияАбонента(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДополнительныеСведенияАбонента(ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Обновляет дополнительные сведения (реквизиты и свойства) абонента.
// Реализует метод внешнего программного интерфейса - account/update_attached_info.
//
// Параметры:
//  ДопСведения - см. НовыйДопСведенияАбонента
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Булево - установка доп. сведений: Истина - установлено, Ложь - произошла ошибка.
//
Функция ОбновитьДопСведенияАбонента(ДопСведения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбновитьДопСведенияАбонента(ДопСведения, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает дополнительные сведения (реквизиты и свойства) указанного абонента,
// необходимые для оформления платной подписки.
// Реализует метод внешнего программного интерфейса - account/attached_info_for_subscribing
//
// Параметры:
//  КодАбонента - Число - код абонента, для которого нужно получить доп. сведения.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - дополнительные реквизиты и свойства абонента:
//   * ЕстьОшибки - Булево - признак наличия ошибок заполнения.
//   * Реквизиты - ТаблицаЗначений - дополнительные реквизиты абонента:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Заголовок - Строка - заголовок дополнительного реквизита
//     ** Тип - Строка - тип значения 
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//     ** ЗаполнятьОбязательно - Булево - признак обязательности заполнения
//     ** Подсказка - Строка - подсказка заполнения
//     ** Ошибка - Булево - признак ошибки заполнения
//     ** Сообщение - Строка - сообщение об ошибке.
//   * Свойства - ТаблицаЗначений - дополнительные свойства абонента:
//     ** Ключ - Строка - имя дополнительного свойства
//     ** Заголовок - Строка - заголовок дополнительного реквизита
//     ** Тип - Строка - тип значения
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного свойства
//     ** ЗаполнятьОбязательно - Булево - признак признак обязательности заполнения
//     ** Подсказка - Строка - подсказка заполнения
//     ** Ошибка - Булево - признак ошибки заполнения
//     ** Сообщение - Строка - сообщение об ошибке.
//
Функция ОбязательныеСведенияДляОформленияПодписки(КодАбонента, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбязательныеСведенияДляОформленияПодписки(КодАбонента,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает значения дополнительного сведения.
// 
// Параметры:
//  ИмяСведения - Строка - имя сведения, для которого нужно получить значения.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - значения дополнительного сведения:
//   * Наименование - Строка - длина 100
//   * Вес - Число - точность 10,2  
Функция ЗначенияДополнительногоСведения(ИмяСведения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ЗначенияДополнительногоСведения(ИмяСведения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает код абонента текущего приложения
// 
// Возвращаемое значение:
//  Число - Код абонента
Функция КодАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.КодАбонента();

КонецФункции

#КонецОбласти

#Область Account_Users

// Возвращает список пользователей абонента этого приложения.
// Реализует метод внешнего программного интерфейса - account/users/list.
// 
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
//  Возвращаемое значение:
//  ТаблицаЗначений - пользователи абонента:
//   * Логин - Строка - логин (имя) пользователя
//   * ПолноеИмя - Строка - полное имя пользователя
//   * Почта - Строка - электронная почта пользователя
//   * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роль пользователя
//   * РазрешенноеКоличествоСеансов - Число - разрешенное количество сеансов
//   * ВременныйДоступ - Булево - временный доступ
//
Функция ПользователиАбонента(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПользователиАбонента(ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства пользователя абонента по логину.
// Реализует метод внешнего программного интерфейса - account/users/info.
// Параметры:
//  Логин - Строка - Логин (Имя) пользователя.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - свойства пользователя абонента:
//   * Логин - Строка - логин (имя) пользователя
//   * ПолноеИмя - Строка - полное имя пользователя
//   * Почта - Строка - электронная почта пользователя
//   * Телефон - Строка - телефон пользователя
//   * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роли пользователя
//   * РазрешенноеКоличествоСеансов - Число - разрешенное количество сеансов
//   * ВременныйДоступ - Булево - временный доступ
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Заголовок - Строка - заголовок дополнительного реквизита
//     ** Тип - Строка - тип значения 
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
Функция СвойстваПользователяАбонента(Логин, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваПользователяАбонента(Логин, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Создает новую учетную запись пользователя сервиса и подключает созданного пользователя к абоненту этого приложения. 
//
// Параметры:
//  ПараметрыСоздания - см. НовыйПараметрыСозданияПользователя
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - признак добавления пользователя Истина - пользователь добавлен, Ложь - произошла ошибка.
//
Функция СоздатьПользователяАбонента(ПараметрыСоздания, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПользователяАбонента(ПараметрыСоздания,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Добавляет существующего пользователя сервиса к абоненту этого приложения. 
//
// Параметры:
//  ПараметрыДобавления - см. НовыйПараметрыДобавленияПользователя
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - признак создания учетной записи Истина - создана, Ложь - произошла ошибка.
//
Функция ДобавитьПользователяАбонента(ПараметрыДобавления, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДобавитьПользователяАбонента(ПараметрыДобавления,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Обновляет свойства пользователя абонента.
// Реализует метод внешнего программного интерфейса - account/users/update.
//
// Параметры:
//  Параметры - см. НовыйПараметрыОбновленияПользователяАбонента
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - признак создания учетной записи Истина - создана, Ложь - произошла ошибка.
Функция ОбновитьПользователяАбонента(Параметры, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбновитьПользователяАбонента(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Отменяет пользователю сервиса с указанным логином доступ к абоненту этого приложения.
//
// Параметры:
//  ПараметрыУдаления - см. НовыйПараметрыУдаленияПользователя
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат отмены права доступа к абоненту: Истина - право отменено, Ложь - произошла ошибка.
//
Функция УдалитьПользователяАбонента(ПараметрыУдаления, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УдалитьПользователяАбонента(ПараметрыУдаления,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Устанавливает указанному пользователю абонента этого приложения указанную роль.
// Реализует метод внешнего программного интерфейса - account/users/set_role.
// 
// Параметры:
//  Логин - Строка - логин (имя) пользователя. 
//  Роль - ПеречислениеСсылка.РолиПользователейАбонентов - устанавливаемая роль пользователя.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - установки роли Истина - установлено, Ложь - произошла ошибка.
//
Функция УстановитьРольПользователяАбонента(Логин, Роль, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УстановитьРольПользователяАбонента(Логин, Роль,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Устанавливает указанному пользователю абонента этого приложения ограничение на количество
// одновременных сеансов работы с приложениями.
// Реализует метод внешнего программного интерфейса - account/users/set_session_restriction.
// 
// Параметры:
//  ПараметрыУстановкиОграничения - см. НовыйПараметрыУстановкиОграниченияКоличестваСеансов 
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат установки ограничения: Истина - установлено, Ложь - произошла ошибка.
//
Функция УстановитьОграничениеКоличестваСеансовПользователяАбонента(ПараметрыУстановкиОграничения,
	ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УстановитьОграничениеКоличестваСеансовПользователяАбонента(
		ПараметрыУстановкиОграничения, ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Обновляет дополнительные реквизиты пользователя абонента
// Реализует метод внешнего программного интерфейса - account/users/update_attached_info.
// 
// Параметры:
//  Логин - Строка - логин (имя) пользователя. 
//  ДопРеквизиты - ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//     * Ключ - Строка - имя дополнительного реквизита
//     * Тип - Строка - тип значения 
//     * Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - установка доп. реквизитов: Истина - установлено, Ложь - произошла ошибка.
Функция ОбновитьДопРеквизитыПользователяАбонента(Логин, ДопРеквизиты, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбновитьДопРеквизитыПользователяАбонента(Логин, ДопРеквизиты,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список приложений, к которым разрешен доступ пользователю абонента
//
// Параметры:
//  Параметры - см. НовыйПараметрыЗапросаПриложенийПользователяАбонента.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пользователи, которым разрешен доступ:
//   * Код - Число - код (номер) приложения
//   * Право - ПеречислениеСсылка.ПраваПользователяПриложения - право пользователя на приложение в менеджере сервиса.
//   * ТребуетсяНастройкаВПриложении - Булево - признак необходимости настройки прав пользователя в приложении.
//
Функция ПриложенияПользователяАбонента(Параметры, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПриложенияПользователяАбонента(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров создания пользователя для метода ПрограммныйИнтерфейсСервиса.СоздатьПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания пользователя:
//	 * Логин - Строка - логин (имя пользователя)
//	 * Пароль - Строка - пароль пользователя
//   * ПочтаОбязательна - Булево - признак обязательной установки почты (по умолчанию = Истина)
//   * Почта - Строка - электронная почта
//   * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роль (по умолчанию = ПользовательАбонента)
//   * ПолноеИмя - Строка - полное имя (наименование) пользователя
//   * Телефон - Строка - телефон пользователя
//   * ЧасовойПояс - Строка - рабочий часовой пояс пользователя
//   * Описание - Строка - описание пользователя
//   * ТолькоПригласить - Булево - если Истина, то пользователь буден приглашен присоединиться к абоненту
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//     ** Ключ - Строка - имя реквизита
//     ** Тип - Строка - тип реквизита. 
//              Простые: string, decimal, date, boolean
//              Ссылочные: user, subscriber, tariff, service_provider_tariff, tariff_period, 
//                         subscription, service, additional_value, additional_value_group.
//     ** Значение - Строка, Число, Дата, Булево - значение реквизита.
//   * УстановитьПраваПриложений - Булево - необходимость установки прав на приложения.
//   * ПраваНаПриложения - ТаблицаЗначений - устанавливаемые права на приложения:
//     ** КодПриложения - Число - код приложения (номер области)
//     ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - устанавливаемая роль пользователя.
//
Функция НовыйПараметрыСозданияПользователя() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыСозданияПользователя();

КонецФункции

// Возвращает шаблон параметров обновления пользователя для метода ПрограммныйИнтерфейсСервиса.ОбновитьПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров обновления пользователя:
//	 * Логин - Строка - логин (имя пользователя)
//	 * ОбновитьРазрешенноеКоличествоСеансов - Булево - признак обновления разрешенного количества сеансов
//	 * РазрешенноеКоличествоСеансов - Число - разрешенное количество сеансов
//	 * Роль - ПеречислениеСсылка.РолиПользователейАбонентов - роль пользователя
//	 * Приложения - ТаблицаЗначений - добавляемые приложения:
//	   ** КодПриложения - Число - код приложения (номер области)
//	   ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - право пользователя на текущее приложение
//	 * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//	   ** Ключ - Строка - имя дополнительного реквизита
//	   ** Тип - Строка - тип значения 
//	   ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
Функция НовыйПараметрыОбновленияПользователяАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыОбновленияПользователяАбонента();

КонецФункции

// Возвращает шаблон параметров добавления существующего пользователя для метода ПрограммныйИнтерфейсСервиса.СоздатьПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания пользователя:
//	 * Логин - Строка - логин (имя пользователя)
//   * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роль (по умолчанию = ПользовательАбонента)
//   * Описание - Строка - описание пользователя
//   * Принудительно - Булево - выполнить даже при наличии предупреждений
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//     ** Ключ - Строка - имя реквизита
//     ** Тип - Строка - тип реквизита. 
//              Простые: string, decimal, date, boolean
//              Ссылочные: user, subscriber, tariff, service_provider_tariff, tariff_period, 
//                         subscription, service, additional_value, additional_value_group.
//     ** Значение - Строка, Число, Дата, Булево - значение реквизита.
//   * УстановитьПраваПриложений - Булево - необходимость установки прав на приложения.
//   * ПраваНаПриложения - ТаблицаЗначений - устанавливаемые права на приложения:
//     ** КодПриложения - Число - код приложения (номер области)
//     ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - устанавливаемая роль пользователя.
//
Функция НовыйПараметрыДобавленияПользователя() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыДобавленияПользователя();

КонецФункции

// Возвращает шаблон параметров для метода
// ПрограммныйИнтерфейсСервиса.УдалитьПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура:
//   * Логин - Строка - логин (имя пользователя)
Функция НовыйПараметрыУдаленияПользователя() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыУдаленияПользователя();

КонецФункции

// Возвращает шаблон параметров для метода 
// ПрограммныйИнтерфейсСервиса.УстановитьОграничениеКоличестваСеансовПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура:
//   * Логин - Строка - логин (имя пользователя)
//   * РазрешенноеКоличествоСеансов - Число - устанавливаемое значение.
Функция НовыйПараметрыУстановкиОграниченияКоличестваСеансов() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыУстановкиОграниченияКоличестваСеансов();

КонецФункции

// Возвращает доступные дополнительные реквизиты для пользователя абонента.
// Реализует метод внешнего программного интерфейса - account/users/available_attached_info.
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - дополнительные реквизиты пользователя абонента:
//   * Ключ - Строка - имя дополнительного реквизита
//   * Заголовок - Строка - заголовок дополнительного реквизита
//   * Тип - Строка - тип значения 
Функция ДоступныеДополнительныеРеквизитыПользователяАбонента(ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДоступныеДополнительныеРеквизитыПользователяАбонента(
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета)

КонецФункции

// Возвращает шаблон параметров для метода
// ПрограммныйИнтерфейсСервиса.ПриложенияПользователяАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//   * КодАбонента - Число - код абонента
//   * Логин - Строка - логин пользователя
//
Функция НовыйПараметрыЗапросаПриложенийПользователяАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыЗапросаПриложенийПользователяАбонента();

КонецФункции

#КонецОбласти

#Область Account_Servants

// Возвращает список обслуживающих организаций абонента этого приложения.
// Реализует метод внешнего программного интерфейса - account/servants/list
//
// Возвращаемое значение:
//  ТаблицаЗначений - обслуживающие организации абонента:
//   * Код - Число - код (номер) обслуживающей организации
//   * Наименование - Строка - наименование обслуживающей организации
//   * Идентификатор - Строка - идентификатор абонента
//   * Город - Строка - город
//   * Сайт - Строка - сайт
//   * Почта - Строка - электронная почта
//   * Телефон - Строка - телефон
//   * РазрешеноПодписыватьНаТарифы - Булево - разрешено подписывать на тарифы
//   * РазрешеноАвтоматическоеВыставлениеСчетов - Булево - разрешено автоматическое выставление счетов
//   * РазрешеноПереопределениеТарифов - Булево - разрешено переопределение тарифов
//   * ТолькоСтраницаВыбораТарифа - Булево - отображать только страницу выбора тарифа в форме оплаты
//
Функция ОбслуживающиеОрганизацииАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбслуживающиеОрганизацииАбонента();

КонецФункции

// Возвращает HTML-страницу выбора тарифа обслуживающей организации абонента этого приложения.
// Реализует метод внешнего программного интерфейса -  account/servants/tariff_selection_page
// Параметры:
//  КодОО - Число - код обслуживающей организации.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Строка - HTML-страница выбора тарифа обслуживающей организации.
//
Функция СтраницаВыбораТарифаОбслуживающейОрганизации(КодОО, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СтраницаВыбораТарифаОбслуживающейОрганизации(КодОО,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список рекомендуемых тарифов, определенных обслуживающей организацией.
// Реализует метод внешнего программного интерфейса - account/servants/recommended_tariffs
//
// Параметры:
//  КодОО - Число - код обслуживающей организации.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список тарифов:
//   * КодТарифаПровайдера - Строка - код тарифа провайдера
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации.
Функция РекомендуемыеТарифы(КодОО, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.РекомендуемыеТарифы(КодОО, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список тарифов обслуживающей организации.
// Реализует метод внешнего программного интерфейса - account/servant_tariffs/list
//
// Параметры:
//  Отбор - см. НовыйОтборСпискаТарифовОбслуживающейОрганизации
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список тарифов:
//   * Код - Строка - код тарифа
//   * Наименование - Строка - наименование тарифа
//   * КодТарифаПровайдера - Строка - код базового тарифа
//   * КраткоеОписание - Строка - краткое описание тарифа
//   * ПериодыДействия - ТаблицаЗначений - периоды действия. Заполняется если передан параметр получения ПараметрПолученияПериодыДействия:
//     ** Код - Строка - код периода действия
//     ** Наименование - Строка - наименование периода действия
//     ** Сумма - Число - стоимость тарифа с этим периодом действия
//     ** Рекомендуемый - Булево - признак, что период действия является рекомендуемым 
//     ** Комментарий - Строка - комментарий к периоду действия.
//
Функция ТарифыОбслуживающейОрганизации(Отбор, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ТарифыОбслуживающейОрганизации(Отбор, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает информацию о тарифе обслуживающей организаций.
//
// Параметры:
//  КодОО - Число - код обслуживающей организации.
//  КодТарифа - Строка - код тарифа обслуживающей организации. 
// 
// Возвращаемое значение:
//  Структура - информация о тарифе:
//   * Код - Строка - код тарифа
//   * Наименование - Строка - наименование тарифа
//   * КодТарифаПровайдера - Строка - код тарифа провайдера
//   * КраткоеОписание - Строка - краткое описание тарифа
//   * ОписаниеДляАбонентов - ФорматированныйДокумент - описание тарифа для абонентов.
//   * ПериодыДействия - ТаблицаЗначений - периоды действия тарифа:
//     ** Код - Строка - код периода действия
//     ** Наименование - Строка - наименование периода действия
//     ** Сумма - Число - стоимость
//     ** Рекомендуемый - Булево - признак того, что период является рекомендуемым к покупке
//     ** Комментарий - Строка - комментарий к периоду действия
//
Функция ТарифОбслуживающейОрганизации(КодОО, КодТарифа) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ТарифОбслуживающейОрганизации(КодОО, КодТарифа);

КонецФункции

#КонецОбласти

#Область Backup

// Возвращает список резервных копий абонента
//
// Параметры:
//  Параметры - см. НовыйПараметрыПолученияСпискаРезервныхКопий
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
Функция СписокРезервныхКопийАбонента(Параметры = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокРезервныхКопийАбонента(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства резервной копии по идентификатору.
// Реализует метод внешнего программного интерфейса - backup/info.
// 
// Параметры:
//  ИдентификаторКопии - Строка - идентификатор резервной копии
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - свойства резервной копии:
//   * ИдентификаторРК - УникальныйИдентификатор
//   * НомерОбласти - Число
//   * НаименованиеОбласти - Строка
//   * Размер - Число
//   * ВерсияКонфигурации - Строка
//   * ИмяВидаПриложения - Строка
//   * Исходная - Булево
//   * ДатаСозданияUTC - Дата
//   * ПоТребованию - Булево
//   * Ежегодная - Булево
//   * Ежемесячная - Булево
//   * Ежедневная - Булево
//   * Комментарий - Строка
//   * ЧасовойПояс - Строка
//   * ИмяФайла - Строка
Функция СвойстваРезервнойКопии(ИдентификаторКопии, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваРезервнойКопии(ИдентификаторКопии, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров создания приложения для метода ПрограммныйИнтерфейсСервиса.СписокРезервныхКопийАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания приложения:
//   * НачалоПериода - Дата - дата начала периода.
//   * КонецПериода - Дата - дата конца периода.
Функция НовыйПараметрыПолученияСпискаРезервныхКопий() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияСпискаРезервныхКопий();

КонецФункции

// Возвращает данные для скачивания резервной копий
//
// Параметры:
//  Параметры - см. НовыйПараметрыПолученияФайлаРезервнойКопии
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - данные скачивания резервной копии:
//   * АдресФайла - Строка - URL файла резервной копии.
//   * ИмяФайла - Строка - рекомендуемое имя файла для сохранения.
//   * ИдентификаторЗадания - УникальныйИдентификатор - идентификатор задания подготовки резервной копии.
//   * Токен - Строка
//   * СрокДействияТокена - Дата
Функция ДанныеДляПолученияФайлаРезервнойКопии(Параметры = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДанныеДляПолученияФайлаРезервнойКопии(Параметры,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров получения файла резервной копии для метода ПрограммныйИнтерфейсСервиса.ДанныеДляПолученияФайлаРезервнойКопии.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров получения файла резервной копии:
//   * ИдентификаторРК - Строка - идентификатор резервной копии.
//   * ИдентификаторЗадания - Строка - идентификатор задания подготовки резервной копии.
Функция НовыйПараметрыПолученияФайлаРезервнойКопии() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияФайлаРезервнойКопии();

КонецФункции

#КонецОбласти

#Область Customers

// Возвращает список обслуживаемых абонентов.
// Реализует метод внешнего программного интерфейса - account/customers/list
//
// Параметры:
//  КодОО - Число - код (номер) ведущего абонента (если не указан, используется абонент текущего приложения).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Наименование - Строка - наименование абонента (длина - 64)
//   * Код - Строка - код (номер) обслуживаемого абонента (длина - 12).
Функция ОбслуживаемыеАбоненты(КодОО = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбслуживаемыеАбоненты(КодОО, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства обслуживаемого абонента.
// Реализует метод внешнего программного интерфейса - account/customers/info
//
// Параметры:
//  КодАбонента - Число - код (номер) обслуживаемого абонента.
//  КодОО - Число - код (номер) ведущего абонента (если не указан, используется абонент текущего приложения).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура:
//   * Наименование - Строка - наименование абонента (длина - 64)
//   * Код - Строка - код (номер) обслуживаемого абонента (длина - 12)
//   * Сайт - Строка - сайт из КИ (длина - 500)
//   * Город - Строка - город из КИ (длина - 500)
//   * Почта - Строка - почта из КИ (длина - 500)
//   * Телефон - Строка - телефон из КИ (длина - 500)
//
Функция СвойстваОбслуживаемогоАбонента(КодАбонента, КодОО = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваОбслуживаемогоАбонента(КодАбонента, КодОО,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает дополнительные сведения (реквизиты и свойства) обслуживаемого абонента.
// Реализует метод внешнего программного интерфейса - account/customers/attached_info
//
// Параметры:
//  КодАбонента - Число - код (номер) обслуживаемого абонента.
//  КодОО - Число - код (номер) ведущего абонента (если не указан, используется абонент текущего приложения).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Структура - дополнительные реквизиты и свойства абонента:
//   * ПубличныйИдентификатор - Строка - публичный идентификатор абонента
//   * Реквизиты - ТаблицаЗначений - дополнительные реквизиты абонента:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения 
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//   * Свойства - ТаблицаЗначений - дополнительные свойства абонента:
//     ** Ключ - Строка - имя дополнительного свойства
//     ** Тип - Строка - тип значения
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного свойства
Функция ДопСведенияОбслуживаемогоАбонента(КодАбонента, КодОО = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДопСведенияОбслуживаемогоАбонента(КодАбонента, КодОО,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Обновляет дополнительные сведения (реквизиты и свойства) обслуживаемого абонента.
// Реализует метод внешнего программного интерфейса - account/customers/update_attached_info.
//
// Параметры:
//  ДопСведения - см. НовыйДопСведенияАбонента
//  КодОО - Число - код (номер) ведущего абонента (если не указан, используется абонент текущего приложения).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Булево - установка доп. сведений: Истина - установлено, Ложь - произошла ошибка.
//
Функция ОбновитьДопСведенияОбслуживаемогоАбонента(ДопСведения, КодОО = Неопределено,
	ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбновитьДопСведенияОбслуживаемогоАбонента(ДопСведения, КодОО,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон дополнительных сведений абонента.
//
// Параметры:
//  ДляОбслуживающейОрганизации - Булево - признак того, что данные будут использоваться для обслуживающей организации.
//
// Возвращаемое значение:
//  Структура:
//   * КодАбонента - Число - код абонента
//   * ПубличныйИдентификатор - Строка - публичный идентификатор абонента (длина - 36), может отсутствовать.
//   * Реквизиты - ТаблицаЗначений - дополнительные реквизиты абонента: 
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения (не обязательно, если у доп. реквизита один тип значения)
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//   * Свойства - ТаблицаЗначений - дополнительные свойства абонента: 
//     ** Ключ - Строка - имя дополнительного свойства
//     ** Тип - Строка - тип значения (не обязательно, если у доп. свойства один тип значения)
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного свойства
//
Функция НовыйДопСведенияАбонента(ДляОбслуживающейОрганизации = Истина) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйДопСведенияАбонента(ДляОбслуживающейОрганизации);

КонецФункции

#КонецОбласти

#Область CustomerSubscriptions

// Возвращает список подписок на тарифы обслуживаемых абонентов.
// Реализует метод внешнего программного интерфейса - account/customer_subscriptions/list
//
// Параметры:
//  Отбор - см. НовыйОтборПодписокНаТарифы
//  КодОО - Число - код (номер) ведущего абонента (если не указан, используется абонент текущего приложения).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - существующие подписки на тарифы:
//   * Номер - Строка - номер подписки
//   * Дата - Дата - дата регистрации подписки
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента
//   * КодВедущегоАбонента - Число - код (номер) ведущего абонента
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодТарифаПровайдера - Строка - код тарифа в подписке
//   * КодПериодаДействия - Строка - код периода действия
//   * Количество - Число - количество тарифов в подписке
//   * НомерОсновнойПодписки - Строка - номер основной подписки, если текущая подписка на тариф-расширение.
//   * ТипПодписки - ПеречислениеСсылка.ТипыПодписокСервиса - тип подписки
//   * НомерСчетаНаОплату - Строка - номер счета на оплату
//   * ИдентификаторСчетаНаОплату - УникальныйИдентификатор - идентификатор счета на оплату
//
Функция ПодпискиНаТарифы(Отбор, КодОО = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПодпискиНаТарифы(Отбор, КодОО, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства подписки на тариф обслуживаемого абонента.
// Реализует метод внешнего программного интерфейса - account/customer_subscriptions/info
// 
// Параметры:
//  НомерПодписки - Строка - номер подписки.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Структура - свойства подписки на тариф:
//   * Номер - Строка - номер подписки
//   * Дата - Дата - дата регистрации подписки
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента
//   * КодВедущегоАбонента - Число - код (номер) ведущего абонента
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодТарифаПровайдера - Строка - код тарифа в подписке
//   * КодПериодаДействия - Строка - код периода действия
//   * Количество - Число - количество тарифов в подписке
//   * НомерОсновнойПодписки - Строка - номер основной подписки, если текущая подписка на тариф-расширение.
//   * ТипПодписки - ПеречислениеСсылка.ТипыПодписокСервиса - тип подписки
//   * НомерСчетаНаОплату - Строка - номер счета на оплату
//   * ИдентификаторСчетаНаОплату - УникальныйИдентификатор - идентификатор счета на оплату
Функция СвойстваПодпискиНаТариф(НомерПодписки, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваПодпискиНаТариф(НомерПодписки, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства подписки на тариф абонента.
// Реализует метод внешнего программного интерфейса - subscription/info
// 
// Параметры:
//  НомерПодписки - Строка - номер подписки.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Структура - свойства подписки на тариф:
//   * Номер - Строка - номер подписки
//   * Дата - Дата - дата регистрации подписки
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента
//   * КодВедущегоАбонента - Число - код (номер) ведущего абонента
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодТарифаПровайдера - Строка - код тарифа в подписке
//   * КодПериодаДействия - Строка - код периода действия
//   * Количество - Число - количество тарифов в подписке
//   * НомерОсновнойПодписки - Строка - номер основной подписки, если текущая подписка на тариф-расширение.
//   * ТипПодписки - ПеречислениеСсылка.ТипыПодписокСервиса - тип подписки
//   * НомерСчетаНаОплату - Строка - номер счета на оплату
//   * ИдентификаторСчетаНаОплату - УникальныйИдентификатор - идентификатор счета на оплату
Функция СвойстваПодпискиНаТарифАбонента(НомерПодписки, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваПодпискиНаТарифАбонента(НомерПодписки,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Создает новую подписку на основной тариф обслуживаемого абонента
// Реализует метод внешнего программного интерфейса - account/customer_subscriptions/create
//
// Параметры:
//  ДанныеПодписки - см. НовыйШаблонПодпискиНаОсновнойТариф
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Неопределено, Структура - если оформление подписки успешно выполнено:
//   * Номер - Строка - номер созданной подписки.
//   * ДатаОтключения - Дата - дата отключения созданной подписки.
Функция СоздатьПодпискуНаОсновнойТариф(ДанныеПодписки, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПодпискуНаОсновнойТариф(ДанныеПодписки,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Метод создает новую подписку или несколько подписок на расширение тарифа обслуживаемого абонента.
// Реализует метод внешнего программного интерфейса - account/customer_subscriptions/create_enhanced
//
// Параметры:
//  ДанныеРасширенияТарифа - см. НовыйШаблонПодпискиНаРасширениеТарифа
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - если оформление подписки успешно выполнено:
//   * Номер - Строка - номер созданной подписки.
//   * ДатаОтключения - Дата - дата отключения созданной подписки.
Функция СоздатьПодпискуНаРасширениеТарифа(ДанныеРасширенияТарифа, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПодпискуНаРасширениеТарифа(ДанныеРасширенияТарифа,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон новой подписки на основной тариф обслуживаемого абонента.
//
// Возвращаемое значение:
//  Структура:
//   * КодВедущегоАбонента - Число - код (номер) ведущего абонента
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодТарифаПровайдера - Строка - код тарифа в подписке
//   * КодПериодаДействия - Строка - код периода действия подписки
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
Функция НовыйШаблонПодпискиНаОсновнойТариф() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйШаблонПодпискиНаОсновнойТариф()

КонецФункции

// Возвращает шаблон новой подписки на расширение тарифа обслуживаемого абонента.
//
// Возвращаемое значение:
//  Структура:
//   * КодВедущегоАбонента - Число - код (номер) ведущего абонента
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодТарифаПровайдера - Строка - код тарифа в подписке
//   * КодПериодаДействия - Строка - код периода действия подписки
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
//   * НомерОсновнойПодписки - Строка - номер подписки на основной тариф
//   * Количество - Число - количество тарифов в подписке.
Функция НовыйШаблонПодпискиНаРасширениеТарифа() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйШаблонПодпискиНаРасширениеТарифа();

КонецФункции

#КонецОбласти

#Область AccountingSystem

// Возвращает список учетных систем, доступных абоненту.
// Реализует метод внешнего программного интерфейса - accounting_system/list
//
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений - список учетных систем абонента:
//   * Код - Число - код учетной системы
//   * Наименование - Строка - наименование учетной системы
//   * КодВладельца - Число - код абонента-владельца учетной системы
//   * ЗагружатьДанные - Булево - признак загрузки данных
//   * ЛогинПользовательДляЗагрузки - Строка - логин пользователя для загрузки данных
//   * ВыгружатьДанные - Булево - признак выгрузки данных
//   * АдресДляВыгрузки - Строка - URL-адрес учетной системы для выгрузки данных
//   * ЛогинПользователяДляВыгрузки - Строка - логин пользователя для выгрузки данных
//
Функция СписокУчетныхСистем(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокУчетныхСистем(ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства учетной системы абонента по коду учетной системы.
// Реализует метод внешнего программного интерфейса - accounting_system/info
//
// Параметры:
//  Код - Число - код учетной системы абонента.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - свойства учетной системы:
//   * Код - Число - код учетной системы абонента
//   * Наименование - Строка - наименование учетной системы
//   * Описание - Строка - описание учетной системы
//   * КодВладельца - Число - код абонента-владельца учетной системы
//   * ЗагружатьДанные - Булево - признак загрузки данных
//   * ЛогинПользователяДляЗагрузки - Строка - логин пользователя для загрузки данных в менеджер сервиса
//   * ПравилаЗагрузки - ТаблицаЗначений - правила загрузки данных:
//     ** КодПравила - Строка - код правила загрузки данных
//     ** Адрес - Строка - адрес объекта для загрузки данных
//   * ВыгружатьДанные - Булево - признак выгрузки данных
//   * АдресДляВыгрузки - Строка - URL-адрес учетной системы для выгрузки данных в учетную систему
//   * ЛогинПользователяДляВыгрузки - Строка - логин пользователя для выгрузки данных 
//   * ПравилаВыгрузки - ТаблицаЗначений - правила выгрузки данных:
//     ** КодПравила - Строка - код правила выгрузки данных
//     ** ИдентификаторСтроки - УникальныйИдентификатор - идентификатор строки правила выгрузки 
//     ** КодУсловия - Строка - код условия использования правила выгрузки
//     ** Адрес - Строка - адрес объекта для выгрузки данных
//     ** БыстраяОтправка - Булево - признак быстрой отправки
//     ** ВыгрузкаПоРасписанию - Булево - признак выгрузки по расписанию
//     ** ОтборПоПоставщику - Булево - признак отбора по поставщику
//   * ПравилаОбработкиОтветов - ТаблицаЗначений:
//     ** ИдентификаторСтрокиПравилаВыгрузки - УникальныйИдентификатор - идентификатор строки правила выгрузки
//     ** КодПравила - Строка - код правила обработки ответа
//     ** КодыОтветов - Массив Из Число - коды ответов для вызова правила обработки.
//   
Функция СвойстваУчетнойСистемы(Код, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваУчетнойСистемы(Код, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Создает новую или обновляет существующую учетную систему биллинга.
// Реализует метод внешнего программного интерфейса - accounting_system/create_update_billing
//
// Параметры:
//  ПараметрыСозданияОбновления - см. НовыйПараметрыСозданияОбновленияУчетнойСистемыБиллинга
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - свойства учетной системы:
//   * Код - Число - код учетной системы абонента
//   * Наименование - Строка - наименование учетной системы
//
Функция СоздатьОбновитьУчетнуюСистемуБиллинга(ПараметрыСозданияОбновления, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьОбновитьУчетнуюСистемуБиллинга(ПараметрыСозданияОбновления,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров создания\обновления учетной системы биллинга.
//
// Возвращаемое значение:
//  Структура - шаблон параметров:
//   * ЛогинПользователяДляЗагрузки - Строка - логин пользователя для загрузки данных в менеджер сервиса
//   * ЛогинПользователяДляВыгрузки - Строка - логин пользователя для выгрузки данных в учетную систему
//   * АдресДляВыгрузки - Строка - URL-адрес учетной системы для выгрузки данных в учетную систему
//   * ПарольДляВыгрузки - Строка - пароль пользователя для выгрузки данных в учетную систему 
//   * КодУчетнойСистемы - Число - код обновляемой учетной системы абонента.
//   								Если не указан, создается новая учетная система.
Функция НовыйПараметрыСозданияОбновленияУчетнойСистемыБиллинга() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыСозданияОбновленияУчетнойСистемыБиллинга();

КонецФункции

#КонецОбласти

#Область Application

// Возвращает список прикладных конфигураций, доступных абоненту этого приложения.
// 
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//   
// Возвращаемое значение:
//  ТаблицаЗначений - доступные конфигурации:
//    * Код - Строка - код конфигурации
//    * Наименование - Строка - синоним конфигурации 
//    * Имя - Строка - имя конфигурации (как оно задано в конфигураторе).
//    * Описание - Строка - описание конфигурации 
//    * КодАбонента - Число - код абонента. 
//
Функция Конфигурации(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.Конфигурации(ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает свойства прикладной конфигурации.
// 
// Параметры:
//  КодКонфигурации - Строка - Код конфигурации.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//   
// Возвращаемое значение:
//  ТаблицаЗначений - доступные конфигурации:
//    * Код - Строка - код конфигурации
//    * Наименование - Строка - синоним конфигурации 
//    * Имя - Строка - имя конфигурации (как оно задано в конфигураторе).
//    * Описание - Строка - описание конфигурации.
//    * Картинка - Строка - пиктограмма конфигурации в формате Base64.
//    * КодАбонента - Число - код абонента.
//
Функция Конфигурация(КодКонфигурации, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.Конфигурация(КодКонфигурации, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

#КонецОбласти

#Область AppType

// Возвращает список вариантов перехода видов приложений
// Реализует метод внешнего программного интерфейса - apptype/transition_options/list
// 
// Параметры:
//  Отбор - см. НовыйОтборВариантовПерехода
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Неопределено, ТаблицаЗначений - список обработчиков перехода видов приложения:
//   * НомерВерсииКонфигурации - Строка - номер версии конфигурации
//   * КодПредыдущегоВидаПриложения - Строка - код предыдущего вида приложения
//   * КодВидаПриложения - Строка - код целевого вида приложения
//   * ИмяВидаПриложения - Строка - имя целевого вида приложения
//   * НаименованиеВидаПриложения - Строка - наименование целевого вида приложения 
//
Функция СписокВариантовПереходаВидовПриложений(Отбор = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокВариантовПереходаВидовПриложений(Отбор,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон отбора обработчиков перехода.
//
// Возвращаемое значение:
//  Структура:
//   * КодКонфигурации - Строка - код конфигурации
//   * ВерсияКонфигурации - Строка - версия конфигурации
//   * КодВидаПриложения - Строка - код вида приложения
Функция НовыйОтборВариантовПерехода() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОтборВариантовПерехода();

КонецФункции

#КонецОбласти

#Область Bill

// Возвращает список счетов на оплату
// Реализует метод внешнего программного интерфейса - bill/list
// 
// Параметры:
//  Отбор - см. НовыйОтборСчетовНаОплату
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - список счетов на оплату:
//	 * Номер - Строка - номер счета
//	 * Дата - Дата - дата создания счета
//	 * ДатаИзменения - Дата - дата изменения счета
//	 * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//	 * КодПродавца - Число - код (номер) абонента-продавца
//	 * КодПокупателя - Число - код (номер) абонента-покупателя
//	 * Сумма - Число - сумма счета
//	 * Продление - Булево - признак продления
//	 * ПлатежнаяСсылка - Строка - платежная ссылка
//	 * Оплачен - Булево - признак оплаты счета
//	 * ДополнительнаяИнформация - Строка - дополнительная информация по счету
//	 * Комментарий - Строка - комментарий счета
Функция СписокСчетовНаОплату(Отбор = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокСчетовНаОплату(Отбор, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает данные счета на оплату по номеру или идентификатору счета.
// Реализует метод внешнего программного интерфейса - bill/info
//
// Параметры:
//  ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета (не указывается, если передан номер счета)
//  НомерСчета - Строка - номер счета (не указывается, если передан идентификатор счета)
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - данные счета:
//	 * Номер - Строка - номер счета
//	 * Дата - Дата - дата создания счета
//	 * ДатаИзменения - Дата - дата изменения счета
//	 * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//	 * КодПродавца - Число - код (номер) абонента-продавца
//	 * КодПокупателя - Число - код (номер) абонента-покупателя
//	 * Сумма - Число - сумма счета
//	 * Продление - Булево - признак продления
//	 * ПлатежнаяСсылка - Строка - платежная ссылка
//	 * Оплачен - Булево - признак оплаты счета
//	 * ДополнительнаяИнформация - Строка - дополнительная информация по счету
//	 * Комментарий - Строка - комментарий счета
//   * Тарифы - ТаблицаЗначений - тарифы:
//     ** КодТарифаПровайдера - Строка - код тарифа провайдера
//     ** КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//     ** КодПериодаДействия - Строка - код периода действия тарифа
//     ** Количество - Число - количество тарифов в подписке
//     ** Сумма - Число - стоимость тарифа с учетом периода действия
//     ** НомерОснования - Строка - номер подписки-основания
//   * Услуги - ТаблицаЗначений - услуги:
//     ** Услуга - Строка - наименование услуги
//     ** Сумма - Число - стоимость услуги
//   * Файлы - ТаблицаЗначений - файлы представления текущего счета на оплату:
//     ** Идентификатор - УникальныйИдентификатор - идентификатор файла
//     ** Описание - Строка - имя файла представления счета
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты счета:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения 
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//	 * Состояние - Структура - данные состояния счета:
//     ** Ошибка - Булево - признак ошибки
//     ** Описание - Строка - описание состояния
//     ** Имя - Строка - имя состояния:
//         "created" - создан
//         "wait_sending" - ожидание отправки
//         "wait_registration" - ожидание оформления
//         "wait_payment" - ожидание оплаты
//         "paid" - оплачен
//         "billing_error" - ошибка выставления счета.
Функция ДанныеСчетаНаОплату(ИдентификаторСчета = Неопределено, НомерСчета = Неопределено,
	ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДанныеСчетаНаОплату(ИдентификаторСчета, НомерСчета,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Создает новый счет на оплату.
// Реализует метод внешнего программного интерфейса - bill/create
// 
// Параметры:
//  ДанныеСчета - Структура:
//	 * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//	 * КодПродавца - Число - код (номер) абонента-продавца
//	 * КодПокупателя - Число - код (номер) абонента-покупателя
//	 * Сумма - Число - сумма счета
//	 * Продление - Булево - признак продления
//	 * ПлатежнаяСсылка - Строка - платежная ссылка
//	 * Оплачен - Булево - признак оплаты счета
//	 * ДополнительнаяИнформация - Строка - дополнительная информация по счету
//	 * Комментарий - Строка - комментарий счета
//   * Тарифы - ТаблицаЗначений - тарифы:
//     ** КодТарифаПровайдера - Строка - код тарифа провайдера
//     ** КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//     ** КодПериодаДействия - Строка - код периода действия тарифа
//     ** Количество - Число - количество тарифов в подписке
//     ** Сумма - Число - стоимость тарифа с учетом периода действия
//     ** НомерОснования - Строка - номер подписки-основания
//   * Услуги - ТаблицаЗначений - услуги:
//     ** Услуга - Строка - наименование услуги
//     ** Сумма - Число - стоимость услуги
//   * Файлы - ТаблицаЗначений - файлы представления текущего счета на оплату:
//     ** Идентификатор - УникальныйИдентификатор - идентификатор файла
//     ** Описание - Строка - имя файла представления счета
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты счета:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения (не обязательно, если у доп. реквизита один тип значения)
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура:
//   * Номер - Строка - номер созданного счета на оплату
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор созданного счета на оплату.	
Функция СоздатьСчетНаОплату(ДанныеСчета, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьСчетНаОплату(ДанныеСчета, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Изменяет существующий счет на оплату.
// Реализует метод внешнего программного интерфейса - bill/update
// 
// Параметры:
//  ДанныеСчета - Структура:
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//   * КодПродавца - Число - код (номер) абонента-продавца
//	 * КодПокупателя - Число - код (номер) абонента-покупателя
//	 * Сумма - Число - сумма счета
//	 * Продление - Булево - признак продления
//	 * ПлатежнаяСсылка - Строка - платежная ссылка
//	 * Оплачен - Булево - признак оплаты счета
//	 * ДополнительнаяИнформация - Строка - дополнительная информация по счету
//	 * Комментарий - Строка - комментарий счета
//   * Тарифы - ТаблицаЗначений - тарифы:
//     ** КодТарифаПровайдера - Строка - код тарифа провайдера
//     ** КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//     ** КодПериодаДействия - Строка - код периода действия тарифа
//     ** Количество - Число - количество тарифов в подписке
//     ** Сумма - Число - стоимость тарифа с учетом периода действия
//     ** НомерОснования - Строка - номер подписки-основания
//   * Услуги - ТаблицаЗначений - услуги:
//     ** Услуга - Строка - наименование услуги
//     ** Сумма - Число - стоимость услуги
//   * Файлы - ТаблицаЗначений - файлы представления текущего счета на оплату:
//     ** Идентификатор - УникальныйИдентификатор - идентификатор файла
//     ** Описание - Строка - имя файла представления счета
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты счета:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения (не обязательно, если у доп. реквизита один тип значения)
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура:
//   * Номер - Строка - номер измененного счета на оплату
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор измененного счета на оплату.	
Функция ИзменитьСчетНаОплату(ДанныеСчета, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ИзменитьСчетНаОплату(ДанныеСчета, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции	

// Возвращает талон на загрузку файла в существующий счет на оплату
// Реализует метод внешнего программного интерфейса - bill/file_token/upload
//
// Параметры:
//  ПараметрыПолучения - см. НовыйПараметрыПолученияТалонаНаЗагрузкуФайла
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  Структура:
//  * НомерСчета - Строка - номер счета
//  * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//  * НаправлениеПередачиДанных - Строка - направление передачи файла = "upload"
//  * ТалонНаЗагрузкуФайла - Строка - талон на загрузку файла
//  * АдресДляЗагрузки - Строка - URL для загрузки файла методом PUT
Функция СчетНаОплатуФайлыТалонНаЗагрузку(ПараметрыПолучения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СчетНаОплатуФайлыТалонНаЗагрузку(ПараметрыПолучения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Создать подписки на тарифы на основании счета на оплату.
// 
// Параметры:
//  ПараметрыСоздания - см. НовыйПараметрыСозданияПодписокНаТарифыНаОснованииСчетаНаОплату
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Массив из Строка - номера созданных подписок
Функция СоздатьПодпискиНаТарифыНаОснованииСчетаНаОплату(ПараметрыСоздания, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПодпискиНаТарифыНаОснованииСчетаНаОплату(ПараметрыСоздания,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Создает новое электронное письмо для отправки в обслуживающую организацию 
// с информацией о необходимости получить счет для оплаты услуг.
// Реализует метод внешнего программного интерфейса - bill/email_create
// 
// Параметры:
//  ПараметрыЗапросаПисьмомСчета - см. НовыйПараметрыЗапросаПисьмомСчета
//	ВызыватьИсключениеПриОшибке - Булево - по умолчанию = Истина
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// Возвращаемое значение:
//  Структура:
//   * Ошибка - Булево - Признак наличия ошибки при создании письма
//   * Сообщение - Строка - Строковое описание ошибки.	
Функция СоздатьЗапросПисьмомСчетаДляОплатыУслуг(ПараметрыЗапросаПисьмомСчета, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьЗапросПисьмомСчетаДляОплатыУслуг(ПараметрыЗапросаПисьмомСчета,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон отбора счетов на оплату.
// 
// Возвращаемое значение:
//  Структура:
//   * КодПродавца - Число - код абонента-продавца
//   * КодПокупателя - Число - код абонента-покупателя
//   * НачалоПериода - Дата - дата начала периода
//   * КонецПериода - Дата - дата конца периода 
//   
Функция НовыйОтборСчетовНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОтборСчетовНаОплату();

КонецФункции

// Возвращает шаблон нового счета на оплату.
//
// Возвращаемое значение:
//  Структура:
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета
//	 * КодПродавца - Число - код (номер) абонента-продавца
//	 * КодПокупателя - Число - код (номер) абонента-покупателя
//	 * Сумма - Число - сумма счета
//	 * Продление - Булево - признак продления
//	 * ПлатежнаяСсылка - Строка - платежная ссылка
//	 * Оплачен - Булево - признак оплаты счета
//	 * ДополнительнаяИнформация - Строка - дополнительная информация по счету
//	 * Комментарий - Строка - комментарий счета
//   * Тарифы - ТаблицаЗначений - тарифы:
//     ** КодТарифаПровайдера - Строка - код тарифа провайдера
//     ** КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//     ** КодПериодаДействия - Строка - код периода действия тарифа
//     ** НомерОснования - Строка - номер подписки-основания
//     ** Сумма - Число - стоимость тарифа с учетом периода действия
//   * Услуги - ТаблицаЗначений - услуги:
//     ** Услуга - Строка - наименование услуги
//     ** Сумма - Число - стоимость услуги
//   * Файлы - ТаблицаЗначений - файлы представления текущего счета на оплату:
//     ** Идентификатор - УникальныйИдентификатор - идентификатор файла
//     ** Описание - Строка - имя файла представления счета
//   * ДополнительныеРеквизиты - ТаблицаЗначений - дополнительные реквизиты счета:
//     ** Ключ - Строка - имя дополнительного реквизита
//     ** Тип - Строка - тип значения (не обязательно, если у доп. реквизита один тип значения)
//     ** Значение - Строка, Число, Дата, Булево - значение дополнительного реквизита
Функция НовыйШаблонСчетаНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйШаблонСчетаНаОплату();

КонецФункции

// Возвращает шаблон параметров получения талона на загрузку файла.
// 
// Возвращаемое значение:
//  Структура:
//   * НомерСчета - Строка - номер счета (не указывается, если передан идентификатор счета)
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета (не указывается, если передан номер счета)
//   * ИмяФайла - Строка - имя файла с расширением
//   * Размер - Строка - размер файла в байтах.
Функция НовыйПараметрыПолученияТалонаНаЗагрузкуФайла() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияТалонаНаЗагрузкуФайла();

КонецФункции

// Возвращает шаблон параметров создания подписок на тарифы на основании счета на оплату.
// 
// Возвращаемое значение:
//  Структура:
//   * НомерСчета - Строка - номер счета (не указывается, если передан идентификатор счета)
//   * ИдентификаторСчета - УникальныйИдентификатор - идентификатор счета (не указывается, если передан номер счета)
//   * ДатаПодключения - Дата - дата подключения создаваемых подписок на тарифы.
Функция НовыйПараметрыСозданияПодписокНаТарифыНаОснованииСчетаНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыСозданияПодписокНаТарифыНаОснованииСчетаНаОплату();

КонецФункции

// Возвращает шаблон табличной части "Тарифы" счета на оплату.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый тарифы счета на оплату:
// * КодТарифаПровайдера - Строка - длина 9
// * КодТарифаОбслуживающейОрганизации - Строка - длина 9
// * КодПериодаДействия - Строка - длина 10
// * Количество - Число - разрядность 10,0
// * Сумма  - Число - разрядность 31,2
// * НомерОснования - Строка - разрядность 9.
Функция НовыйТарифыСчетаНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйТарифыСчетаНаОплату();

КонецФункции

// Возвращает шаблон табличной части "Услуги" счета на оплату.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый услуги счета на оплату:
// * Услуга - Строка - длина 1000
// * Сумма - Число - разрядность 31,2.
Функция НовыйУслугиСчетаНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйУслугиСчетаНаОплату();

КонецФункции

// Возвращает шаблон табличной части "Файлы" счета на оплату.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Новый файлы счета на оплату:
// * Идентификатор - УникальныйИдентификатор
// * Описание - Строка -длина 150.
Функция НовыйФайлыСчетаНаОплату() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйФайлыСчетаНаОплату();

КонецФункции

// Возвращает шаблон параметров создания запроса письмом счета на оплату услугу.
// 
// Возвращаемое значение:
//  Структура:
//   * КодВедущегоАбонента - Число - Код абонента обслуживающей организации
//   * КодАбонента - Число - Код абонента, формирующего письмо с запросом счета на оплату
//   * ОтправитьКопиюСебе - Булево - Добавлять в копию письма почтовый адрес абонента
//   * Комментарий - Строка - Произвольный комментарий абонента для обслуживающей организации.
Функция НовыйПараметрыЗапросаПисьмомСчета() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыЗапросаПисьмомСчета();

КонецФункции

#КонецОбласти

#Область Tenant

// Возвращает данные абонента этого приложения.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - пользователь абонента, которого требуется определить. Если не указан, используется текущий.
//	Токен - Строка - ключ, выданный администратору ИБ для осуществления операции.
// 
// Возвращаемое значение:
//  Структура - данные абонента:
//    * Наименование - Строка - наименование абонента
//    * Код - Число - код абонента
//    * РольПользователя - ПеречислениеСсылка.РолиПользователейАбонентов - роль текущего пользователя абонента.
//
Функция АбонентЭтогоПриложения(Знач Пользователь = Неопределено, Знач Токен = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.АбонентЭтогоПриложения(Пользователь, Токен);

КонецФункции

// Возвращает список приложений, доступных пользователю.
// 
// Параметры:
//  Параметры - см. НовыйПараметрыПолученияПриложений.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - доступные приложения:
//   * Код - Число - код (номер) приложения
//   * Наименование - Строка - наименование
//   * КодАбонентаВладельца - Число - код абонента, владельца приложения
//   * КодКонфигурации - Строка - код конфигурации
//   * ВерсияКонфигурации - Строка - версия конфигурации
//   * НаименованиеКонфигурации - Строка - наименование конфигурации
//   * КодВидаПриложения - Строка - код вида приложения
//   * ИмяВидаПриложения - Строка - имя вида приложения
//   * НаименованиеВидаПриложения - Строка - наименование вида приложения
//   * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений - состояние приложения
//   * АдресПриложения - Строка - URL-адрес приложения
//   * КодЯзыкаПользователя - Строка - код языка пользователя в приложении
//   * ЧасовойПояс - Строка - часовой пояс приложения
//
Функция СписокПриложений(Параметры, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокПриложений(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает информацию об указанном приложении.
//
// Параметры:
//  КодПриложения - Строка - код приложения (номер области).
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - свойства приложения:
//   * Код - Число - код (номер) приложения
//   * Наименование - Строка- наименование
//   * КодАбонентаВладельца - Число - код абонента, владельца приложения
//   * КодКонфигурации - Строка - код конфигурации
//   * ВерсияКонфигурации - Строка - версия конфигурации
//   * НаименованиеКонфигурации - Строка - наименование конфигурации
//   * КодВидаПриложения - Строка - код вида приложения
//   * ИмяВидаПриложения - Строка - имя вида приложения
//   * НаименованиеВидаПриложения - Строка - наименование вида приложения
//   * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений - состояние приложения
//   * АдресПриложения - Строка - URL-адрес приложения
//   * КодЯзыкаПользователя - Строка - код языка пользователя в приложении
//   * ЧасовойПояс - Строка - часовой пояс приложения
//   * ВерсияПлатформы - Строка - версия платформы
//   * РазмерПриложения - Число - размер приложения
//   * ДатаРасчетаРазмераПриложения - Дата - дата расчета размера приложения
//
Функция СвойстваПриложения(КодПриложения, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваПриложения(КодПриложения, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список пользователей, которым разрешен доступ к указанному приложению.
//
// Параметры:
//  КодПриложения - Число - код приложения (номер области)
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пользователи, которым разрешен доступ:
//   * Логин - Строка - логин (имя) пользователя
//   * Право - ПеречислениеСсылка.ПраваПользователяПриложения - право пользователя на текущее приложение в менеджере сервиса.
//   * ТребуетсяНастройкаВПриложении - Булево - признак необходимости настройки прав пользователя в приложении.
//
Функция ПользователиПриложения(КодПриложения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПользователиПриложения(КодПриложения, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список пользователей, которым разрешен доступ к указанному приложению.
//
// Параметры:
//  Параметры - см. НовыйПараметрыЗапросаПользователейПриложенияАбонента.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - пользователи, которым разрешен доступ:
//   * Логин - Строка - логин (имя) пользователя
//   * Право - ПеречислениеСсылка.ПраваПользователяПриложения - право пользователя на текущее приложение в менеджере сервиса.
//   * ТребуетсяНастройкаВПриложении - Булево - признак необходимости настройки прав пользователя в приложении.
//
Функция ПользователиПриложенияАбонента(Параметры, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПользователиПриложенияАбонента(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Устанавливает пользователю с указанным логином доступ к указанному приложению 
// и назначает указанную роль для работы в приложении.
//
// Параметры:
//  ПараметрыДобавления - см. НовыйПараметрыДобавленияПользователяВПриложение
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат установки права доступа к приложению: Истина - право установлено, Ложь - произошла ошибка.
//
Функция ДобавитьПользователяВПриложение(ПараметрыДобавления, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ДобавитьПользователяВПриложение(ПараметрыДобавления,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Отменяет пользователю с указанным логином доступ к указанному приложению.
//
// Параметры:
//  Логин - Строка - Логин (Имя) пользователя.
//  КодПриложения - Число - код приложения (номер области)
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат отмены права доступа к приложению: Истина - право отменено, Ложь - произошла ошибка.
//
Функция УдалитьПользователяИзПриложения(Логин, КодПриложения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УдалитьПользователяИзПриложения(Логин, КодПриложения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Создает новое приложение с указанной прикладной конфигурацией.
//
// Параметры:
//  ПараметрыСоздания - см. НовыйПараметрыСозданияПриложения
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - результат создания приложения:
//  * Код - Число - код созданного приложения (номер области)
//  * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений - состояние приложения после создания.
//  * АдресПриложения - Строка - адрес созданного приложения.
//
Функция СоздатьПриложение(ПараметрыСоздания, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПриложение(ПараметрыСоздания, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Обновляет свойства приложения.
// Реализует метод внешнего программного интерфейса - tenant/update.
//
// Параметры:
//  Параметры - см. НовыйПараметрыОбновленияПриложения
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - результат создания приложения:
//  * Код - Число - код созданного приложения (номер области)
//  * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений - состояние приложения после создания.
//  * АдресПриложения - Строка - адрес созданного приложения.
//
Функция ОбновитьПриложение(Параметры, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ОбновитьПриложение(Параметры, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);
КонецФункции

// Создает новое приложение из указанного файла выгрузки.
//
// Параметры:
//  ПараметрыСоздания - см. НовыйПараметрыСозданияПриложенияИзФайлаВыгрузки
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура - результат создания приложения:
//  * Код - Число - код созданного приложения (номер области)
//  * СостояниеПриложения - ПеречислениеСсылка.СостоянияПриложений - состояние приложения после создания.
//  * АдресПриложения - Строка - адрес созданного приложения.
//
Функция СоздатьПриложениеИзФайлаВыгрузки(ПараметрыСоздания, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СоздатьПриложениеИзФайлаВыгрузки(ПараметрыСоздания,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Получает наименование для нового приложения.
//
// Параметры:
//  КодВидаПриложения - Строка - код вида приложения нового приложения.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Строка - наименование для установки новому приложению.
//
Функция НаименованиеНовогоПриложения(КодВидаПриложения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НаименованиеНовогоПриложения(КодВидаПриложения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Устанавливает новое наименование приложению.
//
// Параметры:
//  ПараметрыИзменения - см. НовыйПараметрыУстановкиНаименованияПриложение
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат установки наименования приложению: Истина - наименование установлено, Ложь - произошла ошибка.
//
Функция УстановитьНаименованиеПриложения(ПараметрыИзменения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УстановитьНаименованиеПриложения(ПараметрыИзменения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Устанавливает новый часовой пояс приложению.
//
// Параметры:
//  ПараметрыИзменения - см. НовыйПараметрыУстановкиЧасовогоПоясаПриложения
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат установки часового пояса приложению: Истина - установлено, Ложь - произошла ошибка.
//
Функция УстановитьЧасовойПоясПриложения(ПараметрыИзменения, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.УстановитьЧасовойПоясПриложения(ПараметрыИзменения,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список резервных копий приложения.
// Реализует метод внешнего программного интерфейса - tenant/backup/list.
//
// Возвращаемое значение:
//  ТаблицаЗначений - список резервных копий:
//   * ИдентификаторРК - Строка - идентификатор резервной копии, длина - 36
//   * МоментСозданияРК - Дата - момент создания резервной копии, ДатаВремя
//   * ДляТехПоддержки - Булево - признак создания резервной копии для тех. поддержки
//
Функция СписокРезервныхКопийПриложения() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокРезервныхКопийПриложения();

КонецФункции

// Возвращает список резервных копий приложения.
// Реализует метод внешнего программного интерфейса - tenant/backup/list.
//
// Параметры:
//  Параметры - см. НовыйПараметрыПолученияСпискаРезервныхКопийПриложенияАбонента
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений - список резервных копий:
//   * ИдентификаторРК - Строка - идентификатор резервной копии, длина - 36
//   * НомерОбласти - Число
//   * НаименованиеОбласти - Строка
//   * Размер - Число - размер файла
//   * ВерсияКонфигурации - Строка
//   * ИмяВидаПриложения - Строка
//   * Исходная - Булево
//   * ДатаСозданияUTC - Дата - дата создания в универсальном времени
//   * ПоТребованию - Булево
//   * Ежегодная - Булево
//   * Ежемесячная - Булево
//   * Ежедневная - Булево
//   * Комментарий - Строка
//   * ЧасовойПояс - Строка
//
Функция СписокРезервныхКопийПриложенияАбонента(Параметры, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СписокРезервныхКопийПриложенияАбонента(Параметры,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров создания приложения для метода ПрограммныйИнтерфейсСервиса.СоздатьПриложение.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания приложения:
//   * Наименование - Строка - наименование создаваемого приложения.
//   * КодКонфигурации - Строка - код конфигурации (вид приложения)
//   * ЧасовойПояс - Строка - рабочий часовой пояс приложения
//   * УстановитьПраваПриложений - Булево - необходимость установки прав на приложения.
//   * ПраваНаПриложения - ТаблицаЗначений - устанавливаемые права на приложения:
//     ** Логин - Строка - логин (имя пользователя)
//     ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - устанавливаемая роль пользователя.
Функция НовыйПараметрыСозданияПриложения() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыСозданияПриложения();

КонецФункции

// Возвращает шаблон параметров обновления приложения для метода ПрограммныйИнтерфейсСервиса.ОбновитьПриложение.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания приложения:
//   * КодПриложения - Число - код обновляемого приложения.
//   * Наименование - Строка - наименование приложения.
//   * ЧасовойПояс - Строка - рабочий часовой пояс приложения
//   * Пользователи - ТаблицаЗначений - устанавливаемые права на приложения:
//     ** Логин - Строка - логин (имя пользователя)
//     ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - устанавливаемая роль пользователя.
Функция НовыйПараметрыОбновленияПриложения() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыОбновленияПриложения();

КонецФункции

// Возвращает шаблон параметров создания приложения для метода ПрограммныйИнтерфейсСервиса.СоздатьПриложениеИзФайлаВыгрузки.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания приложения:
//   * ИдентификаторФайла - Строка - код конфигурации (вид приложения)
//   * Наименование - Строка - наименование создаваемого приложения.
//   * ЧасовойПояс - Строка - рабочий часовой пояс приложения
//   * Пользователи - ТаблицаЗначений - пользователи для сопоставления:
//     ** Логин - Строка - логин (имя пользователя).
//     ** Право - ПеречислениеСсылка.ПраваПользователяПриложения - устанавливаемая роль пользователя.
//     ** ИдентификаторПользователя - УникальныйИдентификатор - идентификатор пользователя из файла данных.
Функция НовыйПараметрыСозданияПриложенияИзФайлаВыгрузки() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыСозданияПриложенияИзФайлаВыгрузки();

КонецФункции

// Возвращает шаблон параметров добавления пользователя в приложение для метода
// ПрограммныйИнтерфейсСервиса.ДобавитьПользователяВПриложение.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//	 * КодПриложения - Число - номер приложения.
//	 * Логин - Строка - логин (имя пользователя) 
//   * Право - ПеречислениеСсылка.ПраваПользователяПриложения - право пользователя на приложение в менеджере сервиса 
//
Функция НовыйПараметрыДобавленияПользователяВПриложение() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыДобавленияПользователяВПриложение();

КонецФункции

// Возвращает шаблон параметров изменения наименования приложения для метода
// ПрограммныйИнтерфейсСервиса.УстановитьНаименованиеПриложения.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//   * КодПриложения - Число - код приложения (номер области)
//   * НазваниеПриложения - Строка - новое наименование приложения
//
Функция НовыйПараметрыУстановкиНаименованияПриложение() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыУстановкиНаименованияПриложение();

КонецФункции

// Возвращает шаблон параметров изменения наименования приложения для метода
// ПрограммныйИнтерфейсСервиса.УстановитьЧасовойПоясПриложения.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//   * КодПриложения - Число - код приложения (номер области)
//   * ЧасовойПояс - Строка - устанавливаемый часовой пояс
//
Функция НовыйПараметрыУстановкиЧасовогоПоясаПриложения() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыУстановкиЧасовогоПоясаПриложения();

КонецФункции

// Возвращает шаблон параметров для метода
// ПрограммныйИнтерфейсСервиса.ПользователиПриложенияАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//   * КодАбонента - Число - код абонента
//   * КодПриложения - Число - код приложения (номер области)
//   * Логин - Строка - фильтр по логину пользователя
//
Функция НовыйПараметрыЗапросаПользователейПриложенияАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыЗапросаПользователейПриложенияАбонента();

КонецФункции

// Возвращает шаблон параметров для метода
// ПрограммныйИнтерфейсСервиса.СписокРезервныхКопийПриложенияАбонента.
// 
// Возвращаемое значение:
//  Структура - шаблон параметров создания приложения:
//   * КодАбонента - Число - код абонента
//   * КодПриложения - Число - код приложения (номер области)
Функция НовыйПараметрыПолученияСпискаРезервныхКопийПриложенияАбонента() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияСпискаРезервныхКопийПриложенияАбонента();

КонецФункции

// Возвращает шаблон параметров для метода ПрограммныйИнтерфейсСервиса.СписокПриложений
//
// Возвращаемое значение:
//  Структура - шаблон параметров добавления пользователя в приложение:
//   * КодАбонента - Число - код абонента, если не указано, используется абонент текущего сеанса.
//   * Наименование - Строка - отбор по наименованию приложения
//   * КодыВидовПриложений - Массив из Строка - отбор по кодам видов приложений
//   * СостоянияПриложений - Массив из ПеречислениеСсылка.СостоянияПриложений - отбор по состояниям приложений
//
Функция НовыйПараметрыПолученияПриложений() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияПриложений();

КонецФункции

#КонецОбласти

#Область Tariff

// Возвращает информацию о тарифе сервиса по коду тарифа.
//
// Параметры:
//  КодТарифа - Строка - код тарифа.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - информация о тарифе:
//   * Код - Строка - код тарифа
//   * Наименование - Строка - наименование тарифа
//   * ОписаниеДляОбслуживающихОрганизаций - Строка - описание тарифа для обслуживающей организации.
//   * ОписаниеДляАбонентов - ФорматированныйДокумент - описание тарифа для абонентов.
//   * ДатаНачалаДействия - Дата - дата начала действия тарифа.
//   * ДатаОкончанияДействия - Дата - дата окончания действия тарифа.
//   * ПериодДействияПродлевающейПодписки - Число - период (в днях), в течение которого действует продлевающая подписка (если разрешено продление).
//   * ПериодДействияРасширяющейПодписки - Число - период (в днях), в течение которого действует расширяющая подписка.
//   * ПериодДобавленияПродлевающейПодписки - Число - период (в днях) после завершения действия подписки, в течение которого можно создать продлевающую подписку.
//   * РасширениеТарифа - Булево - признак, что тариф является расширением
//   * ТипТарифа - ПеречислениеСсылка.ТипыТарифов - тип тарифа
//   * Платный - Булево - признак, что тариф является платным (содержит платные периоды действия)
//   * Тестовый - Булево - признак, что тариф является тестовым
//   * ЕстьУсловие - Булево - признак, что для использования тарифа требуется соблюдение условия использования.
//   * ПериодическаяОплата - Булево - признак, что тариф использует периодическую оплату
//   * ПериодичностьОплаты - Строка - код периода периодичности оплаты
//   * Услуги - ТаблицаЗначений - услуги тарифа:
//     ** Код - Строка - код услуги
//     ** Наименование - Строка - Наименование услуги
//     ** ТипУслуги - ПеречислениеСсылка.ТипыУслуг - тип услуги
//     ** Описание - Строка - Описание услуги
//     ** КоличествоЛицензий - Число - количество лицензий на услугу, включенное в тариф
//     ** КоличествоДопЛицензийРасширяющейПодписки - Число - количество лицензий на услугу, которое может быть предоставлено расширяющей подпиской
//     ** ИдентификаторПоставщика - Строка - идентификатор поставщика услуги
//     ** НаименованиеПоставщика - Строка - наименование поставщика услуги
//   * Расширения - ТаблицаЗначений - расширения тарифа:
//     ** Код - Строка - код тарифа-расширения
//     ** Наименование - Строка - наименование тарифа-расширения
//   * Конфигурации - ТаблицаЗначений - конфигурации тарифа:
//     ** Код - Строка - код конфигурации
//     ** Наименование - Строка - имя конфигурации
//     ** Описание - Строка - описание конфигурации
//   * ПериодыДействия - ТаблицаЗначений - периоды действия тарифа:
//     ** Код - Строка - код периода действия
//     ** Наименование - Строка - наименование периода действия
//     ** Сумма - Число - стоимость
//     ** Комментарий - Строка - комментарий к периоду действия
//   * ПериодыОповещенийОбОкончанииПодписки - ТаблицаЗначений - периоды оповещений об окончании подписки на тариф:
//     ** КоличествоДней - Число - количество дней, когда оповещать пользователя.
//
Функция ТарифСервиса(КодТарифа, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ТарифСервиса(КодТарифа, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает список тарифов сервиса, доступных абоненту этого приложения.
// Параметры:
//  Отбор - см. НовыйОтборСпискаТарифов
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений - список тарифов сервиса:
//   * Код - Строка - код тарифа
//   * Наименование - Строка - наименование тарифа
//   * ОписаниеДляОбслуживающихОрганизаций - Строка - описание тарифа для обслуживающей организации.
//   * ОписаниеДляАбонентов - ФорматированныйДокумент - описание тарифа для абонентов.
//   * ДатаНачалаДействия - Дата - дата начала действия тарифа.
//   * ДатаОкончанияДействия - Дата - дата окончания действия тарифа.
//   * ПериодДействияПродлевающейПодписки - Число - период (в днях), в течение которого действует продлевающая подписка (если разрешено продление).
//   * ПериодДействияРасширяющейПодписки - Число - период (в днях), в течение которого действует расширяющая подписка.
//   * ПериодДобавленияПродлевающейПодписки - Число - период (в днях) после завершения действия подписки, в течение которого можно создать продлевающую подписку.
//   * РасширениеТарифа - Булево - признак, что тариф является расширением
//   * ТипТарифа - ПеречислениеСсылка.ТипыТарифов - тип тарифа
//   * Платный - Булево - признак, что тариф является платным (содержит платные периоды действия)
//   * Тестовый - Булево - признак, что тариф является тестовым
//   * ЕстьУсловие - Булево - признак, что для использования тарифа требуется соблюдение условия использования.
//   * ПериодическаяОплата - Булево - признак, что тариф использует периодическую оплату
//   * ПериодичностьОплаты - Строка - код периода периодичности оплаты
//   * ПериодыДействия - ТаблицаЗначений - периоды действия. Заполняется если передан параметр получения ПараметрПолученияПериодыДействия:
//     ** Код - Строка - код периода действия
//     ** Наименование - Строка - наименование периода действия
//     ** Сумма - Число - стоимость
//     ** Комментарий - Строка - комментарий к периоду действия
//
Функция ТарифыСервиса(Отбор = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ТарифыСервиса(Отбор, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон отбора списка тарифов провайдера.
// 
// Возвращаемое значение:
//  Структура:
//    * Наименование - Строка - отбор по части наименования
//    * ДоступныеТарифы - Массив из Строка - отбор тарифов по кодам доступных тарифов
//    * ПараметрыПолучения - Массив из Строка - может содержать параметры получения данных, возвращаемые методами
//     - см. ПараметрПолученияПериодыДействия
//     - см. ПараметрПолученияТолькоПлатные
//     - см. ПараметрПолученияТолькоРасширения
Функция НовыйОтборСпискаТарифов() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОтборСпискаТарифов();

КонецФункции

// Возвращает шаблон отбора списка тарифов обслуживающей организации.
// 
// Возвращаемое значение:
//  Структура:
//    * КодОбслуживающейОрганизации - Строка - код обслуживающей организации
//    * ДоступныеТарифы - Массив из Строка - отбор тарифов по кодам доступных тарифов
//    * ПараметрыПолучения - Массив из Строка - может содержать параметры получения данных, возвращаемые методами
//     - см. ПараметрПолученияПериодыДействия
//     - см. ПараметрПолученияТолькоРасширения
Функция НовыйОтборСпискаТарифовОбслуживающейОрганизации() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОтборСпискаТарифовОбслуживающейОрганизации()

КонецФункции
	
// Возвращает параметр получения тарифов "Периоды действия"
// 
// Возвращаемое значение:
//  Строка 
//
Функция ПараметрПолученияПериодыДействия() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПараметрПолученияПериодыДействия();

КонецФункции

// Возвращает параметр получения тарифов "Только платные"
// 
// Возвращаемое значение:
//  Строка 
Функция ПараметрПолученияТолькоПлатные() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПараметрПолученияТолькоПлатные();

КонецФункции

// Возвращает параметр получения тарифов "Только расширения"
// 
// Возвращаемое значение:
//  Строка 
Функция ПараметрПолученияТолькоРасширения() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПараметрПолученияТолькоРасширения();

КонецФункции

#КонецОбласти

#Область Subscription

// Возвращает список существующих подписок абонента текущего приложения.
//
// Параметры:
//  Отбор - см. НовыйОтборПодписокНаТарифы
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений - существующие подписки абонента:
//   * КодАбонента - Число - код (номер) абонента
//   * Номер - Строка - номер подписки
//   * Дата - Дата - дата регистрации подписки
//   * ТипПодписки - ПеречислениеСсылка.ТипыПодписокСервиса - тип подписки
//   * КодОбслуживающейОрганизации - Число - код (номер) абонента обслуживающей организации
//   * ДатаПодключения - Дата - дата подключения тарифа по подписке
//   * ДатаОтключения - Дата - дата отключения тарифа
//   * КодТарифа - Строка - код тарифа в подписке
//   * КодТарифаОбслуживающейОрганизации - Строка - код тарифа обслуживающей организации
//   * КодПериодаДействия - Строка - код периода действия
//   * Количество - Число - количество тарифов в подписке
//   * НомерОсновнойПодписки - Строка - номер основной подписки, если текущая подписка на тариф-расширение.
//   * НомерСчетаНаОплату - Строка - номер счета на оплату
//   * ИдентификаторСчетаНаОплату - УникальныйИдентификатор - идентификатор счета на оплату
//
Функция ПодпискиАбонента(Отбор = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПодпискиАбонента(Отбор, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Расширяет подписку абонента текущего приложения.
//
// Параметры:
//  НомерПодписки - Строка - номер основной подписки.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - свойства расширяющей подписки абонента:
//   * Номер - Строка - номер подписки
//
Функция РасширитьПодпискуАбонента(НомерПодписки, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.РасширитьПодпискуАбонента(НомерПодписки, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Продлевает подписку абонента текущего приложения.
//
// Параметры:
//  НомерПодписки - Строка - номер основной подписки.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - свойства продлевающей подписки абонента:
//   * Номер - Строка - номер подписки
//
Функция ПродлитьПодпискуАбонента(НомерПодписки, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПродлитьПодпискуАбонента(НомерПодписки, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон отбора подписок на тарифы обслуживаемых абонентов.
// 
// Возвращаемое значение:
//  Структура:
//   * КодОбслуживаемогоАбонента - Число - код (номер) обслуживаемого абонента 
//										   (не используется, если вызывается для метода ПодпискиАбонента)
//   * ТолькоАктивные - Булево - получение только активных подписок
//   * ТолькоОсновные - Булево - получение только основных подписок
//   * НачалоПериода - Дата - дата начала периода
//   * КонецПериода - Дата - дата конца периода
Функция НовыйОтборПодписокНаТарифы() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОтборПодписокНаТарифы();

КонецФункции

#КонецОбласти

#Область PromoCode

// Выполняет активацию указанного промо-кода для абонента текущего приложения.
//
// Параметры:
//  Промокод - Строка - используемый промокод.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат использования: Истина - промокод активирован, Ложь - произошла ошибка.
//
Функция ИспользоватьПромокод(Промокод, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ИспользоватьПромокод(Промокод, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Выполняет активацию указанного промо-кода для абонента текущего приложения.
//
// Параметры:
//  Промокод - Строка - используемый промокод.
//  Метка - Строка - дополнительная информация о промо-коде
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат использования: Истина - промокод активирован, Ложь - произошла ошибка.
//
Функция ИспользоватьПромокодСМеткой(Промокод, Метка, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ИспользоватьПромокодСМеткой(Промокод, Метка,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Активированные промокоды.
// 
// Параметры:
//  КодАбонента - Неопределено,Число - код абонента, для которого нужно получить промокоды, если значение неопределено, получается для абонента текущего приложения
//  ВызыватьИсключениеПриОшибке - Булево - Вызывать исключение при ошибке
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Активированные промокоды режим сервиса:
// * ДатаАктивации - Дата - Дата активации промокода
// * АктивированУспешно - Булево - Признак успешной активации
// * Промокод - Строка - Значение промокода 
Функция АктивированныеПромокоды(КодАбонента = Неопределено, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.АктивированныеПромокоды(КодАбонента, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции
#КонецОбласти

#Область Sessions

// Отправляет запрос на подготовку списка сеансов пользователей в приложениях.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - уникальный идентификатор запроса на получение списка сеансов (UUID).
//  КодыПриложений - Массив из Число - коды приложений для отбора.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Булево - Истина - признак успешного выполнения, Ложь - произошла ошибка.
Функция ПодготовитьСписокСеансов(ИдентификаторЗапроса, КодыПриложений = Неопределено,
	ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПодготовитьСписокСеансов(ИдентификаторЗапроса, КодыПриложений,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Проверяет готовность списка сеансов пользователей в приложениях, запрошенных ранее.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - уникальный идентификатор запроса на получение списка сеансов (UUID)
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Булево - Истина - список подготовлен, Ложь - список готовится или произошла ошибка.
Функция ПроверитьСписокСеансов(ИдентификаторЗапроса, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПроверитьСписокСеансов(ИдентификаторЗапроса,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Получает ранее запрошенный список сеансов пользователей в приложениях.
//
// Параметры:
//  ПараметрыПолученияСеансов - см. НовыйПараметрыПолученияСеансов
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - результат получения активных сеансов приложений:
//   * СписокСеансов - ТаблицаЗначений - список сеансов:
//    ** НомерОбласти - Число
//    ** НаименованиеОбласти - Строка
//    ** ИмяПользователя - Строка
//    ** НачалоСеанса - Дата
//    ** НомерСеанса - Дата
//    ** ИмяПриложения - Строка
//    ** Спящий - Булево
//    ** IPАдрес - Строка
//   * ПриложенияСОшибкойПолученияСеансов - ТаблицаЗначений - приложения, по которым не удалось получить список сеансов:
//    ** НомерОбласти - Число
//    ** НаименованиеОбласти - Строка
// 
Функция ПолучитьСеансы(ПараметрыПолученияСеансов, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПолучитьСеансы(ПараметрыПолученияСеансов, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Выполняет чтение сеансов в фоне, используя методы ПодготовитьСписокСеансов, ПроверитьСписокСеансов и ПолучитьСеансы.
// Метод нужно вызывать в фоновом задании.
//
// Параметры:
//  ПараметрыПолученияСеансов - см. НовыйПараметрыПолученияСеансов
//  Таймаут - Число - таймаут ожидания подготовки списка сеансов.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  Структура - результат получения активных сеансов приложений:
//   * СписокСеансов - ТаблицаЗначений - список сеансов:
//    * НомерОбласти - Число
//    * НаименованиеОбласти - Строка
//    * ИмяПользователя - Строка
//    * НачалоСеанса - Дата
//    * НомерСеанса - Дата
//    * ИмяПриложения - Строка
//    * Спящий - Булево
//    * IPАдрес - Строка
//   * ПриложенияСОшибкойПолученияСеансов - ТаблицаЗначений - приложения, по которым не удалось получить список сеансов
//    * НомерОбласти - Число
//    * НаименованиеОбласти - Строка
//
Функция ПолучитьСеансыВФоне(ПараметрыПолученияСеансов, Таймаут = 120) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ПолучитьСеансыВФоне(ПараметрыПолученияСеансов, Таймаут);

КонецФункции

// Выполняет завершение сеансов пользователей.
// 
// Параметры:
// 	КодПриложения -  Число - приложение, в котором нужно завершить сеансы
// 	НомераСеансов - Массив Из Число - номера сеансов, которые требуется завершить.
// 	Пользователь - СправочникСсылка.Пользователи - пользователь абонента,
// 	от имени которого выполняется операция или идентификатор администратора ИБ.
// 	Токен - Строка - секретный ключ, использующийся для выполнения операции от имени администратора ИБ
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
Процедура ЗавершитьСеансы(Знач КодПриложения, Знач НомераСеансов, Знач Пользователь = Неопределено,
	Знач Токен = Неопределено, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	ПрограммныйИнтерфейсСервисаСлужебный.ЗавершитьСеансы(КодПриложения, НомераСеансов, Пользователь, Токен,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецПроцедуры

// Возвращает шаблон параметров для методов 
// ПрограммныйИнтерфейсСервиса.ПолучитьСеансы, ПрограммныйИнтерфейсСервиса.ПолучитьСеансыВФоне
// 
// Возвращаемое значение:
//  Структура:
//   * ИдентификаторЗапроса - Строка - уникальный идентификатор запроса на получение списка сеансов (UUID)
//   * КодыПриложений - Массив из Число - коды приложений для отбора.
Функция НовыйПараметрыПолученияСеансов() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПолученияСеансов();

КонецФункции

#КонецОбласти

#Область Task

// Возвращает список активных задач пользователя из МС, относящихся к текущей области пользователя
// 
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//   
// Возвращаемое значение:
//  ТаблицаЗначений:
//	* НомерЗадачи - Строка - номер задачи
//	* НаименованиеЗадачи - Строка - номер задачи
Функция Задачи(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.Задачи(ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает описание задачи пользователя.
// 
// Параметры:
//  НомерЗадачи - Строка - номер задачи, для которой требуется получить данные.
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура:
//   * type - Строка - тип задачи
//   * author - Строка - автор задачи
//   * description - Строка - описание задачи
//   * tenant - Строка - Наименование приложения
//   * subscriber - Строка - Наименование ведущего абонента (Абонент ОО или ЛК)
//   * backup_type - Строка - вид запрашиваемой резервной копии (Для тех.поддержки или нет)
Функция СвойстваЗадачи(НомерЗадачи, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваЗадачи(НомерЗадачи, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Выполнение задачи пользователя, отказ или согласование.
//
// Параметры:
//  ПараметрыЗапроса - см. НовыйПараметрыПодтвержденияЗадачи
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Булево - результат выполнения задачи: Истина - задача выполнена, Ложь - произошла ошибка.
Функция ВыполнитьЗадачу(ПараметрыЗапроса, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ВыполнитьЗадачу(ПараметрыЗапроса, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров подтверждения задачи.
//
// Возвращаемое значение:
//  Структура:
//   * ПолученоСогласие - Булево - признак получения согласия на предоставление доступа.
//   * НомерЗадачи - Строка - номер подтверждаемой задачи.
//   * ДатаИстеченияДоступа - Дата - дата прекращения доступа к копии.
//   * ИдентификаторКопии - Строка - идентификатор существующей копии
//   * СуществующаяКопия - Булево - признак использования существующей копии.
Функция НовыйПараметрыПодтвержденияЗадачи() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыПодтвержденияЗадачи();

КонецФункции

#КонецОбласти

#Область Extension

// Получает список расширений для сопоставления.
//
// Параметры:
//  ПараметрыЗапроса - см. НовыйПараметрыЗапросаРасширенийДляСопоставления
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//   * Имя - Строка - Имя расширения
//   * ВнешнийИдентификатор - Строка - Идентификатор во внешней системе
//   * Владелец - Число - Код абонента владельца
//   * Наименование - Строка - Наименование расширения
//   * Версия - Строка - Версия расширения
//   * ИзменяетСтруктуруДанных - Булево - Расширение расширяет данные
//
Функция РасширенияДляСопоставления(ПараметрыЗапроса, ВызыватьИсключениеПриОшибке = Истина,
	ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.РасширенияДляСопоставления(ПараметрыЗапроса,
		ВызыватьИсключениеПриОшибке, ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров для метода ПрограммныйИнтерфейсСервиса.РасширенияДляСопоставления.
// 
// Возвращаемое значение:
//  Структура:
//   * ИмяКонфигурации - Строка - Имя конфигурации, как оно задано в конфигураторе
//   * КодВидаПриложения - Строка - Код вида приложения
//   * ВерсияКонфигурации - Строка - Версия конфигурации
//
Функция НовыйПараметрыЗапросаРасширенийДляСопоставления() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыЗапросаРасширенийДляСопоставления();

КонецФункции

#КонецОбласти

#Область Srv

#Область Files

// Получает параметры для составной загрузки.
//
// Параметры:
//  ИмяФайла - Строка 
//  РазмерФайла - Число
//  ТипФайла - Строка
//  Владелец - Произвольный
// 
// Возвращаемое значение:
//  Структура:
//    * ИдентификаторФайла - Строка
//    * Тип - Строка
//    * Адрес - Строка
//    * Заголовки - Соответствие из КлючИЗначение:
//      ** Ключ - Строка
//      ** Значение - Строка
Функция НачатьСоставнуюЗагрузку(ИмяФайла, РазмерФайла, ТипФайла, Владелец) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НачатьСоставнуюЗагрузку(ИмяФайла, РазмерФайла, ТипФайла, Владелец);

КонецФункции

// Получает параметры для новой части
//
// Параметры:
//  ИдентификаторФайла - Строка
//  НомерЧасти - Строка
// 
// Возвращаемое значение:
//  Структура:
//    * Тип - Строка
//    * Адрес - Строка
//    * Заголовки - Соответствие из КлючИЗначение:
//      ** Ключ - Строка
//      ** Значение - Строка
Функция НоваяЧасть(ИдентификаторФайла, НомерЧасти) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НоваяЧасть(ИдентификаторФайла, НомерЧасти);

КонецФункции

// Завершает составную загрузку
//
// Параметры:
//  ИдентификаторФайла - Строка
//  Части - Массив из Строка
Процедура ЗавершитьСоставнуюЗагрузку(ИдентификаторФайла, Части) Экспорт

	ПрограммныйИнтерфейсСервисаСлужебный.ЗавершитьСоставнуюЗагрузку(ИдентификаторФайла, Части);

КонецПроцедуры

// Отменяет составную загрузку
//
// Параметры:
//  ИдентификаторФайла - Строка
Процедура ОтменитьСоставнуюЗагрузку(ИдентификаторФайла) Экспорт

	ПрограммныйИнтерфейсСервисаСлужебный.ОтменитьСоставнуюЗагрузку(ИдентификаторФайла);

КонецПроцедуры

// Читает свойства загруженного файла.
//
// Параметры:
//  ПараметрыЧтения - см. НовыйПараметрыЧтенияСвойствФайла
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
// 
// Возвращаемое значение:
//  Структура:
//   * ИмяФайла - Строка
//   * Размер - Число
//   * ИмяКонфигурации - Строка - Имя конфигурации, как оно задано в конфигураторе
//   * КодВидаПриложения - Строка
//   * НаименованиеВидаПриложения - Строка
//   * ВерсияКонфигурации - Строка
//   * Пользователи - ТаблицаЗначений:
//    ** Логин - Строка
//    ** ПолноеИмя - Строка - полное имя пользователя
//    ** ИдентификаторПользователя - Строка
//   * Расширения - ТаблицаЗначений:
//    ** Имя - Строка
//    ** Наименование - Строка
//    ** Версия - Строка
//    ** ИзменяетСтруктуруДанных - Булево
Функция СвойстваФайла(ПараметрыЧтения, ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.СвойстваФайла(ПараметрыЧтения, ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

// Возвращает шаблон параметров чтения свойств файла для метода
// ПрограммныйИнтерфейсСервиса.СвойстваФайла
// 
// Возвращаемое значение:
//  Структура - параметры чтения свойств файла:
//   * ИдентификаторФайла - Строка
//   * ПрочитатьДанныеИзФайла - Булево
//
Функция НовыйПараметрыЧтенияСвойствФайла() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйПараметрыЧтенияСвойствФайла();

КонецФункции

#КонецОбласти

#Область ServiceManager

// Возвращает информацию о менеджере сервиса.
//
// Возвращаемое значение:
//  Структура:
//   * ВерсияМенеджераСервиса - Строка - номер версии менеджера сервиса.
//   * ЧасовойПоясМенеджераСервиса - Строка - часовой пояс менеджера сервиса.
//   * ВнешнийАдресМенеджераСервиса - Строка
//
Функция ИнформацияОМенеджереСервиса() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ИнформацияОМенеджереСервиса();

КонецФункции

#КонецОбласти

#КонецОбласти

#Область FAQ

// Возвращает список часто задаваемых вопросов.
// Реализует метод внешнего программного интерфейса - faq/list.
// 
// Параметры:
//  ВызыватьИсключениеПриОшибке - Булево - признак вызова исключения при ошибке получения данных.
//  ОсновныеСвойстваОтвета - Структура - возвращаемый параметр:
//   * КодСостояния - Число - код состояния ответа HTTP-сервиса.
//   * КодОтвета - Число - заполняется из ответа значением свойства "general.response".
//   * Сообщение - Строка - заполняется из ответа значением свойства "general.message".
//  
// Возвращаемое значение:
//  ТаблицаЗначений - часто задаваемые вопросы:
//   * Описание - Строка - описание вопроса.
//   * Гиперссылка - Строка - Ссылка на ответ на вопрос.
//
Функция ЧастоЗадаваемыеВопросы(ВызыватьИсключениеПриОшибке = Истина, ОсновныеСвойстваОтвета = Неопределено) Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ЧастоЗадаваемыеВопросы(ВызыватьИсключениеПриОшибке,
		ОсновныеСвойстваОтвета);

КонецФункции

#КонецОбласти

#Область Timezone

// Возвращает список часовых поясов.
// Реализует метод внешнего программного интерфейса - timezones/list.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - часто задаваемые вопросы:
//   * Идентификатор - Строка - идентификатор часового пояса.
//   * Представление - Строка - представление часового пояса.
//   * Смещение - Число - смещение в секундах относительно универсального времени.
//   * Основной - Булево - часовой пояс задан как основной в настройках сервиса.
//
Функция ЧасовыеПояса() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ЧасовыеПояса();

КонецФункции

#КонецОбласти

// Возвращает шаблон основных свойств ответа на запрос программного интерфейса.
// 
// Возвращаемое значение:
// 	Структура:
// * КодСостояния - Число - код состояния ответа вызова HTTP-сервиса.
// * КодОтвета - Число - код ответа программного интерфейса. 
// * Сообщение - Строка - сообщение программного интерфейса.
Функция НовыйОсновныеСвойстваОтвета() Экспорт

	Возврат ПрограммныйИнтерфейсСервисаСлужебный.НовыйОсновныеСвойстваОтвета();

КонецФункции

// Возвращает описание типа значения дополнительного свойства по имени.
//
// Параметры:
//  ИмяТипа - Строка - имя типа значения дополнительного свойства.
// 
// Возвращаемое значение:
//  ОписаниеТипов - описание типа значения.
Функция ТипЗначенияДополнительногоСвойстваПоИмени(ИмяТипа) Экспорт
	Возврат ПрограммныйИнтерфейсСервисаСлужебный.ТипЗначенияДополнительногоСвойстваПоИмени(ИмяТипа);
КонецФункции

// Заполняет список выбора типов значений дополнительных свойств.
//
// Параметры:
//  СписокВыбора - СписокЗначений из Строка - список выбора на форме.
Процедура ЗаполнитьСписокВыбораТиповЗначенийДополнительныхСвойств(СписокВыбора) Экспорт
	ПрограммныйИнтерфейсСервисаСлужебный.ЗаполнитьСписокВыбораТиповЗначенийДополнительныхСвойств(СписокВыбора);
КонецПроцедуры

// Заполняет условное оформление поля типа дополнительного свойства по значению.
//
// Параметры:
//  УсловноеОформление - УсловноеОформлениеКомпоновкиДанных - условное оформление формы.
//  ИмяРеквизита - Строка - имя реквизита формы
//  ИмяПоля - Строка - имя поля формы
//
Процедура УстановитьОформлениеПоляТипаДополнительногоСвойства(УсловноеОформление, ИмяРеквизита, ИмяПоля) Экспорт
	
	ПрограммныйИнтерфейсСервисаСлужебный.УстановитьОформлениеПоляТипаДополнительногоСвойства(УсловноеОформление, ИмяРеквизита, ИмяПоля)
		
КонецПроцедуры


#КонецОбласти