
#Область ПрограммныйИнтерфейс

// Подробнее
// См. ЗадачиБухгалтераСтатистика.ДоступнаЗагрузкаФормИзСервиса
//
Процедура ОпределитьЭтоИнтерфейсИнтеграцииСБанком(Признак) Экспорт
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистика.ВключитьРегламентноеЗаданиеПолучениеСпискаТребуемыхСтатФорм
//
Процедура ВключитьРегламентноеЗаданиеПолучениеСпискаТребуемыхСтатФорм(ПараметрыОбработчика) Экспорт
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистика.РеспондентыРосстата
//
Процедура УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса) Экспорт
	
	ЗарплатаКадры.УстановитьТекстЗапросаРеспондентыРосстата(ТекстЗапроса);
	
КонецПроцедуры

// Подробнее
// См. ЗадачиБухгалтераСтатистика.ЗаполнитьНастройкиОтчетовПоОтветуСервиса
//
Процедура ОпределитьОрганизациюПоРеспонденту(Организация, Респондент) Экспорт
	
	ЗарплатаКадры.ОпределитьОрганизациюПоРеспонденту(Организация, Респондент);
		
КонецПроцедуры

#КонецОбласти