#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗарплатаКадрыОтчеты.ПриКомпоновкеРезультатаВТабличныйДокумент(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ВывестиВОтчетДополнительныеПоляПредставлений(ЭтотОбъект, ДополнительныеПоляПредставлений());
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("Опрос"));
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ОпросПрофильДолжности"));
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("СтандартныйПериод"));
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Параметры;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриОпределенииПараметровВыбора.СвойстваНастройки
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если СвойстваНастройки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица") Тогда
		ЗначениеПараметраОпрос = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Опрос"));
		Если ЗначениеПараметраОпрос.Значение = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Не ЗначениеПараметраОпрос.Использование Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеПараметраОпрос.Значение = Тип("СписокЗначений") Тогда
			ОпросыПоКомпетенциям = ЗначениеПараметраОпрос.Значение.ВыгрузитьЗначения();
		Иначе
			ОпросыПоКомпетенциям = Новый Массив;
			ОпросыПоКомпетенциям.Добавить(ЗначениеПараметраОпрос.Значение);
		КонецЕсли;
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
			|ГДЕ
			|	ОпросыПоКомпетенциямОцениваемые.Ссылка В (&Опрос)";
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = ТекстЗапроса;
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("Опрос", ОпросыПоКомпетенциям);
	ИначеЕсли СвойстваНастройки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ОпросыПоКомпетенциям") Тогда
		ЗначениеПараметраПрофиль = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОпросПрофильДолжности"));
		ПрофильДолжности = ЗначениеПараметраПрофиль.Значение;
		ПрофильИспользуется = ЗначениеПараметраПрофиль.Использование;
		Если Не ПрофильИспользуется Тогда
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПрофильДолжности) Тогда
			Возврат;
		КонецЕсли;
		ЗначениеПериода = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")).Значение;
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОпросыПоКомпетенциям.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ОпросыПоКомпетенциям КАК ОпросыПоКомпетенциям
			|ГДЕ
			|	ОпросыПоКомпетенциям.ПрофильДолжности = &ПрофильДолжности
			|	И ОпросыПоКомпетенциям.ДатаНачала > &ДатаНачала
			|	И ОпросыПоКомпетенциям.ДатаОкончания < &ДатаОкончания";
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = ТекстЗапроса;
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ПрофильДолжности", ПрофильДолжности);
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ДатаНачала", ЗначениеПериода.ДатаНачала);
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ДатаОкончания", ЗначениеПериода.ДатаОкончания);
	КонецЕсли;
		
КонецПроцедуры

Функция ДополнительныеПоляПредставлений() Экспорт
	
	ДополнительныеПоляКадровыхДанныхСотрудников = КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников();
	
	ДополнительныеПоля = Новый Структура;
	ДополнительныеПоля.Вставить("Представления_КадровыеДанныеСотрудников", ДополнительныеПоляКадровыхДанныхСотрудников);
	
	Возврат ДополнительныеПоля;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли