#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СсылкаНовогоУзла(Пользователь, ТипСинхронизации) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	УзелПользователя = УзелПользователя(Пользователь, ТипСинхронизации);
	
	Если УзелПользователя = Неопределено Тогда
		НовыйУзел = СоздатьУзел();
		НовыйУзел.УстановитьНовыйКод();
		НовыйУзел.Пользователь = Пользователь;
		НовыйУзел.ТипСинхронизации = ТипСинхронизации;
		
		Если ТипСинхронизации = Перечисления.ТипыСинхронизацииКалендарей.MSExchange Тогда
			НовыйУзел.Включен = Истина;
			СтрокаКалендари = НовыйУзел.Календари.Добавить();
			СтрокаКалендари.Чтение = Истина;
			СтрокаКалендари.Изменение = Истина;
			СтрокаКалендари.Наименование = НСтр("ru = 'Календарь'");
			СтрокаКалендари.Идентификатор = "calendar";
		КонецЕсли;
	Иначе
		НовыйУзел = УзелПользователя.ПолучитьОбъект();
		НовыйУзел.УстановитьПометкуУдаления(Ложь);
		НовыйУзел.Календари.Очистить();
		НовыйУзел.Включен = Ложь;
	КонецЕсли;
	
	НовыйУзел.Наименование = Строка(ТипСинхронизации) + " " + Строка(Пользователь);
	НовыйУзел.Записать();
	
	Возврат НовыйУзел.Ссылка;

КонецФункции

Процедура ОчиститьУзел(Узел) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.Включен = Ложь;
	УзелОбъект.ВремяУведомленийИмпорт = 0;
	УзелОбъект.ВремяУведомленийЭкспорт = 0;
	УзелОбъект.ДатаПоследнейСинхронизации = Дата(1,1,1);
	УзелОбъект.СинхронизацияЗавершенаСОшибками = Ложь;
	УзелОбъект.ИнформацияОбОшибке = "";
	УзелОбъект.Календари.Очистить();
	УзелОбъект.Записать();
	УзелОбъект.УстановитьПометкуУдаления(Истина);

КонецПроцедуры

Процедура ЗаписатьРезультатыСинхронизации(РезультатыСинхронизации) Экспорт

	Если Не ЗначениеЗаполнено(РезультатыСинхронизации) Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СоответствиеУзел Из РезультатыСинхронизации Цикл
		УзелОбъект = СоответствиеУзел.Ключ.ПолучитьОбъект();
		УзелОбъект.ДатаПоследнейСинхронизации = ТекущаяДатаСеанса();
		УзелОбъект.ИнформацияОбОшибке = СоответствиеУзел.Значение.ОписаниеОшибки;
		УзелОбъект.СинхронизацияЗавершенаСОшибками = ЗначениеЗаполнено(УзелОбъект.ИнформацияОбОшибке);
		ТокеныСинхронизации = СоответствиеУзел.Значение.ТокеныСинхронизации;
		Если Не УзелОбъект.СинхронизацияЗавершенаСОшибками
			Или ЗначениеЗаполнено(ТокеныСинхронизации) Тогда
			Для Каждого СоответствиеКалендарь Из ТокеныСинхронизации Цикл
				НайденныеСтроки = УзелОбъект.Календари.НайтиСтроки(Новый Структура("Идентификатор", СоответствиеКалендарь.Ключ));
				Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
					НайденныеСтроки[0].ТокенСинхронизации = СоответствиеКалендарь.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		УзелОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

Функция УзелПользователя(Пользователь, ТипСинхронизации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СинхронизацияКалендарей.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.СинхронизацияКалендарей КАК СинхронизацияКалендарей
	|ГДЕ
	|	СинхронизацияКалендарей.Пользователь = &Пользователь
	|	И СинхронизацияКалендарей.ТипСинхронизации = &ТипСинхронизации
	|	И НЕ СинхронизацияКалендарей.ПометкаУдаления");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ТипСинхронизации", ТипСинхронизации);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли