////////////////////////////////////////////////////////////////////////////////
// Разбор резюме клиент.
// Клиентские процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик подключаемой команды. Получает вложение, выполняет проверки разбирает его и открывает форму нового кандидата.
//
// Параметры:
//  МассивОбъектов - Массив - массив объектов взаимодействия.
//  ДополнительныеПараметры - Структура - структура параметров команды.
//
Процедура СоздатьКандидатаПоВложениюПодключаемый(МассивОбъектов, ДополнительныеПараметры) Экспорт
	
	Письмо = ВыборПисьма(МассивОбъектов);
	Если Письмо = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьВыборВложения(Письмо, ДополнительныеПараметры.Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Процедура команды. Запускает диалог выбора файлов и передает дальше полученные файлы резюме для создания новых кандидата.
//
// Параметры:
//  УникальныйИдентификатор	 - УникальныйИдентификатор	 - уникальный идентификатор формы с которой была вызвана команда создания кандидата.
//  Вакансия				 - СправочникСсылка.Вакансии - вакансия из формы элемента которой создается кандидаты.
//  Файлы					 - Массив					 - содержит объекты типа ОписаниеПередаваемогоФайла.
//  Обработка				 - Булево					 - создание кандидатов в обработке ЗагрузкаКандидатовИзФайлов.
//
Процедура СоздатьКандидатовПоФайлам(УникальныйИдентификатор, Вакансия = Неопределено, Файлы = Неопределено, Обработка = Ложь) Экспорт
	
	Параметры = Новый Структура();
	Параметры.Вставить("Вакансия", Вакансия);
	Параметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	Параметры.Вставить("ЗакрытьФормуПослеЗагрузкиКандидатов", Истина);
	Параметры.Вставить("Обработка", Обработка);
	
	Если Файлы <> Неопределено Тогда
		Параметры.Вставить("ЗагружаемыеФайлы", Файлы);
	КонецЕсли;
	
	СоздатьКандидатовПоФайламПродолжение(Параметры);
	
КонецПроцедуры

// Процедура выбора способа разбора резюме с возможность последующего разбора резюме.
//
// Параметры:
//  ПредлагатьБольшеНеЗадаватьЭтотВопрос - Булево - видимость предложения больше не задавать вопрос.
//  Параметры - Структура - структура параметров для дальнейшего разбора резюме:
//                          ПомещенныеФайлы - Массив - файлы резюме.
//                          Вакансия - СправочникСсылка.Вакансии - вакансия из формы элемента которой создается кандидаты.
//                          УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор формы с которой была вызвана команда создания кандидата.
//                          ЗакрытьФормуПослеЗагрузкиКандидатов - Булево.
//
Процедура НачатьВыборСпособаРазбора(ПредлагатьБольшеНеЗадаватьЭтотВопрос, Параметры = Неопределено) Экспорт
	
	ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершитьВыборСпособаРазбора", ЭтотОбъект, Параметры);
	
	ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
	ПараметрыВопроса.Заголовок = НСтр("ru = 'Внешний сервис разбора резюме'");
	ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = ПредлагатьБольшеНеЗадаватьЭтотВопрос;
	
	ПараметрыВопроса.Картинка = БиблиотекаКартинок.Предупреждение32;
	
	ТекстВопроса = НСтр("ru = 'Разбор резюме может быть осуществлен с использованием внешнего сервиса.
		|Качество такого разбора выше, но нужно убедиться, что кандидат предоставил согласие на обработку персональных данных, включая передачу резюме третьим лицам.
		|Если согласия на передачу нет, то можно по-прежнему использовать встроенный в программу алгоритм разбора резюме.
		|Продолжить?'");
	
	КнопкиОтвета = Новый СписокЗначений();
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да, через сервис'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет, через внутренний разбор'"));
	КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
	
	СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(ОбработчикОтвета, ТекстВопроса, КнопкиОтвета, ПараметрыВопроса);
	
КонецПроцедуры

// Запускает процесс подключения компоненты работы с картинкой из макета.
//
// Параметры:
//  ОписаниеОповещения - ОписаниеОповещения - содержит процедуру и параметры для передачи результата подключения компоненты.
//
Процедура ПровестиИнициализациюВнешнихКомпонент(ОписаниеОповещения) Экспорт
	
	ПараметрыПодключения = ОбщегоНазначенияКлиент.ПараметрыПодключенияКомпоненты();
	ПараметрыПодключения.ТекстПояснения = НСтр("ru = 'Для получения картинки из буфера обмена необходимо установить компоненту.'");
	
	ОбщегоНазначенияКлиент.ПодключитьКомпонентуИзМакета(ОписаниеОповещения,
		"AddInNativeExtension", "ОбщийМакет.КомпонентаПолученияКартинкиИзБуфера", ПараметрыПодключения);
	
КонецПроцедуры

// Возвращает перечень расширений.
// 
// Возвращаемое значение:
//  Массив - массив строк с расширениями (например, ".doc").
//
Функция ДоступныеРасширения() Экспорт
	
	Расширения = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Расширения, РазборРезюмеКлиентСервер.РасширенияTXT());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Расширения, РазборРезюмеКлиентСервер.РасширенияPDF());
	Если ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() И Не ЭтоВебКлиент() Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Расширения, РазборРезюмеКлиентСервер.РасширенияWord());
	КонецЕсли;
	
	Возврат Расширения;
	
КонецФункции

// Определяет по имени файла, доступное ли у него расширение для разбора.
// 
// Параметры:
//  ИмяФайла - Строка - имя файла с расширение на конце
// 
// Возвращаемое значение:
//  Булево - Истина, если расширение является доступным для разбора
Функция ЭтоФайлСДоступнымРасширением(ИмяФайла) Экспорт
	Возврат ДоступныеРасширения().Найти(ВРег(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла))) <> Неопределено;
КонецФункции

// Возвращает факт использования веб клиента.
// 
// Возвращаемое значение:
//  Булево - это веб клиент.
//
Функция ЭтоВебКлиент() Экспорт
	
#Если ВебКлиент Тогда
	Возврат Истина;
#Иначе
	Возврат Ложь;
#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСВложением

// Создает кандидата из вложений с расширением из МассивДоступныхРасширений().
//
// Параметры:
//  Письмо - ДокументСсылка.ЭлектронноеПисьмоВходящее - входящее письмо.
//  УникальныйИдентификатор - УникальныйИдентификатор - уникальный идентификатор формы с которой была вызвана команда создания кандидата.
//
Процедура НачатьВыборВложения(Письмо, УникальныйИдентификатор)
	
	ОбрабатываемыеТипыВложений = ДоступныеРасширения();
	ОбрабатываемыеТипыВложений = СтрСоединить(ОбрабатываемыеТипыВложений,",");
	ОбрабатываемыеТипыВложений = СтрЗаменить(ОбрабатываемыеТипыВложений,".","");
	
	СписокВложений = РазборРезюмеВызовСервера.СписокВложений(Письмо, ОбрабатываемыеТипыВложений);
	
	Если СписокВложений.Количество() = 0 Тогда
		ТекстИсключения = НСтр("ru = 'В выбранном письме нет вложений обрабатываемых типов.'");
		ВызватьИсключение ТекстИсключения;		
	КонецЕсли;
	
	Вложение = СписокВложений[0].Значение;
	
	Параметры = Новый Структура;
	Параметры.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	Параметры.Вставить("Обработка", Ложь);
	
	Если СписокВложений.Количество() = 1 Тогда
		НачатьПолучениеВложения(Вложение, Параметры);
	Иначе
		СписокВложений.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения("ЗавершитьВыборВложения", ЭтотОбъект, Параметры),
			НСТр("ru = 'Выберите вложение'"));
	КонецЕсли;
	
КонецПроцедуры

// Обработчик завершения выбора файла резюме из вложения. Запускает процесс обработки файла из вложения.
//
// Параметры:
//  ВыбранныйЭлемент - ЭлементСпискаЗначений - выбранное вложение из предложенного списка.
//  ДополнительныеПараметры - Структура - структура параметров команды.
//
Процедура ЗавершитьВыборВложения(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьПолучениеВложения(ВыбранныйЭлемент.Значение, ДополнительныеПараметры);
	
КонецПроцедуры

// Начинает процесс работы с файлом-вложением. Разбирает текст резюме и открывает форму нового кандидата.
//
// Параметры: 
//  Вложение - СправочникСсылка.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы - файл для разбора.
//  ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
Процедура НачатьПолучениеВложения(Вложение, ДополнительныеПараметры)
	
	РаботаСФайламиКлиент.ПолучитьПрисоединенныйФайл(
		Новый ОписаниеОповещения("ЗавершитьПолучениеВложения", ЭтотОбъект, ДополнительныеПараметры),
		Вложение,
		ДополнительныеПараметры.УникальныйИдентификатор);
	
КонецПроцедуры

Процедура ЗавершитьПолучениеВложения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(Результат.ОписаниеОшибки) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Не удалось получить вложение из письма по причине:
			|%1'"), Результат.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖурналаРегистрации(), "Ошибка",
				ТекстСообщения,, Истина);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ЗагружаемыеФайлы", Результат.ПолноеИмяФайла);
	СоздатьКандидатовПоФайламПродолжение(ДополнительныеПараметры);
	
КонецПроцедуры

// Осуществляет выбор письма из массива писем.
//
// Параметры:
//  Письма - Массив - массив писем.
// 
// Возвращаемое значение:
//  ДокументСсылка.ЭлектронноеПисьмоВходящее - Первое письмо.
//
Функция ВыборПисьма(Письма)
	
	Если Письма.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Входящее письмо не выбрано. Выберите требуемое письмо.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(Письма[0]) <> Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		ТекстСообщения = НСтр("ru = 'Входящее письмо не выбрано. Выберите требуемое письмо.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Письма[0];
	
КонецФункции 

#КонецОбласти

#Область РаботаСWord

Процедура ПолучитьДанныеФайловWord(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат.Подключено Тогда
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖурналаРегистрации(), "Ошибка",
			Результат.ОписаниеОшибки,, Истина);
	КонецЕсли;
	
	ДанныеФайловWord = Новый Массив;
	ФайлыWord = ДополнительныеПараметры.ФайлыРезюме.ФайлыWord;
	Для Каждого ФайлWord Из ФайлыWord Цикл
		ДанныеФайлаWord = ОписаниеДанныхФайлаWord();
		ЗаполнитьДанныеФайлаWord(ДанныеФайлаWord, ФайлWord, Результат.Подключено);
		ДанныеФайловWord.Добавить(ДанныеФайлаWord);
	КонецЦикла;
	
	ДополнительныеПараметры.ФайлыРезюме.Удалить("ФайлыWord");
	
	РазборРезюмеПродолжение(ДополнительныеПараметры, ДанныеФайловWord)
	
КонецПроцедуры

Процедура ЗаполнитьДанныеФайлаWord(ДанныеФайлаWord, ФайлРезюме, ПодключенаКомпонента)
	
	Попытка
		ОбъектWord = Новый COMОбъект("Word.Application");
		ОбъектWord.WordBasic.DisableAutoMacros(1);
		ОбъектWord.Visible = 0;
	Исключение
		ОписаниеОшибки = НСтр("ru = 'Ошибка работы с приложением MS Word. Рекомендации:
				|Убедитесь, что на клиенте установлена программа Microsoft Word.
				|Подробности:'") + "
				|" + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
	Попытка
		Документ = ОбъектWord.Documents.Open(ФайлРезюме.ПолноеИмя,0,0,0,,,1,,,,,,,,1);
	Исключение
		ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Ошибка работы с приложением MS Word. Рекомендации:
		|1) Проверьте файл ""%1"", возможно он заблокирован и доступен только для чтения или поврежден.
		|2) Переустановите приложение MS Word или используйте более новую версию приложения.'"), ФайлРезюме.ИмяФайла);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		ОбъектWord.Quit();
		ОбъектWord = Неопределено;
		ВызватьИсключение ОписаниеОшибки;
	КонецПопытки;
	
	Документ.Activate();
	Selection = ОбъектWord.Selection;
	Selection.WholeStory();
	
	ДанныеФайлаWord.ТекстРезюме = РазборРезюмеКлиентСервер.ТекстПослеНормализации(ТекстИзФайлаWord(Selection));
	ДанныеФайлаWord.ИмяФайла = ФайлРезюме.ИмяФайла;
	ДанныеФайлаWord.Хранение = ФайлРезюме.Хранение;
	ДанныеФайлаWord.ИсточникИнформации = ИсточникИнформацииПоЛоготипу(Документ);
	Если ДанныеФайлаWord.ИсточникИнформации = Неопределено Тогда
		ДанныеФайлаWord.ИсточникИнформации = РазборРезюмеКлиентСервер.ИсточникИнформацииПоТексту(ДанныеФайлаWord.ТекстРезюме);
	КонецЕсли;
	
	Если ПодключенаКомпонента Тогда
		ДанныеФайлаWord.Фотография = ФотоИзФайлаWord(Selection, ОбъектWord, ФайлРезюме.ИмяФайла);
	КонецЕсли;
	
	Документ.Close(False);
	ОбъектWord.Quit();
	ОбъектWord = Неопределено;
	
КонецПроцедуры

Функция ТекстИзФайлаWord(Selection)
	
	ИзвлеченныйТекст = "";
	ИзвлеченныйТекст = Selection.Text;
	ИзвлеченныйТекст = СтрЗаменить(ИзвлеченныйТекст, Символы.ВТаб, Символы.ПС);
	
	Возврат ИзвлеченныйТекст;
	
КонецФункции

Функция ФотоИзФайлаWord(Selection, ОбъектWord, ИмяФайла)
	
	КэшированныеКомпоненты = ПараметрыПриложения["СтандартныеПодсистемы.ВнешниеКомпоненты.Объекты"];
	
	ОбъектДляРаботыСКартинкой = Неопределено;
	
	Если ТипЗнч(КэшированныеКомпоненты) = Тип("ФиксированноеСоответствие") Тогда
		ОбъектДляРаботыСКартинкой = КэшированныеКомпоненты.Получить("ОбщийМакет.КомпонентаПолученияКартинкиИзБуфера");
	КонецЕсли;
	
	Если ОбъектДляРаботыСКартинкой = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	InlineShapes = Selection.InlineShapes;
	Shapes = ОбъектWord.ActiveDocument.Shapes;
	
	ВставлятьКартинкуИзБуфера = Ложь;
	Если InlineShapes.Count > 0 Тогда
		InlineShapes.Item(1).Select();
		Попытка
			ОбъектWord.Selection.CopyAsPicture();
			ВставлятьКартинкуИзБуфера = Истина;
		Исключение
			ВставлятьКартинкуИзБуфера = Ложь;
			ОписаниеОшибки = СтрШаблон(
					НСтр("ru = 'Ошибка работы с приложением MS Word.
						|Извлечь фото из ""%1""  не удалось. Рекомендации:
						|1) Проверьте файл, возможно он доступен только для чтения или поврежден.'"), ИмяФайла);
					
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		КонецПопытки;
	ИначеЕсли Shapes.Count Тогда
		Shapes.Item(1).Select();
		Попытка
			ОбъектWord.Selection.CopyAsPicture();
			ВставлятьКартинкуИзБуфера = Истина;
		Исключение
			ВставлятьКартинкуИзБуфера = Ложь;
			ОписаниеОшибки = СтрШаблон(
					НСтр("ru = 'Ошибка работы с приложением MS Word.
						|Извлечь фото из ""%1""  не удалось. Рекомендации:
						|1) Проверьте файл, возможно он доступен только для чтения или поврежден.'"), ИмяФайла);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		КонецПопытки;
	КонецЕсли;
	
	Если ВставлятьКартинкуИзБуфера И ОбъектДляРаботыСКартинкой.Свойство("ПодключаемыйМодуль") Тогда
		Если ТипЗнч(ОбъектДляРаботыСКартинкой) = Тип("Структура")
			И ОбъектДляРаботыСКартинкой.Свойство("ПодключаемыйМодуль") Тогда
			ОбъектДляРаботыСКартинкой = ОбъектДляРаботыСКартинкой.ПодключаемыйМодуль;
		КонецЕсли;
		ПутьКФайлу = ОбъектДляРаботыСКартинкой.ПолучитьКартинкуИзБуфера();
		Если Не ПустаяСтрока(ПутьКФайлу) Тогда
			Возврат Новый Картинка(ПутьКФайлу);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИсточникИнформацииПоЛоготипу(Документ)
	
	ИсточникИнформации = Неопределено;
	Колонтитул = Документ.Sections.First.Headers.Item(2).Range;
	
	Если Колонтитул.InlineShapes.Count > 0 Тогда
		Логотип = Колонтитул.InlineShapes.Item(1);
		ИсточникИнформации = ИсточникИнформацииПоПараметрамЛоготипа(Логотип.Height, Логотип.Width);
	КонецЕсли;
	
	Возврат ИсточникИнформации;
	
КонецФункции

Функция ИсточникИнформацииПоПараметрамЛоготипа(Высота, Ширина)
	
	ВысотаОкр = Окр(Высота, 0, РежимОкругления.Окр15как20);
	ШиринаОкр = Окр(Ширина, 0, РежимОкругления.Окр15как20);
	
	Если (ВысотаОкр = 24 И ШиринаОкр = 43)
		ИЛИ (ВысотаОкр = 43 И ШиринаОкр = 43) Тогда
		
		Возврат ПредопределенноеЗначение("Справочник.ИсточникиИнформацииОКандидатах.HeadHunter");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОписаниеДанныхФайлаWord()
	
	Описание = Новый Структура(
		"ТекстРезюме,
		|ИсточникИнформации,
		|Фотография,
		|ИмяФайла,
		|Хранение");
		
	Возврат Описание;
	
КонецФункции

#КонецОбласти

Процедура СоздатьКандидатовПоФайламПродолжение(ДополнительныеПараметры)
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = ДополнительныеПараметры.УникальныйИдентификатор;
	Если ДополнительныеПараметры.Свойство("ЗагружаемыеФайлы") Тогда
		ПараметрыЗагрузки.Интерактивно = Ложь;
		ЗагружаемыеФайлы = ДополнительныеПараметры.ЗагружаемыеФайлы;
		ДополнительныеПараметры.Удалить("ЗагружаемыеФайлы");
	Иначе
		ПараметрыЗагрузки.Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выбор файла резюме'");
		ПараметрыЗагрузки.Диалог.Фильтр = СтрШаблон("(*%1;)|*%1;", СтрСоединить(ДоступныеРасширения(), ";*"));
		ПараметрыЗагрузки.Диалог.МножественныйВыбор = РазборРезюмеВызовСервера.ЕстьПраваНаЗагрузкуКандидатовИзФайлов();
		ЗагружаемыеФайлы = Неопределено;
	КонецЕсли;
	
	ФайловаяСистемаКлиент.ЗагрузитьФайлы(
		Новый ОписаниеОповещения("ЗавершитьСозданиеКандидатовПослеПомещенияФайлов", ЭтотОбъект, ДополнительныеПараметры),
		ПараметрыЗагрузки, ЗагружаемыеФайлы);
	
КонецПроцедуры

Процедура ЗавершитьСозданиеКандидатовПослеПомещенияФайлов(ПомещенныеФайлы, ПараметрыЗагрузки) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПомещенныхФайлов = ПомещенныеФайлы.Количество();
	Если КоличествоПомещенныхФайлов = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Не удалось выполнить загрузку резюме'");
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖурналаРегистрации(), "Ошибка",
			ТекстОшибки,, Истина);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	ФайлыРаботаНаКлиенте = Новый Массив;
	ФайлыPDF = Новый Массив;
	Для Каждого Файл Из ПомещенныеФайлы Цикл
		
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Файл.ИмяФайла);
		Если Не ЭтоФайлСДоступнымРасширением(Файл.ИмяФайла) Тогда
			ВызватьИсключение СтрШаблон(
				НСтр("ru = 'Файлы с расширением %1 не поддерживаются, см. файл ""%2"".'"), 
				РасширениеФайла, Файл.ИмяФайла);
		КонецЕсли;
		
		Если РазборРезюмеКлиентСервер.ЭтоФорматWord(РасширениеФайла) Тогда
			ФайлыРаботаНаКлиенте.Добавить(Файл);
		КонецЕсли;
		
		Если РазборРезюмеКлиентСервер.ЭтоФорматPDF(РасширениеФайла) Тогда
			ФайлыPDF.Добавить(Файл);
		КонецЕсли;
		
	КонецЦикла;
	
	ФайлыРаботаНаСервере = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПомещенныеФайлы, ФайлыРаботаНаКлиенте);
	
	Если ФайлыPDF.Количество() > 0 Тогда
		РазборРезюмеВызовСервера.ПроверитьКаталогMuPDF();
	КонецЕсли;
	
	ФайлыРезюме = Новый Структура;
	Если ФайлыРаботаНаКлиенте.Количество() > 0 Тогда
		ФайлыРезюме.Вставить("ФайлыWord", ФайлыРаботаНаКлиенте);
	КонецЕсли;
	Если ФайлыРаботаНаСервере.Количество() > 0 Тогда
		ФайлыРезюме.Вставить("ФайлыРаботаНаСервере", ФайлыРаботаНаСервере);
	КонецЕсли;
	
	Параметры = ПараметрыЗагрузки;
	Параметры.Вставить("ФайлыРезюме", ФайлыРезюме);
	
	ИспользоватьСервисСемантическогоАнализа = ИспользоватьСервисСемантическогоАнализа();
	Если Не ИспользоватьСервисСемантическогоАнализа Тогда
		СпособРазбораРезюме = РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнутреннийРазбор;
		НачатьРазборРезюме(СпособРазбораРезюме, Параметры);
		Возврат;
	КонецЕсли;
	
	ЗадаватьВопросПоИспользованиюСервиса = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиПользователя", "ЗадаватьВопросПоИспользованиюСервиса");
	
	Если ЗадаватьВопросПоИспользованиюСервиса <> Ложь Тогда
		НачатьВыборСпособаРазбора(Истина, Параметры);
	Иначе
		СпособРазбораРезюме = РазборРезюмеВызовСервера.СпособРазбораРезюме();
		НачатьРазборРезюме(СпособРазбораРезюме, Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершитьВыборСпособаРазбора(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ.Значение = КодВозвратаДиалога.Да Тогда
		СпособРазбораРезюме = РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнешнийСервис;
	ИначеЕсли Ответ.Значение = КодВозвратаДиалога.Нет Тогда
		СпособРазбораРезюме = РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнутреннийРазбор;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Ответ.БольшеНеЗадаватьЭтотВопрос Тогда
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
			"ЗадаватьВопросПоИспользованиюСервиса", Не Ответ.БольшеНеЗадаватьЭтотВопрос);
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("НастройкиПользователя",
		"СпособРазбораРезюме", СпособРазбораРезюме);
	РазборРезюмеВызовСервера.УстановитьСпособРазбораРезюме(СпособРазбораРезюме); 
		
	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачатьРазборРезюме(СпособРазбораРезюме, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура НачатьРазборРезюме(СпособРазбораРезюме, Параметры)
	
	Параметры.Вставить("СпособРазбораРезюме", СпособРазбораРезюме);
	Если Параметры.ФайлыРезюме.Свойство("ФайлыWord") 
		И Не ЭтоВебКлиент() 
		И ОбщегоНазначенияКлиент.ЭтоWindowsКлиент() Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПолучитьДанныеФайловWord", ЭтотОбъект, Параметры);
			ПровестиИнициализациюВнешнихКомпонент(ОписаниеОповещения);
	Иначе
		РазборРезюмеПродолжение(Параметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура РазборРезюмеПродолжение(Параметры, ДанныеФайловWord = Неопределено)
	
	ФайлыРезюме = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Параметры.ФайлыРезюме, "ФайлыРаботаНаСервере", Новый Массив);
	
	ХранениеФайлов = Новый Массив;
	Для Каждого ФайлРезюме Из ФайлыРезюме Цикл
		ХранениеФайлов.Добавить(Новый Структура("ИмяФайла,Хранение",
			ФайлРезюме.ИмяФайла, ФайлРезюме.Хранение));
	КонецЦикла;
	
	ДлительнаяОперация = РазборРезюмеВызовСервера.ДлительнаяОперацияРазбораРезюме(
		Параметры.УникальныйИдентификатор,
		ХранениеФайлов,
		ДанныеФайловWord,
		Параметры.СпособРазбораРезюме);
	
	Параметры.Удалить("ФайлыРезюме");
	Параметры.Удалить("СпособРазбораРезюме");
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет разбор резюме'");
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьРазборРезюме", ЭтотОбъект, Параметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

Процедура ЗавершитьРазборРезюме(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстИсключения = СтрШаблон(
			НСтр("ru = 'Не удалось выполнить разбор резюме по причине:
			|%1'"), Результат.КраткоеПредставлениеОшибки);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(СобытиеЖурналаРегистрации(), "Ошибка",
			ТекстИсключения,, Истина);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	СтруктураОтвета = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
		
	ПараметрыВызоваФормы = Новый Структура();
	Если СтруктураОтвета.ДанныеКандидатов.Количество() > 1 Или ДополнительныеПараметры.Обработка Тогда
		
		Если ДополнительныеПараметры.Свойство("ЗакрытьФормуПослеЗагрузкиКандидатов") Тогда
			ПараметрыВызоваФормы.Вставить("ЗакрытьФормуПослеЗагрузкиКандидатов", ДополнительныеПараметры.ЗакрытьФормуПослеЗагрузкиКандидатов);
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("Вакансия") Тогда
			ПараметрыВызоваФормы.Вставить("Вакансия", ДополнительныеПараметры.Вакансия);
		КонецЕсли;
		
		ОткрытьФорму("Обработка.ЗагрузкаКандидатовИзФайлов.Форма.ЗагрузкаКандидатовИзФайлов", ПараметрыВызоваФормы);
		Оповестить("ОбновитьДанныеКандидатов", СтруктураОтвета.ДанныеКандидатов)
	Иначе
		ДанныеКандидата = СтруктураОтвета.ДанныеКандидатов[0];
		ФайлРезюмеПараметры = ДанныеКандидата.ФайлРезюме;
		
		ПараметрыВызоваФормы.Вставить("ДанныеКандидата", ДанныеКандидата);
		
		ЗначенияЗаполнения = Новый Структура;
		Если ДополнительныеПараметры.Свойство("Вакансия") Тогда
			ЗначенияЗаполнения.Вставить("Вакансия", ДополнительныеПараметры.Вакансия);
		КонецЕсли;
		
		ПодборПерсоналаКлиент.ОткрытьФормуНовогоКандидата(
			ЗначенияЗаполнения, ПараметрыВызоваФормы, ФайлРезюмеПараметры.ИмяФайла);
	КонецЕсли;
	
	СтруктураОшибки = СтруктураОтвета.СтруктураОшибки;
	Если Не ПустаяСтрока(СтруктураОшибки.ОписаниеОшибки) Тогда
		
		Если СтруктураОшибки.ОшибкаСервиса Тогда
			СпособРазбораРезюме = РазборРезюмеКлиентСервер.СпособыРазбораРезюме().ВнутреннийРазбор;
			РазборРезюмеВызовСервера.УстановитьСпособРазбораРезюме(СпособРазбораРезюме);
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Разбор резюме произведен без помощи сервиса семантического анализа.
			|%1'"), СтруктураОшибки.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИспользоватьСервисСемантическогоАнализа()
	Возврат Ложь;
КонецФункции

// Имя событие для записи в журнал регистрации.
//
// Возвращаемое значение:
//  Строка - Имя события для записи в журнал регистрации.
//
Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Разбор резюме'", ОбщегоНазначенияКлиент.КодОсновногоЯзыка());
	
КонецФункции

#КонецОбласти 
