#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	
	РазделыДанных = Новый Массив;
	РазделыДанных.Добавить("УправленческиеДанные");
	РазделыДанных.Добавить("ПодборПерсонала");
	
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки, РазделыДанных);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеМероприятия(МероприятиеСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(МероприятиеСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Мероприятие", МероприятиеСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Наименование,
		|	ПометкаУдаления,
		|	Родитель,
		|	Ссылка,
		|	ЭтоГруппа,
		|	ВАрхиве,
		|	ВидМероприятия,
		|	Описание,
		|	СпособПроведения,
		|	ОбучениеСОтрывомОтПроизводства,
		|	КоличествоУчебныхЧасов,
		|	КоличествоСлушателей,
		|	МестоПроведения,
		|	СпособОпределенияСтоимости,
		|	Стоимость,
		|	УчебноеЗаведение,
		|	Преподаватель,
		|	Контрагент,
		|	ВидДокументаОбОбразовании,
		|	ПрисваиваемаяСпециальность,
		|	Квалификация,
		|	ФормаЗачета,
		|	ЗаключатьУченическийДоговор,
		|	Ответственный,
		|	ЭлектронныйКурс,
		|	ХарактеристикиПерсонала.(
		|		Ссылка,
		|		НомерСтроки,
		|		Характеристика),
		|	Обязательства.(
		|		Ссылка,
		|		НомерСтроки,
		|		ПериодРаботы,
		|		Сумма)
		|ИЗ
		|	Справочник.МероприятияОбученияРазвития
		|ГДЕ
		|	Ссылка = &Мероприятие";
		
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции

#КонецОбласти

#КонецЕсли