#Область ПрограммныйИнтерфейс

// Переопределяет возможность выполнения задачи текущим пользователем
// Подробнее
// См. КалендарьБухгалтера.ПравоВыполненияЗадачи
//
Процедура ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача) Экспорт
	
	ЗарплатаКадры.ПолучитьПравоВыполненияЗадачи(ЕстьПраво, Задача);
	
КонецПроцедуры 

// Подробнее
// См. КалендарьБухгалтера.СобытияКалендаряБухгалтера
//
Процедура ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач) Экспорт
	
	ЗарплатаКадры.ЗаполнитьСобытияКалендаряБухгалтера(ЗадачиОрганизаций, Организации, ОтборЗадач);
	
КонецПроцедуры

// Переопределяет количество просроченных не выполненных задач по организациям.
// Подробнее
// См. КалендарьБухгалтера.КоличествоПросроченныхСобытийКалендаряБухгалтера
//
// Параметры:
//   Организации - Массив организаций, по которым нужно определить количество просроченных задач.
//   ОтборЗадач - Структура - описывает отборы по типам задач, описание полей см. в НовыйНовыйОтборЗадачПоВидам
// Возвращаемое значение:
//   Соответствие - Соответствие, которое содержит в качестве ключа организацию, а в качестве значения - количество просроченных задач.
//
Процедура ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач) Экспорт
	
	ЗарплатаКадры.ПолучитьКоличествоПросроченныхСобытийКалендаряБухгалтера(КоличествоПросроченных, Организации, ОтборЗадач);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтера.ДанныеЗадачиБухгалтера
//
Процедура ПолучитьДанныеЗадачиБухгалтера(ДанныеЗадачиБухгалтера, Организация) Экспорт
	
	ЗарплатаКадры.ПолучитьДанныеЗадачиБухгалтера(ДанныеЗадачиБухгалтера, Организация);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтера.ЗаполнитьВФоне
//
Процедура ПриЗаполненииВФоне(Параметры, ВременноеХранилищеРезультата, Организация, ИзмененыРегулярныеЗадачи) Экспорт
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтера.ЗаполнитьРегламентнымЗаданием
//
Процедура ПриЗаполненииРегламентнымЗаданием() Экспорт
КонецПроцедуры

Процедура ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение = Ложь, Пользователь = Неопределено) Экспорт
	
	ЗарплатаКадры.ПолучитьОрганизацииДанныеКоторыхДоступныПользователю(ДоступныеОрганизации, ПравоНаИзменение, Пользователь);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПовтИсп.ДатаНачалаДеятельности
//
Процедура ПолучитьДатуНачалаДеятельности(Дата, Организация) Экспорт
	
	ЗарплатаКадры.ПолучитьДатуНачалаДеятельности(Дата, Организация);
	
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПовтИсп.ДатаЗакрытияОрганизации
//
Процедура ПолучитьДатуЗакрытияОрганизации(Дата, Организация) Экспорт
КонецПроцедуры

// Подробнее
// См. КалендарьБухгалтераПовтИсп.ДатаПостановкиНаУчетНалогоплательщика
//
Процедура ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода) Экспорт
	
	ЗарплатаКадры.ПолучитьДатуПостановкиНаУчетНалогоплательщика(Дата, Организация, КонецФинансовогоПериода);
	
КонецПроцедуры

#КонецОбласти
