#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьПараметрыНастроекМедрегистров");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

Процедура ОбновитьПараметрыНастроекМедрегистров(ПараметрыОбновления = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("РаботаВМедицинскомУчреждении") Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиВзаимодействияСФедеральнымиМедрегистрами.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать(); 
	Если НаборЗаписей.Количество() = 0 Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Запись.СпособПодключения) Тогда 
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);
		Возврат;
	КонецЕсли;
		
	Запись.СпособПодключения = ?(Запись.УдалитьИспользовать1СМедицинаРегион,
								Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.РегионЛокальный,
								Перечисления.СпособыПодключенияКФедеральнымМедрегистрам.ИПС);
	Если Запись.УдалитьИспользоватьТестовыйСервис Тогда 
		Запись.АдресСервиса = Запись.УдалитьАдресТестовогоСервиса;
		Запись.АдресСервиса1СМедицинаРегион = Запись.УдалитьАдресТестовогоСервиса1СМедицинаРегион;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", Истина);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли