#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоРазделамДанных(Настройки,
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеВопросов(ВопросИлиВопросы, ИзвлечьХранилищаЗначений = Ложь) Экспорт
	
	Если ТипЗнч(ВопросИлиВопросы) = Тип("Массив") Тогда
		МассивВопросов = ВопросИлиВопросы;
	Иначе		
		МассивВопросов = Новый Массив;
		МассивВопросов.Добавить(ВопросИлиВопросы);
	КонецЕсли;
	
	// Формируем таблицу вопросов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТестовыеВопросы.Задание КАК Задание,
		|	ТестовыеВопросы.ТипВопроса КАК ТипВопроса,
		|	ТестовыеВопросы.Ссылка КАК Ссылка,
		|	ТестовыеВопросы.Картинка КАК Картинка,
		|	ТестовыеВопросы.НаименованиеКолонкиЭлементов КАК НаименованиеКолонкиЭлементов,
		|	ТестовыеВопросы.НаименованиеКолонкиВариантов КАК НаименованиеКолонкиВариантов,
		|	ТестовыеВопросы.ОтветыВСлучайномПорядке
		|ИЗ
		|	Справочник.ТестовыеВопросы КАК ТестовыеВопросы
		|ГДЕ
		|	ТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ТестовыеВопросы.ЭтоГруппа = ЛОЖЬ
		|	И ТестовыеВопросы.Ссылка В (&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВопросов = Запрос.Выполнить().Выгрузить();
	
	Если ИзвлечьХранилищаЗначений Тогда
		ИзвлечьХранилищеЗначения(ТаблицаВопросов, "Задание", "ФорматированныйДокумент");
		ИзвлечьХранилищеЗначения(ТаблицаВопросов, "Картинка", "ДвоичныеДанные");		
	КонецЕсли;
	
	// Выбираем варианты ответов	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыОтветовНаТестовыеВопросы.Верный КАК Верный,
		|	ВариантыОтветовНаТестовыеВопросы.ТекстВарианта КАК ТекстВарианта,
		|	ВариантыОтветовНаТестовыеВопросы.Ссылка КАК Ссылка,
		|	ВариантыОтветовНаТестовыеВопросы.Код КАК Код,
		|	ВариантыОтветовНаТестовыеВопросы.Владелец КАК Вопрос,
		|	ВариантыОтветовНаТестовыеВопросы.Картинка КАК Картинка,
		|	ВариантыОтветовНаТестовыеВопросы.ОбластьНаКартинке КАК ОбластьНаКартинке,
		|	ВариантыОтветовНаТестовыеВопросы.НомерПоляВвода КАК НомерПоляВвода,
		|	ВариантыОтветовНаТестовыеВопросы.ЭтоЭлементСоответствия КАК ЭтоЭлементСоответствия,
		|	ВариантыОтветовНаТестовыеВопросы.ВариантыЭлементаСоответствия.(
		|		ВариантОтвета КАК ВариантОтвета
		|	) КАК ВариантыЭлементаСоответствия
		|ИЗ
		|	Справочник.ВариантыОтветовНаТестовыеВопросы КАК ВариантыОтветовНаТестовыеВопросы
		|ГДЕ
		|	ВариантыОтветовНаТестовыеВопросы.ПометкаУдаления = ЛОЖЬ
		|	И ВариантыОтветовНаТестовыеВопросы.Владелец В(&МассивВопросов)";
	
	Запрос.УстановитьПараметр("МассивВопросов", МассивВопросов);
	
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	
	Если ИзвлечьХранилищаЗначений Тогда
		ИзвлечьХранилищеЗначения(ТаблицаВариантов, "ТекстВарианта", "Строка");
		ИзвлечьХранилищеЗначения(ТаблицаВариантов, "Картинка", "ДвоичныеДанные");
	КонецЕсли;
	
	// Завершаем
	
	Возврат Новый Структура("Вопросы, Варианты", ТаблицаВопросов, ТаблицаВариантов);
	
КонецФункции

Процедура ИзвлечьХранилищеЗначения(ТаблицаДанных, ИмяКолонки, ИмяТипа)
	 
	ТипыКолонки = Новый Массив;
	ТипыКолонки.Добавить("Неопределено");
	ТипыКолонки.Добавить(ИмяТипа);
	
	МассивЗначенийКолонки = ТаблицаДанных.ВыгрузитьКолонку(ИмяКолонки);
	ТаблицаДанных.Колонки.Удалить(ИмяКолонки);
	ТаблицаДанных.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов(ТипыКолонки));
	Индекс = 0;
	Для каждого ЗначениеМассива Из МассивЗначенийКолонки Цикл	
		МассивЗначенийКолонки[Индекс] = ЗначениеМассива.Получить();
		Индекс = Индекс + 1;
	КонецЦикла;
	ТаблицаДанных.ЗагрузитьКолонку(МассивЗначенийКолонки, ИмяКолонки);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли




