#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КоманднаяПанельФормы;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗарплатаКадры.ПриСозданииНаСервереФормыСДинамическимСписком(ЭтотОбъект, "Список");
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список.Дата", Элементы.Дата.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	ЗаказыНаВыдачу = Строки.ПолучитьКлючи();
	
	Если ЗаказыНаВыдачу.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаказовНаВыдачу = ДанныеЗаказовНаВыдачу(ЗаказыНаВыдачу);
	
	КолонкаСостояниеВыдачи = Строки.Получить(ЗаказыНаВыдачу[0]).Оформление.Получить("СостояниеВыдачи");
	
	Для Каждого ДанныеЗаказа Из ДанныеЗаказовНаВыдачу Цикл
		СтрокаЗаказНаВыдачу = Строки.Получить(ДанныеЗаказа.ЗаказНаВыдачу);
		Если СтрокаЗаказНаВыдачу = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОформлениеСтроки = СтрокаЗаказНаВыдачу.Оформление;
		Если КолонкаСостояниеВыдачи <> Неопределено Тогда
			Если ЗначениеЗаполнено(ДанныеЗаказа.ВыданоСИЗ) Тогда
				Если ДанныеЗаказа.ВыданоСИЗ = ДанныеЗаказа.ВсегоСИЗ Тогда
					СостояниеВыдачи = НСтр("ru = 'Спецодежда выдана'");
					ОформлениеСтроки["СостояниеВыдачи"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветАкцента);
				Иначе
					СостояниеВыдачи = НСтр("ru = 'Спецодежда выдана частично'");
					ОформлениеСтроки["СостояниеВыдачи"].УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаВнимание);
				КонецЕсли;
			Иначе
				СостояниеВыдачи = НСтр("ru = 'Спецодежда не выдана'");
			КонецЕсли;
			ОформлениеСтроки["СостояниеВыдачи"].УстановитьЗначениеПараметра("Текст", СостояниеВыдачи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, Настройки);
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	ЗарплатаКадры.ПроверитьПользовательскиеНастройкиДинамическогоСписка(ЭтотОбъект, , СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеЗаказовНаВыдачу(ЗаказыНаВыдачу)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ЗаказыНаВыдачу", ЗаказыНаВыдачу);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаВыдачуСИЗСИЗ.Ссылка КАК Ссылка,
	|	ЗаказНаВыдачуСИЗСИЗ.СИЗ КАК СИЗЗаказа,
	|	ЗаказНаВыдачуСИЗРабочиеМеста.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТСИЗЗаказовНаВыдачу
	|ИЗ
	|	Документ.ЗаказНаВыдачуСИЗ.РабочиеМеста КАК ЗаказНаВыдачуСИЗРабочиеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВыдачуСИЗ.НоменклатураСИЗ КАК ЗаказНаВыдачуСИЗСИЗ
	|		ПО ЗаказНаВыдачуСИЗРабочиеМеста.Ссылка = ЗаказНаВыдачуСИЗСИЗ.Ссылка
	|			И ЗаказНаВыдачуСИЗРабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ЗаказНаВыдачуСИЗСИЗ.ИдентификаторСтрокиРабочегоМеста
	|			И (ЗаказНаВыдачуСИЗРабочиеМеста.Ссылка В (&ЗаказыНаВыдачу))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	СИЗЗаказа,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачиСИЗПоНоменклатуре.ОснованиеВыдачи КАК ЗаказНаВыдачу,
	|	ВыдачиСИЗПоНоменклатуре.СИЗ КАК СИЗ,
	|	ВыдачиСИЗПоНоменклатуре.РезультатВыдачи КАК РезультатВыдачи,
	|	ВыдачиСИЗПоНоменклатуре.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТВыданныеСИЗ
	|ИЗ
	|	РегистрСведений.ВыдачиСИЗПоНоменклатуре.СрезПоследних(&ДатаАктуальности, ОснованиеВыдачи В (&ЗаказыНаВыдачу)) КАК ВыдачиСИЗПоНоменклатуре
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказНаВыдачу,
	|	СИЗ,
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаВыдачуСИЗ.Ссылка КАК ЗаказНаВыдачу,
	|	СУММА(ВЫБОР
	|			КОГДА ВыданныеСИЗ.РезультатВыдачи = ЗНАЧЕНИЕ(Перечисление.РезультатыВыдачиСИЗ.Выдано)
	|					ИЛИ ВыданныеСИЗ.РезультатВыдачи = ЗНАЧЕНИЕ(Перечисление.РезультатыВыдачиСИЗ.СрокНоскиПродлен)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВыданоСИЗ,
	|	КОЛИЧЕСТВО(СИЗЗаказовНаВыдачу.СИЗЗаказа) КАК ВсегоСИЗ
	|ИЗ
	|	Документ.ЗаказНаВыдачуСИЗ КАК ЗаказНаВыдачуСИЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСИЗЗаказовНаВыдачу КАК СИЗЗаказовНаВыдачу
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТВыданныеСИЗ КАК ВыданныеСИЗ
	|			ПО СИЗЗаказовНаВыдачу.Ссылка = ВыданныеСИЗ.ЗаказНаВыдачу
	|				И СИЗЗаказовНаВыдачу.СИЗЗаказа = ВыданныеСИЗ.СИЗ
	|				И СИЗЗаказовНаВыдачу.ФизическоеЛицо = ВыданныеСИЗ.ФизическоеЛицо
	|		ПО ЗаказНаВыдачуСИЗ.Ссылка = СИЗЗаказовНаВыдачу.Ссылка
	|ГДЕ
	|	ЗаказНаВыдачуСИЗ.Ссылка В(&ЗаказыНаВыдачу)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаВыдачуСИЗ.Ссылка";
		
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти