#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого ЗначениеПеречисления Из Метаданные.Перечисления.ТипыНоменклатуры.ЗначенияПеречисления Цикл
		Имя = ЗначениеПеречисления.Имя;
		Элементы["ТипНоменклатуры" + Имя].Подсказка = Перечисления.ТипыНоменклатуры.ПодсказкаПоТипуНоменклатуры(
			ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры." + Имя));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Новый Структура("ТипНоменклатуры");
	
	Результат.ТипНоменклатуры = ТипНоменклатуры;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти