////////////////////////////////////////////////////////////////////////////////
// Модуль содержит общие процедуры и функции для перехода на интерфейс 8.5.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьТипОтображенияРедактируемойЯчейкиТабличногоДокумента(ТабличныйДокумент) Экспорт
	
	Для Каждого ОбластьТабличногоДокумента Из ТабличныйДокумент.Области Цикл
		
		Если ОбластьТабличногоДокумента.Защита = Ложь Тогда
			
			ОбластьТабличногоДокумента.ТипОтображенияРедактируемойЯчейки =
				ТипОтображенияРедактируемойЯчейкиТабличногоДокумента.Обычный;
			
		КонецЕсли;
		
	КонецЦикла;
	 
КонецПроцедуры

Процедура УстановитьСпособОтображенияКоманднойПанелиФормы(ЭлементФормы) Экспорт
	
	ЭлементФормы.СпособОтображения = СпособОтображенияКоманднойПанелиФормы.КоманднаяПанель;
	
КонецПроцедуры


// Устанавливает вариант отображения меню действий строки таблицы формы.
//
// Параметры
//		ТаблицаФормы - ТаблицаФормы 
//		СтрТипОтображения - Строка. 
//							Возможные значения : "Авто", "НеОтображать", "ОтображатьПриНаведении";
Процедура УстановитьТипОтображенияДействийСтрокиТаблицыФормы(Таблица, СтрТипОтображения) Экспорт
	
	Если ТипЗнч(СтрТипОтображения) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ
			(
				СтрТипОтображения = "Авто"
				ИЛИ
				СтрТипОтображения = "НеОтображать"
				ИЛИ
				СтрТипОтображения = "ОтображатьПриНаведении"
			)
		Тогда
		Возврат;
	КонецЕсли;
	
	Таблица.ТипОтображенияДействийСтроки = ТипОтображенияДействийСтроки[СтрТипОтображения];

КонецПроцедуры

Процедура УстановитьРазмерТекстаПоляВвода(ЭлементПоляВвода, Масштаб) Экспорт
	
	ЭлементПоляВвода.РазмерТекста = РазмерТекстаПоляВвода.Обычный;
	
	Если Масштаб <= 80 Тогда
	
		ЭлементПоляВвода.РазмерТекста = РазмерТекстаПоляВвода.Уменьшенный;
		
	ИначеЕсли Масштаб >= 120 Тогда
		
		ЭлементПоляВвода.РазмерТекста = РазмерТекстаПоляВвода.Увеличенный;
	
	КонецЕсли;

КонецПроцедуры

Процедура ОтображатьГруппуКакКарточку(ГруппаФормы) Экспорт

	ГруппаФормы.ОтображатьКакКарточку = Истина;

КонецПроцедуры

Процедура АвтоМаксимальнаяВысотаКарточкиТаблицыФормы(ТаблицаФормы, Значение = Ложь) Экспорт

	ТаблицаФормы.АвтоМаксимальнаяВысотаКарточки = Значение;

КонецПроцедуры

Процедура МаксимальнаяВысотаКарточкиТаблицыФормы(ТаблицаФормы, Значение = 0) Экспорт

	ТаблицаФормы.МаксимальнаяВысотаКарточки = Значение;

КонецПроцедуры

Процедура КартинкаПоляВвода(ПолеВвода, Картинка) Экспорт

	ПолеВвода.Картинка = Картинка;

КонецПроцедуры

Процедура АвтоШиринаВТаблице(ПолеФормы, СтрТипАвтоШирины) Экспорт

	ПолеФормы.АвтоШиринаВТаблице = АвтоШиринаВТаблице[СтрТипАвтоШирины];

КонецПроцедуры

#КонецОбласти