#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Письмо
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПисьмоОбменСБанками";
	КомандаПечати.Идентификатор = "ПисьмоОбменСБанками";
	КомандаПечати.Представление = НСтр("ru = 'Печать'");
	КомандаПечати.Картинка = БиблиотекаКартинок.Печать;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив из ДокументСсылка.ПисьмоОбменСБанками
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений из ДокументСсылка.ПисьмоОбменСБанками
//   Представление списка - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПисьмоОбменСБанками") Тогда
		ТабличныйДокумент = СформироватьПисьмо(МассивОбъектов, ОбъектыПечати);
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		НазваниеМакета = СтрШаблон("Документ.ПисьмоОбменСБанками.ПФ_MXL_Письмо_%1", КодОсновногоЯзыка);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПисьмоОбменСБанками",
			НСтр("ru='Письмо'"), ТабличныйДокумент, , НазваниеМакета);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий") Тогда
		Шаблон = НСтр("ru = 'Входящее письмо из банка №%1 от %2'");
		Номер = Данные.ВходящийНомер;
	Иначе
		Шаблон = НСтр("ru = 'Исходящее письмо в банк №%1 от %2'");
		Если ЗначениеЗаполнено(Данные.ИсходящийНомер) Тогда
			Номер = Строка(Данные.ИсходящийНомер);
		Иначе
			Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер);
		КонецЕсли;
	КонецЕсли;
	
	Представление = СтрШаблон(Шаблон, Номер, Данные.Дата);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Направление");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВходящийНомер");
	Поля.Добавить("ИсходящийНомер");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Неопределено;
	Если Параметры.Свойство("Ключ", СсылкаНаДокумент) Тогда
		Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Статус");
		СтатусыРедактированияПисьма = СтатусыРедактированияПисьма();
		Если СтатусыРедактированияПисьма.Найти(Статус) = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ПисьмоИзБанка";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Формирует представление документа ПисьмоОбменСБанками в формате HTML.
//
// Параметры:
//  Параметры - Структура - Структура со свойствами:
//		* Банк - СправочникСсылка.КлассификаторБанков - ссылка на банк-отправитель.
//		* Организация - СправочникСсылка.Организации - ссылка на организацию-получатель.
//		* ДатаПисьма - Дата - дата (со временем) получения письма.
//		* Тема - Строка - тема письма.
//		* Текст - Строка - текст письма.
//		* Направление - ПеречислениеСсылка.НаправленияЭДО - направление письма ЭДО.
//		* Статус - ПеречислениеСсылка.СтатусыОбменСБанками - необязательный параметр, статус ЭД обмена с банком.
// 
// Возвращаемое значение:
//  Строка - представление письма в формате HTML.
//
Функция СформироватьПредставлениеДокументаВHTML(Параметры) Экспорт

	ШаблонДокумента = 
		"<!DOCTYPE html PUBLIC ""-//W3C//DTD HTML 4.0 Transitional//EN"">
		|<html>
		|<head>
		|	<style class=""v8doc-style"" type=""text/css"">
		|		body{
		|			font-size:12pt;
		|			overflow: auto;
		|		}
		|		.v8doc-mail-header{
		|			font-size:13pt;
		|			line-height:15pt;
		|			margin-bottom: 5pt;
		|		}
		|		.v8doc-mail-information{
		|			font-size:10pt;
		|			line-height:12pt;
		|		}
		|	</style>
		|</head>
		|<body style=""margin-top:1px; padding-top:1px"">
		|	<table width=""100%%"">
		|    <tr>
		|      <td valign=""top"" width=""100%%"" colspan=""2"">
		|        <div id=""Subject"" class=""v8doc-mail-header""><b>%1</b></div>
		|        <div id=""From"" class=""v8doc-mail-header"">%2</div>
		|        <div id=""Date"" class=""v8doc-mail-information"">%3</div>
		|      </td>
		|  </tr>
		|  <tr>
		|    <td width=""70%%"" valign=""bottom"">
		|      <div id=""InfoKomu"" class=""v8doc-mail-information"" style=""display: block; margin-top: 20px;"">
		|        <span style=""display: block;""><b>Кому: </b><a href=""#%4"">%5</a></span>
		|      </div>
		|    </td>
		|    <td width=""30%%"" valign=""bottom"" align=""right"">
		|      <span style=""display: block;"">%6</span>
		|    </td>
		|  </tr>
		|  <tr>
		|    <td width=""100%%"" colspan=""2"">
		|      <hr>
		|    </td>
		|  </tr>
		|  <tr>
		|    <td width=""100%%"" colspan=""2"">
		|    <div>%7</div>
		|    </td>
		|  </tr>
		|</table>
		|</body></html>";
	
	СтрокиСТегами = СтрЗаменитьПоРегулярномуВыражению(Параметры.Текст, "^", "<div>", , Истина);
	СтрокиСТегами = СтрЗаменитьПоРегулярномуВыражению(СтрокиСТегами, "$", "</div>", , Истина);
	ФорматированнаяДата = Формат(Параметры.Дата, "ДФ='dd.MM.yyyy hh:mm'");
	
	ТекстСтатусаЭД = "";
	ВыводитьСтатусЭД = Параметры.Свойство("Статус");
	Если ВыводитьСтатусЭД Тогда
		ТекстСтатусаЭД = СтрШаблон(НСтр("ru = '<b>Статус ЭД: </b>%1'"), Параметры.Статус);
	КонецЕсли;
	
	Если Параметры.Направление = Перечисления.НаправленияЭДО.Исходящий Тогда
		Отправитель = Параметры.Организация;
		Получатель = Параметры.Банк;
	Иначе
		Отправитель = Параметры.Банк;
		Получатель = Параметры.Организация;
	КонецЕсли;
	
	СсылкаНаПолучателя = ПолучитьНавигационнуюСсылку(Получатель);
	
	Результат = СтрШаблон(ШаблонДокумента, Параметры.Тема, Отправитель,
		ФорматированнаяДата, СсылкаНаПолучателя, Получатель, ТекстСтатусаЭД, СтрокиСТегами);
	
	Возврат Результат;
	
КонецФункции

// Возвращает статусы письма, при которых оно может редактироваться.
// 
// Возвращаемое значение:
//  Массив - массив перечислений СтатусыОбменСБанками. 
//
Функция СтатусыРедактированияПисьма() Экспорт
	
	Результат = Новый Массив;       
	Результат.Добавить(Перечисления.СтатусыОбменСБанками.ПустаяСсылка()); 
	Результат.Добавить(Перечисления.СтатусыОбменСБанками.Черновик);  
	Результат.Добавить(Перечисления.СтатусыОбменСБанками.ПодготовленКОтправке);
	Результат.Добавить(Перечисления.СтатусыОбменСБанками.НеПодтвержден);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьЗаголовокФормы(Письмо) Экспорт
	
	СоответствиеНаправлений = Новый Соответствие;
	СоответствиеНаправлений.Вставить(Перечисления.НаправленияЭДО.Исходящий, НСтр("ru='Исходящее письмо'"));
	СоответствиеНаправлений.Вставить(Перечисления.НаправленияЭДО.Входящий, НСтр("ru='Входящее письмо'"));
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Письмо, "Тема, Направление, Статус");
	Направление = СоответствиеНаправлений.Получить(Реквизиты.Направление);
	Если Реквизиты.Статус = Перечисления.СтатусыОбменСБанками.Черновик Тогда
		Направление = НСтр("ru='Черновик'");
	КонецЕсли;
	
	Возврат СтрШаблон("%1 (%2)", Реквизиты.Тема, Направление);
	
КонецФункции

// Формирует печатную форму письма для обмена с банками.
//
// Параметры:
//   ПисьмоОбменСБанками - ДокументСсылка.ПисьмоОбменСБанками - ссылка на документ
//
// Возвращаемое значение:
//   ТабличныйДокумент - сформированная печатная форма письма
//
Функция ПечатнаяФормаПисьма(ПисьмоОбменСБанками) Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПисьмоОбменСБанками);
	ОбъектыПечати = Новый СписокЗначений;
	ТабличныйДокумент = СформироватьПисьмо(МассивОбъектов, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПисьмо(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПисьмоОбменСБанками";
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	НазваниеМакета = СтрШаблон("Документ.ПисьмоОбменСБанками.ПФ_MXL_Письмо_%1", КодОсновногоЯзыка);
	Макет = УправлениеПечатью.МакетПечатнойФормы(НазваниеМакета);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПисьмоОбменСБанками.Номер КАК Номер,
	               |	ПисьмоОбменСБанками.Дата КАК Дата,
	               |	ПисьмоОбменСБанками.Организация КАК Организация,
	               |	ПисьмоОбменСБанками.Банк КАК Банк,
	               |	ПисьмоОбменСБанками.Тема КАК Тема,
	               |	ПисьмоОбменСБанками.ТипПисьма КАК ТипПисьма,
	               |	ПисьмоОбменСБанками.Текст КАК Текст,
	               |	ПисьмоОбменСБанками.Направление КАК Направление,
	               |	ПисьмоОбменСБанками.ВходящийНомер КАК ВходящийНомер,
	               |	ПисьмоОбменСБанками.ВходящаяДата КАК ВходящаяДата,
	               |	ПисьмоОбменСБанками.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПисьмоОбменСБанками КАК ПисьмоОбменСБанками
	               |ГДЕ
	               |	ПисьмоОбменСБанками.Ссылка В(&МассивДокументов)";
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьПечати = Макет.ПолучитьОбласть("Шапка");
		Если Выборка.Направление = Перечисления.НаправленияЭДО.Входящий Тогда   
			ОбластьПечати.Параметры.Направление = "Входящее";
			ОбластьПечати.Параметры.Дата = Формат(Выборка.ВходящаяДата,"ДЛФ=DD");
			ОбластьПечати.Параметры.Номер = Выборка.ВходящийНомер;
			ОбластьПечати.Параметры.Отправитель = Выборка.Банк;
			ОбластьПечати.Параметры.Получатель = Выборка.Организация;
		Иначе 
			ОбластьПечати.Параметры.Направление = "Исходящее";
			ОбластьПечати.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=DD");
			ОбластьПечати.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
			ОбластьПечати.Параметры.Отправитель = Выборка.Организация;
			ОбластьПечати.Параметры.Получатель = Выборка.Банк;
		КонецЕсли;   
		ОбластьПечати.Параметры.Тема = Выборка.Тема;
		ТабличныйДокумент.Вывести(ОбластьПечати);   
		
		Если ЗначениеЗаполнено(Выборка.ТипПисьма) Тогда		
			ОбластьПечати = Макет.ПолучитьОбласть("ТипПисьма");  
			ОбластьПечати.Параметры.ТипПисьма = Выборка.ТипПисьма;
			ТабличныйДокумент.Вывести(ОбластьПечати);   
		КонецЕсли;  
		
		ОбластьПечати = Макет.ПолучитьОбласть("ТекстПисьма");  
		ОбластьПечати.Параметры.Текст = Выборка.Текст;
		ТабличныйДокумент.Вывести(ОбластьПечати);   
			
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли