#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("Вакансии") 
		И Параметры.Свойство("Сайт") Тогда
		
		Сайт = Параметры.Сайт;
		Вакансии = Новый ФиксированныйМассив(Параметры.Вакансии);
		
		ДанныеСайта = РекрутинговыеСайты.ДанныеСайтов(Сайт)[Сайт];
		
		ОбновитьДерево(Сайт);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоВакансий

&НаКлиенте
Процедура ДеревоВакансийПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоВакансий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДочерниеЭлементы = ТекущиеДанные.ПолучитьЭлементы();
	
	Для Каждого ДочернийЭлемент Из ДочерниеЭлементы Цикл
		ДочернийЭлемент.Пометка = ТекущиеДанные.Пометка;
	КонецЦикла;
	
	Если ТекущиеДанные.Пометка = Истина Тогда
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Если Не Родитель = Неопределено Тогда
			Родитель.Пометка = ТекущиеДанные.Пометка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВакансийВакансияВПрограммеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоВакансий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДочерниеЭлементы = ТекущиеДанные.ПолучитьЭлементы();
	
	Если ДочерниеЭлементы.Количество() > 0 Тогда
		
		Вакансия = ТекущиеДанные.ВакансияВПрограмме;
		
		Если ЗначениеЗаполнено(Вакансия) Тогда
			
			СтруктураВакансии = РеквизитыВакансииНаСервере(Вакансия);
			
			Для Каждого ДочернийЭлемент Из ДочерниеЭлементы Цикл
				Если ДочернийЭлемент.Путь = "Регион" Тогда
					Продолжить;
				КонецЕсли;
				
				ДочернийЭлемент.ВакансияВПрограмме = СтруктураВакансии[ДочернийЭлемент.Путь];
			КонецЦикла;
			
		Иначе
			
			ОписаниеВакансии = Неопределено;
			
			Для Каждого ЭлементМассиваВакансии Из Вакансии Цикл
				ИдентификаторВакансии = 
					Формат(ЭлементМассиваВакансии[ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор], "ЧГ=0");
				
				Если ИдентификаторВакансии = ТекущиеДанные.Путь Тогда
					ОписаниеВакансии = ЭлементМассиваВакансии;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ОписаниеВакансии) Тогда
				Возврат;
			КонецЕсли;
			
			ПутиДочернихЭлементов = Новый Соответствие();
			Для Каждого ДочернийЭлемент Из ДочерниеЭлементы Цикл
				ПутиДочернихЭлементов.Вставить(ДочерниеЭлементы.Индекс(ДочернийЭлемент), ДочернийЭлемент.Путь);
			КонецЦикла;
			
			РеквизитыПубликацииПоУмолчанию = РеквизитыПубликацииПоУмолчанию(ОписаниеВакансии, ПутиДочернихЭлементов);
			
			Для Каждого ДочернийЭлемент Из ДочерниеЭлементы Цикл
				ДочернийЭлемент.ВакансияВПрограмме =
					РеквизитыПубликацииПоУмолчанию[ДочерниеЭлементы.Индекс(ДочернийЭлемент)];
				ДочернийЭлемент.Пометка = Истина;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		ПозицияПриИзменении(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗагрузить(Команда)
	
	Если ЗагрузитьВакансииНаСервере() Тогда
		
		Оповестить("ЗагруженыВакансии");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Вакансии загружены'"));
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	УстановитьСнятьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	УстановитьСнятьФлажки(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДерево(Сайт)
	
	СтруктураДанныхВакансии = Справочники.Вакансии.ОписаниеВакансииДляПубликации();
	
	СоответствиеИмениИСинонимаРеквизитовВакансий = Справочники.Вакансии.СоответствиеИмениИСинонимаРеквизитовВакансий();
	ЗагружаемыеРеквизиты = РекрутинговыеСайты.ЗагружаемыеРеквизитыВакансии();
	
	ОпубликованныеВакансииСИдентификаторами = РекрутинговыеСайты.ОпубликованныеВакансииСИдентификаторами(Сайт);
	
	Дерево = РеквизитФормыВЗначение("ДеревоВакансий");
	
	МенеджерРекрутинговыхСайтов = РекрутинговыеСайты.МенеджерРекрутинговыхСайтов(Сайт);
	
	Для Каждого Вакансия Из Вакансии Цикл
		Если Вакансия = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаДерева = Дерево.Строки.Добавить();
		
		НоваяСтрокаДерева.ВакансияСайт = Вакансия[ДанныеСайта.ИменаПутейКДаннымВакансии.Вакансия];
		НоваяСтрокаДерева.Адрес = Вакансия[ДанныеСайта.ИменаПутейКДаннымВакансии.Адрес];
		НоваяСтрокаДерева.Путь = Формат(Вакансия[ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор], "ЧГ=0");
		
		СтрокаОпубликованнойВакансии =
			ОпубликованныеВакансииСИдентификаторами.Найти(Формат(НоваяСтрокаДерева.Путь, "ЧГ=0"), "ИдентификаторВакансии");
		Если СтрокаОпубликованнойВакансии <> Неопределено Тогда
			НоваяСтрокаДерева.ВакансияВПрограмме = СтрокаОпубликованнойВакансии.Вакансия;
		Иначе
			НоваяСтрокаДерева.ВакансияВПрограмме = Справочники.Вакансии.ПустаяСсылка();
			НоваяСтрокаДерева.Пометка = Истина;
		КонецЕсли;
		
		Если ДанныеСайта.ДоступнаМножественнаяПубликацияВакансии Тогда
			СтрокаПоляВакансии = НоваяСтрокаДерева.Строки.Добавить();
			СтрокаПоляВакансии.ВакансияСайт = НСтр("ru = 'Регион'");
			СтрокаПоляВакансии.Путь = НСтр("ru = 'Регион'");
			СтрокаПоляВакансии.ВакансияВПрограмме = РекрутинговыеСайты.РегионВакансииССайта(Вакансия, ДанныеСайта);
		КонецЕсли;
		
		Для Каждого РеквизитВакансии Из СтруктураДанныхВакансии Цикл
			СтрокаПоляВакансии = НоваяСтрокаДерева.Строки.Добавить();
			СтрокаПоляВакансии.ВакансияСайт = СоответствиеИмениИСинонимаРеквизитовВакансий.Получить(РеквизитВакансии.Ключ);
			СтрокаПоляВакансии.Путь = РеквизитВакансии.Ключ;
			СтрокаПоляВакансии.Загружаемый = ЗагружаемыеРеквизиты.Найти(РеквизитВакансии.Ключ) <> Неопределено;
			СтрокаПоляВакансии.ВакансияВПрограмме =
				МенеджерРекрутинговыхСайтов.ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, Вакансия, РеквизитВакансии.Ключ);
			
			Если Не ЗначениеЗаполнено(СтрокаПоляВакансии.ВакансияВПрограмме) И СтрокаОпубликованнойВакансии <> Неопределено Тогда
				СтрокаПоляВакансии.ВакансияВПрограмме = СтрокаОпубликованнойВакансии[РеквизитВакансии.Ключ];
			КонецЕсли;
			
			СтрокаПоляВакансии.Пометка = (СтрокаОпубликованнойВакансии = Неопределено) И НужноПометитьСтроку(СтрокаПоляВакансии.Путь);
		КонецЦикла;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("ВакансияСайт");
	ЗначениеВРеквизитФормы(Дерево, "ДеревоВакансий");
	
КонецПроцедуры

&НаСервере
Функция НужноПометитьСтроку(Путь)
	
	Результат = Истина;
	Если Путь = "Позиция"
		Или Путь = "Должность"
		Или Путь = "ПрофильДолжности"
		Или Путь = "Подразделение" Тогда
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция РеквизитыПубликацииПоУмолчанию(ОписаниеВакансии, ПутиДочернихЭлементов)
	
	РеквизитыПубликацииПоУмолчанию = Новый Соответствие();
	МенеджерРекрутинговыхСайтов = РекрутинговыеСайты.МенеджерРекрутинговыхСайтов(Сайт);
	
	Для Каждого КлючИЗначение Из ПутиДочернихЭлементов Цикл
		ЗначениеРеквизитаПубликацииПоУмолчанию =
			МенеджерРекрутинговыхСайтов.ЗначениеРеквизитаПубликацииПоУмолчанию(Сайт, ОписаниеВакансии, КлючИЗначение.Значение);
		РеквизитыПубликацииПоУмолчанию.Вставить(КлючИЗначение.Ключ, ЗначениеРеквизитаПубликацииПоУмолчанию);
	КонецЦикла;
	
	Возврат РеквизитыПубликацииПоУмолчанию;
	
КонецФункции

&НаСервере
Функция РеквизитыВакансииНаСервере(Вакансия)
	
	ОписаниеВакансии = Справочники.Вакансии.ОписаниеВакансииДляПубликации();
	ИменаРеквизитов = ОбщегоНазначения.ВыгрузитьКолонку(ОписаниеВакансии, "Ключ");
	РеквизитыВакансии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Вакансия, ИменаРеквизитов);
	
	Возврат РеквизитыВакансии;
	
КонецФункции

&НаСервере
Функция ЗагрузитьВакансииНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоВакансий");
	Если Не ПроверитьЗаполнениеПолей(Дерево) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
	
		ЗагрузкаПрошлаУспешно = Истина;
		
		Для Каждого СтрокаВакансия Из Дерево.Строки Цикл
			
			Если Не СтрокаВакансия.Пометка Тогда
				Продолжить;
			КонецЕсли;
			
			Регион = Неопределено;
			СтруктураДанныхВакансии = Новый Структура;
			Для Каждого ПодчиненнаяСтрока Из СтрокаВакансия.Строки Цикл
				Если ПодчиненнаяСтрока.Пометка Тогда
					СтруктураДанныхВакансии.Вставить(ПодчиненнаяСтрока.Путь, ПодчиненнаяСтрока.ВакансияВПрограмме);
				КонецЕсли;
				
				Если ПодчиненнаяСтрока.Путь = "Регион" Тогда
					Регион = ПодчиненнаяСтрока.ВакансияВПрограмме;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗначениеЗаполнено(СтрокаВакансия.ВакансияВПрограмме) Тогда
				Справочники.Вакансии.ОбновитьВакансию(СтрокаВакансия.ВакансияВПрограмме, СтруктураДанныхВакансии);
				НоваяВакансия = СтрокаВакансия.ВакансияВПрограмме.ПолучитьОбъект();
			Иначе
				НоваяВакансия = Справочники.Вакансии.СоздатьЭлемент();
				НоваяВакансия.Заполнить(Неопределено);
				НоваяВакансия.Заполнить(СтруктураДанныхВакансии);
				Если Не ЗначениеЗаполнено(НоваяВакансия.Код) Тогда
					НоваяВакансия.УстановитьНовыйКод();
				КонецЕсли;
			КонецЕсли;
			
			Если НоваяВакансия.ПроверитьЗаполнение() Тогда
				НоваяВакансия.Записать();
				
				ДанныеЗаписиПубликации = РекрутинговыеСайтыСлужебный.НовыеДанныеЗаписиПубликации();
				ДанныеЗаписиПубликации.Вакансия = НоваяВакансия.Ссылка;
				ДанныеЗаписиПубликации.Сайт = Сайт;
				ДанныеЗаписиПубликации.ИдентификаторВакансии = СтрокаВакансия.Путь;
				ДанныеЗаписиПубликации.Адрес = СтрокаВакансия.Адрес;
				Если Регион <> Неопределено Тогда
					ДанныеЗаписиПубликации.Регион = Регион[0].Представление;
					ДанныеЗаписиПубликации.ИдентификаторРегиона =
						СтрЗаменить(Строка(Регион[0].Значение), Символы.НПП, "");
				КонецЕсли;
				
				РекрутинговыеСайты.ЗаписьВРегистрИнформацииОПубликации(ДанныеЗаписиПубликации);
				РекрутинговыеСайты.ЗаписьВРегистрДанныеПубликацииВакансий(
					Вакансии, НоваяВакансия.Ссылка, Сайт, СтрокаВакансия.Путь);
			Иначе
				ЗагрузкаПрошлаУспешно = Ложь;
			КонецЕсли;
		
		КонецЦикла;
		
		Если ЗагрузкаПрошлаУспешно Тогда
			ЗафиксироватьТранзакцию();
		Иначе
			ОтменитьТранзакцию();
		КонецЕсли;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи вакансии'", ОбщегоНазначения.КодОсновногоЯзыка()) + " " + НоваяВакансия,
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение НСтр("ru = 'Ошибка при записи вакансии'") + " " + НоваяВакансия;
		
	КонецПопытки;
	
	Возврат ЗагрузкаПрошлаУспешно;
	
КонецФункции

&НаКлиенте
Процедура УстановитьСнятьФлажки(Пометка)
	
	Для Каждого СтрокаВакансии Из ДеревоВакансий.ПолучитьЭлементы() Цикл
		
		СтрокаВакансии.Пометка = Пометка;
		Для Каждого ПодчиненнаяСтрока Из СтрокаВакансии.ПолучитьЭлементы() Цикл
			ПодчиненнаяСтрока.Пометка = Пометка;
		КонецЦикла;
		
	КонецЦикла
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , , Истина, Ложь, Ложь, Ложь));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "ДеревоВакансий.Загружаемый", Истина);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоВакансийВакансияСайт.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоВакансийВакансияВПрограмме.Имя);
	
	// Сделаем регион недоступным для изменения
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Элемент.Отбор, "ДеревоВакансий.Путь", "Регион");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоВакансийВакансияВПрограмме.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоВакансийПометка.Имя);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеПолей(Дерево)
	
	Отказ = Ложь;
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если Не СтрокаДерева.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаДереваПодчиненная Из СтрокаДерева.Строки Цикл
			
			Если СтрокаДереваПодчиненная.Пометка
				И Не ЗначениеЗаполнено(СтрокаДереваПодчиненная.ВакансияВПрограмме) Тогда
				
				ТекстСообщения = НСтр("ru = 'Заполните поле ""%1"" для вакансии ""%2"".'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, СтрокаДереваПодчиненная.ВакансияСайт, СтрокаДерева.ВакансияСайт);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПозицияПриИзменении(ТекущиеДанные)
	
	ТекущееЗначение = ТекущиеДанные.ВакансияВПрограмме;
	
	Если ТекущиеДанные.Путь = "Позиция" И ЗначениеЗаполнено(ТекущееЗначение) Тогда
		
		ТекущиеДанные.Пометка = Истина;
		ДанныеПозиции = ДанныеПозицииШтатногоРасписания(ТекущееЗначение);
		СтрокаРодителя = ТекущиеДанные.ПолучитьРодителя();
		
		Для Каждого СтрокаДерева Из СтрокаРодителя.ПолучитьЭлементы() Цикл
			
			Если СтрокаДерева.Путь = "Должность" Тогда
				СтрокаДерева.ВакансияВПрограмме = ДанныеПозиции.Должность;
				СтрокаДерева.Пометка = Истина;
			ИначеЕсли СтрокаДерева.Путь = "Подразделение" Тогда
				СтрокаДерева.ВакансияВПрограмме = ДанныеПозиции.МестоВСтруктуреПредприятия; 
				СтрокаДерева.Пометка = Истина;
			ИначеЕсли СтрокаДерева.Путь = "ПрофильДолжности" Тогда
				Если ЗначениеЗаполнено(ДанныеПозиции.ПрофильДолжности) Тогда
					СтрокаДерева.ВакансияВПрограмме = ДанныеПозиции.ПрофильДолжности;
					СтрокаДерева.Пометка = Истина;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПозицииШтатногоРасписания(Позиция)
	Возврат Справочники.ШтатноеРасписание.ДанныеПозицииШтатногоРасписания(Позиция);
КонецФункции

#КонецОбласти