
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
	
	// Установка отбора динамического списка.
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ПометкаУдаления", Ложь, ВидСравненияКомпоновкиДанных.Равно, , ,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущийПользователь", Пользователи.ТекущийПользователь());
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "ТипДокумента", , Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Предмет", , , Истина, Истина);
	ПроцессыОбработкиДокументов.УстановитьОграничениеИспользованияПоляДинамическогоСписка(
		Список, "Ссылка.Предмет", Истина, Истина, Истина, Истина, Истина, Истина, Истина, Истина);
	
	ПроцессыОбработкиДокументов.ДобавитьДополнительныеКолонкиСпискаЗадач(ЭтотОбъект, "Список");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	СгруппироватьПоКолонкеНаСервере(Настройки["РежимГруппировки"]);
	УстановитьОтбор(Настройки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ЗадачаПоОбработкеДокумента" Тогда
		ОбновитьСписокЗадачНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьВыполненныеПриИзменении(Элемент)
	УстановитьОтбор(Новый Структура("ПоказыватьВыполненные", ПоказыватьВыполненные));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	УправлениеВидимостьюКоманд(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Предмет") Тогда
		ПоказатьЗначение(,ТекущиеДанные.Предмет);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СгруппироватьПоБезГруппировки(Команда)
	СгруппироватьПоКолонке("");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоАвтору(Команда)
	СгруппироватьПоКолонке("Автор");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоПредмету(Команда)
	СгруппироватьПоКолонке("ТипДокумента");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоЭтапу(Команда)
	СгруппироватьПоКолонке("Этап");
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоИсполнителю(Команда)
	СгруппироватьПоКолонке("Исполнитель");
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ПринятьЗадачиКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПринятиеКИсполнению(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьПринятиеЗадачКИсполнению(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыполнение(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ОтменитьВыполнениеЗадач(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьНаРольИсполнителя(Команда)
	
	ПроцессыОбработкиДокументовКлиент.ВернутьНаРольИсполнителя(Элементы.Список.ВыделенныеСтроки);
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнформацияОбОшибке(Команда)
	ПроцессыОбработкиДокументовКлиент.ПоказатьИнформациюОбОшибках(Элементы.Список.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	ОбновитьСписокЗадачНаСервере(); 
	
	УправлениеВидимостьюКоманд(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ПроцессыОбработкиДокументов.УстановитьОформлениеЗадач(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура СгруппироватьПоКолонке(Знач ИмяКолонкиРеквизита)
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") И ЭлементНастроек.Структура.Количество() > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Пользовательская настройки группировки будет удалена. Продолжить?'");
			Обработчик = Новый ОписаниеОповещения("ПродолжитьГруппировкуПоКолонкеПослеВопроса", ЭтотОбъект, ИмяКолонкиРеквизита);
			ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонкеПослеВопроса(Результат, ИмяКолонкиРеквизита) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементНастроек Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если ТипЗнч(ЭлементНастроек) = Тип("СтруктураНастроекКомпоновкиДанных") Тогда
			ЭлементНастроек.Структура.Очистить();
		КонецЕсли;
	КонецЦикла;
	
	ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьГруппировкуПоКолонке(ИмяКолонкиРеквизита)
	
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СгруппироватьПоКолонкеНаСервере(Знач ИмяКолонкиРеквизита)
	РежимГруппировки = ИмяКолонкиРеквизита;
	Список.Группировка.Элементы.Очистить();
	Если НЕ ПустаяСтрока(ИмяКолонкиРеквизита) Тогда
		ПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонкиРеквизита);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокЗадачНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ТекущаяДата", ТекущаяДатаСеанса());
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ПараметрыОтбора)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Выполнена");
	Если НЕ ПараметрыОтбора["ПоказыватьВыполненные"] Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Выполнена", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюКоманд(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("Прервана")
		И ТекущиеДанные.Прервана Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("Выполнена")
		И ТекущиеДанные.Выполнена Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Истина;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ИсполнительНазначенПринудительно")
		И ТекущиеДанные.ИсполнительНазначенПринудительно Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ПринятаКИсполнению")
		И ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Истина;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	ИначеЕсли ТекущиеДанные.Свойство("ПринятаКИсполнению")
		И НЕ ТекущиеДанные.ПринятаКИсполнению Тогда
		ДоступностьПринятьКИсполнению = Истина;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		Если ТекущиеДанные.Свойство("Исполнитель")
			И ЗначениеЗаполнено(ТекущиеДанные.Исполнитель)
			И ТекущиеДанные.Свойство("РольИсполнителя")
			И ЗначениеЗаполнено(ТекущиеДанные.РольИсполнителя) Тогда
			ДоступностьВернутьНаРольИсполнителя = Истина;
		Иначе
			ДоступностьВернутьНаРольИсполнителя = Ложь;
		КонецЕсли;
	Иначе
		ДоступностьПринятьКИсполнению = Ложь;
		ДоступностьОтменитьПринятиеКИсполнению = Ложь;
		ДоступностьОтменитьВыполнение = Ложь;
		ДоступностьВернутьНаРольИсполнителя = Ложь;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено
		И ТекущиеДанные.Свойство("НеВыполненаИзЗаОшибки")
		И ТекущиеДанные.НеВыполненаИзЗаОшибки Тогда
		ДоступностьИнформацияОбОшибке = Истина;
	Иначе
		ДоступностьИнформацияОбОшибке = Ложь;
	КонецЕсли;
	
	Элементы.ПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.СписокКонтекстноеМенюПринятьКИсполнению.Доступность = ДоступностьПринятьКИсполнению;
	Элементы.ОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	Элементы.СписокКонтекстноеМенюОтменитьПринятиеКИсполнению.Доступность = ДоступностьОтменитьПринятиеКИсполнению;
	Элементы.ОтменитьВыполнение.Доступность = ДоступностьОтменитьВыполнение;
	Элементы.СписокКонтекстноеМенюОтменитьВыполнение.Доступность = ДоступностьОтменитьВыполнение;
	Элементы.ВернутьНаРольИсполнителя.Доступность = ДоступностьВернутьНаРольИсполнителя;
	Элементы.СписокКонтекстноеМенюВернутьНаРольИсполнителя.Доступность = ДоступностьВернутьНаРольИсполнителя;
	Элементы.СписокКонтекстноеМенюИнформацияОбОшибке.Доступность = ДоступностьИнформацияОбОшибке;
	
КонецПроцедуры

#КонецОбласти
