#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ФормаУзлаПриСозданииНаСервере(ЭтаФорма, Отказ);
	
	// Инициализируем доступность ссылки установки даты запрета редактирования
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"УстановитьДатуЗапретаИзменений",
		"Доступность",
		ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ДатыЗапретаИзменения));
		
	ОтправлятьНСИ_ДО = (Объект.ПравилаОтправкиСправочников = "АвтоматическаяСинхронизация");
	
	ЗаполнитьРеквизитыФормы();
	УстановитьВидимостьНаСервере();
	ОбновитьНаименованиеКомандФормы();
	ОбновитьСписокВыбораВерсийФорматаОбмена();
	
	Если ОбменДаннымиУниверсальныйФормат.ЭтоОбменЗУПДО(Объект.ВариантНастройки) Тогда
		ТекстПодсказки = НСтр("ru = 'Выгружать всех физических лиц, сотрудников, структуру предприятия, организации и должности.'");
		Элементы.ОтправлятьНСИ_ДО.Подсказка = ТекстПодсказки;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "ЗарегистрироватьДанныеПоСотрудникамДО", "Видимость", ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(Объект.Ссылка));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если (Не ЗавершениеРаботы = Неопределено И ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбновитьДанныеОбъекта(ВыбранноеЗначение);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФлагИспользоватьОтборПоОрганизациямПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОтправлятьНСИАвтоматическиПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОтправлятьНСИПоНеобходимостиПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательОтправлятьНСИНикогдаПриИзменении(Элемент)
	Объект.ПравилаОтправкиДокументов = "НеСинхронизировать";
	Объект.ОтправлятьВедомости = Ложь;
	Объект.ОтправлятьРегламентированныеОтчеты = Ложь;
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыОтправлятьАвтоматическиПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыОтправлятьВручнуюПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательДокументыНеОтправлятьПриИзменении(Элемент)
	УстановитьВидимостьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РежимВыгрузкиПроводокПриИзменении(Элемент)
	Объект.ДанныеДляФормированияПроводокОтправлятьСводно = ?(РежимВыгрузкиПроводок = 1, Истина, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтправкиВедомостейПриИзменении(Элемент)
	
	Если ВариантОтправкиВедомостей = 0 Тогда
		Объект.ОтправлятьВедомости = Ложь;
		Объект.ОтправлятьВедомостиКакЗаявки = Ложь;
	ИначеЕсли ВариантОтправкиВедомостей = 1 Тогда
		Объект.ОтправлятьВедомости = Истина;
		Объект.ОтправлятьВедомостиКакЗаявки = Ложь;
	Иначе
		Объект.ОтправлятьВедомости = Истина;
		Объект.ОтправлятьВедомостиКакЗаявки = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьНСИ_ДОПриИзменении(Элемент)
	
	Объект.ПравилаОтправкиСправочников = ?(ОтправлятьНСИ_ДО, "АвтоматическаяСинхронизация", "НеСинхронизировать");
	УстановитьВидимостьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправлятьСотрудниковПриИзменении(Элемент)
	
	Если Не НастройкаЗавершена() Тогда
		Возврат
	КонецЕсли;
	
	ОбновитьВидимостьРегистрацииСотрудников(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСписокВыбранныхОрганизаций(Команда)
	
	КоллекцияФильтров = Новый Массив;
	КоллекцияФильтров.Добавить(Новый Структура("РеквизитОтбора, Условие, ИмяПараметра, ЗначениеПараметра", 
		"Ссылка", "<>", "УправленческаяОрганизация", ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация")));
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяЭлементаФормыДляЗаполнения",          "Организации");
	ПараметрыФормы.Вставить("ИмяРеквизитаЭлементаФормыДляЗаполнения", "Организация");
	ПараметрыФормы.Вставить("ИмяТаблицыВыбора",                       "Справочник.Организации");
	ПараметрыФормы.Вставить("ЗаголовокФормыВыбора",                   НСтр("ru = 'Выберите организации для отбора'"));
	ПараметрыФормы.Вставить("МассивВыбранныхЗначений",                СформироватьМассивВыбранныхЗначений(ПараметрыФормы));
	ПараметрыФормы.Вставить("ПараметрыВнешнегоСоединения",            Неопределено);
	ПараметрыФормы.Вставить("КоллекцияФильтров",                      КоллекцияФильтров);
	
	ОткрытьФорму("ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Форма.ФормаВыбораДополнительныхУсловий",
		ПараметрыФормы,
		ЭтаФорма);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьСписокВыбранныхШаблонов(Команда) 
	
	КоллекцияФильтров = Новый Массив;
	КоллекцияФильтров.Добавить(Новый Структура("РеквизитОтбора, Условие, ИмяПараметра, ЗначениеПараметра", 
		"ВидыРаботЗаполняютсяВДокументе", "=", "ВидыРаботЗаполняютсяВДокументе", Истина));
	КоллекцияФильтров.Добавить(Новый Структура("РеквизитОтбора, Условие, ИмяПараметра, ЗначениеПараметра", 
		"ВыполненныеРаботыРаспределяютсяПоСотрудникам", "=", "ВыполненныеРаботыРаспределяютсяПоСотрудникам", Ложь));
	Если Не Объект.ИспользуетсяВерсияФормата_1_17 Тогда
		КоллекцияФильтров.Добавить(Новый Структура("РеквизитОтбора, Условие, ИмяПараметра, ЗначениеПараметра", 
			"ВыполненныеРаботыВводятсяСводно", "=", "ВыполненныеРаботыВводятсяСводно", Ложь));
	КонецЕсли;
		
	КоллекцияДополнительныхРеквизитов = Новый Массив;
	КоллекцияДополнительныхРеквизитов.Добавить(Новый Структура("ПутьКДанным, ИмяРеквизита, Представление, ПредставлениеНеЗаполненного",
		"Организация", "Организация", "Организация", "<по всем организациям>"));
	Если Объект.ИспользуетсяВерсияФормата_1_17 Тогда
		КоллекцияДополнительныхРеквизитов.Добавить(Новый Структура("ПутьКДанным, ИмяРеквизита, Представление, ПредставлениеНеЗаполненного",
			"ВыполненныеРаботыВводятсяСводно", "ВыполненныеРаботыВводятсяСводно", "Сводно за период", "Нет"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИмяЭлементаФормыДляЗаполнения",          "ШаблоныВводаИсходныхДанных");
	ПараметрыФормы.Вставить("ИмяРеквизитаЭлементаФормыДляЗаполнения", "Шаблон");
	ПараметрыФормы.Вставить("ИмяТаблицыВыбора",                       "Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты");
	ПараметрыФормы.Вставить("ЗаголовокФормыВыбора",                   НСтр("ru = 'Выберите шаблоны ввода исходных данных'"));
	ПараметрыФормы.Вставить("МассивВыбранныхЗначений",                СформироватьМассивВыбранныхЗначений(ПараметрыФормы));
	ПараметрыФормы.Вставить("ПараметрыВнешнегоСоединения",            Неопределено);
	ПараметрыФормы.Вставить("КоллекцияФильтров",                      КоллекцияФильтров);
	ПараметрыФормы.Вставить("КоллекцияДополнительныхРеквизитов",      КоллекцияДополнительныхРеквизитов);
	
	ОткрытьФорму("ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Форма.ФормаВыбораДополнительныхУсловий",
		ПараметрыФормы,
		ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДанныеПоСотрудникам(Команда)
	
	ЗаголовокВопроса = НСтр("ru = 'Подтверждение'");
	ТекстВопроса = НСтр("ru = 'Будут зарегистрированы все данные по сотрудникам к отправке.'");
	ТекстЗаписать = НСтр("ru='Продолжение операции возможно только после записи настроек.
			|Записать и продолжить?'");
	
	Если Модифицированность Тогда
		ТекстВопроса = СтрШаблон("%1%2%3%4", ТекстВопроса, Символы.ПС, Символы.ПС, ТекстЗаписать);
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗарегистрироватьДанныеПоСотрудникамПродолжение", ЭтотОбъект);
	ПоказатьВопрос(ОповещениеОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет,,,ЗаголовокВопроса);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗарегистрироватьДанныеПоСотрудникамПродолжение(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Если Модифицированность Тогда
			Записать();
		КонецЕсли;
		
		ДлительнаяОперация = ЗарегистрироватьДанныеПоСотрудникамНаСервере();
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗарегистрироватьДанныеПоСотрудникамЗавершение", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьДанныеПоСотрудникамНаСервере()

	Организации = ?(Объект.ИспользоватьОтборПоОрганизациям, Объект.Организации.Выгрузить().ВыгрузитьКолонку("Организация"), Неопределено);
	
	ДополнительныеНастройки = Новый Структура;
	ДополнительныеНастройки.Вставить("Получатель", Объект.Ссылка);
	ДополнительныеНастройки.Вставить("Организации", Организации);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "ОбменДаннымиУниверсальныйФормат.ЗарегистрироватьДанныеПоСотрудникам", ДополнительныеНастройки);

КонецФункции

&НаКлиенте
Процедура ЗарегистрироватьДанныеПоСотрудникамЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Регистрация выполнена'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При регистрации данных по сотрудникам возникли ошибки:'");
		ТекстСообщения = СтрШаблон("%1%2%3", ТекстСообщения, Символы.ПС, Результат.КраткоеПредставлениеОшибки);
		ИнформированиеПользователяКлиент.Предупредить(ТекстСообщения, Результат.ПодробноеПредставлениеОшибки,);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьРегистрацииСотрудников(Форма)

	 ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ЗарегистрироватьДанныеПоСотрудникам", "Видимость", Форма.Объект.ОтправлятьСотрудников);

КонецПроцедуры

#Область Прочее

&НаКлиенте
Процедура ЗавершениеВыбораФайлаМенеджераОбмена(Знач РезультатПомещенияФайлов, Знач ДополнительныеПараметры) Экспорт
	
	ОчиститьСообщения();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	ЭтоОбменДО 	= ОбменДаннымиУниверсальныйФормат.ЭтоОбменЗУПДО(Объект.ВариантНастройки);
	ЭтоОбменERP = ОбменДаннымиУниверсальныйФормат.ЭтоОбменЗУПERP(Объект.ВариантНастройки);
	ЭтоОбменБП 	= ОбменДаннымиУниверсальныйФормат.ЭтоОбменЗУПБП(Объект.ВариантНастройки);
	ЭтоОбменУНФ = ОбменДаннымиУниверсальныйФормат.ЭтоОбменЗУПУНФ(Объект.ВариантНастройки);
	ЭтоОбменУниверсальный = ОбменДаннымиУниверсальныйФормат.ЭтоОбменУниверсальный(Объект.ВариантНастройки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОтправкаНСИ_ДО",
		"Видимость",
		ЭтоОбменДО);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаОсновные",
		"Видимость",
		Не ЭтоОбменДО);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаДополнительныеНастройкиОтправки",
		"Видимость",
		Не ЭтоОбменДО);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаШаблоныВводаИсходныхДанных",
		"Видимость",
		ЭтоОбменERP Или ЭтоОбменУниверсальный Или ЭтоОбменУНФ);
		
	Если Не ЭтоОбменДО Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаОтправкаСотрудников",
			"Видимость",
			Объект.ИспользуетсяВерсияФормата_1_17);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаРежимВыгрузкиПроводок",
			"Видимость",
			Не ЭтоОбменERP);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаОтправкаВедомостейОтчетов",
			"Видимость",
			ЭтоОбменБП Или ЭтоОбменУНФ);
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ОтправлятьРегламентированныеОтчеты",
			"Видимость",
			ЭтоОбменБП);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаОтправкаВедомостей",
			"Видимость",
			ЭтоОбменERP Или ЭтоОбменУниверсальный);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаДополнительныеНастройкиОтправки",
			"Доступность",
			Не Объект.ПравилаОтправкиСправочников = "НеСинхронизировать");
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ДатаНачалаВыгрузкиДокументов",
			"Доступность",
			Объект.ПравилаОтправкиДокументов = "АвтоматическаяСинхронизация");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"ГруппаНеСинхронизироватьДокументы",
			"Доступность",
			Не Объект.ПравилаОтправкиСправочников = "СинхронизироватьПоНеобходимости");
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы.ГруппаДокументы.ПодчиненныеЭлементы,
			"ГруппаРежимОтправкиДокументов",
			"Доступность",
			Не Объект.ПравилаОтправкиСправочников = "НеСинхронизировать");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаНастройкаДополнительныхОтборов",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") И Не Объект.ПравилаОтправкиСправочников = "НеСинхронизировать");
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ОткрытьСписокВыбранныхОрганизаций",
		"Доступность",
		Объект.ИспользоватьОтборПоОрганизациям);
		
	ОбновитьВидимостьРегистрацииСотрудников(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеОбъекта(СтруктураПараметров)
	
	Объект[СтруктураПараметров.ИмяТаблицыДляЗаполнения].Очистить();
	
	СписокВыбранныхЗначений = ПолучитьИзВременногоХранилища(СтруктураПараметров.АдресТаблицыВоВременномХранилище);
	
	Если СписокВыбранныхЗначений.Количество() > 0 Тогда
		СписокВыбранныхЗначений.Колонки.Представление.Имя = СтруктураПараметров.ИмяКолонкиДляЗаполнения;
		Объект[СтруктураПараметров.ИмяТаблицыДляЗаполнения].Загрузить(СписокВыбранныхЗначений);
	КонецЕсли;
	
	ОбновитьНаименованиеКомандФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименованиеКомандФормы()
	
	// Обновим заголовок выбранных организаций
	Если Объект.Организации.Количество() > 0 Тогда
		
		ВыбранныеОрганизации = Объект.Организации.Выгрузить().ВыгрузитьКолонку("Организация");
		НовыйЗаголовокОрганизаций = СтрСоединить(ВыбранныеОрганизации, ",");
		
	Иначе
		
		НовыйЗаголовокОрганизаций = НСтр("ru = 'Выбрать организации'");
		
	КонецЕсли;
	
	Элементы.ОткрытьСписокВыбранныхОрганизаций.Заголовок = НовыйЗаголовокОрганизаций;
	
	// Обновим заголовок выбранных шаблонов ввода исходных данных
	Если Объект.ШаблоныВводаИсходныхДанных.Количество() > 0 Тогда
		
		ВыбранныеШаблоны = Объект.ШаблоныВводаИсходныхДанных.Выгрузить().ВыгрузитьКолонку("Шаблон");
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВидыДокументовВводДанныхДляРасчетаЗарплаты.Наименование КАК Шаблон,
		|	ЕСТЬNULL(ВидыДокументовВводДанныхДляРасчетаЗарплаты.Организация.Наименование, """") КАК Организация
		|ИЗ
		|	Справочник.ВидыДокументовВводДанныхДляРасчетаЗарплаты КАК ВидыДокументовВводДанныхДляРасчетаЗарплаты
		|ГДЕ
		|	ВидыДокументовВводДанныхДляРасчетаЗарплаты.Ссылка В(&СписокШаблонов)");
		Запрос.УстановитьПараметр("СписокШаблонов", ВыбранныеШаблоны);
		
		НовыйЗаголовокШаблоновВводаИсходныхДанных = "";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НовыйЗаголовокШаблоновВводаИсходныхДанных = НовыйЗаголовокШаблоновВводаИсходныхДанных
				+ " ," + Выборка.Шаблон
				+ " (" + ?(ПустаяСтрока(Выборка.Организация), "<по всем организациям>", Выборка.Организация) + ")";
		КонецЦикла;
		
		НовыйЗаголовокШаблоновВводаИсходныхДанных = Сред(НовыйЗаголовокШаблоновВводаИсходныхДанных, 3);
		
	Иначе
		
		НовыйЗаголовокШаблоновВводаИсходныхДанных = НСтр("ru = 'Выбрать шаблоны ввода исходных данных'");
		
	КонецЕсли;
	
	Элементы.ОткрытьСписокВыбранныхШаблонов.Заголовок = НовыйЗаголовокШаблоновВводаИсходныхДанных;
	
КонецПроцедуры

&НаСервере
Функция СформироватьМассивВыбранныхЗначений(ПараметрыФормы)
	
	ТабличнаяЧасть           = Объект[ПараметрыФормы.ИмяЭлементаФормыДляЗаполнения];
	ТаблицаВыбранныхЗначений = ТабличнаяЧасть.Выгрузить(,ПараметрыФормы.ИмяРеквизитаЭлементаФормыДляЗаполнения);
	МассивВыбранныхЗначений  = ТаблицаВыбранныхЗначений.ВыгрузитьКолонку(ПараметрыФормы.ИмяРеквизитаЭлементаФормыДляЗаполнения);
	
	Возврат МассивВыбранныхЗначений;

КонецФункции

&НаСервере
Процедура ОбновитьСписокВыбораВерсийФорматаОбмена()
	
	СписокВерсийФормата = Элементы.ВерсияФорматаОбмена.СписокВыбора;
	СписокВерсийФормата.Очистить();
	
	ВерсииФормата = Новый Соответствие;
	ОбменДаннымиУниверсальныйФормат.ПриПолученииДоступныхВерсийФормата(ВерсииФормата, Объект.ВариантНастройки);
	
	Для Каждого ВерсияФормата Из ВерсииФормата Цикл
		СписокВерсийФормата.Добавить(ВерсияФормата.Ключ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НастройкаЗавершена()

	Возврат ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(Объект.Ссылка);

КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормы()

	РежимВыгрузкиПроводок = ?(Объект.ДанныеДляФормированияПроводокОтправлятьСводно, 1, 0);
	ВариантОтправкиВедомостей = 0;
	Если Объект.ОтправлятьВедомости И Объект.ОтправлятьВедомостиКакЗаявки Тогда
		ВариантОтправкиВедомостей = 2;
	ИначеЕсли Объект.ОтправлятьВедомости И НЕ Объект.ОтправлятьВедомостиКакЗаявки Тогда
		ВариантОтправкиВедомостей = 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти