
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ПользователиСлужебныйПовтИсп.Настройки

// Возвращает признак использования в сервисе общих настроек входа пользователей
// @skip-check module-empty-method - особенность реализации.
// 
// Возвращаемое значение:
//  Булево
Функция ИспользоватьОбщиеНастройкиВходаПользователейСервиса() Экспорт
КонецФункции

// Конец ПользователиСлужебныйПовтИсп.Настройки

// ПользователиСлужебный.ОбновитьДатуПоследнейАктивностиПользователей
// ПользователиСлужебный.ОбновитьСведенияОПользователе

// Обновить активность пользователя сервиса.
// @skip-check module-empty-method - особенность реализации.
// 
// Параметры:
//  ТекущийПользователь - Неопределено - Текущий авторизованный пользователь
//  					- СправочникСсылка.Пользователи
//  ДатаПоследнейАктивности - Неопределено - Начало дня даты текущего сеанса
//							- Дата
Процедура ОбновитьАктивностьПользователяСервиса(
	ТекущийПользователь = Неопределено,
	ДатаПоследнейАктивности = Неопределено) Экспорт
КонецПроцедуры

// Конец ПользователиСлужебный.ОбновитьДатуПоследнейАктивностиПользователей
// Конец ПользователиСлужебный.ОбновитьСведенияОПользователе

#КонецОбласти

#КонецОбласти
