//@Strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт

	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений);
	
КонецПроцедуры

// Параметры:
//  ИспользуемыеСервисы - Массив Из Строка
//  ТолькоНастраиваемые - Булево
Процедура ЗаполнитьИспользуемыеСервисы(ИспользуемыеСервисы, ТолькоНастраиваемые) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриЗаполненииИспользуемыхСервисов(ИспользуемыеСервисы, ТолькоНастраиваемые);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриЗаполненииИспользуемыхСервисов(ИспользуемыеСервисы, ТолькоНастраиваемые);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриЗаполненииИспользуемыхСервисов(
		ИспользуемыеСервисы, ТолькоНастраиваемые);
	
КонецПроцедуры

// Параметры:
//  ДанныеСервисов - Соответствие Из КлючИЗначение:
// * Ключ - Строка
// * Значение - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеСервиса
Процедура ЗаполнитьДанныеСервисов(ДанныеСервисов) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриЗаполненииДанныхСервисов(ДанныеСервисов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриЗаполненииДанныхСервисов(ДанныеСервисов);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриЗаполненииДанныхСервисов(ДанныеСервисов);
	
КонецПроцедуры

// Параметры:
//  ДанныеОДоступностиСервисов - Соответствие Из КлючИЗначение:
// * Ключ - СправочникСсылка.УчетныеЗаписиВидеоконференций
// * Значение - См. ВидеоконференцииСлужебный.НовыеДанныеОДоступностиСервиса
//  УчетныеЗаписи - Массив Из СправочникСсылка.УчетныеЗаписиВидеоконференций
Процедура ЗаполнитьДанныеОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриЗаполненииДанныхОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриЗаполненииДанныхОДоступностиСервисов(ДанныеОДоступностиСервисов, УчетныеЗаписи);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриЗаполненииДанныхОДоступностиСервисов(
		ДанныеОДоступностиСервисов, УчетныеЗаписи);
	
КонецПроцедуры

// См. Видеоконференции.ПодключитьУчетнуюЗапись
Функция ПодключитьУчетнуюЗапись(УчетнаяЗапись, Сервис, КодАвторизации) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = ВидеоконференцииСлужебный.НовыеРеквизитыУчетнойЗаписи();
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриПодключенииУчетнойЗаписи(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, КодАвторизации);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриПодключенииУчетнойЗаписи(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, КодАвторизации);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция СоздатьВидеоконференцию(УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриСозданииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриСозданииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриСозданииВидеоконференции(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  НастройкиВидеоконференции - См. ВидеоконференцииСлужебный.НовыеНастройкиВидеоконференции
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ОбновитьВидеоконференцию(УчетнаяЗапись, Сервис, НастройкиВидеоконференции) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриОбновленииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриОбновленииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриОбновленииВидеоконференции(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, НастройкиВидеоконференции);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция ДанныеВидеоконференции(УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриПолученииДанныхВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриПолученииДанныхВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриПолученииДанныхВидеоконференции(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  См. ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции
Функция УдалитьВидеоконференцию(УчетнаяЗапись, Сервис, Идентификатор) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = ВидеоконференцииСлужебный.НовыеДанныеВидеоконференции();
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриУдаленииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриУдаленииВидеоконференции(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриУдаленииВидеоконференции(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
//  ДанныеПользователя - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
// 
// Возвращаемое значение:
//  Булево
Функция ПользовательЯвляетсяУчастником(УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя) Экспорт
	
	ОбработкаЗавершена = Ложь;
	Результат = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриОпределенииПользовательЯвляетсяУчастником(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияZoom") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияZoom");
		МенеджерИнтеграции.ПриОпределенииПользовательЯвляетсяУчастником(
			Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриОпределенииПользовательЯвляетсяУчастником(
		Результат, ОбработкаЗавершена, УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
//  Сервис - Строка
//  Идентификатор - Строка
//  ДанныеПользователя - Структура: См. ВидеоконференцииСлужебный.НовыеДанныеПользователя
Процедура ДобавитьПользователяВУчастники(УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЗарплатаКадрыКорпоративнаяПодсистемы.Видеоконференции.ИнтеграцияВидеоконференций") Тогда
		МенеджерИнтеграции = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Обработка.ИнтеграцияВидеоконференций");
		МенеджерИнтеграции.ПриДобавленииПользователяВУчастники(
			УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	КонецЕсли;
	
	ВидеоконференцииВнутреннийПереопределяемый.ПриДобавленииПользователяВУчастники(
		УчетнаяЗапись, Сервис, Идентификатор, ДанныеПользователя);
	
КонецПроцедуры

#КонецОбласти
