
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.СсылкиНаПроверяемыеОбъекты.Количество() = 0 Тогда
		Отказ = Истина;		
		Возврат;
	КонецЕсли;	
	
	РСВ_1 = Параметры.РСВ_1;
	АдресФайлаВыгрузкиРСВ = Параметры.АдресФайлаВыгрузкиРСВ;
	ИмяФайлаВыгрузкиРСВ = Параметры.ИмяФайлаВыгрузкиРСВ;
	ЕдинаяОтчетностьПФР = Параметры.ЕдинаяОтчетностьПФР;
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь(
									Пользователи.ТекущийПользователь(),
	                                Истина,
	                                Ложь);		
	
	ПроверяемыеОбъекты = Новый Массив;
	
	Для Каждого СсылкаНаПроверяемыйОбъект Из Параметры.СсылкиНаПроверяемыеОбъекты Цикл
		ПроверяемыеОбъекты.Добавить(СсылкаНаПроверяемыйОбъект);	
	КонецЦикла;	
	
	ОписаниеПроверяемыхФайловВДанныеФормы(ПроверяемыеОбъекты);
	
	НастройкиПроверочныхПрограмм = ПерсонифицированныйУчет.ОбщиеНастройкиПрограммПроверкиОтчетности();
	
	Если НастройкиПроверочныхПрограмм = Неопределено 
		Или Не НастройкиПроверочныхПрограмм.ВыполнятьПроверкуНаСервере 
		Или ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		НастройкиПроверочныхПрограмм = ПерсонифицированныйУчет.ПерсональныеНастройкиПрограммПроверкиОтчетности();
		
		ВыполнятьПроверкуНаСервере = Ложь;	
		ЗаданыОбщиеНастройки = Ложь;
		Элементы.НастройкаПрограмм.Видимость = Истина;
	Иначе
		ВыполнятьПроверкуНаСервере = НастройкиПроверочныхПрограмм.ВыполнятьПроверкуНаСервере;
		ЗаданыОбщиеНастройки = Истина;
		Элементы.НастройкаПрограмм.Видимость = Ложь;
	КонецЕсли;
	
	ОпределитьПроверочныеПрограммыДляФайлов(НастройкиПроверочныхПрограмм);
	
	СоздатьЭлементыОтображенияПротоколов();
	
	Если ПроверятьПрограммойCheckUFA Тогда
		ОпределитьКаталогПрограммыСheckUFA(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойCheckXML Тогда
		ОпределитьКаталогПрограммыСheckXML(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПД Тогда
		ОпределитьКаталогПрограммыПОПД(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПДЕЦП Тогда
		ОпределитьКаталогПрограммыПОПДЕЦП(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ВыполнятьПроверкуНаСервере Тогда
		УстановитьИнфоНадписьНаличиеПрограммНаСервере();
		
		Если Не (ПроверятьПрограммойCheckUFA И ФайлПрограммыCheckUFAОбнаружен) 
			И Не (ПроверятьПрограммойCheckXML И ФайлПрограммыCheckXMLОбнаружен)  
			И Не (ПроверятьПрограммойПОПД И ФайлПрограммыПОПДОбнаружен) 
			И Не (ПроверятьПрограммойПОПДЕЦП И ФайлПрограммыПОПДЕЦПОбнаружен) Тогда
			УстановитьСвойстваЭлементовПослеПроверки(ЭтаФорма, 0, 0, 0, 0);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВыполнятьПроверкуНаСервере Тогда
		ИнициализироватьПроверкуФайловВФоне();
	Иначе
		ОповещениеВопроса = Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОповещениеВопроса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Истина Тогда 
		
		ТекстИсключения = НСтр("ru = 'Не подключено расширение работы с файлами. Проверка не возможна.'");		
		ПоказатьПредупреждение(, ТекстИсключения);
		
		Закрыть();
	КонецЕсли;	
	
	УстановитьИнфоНадписьНаличиеПрограммНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СохранитьИПроверитьФайлыПослеОткрытияФормы()
	Если Открыта() Тогда
		
		СохранитьФайлыНаКлиенте();	
	Иначе
		ПодключитьОбработчикОжидания("Подключаемый_СохранитьИПроверитьФайлыПослеОткрытияФормы", 0.1, Истина);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененыПерсональныеНастройкиПроверочныхПрограммПФР" Тогда
		ПриИзмененииПерсональныхНастроек();	
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СообщенияФоновогоЗадания(ИдентификаторЗадания)
	
	СообщенияПользователю = Новый Массив;
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если ФоновоеЗадание <> Неопределено Тогда
		СообщенияПользователю = ФоновоеЗадание.ПолучитьСообщенияПользователю();
	КонецЕсли;
	
	Возврат СообщенияПользователю;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				ПроверкаФайловПослеВыполненияДлительнойОперации();
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Иначе
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания(
					"Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал,
					Истина);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		
		СообщенияПользователю = СообщенияФоновогоЗадания(ИдентификаторЗадания);
		Если СообщенияПользователю <> Неопределено Тогда
			Для каждого СообщениеФоновогоЗадания Из СообщенияПользователю Цикл
				СообщениеФоновогоЗадания.Сообщить();
			КонецЦикла;
		КонецЕсли;
		
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПрограмм(Команда)
	ПараметрыОткрытия = Новый Структура("БлокироватьОкноВладельца ", Истина);
	ОткрытьФорму("ОбщаяФорма.НастройкаПроверочныхПрограммПФРПерсональная", ПараметрыОткрытия, ЭтаФорма); 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

#Область ИнициализацияФормы

&НаСервере
Функция ОписаниеПроверяемыхФайловВДанныеФормы(ПроверяемыеОбъекты)
	ПроверяемыеФайлы = Новый Массив;
	
	Для Каждого СсылкаНаПроверяемыйОбъект Из ПроверяемыеОбъекты Цикл
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(СсылкаНаПроверяемыйОбъект);
		
		ОписаниеФайлов = МенеджерОбъекта.ВыгрузитьФайлыВоВременноеХранилище(СсылкаНаПроверяемыйОбъект, УникальныйИдентификатор);
		
		Для Каждого ОписаниеФайла Из ОписаниеФайлов Цикл
			ПроверяемыеФайлы.Добавить(Новый ФиксированнаяСтруктура(ОписаниеФайла));			
		КонецЦикла;	
	КонецЦикла;	
	
	// РСВ-1
	Если ЗначениеЗаполнено(РСВ_1)  
		И ЗначениеЗаполнено(АдресФайлаВыгрузкиРСВ) Тогда
		
		ОписаниеВыгруженногоФайла = ПерсонифицированныйУчет.ОписаниеВыгруженногоФайлаОтчетности();
		
		ОписаниеВыгруженногоФайла.Владелец = РСВ_1;
		ОписаниеВыгруженногоФайла.АдресВоВременномХранилище = АдресФайлаВыгрузкиРСВ;
		ОписаниеВыгруженногоФайла.ИмяФайла = ИмяФайлаВыгрузкиРСВ;
		ОписаниеВыгруженногоФайла.ФайлВСоставеКомплекта = Истина;
		ОписаниеВыгруженногоФайла.ПроверяемыйФайлКомплекта = ЕдинаяОтчетностьПФР;
		ОписаниеВыгруженногоФайла.ПроверятьCheckXML = Не ЕдинаяОтчетностьПФР;
		ОписаниеВыгруженногоФайла.ПроверятьCheckUFA = Истина;
		
		ПроверяемыеФайлы.Добавить(ОписаниеВыгруженногоФайла);	
	КонецЕсли;	
	
	ОписаниеПроверяемыхФайлов = Новый ФиксированныйМассив(ПроверяемыеФайлы);
КонецФункции	

&НаСервере
Процедура ОпределитьПроверочныеПрограммыДляФайлов(НастройкиПроверочныхПрограмм)
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		Если ОписаниеФайла.ПроверятьCheckXML 
			И (НастройкиПроверочныхПрограмм = Неопределено 
			Или НастройкиПроверочныхПрограмм.ПроверятьПрограммойCheckXML) Тогда
			
			ПроверятьПрограммойCheckXML = Истина;
		КонецЕсли;	
		Если ОписаниеФайла.ПроверятьCheckUFA 
			И (НастройкиПроверочныхПрограмм = Неопределено  
			Или НастройкиПроверочныхПрограмм.ПроверятьПрограммойCheckUFA) Тогда
			
			ПроверятьПрограммойCheckUFA = Истина;
		КонецЕсли;
		Если ОписаниеФайла.ПроверятьПОПД 
			И (НастройкиПроверочныхПрограмм = Неопределено  
			Или НастройкиПроверочныхПрограмм.ПроверятьПрограммойПОПД) Тогда
			
			ПроверятьПрограммойПОПД = Истина;
		КонецЕсли;
		Если ОписаниеФайла.ПроверятьПОПДЕЦП 
			И (НастройкиПроверочныхПрограмм = Неопределено  
			Или НастройкиПроверочныхПрограмм.ПроверятьПрограммойПОПДЕЦП) Тогда
			
			ПроверятьПрограммойПОПДЕЦП = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ОпределитьКаталогПрограммыСheckUFA(НастройкиПроверочныхПрограмм)
	Если НастройкиПроверочныхПрограмм <> Неопределено Тогда 
		КаталогПрограммыСheckUFA = НастройкиПроверочныхПрограмм.КаталогПрограммыCheckUFA;
	КонецЕсли;				
КонецФункции

&НаСервере
Функция ОпределитьКаталогПрограммыСheckXML(НастройкиПроверочныхПрограмм)
	Если НастройкиПроверочныхПрограмм <> Неопределено Тогда
		
		КаталогПрограммыСheckXml = НастройкиПроверочныхПрограмм.КаталогПрограммыCheckXML;
		
	КонецЕсли;	
КонецФункции

&НаСервере
Функция ОпределитьКаталогПрограммыПОПД(НастройкиПроверочныхПрограмм)
	
	Если НастройкиПроверочныхПрограмм <> Неопределено Тогда
		КаталогПрограммыПОПД = НастройкиПроверочныхПрограмм.КаталогПрограммыПОПД;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОпределитьКаталогПрограммыПОПДЕЦП(НастройкиПроверочныхПрограмм)
	
	Если НастройкиПроверочныхПрограмм <> Неопределено Тогда
		КаталогПрограммыПОПДЕЦП = НастройкиПроверочныхПрограмм.КаталогПрограммыПОПДЕЦП;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОпределитьНаличиеПроверочныхПрограммНаСервере()
	
	Если ПроверятьПрограммойCheckUFA Тогда	
		Файл = Новый Файл(КаталогПрограммыСheckUFA + "\Check.exe");
		
		ФайлПрограммыCheckUFAОбнаружен = Файл.Существует();
	КонецЕсли;
	
	Если ПроверятьПрограммойCheckXML Тогда
		Файл = Новый Файл(КаталогПрограммыСheckXml + "\CheckXML.exe");
		
		ФайлПрограммыCheckXMLОбнаружен = Файл.Существует();
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПД Тогда
		Файл = Новый Файл(КаталогПрограммыПОПД + "\run.cmd");
		
		ФайлПрограммыПОПДОбнаружен = Файл.Существует();
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПДЕЦП Тогда
		Файл = Новый Файл(КаталогПрограммыПОПДЕЦП + "\popd-checker-windows-x64.exe");
		
		ФайлПрограммыПОПДЕЦПОбнаружен = Файл.Существует();
	КонецЕсли;
	
КонецПроцедуры	


&НаСервере
Процедура СоздатьЭлементыОтображенияПротоколов()
	
	СоответствиеДокументовИменамРеквизитовCheckXML = Новый Соответствие;
	СоответствиеДокументовИменамРеквизитовCheckUFA = Новый Соответствие;
	СоответствиеДокументовИменамРеквизитовПОПД = Новый Соответствие;
	СоответствиеДокументовИменамРеквизитовПОПДЕЦП = Новый Соответствие;
	
	СоздаваемыеРеквизиты = Новый Массив;
	РеквизитыПротоколовCheckXML = Новый Массив;
	РеквизитыПротоколовCheckUFA = Новый Массив;
	РеквизитыПротоколовПОПД = Новый Массив;
	РеквизитыПротоколовПОПДЕЦП = Новый Массив;
	
	НомерФайла = 1;
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл	
		Если ОписаниеФайла.ПроверятьCheckXML Тогда
			
			РеквизитПротоколаCheckXML = Новый РеквизитФормы("ПротоколПроверкиCheckXML" + НомерФайла, Новый ОписаниеТипов("Строка"),, ОписаниеФайла.ИмяФайла);
			
			СоздаваемыеРеквизиты.Добавить(РеквизитПротоколаCheckXML);
			РеквизитыПротоколовCheckXML.Добавить(РеквизитПротоколаCheckXML);
			
			СоответствиеДокументовИменамРеквизитовCheckXML.Вставить(ОписаниеФайла.Владелец, РеквизитПротоколаCheckXML.Имя);
		КонецЕсли;	
		
		Если ОписаниеФайла.ПроверятьCheckUFA
			И (Не ОписаниеФайла.ФайлВСоставеКомплекта 
			Или ОписаниеФайла.ПроверяемыйФайлКомплекта) Тогда

			Заголовок = ?(ОписаниеФайла.ФайлВСоставеКомплекта, НСтр("ru = 'Комплект файлов'"), ОписаниеФайла.ИмяФайла); 
			
			РеквизитПротоколаCheckUFA = Новый РеквизитФормы("ПротоколПроверкиCheckUFA" + НомерФайла, Новый ОписаниеТипов("Строка"),, Заголовок);
			
			СоздаваемыеРеквизиты.Добавить(РеквизитПротоколаCheckUFA);
			РеквизитыПротоколовCheckUFA.Добавить(РеквизитПротоколаCheckUFA);
			
			СоответствиеДокументовИменамРеквизитовCheckUFA.Вставить(ОписаниеФайла.Владелец, РеквизитПротоколаCheckUFA.Имя);
		КонецЕсли;	
		
		Если ОписаниеФайла.ПроверятьПОПД Тогда
			
			РеквизитПротоколаПОПД = Новый РеквизитФормы("ПротоколПроверкиПОПД" + НомерФайла, Новый ОписаниеТипов("Строка"),, ОписаниеФайла.ИмяФайла);
			
			СоздаваемыеРеквизиты.Добавить(РеквизитПротоколаПОПД);
			РеквизитыПротоколовПОПД.Добавить(РеквизитПротоколаПОПД);
			
			СоответствиеДокументовИменамРеквизитовПОПД.Вставить(ОписаниеФайла.Владелец, РеквизитПротоколаПОПД.Имя);
		КонецЕсли;	
		
		Если ОписаниеФайла.ПроверятьПОПДЕЦП Тогда
			
			РеквизитПротоколаПОПДЕЦП = Новый РеквизитФормы("ПротоколПроверкиПОПДЕЦП" + НомерФайла, Новый ОписаниеТипов("Строка"),, ОписаниеФайла.ИмяФайла);
			
			СоздаваемыеРеквизиты.Добавить(РеквизитПротоколаПОПДЕЦП);
			РеквизитыПротоколовПОПДЕЦП.Добавить(РеквизитПротоколаПОПДЕЦП);
			
			СоответствиеДокументовИменамРеквизитовПОПДЕЦП.Вставить(ОписаниеФайла.Владелец, РеквизитПротоколаПОПДЕЦП.Имя);
		КонецЕсли;	
		
		НомерФайла = НомерФайла + 1;
	КонецЦикла;	
	
	ИзменитьРеквизиты(СоздаваемыеРеквизиты);
	
	СоответствиеСсылокРеквизитамПротоколовCheckUFA = Новый ФиксированноеСоответствие(СоответствиеДокументовИменамРеквизитовCheckUFA);
	СоответствиеСсылокРеквизитамПротоколовCheckXML = Новый ФиксированноеСоответствие(СоответствиеДокументовИменамРеквизитовCheckXML);
	СоответствиеСсылокРеквизитамПротоколовПОПД = Новый ФиксированноеСоответствие(СоответствиеДокументовИменамРеквизитовПОПД);
	СоответствиеСсылокРеквизитамПротоколовПОПДЕЦП = Новый ФиксированноеСоответствие(СоответствиеДокументовИменамРеквизитовПОПДЕЦП);
	
	Для Каждого Реквизит Из РеквизитыПротоколовCheckXML Цикл
		СтраницаПротокола = Элементы.Добавить(Реквизит.Имя + "Страница", Тип("ГруппаФормы"), Элементы.ПротоколыПроверкиCheckXML);
		СтраницаПротокола.Вид = ВидГруппыФормы.Страница;
		СтраницаПротокола.Заголовок = Реквизит.Заголовок; 	
		
		ПолеПротокола = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), СтраницаПротокола);
		ПолеПротокола.ПутьКДанным = Реквизит.Имя;
		ПолеПротокола.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		ПолеПротокола.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЦикла;	
	
	Для Каждого Реквизит Из РеквизитыПротоколовCheckUFA Цикл
		СтраницаПротокола = Элементы.Добавить(Реквизит.Имя + "Страница", Тип("ГруппаФормы"), Элементы.ПротоколыПроверкиCheckUFA);
		СтраницаПротокола.Заголовок = Реквизит.Заголовок; 
		СтраницаПротокола.Вид = ВидГруппыФормы.Страница;
		
		ПолеПротокола = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), СтраницаПротокола);
		ПолеПротокола.ПутьКДанным = Реквизит.Имя;
		ПолеПротокола.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		ПолеПротокола.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЦикла;	
	
	Для Каждого Реквизит Из РеквизитыПротоколовПОПД Цикл
		СтраницаПротокола = Элементы.Добавить(Реквизит.Имя + "Страница", Тип("ГруппаФормы"), Элементы.ПротоколыПроверкиПОПД);
		СтраницаПротокола.Заголовок = Реквизит.Заголовок; 
		СтраницаПротокола.Вид = ВидГруппыФормы.Страница;
		
		ПолеПротокола = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), СтраницаПротокола);
		ПолеПротокола.ПутьКДанным = Реквизит.Имя;
		ПолеПротокола.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		ПолеПротокола.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЦикла;	
	
	Для Каждого Реквизит Из РеквизитыПротоколовПОПДЕЦП Цикл
		СтраницаПротокола = Элементы.Добавить(Реквизит.Имя + "Страница", Тип("ГруппаФормы"), Элементы.ПротоколыПроверкиПОПДЕЦП);
		СтраницаПротокола.Заголовок = Реквизит.Заголовок; 
		СтраницаПротокола.Вид = ВидГруппыФормы.Страница;
		
		ПолеПротокола = Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), СтраницаПротокола);
		ПолеПротокола.ПутьКДанным = Реквизит.Имя;
		ПолеПротокола.Вид = ВидПоляФормы.ПолеНадписи;
		ПолеПротокола.РастягиватьПоВертикали = Истина;
		ПолеПротокола.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьИнфоНадписьНаличиеПрограммНаСервере()
	Элементы.НастройкаПрограмм.Видимость = Ложь;
	
	ОпределитьНаличиеПроверочныхПрограммНаСервере();
	
	ОбнаруженыВсеПрограммы = (ФайлПрограммыCheckUFAОбнаружен Или Не ПроверятьПрограммойCheckUFA) 
								И (ФайлПрограммыCheckXMLОбнаружен Или Не ПроверятьПрограммойCheckXML)
								И (ФайлПрограммыПОПДОбнаружен Или Не ПроверятьПрограммойПОПД)
								И (ФайлПрограммыПОПДЕЦПОбнаружен Или Не ПроверятьПрограммойПОПДЕЦП);
									
	ТекстИнфонадписиCheckUFA = "";
	ТекстИнфонадписиCheckXML = "";
	ТекстИнфонадписиПОПД = "";
	ТекстИнфонадписиПОПДЕЦП = "";
	ТекстИнфонадписиДействие = "";
	
	ТекстНачалоСообщения = "";
	
	СписокПрограмм = Новый Массив;
	Если ПроверятьПрограммойCheckXML Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'CheckXML'"));
	КонецЕсли;
	Если ПроверятьПрограммойCheckUFA Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'CheckPFR'"));
	КонецЕсли;
	Если ПроверятьПрограммойПОПД Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'ПО ПД'"));
	КонецЕсли;
	Если ПроверятьПрограммойПОПДЕЦП Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'ПО ПД ЕЦП'"));
	КонецЕсли;
	
	МаксимальныйИндекс = СписокПрограмм.ВГраница();
	Если МаксимальныйИндекс = 0 Тогда
		ТекстНачалоСообщения = НСтр("ru = 'Настроена проверка программой '") + СписокПрограмм[0] + ". ";
	ИначеЕсли МаксимальныйИндекс > 0 Тогда
		ИменаПрограмм = СписокПрограмм[0];
		Для Индекс = 1 по МаксимальныйИндекс Цикл
			ИменаПрограмм = ИменаПрограмм  
				+ ?(Индекс = МаксимальныйИндекс, НСтр("ru = ' и '"), НСтр("ru = ', '")) 
				+ СписокПрограмм[Индекс];
		КонецЦикла;
		ТекстНачалоСообщения = НСтр("ru = 'Настроена проверка программами '") + ИменаПрограмм + ". ";
	КонецЕсли;
		
	Если ОбнаруженыВсеПрограммы Тогда
		Инфонадпись = ТекстНачалоСообщения + НСтр("ru = 'Для изменения настроек обратитесь к администратору системы.'");	
	Иначе
		Если ПроверятьПрограммойCheckUFA И Не ФайлПрограммыCheckUFAОбнаружен Тогда
			ТекстИнфонадписиCheckUFA = НСтр("ru = 'Не обнаружен файл программы CheckPFR.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойCheckXML И Не ФайлПрограммыCheckXMLОбнаружен Тогда
			ТекстИнфонадписиCheckXML = НСтр("ru = 'Не обнаружен файл программы CheckXML.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойПОПД И Не ФайлПрограммыПОПДОбнаружен Тогда
			ТекстИнфонадписиПОПД = НСтр("ru = 'Не обнаружен файл программы ПО ПД.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойПОПДЕЦП И Не ФайлПрограммыПОПДЕЦПОбнаружен Тогда
			ТекстИнфонадписиПОПДЕЦП = НСтр("ru = 'Не обнаружен файл программы ПО ПД ЕЦП.'") + " ";
		КонецЕсли;
		ТекстИнфонадписиДействие = НСтр("ru = 'Обратитесь к администратору системы для настройки проверочных программ.'");	
		
		Инфонадпись = ТекстНачалоСообщения + ТекстИнфонадписиCheckUFA + ТекстИнфонадписиCheckXML 
			+ ТекстИнфонадписиПОПД + ТекстИнфонадписиПОПДЕЦП + ТекстИнфонадписиДействие;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьИнфоНадписьНаличиеПрограммНаКлиенте()
		
	ОпределитьНаличиеПроверочныхПрограммНаКлиенте();

КонецПроцедуры	

&НаКлиенте
Процедура ПослеПроверкиНаличияПрограммНаКлиенте() 
	ОбнаруженыВсеПрограммы = (ФайлПрограммыCheckUFAОбнаружен Или Не ПроверятьПрограммойCheckUFA) 
								И (ФайлПрограммыCheckXMLОбнаружен Или Не ПроверятьПрограммойCheckXML)
								И (ФайлПрограммыПОПДОбнаружен Или Не ПроверятьПрограммойПОПД)
								И (ФайлПрограммыПОПДЕЦПОбнаружен Или Не ПроверятьПрограммойПОПДЕЦП);
								
	НеЗаданыНастройки = Не ПроверятьПрограммойCheckUFA И Не ПроверятьПрограммойCheckXML 
		И Не ПроверятьПрограммойПОПД И Не ПроверятьПрограммойПОПДЕЦП;							
									
	ТекстИнфонадписиCheckUFA = "";
	ТекстИнфонадписиCheckXML = "";
	ТекстИнфонадписиПОПД = "";
	ТекстИнфонадписиПОПДЕЦП = "";
	ТекстИнфонадписиДействие = "";
	
	ТекстНачалоСообщения = "";
	
	СписокПрограмм = Новый Массив;
	Если ПроверятьПрограммойCheckXML Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'CheckXML'"));
	КонецЕсли;
	Если ПроверятьПрограммойCheckUFA Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'CheckPFR'"));
	КонецЕсли;
	Если ПроверятьПрограммойПОПД Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'ПО ПД'"));
	КонецЕсли;
	Если ПроверятьПрограммойПОПДЕЦП Тогда 
		СписокПрограмм.Добавить(НСтр("ru = 'ПО ПД ЕЦП'"));
	КонецЕсли;
	
	МаксимальныйИндекс = СписокПрограмм.ВГраница();
	Если МаксимальныйИндекс = 0 Тогда
		ТекстНачалоСообщения = НСтр("ru = 'Настроена проверка программой '") + СписокПрограмм[0] + ". ";
	ИначеЕсли МаксимальныйИндекс > 0 Тогда
		ИменаПрограмм = СписокПрограмм[0];
		Для Индекс = 1 по МаксимальныйИндекс Цикл
			ИменаПрограмм = ИменаПрограмм  
				+ ?(Индекс = МаксимальныйИндекс, НСтр("ru = ' и '"), НСтр("ru = ', '")) 
				+ СписокПрограмм[Индекс];
		КонецЦикла;
		ТекстНачалоСообщения = НСтр("ru = 'Настроена проверка программами '") + ИменаПрограмм + ". ";
	КонецЕсли;

	Если ОбнаруженыВсеПрограммы Тогда
		Инфонадпись = ТекстНачалоСообщения + НСтр("ru = 'Для изменения настроек перейдите по ссылке.'");
	ИначеЕсли НеЗаданыНастройки Тогда
		Инфонадпись = НСтр("ru = 'Не заданы настройки. Чтобы задать настройки проверочных программ перейдите по ссылке.'");	
	Иначе
		Если ПроверятьПрограммойCheckUFA И Не ФайлПрограммыCheckUFAОбнаружен Тогда
			ТекстИнфонадписиCheckUFA = НСтр("ru = 'Не обнаружен файл программы CheckPFR.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойCheckXML И Не ФайлПрограммыCheckXMLОбнаружен Тогда
			ТекстИнфонадписиCheckXML = НСтр("ru = 'Не обнаружен файл программы CheckXML.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойПОПД И Не ФайлПрограммыПОПДОбнаружен Тогда
			ТекстИнфонадписиПОПД = НСтр("ru = 'Не обнаружен файл программы ПО ПД.'") + " ";
		КонецЕсли;
		Если ПроверятьПрограммойПОПДЕЦП И Не ФайлПрограммыПОПДЕЦПОбнаружен Тогда
			ТекстИнфонадписиПОПДЕЦП = НСтр("ru = 'Не обнаружен файл программы ПО ПД ЕЦП.'") + " ";
		КонецЕсли;
		ТекстИнфонадписиДействие = НСтр("ru = 'Установите персональные настройки проверочных программ.'");	
		Инфонадпись = ТекстНачалоСообщения + ТекстИнфонадписиCheckUFA + ТекстИнфонадписиCheckXML 
			+ ТекстИнфонадписиПОПД + ТекстИнфонадписиПОПДЕЦП + ТекстИнфонадписиДействие;
	КонецЕсли;		
	
	Если (ПроверятьПрограммойCheckUFA И ФайлПрограммыCheckUFAОбнаружен) 
		Или (ПроверятьПрограммойCheckXML И ФайлПрограммыCheckXMLОбнаружен)  
		Или (ПроверятьПрограммойПОПД И ФайлПрограммыПОПДОбнаружен)
		Или (ПроверятьПрограммойПОПДЕЦП И ФайлПрограммыПОПДЕЦПОбнаружен) Тогда
		
		Состояние(НСтр("ru = 'Проверка файлов'"));
		ПодключитьОбработчикОжидания("Подключаемый_СохранитьИПроверитьФайлыПослеОткрытияФормы", 0.1, Истина);
		
	Иначе
		УстановитьСвойстваЭлементовПослеПроверки(ЭтаФорма, 0, 0, 0, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьНаличиеПроверочныхПрограммНаКлиенте()
	Если ПроверятьПрограммойCheckUFA Тогда	
		ОписаниеОповещение = Новый ОписаниеОповещения("ПослеИнициализацииФайлаCheckUFA", ЭтотОбъект);
		
		Файл = Новый Файл;
		Файл.НачатьИнициализацию(ОписаниеОповещение, КаталогПрограммыСheckUFA + "\Check.exe");
		
	Иначе
		ПослеПроверкиСуществованияCheckUFA(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИнициализацииФайлаCheckUFA(Файл, ДополнительныеПараметры) Экспорт
	ОписаниеОповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияCheckUFA", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещение);		
КонецПроцедуры	


&НаКлиенте
Процедура ПослеПроверкиСуществованияCheckUFA(Существует, ДополнительныеПараметры = Неопределено) Экспорт 
	ФайлПрограммыCheckUFAОбнаружен = Существует;	
	
	Если ПроверятьПрограммойCheckXML Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ПослеИнициализацииФайлаCheckXML", ЭтотОбъект);
		
		Файл = Новый Файл;
		Файл.НачатьИнициализацию(ОписаниеОповещение, КаталогПрограммыСheckXml + "\CheckXML.exe");
	
	Иначе
		ПослеПроверкиСуществованияCheckXML(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеИнициализацииФайлаCheckXML(Файл, ДополнительныеПараметры) Экспорт
	ОписаниеОповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияCheckXML", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещение);		
КонецПроцедуры	

&НаКлиенте
Процедура ПослеПроверкиСуществованияCheckXML(Существует, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ФайлПрограммыCheckXMLОбнаружен = Существует;
	
	Если ПроверятьПрограммойПОПД Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ПослеИнициализацииФайлаПОПД", ЭтотОбъект);
		
		Файл = Новый Файл;
		Файл.НачатьИнициализацию(ОписаниеОповещение, КаталогПрограммыПОПД + "\run.cmd");
	
	Иначе
		ПослеПроверкиСуществованияПОПД(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИнициализацииФайлаПОПД(Файл, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияПОПД", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещение);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеПроверкиСуществованияПОПД(Существует, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ФайлПрограммыПОПДОбнаружен = Существует;
	
	Если ПроверятьПрограммойПОПДЕЦП Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ПослеИнициализацииФайлаПОПДЕЦП", ЭтотОбъект);
		
		Файл = Новый Файл;
		Файл.НачатьИнициализацию(ОписаниеОповещение, КаталогПрограммыПОПДЕЦП + "\popd-checker-windows-x64.exe");
	
	Иначе
		ПослеПроверкиСуществованияПОПДЕЦП(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИнициализацииФайлаПОПДЕЦП(Файл, ДополнительныеПараметры) Экспорт
	
	ОписаниеОповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияПОПДЕЦП", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(ОписаниеОповещение);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеПроверкиСуществованияПОПДЕЦП(Существует, ДополнительныеПараметры = Неопределено) Экспорт 
	
	ФайлПрограммыПОПДЕЦПОбнаружен = Существует;
	ПослеПроверкиНаличияПрограммНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаФайлов

&НаКлиенте
Процедура ПриИзмененииПерсональныхНастроек()
	
	ПроверятьПрограммойCheckUFA = Ложь;
	ПроверятьПрограммойCheckXML = Ложь;
	ПроверятьПрограммойПОПД = Ложь;
	ПроверятьПрограммойПОПДЕЦП = Ложь;
	
	ФайлПрограммыCheckUFAОбнаружен = Ложь;
	ФайлПрограммыCheckXMLОбнаружен = Ложь;
	ФайлПрограммыПОПДОбнаружен = Ложь;
	ФайлПрограммыПОПДЕЦПОбнаружен = Ложь;
	
	ПриИзмененииПерсональныхНастроекНаСервере();
	
	Если Не ВыполнятьПроверкуНаСервере Тогда
		УстановитьИнфоНадписьНаличиеПрограммНаКлиенте();
		
		Если (ПроверятьПрограммойCheckUFA И ФайлПрограммыCheckUFAОбнаружен) 
			Или (ПроверятьПрограммойCheckXML И ФайлПрограммыCheckXMLОбнаружен) 
			Или (ПроверятьПрограммойПОПД И ФайлПрограммыПОПДОбнаружен)  
			Или (ПроверятьПрограммойПОПДЕЦП И ФайлПрограммыПОПДЕЦПОбнаружен) Тогда 
			
			СохранитьФайлыНаКлиенте();
			ИнициализироватьПроверкуФайловВФоне();
		Иначе
			УстановитьСвойстваЭлементовПослеПроверки(ЭтаФорма, 0, 0, 0, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПерсональныхНастроекНаСервере()
	НастройкиПроверочныхПрограмм = ПерсонифицированныйУчет.ПерсональныеНастройкиПрограммПроверкиОтчетности();
	
	ОпределитьПроверочныеПрограммыДляФайлов(НастройкиПроверочныхПрограмм);
	
	Если ПроверятьПрограммойCheckUFA Тогда
		ОпределитьКаталогПрограммыСheckUFA(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойCheckXML Тогда
		ОпределитьКаталогПрограммыСheckXML(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПД Тогда
		ОпределитьКаталогПрограммыПОПД(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
	Если ПроверятьПрограммойПОПДЕЦП Тогда
		ОпределитьКаталогПрограммыПОПДЕЦП(НастройкиПроверочныхПрограмм);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПроверкаФайловПослеВыполненияДлительнойОперацииНаКлиенте(Параметры) Экспорт
	ПроверкаФайловПослеВыполненияДлительнойОперации();	
	УдалитьФайлыНаКлиенте();
КонецПроцедуры	

&НаСервере
Процедура ПроверкаФайловПослеВыполненияДлительнойОперации()
	
	РезультатыПроверки = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(РезультатыПроверки) <> Тип("Структура") Тогда
		УстановитьСвойстваЭлементовПослеПроверки(ЭтаФорма, 0, 0, 0, 0);
		Возврат;
	КонецЕсли;
	
	СоответствиеФайловПротоколамПроверкиCheckXML = РезультатыПроверки.ПротоколыCheckXML; 
	СоответствиеФайловПротоколамПроверкиCheckUFA = РезультатыПроверки.ПротоколыCheckUFA; 
	СоответствиеФайловПротоколамПроверкиПОПД = РезультатыПроверки.ПротоколыПОПД; 
	СоответствиеФайловПротоколамПроверкиПОПДЕЦП = РезультатыПроверки.ПротоколыПОПДЕЦП; 
	
	КоличествоПротоколовCheckXML = 0;
	КоличествоПротоколовCheckUFA = 0;
	КоличествоПротоколовПОПД = 0;
	КоличествоПротоколовПОПДЕЦП = 0;
	
	ОшибкиПроверокПОПДЕЦП.Очистить();
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ТекстПротокола = СоответствиеФайловПротоколамПроверкиCheckXML.Получить(ОписаниеФайла.Владелец);
		
		ИмяРеквизитаПротокола = СоответствиеСсылокРеквизитамПротоколовCheckXML.Получить(ОписаниеФайла.Владелец);
		
		Если ЗначениеЗаполнено(ТекстПротокола)
			И ИмяРеквизитаПротокола <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, ИмяРеквизитаПротокола, ТекстПротокола);
			
			КоличествоПротоколовCheckXML = КоличествоПротоколовCheckXML + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ТекстПротокола = СоответствиеФайловПротоколамПроверкиCheckUFA.Получить(ОписаниеФайла.Владелец);
		
		ИмяРеквизитаПротокола = СоответствиеСсылокРеквизитамПротоколовCheckUFA.Получить(ОписаниеФайла.Владелец);
		
		Если ЗначениеЗаполнено(ТекстПротокола)
			И ИмяРеквизитаПротокола <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, ИмяРеквизитаПротокола, ТекстПротокола);
			
			КоличествоПротоколовCheckUFA = КоличествоПротоколовCheckUFA + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ТекстПротокола = СоответствиеФайловПротоколамПроверкиПОПД.Получить(ОписаниеФайла.Владелец);
		
		ИмяРеквизитаПротокола = СоответствиеСсылокРеквизитамПротоколовПОПД.Получить(ОписаниеФайла.Владелец);
		
		Если ЗначениеЗаполнено(ТекстПротокола)
			И ИмяРеквизитаПротокола <> Неопределено Тогда
			
			ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, ИмяРеквизитаПротокола, ТекстПротокола);
			
			КоличествоПротоколовПОПД = КоличествоПротоколовПОПД + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ТекстПротокола = СоответствиеФайловПротоколамПроверкиПОПДЕЦП.Получить(ОписаниеФайла.Владелец);
		
		ИмяРеквизитаПротокола = СоответствиеСсылокРеквизитамПротоколовПОПДЕЦП.Получить(ОписаниеФайла.Владелец);
		
		Если ЗначениеЗаполнено(ТекстПротокола)
			И ИмяРеквизитаПротокола <> Неопределено Тогда
			
			ПрочитатьТекстПротоколаПОПДЕЦП(ТекстПротокола, ОписаниеФайла.Владелец, ИмяРеквизитаПротокола);
			
			КоличествоПротоколовПОПДЕЦП = КоличествоПротоколовПОПДЕЦП + 1;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьСвойстваЭлементовПослеПроверки(ЭтаФорма, КоличествоПротоколовCheckUFA, КоличествоПротоколовCheckXML, КоличествоПротоколовПОПД, КоличествоПротоколовПОПДЕЦП);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьТекстПротоколаПОПДЕЦП(ТекстПротокола, ПроверяемыйДокумент, ИмяРеквизитаПротокола) 
	
	СтрокаXML = СокрЛП(ТекстПротокола);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	ДоступныеДанные = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	ЧтениеXML.Закрыть();
	
	СлужебнаяИнформация = СвойствоОбъектаXDTOПоПути(ДоступныеДанные, "СлужебнаяИнформация");
	
	БлокПроверокПуть = "УПП.ПроверочныйМодуль.ПроверкаФайлов.Файл.Результат.БлокПроверок";
	БлокПроверок = СвойствоОбъектаXDTOПоПути(ДоступныеДанные, БлокПроверокПуть);
	
	Если СлужебнаяИнформация = Неопределено Или БлокПроверок = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СписокОшибок = Новый Массив;
	Для Каждого ДанныеПроверки Из БлокПроверок Цикл 
		Если ТипЗнч(ДанныеПроверки.Проверка) = Тип("СписокXDTO") Тогда
			ЗаполнитьДанныеОшибокПроверокПОПДЕЦП(ДанныеПроверки.Проверка, СписокОшибок);
		ИначеЕсли ТипЗнч(ДанныеПроверки.Проверка) = Тип("ОбъектXDTO") Тогда 
		    ДобавитьОписаниеОшибкиПОПДЕЦП(ДанныеПроверки.Проверка, СписокОшибок);
		КонецЕсли;		
	КонецЦикла;
	
	ПроверкаПройдена = Истина;
	Для Каждого ДанныеОшибки Из СписокОшибок Цикл 
		НоваяСтрока = ОшибкиПроверокПОПДЕЦП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеОшибки);
		НоваяСтрока.ПроверяемыйДокумент = ПроверяемыйДокумент; 
		Если СтрНайти("30;40;50", НоваяСтрока.КодРезультата) <> 0 Тогда 
			ПроверкаПройдена = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(ЭтаФорма, ИмяРеквизитаПротокола, СлужебнаяИнформация.РезультатПроверки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяРеквизитаПротокола, "ЦветФона",
		?(ПроверкаПройдена, ЦветаСтиля.ЦветФонаПоложительногоЗначения, ЦветаСтиля.ЦветФонаОтрицательногоЗначения));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеОшибокПроверокПОПДЕЦП(Проверки, СписокОшибок)
	
	Для Каждого Проверка Из Проверки Цикл 
		Если ТипЗнч(Проверка) = Тип("ОбъектXDTO") Тогда 
			ДобавитьОписаниеОшибкиПОПДЕЦП(Проверка, СписокОшибок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьОписаниеОшибкиПОПДЕЦП(Проверка, СписокОшибок)
	
	Если СвойствоОбъектаXDTOПоПути(Проверка, "КодРезультата") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Проверка.КодРезультата <> "00" Тогда
		ДанныеОшибки = Новый Структура("КодПроверки, КодРезультата, МестоОшибки, ОписаниеПроверки");
		ЗаполнитьЗначенияСвойств(ДанныеОшибки, Проверка);
		ДанныеОшибки.КодПроверки = СвойствоОбъектаXDTOПоПути(Проверка, "ID");
		ДанныеОшибки.МестоОшибки = СвойствоОбъектаXDTOПоПути(Проверка, "Ошибки.Ошибка.Объект.Значение");
		Если ТипЗнч(ДанныеОшибки.МестоОшибки) <> Тип("Строка") Тогда 
			ДанныеОшибки.МестоОшибки = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеОшибки.МестоОшибки) Тогда 
			ДанныеОшибки.МестоОшибки = ДанныеОшибки.МестоОшибки + Символы.ПС;
		КонецЕсли;
		ПутьДоЭлемента = СвойствоОбъектаXDTOПоПути(Проверка, "Ошибки.Ошибка.ПутьДоЭлемента");
		СтрокаОшибки = СвойствоОбъектаXDTOПоПути(Проверка, "Ошибки.Ошибка.Строка");
		ПутьКМестуОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Строка файла %1; %2'"), СтрокаОшибки, ПутьДоЭлемента);
		ДанныеОшибки.МестоОшибки = ДанныеОшибки.МестоОшибки + ПутьКМестуОшибки;
		СписокОшибок.Добавить(ДанныеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СвойствоОбъектаXDTOПоПути(ОбъектXDTO, ПутьСвойства) Экспорт
	
	МассивИмен = СтрРазделить(ПутьСвойства, ".");
	Объект = ОбъектXDTO;
	
	Для Сч = 0 По МассивИмен.Количество()-1 Цикл
		Если ТипЗнч(Объект) <> Тип("ОбъектXDTO")
			Или Объект.Свойства().Получить(МассивИмен[Сч]) = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Объект = Объект[МассивИмен[Сч]];
	КонецЦикла;
	
	Возврат Объект;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПроверкиФайлов(Форма)
	
	СтруктураПараметров = ПерсонифицированныйУчетКлиентСервер.ПараметрыПроверкиФайловСтороннимиПрограммами();
	
	СтруктураПараметров.ПроверятьПрограммойCheckXML = Форма.ПроверятьПрограммойCheckXML;
	СтруктураПараметров.ФайлПрограммыCheckXMLОбнаружен = Форма.ФайлПрограммыCheckXMLОбнаружен;
	СтруктураПараметров.КаталогПрограммыСheckXml = Форма.КаталогПрограммыСheckXml;
	
	СтруктураПараметров.ПроверятьПрограммойCheckUFA = Форма.ПроверятьПрограммойCheckUFA;
	СтруктураПараметров.ФайлПрограммыCheckUFAОбнаружен = Форма.ФайлПрограммыCheckUFAОбнаружен;
	СтруктураПараметров.КаталогПрограммыСheckUFA = Форма.КаталогПрограммыСheckUFA;
	
	СтруктураПараметров.ПроверятьПрограммойПОПД = Форма.ПроверятьПрограммойПОПД;
	СтруктураПараметров.ФайлПрограммыПОПДОбнаружен = Форма.ФайлПрограммыПОПДОбнаружен;
	СтруктураПараметров.КаталогПрограммыПОПД = Форма.КаталогПрограммыПОПД;
	
	СтруктураПараметров.ПроверятьПрограммойПОПДЕЦП = Форма.ПроверятьПрограммойПОПДЕЦП;
	СтруктураПараметров.ФайлПрограммыПОПДЕЦПОбнаружен = Форма.ФайлПрограммыПОПДЕЦПОбнаружен;
	СтруктураПараметров.КаталогПрограммыПОПДЕЦП = Форма.КаталогПрограммыПОПДЕЦП;
	
	СтруктураПараметров.КаталогФайлов = Форма.КаталогФайлов;
	СтруктураПараметров.ОписаниеПроверяемыхФайлов = Форма.ОписаниеПроверяемыхФайлов;
	СтруктураПараметров.ПутиКФайлам = Форма.ПутиКФайлам;
	
	Возврат СтруктураПараметров;
	
КонецФункции	

&НаКлиенте
Процедура ПроверитьФайлыНаКлиенте()
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	СтруктураПараметров = ПараметрыПроверкиФайлов(ЭтаФорма);
	
	Оповещение = Новый ОписаниеОповещения("ПроверкаФайловПослеВыполненияДлительнойОперацииНаКлиенте", ЭтотОбъект);
	
	ПерсонифицированныйУчетКлиент.ПроверитьФайлыСтороннимиПрограммами(СтруктураПараметров, АдресХранилища, Оповещение);
КонецПроцедуры	

&НаКлиенте
Процедура ИнициализироватьПроверкуФайловВФоне()
	
	Результат = РезультатПроверкиФайловВДлительнойОперации();
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Результат.ЗаданиеВыполнено Тогда
		ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		АдресХранилища		 = Результат.АдресХранилища;
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиФайловВДлительнойОперации()
	
	НастройкиПроверочныхПрограмм = ПерсонифицированныйУчет.ОбщиеНастройкиПрограммПроверкиОтчетности();
	Если НастройкиПроверочныхПрограмм = Неопределено Тогда 
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось проверить файлы'"));
		Возврат Неопределено;
	КонецЕсли;
	
	СохраненныеФайлы = СохранитьФайлыНаСервере();
	
	СтруктураПараметров = ПараметрыПроверкиФайлов(ЭтаФорма);
	СтруктураПараметров.КаталогФайлов = СохраненныеФайлы.КаталогФайлов;
	СтруктураПараметров.ПутиКФайлам = СохраненныеФайлы.ПутиКФайлам;
	
	СтруктураПараметров.КаталогПрограммыСheckXml = НастройкиПроверочныхПрограмм.КаталогПрограммыCheckXML;
	СтруктураПараметров.КаталогПрограммыСheckUFA = НастройкиПроверочныхПрограмм.КаталогПрограммыCheckUFA;
	СтруктураПараметров.КаталогПрограммыПОПД = НастройкиПроверочныхПрограмм.КаталогПрограммыПОПД;
	СтруктураПараметров.КаталогПрограммыПОПДЕЦП = НастройкиПроверочныхПрограмм.КаталогПрограммыПОПДЕЦП;
	
	НаименованиеЗадания = НСтр("ru = 'Проверка файлов'");
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"ПерсонифицированныйУчет.ПроверитьФайлыСтороннимиПрограммами",
		СтруктураПараметров,
		НаименованиеЗадания);
	
	АдресХранилища = Результат.АдресХранилища;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ПроверкаФайловПослеВыполненияДлительнойОперации();
		
		УдалитьФайлыНаСервере(СохраненныеФайлы);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовПослеПроверки(Форма, КоличествоПротоколовCheckUFA, КоличествоПротоколовCheckXML, КоличествоПротоколовПОПД, КоличествоПротоколовПОПДЕЦП)
	Элементы = Форма.Элементы;
	
	Элементы.СтраницыПротоколовCheckUFA.Видимость = КоличествоПротоколовCheckUFA > 0;
	
	Если КоличествоПротоколовCheckUFA > 1 Тогда 
		Элементы.ПротоколыПроверкиCheckUFA.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ПротоколыПроверкиCheckUFA.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	КонецЕсли;	
	
	Элементы.СтраницыПротоколовCheckXML.Видимость = КоличествоПротоколовCheckXML > 0;
	
	Если КоличествоПротоколовCheckXML > 1 Тогда 
		Элементы.ПротоколыПроверкиCheckXML.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ПротоколыПроверкиCheckXML.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	КонецЕсли;	
	
	Элементы.СтраницыПротоколовПОПД.Видимость = КоличествоПротоколовПОПД > 0;
	
	Если КоличествоПротоколовПОПД > 1 Тогда 
		Элементы.ПротоколыПроверкиПОПД.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ПротоколыПроверкиПОПД.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	КонецЕсли;	
	
	Элементы.СтраницыПротоколовПОПДЕЦП.Видимость = КоличествоПротоколовПОПДЕЦП > 0;
	
	Если КоличествоПротоколовПОПДЕЦП > 1 Тогда 
		Элементы.ПротоколыПроверкиПОПДЕЦП.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	Иначе
		Элементы.ПротоколыПроверкиПОПДЕЦП.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;	
	КонецЕсли;	
	
	Если ?(КоличествоПротоколовCheckUFA > 0, 1, 0) + ?(КоличествоПротоколовCheckXML > 0, 1, 0) + ?(КоличествоПротоколовПОПД > 0, 1, 0) + ?(КоличествоПротоколовПОПДЕЦП > 0, 1, 0) > 1 Тогда
		Элементы.СтраницыПроверочныхПрограмм.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область СохранениеФайлов

&НаСервере
Функция СохранитьФайлыНаСервере()
	
	СохраненныеФайлы = Новый Структура("КаталогФайлов, ПутиКФайлам");
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеВладельцевПутиКФайлу = Новый Соответствие;
	
	СохраненныеФайлы.КаталогФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла(""));	
	
	КаталогФайлов = СохраненныеФайлы.КаталогФайлов;
	СоздатьКаталог(КаталогФайлов);
	
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ПолноеИмяФайла = КаталогФайлов + "\" + ОписаниеФайла.ИмяФайла;
		Если ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПолноеИмяФайла).Имя <> ОписаниеФайла.ИмяФайла Тогда 
			Продолжить;
		КонецЕсли;
		
		Файл = Новый Файл(ПолноеИмяФайла);
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОписаниеФайла.АдресВоВременномХранилище);
		ДвоичныеДанныеФайла.Записать(Файл.ПолноеИмя);
		
		СоответствиеВладельцевПутиКФайлу.Вставить(ОписаниеФайла.Владелец, Файл.ПолноеИмя);
	КонецЦикла;	
	
	СохраненныеФайлы.ПутиКФайлам = Новый ФиксированноеСоответствие(СоответствиеВладельцевПутиКФайлу);
	ПутиКФайлам = СохраненныеФайлы.ПутиКФайлам;
	
	Возврат СохраненныеФайлы;
	
КонецФункции	

&НаКлиенте
Процедура СохранитьФайлыНаКлиенте()
		
	СоответствиеВладельцевПутиКФайлу = Новый Соответствие;

	#Если Не ВебКлиент Тогда
		КаталогФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла(""));
		ВыбранныеФайлы = Новый Массив;
		ВыбранныеФайлы.Добавить(КаталогФайлов);
		
		ПослеВыбораКаталогаДляСохраненияФайлов(ВыбранныеФайлы);
	#Иначе
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ВыборФайла.МножественныйВыбор = Ложь;
		ВыборФайла.Заголовок = НСтр("ru = 'Укажите каталог, для сохранения файлов комплекта.'");
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталогаДляСохраненияФайлов", ЭтотОбъект);
		
		ВыборФайла.Показать(Оповещение);
				
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаДляСохраненияФайлов(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	Если ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;	
	
	ИмяКаталога = ВыбранныеФайлы[0];
	
	КаталогФайлов = ИмяКаталога + Строка(Новый УникальныйИдентификатор);	
	
	Оповещение = Новый ОписаниеОповещения("ПослеСозданияКаталогаДляСохраненияФайлов", ЭтотОбъект);		
	
	НачатьСозданиеКаталога(Оповещение, КаталогФайлов);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеСозданияКаталогаДляСохраненияФайлов(ИмяКаталога, ДополнительныеПараметры) Экспорт
	СоответствиеВладельцевПутиКФайлу = Новый Соответствие;
	
	ПолучаемыеФайлы = Новый Массив;
	Для Каждого ОписаниеФайла Из ОписаниеПроверяемыхФайлов Цикл
		ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла(КаталогФайлов + "\" + ОписаниеФайла.ИмяФайла, ОписаниеФайла.АдресВоВременномХранилище);
		СоответствиеВладельцевПутиКФайлу.Вставить(ОписаниеФайла.Владелец, КаталогФайлов + "\" + ОписаниеФайла.ИмяФайла); 
		ПолучаемыеФайлы.Добавить(ПолучаемыйФайл);
	КонецЦикла;	
	
	ПутиКФайлам = Новый ФиксированноеСоответствие(СоответствиеВладельцевПутиКФайлу);	
	ПолученныеФайлы = Новый Массив;
			                                  
	Если ПолучаемыеФайлы.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеСохраненияФайловНаКлиенте", ЭтотОбъект);
		
		НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, КаталогФайлов, Ложь);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеСохраненияФайловНаКлиенте(ПолученныеФайлы, ДополнительныеПараметры) Экспорт 
	ПроверитьФайлыНаКлиенте();		
КонецПроцедуры	

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура УдалитьФайлыНаСервере(СохраненныеФайлы)
	
	Файл = Новый Файл(СохраненныеФайлы.КаталогФайлов);
	
	Если Файл.Существует() И Файл.ЭтоКаталог() Тогда
		УдалитьФайлы(СохраненныеФайлы.КаталогФайлов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайлыНаКлиенте()
	Файл = Новый Файл;
	
	Оповещение = Новый ОписаниеОповещения("ПослеИнициализацииУдаляемогоКаталога", ЭтотОбъект);
	
	Файл.НачатьИнициализацию(Оповещение, КаталогФайлов);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеИнициализацииУдаляемогоКаталога(Файл, ДополнительныеПараметры) Экспорт
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСуществованияВременногоКаталога", ЭтотОбъект);
	
	Файл.НачатьПроверкуСуществования(Оповещение);
КонецПроцедуры	

&НаКлиенте
Процедура ПослеПроверкиСуществованияВременногоКаталога(Существует, ДополнительныеПараметры) Экспорт 
	Если Существует Тогда
		НачатьУдалениеФайлов(, КаталогФайлов);
	КонецЕсли;		
КонецПроцедуры	


#КонецОбласти

#КонецОбласти
