#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей(Замещение);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьТекущийЭтапРаботы(ЭтотОбъект, Замещение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей(Замещение)
	
	Значения = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(ЭтотОбъект, Замещение, "Кандидат", Истина);
	Если Значения = Неопределено Или Значения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", РегистрыБЗК.ЗаписиНабораИзБазыДанных(ЭтотОбъект, Замещение));
	
КонецПроцедуры

Процедура ОбновитьТекущийЭтапРаботы(НаборЗаписей, Замещение)
	
	Если Не ДополнительныеСвойства.Свойство("ПрежнийНабор") Тогда
		Возврат;
	КонецЕсли;
	
	ПрежнийНабор = ДополнительныеСвойства["ПрежнийНабор"];
	
	Если ПрежнийНабор.Количество() > 0 Или Количество() > 0 Тогда
		Если ОбщегоНазначения.КоллекцииИдентичны(ПрежнийНабор, НаборЗаписей) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	КандидатыМассив = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписей, Замещение, "Кандидат");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КандидатыМассив, ВыгрузитьКолонку("Кандидат"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КандидатыМассив, ПрежнийНабор.ВыгрузитьКолонку("Кандидат"), Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ПодборПерсонала.ОбновитьТекущийЭтапРаботыКандидатов(КандидатыМассив);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли