#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

Процедура СоздатьВТХарактеристикиОбъектовДляФедеральныхМедрегистров(МенеджерВременныхТаблиц, Объекты = Неопределено, ИмяВТ = "ВТХарактеристикиОбъектовДляФедеральныхМедрегистров") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиОбъектов.Объект КАК Объект,
	|	ХарактеристикиОбъектов.Классификатор КАК Классификатор,
	|	ХарактеристикиОбъектов.Характеристика КАК Характеристика,
	|	ЭлементыКлассификаторовФедеральныхМедрегистров.Код КАК ХарактеристикаКод,
	|	ЭлементыКлассификаторовФедеральныхМедрегистров.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	КлассификаторыФедеральныхМедрегистров.Код КАК ИдентификаторКлассификатора
	|ПОМЕСТИТЬ #ВТХарактеристикиОбъектовДляФедеральныхМедрегистров
	|ИЗ
	|	РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
	|		ПО ХарактеристикиОбъектов.Классификатор = КлассификаторыФедеральныхМедрегистров.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторовФедеральныхМедрегистров
	|		ПО ХарактеристикиОбъектов.Характеристика = ЭлементыКлассификаторовФедеральныхМедрегистров.Ссылка
	|ГДЕ
	|	&ОтборПоОбъектам";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ВТХарактеристикиОбъектовДляФедеральныхМедрегистров", ИмяВТ);
	Если ЗначениеЗаполнено(Объекты) Тогда
		Запрос.УстановитьПараметр("Объекты", Объекты);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОбъектам", "Объект В (&Объекты)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоОбъектам", "Истина");
	КонецЕсли;	
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПараметрыОбновленияИсточникаПодключаемыхХарактеристикЗарплатаКадры(ПараметрыОбновления) Экспорт
	
	ПараметрыОбновления.ИмяРегистра = "ХарактеристикиОбъектовДляФедеральныхМедрегистров";
	ПараметрыОбновления.ИдентификаторИсточника = "ФРМР";
	ПараметрыОбновления.ИмяОбъекта = "Объект";
	
	ПараметрыОбновления.ОбновитьНаборХарактеристик = Истина;
	ПараметрыОбновления.ОбновлятьОпеределяемымиЗначениями = Истина;
	
	ПараметрыОбновления.ИмяПланаВидовХарактеристик = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДолжностиБЗКРасширенный.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
	ПараметрыОбновления.ИмяПланаВидовХарактеристик.Добавить(Справочники.ШтатноеРасписание.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяТаблицаХарактеристикиОбъектовПоМедРегистру() Экспорт
	
	ХарактеристикиОбъектов = Новый ТаблицаЗначений;
			  
	ХарактеристикиОбъектов.Колонки.Добавить("ТипОбъектаМетаданных");
	ХарактеристикиОбъектов.Колонки.Добавить("Классификатор", Новый ОписаниеТипов("СправочникСсылка.КлассификаторыФедеральныхМедрегистров"));
	ХарактеристикиОбъектов.Колонки.Добавить("НаименованиеКлассификатора", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ХарактеристикиОбъектов.Колонки.Добавить("ПредставлениеХарактеристики", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ХарактеристикиОбъектов.Колонки.Добавить("КодКлассификатора", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	ХарактеристикиОбъектов.Колонки.Добавить("ЭлементыСопоставимы", Новый ОписаниеТипов("Булево"));
	ХарактеристикиОбъектов.Колонки.Добавить("ИДСправочника", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
	
	Возврат ХарактеристикиОбъектов;
	
КонецФункции

// Возвращает таблицу, описывающую характеристики объекта метаданных по классификаторам МедРегистра.
//
Функция ХарактеристикиОбъектаМетаданныхДляРегистра(Знач ТипОбъектаМетаданных, ТолькоСопоставимые = Ложь) Экспорт
	
	ПолнаяТаблицаХарактеристик = ХарактеристикиОбъектовМетаданныхДляМедРегистра(); 
	
	СтруктураОтбора = Новый Структура("ТипОбъектаМетаданных", ТипОбъектаМетаданных);
	
	Если ТолькоСопоставимые Тогда
		СтруктураОтбора.Вставить("ЭлементыСопоставимы", Истина);
	КонецЕсли;
		
	Возврат ПолнаяТаблицаХарактеристик.Скопировать(СтруктураОтбора);
	
КонецФункции
	
// Возвращает таблицу, описывающую характеристики объектов метаданных по классификаторам МедРегистра.
//
Функция ХарактеристикиОбъектовМетаданныхДляМедРегистра() Экспорт 
	
	ХарактеристикиОбъектов = ПустаяТаблицаХарактеристикиОбъектовПоМедРегистру();
	
	СвойстваКлассификаторов = Новый Соответствие;
	
	СправочникиФРМР = Справочники.КлассификаторыФедеральныхМедрегистров.ПолучитьСправочникиФРМРИзМакета();
	Сч=1;
	Для Каждого СправочникФРМР из СправочникиФРМР Цикл
		Если НЕ ЗначениеЗаполнено(СправочникФРМР.ТипОбъектаМетаданных)
			ИЛИ НЕ ЗначениеЗаполнено(СправочникФРМР.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		ТипыОбъектовМетаданных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СправочникФРМР.ТипОбъектаМетаданных, ",");
		
		Для Каждого ТипОбъектаМетаданных из ТипыОбъектовМетаданных Цикл
			НоваяСтрока = ХарактеристикиОбъектов.Добавить();
			НоваяСтрока.Классификатор 				= СправочникФРМР.Ссылка;
			НоваяСтрока.НаименованиеКлассификатора	= СправочникФРМР.НаименованиеКлассификатора;
			НоваяСтрока.КодКлассификатора			= СправочникФРМР.КодКлассификатора;
			НоваяСтрока.ПредставлениеХарактеристики = СправочникФРМР.НаименованиеКлассификатора;
			НоваяСтрока.ТипОбъектаМетаданных 		= Тип(ТипОбъектаМетаданных);
			НоваяСтрока.ЭлементыСопоставимы 		= СправочникФРМР.ЭлементыСопоставимы;
			НоваяСтрока.ИДСправочника 				= "СправочникФРМР"+Формат(Сч,"ЧГ=");
			Сч=Сч+1;
		КонецЦикла;
		
	КонецЦикла;
	
	ХарактеристикиОбъектов.Сортировать("НаименованиеКлассификатора Возр");
	
	Возврат ХарактеристикиОбъектов;
	
КонецФункции	

// Сопоставляет элементы классификаторов МедРегистра со значениями/элементами объекта метаданных.
//
Процедура УстановитьХарактеристикиЗначенийОбъектаМетаданных(СвойстваОбъекта, ТаблицаХарактеристик = Неопределено) Экспорт
	
	Если ТаблицаХарактеристик = Неопределено Тогда
		СтрокаТипОбъекта	 = СвойстваОбъекта.ТипОбъекта;
		ТаблицаХарактеристик = ХарактеристикиОбъектаМетаданныхДляРегистра(Тип(СтрокаТипОбъекта), Истина);
	КонецЕсли;
	
	Если ТаблицаХарактеристик.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Для каждого Характеристика Из ТаблицаХарактеристик Цикл
		
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ 
			|
			|";
			
		КонецЕсли;
			
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ РАЗЛИЧНЫЕ
		                              |	КлассификаторХарактеристики.Ссылка КАК Классификатор,
		                              |	ПРЕДСТАВЛЕНИЕ(СписокОбъектов.Ссылка) КАК НаименованиеПоПредставлению,
		                              |	СписокОбъектов.Ссылка КАК Ссылка
		                              |ИЗ
		                              |	&ПолноеИмяТаблицы КАК СписокОбъектов
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			ХарактеристикиОбъектов.Классификатор КАК Классификатор,
		                              |			ХарактеристикиОбъектов.Объект КАК Объект,
		                              |			ХарактеристикиОбъектов.Характеристика КАК Характеристика
		                              |		ИЗ
		                              |			РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектов
		                              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
		                              |				ПО ХарактеристикиОбъектов.Классификатор = КлассификаторыФедеральныхМедрегистров.Ссылка
		                              |					И (КлассификаторыФедеральныхМедрегистров.Код = ""_КодКлассификатораФРМР"")) КАК КлассификацияОбъектов
		                              |		ПО СписокОбъектов.Ссылка = КлассификацияОбъектов.Объект
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторХарактеристики
		                              |		ПО (КлассификаторХарактеристики.Код = ""_КодКлассификатораФРМР"")
		                              |ГДЕ
		                              |	ЕСТЬNULL(КлассификацияОбъектов.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "_КодКлассификатораФРМР", Характеристика.КодКлассификатора);

	КонецЦикла;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПолноеИмяТаблицы", СвойстваОбъекта.ПолноеИмя);
	Запрос = Новый Запрос(ТекстЗапроса);
	ТаблицаОбъектов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаОбъектов.Количество() > 0 Тогда
			
		ТаблицаОбъектов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(500));
		Для Каждого ТекущийОбъект Из ТаблицаОбъектов Цикл
			ТекущийОбъект.Наименование = Лев(ТекущийОбъект.НаименованиеПоПредставлению, 500);
		КонецЦикла;
		ТаблицаОбъектов.Колонки.Удалить("НаименованиеПоПредставлению");	
		
		Запрос.УстановитьПараметр("ТаблицаОбъектов", ТаблицаОбъектов);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаОбъектов.Классификатор КАК Классификатор,
		               |	ТаблицаОбъектов.Наименование КАК Наименование,
		               |	ТаблицаОбъектов.Ссылка КАК Ссылка
		               |ПОМЕСТИТЬ ВТОбъекты
		               |ИЗ
		               |	&ТаблицаОбъектов КАК ТаблицаОбъектов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Объекты.Ссылка КАК Объект,
		               |	Объекты.Классификатор КАК Классификатор,
		               |	ЭлементыКлассификатора.Ссылка КАК Характеристика
		               |ИЗ
		               |	ВТОбъекты КАК Объекты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификатора
		               |		ПО Объекты.Наименование = ЭлементыКлассификатора.НаименованиеПолное
		               |			И Объекты.Классификатор = ЭлементыКлассификатора.Владелец";
		
		ВыборкаОбъектов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОбъектов.Следующий() Цикл
			
			НаборЗаписей = РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Классификатор.Установить(ВыборкаОбъектов.Классификатор);
			НаборЗаписей.Отбор.Объект.Установить(ВыборкаОбъектов.Объект);
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), ВыборкаОбъектов);
			НаборЗаписей.Записать();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Сопоставляет элементы определенных классификаторов МедРегистра со значениями/элементами объектов метаданных.
//
Процедура УстановитьХарактеристикиОбъектовПоКодамКлассификаторов(КодыКлассификаторов) Экспорт
	
	ТаблицаХарактеристик = ПустаяТаблицаХарактеристикиОбъектовПоМедРегистру();
	
	ПолнаяТаблицаХарактеристик = ХарактеристикиОбъектовМетаданныхДляМедРегистра();
	
	Для Каждого КодКлассификатора Из КодыКлассификаторов Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПолнаяТаблицаХарактеристик.Скопировать(Новый Структура("КодКлассификатора, ЭлементыСопоставимы", КодКлассификатора, Истина)), ТаблицаХарактеристик); 
	КонецЦикла;	
	
	МассивОбъектовМетаданных = ТаблицаХарактеристик.ВыгрузитьКолонку("ТипОбъектаМетаданных");	
	МассивОбъектовМетаданных = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОбъектовМетаданных);
	
	Для Каждого ОбъектМетаданных Из МассивОбъектовМетаданных Цикл 
		
		СвойстваОбъекта = СвойстваОбъектаМетаданных(ОбъектМетаданных);
		ТекущиеХарактеристики = ТаблицаХарактеристик.Скопировать(Новый Структура("ТипОбъектаМетаданных", ОбъектМетаданных));
		
		УстановитьХарактеристикиЗначенийОбъектаМетаданных(СвойстваОбъекта, ТекущиеХарактеристики);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СвойстваОбъектаМетаданных(Тип) Экспорт

	Если Не ОбщегоНазначения.ЭтоСсылка(Тип) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СвойстваОбъекта = Новый Структура;
	
	СвойстваОбъекта.Вставить("ТипОбъекта",           Неопределено);
	СвойстваОбъекта.Вставить("ПолноеИмя",            "");
	СвойстваОбъекта.Вставить("ПолныйСиноним",        "");
	СвойстваОбъекта.Вставить("ПредставлениеОбъекта", "");
	СвойстваОбъекта.Вставить("ЭтоСправочник",        Истина);
	СвойстваОбъекта.Вставить("Иерархический",        Ложь);
	СвойстваОбъекта.Вставить("ИерархияГрупп",        Ложь);
	СвойстваОбъекта.Вставить("ЕстьВладелец",         Ложь);
	СвойстваОбъекта.Вставить("ТипВладельца",         Неопределено);
	
	МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
	СвойстваОбъекта.ПолноеИмя = МетаданныеТипа.ПолноеИмя();
	
	ЧастиПолногоИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СвойстваОбъекта.ПолноеИмя, ".");

	Если ЧастиПолногоИмени[0] = "Справочник" Тогда
		
		СвойстваОбъекта.ТипОбъекта = "СправочникСсылка." + ЧастиПолногоИмени[1];
		СвойстваОбъекта.ПолныйСиноним = МетаданныеТипа.Представление();
		СвойстваОбъекта.ПредставлениеОбъекта = МетаданныеТипа.ПредставлениеОбъекта;
		
		Если МетаданныеТипа.Иерархический Тогда
			 СвойстваОбъекта.Иерархический = Истина;
			 СвойстваОбъекта.ИерархияГрупп = (МетаданныеТипа.ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов);
		КонецЕсли;
		 
		Если МетаданныеТипа.Владельцы.Количество() Тогда
		    СвойстваОбъекта.ЕстьВладелец = Истина;
			Если ЧастиПолногоИмени[1] = "ОбразованиеФизическихЛиц" Тогда
				СвойстваОбъекта.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
			Иначе
				СвойстваОбъекта.ТипВладельца = Новый ОписаниеТипов("СправочникСсылка.Организации");
			КонецЕсли;
		КонецЕсли;
		 
	ИначеЕсли ЧастиПолногоИмени[0] = "Перечисление" Тогда
		
		СвойстваОбъекта.ТипОбъекта = "ПеречислениеСсылка." + ЧастиПолногоИмени[1];
		СвойстваОбъекта.ПолныйСиноним = МетаданныеТипа.Представление();
		СвойстваОбъекта.ПредставлениеОбъекта = МетаданныеТипа.Синоним;
		СвойстваОбъекта.ЭтоСправочник = Ложь;
		
	ИначеЕсли ЧастиПолногоИмени[0] = "ПланВидовРасчета" Тогда
		
		СвойстваОбъекта.ТипОбъекта = "ПланВидовРасчетаСсылка." + ЧастиПолногоИмени[1];
		СвойстваОбъекта.ПолныйСиноним = МетаданныеТипа.Представление();
		СвойстваОбъекта.ПредставлениеОбъекта = МетаданныеТипа.Синоним;
		
	КонецЕсли;
	
	Если ПустаяСтрока(СвойстваОбъекта.ПредставлениеОбъекта) Тогда
		СвойстваОбъекта.ПредставлениеОбъекта = СвойстваОбъекта.ПолныйСиноним;
	КонецЕсли;
	
	Возврат СвойстваОбъекта;

КонецФункции 

// Возвращает таблицу со всеми характеристиками объекта и заполненными значениями.
//
// Параметры:
//   Объект - СправочникСсылка/ПеречислениеСсылка.
// 
// Возвращаемое значение:
//   ТаблицаЗначений - таблица значений с колонками:
//     * Объект - СправочникСсылка/ПеречислениеСсылка
//     * Классификатор - СправочникСсылка.КлассификаторыФедеральныхМедрегистров 
//     * Характеристика - СправочникСсылка.ЭлементыКлассификаторовМедРегистра.
//
Функция ЗаполненныеХарактеристикиОбъектаМетаданных(Объект) Экспорт

	ТаблицаХарактеристик = ХарактеристикиОбъектаМетаданныхДляРегистра(ТипЗнч(Объект));
	
	// Выберем все возможные классификаторы характеризующие данный объект и уже введенные значения.
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
       |	&ЭлементСправочника КАК Объект,
       |	КлассификаторыФедеральныхМедрегистров.Ссылка КАК Классификатор,
       |	ЕСТЬNULL(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) КАК Характеристика
       |ИЗ
       |	Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров
       |		ПО (ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект = &ЭлементСправочника)
       |			И КлассификаторыФедеральныхМедрегистров.Ссылка = ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор
       |ГДЕ
       |	КлассификаторыФедеральныхМедрегистров.Ссылка В(&Классификаторы)";
				   
	Запрос.УстановитьПараметр("Классификаторы", 	ТаблицаХарактеристик.ВыгрузитьКолонку("Классификатор"));
	Запрос.УстановитьПараметр("ЭлементСправочника", Объект);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Процедура ОбновитьПодключаемыеХарактеристики(ИспользоватьПодключаемыеХарактеристики, ПараметрыОбновления = Неопределено) Экспорт
	
	ИсточникиХарактеристик = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ХарактеристикиОбъектовДляФедеральныхМедрегистров");
	
	ПодключаемыеХарактеристикиЗарплатаКадры.ОбновитьНаборыПодключаемыхХарактеристик(
		ИспользоватьПодключаемыеХарактеристики, ИсточникиХарактеристик, ПараметрыОбновления);
	
КонецПроцедуры


Процедура ОбновитьНаборыПодключаемыхХарактеристикОпределяемымиЗначениями(ИмяПланаВидовХарактеристик,ИспользоватьПодключаемыеХарактеристики = Истина, ТаблицаХарактеристик = Неопределено, Объекты = Неопределено, ПараметрыОтложенногоОбновления = Неопределено) Экспорт
	
	ИмяПВХДолжности =  ДолжностиБЗКРасширенный.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();
	ИмяПВХПозиции =  Справочники.ШтатноеРасписание.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры();
	ТипОбъекта = Неопределено;
	Если ИмяПланаВидовХарактеристик = ИмяПВХДолжности Тогда
		ТипОбъекта = Тип("СправочникСсылка.Должности");
	ИначеЕсли ИмяПланаВидовХарактеристик = ИмяПВХПозиции Тогда
		ТипОбъекта = Тип("СправочникСсылка.ШтатноеРасписание");
	КонецЕсли;
	
	ИдентификаторыИсточника = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ФРМР");

	ФильтрОбъектов = Неопределено;
	Если Объекты <> Неопределено Тогда
		Если ТипЗнч(Объекты) <> Тип("Массив") Тогда
			Объекты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объекты);
		КонецЕсли;
		
		ФильтрОбъектов = Новый Массив;
		Для Каждого Объект Из Объекты Цикл
			Если ТипЗнч(Объект) = ТипОбъекта Тогда
				Если ФильтрОбъектов.Найти(Объект) = Неопределено Тогда
					ФильтрОбъектов.Добавить(Объект); 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ФильтрОбъектов.Количество() = 0 Тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьПодключаемыеХарактеристики = Истина И ТаблицаХарактеристик = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВсеОбъекты", ФильтрОбъектов = Неопределено);
		Запрос.УстановитьПараметр("ФильтрОбъектов", ФильтрОбъектов);
		Запрос.УстановитьПараметр("ИмяПВХДолжности", ДолжностиБЗКРасширенный.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
		Запрос.УстановитьПараметр("ИмяПВХПозиции", Справочники.ШтатноеРасписание.ИмяПланаВидовПодключаемыхХарактеристикЗарплатаКадры());
		Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);

		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект) = ТИП(Справочник.Должности)
		|			ТОГДА &ИмяПВХДолжности
		|		КОГДА ТИПЗНАЧЕНИЯ(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект) = ТИП(Справочник.ШтатноеРасписание)
		|			ТОГДА &ИмяПВХПозиции
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ИмяПВХ,
		|	ПредставленияХарактеристик.Наименование КАК Свойство,
		|	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект КАК Объект,
		|	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Характеристика КАК Значение,
		|	""ФРМР"" КАК ИдентификаторИсточника
		|ИЗ
		|	РегистрСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров КАК ХарактеристикиОбъектовДляФедеральныхМедрегистров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыФедеральныхМедрегистров КАК ПредставленияХарактеристик
		|		ПО ХарактеристикиОбъектовДляФедеральныхМедрегистров.Классификатор = ПредставленияХарактеристик.Ссылка
		|ГДЕ
		|	(&ВсеОбъекты
		|			ИЛИ ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект В (&ФильтрОбъектов))
		|	И ТИПЗНАЧЕНИЯ(ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект) = &ТипОбъекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПредставленияХарактеристик.Наименование,
		|	ХарактеристикиОбъектовДляФедеральныхМедрегистров.Объект";
		ТаблицаХарактеристик = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	ПодключаемыеХарактеристикиЗарплатаКадры.ОбновитьНаборыПодключаемыхХарактеристикОпределяемымиЗначениями(
		ИдентификаторыИсточника,
		ИмяПланаВидовХарактеристик,
		ИспользоватьПодключаемыеХарактеристики,
		ТаблицаХарактеристик,
		ФильтрОбъектов,
		ПараметрыОтложенногоОбновления);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли	