// @strict-types

#Область СлужебныеПроцедурыИФункции

// Набор регистров аналитики данных.
// 
// Возвращаемое значение:
//  Массив из Строка
Функция НаборРегистровОбновленияАналитикиДанных() Экспорт
	
	НаборРегистров = Новый Массив;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.АналитикаДанных") Тогда
		МодульКадровыйУчетАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетАналитикаДанных");
		МодульКадровыйУчетАналитикаДанных.ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ПриИнициализацииНаборовРегистровОбновленияАналитикиДанных(НаборРегистров);
	КонецЕсли;
	
	Возврат НаборРегистров;
	
КонецФункции

#Область ОбновлениеИнформационнойБазы

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.АналитикаДанных") Тогда
		МодульКадровыйУчетАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетАналитикаДанных");
		МодульКадровыйУчетАналитикаДанных.ЗарегистрироватьОбработчикиОбновления(Обработчики);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ЗарегистрироватьОбработчикиОбновления(Обработчики);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ЗарегистрироватьОбработчикиОбновления(Обработчики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбменДанными

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьТаблицуЗависимыхДанных.
Процедура ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ИспытательныйСрокСотрудников.АналитикаДанных") Тогда
		МодульИспытательныйСрокСотрудниковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ИспытательныйСрокСотрудниковАналитикаДанных");
		МодульИспытательныйСрокСотрудниковАналитикаДанных.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.АналитикаДанных") Тогда
		МодульКадровыйУчетАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетАналитикаДанных");
		МодульКадровыйУчетАналитикаДанных.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ПриЗаполненииТаблицыЗависимыхДанныхДляОбмена(ЗависимыеДанные);
	КонецЕсли;
	
КонецПроцедуры

// См. СинхронизацияДанныхЗарплатаКадрыИнтеграцияПодсистем.ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзлаРИБ.
Процедура ЗаполнитьЗависимыеДанныеПослеСозданияНовогоУзла(ПараметрыОбновления) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.АналитикаДанных") Тогда
		МодульКадровыйУчетАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетАналитикаДанных");
		МодульКадровыйУчетАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ПриНачальномЗаполненииПодсистемыАналитикаДанных(ПараметрыОбновления);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура ПриОбновленииАналитикиДанных() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровыйУчет.АналитикаДанных") Тогда
		МодульКадровыйУчетАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("КадровыйУчетАналитикаДанных");
		МодульКадровыйУчетАналитикаДанных.ПриОбновленииАналитикиДанных();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОстаткиОтпусков.АналитикаДанных") Тогда
		МодульОстаткиОтпусковАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ОстаткиОтпусковАналитикаДанных");
		МодульОстаткиОтпусковАналитикаДанных.ПриОбновленииАналитикиДанных();
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала.АналитикаДанных") Тогда
		МодульПодборПерсоналаАналитикаДанных = ОбщегоНазначения.ОбщийМодуль("ПодборПерсоналаАналитикаДанных");
		МодульПодборПерсоналаАналитикаДанных.ПриОбновленииАналитикиДанных();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
